{"quest":{"name":"An Egi by Any Other Name","location":"Limsa Lominsa","id":67896,"patch":3.5,"sort":520,"unlocksFunction":1,"eventIcon":71341,"issuer":1000909,"target":1000909,"genre":91,"journal":["Thubyrgeim desires your help with an experiment.","Having read through Y'mhitra's research on summoners, Thubyrgeim requests your assistance with an experiment in the guild's practice area.","Thubyrgeim theorizes that you may be able use the technique required for summoning egi to alter the appearance of your various egi. You succeed in summoning an Ifrit-Egi that takes the form of a Ruby Carbuncle─marking the experiment a success! Thubyrgeim bids you head upstairs once more to discuss the implications of the experiment.","An enthused Thubyrgeim tells you that this experiment suggests there may still be much to learn about arcane entities. She bids you farewell and encourages you to make use of your newfound ability."],"objectives":["Wait for Thubyrgeim in the guild's practice area.","Speak with Thubyrgeim."],"dialogue":[{"name":"THUBYRGEIM","text":"Well, if it isn't <span class=\"highlight\">Forename</span>. Precisely the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I wished to see."},{"name":"THUBYRGEIM","text":"You will recall Y'mhitra of the Sons of Saint Coinach. Well, she has recently finished compiling her research into summoning, and was kind enough to send a copy of it to our guild. I was pleased to note that you are listed as a collaborator."},{"name":"THUBYRGEIM","text":"I must say it is <span class=\"emphasis\">quite</span> a fascinating read, especially the section covering those essences of primals called egi. You are able to manifest the beings, yes?"},{"name":"THUBYRGEIM","text":"Wonderful. In which case, I should like your assistance with an experiment. If you are willing, pray join me in the practice area. I will reveal the details there."},{"name":"THUBYRGEIM","text":"Pray go on ahead to the practice area. I will reveal the details of the experiment there."},{"name":"THUBYRGEIM","text":"My apologies for the wait."},{"name":"THUBYRGEIM","text":"To begin with, might I ask you to call forth an egi? I should very much like to see one with mine own eyes. Mayhap the Ifrit-Egi would be suitable─I understand that it was the first such being to be summoned."},{"name":"THUBYRGEIM","text":"Yes, a most impressive being indeed. Created, according to Y'mhitra, in the image of the entity which one most closely associates with fire: Ifrit."},{"name":"THUBYRGEIM","text":"It is my hypothesis that the same fundamental principle could be employed to alter the form of an egi, by calling to mind another image."},{"name":"THUBYRGEIM","text":"Pray summon the Ifrit-Egi again, but this time focus your consciousness upon Carbuncle. It shouldn't be difficult, given the bond you share."},{"name":"THUBYRGEIM","text":"Brilliant! My theory holds!"},{"name":"THUBYRGEIM","text":"Whilst it takes the form of Carbuncle, there is no mistaking its aetherial composition."},{"name":"THUBYRGEIM","text":"I should not imagine that the abilities it wields have changed─for all intents and purposes, it is still an Ifrit-Egi. But now we know that there is no limit to an egi's appearance."},{"name":"THUBYRGEIM","text":"Well, I must be returning to my post. Let us continue this upstairs."},{"name":"THUBYRGEIM","text":"<span class=\"highlight\">Forename</span>, you have my thanks for indulging me. This experiment has unearthed a new world of possibility for arcane entities, and I hope you will find use for the discovery."},{"name":"SYSTEM","text":"An egi's outward appearance can now be altered by using <span class=\"highlight\">/petglamour</span>."},{"name":"SYSTEM","text":"For example, if you want your Garuda-Egi to appear as if it were Ruby Carbuncle, use the text command <span class=\"highlight\">/petglamour “garuda-egi” “ruby carbuncle”</span>."},{"name":"SYSTEM","text":"For details, enter <span class=\"highlight\">/? /petglamour</span>."}],"reward":{"gil":461,"xp":0},"reqs":{"jobs":[{"lvl":50,"id":28}],"quests":[66632]}},"partials":[{"type":"npc","id":"1000909","obj":{"i":1000909,"n":"Thubyrgeim","l":29,"q":15,"t":"Guildmaster"}},{"type":"quest","id":"66632","obj":{"i":66632,"n":"Primal Burdens","g":155,"l":"Gridania","s":6,"f":1}}]}