{"quest":{"name":"The Obvious Solution","location":"The Rising Stones","id":67892,"patch":3.56,"sort":16,"icon":100615,"eventIcon":71201,"issuer":1017749,"target":1012395,"involved":[1000460,1012644,1017727],"genre":5,"journal":["The interminable wait for news from Gridania seems to be taking its toll on Alisaie.","After receiving a timely message via linkpearl, Alisaie informs you that the Alliance council will soon be reconvening in Gridania. Make your way to Nophica's Altar, and announce your arrival to the silent conjurer.","As the council debates how best to combat the incalculable threat contained within the cocoon of light, an unexpected figure seizes his moment to take the stage: Nero tol Scaeva. The disgraced imperial engineer proceeds to proffer what might kindly be termed a “bold” solution to the problem, and is duly ridiculed by Cid. The Alliance leaders, however, are not so quick to dismiss the man's proposal, anything being preferable to another Calamity, and they grudgingly agree to send a contingent to awaken the infamous Allagan weapon known as “Omega.” Trouble Alphinaud for his thoughts on this surprising turn of events.","It is plain that Alphinaud harbors grave misgivings about the timing of Nero's reappearance. Press him on how best to proceed."],"objectives":["Speak with the silent conjurer at Nophica's Altar.","Speak with Alphinaud."],"dialogue":[{"name":"ALISAIE","text":"Ah, <span class=\"highlight\">Forename</span>. I wish I had more to tell you, but the situation in the East Shroud remains largely unchanged."},{"name":"ALISAIE","text":"...Meaning we still have no idea how long it will be before─"},{"name":"ALISAIE","text":"A communication from the Alliance! One moment."},{"name":"ALISAIE","text":"...Yes, of course. Our representatives will be present. My thanks."},{"name":"ALISAIE","text":"Word from Gridania: the council will shortly be reconvened. The Alliance leaders have already begun to assemble."},{"name":"ALPHINAUD","text":"They wish to discuss the primal, of course. As of Y'shtola's last report, the cocoon yet hung above the Wall, unchanged..."},{"name":"ALISAIE","text":"Yes. But the Elder Seedseer doubtless shares our concerns about how long it will remain so. I am told that Cid Garlond has been called in to add his expertise to proceedings."},{"name":"ALPHINAUD","text":"A wise decision. The more minds we have working on this, the better."},{"name":"ALISAIE","text":"Well then, I suggest we leave the Rising Stones in Tataru's capable hands and make haste for the Lotus Stand."},{"name":"TATARU","text":"Let's see here...<br>Riol's report needs to be filed, Alianne has requested additional supplies, and then there's─ Oh! Don't mind me! Everything's under control!"},{"name":"SILENTCONJURER","text":"Welcome, Warrior of Light. This way, if you please."},{"name":"ALPHINAUD","text":"Well, that was a rather unexpected development, and one which raises a number of questions...not least among them how Nero chanced to learn of the council meeting in the first place."}],"reward":{"gil":1182,"items":[{"id":17629}],"xp":16740},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67891]},"next":[67893]},"partials":[{"type":"npc","id":"1017749","obj":{"i":1017749,"n":"Alisaie","l":481,"q":1}},{"type":"npc","id":"1012395","obj":{"i":1012395,"n":"Alphinaud","l":53,"q":4}},{"type":"npc","id":"1000460","obj":{"i":1000460,"n":"Silent Conjurer","l":53,"q":14}},{"type":"npc","id":"1012644","obj":{"i":1012644,"n":"Tataru","l":481,"q":2}},{"type":"npc","id":"1017727","obj":{"i":1017727,"n":"Alphinaud","l":481,"q":1}},{"type":"item","id":"17629","obj":{"i":17629,"n":"Steel Reason Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"67891","obj":{"i":67891,"n":"Louisoix's Finest Student","g":5,"l":"East Shroud","s":15}},{"type":"quest","id":"67893","obj":{"i":67893,"n":"The Greater Obeisance","g":5,"l":"Gridania","s":17}}]}