{"quest":{"name":"Where Shadows Reign","location":"The Sea of Clouds","id":67909,"patch":3.5,"sort":5,"icon":112203,"unlocksFunction":1,"eventIcon":71341,"issuer":1016130,"target":1018079,"involved":[1018060,1018061,1018062,1018063,1018064,1018065,1018066,1018068,1018069,1018070,1018074,1018075,1018076,1018077,1018078,1018080,1018081,1018082],"genre":18,"journal":["Stacia has been searching for you at Cait Sith's behest.","Stacia hails you on Coldwind, and explains that Cait Sith has made some significant discoveries in the recovered Mhachi tome. It seems the feline familiar is eager for you to return to the Parrock so that he can share his revelations with you and the Redbill crew. Fly over to the sky pirates' hideaway, and speak with Cait Sith inside Leofard's chambers.","Cait Sith once more holds court atop Leofard's table, and reveals the history behind his master, High Voidmage Cessair, and the summoning of Diabolos. As if in response to the mention of his name, the bat-winged voidsent descends upon the Parrock, and, after a decidedly one-sided battle, seizes the Nullstone scepter from Cait Sith's paws. Diabolos then threatens to tear the Parrock from the sky, only to withdraw when Radlia and a fleet of Talons arrive to reinforce the Redbills. Speak with the injured Leofard, and discuss what is to be done in the aftermath of the fiend's attack.<br><br>※The Parrock can be reached from the Redbill standard on Coldwind.","With the secrets of the Nullstone's power now revealed to him, Cait Sith is desperate to recover the relic from Diabolos's clutches and carry out the will of his long-dead master. The familiar is convinced that the island where Radlia uncovered the Mhachi tome is the logical location of the fiend's stronghold, and counsels a swift and sudden assault. Reasoning that Leofard's injuries will only endanger the mission, however, Cait Sith instead recruits Radlia and her crew to escort you to the floating haven. Gather your party of battle-hardened adventurers, and ride the winds into the voidsent's lair!<br><br>※Dun Scaith can be accessed via the Duty Finder.","You have recovered the Nullstone and defeated the nightmarish Diabolos. Make your way back to the Parrock.","Despite besting Diabolos in combat, the wily voidsent is not so easily banished. Even as the fiend stands poised to flee with the Nullstone in hand, however, Leofard's unexpected and forceful arrival turns the tables in your favor. You retrieve the artifact for Cait Sith, and the Mhachi familiar unleashes its power upon Diabolos. With your demonic foe annihilated, it is time to return to the Parrock and discuss events with the Redbills' irrepressible captain.<br><br>※The Parrock can be reached from the Redbill standard on Coldwind.","Leofard appears happy with your victory over Diabolos, but mourns the loss of his beloved airship, the <span class=\"emphasis\">Raimille</span>. The captain's eyes take on a distant look as he loses himself in distant memories..."],"objectives":["Speak with Cait Sith in Leofard's chambers.","Speak with Leofard at the Parrock.","Enter Dun Scaith.","Speak with Leofard at the Parrock."],"dialogue":[{"name":"STACIA","text":"<span class=\"highlight\">Forename</span>! Cait Sith just sent me out to find you! ...You've a proper knack for showin' up at just the right time, you know that?"},{"name":"STACIA","text":"Anyway. Cait Sith cracked open that tome what we got from Radlia, and has been studyin' all the Nullstone's secrets."},{"name":"STACIA","text":"He thinks he may be onto somethin' important─not just concernin' Diabolos and the Shadow Queen, but also the cat himself."},{"name":"STACIA","text":"Come on back to the Parrock, and we can all hear what he has to say together."},{"name":"STACIA","text":"You don't need me to remind you how to reach the Parrock, do you? It's just a short flight from the standard there."},{"name":"LEOFARD","text":"Ugh, thank the winds you're here at last. The furball refused to share until you'd arrived."},{"name":"UTATA","text":"Cait Sith has had the darkest look on his face..."},{"name":"STACIA","text":"Thanks for comin'. Now let's ask Cait Sith what this is all about..."},{"name":"CAITSITH","text":"As I suspected, this tome was penned by a Mhachi sorcerer of superior standing. As well as detailing the methods by which the full power of the Nullstone might be unleashed, its pages also contain a number of revelations concerning my master, High Voidmage Cessair."},{"name":"CAITSITH","text":"If these histories are to be trusted, then it seems that Cessair herself was responsible for summoning Diabolos!"},{"name":"STACIA","text":"But...I thought you said your master was opposed to supportin' the war effort. Why would she be the one to call up that bat-winged monster?"},{"name":"CAITSITH","text":"Cessair only agreed to the ritual as a means to bring the conflict to an early resolution. From what I can glean from these passages, Diabolos was intended as a bluff─a threat that was never to be exercised."},{"name":"CAITSITH","text":"But those arrogant <span class=\"emphasis\">imbeciles</span> ignored my master's carefully laid restrictions, and elected to unleash the fiend upon Amdapor. It was when Cessair moved to protest this act that she was branded a traitor and imprisoned!"},{"name":"CAITSITH","text":"Once they had contained the “opposition,” the voidmages studied all manner of otherworldly arts at the taloned feet of their new pet..."},{"name":"CAITSITH","text":"...The most dangerous of which was the rite for summoning Scathach, and the method for chaining her power."},{"name":"CAITSITH","text":"Yet even after all they had perpetrated, these ambitious fools had the gall to come crawling to Cessair when the coming of the great floods was predicted. They begged her to take control of the Void Ark, for the “salvation of the Mhachi people.”"},{"name":"CAITSITH","text":"As you saw for yourself, however, the energies of the Shadow Queen broke loose and turned the vessel into a derelict nest of voidsent. It seems obvious now that the arts taught by Diabolos were deliberately flawed..."},{"name":"CAITSITH","text":"The only saving grace in all this madness was when that damnable fiend was sealed away by the white mages of Amdapor. I shudder to think what would have happened had he been reunited with his queen."},{"name":"LEOFARD","text":"So now, fifteen hundred years later, Diabolos is lookin' to finish what he started? I thought the bat-faced bastard was just some opportunistic underling, but it turns out he's the main villain behind this whole mess..."},{"name":"CAITSITH","text":"Were Cessair alive today, she would accept responsibility for unleashing Diabolos upon the world. As the high voidmage's familiar, it is my duty to act in her stead!"},{"name":"CAITSITH","text":"I have deciphered the secrets of the Nullstone, and with its undiluted power shall I erase Diabolos from existence!"},{"name":"LEOFARD","text":"...Heh. I like your spirit, puss, but try not to rush in too quickly, eh? Gettin' yourself killed won't do us─or your master─any good."},{"name":"STACIA","text":"Wait, wait, wait! No one's rushin' in anywhere just yet! Or have you forgotten that we're still in the middle of scoutin' out the fiend's lair?"},{"name":"STACIA","text":"We've got the compass to go by, aye, but who knows what kind of place it'll lead us to or how many demons'll be lyin' in wait when we get there. We fly in with our eyes open, or risk gettin' slaughtered just like the Talons!"},{"name":"CAITSITH","text":"Oh, yes, speaking of which, the tome made mention of a potential location for─"},{"name":"STACIA","text":"Leofard!"},{"name":"LEOFARD","text":"...Ouch.<br>Behind... He's behind you!"},{"name":"CAITSITH","text":"Nyah! Curse you, fiend!"},{"name":"DIABOLOS","text":"...At last. At long last!"},{"name":"CAITSITH","text":"&lt;cough&gt; This is far from over, demon! We'll not allow an abomination like the Shadow Queen to rule this world!"},{"name":"DIABOLOS","text":"...Then thou knowest naught of ruling. It is might which decideth dominion."},{"name":"DIABOLOS","text":"But believe what thou mayest, frail creature. You are playthings. Your screams of denial shall amuse me as I send this rock and all upon it to shatter upon the ground below..."},{"name":"STACIA","text":"Gods, is that Radlia!? ...Where's she been hidin' <span class=\"emphasis\">that</span> ship?"},{"name":"DIABOLOS","text":"I would not tire my arm with the swatting of so many flies. The Nullstone is mine, and there is yet much to be done."},{"name":"STACIA","text":"I ain't a healer, but I'd say you've broken your arm, a couple of ribs, and bruised half your innards. We need to get you some splints and bandages..."},{"name":"CAITSITH","text":"The loss of the Nullstone is on my head...and I shall see that we win it back."},{"name":"UTATA","text":"How are there still so many Talons? I thought they were massacred at Mhach..."},{"name":"RADLIA","text":"Would you look at that sorry excuse for a sky pirate. I knew Redbill and his ragtag crew couldn't be trusted with saving the skies."},{"name":"SUBORDINATE02204","text":"Consider our debt to you repaid!"},{"name":"LEOFARD","text":"...Well, well, ain't I a lucky sod: two demons in one day. Found some new dogs to lick your boots, Radlia?"},{"name":"RADLIA","text":"Is that any way to welcome me back to the life? You needed allies, and persuading our reluctant fellows to join in common purpose is a feat only a woman of my charming beauty could accomplish!"},{"name":"RADLIA","text":"And besides, you look too injured to be of much use to anyone. You'd best take to your bed, old man, and let me and your champion there take care of the voidsent."},{"name":"LEOFARD","text":"...What, so you can tuck tail and run again at the first sign of trouble? You'd not even be standin' there if it weren't for me, and even with me arm busted up I'm still twice the pirate you are."},{"name":"CAITSITH","text":"...Nay, I think you should stay behind this time, Leofard. We must pursue Diabolos without you."},{"name":"CAITSITH","text":"Time is of the essence, and we cannot afford to wait for you to heal. We must take advantage of Captain Radlia's reinforcements, and proceed with all haste."},{"name":"LEOFARD","text":"Did the demon drop you on your head, furball? Without me there to run things, you'll just end up gettin' in <span class=\"highlight\">Forename</span>'s way. And no one's makin' haste anywhere until we know what we're flyin' into!"},{"name":"CAITSITH","text":"Again, Captain Radlia may hold the answer to that dilemma. I suspect that the island where she uncovered the Mhachi tome is the very location where Diabolos has chosen to lair!"},{"name":"CAITSITH","text":"This floating marvel I speak of is not a natural occurrence─it was constructed as a haven for refugees of the floods. The tome makes very clear reference to the island's purpose, and describes in detail the voidsent sorcery employed in its creation..."},{"name":"CAITSITH","text":"As the Void Ark never arrived at its destination, however, the island remained uninhabited. I can imagine no more suitable hideaway for our scheming fiend."},{"name":"CAITSITH","text":"Even better, Diabolos will not expect us to suddenly arrive on his secluded doorstep. The Talon fleet will carve us a path through the lesser fiends, and we shall strike swiftly into the heart of the confusion to seize the Nullstone. Once the relic is secured, I will use its power to obliterate our devilish foe!"},{"name":"CAITSITH","text":"As a sky pirate, surely you understand how such an assault relies on speed and surprise. We cannot have a wounded companion slow us down...and potentially doom the entire enterprise."},{"name":"LEOFARD","text":"...So, you think you're in charge now, do you, puss? Poor, broken Leofard's just some dead weight you need to cut away?"},{"name":"LEOFARD","text":"You know what? I've had a bellyful of your mewlin' in any case. Go on─fly off without me, and see how far you get with your thrice-damned “enterprise.”"},{"name":"CAITSITH","text":"...Captain Radlia, compare the direction indicated by the ectocompass with your navigational records, if you please. I think we'll find the coordinates coincide with the island in question."},{"name":"RADLIA","text":"Certainly. And feel free to board our flagship when you're set to depart. My darling's large enough to accommodate your adventurer and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fellows with room to spare!"},{"name":"LEOFARD","text":"This adventure's all yours, <span class=\"highlight\">Forename</span>. I'll be cheerin' for you from my sickbed like a good little pirate. Promise."},{"name":"CAITSITH","text":"...This is the way it must be. Considering our need for haste and the extent of Leofard's injuries, my conclusion was merely logical."},{"name":"CAITSITH","text":"Captain Redbill's primary concern should be securing the freedom of the skies, not limping into almost certain death at the hands of the voidsent─no matter how much he chafes at being excluded from the voyage."},{"name":"STACIA","text":"Cait Sith was only talkin' common sense. The captain took it hard, but I think he knows it, too. We're doin' the right thing leavin' him behind...ain't we?"},{"name":"UTATA","text":"Don't you worry, I'll keep an eye on the captain while everyone is off on this grand adventure. Without him. Hmmm. Are you certain you don't need me to go with you...?"},{"name":"RADLIA","text":"I <span class=\"emphasis\">acquired</span> our splendid flagship after the Ishgardians saw fit to abandon her. I hear she was an attempt to match the airborne agility of their dragon enemies, but the vessel never did live up to expectations."},{"name":"RADLIA","text":"When she passed to me, we replaced all their “improvements” with structural reinforcements, and made ourselves a flying fortress. Our stately lass'll not soon be knocked from the sky!"},{"name":"CAITSITH","text":"Do not relax your guard yet, <span class=\"highlight\">Forename</span>! The air is still heavy with his foul presence..."},{"name":"RADLIA","text":"Already taken care of the fiend, have you? And you didn't even need that dusty old relic to do it!"},{"name":"CAITSITH","text":"Be careful, Captain! Diabolos yet lurks in the shadows!"},{"name":"DIABOLOS","text":"Finally have I claimed the Shadow Queen's power for mine own, yet still am I harried by you noisome weevils!"},{"name":"DIABOLOS","text":"I must needs quit this realm for a time... And when I have grown accustomed to my newfound might, there shall be a reckoning for your insolence!"},{"name":"LEOFARD","text":"(-Familiar Voice-)This ain't the time for nappin', furball! You've still got a job to do!"},{"name":"LEOFARD","text":"...Aye, my work here is unfinished.<br>In Cessair's name, I unmake thee, Diabolos! My master's will be done!"},{"name":"DIABOLOS","text":"Gaaarrrggghhh! For fifteen centuries have I yearned for this power! Thou canst not unmake me! No! Noooooo!"},{"name":"STACIA","text":"...I should have known we were wastin' our breath. The captain only heeds the siren in his heart, and damn the consequences..."},{"name":"LEOFARD","text":"Heh... I told you you'd be lost without me, didn't I?"},{"name":"LEOFARD","text":"And look at you, puss, gettin' knocked out cold in your moment of glory. You weren't like to get another chance to honor your master's memory and you almost missed it..."},{"name":"LEOFARD","text":"But I suppose you pulled through at the last. ...Aye, I'll give you that much."},{"name":"CAITSITH","text":"The plan was a resounding success...though it did require some intervention on Leofard's part. I am afraid I misjudged his commitment to our cause..."},{"name":"STACIA","text":"Well, I think he'll live. Which is surprisin' considerin' he crashed his ship into a bloody demon... Damned fool."},{"name":"RADLIA","text":"How vexing to once again be rescued by Redbill...<br>He'd better recover from those injuries so we can go back to hating each other on an equal footing."},{"name":"LEOFARD","text":"Spare me your concern and your lectures. You all knew I wasn't like to stay abed with such a grand adventure in the makin'. And I'd rather break every bone in me body than be stripped of the freedom to go where I please."},{"name":"LEOFARD","text":"Besides, all's well that ends well, eh? Diabolos is dead, and we're all alive. That counts as a victory in my book."},{"name":"LEOFARD","text":"It's just a pity that it cost me the <span class=\"emphasis\">Raimille</span> in the doin' of it. I hope she rests easy on that island refuge..."},{"name":"LEOFARD","text":"（★未使用／削除予定★）"},{"name":"STACIA","text":"（★未使用／削除予定★）"},{"name":"LEOFARD","text":"（★未使用／削除予定★）"},{"name":"UTATA","text":"（★未使用／削除予定★）"}],"reward":{"gil":7500,"items":[{"id":17649},{"id":17650}],"xp":0,"instance":30047},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67822]},"next":[67910]},"partials":[{"type":"npc","id":"1016130","obj":{"i":1016130,"n":"Stacia","l":2100,"q":3}},{"type":"npc","id":"1018079","obj":{"i":1018079,"n":"Leofard","l":1803,"q":2}},{"type":"npc","id":"1018060","obj":{"i":1018060,"n":"Leofard","l":1804,"q":1}},{"type":"npc","id":"1018061","obj":{"i":1018061,"n":"Stacia","l":1804,"q":1}},{"type":"npc","id":"1018062","obj":{"i":1018062,"n":"Cait Sith","l":1804,"q":1}},{"type":"npc","id":"1018063","obj":{"i":1018063,"n":"Utata","l":1804,"q":1}},{"type":"npc","id":"1018064","obj":{"i":1018064,"n":"Stacia","l":1803,"q":1}},{"type":"npc","id":"1018065","obj":{"i":1018065,"n":"Radlia","l":1803,"q":1}},{"type":"npc","id":"1018066","obj":{"i":1018066,"n":"Talons Deckswab","l":1803,"q":1}},{"type":"npc","id":"1018068","obj":{"i":1018068,"n":"Leofard","l":1803,"q":1}},{"type":"npc","id":"1018069","obj":{"i":1018069,"n":"Utata","l":1803,"q":1}},{"type":"npc","id":"1018070","obj":{"i":1018070,"n":"Cait Sith","l":1803,"q":1}},{"type":"npc","id":"1018074","obj":{"i":1018074,"n":"Utata","l":1803,"q":1}},{"type":"npc","id":"1018075","obj":{"i":1018075,"n":"Leofard","l":1803,"q":1}},{"type":"npc","id":"1018076","obj":{"i":1018076,"n":"Stacia","l":1803,"q":1}},{"type":"npc","id":"1018077","obj":{"i":1018077,"n":"Cait Sith","l":1803,"q":1}},{"type":"npc","id":"1018078","obj":{"i":1018078,"n":"Radlia","l":1803,"q":1}},{"type":"npc","id":"1018080","obj":{"i":1018080,"n":"Stacia","l":1803,"q":2}},{"type":"npc","id":"1018081","obj":{"i":1018081,"n":"Cait Sith","l":1803,"q":2}},{"type":"npc","id":"1018082","obj":{"i":1018082,"n":"Radlia","l":1803,"q":2}},{"type":"item","id":"17649","obj":{"i":17649,"n":"Promises Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"17650","obj":{"i":17650,"n":"Shadow of the Body Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"30047","obj":{"i":30047,"n":"Dun Scaith","c":61802,"t":"Raids","min_lvl":60,"max_lvl":60,"min_ilvl":235}},{"type":"quest","id":"67822","obj":{"i":67822,"n":"Freedom for Our Skies","g":18,"l":"The Parrock","s":4,"f":1}},{"type":"quest","id":"67910","obj":{"i":67910,"n":"A Redbill Farewell","g":18,"l":"The Parrock","s":6,"f":1}}]}