{"quest":{"name":"Don't Trust Anyone over Sixty","location":"Idyllshire","id":67906,"patch":3.4,"sort":35,"icon":100580,"unlocksFunction":1,"eventIcon":71341,"issuer":1017983,"target":1016619,"involved":[1017984,1017985,1017986,1017987,1017988,1017989,1017990,1017991,1017992,1017993,1017994,1017996,1017997,1018000,1018005,1018006,1018007,1018122],"genre":69,"journal":["Hildibrand has never been a patient man.","Just when it seems your efforts to attract the attention of the Grand Sers have been in vain, you catch sight of two men watching you from a distance. Upon realizing that they have been observed observing you, they leave, prompting Cyr to speculate that maybe the men are the very charlatans you seek. And so the others pursue them with all haste, save Julyan, who seems content to shrug and follow at her own pace.","It is said that Eorzea is a land embraced by gods and forged by heroes, and in the minstrels' songs, these heroes are often described as youths of incomparable bravery and virtue, at the peak of their physical condition. It is therefore something of a shock when you finally catch up to and confront the Grand Sers, whom you discover to be exceedingly experienced warriors in the twilight years of their lives. Yet their age belies their ability, for when Inspector Hildibrand puts forth his accusations, the self-proclaimed slayer of a thousand thousand wyrms launches into the air and prepares to deliver a strike of unimaginable destructive power. Fortunately, you are spared a grisly death when the dragoon seemingly passes out mid-flight and crashes to the ground, surviving only by the grace of Halone, and in spite of his companion's misguided ministrations.<br><br>It is then that the third Grand Ser calls out from a distance and reveals herself as none other than the elderly woman with whom you spoke in Ishgard and in Idyllshire. While this supposed revelation surprises absolutely no one, the fact that she also somehow managed to abduct and imprison Gigi unfortunately does. Having gained the upper hand, she smugly declares that the mammet will help the Grand Sers reclaim their youth, and the gang makes good their escape under cover of smoke...at a disconcertingly slow pace, that is.","Needless to say, Hildibrand has no intention of giving up on his beloved son, and neither do the others. The hunt for the fugitive Grand Sers begins anew, and you can but pray that the elderly criminals have not unexpectedly been imbued with the spirit of swift-moving wolves or some such.","It is not long before you and your comrades catch up to the Grand Sers, who have decided to rest for a spell. Before you can debate at length how best to go about freeing Gigi from his iron cage, Orland wanders off alone─creating an opportunity for you to corner and subdue the old man that you might relieve him of his armor. To what end remains unclear, but such are Hildibrand's wishes, and as you know from past experience, it is usually best to simply do what he says and pray that nothing explodes as a result.","The elderly dragoon appears to have no recollection of meeting and attempting to murder you, despite it having been less than twelve hours prior. Complaining of an ache in his shoulders, he beseeches you to massage him, inviting you to remove his breastplate that you may better reach his sore muscles. And so you make ready to oblige, having not lost sight of your goal to obtain his armor, even if the methods it seems you must now employ are quite unlike anything you could have ever imagined. Or perhaps would wish to.","Freed from the confines of his breastplate, Orland takes a seat upon the ground, inviting you to kneel and tend to his aching shoulders. As you look on the elderly man waiting to receive your ministrations, a long forgotten─or repressed─memory nearly rises to the forefront of your mind before you shove it back down into the depths and crack your fingers in preparation for this most ignoble of duties.","Slayer of Gods. Rider of Dragons. Savior of Ishgard. <span class=\"alternative-container\"><span class=\"alternative\">Masseuse</span><span class=\"alternative\">Masseur</span></span> of the Elderly. Yet a single vigorous session will not serve to satisfy Orland, oh no. Mustering every onze of your courage, you raise up your tired hands and dive once more into the fray.","Never have you been so sorely tested by an old man's back. At length you pause, as Orland begins to mutter softly, his words eventually trailing away into a snore. You sense your long ordeal may finally be at an end, but given the dire stakes, you know you must be absolutely, positively, and utterly certain that the dragoon has fallen asleep...","For a mercy, you are spared the burden of a third massage, as Orland slumbers softly...like the dead...or dying... Brushing away these morbid thoughts, you look to the sleeping old man's sabatons, which are begging to be stolen.","Slayer of Gods. Rider of Dragons. Savior of Ishgard. Stealer of Pants. In what may well be the darkest chapter of your life, you carefully remove Orland's sabatons and breeches, leaving the sleeping old man exposed to the elements and wholly at the mercy of the nearby ravenous bears with their big, nasty teeth and the repugnant morbols with their slimy, undulating tentacles. May he rest in peace.","Whispering a prayer for their former owner, you deliver Orland's armor to Inspector Hildibrand, who reveals his bold plan─one exceedingly simple and almost certainly doomed to failure. He dons Orland's armor, seeking to masquerade as one of the Grand Sers, that he might waltz into the camp and free Gigi from captivity without a struggle. Whether by the poor eyesight of his marks or the grace of the gods, his deception somehow succeeds, and he manages to release Gigi from his cage and nearly escape─even after a disoriented Orland wanders back to camp and is promptly mistaken as an impostor by his dear allies.<br><br>Before you can make good your escape, Dorys cries out and bids Vivi stay, revealing the true identity of the amnesic mammet as a creation of Archmagus Quan, who endeavored to restore his youth through the use of the mammet's temporal magicks. Though Quan died before he could achieve his ambition, the Grand Sers later stumbled upon his journals and attempted to track down the forgotten mammet. Alas, though it pains him to do so, Gigi parts ways with his adopted father and leaves with the Grand Sers, tempted by the possibility that he may be reunited with his creator should he master his powers and raise Archmagus Quan from the dead.<br><br>Though his will wavers for a moment, Inspector Hildibrand eventually resolves to go after his beloved son and ensure that he only engages in traditional forms of necromancy. After convincing Inquisitor Cyr to suspend his investigation for a time, he then departs for Idyllshire with Nashu in tow to consider their next course of action...as Julyan Manderville ponders quietly the ramifications of a mammet that may have the power to undo the ravages of aging...","After reaffirming his decision not to pursue the Grand Sers for the foreseeable future, Cyr demonstrates his highly developed survival instincts by returning to Ishgard with all due haste. Assuming he does not run afoul of the myriad threats which were nearly the cause of his and the others' grisly deaths when they first came to Idyllshire, you will doubtless see him again. If he does, then may he rest in peace.","To your relief, you find Cyr in Ishgard, having returned to the capital bearing no injuries of a physical nature, at the least. His experiences in Idyllshire and with Gigi continue to weigh heavily on his mind, and he intends to scour the inquisition's archives for any information regarding temporal magicks that may shed light on the mammet's true nature. Yet his firm protestations that his interest is purely a professional one seem to belie another, more personal motivation..."],"objectives":["Follow Hildibrand outside the gates of Idyllshire.","Speak with Hildibrand.","Speak with Orland.","Help Orland remove his armor.","Massage Orland.","Massage Orland again.","Massage Orland yet again.","Steal Orland's sabatons.","Give Orland's armor to Hildibrand.","Speak with Cyr.","Speak with Cyr in Foundation."],"dialogue":[{"name":"CYR","text":"That old woman must've followed us here from Ishgard. She's involved in this, that much is clear, but the question is how?"},{"name":"NASHUMHAKARACCA","text":"Gigi's so talented, just like her grandpapa!"},{"name":"JULYAN","text":"Even supposin' I were to turn a blind eye to his shenanigans, this is no place to raise a child..."},{"name":"GIGI","text":"HoW dO yOu LiKe My FaMiLy CrEsT? oH─mAyBe I sHoUlD'vE aLsO pAiNtEd GrAnDpApA gOdBeRt AnD gRa─ Er, M'lAdY jUlYaN!"},{"name":"HILDIBRAND","text":"&lt;yawn&gt; Much as it pains me to admit it, a gentleman's stamina is not without limits... I daresay I could do with a spot of tea."},{"name":"NASHUMHAKARACCA","text":"Hey, Inspector! Is it just me, or have those two been looking at us for the past few minutes?"},{"name":"HILDIBRAND","text":"Oh, 'tis quite normal behavior for my adoring fans, I should think. When finally presented with an opportunity to meet their idol in the flesh, all too many succumb to their fear and flee..."},{"name":"CYR","text":"Or maybe, just maybe, they're the Grand bloody Sers! Come on, come on, they're getting away!"},{"name":"CYR","text":"&lt;huff&gt; &lt;puff&gt; Fury take me, I haven't run like that since Ser Charibert chased me up and down the Steps of Faith brandishing a flaming─ Wait, where is Gigi?"},{"name":"JULYAN","text":"Hmph. Spare the flamin' rod, spoil the milksop."},{"name":"NASHUMHAKARACCA","text":"Where could those two have got to?"},{"name":"GIGI","text":"ThEy...ThEy WeNt ThAtAwAy! To ThE rIgHt! I'Ll CaTcH uP tO yOu AlL sOoN, sO jUsT gO!"},{"name":"HILDIBRAND","text":"Hearken to me, you dastardly rapscallions! You have nowhere to run! Reveal yourselves at once!"},{"name":"HILDIBRAND","text":"I shall not ask you again! Come forth, Grand Sers─name yourselves, and answer for your misdeeds!"},{"name":"ORLAND","text":"Slayer of a thousand thousand wyrms, the silver spear which hath pierced the very heavens! Oooooorland!"},{"name":"GONSPART","text":"Master of magicks ancient and awesome, the divine hand which hath defeated all maladies save senescence and incontinence! Goooooonspart!"},{"name":"ORLAND","text":"(-The Grand Sers-)Grand Sers, excelsior!"},{"name":"CYR","text":"...I don't know whether to laugh or to cry. Mayhap both."},{"name":"HILDIBRAND","text":"Grandsires! Ahem─Grand Sers! You stand accused of willfully and unlawfully convincing young maidens of Ishgard to attend private parties under false pretenses, thereby inflicting upon them terrible financial and emotional distress!"},{"name":"HILDIBRAND","text":"I, Hildibrand, agent of enquiry, inspector extraordinaire, am come on behalf of these poor, defenseless innocents, and to see that no others are made to suffer as they did! Now, lay down your arms and surrender yourselves into my custody!"},{"name":"ORLAND","text":"Hah! The audacity of this boy! You should feel ashamed of your words and deeds!"},{"name":"ORLAND","text":"You will rue this day, and rue it hard!"},{"name":"ORLAND","text":"Gods, how I've missed this! The air streaming past, the blood pumping, the taste of copper on my lips, the slight dizziness..."},{"name":"ORLAND","text":"It was on a day like this that we met, wasn't it? And when we soared into those azure skies we never truly came back down..."},{"name":"ORLAND","text":"Do mine eyes deceive? Pigsney of my heart, descended from Halone's halls to guide me to Her bosom!?"},{"name":"ORLAND","text":"My beloved! My everything! Long have I waited for this moment! Take me in your arms once more and lift me higher, higher, higher!"},{"name":"ORLAND","text":"Higher, higher, higher..."},{"name":"GONSPART","text":"Orland!? Orland!? Orlaaaaaaaaand!"},{"name":"HILDIBRAND","text":"Alas, poor Orland! I knew him not in the slightest, but he seemed a decent man. Chicanery and attempted murder notwithstanding."},{"name":"CYR","text":"Wait─I've seen this before! All too recently... Ahem, yes, anyway! He's only <span class=\"emphasis\">mostly</span> dead! If the “master of magicks ancient and awesome” here acts with all haste, the man may yet be saved!"},{"name":"GONSPART","text":"Oooh, you are referring to me! I see, I see... With all haste, was it? Yes, yes, I'll get right on that."},{"name":"GONSPART","text":"O mournful voice of creation! Send unto me a creature of the abyss, my thrall to command, that I may smite─ No, wait, that's no good. Hm...let me see..."},{"name":"GONSPART","text":"Something of a rather less controversial tradition, yeees... Something with more...pep! A vortex of biting winds to rend the flesh..."},{"name":"GONSPART","text":"...And smite my foes!"},{"name":"CYR","text":"Foes!? I thought you were friends!"},{"name":"ORLAND","text":"&lt;gasp&gt; &lt;cough&gt; &lt;cough&gt; Saint Reinette bugger me with a bleedin' Gae Bolg, my back! My back!"},{"name":"GONSPART","text":"Grrr... 'Twould seem I've underestimated you lot."},{"name":"CYR","text":"That...makes two of us?"},{"name":"DORYS","text":"(-???-)Enough! Leave them be─or do you not care what becomes of the mammet?"},{"name":"HILDIBRAND","text":"Gigi!? But when? How!?"},{"name":"CYR","text":"I thought I recognized you! First in Ishgard, then in Idyllshire─you've been following us since we left the capital!"},{"name":"DORYS","text":"Bearer of faces fair and fearsome, the midnight shadow which hath deceived kings and queens! Doooooorys!"},{"name":"CYR","text":"You can't possibly have been so naive as to think we'd not see through your ridiculous disguises!"},{"name":"DORYS","text":"And yet here you are, so effortlessly and easily lured into our trap. For which we are most grateful, mind─my companions are hardly cut out for life on the road."},{"name":"DORYS","text":"All has been in preparation for this moment. The parties, the petty schemes─from the first, the objective of this grand design has been this singular mammet."},{"name":"HILDIBRAND","text":"I swear to you, if you harm Gigi in any way─"},{"name":"DORYS","text":"We have no desire to hurt the “boy.” We but require his help to reclaim that which is rightfully ours: our youth."},{"name":"CYR","text":"&lt;cough&gt; &lt;cough&gt; Confound it! I can't see!"},{"name":"CYR","text":"Damn! They're...very slowly getting away."},{"name":"GIGI","text":"PaPa HiLdY!"},{"name":"HILDIBRAND","text":"Gigi!"},{"name":"HILDIBRAND","text":"Stay strong, my son! I swear I shall find you!"},{"name":"CYR","text":"Remind me again why we didn't just, you know..."},{"name":"JULYAN","text":"Fine job he did protectin' that mammet of his, eh?"},{"name":"NASHUMHAKARACCA","text":"Do you think they're headed for the old mill? If not, can we go anyway? I haven't had cider in ages!"},{"name":"HILDIBRAND","text":"Twelve strike me down for a fool! So desperate was I to seize the Grand Sers that I failed to discern their true intent before it was too late. And now poor Gigi is in their clutches! What if I never see my beloved son again!?"},{"name":"NASHUMHAKARACCA","text":"I suppose we ought to be prepared for the worst. They could be halfway to Radz–at–Han by now."},{"name":"CYR","text":"I very much doubt that, given that they were moving at an adamantoise's pace."},{"name":"JULYAN","text":"The little milksop's right. Let's get after the old buggers."},{"name":"CYR","text":"Huh. That's what my mentor used to call me. Among other things. Oh, the memories..."},{"name":"CYR","text":"We mustn't act rashly. If they realize they are being watched, they may attempt to flee again...very slowly..."},{"name":"HILDIBRAND","text":"So! It seems that the Grand Sers have been caught once more by the very inspector that was trying to catch them."},{"name":"CYR","text":"How ironic. Also, how premature─we have them, yes, but they still have Gigi. Dammit! If only some manner of opportunity would present itself..."},{"name":"CYR","text":"Ask and ye shall receive! We can ambush that wizened dragoon, take him hostage, and demand an exchange!"},{"name":"HILDIBRAND","text":"Inquisitor Cyr, you disappoint me! A gentleman cannot condone the violent kidnapping and ransom of his elders! No, no, we shall approach this problem as paragons of honor and virtue."},{"name":"HILDIBRAND","text":"<span class=\"highlight\">Forename</span> will stalk and subdue the Grand Ser, then relieve him of his armor."},{"name":"CYR","text":"How is stripping an old man naked more gentlemanly than taking him hostage!?"},{"name":"HILDIBRAND","text":"Rest assured I shall reveal all soon enough! Godsspeed, <span class=\"highlight\">Forename</span>!"},{"name":"CYR","text":"Oh, yes, let's not even bother to discuss the moral and ethical implications, much less the legal ones..."},{"name":"HILDIBRAND","text":"Do take care to obtain the dragoon's armor through gentlemanly means. We must always endeavor to treat our elders with the utmost respect!"},{"name":"ORLAND","text":"Ahhh! I <span class=\"emphasis\">knew</span> you'd... Wait, who are you again? There's something awfully familiar about...those muscular forearms, those strong-yet-tender-looking fingers..."},{"name":"ORLAND","text":"I say, would you be so kind as to massage my shoulders, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>? There's this lingering ache, this tension that Gonspart can't seem to soothe with his magicks."},{"name":"ORLAND","text":"Remove my breastplate...? Oh, of course. How silly of me. Pray lend me a hand with the straps?"},{"name":"ORLAND","text":"Truly, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>, you are a saint!"},{"name":"ORLAND","text":"Ahhh, I swear, it's the little things you begin to appreciate! My dear departed wife used to help me with my armor, you know... Right, right, I should be seated to better receive your tender ministrations."},{"name":"ORLAND","text":"Ah, the healing tingle! Would that I had a tincture of salamander with which to treat these aches. My little pigsney used to spread some on my chest and under my nose to help me sleep through the night..."},{"name":"ORLAND","text":"Come, do not be shy! Work those soothing fingers into each and every knot! Slowly... Make me forget my troubles..."},{"name":"ORLAND","text":"Mmm... Harder, harder... Higher, higher... Close your eyes and dream... &lt;snore&gt;"},{"name":"SYSTEM","text":"The old dragoon's soft snoring suddenly stops, and you begin to fear you may have borne witness to his final moments. Leaning closer, you extend a hesitant finger...only to stop short when a sudden spasm signals the resumption of his labored breathing..."},{"name":"SYSTEM","text":"With the utmost care, you remove Orland's sabatons and breeches, leaving the sleeping old man exposed to the elements and at the mercy of the nearby ravenous bears and tentacled morbols. May he rest in peace."},{"name":"SYSTEM","text":"Good night, sweet prince..."},{"name":"HILDIBRAND","text":"Ah, my stalwart assistant! By your return I gather you have taken care of the dragoon? And by “taken care” I mean afford him all due courtesy as befitting a man of his years, whilst returning with the equipment I require?"},{"name":"HILDIBRAND","text":"Capital! Then without further ado, I shall disguise myself as Orland and free Gigi from captivity!"},{"name":"CYR","text":"But you two look nothing alike! They may be old and slow, but they're not blind!"},{"name":"HILDIBRAND","text":"O ye of little faith, you are in for a treat, for you shall have a front row seat to this magnificent display of Mandervillian guile and subterfuge!"},{"name":"GONSPART","text":"Hey...is it time for dinner yet?"},{"name":"DORYS","text":"We just ate, you daft bugger! &lt;sigh&gt; And where in the hells is Orland? I know he's got to take a piss every hour, but dammit, he could at least be quick about it..."},{"name":"HILDIBRAND","text":"Greetings, fellow antediluvians! I have returned!"},{"name":"CYR","text":"Oh, bollocks..."},{"name":"DORYS","text":"...It's about time."},{"name":"CYR","text":"Okay, <span class=\"emphasis\">no</span>, that's <span class=\"emphasis\">bollocks</span>─"},{"name":"DORYS","text":"Pack up your things. I want us back on the road in ten minutes."},{"name":"HILDIBRAND","text":"Before we do that, we must first release young Gigi here. 'Tis behavior unbecoming a gentleman to keep children in cages."},{"name":"DORYS","text":"What in the seven hells're you blathering about? He's going to get away!"},{"name":"HILDIBRAND","text":"No, he will not. See? Still here, within my care. Right, then─on a completely unrelated note, I shall now take the boy with me on a brief sojourn into the wilderness."},{"name":"CYR","text":"Fury take me, it's working! He's about to walk out of there with Gigi, and they won't even try to stop him!"},{"name":"JULYAN","text":"So far, so good..."},{"name":"ORLAND","text":"Brrr... I'm cold and there are morbols after me..."},{"name":"ORLAND","text":"I'm me, but you're also me...but that can't be, unless..."},{"name":"ORLAND","text":"...This is it. This is the moment when my life flashes before my eyes. Oh, my dearest pigsney, we'll be together at last..."},{"name":"DORYS","text":"Impostor! How dare you attempt to trick me with a ruse so hackneyed it would make a minstrel blush!"},{"name":"ORLAND","text":"Ye gods! I never realized dying would hurt so much!"},{"name":"HILDIBRAND","text":"Now's our chance, Gigi! Come with me!"},{"name":"DORYS","text":"Vivi, wait!"},{"name":"HILDIBRAND","text":"My son? What's gotten into you?"},{"name":"GIGI","text":"ViVi... ViVi... WhErE hAvE i HeArD tHaT nAmE bEfOrE..."},{"name":"DORYS","text":"Remember who you are, Vivi! What you are! A creation of the great Sharlayan archmagus Quan!"},{"name":"GIGI","text":"QuAn... QuAn... I... i WaS gIvEn LiFe By..."},{"name":"GIGI","text":"GrAnDpApA qUaN!"},{"name":"GIGI","text":"I rEmEmBeR nOw... We LiVeD tOgEtHeR...aNd He TaUgHt Me MaNy ThInGs AbOuT tHe OuTsIdE wOrLd..."},{"name":"HILDIBRAND","text":"What...what exactly do you remember, my son?"},{"name":"GIGI","text":"EvErYtHiNg...YeS, eVeRyThInG. i ReMeMbEr ThAt GrAnDpApA qUaN cReAtEd Me─ThAt He ToOk CaRe Of Me, RaIsEd Me. AnD tHaT wE wErE vErY hApPy..."},{"name":"GIGI","text":"BuT tHeN...bUt ThEn He AbAnDoNeD mE! gRaNdPaPa QuAn AbAnDoNeD mE!"},{"name":"DORYS","text":"He believed you were flawed, Vivi. That you lacked the power to turn back the hands of time and make him young again. And so, in his ignorance, he cast you out, and died, all alone."},{"name":"GIGI","text":"..."},{"name":"CYR","text":"\"To turn back the hands of time“? Then, what we witnessed in the Crozier, with the duke's priceless vase...that power could be brought to bear on people!?"},{"name":"CYR","text":"But wait, how do you know all of this? You couldn't have possibly been associates of this Archmagus Quan!"},{"name":"DORYS","text":"We found his journals during one of our many trips into the Great Library. Scavenging for valuable relics is one of the few ways we have left to make a living."},{"name":"DORYS","text":"We were famed heroes of the war in our prime, with fortunes to match. But no soldier has the strength to triumph over time, and before we knew it, the hour of the sheath was upon us. Ishgard no longer had need of our services."},{"name":"DORYS","text":"So we came here to eke out a living. To keep doing what we do best, until our bodies wouldn't let us. Imagine our surprise when we stumbled upon the opportunity of a lifetime─a <span class=\"emphasis\">second</span> lifetime, as it were."},{"name":"DORYS","text":"A mammet with the power to take that which was broken and restore it to its prime state. To turn back time with its temporal magicks and give us back our misspent youth."},{"name":"CYR","text":"F-Fury take me, this is all so... I don't even know if there's a precedent to determine whether or not this constitutes heresy..."},{"name":"DORYS","text":"We knew where to look, even. With the journals we determined that the mammet was somewhere in the western highlands. A chance...for a second chance, was within reach. And then we were forced to watch as you imbeciles pulled Vivi from the snow, nearly ruining everything!"},{"name":"DORYS","text":"Vivi, listen to me! Come with us and we can help you to unlock your true potential!"},{"name":"DORYS","text":"Just think what you could accomplish were you to master your magicks! Not only could you make us young again, but you may even have the power to restore life to Archmagus Quan!"},{"name":"GIGI","text":"VIVI※VIVIVI★※!"},{"name":"CYR","text":"Impossible! No magick can truly return the dead to us! At best, you can animate a corpse─and I need not review the precepts to declare that the products of necromancy are abominations in the eyes of the Fury!"},{"name":"HILDIBRAND","text":"Gigi, wait! What of our adventures? What of our gazebo!? You are a Manderville mammet!"},{"name":"GIGI","text":"YoU hAvE aLwAyS bEeN sO kInD tO mE, pApA hIlDy, AnD i WiLl FoReVeR bE gRaTeFuL fOr ThAt. BuT...gRaNdPaPa QuAn MaDe Me. He MaDe Me, AnD...i MiSs HiM. sO eVeN iF iT fAiLs, I hAvE tO tRy..."},{"name":"CYR","text":"What are you doing!? They're getting away! We have to stop them!"},{"name":"HILDIBRAND","text":"...Mayhap we must respect Gigi's decision."},{"name":"JULYAN","text":"...So that's the end of that chapter, eh? Yer givin' up and comin' back home?"},{"name":"HILDIBRAND","text":"I too made a decision long ago─to become a traveling inspector, and I have ever stood by it. Mayhap it is from this singular stubbornness of mine that Gigi took inspiration..."},{"name":"HILDIBRAND","text":"Nay, I cannot abide it! He is my flesh and blood─my son! I dare not let him use his temporal magicks to pervert the natural order!"},{"name":"HILDIBRAND","text":"Aye, it falls to me, his father, to ensure that Gigi keeps to the righteous path and only utilizes traditional methods of zombification to raise the dead!"},{"name":"JULYAN","text":"I suppose it'd've been a shame had he given up that easily...though that means I'll have to stick around even longer."},{"name":"HILDIBRAND","text":"Inquisitor Cyr. I must applaud your dedication to your work, and cannot thank you enough for all you have done on our behalf. Yet I fear if we continue as we are, Gigi may be driven to rash action."},{"name":"HILDIBRAND","text":"Therefore I would ask that you suspend your pursuit of the Grand Sers for a time, that I might be afforded the opportunity to convince my son to return peacefully."},{"name":"CYR","text":"Well...seeing as how we can only guess at the full extent of Gigi's powers, it might prove dangerous to act aggressively should he choose to use them."},{"name":"HILDIBRAND","text":"I knew you would understand. Right, then! There is no time to waste! Nashu─let us retire to our new gazebo and discuss our plans!"},{"name":"JULYAN","text":"On the other hand, if that bloody mammet's really got the power to make them young again, then... Heh heh heh..."},{"name":"CYR","text":"I said I'd suspend my pursuit, and I will. But that doesn't mean I won't continue my investigation into that mammet and its powers...in Ishgard."},{"name":"CYR","text":"Ah, I see you saw fit to return to the capital as well. The inquisition has a rather large collection of heretical tomes, including many of Sharlayan origin, and I had a mind to scour them for information on temporal magicks."},{"name":"CYR","text":"This is, of course, all for the sake of...confirming the mammet's heretical origins. Yes, only that..."},{"name":"CYR","text":"Hm? Why are you looking at me like that, as if to imply that my interest in these matters is more than a professional one? I'm sure I don't know what you're <span class=\"emphasis\">not</span> talking about. Thank you, <span class=\"highlight\">Forename</span>─that will be all!"}],"reward":{"gil":1568,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67905]},"next":[67907]},"partials":[{"type":"npc","id":"1017983","obj":{"i":1017983,"n":"Hildibrand","l":2082,"q":1}},{"type":"npc","id":"1016619","obj":{"i":1016619,"n":"Cyr","l":2300,"q":6}},{"type":"npc","id":"1017984","obj":{"i":1017984,"n":"Nashu Mhakaracca","l":2082,"q":1}},{"type":"npc","id":"1017985","obj":{"i":1017985,"n":"Cyr","l":2082,"q":1}},{"type":"npc","id":"1017986","obj":{"i":1017986,"n":"Gigi","l":2082,"q":1}},{"type":"npc","id":"1017987","obj":{"i":1017987,"n":"Julyan","l":2082,"q":1}},{"type":"npc","id":"1017988","obj":{"i":1017988,"n":"Hildibrand","l":2001,"q":1}},{"type":"npc","id":"1017989","obj":{"i":1017989,"n":"Nashu Mhakaracca","l":2001,"q":1}},{"type":"npc","id":"1017990","obj":{"i":1017990,"n":"Cyr","l":2001,"q":1}},{"type":"npc","id":"1017991","obj":{"i":1017991,"n":"Gigi","l":2082,"q":1}},{"type":"npc","id":"1017992","obj":{"i":1017992,"n":"Julyan","l":2001,"q":1}},{"type":"npc","id":"1017993","obj":{"i":1017993,"n":"Hildibrand","l":2001,"q":1}},{"type":"npc","id":"1017994","obj":{"i":1017994,"n":"Nashu Mhakaracca","l":2001,"q":1}},{"type":"npc","id":"1017996","obj":{"i":1017996,"n":"Cyr","l":2001,"q":1}},{"type":"npc","id":"1017997","obj":{"i":1017997,"n":"Hildibrand","l":2001,"q":1}},{"type":"npc","id":"1018000","obj":{"i":1018000,"n":"Cyr","l":2001,"q":1}},{"type":"npc","id":"1018005","obj":{"i":1018005,"n":"Orland","l":2001,"q":1}},{"type":"npc","id":"1018006","obj":{"i":1018006,"n":"Orland","l":2001,"q":1}},{"type":"npc","id":"1018007","obj":{"i":1018007,"n":"Cyr","l":2001,"q":1}},{"type":"npc","id":"1018122","obj":{"i":1018122,"n":"Orland","l":2001,"q":1}},{"type":"quest","id":"67905","obj":{"i":67905,"n":"A Gazebo to Call Our Own","g":69,"l":"Ishgard","s":34,"f":1}},{"type":"quest","id":"67907","obj":{"i":67907,"n":"The Proud and the Pointy-eyed","g":69,"l":"Ishgard","s":36,"f":1}}]}