{"quest":{"name":"If I Could Turn Back Time","location":"The Dravanian Forelands","id":67908,"patch":3.5,"sort":37,"icon":100610,"unlocksFunction":1,"eventIcon":71341,"issuer":1018463,"target":1018456,"involved":[1018459,1018460,1018461,1018462,1018465,1018467,1018468,1018469,1018470,1018471,1018472],"genre":69,"journal":["Hildibrand wishes to entreat your aid in a matter of grave import.","Hildibrand Helidor Maximilian Manderville, agent of enquiry, inspector extraordinaire, has formally petitioned you and the others for aid─a rather meaningless formality in light of the fact that all present came for that very reason. The party is gathered and your purpose is clear. “To Zenith, and to Gigi,” the inspector bellows.","The spirit is willing, but the flesh is weak. Hildibrand, having recently been forcibly interred in the earth, has yet to regain his strength. Fortunately, his mother Julyan has come prepared with salamander oil, the perfect cure for aching muscles─muscles which you have been chosen to massage with gentle ferocity. But first, it must needs rub the oil on the inspector's skin. Or else it gets the suplex.","The inspector's skin shimmers in the pale moonlight. Or the bright sunlight. Time and weather notwithstanding, there is rather a lot of shiny. Now it falls to you, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> of the strong-yet-tender fingers, to relieve your dear comrade of the aches which ail him so.","So strongly you knead the flesh of Inspector Hildibrand in your eagerness that he nearly faints from the experience. Manderville men are made of sterner stuff, however, and he quickly recovers, proclaiming that the fires of righteousness burn anew in his breast. Yet Godbert would spur his beloved son to greater feats of Mandervillian strength with the power of Salamanderville. An ancient legacy of House Manderville, this most sacred of oils shall see one shine with the brilliance of a thousand suns. Once more, you are granted the honor of anointing the inspector, and you rise to the occasion, your heart fair swelling with pride.","The vial of Salamanderville has been spent, but your strong-yet-tender fingers are not. Hildibrand's muscles cry out for your ministrations, and you, ever the soul of compassion and generosity, are doubtless eager to oblige.","With passion and fervor you massage the oily inspector, eliciting such groans of ecstasy that under more dubious circumstances would make passersby blush and depart with all due haste. This is only the beginning, though─harder, better, faster, stronger!","A lesser man might be satisfied with this most vigorous kneading you have administered. Yet Hildibrand is no ordinary man. As he continues to flex for all and sundry, he cries out to the very heavens that he has not even begun to pose.","Full of vim and vigor, Inspector Hildibrand leads you and the others to Zenith, where he confronts the Grand Sers once more. The rejuvenated warriors look on you in disdain, proclaiming that they have a dragon to slay. When it becomes apparent that Hildibrand will not go quietly, they execute a spectacular and strangely familiar attack...but when the dust at last settles, Hildibrand remains standing. The young father implores his wayward and pointy-eyed son to give up his futile quest before it claims his life. Alas, in a fit of rage, the mammet once more reasserts his ability to return anyone and everyone to their ideal form, and brings his magicks to bear on Hildibrand himself...but to no avail.<br><br>Gigi knows not what to make of his failure, leading the inspector and Cyr to explain that the true nature of his powers is not to turn back the hands of time, but to make manifest his ideals─to remake the world and everything in it as the mammet sees fit. Once Archmagus Quan understood that Gigi already saw him as perfect, he realized the only way to achieve his goal of immortality would be to erase the memories of the mammet he had come to view as his last remaining family. Unable to do so, he came to terms with his inevitable death. However, before he passed, Archmagus Quan decided that the only way to protect Gigi from those who would seek his powers was to take his memories after all, and leave him free to begin a new life─a new story all his own.<br><br>Unsurprisingly, Dorys and her comrades have no intention of surrendering the mammet, and make one final attempt to kill you and the others by sending several tonzes of ancient masonry crashing down upon your heads. But in that instant, Gigi rises into the air and uses the last of his remaining aether to return all to the way it should be: Zenith restored, you and your comrades safe, the Grand Sers their natural age, and Hildibrand unconscious.<br><br>As all struggle to come to terms with this new yet familiar state of affairs, Hildibrand rises and resolves to resume his adventures, and is duly delivered into the air by his dear mother after choosing his words poorly. Cyr is relieved to discover that Gigi is not forever lost, but may one day reawaken once he has regained sufficient aether. However, the former inquisitor is also acutely aware that the life he once led is forever lost. Fortunately, the inspector left behind a smashing gazebo that Julyan is more than willing to let him look after until her son comes back down.","With no choice but to leave the Grand Sers and Gigi in the care of Lord Godbert, Cyr leaves to make arrangements for his new life in Idyllshire. Before he departs, however, he invites you to come and see him when next you pass through the settlement so he can properly thank you.","Cyr introduces to you a new friend─or rather, reintroduces: Gigi, in a somewhat more compact form courtesy of Lord Godbert's modifications. While the mammet does not speak and has yet to regain its former consciousness, Cyr and the goldsmith believe that if he were to accompany you and share in your grand adventures that it might hasten his recovery.<br><br>For all his recent troubles, Cyr appears to be a man at peace. No longer bound to serve a cause he did not believe, he is free to begin anew as a consulting inspector, much like the man whose gazebo he has taken as his own. Though your time together is at an end, he hopes that your paths will cross again someday, and he prays that the Fury will bless and keep you in your travels.<br><br>※The next Hildibrand quest will be available from the conspicuously inconspicuous man in Kugane once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “Stormblood.”"],"objectives":["Speak with Hildibrand at Zenith.","Use the salamander oil on Hildibrand.","Massage Hildibrand.","Use the Salamanderville on Hildibrand.","Massage Hildibrand again.","Massage Hildibrand yet again.","Massage Hildibrand once more, with feeling.","Speak with Cyr.","Speak with Cyr in Idyllshire."],"dialogue":[{"name":"CYR","text":"After finally achieving peace after a thousand years of war, they want to kill Hraesvelgr? That doesn't make any sense!"},{"name":"NASHUMHAKARACCA","text":"At least we found the inspector, right?"},{"name":"JULYAN","text":"He looks well enough, but I wonder..."},{"name":"GODBERT","text":"Watching Hildy learn and grow as a father reminds me of my own trials and tribulations..."},{"name":"HILDIBRAND","text":"I, Hildibrand, agent of enquiry, inspector extraordinaire, do hereby ask you all to aid me in rescuing my son and putting a stop to the Grand Sers' machinations!"},{"name":"CYR","text":"You know, there's really no need for all that. We came because we wanted to help."},{"name":"NASHUMHAKARACCA","text":"I, Nashu, faithful assistant, maker of explosives extraordinaire, do hereby present to you this fresh change of clothing!"},{"name":"HILDIBRAND","text":"Capital! I knew I could count on you, Nashu! I shall change en route!"},{"name":"HILDIBRAND","text":"Come, my friends! To Zenith, and to Gigi!"},{"name":"CYR","text":"Huh... To think that I stand in the heart of Dravanian territory. Me. How long ago was I scouring the streets for heretics..."},{"name":"NASHUMHAKARACCA","text":"His disguises may be amazing, but nothing beats the classic inspector look!"},{"name":"JULYAN","text":"Spendin' too much time at this high altitude can't be good for my skin..."},{"name":"GODBERT","text":"I say, what brilliant craftsmanship! How did they manage..."},{"name":"HILDIBRAND","text":"Make ready, my friends! The final battle with the Grand Sers is at hand!"},{"name":"HILDIBRAND","text":"Hurgh... 'Twould seem my wounds were more serious than I thought. I fear I am in no condition to confront our foes. There is but one thing that could restore me to my former indomitable self!"},{"name":"JULYAN","text":"Don't you worry, I've got some salamander oil right here. Shall mummy give her baby boy a massage?"},{"name":"HILDIBRAND","text":"Oh, my dearest mummy─ahem, mother dearest! I would not impose upon you─not when my ever-loyal associate, <span class=\"highlight\">Forename</span>, stands ready to minister to my muscles!"},{"name":"JULYAN","text":"Don't tell me you're embarrassed! Let mummy take care of little Hildy's hurts."},{"name":"GODBERT","text":"My dear wife, I know you mean well, but let <span class=\"highlight\">Forename</span> handle it. I can personally testify to the healing talents of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> strong-yet-tender fingers."},{"name":"GODBERT","text":"My dear wife, I know you mean well, but let <span class=\"highlight\">Forename</span> handle it. Theirs is a bond which transcends time and space and personal boundaries."},{"name":"JULYAN","text":"If that's the way of it... I'm countin' on ye, <span class=\"highlight\">Forename</span>."},{"name":"HILDIBRAND","text":"Let us brook no further delay! Come, my friend! Coat my body in oil, as you have done many a time before!"},{"name":"HILDIBRAND","text":"Why do you hesitate? Have we not done this time and time again? Oil me up, <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>!"},{"name":"JULYAN","text":"Oh, the memories..."},{"name":"GODBERT","text":"Salamander oil massages are something of a Manderville tradition─one I hope to pass on to little Gigi someday..."},{"name":"CYR","text":"...You may as well get on with it."},{"name":"NASHUMHAKARACCA","text":"I wish Inspector Hildibrand would let me oil him up!"},{"name":"HILDIBRAND","text":"Oooh, how it soothes my aches and pains! Quickly now─knead it into my flesh! Knead as you have never kneaded before!"},{"name":"HILDIBRAND","text":"Ahhh, the rel─ Gah! Such furious kneading! I applaud your enthusiasm, but mayhap I urged you to excessive force!"},{"name":"HILDIBRAND","text":"Hah...hah... Nay, you were in the right. Already the gentle warmth begins to spread throughout my body. The fires of righteousness burn anew in my breast..."},{"name":"GODBERT","text":"Hold, my son! Though your passion is renewed, you may yet be spurred to greater feats of Mandervillian strength!"},{"name":"GODBERT","text":"Derived from the purest essence of salamanders─the ancient legacy of House Manderville! Salamanderville! To you, my beloved son, now become a proud father, I bequeath this most sacred of oils!"},{"name":"HILDIBRAND","text":"Salamanderville!? Could it be that the legends were true!?"},{"name":"GODBERT","text":"Your muscles shall shine with the brilliance of a thousand suns! No mortal man will have the power to do you harm! Verily it is so, for by its grace did I once weather the slings and arrows of a bandit horde and bring my hammer of justice to bear upon their wicked heads!"},{"name":"GODBERT","text":"The time has come, <span class=\"highlight\">Forename</span>. Take this oil and help Hildy become the Manderville man he was meant to be!"},{"name":"HILDIBRAND","text":"I...I am ready for my final oiling, <span class=\"highlight\">Forename</span>!"},{"name":"NASHUMHAKARACCA","text":"But Inspector Hildibrand's already so shiny I think I might go blind!"},{"name":"HILDIBRAND","text":"Oh... Ohhh... Oh! The Salamanderville! How it flows into every nook and cranny! Quickly now, lay your hands upon me! Massage me with all your might!"},{"name":"HILDIBRAND","text":"Urrrgggh! Yeeeeees, yes! That's the spirit! I can feel it building and rising, rising!"},{"name":"HILDIBRAND","text":"Hurrrggghhh! Such passion, such fervor! I am the inferno unbound, the tempest unleashed! But I have not yet begun to pose!"},{"name":"HILDIBRAND","text":"Raaarrrggghhh!<br>I am...I am a Mande...Mander...<br>MANDERVILLE MAAAAAAAAAN!!!"},{"name":"HILDIBRAND","text":"Hah...hah... That Salamanderville is...my word. I have never felt so alive! Such vibrant colors, such intense sounds, such─&lt;sniff&gt; &lt;sniff&gt;─fragrant smells!"},{"name":"HILDIBRAND","text":"Mother, Father, <span class=\"highlight\">Forename</span>. 'Twas your oils and your strong-yet-tender fingers which opened my eyes to the glory of creation. I am a gentleman inspector reborn!"},{"name":"HILDIBRAND","text":"Onward, to Zenith! No matter the laws of nature they pervert or the limits they break, the Grand Sers can do naught to stop me!"},{"name":"HILDIBRAND","text":"Grand Sers! I have come for my son!"},{"name":"DORYS","text":"Oh, must we do this now? We have a dragon to slay."},{"name":"CYR","text":"There is no need for any of this! The war is over!"},{"name":"DORYS","text":"But not for long. The wyrm's death will give rise to a new era of fire and blood─and we, having consumed his eyes, will use our new powers to win untold glory on the battlefield! Our legends will echo in eternity!"},{"name":"CYR","text":"You would doom countless innocents for glory!? No─I won't allow it! Over my dead body!"},{"name":"ORLAND","text":"Far be it from us to deny you, then. This is the end for you..."},{"name":"ORLAND","text":"(-The Grand Sers-)The <span class=\"emphasis\">ultimate</span> end!"},{"name":"GODBERT","text":"Have faith, my love. He is our son."},{"name":"HILDIBRAND","text":"Gigi, my beautiful boy. Pray do not look on me with such pointy eyes. Let Papa Hildy take you home to our gazebo."},{"name":"GIGI","text":"(-Vivi-)StOp CaLlInG mE tHaT! mY nAmE iS vIvI! vIvI! i ReMeMbEr EvErYtHiNg! My PoWeRs, My PuRpOsE─mY gRaNdPaPa QuAn!"},{"name":"GIGI","text":"(-Vivi-)I mAdE tHeM yOuNg AgAiN, bUt It'S nOt EnOuGh! I nEeD mOrE, mOrE─i NeEd ThE wYrM's EyEs! AnD tHeN i CaN fInAlLy BrInG hIm BaCk!"},{"name":"HILDIBRAND","text":"I'm sorry, Gigi, but no, you cannot. Grandpapa Quan is gone."},{"name":"CYR","text":"He's right, Gigi. Mayhap you could restore his corporeal form and breathe life into it...but his soul─what made him your grandpapa─is forever beyond your reach."},{"name":"GIGI","text":"(-Vivi-)ThAt'S nOt TrUe! I cAn ReStOrE aNyThInG tO iTs IdEaL fOrM! tO tHe WaY iT sHoUlD bE! eVeN gRaNdPaPa QuAn! EvEn YoU, pApA hIlDy!"},{"name":"CYR","text":"Please, Gigi, you have to stop! If you keep using your power, you'll die!"},{"name":"GIGI","text":"(-Vivi-)I...i DoN't UnDeRsTaNd! YoUr ClOtHeS aRe StIlL dIrTy AnD tAtTeReD..."},{"name":"HILDIBRAND","text":"As they should be, Gigi, for my every waking moment is as the gods intended! Every day I live life to the fullest! Every day I enjoy grand adventures!"},{"name":"CYR","text":"I found your grandpapa's research notes. What he gave you wasn't the power to make things the way they were..."},{"name":"CYR","text":"He gave you the power to change the world─to make things the way you yourself believed they should be! That's why your magicks have no effect on the inspector! Because you know in your heart that this battered and bruised form of his is, in its own way...right."},{"name":"HILDIBRAND","text":"My thoughts exactly, Inquisitor Cyr! And it is for this selfsame reason that you were unable to make Grandmaster Quan younger!"},{"name":"HILDIBRAND","text":"In your heart you knew there was naught that needed to be changed! Your beloved grandpapa was exactly as he should be! Your every day was to be treasured and worthy of celebration!"},{"name":"GIGI","text":"(-Vivi-)ThEn...ThEn WhAt AbOuT tHe GrAnD sErS!? wHy WaS i AbLe To MaKe ThEm YoUnG aGaIn!?"},{"name":"CYR","text":"All you truly knew of them were the stories they told. Wondrous tales of derring-do by heroes in the prime of their lives. It's no wonder you were able to envision them as such."},{"name":"GIGI","text":"(-Vivi-)ThAt'S aLl ThEy EvEr TaLkEd AbOuT. wHeN tHeY wErE yOuNg AnD fReE aNd FuLl Of FiRe..."},{"name":"CYR","text":"At first, Archmagus Quan didn't understand the true nature of your abilities. He struggled to deduce why you could not make him younger as he originally intended."},{"name":"CYR","text":"Eventually he realized that your fond memories of him were preventing you from conceiving of him as anything but an elderly creator...and that the only way to achieve his goal would be to take them from you..."},{"name":"CYR","text":"But you were all he had left in the world. No longer a mere mammet, but a friend. Family. His only family. His grandson. He couldn't bear to lose you, so he renounced his quest for immortality!"},{"name":"GIGI","text":"(-Vivi-)BuT i StIlL lOsT mY mEmOrIeS iN tHe EnD..."},{"name":"CYR","text":"He was afraid of leaving you all alone in the world─afraid that others would attempt to take advantage of you and your magicks. So before he died, he decided to take your memories from you after all. To protect you."},{"name":"CYR","text":"But despite his best efforts, something remained. Something stronger and more powerful and more resilient than anything Archmagus Quan ever dared dream..."},{"name":"CYR","text":"You were never broken, Gigi. You were never abandoned. All he wanted was to set you free!"},{"name":"GIGI","text":"(-Vivi-)FrEe? FrEe...To Do WhAt?"},{"name":"HILDIBRAND","text":"Whatever you like, Gigi, don't you see? That was his final gift to you─a new life! A new story all your own!"},{"name":"DORYS","text":"This has all been very, very touching, but we're not getting any younger. Well, <span class=\"emphasis\">you</span> aren't, at any rate."},{"name":"DORYS","text":"We have suffered your meddling long enough. I had intended to use this trap to kill the wyrm, but since you are so perfectly positioned..."},{"name":"GIGI","text":"I aM vIvI, gRaNdSoN oF aRcHmAgUs QuAn, AnD gIgI, sOn Of HiLdIbRaNd HeLiDoR mAxImIlIaN mAnDeRvIlLe! AnD tHiS iS mY sToRy!"},{"name":"CYR","text":"It's like it never happened. With the last of his strength he turned back the hands of time..."},{"name":"CYR","text":"Not just for the pillars, but for us all. He made us all as we once were. As we were meant to be."},{"name":"JULYAN","text":"After all that gallivantin' about I get bugger all!? What about my misspent youth!? I was <span class=\"emphasis\">not</span> meant to be this bloody old!"},{"name":"GODBERT","text":"Hah hah hah! Such a fine day. Never have I squatted with such perfect form! I may well have reached my physical peak!"},{"name":"DORYS","text":"Hah! What rot. Act your age, you daft sod. You look foolish!"},{"name":"CYR","text":"You should be grateful. Gigi saw what you had become and gave you a second chance."},{"name":"DORYS","text":"That was our second chance. To relive our glory days..."},{"name":"ORLAND","text":"...It was all rather silly, though, wasn't it? Maybe Quan had the right of it. Maybe it's not so bad growing old..."},{"name":"GONSPART","text":"I was a coward when I was young. But now that I'm old, I'm not afraid to say things like, “I love you, Dorys...”"},{"name":"DORYS","text":"You're a blind, bloody fool, Gonspart..."},{"name":"HILDIBRAND","text":"I say...am I dead again?"},{"name":"CYR","text":"Quite alive, Inspector, along with everyone else, thanks to Gigi. The Grand Sers are also in our custody."},{"name":"HILDIBRAND","text":"Hah hah hah! That's my boy! Where is the little tyke anyway?"},{"name":"CYR","text":"Gigi, he... Gigi embarked on a grand new adventure.<br>He's...he's no longer with us."},{"name":"HILDIBRAND","text":"...I see.<br>If that's what he wanted, then...then I could not be happier for him. I am sure Archmagus Quan would feel the same way."},{"name":"NASHUMHAKARACCA","text":"What do we do now, Inspector?"},{"name":"HILDIBRAND","text":"Is it not obvious, Nashu? The wide, wide world beckons to us, with the promise of mystery and wonder! We shall resume our never-ending quest for cases perplexing and profound, and perhaps, one day...we shall meet young Gigi again."},{"name":"JULYAN","text":"&lt;sigh&gt; I hate to admit it, but this whole mess got me thinkin' that maybe...maybe it wouldn't be so bad if I really did have a grandson..."},{"name":"JULYAN","text":"Ye did right by Gigi, Hildy. Yer father and I can see that. We're proud of the man ye've become."},{"name":"HILDIBRAND","text":"And I am proud of you too, Mother, for finally coming to terms with the ephemeral nature of physical beauty and allowing yourself to age gracefully."},{"name":"JULYAN","text":"\"Gracefully,“ was it...?"},{"name":"HILDIBRAND","text":"I fear we may have had a failure to communicaaaaaaaaate!"},{"name":"NASHUMHAKARACCA","text":"There he goes again! Wait for me, Inspector! Waaaaaait!"},{"name":"HILDIBRAND","text":"Hark! What is that curious light I spy in the far eastern skies? And this oh-so-familiar scent which fills my nostrils! &lt;sniff&gt; &lt;sniff&gt; Do I smell...a case!?"},{"name":"HILDIBRAND","text":"Worry not for me, my friends! For wherever the wronged want for succor, I, Hildibrand, shall be there! Till we meet again!"},{"name":"GODBERT","text":"...I say, you <span class=\"emphasis\">do</span> know that so long as the core remains intact, little Gigi is not actually dead?"},{"name":"JULYAN","text":"That's right. So dry yer tears, boy. There's no need for all this mopin' about."},{"name":"GODBERT","text":"He has fallen into a dormant state because he used up all his aether. His core will gradually recharge as it draws upon the ambient aether, and in time he will awaken from his torpor."},{"name":"GODBERT","text":"I shall tend to the child for now."},{"name":"GODBERT","text":"As for these three, I should be glad to take them back to Ishgard in your stead."},{"name":"CYR","text":"A most generous offer, my lord, but hardly necessary. After all, 'tis my duty to bring them to justice─"},{"name":"CYR","text":"...Oh, yes. It <span class=\"emphasis\">was</span> my duty. After everything I said to that young inquisitor, I can't go back to Ishgard. They'll toss me in a gaol and throw away the key if they don't kill me outright..."},{"name":"JULYAN","text":"So go to Idyllshire and live in Hildy's gazebo. Someone ought to look after it while he's away, no?"},{"name":"CYR","text":"That...doesn't sound all that bad, actually. Full glad I am to accept your offer!"},{"name":"JULYAN","text":"&lt;sigh&gt; I suppose there's nothin' for it but to wait until he comes back down..."},{"name":"GODBERT","text":"'Twas a most graceful strike, my love. You haven't lost your touch..."},{"name":"CYR","text":"I suppose there's nothing for it but to leave the Grand Sers to Lord Godbert, and for me to see to Inspector Hildibrand's gazebo..."},{"name":"CYR","text":"I'd like to thank you for everything you've done. If you find yourself in Idyllshire, come and see me. There are a few arrangements that I need to make, but I can't imagine that it will take that long for me to settle in."},{"name":"CYR","text":"Thank you, my friend. Until we meet again."},{"name":"CYR","text":"Looking back on the course I've run, it's hard not to think of the man I was and feel ashamed."},{"name":"CYR","text":"Before I took on this case I had only left the capital a handful of times. The rubbish I believed, the “facts” I considered unassailable. Fury take me, what a fool I was."},{"name":"CYR","text":"If I hadn't met you, and the inspector, and Gigi, I would have never realized how much I had come to hate my job. Nor would I have discovered how much more satisfying it is to seek out the truth─the whole truth."},{"name":"CYR","text":"One might say that getting labeled a heretic and having to flee Ishgard is the best thing that could have happened to me. After all, now I am free to start a new life here in Idyllshire as a consulting inspector..."},{"name":"CYR","text":"Ah, but enough of that. There is someone I would like you to meet."},{"name":"CYR","text":"Lord Godbert made some modifications, as you can see. His smaller size should allow him to absorb aether more effectively over time. We thought that, if he were to travel with you and share in your grand adventures that maybe...maybe it would hasten his reawakening..."},{"name":"CYR","text":"Thank you, my friend. I do hope our paths cross again someday. May the Fury bless you and keep you."}],"reward":{"gil":5000,"items":[{"id":17529}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67907]},"next":[68544]},"partials":[{"type":"npc","id":"1018463","obj":{"i":1018463,"n":"Hildibrand","l":2000,"q":1}},{"type":"npc","id":"1018456","obj":{"i":1018456,"n":"Cyr","l":2082,"q":1}},{"type":"npc","id":"1018459","obj":{"i":1018459,"n":"Cyr","l":2002,"q":1}},{"type":"npc","id":"1018460","obj":{"i":1018460,"n":"Orland","l":2000,"q":2}},{"type":"npc","id":"1018461","obj":{"i":1018461,"n":"Nashu Mhakaracca","l":2000,"q":2}},{"type":"npc","id":"1018462","obj":{"i":1018462,"n":"Julyan","l":2000,"q":2}},{"type":"npc","id":"1018465","obj":{"i":1018465,"n":"Cyr","l":2000,"q":1}},{"type":"npc","id":"1018467","obj":{"i":1018467,"n":"Godbert","l":2000,"q":1}},{"type":"npc","id":"1018468","obj":{"i":1018468,"n":"Hildibrand","l":2002,"q":1}},{"type":"npc","id":"1018469","obj":{"i":1018469,"n":"Nashu Mhakaracca","l":2002,"q":1}},{"type":"npc","id":"1018470","obj":{"i":1018470,"n":"Cyr","l":2002,"q":1}},{"type":"npc","id":"1018471","obj":{"i":1018471,"n":"Julyan","l":2002,"q":1}},{"type":"npc","id":"1018472","obj":{"i":1018472,"n":"Godbert","l":2002,"q":1}},{"type":"item","id":"17529","obj":{"i":17529,"n":"Gigi","l":1,"c":59630,"t":81}},{"type":"quest","id":"67907","obj":{"i":67907,"n":"The Proud and the Pointy-eyed","g":69,"l":"Ishgard","s":36,"f":1}},{"type":"quest","id":"68544","obj":{"i":68544,"n":"A Hingan Tale: Nashu Goes East","g":70,"l":"Kugane","s":10,"f":1}}]}