{"quest":{"name":"Naughty or Nice","location":"Ul'dah","id":67911,"patch":3.45,"sort":120,"icon":100595,"eventIcon":71221,"issuer":1017814,"target":1018114,"genre":204,"journal":["'Tis the season, and Amh Garanjy seeks a kind-hearted soul to help her work miracles.<br>※This quest is available for a limited time only.","Ever eager to fulfill her duty as a Starlight celebrant, Amh Garanjy is sparing no effort to bring happiness and good cheer to the children of the realm. Much to her chagrin, a parcel containing gifts for some unfortunate younglings has been mislaid or stolen, and she would seek your aid in retrieving it. So it is that you set forth for the Ruby Road Exchange, in hopes of delivering some much-needed joy to these boys and girls who are most wanting of smiles.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The case of the missing parcel is solved: it was pilfered and hidden by one of the very younglings it was intended for, a boy who─unaware of the package's contents─stole away with it and hid it as a prank meant to rattle one of the physicians at the children's ward, where he is a patient. The raven-haired registrar there will surely be overjoyed to hear that the package has been retrieved safe and sound.","The raven-haired registrar rejoices at receiving the missing package, before asking you if he might ask you to work one more miracle this Starlight. Should you be in the giving mood, you need only speak with him anew."],"objectives":["Search for the special delivery.","Deliver the special delivery to the raven-haired registrar at Frondale's Phrontistery."],"dialogue":[{"name":"AMHGARANJY","text":"Beg pardon, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, but might you perchance be an adventurer? 'Tis Starlight season, and I'm searching for a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who might help me work miracles."},{"name":"AMHGARANJY","text":"Why, if it isn't my favorite miracle worker from Starlights past! Might you be so kind as to lend me your aid once more? It would mean the world to the children."},{"name":"AMHGARANJY","text":"As you know, the Starlight Celebration is a time to celebrate the children of the realm─our hope and our future. As a Starlight celebrant, it is my sworn duty to see happiness and good cheer duly doled out to all boys and girls, particularly those whose daily lives afford them few reasons to smile."},{"name":"AMHGARANJY","text":"To that end, I've planned a special delivery for the younglings in the children's ward at Frondale's Phrontistery, but I fear things have hit a snag─the parcel has vanished!"},{"name":"AMHGARANJY","text":"I trust it has only been misplaced and not stolen─what black-hearted wretch would deny those poor children a rare moment of good cheer? I would search for it myself, but I fear my duties as a celebrant keep me from leaving my post. Might you be so kind as to go looking in my stead?"},{"name":"AMHGARANJY","text":"Oh, thank you, friend! With you on the job, I'm sure the children will be beaming with smiles within bells. The package is a large box engraved with the mark of Frondale's Phrontistery. One of my assistants says they saw a boy toting a similar box at the Ruby Road Exchange─perhaps you might begin your search there?"},{"name":"AMHGARANJY","text":"Should you find the parcel, pray deliver it directly to the registrar at Frondale's. You have my heartfelt gratitude for your assistance─and remember, it's not just me that's counting on you to work miracles."},{"name":"REAUVERRE","text":"H-Hey! Where are you taking that crate? I hid it there for a reason, you know!"},{"name":"REAUVERRE","text":"It's wh-what? I saw the mark on it and assumed it belonged to one of the physicians from the children's ward! I was only trying to have a little fun, I promise!"},{"name":"REAUVERRE","text":"I didn't mean to cause any trouble, honest! At least, not for you. So just...just take it and do whatever you want with it. And don't tell anyone you saw me here, okay? I don't want to get in trouble again!"},{"name":"DAMIELLIOT","text":"Greetings, adventurer. Hm? You have a delivery for me?"},{"name":"DAMIELLIOT","text":"Thank the heavens! When the goods the celebrant spoke of did not arrive at the designated time, I feared this Starlight would be a lonesome one for our poor children. Pray tell, wherever did it disappear to?"},{"name":"DAMIELLIOT","text":"...I see. Thank you for your honesty, and fear not─we will not punish the boy. The younglings here do not live easy lives, but they have good hearts. I shall do what I can to see that they all have cause to smile today."},{"name":"DAMIELLIOT","text":"On that subject, might I ask one more favor of you? I realize we have troubled you enough already, but I am certain it would bring the children no end of delight. If you would not be averse to helping us, pray speak with me again."}],"reward":{"gil":229,"items":[{"id":16612}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[67912]},"partials":[{"type":"npc","id":"1017814","obj":{"i":1017814,"n":"Amh Garanjy","l":40,"q":1}},{"type":"npc","id":"1018114","obj":{"i":1018114,"n":"Raven-haired Registrar","l":41,"q":2}},{"type":"item","id":"16612","obj":{"i":16612,"n":"Starlight Robe","l":1,"c":42531,"t":35,"p":156}},{"type":"quest","id":"67912","obj":{"i":67912,"n":"Think of the Children","g":204,"l":"Ul'dah","s":121}}]}