{"quest":{"name":"Future Proof","location":"Azys Lla","id":67915,"patch":3.45,"sort":8,"repeatable":1,"icon":100599,"unlocksFunction":1,"eventIcon":71342,"issuer":1016135,"target":1016135,"involved":[1018189],"genre":74,"usedItems":[16064],"journal":["Ardashir is contemplating the present state of the anima.<br>※Changing classes or jobs will prevent progress during this quest.","Ardashir is seemingly satisfied with the results of his research thus far─so much so, that he soon plans to return to Radz–at–Han where he will present his findings. Gerolt, on the other hand, is baffled by this presumption, and wastes no time reprimanding him. Ardashir reluctantly accepts the truth─that their work is not yet complete─and soon offers a means to temporarily fortify the anima weapon. For his plan to work, however, it requires a ceruleum solution which he has commissioned from a skilled distiller in Idyllshire. While he begins other preparations for the anima weapon, he asks you to meet with this artisan, one Blamprest, in Idyllshire.<br><br>※You may not proceed with a class or job that is different from when you accepted this quest.","Blamprest assures you work on Ardashir's order is well underway. He has been delayed, however, by a need for singing clusters. Though difficult to acquire, he has entrusted the task to a pair of sisters─skilled mages who agreed to help...for a price. No sooner does he mention the pair than they appear before you seeking compensation for their work. Much to your surprise─and dismay─he tells them that you have eagerly agreed to pay for them in his stead. They have yet to explain how you must pay them, but as your only alternative is to bargain at Rowena's Center for Cultural Promotion, you steel yourself to undertake trials of unknown peril.","After subjecting yourself to the peculiar whims of Amphelice and Angelet, you at last deliver the singing clusters to Blamprest, who then crafts for you the elixir needed for the anima weapon's fortifying potion. With your work complete and the elixir in hand, he bids you safe travels back to Azys Lla.","You return to Azys Lla, elixir in hand. The second bottle you place on Ardashir's workbench, however, leaves him perplexed. When you explain to him it was an order for spirits placed by Gerolt, he then comes to a sudden and startling realization─Gerolt squandered a portion of the money lent to them by Rowena to make the purchase. Though he is furious, he cannot deny the strange yet beneficial effects of alcohol on Gerolt's work. After regaining his composure, he completes his potion, and sets Gerolt to work on fortifying the anima weapon. Much to their delight, Ardashir's plan was a success. Moreover, he goes on to show you an Allagan droid that may be the key to ensuring the anima's longevity, assuming it can be repaired.<br><br>※ The attributes of the anima weapon can be reallocated by speaking with Ulan in Idyllshire."],"objectives":["With <span class=\"alternative-container\"><span class=\"alternative\">Sword of the Twin Thegns and Shield of the Twin Thegns</span><span class=\"alternative\">Sultan's Fists</span><span class=\"alternative\">Axe of the Blood Emperor</span><span class=\"alternative\">Trident of the Overlord</span><span class=\"alternative\">Bow of the Autarch</span><span class=\"alternative\">Cane of the White Tsar</span><span class=\"alternative\">Rod of the Black Khan</span><span class=\"alternative\">Book of the Mad Queen</span><span class=\"alternative\">Word of the Magnate</span><span class=\"alternative\">Spurs of the Thorn Prince</span><span class=\"alternative\">Flame of the Dynast</span><span class=\"alternative\">Guillotine of the Tyrant</span><span class=\"alternative\">Sphere of the Last Heir</span></span> equipped or in your inventory, speak with Blamprest in Idyllshire.","<span class=\"alternative-container\"><span class=\"alternative\"> Collect the singing clusters.</span><span class=\"alternative\">Sword of the Twin Thegns and Shield of the Twin Thegns</span><span class=\"alternative\">Sultan's Fists</span><span class=\"alternative\">Axe of the Blood Emperor</span><span class=\"alternative\">Trident of the Overlord</span><span class=\"alternative\">Bow of the Autarch</span><span class=\"alternative\">Cane of the White Tsar</span><span class=\"alternative\">Rod of the Black Khan</span><span class=\"alternative\">Book of the Mad Queen</span><span class=\"alternative\">Word of the Magnate</span><span class=\"alternative\">Spurs of the Thorn Prince</span><span class=\"alternative\">Flame of the Dynast</span><span class=\"alternative\">Guillotine of the Tyrant</span><span class=\"alternative\">Sphere of the Last Heir</span><span class=\"alternative\">With  equipped or in your inventory, deliver the singing clusters to Blamprest in Idyllshire.</span></span>","With <span class=\"alternative-container\"><span class=\"alternative\">Sword of the Twin Thegns and Shield of the Twin Thegns</span><span class=\"alternative\">Sultan's Fists</span><span class=\"alternative\">Axe of the Blood Emperor</span><span class=\"alternative\">Trident of the Overlord</span><span class=\"alternative\">Bow of the Autarch</span><span class=\"alternative\">Cane of the White Tsar</span><span class=\"alternative\">Rod of the Black Khan</span><span class=\"alternative\">Book of the Mad Queen</span><span class=\"alternative\">Word of the Magnate</span><span class=\"alternative\">Spurs of the Thorn Prince</span><span class=\"alternative\">Flame of the Dynast</span><span class=\"alternative\">Guillotine of the Tyrant</span><span class=\"alternative\">Sphere of the Last Heir</span></span> in your inventory, deliver the distilled ceruleum and moonrise to Ardashir in Azys Lla."],"dialogue":[{"name":"SYSTEM","text":"Please note that upon completing the quest “Future Proof,” you will receive an anima weapon for <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Undertake this quest as another job."},{"name":"A2","text":"Undertake this quest as <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span>."},{"name":"SYSTEM","text":"Be advised that once you have undertaken this quest, you may not proceed with a class or job that is different from when you accepted it."},{"name":"SYSTEM","text":"Please ensure that you have changed to your desired job before speaking with Ardashir."},{"name":"SYSTEM","text":"In order to receive the quest “Future Proof,” you must be equipped with [Error] and [Error]."},{"name":"SYSTEM","text":"In order to receive the quest “Future Proof,” you must be equipped with [Error]."},{"name":"SYSTEM","text":"You have already received [Error] and [Error]. Please change to a different job and speak with Ardashir again."},{"name":"SYSTEM","text":"You have already received [Error]. Please change to a different job and speak with Ardashir again."},{"name":"ARDASHIR","text":"Now that the anima can maintain a form seen even by those without your abilities, it is fair to say my research is all but complete. Our last task being to refine any abilities it has gained thus far."},{"name":"ARDASHIR","text":"Once that is finished, I shall return to Radz–at–Han and make ready to present my findings. I daresay our work here shall forever change the study of arcane summoning as we know it."},{"name":"GEROLT","text":"The hells are you on about, boy? Now I understand bein' excited, what with us finally seein' the anima an' all, but I think yer losin' sight o' what our work is all about."},{"name":"ARDASHIR","text":"Preposterous! The goal of <span class=\"emphasis\">my</span> work was to create a sentient being capable of independent thought, which could then serve to help others."},{"name":"GEROLT","text":"That right? An' ye really think ye've accomplished that? Bollocks! Ain't no way somethin' what's grown that much, that fast, can be in any kind o' stable condition."},{"name":"GEROLT","text":"We've poked an' prodded the damn thing more times than I'd care to count, an' by the grace o' Rhalgr we've somehow managed not to mess things up. But tell me this: what happens when we're not around when a new weapon needs smithin', hm?"},{"name":"GEROLT","text":"I'll tell ye what─it'll grow too big for its aetherial britches and keel over. What the anima needs now is a body what'll handle it no matter how strong it gets. Until we can figure that, yer <span class=\"emphasis\">work</span> amounts to naught but piss in a kettle if ye ask me."},{"name":"GEROLT","text":"Oh, but what do I know. I'm just a know-nothin' sot with a hammer. No doubt a refined, scholarly lad such as yerself has already considered such complications."},{"name":"ARDASHIR","text":"Hmph! The only thing more insufferable than a drunkard...is when he is right. I was so blinded by its radiance, I did not stop to consider the future, putting my own desires before the needs of the anima."},{"name":"GEROLT","text":"Right, well, there'll be plenty o' time fer mopin' after we've finished, and I'm free from that witch Rowena. Fer now, we need to think up a way to give the anima a new, permanent home."},{"name":"GEROLT","text":"The weapon holdin' it now should be fine fer the time bein'. You just keep an eye on the anima while we figure out the rest."},{"name":"ARDASHIR","text":"Actually, I may already have a solution─albeit an interim one─thanks in part to Ulan and her studies."},{"name":"ARDASHIR","text":"We were working on a potion of sorts to fortify the anima weapon, that it might abide further growth. The difficulty proved in our need for ceruleum. It would need to be distilled to serve our purposes, and we simply had not the means to do so."},{"name":"ARDASHIR","text":"As fortune would have it, though, we caught word of a renowned distiller recently come to Idyllshire and immediately sought him out. After making our case he was all too happy to assist. Blamprest is his name. Would you pay him a visit and see how things are coming along?"},{"name":"ARDASHIR","text":"There are other preparations to be made, of course, but Gerolt and I will see to them. Everything should be in order upon your return."},{"name":"GEROLT","text":"Blamprest, eh? That gives me an idea..."},{"name":"ARDASHIR","text":"Prepared to enhance yet another anima, are we? There is still much to be done before we can craft a new soulstone and weapon, mind you, but for now another potion should ensure its safety until we are ready."},{"name":"ARDASHIR","text":"For that, we will need to commission more distilled ceruleum from Blamprest."},{"name":"ARDASHIR","text":"I have already placed an order for another bottle, so while we see to things here, I would have you go and speak with him. There is naught we can do for the anima without it."},{"name":"GEROLT","text":"Aye, and you tell Blamprest we'll settle fer nothin' less than his very best, ye hear?"},{"name":"BLAMPREST","text":"Welcome, friend. What can I do for you?"},{"name":"BLAMPREST","text":"An order for whom? Oh, yes. That scholarly fellow. Ardashir, was it? Work on his order is well underway."},{"name":"BLAMPREST","text":"Working with ceruleum is no easy task, though. Distilling a substance so volatile demands a substantial concentration of aether, the only source potent enough being singing clusters. Quite the rarity, you know. And for an order like this, why, it would require fifty at the very least."},{"name":"BLAMPREST","text":"Procuring such oddities is beyond my abilities, but I have enlisted the aid of two fine young mages to see the job done. If only the price of their services was not so steep..."},{"name":"AMPHELICE","text":"(-Brusque Businesswoman-)There you are. We've brought what you asked for. I trust you're prepared to hold up your end of the deal?"},{"name":"BLAMPREST","text":"My, what fortuitous timing! This <span class=\"alternative-container\"><span class=\"alternative\">young lady</span><span class=\"alternative\">gentleman</span></span> here was just telling me how <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> would love nothing more than to offer you <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> services in my stead."},{"name":"BLAMPREST","text":"Ahem. These are the two lovely ladies I was telling you about, remember? The ones collecting the singing clusters you require?"},{"name":"AMPHELICE","text":"Pleasure to make your acquaintance. My name is Amphelice, and this is my sister, Angelet."},{"name":"AMPHELICE","text":"I will keep matters brief. Blamprest agreed to undertake certain...tasks, in exchange for our help. If you would serve in his place, we will compensate you with the clusters you seek. Agreed?"},{"name":"BLAMPREST","text":"Splendid. Now that that's settled, I'll leave you to it. When you have what we need, come back and I shall see about distilling that elixir."},{"name":"BLAMPREST","text":"Ah, that reminds me. A merchant in Rowena's employ deals in singing clusters. I believe it was Hismena? Their names all sound alike. At any rate, if you find their tasks to be too much trouble, you can always try striking a deal with her."},{"name":"BLAMPREST","text":"Ah, well if it isn't my favorite customer. Come for another bottle of distilled ceruleum?"},{"name":"AMPHELICE","text":"Then I shall be expecting more stories in exchange for our clusters."},{"name":"BLAMPREST","text":"As before, you'll need fifty in total. Any less and I cannot guarantee the quality of my work. When you have done all they require of you, return to me with the clusters. Everything should be ready by then."},{"name":"BLAMPREST","text":"Of course, if you feel their tasks are too demanding, you can always try haggling with Hismena. No doubt she would welcome the opportunity for more business."},{"name":"SYSTEM","text":"A repeatable quest is now available from both Amphelice and Angelet."},{"name":"SYSTEM","text":"By completing either of these repeatable quests, you will obtain singing clusters which can then be offered to Blamprest."},{"name":"SYSTEM","text":"Singing clusters may also be purchased from Hismena at Rowena's Center for Cultural Promotion."},{"name":"BLAMPREST","text":"Sorry, friend, but there's naught I can do without singing clusters."},{"name":"BLAMPREST","text":"Whether you acquire them through Amphelice and her sister, or by bargaining with Hismena, I shall leave that decision to you."},{"name":"BLAMPREST","text":"Judging by that smile I take it you have the clusters I require?"},{"name":"BLAMPREST","text":"Yes, yes, this will do nicely. Wait here just a moment."},{"name":"BLAMPREST","text":"There we are. One order of distilled ceruleum. Before you go, though, I must ask: if you work with Ardashir, you must also know Gerolt, correct? He placed an order for a bottle of my finest ale. Now that we're finished with Ardashir's commission, I'd like to take care of his, if that's all right with you."},{"name":"BLAMPREST","text":"Haha, you needn't worry about compensation, friend. He paid in advance. I only ask that you take his package with you."},{"name":"BLAMPREST","text":"It's been so long since he's come to see me. I was beginning to worry the moneylenders had finally done for him, or worse─he'd taken to a life of sobriety! In any event, I'm glad he seems back to his old self. Take care, and give them my regards."},{"name":"BLAMPREST","text":"There we are. Ardashir will be quite pleased, as I'm sure Gerolt will be as well."},{"name":"BLAMPREST","text":"Give them my best, and tell Gerolt I'm glad to see he's back to his old ways."},{"name":"BLAMPREST","text":"I imagine I will be staying here in Idyllshire for quite some time. If Ardashir should need more ceruleum, or Gerolt his spirits, you know where to find me."},{"name":"ARDASHIR","text":"Welcome back, <span class=\"highlight\">Forename</span>. We have accomplished much while you were away. In fact, I am quite close to a more permanent solution to our troubles."},{"name":"ARDASHIR","text":"But first, let us do what we can to fortify the anima's current vessel. Might I have a look at the sword and shield in question? Oh, and the distilled ceruleum, of course."},{"name":"ARDASHIR","text":"But first, let us do what we can to fortify the anima's current vessel. Might I have a look at the weapon in question? Oh, and the distilled ceruleum, of course."},{"name":"ARDASHIR","text":"Right, then. Now to prepare the potion."},{"name":"ARDASHIR","text":"...<span class=\"highlight\">Forename</span>, why exactly did Blamprest prepare <span class=\"emphasis\">two</span> bottles? Are they to be mixed together?"},{"name":"ARDASHIR","text":"Gerolt ordered a bottle of ale? If he had money to spend, he would be carousing in some filthy tavern, not here working off his debts. The only way he could afford that would be..."},{"name":"ARDASHIR","text":"Our funding! You selfish, beef-witted maltworm! You squandered our funds from Rowena on spirits!?"},{"name":"ARDASHIR","text":"Aye, that I did. Consider it payment owed fer remindin' you about bein' selfish yerself, all that blitherin' about bein' done with the anima."},{"name":"ARDASHIR","text":"Another bottle of ale!? By the gods, how am I to explain this to Rowena?"},{"name":"GEROLT","text":"...Don't give me that look. Ye know I can't do me best work without me muse. Now hurry up with that potion. <span class=\"highlight\">Forename</span>'s weapon ain't gonna hammer itself."},{"name":"ARDASHIR","text":"You truly are insufferable! When this is over you shall learn there are consequences for misspending others' money. Rowena's money."},{"name":"ARDASHIR","text":"Honestly, Gerolt, why could you not learn to forge weapons like an ordinary man. A sober man..."},{"name":"ARDASHIR","text":"&lt;sigh&gt; Calm yourself, Ardashir. There is work to be done."},{"name":"ARDASHIR","text":"There, the potion is done. All that remains is applying it to the anima weapon."},{"name":"ARDASHIR","text":"I leave the rest to you."},{"name":"GEROLT","text":"A right fine piece o' work, if I do say so meself."},{"name":"GEROLT","text":"A weapon made sharp with a brew o' pure ceruleum. Hm, I like the sound o' that─[Error]!"},{"name":"GEROLT","text":"A sword an' shield made sharp with a brew o' pure ceruleum. Hm, I like the sound o' that─[Error] and [Error]!"},{"name":"BUKINOSEIREI","text":"I feel a new strength welling within me. Does this mean, perhaps, I am reaching my full potential?"},{"name":"BUKINOSEIREI","text":"I feel a new strength shines brightly within me. Could this mean, perhaps, I am reaching my full potential?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You're almost there."},{"name":"A2","text":"I think you still have room to improve."},{"name":"A2","text":"..."},{"name":"BUKINOSEIREI","text":"You think so? Truly? I shall do my best not to disappoint you."},{"name":"BUKINOSEIREI","text":"You really think so? Then I must do all I can not to disappoint you."},{"name":"BUKINOSEIREI","text":"Yes, of course. I shall redouble my efforts to someday meet your expectations."},{"name":"BUKINOSEIREI","text":"Yes, of course. I was too hasty to hope for so much, so soon. I will do my best to meet your expectations."},{"name":"BUKINOSEIREI","text":"I cannot read your thoughts, but I think your silence makes the answer quite clear."},{"name":"BUKINOSEIREI","text":"I will become stronger, <span class=\"highlight\">Forename</span>. Together we shall see what I am capable of."},{"name":"BUKINOSEIREI","text":"Would that I could read your thoughts... Still, your silence tells me much."},{"name":"BUKINOSEIREI","text":"I will become stronger, <span class=\"highlight\">Forename</span>. Together we shall discover my true potential."},{"name":"ARDASHIR","text":"'Tis good to see our work was a success. The anima seems stronger than before, yet its vessel remains sound."},{"name":"ARDASHIR","text":"Ah, yes. Speaking of the vessel, I must tell you of our soon-to-be permanent solution to handling the anima's growth!"},{"name":"ARDASHIR","text":"We will forge not just a new weapon, but a new soulstone to house its essence."},{"name":"ARDASHIR","text":"In my quest to find a means to do so, I happened upon something quite interesting. Wait here a moment."},{"name":"PROCESSSYSTEM","text":"&lt;beep&gt; &lt;beep&gt; Initializing synthesis protocols... Please insert materials."},{"name":"ARDASHIR","text":"What do you think? This Allagan droid was no doubt used for work requiring precision beyond what any man is capable of. <span class=\"emphasis\">Used</span> being the operative word. Try as I might, whenever I initiate its production sequence..."},{"name":"ARDASHIR","text":"&lt;beep&gt; &lt;beep&gt; Internal error. Unable to process."},{"name":"ARDASHIR","text":"&lt;sigh&gt; The system crashes..."},{"name":"ARDASHIR","text":"It will take time, but mark my words: I shall repair this Allagan device."},{"name":"ARDASHIR","text":"Once repaired, I am confident I can fashion a new soulstone for the anima to last a thousand lifetimes."},{"name":"ARDASHIR","text":"And to my surprise, Gerolt has already taken the initiative to start work on a new weapon, one befitting the new heights to which our aetherial companion might climb. Rest assured we will contact you when preparations are complete."},{"name":"ARDASHIR","text":"Until next time, friend."},{"name":"ARDASHIR","text":"Another anima made safe. For now, at least. I look forward to the day it resides safely in its new vessel. I trust you will take good care of it until then."},{"name":"SYSTEM","text":"Your anima weapon has been sharpened, serving to harness the burgeoning strength within!"}],"reward":{"gil":1689,"items":[{"id":15237},{"id":15250},{"id":15238},{"id":15239},{"id":15240},{"id":15241},{"id":15245},{"id":15246},{"id":15247},{"id":15248},{"id":15242},{"id":15243},{"id":15244},{"id":15249}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":107}],"quests":[67864]},"next":[67916,67917,67932]},"partials":[{"type":"npc","id":"1016135","obj":{"i":1016135,"n":"Ardashir","l":2101,"q":11}},{"type":"npc","id":"1018189","obj":{"i":1018189,"n":"Blamprest","l":2082,"q":1}},{"type":"item","id":"15237","obj":{"i":15237,"n":"Sharpened Sword of the Twin Thegns","l":260,"c":30545,"t":2}},{"type":"item","id":"15250","obj":{"i":15250,"n":"Sharpened Shield of the Twin Thegns","l":260,"c":30138,"t":11}},{"type":"item","id":"15238","obj":{"i":15238,"n":"Sharpened Sultan's Fists","l":260,"c":31113,"t":1}},{"type":"item","id":"15239","obj":{"i":15239,"n":"Sharpened Axe of the Blood Emperor","l":260,"c":31517,"t":3}},{"type":"item","id":"15240","obj":{"i":15240,"n":"Sharpened Trident of the Overlord","l":260,"c":31917,"t":5}},{"type":"item","id":"15241","obj":{"i":15241,"n":"Sharpened Bow of the Autarch","l":260,"c":32312,"t":4}},{"type":"item","id":"15245","obj":{"i":15245,"n":"Sharpened Cane of the White Tsar","l":260,"c":32693,"t":9}},{"type":"item","id":"15246","obj":{"i":15246,"n":"Sharpened Rod of the Black Khan","l":260,"c":33061,"t":7}},{"type":"item","id":"15247","obj":{"i":15247,"n":"Sharpened Book of the Mad Queen","l":260,"c":33554,"t":10}},{"type":"item","id":"15248","obj":{"i":15248,"n":"Sharpened Word of the Magnate","l":260,"c":33555,"t":98}},{"type":"item","id":"15242","obj":{"i":15242,"n":"Sharpened Spurs of the Thorn Prince","l":260,"c":33899,"t":84}},{"type":"item","id":"15243","obj":{"i":15243,"n":"Sharpened Guillotine of the Tyrant","l":260,"c":34272,"t":87}},{"type":"item","id":"15244","obj":{"i":15244,"n":"Sharpened Flame of the Dynast","l":260,"c":34673,"t":88}},{"type":"item","id":"15249","obj":{"i":15249,"n":"Sharpened Sphere of the Last Heir","l":260,"c":34872,"t":89}},{"type":"item","id":"16064","obj":{"i":16064,"n":"Singing Cluster","l":1,"c":20027,"t":54}},{"type":"quest","id":"67864","obj":{"i":67864,"n":"A Dream Fulfilled","g":74,"l":"Azys Lla","s":6,"r":1,"f":1}},{"type":"quest","id":"67916","obj":{"i":67916,"n":"Seeking Inspiration","g":74,"l":"Idyllshire","s":9,"r":1,"f":1}},{"type":"quest","id":"67917","obj":{"i":67917,"n":"Cut from a Different Cloth","g":74,"l":"Idyllshire","s":10,"r":1,"f":1}},{"type":"quest","id":"67932","obj":{"i":67932,"n":"Born Again Anima","g":74,"l":"Azys Lla","s":11,"r":1,"f":1}}]}