{"quest":{"name":"A Starlight Story","location":"Ul'dah","id":67914,"patch":3.45,"sort":123,"interval":"daily","repeatable":1,"icon":100598,"eventIcon":71222,"issuer":1017811,"target":1017811,"genre":204,"journal":["Damielliot beams an exultant smile at your return.<br>※This quest is available for a limited time only.","Unable to conceal his joy at the sight of your face, Damielliot bids you tell a tale of your adventures across the realm as a special Starlight gift to the younglings. When you are ready, make for the innermost chamber, where Reauverre and his friends eagerly await you.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","After regaling the children with a choice story from your many feats of bravery and derring-do, Damielliot invites you to retire for a well-earned rest. Drifting off to slumber, you are greeted in your dreams by what could only be one of the saint's little helpers. You awaken and rise to see a carefully wrapped gift sitting beneath the Starlight tree...","Feeling a sense of awe and wonder, you take the carefully wrapped package into hand. Could this truly be a Starlight gift sent to you by the Saint of Nymeia himself? Mayhap Damielliot might be able to offer some insight.","With a knowing smile, Damielliot explains that the gift was prepared by the children and himself, as a show of their gratitude for the kindness you showed them this Starlight─while conceding that the vision you saw suggests that other forces may have had a hand in this miracle. Should you care to bring yet more merriment and good cheer to the younglings, you are welcome to return to the children's ward as often as you like before the season is through."],"objectives":["Speak with Reauverre.","Obtain the saint-sent gift.","Show the saint-sent gift to Damielliot."],"dialogue":[{"name":"DAMIELLIOT","text":"Ah, adventurer! Your return heartens the children and me as well. I know we have imposed on your generosity quite enough already, but I was wondering─might you be willing to spare a few moments of your time?"},{"name":"DAMIELLIOT","text":"In your travels across the realm, surely you have seen wondrous sights of which the children in my care could scarcely dream. It would be an ever-so-special Starlight gift to them if you could regale them with a tale of your adventures. What do you say?"},{"name":"DAMIELLIOT","text":"Oh, thank you, my friend! I am certain your story will bring them no end of wonder and joy. I will gather the children in the innermost room. Pray meet us there when you are ready to tell your tale."},{"name":"DAMIELLIOT","text":"Ah, adventurer! Once more, your presence illuminates our humble halls like a shining star in the sky. Have you perchance come to share another of your tales with the children?"},{"name":"DAMIELLIOT","text":"Thank you, my friend! Truly, your benevolence knows no bounds. I will summon the children to the innermost chamber as before. Pray join us there when you are ready."},{"name":"DAMIELLIOT","text":"Just look at the eager anticipation in the eyes of the chlidren, friend─they simply cannot wait to hear your tale. And I am not embarrassed to say that I am quite looking forward to it as well!"},{"name":"REAUVERRE","text":"That's <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, everyone! So, what story will you tell us today? My friends and I do love a good tale!"},{"name":"Q1","text":"What tale will you tell the children?"},{"name":"A1","text":"Of fun and games at the Gold Saucer."},{"name":"A1","text":"Of beasts wondrous and rare."},{"name":"A1","text":"Of your adventures in Limsa Lominsa."},{"name":"A1","text":"Of your adventures in Gridania."},{"name":"A1","text":"Of your adventures in Ul'dah."},{"name":"A1","text":"Of great nations and those who lead them."},{"name":"A1","text":"Of the menace of an empire."},{"name":"A1","text":"Of primals and beastmen."},{"name":"A1","text":"Of the Dragonsong War."},{"name":"REAUVERRE","text":"Thank you, friend! Why, that was one of the most exciting stories I've ever heard! Well, everyone? I told you <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> stories would be the best!"},{"name":"DAMIELLIOT","text":"...Indeed you did, Reauverre. Friend, your tale was such a rousing one that when I closed my eyes, for a moment I could swear I was journeying at your side."},{"name":"DAMIELLIOT","text":"But as is oft the case, joyous times pass swiftest of all, and the hour grows late. What say you rest here for the night, friend? This room is empty at the moment, and you have more than earned yourself a respite. I shall see you on the morrow."},{"name":"GODBERT","text":"Ho ho ho! I say, it is good to see you again, my friend─ah, we have met before, have we not? It is I, the wandering pilgrim known far and wide for gifting gifts to assiduous adventurers such as yourself!"},{"name":"GODBERT","text":"In truth, I had a mind to wield my hammer of legend and forge for you a masterwork of goldsmithery worthy of your efforts, but I fear that my attention was required...elsewhere. But worry not, for I have procured a present which should more than suffice as a substitute!"},{"name":"GODBERT","text":"Ah, but it would seem dawn is nigh, and so I must return and do what only a Man─ah, a wandering pilgrim-man can. Until we meet again...and do remember to look under the tree!"},{"name":"YSHTOLA","text":"'Twould seem you have done some good this year. And so I come, bearing a gift from the Spinner. Do not ask why She chose <span class=\"emphasis\">me</span>─surely this gaudy frock would better suit Yda, or Tataru..."},{"name":"YSHTOLA","text":"Still, it calls to mind one Starlight many summers ago, when I awoke to find a small ribbon beside my pillow. Master Matoya took me to task when I suggested she was the one who had placed it there. Still, I knew the truth, and was rather moved by the gesture."},{"name":"YSHTOLA","text":"...But l have dwelt on the past long enough."},{"name":"YSHTOLA","text":"The dawn comes, and I am summoned elsewhere. Be well, friend─and do not neglect to look beneath the tree when you awaken."},{"name":"PAPALYMO","text":"Ah, <span class=\"highlight\">Forename</span>. Fancy meeting you here. I trust you have been a good adventurer this year?"},{"name":"YDA","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> sure has! That's why I brought gifts! Well, <span class=\"emphasis\">a</span> gift, at least. I'm sorry, Papalymo─I forgot to bring something for you!"},{"name":"PAPALYMO","text":"Well, then it is fortunate I am not a <span class=\"emphasis\">child</span>, isn't it? If anything, it is <span class=\"emphasis\">I</span> who should be gifting little trinkets to <span class=\"emphasis\">you</span>...not that I have the slightest intention of doing so."},{"name":"YDA","text":"O-Of course, silly me! Sometimes I forget that you're so much older than me! Was it forty summers now? Fifty?"},{"name":"PAPALYMO","text":"Do you see the sun coming up on the horizon, Yda? That's our cue to leave...<span class=\"emphasis\">now</span>."},{"name":"YDA","text":"Awww, and just when I was starting to have fun! Well, see you around, <span class=\"highlight\">Forename</span>! And don't forget to peek under the tree when you wake up!"},{"name":"THANCRED","text":"Ah, <span class=\"highlight\">Forename</span>. Sleeping like a babe, I see. Why the puzzled look? 'Tis I, the saint's little helper. Mayhap you were expecting another?"},{"name":"THANCRED","text":"Curious, is it not? Not once did I have occasion to celebrate Starlight as a child, but now, as a man grown, I celebrate it with you─at least, in a manner of speaking."},{"name":"THANCRED","text":"Ah, but dawn is nigh, and I must bid you a fond farewell. May your dreams be sweet, and do remember to peek under the tree when you awake. Till we meet again!"},{"name":"NANAMOULNAMO","text":"Hail, adventurer! By the grace of the Spinner, I, Nanamo Ul Namo, seventeenth of my line, do hereby confer upon you a gift for your most beneficent deeds this Starlight season!"},{"name":"NANAMOULNAMO","text":"I am reminded of our own festivities at the palace, in the days when Father and Mother yet lived. The sumptuous feasts, the beatific choirs, the majestic tree that stretched up to the ceiling─would that I could take you there to see it all!"},{"name":"NANAMOULNAMO","text":"Yet alas, dawn breaks...and our time together must draw to a close. Now rise, my champion, and claim your prize!"},{"name":"ALPHINAUD","text":"Well met, <span class=\"highlight\">Forename</span>! I come bearing a gift from the Spinner Herself as guerdon for your most charitable deeds. That said, just between the two of us, this coat is a tad garish for my liking..."},{"name":"ALPHINAUD","text":"Well met, <span class=\"highlight\">Forename</span>! I come bearing a gift from the Spinner Herself as guerdon for your most charitable deeds. That said, just between the two of us, this coat is a tad garish for my liking..."},{"name":"ALPHINAUD","text":"How ironic that Nymeia should choose <span class=\"emphasis\">me</span> of all people to do Her bidding. I was a skeptical child, as you might imagine, and quick to doubt the stories of the saint. Grandfather would spare no effort in concocting elaborate tales to preserve the illusion─yet I would not yield in my pursuit of the truth. Oh, the battles of wit we had!"},{"name":"ALPHINAUD","text":"While I would like nothing more than to stay and reminisce, I fear I must depart with the dawn. I shall leave your present beneath the tree. Till we next meet, friend!"},{"name":"TATARU","text":"A happy Starlight to you, <span class=\"highlight\">Forename</span>. I come bearing a gift and a song, especially for you! Just a moment... Ahem! Trololololo～lololo～♪"},{"name":"TATARU","text":"On this most high and holy night,♪<br>The snow without lies crisp and white...♪"},{"name":"TATARU","text":"But love burns hot within my heart,♪<br>I pray that we shall never─♪"},{"name":"TATARU","text":"Oh dear, is that the hour? I'll just have to sing the rest for you another time! Now, what have I forgotten? ...Oh, yes─your present! I'll just leave it under the tree, shall I? Till we meet again!"},{"name":"AYMERIC","text":"I trust this Starlight season finds you well, my friend? I, Aymeric de Borel, lord commander of the Temple Knights of Ishgard, have come to bestow upon you a most special gift."},{"name":"AYMERIC","text":"As you well know, the observance of Starlight traces its origins to my homeland, where it remains a much-beloved tradition to this day."},{"name":"AYMERIC","text":"I have always been quite fond of the season myself. Though I must confess that as colors go, I am somewhat partial to blue..."},{"name":"AYMERIC","text":"Nonetheless, it is both an honor and a pleasure to celebrate this Starlight with you. So as not to disturb your slumber, I shall leave your gift beneath the tree. Be well, my friend."},{"name":"DAMIELLIOT","text":"Good morning to you, friend. Did you rest well?"},{"name":"DAMIELLIOT","text":"Good morning to you, friend. Did you─hm? You say there was something waiting for you under the tree?"},{"name":"DAMIELLIOT","text":"Well, well. Might it be that miracles are afoot, and the Saint of Nymeia himself has visited us to personally bestow a gift on one of his favorite little helpers?"},{"name":"DAMIELLIOT","text":"Haha! But forgive me my jest. The children were so stirred by your tale that they simply insisted that they return the favor in some way, and I was all too happy to oblige."},{"name":"DAMIELLIOT","text":"Pray accept it as a humble token of gratitude from all of us at the children's ward for the kindness you have shown us this season."},{"name":"DAMIELLIOT","text":"In your dreams, you say? Well, that is most fascinating indeed. Mayhap the sound of me tiptoeing into your room at night stirred your imagination as you slumbered. Or mayhap─well, suffice to say that this is a magical season, and I would not be the least bit surprised if the Spinner Herself sought to repay you for the miracles you have worked."},{"name":"DAMIELLIOT","text":"At any rate, I thank you once more from the bottom of my heart for all you have done for the children. Should you have the time and inclination to share another of your tales, I am certain they would welcome it with ears and hearts wide open...as would I."},{"name":"DAMIELLIOT","text":"Another present from the children and myself. It is not much, but I do hope you find it to your liking."},{"name":"DAMIELLIOT","text":"I thank you once more from the bottom of my heart for all you have done for the children. Should you have the time and inclination to share another of your tales, I am sure they would welcome it with ears and hearts wide open."}],"reward":{"items":[{"id":16777}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67913]}},"partials":[{"type":"npc","id":"1017811","obj":{"i":1017811,"n":"Damielliot","l":695,"q":1}},{"type":"item","id":"16777","obj":{"i":16777,"n":"Starlight Gift Box","l":1,"c":26113,"t":85}},{"type":"quest","id":"67913","obj":{"i":67913,"n":"I'll Be Home for Starlight","g":204,"l":"Ul'dah","s":122}}]}