{"quest":{"name":"I'll Be Home for Starlight","location":"Ul'dah","id":67913,"patch":3.45,"sort":122,"icon":100597,"eventIcon":71221,"issuer":1018265,"target":1018186,"genre":204,"journal":["The raven-haired registrar is lost in the depths of despair.<br>※This quest is available for a limited time only.","You approach the raven-haired registrar, who is on the verge of quite literally tearing out his flowing locks as he laments his utter inability to lift young Reauverre's spirits. He quickly gathers himself and proposes that the two of you ask around to see what might be behind the boy's recent malaise. Mayhap the other children in the ward might be able to offer some insight.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Along with less practical information, you manage to glean from the children that Reauverre has been sighted concealing an object beneath his bed. You resolve to investigate, in hopes that whatever lies hidden might shine a light upon the boy's recent change in behavior.","Your search of the space beneath Reauverre's bed reveals an envelope containing a missive for the child. Loath to breach the boy's privacy without proper permission, you resolve to take it to the raven-haired registrar.","With some pause, the raven-haired registrar decides to open the letter, deeming the boy's safe recovery to take priority over the observation of proper privacy protocol. Within the envelope is a missive from Reauverre's father─an apology for breaking a promise to visit his boy for Starlight. The registrar deduces that this is the cause for the boy's low spirits, and determines that the best course of action is to seek out the father and inform him of Reauverre's plight. He departs for the Hustings Strip to rendezvous with a friend who might have some information as to the father's whereabouts, and entreats you to join him there.","You arrive at the Hustings Strip to see the raven-haired registrar immersed in conversation with a bearded Lalafell. He explains that the man is an old acquaintance of his mother's who was able to use his vast web of informants to ascertain the whereabouts of Reauverre's father─for a likely substantial fee. As the physician tells it, the boy's father is currently in Limsa Lominsa awaiting a vessel to carry him east to Radz–at–Han. He bids you hurry there with news of Reauverre's state in hopes of catching the father before he sets sail.","You find Reauverre's father on the ferry docks in Limsa Lominsa. The man is deeply pained to hear of his son's despondent state, but explains that he simply cannot return to Ul'dah at this time. As he tells it, he is on the verge of procuring a sizable stock of the rare herb needed to treat his boy's illness─an opportunity that may never present itself again. He proffers a gift intended for Reauverre, and bids you take it to the boy in his stead. You resolve to return to the children's ward and do precisely that─after checking in with the registrar, of course.","Upon hearing your story and seeing the gift entrusted to you by Reauverre's father, the registrar is hopeful that this act should suffice to return a smile to the boy's face, and the will to stave off illness back to his heart. Observing the bond of friendship you have forged with the boy, he bids you be the one to make the special delivery.","Reauverre initially balks at the gift, but relents when you and the registrar explain the true reason behind his father's breaking of his Starlight promise. Finally coming to understand that both his father and those around him have only his health and happiness at heart, the boy breaks into a beaming smile and resolves to triumph over his sickness, that the day he may live with his father once more may not be far off. The registrar breathes a sigh of relief, and bids you come to the admitting desk, where he would have a final word with you in private.","A surprise visit from Guildmaster Severian of the Alchemists' Guild leads the registrar to reveal to you his true identity. He is none other than Damielliot─a one-time patient of the children's ward who now serves as its director, a position he inherited from his parents, who lost their lives in the Calamity. He reflects upon his own reasons for choosing the path of a physician, and thanks you for the kindness you have shown to those who need it most this Starlight season. In the end, he encourages you to return to the children's ward before Starlight is over, that your presence might bring good cheer to his charges once more."],"objectives":["Gather information regarding Reauverre.","Search under Reauverre's bed.","Deliver the letter to the raven-haired registrar.","Rendezvous with the raven-haired registrar at the Hustings Strip.","Speak with Reauverre's father at the ferry docks.","Show the present from Reauverre's father to the raven-haired registrar.","Deliver the present from Reauverre's father to Reauverre.","Speak with the raven-haired registrar."],"dialogue":[{"name":"DAMIELLIOT","text":"Alas! Alas and alack! Is there nothing I can do to bring succor to the poor boy!? Am I doomed to stand idly by as he descends further into a pit of hopelessness, self-loathing, and despair!?"},{"name":"DAMIELLIOT","text":"...My apologies. My emotions got the better of me for a moment. I often tell the children that even the most potent herbs and potions will not avail a patient who does not possess the firm belief that his condition will, indeed, improve. This is true for myself as much as it is true of my charges."},{"name":"DAMIELLIOT","text":"Sadly, in the case of poor Reauverre, he seems to have all but given up hope. I cannot fathom what happened─he used to be such a sweet, sanguine child."},{"name":"DAMIELLIOT","text":"I beg of you, friend─pray help me help the boy. Might you investigate into the matter, that you might ascertain what ails his heart so?"},{"name":"DAMIELLIOT","text":"Thank you ever so much, my friend. I shall go speak with my colleagues at the Phrontistery to see if they might have any insight. Mayhap you could speak with the other children─after your efforts as a little helper, I imagine they'd not be shy to share with you anything they might know."},{"name":"DAMIELLIOT","text":"Have you gleaned anything from the children regarding Reauverre's sullen and dispirited behavior?"},{"name":"ALCHEMIST02377","text":"On behalf of my colleague, I would thank you once again for your generous offer of aid. Should you wish to enter the children's ward, you need only speak the word."},{"name":"Q1","text":"Enter the children's ward?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"PATIENTBOYA02376","text":"Reauverre? Now that you mention it, I haven't seen him smile much lately. We used to laugh together all the time. I wonder what happened?"},{"name":"PATIENTBOYB02376","text":"You would ask of Reauverre? Very well. I saw him reaching under his bed the other day, as if he were...hiding something. Of course I did not <span class=\"emphasis\">peek</span>─I'll have you know that Mother and Father instilled me with the finest of manners."},{"name":"PATIENTGIRLA02376","text":"&lt;cough&gt; &lt;cough&gt; Reauverre? He hasn't seemed too happy lately. Who can blame him? When I think of how long I've been here, so far from home, sometimes I can't help but─&lt;cough&gt;─cry, too..."},{"name":"PATIENTGIRLB02376","text":"I saw Reauverre reading a letter the other day with a terrible grimace on his face. Mayhap something in the words upset him? Or perhaps his sickness is acting up again..."},{"name":"SYSTEM","text":"You find a letter under the bed!"},{"name":"DAMIELLIOT","text":"Ah, welcome back, my friend. Have you gleaned any insight as to what ails poor Reauverre's heart?"},{"name":"DAMIELLIOT","text":"What have we here...? Ah, a letter─to Reauverre, from his father. While I am loath to intrude on the privacy of my ward, desperate times call for desperate measures. Let us see, now..."},{"name":"DAMIELLIOT","text":"(-Letter from Father-)“My dearest son,<br><br>I promised I would be home for Starlight, but I fear that business calls. Pray forgive your father for this broken promise, and know that I shall return to your side as soon as I am able.”"},{"name":"DAMIELLIOT","text":"Ah...I should have known. Reauverre's father is a merchant by trade, and his travels often take him to distant shores. Few things instill the boy with hope like his father's visits, but they have grown increasingly rare."},{"name":"DAMIELLIOT","text":"Doubtless he prayed to the Spinner for his father's return for Starlight, and was devastated that those prayers went unanswered. If this letter is the cause of his recent malaise, I fear there is little we could do to lift his spirits."},{"name":"DAMIELLIOT","text":"Unless we could somehow find the man and convince him to─wait, I believe I know someone who just might be able to come to our aid at a time such as this."},{"name":"DAMIELLIOT","text":"I will go on ahead and investigate the matter. Pray join me anon at the Hustings Strip. I will explain there."},{"name":"ALCHEMIST02377","text":"My colleague awaits you at the Hustings Strip. Pray join him there as soon as you are able. We thank you for your charity, friend."},{"name":"DAMIELLIOT","text":"Ah, friend, your timing is impeccable. With some help from an old acquaintance, I was able to ascertain the whereabouts of the poor boy's father."},{"name":"DAMIELLIOT","text":"The “acquaintance” of whom I speak? An old friend of my departed mother's─and one with a vast web of informants and information at his disposal. He was more than happy to assist─for the right price, needless to say."},{"name":"DAMIELLIOT","text":"But you needn't concern yourself with that, friend─what's important is that we've found our man!"},{"name":"DAMIELLIOT","text":"As my source tells it, Reauverre's father is staying over in Limsa, awaiting a vessel that will take him across the seas to Radz–at–Han in the East. If we depart now, we might still catch him before he sets sail!"},{"name":"DAMIELLIOT","text":"I would go myself, but─you must understand─I simply could not leave the poor children entrusted to my care. And so I must call upon your generosity again this Starlight season. Pray travel to Limsa in my stead, that Reauverre's Starlight wish may yet come true!"},{"name":"ALCHEMIST02377","text":"Traveling all the way to Limsa in search of the boy's father? You truly are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the season, friend. On behalf of the registrar, my colleagues, and the children, I thank you for your kindness."},{"name":"REAUVERREFATHER02375","text":"...Hmm? Why, yes, I'm Reauverre's father. Whatever is the matter? Has something happened to my boy!? "},{"name":"REAUVERREFATHER02375","text":"I-It...it cannot be! I knew the boy was looking forward to a Starlight reunion, but to think a single broken promise would ravage his heart so!"},{"name":"REAUVERREFATHER02375","text":"You must understand, friend. I want nothing more than to fly back to Ul'dah to Reauverre's side, but I simply cannot. No, a matter most pressing calls me across the sea!"},{"name":"REAUVERREFATHER02375","text":"Aye, it is not merely a chance at profit and fortune that calls me eastward. I have─at long, long last─found a reliable source for the rare herb needed to cure my poor boy's disease! If I do not sail out on the next ferry, it may be moons─even <span class=\"emphasis\">years</span>─till I find an opportunity like this!"},{"name":"REAUVERREFATHER02375","text":"And so, as much as it pains my heart, I must go. I know not if it will suffice, but pray deliver this to my boy in my stead. It is a memento I had meant to give him when I returned from Radz–at–Han."},{"name":"REAUVERREFATHER02375","text":"Take it to him, and tell him this: “Even when his journeys carry him to distant lands, your father's heart is ever with you.” And with that, I must prepare for my journey. Thank you, my friend, and a happy Starlight to you."},{"name":"REAUVERREFATHER02375","text":"Take it to him, and tell him this: “Even when his journeys carry him to distant lands, your father's heart is ever with you.” And with that, I must prepare for my journey. Thank you, my friend, and a happy Starlight to you."},{"name":"DAMIELLIOT","text":"You return, friend, but you return alone. Did the man elude your search?"},{"name":"DAMIELLIOT","text":"...I see. I can only hope that this gift will serve to rouse Reauverre from his doldrums. Pray take it to the boy, my friend. He should be back on his feet any time now, and─given his recent behavior─I suspect he would rather receive the present from you than me."},{"name":"DAMIELLIOT","text":"Pray give the boy his father's gift, friend, and let us hope it will lift his spirits."},{"name":"REAUVERRE","text":"Oh, you're back. I've been a good boy, I prom─what? You have something for me?"},{"name":"REAUVERRE","text":"A present? But the only thing I asked for Starlight was..."},{"name":"REAUVERRE","text":"A present...from Father? His <span class=\"emphasis\">heart</span> is always with me, you say!? That's a stupid lie! If his heart was with me, then why isn't <span class=\"emphasis\">he</span> here, like he promised he would be!?"},{"name":"DAMIELLIOT","text":"Please, Reauverre! You must understand! Your father cares for you more than anyone we know!"},{"name":"REAUVERRE","text":"Then why didn't he come back!? Why is he sailing off to some distant land!? Is coin so much more important to him than his own son!?"},{"name":"DAMIELLIOT","text":"It is precisely <span class=\"emphasis\">because</span> you are so important to him that he sails east, my dear boy. He sails out in search of the rare herb that will cure you of all ills, that you might live as a family once more."},{"name":"REAUVERRE","text":"Y-You're just making things up! Or...aren't you?"},{"name":"DAMIELLIOT","text":"I swear on my own father's grave that I am not. This adventurer heard as much from your father's own mouth. Didn't you, friend?"},{"name":"REAUVERRE","text":"So...&lt;sniff&gt;...Daddy doesn't...&lt;sniff&gt;...hate me after all..."},{"name":"DAMIELLIOT","text":"On the contrary, Reauverre, your father just wants to see you well again, as we all do. Will you promise that you'll stop fighting us, and work with us to overcome your sickness?"},{"name":"REAUVERRE","text":"Y-You bet I will! I'll get over this and be back living happy with my dad in no time! Just you watch me!"},{"name":"DAMIELLIOT","text":"Now <span class=\"emphasis\">that's</span> the Reauverre I know. (Ahem. Might we speak in private for a moment, friend? I'll be at the front desk, if you might spare a moment.)"},{"name":"SEVERIAN","text":"(-???-)Damelliot, you insufferable dolt! I swear, can I not leave my bumbling erstwhile apprentice alone for half a bell without him turning the cauldron over and making a right mess of everything!?"},{"name":"DAMIELLIOT","text":"M-Master Severian! Whatever brings you to the children's ward at this hour of <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">the day</span></span>!?"},{"name":"SEVERIAN","text":"Are you deaf, dumb, or do you simply enjoy being intentionally obtuse!? It's as I just <span class=\"emphasis\">said</span>, you spectacular fool! I saw you running about town like a chocobo with its head removed from its body, and I deigned to interrupt my far more important research to see if my surpassing knowledge might be needed to rescue you from whatever miserable plight you've surely inflicted upon yourself."},{"name":"DAMIELLIOT","text":"Th-That is most kind of you, Master Severian. I am pleased to inform you that─thanks to the charity of this kind adventurer─the situation was resolved a few brief moments ago. I am quite sorry to have...ah...troubled you so."},{"name":"SEVERIAN","text":"Well, well─if it isn't my able assistant! I must say, it's good to see that at least one person in this room hasn't let my esteemed tutelage go entirely to waste like my erstwhile apprentice here. Heh heh heh. Mwahahahahaha! "},{"name":"SEVERIAN","text":"Well, well─if it isn't that lackey of mine! I know not the details─and am not particularly inclined to waste my time in hearing them─but it would appear that you're more competent at my erstwhile apprentice's job than he is. Heh heh heh. Mwahahahahaha! "},{"name":"SEVERIAN","text":"What's this? Your face is unfamiliar to me─and I am not particularly inclined to waste my time in getting to know you─but whoever you are, it would appear that you're more competent at my erstwhile apprentice's job than he is. Heh heh heh. Mwahahahahaha! "},{"name":"SEVERIAN","text":"Yes, my apprentice... He may be a sappy, sentimental fool, but I suppose it's something to be said that the children's ward hasn't entirely collapsed under his stewardship. Though I daresay my regular visits have something to do with that, wouldn't you say...<span class=\"emphasis\">director</span>?"},{"name":"DAMIELLIOT","text":"M-Master Severian...! Your guidance is, as always, most welcome. But...should you be taking this much time away from─"},{"name":"SEVERIAN","text":"Good gods, Damielliot! Whyever are you wasting my invaluable time when you know full well that pressing experiments demand my constant and undivided attention!? &lt;sigh&gt; I swear, the next <span class=\"emphasis\">competent</span> apprentice I find will be the first..."},{"name":"DAMIELLIOT","text":"(-Damielliot-)Forgive me, friend, my not introducing myself sooner. My name is Damielliot, and I serve as director of this institution. Though, in fairness, it is simply a position I inherited from my departed parents─and one that I even now struggle to prove myself worthy of..."},{"name":"DAMIELLIOT","text":"(-Damielliot-)Nevertheless, on behalf of all of my colleagues and the children placed in my charge─not the least of which is dear Reauverre─I offer my most sincere thanks for the boundless kindness and charity you have shown us this Starlight season."},{"name":"DAMIELLIOT","text":"(-Damielliot-)In my own childhood, I was a patient here myself. I suffered from a most curious ailment─whenever I drifted off to slumber, I knew not when I would again wake. It was only through the benevolence and goodwill of those around me that my condition did at long last abate."},{"name":"DAMIELLIOT","text":"(-Damielliot-)And so it was that, when I came of age, I resolved to carry on my dear parents' life work, that I might do my part to bring succor and solace to those in the greatest of need. A simple motive, mayhap, but one that more than sufficed."},{"name":"DAMIELLIOT","text":"(-Damielliot-)...But I have rambled on long enough. I thank you once again for your kindness, friend. You are welcome in the ward whenever you desire─I am sure your presence would bring smiles to the faces of the children."},{"name":"DAMIELLIOT","text":"(-Damielliot-)And yet...it is strange. Though I could swear we only met this day, there is something in your bearing that reminds me of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I once knew. One whose face I have sadly long since forgotten..."},{"name":"DAMIELLIOT","text":"(-Damielliot-)<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> was an adventurer who performed a great kindness for me when I was but a suffering child. Indeed, it was the starfall grass <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> procured for me that cured me of my condition and saved me from a fate of eternal slumber."},{"name":"DAMIELLIOT","text":"(-Damielliot-)The Calamity claimed my parents and left me a friendless foundling. It would be no exaggeration to say that without that adventurer, I would not be standing here today. The depths of my gratitude know no bounds."},{"name":"DAMIELLIOT","text":"(-Damielliot-)...But forgive me. Just because you are an adventurer, like my mysterious benefactor, there is no need to burden you with this sappy, sentimental tale."},{"name":"DAMIELLIOT","text":"(-Damielliot-)And yet it is strange. In expressing my gratitude to you, I feel somehow as if my deepest wishes have reached that gentle soul, and in the doing, that I have awoken from a long, deep slumber."},{"name":"SYSTEM","text":"A daily quest is now available from Damielliot in the children's ward."}],"reward":{"gil":536,"items":[{"id":16797}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67912]},"next":[67914]},"partials":[{"type":"npc","id":"1018265","obj":{"i":1018265,"n":"Raven-haired Registrar","l":695,"q":1}},{"type":"npc","id":"1018186","obj":{"i":1018186,"n":"Raven-haired Registrar","l":695,"q":2}},{"type":"item","id":"16797","obj":{"i":16797,"n":"Starlight Celebration Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"67912","obj":{"i":67912,"n":"Think of the Children","g":204,"l":"Ul'dah","s":121}},{"type":"quest","id":"67914","obj":{"i":67914,"n":"A Starlight Story","g":204,"l":"Ul'dah","s":123,"r":1}}]}