{"quest":{"name":"Think of the Children","location":"Ul'dah","id":67912,"patch":3.45,"sort":121,"icon":100596,"eventIcon":71221,"issuer":1018114,"target":1018186,"genre":204,"usedItems":[16612],"journal":["The raven-haired registrar would make a special request of you.<br>※This quest is available for a limited time only.","The raven-haired registrar has tasked you with delivering presents to the unfortunate younglings of the children's ward. Taking care to don your Starlight robe to properly assume the role of one of the saint's little helpers, go forth and spread merriment and good cheer, that the children might have reason to smile this day.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The beaming smiles of the younglings fill your heart with joy. And yet, one undelivered present still remains. Might there be a child whose prayers to the Spinner remain unanswered? Doubtless the raven-haired registrar has the answer.","Upon seeing the remaining present, the registrar explains there is indeed one child who remains unaccounted for: Reauverre, a young boy who presumably slipped out of the children's ward unattended. He further surmises that it is the selfsame Reauverre who stole away with the missing parcel that you recovered. Fearing for the boy's safety, he dashes out for the Ruby Road Exchange in search, and entreats you to join him.","You find young Reauverre in the markets, yearningly gazing at a loving father and his son. Noticing your presence, he apologizes profusely for having caused you trouble, and promises to return to the children's ward, though with some clear reluctance. You stride off in search of the raven-haired registrar, who will doubtless be pleased to hear the boy is safe.","The raven-haired registrar breathes a sigh of relief upon hearing that young Reauverre is safe and sound, though he remains troubled by the boy's behavior. He bids you join him back at the children's ward, where he is determined to ascertain the reason for Reauverre's sudden proclivity for mischief-making.","You return to the children's ward to find a sullen Reauverre angrily dismissing the concerns of the compassionate registrar. The boy begins to run away, but suddenly collapses. As Reauverre rests in his bed, the registrar reveals that while the boy's illness is not immediately life-threatening, the rarity of a herb required in its treatment has resulted in extending his stay at the ward moons longer than originally anticipated. Notwithstanding this, the boy has always shown admirable courage in facing his sickness, which makes his recent behavior all the more troubling. As the raven-haired registrar laments his inability to help the suffering boy, you cannot help but sympathize with his plight..."],"objectives":["Equip the Starlight robe and deliver gifts to the children.","Return the undelivered gift to the raven-haired registrar.","Search for Reauverre at the Ruby Road Exchange.","Report to the raven-haired registrar.","Speak with the raven-haired registrar at the children's ward."],"dialogue":[{"name":"DAMIELLIOT","text":"So you will lend us your aid? I cannot thank you enough, friend!"},{"name":"DAMIELLIOT","text":"As for the task at hand...I would deliver these presents to the children, but I fear they would find little joy and wonder in receiving them from the fusty physician whose face they see every day."},{"name":"DAMIELLIOT","text":"...But one of the saint's little helpers, on the other hand! Behold─I have the garb right here, and I'm certain it would most become you."},{"name":"DAMIELLIOT","text":"My colleague by the door would be happy to show you in to the children's ward whenever you desire."},{"name":"DAMIELLIOT","text":"Meanwhile, I must look into the matter of that mischief-making boy. Thank you again, my friend. When you see the children's smiles, you will know just how much your kindness meant to them."},{"name":"DAMIELLIOT","text":"Just as I thought─he is nowhere to be found. Doubtless the boy the adventurer spoke of was...yes, it must be so."},{"name":"ALCHEMIST02376","text":"The registrar has told me everything. We thank you for your charity, kind adventurer. It would be my pleasure to show you within."},{"name":"Q1","text":"Enter the children's ward?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"PATIENTBOYA02376","text":"A little helper! Do you truly have a present for <span class=\"emphasis\">me</span>? I must be dreaming!"},{"name":"PATIENTBOYA02376","text":"Oh, thank you so, so much! This is the best Starlight ever!"},{"name":"PATIENTBOYA02376","text":"Everyone says the city's full of little helpers, but none of them come here. Do you think it's because they don't want to get sick like us?"},{"name":"PATIENTBOYB02376","text":"Well, if it isn't a little helper! Might you have a present for me? Oh, please say that you do!"},{"name":"PATIENTBOYB02376","text":"My heartfelt thanks to you. I can only hope that the Spinner hears my prayers, that I might spend next Starlight with my family..."},{"name":"PATIENTBOYB02376","text":"Just between you and me, the only gift I want for Starlight is to see Mother and Father once more..."},{"name":"PATIENTGIRLA02376","text":"&lt;cough&gt; &lt;cough&gt; ...P-Pardon me. Do you have something─&lt;cough&gt;─for me?"},{"name":"PATIENTGIRLA02376","text":"Oh, thank you! I─&lt;cough&gt;─I'm so happy! I'll get better by next Starlight, just you wait and see!"},{"name":"PATIENTGIRLA02376","text":"&lt;cough&gt; &lt;cough&gt; ...F-Forgive me. I do not mean to be rude. I just want to go outside and play with my friends, but the grown-ups tell me my body is still─&lt;cough&gt;─too weak..."},{"name":"PATIENTGIRLB02376","text":"Why, hello there, little helper! Might you perchance have a present for little old <span class=\"emphasis\">me</span>?"},{"name":"PATIENTGIRLB02376","text":"Oh, but you are truly too kind! I feared my letters would not reach the Spinner from here, but I see now my worries were for naught!"},{"name":"PATIENTGIRLB02376","text":"You're not a little helper, now are you? Not that I mind, of course! For I am no child, but a big girl with no need for little toys and trinkets!"},{"name":"SYSTEM","text":"You must have the Starlight robe equipped to continue with this quest."},{"name":"SYSTEM","text":"If you do not possess a Starlight robe, you may purchase one from the recompense officer."},{"name":"SYSTEM","text":"You have successfully delivered a gift to every youngling on the premises. One present, however, still remains..."},{"name":"DAMIELLIOT","text":"You have my thanks, adventurer. Hearing the laughter of the little ones, I see you served as a most splendid little helper. But pray tell, do you perchance still have one present in your possession?"},{"name":"DAMIELLIOT","text":"...I suspected as much. Currently, we have five younglings residing with us, but one of them─a boy by the name of Reauverre─seems to have slipped outside unattended."},{"name":"DAMIELLIOT","text":"No doubt this is the selfsame boy you met not long ago─the boy who stole away with our Starlight gifts. But whatever would possess him to <span class=\"emphasis\">do</span> such a thing?"},{"name":"DAMIELLIOT","text":"...But this is no time for idle speculation─we must find him before he comes to harm! You will aid in our search, won't you, friend?"},{"name":"DAMIELLIOT","text":"Once again I am in your debt. Let us begin our search at the Ruby Road Exchange, where you last saw him. I will await you there!"},{"name":"DAMIELLIOT","text":"This is where you saw the boy, yes? I do not imagine that one as timid as he would venture far from here..."},{"name":"ALCHEMIST02376","text":"The registrar has already departed for the Ruby Road Exchange. We cannot thank you enough for your efforts on our─and Reauverre's─behalf."},{"name":"BOY02375","text":"Oh, Father! Father! Can we stop at the stalls before we go home?"},{"name":"FATHER02375","text":"We told your mother we would be home by the next bell, did we not? You wouldn't want to make her sad, now would you?"},{"name":"BOY02375","text":"I...I suppose you're right, Father."},{"name":"FATHER02375","text":"Well, I suppose she would not be devastated if we stopped off at <span class=\"emphasis\">one</span> stall...and bought her a little gift. What do you say?"},{"name":"REAUVERRE","text":"Father..."},{"name":"REAUVERRE","text":"Wh-Who goes th─oh, you're that adventurer from before. I-I've been a good boy since then, I promise!"},{"name":"REAUVERRE","text":"(-Reauverre-)W-Well, except for running away, I suppose. I'm sorry...I didn't mean to cause you trouble."},{"name":"REAUVERRE","text":"Between you and me, I don't particularly <span class=\"emphasis\">want</span> to go back, but... I wouldn't want to get you in trouble too, so, I will."},{"name":"ALCHEMIST02376","text":"Is something the matter, adventurer? I fear young Reauverre has yet to return. I can only assume the registrar is still searching for him at the Ruby Road Exchange."},{"name":"DAMIELLIOT","text":"You've found Reauverre and convinced him to return, you say? You truly are a miracle worker, friend! Come, let us return to the children's ward. I simply must get to the bottom of the boy's most curious behavior..."},{"name":"DAMIELLIOT","text":"How many times must I say this, Reauverre? I do not mean to <span class=\"emphasis\">scold</span> you, merely to keep you safe. Just promise me you will not go running off like that again. Everyone cares for you here, and this behavior of yours causes no end of worry."},{"name":"REAUVERRE","text":"(-Reauverre-)Liar! Nobody cares about me! I could die tomorrow, and no one would shed a tear! So just leave me be, will you!?"},{"name":"DAMIELLIOT","text":"R-Reauverre!"},{"name":"DAMIELLIOT","text":"Dear heavens... I am sorry you had to see that, friend. I know not what that boy is thinking these days..."},{"name":"DAMIELLIOT","text":"Reauverre!!!"},{"name":"DAMIELLIOT","text":"Worry not, friend─the boy's life is in no danger. I have already seen to his treatment. He should be back on his feet ere long."},{"name":"DAMIELLIOT","text":"And yet, it is fortunate we were close at hand. Why, if he had collapsed but a few bells earlier, on his own out on the streets..."},{"name":"DAMIELLIOT","text":"If you have a moment, I would speak to you in private. Pray come with me."},{"name":"DAMIELLIOT","text":"Reauverre's illness is not an especially complex one, but one of the herbs used in its treatment is quite rare and not easily come by. As such, his time in the children's ward has dragged on longer than any of us would have hoped."},{"name":"DAMIELLIOT","text":"Moon after moon spent in the company of strangers─it would not be easy on any child, let alone one as sensitive as Reauverre. And yet, he has fought his illness with admirable courage and nary a word of complaint."},{"name":"DAMIELLIOT","text":"That is...until recently. For the life of me, I cannot fathom what has turned him into such a rebellious, sullen child. I only want to help him, and yet I am at a complete loss for ideas as to how I might do so. Alas and alack, whatever am I to do!?"}],"reward":{"gil":248,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67911]},"next":[67913]},"partials":[{"type":"npc","id":"1018114","obj":{"i":1018114,"n":"Raven-haired Registrar","l":41,"q":2}},{"type":"npc","id":"1018186","obj":{"i":1018186,"n":"Raven-haired Registrar","l":695,"q":2}},{"type":"item","id":"16612","obj":{"i":16612,"n":"Starlight Robe","l":1,"c":42531,"t":35,"p":156}},{"type":"quest","id":"67911","obj":{"i":67911,"n":"Naughty or Nice","g":204,"l":"Ul'dah","s":120}},{"type":"quest","id":"67913","obj":{"i":67913,"n":"I'll Be Home for Starlight","g":204,"l":"Ul'dah","s":122}}]}