{"quest":{"name":"Seeking Inspiration","location":"Idyllshire","id":67916,"patch":3.45,"sort":9,"interval":"weekly","repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1018190,"target":1018190,"genre":74,"journal":["Amphelice looks ready for business.","No sooner do you nod your head in consent than Amphelice proceeds straight to the heart of the matter. You will only receive the singing clusters upon completing and presenting to her three deftly written tales of daring and adventure. Being no stranger to danger, and knowing where to find it, you set out to find inspiration for your writing.<br><br>※The key item can be obtained by clearing a dungeon via Duty Roulette: Leveling.","You emerge from battle, your mind swimming with scenes of battle to chronicle in your journal. It takes you no time at all to compose your first masterpiece, but your work is not yet complete. To that end, you set out in search for your next story.<br><br>※The key item can be obtained by clearing a dungeon via Duty Roulette: Leveling.","Though weary from battle, you lay down your arms to pick up a pen and record your most recent battle in painstaking detail. Your second story is complete. With only one tale of adventure left to write, you make haste to another place that danger might call home.<br><br>※The key item can be obtained by clearing a dungeon via Duty Roulette: Leveling.","The battle was fierce, a dance of blades where death was all but promised. Yet you prove victorious, and duly inspired. With a flourish of your pen you write what could only be your magnum opus, completing the set of three stories promised to Amphelice. Heading to Idyllshire, you wonder if she will consider your work worthy of the singing clusters.","Amphelice pores over your work and is almost at a loss for words. More than impressed with your work, she explains that she is a writer sorely in need of new ideas for her poetry. Or rather, she was in need of new ideas. Your stories have set her mind to racing, and she is only too happy to reward you with singing clusters.<br><br>※This repeatable quest can be undertaken once weekly. Upon completing the quest, it will become available again the following [Reset]<span class=\"alternative-container\"><span class=\"alternative\">Sunday</span><span class=\"alternative\">Monday</span><span class=\"alternative\">Tuesday</span><span class=\"alternative\">Wednesday</span><span class=\"alternative\">Thursday</span><span class=\"alternative\">Friday</span><span class=\"alternative\">Saturday</span></span> at <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">1</span><span class=\"alternative\">2</span><span class=\"alternative\">3</span><span class=\"alternative\">4</span><span class=\"alternative\">5</span><span class=\"alternative\">6</span><span class=\"alternative\">7</span><span class=\"alternative\">8</span><span class=\"alternative\">9</span><span class=\"alternative\">10</span><span class=\"alternative\">11</span><span class=\"alternative\">12</span></span></span><span class=\"alternative\">12</span></span> <span class=\"alternative-container\"><span class=\"alternative\">p.m.</span><span class=\"alternative\">a.m.</span></span> (Earth time)."],"objectives":["Obtain volume one of An Adventurer's Life by clearing a dungeon via Duty Roulette: Leveling.","Obtain volume two of An Adventurer's Life by clearing a dungeon via Duty Roulette: Leveling.","Obtain volume three of An Adventurer's Life by clearing a dungeon via Duty Roulette: Leveling.","Deliver the three volumes of An Adventurer's Life to Amphelice in Idyllshire."],"dialogue":[{"name":"AMPHELICE","text":"You are prepared to work, then?"},{"name":"AMPHELICE","text":"Good. Very good. Now, if you are an adventurer of any merit or distinction, what I would ask of you is simple: a recounting of your travels, of your most spine-tingling, exhilarating battles. Only then shall you have your reward."},{"name":"AMPHELICE","text":"But a single tale would scarcely be enough to even whet one's appetite, don't you think? That is why I must insist you write me three. Three gripping tales of derring-do, and the singing clusters are yours."},{"name":"AMPHELICE","text":"I can only hope your skill with a pen matches that with a weapon."},{"name":"AMPHELICE","text":"Come for more singing clusters, I see. I am only too happy to oblige. That is, of course, provided you have more tales to share."},{"name":"AMPHELICE","text":"As before, bring me three suspenseful stories of your adventures and the clusters are yours. I am very much looking forward to your work."},{"name":"SYSTEM","text":"The key item An Adventurer's Life can be obtained by clearing a dungeon via Duty Roulette: Leveling."},{"name":"AMPHELICE","text":"I very much doubt your stories will write themselves while you stand about here. If you would have the singing clusters, I suggest you hurry and place pen to paper."},{"name":"SYSTEM","text":"The key item An Adventurer's Life can be obtained by clearing a dungeon via Duty Roulette: Leveling."},{"name":"AMPHELICE","text":"And so the hero returns. With a set of enthralling stories, I should hope."},{"name":"AMPHELICE","text":"Oh my! Such carnage, such havoc... I can practically hear the screams of agony and despair from your enemies, cursing your name with their last breaths. Yes, this shall do quite nicely to set my creative juices to percolating."},{"name":"AMPHELICE","text":"I am an artist, you see. A writer with a passion for poetry of the unexpected sort. While most prefer rhymes of light and love, I live for the dark and desolate, as do my readers. Whether to frighten themselves or their friends, it matters not. I find there is no greater joy than to see a man turn pale with horror upon reading my words."},{"name":"AMPHELICE","text":"My first collection of poems was a smashing success, and so I immediately set to work on my next volume. Yet I found my writing lacked a certain spark. A barbarity that could only come from one who's experienced the butchery of true combat."},{"name":"AMPHELICE","text":"Thanks to you, however, my mind is now racing with thoughts of slaughter and mayhem. As promised, the singing clusters are yours. If you should need more, I would gladly accept another trilogy of terrifying tales."},{"name":"AMPHELICE","text":"Marvelous. Simply marvelous. The first page alone has me quivering with anticipation. Here you are, my <span class=\"alternative-container\"><span class=\"alternative\">dear</span><span class=\"alternative\">good sir</span></span>. The singing clusters, as promised."},{"name":"AMPHELICE","text":"They say that artists must be sacrificed to their art, but today it is not I, but the fiends felled by your hand placed upon the altar. Now their pain and misery shall live on in my poetry for all time!"}],"reward":{"items":[{"num":18,"id":16064}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67915]}},"partials":[{"type":"npc","id":"1018190","obj":{"i":1018190,"n":"Amphelice","l":2082,"q":1}},{"type":"item","id":"16064","obj":{"i":16064,"n":"Singing Cluster","l":1,"c":20027,"t":54}},{"type":"quest","id":"67915","obj":{"i":67915,"n":"Future Proof","g":74,"l":"Azys Lla","s":8,"r":1,"f":1}}]}