{"quest":{"name":"A Redbill Farewell","location":"The Parrock","id":67910,"patch":3.5,"sort":6,"icon":100604,"unlocksFunction":1,"eventIcon":71341,"issuer":1018079,"target":1018083,"involved":[1017527,1018072,1018073,1018080,1018081,1018082,1018084,1018085,1018086,1018295],"genre":18,"journal":["Leofard appears to be mourning the loss of the <span class=\"emphasis\">Raimille</span>.","Leofard has ordered everyone to return to his quarters while he remains alone on the Parrock's airship landing. Join Cait Sith in Leofard's chambers and question Stacia concerning the captain's melancholy mood.","Cait Sith shares his feelings of guilt with Stacia, and she assents to his request for an insight into Leofard's uncharacteristically gloomy manner. Soon after Stacia finishes the tale behind the <span class=\"emphasis\">Raimille</span>, however, Leofard enters and sets matters straight regarding sky pirates and unnecessary apologies. He offers Cait Sith a place with the Redbills, then orders the familiar to join him in giving you a proper send-off. Speak with Leofard when you are ready to leave the Parrock.","Leofard and his Redbills escort you back to Coldwind. Though your current journey together has come to an end, the captain promises that he will seek you out whenever the skies once more echo with the call of high adventure!"],"objectives":["Speak with Stacia in Leofard's chambers.","Speak with Leofard at the Parrock."],"dialogue":[{"name":"CAITSITH","text":"The plan was a resounding success...though it did require some intervention on Leofard's part. I am afraid I misjudged his commitment to our cause..."},{"name":"STACIA","text":"Well, I think he'll live. Which is surprisin' considerin' he crashed his ship into a bloody demon... Damned fool."},{"name":"RADLIA","text":"How vexing to once again be rescued by Redbill...<br>He'd better recover from those injuries so we can go back to hating each other on an equal footing."},{"name":"LEOFARD","text":"Bah, me goggles are a mess. But I can always get me a new pair of goggles...and a new airship. I suppose we should be glad we didn't lose aught else after divin' headlong into a voidsent nest."},{"name":"RADLIA","text":"Now that we've taken the skies back, it's time we were taking our leave. The Talons and the Redbills can kiss this brief alliance farewell...unless, of course, you're interested in a more permanent arrangement?"},{"name":"LEOFARD","text":"Your bootlickers might think your voice a siren song, but it grates on me ears like a harpy's screech. No, this is the first and last time we fly together. We're back to bein' rivals─the way it's always been."},{"name":"RADLIA","text":"You are a very stubborn man, Redbill. But you'd do well to remember: I always get what I want in the end!"},{"name":"LEOFARD","text":"...Head back to me quarters and see to the furball's hurts. I'll be along in a bit."},{"name":"CAITSITH","text":"I feel so foolish, <span class=\"highlight\">Forename</span>. I demanded that Leofard remain behind, only to have him rescue my mission from certain failure─a failure that would have made mock of your heroic efforts, as well."},{"name":"CAITSITH","text":"You are too kind. Ah, what words exist that can properly express my contrition? I know not how to even begin making my apologies..."},{"name":"CAITSITH","text":"I should like to approach the captain, but he has the air of a man who seeks solitude. 'Tis strange to see him so melancholy."},{"name":"CAITSITH","text":"Could it be the loss of the <span class=\"emphasis\">Raimille</span> which troubles him so...? Nay, I shan't intrude upon his contemplation with clumsy questions and trite platitudes. Let us leave him be for the moment."},{"name":"LEOFARD","text":"Go on ahead without me. I won't be long."},{"name":"CAITSITH","text":"The captain is not his usual bombastic self. Mayhap Stacia can enlighten us as to the source of this uncharacteristic malaise."},{"name":"UTATA","text":"...I heard the <span class=\"emphasis\">Raimille</span> was an unsalvageable wreck. She was a fine vessel, built to endure the captain's reckless flying style, and it seems she kept him safe until her very end. Such a shame..."},{"name":"RADLIA","text":"Step up the pace, you sluggards! Let's leave this rock behind and get to celebrating the return of the Talons!"},{"name":"CAITSITH","text":"Mistress Stacia, if I might ask you a question: do you know the cause of the captain's melancholy?"},{"name":"CAITSITH","text":"Is it because of the <span class=\"emphasis\">Raimille</span>? Pray tell me if it is so. I cannot help but feel responsible for the vessel's destruction and I would better understand Leofard's present distress."},{"name":"STACIA","text":"Hmmm... If you really want to understand, I suppose I should start with how the captain was orphaned as a child. As matters turned out, he was taken in by a highborn widow who raised him as her son."},{"name":"STACIA","text":"From what Leofard has told me, his adoptive mother was a kind, quiet-spoken woman, but due to some illness or other she was rarely able to venture outside. Instead, she spent hours readin' to her boy from a library well stocked with books from faraway lands."},{"name":"STACIA","text":"Leofard cared for her as her malady grew worse by the day...and he was there by her side when death finally carried her away to Thal's halls."},{"name":"STACIA","text":"While she was alive, she never did ask much of him. Not long before she passed on, however, she wrung from him one single promise: that he escape the conformity she had always endured, and live his life as free as a bird."},{"name":"STACIA","text":"As you've likely guessed, her name was Raimille. That's her portrait there hangin' on the wall..."},{"name":"CAITSITH","text":"Ah, this explains much! I had wondered as to the origin of his vessel's naming."},{"name":"STACIA","text":"The sky pirate way is the life Leofard chose for himself. But I like to think he named his ship the <span class=\"emphasis\">Raimille</span> so that his mother would be there to watch over all of his adventures."},{"name":"LEOFARD","text":"Since when were you so loose-lipped about a comrade's private past, Stacia?"},{"name":"LEOFARD","text":"...I ain't in the habit of leanin' on people's sympathies, so you can all keep that tidbit to yourselves, eh?"},{"name":"LEOFARD","text":"And I thought I told you to see to the furball's wounds. Look at your cape, puss, it's in tatters. Come here a moment..."},{"name":"CAITSITH","text":"A scarf? For me...?"},{"name":"LEOFARD","text":"Aye, that's a little present we give to every new Redbill."},{"name":"LEOFARD","text":"Raimille taught me that it's not protectin' memories that's important─it's havin' the strength to follow your path and make those memories in the first place. Seein' how determined you were to clean your master's slate, I'd say you'd fit right in with our crew."},{"name":"LEOFARD","text":"Listen. If you're thinkin' that that little airship meant a lot to me, then you'd be right. But I'd rather mourn a hunk of metal than lose them as can share in me highs and lows."},{"name":"LEOFARD","text":"So let's get this straight, puss: there's no need for apologies. A sky pirate makes his choice, and he sticks by it."},{"name":"CAITSITH","text":"...The life of a sky pirate, hm? As I seem to be bereft of both place and purpose now, I suppose I shall accept your offer. I am yours to command, Captain!"},{"name":"LEOFARD","text":"Glad to hear it. Your first duty is to join us in givin' our adventurer here a proper send-off!"},{"name":"STACIA","text":"Well, it's about bloody time you two saw eye to eye. But honestly, Captain, you don't mean to head out in those rags, do you? Let's get you cleaned up as well before we say our fond farewells!"},{"name":"STACIA","text":"We've a spare airship the captain can use for now until he feels ready to build a new one..."},{"name":"CAITSITH","text":"For fifteen centuries did I wander in the dark, alone. To be so surrounded by companions and given a new hearth to call home fills me with a warmth I had almost forgotten was possible..."},{"name":"UTATA","text":"Did you see!? Cait Sith is wearing a Redbills scarf! Isn't that just wonderful!"},{"name":"LEOFARD","text":"It's time we parted ways, <span class=\"highlight\">Forename</span>. Let's give you an escort down to Coldwind."},{"name":"LEOFARD","text":"That was some adventure, <span class=\"highlight\">Forename</span>, but our journey into the unknown is over..."},{"name":"LEOFARD","text":"...For the now."},{"name":"LEOFARD","text":"When the skies spit out some new mystery, you can bet that I'm comin' to find you. After all, there ain't nobody else who handles the unexpected quite like you do."},{"name":"LEOFARD","text":"High adventure and the heady rush of danger─surely in this life there is no greater reward!"},{"name":"UTATA","text":"（★未使用／削除予定★）"},{"name":"STACIA","text":"（★未使用／削除予定★）"},{"name":"CAITSITH","text":"（★未使用／削除予定★）"}],"reward":{"gil":615,"items":[{"id":17679}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67909]}},"partials":[{"type":"npc","id":"1018079","obj":{"i":1018079,"n":"Leofard","l":1803,"q":2}},{"type":"npc","id":"1018083","obj":{"i":1018083,"n":"Leofard","l":1803,"q":1}},{"type":"npc","id":"1017527","obj":{"i":1017527,"n":"Utata","l":1803,"q":1}},{"type":"npc","id":"1018072","obj":{"i":1018072,"n":"Stacia","l":1804,"q":1}},{"type":"npc","id":"1018073","obj":{"i":1018073,"n":"Cait Sith","l":1804,"q":1}},{"type":"npc","id":"1018080","obj":{"i":1018080,"n":"Stacia","l":1803,"q":2}},{"type":"npc","id":"1018081","obj":{"i":1018081,"n":"Cait Sith","l":1803,"q":2}},{"type":"npc","id":"1018082","obj":{"i":1018082,"n":"Radlia","l":1803,"q":2}},{"type":"npc","id":"1018084","obj":{"i":1018084,"n":"Stacia","l":1803,"q":1}},{"type":"npc","id":"1018085","obj":{"i":1018085,"n":"Cait Sith","l":1803,"q":1}},{"type":"npc","id":"1018086","obj":{"i":1018086,"n":"Utata","l":1803,"q":1}},{"type":"npc","id":"1018295","obj":{"i":1018295,"n":"Radlia","l":1803,"q":1}},{"type":"item","id":"17679","obj":{"i":17679,"n":"Redbill Scarf","l":1,"c":54957,"t":40,"p":100}},{"type":"quest","id":"67909","obj":{"i":67909,"n":"Where Shadows Reign","g":18,"l":"The Sea of Clouds","s":5,"f":1}}]}