{"quest":{"name":"Cut from a Different Cloth","location":"Idyllshire","id":67917,"patch":3.45,"sort":10,"interval":"daily","repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1018191,"target":1018191,"genre":74,"journal":["Angelet looks at you expectantly.","You speak with Angelet, who makes a seemingly innocent request─with her magicked cloth in hand, she asks you to relive the fiercest battles of your past. The only condition, however, is that you do so at the scene of battle, as that is the only way to quicken the magicks of her fabric. Though the locales she insists upon are likely still teeming with danger, you are not one to balk at a challenge. And so you make haste to the sites of your past adventures.<br><br>※The key item can be obtained by clearing a dungeon via Duty Roulette: Level 50/60/70/80 Dungeons.","Your stroll down memory lane was fraught with peril, but both you and Angelet's magicked cloth remain none the worse for wear, and surprisingly no different. Which seems peculiar since, according to Angelet, there should be some discernible difference in the cloth. Perhaps she can explain what, if any, change has taken place.","Angelet is beaming with excitement upon your return, and the reason for her elation gives you pause. As she explains it, her profession is the crafting of dolls using cursed materials. What was once an ostensibly normal bolt of fabric is now replete with the pain and suffering of your fallen enemies. As promised, she bequeaths to you the singing cluster you desire. In the event you cross paths with her again, you remind yourself not to ask after her merchandise.<br><br>※This repeatable quest can be undertaken once daily. Upon completing the quest, it will become available again the following day at [Reset]<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">1</span><span class=\"alternative\">2</span><span class=\"alternative\">3</span><span class=\"alternative\">4</span><span class=\"alternative\">5</span><span class=\"alternative\">6</span><span class=\"alternative\">7</span><span class=\"alternative\">8</span><span class=\"alternative\">9</span><span class=\"alternative\">10</span><span class=\"alternative\">11</span><span class=\"alternative\">12</span></span></span><span class=\"alternative\">12</span></span> <span class=\"alternative-container\"><span class=\"alternative\">p.m.</span><span class=\"alternative\">a.m.</span></span> (Earth time)."],"objectives":["Obtain the cloth of disturbing memories by clearing a dungeon via Duty Roulette: Level 50/60/70/80 Dungeons.","Deliver the cloth of disturbing memories to Angelet in Idyllshire."],"dialogue":[{"name":"ANGELET","text":"Have you come to help me? I'll gladly pay you with a singing cluster if you do. I promise."},{"name":"ANGELET","text":"You will? Yay! Blamprest is so mean, isn't he? Forcing his work on others. But a brave adventurer like you should have no trouble with this task."},{"name":"ANGELET","text":"My work requires the use of a very special fabric. I weave it myself, but before I can use it I need someone else to rouse the magicks sleeping inside. That's where you come in! I want to use the memories of your toughest battles to wake it up."},{"name":"ANGELET","text":"But you can't do it in just any old place or it won't work. You'll have to take my fabric to where the fighting happened, so the memories are fresh in your mind. Now be careful, and try not to get it dirty."},{"name":"SYSTEM","text":"The key item cloth of disturbing memories can be obtained by clearing a dungeon via Duty Roulette: Level 50/60/70/80 Dungeons."},{"name":"ANGELET","text":"Ah, you're back! Come for another singing cluster? Or perhaps you fancy one of my dolls? Haha, I only jest."},{"name":"ANGELET","text":"Just like before, I'll need you to take this cloth and relive some of your past battles."},{"name":"ANGELET","text":"I trust you can recall something truly gruesome? The bloodier the better, I always say. Their suffering makes my poppets look ever so pretty. Tee hee!"},{"name":"ANGELET","text":"Please, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>, I can't finish my work without that cloth, and the magicks inside will never wake up if you're standing around here."},{"name":"SYSTEM","text":"The key item cloth of disturbing memories can be obtained by clearing a dungeon via Duty Roulette: Level 50/60/70/80 Dungeons."},{"name":"ANGELET","text":"You're back! I was beginning to worry something awful had happened. How did you fare? Has the cloth changed at all?"},{"name":"ANGELET","text":"Don't be so mean. I had hoped you were different from the others. Always begging for help, yet never willing to offer it in return..."},{"name":"ANGELET","text":"Oh, it's perfect! I knew you could do it. Thank you, thank you!"},{"name":"ANGELET","text":"Would you look at this. The texture is smooth with agony, the colors rich with hopelessness. It practically drips with the resentment of all the people you've slain."},{"name":"ANGELET","text":"You see, I make poppets for a living, and my materials must be cursed before I can work. A curse on its own is only wishful thinking, but with a little death, misery, and a touch of magic, my dolls can become so much more. They will look so pretty dressed with this beshrewed fabric. Such tricks they will play."},{"name":"ANGELET","text":"I must say, the people you killed must have been really, <span class=\"emphasis\">really</span> sad when they died. I've never had material so stained, so powerful... These will be my loveliest poppets ever!"},{"name":"ANGELET","text":"As promised, the singing cluster is yours. Perhaps next time I'll include a poppet as thanks. Would you like that? Tee hee!"}],"reward":{"items":[{"id":16064}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67915]}},"partials":[{"type":"npc","id":"1018191","obj":{"i":1018191,"n":"Angelet","l":2082,"q":1}},{"type":"item","id":"16064","obj":{"i":16064,"n":"Singing Cluster","l":1,"c":20027,"t":54}},{"type":"quest","id":"67915","obj":{"i":67915,"n":"Future Proof","g":74,"l":"Azys Lla","s":8,"r":1,"f":1}}]}