{"quest":{"name":"Dead but Not Gone","location":"South Shroud","id":67924,"patch":3.45,"sort":520,"icon":100592,"unlocksFunction":1,"eventIcon":71341,"issuer":1017324,"target":1017325,"genre":86,"journal":["The Wood Wailers are confounded by a recent find in the Palace of the Dead.","During a recent expedition, the Wood Wailers were shocked to discover notes they believe to be penned by Nybeth Obdilord, the dread sorcerer who raised the Palace of the Dead. Knowing you had the misfortune of meeting him in person, they would consult with you regarding the contents of the documents. An expeditionary awaits you by the entrance to Issom–Har.","The expeditionary explains to you that he and his fellow Wood Wailers are puzzled by the strange script of the documents, which he surmises originated in a foreign land. E–Una–Kotor, having communed with the elementals, believes they are not from another land, but another world entirely. Taking the notes in hand, visions of Nybeth and Edda suddenly flash before your eyes. It would appear that his true purpose in building the palace was to master the art of resurrection, giving him the power to bring his lover back from the dead. E–Una–Kotor finds such a motive implausible, but with the dark sorcerer slain, the truth now remains buried in the hallowed grounds beneath Issom–Har."],"objectives":["Speak with the expeditionary."],"dialogue":[{"name":"WOODWAILER01556","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam!</span><span class=\"alternative\">Sir!</span></span> A moment, if you would. Are you not the adventurer who felled the dark sorcerer in the ruins? It <span class=\"emphasis\">is</span> you, thank the Twelve! We are in immediate need of your assistance!"},{"name":"WOODWAILER01556","text":"Allow me to explain. On a recent reconnaissance mission, our men unearthed documents we believe were written by the selfsame sorcerer you encountered down in the labyrinth. As we have been desperately searching for more insight into this man and the unspeakable acts he committed, the importance of this discovery cannot be overstated. "},{"name":"WOODWAILER01556","text":"The documents have thus far proved beyond our comprehension, but now that <span class=\"emphasis\">you</span> are here─why, who better to help us decipher their contents than the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who braved the depths of those fell ruins to confront the fiend!"},{"name":"WOODWAILER01556","text":"One of my fellow expeditionaries will be waiting for you at Issom–Har with the aforementioned documents. E–Una–Kotor communes with the elementals as we speak─he, too, shall join you anon."},{"name":"WOODWAILER01556","text":"Pray make haste to Issom–Har. E–Una–Kotor shall meet with you there anon."},{"name":"WOODWAILER02338","text":"Well met, adventurer. Your cooperation in this matter is much appreciated. We had hoped these documents would serve to enlighten us regarding the nature and motives of the dread sorcerer Nybeth, but I fear there is a rub..."},{"name":"WOODWAILER02338","text":"They are written in a foreign script that is entirely unfamiliar to our eyes. We know not where to begin in determining the origin of these odd glyphs, let alone deciphering their meaning."},{"name":"EUNAKOTOR","text":"'Tis little surprise they are not familiar to you. If that most curious aetheric signature is aught to judge by, I would surmise those papers, and the man who penned them, hail from a world not our own."},{"name":"EUNAKOTOR","text":"<span class=\"highlight\">Forename Surname</span>... Kan–E–Senna tells me that you possess a special gift─one that grants you a preternatural insight to the true nature of those around you."},{"name":"EUNAKOTOR","text":"From my understanding, this power is not one to be invoked at will. But having exposed yourself to the otherworldly presence of Nybeth, mayhap... Might you take these documents into hand, and see if aught appears before your mind's eye?"},{"name":"NYBETHOBDILORD","text":"No, no, no! This is all wrong! Her soul will not remain bound to the flesh. It is as if she is rejecting her corporeal form. Mayhap the vessel is too weak...?"},{"name":"NYBETHOBDILORD","text":"But that cannot be! A passionate spirit is possessed of inexhaustible stores of aether, and hers is by far the most strong-willed of my specimens. She should have the strength to remain tethered to this realm in perpetuity!"},{"name":"NYBETHOBDILORD","text":"But no...! Not even a glimmer of life in her body! Could it possibly be...? That her spirit would seek to return to the aetherial sea of its own accord...!? Preposterous!"},{"name":"NYBETHOBDILORD","text":"Would you be so foolish as to welcome the hollow embrace of eternal sleep? To sate yourself with memories of your worthless life as you drift off into the void?"},{"name":"NYBETHOBDILORD","text":"Hmph... And what would you say, <span class=\"emphasis\">old friend</span>? Would you blather about the virtue of accepting death, and extol her pure-hearted wish to rest beside her lost love?"},{"name":"NYBETHOBDILORD","text":"Hah! I think not! My Edda would never be blinded to the truth by some starry-eyed fantasy! No, a spirit as strong as hers would never fade so meekly into nothingness."},{"name":"NYBETHOBDILORD","text":"Only a fool would yearn for death, to lay quietly within that mortiferous shade! And that is why I press on─to realize the dreams of all who came before me, and all who will come after!"},{"name":"NYBETHOBDILORD","text":"And yet... It would seem your spirit remains entangled with that of another. Not your lost love, no─but the one who besmirched your soul with these vulgar notions of accepting─nay, <span class=\"emphasis\">embracing</span> that vain slumber!"},{"name":"NYBETHOBDILORD","text":"It's that rat sniffing about in my maze, isn't it? I can still smell <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> stench upon you. And the repugnant foetor of the...<span class=\"emphasis\">admiration</span> you feel for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"NYBETHOBDILORD","text":"Let us conduct an experiment, shall we? Yesss, a test of loyalty─one that shall also serve to purge these halls of <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who would dare interfere with my most noble aims!"},{"name":"NYBETHOBDILORD","text":"Go forth, my sweet Edda! Go forth and seek out your <span class=\"emphasis\">beloved</span> hero."},{"name":"NYBETHOBDILORD","text":"Give <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> the gift of death you would seek yourself, and in the doing, free yourself from the shackles that bind your spirit so!"},{"name":"NYBETHOBDILORD","text":"Soon... Yes, soon the secrets of eternal life will be mine! Will be...<span class=\"emphasis\">ours</span>."},{"name":"NYBETHOBDILORD","text":"Then, my love...I shall pull back the veil, and pluck your soul from the wastelands of the damned. And we shall be as one again, inseparable forevermore! Muahahaha!"},{"name":"EUNAKOTOR","text":"You return to us, <span class=\"highlight\">Forename</span>. Pray tell, what did you see?"},{"name":"WOODWAILER02388","text":"This dread sorcerer sought to bring his beloved back from the dead? <span class=\"emphasis\">That</span> is what impelled him to torment countless souls in his experiments down in those shadowy depths?"},{"name":"EUNAKOTOR","text":"While I cannot say for certain, I would rather not believe that such a simple, innocent desire could give birth to such blasphemous deeds."},{"name":"EUNAKOTOR","text":"Nor am I inclined to believe that resurrection of the manner he suggests is even possible. Nay, I find it far more likely he meant only to play some cruel game with poor Edda, preying on the love she bore for her friends."},{"name":"EUNAKOTOR","text":"Even if there was once an onze of compassion in that monster's heart, one thing is certain─his unholy quest to rejoin body and spirit has disturbed the balance of the Twelveswood."},{"name":"EUNAKOTOR","text":"Longing to reunite with a lost love is one thing, but to knowingly sacrifice the lives of countless others... 'Tis little wonder that such an odious act would incur the wrath of the elementals."},{"name":"EUNAKOTOR","text":"As a Padjal, I cannot sit idly by as such terrors endanger our forest home."},{"name":"EUNAKOTOR","text":"From the pages of that fiend, I could sense naught but an all-consuming obsession with life and death, and a hunger for the shadows."},{"name":"EUNAKOTOR","text":"You confronted the dread necromancer in the heart of the labyrinth. Tell me─what did you make of him and his goals?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"He was a depraved monster who saw the dead as mere playthings."},{"name":"A2","text":"He was a twisted, pitiful creature driven by false ideals."},{"name":"A2","text":"..."},{"name":"EUNAKOTOR","text":"I daresay you have the right of it. No matter what his stated aim, disturbing the peace of the departed is a heinous crime indeed."},{"name":"EUNAKOTOR","text":"Pitiful indeed. He chose to flee from death─from the natural order of existence─to go where no man should tread. I daresay his soul is unlikely to ever find peace."},{"name":"EUNAKOTOR","text":"Ah, pray forgive me. It was untoward of me to ask you to speculate on the aspirations of a madman after only a short glimpse into his past."},{"name":"EUNAKOTOR","text":"At the very least, we can take comfort in knowing that Nybeth and his ill ambitions are no more. Now, we must see to it that the labyrinth is purged of the abominable creations that run rampant within, that the wayward souls still trapped there may at long last find peace."},{"name":"EUNAKOTOR","text":"When the Palace of the Dead is at last cleansed of the sorcerer's taint, I will invoke the power of the elementals to seal closed the ingress, that none may ever be lost to its unholy halls again."}],"reward":{"gil":648,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67093]}},"partials":[{"type":"npc","id":"1017324","obj":{"i":1017324,"n":"Wood Wailer Expeditionary","l":56,"q":1}},{"type":"npc","id":"1017325","obj":{"i":1017325,"n":"Expeditionary","l":56,"q":1}},{"type":"quest","id":"67093","obj":{"i":67093,"n":"The Nightmare's End","g":86,"l":"South Shroud","s":500,"f":1}}]}