{"quest":{"name":"Lift Me to the Moon","location":"Coerthas Western Highlands","id":67920,"patch":3.5,"sort":3,"icon":100602,"eventIcon":71221,"issuer":1018248,"target":1018255,"involved":[1011907,1016087,1016088,1018249,1018251,1018252,1018253,1018254],"genre":63,"journal":["The deftarm is trembling with equal parts excitement and fear.","You and the deftarm have learned that your quarry has plotted a course for the Sea of Clouds in a manacutter commandeered from the Convictory. His anxiety about traveling to unfamiliar environs tempered the knowledge that you have friends among the Vanu Vanu who call this place home, your ever-enthusiastic pupil dashes off to hop aboard a kongamato. You can only hope that the deftarm's overeagerness will not be his downfall.","You arrive at Ok' Gundu Nakki to see that the deftarm has managed to get himself captured by Linu Vanu, who has mistaken the Vath for an atypical─but still appetizing─wamouracampa. The Vanu Vanu soon releases his quarry with a flurry of apologies, however, upon hearing that his would-be meal is in fact your fast friend and pupil. Linu Vanu can offer no news on the man you seek, but does share his concern that his sister Linu Vali has not returned since leaving the village to perfect a new dance. Concerned that she may come to harm if the masked marauder is roaming the area, you and the deftarm set out in search.","You find Linu Vali, and are relieved to see that she has come to no harm, but was merely seeking inspiration for her new dance in the idyllic climes of Voor Sian Siran. She laments, however, that her new dance has not taken form quite as she hoped it would. Turning to you for inspiration, she asks that you perform for her a dance the likes of which neither her kind nor yours has ever seen. Might you perchance have some movements in your repertoire that would serve to stir her creative juices?","You dance the dance of the moogles for Linu Vali, who is most taken with these endearing and unworldly undulations, joyfully proclaiming that she has found her long-sought inspiration. Unfamiliar with the importance of dance in Vanu Vanu culture, the deftarm is less than impressed, derisively insisting that flailing about will not avail you in the matter at hand: to wit, the pursuit of the masked villain you seek. Your pupil is quickly silenced when, against all odds, you spot a suspicious personage enjoying a leisurely bath in a nearby pool. The masked man introduces himself as Nhaza'a Jaab, and you soon surmise that this is none other than the ruthless villain behind Gullinbursti's sudden turn to madness. Your brave-if-foolhardy pupil steps forth to confront the masked Miqo'te and gleans some gainful information in the process: namely, that the man is in the service of an imperial agent, and possesses a firearm with the power to rob dragons and beastmen of their free will. The confrontation is brief, however, as the ruthless rogue treacherously disarms the deftarm. Wielding his weapon against a trio of unwitting Gundu warriors who arrive on the scene, he turns them against you and takes advantage of the ensuing chaos to make a discreet retreat. When Linu Vali's sundrop dance fails to subdue the ensorcelled Gundu, she asks you to join her in performing the dance she devised with your inspiration. The moonlift dance─as Linu Vali dubs it─shakes the very earth, and the Gundu return to their senses as they back away, ashamed at their actions. All present breathe a sigh of relief, although the deftarm is clearly disheartened that the dance he so mocked proved more powerful than did he. Perhaps a word from you might serve to lift your pupil's spirits.","The deftarm is discouraged, but undeterred, and together you resolve to continue the search for your dangerous and elusive quarry. In the meantime, Linu Vali invites you and your friends to return to Ok' Gundu Nakki, where she would report back to Linu Vanu on recent developments.","Back in Ok' Gundu Nakki, you are rejoined by Master Mogzin and Ohl Deeh, who lament that while they were able to track down Gullinbursti, he soon flew off in a rage, doubtless summoned by the master that Nhaza'a Jaab serves. You, the deftarm, and Ohl Deeh resolve to pursue him northeast to Azys Lla, but not all of your friends will be following you. For while Linu Vali desires to join you, she is forbidden by Vanu tradition from setting foot in that baneful land. Meanwhile, Master Mogzin seems to have suffered a sudden crisis of confidence, insisting that he has naught to offer you in the battle to come. Ignoring the heated pleas of the deftarm and Ohl Deeh, he shrinks off back to Moghome with his tail between his legs..."],"objectives":["Rendezvous with the deftarm at Ok' Gundu Nakki.","Search for Linu Vali at Voor Sian Siran.","Perform for Linu Vali a /dance she has never seen.","Speak with the deftarm.","Speak with the deftarm at Ok' Gundu Nakki."],"dialogue":[{"name":"JANTELLOT","text":"Were it me, I'd want nothing to do with that man, but I suppose adventurers like yourself do not have the same luxury. I know that you are more than capable of holding your own on the field of battle─to say the least─but still...do be careful out there."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; What say you, Master? Reaching the Sea of Clouds is as simple as traveling northeast and hopping on the back of a kongamato, but wherever should we go from there? Is there anyone in that distant land that might aid us in our quest?"},{"name":"UDEKIKI","text":"The...Vanu Vanu? Of the island of Ok' Gundu...Nakki? These names and sounds are unfamiliar to me. To have won the trust and friendship of a tribe I have not so much as heard of, let alone seen! Once again I am beside myself with admiration, Master."},{"name":"UDEKIKI","text":"As your devoted pupil, I am eager to earn their trust as well. To the Sea of Clouds, Master! I shall race you there!"},{"name":"LINUVANU","text":"<span class=\"highlight\">Forename</span> returns to us as warm spring breeze after long winter. And you could not have come at a better time! For <span class=\"alternative-container\"><span class=\"alternative\">tonight</span><span class=\"alternative\">today</span></span> we shall feast!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Master! You must save me! I had just arrived on these shores when these monstrous bird creatures captured me! I think they mean to eat me!"},{"name":"LINUVANU","text":"You honor us with your return, <span class=\"highlight\">Forename</span>. We will celebrate your arrival with a great feast. Look here! Funny wamouracampa stumbles into our trap like clumsy paissa falling into sinkhole."},{"name":"LINUVANU","text":"A strange one it is, but surely tasty. Bring shell-cracker! Linu Vanu shall knead its meat into his specialty catsfoot chew!"},{"name":"LINUVANU","text":"Your pupil, you say!? Oh, forgive me, <span class=\"highlight\">Forename</span>! Linu Vanu owes you apologies as innumerable as the stars in the night sky! Release the netherling's bite-sized friend at once."},{"name":"LINUVANU","text":"...I see. Linu Vanu shares your struggle and your pain, and wishes he could be of aid, but such a person is not known to Linu Vanu or the Gundu. Deeply sorry is Linu Vanu."},{"name":"LINUVANU","text":"It is with shame and heavy heart that Linu Vanu speaks of his own worries, but Linu Vanu fears for his sister. Linu Vali departs Ok' Gundu Nakki in search of ideas for new dance. Linu Vanu waits and waits, but she does not return. Linu Vanu fears storm clouds are brewing..."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Master! If the masked man is behind this, this Linu Vali may be in grave danger! Very grave! We should go quickly, yes?"},{"name":"LINUVANU","text":"<span class=\"highlight\">Forename</span> and apprentice are like shining sun to chase away the clouds of Linu Vanu's anxious heart. If Linu Vanu knows his sister, you are like to find her in Voor Sian Siran. Go in safety, my friends."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Thank you for saving me, Master. I am unfamiliar with this “catsfoot chew,” but I would prefer not to be chewed up all the same. I must say, I find these Vanu Vanu somewhat intimidating. Anyhow, let us be off to Voor...whatever it was."},{"name":"LINUVANU","text":"<span class=\"highlight\">Forename</span> and apprentice are too kind to assist Linu Vanu in search for Linu Vali. Go in safety to Voor Sian Siran, and please tell your friend that he need not worry about being eaten...at least not by Linu Vanu."},{"name":"LINUVALI","text":"Oh, <span class=\"highlight\">Forename</span>! Your presence is ever like a gentle breeze on a summer's day. Whatever brings you back to the home of the Vanu Vanu?"},{"name":"LINUVALI","text":"Oh, but if that isn't the most succulent-looking wamouracampa Linu Vali has ever seen!"},{"name":"UDEKIKI","text":"H-How many times must I say it!? I am not a wamoura-anything, and I am most certainly <span class=\"emphasis\">not</span> to be eaten! I am the Vath deftarm, and I am an adventurer! Please tell her, Master!"},{"name":"LINUVALI","text":"A thousand pardons, friend Deftarm! Linu Vali's nose was deceived by your most inviting aroma. Do not worry, you are safe with Linu Vali. That said, I fear I have seen and heard nothing of this masked man of whom you speak."},{"name":"LINUVALI","text":"Linu Vali did not mean to cause Brother to worry. Linu Vali simply came here to practice her new dance. Linu Vali would show it to you, but she fears that there is not much yet to be worthy of showing..."},{"name":"LINUVALI","text":"...But of course! Surely you have encountered a new dance in your travels, <span class=\"highlight\">Forename</span>? A dance unlike any seen by Gundu or your kind? If you know such a dance, pray show it to Linu Vali, that it might be as a lightning bolt of inspiration!"},{"name":"LINUVALI","text":"Surely you have encountered a new dance in your travels, <span class=\"highlight\">Forename</span>? A dance unlike any seen by Gundu or your kind? If you know such a dance, pray show it to Linu Vali, that it might be as a lightning bolt of inspiration!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; <span class=\"emphasis\">Dancing</span>? I do not mean to doubt you, Master, but surely there are more important matters that demand our attention."},{"name":"LINUVALI","text":"No...no, those motions do not move Linu Vali. Surely you have seen a more...<span class=\"emphasis\">exotic</span> dance? One the likes of which no Gundu has ever seen?"},{"name":"LINUVALI","text":"Yes...yes! Vigor and vitality wells up from within Linu Vali like a fount gushing skyward from the earth! <span class=\"emphasis\">This</span> is the bolt of inspiration I have so long sought! With this, Linu Vali will create a dance that will go down in Gundu history!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; What is it with this dancing!? And you, Master! Forget these overgrown birds─I would have thought <span class=\"emphasis\">you</span> of all people would understand the seriousness of our task! We are never going to find that masked man bouncing around like fools!"},{"name":"LINUVALI","text":"A thousand pardons, friend. Neither <span class=\"highlight\">Forename</span> nor Linu Vali meant to offend. We sympathize with your plight, but pray understand: to we Vanu, dance is not foolishness, oh no! It is an act as sacred as life and death. If it does not help you in your quest, Linu Vali is sorry, and yet..."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Shhh! Master, over there! I cannot believe I am saying this, but if my eyes see true, that is...!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; I knew it! It's him!<br>You there! Who are you, and what have you done to Gullinbursti!?"},{"name":"NHAZAAJAAB","text":"(-Menacing Miqo'te-)Hmph... Can a man not enjoy a bath in peace?"},{"name":"NHAZAAJAAB","text":"(-Menacing Miqo'te-)Then again, I know better than to expect common courtesy from beastman brutes. Even those who are wont to travel with more...civilized types."},{"name":"NHAZAAJAAB","text":"An adventurer, are we? One would think you'd have learned to keep better company. And to keep a wide berth of Nhaza'a Jaab, the Ebon Claw. But you'll learn soon enough, won't you? Oh yes, you will..."},{"name":"NHAZAAJAAB","text":"Well, well! Now <span class=\"emphasis\">there's</span> a face I never thought I'd see again. Though I suppose you would say the same of Nhaza'a Jaab...wouldn't you, <span class=\"emphasis\">old friend</span>? Mayhap you've come to thrill and delight me? For old times' sake?"},{"name":"UDEKIKI","text":"I asked you a question, vile rogue! What did you do to the dragon Gullinbursti!? You will give me an answer, or...or I, the deftarm, will beat one out of you!"},{"name":"NHAZAAJAAB","text":"Heh heh heh...a brute and a beast you may be, but you have spirit. If you did not repulse me so, I might almost like you. Here is your answer: I did my job...and nothing more."},{"name":"NHAZAAJAAB","text":"A simple task: to scour the Churning Mists for a mighty dragon, and pierce his scales with a single bullet. A bullet that would warp his mind and twist his heart, destroying any semblance of the noble creature he once was, until all that remained was a brute consumed with pure, <span class=\"emphasis\">animal</span> rage. A beautiful thing, is it not?"},{"name":"UDEKIKI","text":"Wh-What...what madness is this!? The hearts of others are not yours to control!"},{"name":"NHAZAAJAAB","text":"Curious words coming from one of <span class=\"emphasis\">your</span> kind. Go back to your hive, Gnath. You were never meant to possess a mind of your own."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Y-You know nothing of me! I am the Vath deftarm─an adventurer just like the master who trained me! I have tracked you, I have found you, and I will see you answer for your deeds!"},{"name":"NHAZAAJAAB","text":"Hmmmmmm? Hah...hah...bwahahahahahahahahaha! Oh, but my ears must be playing tricks on me! For a moment there, I thought I heard the witless antling say he was an <span class=\"emphasis\">adventurer</span>!"},{"name":"UDEKIKI","text":"S-Silence! I am more of an adventurer than you will ever be! Now answer me! What master do you serve, and what does he mean to do with Gullinbursti!?"},{"name":"NHAZAAJAAB","text":"I “serve” some imperial lackwit whose name I could not be bothered to remember. A fool's coin is worth as much as any man's, you see, and they tend to part with it more easily than most. Now, would you mind lowering your weapon? As you can see, I am unarmed...though I suppose I should know better than to expect decency from an animal."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; The deftarm is no...animal."},{"name":"NHAZAAJAAB","text":"...All too easy. Didn't your master teach you not to trust me?"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; You...you do not fight with honor!"},{"name":"NHAZAAJAAB","text":"You're a quick learner...though not quick enough, I'm afraid. Now, we know what this can do to a dragon... I wonder what it might do to a Gnath?"},{"name":"NHAZAAJAAB","text":"Or a Vanu Vanu, or even... Oh, <span class=\"emphasis\">yes</span>...!"},{"name":"UDEKIKI","text":"N-No! Leave my friends alone, or I...I will rend the flesh from your bones!"},{"name":"NHAZAAJAAB","text":"Ahahahahaha! Yes, <span class=\"emphasis\">yesss</span>! Let me taste your fear and your hatred! Your rage and despair! Despise me! Abhor me! <span class=\"emphasis\">Delight</span> me!"},{"name":"ZOUHYOUVANU02384","text":"(-Gundu Warrior-)Who goes there!? Who dares intrude on Gundu lands!?"},{"name":"NHAZAAJAAB","text":"...And just when I was starting to get in the mood. But perhaps we might enjoy ourselves another way...?"},{"name":"ZOUHYOUVANU02384","text":"(-Gundu Warrior-)M-My...my head... M-My body... My arms...they...ngggaaaAAAHHHHHH!!!"},{"name":"NHAZAAJAAB","text":"Oh dear...it seems your friends aren't so friendly anymore. Well, do have fun killing each other. There's somewhere I must be."},{"name":"LINUVALI","text":"Quickly, <span class=\"highlight\">Forename</span>! Join Linu Vali, and together we will dance them away!"},{"name":"LINUVALI","text":"The sundrop dance does not reach them! Linu Vali knows not if she is ready, but there is no other way. Watch, <span class=\"highlight\">Forename</span>! Watch and move with Linu Vali!"},{"name":"ZOUHYOUVANU02384","text":"(-Gundu Warrior-)Wh-What...what madness has taken us!? F-Forgive us, Linu Vali! We meant no harm!"},{"name":"LINUVALI","text":"Linu Vali knew she could count on <span class=\"highlight\">Forename</span>. Even without practice, <span class=\"highlight\">Forename</span>'s motions match Linu Vali in perfect harmony, like we are <span class=\"alternative-container\"><span class=\"alternative\">sisters</span><span class=\"alternative\">brother and sister</span></span> from the same nest."},{"name":"LINUVALI","text":"<span class=\"highlight\">Forename</span> and Linu Vali─netherling and Gundu─dance as one. Different beings we are, but together we lift each other to new heights, and shine radiant light through the darkness. In honor of this, Linu Vali would name her new dance <span class=\"emphasis\">moonlift dance</span>. A fine name, would you agree?"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; I mocked you, but your dance has proved stronger than I could ever be. When confronted with my greatest challenge yet, it is I who made a mockery of myself..."},{"name":"LINUVALI","text":"Thanks to you, <span class=\"highlight\">Forename</span>, moonlift dance is now complete, and is a shining success. When the storm has passed, we will hold a great celebration at Ok' Gundu Nakki, and together we will dance."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; F-Forgive me, Master... For all you have taught me, I could do nothing against our foe. And he has eluded us again. Whatever shall we do?"},{"name":"LINUVALI","text":"Do not lose heart, friend. For now, let us return to Ok' Gundu Nakki. Brother is surely worried for us, and Linu Vali would put his heart at ease."},{"name":"LINUVALI","text":"Linu Vali told Brother all about our encounter with the masked man, and how Linu Vali and <span class=\"highlight\">Forename</span> chased the threat away. Brother is eager to see our moonlift dance with his own eyes."},{"name":"LINUVANU","text":"A thousand thank-yous, <span class=\"highlight\">Forename</span>. Not only have you rescued Linu Vali from grave danger, you have joined in the creation of a dance that will go down in Gundu history. Your presence is like an ever-steady sunbeam shining through the trees to warm our feathers."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; Wherever shall we go now, Master? Shall we go after that masked man? Perhaps we might begin by tracking down the master he serves..."},{"name":"UDEKIKI","text":"Or perhaps we should return to Moghome, and share what we have learned with Master Mogzin? Doubtless he is eager to know..."},{"name":"MOGZIN","text":"(-???-)Kupopo! Did somebody call?"},{"name":"LINUVALI","text":"Well, look what we have here! A cuddly little gaelicat and a fledgling chick! Have you wandered from your nest to join Linu Vali and her friends in dancing our new dance?"},{"name":"MOGZIN","text":"Cat!? Who are you calling a cat!? I am Master Mogzin of the Mogmenders, the renowned guild of craftsmoogles that repaired the ancient plaza of Bahrr Lehs. Perhaps you have heard of us, kupo?"},{"name":"OHLDEEH","text":"And I am no fledgling! Do you not see these resplendent scales? I am Ohl Deeh, a mighty and powerful dragon! Cower in my wake!"},{"name":"OHLDEEH","text":"And just what are <span class=\"emphasis\">you</span> supposed to be? Why, I have never seen such a portly, pudgy bird in my life!"},{"name":"LINUVALI","text":"You do me too great an honor with your words, friend. My cheeks turn as red as a fiery sunset. I am Linu Vali of the Gundu, and I bid you welcome to Ok' Gundu Nakki."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; I do not think he meant that as a...never mind. Master Mogzin, Ohl Deeh─what brings you to this place?"},{"name":"MOGZIN","text":"We traveled far and wide, over mountains and across the skies, in pursuit of Gullinbursti! Our journey took us here, but just when we thought we had him, he evaded our paws, kupo!"},{"name":"OHLDEEH","text":"We may have lost him, but we have now found you! I daresay today is not a total loss."},{"name":"MOGZIN","text":"Speaking of which, how did you and your pupil fare in your search for the masked man? Were you able to learn the truth of what he did to Gullinbursti?"},{"name":"MOGZIN","text":"A weapon that can twist and warp the hearts of dragons and beasts!? What a positively frightful proposition! The mere thought of it makes the fur on my back stand on end, kupo!"},{"name":"MOGZIN","text":"We did catch up with Gullinbursti, but he was even less receptive to our words than before. He only let out a mighty roar, then soared off to the northeastern skies in a rage. It was almost as if something were <span class=\"emphasis\">calling</span> him there. As much as it pains me to say it, I fear he may be gone for good, kupo."},{"name":"OHLDEEH","text":"P-Preposterous! Gullinbursti was as kind and noble a dragon as I have ever known! Surely there is a way to reach him and restore him to his senses!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; I must agree with Ohl Deeh. I saw it with my own eyes, I did. When Master and Linu Vali danced together, the rage of the mad Gundu was quick to subside."},{"name":"LINUVALI","text":"Yes, Linu Vali swears this is true. As dance can reach the heart of us Vanu Vanu, surely there is a way to call out to your dragon friend, too!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; That's right! I know not yet what it might be, but we must try! Gullinbursti has clearly been summoned to some strange land by that masked man's vile master. We must set out to the northeast, and hurry to his side!"},{"name":"LINUVALI","text":"...Wait, friend. You do know what lies northeast of here, yes? It is Azys Lla, the land of nightmares where all Vanu are forbidden to tread."},{"name":"LINUVALI","text":"It is with great shame that Linu Vali says she can accompany you no further. And after all <span class=\"highlight\">Forename</span> has done for Linu Vali..."},{"name":"UDEKIKI","text":"Think nothing of it. Nothing at all! This was a task for Master and I from the beginning, and Master and I will see it done. Is that not right, Master?"},{"name":"MOGZIN","text":"Such powerful words, kupo! I have the utmost confidence in you. A-And with that...I do believe I'll be heading back to Moghome. My hammer is made for crafting, not fighting, after all..."},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; You are going <span class=\"emphasis\">home</span>!? What foolishness is this!? You care for your friend Gullinbursti, do you not!? Surely there is some way you could be of service without fighting! Any way at all!"},{"name":"OHLDEEH","text":"That's right, Mogzin! I thought you were a friend to dragons! To Gullinbursti, and to me!"},{"name":"MOGZIN","text":"I...I am sorry. But you will be better off without me. You must...believe me, kupo..."},{"name":"UDEKIKI","text":"Does that moogle have no shame!? It would seem I was right about him after all! He is a lazy do-nothing! A slacker, and nothing more!"}],"reward":{"gil":1430,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67919]},"next":[67921]},"partials":[{"type":"npc","id":"1018248","obj":{"i":1018248,"n":"Vath Deftarm","l":2200,"q":1}},{"type":"npc","id":"1018255","obj":{"i":1018255,"n":"Vath Deftarm","l":2100,"q":2}},{"type":"npc","id":"1011907","obj":{"i":1011907,"n":"Jantellot","l":2200,"q":12}},{"type":"npc","id":"1016087","obj":{"i":1016087,"n":"Linu Vali","l":2100,"q":10}},{"type":"npc","id":"1016088","obj":{"i":1016088,"n":"Linu Vanu","l":2100,"q":14}},{"type":"npc","id":"1018249","obj":{"i":1018249,"n":"Vath Deftarm","l":2100,"q":1}},{"type":"npc","id":"1018251","obj":{"i":1018251,"n":"Linu Vali","l":2100,"q":1}},{"type":"npc","id":"1018252","obj":{"i":1018252,"n":"Vath Deftarm","l":2100,"q":1}},{"type":"npc","id":"1018253","obj":{"i":1018253,"n":"Linu Vali","l":2100,"q":1}},{"type":"npc","id":"1018254","obj":{"i":1018254,"n":"Vath Deftarm","l":2100,"q":1}},{"type":"quest","id":"67919","obj":{"i":67919,"n":"Who Was That Masked Man","g":63,"l":"The Churning Mists","s":2}},{"type":"quest","id":"67921","obj":{"i":67921,"n":"Eternity, Loyalty, Honesty","g":63,"l":"The Sea of Clouds","s":4}}]}