{"quest":{"name":"It's Time to Duel","location":"Wolves' Den Pier","id":67929,"patch":3.4,"sort":0,"eventIcon":71221,"issuer":1005419,"target":1005418,"genre":91,"journal":["The nervous trembling of his legs suggests this Auri brawler may not be as tough as he appears.","No sooner do you look in his direction than an Auri monk cowers away from you, begging for mercy. His fear soon gives way to relief after realizing you did not come to knock him on his backside. As he explains it, the Maelstrom has opened an arena where adventurers may freely challenge comrades-in-arms to combat. What has the Auri fighter so concerned, however, is that because these battles are not confined to the Pit of the Wolves' Den, he has been constantly harassed by strangers looking to pick a fight. Judging by the air of confidence about you, he suggests you pay a visit to the officer down on the docks, that you might learn more about this new fighting ring.","You approach the Maelstrom officer, and at a glance she can tell you have a hunger for battle that cannot be sated in the Pit of the Wolves' Den. Before you rush headlong into the arena, however, she intends to explains the protocols one must follow when dueling on the Wolves' Den Pier."],"objectives":["Speak with the Maelstrom drill sergeant."],"dialogue":[{"name":"WOLF02393","text":"P-Please, I beg of you! Stay those ferocious-looking fists! I'm not ready for full contact sparring! Why, I've only just begun to practice my One Ilm Punch!"},{"name":"WOLF02393","text":"S-So...you haven't come to duel me, then? My apologies. You have the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who enjoys the thrill of a fight, and I thought perhaps you'd come to challenge me. "},{"name":"WOLF02393","text":"And for good reason, I might add! You see, the Maelstrom recently opened up a new sparring ground of sorts, right here on this pier. Now adventurers can go toe-to-toe without climbing down into the Pit."},{"name":"WOLF02393","text":"I was all but certain you were just like everyone else, eager to earn a notch on your belt. I haven't the skill nor the courage to put up a fight, but you've the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who's weathered <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fair share of battles. Perhaps you'd like to test your mettle in the ring? N-Not with me, of course."},{"name":"WOLF02393","text":"The officer who oversees the arena is just over there. Doubtless she'd be happy to tell you all about it. Just look at that frightful stare─always on the lookout for fresh blood, or so they say!"},{"name":"WOLF02393","text":"If you're looking to test your skills in the arena, don't let me keep you. Hop down from here, head straight down the dock, and speak with the drill sergeant. You can't miss her."},{"name":"WOLF02393","text":"I'd accompany you down there, but I fear that crazed, bloodthirsty Lalafell from yesterday is still about. Just the thought of her beady little eyes, and that sinister grin─the stuff of nightmares, I tell you."},{"name":"DUELOFFICER","text":"What's this? Another wolf pup itchin' to get in the ring, are ye? Well, if it's blood yer after, and ye need it quick, might be ye can slake yer thirst here."},{"name":"DUELOFFICER","text":"Before ye go rushin' off to get yerself bludgeoned, though, there's rules to be learned. Don't ye worry none, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I'll teach ye all ye need to know."}],"reward":{"gil":231,"xp":50},"reqs":{"jobs":[{"lvl":1,"id":34}]}},"partials":[{"type":"npc","id":"1005419","obj":{"i":1005419,"n":"Faint-hearted Fighter","l":358,"q":1}},{"type":"npc","id":"1005418","obj":{"i":1005418,"n":"Maelstrom Drill Sergeant","l":358,"q":1}}]}