{"quest":{"name":"Keeping Up with the Aliapohs","location":"Idyllshire","id":67928,"patch":3.4,"sort":6100,"unlocksFunction":1,"eventIcon":71341,"issuer":1018317,"target":1017653,"genre":101,"journal":["An adventurer stands before you wearing a shite-eating grin and gazing at you in a way that makes you not entirely comfortable.","A pathetic sop of an adventurer heaps cloying praise upon you before promptly foisting upon you some task that he is either incapable of or unwilling to─mayhap both─perform himself. He quickly scampers off before supplying any of the relevant details, save that it involves lending your aid to one Khloe Aliapoh, a shopkeep at Rowena's Center for Cultural Promotion whose mere smile is seemingly sufficient to reduce the man to a stammering clod. Investigate and hope that you've seen the last of that sad buffoon.","You introduce yourself to Khloe Aliapoh, a charming Miqo'te girl with a love for telling stories of heroes and derring-do. She explains that recently she fears that her tales are starting to sound the same, and have not been lifting the spirits of her troubled friend as once they did. She furnishes you with a journal that she has dubbed Wondrous Tails, and entreats you to fill its pages with accounts of your own adventures, that she might draw inspiration from them to fashion new narratives of her own."],"objectives":["Speak with Khloe Aliapoh."],"dialogue":[{"name":"ADVENTURER02392","text":"<span class=\"highlight\">Surname</span>...? <span class=\"emphasis\"><span class=\"highlight\">Forename</span></span> <span class=\"highlight\">Surname</span>!? Gods, it really is you! I've heard the songs and tales, but to think the day would come that I'd meet you in the flesh! Whatever have I done to deserve such an honor!? (Drat, of all the days to forget to polish my armor! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> must think I'm a total bumpkin!)"},{"name":"ADVENTURER02392","text":"(B-But wait! Dare I ask? N-No, I daren't! To impose on such a hero─oh, but what is the harm in trying? Yes, I must try!) You see, I'm in a bit of a bind. A pickle, if you will. You see, I've just taken on a task of sorts─a task far, far beyond the abilities of a two-gil greenhorn like myself."},{"name":"ADVENTURER02392","text":"But <span class=\"emphasis\">you</span>! Yes, a realm-renowned hero like you could tackle this monumental task in your sleep, blindfolded and with both arms and a leg tied behind your back! So you'll do it for me, yes? Wonderful! Just head over to Rowena's and tell Khloey-poey you're there to help."},{"name":"ADVENTURER02392","text":"D-Did I say “Khloey-poey?” Er, I meant Khloe <span class=\"emphasis\">Aliapoh</span>. That isn't my silly little nickname for her, and I <span class=\"emphasis\">certainly</span> haven't been frequenting her shop every day for the past two moons, that her ever-so-cute little smile might brighten my dark and dreary days─uh, but I've blabbered on enough, haven't I? Ta-ta!"},{"name":"KHLOEALIAPOF","text":"Hey there, <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">mister</span></span>! I'm Khloe. Khloe Aliapoh! And who might you be?"},{"name":"KHLOEALIAPOF","text":"<span class=\"highlight\">Forename Surname</span>...? <span class=\"emphasis\">The</span> <span class=\"highlight\">Forename Surname</span>? From all the stories? Wow, you're like a legend! A real, living and breathing legend! This is so exciting...!"},{"name":"KHLOEALIAPOF","text":"Did I tell you I love stories? Well, I do! And not just listening to them─I'm pretty good at telling them, too! I have this friend whose mommy and daddy went away and never came back, and well, she gets lonely and cries sometimes. So I tell her stories to cheer her up!"},{"name":"KHLOEALIAPOF","text":"That's right─stories of brave adventurers like you! She likes my stories. She stops crying, and even starts smiling and laughing! Seeing her happy makes me happy too. But lately, she's just been staring off into space again. It must be my fault. I bet all my stories are starting to sound the same..."},{"name":"KHLOEALIAPOF","text":"But then I had an idea! Do you know what it is? I'll ask great adventurers like you to tell me <span class=\"emphasis\">your</span> stories, and then I'll put them together to make new stories of my own! It's a really great idea, right? Tell me you think so, too!"},{"name":"KHLOEALIAPOF","text":"So will you help me? Rowena gives me all sorts of things when I work hard, so if you do this for me, I can give some of them to you! What sort of things? Well, <span class=\"emphasis\">tone stones</span> for one! And, well, all kinds of other special stuff! But not my mandragora pin─that's all mine!"},{"name":"KHLOEALIAPOF","text":"So, do me a favor. Remember all your bestest stories, and write them in this notebook here. I call it <span class=\"emphasis\">Khloe's Wondrous Tails</span>. Because I have a tail, and I tell tales─get it?"},{"name":"KHLOEALIAPOF","text":"Every time your stories help me come up with a new tale of my own, I'll give you a present. It'll be a lot of fun for both of us, don't you think? Thanks, <span class=\"highlight\">Forename</span>! And by the way, you're even <span class=\"alternative-container\"><span class=\"alternative\">cuter</span><span class=\"alternative\">more handsome</span></span> than I pictured you from the stories. Tee hee!"},{"name":"SYSTEM","text":"Welcome to Wondrous Tails! Henceforth, you can share your tales of heroism and derring-do for the chance to earn valuable rewards. To begin, you'll want to obtain a Wondrous Tails journal from Khloe Aliapoh. (In addition to the one you've just received, a new journal will be made available every week.)"},{"name":"SYSTEM","text":"Within the journal is a card with sixteen squares─four columns and four rows─each representing a certain quest or duty, or a category of the same. Triumph in the corresponding adventure, and the square will be marked off. You can mark off up to nine squares on a single card."},{"name":"SYSTEM","text":"Complete the conditions described within─for example, marking off nine squares, marking off four squares in a row, and so forth─and deliver your marked journal to Khloe Aliapoh, and the story-loving Miqo'te child will reward you accordingly."},{"name":"SYSTEM","text":"To view objectives and see which squares you've marked off, as well as review reward conditions and time limits, you need only use the journal from the Key Items menu. "},{"name":"SYSTEM","text":"A new journal will be available from Khloe Aliapoh every week on [Reset]<span class=\"alternative-container\"><span class=\"alternative\">Sunday</span><span class=\"alternative\">Monday</span><span class=\"alternative\">Tuesday</span><span class=\"alternative\">Wednesday</span><span class=\"alternative\">Thursday</span><span class=\"alternative\">Friday</span><span class=\"alternative\">Saturday</span></span> at <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">1</span><span class=\"alternative\">2</span><span class=\"alternative\">3</span><span class=\"alternative\">4</span><span class=\"alternative\">5</span><span class=\"alternative\">6</span><span class=\"alternative\">7</span><span class=\"alternative\">8</span><span class=\"alternative\">9</span><span class=\"alternative\">10</span><span class=\"alternative\">11</span><span class=\"alternative\">12</span></span></span><span class=\"alternative\">12</span></span>:00 <span class=\"alternative-container\"><span class=\"alternative\">a.m.</span><span class=\"alternative\">p.m.</span></span> (Earth time). Happy adventuring!"}],"reward":{"gil":103,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}]},"next":[69501]},"partials":[{"type":"npc","id":"1018317","obj":{"i":1018317,"n":"Unctuous Adventurer","l":2082,"q":1}},{"type":"npc","id":"1017653","obj":{"i":1017653,"n":"Khloe Aliapoh","l":2082,"s":3,"q":1,"r":1,"a":2093,"c":[5.77,6.1]}},{"type":"quest","id":"69501","obj":{"i":69501,"n":"Fantastic Mr. Faux","g":101,"l":"Idyllshire","s":6300,"f":1}}]}