{"quest":{"name":"What Lies Beneath","location":"South Shroud","id":67923,"patch":3.45,"sort":510,"unlocksFunction":1,"eventIcon":71341,"issuer":1017323,"target":1017323,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"WOODWAILERCAPTAIN01556","text":"Well met, adventurer. Thanks to your diligence, we have expanded the scope of our reconnaissance missions in the ruins. Unfortunately, we have yet to find any clues as to who, or what, is the source of our problems."},{"name":"WOODWAILERCAPTAIN01556","text":"You claimed the undead spoke of a robed figure, correct? Perhaps this is the foul sorcerer who gave birth to the palace and its inhabitants."},{"name":"WOODWAILERCAPTAIN01556","text":"To not only create such a labyrinth, but to fill it with the souls of so many innocents... We are dealing with a foe possessed of dark and terrible power."},{"name":"WOODWAILERCAPTAIN01556","text":"It pains me to burden you, but on behalf of the Wood Wailers I would ask that you seek out and put an end to the one behind all this. I can think of none more capable for the task at hand."},{"name":"WOODWAILERCAPTAIN01556","text":"My men have not the strength to stand with you in the ruins, but rest assured we shall do all we can to support you here at Quarrymill. Now go─drive out the evil of the Palace of the Dead, before the deceased should find their way out into the Twelveswood."},{"name":"SYSTEM","text":"You can now explore beyond floor 50 of the Palace of the Dead."},{"name":"WOODWAILERCAPTAIN01556","text":"You have done well to complete such a thorough survey of the ruins, but the road ahead is ever more treacherous. Before you proceed, I would know for certain you are duly prepared for the challenges ahead."},{"name":"SYSTEM","text":"In order to proceed with this quest, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must be at least level 17 with a Disciple of War or Magic."}],"reqs":{"jobs":[{"lvl":17,"id":142}],"quests":[67092]}},"partials":[{"type":"npc","id":"1017323","obj":{"i":1017323,"n":"Wood Wailer Expeditionary Captain","l":56,"q":2}},{"type":"quest","id":"67092","obj":{"i":67092,"n":"The House That Death Built","g":86,"l":"Gridania","s":171,"f":1}}]}