{"quest":{"name":"Squadron and Commander (Immortal Flames)","location":"Ul'dah - Steps of Nald","id":67927,"patch":3.4,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1002391,"target":1002391,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"FLAMEPERSONNEL","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! I'm certain that your duties with the Maelstromthe Order of the Twin Adderthe Immortal Flames demand much of your time already, but if I might have a word?"},{"name":"FLAMEPERSONNEL","text":"I'll get right to the point, [GC Rank][GC Rank][GC Rank]. The higher-ups have authorized plans to form a specialized squad and we're on the lookout for a reliable leader. Your name was at the top of the list."},{"name":"FLAMEPERSONNEL","text":"You would be responsible for training and commanding a number of adventurer subordinates, and the position also comes with the possibility of further promotion. What say you, [GC Rank][GC Rank][GC Rank]? Are you ready to lead?"},{"name":"FLAMEPERSONNEL","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"Q1","text":"Become a squadron commander?"},{"name":"A1","text":"Yes"},{"name":"A1","text":"No"},{"name":"FLAMEPERSONNEL","text":"Ah. Well, that's not the response I was hoping for, but it's best we're all honest here. A hesitant commander is a danger to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own troops."},{"name":"FLAMEPERSONNEL","text":"Outstanding! Let's get you acquainted with your second-in-command right away."},{"name":"PLATOONINSTRUCTOR","text":"It's an honor to be serving with you, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! In my capacity as your aide, I'll be filling the role of squadron sergeant."},{"name":"PLATOONINSTRUCTOR","text":"And these eager troopers are the inaugural members of our squadron. Form up!"},{"name":"PLATOONINSTRUCTOR","text":"Every one of them is a fledgling adventurer who enlisted in the hopes of following in your legendary footsteps. They're green to the military, aye, but we'll harden them up soon enough."},{"name":"PLATOONINSTRUCTOR","text":"When you've a moment to spare, stop by the barracks and we can discuss their training and deployment in greater detail."},{"name":"PLATOONINSTRUCTOR","text":"I'll leave you to it, then, Commander."},{"name":"FLAMEPERSONNEL","text":"What do you think? I'll admit they're raw as soldiers go, but they certainly have potential. I look forward to seeing what you can do with them."},{"name":"FLAMEPERSONNEL","text":"Right, I won't keep you any longer. Your squad's barracks can be found through the door at the back of the command roomAdders' NestHall of Flames."},{"name":"FLAMEPERSONNEL","text":"May the Navigator guide you to victorythe Matron watch over youNald'thal bless you with fortune!"},{"name":"SYSTEM","text":"You are now the commander of an adventurer squadron!<br>Enter the MaelstromTwin AdderFlame Barracks and speak with your squadron sergeant to issue deployment orders."}],"reqs":{"jobs":[{"lvl":47,"id":34}],"gc":3,"gcrank":9,"quests":[66967]}},"partials":[{"type":"npc","id":"1002391","obj":{"i":1002391,"n":"Flame Personnel Officer","l":40,"q":3}},{"type":"quest","id":"66967","obj":{"i":66967,"n":"Rising to the Challenge","g":91,"l":"Limsa Lominsa","s":150,"f":1}}]}