{"quest":{"name":"Birdwatching Gone Wrong","location":"Ul'dah","id":67935,"patch":3.5,"sort":127,"icon":100619,"eventIcon":71221,"issuer":1018403,"target":1018621,"genre":198,"journal":["A reporter from the <span class=\"emphasis\">Mythril Eye</span> is eager to speak with you.<br>※This quest is available for a limited time only.","A reporter from the <span class=\"emphasis\">Mythril Eye</span> stops you by saying he would like to ask you a few questions for an article he will be running on Little Ladies' Day. He begins by inquiring if you have ever heard of the trio of preteen troubadours, the Songbirds, who are scheduled to perform at the festival. As he continues to question you, however, it soon becomes evident that the <span class=\"emphasis\">Mythril Eye</span> representative's intentions are not quite what he claims them to be. Telling you an ardent group of the Songbirds' fans─the Birdwatchers─have been stirring up some trouble, he then attempts to recruit you on behalf of the royal seneschal who seems to have found himself on the receiving end of their mischief. While unable to tell you much more, the reporter then points you in the direction of Emerald Avenue where the Birdwatchers are gathered.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You approach the royal seneschal, who is being bombarded with bitter words and complaints, as devoted admirers of the Songbirds demand to know where the girls are. He is quick to pick you out from the rest of the angry mob and motions in your direction. Immensely relieved that backup has arrived, he asks that you meet him at the Wellhead Lift so that you might exchange a few words in private.","You meet with the royal seneschal near the Wellhead Lift. He tells you that what he is about to reveal is meant for your ears alone and would first have you swear to absolute secrecy before he says any more. Giving you a moment to think over whether you would wish to proceed or not, he asks that you inform him after you have made your decision."],"objectives":["Speak with the royal seneschal."],"dialogue":[{"name":"REPORTER02399","text":"Pardon me, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I'm a reporter with the <span class=\"emphasis\">Mythril Eye</span> covering this year's Little Ladies' Day. Might I trouble you with a few questions?"},{"name":"REPORTER02399","text":"Excellent! Now, lest the throngs of excited folk haven't already given it away, three special little ladies are due to grace the stage shortly."},{"name":"REPORTER02399","text":"I speak, of course, of the Songbirds─the talented trio of preteen troubadours that took Ul'dah by storm last year."},{"name":"REPORTER02399","text":"Ever since their debut, their popularity has skyrocketed and shows no sign of slowing. Which brings me to my first question: you know them, of course?"},{"name":"Q1","text":"Do you know of the Songbirds?"},{"name":"A1","text":"Of course I do!"},{"name":"A1","text":"Never heard of them."},{"name":"REPORTER02399","text":"Indeed, it'd be a wonder if you didn't. Now, as I mentioned, the three are scheduled to perform soon...though not soon enough for their legion of devoted fans─the Birdwatchers."},{"name":"REPORTER02399","text":"Truly? The names Ulala, Masha, and Narumi do not ring a bell?"},{"name":"REPORTER02399","text":"Ah, well, I suppose there's bound to be the odd person. At any rate, as I mentioned, the three are scheduled to perform soon...though not soon enough for their legion of devoted fans─the Birdwatchers."},{"name":"REPORTER02399","text":"Which brings me to my next question. I'm informed that the royal seneschal, the man in charge of Little Ladies' Day, is experiencing difficulties and has urgent need of help from a capable─and discreet─adventurer."},{"name":"REPORTER02399","text":"While I know not the exact nature of the request, I daresay it pertains to the waiting fans, who grow louder and ruder by the minute. What say you? Would you be willing to aid the poor man?"},{"name":"REPORTER02399","text":"The lack of details gives you pause, and I don't blame you. At the very least, though, I thought you might overlook it for the chance to get close to our starlets."},{"name":"REPORTER02399","text":"Well, it's your decision. But should you be inclined to lend a hand, the royal seneschal can be found by the stage on Emerald Avenue."},{"name":"REPORTER02399","text":"Just don't be too long in the deciding, however. I fear he won't hold up for much longer."},{"name":"REPORTER02399","text":"Oh, and one last thing─do be careful when passing through Emerald Avenue. If you aren't, you may find yourself swept into a tide of hysterical fans with no way out, just as the royal seneschal was!"},{"name":"GIRLA02399","text":"This is an outrage! We've been waiting for <span class=\"emphasis\">hours</span>!"},{"name":"GIRLB02399","text":"We want Songbirds! We want Songbirds!"},{"name":"BUTLER","text":"L-Ladies and gentlemen, p-please settle down! The Songbirds are currently preparing and will make their appearance shortly. We ask that you wait just a little longer!"},{"name":"BUTLER","text":"<span class=\"highlight\">Forename</span>, is that you!? Haha! My dear <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, you couldn't have come at a better time! As you can see, I am in desperate need of your help!"},{"name":"BUTLER","text":"Y-You there! Y-Yes, <span class=\"emphasis\">you</span>, my good adventurer! Are you the one who was sent to help me? You couldn't have come at a better time!"},{"name":"BUTLER","text":"Please, come with me to the Wellhead Lift. I would speak of my plight in a private setting."},{"name":"BUTLER","text":"Thank the gods you came when you did! The Birdwatchers have been like that ever since we began stringing up decorations for Little Ladies' Day throughout the city."},{"name":"BUTLER","text":"&lt;sigh&gt; If only I could say that was the worst of our problems... You see, while my staff and I labor to quell the unruly fans, we need someone to take on an even more urgent task─someone who is familiar with the city–states and can travel swiftly between them."},{"name":"BUTLER","text":"Before I go on, however, I must ask that you keep our conversation in the utmost confidence. If the Birdwatchers were to learn of this, their angry words and raised fists would become pitchforks and torches!"},{"name":"BUTLER","text":"It is a lot to take in, I understand, but pray do not take too long to consider. I can already hear the angry shouts growing louder!"}],"reward":{"gil":210,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[67936]},"partials":[{"type":"npc","id":"1018403","obj":{"i":1018403,"n":"Mythril Eye Reporter","l":40,"q":1}},{"type":"npc","id":"1018621","obj":{"i":1018621,"n":"Royal Seneschal","l":40,"q":6}},{"type":"quest","id":"67936","obj":{"i":67936,"n":"The Disappearing Act","g":198,"l":"Ul'dah","s":128}}]}