{"quest":{"name":"The Disappearing Act","location":"Ul'dah","id":67936,"patch":3.5,"sort":128,"icon":100620,"eventIcon":71221,"issuer":1018621,"target":1018621,"involved":[1003818,1018629],"genre":198,"journal":["The royal seneschal's wan face peers earnestly back at you.<br>※This quest is available for a limited time only.","After you agree to keep all that he tells you a closely guarded secret, the royal seneschal reveals to you that the three Songbirds have gone missing. He tells you that upon giving them permission to select the fabrics and dyes they wanted to use for their own costumes, they disappeared, and no one has been able to find them since. While he and his staff continue to contend with the impatient fans, he asks that you use your knowledge of Eorzea to find all three of the girls and see that they return to Ul'dah in time for their show.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","After a bit of searching, you manage to find all three of the girls, each of whom were so wrapped up in their preparations for the performance that they had completely lost track of time. Thanking you for coming to notify them of both the current situation and the hour, they hasten back to Ul'dah. Your mission now complete, return to the Ruby Road Exchange and inform the royal seneschal of the good news.","The sight of you and all three of the Songbirds standing before him seems to have alleviated the worst of the royal seneschal's fears, but he is far from ready to relax. While he returns to assist the rest of his staff in dealing with the tumultuous crowd, he asks that you escort the three girls to the Weavers' Guild and ask Redolent Rose to make the Songbirds' costumes.","While initially it seems as though he has every intention to turn you away, it soon becomes clear that Redolent Rose is just teasing you and the girls. Telling you he is a steadfast fan of the Songbirds, he says he would be more than happy to oblige your request. With little time left until the concert begins, he sets straight to work to create three glamorous outfits for the Little Ladies' Day stars. Considering all the pressure he has been under of late, the royal seneschal could surely do with some more good news. Seek him out on the Ruby Road Exchange and let him know the three Songbirds will be receiving their dresses promptly.","The royal seneschal is delighted that the Little Ladies' Day concert is now back on track. There is one last thing, however, that needs be addressed. That is, he must decide who is to dance center stage but is unsure which of the girls would be best suited to take on this role. Having spent time enough with all three to grasp their strengths and weaknesses, he believes that you will be able to select the girl perfect for the role."],"objectives":["Search for Ulala in Limsa Lominsa.","Search for Narumi in Horizon.","Search for Masha in Gridania.","Speak with the royal seneschal in Ul'dah.","Speak with Redolent Rose at the Weavers' Guild.","Speak with the royal seneschal at the Ruby Road Exchange."],"dialogue":[{"name":"BUTLER","text":"Y-You'll consent? Oh, thank you! Thank you so very much! &lt;sigh&gt; ...Now where am I to begin?"},{"name":"BUTLER","text":"You see, the girls... We can't find them. Not only that, their costumes are yet to be made or properly fitted...and the hour of the concert is nearly upon us!"},{"name":"BUTLER","text":"Gah! What a fool I was! When they had asked me to allow them to pick out the fabrics and dyes for their dresses, I agreed. Thought it was a brilliant idea, even!"},{"name":"BUTLER","text":"One thing then led to another, and soon just browsing through local wares wasn't enough. They wanted to see what was available elsewhere. Now they've disappeared off to gods know where, and none of my staff has been able to locate them!"},{"name":"BUTLER","text":"I should have known this would happen! No doubt the reason they don't return is because they are lost, are being accosted by frenzied fans, or something even more horrific!"},{"name":"BUTLER","text":"My dear <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>, I beg of you, please find and see that they are escorted back. This is a task I can only entrust to a capable and dependable adventurer such as yourself!"},{"name":"BUTLER","text":"Y-You'll do it? Mere words are not enough to express my gratitude!"},{"name":"BUTLER","text":"Now then, if the tidbits we've been able to gather are anything to go by, Ulala likely is in Limsa Lominsa, Narumi in Horizon, and Masha in Gridania."},{"name":"BUTLER","text":"I only hope they haven't wandered elsewhere. We simply cannot afford any more delays, or we may very well be in for a good old-fashioned lynching!"},{"name":"BUTLER","text":"Please, make haste, <span class=\"highlight\">Forename</span>─lest the situation with the Birdwatchers spirals even further out of control."},{"name":"PIRATE02400","text":"Seven hells! Y-Yer Ulala from the Songbirds, ain't ye!? I-I can't believe me eyes! We've gotta tell the others 'bout this!"},{"name":"PIRATE02400","text":"But first─ Oh, bugger me! Wanted to ask fer yer autograph, but I haven't anythin' to write with..."},{"name":"ULALA","text":"You're fans? Of mine?"},{"name":"ULALA","text":"Pfft! O-Of course you are! Well, in that case, instead of an autograph, how about I give you something even better─a little sneak peek of our concert!"},{"name":"ULALA","text":"Tee hee hee! Would you look at that─my dulcet voice has drawn yet another devoted follower! Well, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, you're just in time for the─ ...Wait a minute. <span class=\"highlight\">Forename</span>, is that you!?"},{"name":"ULALA","text":"Tee hee hee! Would you look at that─my dulcet voice has drawn yet another devoted follower! Well, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, you're just in time for the─"},{"name":"ULALA","text":"The royal seneschal's sent you to find me, you say? I-I had no idea I was running so far behind schedule."},{"name":"ULALA","text":"But it isn't my fault─you saw for yourself, right? I'm simply far too irresistible. Fans have been accosting me all day, and it wouldn't do to ignore them."},{"name":"ULALA","text":"Right, then. My apologies to have to cut things short, but it seems I have a performance to put on, so I must be off. I hope you come and cheer for me─er, us─the Songbirds!"},{"name":"ULALA","text":"I would appreciate it if you could keep what happened here between the two of us. F-For the benefit of the team, of course! After all, if Narumi and Masha were to learn of the tremendous number of fans I have, it could very well deteriorate group morale!"},{"name":"MASHAMHAKARACCA","text":"Hmmm... Given the quantity, it would be best to move these crates by ship than by chocobo."},{"name":"MASHAMHAKARACCA","text":"Wait a second... I know you! You're <span class=\"highlight\">Forename</span>! What are you doing here?"},{"name":"MASHAMHAKARACCA","text":"Apologies, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Are you here to make a shipment?"},{"name":"MASHAMHAKARACCA","text":"The royal seneschal bids me return at once? But I haven't been here long at all. Hm, how long <span class=\"emphasis\">have</span> I been here?"},{"name":"MASHAMHAKARACCA","text":"That long!? Good gods! I-I must hurry back!"},{"name":"MASHAMHAKARACCA","text":"Oh, but what of these boxes!?"},{"name":"MASHAMHAKARACCA","text":"Gah! What am I thinking!? Now's hardly the time to be fretting over this!"},{"name":"MASHAMHAKARACCA","text":"I'm terribly sorry to have to leave you in a lurch, madam, but I really must be going! Though a daunting task, I'm sure you're more than capable of arranging for their delivery on your own!"},{"name":"MASHAMHAKARACCA","text":"Now that that's taken care of, I shall return posthaste!"},{"name":"MERCHANT02400","text":"You've been staring at my samples for hours now but don't seem any closer to reaching a decision. Are you quite sure you don't want to take the night to think it over?"},{"name":"NARUMI","text":"Oh, I'm so very sorry, sir. It's just that they're all so beautiful. &lt;sigh&gt; Maybe I'll just take this one─ Er, actually, maybe..."},{"name":"NARUMI","text":"&lt;gasp&gt; <span class=\"highlight\">Forename</span>! What are you doing here? What a wonderful coincidence it is to see you! You're looking well."},{"name":"NARUMI","text":"Oh, am I in your way? My apologies─I'll be finished soon...I think."},{"name":"NARUMI","text":"...It's that time already!? I-I can't believe it. I spent that long trying to decide on a <span class=\"emphasis\">color</span>?"},{"name":"NARUMI","text":"And I haven't even made up my mind! &lt;sigh&gt; I find something I like, but then I'm unsure whether the other Songbirds would like it too, and I keep second-guessing myself..."},{"name":"MERCHANT02400","text":"Wait a second... <span class=\"emphasis\">The</span> Songbirds? You're one of them?"},{"name":"NARUMI","text":"Y-Yes. You know about us?"},{"name":"MERCHANT02400","text":"How could I not!? My daughter absolutely <span class=\"emphasis\">adores</span> you!"},{"name":"MERCHANT02400","text":"You're after dyes for your costume, right? A quick moment, if you would."},{"name":"MERCHANT02400","text":"What do you think of this one? &lt;wink&gt; One of my finest colors for one of my best customers."},{"name":"NARUMI","text":"It's absolutely perfect! Thank you, sir!"},{"name":"NARUMI","text":"Now that I have my dye, there's no reason to keep the others waiting! To Ul'dah!"},{"name":"PIRATE02400","text":"Ain't no mistakin' the radiant smile an' pink locks! That's Ulala from the Songbirds!"},{"name":"BUTLER","text":"Thanks to you the girls have made it back in time and we've managed to avert what could easily have been a Little Ladies' Day catastrophe!"},{"name":"BUTLER","text":"Girls, come here! I think we all owe this wonderful <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> here a few words of thanks."},{"name":"BUTLER","text":"You remember <span class=\"highlight\">Forename</span> from last year, of course?"},{"name":"ULALA","text":"As if I could forget! Though if I had, the start you gave me earlier would've been enough to jog my memory! N-Not that I'm complaining, of course! Thank you for coming to get us. We'll repay your kindness with a performance so dazzling, it'll leave you breathless!"},{"name":"NARUMI","text":"Yes, indeed. It's the least we can do for all your help. While we're still works in progress, we're far from the fledglings that took to the stage last year, and we shall do our best to entertain you."},{"name":"MASHAMHAKARACCA","text":"I've been practicing nigh every waking moment, working hard on both song and dance. I hope you'll be able to appreciate the improvement."},{"name":"BUTLER","text":"Oh, and while you are expressing your gratitude, why not introduce yourselves as well?"},{"name":"ULALA","text":"It's great seeing you again, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I'm Ulala, unofficial leader of the Songbirds and soon to be Eorzea's premier songstress. And you─you are soon to be my biggest fan! Tee hee!"},{"name":"NARUMI","text":"It's good to properly meet you, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. I'm Narumi. Thank you for all your help earlier. Had you not come to find us, the concert we have practiced day and night for would have all been for naught. Truly, we would be honored if you would attend our performance."},{"name":"MASHAMHAKARACCA","text":"And I'm Masha Mhakaracca, but you can call me Masha. While I may not have Ulala's silver tongue or Narumi's sweet voice, I more than make up for it with my dancing. Please, come and cheer us on!"},{"name":"BUTLER","text":"Right! Now that we're all assembled, let us set to work. There's still much to do if we are to deliver the promised concert."},{"name":"BUTLER","text":"First things first: costumes. The girls were meant to see Redolent Rose about them a good while ago. I'm not certain he'd be able─or even willing─to prepare them in such little time, but we must try to prevail upon him."},{"name":"BUTLER","text":"Considering what happened when I let these three out of my sight, I would feel much more comfortable if you could accompany them to the Weavers' Guild, and see that they return afterwards."},{"name":"BUTLER","text":"Thank you, <span class=\"highlight\">Forename</span>. I've already sent the fabrics and dyes the girls picked out to Redolent Rose, so he should know to expect you."},{"name":"BUTLER","text":"I suspect one look at the girls will be all Redolent Rose needs to know why you're there, but if he asks, simply tell him that I sent you."},{"name":"ULALA","text":"On behalf of the Songbirds, I would like to apologize for our tardiness. Please, Mister Redolent Rose, sir, would you still make our costumes for us?"},{"name":"NARUMI","text":"I'm solely to blame for our delay. You needn't make mine if there isn't time, but I beg you not to punish the others for my mistake."},{"name":"MASHAMHAKARACCA","text":"No one else but you has the skill to make the costumes! If not for us, won't you please do it for the people?"},{"name":"REDOLENTROSE","text":"First, you miss your appointment. Then, you slink in here last minute, asking that I do the job with barely any time at all?"},{"name":"REDOLENTROSE","text":"Well, you three best thank your lucky stars that I'm a fan of the Songbirds!"},{"name":"REDOLENTROSE","text":"I've been following your ensemble very closely, and have studied up on the themes and motifs you employ. I believe I have a suitable design."},{"name":"REDOLENTROSE","text":"I've already received your preferred dyes and fabrics, so I shall set to work at once. Once your costumes are ready, I'll send for you for a fitting."},{"name":"MASHAMHAKARACCA","text":"Thank you so very much, sir!"},{"name":"NARUMI","text":"To think that a celebrity weaver like Redolent Rose knew about us!"},{"name":"ULALA","text":"And if he wasn't a fan before, he certainly is now─now that he's met me, that is! Tee hee!"},{"name":"REDOLENTROSE","text":"Hahaha! Now, then, I'm sure I'm not the only one who has some last-minute preparations to attend to before the concert begins. I suggest we all set to work."},{"name":"MASHAMHAKARACCA","text":"Well, girls─you heard the man! Let's squeeze in one last practice of our routine to make sure we don't make any silly mistakes!"},{"name":"ULALA","text":"I've already perfected all the steps and can hit every note, so <span class=\"emphasis\">I</span> don't need the practice. But I suppose it wouldn't hurt to help the two of you rehearse."},{"name":"NARUMI","text":"Th-Thank you, Mister Redolent Rose, sir. We can't wait to see you later at the performance!"},{"name":"ULALA","text":"Sir, we have nowhere else to go! Will you make our costumes for us? Pretty, pretty please with rolanberries on top!"},{"name":"NARUMI","text":"If only I wasn't so indecisive, this never would have happened! Oh, why did I have to spend all that time on picking out a color..."},{"name":"MASHAMHAKARACCA","text":"If you're not willing to do it for us, please sir, think of the fans and citizens of Ul'dah! They're looking forward to seeing our dresses as much as we are to wearing them!"},{"name":"REDOLENTROSE","text":"Not to worry, adventurer. I shall send the costumes over, soon as they are ready."},{"name":"BUTLER","text":"The girls tell me Redolent Rose agreed to make their costumes! Haha! What wonderful news!"},{"name":"BUTLER","text":"Thanks to you, our biggest problems have been resolved, and we are finally on track to hold the concert. There is just one last thing to be done."},{"name":"BUTLER","text":"That is, <span class=\"highlight\">Forename</span>, we must choose who shall take center stage at the opening show and thereby lead the Songbirds to greater heights!"},{"name":"BUTLER","text":"My staff and I have spent so much time with the girls, our judgment has become clouded. You, on the other hand, know the Songbirds just well enough to assess their strengths and weaknesses."},{"name":"BUTLER","text":"And with your eye for talent, you would no doubt know which of the girls the audience desires most to see take to the forefronts of the stage!"},{"name":"BUTLER","text":"Now, the three are already aware that I mean to entrust the decision to you, and they nervously await your answer. Once your mind is made, pray inform the chosen directly."},{"name":"ULALA","text":"Tee hee! I simply can't wait to see how amazing I'll look in my new dress!"},{"name":"NARUMI","text":"Thank the gods that Redolent Rose was also a fan of our ensemble, else we might never have gotten our dresses!"},{"name":"MASHAMHAKARACCA","text":"Only our very best performance will do if we are to make up for the trouble we've caused, and we <span class=\"emphasis\">will</span> deliver it!"}],"reward":{"gil":857,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67935]},"next":[67937,67942,67943]},"partials":[{"type":"npc","id":"1018621","obj":{"i":1018621,"n":"Royal Seneschal","l":40,"q":6}},{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1018629","obj":{"i":1018629,"n":"Narumi","l":42,"q":1}},{"type":"quest","id":"67935","obj":{"i":67935,"n":"Birdwatching Gone Wrong","g":198,"l":"Ul'dah","s":127}},{"type":"quest","id":"67937","obj":{"i":67937,"n":"Ulala's Grand Performance","g":198,"l":"Ul'dah","s":129}},{"type":"quest","id":"67942","obj":{"i":67942,"n":"Masha's Grand Performance","g":198,"l":"Ul'dah","s":130}},{"type":"quest","id":"67943","obj":{"i":67943,"n":"Narumi's Grand Performance","g":198,"l":"Ul'dah","s":131}}]}