{"quest":{"name":"A Demonic Duplicate","location":"The Rising Stones","id":67931,"patch":3.5,"sort":16105,"icon":112213,"unlocksFunction":1,"eventIcon":71341,"issuer":1014565,"target":1016633,"genre":17,"journal":["Unukalhai has something of interest for you.","Unukalhai presents you with an Allagan tomestone that contains detailed information on generating an enhanced simulacrum of the eikon Zurvan. He explains that only the most exceptional of Allag's warriors were expected to triumph against this artificial entity, and suggests that, as the Warrior of Light, you might benefit from the experience. Take the tomestone to the Flagship, and present the recording device to the verification node.","Upon receiving the tomestone, the verification node initiates what it refers to as an “elimination trial,” presumably intended to further cull the unworthy from the Allagan warrior elite. Assemble a band of courageous companions, and face the Demon in all of his unrestrained might!<br><br>※Containment Bay Z1T9 (Extreme) can be accessed via the Duty Finder."],"objectives":["Present the Allagan tomestone of eikonology to the verification node on the Flagship."],"dialogue":[{"name":"UNUKALHAI","text":"Whilst we were examining the controls for Zurvan's shackles, I found a tomestone that may be of interest to you, <span class=\"highlight\">Forename</span>. Would you like to take a look?"},{"name":"UNUKALHAI","text":"The information contained within this device appears to have been used to generate a simulated battle of grueling difficulty. "},{"name":"UNUKALHAI","text":"Challengers would be pit against a simulacrum of Zurvan, the power of which had been enhanced to the eikon's highest conceivable magnitude. It is described as the final trial for the most elite of Allag's warriors, intended to distinguish the truly exceptional among them."},{"name":"UNUKALHAI","text":"I have witnessed no champion more exceptional than the Warrior of Light. Are you not curious to see just how powerful Zurvan may have been? I urge you to visit the verification node, and undertake this ultimate test of the Allagan elite."},{"name":"UNUKALHAI","text":"If you would test your mettle against the Demon's unfettered might, then you need only present the tomestone to the verification node on the Azys Lla flagship."},{"name":"VERIFICATIONSYSTEM","text":"&lt;blip&gt; Activating verification systems... Elimination trial request acknowledged. Awaiting tomestone data..."},{"name":"VERIFICATIONSYSTEM","text":"&lt;blip&gt; Data processed. Adversary: Warring Triad, Zurvan. Threat level: Extreme."},{"name":"VERIFICATIONSYSTEM","text":"This is the final qualifying test for surviving elite squad enlistees. Participation is only permitted to candidates who agree to unrestricted biopsy procedures following the trial."},{"name":"VERIFICATIONSYSTEM","text":"Specifically, enlistees who successfully complete the program will be certified as genetically superior, and must submit to cell harvesting for subsequent cloning initiatives."},{"name":"VERIFICATIONSYSTEM","text":"Elimination trial survival rates are currently calculated at 1.9 percent."},{"name":"VERIFICATIONSYSTEM","text":"&lt;blip&gt; Activating reality augmentation... Initiating elimination trial... The Empire thanks you for your service. Postmortem data will be used to improve the survival rates of subsequent candidates. Your sacrifice is appreciated."}],"reward":{"gil":934,"instance":20044,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67930]}},"partials":[{"type":"npc","id":"1014565","obj":{"i":1014565,"n":"Unukalhai","l":481,"q":9}},{"type":"npc","id":"1016633","obj":{"i":1016633,"n":"Verification Node","l":2101,"q":5}},{"type":"instance","id":"20044","obj":{"i":20044,"n":"Containment Bay Z1T9 (Extreme)","c":61804,"t":"Trials","min_lvl":60,"max_lvl":60,"min_ilvl":250}},{"type":"quest","id":"67930","obj":{"i":67930,"n":"The Last Pillar to Fall","g":17,"l":"The Rising Stones","s":16005,"f":1}}]}