{"quest":{"name":"Body and Soul","location":"Azys Lla","id":67934,"patch":3.5,"sort":13,"icon":100607,"unlocksFunction":1,"eventIcon":71341,"issuer":1019638,"target":1016135,"involved":[1013713],"genre":74,"journal":["The inoperative automaton sits quietly, waiting to be given a purpose.","Ardashir is ready to present the results of his research to Rowena. Perhaps due to the strange weather in Azys Lla, however, he is unable to contact her using his linkpearl. He bids you travel to Idyllshire and request she come to Azys Lla while he makes final preparations for the anima's unveiling.","Rowena is pleased to hear work on the anima weapon is finally complete. Unfortunately, she has unfinished business keeping her in Idyllshire. She asks that you return to Azys Lla ahead of her.","There is still time before Rowena arrives, and Ardashir seizes the opportunity to present you with a gift. You use the strange device he gives you to summon the anima, and are astonished to see it has taken on a new physical form. Ardashir explains this is made possible using the anima's original soulstone. Rowena arrives soon after to behold the fruits of your hard work. She is pleased with what Ardashir has accomplished, and looks forward to seeing more. When he mentions his plans to seek out a new blacksmith to aid him, all eyes are on Gerolt, who makes clear his intentions to leave now that he is debt free. His liberation is short-lived, however, when Rowena reminds him of the vast sums of gil he has spent since they began work on the anima. Firmly back under Rowena's thumb, he implores Ardashir to accept his help. Meanwhile, the anima suggests you leave to seek out new adventures."],"objectives":["Speak with Rowena in Idyllshire.","With <span class=\"alternative-container\"><span class=\"alternative\">Aettir and Priwen</span><span class=\"alternative\">Nyepels</span><span class=\"alternative\">Minos</span><span class=\"alternative\">Areadbhar</span><span class=\"alternative\">Terpander</span><span class=\"alternative\">Sindri</span><span class=\"alternative\">Kaladanda</span><span class=\"alternative\">Mimesis</span><span class=\"alternative\">Anabasis</span><span class=\"alternative\">Sandungs</span><span class=\"alternative\">Deathlocke</span><span class=\"alternative\">Cronus</span><span class=\"alternative\">Canopus</span></span> equipped or in your inventory, speak with Ardashir in Azys Lla."],"dialogue":[{"name":"SYSTEM","text":"In order to receive the quest “Body and Soul,” please ensure that [Error] and [Error] are either equipped, in your Armoury Chest, or in your inventory."},{"name":"SYSTEM","text":"In order to receive the quest “Body and Soul,” please ensure that [Error] is either equipped, in your Armoury Chest, or in your inventory."},{"name":"ARDASHIR","text":"So good of you to come, <span class=\"highlight\">Forename</span>. Did you rest well?"},{"name":"ARDASHIR","text":"Curious, are we? I am afraid you will have to wait a while longer. It is nearly ready, save for a few final adjustments."},{"name":"ARDASHIR","text":"While I am finishing with this, I would ask you a favor."},{"name":"ARDASHIR","text":"As you might remember, I wished to discuss something with you. Now that our work on the anima is complete, I would have Mistress Rowena come and see the fruits of our labor. But try as I might, there is naught but static when I call via linkpearl."},{"name":"ARDASHIR","text":"Would you go and ask her to come here to Azys Lla?"},{"name":"ARDASHIR","text":"I should be finished by the time you return. She is sure to be pleased with what I have to show her, as will you."},{"name":"SYSTEM","text":"There's no response. You should wait until Ardashir has finished his work."},{"name":"ROWENA","text":"Well, if it ain't my favorite customer and business partner. Any new developments with the anima weapon?"},{"name":"ROWENA","text":"Finished, you say? That's the best news I've had all day. Would that I could leave now to see it, but it'd be bad for business to leave clients waitin'. You tell Ardashir he can expect a visit from me as soon as I'm done here."},{"name":"ARDASHIR","text":"Welcome back, <span class=\"highlight\">Forename</span>. ...Erm, If I may ask, why did you not bring the anima weapon? There can be no unveiling of the anima to Mistress Rowena without it."},{"name":"ARDASHIR","text":"Please go and retrieve both the anima weapon and shield at once. Quickly, before she arrives."},{"name":"ARDASHIR","text":"Please go and retrieve the anima weapon at once. Quickly, before she arrives."},{"name":"SYSTEM","text":"In order to advance in the quest “Body and Soul,” please ensure that [Error] and [Error] are either equipped, in your Armoury Chest, or in your inventory."},{"name":"SYSTEM","text":"In order to advance the quest “Body and Soul,” please ensure that [Error] is either equipped, in your Armoury Chest, or in your inventory."},{"name":"SYSTEM","text":"In the event you discarded your anima weapon, you will be required to abandon the quest “Body and Soul” and create a new one."},{"name":"SYSTEM","text":"In the event you discarded your anima weapon and shield, you will be required to abandon the quest “Body and Soul” and create new ones."},{"name":"ARDASHIR","text":"While we wait for Mistress Rowena to arrive, there is something I wish to give you."},{"name":"ARDASHIR","text":"It is a device to be used when summoning the anima. Care to give it a try?"},{"name":"BUKINOSEIREI","text":"Did you call, <span class=\"highlight\">Forename</span>? ...Oh my! My body is... Wh-What happened!?"},{"name":"BUKINOSEIREI","text":"Did you need something, <span class=\"highlight\">Forename</span>? ...Huh!? Wh-What happened to my body?"},{"name":"ARDASHIR","text":"Despite all we have accomplished here, one thing still concerned me─the fact that your spirit is bound to the anima weapon, which is why you can only be summoned in its presence. What will happen, then, should <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> need your aid but not possess the weapon housing your spirit?"},{"name":"ARDASHIR","text":"It is why I created that new body. It is linked to you through your original soulstone, which still bears your aetherial signature. So long as <span class=\"highlight\">Forename</span> keeps that device with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, your spirit can be channeled into this new, physical form."},{"name":"ARDASHIR","text":"Consider it my gift to you, that none may break the bond shared between you and <span class=\"highlight\">Forename</span>."},{"name":"BUKINOSEIREI","text":"Thank you, Ardashir. I will never leave <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> side. You have my word."},{"name":"BUKINOSEIREI","text":"Thank you, Ardashir. I will never leave <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> side. You have my word."},{"name":"ROWENA","text":"What's this, then? You celebratin' without me?"},{"name":"ROWENA","text":"<span class=\"highlight\">Forename</span>'s told me everythin'. I take it this is the anima I've heard so much about."},{"name":"BUKINOSEIREI","text":"It's a pleasure to meet you."},{"name":"BUKINOSEIREI","text":"It's very nice to meet you."},{"name":"ARDASHIR","text":"Magnificent, is it not? A life created with our own hands, forged into a weapon─the anima weapon. The perfect companion to accompany adventurers like <span class=\"highlight\">Forename</span>."},{"name":"ROWENA","text":"You've impressed me, Ardashir. With proper rearin' these anima'll make obedient helpers. "},{"name":"ROWENA","text":"(...An' me a tidy profit.)"},{"name":"ROWENA","text":"I can see my gil was well invested, an' I look forward to seein' more o' your work. Now that you've overcome the hurdle o' makin' the first, I'm sure a sharp lad like you can ready anima weapons for the masses in no time at all."},{"name":"ARDASHIR","text":"Indeed, I have learned a great many lessons in my time here, thanks in no small part to <span class=\"highlight\">Forename</span>, and even Gerolt. I daresay it will not be long before all the realm knows of the wonder that is anima."},{"name":"ARDASHIR","text":"But first I intend to return home. Fates permitting, I will find a capable smith to assist me in fashioning more anima weapons."},{"name":"GEROLT","text":"You heard the boy. If he wants to go home, let him. I got better things to do than look after that streak o' piss while he makes more toys. With me debts repaid, I'm headin' to Costa del Sol for a well-earned─"},{"name":"ROWENA","text":"Repaid? I never took you for the sort who jokes about money. You owe me plenty."},{"name":"GEROLT","text":"Now hold on, Rowena. You promised to forget me debts once we were done with the anima weapon."},{"name":"ROWENA","text":"And I'm a woman of my word. What you owed <span class=\"emphasis\">before</span> we started this little business venture's been forgiven. That just leaves the cost of comin' and goin' from Azys Lla, and a rather impressive bill for all that mead you drank."},{"name":"ROWENA","text":"I expect you to pay me back down to the last gil. O' course, I might be willin' to forgive an' forget again if you help our dear boy Ardashir."},{"name":"ROWENA","text":"Anyroad, I ought to be headin' back. Got business to tend to. Until next time, <span class=\"highlight\">Forename</span>, Ardashir."},{"name":"GEROLT","text":"Oi, Ardashir... How's about I fire up the forge for another o' those anima weapons?"},{"name":"ARDASHIR","text":"The offer is appreciated, but no thank you. As I said, what I seek is a smith committed to making weapons, not wasting his days in pursuit of drink."},{"name":"GEROLT","text":"Right then─no more drinkin' until we're done. Glad we got that settled."},{"name":"ARDASHIR","text":"We have settled nothing! Even if I were to consent, you would never hold up your end of the agreement. Even now I can smell the foul odor of ale on your breath!"},{"name":"BUKINOSEIREI","text":"Perhaps we should leave them to settle this on their own. Surely there are others who need our assistance."},{"name":"BUKINOSEIREI","text":"I think we'd do well not to interfere. Mayhap we can find others who need our assistance."}],"reward":{"gil":1559,"items":[{"id":17530}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":107}],"quests":[67932]},"next":[67939]},"partials":[{"type":"npc","id":"1019638","obj":{"i":1019638,"n":"Automaton","l":2101,"q":1}},{"type":"npc","id":"1016135","obj":{"i":1016135,"n":"Ardashir","l":2101,"q":11}},{"type":"npc","id":"1013713","obj":{"i":1013713,"n":"Rowena","l":2082,"q":4}},{"type":"item","id":"17530","obj":{"i":17530,"n":"Anima","l":1,"c":59631,"t":81}},{"type":"quest","id":"67932","obj":{"i":67932,"n":"Born Again Anima","g":74,"l":"Azys Lla","s":11,"r":1,"f":1}},{"type":"quest","id":"67939","obj":{"i":67939,"n":"Words of Wisdom","g":74,"l":"Azys Lla","s":14,"f":1}}]}