{"quest":{"name":"The Fires of Sohm Al","location":"Idyllshire","id":67938,"patch":3.5,"sort":6200,"icon":112215,"unlocksFunction":1,"eventIcon":71341,"issuer":1018427,"target":1018429,"involved":[1011935,1018428],"genre":101,"journal":["The gossamer moogle appears to be searching for someone.","You approach a moogle hovering on the outskirts of Idyllshire, and discover that you are the very person he was sent to find. According to the flighty creature, Vidofnir urgently requests your presence at the summit of Sohm Al.","Upon meeting with Vidofnir near the upper entrance to Sohm Al's caverns, you learn that the holy resting place of the dragons has been overrun by an infestation of beastly intruders. Answer Vidofnir's request to cleanse the sacred grounds, and calm the fires that rage within the mountain's heart.<br><br>※Sohm Al (Hard) can be accessed via the Duty Finder.","You have traversed the caverns within Sohm Al, and eradicated the source of the disturbance. Return to the mountain's summit, and report your success to Vidofnir.","You return to a grateful Vidofnir, who confirms that your deeds have restored Sohm Al's agitated fires to their previous state of tranquility. The white dragon would see that this place of rest remain undefiled for the sake of all dragonkind, and thanks you for ensuring the peaceful repose of her fallen kin."],"objectives":["Speak with Vidofnir near the Sohm Al summit.","Enter Sohm Al (Hard).","Return to Vidofnir at the Sohm Al summit."],"dialogue":[{"name":"WANDERINGMOOGLE","text":"Ah! You're <span class=\"highlight\">Forename</span>, aren't you!? I've found you at last, kupo!"},{"name":"WANDERINGMOOGLE","text":"Vidofnir asked me to come find you, and I've been searching high and low and near and far, kupo!"},{"name":"WANDERINGMOOGLE","text":"Do you know how difficult it is to look for someone while trying to stay unseen yourself...? Well, never mind about that now─there are more important things to worry about, kupo!"},{"name":"WANDERINGMOOGLE","text":"Vidofnir was very insistent that I hurry you back to the Sohm Al summit as soon as possible! So, uh...on your way, kupo!"},{"name":"WANDERINGMOOGLE","text":"Right, well that's my job done. I'll go on ahead and let Vidofnir know you're coming. See you there, kupo!"},{"name":"WANDERINGMOOGLE","text":"Well, it's about time! Vidofnir has been waiting for you, and it's hardly a good idea to keep a dragon waiting, kupo!"},{"name":"VIDOFNIR","text":"I thank thee for answering my summons, warrior of warriors. Hasten thee to the summit of Sohm Al, and I shall speak further of my request."},{"name":"VIDOFNIR","text":"Thou hast discharged thy duty admirably, child of Moghome."},{"name":"VIDOFNIR","text":"And greetings to thee, warrior of warriors. Thou dost have my gratitude for thy hasty arrival."},{"name":"VIDOFNIR","text":"I have bid thee hence to Sohm Al to aid in the quieting of these sacred grounds."},{"name":"VIDOFNIR","text":"When Nidhogg did meet his end, his minions quit the slopes of the mountain, and its once tranquil passages have become home to all manner of beastly intruders."},{"name":"VIDOFNIR","text":"And worse, the fires at the core of Sohm Al rage and swell, as if roiled by some unwelcome parasite. The spirits of our fallen will find no rest until this disturbance is calmed."},{"name":"VIDOFNIR","text":"Thus would I have thee descend unto the mountain's depths, and sweep clean Sohm Al's stony halls."},{"name":"VIDOFNIR","text":"Would that I could perform the deed myself...<br>Alas, my girth prevents ready passage through the caverns leading unto the mountain's molten heart. Wilt thou accept this charge I lay upon thee?"},{"name":"VIDOFNIR","text":"Thou art generous of spirit, child of man. Know that I shall not sit idly by whilst thou toilest within─those winged nuisances whose screeches rend the air above the summit will soon learn of my displeasure."},{"name":"WANDERINGMOOGLE","text":"I sincerely hope Vidofnir never thinks of <span class=\"emphasis\">me</span> as a winged nuisance...<br>Anyway, good luck in there, <span class=\"highlight\">Forename</span>!"},{"name":"VIDOFNIR","text":"Thine assistance is not lightly considered, warrior of warriors─I will not rest upon my haunches even as thou riskest harm at my behest. Nay, I shall strike where thou canst not, and mete out deserved punishment to those flying pests that disturb the sanctity of our holy peak."},{"name":"WANDERINGMOOGLE","text":"Hm? Am I going with you? I...think I'd better stay out here in case any of those nasties tries to slip past into Moghome, kupo!"},{"name":"VIDOFNIR","text":"I am pleased with thy deeds, child of man. Hie thee once more unto Sohm Al's peak, and we shall share the news of thy success with my moogle messenger."},{"name":"WANDERINGMOOGLE","text":"Oh, you're back! ...Do I smell brimstone, kupo?"},{"name":"VIDOFNIR","text":"Thou hast accomplished all I asked of thee, warrior of warriors. Through thine exploits, the ancient thing that did skitter in the mountain's core hath been excised, and the fires of Sohm Al seethe angrily no more."},{"name":"VIDOFNIR","text":"This holy place belongeth not only to the brood of Hraesvelgr, but to all the dragons who roost within Dravania. It shall not be defiled while I yet draw breath."},{"name":"VIDOFNIR","text":"The Dragonsong War did take too many from us. Even those misguided kin who reveled in Nidhogg's vengeance deserve to find peace in the release of death."},{"name":"VIDOFNIR","text":"The Dragonsong War doth take too many from us. Even those misguided kin who yet revel in Nidhogg's vengeance deserve to find peace in the release of death."},{"name":"VIDOFNIR","text":"No matter the choices that set brood-brother against brood-brother, in the end we are all children of the Father of Dragons. Now that the war is over, I wish only that the souls of the fallen be spared the turmoil they suffered in life..."},{"name":"VIDOFNIR","text":"No matter the choices that set brood-brother against brood-brother, in the end we are all children of the Father of Dragons. I wish only that the souls of the fallen be spared the turmoil they suffered in life..."},{"name":"WANDERINGMOOGLE","text":"Vidofnir cares so deeply for her kin─even those who mocked Hraesvelgr's brood for their decision to stay out of the war. I only wish that I could be so tolerant of my brothers and sisters when they disagree with my brilliant suggestions, kupo..."},{"name":"WANDERINGMOOGLE","text":"Such musings aside, I should thank you for helping to preserve the peace around here! We'll be sure to keep a sharper eye out for intruders creeping into Sohm Al's caverns from now on!"}],"reward":{"gil":5000,"items":[{"id":17634}],"xp":0,"instance":49},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67205]}},"partials":[{"type":"npc","id":"1018427","obj":{"i":1018427,"n":"Gossamer Moogle","l":2082,"q":1}},{"type":"npc","id":"1018429","obj":{"i":1018429,"n":"Vidofnir","l":2002,"q":1}},{"type":"npc","id":"1011935","obj":{"i":1011935,"n":"Vidofnir","l":2000,"q":10}},{"type":"npc","id":"1018428","obj":{"i":1018428,"n":"Gossamer Moogle","l":2002,"q":1}},{"type":"item","id":"17634","obj":{"i":17634,"n":"Quicksand Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"49","obj":{"i":49,"n":"Sohm Al (Hard)","c":61801,"t":"Dungeons","min_lvl":60,"max_lvl":60,"min_ilvl":230}},{"type":"quest","id":"67205","obj":{"i":67205,"n":"Heavensward","g":3,"l":"Azys Lla","s":94}}]}