{"quest":{"name":"Ulala's Grand Performance","location":"Ul'dah","id":67937,"patch":3.5,"sort":129,"icon":100621,"eventIcon":71221,"issuer":1018638,"target":1018621,"genre":198,"journal":["Ulala has a knowing twinkle in her eye.<br>※This quest is available for a limited time only.","Ulala attempts to put on an air of confidence as she tells you in a quivering voice that she knew you would pick her all along. Thanking you, the future number one songstress of Eorzea then goes on to say she also appreciates your discretion regarding the incident that took place earlier in Limsa Lominsa that day. As she continues speaking with you, however, she seems to let slip a vital piece of information that was likely not intended for your ears. Fervently denying that the reason she has so concerned herself with pleasing the fans is because she is looking to start a solo career, Ulala fumbles for an excuse to cut your conversation short before rushing off. No doubt the royal seneschal is dying to hear who is to be the brightest star. Make your way back to the Ruby Road Exchange and let him know your Songbird of choice. <br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The royal seneschal is delighted when he hears that you chose Ulala to star in the upcoming show and is just as excited to inform you that Redolent Rose has made good upon his promise. Having received the girls' costumes while you were away, he tells you that they are every bit as glamorous as he had hoped they would be."],"objectives":["Speak with the royal seneschal."],"dialogue":[{"name":"SYSTEM","text":"Please note that once you accept this quest, you will be unable to accept the quests “Masha's Grand Performance” and “Narumi's Grand Performance.”"},{"name":"SYSTEM","text":"While the reward will remain the same, the outcome of this event will change based upon which of these quests you decide to accept."},{"name":"Q1","text":"By accepting this quest, you will be choosing Ulala. Are you sure you would like to proceed?"},{"name":"A1","text":"Yes. Ulala deserves the spotlight!"},{"name":"A1","text":"I'd like to have a moment to think things over."},{"name":"ULALA","text":"Wh-What? Of course I'm not surprised! I-I didn't doubt for a second that you would choose me. After all, I <span class=\"emphasis\">am</span> Eorzea's future number one songstress!"},{"name":"ULALA","text":"And while I may have been the obvious choice, I would nevertheless like to thank you for your support, <span class=\"highlight\">Forename</span>. It means the world to me. Without you, none of what we accomplished here today would have been even remotely possible."},{"name":"ULALA","text":"You swooped in and lent us your strength when we needed it most─like back there in Limsa Lominsa when I was being held up by overzealous fans. Had it not been for you, I would have never escaped and there would be no show for me to lead!"},{"name":"ULALA","text":"I-I've also been meaning to thank you for not mentioning that incident to the others. Why? B-Because it would have broken their spirits─that's why! After all, there's no nice way to tell someone that they're nowhere near as popular as you!"},{"name":"ULALA","text":"&lt;sigh&gt; I'm not fooling anyone, am I? Fine, I'll admit it! My air of nonchalance─it's...it's an act. I <span class=\"emphasis\">like</span> being out there. I <span class=\"emphasis\">like</span> meeting my fans and making them happy. But I'm trying to cultivate an image, and I can't let the truth get out. Not even to my friends."},{"name":"ULALA","text":"Wh-Why are you looking at me like that? It-It's not as though I'm planning on leaving the Songbirds for a solo career. The thought never even crossed my mind!"},{"name":"ULALA","text":"I-I should probably go now. The girls want to get in one last practice session before we take to the stage. Thank you, <span class=\"highlight\">Forename</span>! You won't be disappointed you chose me!"},{"name":"BUTLER","text":"So, my friend, have you decided who will be taking center stage?"},{"name":"BUTLER","text":"Ulala? Indeed, you make a convincing case. The passion and self-confidence she brings to each and every performance is sure to captivate both audience and passersby alike!"},{"name":"BUTLER","text":"And speaking of captivating, while you were out speaking with Ulala, Redolent Rose came by with a very special delivery. You guessed it! The girls' costumes have finally arrived and they're absolutely splendid!"},{"name":"BUTLER","text":"While organizing this event has been a grueling task, to say the least, one cannot say it wasn't worth it when they look upon these! Haha!"}],"reward":{"gil":200,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67936]}},"partials":[{"type":"npc","id":"1018638","obj":{"i":1018638,"n":"Ulala","l":40,"q":1}},{"type":"npc","id":"1018621","obj":{"i":1018621,"n":"Royal Seneschal","l":40,"q":6}},{"type":"quest","id":"67936","obj":{"i":67936,"n":"The Disappearing Act","g":198,"l":"Ul'dah","s":128}}]}