{"quest":{"name":"Words of Wisdom","location":"Azys Lla","id":67939,"patch":3.55,"sort":14,"unlocksFunction":1,"eventIcon":71341,"issuer":1016135,"target":1016135,"involved":[1013713,1016136],"genre":74,"journal":["Ardashir is curious as to the anima's present condition.","Ardashir's inquiry about the anima is suddenly interrupted by a linkpearl call from Rowena. As the young scholar explains it, he had sent documents outlining his research to a renowned authority of arcane magicks, who has seen fit to favor him with a response. Eager though he is to know what wisdom they have to share, he cannot neglect his present work. He asks that you precede him and meet with Rowena in Idyllshire.","Ardashir bursts onto the scene, breathless from an unexpected and hasty return to Azys Lla before finally arriving in Idyllshire. He quickly regains his composure, that he might pore over the sage words of the scholar─who is revealed to be none other than the legendary Matoya. Though her missive is marked with praise for his work, it is not without criticism. To wit, she has reason to believe that Ardashir's approach thus far may have failed to instill the anima with a sufficient sense of individuality. Based on his writings, she has offered a proposal to rectify this issue. And so he returns to Azys Lla to tell Gerolt of the good news.","Little to your surprise, Ardashir's unbridled enthusiasm to resume his work is matched only by Gerolt's loathing and desire for rest. One can only wonder what trials and tribulations are in store for you and the anima."],"objectives":["Speak with Rowena in Idyllshire.","Speak with Ardashir in Azys Lla."],"dialogue":[{"name":"ARDASHIR","text":"Ah, <span class=\"highlight\">Forename</span>. A pleasure as always. How fares the anima?"},{"name":"ARDASHIR","text":"Sprightly as ever, I see. It puts my mind at ease to see you both well."},{"name":"ROWENA","text":"(-Rowena-)Ardashir! You there, Ardashir? Just thought I'd check in. How are things comin' along?"},{"name":"ARDASHIR","text":"Oh, Rowena. My research is progressing quite well, thank you. To what do I owe the pleasure of this unexpected call?"},{"name":"ROWENA","text":"(-Rowena-)It's those papers you had me send off a few moons ago. You got a letter back about them, and a rather comprehensive one, at least judgin' by the weight o' the envelope. Reckoned you might want to drop by an' pick it up."},{"name":"ARDASHIR","text":"C-Could it be!? I mean, of course─I will make for Idyllshire at once!"},{"name":"ARDASHIR","text":"After finishing our work on the anima, I wrote a treatise on the various techniques we employed in its development. Thanks to Rowena, and her influential connections, I was able to deliver it to a renowned scholar who is the realm's foremost expert on arcane entities. I can scarcely believe it, but it would seem my observations were deemed worthy of a response."},{"name":"ARDASHIR","text":"Would you care to accompany me to Rowena's? I can but speculate as to the contents of the letter, but I daresay we may learn of something of benefit to your anima."},{"name":"ARDASHIR","text":"Excellent! Pray go on ahead to Idyllshire. I have a few tests underway that must be finished before I can leave. I shall follow anon."},{"name":"ROWENA","text":"Ah, there he is. What took you so long? To hear <span class=\"highlight\">Forename</span> here tell it, you were so bloody worked up about this letter you nearly broke your linkpearl."},{"name":"ARDASHIR","text":"My apologies. No sooner had I arrived in the hinterlands than I realized the burners on my workbench were still lit! Ahem. But that is neither here nor there. Oh, to think this moment would come! May I see the envelope, Rowena?"},{"name":"ARDASHIR","text":"After all, 'tis not every day one receives a personal missive from the illustrious Mistress Matoya."},{"name":"ARDASHIR","text":"Hmmm...hmm? Why, yes... Yes, of course! How could I have not seen! Why, it's all so clear now!"},{"name":"ARDASHIR","text":"I had the highest of expectations, but her analysis of my work was even more comprehensive and enlightening than I could have even imagined!"},{"name":"ARDASHIR","text":"What's more, she praised my methods for development as <span class=\"emphasis\">innovative</span>! Can you believe it? The incomparable Mistress Matoya, master of all matters arcane, was impressed by <span class=\"emphasis\">my</span> intellect and ingenuity."},{"name":"ARDASHIR","text":"She went on to surmise that, considering the anima in its capacity as a sentient weapon, its sense of individuality was lacking. But fear not! In her benevolence, she saw fit to offer counsel as to how we might address this very issue!"},{"name":"ARDASHIR","text":"The fledgling scholar I once was would have been elated simply to receive counsel I could scarcely understand, but I have learned much in my time together with you and Gerolt."},{"name":"ARDASHIR","text":"Together, I am confident we can put Mistress Matoya's teachings to good use. What say you, <span class=\"highlight\">Forename</span>. Shall we set to work on instilling your anima with a keener sense of self-awareness?"},{"name":"ARDASHIR","text":"Glad to hear it! Doubtless Gerolt, too, will be pleased to hear of this most exciting turn of events. Let us return to Azys Lla and deliver the good news."},{"name":"ROWENA","text":"Our product's gettin' a little more polish, eh? Well, if you an' Ardashir need anythin'─anythin' at all─you can trust ol' Rowena to take care of it."},{"name":"ROWENA","text":"...Provided the price is right, 'course. This ain't a charity I'm runnin' here, after all. Good luck to you, <span class=\"highlight\">Forename</span>."},{"name":"ROWENA","text":"Remember, <span class=\"highlight\">Forename</span>: if you need anythin', just say the word. We can figure out how much you'll be owin' me after the fact."},{"name":"GEROLT","text":"Aye, I heard─though between you and me, I wish I hadn't. &lt;sigh&gt; Just when I thought I could finally enjoy a moment's peace..."},{"name":"ARDASHIR","text":"Ah, at last you are returned! I can scarcely wait to see what wonders will come of Mistress Matoya's counsel."}],"reward":{"gil":1526,"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67934]},"next":[67940]},"partials":[{"type":"npc","id":"1016135","obj":{"i":1016135,"n":"Ardashir","l":2101,"q":11}},{"type":"npc","id":"1013713","obj":{"i":1013713,"n":"Rowena","l":2082,"q":4}},{"type":"npc","id":"1016136","obj":{"i":1016136,"n":"Gerolt","l":2101,"q":4}},{"type":"quest","id":"67934","obj":{"i":67934,"n":"Body and Soul","g":74,"l":"Azys Lla","s":13,"f":1}},{"type":"quest","id":"67940","obj":{"i":67940,"n":"Best Friends Forever","g":74,"l":"Azys Lla","s":15,"r":1,"f":1}}]}