{"quest":{"name":"Some Assembly Required","location":"Azys Lla","id":67933,"patch":3.5,"sort":12,"repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1018340,"target":1018340,"genre":74,"usedItems":[16933],"journal":["The processing node floats idly, waiting for commands.","Ardashir offers a brief explanation of how the anima's new soulstone will be created, entrusting you with the task of obtaining pneumite─an obscure catalyst essential to the process. Though he is reluctant to admit it, he knows not where they can be purchased or crafted. Ardashir bids you pool all your resources to track down this elusive component.","You acquire the pneumite through means perhaps better left unspoken. After loading it into the node along with Ardashir's crystals, and completing an unexpected-but-necessary system update, you are the proud owner of a sparkling new soulstone. Once Gerolt is finished forging your weapon, it will not be long before the anima resides in its permanent new home."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\"> Collect the pneumite.</span><span class=\"alternative\"> Load the pneumite into the processing node.</span></span>"],"dialogue":[{"name":"PROCESSSYSTEM","text":"&lt;beep&gt; &lt;beep&gt; Verifying system parameters...<br>System parameters verified. &lt;beep&gt; Please insert materials."},{"name":"ARDASHIR","text":"Ready to begin work on the soulstone? Excellent. Let us begin by going over the requisite materials."},{"name":"ARDASHIR","text":"Now, it bears mentioning that mine is a new method of soulstone creation. Rather than taking an existing stone and enchanting it, we will fashion a composite of high-purity crystals."},{"name":"ARDASHIR","text":"These crystals are common enough, and even I should be able to procure them."},{"name":"ARDASHIR","text":"The catalyst for this process, however, will prove more elusive."},{"name":"ARDASHIR","text":"A peculiar fusion of crystal and dark matter known as pneumite. It is essential to this unique form of soulstone synthesis."},{"name":"ARDASHIR","text":"Unfortunately, I know not how or where one might obtain it. I have only seen a single specimen in my master's laboratory, and though it pains me to admit it, I never thought to inquire after its origins."},{"name":"ARDASHIR","text":"I am afraid I must turn to your adventurer's resourcefulness to acquire the pneumite we require."},{"name":"ARDASHIR","text":"By my calculation, we will need no less than fifteen to ensure a successful fusion. It is no easy task, but it is the only way to make our soulstone."},{"name":"ARDASHIR","text":"I knew I could count on you. When you have the requisite pneumite, return here and load them into the processing node. Good luck, <span class=\"highlight\">Forename</span>."},{"name":"ARDASHIR","text":"Eager to fashion another soulstone, I see. Then I shall procure more crystals."},{"name":"ARDASHIR","text":"I will leave the pneumite to you. When you have acquired fifteen, return here and load them into the processing node."},{"name":"SYSTEM","text":"The pneumite requested by Ardashir can be obtained through various means."},{"name":"SYSTEM","text":"Speak with other players and share information to discover how to find it!"},{"name":"PROCESSSYSTEM","text":"System parameters verified. &lt;beep&gt; Please insert materials."},{"name":"PROCESSSYSTEM","text":"Catalyst detected.<br>Analyzing... Analyzing...<br>Catalyst drive at full capacity... Mineral quality optimal..."},{"name":"ARDASHIR","text":"Ah, you have the pneumite! Excellent work."},{"name":"ARDASHIR","text":"I will ready the crystals at once."},{"name":"ARDASHIR","text":"The crystals are all accounted for. Now to load them into the processing node."},{"name":"ARDASHIR","text":"That should do it. Now, processing node: initiate the soulstone synthesis protocol."},{"name":"PROCESSSYSTEM","text":"&lt;beep&gt; Unable to initiate protocol. Version 10 of the operating system is required to proceed.<br>Do you wish to upgrade?"},{"name":"ARDASHIR","text":"Upgrade...? I am not sure I want to─"},{"name":"PROCESSSYSTEM","text":"Upgrade requested.<br>Do you agree to the Terms and Conditions of Use as stipulated by the Allagan Research Council?"},{"name":"ARDASHIR","text":"But I... &lt;sigh&gt; Yes, yes, I agree. Will you please just initiate the synthesis protocol?"},{"name":"PROCESSSYSTEM","text":"...&lt;beep&gt; &lt;beep&gt; Update complete. Rebooting system...<br>&lt;beep&gt; Initiating synthesis protocol..."},{"name":"PROCESSSYSTEM","text":"&lt;beep&gt; Initiating synthesis protocol."},{"name":"ARDASHIR","text":"&lt;beep&gt; &lt;beep&gt; Synthesis complete. Margin of error within acceptable parameters."},{"name":"ARDASHIR","text":"It worked! It worked!"},{"name":"ARDASHIR","text":"We have our soulstone! Take it and the anima weapon to Gerolt. It is time to take the final step in securing the anima's future."},{"name":"ARDASHIR","text":"All that remains is to sufficiently condense the anima in preparation for the transfer. Soon, my friend. Soon we shall be ready for the final step in securing the anima's future!"},{"name":"ARDASHIR","text":"Pray keep that soulstone safe, my friend. We shall have need of it when you are ready to work with another anima. "}],"reward":{"items":[{"id":16932}],"xp":0},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67932]}},"partials":[{"type":"npc","id":"1018340","obj":{"i":1018340,"n":"Processing Node","l":2101,"q":2}},{"type":"item","id":"16932","obj":{"i":16932,"n":"Newborn Soulstone","l":1,"c":26501,"t":54}},{"type":"item","id":"16933","obj":{"i":16933,"n":"Pneumite","l":1,"c":21230,"t":54}},{"type":"quest","id":"67932","obj":{"i":67932,"n":"Born Again Anima","g":74,"l":"Azys Lla","s":11,"r":1,"f":1}}]}