{"quest":{"name":"The Last Pillar to Fall","location":"The Rising Stones","id":67930,"patch":3.5,"sort":16005,"icon":100605,"unlocksFunction":1,"eventIcon":71341,"issuer":1014565,"target":1014565,"involved":[1016633,1017675,1018446,1018447,1018511,1018512,1018513,1018514,1018707],"genre":17,"journal":["Unukalhai has a request regarding the final eikon of the Warring Triad.","Unukalhai informs you that the Scions have begun a search inside Azys Lla's research facility. They seek to locate the thralls responsible for maintaining the manifestation of the last remaining eikon of the Warring Triad, but certain sectors are too dangerous to enter for those not blessed with the Echo. Make your way to the Flagship, and wait for your comrades to arrive at the agreed rendezvous point.","After arriving on Azys Lla with Unukalhai, your fellow Scions soon join you with the disturbing news that an imperial force once more occupies the facility. As Urianger ponders the inefficacy of his wards, Regula van Hydrus approaches your party and explains the reason for the magick's failure: a pulse of power from the soon-to-awaken Zurvan. The legatus quickly describes the dire situation, and urges you to join him and his troops in preventing the Demon's thralls from rousing their master. Hurry after Unukalhai, and delve into Central Azys Lla.","You speak with Unukalhai, and he urges you to not fall behind the rest of your companions. The ritual must be stopped.<br><br>※The verification node can be used to re-enter Central Azys Lla.","You destroy the devices feeding aether to the stirring Zurvan, and return the eikon to a fitful slumber. But the temporary victory is not without a cost: in an unexpected act of heroism, Regula is struck down as he defends an overmatched Unukalhai. With his dying breath, the legatus bids you complete his duty, and slay the Demon and his followers. You withdraw with your companions, and the masked youth stands somewhat apart, shaken and disbelieving...<br><br>※The verification node can be used to re-enter Central Azys Lla.","Regula's sacrifice has afforded you the chance to strike at a weakened Zurvan. With their tasks assigned, your companions depart to secure the controls to the eikon's shackles. It falls to you and your handpicked company of warriors to bring oblivion to the Demon himself.<br><br>※Containment Bay Z1T9 can be accessed via the Duty Finder.","You have felled the monstrous Zurvan. Make your way back to the Flagship.","With the fall of Zurvan, the cataclysmic threat of the Warring Triad has at last been expunged. Even as your fellow Scions praise Regula's final heroic act, however, Unukalhai once more agonizes over his own inadequate strength. Return to the Rising Stones, and listen to the masked youth's story.","Unukalhai removes his mask, and proceeds to reveal not only his features, but also the truth behind his origins. He speaks of his birth on a different star, and of how that world became what is now known as the void. Though born with the power of the Echo, Unukalhai describes how he was yet too young to contend with the forces that brought such ruination, and of how a sudden shift in the balance between Light and Dark can consign an entire world to oblivion. His spirit snatched into the safety of the rift by his present master, Unukalhai explains that he came to Hydaelyn determined to prevent the realm from suffering a similar fate. And now that he walks alongside the Scions and the Warrior of Light, he may just yet become the hero he was destined to be."],"objectives":["Meet Unukalhai on the Flagship.","Speak with Unukalhai.","Proceed to Central Azys Lla.","Speak with Unukalhai in Central Azys Lla.","Confront Zurvan in Containment Bay Z1T9.","Speak with Unukalhai at the Rising Stones."],"dialogue":[{"name":"UNUKALHAI","text":"Greetings, Warrior of Light. But one pillar of the Warring Triad remains: Zurvan, the eikon known as the “Demon.”"},{"name":"UNUKALHAI","text":"According to the histories I have uncovered, this monstrous being was worshipped by a race of Meracydian beastmen."},{"name":"UNUKALHAI","text":"These creatures are the key to maintaining Zurvan's manifestation, and we can be sure that many such thralls will be imprisoned <span class=\"emphasis\">somewhere</span> within the research facility."},{"name":"UNUKALHAI","text":"It is imperative that we determine their exact location as swiftly as possible─we dare not risk repeating the near-disaster we suffered at the hands of Sophia's servants."},{"name":"UNUKALHAI","text":"As such, your fellow Scions have already begun an exhaustive search, but there are several sectors which only you, Krile, and I can enter without fear of enthrallment. Let us make our way to Azys Lla forthwith and aid the investigations."},{"name":"UNUKALHAI","text":"Zurvan's thralls must be accounted for ere we face the eikon himself. Azys Lla awaits!"},{"name":"KRILE","text":"<span class=\"highlight\">Forename</span>, it is good we caught you! The facility has been swarmed by imperial troops!"},{"name":"URIANGER","text":"By their standards did we judge them soldiers of the VIth. Aye, once more doth Regula van Hydrus stretch forth his hand to seize the forbidden fruits of Allag. And once more have our meticulous wards been swept aside like so many cobwebs..."},{"name":"REGULAVANHYDRUS","text":"(-???-)Your meddlesome wards were destroyed from within by the pulsating energies of an eikon."},{"name":"REGULAVANHYDRUS","text":"Nay, put up your weapons and listen. The followers of Zurvan have awakened, and they toil to rouse their master!"},{"name":"YSHTOLA","text":"The Demon's worshipers yet slumbered when we confronted Sophia. Could the tampering of her thralls have been more widespread than we thought?"},{"name":"UNUKALHAI","text":"They shared a common enemy─'tis not unthinkable that they would seek to free all those the Allagans had imprisoned."},{"name":"REGULAVANHYDRUS","text":"Yes, yes, the cage doors are open. And whilst you stand here quibbling over who picked the locks, my soldiers are inside the facility risking their lives and their sanity."},{"name":"REGULAVANHYDRUS","text":"They have volunteered to face death to prevent Zurvan's servants from waking him in the fullness of his power. Now, assuming you have at last understood the gravity of the situation, it is time that I rejoined them."},{"name":"KRILE","text":"But you cannot hope to succeed! The eikon will enslave the minds of any who draw near!"},{"name":"REGULAVANHYDRUS","text":"Thus did I seek out those with the power to resist his influence. Aid us, and mayhap my men will not perish in vain."},{"name":"UNUKALHAI","text":"...You propose an alliance."},{"name":"REGULAVANHYDRUS","text":"I have delved into the depths of this place and found its technology wanting. These mechanisms have failed to hold their prisoners, and such broken artifacts are unfit to bring before the Emperor."},{"name":"REGULAVANHYDRUS","text":"Twice have you bested me in combat. Will you now lend me that strength, and stand against our mutual foe?"},{"name":"YSHTOLA","text":"'Twas in opposing your reckless schemes that Ysayle was lost to us...<br>You expect us to simply forgive and forget all that has come before? "},{"name":"REGULAVANHYDRUS","text":"I expect you to put aside your emotions and use your better judgment. But, of course, I am dealing with savages."},{"name":"REGULAVANHYDRUS","text":"I will not stand here and justify the death of the ice maiden. We pursued our ideals, and you pursued yours─such was the result. And mayhap you might consider another point..."},{"name":"REGULAVANHYDRUS","text":"In these endless clashes, we have all lost comrades dear to us! Yet I choose to put aside past grievances to beg your champion's aid; to appeal to your reason."},{"name":"URIANGER","text":"Thou art willing to build a bridge of common purpose upon such tremulous foundations?"},{"name":"URIANGER","text":"I, too, am hesitant to accept this arrangement, Archon Y'shtola. But the offer has been made to the Warrior of Light, and 'tis <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> involvement which shall ultimately sway its outcome. I shall abide by <span class=\"highlight\">Forename</span>'s decision."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Zurvan must be stopped."},{"name":"A1","text":"I cannot fight alongside the Empire."},{"name":"A1","text":"..."},{"name":"YSHTOLA","text":"...Then for better or worse, we shall fight at your side."},{"name":"UNUKALHAI","text":"Mistress Krile and I are also resistant to primal influences. We shall aid you where we can."},{"name":"REGULAVANHYDRUS","text":"...Then let us be on our way."},{"name":"REGULAVANHYDRUS","text":"...Your answer does not surprise me. I was, however, duty-bound to pursue the most likely means of victory for the Empire. I leave you to your fate."},{"name":"UNUKALHAI","text":"...I will go."},{"name":"UNUKALHAI","text":"Whilst I cannot match <span class=\"highlight\">Forename</span>'s strength, I am immune to primal influence. I may prove of some use to you."},{"name":"KRILE","text":"I shall go as well. I fear that denying the legatus here will invite a lifetime of regret. There is too much at stake."},{"name":"YSHTOLA","text":"Thus we are shown the error of our ways. I spoke of Ysayle, but she would not have approved of allowing such a horror to surface whilst we clung to old rivalries."},{"name":"URIANGER","text":"Indeed, she would not. There is yet time─let us hasten after our comrades."},{"name":"REGULAVANHYDRUS","text":"You struggle to accept my proposal? An understandable conflict, but I will waste no more words. The hourglass drips with the blood of my soldiers."},{"name":"UNUKALHAI","text":"...Is it wise to refuse him? The imperials have no means to resist Zurvan's will. The eikon could soon awake in full possession of his power..."},{"name":"KRILE","text":"I never imagined I'd suggest joining hands with the imperials, but I see no alternative. The consequences of inaction are too dire to contemplate."},{"name":"URIANGER","text":"And how rare this moment, when the Empire opposeth us not..."},{"name":"YSHTOLA","text":"Let us then hasten after the legatus and accept his offer. The Twelve forbid we be foolish enough to allow old grudges pave the way for Zurvan's resurrection."},{"name":"UNUKALHAI","text":"Our companions have already passed through to the research facility. We should not lag behind!"},{"name":"YSHTOLA","text":"The Demon stirs..."},{"name":"URIANGER","text":"Like a suckling babe, he feedeth upon the aether siphoned unto him by his thralls. We must needs deprive him of this sustenance!"},{"name":"REGULAVANHYDRUS","text":"Then we destroy those devices."},{"name":"YSHTOLA","text":"Hold! Witness your soldiers!"},{"name":"UNUKALHAI","text":"They have turned one against the other. Even half awake, Zurvan corrupts and converts those who enter his aura..."},{"name":"KRILE","text":"The three of us, then. <span class=\"highlight\">Forename</span>, Unukalhai: we rush in together and each disable a generator. We cannot give them the chance to rally a defense!"},{"name":"REGULAVANHYDRUS","text":"There are four mechanisms by my count. If I can avoid the eikon's miasma, my blade will make short work of the last one."},{"name":"URIANGER","text":"We, all of us, have pledged our lives to─"},{"name":"REGULAVANHYDRUS","text":"Keep your lives. I would rather you tend to my fallen─some may yet survive with their minds intact."},{"name":"UNUKALHAI","text":"I know not if my strength will be enough. I am no champion..."},{"name":"REGULAVANHYDRUS","text":"The battlefield is no place for uncertainty, boy. Fate has blessed you with a unique talent and an occasion to use it. Do not waste such a gift."},{"name":"REGULAVANHYDRUS","text":"We strike!"},{"name":"KRILE","text":"Gods, Zurvan is─!"},{"name":"KRILE","text":"Unukalhai!"},{"name":"REGULAVANHYDRUS","text":"Raaargh!"},{"name":"YSHTOLA","text":"He slumbers once more..."},{"name":"UNUKALHAI","text":"...You saved me. Why?"},{"name":"REGULAVANHYDRUS","text":"I told you, boy... Yours is a gift too precious to waste. A gift the Emperor may one day have need of in his war upon these untamable eikons..."},{"name":"REGULAVANHYDRUS","text":"Emperor Varis, he... He raised me up from the ranks, stood against my detractors... I gladly give my life in his service..."},{"name":"REGULAVANHYDRUS","text":"&lt;cough&gt; You must... You must finish this. Slay these leeches upon our star... Kill them all. &lt;cough&gt; Kill...Zurvan!"},{"name":"URIANGER","text":"We must needs withdraw and prepare our assault. At the cost of his very life, the legatus hath prised open for us a window of opportunity."},{"name":"UNUKALHAI","text":"If you are prepared to enter Azys Lla's core, simply approach the verification node."},{"name":"UNUKALHAI","text":"Have you lost your way, Warrior of Light? The path to Azys Lla's core can be opened with the verification node near the portal."},{"name":"Q1","text":"Proceed to Central Azys Lla?"},{"name":"Q1","text":"Leave Central Azys Lla?"},{"name":"KRILE","text":"I had thought Regula a cold and ruthless man, but he showed surprising compassion for his soldiers."},{"name":"KRILE","text":"And it also seems he placed great trust in his emperor. If Regula could be convinced that the technology for containing primals is fatally flawed, then mayhap Varis can be convinced as well."},{"name":"YSHTOLA","text":"'Tis not often that I dare approach so closely to entities such as Zurvan. How sharply am I reminded of the burden we place upon those whom are blessed with the Echo..."},{"name":"URIANGER","text":"These wounded soldiers will live, but further battle is beyond them. I have counseled them to remain here until their compatriots arrive to bear them home."},{"name":"IMPERIALSOLDIERONE02394","text":"Forgive me if I show little gratitude for my rescue..."},{"name":"IMPERIALSOLDIERONE02394","text":"It is said that the Emperor and van Hydrus were childhood friends. Foul fortune that we should be the ones to bring news of his death..."},{"name":"IMPERIALSOLDIERTWO02394","text":"The research facility crawls with Zurvan's faithful, and they will not cease in their efforts to rouse him. If you would honor the legatus's sacrifice, then you must slaughter those fiends to the last."},{"name":"UNUKALHAI","text":"He's dead. Had I only been stronger..."},{"name":"KRILE","text":"Enough of that! There'll be time for regrets after we've rid the world of Zurvan!"},{"name":"YSHTOLA","text":"Krile has the right of it. The Demon has fallen back into torpor for now, but we must act swiftly if Regula's death is to have meaning."},{"name":"YSHTOLA","text":"The survivors speak of an army of thralls loose in the facility, and we must assume that these followers continue their efforts to awaken the eikon."},{"name":"URIANGER","text":"Let us then concentrate upon diverting them from their task. Mistress Krile and Master Unukalhai, prithee secure the controls to Zurvan's shackles and limit the restoration of his might."},{"name":"URIANGER","text":"Archon Y'shtola and I shall forge ahead, and strike down those thralls as would seek to harry you."},{"name":"URIANGER","text":"Warrior of Light, thine is, as ever, the most perilous duty..."},{"name":"URIANGER","text":"Gather to thee thy trusted companions, and extinguish from this realm the fires of the Demon himself."},{"name":"KRILE","text":"The last pillar of the Warring Triad is set to fall! Let's see this to the end, <span class=\"highlight\">Forename</span>."},{"name":"UNUKALHAI","text":"The legatus spoke truly...<br>The thick of battle is no place to question oneself, and I will accept any forthcoming duty with certitude or not at all."},{"name":"IMPERIALSOLDIERONE02394","text":"We will bear the legatus's remains back to Garlemald. His favored blade was shattered, but may your own weapon claim vengeance in its stead!"},{"name":"IMPERIALSOLDIERTWO02394","text":"When I volunteered for this mission, it was in the knowledge that my death would serve a greater purpose. We fell too quickly... Too quickly..."},{"name":"KRILE","text":"Incredible as always, <span class=\"highlight\">Forename</span>! Hopefully that will be the last our world sees of the likes of Zurvan."},{"name":"YSHTOLA","text":"Every one of his thralls has been slain as far as we can determine. Our victory over the Warring Triad is complete."},{"name":"UNUKALHAI","text":"...An impossible feat had we not been blessed with your cooperation."},{"name":"URIANGER","text":"Let us not forget the efforts of Regula van Hydrus and his men. Without their noble sacrifice, the Demon would have awoken far sooner, and possessed of far more formidable energies."},{"name":"URIANGER","text":"The bodies of the fallen now accompany the survivors on the return journey to Garlemald. 'Tis known that the imperials recognize no god, yet they would honor the dead in their own fashion."},{"name":"YSHTOLA","text":"And when next we meet, our fleeting alliance will surely be forgotten. 'Twas an interesting exchange, nonetheless."},{"name":"YSHTOLA","text":"They spoke of their present ruler as a man who values self-sufficiency. Varis befriended Regula in their youth, it seems, and was highly impressed by his martial prowess. 'Tis common knowledge that Regula's rise to legatus was in great part advocated by the Emperor himself."},{"name":"YSHTOLA","text":"Regula freely admitted his shortcomings when it came to politics, and it was Varis's unconditional support that served to win his undying fealty. One does not expect such tales of comradeship to lurk beneath the Empire's iron exterior..."},{"name":"UNUKALHAI","text":"Contrary to all expectations, the man died a hero. Witnessing the way you all leapt into danger without hesitation, it would seem I am surrounded by heroes..."},{"name":"UNUKALHAI","text":"And yet, my own actions were aught but heroic. I have not the qualities nor the character to stand at the Warrior of Light's side."},{"name":"KRILE","text":"What a curious thing to say. Are you truly concerned that you do not measure up to some arbitrary requirement?"},{"name":"UNUKALHAI","text":"If you knew of the path I walked to reach this place, then you would understand why I doubt myself so. Return with me to the Rising Stones...and I shall tell you of it."},{"name":"UNUKALHAI","text":"With your victory over Zurvan, the Warring Triad is finally defeated. I am afraid, however, that mine own efforts have often been more hindrance than help... And you and your fellow Scions deserve to hear the reasons behind my actions."},{"name":"UNUKALHAI","text":"I promised to tell you of my journey. Of who I am. Of where I am from."},{"name":"UNUKALHAI","text":"The truth is, I am not of this world."},{"name":"UNUKALHAI","text":"I was born of a different star─a child whose power of the Echo was too feeble to save his dying world..."},{"name":"UNUKALHAI","text":"A child, who, unlike you, never became a Warrior of Light."},{"name":"UNUKALHAI","text":"When all I knew stood on the brink of destruction, I was yet half-grown. Had I been born but a handful of years earlier, history may have written a different tale; the seeds of other heroes that had yet to fully sprout may not have withered and perished."},{"name":"UNUKALHAI","text":"The star I failed to save is known to you now as “the void.”"},{"name":"UNUKALHAI","text":"Though <span class=\"highlight\">Forename</span> knew not that I spoke of my homeland, I have explained to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> before the cause of its ruin. A magick was devised to contain a defeated primal's might within a stone known as “auracite.” And the energies which bled from this imperfect vessel gradually corrupted the champions who wielded it."},{"name":"UNUKALHAI","text":"These heroes became slaves to an insatiable hunger for aether, eventually transforming into hideous fiends. And none who clung to the faint traces of Light were strong enough to oppose them."},{"name":"UNUKALHAI","text":"The demons next turned upon each other in a war which drained the land's aether in ever greater amounts, until one day the star was suddenly swallowed in a flood of Darkness. An entire world unmade in an instant."},{"name":"UNUKALHAI","text":"The voidsent you encounter here in this realm are the twisted remnants of once-mortal beings who gnaw on what motes of life force remain..."},{"name":"UNUKALHAI","text":"And as I lay dying, beaten and broken in my failed last stand, 'twas a white-robed Ascian who found my tormented spirit and bore me away to the rift betwixt worlds. Elidibus has been my master ever since."},{"name":"UNUKALHAI","text":"And as I lay dying, beaten and broken in my failed last stand, 'twas my present master who found my tormented spirit and bore me away to the rift betwixt worlds. 'Twas he who first introduced me to Urianger."},{"name":"UNUKALHAI","text":"At my mentor's feet did I learn of the nature of reality: of the existence of mirrored worlds and the eternal struggle between Dark and Light."},{"name":"UNUKALHAI","text":"Sudden and overwhelming superiority for either side will shatter the balance, and the world in question will be returned to the void by a calamity beyond imagining."},{"name":"UNUKALHAI","text":"As the self-appointed custodian of this balance, my master warned me that the Source─the first of all worlds─slips perilously close to oblivion."},{"name":"URIANGER","text":"In what spirit did this master proffer such a warning? A benevolent gesture? Or veiled threat?"},{"name":"URIANGER","text":"To these questions and more do I mean to coax forth answers. Yet no matter his intention, that Hydaelyn doth teeter on a knife's edge is an undeniable truth. Knowing this, what choice was given you to make?"},{"name":"UNUKALHAI","text":"I chose to join my master, and act as his instrument on this star. The tragedy that befell my home cannot be repeated─I <span class=\"emphasis\">will</span> see this world saved."},{"name":"UNUKALHAI","text":"...And yet I hesitated at the most crucial of moments. What right have I to stand alongside a true Warrior of Light?"},{"name":"URIANGER","text":"In thine own words thou wert called before thy time, and I offer that thou dwellest overmuch on the question of what maketh the hero. The search for the answer leaveth thee paralyzed by doubt."},{"name":"URIANGER","text":"Heed me, Master Unukalhai: thou needest not believe thyself a hero to perform great deeds. 'Tis the deed itself which earneth thee the hero's mantle."},{"name":"YSHTOLA","text":"Aye, the ideals you hold can be less important than having the faith to act upon them. Regula's loyalty to the Emperor guided his actions until the last, and though we did not see eye to eye on many things, his final deeds can be called naught less than heroic."},{"name":"KRILE","text":"Personally, I find that faith in my companions allows me to act unhindered by uncertainty."},{"name":"KRILE","text":"I know that should I ever falter, <span class=\"highlight\">Forename</span> and the others will be there to support me...or steer me back onto the right path if needed."},{"name":"UNUKALHAI","text":"I see..."},{"name":"UNUKALHAI","text":"In the days leading up to my world's destruction, I was entirely alone. I never knew what it was to have such comrades..."},{"name":"KRILE","text":"I cannot imagine the loneliness you must have felt. But look around you now, Unukalhai..."},{"name":"KRILE","text":"You're not alone anymore."},{"name":"YSHTOLA","text":"...Welcome to the Scions of the Seventh Dawn."},{"name":"UNUKALHAI","text":"I will fulfill my promise to save this world. And when I stumble, I shall be glad to have your hands there to steady me."},{"name":"UNUKALHAI","text":"My apologies. This is difficult for me. For so long have I spoken from behind a mask..."},{"name":"URIANGER","text":"We should all feel comfortable speaking without such concealments."},{"name":"YSHTOLA","text":"I should hope you appreciate the irony of that statement, Urianger..."}],"reward":{"gil":5000,"xp":0,"instance":20043},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67868]},"next":[67931]},"partials":[{"type":"npc","id":"1014565","obj":{"i":1014565,"n":"Unukalhai","l":481,"q":9}},{"type":"npc","id":"1016633","obj":{"i":1016633,"n":"Verification Node","l":2101,"q":5}},{"type":"npc","id":"1017675","obj":{"i":1017675,"n":"Unukalhai","l":2101,"q":1}},{"type":"npc","id":"1018446","obj":{"i":1018446,"n":"6th Legion Decurion","l":2179,"q":1}},{"type":"npc","id":"1018447","obj":{"i":1018447,"n":"6th Legion Soldier","l":2179,"q":1}},{"type":"npc","id":"1018511","obj":{"i":1018511,"n":"Unukalhai","l":2179,"q":1}},{"type":"npc","id":"1018512","obj":{"i":1018512,"n":"Y'shtola","l":2179,"q":1}},{"type":"npc","id":"1018513","obj":{"i":1018513,"n":"Krile","l":2179,"q":1}},{"type":"npc","id":"1018514","obj":{"i":1018514,"n":"Urianger","l":2179,"q":1}},{"type":"npc","id":"1018707","obj":{"i":1018707,"n":"Krile","l":2179,"q":1}},{"type":"instance","id":"20043","obj":{"i":20043,"n":"Containment Bay Z1T9","c":61804,"t":"Trials","min_lvl":60,"max_lvl":60,"min_ilvl":235}},{"type":"quest","id":"67868","obj":{"i":67868,"n":"Balance unto All","g":17,"l":"The Rising Stones","s":16004,"f":1}},{"type":"quest","id":"67931","obj":{"i":67931,"n":"A Demonic Duplicate","g":17,"l":"The Rising Stones","s":16105,"f":1}}]}