{"quest":{"name":"Narumi's Grand Performance","location":"Ul'dah","id":67943,"patch":3.5,"sort":131,"icon":100623,"eventIcon":71221,"issuer":1018639,"target":1018621,"genre":198,"journal":["Narumi appears surprised to see you.<br>※This quest is available for a limited time only.","Narumi, while initially terrified at the thought of being the center of attention, quickly comes to realize that leading the group may be the perfect opportunity to help her overcome her indecisiveness─a habit which lands her in hot water from time to time. Promising to give their performance her all, she then rushes off to see to some last-minute preparations. Your job, however, is still far from done, as there is one last person who must be informed of your decision. Make your way back to the Ruby Road Exchange and let the royal seneschal know your Songbird of choice.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The royal seneschal is delighted when he hears that you chose Narumi to star in the upcoming show and is just as excited to inform you that Redolent Rose has made good upon his promise. Having received the girls' costumes while you were away, he tells you that they are every bit as glamorous as he had hoped they would be."],"objectives":["Speak with the royal seneschal."],"dialogue":[{"name":"SYSTEM","text":"Please note that once you accept this quest, you will be unable to accept the quests “Ulala's Grand Performance” and “Masha's Grand Performance.”"},{"name":"SYSTEM","text":"While the reward will remain the same, the outcome of this event will change based upon which of these quests you decide to accept."},{"name":"Q1","text":"By accepting this quest, you will be choosing Narumi. Are you sure you would like to proceed?"},{"name":"A1","text":"Yes. Narumi deserves the spotlight!"},{"name":"A1","text":"I'd like to have a moment to think things over."},{"name":"NARUMI","text":"Y-You think that <span class=\"emphasis\">I</span> should be the one to take the center stage? Truly, I'd love to, <span class=\"highlight\">Forename</span>, but do you think I'm right for the role?"},{"name":"NARUMI","text":"Ah, there I go again, questioning my own ability. &lt;sigh&gt; It's the same sort of self-doubt that landed me in trouble at Horizon earlier."},{"name":"NARUMI","text":"The dye, which had me so distraught then, now seems inconsequential standing here with you... It goes to prove that fear is but a figment of one's mind, and we can conquer it if only we choose."},{"name":"NARUMI","text":"I will be more decisive...and what better way to start than by leading the Songbirds in the coming show? I will proudly take center stage, and I will put a smile on the faces of all present!"},{"name":"NARUMI","text":"You can count on me, <span class=\"highlight\">Forename</span>. With Ulala and Masha at my side, I shall bring you a performance you won't soon forget!"},{"name":"NARUMI","text":"Oh, look at the time! My apologies, but I must see to my preparations. Once again, thank you for all that you have done for us! See you very soon!"},{"name":"BUTLER","text":"So, my friend, have you decided who will be taking center stage?"},{"name":"BUTLER","text":"Narumi? Indeed, you make a convincing case. Her gentle demeanor and soft voice will warm the audience to their very cores, and they'll go home feeling as though they caught a glimpse into the heavens themselves!"},{"name":"BUTLER","text":"And speaking of heaven, while you were out speaking with Narumi, Redolent Rose came by with a very special delivery. You guessed it! The girls' costumes have finally arrived and they're absolutely divine!"},{"name":"BUTLER","text":"While organizing this event has been a grueling task, to say the least, one cannot say it wasn't worth it when they look upon these! Haha!"}],"reward":{"gil":200,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67936]},"next":[67944]},"partials":[{"type":"npc","id":"1018639","obj":{"i":1018639,"n":"Narumi","l":40,"q":1}},{"type":"npc","id":"1018621","obj":{"i":1018621,"n":"Royal Seneschal","l":40,"q":6}},{"type":"quest","id":"67936","obj":{"i":67936,"n":"The Disappearing Act","g":198,"l":"Ul'dah","s":128}},{"type":"quest","id":"67944","obj":{"i":67944,"n":"Idols Give Back","g":198,"l":"Ul'dah","s":132}}]}