{"quest":{"name":"Foxfire","location":"Kugane","id":67949,"patch":4.0,"sort":700,"icon":100680,"unlocksFunction":1,"eventIcon":71341,"issuer":1021262,"target":1021309,"involved":[1021301,1021302,1021305,1021307,1021308,1021310],"genre":159,"journal":["Kyokuho appears frantic...and Master Murakumo is nowhere to be found.","Murakumo has yet to return from his survey of the southerly shrine, and Kyokuho has a bad feeling that his master may be in grave danger. Hurry to Rakusui Gardens and search the area.","Murakumo was not to be found in Rakusui Gardens. Kyokuho suggests you next visit the westerly shrine on the Short Pier.","You and Kyokuho arrive to find the aged master clutching a wound suffered at the hands of one of Kinko's minions. Murakumo pleads with his pupil to allow him to be the sacrifice that seals the barrier for good, but before any vital humours are spilled, Lady Leveva appears seemingly out of nowhere to offer a solution that will conveniently save the day, without having to resort to bloodshed. Hurry with Leveva and Kyokuho to Kugane Castle to set the lady's plan in motion.","Following a heated battle that takes you through the heart of Kugane, Kinko is finally defeated, her spirit cleansed and her anger quelled.","A new barrier has been erected using energies drawn from both land and heavens. With Kugane safe, Kyokuho must decide where his journey shall take him next. Speak with the geomancer atop Tasogare Bridge.","The prophecy has been fulfilled─friends new and old having joined to overcome disaster and achieve hope and new knowledge. One day, maybe the star-crossed companions' paths will cross again.<br><br>※The next astrologian quest will be available from Jannequinard once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “The Soul of Temperance.”"],"objectives":["Search for Murakumo in Rakusui Gardens.","Speak with Kyokuho at the westerly shrine.","Await the final showdown outside Kugane Castle.","Speak with Kyokuho.","Defeat the spirits before they can harm the citizenry.","Weaken Kinko Kugane.","Weaken Kinko Kugane then heal her wrath and anguish.","Cast Aspected Benefic to subdue Kinko Kugane."],"dialogue":[{"name":"KYOKUHO","text":"<span class=\"highlight\">Forename</span>! Thank the stars you are finally here."},{"name":"KYOKUHO","text":"It's been almost four bells since Master Murakumo left on his daily inspection of the bonds. He most likely just stopped to warm his belly along the way, but I can't help wondering if it's something worse. Will you help me search for the old man? We can start at the closest shrine in Rakusui Gardens."},{"name":"UDOKU","text":"Well look what we have here, boys. The pretender is back with his ijin lapdog to do...whatever it is they're doing. Tell me again, what exactly is it you're doing?"},{"name":"KYOKUHO","text":"Not here but two beats of the heart and I'm accosted by Udoku and his merry band of minions. I'll handle these three while you search yonder for Master Murakumo."},{"name":"KYOKUHO","text":"Well, any sign of him?"},{"name":"KYOKUHO","text":"Where could he be? You don't suppose he tried anything foolish, do you? With the bonds as weak as they are, any manner of disturbance could rouse the golden fox...and the master is no longer of an age to defend himself."},{"name":"UDOKU","text":"Defend himself against what? A maid could walk the streets naked and unattended carrying a gold-filled sack and not have so much as a finger laid upon her. Or are you spreading more lies about angry spirits to sow fear so that you might offer your “protection” in exchange for a bugyo's ransom?"},{"name":"KYOKUHO","text":"I've done no such thing! I've merely bid my fellow geomancers aid the city in its time of need. Not once have I asked compensation for what I seek! If anything, it is <span class=\"emphasis\">you</span> who seek to prey on the citizenry's ignorance!"},{"name":"UDOKU","text":"Hah! So says the talentless hack who waves his great-grandfather's name around like he does his member! Your lies are growing stale, Kyokuho. Continue spouting them, and not only do you sully our craft, but the very legacy of Grandmaster Kazan. What would <span class=\"emphasis\">he</span> say to this nonsense!?"},{"name":"KYOKUHO","text":"Are you even listening to me? Why does no one listen to me!? All I desire is to mend my great-grandfather's magicks and save Kugane! I do not seek coin! I do not seek fame! Why is that so hard for you to grasp!?"},{"name":"KYOKUHO","text":"Gah! We are wasting our time here, <span class=\"highlight\">Forename</span>. Let us continue the search for Master Murakumo at the westerly shrine."},{"name":"UDOKU","text":"Quite the performance. Perhaps the pretender should trade in his geomancer's robes for mummer's paint. Hah hah hah hah!"},{"name":"KYOKUHO","text":"Master Murakumo! Are you hurt!?"},{"name":"MURAKUMO","text":"The bond...was nearly undone... I...tried to... But the...... Argh!"},{"name":"MURAKUMO","text":"Kinko... She's here. She's already through. We...we need to perform the blood ritual. It is the only way..."},{"name":"KYOKUHO","text":"No. I already told you. My great-grandfather spurned the spilling of innocent blood to complete the seal, and so have I. Besides, even if we were to conduct the ritual, there is no one to sacrifice."},{"name":"MURAKUMO","text":"Then I shall be the sacrifice, Kyokuho. For the many years since your grandfather passed, my sole purpose has been to find a means to mend Kazan's barrier. It would be the greatest honor knowing that with my death, I might not only save the city, but be granted the opportunity to watch over it for eternity."},{"name":"KYOKUHO","text":"No! I can't let you die, Master!"},{"name":"MURAKUMO","text":"Listen to what you are saying, Kyokuho. <span class=\"emphasis\">You</span> cannot let me die? I <span class=\"emphasis\">want</span> to do this. It is my decision to make and mine alone. Let not this selfishness in your heart distract you from what needs to be done."},{"name":"KYOKUHO","text":"You're wrong, Master! There must be another way. There is <span class=\"emphasis\">always</span> another way! There is <span class=\"emphasis\">always</span> hope!"},{"name":"KYOKUHO","text":"Right, <span class=\"highlight\">Forename</span>? Tell me! How do we save Kugane!?"},{"name":"Q1","text":"What do you suggest?"},{"name":"A1","text":"It's simple. Use astrology."},{"name":"A1","text":"It's simple. Sacrifice Master Murakumo."},{"name":"KYOKUHO","text":"Stop focusing on the bonds, and look to the fox? What do you mean, <span class=\"highlight\">Forename</span>?"},{"name":"LEVEVA","text":"What <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> means?"},{"name":"LEVEVA","text":"I'll tell you <span class=\"emphasis\">exactly</span> what <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> means!"},{"name":"LEVEVA","text":"(-???-)Not on my watch!"},{"name":"LEVEVA","text":"There is a much easier solution to all this nonsense...but only if you stop focusing on the bonds, and turn your attention to the fox!"},{"name":"KYOKUHO","text":"Lady Leveva! How did y─ Where did y─ Why did y─ Lady Leveva...?"},{"name":"LEVEVA","text":"Your powers of observation never cease to amaze me, Kyokuho. Aye, it is me, in the flesh. Fresh off a galley put into port this very morn."},{"name":"LEVEVA","text":"The symposium was a rousing success, the Vault quick to realize the benefits my school's wisdom could bring when applied to the rebuilding of Ishgard. It was even decided that several new courses in Sharlayan astrology were to be taught at the scholasticate starting next term."},{"name":"LEVEVA","text":"And so, with my father's dream fulfilled, I was finally free to pursue whatever I wished...and I wished to learn more of geomancy. So here I am...and not a moment too soon, by the looks of it."},{"name":"LEVEVA","text":"In the few bells I spent exploring the city for leads as to your whereabouts, I learned much and more about our “pretender” and his end-is-nigh advocacy, so I began testing the bonds of this barrier myself. It did not take long to realize that it was Kyokuho who was speaking verily, and his detractors the true pretenders."},{"name":"KYOKUHO","text":"So, you'll help us mend the bonds!?"},{"name":"KYOKUHO","text":"But how? <span class=\"highlight\">Forename</span> and I have already tried using energies drawn from the heavens, and that only worked to delay the inevitable."},{"name":"KYOKUHO","text":"The guardian spirit's strength has grown so great that the only thing that might hold her now is a new barrier anchored with bonds of lifeblood─but this I cannot allow."},{"name":"LEVEVA","text":"As always, Kyokuho, your hasty charge into a difficult answer blinds you from the simple solution. You were right to harness the power of Aspected Benefic─but you failed to grasp its true potential to bring succor."},{"name":"LEVEVA","text":"For so long you have focused on mending your great-grandfather's bonds, when you should have focused on Kinko herself. If her wrath can be quelled, then a barrier will no longer be needed."},{"name":"KYOKUHO","text":"So...you're saying that if we use the power of the stars to soothe Kinko's wounded heart, we may convince her to stay her attack?"},{"name":"LEVEVA","text":"Giving you time to re-lay your great-grandfather's bloodless bonds. But it will only work if Kinko is weak, and the manifestations of her soul's scars cleansed."},{"name":"KYOKUHO","text":"Right! So we only need to─ Wait. Won't attacking Kinko and her spiritual minions simply anger her even more?"},{"name":"MURAKUMO","text":"Before something can be healed, it must first be hurt. It is a sound plan, Kyokuho. And...if it turns out you still require a sacrifice, I─"},{"name":"LEVEVA","text":"There will be no sacrificing tonight, tomorrow, or ever! The stars have foretold our victory and will provide us the strength we need to see our enemy overcome!"},{"name":"KYOKUHO","text":"That's what I like to hear! Follow me, then, to Kugane Castle! The spirits are certain to be drawn there!"},{"name":"KYOKUHO","text":"The fox is a creature of the night. If Kinko is to reveal herself, it will be under the cover of darkness."},{"name":"LEVEVA","text":"Trust in the heavens...and always trust in yourself."},{"name":"UDOKU","text":"The very hells have opened! Who will save us!?"},{"name":"KYOKUHO","text":"Tenkonto? We just walked up all those steps for a final showdown at Kugane Castle, and now we have to walk all the way back down to Ten─ Right. Mouth shut."},{"name":"LEVEVA","text":"Kinko will seek to draw our attention away from her by sowing chaos in the streets. Kyokuho, you focus your energies on the fox. <span class=\"highlight\">Forename</span>, you make swift work of her angry supplicants. I shall provide you both with support from the rear."},{"name":"QIB","text":"Kinko is attacking the people of Kugane!<br>We have to save them!"},{"name":"QIB","text":"Defilers of the land, hearken unto me! Tonight there shall be a reckoning!"},{"name":"QIB","text":"She flees! We can use this time to deal with Kinko's thralls before giving chase."},{"name":"QIB","text":"What is this I smell...? The blood of he who dared keep me from my rightful domain! Kazan!"},{"name":"QIB","text":"The fox thinks I'm my great-grandfather...and it doesn't appear she's all that thrilled to see me..."},{"name":"QIB","text":"Your insolence is neither forgotten nor forgiven! It is <span class=\"emphasis\">you</span> I shall devour first!"},{"name":"QIB","text":"Hurry! We must not afford her time to heal her wounds!"},{"name":"QIB","text":"Look there! So overwhelming are her wrath and anguish that they have taken shape!"},{"name":"QIB","text":"This light... Its warmth..."},{"name":"QIB","text":"The flames within recede with the morning tide..."},{"name":"QIB","text":"Her anger─we must soothe it once and for all!"},{"name":"QIB","text":"Hath man finally learned his power need not only be used for destruction? Perhaps my guardianship is no longer required..."},{"name":"QIB","text":"Now! She is ready!"},{"name":"QIB","text":"<span class=\"highlight\">Forename</span>!<br>Tap into the stars and guide their soothing energies through Kinko!"},{"name":"QIB","text":"Great-grandfather... I have failed...you..."},{"name":"QIB","text":"This wasn't in the morning's reading..."},{"name":"LEVEVA","text":"Kinko is calmed! Now lay the bonds and complete your great-grandfather's ritual!"},{"name":"KYOKUHO","text":"May the rivers of heaven and earth, wind and water, flow together as one. May their currents cleanse this land of its impurities and see it ever guarded."},{"name":"KYOKUHO","text":"May the wrath that once held rule be carried to the seas where it be forgotten...for eternity."},{"name":"LEVEVA","text":"It is done. Together we have saved Kugane, and with it torn down the walls that separated our two schools. This will be a day long remembered─the day a new hope was born."},{"name":"LEVEVA","text":"“At the end of the path of disaster is hope.” I'm not going to say I told you so...but I told you so. &lt;wink&gt;"},{"name":"KYOKUHO","text":"I don't know how to begin to thank you─both of you."},{"name":"LEVEVA","text":"Normally, I would say that this uncharacteristic display of humility is more than enough thanks, but I still require one thing in return for my assistance─a promise that this is not the end."},{"name":"KYOKUHO","text":"Of course it's not the end! This is just the beginning─a new beginning for both geomancy and astrology! There's so much to be done. First, we'll need to write down all that happened here today, then I'll need to─"},{"name":"JANNEQUINARD","text":"So this is Kugane, eh? Not bad."},{"name":"LEVEVA","text":"Jannequinard!? What in the seventh heaven's name are <span class=\"emphasis\">you</span> doing here!? I explicitly stated in my letter that you were not to follow me!"},{"name":"JANNEQUINARD","text":"Lady Leveva. I am disappointed. You of all people should know had you wanted me to stay put, you should have rather <span class=\"emphasis\">demanded</span> that I come."},{"name":"LEVEVA","text":"Yes, yes. What<span class=\"emphasis\">ever</span> was I thinking?"},{"name":"MURAKUMO","text":"Ahem. May I say that I am honored to have before me the foremost authorities on astrology. Your display last night taught me there is still much I must learn about my own school."},{"name":"MURAKUMO","text":"Something I would not have been able to do had I...er...allowed myself to be sacrificed."},{"name":"UDOKU","text":"Kyokuho! I... I wanted to...ap─ To apol─ Apol─"},{"name":"UDOKU","text":"To apologize. There, I said it."},{"name":"UDOKU","text":"I still despise you and that smirk of yours, but I can see I was mistaken about your being a pretender. You have talent...almost as much as I. You will make a worthy rival."},{"name":"KYOKUHO","text":"Hah! Coming from you, Udoku, I'll take that as a compliment."},{"name":"KYOKUHO","text":"Lady Leveva, under any other circumstances, I would be on a barque headed back to Eorzea this very evening to complete my training as an astrologian. But there is something I need to do first. Just as you fought to educate Ishgard of your school, I must do the same here in Kugane with mine.<br>A geomancy unfaithful to the teachings of the masters has poisoned this city for too long."},{"name":"LEVEVA","text":"A wise decision─one that was surely not easy for you to make."},{"name":"LEVEVA","text":"Take as much time as you need, Kyokuho. See the ship righted. See truth prevail. The stars will guide you back to us when the hour is right."},{"name":"KYOKUHO","text":"Don't you worry Lady Leveva. Give me a few summers and I'll have an entire army of geomancers trained by yours truly lining up at your desk!"},{"name":"LEVEVA","text":"An...entire army of Kyokuhos...?"},{"name":"KYOKUHO","text":"What? Is that a problem? Hah hah hah!"},{"name":"SYSTEM","text":"This concludes the astrologian quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “The Soul of Temperance.”"},{"name":"SYSTEM","text":"Once you have done so, the next astrologian quest will be available from Jannequinard."}],"reward":{"gil":2500,"action":7443,"items":[{"id":20286}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":99}],"quests":[67948]},"next":[68758]},"partials":[{"type":"npc","id":"1021262","obj":{"i":1021262,"n":"Kyokuho","l":2404,"q":3}},{"type":"npc","id":"1021309","obj":{"i":1021309,"n":"Kyokuho","l":2404,"q":1}},{"type":"npc","id":"1021301","obj":{"i":1021301,"n":"Udoku","l":2404,"q":1}},{"type":"npc","id":"1021302","obj":{"i":1021302,"n":"Kyokuho","l":2404,"q":1}},{"type":"npc","id":"1021305","obj":{"i":1021305,"n":"Kyokuho","l":2404,"q":1}},{"type":"npc","id":"1021307","obj":{"i":1021307,"n":"Leveva","l":2404,"q":1}},{"type":"npc","id":"1021308","obj":{"i":1021308,"n":"Kyokuho","l":2404,"q":1}},{"type":"npc","id":"1021310","obj":{"i":1021310,"n":"Leveva","l":2404,"q":1}},{"type":"action","id":"7443","obj":{"i":7443,"n":"Minor Arcana","c":3106,"j":33,"t":4,"l":70}},{"type":"item","id":"20286","obj":{"i":20286,"n":"Constellation Attire Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67948","obj":{"i":67948,"n":"Behind Door Number Two","g":159,"l":"Kugane","s":680,"f":1}},{"type":"quest","id":"68758","obj":{"i":68758,"n":"Love, Astrologically","g":159,"l":"Ishgard","s":800}}]}