{"quest":{"name":"Masha's Grand Performance","location":"Ul'dah","id":67942,"patch":3.5,"sort":130,"icon":100622,"eventIcon":71221,"issuer":1018640,"target":1018621,"genre":198,"journal":["Masha looks at you, confused.<br>※This quest is available for a limited time only.","While Masha is initially stunned to learn that you have chosen her to lead the upcoming performance, she is quick to recover. Telling you she will do her absolute best to ensure a great performance, she thanks you for not only helping their ensemble through a few rough patches, but also goes on to say that she believes the time you spent together─however brief─was very valuable to her. She believes it has helped her to grow as a person and see her goals with greater clarity. No doubt the royal seneschal is dying to hear who is to be the brightest star. Make your way back to the Ruby Road Exchange and let him know your Songbird of choice.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The royal seneschal is delighted when he hears that you chose Masha to star in the upcoming show and is just as excited to inform you that Redolent Rose has made good upon his promise. Having received the girls' costumes while you were away, he tells you that they are every bit as glamorous as he had hoped they would be."],"objectives":["Speak with the royal seneschal."],"dialogue":[{"name":"SYSTEM","text":"Please note that once you accept this quest, you will be unable to accept the quests “Ulala's Grand Performance” and “Narumi's Grand Performance.”"},{"name":"SYSTEM","text":"While the reward will remain the same, the outcome of this event will change based upon which of these quests you decide to accept."},{"name":"Q1","text":"By accepting this quest, you will be choosing Masha. Are you sure you would like to proceed?"},{"name":"A1","text":"Yes. Masha deserves the spotlight!"},{"name":"A1","text":"I'd like to have a moment to think things over."},{"name":"MASHAMHAKARACCA","text":"T-Truly? You want for <span class=\"emphasis\">me</span> to take the lead at the upcoming performance? I hardly dare believe it!"},{"name":"MASHAMHAKARACCA","text":"Thank you, <span class=\"highlight\">Forename</span>. While I'd be lying if I said I'm not the slightest bit nervous, I will do whatever it takes to ensure the Songbirds deliver their best performance to date!"},{"name":"MASHAMHAKARACCA","text":"I owe it to you for not only granting me this wonderful opportunity, but also for all your earlier help. Had you not come to find me when you did, I'm afraid there would have been no show for me to lead!"},{"name":"MASHAMHAKARACCA","text":"&lt;sigh&gt; I should have never allowed myself to get so distracted by something so trivial─and right before such an important event of all times!"},{"name":"MASHAMHAKARACCA","text":"It did serve to remind me, however, that I mustn't lose sight of what's before me. Nor forget why I chose to become a Songbird."},{"name":"MASHAMHAKARACCA","text":"That is, to do what I am about to do─take the stage and dance my way into the people's hearts!"},{"name":"MASHAMHAKARACCA","text":"I-I suppose we're getting a touch too sentimental now! And while that doesn't make anything I said earlier any less true, I shall leave it at that. <span class=\"highlight\">Forename</span>, I certainly hope to see you at our performance later─it wouldn't be the same without you!"},{"name":"BUTLER","text":"So, my friend, have you decided who will be taking center stage?"},{"name":"BUTLER","text":"Masha? Indeed, you make a convincing case. When she dances, the whole world stops to gaze upon her grace. No doubt our audience will be left breathless after such a display!"},{"name":"BUTLER","text":"And speaking of breathtaking displays, while you were out speaking with Masha, Redolent Rose came by with a very special delivery. You guessed it! The girls' costumes have finally arrived and they're absolutely gorgeous!"},{"name":"BUTLER","text":"While organizing this event has been a grueling task, to say the least, one cannot say it wasn't worth it when they look upon these! Haha!"}],"reward":{"gil":200,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67936]},"next":[67944]},"partials":[{"type":"npc","id":"1018640","obj":{"i":1018640,"n":"Masha Mhakaracca","l":40,"q":1}},{"type":"npc","id":"1018621","obj":{"i":1018621,"n":"Royal Seneschal","l":40,"q":6}},{"type":"quest","id":"67936","obj":{"i":67936,"n":"The Disappearing Act","g":198,"l":"Ul'dah","s":128}},{"type":"quest","id":"67944","obj":{"i":67944,"n":"Idols Give Back","g":198,"l":"Ul'dah","s":132}}]}