{"quest":{"name":"Behind Door Number Two","location":"Kugane","id":67948,"patch":4.0,"sort":680,"icon":100680,"unlocksFunction":1,"eventIcon":71341,"issuer":1021262,"target":1021262,"involved":[1021054,1021263,1021272,1021273,1021274],"genre":159,"journal":["Kyokuho is giving you his best “Where have you been, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>? I've been waiting for days” look.","With nothing else to go on, Kyokuho suggests a journey to the place of his great-grandfather's training─Yanxia. Since you, too, have no better ideas, you agree to join him in Namai to begin the search for...something. Anything.","According to the elders of Namai, geomancers once used a temple known as the Swallow's Compass to sharpen their minds and bodies. The temple is now abandoned, but Kyokuho believes there may be a chance that something can be discovered inside. Travel south to the One River and meet him near the building.","Your intrusion sets off a trap, awakening a guardian ordered by the geomancers to protect the temple gates. The battle is fierce and bloody, but you emerge victorious. Speak with Kyokuho to decide your next move.","After confirming there are no more traps, Kyokuho enters the Swallow's Compass alone to search for anything that might provide insight into his great-grandfather's barrier. He finds several scrolls that appear to do just that, but their condition prevents him from being certain. Convinced that Murakumo can decipher the scrolls, he sets off for the Shiokaze Hostelry.","Master Murakumo is indeed able to decipher the scrolls but what he finds leaves Kyokuho─for the first time in recent memory─speechless. The only true way to lay the bonds for an unbreakable barrier is with the blood of a sacrifice. Follow Kyokuho to Kogane Dori and ask what he requires of you next.","Refusing to even consider the offering of a sacrifice, Kyokuho finds himself back again at a familiar place─square one. Needing more time to think, he suggests you continue your own training until an epiphany is had.<br><br>※The next astrologian quest will be available from Kyokuho upon reaching level 70."],"objectives":["Accompany Kyokuho to Yanxia.","Follow Kyokuho to the Swallow's Compass.","Speak with Kyokuho.","Speak with Kyokuho in Kugane.","Speak with Kyokuho."],"dialogue":[{"name":"MURAKUMO","text":"Greetings, <span class=\"highlight\">Forename</span>. I hope your training has fared better than our search for information..."},{"name":"KYOKUHO","text":"I have some good news and some bad news, <span class=\"highlight\">Forename</span>. The bad news is, a thirty-seventh reading of my great-grandfather's tomes failed to reveal anything about the bonds that the previous thirty-six readings had not."},{"name":"KYOKUHO","text":"The good news─if you can call it that─is that we <span class=\"emphasis\">did</span> discover where Grandmaster Kazan conducted his training when he was a youth."},{"name":"KYOKUHO","text":"How does this help us? Good question. I'm still not completely certain myself, but it is more than we had the last time you were here, and an onze of hope is better than none at all, so...what do you say, friend. Are you up for a journey across the Ruby Sea?"},{"name":"KYOKUHO","text":"Hah hah! I knew you couldn't turn me down. Still, the road ahead won't be easy. Yanxia is large and the scars of war run deep along the Gensui Chain. It may be that which might have helped has already been claimed by flame. We'll have to place faith in our fortunes, and hope they guide us true. "},{"name":"KYOKUHO","text":"I have decided we shall begin our search in Namai for the reason that, well...there is no reason, but you have to start somewhere, eh? I shall meet you there. Safe journeys, <span class=\"highlight\">Forename</span>."},{"name":"MURAKUMO","text":"Master Kazan would rarely speak of his youth, but I do recall several instances during my own training where he would treat with visitors from the mainland. I did not dare ask who they were, for we were allowed to speak only when spoken to, but now that I reflect back upon those visits, it might have been that the men were geomancers from Yanxia."},{"name":"KYOKUHO","text":"The air is heavy with mist, and these shacks probably let in more rain than they keep out. Something like a tome wouldn't survive a single moon here...let alone the decades since my great-grandfather's training. Still, a few words with the village elders provided an interesting bit of information."},{"name":"KYOKUHO","text":"Though it required some coaxing, several were able to recall memories of robed seers who resided in a nearby temple─a temple that was in use right up until the Garlean invasion and the subsequent banning of all religion."},{"name":"KYOKUHO","text":"The building─called the Swallow's Compass─while since abandoned, still remains in good repair. But listen to this. The locals avoid it for fear of disturbing the spirits with which they believed the geomancers communed. Do you know what this means? There could still be something left inside! Come!"},{"name":"KYOKUHO","text":"The Swallow's Compass. Built during the rule of the first Doman king. I took the liberty to explore the grounds before you arrived and discovered this door. I know, I know. It pales in comparison to that impressive gate behind us, compelling any normal thief or bandit to dismiss it outright. But then why erect a geomantic field to protect it?"},{"name":"KYOKUHO","text":"I sense the flow of powerful energies here. Whatever lies behind this door, the geomancers wanted to keep it safe."},{"name":"KYOKUHO","text":"In fact...there may even be traps. Which is why only <span class=\"emphasis\">I</span> should attempt a crossing of the threshold."},{"name":"KYOKUHO","text":"I mean, who knows what terrible guardians have been summoned to protect the temple?"},{"name":"Q1","text":"Are you ready?"},{"name":"KYOKUHO","text":"Well, I guess now we know what terrible guardians were summoned to protect the temple! You'll also be happy to hear I was able to temporarily nullify the barrier, granting access into the chamber beyond. As there may be more traps, I ask that you wait out here to deal with them for me. Just kidding! I have already checked. There are no more traps. Probably."},{"name":"KYOKUHO","text":"Fortune is with us, <span class=\"highlight\">Forename</span>! The scrolls were intact, the barrier having protected them from both the elements and thieves. It took some searching, but I believe I was able to locate several that touch upon the laying of geomantic bonds."},{"name":"KYOKUHO","text":"At least I think I was able to... The script on these scrolls is old and faded, not to mention written in a hand far beyond my comprehension. Luckily, Master Murakumo is almost as ancient as the tomes, and should have little difficulty prising out their secrets."},{"name":"KYOKUHO","text":"A decanter or six of hot sake and he'll warm to the task. Ahah hah hah. I'll see you back at the Shiokaze Hostelry, <span class=\"highlight\">Forename</span>. I'll even save you a cup!"},{"name":"MURAKUMO","text":"Welcome back. The scrolls you and Kyokuho retrieved from Yanxia were not difficult to decipher. No, what has been difficult is deciding how to use this newfound information."},{"name":"KYOKUHO","text":"..."},{"name":"MURAKUMO","text":"Kyokuho. The Westerner has joined us. Might I suggest you do the same?"},{"name":"KYOKUHO","text":"I...oh. My apologies, <span class=\"highlight\">Forename</span>. You may want to sit down for this... Or not. It doesn't matter... <span class=\"emphasis\">Nothing</span> really matters, does it?"},{"name":"KYOKUHO","text":"The scrolls─they contained knowledge of the complete ritual. In fact it was in the very first one. Hah... Just our luck, right?"},{"name":"KYOKUHO","text":"Wind, water, earth. Creation of the bonds calls for the energies of all three. Though this much even a first-year novice of geomancy could tell you. No, what gave us pause was the mention of a fourth energy─an energy to render the seal permanent..."},{"name":"MURAKUMO","text":"Kyokuho..."},{"name":"KYOKUHO","text":"Life!"},{"name":"KYOKUHO","text":"Don't you see, <span class=\"highlight\">Forename</span>? They spilled living blood to complete the ritual! They damned a soul to an eternity without peace so that their magicks would not fade!"},{"name":"MURAKUMO","text":"I now understand why Grandmaster Kazan left no notes on the rites. He did not wish this knowledge to fall in the wrong hands."},{"name":"KYOKUHO","text":"And because he never performed the rites himself, the bonds anchoring the barrier around Kugane were never completed. And that is why they require constant attention. No blood was spilled to make them everlasting."},{"name":"KYOKUHO","text":"My great-grandfather would not sacrifice even a single life to achieve his ends, and neither will I!"},{"name":"MURAKUMO","text":"That's enough, Kyokuho. There will be time to think on this with the morrow. Return to Kogane Dori and see if you can find some solace in sleep."},{"name":"MURAKUMO","text":"I do not fault my master for keeping this dark secret from me. The burden would have been far too much for me to bear. But then...why tell Kyokuho's grandfather?"},{"name":"KYOKUHO","text":"I've failed... Just as did my great-grandfather, and my grandfather after him. We all knew the one means of creating a flawless barrier, and none of us could bring ourselves to do it."},{"name":"KYOKUHO","text":"And lo, the bonds we fortified but several nights past...already have they begun to loosen and fray."},{"name":"KYOKUHO","text":"They were weak for overlong, allowing Kinko to regain her strength. To mend her wounds. To feed her anger."},{"name":"KYOKUHO","text":"And now there is naught we can do but watch as she gathers her minions for a final assault on the land she once ruled. Kugane does not stand a chance..."},{"name":"KYOKUHO","text":"Now would be a good time for us to stumble across that hope Lady Leveva's reading promised would be at the end of this road to destruction."}],"reward":{"gil":1771,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":99}],"quests":[67947]},"next":[67949]},"partials":[{"type":"npc","id":"1021262","obj":{"i":1021262,"n":"Kyokuho","l":2404,"q":3}},{"type":"npc","id":"1021054","obj":{"i":1021054,"n":"Kyokuho","l":2404,"q":1}},{"type":"npc","id":"1021263","obj":{"i":1021263,"n":"Murakumo","l":2404,"q":2}},{"type":"npc","id":"1021272","obj":{"i":1021272,"n":"Murakumo","l":2404,"q":1}},{"type":"npc","id":"1021273","obj":{"i":1021273,"n":"Kyokuho","l":2410,"q":1}},{"type":"npc","id":"1021274","obj":{"i":1021274,"n":"Kyokuho","l":2410,"q":1}},{"type":"quest","id":"67947","obj":{"i":67947,"n":"Come Rain or Shrine","g":159,"l":"Ishgard","s":650,"f":1}},{"type":"quest","id":"67949","obj":{"i":67949,"n":"Foxfire","g":159,"l":"Kugane","s":700,"f":1}}]}