{"quest":{"name":"Idols Give Back","location":"Ul'dah","id":67944,"patch":3.5,"sort":132,"icon":100624,"eventIcon":71221,"issuer":1018621,"target":1018402,"genre":198,"journal":["The royal seneschal is ready to burst with excitement.<br>※This quest is available for a limited time only.","All the preparations are in order, and the Songbirds are finally ready to step out onto the stage and give the audience what they have been waiting for. The ever-eager royal seneschal, however, wishes to get in a few last words with you and the girls before the show begins. It has been a long day for the man, and he is certain to appreciate your attention.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","With the Little Ladies' Day concert tapering to a finish, now seems a good time to make your way to the steps at the Ruby Road Exchange, where the royal seneschal awaits.","The end of the Songbirds' concert has taken a great load off the royal seneschal's shoulders, and he thanks you profusely for your help in ensuring its success. As a token of his gratitude, he presents you with a small stack of vouchers that can be exchanged for a variety of Little Ladies' Day goods, including replicas of the Songbirds' costume─for ladies and gentlemen both. Bidding you enjoy the rest of the festival, he reminds you that the trio of preteen troubadours will continue performing throughout the event, and urges you to drop by to see them, should the fancy strike you."],"objectives":["Speak with the royal seneschal."],"dialogue":[{"name":"BUTLER","text":"<span class=\"highlight\">Forename</span>, the moment we have all been waiting for is upon us! Now that their costumes are here, and we know who will be leading them, the Songbirds are ready to take to the Little Ladies' Day stage!"},{"name":"BUTLER","text":"They are there, at Emerald Avenue, making final preparations. Let us hurry and join them!"},{"name":"ULALA","text":"I'm so excited about our new dresses, I can hardly think straight!"},{"name":"NARUMI","text":"Look, <span class=\"highlight\">Forename</span>, he came! Redolent Rose really came! And he's cheering for <span class=\"emphasis\">us</span>!"},{"name":"MASHAMHAKARACCA","text":"That we're here and ready to perform in spite of everything is nothing short of a miracle─a miracle made by you, Redolent Rose, and many others."},{"name":"BUTLER","text":"<span class=\"highlight\">Forename</span>, all the blood, sweat, and tears we have poured into making this event a reality are about to pay off!"},{"name":"BUTLER","text":"Girls, it is time! Step out there, give the audience what they came for, and make us all proud!"},{"name":"BUTLER","text":"The audience, <span class=\"highlight\">Forename</span>─do you see you how their eyes shine, utterly entranced? The earlier vitriol has completely melted away to be replaced with pure delight! The girls have done it! Little Ladies' Day is a rousing success!"},{"name":"BUTLER","text":"And to think I was so convinced that letting the Songbirds go off on their own would ruin all of Little Ladies' Day. Haha! Looking back, I say if anything, all the trouble we encountered along the way has made the conclusion of this event that much more satisfying."},{"name":"BUTLER","text":"Why, seeing the girls performing now, I would go so far as to say that their hardships have served to bring out the very best in the Songbirds."},{"name":"BUTLER","text":"Now then, as much as I would like to watch the performance to the end, I must return to my post on the Ruby Road Exchange. There is, however, something I wish to give you later, so please come find me when you are able."},{"name":"THREEPRINCESSES","text":"(-The Songbirds-)Ladies and gentlemen! Thank you for your patience! Let's make this a Little Ladies' Day to remember!"},{"name":"BUTLER","text":"The Songbirds─they were magnificent, weren't they? Be proud, my friend! It is a success that can largely be attributed to you!"},{"name":"BUTLER","text":"For all your hard work, I would like to present you with these─vouchers that can be exchanged for a variety of Little Ladies' Day goods."},{"name":"BUTLER","text":"As with past Little Ladies' Days, we have a large selection of items on offer, but this year we are carrying something special."},{"name":"BUTLER","text":"And lest you wonder, Redolent Rose was kind enough to design a gentleman's variant of the outfit, that men the realm over might also celebrate as the ladies do!"},{"name":"BUTLER","text":"Should, for whatever reason, you find yourself short on vouchers, any items that catch your fancy can always be bought the traditional way─and by that I mean with gil, of course!"},{"name":"BUTLER","text":"Thank you again, <span class=\"highlight\">Forename</span>! Now, please, go forth and enjoy what is left of this merriest of seasons. You have more than earned it! Oh, and don't forget─the Songbirds will continue performing throughout the duration of the event. If you have need of cheer, you know where to find them!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Songbird</span>!"}],"reward":{"gil":229,"emote":"Songbird","items":[{"num":5,"id":17000}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[67943,67942]}},"partials":[{"type":"npc","id":"1018621","obj":{"i":1018621,"n":"Royal Seneschal","l":40,"q":6}},{"type":"npc","id":"1018402","obj":{"i":1018402,"n":"Royal Seneschal","l":40,"q":1}},{"type":"item","id":"17000","obj":{"i":17000,"n":"Slightly Outdated Certificate of Collaboration","l":1,"c":26177,"t":85}},{"type":"quest","id":"67943","obj":{"i":67943,"n":"Narumi's Grand Performance","g":198,"l":"Ul'dah","s":131}},{"type":"quest","id":"67942","obj":{"i":67942,"n":"Masha's Grand Performance","g":198,"l":"Ul'dah","s":130}}]}