{"quest":{"name":"Ride Like the Wind","location":"Ishgard","id":67946,"patch":4.0,"sort":630,"icon":100680,"unlocksFunction":1,"eventIcon":71341,"issuer":1021191,"target":1012222,"involved":[1021192,1021221,1021222],"genre":159,"journal":["Lady Leveva has something to ask of her favorite pupil.","Lady Leveva has stated her desire to have you continue Kyokuho's training until her symposium at the Vault concludes. She has bid you follow her outside onto the Athenaeum's overlook so that you may both inform the Hingan novitiate of this decision.","It appears Kyokuho may have already departed for the Steel Vigil to attempt an opening of the sixth, and final gate alone. Hurry into the Coerthas central highlands and find the astrologian-in-training before a hungry dragon does.","You save Kyokuho from certain death, teach him the secrets of the Spear, see him open the sixth gate of heaven...only to have him inform you that he will be immediately returning to Hingashi without bidding his friends and mentors farewell, possibly never to return again. Bear the ill tidings to Lady Leveva in the Athenaeum Astrologicum.","Unsurprised by the outcome of your journey, Lady Leveva makes the case that they should allow Kyokuho to do what he feels is best, for a man is but his own master. With your report to Leveva complete, you are free to inform Jannequinard of the day's occurrences as well.","Jannequinard appears emotionally torn by Kyokuho's departure, but your subsequent conversation with the viscount leaves you confident that somehow, some way, he will get through the ordeal. Until then, you had best hit the dungeons and improve your scrying skills.<br><br>※The next astrologian quest will be available from Jannequinard upon reaching level 65."],"objectives":["Follow Leveva outside the Athenaeum.","Seek out Kyokuho at the Steel Vigil.","Report to Leveva back at the Athenaeum.","Speak with Jannequinard regarding the day's events."],"dialogue":[{"name":"JANNEQUINARD","text":"Ah, <span class=\"highlight\">Forename</span>. Lady Leveva has been <span class=\"emphasis\">most</span> impressed with Kyokuho's willingness to learn. I, for one, will be watching his progress with great interest."},{"name":"KYOKUHO","text":"Greetings! I know that Lady Leveva asked you to help me train, but since you were not around, I took it upon myself to open a few more of those pesky gates on my own. I hope you don't mind."},{"name":"LEVEVA","text":"<span class=\"highlight\">Forename</span>! I see you received my summons."},{"name":"LEVEVA","text":"You <span class=\"emphasis\">didn't</span> receive my summons? Twelve damn that Jannequinard to the seventh hell and back! He is going to p─ Ah, forgive me. There shall be sufficient time for the condemnation of his soul after eleventh bell tarts. For now, I must speak to you of Kyokuho's training."},{"name":"LEVEVA","text":"Despite appearances...and attitude...and manners...and courting habits, our traveler from the East has proven quite motivated in his study of our ways. In fact, while you were off doing whatever it is you do, he successfully opened the next <span class=\"emphasis\">four</span> gates of heaven."},{"name":"LEVEVA","text":"Anyway, preparations for the symposium have left me with little time to pick the boy's mind, but I have nevertheless managed to fully grasp the primitive concept of geomancy. In fact, I plan on incorporating several of the ideas as anecdotes into my presentation. It is what my father would have wanted."},{"name":"LEVEVA","text":"Now, as to why I have called you here. Kyokuho is very close to attuning to the final heaven─the Spear─and I think it only fitting that his instructor be there to accompany him during his finest moment."},{"name":"LEVEVA","text":"...And because I am obviously too occupied at the moment, I thought perhaps you could join him in my stead."},{"name":"LEVEVA","text":"Then it is settled! You shall guide young Kyokuho on his final steps to glory and enlightenment, just as I did you those many moons ago. Follow me outside, <span class=\"highlight\">Forename</span>, and let us bring our friend the good tidings together."},{"name":"JANNEQUINARD","text":"Am I bitter that it took Kyokuho all of a single moon to open five gates? Am I bitter that he accomplished in a blink of an eye what took me near twenty summers? No. Not. Bitter. At. All. See, I'm even smiling. Verily."},{"name":"LEVEVA","text":"That is odd. I could have sworn he was right here but a moment ago. Fleuraie! Have you seen Kyokuho? Fleuraie! Are you even listening to me!?"},{"name":"JANNEQUINARD","text":"If it is our Hingan novitiate you seek, he hurried out the Athenaeum's side entrance not five heartbeats past. He was quite animated...even more than usual. A veritable one-man mummer's tragedy all full of jumping and flailing and pumping of fists."},{"name":"LEVEVA","text":"What could have unsettled the boy so?"},{"name":"JANNEQUINARD","text":"I suppose it <span class=\"emphasis\">might</span> have been that letter I handed him."},{"name":"JANNEQUINARD","text":"It was delivered just this morning. Kyokuho skimmed over it quickly, asked me several cursory questions about the heaven of ice to which I gave several cursory answers, and then was gone."},{"name":"LEVEVA","text":"And you did not try and stop him?"},{"name":"JANNEQUINARD","text":"Why would I? He was <span class=\"emphasis\">leaving</span>."},{"name":"LEVEVA","text":"Bah, if my intuition is correct...and it usually is, something in that missive has led Kyokuho to believe that he does not have much time left in Eorzea, and so has set out for the Steel Vigil that he might open the final gate and complete his training before he departs our realm. <span class=\"highlight\">Forename</span>, it looks as if our plan is already set in motion. To the central highlands!"},{"name":"JANNEQUINARD","text":"Something tells me Lady Leveva is correct in her assumption about Kyokuho's whereabouts. Something indeed..."},{"name":"KYOKUHO","text":"<span class=\"highlight\">Forename</span>. This is the second time you have saved me from my folly...well, technically speaking it is the first. You were merely standing around as Lady Leveva healed my wounds last ti─ Right. I'll stop there."},{"name":"KYOKUHO","text":"I know it makes little sense to leave without saying anything despite the fact you, Lady Leveva, and Jannequinard all were but mere yalms from where I stood, but some stories are already told, and who are we to struggle against the ebb and flow that carry us ever toward our fates?"},{"name":"KYOKUHO","text":"All right, that was a poor excuse. The truth is, I have been summoned back to my homeland and was too ashamed to face those who had showed me so much support."},{"name":"KYOKUHO","text":"And so I thought to come here, open the gate to the final heaven, and then take the next trading galley out of Ul'dah before any of you realized I was gone. As you can see, things did not unfold as planned... But since you are here, perhaps we could have one last lesson, for old times' sake?"},{"name":"Q1","text":"What will you explain?"},{"name":"A1","text":"The Spear's origins."},{"name":"A1","text":"The Spear's blessings."},{"name":"KYOKUHO","text":"A palace of ice set ablaze with the light of the moon... And you say it was carved by a single spear? Remarkable!"},{"name":"KYOKUHO","text":"I see... Both power <span class=\"emphasis\">and</span> compassion. The yin to the other's yang..."},{"name":"KYOKUHO","text":"It is as if the more I learn of your stars, the less I know!"},{"name":"KYOKUHO","text":"To think this may be the last I ever see of your heavens..."},{"name":"KYOKUHO","text":"I am beginning to understand why your people treasure them so."},{"name":"KYOKUHO","text":"And with the opening of the sixth, I have prepared my mind and soul for the seventh. The final gate that leads to true dominion over the elements...or so Lady Leveva insists."},{"name":"KYOKUHO","text":"Our conversations have been...eye-opening, to say the least. She theorizes that our two schools may actually be one and the same. Whereas astrologians look to the stars above to read their fates, we geomancers look to the star <span class=\"emphasis\">below</span> and listen to its songs, and draw our answers from its whispers."},{"name":"KYOKUHO","text":"While I am certain my masters back in Hingashi would cringe upon hearing that a Westerner of not twenty summers believes she has grasped a thousand generations of teaching, I am more willing to indulge her eccentricities now that I know she means no ill will. I only wish that we would have had more time to possibly see if there were some way we could have combined our knowledge to create something new. Something the world has never before seen."},{"name":"KYOKUHO","text":"And with that, I bid you, Lady Leveva, Quimperain, Mugueniel, soft-skinned Fleuraie, sweet-lipped Heurriette, that tall chap on the second floor always mumbling about some star's magnitude...even Jannequinard the fondest of farewells."},{"name":"KYOKUHO","text":"I have a long journey ahead of me, and if I do not leave now...I fear I will never be able to."},{"name":"JANNEQUINARD","text":"Shoo! If Lady Leveva catches you speaking with me before you have reported to her, she'll have <span class=\"emphasis\">my</span> head thinking that it was <span class=\"emphasis\">I</span> who made </span>you</span> come to me first."},{"name":"LEVEVA","text":"You are back...but I do not see Kyokuho. Is he out fawning over Fleuraie again?"},{"name":"LEVEVA","text":"Back to Hingashi? I cannot say this was unexpected. The Deck of Sixty told me as much this morning. That, and I asked Jannequinard what was written in the letter. What, you thought him above reading another's correspondence? You give him far too much credit where none is due."},{"name":"LEVEVA","text":"Kyokuho is not a child. He knew what coming to Eorzea would entail, and he knew that he would one day need return to his homeland. And while we may not have always agreed─alright, almost <span class=\"emphasis\">never</span> agreed─I did come to respect the man and his, ah, steely resolve."},{"name":"LEVEVA","text":"Allow him his space. If the stars deem it fitting, then he will be back. Or perhaps next it will be our turn for a journey over storm and sea."},{"name":"JANNEQUINARD","text":"He's gone!? And without saying good-bye!? I cannot believe it! I <span class=\"emphasis\">will</span> not believe it! Oh, what I would not give to have but one last moment with my brother, my <span class=\"emphasis\">soulmate</span>, my─"},{"name":"JANNEQUINARD","text":"Lady Leveva told you I read his letter? Oh, well then. Yes, it will pain me to tell the other novitiates that Kyokuho has returned to his native lands far away on the other side of the world. I may even need to <span class=\"emphasis\">personally</span> comfort those most stricken with grief by his sudden, and tragic departure."},{"name":"JANNEQUINARD","text":"But truth be told? I am going to miss having the Hingan around. He certainly did liven the place up. Godsspeed, Kyokuho. May your return journey leave you miserable and wet...but see you safely home."}],"reward":{"gil":1204,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":99}],"quests":[67945]},"next":[67947]},"partials":[{"type":"npc","id":"1021191","obj":{"i":1021191,"n":"Leveva","l":2301,"q":3}},{"type":"npc","id":"1012222","obj":{"i":1012222,"n":"Jannequinard","l":2301,"q":20}},{"type":"npc","id":"1021192","obj":{"i":1021192,"n":"Kyokuho","l":2301,"q":2}},{"type":"npc","id":"1021221","obj":{"i":1021221,"n":"Leveva","l":2301,"q":1}},{"type":"npc","id":"1021222","obj":{"i":1021222,"n":"Kyokuho","l":63,"q":1}},{"type":"quest","id":"67945","obj":{"i":67945,"n":"East Meets West","g":159,"l":"Ishgard","s":601,"f":1}},{"type":"quest","id":"67947","obj":{"i":67947,"n":"Come Rain or Shrine","g":159,"l":"Ishgard","s":650,"f":1}}]}