{"quest":{"name":"An Aura for Trouble","location":"The Fringes","id":67951,"patch":4.0,"sort":630,"icon":100679,"unlocksFunction":1,"eventIcon":71341,"issuer":1018753,"target":1018753,"involved":[1000692,1018757,1018758,1018763,1018764],"genre":153,"journal":["Sylphie seems eager to speak with you.","Sylphie tells you of the hints of the disturbance she felt while accompanying the serpent scouts on patrol. Meet with her near Bittermill and investigate further.","Whilst searching for the origin of the elementals' disquiet, you and Sylphie encounter the same strange girl you spotted once before. The child flees upon being discovered, and you hurry off in pursuit at Sylphie's urgent behest...","You find the trembling child being attacked by a pack of vicious voidsent, and act quickly to dispatch the fiendish creatures. Coaxed by Sylphie's gentle words, the girl then tells you her name─Gatty─and that she and her mother live in the borderland forest. Before Sylphie can tend to her wounds, however, you are both distracted by another surge of power, and look back to find that Gatty has disappeared. Convinced that the girl and her potent aura are connected to the disturbance, Sylphie suggests that a report to Brother E–Sumi–Yan is in order.","Upon hearing Sylphie's summary of events, Brother E–Sumi–Yan agrees with her assessment. He surmises that Gatty's uncontrolled aetherial gifts are likely acting as a beacon for marauding voidsent─the presence of the malevolent creatures subsequently agitating the elementals. Return to Castrum Oriens once more, and help Sylphie with her plan to question the elusive girl at her forest home.","Sylphie hopes that her search will be successful, but wonders if Gatty and her mother will be willing to talk. Thinking back on how the girl reacted to her offer of healing, the acolyte fears that an outburst of emotion might lead to yet another battle with the voidsent...<br><br>※The next white mage quest will be available from Sylphie upon reaching level 65."],"objectives":["Speak with Sylphie.","Chase after the strange child.","Speak with E–Sumi-Yan at Stillglade Fane.","Speak with Sylphie."],"dialogue":[{"name":"SYLPHIE","text":"Oh, hello, <span class=\"highlight\">Forename</span>! It's nice of you to worry, but I've been perfectly safe─I asked the soldiers at the Wall if I could accompany them on their patrols instead of wandering about on my own."},{"name":"SYLPHIE","text":"More than a few times I thought I sensed something─the briefest of flickers─but the scouts had their mission, and I couldn't risk getting separated from them to confirm my suspicions."},{"name":"SYLPHIE","text":"I need to check one area in particular, some distance away from the patrol route. Do you think you could come with me? Here, I'll mark the spot on your map and we can meet there when you're ready."},{"name":"SYLPHIE","text":"This is the place..."},{"name":"GATTY","text":"(-Strange Child-)......"},{"name":"SYLPHIE","text":"&lt;gasp&gt; Do you feel that!? The source must be nearby!"},{"name":"GATTY","text":"(-Strange Child-)Ah!"},{"name":"SYLPHIE","text":"...And you're sure it's the same child?"},{"name":"SYLPHIE","text":"I don't know what's going on here, but her aura is <span class=\"emphasis\">blinding</span>. Come on, we have to follow her!"},{"name":"SYLPHIE","text":"...Now where did she disappear to? Let's split up for a bit and keep looking!"},{"name":"GATTY","text":"（★未使用／削除★）"},{"name":"GATTY","text":"Stay away from me!<br>Mama! Where are you!?"},{"name":"SYLPHIE","text":"You poor thing, you must have been terrified! But don't worry! We'll get you back to your mother!"},{"name":"GATTY","text":"I'm not supposed to talk to strangers...<br>Mama says they'll take me away and lock me in a cage."},{"name":"SYLPHIE","text":"Is that what she says? Well, I'm Sylphie, and this is <span class=\"highlight\">Forename</span>."},{"name":"SYLPHIE","text":"Now you know our names, why don't you tell us yours? Then we won't be strangers anymore, right?"},{"name":"GATTY","text":"(-Gatty-)...My name is Gatty.<br>You don't feel icky like the bad things..."},{"name":"GATTY","text":"（★未使用／削除予定★）"},{"name":"SYLPHIE","text":"Well, I hope that means we can be friends! Come on, Gatty, let's go and find your mother. Do you know the way home?"},{"name":"GATTY","text":"(-Gatty-)I don't have any friends...<br>We live in the forest─just Mama and me."},{"name":"GATTY","text":"（★未使用／削除予定★）"},{"name":"SYLPHIE","text":"Were you hurt when those creatures attacked? Here, let me see..."},{"name":"SYLPHIE","text":"Ah, I'll mend that in no time! Watch. A conjurer like me can heal all sorts of wounds."},{"name":"GATTY","text":"(-Gatty-)&lt;gasp&gt; A conjurer!? No! Don't touch me!"},{"name":"SYLPHIE","text":"There's that surge again! And this time it's far more powerful. Gatty, we have to leave!"},{"name":"SYLPHIE","text":"Wha─ She's gone! Did you see where she went!?"},{"name":"SYLPHIE","text":"No...? But we barely took our eyes off of her! How did she manage to vanish so quickly?"},{"name":"Q1","text":"How did Gatty vanish so quickly?"},{"name":"A1","text":"She was taken by the voidsent."},{"name":"A1","text":"She learned the trick from a moogle."},{"name":"A1","text":"......"},{"name":"SYLPHIE","text":"Taken!? But you didn't see any more voidsent, did you?"},{"name":"SYLPHIE","text":"...Neither did I. And I'm fairly sure you took care of all the fiends that were attacking her."},{"name":"SYLPHIE","text":"Ah, well moogles certainly are good at disappearing, but I've never heard of them teaching the secret of it to anyone else..."},{"name":"SYLPHIE","text":"...No idea either, huh? She winked out of sight just like she was a moogle."},{"name":"SYLPHIE","text":"Hmmm. That surge of power I felt is gone as well. I don't think it's a coincidence that it faded as soon as Gatty left..."},{"name":"SYLPHIE","text":"Whenever she panics, I feel her aura just kind of <span class=\"emphasis\">expand</span>─and I think the voidsent sense it too. And I'd wager three afternoons of listening to Hearer Nolanel's lectures that the presence of those fiends is what's upsetting the elementals."},{"name":"SYLPHIE","text":"Right, then. It's time we returned to Gridania and reported our findings to the guildmaster."},{"name":"SYLPHIE","text":"I did my best to explain to the guildmaster what happened in East End..."},{"name":"ESUMIYAN","text":"I have heard Sylphie's report, and you are both to be commended for pursuing this investigation in so dangerous an area."},{"name":"ESUMIYAN","text":"Judging by your description of Gatty's unusually potent aura, I am inclined to agree with the theory that it is her energies which are attracting the voidsent."},{"name":"ESUMIYAN","text":"If, as you suspect, the child lives alone with her mother, then it is unlikely she has been trained to control her power. Fear, panic, anger─any strong emotion might cause her aether to flare dramatically. To the ravenous creatures of the void, the “scent” of such outbursts would be as the sweetest of nectar..."},{"name":"SYLPHIE","text":"So, if Gatty were to learn control, then the problem would be solved, wouldn't it?"},{"name":"ESUMIYAN","text":"We have assumed much, but know little. Without understanding the exact nature of the girl's gifts, I hesitate to propose a solution..."},{"name":"SYLPHIE","text":"She said she lived in the forest. I'll head out with the serpent patrols again and see if I can't find her house."},{"name":"ESUMIYAN","text":"A fine idea.<br><span class=\"highlight\">Forename</span>, pray continue lending Sylphie any support she might require."},{"name":"SYLPHIE","text":"Come on. Let's head back to Castrum Oriens, and we can talk about what to do next."},{"name":"ESUMIYAN","text":"Sylphie has conducted herself admirably thus far, but I am nevertheless reassured to know that you are keeping an eye on her efforts."},{"name":"SYLPHIE","text":"The guildmaster is right: we need to learn more about Gatty herself."},{"name":"SYLPHIE","text":"I mean, how can a little girl like her have the kind of power that attracts voidsent...? Well, first things first, I'll need to find where she lives. And then hopefully she and her mother will be willing to talk to us."},{"name":"SYLPHIE","text":"Do you think we'll be facing more fiends before this is all over? I should probably be practicing my spells..."}],"reward":{"gil":1396,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":25}],"quests":[67950]},"next":[67952]},"partials":[{"type":"npc","id":"1018753","obj":{"i":1018753,"n":"Sylphie","l":2406,"q":4}},{"type":"npc","id":"1000692","obj":{"i":1000692,"n":"E-Sumi-Yan","l":53,"q":19,"t":"Guildmaster"}},{"type":"npc","id":"1018757","obj":{"i":1018757,"n":"Sylphie","l":2406,"q":1}},{"type":"npc","id":"1018758","obj":{"i":1018758,"n":"Strange Child","l":2406,"q":1}},{"type":"npc","id":"1018763","obj":{"i":1018763,"n":"Sylphie","l":2406,"q":1}},{"type":"npc","id":"1018764","obj":{"i":1018764,"n":"Sylphie","l":53,"q":1}},{"type":"quest","id":"67950","obj":{"i":67950,"n":"Unease in East End","g":153,"l":"South Shroud","s":601,"f":1}},{"type":"quest","id":"67952","obj":{"i":67952,"n":"A Beacon for Bad Things","g":153,"l":"The Fringes","s":650,"f":1}}]}