{"quest":{"name":"The Magic Number","location":"Gridania","id":67956,"patch":3.5,"sort":126,"repeatable":1,"icon":100630,"eventIcon":71222,"issuer":1018722,"target":1018722,"involved":[1000100,1000972,1001353],"genre":196,"journal":["Hortefense has the look of a man with a plan.<br>※This quest is available for a limited time only.","Hortefense encourages you to practice your newly acquired smooching skills on the proprietors of each Adventurers' Guild, in the hope that the experience will ready you for your one true love. You make tracks for the Carline Canopy, to share some festive feelings with friends─although your method of expressing said sentiments may not be quite what they were expecting.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Upon arriving at the Carline Canopy, you promptly set about blowing a barrage of kisses at your guildmaster of choice. Unsurprisingly, this doesn't go down quite as smoothly as a simple handshake might have. Nevertheless, you are confident the message was received and set off for your next destination: the Quicksand.","Much like in Gridania, the guildmaster you express your gratitude to in the Quicksand is somewhat confounded, but ultimately flattered by your actions. It is up to you whether or not you decide to think up a slightly more conventional way of sharing your thanks, or simply double down on blowing kisses. You ponder this weighty issue as you head for the Drowning Wench.","Love is more than a feeling, which is something the guildmasters well and truly know by this point. Some of them even begin to wonder if you haven't gone a bit strange in the head, but all misunderstandings are sorted out in the end. Having visited all three proprietors' establishments, you return to Mih Khetto's Amphitheatre to regale Hortefense with tales of your oh-so-romantic travels.","Hortefense is delighted to hear that you have gone to great pains to master the time-honored House Valentione art of doting, and declares you free to go forth and capture the heart of your special someone. If you still don't feel confident in your ability to dote, mayhap you should try visiting your favored guildmaster─or masters─again before the season comes to a close."],"objectives":["/dote on a guildmaster in the Carline Canopy.","/dote on a guildmaster in the Quicksand.","/dote on a guildmaster in the Drowning Wench.","Report to Hortefense."],"dialogue":[{"name":"HORTEFENSE","text":"Now that you have learned the art of doting, 'tis time you put it to good use. As you may know, blowing a kiss in the direction of the apple of your eye requires unspeakable courage─which is why I propose you practice first!"},{"name":"HORTEFENSE","text":"To that end, I suggest you visit those who have supported you on your adventures thus far and express your appreciation. I speak of the three proprietors of Eorzea's Adventurers' Guild, of course! I know I certainly would never have found true love if not for the encouragement of mine own friends!"},{"name":"HORTEFENSE","text":"Surely, naught could go amiss were you to give your favorite guildmaster or mistress a kiss─or two, or even three!─as an expression of your gratitude. Yes, I can imagine no way they could possibly misconstrue your actions. "},{"name":"HORTEFENSE","text":"To begin with, why not head to the Carline Canopy? It's right in the neighborhood, and I hear that Baderon and Momodi have joined Mother Miounne there to partake in the festivities. Word has it that they shall also be heading to the Quicksand and the Drowning Wench later."},{"name":"HORTEFENSE","text":"Are you perchance still feeling too shy to share your innermost feelings with your true love? If you feel you are in need of more practice, why not pay another visit to the proprietors of the Adventurers' Guilds? They may appreciate the continued display of affection."},{"name":"HORTEFENSE","text":"Take heart, friend! Keep at it and eventually it will become second nature. Now, go forth once more and deliver some seasonal cheer to the guildmasters."},{"name":"HORTEFENSE","text":"Why do you tarry, friend? There is a whole new world of ardor and affection just waiting for you out there! Go and practice sharing your deepest emotions with your friends, that one day you will be prepared to share your soul with the one you hold dearest."},{"name":"MIOUNNE","text":"Ah, is it truly that time of year once more? I cannot say I have had much occasion to celebrate Valentione's Day in recent years, but there certainly is something to be said for sharing your feelings with those dearest to you."},{"name":"BADERON","text":"'Ad to come 'ere to sort out some guild business, but bloody 'ells those trees sure let ye know yer in Gridania. Really clogged up me nose, they 'ave. Aye, there's no doubt in me mind─I'm a Limsa man and ever will be!"},{"name":"MOMODI","text":"I'm just here to handle some guild matters, but I managed to snag a pipin' hot cup of tea from Mother Miounne on the side. It's the little things in life!"},{"name":"MIOUNNE","text":"Why, <span class=\"highlight\">Forename</span>! Whatever has gotten into you? I know 'tis the season for love, but I had always thought our own relationship to be more...professional."},{"name":"MIOUNNE","text":"It was simply an expression of your appreciation, you say? I must admit, you startled me somewhat, but I am touched by the sentiment."},{"name":"MIOUNNE","text":"Though truly, I have done nothing so significant to be deserving of such...profuse affection. On the contrary, it is <span class=\"emphasis\">I</span> who should thank <span class=\"emphasis\">you</span> for all you have done on behalf of Gridania and our realm. I hope we can continue to count on you for years to come, <span class=\"highlight\">Forename</span>."},{"name":"MIOUNNE","text":"Though truly, I have done nothing so significant to be deserving of such...profuse affection. On the contrary, it is <span class=\"emphasis\">I</span> who should thank <span class=\"emphasis\">you</span> for all you have done on behalf of Gridania and our realm. I hope we can continue to count on you for years to come."},{"name":"BADERON","text":"Oi! What in the 'ells do ye think yer doin'!? Did I look like I was standin' 'ere just waiting for a big sloppy one!?"},{"name":"BADERON","text":"Just yer way o' sayin' <span class=\"emphasis\">thanks</span>, ye say? Well, I guess it is the season fer it... Didn't 'alf startle me clean out of me boots, mind ye!"},{"name":"BADERON","text":"Not that I'm complainin' that someone finally decided to thank me for doin' this job. Yer a good <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, <span class=\"highlight\">Forename</span>."},{"name":"BADERON","text":"Anyroad, I best be on me way. Got a guild meeting to attend, as it 'appens. Do pop in the Drowning Wench next time yer in Limsa."},{"name":"MOMODI","text":"<span class=\"highlight\">Forename</span>...? Are you feelin' quite all right? If I didn't know better, I could've sworn you just tried to <span class=\"emphasis\">kiss</span> me!"},{"name":"MOMODI","text":"Your way of sayin' <span class=\"emphasis\">thanks</span>!? Listen, it's not that I don't appreciate the sentiment, but don't you think the season's gone to your head a bit?"},{"name":"MOMODI","text":"Mind you, it has given me a nice little boost─and somethin' to smile about once the day's done! You may have an odd way of expressin' yourself, but I could get used to being thanked every now and then."},{"name":"MOMODI","text":"Anyroad, it's about time for me to head off! Got a guild meeting scheduled, and you know they can't start without Ul'dah's most fiery desert rose."},{"name":"MIOUNNE","text":"My duties with the guild frequently bring me to Ul'dah. 'Tis a fine city indeed, but this heat can be quite trying compared to the more temperate climes of Gridania. Yes, the forest will ever be my home."},{"name":"BADERON","text":"I always stop off 'ere to scoff some grub whenever I'm in Ul'dah. 'Aven't the faintest who Momodi 'as workin' the kitchens, but she chose well, I reckon."},{"name":"MOMODI","text":"Your, ah...<span class=\"emphasis\">creative</span> gesture of thanks back there got me thinkin'─there's somethin' to be said for takin' the time to express our true feelings to those around us. And I reckon Valentione's Day's as good a time as any to do it. Don't suppose you'd happen to have anyone in mind?"},{"name":"BADERON","text":"Why, <span class=\"highlight\">Forename</span>! Whatever 'as gotten into you? I know 'tis the season for love, but I 'ad always thought our own relationship to be more...professional."},{"name":"MIOUNNE","text":"It was simply an expression of your appreciation, you say? I must admit, you startled me somewhat, but I am touched by the sentiment."},{"name":"MIOUNNE","text":"It warms my heart that we can count an adventurer as delightful as yourself among our ranks. Pray continue to grace us with your charming presence."},{"name":"MIOUNNE","text":"I would love to stay and chat a while longer, but alas, I have a guild meeting I must attend. I look forward to seeing you again at the Canopy in the not-too-distant future, friend!"},{"name":"MIOUNNE","text":"Why, <span class=\"highlight\">Forename</span>! I do not mean to spurn your gratitude, but you are making me blush..."},{"name":"MIOUNNE","text":"Truly, I have done naught so special as to deserve such a grand display of thanks. It is an honor being able to serve adventurers such as yourself─an honor I hope to continue to be blessed with for many years to come."},{"name":"MIOUNNE","text":"Speaking of which, there is one last guild meeting for me to attend before the <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span> is over. Farewell for now."},{"name":"BADERON","text":"Again!? Look, I get that yer grateful, I really do, but if yer expectin' me to treat you to a tankard o' me finest on the house, ye can think again!"},{"name":"BADERON","text":"The guild's me job, after all, an' it's adventurers like you what do the dirty work. If ye really must show your appreciation, what say ye buy ol' Baderon a flagon of ale next time?"},{"name":"BADERON","text":"Anyroad, I'd best be movin' on. Plenty o' guild dealin's still to be done, and someone 'as to do the doin'. Till next time, <span class=\"highlight\">Forename</span>."},{"name":"MOMODI","text":"<span class=\"highlight\">Forename</span>...? Are you feelin' quite all right? If I didn't know better, I could've sworn you just tried to <span class=\"emphasis\">kiss</span> me!"},{"name":"MOMODI","text":"Your way of sayin' <span class=\"emphasis\">thanks</span>!? Listen, it's not that I don't appreciate the sentiment, but don't you think the season's gone to your head a bit?"},{"name":"MOMODI","text":"You won't find me blowin' kisses in your direction, but don't get me wrong─I'm grateful to you all the same. You're a shinin' star to adventurers the realm over, and I hope you'll continue to shine bright for years to come."},{"name":"MOMODI","text":"Look, now. The sentiment's touchin' and all, but do you think you could find a more...<span class=\"emphasis\">subtle</span> way of expressin' it? People might get the wrong idea."},{"name":"MOMODI","text":"It is nice though, bein' thanked now and then, and your timin' is spot on given the season! You know what, you might be onto something here..."},{"name":"MOMODI","text":"Think up a slightly more <span class=\"emphasis\">normal</span> way of showin' your gratitude and I'd be more than glad to be thanked a hundred times over! You'd be setting a good example for all the other adventurers in the Quicksand too. You know, maybe it wouldn't hurt if you stopped by a little more often."},{"name":"MIOUNNE","text":"The food at the Drowning Wench really has a special something to it, don't you think? I always make a point of stopping by when business brings me to Limsa Lominsa. The cuisine truly spurs me on to better the Canopy's dishes."},{"name":"BADERON","text":"Valentione's Day is great an' all, but it doesn' 'alf distract me workers from the task at 'and. I ain't payin' ye people to wander around in a lovey-dovey stupor!"},{"name":"MOMODI","text":"The climate here is a welcome change to the swelterin' winds of Thanalan, for sure. Although I can't say I'm too keen on that smell of what I'm guessing is...rotting fish?"},{"name":"MIOUNNE","text":"I suppose they do say the third time's a charm, but you're starting to make me feel somewhat flustered. Have I truly done enough to warrant all these displays of gratitude?"},{"name":"MIOUNNE","text":"Not that I meant to say your gesture is unwelcome. It is up to me to prove that I am worthy of your thanks."},{"name":"MIOUNNE","text":"Speaking of which, I must get back to the Canopy. I have no doubt there will be plenty of adventurers there waiting for a nice hot cup of tea. Well, <span class=\"highlight\">Forename</span>, I suppose I shall see you again sometime soon."},{"name":"BADERON","text":"Oi! What in the 'ells do ye think yer doin'!? Did I look like I was standin' 'ere just waiting for a big sloppy one!?"},{"name":"BADERON","text":"Just yer way o' sayin' <span class=\"emphasis\">thanks</span>, ye say? Well, I guess it is the season fer it... Didn't 'alf startle me clean out of me boots, mind ye!"},{"name":"BADERON","text":"Not that I mean to belittle yer gesture, o' course! It's nice that someone finally decided to thank me for doin' this job. Much obliged, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I look forward to yer continued patronage o' the Wench."},{"name":"BADERON","text":"Again!? Look, I get that yer grateful, I really do, but if yer expectin' me to treat you to a tankard o' me finest on the house, ye can think again!"},{"name":"BADERON","text":"The guild's me job, after all, an' it's adventurers like you what do the dirty work. If ye really must show your appreciation, what say ye buy ol' Baderon a flagon of ale next time?"},{"name":"BADERON","text":"And I would 'ave ye know, I'm just as grateful for ye too─even though I might not be the best at showin' it. Just remember, there'll always be a seat for ye in me tavern, <span class=\"highlight\">Forename</span>. Ye can count on that."},{"name":"BADERON","text":"I could've sworn we agreed ye'd treat me to some ale the last time we met. More importantly, don't ye 'ave anyone else ye fancy showerin' with yer love fer a change? Honestly, seems yer gratitude is as bottomless as the flagons at this very tavern!"},{"name":"BADERON","text":"Which ain't to say I don't appreciate the sentiment. Yer sheer tenacity shows I must be doin' somethin' right─and I'll do me best to make sure I keep it up!"},{"name":"BADERON","text":"Stop by whenever yer thirsty for the realm's finest ale, <span class=\"highlight\">Forename</span>! Heck, maybe if yer lucky, I'll bump into ye on the road somewhere."},{"name":"MOMODI","text":"Look, now. The sentiment's touchin' and all, but do you think you could find a more...<span class=\"emphasis\">subtle</span> way of expressin' it? People might get the wrong idea."},{"name":"MOMODI","text":"It is nice though, to be thanked now and then─and your timin' is spot on given the season! You know what, think up a slightly more <span class=\"emphasis\">normal</span> way of showin' your gratitude, and I'd be more than glad to be thanked a hundred times over!"},{"name":"MOMODI","text":"It's time I was on my way, anyroad. Plenty of guild matters to get to! No doubt I'll be seeing you in the Quicksand again soon─no one can resist its call for too long!"},{"name":"MOMODI","text":"Look, <span class=\"highlight\">Forename</span>, I appreciate the attention and all, but are you seriously tellin' me there ain't anyone else out there you should be thankin'?"},{"name":"MOMODI","text":"Let me guess...you've not been so lucky in love lately? Don't feel like you can't open up to me about your worries─I know a thing or two when it comes to matters of the heart!"},{"name":"MOMODI","text":"Sadly I can't help you <span class=\"emphasis\">right</span> now, as work calls, dear <span class=\"highlight\">Forename</span>! But don't forget, I'm always around if you need someone to talk to."},{"name":"HORTEFENSE","text":"Welcome back, adventurer! The rosy hue of your cheeks gives me the most tantalizing of glimpses into the journey of romance and passion you have embarked upon."},{"name":"HORTEFENSE","text":"But this is no time to be resting on your laurels! The moment you have been working towards is finally at hand. Go forth and lay your heart bare to the one for whom you pine!"},{"name":"MIOUNNE","text":"Oh...<span class=\"highlight\">Forename</span>. I was hoping I might find you here. Your displays of gratitude gave me pause for thought, and before I knew it, I was making my way to this very spot."},{"name":"MIOUNNE","text":"I could not help myself from wondering how best to prove that I am worthy of your thanks. It is somewhat embarrassing to admit, but it has even distracted me from my duties at the guild."},{"name":"MIOUNNE","text":"And yet the answer was staring me in the face the whole time. Or should I say, its aroma wafting up gently into my nose. I speak of tea, of course. I can think of no way more natural for me to support the guild's adventurers."},{"name":"MIOUNNE","text":"I simply need to make sure the Canopy continues to exist as a space where all those traveling through Eorzea may take respite. That is how it has always been and I pray it will never change."},{"name":"MIOUNNE","text":"Speaking of which, I should be getting back to the Canopy. Do stop by again when you feel in need of some respite from the road. I'll see to it you're served with a hot cup of tea which warms your heart, just as you have warmed mine."},{"name":"BADERON","text":"<span class=\"highlight\">Forename</span>! Just the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> I was 'opin' to find. I'd been tryin' to make sense of all yer gestures o' thanks today and figured I'd just come and talk to ye meself."},{"name":"BADERON","text":"It 'as to be said though, being a middle-aged bloke on Valentione's Day can make ye feel a lot like ye've been left at sea.<br>...Mayhap it's time I found meself a comely wench to settle down with."},{"name":"BADERON","text":"Oi, don't ye give me that look, now! The thought of a bloody litter o' little Baderons runnin' about scares me just as much as anyone, believe you me."},{"name":"BADERON","text":"Besides, I already 'ave a family bein' in charge of this guild as it is! Aye, me 'ands are plenty full with green adventurers wanderin' in every day─never mind actual bloody children."},{"name":"BADERON","text":"And never forget that ye too are part of me adventurer family! Wenches are all well an' good, but I reckon that the most important one 'as been mine all along. Aye, she may be drownin', but we ain't all perfect."},{"name":"BADERON","text":"And I'll do me very best to make sure she's the finest of 'omes for all me adventurin' family. Speakin' o' the Wench, 'bout time I were 'eadin' back. I've left the pub in the 'ands of S'dhodjbi, and it's makin' me sweat to say the least. Don't forget to stop by again sometime soon, <span class=\"highlight\">Forename</span>!"},{"name":"MOMODI","text":"<span class=\"highlight\">Forename</span>! Just the person I was looking for! I was havin' a chuckle recallin' all your gestures today and decided I'd come pay you a visit─see if you hadn't thought up any new ways of showin' your gratitude."},{"name":"MOMODI","text":"It might not look like it, <span class=\"highlight\">Forename</span>, but believe it or not I do worry sometimes. I wonder whether or not all that I do is truly makin' a difference in the world, and that sort of thing."},{"name":"MOMODI","text":"But then I see the huge smiles on the faces of so many adventurers, just like you, and I think of all the good you do for the realm."},{"name":"MOMODI","text":"That's why I'm goin' to keep expressing my love through the Quicksand. In short: sorry, <span class=\"highlight\">Forename</span>, but if you felt anythin' other than gratitude for me, you'll have to give up─there's far too many other adventurers that need my attention!"},{"name":"MOMODI","text":"And on that note, it really is time I headed back. Lookin' forward to seein' your novel new way of expressin' your thanks the next time you visit me!"},{"name":"HORTEFENSE","text":"Although, judging by the look on your face, mayhap you are yet to discover your special someone? Pray wait a short while, dear adventurer, I have an idea. I shall return posthaste!"},{"name":"LISETTE","text":"Well, if it isn't House Valentione's favorite adventurer! Truly, we are ever in your debt for all you have done to help spread love across the land. Is there something you would ask of me?"},{"name":"HORTEFENSE","text":"Dearest Lissie, as you know, I have been trying to teach our friend how best to express the love that lies deep within. As I began to wonder if my earlier instructions were not somewhat lacking, it hit me─what better way to show <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> how it is done than with a demonstration of <span class=\"emphasis\">our</span> love!?"},{"name":"LISETTE","text":"...Sorry, <span class=\"emphasis\">what</span>?"},{"name":"HORTEFENSE","text":"We must needs have <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> see the romantic passion between us as it bubbles to the surface, before erupting, covering all in love's lava! Do you not agree, Lisette?"},{"name":"LISETTE","text":"Do you really think for one second I would do such a bleedin' ridiculous thing!? Are you sure just one adventurer's enough? Why don't we invite all of Eorzea to watch!?"},{"name":"HORTEFENSE","text":"'Tis no time to be getting cold feet, Lissie! The two of us have been bonded for eternity, to be one forevermore!<br>Or could it be─heavens, no! Has our love's candle had its ferocious flame <span class=\"emphasis\">extinguished</span>?"},{"name":"LISETTE","text":"What are you saying, you absolute nincompoop! Only someone as dull-witted as you would think such ridiculous things!<br>You know you're my...handsomest honeysuckle."},{"name":"HORTEFENSE","text":"Oh, Lissie! My love for you is as the waves crashing ceaselessly against the shore─nothing shall remain untouched by our sea of passion!"},{"name":"HORTEFENSE","text":"...Oh, still there, are you? My apologies for getting caught up in the moment. But heavens, you look like you've seen a ghost! As I have little else to teach you, mayhap 'tis time we put an end to this lesson. Let Menphina draw the curtain, as it were."},{"name":"HORTEFENSE","text":"But do not fret, bold adventurer! We shall ever be there for you if you find yourself wanting for more succor. Fare thee well!"}],"reward":{"items":[{"num":5,"id":6996},{"num":5,"id":6997}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67955]}},"partials":[{"type":"npc","id":"1018722","obj":{"i":1018722,"n":"Hortefense","l":53,"q":2}},{"type":"npc","id":"1000100","obj":{"i":1000100,"n":"Mother Miounne","l":52,"q":21,"t":"Carline Canopy Proprietress"}},{"type":"npc","id":"1000972","obj":{"i":1000972,"n":"Baderon","l":28,"q":26,"t":"Drowning Wench Proprietor"}},{"type":"npc","id":"1001353","obj":{"i":1001353,"n":"Momodi","l":40,"q":27,"t":"Quicksand Proprietress"}},{"type":"item","id":"6996","obj":{"i":6996,"n":"Prismatic Heart (Left)","l":1,"c":22630,"t":85,"p":8}},{"type":"item","id":"6997","obj":{"i":6997,"n":"Prismatic Heart (Right)","l":1,"c":21294,"t":85,"p":8}},{"type":"quest","id":"67955","obj":{"i":67955,"n":"Once More with Feeling","g":196,"l":"Gridania","s":125}}]}