{"quest":{"name":"Shock-full of Eggcitement","location":"North Shroud","id":67958,"patch":3.5,"sort":134,"icon":100632,"eventIcon":71221,"issuer":1019592,"target":1019592,"genre":199,"journal":["Nonotta wants you to keep the truth of the eggshilaration system a secret, cross your heart and hope to die.<br>※This quest is available for a limited time only.","You promise Nonotta not to reveal the eggshilaration system's true nature to Jihli. Her mind set at ease, she turns her attention back to the festivities, and directs you to speak with her fellow Dreamer Motte when you are ready to ride on eggback.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Motte gives you a rundown of the eggshilaration system's functionality, namely how to launch the shockobo. Hop on the egg now and use the shockobo on Nonotta.<br><br>※Speak with Motte at Hyrstmill to ride the eggshilaration system.","You use the shockobo on Nonotta, and it proves effective even on its creator, who shrieks out loud for the fright. Unfortunately, that effect was lost on Jihli, a result which has left Nonotta disheartened. For now, do your part in the festivities by seeking out three festival participants in the Twelveswood and startling them with the shockobo. Once you have three shock eggs for your troubles, deliver them to Nonotta.<br><br>※Speak with Motte at Hyrstmill to ride the eggshilaration system.","You have startled three people and earned three shock eggs. Take them back to Nonotta at Hyrstmill.","No sooner do you hand Nonotta the eggs than the three people you received them from come running up. In excited and appreciative tones, they tell of a rock-riding spriggan that gave them the shock of their lives. The news leaves Nonotta puzzled and perturbed, as spriggans aren't part of the plan. The creature in question has since headed to Gridania, and it seems likely that trouble will follow..."],"objectives":["Speak with Motte.","Ride the eggshilaration system and launch the shockobo at Nonotta.","Ride the eggshilaration system and launch the shockobo at festival participants.","Deliver the shock eggs to Nonotta."],"dialogue":[{"name":"NONOTTA","text":"So, I take it you'll keep the eggshilaration system's true nature a secret?"},{"name":"NONOTTA","text":"You've put my mind at ease! With that settled, let's get you on eggback, shall we? Motte yonder will assist you; let her know when you are ready."},{"name":"MOTTE","text":"You wish to ride the eggshilaration system? But of course!"},{"name":"MOTTE","text":"Hop on, and you should see a button. That's for launching the shockobo, a lifelike, shock-inducing chocobo doll. Why don't you try using it now on Nonotta? She won't mind, trust me!"},{"name":"SYSTEM","text":"Launch the shockobo at Nonotta to give her a fright. The action can be selected from the <span class=\"highlight\">pet hotbar</span>."},{"name":"NONOTTA","text":"Motte yonder will help you onto the eggshilaration system; let her know when you are ready."},{"name":"NONOTTA","text":"Uwaaah! Oh, my goodness... The shockobo never fails to work on me, and it's <span class=\"emphasis\">my</span> brainchild."},{"name":"NONOTTA","text":"&lt;sigh&gt; If only it worked half as well on Jihli... When we used it on her, she simply chuckled and said, “Such a sense of humor the Archons must have had!”"},{"name":"NONOTTA","text":"Ack, but I shouldn't complain. Suffice it to say none of this is for Jihli's ears."},{"name":"NONOTTA","text":"At any rate, the show must go on. And from this point on, your role in the festivities begins in earnest."},{"name":"NONOTTA","text":"Festival participants are scattered throughout the Twelveswood. Find them and startle them silly with the shockobo. In return they'll give you shock eggs, which you can exchange for unique prizes."},{"name":"NONOTTA","text":"To begin with, try startling, say, three people. When you have their eggs, bring them back to me."},{"name":"NONOTTA","text":"Ah, the very image of Jihli's vision! Now, you handle the egg like an Archon, but how well can you handle the shockobo?"},{"name":"MOTTE","text":"Oh? Fell off the egg, did you? Never you mind─given the shape, it's bound to happen. Here, let me help you back on."},{"name":"ACTOR02422","text":"Uwaaah! Twelve have mercy! 'Tis a demon bird, risen from the seventh hell to reave my soul! Woe is me! I am...I am undone!"},{"name":"ACTOR02422","text":"...Well, how was it? My performance, that is. I'm an aspiring actor, you see, and I joined in Hatching–tide so I could practice my craft. Next time, I believe I'll explore...denial. Yes, just a hint to add depth to the character's vulnerabilities."},{"name":"ACTOR02422","text":"Ah, but before I forget, this shock egg's for you. And with that, it's back to rehearsing for me."},{"name":"MAN02422","text":"Gah! S-Seven hells, I swear it's worse when you know it's comin'. So, er, what happens now? The chocobo lays a gemstone?"},{"name":"MAN02422","text":"...No? Should've known it was too good to be true. More's the pity─was the main reason I volunteered for this. You can't put much store by dreams, bad as I feel for that Jihli lass."},{"name":"MAN02422","text":"Anyroad, here's your shock egg. Gotta hand out as many as I can if I wanna collect my prize."},{"name":"WOMAN02422","text":"Eeeeeek! M-My heart fairly stopped. After so many frights, you think you'd get used to it..."},{"name":"WOMAN02422","text":"But I must say, the egg never ceases to amaze me. How in the world do they make it hover like that?"},{"name":"WOMAN02422","text":"Oh, but I owe you a shock egg, for a fine shock rendered. Loud as I scream each time, I find the sensation quite addictive. My thanks, adventurer!"},{"name":"NONOTTA","text":"You seem to have mislaid the egg, adventurer. Pun intended. Talk to Motte, and she'll help you back on it."},{"name":"ACTOR02422","text":"Won't someone launch a shockobo at me already? I'm itching to test out a new variation on a theme of “startled.”"},{"name":"MAN02422","text":"If you're not gonna fire a shockobo at me, bugger off. I've got shock eggs I need to give out."},{"name":"WOMAN02422","text":"Oh, where's my next shock coming from? The suspense is too much to bear!"},{"name":"NONOTTA","text":"Ah, welcome back. Have your startling efforts met with success, and you have the shock eggs to show for it?"},{"name":"NONOTTA","text":"Three eggs, precisely as ordered! You've done well, my friend."},{"name":"ACTOR02422","text":"Miss Dreamer! Miss Dreamer!"},{"name":"WOMAN02422","text":"Hells' bells, that was a shock an' a half! You never mentioned there'd be others out there tryin' to startle us!"},{"name":"NONOTTA","text":"Others? Whatever are you talking about?"},{"name":"MAN02422","text":"The spriggan ridin' a rock, what else? Fella appeared without warnin' an' gave me the fright of my life. I fair soiled myself!"},{"name":"ACTOR02422","text":"I as well! It was all so real and visceral, I didn't even have to act! Joining in the festival was the best decision ever!"},{"name":"WOMAN02422","text":"Hear, hear! Ah, but the exquisite flush of the fright begins to fade. I'll need another one soon. Perhaps if I were to follow the spriggan to Gridania... Oh, and thank you, Miss Dreamer! I haven't had this much fun in a long while!"},{"name":"NONOTTA","text":"Er...y-you're welcome?"},{"name":"NONOTTA","text":"Um, adventurer? Rock-riding spriggans aren't part of the plan, and I have a terrible feeling about this. We may have need of your aid beyond simply startling townsfolk."},{"name":"MOTTE","text":"How fares the startling effort, adventurer? When you've collected three shock eggs, be sure to take them to Nonotta."}],"reward":{"gil":220,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[67957]},"next":[67959]},"partials":[{"type":"npc","id":"1019592","obj":{"i":1019592,"n":"Nonotta","l":57,"q":3}},{"type":"quest","id":"67957","obj":{"i":67957,"n":"When Eggs Fly","g":199,"l":"Gridania","s":133}},{"type":"quest","id":"67959","obj":{"i":67959,"n":"Eggsistential Crisis","g":199,"l":"North Shroud","s":135}}]}