{"quest":{"name":"The Problem with Padjals","location":"The Fringes","id":67953,"patch":4.0,"sort":680,"icon":100679,"unlocksFunction":1,"eventIcon":71341,"issuer":1018753,"target":1019132,"involved":[1019094,1019095,1019123,1019125,1019128,1019129,1019130,1019131],"genre":153,"journal":["Sylphie seems distressed.","Sylphie laments the difficulty of teaching Gatty while Sanche's health is in decline, and asks that you lend her your talents. Make your way into Dimwold, and assess the situation.","You arrive outside Gatty's home to find E–Sumi–Yan berating a sheepish Sylphie. Gatty and Sanche, however, are nowhere to be found. Fearing that the two have fled the guildmaster's approach only to invite further disaster, you rush off in pursuit. Travel north, and search the shallows of the Velodyna River.","You locate Gatty and Sanche just in time to rescue them from another voidsent attack. E–Sumi–Yan arrives a short while after with Sylphie in tow, and suggests returning to the cabin to discuss what the future holds.","After considering Gatty's unique situation, E–Sumi–Yan decides to permit you and Sylphie to continue the young Padjal's education at home. Head outside and discuss this development with Sylphie.","Sylphie is delighted by the guildmaster's decision, and thanks you for the part you've played in allowing Gatty to remain with her mother. But there is still much work to be done before the girl learns complete control over her aether─show Gatty a good example, and continue to improve upon your own skills.<br><br>※The next white mage quest will be available from Sylphie upon reaching level 70."],"objectives":["Head to Fletcher's Cabin.","Search for Gatty and Sanche.","Speak with E–Sumi–Yan at Fletcher's Cabin.","Speak with Sylphie."],"dialogue":[{"name":"GATTY","text":"<span class=\"highlight\">Forename</span>! I'm working hard at my studies with Sylphie! Will you be teaching me about magic, too?"},{"name":"SANCHE","text":"I still have my reservations about this idea, but Gatty seems to be taking to her lessons eagerly enough. She looks forward to your every visit."},{"name":"SYLPHIE","text":"Oh, <span class=\"highlight\">Forename</span>, am I glad to see you! I'm at my wit's end..."},{"name":"SYLPHIE","text":"（★未使用／削除予定★）"},{"name":"SYLPHIE","text":"Every day I've worked conjury upon Sanche, and she's drinking a potent herbal elixir I had delivered from Gridania. But still her condition worsens..."},{"name":"SYLPHIE","text":"And watching her mother's health decline is not helping Gatty to master her magicks─voidsent have been drawn by her untamed aether a few times now, and I've just barely managed to fight them off."},{"name":"SYLPHIE","text":"I've reached my limits to be quite honest, and I think Gatty would benefit from your calming presence. Will you come with me back to their cabin?"},{"name":"SYLPHIE","text":"Brother E–Sumi–Yan has found us out, <span class=\"highlight\">Forename</span>. I'm sorry for dragging you into this..."},{"name":"ESUMIYAN","text":"Did I not make myself sufficiently clear, Sylphie? My permission was contingent upon your promise to refrain from rash and thoughtless action."},{"name":"SYLPHIE","text":"Yes, Guildmaster, and I've done my best to fulfill that promise. I swear, I gave this matter a great deal of thought before deciding it was the best way for everyone!"},{"name":"ESUMIYAN","text":"...I will not doubt your sincerity, acolyte. But imagine my surprise when I was informed of your request for an advanced elixir. No mention of such was included in your reports, and thus did I come to investigate."},{"name":"ESUMIYAN","text":"And now I find you concealing the presence of a Padjal─even from a distance, the nature of Gatty's aura was unmistakable. A Padjali child without guidance is an exceedingly dangerous thing, Sylphie. You know this."},{"name":"ESUMIYAN","text":"Her aether, wild and radiant, will grow even as she does...and so too shall the power of the fiends which gather to feed upon it. Should Gatty draw the attention of a greater voidsent, the entire region would suffer from its depredations."},{"name":"SYLPHIE","text":"I've seen what happens─the worst episodes are when she's overcome by fear for her mother's health. That's why I judged it safer to keep them together!"},{"name":"ESUMIYAN","text":"Ah, Sylphie...<br>I had almost forgotten that stubborn streak of yours. But I do recognize that responsibility for this situation falls not upon your shoulders alone: 'twas my failing as guildmaster to have overlooked the birth of a Padjal in the first place."},{"name":"SYLPHIE","text":"...Will you take Gatty back to Stillglade Fane, now?"},{"name":"ESUMIYAN","text":"Such was my intention. I followed the whispers through the forest, yet by the time I arrived here the house already lay empty. They may have marked my approach."},{"name":"SYLPHIE","text":"You mean they're not here!? Sanche shouldn't be walking around with her condition! Her heart is too weak for that kind of exertion..."},{"name":"ESUMIYAN","text":"Then we must waste no time in tracking them down, and not only for Sanche's well-being─Gatty's concern for her mother could consume her at any moment. Do you know where they might have gone?"},{"name":"SYLPHIE","text":"If they meant to avoid us, then heading north to cross the shallows of the Velodyna River would be their only choice. We should hurry!"},{"name":"SANCHE","text":"<span class=\"highlight\">Forename</span>, thank the gods! I had one of my turns─just a mild one─and Gatty began to panic. We tried to run, but the voidsent..."},{"name":"GATTY","text":"<span class=\"highlight\">Forename</span>, you're here...<br>There were strange whispers coming from everywhere around the house... &lt;sob&gt; I got scared, so we ran away..."},{"name":"ESUMIYAN","text":"You must be Gatty. Those whispers you heard were the voices of the elementals─you need not fear them, though it was wise to heed their warning."},{"name":"SANCHE","text":"You...you're B-Brother E–Sumi–Yan! What do you want with us!?"},{"name":"ESUMIYAN","text":"'Tis clear that you are well aware of my purpose here. And I understand that you are disinclined to trust the words of a conjurer..."},{"name":"ESUMIYAN","text":"But pray believe me when I say that neither Sylphie nor <span class=\"highlight\">Forename</span> betrayed their promise to you."},{"name":"ESUMIYAN","text":"Simply put, Gatty's aether has grown too strong to be concealed. I suggest we return to the house and discuss how best to resolve this quandary─a solution to which we all might agree."},{"name":"GATTY","text":"It's all right, Mama. The angry whispers are quiet now. We can go home."},{"name":"SANCHE","text":"If Gatty says it's all right, then I suppose we should go."},{"name":"GATTY","text":"I've never seen anyone with horns like mine before...<br>He feels like the ground at the end of a summer's day─warm and comforting. I like him."},{"name":"SANCHE","text":"The guildmaster used his art to ease the pain in my chest. I feel much better...but he will not convince me to give up Gatty so easily."},{"name":"ESUMIYAN","text":"Brother E–Sumi questioned Gatty and her mother the whole way back. He said that Gatty's connection to her magic is entirely instinctual, which is not exactly a safe method for a child..."},{"name":"ESUMIYAN","text":"From what Gatty and her mother have told me, the girl has received no formal guidance in how to contain her aether."},{"name":"ESUMIYAN","text":"Gatty's Padjali instincts allow her to suppress her aura when calm, but that will become increasingly difficult as her power grows with age. Eventually, even the briefest onslaught of emotion─a surge of anger, a whisper of fear─will be enough to shatter her control."},{"name":"SYLPHIE","text":"And that's why I thought it best to teach Gatty here at home. Unlike other Padjal, she's lived her whole life with her mother."},{"name":"SYLPHIE","text":"Taking her away from Sanche now would be disastrous. I know only too well the effect such a separation can have on a child..."},{"name":"SYLPHIE","text":"You agree with me, don't you, <span class=\"highlight\">Forename</span>? Or do you think we should follow the letter of Gridania's law!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"There are always exceptions to the rule!"},{"name":"A1","text":"We should leave the decision to Brother E–Sumi–Yan."},{"name":"ESUMIYAN","text":"You side with Sylphie in this matter? ...Truth be told, I find myself in agreement."},{"name":"ESUMIYAN","text":"Then I shall choose what is best for the Twelveswood. ...And in this case, I find myself siding with Sylphie."},{"name":"ESUMIYAN","text":"Gatty's upbringing is an extremely rare case amongst the Padjal. It seems that it may, indeed, be the lesser risk to allow the girl to remain with her mother..."},{"name":"SYLPHIE","text":"Then, does this mean─!?"},{"name":"ESUMIYAN","text":"...However, if we are to avoid an escalation of these attacks, I must insist that Gatty learn the intricacies of her power under the official supervision of the Conjurers' Guild."},{"name":"ESUMIYAN","text":"Acolyte Sylphie. I hereby assign you the duty of overseeing the Padjal Gatty's formal education at this abode."},{"name":"ESUMIYAN","text":"Your status as a member of the guild should satisfy the demands of law and custom. And be sure to thank <span class=\"highlight\">Forename</span> for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> assistance─I would not have permitted this breach of tradition were you not accompanied by a white mage of such high standing."},{"name":"SYLPHIE","text":"I won't let you down, Guildmaster! Or the Conjurers' Guild!"},{"name":"ESUMIYAN","text":"Pray understand that this ruling comes with a caveat: if Gatty does not show marked improvement within the time period I dictate, then I shall be forced to relocate her to Stillglade Fane."},{"name":"SANCHE","text":"Thank you, Brother E–Sumi! This means so much to us!"},{"name":"ESUMIYAN","text":"Gatty... I see you are a kind child who cares deeply for her mother. Yet you must not lose yourself in another's life."},{"name":"ESUMIYAN","text":"Look within, and master the magicks which infuse you. Show you are capable of controlling your own destiny, and make your mother proud."},{"name":"GATTY","text":"I will! I'll do anything to make Mama happy. And I don't want to disappoint Sylphie or <span class=\"highlight\">Forename</span> either!"},{"name":"ESUMIYAN","text":"Very well. I will return to Gridania immediately and prepare an education manual for Sylphie."},{"name":"SYLPHIE","text":"I'll see the guildmaster on his way. If you need me, I'll be waiting outside."},{"name":"GATTY","text":"I'll study really hard, you'll see! Mama will be so proud of me!"},{"name":"SANCHE","text":"For so long have I avoided just such a confrontation. I...did not expect Brother E–Sumi to be so understanding."},{"name":"SYLPHIE","text":"I'm so glad that Sanche and Gatty can still live together. Thank you, <span class=\"highlight\">Forename</span>. Things might have gone very differently if I hadn't had you around to help."},{"name":"SYLPHIE","text":"Still, we have to make sure that Gatty learns to control her aether before too long. We can only expect so much leniency from Brother E–Sumi..."},{"name":"SYLPHIE","text":"I say we keep working away at our own studies as much as we can, and give Gatty a good example to follow!"},{"name":"SANCHE","text":"（★未使用／削除★）"}],"reward":{"gil":845,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":25}],"quests":[67952]},"next":[67954]},"partials":[{"type":"npc","id":"1018753","obj":{"i":1018753,"n":"Sylphie","l":2406,"q":4}},{"type":"npc","id":"1019132","obj":{"i":1019132,"n":"Sylphie","l":2406,"q":2}},{"type":"npc","id":"1019094","obj":{"i":1019094,"n":"Gatty","l":2406,"q":2}},{"type":"npc","id":"1019095","obj":{"i":1019095,"n":"Sanche","l":2406,"q":2}},{"type":"npc","id":"1019123","obj":{"i":1019123,"n":"Sanche","l":2406,"q":2}},{"type":"npc","id":"1019125","obj":{"i":1019125,"n":"E-Sumi-Yan","l":2406,"q":1}},{"type":"npc","id":"1019128","obj":{"i":1019128,"n":"Gatty","l":2406,"q":1}},{"type":"npc","id":"1019129","obj":{"i":1019129,"n":"Sanche","l":2406,"q":1}},{"type":"npc","id":"1019130","obj":{"i":1019130,"n":"Sylphie","l":2406,"q":2}},{"type":"npc","id":"1019131","obj":{"i":1019131,"n":"E-Sumi-Yan","l":2406,"q":1}},{"type":"quest","id":"67952","obj":{"i":67952,"n":"A Beacon for Bad Things","g":153,"l":"The Fringes","s":650,"f":1}},{"type":"quest","id":"67954","obj":{"i":67954,"n":"What She Always Wanted","g":153,"l":"The Fringes","s":700,"f":1}}]}