{"quest":{"name":"A Beacon for Bad Things","location":"The Fringes","id":67952,"patch":4.0,"sort":650,"icon":100679,"unlocksFunction":1,"eventIcon":71341,"issuer":1018753,"target":1018753,"involved":[1019086,1019087,1019088,1019090,1019092,1019094,1019095],"genre":153,"journal":["Sylphie is eager to resume the search for Gatty.","Sylphie explains that although she has spotted Gatty on several occasions, the girl always flees before she has a chance to speak to her. Using the whispers of the elementals as a guide, Sylphie is convinced that Gatty will soon be found again. Head to the area where she last saw the elusive child and begin another search.","As you scan the area, Sylphie senses a thread of unease to the south. Follow the acolyte and continue your search for the girl.","The sense of unease has grown stronger, leading you further south.","As you survey the area, you become aware that you are being watched by someone on the far bank of the river. You recognize the huntress, but she flees when she sees that you have spotted her. Sylphie gives chase, leaving you no choice but to hurry after them both.","You catch up to Sylphie to find her being threatened at arrowpoint. After a brief exchange, however, the huntress falls to her knees in obvious distress. A frantic Gatty then bursts from hiding, and is revealed to be a Padjal. Her aether flares wildly, the energies drawing in waves of hungry voidsent which you and Sylphie are forced to engage in battle. Speak with the acolyte once more.","Once the fiends are defeated, you learn that the huntress─Gatty's mother, Sanche─fled Gridania with her newborn child rather than hand her over to the Conjurers' Guild. Sylphie warns of the danger the girl's untamed aether represents, and offers to teach Gatty without betraying her presence to the guildmaster. Return to Castrum Oriens, and learn how Sylphie means to proceed.","Sylphie seems determined to allow Gatty to remain with her mother, and you feel compelled to go along with her plan. You wonder, however, if defying Gridania's traditions is truly the safest path for the young Padjal...<br><br>※The next white mage quest will be available from Sylphie upon reaching level 68."],"objectives":["Survey the area.","Survey the area to the south.","Survey the area further to the south.","Catch up to Sylphie.","Speak with Sylphie.","Protect Gatty!"],"dialogue":[{"name":"SYLPHIE","text":"Hello, <span class=\"highlight\">Forename</span>, I thought you might be along soon. As for Gatty, I've spotted her more than a few times, but she flees the moment she sees me..."},{"name":"SYLPHIE","text":"One thing I've learned, though, is that wherever the whispers lead, then that's where Gatty is to be found."},{"name":"SYLPHIE","text":"And since the forest spirits are particularly agitated today, we should have no trouble tracking her down. Come with me to the place we lost her the last time─we can start our search from there."},{"name":"SYLPHIE","text":"Please, I have to concentrate on the whispers─it's a little difficult to hear them when someone is gabbing in my ear. Why don't you take a look around?"},{"name":"SYLPHIE","text":"It's terribly faint, but I sense a thread of unease leading away from here. Come on, it's this way."},{"name":"SYLPHIE","text":"We're getting close now. Can you feel it? Quiet your mind, and reach out with your senses..."},{"name":"SYLPHIE","text":"When you're around, I find I can hear the voices of the elementals more clearly. I suppose it's easier to be tranquil when you have a veteran white mage at your side! Let's move on, shall we?"},{"name":"SYLPHIE","text":"I rarely venture this far south...<br>The air always feels so heavy."},{"name":"SYLPHIE","text":"The serpent scouts don't often venture into this area. ...I suppose there aren't a lot of imperial troops wandering around in the muck."},{"name":"SANCHE","text":"(-Stern Huntress-)......"},{"name":"SYLPHIE","text":"Did you see her? I think that might be Gatty's mother! Come on, let's go!"},{"name":"SANCHE","text":"Get away from us, conjurer, or I swear this arrow will find a new home in your meddling heart!"},{"name":"SYLPHIE","text":"Careful, <span class=\"highlight\">Forename</span>. She seems awfully angry for some reason..."},{"name":"SANCHE","text":"I know why you're here, and you'll not have her! Now unless you want to sprout feathers, it's time for you to leave!"},{"name":"SYLPHIE","text":"You're Gatty's mother, aren't you? We're not here to take her away─we're here to help her!"},{"name":"SANCHE","text":"(-Stern Huntress-)I'll not fall for your lies, conjurer! Get away...&lt;gasp&gt;...from us!"},{"name":"SANCHE","text":"(-Stern Huntress-)Ugh... Not...now..."},{"name":"GATTY","text":"Mama!?"},{"name":"SANCHE","text":"(-Stern Huntress-)&lt;gasp&gt; &lt;pant&gt;<br>No, Gatty! They'll...see you...<br>I'm fine! It's just...one of my turns..."},{"name":"SYLPHIE","text":"Gatty, you─ You're a Padjal!?"},{"name":"GATTY","text":"Mama, no! You can't..."},{"name":"SYLPHIE","text":"Ugh! The aether, it's...it's overwhelming!"},{"name":"SYLPHIE","text":"And the voidsent have come to feed! We can't let them hurt her!"},{"name":"SYLPHIE","text":"The fiends are drawn to the girl's energies."},{"name":"SYLPHIE","text":"I'll take care of the mother; you protect Gatty and strike down those voidsent!"},{"name":"SYLPHIE","text":"Gatty's aura, it's...it's like a floodgate has opened. There are cracks opening right into the void!"},{"name":"SYLPHIE","text":"I don't like the looks of that big rift! Watch yourself, <span class=\"highlight\">Forename</span>!"},{"name":"SYLPHIE","text":"Gatty's energies seem spent.<br>I think we're in the clear for now."},{"name":"SYLPHIE","text":"Gatty's fine─just exhausted from expelling so much aether. She'll wake up after she's had a chance to rest."},{"name":"SYLPHIE","text":"Speaking of which, you should be resting, too. Your heart's in bad shape, isn't it? I managed to calm the attack, but the condition itself is beyond my art to heal."},{"name":"SANCHE","text":"(-Gatty's Mother-)It grows worse by the day...<br>I am grateful for all you've done today, conjurer, but naught has changed: my daughter stays with me. Please, just leave us..."},{"name":"SYLPHIE","text":"Listen to me: <span class=\"emphasis\">we did not come to whisk away your child</span>. If we'd wanted to, we could've taken her while you lay senseless."},{"name":"SYLPHIE","text":"We came to learn what was upsetting the elementals, and what could be done to ease their disquiet. And it seems the answer lies in stopping the voidsent from coming after Gatty."},{"name":"SANCHE","text":"(-Gatty's Mother-)Can you truly stop those monsters from hunting her? The worse my illness becomes, the more often they come sniffing about. Creatures of nightmare they are, with their greedy eyes and grasping claws..."},{"name":"SYLPHIE","text":"We will help you in any way we can. I'm Sylphie, and this is <span class=\"highlight\">Forename</span>. Please, tell us more about Gatty and these...monsters."},{"name":"SANCHE","text":"(-Gatty's Mother-)I... No, you Gridanian charlatans are not to be trusted! You saved us this time, it's true, but if you don't go now the whisper of my bow will be the last thing you'll ever hear..."},{"name":"SYLPHIE","text":"Wait, I'm begging you! We promise not to say a thing to the guild. We swear by the Matron Herself! Right, <span class=\"highlight\">Forename</span>?"},{"name":"SANCHE","text":"(-Gatty's Mother-)The conjurers I've met before were arrogant. Condescending. You, on the other hand, seem far more sincere. I will take you at your word...for now."},{"name":"SANCHE","text":"My name is Sanche. It was twelve years ago that I fled Gridania with my infant child."},{"name":"SANCHE","text":"She was born a Padjal, and you know what that means..."},{"name":"SYLPHIE","text":"She was chosen by fate─destined to convey the elementals' will to the people of Gridania."},{"name":"SANCHE","text":"Aye. The conjurers would have snatched her from my arms, and taught her to be a servant of the forest spirits. By Gridanian law, they were well within their rights to do so."},{"name":"SANCHE","text":"But my husband was dead and Gatty was all I had left. I could not bear to let her go. And so I fled."},{"name":"SYLPHIE","text":"I can hardly imagine how hard that must have been. Living out here in the wilds, raising a child by yourself..."},{"name":"SYLPHIE","text":"But while I can understand the choice you made, Gatty's lack of control over her Padjali power is putting you both in danger."},{"name":"SYLPHIE","text":"Aether bleeds from her in a torrent whenever she is upset or afraid, drawing in the voidsent again and again. I hate to say this, but there may come a day when you won't be able to stop them..."},{"name":"SANCHE","text":"Is there naught that can be done!? We just want to live in peace..."},{"name":"SYLPHIE","text":"Here's an idea! I'll stay with you and teach Gatty how to control her aether. That way I can continue your treatment, <span class=\"emphasis\">and</span> solve this problem with the voidsent at the same time! All without telling the Conjurers' Guild, of course."},{"name":"SYLPHIE","text":"Hello again, Gatty! I used my conjury to help your mother feel better. Would you like to learn some magic, too?"},{"name":"GATTY","text":"Really!?"},{"name":"GATTY","text":"You know magic that can help Mama? Please teach me!"},{"name":"SANCHE","text":"Thank you─this means so much to us.<br>We can talk more inside the house..."},{"name":"SYLPHIE","text":"I'll walk them inside, then return to Castrum Oriens. I'll see you back there, <span class=\"highlight\">Forename</span>."},{"name":"GATTY","text":"When is Sylphie coming again?"},{"name":"SANCHE","text":"Thank you again for your aid. Gatty talks endlessly about you both, but I suppose that's only natural. I haven't encouraged guests in the past..."},{"name":"SYLPHIE","text":"I'm sorry, I sort of took matters into my own hands there. I know it's a lot to ask, but can you please keep this a secret from the guildmaster for the time being?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We should consult Brother E–Sumi–Yan."},{"name":"A1","text":"I promise!"},{"name":"A1","text":"..."},{"name":"SYLPHIE","text":"If we do that, the guild will take Gatty away from her mother. And we've seen what happens when the girl gets upset."},{"name":"SYLPHIE","text":"Thank you, <span class=\"highlight\">Forename</span>! We don't want the guild to take Gatty away from her mother─we've seen what happens when the girl gets upset."},{"name":"SYLPHIE","text":"...Is that approval or disapproval? We don't want the guild to take Gatty away from her mother─we've seen what happens when the girl gets upset."},{"name":"SYLPHIE","text":"And besides, Sanche may not be long for this world. Gatty should spend as much time with her as possible. I remember what it was like to lose a loved one..."},{"name":"SYLPHIE","text":"But please don't think emotion swayed my better judgment! I've thought this through, and I understand it won't be easy. That's why I need your help..."}],"reward":{"gil":2064,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":25}],"quests":[67951]},"next":[67953]},"partials":[{"type":"npc","id":"1018753","obj":{"i":1018753,"n":"Sylphie","l":2406,"q":4}},{"type":"npc","id":"1019086","obj":{"i":1019086,"n":"Sylphie","l":2406,"q":1}},{"type":"npc","id":"1019087","obj":{"i":1019087,"n":"Sylphie","l":2406,"q":1}},{"type":"npc","id":"1019088","obj":{"i":1019088,"n":"Sylphie","l":2406,"q":1}},{"type":"npc","id":"1019090","obj":{"i":1019090,"n":"Sylphie","l":2406,"q":1}},{"type":"npc","id":"1019092","obj":{"i":1019092,"n":"Stern Huntress","l":2406,"q":1}},{"type":"npc","id":"1019094","obj":{"i":1019094,"n":"Gatty","l":2406,"q":2}},{"type":"npc","id":"1019095","obj":{"i":1019095,"n":"Sanche","l":2406,"q":2}},{"type":"quest","id":"67951","obj":{"i":67951,"n":"An Aura for Trouble","g":153,"l":"The Fringes","s":630,"f":1}},{"type":"quest","id":"67953","obj":{"i":67953,"n":"The Problem with Padjals","g":153,"l":"The Fringes","s":680,"f":1}}]}