{"quest":{"name":"Once More with Feeling","location":"Gridania","id":67955,"patch":3.5,"sort":125,"icon":100629,"eventIcon":71221,"issuer":1018721,"target":1018722,"genre":196,"journal":["Lisette de Valentione is awfully eager to share the love with you during this special season.<br>※This quest is available for a limited time only.","Love is in the air and that can mean only one thing: Lisette de Valentione is back, trusty retainers in tow, and ready to aid those in need of romantic succor. After giving you a brief explanation of Valentione's Day, she bids you speak with Hortefense in Mih Khetto's Amphitheatre, in the hope that he might teach you how to express your true feelings.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","As Lisette promised, Hortefense gives you a demonstration of a charming new way for you to express yourself. After more than a few unremarkable attempts, you finally succeed in perfecting your technique. Now, equipped with one of the more potent kisses in the realm, it is time to seek out your special someone."],"objectives":["Speak with Hortefense."],"dialogue":[{"name":"LISETTE","text":"Fair adventurer, 'tis a pleasure to make your acquaintance during this most lovesome of seasons."},{"name":"LISETTE","text":"Ah, but I remember you! It has been some time since we last met, but I would never allow a <span class=\"alternative-container\"><span class=\"alternative\">beautiful</span><span class=\"alternative\">handsome</span></span> face such as yours to fade from memory."},{"name":"LISETTE","text":"I do hope you are enjoying the festivities. There is no doubt in my mind that my ancestor, Countess Arabelle de Valentione, would be overjoyed to know that her legacy had inspired this wonderful tribute to her memory."},{"name":"LISETTE","text":"Alas, the pioneering countess is no longer with us, but her spirit lives on in my retinue and I that have made the journey from Ishgard. We intend to see that the lost lovers of this realm are not left wanting for succor! Tee hee～♪"},{"name":"LISETTE","text":"But we must not get ahead of ourselves, for there is still much work to be done. Though countless souls seek love's sweet embrace, it is ever fleeting and ethereal in nature. Truly, the power of love is <span class=\"emphasis\">quite</span> a curious thing."},{"name":"LISETTE","text":"That is why we have taken it upon ourselves to pass along to the populace a time-honored House Valentione tradition. However, be forewarned, this approach is <span class=\"emphasis\">somewhat</span> potent, so see that you do not abuse it. We cannot be having the whole of Eorzea fall in love with you now, can we?"},{"name":"LISETTE","text":"Now run along and have dearest Hortefense tell you more. Why, it was only last year that he found true love and I am sure he is eager to see others do the same. Tee hee～♪"},{"name":"LISETTE","text":"Have you spoken with my dear Hortefense yet? No? Well, do strike while the iron is hot─even as we speak, lonely hearts across the realm cry out for succor!"},{"name":"HORTEFENSE","text":"Why, if it isn't that most charming adventurer that helped me some time ago. I thank you again for your kindness; it is in no small part due to you that my eyes were opened to my true love. Mayhap this rather lovely lesson I shall impart upon you today will go some way towards repaying the favor."},{"name":"HORTEFENSE","text":"Well met, brave adventurer! I trust you have been sent by Lady Lisette for a lesson in love?"},{"name":"HORTEFENSE","text":"Excellent! Now, I myself have not always been the luckiest in love, but experience has taught me that each and every one of us has the potential to realize our romantic dreams─we simply must needs learn to properly express our passion! Pray watch my demonstration and do your best to reproduce it."},{"name":"HORTEFENSE","text":"Be not disheartened─your effort was a valiant one. If you lack for experiences from which to draw inspiration, why, mayhap you might try and picture your beloved...<span class=\"alternative-container\"><span class=\"alternative\">father</span><span class=\"alternative\">mother</span></span>? Ah, on second thought, perhaps it is best if you persevere with your initial approach."},{"name":"HORTEFENSE","text":"Alas, this reminds me of mine own struggles. But you must not falter! If I was able to overcome the timidity and self-doubt that once plagued me, surely a courageous adventurer such as yourself can achieve the same!"},{"name":"HORTEFENSE","text":"Mayhap it was my demonstration that was lacking... Let us try once more. This time, breathe in deep the love in the air and let the passion flow freely from your lips!"},{"name":"HORTEFENSE","text":"...Do mine eyes deceive me? No, by the Fury, you've done it!"},{"name":"HORTEFENSE","text":"Such fervor! Such passion! To see you transform like this before my very eyes─truly, this alone has made the journey from Ishgard worthwhile! Pray go forth and use your newfound knowledge─that you might forge an eternal bond with your beloved. Godsspeed!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Dote</span>!"}],"reward":{"gil":210,"emote":"Dote","xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[67956]},"partials":[{"type":"npc","id":"1018721","obj":{"i":1018721,"n":"Lisette De Valentione","l":53,"q":1}},{"type":"npc","id":"1018722","obj":{"i":1018722,"n":"Hortefense","l":53,"q":2}},{"type":"quest","id":"67956","obj":{"i":67956,"n":"The Magic Number","g":196,"l":"Gridania","s":126,"r":1}}]}