{"quest":{"name":"When Eggs Fly","location":"Gridania","id":67957,"patch":3.5,"sort":133,"icon":100631,"eventIcon":71221,"issuer":1019591,"target":1019592,"genre":199,"journal":["Jihli Aliapoh would have you participate in the Hatching–tide celebration.<br>※This quest is available for a limited time only.","Hatching–tide, that most eggcentric of festivals, has returned to Eorzea. This year Jihli Aliapoh has seen a vision of a hovering egg, from which a chocobo emerges to startle people before going on to lay a magnificent, dazzling gemstone. If you would help Jihli recreate her vision, make your way to Hyrstmill in the North Shroud, where her friend and helper Nonotta awaits with detailed instructions.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Nonotta tasks you with startling folk while riding a hovering egg of dubious origin, which she inadvertently reveals is an invention she calls the eggshilaration system. Realizing her error, she implores you to keep this fact to yourself lest you shatter Jihli's dreams."],"objectives":["Speak with Nonotta at Hyrstmill."],"dialogue":[{"name":"JIHLIALIAPOH","text":"Greetings, friend! Drawn to the beautiful adornments of Hatching–tide, I take it?"},{"name":"JIHLIALIAPOH","text":"Oh, it's you, <span class=\"highlight\">Forename</span>! What a delight to see you again!"},{"name":"JIHLIALIAPOH","text":"Since we found our “shining, golden treasure,” I've been visiting the little fellow as often as I'm able. He is fast growing into a fine young bird, and I smile to imagine what this year's event might have in store for us."},{"name":"JIHLIALIAPOH","text":"I'm Jihli Aliapoh, and you are...<span class=\"highlight\">Forename Surname</span>? 'Tis a pleasure to make your acquaintance. I pray you will join in the revelry with us!"},{"name":"JIHLIALIAPOH","text":"Lest you wonder, the festival was born of a prophetic dream I had a long time ago. It has since grown to become the grand celebration you see now, and I smile to imagine what this year's event might have in store for us."},{"name":"JIHLIALIAPOH","text":"You see, I've been blessed with a new vision: an egg, hovering in the air, from which a chocobo emerges to startle folk before going on to lay a magnificent, dazzling gemstone. Surreal, I know."},{"name":"JIHLIALIAPOH","text":"Yet, surreal as it was, if we can recreate the vision, something magical is bound to happen. For this we needed a hovering egg...which proved rather rarer than one might think."},{"name":"JIHLIALIAPOH","text":"But sure enough, my good friend and helper Nonotta managed to find precisely such an egg as appeared in my dream. Without a doubt a gift from the Archons of old!"},{"name":"JIHLIALIAPOH","text":"With the egg, we shall host a rousing Hatching–tide to be remembered. In so doing, the dazzling gemstone will surely reveal itself to us."},{"name":"JIHLIALIAPOH","text":"If you would lend a hand in making my vision reality, please seek out Nonotta in Hyrstmill. She has care of the floating egg and will furnish you with further instructions. Off you go, now, and eggspeed!"},{"name":"NONOTTA","text":"Ah, back to help us celebrate another Hatching–tide? You have our thanks!"},{"name":"NONOTTA","text":"Greetings, adventurer. I take it you wish to help us celebrate Hatching–tide? You have our thanks!"},{"name":"NONOTTA","text":"This year, in order to recreate Jihli's vision, we are dividing participants into two groups: the startlers and the startled. As you seem to be an accomplished rider, I assign you to the former."},{"name":"NONOTTA","text":"Your task is simple: ride atop a hovering egg and give folk a jolly good startling. Lest you worry, it's as easy as riding a chocobo."},{"name":"NONOTTA","text":"You seem unsettled. Does something about the egg give you pause?"},{"name":"Q1","text":"What will you ask about the egg?"},{"name":"A1","text":"Where did you find it?"},{"name":"A1","text":"Is it safe?"},{"name":"NONOTTA","text":"Heh, we didn't actually find the egg so much as built it ourselves. We couldn't bear to see Jihli disappointed, you see."},{"name":"NONOTTA","text":"Well, of course it's safe! We built it ourselves, I'll have you know!"},{"name":"NONOTTA","text":"Recall you the giant, floating eggs we used before? Well, it operates the same way─with wisdom and parts borrowed from the ancients. Add some refinements and external touches, and voilà! Ridable egg! The eggshilaration system, I call it, and it's a marvel of engineering, if I do say so my─"},{"name":"NONOTTA","text":"Hovering eggs simply don't...well, <span class=\"emphasis\">exist</span>. We had to make it by borrowing the wisdom and parts of ancients. Add some external touches, though, and voilà! Ridable egg! The eggshilaration system, I call it, and it's a marvel of engineering, if I do say so my─"},{"name":"NONOTTA","text":"&lt;gasp&gt; Did I just─?"},{"name":"NONOTTA","text":"I–I beg you, you mustn't breathe a word of this to Jihli! Promise me you'll keep it to yourself, cross your heart and hope to die!"},{"name":"JIHLIALIAPOH","text":"Nonotta has care of the hovering egg. Please seek her out in Hyrstmill to receive further instructions. Off you go, now, and eggspeed!"}],"reward":{"gil":210,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[67958]},"partials":[{"type":"npc","id":"1019591","obj":{"i":1019591,"n":"Jihli Aliapoh","l":53,"q":1}},{"type":"npc","id":"1019592","obj":{"i":1019592,"n":"Nonotta","l":57,"q":3}},{"type":"quest","id":"67958","obj":{"i":67958,"n":"Shock-full of Eggcitement","g":199,"l":"North Shroud","s":134}}]}