{"quest":{"name":"A Fistful of Resolve","location":"Ul'dah","id":67962,"patch":4.0,"sort":601,"icon":100672,"unlocksFunction":1,"eventIcon":71341,"issuer":1006749,"target":1013971,"involved":[1006215,1013998,1022372,1022373,1022374,1022375],"genre":148,"journal":["Professor Erik eyes you with a look of self-satisfaction.","Greeting you with his customary condescension, Professor Erik informs you that Widargelt is troubled by some matter or other. The professor has been unable to prise the details out of the tight-lipped monk, but he believes that you will fare better. Make your way to Revenant's Toll, where Widargelt is based, and make yourself available to your brother-in-arms.","As the professor predicts, Widargelt readily reveals to you his woes. The Ala Mhigan Resistance has invited him to rejoin the cause, and though he is resolved to turn down the offer, the event has set him to thinking about his purpose─what he can do in aid of his beleaguered homeland. O'tchakha and D'zentsa ask that you keep an eye on their master as he goes to meet with the Resistance representative in Little Ala Mhigo.","You arrive in time to witness Widargelt giving Gundobald his answer. Though the old soldier expresses his understanding, saying that fighting is not the only way to serve one's nation, his words leave Widargelt wondering about his own path. Wishing to be alone, he takes his leave and heads for an unknown location. Find him and offer him your support.","You find Widargelt in contemplation before the mark of the Destroyer. As he relates to you how the Fist of Rhalgr, once the foremost faith among Ala Mhigans, has all but died out in his homeland, the monk finally realizes what he must do. He bids you return with him to Revenant's Toll, where he will share his plans with everyone.","Before his gathered friends and pupils, Widargelt reveals that he means to go to Gyr Abania on a mission to revive the Fist of Rhalgr. O'tchakha, D'zentsa, and the professor offer to accompany him, and naturally so do you. Overwhelmed by the support, Widargelt expresses his gratitude and determination, and bids you see to your preparations.<br><br>※The next monk quest will be available from Widargelt upon reaching level 63."],"objectives":["Speak with Widargelt at Revenant's Toll.","Speak with Widargelt in Little Ala Mhigo.","Search for Widargelt.","Speak with Widargelt at Revenant's Toll."],"dialogue":[{"name":"ERIK","text":"Ah, <span class=\"highlight\">Forename</span>! Dim though you are, I would swear you possess an innate ability to sense when you are needed. And on that note, I have a task for you."},{"name":"ERIK","text":"Your fellow brute Widargelt─some matter or other weighs heavily on his mind of late. Knowing him, it can only pertain to Ala Mhigo, but the stubborn oaf is determined to keep it pent-up inside. Loath to trouble me with it or some such nonsense, I shouldn't doubt."},{"name":"ERIK","text":"But you, my friend─you are as a <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> to him. If there is a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> alive in whom he would be willing to confide, it is you. For the hopeless idiot's sake, I bid you go to Revenant's Toll and place yourself at his disposal."},{"name":"WIDARGELT","text":"Good. That will be all for today. You have done well. I am pleased with your progress."},{"name":"DZENTSA","text":"You always say that, Master. But we're nowhere near where we want to be. Not even close."},{"name":"OTCHAKHA","text":"Indeed. And besides, any progress we make, we owe wholly to you."},{"name":"DZENTSA","text":"Damn right. Without your guidance, we'd be goin' nowhere fast."},{"name":"WIDARGELT","text":"My guidance..."},{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span>, I am glad to see you. Things are well here, as you can see. But...hmmm..."},{"name":"WIDARGELT","text":"D'zentsa, O'tchakha, you may go ahead. I would speak with <span class=\"highlight\">Forename</span>."},{"name":"WIDARGELT","text":"Those two grow stronger every day. Shadows darken their way no more. Their purpose is clear."},{"name":"WIDARGELT","text":"Would that I could say the same of mine..."},{"name":"WIDARGELT","text":"You see, I have received an offer. The Resistance. They ask that I rejoin them. Lead one of their units."},{"name":"WIDARGELT","text":"Once, I would have jumped at the chance. But no more. No longer do I live for revenge. You and the professor showed me it is not the way."},{"name":"WIDARGELT","text":"So I will turn down the offer. I would focus not on fighting, but rebuilding. But what is within my power? Beyond the battlefield, how can I serve my homeland?"},{"name":"WIDARGELT","text":"Forgive me. I should not trouble you with this. It is my answer to find."},{"name":"WIDARGELT","text":"But first, I will give the Resistance their answer. My thanks for listening, <span class=\"highlight\">Forename</span>."},{"name":"OTCHAKHA","text":"He still agonizes over it..."},{"name":"DZENTSA","text":"Aye, hardly the state of mind to be in for such an important meeting. Isn't there anything we can do?"},{"name":"OTCHAKHA","text":"Not us two─his pride will not allow it. But you, <span class=\"highlight\">Forename</span>─he opened up to you just now, did he not? I daresay he will do so again. We're terribly sorry to impose, but could you please follow Master Widargelt? Watch over him in our stead?"},{"name":"Q1","text":"Will you watch over Widargelt?"},{"name":"A1","text":"For you, O'tchakha? Of course."},{"name":"A1","text":"For you, D'zentsa? Of course."},{"name":"OTCHAKHA","text":"Hehe! We are in your debt, <span class=\"highlight\">Forename</span>!"},{"name":"DZENTSA","text":"Wait, what? Who, me?"},{"name":"DZENTSA","text":"Um, <span class=\"highlight\">Forename</span>? Do you, er...reckon you could look in on Master Widargelt for us?"},{"name":"OTCHAKHA","text":"He is bound for Little Ala Mhigo, I believe."},{"name":"ERIK","text":"I doubt not that Widargelt is in good hands. After all, who should know a brute better than a fellow brute?"},{"name":"WIDARGELT","text":"You would bear witness to my resolve? Very well, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Witness me."},{"name":"GUNDOBALD","text":"Have you made up your mind, then?"},{"name":"WIDARGELT","text":"I have. Your offer does me great honor. But with respect I must decline. My days of vengeance are over."},{"name":"GUNDOBALD","text":"I see. That is your decision, and I shan't press you further. Yet I would be lying were I to say I'm not disappointed. With your mastery of the Fist, your contribution to our struggle would have been immeasurable."},{"name":"WIDARGELT","text":"I am sorry..."},{"name":"GUNDOBALD","text":"Do not be. Remember, fighting is not the only way to serve one's nation. We each of us must find our own path to walk."},{"name":"WIDARGELT","text":"Our own path..."},{"name":"WIDARGELT","text":"There is a place I would be. I take my leave of you."},{"name":"GUNDOBALD","text":"'Tis plain you know Widargelt better than most. If you are indeed his friend, as I mark you to be, I needn't tell you to be there for him."},{"name":"WIDARGELT","text":"To find me here... You know me too well, <span class=\"highlight\">Forename</span>."},{"name":"WIDARGELT","text":"The mark of the Destroyer. My people bore it here when the Empire came. The risk was great. But their faith was greater still."},{"name":"WIDARGELT","text":"Alas, that faith has all but faded. Wiped away from the motherland. The Garleans suffer not the divine. They allow us not even the solace of worship."},{"name":"WIDARGELT","text":"...By Rhalgr, I know now. That which I can do for Ala Mhigo. All along, there was but the one path."},{"name":"WIDARGELT","text":"Let us return to Revenant's Toll. There I will tell all."},{"name":"WIDARGELT","text":"Thank you all for coming. I have found my calling. And I would share it with you."},{"name":"WIDARGELT","text":"I will go to Gyr Abania. And there revive the Fist of Rhalgr."},{"name":"DZENTSA","text":"Well then, we're coming with you. We won't let you out of our sight─not until we've repaid the debt, at any rate."},{"name":"ERIK","text":"Suffice to say I too shall come. The lands of Gyr Abania harbor countless mysteries, and such knowledge as I possess will doubtless serve you in your endeavor."},{"name":"WIDARGELT","text":"And you, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Can I count on you as well?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm with you all the way!"},{"name":"A2","text":"I'm not feeling up to it."},{"name":"OTCHAKHA","text":"Wh-What!? But <span class=\"highlight\">Forename</span>, it would be unthinkable without you! Please reconsider!"},{"name":"WIDARGELT","text":"I am glad. Your presence gives me heart. The mission will not be easy. But I will not rest until I succeed. And the Fist of Rhalgr is returned to the land. This I swear."},{"name":"ERIK","text":"On that inspiring note, I shall go and make ready.<br>...And Widargelt─pray do not forget what we discussed."},{"name":"WIDARGELT","text":"We will depart anon. Pray see to your preparations, <span class=\"highlight\">Forename</span>."},{"name":"SYSTEM","text":"The next monk quest will be available from Widargelt upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"DZENTSA","text":"Glad to see Master worked things out."},{"name":"OTCHAKHA","text":"With your help, Master Widargelt has found his path. Thank you, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":1767,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":21}],"questsType":"all","quests":[67567,67895]},"next":[67963]},"partials":[{"type":"npc","id":"1006749","obj":{"i":1006749,"n":"Erik","l":41,"q":9}},{"type":"npc","id":"1013971","obj":{"i":1013971,"n":"Widargelt","l":67,"q":8}},{"type":"npc","id":"1006215","obj":{"i":1006215,"n":"Gundobald","l":45,"q":13}},{"type":"npc","id":"1013998","obj":{"i":1013998,"n":"Erik","l":67,"q":2}},{"type":"npc","id":"1022372","obj":{"i":1022372,"n":"Widargelt","l":45,"q":1}},{"type":"npc","id":"1022373","obj":{"i":1022373,"n":"Widargelt","l":45,"q":1}},{"type":"npc","id":"1022374","obj":{"i":1022374,"n":"D'zentsa","l":67,"q":2}},{"type":"npc","id":"1022375","obj":{"i":1022375,"n":"O'tchakha","l":67,"q":2}},{"type":"quest","id":"67567","obj":{"i":67567,"n":"Appetite for Destruction","g":148,"l":"Mor Dhona","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"67963","obj":{"i":67963,"n":"Return of the Monk","g":148,"l":"Mor Dhona","s":630,"f":1}}]}