{"quest":{"name":"More Bark and Mochi Bite","location":"Limsa Lominsa","id":67961,"patch":4.15,"sort":137,"icon":100721,"eventIcon":71221,"issuer":1019661,"target":1019661,"genre":194,"journal":["The inu bugyo perks to attention at the sight of you.<br>※This quest is available for a limited time only.","Upon the decks of Limsa Lominsa, you are fairly pounced upon by the inu bugyo, who relates to you his mission to foster the bonds of friendship between Eorzea and the Far East. To this end, he is hosting a Heavensturn celebration in the Far Eastern style, and requests your help in spreading the word. Aiding you in this task is Taro, a dog as clever as he is cute, who will give the locals a taste of the spectacle to come. No sooner is Taro introduced than he rushes off, eager to find crowds to please, and you spin on your heels after him.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Taro performs a trick to the delight of an onlooker, and you follow his efforts by giving her the particulars of the festival. His work here complete, the little dog goes off to find the next likely spot to win hearts.","Taro performs a trick for another onlooker, and you again speak your piece for the festival. His work here complete, the little dog goes off to find the next likely spot to win hearts.","The third time proves to be a curse; you are shocked to find Taro not being doted upon, but snarled at by a menacing dog and its equally menacing owner. The obnoxious man claims to belong to a band of pirates called the Rabid Wives, and makes his dislike of Taro abundantly plain, sending your canine companion scurrying away in fear. Though a part of you yearns to teach the brute a lesson in humility, you decide to give priority to Taro and report the incident to his master.","Shaken as Taro is, the inu bugyo fears he is in no state to perform. Even as it seems the festival must proceed with only advent cakes, the mochi daikan returns with grave tidings: the Rabid Wives have disrupted the mochi pounding by unleashing their deckhounds. As you make to hasten to the mochi's rescue, Taro lets out a beseeching whine; for all his trauma, he still wishes to be of help. And so you strike out together to save the festival, by participating in the FATE “Who Let the Hounds Out” in one of the following locations: southeast of the Zephyr Gate in middle La Noscea; east of the Salt Strand in lower La Noscea.","Owing to your timely assistance, the mochi has been saved. And for an unexpected but welcome turn, your show of bravery has inspired Taro to regain his former spirit. The inu bugyo will doubtless be pleased to hear of this.","Back in Limsa Lominsa, the festival has begun in earnest, and the citizens are enjoying their advent cakes and themselves. Alas, the Rabid Wives are not yet finished with their villainy, and they appear once more to disrupt the proceedings. This time, however, Taro refuses to be cowed, and he courageously confronts his deckhound nemesis. The sight of the little fellow standing up to a foe many times his size lights a fire in the hearts of festival participants, who band together to drive away the pirates. Upon seeing this display of unity between Eorzeans and Far Easterners, the mochi daikan declares this Heavensturn celebration a great success. As a token of his appreciation, the inu bugyo presents you with an inu kabuto, and you promise to rise to the mochi's defense again should the need arise."],"objectives":["Find Taro on the lower decks.","Report to the inu bugyo.","Participate in the FATE “Who Let the Hounds Out” in La Noscea.","Report to the inu bugyo in Limsa Lominsa."],"dialogue":[{"name":"DOGMISSIONARY","text":"Ah, beg pardons, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Yes, you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, the adventurer with the dignified bearing. Might you favor me with a moment of your time?"},{"name":"DOGMISSIONARY","text":"I am the inu bugyo, and I lead a Far Eastern delegation on a mission to foster the bonds of friendship with the people of Eorzea. This we seek to do by sharing the joys of our Heavensturn custom to you and yours."},{"name":"DOGMISSIONARY","text":"Though the tradition exists in both our lands, there are some differences in how we celebrate a new turn of the seasons. Most notably, while the people of Eorzea choose a deity to be first among the Twelve, we in the Far East grant that honor to a beast."},{"name":"DOGMISSIONARY","text":"And this year, the honor belongs to the noble dog! Behold my kabuto. Fashioned in the likeness of man's best friend, 'tis the very picture of loyalty and devotion."},{"name":"DOGMISSIONARY","text":"The craftsman spared no detail─it is so lifelike, one can fairly picture it rousing to attention with a spirited bark. To you I would gift this helm...if you would but consent to cooperate in my mission."},{"name":"DOGMISSIONARY","text":"Worry not, it shan't prove a difficult task for an adventurer of your caliber. We will be handing out advent mochi─rice cakes traditionally enjoyed on this occasion─and you need but help us spread the word."},{"name":"DOGMISSIONARY","text":"You have my gratitude! Now then, are you perchance familiar with mochi pounding?"},{"name":"CHOICE1Q1","text":"Are you familiar with mochi pounding?"},{"name":"CHOICE1A1","text":"Yes, I am."},{"name":"CHOICE1A2","text":"I'm something of a virgin."},{"name":"RICECAKEREEVE","text":"(-Familiar Far Eastern Lilt-)And so <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> should be, for <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was instrumental in our previous pounding efforts."},{"name":"RICECAKEREEVE","text":"Greetings, my friend. Right glad am I that you have returned to help us."},{"name":"DOGMISSIONARY","text":"Well! To think that you are already acquainted with the mochi daikan, and are no stranger to mochi pounding besides. The kami are kind to bless us with a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your experience."},{"name":"RICECAKEREEVE","text":"Indeed. With <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> at our side, our mission is guaranteed to be a success. Now, if you'll excuse me, I must make ready for the pounding. In the meantime, I ask that you gather as many people as possible."},{"name":"RICECAKEREEVE","text":"(-Far Eastern Lilt-)Impressive. 'Tis no ordinary adventurer who is versed in our ways."},{"name":"RICECAKEREEVE","text":"Well met, friend. I am the mochi daikan, and making mochi is my solemn charge. That I should meet a fellow mochi enthusiast in this foreign land could only be ascribed to fate."},{"name":"DOGMISSIONARY","text":"Verily! With this adventurer to assist us, I have every confidence that our mission will be a success."},{"name":"RICECAKEREEVE","text":"Now, if you'll excuse me, I must make ready for the pounding. In the meantime, I ask that you gather as many people as possible."},{"name":"RICECAKEREEVE","text":"(-Far Eastern Lilt-)Then pray allow me to pound the knowledge into you."},{"name":"RICECAKEREEVE","text":"Mochi is made by pounding freshly steamed rice in a large mortar until it becomes a sticky dough. This dough is then rolled into treats called advent cakes. Simple though they may be, they are central to our celebration, and as the mochi daikan, I am charged with their creation."},{"name":"DOGMISSIONARY","text":"You are intrigued, and small wonder─ours is a unique culture. Know that you will learn more about it in the course of the festivities, and 'tis our hope that you will enjoy yourself in so doing."},{"name":"RICECAKEREEVE","text":"Now, if you'll excuse me, I must make ready for the pounding. In the meantime, I ask that you gather as many people as possible."},{"name":"DOGMISSIONARY","text":"Though we have distributed advent cakes in the past, this time we shall draw the crowds with an all new spectacle─one in keeping with this year's honored beast."},{"name":"DOGMISSIONARY","text":"Permit me to introduce you to the star of the show.<br>...Taro! Come!"},{"name":"DOGMISSIONARY","text":"This is Taro, whom I raised with my own hands. Though small in stature, he is possessed of a big heart and is as clever as they come."},{"name":"DOGMISSIONARY","text":"...Not to mention spontaneous. Well, no time like the present, I suppose. I ask that you accompany Taro and together promote our festival."},{"name":"DOGMISSIONARY","text":"He is trained to perform a delightful trick, invariably attracting attention and adoration. This will afford you the opportunity to inform folk of the performance and free rice cakes."},{"name":"DOGMISSIONARY","text":"With that, I shall make ready to receive our guests. Good luck, my friend, and may the kami smile upon our festival!"},{"name":"DOGMISSIONARY","text":"Taro is trained to perform a delightful trick, invariably attracting attention and adoration. This will afford you the opportunity to inform folk of the performance and free rice cakes."},{"name":"DOGMISSIONARY","text":"I shall make ready to receive our guests. Good luck, my friend, and may the kami smile upon our festival!"},{"name":"FVIEWER02425","text":"Isn't he the most adorable little thing! I can't take my eyes off him!"},{"name":"BLACKDOG","text":"Arf, arf!"},{"name":"FVIEWER02425","text":"My, cute <span class=\"emphasis\">and</span> clever! Don't you just have it all!"},{"name":"FVIEWER02425","text":"Awww, he's gone already... I would've loved to play with him."},{"name":"FVIEWER02425","text":"What? The little fellow's going to give a performance, and there'll be free rice cakes besides? I'll be there with bells on!"},{"name":"MVIEWER02425","text":"Was minding my own business when this little rascal comes scampering over. Is...is something going to happen?"},{"name":"BLACKDOG","text":"Arf, arf!"},{"name":"MVIEWER02425","text":"Haha, look at him go! That is hands down the cutest thing I've ever seen! Never thought to have a dog before, but I could take you home right now!"},{"name":"MVIEWER02425","text":"...Well, I suppose it wasn't meant to be. And I so wanted to have a good cuddle... &lt;sigh&gt;"},{"name":"MVIEWER02425","text":"I can still see him, you say? There might not be cuddling, but there'll be rice cakes? I'm already there!"},{"name":"BONEPOLISHER","text":"The 'ells's this pathetic excuse fer a dog? All o' the puny runts I've seen, yer the puniest an' runtiest of 'em all!"},{"name":"WHITEDOG","text":"Grrrrrr!"},{"name":"BLACKDOG","text":"&lt;whimper&gt;"},{"name":"BONEPOLISHER","text":"Ye gots a problem? If ye mean to step between Ghost an' his meal, ye'll 'ave to answer to the Rabid Wives, the newest an' meanest pirates in Limsa! That's assumin' Ghost don't feast on yer entrails first!"},{"name":"WHITEDOG","text":"(-Ghost-)Grrrrrr! Woof! Woof!"},{"name":"BONEPOLISHER","text":"See, we don't take kindly to dogs what's good fer nothin' but a circus. Now Ghost is gonna 'ave to tear it limb from limb!"},{"name":"BONEPOLISHER","text":"Gahahaha! Look at it run, leakin' piss all over the place!"},{"name":"BONEPOLISHER","text":"Hmph, feeble thing like that gives dogs a bad name. Can't 'ave folk thinkin' that's 'ow dogs're s'posed to be, else our deckhounds won't sell."},{"name":"BONEPOLISHER","text":"Now, you listen well, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>! This 'ere's Rabid Wives territory! If I ever catch that runt runnin' 'round 'ere again, there'll be 'ells to pay! Now, bugger off!"},{"name":"BLACKDOG","text":"&lt;whimper&gt;"},{"name":"DOGMISSIONARY","text":"Ah, there you are! Taro came running back visibly shaken. What has happened?"},{"name":"DOGMISSIONARY","text":"What!? I have heard of these detestable pirates who make savage beasts of dogs─these Rabid Wives. To think that they would so callously threaten poor, harmless Taro..."},{"name":"DOGMISSIONARY","text":"The experience has so distressed him, he is in no state to perform. Nor would I place him in danger by making him conspicuous. 'Tis a most unfortunate turn of events, but we must make do with handing out mochi alone."},{"name":"RICECAKEREEVE","text":"&lt;pant&gt; &lt;pant&gt; T-Terrible news! Pirates have loosed vicious hounds at the pounding site! It's...it's utter chaos!"},{"name":"DOGMISSIONARY","text":"Vile fiends! Not only do they traumatize Taro, they would disrupt the mochi pounding as well!?"},{"name":"RICECAKEREEVE","text":"They came for Taro, too!? Damn them! If there is to be no performance, we must protect the mochi at the very least!"},{"name":"RICECAKEREEVE","text":"Adventurer, the festival's success is at stake. You have helped us to save the mochi before. Will you not help us save it again?"},{"name":"RICECAKEREEVE","text":"Adventurer, the festival's success is at stake. Will you not help us save the mochi?"},{"name":"RICECAKEREEVE","text":"We are in your debt! Let us make haste to the pounding site!"},{"name":"BLACKDOG","text":"Arf, arf..."},{"name":"RICECAKEREEVE","text":"What's this, Taro? You wish to come along? Perish the thought! Shaken as you are, you are in no shape to join us. We will manage somehow, so remain here and stay out of sight."},{"name":"DOGMISSIONARY","text":"Though he is unable to perform tricks, he still wishes to be of use... I wouldn't expect any less of my Taro. But nay, I cannot allow it, little one. Should those pirates see you..."},{"name":"BLACKDOG","text":"Arf, arf..."},{"name":"RICECAKEREEVE","text":"'Twould seem he is resolved to come whether we will it or no. Ah, but someone must keep watch over the advent cakes we retrieve. Mayhap Taro can be entrusted with this task?"},{"name":"BLACKDOG","text":"Arf, arf!♪"},{"name":"RICECAKEREEVE","text":"Worry not, my esteemed bugyo. Lest you forget, our adventurer friend will be on hand. No harm shall befall Taro, I am sure of it."},{"name":"DOGMISSIONARY","text":"The heavens could not have sent us a more dependable adventurer. Very well! Let us together ensure that the festival is a success!"},{"name":"RICECAKEREEVE","text":"Now, there are two pounding sites. One is in middle La Noscea, to the southeast of the Zephyr Gate, and the other is in lower La Noscea, to the east of the Salt Strand. I shall see you there."},{"name":"DOGMISSIONARY","text":"The success of the festival rides upon the mochi. Pray save as much as you can!"},{"name":"FVIEWER02425","text":"Mmmmmm, the rice cakes are so <span class=\"emphasis\">good</span>! The chewiness is habit-forming!"},{"name":"MVIEWER02425","text":"Ungh...unnngh...unnngah! &lt;gasp&gt; Whew, I damn near choked on rice cake... But I can't die─not until I've had myself a proper cuddle!"},{"name":"BLACKDOG","text":"Arf, arf!♪"},{"name":"RICECAKEREEVE","text":"Thanks to you, we are able to hand out the advent cakes as planned. Not only that─witnessing your bravery has helped Taro to find his own again."},{"name":"DOGMISSIONARY","text":"My heartfelt thanks for saving the mochi. Even as we speak, folk are enjoying our advent cakes. I daresay you will see familiar faces."},{"name":"DOGMISSIONARY","text":"And for an unexpected but welcome turn, Taro has regained his aplomb! We will be able to proceed with the performance after all!"},{"name":"BONEPOLISHER","text":"(-Obnoxious Voice-)What did I say 'bout lettin' that runt roam these parts!?"},{"name":"BONEPOLISHER","text":"This 'ere's a pirate town, a place fer strong folk. If ye wants to be strong, ye needs a big, strong 'ound. An' it jus' so 'appens we sell 'em─fer a million gil each. It's a right bloody bargain!"},{"name":"BONEPOLISHER","text":"Don't even think 'bout leavin' without buyin'. It's plain rude, see, an' Ghost 'ere don't much care fer rude folk. Ain't that right, boy?"},{"name":"DOGMISSIONARY","text":"K-Kami preserve! Adventurer, you must protect the citizens!"},{"name":"BLACKDOG","text":"Grrr! Woof, woof!"},{"name":"RICECAKEREEVE","text":"T-Taro, no! You don't stand a chance against that beast!"},{"name":"BONEPOLISHER","text":"Hmph, all bark an' no bite! Always the way of it with puny dogs! Ghost, put that yappin' thing out of its misery!"},{"name":"FVIEWER02425","text":"Look! Even the little one is standing up to these ruffians! We must be strong, too!"},{"name":"MVIEWER02425","text":"Aye! You don't scare us! Go back to the shitehole whence you came!"},{"name":"BONEPOLISHER","text":"Damn, all this commotion's gonna attract the Admiral's yellow pets... Y-Ye 'aven't seen the last of us!"},{"name":"RICECAKEREEVE","text":"You've done it, Taro! Your courage lit a fire in our guests' hearts, and together you stared down a common menace! Verily, this is the spirit of camaraderie we sought to sow by our mission!"},{"name":"DOGMISSIONARY","text":"Well, the festival has barely begun, but I believe we can already declare it a great success. Taro has matured greatly, and it is all thanks to your heroic example. Pray accept this as a token of our gratitude."},{"name":"DOGMISSIONARY","text":"Whenever you don it, may you be reminded of us─your friends from a distant shore."},{"name":"DOGMISSIONARY","text":"Now, the celebration shall continue for a while yet. Should it turn out that the Rabid Wives haven't learned their lesson, I pray that you will lend us your strength again."}],"reward":{"gil":191,"items":[{"id":20678},{"id":20679}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1019661","obj":{"i":1019661,"n":"Inu Bugyo","l":28,"q":1}},{"type":"item","id":"20678","obj":{"i":20678,"n":"White Inu Kabuto","l":1,"c":40284,"t":34,"p":94}},{"type":"item","id":"20679","obj":{"i":20679,"n":"Black Inu Kabuto","l":1,"c":40283,"t":34,"p":94}}]}