{"quest":{"name":"Return of the Monk","location":"Mor Dhona","id":67963,"patch":4.0,"sort":630,"icon":100672,"unlocksFunction":1,"eventIcon":71341,"issuer":1013971,"target":1022390,"involved":[1022374,1022375,1022384,1022385,1022386,1022387,1022388,1022389,1022391,1022392],"genre":148,"journal":["Indecision is writ plain on Widargelt's face.","You inform Widargelt of your readiness to depart, but the monk himself appears unready due to his agonizing over a creed for the new Fist of Rhalgr. At D'zentsa's urging, he decides to strike out in the hope that inspiration will strike along the way. Your first stop is an old training ground for monks called Schism, situated in the Fringes.","The visit to Schism does not avail Widargelt in his quest for a creed, but he forges on undeterred. Follow him to the village of Ala Gannha, where Professor Erik has gone ahead to scout.","Arriving at the village, Widargelt witnesses a heated exchange between two villagers. The experience is the spark Widargelt needed, and he finally comes up with a fitting doctrine to guide the Fist of Rhalgr into a new age. With that, he is ready to proclaim the order's return to the world. As the foremost monk in the party, you have been tasked with performing a demonstration before the villagers. Let Widargelt know when you are ready to begin.","First impressions last. Kick off your demonstration by performing a True Strike on the dummy.<br><br>※True Strike can be performed by first using Form Shift.","You have pulled off a textbook True Strike. Follow it up with a Dragon Kick.","You have pulled off a picture-perfect Dragon Kick. Bring your demonstration home with a Bootshine.","Your blistering strikes pave the way for Widargelt's words, and he gives an impassioned speech and wins over the gathered crowd. Speak with Widargelt to learn his mind on the result of this first showing.","In no small part due to your aid, Widargelt has taken a first momentous step towards reviving the Fist of Rhalgr. The monk will remain in Ala Gannha awhile to initiate interested villagers into the fundamentals of the faith. In the meantime, he bids you continue honing your skills, for they will doubtless be called upon again ere long.<br><br>※The next monk quest will be available from Widargelt upon reaching level 65."],"objectives":["Speak with Widargelt at Schism.","Speak with Widargelt in Ala Gannha.","Speak with Widargelt near the training dummy.","Perform a True Strike on the dummy.","Perform a Dragon Kick on the dummy.","Perform a Bootshine on the dummy.","Speak with Widargelt."],"dialogue":[{"name":"WIDARGELT","text":"Are you ready to depart, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>?"},{"name":"WIDARGELT","text":"Good. The professor has already left. He makes for a village called Ala Gannha. There, he will take the measure of the land."},{"name":"WIDARGELT","text":"I would strike out soon as well. But one matter troubles me still. The creed for a new Fist of Rhalgr."},{"name":"DZENTSA","text":"With all due respect, Master, but at this rate we'll never get to Gyr Abania."},{"name":"WIDARGELT","text":"...You are right. Sometimes the answer cannot be forced. Mayhap it will come to me on the road. Very well, let us away."},{"name":"WIDARGELT","text":"En route, I would make a stop. The place is called Schism. Monks once trained there. In revisiting the past, we may better walk the future."},{"name":"DZENTSA","text":"C'mon, let's get going already!"},{"name":"OTCHAKHA","text":"Oh, have a bit of patience, will you? You are not a child anymore!"},{"name":"WIDARGELT","text":"As a child, I came to this place. We faced fearsome fiends, that we might open our chakra."},{"name":"WIDARGELT","text":"In returning here, I hoped there would be a spark. Inspiration for a new creed. But it is not so simple."},{"name":"OTCHAKHA","text":"Hmmm, the Fist once taught that, through the pursuit of strength, one can approach the sublimity of Rhalgr..."},{"name":"WIDARGELT","text":"A teaching our forebears followed to their undoing. In pursuit of strength, they sought the power of rule. And by that power they were destroyed. Our creed must rise above that dark past. Or it cannot light the way unto the future. Nay, we must find a new path."},{"name":"DZENTSA","text":"Well, there's nothing like a journey for findin' paths. Let's keep moving, Master. Something will come to mind before you know it."},{"name":"WIDARGELT","text":"So I pray, D'zentsa. So I pray. But yes, let us continue on to the Peaks. East to the village of Ala Gannha. There Professor Erik awaits us."},{"name":"DZENTSA","text":"Heh, you feelin' it? 'Cause I'm feelin' it!"},{"name":"OTCHAKHA","text":"My chakra fairly hums for the surfeit of aether. 'Tis plain this was but another ancient battlefield in Gyr Abania's bloody history."},{"name":"WIDARGELT","text":"Ala Gannha. When I return here, I remember. The day the Temple of the Fist was razed."},{"name":"WIDARGELT","text":"On that day, I was training. Like all the days before. Then without warning, we were attacked."},{"name":"WIDARGELT","text":"We all of us fought bravely. Even little ones like me. Desperate to protect our temple. Our home."},{"name":"WIDARGELT","text":"But it was all in vain. One after the other, we fell. All the while the temple burned."},{"name":"WIDARGELT","text":"Some few of us managed to flee. Me with my closest brother, Adri. We stumbled into this village, smoke billowing behind us. But when I looked around, Adri was not there. I never saw him again."},{"name":"WIDARGELT","text":"...Forgive me. Now is not the time for sorrowful recollection. Come, let us look for the professor."},{"name":"VILLAGERA02427","text":"...Go on, then, join the bloody Resistance! Add to the pile of corpses! That's the only difference you're gonna make!"},{"name":"VILLAGERB02427","text":"You're wrong! I'm gonna make a <span class=\"emphasis\">real</span> difference! I'm gonna train hard and honor Rhalgr, and He'll grant me power!"},{"name":"VILLAGERA02427","text":"That power couldn't save the temple─our home! What makes you think it's going to save us now!?"},{"name":"VILLAGERA02427","text":"Don't be a fool! No matter how strong you become, you'd still be one man against the might of the Empire!"},{"name":"VILLAGERB02427","text":"Say what you will, but my mind's made up. I'm not letting the bastard imperials take any more from us. You just...you just take care of yourself, you hear?"},{"name":"VILLAGERA02427","text":"Don't be a fool! No matter how strong you become, you'd still be one man against the might of the Empire! They might be beaten now, but they won't stay beaten forever, mark my words!"},{"name":"VILLAGERB02427","text":"And you mark <span class=\"emphasis\">my</span> words: my mind's made up. I'm not letting the bastard imperials take from us again. You just...you just take care of yourself, you hear?"},{"name":"WIDARGELT","text":"Souls crushed to submission. The fire in their hearts extinguished. To rekindle hope within such people... That must be the purpose of the new Fist."},{"name":"WIDARGELT","text":"...Praise be, I have it. Our new creed."},{"name":"WIDARGELT","text":"To those who have had their homes stolen. Their loved ones taken. Naught is more desirous than strength. The strength to protect that which they hold dear."},{"name":"ERIK","text":"Well, well, I see you have found your answer, and rather more quickly than I had expected of someone who'd sooner strike, rather than think, with his head."},{"name":"ERIK","text":"With the order's purpose thus established, we may consider the question of place. I regret to say, however, that the old temple grounds are currently occupied by the Resistance, and there is naught to indicate that they will vacate any time soon."},{"name":"WIDARGELT","text":"The grounds hold symbolic meaning. A fitting stage for reviving the Fist. But ultimately, the physical location matters not."},{"name":"WIDARGELT","text":"For our mission lies in the spiritual realm. Within people's hearts. There we will rekindle the faith. And all may know the solace of worship."},{"name":"ERIK","text":"That, as they say, is the spirit. Now then, I shall report on how matters stand in the region. But few Fist faithful remain, even accounting for those who practice in secret. Nor has there been any trace of the sect of shadow, not since their misguided leader's downfall. Save for those who came over to the light, it is safe to assume that his ambitions died with him."},{"name":"WIDARGELT","text":"We have a long road ahead. That much is plain. But we will see our journey through. One step at a time. And the first step begins here and now."},{"name":"DZENTSA","text":"Great! ...So, er, what do we do exactly?"},{"name":"WIDARGELT","text":"We hold a demonstration. Give the people tangible proof. Proof that the Fist is returned."},{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span>. First impressions last, and you are the first among us. As such, I would entrust this task to you."},{"name":"ERIK","text":"You may leave it to me to round up the villagers. I shall cry up a veritable storm for the coming spectacle!"},{"name":"WIDARGELT","text":"D'zentsa, O'tchakha. Take the wooden dummy. Set it up on the village outskirts. And <span class=\"highlight\">Forename</span>─limber up, and tell me when you are ready."},{"name":"DZENTSA","text":"People live here?"},{"name":"OTCHAKHA","text":"You'd be forgiven for thinking it's deserted."},{"name":"SYSTEM","text":"A training manikin of Ala Mhigan make has been set in the ground."},{"name":"WIDARGELT","text":"Not many came. Far fewer than I had hoped. But no less of a show will we give them for it."},{"name":"WIDARGELT","text":"Come, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>! Your performance will mark the revival of the Fist of Rhalgr!"},{"name":"WIDARGELT","text":"Lead in with a True Strike! Follow on with a Dragon Kick! Then finish it with a Bootshine!"},{"name":"SYSTEM","text":"True Strike can be performed by first using Form Shift."},{"name":"DZENTSA","text":"No mercy, <span class=\"highlight\">Forename</span>! Sweep the leg!"},{"name":"OTCHAKHA","text":"Zentsa, will you calm down!? Oh, please ignore her!"},{"name":"VILLAGER3333","text":"Hey, ain't that the Fist of Rhalgr?"},{"name":"VILLAGER4444","text":"But I thought all the monks was gone!"},{"name":"WIDARGELT","text":"Good people of Ala Gannha. I am Widargelt. Proud son of Ala Mhigo. And brother of the Fist of Rhalgr."},{"name":"WIDARGELT","text":"All know the sad tale of our order. Years ago, the King of Ruin laid our temple to waste. Our faith was lost to the people."},{"name":"WIDARGELT","text":"But without faith, it is people who are lost. For to lose faith is to lose hope. But we need hope now, in this bleak age. More than ever before."},{"name":"WIDARGELT","text":"So I come before you today. And I beseech you: join me in reviving the Fist of Rhalgr! Let us restore hope to the land!"},{"name":"VILLAGERA02427","text":"You can't fool us! You just want soldiers─fodder for the front lines! You're no different from the accursed Masks!"},{"name":"WIDARGELT","text":"So it was in the past. Our order was seduced by power. Swore allegiance to the royal family. We monks were little more than tools of war."},{"name":"WIDARGELT","text":"But that was the Fist of old. The new Fist serves no king. It hungers not for glory. It thirsts not for blood. Nay, friends. It seeks only to protect that which we hold dear."},{"name":"VILLAGERA02427","text":"Protect..."},{"name":"WIDARGELT","text":"Rhalgr is the Destroyer. As His disciples, there is but one thing we ought to destroy: our own weakness! Therein lies the strength to protect! Therein lies hope!"},{"name":"WIDARGELT","text":"I will not lie: I am no great warrior. My forebears would put me to shame. But I am not alone. Nay, I have stout comrades beside me. Who are no less dedicated to the cause."},{"name":"WIDARGELT","text":"My foremost pupils, D'zentsa and O'tchakha!"},{"name":"WIDARGELT","text":"And <span class=\"highlight\">Forename</span>, whose sublime skills you just witnessed!"},{"name":"WIDARGELT","text":"<span class=\"highlight\">Forename</span>, please say a word to the people."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Join us! Let us begin anew!"},{"name":"A1","text":"Are you ready for pain?"},{"name":"WIDARGELT","text":"Haha, our <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> monk jests. Rest assured <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is a gentle soul."},{"name":"WIDARGELT","text":"To bring you hope, we will give our all! Every onze of our being! This we solemnly swear!"},{"name":"WIDARGELT","text":"My thanks, <span class=\"highlight\">Forename</span>. Your performance paved the way for my words. All present lent their ears. No few opened their hearts."},{"name":"WIDARGELT","text":"Already, villagers have come. Seeking to learn of the new Fist. A fine first showing."},{"name":"WIDARGELT","text":"Our forebears will doubtless be pleased. By restoring the Fist, we honor their memory."},{"name":"WIDARGELT","text":"I shall commence the villagers' training at once. Initiate them into the fundamentals of the faith."},{"name":"WIDARGELT","text":"When that is over, we may continue our mission. Till then, pray see to honing your own skills. Ere long, they will be called upon again!"},{"name":"DZENTSA","text":"That went great, I'd say! Everyone was hangin' off every word!"},{"name":"OTCHAKHA","text":"Master Widargelt spoke from the heart, and the villagers couldn't help but be moved. I'm very proud of him."}],"reward":{"gil":1628,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":21}],"quests":[67962]},"next":[67964]},"partials":[{"type":"npc","id":"1013971","obj":{"i":1013971,"n":"Widargelt","l":67,"q":8}},{"type":"npc","id":"1022390","obj":{"i":1022390,"n":"Widargelt","l":2407,"q":4}},{"type":"npc","id":"1022374","obj":{"i":1022374,"n":"D'zentsa","l":67,"q":2}},{"type":"npc","id":"1022375","obj":{"i":1022375,"n":"O'tchakha","l":67,"q":2}},{"type":"npc","id":"1022384","obj":{"i":1022384,"n":"Widargelt","l":2406,"q":1}},{"type":"npc","id":"1022385","obj":{"i":1022385,"n":"D'zentsa","l":2406,"q":1}},{"type":"npc","id":"1022386","obj":{"i":1022386,"n":"O'tchakha","l":2406,"q":1}},{"type":"npc","id":"1022387","obj":{"i":1022387,"n":"Widargelt","l":2407,"q":1}},{"type":"npc","id":"1022388","obj":{"i":1022388,"n":"D'zentsa","l":2407,"q":1}},{"type":"npc","id":"1022389","obj":{"i":1022389,"n":"O'tchakha","l":2407,"q":1}},{"type":"npc","id":"1022391","obj":{"i":1022391,"n":"D'zentsa","l":2407,"q":4}},{"type":"npc","id":"1022392","obj":{"i":1022392,"n":"O'tchakha","l":2407,"q":4}},{"type":"quest","id":"67962","obj":{"i":67962,"n":"A Fistful of Resolve","g":148,"l":"Ul'dah","s":601,"f":1}},{"type":"quest","id":"67964","obj":{"i":67964,"n":"Cross-fist Training","g":148,"l":"The Peaks","s":650,"f":1}}]}