{"quest":{"name":"Golden Rain","location":"Ul'dah","id":67960,"patch":3.55,"sort":136,"icon":100634,"eventIcon":71221,"issuer":1019794,"target":1019796,"genre":200,"journal":["This beggarly bloke seems to want for an ear to listen to his woes.<br>※This quest is available for a limited time only.","The beggarly bloke jumps at the chance to start up a conversation, promptly regaling you with tiresome tales of his financial woes. Just as you reach for your coinpurse to toss him a gil and move on, he mentions that the Gold Saucer is currently hosting the Make It Rain campaign, an annual festival where guests have the chance to win magnificent prizes galore. Interest piqued, you make your way to the Ruby Road Exchange to find out more from the Saucer attendant.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The Saucer attendant has barely begun her explanation of the festivities when she is interrupted by none other than the Saucer's esteemed owner, Godbert Manderville. Greeting you with all the flair one would expect from a Manderville man, he offers you a limited-edition VIP card bearing the stamp of House Manderville. His duty done, Godbert returns to the Saucer and the attendant instructs you to present your card to Ollier in Wonder Square.","You show your VIP card to an enthusiastic Ollier, who informs you of the myriad of spectacular prizes now within your reach─should the Spinner smile upon you, of course. With clouds of untold riches billowing on the horizon, you stride confidently into the Saucer, knowing that the time has come to <span class=\"emphasis\">make it rain</span>."],"objectives":["Speak with the Saucer attendant.","Present the stamped Gold Saucer VIP card to Ollier."],"dialogue":[{"name":"LOSER02424","text":"A gil for your thoughts, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>─oh, what am I saying!? Ever since I was forced to close my armor shop, gil's been harder to come by than an honest member of the Mirage Trust. Whatever is a penniless pauper like myself to do!?"},{"name":"LOSER02424","text":"I'm not asking for boundless riches here! If only I had a few gil, I could head to the Gold Saucer and reclaim all that I've lost. They say it's as if MGP is raining down from the heavens these days! "},{"name":"LOSER02424","text":"Mind you, if you're as well-to-do as you appear, you should really speak to the attendant come to the Ruby Road Exchange to promote the festivities. I'm sure she'll be much more keen to help those who are less...destitute."},{"name":"LOSER02424","text":"What's with that puzzled look? Don't tell me you've never been to the Gold Saucer! If that's the case, go and speak to that well-heeled youth over yonder─the one that looks like a foppish dandy of sorts. He'll furnish you with a ticket. Sadly for me, that's where his generosity ends."},{"name":"GSFESSTAFF","text":"Interested in visiting the Gold Saucer? Why, you could not have picked a better time! We are currently in the midst of our annual festival, where our honored guests can look forward to basking in a veritable downpour of spectacular prizes!"},{"name":"GSFESSTAFF","text":"You say this will be your first trip to the Saucer? All the more reason for you to make the journey and see all the wonders our establishment has to offer!"},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the quest “It Could Happen to You,” which can be undertaken at level 15."},{"name":"GSFESSTAFF","text":"That's why we have dubbed the festivities the <span class=\"emphasis\">Make It Rain</span> campaign. But it's not just about the prizes, oh no! You can also look forward to─"},{"name":"GODBERT","text":"Well, if it isn't <span class=\"highlight\">Forename</span> from Thanalan! The way you lifted your legs and put up your hands, you were the very image of a Manderville man! Tell me, have you had a chance to partake in the festivities at my darling Gold Saucer?"},{"name":"GODBERT","text":"Oho, look who we have here! My muscles have not forgotten the tender touch of those soothing fingers. Why, if we were not both otherwise occupied, I would ask you to crack open a fine bottle of salamander oil and get to work once more! Hahaha. Now tell me, have you had the chance to partake in the festivities at my darling Gold Saucer?"},{"name":"GODBERT","text":"Oho, what have we here? Another adventurer come to make their dreams come true in my hall of wonders? I am Godbert Manderville, proprietor of the Saucer, to which I most heartily welcome you. Mayhap you have already partaken in the festivities?"},{"name":"GODBERT","text":"I can personally assure you that Manderville & Manderville has spared no expense in procuring a selection of prizes that is sure to tantalize and titillate fortune seekers of all stripes."},{"name":"GODBERT","text":"Fortune may rule in the halls of my Gold Saucer, but it was by no mere chance that our paths crossed today. And that is why I would present you with a gift befitting this most momentous occasion!"},{"name":"GODBERT","text":"Use it, and use it well. And with that, I must be off─countless guests are waiting for the firm handshake and stimulating discourse that only a Manderville man can deliver!"},{"name":"GSFESSTAFF","text":"Well, I do believe Lord Manderville said it all! Once you arrive at the Gold Saucer, seek out my fellow attendant Ollier in Wonder Square. Simply present to him your VIP card, and he will see to it that you are well looked after."},{"name":"LOSER02424","text":"Oh, don't worry yourself on my account. I'll just be standing here, penniless and half-starved, taking the smallest of solace in the knowledge that at least some complete stranger is out there making <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> dreams come true."},{"name":"LOSER02424","text":"If you've never been to the Gold Saucer before, try speaking with that well-heeled youth over yonder─the foppish dandy who's wearing that shite-eating grin. I'm sure he'll furnish you with a ticket. If only gil were as easy to come by..."},{"name":"OLLIER","text":"Dearest adventurer, allow me to extend a most heartfelt and sincere welcome to the Gold Saucer! I trust you are finding the festivities to your liking? Whatever you have experienced thus far, let me assure you that the wonders have only begun."},{"name":"OLLIER","text":"Why, is that what I think it is? A VIP card, and one personally stamped by Lord Manderville himself, no less!? It would be my absolute pleasure to redeem that on your behalf, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"OLLIER","text":"Ah, seeing that signet always inspires me to redouble my efforts on behalf of our distinguished guests. But pray forgive me─I have strayed quite far from the topic at hand. I am pleased to announce that the services of our campaign attendant─and a host of spectacular prizes─are now at your disposal."},{"name":"OLLIER","text":"Now, I daresay I've delayed you long enough. Enjoy the festivities, and may the Spinner guide you to fortunes beyond your wildest dreams!"},{"name":"SYSTEM","text":"You can now purchase seasonal items from the campaign attendant. Please note that you will be unable to do so after the seasonal event has ended. For details, please check the Lodestone."},{"name":"GSFESSTAFF","text":"Once you arrive at the Gold Saucer, seek out my fellow attendant Ollier in Wonder Square. Simply present to him the card you received from Lord Manderville, and he will see to it that you are well attended to."}],"reward":{"gil":254,"items":[{"id":14971}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66043,66064]}},"partials":[{"type":"npc","id":"1019794","obj":{"i":1019794,"n":"Beggarly Bloke","l":40,"q":1}},{"type":"npc","id":"1019796","obj":{"i":1019796,"n":"Ollier","l":1484,"q":1}},{"type":"item","id":"14971","obj":{"i":14971,"n":"MGP Gold Card","l":1,"c":26173,"t":61}},{"type":"quest","id":"66043","obj":{"i":66043,"n":"The Gridanian Envoy","g":1,"l":"Gridania","s":86}},{"type":"quest","id":"66064","obj":{"i":66064,"n":"The Ul'dahn Envoy","g":1,"l":"Ul'dah","s":88}}]}