{"quest":{"name":"The Butterfly Effect","location":"Ul'dah","id":67968,"patch":4.0,"sort":630,"icon":100690,"unlocksFunction":1,"eventIcon":71341,"issuer":1003818,"target":1019811,"involved":[1019812,1019813],"genre":141,"usedItems":[17917,17918],"journal":["Redolent Rose's eyes are gleaming with excitement as you approach.","You arrive at the guild to find Redolent Rose beside himself with joy at the sheer variety and quality of silks that arrived in the first shipment from the Far East. He also shares with you some unexpected news: Master Keimei of Daitenya has invited you to Kugane to personally oversee a series of commissions of considerable import. With the blessing of your guildmaster, you set off for the land of Hingashi, that you might forge yet stronger bonds with your new trading partner, and broaden your aesthetic horizons in the process.","Master Keimei welcomes you to Kugane and promptly explains the nature of his request: he intends to bring the trends of Eorzea to the Far East and usher in a new age of fashion and enlightenment. To that end, he would have you weave a dress in the Ishgardian tradition to be worn by a geiko─a Hingan dancing girl─who has struck his fancy. Head to Sanjo Hanamachi─the flower district─to learn more about the request from the girl herself.","You arrive in the Hanamachi to find that the geiko in question, by the name of Kotocho, is none other than the young woman who had accompanied Master Keimei to Ul'dah. She reveals, under the condition of secrecy, that the idea of bringing Western fashions to her homeland was originally her own, though one that the young master was quick to adopt. She would have you fashion for her a dress in the Ishgardian style, with a butterfly motif to match the meaning of her assumed name, in hopes of rising above her peers and claiming a position of prominence in the flower district. Impressed with the girl's ambition and resolve, you make for Daitenya to procure the fabrics you require.","Master Keimei is most impressed with Kotocho's concept for the dress, and encourages you to commence work on it as soon as you are able. Any materials you need, he explains, will be provided to you free of charge if you but speak with Yagiri, who attends the stall beside him.","Yagiri is more than eager to furnish you with an ample quantity of fine Ul'dahn fabric, imported especially for the occasion by Master Keimei. He assures you that there is plenty more in stock, and that you need only speak to him again should your initial efforts not be to your satisfaction.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Yagiri.","Master Keimei is quite taken with the dress you have fashioned, and immediately summons Kotocho from the flower district, that she might slip her arms through its sleeves. She emerges wearing your creation, the very picture of Eastern and Western sensibilities come together as one, and all present bask in her beauty. With Master Keimei's encouragement, she vows not to let your needlework go to waste, confidently declaring that she will usher in a new age of fashion in the Hanamachi, and Kugane as a whole. Continue to hone your skills, that you might continue to provide her with daring new fashions that will challenge the conventional sensibilities of this land.<br><br>※The next weaver quest will be available from Keimei upon reaching level 65."],"objectives":["Speak with Keimei in Kugane.","Speak with Kotocho in the Hanamachi.","Report to Keimei.","Speak with Yagiri and obtain the necessary materials.","<span class=\"alternative-container\"><span class=\"alternative\">Craft an elegant bustle <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the elegant bustle <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Keimei</span></span>."],"dialogue":[{"name":"REDOLENTROSE","text":"Ah, <span class=\"highlight\">Forename</span>! You must see the shipment of silks that just arrived from our new friends from across the Ruby Sea. Simply exquisite, if I do say so myself. I can scarcely wait to see what wonders our weavers might work with them."},{"name":"REDOLENTROSE","text":"Ah, but before that, there is a more important task at hand. The package also contained a letter from Daitenya, personally requesting your presence in Kugane to oversee a series of commissions that─in Master Keimei's own words─“could forever shape the fashion trends of our nation.”"},{"name":"REDOLENTROSE","text":"A rather unusual request, but one that speaks to the importance of the client and Master Keimei's own uncompromising devotion to the quality of his wares. I can see no reason to refuse."},{"name":"REDOLENTROSE","text":"It will, needless to say, entail a long and wearying journey, but you wouldn't think of turning down an opportunity to study the fashions of the Far East─and to curry favor with a valuable business partner in the process─would you?"},{"name":"REDOLENTROSE","text":"Of <span class=\"emphasis\">course</span> you wouldn't! I look forward to seeing what wonders you might work with your needle the next time we meet. Godsspeed, and do convey my regards to Master Keimei."},{"name":"REDOLENTROSE","text":"Why are you still dallying about here, <span class=\"highlight\">Forename</span>? Master Keimei is waiting for you in Kugane, and we must keep our business partners happy."},{"name":"KEIMEI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! It is a pleasure and an honor to welcome you to Kugane. I trust that your journey was not an unpleasant one?"},{"name":"KEIMEI","text":"Allow me to explain why I have summoned you all the way to these shores. Mayhap you remember that most exquisite Ishgardian bustle we saw at the ball in Ul'dah. I would commission from you a similar garment, that I might gift it to a certain <span class=\"emphasis\">geiko</span> who has struck my fancy."},{"name":"KEIMEI","text":"Ah, but forgive me─our culture and tongue are still unfamiliar to you, no doubt. Trained in the traditional arts of song and dance, the women we call geiko entertain at feasts, banquets and the like. You might think of them as akin to the dancing girls of your land...albeit clad in more modest dress."},{"name":"KEIMEI","text":"It is a popular pastime among the moneyed class of Kugane to seek out a young maiko─as geiko-in-training are known─and become her patron, lending her whatever support one might. Seeing a faltering child blossom into a beautiful flower─and knowing that you played a part in her journey─is a pleasure like none other."},{"name":"KEIMEI","text":"I am pleased to say that a particular maiko whom I took under my wing some time ago has formally been promoted to the position of geiko. At first, I thought to present her with the finest kimono from my own stock, but where would be the romance in that!?"},{"name":"KEIMEI","text":"No, to truly do justice to the occasion, I would gift her with a dress fashioned by one of Eorzea's most renowned weavers─that would be you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>!"},{"name":"KEIMEI","text":"This is a new age, my friend, and it is past time that the people of Kugane opened their eyes and hearts to the culture and customs of the West. Where is it written that my precious butterfly cannot perform a Hingan dance clad in Ishgardian silks? Nowhere, I say! As a fellow aesthete, surely you agree?"},{"name":"KEIMEI","text":"Now, I would have you speak to the girl in question, that you might best tailor your work to both her form and her needs. You will find her in Sanjo Hanamachi─the flower district, as one might say in your tongue─where she and her fellow geiko reside."},{"name":"KEIMEI","text":"Does the thought of ushering in a new age of fashion in Kugane not excite you, my friend? You will find my little butterfly in Sanjo Hanamachi, the flower district, where she and her fellow geiko reside."},{"name":"KOTOCHO","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Master Keimei said he would call for you, but I did not believe you would come. You have proven me wrong, and for this I am grateful. I am Kotocho."},{"name":"KOTOCHO","text":"Do not speak of this with Master Keimei, but in truth, commissioning from you a dress in the Ishgardian tradition was not his idea, but my own."},{"name":"KOTOCHO","text":"To make a name for oneself here in the Hanamachi, mere skill at song and dance will not suffice. No, one must possess a unique quality─something to catch the eye of the audience, to stand above and distinguish oneself from the shrubs and the weeds."},{"name":"KOTOCHO","text":"Master Keimei was quite taken with my idea. I would have been content with the dress alone, but he insisted on bringing you here in person, that you might tailor it especially to me. You do us both a great honor, and for this we thank you."},{"name":"KOTOCHO","text":"I have but two simple requests: the bustle should be of the same color as the kimono I now wear, with a pattern evoking the wings of a butterfly. That is the meaning of my name, you see─a name given to me for my ephemeral beauty. Master Keimei will furnish you with the material you require."},{"name":"KOTOCHO","text":"It is said that a geiko's kimono is as a suit of armor is to a samurai─and let me assure you that the battles fought here in the Hanamachi are as fierce as those fought on any battlefield. The dress you fashion for me will be my armor. I place my very life in your hands."},{"name":"KOTOCHO","text":"I would have you fashion me a bustle true to my name─one that calls to mind the fragile, ephemeral beauty of a butterfly. Master Keimei will furnish you with any materials you may need."},{"name":"KOTOCHO","text":"Remember, the dress you fashion for me will be my suit of armor. I place my life in your hands, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"KEIMEI","text":"You have spoken with Kotocho, I presume? What manner of dress did my butterfly request of you?"},{"name":"KEIMEI","text":"Frills akin to a butterfly's wings? A most inspired idea, if I do say so myself. Kotocho is an ambitious girl, and most particular about the garments she wears. It is no small task, but I have full confidence in your ability to fashion a dress that will help her rise above the crowd."},{"name":"KEIMEI","text":"Needless to say, Daitenya is honored to provide you with any materials you require free of charge. You need but speak to my man Yagiri here and inform him of your needs."},{"name":"KEIMEI","text":"How fare you with Kotocho's dress? Should you find yourself wanting for materials, you need only speak to my man Yagiri and inform him of your needs."},{"name":"YAGIRI","text":"Daitenya welcomes you, honored guest. I am Yagiri. The young master has instructed me to provide you with the materials you require for his butterfly's bustle. I do believe this should suffice."},{"name":"YAGIRI","text":"The young master has imported some of the finest Ul'dahn silks especially for this occasion. Should your work─and Kotocho's dancing prowess─capture the public eye, he believes that a new wind will blow in Kugane, so to speak. It is his dream to see the girl become the face of a new age of aesthetic ideals."},{"name":"YAGIRI","text":"That said, not all approve of the young master's aspirations. When he first declared his intention to deal in Eorzean fabrics and fashions, the reaction from some of Kugane's more conservative artisans and merchants was far from encouraging."},{"name":"YAGIRI","text":"Still, Master Keimei will not be deterred in his vision, and those of us who share his sensibilities would have it no other way. May the kami guide your needle, that Daitenya might usher in a new era in Hingashi. Should you require additional fabrics, you need but say the word."},{"name":"SYSTEM","text":"To proceed with the quest, use the materials provided by Yagiri to craft an elegant bustle."},{"name":"SYSTEM","text":"Should your synthesis efforts prove unsuccessful, speak with Yagiri once more to receive another set of materials."},{"name":"SYSTEM","text":"To begin the crafting process, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>. Next, select <span class=\"highlight\">Special Recipes</span> from within the requisite crafting discipline, then <span class=\"highlight\">Story</span>, and lastly <span class=\"highlight\">Class Quests</span> to locate the desired recipe."},{"name":"YAGIRI","text":"The very future of Daitenya rests on the young master's shoulders─and in turn, in your deft hands. Should you require additional fabrics for the crafting of Kotocho's dress, you need but say the word."},{"name":"YAGIRI","text":"Your work is complete, you say? The young master will be most eager to examine it with his own eyes. Pray show it to him at once."},{"name":"KEIMEI","text":"The job is done, you say? Splendid! My heart has not stopped pounding since you began work. You must show me what you have wrought before it bursts!"},{"name":"KEIMEI","text":"Remarkable! Why, it is so light and gossamer it seems about to take flight! I would have Kotocho try it on at once. Yagiri, send a messenger to the Hanamachi with all haste."},{"name":"KOTOCHO","text":"What say you, young master? Does it suit me?"},{"name":"KEIMEI","text":"Beyond my wildest dreams, my dearest Kotocho! The inimitable elegance of an Ishgardian countess, combined with the fragile grace of a fluttering butterfly─you shimmer and shine with the beauty of two worlds brought together as one."},{"name":"KEIMEI","text":"Wear this dress at your first public appearance as a geiko, and all in attendance will lose themselves in rapturous bliss─I am certain of it!"},{"name":"KOTOCHO","text":"You are most kind, young master. I feared that such extravagant attire might not suit me, but my fears are no more. I am honored to begin my new life as a geiko with your most exquisite creation, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"KOTOCHO","text":"To the both of you, this I promise: I will not let your generous gift go to waste. Yes, Kotocho shall spread her wings and fly high, ushering in the winds of change to Kugane!"},{"name":"SYSTEM","text":"In honing your aesthetic sensibilities as a weaver, you have learned “Quality Assurance”!"}],"reward":{"gil":1871,"items":[{"num":250,"id":12},{"id":19522},{"id":19623,"one":1},{"id":19624,"one":1},{"id":19625,"one":1},{"id":19626,"one":1},{"num":5,"id":5825,"one":1}],"xp":1725300},"reqs":{"jobs":[{"lvl":63,"id":14}],"quests":[67967]},"next":[67969]},"partials":[{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1019811","obj":{"i":1019811,"n":"Keimei","l":2404,"q":4}},{"type":"npc","id":"1019812","obj":{"i":1019812,"n":"Yagiri","l":2404,"q":4}},{"type":"npc","id":"1019813","obj":{"i":1019813,"n":"Kotocho","l":2404,"q":1}},{"type":"item","id":"19522","obj":{"i":19522,"n":"Larch Spinning Wheel","l":200,"c":35561,"t":23,"p":28512}},{"type":"item","id":"19623","obj":{"i":19623,"n":"Ruby Cotton Coatee","l":200,"c":43810,"t":35,"p":26136}},{"type":"item","id":"19624","obj":{"i":19624,"n":"Gyuki Leather Gloves of Crafting","l":200,"c":44573,"t":37,"p":15681}},{"type":"item","id":"19625","obj":{"i":19625,"n":"Ruby Cotton Bottoms","l":200,"c":45976,"t":36,"p":26136}},{"type":"item","id":"19626","obj":{"i":19626,"n":"Gyuki Leather Shoes","l":200,"c":46758,"t":38,"p":15681}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17917","obj":{"i":17917,"n":"Bustle Materials","l":270,"c":23001,"t":63}},{"type":"item","id":"17918","obj":{"i":17918,"n":"Elegant Bustle","l":270,"c":42484,"t":63}},{"type":"quest","id":"67967","obj":{"i":67967,"n":"When East Meets West","g":141,"l":"Ul'dah","s":601,"f":1}},{"type":"quest","id":"67969","obj":{"i":67969,"n":"The Crane's Caveat","g":141,"l":"Kugane","s":650,"f":1}}]}