{"quest":{"name":"The Crane's Caveat","location":"Kugane","id":67969,"patch":4.0,"sort":650,"icon":100690,"unlocksFunction":1,"eventIcon":71341,"issuer":1019811,"target":1019811,"involved":[1019812,1019814],"genre":141,"usedItems":[17919,17920],"journal":["Keimei would have you fashion another masterwork for his butterfly.","The dress that you fashioned for Kotocho has clearly made an impression. To hear Master Keimei tell it, the girl is the new darling of the Hanamachi, and─despite her relative lack of experience─has received an unprecedented invitation to perform at the inaugural Kaiko-odori, a festival celebrating the opening of Kugane's port to the world. The young master is eager to capitalize on the opportunity, and would have you fashion for the girl a garment that will capture the eyes of the numerous foreign dignitaries who are expected to attend. Seek out Kotocho, that you find the inspiration you need to commence work on your next masterpiece.","After a brief discussion with Kotocho, you conclude that a spring dress would be ideal for the occasion─affording both the freedom of movement needed to flutter elegantly across the grand stage, as well as an exotic touch to impress a cultured, discerning audience. Resolving to once again do what you can to help see the ambitious geiko's dreams realized, you make for Daitenya to procure the necessary materials from Master Keimei.","Master Keimei is most intrigued by your design concept, if a bit uncomfortable with the prospect of his precious butterfly exposing too much shoulder. Nonetheless, he gives you his blessing to commence your needlework, assuring you that his man Yagiri will once again provide you with any and all materials you require.","Yagiri offers his gratitude for your continued efforts, commenting that the popularity of your work has business booming and the young master in particularly high spirits. He hands you a healthy quantity of exceedingly fine fabric, and encourages you to continue your most exquisite work.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Yagiri.","Master Keimei rejoices upon seeing your handiwork and immediately summons for Kotocho. The girl has scarcely slipped her arms through the sleeves when the three of you are joined by Kototsuru, a veteran geiko who is less than impressed with what she perceives as her junior's lack of respect for modesty and tradition. With an ominous warning that the girl's fame is doomed to be fleeting, she walks away. Kotocho, for her part, is more determined than ever, and you and Master Keimei vow to redouble your efforts to see that her debut on the grandest of stages is every bit a success.<br><br>※The next weaver quest will be available from Keimei upon reaching level 68."],"objectives":["Speak with Kotocho in Sanjo Hanamachi.","Report to Keimei.","Speak with Yagiri and obtain the necessary materials.","<span class=\"alternative-container\"><span class=\"alternative\">Craft a winsome spring dress <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the winsome spring dress <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Keimei</span></span>."],"dialogue":[{"name":"KEIMEI","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I cannot thank you enough. It would be no overstatement to say that your bustle has swept the discriminating patrons of the Hanamachi clear off their feet. Though she may lack the experience and name value of her seniors, Kotocho's services are in the highest of demand."},{"name":"KEIMEI","text":"As proof of this, my butterfly has received the most prestigious of invitations─a call to perform at the inaugural Kaiko-odori!"},{"name":"KEIMEI","text":"The Kaiko-odori is to be a celebration of the opening of Kugane's port to the world, and an ideal opportunity to introduce our cultural traditions to foreign dignitaries and luminaries who have just recently arrived on Hingan shores."},{"name":"KEIMEI","text":"Only the most accomplished and celebrated geiko are being chosen for this occasion. For a fledgling such as Kotocho to receive the call─this can only be a sign that a new dawn is breaking before our eyes!"},{"name":"KEIMEI","text":"When my butterfly makes her debut before the world, none but the finest of dresses will do! Might I commission your services once more, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? I would trust the job to none other!"},{"name":"KEIMEI","text":"As before, the particulars of the design I shall leave to Kotocho herself. Clearly, the girl possesses an unparalleled eye for fashion. Pray visit her in the Hanamachi and see what she has in mind."},{"name":"KEIMEI","text":"I simply cannot wait to see my butterfly soar high on the grandest of stages! Pray visit Kotocho and gather the inspiration for your next creation. Like as not, you will find her at her residence in Sanjo Hanamachi."},{"name":"KOTOCHO","text":"It is an honor to welcome you back, friend. The bustle you fashioned for me has caught the eye of many. Night after night am I summoned by the wealthiest merchants and landowners of Kugane, who would spare no expense to spend a night in my company."},{"name":"KOTOCHO","text":"But why limit myself to my own countrymen, when there is a whole world out there to enthrall and entrance? If I can win the favor of our honored guests at the Kaiko-odori, there is no telling the heights to which I may soar. Dreams I never dared to dream will be within my reach!"},{"name":"KOTOCHO","text":"However, one matter concerns me. I am accustomed to dancing in inns and teahouses, and yet these festivities will be held outdoors─under the open sky. I wonder, what manner of dresses are preferred for such an occasion in your homeland?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"One that lets your shoulders breathe."},{"name":"A1","text":"One that will allow you to move freely."},{"name":"A1","text":"Yes, there can be no doubt of it..."},{"name":"KOTOCHO","text":"You do not think that would better suit the girls in the pleasure district? ...But forgive me─I understand that Eorzean customs differ from my own. Doubtless the sort of dress you speak of would make an impression. Whatever would one call such a garment, might I ask?"},{"name":"KOTOCHO","text":"...I see. Yes, on a wide-open stage, I cannot afford to wear a garment that might restrict my range of motion. A dress of light, supple fabric would certainly suffice. Whatever would one call such a garment, might I ask?"},{"name":"KOTOCHO","text":"...A “spring dress,” you say? How very delightful. It calls to mind cherry blossoms dancing and twirling in a gentle breeze─why, the very thought sets my heart aflutter."},{"name":"KOTOCHO","text":"But do not forget, friend: light and airy though it may be, this dress will serve as my armor in my fiercest battle yet. I am counting on you to see that I emerge triumphant. Do pass along my regards to the young master."},{"name":"KOTOCHO","text":"How do you fare with my dress, friend? Should you want for materials, the young master will provide you with anything you may need."},{"name":"KEIMEI","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! Do tell—what manner of dress do you intend to fashion for my butterfly this time?"},{"name":"KEIMEI","text":"...A dress that flutters like petals in a spring breeze? How absolutely delightful! I can only begin to envision what you have in mind, but surely it will evoke a sense of freedom and frolic entirely unlike our traditional kimono. Please begin your work with my blessing."},{"name":"KEIMEI","text":"As before, I have instructed Yagiri to provide you with all the fabric you require. May the kami be with you, my friend─I can scarcely wait to see what wonders your needle will work this time!"},{"name":"KEIMEI","text":"Yagiri will provide you with all the material you may need. May the kami guide your hand!"},{"name":"YAGIRI","text":"Welcome back, honored guest. Say no more─the young master has told me everything. It is again my honor to furnish you with the finest fabrics from our stock."},{"name":"YAGIRI","text":"Thanks in no small part to your masterwork, Kotocho has become the darling of the flower district, and orders for Western fashions have been coming in night and day. The young master can be reserved in showing his emotions, but even he is finding it difficult to conceal his joy."},{"name":"YAGIRI","text":"Needless to say, we at Daitenya are honored to support your efforts in whatever humble manner we may. Should you lack for materials, you need but say the word."},{"name":"YAGIRI","text":"We at Daitenya are honored to support your efforts in whatever humble manner we may. Should you lack for materials, you need but say the word."},{"name":"YAGIRI","text":"The dress is complete, you say? The young master will want to see it at once."},{"name":"KEIMEI","text":"Your work is done? Splendid! Pray show me what marvel you have fashioned for my butterfly today."},{"name":"KEIMEI","text":"...This is simply stunning, my friend. I knew you would not let us down. That said, is the neckline not a touch...low? No matter─we must summon Kotocho at once! Yagiri, send a messenger to the Hanamachi!"},{"name":"KOTOCHO","text":"Young master...<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. What say you?"},{"name":"KEIMEI","text":"I say nothing, my butterfly, for your unspeakable beauty has robbed me of all words. My worries about the neckline were for naught. The slender grace of your shoulders─why, you are as a delicate orchid blooming in the warmth of the spring sun."},{"name":"KEIMEI","text":"Yes, I can see it now...! When you dance for the world at the Kaiko-odori, a spring breeze will blow down from the mountains high and sweep Hingan and ijin alike into a glorious rapture!"},{"name":"KOTOCHO","text":"Your words make me blush, young master. It is by your patronage and the talents of <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> that I have come this far. But I assure you this is only the beginning. When I take the stage at the Kaiko-odori, a new legend will be born!"},{"name":"KOTOTSURU","text":"A <span class=\"emphasis\">legend</span>...? I trust this means you will not be tripping over your own two feet, as you did at yesterday's lesson? And the day before, for that matter..."},{"name":"KOTOCHO","text":"Forgive me, Kototsuru. I meant no disrespect. I know your dancing ability far exceeds my own, but must you be so cruel about it?"},{"name":"KOTOTSURU","text":"I speak only the truth. A truth that all can see─all save this two-koban rag merchant, and the amateur aesthetes who waste their coin on a clumsy child who hides her shameful lack of skill with gaudy, uncultured garb."},{"name":"KOTOCHO","text":"Why...I may be a child, and my skill at dance may yet be lacking, but I am training as hard as any in the flower district! I am winning hearts with each passing day─every night, new customers flock to see me!"},{"name":"KOTOTSURU","text":"New customers? I ask you this, my clumsy little caterpillar: how many of them come <span class=\"emphasis\">back</span>? You are a curiosity─an oddity, and little more. One night with you and your outlandish dresses, and they have had their fill for a lifetime."},{"name":"KOTOTSURU","text":"There are only so many patrons─<span class=\"emphasis\">wealthy</span> patrons─in Kugane, and they value tradition. Fail to win their hearts, and your career will be as fleeting as the cicada who will not live to see the autumn. But I must be on my way. My customers are calling."},{"name":"KEIMEI","text":"That was Kototsuru, the most senior and celebrated of all the geiko. She is also the one charged with training her younger “sisters”─though she can be something of a harsh taskmistress, as you just saw."},{"name":"KOTOCHO","text":"I...I'll show her! There is more to being a geiko than stuffy old traditions! I may still be young, but <span class=\"emphasis\">I</span> am the future of Kugane! I will soar high atop the flower district long after that fusty old crane has gone home to roost."},{"name":"KOTOCHO","text":"She can keep her stuffy old bureaucrats and merchants! I require no more than the young master and <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> at my side. Kotocho's star is rising, and at the Kaiko-odori, it will shine brightest of all!"},{"name":"SYSTEM","text":"In heightening your aesthetic sensibilities as a weaver, you have learned “Manipulation”!"}],"reward":{"gil":821,"action":4579,"items":[{"num":250,"id":12},{"id":19532},{"id":19633,"one":1},{"id":19634,"one":1},{"id":19635,"one":1},{"id":19636,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":14}],"quests":[67968]},"next":[67970]},"partials":[{"type":"npc","id":"1019811","obj":{"i":1019811,"n":"Keimei","l":2404,"q":4}},{"type":"npc","id":"1019812","obj":{"i":1019812,"n":"Yagiri","l":2404,"q":4}},{"type":"npc","id":"1019814","obj":{"i":1019814,"n":"Kotocho","l":2404,"q":1}},{"type":"action","id":"4579","obj":{"i":4579,"n":"Manipulation","c":1985,"j":13,"t":7,"l":65}},{"type":"item","id":"19532","obj":{"i":19532,"n":"Dzo Horn Needle","l":220,"c":35523,"t":22,"p":31363}},{"type":"item","id":"19633","obj":{"i":19633,"n":"Kudzu Robe of Crafting","l":220,"c":43812,"t":35,"p":28749}},{"type":"item","id":"19634","obj":{"i":19634,"n":"Durium Chaplets","l":220,"c":48275,"t":37,"p":17249}},{"type":"item","id":"19635","obj":{"i":19635,"n":"Kudzu Culottes of Crafting","l":220,"c":45973,"t":36,"p":28749}},{"type":"item","id":"19636","obj":{"i":19636,"n":"Tigerskin Boots of Crafting","l":220,"c":46760,"t":38,"p":17249}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17919","obj":{"i":17919,"n":"Spring Dress Materials","l":276,"c":23001,"t":63}},{"type":"item","id":"17920","obj":{"i":17920,"n":"Winsome Spring Dress","l":276,"c":42374,"t":63}},{"type":"quest","id":"67968","obj":{"i":67968,"n":"The Butterfly Effect","g":141,"l":"Ul'dah","s":630,"f":1}},{"type":"quest","id":"67970","obj":{"i":67970,"n":"A Geiko for All Seasons","g":141,"l":"Kugane","s":680,"f":1}}]}