{"quest":{"name":"The Power to Protect","location":"The Peaks","id":67966,"patch":4.0,"sort":700,"icon":100672,"unlocksFunction":1,"eventIcon":71341,"issuer":1022390,"target":1022390,"involved":[1022391,1022392,1022532,1022533,1022534,1022538,1022539,1022540,1022541,1022548],"genre":148,"journal":["Widargelt's jaw is set in a look of resolve.","With Erik having recovered from his injuries, Widargelt is now ready to issue his challenge to Theobald. To avoid the risk of premature bloodshed, you have been tasked with bearing the letter to his opponent, who has made Rustrock his hideout.","You present the letter of challenge to Theobald, and he haughtily accepts. Take word to Widargelt at Schism.","Theobald arrives at the prescribed hour, and he and Widargelt square off before the gathered villagers. But before fists fly, it is revealed that Theobald is in fact Adri, Widargelt's dear comrade from his time at the Temple of the Fist. Made to feel powerless due to his low birth, he resents Widargelt for spurning his royal blood and the might it represents. Once the talking ends and they engage, it becomes clear that Widargelt has the upper hand, and Adri summons his minions to his aid and resorts to using imperial weaponry. For a blessing, Hamon appears with Chuchuto and Rurukuta, having been informed of the duel, and they join the fray to even the odds. At the end of a long struggle, you and yours emerge triumphant.","To a cheering crowd, Widargelt renews his promise to revive the Fist of Rhalgr. As the dust settles, speak with your comrades to hear their thoughts on the conclusion of events.","Praising Widargelt for his heartfelt speech, Hamon heads back to Ul'dah with his two pupils in tow. D'zentsa and O'tchakha, meanwhile, reaffirm their resolve to grow stronger, that they might better support their master in his endeavors. Last but not least, Erik expresses his gratitude for the role you played in helping Widargelt to forge on in the face of adversity. With the others having taken their leave, you may now give your undivided attention to your brother monk.","Widargelt reflects upon all the lessons he has learned, and bids you farewell as he resumes his mission to revive the Fist of Rhalgr. Till next your paths cross, continue to help others as you have helped him.<br><br>※The next monk quest will be available from Erik once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “Courage Born of Fear.”"],"objectives":["Deliver Widargelt's challenge to Theobald at Rustrock.","Speak with Widargelt at Schism.","Speak with Hamon.","Speak with O'tchakha.","Speak with Erik.","Speak with Widargelt.","Defeat the enemy!"],"dialogue":[{"name":"WIDARGELT","text":"The professor is well again. The time is come. I will issue Theobald my challenge."},{"name":"WIDARGELT","text":"He and his minions use Rustrock as their hideout. But who should bear the letter there?"},{"name":"Q1","text":"Who should deliver the letter of challenge?"},{"name":"A1","text":"I will go."},{"name":"A1","text":"You should go."},{"name":"WIDARGELT","text":"You, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>? Is this wise? What if they set upon you again? No, better that I go."},{"name":"WIDARGELT","text":"You are right, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. It is fitting that I go."},{"name":"OTCHAKHA","text":"Master, wait. If you deliver the letter, it will most certainly end in blood. <span class=\"highlight\">Forename</span> should go."},{"name":"DZENTSA","text":"Without a hostage, they can't pull no dirty tricks. They wouldn't dare try <span class=\"highlight\">Forename</span> again."},{"name":"WIDARGELT","text":"Very well. I entrust this letter to you. Take it to Rustrock. And see it to Theobald's hands."},{"name":"DZENTSA","text":"We'll get them back, and we'll get them good!"},{"name":"OTCHAKHA","text":"Master Widargelt will prevail. With your training, I know he will."},{"name":"THEOBALD","text":"Ah, I remember you─friend to the pathetic monks. You are bold to come here. What do you want?"},{"name":"THEOBALD","text":"...A letter of challenge? Hmph, a dated practice befitting a dying style, and a lot of effort simply to lose."},{"name":"THEOBALD","text":"I accept. Indeed, I anticipated that I would have to deal the stubborn fool another beating."},{"name":"THEOBALD","text":"I will be at Schism. And you may tell Widargelt─nay, my dear cousin Theodred─that he would do well to bring a coffin."},{"name":"WIDARGELT","text":"The things you have taught us. I will bring them to bear in the duel."},{"name":"WIDARGELT","text":"The letter is delivered? My thanks, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>."},{"name":"WIDARGELT","text":"I have invited the people of Ala Gannha. They, too, shall bear witness."},{"name":"WIDARGELT","text":"The fight is to be single combat. But my opponent scruples at naught. Well do we know this. And so we must be prepared for anything."},{"name":"WIDARGELT","text":"But whatever should happen, I am confident we will prevail. For as I trained, I awakened to a new power. The power to protect."},{"name":"THEOBALD","text":"Really? A crowd? Well, if you're determined to make a spectacle of your demise, who am I to stop you? Let all present witness the death of the Fist of Rhalgr."},{"name":"THEOBALD","text":"Hear me, people of Ala Mhigo! A feeble faith such as this charlatan peddles will avail you naught! Only a strong and absolute ruler can save you! Only <span class=\"emphasis\">I</span> can save you!"},{"name":"WIDARGELT","text":"Those words may as well come from the Empire! The people need not another tyrant! Nay, what they need is hope!"},{"name":"WIDARGELT","text":"And hope they may yet have. Hope everlasting in their hearts. That none can take away."},{"name":"WIDARGELT","text":"So I beg you, brother. Give up your aspirations for the throne. Join me in reviving the Fist of Rhalgr. As is your right."},{"name":"WIDARGELT","text":"The time for deception is past. But one man I know wields the lance as you do. So take off this mask that you wear. The mask of a dead prince. And show me your face, Adri. My brother."},{"name":"THEOBALD","text":"Hahaha..."},{"name":"THEOBALD","text":"Adri... Long has it been since last I heard that name. I had always thought you dim-witted, but it seems your memory still serves you well, at least."},{"name":"WIDARGELT","text":"Why do you so desire our destruction? So much so that you fool even yourself?"},{"name":"THEOBALD","text":"Like you, I was an orphan. The temple was the only home I knew."},{"name":"THEOBALD","text":"But that home was taken from me, laid to waste at Theodoric's command. The monks, hailed as the realm's greatest warriors, could not withstand the mad king's might."},{"name":"THEOBALD","text":"It was then that I knew─knew that blood counts for more than all else!"},{"name":"THEOBALD","text":"All the training we undergo to hone flesh and mind... None of it is worth a spit in the face of absolute power! And those who are born without it─those like me─will ever be made to suffer!"},{"name":"THEOBALD","text":"But you─you had it all from the beginning. Born into the royal family, with the blood of kings coursing through your veins. You had the power to lead and to rule. But still you turned your back on our nation's liberation. And for what? For the sake of a Fist that couldn't protect itself!"},{"name":"THEOBALD","text":"I was nobody. Just one of the Griffin's lowly doubles. But if you will not rise up for our nation, then <span class=\"emphasis\">I</span> will! And you have no right to stop me─you, who have forfeited your own birthright!"},{"name":"WIDARGELT","text":"Hear me, brother! Our blood defines not who we are. The path we walk is ours to choose. And I have chosen not to destroy. But to protect."},{"name":"THEOBALD","text":"Hollow words from someone born to power! You will never understand what it means to be weak! <span class=\"emphasis\">Never</span>!"},{"name":"WIDARGELT","text":"I am Widargelt! A brother of the Fist of Rhalgr! That is who I am! No more, no less!"},{"name":"WIDARGELT","text":"I live to revive the Fist of Rhalgr! And by my fist, I will prove it to you!"},{"name":"HAMON","text":"Well, now. The professor said there'd be a spectacle, but I certainly won't say no to some action. I've been itching for it since our match was canceled."},{"name":"WIDARGELT","text":"Enough, Adri! Our goals are the same! Our methods but differ! Together, we can achieve much! We can restore our order!"},{"name":"THEOBALD","text":"Adri is dead! I am Theobald, Theodoric's true heir and rightful king of Ala Mhigo! And by your death I shall claim my throne!"},{"name":"WIDARGELT","text":"To resort to the tools of our oppression... He will stop at naught for power. It is a twisted existence. And we must straighten him out."},{"name":"WIDARGELT","text":"Come, my friends! We fight for hope!"},{"name":"QIB","text":"Cease this madness, Adri!"},{"name":"QIB","text":"Never! I have come this far─I will not stop now!"},{"name":"QIB","text":"I will see to Adri! Focus on the others!"},{"name":"QIB","text":"Come to me when you are hurt! I will heal you!"},{"name":"QIB","text":"Hahahaha! None can stand in my way!"},{"name":"QIB","text":"More of them! Have care, my friends!"},{"name":"QIB","text":"Chuchuto, Rurukuta! We're cleaning up the rank and file!"},{"name":"QIB","text":"Stay sharp, Rurukuta!"},{"name":"QIB","text":"Hmph, just more fodder for my fists."},{"name":"QIB","text":"You've been a thorn, adventurer. But I've just the thing to deal with you!"},{"name":"QIB","text":"Beware, <span class=\"highlight\">Forename</span>! It senses movement!"},{"name":"QIB","text":"More reinforcements!?"},{"name":"QIB","text":"Whatever it takes, by any means...I will be king!"},{"name":"QIB","text":"A king bereft of honor! No Ala Mhigan will accept you!"},{"name":"QIB","text":"Leave that hunk o' junk to me─<span class=\"emphasis\">Hamooon HOLYFIIIST</span>!"},{"name":"QIB","text":"It's just you now, Adri!"},{"name":"QIB","text":"So much for the dreaded Corpse Brigade. In the end, they're just relics of a bygone age."},{"name":"QIB","text":"But not I! I will not fall to the likes of you!"},{"name":"QIB","text":"Enough, brother! It's over!"},{"name":"QIB","text":"Silence! I'll not surrender to a craven who has forsaken his homeland!"},{"name":"QIB","text":"He leaves us no choice! Take down the infernal machine!"},{"name":"QIB","text":"Damn you! If I must fall, I'm taking you to the seventh hell with me!"},{"name":"QIB","text":"So much...unfinished..."},{"name":"QIB","text":"I can't lose everything... Not again..."},{"name":"QIB","text":"Ack... You can't beat old age..."},{"name":"QIB","text":"I'm sorry...Master..."},{"name":"QIB","text":"Ugh... I was careless..."},{"name":"QIB","text":"Godsdammit..."},{"name":"QIB","text":"It's in...your hands..."},{"name":"DZENTSA","text":"Master Widargelt's gonna win. I know it."},{"name":"OTCHAKHA","text":"So it begins..."},{"name":"WIDARGELT","text":"Adri. When next we fight, let it be as brothers. Let it be face–to–face."},{"name":"WIDARGELT","text":"I am weak. Too weak to bear the Fist of Rhalgr alone. Yet come what may, I will not give up. Each time I fall, I will pick myself up."},{"name":"WIDARGELT","text":"From my heart, I ask you this. Will you not join me? Help me to build a new Fist. One that knows not highborn or low. That discerns not shadow or light. A Fist of Rhalgr where all may belong."},{"name":"ERIK","text":"Your fiery zeal kindles hope within people's hearts, and doubt not but that many will come to you seeking strength─the strength to protect that which they hold dear, and by their own hands."},{"name":"ERIK","text":"Now then, let us return to Ala Gannha. There is still much to do, not the least of all thanking our pugilist friends for their most timely arrival."},{"name":"HAMON","text":"'Twas a fine speech, spoken from the heart. Lacked polish, to be sure, but that'll come with age and experience."},{"name":"RURUKUTA","text":"And as good a drubbing as we gave them, the Corpse Brigade will be laying low for a while."},{"name":"HAMON","text":"As will I, I think. At my age, a moment of fun costs a week of soreness."},{"name":"CHUCHUTO","text":"You must admit, though, every so often it's good to hurl yourself into a real battle!"},{"name":"RURUKUTA","text":"A real battle? I don't know about you, but I scarcely broke a sweat."},{"name":"CHUCHUTO","text":"Oh? Then I suppose I was simply imagining all your huffing and puffing!"},{"name":"HAMON","text":"Ohohoho! Well, sad though it is to part, it's past time we headed home. But I hope to continue this fine exchange with our friend monks...D'zentsa and O'tchakha especially."},{"name":"HAMON","text":"Young and lithe as they are, I believe they harbor much pugilistic potential. And it'd be my pleasure to personally help them explore it, hehehe..."},{"name":"CHUCHUTO","text":"Gods, could you make it any more obvious!?"},{"name":"HAMON","text":"Till next time, take care, <span class=\"highlight\">Forename</span>. And thanks for showing these old bones a good time!"},{"name":"OTCHAKHA","text":"With your help, we have managed to weather another storm. I daresay we've all earned a moment's respite."},{"name":"DZENTSA","text":"You know, I can't help but feel that Master is too nice sometimes. After all that Theobald...er, Adri fellow did to him, he goes and begs the villagers to tend his wounds."},{"name":"OTCHAKHA","text":"So complete is his dedication to reviving the Fist of Rhalgr, he wastes no energy on such things as anger and retribution."},{"name":"DZENTSA","text":"Right. And at any rate, there's nothing standing in our way for now. We're free to get on with our mission."},{"name":"OTCHAKHA","text":"That we are. And what we've begun in Ala Gannha, we shall continue in all corners of Gyr Abania, never resting until the Fist of Rhalgr thrives throughout the realm once more."},{"name":"DZENTSA","text":"I'd say Master has his work cut out for him. He's gonna need all the support we can muster."},{"name":"OTCHAKHA","text":"So let us ever strive to grow stronger, the better to provide that support. After all, it wouldn't do to always rely on <span class=\"highlight\">Forename</span>."},{"name":"DZENTSA","text":"Damn right! So what're we waiting for? Let's go and train!"},{"name":"OTCHAKHA","text":"Wh-What? But we've only just─ Er, pray excuse us, <span class=\"highlight\">Forename</span>...and thank you! From the bottom of our hearts, for everything!"},{"name":"ERIK","text":"Witnessing your furious struggle, I could not help but wish that I, too, could contribute with my fists. My son, I suspect, felt the same way when he chose to join the Resistance."},{"name":"ERIK","text":"But as he walked his own path, so too must I. As a man of science, it is my duty to pursue truth immutable, that the knowledge may one day benefit future generations."},{"name":"ERIK","text":"I did my small part for Widargelt's cause. But know that it was mostly you, my friend, who helped him to forge ahead in the face of adversity─who picked him up when fate cast him down."},{"name":"ERIK","text":"And for that I am grateful. You possess a noble heart, and it more than makes up for your lackluster mind."},{"name":"ERIK","text":"With that, I shall head back to Ul'dah. As fine a distraction as it has been to watch youngbloods come into their own, my research will not advance itself."},{"name":"ERIK","text":"As ever, should you wish to partake of my knowledge, do not hesitate to come to me."},{"name":"DZENTSA","text":"We couldn't have done it without you, <span class=\"highlight\">Forename</span>."},{"name":"CHUCHUTO","text":"The way your fellow monks fought, it looked not so far departed from our own style. Unless I'm mistaken, you've taught them a trick or three!"},{"name":"RURUKUTA","text":"By any objective measure, Master Hamon is strong now, and I can only imagine how strong he used to be. I must work hard if I'm to be worthy of the Holyfist legacy."},{"name":"WIDARGELT","text":"The others wish to speak with you. When they are done, I would speak with you also."},{"name":"WIDARGELT","text":"The recent trials have taught me much. About myself. About the extent of my debts."},{"name":"WIDARGELT","text":"Through adversity, none of you abandoned me. I nearly abandoned my dream. But never again. I owe it to those who stood by me."},{"name":"WIDARGELT","text":"To many I am indebted. And to you most of all. You are my master in all but name. Ever leading by example. Teaching me strength and grace."},{"name":"WIDARGELT","text":"I pray that you will help many others. As you have helped me."},{"name":"WIDARGELT","text":"I shall resume my mission. With my disciples at my side. Together, we will spread the Fist across the land."},{"name":"WIDARGELT","text":"The journey will be long. But come what may, I will see it through. For I am not alone."},{"name":"WIDARGELT","text":"Fare you well, my <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Till next we meet."},{"name":"SYSTEM","text":"This concludes the monk quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “Courage Born of Fear.”"},{"name":"SYSTEM","text":"Once you have done so, the next monk quest will be available from Erik."}],"reward":{"gil":2600,"action":7396,"items":[{"id":20276}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":21}],"quests":[67965]},"next":[68747]},"partials":[{"type":"npc","id":"1022390","obj":{"i":1022390,"n":"Widargelt","l":2407,"q":4}},{"type":"npc","id":"1022391","obj":{"i":1022391,"n":"D'zentsa","l":2407,"q":4}},{"type":"npc","id":"1022392","obj":{"i":1022392,"n":"O'tchakha","l":2407,"q":4}},{"type":"npc","id":"1022532","obj":{"i":1022532,"n":"Theobald","l":2407,"q":1}},{"type":"npc","id":"1022533","obj":{"i":1022533,"n":"D'zentsa","l":2406,"q":1}},{"type":"npc","id":"1022534","obj":{"i":1022534,"n":"O'tchakha","l":2406,"q":1}},{"type":"npc","id":"1022538","obj":{"i":1022538,"n":"Erik","l":2407,"q":1}},{"type":"npc","id":"1022539","obj":{"i":1022539,"n":"Hamon","l":2407,"q":1}},{"type":"npc","id":"1022540","obj":{"i":1022540,"n":"Chuchuto","l":2407,"q":1}},{"type":"npc","id":"1022541","obj":{"i":1022541,"n":"Rurukuta","l":2407,"q":1}},{"type":"npc","id":"1022548","obj":{"i":1022548,"n":"Widargelt","l":2406,"q":1}},{"type":"action","id":"7396","obj":{"i":7396,"n":"Brotherhood","c":2542,"j":20,"t":4,"l":70}},{"type":"item","id":"20276","obj":{"i":20276,"n":"Pacifist's Attire Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"67965","obj":{"i":67965,"n":"Choices and Paths","g":148,"l":"The Peaks","s":680,"f":1}},{"type":"quest","id":"68747","obj":{"i":68747,"n":"A Monk's Legacy","g":148,"l":"Ul'dah","s":800}}]}