{"quest":{"name":"When East Meets West","location":"Ul'dah","id":67967,"patch":4.0,"sort":601,"icon":100690,"unlocksFunction":1,"eventIcon":71341,"issuer":1003818,"target":1003818,"involved":[1019805,1019806,1019807,1019808,1019809,1019810],"genre":141,"journal":["Redolent Rose has a choice task for his prized protégé.","Redolent Rose can scarcely contain his excitement at your arrival. As the guildmaster tells it, he has an appointment to meet a most promising new trading partner from the Far East, and he is confident that the presence of his most talented protégé─namely, you─would help the negotiations proceed even more smoothly. Seek out the young master of Daitenya in the markets of the Ruby Road Exchange, and do try to make a good first impression.","The young master introduces himself as Keimei of Kugane, a port city of the land of Hingashi. He explains that he has traveled to this realm with his female companion in hopes of finding Eorzean fashions that he could introduce to his homeland. When the young man expresses concerns that the garb of the Ul'dahn dancing girls may not quite suit Far Eastern sensibilities, Redolent Rose suggests that he pay a visit to the palace ball, where he might find the attire of the visiting Ishgardian delegation more to his liking. The youth expresses his enthusiasm, and at the guildmaster's request, you agree to accompany your two guests to the Royal Promenade.","Keimei and his female companion find themselves besmitten by Ishgardian attire, in particular the bustle worn by the Lady Laniaitte. It would seem that the young master is now fully convinced that Eorzean fashions would find a receptive audience in his homeland. His companion has also heard that you are an accomplished weaver yourself, and coyly expresses her interest in one day wearing one of your creations. You set off for the Weavers' Guild, where your new friends are doubtless hammering out the final details with Redolent Rose.","Much as you expected, the negotiations have been completed without a hitch, and Redolent Rose triumphantly declares this day the start of a new era for his guild. Your new associates take their leave, expressing their eagerness to see the wonderful garments you will produce for them, and extending a cordial invitation to visit them in Kugane one day. Shirk not your training, that you might be able to share the wonders of Eorzean fashion with your friends from across the Ruby Sea.<br><br>※The next weaver quest will be available from Redolent Rose upon reaching level 63."],"objectives":["Speak with the Daitenya master at the Ruby Road Exchange.","Speak with Keimei at the Royal Promenade.","Report to Redolent Rose."],"dialogue":[{"name":"REDOLENTROSE","text":"<span class=\"highlight\">Forename</span>! Just the person I was hoping to see. I trust you've been keeping your needlework as sharp as ever?"},{"name":"REDOLENTROSE","text":"...But of course you have─you didn't become my foremost protégé by slacking in your studies, now did you? Anyhow, I was just on my way to meet a most promising prospective business partner, and I believe he'd be most interested in making your acquaintance."},{"name":"REDOLENTROSE","text":"The man in question is the young master of Daitenya, a purveyor of traditional fabrics and garments in Kugane, far to the east. Having recently taken over the family business from his father, he is traveling the world to seek out new fashions and trends that he might introduce to his homeland. An admirable goal, would you not agree?"},{"name":"REDOLENTROSE","text":"I get to present the guild to our client in the best possible light, he gets to meet one of our finest, and <span class=\"emphasis\">you</span> get a rare firsthand look at Far Eastern needlecraft─I daresay there's something in it for everyone. So, what say you?"},{"name":"REDOLENTROSE","text":"That's why I like you, <span class=\"highlight\">Forename</span>! Why don't you go on ahead and give our man a warm welcome to Ul'dah? As he expressed an interest in seeing our markets, I proposed that we meet at the Ruby Road Exchange."},{"name":"REDOLENTROSE","text":"You will doubtless recognize him by his traditional Eastern garb. Go along, and I shall be with you as soon as I've tied up a few loose ends around the guild."},{"name":"REDOLENTROSE","text":"You're still here, <span class=\"highlight\">Forename</span>? You <span class=\"emphasis\">were</span> heading for the Ruby Road Exchange to welcome our friend from the Far East, yes? We mustn't keep a potential new partner waiting, after all."},{"name":"KOTOCHO","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>. I have accompanied the young master to these distant shores, that I might look upon its wonders with my own eyes. Pray treat me with kindness."},{"name":"KEIMEI","text":"(-Keimei-)Yes, I am Keimei of Daitenya, purveyor of the finest kimono in Kugane. Do I have the honor of speaking to Redolent Rose of the Weavers' Guild?"},{"name":"REDOLENTROSE","text":"Good eye, <span class=\"highlight\">Forename</span>! I see you had no trouble finding our esteemed guests."},{"name":"REDOLENTROSE","text":"Welcome to Ul'dah, Master Keimei. <span class=\"emphasis\">I</span> am Redolent Rose, and the honor is all mine. This is <span class=\"highlight\">Forename Surname</span>, one of the most talented young weavers I've personally had the pleasure of training."},{"name":"REDOLENTROSE","text":"I trust you've had the chance to take in the sights a bit. Should you have any questions regarding Ul'dahn fashion or custom─any at all─<span class=\"highlight\">Forename</span> here would be all too happy to answer them. Isn't that so, <span class=\"highlight\">Forename</span>?"},{"name":"KEIMEI","text":"(-Keimei-)A most generous offer, Master Rose. I must confess that─though my companion and I arrived but a short time ago─we have seen colors and patterns so many and wondrous that we are still feeling a measure overwhelmed by it all. One thing, however, is certain─this land does not lack for, ah, visual stimulation."},{"name":"KOTOCHO","text":"It is as the young master says. I was particularly taken with the dress of the dancing girls, and the manner in which it served to bring out the feminine grace of their movements."},{"name":"KEIMEI","text":"(-Keimei-)...Ahem! I must agree, though they did seem to expose the skin more than we are accustomed to seeing. No doubt this is in large part due to the warmer climes."},{"name":"KEIMEI","text":"(-Keimei-)In my homeland of Hingashi, we have a saying: “A clouded moon, blossoms in the rain.” To put it in your tongue, one might say “Beauty obscured is all the more beautiful.” In dress, as well, modesty is the highest of virtues. I fear the garments we have seen may be a bit too...bold...for my countrymen."},{"name":"REDOLENTROSE","text":"I see... Yes, when introducing new fashions to a new land, one would be remiss not to consider matters of culture and climate alike. To that end, mayhap the more conservative garb of Ishgard might be a more suitable starting point?"},{"name":"KEIMEI","text":"(-Keimei-)...Ishgard. Though I have never traveled there myself, the tales I have heard say that snow and ice cover the lands in all seasons. I can only imagine that the silks of such a nation would not overexpose the flesh. Without seeing them with my own eyes, of course, this is little but speculation..."},{"name":"REDOLENTROSE","text":"Funny you should say that, my friend! There's a ball to be held at the palace not bells from now, and a delegation from the Holy See is scheduled to attend. What better opportunity to see the finest fashions our neighbors to the north have to offer?"},{"name":"KEIMEI","text":"(-Keimei-)A chance to witness Ishgardian attire firsthand right here in Ul'dah? This is most fortunate timing, indeed! If it would not be too much of a burden, my companion and I would like nothing more than to take you up on your most kind offer."},{"name":"REDOLENTROSE","text":"Say no more! It would be <span class=\"highlight\">Forename</span>'s pleasure! <span class=\"alternative-container\"><span class=\"alternative\">She'd</span><span class=\"alternative\">He'd</span></span> also be happy to share with you <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> wealth of knowledge on Ishgardian aesthetics. Wouldn't you, <span class=\"highlight\">Forename</span>?"},{"name":"REDOLENTROSE","text":"I told you <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was the best we had! If you're looking to get the best view of the procession, the Royal Promenade should be just the spot. And I suggest you hurry along─there'll be no shortage of would-be spectators, I imagine."},{"name":"KEIMEI","text":"(-Keimei-)Thank you both for your kindness. <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, my companion and I will await you at this Royal Promenade."},{"name":"REDOLENTROSE","text":"Did you hear that, <span class=\"highlight\">Forename</span>? In case the gravity of the moment has been lost on you, we stand on the verge of a potentially historic moment in the guild history!"},{"name":"REDOLENTROSE","text":"Should Master Keimei take a liking to us, Ul'dahn fabrics will find a new audience across the Ruby Sea, and in turn, we will be able to bring the exotic fashions of the East to the sultanate─no, to all of Eorzea!"},{"name":"REDOLENTROSE","text":"I've not felt this inspired since─why, I can't even remember when! I must return to the guild and put the designs in my head to parchment at once. Now, hurry to our client's side, <span class=\"highlight\">Forename</span>. I'm counting on you!"},{"name":"KOTOCHO","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, was it? Thank you for joining us. It would seem the Ishgardians have yet to make their appearance. I am most eager to see what fineries they favor."},{"name":"REDOLENTROSE","text":"Whatever are you doing here? Lest you forget, our friends from Daitenya are waiting at the Royal Promenade. Now hurry! I'm counting on you to see that these negotiations don't unravel!"},{"name":"KEIMEI","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. You have come at the perfect time. Are those two gentlemen not part of the Ishgardian delegation?"},{"name":"EMMANELLAIN","text":"I say, how can anyone abide this infernal heat!? If they'd had the courtesy to inform me in advance, I would have worn something that breathes a bit more. Why, I've half a mind to go change into something more comfortable..."},{"name":"HONOROIT","text":"My lord, if I may be so bold as to remind you, it is for the very purpose of displaying this attire that House Haillenarte deigned to participate in these festivities. Lord Artoirel would not approve if you were to─"},{"name":"EMMANELLAIN","text":"Yes, yes. I am not daft, Honoroit. Go against Brother's wishes? The Fury forbid! Now, whatever is keeping my lady? After all, it is for <span class=\"emphasis\">her</span> and her alone that I humored Brother's request."},{"name":"LANIAITTE","text":"...Do not say a word."},{"name":"EMMANELLAIN","text":"My lady! As ever, I find myself without the words to properly convey the elegance before mine eyes! Truly, you are a rose among the weeds, your beauty blossoming even in this godsforsaken desert!"},{"name":"EMMANELLAIN","text":"...Ahem, but I forget my manners. Might I, Emmanellain de Fortemps, have the honor of escorting you to the ballroom?"},{"name":"LANIAITTE","text":"Hmph. If only you could show such poise on the battlefield..."},{"name":"EMMANELLAIN","text":"Hm? Did you say something, my lady? You seem pensive somehow. Mayhap you are feeling less than confident about your dancing abilities? Worry not! I shall take the lead, and you need but follow!"},{"name":"HONOROIT","text":"Do take heart, Lady Laniaitte. I can say with some confidence that dance is mayhap the one discipline in which Lord Emmanellain's actual ability measures up to his words."},{"name":"LANIAITTE","text":"And this is supposed to comfort me!? At least on the battlefield I could hold my own against this─ Bah, the ignominy of it all!"},{"name":"KEIMEI","text":"So those are the sort of garments favored in Ishgard. Indeed, they exude a reserved, tasteful elegance. This is doubtless a reflection of the long history and traditions of this nation─both similar and different from our own."},{"name":"KEIMEI","text":"Clad in such robes, any man or woman would surely look as if they were born into nobility."},{"name":"KOTOCHO","text":"(-Daitenya Companion-)The garment worn by the red-haired girl was most exquisite indeed. Pray tell, whatever might it be called?"},{"name":"KOTOCHO","text":"(-Daitenya Companion-)A “bustle,” you say? The word is unfamiliar to me... Still, I could scarce take my eyes off it. What I would not give for one of my very own!"},{"name":"KEIMEI","text":"Oho! Then I suppose we must move forward with the proposed arrangement. Let us return to the guild at once and settle the details with Master Rose."},{"name":"KEIMEI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Your guidance and company both have been most appreciated. I trust we will be seeing more of each other in the days to come. Till then."},{"name":"KOTOCHO","text":"(-Daitenya Companion-)The young master tells me that you are a hero who has traveled this realm far and wide. This is true, yes? I can only imagine the gorgeous robes and gowns your eyes have seen."},{"name":"KOTOCHO","text":"(-Daitenya Companion-)The young master also tells me that you are a talented weaver in your own right, who has fashioned no end of wonders. Would that one day I might clad this humble body in one of your creations... But I forget myself. Till we meet again, friend."},{"name":"KEIMEI","text":"I have already spoken with Master Rose. Thanks to your most generous guidance at the Promenade, I am pleased to say the negotiations went most smoothly."},{"name":"KOTOCHO","text":"It was an honor making your acquaintance. The young master and I await the day we might repay the favor in Kugane."},{"name":"REDOLENTROSE","text":"I knew I could count on you, <span class=\"highlight\">Forename</span>! Allow me to announce the momentous news─our guild has entered into an exclusive trade partnership with Daitenya of Kugane!"},{"name":"KEIMEI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Thanks in no small part to your most generous guidance at the Promenade, I am pleased to say the negotiations went most smoothly."},{"name":"REDOLENTROSE","text":"Our esteemed guest and his companion were both most taken with your aesthetic sensitivities. Is that not so, Master Keimei?"},{"name":"KEIMEI","text":"It is indeed. Master Rose spoke quite passionately about the many wonders you have wrought for your clients. I can scarcely wait to entrust you with a commission of my own."},{"name":"KOTOCHO","text":"Though the journey is a long one, it would be our honor to welcome you to Kugane one day. Would it not, young master?"},{"name":"KEIMEI","text":"It most certainly would be. And with that, we had best be on our way home. Master Rose, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─we look forward to a long and fruitful partnership."},{"name":"REDOLENTROSE","text":"Well done, <span class=\"highlight\">Forename</span>! Yes, I do believe this marks the start of a new era for our guild. Mind you, this means we—and by <span class=\"emphasis\">we</span>, I primarily mean <span class=\"emphasis\">you</span>—must work harder than ever. Your wares will be the face of our guild in a whole new land, after all, and we simply must make a good impression!"},{"name":"SYSTEM","text":"The next weaver quest will be available from Redolent Rose upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":680,"items":[{"num":250,"id":12},{"num":3,"id":12667}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":14}],"questsType":"all","quests":[67542,67895]},"next":[67968]},"partials":[{"type":"npc","id":"1003818","obj":{"i":1003818,"n":"Redolent Rose","l":41,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1019805","obj":{"i":1019805,"n":"Daitenya Master","l":40,"q":1}},{"type":"npc","id":"1019806","obj":{"i":1019806,"n":"Daitenya Companion","l":40,"q":1}},{"type":"npc","id":"1019807","obj":{"i":1019807,"n":"Keimei","l":41,"q":1}},{"type":"npc","id":"1019808","obj":{"i":1019808,"n":"Daitenya Companion","l":41,"q":1}},{"type":"npc","id":"1019809","obj":{"i":1019809,"n":"Keimei","l":41,"q":1}},{"type":"npc","id":"1019810","obj":{"i":1019810,"n":"Daitenya Companion","l":41,"q":1}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"67542","obj":{"i":67542,"n":"Never Leave without a Good-bye","g":141,"l":"Ishgard","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"67968","obj":{"i":67968,"n":"The Butterfly Effect","g":141,"l":"Ul'dah","s":630,"f":1}}]}