{"quest":{"name":"Cross-fist Training","location":"The Peaks","id":67964,"patch":4.0,"sort":650,"icon":100672,"unlocksFunction":1,"eventIcon":71341,"issuer":1022390,"target":1023728,"involved":[1003817,1003827,1022391,1022392,1022404,1022405,1022411,1022412],"genre":148,"journal":["Widargelt has a plan for expansion.","While Widargelt is pleased with his growing membership of students, there are villagers still who doubt the authenticity of his style. In order to win them over, he plans to host a cross-discipline match pitting monks against pugilists. As a well-known face among the Pugilists' Guild, you have been tasked with delivering the invitation. Make your way to Ul'dah and broach the subject with Hamon.","You arrive at the Pugilists' Guild to find not only Hamon and Chuchuto, but Rurukuta as well, temporarily returned from his wanderings. All are responsive to the idea of a cross-discipline match, and the guildmaster formally accepts. Make your way back to Ala Gannha and inform Widargelt of the pugilists' coming.","Widargelt is ecstatic to learn that Hamon has accepted the invitation, and he sets about preparing for the match. He bids you meet him directly in the Fringes at Schism, the chosen venue.","No sooner do you arrive at Schism than cries ring out from the river─D'zentsa and O'tchakha are in danger. Hasten after Widargelt to their aid.","You find Widargelt on his knees, handily bested by a band of men led by the mysterious Theobald, who claims to be the Griffin and the rightful King of Ala Mhigo both. He issues a stern warning against reviving the Fist of Rhalgr, and goes on to reveal that Widargelt is in fact his cousin, Theodred, who was raised at the Temple of the Fist in order to spare him the King of Ruin's wrath. Theobald then leaves, but not before declaring his intent to rule Ala Mhigo with an iron fist. With the immediate danger passed, you may turn your attention to your comrades.","In light of recent events, Widargelt has no choice but to call off the match, and he apologetically sends Hamon and his crew back to Ul'dah. While Widargelt checks on his pupils, take word of these troubling developments to Erik, now returned to Ala Gannha from his fieldwork.","Erik is unable to hide his shock at your report. The veracity of Theobald's words aside, the professor posits that his minions are members of the Corpse Brigade─elite soldiers trained in counter-monk combat, who once served Theodoric as his personal guard. Erik promises to investigate the many claims made, and bids you look in on Widargelt.","You find Widargelt deeply discouraged, not only by the sound drubbing he received but also the shocking revelation of his origin. For now, give your brother monk the time and space he requires.<br><br>※The next monk quest will be available from Widargelt upon reaching level 68."],"objectives":["Speak with Hamon at the Pugilists' Guild.","Report to Widargelt in Ala Gannha.","Speak with Widargelt at Schism.","Follow Widargelt.","Speak with Widargelt.","Speak with Erik in Ala Gannha.","Speak with Widargelt."],"dialogue":[{"name":"WIDARGELT","text":"You look well, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. Stronger than when last we spoke."},{"name":"WIDARGELT","text":"Our membership, too, grows stronger. Word spread after the speech. Others have come to learn. But it is too soon to be satisfied."},{"name":"WIDARGELT","text":"I would welcome more to the faith. But there are villagers still who doubt us. Our authenticity and our purpose."},{"name":"WIDARGELT","text":"To convince them, I would demonstrate our techniques. In real combat, by way of a cross-discipline match."},{"name":"WIDARGELT","text":"For our opponents, I have the pugilists of Ul'dah in mind. Assuming they are willing."},{"name":"WIDARGELT","text":"You are well known in the Pugilists' Guild. If you ask, they will surely listen."},{"name":"WIDARGELT","text":"Will you speak with them on our behalf?"},{"name":"WIDARGELT","text":"You have my thanks. Go well, <span class=\"highlight\">Forename</span>. And my regards to Master Hamon."},{"name":"DZENTSA","text":"A thousand push-ups and a thousand squats─that's reasonable to begin with, right?"},{"name":"OTCHAKHA","text":"I hope Zentsa does not scare our new pupils away with her unreasonable expectations..."},{"name":"HAMON","text":"Oho! If it isn't a familiar face, and one I'm rather fond of!"},{"name":"HAMON","text":"Chuchuto, Rurukuta! We have an esteemed guest!"},{"name":"CHUCHUTO","text":"<span class=\"highlight\">Forename</span>! Gods, how long has it been?"},{"name":"RURUKUTA","text":"Well, well, it seems I picked a good time to take a break from my wanderings. It's good to see you again."},{"name":"HAMON","text":"That it is! Now then, what brings you here, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>?"},{"name":"CHUCHUTO","text":"A cross-discipline match? Why, that sounds exciting! Don't you agree, Master?"},{"name":"HAMON","text":"&lt;mumble&gt; Gyr Abania so far... As well be the other side of the world... &lt;grumble&gt; Mostly sinewy Highlanders... And male ones at that..."},{"name":"CHUCHUTO","text":"Oh, that's rich coming from a sinewy Highlander, and a wrinkled old one at that!"},{"name":"RURUKUTA","text":"I, for one, would welcome the challenge. I was growing weary of pummeling Chuchuto senseless."},{"name":"CHUCHUTO","text":"Says the one on a losing streak!"},{"name":"HAMON","text":"But of course we'll go. After all you've done for us, it's the least we could do."},{"name":"HAMON","text":"The sooner the better, I take it, and there's no time like the present. We'll head out at once."},{"name":"HAMON","text":"Hurry up and pack your things. We're going to Gyr Abania!"},{"name":"HAMON","text":"You go on ahead, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, and let young Widargelt know to expect us. It's on like an Ala Mhigan monk!"},{"name":"WIDARGELT","text":"I look forward to Master Hamon's response."},{"name":"WIDARGELT","text":"The pugilists are on their way? Rhalgr be praised!"},{"name":"WIDARGELT","text":"There is much to do. I will make the match known to the villagers. D'zentsa, O'tchakha, be on hand to receive our guests."},{"name":"WIDARGELT","text":"And you, <span class=\"highlight\">Forename</span>. Schism. That is to be the venue. Pray take yourself there and prepare."},{"name":"HAMON","text":"I've been keeping at my training, regained much of my former strength. Still a long way off from my Holyfist days, to be sure, but no matter─I've got years ahead of me! Ohohoho!"},{"name":"CHUCHUTO","text":"Rurukuta acts all nonchalant, but he's the keenest of us all. Hmph, some things never change!"},{"name":"WIDARGELT","text":"You are here. Good. The people of Ala Gannha expect a quality match. Let us not disappoint them."},{"name":"WIDARGELT","text":"Soon, the girls will arrive with the pugilists. I also told the professor. But he will not attend. Science before savagery, he says."},{"name":"OTCHAKHA","text":"(-O'tchakha-)Aaaaaah!"},{"name":"DZENTSA","text":"(-D'zentsa-)Seven hells! What are you─ Urrrgh!"},{"name":"WIDARGELT","text":"D'zentsa, O'tchakha! They are in trouble!"},{"name":"WIDARGELT","text":"The voices came from the river! With me, <span class=\"highlight\">Forename</span>!"},{"name":"WIDARGELT","text":"&lt;pant&gt; My techniques... They have no effect..."},{"name":"THEOBALD","text":"(-Masked Man-)Hahaha..."},{"name":"THEOBALD","text":"(-Masked Man-)Well, well... We thought we knew every ilm of your style. But you, adventurer─you are not like the others."},{"name":"WIDARGELT","text":"&lt;gasp&gt; You are the Griffin... The wretch who led countless soldiers to their doom. Good men and women with lives ahead of them. &lt;pant&gt; But...you are supposed to be dead."},{"name":"THEOBALD","text":"(-Masked Man-)The wretch who died was but a double, and good riddance, too, for he presumed to have ambitions of his own. <span class=\"emphasis\">I</span> am the true Griffin. And my true name is Theobald, Theodoric's heir and rightful King of Ala Mhigo!"},{"name":"WIDARGELT","text":"Theodoric's heir? King of Ala Mhigo?"},{"name":"THEOBALD","text":"Aye, and in my royal duty, I have come to deliver a warning. Such cults as propagate false beliefs will not be suffered under my reign. Cease any foolish notion of reviving the Fist of Rhalgr. Swear fealty unto me, or you will meet the same end as your treacherous forebears."},{"name":"WIDARGELT","text":"Lies! Theodoric's line is spent! And rightful or no, none would bow before you! The people will not suffer another tyrant!"},{"name":"THEOBALD","text":"You wound me, Widargelt. Or should I say...Theodred, dear cousin."},{"name":"WIDARGELT","text":"What!?"},{"name":"THEOBALD","text":"Hahaha! All this time and you didn't know? Neither who you are, nor what became of your parents? This ignorance cannot be borne. Nay, we must rectify it at once. You see, your father and mother─they conspired to betray the royal house. For their crimes, His Grace, my father, put them to death."},{"name":"THEOBALD","text":"And though your parents were the dimmest of traitors, they had wits enough to know when the game was over. So they sent their precious Theodred, then but a bawling babe, to be raised in safety at the Temple of the Fist. Though my father tended to that squalid little place soon enough."},{"name":"WIDARGELT","text":"Y-You dare mock my parents <span class=\"emphasis\">and</span> my home!? Who you claim to be, I care not! I will make you pay!"},{"name":"THEOBALD","text":"Have you learned nothing? Your techniques are useless against us. If your defeat suffices not to convince you, look to the proof of your beloved temple's destruction."},{"name":"THEOBALD","text":"Listen well. Ala Mhigo needs a strong ruler─an <span class=\"emphasis\">absolute</span> ruler─to smite her enemies and restore her to glory. That ruler is me. Your feeble Fist has no place in her future."},{"name":"WIDARGELT","text":"It is not a good time for the match. With apologies to Master Hamon, I must call it off."},{"name":"WIDARGELT","text":"D'zentsa, O'tchakha. Pray return to Ala Gannha and rest."},{"name":"WIDARGELT","text":"I shall remain behind to receive our guests. Wait with me, <span class=\"highlight\">Forename</span>."},{"name":"HAMON","text":"Whew! Sorry for the delay, my friends. Having been here once before, I thought I had a handle on the route, but 'twas the route that had a handle on me! Hohoho!"},{"name":"HAMON","text":"...Hm? Is something the matter?"},{"name":"WIDARGELT","text":"Aye... Harsh truths have been thrust before me. Calling my very existence into question. As I am, I am no fit opponent for you and yours."},{"name":"WIDARGELT","text":"Forgive me, Master Hamon. Far as you have come, it pains me to say this. But I must call off our match."},{"name":"HAMON","text":"Well, that you don't do so lightly is plain to see. Whatever has happened must be serious indeed."},{"name":"HAMON","text":"For now, my boy, you'd best focus on yourself. There'll be another time to trade blows."},{"name":"HAMON","text":"Come, you two. We're going home."},{"name":"RURUKUTA","text":"Already!? We've barely gotten here, and by the scenic route besides. Let me rest a moment, will you?"},{"name":"CHUCHUTO","text":"Oh, don't be such a milksop! With all your roaming, surely this distance is nothing to you!"},{"name":"HAMON","text":"And Widargelt? To make it clear, we're merely postponing the match. Whatever it is that ails you now, I have faith that you'll bounce back, ready to match me blow for blow."},{"name":"WIDARGELT","text":"Master Hamon is a soul of kindness. I have nothing but gratitude."},{"name":"WIDARGELT","text":"Let us return to Ala Gannha. I must look in on D'zentsa and O'tchakha. Meanwhile, please find Professor Erik. Tell him all that has come to pass."},{"name":"HAMON","text":"Young Widargelt wants to revive the Fist of Rhalgr, isn't that right? A noble mission, but far from simple, as I'm sure you already know. But when the going gets tough, you have to keep believing─in your cause, and in each other. And if ever you need extra pairs of fists, you can call upon us any time."},{"name":"CHUCHUTO","text":"If there's anything we can do, anything at all, you just let us know."},{"name":"ERIK","text":"What!? Let me paraphrase: you are telling me that Widargelt─<span class=\"emphasis\">our</span> Widargelt, the lumbering slab─is in fact Theodred, nephew to Theodoric, the King of Ruin..."},{"name":"ERIK","text":"And that this man who claims to be the Griffin─presumed dead─also claims to be Theobald, Theodoric's rightful heir─also presumed dead. By the gods, not even a drink-addled bard could make this up."},{"name":"ERIK","text":"Outlandish details aside, I have an inkling as to the identity of those who set upon you. They are the selfsame crew that razed the Temple of the Fist: the Corpse Brigade. Trained in counter-monk combat, they served the King of Ruin as his personal guard─though personal agents of destruction would be more accurate. But when their liege fell, they followed in their turn, becoming overqualified bandits."},{"name":"ERIK","text":"Even so, it appears they have not entirely forgotten their training. That would explain why, for all their mastery of the Fist, Widargelt and the girls had no answer to them. That you could hold your own, I believe, is due to your pugilistic background."},{"name":"ERIK","text":"At any rate, now is the time to arm ourselves with knowledge. First of all, I shall look into Theobald's myriad claims. As for you, I suggest that you check on your friend. Knowing the oaf, he will be confused and crestfallen to no end."},{"name":"WIDARGELT","text":"Please find Professor Erik. Tell him all that has come to pass."},{"name":"WIDARGELT","text":"Ah, it is you..."},{"name":"WIDARGELT","text":"I have known defeat. Tasted my fair share. But not like this. I was helpless as a babe."},{"name":"WIDARGELT","text":"“The strength to protect,” I proclaimed. But I could not even protect my own. All my years of training. All useless. What have I to offer the people?"},{"name":"WIDARGELT","text":"And to think...the mad king is my uncle. I am nephew to the man who murdered my parents. Who destroyed our temple. Who brought our nation to ruin.<br>...Forgive me, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. I would be alone."},{"name":"SYSTEM","text":"A training manikin of Ala Mhigan make has been set in the ground."}],"reward":{"gil":3061,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":21}],"quests":[67963]},"next":[67965]},"partials":[{"type":"npc","id":"1022390","obj":{"i":1022390,"n":"Widargelt","l":2407,"q":4}},{"type":"npc","id":"1023728","obj":{"i":1023728,"n":"Widargelt","l":2407,"q":2}},{"type":"npc","id":"1003817","obj":{"i":1003817,"n":"Hamon","l":40,"q":11,"t":"Guildmaster"}},{"type":"npc","id":"1003827","obj":{"i":1003827,"n":"Chuchuto","l":40,"q":5}},{"type":"npc","id":"1022391","obj":{"i":1022391,"n":"D'zentsa","l":2407,"q":4}},{"type":"npc","id":"1022392","obj":{"i":1022392,"n":"O'tchakha","l":2407,"q":4}},{"type":"npc","id":"1022404","obj":{"i":1022404,"n":"Widargelt","l":2406,"q":1}},{"type":"npc","id":"1022405","obj":{"i":1022405,"n":"Widargelt","l":2406,"q":1}},{"type":"npc","id":"1022411","obj":{"i":1022411,"n":"Widargelt","l":2406,"q":1}},{"type":"npc","id":"1022412","obj":{"i":1022412,"n":"Erik","l":2407,"q":1}},{"type":"quest","id":"67963","obj":{"i":67963,"n":"Return of the Monk","g":148,"l":"Mor Dhona","s":630,"f":1}},{"type":"quest","id":"67965","obj":{"i":67965,"n":"Choices and Paths","g":148,"l":"The Peaks","s":680,"f":1}}]}