{"quest":{"name":"Not Quite Dead Yet","location":"Ul'dah","id":67972,"patch":4.0,"sort":601,"icon":100691,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"involved":[1020094,1020095],"genre":142,"journal":["Call upon Severian at the Alchemists' Guild. It would seem his fury is on him.","Severian has charged you with a new task. Speak with the Brass Blade posted in front of Erralig's Burial Chamber in Ul'dah.","You have heard all the Brass Blade has to tell. Enter Erralig's Burial Chamber and speak with him once more.","The Brass Blade asks that you confirm a coffin's cadaverous contents. Inspect the fresh sarcophagus to ascertain the death within.","The fresh sarcophagus contains a queer corpse indeed. Speak to Severian at the Alchemists' Guild about your discovery.","His interest piqued by your report of the strange remains, Severian means to examine them himself. Practice your alchemy skills while you await the results of his investigation.<br><br>※The next alchemist quest will be available from Severian upon reaching level 63."],"objectives":["Speak with the Brass Blade posted in front of Erralig's Burial Chamber.","Speak with the Brass Blade once more.","Inspect the fresh sarcophagus.","Speak with Severian at the Alchemists' Guild."],"dialogue":[{"name":"SEVERIAN","text":"That damnable guildkeeper! How many times must I tell him not to bother me with these trifling affairs? As if I, a veritable titan of the trade, had nothing better to do with my time!"},{"name":"SEVERIAN","text":"Well, look here. If it isn't my very finest assistant in all things alchemical."},{"name":"SEVERIAN","text":"Your timing is as impeccable as ever. It just so happens I've a bothersome little chore what needs— That is, I...I have the most important of tasks that can be entrusted only to you."},{"name":"SEVERIAN","text":"Our guild received a summons to action from Ul'dah's own Brass Blades. They ask that we come to conduct an autopsy beyond the city walls, and claim the subject is a most curious corpse."},{"name":"SEVERIAN","text":"Surely it is no more than the miserable husk of some impoverished pleb, or some glorious gangrenous rot. Even so, our simpleton guildkeeper took on the task, and so now I must investigate. There is a Brass Blade stationed before Erralig's Burial Chamber who knows more. Go to him."},{"name":"SOLDIER02436","text":"Be you the one sent by the Alchemists' Guild?"},{"name":"SOLDIER02436","text":"Listen, then, and that good. The corpse you're to examine lies within Erralig's Burial Chamber. Follow me."},{"name":"SEVERIAN","text":"What is it, then? You'll not find your autopsy subject here, fool. Off to Erralig's Burial Chamber with you!"},{"name":"SOLDIER02436","text":"This here's what we called on the alchemists for. There's a coffin afore you, and a body within it. We need to know for good and all whether it's dead or not."},{"name":"SOLDIER02436","text":"You may think it queer we need help for such a thing. But mark my word─one look in that coffin and you'll think it no more."},{"name":"SYSTEM","text":"A young lady lies in the coffin, void of both breath and pulse. Though she appears dead, you sense she could spring forth at any moment."},{"name":"SOLDIER02436","text":"What say you? She's looks dead, don't she? She's no pulse. Not breathing, neither."},{"name":"SOLDIER02436","text":"But you feel it, don't you? Feels like her eyes might pop right open. Like she might up and walk. And you can see her there dead and cold, but you feel it all the same. Damn strange."},{"name":"SOLDIER02436","text":"And this is strange, too. A proper burial in Ul'dah costs no small amount of coin. Most smallfolk cast their corpses out in the wastes beyond the walls. Fodder for beasts, they be."},{"name":"SOLDIER02436","text":"But this lass weren't thrown out to rot. Would that she had, we'd think her no more than some starved beggar, dead of an empty belly. But there's stranger things yet."},{"name":"SOLDIER02436","text":"She's dressed common enough, but look at the skin. Pale as a peach and just as pretty. Them nails are cut and colored, too. She's no plainfolk. No, she lived a life of some luxury, this one."},{"name":"SOLDIER02436","text":"And look, there─the wound to the head. Makes you think murder, don't it? And then there's the strangest thing of all. If she's been dead long enough to be buried, and it's hot as all hells out here in Thanalan, why hasn't our little lass started to rot?"},{"name":"SOLDIER02436","text":"Hah, looks like you're just as baffled as we are. Do this, then. Go back and talk to that Severian. If he's got any wisdom to give, bring it back to me."},{"name":"SOLDIER02436","text":"Go on, open that fresh sarcophagus. You alchemists live for this stuff, don't you?"},{"name":"SEVERIAN","text":"How did you fare? Was there anything of interest or import in the deed asked of us?"},{"name":"SEVERIAN","text":"Hmmm... No decomposition, and an intangible sense of lingering life... Well, I daresay I assumed a request from the Brass Blades would prove equal parts tiresome and trivial. But I confess, my interest is quite piqued!"},{"name":"SEVERIAN","text":"So be it! I shall go and examine these remains myself. In the interim, you... Well, you may do with yourself whatever you see fit to pass the time. But might I suggest you spend some hours at your alchemical studies? 'Tis a long and winding road to the greatness of Severian."},{"name":"SOLDIER02436","text":"Damn it all. Looks like we got a little problem."},{"name":"SYSTEM","text":"The next alchemist quest will be available from Severian upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":713,"items":[{"num":250,"id":13},{"num":3,"id":12667}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":15}],"questsType":"all","quests":[67605,67895]},"next":[67973]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1020094","obj":{"i":1020094,"n":"Brass Blade","l":40,"q":1}},{"type":"npc","id":"1020095","obj":{"i":1020095,"n":"Brass Blade","l":40,"q":1}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"67605","obj":{"i":67605,"n":"What Death Can Join Together","g":142,"l":"Mor Dhona","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"67973","obj":{"i":67973,"n":"The Forbidden Blade","g":142,"l":"Ul'dah","s":630,"f":1}}]}