{"quest":{"name":"Do Goldsmiths Dream of Gilded Sheep","location":"Ul'dah","id":67974,"patch":4.0,"sort":650,"icon":100691,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1020098,"involved":[1001361,1018433,1020096],"genre":142,"usedItems":[17927,17928],"journal":["Severian of the Alchemists' Guild has news he wishes to share with you.","Severian was able to meet with Mumuepo and obtain information from him about the enchanted blade, Heartstrike. Go and speak with Eadgytha at Erralig's Burial Chamber and discover what you can of the relatives who survive the young lady interred there.","Eadgytha informs you that the deceased in the coffin you wish to examine is survived by none other than the Songstress of Ul'dah, F'lhaminn. Travel to Revenant's Toll in Mor Dhona to speak with her.","F'lhaminn tells you of a coffin that contains the remains of her deceased lover, Niellefresne. Return to Erralig's Burial Chamber to speak with F'lhaminn once more and meet with an old friend of hers.","Together with Greinfarr, an old friend of F'lhaminn's, you are to set out to find the enchanted blade, Heartstrike. First leave Erralig's Burial Chamber and speak with Greinfarr to begin your search.","Greinfarr has advised you to prepare a token of good intentions to coax the truth out of Mumuepo. Return to the Alchemists' Guild and speak with Severian.","Severian tells you that since his prior meeting with Mumuepo, he has been preparing a concoction to loosen the tongue of the thaumaturge. Use the set of juice ingredients you have obtained to synthesize a bottle of high-quality twice-fermented Mun-Tuy juice, and then deliver it to Greinfarr at Erralig's Burial Chamber.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Severian.","You have delivered the bottle of high-quality twice-fermented Mun-Tuy juice to Greinfarr. All that remains is to wait to hear back from him.<br><br>※The next alchemist quest will be available from Greinfarr in front of Erralig's Burial Chamber upon reaching level 68."],"objectives":["Speak with Eadgytha at Erralig's Burial Chamber.","Speak with F'lhaminn at Revenant's Toll.","Speak with F'lhaminn in Ul'dah.","Speak with Greinfarr.","Speak with Severian.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a bottle of twice-fermented Mun-Tuy juice <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the bottle of twice-fermented Mun-Tuy juice <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Greinfarr at Erralig's Burial Chamber</span></span>."],"dialogue":[{"name":"SEVERIAN","text":"Ah, my erudite extern. Welcome, welcome. I have been wanting to tell you, I did indeed meet and speak with Mumuepo. Alas, even for all my charm, I was unable to get the truth out of him with regards to Heartstrike."},{"name":"SEVERIAN","text":"And rightly so. He is a gaoled man─imprisoned for crimes he is known to have committed. Should he confess to any further crimes, his sentence will only be extended. One can hardly fault him for his reticence."},{"name":"SEVERIAN","text":"I hoped at the very least to acquire permission to investigate the coffin in his charge, yet I failed even in that. But we must not give ourselves to despair just yet. There are other ways to exhume the dead beyond the keeper of the burial rights."},{"name":"SEVERIAN","text":"We must turn our efforts to those the deceased has left behind─relatives, a spouse. In their presence, the gravekeeper will have no pretense for preventing us to proceed. No doubt it may sound somewhat unagreeable to you, but I fear there is no other means at our disposal."},{"name":"SEVERIAN","text":"What you must do now is clear─travel to Erralig's Burial Chamber and speak with Eadgytha. Learn what you can from her of whatever family survives our queer corpse."},{"name":"EADGYTHA","text":"You again? I told you once before to leave, and I won't again."},{"name":"EADGYTHA","text":"You come on behalf of the alchemist Severian? And you wish to know of the deceased's relatives?"},{"name":"EADGYTHA","text":"Very well. We've had such requests from him before with regards to preservation of the dead. For such a noble deed, I'll not deny you the information you seek."},{"name":"EADGYTHA","text":"The man at rest in the sarcophagus you speak of is survived by the great Songstress of Ul'dah in days past, F'lhaminn. I am told she can be found in Revenant's Toll."},{"name":"EADGYTHA","text":"If you are able to convince her to come here with you, protocol will permit me to give you leave to examine the dead in her care."},{"name":"SEVERIAN","text":"Our guild often provides the burial chamber with embalming fluids and myriad other solvents at the request of the gravekeeper. If you mention my name to Eadgytha, it may well serve to loosen the old bat's lips."},{"name":"FLHAMINN","text":"Why, hello there, <span class=\"highlight\">Forename</span>. Whatever brings you to these parts?"},{"name":"FLHAMINN","text":"Erralig's Burial Chamber? You wish to know of the body interred there in my charge?"},{"name":"FLHAMINN","text":"And what could you possibly mean to do with such knowledge? The body at rest there is someone very special to me. If this is simply a matter of satisfying your curiosity, I'm afraid I must refuse."},{"name":"FLHAMINN","text":"So, you have discovered a corpse that seems to be yet alive. I do not understand what that has to do with my Ni─with the deceased in my care. Surely you do not think there some connection between the two?"},{"name":"FLHAMINN","text":"Heartstrike, you say? A blade imbued with the power to resurrect the dead? And you suspect a thaumaturge of conducting such experiments? If that were to be true, then..."},{"name":"FLHAMINN","text":"Very well. I will tell you of the one laid to rest in my keep."},{"name":"FLHAMINN","text":"It is my love, my dearest Nielle. He was murdered, just before the coming of the Calamity."},{"name":"FLHAMINN","text":"But there is more. Once dead, it was as if time itself stopped. As if the natural laws were suspended just for him. His body did not, does not, deteriorate. Even now he appears as the day he died."},{"name":"FLHAMINN","text":"The grief of losing my Nielle was more than I could bear. I surrendered myself to the belief that some strange affliction had taken him, but that someday he would waken from it and return to me. Without that to carry me, I myself could not have survived."},{"name":"FLHAMINN","text":"But as I spent my days raising Ascilia, I slowly came to live with the realization that he was dead─and that never would he return to me."},{"name":"FLHAMINN","text":"And now the belief I cling to is that his soul is at peace at Thal's side. Even so, I search tirelessly for some way to make sense of what is happening to my Nielle, but I have found nothing to lead me to an answer."},{"name":"FLHAMINN","text":"You say you have found a young lady whose remains exhibit the same strangeness as my love's. And that this blade, this Heartstrike, may well be responsible for it. That is what you are thinking, is it not?"},{"name":"FLHAMINN","text":"Then I will help you where I can. Let us find this Heartstrike─together."},{"name":"FLHAMINN","text":"But I am reminded now of what transpired the last time you and I worked together in such a way. Perhaps... Yes, I know just who to call upon for this!"},{"name":"FLHAMINN","text":"An old friend of mine will lend his aid. I have asked him to meet with us at Erralig's Burial Chamber. Will you come? I should very much like to introduce you to my Nielle."},{"name":"EADGYTHA","text":"The man at rest in the sarcophagus you speak of is survived by the great Songstress of Ul'dah in days past, F'lhaminn. I am told she can be found in Revenant's Toll."},{"name":"FLHAMINN","text":"It looks as though my old friend has yet to arrive. Come, let us meet Nielle while we wait. It is time to open his coffin."},{"name":"SYSTEM","text":"Inside the old coffin lies a perfectly preserved Elezen male. His beautiful, peaceful visage suggests a state of slumber rather than death."},{"name":"SYSTEM","text":"The absence of a pulse and breath suggest the absence of life, but it feels as though the corpse could awaken at any moment. It is the same phenomenon displayed by the remains of the young lady."},{"name":"GREINFARR","text":"(-???-)Well, I'd not expected to be called here of all places. It's been a long time, Lhaminn."},{"name":"FLHAMINN","text":"Indeed it has. I wonder, should I still call you the Bronze Bull?"},{"name":"GREINFARR","text":"Don't start with that. It's Greinfarr, just like it always was."},{"name":"FLHAMINN","text":"Greinfarr is an old friend─to both Nielle and myself."},{"name":"GREINFARR","text":"Hoho, I know this adventurer! The one what forged me a sword. You've my thanks for that, still. I cherish it to this very day. Tell me, then, for what are we here?"},{"name":"GREINFARR","text":"Hoho, I know this adventurer. The one what made short work of those gladiators. Tell me, then, for what are we here?"},{"name":"GREINFARR","text":"You... I know your face, adventurer. And it seems you know Lhaminn. Tell me, then, for what are we here?"},{"name":"FLHAMINN","text":"<span class=\"highlight\">Forename</span> is with us, Greinfarr, and <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is here to help─to save Nielle."},{"name":"FLHAMINN","text":"I've come to realize that so long as we are unable to put his death behind us, we will never be able to move forward with our lives. "},{"name":"GREINFARR","text":"There were choices I made when Niellefresne was killed. I chose not to dwell on his death. I chose to leave my friends and make myself scarce."},{"name":"GREINFARR","text":"Ever since, I haven't been able to live with myself. So if there's aught I can do now, I'll do it. Let us give him, and ourselves, peace."},{"name":"FLHAMINN","text":"Thank you, Greinfarr. Your words bring me great comfort."},{"name":"FLHAMINN","text":"Then I turn now to you, <span class=\"highlight\">Forename</span>. Tell your tale to Greinfarr. Tell him of the corpses, the thaumaturge, Heartstrike─everything."},{"name":"GREINFARR","text":"Another corpse that doesn't rot? It can't be. Heartstrike lost its power. It's useless, and has been ever since I stole it from Lord Lolorito some five years past!"},{"name":"FLHAMINN","text":"<span class=\"emphasis\">You</span>!? You mean to say you had it in your possession? Greinfarr, tell me now. Do you know who did this to Nielle!?"},{"name":"GREINFARR","text":"If only. I saw how he was. Dead, but not. It wasn't natural. I'd heard of the blade and what it could do. I suspected it had been used on him."},{"name":"GREINFARR","text":"So I thought if Heartstrike could be used to do this, perhaps it could be used to undo it. I meant to free his spirit from whatever gaol it's in. I learned the blade belonged to Lord Lolorito, and so I broke into his estate and stole it."},{"name":"FLHAMINN","text":"But the Heartstrike you took was already void of power, if it ever had any at all. And so you weren't able to save Nielle with it."},{"name":"GREINFARR","text":"Right. After that, I threw the blade into Soot Creek to be done with it."},{"name":"GREINFARR","text":"But this changes things. If Mumuepo dealt in these darkest of arts, might be he knows a way to save Nielle. Problem is, that crazed mummer's not like to speak any truths from his cell."},{"name":"GREINFARR","text":"I'll meet with him myself. I've some old friends of my own what may be able to arrange it. And you, adventurer─I'll have a word outside with you. "},{"name":"FLHAMINN","text":"Let us await my old friend within Erralig's Burial Chamber. I should very much like to introduce you to my Nielle."},{"name":"EADGYTHA","text":"If the widow of the dead man you seek to examine walks with you, and you have her blessing, then his coffin is yours to open. But I warn you─do nothing to dishonor the dead here, or you'll answer to me."},{"name":"GREINFARR","text":"To meet with Mumuepo may prove simple enough, but having the truth from him will not. That is where I ask your aid."},{"name":"GREINFARR","text":"I need you to speak with the alchemist Severian. Find out what tonics or potions he can muster to loose the lips of our Lalafell. I mean to present it under the guise of good intentions."},{"name":"GREINFARR","text":"Forgive me. This is the way, but I did not wish to speak of it to F'lhaminn. Now go, and may the gods go with you."},{"name":"FLHAMINN","text":"I am so happy Greinfarr agreed to help us. After Nielle died, he grew so...withdrawn. He has been a shadow of his former self."},{"name":"SEVERIAN","text":"So, the remains of the famed goldsmith Niellefresne suffer the same twisted fate as that of our young lady? And you believe the blade Heartstrike to be the common thread that weaves this tapestry together? Most intriguing!"},{"name":"SEVERIAN","text":"And now Greinfarr asks for a gift for Mumuepo, does he? A concoction to turn the Lalafell's tongue to talking. Such deviousness! I daresay I like the way our Greinfarr thinks."},{"name":"SEVERIAN","text":"As it just so happens, I was considering a similar tactic myself. Indeed, I have already begun preparation of the ingredients needed. Yet a dilemma lies before us. Namely this─Mumuepo is not fool enough to simply imbibe some unknown tonic presented him by a random caller."},{"name":"SEVERIAN","text":"But as can be expected, I have the solution. It has come to my knowledge that Mumuepo has an unslakable thirst for Mun-Tuy juice. And it just so happens that exposing said juice to the fermentation process twice over yields a natural truth serum─one our unsuspecting Lalafell is like to quaff heartily and without heed."},{"name":"SEVERIAN","text":"Here, then. Take these reagents. But mind your hand. They may appear to be no more than mere juice ingredients, but within them lies the potential for great chemical catastrophe."},{"name":"SEVERIAN","text":"Why do you tarry here? Greinfarr awaits the twice-fermented Mun-Tuy juice at Erralig's Burial Chamber, does he not? See it to him with all haste. And should you discover aught else, bring word to me forthwith!"},{"name":"SEVERIAN","text":"You require another batch of ingredients? Good gods, <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, what do you take me for? Some alchemist-in-waiting here to fulfill the pathetic demands born of the failures by your amateur hands? Bah! Here, but do not dare to ask again."},{"name":"SEVERIAN","text":"Yes, yes, this will do nicely. Color, aroma, taste─all are such that no lover of Mun-Tuy juice could resist. If Mumuepo is to accept any drink at all, it will be this. Hurry, you must deliver it to Greinfarr. There is no time to waste!"},{"name":"GREINFARR","text":"It will not be easy to have the truth from Mumuepo's mouth. That is where I need your help. Go, do as I have asked."},{"name":"FLHAMINN","text":"I cannot abide to stand here and do nothing while you and Greinfarr toil so. I will gather whatever other knowledge I can of these matters. There are many here I know who will speak freely with me."},{"name":"GREINFARR","text":"Were you able to mix us a gift for Mumuepo?"},{"name":"GREINFARR","text":"Hoho! A job well done, my friend. I knew I was in the right to ask this of you."},{"name":"GREINFARR","text":"I need time to see the deed done. You and F'lhaminn will have to wait."},{"name":"SYSTEM","text":"In probing fundamental reality as an alchemist, you have learned “Manipulation”!"}],"reward":{"gil":1748,"action":4580,"items":[{"num":250,"id":13},{"id":19533},{"id":19633,"one":1},{"id":19634,"one":1},{"id":19635,"one":1},{"id":19636,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":15}],"quests":[67973]},"next":[67975]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1020098","obj":{"i":1020098,"n":"Greinfarr","l":40,"q":2}},{"type":"npc","id":"1001361","obj":{"i":1001361,"n":"Eadgytha","l":40,"q":2}},{"type":"npc","id":"1018433","obj":{"i":1018433,"n":"F'lhaminn","l":67,"q":4}},{"type":"npc","id":"1020096","obj":{"i":1020096,"n":"F'lhaminn","l":40,"q":3}},{"type":"action","id":"4580","obj":{"i":4580,"n":"Manipulation","c":1985,"j":14,"t":7,"l":65}},{"type":"item","id":"19533","obj":{"i":19533,"n":"Doman Iron Alembic","l":220,"c":35622,"t":24,"p":31363}},{"type":"item","id":"19633","obj":{"i":19633,"n":"Kudzu Robe of Crafting","l":220,"c":43812,"t":35,"p":28749}},{"type":"item","id":"19634","obj":{"i":19634,"n":"Durium Chaplets","l":220,"c":48275,"t":37,"p":17249}},{"type":"item","id":"19635","obj":{"i":19635,"n":"Kudzu Culottes of Crafting","l":220,"c":45973,"t":36,"p":28749}},{"type":"item","id":"19636","obj":{"i":19636,"n":"Tigerskin Boots of Crafting","l":220,"c":46760,"t":38,"p":17249}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17927","obj":{"i":17927,"n":"Juice Ingredients","l":276,"c":21006,"t":63}},{"type":"item","id":"17928","obj":{"i":17928,"n":"Twice-fermented Mun-Tuy Juice","l":276,"c":20682,"t":63}},{"type":"quest","id":"67973","obj":{"i":67973,"n":"The Forbidden Blade","g":142,"l":"Ul'dah","s":630,"f":1}},{"type":"quest","id":"67975","obj":{"i":67975,"n":"No Sin Unpunished","g":142,"l":"Ul'dah","s":680,"f":1}}]}