{"quest":{"name":"The Forbidden Blade","location":"Ul'dah","id":67973,"patch":4.0,"sort":630,"icon":100691,"unlocksFunction":1,"eventIcon":71341,"issuer":1002299,"target":1002299,"involved":[1001294,1001361],"genre":142,"usedItems":[17925,17926],"journal":["Severian of the Alchemists' Guild wishes to have a word with you.","The results of Severian's investigation indicate the corpse of the young lady bears the marks of an attempted resurrection of the dead. Visit Yayaroku of the Thaumaturges' Guild and inquire after rumors about a thaumaturge excommunicated for necromancy.","Yayaroku no longer recalls the name of the excommunicated thaumaturge. Consult Severian at the Alchemists' Guild once more, and concoct a tincture of sweetened wisdom to refresh his memory.","Severian informs you that adding an electuary such as birch syrup to an intellectuary will render it agreeable to the sweetest of palates. Concoct one such delectable saccharine intellectuary <img class=\"hq-icon small\" src=\"images/item/hq.png\"> and deliver it to Yayaroku at the Thaumaturges' Guild.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Severian.","You deliver the sweetened intellectuary <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Yayaroku. It stirs him to speak of the former guildmaster Mumuepo, who rumors hold once attempted resurrection of the dead through use of an enchanted blade known as Heartstrike. Travel to Erralig's Burial Chamber and speak with Eadgytha to examine the coffin under the charge of this Mumuepo.","Eadgytha informs you that without the leave of Mumuepo, she is unable to allow examination of the coffin in his charge. Return to the Alchemists' Guild and seek the counsel of Severian.","Severian has requested a meeting with Mumuepo in order to receive permission to examine the coffin in his charge. Until such time, he advises you to continue your alchemical studies at the guild and see what new discoveries it has to offer.<br><br>※The next alchemist quest will be available from Severian upon reaching level 65."],"objectives":["Speak with Yayaroku at Arrzaneth Ossuary.","Speak with Severian.","<span class=\"alternative-container\"><span class=\"alternative\">Concoct an intellectuary <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the intellectuary <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Yayaroku at Arrzaneth Ossuary</span></span>.","Speak with Eadgytha at Erralig's Burial Chamber.","Speak with Severian."],"dialogue":[{"name":"SEVERIAN","text":"There you are, my dutiful pupil. I have been to the burial ground and examined that coffin of which you spoke. And yes, I wholeheartedly agree with you─a most strange phenomenon indeed is being visited upon the remains of that young lady."},{"name":"SEVERIAN","text":"There are the marks of blunt trauma about her skull. There are not the slightest signs of decomposition. There is a complete absence of the onset of rigor mortis. There is much and more that baffles science here, but what interests me most of all were the signs that indicate she was the subject of a most fell and forbidden practice."},{"name":"SEVERIAN","text":"It would be both premature and fallacious to proclaim this woman still among the living, but I would concede with some degree of confidence that she was the target of an attempted resurrection. Hmph, never would I have thought others so inclined as myself to toy with the taboo."},{"name":"SEVERIAN","text":"Ahhh, yes, now I recall! I once heard tell of a great thaumaturge of the Order of Nald'thal who was rumored to have dabbled in magic sinister and sable─magic that sought to undo the natural law. I wonder, could those rumors allude to this same attempted resurrection we are seeing?"},{"name":"SEVERIAN","text":"Hear me now, my ever capable assistant. You must travel to the Thaumaturges' Guild and there speak with a priest by the name of Yayaroku. Have it from his mouth and his alone whatever truth there may be to these rumors. I have the most sneaking of suspicions they may be inextricably linked to our curious corpse."},{"name":"YAYAROKU","text":"Hello there. Have you come to offer prayers to Nald'thal? Or perhaps you wish to give alms to our Order?"},{"name":"YAYAROKU","text":"A great thaumaturge once in our ranks? One who dabbled in the taboo, you say?"},{"name":"YAYAROKU","text":"Ah, and by taboo, I gather you are referring to the art of resurrection, are you not? I am afraid it is just as you say─those arts are taboo. They are forbidden to be practiced by the hands of mere man."},{"name":"YAYAROKU","text":"But yes, now that you mention this, I do recall one such thaumaturge. He was with us some time ago, and was obsessed with discovering the very origins of life. His zeal was unmatched, and drove him to explore those darkest arts when the answers he sought could not be found elsewhere."},{"name":"YAYAROKU","text":"But for the life of me I cannot remember his name. You must forgive me, my memory is not what it once was. Perhaps some alchemical potion or potable would serve to clear the cobwebs from my aging mind."},{"name":"YAYAROKU","text":"I must warn you, however, I have no palate for bitter things. But fear not─I wager Severian of the Alchemists' Guild would know best how to mix an intellectuary agreeable with a sweet-toothed Lalafell such as myself."},{"name":"SEVERIAN","text":"Resurrection of the dead... Most intriguing indeed."},{"name":"SEVERIAN","text":"Come then, speak. What insights did Yayaroku have to share?"},{"name":"SEVERIAN","text":"He asks for medicine in exchange for his knowledge? Very well, then he will have exactly what he desires. We will concoct for our little friend an intellectuary so sweet, he can count himself lucky if he is ever able to taste bitterness again!"},{"name":"SEVERIAN","text":"Surely a sweetened intellectuary will prove no difficult task for one of your alchemical abilities. You need only add a healthy dose of an electuary such as birch syrup to the normal components. I daresay the sweetness will be enough to rot the teeth from his very mouth! "},{"name":"SEVERIAN","text":"Your task is before you. Mix the intellectuary, take it to Yayaroku, and have from him whatever information he has to give. And see to it <span class=\"emphasis\">you</span> do not become forgetful before you report your findings to me."},{"name":"YAYAROKU","text":"I truly am sorry to trouble you with such a childish request. I pray a sweetened intellectuary is within your means to procure."},{"name":"YAYAROKU","text":"Is this the intellectuary you've prepared? Made to order, just for me? I am most grateful!"},{"name":"YAYAROKU","text":"Delicious! You certainly have succeeded in erasing any notes of bitterness. Well done! Yes, yes, yes... I feel the cobwebs clearing already."},{"name":"YAYAROKU","text":"Forgive me, I spoke a lie when I said I could not recall the name of the thaumaturge you asked of. I simply wanted nothing more than to try an intellectuary, and thought the opportunity too ripe to not pick."},{"name":"YAYAROKU","text":"And now, out of guilt, I will tell you all that I know. The man of whom you speak is none other than our former guildmaster, Mumuepo. Before the Calamity, he poured himself into studies of life's origins, and his appetite for knowledge was voracious and insatiable. "},{"name":"YAYAROKU","text":"I have heard rumors myself that he came to be in possession of an enchanted item called “Heartstrike”─a blade fabled to house the power to bring the dead back to life."},{"name":"YAYAROKU","text":"I know not if Mumuepo ever dared use the blade to attempt a resurrection. But I can tell you that he was stripped of his titles and privileges for countless crimes. Under normal circumstances we would not consent to such a blatant overreach, but the sultana was adamant, and the evidence was damning."},{"name":"YAYAROKU","text":"But back to the blade. Around the same time he was said to have obtained Heartstrike, he purchased for himself interment and funeral rights at Erralig's Burial Chamber."},{"name":"YAYAROKU","text":"To this day, there are those in these halls who whisper that perhaps the coffin he purchased contains the remains of some poor soul who found themself the victim of his perverse experimentations with death and life."},{"name":"YAYAROKU","text":"Of course, I myself believe no such thing. But if you have cause for concern, I suggest you visit Erralig's Burial Chamber. You will need to speak with Eadgytha before you are permitted to examine the remains interred there under Mumuepo's care."},{"name":"SEVERIAN","text":"Stop idling and mix the intellectuary Yayaroku has asked of you. We will need it if we are to hear what he knows of this attempted resurrection. If you find yourself wanting for more materials, you may come and see me."},{"name":"SEVERIAN","text":"Excellent! It appears your sweetened intellectuary is complete. Now, waste no time in delivering it to Yayaroku and hearing what he has to say."},{"name":"EADGYTHA","text":"You wish to examine the coffin in the charge of Mumuepo? And do you have his consent to do so?"},{"name":"EADGYTHA","text":"Then I am afraid I cannot permit it. Only the holder of the burial rights and relatives of the deceased are given leave to disturb these coffins. If you have not the blessings of either, then be gone from this place."},{"name":"YAYAROKU","text":"None more than those in our Order wish to know what secrets lie at the root of life. Even so, to turn to the taboo in pursuit of those secrets is an endeavor not condoned within these sacred halls."},{"name":"SEVERIAN","text":"Well, if it isn't my intrepid aide. Pray tell, what were you able to learn from Yayaroku?"},{"name":"SEVERIAN","text":"I see. So, it is looking ever more likely that the taboo practiced by Mumuepo was indeed that of resurrecting the dead."},{"name":"SEVERIAN","text":"And now we know of this foul instrument, as well─this Heartstrike. I confess, when I myself first looked into the magic of life and death some years ago, I heard tales of an enchanted blade by that name. But by the gods, never would I have thought it to truly exist!"},{"name":"SEVERIAN","text":"It can be no mere coincidence that Mumuepo purchased interment rites under the same moon he discovered the blade. I now have very little doubt he meant to use Heartstrike to resurrect whomever he buried there. After all, you must have the dead before you can bring back the dead."},{"name":"SEVERIAN","text":"This may very well mean the corpse Mumuepo put to rest in Erralig's Burial Chamber is the victim of an attempted resurrection. We cannot but investigate this further. Yet I know the protocols of that hallowed place. The keeper of the burial rights and family alone are allowed to pry open those coffins."},{"name":"SEVERIAN","text":"Very well. I will request a meeting with Mumuepo. I mean to ask everything there is to know about this Heartstrike, and will prostrate myself if I must to acquire his leave to further examine the sarcophagus in his charge."},{"name":"SEVERIAN","text":"You seemed shocked. Does it surprise you to see me take the initiative in such matters? I beg you, do not misinterpret the situation at hand. I am acting out of my own interest in this, and mine alone. I've no intention to permit you to have all the fun!"},{"name":"SEVERIAN","text":"I'm off, then. Why not let your curiosity get the better of you while you're here. The guild has made many promising discoveries of late. There is still much for you to learn within these walls."},{"name":"SYSTEM","text":"To proceed with the quest, use the materials provided by Severian to craft a high-quality intellectuary."},{"name":"SYSTEM","text":"Should your synthesis efforts prove unsuccessful, speak with Severian once more to receive another set of materials."},{"name":"SYSTEM","text":"To begin the crafting process, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>. Next, select <span class=\"highlight\">Special Recipes</span> from within the requisite crafting discipline, then <span class=\"highlight\">Story</span>, and lastly <span class=\"highlight\">Class Quests</span> to locate the desired recipe."},{"name":"SYSTEM","text":"In probing fundamental reality as an alchemist, you have learned “Quality Assurance”!"},{"name":"EADGYTHA","text":"You'll not touch a single coffin here without the leave of its keeper. Not on my watch."}],"reward":{"gil":838,"items":[{"num":250,"id":13},{"id":19523},{"id":19623,"one":1},{"id":19624,"one":1},{"id":19625,"one":1},{"id":19626,"one":1},{"num":5,"id":5825,"one":1}],"xp":1725300},"reqs":{"jobs":[{"lvl":63,"id":15}],"quests":[67972]},"next":[67974]},"partials":[{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1001294","obj":{"i":1001294,"n":"Yayaroku","l":40,"q":4}},{"type":"npc","id":"1001361","obj":{"i":1001361,"n":"Eadgytha","l":40,"q":2}},{"type":"item","id":"19523","obj":{"i":19523,"n":"High Steel Mortar","l":200,"c":35660,"t":25,"p":28512}},{"type":"item","id":"19623","obj":{"i":19623,"n":"Ruby Cotton Coatee","l":200,"c":43810,"t":35,"p":26136}},{"type":"item","id":"19624","obj":{"i":19624,"n":"Gyuki Leather Gloves of Crafting","l":200,"c":44573,"t":37,"p":15681}},{"type":"item","id":"19625","obj":{"i":19625,"n":"Ruby Cotton Bottoms","l":200,"c":45976,"t":36,"p":26136}},{"type":"item","id":"19626","obj":{"i":19626,"n":"Gyuki Leather Shoes","l":200,"c":46758,"t":38,"p":15681}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17925","obj":{"i":17925,"n":"Electuary Ingredients","l":270,"c":25105,"t":63}},{"type":"item","id":"17926","obj":{"i":17926,"n":"Intellectuary","l":270,"c":20668,"t":63}},{"type":"quest","id":"67972","obj":{"i":67972,"n":"Not Quite Dead Yet","g":142,"l":"Ul'dah","s":601,"f":1}},{"type":"quest","id":"67974","obj":{"i":67974,"n":"Do Goldsmiths Dream of Gilded Sheep","g":142,"l":"Ul'dah","s":650,"f":1}}]}