{"quest":{"name":"The Game of Confidence","location":"Gridania","id":67978,"patch":4.0,"sort":630,"icon":100685,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1020903,"involved":[1020904,1020905,1020906,1020907,1020908,1020909],"genre":136,"usedItems":[17877,17878],"journal":["Timbermaster Beatin has news regarding Cemi.","Upon receiving a letter from Cemi that rambles on about the delicious foods available in Hingashi, Beatin grows concerned that his young apprentice has lost sight of her true purpose there. Along with a new set of directives, he decides to send a trustworthy individual to join her in Kugane in order to keep her on track. That individual is you.","You speak briefly with Cemi and inform her of Beatin's orders: the two of you are to seek out troubled citizens and use your carpentry skills to solve their problems. Without missing a beat, she suggests splitting up and searching around town for folk in need of your saw and hammer.","You come across Cemi in the company of a distraught woman. Turning sheepishly to you, she begins to explain what happened, but is quickly cut off. As the lady before her tells it, owing to her plain features, she is always overlooked by everyone she meets and suffers from severe self-confidence issues. When Cemi approached her with the offer of help, she thought it a chance to finally overcome the sad hand life dealt her...only to have the apprentice fiddle with her tools without trying to listen. Ashamed at the unnecessary anguish she has caused, Cemi promises to find a way to fix her problem. Certain that the Mujikoza actors hold the key to standing out from a crowd, she asks that you go and interview them while she escorts the woman to the nearby Shiokaze Hostelry.","You speak with the actors who mostly suggest using cosmetics. A light touch here and there can change both how the world sees you and how you see yourself, they claim, and these positive changes within and without will help you cultivate self-confidence. This knowledge should be worth sharing with Cemi, who awaits you at the Shiokaze Hostelry.","You and Cemi conclude that a box in which she can store cosmetics will help the apprehensive woman become more self-assured. Allowing her easy access to all her brushes and powders, it is apparently the best remedy for a broken spirit. Craft a high-quality lavish dressing case and deliver it to the lady.<br><br>※In the event you lose materials or the synthesis ends in failure, you may try again by speaking with Cemi.","You present the lavish dressing case to your client and explain what the playhouse actors had to say about self-confidence. Deciding to take their suggestion, she thanks you and Cemi for your help and wishes you the best of luck in your journey. As she leaves, Cemi turns to you, with an eager expression on her face. Speak with the young carpenter and see what she has to say.","While disappointed by her own inability to deliver products to the satisfaction of her clients, Cemi is determined to do whatever it takes to become a top-tier craftsman. She tells you of how she intends to train in the upcoming days and weeks to elevate her skills. Hoping that you will join in on her quest to improve her woodworking prowess, she suggests you also take up the saw and hammer and build upon your current skill set. You part ways, promising to come back together to assist the people of Kugane in their furniture-related plights when you deem yourselves ready to do so.<br><br>※The next carpenter quest will be available from Cemi upon reaching level 65."],"objectives":["Speak with Cemi in Kugane.","Speak with Cemi Jinjahl.","Speak with the actors at the Mujikoza.","Speak with Cemi Jinjahl at the Shiokaze Hostelry.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a lavish dressing case <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the lavish dressing case <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the withdrawn woman</span></span>.","Speak with Cemi."],"dialogue":[{"name":"BEATINE","text":"<span class=\"highlight\">Forename</span>, I have received word from Cemi. She has made it safely to Kugane."},{"name":"BEATINE","text":"Or rather, that is what I have surmised from this letter that goes into great detail about the various new foods she has tried there..."},{"name":"BEATINE","text":"While I was the one to suggest she embark upon this trip alone, I have come to rethink my decision."},{"name":"BEATINE","text":"If this letter is any indication, she needs a mentor to guide her in her studies in Kugane─someone to keep her from becoming distracted from her goals. I would like for you to be that person."},{"name":"BEATINE","text":"To ensure she accomplishes what I sent her there to do, I would have the two of you search out local residents who appear to be troubled. Employing your carpentry skills, you are to find a way to solve their problems."},{"name":"BEATINE","text":"Thank you, child. It is good to know that I can always rely on you."},{"name":"BEATINE","text":"I imagine there are a number of things you need tend to before you leave, so I will say my farewells to you here. Till you return, <span class=\"highlight\">Forename</span>."},{"name":"CEMIJINJAHL","text":"<span class=\"highlight\">Forename</span>─'tis a true miracle that our paths would converge so soon and <span class=\"emphasis\">here</span> of all places!"},{"name":"CEMIJINJAHL","text":"I certainly hope you've been enjoying this splendid city as much as I am! I've only just arrived but find I am already completely enamored with its people, foods, and customs!"},{"name":"CEMIJINJAHL","text":"Everything here is so different, so unique─something which can no doubt be attributed to Kugane's extended isolation from the rest of the world. Take, for example, the delicate motifs that recur in much of their work. You would never be able to find this in Eorzea."},{"name":"CEMIJINJAHL","text":"Ah, forgive me! Surely you didn't come all this way to listen to my musings on such things! Though, um...why exactly have you come here, again?"},{"name":"CEMIJINJAHL","text":"For me, you say!? This is fantastic! Together, we're sure to have a grand time touring the area and taking in the sights! "},{"name":"CEMIJINJAHL","text":"So...Timbermaster Beatin would have us search for troubled citizens and fix their problems with our saws and hammers... What a brilliant idea!"},{"name":"CEMIJINJAHL","text":"Not only will this help me improve my skills, it will also afford me the perfect opportunity to establish my reputation as a carpenter!"},{"name":"CEMIJINJAHL","text":"We haven't a moment to waste! Let us scour the streets and see if anyone is in need of our assistance!"},{"name":"BEATINE","text":"Few are as passionate as Cemi, and I see great potential in her. One, however, cannot amount to anything on potential alone."},{"name":"CEMIJINJAHL","text":"<span class=\"highlight\">Forename</span>, thank the Matron you're here! I've found someone in need of our services. There's just one teensy problem..."},{"name":"WOMAN02442","text":"Why is it no one will ever listen to what I have to say!? &lt;sob&gt; Sh-She approached me asking if anything was wrong, so I thought that this time it would be different. As soon as I began talking, however, she sat down and began banging her tools together!"},{"name":"WOMAN02442","text":"Please, I cannot take this anymore! <span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>, I need help. <span class=\"emphasis\">Your</span> help."},{"name":"WOMAN02442","text":"I... I am just so fed up with the way I look. With this lank hair and these plain features, I melt right into the crowd. No one ever remembers who I am─after this, even you will probably forget me! &lt;sob&gt; My confidence dwindles by the day. It is to a point where I must summon every onze of courage to even speak to someone."},{"name":"CEMIJINJAHL","text":"I-I'm so sorry. I had no idea you felt that way. &lt;sigh&gt; Mother was right. I need to learn to listen instead of jumping to my own conclusions."},{"name":"CEMIJINJAHL","text":"Don't you worry, madam! We will find an answer to your problems. Now please, if you would, allow me to escort you to the Shiokaze Hostelry, where you might wait while we figure out how to go about this."},{"name":"CEMIJINJAHL","text":"<span class=\"highlight\">Forename</span>, in the meantime can you go and interview some of the Mujikoza actors?"},{"name":"CEMIJINJAHL","text":"Surely, they'll know best how to gain people's attention and have more confidence!"},{"name":"WOMAN02442","text":"Wh-Who is this strange girl!?"},{"name":"YACHIYO","text":"A woman who feels overlooked and is not confident in her own skin? Tsk-tsk. That simply will not do!"},{"name":"YACHIYO","text":"Perhaps your friend should try using cosmetics. Changing your external appearance often has the added benefit of transforming how you feel about yourself and how the world perceives you."},{"name":"YACHIYO","text":"Take us for example─we are an aggressive, burly bunch. With a dash of eyeshadow and bit of blush, however, even we will turn into a gaggle of girls before your very eyes! When we think we are girls, we become girls─simple as that."},{"name":"SHIRANAMI","text":"Confidence? You ask me of ways to gain confidence?"},{"name":"SHIRANAMI","text":"The best way to do that would be to improve yourself, whether that be from the inside out or the outside in."},{"name":"KIKUSUI","text":"Have I ever been ignored by an audience?"},{"name":"KIKUSUI","text":"Of course I have! When that happens, you pack a bit more powder onto your face, and spruce up your costume. You will find yourself standing a little straighter, talking a little louder, and moving a little bolder─and that's when you are sure to steal the show!"},{"name":"WOMAN02442","text":"On our way here a man tried to walk <span class=\"emphasis\">through</span> me! I mean, I knew I was forgettable but...but..."},{"name":"CEMIJINJAHL","text":"Any one of the other guild members would have found a way to fix the poor lady's problem by now. &lt;sigh&gt; All I've managed to do thus far is reinforce her fears..."},{"name":"CEMIJINJAHL","text":"<span class=\"highlight\">Forename</span>, thank the gods you've finally returned! Please, please, <span class=\"emphasis\">please</span> tell me you've thought of something! What can we make to help our friend raise her self-esteem and be noticed?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A fine spear to strike down all who pay her no mind!"},{"name":"A1","text":"A lavish dressing case to be filled with powders and blushes!"},{"name":"A1","text":"A dazzling lamp to attract the attention of all passersby!"},{"name":"CEMIJINJAHL","text":"A spear!? While I agree that anyone who deliberately ignores her could do with learning a lesson or two, don't you think violence is a tad too extreme!?"},{"name":"CEMIJINJAHL","text":"A wonderful solution! Cosmetics will allow her to enhance her features so she might stand out from the crowd. When people begin paying her more attention, she will be sure to regain her lost confidence."},{"name":"CEMIJINJAHL","text":"While you were away I took the initiative to gather some materials. Here, have a look and take what you require. Everything we spend will be reimbursed by the guild, so don't feel the need to hold back!"},{"name":"CEMIJINJAHL","text":"But of course! We draw the attention of any who pass by her with the radiant glow from a lantern! We can suspend it in front of her with an elaborate series of ropes and pulleys and...er... Mayhap there's a simpler solution?"},{"name":"CEMIJINJAHL","text":"What do you mean you lost your materials!?"},{"name":"CEMIJINJAHL","text":"I'm sorry. I didn't mean to shout. You just caught me by surprise, is all. Worry not, <span class=\"highlight\">Forename</span>, I have plenty of timber, nails, and whatever else you might need to spare!"},{"name":"CEMIJINJAHL","text":"Anything else? No? Well, here you are─hopefully this will prove sufficient!"},{"name":"CEMIJINJAHL","text":"Oh, and once you've finished crafting the box, please take it to our client straightaway! She's been rather morose, and I'm certain the sight of it will go a long way to cheering her up!"},{"name":"WOMAN02442","text":"Do you truly think there is hope for me?"},{"name":"YACHIYO","text":"Alter your look and you will soon find that it will transform who you are on the inside, as well."},{"name":"SHIRANAMI","text":"She can approach this any number of ways but what it all comes down to is self-improvement. If you dedicate yourself to excellence, you will find your confidence growing with each passing day."},{"name":"KIKUSUI","text":"Life is all an act, whether we admit it to ourselves or not. Through costumes and cosmetics, we can disappear into a role and eventually reemerge as that which we pretend to be."},{"name":"WOMAN02442","text":"...A dressing case? It is incredibly beautiful, but I fail to see how it will help me."},{"name":"WOMAN02442","text":"So you are saying altering my look will change the way I feel about myself and how people react to me?"},{"name":"WOMAN02442","text":"It's certainly worth a try. Wallowing in self-pity, as I have done until now, will fix nothing. This box, however, might."},{"name":"CEMIJINJAHL","text":"May I have a look?"},{"name":"WOMAN02442","text":"Oooh!"},{"name":"CEMIJINJAHL","text":"It's sooo beautiful! Everything, down to the last detail, has been crafted with such delicate precision. It's no wonder Timbermaster Beatin holds you in such high regard!"},{"name":"CEMIJINJAHL","text":"Even with years of practice, I doubt I'd be able to craft anything so splendid..."},{"name":"CEMIJINJAHL","text":"Madam, please accept my sincerest apologies for the earlier distress I caused you. I should have been more considerate of your feelings."},{"name":"WOMAN02442","text":"No, 'tis I who must apologize. If only I had the strength to convey my thoughts and trust in my own voice, none of this would have even been an issue. Besides, I daresay that meeting the two of you may well be a turning point in my life!"},{"name":"WOMAN02442","text":"From the bottom of my heart I'd like to thank you for your help. I wish you all the very best in your endeavors."},{"name":"CEMIJINJAHL","text":"Graaagh! Her words have lit a fire within me, unlike anything I've ever felt before! While I've been nothing but a hindrance thus far, I promise I won't be for much longer!"},{"name":"CEMIJINJAHL","text":"There's no need to hesitate! You're the best carpenter I know. I'm sure she will fall in love with the box you've made the moment she sees it!"},{"name":"CEMIJINJAHL","text":"Thank you, <span class=\"highlight\">Forename</span>. Without you, I think that lady might never have found a way to conquer that which has been holding her back."},{"name":"CEMIJINJAHL","text":"&lt;sigh&gt; Do you think there will ever come a day when I'll be able to address the clients' problems with the same swiftness that you do? ...Oh, but what am I saying? With a little practice and effort nothing is impossible!"},{"name":"CEMIJINJAHL","text":"There is much for me to learn, and it is time I take full advantage of all the Far East has to offer! Together, let us refine our skills and convene once more, when we have gotten them to a level we are satisfied with!"},{"name":"SYSTEM","text":"To proceed with the quest, use the materials provided by Cemi to craft a high-quality lavish dressing case."},{"name":"SYSTEM","text":"Should your synthesis efforts prove unsuccessful, speak with Cemi once more to receive another set of materials."},{"name":"SYSTEM","text":"To begin the crafting process, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>. Next, select <span class=\"highlight\">Special Recipes</span> from within the requisite crafting discipline, then <span class=\"highlight\">Story</span>, and lastly <span class=\"highlight\">Class Quests</span> to locate the desired recipe."},{"name":"SYSTEM","text":"In carving new paths into Far Eastern woodworking, you have learned “Quality Assurance”!"}],"reward":{"gil":1938,"items":[{"num":250,"id":10},{"id":19517},{"id":19623,"one":1},{"id":19624,"one":1},{"id":19625,"one":1},{"id":19626,"one":1},{"num":5,"id":5825,"one":1}],"xp":1725300},"reqs":{"jobs":[{"lvl":63,"id":9}],"quests":[67977]},"next":[67979]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1020903","obj":{"i":1020903,"n":"Cemi Jinjahl","l":2404,"q":2}},{"type":"npc","id":"1020904","obj":{"i":1020904,"n":"Cemi Jinjahl","l":2404,"q":1}},{"type":"npc","id":"1020905","obj":{"i":1020905,"n":"Withdrawn Woman","l":2404,"q":1}},{"type":"npc","id":"1020906","obj":{"i":1020906,"n":"Yachiyo","l":2404,"q":1}},{"type":"npc","id":"1020907","obj":{"i":1020907,"n":"Shiranami","l":2404,"q":1}},{"type":"npc","id":"1020908","obj":{"i":1020908,"n":"Kikusui","l":2404,"q":1}},{"type":"npc","id":"1020909","obj":{"i":1020909,"n":"Withdrawn Woman","l":2404,"q":1}},{"type":"item","id":"19517","obj":{"i":19517,"n":"High Steel Claw Hammer","l":200,"c":35063,"t":13,"p":28512}},{"type":"item","id":"19623","obj":{"i":19623,"n":"Ruby Cotton Coatee","l":200,"c":43810,"t":35,"p":26136}},{"type":"item","id":"19624","obj":{"i":19624,"n":"Gyuki Leather Gloves of Crafting","l":200,"c":44573,"t":37,"p":15681}},{"type":"item","id":"19625","obj":{"i":19625,"n":"Ruby Cotton Bottoms","l":200,"c":45976,"t":36,"p":26136}},{"type":"item","id":"19626","obj":{"i":19626,"n":"Gyuki Leather Shoes","l":200,"c":46758,"t":38,"p":15681}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17877","obj":{"i":17877,"n":"Dressing Case Materials","l":270,"c":22466,"t":63}},{"type":"item","id":"17878","obj":{"i":17878,"n":"Lavish Dressing Case","l":270,"c":53147,"t":63}},{"type":"quest","id":"67977","obj":{"i":67977,"n":"Uncharted Territory","g":136,"l":"Gridania","s":601,"f":1}},{"type":"quest","id":"67979","obj":{"i":67979,"n":"A Lesson in Listening","g":136,"l":"Kugane","s":650,"f":1}}]}