{"quest":{"name":"No Sin Unpunished","location":"Ul'dah","id":67975,"patch":4.0,"sort":680,"icon":100691,"unlocksFunction":1,"eventIcon":71341,"issuer":1020098,"target":1020107,"involved":[1002299,1012528,1020096,1020100,1020101,1020102,1020103,1020104,1020105,1020106,1020108,1021325,1021326],"genre":142,"usedItems":[17929,17930],"journal":["Greinfarr awaits you with news at Erralig's Burial Chamber.","Greinfarr regrets the mistakes of his past. To make amends, he resolves to find Heartstrike, and to do so by first calling upon Ul'dah's shopkeeps to learn whatever he might. Travel to Erralig's Burial Chamber and there speak with Greinfarr about his plan.","After conferring with Greinfarr, you have determined what shops you will each call upon. For your part, seek out Marcel at Eshtaime's Aesthetics.","Marcel informs you that he sold Heartstrike to a merchant by the name of Ansobert. While speaking with Marcel, you receive word from F'lhaminn. It seems that something has happened to Greinfarr. Go and speak with F'lhaminn at Frondale's Phrontistery.","Greinfarr was attacked by an unknown assailant, and the perpetrator escaped─albeit with a wounded hand. After consulting with Popokkuli about how best to analyze the blood left behind at the scene, he advises you to speak with Severian at the Alchemists' Guild.","Severian tells you of a chemical capable isolating certain trace elements present in a blood sample and inciting in them a luminescent reaction. Using a set of luminol ingredients as a base, synthesize a bottle of luminol <img class=\"hq-icon small\" src=\"images/item/hq.png\"> and deliver it to Popokkuli at the Steps of Thal.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Severian.","You delivered the bottle of luminol <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Popokkuli. Follow the bloodstains along the roadside, and then travel to Sapphire Avenue Exchange to speak with Popokkuli once more.","The apothecary Rarakiya tells you of a customer who recently purchased a salve for an open wound on his hand. Follow after Popokkuli, who set off in the direction of the Gate of Thal.","Together with Popokkuli, you track the perpetrator of the attack on Greinfarr and arrive at a letted warehouse. There you learn that the warehouse is in the use of the same merchant who purchased Heartstrike from Eshtaime's Aesthetics─Ansobert.<br><br>※The next alchemist quest will be available from Popokkuli at the Sapphire Avenue Exchange upon reaching level 70."],"objectives":["Speak with Greinfarr.","Speak with Marcel at Eshtaime's Aesthetics.","Speak with F'lhaminn.","Speak with Severian.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a bottle of luminol <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the bottle of luminol <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Popokkuli</span></span>.","Follow Popokkuli."],"dialogue":[{"name":"GREINFARR","text":"Sorry for the wait, friend. Thanks to your little gift, I heard what I needed from Mumuepo. I'll tell all as soon as some old friends of mine arrive."},{"name":"GREINFARR","text":"These two are Popokkuli and Seserukka, the sons of Amajina & Sons Mineral Concern─and old friends of mine. It was they who arranged my meeting with Mumuepo."},{"name":"GREINFARR","text":"Before I tell you what Mumuepo spoke of Heartstrike, I must tell you of our crime─the unforgivable crime that denied a young girl a happy life. "},{"name":"GREINFARR","text":"It was fifteen years past. The leaders of Ul'dah were weak in the face of the Garlean threat. And so Niellefresne and we had rebellion in our hearts."},{"name":"POPOKKULI","text":"One day, with the smallfolk behind us, we meant to take to the Syndicate a proposal of early and open war with the Empire. To lend our movement weight, we orchestrated a riot within the city center."},{"name":"FLHAMINN","text":"There was a festival, a parade, and a beast, bound and shackled. The plan was to set it loose so that we could then bring it back under control. Greinfarr and Niellefresne would become heroes of the people, and use that influence to lead the uprising. It was...folly."},{"name":"FLHAMINN","text":"Our plan failed. Once unleashed, the monster could not be brought to heel. It ran rampant, and in doing so killed Ascilia's father, Warburton. By our misguided hands, the only family that child had left was taken from her."},{"name":"GREINFARR","text":"But you raised her as your own after that. You did all you could to make things right. Not like me. I took the craven's route─I ran."},{"name":"GREINFARR","text":"No matter what good may come of the rest of my days, it will never undo that day. I must live with it, and I will. I'll carry that burden for me, and for Niellefresne."},{"name":"GREINFARR","text":"This wrong was ours and ours alone. We'll not ask or expect you to understand. It is enough that you seek out Heartstrike for your own reasons. But where our interests are the same, we'd like to help. Seserukka, tell <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"SESERUKKA","text":"As a Garlean spy loyal to the Ala Mhigan Resistance, Warburton learned of a threat to Ul'dah far more menacing than the Empire. Looking back, we can only assume it was Dalamud, and what it contained."},{"name":"GREINFARR","text":"Never did we imagine such a horror. We thought only to use the idea of a threat to stir the people to rebellion─to drive them to favor war with the Empire."},{"name":"GREINFARR","text":"But Warburton died, and with him whatever knowledge he had. And so we could not say for sure what the threat to Ul'dah was. Even so, Niellefresne would not relent."},{"name":"GREINFARR","text":"He conspired with Mumuepo to make use of Heartstrike. No doubt he meant to revive Warburton and hear from him what he knew."},{"name":"POPOKKULI","text":"But before he could, the Syndicate took action. They sought to stop the uprising that wanted war with the Empire, and did so by having assassins of Death's Embrace murder Niellefresne."},{"name":"SESERUKKA","text":"Mumuepo came across his remains, and thought it the perfect chance to test Heartstrike for his own ends. That is how Niellefresne became his first...subject."},{"name":"POPOKKULI","text":"Needless to stay, Niellefresne did not rise from the dead. Heartstrike's powers were no longer great enough to work such miracles."},{"name":"POPOKKULI","text":"There is likely a similar story behind the corpse of the young lady you found. After Mumuepo incurred the wrath of the sultana and was dismissed from the Order of Nald'thal and imprisoned, Heartstrike was returned to its original keeper─Lord Lolorito."},{"name":"GREINFARR","text":"It was then that I stole into Lord Lolorito's estate and made off with Heartstrike. But as we said, its powers had already waned."},{"name":"GREINFARR","text":"I swear by the gods I threw the bloody thing into Soot Creek to be done with it. If someone did use it on this girl, they must have fished it up from there."},{"name":"GREINFARR","text":"Beyond any magical powers, Heartstrike is worth a pretty gil simply as an ornamental blade. A true treasure. Mayhap someone found it at the creek bottom, sold it at market, and from there it found its way to some criminal hand."},{"name":"GREINFARR","text":"If there's any clues to be had, they'll be at the market. We'd do well to ask the city's shopkeeps what they know, but I can't ask them all on my own. Will you aid me in this, friend?"},{"name":"GREINFARR","text":"Then I am in your debt. Come, let us talk of who is to visit what shops once we are outside the burial chamber."},{"name":"GREINFARR","text":"I'll see to the Sapphire Avenue Exchange. Seserukka and Popokkuli, you take the Ruby Road Exchange."},{"name":"GREINFARR","text":"As for you, friend, pay a visit to Eshtaime's Aesthetics. It's owned by Lord Lolorito, after all. Someone there may know something of the path it's taken since it left his hands."},{"name":"FLHAMINN","text":"You mean to help us, even after learning of the horrible thing we've done?"},{"name":"SESERUKKA","text":"We'll find this Heartstrike. For Niellefresne!"},{"name":"POPOKKULI","text":"I never thought I'd see the day that brought the four of us back together."},{"name":"MARCEL","text":"By the stars, if it isn't the good <span class=\"highlight\">Forename</span>. Whatever brings you to us today?"},{"name":"MARCEL","text":"A good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, friend. How may I be of assistance?"},{"name":"MARCEL","text":"Heartstrike? Now that is a name I have not heard in many a moon."},{"name":"MARCEL","text":"But I can assure you that never in the past was Heartstrike the prize of a thief. Although, I do recall... Yes, yes, it was once sought after by some burgling ne'er-do-well or another. Unbeknownst to him or her, however, the blade they made off with was a fake commissioned from a talented adventurer."},{"name":"MARCEL","text":"The true Heartstrike had since lost whatever magical powers it may have had. Once word of that spread, its price on the market plummeted to little more than the counterfeit itself. It is for that reason that the decision was made to sell it to the merchant Ansobert."},{"name":"MARCEL","text":"Yet even so, I venture our dear Niellefresne is still held tight in the grip of its curse. To think, one of our very own, and one of Eshtaime's very finest. Oh, my poor Niellefresne..."},{"name":"FLHAMINN","text":"(-F'lhaminn-)<span class=\"highlight\">Forename</span>, are you there!? Please, you must come to Frondale's Phrontistery right away! Something dire has happened to Greinfarr!"},{"name":"MARCEL","text":"Oh my, you look as though you have somewhere else to be. Please, please, take your leave of me. If there is aught you ever need, please do not hesitate to ask again."},{"name":"FLHAMINN","text":"It is terrible, <span class=\"highlight\">Forename</span>. Greinfarr was attacked, and stabbed. I am told that his wounds are grievous."},{"name":"POPOKKULI","text":"And it would appear he wounded his assailant in turn. We have no idea who it was, but we have a blood trail leaving the scene of the crime."},{"name":"POPOKKULI","text":"We would simply follow the blood trail straight to our attacker, but it has been wiped clean in places. Quite deliberately."},{"name":"POPOKKULI","text":"You are an alchemist, are you not? You must ask your guild's great Severian what he would do. By what alchemy can we follow a blood trail that is no more?"},{"name":"POPOKKULI","text":"We will wait for you at the site of Greinfarr's assault. It lies on the road to Pearl Lane and the Gold Court. Bring us what we need!"},{"name":"POPOKKULI","text":"Hello there, <span class=\"highlight\">Forename</span>. Speak to F'lhaminn if you wish to hear what we know."},{"name":"SESERUKKA","text":"Don't you dare die on us, Greinfarr!"},{"name":"SEVERIAN","text":"A friend of yours was attacked, you say? Hmmm, do tell."},{"name":"SEVERIAN","text":"I see. So the blood left behind is the only parcel of evidence you have in your hope to identify this assailant, and it has been most conveniently and tidily tended to, leaving you unable to give pursuit. And this is why you have come to me, yes?"},{"name":"SEVERIAN","text":"Well, you were right to do so. The alchemical accolades I have accrued are not without merit, mind you. They are given precisely for my expertise in solving such scenarios with the greatest of ease. Did that rhyme? I believe it did. It would appear I am as great a poet as I am a scientist."},{"name":"SEVERIAN","text":"Shall we let class begin, then? Lesson number one─once spilled, blood cannot be completely removed from any surface. It may appear gone to the naked eye, but there are chemical components of blood that remain stalwart."},{"name":"SEVERIAN","text":"And those components can be made to dance before the mortal eye once more through use of a concoction known as luminol. It serves as a catalyst to trigger a luminescent reaction in any sanguine spillage. Come, I will provide you the ingredients."},{"name":"SEVERIAN","text":"This was asked of you by Popokkuli of Amajina & Sons? A worthy client indeed. Best not keep him waiting. Deliver the luminol to him with all haste, before it is too late and your criminal too far."},{"name":"SEVERIAN","text":"I daresay this case is leading you closer and closer to the fires of truth. But take care lest the flames burn you on your approach. I'll abide nothing to happen to you when you've so much work yet to do here."},{"name":"SEVERIAN","text":"I've enough luminol ingredients here to suffer your blundering failures for days to come. Just be sure if and when you finally succeed, you see the stuff quickly to Popokkuli."},{"name":"SEVERIAN","text":"I see you've prepared a bottle of luminol. A job well done. Now hurry and see it to Popokkuli while there is still time."},{"name":"POPOKKULI","text":"This is the spot where Greinfarr came under attack. Ohhh, I can't wait to catch whoever did this. I am going to do things to this person. Unspeakable things..."},{"name":"SESERUKKA","text":"We've asked a deed, and prepared a reward. Do the former, and the latter is yours."},{"name":"FLHAMINN","text":"Greinfarr..."},{"name":"POPOKKULI","text":"You've brought what we asked for? Then let us waste no more time."},{"name":"POPOKKULI","text":"Look, there! Where the blood trail was wiped away. It glows! And it leads toward the Sapphire Avenue Exchange."},{"name":"SESERUKKA","text":"The chase is on!"},{"name":"SYSTEM","text":"The blood trail glows an astral blue and leads to the north. "},{"name":"SYSTEM","text":"The blood trail glows an astral blue and leads to the northeast."},{"name":"SYSTEM","text":"The blood trail glows an astral blue and leads toward the Sapphire Avenue Exchange."},{"name":"SYSTEM","text":"The blood trail glows an astral blue and meanders throughout the area. It appears as if the attacker was searching for something here."},{"name":"SYSTEM","text":"The blood trail glows an astral blue and leads to the south."},{"name":"SYSTEM","text":"The blood trail glows an astral blue and indicates a slowing pace. Perhaps the attacker's refuge is nearby."},{"name":"SESERUKKA","text":"You've got what we asked for? Good! Deliver it to my brother right away!"},{"name":"POPOKKULI","text":"We've got a lead, <span class=\"highlight\">Forename</span>! This merchant claims to have seen an unsavory fellow with an open wound!"},{"name":"DRUGSTORE02439","text":"Indeed I did. He had blood flowing from a gash on his hand. I told him to make for the Phrontistery for treatment, but he simply purchased a salve for his wound and made off toward the Gate of Thal."},{"name":"POPOKKULI","text":"Then let us follow! Come, <span class=\"highlight\">Forename</span>. With you and your liquid magic, we'll sniff this cur out wherever he goes!"},{"name":"SESERUKKA","text":"That potion you mixed up is truly something. Never would I have believed a simple liquid would allow us to see the very footsteps of a fleeing criminal!"},{"name":"POPOKKULI","text":"There you are, <span class=\"highlight\">Forename</span>. Thanks to that brew of yours, I think we've found our attacker's den. It looks to be this letted warehouse."},{"name":"SESERUKKA","text":"I've spoken with the master, here. He says this warehouse is let by a merchant named Ansobert. Is that name known to you?"},{"name":"SESERUKKA","text":"What!? It is the same as the merchant who purchased Heartstrike from Eshtaime's Aesthetics!?"},{"name":"SESERUKKA","text":"That could only mean Greinfarr was attacked to interfere with us investigating these corpses. Ohhh, now I'm getting angry."},{"name":"POPOKKULI","text":"Thanks to this mongrel running, we were able to grab it by the tail. Now all that remains is to trap him."},{"name":"POPOKKULI","text":"Seserukka, take word to the Brass Blades. I'll stay posted here to make sure nobody slips by."},{"name":"SESERUKKA","text":"Consider it done!"},{"name":"POPOKKULI","text":"And you, <span class=\"highlight\">Forename</span>, get some rest. We could be in for a battle of attrition here if our quarry stays in his hole."},{"name":"SESERUKKA","text":"There's nowhere left to run now. We will end you!"}],"reward":{"gil":1095,"items":[{"num":250,"id":13},{"id":19565},{"id":5703,"one":1},{"id":5708,"one":1},{"id":5713,"one":1}],"xp":2902500},"reqs":{"jobs":[{"lvl":68,"id":15}],"quests":[67974]},"next":[67976]},"partials":[{"type":"npc","id":"1020098","obj":{"i":1020098,"n":"Greinfarr","l":40,"q":2}},{"type":"npc","id":"1020107","obj":{"i":1020107,"n":"Popokkuli","l":41,"q":2}},{"type":"npc","id":"1002299","obj":{"i":1002299,"n":"Severian","l":41,"q":23,"t":"Guildmaster"}},{"type":"npc","id":"1012528","obj":{"i":1012528,"n":"Marcel","l":41,"q":9}},{"type":"npc","id":"1020096","obj":{"i":1020096,"n":"F'lhaminn","l":40,"q":3}},{"type":"npc","id":"1020100","obj":{"i":1020100,"n":"F'lhaminn","l":41,"q":1}},{"type":"npc","id":"1020101","obj":{"i":1020101,"n":"Popokkuli","l":41,"q":1}},{"type":"npc","id":"1020102","obj":{"i":1020102,"n":"Seserukka","l":41,"q":1}},{"type":"npc","id":"1020103","obj":{"i":1020103,"n":"Popokkuli","l":41,"q":1}},{"type":"npc","id":"1020104","obj":{"i":1020104,"n":"Seserukka","l":41,"q":1}},{"type":"npc","id":"1020105","obj":{"i":1020105,"n":"Popokkuli","l":41,"q":1}},{"type":"npc","id":"1020106","obj":{"i":1020106,"n":"Seserukka","l":41,"q":1}},{"type":"npc","id":"1020108","obj":{"i":1020108,"n":"Seserukka","l":41,"q":1}},{"type":"npc","id":"1021325","obj":{"i":1021325,"n":"Popokkuli","l":40,"q":1}},{"type":"npc","id":"1021326","obj":{"i":1021326,"n":"Seserukka","l":40,"q":1}},{"type":"item","id":"19565","obj":{"i":19565,"n":"Doman Steel Mortar","l":260,"c":35662,"t":25,"p":37065}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"17929","obj":{"i":17929,"n":"Luminol Ingredients","l":285,"c":22614,"t":63}},{"type":"item","id":"17930","obj":{"i":17930,"n":"Luminol","l":285,"c":20681,"t":63}},{"type":"quest","id":"67974","obj":{"i":67974,"n":"Do Goldsmiths Dream of Gilded Sheep","g":142,"l":"Ul'dah","s":650,"f":1}},{"type":"quest","id":"67976","obj":{"i":67976,"n":"A Love Beyond Lifetimes","g":142,"l":"Ul'dah","s":700,"f":1}}]}