{"quest":{"name":"Uncharted Territory","location":"Gridania","id":67977,"patch":4.0,"sort":601,"icon":100685,"unlocksFunction":1,"eventIcon":71341,"issuer":1000153,"target":1000153,"involved":[1000139,1000140,1000384,1020901,1020902,1020987],"genre":136,"journal":["Timbermaster Beatin's already furrowed brow deepens.","Timbermaster Beatin is concerned about a young girl named Cemi who has been in low spirits of late. He has approached her on several occasions to learn what has been troubling her, but she refuses to speak to him of her woes. Believing she would be more willing to open up to you, he requests that you seek her out in front of the guild and ask what has been weighing on her mind.","Cemi is quick to reveal that she is concerned about the guild's current state of affairs, or more precisely, the effect they have been having on the guildmaster's health. She tells you of how profits have been dwindling and Beatin has been working himself to the bone to compensate for their losses. Convinced he has pushed his body to its physical limits, she believes it time for decisive action. She then asks that you accompany her to the Carline Canopy, where you are to help interview the local citizens on the types of furniture they are looking to purchase, so you might come up with a viable solution to raise revenue.","By speaking with the people at the Carline Canopy, you learn that furnishings from the Far East are currently all the rage amongst furniture buyers. It seems people are enamored of the more traditional crafting methods and unique patterns employed in the items exclusive to these regions. Seek out Cemi and inform her of what you have discovered.","Based on the information gathered at the Carline Canopy, Cemi concludes that the only way the Carpenters' Guild will stand a chance of surviving is to adapt their wares to the consumer's tastes. To this end, she means to impress upon Beatin the importance of offering Far East-inspired furnishings, and asks that you accompany her back to the guild to lend your voice to this endeavor.","Timbermaster Beatin is surprisingly receptive to what Cemi has to say. When she tells him that the guild needs to begin producing Far Eastern-style furniture to keep up with the markets, however, the discussion takes an unexpected turn, and Beatin counters Cemi's suggestion with an idea of his own. He says that he would like for her to travel to the Far East on the guild's behalf and learn the traditional ways of crafting oriental furnishings. Thrilled by the prospect, the young girl scurries off to prepare for departure, pausing only to say that she will send a letter when she reaches her destination.<br><br>※The next carpenter quest will be available from Beatin upon reaching level 63."],"objectives":["Speak with Cemi Jinjahl.","Question the Gridanians at the Carline Canopy.","Speak with Cemi Jinjahl.","Speak with Beatin."],"dialogue":[{"name":"BEATINE","text":"Ah, <span class=\"highlight\">Forename</span>. The very carpenter I thought to call upon."},{"name":"BEATINE","text":"One of our new recruits seems dispirited of late. Though I have approached her on several occasions, she is reluctant to share her troubles with me."},{"name":"BEATINE","text":"Mayhap you can try talking to her? She is like to be far more receptive to a brave and amenable <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> such as yourself."},{"name":"BEATINE","text":"Cemi is her name. You can find her out front treating cedar logs."},{"name":"CEMIJINJAHL","text":"Good gods! You─You're <span class=\"highlight\">Forename</span>! Famed adventurer and Beatin's most promising disciple! What are you doing here?"},{"name":"CEMIJINJAHL","text":"Ah, yes. <span class=\"emphasis\">That</span>. &lt;sigh&gt; It's nothing I can speak to most of the other guild members about, much less Timbermaster Beatin..."},{"name":"CEMIJINJAHL","text":"...You see, our guild...i-it's in peril! Our sales continue to plummet and if this downward trend is to continue, I know not what will become of it!"},{"name":"CEMIJINJAHL","text":"What concerns me more than that, however, is the toll this has been taking on the timbermaster. He's been working tirelessly and refuses to stop to even eat or drink. It's almost as though he's attempting to make up for everything at the expense of his own health!"},{"name":"CEMIJINJAHL","text":"If this continues, I'm afraid he won't have the strength to grip a saw, much less restore the Carpenters' Guild to its former glory."},{"name":"CEMIJINJAHL","text":"But not all is yet lost! I may have found a solution. If we were to speak with some of the locals to learn what kind of furniture designs are currently in demand, we can alter our products to fit their tastes and improve our sales!"},{"name":"CEMIJINJAHL","text":"It is, however, a rather monumental task for someone to take on alone─doubly so for an inexperienced carpenter like me. <span class=\"highlight\">Forename</span>, please, will you help me?"},{"name":"CEMIJINJAHL","text":"Oh, thank you! Thank you so very much!"},{"name":"CEMIJINJAHL","text":"Now, then, let's begin by interviewing potential customers at the Carline Canopy!"},{"name":"BEATINE","text":"You were unable to find her? I suggest you check again. While prone to distraction, she is not one to so easily abandon her duties."},{"name":"NAOHGAMDUHLA","text":"What sort of furniture have <span class=\"emphasis\">I</span> been buying?"},{"name":"NAOHGAMDUHLA","text":"Hm. Lately, I've been purchasing a lot of Far Eastern-style items. After all, that's what's popular nowadays."},{"name":"ADALHARD","text":"I recently finished building a house in the Lavender Beds and have been furnishing it with Doman-themed furniture."},{"name":"ADALHARD","text":"The bold yet delicate patterns prevalent in much of their work greatly resonates with me."},{"name":"PFARAHR","text":"Furniture?"},{"name":"PFARAHR","text":"I must say that the Hingan furnishings trickling in from the Far East have struck a chord with me. People are often far too eager to forsake their own heritage in exchange for keeping up with the latest fads. I, on the other hand, take great comfort in knowing my furniture embodies generation upon generation of tradition."},{"name":"CEMIJINJAHL","text":"But why!? Why won't you buy any of our furniture!? It's some of the best you'll find anywhere, crafted by Gridania's finest!"},{"name":"ANTOINAUT","text":"What I spend my money on is none of your concern! Now, calm yourself, else I'll have need to summon the Wailers and have you escorted out. "},{"name":"BEATINE","text":"Back already? You have discovered what has been weighing on our dear Cemi's mind, then?"},{"name":"CEMIJINJAHL","text":"How is it that the furniture from the Far East has so far surpassed the popularity of our local products? Gridania is home to carpenters whose skill is unmatched... &lt;sigh&gt; Or, at least, so I had thought."},{"name":"CEMIJINJAHL","text":"At this rate, our guild will fall into obscurity! We must convince Timbermaster Beatin to immediately begin producing Far Eastern-style furniture if we are to have any chance of surviving!"},{"name":"CEMIJINJAHL","text":"Had I more clout with him, I wouldn't hesitate to march in there and tell him as much, but as it stands, I'm afraid he won't take what I have to say seriously."},{"name":"CEMIJINJAHL","text":"If you─his star pupil─were to accompany me, however, my words will hold far more sway!"},{"name":"CEMIJINJAHL","text":"You'll come with me!? Fantastic! Let us go and pitch my idea to the timbermaster, then!"},{"name":"BEATINE","text":"I suppose the two of you are here because there is something you would like to discuss? Very well. Have at it."},{"name":"CEMIJINJAHL","text":"Sir, as you might already be aware, Far Eastern furnishings have recently been flooding the market. With men and women all across Gridania─Eorzea, even─only too eager to buy them, we are at a great risk of falling behind!"},{"name":"CEMIJINJAHL","text":"I believe, however, if we were to get ahead of this trend and begin manufacturing products of oriental design, we can convince more customers to purchase from us and improve the status of our guild!"},{"name":"BEATINE","text":"...Oh? And you think producing crude imitations will suffice?"},{"name":"BEATINE","text":"I will not have it said that we compromise on quality. If you are truly committed to this proposal, I will support you─provided you accept one condition."},{"name":"BEATINE","text":"You are to travel to Kugane. There, you will immerse yourself in their rich history and culture─both of which have given shape to their craft."},{"name":"BEATINE","text":"Developing a greater understanding of these things will allow you to produce items of a similar caliber to those found in that very region."},{"name":"CEMIJINJAHL","text":"That's it? That's the condition? Of course. I'd be delighted to go there! In fact, I shall make ready to depart posthaste!"},{"name":"CEMIJINJAHL","text":"Wish me luck! I shall send you a letter once I arrive!"},{"name":"BEATINE","text":"I wonder if she truly understands the purpose of my sending her there..."},{"name":"BEATINE","text":"&lt;sigh&gt; At the very least she seems to have overcome her despair... I suspect I have you to thank for that, <span class=\"highlight\">Forename</span>."},{"name":"CEMIJINJAHL","text":"Well then, I suppose all that is left for us to do now is await her letter."},{"name":"SYSTEM","text":"The next carpenter quest will be available from Beatin upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"CEMIJINJAHL","text":"Oh, I hope Master Beatin doesn't take umbrage. What if he turns his wrathful glare upon me, killing me instantly?"}],"reward":{"gil":713,"items":[{"num":250,"id":10},{"num":3,"id":12667}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":9}],"questsType":"all","quests":[67537,67895]},"next":[67978]},"partials":[{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1000139","obj":{"i":1000139,"n":"Adalhard","l":52,"q":1}},{"type":"npc","id":"1000140","obj":{"i":1000140,"n":"Pfarahr","l":52,"q":1}},{"type":"npc","id":"1000384","obj":{"i":1000384,"n":"Naoh Gamduhla","l":52,"q":2}},{"type":"npc","id":"1020901","obj":{"i":1020901,"n":"Cemi Jinjahl","l":52,"q":3}},{"type":"npc","id":"1020902","obj":{"i":1020902,"n":"Cemi Jinjahl","l":52,"q":1}},{"type":"npc","id":"1020987","obj":{"i":1020987,"n":"Cemi Jinjahl","l":52,"q":2}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"67537","obj":{"i":67537,"n":"More Fierce than Fire","g":136,"l":"Ishgard","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"67978","obj":{"i":67978,"n":"The Game of Confidence","g":136,"l":"Gridania","s":630,"f":1}}]}