{"quest":{"name":"A Lesson in Listening","location":"Kugane","id":67979,"patch":4.0,"sort":650,"icon":100685,"unlocksFunction":1,"eventIcon":71341,"issuer":1020903,"target":1020994,"involved":[1019061,1019062,1019063,1020910,1020912],"genre":136,"usedItems":[17879,17880],"journal":["Cemi is bouncing on the balls of her feet with uncontained excitement.","Cemi tells you that she has been working hard to improve her carpentry skills. As proof of her renewed dedication, she has found another client, a lady by the name of Ume, who runs the Umineko Teahouse. As a matter of fact, she has already finished making the requested item and is about to deliver it to her client. Certain her handiwork will be well received, Cemi then asks that you come along with her to witness her finest accomplishment yet.","Cemi presents a sign to Ume, whose face turns dark with displeasure. The teahouse owner complains that she requested an item to help her establish a group of regular patrons, not an advertisement aimed at the general community. At a complete loss, Cemi appeals to you for help. The shop owner takes notice, and assigns the task to you instead. It falls to you to craft an item that will improve the ambience of her teahouse, and in order establish what exactly that is, Ume suggests speaking with some of her customers.","You speak with some of the customers at the teahouse. While they praise the food and drink, they feel the shop wants for ways for them to pass the time, one popular suggestion being a place to enjoy their pipe. Now enlightened as to what the customers are looking for, you may return to the Shiokaze Hostelry and discuss with Cemi what you can make for Ume.","Together with Cemi, you toss about a few ideas on what items would generate the type of business the teahouse owner seeks. You come to the conclusion that a pipe box would serve best by offering guests the means to relax with a pipe. With the item thus decided, you may set about crafting a fine sample of it to present to Ume.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Cemi.","Ume is pleased by the pipe box, and tells you she believes it has great potential─a conversation which is interrupted by Beatin. One quick appraisal by him of what you crafted and a bad joke later, the teahouse owner disappears back to her shop, and the timbermaster begins lightly chastising Cemi for leaving all the carpentry to you. Going on to stress the importance of failure when it comes to learning, he urges her to take a more active role in her own education. He then tells his youngest apprentice it is time for her to pack up her things and make for Doma in Yanxia, keeping all she learned in Kugane in mind. Vowing to do so, she rushes back to the Shiokaze Hostelry, where you best meet with her one last time.","Before Cemi departs, she meets with you to say that she will be sending you a letter upon her arrival in Yanxia and that you can pick it up from Kotokaze at the Shiokaze Hostelry. For now the two of you part ways, knowing your paths will once again converge in Doma.<br><br>※The next carpenter quest will be available from Kotokaze upon reaching level 68."],"objectives":["Speak with Cemi Jinjahl at the Umineko Teahouse.","Speak with the Umineko Teahouse customers.","Speak with Cemi Jinjahl at the Shiokaze Hostelry.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a stylish pipe box <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the stylish pipe box <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Ume</span></span>.","Speak with Cemi Jinjahl at the Shiokaze Hostelry."],"dialogue":[{"name":"CEMIJINJAHL","text":"Ah, <span class=\"highlight\">Forename</span>! You're here!"},{"name":"CEMIJINJAHL","text":"Since we last met I've been working day and night to improve my shortcomings as a carpenter. I'm leaps and bounds from where I once was!"},{"name":"CEMIJINJAHL","text":"Until now, I've been undependable. I promise you, however, that from this moment forward, you'll be seeing an entirely new side of me."},{"name":"CEMIJINJAHL","text":"To prove to you just how much I've changed, I took the initiative and found us a new client. Her name is Ume and she runs the local teahouse. I've even finished crafting the item she requested of us. Haha! Are you impressed yet? Well, there's more."},{"name":"CEMIJINJAHL","text":"I'm scheduled to deliver it to her at her shop. You'll come with me, won't you? After all, my first successful business transaction is something you'll not want to miss!"},{"name":"CEMIJINJAHL","text":"Wh-What do you mean you can't use this? I took special care to listen to every word you said─this is exactly what you asked for! This charming little sign is certain to attract droves of customers."},{"name":"UME","text":"<span class=\"emphasis\">Exactly</span> what I asked for? Ha! It's a far cry from it!"},{"name":"UME","text":"I told you I wanted something which would help me establish a base of regular patrons. This is an advertisement aimed at the general public─the precise opposite of what I need."},{"name":"UME","text":"Even if I had requested this ridiculous sign, what makes you think it would do anything to convince customers to come here? The writing on it is illegible─you can scarcely make out the name of my shop."},{"name":"CEMIJINJAHL","text":"Oh dear... <span class=\"highlight\">Forename</span>, help..."},{"name":"UME","text":"Ah, you have brought a friend? You look like you have a good head on your shoulders. Perhaps you would be able to help me?"},{"name":"UME","text":"Excellent! While I cannot quite place my finger on it, I suspect my teahouse lacks something in the way of ambience. I would like for you to figure out what exactly that something might be and make me furnishings or accessories to improve it."},{"name":"UME","text":"If you find yourself short on ideas, you might speak with some of my customers. Mayhap you can ask them for their opinions on what would enhance their experience here."},{"name":"CEMIJINJAHL","text":"...As it seems I'm no longer needed here, I shall return to the Shiokaze Hostelry and ready some materials for you. Once you decide what it is you want to craft, come look for me and I shall provide you with what you need."},{"name":"UME","text":"&lt;sigh&gt; This girl─she hears the words but does she <span class=\"emphasis\">understand</span> any of them?"},{"name":"BYAKUDAN","text":"The teahouse is unusually noisy today. What's going on?"},{"name":"WAKA","text":"What is that racket? Is there a fight?"},{"name":"ADVENTUREYYYY","text":"What's happening over there? Do you need me to call the Sekiseigumi?"},{"name":"BYAKUDAN","text":"How would <span class=\"emphasis\">I</span> go about improving this place? While I have no complaints about the tea or food, it would be nice if they had books or a place to smoke to help pass the time..."},{"name":"WAKA","text":"Apologies, but I was just on my way out. If only this place were more willing to accommodate smokers, I would be that much more inclined to stay."},{"name":"ADVENTUREYYYY","text":"For all the good food and drink, it still lacks warmth. I would come here twice as often if they had a corner where I could sit back, relax, and have a smoke after a long day."},{"name":"UME","text":"The key to running a successful business is cultivating a loyal clientele. I need for you to assist me in doing just that."},{"name":"CEMIJINJAHL","text":"I've done it again! I've made a mess of things and left you to clean up after me. I'm really, <span class=\"emphasis\">really</span> sorry. I thought I could handle it this time..."},{"name":"CEMIJINJAHL","text":"<span class=\"highlight\">Forename</span>, I know not how to apologize to you. &lt;sigh&gt; It seems the harder I try, the more work I create for you."},{"name":"CEMIJINJAHL","text":"If only I could figure out what it is I'm doing wrong. I thought my problem was listening, so I made sure to take note of every word that came from our client's mouth, but it made no difference in the end..."},{"name":"CEMIJINJAHL","text":"But I digress! Now is not the time to be dwelling on my failure. Let us concentrate on fulfilling the tea shop proprietor's request."},{"name":"CEMIJINJAHL","text":"Do you have any ideas on what we can make to satisfy her?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A nice onsen where people can relax."},{"name":"A1","text":"A cudgel with which she can defend her establishment."},{"name":"A1","text":"A pipe box so people can have a smoke and unwind."},{"name":"CEMIJINJAHL","text":"Yes! In fact, that's such an amazing idea, when we tell her, she'll probably decide to convert her shop into an onsen!"},{"name":"CEMIJINJAHL","text":"Oooh! I can picture it now─people of all ages relaxing together in the steaming waters, chatting away as they sip on their equally hot cups of tea... Hold on! If the teahouse is replaced by an onsen, where will the customers get their tea?"},{"name":"CEMIJINJAHL","text":"...I don't think that will help Ume attract customers. If anything, it is certain to drive them away. Merchants who decide to take the law into their own hands are likely to provoke the ire of the Sekiseigumi, and that will not be good for publicity to say the least."},{"name":"CEMIJINJAHL","text":"That's it! I've noticed many men and women in Kugane do indulge on occasion. Setting a pipe box in the area is the perfect way to invite them to have a leisurely smoke after they've finished their tea. It's certain to keep them coming back."},{"name":"CEMIJINJAHL","text":"Now let us set about making it. You'll be needing this...maybe some of that, and of course, this. Here! That should be everything."},{"name":"CEMIJINJAHL","text":"I think the teahouse owner is quite...eager to receive her delivery. If you could finish the pipe box and see that it gets to her quickly, it'd be greatly appreciated."},{"name":"CEMIJINJAHL","text":"If you require any additional materials, please don't hesitate to ask. After all, there's plenty to go around."},{"name":"UME","text":"Hm. A pipe box, you say?"},{"name":"UME","text":"Ah, but of course. Why didn't I think of that? Most of my customers smoke. Inviting them to do so here, after they finish their sweets and tea, will no doubt encourage them to stop by more regularly."},{"name":"UME","text":"Do you see now, little lady? <span class=\"emphasis\">This</span> is what I was asking for!"},{"name":"CEMIJINJAHL","text":"Oh, yes. It is crystal clear now. &lt;sigh&gt; <span class=\"highlight\">Forename</span> is a master carpenter and, in contrast, I am nothing but a miserable failure..."},{"name":"BEATINE","text":"Ahem. Might I take a look at that?"},{"name":"CEMIJINJAHL","text":"Great gods! T-Timbermaster Beatin─what are you doing here!?"},{"name":"BEATINE","text":"I felt the call of wood and followed it here. ...Ah, yes. The intricate metal inlay, coupled with the finely polished wooden exterior leads me to believe that this is your work, <span class=\"highlight\">Forename</span>?"},{"name":"BEATINE","text":"You have quite the sense of humor, child. My dear lady, it seems my protégé here has seen fit to furnish you with a pipe box in the truest sense of the word."},{"name":"UME","text":"What, pray tell, do you mean?"},{"name":"BEATINE","text":"A pipe box holds ash and this particular one is made of <span class=\"emphasis\">ash</span> lumber... Mayhap, however, you would need to be a carpenter to fully appreciate the joke."},{"name":"UME","text":"Mayhap, indeed. All jesting aside, I would like to thank you for this magnificent gift. I cannot wait to see the reaction it will elicit from my guests!"},{"name":"BEATINE","text":"Cemi, from what I understand <span class=\"highlight\">Forename</span> made a pipe box at the request of a client. Tell me, why it is that you also did not craft one?"},{"name":"CEMIJINJAHL","text":"&lt;sigh&gt; I'm sorry, sir. I've been giving it my all. Really, I have, but the sad truth is that nothing I make is good enough to satisfy anyone! That's why I thought it best for me to stick to simply gathering materials..."},{"name":"BEATINE","text":"It is always a struggle in the beginning, but that is no excuse to quit. Failure builds character─character which will allow you grow as a craftsman."},{"name":"BEATINE","text":"While it may not feel like it, you have grown a great deal during your sojourn here in Kugane. However, it is time you packed your bags."},{"name":"BEATINE","text":"You are to journey to Yanxia next─to the lands beyond the Ruby Sea."},{"name":"CEMIJINJAHL","text":"Yes, sir! I shall make ready to depart straightaway."},{"name":"CEMIJINJAHL","text":"<span class=\"highlight\">Forename</span>, I will be going ahead of you, but worry not. Once I arrive, I shall send you a letter telling you where we can meet."},{"name":"BEATINE","text":"Cemi, before you go, allow me to say this: you have a firm grasp of all the basics and a sharp intuition, besides. There is, however, one thing that is holding you back."},{"name":"BEATINE","text":"You strive solely for perfection. Remember, your purpose is not to create something flawless, but something authentic. Something unique that will be cherished for years and years to come."},{"name":"CEMIJINJAHL","text":"You've finished? Fantastic! Please deliver it to Ume as soon as you can."},{"name":"CEMIJINJAHL","text":"How exciting is this? I'm going to Yanxia! Don't you fret, <span class=\"highlight\">Forename</span>─like I mentioned earlier, once I have settled in, I shall send a letter to you by way of Kotokaze."},{"name":"CEMIJINJAHL","text":"This time I have every intention of living up to Timbermaster Beatin's expectations. Why, I daresay we shall even be returning from our journey there with a tale or two on how I charmed my way into the locals' hearts with my carpentry skills."},{"name":"CEMIJINJAHL","text":"Till we meet again in Yanxia!"},{"name":"SYSTEM","text":"In carving new paths into Far Eastern woodworking, you have learned “Manipulation”!"}],"reward":{"gil":890,"action":4574,"items":[{"num":250,"id":10},{"id":19527},{"id":19633,"one":1},{"id":19634,"one":1},{"id":19635,"one":1},{"id":19636,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":9}],"quests":[67978]},"next":[67980]},"partials":[{"type":"npc","id":"1020903","obj":{"i":1020903,"n":"Cemi Jinjahl","l":2404,"q":2}},{"type":"npc","id":"1020994","obj":{"i":1020994,"n":"Cemi Jinjahl","l":2404,"q":1}},{"type":"npc","id":"1019061","obj":{"i":1019061,"n":"Ume","l":2404,"q":2}},{"type":"npc","id":"1019062","obj":{"i":1019062,"n":"Waka","l":2404,"q":1}},{"type":"npc","id":"1019063","obj":{"i":1019063,"n":"Byakudan","l":2404,"q":2}},{"type":"npc","id":"1020910","obj":{"i":1020910,"n":"Cemi Jinjahl","l":2404,"q":1}},{"type":"npc","id":"1020912","obj":{"i":1020912,"n":"Dull-eyed Adventurer","l":2404,"q":1}},{"type":"action","id":"4574","obj":{"i":4574,"n":"Manipulation","c":1985,"j":8,"t":7,"l":65}},{"type":"item","id":"19527","obj":{"i":19527,"n":"Doman Iron Halfheart Saw","l":220,"c":35025,"t":12,"p":31363}},{"type":"item","id":"19633","obj":{"i":19633,"n":"Kudzu Robe of Crafting","l":220,"c":43812,"t":35,"p":28749}},{"type":"item","id":"19634","obj":{"i":19634,"n":"Durium Chaplets","l":220,"c":48275,"t":37,"p":17249}},{"type":"item","id":"19635","obj":{"i":19635,"n":"Kudzu Culottes of Crafting","l":220,"c":45973,"t":36,"p":28749}},{"type":"item","id":"19636","obj":{"i":19636,"n":"Tigerskin Boots of Crafting","l":220,"c":46760,"t":38,"p":17249}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17879","obj":{"i":17879,"n":"Pipe Box Materials","l":276,"c":22453,"t":63}},{"type":"item","id":"17880","obj":{"i":17880,"n":"Stylish Pipe Box","l":276,"c":53146,"t":63}},{"type":"quest","id":"67978","obj":{"i":67978,"n":"The Game of Confidence","g":136,"l":"Gridania","s":630,"f":1}},{"type":"quest","id":"67980","obj":{"i":67980,"n":"Live and Let Dine","g":136,"l":"Kugane","s":680,"f":1}}]}