{"quest":{"name":"A Haven for the Bold","location":"Rhalgr's Reach","id":67985,"patch":4.0,"sort":40,"eventIcon":71201,"issuer":1020332,"target":1020347,"involved":[1020335,1020336,1020339,1020340,1020341,1020344,1020345,1020346],"genre":6,"journal":["Alphinaud is pondering how best to make use of your leisure."],"objectives":["Speak with Lyse."],"dialogue":[{"name":"YSHTOLA","text":"So they would have us wait. Very well."},{"name":"KRILE","text":"I can't imagine that they would refuse. But if they did..."},{"name":"ALPHINAUD","text":"So...it would seem we find ourselves with a surfeit of free time─"},{"name":"CONRAD","text":"Ah, forgive me. You are free to look around Rhalgr's Reach. In fact, I would encourage you to do so. It'll give you a better grasp of our current circumstances."},{"name":"ALPHINAUD","text":"Thank you, Master Kemp. I believe we will do just that."},{"name":"ALPHINAUD","text":"Let us make the most of this opportunity and assess the Resistance's capabilities."},{"name":"ALISAIE","text":"Free to poke our noses wheresoever we will, eh? I like the sound of that."},{"name":"LYSE","text":"Well, I already know this place inside out. I can show you around if you like, <span class=\"highlight\">Forename</span>?"},{"name":"LYSE","text":"Great! Let's get started."},{"name":"ALISAIE","text":"Ah, excellent. They've no shortage of sutlers here, should we have need of their services."},{"name":"ALPHINAUD","text":"Hardly surprising. Where there is war, there is profit to be had."},{"name":"LYSE","text":"I'll bet you think the Resistance is mostly made up of Ala Mhigan Highlanders like me, but the truth is that we don't even account for half."},{"name":"LYSE","text":"We've got Hellsguard from all the way over by the Spine in here, and plenty of Seekers of the Sun like Naago."},{"name":"LYSE","text":"There's even some beastmen─well, beast<span class=\"emphasis\">women</span>, I suppose─like that one over there. She's an Ananta. They've been with us for a while now."},{"name":"LYSE","text":"Well, one of the smaller factions has. The rest won't have anything to do with us. We're no different from the Garleans to them."},{"name":"LYSE","text":"They keep to themselves, spending all their time crafting. Ananta make the most amazing jewelry, by the way. They use magicks to twist metals and crystal into shapes you wouldn't believe. It's a pity people hardly ever get to see their work. But then most don't even know they exist."},{"name":"LYSE","text":"That's enough about them, anyway. Let's take a closer look at the statue of Rhalgr, shall we?"},{"name":"LYSE","text":"When you've seen one aetheryte, you've seen them all, right? Not quite. This one's an older design, dating back decades, to when the Fist of Rhalgr was still here."},{"name":"LYSE","text":"It may look a little different, but it works just as well as any other. I'll show you where the sutlers are next─but don't forget to attune to the aetheryte before we go!"},{"name":"LYSE","text":"Pretty awe-inspiring, isn't it? The breaker of worlds, who guided our ancestors to these lands all those centuries ago."},{"name":"LYSE","text":"Yda used to tell me the story on stormy nights. She wanted me to understand. To remember..."},{"name":"LYSE","text":"\"At the end of the Fifth Astral Era, when the waters rose higher and higher, people all across Eorzea beseeched the heavens for a sign. And lo, a burning star appeared in the eastern sky, and led the way to these mountains of Gyr Abania...“"},{"name":"LYSE","text":"“They who were saved by His grace pledged to honor and revere Him. To devote themselves to great works without and within...”"},{"name":"LYSE","text":"“A storm of blood approaches fast,<br>Hells open, Heavens weep.<br>For no one soul doth lie beyond<br>The measure of His Reach.”"},{"name":"LYSE","text":"That last part was inscribed on this stone by a monk of the Fist of Rhalgr. Yda explained it to me: “A day will come bringing strife and sorrow that none may escape. Waste not these precious hours, but in quiet preparation make strong the body and mind.”"},{"name":"LYSE","text":"I don't know if that “storm of blood” is finally upon us. But if it is, I have to believe that everything we've been through, everything that has led us to this point, will see us through in the end."},{"name":"LYSE","text":"...Agh! Sorry. That was all a bit melodramatic, wasn't it? Let's keep moving, shall we? Off to the infirmary!"},{"name":"LYSE","text":"This is the infirmary, as you can probably tell. Here's where the Resistance healers patch up the wounded and tend to the sick."},{"name":"LYSE","text":"No matter how carefully we planned our operations, casualties were inevitable. It's a sad thing to think about, but...it's also important to remember the cost, as Conrad would say."},{"name":"LYSE","text":"We should go. I'll show you the aetheryte plaza next."},{"name":"LYSE","text":"Arms, armor, potions─you name it, these folks've got it. The Resistance would be in a bad way without brave merchants to keep it provisioned."},{"name":"LYSE","text":"If you're short on anything, or you need something repaired, these are the people to speak to."},{"name":"LYSE","text":"Oh, Alphinaud and Alisaie are here. Why don't we see how they're getting on?"}],"reward":{"gil":810,"items":[{"id":18049,"one":1,"hq":1},{"id":18055,"one":1,"hq":1},{"id":18061,"one":1,"hq":1},{"id":18073,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67984]},"next":[67986,68456]},"partials":[{"type":"npc","id":"1020332","obj":{"i":1020332,"n":"Alphinaud","l":2403,"q":4}},{"type":"npc","id":"1020347","obj":{"i":1020347,"n":"Lyse","l":2403,"q":2}},{"type":"npc","id":"1020335","obj":{"i":1020335,"n":"Y'shtola","l":2403,"q":1}},{"type":"npc","id":"1020336","obj":{"i":1020336,"n":"Krile","l":2403,"q":1}},{"type":"npc","id":"1020339","obj":{"i":1020339,"n":"Lyse","l":2403,"q":1}},{"type":"npc","id":"1020340","obj":{"i":1020340,"n":"Alphinaud","l":2403,"q":2}},{"type":"npc","id":"1020341","obj":{"i":1020341,"n":"Alisaie","l":2403,"q":2}},{"type":"npc","id":"1020344","obj":{"i":1020344,"n":"Lyse","l":2403,"q":1}},{"type":"npc","id":"1020345","obj":{"i":1020345,"n":"Lyse","l":2403,"q":1}},{"type":"npc","id":"1020346","obj":{"i":1020346,"n":"Lyse","l":2403,"q":1}},{"type":"item","id":"18049","obj":{"i":18049,"n":"High Steel Helm of Fending","l":255,"c":40280,"t":34,"p":19994}},{"type":"item","id":"18055","obj":{"i":18055,"n":"High Steel Helm of Maiming","l":255,"c":40281,"t":34,"p":19994}},{"type":"item","id":"18061","obj":{"i":18061,"n":"Koppranickel Turban of Striking","l":255,"c":41712,"t":34,"p":19994}},{"type":"item","id":"18073","obj":{"i":18073,"n":"Koppranickel Turban of Scouting","l":255,"c":41713,"t":34,"p":19994}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"67984","obj":{"i":67984,"n":"The Promise of a New Beginning","g":6,"l":"Rhalgr's Reach","s":30}},{"type":"quest","id":"67986","obj":{"i":67986,"n":"A Bargain Struck","g":6,"l":"Rhalgr's Reach","s":50}},{"type":"quest","id":"68456","obj":{"i":68456,"n":"Sights of Crimson and Dawn","g":0,"l":"Rhalgr's Reach","s":0,"f":1}}]}