{"quest":{"name":"Beyond the Great Wall","location":"The Rising Stones","id":67982,"patch":4.0,"sort":10,"icon":100635,"eventIcon":71201,"issuer":1018330,"target":1020304,"involved":[1012813,1018329,1020284,1020285,1020286,1020287,1020288,1020289,1020290,1020291,1020300,1020301,1020302,1020303,1020308,1020495,1020518,1020525,1020526,1020527],"genre":6,"journal":["Alphinaud is a man with a great deal on his mind.","Ilberd's assault on Baelsar's Wall and subsequent summoning of the primal now known as “Shinryu” left the Eorzean Alliance with little choice but to occupy Castrum Oriens─an act almost certain to be interpreted as the prelude to a full-scale invasion. Yet if the Alliance must go to war, it would not do so alone. General Raubahn Aldynn has asked that the Scions of the Seventh Dawn secure the support of the Ala Mhigan Resistance, that they might join forces with the Alliance and drive the legions of Garlemald from Eorzea once and for all. This formal request for aid was not unanticipated, and you and your fellow Scions take little time to reach a consensus. To Ala Mhigo you will go─with Lyse to lead the way, given her ties to the Resistance.","As you are preparing to leave the Rising Stones, you are met by Yugiri and Gosetsu. The pair have resolved to return to the nation of Doma, in the Far East, to aid their comrades in the fight against Garlemald. Though your battlefields are a thousand malms apart, your purpose is one and the same, and so you bid them farewell, hoping that you might meet again one day to celebrate the liberation of two lands.","From Amarissaix's Spire, you and your fellow Scions look on Baelsar's Wall, and Castrum Oriens. Beyond them lies Gyr Abania, which has languished under imperial rule for twenty long years...","The serpent officer knows you at once. His man stands ready to escort you to the Wall, where the soldiers of four great nations have gathered in preparation for a long and bloody campaign.","At last you come to the fringes of Gyr Abania. To a new war─to a new front line. In the command center, the Flame General pores over a stack of maps, deliberating his next move.","Raubahn welcomes you warmly to Castrum Oriens, and restates his position that the Alliance will not advance further without the cooperation of the Ala Mhigan Resistance. As you make ready to depart on your mission, Cid Garlond appears and apprises you of the latest developments in the search for Omega and Shinryu: namely, that there have not been any, the fate and whereabouts of both remaining unknown. All the more reason to secure the support of the Resistance, then, as the Ironworks search parties cannot safely venture any deeper into occupied territory..."],"objectives":["Speak with Alphinaud.","Speak with Alphinaud at Amarissaix's Spire.","Speak with the serpent officer.","Speak with Raubahn."],"dialogue":[{"name":"ALISAIE","text":"There's no going back once we cross this bridge─and the gods only know what awaits us on the other side."},{"name":"KRILE","text":"Minfilia would have given anything for a chance to liberate her homeland. Were she still with us, I know she'd be the one leading the way."},{"name":"YSHTOLA","text":"...In our absence, Urianger and Thancred will handle administrative affairs. Continue to coordinate your operations with Alianne and the others, and report to them directly should you receive word of primal activity."},{"name":"RIOL","text":"Aye, aye, Cap'n. Ye can count on us."},{"name":"TATARU","text":"You remember M'naago, don't you? The messenger who brought word of the Griffin's attack on Baelsar's Wall? Well, she left not long ago, having made a full recovery. If you see her in Gyr Abania, be sure to send my love!"},{"name":"LYSE","text":"So, it's finally happening... Don't tell anyone, but I'm feeling a little bit nervous. Only a <span class=\"emphasis\">bit</span>, mind. I'll be fine once we get going.<br>...Hopefully."},{"name":"GOSETSU","text":"You are ready, shadow walker? There can be no turning back once we depart."},{"name":"YUGIRI","text":"Almost. There is but one thing that remains undone..."},{"name":"ALPHINAUD","text":"A thousand malms apart, yet united in purpose... Let us pray both our endeavors meet with success. Shall we, then?"},{"name":"TATARU","text":"Wait, wait, not just yet! I knew I'd forgotten something important! Lyse, could you come with me?"},{"name":"LYSE","text":"(-Lyse-)...Me? What, <span class=\"emphasis\">now</span>? Um...all right, then. If you insist..."},{"name":"LYSE","text":"(-Lyse-)Heh heh heh... What do you think?"},{"name":"TATARU","text":"As you can see, I designed it to be light and loose─an outfit tailor-made to the needs of a skilled fighter like Lyse."},{"name":"ALPHINAUD","text":"Your work never ceases to impress. Much more of this, and I may have to stop introducing you as the Scions' receptionist and start referring to you as our preeminent seamstress..."},{"name":"LYSE","text":"It's lovely, Tataru. Thank you. I feel like I could take on a legion..."},{"name":"TATARU","text":"I'm glad you like it. And with that, I'll delay you no longer. Safe travels!"},{"name":"ALPHINAUD","text":"Then onward, to Gyr Abania! Our first stop will be at Amarissaix's Spire, in the East Shroud."},{"name":"ALISAIE","text":"Papalymo had to know it would only be temporary. If Grandfather couldn't contain Bahamut with the power of a thousand thousand prayers, then what chance did his disciple stand, armed only with a broken staff..."},{"name":"YSHTOLA","text":"Though it may not be apparent to the naked eye, the aether here is in turmoil. Not since the Calamity has this land been subjected to forces of the magnitude unleashed by Shinryu and Omega."},{"name":"KRILE","text":"Was it always his plan to sacrifice his life to complete the ritual? To bring forth the arbiter of his vengeance, but not remain to see the aftermath?"},{"name":"LYSE","text":"...I won't let you down, Papalymo. I promise."},{"name":"SERPENTOFFICER","text":"The Alliance holds the Wall, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. You may cross at your leisure."},{"name":"ALPHINAUD","text":"All are present and accounted for. When you are ready, my friend, pray inform the officer that we wish to proceed into Gyr Abania."},{"name":"ALPHINAUD","text":"We should depart as soon as possible─for Lyse's sake. Staring at the Wall will do little to improve her state of mind."},{"name":"SERPENTOFFICER","text":"Ah, the Scions of the Seventh Dawn. We were told to expect you. Shall I summon someone to escort you to the Wall?"},{"name":"WARP","text":"Proceed to Castrum Oriens?"},{"name":"ALISAIE","text":"So this is East End. Not too different from the rest of the Shroud, is it? Though, truth be told, I'm not sure why I thought it would be."},{"name":"YSHTOLA","text":"The Alliance has done well to repurpose these imperial facilities for their own use so quickly."},{"name":"KRILE","text":"Quite an atmosphere here, isn't there? Everyone seems to be on pins and needles...though one can hardly blame them, given recent events."},{"name":"LYSE","text":"The General's in high spirits, don't you think? I know the feeling!"},{"name":"ALPHINAUD","text":"To see the colors of so many nations─Limsa Lominsa, Gridania, Ul'dah, and now Ishgard─well nigh brings a tear to my eye... We have much to be proud of, <span class=\"highlight\">Forename</span>."},{"name":"RAUBAHN","text":"Greetings, Scions. On behalf of the Eorzean Alliance, I welcome you to Castrum Oriens."},{"name":"ALPHINAUD","text":"Thank you, General. We were relieved to hear that your forces secured the Wall without incident. Have the imperials made any attempt to retake the castrum since then?"},{"name":"RAUBAHN","text":"None. Save for a few skirmishes between our scouts and their patrols, we've had barely any contact with them. But we all know it's only a matter of time before things escalate."},{"name":"RAUBAHN","text":"As if attacking Baelsar's Wall weren't enough, Ilberd summoned a primal right on their doorstep─and Garlemald is not like to let such shows of defiance go unanswered."},{"name":"ALPHINAUD","text":"'Twas a declaration of war, even if it was not Ilberd's to make. And now we are bound by it, for weal or for woe.<br>The Scions stand ready to serve, General. What would you ask of us?"},{"name":"RAUBAHN","text":"As stated in my message, the Alliance will not proceed without the support and cooperation of the Ala Mhigan people. We would have you serve as our emissaries and make contact with the Resistance."},{"name":"LYSE","text":"Consider it done, General. We won't let you down, I swear."},{"name":"RAUBAHN","text":"Then I'll leave you to it. Godsspeed!"},{"name":"CID","text":"Hah! Of all the castra in all the world, you walk into mine."},{"name":"ALPHINAUD","text":"Master Garlond! What brings you here?"},{"name":"CID","text":"A certain missing Allagan weapon and draconic primal. Omega and─Shinryu, I think the shinobi called it? Anyway, we've been studying their trail of destruction, hoping it might lead us somewhere─which it has singularly failed to do."},{"name":"RAUBAHN","text":"Then 'tis like Omega fell to earth in occupied territory...meaning it may already be in imperial hands."},{"name":"CID","text":"Even so, it bears repeating that we engaged the stasis systems. Assuming the command was received and executed successfully, the weapon will be of no use to them. Assuming. We should hurry up and find it, regardless."},{"name":"RAUBAHN","text":"All the more reason to reach out to the Resistance. If we want to press on into Gyr Abania, we'll need their blessing."},{"name":"LYSE","text":"Everyone's counting on us. Let's not waste any more time talking!"}],"reward":{"gil":1498,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67895]},"next":[67983]},"partials":[{"type":"npc","id":"1018330","obj":{"i":1018330,"n":"Alphinaud","l":481,"q":2}},{"type":"npc","id":"1020304","obj":{"i":1020304,"n":"Raubahn","l":2406,"q":9}},{"type":"npc","id":"1012813","obj":{"i":1012813,"n":"Krile","l":55,"q":2}},{"type":"npc","id":"1018329","obj":{"i":1018329,"n":"Y'shtola","l":55,"q":2}},{"type":"npc","id":"1020284","obj":{"i":1020284,"n":"Alphinaud","l":481,"q":1}},{"type":"npc","id":"1020285","obj":{"i":1020285,"n":"Alisaie","l":481,"q":1}},{"type":"npc","id":"1020286","obj":{"i":1020286,"n":"Lyse","l":481,"q":1}},{"type":"npc","id":"1020287","obj":{"i":1020287,"n":"Y'shtola","l":481,"q":1}},{"type":"npc","id":"1020288","obj":{"i":1020288,"n":"Krile","l":481,"q":1}},{"type":"npc","id":"1020289","obj":{"i":1020289,"n":"Yugiri","l":481,"q":1}},{"type":"npc","id":"1020290","obj":{"i":1020290,"n":"Gosetsu","l":481,"q":1}},{"type":"npc","id":"1020291","obj":{"i":1020291,"n":"Tataru","l":481,"q":1}},{"type":"npc","id":"1020300","obj":{"i":1020300,"n":"Alphinaud","l":55,"q":1}},{"type":"npc","id":"1020301","obj":{"i":1020301,"n":"Alisaie","l":55,"q":1}},{"type":"npc","id":"1020302","obj":{"i":1020302,"n":"Lyse","l":55,"q":1}},{"type":"npc","id":"1020303","obj":{"i":1020303,"n":"Serpent Officer","l":55,"q":1}},{"type":"npc","id":"1020308","obj":{"i":1020308,"n":"Krile","l":2406,"q":4}},{"type":"npc","id":"1020495","obj":{"i":1020495,"n":"Y'shtola","l":2406,"q":2}},{"type":"npc","id":"1020518","obj":{"i":1020518,"n":"Riol","l":481,"q":1}},{"type":"npc","id":"1020525","obj":{"i":1020525,"n":"Alphinaud","l":2406,"q":6}},{"type":"npc","id":"1020526","obj":{"i":1020526,"n":"Alisaie","l":2406,"q":6}},{"type":"npc","id":"1020527","obj":{"i":1020527,"n":"Lyse","l":2406,"q":5}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"67983","obj":{"i":67983,"n":"Lyse Takes the Lead","g":6,"l":"The Fringes","s":20}}]}