{"quest":{"name":"Tea Party Rules","location":"Gridania","id":67981,"patch":4.0,"sort":700,"icon":100685,"unlocksFunction":1,"eventIcon":71341,"issuer":1020901,"target":1000153,"involved":[1020911,1020916,1020917,1020918,1020919,1020920,1020987],"genre":136,"usedItems":[17883,17884],"journal":["Cemi is desperately trying to catch your attention.","Cemi informs you that you are needed back at the Carpenters' Guild, as Timbermaster Beatin has a client he would like for you to meet with.","The client who awaits you is none other than Gairhard. He explains that, ever since his unit's heroic victory over Ixal forces, new recruits have been pouring in─the latest batch being a mixture of Ala Mhigans and Gridanians who took an immediate dislike to one another. In an attempt to promote harmony, Gairhard held a tea party, only for things to go terribly awry. Now tensions are on a knife-edge, and he has come to the Carpenters' Guild hoping you might have a solution. Beatin suggests that you and Cemi begin by talking with the new recruits at the Adders' Nest to assess what you can do to dispel the unpleasant feelings between them.","You hear from a Gridanian recruit that an Ala Mhigan counterpart served his homeland's tea at what was supposed to be a neutral setting. Aggrieved by what they took to be blatant disrespect for their culture, the Gridanians are far from willing to forgive the Ala Mhigans, much less befriend them. You have heard one side of the story; it would be prudent to hear the other.","The Ala Mhigans saw serving their tea to the Gridanians as a way to share their culture. However, instead of politely receiving the tea, the Gridanians looked down their nose at it. Incensed by this spurning of their goodwill, the Ala Mhigans now refuse to associate with anyone but themselves. Having given both sides their say, you may now return to Timbermaster Beatin with any ideas you might have to restore relations between the two factions.","Timbermaster Beatin believes your idea of holding a tea party in Far Eastern fashion has merit, as it will provide the recruits with the necessary atmosphere to work out their differences. For such a tea party to take place, however, certain Kugane-style furnishings must first be made. As one of the two carpenters to have experienced firsthand the wonders of the teahouses in the Far East, it is up to you to craft them. Fashion a high-quality teahouse bench and present it to Gairhard.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Beatin.","You present your teahouse bench to Gairhard, who is unaware of what he is looking at, prompting Beatin to step in and explain its virtues. Cemi then presents her own handiwork, and to everyone's surprise, it turns out to be an identical bench to yours. While Gairhard rounds up his men for another tea party, Beatin instructs you and Cemi to take the benches to Apkallu Falls and arrange them in such a way as to replicate the teahouses of Kugane.","Gairhard's second attempt to bring his new recruits together through a tea party is a rousing success. The Ala Mhigan and Gridanian initiates bond over the exquisite Far Eastern furnishings and food, and soon excited chatter and joyous laughter ring through the private coves of Apkallu Falls. Your mission thus accomplished, you may rejoin Beatin and Cemi at the Carpenters' Guild with an easy heart.","Timbermaster Beatin offers you and Cemi his unreserved praise. In particular, he notes that Cemi has begun to think more like you─a master of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> art. While her furnishings are still lacking in quality, he points out that the customer's satisfaction is the most important thing, and encourages her to continue dedicating herself to her craft. Inspired by his words, Cemi rushes off to train. Last of all, Beatin thanks you for all your help, adding that he hopes you continue to use your gods-given talents to assist all those in need."],"objectives":["Speak with Beatin.","Speak with the Gridanian soldier.","Speak with the Ala Mhigan soldier.","Speak with Beatin.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a teahouse bench <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the teahouse bench <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Gairhard</span></span>.","Speak with Gairhard at Apkallu Falls.","Speak with Beatin."],"dialogue":[{"name":"CEMIJINJAHL","text":"<span class=\"highlight\">Forename</span>, there you are! I was beginning to wonder when you'd show up."},{"name":"CEMIJINJAHL","text":"Timbermaster Beatin says he has some clients he wants to introduce to us."},{"name":"CEMIJINJAHL","text":"Well, don't just stand there. Let's go!"},{"name":"BEATINE","text":"You are here. Good. Gairhard, you remember <span class=\"highlight\">Forename</span>."},{"name":"GAIRHARD","text":"Remember? Ha! I could hardly forget! It would be no exaggeration to say that I owe this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> my life."},{"name":"GAIRHARD","text":"In fact, the reason I'm here is related to the time <span class=\"highlight\">Forename</span> saved us. By the bow <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> brought, I was able to drive out the Ixal forces that threatened us. Our victory against them has bolstered our unit's reputation, and we have been receiving new recruits by the dozens since."},{"name":"GAIRHARD","text":"In our latest batch, we received a mixture of eager Ala Mhigans and Gridanians. If you do not yet see the problem, allow me to explain. There have always been certain...racial tensions between the refugees and locals."},{"name":"GAIRHARD","text":"I thought holding a tea party might ease the unease between them. I was wrong. Now they seem to have an even greater aversion to one another."},{"name":"BEATINE","text":"There you have it. I suggest you begin by speaking with Gairhard's recruits to see what exactly went wrong. If we can pinpoint the cause of their feud, it will make it that much easier for us to solve the problem."},{"name":"CEMIJINJAHL","text":"Yes, sir! You can count on me."},{"name":"BEATINE","text":"<span class=\"highlight\">Forename</span>, would you mind accompanying Cemi?"},{"name":"BEATINE","text":"Mind you, this is an official request. It would not do to send someone who has yet to complete basic training to carry out this task alone."},{"name":"GAIRHARD","text":"So it'll be the two of you, then? Good. Now I imagine most of my new recruits will be at and around the Adders' Nest. You should have no trouble finding them."},{"name":"BEATINE","text":"Once you have finished, see that you report back to me."},{"name":"CEMIJINJAHL","text":"Yes, sir."},{"name":"CEMIJINJAHL","text":"I shall do everything in my power to see that our new client is completely satisfied."},{"name":"GAIRHARD","text":"You have a knack for showing up at the right place at the right time."},{"name":"GRIDANIANSOLDIER02445","text":"If you're here to talk with the captain, he's─ You're here to speak with <span class=\"emphasis\">me</span>?"},{"name":"GRIDANIANSOLDIER02445","text":"Why don't we like <span class=\"emphasis\">them</span>? Well, it's obvious, isn't it?"},{"name":"GRIDANIANSOLDIER02445","text":"Every time we try to reach out to them, how are we repaid? With hostility. Take the tea party Captain Gairhard arranged for us for example. We attended hoping to turn over a new leaf."},{"name":"GRIDANIANSOLDIER02445","text":"They, however, clearly came for different reasons entirely because the moment we sat down, they served us Ala Mhigan tea!"},{"name":"GRIDANIANSOLDIER02445","text":"It seems they have gone from refusing to accept our culture to openly spurning it!"},{"name":"GRIDANIANSOLDIER02445","text":"&lt;sigh&gt; My apologies but I would like to leave it at that, lest anger get the best of me. If you wish to know more, however, perhaps you should try speaking with one of Ala Mhigan recruits."},{"name":"ARAMIGOSOLDIER02445","text":"What're you looking at? Is there something you need? If not, I suggest you move along."},{"name":"ARAMIGOSOLDIER02445","text":"Those questions sound an awful lot like the ones Captain Gairhard asked us yesterday. Is he the one that put you up to this?"},{"name":"ARAMIGOSOLDIER02445","text":"Every day we Ala Mhigans bleed and fight and die to protect this country, and yet the Gridanians still regard us with the same suspicion and resentment that they do beastmen."},{"name":"ARAMIGOSOLDIER02445","text":"Even so, we decided that the tea party Captain Gairhard arranged was a good chance for us to establish some common ground with them and find a way to lay aside some of our differences."},{"name":"ARAMIGOSOLDIER02445","text":"We thought serving Ala Mhigan tea would be a good way to break the ice. But no! Our kind gesture was met only with disdainful stares!"},{"name":"ARAMIGOSOLDIER02445","text":"Well, no longer will we be made to feel worthless by the Gridanians. From now on, we'll have nothing to do with them!"},{"name":"GAIRHARD","text":"It seems you've got yourself quite the new recruit there, Beatin."},{"name":"BEATINE","text":"Jealousy does not become you, my friend."},{"name":"CEMIJINJAHL","text":"My new motto is: “live, love, and craft to fulfill the needs of others.” Now I'll never forget any of the lessons I learned while in the Far East."},{"name":"BEATINE","text":"I see you have spoken with some of Gairhard's newest recruits. Do you have any ideas on how we might put an end to their feud?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A striking dummy should do the trick."},{"name":"A1","text":"A Far Eastern-style tea party should end the bickering."},{"name":"A1","text":"A matching set of furniture should bring them together."},{"name":"BEATINE","text":"A striking dummy? While that would allow the recruits to vent their anger, it does little to address the root of the problem."},{"name":"BEATINE","text":"A Far Eastern-themed tea party? That just might work. No one would feel as though they are being snubbed and the interesting setting might even provide them with a topic of conversation."},{"name":"BEATINE","text":"You recall the teahouse benches of Kugane, do you not? Very good. I suggest you craft one."},{"name":"BEATINE","text":"Would you be happy to learn you have the same set of furniture as someone you greatly dislike? Of course not! In fact, you might even take an axe to it."},{"name":"GAIRHARD","text":"Success is only possible if each of the members of the squad completely trust one another."},{"name":"GRIDANIANSOLDIER02445","text":"It's not as though we wanted to fight. We're on the same side, for gods' sakes! Sadly, they don't seem to realize that."},{"name":"ARAMIGOSOLDIER02445","text":"The Gridanians took us in when we lost our home to the imperials, and it is to show our appreciation that we took up sword and lance. We never intended for things to escalate as they did, but it's out of our hands now."},{"name":"GAIRHARD","text":"What's this? I've never seen anything like it..."},{"name":"BEATINE","text":"You are looking at a teahouse bench─the quality and make of which is identical to those crafted by the master carpenters of the Far East."},{"name":"BEATINE","text":"Now, Cemi, what have you made for us?"},{"name":"CEMIJINJAHL","text":"Allow me to present to you with this!"},{"name":"BEATINE","text":"This... This is the exact same thing as <span class=\"highlight\">Forename</span> crafted. What led you to decide upon a teahouse bench?"},{"name":"CEMIJINJAHL","text":"After speaking with the initiates, I surmised that both sides had attended the tea party hoping to reconcile their differences. Given the right environment, I reckon they still can!"},{"name":"CEMIJINJAHL","text":"So I thought, why not hold a Far Eastern-style tea party! Not only would it provide them with a relaxed atmosphere, but it would give them a chance to bond over a culture that is different from their own."},{"name":"BEATINE","text":"That you have begun taking the needs of the clients into consideration, and in doing so, came to the same conclusion as <span class=\"highlight\">Forename</span> is evidence that you have matured as a carpenter. Well done."},{"name":"BEATINE","text":"Now, it is time to put your benches to the test. I would have the two of you take them to Apkallu Falls and set them up."},{"name":"BEATINE","text":"Gairhard, gather your subordinates and <span class=\"highlight\">Forename</span> and Cemi there. I will join you all shortly."},{"name":"GAIRHARD","text":"Very well."},{"name":"BEATINE","text":"If, for whatever reason you run out of materials, do be sure to let me know."},{"name":"BEATINE","text":"Gairhard should find this to be most satisfactory. I do not, however, intend to speak on his behalf. Please, present your bench to him for approval."},{"name":"GRIDANIANSOLDIER02445","text":"Another tea party? You can't possibly think that's a good idea after the last one."},{"name":"ARAMIGOSOLDIER02445","text":"What is the captain thinking, holding another tea party?"},{"name":"BEATINE","text":"Please, go with Cemi to Apkallu Falls. I shall meet you there."},{"name":"CEMIJINJAHL","text":"We're hosting a tea party, <span class=\"highlight\">Forename</span>. Hehe! Isn't it so exciting?"},{"name":"GAIRHARD","text":"Welcome, everyone."},{"name":"GAIRHARD","text":"While I know our last tea party was by no means a rousing success, I appreciate how willing most of you were to give this idea a second chance."},{"name":"GAIRHARD","text":"It seems some of you felt that certain cultures were disrespected at our last get-together. For that, I apologize."},{"name":"GAIRHARD","text":"Regardless of where you are from, I value and respect every one of you. As you should each other, for we are brothers- and sisters-in-arms─family, if you will."},{"name":"GAIRHARD","text":"I hope that this gathering the craftsmen of the Carpenters' Guild helped me organize will allow you to realize that. Now, for the fun part..."},{"name":"GAIRHARD","text":"What do you think, everyone? Before you is an exact replica of a teahouse in Kugane."},{"name":"ARAMIGOSOLDIER02445","text":"Kugane? As in the Far Eastern port city? Well, I suppose these decorations do have a certain exotic charm..."},{"name":"GRIDANIANSOLDIER02445","text":"A Kugane-style tea party, huh? Everything looks so elegant. These furnishings are almost as beautiful as those found here in Gridania."},{"name":"BEATINE","text":"Carpentry is culture, and culture is ever present in our lives. One can learn a great deal about a people simply by looking at their furniture."},{"name":"GRIDANIANSOLDIER02445","text":"Sitting here upon these benches has made me realize there are many magnificent things in this vast world. &lt;sigh&gt; In my narrow-mindedness I nearly missed out on them."},{"name":"GRIDANIANSOLDIER02445","text":"We should have taken the time to learn more about you and where you are from. We eat meals together, we fight together, and yet because of our reluctance to speak with you, we know almost nothing about you. For that, we are sorry."},{"name":"ARAMIGOSOLDIER02445","text":"No, it is we who must apologize. While many of us consider Gridania to be a second home, there is a lot about your culture that we have yet to fully grasp..."},{"name":"GRIDANIANSOLDIER02445","text":"Hahahaha..."},{"name":"ARAMIGOSOLDIER02445","text":"Hahahaha..."},{"name":"GAIRHARD","text":"Let us raise our cups and give a toast to the start of a new and beautiful friendship."},{"name":"GAIRHARD","text":"Have you all been enjoying yourselves?"},{"name":"GRIDANIANSOLDIER02445","text":"Yes! It's been a long time since I talked so much or laughed so hard. I thought we had absolutely nothing in common, but I was mistaken."},{"name":"ARAMIGOSOLDIER02445","text":"Indeed. The more we speak, the more I come to realize how alike we are! I'm glad we've finally found a way to put our differences aside."},{"name":"GAIRHARD","text":"Good. Remember, on the battlefield it matters not where you are from, or where you were raised─only that you survive. For that, you will need to rely on each other. Never forget that."},{"name":"BEATINE","text":"Well done, the both of you. While fulfilling the clients' needs with great finesse is something I have come to expect of <span class=\"highlight\">Forename</span>, you surprised me, Cemi. That you had the same idea as one of our guild's best artisans proves you are one step closer to becoming a full-fledged carpenter."},{"name":"BEATINE","text":"Do not, however, mistake that to mean the items the two of you crafted are of a comparable quality. Even to the untrained eye, one is far superior to the other."},{"name":"BEATINE","text":"Quality, however, is not everything. Your client has walked away feeling completely satisfied, and that is a tremendous accomplishment."},{"name":"BEATINE","text":"Cemi, if you continue to work hard perhaps someday, you will come to be as good as this talented <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> beside you."},{"name":"CEMIJINJAHL","text":"Thank you, sir. I shall remember this moment and continue honing my skills that they might one day rival <span class=\"highlight\">Forename</span>'s."},{"name":"CEMIJINJAHL","text":"Gah! I nearly forgot. If I may be so bold as to ask, sir, what is to become of our guild? Will we recover from debt any time soon?"},{"name":"BEATINE","text":"...I beg your pardon? What debt?"},{"name":"BEATINE","text":"What debt? So long as we continue to receive commissions from the Order of the Twin Adder, we need not want for capital."},{"name":"CEMIJINJAHL","text":"But, sir─if not for the gil, why were you working yourself so hard? You wouldn't even stop to take meals!"},{"name":"BEATINE","text":"Ah, yes... I was temporarily overcome by a desperate need to reconnect with the wood. To achieve this, I began living as though a tree would─taking in only sunlight and water."},{"name":"CEMIJINJAHL","text":"&lt;sigh&gt; I really need to stop jumping to conclusions..."},{"name":"CEMIJINJAHL","text":"Oh, and <span class=\"highlight\">Forename</span>, please allow me to thank you once again."},{"name":"CEMIJINJAHL","text":"While it was a misunderstanding on my part that led us to the Far East, I couldn't be happier with the result. I will be eternally grateful to you for seeing me through this journey and for all that you taught me."},{"name":"CEMIJINJAHL","text":"Though this particular adventure may be over, I have no doubts we will embark upon another together in the near future."},{"name":"CEMIJINJAHL","text":"Until then, I shall continue to practice, practice, and practice some more! When you next see me, I may nearly be as good as you! Haha!"},{"name":"BEATINE","text":"<span class=\"highlight\">Forename</span>, your ability to inspire people never fails to astound me. It is in no small part thanks to you that Cemi has grown as much as she has."},{"name":"BEATINE","text":"Your talent and the love you hold for your craft is a rarity even among the elite. I hope that you will continue to use both to serve men and women all across Eorzea."},{"name":"CEMIJINJAHL","text":"What a relief the party went so well! While the tea was a smidge too hot for my liking, the cakes were sooo delicious."}],"reward":{"items":[{"id":5703},{"id":5708},{"id":5713}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":9}],"quests":[67980]}},"partials":[{"type":"npc","id":"1020901","obj":{"i":1020901,"n":"Cemi Jinjahl","l":52,"q":3}},{"type":"npc","id":"1000153","obj":{"i":1000153,"n":"Beatin","l":52,"q":25,"t":"Guildmaster"}},{"type":"npc","id":"1020911","obj":{"i":1020911,"n":"Cemi Jinjahl","l":53,"q":1}},{"type":"npc","id":"1020916","obj":{"i":1020916,"n":"Gairhard","l":52,"q":1}},{"type":"npc","id":"1020917","obj":{"i":1020917,"n":"Gridanian Soldier","l":52,"q":1}},{"type":"npc","id":"1020918","obj":{"i":1020918,"n":"Ala Mhigan Soldier","l":53,"q":1}},{"type":"npc","id":"1020919","obj":{"i":1020919,"n":"Cemi Jinjahl","l":52,"q":1}},{"type":"npc","id":"1020920","obj":{"i":1020920,"n":"Gairhard","l":53,"q":1}},{"type":"npc","id":"1020987","obj":{"i":1020987,"n":"Cemi Jinjahl","l":52,"q":2}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"17883","obj":{"i":17883,"n":"Teahouse Bench Materials","l":290,"c":22459,"t":63}},{"type":"item","id":"17884","obj":{"i":17884,"n":"Teahouse Bench","l":290,"c":52245,"t":63}},{"type":"quest","id":"67980","obj":{"i":67980,"n":"Live and Let Dine","g":136,"l":"Kugane","s":680,"f":1}}]}