{"quest":{"name":"Best Served with Cold Steel","location":"The Fringes","id":67989,"patch":4.0,"sort":80,"icon":100638,"eventIcon":71201,"issuer":1020304,"target":1020361,"involved":[1020354,1020355,1020358,1020502,1020503],"genre":6,"journal":["Raubahn knows exactly what he would like you to do.","Having resolved to carry out Vice Marshal Tarupin's plan to destroy prototype magitek weapons, General Aldynn is eager to begin at once. He bids you lie in wait for an imperial patrol near Castrum Oriens and slaughter the soldiers in order to goad the Garleans into a response.","The trap has been baited with dead imperials. Raubahn and the others are already in position, waiting for you and the prototype weapons to arrive.","The imperial officer charged with overseeing the field testing of the prototype magitek weapons is none other than Grynewaht, the brutish Roegadyn whom you faced on the Carteneau Flats. Needless to say, he is surprised to see you in Gyr Abania, but eager to seize the opportunity for revenge.","Though Grynewaht sends wave after wave of imperial soldiers and magitek against you and your comrades, it is not enough. As the smoldering wreck of his beloved weapon belches smoke into the sky, the imperial officer flees, leaving the combined force of Alliance regulars and Resistance fighters to celebrate a momentous victory.","The operation is a resounding success. Not only were the imperials humiliated and their magitek destroyed, but your allies suffered no casualties in the process. Thoroughly satisfied with this outcome, Commander Kemp and General Aldynn exchange a few words before withdrawing to their respective headquarters."],"objectives":["Lie in wait for imperial soldiers.","Rendezvous with Raubahn.","Speak with M'naago.","Defeat the imperial forces!"],"dialogue":[{"name":"ALISAIE","text":"Prototype magitek armor, eh? This may prove a challenge."},{"name":"PIPIN","text":"Fate has a way of leading one into the most unexpected alliances, does it not?"},{"name":"RAUBAHN","text":"We've been careful to avoid needless shows of force this side of the Wall. But that's all about to change─and when it does, you may be sure they'll send their new toys out to entertain us."},{"name":"RAUBAHN","text":"I <span class=\"emphasis\">would</span> ask you to participate in this operation...but from that look I see it is a foregone conclusion. My thanks."},{"name":"RAUBAHN","text":"Per Pipin's plan, we need to turn East End into an imperial graveyard. You're a dab hand at this, and I'd be a fool not to use you."},{"name":"RAUBAHN","text":"Head to this spot on your map─right here, aye. A patrol should be along shortly. Deal with them, then rendezvous with the rest of us at this location. Go well, <span class=\"highlight\">Forename</span>."},{"name":"RAUBAHN","text":"You know what to do. Be messy, be loud, and rejoin us when you've finished."},{"name":"ALISAIE","text":"My information was inaccurate, it would seem. The patrol never came..."},{"name":"PIPIN","text":"We will have Flames and Adders with us for this operation. The Maelstrom and the Temple Knights will wait in reserve at the castrum."},{"name":"RAUBAHN","text":"All went to plan, then? Good."},{"name":"RAUBAHN","text":"Our scouts report that a unit escorting the prototype weapons has left Castellum Velodyna. The Resistance is already in position, so we have but to wait for our guests to arrive."},{"name":"GRYNEWAHT","text":"He who fights and runs─ What the─? Who in the hells are you lot!?"},{"name":"MNAAGO","text":"For Ala Mhigo! Let none escape!"},{"name":"RAUBAHN","text":"Well done, all of you. I'd call this operation a resounding success."},{"name":"CONRAD","text":"Can't say I'm surprised. The “Bull of Ala Mhigo” had an impressive military record before he went west, as I recall."},{"name":"RAUBAHN","text":"Credit where it's due, Master Kemp. 'Twas Marshal Tarupin who made this plan, and all of you, Resistance and Alliance alike, who carried it out to perfection."},{"name":"CONRAD","text":"Aye, that they did. Not a single casualty, for which I'm grateful beyond words. I've no doubt our comrades back at the Reach will feel the same."},{"name":"RAUBAHN","text":"As will ours."},{"name":"CONRAD","text":"It's been a pleasure, General. Until the next battle.<br>M'naago─I leave the Scions in your care."},{"name":"RAUBAHN","text":"We shall return to the castrum, then. <span class=\"highlight\">Forename</span>, Mistress Leveilleur─once more you have my thanks. As Master Kemp said, until the next battle."},{"name":"ALISAIE","text":"That brute of an imperial officer was a force to be reckoned with, wasn't he? A fool, mayhap, but he held his own against the Flame General..."},{"name":"MNAAGO","text":"I'd heard the stories, but to actually see you in action... I almost found myself pitying the imperials. Seriously, though─it was inspirational."},{"name":"MNAAGO","text":"Ah, but you must be tired of hearing that, eh? I'll keep it simple, then─thanks for the help out there!"},{"name":"RAUBAHN","text":"'Twas a good battle, and we have much to show for it. Pipin should be proud─I know I am."},{"name":"PIPIN","text":"We couldn't have done it without you. Thank you, <span class=\"highlight\">Forename</span>. Thank you."},{"name":"RAUBAHN","text":"Adders, Flames, deal with the escort! Leave the armor to <span class=\"highlight\">Forename</span>!"},{"name":"GRYNEWAHT","text":"Bugger me! Is that General Aldynn!? Bwahahaha! A chance to get my revenge on <span class=\"highlight\">Forename</span>, and test our new weapons, <span class=\"emphasis\">and</span> kill an Alliance commander! Ohhh, it doesn't get much better than this!"},{"name":"ALISAIE","text":"One would almost think he harbored a grudge against you, <span class=\"highlight\">Forename</span>. Whatever did you do to him?"},{"name":"GRYNEWAHT","text":"Hurry up and KILL THE BASTARDS! We've got 'em outnumbered!"},{"name":"GRYNEWAHT","text":"What are you idiots doing? Give them everything we've got!"},{"name":"ALISAIE","text":"There's no end to them... I'm here if you need healing, <span class=\"highlight\">Forename</span>!"},{"name":"RAUBAHN","text":"Looks like there's only the one prototype. Whatever else we do this day, I want it destroyed!"},{"name":"GRYNEWAHT","text":"Enough! We have secret weapons of great power, don't we? Let's bloody well use 'em!"},{"name":"ALISAIE","text":"On your guard, <span class=\"highlight\">Forename</span>! He's up to something!"},{"name":"RAUBAHN","text":"Keep it up, lads! That thing won't take much more!"},{"name":"GRYNEWAHT","text":"Damn it all! Haven't we got anything else!? More armor or weapons or something!?"},{"name":"RAUBAHN","text":"More of them!? I'm going to have to have a word with our scouts..."},{"name":"GRYNEWAHT","text":"This can't be happening! Not again!"},{"name":"RAUBAHN","text":"We have them now! Forward! Forward!"},{"name":"GRYNEWAHT","text":"You think you've won, eh? Heh heh heh... THEN WE GO TOGETHER!"},{"name":"MAGITEKVANGUARD","text":"Self-destruct sequence initiated... Sixty... Fifty-nine... Fifty-eight..."},{"name":"RAUBAHN","text":"Seven hells! There's no time to get to safety! We must disable it before it blows!"},{"name":"MAGITEKVANGUARD","text":"Thirty... Twenty-nine... Twenty-eight..."},{"name":"MAGITEKVANGUARD","text":"Fifteen... Fourteen... Thirteen..."},{"name":"MAGITEKVANGUARD","text":"Initiating self-destruct in:<br>Five... Four... Three... Two... One..."},{"name":"GRYNEWAHT","text":"No... No, no, NO! My secret weapon!"},{"name":"ALISAIE","text":"This...cannot be..."},{"name":"RAUBAHN","text":"That's that, then..."}],"reward":{"gil":1883,"items":[{"id":18033,"one":1,"hq":1},{"id":18035,"one":1,"hq":1},{"id":18039,"one":1,"hq":1},{"id":18046,"one":1,"hq":1},{"num":3,"id":5723,"one":1}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67988]},"next":[67990]},"partials":[{"type":"npc","id":"1020304","obj":{"i":1020304,"n":"Raubahn","l":2406,"q":9}},{"type":"npc","id":"1020361","obj":{"i":1020361,"n":"M'naago","l":2406,"q":2}},{"type":"npc","id":"1020354","obj":{"i":1020354,"n":"Pipin","l":2406,"q":9}},{"type":"npc","id":"1020355","obj":{"i":1020355,"n":"Alisaie","l":2406,"q":1}},{"type":"npc","id":"1020358","obj":{"i":1020358,"n":"Alisaie","l":2406,"q":2}},{"type":"npc","id":"1020502","obj":{"i":1020502,"n":"Alisaie","l":2406,"q":1}},{"type":"npc","id":"1020503","obj":{"i":1020503,"n":"Raubahn","l":2406,"q":1}},{"type":"item","id":"18033","obj":{"i":18033,"n":"High Steel Katzbalger","l":255,"c":30559,"t":2,"p":24235}},{"type":"item","id":"18035","obj":{"i":18035,"n":"High Steel Headsman's Axe","l":255,"c":31548,"t":3,"p":36352}},{"type":"item","id":"18039","obj":{"i":18039,"n":"High Steel Guillotine","l":255,"c":34286,"t":87,"p":36352}},{"type":"item","id":"18046","obj":{"i":18046,"n":"High Steel Tachi","l":255,"c":36435,"t":96,"p":36352}},{"type":"item","id":"5723","obj":{"i":5723,"n":"Quicktongue Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"67988","obj":{"i":67988,"n":"Signed, Sealed, to Be Delivered","g":6,"l":"The Fringes","s":70}},{"type":"quest","id":"67990","obj":{"i":67990,"n":"Let Fill Your Hearts with Pride","g":6,"l":"The Fringes","s":90}}]}