{"quest":{"name":"Where Men Go as One","location":"Rhalgr's Reach","id":67997,"patch":4.0,"sort":160,"icon":100641,"eventIcon":71201,"issuer":1019466,"target":1020390,"involved":[1020332,1020333,1020334,1020338,1020342,1020343,1020348,1020388,1020391],"genre":6,"journal":["Conrad wishes to thank you for all you have done in such a short time.","In the midst of your meeting with Commander Kemp, Alphinaud arrives with several other Scions of the Seventh Dawn who have apparently expressed a desire to fight for the Ala Mhigan Resistance, including one Arenvald Lentinus, whom you recall from your first days in the Waking Sands. Conrad welcomes his new allies warmly, and states that when the other new recruits have received sufficient training, he will propose a joint assault on Castellum Velodyna to General Aldynn.","M'naago, like many of the Resistance, is grateful for your assistance thus far. However, there is no shortage of work to be done, and she and the others should be glad if you were to help hasten the completion of their preparations."],"objectives":["Speak with M'naago."],"dialogue":[{"name":"YSHTOLA","text":"I am told you have been busy. As have we, lest you wonder. None here shall perish for want of proper treatment."},{"name":"KRILE","text":"Been to the Peaks and back, have you? Glad to see you're in good health."},{"name":"CONRAD","text":"Owing to the efforts of you all, we have accomplished a great deal in a short time. The Resistance thanks you for your service, Scions."},{"name":"ALPHINAUD","text":"I see operations here have been proceeding apace in my absence."},{"name":"ALISAIE","text":"Welcome back, Brother dearest. I take it your efforts to gather new recruits were successful."},{"name":"ALPHINAUD","text":"Indeed. There were several amongst the Scions' ranks that were quite eager to take part in our joint endeavor with the Resistance, whom I am come to present."},{"name":"ARENVALD","text":"Commander Kemp, if I may! My name...my name is Arenvald Lentinus. A...a half-breed, as you can doubtless tell."},{"name":"ARENVALD","text":"I'm here to fight for a free Ala Mhigo. For an Ala Mhigo where women like my mother are never made to suffer. I pray you grant me this honor."},{"name":"CONRAD","text":"...You are a trueborn son of Gyr Abania, same as me. This is not my honor to grant, but yours to freely take. Welcome, brother."},{"name":"CONRAD","text":"With our swelling ranks, and the aid of the Eorzean Alliance and the Scions of the Seventh Dawn, I believe we will soon be in a position to seize the initiative."},{"name":"CONRAD","text":"Once our new recruits have received sufficient training, I will propose to General Aldynn that we draw up plans for an assault on Castellum Velodyna."},{"name":"MNAAGO","text":"Then, in the meantime, we will make what preparations we can!"},{"name":"CONRAD","text":"I feared it would take longer to rouse the people to action after the disaster at the Wall, but it seems our countrymen are not so easily discouraged. Change is on the horizon, my friends."},{"name":"MEFFRID","text":"We won't have much time to train the new recruits, but we'll make the most of it. The Resistance will need every able-bodied man and woman in the field if we're going to take Velodyna."},{"name":"LYSE","text":"It's all happening so fast... Isn't it exciting!?"},{"name":"ALPHINAUD","text":"Arenvald is not much older than I am. We would often chat about this and that whenever I paid a visit to the Waking Sands. I knew he had strong feelings about Ala Mhigo and the occupation, but mayhap I underestimated his passion..."},{"name":"ALISAIE","text":"M'naago did well to spread word of our victory in East End. Hardly a day goes by without some would-be recruit arriving, inspired by the tale."},{"name":"ARENVALD","text":"For a long time, I struggled to make sense of that day at the Waking Sands. Why I survived when A'aba and Aulie didn't. Not anymore."},{"name":"JMOLDVA","text":"Long ago did I resolve never again to take up sword or spear─at first for sport, and then entirely. But a chance encounter with young Arenvald served to remind me that not all battles are as empty as those fought upon the bloodsands."},{"name":"VMAHTIA","text":"Alphinaud asked for volunteers, so here I am. First Ishgard, now Ala Mhigo, eh? No rest for the righteous!"},{"name":"MNAAGO","text":"Right, then. I've got duties to attend to."},{"name":"ALPHINAUD","text":"Mayhap we could assist you with said duties? We are here to help, after all."},{"name":"ALPHINAUD","text":"The three of you have been busy, so I will understand if you require time to rest. If <span class=\"emphasis\">not</span>, however, it would seem sensible to assist our allies with their preparations."},{"name":"MNAAGO","text":"We'd be grateful for any and all help you can offer. If you ask around, I guarantee you won't want for work."},{"name":"SONGGARLEANEMPIRE","text":"Meanwhile, in the Royal Palace of Ala Mhigo..."},{"name":"SONGGARLEANEMPIRE","text":"Beyond majestic mountains, across the emerald dale,"},{"name":"SONGGARLEANEMPIRE","text":"On march the ivory standard, united we prevail"},{"name":"SONGGARLEANEMPIRE","text":"From distant shores of Othard, to lakes of Aldenard,"},{"name":"SONGGARLEANEMPIRE","text":"The light of mighty Garlemald, fore'er our guiding star"}],"reward":{"gil":778,"items":[{"id":18091,"one":1,"hq":1},{"id":18092,"one":1,"hq":1},{"id":18093,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":142}],"questsType":"all","quests":[67990,67996]},"next":[68171,68172,68173]},"partials":[{"type":"npc","id":"1019466","obj":{"i":1019466,"n":"Conrad","l":2403,"q":4}},{"type":"npc","id":"1020390","obj":{"i":1020390,"n":"M'naago","l":2403,"q":2}},{"type":"npc","id":"1020332","obj":{"i":1020332,"n":"Alphinaud","l":2403,"q":4}},{"type":"npc","id":"1020333","obj":{"i":1020333,"n":"Alisaie","l":2403,"q":2}},{"type":"npc","id":"1020334","obj":{"i":1020334,"n":"Lyse","l":2403,"q":3}},{"type":"npc","id":"1020338","obj":{"i":1020338,"n":"Meffrid","l":2403,"q":5}},{"type":"npc","id":"1020342","obj":{"i":1020342,"n":"Y'shtola","l":2403,"q":3}},{"type":"npc","id":"1020343","obj":{"i":1020343,"n":"Krile","l":2403,"q":3}},{"type":"npc","id":"1020348","obj":{"i":1020348,"n":"V'mah Tia","l":2403,"q":1}},{"type":"npc","id":"1020388","obj":{"i":1020388,"n":"J'moldva","l":2403,"q":1}},{"type":"npc","id":"1020391","obj":{"i":1020391,"n":"Arenvald","l":2403,"q":2}},{"type":"item","id":"18091","obj":{"i":18091,"n":"Triphane Earrings of Fending","l":255,"c":55211,"t":41,"p":15147}},{"type":"item","id":"18092","obj":{"i":18092,"n":"Triphane Earrings of Slaying","l":255,"c":55211,"t":41,"p":15147}},{"type":"item","id":"18093","obj":{"i":18093,"n":"Triphane Earrings of Aiming","l":255,"c":55211,"t":41,"p":15147}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"67990","obj":{"i":67990,"n":"Let Fill Your Hearts with Pride","g":6,"l":"The Fringes","s":90}},{"type":"quest","id":"67996","obj":{"i":67996,"n":"Homeward Bound","g":6,"l":"The Peaks","s":150}},{"type":"quest","id":"68171","obj":{"i":68171,"n":"Future Rust, Future Dust","g":6,"l":"Rhalgr's Reach","s":161}},{"type":"quest","id":"68172","obj":{"i":68172,"n":"A Dash of Green","g":6,"l":"Rhalgr's Reach","s":162}},{"type":"quest","id":"68173","obj":{"i":68173,"n":"Ye Wayward Brothers","g":6,"l":"Rhalgr's Reach","s":163}}]}