{"quest":{"name":"Homeward Bound","location":"The Peaks","id":67996,"patch":4.0,"sort":150,"eventIcon":71201,"issuer":1020387,"target":1020338,"involved":[1020372,1020386,1020511,1020512,1020841],"genre":6,"journal":["Meffrid has no wish to linger unnecessarily."],"objectives":["Speak with Raganfrid.","Speak with Meffrid.","Search for Lyse.","Speak with Meffrid at Rhalgr's Reach."],"dialogue":[{"name":"LYSE","text":"We...we could've done something, instead of just...of just letting it happen..."},{"name":"MEFFRID","text":"Wercrata's alive, and the tributum's been paid. That's all that matters for now."},{"name":"MEFFRID","text":"I for one would rather not wait around to see if the Skulls decide to return. We'd best get back to Ala Gannha and tell Raganfrid his man got the job done."},{"name":"RAGANFRID","text":"We owe you a debt of gratitude for what you did. Wercrata told me everything─how you fought with the Qiqirn and saved his life."},{"name":"LYSE","text":"For all the good it did. We saw what happened when he met with the Skulls. How they beat him half to death. We could've stopped them."},{"name":"RAGANFRID","text":"Aye, I reckon you could. Meffrid's a warrior, as is your comrade. And you're strong, like your father. That much is plain."},{"name":"RAGANFRID","text":"But I thank Rhalgr you did not, because it would not have ended with them. Wercrata and his sister would've been branded insurgents, if not the whole lot of us."},{"name":"RAGANFRID","text":"Bones heal, scars fade, but the dead remain dead. We're alive, and that's more than can be said for only the gods know how many others."},{"name":"LYSE","text":"That's enough for you, is it? To put up with whatever they do to you, so long as you get to see another day?"},{"name":"RAGANFRID","text":"That's right. You grit your teeth and you learn to live with the pain."},{"name":"RAGANFRID","text":"I'll admit I was quick to judge you, Lyse, and for that I apologize. I know you and yours mean well, I do. But I'm telling you, gods in the heavens as my witness, that we've got nothing left to give. We can't help you."},{"name":"LYSE","text":"...I understand. Thank you for your honesty."},{"name":"RAGANFRID","text":"She may say it, but she doesn't mean it. Nor would I expect her to─her father was stubborn as an ox too. If she's set on walking the same path, I but pray she won't follow it to the same end..."},{"name":"RAGANFRID","text":"I knew Curtis when he was younger. Golden locks and piercing blue eyes. When I finally looked into hers, I saw at once she was his."},{"name":"MEFFRID","text":"Well. She took it better than I anticipated. Which isn't saying much, I suppose."},{"name":"MEFFRID","text":"We should go and see if she's all right."},{"name":"MEFFRID","text":"Ah, there's our stray. Hmm... Mayhap you should take the lead in this, <span class=\"highlight\">Forename</span>."},{"name":"LYSE","text":"...Sorry about running off like that."},{"name":"LYSE","text":"Ala Mhigans terrorizing their own...? I just can't accept it, you know? No matter what he thinks, they shouldn't have to put up with it, day after day after day..."},{"name":"LYSE","text":"I'm not <span class=\"emphasis\">completely</span> naive, you know. I didn't expect them to “storm a castrum with their pickaxes and shovels,” or whatever it was. But nor did I expect Wercrata to just lie there in the dirt while they kicked him."},{"name":"LYSE","text":"I can't claim to know their pain. I barely remember this place or...or even my father's face."},{"name":"LYSE","text":"But I remember Yda's. I remember how scared she was when we ran...and that look in her eyes when she talked about home."},{"name":"LYSE","text":"Her home...but not mine, is it?"},{"name":"WISCAR","text":"There you are, Lyse. I've been looking all over for you..."},{"name":"LYSE","text":"Well...you've found me. Got something else to say?"},{"name":"WISCAR","text":"Aye, that I do... I, um... I said some things to you before that I shouldn't've. 'Twasn't my place to do so, and I'm sorry."},{"name":"WISCAR","text":"All that rubbish I spouted about how I loved my village...but when one of ours was in need, I was cowering here with all the others. I didn't even think to go after Wercrata...but you did."},{"name":"WISCAR","text":"Made me feel like...like the bloody hypocrite I am!"},{"name":"WISCAR","text":"If I truly cared for my people, I'd fight for them. So I will...if you'll have me."},{"name":"LYSE","text":"...You're asking to join the Resistance?"},{"name":"WISCAR","text":"When you put it like that, I, uh...I suppose I am. But not just me─there are others I know who've been thinking about it for a while now. There's not many of us, and we're not hardened warriors like you lot, but─"},{"name":"MEFFRID","text":"If your heart bleeds for Ala Mhigo, then that's good enough for me. You and yours are more than welcome at Rhalgr's Reach."},{"name":"WISCAR","text":"Thank you, sir! You won't regret this! I'll go and speak with the others and send word when we're ready!"},{"name":"MEFFRID","text":"...Still think this isn't your home?"},{"name":"LYSE","text":"N-No, I...I was just...thinking out loud..."},{"name":"MEFFRID","text":"And with that, my friends, our mission is concluded. Let us return to the Reach."},{"name":"MEFFRID","text":"First of all, allow me to commend you both on a job well done."},{"name":"MEFFRID","text":"Though nothing went according to plan, we nevertheless managed to attract some new recruits. And it was your passion and conviction that moved them to join. Thank you."},{"name":"LYSE","text":"No, thank <span class=\"emphasis\">you</span>─for giving me an opportunity to find out what our people have been through these past twenty years. It's been...humbling."},{"name":"LYSE","text":"And troubling, too. I'd heard about the Skulls, but that was the first time I'd seen them in the flesh."},{"name":"LYSE","text":"I know you say they're the same as any other imperial soldiers─and maybe that's how I'll have to think of them myself if our paths ever cross on the battlefield, but─"},{"name":"MEFFRID","text":"<span class=\"emphasis\">When</span>, not if. That day will come, Lyse. You can't afford to hesitate when it does."},{"name":"MEFFRID","text":"Young, old, conscript, citizen, Garlean, Ala Mhigan─none of that matters. They've all got their reasons. But they're no better than yours, especially when they're bearing down on you, blade in hand."},{"name":"MEFFRID","text":"...Saying that, I don't want to kill them any more than you do. If I could convince them to lay down their arms, I would. Sadly, I've never been much of a talker myself, but who knows, maybe you could be one, Lyse. Your father certainly was."},{"name":"MEFFRID","text":"Right, then. I'd best begin preparing for these new recruits. <span class=\"highlight\">Forename</span>, Lyse, it's been a pleasure."}],"reward":{"gil":1000,"items":[{"id":18041,"one":1,"hq":1},{"id":18044,"one":1,"hq":1},{"id":18045,"one":1,"hq":1},{"id":18047,"one":1,"hq":1},{"num":3,"id":5683,"one":1}],"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67995]},"next":[67997]},"partials":[{"type":"npc","id":"1020387","obj":{"i":1020387,"n":"Meffrid","l":2407,"q":2}},{"type":"npc","id":"1020338","obj":{"i":1020338,"n":"Meffrid","l":2403,"q":5}},{"type":"npc","id":"1020372","obj":{"i":1020372,"n":"Meffrid","l":2407,"q":4}},{"type":"npc","id":"1020386","obj":{"i":1020386,"n":"Lyse","l":2407,"q":2}},{"type":"npc","id":"1020511","obj":{"i":1020511,"n":"Meffrid","l":2407,"q":1}},{"type":"npc","id":"1020512","obj":{"i":1020512,"n":"Lyse","l":2407,"q":1}},{"type":"npc","id":"1020841","obj":{"i":1020841,"n":"Raganfrid","l":2407,"q":3}},{"type":"item","id":"18041","obj":{"i":18041,"n":"Beech Rod","l":255,"c":32707,"t":9,"p":36352}},{"type":"item","id":"18044","obj":{"i":18044,"n":"Koppranickel Codex","l":255,"c":33234,"t":98,"p":36352}},{"type":"item","id":"18045","obj":{"i":18045,"n":"Koppranickel Planisphere","l":255,"c":34884,"t":89,"p":36352}},{"type":"item","id":"18047","obj":{"i":18047,"n":"Koppranickel Foil","l":255,"c":36755,"t":97,"p":36352}},{"type":"item","id":"5683","obj":{"i":5683,"n":"Battledance Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Tenacity","category":0}}},{"type":"quest","id":"67995","obj":{"i":67995,"n":"The Black Wolf's Pups","g":6,"l":"The Peaks","s":140}},{"type":"quest","id":"67997","obj":{"i":67997,"n":"Where Men Go as One","g":6,"l":"Rhalgr's Reach","s":160}}]}