{"quest":{"name":"Crossing the Velodyna","location":"Rhalgr's Reach","id":67998,"patch":4.0,"sort":170,"eventIcon":71201,"issuer":1020332,"target":1020526,"involved":[1020304,1020324,1020325,1020342,1020343,1020354,1020392,1020393,1020395,1020525],"genre":6,"journal":["Alphinaud has been making himself useful to the Resistance..."],"objectives":["Speak with Y'shtola.","Speak with Alphinaud.","Speak with Raubahn at Castrum Oriens.","Speak with Alisaie."],"dialogue":[{"name":"ALPHINAUD","text":"And with that, another task is complete...<br>Ah, <span class=\"highlight\">Forename</span>. I hear you have been keeping busy."},{"name":"MNAAGO","text":"Aye, that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has, and we thank <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> for it."},{"name":"CONRAD","text":"It pleases me to inform you that our new recruits have completed their initial training and stand ready to contribute."},{"name":"CONRAD","text":"As discussed, M'naago, I would have you present my proposal for an assault on Castellum Velodyna to General Aldynn personally."},{"name":"MNAAGO","text":"Of course, sir!"},{"name":"MNAAGO","text":"Are you and yours planning to return to Castrum Oriens before the operation? If so, why don't we travel together?"},{"name":"ALPHINAUD","text":"That seems a fine suggestion, but I must consult my comrades ere we depart."},{"name":"MNAAGO","text":"Very well. I will wait for you at the pass. But not too long!"},{"name":"ALPHINAUD","text":"I expect Krile and Y'shtola will wish to remain here to support the chirurgeons, but nevertheless, we should go and ask them."},{"name":"YSHTOLA","text":"Hm? Is aught amiss?"},{"name":"YSHTOLA","text":"...I see. That would explain the sudden flurry of activity outside."},{"name":"ALPHINAUD","text":"This joint operation marks a turning point in our conflict with the Garleans. For the first time, the Resistance and the Alliance shall go on the offensive and attempt to capture an imperial outpost in occupied territory."},{"name":"ALPHINAUD","text":"Personally, I believe it is imperative that we offer them our full support. As was the case with Ishgard, however, this is not a choice to be made lightly, nor less on others' behalves. This is war, and every Scion must decide what part he or she would play."},{"name":"LYSE","text":"I'll fight. For Ala Mhigo, for my father, for Yda. I'm in it to the end."},{"name":"ALISAIE","text":"The choice was made for us ere we were born, Brother, when the Empire marched on Eorzea."},{"name":"ALISAIE","text":"They will stop at nothing to subjugate or slaughter us all. Van Baelsar and van Darnus were but the first to try."},{"name":"ALPHINAUD","text":"...Though your fervor is surprising, I cannot dispute your logic."},{"name":"ALPHINAUD","text":"At the risk of repeating myself, I am of course of the same mind. The present situation is untenable, and further complicated by the existence of Ilberd's primal. I believe we have no recourse but to directly and openly intervene."},{"name":"YSHTOLA","text":"...I thought this a foregone conclusion given our actions thus far, but if you require renewed affirmation, then yes, I am still wholly committed to this cause. For it is ultimately the selfsame cause I have served since first I pledged to serve Master Louisoix and the Circle of Knowing: the salvation of Eorzea, by any means necessary."},{"name":"YSHTOLA","text":"That said, I shall refrain from taking the field on this occasion. There are many here who require further treatment, and doubtless more to come after."},{"name":"KRILE","text":"I came here for Minfilia, and that hasn't changed. However, I'd like to stay with Y'shtola for now and tend to the wounded."},{"name":"ALPHINAUD","text":"As for you, <span class=\"highlight\">Forename</span>...you are, to quote our dear friend Lord Edmont, the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who <span class=\"alternative-container\"><span class=\"alternative\">bested two imperial legatuses</span><span class=\"alternative\">slew Gaius van Baelsar</span></span> and some half-dozen primals besides. Your presence may well prove the difference between victory and defeat."},{"name":"ALPHINAUD","text":"Many look to you as a hero, and heap great expectations upon your shoulders. But you, like every Scion, must decide for yourself."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll fight. The Empire poses too great a threat."},{"name":"A1","text":"We can but carry on. For those we have lost. For those we can yet save."},{"name":"A1","text":"As long as there's a battle to be fought, I'll be there!"},{"name":"A1","text":"To be frank, Alphy, this isn't my fight. But I will do what I must."},{"name":"ALPHINAUD","text":"Indeed. As you have doubtless seen during your time in the outlying villages, their so-called “meritocracy” is but a pretext to torture and enslave their “lesser” subjects. Such is the fate that awaits us all should their expansion continue unchecked."},{"name":"ALPHINAUD","text":"Well said. Well said indeed..."},{"name":"ALPHINAUD","text":"Hah! Ever the adventurer! You live for these moments, do you not?"},{"name":"ALPHINAUD","text":"...I see. While it pains me to hear you speak thus, I am grateful for your candor. There was a time when you would have kept such thoughts to yourself."},{"name":"ALISAIE","text":"Take care, Y'shtola, Krile, and do not hesitate to contact us should you require assistance. Lyse─I would ask that you remain here, by Conrad's side."},{"name":"ALISAIE","text":"We should go, or M'naago will leave without us."},{"name":"ALPHINAUD","text":"Might I persuade you to join us, <span class=\"highlight\">Forename</span>? Should you wish to give your decision further consideration, Castrum Oriens would seem an apt place to do it. You need not answer right away. I am sure I can convince M'naago to wait a little longer."},{"name":"YSHTOLA","text":"Ah yes, asking everyone's opinion before making a critical decision. Truly, this is a far better arrangement than having centralized leadership."},{"name":"KRILE","text":"We'll have our work cut out for us after the operation, I fear, but we'll do what we can. That's all any of us can do, is it not?"},{"name":"ALISAIE","text":"Grandfather stood with the army that faced the Garleans at Carteneau. This is dangerously close to becoming a family tradition..."},{"name":"MNAAGO","text":"Best make sure you've got everything you need! We might not be coming back for a while."},{"name":"ALPHINAUD","text":"So you will be accompanying us? Full glad am I to hear it."},{"name":"MNAAGO","text":"All set? Excellent. Then let us be off!"},{"name":"STORMOFFICER","text":"Greetings and well met, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>. I have been dispatched from Limsa Lominsa to command the Maelstrom forces here."},{"name":"STORMOFFICER","text":"This campaign has taken us quite far from the shores of Vylbrand. Though the logistics of a prolonged deployment have been the source of much consternation, I prefer to view it as an opportunity to strengthen ties with our allies, and to study their methods."},{"name":"SERPENTOFFICER","text":"A pleasure to meet you, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>. I oversee Adder operations here in the Elder Seedseer's stead."},{"name":"SERPENTOFFICER","text":"Rest assured that our scouts were handpicked from the elite ranks of the Gods' Quiver and the Wood Wailers. If the imperials take so much as one step into East End, we will know."},{"name":"PIPIN","text":"I hear that Rhalgr's Reach is overrun with new recruits. Did I not tell you that we needed only to inspire the people to rise up once more?"},{"name":"RAUBAHN","text":"Welcome back, comrades. What news?"},{"name":"MNAAGO","text":"Greetings, General. I am come at Commander Kemp's behest to brief you on the latest developments at the Reach."},{"name":"MNAAGO","text":"Our recruitment efforts have exceeded expectations. In addition to welcoming many motivated young Ala Mhigans, our ranks have been bolstered by the arrival of a number of experienced veterans, thanks in large part to the efforts of the Scions."},{"name":"MNAAGO","text":"As a consequence, we are now able to field half a dozen new units, with more being trained as we speak."},{"name":"RAUBAHN","text":"Good. I gather Conrad is eager to strike while the iron's hot?"},{"name":"MNAAGO","text":"Just so, General. He proposes that we begin preparations for a joint operation to capture Castellum Velodyna."},{"name":"PIPIN","text":"Capture Velodyna? That will not be easy. It will, however, be necessary if we are ever to push east towards the capital..."},{"name":"RAUBAHN","text":"There is no profit in delay. It is only a matter of time before the Garleans learn of our plans and summon reinforcements."},{"name":"RAUBAHN","text":"The Alliance hereby accepts Commander Kemp's proposal. Tell him to take no chances─bring every able-bodied Ala Mhigan who can wield a weapon."},{"name":"RAUBAHN","text":"Pipin─I want Velodyna watched. Assess its defenses. Every fortress has a weakness, and I would know this one's."},{"name":"ALISAIE","text":"If there is no objection, General, might the Scions join Marshal Tarupin?"},{"name":"RAUBAHN","text":"By all means.<br>If that is all─let us be about it!"},{"name":"STORMOFFICER","text":"For an operation of this import, we cannot afford to hold too many in reserve. Surely the Maelstrom must take part in this assault!"},{"name":"SERPENTOFFICER","text":"This will be our largest engagement yet. Our conjurers will do their utmost to provide support, but we must be prepared to suffer significant casualties."},{"name":"PIPIN","text":"An accurate assessment of their strengths and weaknesses will be key to our success. Measure twice, cut once, as the Gridanian carpenters are so fond of saying."},{"name":"RAUBAHN","text":"Taking Velodyna will be the first significant step toward wresting Ala Mhigo from the Empire's grasp─but make no mistake: there will be many more such steps, each one taken at a cost."},{"name":"ALPHINAUD","text":"A castellum is less a military installation and more a supply depot─a storage and distribution facility for the surrounding area. That being the case, taking it will not only earn us a strategic foothold, but deprive our enemy of valuable resources."},{"name":"ALISAIE","text":"Conrad and the General are of one mind, it seems... I only wish I could say the same. While this aggressive strategy may well profit us in the end, what losses will we suffer in the meantime...?"},{"name":"ALISAIE","text":"Anyway, we should speak with the vice marshal about this reconnaissance mission and see how he would like to proceed."}],"reward":{"gil":589,"items":[{"id":18094,"one":1,"hq":1},{"id":18095,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":175500},"reqs":{"jobs":[{"lvl":61,"id":142}],"quests":[68174]},"next":[67999]},"partials":[{"type":"npc","id":"1020332","obj":{"i":1020332,"n":"Alphinaud","l":2403,"q":4}},{"type":"npc","id":"1020526","obj":{"i":1020526,"n":"Alisaie","l":2406,"q":6}},{"type":"npc","id":"1020304","obj":{"i":1020304,"n":"Raubahn","l":2406,"q":9}},{"type":"npc","id":"1020324","obj":{"i":1020324,"n":"Alphinaud","l":2403,"q":3}},{"type":"npc","id":"1020325","obj":{"i":1020325,"n":"Alisaie","l":2403,"q":4}},{"type":"npc","id":"1020342","obj":{"i":1020342,"n":"Y'shtola","l":2403,"q":3}},{"type":"npc","id":"1020343","obj":{"i":1020343,"n":"Krile","l":2403,"q":3}},{"type":"npc","id":"1020354","obj":{"i":1020354,"n":"Pipin","l":2406,"q":9}},{"type":"npc","id":"1020392","obj":{"i":1020392,"n":"Serpent Officer","l":2406,"q":6}},{"type":"npc","id":"1020393","obj":{"i":1020393,"n":"Storm Officer","l":2406,"q":6}},{"type":"npc","id":"1020395","obj":{"i":1020395,"n":"M'naago","l":2403,"q":2}},{"type":"npc","id":"1020525","obj":{"i":1020525,"n":"Alphinaud","l":2406,"q":6}},{"type":"item","id":"18094","obj":{"i":18094,"n":"Triphane Earrings of Healing","l":255,"c":55211,"t":41,"p":15147}},{"type":"item","id":"18095","obj":{"i":18095,"n":"Triphane Earrings of Casting","l":255,"c":55211,"t":41,"p":15147}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68174","obj":{"i":68174,"n":"Token of Faith","g":6,"l":"Rhalgr's Reach","s":164}},{"type":"quest","id":"67999","obj":{"i":67999,"n":"In Crimson It Began","g":6,"l":"The Fringes","s":180}}]}