{"quest":{"name":"In Crimson It Began","location":"The Fringes","id":67999,"patch":4.0,"sort":180,"icon":100642,"eventIcon":71201,"issuer":1020354,"target":1020400,"involved":[1019471,1019472,1019476,1019477,1019479,1019481,1019483,1019484,1019486,1019488,1019489,1019490,1020190,1020304,1020392,1020393,1020397,1020398,1020399,1020411,1020412,1020414,1020415,1020416,1020417,1020419,1020420,1020525,1020526],"genre":6,"journal":["Pipin is looking forward to the assault on Castellum Velodyna.","Mindful that intelligence is the key to any successful operation, Pipin would have you, Alphinaud, and Alisaie accompany him on a reconnaissance mission. Your destination is a cliff to the north of Castellum Velodyna, which should afford you an excellent view of the imperial installation.","Your mission is interrupted by the sound of cannon fire from the east. You turn to see a column of smoke on the horizon...rising from <span class=\"emphasis\">Rhalgr's Reach</span>, you realize, with dawning horror. Alphinaud's attempts to contact your comrades via linkpearl are unsuccessful, all but confirming your suspicions that a coordinated attack is underway. With no other recourse, you abort your mission and race back to the Resistance stronghold.<br><br>Outside Rhalgr's Reach, you encounter a number of fleeing Resistance fighters, as well as Krile and Arenvald. They tell you of the chaos within the valley, of imperial soldiers cutting people down left and right, and of a last desperate stand by Conrad and the others. His face grim, Alphinaud declares your place is in the Reach, and so, joined by Krile, you press on into the bloodbath.","Aided by your comrades, you manage to beat back the imperial forces and reach your comrades. Lyse is unharmed, and Conrad merely unconscious, but Y'shtola is on the verge of death, her lifeblood pooling beneath her prostrate form. You turn to confront the man who dealt the blow: Zenos yae Galvus, the imperial viceroy himself. Lamenting the disappointment that was your comrades' performance, he raises his blade and bids you entertain him.<br><br>Though you endure Zenos's onslaught far longer than Pipin and Alisaie, even you are no match for him. With a flourish, the viceroy sends you flying─the only testament to your resilience the broken blade he flings to the earth as he turns his back on you and walks away. Raubahn and his Immortal Flames soon arrive, but he has seen enough death for one day, and orders his men to let the imperials withdraw and instead attend to the wounded.","After taking in the carnage in silence, Raubahn reminds you that your actions saved lives, and that you should remember that, no matter what happens. Yet having come face-to-face with the crown prince himself, having seen the superhuman feats of which he is capable, you know exactly what it is that you will remember..."],"objectives":["Speak with Pipin.","Speak with Raubahn.","Aid the Resistance and find your comrades!","Defeat Zenos yae Galvus!"],"dialogue":[{"name":"STORMOFFICER","text":"For an operation of this import, we cannot afford to hold too many in reserve. Surely the Maelstrom must take part in this assault!"},{"name":"SERPENTOFFICER","text":"This will be our largest engagement yet. Our conjurers will do their utmost to provide support, but we must be prepared to suffer significant casualties."},{"name":"ALISAIE","text":"So Marshal Tarupin means to lead the reconnaissance mission himself, does he?"},{"name":"RAUBAHN","text":"Taking Velodyna will be the first significant step toward wresting Ala Mhigo from the Empire's grasp─but make no mistake: there will be many more such steps, each one taken at a cost."},{"name":"ALPHINAUD","text":"A castellum is less a military installation and more a supply depot─a storage and distribution facility for the surrounding area. That being the case, taking it will not only earn us a strategic foothold, but deprive our enemy of valuable resources."},{"name":"PIPIN","text":"Thank you for volunteering to join me. This should be a fairly straightforward reconnaissance mission, so long as we do not have the ill fortune to run afoul of an imperial patrol."},{"name":"PIPIN","text":"Come─our destination is beyond East End, just north of Velodyna."},{"name":"ALISAIE","text":"Naught appears out of the ordinary at a glance..."},{"name":"ALPHINAUD","text":"Even should they be unaware of our plans, I would be surprised if their western defenses were not heavily fortified, given the presence of Allied forces at the Wall."},{"name":"PIPIN","text":"This ought to be close enough. Now we settle in for a long watch."},{"name":"PIPIN","text":"That said...it would be prudent to keep your weapons at the ready, in the event a passing patrol stumbles upon us, or worse..."},{"name":"SYSTEM","text":"Upon reconnoitering Castellum Velodyna, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"ALISAIE","text":"I...I'm fine, really. Never been better..."},{"name":"ALPHINAUD","text":"Don't speak or try to move! Take slow, steady breaths, and remain calm..."},{"name":"PIPIN","text":"Ugh... That is going to leave a mark."},{"name":"YSHTOLA","text":"..."},{"name":"KRILE","text":"You're worried about Y'shtola, aren't you? &lt;sigh&gt; It's too early to make any kind of prognosis, but...she's alive. For now."},{"name":"LYSE","text":"If it wasn't for her, it'd be me lying there...<br><span class=\"emphasis\">...I wish it was.</span>"},{"name":"CONRAD","text":"&lt;pant&gt; &lt;pant&gt; What about...what about the others? Where's M'naago? Where's Meffrid?"},{"name":"RAUBAHN","text":"You did well, <span class=\"highlight\">Forename</span>. You saved lives. No matter what happens, remember that."},{"name":"RAUBAHN","text":"Now then─let's do what we can for the wounded. Every minute counts!"},{"name":"MEFFRID","text":"..."},{"name":"WISCAR","text":"Godsdammit, Meffrid... Weren't you the one telling me to use my head and stay alive..."},{"name":"HOSTAGE","text":"Gods help us, they're killing everyone!"},{"name":"ALISAIE","text":"We have to stop them while there's still someone left to save!"},{"name":"HOSTAGE","text":"The imperials came from nowhere...started cutting people down left and right..."},{"name":"ALPHINAUD","text":"Reinforcements are on the way. Spread the word.<br>We should keep moving..."},{"name":"ALPHINAUD","text":"Confound it! Nothing for it but to fight."},{"name":"KRILE","text":"Twelve forfend... It's a <span class=\"emphasis\">bloodbath</span>...<br>Remember that we're here to save lives! Defend the hostages!"},{"name":"ALISAIE","text":"Those monsters─these people had surrendered!"},{"name":"PIPIN","text":"It's not too late for the others. We must hurry!"},{"name":"ALPHINAUD","text":"What the─ Are those <span class=\"emphasis\">beastmen</span> fighting for the imperials?<br>I've never seen them before..."},{"name":"KAIHOUGUN","text":"They...they took Lyse and the others deeper inside... You've...you've got..."},{"name":"KRILE","text":"There they are! We're not too late!"},{"name":"FORDOLA","text":"Well, well. A rescue party, is it? We'll see about that."},{"name":"FORDOLA","text":"Gah! Who in the seven hells are you!?"},{"name":"ALPHINAUD","text":"No! We took too long..."},{"name":"ALPHINAUD","text":"Confound it..."},{"name":"ALISAIE","text":"This...cannot be..."},{"name":"PIPIN","text":"Forgive me, Father..."},{"name":"KRILE","text":"I...I can still..."},{"name":"ALISAIE","text":"If we kill him, here and now, we can end this!"},{"name":"ZENOS","text":"I have no need for this rabble."},{"name":"PIPIN","text":"Seven hells... Not even Father could do that..."},{"name":"ZENOS","text":"Hm. You yet stand. Mayhap you have potential."},{"name":"ZENOS","text":"Better...but lacking nevertheless..."},{"name":"ZENOS","text":"It would seem I misjudged you. This ends now."},{"name":"TEBBE","text":"Medicines, is it? Come on, come on, take what you need! I'm not about to be a stickler when there's lives to be saved!"},{"name":"CARMA","text":"Valiantly did we fight, but ultimately for naught..."},{"name":"AHELISSA","text":"What's done is done. The dead are dead. All I can do is feed the living and pray it helps them to grow stronger."},{"name":"RANULF","text":"Bastards paid no heed to whether or not the men they slaughtered were armed. Some of the sutlers... Damn it all!"},{"name":"ORTWIN","text":"The imperials came from the Peaks. Somehow they knew about the tunnel..."},{"name":"MATHILD","text":"We came together as best we could, but in the end, there were just too many of them."},{"name":"ODILA","text":"I don't know... If we'd noticed sooner we could've used the cannons, but by the time we did, it was too late..."},{"name":"DHANNA","text":"There will be a reckoning. Mark my words..."},{"name":"ORELLA","text":"No time to talk. I must prepare more medicines."},{"name":"EMMET","text":"I know there were spare bandages here somewhere..."},{"name":"BERINHARD","text":"Gah... In the heat of battle I barely felt the pain, but when the fighting died down, it was all I could do to stay standing..."},{"name":"HUGHOC","text":"Herbs for the poultices, herbs for the poultices..."}],"reward":{"gil":2203,"xp":175500},"reqs":{"jobs":[{"lvl":61,"id":142}],"quests":[67998]},"next":[68000]},"partials":[{"type":"npc","id":"1020354","obj":{"i":1020354,"n":"Pipin","l":2406,"q":9}},{"type":"npc","id":"1020400","obj":{"i":1020400,"n":"Raubahn","l":2403,"q":3}},{"type":"npc","id":"1019471","obj":{"i":1019471,"n":"Tebbe","l":2403,"q":2}},{"type":"npc","id":"1019472","obj":{"i":1019472,"n":"Carma","l":2403,"q":1}},{"type":"npc","id":"1019476","obj":{"i":1019476,"n":"Ahelissa","l":2403,"q":3}},{"type":"npc","id":"1019477","obj":{"i":1019477,"n":"Ranulf","l":2403,"q":2}},{"type":"npc","id":"1019479","obj":{"i":1019479,"n":"Ortwin","l":2403,"q":2}},{"type":"npc","id":"1019481","obj":{"i":1019481,"n":"Mathild","l":2403,"q":1}},{"type":"npc","id":"1019483","obj":{"i":1019483,"n":"Odila","l":2403,"q":1}},{"type":"npc","id":"1019484","obj":{"i":1019484,"n":"Dhanna","l":2403,"q":1}},{"type":"npc","id":"1019486","obj":{"i":1019486,"n":"Orella","l":2403,"q":6}},{"type":"npc","id":"1019488","obj":{"i":1019488,"n":"Emmet","l":2403,"q":1}},{"type":"npc","id":"1019489","obj":{"i":1019489,"n":"Berinhard","l":2403,"q":1}},{"type":"npc","id":"1019490","obj":{"i":1019490,"n":"Hughoc","l":2403,"q":2}},{"type":"npc","id":"1020190","obj":{"i":1020190,"n":"Thewy Youth","l":2403,"q":2}},{"type":"npc","id":"1020304","obj":{"i":1020304,"n":"Raubahn","l":2406,"q":9}},{"type":"npc","id":"1020392","obj":{"i":1020392,"n":"Serpent Officer","l":2406,"q":6}},{"type":"npc","id":"1020393","obj":{"i":1020393,"n":"Storm Officer","l":2406,"q":6}},{"type":"npc","id":"1020397","obj":{"i":1020397,"n":"Alphinaud","l":2406,"q":1}},{"type":"npc","id":"1020398","obj":{"i":1020398,"n":"Alisaie","l":2406,"q":1}},{"type":"npc","id":"1020399","obj":{"i":1020399,"n":"Pipin","l":2406,"q":1}},{"type":"npc","id":"1020411","obj":{"i":1020411,"n":"Meffrid","l":2403,"q":2}},{"type":"npc","id":"1020412","obj":{"i":1020412,"n":"Alphinaud","l":2403,"q":5}},{"type":"npc","id":"1020414","obj":{"i":1020414,"n":"Lyse","l":2403,"q":3}},{"type":"npc","id":"1020415","obj":{"i":1020415,"n":"Y'shtola","l":2403,"q":3}},{"type":"npc","id":"1020416","obj":{"i":1020416,"n":"Conrad","l":2403,"q":3}},{"type":"npc","id":"1020417","obj":{"i":1020417,"n":"Krile","l":2403,"q":3}},{"type":"npc","id":"1020419","obj":{"i":1020419,"n":"Alisaie","l":2403,"q":5}},{"type":"npc","id":"1020420","obj":{"i":1020420,"n":"Pipin","l":2403,"q":3}},{"type":"npc","id":"1020525","obj":{"i":1020525,"n":"Alphinaud","l":2406,"q":6}},{"type":"npc","id":"1020526","obj":{"i":1020526,"n":"Alisaie","l":2406,"q":6}},{"type":"quest","id":"67998","obj":{"i":67998,"n":"Crossing the Velodyna","g":6,"l":"Rhalgr's Reach","s":170}},{"type":"quest","id":"68000","obj":{"i":68000,"n":"The Fires Fade","g":6,"l":"Rhalgr's Reach","s":190}}]}