{"quest":{"name":"A Good Samurai Is Hard to Find","location":"Kugane","id":68009,"patch":4.0,"sort":280,"eventIcon":71201,"issuer":1020465,"target":1020472,"involved":[1018982,1019002,1020464,1020466,1020467,1020468,1020469,1020470,1020471,1022086],"genre":6,"journal":["Alphinaud is a man with a plan."],"objectives":["Speak with Lyse.","View Alphinaud's sketch with Lyse.","Hand the sketch to Karaku.","Hand the sketch to Kotokaze.","Show the sketch to the captains on the Short Pier.","Speak with Lyse."],"dialogue":[{"name":"LYSE","text":"I'm not sure how I imagined our time in the Far East unfolding, but it definitely didn't involve Ul'dahns. And especially not <span class=\"emphasis\">these</span> Ul'dahns. Still...whatever works, right?"},{"name":"ALISAIE","text":"He was not exaggerating when he spoke of their wards' efficacy. Whoever wove them did so with consummate skill..."},{"name":"TATARU","text":"Oh, this place takes me back! It reminds me of the workshop of an Ul'dahn lapidary I once served!"},{"name":"HANCOCK","text":"I must confess, I am an avid collector of all things Far Eastern. See for yourself. I insist!"},{"name":"ALPHINAUD","text":"It would seem inefficient for us all to venture out together in search of information on Yugiri and Gosetsu's whereabouts. Agreed?"},{"name":"ALISAIE","text":"Agreed. We need to cast our net wider─split up and pursue all available avenues of inquiry. But if we're to coordinate our efforts effectively, we'll need to establish a working base of operations here."},{"name":"ALPHINAUD","text":"Indeed. Tataru would seem best suited to the task of organizing our supplies and procuring new ones."},{"name":"ALPHINAUD","text":"While she attends to that, we four can begin our search by questioning the individuals Hancock identified. Alisaie and I will take those in the southern districts of the city, and the two of you can take those in the north."},{"name":"ALPHINAUD","text":"In, uh...anticipation of just such an eventuality, I took the liberty of preparing some few sketches of Yugiri and Gosetsu during our voyage."},{"name":"LYSE","text":"Wow... Y'shtola warned me that you were a bit of an artist, but these are <span class=\"emphasis\">great</span>! They'll definitely come in handy."},{"name":"LYSE","text":"Looks like it's you and me, <span class=\"highlight\">Forename</span>. Let's step outside and talk about where to start!"},{"name":"TATARU","text":"Leave everything here to me! If I can keep the Waking Sands, the Rising Stones, and the Falling Snows afloat, then this should be easy! I just need to think of a new name. The Blooming Cherry Blossoms? No, no, that's no good..."},{"name":"LYSE","text":"Wow, Alphinaud's sketches are so... I don't know how to put it, but they're very..."},{"name":"LYSE","text":"Well, see for yourself!"},{"name":"SYSTEM","text":"You may view Alphinaud's sketch at any time during this quest by using the relevant item in the <span class=\"highlight\">Key Items</span> menu."},{"name":"LYSE","text":"Go on, take a look! You'll see what I mean."},{"name":"SYSTEM","text":"You may view Alphinaud's sketch at any time during this quest by using the relevant item in the <span class=\"highlight\">Key Items</span> menu."},{"name":"LYSE","text":"It looks more like them than they do! Honestly, he could make a living doing this..."},{"name":"LYSE","text":"Ah, sorry, sorry! No time for distractions! Why don't we start by visiting...Karaku at the...on-something? Onsun? Onsan? Onsen! That was it!"},{"name":"KARAKU","text":"Come one, come all! Burns, cuts, embarrassing rashes─there is naught that the mystical waters of the Bokaisen Hot Springs cannot heal!"},{"name":"KARAKU","text":"Ho, what is that in your hand?"},{"name":"KARAKU","text":"Hmm...you seek this Au Ra and this Roegadyn, do you?"},{"name":"KARAKU","text":"A thousand apologies, but I cannot help you. It is against our policy to divulge information regarding patrons past or present."},{"name":"LYSE","text":"Please! We came all the way from Eorzea to find our friends!"},{"name":"KARAKU","text":"We have our reputation to consider, miss. Men and women from all walks of life come here in search of rejuvenation─body and soul."},{"name":"KARAKU","text":"They seek privacy and discretion, and we have ever honored their wishes. Only the Sekiseigumi may demand otherwise. I am sorry, but there is naught I can do."},{"name":"LYSE","text":"I suppose we'll just have to ask someone else, then. What about that woman who runs the hostelry? Kotokaze, was it?"},{"name":"KARAKU","text":"You seem a kind soul, and it pains me that I cannot help you. If the strain of your troubles weighs too heavily on your heart, I could recommend a number of treatments..."},{"name":"KOTOKAZE","text":"Welcome, traveler. Can I interest you in some rice wine? Exceptional quality, delivered but the other day..."},{"name":"KOTOKAZE","text":"...Ah. An Auri shinobi and a Roegadyn samurai. If I may, I would answer your question with some few of mine own."},{"name":"KOTOKAZE","text":"If I speak of that which you know, ijin, be not offended. You are familiar with the situation in the lands across the Ruby Sea? The doomed rebellion, after two and a half decades of quiet?"},{"name":"KOTOKAZE","text":"I see. And you are familiar with the ways of Hingashi? How we elect to stand apart and support no cause but our own? Indifferent and callous, some may call us, but pragmatism is essential if a humble island nation such as ours is to survive."},{"name":"KOTOKAZE","text":"But we are not fools. Complete isolation is impractical. And so Kugane is open to ijin, and we are <span class=\"emphasis\">equally</span> hospitable to <span class=\"emphasis\">all</span>. Or, if I must speak more plainly: Yes, I can help you. But if I do, I must <span class=\"emphasis\">also</span> oblige the ones who ask after <span class=\"emphasis\">you</span>."},{"name":"KOTOKAZE","text":"Are you willing to accept this fair and equitable treatment?"},{"name":"LYSE","text":"If anyone comes looking for us, tell them whatever you like."},{"name":"KOTOKAZE","text":"As you wish. The two individuals of whom you speak did indeed come here. They sought passage across the Ruby Sea."},{"name":"KOTOKAZE","text":"Few ships are willing to make the trip at the moment. Nevertheless, I made several introductions on their behalf. That was the extent of our interaction."},{"name":"KOTOKAZE","text":"I will provide you with the names of the captains, if you like."},{"name":"LYSE","text":"You've been a great help, Mistress Kotokaze. I'll be sure to come back for that wine sometime."},{"name":"KOTOKAZE","text":"We would welcome your custom, miss."},{"name":"LYSE","text":"We should question these captains as soon as we can. You take the first three, I'll take the rest, and we'll meet here when we've finished. All right? Good luck!"},{"name":"KOTOKAZE","text":"All ijin are subject to the same rules, and must receive the same treatment. To be equal is to be fair, and to be fair is to be free."},{"name":"KUGANEFERRYMAN","text":"...Yes, a Roegadyn gentleman did approach me. He wanted to charter a ship to take him across the Ruby Sea, the mad devil."},{"name":"KUGANEFERRYMAN","text":"I sent him away, like all the others before him. The woman? Nay, I know her not."},{"name":"KUGANEFERRYMAN","text":"I told you, I refused the man's request, and I know nothing of the woman. Now leave me be!"},{"name":"KUGANECAPTAIN","text":"Passengers? No. We no longer offer that service. Too much trouble. Now, we only transport goods. I told this to the samurai and sent him on his way."},{"name":"KUGANECAPTAIN","text":"The woman? Pah. If it is women you seek, the pleasure houses have plenty."},{"name":"KUGANECAPTAIN","text":"I told you, the man was alone, and I sent him away. What more do you want?"},{"name":"RADZATHANMERCHANT","text":"You ask me if I have seen this Auri woman and this Roegadyn samurai? Hmm... The woman is unknown to me, but the man is not."},{"name":"RADZATHANMERCHANT","text":"He was for Doma, but I could not help him. We travel solely between here and Radz–at–Han. It would be an unreasonable detour."},{"name":"RADZATHANMERCHANT","text":"As I said, I spoke only with the man. He wished to go to Doma, and went away when I said I could not help him. Will that be all?"},{"name":"LYSE","text":"How did it─ Oh. Never mind. Judging from the look on your face, you didn't have much better luck than I did..."}],"reward":{"gil":885,"items":[{"id":20306}],"xp":175500},"reqs":{"jobs":[{"lvl":61,"id":142}],"quests":[68008]},"next":[68010]},"partials":[{"type":"npc","id":"1020465","obj":{"i":1020465,"n":"Alphinaud","l":2927,"q":6}},{"type":"npc","id":"1020472","obj":{"i":1020472,"n":"Lyse","l":2404,"q":2}},{"type":"npc","id":"1018982","obj":{"i":1018982,"n":"Karaku","l":2404,"q":4}},{"type":"npc","id":"1019002","obj":{"i":1019002,"n":"Kotokaze","l":2404,"q":5}},{"type":"npc","id":"1020464","obj":{"i":1020464,"n":"Hancock","l":2927,"q":5}},{"type":"npc","id":"1020466","obj":{"i":1020466,"n":"Tataru","l":2927,"q":5}},{"type":"npc","id":"1020467","obj":{"i":1020467,"n":"Lyse","l":2927,"q":4}},{"type":"npc","id":"1020468","obj":{"i":1020468,"n":"Alisaie","l":2927,"q":4}},{"type":"npc","id":"1020469","obj":{"i":1020469,"n":"Curt Captain","l":2404,"q":2}},{"type":"npc","id":"1020470","obj":{"i":1020470,"n":"Meticulous Merchant","l":2404,"q":1}},{"type":"npc","id":"1020471","obj":{"i":1020471,"n":"Hannish Spice Trader","l":2404,"q":1}},{"type":"npc","id":"1022086","obj":{"i":1022086,"n":"Lyse","l":2404,"q":1}},{"type":"item","id":"20306","obj":{"i":20306,"n":"Yugiri and Gosetsu Sketch","l":1,"c":51356,"t":79,"p":5000}},{"type":"quest","id":"68008","obj":{"i":68008,"n":"By the Grace of Lord Lolorito","g":6,"l":"Kugane","s":270}},{"type":"quest","id":"68010","obj":{"i":68010,"n":"It's Probably a Trap","g":6,"l":"Kugane","s":290}}]}