{"quest":{"name":"The Man from Ul'dah","location":"Kugane","id":68006,"patch":4.0,"sort":250,"eventIcon":71201,"issuer":1020450,"target":1020460,"involved":[1020451,1020452,1020453,1020454,1020455,1020456,1020457,1020458,1020459,1020463,1021740,1022347,1022348,1022349,1022350],"genre":6,"journal":["Despite traveling halfway around the world, Alphinaud is in no mood to take in the sights."],"objectives":["Speak with Hancock.","Follow Hancock."],"dialogue":[{"name":"LYSE","text":"I...I don't know what I was expecting, but it wasn't this."},{"name":"ALISAIE","text":"It's very...colorful, is it not?"},{"name":"TATARU","text":"Strange... Is it just me, or is the ground swaying?"},{"name":"CARVALLAIN","text":"Myriad delights await you, should you elect to explore and experience─assuming you are sufficiently <span class=\"emphasis\">open-minded</span>, that is. I, alas, cannot afford to linger..."},{"name":"KRAKENSDECKHAND","text":"Thanks again for, uh, saving us from certain death at the hands of Lorelei and whatnot. We'll not soon forget it."},{"name":"ALPHINAUD","text":"Glad though I am to have arrived, I would remind you all that we are far from home, with limited resources at our disposal..."},{"name":"ALISAIE","text":"Duly noted, Brother. I shall take care not to enjoy myself. In any event, Doma is our final destination, and our first order of business should be to secure passage there."},{"name":"ALPHINAUD","text":"Captain Carvallain, I realize you pledged only to take us as far as Kugane, and I have no desire to change the terms of our agreement. I should, however, be interested to know how you would go about reaching Othard, were you in our position."},{"name":"CARVALLAIN","text":"At the risk of stating the obvious...you are in a port. Surely there is a kind and generous soul here who will aid you for the right price? You cannot be the first travelers seeking passage to Doma."},{"name":"ALPHINAUD","text":"...The captain makes a good point. 'Tis like that Yugiri and Gosetsu were forced to come here for the selfsame reasons we were. They must have found a way to Othard─assuming they are not still in the city."},{"name":"ALPHINAUD","text":"Hmm... Ere we seek passage, mayhap we should first seek our friends."},{"name":"TATARU","text":"Leave it to me, Alphinaud! Making friendly inquiries is my specialty. Lest you forget, I got plenty of practice in Ishgard!"},{"name":"TATARU","text":"Captain Carvallain, could you direct us to the nearest tavern?"},{"name":"CARVALLAIN","text":"Desperate for a drink, are we? You may find one in that large building just beyond the pier."},{"name":"CARVALLAIN","text":"Whether your journeys have come to an end or are about to begin, the Shiokaze Hostelry is an ideal place to rest, relax, and reflect. Or so they say."},{"name":"CARVALLAIN","text":"And with that, my dear Scions, I bid you farewell. As soon as we have replenished our supplies, we must away. Ours was ever a fast-moving business."},{"name":"ALISAIE","text":"The “spice trade,” you mean?"},{"name":"CARVALLAIN","text":"But of course. Surely you did not think I traveled halfway around the world and delivered you to your destination solely out of the kindness of my heart?"},{"name":"ALPHINAUD","text":"Perish the thought. Thank you, Captain, and may the Navigator watch over and keep you."},{"name":"ALPHINAUD","text":"Right, then. To the hostelry?"},{"name":"TATARU","text":"After you!"},{"name":"LYSE","text":"So there are imperial spies everywhere? Great. Just great..."},{"name":"ALISAIE","text":"(I daresay Alphinaud has met his match.)"},{"name":"TATARU","text":"(I don't trust him one bit...and neither should you!)"},{"name":"ALPHINAUD","text":"Forgive me. The mere mention of the East Aldenard Trading Company is enough to... &lt;mumble&gt; &lt;mumble&gt; I am fine. Truly. You need not worry."},{"name":"HANCOCK","text":"And you must be <span class=\"highlight\">Forename Surname</span>! Slayer of Gods... Rider of Dragons... Savior of Ishgard... Stealer of Pants─if some of the more puzzling rumors are to be believed."},{"name":"HANCOCK","text":"I knew it! May I say what an honor and a pleasure it is to make your acquaintance, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">good sir</span></span>. I just know you and I are going to get along famously!"},{"name":"HANCOCK","text":"Now then, without further ado, allow me to escort you to the company offices."},{"name":"HANCOCK","text":"This being your first visit to our fair city, I shall make an effort to point out various landmarks along the way. If you would be so good as to follow me!"},{"name":"LYSE","text":"Even the aetherytes look different here..."},{"name":"ALISAIE","text":"I note that our would-be host has elected to dress in the local fashion."},{"name":"TATARU","text":"&lt;sniff&gt; &lt;sniff&gt; I say, what is that I smell wafting from yonder teahouse? Could it be─ Yes, could it just possibly be the scent of whispered secrets waiting to be overheard?"},{"name":"ALPHINAUD","text":"I do not like the cut of that man's jib. Not one bit."},{"name":"HANCOCK","text":"Everyone! If I could have your attention, please. You are now standing in Tenkonto."},{"name":"HANCOCK","text":"Loosely translated, the name means “spire of drifting souls,” which─as some of you may have deduced─makes reference to the aetheryte which stands over yonder."},{"name":"HANCOCK","text":"Hmm... The design is markedly different from those of Sharlayan, yet I trust its function is identical?"},{"name":"HANCOCK","text":"A diplomat and a scholar! Will wonders never cease."},{"name":"HANCOCK","text":"Far Eastern aetheryte technologies have a long and storied tradition, I assure you. This particular example was constructed by the Onishishu, a collective of skilled craftsmen, who guard their ancestral techniques with the utmost secrecy."},{"name":"HANCOCK","text":"In short, you will find it no less reliable than its western counterparts. Attune, if you like."},{"name":"EATCASSISTANT","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, and welcome to the Kugane branch offices of the East Aldenard Trading Company. Do you have an appointment?"}],"reward":{"gil":688,"xp":175500},"reqs":{"jobs":[{"lvl":61,"id":142}],"quests":[68005]},"next":[68007]},"partials":[{"type":"npc","id":"1020450","obj":{"i":1020450,"n":"Alphinaud","l":2404,"q":2}},{"type":"npc","id":"1020460","obj":{"i":1020460,"n":"Hancock","l":2404,"q":2}},{"type":"npc","id":"1020451","obj":{"i":1020451,"n":"Alisaie","l":2404,"q":4}},{"type":"npc","id":"1020452","obj":{"i":1020452,"n":"Lyse","l":2404,"q":3}},{"type":"npc","id":"1020453","obj":{"i":1020453,"n":"Tataru","l":2404,"q":2}},{"type":"npc","id":"1020454","obj":{"i":1020454,"n":"Carvallain","l":2404,"q":2}},{"type":"npc","id":"1020455","obj":{"i":1020455,"n":"Hancock","l":2404,"q":2}},{"type":"npc","id":"1020456","obj":{"i":1020456,"n":"Alphinaud","l":2404,"q":1}},{"type":"npc","id":"1020457","obj":{"i":1020457,"n":"Tataru","l":2404,"q":1}},{"type":"npc","id":"1020458","obj":{"i":1020458,"n":"Alisaie","l":2404,"q":1}},{"type":"npc","id":"1020459","obj":{"i":1020459,"n":"Lyse","l":2404,"q":1}},{"type":"npc","id":"1020463","obj":{"i":1020463,"n":"East Aldenard Trading Company Aide","l":2404,"q":4}},{"type":"npc","id":"1021740","obj":{"i":1021740,"n":"Kraken's Arms Deckhand","l":2404,"q":2}},{"type":"npc","id":"1022347","obj":{"i":1022347,"n":"Alphinaud","l":2404,"q":2}},{"type":"npc","id":"1022348","obj":{"i":1022348,"n":"Alisaie","l":2404,"q":2}},{"type":"npc","id":"1022349","obj":{"i":1022349,"n":"Lyse","l":2404,"q":2}},{"type":"npc","id":"1022350","obj":{"i":1022350,"n":"Tataru","l":2404,"q":2}},{"type":"quest","id":"68005","obj":{"i":68005,"n":"Not without Incident","g":6,"l":"Mor Dhona","s":240}},{"type":"quest","id":"68007","obj":{"i":68007,"n":"Where the Streets Are Paved with Koban","g":6,"l":"Kugane","s":260}}]}