{"quest":{"name":"Tales from the Far East","location":"Limsa Lominsa","id":68004,"patch":4.0,"sort":230,"eventIcon":71201,"issuer":1020434,"target":1020436,"involved":[1020394,1020435,1020499,1020528,1020529,1020530],"genre":6,"journal":["Alphinaud is thinking of ways you might pass the time..."],"objectives":["Speak with Lyse in Revenant's Toll.","Speak with the Domans in the Rising Stones.","Speak with Lyse in Revenant's Toll."],"dialogue":[{"name":"LYSE","text":"I'm not sure what just happened. I could have sworn he was about to turn us away, but then he...changed his mind?"},{"name":"ALISAIE","text":"(Blackmail, is it? This is a dangerous game the two of them are playing... What guarantee do we have that Carvallain won't just throw us overboard?)"},{"name":"TATARU","text":"The poor little boy had only seen fourteen summers when he left Ishgard. Can you imagine what it must have felt like─to finally be free to explore the world, unbeholden to all the stuffy traditions of the Holy See?"},{"name":"TATARU","text":"Such a shame that he never returned home. Without him, the Count de Durendaire must look elsewhere for a successor...and the good Lord Jannequinard is one step closer to being the next in line..."},{"name":"ALPHINAUD","text":"I say we should heed the captain's advice and attend to our own preparations while they ready the vessel for departure."},{"name":"ALPHINAUD","text":"Tataru and I will procure the necessary supplies. Alisaie...I should be grateful if you would use the time to brief Urianger on recent developments. You may also wish to review the relevant safety procedures in the event of an emergency at sea."},{"name":"ALISAIE","text":"How...how very prudent of you. Very well, I shall go and speak with him. What of <span class=\"highlight\">Forename</span> and Lyse?"},{"name":"ALPHINAUD","text":"I would like the two of you to return to Revenant's Toll and speak with our Doman allies. I fear we know too little of their homeland, and any information they can provide would be most welcome."},{"name":"ALPHINAUD","text":"When we have completed our respective tasks, we will reconvene here at the ferry docks. Agreed?"},{"name":"LYSE","text":"Sounds like a plan! Let's go, <span class=\"highlight\">Forename</span>!"},{"name":"LYSE","text":"Well, here we are. We'll need to talk to lots of people, so I think we should split up."},{"name":"LYSE","text":"I'll ask around at the House of Splendors. You take the Rising Stones. I'll meet you here after. Got it?"},{"name":"HOMEI","text":"You are truly planning to travel to Doma? I...I do not know what to say...<br>Forgive me. I shall aid you to the best of my ability."},{"name":"HOMEI","text":"Ours is a beautiful land, nestled on the eastern coast of Othard. Along the banks of the One River, our nation thrived, proud and free, until the Garleans came, twenty-five years ago..."},{"name":"HOMEI","text":"The river was our lifeblood, free to travel and to fish...but travel was soon restricted, and now the river belongs to none..."},{"name":"HOMEI","text":"I remember sitting on the banks of the One River as a child, watching the fishing boats drift by..."},{"name":"HOMEI","text":"But now the One River is closed to all. The Moon Gates open for none."},{"name":"HIGIRI","text":"Greetings, <span class=\"highlight\">Forename</span>. What brings you to the Toll this <span class=\"alternative-container\"><span class=\"alternative\">eve</span><span class=\"alternative\">day</span></span>?"},{"name":"HIGIRI","text":"What? You are for Doma? Heavens... You Scions have shown us naught but kindness, but never in my wildest dreams did I imagine you would fight for our homeland..."},{"name":"HIGIRI","text":"For twenty-five years we suffered under their tyranny. And then we spied an opportunity─the Emperor, dead! Garlemald in chaos!"},{"name":"HIGIRI","text":"It seemed the time was ripe. Beneath our lord's banners we gathered, and fought to reclaim our nation. But when Zenos arrived with the XIIth Legion, it was over in an instant..."},{"name":"HIGIRI","text":"Lord Kaien was a good man who cared only for his people. Though it pained him to kneel to Garlemald, he did so for our sake. And for our sake, he would willingly have endured that ignominy for another twenty-five years, had we not beseeched him to act."},{"name":"HIGIRI","text":"But we convinced him that we could win. That we could defeat Zenos and the Empire. And for our failure, he paid the ultimate price..."},{"name":"HOZAN","text":"Hm? What is it, my friend? You look as though you have something to ask."},{"name":"HOZAN","text":"That you go to join Yugiri and Gosetsu in the fight fills me with such joy! Ah, forgive my exuberance. You require information, yes?"},{"name":"HOZAN","text":"We of the Nagae clan have served Doma faithfully for generations. My ancestors held positions within Doma Castle, even. Now it is home to the imperial viceroy's witch, and her host of men and magitek."},{"name":"HOZAN","text":"To think that what was once the shining symbol of our heritage─and the seat of dear Lord Kaien─has become a den for Garlean dogs..."},{"name":"HOZAN","text":"Doma was all but wiped from the face of Othard. Only Doma Castle, seat of our Lord and symbol of all that we were, was spared the wages of war."},{"name":"HOZAN","text":"Yet for the blessing that that is, the thought of that witch and her sycophants claiming it for their own fills me with unspeakable anger..."},{"name":"LYSE","text":"Ah, there you are! Learn anything interesting? The older Domans I spoke with tried to teach me all about Far Eastern customs and the importance of formality and politeness..."},{"name":"LYSE","text":"I'd like to think Eorzeans can be just as stiff and stuffy as anyone─especially Ishgardians─but anyway... Did you know they eat with <span class=\"emphasis\">sticks</span>? It wasn't all that hard, actually─or at least, that's what I thought until they told me I was holding them wrong. And then when I spoke with the younger Domans, they just rolled their eyes and told me it was all a load of stupid old─ Hm?"},{"name":"LYSE","text":"Wow... What you learned sounds <span class=\"emphasis\">a lot</span> more useful. Unless someone invites us for dinner, of course. I hope they do."}],"reward":{"gil":1066,"items":[{"id":18052,"one":1,"hq":1},{"id":18058,"one":1,"hq":1},{"id":18064,"one":1,"hq":1},{"id":18076,"one":1,"hq":1},{"num":3,"id":5633,"one":1}],"xp":175500},"reqs":{"jobs":[{"lvl":61,"id":142}],"quests":[68003]},"next":[68005]},"partials":[{"type":"npc","id":"1020434","obj":{"i":1020434,"n":"Alphinaud","l":28,"q":2}},{"type":"npc","id":"1020436","obj":{"i":1020436,"n":"Lyse","l":67,"q":2}},{"type":"npc","id":"1020394","obj":{"i":1020394,"n":"Alisaie","l":28,"q":2}},{"type":"npc","id":"1020435","obj":{"i":1020435,"n":"Lyse","l":28,"q":2}},{"type":"npc","id":"1020499","obj":{"i":1020499,"n":"Homei","l":481,"q":1}},{"type":"npc","id":"1020528","obj":{"i":1020528,"n":"Hozan","l":481,"q":1}},{"type":"npc","id":"1020529","obj":{"i":1020529,"n":"Higiri","l":481,"q":1}},{"type":"npc","id":"1020530","obj":{"i":1020530,"n":"Tataru","l":28,"q":2}},{"type":"item","id":"18052","obj":{"i":18052,"n":"Gaganaskin Hose of Fending","l":255,"c":47345,"t":36,"p":33323}},{"type":"item","id":"18058","obj":{"i":18058,"n":"Gaganaskin Hose of Maiming","l":255,"c":47346,"t":36,"p":33323}},{"type":"item","id":"18064","obj":{"i":18064,"n":"Bloodhempen Brais of Striking","l":255,"c":47331,"t":36,"p":33323}},{"type":"item","id":"18076","obj":{"i":18076,"n":"Bloodhempen Brais of Scouting","l":255,"c":47332,"t":36,"p":33323}},{"type":"item","id":"5633","obj":{"i":5633,"n":"Piety Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"68003","obj":{"i":68003,"n":"Lies, Damn Lies, and Pirates","g":6,"l":"The Fringes","s":220}},{"type":"quest","id":"68005","obj":{"i":68005,"n":"Not without Incident","g":6,"l":"Mor Dhona","s":240}}]}