{"quest":{"name":"Lies, Damn Lies, and Pirates","location":"The Fringes","id":68003,"patch":4.0,"sort":220,"eventIcon":71201,"issuer":1020526,"target":1020434,"involved":[1020304,1020308,1020354,1020359,1020392,1020393,1020394,1020433,1020435,1020525,1020527,1020530],"genre":6,"journal":["Alisaie is contemplating the logistics of a journey to the Far East."],"objectives":["Speak with Alphinaud in Limsa Lominsa.","Speak with Alphinaud."],"dialogue":[{"name":"STORMOFFICER","text":"How in Llymlaen's name did they find the Reach? I thought their glamours were impenetrable."},{"name":"SERPENTOFFICER","text":"I have called upon Stillglade Fane to send every available conjurer, no matter how inexperienced, to help with the wounded. I pray it will be enough."},{"name":"ALPHINAUD","text":"That which is beyond one alone may yet be within reach of the many."},{"name":"RAUBAHN","text":"If there is truth in the rumors, this is not the first time Zenos has “spared” his foes. They say he abides by an unusual code, and takes pleasure in the fight. Whatever his reasons, we must use this time to our advantage."},{"name":"CONRAD","text":"We've got a long road ahead of us...but it all begins with the first step."},{"name":"CONRAD","text":"We'll stay in the Reach and rebuild. We'll reinforce our defenses. And if they come again, we'll be ready."},{"name":"PIPIN","text":"I wish you well on your journey, my friend. Let us pray that when we meet again, our fortunes will be much changed."},{"name":"LYSE","text":"I can't deny a part of me wants to stay and fight... But I know I'd be more use to you and the others."},{"name":"KRILE","text":"You've said your piece, yes? Now would you please return to bed? You'll never recover if you carry on like this!"},{"name":"MNAAGO","text":"&lt;pant&gt; &lt;pant&gt; Ye gods, the pain... It seemed like a good idea at the time..."},{"name":"ALISAIE","text":"\"Where men go as one, there is life. And where there is life, there is cause to hope.“ Our grandfather believed that, and so do I..."},{"name":"ALISAIE","text":"But before we can forge ties with our friends in the Far East, we must first find a way to reach them. Othard is not exactly over the river and through the woods."},{"name":"ALPHINAUD","text":"I am one step ahead of you, dear sister─or rather, Tataru is. But before we discuss that, there is another issue I wish to address."},{"name":"ALPHINAUD","text":"Much as I would like it if we could all make this journey together, someone will need to remain to serve as liaison to the Alliance and the Resistance during this critical period. Moreover, as Y'shtola cannot be left unattended..."},{"name":"KRILE","text":"...Then I should obviously remain? Very well. Issue addressed."},{"name":"KRILE","text":"You know, Alphinaud, it would have been quicker just to ask─and <span class=\"emphasis\">markedly</span> less patronizing."},{"name":"ALPHINAUD","text":"Y-Yes, I suppose, uh... Ahem. Would you be willing to look after Y'shtola and provide support to Arenvald and the others?"},{"name":"KRILE","text":"<span class=\"emphasis\">Yes</span>, Alphinaud. <span class=\"emphasis\">I would.</span><br>You see? That wasn't so hard, was it? Enjoy your trip, and don't you <span class=\"emphasis\">dare</span> return with a gift!"},{"name":"ALPHINAUD","text":"Oh, I would not dream of it...<br>Right, then. Sister, <span class=\"highlight\">Forename</span>, Lyse─gather your things. We are for Limsa Lominsa."},{"name":"LYSE","text":"Vylbrand was always Y'shtola's domain. I haven't spent much time here, to be honest..."},{"name":"ALISAIE","text":"I spoke with Urianger and Thancred along the way. To say they were surprised by our stratagem would be something of an understatement, but they did not dispute its logic."},{"name":"ALPHINAUD","text":"Tataru should be here any moment with our ship's captain."},{"name":"LYSE","text":"So we're going by sea after all. Is Merlwyb lending us our pick of the Crimson Fleet?"},{"name":"ALPHINAUD","text":"Not...exactly. You are right, in as much as we will be traveling by sea. Regrettably, it is simply not feasible for an airship to travel such a distance without impossibly large fuel reserves, to say nothing of the inevitability of running afoul of the Empire's aerial defenses."},{"name":"ALPHINAUD","text":"...But then it is equally infeasible to sail an Eorzean Alliance vessel halfway around the world without the Empire taking notice."},{"name":"ALPHINAUD","text":"Which leaves us with only one other option... Ah, speak of the devil."},{"name":"TATARU","text":"Sorry to keep you waiting! May I present to you Captain Carvallain of the Kraken's Arms!"},{"name":"ALISAIE","text":"The <span class=\"emphasis\">Kraken's Arms</span>!? Don't tell me you made a deal with pirates!"},{"name":"CARVALLAIN","text":"Greetings and salutations, Scions. I take it from your comrade's tone that you no longer wish to proceed with our proposed arrangement?"},{"name":"ALPHINAUD","text":"Not at all, Captain. Pray forgive my sister her outburst─she has ever been one to speak her mind. I, on the other hand, am the very soul of discretion, as many well-respected personages would attest, from the offices of the Admiral, to the High Houses of Ishgard."},{"name":"ALPHINAUD","text":"Ah, but where was I? Oh, yes! The Scions of the Seventh Dawn do indeed still wish to employ your services. However, it is important that you are aware of certain extenuating circumstances..."},{"name":"CARVALLAIN","text":"...And intent on securing passage to the Far East, you came to us, knowing us to be the proud purveyors of said region's finest spices."},{"name":"ALISAIE","text":"...Which you steal from gods-fearing merchants out on the high seas."},{"name":"CARVALLAIN","text":"Whatever privateering the Kraken's Arms may or may not engage in is strictly within the limits of the law, as set forth by our indefatigable keeper of the peace. More to the point, we are pragmatists. I see considerable risk in aiding your cause, and negligible profit."},{"name":"TATARU","text":"Well, I for one think the captain has a point. The five seas can be extremely treacherous, and many a poor, unfortunate soul has to come to grief out there on the waves."},{"name":"TATARU","text":"Why, when we were in Ishgard, I heard the tragical tale of how the heir to House Durendaire vanished at sea!"},{"name":"TATARU","text":"Even now, nearly twenty years later, the poor count remains <span class=\"emphasis\">convinced</span> that his son still lives, and would pay a sultan's ransom for news of his whereabouts..."},{"name":"CARVALLAIN","text":"Hahaha... Ahahahahaha!"},{"name":"CARVALLAIN","text":"Truly a tragedy for the ages, and a testament to the misfortunes that may befall us should we act without...due consideration. But so long as you are prepared to abide the capricious whims of fate, I am willing to oblige you this once."},{"name":"CARVALLAIN","text":"That said, in light of the recent rebellion, I trust you understand that I cannot deliver you to Doma itself. I can take you only as far as Kugane, in Hingashi."},{"name":"CARVALLAIN","text":"We will require time to procure sufficient provisions and make ready for departure. I humbly suggest you do the same."},{"name":"LYSE","text":"I'm not sure what just happened. I could have sworn he was about to turn us away, but then he...changed his mind?"},{"name":"ALISAIE","text":"(Blackmail, is it? This is a dangerous game the two of them are playing... What guarantee do we have that Carvallain won't just throw us overboard?)"},{"name":"TATARU","text":"The poor little boy had only seen fourteen summers when he left Ishgard. Can you imagine what it must have felt like─to finally be free to explore the world, unbeholden to all the stuffy traditions of the Holy See?"},{"name":"TATARU","text":"Such a shame that he never returned home. Without him, the Count de Durendaire must look elsewhere for a successor...and the good Lord Jannequinard is one step closer to being the next in line..."},{"name":"ALPHINAUD","text":"Suddenly, all those hours Tataru passed cavorting and capering at the Forgotten Knight seem rather better spent, do they not?"},{"name":"ALPHINAUD","text":"(That said, I had intended to press the point more obliquely... And there was something disconcerting about the pleasure Tataru took in making Captain Carvallain squirm...)"}],"reward":{"gil":1426,"items":[{"num":3,"id":5718}],"xp":175500},"reqs":{"jobs":[{"lvl":61,"id":142}],"quests":[68002]},"next":[68004]},"partials":[{"type":"npc","id":"1020526","obj":{"i":1020526,"n":"Alisaie","l":2406,"q":6}},{"type":"npc","id":"1020434","obj":{"i":1020434,"n":"Alphinaud","l":28,"q":2}},{"type":"npc","id":"1020304","obj":{"i":1020304,"n":"Raubahn","l":2406,"q":9}},{"type":"npc","id":"1020308","obj":{"i":1020308,"n":"Krile","l":2406,"q":4}},{"type":"npc","id":"1020354","obj":{"i":1020354,"n":"Pipin","l":2406,"q":9}},{"type":"npc","id":"1020359","obj":{"i":1020359,"n":"M'naago","l":2406,"q":2}},{"type":"npc","id":"1020392","obj":{"i":1020392,"n":"Serpent Officer","l":2406,"q":6}},{"type":"npc","id":"1020393","obj":{"i":1020393,"n":"Storm Officer","l":2406,"q":6}},{"type":"npc","id":"1020394","obj":{"i":1020394,"n":"Alisaie","l":28,"q":2}},{"type":"npc","id":"1020433","obj":{"i":1020433,"n":"Conrad","l":2406,"q":2}},{"type":"npc","id":"1020435","obj":{"i":1020435,"n":"Lyse","l":28,"q":2}},{"type":"npc","id":"1020525","obj":{"i":1020525,"n":"Alphinaud","l":2406,"q":6}},{"type":"npc","id":"1020527","obj":{"i":1020527,"n":"Lyse","l":2406,"q":5}},{"type":"npc","id":"1020530","obj":{"i":1020530,"n":"Tataru","l":28,"q":2}},{"type":"item","id":"5718","obj":{"i":5718,"n":"Quickarm Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Skill Speed","category":0}}},{"type":"quest","id":"68002","obj":{"i":68002,"n":"Divide and Conquer","g":6,"l":"Rhalgr's Reach","s":210}},{"type":"quest","id":"68004","obj":{"i":68004,"n":"Tales from the Far East","g":6,"l":"Limsa Lominsa","s":230}}]}