{"quest":{"name":"Confederate Consternation","location":"The Ruby Sea","id":68016,"patch":4.0,"sort":350,"eventIcon":71201,"issuer":1019929,"target":1019939,"involved":[1019930,1019931,1019932,1019933,1019935,1019936,1019937,1019938,1019940,1019941,1021505,1021508],"genre":6,"journal":["Alisaie seems bemused to find herself standing outside a Confederate settlement."],"objectives":["Look for a familiar face on Onokoro.","Speak with Rasho.","Speak with Lyse.","Gather information around Onokoro.","Speak with Alisaie."],"dialogue":[{"name":"LYSE","text":"...There's no mistaking that design. It has to be them."},{"name":"ALISAIE","text":"It would seem we have found a Confederate settlement─mayhap even their headquarters, judging by the size of the place."},{"name":"ALISAIE","text":"So Gosetsu bade us seek out the <span class=\"emphasis\">Confederacy</span> for aid and succor. The selfsame Confederacy that refuses to openly oppose the Empire."},{"name":"ALISAIE","text":"...Well, nothing ventured, nothing gained, I suppose... At the very least, they're unlikely to ask us for the tithe."},{"name":"LYSE","text":"Look who I've found!"},{"name":"ALISAIE","text":"This should make things easier."},{"name":"TANSUI","text":"What wind brings you hither, of all places? Were you not bound for Othard's shores?"},{"name":"TANSUI","text":"...I see. I trust you have not forgotten our previous conversation on the subject? No? Then what do you want, a second opinion? Very well."},{"name":"TANSUI","text":"Come with me. I will take you to the captain─Rasho."},{"name":"ALISAIE","text":"...Just like that? An audience with their leader? How very accommodating. We must needs choose our words carefully."},{"name":"LYSE","text":"You leave it to me! I've always been good with people. And this will also give me a chance to use the eastern greeting they showed me in Revenant's Toll!"},{"name":"LYSE","text":"Um... On second thought, maybe I shouldn't be the one to do this..."},{"name":"ALISAIE","text":"It's never this simple. Not with pirates. And if they're anything like Carvallain, then may the gods have mercy on us all."},{"name":"TANSUI","text":"There he is, then. Our illustrious leader. Speak. No need to be shy."},{"name":"LYSE","text":"Greetings! Y-You must be Rasho, leader of the Confederacy and...so on... I realize this is all a bit sudden, but...the thing is...we have a little favor to ask..."},{"name":"LYSE","text":"...Oh gods, I've probably broken half a dozen rules of Far Eastern etiquette already... Well, I'm sorry about that, but you have to understand that we're in a hurry, so...I'm going to stop talking now."},{"name":"RASHO","text":"...Men who revere manners and tradition can be found the world over. But not here."},{"name":"RASHO","text":"Your candor is appreciated. Speak your heart."},{"name":"RASHO","text":"...Gosetsu. A former leader of the rebellion. Aye, I know of him."},{"name":"RASHO","text":"Why he bade you petition us for aid and succor, however, I know not."},{"name":"TANSUI","text":"At the risk of repeating myself, to join the Confederacy is to renounce all other ties. We are beholden to none─allied with none."},{"name":"TANSUI","text":"When Doma was invaded by the Empire twenty-five years ago, we did not rush to her defense. Knowing this, do you honestly expect us to help you drive the imperial forces out of Isari?"},{"name":"TANSUI","text":"The Garleans have long maintained a presence in this region, and we would be fools to break the peace, fragile as it is. Besides, you are capable warriors, yes? With guile and preparation, you can surely resolve this matter yourselves."},{"name":"ALISAIE","text":"It is imperative that our presence here remain secret for as long as possible. For us to openly engage the imperials at this time would endanger everything we have come here to achieve!"},{"name":"RASHO","text":"You have told us why you cannot fight. Not why we should fight in your stead."},{"name":"RASHO","text":"If you would speak to me of lives saved, I would speak to you of slaughter. How many will die when all pretense is lost and the Garleans declare war on the Confederacy?"},{"name":"RASHO","text":"...Hate is a luxury we cannot afford.<br>You are free to come and go as you please, but you will receive no further aid."},{"name":"ALISAIE","text":"Thank you for your hospitality. If you would excuse us."},{"name":"ALISAIE","text":"I wish I could say I'm surprised, but I'm not..."},{"name":"TANSUI","text":"The captain's word is final. Can't say I didn't warn you."},{"name":"RASHO","text":"All ties that bind a man must be renounced, without exception, if he is to find a place here. Former lovers and bitter enemies alike must learn to bury their past and work side by side, or else be cast out."},{"name":"RASHO","text":"...No matter how deep a man's hatreds may run, he cannot let them dictate his actions. The good of the Confederacy takes precedence over all."},{"name":"LYSE","text":"Hey, <span class=\"highlight\">Forename</span>... I know that didn't go well, but I'm not prepared to give up on them yet."},{"name":"LYSE","text":"Gosetsu told us to come here for a reason. He must have believed we could convince them to help us... We just have to work out how."},{"name":"ALISAIE","text":"My thoughts exactly. I'm glad to hear we're of the same mind."},{"name":"ALISAIE","text":"'Tis little wonder they refused─we have done naught to persuade them. The real work begins now."},{"name":"ALISAIE","text":"We need to learn more about the Confederacy─what their needs and weaknesses are. Once we know that, we will know how to earn their trust."},{"name":"ALISAIE","text":"Such unusual designs. Unlike the standards of most nations and organizations, they have chosen to incorporate a variety of symbols. A testament to their diverse heritage?"},{"name":"LYSE","text":"They've got plenty to eat, by the look of it, though it's mostly the same stuff. I wonder if they trade much with outsiders..."},{"name":"SYSTEM","text":"The arms and armor have been piled up haphazardly. They display no signs of recent use or maintenance..."},{"name":"SYSTEM","text":"A number of crates and barrels have been stored here. On closer inspection, however, most are empty..."},{"name":"NAWASHIRO","text":"Hm? Taken an interest in the ship? Heh, good eye! She's not much to look at now, but once upon a time, she was a beauty!"},{"name":"NAWASHIRO","text":"The Confederacy favors flotillas of smaller ships to capture and board errant vessels. The larger ones, like this sekibune, only take part in major engagements."},{"name":"NAWASHIRO","text":"...Not that we've had any of those recently, what with those imperial bastards throwing their weight around. If it wasn't for them... Well, no use moaning about what you can't change, eh?"},{"name":"NAWASHIRO","text":"She's less a ship and more a storehouse these days. What a waste..."},{"name":"ALISAIE","text":"Had a good look around? Then we just need to wait for Lyse."},{"name":"LYSE","text":"Sorry to keep you waiting, but I wanted to talk to as many people as I could..."},{"name":"LYSE","text":"It's just as Tansui said. They have no intention of standing up to Yotsuyu."},{"name":"LYSE","text":"I don't know if you two got a different impression..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Under the right circumstances, they might help us."},{"name":"A1","text":"I think the situation is coming to a head."},{"name":"ALISAIE","text":"I agree. It's obvious that they are struggling to survive, and that they blame the imperials for their recent troubles."},{"name":"ALISAIE","text":"Even if we do nothing, it is inevitable that they will come into conflict with the Empire sooner or later─and deep down, they all know it."},{"name":"ALISAIE","text":"The only thing holding them back at the moment is the belief that they lack the strength to survive the coming war."},{"name":"LYSE","text":"So we need to prove to them that we're not all talk─that we can be valuable allies in the fight!"},{"name":"ALISAIE","text":"And what better way to demonstrate our worth than by...seeking out people with mundane problems and offering them our expert assistance?"},{"name":"LYSE","text":"Wouldn't be the first time we've had to earn someone's trust by helping them out with this and that. And you know it won't be the last."},{"name":"LYSE","text":"I'll look around the western end of Onokoro. You two take the east. Good luck!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Eastern Bow</span>!"}],"reward":{"gil":829,"emote":"Eastern Bow","items":[{"id":18207,"one":1,"hq":1},{"id":18213,"one":1,"hq":1},{"id":18219,"one":1,"hq":1},{"id":18231,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":183600},"reqs":{"jobs":[{"lvl":62,"id":142}],"quests":[68015]},"next":[68215,68217,68489]},"partials":[{"type":"npc","id":"1019929","obj":{"i":1019929,"n":"Alisaie","l":2409,"q":2}},{"type":"npc","id":"1019939","obj":{"i":1019939,"n":"Alisaie","l":2409,"q":2}},{"type":"npc","id":"1019930","obj":{"i":1019930,"n":"Lyse","l":2409,"q":2}},{"type":"npc","id":"1019931","obj":{"i":1019931,"n":"Tansui","l":2409,"q":1}},{"type":"npc","id":"1019932","obj":{"i":1019932,"n":"Alisaie","l":2409,"q":1}},{"type":"npc","id":"1019933","obj":{"i":1019933,"n":"Lyse","l":2409,"q":1}},{"type":"npc","id":"1019935","obj":{"i":1019935,"n":"Tansui","l":2409,"q":1}},{"type":"npc","id":"1019936","obj":{"i":1019936,"n":"Alisaie","l":2409,"q":2}},{"type":"npc","id":"1019937","obj":{"i":1019937,"n":"Lyse","l":2409,"q":2}},{"type":"npc","id":"1019938","obj":{"i":1019938,"n":"Lyse","l":2409,"q":2}},{"type":"npc","id":"1019940","obj":{"i":1019940,"n":"Lyse","l":2409,"q":1}},{"type":"npc","id":"1019941","obj":{"i":1019941,"n":"Alisaie","l":2409,"q":1}},{"type":"npc","id":"1021505","obj":{"i":1021505,"n":"Rasho","l":2409,"q":4}},{"type":"npc","id":"1021508","obj":{"i":1021508,"n":"Nawashiro","l":2409,"q":1}},{"type":"item","id":"18207","obj":{"i":18207,"n":"High Steel Gauntlets of Fending","l":265,"c":48670,"t":37,"p":20778}},{"type":"item","id":"18213","obj":{"i":18213,"n":"High Steel Gauntlets of Maiming","l":265,"c":48671,"t":37,"p":20778}},{"type":"item","id":"18219","obj":{"i":18219,"n":"Gyuki Leather Halfgloves of Striking","l":265,"c":44583,"t":37,"p":20778}},{"type":"item","id":"18231","obj":{"i":18231,"n":"Gyuki Leather Halfgloves of Scouting","l":265,"c":44584,"t":37,"p":20778}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68015","obj":{"i":68015,"n":"To Bend with the Wind","g":6,"l":"The Ruby Sea","s":340}},{"type":"quest","id":"68215","obj":{"i":68215,"n":"The Last Voyage","g":6,"l":"The Ruby Sea","s":357}},{"type":"quest","id":"68217","obj":{"i":68217,"n":"The Solace of the Sea","g":6,"l":"The Ruby Sea","s":353}},{"type":"quest","id":"68489","obj":{"i":68489,"n":"The Arrows of Misfortune","g":6,"l":"The Ruby Sea","s":355}}]}