{"quest":{"name":"Making the Catfish Sing","location":"Kugane","id":68011,"patch":4.0,"sort":300,"eventIcon":71201,"issuer":1020476,"target":1020483,"involved":[1020464,1020465,1020466,1020467,1020468,1020477,1020478,1020479,1020480,1020481,1020482,1020489,1020490],"genre":6,"journal":["Lyse would like to ask Gyodo a few questions...","Speak with Hancock.","Follow Hancock to the Sekiseigumi Barracks.","Wait outside the barracks.","Continue waiting outside the barracks.","Speak with Lyse."],"objectives":["Speak with Hancock.","Follow Hancock to the Sekiseigumi Barracks.","Wait outside the barracks.","Continue waiting outside the barracks.","Speak with Lyse."],"dialogue":[{"name":"ALPHINAUD","text":"All things considered, that went rather well. Thanks to Soroban, that is."},{"name":"SOROBAN","text":"Though we Kojin are of the sea, we often come ashore to sell our wares and peruse your markets. It is my hope that an arrangement with the East Aldenard Trading Company will help us to more quickly obtain the treasures that we seek."},{"name":"HANCOCK","text":"You are doubtless wondering why our objectively <span class=\"emphasis\">green</span>-hued friend here refers to himself as a Kojin of the Blue. The answer is quite fascinating, really. The Kojin language has many similarities with ancient Hingan, you see, and in ancient Hingan, the word for green, “ao,” can mean green and or blue─though I do the word a disservice by even attempting to translate it, so steeped in meaning as it is. Why they elected to keep on calling themselves the “blue” in modern times is anyone's guess─I for one would have much preferred “Kojin of the Ao”─but one theory posits that they prefer the sound of the word “blue” when spoken. Another is that they are physically incapable of distinguishing between the two, which would have interesting implications in their everyday lives..."},{"name":"ALISAIE","text":"There's no denying that they were imperials. They were wearing the same uniforms as the ones outside the consulate."},{"name":"LYSE","text":"Right, then. Gyodo should be coming round soon."},{"name":"LYSE","text":"I think it's time we had a little chat, don't you?"},{"name":"LYSE","text":"Rise and shine, little fishy. I know you can hear me, so stop pretending to be asleep or I'll give you another ride on my boot."},{"name":"GYODO","text":"...No! No, no, no more boots! All my secrets are yours for the asking!"},{"name":"LYSE","text":"Tell us what you know about Yugiri and Gosetsu. Every last detail."},{"name":"LYSE","text":"And if I find out later that you lied to me─"},{"name":"GYODO","text":"No, no, no more lies! The clear, unvarnished truth! You have my word!"},{"name":"GYODO","text":"Only the samurai did I meet. Yes, yes, only him! He asked after a ship, so I provided an introduction to...to the Garleans..."},{"name":"ALISAIE","text":"You mean you led him into a trap, as you did us. Because you are an imperial spy."},{"name":"GYODO","text":"No, no, I am no spy! It was just business! Fewer ships pass through Kugane these days, and we have struggled to make ends meet..."},{"name":"GYODO","text":"So when the Garleans offered a bounty for any Domans found in Kugane─"},{"name":"ALISAIE","text":"Oh, my mistake! You're not a spy, but a common cutthroat! Not that I'm surprised─you need half a brain to be a spy. So what happened to the samurai?"},{"name":"GYODO","text":"Such a cruel, vicious tongue you have...<br>He would not go quietly, no, no. Blades were drawn, men were cut down, and the Sekiseigumi came. They took the samurai away."},{"name":"HANCOCK","text":"Hold on a moment! You mean to tell me the ijin they arrested the other day was <span class=\"emphasis\">Gosetsu</span>?"},{"name":"HANCOCK","text":"Oh, had I but known! If he is in the custody of the Sekiseigumi, I need only see to it that the requisite funds find their way into the right official's hands, and your friend will walk free."},{"name":"ALPHINAUD","text":"As it is in Ul'dah, so it is in Kugane...but given the circumstances, it seems we have no choice but to resort to morally questionable means."},{"name":"HANCOCK","text":"We'll make a pragmatist of you yet, Master Alphinaud!"},{"name":"ALPHINAUD","text":"(One of these days, I may just punch that man in the face...)"},{"name":"GYODO","text":"I have given you everything that you have asked for, yes, yes? Then there is no need for me to remain your prisoner?"},{"name":"LYSE","text":"I hope I never have to carry a Namazu again. He's not heavy, but gods, the smell..."},{"name":"ALISAIE","text":"I'm glad we finally learned what happened to him, but did we really need to stir up all that trouble to do so?"},{"name":"SOROBAN","text":"I have never laid eyes upon the sacred treasures of Eorzea. My heart fair trembles with excitement at the thought!"},{"name":"TATARU","text":"Hmm...I didn't think to include “bribes” when I was calculating our budget for this trip."},{"name":"HANCOCK","text":"You are free to wait here while I speak with the relevant official, but if you would rather wait for Gosetsu outside the barracks, we can go together."},{"name":"ALISAIE","text":"I wouldn't put it past the imperials to try something again, so mayhap it would be best if Lyse, <span class=\"highlight\">Forename</span>, and I joined you."},{"name":"LYSE","text":"All right, but what about Gyodo?"},{"name":"ALPHINAUD","text":"I will keep an eye on him for the time being. We can release him after you return with Gosetsu. He will doubtless have some choice words to say to the little fellow. Soroban─mayhap it would be prudent to prepare your ship for our immediate departure."},{"name":"SOROBAN","text":"As you wish!"},{"name":"HANCOCK","text":"Everything is in order? Then let us be off. The Sekiseigumi Barracks are to the north."},{"name":"ALPHINAUD","text":"You need not worry. I swear I will not let him out of my sight. In fact, I may have some more questions of my own..."},{"name":"GYODO","text":"No more lies, no more betrayals! Yes, yes, I swear by all the kami in creation!"},{"name":"TATARU","text":"Talking tortoises, talking catfish... I tell you, though─it's when the <span class=\"emphasis\">bears</span> start talking that you need to worry. That, my friend, spells the end of civilization as we know it!"},{"name":"LYSE","text":"This looks a bit fancy for a barracks, don't you think?"},{"name":"ALISAIE","text":"I hope Hancock is as good as his word..."},{"name":"HANCOCK","text":"I must ask that you wait here. You may be assured that this will not take long."},{"name":"LYSE","text":"...Is it really going to be as simple as he says, do you think?"},{"name":"LYSE","text":"...He said it wouldn't take long, right? Because this feels a bit long to me."},{"name":"ALISAIE","text":"Calm down, Lyse. Everything is going to be all right. Much as I hate to admit it, I share Hancock's dim view of government officials and their supposed incorruptibility."},{"name":"ALISAIE","text":"From what I've gleaned of the Far East, they're probably exchanging lengthy pleasantries. There seems to be a correct way to do everything here, bribery being no exception. I say we leave them to it. Right, <span class=\"highlight\">Forename</span>?"},{"name":"LYSE","text":"Right, right. Everything's fine. Probably. I mean, it couldn't be as bad as the last time we stood around waiting for something to happen..."}],"reward":{"gil":885,"items":[{"id":18069,"one":1,"hq":1},{"id":18081,"one":1,"hq":1},{"id":18087,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":175500},"reqs":{"jobs":[{"lvl":61,"id":142}],"quests":[68010]},"next":[68012,68206,68207,68208]},"partials":[{"type":"npc","id":"1020476","obj":{"i":1020476,"n":"Lyse","l":2404,"q":3}},{"type":"npc","id":"1020483","obj":{"i":1020483,"n":"Lyse","l":2404,"q":2}},{"type":"npc","id":"1020464","obj":{"i":1020464,"n":"Hancock","l":2927,"q":5}},{"type":"npc","id":"1020465","obj":{"i":1020465,"n":"Alphinaud","l":2927,"q":6}},{"type":"npc","id":"1020466","obj":{"i":1020466,"n":"Tataru","l":2927,"q":5}},{"type":"npc","id":"1020467","obj":{"i":1020467,"n":"Lyse","l":2927,"q":4}},{"type":"npc","id":"1020468","obj":{"i":1020468,"n":"Alisaie","l":2927,"q":4}},{"type":"npc","id":"1020477","obj":{"i":1020477,"n":"Alphinaud","l":2404,"q":3}},{"type":"npc","id":"1020478","obj":{"i":1020478,"n":"Alisaie","l":2404,"q":3}},{"type":"npc","id":"1020479","obj":{"i":1020479,"n":"Soroban","l":2404,"q":2}},{"type":"npc","id":"1020480","obj":{"i":1020480,"n":"Hancock","l":2404,"q":3}},{"type":"npc","id":"1020481","obj":{"i":1020481,"n":"Hancock","l":2404,"q":2}},{"type":"npc","id":"1020482","obj":{"i":1020482,"n":"Alisaie","l":2404,"q":2}},{"type":"npc","id":"1020489","obj":{"i":1020489,"n":"Soroban","l":2927,"q":1}},{"type":"npc","id":"1020490","obj":{"i":1020490,"n":"Gyodo","l":2927,"q":2}},{"type":"item","id":"18069","obj":{"i":18069,"n":"Gaganaskin Gloves of Aiming","l":255,"c":44598,"t":37,"p":19994}},{"type":"item","id":"18081","obj":{"i":18081,"n":"Koppranickel Armlets of Healing","l":255,"c":44596,"t":37,"p":19994}},{"type":"item","id":"18087","obj":{"i":18087,"n":"Koppranickel Armlets of Casting","l":255,"c":44595,"t":37,"p":19994}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68010","obj":{"i":68010,"n":"It's Probably a Trap","g":6,"l":"Kugane","s":290}},{"type":"quest","id":"68012","obj":{"i":68012,"n":"Once More, to the Ruby Sea","g":6,"l":"Kugane","s":310}},{"type":"quest","id":"68206","obj":{"i":68206,"n":"Where the Wild Pandas Are","g":107,"l":"Kugane","s":1060}},{"type":"quest","id":"68207","obj":{"i":68207,"n":"A Bleak Diagnosis","g":107,"l":"Kugane","s":1070}},{"type":"quest","id":"68208","obj":{"i":68208,"n":"To Bathe a Garlean","g":107,"l":"Kugane","s":1080}}]}