{"quest":{"name":"Once More, to the Ruby Sea","location":"Kugane","id":68012,"patch":4.0,"sort":310,"icon":100647,"eventIcon":71201,"issuer":1020484,"target":1019891,"involved":[1019888,1019889,1019890,1020451,1020452,1020464,1020465,1020466,1020481,1020482,1020483,1020485,1020488,1020490,1020491],"genre":6,"journal":["For a man who has just defeated ten samurai in a row, Gosetsu is looking rather sheepish...","Though Gosetsu ran afoul of the local peacekeepers in Kugane, he managed to win his freedom through a contest of strength mere moments before you and the others arrived to rescue him. Reunited at last, you inform your Doman comrade that you have found a captain willing to take you all across the Ruby Sea, but elect to save the details until you have returned to the Ruby Bazaar.","In the offices of the East Aldenard Trading Company, Gosetsu reveals that he and Yugiri parted ways some while ago, hoping to improve their chances of finding Lord Hien, the missing heir to the Doman throne. Even after it became clear that the rebellion was doomed, it would seem the young lord resolved to remain and fight on with Gosetsu at his side. Alas, in the ensuing chaos, the two became separated, and the samurai knows not what became of his master─only that he somehow survived, and that the Empire still seeks to make an example of him. Alphinaud then explains your purpose in coming to the Far East, and Gosetsu is overjoyed at the prospect of returning to Othard with new allies. Yet it would not be prudent for all to continue onwards, and so it is decided that Tataru and Alphinaud will remain, while you, Lyse, Alisaie, and Gosetsu go to meet Soroban at the docks.","Soroban has already seen to the necessary preparations in your absence, and is ready to depart Kugane whenever you and the others are.","Before you lies the vast expanse of the Ruby Sea, so named for the shade of crimson it turns with the morning sun. From the Ruby Price, the first line of defense for the port of Kugane, you can just make out the shape of Othard on the horizon, your final destination...","Soroban bids you bask in the glory and splendor that is the Ruby Sea. But before you can proceed further, certain customs must be observed..."],"objectives":["Return to the Ruby Bazaar.","Rendezvous with Soroban at Pier #2.","Speak with Soroban."],"dialogue":[{"name":"ALPHINAUD","text":"Leave Gyodo with me. I have a mind to ask him a few more questions. If nothing else, it will be interesting to see how cooperative he feels in the absence of Lyse's boot."},{"name":"GYODO","text":"No more lies, no more betrayals! Yes, yes, I swear by all the kami in creation!"},{"name":"LYSE","text":"To be honest, I wish I had seen that fight."},{"name":"ALISAIE","text":"Just when I think I've heard everything..."},{"name":"HANCOCK","text":"'Twas not for naught, at least. Our friend in the Sekiseigumi is willing to consider this an investment of sorts─a payment against future misunderstandings."},{"name":"SEKISHINTAISOLDIER","text":"'Tis rare indeed to have the opportunity to study the swordsmanship of a master, much less spar with him!"},{"name":"GOSETSU","text":"I must apologize. That you endured such trials and tribulations in search of me─"},{"name":"ALISAIE","text":"There's no need for that. You had no way of knowing we would come looking for you."},{"name":"ALISAIE","text":"You were after a ship to take you to Doma, yes? It just so happens we have found a willing captain."},{"name":"GOSETSU","text":"Truly? What fortune!"},{"name":"ALISAIE","text":"We will tell you all about it back at the company offices. Alphinaud and Tataru are waiting for us there."},{"name":"ALPHINAUD","text":"Gosetsu! Thank the Twelve you are unharmed!"},{"name":"GOSETSU","text":"As you can see, Master Alphinaud, I am the very picture of health!"},{"name":"GOSETSU","text":"You! Vile fiend! Malevolent trickster! How kind the kami are to grant me vengeance so soon. But first, I demand you return the coin you so villainously embezzled from me!"},{"name":"GYODO","text":"Y-You have every right to be angry, good sir! Gladly would I return to you your coin...had I not been forced to repay certain gambling debts beforehand..."},{"name":"ALPHINAUD","text":"Setting that matter aside for the moment─where is Lady Yugiri? Was she not traveling with you?"},{"name":"GOSETSU","text":"For a time, aye, but we parted ways some while ago, the better to improve our chances of finding Lord Hien."},{"name":"LYSE","text":"Lord Hien?"},{"name":"GOSETSU","text":"Forgive me, I have yet to explain. Lord Hien is the heir to Doma's throne, and our master."},{"name":"GOSETSU","text":"His was a passionate voice for the cause of Doman liberation, and when we learned of the Emperor's death, it only grew louder..."},{"name":"ALPHINAUD","text":"So you seized upon the opportunity and rose up to reclaim your freedom...only for your hopes to be dashed when Zenos led his army unto your lands."},{"name":"GOSETSU","text":"The crown prince was a merciless foe. Against him and the might of the XIIth, we had no chance."},{"name":"GOSETSU","text":"Once Lord Hien understood this, he bade Yugiri take to the sea with as many of our people as possible. He, however, would stand and fight, that they might have more time to escape..."},{"name":"GOSETSU","text":"I remained by his side as well, and together we carried on our doomed war. And then, one day, in a fierce battle, we were separated. I knew not what became of him─only that he was beyond the Empire's reach, and that to find him, I would need Yugiri's aid."},{"name":"GOSETSU","text":"The situation grows more perilous by the day, for the new viceroy, Yotsuyu, is a black-hearted villainess who delights in the torment of our people. There is naught she would not do to further her pursuit of Lord Hien."},{"name":"ALPHINAUD","text":"Thank you. I believe that makes matters a good deal clearer."},{"name":"ALPHINAUD","text":"It should please you to learn that we are come to aid the Doman Liberation Front in resuming their efforts to overthrow their imperial oppressors."},{"name":"GOSETSU","text":"Then allow me to join you! My inquiries here bore no fruit, hence my desire to return to Othard."},{"name":"GOSETSU","text":"Once there, I can lead you to our headquarters in Yanxia, where we shall all be reunited with Yugiri!"},{"name":"ALISAIE","text":"Mayhap not all. Alphinaud's talents would seem better applied here in Kugane, working closely with Tataru and Hancock to feed us intelligence. There is a Garlean embassy just down the road, after all─"},{"name":"ALPHINAUD","text":"While I appreciate the vote of confidence, I should be glad to accompany you all─"},{"name":"ALISAIE","text":"As a soldier in the field, so to speak? Come now, Brother, a competent commander assigns his soldiers the tasks best suited to them─as you of all people should know. And you are so very good at espionage and intrigue."},{"name":"ALPHINAUD","text":"\"...For we all must serve, each in our own way.“ Very well. It would seem my place is here."},{"name":"TATARU","text":"Soroban is waiting at the pier. Have fun, you lot!"},{"name":"ALPHINAUD","text":"Just because an individual excels at a particular task does not mean he should be obliged to do it over and over and over again..."},{"name":"GYODO","text":"Um... How much longer do you intend to keep me here? I have given my full cooperation, yes, yes?"},{"name":"HANCOCK","text":"Like the compensation given to the Sekiseigumi, the company considers our aid to you and yours an investment. We look forward to establishing ties with any fledgling governments that may be formed in the aftermath of a successful revolution."},{"name":"TATARU","text":"What are you waiting around here for, <span class=\"highlight\">Forename</span>? Don't you have places to be? Off you trot!"},{"name":"LYSE","text":"This one's smaller than the <span class=\"emphasis\">Misery</span>. A <span class=\"emphasis\">lot</span> smaller."},{"name":"ALISAIE","text":"I know Alphinaud can hold his own in a fight, but he is plainly better suited to more cerebral tasks. Surely I'm not alone in thinking that?"},{"name":"GOSETSU","text":"Ah, a Kojin captain! A fine choice. Only Confederate sailors rival their knowledge and skill."},{"name":"SOROBAN","text":"I have been waiting for you, my friends. All preparations have been completed, and my ship awaits its passengers."},{"name":"SOROBAN","text":"Shall we depart without further delay?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"After you, my shelled friend!"},{"name":"A1","text":"Uhhh...hold that thought!"},{"name":"SOROBAN","text":"If you insist! With me, everyone! The Ruby Sea awaits!"},{"name":"LYSE","text":"Somewhere out there, across the water, is Yugiri and Gosetsu's homeland..."},{"name":"ALISAIE","text":"Woe betide any enemy foolish enough to attack by sea.<br>Now, if the Garleans were to bring their <span class=\"emphasis\">airships</span>, on the other hand..."},{"name":"GOSETSU","text":"The Hingans built this island as a bulwark against invasion, and filled it with enough cannons to sink an armada."},{"name":"SOROBAN","text":"How wide and beautiful she is, the Ruby Sea! Filled with promise and adventure and treasures─many wonderful treasures!"}],"reward":{"gil":829,"xp":183600},"reqs":{"jobs":[{"lvl":62,"id":142}],"quests":[68011]},"next":[68013]},"partials":[{"type":"npc","id":"1020484","obj":{"i":1020484,"n":"Gosetsu","l":2404,"q":1}},{"type":"npc","id":"1019891","obj":{"i":1019891,"n":"Soroban","l":2409,"q":2}},{"type":"npc","id":"1019888","obj":{"i":1019888,"n":"Lyse","l":2409,"q":2}},{"type":"npc","id":"1019889","obj":{"i":1019889,"n":"Alisaie","l":2409,"q":2}},{"type":"npc","id":"1019890","obj":{"i":1019890,"n":"Gosetsu","l":2409,"q":2}},{"type":"npc","id":"1020451","obj":{"i":1020451,"n":"Alisaie","l":2404,"q":4}},{"type":"npc","id":"1020452","obj":{"i":1020452,"n":"Lyse","l":2404,"q":3}},{"type":"npc","id":"1020464","obj":{"i":1020464,"n":"Hancock","l":2927,"q":5}},{"type":"npc","id":"1020465","obj":{"i":1020465,"n":"Alphinaud","l":2927,"q":6}},{"type":"npc","id":"1020466","obj":{"i":1020466,"n":"Tataru","l":2927,"q":5}},{"type":"npc","id":"1020481","obj":{"i":1020481,"n":"Hancock","l":2404,"q":2}},{"type":"npc","id":"1020482","obj":{"i":1020482,"n":"Alisaie","l":2404,"q":2}},{"type":"npc","id":"1020483","obj":{"i":1020483,"n":"Lyse","l":2404,"q":2}},{"type":"npc","id":"1020485","obj":{"i":1020485,"n":"Soroban","l":2404,"q":1}},{"type":"npc","id":"1020488","obj":{"i":1020488,"n":"Gosetsu","l":2404,"q":1}},{"type":"npc","id":"1020490","obj":{"i":1020490,"n":"Gyodo","l":2927,"q":2}},{"type":"npc","id":"1020491","obj":{"i":1020491,"n":"Sekiseigumi Blade","l":2404,"q":1}},{"type":"quest","id":"68011","obj":{"i":68011,"n":"Making the Catfish Sing","g":6,"l":"Kugane","s":300}},{"type":"quest","id":"68013","obj":{"i":68013,"n":"Open Water","g":6,"l":"The Ruby Sea","s":320}}]}