{"quest":{"name":"The Stubborn Remainder","location":"Yanxia","id":68029,"patch":4.0,"sort":490,"eventIcon":71201,"issuer":1020011,"target":1020012,"involved":[1019259,1019263,1020010,1020013,1020015,1020017,1022719],"genre":6,"journal":["Yugiri would like to have a word with you."],"objectives":["Follow Yugiri to Namai Village.","Gather information in Namai Village.","Speak with Yugiri."],"dialogue":[{"name":"LYSE","text":"If it's strength we need, then it's strength we'll get. We can't lose to him again..."},{"name":"RESISTANCE02492","text":"To think that warriors such as you journeyed across the seas to aid our cause... We cannot thank you enough!"},{"name":"YUGIRI","text":"Now then, I should be glad to discuss our next course of action─"},{"name":"YUGIRI","text":"Though now that I think on it, I myself have been away from Doma for some time, and even after my return, the search for Lord Hien commanded my full attention..."},{"name":"YUGIRI","text":"Mayhap it would be to both our benefit if we were to see the reality of Doma for ourselves. For did my lord not bid me learn the truth of her heart?"},{"name":"YUGIRI","text":"Let us do this together, <span class=\"highlight\">Forename</span>. Let us go among the people and with our own eyes bear witness to their hardship."},{"name":"YUGIRI","text":"As a foreigner in these lands, your reputation does not precede you. Moreover, unlike Gosetsu, I can accompany you without attracting unwanted attention."},{"name":"LYSE","text":"I'd like to join you, if that's all right."},{"name":"YUGIRI","text":"By all means. We should be glad of your company, and your perspective."},{"name":"YUGIRI","text":"Namai is not far. I say we begin there."},{"name":"LYSE","text":"Yugiri told me to wear this outfit. My legs haven't felt this light and airy in ages!"},{"name":"YUGIRI","text":"Ah, <span class=\"highlight\">Forename</span>. I am glad to see that you too put thought into your garments given the covert nature of our activities."},{"name":"YUGIRI","text":"Hm? I should think my reasons obvious. To enter the village while wearing the garb of the shinobi would be beyond reckless<span class=\"alternative-container\"><span class=\"alternative\">─though you may tempt fate, if that is your wont...</span><span class=\"alternative\">.</span></span>"},{"name":"YUGIRI","text":"We shall pose as traveling merchants─<span class=\"highlight\">Forename</span> as our leader, and we as <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> assistants. Are there any objections?"},{"name":"LYSE","text":"I'm not really the merchant type, but if you think this is the best way to go about it, I'll trust you."},{"name":"YUGIRI","text":"Then without further ado, let us begin."},{"name":"CHIGUSA","text":"You? A merchant? Forgive me my skepticism, but you strike me less a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of commerce and more a common sellsword."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Give your best impression of Hancock."},{"name":"A1","text":"Give your best smile."},{"name":"CHIGUSA","text":"That does little to assuage my doubts, and if anything makes me clutch my coinpurse tighter..."},{"name":"CHIGUSA","text":"I stand corrected! Such a warm and cordial nature you possess. I pray you forgive me my earlier rudeness."},{"name":"CHIGUSA","text":"It has been some time since the viceroy came to our village to purge it of insurgents. Those who resisted suffered terribly, and those who did not fared little better."},{"name":"CHIGUSA","text":"We who remain know better than to risk her ire. If the imperials demand laborers, we comply. If they demand conscripts to send as soldiers to other provinces, we obey."},{"name":"CHIGUSA","text":"Ours is a difficult life, with little in the way of luxuries. I know not what you sell, merchant, but I doubt that I─nor anyone else here─can afford it."},{"name":"CHIGUSA","text":"My apologies, merchant, but you will find no custom here."},{"name":"MIYAMA","text":"Foreign peddlers? In Namai? Whatever it is you sell, I have no money to buy. Perhaps you should go elsewhere."},{"name":"MIYAMA","text":"Saying that, I know of no village in Yanxia that has fared any better. Once, I would have directed you to the samurai lords of Monzen─had they not all died in battle or in the purges."},{"name":"MIYAMA","text":"There is the Doman Enclave, of course, but that lies beyond the Dairyu Moon Gates. Needless to say, the imperials are disinclined to let any but their own pass."},{"name":"MIYAMA","text":"You cannot pass through the Moon Gates without the blessing of the imperials. In other words, you will not pass through the Moon Gates."},{"name":"HONAMI","text":"Weren't you the one who came with the general? No? Hmm. I see... My mistake."},{"name":"HONAMI","text":"It warms my heart to see traveling merchants in Namai again. Though the imperials never sealed our borders, folks like you have taken to avoiding Yanxia ever since the rebellion."},{"name":"HONAMI","text":"Unfortunately, that has only made it harder for us to survive. You may have noticed, but we lack for a great many things. It was not much better before, true, but it has only gotten worse..."},{"name":"HONAMI","text":"What are you selling? I have a few koban stashed away, if you will accept them.<br>...What is wrong? Why do you hesitate? You are a merchant, are you not?"},{"name":"MASATSUCHI","text":"A traveling merchant? With meat, perchance? Bah, better not to know when I have so little coin."},{"name":"MASATSUCHI","text":"...I feel your eyes upon me. You know not the Lupin? Surely you have not been long in Yanxia, else you would."},{"name":"MASATSUCHI","text":"For generations we served the lords of Doma, compassionate and wise as they were...but the memories of such times fade with every passing day. As others will tell you."},{"name":"MASATSUCHI","text":"If I may, would you be so kind as to spare... No, never mind."},{"name":"LYSE","text":"I've seen these looks before. That same weary hopelessness. It's just like Ala Gannha..."},{"name":"YUGIRI","text":"<span class=\"highlight\">Forename</span>. What have you learned?"},{"name":"YUGIRI","text":"Lyse and I encountered much of the same. They have been pushed beyond the brink."},{"name":"YUGIRI","text":"I expected frustration and disillusionment, but not so much that they would come to question the wisdom of opposing imperial rule in the first place..."},{"name":"YUGIRI","text":"Unless we can convince them otherwise, I fear I cannot convince Lord Hien to return, and without him..."}],"reward":{"gil":676,"xp":199800},"reqs":{"jobs":[{"lvl":64,"id":142}],"quests":[68470]},"next":[68030,68260,68261,68264,68265]},"partials":[{"type":"npc","id":"1020011","obj":{"i":1020011,"n":"Yugiri","l":2805,"q":2}},{"type":"npc","id":"1020012","obj":{"i":1020012,"n":"Yugiri","l":2410,"q":2}},{"type":"npc","id":"1019259","obj":{"i":1019259,"n":"Masatsuchi","l":2410,"q":2}},{"type":"npc","id":"1019263","obj":{"i":1019263,"n":"Honami","l":2410,"q":2}},{"type":"npc","id":"1020010","obj":{"i":1020010,"n":"Lyse","l":2805,"q":2}},{"type":"npc","id":"1020013","obj":{"i":1020013,"n":"Lyse","l":2410,"q":2}},{"type":"npc","id":"1020015","obj":{"i":1020015,"n":"Miyama","l":2410,"q":1}},{"type":"npc","id":"1020017","obj":{"i":1020017,"n":"Liberation Front Infantry","l":2805,"q":2}},{"type":"npc","id":"1022719","obj":{"i":1022719,"n":"Chigusa","l":2410,"q":1}},{"type":"quest","id":"68470","obj":{"i":68470,"n":"A Glimpse of Madness","g":6,"l":"Yanxia","s":480}},{"type":"quest","id":"68030","obj":{"i":68030,"n":"The Ones We Leave Behind","g":6,"l":"Yanxia","s":500}},{"type":"quest","id":"68260","obj":{"i":68260,"n":"Something Smells","g":109,"l":"Yanxia","s":4010,"f":1}},{"type":"quest","id":"68261","obj":{"i":68261,"n":"Beyond the Powers of Stone","g":109,"l":"Yanxia","s":4020}},{"type":"quest","id":"68264","obj":{"i":68264,"n":"Fly, My Pretties","g":109,"l":"Yanxia","s":4030,"f":1}},{"type":"quest","id":"68265","obj":{"i":68265,"n":"The Toon Patrol","g":109,"l":"Yanxia","s":4040}}]}