{"quest":{"name":"The Lord of the Revel","location":"The Ruby Sea","id":68025,"patch":4.0,"sort":440,"icon":100649,"eventIcon":71201,"issuer":1019985,"target":1019988,"involved":[1019986,1019987,1019989,1019990,1019991,1019992],"genre":6,"journal":["Alisaie may not have the best plan, but she has the only one.","Your efforts to wreak havoc on the Isle of Zekki and draw the Red Kojin away from their imperial masters have exceeded all expectations. Unfortunately, for reasons beyond your knowing, two of the sacred treasures stored in the isle's vault “reacted” to the presence of the Yasakani–no–Magatama, summoning forth from the aether the great kami Susano─a primal by another name. Though you and your comrades initially fled to safety, it is plain that you cannot simply leave the kami be, and so Alisaie bids you return to the vault and do what you do best.","Before the vault door, you steel yourself for the impending confrontation. How fortunate that you had the wisdom and foresight to invite several of your fellow adventurers on this journey to the Far East, and how kind they were to agree to help you torment the Red Kojin, for no single warrior, no matter how blessed or powerful, could ever hope to slay a primal on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own, despite what some wandering minstrels would have you believe.<br><br>※The Pool of Tribute can be accessed via the Duty Finder.","The great kami is no more, and once again you part ways with your stalwart adventurer comrades, ever close at hand yet all too often forgotten. Alisaie and Lyse should not be hard to find─you need only listen for the sounds of battle.","You find your comrades still locked in combat with the Kojin of the Red. Alas, what the beastmen lack in individual strength they make up for in numbers. For each that falls, three emerge to fill the gap. Before you can join the fray, however, Alisaie steps forward, resolved to provide you and Lyse with an opening in which to escape. Grudgingly, you accept her invitation and depart for Isari, where it would seem the Confederacy have already begun their attack.","No sooner have you reached the beach south of Isari than Lyse declares her intention to return to the Isle of Zekki and help Alisaie. Though it was she who encouraged you to leave your young friend in the first place, the thought of losing another ally is more than she can bear...as is the shock of hearing Alisaie's voice coming from right behind her. Lyse whirls around and embraces the bemused girl, whose protests fall on deaf ears. Once all present have regained their composure, you press on to Isari.","Upon arriving in the village, you find no sign of the imperials, nor of any significant struggle. Did the Confederacy keep their end of the bargain, or did Yotsuyu and her men simply move on to the next settlement?"],"objectives":["Unlock the vault door.","Confront Susano in the Pool of Tribute.","Speak with Lyse."],"dialogue":[{"name":"LYSE","text":"We'll get through this, somehow! After all, we always do!"},{"name":"ALISAIE","text":"As before, our numbers limit our options. I wish I could claim to have a brilliant plan, but I don't─all I have is a desperate one."},{"name":"ALISAIE","text":"Lyse, you and I will do our best to draw the Kojin away from the primal. We'll lead them on a wild-dodo chase all over this isle."},{"name":"ALISAIE","text":"The rest of the plan, I'm afraid you can guess. I'm sorry, <span class=\"highlight\">Forename</span>, I truly am, but neither of us can even approach Susano, much less hope to defeat him. Which means you're on your own."},{"name":"LYSE","text":"Well, who knows? <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> does have an awful lot of adventurer friends. Maybe some of them decided to take a fishing trip to the Far East, and are surprisingly close by...?"},{"name":"ALISAIE","text":"Yes, and I speak fluent Hingan. Come on, there's no point putting this off!"},{"name":"VILLAGERA02489","text":"Ugh... My back, my back..."},{"name":"VILLAGERB02489","text":"Don't hurt me, please! I swear, I didn't do anything!"},{"name":"PIRATE02481","text":"Heh heh. Saw the smoke, did you?"},{"name":"LYSE","text":"I think we're safe. I didn't see any Kojin following us..."},{"name":"LYSE","text":"Wait here. I'm going back for Alisaie."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm coming with you."},{"name":"A1","text":"She stayed behind so we could escape..."},{"name":"LYSE","text":"No. Absolutely not."},{"name":"LYSE","text":"She stayed behind so that <span class=\"emphasis\">you</span> could escape. Even I know that."},{"name":"LYSE","text":"So that <span class=\"emphasis\">you</span> could escape, not me. And that was a mistake─I should've been the one to stay behind, not her."},{"name":"LYSE","text":"So I've got to go back. If we lose her...I'll never forgive myself."},{"name":"LYSE","text":"...I was the one who dragged you all into this. It was my fight, not yours. I knew that from the start, but I also knew I couldn't do it alone."},{"name":"LYSE","text":"But I've asked too much and let too much happen to you all. I have to make this right─and I have to do it on my own."},{"name":"LYSE","text":"So let me go, please. I'm asking you as a friend. I have to help her!"},{"name":"ALISAIE","text":"You can start by finding me a towel and some bandages. Brrr..."},{"name":"LYSE","text":"Alisaie!"},{"name":"ALISAIE","text":"What? Why are you looking at me like that? I said I was going to distract them, not make a heroic and ultimately futile last stand. Who does that, anyway?"},{"name":"ALISAIE","text":"For the love of─ This is stupid! You're embarrassing yourself! And me!"},{"name":"LYSE","text":"Shut up and let me have this."},{"name":"LYSE","text":"Right. That wasn't so bad, was it? Now then, we need to hurry back to Isari!"},{"name":"ALISAIE","text":"They didn't follow you, did they? I gave you enough time to escape?"},{"name":"ALISAIE","text":"Good to hear my selfless act of heroism achieved the desired effect. You needn't worry, by the way─I'm not intending to make a habit of this."},{"name":"LYSE","text":"I don't see any soldiers... Do you think the Confederacy drove them off?"}],"reward":{"gil":2863,"items":[{"id":18208,"one":1,"hq":1},{"id":18214,"one":1,"hq":1},{"id":18220,"one":1,"hq":1},{"id":18232,"one":1,"hq":1},{"num":3,"id":5633,"one":1}],"xp":191700,"instance":20046},"reqs":{"jobs":[{"lvl":63,"id":142}],"quests":[68024]},"next":[68026]},"partials":[{"type":"npc","id":"1019985","obj":{"i":1019985,"n":"Alisaie","l":2409,"q":2}},{"type":"npc","id":"1019988","obj":{"i":1019988,"n":"Lyse","l":2409,"q":2}},{"type":"npc","id":"1019986","obj":{"i":1019986,"n":"Lyse","l":2409,"q":2}},{"type":"npc","id":"1019987","obj":{"i":1019987,"n":"Lyse","l":2409,"q":1}},{"type":"npc","id":"1019989","obj":{"i":1019989,"n":"Alisaie","l":2409,"q":2}},{"type":"npc","id":"1019990","obj":{"i":1019990,"n":"Stupefied Senior","l":2409,"q":2}},{"type":"npc","id":"1019991","obj":{"i":1019991,"n":"Flustered Fisher","l":2409,"q":2}},{"type":"npc","id":"1019992","obj":{"i":1019992,"n":"Industrious Pirate","l":2409,"q":2}},{"type":"item","id":"18208","obj":{"i":18208,"n":"Gyuki Leather Trousers of Fending","l":265,"c":47323,"t":36,"p":34630}},{"type":"item","id":"18214","obj":{"i":18214,"n":"Gyuki Leather Trousers of Maiming","l":265,"c":47325,"t":36,"p":34630}},{"type":"item","id":"18220","obj":{"i":18220,"n":"Ruby Cotton Gaskins of Striking","l":265,"c":47327,"t":36,"p":34630}},{"type":"item","id":"18232","obj":{"i":18232,"n":"Ruby Cotton Gaskins of Scouting","l":265,"c":47328,"t":36,"p":34630}},{"type":"item","id":"5633","obj":{"i":5633,"n":"Piety Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"instance","id":"20046","obj":{"i":20046,"n":"The Pool of Tribute","c":61804,"t":"Trials","min_lvl":63,"max_lvl":64}},{"type":"quest","id":"68024","obj":{"i":68024,"n":"Breaking and Delivering","g":6,"l":"The Ruby Sea","s":430}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}}]}