{"quest":{"name":"In Darkness the Magatama Dreams","location":"The Ruby Sea","id":68022,"patch":4.0,"sort":410,"eventIcon":71201,"issuer":1019971,"target":1019978,"involved":[1019970,1019977,1022365,1022366],"genre":6,"journal":["Alisaie's sigh tells you all you need to know about her state of mind."],"objectives":["Speak with Alisaie.","Use the enchanted lamp to find a shimmering object.","Obtain the Yasakani–no–Magatama.","Show the Yasakani–no–Magatama to Alisaie."],"dialogue":[{"name":"LYSE","text":"Everywhere we go it's the same. “Go away, we don't want any.” You'd think I'd be used to it by now, but some stupid part of me just can't help hoping for the best."},{"name":"ALISAIE","text":"We seem to have reached an impasse. And to make matters worse, every solution I can think of will only take more time..."},{"name":"ALISAIE","text":"I don't suppose you have any ideas, do you, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We could try...talking Shiosai round?"},{"name":"A1","text":"We could ask the villagers if they know anything."},{"name":"A1","text":"Soroban sent us here. Mayhap we should ask him."},{"name":"A1","text":"We find some Red Kojin, and encourage them to talk."},{"name":"ALISAIE","text":"Right..."},{"name":"ALISAIE","text":"Heh! The thought of administering a little encouragement <span class=\"emphasis\">does</span> have its appeal...but I would need to be convinced that the Red Kojin knew anything before resorting to violence."},{"name":"IHANAMI","text":"(-???-)You are the ones who came from above, yes? If we could have a moment of your time?"},{"name":"IHANAMI","text":"Mine apologies. I did not mean to startle you. My name is Ihanami, and this is my wife Yunagi."},{"name":"IHANAMI","text":"We were wondering... Have you any news from Doma? If so, we should like very much to hear it."},{"name":"ALISAIE","text":"May I ask why?"},{"name":"IHANAMI","text":"...If you must. Our daughter fought in the rebellion. We have heard naught from her since."},{"name":"IHANAMI","text":"'Twould be too much to hope that you know of her, but...her name is Yugiri."},{"name":"YUNAGI","text":"Kami be praised! She lives! She lives..."},{"name":"LYSE","text":"We're looking for her too, actually, but I'm sure she's all right."},{"name":"ALISAIE","text":"We had no idea she hailed from Sui–no–Sato. How did she come to serve Doma as a shinobi?"},{"name":"IHANAMI","text":"It all began when she was a little girl. She and another child crept out of the village, having grown curious about the outside world. To Doma they went, where they met a young boy─a proud son of Yanxia."},{"name":"IHANAMI","text":"His tales of imperial oppression left a lasting impression on her. When she returned, she spoke passionately of the Domans' plight and urged us to take the boy in. But my wife and I would not hear of it."},{"name":"IHANAMI","text":"We thought the matter closed, but she never forgot his words. She became convinced that the Garleans would one day come for us. And it was in search of the strength to defend us that she left, years later, to learn the ways of the shinobi..."},{"name":"IHANAMI","text":"When the then Ruby Princess learned of this, she forbade Yugiri's return, lest she bring misfortune to us all."},{"name":"YUNAGI","text":"We protested the judgment, but there was naught we could do. And so our daughter, who wanted only to keep her people safe..."},{"name":"YUNAGI","text":"Surely there is something we can do for these people? They who gave her aid and succor when no other would?"},{"name":"IHANAMI","text":"...I am but a humble stonemason. But if it is the Yasakani–no–Magatama you seek, I may yet be of some assistance to you."},{"name":"IHANAMI","text":"The jewel is known to possess an unusual property. To the naked eye it is as jade, but when bathed in a particular light, it shimmers with a divine resplendence."},{"name":"IHANAMI","text":"I have mined similar materials before. To find them, one must use these lamps."},{"name":"IHANAMI","text":"They cast an invisible light, under which the stones sparkle. In the deepest depths, they are invaluable."},{"name":"IHANAMI","text":"There is a sunken ship to the east. Though the currents may have spirited away her cargo, you should begin your search there."},{"name":"ALISAIE","text":"Thank you so much. We will do just that!"},{"name":"YUNAGI","text":"I hope you find that which you seek. I only wish there were something more we could do to assist you... Know that you will be in my prayers."},{"name":"YUNAGI","text":"And...when next you see our daughter, pray tell her not a day goes by that her parents and her brothers do not think of her."},{"name":"LYSE","text":"We will. I promise!"},{"name":"IHANAMI","text":"I would so dearly like to hear more of your adventures with my daughter─but I understand time is of the essence. Go now, and use the lamps as I told you. ...Ah! But be aware that their light only shines for short periods."},{"name":"YUNAGI","text":"May the kami speed you on your journey!"},{"name":"LYSE","text":"Leave this area to me!"},{"name":"ALISAIE","text":"If this wreck is the selfsame vessel of which Soroban spoke, then if the gods are good, the Magatama is nearby..."},{"name":"ALISAIE","text":"Ready your lamp and keep your eyes open, <span class=\"highlight\">Forename</span>. We're going to need to take this slowly. Move too fast and we risk overlooking something."},{"name":"SYSTEM","text":"To find the Yasakani–no–Magatama, you will need to search the area marked on your map."},{"name":"SYSTEM","text":"Use your lamp to pinpoint the precise location of the treasure and claim it!"},{"name":"ALISAIE","text":"I wish I knew how far the light from these lamps travels..."},{"name":"SYSTEM","text":"You raise your lamp high, but notice naught out of the ordinary..."},{"name":"SYSTEM","text":"Though you cannot say for certain, you think you glimpse a flickering light in the distance..."},{"name":"SYSTEM","text":"For an instant, you spy a flash of light. You are getting closer..."},{"name":"SYSTEM","text":"The flash is unmistakable in the dark, but you are still unable to pinpoint its exact location. Just a little closer..."},{"name":"SYSTEM","text":"There! Peeping out from beneath a fine layer of sand, you spy something shimmering!"},{"name":"ALISAIE","text":"I swear, looking for a needle in a haystack would be quicker. Gosetsu will have died of old age by the time we finish. You haven't found anything, have you, <span class=\"highlight\">Forename</span>?"},{"name":"ALISAIE","text":"This...this is it! The Yasakani–no–Magatama, exactly as Soroban described!"},{"name":"ALISAIE","text":"Heh, it would seem that our fortunes have finally changed for the better!"}],"reward":{"gil":737,"items":[{"id":18193,"one":1,"hq":1},{"id":18196,"one":1,"hq":1},{"id":18198,"one":1,"hq":1},{"id":18199,"one":1,"hq":1},{"num":3,"id":5683,"one":1}],"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":142}],"quests":[68021]},"next":[68023]},"partials":[{"type":"npc","id":"1019971","obj":{"i":1019971,"n":"Alisaie","l":2409,"q":4}},{"type":"npc","id":"1019978","obj":{"i":1019978,"n":"Alisaie","l":2409,"q":2}},{"type":"npc","id":"1019970","obj":{"i":1019970,"n":"Lyse","l":2409,"q":3}},{"type":"npc","id":"1019977","obj":{"i":1019977,"n":"Lyse","l":2409,"q":2}},{"type":"npc","id":"1022365","obj":{"i":1022365,"n":"Ihanami","l":2409,"q":1}},{"type":"npc","id":"1022366","obj":{"i":1022366,"n":"Yunagi","l":2409,"q":1}},{"type":"item","id":"18193","obj":{"i":18193,"n":"Larch Composite Bow","l":265,"c":32339,"t":4,"p":37778}},{"type":"item","id":"18196","obj":{"i":18196,"n":"High Steel-barreled Snaphance","l":265,"c":34699,"t":88,"p":37778}},{"type":"item","id":"18198","obj":{"i":18198,"n":"Koppranickel Pole","l":265,"c":33091,"t":7,"p":37778}},{"type":"item","id":"18199","obj":{"i":18199,"n":"Gyuki Leather Grimoire","l":265,"c":33227,"t":10,"p":37778}},{"type":"item","id":"5683","obj":{"i":5683,"n":"Battledance Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Tenacity","category":0}}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}},{"type":"quest","id":"68023","obj":{"i":68023,"n":"The Whims of the Divine","g":6,"l":"The Ruby Sea","s":420}}]}