{"quest":{"name":"A Silence in Three Parts","location":"The Ruby Sea","id":68027,"patch":4.0,"sort":460,"icon":100650,"eventIcon":71201,"issuer":1020186,"target":1019997,"involved":[1019994,1019995,1019996,1019998,1019999,1020187,1020188],"genre":6,"journal":["Though he is less than the picture of perfect health, Gosetsu is ready to resume his journey to Yanxia.","Owing to the timely intervention of Confederate forces, Yotsuyu and her imperials have been driven from Isari, and their former captives managed to survive their ordeal. Despite his assurances, Gosetsu is clearly still troubled by the injuries he sustained from Grynewaht's brutal interrogation. Nevertheless, you decide to carry on and resume your journey to Yanxia.","Life. Liberty. Hope. All this and more have the Garleans tried to take from the Domans. Everywhere you look you are confronted by evidence of the failed rebellion and the vicious reprisals which followed. Yet the imperial soldiers are conspicuous by their absence...","Zenos had no desire to remain in Doma after he crushed the rebellion, and so he named Yotsuyu to serve in his stead. The acting viceroy waged an indiscriminate campaign of terror, marching into villages without warning and committing unspeakable atrocities in the name of rooting out “radical elements.” After a time, these purges ceased, but the memory remains, and with it the promise of punishment should the people resist. And so there is little need for imperial patrols.","Gosetsu leads you to Namai, a humble farming village a little ways to the west. Yet even though you see no signs of imperial soldiers, it would be exceedingly reckless to simply saunter into the village..."],"objectives":["Journey to Yanxia.","Speak with Gosetsu.","Follow Gosetsu."],"dialogue":[{"name":"LYSE","text":"This is it. We're finally headed into the heart of Doma. I can't help but be a little nervous..."},{"name":"ALISAIE","text":"According to my map, the plains of Yanxia lie to the west. Of note is the One River, upon the shores of which Doma was built..."},{"name":"GOSETSU","text":"You did well, <span class=\"highlight\">Forename</span>. Were it not for the tremendous strength and bravery of you and yours, many innocent souls would have suffered terrible fates."},{"name":"GOSETSU","text":"Though I knew the Confederacy would be loath to meet the imperials in battle, I also knew that if any could win them over, it would be you."},{"name":"GOSETSU","text":"Truly, yours is a heroic spirit that inspires men to rise above their circumstances─to strive for something greater! It will be an honor to travel with you again."},{"name":"GOSETSU","text":"Now then, let us not squander the Confederacy's gift. Yanxia and my countrymen await!"},{"name":"GOSETSU","text":"There is a tunnel to the southwest. We need but follow it to reach our destination. With me!"},{"name":"LYSE","text":"This place, I...I don't know what I expected."},{"name":"ALISAIE","text":"There's a weariness. A desolation. An emptiness..."},{"name":"GOSETSU","text":"Hmm... Yes, this is far enough."},{"name":"GOSETSU","text":"Ere we proceed further, I should speak of Yanxia and what became of her. Of what lies beyond that great wall at the heart of Doma."},{"name":"ALISAIE","text":"And we should be glad to hear it, but is it wise for us to have this conversation here, on the road, out in the open?"},{"name":"GOSETSU","text":"Once, your caution would be warranted...but no longer."},{"name":"GOSETSU","text":"Zenos did not linger after he crushed the rebellion. He appointed Yotsuyu to act in his stead and quit these lands for “fresh sport.”"},{"name":"GOSETSU","text":"The acting viceroy was no less merciless than her master. Without warning, her men would march into villages and search for “radical elements,” killing and torturing any who dared resist. And then, as quickly as they had come, they left."},{"name":"GOSETSU","text":"Satisfied that the memory of the purges would keep the people in line, she relaxed her grip on Yanxia. What need for the leash when the dog is broken..."},{"name":"GOSETSU","text":"The village of Namai lies to the west. Though I doubt the imperials are present, let us proceed with caution."},{"name":"LYSE","text":"It seems peaceful enough to me..."},{"name":"ALISAIE","text":"Even if there aren't any soldiers in the village, it would be foolish to simply stride in and announce ourselves."},{"name":"GOSETSU","text":"There she is─the humble village of Namai! How delicious her rice; how sweet her persimmons!"},{"name":"GOSETSU","text":"Too long has it been since I saw her with my own eyes. And, for a mercy, the imperials appear to be absent..."}],"reward":{"gil":905,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":142}],"quests":[68026]},"next":[68028]},"partials":[{"type":"npc","id":"1020186","obj":{"i":1020186,"n":"Gosetsu","l":2409,"q":1}},{"type":"npc","id":"1019997","obj":{"i":1019997,"n":"Gosetsu","l":2410,"q":2}},{"type":"npc","id":"1019994","obj":{"i":1019994,"n":"Gosetsu","l":2410,"q":1}},{"type":"npc","id":"1019995","obj":{"i":1019995,"n":"Alisaie","l":2410,"q":1}},{"type":"npc","id":"1019996","obj":{"i":1019996,"n":"Lyse","l":2410,"q":1}},{"type":"npc","id":"1019998","obj":{"i":1019998,"n":"Alisaie","l":2410,"q":2}},{"type":"npc","id":"1019999","obj":{"i":1019999,"n":"Lyse","l":2410,"q":2}},{"type":"npc","id":"1020187","obj":{"i":1020187,"n":"Lyse","l":2409,"q":1}},{"type":"npc","id":"1020188","obj":{"i":1020188,"n":"Alisaie","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}},{"type":"quest","id":"68028","obj":{"i":68028,"n":"Life after Doma","g":6,"l":"Yanxia","s":470}}]}