{"quest":{"name":"A New Ruby Tithe","location":"Yanxia","id":68031,"patch":4.0,"sort":510,"icon":100643,"eventIcon":71201,"issuer":1020020,"target":1020283,"involved":[1020021,1020022,1020023,1020024,1020025,1020026,1020027,1020282],"genre":6,"journal":["Yugiri is troubled by what she has seen.","Before you and your comrades can settle upon a new course of action, Yugiri grows tense. Men in armor are approaching. She urges you and Lyse to come with her and find a place to hide.","From the shadows of a building you observe as a squadron of soldiers marches into Namai, led by the selfsame pilus who threatened Tansui in the Ruby Sea. He tells the gathered people of the battle between Confederate and imperial forces in Isari, declaring it a brazen, unconscionable act that will not go unanswered. Announcing that some will be required to serve the Garleans in rudimentary support roles for an indeterminate period of time, the pilus prior begins to select villagers one by one, ending with Isse, the young man who implored you to leave Namai and never return. Powerless to intervene without endangering the lives of the villagers, you and your comrades can only watch as the soldiers depart with their hostages.","After Yugiri convinces Lyse to return to the House of the Fierce to inform the others of this development, the ninja turns to you and states that you must hurry if you are to catch up to the soldiers.","Calling a halt, Yugiri reminds you that for the sake of the villagers, you must make every effort to refrain from needless violence. To that end, she furnishes you with a blowgun and darts that you can use to put imperial soldiers to sleep. One stands alone on a hill to the south─an ideal opportunity for practice.","The dart finds its mark, and the soldier crumples to the ground without a sound. Satisfied, Yugiri directs you to another vantage point from where you can take aim at the remaining soldiers in the unit.","Soon the ground is littered with snoring soldiers, and your path is clear to cross the river and rejoin Yugiri northwest of Fluminis.","Yugiri applauds your handiwork, and informs you that the soldiers in the nearby castrum remain unaware of your presence. Several guard the gate, and once more the ninja invites you to use your blowgun to incapacitate them while she stands watch for wayward patrols.","The sentries are dispatched as easily as those before them. You put away your blowgun and descend the hill to rejoin your comrade.","Free to advance, you and Yugiri approach the gates to Fluminis cautiously, uncertain what awaits you beyond the threshold...","Joined by people taken from other nearby villages, the people of Namai listen in disbelief as the pilus tells them that they will be tasked with the repair and maintenance of arms and armaments, as well as magitek devices. Needless to say, it would take years before they perform such duties effectively, and it finally dawns on the gathered Domans that they have been effectively sentenced to a life of servitude. The pilus departs for the castle, leaving the villagers in the care of his subordinates. You must act quickly if you are to save them, for once they are transported to the facility on the distant shore, there is no escape..."],"objectives":["Hide with Lyse and Yugiri.","Speak with Yugiri.","Follow Yugiri.","Speak with Yugiri and use your blowgun to incapacitate the imperial soldier.","Take aim and use your blowgun to incapacitate the imperial soldiers.","Rendezvous with Yugiri.","Take aim and use your blowgun to incapacitate the imperial soldiers.","Speak with Yugiri.","Follow Yugiri."],"dialogue":[{"name":"LYSE","text":"There's got to be something we can do, right? We can't just give up and go home. Not after everything we've been through."},{"name":"YUGIRI","text":"...Despite everything we have seen and learned, I refuse to renounce this cause."},{"name":"YUGIRI","text":"We should return to the House of the Fierce and consult with our comrades. Perhaps together, we might─"},{"name":"YUGIRI","text":"Did you hear that? Quickly, we must find a place to hide!"},{"name":"LYSE","text":"Is someone coming? I didn't hear anything."},{"name":"YUGIRI","text":"Behind me, <span class=\"highlight\">Forename</span>! They come from the south!"},{"name":"YUGIRI","text":"Regardless of what the officer claimed, I fear they have crueler designs for these people."},{"name":"YUGIRI","text":"With me, <span class=\"highlight\">Forename</span>. We must hurry!"},{"name":"YUGIRI","text":"Given the circumstances, we must make every effort to refrain from needless violence."},{"name":"YUGIRI","text":"Here. It is a shinobi's tool, for when a more discreet approach is required. Use it with these darts. They are coated with an alchemical reagent that induces a deep sleep."},{"name":"YUGIRI","text":"There are soldiers patrolling ahead. Were circumstances different we could engage them directly, but for the villagers' sake we dare not risk it."},{"name":"YUGIRI","text":"We will use our blowguns to incapacitate them. For a shinobi such as you, this should prove no challenge. Nevertheless, practice is in order..."},{"name":"YUGIRI","text":"We will use our blowguns to incapacitate them. Regardless of your familiarity with such weapons, you are a veteran warrior, and I am sure it will come naturally to you. Nevertheless, practice is in order..."},{"name":"YUGIRI","text":"There─the soldier on the hill below. Take aim and fire─if the dart finds its mark, he should fall within moments."},{"name":"SYSTEM","text":"Search your surroundings for the imperial soldier. You may move the camera, as well as zoom in and out. Target the soldier and use the blowgun with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"YUGIRI","text":"Well done, my friend! Now, give me your map─there is a vantage point from which you may observe and fire upon the other soldiers."},{"name":"YUGIRI","text":"Worry not─I shall be with you every step of the way, keeping watch for other patrols. We shall speak again on the other side of the river."},{"name":"SYSTEM","text":"The last imperial soldier crumples to the ground, asleep. You put away your blowgun and prepare to rejoin Yugiri."},{"name":"SOLDIERA02495","text":"Huh. Who are you? Some wandering merchant? Whatever it is, I don't want any. Piss off."},{"name":"SOLDIERB02495","text":"This is no place for the likes of you. Begone!"},{"name":"YUGIRI","text":"Excellent work, <span class=\"highlight\">Forename</span>. They appear to be none the wiser..."},{"name":"YUGIRI","text":"The villagers are being held in the castrum to the south─Fluminis."},{"name":"YUGIRI","text":"Once, it was the base of operations for the Garlean occupation...until ten or so years ago, when they relocated to Doma Castle. Now, the castrum serves as little more than a storage facility..."},{"name":"YUGIRI","text":"I spy two sentries near the gate. As you have proven yourself to have impeccable aim, I would ask you to incapacitate them. This very hill should afford you a clear shot."},{"name":"YUGIRI","text":"I will stand watch while you see to the guards. Climb the hill and use your blowgun to put them to sleep!"},{"name":"SYSTEM","text":"The two sentries slumber side by side. No others appear to be forthcoming..."},{"name":"YUGIRI","text":"Fine work, <span class=\"highlight\">Forename</span>. Oboro would be proud."},{"name":"YUGIRI","text":"Fine work, <span class=\"highlight\">Forename</span>. You have a gift for the ways of the shinobi..."},{"name":"YUGIRI","text":"The way is clear─let us move closer and see what has become of the villagers."},{"name":"SOLDIERC02495","text":"(-Imperial Decurion-)Sir! The Aan from the other villages are assembled for inspection."},{"name":"GARLEANLEADERDOMA","text":"Very good. I will address them personally."},{"name":"GARLEANLEADERDOMA","text":"Attention! Shortly you all will be transported to the facility on the distant shore."},{"name":"GARLEANLEADERDOMA","text":"Your duties, as you have been previously informed, will be rudimentary in nature. More specifically, you will be tasked with the repair and maintenance of various arms and armaments, as well as magitek devices."},{"name":"VILLAGER02495","text":"Magitek!? But we're farmers! We don't know the first thing about magitek!"},{"name":"VILLAGER02495","text":"It'd take us months, if not years, to learn how to do that kind of work!"},{"name":"GARLEANLEADERDOMA","text":"The materiel in question was damaged when <span class=\"emphasis\">your</span> kith and kin rose up in rebellion! Therefore, <span class=\"emphasis\">you</span> bear responsibility for its repair!"},{"name":"GARLEANLEADERDOMA","text":"If you cannot perform your duties, you will learn how. And if you cannot learn how, then your villages may find themselves at the mercy of the Confederacy and other radical elements. Is that what you want?"},{"name":"GARLEANLEADERDOMA","text":"Deal with this rabble. I am needed at the castle."},{"name":"YUGIRI","text":"This is no temporary measure. Those men and women will die in servitude."},{"name":"YUGIRI","text":"Once they are taken to the other facility, it will be too late. If we are to intervene, we must do so now. Agreed?"},{"name":"YUGIRI","text":"Then let us be about it."}],"reward":{"gil":1189,"items":[{"id":18381,"one":1,"hq":1},{"id":18393,"one":1,"hq":1},{"id":18399,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":199800},"reqs":{"jobs":[{"lvl":64,"id":142}],"quests":[68030]},"next":[68032]},"partials":[{"type":"npc","id":"1020020","obj":{"i":1020020,"n":"Yugiri","l":2410,"q":2}},{"type":"npc","id":"1020283","obj":{"i":1020283,"n":"Yugiri","l":2410,"q":2}},{"type":"npc","id":"1020021","obj":{"i":1020021,"n":"Lyse","l":2410,"q":2}},{"type":"npc","id":"1020022","obj":{"i":1020022,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1020023","obj":{"i":1020023,"n":"Lyse","l":2410,"q":1}},{"type":"npc","id":"1020024","obj":{"i":1020024,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1020025","obj":{"i":1020025,"n":"Yugiri","l":2410,"q":2}},{"type":"npc","id":"1020026","obj":{"i":1020026,"n":"Imperial Patrol","l":2410,"q":1}},{"type":"npc","id":"1020027","obj":{"i":1020027,"n":"Imperial Patrol","l":2410,"q":1}},{"type":"npc","id":"1020282","obj":{"i":1020282,"n":"Yugiri","l":2410,"q":1}},{"type":"item","id":"18381","obj":{"i":18381,"n":"Tigerskin Gloves of Aiming","l":273,"c":44604,"t":37,"p":21403}},{"type":"item","id":"18393","obj":{"i":18393,"n":"Tigerskin Armguards of Healing","l":273,"c":44602,"t":37,"p":21403}},{"type":"item","id":"18399","obj":{"i":18399,"n":"Tigerskin Armguards of Casting","l":273,"c":44601,"t":37,"p":21403}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68030","obj":{"i":68030,"n":"The Ones We Leave Behind","g":6,"l":"Yanxia","s":500}},{"type":"quest","id":"68032","obj":{"i":68032,"n":"The Will to Live","g":6,"l":"Yanxia","s":520}}]}