{"quest":{"name":"The Time between the Seconds","location":"Yanxia","id":68034,"patch":4.0,"sort":550,"icon":100651,"eventIcon":71201,"issuer":1020055,"target":1020057,"involved":[1020052,1020056,1020058,1020059,1020189],"genre":6,"journal":["Yugiri has made her choice, and so have you.","Zenos yae Galvus has come to Doma, and Yugiri has resolved, over the protestations of your comrades, to assassinate him. You alone have agreed to support her in this endeavor, and so she shares with you Zenos's itinerary─how the vessel bearing him and his escort will come to the docks east of the Moon Gates, and how, after disembarking, they will continue towards Yuzuka Manor. The docks themselves are not an ideal location for an ambush, however, so the two of you split up to search for suitable hiding places.","You find a spot near the manor which should afford you a clear view of the docks. All that remains is to wait for the crown prince to arrive, and to attempt to take him unawares. Should you fail, you will have no choice but to engage him in open combat. But then a part of you would like that very much...","As before at the Reach, Zenos is a force of nature, relentless and unstoppable. Yet you have grown stronger since last you met, and for a time it seems as though you may have a chance...until your foe elects to bring a new katana to bear against you. At once, his body begins to crackle with a crimson energy, which bursts forth and fells both Yugiri and the viceroy's few remaining soldiers. You endure a moment longer, but soon join them in defeat.","As he stands over you in judgment, Zenos at last recognizes you as the champion of the savages in Ala Mhigo. Discarding his damaged helmet, he implores you to live on, to endure, to grow stronger, and to face him once more, before whirling about and putting an end to a last desperate attempt by Yugiri to kill him. He advances to finish her off, but pauses when confronted by a group of armed villagers, as well as Gosetsu and Alisaie, who are determined to save the ninja's life. It is a touching display of defiance, but having tasted the viceroy's might, you know that even with such numbers, they do not stand a chance. Nevertheless, Zenos withdraws without a word, leaving you and your comrades free to withdraw to safety.","It would seem that Yugiri owes her preservation to one Alphinaud Leveilleur, for it was he who convinced the others to rush to your defense. Alisaie takes great pleasure in describing his panic─as does Gosetsu in observing that she herself was no picture of calm..."],"objectives":["Search for a place to lie in wait.","Speak with Yugiri.","Speak with Alisaie."],"dialogue":[{"name":"GOSETSU","text":"Zenos will fall, but not to a desperate knife in the dark. We will need to plan and prepare, and she has done neither."},{"name":"YUGIRI","text":"Zenos's itinerary is as follows..."},{"name":"YUGIRI","text":"He will depart Doma Castle by ship and approach the Moon Gates. The magitek field will be deactivated briefly, allowing his vessel to pass. It will then continue on to these very docks, where he and his entourage will disembark."},{"name":"YUGIRI","text":"As you can see, this area is not ideal for an ambush. Wide open, multiple avenues of escape. The manor is better suited to our needs."},{"name":"YUGIRI","text":"Let us split up and search for suitable hiding places."},{"name":"SYSTEM","text":"Surrounded by walls and deserted, this location appears to be ideal for concealment..."},{"name":"YUGIRI","text":"Ah, there you are."},{"name":"YUGIRI","text":"Hmm... From the roof, we would have a clear view of the docks..."},{"name":"YUGIRI","text":"It is settled. We shall lie in wait here until Zenos arrives."},{"name":"YUGIRI","text":"As discussed, if all goes to plan, he shall fall with my first blow. If not, then the two of us will have to engage him in open combat."},{"name":"YUGIRI","text":"His escort is of no consequence, which means that we will have a two-to-one advantage. Nevertheless, he is not to be underestimated..."},{"name":"YUGIRI","text":"All that remains is to wait. I trust that you are ready?"},{"name":"YUGIRI","text":"Ugh..."},{"name":"ISSE","text":"It's all right. Here, have some water..."},{"name":"GOSETSU","text":"'Tis naught that will not heal with time."},{"name":"ALISAIE","text":"I don't think we were followed...<br>Gods... I have no idea what was going through that man's head, but I am heartily glad he decided to leave."},{"name":"ALISAIE","text":"Oh, and don't thank us. Thank Alphinaud. He's at the House of the Fierce, patiently awaiting your gratitude."},{"name":"ALISAIE","text":"You should've seen the way he turned pale when he heard about Yugiri's plan─and how <span class=\"emphasis\">you</span> of all people had decided to help her. He was in such a panic, barking orders, calling for a squadron to be assembled─"},{"name":"GOSETSU","text":"As were you."},{"name":"ALISAIE","text":"I was rather composed, as I recall. Though that is neither here nor there..."},{"name":"QIB","text":"Defeat Zenos yae Galvus!"},{"name":"QIB","text":"Defeat Zenos yae Galvus!"},{"name":"YUGIRI","text":"Zenos yae Galvus! You will die by my hand!"},{"name":"ZENOS","text":"First you must kill my men. You <span class=\"emphasis\">can</span> do that, can you not?"},{"name":"YOTSUYU","text":"What are you doing, you fools!? There are only two of them!"},{"name":"ZENOS","text":"Hm. How much longer must you make me wait?"},{"name":"ZENOS","text":"Very well. I suppose you have earned this..."},{"name":"YUGIRI","text":"This is not a game, you twisted, arrogant bastard!"},{"name":"YUGIRI","text":"Graaagh!"},{"name":"YUGIRI","text":"No! I can still fight, I can still...still..."},{"name":"ZENOS","text":"Well done, beast. You have earned the right to look on the Ame–no–Habakiri."},{"name":"YOTSUYU","text":"What...what is this...? Kami forfend..."},{"name":"ZENOS","text":"You're better than most, I'll grant you that. But not good enough. This ends now."}],"reward":{"gil":1975,"items":[{"num":3,"id":5668}],"xp":199800},"reqs":{"jobs":[{"lvl":64,"id":142}],"quests":[68471]},"next":[68035]},"partials":[{"type":"npc","id":"1020055","obj":{"i":1020055,"n":"Yugiri","l":2410,"q":2}},{"type":"npc","id":"1020057","obj":{"i":1020057,"n":"Alisaie","l":2410,"q":2}},{"type":"npc","id":"1020052","obj":{"i":1020052,"n":"Gosetsu","l":2805,"q":2}},{"type":"npc","id":"1020056","obj":{"i":1020056,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1020058","obj":{"i":1020058,"n":"Gosetsu","l":2410,"q":2}},{"type":"npc","id":"1020059","obj":{"i":1020059,"n":"Isse","l":2410,"q":2}},{"type":"npc","id":"1020189","obj":{"i":1020189,"n":"Yugiri","l":2410,"q":2}},{"type":"item","id":"5668","obj":{"i":5668,"n":"Heavens' Eye Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"68471","obj":{"i":68471,"n":"Path of No Return","g":6,"l":"Yanxia","s":540}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}}]}