{"quest":{"name":"The Will to Live","location":"Yanxia","id":68032,"patch":4.0,"sort":520,"eventIcon":71201,"issuer":1023780,"target":1020029,"involved":[1020025,1020040,1020041,1020042,1020043,1020044,1020045,1020047,1020048,1020283],"genre":6,"usedItems":[20597,20599,20600,20596,20598],"journal":["Yugiri is in her element."],"objectives":["Stand watch for imperial patrols.","Speak with Yugiri.","Steal a suitable uniform from a sleeping soldier.","Speak with Yugiri.","While in uniform, perform an /imperialsalute to the guards.","Speak with Yugiri.","Free the Doman villagers."],"dialogue":[{"name":"YUGIRI","text":"Despite the urgency of the situation, we must still proceed with the utmost caution to ensure the safety of the villagers."},{"name":"YUGIRI","text":"To wit, we must infiltrate the castrum without raising the alarum."},{"name":"YUGIRI","text":"I will deal with any soldiers near the entrance. Stand watch for others approaching from the north until you hear my signal."},{"name":"SYSTEM","text":"For a mercy, you spy no imperial patrols bound for the castrum. A hawk's cry pierces the silence─Yugiri is waiting."},{"name":"BIGSOLDIER02496","text":"Mmm... Mmm... No, you sign off first... &lt;snore&gt;"},{"name":"MIDDLESOLDIER02496","text":"&lt;snore&gt; ...Five...five more minutes..."},{"name":"SMALLSOLDIER02496","text":"Sodding...&lt;snore&gt;...sodding cu─&lt;snort&gt;─sodding...the lot of you..."},{"name":"YUGIRI","text":"Speak softly, lest the others hear us. What of the outside?"},{"name":"YUGIRI","text":"...That is good. We may proceed as planned."},{"name":"YUGIRI","text":"These ones shall not soon wake. However, the others are too close to the villagers. Incapacitating them as I did these ones is far too risky."},{"name":"YUGIRI","text":"Fortunately, a solution presents itself. I would have you disguise yourself as an imperial soldier and convince them that a changing of the guard is in order."},{"name":"YUGIRI","text":"You have your pick of uniforms. They shall not protest."},{"name":"YUGIRI","text":"I would not presume to choose for you. You know your own proportions best."},{"name":"SYSTEM","text":"This uniform appears to be more or less your size..."},{"name":"SYSTEM","text":"Although this unform is quite large in several places, with a few minor adjustments, it appears as though it could suffice..."},{"name":"SYSTEM","text":"Although this uniform is a little large for your tastes, with a few minor adjustments, it appears as though it could suffice..."},{"name":"SYSTEM","text":"If there were three of you standing on each other's shoulders, you could perhaps fit into this uniform. Walking, however, would present a challenge."},{"name":"SYSTEM","text":"This uniform is far too large for you to wear comfortably."},{"name":"SYSTEM","text":"This uniform appears to be more or less your size..."},{"name":"SYSTEM","text":"...It would probably be considered obscene to wear this uniform in polite company."},{"name":"SYSTEM","text":"Attempting to wear this uniform might force you to confront certain uncomfortable realities better left unexplored..."},{"name":"SYSTEM","text":"Perhaps, in another life, this uniform would have suited you perfectly. But not this one."},{"name":"SYSTEM","text":"...Upon further consideration, you realize that such ambition would better serve you on the battlefield."},{"name":"SYSTEM","text":"...Though it is often said that one should aspire to bigger and better things, it would not be prudent at this juncture."},{"name":"SYSTEM","text":"Although this uniform is a little small for your tastes, with a few minor adjustments, it appears as though it could suffice..."},{"name":"SYSTEM","text":"This uniform appears to be more or less your size..."},{"name":"SYSTEM","text":"With all due care and consideration, you relieve the sleeping soldier of their uniform."},{"name":"YUGIRI","text":"You have chosen one to your liking, then? Excellent."},{"name":"YUGIRI","text":"I shall hide these ones where none will find them."},{"name":"YUGIRI","text":"Our sleeping beauties have been laid to rest in their bunks. Oh, and while I was in the barracks, I happened upon these spare uniforms, in case the items in your possession are not to your liking."},{"name":"SYSTEM","text":"The sack appears to be filled with a nigh-infinite supply of imperial equipment...though it would be best if you did not attempt to put that cursory assessment to the proof."},{"name":"SYSTEM","text":"The sack appears to be filled with a nigh-infinite supply of imperial equipment...though it would be best if you did not attempt to put that cursory assessment to the proof."},{"name":"YUGIRI","text":"This kabuto and tekko should match the uwagi, hakama, and choka in your possession..."},{"name":"YUGIRI","text":"And with that, you have a full set. I am sure that once you change, it will seem as though it was bespoke."},{"name":"YUGIRI","text":"You will need to give the soldiers guarding the villagers a proper <span class=\"highlight\">imperial salute</span> to complete the deception and convince them to come here, where I will be waiting to deal with them."},{"name":"YUGIRI","text":"The imperial soldiers assigned to Doma are hardly the Empire's best and brightest. Nevertheless, you will need to approach them in uniform if you wish to convince them you are one of their own."},{"name":"YUGIRI","text":"Do not forget to give them an <span class=\"highlight\">imperial salute</span>. They may not be the most clever soldiers in the imperial army, but they know protocol."},{"name":"YUGIRI","text":"...In the strange and inexplicable event that you somehow dispose of all or part of your uniform, you may search these sacks for replacements. Not that there should be any need for that. Certainly not."},{"name":"SYSTEM","text":"The sack appears to be filled with a nigh-infinite supply of kabuto and tekko..."},{"name":"SYSTEM","text":"Being the prudent and responsible individual that you are, you resolve only to take items to replace those which you may have misplaced under circumstances better left unsaid."},{"name":"SYSTEM","text":"The sack appears to be filled with a nigh-infinite supply of uwagi, hakama, and choka..."},{"name":"SOLDIERC02495","text":"Huh!? How did you get in here! Leave, now!"},{"name":"SOLDIERC02495","text":"Oh, hello there. Are you new?"},{"name":"SOLDIERC02495","text":"...I don't know what you're about, but don't think that the provinces are any less strict than the capital. The viceroy does not tolerate insubordination."},{"name":"SOLDIERC02495","text":"Is it time already? Not that I'm complaining, mind, but I thought the others would be gone longer..."},{"name":"SOLDIERD02496","text":"Hah hah, very amusing, you. Is this a drill? Am I supposed to bellow, “Rebel insurgents! To arms, to arms!” or some such rot?"},{"name":"SOLDIERD02496","text":"Let me guess: hangover, eh? I've been there─woke up once after a late night drinking and didn't find my kabuto until days later. You don't want to know what it was filled with, let me tell you..."},{"name":"SOLDIERD02496","text":"...This is that game where you try to make me guess a word or phrase by gesticulating wildly, isn't it? Hmm...can you do it again?"},{"name":"SOLDIERD02496","text":"Changing of the guard, is it? About bloody time. Just looking at these Aan is making me depressed. Reminds me of when I was in their shoes, pissing myself in fear..."},{"name":"SOLDIERC02495","text":"..."},{"name":"SOLDIERD02496","text":"Just...just a few more years... &lt;snore&gt;"},{"name":"YUGIRI","text":"These ones shall sleep soundly along with the others..."},{"name":"YUGIRI","text":"And, with that, there are no more soldiers to trouble us. You can dispose of that accursed uniform too."},{"name":"YUGIRI","text":"It is time to guide the villagers to freedom!"},{"name":"YUGIRI","text":"Quickly, we must go to the villagers before more soldiers come!"}],"reward":{"gil":1052,"xp":199800},"reqs":{"jobs":[{"lvl":64,"id":142}],"quests":[68031]},"next":[68033]},"partials":[{"type":"npc","id":"1023780","obj":{"i":1023780,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1020029","obj":{"i":1020029,"n":"Captured Villager","l":2410,"q":1}},{"type":"npc","id":"1020025","obj":{"i":1020025,"n":"Yugiri","l":2410,"q":2}},{"type":"npc","id":"1020040","obj":{"i":1020040,"n":"Imperial Decurion","l":2410,"q":1}},{"type":"npc","id":"1020041","obj":{"i":1020041,"n":"Imperial Soldier","l":2410,"q":1}},{"type":"npc","id":"1020042","obj":{"i":1020042,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1020043","obj":{"i":1020043,"n":"Stocky Soldier","l":2410,"q":1}},{"type":"npc","id":"1020044","obj":{"i":1020044,"n":"Spindly Soldier","l":2410,"q":1}},{"type":"npc","id":"1020045","obj":{"i":1020045,"n":"Strapping Soldier","l":2410,"q":1}},{"type":"npc","id":"1020047","obj":{"i":1020047,"n":"Imperial Decurion","l":2410,"q":2}},{"type":"npc","id":"1020048","obj":{"i":1020048,"n":"Imperial Soldier","l":2410,"q":2}},{"type":"npc","id":"1020283","obj":{"i":1020283,"n":"Yugiri","l":2410,"q":2}},{"type":"item","id":"20597","obj":{"i":20597,"n":"Uwagi #55","l":150,"c":43381,"t":35,"p":100}},{"type":"item","id":"20599","obj":{"i":20599,"n":"Hakama #55","l":150,"c":47354,"t":36,"p":100}},{"type":"item","id":"20600","obj":{"i":20600,"n":"Choka #55","l":150,"c":47131,"t":38,"p":100}},{"type":"item","id":"20596","obj":{"i":20596,"n":"Kabuto #55","l":150,"c":40282,"t":34,"p":100}},{"type":"item","id":"20598","obj":{"i":20598,"n":"Tekko #55","l":150,"c":48678,"t":37,"p":100}},{"type":"quest","id":"68031","obj":{"i":68031,"n":"A New Ruby Tithe","g":6,"l":"Yanxia","s":510}},{"type":"quest","id":"68033","obj":{"i":68033,"n":"Daughter of the Deep","g":6,"l":"Yanxia","s":530}}]}