{"quest":{"name":"The Search for Lord Hien","location":"The Azim Steppe","id":68036,"patch":4.0,"sort":580,"eventIcon":71201,"issuer":1020079,"target":1020281,"involved":[1019349,1019353,1019355,1019360,1019376,1020080,1020081,1020275],"genre":6,"journal":["Yugiri has a simple plan for finding Lord Hien."],"objectives":["Gather information in Reunion.","Speak with the Goro horsemaster.","With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “Mol” to search for a Mol woman.","Speak with Cirina."],"dialogue":[{"name":"LYSE","text":"Is it just me, or is everyone here Xaela?"},{"name":"GOSETSU","text":"I must confess that this is my first time on the Steppe..."},{"name":"YUGIRI","text":"When last I spoke with Lord Hien, he said he spent much time in these markets. I had hoped we might find him here today, but alas..."},{"name":"LYSE","text":"Hey, Yugiri, I've been meaning to ask─there are an awful lot of Xaela here, aren't there?"},{"name":"YUGIRI","text":"Oh, I assumed you knew. The Azim Steppe has been home to the nomadic tribes of the Xaela since antiquity."},{"name":"YUGIRI","text":"More than fifty roam these lands, and though they do not constitute a nation, there is a hierarchy of sorts, determined through ritual combat."},{"name":"LYSE","text":"Funny... If they're so busy fighting each other, you'd think the Empire would be able to march in and take the Steppe with ease. I wonder why they haven't..."},{"name":"GOSETSU","text":"Why indeed, Lyse? Why indeed..."},{"name":"GOSETSU","text":"Perhaps they see little value in it, especially given the fierce reputation of the Xaela warriors who would fight tooth and nail to oppose them."},{"name":"YUGIRI","text":"These lands were not made for men. The soil is thin, and the weather unforgiving."},{"name":"YUGIRI","text":"The Xaela found ways to survive, it is true. But they are made of sterner stuff than most imperials─conscript or citizen."},{"name":"LYSE","text":"Thanks for taking the time to explain. It sounds like I've got a lot to learn. Later, I mean. We're meant to be looking for Hien!"},{"name":"YUGIRI","text":"People from many tribes gather in Reunion to trade goods and information. I should be surprised if we cannot learn something of value here."},{"name":"YUGIRI","text":"Let us make our inquiries separately. <span class=\"highlight\">Forename</span>, why don't you speak with some of the merchants here?"},{"name":"CHAMBUI","text":"Buuz! Fresh buuz! Your choice of lamb or dzo! Guaranteed to satisfy! How many will you have, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>?"},{"name":"CHAMBUI","text":"Eh? A Doman? Unless another Dazkar is keeping him in her yurt, he is not here. &lt;snort&gt; More fool her if she took a Doman for a husband."},{"name":"CHAMBUI","text":"But enough about Domans─let us speak of buuz instead! You cannot come to the Azim Steppe and not sample this most traditional of delicacies!"},{"name":"CHAMBUI","text":"But enough about Domans─let us speak of buuz instead! Surely your mother or father made you some when you were little? A Xaela who never eats buuz is never a whole Xaela!"},{"name":"CHAMBUI","text":"You there! Why don't you have a buuz in your hand right now?"},{"name":"YESUI","text":"What fortune you have to come hither at this time! Freshly slaughtered, every cut available on request. Organs too─hearts, livers, brains. Or a brace of blood sausages, if you desire only a snack!"},{"name":"YESUI","text":"A Doman? Poor meat they make, Domans─ I jest, I jest. Hmm...I did see a young Mol in the company of one some few days ago..."},{"name":"YESUI","text":"Are you sure you do not wish to purchase anything? Organs as fresh as these will be gone before you know it!"},{"name":"BAIDUR","text":"Roasted fish with pumpkin! An exotic foreign delicacy, cooked to perfection, beloved without the Steppe! Come, come!"},{"name":"BAIDUR","text":"You seek Domans? Then you are come to the wrong place, my friend. Delicious as my foodstuffs are, they find little favor with those from the south."},{"name":"BAIDUR","text":"Now, if it were Goro you were looking for, on the other hand, then I might be able to help you. They <span class=\"emphasis\">flock</span> to my stall!"},{"name":"BAIDUR","text":"Doubtless you know well the wonders of Western cuisine. Then I need not persuade you to partake, yes? Come, come─eat your fill!"},{"name":"CIRINA","text":"I did not think it would be so expensive..."},{"name":"NARENGAWA","text":"There, there. You did well to travel so far."},{"name":"UCUGEN","text":"Where shall we go next?"},{"name":"GORO02500","text":"I have brought you a new brush, my beloved. So smooth and silky your mane shall be─the envy of every other man..."},{"name":"GORO02500","text":"Hm? Say again? You are seeking who?"},{"name":"GORO02500","text":"Ah, the Doman. I know of whom you speak. He comes and goes with a Mol girl."},{"name":"GORO02500","text":"Though I could not describe her. I only know that she is Mol because I heard them talking as they passed."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase that contains “Mol” to ask the Xaela in Reunion if they are of the Mol tribe."},{"name":"GORO02500","text":"Oh, my dearest, how do I love thee? Let me count the ways..."},{"name":"NARENGAWA","text":"I am Ura, if you must know. Come down from the mountains in the north. If there is nothing else..."},{"name":"UCUGEN","text":"You take me for a Mol!? I am Oronir! Compare me not with ones so weak and lowly!"},{"name":"CIRINA","text":"...Yes? I am Mol. My name is Cirina. May I help you?"},{"name":"CIRINA","text":"Oh... Oh, I see. You are looking for Hien. In that case─"},{"name":"MASGUD","text":"How urgent this business must be to leave our conversation unfinished!"},{"name":"MASGUD","text":"The kinsai. Will you buy it? There is but one bundle left. If not, then─"},{"name":"CIRINA","text":"I will, I will! Though I had not thought to pay so high a price..."},{"name":"MASGUD","text":"It is a bargain for which you should be grateful. If you lack the coin, then the fault is your own, and you will leave with nothing."},{"name":"CIRINA","text":"Please, I must have the kinsai! The gods themselves requested it! We are bound to their will!"},{"name":"MASGUD","text":"...Pay me the difference in whisperroot. I will sell it to the next apothecary to pass through Reunion, and we will each feel fairly treated."},{"name":"MASGUD","text":"But do not tarry. Should another come before you, coin in hand, I will not refuse him."},{"name":"CIRINA","text":"I understand. Thank you for this kindness!"},{"name":"CIRINA","text":"I am sorry, but we must speak of Hien later. I cannot leave Reunion without that kinsai..."},{"name":"SAYTODO","text":"Mol"}],"reward":{"gil":717,"items":[{"id":27365,"one":1,"hq":1},{"id":27366,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":142}],"quests":[68166]},"next":[68037,68288,68289,68290,68291,68292,68293]},"partials":[{"type":"npc","id":"1020079","obj":{"i":1020079,"n":"Yugiri","l":2411,"q":3}},{"type":"npc","id":"1020281","obj":{"i":1020281,"n":"Cirina","l":2411,"q":3}},{"type":"npc","id":"1019349","obj":{"i":1019349,"n":"Baidur","l":2411,"q":5}},{"type":"npc","id":"1019353","obj":{"i":1019353,"n":"Yesui","l":2411,"q":2}},{"type":"npc","id":"1019355","obj":{"i":1019355,"n":"Chambui","l":2411,"q":5}},{"type":"npc","id":"1019360","obj":{"i":1019360,"n":"Narengawa","l":2411,"q":1}},{"type":"npc","id":"1019376","obj":{"i":1019376,"n":"Ucugen","l":2411,"q":1}},{"type":"npc","id":"1020080","obj":{"i":1020080,"n":"Lyse","l":2411,"q":2}},{"type":"npc","id":"1020081","obj":{"i":1020081,"n":"Gosetsu","l":2411,"q":2}},{"type":"npc","id":"1020275","obj":{"i":1020275,"n":"Goro Horsemaster","l":2411,"q":1}},{"type":"item","id":"27365","obj":{"i":27365,"n":"Doman Iron Gunblade","l":273,"c":36009,"t":106,"p":38916}},{"type":"item","id":"27366","obj":{"i":27366,"n":"Doman Iron Glaives","l":273,"c":36209,"t":107,"p":38916}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68166","obj":{"i":68166,"n":"Here There Be Xaela","g":6,"l":"Yanxia","s":570}},{"type":"quest","id":"68037","obj":{"i":68037,"n":"A Season for War","g":6,"l":"The Azim Steppe","s":590}},{"type":"quest","id":"68288","obj":{"i":68288,"n":"Silent Banquet","g":110,"l":"The Azim Steppe","s":5010}},{"type":"quest","id":"68289","obj":{"i":68289,"n":"Who Needs Words","g":110,"l":"The Azim Steppe","s":5020}},{"type":"quest","id":"68290","obj":{"i":68290,"n":"Rip-off Reunion","g":110,"l":"The Azim Steppe","s":5030}},{"type":"quest","id":"68291","obj":{"i":68291,"n":"Merchant for a Day","g":110,"l":"The Azim Steppe","s":5040}},{"type":"quest","id":"68292","obj":{"i":68292,"n":"You Buuz, You Lose","g":110,"l":"The Azim Steppe","s":5050}},{"type":"quest","id":"68293","obj":{"i":68293,"n":"Fishing for Customers","g":110,"l":"The Azim Steppe","s":5060}}]}