{"quest":{"name":"A Final Peace","location":"The Azim Steppe","id":68049,"patch":4.0,"sort":710,"eventIcon":71201,"issuer":1021615,"target":1021628,"involved":[1020280],"genre":6,"journal":["Gosetsu has been given much to consider..."],"objectives":["Speak with Sadu.","Pay your respects to Geser.","Speak with Gosetsu."],"dialogue":[{"name":"GOSETSU","text":"This has been an educational experience, to say the least..."},{"name":"GOSETSU","text":"Yet everything we have learned is common knowledge to the people of the Steppe. 'Twill not be enough to earn our comrades their freedom."},{"name":"GOSETSU","text":"Naught less than the Dotharl's plans for the Naadam will suffice, I fear."},{"name":"GOSETSU","text":"Well, I have never been one for skulking about. I will go to Sadu and see what secrets I can prise from her lips!"},{"name":"SADU","text":"The spies return. And they have learned naught."},{"name":"GOSETSU","text":"Mayhap so, but no longer! Though you hide it well, I <span class=\"emphasis\">know</span> you have devised some manner of cunning stratagem for the Naadam! Out with it, I say!"},{"name":"SADU","text":"We are what you see, Doman. We are Dotharl."},{"name":"SADU","text":"Others rely on tricks and traps. Subterfuge. Lies. We have need of naught but our own strength. We meet the enemy in battle and kill him."},{"name":"SADU","text":"That is why I cared not what you did from the first. There is naught for you to learn. Tell your masters to meet us on the field, and make ready to ride with their ancestors."},{"name":"GOSETSU","text":"...Your confidence is plain, as is your strength."},{"name":"GOSETSU","text":"Yet you are not the most prosperous of tribes. The Mol you mock are few, but so too are you. Why?"},{"name":"SADU","text":"...Though a glorious death is to be celebrated, it is yet death."},{"name":"SADU","text":"While we kill many, many are killed in turn. In the wake of our battles, the soil drinks deep of the blood of the fallen, their bodies piled high."},{"name":"SADU","text":"Not all are born again. Only the bravest. Yet one cannot return unless there is a vessel to inherit the soul, and if warriors die ere they birth children, then that is that."},{"name":"SADU","text":"Even the brave warrior who finds a vessel will for many years remain a shadow of his former self. It falls to his elders to endure until he is ready to accept his responsibilities."},{"name":"SADU","text":"Ever will we meet our enemies in battle without fear. Such is our way, even when our numbers dwindle. If we die, so be it─but know that we fight to live, not to die."},{"name":"SADU","text":"Dotharl train and make ready for the day─but they do not rush to meet it. Not until we have done our duty."},{"name":"DOTHARL02511","text":"Sadu Khatun. Geser's body has been given to the sands."},{"name":"SADU","text":"Then our part is done. Rest, warrior. The Naadam draws near, and you will need your strength."},{"name":"SADU","text":"If you intend to fight in the Naadam, you should return to the Mol and make ready. But know that when next we meet, you and yours will die. ...Or you could fight for us and live. Think on it, travelers."},{"name":"GOSETSU","text":"...We shall. But if you would permit me a final question ere we part...where is this place that Geser has been lain to rest?"},{"name":"GOSETSU","text":"Though I knew him not, I was there at his end. I wish to say a few words."},{"name":"SADU","text":"Rites for the flesh? I have heard of this. Madness, I say, for his body is of the earth now. He will not hear you."},{"name":"SADU","text":"But you may speak to the sands, if that is your will. They lie to the west. Make haste, for the gedan may already have caught his scent."},{"name":"GOSETSU","text":"My apologies, <span class=\"highlight\">Forename</span>. This will take but a moment."},{"name":"SADU","text":"Return to your Mol, and die with them if that be your wish. But ware the ones in yellow as you go. <span class=\"emphasis\">They</span> are fond of secrets and stratagems, and will not hesitate to involve you."},{"name":"GOSETSU","text":"Well, then. We must all be on our way─even Geser."},{"name":"GOSETSU","text":"Let us return to the Dawn Throne, and pray that our tale is enough to satisfy our “most radiant” taskmaster."}],"reward":{"gil":900,"items":[{"id":18539,"one":1,"hq":1},{"id":18551,"one":1,"hq":1},{"id":18557,"one":1,"hq":1},{"num":3,"id":5668,"one":1}],"xp":216000},"reqs":{"jobs":[{"lvl":66,"id":142}],"quests":[68048]},"next":[68050]},"partials":[{"type":"npc","id":"1021615","obj":{"i":1021615,"n":"Gosetsu","l":2411,"q":2}},{"type":"npc","id":"1021628","obj":{"i":1021628,"n":"Gosetsu","l":2411,"q":2}},{"type":"npc","id":"1020280","obj":{"i":1020280,"n":"Sadu","l":2411,"q":3}},{"type":"item","id":"18539","obj":{"i":18539,"n":"Marid Leather Boots of Aiming","l":279,"c":46765,"t":38,"p":21641}},{"type":"item","id":"18551","obj":{"i":18551,"n":"Marid Leather Boots of Healing","l":279,"c":46764,"t":38,"p":21641}},{"type":"item","id":"18557","obj":{"i":18557,"n":"Marid Leather Boots of Casting","l":279,"c":46763,"t":38,"p":21641}},{"type":"item","id":"5668","obj":{"i":5668,"n":"Heavens' Eye Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}},{"type":"quest","id":"68050","obj":{"i":68050,"n":"As the Gods Will","g":6,"l":"The Azim Steppe","s":720}}]}