{"quest":{"name":"Sworn Enemies of the Sun","location":"The Azim Steppe","id":68047,"patch":4.0,"sort":690,"icon":100656,"eventIcon":71201,"issuer":1019417,"target":1021625,"involved":[1019431,1021605,1021606,1021608,1021624,1021730,1021731,1021732,1022078],"genre":6,"journal":["Magnai has a new task in mind for you and yours.","You and your companions continue to enjoy the hospitality of the Oronir and their leader, the most radiant brother Magnai. As prisoners of the tribe, you have been coerced into performing menial tasks as expressions of tribute. Lord Hien, for his part, has treated the whole affair as an opportunity to learn more about your rivals in the Naadam. Alas, it seems he and Lyse will not be allowed to take part in your next duty─to reconnoiter the encampment of the Dotharl.","To encroach upon the territory of so infamous a tribe without first taking their measure would seem exceedingly unwise. Happily, if Gosetsu's map is to be believed, there is a colossal wreck to the south of the Dawn Throne from which the two of you should be able to survey Dotharl Khaa at a safe distance.","You observe two hunters beset by massive beasts. One falls before you can act, but the other may yet be saved...","You reach the embattled Xaela and slay the beasts in time to save his life. Alas, as you suspected, it is too late for his comrade. Moments later, you are confronted by Sadu, khatun of the Dotharl, who spares but a moment for her fallen kinsman before demanding to know who you are. She can barely contain her disdain when she learns you are friends of the Mol, though she affords you some token respect after you tell her of your intent to fight in the Naadam. For saving her fellow tribesman's life, she grants you leave to enter Dotharl Khaa, and then turns to leave─but not before telling the still-bleeding hunter to see to his comrade's corpse.","Though he recognizes Sadu as a woman not to be crossed, Gosetsu cannot contain his anger at the callous disregard she showed her own dead. Never one to bite his tongue, he seems intent on going after the khatun and giving her a piece of his mind."],"objectives":["Speak with Gosetsu.","Stand /lookout at the Dusk Throne.","Save the wounded hunter.","Speak with Gosetsu."],"dialogue":[{"name":"LYSE","text":"You're back. They had me milking sheep, by the way. It was, um, interesting..."},{"name":"HIEN","text":"Another “task” completed, eh? I wonder what the most radiant brother has in store for us next."},{"name":"GOSETSU","text":"At a glance, their arms and armor may seem crude compared to those of Doma, but they are well crafted, and no less effective."},{"name":"MAGNAI","text":"...A pity you will not pledge yourselves to the Sun. You might have proved useful in the coming Naadam."},{"name":"MAGNAI","text":"Nevertheless, I will permit you to return and fight for the Mol. Their cause is futile, with or without your assistance. However, you must first complete a final task, as was my decree."},{"name":"MAGNAI","text":"You will reconnoiter the encampment of the Dotharl."},{"name":"MAGNAI","text":"For this task, two will go, and two will remain."},{"name":"MAGNAI","text":"Should the two who embark upon this expedition choose to flee, or be captured or killed by the Dotharl, then the others will be taken as slaves and serve the Sun unto death."},{"name":"LYSE","text":"We'd better not fail then, eh? The question is, who should we send?"},{"name":"MAGNAI","text":"That is not for you to decide."},{"name":"MAGNAI","text":"All of you have conquered Bardam's Mettle and proven yourselves warriors of the Steppe. You should all be equally capable of carrying out this task, and therefore, you should have no objections."},{"name":"MAGNAI","text":"The first choice of hostage shall be mine─though it is hardly a choice, given the circumstances."},{"name":"MAGNAI","text":"The red woman will remain. Doubtless you are not the moon I seek, but stranger tales have been told─and the men are of no use to me."},{"name":"MAGNAI","text":"You may have your pick of the men."},{"name":"DAIDUKUL","text":"Hmm... Yes...yes..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Me, me! Pick meee!"},{"name":"A1","text":"What are you looking at?"},{"name":"DAIDUKUL","text":"The firewalker! Yes, this Doman is my choice."},{"name":"HIEN","text":"Hah hah! I don't know whether to be flattered or insulted. Mayhap both."},{"name":"HIEN","text":"I had hoped to see these undying ones for myself, but it seems it was not meant to be."},{"name":"HIEN","text":"I know you will be fine, but permit me to wish you luck all the same."},{"name":"GOSETSU","text":"We will return soon, my lord. But, if the kami are unkind, and we fail in our mission, then do what you must to survive. For Doma."},{"name":"DAIDUKUL","text":"Brother Magnai. A word."},{"name":"DAIDUKUL","text":"The Buduga require that a hostage be male, for if these ones fail, we cannot accept a woman as a slave."},{"name":"DAIDUKUL","text":"Therefore, we choose the firewalker. The one they call Hien."},{"name":"MAGNAI","text":"...So be it. I shall choose second."},{"name":"MAGNAI","text":"I doubt either of you are the moon I seek, but stranger tales have been told─and men are of no use to me..."},{"name":"LYSE","text":"I don't know what this “moon” stuff is that he's going on about, but I don't like the sound of it. At all."},{"name":"MAGNAI","text":"...No, of course not. The woman I seek is of the dusk─a gentle, ethereal maiden. A dancer in the morning mist."},{"name":"MAGNAI","text":"You are warriors of the Steppe─fierce and brutal, conquerors of magicked stone and steel. Ethereal you are not."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm your rolanberry."},{"name":"A2","text":"You try <span class=\"emphasis\">ethereally</span> chasing after lambs, when your boots are full of lake water."},{"name":"MAGNAI","text":"...A Western expression, I presume. Betokening...I care not what."},{"name":"MAGNAI","text":"Ah...how well your tasks befitted you both."},{"name":"MAGNAI","text":"But since I must choose, I choose you. You did well milking the sheep─they took a liking to you, I am told."},{"name":"HIEN","text":"Gosetsu and <span class=\"highlight\">Forename</span>, then. I had hoped to see these undying ones for myself, but it seems it was not meant to be."},{"name":"MAGNAI","text":"Dotharl Khaa lies far to the south, where the grass turns to sand."},{"name":"MAGNAI","text":"Return with valuable knowledge, and all will be free to rejoin the Mol. Now go."},{"name":"GOSETSU","text":"Have no fear, my friend. We shall see them freed soon enough. Let us quit this place and speak of our plans outside."},{"name":"MAGNAI","text":"Journey south to Dotharl Khaa and return with knowledge. Do this, and your comrades shall walk free."},{"name":"MAGNAI","text":"...You wonder why I chose her instead of you?"},{"name":"MAGNAI","text":"There is a violence in you both. Hers is untamed. Yours is honed. She cannot be trusted."},{"name":"DAIDUKUL","text":"I will not mourn your death. Rather, I will celebrate it."},{"name":"BAATU","text":"Perhaps you think they were chosen because they are more valuable to us as slaves? You would not be wrong. Regardless, you are free. Be glad of it."},{"name":"GOSETSU","text":"'Tis plain they hope we will never return. I shall enjoy disappointing them."},{"name":"GOSETSU","text":"According to my map, there is a colossal wreck to the south which should provide a vantage point from which to survey Dotharl Khaa from afar. Let us go and do just that."},{"name":"GOSETSU","text":"I spy tents to the west─theirs, I presume. What do you see?"},{"name":"GOSETSU","text":"Over there, look! Those men are in danger!"},{"name":"GOSETSU","text":"Gah! Too late for the one, perhaps, but there is yet time to save the other."},{"name":"GOSETSU","text":"Come! We cannot abandon him to his fate!"},{"name":"GOSETSU","text":"These ones are mine! Go! Help the man!"},{"name":"DOTHARL02511","text":"&lt;cough&gt; &lt;wheeze&gt; I...I owe you my life."},{"name":"GOSETSU","text":"Nay, friend, think nothing of it. I but wish we had come sooner..."},{"name":"GOSETSU","text":"I knew at once he was dead. It will come as scant comfort, I fear, but I slew the beasts responsible."},{"name":"DOTHARL02511","text":"Nay... That is no way for a Dotharl to die."},{"name":"SADU","text":"(-???-)What is this? Who are these outsiders?"},{"name":"DOTHARL02511","text":"Sadu Khatun! Forgive me. We were returning from our hunt when we were caught unawares by manzasiri."},{"name":"DOTHARL02511","text":"These ones saved me, but Geser is..."},{"name":"SADU","text":"Who are you? Why have you come? Not to cross the sands, that much is certain."},{"name":"SADU","text":"I have heard tales of travelers in league with another tribe. Are you they? Who do you serve? Answer me."},{"name":"GOSETSU","text":"If I may begin to answer your questions before you ask more...we are friends of the Mol, and we are come to see the strength of the Dotharl for ourselves."},{"name":"SADU","text":"The Mol? The little lambs who wander to and fro at the behest of their gods?"},{"name":"SADU","text":"Bwahahaha! What fools you are to share the soil of such weaklings! Next you will tell me you wish to fight in the Naadam!"},{"name":"SADU","text":"Ah...so you do. Hah! That is unexpected...yet not unwelcome."},{"name":"SADU","text":"I am Sadu. Khatun of the Dotharl.<br>For your deeds, I grant you leave to walk among us. Come. Look on our glory and despair."},{"name":"SADU","text":"We fear no tribe─least of all the Mol. Though, if you were of the Oronir, I would burn the flesh from your bones here and now."},{"name":"SADU","text":"You can stand, yes? See to the corpse."},{"name":"DOTHARL02511","text":"Y-Yes, Khatun!"},{"name":"DOTHARL02511","text":"Thank you again, but I shall manage on my own."},{"name":"GOSETSU","text":"So that is the leader of the Dotharl. Clearly not a woman to be crossed."},{"name":"GOSETSU","text":"But how callously she spoke of her dead! “See to the corpse”? Surely this warrior deserves better than that..."}],"reward":{"gil":830,"items":[{"id":18537,"one":1,"hq":1},{"id":18549,"one":1,"hq":1},{"id":18555,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":216000},"reqs":{"jobs":[{"lvl":66,"id":142}],"quests":[68046]},"next":[68048]},"partials":[{"type":"npc","id":"1019417","obj":{"i":1019417,"n":"Magnai","l":2411,"q":7}},{"type":"npc","id":"1021625","obj":{"i":1021625,"n":"Gosetsu","l":2411,"q":2}},{"type":"npc","id":"1019431","obj":{"i":1019431,"n":"Daidukul","l":2411,"q":3}},{"type":"npc","id":"1021605","obj":{"i":1021605,"n":"Gosetsu","l":2411,"q":2}},{"type":"npc","id":"1021606","obj":{"i":1021606,"n":"Gosetsu","l":2411,"q":1}},{"type":"npc","id":"1021608","obj":{"i":1021608,"n":"Wounded Hunter","l":2411,"q":2}},{"type":"npc","id":"1021624","obj":{"i":1021624,"n":"Gosetsu","l":2411,"q":1}},{"type":"npc","id":"1021730","obj":{"i":1021730,"n":"Hien","l":2411,"q":5}},{"type":"npc","id":"1021731","obj":{"i":1021731,"n":"Gosetsu","l":2411,"q":6}},{"type":"npc","id":"1021732","obj":{"i":1021732,"n":"Lyse","l":2411,"q":5}},{"type":"npc","id":"1022078","obj":{"i":1022078,"n":"Baatu","l":2411,"q":4}},{"type":"item","id":"18537","obj":{"i":18537,"n":"Marid Leather Gloves of Aiming","l":279,"c":48667,"t":37,"p":21641}},{"type":"item","id":"18549","obj":{"i":18549,"n":"Marid Leather Gloves of Healing","l":279,"c":48666,"t":37,"p":21641}},{"type":"item","id":"18555","obj":{"i":18555,"n":"Marid Leather Gloves of Casting","l":279,"c":48665,"t":37,"p":21641}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68046","obj":{"i":68046,"n":"For Love of the Moon","g":6,"l":"The Azim Steppe","s":680}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}}]}