{"quest":{"name":"For Love of the Moon","location":"The Azim Steppe","id":68046,"patch":4.0,"sort":680,"eventIcon":71201,"issuer":1021730,"target":1019417,"involved":[1019426,1020689,1020690,1020691,1021600,1021601,1021602,1021731,1021732],"genre":6,"journal":["Hien would know more of your captors and their ways."],"objectives":["Speak with Udutai.","Find lost lambs.","Speak with Udutai.","Speak with Hien.","Speak with Magnai."],"dialogue":[{"name":"HIEN","text":"...I know what you're thinking. And yes, I could probably have convinced him to let us go had I handled that differently. But then we would have learned naught for our troubles."},{"name":"HIEN","text":"If there is one thing I know, it is that men of faith yearn to share it with others. And in learning more of their beliefs, we may learn more of other things─things which may prove useful in the Naadam."},{"name":"HIEN","text":"When I was carrying out my tasks, I met an elder─a storyteller─named Udutai. Mayhap he can be our teacher."},{"name":"HIEN","text":"This is the man of whom I spoke, Udutai."},{"name":"UDUTAI","text":"Hm? I can spare no time for you. Other troubles demand my attention."},{"name":"HIEN","text":"What troubles? What ill fortune has befallen you?"},{"name":"UDUTAI","text":"Not me, but my lambs. Some few wandered far and have yet to return."},{"name":"UDUTAI","text":"Mayhap they will return to their mothers in time. Mayhap they will not. Mayhap you can help?"},{"name":"HIEN","text":"If we must, then we must. Let us be about it, <span class=\"highlight\">Forename</span>."},{"name":"HIEN","text":"Where are you, little ones? Your mother is waiting! It is time to come home!"},{"name":"UDUTAI","text":"They cannot have gone below. They must be here somewhere..."},{"name":"HIEN","text":"Greetings. I trust all of our little explorers are safely accounted for?"},{"name":"UDUTAI","text":"That they are. My thanks to you, Doman. Now─you had questions for me?"},{"name":"HIEN","text":"Aye. I would know more of the Oronir─of their creation, and of Father Azim."},{"name":"UDUTAI","text":"As you wish. Come, let us sit."},{"name":"UDUTAI","text":"Before we begin, tell me: what do you know of the Au Ra, and how they came to be?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"In the days before men, Azim and Nhaama waged a bitter war..."},{"name":"A1","text":"The Raen were born of the Dawn Father and the Xaela of the Dusk Mother..."},{"name":"UDUTAI","text":"Yes, yes. A common tale, and one believed by many tribes."},{"name":"UDUTAI","text":"But what it does not mention is this: Azim and Nhaama were lovers."},{"name":"UDUTAI","text":"Oh, they fought in the beginning, as did their creations. That much is true. But when they saw how the Xaela and the Raen rose above their hatreds and joined hands in harmony, their hearts stirred, and the love their children shared became theirs as well."},{"name":"UDUTAI","text":"Alas, he was of the sun and she of the moon. Apart they must remain, lest day and night cease to be, and with them all creation."},{"name":"UDUTAI","text":"With sadness in their hearts they returned to the heavens─he to the day, she to the night, destined to walk before and after, never to meet."},{"name":"UDUTAI","text":"As time passed, Azim's yearning for his beloved grew deeper still. Was there truly naught that could be done, he wondered. At last, he knew."},{"name":"UDUTAI","text":"\"If the Father cannot be with the Mother, then he shall go amongst her children. Now and ever after.“"},{"name":"UDUTAI","text":"So it was that Azim took a fragment of his being and with it fashioned an avatar. Clad in scale of midnight, he descended, and sought out the Xaela."},{"name":"UDUTAI","text":"Yea, he was the first Oronir. We are of his flesh and his blood. We are the children of Azim, and it is our duty to watch over and keep the Xaela safe."},{"name":"HIEN","text":"...I confess, I did not expect the tale of your people's beginnings to be quite so romantic."},{"name":"HIEN","text":"Yet I must ask: if it is your duty to defend the Xaela, how can you go to war with them in the Naadam? Is that not a contradiction?"},{"name":"UDUTAI","text":"If a father disciplines his son, does that mean there is no love in his heart? Xaela are not wont to kneel. They must be made to─only then will they heed reason."},{"name":"HIEN","text":"I see... Such is the way of the Steppe."},{"name":"HIEN","text":"Thank you, elder, for sharing with us your wisdom."},{"name":"UDUTAI","text":"Eager to depart? Ere you go, you would do well to hear the end of my tale."},{"name":"UDUTAI","text":"When Nhaama looked down and saw the avatar of Azim, she knew him at once, and shed tears of love and longing."},{"name":"UDUTAI","text":"When they struck the earth, they rose anew, as a counterpart to the Oronir. Their fates entwined."},{"name":"UDUTAI","text":"So you see, for every son of Azim is a daughter of Nhaama for whom he must search. Even now."},{"name":"UDUTAI","text":"Come again, traveler. There are tales to be told, songs to be sung."},{"name":"HIEN","text":"Mayhap I am being overly optimistic, but I sense that these Oronir may prove loyal allies to Doma under the right circumstances."},{"name":"HIEN","text":"Their arrogance is rooted in the belief that they must act as caretakers of all Xaela. Therefore, if we can prove to them that we come as kindred spirits, seeking to defeat a common foe..."},{"name":"HIEN","text":"But mayhap this is a discussion for <span class=\"emphasis\">after</span> we win the Naadam. Come, let us return to Magnai."},{"name":"LYSE","text":"You're back. They had me milking sheep, by the way. It was, um, interesting..."},{"name":"HIEN","text":"Another “task” completed, eh? I wonder what the most radiant brother has in store for us next."},{"name":"GOSETSU","text":"At a glance, their arms and armor may seem crude compared to those of Doma, but they are well crafted, and no less effective."},{"name":"MAGNAI","text":"Hmm...you shine with the light of newfound wisdom. Could it be that you have at last accepted the supremacy of the Sun?"},{"name":"MAGNAI","text":"No matter. You have each completed your tasks, and proven yourselves deserving of mercy."},{"name":"MAGNAI","text":"However, if it is freedom you desire, then there is one more thing you must do..."}],"reward":{"gil":934,"items":[{"id":18519,"one":1,"hq":1},{"id":18525,"one":1,"hq":1},{"id":18531,"one":1,"hq":1},{"id":18543,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":216000},"reqs":{"jobs":[{"lvl":66,"id":142}],"quests":[68045]},"next":[68047,68318,68319,68320,68321]},"partials":[{"type":"npc","id":"1021730","obj":{"i":1021730,"n":"Hien","l":2411,"q":5}},{"type":"npc","id":"1019417","obj":{"i":1019417,"n":"Magnai","l":2411,"q":7}},{"type":"npc","id":"1019426","obj":{"i":1019426,"n":"Udutai","l":2411,"q":1}},{"type":"npc","id":"1020689","obj":{"i":1020689,"n":"Hien","l":2411,"q":1}},{"type":"npc","id":"1020690","obj":{"i":1020690,"n":"Hien","l":2411,"q":1}},{"type":"npc","id":"1020691","obj":{"i":1020691,"n":"Lost Lamb","l":2411,"q":1}},{"type":"npc","id":"1021600","obj":{"i":1021600,"n":"Lost Lamb","l":2411,"q":1}},{"type":"npc","id":"1021601","obj":{"i":1021601,"n":"Lost Lamb","l":2411,"q":1}},{"type":"npc","id":"1021602","obj":{"i":1021602,"n":"Lost Lamb","l":2411,"q":1}},{"type":"npc","id":"1021731","obj":{"i":1021731,"n":"Gosetsu","l":2411,"q":6}},{"type":"npc","id":"1021732","obj":{"i":1021732,"n":"Lyse","l":2411,"q":5}},{"type":"item","id":"18519","obj":{"i":18519,"n":"Doman Steel Gauntlets of Fending","l":279,"c":48661,"t":37,"p":21641}},{"type":"item","id":"18525","obj":{"i":18525,"n":"Doman Steel Gauntlets of Maiming","l":279,"c":48662,"t":37,"p":21641}},{"type":"item","id":"18531","obj":{"i":18531,"n":"Doman Steel Gauntlets of Striking","l":279,"c":48663,"t":37,"p":21641}},{"type":"item","id":"18543","obj":{"i":18543,"n":"Doman Steel Gauntlets of Scouting","l":279,"c":48664,"t":37,"p":21641}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68045","obj":{"i":68045,"n":"The Labors of Magnai","g":6,"l":"The Azim Steppe","s":670}},{"type":"quest","id":"68047","obj":{"i":68047,"n":"Sworn Enemies of the Sun","g":6,"l":"The Azim Steppe","s":690}},{"type":"quest","id":"68318","obj":{"i":68318,"n":"Forty Years and Counting","g":110,"l":"The Azim Steppe","s":6040,"f":1}},{"type":"quest","id":"68319","obj":{"i":68319,"n":"Chasing Rainbows","g":110,"l":"The Azim Steppe","s":6050}},{"type":"quest","id":"68320","obj":{"i":68320,"n":"The Tournament","g":110,"l":"The Azim Steppe","s":6060}},{"type":"quest","id":"68321","obj":{"i":68321,"n":"The Strongest among Us","g":110,"l":"The Azim Steppe","s":6070}}]}