{"quest":{"name":"The Heart of Nations","location":"The Azim Steppe","id":68041,"patch":4.0,"sort":630,"eventIcon":71201,"issuer":1020501,"target":1020544,"involved":[1019396,1020545,1020546,1020549,1021741,1021742,1021743,1021744],"genre":6,"journal":["If you wish for employment, Cirina has a suggestion."],"objectives":["Speak with Dorbei.","Speak with Lyse.","Gather dung. ","Deliver the dung to Lyse.","Speak with Cirina.","Speak with Hien."],"dialogue":[{"name":"HIEN","text":"Mayhap now would be a good time to speak with Gosetsu at greater length, and learn more of our countrymen's plight."},{"name":"GOSETSU","text":"Such kindness and generosity they have shown not only my lord, but us all. Victory in the Naadam will be a fitting repayment!"},{"name":"CIRINA","text":"It will be a little while before the meal is ready. If you and Lyse wish to fill the time, perhaps you could assist Dorbei?"},{"name":"CIRINA","text":"He has many responsibilities, and would welcome your help. Nor would you regret making his acquaintance, for he is liked and respected by all."},{"name":"CIRINA","text":"You may find him by the other yurt, taking stock of our supplies."},{"name":"CIRINA","text":"Leave the cooking to me! I promise I will not disappoint you."},{"name":"DORBEI","text":"Ah. One of the newcomers. Welcome. I spoke with Lyse."},{"name":"DORBEI","text":"I bade her help the children gather fuel for the cookfires. I trust it will be a good experience for all."},{"name":"DORBEI","text":"For you too, perhaps. Seek them in the south, across the bridge."},{"name":"DORBEI","text":"Please use the bridge. One should not sully flowing waters without cause."},{"name":"LYSE","text":"Oh, <span class=\"highlight\">Forename</span>! Are you here to help too?"},{"name":"LYSE","text":"Great! So...I suppose Dorbei told you that the children and I are gathering “fuel” for the fires, did he?"},{"name":"LYSE","text":"It'll need to be dried before they can burn it, of course. You, um...you do understand what we're here for, right? Only, some people can be a bit squeamish about this sort of stuff."},{"name":"LYSE","text":"Then again, you've never minded getting your hands dirty, have you? Anyway, we're trying to get four piles each. Good luck! And keep an eye on the children while you're at it, eh?"},{"name":"LYSE","text":"The children are around here somewhere. You should talk to them. They're great!"},{"name":"01GIRL02505","text":"Oh, you are Lyse's friend! Are you here to help us too?"},{"name":"02BOY02505","text":"...How do you do."},{"name":"03BOY02505","text":"Traveler! I will not lose to you! I shall find three times as much dung as you─at least!"},{"name":"04GIRL02505","text":"I cannot seem to find any dung here. Maybe somewhere else...?"},{"name":"LYSE","text":"Well? Have you found your share yet?"},{"name":"LYSE","text":"Good work. I hope you took the time to talk to the children while you were at it."},{"name":"03BOY02505","text":"Lyse! Lyse! Look how much dung we have!"},{"name":"LYSE","text":"Wow, I'm impressed! I thought <span class=\"emphasis\">we'd</span> gathered a lot, but it looks like we'll have to admit defeat!"},{"name":"04GIRL02505","text":"Dorbei will be happy we found enough..."},{"name":"01GIRL02505","text":"Not just Dorbei! Now we can continue making cheese! Not that I was worried─it was easier when we were living near that forest, but dung works just as well as wood."},{"name":"LYSE","text":"I heard the Mol move from place to place─that the gods tell you where to go. That must be hard on you all..."},{"name":"03BOY02505","text":"Hard? I do not understand. Why is it hard?"},{"name":"03BOY02505","text":"It is better for the animals to move─to have more food to eat and land to roam. To stay in one place is harder, no?"},{"name":"02BOY02505","text":"...From the heavens comes the rain which nourishes the soil. From the soil comes the grass which nourishes the beast. From the beast comes the flesh which nourishes the Xaela. Ours is the soil of one and all."},{"name":"01GIRL02505","text":"But you Westerners are like the Domans─you live in the same place. In villages. And all the villages in one place are part of a “nation,” yes?"},{"name":"01GIRL02505","text":"Hien talks about nations sometimes. When he was injured, he spoke of Doma in his sleep, but I did not understand his words."},{"name":"04GIRL02505","text":"Whenever I ask him about Doma, he just smiles and looks to the south..."},{"name":"04GIRL02505","text":"It reminds me of my mother when she waits for my father to return from a long journey... But Hien will not wait any longer, will he? Because you came for him. To take him back...because his nation is more important..."},{"name":"LYSE","text":"Um...I'm not sure how to answer this..."},{"name":"LYSE","text":"A nation...is a place, I suppose. A place...and the people in it...and maybe the things, too..."},{"name":"LYSE","text":"But more than that, it's the history, the traditions, the words. The stories we tell ourselves and our children. Everything that came before and everything that comes after."},{"name":"LYSE","text":"The place we were born is part of who we are. We carry it with us, no matter where we go. Whoever...whatever we become, that part remains─that link to our fathers and their fathers before them..."},{"name":"LYSE","text":"It's...it's not important to everyone, I suppose, and that's fine. But it's important to Hien. And to me."},{"name":"02BOY02505","text":"...Some call the Mol fools for listening to the elder gods, but it is our way. Our pride. Our...nation?"},{"name":"LYSE","text":"Something like that. It's something precious that you and others share─and that no one can ever take from you."},{"name":"LYSE","text":"But we can talk more about it later! It's time to go home. Dorbei is waiting!"},{"name":"LYSE","text":"I'll stay with the children. Why not go and let Cirina know how we got on?"},{"name":"DORBEI","text":"You aided the children? That is well. I trust you enjoyed their company."},{"name":"CIRINA","text":"Welcome back, <span class=\"highlight\">Forename</span>. Did you speak with Dorbei?"},{"name":"CIRINA","text":"Well, well! Then you will forgive me if I ask you to wash your hands. I shall pour you a cup of milk tea in the meantime."},{"name":"CIRINA","text":"The meal is almost ready, so we should summon Hien and Gosetsu..."},{"name":"LYSE","text":"&lt;yawn&gt; That was just what I needed!"},{"name":"GOSETSU","text":"A new beginning lies beyond the horizon. We have but to seize it with our own two hands."},{"name":"CIRINA","text":"Was the food to your liking? Good, good..."},{"name":"HIEN","text":"Well, my friends! I for one am full of vim and vigor! I trust you feel the same?"},{"name":"HIEN","text":"Then what better time than now to undertake our trial, and become full-fledged warriors of the Mol!"}],"reward":{"gil":994,"items":[{"id":18345,"one":1,"hq":1},{"id":18347,"one":1,"hq":1},{"id":18351,"one":1,"hq":1},{"id":18358,"one":1,"hq":1},{"num":3,"id":5723,"one":1}],"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":142}],"quests":[68040]},"next":[68042,68307,68308,68309]},"partials":[{"type":"npc","id":"1020501","obj":{"i":1020501,"n":"Cirina","l":2411,"q":4}},{"type":"npc","id":"1020544","obj":{"i":1020544,"n":"Hien","l":2411,"q":4}},{"type":"npc","id":"1019396","obj":{"i":1019396,"n":"Dorbei","l":2411,"q":3}},{"type":"npc","id":"1020545","obj":{"i":1020545,"n":"Lyse","l":2411,"q":4}},{"type":"npc","id":"1020546","obj":{"i":1020546,"n":"Gosetsu","l":2411,"q":4}},{"type":"npc","id":"1020549","obj":{"i":1020549,"n":"Lyse","l":2411,"q":1}},{"type":"npc","id":"1021741","obj":{"i":1021741,"n":"Bright-eyed Mol Girl","l":2411,"q":1}},{"type":"npc","id":"1021742","obj":{"i":1021742,"n":"Reserved Mol Boy","l":2411,"q":1}},{"type":"npc","id":"1021743","obj":{"i":1021743,"n":"Boisterous Mol Boy","l":2411,"q":1}},{"type":"npc","id":"1021744","obj":{"i":1021744,"n":"Willowy Mol Girl","l":2411,"q":1}},{"type":"item","id":"18345","obj":{"i":18345,"n":"Doman Iron Longsword","l":273,"c":30565,"t":2,"p":25944}},{"type":"item","id":"18347","obj":{"i":18347,"n":"Doman Iron War Axe","l":273,"c":31537,"t":3,"p":38916}},{"type":"item","id":"18351","obj":{"i":18351,"n":"Doman Iron Greatsword","l":273,"c":34290,"t":87,"p":38916}},{"type":"item","id":"18358","obj":{"i":18358,"n":"Doman Iron Uchigatana","l":273,"c":36440,"t":96,"p":38916}},{"type":"item","id":"5723","obj":{"i":5723,"n":"Quicktongue Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"68040","obj":{"i":68040,"n":"A Warrior's Welcome","g":6,"l":"The Azim Steppe","s":620}},{"type":"quest","id":"68042","obj":{"i":68042,"n":"A Trial Before the Trial","g":6,"l":"The Azim Steppe","s":640}},{"type":"quest","id":"68307","obj":{"i":68307,"n":"Sheep Snatcher","g":110,"l":"The Azim Steppe","s":5200,"f":1}},{"type":"quest","id":"68308","obj":{"i":68308,"n":"And Dzo It Goes","g":110,"l":"The Azim Steppe","s":5210}},{"type":"quest","id":"68309","obj":{"i":68309,"n":"Shop till the Warrior of Light Drops","g":110,"l":"The Azim Steppe","s":5220}}]}