{"quest":{"name":"The Labors of Magnai","location":"The Azim Steppe","id":68045,"patch":4.0,"sort":670,"eventIcon":71201,"issuer":1022078,"target":1019417,"involved":[1020687,1021730,1021731,1021732,1023089],"genre":6,"journal":["Baatu shall tell you how you might serve the Oronir."],"objectives":["Speak with Baatu.","Speak with the Oroniri spearson.","Obtain swordgrass.","Deliver the swordgrass to Baatu.","Speak with Magnai."],"dialogue":[{"name":"LYSE","text":"I know, I know, I probably should've left the talking to everyone else..."},{"name":"HIEN","text":"Pretentious and preening he may be, but doubt not that he is a warrior. You saw the axe by his throne...and the rage in his eyes."},{"name":"GOSETSU","text":"Favor, tribute...how easily the language of tyrants tumbles from this khan's lips."},{"name":"BAATU","text":"Warriors of the Steppe! By the grace of our most radiant brother, you will not die this day, but instead be granted an opportunity to contribute to our cause."},{"name":"BAATU","text":"Rejoice, for this is a great honor indeed. Serve well, and you will be rewarded."},{"name":"LYSE","text":"Question! You keep calling Magnai your “most radiant brother.” You're not related or something, are you?"},{"name":"BAATU","text":"...All Oronir are descendants of Father Azim. But if you mean to ask if our mothers are one and the same, then no. The most radiant is the elder brother to we younger─the strongest and most deserving of respect."},{"name":"BAATU","text":"No more interruptions! Your duties are as follows."},{"name":"BAATU","text":"You, the red woman. You will milk our beasts. To grow strong, one must be well fed, and we have great need of kumis and cheese."},{"name":"LYSE","text":"...Is that it? I mean, I'm not happy about all this, but I suppose I can go along for now."},{"name":"BAATU","text":"You, the one who lumbers as a mountain... Hm. An old warrior, I see. We have arms and armor in need of repair. Go and speak with our menders."},{"name":"GOSETSU","text":"I have no talent for delicate work, but if that is your wish, then so be it."},{"name":"BAATU","text":"You, the insolent fool. As for you─"},{"name":"DAIDUKUL","text":"This one carries the fire. The Buduga would take his measure."},{"name":"DAIDUKUL","text":"Seek my comrade outside tending to the stores. He will give you your task. You will know him by his cloth─unlike they of the yellow, we are of the green."},{"name":"HIEN","text":"I, for one, would welcome the opportunity to learn more of the Buduga and their ways. It would be an honor!"},{"name":"BAATU","text":"...We shall speak of your task outside. With me."},{"name":"BAATU","text":"Your name, foreigner?"},{"name":"BAATU","text":"...<span class=\"highlight\">Forename</span>, then. You are to dive into Azim Khaat, below the Dawn Throne, and gather swordgrass from the lakebed."},{"name":"BAATU","text":"It is an invaluable ingredient in many medicines. Eight bundles will you bring."},{"name":"BAATU","text":"You will need to dive deep to obtain that which you seek...but that shall pose no trouble for a true warrior, no?"},{"name":"BAATU","text":"Some say that the dominion of the Dawn Father and the Dusk Mother does not extend beneath the water. But ours does. Indeed, the Oronir fear naught above nor below."},{"name":"BAATU","text":"Speak with the guard to descend. We shall speak again when you have finished."},{"name":"THEDAWNTHRONEUPPERKEEPER","text":"Yes, yes, I know who you are. You wish to go below?"},{"name":"SYSTEM","text":"Leave the Dawn Throne?"},{"name":"BAATU","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> returns, and with swordgrass in hand?"},{"name":"BAATU","text":"...That you would immerse yourself in the depths is a testament to your bravery. Well done."},{"name":"BAATU","text":"Lest you wonder, we will use it to prepare potions to induce paralysis. In the Naadam, we must use every means at our disposal to delay our foes."},{"name":"BAATU","text":"He who inscribes his deeds upon the sacred ground shall be declared the victor. However, none may know this place until the Gharl have scattered the soil."},{"name":"BAATU","text":"It matters not. We shall be swift as stallions and fierce as baras. The Steppe will be ours once more!"},{"name":"BAATU","text":"Your tribute is accepted. We will return to the most radiant, and you may beg a boon."},{"name":"HIEN","text":"Ah, there you are. The others have yet to return."},{"name":"BAATU","text":"To approach the most radiant still sullied by the depths is an insult. Dry yourself."},{"name":"MAGNAI","text":"...Am I to understand you have completed your tasks?"},{"name":"HIEN","text":"I know not what yours was, but mine was surprisingly simple."},{"name":"HIEN","text":"They bade me carry various goods and sundries from storehouse to storehouse. Alas, it was difficult to learn much with all the Buduga swarming around me..."},{"name":"MAGNAI","text":"You dove deep into the waters to harvest swordgrass? I see. That is well."},{"name":"HIEN","text":"Most radiant brother Magnai, we have given you tribute, as demanded. Were we to beg leave to depart with our comrades, would you consent?"},{"name":"MAGNAI","text":"We never intended to press you into our service, and tribute offered in good faith cannot be denied. To grant you naught in return would be an affront to Father Azim."},{"name":"MAGNAI","text":"However, the boon must be proportional to the supplications. What you ask far exceeds what you have earned."},{"name":"HIEN","text":"...Then if we must remain here, would you at least permit us to learn more of your people and your ways?"},{"name":"HIEN","text":"Temulun Khatun taught me but a fraction, you see..."},{"name":"HIEN","text":"How this world born of the gods was to be their battlefield, their creations to fight in their stead."},{"name":"HIEN","text":"How Azim, Father of the Dawn, he who birthed the sun, and Nhaama, Mother of the Dusk, she who birthed the moon, made the Au Ra..."},{"name":"HIEN","text":"Yet though these children warred for a time, eventually they laid down their arms and came to love one another. And so the gods bequeathed this world to their children, and ascended to the heavens whence they came."},{"name":"HIEN","text":"Those born of the Dawn Father were called the Raen, and those born of the Dusk Mother were called the Xaela. So it was and ever after."},{"name":"HIEN","text":"But I say to you, Brother Magnai─how can this be? How can Oronir be the children of Azim, if they are Xaela born of Nhaama?"},{"name":"MAGNAI","text":"...You amuse me, Doman. How you wield your ignorance as a weapon."},{"name":"MAGNAI","text":"Very well. I bid you speak with our elders and learn the truth of this world."}],"reward":{"gil":865,"xp":216000},"reqs":{"jobs":[{"lvl":66,"id":142}],"quests":[68044]},"next":[68046,68315,68316,68317]},"partials":[{"type":"npc","id":"1022078","obj":{"i":1022078,"n":"Baatu","l":2411,"q":4}},{"type":"npc","id":"1019417","obj":{"i":1019417,"n":"Magnai","l":2411,"q":7}},{"type":"npc","id":"1020687","obj":{"i":1020687,"n":"Baatu","l":2411,"q":1}},{"type":"npc","id":"1021730","obj":{"i":1021730,"n":"Hien","l":2411,"q":5}},{"type":"npc","id":"1021731","obj":{"i":1021731,"n":"Gosetsu","l":2411,"q":6}},{"type":"npc","id":"1021732","obj":{"i":1021732,"n":"Lyse","l":2411,"q":5}},{"type":"npc","id":"1023089","obj":{"i":1023089,"n":"Oroniri Spearson","l":2411,"q":1,"t":"Gate Guard"}},{"type":"quest","id":"68044","obj":{"i":68044,"n":"The Children of Azim","g":6,"l":"The Azim Steppe","s":660}},{"type":"quest","id":"68046","obj":{"i":68046,"n":"For Love of the Moon","g":6,"l":"The Azim Steppe","s":680}},{"type":"quest","id":"68315","obj":{"i":68315,"n":"The World without Her","g":110,"l":"The Azim Steppe","s":6010}},{"type":"quest","id":"68316","obj":{"i":68316,"n":"Spoils of War","g":110,"l":"The Azim Steppe","s":6020}},{"type":"quest","id":"68317","obj":{"i":68317,"n":"Broken Flowers","g":110,"l":"The Azim Steppe","s":6030}}]}