{"quest":{"name":"In Crimson They Walked","location":"The Azim Steppe","id":68053,"patch":4.0,"sort":750,"icon":100658,"eventIcon":71201,"issuer":1021633,"target":1021646,"involved":[1019319,1019382,1019417,1020280,1021631,1021632,1021642,1021643,1021644,1021645,1021647,1021648,1021649,1021730,1021731,1021732,1021733,1021924],"genre":6,"journal":["Lord Hien's eyes are filled with determination.","Lord Hien has his Xaela army, and is ready to return to Doma and lead his people to war against the Empire. Before he leaves the Azim Steppe behind, however, he would pay a visit to his new allies. The most radiant brother of the Oronir, who yet occupy the Dawn Throne, is to be first.","To everyone's relief, Magnai renews his vow to render aid to the Domans without a second thought. The mood is only slightly spoiled when he then begins to muse aloud about whether or not Cirina could be his long-sought moon. You leave soon after, eager to meet with Sadu and to put the awkward episode behind you.","Sadu too does not hesitate to reiterate that the Dotharl will gladly go to war for Lord Hien, and that they look forward to a glorious battle in which their souls will burn bright. All commitments reaffirmed, you resume your journey south towards a passage long sealed by the Dotharl's magicks, but no longer.","Crimson is the dusk and the dawn, death and rebirth. An ending to mark a new beginning. Echoing her earlier words, Cirina impresses upon you not to shirk your destiny, or to fear the storm of blood that awaits you, for in crimson there is life. In crimson there is liberation."],"objectives":["Speak with Magnai.","Speak with Sadu.","Speak with Cirina."],"dialogue":[{"name":"LYSE","text":"I think they love you, <span class=\"highlight\">Forename</span>! They really, really love you!"},{"name":"GOSETSU","text":"Like the child and the father, the student and the master, all men need an ideal for which to strive."},{"name":"DORBEI","text":"I...I have acquired a wound for my trouble. But it will heal with time and care. The children are gathering herbs for a poultice."},{"name":"DORBEI","text":"Had the Naadam not ended when it did, I would likely have perished. Thank you."},{"name":"HIEN","text":"At the risk of sounding impatient, we have certain pressing obligations. It is time that we saw to them."},{"name":"TEMULUN","text":"...You are right. To whom much is given, much is expected."},{"name":"GOSETSU","text":"Nay, do not think yourselves so indebted to us. Was it not you who gave us your blessing to participate in the Naadam─and you who saved my lord Hien from certain death?"},{"name":"GOSETSU","text":"Doma is in your debt, and will ever be a friend to the Mol."},{"name":"CIRINA","text":"And we to you, Gosetsu!"},{"name":"CIRINA","text":"A thought occurs to me. If you wish to return to Yanxia with all haste, the passage to the south of the Dusk Throne would offer the most direct route."},{"name":"CIRINA","text":"The Dotharl sealed it with their magicks during the Doman rebellion, when more men in iron came from afar."},{"name":"HIEN","text":"If ever there were a time to open the pass, it is now. We should journey to Dotharl Khaa."},{"name":"HIEN","text":"But before that, might we visit the Dawn Throne? I wish to speak with our most radiant brother."},{"name":"LYSE","text":"Are you sure that's a good idea? I know he agreed to fight for Doma, but I doubt he'll be very happy to see us so soon after we beat him."},{"name":"CIRINA","text":"Nhaama made us for war, Lyse. Ever since we came into this world, we have fought."},{"name":"CIRINA","text":"In the Naadam, blood was shed, and lives were lost. Brown earth was stained crimson, and Xaela wept."},{"name":"CIRINA","text":"But crimson is the dusk and the dawn. Death and rebirth. An ending to mark a new beginning."},{"name":"CIRINA","text":"\"We who are born are destined to die.<br>As the seasons turn, we are born again.“<br>Thus spoke the first."},{"name":"CIRINA","text":"So you see, we harbor no hatreds. The Naadam is the Naadam, and what comes after is what comes after!"},{"name":"LYSE","text":"If you say so... The Dawn Throne first, then?"},{"name":"CIRINA","text":"Yes. And I shall accompany you!"},{"name":"LYSE","text":"Just like that, eh? Not that I expected them to put up a fight..."},{"name":"HIEN","text":"Let us hope we do not find our most radiant friend in a foul mood."},{"name":"GOSETSU","text":"Hmm. There are fewer here than I remember..."},{"name":"CIRINA","text":"I found him quite intimidating before, but perhaps it will be easier this time."},{"name":"TEMULUN","text":"Look always to the light of the stars to guide you in the dark. For none need walk alone."},{"name":"DORBEI","text":"You are for Doma, then. Go safely, khagan. I pray we meet again."},{"name":"MAGNAI","text":"The Sun is disinclined to entertain you at length. Speak your purpose in coming."},{"name":"LYSE","text":"&lt;sigh&gt; Humble as ever..."},{"name":"MAGNAI","text":"Should I be humble in the presence of inferiors? I am a child of Azim, and you are not. Your triumph in the Naadam does not raise you to such heights."},{"name":"MAGNAI","text":"Baatu will not be joining us. He was wounded in the Naadam."},{"name":"MAGNAI","text":"...His hurts are grave, and he requires rest. But he will walk again in time."},{"name":"MAGNAI","text":"Though it is no business of yours. Such pity does not become a khagan. We are not allies, traveler─far from it. The Naadam will come again, and with it our rule."},{"name":"MAGNAI","text":"I say again, why have you come? To bid us surrender the Dawn Throne to the Mol?"},{"name":"CIRINA","text":"N-Nay. The Mol are beholden to the will of the gods, and they would not have us reside here. The Oronir and the Buduga may remain."},{"name":"HIEN","text":"We are for Yanxia, and wished to speak of your part in the coming war."},{"name":"MAGNAI","text":"Ah, the Domans and the ironmen. I remember our pact. Sound the call and the Oronir will answer."},{"name":"HIEN","text":"Full glad am I to hear it. We have preparations to attend to, but will send for you soon."},{"name":"CIRINA","text":"The gods are kind! I am sure the Oronir will prove a great boon in the days to come."},{"name":"MAGNAI","text":"Of the dusk...a maiden gentle and ethereal. A dancer in the morning mist. And a warrior besides..."},{"name":"MAGNAI","text":"Look into my eyes, child! See you Azim? Are you my Nhaama!?"},{"name":"CIRINA","text":"I...I know not of what you speak, Brother Magnai, but I am certain you are mistaken. Quite."},{"name":"LYSE","text":"We should get going. Right now."},{"name":"LYSE","text":"The dry wind from the desert reminds me of home..."},{"name":"HIEN","text":"Ahh, Dotharl Khaa. Better late than never."},{"name":"GOSETSU","text":"How long has it been since they gave Geser to the sands? Is there aught left of him now, I wonder...?"},{"name":"CIRINA","text":"As daunting as I found it to speak with Brother Magnai, it is nothing compared to the fear I feel at the thought of approaching Sadu Khatun..."},{"name":"MAGNAI","text":"Am I fated to live my life as a sun without a moon? Is there no Nhaama for me...? "},{"name":"SADU","text":"Hmph. The khagan and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> warriors."},{"name":"GOSETSU","text":"Greetings, my lady. We come to you on our journey south, bound for Yanxia where our comrades await us. How fare you and yours in the wake of the Naadam?"},{"name":"SADU","text":"Many were wounded. Some few to the death."},{"name":"SADU","text":"...Resplendent were their souls in the chaos. It was a good battle─a good day to die. Soon we will greet them again."},{"name":"SADU","text":"...And mayhap one who went before them also. Geser's seed has quickened in his lover. When the child is born, we shall see who waits behind its eyes."},{"name":"SADU","text":"Already we must look to the next Naadam. We must grow strong of body and mind, and your war will help us do so. Say the word and we will fly to the field."},{"name":"HIEN","text":"Of that I have no doubt. For you are Dotharl."},{"name":"CIRINA","text":"There is one more thing we would ask of you... The magicks you used to seal the passage to the south. Will you unmake them?"},{"name":"SADU","text":"If that be your wish."},{"name":"GOSETSU","text":"When next we come together, it will be on a great battlefield against a common foe. I trust you will fight with the same fervor you demonstrated during the Naadam."},{"name":"SADU","text":"Hah! And you, ancient one, will be the demon I know you to be. Aught less would be a disappointment."},{"name":"LYSE","text":"So this path leads back to Yanxia...back to Doma, and the others... &lt;sigh&gt; It's so easy to forget why we're doing all this..."},{"name":"HIEN","text":"I will miss this place. Though my heart belongs to Doma, the Steppe and her people will always be dear to me."},{"name":"GOSETSU","text":"I daresay that woman has never known a single regret. I envy her."},{"name":"SADU","text":"Do not fail to call on us, khagan. The preening prince and his little yellow band will not kill half as many ironmen as we Dotharl."},{"name":"SHAR","text":"I have never been a mother. It is a strange feeling to carry another in one's own flesh. I cannot wait to welcome the child into this world, and meet the warrior within."},{"name":"CIRINA","text":"Sadu Khatun has done her part. This passage will deliver you to Doma."},{"name":"CIRINA","text":"It is here we must part ways, until the day you call us to battle."},{"name":"LYSE","text":"It won't be long, I know, but...take care of yourself, Cirina. And tell your grandmother and the others again how much we appreciate everything they did for us."},{"name":"CIRINA","text":"I will. Oh, I nearly forgot! I have another gift for you."},{"name":"LYSE","text":"Oh, it's...a red, um...? Wait, is this a banner of the Mol tribe?"},{"name":"CIRINA","text":"It is not the most practical of gifts, but we nevertheless wished to present it to you."},{"name":"CIRINA","text":"I do not fully understand what has befallen Doma, or your homeland, Lyse. But I do understand that you and yours have suffered terribly."},{"name":"CIRINA","text":"The Mol place their faith in the gods, and in turn they shepherd us. They watch over and keep us. We pray they show you the same favor."},{"name":"CIRINA","text":"As it was in the Naadam, blood will be shed, your lands engulfed in a storm of fire and steel. Yet as it did here, it shall mark a new beginning there."},{"name":"CIRINA","text":"May you ever walk in crimson. For in crimson there is life. There is liberation."},{"name":"HIEN","text":"Thank you for your prayers, Cirina. We shall remember them."},{"name":"CIRINA","text":"Until we meet again!"}],"reward":{"gil":865,"items":[{"id":20639}],"xp":216000},"reqs":{"jobs":[{"lvl":66,"id":142}],"quests":[68052]},"next":[68054,68632]},"partials":[{"type":"npc","id":"1021633","obj":{"i":1021633,"n":"Hien","l":2411,"q":4}},{"type":"npc","id":"1021646","obj":{"i":1021646,"n":"Cirina","l":2411,"q":1}},{"type":"npc","id":"1019319","obj":{"i":1019319,"n":"Shar","l":2411,"q":1}},{"type":"npc","id":"1019382","obj":{"i":1019382,"n":"Temulun","l":2411,"q":5}},{"type":"npc","id":"1019417","obj":{"i":1019417,"n":"Magnai","l":2411,"q":7}},{"type":"npc","id":"1020280","obj":{"i":1020280,"n":"Sadu","l":2411,"q":3}},{"type":"npc","id":"1021631","obj":{"i":1021631,"n":"Gosetsu","l":2411,"q":4}},{"type":"npc","id":"1021632","obj":{"i":1021632,"n":"Lyse","l":2411,"q":4}},{"type":"npc","id":"1021642","obj":{"i":1021642,"n":"Hien","l":2411,"q":1}},{"type":"npc","id":"1021643","obj":{"i":1021643,"n":"Gosetsu","l":2411,"q":1}},{"type":"npc","id":"1021644","obj":{"i":1021644,"n":"Lyse","l":2411,"q":1}},{"type":"npc","id":"1021645","obj":{"i":1021645,"n":"Cirina","l":2411,"q":1}},{"type":"npc","id":"1021647","obj":{"i":1021647,"n":"Hien","l":2411,"q":2}},{"type":"npc","id":"1021648","obj":{"i":1021648,"n":"Gosetsu","l":2411,"q":2}},{"type":"npc","id":"1021649","obj":{"i":1021649,"n":"Lyse","l":2411,"q":2}},{"type":"npc","id":"1021730","obj":{"i":1021730,"n":"Hien","l":2411,"q":5}},{"type":"npc","id":"1021731","obj":{"i":1021731,"n":"Gosetsu","l":2411,"q":6}},{"type":"npc","id":"1021732","obj":{"i":1021732,"n":"Lyse","l":2411,"q":5}},{"type":"npc","id":"1021733","obj":{"i":1021733,"n":"Cirina","l":2411,"q":1}},{"type":"npc","id":"1021924","obj":{"i":1021924,"n":"Dorbei","l":2411,"q":3}},{"type":"item","id":"20639","obj":{"i":20639,"n":"Mol Banner","l":1,"c":51357,"t":79,"p":3000}},{"type":"quest","id":"68052","obj":{"i":68052,"n":"Glory to the Khagan","g":6,"l":"The Azim Steppe","s":740}},{"type":"quest","id":"68054","obj":{"i":68054,"n":"The Hour of Reckoning","g":6,"l":"The Azim Steppe","s":760}},{"type":"quest","id":"68632","obj":{"i":68632,"n":"Something Fishy This Way Comes","g":54,"l":"The Azim Steppe","s":1,"f":1}}]}