{"quest":{"name":"The Doma Within","location":"Yanxia","id":68058,"patch":4.0,"sort":820,"eventIcon":71201,"issuer":1020234,"target":1020239,"involved":[1019285,1019286,1019287,1020232,1020233,1020237,1020238,1020519,1020523,1023083],"genre":6,"journal":["Lyse is more determined than ever to play her part."],"objectives":["Search the House of the Fierce for people in need.","Speak with Hien.","Accompany Hien to Monzen.","Follow Hien.","Search the ruins for usable weapons.","Present the katana to Hien."],"dialogue":[{"name":"ALPHINAUD","text":"The Dairyu Moon Gates have guarded the approach to Doma Castle since long before the imperial occupation."},{"name":"ALPHINAUD","text":"We do not anticipate any great difficulty in gaining entry to the gatehouse as our Doman friends know its every nook and cranny. The challenge will come in preserving the element of surprise. But I am confident the shinobi will rise to the occasion."},{"name":"YUGIRI","text":"During the rebellion, the imperials turned to their agents among the shinobi, and through their treachery were many of my comrades slaughtered."},{"name":"YUGIRI","text":"We few who survived have not forgotten that day. The memory of it has spurred us never to neglect our training, that we might be ready to administer revenge."},{"name":"ISSE","text":"I didn't think we'd have another chance so soon, but here we are. We're going to beat them this time. We have to!"},{"name":"TSURANUKI","text":"All the armor I can provide, you will have. I will labor until I can no longer lift my hammer! "},{"name":"LYSE","text":"Even after twenty-five years of oppression, they still have it in them to stand up and fight. We just have to show them the way forward..."},{"name":"LYSE","text":"Isse and I will stay and help Tsuranuki finish the armor, so you've no need to wait around."},{"name":"LYSE","text":"Why not go back to the House of the Fierce? I'm sure there's plenty of work left to be done. Ask about and see what you can find!"},{"name":"LYSE","text":"Right! Where are the hammers? Just show me what needs hammering!"},{"name":"KAIDATE","text":"Everything is in order, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! Under Lord Gosetsu's sage tutelage, we grow stronger by the day!"},{"name":"KAIDATE","text":"We will acquit ourselves with honor on the battlefield! This I swear!"},{"name":"MOTOJIRO","text":"Hm? Help? Oh, no, no, no─I will not impose upon you without cause! Rest assured that everything is in its place, and every place is in...everything is fine!"},{"name":"MOTOJIRO","text":"Beneath the armor, an imperial is a man like any other. But magitek armor is different. Without the right tactics and equipment, we will be hard-pressed..."},{"name":"HANAME","text":"I require no assistance, comrade. Lord Hien's instructions to me were quite clear─I need only transcribe them for the benefit of our Xaela allies."},{"name":"HANAME","text":"Speaking of Lord Hien, if you are eager to be of service, mayhap you could seek him out? Keep an eye on him, perchance, should he decide to venture outside?"},{"name":"HANAME","text":"Like you, Lord Hien is not given to idleness. He may go whither he will, of course, but I do fear for his safety..."},{"name":"HIEN","text":"Hmm, let me guess: someone asked you to act as my protector? Hah! To hear them mutter, one would think I intended to stride up to the castle gates on my own!"},{"name":"HIEN","text":"The truth, of course, is rather less dramatic. I had hoped to look on the castle one last time before the battle. Would you care to join me? You would be setting a lot of fretful minds at rest..."},{"name":"HIEN","text":"Very good! Then let us depart for Monzen at once."},{"name":"HIEN","text":"Monzen was home to many great and powerful families. Men of honor─samurai. Once..."},{"name":"HIEN","text":"Great swaths were razed, and people put to the sword. What little remains stands as a testament to what was...and what will never be again."},{"name":"HIEN","text":"...Come. I would take a closer look."},{"name":"HIEN","text":"No sentries, at least of the living sort. Those shambling suits of armor have the run of the place. To think this was once a bustling street, so full of life...a river of people, with a current all its own..."},{"name":"HIEN","text":"...But even then, the imperials walked among us. Sometimes openly, sometimes discreetly, but we were always aware of their presence. And we...we were complicit."},{"name":"HIEN","text":"He did what he had to do to preserve the peace. To keep our people safe. But at what cost..."},{"name":"HIEN","text":"F-Forgive me, this is neither the time nor the place for such dark musings! Though they did serve to remind me of the barracks which once stood to the west of here...where there may yet be weapons our comrades could use."},{"name":"HIEN","text":"If you head down that street, past those makeshift barricades, you will come to the ruins. I will search elsewhere. Meet me at the water's edge when you have finished."},{"name":"HIEN","text":"Alas, I found naught of value. Did you?"},{"name":"HIEN","text":"Still sheathed in its scabbard...though even shielded from the elements, it will need to be cleaned and oiled─"},{"name":"HIEN","text":"...I recognize the crest. It belonged to the son of a samurai I trained with when I was young."},{"name":"HIEN","text":"He never even had the chance to draw it..."},{"name":"HIEN","text":"There she is. Doma Castle. My home."},{"name":"HIEN","text":"They let us keep her for a time, before gradually moving their forces across from Fluminis. Now her every court and corridor belongs to Yotsuyu."},{"name":"HIEN","text":"Though Father spent much of his time there, I did not. I may only have visited him there on half a dozen occasions, if that. I cannot remember."},{"name":"HIEN","text":"But I remember the view from the keep. Doma seemed much smaller from there. Like you could hold it in your hands."},{"name":"HIEN","text":"Well, Monzen at least. Doma is so much more than that. There, beyond the Moon Gates, unto the shores of the Ruby Sea, and here, in the places that no man can see or touch or take from you..."},{"name":"HIEN","text":"We carry her with us, wheresoever we go."},{"name":"HIEN","text":"Not the land or the soil...but the story."},{"name":"HIEN","text":"And what is life if not a story? The story of our journey from dawn to dusk, day after day after day. The story of our mothers and our fathers, our families and our friends, our peoples and our nations."},{"name":"HIEN","text":"I think a part of me understood that, when I looked out from the keep.<br>Hien, son of Kaien. Another caretaker of the story of Doma."},{"name":"HIEN","text":"It's a fine castle, truly, with an even finer view. But in the end..."},{"name":"HIEN","text":"In...in the end..."},{"name":"HIEN","text":"Kami strike me down, how could I be so blind! We must return to the House of the Fierce at once!"},{"name":"HIEN","text":"I have had what can only be described as a revelation. Ours is an excellent plan, but not so excellent that it cannot be improved─and I know how."}],"reward":{"gil":908,"items":[{"id":18502,"one":1,"hq":1},{"id":18504,"one":1,"hq":1},{"id":18506,"one":1,"hq":1},{"id":18516,"one":1,"hq":1},{"num":3,"id":5723,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68483]},"next":[68059]},"partials":[{"type":"npc","id":"1020234","obj":{"i":1020234,"n":"Lyse","l":2410,"q":3}},{"type":"npc","id":"1020239","obj":{"i":1020239,"n":"Hien","l":2410,"q":2}},{"type":"npc","id":"1019285","obj":{"i":1019285,"n":"Haname","l":2410,"q":5}},{"type":"npc","id":"1019286","obj":{"i":1019286,"n":"Kaidate","l":2410,"q":3}},{"type":"npc","id":"1019287","obj":{"i":1019287,"n":"Motojiro","l":2410,"q":3}},{"type":"npc","id":"1020232","obj":{"i":1020232,"n":"Tsuranuki","l":2410,"q":3}},{"type":"npc","id":"1020233","obj":{"i":1020233,"n":"Isse","l":2410,"q":3}},{"type":"npc","id":"1020237","obj":{"i":1020237,"n":"Hien","l":2410,"q":1}},{"type":"npc","id":"1020238","obj":{"i":1020238,"n":"Hien","l":2410,"q":1}},{"type":"npc","id":"1020519","obj":{"i":1020519,"n":"Alphinaud","l":2410,"q":8}},{"type":"npc","id":"1020523","obj":{"i":1020523,"n":"Yugiri","l":2410,"q":8}},{"type":"npc","id":"1023083","obj":{"i":1023083,"n":"Hien","l":2410,"q":1}},{"type":"item","id":"18502","obj":{"i":18502,"n":"Doman Steel Patas","l":279,"c":31132,"t":1,"p":39348}},{"type":"item","id":"18504","obj":{"i":18504,"n":"Doman Steel Halberd","l":279,"c":31934,"t":5,"p":39348}},{"type":"item","id":"18506","obj":{"i":18506,"n":"Doman Steel Main Gauches","l":279,"c":33912,"t":84,"p":39348}},{"type":"item","id":"18516","obj":{"i":18516,"n":"Doman Steel Shield","l":279,"c":30156,"t":11,"p":13116}},{"type":"item","id":"5723","obj":{"i":5723,"n":"Quicktongue Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"68483","obj":{"i":68483,"n":"Broken Steel, Broken Men","g":6,"l":"Yanxia","s":810}},{"type":"quest","id":"68059","obj":{"i":68059,"n":"On the Eve of Destiny","g":6,"l":"Yanxia","s":830}}]}