{"quest":{"name":"On the Eve of Destiny","location":"Yanxia","id":68059,"patch":4.0,"sort":830,"eventIcon":71201,"issuer":1020239,"target":1020519,"involved":[1019285,1019286,1019287,1019288,1020240,1020520,1020521,1020523,1020524],"genre":6,"journal":["Hien understands what he must do for Doma."],"objectives":["Speak with Alphinaud at the House of the Fierce.","Speak with your comrades.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"The Dairyu Moon Gates have guarded the approach to Doma Castle since long before the imperial occupation."},{"name":"ALPHINAUD","text":"We do not anticipate any great difficulty in gaining entry to the gatehouse as our Doman friends know its every nook and cranny. The challenge will come in preserving the element of surprise. But I am confident the shinobi will rise to the occasion."},{"name":"ALISAIE","text":"Oh, there you are. I saw you leave with Lord Hien earlier. Where is he?"},{"name":"YUGIRI","text":"During the rebellion, the imperials turned to their agents among the shinobi, and through their treachery were many of my comrades slaughtered."},{"name":"YUGIRI","text":"We few who survived have not forgotten that day. The memory of it has spurred us never to neglect our training, that we might be ready to administer revenge."},{"name":"HIEN","text":"On second thought, <span class=\"highlight\">Forename</span>, I ask that you return to the House of the Fierce without me, and tell Alphinaud to call the others together for a meeting."},{"name":"HIEN","text":"It is imperative that the Kojin emissary be in attendance as well. I shall join you anon."},{"name":"HIEN","text":"Do not worry, my friend. I will not be far behind."},{"name":"ALPHINAUD","text":"Lord Hien wishes to discuss the details of our plan? Very well, if he insists. I shall summon the others at once."},{"name":"ALPHINAUD","text":"As for the Kojin, I believe one of their emissaries was already en route. Nevertheless, I shall contact them to make certain."},{"name":"ALPHINAUD","text":"It is...unorthodox, but I am in no position to speak against it."},{"name":"ALISAIE","text":"We are fast approaching that moment when all is in order and we have naught to do but wait...frustrating as it is. &lt;sigh&gt; Well, when the time comes, I wish you the best of luck. Oh, and remember: no noble sacrifices or anything similarly stupid."},{"name":"HIEN","text":"Thank you for accompanying me earlier. 'Twas in that moment of clarity that I understood what we needed to do."},{"name":"HANAME","text":"We are to flood the castle, then... So be it. I will inform the Xaela."},{"name":"KAIDATE","text":"Lord Hien may be young, but none among us question his leadership! We will defend him and his people to the last!"},{"name":"MOTOJIRO","text":"Mayhap it is for the best. According to our spies in the castle, they do strange and terrible things in the lowest levels. Experiments involving men and magitek. If we can destroy their work before our forces enter the castle..."},{"name":"YAGORO","text":"My lord and his comrades are an inspiration. To spur our countrymen to rise up once more within a year of our defeat is a feat no others could accomplish."},{"name":"LYSE","text":"If there's nothing else, I'll head back to Namai. Tsuranuki's working hard, and Isse's doing what he can to help, but maybe there's more that I can do too."},{"name":"LYSE","text":"He was like a different person when he began hammering those plates. Younger, brighter, full of life and hope..."},{"name":"YUGIRI","text":"No plan is perfect, and there is ever room for improvement. I expect my comrades will be refining their approach until the moment they begin."},{"name":"YUGIRI","text":"In case you are unaware, the other jonin will lead the assault on the Moon Gates, not I. My place is at Lord Hien's side."},{"name":"YUGIRI","text":"That my lord saw fit to let me accompany him came as a relief. There is nowhere I would rather be than by his side when the fighting begins."},{"name":"GOSETSU","text":"The plan is set, and all that can be done has been done. Rest and relaxation are now paramount, for tomorrow we may die."},{"name":"GOSETSU","text":"Have you too not done enough? Will you not pause a moment to gather yourself on the eve of our grand design? Go not unto battle with weary eyes or lingering regrets, my friend."},{"name":"GOSETSU","text":"Ere you go to war, savor peace, for you may never know it again."},{"name":"ALPHINAUD","text":"Soroban informs me that his sappers will be ready within the day, which means that we can proceed as planned and attack Doma Castle tomorrow."},{"name":"ALPHINAUD","text":"Considering the key role you will play, I think it only prudent that you refrain from further labors and rest until tomorrow. Agreed?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Far be it from me to refuse..."},{"name":"A1","text":"No rest for the righteous!"},{"name":"ALPHINAUD","text":"We shall speak again in the morning. Take care, my friend..."},{"name":"ALPHINAUD","text":"True enough, true enough. When you have seen to your sundry tasks and are ready to retire, I pray you let me know."}],"reward":{"gil":873,"items":[{"id":18505,"one":1,"hq":1},{"id":18508,"one":1,"hq":1},{"id":18510,"one":1,"hq":1},{"id":18511,"one":1,"hq":1},{"num":3,"id":5683,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68058]},"next":[68060]},"partials":[{"type":"npc","id":"1020239","obj":{"i":1020239,"n":"Hien","l":2410,"q":2}},{"type":"npc","id":"1020519","obj":{"i":1020519,"n":"Alphinaud","l":2410,"q":8}},{"type":"npc","id":"1019285","obj":{"i":1019285,"n":"Haname","l":2410,"q":5}},{"type":"npc","id":"1019286","obj":{"i":1019286,"n":"Kaidate","l":2410,"q":3}},{"type":"npc","id":"1019287","obj":{"i":1019287,"n":"Motojiro","l":2410,"q":3}},{"type":"npc","id":"1019288","obj":{"i":1019288,"n":"Yagoro","l":2410,"q":3}},{"type":"npc","id":"1020240","obj":{"i":1020240,"n":"Gosetsu","l":2410,"q":1}},{"type":"npc","id":"1020520","obj":{"i":1020520,"n":"Alisaie","l":2410,"q":6}},{"type":"npc","id":"1020521","obj":{"i":1020521,"n":"Lyse","l":2410,"q":5}},{"type":"npc","id":"1020523","obj":{"i":1020523,"n":"Yugiri","l":2410,"q":8}},{"type":"npc","id":"1020524","obj":{"i":1020524,"n":"Hien","l":2410,"q":6}},{"type":"item","id":"18505","obj":{"i":18505,"n":"Persimmon Bow","l":279,"c":32325,"t":4,"p":39348}},{"type":"item","id":"18508","obj":{"i":18508,"n":"Doman Steel-barreled Musketoon","l":279,"c":34687,"t":88,"p":39348}},{"type":"item","id":"18510","obj":{"i":18510,"n":"Durium Rod","l":279,"c":33075,"t":7,"p":39348}},{"type":"item","id":"18511","obj":{"i":18511,"n":"Marid Leather Grimoire","l":279,"c":33235,"t":10,"p":39348}},{"type":"item","id":"5683","obj":{"i":5683,"n":"Battledance Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Tenacity","category":0}}},{"type":"quest","id":"68058","obj":{"i":68058,"n":"The Doma Within","g":6,"l":"Yanxia","s":820}},{"type":"quest","id":"68060","obj":{"i":68060,"n":"The Die Is Cast","g":6,"l":"Yanxia","s":840}}]}