{"quest":{"name":"The Room Where It Happened","location":"Yanxia","id":68055,"patch":4.0,"sort":770,"icon":100654,"eventIcon":71201,"issuer":1020519,"target":1023084,"involved":[1020520,1020521,1020522,1020523,1020524,1020622],"genre":6,"journal":["Alphinaud has devised a cunning strategy to reclaim Doma Castle.","In anticipation of Lord Hien's return, Alphinaud has developed a comprehensive strategy to retake Doma Castle. After Lyse and the Doman irregulars carry out a series of diversionary attacks, the Xaela will launch a surprise attack on the castle's airborne defenses. The twins and the shinobi will then disable the magitek field generators within the Dairyu Moon Gates, allowing the Confederate and Kojin naval forces to bombard the castle and secure the Doman Enclave. Finally, Lord Hien's main host will advance upon the castle and deal with the imperial forces within. Though Lord Hien seems satisfied with the plan, his hesitation does not go unnoticed...","Many tasks must be completed in advance of the attack, and Lord Hien would be glad of any assistance you can provide. As he has but recently returned, however, he knows not what these specific tasks are─but Alphinaud Leveilleur surely does.","Alphinaud lacks confidence in his ability to disable the field generators, and so he has turned to Cid nan Garlond, the foremost authority in the field of magitek. By way of Tataru in Kugane he has requested documentation on the devices in question. Given the importance of this information, he would be most grateful if you were to go to Kugane and collect it in person.","You are shocked to find Tataru a woman transformed, having taken after Hancock and dressed herself in the latest Hingan fashions. Flowing silks notwithstanding, she appears to have retained her classical charms─and hopefully the documentation you seek..."],"objectives":["Speak with Hien.","Speak with Alphinaud.","Speak with Tataru in Kugane."],"dialogue":[{"name":"LYSE","text":"So...have we got a plan? Tell me someone's got a plan."},{"name":"ALISAIE","text":"Alphinaud has been hard at work devising our strategy to seize Doma Castle. I'm sure he will be happy to share the details with you all shortly."},{"name":"HIEN","text":"No time to soak it in. We have work to do."},{"name":"YUGIRI","text":"Not that I doubted you for a moment, but I am relieved to see him returned."},{"name":"GOSETSU","text":"All is in place. We need but commit to action and see it through to the end."},{"name":"ALPHINAUD","text":"I imagine you are eager to hear the particulars of our plan. Allow me a moment to gather everyone's attention..."},{"name":"LYSE","text":"Looks like I'll be heading to Namai. Wish me luck!"},{"name":"ALPHINAUD","text":"As for how best to infiltrate the Moon Gates..."},{"name":"ALISAIE","text":"I suppose I ought to go and take stock of our supplies. We'll be needing a lot of weapons..."},{"name":"YUGIRI","text":"I am told Cirina fought with you in the Naadam? I would not have taken her for a warrior. Appearances can indeed be deceiving."},{"name":"GOSETSU","text":"This may be our final chance to win Doma her freedom. We dare not take any chances, for if we fail..."},{"name":"HIEN","text":"There is no shortage of tasks which must needs be completed before we can launch our attack. If you have a moment, perhaps you could lend a hand?"},{"name":"HIEN","text":"That said, I have only just returned. 'Twould be better for you to speak with Alphinaud to find out how you might be of service."},{"name":"HIEN","text":"Much has changed in my absence. The state of the enclave, in particular, concerns me..."},{"name":"HIEN","text":"But it would seem Alphinaud understands the importance of ensuring their safety. You Scions are no ordinary mercenaries, that much is plain."},{"name":"ALPHINAUD","text":"Trying to keep busy? Full glad am I to hear it. There is one task which comes to mind."},{"name":"ALPHINAUD","text":"As I explained during my briefing, Alisaie and I will need to infiltrate the Moon Gates to disable the magitek field generators."},{"name":"ALPHINAUD","text":"Though I pride myself on my knowledge of various subjects, I must confess I lack confidence in my knowledge of this particular one. Which is why I turned to an expert."},{"name":"ALPHINAUD","text":"I have been conversing with Cid via Tataru, attempting to ascertain the design of the generators based on our limited intelligence. Most recently he sent a parcel with some documents which he believes may be of use."},{"name":"ALPHINAUD","text":"I would like for you to go to Kugane and bring them back here."},{"name":"ALPHINAUD","text":"In the meantime, I will continue to work with our shinobi allies to plot a path into the gates. Safe travels, <span class=\"highlight\">Forename</span>, and thank you again."},{"name":"HANCOCK","text":"Well, well, well! What a pleasant surprise this is!"},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>!? What are you doing here? I thought you were off fighting nomads on the Azim Steppe!"},{"name":"TATARU","text":"...Oh, you beat them! Good show! A shame I didn't get to see it."},{"name":"TATARU","text":"Alphinaud has been keeping me apprised of the situation in Doma. I may not be any good in a physical fight, but in an, err...paperwork...fight, I'm the true khagan! Yeah!"}],"reward":{"gil":1203,"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68054]},"next":[68482]},"partials":[{"type":"npc","id":"1020519","obj":{"i":1020519,"n":"Alphinaud","l":2410,"q":8}},{"type":"npc","id":"1023084","obj":{"i":1023084,"n":"Tataru","l":2927,"q":2}},{"type":"npc","id":"1020520","obj":{"i":1020520,"n":"Alisaie","l":2410,"q":6}},{"type":"npc","id":"1020521","obj":{"i":1020521,"n":"Lyse","l":2410,"q":5}},{"type":"npc","id":"1020522","obj":{"i":1020522,"n":"Gosetsu","l":2410,"q":2}},{"type":"npc","id":"1020523","obj":{"i":1020523,"n":"Yugiri","l":2410,"q":8}},{"type":"npc","id":"1020524","obj":{"i":1020524,"n":"Hien","l":2410,"q":6}},{"type":"npc","id":"1020622","obj":{"i":1020622,"n":"Hancock","l":2927,"q":6}},{"type":"quest","id":"68054","obj":{"i":68054,"n":"The Hour of Reckoning","g":6,"l":"The Azim Steppe","s":760}},{"type":"quest","id":"68482","obj":{"i":68482,"n":"How Tataru Got Her Groove Back","g":6,"l":"Kugane","s":780}}]}