{"quest":{"name":"The Limits of Our Endurance","location":"Yanxia","id":68057,"patch":4.0,"sort":800,"eventIcon":71201,"issuer":1020520,"target":1020232,"involved":[1020231,1020233,1020234,1020519,1020521,1020523,1023092],"genre":6,"journal":["If you still want for work, Alisaie has a suggestion."],"objectives":["Speak with Lyse.","Speak with Isse.","Speak with Tsuranuki."],"dialogue":[{"name":"LYSE","text":"Everything all right?"},{"name":"ALPHINAUD","text":"The Dairyu Moon Gates have guarded the approach to Doma Castle since long before the imperial occupation."},{"name":"ALPHINAUD","text":"We do not anticipate any great difficulty in gaining entry to the gatehouse as our Doman friends know its every nook and cranny. The challenge will come in preserving the element of surprise. But I am confident the shinobi will rise to the occasion."},{"name":"YUGIRI","text":"During the rebellion, the imperials turned to their agents among the shinobi, and through their treachery were many of my comrades slaughtered."},{"name":"YUGIRI","text":"We few who survived have not forgotten that day. The memory of it has spurred us never to neglect our training, that we might be ready to administer revenge."},{"name":"ALISAIE","text":"I'd tell you to rest and leave the rest to the others, but seeing as that isn't in your nature..."},{"name":"ALISAIE","text":"Lyse returned but a moment ago, looking a bit worried. It would seem that trouble is afoot in Namai."},{"name":"ALISAIE","text":"You may as well go and ask her about it. As for me, I will not impose upon you any further."},{"name":"LYSE","text":"We've barely got enough armor as it is, huh..."},{"name":"LYSE","text":"Oh, you're here to help? That's a relief. I've been trying to help the villagers in Namai get ready for the operation, but we've run into a few problems..."},{"name":"LYSE","text":"You remember how we're supposed to stir up trouble as a diversion, right? Well, the thing is, we don't have enough armor to go around."},{"name":"LYSE","text":"I thought the Doman Liberation Front would be able to furnish us with some, but it seems that's not the case. I was about to go and tell Isse─why don't you come too?"},{"name":"LYSE","text":"We'll have to come up with a solution somehow."},{"name":"ISSE","text":"Oh, you're here too. I heard about those soldiers you and Alisaie encountered. I'm glad you're all right... Ahem. Right, then..."},{"name":"CHIGUSA","text":"Isse─we have gathered up all the rope we could find in the village."},{"name":"MIYAMA","text":"And every tool with an edge, but it is still not enough. Even a hoe would suffice, but there are no more to spare."},{"name":"ISSE","text":"Thank you, Chigusa. Ryosen could use a hand, if there is nothing else."},{"name":"ISSE","text":"As for more tools...I may have some in my home. Go and search it─take whatever meets your needs."},{"name":"AZAMI","text":"I made enough rice balls for everyone─including some special ones for Lady Yugiri. Can I go and give them to her?"},{"name":"ISSE","text":"Y-You silly little girl, of course you can! Hurry! You never know when she'll have to leave on a secret mission!"},{"name":"ISSE","text":"Sorry about that. Everyone's been trying to contribute since Lord Hien returned. There's so much to worry about."},{"name":"LYSE","text":"You're doing well, Isse...though I have to ask: have you had any luck finding more armor?"},{"name":"ISSE","text":"Unfortunately, no. Unlike weapons, there are no substitutes for proper protection..."},{"name":"ISSE","text":"It's not as though we need full suits of imperial plate, but we're not soldiers. If we attack without any equipment, we'll be slaughtered."},{"name":"LYSE","text":"The Doman Liberation Front doesn't have any armor to spare. I suppose we could ask Hancock, but there's no telling how long it would take for him to send us supplies..."},{"name":"LYSE","text":"Do you have an armorer in the village, or anyone with some skill to fashion armor?"},{"name":"ISSE","text":"There is one man. A craftsman who fled the enclave. He is experienced, and may be able to help."},{"name":"ISSE","text":"I don't know if I can persuade him to, though. But maybe you two could come with me?"},{"name":"ISSE","text":"His name is Tsuranuki, and he lives in Kusakari, in the south. Come with me."},{"name":"LYSE","text":"There's something odd about this man..."},{"name":"ISSE","text":"This...is Tsuranuki."},{"name":"TSURANUKI","text":"Bwahahaha! Who are these starry-eyed youths who stand before me?"},{"name":"TSURANUKI","text":"Ones who sing of rebellion? Of liberation? Hah hah hah! Surely they would not think to trouble me with such foolish dreams!"},{"name":"TSURANUKI","text":"Oh, go and say what you will. But do not take offense if I die from laughter! Bwahahaha!"}],"reward":{"gil":696,"items":[{"id":18509,"one":1,"hq":1},{"id":18512,"one":1,"hq":1},{"id":18513,"one":1,"hq":1},{"id":18515,"one":1,"hq":1},{"num":3,"id":5683,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68056]},"next":[68483]},"partials":[{"type":"npc","id":"1020520","obj":{"i":1020520,"n":"Alisaie","l":2410,"q":6}},{"type":"npc","id":"1020232","obj":{"i":1020232,"n":"Tsuranuki","l":2410,"q":3}},{"type":"npc","id":"1020231","obj":{"i":1020231,"n":"Lyse","l":2410,"q":1}},{"type":"npc","id":"1020233","obj":{"i":1020233,"n":"Isse","l":2410,"q":3}},{"type":"npc","id":"1020234","obj":{"i":1020234,"n":"Lyse","l":2410,"q":3}},{"type":"npc","id":"1020519","obj":{"i":1020519,"n":"Alphinaud","l":2410,"q":8}},{"type":"npc","id":"1020521","obj":{"i":1020521,"n":"Lyse","l":2410,"q":5}},{"type":"npc","id":"1020523","obj":{"i":1020523,"n":"Yugiri","l":2410,"q":8}},{"type":"npc","id":"1023092","obj":{"i":1023092,"n":"Isse","l":2410,"q":1}},{"type":"item","id":"18509","obj":{"i":18509,"n":"Persimmon Cane","l":279,"c":32709,"t":9,"p":39348}},{"type":"item","id":"18512","obj":{"i":18512,"n":"Marid Leather Codex","l":279,"c":33236,"t":98,"p":39348}},{"type":"item","id":"18513","obj":{"i":18513,"n":"Dual-plated Durium Planisphere","l":279,"c":34888,"t":89,"p":39348}},{"type":"item","id":"18515","obj":{"i":18515,"n":"Durium Foil","l":279,"c":36736,"t":97,"p":39348}},{"type":"item","id":"5683","obj":{"i":5683,"n":"Battledance Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Tenacity","category":0}}},{"type":"quest","id":"68056","obj":{"i":68056,"n":"Seeds of Despair","g":6,"l":"Yanxia","s":790}},{"type":"quest","id":"68483","obj":{"i":68483,"n":"Broken Steel, Broken Men","g":6,"l":"Yanxia","s":810}}]}