{"quest":{"name":"Seeds of Despair","location":"Yanxia","id":68056,"patch":4.0,"sort":790,"eventIcon":71201,"issuer":1020519,"target":1020520,"involved":[1019934,1020226,1020227,1020228,1020230,1020273,1020521,1020523],"genre":6,"journal":["If you seek further employment, Alphinaud can point you in the right direction."],"objectives":["Speak with Alisaie.","Search for imperial patrols south of Prism Lake.","Search Prism Lake for imperial patrols.","Follow Alisaie.","Search the Ribbons for suspicious villagers.","Defeat the imperial impostors.","Rendezvous with Alisaie.","Speak with Alisaie."],"dialogue":[{"name":"ALISAIE","text":"So much to do, and so little time to do it..."},{"name":"YUGIRI","text":"During the rebellion, the imperials turned to their agents among the shinobi, and through their treachery were many of my comrades slaughtered."},{"name":"YUGIRI","text":"We few who survived have not forgotten that day. The memory of it has spurred us never to neglect our training, that we might be ready to administer revenge."},{"name":"ALPHINAUD","text":"Should you wish for further employment, mayhap you could speak with Alisaie?"},{"name":"ALPHINAUD","text":"I believe she was planning to search the surrounding area for imperial patrols. If you go now, you may be able to catch her before she departs."},{"name":"ALPHINAUD","text":"The Dairyu Moon Gates have guarded the approach to Doma Castle since long before the imperial occupation."},{"name":"ALPHINAUD","text":"We do not anticipate any great difficulty in gaining entry to the gatehouse as our Doman friends know its every nook and cranny. The challenge will come in preserving the element of surprise. But I am confident the shinobi will rise to the occasion."},{"name":"ALISAIE","text":"Alphinaud told you about my plans? And you wish to come with me? Well, far be it from me to refuse you."},{"name":"ALISAIE","text":"If truth be told, I'm not entirely sure what I expect to find. In the wake of your failed assassination attempt, the imperials demonstrated uncharacteristic restraint. There were no public executions, and not a single village was put to the torch."},{"name":"ALISAIE","text":"But, as I mentioned earlier, our latest intelligence does suggest a purge is imminent. For all we know, they could be out in the field even as we speak, surveilling their targets and making plans."},{"name":"ALISAIE","text":"If so, we need to put a stop to it. Let us begin our search in the north."},{"name":"ALISAIE","text":"This is the place. Do you see anything or anyone of note?"},{"name":"ALISAIE","text":"All quiet...for now. Follow me to the next location."},{"name":"ALISAIE","text":"This was the second point I marked on my map..."},{"name":"ALISAIE","text":"No imperial patrols near our headquarters, then. Good. The last thing we need is a repeat of Rhalgr's Reach."},{"name":"ALISAIE","text":"Even so, 'twould be prudent to search a little longer."},{"name":"ALISAIE","text":"Not exactly the enemy I was worried about. &lt;sigh&gt; ...Damn it all. I can't just leave the carcass lying in the middle of the road."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You've gotten stronger."},{"name":"A1","text":"Get on with it, then."},{"name":"ALISAIE","text":"...Next to you, I feel like a child playing at swords and sorcery. Though mayhap it suits me better than books."},{"name":"ALISAIE","text":"I owe much to a Miqo'te I met on my travels. He was a master of these techniques, and kindly agreed to teach me the fundamentals."},{"name":"ALISAIE","text":"But I never could warm to common rapiers. I vastly preferred using a blade of my own creation, despite the toll it took on me. Urianger's gift was a godssend, to be honest."},{"name":"ALISAIE","text":"...I didn't mean to imply that you should help me. This isn't the first wild beast we've had to slay to keep the people safe in your absence."},{"name":"ALISAIE","text":"But we'll need all the help we can get when the real fighting starts..."},{"name":"ALISAIE","text":"Anyway, we're falling behind. We should split up, and try to recoup some lost time."},{"name":"ALISAIE","text":"We've heard rumors of imperial soldiers skulking about disguised as villagers. One was supposedly spotted near the Ribbons, to the south of here. Go and see if there's anything out of the ordinary."},{"name":"ALISAIE","text":"I'll come and find you when I've dealt with this carcass. If you run afoul of imperials, call out and I'll be there that much sooner."},{"name":"HENSO02520","text":"Oh... Hello there, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>. My associates and I are in search of fertile soil for farming, and this land caught our eye."},{"name":"HENSO02520","text":"...You doubt my words? You suspect we have some other purpose in coming here? &lt;sigh&gt; How vexing it is to be questioned in this manner."},{"name":"HENSO02520","text":"Very well. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> desires the truth, and <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> shall have it. Deal with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"POP","text":"The two men draw their swords and charge!"},{"name":"HENSO02520","text":"Ugh..."},{"name":"ALISAIE","text":"I saw them attack you, while this one fled. Since you seemed to have everything in hand, I decided to capture him. An imperial, I presume?"},{"name":"HENSO02520","text":"I knew it would come to this... But at the hands of a <span class=\"emphasis\">Westerner</span>? A Doman would at least know the rites..."},{"name":"HENSO02520","text":"You think you understand, but you do not. She will burn it all before she surrenders. She will never kneel again. Nor should she..."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>!"},{"name":"HENSO02520","text":"...Rest assured, the Naeuri will receive due compensation. Young Asahi has great potential─that much is plain."},{"name":"HENSO02520","text":"If he applies himself, he may one day be granted the opportunity to go to Garlemald and learn from some of the leading authorities in the field of magitek. Few citizens are afforded such treatment, however─much less people of the provinces. You will need to do more─"},{"name":"YOTSUYUSMOM","text":"Oh, oh, of course! Have no doubt that we shall! My husband and I want only the best imperial education for our boy!"},{"name":"YOTSUYU","text":"(-Starveling Girl-)I've finished planting the rice, Mother..."},{"name":"YOTSUYUSMOM","text":"Not while the officer is here, Yotsuyu! Inside! <span class=\"emphasis\">Now</span>!"},{"name":"YOTSUYU","text":"Yes, Mother."},{"name":"HENSO02520","text":"You did not mention that you had a daughter."},{"name":"YOTSUYUSMOM","text":"My sister's, not mine─kami rest her soul. &lt;sigh&gt; She is <span class=\"emphasis\">utterly</span> hopeless, but one cannot choose one's family."},{"name":"HENSO02520","text":"Indeed... She is of age to receive an education as well, is she not? Yet we have no records. I trust I need not remind you of your legal obligations─"},{"name":"YOTSUYUSMOM","text":"No, no! Of course not! But she is weak and sickly. Some days, she has not the strength to leave her bed! Though...a thought occurs to me. Mayhap we can come to an understanding..."},{"name":"ALISAIE","text":"That was a near thing."},{"name":"ALISAIE","text":"What happened? We were talking, and then all of a sudden you were somewhere else. Did one of those soldiers hit you on the head or something?"},{"name":"ALISAIE","text":"Well, if you say so... We should go and tell the others what happened here."},{"name":"LYSE","text":"Everything all right?"},{"name":"ALISAIE","text":"Thank you. You didn't have to come with me, but you did, and for that I am grateful."},{"name":"ALISAIE","text":"I told the others of our encounter with the disguised soldiers. Though we disposed of the bodies, it is only a matter of time before their comrades note their absence."},{"name":"ALISAIE","text":"As if we needed any more reason to act quickly...<br>Are you sure you're all right, by the way? You've been awfully quiet since we returned..."}],"reward":{"gil":1191,"items":[{"num":3,"id":20001},{"id":27369,"one":1,"hq":1},{"id":27370,"one":1,"hq":1},{"num":3,"id":5668,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68482]},"next":[68057]},"partials":[{"type":"npc","id":"1020519","obj":{"i":1020519,"n":"Alphinaud","l":2410,"q":8}},{"type":"npc","id":"1020520","obj":{"i":1020520,"n":"Alisaie","l":2410,"q":6}},{"type":"npc","id":"1019934","obj":{"i":1019934,"n":"Haunted Elder","l":2410,"q":1}},{"type":"npc","id":"1020226","obj":{"i":1020226,"n":"Alisaie","l":2410,"q":1}},{"type":"npc","id":"1020227","obj":{"i":1020227,"n":"Alisaie","l":2410,"q":1}},{"type":"npc","id":"1020228","obj":{"i":1020228,"n":"Alisaie","l":2410,"q":1}},{"type":"npc","id":"1020230","obj":{"i":1020230,"n":"Haunted Elder","l":2410,"q":1}},{"type":"npc","id":"1020273","obj":{"i":1020273,"n":"Alisaie","l":2410,"q":1}},{"type":"npc","id":"1020521","obj":{"i":1020521,"n":"Lyse","l":2410,"q":5}},{"type":"npc","id":"1020523","obj":{"i":1020523,"n":"Yugiri","l":2410,"q":8}},{"type":"item","id":"20001","obj":{"i":20001,"n":"Tiger Skin","l":273,"c":21834,"t":52}},{"type":"item","id":"27369","obj":{"i":27369,"n":"Doman Steel Gunblade","l":279,"c":36011,"t":106,"p":39348}},{"type":"item","id":"27370","obj":{"i":27370,"n":"Doman Steel War Quoits","l":279,"c":36211,"t":107,"p":39348}},{"type":"item","id":"5668","obj":{"i":5668,"n":"Heavens' Eye Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"68482","obj":{"i":68482,"n":"How Tataru Got Her Groove Back","g":6,"l":"Kugane","s":780}},{"type":"quest","id":"68057","obj":{"i":68057,"n":"The Limits of Our Endurance","g":6,"l":"Yanxia","s":800}}]}