{"quest":{"name":"Naadam","location":"The Azim Steppe","id":68051,"patch":4.0,"sort":730,"icon":100657,"eventIcon":71201,"issuer":1020539,"target":1020540,"involved":[1019382,1019386,1019388,1019396,1019417,1020280,1020541,1020542,1021631,1021632,1021633,1021634,1021635,1021636,1021637,1021638,1021924],"genre":6,"journal":["The Naadam is nigh, and Cirina would have you make your final preparations.","The ceremonial battle for rulership over the Steppe, or Naadam, will commence with the rising of the sun, when the Gharl scatter the sacred soil, giving rise to a great ovoo. All will then converge upon this light, and the tribe which claims it will carry the day. Though you and your comrades are ready, Temulun Khatun tells you that some of the Mol warriors are not. Young and inexperienced in the ways of war, they would benefit from some encouragement from a veteran such as you.","Not all were made for war, and many of the Mol would sooner lay down their arms and tend to their herds. Nevertheless, their eyes burn with renewed purpose after you walk among them dispensing words of wisdom. Temulun Khatun will surely be pleased.","On the eve of the Naadam, the great and wise leader of the Mol addresses you and your comrades one final time, reminding you of the simple truth that violence lies at the heart of every Xaela─of every warrior of the Steppe. Delight not in such things, but do not deny them. Face yourself and your enemies without fear, and may the gods guide you to victory.","You and your comrades race across the Steppe to meet the other tribes in battle, and soon the soil of one and all is awash with Xaela blood. Yet somehow, from that crimson tempest emerges a victor. As the ovoo evaporates into motes of fading light, you stand a khagan crowned.","There is no time to celebrate the Mol's triumph in the Naadam, for Grynewaht suddenly appears at the head of an imperial squadron, and declares his intention to kill you once and for all. Yet in coming a moment too late, he faces a Steppe united. With the aid of the Oronir and the Dotharl, you slay the invaders and send Grynewaht on his way once more. But this is only the beginning of your alliance, for Hien succeeds in convincing the two tribes to travel south with him and fight for Doma's liberation.","Two battles won in a single day is reason to rejoice under any circumstances, but these carry special significance. By your deeds are Lord Hien and the Doman Liberation Front one step closer to freeing their home from the yoke of imperial oppression."],"objectives":["Speak with the Mol warriors.","Speak with Temulun.","Speak with Cirina.","Speak with Hien."],"dialogue":[{"name":"LYSE","text":"It's almost time for the Naadam! I'm so excited!"},{"name":"HIEN","text":"Though our journey home was rather more roundabout than I had anticipated, it was also more educational. I think it safe to say we are better prepared for the experience."},{"name":"GOSETSU","text":"There is a tension in the air─an awareness of the coming storm. A nervousness, aye, but a confidence as well. Faith, perchance..."},{"name":"MOLA02514","text":"How my heart throbs with excitement! I can wait no longer for the Naadam!"},{"name":"MOLC02514","text":"A-All shall be well. I must have faith in myself and my yol..."},{"name":"MOLD02514","text":"Though we must ware the Oronir, it is the Dotharl who frighten me most of all. I have seen them in battle before. They are not men─they are monsters."},{"name":"MOLE02514","text":"It has been many years since the gods bade the Mol fight in the Naadam. For us, it is the first time. The khatun says we will win, but...will we?"},{"name":"CIRINA","text":"My friends. We are come to the final day of the Tsagaan Sar. To the Naadam."},{"name":"CIRINA","text":"The battle will commence with the rising of the sun. The Gharl will scatter the soil, and the Steppe will be unbound."},{"name":"CIRINA","text":"A great ovoo will erupt from the earth and call for a new khagan. All will converge upon the light, and the warrior who claims it will win the day."},{"name":"CIRINA","text":"Precious little time remains. Pray use it to prepare for the battle."},{"name":"TEMULUN","text":"Many of the young ones have never taken part in a Naadam. They are nervous. Perhaps you might favor them with some few words? It would do much to ease their fears..."},{"name":"CIRINA","text":"If you had come any later, we would have had to fight by ourselves..."},{"name":"TEMULUN","text":"All know you for a warrior. They will heed your counsel, and take heart from your encouragement."},{"name":"MOLA02514","text":"How strange this feeling... The thrill before battle... A battle in which I may die."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"People die all the time. Many of them in their sleep."},{"name":"A1","text":"We will fight, we will win, and we will return to Mol Iloh together."},{"name":"MOLA02514","text":"...W-Wise words, I am sure. I suppose I should rightly thank you for your honesty...but I have so little time left..."},{"name":"MOLA02514","text":"Yes...yes of course we will! I must have faith! I must have courage!"},{"name":"MOLA02514","text":"I have not always understood the motives of the gods, but I have accepted their guidance ever since I was a child. If they would have us fight, I must believe they have their reasons."},{"name":"MOLA02514","text":"So I shall fight with all my might! And if it is the gods' will, then we shall win!"},{"name":"MOLA02514","text":"Thank you again for your help. I will not let you down, my friend. I may be Mol, but I am nevertheless a warrior!"},{"name":"DORBEI","text":"Ah, it is you. The one who helped the children with their chores. For that I must thank you."},{"name":"DORBEI","text":"Though mayhap I will repay the favor in battle. Yes, I too will fight in the Naadam, though you may not see me. While you and yours contest the ovoo, my comrades and I will devote our efforts to preventing other tribes from interfering."},{"name":"DORBEI","text":"We are few, and we are weak, but we shall do what we can to aid you. Go well, traveler, and if it be the gods' will, let us speak again when the day is done."},{"name":"DORBEI","text":"The children are of course too young to fight, but not too young to observe. Their time will come. "},{"name":"BUJEG","text":"At the behest of the khatun you speak with us, yes? You are kind to do so, and I am grateful."},{"name":"BUJEG","text":"Do not underestimate the power of words. A warrior conquers one with his hands, but a thousand with his head. Even you cannot fight forever."},{"name":"BUJEG","text":"War is not our way. We have no grand rites for those we send forth into battle. Only solemn prayers."},{"name":"COTAN","text":"When we were young, my friends and I could scarcely wait to challenge Bardam's Mettle. We longed to become warriors..."},{"name":"COTAN","text":"The day came and went, but we rarely fought men. Mostly beasts. And now we must stand against the Oronir and the Dotharl. You have seen them─taken the measure of them. Do you believe we can win?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can and will. Have faith!"},{"name":"A1","text":"It will not be easy..."},{"name":"COTAN","text":"Yes...yes! 'Twas the gods' will that we fight. Surely it is their will that we win! Of course!"},{"name":"COTAN","text":"No, it will not...but it is well that you acknowledge it. A warrior must be brave, but not foolhardy. I will not forget."},{"name":"COTAN","text":"We must trust in the gods. Whether I live or die, it shall be in service to their grand design."},{"name":"TEMULUN","text":"Already, I sense a change in the people. Their hearts soothed, their resolve strengthened. This we owe to you."},{"name":"TEMULUN","text":"We are of the soil. The wind and the water. We are not conquerors."},{"name":"TEMULUN","text":"But we are yet the children of Nhaama─we are yet Xaela. We were made for battle─to kill and be killed. We delight not in such things, but let no man doubt that they are in our nature."},{"name":"TEMULUN","text":"Flesh, blood, bone─that which was given, we offer unto the gods as tribute. This day we embrace death. Ours and our enemies'."},{"name":"TEMULUN","text":"So too must you embrace this truth, for this is who we are. Who you are become, as warriors of the Steppe."},{"name":"TEMULUN","text":"May the gods guide you to victory."},{"name":"CIRINA","text":"All that remains is to wait for daybreak!"},{"name":"LYSE","text":"We're <span class=\"emphasis\">not</span> dying here. Not when we've got a score to settle with Zenos."},{"name":"HIEN","text":"Though I know how much this battle means for the future of Doma, a part of me is glad simply for the opportunity to repay my debt to the Mol."},{"name":"GOSETSU","text":"Mayhap their souls will shine bright in battle, but my steel will sing!"},{"name":"TEMULUN","text":"We are but one link in the divine chain. The Naadam will end, and a khagan will reign, until the next."},{"name":"CIRINA","text":"You are ready for battle, <span class=\"highlight\">Forename</span>?"},{"name":"MAGNAI","text":"You came, as I knew you would. For you too are a warrior of the Steppe."},{"name":"MAGNAI","text":"I salute you, traveler, and should be honored to face you alone...but the Dotharl thirst for blood and will suffer no duels."},{"name":"MAGNAI","text":"Bear witness, Father Azim! The soil shall drink deep of blood this day!"},{"name":"LYSE","text":"Go on! They're waiting for you!"},{"name":"GOSETSU","text":"The others have returned as well, it would seem."},{"name":"CIRINA","text":"We won...we actually won! I mean, you did. If it were not for you..."},{"name":"TEMULUN","text":"The gods saw fit to return you to us. But what of your comrades? Where are they?"},{"name":"DORBEI","text":"I...I have acquired a wound for my trouble. But it will heal with time and care. The children are gathering herbs for a poultice."},{"name":"DORBEI","text":"Had the Naadam not ended when it did, I would likely have perished. Thank you."},{"name":"BUJEG","text":"From traveler to warrior, and now to khagan. What will you become next, I wonder?"},{"name":"COTAN","text":"'Twould seem this was not the day for either one of us to die! Nevertheless, I should be glad if the gods never bid me take up arms again. I am a trader at heart."},{"name":"MOLA02514","text":"I saw you fight, <span class=\"highlight\">Forename</span>! You were incredible!"},{"name":"MOLB02514","text":"My arms, my legs...every part of me is tired and sore. I feel as though I could sleep for a fortnight..."},{"name":"MOLC02514","text":"Wherever did you learn to perform such feats? Is everyone in the West as strong as you? Can you teach me!?"},{"name":"MOLD02514","text":"Be still and let me set the bone! You are only making it worse for yourself!"},{"name":"MOLE02514","text":"&lt;pant&gt; &lt;pant&gt; I know, I know! A-A moment! Just...a moment, if you please!"},{"name":"MAGNAI","text":"..."},{"name":"SADU","text":"..."},{"name":"HIEN","text":"Your imperial friend has truly impeccable timing. Had he come even a few moments earlier, he might actually have stood a chance."},{"name":"HIEN","text":"In any event, that is <span class=\"emphasis\">two</span> battles won in a single day. Which, by my reckoning, gives us twice the cause to celebrate!"},{"name":"HIEN","text":"But first, I pray you grant me a moment to express my gratitude. Thanks to you, we are one step closer to freeing my homeland from the tyranny of the Empire. I am in your debt."},{"name":"HIEN","text":"Of course...if all goes to plan, this is like to be but the first of many such debts. Yet I promise to endure my insolvency with a smile, out of gratitude to the kami for seeing fit to send you hither."}],"reward":{"gil":2228,"items":[{"id":18535,"one":1,"hq":1},{"id":18547,"one":1,"hq":1},{"id":18553,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":216000},"reqs":{"jobs":[{"lvl":66,"id":142}],"quests":[68050]},"next":[68052]},"partials":[{"type":"npc","id":"1020539","obj":{"i":1020539,"n":"Cirina","l":2411,"q":7}},{"type":"npc","id":"1020540","obj":{"i":1020540,"n":"Hien","l":2411,"q":3}},{"type":"npc","id":"1019382","obj":{"i":1019382,"n":"Temulun","l":2411,"q":5}},{"type":"npc","id":"1019386","obj":{"i":1019386,"n":"Bujeg","l":2411,"q":2}},{"type":"npc","id":"1019388","obj":{"i":1019388,"n":"Cotan","l":2411,"q":2}},{"type":"npc","id":"1019396","obj":{"i":1019396,"n":"Dorbei","l":2411,"q":3}},{"type":"npc","id":"1019417","obj":{"i":1019417,"n":"Magnai","l":2411,"q":7}},{"type":"npc","id":"1020280","obj":{"i":1020280,"n":"Sadu","l":2411,"q":3}},{"type":"npc","id":"1020541","obj":{"i":1020541,"n":"Lyse","l":2411,"q":3}},{"type":"npc","id":"1020542","obj":{"i":1020542,"n":"Gosetsu","l":2411,"q":3}},{"type":"npc","id":"1021631","obj":{"i":1021631,"n":"Gosetsu","l":2411,"q":4}},{"type":"npc","id":"1021632","obj":{"i":1021632,"n":"Lyse","l":2411,"q":4}},{"type":"npc","id":"1021633","obj":{"i":1021633,"n":"Hien","l":2411,"q":4}},{"type":"npc","id":"1021634","obj":{"i":1021634,"n":"Diligent Mol Warrior","l":2411,"q":3}},{"type":"npc","id":"1021635","obj":{"i":1021635,"n":"Cocksure Mol Warrior","l":2411,"q":2}},{"type":"npc","id":"1021636","obj":{"i":1021636,"n":"Zealous Mol Warrior","l":2411,"q":3}},{"type":"npc","id":"1021637","obj":{"i":1021637,"n":"Weary Mol Warrior","l":2411,"q":3}},{"type":"npc","id":"1021638","obj":{"i":1021638,"n":"Mild-mannered Mol Warrior","l":2411,"q":3}},{"type":"npc","id":"1021924","obj":{"i":1021924,"n":"Dorbei","l":2411,"q":3}},{"type":"item","id":"18535","obj":{"i":18535,"n":"Serge Hat of Aiming","l":279,"c":41374,"t":34,"p":21641}},{"type":"item","id":"18547","obj":{"i":18547,"n":"Serge Hat of Healing","l":279,"c":41373,"t":34,"p":21641}},{"type":"item","id":"18553","obj":{"i":18553,"n":"Serge Hat of Casting","l":279,"c":41372,"t":34,"p":21641}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68050","obj":{"i":68050,"n":"As the Gods Will","g":6,"l":"The Azim Steppe","s":720}},{"type":"quest","id":"68052","obj":{"i":68052,"n":"Glory to the Khagan","g":6,"l":"The Azim Steppe","s":740}}]}