{"quest":{"name":"The World Turned Upside Down","location":"Yanxia","id":68061,"patch":4.0,"sort":850,"icon":100718,"eventIcon":71201,"issuer":1020248,"target":1020265,"involved":[1019976,1019979,1020236,1020249,1020250,1020251,1020252,1020253,1020255,1020256,1020257,1020258,1020259,1020260,1020261,1020262,1020263,1020264,1020266,1020267,1020268,1020269,1020644,1021060,1021062,1021063,1021072],"genre":6,"journal":["Alphinaud is at a loss for words.","The castle has fallen, and the imperial occupation of Doma is at an end. But what of Gosetsu? Is there truly no hope? Alphinaud is unwilling to assume the worst, and so Soroban agrees to search the crumbling ruin. Alas, when he returns, he tells you that naught remained of the keep for him to search. Though he found no body, it seems all but impossible that the samurai survived...","Difficult though it is, you and your comrades must look to the future. Gosetsu would accept no less. The Domans who fought valiantly for their freedom are gathered in the enclave, and wait to receive their lord.","Hien was raised to rule, and so the language of leadership comes naturally to him. But when faced with the prospect of addressing his countrymen in the wake of their victory, he hesitates, until you spur him to rise to the occasion with your characteristic wit. As you and the other Scions look on, he implores his countrymen not to grow complacent, for the true challenge lies in the days ahead, when they must come together to rebuild their broken nation. Judging from the faces of the gathered men and women, you have little reason to doubt that they will.","Truly, there is no rest for the righteous, as the Scions can ill afford to remain in Doma and enjoy their victory. Gyr Abania still suffers under the rule of Zenos yae Galvus, and it is imperative that you return to the West with all possible haste.","Rasho and Tansui understand the urgency of your cause, and agree to take you to Kugane, where you might secure passage to Limsa Lominsa aboard a larger ship. A generous gesture, no doubt, but one that will give the captain an excellent excuse to slip away from the festivities...","On the docks of Kugane, you prepare to part ways with your Confederate allies. For an instant, Rasho lets slip his mask and thanks you earnestly for your deeds in service to Doma. And then, just like that, the mask is back in place, for some stories are destined to remain untold."],"objectives":["Speak with Tansui.","Speak with Alphinaud.","Speak with Rasho."],"dialogue":[{"name":"LYSE","text":"What happened in there? Where is Gosetsu?"},{"name":"ALISAIE","text":"...Tell me it was not for nothing."},{"name":"HIEN","text":"..."},{"name":"YUGIRI","text":"...He was right. The day is won. The people must know."},{"name":"SOROBAN","text":"Victory is ours, is it not? Then why are you all so quiet?"},{"name":"CIRINA","text":"&lt;sniffle&gt;"},{"name":"ALPHINAUD","text":"...Thank you.<br>The occupation is ended, then. And the people must be informed of our victory."},{"name":"ALPHINAUD","text":"But I will not simply give up Gosetsu for lost. Before aught else, we must needs search the ruins."},{"name":"SOROBAN","text":"Allow me, my friends. The castle is still collapsing into the river, and could easily drag you to your deaths. I can navigate the waters easily, without fear of drowning."},{"name":"ALISAIE","text":"Be reasonable, Brother. You know he is right."},{"name":"YUGIRI","text":"<span class=\"highlight\">Forename</span>. A word, if I may."},{"name":"YUGIRI","text":"My lord withdraws into himself, unable to turn his thoughts from the keep. He needs us now, more than ever..."},{"name":"SOROBAN","text":"My friends, I am returned. I swam as far into the ruins as I could..."},{"name":"LYSE","text":"And...? Did you find him?"},{"name":"SOROBAN","text":"...Nay, lady. Naught remained of the keep for me to search."},{"name":"SOROBAN","text":"Undermined from below and shaken from above, the manner of its collapse was most unusual. If the floor beneath him gave way before the rest...it is not impossible that he could have been sent tumbling into the river."},{"name":"SOROBAN","text":"But the water is thick with silt and debris. Despite my best efforts, I could not find him. I am sorry."},{"name":"HIEN","text":"...There is naught for which you should apologize. Thank you, Soroban, for taking it upon yourself to search."},{"name":"HIEN","text":"The castle is in ruins, and the people are eager to learn the fate of their nation. We leave at once."},{"name":"ALPHINAUD","text":"Are you sure, my lord?"},{"name":"HIEN","text":"The day is won, and the morrow beckons..."},{"name":"HIEN","text":"It falls to us to greet it."},{"name":"LYSE","text":"...I'm going down to the docks to see if I can't get one of the Confederate ships to take us to the enclave."},{"name":"ALISAIE","text":"Mayhap we should tell the others at the House of the Fierce to gather there?"},{"name":"CIRINA","text":"Magnai and Sadu know naught of what happened in the castle. I will go and tell them."},{"name":"HIEN","text":"They fought valiantly and with honor, Cirina. I pray you tell them that as well."},{"name":"HIEN","text":"You too, my friend, were instrumental in this triumph. I must insist that you be present when we bring these tidings to my people."},{"name":"LYSE","text":"It seems Tansui was on his way as soon as he saw you flee the keep."},{"name":"ALPHINAUD","text":"Our Confederate allies have already set about ferrying the others to the Doman Enclave. By the time we arrive, all should be present and waiting."},{"name":"ALISAIE","text":"I wish I knew what to say, but I've never had my brother's way with words.<br>It's...what he would have wanted? ...I-I'm sorry. This is not helping."},{"name":"HIEN","text":"You've never actually been to the enclave, have you? It was a lively place...before Zenos sent his troops."},{"name":"YUGIRI","text":"You have witnessed the destruction wrought by the Empire, but nowhere is it more apparent than the enclave. Would that you could have seen it as it was..."},{"name":"SOROBAN","text":"My brothers of the Blue have called for me, but we shall speak again soon."},{"name":"CIRINA","text":"I cannot accompany you to the enclave. Magnai and Sadu will expect me to deliver the news of our victory to them in person."},{"name":"TANSUI","text":"...You all look like shite."},{"name":"TANSUI","text":"The captain thought you might need a ride to the enclave. Ready to come aboard?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let's go."},{"name":"A1","text":"Give us a moment."},{"name":"TANSUI","text":"On you go, then. Sit wherever you like."},{"name":"TANSUI","text":"I don't know what happened in there, but it's over. You won. That's cause enough for celebration─and those people you're about to see need something to celebrate..."},{"name":"TANSUI","text":"As you wish. They've waited twenty-five years. A few more minutes won't make a difference."},{"name":"TANSUI","text":"Hm? What's wrong? You do want me to take you to the enclave, don't you?"},{"name":"HIEN","text":"Twenty-five years... If only you were here to see it."},{"name":"YUGIRI","text":"It was not for naught. It was not for naught..."},{"name":"ISSE","text":"&lt;sniffle&gt; Mother, Father... I understand now. I do..."},{"name":"AZAMI","text":"Why are you crying, Brother? Isn't today a good day?"},{"name":"TSURANUKI","text":"'Twas a year ago my lord Kaien died, and with him, the dream of Doma. Never again would we be free, I thought..."},{"name":"TSURANUKI","text":"...Miserable old fool that I am. But Doma lives! Doma rises! Doma will stand tall again! Till the end of my days will I labor to make it so!"},{"name":"RESISTANCE02492","text":"I want to shout and scream until my throat is hoarse. I want my fallen brothers and sisters to know that it was not in vain!"},{"name":"LYSE","text":"I'm glad we could be a part of it. That we could see with our own eyes that things can change if people have the courage to stand up and fight."},{"name":"ALISAIE","text":"We journeyed here from the opposite side of the world, but until now, it didn't seem half as far. I think that means our work here is done."},{"name":"SOROBAN","text":"Oh, you will not be staying in the enclave?"},{"name":"CIRINA","text":"Oh. Hien is not with you? N-No matter. The sun and moon were not fated to share the same sky."},{"name":"DOMABOATMAN","text":"Honored hero! You seek passage across the One River?"},{"name":"SYSTEM","text":"Travel to the Glittering Basin?"},{"name":"ALPHINAUD","text":"Are you quite certain you would not prefer to stay awhile longer? There are sure to be festivities─at which you would be the guest of honor, like as not."},{"name":"ALPHINAUD","text":"Very well. There are other ways in which we might celebrate─by rejoining the fight for freedom in Gyr Abania, for one."},{"name":"ALPHINAUD","text":"Short though our time here has been, we have all come to regard this land and her people as our own, I think. But we have done that which we came here to do."},{"name":"ALPHINAUD","text":"Word of Doma's liberation will soon spread throughout the Empire, and we must seize this opportunity to rekindle the fires of liberation in the West."},{"name":"ALISAIE","text":"We dare not allow the imperials a moment's respite, lest they march on Doma again. For the sake of all concerned, we should leave immediately."},{"name":"CIRINA","text":"Did I hear you right? You are leaving?"},{"name":"LYSE","text":"I'm afraid so. We've got our own battle to fight. What about you? Will you be heading back to the Steppe?"},{"name":"CIRINA","text":"Yes. The war here is ended, and there is no cause to remain. The Oronir and Dotharl have already withdrawn."},{"name":"CIRINA","text":"I will follow them anon, but I wished to bid you farewell first."},{"name":"SOROBAN","text":"The Blue, too, must return to their homes, but we will be back. Doma has need of merchants and builders, and we are eager to offer our services!"},{"name":"TANSUI","text":"And just like that, our grand fellowship is broken? Without ceremony or pomp, you steal off into the dark?"},{"name":"TANSUI","text":"No matter. We have plenty to be getting on with. Places to be, people to rob, and so on. And the captain never was one for mingling."},{"name":"RASHO","text":"I am a pirate. Give me a song at the tavern, and I will be happy. Hobnobbing with Lord Hien? Nay."},{"name":"TANSUI","text":"&lt;sigh&gt; No taste for the finer things..."},{"name":"TANSUI","text":"In any event, we need not part ways here. If you are for Kugane, we would be happy to take you. Her waters have always been...fruitful."},{"name":"CIRINA","text":"I wish you well on your journey, my friends. May you ever walk in crimson."},{"name":"LYSE","text":"Thank you, Cirina. For everything."},{"name":"SOROBAN","text":"May the kami speed you on your way! Until we meet again!"},{"name":"ALPHINAUD","text":"We have said our good-byes. Though it be with heavy hearts, let us board the boat and begin our long journey home."},{"name":"TANSUI","text":"Didn't even think to tell Lord Hien you were leaving? Well...I'm sure you had your reasons."},{"name":"RASHO","text":"Naught remains undone? You are ready to depart?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"We're ready."},{"name":"A2","text":"Not yet."},{"name":"RASHO","text":"To Kugane, then..."},{"name":"RASHO","text":"Oh? I thought matters in your homeland pressing. Mayhap I was mistaken."},{"name":"LYSE","text":"It's just as colorful as I remember..."},{"name":"ALPHINAUD","text":"In a way, this too feels like a homecoming. How long has it been since Carvallain brought us here...?"},{"name":"ALISAIE","text":"I can still hear his voice... My ears haven't stopped ringing since he first barged his way into the Rising Stones, a veritable force of nature."},{"name":"TANSUI","text":"It's a rare thing for us to sail into Kugane like common traders. I don't rightly recall the last time, but it will have been years."},{"name":"RASHO","text":"Have everything? Good. We will need to weigh anchor before the Sekiseigumi arrive."},{"name":"RASHO","text":"...From the bottom of my heart, I thank you for what you did. Give my regards to the Ul'dahn."}],"reward":{"gil":1424,"items":[{"id":18520,"one":1,"hq":1},{"id":18526,"one":1,"hq":1},{"id":18532,"one":1,"hq":1},{"id":18544,"one":1,"hq":1},{"num":3,"id":5633,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68060]},"next":[68062,68348,68349,68350,68351]},"partials":[{"type":"npc","id":"1020248","obj":{"i":1020248,"n":"Alphinaud","l":2410,"q":2}},{"type":"npc","id":"1020265","obj":{"i":1020265,"n":"Rasho","l":2404,"q":2}},{"type":"npc","id":"1019976","obj":{"i":1019976,"n":"Soroban","l":2410,"q":2}},{"type":"npc","id":"1019979","obj":{"i":1019979,"n":"Yugiri","l":2813,"q":1}},{"type":"npc","id":"1020236","obj":{"i":1020236,"n":"Liberation Front Infantry","l":2813,"q":1}},{"type":"npc","id":"1020249","obj":{"i":1020249,"n":"Alisaie","l":2410,"q":2}},{"type":"npc","id":"1020250","obj":{"i":1020250,"n":"Lyse","l":2410,"q":2}},{"type":"npc","id":"1020251","obj":{"i":1020251,"n":"Hien","l":2410,"q":2}},{"type":"npc","id":"1020252","obj":{"i":1020252,"n":"Yugiri","l":2410,"q":2}},{"type":"npc","id":"1020253","obj":{"i":1020253,"n":"Cirina","l":2410,"q":2}},{"type":"npc","id":"1020255","obj":{"i":1020255,"n":"Tansui","l":2410,"q":1}},{"type":"npc","id":"1020256","obj":{"i":1020256,"n":"Hien","l":2410,"q":1}},{"type":"npc","id":"1020257","obj":{"i":1020257,"n":"Lyse","l":2410,"q":1}},{"type":"npc","id":"1020258","obj":{"i":1020258,"n":"Alphinaud","l":2410,"q":1}},{"type":"npc","id":"1020259","obj":{"i":1020259,"n":"Alisaie","l":2410,"q":1}},{"type":"npc","id":"1020260","obj":{"i":1020260,"n":"Lyse","l":2410,"q":1}},{"type":"npc","id":"1020261","obj":{"i":1020261,"n":"Cirina","l":2410,"q":1}},{"type":"npc","id":"1020262","obj":{"i":1020262,"n":"Soroban","l":2410,"q":1}},{"type":"npc","id":"1020263","obj":{"i":1020263,"n":"Rasho","l":2410,"q":1}},{"type":"npc","id":"1020264","obj":{"i":1020264,"n":"Tansui","l":2410,"q":1}},{"type":"npc","id":"1020266","obj":{"i":1020266,"n":"Tansui","l":2404,"q":2}},{"type":"npc","id":"1020267","obj":{"i":1020267,"n":"Alphinaud","l":2404,"q":2}},{"type":"npc","id":"1020268","obj":{"i":1020268,"n":"Alisaie","l":2404,"q":2}},{"type":"npc","id":"1020269","obj":{"i":1020269,"n":"Lyse","l":2404,"q":2}},{"type":"npc","id":"1020644","obj":{"i":1020644,"n":"Enclave Skiff Captain","l":2813,"q":1}},{"type":"npc","id":"1021060","obj":{"i":1021060,"n":"Hien","l":2813,"q":1}},{"type":"npc","id":"1021062","obj":{"i":1021062,"n":"Isse","l":2813,"q":1}},{"type":"npc","id":"1021063","obj":{"i":1021063,"n":"Tsuranuki","l":2813,"q":1}},{"type":"npc","id":"1021072","obj":{"i":1021072,"n":"Azami","l":2813,"q":1}},{"type":"item","id":"18520","obj":{"i":18520,"n":"Marid Leather Breeches of Fending","l":279,"c":47315,"t":36,"p":36069}},{"type":"item","id":"18526","obj":{"i":18526,"n":"Marid Leather Breeches of Maiming","l":279,"c":47316,"t":36,"p":36069}},{"type":"item","id":"18532","obj":{"i":18532,"n":"Marid Leather Breeches of Striking","l":279,"c":47317,"t":36,"p":36069}},{"type":"item","id":"18544","obj":{"i":18544,"n":"Marid Leather Breeches of Scouting","l":279,"c":47318,"t":36,"p":36069}},{"type":"item","id":"5633","obj":{"i":5633,"n":"Piety Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"68060","obj":{"i":68060,"n":"The Die Is Cast","g":6,"l":"Yanxia","s":840}},{"type":"quest","id":"68062","obj":{"i":68062,"n":"A Swift and Secret Departure","g":6,"l":"Kugane","s":860}},{"type":"quest","id":"68348","obj":{"i":68348,"n":"The Perfect Woman","g":107,"l":"Kugane","s":7010}},{"type":"quest","id":"68349","obj":{"i":68349,"n":"Child Labor","g":107,"l":"Kugane","s":7020}},{"type":"quest","id":"68350","obj":{"i":68350,"n":"In the Line of Duty","g":107,"l":"Kugane","s":7030}},{"type":"quest","id":"68351","obj":{"i":68351,"n":"The Weight of a Dream","g":107,"l":"Kugane","s":7040}}]}