{"quest":{"name":"The Die Is Cast","location":"Yanxia","id":68060,"patch":4.0,"sort":840,"icon":100659,"eventIcon":71201,"issuer":1020524,"target":1020248,"involved":[1019975,1019976,1020241,1020242,1020243,1020244,1020245,1020246,1020247,1020249,1020250,1020251,1020252,1020253,1021694,1021695,1021696],"genre":6,"journal":["All hangs in the balance, as Hien well knows.","To win a war, one must be willing to do whatever is required, even if it means sacrificing the very thing one set out to reclaim. And thus did Lord Hien declare that Doma Castle should be flooded, to eliminate the greater portion of the imperial garrison and trap Yotsuyu within the keep. All preparations are complete. All participants are in position. All that remains is to wait.","Every stage of the plan is carried out to perfection, from the diversionary attacks to the Kojin's underwater demolition. From Monzen, you and your comrades observe as the river rushes into Doma Castle, drowning you know not how many soldiers within...","Your allies have set the stage, and now you must play your part. A Blue skiff captain awaits you down by the shore.","To increase your chances of reaching Yotsuyu, Hien proposes that you split into two groups. He, Gosetsu, and Yugiri will comprise one, while you and the wandering adventurers whom you had the wisdom and foresight to recruit to fight for Doma's liberation will comprise the other. The fate of a nation shall be decided this day─marshal your forces and venture unto the flooded fortress!<br><br>※Doma Castle can be accessed via the Duty Finder.","In the bowels of Doma Castle, you are greeted by an old friend: Grynewaht, driven mad by his quest for vengeance, and transformed into a twisted mass of steel and flesh. But whatever agonies he endured to gain his newfound strength, they are all for naught. After a pitched battle, he crumples to the ground, never to rise again.","At the top of the keep, you find Hien, Yugiri, and Gosetsu, who have Yotsuyu at their mercy. Invited to plead her case, she speaks of the many ways in which she was wronged by her countrymen...and of the joy she one day found in their suffering. Listening to her tale, you recall your vision of her childhood, and almost begin to pity the woman...only to find that she has been stalling for time. Unrepentant to the last, she gleefully reveals her plan to bring the keep down on your heads in a final suicidal act of defiance. With a thunderous roar, the ceiling comes crashing in, but when the dust finally settles, you find yourself and your comrades unharmed, for Gosetsu, blessed with indomitable strength as he is, has somehow managed to catch the massive debris that threatened to crush you. Alas, Yotsuyu too has survived, as you learn to your dismay when she fires upon the samurai, not stopping until her pistol is spent. As Gosetsu struggles to remain standing, he implores you and the others to leave while you still can...","When Alphinaud sees you return to Monzen without Gosetsu, he knows at once what has happened. Sometimes there is no need for words."],"objectives":["Wait in Monzen for the operation to begin.","Speak with Hien.","Speak with the Blue skiff captain.","Enter Doma Castle.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"Good...&lt;yawn&gt;...morning. I trust you slept well─or at least better than I did. 'Twould seem I dozed off in the middle of something, but your carousing with Lord Hien and Gosetsu woke me from my fitful slumber, and I retired to my bunk."},{"name":"ALPHINAUD","text":"Alisaie is faring rather less well than either of us, but she will be fine, I am sure─so long as you do not remind her of what you saw."},{"name":"HIEN","text":"There <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is. I trust you are none the worse for wear after last night."},{"name":"HIEN","text":"We received confirmation from the Kojin not long ago. Their sappers stand at the ready and await our signal."},{"name":"HIEN","text":"Let us not keep them and the others waiting. Gather your things─we depart at once."},{"name":"HIEN","text":"Alphinaud─instruct Lyse and the others to move into position and launch their attack."},{"name":"HIEN","text":"Our scouts report no change in the imperials' disposition, but I would leave nothing to chance. We must act quickly, lest we lose the element of surprise."},{"name":"ALPHINAUD","text":"Understood. I will relay your orders to her and rejoin my unit."},{"name":"ALPHINAUD","text":"Gosetsu and Yugiri await the two of you at Monzen. Good luck, my friends. I will see you both again soon."},{"name":"HIEN","text":"And now we wait..."},{"name":"YUGIRI","text":"Lyse will contact us once the attack has begun, after which the others will carry out their allotted tasks. Our part comes last."},{"name":"GOSETSU","text":"I have dreamed of this day... A chance for freedom. For liberation. For redemption. After twenty-five years of regret."},{"name":"YUGIRI","text":"The Confederacy report that they have secured the enclave. We need not fear for the civilians' safety!"},{"name":"GOSETSU","text":"It is done. The water surges through the broken masonry and floods the castle even as we speak. Though my heart breaks at the sight of it, I must be strong. All is for the sake of Doma!"},{"name":"HIEN","text":"Aye, there can be no doubt. The viceroy is trapped. And so comes our part."},{"name":"HIEN","text":"Our Kojin allies will deliver us to our destination. To the western dock! And do not forget to bring your fellow adventurers, <span class=\"highlight\">Forename</span>!"},{"name":"HIEN","text":"I can only imagine the chaos inside the castle. To be trapped by the rising waters and know the enemy is at their gates."},{"name":"HIEN","text":"They will fight us with every onze of their strength. As will we them, for the eyes of history are upon us."},{"name":"YUGIRI","text":"When I led the Doman refugees to Eorzea, I did so only with the intention of seeking sanctuary. The thought of enlisting you and yours to aid us in another rebellion did not once cross my mind."},{"name":"YUGIRI","text":"Yet here we stand, shoulder to shoulder, ready to strike at the heart of the occupation. It has been and ever will be an honor, <span class=\"highlight\">Forename</span>."},{"name":"GOSETSU","text":"To see the castle thus defaced─and by our own hands... It is enough to make me smile─to laugh at the sheer absurdity of it."},{"name":"GOSETSU","text":"This is not the end, but it is an ending. Soon...soon I will be free."},{"name":"AOKORA02524","text":"Greetings and well met, my friends. Climb aboard, climb aboard! There is room enough for you all!"},{"name":"HIEN","text":"<span class=\"highlight\">Forename</span>. That we might improve our odds of success, we will divide into two parties upon arrival─one comprising you and your adventurer comrades, the other, Gosetsu, Yugiri, and myself."},{"name":"HIEN","text":"Each will enter the keep via a separate route, dispatching any imperial forces that attempt to bar their path."},{"name":"HIEN","text":"Even should one meet with misfortune, the other <span class=\"emphasis\">will</span> reach Yotsuyu. Agreed?"},{"name":"HIEN","text":"Then let us be about it. For Doma!"},{"name":"AOKORA02524","text":"What are you waiting for? Come, come! Before the river swallows all!"},{"name":"LYSE","text":"What happened in there? Where is Gosetsu?"},{"name":"ALISAIE","text":"...Tell me it was not for nothing."},{"name":"HIEN","text":"..."},{"name":"YUGIRI","text":"...He was right. The day is won. The people must know."},{"name":"SOROBAN","text":"Victory is ours, is it not? Then why are you all so quiet?"},{"name":"CIRINA","text":"&lt;sniffle&gt;"},{"name":"ALPHINAUD","text":"...<br>I see."}],"reward":{"gil":4583,"xp":224100,"instance":54},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68059]},"next":[68061]},"partials":[{"type":"npc","id":"1020524","obj":{"i":1020524,"n":"Hien","l":2410,"q":6}},{"type":"npc","id":"1020248","obj":{"i":1020248,"n":"Alphinaud","l":2410,"q":2}},{"type":"npc","id":"1019975","obj":{"i":1019975,"n":"Alphinaud","l":2410,"q":1}},{"type":"npc","id":"1019976","obj":{"i":1019976,"n":"Soroban","l":2410,"q":2}},{"type":"npc","id":"1020241","obj":{"i":1020241,"n":"Hien","l":2410,"q":1}},{"type":"npc","id":"1020242","obj":{"i":1020242,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1020243","obj":{"i":1020243,"n":"Gosetsu","l":2410,"q":1}},{"type":"npc","id":"1020244","obj":{"i":1020244,"n":"Hien","l":2410,"q":1}},{"type":"npc","id":"1020245","obj":{"i":1020245,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1020246","obj":{"i":1020246,"n":"Gosetsu","l":2410,"q":1}},{"type":"npc","id":"1020247","obj":{"i":1020247,"n":"Blue Skiff Captain","l":2410,"q":1}},{"type":"npc","id":"1020249","obj":{"i":1020249,"n":"Alisaie","l":2410,"q":2}},{"type":"npc","id":"1020250","obj":{"i":1020250,"n":"Lyse","l":2410,"q":2}},{"type":"npc","id":"1020251","obj":{"i":1020251,"n":"Hien","l":2410,"q":2}},{"type":"npc","id":"1020252","obj":{"i":1020252,"n":"Yugiri","l":2410,"q":2}},{"type":"npc","id":"1020253","obj":{"i":1020253,"n":"Cirina","l":2410,"q":2}},{"type":"npc","id":"1021694","obj":{"i":1021694,"n":"Hien","l":2410,"q":1}},{"type":"npc","id":"1021695","obj":{"i":1021695,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1021696","obj":{"i":1021696,"n":"Gosetsu","l":2410,"q":1}},{"type":"instance","id":"54","obj":{"i":54,"n":"Doma Castle","c":61801,"t":"Dungeons","min_lvl":67,"max_lvl":68,"min_ilvl":255}},{"type":"quest","id":"68059","obj":{"i":68059,"n":"On the Eve of Destiny","g":6,"l":"Yanxia","s":830}},{"type":"quest","id":"68061","obj":{"i":68061,"n":"The World Turned Upside Down","g":6,"l":"Yanxia","s":850}}]}