{"quest":{"name":"The Silence of the Gods","location":"The Fringes","id":68069,"patch":4.0,"sort":930,"eventIcon":71201,"issuer":1020589,"target":1020596,"involved":[1020578,1020579,1020586,1020587,1020588,1020590,1020591,1020592,1020597,1020806,1020817,1020827,1021565,1022332,1022333],"genre":6,"journal":["Thanks to you, Vajra and her people need no longer live in fear."],"objectives":["Speak with Sarisha.","Speak with M'naago.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"We had to use force to secure the crystals. Alisaie...was not gentle."},{"name":"ALISAIE","text":"You've finished, then. Good. I'm glad it's over."},{"name":"LYSE","text":"I hate leaving it all to you. It makes me wish there were some way of borrowing the Echo."},{"name":"VAJRA","text":"You have done us a great ssservice this day. Long shall my sssisters sssing the praises of the eikon-ssslayer."},{"name":"VAJRA","text":"Let usss bear word to them of Sri Lakshmi's passsing. Come, friends─to Vira Nilya!"},{"name":"ALPHINAUD","text":"Had the Qalyana's beliefs been closer to those of the Vira, this crisis could surely have been avoided..."},{"name":"ALISAIE","text":"If only I had your power. The things I would do..."},{"name":"LYSE","text":"I just hope we won't have to deal with any more primals before we march on Ala Mhigo."},{"name":"VAJRA","text":"'Twas your victory. 'Tis only meet that you be the one to tell my sssister."},{"name":"SARISHA","text":"Ahh... The winds whissspered of your successs...and your eyes confirm their tessstimony. The Lady of Blisss no longer holds our Qalyana sssisters in Her thrall. For thisss we thank you."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span> did the deed. We were but witnesses to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> heroism."},{"name":"ALISAIE","text":"However, I fear this is only the beginning, for there is no cure for that which drives the desperate to beseech the gods for salvation. Should they wish to use their crystals to summon Sri Lakshmi again, naught can be done to stop them."},{"name":"SARISHA","text":"We ignore our sssisters' plight at our peril. Thisss we know. We shall endeavor to show them another path ssso that the day you ssspeak of never comes."},{"name":"LYSE","text":"We're all in this together─Ala Mhigans and Ananta. We understand that. Hopefully, in time, they will too."},{"name":"SARISHA","text":"You and yours will ever be friends of the Vira. On that you have my word."},{"name":"LYSE","text":"We should be getting back to the Peering Stones. Thank you again, Sarisha. For everything."},{"name":"SARISHA","text":"All Vira will know of your deeds. Long shall they be celebrated."},{"name":"VAJRA","text":"It was an honor to ssserve you, eikon-ssslayer."},{"name":"PIPIN","text":"We heard about the primal. Excellent work. If you are looking for Arenvald and his unit, they are currently investigating reports of suspicious activity in the area."},{"name":"CONRAD","text":"The hero returns, together with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> stalwart comrades-in-arms. Glad to hear you managed to deal with the Ananta's primal before it could cause us any more grief. Gods know we have enough to worry about."},{"name":"MNAAGO","text":"Welcome back! Conrad and Marshal Tarupin came to render aid─but I hear that won't be necessary..."},{"name":"LYSE","text":"It won't. Sri Lakshmi's gone. Ah, but I should probably start at the beginning..."},{"name":"MNAAGO","text":"Incredible. I don't know what to say... If you hadn't been there to stop her, who knows where it would've ended."},{"name":"CONRAD","text":"You've saved a lot of lives, <span class=\"highlight\">Forename</span>. Take pride in that."},{"name":"PIPIN","text":"It must be said that this is something of an unprecedented situation. Previous summonings were, to my knowledge, planned well in advance by a tribe as a whole."},{"name":"ALPHINAUD","text":"Indeed. There are several aspects of this incident which bear further investigation. In any event, the Qalyana's supply of crystals must remain limited for the foreseeable future, and ambient aether levels closely observed."},{"name":"PIPIN","text":"Understood. The Alliance will consult with the Resistance and the Vira on how best to enforce said restrictions."},{"name":"ALPHINAUD","text":"Thank you, Vice Marshal.<br>To other matters, then. What news of the imperials?"},{"name":"PIPIN","text":"None─which itself is troubling. It seems as though the Skulls and the remainder of the garrison have fully withdrawn into the Peaks. We've seen neither hide nor hair of them since Velodyna."},{"name":"PIPIN","text":"Regardless of their reasons, our path is clear. Father has decided that it is time to advance east."},{"name":"LYSE","text":"<span class=\"emphasis\">Finally</span>!"},{"name":"PIPIN","text":"...He was also most emphatic that you be spared further duties for the present. You are to <span class=\"emphasis\">rest</span>. It would not do for the Warrior of Light to collapse from exhaustion during the march."},{"name":"PIPIN","text":"We may not be as strong or as quick as <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, but we are soldiers nonetheless. We can deal with the imperials."},{"name":"CONRAD","text":"Aye. You've earned this respite, so enjoy it. And the same goes for you, M'naago. You've been away from your family too long─don't deny it."},{"name":"MNAAGO","text":"...As you say, sir. Thank you. We'll make the most of our time here."},{"name":"ALPHINAUD","text":"Much will hinge on whether we can capture or destroy Specula Imperatoris. Though the facility was unassailable from the north, it is very much vulnerable to attack from the south."},{"name":"ALISAIE","text":"I know how you feel. I've never taken kindly to people telling me to rest."},{"name":"LYSE","text":"Naago used to tell me stories about her home, but somehow it didn't really register that we'd be up this high..."},{"name":"MNAAGO","text":"Heh heh, looks like it's up to me and mine to give you lot a proper welcome."},{"name":"MNAAGO","text":"My mother prepared a special meal for this occasion, and I have it on good authority that hers is the finest cooking this side of the Velodyna!"},{"name":"MRAHZNUN","text":"Honored guests, I pray you partake of our humble offerings as we give thanks for your many valiant deeds."},{"name":"ALPHINAUD","text":"Thank you, sir, for this warm welcome. We are honored to break bread with you and your family."},{"name":"MHAHTOA","text":"Come, come, eat your fill of our food, and drink deep of our spirits. There is more than enough for all."},{"name":"LYSE","text":"Well, when you put it that way─don't mind if I do!"},{"name":"LYSE","text":"She wasn't kidding when she said her mother could cook."},{"name":"LYSE","text":"You know, seeing her with her family...I can't help thinking of my own."},{"name":"LYSE","text":"How my father would come home from a hunt with dinner on his shoulder, and Yda would prepare it with herbs and spices... Our mother died when I was little, so she did most of the cooking..."},{"name":"LYSE","text":"We didn't have much, but we had each other. And that was enough for me."},{"name":"LYSE","text":"But they wouldn't let us have even that. Theodoric, Gaius... Of course Father and Yda had to fight. I would have too, if I'd been older. But they didn't have to die..."},{"name":"LYSE","text":"It never ends, does it? They call us beasts...and they treat us like them. They push and they push and they...until someone pushes back. Until someone takes up arms or...or summons a god. A false god."},{"name":"LYSE","text":"If the Twelve are watching us, what are they thinking?"},{"name":"LYSE","text":"What are they thinking when they see the strong hurt the weak? When people fight and die, and nothing gets better, and it just goes on and on and on..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"There is no justice. Just us."},{"name":"A1","text":"You'd have to ask Them."},{"name":"A1","text":"..."},{"name":"LYSE","text":"...I know. That's why we're here, isn't it?"},{"name":"LYSE","text":"...I don't think the gods listen to people like me."},{"name":"LYSE","text":"Thanks for listening. I know I was just rambling...but I feel better somehow."},{"name":"LYSE","text":"Who knows what the answers are─or if there even are any. Either way, life goes on, and we've got to...go with it. Sorry, that sounded better in my head. I must be getting tired. Time to turn in, I think."},{"name":"LYSE","text":"Tomorrow's another day, eh? Let's see what it brings. Sleep well, <span class=\"highlight\">Forename</span>."},{"name":"MNAAGO","text":"Because I've got other skills! In case you've forgotten, I'm one of the finest hunters this tribe has ever seen! And anyway, I don't remember <span class=\"emphasis\">you</span> being a master culinarian!"},{"name":"ALISAIE","text":"...How long has it been since I last saw my father? Maybe Alphinaud and I should plan a trip to Sharlayan. When all of this is over, I mean."},{"name":"LYSE","text":"So if your mother's food is so good, why are you such a terrible cook? Honestly, you've got to get her to teach you the basics while we're here."},{"name":"MRAHZNUN","text":"Leaving so soon? Then may you walk with the Warden ever at your side."},{"name":"MHAHTOA","text":"Keep an eye on my daughter, would you? And yourself while you're at it."},{"name":"ALPHINAUD","text":"There is something to be said for a home-cooked meal, is there not?"},{"name":"ALPHINAUD","text":"We must cherish these moments, fleeting as they are. The fight will always be there, waiting for us to return..."}],"reward":{"gil":802,"aetherCurrent":1,"items":[{"id":19817},{"id":18562,"one":1,"hq":1},{"id":18563,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68068]},"next":[68070,68358,68359,68360,68361,68362,68363,68364]},"partials":[{"type":"npc","id":"1020589","obj":{"i":1020589,"n":"Vajra","l":2406,"q":2}},{"type":"npc","id":"1020596","obj":{"i":1020596,"n":"Alphinaud","l":2406,"q":2}},{"type":"npc","id":"1020578","obj":{"i":1020578,"n":"M'naago","l":2406,"q":3}},{"type":"npc","id":"1020579","obj":{"i":1020579,"n":"Lyse","l":2406,"q":3}},{"type":"npc","id":"1020586","obj":{"i":1020586,"n":"Alphinaud","l":2406,"q":3}},{"type":"npc","id":"1020587","obj":{"i":1020587,"n":"Alisaie","l":2406,"q":3}},{"type":"npc","id":"1020588","obj":{"i":1020588,"n":"Lyse","l":2406,"q":3}},{"type":"npc","id":"1020590","obj":{"i":1020590,"n":"Alphinaud","l":2406,"q":2}},{"type":"npc","id":"1020591","obj":{"i":1020591,"n":"Alisaie","l":2406,"q":2}},{"type":"npc","id":"1020592","obj":{"i":1020592,"n":"Lyse","l":2406,"q":2}},{"type":"npc","id":"1020597","obj":{"i":1020597,"n":"Alisaie","l":2406,"q":2}},{"type":"npc","id":"1020806","obj":{"i":1020806,"n":"M'hahtoa","l":2406,"q":2}},{"type":"npc","id":"1020817","obj":{"i":1020817,"n":"Sarisha","l":2406,"q":3}},{"type":"npc","id":"1020827","obj":{"i":1020827,"n":"Vajra","l":2406,"q":3}},{"type":"npc","id":"1021565","obj":{"i":1021565,"n":"M'rahz Nunh","l":2406,"q":7}},{"type":"npc","id":"1022332","obj":{"i":1022332,"n":"Pipin","l":2406,"q":1}},{"type":"npc","id":"1022333","obj":{"i":1022333,"n":"Conrad","l":2406,"q":1}},{"type":"item","id":"19817","obj":{"i":19817,"n":"Shorlog","l":276,"c":24351,"t":46,"p":2180}},{"type":"item","id":"18562","obj":{"i":18562,"n":"Azurite Earrings of Healing","l":279,"c":55402,"t":41,"p":16395}},{"type":"item","id":"18563","obj":{"i":18563,"n":"Azurite Earrings of Casting","l":279,"c":55402,"t":41,"p":16395}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68068","obj":{"i":68068,"n":"The Lady of Bliss","g":6,"l":"The Fringes","s":920}},{"type":"quest","id":"68070","obj":{"i":68070,"n":"The First of Many","g":6,"l":"The Fringes","s":940}},{"type":"quest","id":"68358","obj":{"i":68358,"n":"The Perfect Gift","g":104,"l":"The Fringes","s":7070}},{"type":"quest","id":"68359","obj":{"i":68359,"n":"Spooked","g":104,"l":"The Fringes","s":7080}},{"type":"quest","id":"68360","obj":{"i":68360,"n":"A New Contender","g":104,"l":"The Fringes","s":7090,"f":1}},{"type":"quest","id":"68361","obj":{"i":68361,"n":"Down but Not Out","g":104,"l":"The Fringes","s":7100,"f":1}},{"type":"quest","id":"68362","obj":{"i":68362,"n":"Make a Man Out of You","g":104,"l":"The Fringes","s":7110,"f":1}},{"type":"quest","id":"68363","obj":{"i":68363,"n":"Honoring Family","g":104,"l":"The Fringes","s":7120,"f":1}},{"type":"quest","id":"68364","obj":{"i":68364,"n":"The Rose Blooms Twice","g":104,"l":"The Fringes","s":7130,"f":1}}]}