{"quest":{"name":"A Swift and Secret Departure","location":"Kugane","id":68062,"patch":4.0,"sort":860,"eventIcon":71201,"issuer":1020267,"target":1020441,"involved":[1020265,1020266,1020268,1020269,1020270,1020274,1020439,1020440,1020465,1020622],"genre":6,"journal":["Alphinaud would like to return to the Ruby Bazaar posthaste."],"objectives":["Return to the Ruby Bazaar.","Speak with Tataru.","Speak with Lyse."],"dialogue":[{"name":"LYSE","text":"It's just as colorful as I remember..."},{"name":"ALISAIE","text":"I can still hear his voice... My ears haven't stopped ringing since he first barged his way into the Rising Stones, a veritable force of nature."},{"name":"RASHO","text":"Do not worry. We will be safely away before the Sekiseigumi arrive."},{"name":"TANSUI","text":"It's a rare thing for us to sail into Kugane like common traders. I don't rightly recall the last time, but it will have been years."},{"name":"ALPHINAUD","text":"I informed Tataru of our coming. She and Hancock should be waiting for us in the Ruby Bazaar."},{"name":"ALISAIE","text":"Then it is here we part ways. Best of luck to you and yours in your...piratical endeavors, I suppose."},{"name":"TANSUI","text":"Do come and visit us again. 'Twould be a shame if we never got to see you and the little miss again."},{"name":"TATARU","text":"Welcome back, everyone, and congratulations on a job well done!"},{"name":"ALPHINAUD","text":"It is a pleasure as ever to see your smiling face, Tataru. Less so yours, Hancock, though Rasho and I are sincerely grateful for your assistance."},{"name":"HANCOCK","text":"The pleasure was all mine, Master Alphinaud. I assure you."},{"name":"TATARU","text":"Anyway, you will be glad to hear that I have already chartered passage for you back to Limsa Lominsa."},{"name":"TATARU","text":"The ship is to leave port this very day, but the captain has agreed to wait until the four of you have boarded."},{"name":"ALPHINAUD","text":"The four of us? You mean to stay here in Kugane?"},{"name":"TATARU","text":"Yes. I gave it some thought, and I realized that even with Doma free, there's still a need for a woman in the middle. Maybe even more than before, considering all the friends and alliances you made."},{"name":"HANCOCK","text":"As I told her many times before, I would be more than willing to assist you─"},{"name":"TATARU","text":"And as I told you many times before, I am not about to let you worm your way into our affairs and exploit our connections for your personal gain!"},{"name":"HANCOCK","text":"&lt;sigh&gt; Must you always presume the worst?"},{"name":"TATARU","text":"So there you have it. I will remain here for now. You needn't worry─I'm a regular at the hostelry and a half-dozen other local institutions. Everyone loves me!"},{"name":"TATARU","text":"So go, go! Don't let me keep you. Buy your supplies and souvenirs while you still can!"},{"name":"TATARU","text":"When you've finished, make haste to the docks. Pier number two, to be precise. I'll be waiting for you there!"},{"name":"ALPHINAUD","text":"I cannot deny that the thought of leaving her here alone worries me, but she has proven time and time again that she is far more clever than she appears. Besides, I do not think I could persuade her to change her mind."},{"name":"ALPHINAUD","text":"Mayhap I should take her advice and purchase a souvenir or two before leaving..."},{"name":"HANCOCK","text":"Personally I would have preferred to host you for a few days, but Tataru was adamant that you return on the first available ship. One could almost suspect she is eager to be rid of you..."},{"name":"HANCOCK","text":"Idle musings, naught more. Purely hypothetical and most assuredly incorrect. She wants only the best for her dear friends, and is surely not motivated by hidden desires to go gallivanting about with her Hingan paramours..."},{"name":"TATARU","text":"First to arrive, as always. Hopefully the others will not be far behind..."},{"name":"ALPHINAUD","text":"Compared to Kugane's vivid colors, Limsa Lominsa seems a bit...lacking. Still beautiful in its own way, but not as much as before..."},{"name":"ALISAIE","text":"It feels like a lifetime ago that we left for Kugane, doesn't it?"},{"name":"YUGIRI","text":"We should inform the Admiral of our arrival, and brief her on that which took place in Doma before leaving the city."},{"name":"HANCOCK","text":"Setting your sights on Ala Mhigo next, I presume? Excellent. The chairman is most interested in seeing how that whole affair plays out."},{"name":"HANCOCK","text":"Hm? Is the company willing to openly aid the Gyr Abanian campaign? Oh, heavens no. Far too close to home. 'Twould be an unconscionable risk."},{"name":"LYSE","text":"Back in Eorzea at last. Ready to pick up where we left off and finish the fight."},{"name":"LYSE","text":"We're not who we were when we left. We're stronger and wiser."},{"name":"LYSE","text":"So let's do it! Let's get back to Ala Mhigo and defeat Zenos once and for all!"}],"reward":{"gil":996,"items":[{"id":18538,"one":1,"hq":1},{"id":18550,"one":1,"hq":1},{"id":18556,"one":1,"hq":1},{"num":3,"id":5668,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68061]},"next":[68063]},"partials":[{"type":"npc","id":"1020267","obj":{"i":1020267,"n":"Alphinaud","l":2404,"q":2}},{"type":"npc","id":"1020441","obj":{"i":1020441,"n":"Lyse","l":29,"q":3}},{"type":"npc","id":"1020265","obj":{"i":1020265,"n":"Rasho","l":2404,"q":2}},{"type":"npc","id":"1020266","obj":{"i":1020266,"n":"Tansui","l":2404,"q":2}},{"type":"npc","id":"1020268","obj":{"i":1020268,"n":"Alisaie","l":2404,"q":2}},{"type":"npc","id":"1020269","obj":{"i":1020269,"n":"Lyse","l":2404,"q":2}},{"type":"npc","id":"1020270","obj":{"i":1020270,"n":"Tataru","l":2404,"q":1}},{"type":"npc","id":"1020274","obj":{"i":1020274,"n":"Yugiri","l":29,"q":2}},{"type":"npc","id":"1020439","obj":{"i":1020439,"n":"Alphinaud","l":29,"q":3}},{"type":"npc","id":"1020440","obj":{"i":1020440,"n":"Alisaie","l":29,"q":2}},{"type":"npc","id":"1020465","obj":{"i":1020465,"n":"Alphinaud","l":2927,"q":6}},{"type":"npc","id":"1020622","obj":{"i":1020622,"n":"Hancock","l":2927,"q":6}},{"type":"item","id":"18538","obj":{"i":18538,"n":"Serge Hose of Aiming","l":279,"c":47321,"t":36,"p":36069}},{"type":"item","id":"18550","obj":{"i":18550,"n":"Serge Hose of Healing","l":279,"c":47320,"t":36,"p":36069}},{"type":"item","id":"18556","obj":{"i":18556,"n":"Serge Hose of Casting","l":279,"c":47319,"t":36,"p":36069}},{"type":"item","id":"5668","obj":{"i":5668,"n":"Heavens' Eye Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"68061","obj":{"i":68061,"n":"The World Turned Upside Down","g":6,"l":"Yanxia","s":850}},{"type":"quest","id":"68063","obj":{"i":68063,"n":"While You Were Away","g":6,"l":"Limsa Lominsa","s":870}}]}