{"quest":{"name":"The Lure of the Dream","location":"The Fringes","id":68067,"patch":4.0,"sort":910,"eventIcon":71201,"issuer":1020580,"target":1020827,"involved":[1020581,1020582,1020583,1020584,1020586,1020587,1020588,1020817],"genre":6,"journal":["Alphinaud has heard this story too many times before..."],"objectives":["Speak with Sarisha.","Speak with Vajra."],"dialogue":[{"name":"ALISAIE","text":"And now we have a <span class=\"emphasis\">primal</span> to contend with as well. &lt;sigh&gt; As if the Empire needed an excuse to start rounding up beastmen again..."},{"name":"MNAAGO","text":"I still can't believe that a primal's been summoned so close to the village. The idea that our people could be taken to serve as thralls is... It just doesn't bear thinking about."},{"name":"LYSE","text":"This is all Fordola's fault!"},{"name":"VIRASOLDIER","text":"You have ssslain many eikons before, yesss? Then please─put an end to thisss madnesss..."},{"name":"ALPHINAUD","text":"Ahem. At the risk of sounding hopelessly naive...there may yet be a way to avoid a violent confrontation."},{"name":"ALPHINAUD","text":"In the past, I fear I have been rather too willing to accept that we have no other recourse than to risk our lives─or rather <span class=\"emphasis\">your</span> life─to address these threats."},{"name":"ALPHINAUD","text":"Yet the primals we have faced thus far have demonstrated a variety of temperaments and objectives. Ravana may delight in battle, but Ramuh would sooner keep to the forests with his children."},{"name":"ALPHINAUD","text":"Ere we decide to challenge Sri Lakshmi, it would seem wise to learn more of her nature from those who summoned her unto this world."},{"name":"VIRASOLDIER","text":"If that is your will, then ssso be it. To the north will you find our village. Sssarisha shall unfold all."},{"name":"ALISAIE","text":"We shall leave at once. M'naago, can you inform our comrades at the bridge of what happened?"},{"name":"MNAAGO","text":"Of course. Be safe, my friends."},{"name":"MNAAGO","text":"I will send word to Conrad and the others. Take care, and do not hesitate to send for help if you need it."},{"name":"SARISHA","text":"...We do not often receive guestsss. What is the purpossse of your visit?"},{"name":"ALPHINAUD","text":"Greetings and well met. We are the Scions of the Seventh Dawn, and we come seeking Sarisha of the Vira. You are she, are you not?"},{"name":"ALPHINAUD","text":"You have petitioned us for aid and succor, and we intend to provide them, but we would first learn more of Sri Lakshmi, that we might better understand the nature of the threat she poses to you."},{"name":"SARISHA","text":"A sssimple requessst, and one which I shall gladly oblige."},{"name":"SARISHA","text":"In the beginning was Sri Lakshmi. We were created in Her image─daughters blesssed with Her beauty. Her breath became ours; Her ssserenity our sssolace. There is naught She would not give."},{"name":"ALPHINAUD","text":"Hm. 'Twas the Qalyana broodmother's desire to bring about her daughter's resurrection which first called forth Sri Lakshmi from the aether. That being the case, I rather doubt the goddess will be spoiling for a fight."},{"name":"ALISAIE","text":"That would depend. The primal's motives will have been colored by the summoner's state of mind─namely, that of a grieving mother who had just borne witness to her daughter's murder. Though she apparently craved a miracle, she may also have harbored thoughts of vengeance.<br>Moreover, the Qalyana's conception of Sri Lakshmi may differ from that of the Vira."},{"name":"SARISHA","text":"Thisss is true. The Vira and the Qalyana do indeed regard the Lady of Blisss in different ways."},{"name":"SARISHA","text":"To the Vira, Sri Lakshmi embodies freedom. She would not sssuffer Her daughters to be bound to another's will. And ssso we ssstand with the Resissstance againssst the Empire, and give our lives for the cause."},{"name":"SARISHA","text":"To the Qalyana, however, She embodies transsscendental beauty, which they ssstrive to create through their craft. To shape cryssstal is lesss art and more ritual─a sssacred duty wherein each tribute is imbued with a fragment of the sssoul."},{"name":"SARISHA","text":"The imperials do not interfere with thisss holy work, and ssso the Qalyana were content to turn inward and ignore our plight."},{"name":"ALISAIE","text":"...Until reality asserted itself, and they summoned a primal. A fever dream to soothe their aching hearts."},{"name":"LYSE","text":"But surely they can see that it won't do any good! The imperials will still rule these lands. Nothing will change!"},{"name":"ALISAIE","text":"The Ananta will. The Qalyana bade the Vira make pilgrimage to “pay proper respects,” remember? Those who do not wish to partake of their primal's bliss will be made to do so."},{"name":"LYSE","text":"Not while <span class=\"emphasis\">we're</span> around they won't!"},{"name":"SARISHA","text":"Though our beliefsss are not the sssame, we are ssstill kin to the Qalyana. Will you help them to sssee reason?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can count on us."},{"name":"A1","text":"Know that I'll kill your god if I have to. Maybe even if I don't."},{"name":"SARISHA","text":"Then we shall, for without you we may be powerlesss to ssstop them."},{"name":"SARISHA","text":"...Do what you will, warrior. That sssimulacrum is not Sri Lakshmi."},{"name":"ALISAIE","text":"If we do not act quickly, more lives will be lost, more families torn apart...more children made to suffer."},{"name":"LYSE","text":"Then it's settled─we're going to find that primal and put an end to this!"},{"name":"SARISHA","text":"My sssister Vajra will guide you to Djanan Qhat...and I shall pray for your successs."},{"name":"ALISAIE","text":"We need to go. I won't be late again. Not like in Limsa."},{"name":"ALPHINAUD","text":"I am reminded of the tragedy we bore witness to beneath O'Ghomoro, when poor Ga Bu cried out in despair and rage, and Titan came forth in answer..."},{"name":"LYSE","text":"I'm not sure why Alisaie's so eager to face this primal all of a sudden, but you won't hear me complaining!"},{"name":"SARISHA","text":"My sssister Vajra will guide you to the Qalyana village. Do what you mussst, eikon-ssslayer."},{"name":"VAJRA","text":"Well met, Ssscions. I am Vajra. She who shines bright and unbroken."},{"name":"VAJRA","text":"I ssstand ready. We leave upon your command."}],"reward":{"gil":625,"items":[{"id":18536,"one":1,"hq":1},{"id":18548,"one":1,"hq":1},{"id":18554,"one":1,"hq":1},{"num":3,"id":5718,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68066]},"next":[68068,68352,68353,68354,68355]},"partials":[{"type":"npc","id":"1020580","obj":{"i":1020580,"n":"Alphinaud","l":2406,"q":1}},{"type":"npc","id":"1020827","obj":{"i":1020827,"n":"Vajra","l":2406,"q":3}},{"type":"npc","id":"1020581","obj":{"i":1020581,"n":"Alisaie","l":2406,"q":1}},{"type":"npc","id":"1020582","obj":{"i":1020582,"n":"Lyse","l":2406,"q":1}},{"type":"npc","id":"1020583","obj":{"i":1020583,"n":"M'naago","l":2406,"q":1}},{"type":"npc","id":"1020584","obj":{"i":1020584,"n":"Vira Battlemaid","l":2406,"q":1}},{"type":"npc","id":"1020586","obj":{"i":1020586,"n":"Alphinaud","l":2406,"q":3}},{"type":"npc","id":"1020587","obj":{"i":1020587,"n":"Alisaie","l":2406,"q":3}},{"type":"npc","id":"1020588","obj":{"i":1020588,"n":"Lyse","l":2406,"q":3}},{"type":"npc","id":"1020817","obj":{"i":1020817,"n":"Sarisha","l":2406,"q":3}},{"type":"item","id":"18536","obj":{"i":18536,"n":"Serge Gambison of Aiming","l":279,"c":43362,"t":35,"p":36069}},{"type":"item","id":"18548","obj":{"i":18548,"n":"Serge Gambison of Healing","l":279,"c":43361,"t":35,"p":36069}},{"type":"item","id":"18554","obj":{"i":18554,"n":"Serge Gambison of Casting","l":279,"c":43360,"t":35,"p":36069}},{"type":"item","id":"5718","obj":{"i":5718,"n":"Quickarm Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Skill Speed","category":0}}},{"type":"quest","id":"68066","obj":{"i":68066,"n":"Rising Fortunes, Rising Spirits","g":6,"l":"The Fringes","s":900}},{"type":"quest","id":"68068","obj":{"i":68068,"n":"The Lady of Bliss","g":6,"l":"The Fringes","s":920}},{"type":"quest","id":"68352","obj":{"i":68352,"n":"Unexpected Guests","g":104,"l":"The Fringes","s":7010,"f":1}},{"type":"quest","id":"68353","obj":{"i":68353,"n":"Delicate as a Flower","g":104,"l":"The Fringes","s":7020}},{"type":"quest","id":"68354","obj":{"i":68354,"n":"Slug It Out","g":104,"l":"The Fringes","s":7030}},{"type":"quest","id":"68355","obj":{"i":68355,"n":"Hard to Swallow","g":104,"l":"The Fringes","s":7040}}]}