{"quest":{"name":"While You Were Away","location":"Limsa Lominsa","id":68063,"patch":4.0,"sort":870,"eventIcon":71201,"issuer":1020439,"target":1020354,"involved":[1020205,1020206,1020274,1020304,1020392,1020393,1020401,1020402,1020403,1020432,1020440,1020441,1020553,1020554],"genre":6,"journal":["Home is where the heart is, and Alphinaud's is in Eorzea."],"objectives":["Speak with Thancred at Castrum Oriens.","Rendezvous with Conrad.","Speak with Pipin."],"dialogue":[{"name":"LYSE","text":"We've been away for far too long, but finally─finally, we're going to make things right!"},{"name":"ALISAIE","text":"It feels like a lifetime ago that we left for Kugane, doesn't it?"},{"name":"YUGIRI","text":"We should inform the Admiral of our arrival, and brief her on that which took place in Doma before leaving the city."},{"name":"ALPHINAUD","text":"Here we are, home at last. I must say, the journey passed more quickly than I had expected."},{"name":"ALISAIE","text":"That would be due to the absence of otherworldly interference, I expect."},{"name":"ALPHINAUD","text":"I-I should be glad if we did not speak of that unpleasantness again!"},{"name":"ALPHINAUD","text":"Ahem. But in spite of all that and more, we return better for the experience─and, more importantly, triumphant."},{"name":"YUGIRI","text":"Indeed. And with Doma freed of imperial oppression, it is only right that we turn our thoughts to the plight of Ala Mhigo."},{"name":"LYSE","text":"Well, I'm all for that, obviously, but I think you should go and see the refugees at Revenant's Toll before doing anything else. They'll be thrilled to hear what we've accomplished, and it'd sound best coming from you."},{"name":"YUGIRI","text":"...Thank you. I shall do as you suggest."},{"name":"MERLWYB","text":"I see I am not too late."},{"name":"ALPHINAUD","text":"Admiral! What are you doing here?"},{"name":"MERLWYB","text":"The East Aldenard Trading Company informed me of your impending arrival. I have tidings I thought best to share with you in person."},{"name":"LYSE","text":"From Gyr Abania?"},{"name":"MERLWYB","text":"Aye. The Alliance still holds the Wall, despite several imperial counterattacks. But we have been unable to press further into occupied territory."},{"name":"MERLWYB","text":"Commander Kemp and his men, meanwhile, have made great strides toward rebuilding their depleted ranks. They have even taken it upon themselves to attempt some few operations...with mixed results, I am sorry to say. 'Twas a complication arising from one such venture which moved me to seek you out."},{"name":"MERLWYB","text":"During a mission to transport wounded Resistance fighters to the Rising Stones, Krile Baldesion was taken prisoner."},{"name":"ALPHINAUD","text":"Krile!? Do they know where she is being held?"},{"name":"MERLWYB","text":"They do not. But your comrades were informed at once, and I am told Thancred is in Gyr Abania looking for her as we speak."},{"name":"ALPHINAUD","text":"How could this have happened...? We must seek out Thancred without delay!"},{"name":"ALPHINAUD","text":"...Nay. Krile taught me better than that. It would be unwise to act without first acquiring a full understanding of the situation..."},{"name":"ALPHINAUD","text":"Thank you for informing us. Tired though we may be, we must make haste to Castrum Oriens. Pray excuse us, Admiral, Lady Yugiri."},{"name":"PIPIN","text":"Ah, you are returned! You should speak with Thancred. He is waiting for you with Arenvald."},{"name":"RAUBAHN","text":"Glad to have you with us again. Hmm...you seem stronger than I remember─hard though I find that to believe. One would almost think you'd spent the whole time fighting. Well done, by the way."},{"name":"SERPENTOFFICER","text":"I swear to you, the imperials will not cross this wall again, on my honor as a man of the Twin Adder."},{"name":"STORMOFFICER","text":"Imperial scum! We will make them pay for this!"},{"name":"ARENVALD","text":"I'm sorry, <span class=\"highlight\">Forename</span>. It's all my fault..."},{"name":"MNAAGO","text":"It's good to see you again...though I wish it were under better circumstances..."},{"name":"THANCRED","text":"There you are! You have heard the news?"},{"name":"ALISAIE","text":"In broad strokes from Admiral Bloefhiswyn. What happened?"},{"name":"THANCRED","text":"Krile and a squadron of Resistance fighters were escorting Y'shtola and several other wounded to the Rising Stones for further treatment when they were ambushed by imperial forces."},{"name":"THANCRED","text":"Arenvald and his men fought valiantly, but in the chaos─"},{"name":"ARENVALD","text":"I will make no excuses! We failed to protect her."},{"name":"ALISAIE","text":"Do not be so hard on yourself. You protected Y'shtola and the others, did you not? Tell us about the attack."},{"name":"ARENVALD","text":"It was the Skulls. They knew a path across the Wall we hadn't found. We thought we were safe once we reached the Black Shroud. &lt;sigh&gt; We weren't expecting an ambush..."},{"name":"ARENVALD","text":"During the fighting, I caught a glimpse of their leader's memories. It was all planned."},{"name":"ALPHINAUD","text":"The advantage of having a Walker in the field."},{"name":"ARENVALD","text":"I'm not as strong in the Echo as <span class=\"highlight\">Forename</span> is, of course. Half the time, it's enough to knock me on my arse, like I've taken a dose of concentrated aether..."},{"name":"LYSE","text":"So you walked in Fordola's memories. What did you see?"},{"name":"ARENVALD","text":"A woman promised the world─education, training, citizenship─all that and more if she but sold her soul. A traitor to her people, a pretender to her masters..."},{"name":"ARENVALD","text":"...It was Zenos himself that gave the order. Told her to return with Krile Baldesion─alive."},{"name":"THANCRED","text":"Our agents have been carefully monitoring imperial communications since the attack, but have yet to intercept any transmissions making reference to Krile or her current whereabouts."},{"name":"ALPHINAUD","text":"If their orders were to bring Krile back alive, we can save her if we move quickly enough."},{"name":"THANCRED","text":"As you say, time is of the essence, which is why I intend to slip past enemy lines and see what information I can uncover on my own."},{"name":"THANCRED","text":"In the meantime, it is up to you and our allies to command the imperials' undivided attention. Lots of shouting and explosions and so forth. Keep them distracted, and I will find her."},{"name":"ALPHINAUD","text":"...Very well. I wish I could do more to aid you, but I understand."},{"name":"THANCRED","text":"Commander Kemp is on his way to the castrum as we speak for a meeting with General Aldynn. If you hurry, you could find him on the road, and discuss the situation beforehand."},{"name":"LYSE","text":"I think <span class=\"highlight\">Forename</span> and I are going to go and see Conrad like he suggested. You all wait here."},{"name":"LYSE","text":"What can I say? Patience isn't one of my virtues."},{"name":"ALPHINAUD","text":"...I wish I could go with him. It would be utterly self-defeating, but I would do it nevertheless."},{"name":"ALISAIE","text":"There's nothing wrong with wanting something stupid, so long as you don't act on it. Remember that there are other ways you can help her."},{"name":"ARENVALD","text":"Alphinaud called it an advantage, but in truth, it was a liability. The vision left me reeling, and Fordola seized the opening to push past and snatch up Krile. I'm sorry..."},{"name":"PIPIN","text":"Once Commander Kemp and his men arrive, we can begin."},{"name":"CONRAD","text":"Well, well! Isn't this a pleasant surprise! It fills my heart with joy to see you two hale and healthy."},{"name":"MNAAGO","text":"Welcome home, Lyse, <span class=\"highlight\">Forename</span>. I'm sure you've heard about Krile by now..."},{"name":"LYSE","text":"That's why we're here. I'm still not sure what to think about it...but we'll save her. We'll definitely save her somehow."},{"name":"CONRAD","text":"Aye, I've no doubt that you will. You look stronger for your time in the Far East, lass, and that's good news for Krile."},{"name":"LYSE","text":"I'd like to think so...<br>But enough about me─how is everything with you and the Resistance?"},{"name":"CONRAD","text":"Better than when you last saw us, and no mistake. Arenvald's been a godssend. Him and M'naago and all the other youngbloods have achieved so much in such a short time."},{"name":"CONRAD","text":"We've been blessed to receive the support of the Flames' Ala Mhigan Brigade, who've been instrumental in freeing our countrymen from labor camps throughout Gyr Abania, as well as some political prisoners from the city proper, believe it or not."},{"name":"CONRAD","text":"Together with the refugees returning from Ul'dah and elsewhere, we've had no shortage of able-bodied men and women eager to join the cause."},{"name":"LYSE","text":"I knew you wouldn't stop fighting, even after what happened at the Reach."},{"name":"CONRAD","text":"Force of habit, I suppose. Though we've come a long way, we still have far to go. But we'll fight for every ilm, and sooner or later, we'll get to Ala Mhigo."},{"name":"CONRAD","text":"But listen to me prattling on when we should be making haste to Castrum Oriens. There's no point you telling me everything now when you'll only have to say it all again for the Flame General's benefit."},{"name":"LYSE","text":"You're right. I'll go on ahead and tell the others that you're not far off."},{"name":"LYSE","text":"You can go ahead and tell Marshal Tarupin that Conrad's party will be arriving any moment."},{"name":"ALPHINAUD","text":"I know, I know. There's naught to be gained from giving in to my emotions. I need to stay calm and composed. Krile herself would say as much."},{"name":"ALISAIE","text":"Ephemie and the others at the Rising Stones are looking after Y'shtola now. We need not fear for her safety."},{"name":"ALISAIE","text":"As for Krile, everything that can be done is being done. It falls to the rest of us to carry on the fight."},{"name":"ARENVALD","text":"Y'shtola is safe, but it's still anyone's guess when she'll be strong enough to take to the field..."},{"name":"CONRAD","text":"Go on ahead, <span class=\"highlight\">Forename</span>. We'll not be far behind."},{"name":"MNAAGO","text":"Losing Krile hit us hard. So many of us owe her our lives...which is why we owe it to her not to give up hope. We'll find her, I'm sure of it!"},{"name":"PIPIN","text":"You have spoken with Thancred, then? Good. Take heart─if anyone can track her down, it's him."},{"name":"PIPIN","text":"I believe I hear Commander Kemp's party approaching. If you are ready to address Father and the others, let us be about it."}],"reward":{"gil":1517,"items":[{"id":18574,"one":1,"hq":1},{"id":18575,"one":1,"hq":1},{"id":18576,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68062]},"next":[68064]},"partials":[{"type":"npc","id":"1020439","obj":{"i":1020439,"n":"Alphinaud","l":29,"q":3}},{"type":"npc","id":"1020354","obj":{"i":1020354,"n":"Pipin","l":2406,"q":9}},{"type":"npc","id":"1020205","obj":{"i":1020205,"n":"Alphinaud","l":2406,"q":2}},{"type":"npc","id":"1020206","obj":{"i":1020206,"n":"Alisaie","l":2406,"q":2}},{"type":"npc","id":"1020274","obj":{"i":1020274,"n":"Yugiri","l":29,"q":2}},{"type":"npc","id":"1020304","obj":{"i":1020304,"n":"Raubahn","l":2406,"q":9}},{"type":"npc","id":"1020392","obj":{"i":1020392,"n":"Serpent Officer","l":2406,"q":6}},{"type":"npc","id":"1020393","obj":{"i":1020393,"n":"Storm Officer","l":2406,"q":6}},{"type":"npc","id":"1020401","obj":{"i":1020401,"n":"Conrad","l":2406,"q":1}},{"type":"npc","id":"1020402","obj":{"i":1020402,"n":"M'naago","l":2406,"q":1}},{"type":"npc","id":"1020403","obj":{"i":1020403,"n":"Lyse","l":2406,"q":1}},{"type":"npc","id":"1020432","obj":{"i":1020432,"n":"Lyse","l":2406,"q":3}},{"type":"npc","id":"1020440","obj":{"i":1020440,"n":"Alisaie","l":29,"q":2}},{"type":"npc","id":"1020441","obj":{"i":1020441,"n":"Lyse","l":29,"q":3}},{"type":"npc","id":"1020553","obj":{"i":1020553,"n":"Thancred","l":2406,"q":1}},{"type":"npc","id":"1020554","obj":{"i":1020554,"n":"Arenvald","l":2406,"q":2}},{"type":"item","id":"18574","obj":{"i":18574,"n":"Azurite Ring of Fending","l":279,"c":54625,"t":43,"p":16395}},{"type":"item","id":"18575","obj":{"i":18575,"n":"Azurite Ring of Slaying","l":279,"c":54625,"t":43,"p":16395}},{"type":"item","id":"18576","obj":{"i":18576,"n":"Azurite Ring of Aiming","l":279,"c":54625,"t":43,"p":16395}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68062","obj":{"i":68062,"n":"A Swift and Secret Departure","g":6,"l":"Kugane","s":860}},{"type":"quest","id":"68064","obj":{"i":68064,"n":"Rhalgr's Beacon","g":6,"l":"The Fringes","s":880}}]}