{"quest":{"name":"For the Living and the Dead","location":"The Peaks","id":68075,"patch":4.0,"sort":990,"eventIcon":71201,"issuer":1020601,"target":1020631,"involved":[1020600,1020602,1020603,1020604,1020628,1020629,1020630,1020632,1020638,1020639],"genre":6,"journal":["The question of how to move forward in Conrad's absence looms large in Alphinaud's mind."],"objectives":["Speak with Raubahn.","Speak with Lyse."],"dialogue":[{"name":"LYSE","text":"It's up to all of us to carry on in his stead. It's up to me..."},{"name":"MNAAGO","text":"I knew we'd lose people doing this, but <span class=\"emphasis\">him</span>...? I was sure the old bear would outlast us all."},{"name":"ALISAIE","text":"I did what I could for those I found along the way...but some were beyond help."},{"name":"RAUBAHN","text":"...No need to say it. I heard."},{"name":"PIPIN","text":"We lost a lot of men inside the tower. Casualties are still mounting among those who survived."},{"name":"SERPENTOFFICER","text":"The Elder Seedseer has been informed. By the grace of the Matron, mayhap we can yet save more lives..."},{"name":"STORMOFFICER","text":"Whatever “rules of war” can be said to exist, that whoreson has broken them all. This will not stand!"},{"name":"ALPHINAUD","text":"All Alliance and Resistance units have now withdrawn from Specula Imperatoris. It is time we spoke with General Aldynn."},{"name":"RAUBAHN","text":"...These deaths weigh heavy on my soul. Commander Kemp's most of all."},{"name":"RAUBAHN","text":"He was a wise leader. He was a patriot. But above all else, he was a good man who will be sorely missed. One of many lost this day. I ask for a moment's silence to pray for the souls of the departed."},{"name":"RAUBAHN","text":"We have suffered a grievous defeat. But we can not and will not renounce this cause. The die has been cast."},{"name":"RAUBAHN","text":"Hold tight to this grief, this anger, and let it drive you forward. Let it be your strength and your shield when next you face the enemy."},{"name":"ALPHINAUD","text":"It will carry us far, General. Of that I have no doubt."},{"name":"ALPHINAUD","text":"Ere we take another step towards Ala Mhigo, however, we must first address the question of how to deal with Castrum Abania's cannon. If the imperials are willing to employ the weapon without thought for their own soldiers' safety, we may struggle to approach them."},{"name":"ALISAIE","text":"A frontal assault is out of the question. We'd lose countless men before we even reached the walls."},{"name":"PIPIN","text":"Would we? Recall that the imperials could have obliterated our forces had they kept firing, but neglected to do so."},{"name":"PIPIN","text":"They had no strategic reason to cease fire, which begs the question: why did they?"},{"name":"ALPHINAUD","text":"...You suspect they were <span class=\"emphasis\">unable</span> to fire the cannon again. Mayhap due to a malfunction?"},{"name":"PIPIN","text":"Or one of their officers found his conscience after the first barrage. Or a heretofore unknown Resistance faction chose that moment to disable it."},{"name":"PIPIN","text":"There are many possibilities, but the fact remains that they stopped when logic dictated they continue."},{"name":"LYSE","text":"Then I'll just have to go and see for myself if the cannon is still operational."},{"name":"MNAAGO","text":"Are you mad? Conrad put you in charge of the Resistance! We can't risk losing another commander so soon!"},{"name":"LYSE","text":"I know how you feel, Naago, I do. But I need you to understand..."},{"name":"LYSE","text":"It wasn't long after Papalymo and I arrived at Rhalgr's Reach that Conrad first asked me to join the Resistance. And then he kept on asking."},{"name":"LYSE","text":"Every time I said no, I told myself it was because of the Scions. But even then, I knew deep down that it was an excuse. That I was still afraid of following my heart, because I couldn't be sure if it was for me or for Yda."},{"name":"LYSE","text":"But then I met someone, on the other side of the world, who had struggled with the same worries. And as we traveled and fought together I saw him grow and become the leader his people needed him to be."},{"name":"LYSE","text":"And now it's my turn to do the same."},{"name":"LYSE","text":"There's not a lot of us left, and of the ones that are, many are still wounded. We have to make do with what we've got, and I'm the best qualified. It's as simple as that. But don't worry, Naago. I'll come back. I promise."},{"name":"RAUBAHN","text":"While I acknowledge Commander Hext's right to carry out this mission, I see no reason why she should do so alone. <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span></span>, would you go with her?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Would've done it even if you hadn't asked, sir."},{"name":"A1","text":"I suppose someone's got to keep her out of harm's way..."},{"name":"RAUBAHN","text":"Then it is settled. We will await your return."},{"name":"MNAAGO","text":"Conrad confided in me that he was considering naming her as his successor, so it didn't come as a complete shock. I mean, I was still surprised, but I've never once doubted his judgment. None of us have. If he thought Lyse was the best choice, then she is."},{"name":"ALISAIE","text":"(When did <span class=\"emphasis\">Lyse</span> become leader of the Resistance? That...that is... Hm. I suppose we have Hien to thank for this too.)"},{"name":"ALPHINAUD","text":"I understand M'naago's concern. If they were to lose another leader so soon after losing Conrad, the Resistance might never recover."},{"name":"RAUBAHN","text":"(More than a keeper, she needs a friend now. Stay close to her.)"},{"name":"PIPIN","text":"One can but wonder how the rank and file of the XIIth Legion will view their leadership upon hearing about the fate of Specula Imperatoris."},{"name":"SERPENTOFFICER","text":"Grim though it is, the conjurers have had no choice but to impose a rigid triage system when treating the wounded. Under the circumstances, we have to be realistic."},{"name":"STORMOFFICER","text":"Mark my words: when this is over, I will take the heads of every officer in Castrum Abania. I'll swing the bloody axe myself if I have to!"},{"name":"LYSE","text":"...Sorry to drag you into this, <span class=\"highlight\">Forename</span>."},{"name":"LYSE","text":"It may not be the decision Conrad would've made...but I'm not Conrad. I never will be. I don't know what kind of leader he was hoping for, but right now, all I can do is be myself..."}],"reward":{"gil":595,"items":[{"id":27373,"one":1,"hq":1},{"id":27374,"one":1,"hq":1},{"num":3,"id":5633,"one":1}],"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":142}],"quests":[68074]},"next":[68076,68370,68371,68372,68373,68374,68382,68383,68384]},"partials":[{"type":"npc","id":"1020601","obj":{"i":1020601,"n":"Alphinaud","l":2407,"q":4}},{"type":"npc","id":"1020631","obj":{"i":1020631,"n":"Lyse","l":2407,"q":4}},{"type":"npc","id":"1020600","obj":{"i":1020600,"n":"M'naago","l":2407,"q":4}},{"type":"npc","id":"1020602","obj":{"i":1020602,"n":"Alisaie","l":2407,"q":4}},{"type":"npc","id":"1020603","obj":{"i":1020603,"n":"Lyse","l":2407,"q":4}},{"type":"npc","id":"1020604","obj":{"i":1020604,"n":"Raubahn","l":2407,"q":9}},{"type":"npc","id":"1020628","obj":{"i":1020628,"n":"M'naago","l":2407,"q":4}},{"type":"npc","id":"1020629","obj":{"i":1020629,"n":"Alphinaud","l":2407,"q":4}},{"type":"npc","id":"1020630","obj":{"i":1020630,"n":"Alisaie","l":2407,"q":6}},{"type":"npc","id":"1020632","obj":{"i":1020632,"n":"Pipin","l":2407,"q":9}},{"type":"npc","id":"1020638","obj":{"i":1020638,"n":"Serpent Officer","l":2407,"q":9}},{"type":"npc","id":"1020639","obj":{"i":1020639,"n":"Storm Officer","l":2407,"q":9}},{"type":"item","id":"27373","obj":{"i":27373,"n":"Molybdenum Gunblade","l":285,"c":36013,"t":106,"p":39564}},{"type":"item","id":"27374","obj":{"i":27374,"n":"Molybdenum Chakrams","l":285,"c":36213,"t":107,"p":39564}},{"type":"item","id":"5633","obj":{"i":5633,"n":"Piety Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"68074","obj":{"i":68074,"n":"The Road Home","g":6,"l":"The Peaks","s":980}},{"type":"quest","id":"68076","obj":{"i":68076,"n":"Above the Churning Waters","g":6,"l":"The Peaks","s":1000}},{"type":"quest","id":"68370","obj":{"i":68370,"n":"Lost in Transit","g":105,"l":"The Peaks","s":8070}},{"type":"quest","id":"68371","obj":{"i":68371,"n":"Picking Up the Slack","g":105,"l":"The Peaks","s":8110}},{"type":"quest","id":"68372","obj":{"i":68372,"n":"We Need to Talk","g":105,"l":"The Peaks","s":8120}},{"type":"quest","id":"68373","obj":{"i":68373,"n":"What's Mine Is Mine","g":105,"l":"The Peaks","s":8130}},{"type":"quest","id":"68374","obj":{"i":68374,"n":"A Special Treat","g":105,"l":"The Peaks","s":8060}},{"type":"quest","id":"68382","obj":{"i":68382,"n":"Eau de Muud","g":105,"l":"The Peaks","s":8080}},{"type":"quest","id":"68383","obj":{"i":68383,"n":"Strange Tastes","g":105,"l":"The Peaks","s":8090}},{"type":"quest","id":"68384","obj":{"i":68384,"n":"Soup's On","g":105,"l":"The Peaks","s":8100}}]}