{"quest":{"name":"The Key to Victory","location":"The Lochs","id":68085,"patch":4.0,"sort":1090,"eventIcon":71201,"issuer":1021704,"target":1021710,"involved":[1021705,1021706,1021708,1021709,1021711,1022724,1022725,1022726,1022729,1022730,1022731],"genre":6,"journal":["Alphinaud remains concerned for his dear friend.","Speak with Lyse.","Speak with Lyse."],"objectives":["Head for the Saltery","Search the Saltery for clues","Head for Sali Monastery","Survive the imperial ambush"],"dialogue":[{"name":"LYSE","text":"Cotter built those walls to give shelter to his brothers and sisters. And now our people's freedom rests on us tearing them down..."},{"name":"MNAAGO","text":"Most of the Ala Mhigans in the residential district are Aan, so I doubt we'll have to deal with many imperial sympathizers."},{"name":"ARENVALD","text":"The battle for Castrum Abania was brutal, but the one for Ala Mhigo will be unlike any we have ever known..."},{"name":"VMAHTIA","text":"The end is in sight. It has been a long time coming..."},{"name":"JMOLDVA","text":"\"A storm of blood approaches fast... Hells open, Heavens weep...“"},{"name":"ALPHINAUD","text":"For all our other accomplishments, Krile remains in the hands of our enemy, and I find myself wondering if we─if <span class=\"emphasis\">I</span> could have done more. Though we know now that she was taken to the city, we have found nothing which might tell us where she is being held."},{"name":"THANCRED","text":"You know, you could just ask me."},{"name":"ALPHINAUD","text":"Thancred! What have you learned?"},{"name":"THANCRED","text":"I shall spare you the particulars of my infiltration and simply state that I have seen her with my own eyes. She is being held within the residential district south of the city proper."},{"name":"THANCRED","text":"I tracked her to the ruins of an old temple of the Fist of Rhalgr, within which the imperials have constructed a research facility..."},{"name":"ALPHINAUD","text":"A <span class=\"emphasis\">research facility</span>? What manner of research?"},{"name":"THANCRED","text":"Why...methods to imbue Garleans with the power to manipulate aether. In pursuit of which goal, their scientists have, I am sorry to report, performed many questionable experiments─on living subjects."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">What</span>!?"},{"name":"LYSE","text":"Calm down, Alphinaud. We've already been tasked with securing the Ala Mhigan Quarter. This just gives us a reason to do it faster."},{"name":"THANCRED","text":"I entered and exited the facility by stowing aboard imperial transports, but that method is not suitable for a larger force."},{"name":"THANCRED","text":"And it goes without saying that a direct assault on the rather substantial main gates would be ill-advised."},{"name":"MNAAGO","text":"I think I might know someone who can help."},{"name":"MNAAGO","text":"One of my men. He had an idea about how to get into the city─ Actually, it might be best if I let him explain it himself."},{"name":"WISCAR","text":"(-Cynical Youth-)It's been a while. I'll not take offense if you don't remember. Might even be glad of it."},{"name":"LYSE","text":"...Ala Gannha, am I right?"},{"name":"WISCAR","text":"Aye. Wiscar's the name. I was raised in the Peaks, but my mum grew up in the city."},{"name":"WISCAR","text":"Er...anyroad, I reckon we can get inside the Ala Mhigan Quarter by way of Loch Seld."},{"name":"LYSE","text":"What? How?"},{"name":"WISCAR","text":"It was a story my mum told us which made me think of it. She was always going on about what life was like when she was a girl, see...how they used to have to boil the water from the well before they could drink it, since it was full of salt─"},{"name":"LYSE","text":"They were drawing saltwater from the lochs! Which means that there must be an underwater tunnel or something."},{"name":"WISCAR","text":"Aye, that's it. But it won't be as simple as going for a swim."},{"name":"WISCAR","text":"The well was closed, see. Apparently, Theodoric decided one day he wanted to control the water supply and forbade water trading. So even if you come up through it, you'll find yourself on the wrong side of a locked gate."},{"name":"WISCAR","text":"At the time, my grandfather, being an enterprising sort, befriended a guard and lifted the key from his belt. He made a copy and carried on selling water until the imperials invaded, and he ended up working at the Saltery..."},{"name":"THANCRED","text":"In short, we need your grandfather's key. Assuming he still has it."},{"name":"WISCAR","text":"I'm certain he does. And I can take you to him. But it'll be dangerous."},{"name":"LYSE","text":"Don't you worry about that. We're used to dangerous."},{"name":"LYSE","text":"Naago and Arenvald will assemble a squadron while the rest of us go and get that key."},{"name":"THANCRED","text":"Had I judged it possible to rescue her myself, I would have. But there were too many guards; too many ways it could have ended badly. I knew at once I would need your help."},{"name":"MNAAGO","text":"Meffrid told me about your time in Ala Gannha─how a certain someone gave you a piece of his mind when you first met. Try not to hold it against him."},{"name":"ARENVALD","text":"If there's a chance we can rescue Krile, I want to be involved. I owe her that much."},{"name":"ALPHINAUD","text":"Hold on, Krile. We're coming..."},{"name":"WISCAR","text":"We couldn't've had more than a few days' training when the imperials attacked the Reach, but I've seen my share of combat since! I may be no hero like you, but I can hold my own against imperial regulars─you'll see!"},{"name":"LYSE","text":"Let's not waste any more time, then, shall we?"},{"name":"WISCAR","text":"My mum said Grandad kept the key with him at all times as a lucky charm. If he hasn't got it, then, well..."},{"name":"LYSE","text":"Then we'll cross that bridge when we come to it.<br>Ready, <span class=\"highlight\">Forename</span>? We may have to deal with a few imperial patrols, or worse..."},{"name":"WISCAR","text":"This is it. This is the monastery. They have to be around here somewhere..."},{"name":"WISCAR","text":"Watt! Watt! It's me, Wiscar! Your grandson!"},{"name":"WATT","text":"...Wiscar? By Rhalgr, is that really you?"},{"name":"WATT","text":"...Oh, it's good to see you alive and well, lad! But who are these other ones?"},{"name":"WISCAR","text":"The Resistance, Grandad. My, er...my comrades-in-arms."},{"name":"WATT","text":"She told you all about me thumbing my nose at the mad king, did she? Heh. Daft sods never caught me neither..."},{"name":"WATT","text":"It wasn't much, but it was my way of rebelling against his rule. Glad to see you've got higher aspirations. Here─make our family proud."},{"name":"WISCAR","text":"I will, I swear! Rhalgr as my witness!"},{"name":"THANCRED","text":"The revolutionary spirit runs in the family, I see."},{"name":"WISCAR","text":"I'll make him proud. I'll make them all proud!"},{"name":"ALPHINAUD","text":"We should go. Arenvald and the others are waiting."},{"name":"WATT","text":"If I were ten years younger...but I'm not. Look after my grandson."},{"name":"LYSE","text":"I was worried when he wasn't at the Saltery. But we found him in the end."},{"name":"LYSE","text":"Now that we've got the key, it's time to find that underwater tunnel!"},{"name":"QIB","text":"Wiscar's Vitality"},{"name":"WISCAR","text":"The Saltery's not far. Follow me!"},{"name":"WISCAR","text":"We're here, but...this isn't right. Where is everyone?"},{"name":"ALPHINAUD","text":"Word of the Alliance's advance has surely reached their ears. Mayhap they sought refuge elsewhere? We should search the buildings for clues."},{"name":"SYSTEM","text":"In the wake of the ambush, you find a diary belonging to a laborer. The last entry makes mention of a plan to take shelter in the Sali Monastery..."},{"name":"SYSTEM","text":"The barrel appears to have recently been filled with fish packed in salt. Someone was hard at work less than a week ago..."},{"name":"SYSTEM","text":"The crumbling masonry appears to have lain undisturbed for some time..."},{"name":"SYSTEM","text":"The pot is filled to the brim with salt from the lochs..."},{"name":"SYSTEM","text":"The lumber appears to have lain undisturbed for some time..."},{"name":"SYSTEM","text":"The magitek device suddenly springs to life, flashing brightly and emitting a shrill sound. It's a trap!"},{"name":"THANCRED","text":"All right, which one of you triggered the obvious trap!?"},{"name":"ALPHINAUD","text":"On your guard! Magitek drones approaching!"},{"name":"THANCRED","text":"Mayhap...half a dozen? <span class=\"highlight\">Forename</span>─keep Wiscar alive, would you?"},{"name":"WISCAR","text":"Seven hells! I could do with some help here!"},{"name":"THANCRED","text":"Now then, where were we? Ah, yes, looking for clues as to the whereabouts of our erstwhile water merchant and his key..."},{"name":"WISCAR","text":"The Sali Monastery! That's to the south. I'll lead the way!"},{"name":"LYSE","text":"Not after that ambush you won't! It's too dangerous! <span class=\"highlight\">Forename</span>, we'll follow you. Keep your eyes peeled for more magitek!"},{"name":"WISCAR","text":"The monastery is just past that gate. Keep going!"},{"name":"THANCRED","text":"Hm. Something tall, dark and <span class=\"emphasis\">imperial</span> appears to be blocking the entrance."},{"name":"WISCAR","text":"Gods<span class=\"emphasis\">dammit</span>! I don't think there's a way round..."},{"name":"LYSE","text":"Then we'll just have to go through him!"},{"name":"ALPHINAUD","text":"Look! I think those two devices are shield generators!"},{"name":"THANCRED","text":"I will keep the machine occupied. <span class=\"highlight\">Forename</span>, be a <span class=\"alternative-container\"><span class=\"alternative\">darling</span><span class=\"alternative\">good chap</span></span> and destroy the generators before it rips my head off."},{"name":"ALPHINAUD","text":"'Tis done! See how it falters! Belabor the brute!"},{"name":"LYSE","text":"He won't be getting up after that! Now, let's find our man!"},{"name":"THANCRED","text":"Ugh, that will leave a mark..."},{"name":"ALPHINAUD","text":"Confound it..."},{"name":"WISCAR","text":"Just when I was getting the hang of it..."},{"name":"LYSE","text":"You've ruined everything..."}],"reward":{"gil":1827,"items":[{"id":18691,"one":1,"hq":1},{"id":18703,"one":1,"hq":1},{"id":18709,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":240300},"reqs":{"jobs":[{"lvl":69,"id":142}],"quests":[68084]},"next":[68086]},"partials":[{"type":"npc","id":"1021704","obj":{"i":1021704,"n":"Alphinaud","l":2408,"q":3}},{"type":"npc","id":"1021710","obj":{"i":1021710,"n":"Lyse","l":2408,"q":2}},{"type":"npc","id":"1021705","obj":{"i":1021705,"n":"Lyse","l":2408,"q":2}},{"type":"npc","id":"1021706","obj":{"i":1021706,"n":"Arenvald","l":2408,"q":3}},{"type":"npc","id":"1021708","obj":{"i":1021708,"n":"Thancred","l":2408,"q":2}},{"type":"npc","id":"1021709","obj":{"i":1021709,"n":"Alphinaud","l":2408,"q":2}},{"type":"npc","id":"1021711","obj":{"i":1021711,"n":"Thancred","l":2408,"q":2}},{"type":"npc","id":"1022724","obj":{"i":1022724,"n":"M'naago","l":2408,"q":3}},{"type":"npc","id":"1022725","obj":{"i":1022725,"n":"V'mah Tia","l":2408,"q":3}},{"type":"npc","id":"1022726","obj":{"i":1022726,"n":"J'moldva","l":2408,"q":3}},{"type":"npc","id":"1022729","obj":{"i":1022729,"n":"Wiscar","l":2408,"q":2}},{"type":"npc","id":"1022730","obj":{"i":1022730,"n":"Wiscar","l":2408,"q":2}},{"type":"npc","id":"1022731","obj":{"i":1022731,"n":"Watt","l":2408,"q":2}},{"type":"item","id":"18691","obj":{"i":18691,"n":"Twinsilk Turban of Aiming","l":285,"c":40772,"t":34,"p":21760}},{"type":"item","id":"18703","obj":{"i":18703,"n":"Twinsilk Hood of Healing","l":285,"c":41715,"t":34,"p":21760}},{"type":"item","id":"18709","obj":{"i":18709,"n":"Twinsilk Hood of Casting","l":285,"c":41714,"t":34,"p":21760}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68084","obj":{"i":68084,"n":"Upon the Great Loch's Shore","g":6,"l":"Rhalgr's Reach","s":1080}},{"type":"quest","id":"68086","obj":{"i":68086,"n":"The Resonant","g":6,"l":"The Lochs","s":1100}}]}