{"quest":{"name":"The Price of Freedom","location":"The Peaks","id":68080,"patch":4.0,"sort":1040,"icon":100663,"eventIcon":71201,"issuer":1023606,"target":1020647,"involved":[1020437,1020604,1020632,1020636,1020638,1020639,1020646,1020648,1020650,1021620,1021621,1022346,1023607,1023608,1023609],"genre":6,"journal":["As usual, Alphinaud has a brilliant plan.","The Alliance and the Resistance cannot suffer a repeat of the slaughter at Specula Imperatoris. As such, they will not march upon Castrum Abania until they can be certain the fortress's main cannon will not be brought to bear against them. Though the weapon was apparently disabled by a single unknown assailant, it is only a matter of time before it is restored to operational status. With the aid of an Alliance contact in Radiata, you and your comrades have devised a plan to infiltrate the castrum and seize control of the cannon's fire control center, after which you will signal the Allied forces to advance. But before you can do that, you must first deal with the patrols between you and the castrum.","You dispatch the imperial patrol quickly and brutally, leaving nothing to chance. But it is only the first. Another is approaching.","The second patrol goes as quietly as its predecessor. Though Alphinaud and Alisaie lack your skill and finesse, it seems unlikely that their own targets proved any more troublesome...","As expected, Alphinaud and Alisaie are fine, as is Stark Woad, your contact. Your point of entry to Castrum Abania is not far, but a final patrol must be dealt with before you can proceed.","Once more you ambush and kill the unsuspecting imperial soldiers, removing the last obstacle between the entrance to the ventilation system and your comrades. Nevertheless, one can never be too careful; it would be prudent to stand watch for a time.","No more patrols are forthcoming, and so you signal your comrades to advance. Your plan, as Alphinaud reminds you, will be to split into two parties─one comprising Alphinaud and Alisaie, and the other, you and the irrepressible adventurers who you had the wisdom...et cetera and so on. Each will attempt to create a diversion inside the castrum, thereby allowing Lyse and her unit of Resistance fighters to proceed relatively unhindered to the fire control center. Weapons research is to be your destination, and one can only imagine what manner of foes await you there...<br><br>※Castrum Abania can be accessed via the Duty Finder.","Though the monstrosities within weapons research are as fearsome as they are horrific, it is they who should rightly be afraid. Shortly after delivering your verdict on another few billion gil of Garlean innovation, you are rejoined by Alphinaud and Alisaie, and together you make haste to the fire control center to rendezvous with Lyse and seize control of the cannon.","At last you come face–to–face with the officer responsible for the destruction of Specula Imperatoris: Fordola rem Lupis. She makes no apologies for her actions and declares that all was in service to her countrymen─to secure a place for them within imperial society. Enraged, Lyse charges with murder in her eyes, only to find that her opponent possesses supernatural strength and agility. After effortlessly evading her attacks and cutting down Alisaie with a single stroke, Fordola dives through the window and makes her escape, but not before extending you and your comrades an invitation to the “royal hunt” on behalf of Zenos yae Galvus.","With nothing to fear from the fortress's dormant cannon, Allied forces march on Castrum Abania and seize control of it in short order. Save for Alisaie's injuries─which you are assured will heal in time─the operation has gone exactly to plan. And yet Lyse stands apart, quiet and distant..."],"objectives":["Search for imperial patrols between Radiata and Castrum Abania.","Speak with Stark Woad.","Lie in wait for imperial soldiers.","Stand watch for any remaining imperial soldiers.","Enter Castrum Abania.","Speak with Lyse."],"dialogue":[{"name":"ALISAIE","text":"It's good to see that even this deep within occupied territory, there are still those who would defy their oppressors."},{"name":"LYSE","text":"It's thanks to brave men and women like her that we still have a chance to win this war."},{"name":"PIPIN","text":"So long as the imperials hold Castrum Abania, we will not be able to march on Ala Mhigo."},{"name":"SERPENTOFFICER","text":"We have lost so many men already... If we suffer another defeat like that, this campaign is over."},{"name":"STORMOFFICER","text":"We will have our retribution. It is but a matter of time."},{"name":"RAUBAHN","text":"Had Alphinaud not volunteered you, I would have asked. If anyone can see this mission through, it's you."},{"name":"STARKWOAD","text":"I tell you, some of these Resistance folk can't see the forest for the trees. Ambushing the occasional imperial patrol won't change a damn thing. Infiltrating their castrums and learning their secrets, on the other hand..."},{"name":"ALPHINAUD","text":"We have that for which we came. All that remains is to make our preparations."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>─you and your ever-dependable allies will enter the castrum with my sister and I by way of the ventilation ducts leading to the hangars. From there, you will proceed into weapons research and unleash bloody mayhem."},{"name":"ALPHINAUD","text":"At the same time, Alisaie and I will create a diversion elsewhere, and in the ensuing confusion, Lyse and her unit will attempt to reach the fire control center undetected."},{"name":"ALPHINAUD","text":"If all goes to plan, our three parties will subsequently converge on this location, and together we will secure the cannon before finally notifying the Alliance that they are clear to attack."},{"name":"LYSE","text":"Sounds simple enough. I'll go and brief Naago on the details."},{"name":"STARKWOAD","text":"The rest of you come with me. We'll need to deal with the magitek patrols before you can infiltrate the castrum."},{"name":"STARKWOAD","text":"They should be here any moment..."},{"name":"ALISAIE","text":"Here's hoping there aren't too many for us to handle."},{"name":"ALPHINAUD","text":"Quickly and quietly, so as not to raise the alarum..."},{"name":"BALLOON","text":"Enemy soldiers? Here!?"},{"name":"BALLOON","text":"Kill the savage!"},{"name":"ALISAIE","text":"It won't be long before someone realizes their armor is missing. We have to hurry!"},{"name":"ALPHINAUD","text":"The Alliance is counting on us to deal with that cannon. Failure is not an option."},{"name":"BALLOON","text":"It's the Resistance!"},{"name":"BALLOON","text":"&lt;growl&gt;"},{"name":"STARKWOAD","text":"Almost there, friends. Your point of entry is just around the bend up ahead. The last patrol should be here any moment."},{"name":"STARKWOAD","text":"Once you've dealt with them, we'll be clear to advance...assuming they keep to their usual schedule. Might be prudent to stand watch for a moment after, just in case."},{"name":"STARKWOAD","text":"Lead the way and deal with the last patrol, if you would. We'll hold here and watch for soldiers coming from the west."},{"name":"BALLOON","text":"Enemy sighted! Attack!"},{"name":"STARKWOAD","text":"By Rhalgr, I knew you lot were good, but I never expected you to defeat them so swiftly..."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span> is the finest warrior I know, and I should like to think we have learned something from our time in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> company... Now─where is the entrance to the ducts?"},{"name":"STARKWOAD","text":"Right behind you. I've mapped the branches, so you should have no trouble reaching the hangars or any number of other places."},{"name":"ALPHINAUD","text":"Understood. Thank you again for your invaluable assistance."},{"name":"ALPHINAUD","text":"As discussed, <span class=\"highlight\">Forename</span>, we shall divide into two groups and proceed via separate routes into the castrum."},{"name":"ALPHINAUD","text":"Remember that our objective is to cause as much chaos as possible to draw the imperials away from Lyse and her men."},{"name":"STARKWOAD","text":"If there's nothing else, I'll return to the Resistance forces and show them to their entrance. May Rhalgr guide you to victory!"},{"name":"ALPHINAUD","text":"This is your last chance to make your preparations, <span class=\"highlight\">Forename</span>. When you and yours are ready, we shall begin."},{"name":"LYSE","text":"Well, we did it. Castrum Abania belongs to us now..."},{"name":"LYSE","text":"Naago and her people took Alisaie to Radiata to receive treatment. Alphinaud tells me she'll make a full recovery..."},{"name":"LYSE","text":"I know I should be happy. We won, and with minimal casualties. But somehow...it feels empty."},{"name":"LYSE","text":"We should report to General Aldynn. Krile wasn't here, but who knows, maybe one of Raubahn's men found something which could lead us to her. Can't hurt to ask, anyway."},{"name":"RAUBAHN","text":"Well done! That thrice-damned cannon won't be troubling us again."},{"name":"SERPENTOFFICER","text":"I am told one of your comrades was injured during the operation. If there is aught we can do to help, pray do not hesitate to ask."}],"reward":{"gil":4101,"items":[{"id":18676,"one":1,"hq":1},{"id":18682,"one":1,"hq":1},{"id":18688,"one":1,"hq":1},{"id":18700,"one":1,"hq":1},{"num":3,"id":5633,"one":1}],"xp":240300,"instance":55},"reqs":{"jobs":[{"lvl":69,"id":142}],"quests":[68079]},"next":[68081]},"partials":[{"type":"npc","id":"1023606","obj":{"i":1023606,"n":"Alphinaud","l":2407,"q":1}},{"type":"npc","id":"1020647","obj":{"i":1020647,"n":"Lyse","l":2407,"q":2}},{"type":"npc","id":"1020437","obj":{"i":1020437,"n":"Stark Woad","l":2407,"q":1}},{"type":"npc","id":"1020604","obj":{"i":1020604,"n":"Raubahn","l":2407,"q":9}},{"type":"npc","id":"1020632","obj":{"i":1020632,"n":"Pipin","l":2407,"q":9}},{"type":"npc","id":"1020636","obj":{"i":1020636,"n":"Alphinaud","l":2407,"q":3}},{"type":"npc","id":"1020638","obj":{"i":1020638,"n":"Serpent Officer","l":2407,"q":9}},{"type":"npc","id":"1020639","obj":{"i":1020639,"n":"Storm Officer","l":2407,"q":9}},{"type":"npc","id":"1020646","obj":{"i":1020646,"n":"Stark Woad","l":2407,"q":1}},{"type":"npc","id":"1020648","obj":{"i":1020648,"n":"Raubahn","l":2407,"q":2}},{"type":"npc","id":"1020650","obj":{"i":1020650,"n":"Serpent Officer","l":2407,"q":4}},{"type":"npc","id":"1021620","obj":{"i":1021620,"n":"Alphinaud","l":2407,"q":1}},{"type":"npc","id":"1021621","obj":{"i":1021621,"n":"Alisaie","l":2407,"q":1}},{"type":"npc","id":"1022346","obj":{"i":1022346,"n":"Lyse","l":2407,"q":1}},{"type":"npc","id":"1023607","obj":{"i":1023607,"n":"Alisaie","l":2407,"q":1}},{"type":"npc","id":"1023608","obj":{"i":1023608,"n":"Alphinaud","l":2407,"q":1}},{"type":"npc","id":"1023609","obj":{"i":1023609,"n":"Alisaie","l":2407,"q":1}},{"type":"item","id":"18676","obj":{"i":18676,"n":"Twinsilk Slops of Fending","l":285,"c":47335,"t":36,"p":36267}},{"type":"item","id":"18682","obj":{"i":18682,"n":"Gazelleskin Brais of Maiming","l":285,"c":47337,"t":36,"p":36267}},{"type":"item","id":"18688","obj":{"i":18688,"n":"Gazelleskin Brais of Striking","l":285,"c":47338,"t":36,"p":36267}},{"type":"item","id":"18700","obj":{"i":18700,"n":"Gazelleskin Brais of Scouting","l":285,"c":47339,"t":36,"p":36267}},{"type":"item","id":"5633","obj":{"i":5633,"n":"Piety Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"instance","id":"55","obj":{"i":55,"n":"Castrum Abania","c":61801,"t":"Dungeons","min_lvl":69,"max_lvl":70,"min_ilvl":260,"max_ilvl":290}},{"type":"quest","id":"68079","obj":{"i":68079,"n":"Where Courage Endures","g":6,"l":"The Peaks","s":1030}},{"type":"quest","id":"68081","obj":{"i":68081,"n":"Raubahn's Invitation","g":6,"l":"The Peaks","s":1050}}]}