{"quest":{"name":"The Measure of His Reach","location":"The Lochs","id":68088,"patch":4.0,"sort":1120,"eventIcon":71201,"issuer":1021698,"target":1021724,"involved":[1020598,1021719,1021720,1021721,1021722,1021723,1021725,1022738,1022739,1023838],"genre":6,"journal":["Raubahn has a personal favor to ask of you."],"objectives":["Deliver Raubahn's package to Pipin.","Follow Alphinaud.","Speak with Hakuro.","Report to Pipin.","Defeat the Ferae Domitae","Defeat Hakuro Whitefang"],"dialogue":[{"name":"ALPHINAUD","text":"I have asked Urianger to look after Krile. He will keep her out of harm's way. Though, after what she has endured, her physical well-being may be the least of our worries..."},{"name":"URIANGER","text":"Worry not for her safety. Look thee to the east."},{"name":"RAUBAHN","text":"Right, then. I must go to my men. I shall be leading the first charge through the breach."},{"name":"ALPHINAUD","text":"Then we shall head to the front."},{"name":"RAUBAHN","text":"Pipin has command of our artillery outside the gate. He'll not be hard to find."},{"name":"RAUBAHN","text":"Ah, but before you go, I have a final favor to ask."},{"name":"RAUBAHN","text":"Give this to my son. He will understand."},{"name":"RAUBAHN","text":"There's no need for explanations. When he sees it, he will know."},{"name":"ALPHINAUD","text":"'Twould seem our position here is secure..."},{"name":"PIPIN","text":"<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span></span>, Alphinaud. Hm? What is that you've got there?"},{"name":"PIPIN","text":"By the Twelve, this is...this is Tizona!"},{"name":"ALPHINAUD","text":"The Bull of Ala Mhigo's legendary sword, forged from two cursed blades..."},{"name":"PIPIN","text":"This sword is a symbol of everything my father fought to achieve. A weapon claimed on the bloodsands, and with it fortune and glory. Its flames consume the unworthy, but by fire was he reborn."},{"name":"PIPIN","text":"That he should bequeath it to me now...to carry on his legacy...<br>Well, I shall endeavor to deserve it. But I'll be damned if this is his final battle!"},{"name":"PIPIN","text":"Once we begin, there will be no respite until it's over. Are you ready, my friends?"},{"name":"PIPIN","text":"Very well. Brace yourselves. This should be quite a specta─"},{"name":"FLAMEHERALD","text":"Vice Marshal! Vice Marshal! Imperial unit approaching from the north!"},{"name":"PIPIN","text":"Aiming to destroy our artillery, are they? How many?"},{"name":"FLAMEHERALD","text":"Total numbers unconfirmed. At least one squadron. But sir─they're wolfmen!"},{"name":"PIPIN","text":"Ferae Domitae. Bloody hells, that's all we need. Call up the Bloodsworn. Tell them to make ready─"},{"name":"ALPHINAUD","text":"Marshal Tarupin, wait!"},{"name":"ALPHINAUD","text":"These “wolfmen” of whom you speak hail from Doma. They were <span class=\"emphasis\">coerced</span> into fighting for the Empire─spirited away to a foreign land and told that if they disobeyed, the lives of their kin would be forfeit."},{"name":"ALPHINAUD","text":"But their homeland has been liberated. They have no reason to continue serving their imperial masters!"},{"name":"ALPHINAUD","text":"Ere you engage them in battle, I beseech you: grant us a moment to go and attempt to convince them to lay down their arms!"},{"name":"PIPIN","text":"I am loath to gift our enemy more time to prepare...but if there is a chance that this conflict might be avoided, I suppose we must take it. Go then─but be quick."},{"name":"ALPHINAUD","text":"We will, Vice Marshal."},{"name":"ALPHINAUD","text":"With me, <span class=\"highlight\">Forename</span>! "},{"name":"ALPHINAUD","text":"I dream of a day when people accept my words as truth without demanding that I prove them through feats of strength. But come, we must away."},{"name":"PIPIN","text":"Our scouts report that the wolfmen are advancing on our position from the north of the city. Convince them to retreat, or we will have no choice but to engage."},{"name":"ALPHINAUD","text":"We will wait here for the Lupin to arrive. Steel yourself, my friend. Though I hope to resolve this without resorting to violence, it would seem wise to prepare for the worst..."},{"name":"ALPHINAUD","text":"They come, <span class=\"highlight\">Forename</span>!"},{"name":"HAKURO","text":"(-Ferae Domitae Centurion-)You! Clear the road!"},{"name":"ALPHINAUD","text":"Honorable warriors of Doma! My name is Alphinaud Leveilleur, and I come before you with news of great import─"},{"name":"HAKURO","text":"(-Ferae Domitae Centurion-)Silence, boy! You stand upon a battlefield. Begone, or be cut down!"},{"name":"ALPHINAUD","text":"Doma is free! Lord Hien has returned and driven Yotsuyu and the imperials from your lands! We were there─we helped him! There is no need for you to fight for Zenos!"},{"name":"HAKURO","text":"(-Ferae Domitae Centurion-)Lord Hien is dead, and you are a liar! What could a boy such as you do against magitek? Throw stones and spit curses!?"},{"name":"HAKURO","text":"(-Ferae Domitae Centurion-)Invoke my lord's name again at your peril. We will suffer no falsehoods!"},{"name":"ALPHINAUD","text":"I speak only the truth! Put up your weapons, I beg of you! Let us speak as friends and not shed blood in vain!"},{"name":"HAKURO","text":"(-Ferae Domitae Centurion-)If your claims were true, we would gladly sheathe our blades and embrace as brothers."},{"name":"HAKURO","text":"(-Ferae Domitae Centurion-)But since they must surely be false, we would be traitors to accept! Our lives and those of our loved ones, forfeit!"},{"name":"HAKURO","text":"(-Ferae Domitae Centurion-)Words are air! You will prove the truth of your tale on the battlefield, or die in dishonor!"},{"name":"HAKURO","text":"(-Ferae Domitae Centurion-)You are no strangers to battle, that much is plain..."},{"name":"HAKURO","text":"I am the White. I am Hakuro! And I will be your opponent! Have at you!"},{"name":"HAKURO","text":"You fought with honor and restraint. You could have killed my men, and perhaps even me...but you did not. For this, I thank you."},{"name":"HAKURO","text":"Warriors brave and true. I pray you tell us of the battle for Doma's liberation."},{"name":"ALPHINAUD","text":"We should be glad to do so..."},{"name":"HAKURO","text":"...Lord Hien, returned! Such joy this news brings us."},{"name":"HAKURO","text":"But for Lord Gosetsu to perish in the keep's collapse...to be taken from us by such treachery... There is no justice..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Eyes forward, Hakuro. He wished for no better death."},{"name":"A1","text":"..."},{"name":"HAKURO","text":"You knew him well. Aye, he would not suffer us to mourn with so much undone. And so we will not. Duty comes before all."},{"name":"HAKURO","text":"But I knew the man, and he would not suffer us to mourn on the eve of this great battle. Duty comes before all."},{"name":"HAKURO","text":"All Lupin shall know of Doma's liberation, and of your part in it."},{"name":"HAKURO","text":"When you breach the gates, we shall turn on the imperials as one. With fang and claw shall we rip open the throats of our masters. This the White swears."},{"name":"ALPHINAUD","text":"Thank you. When our war is ended, I am certain that your lord will help us to return you all to Doma."},{"name":"HAKURO","text":"Such a curious thing, destiny, to see us meet with friends of Lord Hien in this distant corner of the world. But we shall not keep you─your day is not yet done."},{"name":"ALPHINAUD","text":"Come, let us not keep our comrades waiting. We have a nation to liberate!"},{"name":"PIPIN","text":"Impeccable timing, those Domans! Come, comrades! The enemy's gate is down! <span class=\"emphasis\">Forward</span>!"},{"name":"ALPHINAUD","text":"You do not think he would actually wait until the last... No, no. Of course not. He's no Vidofnir."},{"name":"AYMERIC","text":"By the Fury... Did that man just bring down flying armor with a single stroke <span class=\"emphasis\">in midair</span>?"},{"name":"LUCIA","text":"The vice marshal's strategy for breaching the gates was most ingenious. A pity he did not account for the magitek armor─but to be fair, they did not account for the Domans either."},{"name":"RAUBAHN","text":"If you find Zenos, you kill him. No hesitation. Others may be taken prisoner, but not him. Not under any circumstances."},{"name":"WOLFMAN","text":"If you die this day, then we shall know you for liars!"},{"name":"ALPHINAUD","text":"Truly...? Must we fight to prove that we need not fight!?"},{"name":"HAKURO","text":"Until I am satisfied, we shall fight on! Give me your all!"},{"name":"ALPHINAUD","text":"On your guard! His strength far exceeds that of his brethren!"},{"name":"HAKURO","text":"Hah! You have faced a samurai of Doma before!<br>But I may yet surprise you..."},{"name":"HAKURO","text":"Is that all you can muster, Eorzeans!? Hold naught back!"},{"name":"ALPHINAUD","text":"Such ferocity...! If he does not relent, we shall be forced to kill him!"},{"name":"HAKURO","text":"Enough. You are every bit the warriors you claim to be."},{"name":"ALPHINAUD","text":"Confound it..."},{"name":"ALPHINAUD","text":"...So be it. Moonstone Carbuncle! Come!"},{"name":"ALPHINAUD","text":"Stand within the Carbuncle's wards!<br>They will grant you strength!"}],"reward":{"gil":2101,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68087]},"next":[68089]},"partials":[{"type":"npc","id":"1021698","obj":{"i":1021698,"n":"Raubahn","l":2408,"q":3}},{"type":"npc","id":"1021724","obj":{"i":1021724,"n":"Pipin","l":2408,"q":2}},{"type":"npc","id":"1020598","obj":{"i":1020598,"n":"Lucia","l":2408,"q":2}},{"type":"npc","id":"1021719","obj":{"i":1021719,"n":"Alphinaud","l":2408,"q":2}},{"type":"npc","id":"1021720","obj":{"i":1021720,"n":"Urianger","l":2408,"q":3}},{"type":"npc","id":"1021721","obj":{"i":1021721,"n":"Alphinaud","l":2408,"q":1}},{"type":"npc","id":"1021722","obj":{"i":1021722,"n":"Pipin","l":2408,"q":1}},{"type":"npc","id":"1021723","obj":{"i":1021723,"n":"Alphinaud","l":2408,"q":2}},{"type":"npc","id":"1021725","obj":{"i":1021725,"n":"Aymeric","l":2408,"q":2}},{"type":"npc","id":"1022738","obj":{"i":1022738,"n":"Alphinaud","l":2408,"q":1}},{"type":"npc","id":"1022739","obj":{"i":1022739,"n":"Hakuro","l":2408,"q":1}},{"type":"npc","id":"1023838","obj":{"i":1023838,"n":"Raubahn","l":2408,"q":2}},{"type":"quest","id":"68087","obj":{"i":68087,"n":"The Legacy of Our Fathers","g":6,"l":"The Lochs","s":1110}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}}]}