{"quest":{"name":"Liberty or Death","location":"The Peaks","id":68082,"patch":4.0,"sort":1060,"icon":100664,"eventIcon":71201,"issuer":1020656,"target":1020660,"involved":[1020650,1020653,1020655,1020657,1020658,1020662,1022370,1022371],"genre":6,"journal":["Raubahn would share with you a story.","Lyse, having but recently assumed leadership of the Ala Mhigan Resistance, continues to struggle with the weight of her new responsibilities. Seeing this, Raubahn invites the two of you to accompany him to Coldhearth, a poor village of little consequence, which he reveals to be his childhood home. There he tells you of his life before the imperial occupation, when a soldier sent away from the front to mend first heard the words of a revolutionary firebrand...<br><br>Adrift in a memory of decades past, you observe Lyse's father deliver a speech to a crowd of cheering Ala Mhigans─among them, Raubahn Aldynn and Ilberd Feare, then dear friends. Afterwards, the revolutionary meets with Raubahn and counsels him to remember that freedom should not be an end in of itself, for it is but a chance to build something better...and the work is never finished.<br><br>\"Liberty or Death,“ Raubahn repeats; the creed of Curtis Hext and his comrades. Solemnly, he asks Lyse if she will swear by these words, and she does so─though she is quick to add that the liberty she craves must be for every son and daughter of Ala Mhigo, even those who reject the cause. The nation they build must serve as a home for them all, she insists, and Raubahn can only agree.","The Flame General explains that he could see Lyse wasn't herself, and that he brought her to Coldhearth to remind her why she chose the path she now walks. Satisfied that she has found her resolve once more, he grants you leave to return without him, for he would remain awhile longer...","Lyse knows well the feeling of returning home after a long absence, and is more than willing to leave General Aldynn alone with his thoughts. Together you depart Coldhearth and journey north.","Lyse pulls you aside for a moment, sensing that you are being watched. She suggests that you split up and each head towards Radiata, while keeping your eyes peeled for suspicious characters.","The gang of Ala Mhigan youths observing you and Lyse from a distance panic at your approach, snatching up weapons and charging, apparently intent on killing or subduing you. It is the last mistake they will ever make.","You find Lyse standing over the corpses of several young men not unlike the ones you were forced to kill. With a start, she recognizes them from Radiata, and concludes that they must have marked you as insurgents when you were searching for Stark Woad. Fearing for Alphinaud and Alisaie's safety, she sprints off towards the nearby settlement as fast as her legs will carry her.","In Radiata, M'naago assures you that the twins are in no danger, and Alphinaud soon arrives with Stark Woad, putting your fears conclusively to rest. The Alliance agent explains that many youths who have only ever known the occupation are unwilling to place their faith in the Resistance, and would sooner attempt to curry favor with the imperials by capturing or killing enemies of the Empire. Alas, until you march on Ala Mhigo and defeat Zenos once and for all, such desperate individuals will remain a threat to you and yours."],"objectives":["Speak with Raubahn.","Speak with Lyse.","Follow Lyse.","Look out for suspicious individuals on the way to Radiata.","Rendezvous with Lyse.","Speak with M'naago."],"dialogue":[{"name":"RAUBAHN","text":"<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span></span>, Lyse─I brought you both here for a reason..."},{"name":"LYSE","text":"I don't think I know this village. It's so small..."},{"name":"SERPENTOFFICER","text":"I am told one of your comrades was injured during the operation. If there is aught we can do to help, pray do not hesitate to ask."},{"name":"LYSE","text":"\"Liberty or death.“ Has it really been twenty years since he wrote those words...?"},{"name":"RAUBAHN","text":"Even a blind man could see that Lyse wasn't herself. Not that I don't understand."},{"name":"RAUBAHN","text":"To be thrust into a position of authority under such circumstances─to be made responsible for the lives of so many... It isn't easy. And when you see your friend get cut down before your eyes, it only gets harder. I'll wager she thought Alisaie was dead for a moment back there."},{"name":"RAUBAHN","text":"'Tis one thing to risk your life for a cause. But to risk that of another is a burden no soldier is ever truly ready to shoulder."},{"name":"RAUBAHN","text":"The fear, the guilt─it weighs on her. And that's good. It will make her a better commander."},{"name":"RAUBAHN","text":"But first she needs to learn to carry it. To not let it break her. To remember that some causes are worth fighting for."},{"name":"RAUBAHN","text":"\"Liberty or death.“ Her father's words gave me strength once. Mayhap they'll do the same for her now."},{"name":"RAUBAHN","text":"Right, then. I think I've said enough. The two of you can head back. I mean to stay a bit longer..."},{"name":"RAUBAHN","text":"...Twenty godsforsaken years. &lt;sigh&gt; It didn't have to be like this. We could have walked this road together..."},{"name":"LYSE","text":"...I understand. He's been away for a long time, and he probably wants to be alone for a while."},{"name":"LYSE","text":"Let's head back to Radiata."},{"name":"LYSE","text":"Wait... Am I the only one who feels like I'm being watched?"},{"name":"LYSE","text":"I don't know if it's imperials or bandits, but I know there's more than one of them."},{"name":"LYSE","text":"Let's split up. You head northwest, and I'll head northeast. Maybe I'm wrong, but I don't think so..."},{"name":"HIGHLANDER","text":"Seven hells, <span class=\"alternative-container\"><span class=\"alternative\">she's</span><span class=\"alternative\">he's</span></span> seen us! Sod it─dead's as good as alive to the imperials!"},{"name":"POP","text":"You sense a desperate presence!"},{"name":"LYSE","text":"They attacked you too, didn't they? I...I had no choice..."},{"name":"LYSE","text":"They're Ala Mhigan─not even conscripts, by the look of them. Barely adults. In fact, some of their faces look familiar..."},{"name":"LYSE","text":"Wait, I remember. They're from Radiata! They must have seen us when we were looking for Stark!"},{"name":"LYSE","text":"They probably thought the imperials would reward them if they captured or killed─"},{"name":"LYSE","text":"Oh gods... Alisaie and Alphinaud could be in danger too! We have to get back to Radiata and find Naago!"},{"name":"MNAAGO","text":"What's all this about? You two look ready for a fight."},{"name":"LYSE","text":"We were ambushed by villagers outside of Radiata, and thought they might try to attack you too. Are you all right?"},{"name":"MNAAGO","text":"Aye, we're fine. The twins are at Stark's. Alisaie was asleep, last I checked."},{"name":"MNAAGO","text":"I'm sorry, did you say you were ambushed by <span class=\"emphasis\">villagers</span>? Not soldiers? Did they not see what we just did to Castrum Abania? Godsdamned fools!"},{"name":"STARKWOAD","text":"Lyse, <span class=\"highlight\">Forename</span>. We overheard you talking..."},{"name":"STARKWOAD","text":"The ones that attacked you. They were young? Less than twenty summers?"},{"name":"STARKWOAD","text":"Aye, I thought so. It's always the young ones─the ones who have only ever known the occupation. They're the ones you've got to look out for."},{"name":"STARKWOAD","text":"See, the only decent work to be found in Radiata is for the imperials, and everyone knows it. Children grow up knowing it. They have it pounded into their skulls that the best they can hope for is to serve an imperial officer."},{"name":"MNAAGO","text":"Bloody fools! After everything they've seen us accomplish! They ought to be begging to fight for the Resistance, not against us!"},{"name":"STARKWOAD","text":"They've been living in the shadow of a castrum their whole lives. A few victories won't change that. Aye, you get some who can't wait to spit in a soldier's eye, but they get beaten for their trouble, or worse..."},{"name":"MNAAGO","text":"Even so..."},{"name":"STARKWOAD","text":"...And the ones that don't fight back but refuse to beg, well, they just starve. Beat the dog that bites his master's hand, and ignore the dog that refuses to do his bidding, see?"},{"name":"STARKWOAD","text":"In the end, the ones that learn to abide are the ones that survive."},{"name":"STARKWOAD","text":"Now, you may say that's all about to change, and I believe you. Many here do."},{"name":"STARKWOAD","text":"But a young man or woman who grew up only knowing what he knows has got every reason to doubt. Remember that. Do what you have to, if it comes to it, but remember that."},{"name":"ALPHINAUD","text":"The sooner we liberate Ala Mhigo and bring an end to the occupation, the better. Only then can we show these youths that things do not have to be this way."},{"name":"LYSE","text":"...Only then will they know what it means to live free."},{"name":"LYSE","text":"We're going to build a new home for ourselves. Together. A better home than they've ever known."}],"reward":{"gil":1034,"aetherCurrent":1,"items":[{"id":18677,"one":1,"hq":1},{"id":18683,"one":1,"hq":1},{"id":18689,"one":1,"hq":1},{"id":18701,"one":1,"hq":1},{"num":3,"id":5633,"one":1}],"xp":240300},"reqs":{"jobs":[{"lvl":69,"id":142}],"quests":[68081]},"next":[68083,68402,68403]},"partials":[{"type":"npc","id":"1020656","obj":{"i":1020656,"n":"Raubahn","l":2407,"q":2}},{"type":"npc","id":"1020660","obj":{"i":1020660,"n":"M'naago","l":2407,"q":2}},{"type":"npc","id":"1020650","obj":{"i":1020650,"n":"Serpent Officer","l":2407,"q":4}},{"type":"npc","id":"1020653","obj":{"i":1020653,"n":"Lyse","l":2407,"q":1}},{"type":"npc","id":"1020655","obj":{"i":1020655,"n":"Lyse","l":2407,"q":2}},{"type":"npc","id":"1020657","obj":{"i":1020657,"n":"Suspicious Youth","l":2407,"q":1}},{"type":"npc","id":"1020658","obj":{"i":1020658,"n":"Lyse","l":2407,"q":1}},{"type":"npc","id":"1020662","obj":{"i":1020662,"n":"Raubahn","l":2407,"q":1}},{"type":"npc","id":"1022370","obj":{"i":1022370,"n":"Raubahn","l":2407,"q":1}},{"type":"npc","id":"1022371","obj":{"i":1022371,"n":"Lyse","l":2407,"q":1}},{"type":"item","id":"18677","obj":{"i":18677,"n":"Molybdenum Greaves of Fending","l":285,"c":47125,"t":38,"p":21760}},{"type":"item","id":"18683","obj":{"i":18683,"n":"Gazelleskin Open-toed Boots of Maiming","l":285,"c":46778,"t":38,"p":21760}},{"type":"item","id":"18689","obj":{"i":18689,"n":"Gazelleskin Open-toed Boots of Striking","l":285,"c":46779,"t":38,"p":21760}},{"type":"item","id":"18701","obj":{"i":18701,"n":"Gazelleskin Open-toed Boots of Scouting","l":285,"c":46780,"t":38,"p":21760}},{"type":"item","id":"5633","obj":{"i":5633,"n":"Piety Materia V","l":160,"c":20256,"t":58,"materia":{"tier":4,"value":6,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"68081","obj":{"i":68081,"n":"Raubahn's Invitation","g":6,"l":"The Peaks","s":1050}},{"type":"quest","id":"68083","obj":{"i":68083,"n":"The Lady in Red","g":6,"l":"The Peaks","s":1070}},{"type":"quest","id":"68402","obj":{"i":68402,"n":"A Friend on the Other Side","g":105,"l":"The Peaks","s":9100}},{"type":"quest","id":"68403","obj":{"i":68403,"n":"Climbing for Atonement","g":105,"l":"The Peaks","s":9110}}]}