{"quest":{"name":"Stormblood","location":"The Lochs","id":68089,"patch":4.0,"sort":1130,"icon":100667,"eventIcon":71201,"issuer":1021724,"target":1021728,"involved":[1020356,1020598,1021698,1021704,1021706,1021708,1021720,1021723,1021725,1021726,1021727,1022724,1022725,1022726,1022727,1022729,1023616,1023838],"genre":6,"journal":["At long last, the end is in sight.","After convincing the Ferae Domitae to withdraw, you and Alphinaud rejoin the main host outside the gates, and the assault begins in earnest. All proceeds as planned until a unit of airborne magitek armor launches a counterattack, throwing the Allied forces into chaos... Moments later, however, your Far Eastern allies, led by Lord Hien, swoop in to the rescue, engage the imperial flying machines, and leave the Alliance free to resume their attack. The gate buckles under the renewed assault, and soon gives way.<br><br>Now begins the battle for the future of a nation. Together with the brave men and women of the Eorzean Alliance and the Resistance, you and your fellow adventurers must enter the city and make for the castle where Zenos yae Galvus resides, and put an end to his reign of terror.<br><br>※Ala Mhigo can be accessed via the Duty Finder.","Twice before, you faced Zenos yae Galvus, and twice before he beat you. But the third time proves different. The viceroy falters and withdraws, and subsequently erupts into maniacal laughter. At long last, you are become the beast he has longed to face, and so he bids you join him at the top of the Royal Palace, where the gods may bear witness to your dance.","In the Royal Menagerie, you are greeted by a terrible sight: Shinryu, Ilberd's draconic god of vengeance, at the mercy of the viceroy. Zenos fawns over the primal, which he proclaims a being of pure violence, and muses upon how instrumental you were in its creation and capture. You regard him silently as he proceeds to mock his great-grandfather's legacy, while hinting at his own dark ambitions, biding your time to strike. At last, he declares that all he has done, he did but for the joy of doing it, and that only man has the wisdom and the clarity to embrace violence for its own sake...as you have.<br><br>His manifesto thus delivered, Zenos frees Shinryu from its restraints and cries out defiantly as it bathes you both in dragon fire. Unscathed, your foe rises into the air and uses his power as a Resonant to merge with the primal, binding it to his will. As he towers over you, transformed, he glimpses Ilberd's final moments, and declares this to be “an ending to mark a new beginning,” before taking to the air. Nor is he mistaken. For if you and your comrades─those stalwart yet humble adventurers who have stood by you from first to last─do not stop Zenos yae Galvus...no one will.<br><br>※The Royal Menagerie can be accessed via the Duty Finder.","One day the world may be consumed by fire and blood, and all that you hold dear be forever lost. But not this day. Zenos yae Galvus, legatus of the XIIth Legion, imperial viceroy of Ala Mhigo, has fallen.","Alphinaud and Lyse join you in the Royal Menagerie as Zenos, returned to his former form, struggles to his feet, coughing blood. To their astonishment, he is filled with a joy he has never known, for he has experienced a moment unlike any other: clear and pure and real. He brings the blade to his neck and smiles the smile of a man at peace, and before Lyse can intervene, the deed is done. Zenos yae Galvus is dead.<br><br>Soon after, Raubahn, Hien, and others arrive, expecting a fight and are relieved to find there is none. Though Lyse is initially reluctant to celebrate, Hien urges her to raise a cheer for all those who fought for freedom. And so you, together with your many comrades and the leaders of the Eorzean Alliance and the Resistance, gather at the castle's ramparts, and as the horns spread word of the viceroy's death, the people of Ala Mhigo raise their voices in song...","Lyse is unsure how to feel in the wake of Ala Mhigo's liberation. However, she knows that she does not want to keep you all to herself, and so she urges you to seek out your comrades, as they doubtless have much they wish to say.","None can predict what the future holds now that Zenos is dead and Ala Mhigo and Doma are free. But your comrades are hopeful of a better tomorrow, and are prepared to do their utmost to ensure it comes to pass.","Lyse remains where you left her, still quiet and thoughtful. Upon hearing you have made your rounds, she asks you to return with her to Rhalgr's Reach, along with the other Scions of the Seventh Dawn. Clearly, something weighs on her mind, but what?","In Rhalgr's Reach, before your gathered comrades, Lyse declares her intention to formally leave the Scions of the Seventh Dawn. The work to rebuild Ala Mhigo has only just begun, and she believes she cannot serve her homeland and the order both. Yet even if this marks the end of her tenure, you are still comrades, now and ever after─and Y'shtola is not about to let her forget it. Overcome with emotion, Lyse's eyes begin to water, and you come together to embrace as Scions one final time..."],"objectives":["Enter Ala Mhigo.","Confront Shinryu in the Royal Menagerie.","Speak with Lyse.","Speak with Alphinaud.","Speak with M'naago.","Speak with Raubahn.","Speak with Yugiri.","Speak with Lyse.","Speak with Lyse in Rhalgr's Reach."],"dialogue":[{"name":"ALPHINAUD","text":"You do not think he would actually wait until the last... No, no. Of course not. He's no Vidofnir."},{"name":"AYMERIC","text":"By the Fury... Did that man just bring down flying armor with a single stroke <span class=\"emphasis\">in midair</span>?"},{"name":"LUCIA","text":"The vice marshal's strategy for breaching the gates was most ingenious. A pity he did not account for the magitek armor─but to be fair, they did not account for the Domans either."},{"name":"RAUBAHN","text":"If you find Zenos, you kill him. No hesitation. Others may be taken prisoner, but not him. Not under any circumstances."},{"name":"PIPIN","text":"The battle for Ala Mhigo is at hand! All forces have been ordered to advance into the city proper!"},{"name":"PIPIN","text":"I trust your unit of elite adventurers is ready, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span></span>? Excellent! Your objective is to make haste for the castle and kill Zenos yae Galvus! Any questions? Of course not! Now, go and get the bastard!"},{"name":"ALPHINAUD","text":"Lead the way, <span class=\"highlight\">Forename</span>! I will be right behind you. Together, we will make Zenos pay for everything he has done!"},{"name":"AYMERIC","text":"The battle is joined! Give the order to advance!"},{"name":"LUCIA","text":"Yes, Lord Commander!"},{"name":"FLAMERECRUIT","text":"What in the seven hells are you doing down here!? Bah─no matter! Come with me! You're needed at the Royal Menagerie!"},{"name":"EVENTAREA","text":"Proceed to the Royal Menagerie?"},{"name":"VARIS","text":"...It's over."},{"name":"ELIDIBUS","text":"(-???-)My condolences for your loss. A father should not outlive his son."},{"name":"VARIS","text":"...What nonsense."},{"name":"ELIDIBUS","text":"You do not mourn his loss? ...You surprise me, Your Radiance. He was your son and heir...and an irreplaceable test subject."},{"name":"VARIS","text":"I know what he was. Monsters are not made for thrones."},{"name":"VARIS","text":"Nor are stars made to sustain false gods who sup on their very essence. Eikons summoned by desperate savages who hearken to the whispers of shadowless charlatans."},{"name":"ELIDIBUS","text":"Should you raise a hand against my black-robed brethren, I will not stop you. Our desires are one and the same. Preservation. Restoration."},{"name":"VARIS","text":"Compression. Resurrection. All is in service to your “one true god.” And when the sundered shards are made whole, will there be a place for us mere mortals?"},{"name":"ELIDIBUS","text":"Doubt my claims and question my motives if you will, Your Radiance. You will come to trust me in time. Until then, mayhap you will find this...reassuring."},{"name":"VARIS","text":"How...how dare you..."},{"name":"LYSE","text":"We did it. We liberated Ala Mhigo. I don't know what to say... I don't even know how to feel about it all..."},{"name":"LYSE","text":"Relief, I suppose. Pride...and hope, too. We did it, Father. Yda. Papalymo. Conrad, Meffrid... Minfilia... We really did it..."},{"name":"LYSE","text":"Hey, don't feel like you have to stand here listening to me mumble. Everyone else will want to talk to you."},{"name":"LYSE","text":"You beat him, after all. You're the real hero of this story. So run along and take your plaudits!"},{"name":"LYSE","text":"Go and talk to the others! I'm not going anywhere."},{"name":"ARENVALD","text":"A'aba, Aulie... I wish you were here to see it..."},{"name":"JMOLDVA","text":"I did not know how or when, but I knew in my heart that I would return here one day. Here's to the ones that didn't."},{"name":"VMAHTIA","text":"I know it's different for him and the other Ala Mhigans. For us, it's a great victory, but for them, it's a homecoming."},{"name":"WISCAR","text":"We did it! <span class=\"emphasis\">We bloody well did it</span>! I have to send word to Ala Gannha─ No! I have to go and tell them myself!"},{"name":"HAKURO","text":"When I awoke this morning, I thought Lord Hien dead. And then he lived. And now he is here. It has been a wonderful day."},{"name":"THANCRED","text":"Minfilia...no. Ascilia, Warburton─it will never be enough, I know, but I hope...I hope this makes up for it, if only a little. I hope this brings you both joy. You deserve it, and so much more..."},{"name":"URIANGER","text":"Our convalescing comrades have been informed of our victory. Thou mayest be assured that there was much rejoicing."},{"name":"HIEN","text":"It feels like only yesterday that we were celebrating the liberation of Doma, and now look where we are! A thousand malms apart our nations may be, but in spirit we are one and the same."},{"name":"RAUBAHN","text":"The hero of the hour! I suppose we'll have to add “liberator” to your titles."},{"name":"RAUBAHN","text":"With their commander fallen, the remainder of the XIIth chose to surrender to our forces. After twenty long years, it's official: the occupation is ended."},{"name":"RAUBAHN","text":"But now the hard work starts. Though the people have had their fill of kings, there is no clear consensus on what sort of government they would prefer instead."},{"name":"PIPIN","text":"Indeed, Father. Momentous as this achievement may be, the road which lies before us is no less uncertain than the one we have walked."},{"name":"RAUBAHN","text":"Aye, aye. Yet if we can overcome two decades of oppression, I've no doubt we can find a way forward. Thank you, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span></span>, for helping to make this dream a reality."},{"name":"RAUBAHN","text":"I expect many of the Ala Mhigan refugees in Ul'dah will have to decide whether or not to return home...or to remain in their new one."},{"name":"ALPHINAUD","text":"After all we have been through, I really should know better than to worry, but─as ever─the relief I felt upon finding you hale and whole in the Royal Menagerie well-nigh reduced me to tears..."},{"name":"ALPHINAUD","text":"\"The Warrior of Light,“ victorious again... Hm. I should be surprised if some small part of you had not come to resent the title and the responsibilities which accompany it. You must forgive us if we call you ”hero“ when you accomplish heroic feats..."},{"name":"ALPHINAUD","text":"But as the Warrior of Light goes, so goes the world. You should take pride in the good you have done, and in the good you have inspired others to do."},{"name":"THANCRED","text":"You are a natural-born leader of men, <span class=\"highlight\">Forename</span>. All these people weren't just following their commanders─they were following you."},{"name":"ALPHINAUD","text":"And you led them to victory. To freedom! ...Alas, not everyone could see the journey through to its end. But history shall remember them, and the glorious future they made possible."},{"name":"ALPHINAUD","text":"Alisaie will surely regret that she was unable to join us for this battle. I, meanwhile, will not."},{"name":"MNAAGO","text":"Can you believe it? We won! We beat the bastards!<br>Ala Mhigo! Ala Mhigo!"},{"name":"MNAAGO","text":"Heh heh... Sorry, got a bit carried away there, didn't I? It's hard not to, you know?"},{"name":"MNAAGO","text":"We owe it to the friends we buried to shout and scream and cheer with all our hearts. I want them to know it wasn't for nothing─that it's finally over, and they can rest in peace."},{"name":"MNAAGO","text":"You...you hear that lads? &lt;sniffle&gt; We'll be all right! We'll...we'll be... &lt;sniffle&gt; Oh bugger, not again..."},{"name":"MNAAGO","text":"I'm so...I'm so bleedin' happy, I could cry! &lt;sniffle&gt;"},{"name":"MNAAGO","text":"Sorry, sorry. &lt;sniffle&gt; Must be something in my eye. &lt;sniffle&gt; Or both eyes. Seven hells..."},{"name":"YUGIRI","text":"For you to best Zenos, even after he had harnessed the power of a primal, is a testament to your ever-growing strength."},{"name":"HIEN","text":"Not bitter to have had your vengeance stolen from you by another?"},{"name":"YUGIRI","text":"There is some small regret, perhaps, but that is outweighed by the satisfaction I find in his death. I commend you, <span class=\"highlight\">Forename</span>."},{"name":"HIEN","text":"As should we all. Zenos was a monster and a tyrant─the man who killed my father and countless other of my countrymen. The world is a better place without him in it."},{"name":"HIEN","text":"I should also praise Master Alphinaud for his foresight and restraint. Had he not intervened, I might never have had the pleasure of being reunited with Hakuro and his Lupin brothers!"},{"name":"HAKURO","text":"'Twas a timely intervention, aye. Full glad am I not to have been burdened with the guilt of killing my lord Hien's most trusted allies."},{"name":"YUGIRI","text":"Hah! Indeed, my friend. Indeed."},{"name":"YUGIRI","text":"Lord Hien must needs return to Doma with all due haste, but I have yet to decide if I will accompany him. I should like to visit my people in Revenant's Toll, for one..."},{"name":"LYSE","text":"Finished your rounds? Great. In that case, I'd like you to come with me. Back to Rhalgr's Reach."},{"name":"LYSE","text":"Not for a rematch or anything, sadly. I want to call all the Scions together. I'll explain later."},{"name":"LYSE","text":"I...I don't even know where to begin..."},{"name":"CID","text":"...Hm. This is indeed the work of either Shinryu or Omega."},{"name":"CID","text":"...And since there is undeniably <span class=\"emphasis\">something</span> down there radiating a massive amount of energy...which cannot very well be the late viceroy's lapdragon... Yes, I think we have our suspect."},{"name":"CID","text":"Well. This is a mess of our own making, so it falls to us to clean it up. It won't be easy...but is it ever?"},{"name":"JESSIE","text":"And now comes the part where you say you've got no choice but to divert company resources and employees to this pet project of yours. Lost profits and belligerent clients be damned."},{"name":"CID","text":"I...er... Financial considerations notwithstanding, you have to admit there is an unquantifiable benefit in giving our people the opportunity to study such advanced technology─"},{"name":"JESSIE","text":"Oh? Is that before or after you blow it up or seal it away? Fine, fine─but the moment I judge this little venture an unsustainable risk to the Ironworks, I'm ending it, savvy?"},{"name":"JESSIE","text":"And to keep you honest, using my authority as deputy president, I've gone ahead and brought in a <span class=\"emphasis\">consultant</span>─a master engineer and mechanical genius!"},{"name":"CID","text":"...You didn't."},{"name":"NERO","text":"(-???-)Come now, you mustn't build their expectations too high! It will be less dramatic when I surpass them."},{"name":"CID","text":"Oh. Oh no. Absolutely not. This is not happening."},{"name":"NERO","text":"Nero tol Scaeva, eager to begin his first day as a loyal member of the Ironworks team! Looking forward to working with you, Garlond!"}],"reward":{"gil":7500,"aetherCurrent":1,"xp":0,"instance":20045},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68088]},"next":[67090,68169,68170,68421,68422,68423,68424,68425,68464,68476,68479,68498,68539,68544,68613,68614,68678,68713]},"partials":[{"type":"npc","id":"1021724","obj":{"i":1021724,"n":"Pipin","l":2408,"q":2}},{"type":"npc","id":"1021728","obj":{"i":1021728,"n":"Lyse","l":2403,"q":1}},{"type":"npc","id":"1020356","obj":{"i":1020356,"n":"Lyse","l":2408,"q":1}},{"type":"npc","id":"1020598","obj":{"i":1020598,"n":"Lucia","l":2408,"q":2}},{"type":"npc","id":"1021698","obj":{"i":1021698,"n":"Raubahn","l":2408,"q":3}},{"type":"npc","id":"1021704","obj":{"i":1021704,"n":"Alphinaud","l":2408,"q":3}},{"type":"npc","id":"1021706","obj":{"i":1021706,"n":"Arenvald","l":2408,"q":3}},{"type":"npc","id":"1021708","obj":{"i":1021708,"n":"Thancred","l":2408,"q":2}},{"type":"npc","id":"1021720","obj":{"i":1021720,"n":"Urianger","l":2408,"q":3}},{"type":"npc","id":"1021723","obj":{"i":1021723,"n":"Alphinaud","l":2408,"q":2}},{"type":"npc","id":"1021725","obj":{"i":1021725,"n":"Aymeric","l":2408,"q":2}},{"type":"npc","id":"1021726","obj":{"i":1021726,"n":"Yugiri","l":2408,"q":1}},{"type":"npc","id":"1021727","obj":{"i":1021727,"n":"Hien","l":2408,"q":1}},{"type":"npc","id":"1022724","obj":{"i":1022724,"n":"M'naago","l":2408,"q":3}},{"type":"npc","id":"1022725","obj":{"i":1022725,"n":"V'mah Tia","l":2408,"q":3}},{"type":"npc","id":"1022726","obj":{"i":1022726,"n":"J'moldva","l":2408,"q":3}},{"type":"npc","id":"1022727","obj":{"i":1022727,"n":"Hakuro","l":2408,"q":1}},{"type":"npc","id":"1022729","obj":{"i":1022729,"n":"Wiscar","l":2408,"q":2}},{"type":"npc","id":"1023616","obj":{"i":1023616,"n":"Flame Recruit","l":2408,"q":1}},{"type":"npc","id":"1023838","obj":{"i":1023838,"n":"Raubahn","l":2408,"q":2}},{"type":"instance","id":"56","obj":{"i":56,"n":"Ala Mhigo","c":61801,"t":"Dungeons","min_lvl":70,"max_lvl":70,"min_ilvl":280,"max_ilvl":310}},{"type":"instance","id":"20045","obj":{"i":20045,"n":"The Royal Menagerie","c":61804,"t":"Trials","min_lvl":70,"max_lvl":70,"min_ilvl":280}},{"type":"quest","id":"68088","obj":{"i":68088,"n":"The Measure of His Reach","g":6,"l":"The Lochs","s":1120}},{"type":"quest","id":"67090","obj":{"i":67090,"n":"The New King on the Block","g":207,"l":"Kugane","s":120,"f":1}},{"type":"quest","id":"68169","obj":{"i":68169,"n":"To Kill a Coeurl","g":103,"l":"Rhalgr's Reach","s":10020,"f":1}},{"type":"quest","id":"68170","obj":{"i":68170,"n":"King of the Castle","g":107,"l":"Kugane","s":11010,"f":1}},{"type":"quest","id":"68421","obj":{"i":68421,"n":"Dreaming of Home","g":103,"l":"Rhalgr's Reach","s":10010}},{"type":"quest","id":"68422","obj":{"i":68422,"n":"For Wilred","g":93,"l":"Southern Thanalan","s":10010}},{"type":"quest","id":"68423","obj":{"i":68423,"n":"Journey's Beginning","g":93,"l":"Southern Thanalan","s":10020}},{"type":"quest","id":"68424","obj":{"i":68424,"n":"Journey's End","g":105,"l":"The Peaks","s":10030}},{"type":"quest","id":"68425","obj":{"i":68425,"n":"Those We Hold Dear","g":106,"l":"The Lochs","s":10040}},{"type":"quest","id":"68464","obj":{"i":68464,"n":"The Hunt for Omega","g":19,"l":"Rhalgr's Reach","s":1,"f":1}},{"type":"quest","id":"68476","obj":{"i":68476,"n":"Another Striking Opportunity","g":103,"l":"Rhalgr's Reach","s":10030,"f":1}},{"type":"quest","id":"68479","obj":{"i":68479,"n":"Songs in the Key of Kugane","g":0,"l":"Kugane","s":0,"f":1}},{"type":"quest","id":"68498","obj":{"i":68498,"n":"Arenvald's Adventure","g":7,"l":"Rhalgr's Reach","s":1}},{"type":"quest","id":"68539","obj":{"i":68539,"n":"Dramatis Personae","g":21,"l":"Kugane","s":10,"f":1}},{"type":"quest","id":"68544","obj":{"i":68544,"n":"A Hingan Tale: Nashu Goes East","g":70,"l":"Kugane","s":10,"f":1}},{"type":"quest","id":"68613","obj":{"i":68613,"n":"An Unwanted Truth","g":103,"l":"Rhalgr's Reach","s":10021,"f":1}},{"type":"quest","id":"68614","obj":{"i":68614,"n":"And We Shall Call It Eureka","g":75,"l":"Rhalgr's Reach","s":10,"f":1}},{"type":"quest","id":"68678","obj":{"i":68678,"n":"Secret of the Ooze","g":103,"l":"Rhalgr's Reach","s":10022,"f":1}},{"type":"quest","id":"68713","obj":{"i":68713,"n":"Between a Rock and the Hard Place","g":101,"l":"Idyllshire","s":5702,"f":1}}]}