{"quest":{"name":"The Resonant","location":"The Lochs","id":68086,"patch":4.0,"sort":1100,"icon":100666,"eventIcon":71201,"issuer":1021710,"target":1021717,"involved":[1021709,1021711,1021712,1021713,1021714,1021715,1021716,1021718,1022730,1022731,1022732,1022736,1022737],"genre":6,"journal":["Lyse is in the mood for a swim.","In order to gain entry to the Ala Mhigan Quarter and infiltrate the imperial research facility where Krile is being held, you and your comrades will need to find a way to circumvent the towering walls and heavy gates which surround it. Fortunately, Wiscar─a youth from Ala Gannha whom you inspired to join the Resistance─has surmised the existence of a tunnel connecting Loch Seld and a well within the district. The entrance to the well is secured by lock and key, but since you now have said key in your possession, you need only locate the tunnel.","Just as you and your comrades are about to dive into the loch, Urianger makes an unexpected appearance. The Archon duly explains that after listening to Alisaie's tale of her defeat at Fordola's hands, he was inspired to fashion a new and improved aetheric siphon, which he believes will enable you to deprive the Skulls commander of her preternatural prescience. Though Urianger seems unwilling to disclose the device's precise function, you receive it gratefully, conscious that you may have need of it during the coming mission.","Sure enough, in the depths of Loch Seld, you and your comrades locate a tunnel leading east towards the Ala Mhigan Quarter. For Thancred's sake, you pray the tunnel remains wide enough for you to pass through.","As predicted, the tunnel connects to a well within the walls of the residential district, sealed long ago by the King of Ruin and seemingly forgotten. Before continuing, you review your plan to let the Resistance in, and rescue Krile. Stealth is, of course, the preferred approach, but once the gates are open, it will be chaos in the streets...","The three of you pick your way through the Ala Mhigan Quarter and come at last to the great western gates. With a pull of a lever, the gates swing open, and the Resistance fighters, led by Alphinaud, pour through. As they engage the imperials, you and your fellow Scions head for the research facility where Krile is being held.","As expected, Fordola is waiting to greet you, along with a squadron of imperial soldiers. Thankfully, however, you have come prepared. Activating Urianger's device, you watch the Skulls commander reel about in confusion, and it soon becomes clear that she can no longer anticipate your attacks. Though she is yet a fearsome opponent, you are the Warrior of Light, and after a vicious battle, you are able to subdue her and secure the facility. To your relief, you find Krile alive, albeit weak from her ordeal, and together you make ready to leave, with Fordola as your prisoner. However, the beaten officer belittles your victory, speaking of the terrible powers Zenos commands and the futility of your sacrifices. For an instant, it seems as though Lyse will succumb to her anger and execute her defenseless foe, but in the end she relents, declaring that Fordola will live long enough to see a free Ala Mhigo.","Alphinaud is overjoyed. Krile is alive, and the Ala Mhigan District is in the hands of the Resistance. But what of Fordola's claims regarding Zenos's newfound powers? You can but hope that you will learn more before the hour of your inevitable confrontation."],"objectives":["Follow Lyse.","Speak with Lyse in Loch Seld.","Follow Lyse.","Speak with Lyse.","Speak with Alphinaud."],"dialogue":[{"name":"THANCRED","text":"The revolutionary spirit runs in the family, I see."},{"name":"WISCAR","text":"I'll make him proud. I'll make them all proud!"},{"name":"ALPHINAUD","text":"We should go. Arenvald and the others are waiting."},{"name":"WATT","text":"If I were ten years younger...but I'm not. Look after my grandson."},{"name":"LYSE","text":"We'll need to dive into the lochs and look for a tunnel leading beneath the residential district. That should be no problem for <span class=\"highlight\">Forename</span> and me, thanks to the Kojin's blessing, but for the rest of you..."},{"name":"THANCRED","text":"I will have you know that I can hold my breath for ten minutes!"},{"name":"ALPHINAUD","text":"...Hm. I think it best that I support M'naago and Arenvald's unit."},{"name":"LYSE","text":"Oh, right. You can't swim."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">I am aware of that</span>, thank you! But it is neither here nor there, given that I lack both the Kojin's blessing <span class=\"emphasis\">and</span> Thancred's preternatural lung capacity!"},{"name":"LYSE","text":"Right, right. Of course. I didn't mean anything by it. Nothing at all."},{"name":"LYSE","text":"So─<span class=\"highlight\">Forename</span>, Thancred, and me. Let's head to the water's edge. "},{"name":"LYSE","text":"Alphinaud and Wiscar can rejoin the others and wait outside the gates for us to let them in."},{"name":"THANCRED","text":"You would be surprised what skills an urchin can pick up in a city of pirates."},{"name":"THANCRED","text":"A knack for selling fine leather waistcoats being one..."},{"name":"LYSE","text":"This looks like as good a place as any..."},{"name":"URIANGER","text":"Ere you dive into the briny deep─"},{"name":"LYSE","text":"Urianger! What are you doing here?"},{"name":"URIANGER","text":"Master Alphinaud informed me of your plan, and thus did I hasten to your side."},{"name":"URIANGER","text":"When Mistress Alisaie unfolded to me the tale of her defeat, I was much intrigued by the apparent ease with which Fordola, a theretofore unexceptional warrior, defied my lady's every attempt to do her harm."},{"name":"URIANGER","text":"After some few days of deliberation, I subsequently contrived what I believe to be a solution to the problem of her preternatural prescience. 'Twas in hopes of furnishing you with the fruits of my labors that I came."},{"name":"LYSE","text":"Wait, isn't that Moenbryda's─"},{"name":"URIANGER","text":"Her aetheric siphon formed the basis for my design."},{"name":"URIANGER","text":"Should my hypothesis prove correct, you need but activate it in her presence. To say more would endanger the plan, for ignorance is your shield."},{"name":"URIANGER","text":"It was...Moenbryda's time. It is not yours, my friends.<br>May you ever walk in the light of the Crystal...and return."},{"name":"LYSE","text":"We will─for you and for her."},{"name":"LYSE","text":"Right! I'm going in. Follow me!"},{"name":"LYSE","text":"The tunnel leads east. Thancred's already gone ahead.<br>Let's not keep him waiting!"},{"name":"THANCRED","text":"That tunnel was much longer than anticipated. I would rather not make the trip again, if it's all the same to you."},{"name":"LYSE","text":"Whew! That was fun!"},{"name":"THANCRED","text":"Yes, yes. Tremendous fun. Who needs a beastman's blessing anyway?"},{"name":"LYSE","text":"I still can't believe you managed to hold your breath the entire time. It felt like we were down there for hours!"},{"name":"LYSE","text":"Anyway, it's time we let our friends in."},{"name":"LYSE","text":"Once we head up these stairs, we'll need to make our way to the main gates, which are...somewhere to the west of here?"},{"name":"THANCRED","text":"Forgive me for stating the obvious, but it bears repeating that until we open the gates, we three are on our own. 'Twould be in our best interest to avoid guards and easily startled smallfolk."},{"name":"LYSE","text":"Obviously. But once our guests have arrived, we'll be free to head towards the research facility where Krile's being held as loudly as we like."},{"name":"LYSE","text":"Since you've been here before, will you lead the way?"},{"name":"THANCRED","text":"Of course. But I will move quickly, so see that you do not fall behind."},{"name":"LYSE","text":"Nothing left to say, then. Let's get to it!"},{"name":"LYSE","text":"All set, <span class=\"highlight\">Forename</span>?"},{"name":"THANCRED","text":"Saved once more by Urianger's ingenuity. I look forward to learning why it was so imperative that we remain ignorant of the device's precise function."},{"name":"KRILE","text":"They used medicines to keep me in a torpor for much of the time. I...fear I am still recovering from their effects. But I will be fine. I will."},{"name":"MNAAGO","text":"Can you believe it? Not only did we secure the residential district, but we captured Fordola! Wait till the Flame General hears about this!"},{"name":"WISCAR","text":"&lt;pant&gt; &lt;pant&gt; Looks like it wasn't my day to die. I owe you one, Meffrid..."},{"name":"ALPHINAUD","text":"What a relief to have finally found her! Though our greatest challenge yet lies ahead of us, on the eve of this final battle, I find myself overcome with joy..."},{"name":"ALPHINAUD","text":"We could not have saved her without everyone's help. Thancred, Lyse, Urianger─and of course, you."},{"name":"ALPHINAUD","text":"But yes, there is still much and more to be done. I should be very interested to learn the meaning of Fordola's ominous words, for one..."},{"name":"FORDOLA","text":"I reckoned you lot would come, but I didn't think you'd have the nerve to break the bloody doors down! Makes no difference to me, though─time to die!"},{"name":"SYSTEM","text":"Use the <span class=\"highlight\">Aetheric Siphon</span> to weaken Fordola, and defeat her in battle!"}],"reward":{"gil":1936,"items":[{"id":20568},{"id":18675,"one":1,"hq":1},{"id":18681,"one":1,"hq":1},{"id":18687,"one":1,"hq":1},{"id":18699,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":240300},"reqs":{"jobs":[{"lvl":69,"id":142}],"quests":[68085]},"next":[68087]},"partials":[{"type":"npc","id":"1021710","obj":{"i":1021710,"n":"Lyse","l":2408,"q":2}},{"type":"npc","id":"1021717","obj":{"i":1021717,"n":"Alphinaud","l":2408,"q":2}},{"type":"npc","id":"1021709","obj":{"i":1021709,"n":"Alphinaud","l":2408,"q":2}},{"type":"npc","id":"1021711","obj":{"i":1021711,"n":"Thancred","l":2408,"q":2}},{"type":"npc","id":"1021712","obj":{"i":1021712,"n":"Lyse","l":2408,"q":1}},{"type":"npc","id":"1021713","obj":{"i":1021713,"n":"Thancred","l":2408,"q":1}},{"type":"npc","id":"1021714","obj":{"i":1021714,"n":"Lyse","l":2408,"q":1}},{"type":"npc","id":"1021715","obj":{"i":1021715,"n":"Thancred","l":2408,"q":1}},{"type":"npc","id":"1021716","obj":{"i":1021716,"n":"Lyse","l":2408,"q":1}},{"type":"npc","id":"1021718","obj":{"i":1021718,"n":"Krile","l":2408,"q":2}},{"type":"npc","id":"1022730","obj":{"i":1022730,"n":"Wiscar","l":2408,"q":2}},{"type":"npc","id":"1022731","obj":{"i":1022731,"n":"Watt","l":2408,"q":2}},{"type":"npc","id":"1022732","obj":{"i":1022732,"n":"Thancred","l":2408,"q":2}},{"type":"npc","id":"1022736","obj":{"i":1022736,"n":"M'naago","l":2408,"q":2}},{"type":"npc","id":"1022737","obj":{"i":1022737,"n":"Wiscar","l":2408,"q":2}},{"type":"item","id":"20568","obj":{"i":20568,"n":"Scion Rogue's Bandana","l":1,"c":41658,"t":34,"p":100}},{"type":"item","id":"18675","obj":{"i":18675,"n":"Gazelleskin Bracers of Fending","l":285,"c":48672,"t":37,"p":21760}},{"type":"item","id":"18681","obj":{"i":18681,"n":"Molybdenum Armguards of Maiming","l":285,"c":44592,"t":37,"p":21760}},{"type":"item","id":"18687","obj":{"i":18687,"n":"Molybdenum Armguards of Striking","l":285,"c":44593,"t":37,"p":21760}},{"type":"item","id":"18699","obj":{"i":18699,"n":"Molybdenum Armguards of Scouting","l":285,"c":44594,"t":37,"p":21760}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68085","obj":{"i":68085,"n":"The Key to Victory","g":6,"l":"The Lochs","s":1090}},{"type":"quest","id":"68087","obj":{"i":68087,"n":"The Legacy of Our Fathers","g":6,"l":"The Lochs","s":1110}}]}