{"quest":{"name":"Upon the Great Loch's Shore","location":"Rhalgr's Reach","id":68084,"patch":4.0,"sort":1080,"icon":100665,"eventIcon":71201,"issuer":1020665,"target":1021704,"involved":[1020412,1020419,1020649,1021705,1021706,1022724,1022725,1022726],"genre":6,"journal":["Lyse is feeling relaxed and refreshed.","After giving Alisaie into the care of the infirmary's chirurgeons and enjoying a spirited bout with Lyse in the palm of the Destroyer, the time has come for you and your comrades to return to the fight. Lyse asks that you and Alphinaud go on ahead, as she has various matters to discuss with her officers before she departs.","Alphinaud bids farewell to his sister, urging her not to rise from her bed until she is given express leave to do so. Then you set out together for Castrum Abania, where General Aldynn and Marshal Tarupin await.","The vice marshal informs you that Castrum Abania is now wholly under the control of the Eorzean Alliance. The imperials' supplies have been plundered and are being distributed as needed. Moreover, your allies have confirmed that a unit of Skulls passed through, escorting a single prisoner to the capital─Krile, almost certainly. With luck, it will not be long before you locate and rescue your captive comrade.","At Porta Praetoria, with the leaders of the Alliance and the Resistance in attendance, you discuss your plans for laying siege to Ala Mhigo and defeating the XIIth Legion once and for all. Time being of the essence, it is decided that as soon as the Resistance has secured the residential district to the south of the city, the main host will immediately launch an all-out assault. The Scions, meanwhile, will be held in reserve, ready to render aid where needed, and attend to Krile's rescue upon learning where she is being held.","Rhalgr's Beacon nears its end, and soon, Twelve willing, Ala Mhigo will be free. As the hour of judgment draws nigh, Alphinaud spares a moment to consider what his grandfather would have said were he with you today..."],"objectives":["Speak with Alphinaud.","Speak with Pipin at Castrum Abania.","Journey to the Lochs.","Speak with Alphinaud."],"dialogue":[{"name":"ALISAIE","text":"I should have been there with you to the end. If only I hadn't been so reckless..."},{"name":"LYSE","text":"Now that Alisaie's settled in, it's time we rejoined the fight."},{"name":"LYSE","text":"Though, actually...maybe you and Alphinaud should go on ahead without me. I need to talk strategy with the officers, and that might take a while..."},{"name":"LYSE","text":"This is the first time I've visited Rhalgr's Reach since taking over from Conrad, so we have a few things to discuss. Don't worry─I won't be far behind."},{"name":"ALPHINAUD","text":"Ah, there you are. What was it that Lyse wanted of you?"},{"name":"ALPHINAUD","text":"Ahahaha! A sparring match on the Destroyer's very palm? I would have liked to have seen that."},{"name":"ALPHINAUD","text":"But she is right─we have lingered here long enough. I am ready to depart when you are."},{"name":"ALISAIE","text":"Take care, you two. Don't do anything I wouldn't."},{"name":"ALPHINAUD","text":"And you had better not rise from that bed until you are given express permission to do so. Urianger will be paying you a visit soon, and he is already worried enough as it is."},{"name":"ALPHINAUD","text":"We have a long road ahead of us. Lead the way, <span class=\"highlight\">Forename</span>."},{"name":"ALISAIE","text":"Stay alive, <span class=\"highlight\">Forename</span>. I mean it."},{"name":"PIPIN","text":"You are returned! How fares your sister, Alphinaud?"},{"name":"ALPHINAUD","text":"Her rapier wit remains undulled─for better or for worse. Have there been any developments in our absence?"},{"name":"PIPIN","text":"I am proud to say that Castrum Abania is now wholly under our control. At present, we are taking stock of the enemy's supplies and redistributing them amongst our men."},{"name":"PIPIN","text":"Also, while sifting through the officers' documents, we learned that a unit of Skulls under Fordola's command passed through the castrum en route to the capital...with a single prisoner in their custody."},{"name":"ALPHINAUD","text":"Krile! It has to be her!"},{"name":"PIPIN","text":"In all likelihood, yes. You will be glad to hear that the tunnel leading to the Lochs has been secured by our soldiers and is now safe for travel."},{"name":"PIPIN","text":"And one final piece of good news: reinforcements from all four Alliance nations have arrived and joined the main host, which has established a new base of operations within the Lochs."},{"name":"PIPIN","text":"Commander Hext should be arriving soon, yes? When she does, we will call a meeting to discuss the final stage of Rhalgr's Beacon."},{"name":"LYSE","text":"Sorry for keeping you all waiting!"},{"name":"ALPHINAUD","text":"An Ala Mhigan folk dress? How very fitting. And well-fitting, I might add."},{"name":"LYSE","text":"I wanted to do something for Yda. And myself."},{"name":"ALPHINAUD","text":"This is it. The last push. We're coming, Krile..."},{"name":"LYSE","text":"Cotter built those walls to give shelter to his brothers and sisters. And now our people's freedom rests on us tearing them down..."},{"name":"MNAAGO","text":"Most of the Ala Mhigans in the residential district are Aan, so I doubt we'll have to deal with many imperial sympathizers."},{"name":"ARENVALD","text":"The battle for Castrum Abania was brutal, but the one for Ala Mhigo will be unlike any we have ever known..."},{"name":"VMAHTIA","text":"The end is in sight. It has been a long time coming..."},{"name":"JMOLDVA","text":"\"A storm of blood approaches fast... Hells open, Heavens weep...“"},{"name":"ALPHINAUD","text":"The stage is set, and the players are assembled. Eorzea has come at last to drive the invaders from her lands."},{"name":"ALPHINAUD","text":"What would Grandfather say if he were with us here today...?"}],"reward":{"gil":961,"items":[{"id":18673,"one":1,"hq":1},{"id":18679,"one":1,"hq":1},{"id":18685,"one":1,"hq":1},{"id":18697,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":240300},"reqs":{"jobs":[{"lvl":69,"id":142}],"quests":[68083]},"next":[68085,68413,68414,68415,68416]},"partials":[{"type":"npc","id":"1020665","obj":{"i":1020665,"n":"Lyse","l":2403,"q":2}},{"type":"npc","id":"1021704","obj":{"i":1021704,"n":"Alphinaud","l":2408,"q":3}},{"type":"npc","id":"1020412","obj":{"i":1020412,"n":"Alphinaud","l":2403,"q":5}},{"type":"npc","id":"1020419","obj":{"i":1020419,"n":"Alisaie","l":2403,"q":5}},{"type":"npc","id":"1020649","obj":{"i":1020649,"n":"Pipin","l":2407,"q":1}},{"type":"npc","id":"1021705","obj":{"i":1021705,"n":"Lyse","l":2408,"q":2}},{"type":"npc","id":"1021706","obj":{"i":1021706,"n":"Arenvald","l":2408,"q":3}},{"type":"npc","id":"1022724","obj":{"i":1022724,"n":"M'naago","l":2408,"q":3}},{"type":"npc","id":"1022725","obj":{"i":1022725,"n":"V'mah Tia","l":2408,"q":3}},{"type":"npc","id":"1022726","obj":{"i":1022726,"n":"J'moldva","l":2408,"q":3}},{"type":"item","id":"18673","obj":{"i":18673,"n":"Molybdenum Headgear of Fending","l":285,"c":40512,"t":34,"p":21760}},{"type":"item","id":"18679","obj":{"i":18679,"n":"Molybdenum Headgear of Maiming","l":285,"c":40771,"t":34,"p":21760}},{"type":"item","id":"18685","obj":{"i":18685,"n":"Twinsilk Hood of Striking","l":285,"c":40770,"t":34,"p":21760}},{"type":"item","id":"18697","obj":{"i":18697,"n":"Twinsilk Turban of Scouting","l":285,"c":40773,"t":34,"p":21760}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68083","obj":{"i":68083,"n":"The Lady in Red","g":6,"l":"The Peaks","s":1070}},{"type":"quest","id":"68085","obj":{"i":68085,"n":"The Key to Victory","g":6,"l":"The Lochs","s":1090}},{"type":"quest","id":"68413","obj":{"i":68413,"n":"It's a Zu Out There","g":106,"l":"The Lochs","s":9010,"f":1}},{"type":"quest","id":"68414","obj":{"i":68414,"n":"Send in the Armor","g":106,"l":"The Lochs","s":9020}},{"type":"quest","id":"68415","obj":{"i":68415,"n":"A Fletching Suggestion","g":106,"l":"The Lochs","s":9030}},{"type":"quest","id":"68416","obj":{"i":68416,"n":"A Rite to Rest","g":106,"l":"The Lochs","s":9040,"f":1}}]}