{"quest":{"name":"Thick Skin","location":"Idyllshire","id":68091,"patch":4.0,"sort":630,"icon":100693,"unlocksFunction":1,"eventIcon":71341,"issuer":1019863,"target":1019863,"involved":[1019864,1019865,1019867,1020988,1020989,1020990],"genre":144,"usedItems":[17941],"journal":["With the formalities now out of the way, Nonowato would have you do some mining.","Nonowato informs you that he has at last finished compiling his long list of minerals. He proceeds to tease you with the exciting prospect of actual work, before noting that Stickqix wishes to brief you himself first. To that end, Nonowato leads you in the direction of the Bangpots.","Regrettably, Stickqix's hands are full with other matters and he is unable to give you anything approaching an adequate briefing. You discover that his two Roegadyn workers are in the midst of a spat, bringing work on the Gobroller to a total standstill. Stickqix sheepishly asks if you would not mind intervening on his behalf to help solve the dispute. ","You patiently listen to each worker's gripes and soon discover the cause of the dispute. Krystrymm is of the opinion that the vehicle needs to be outfitted with sturdy armor built to withstand physical attacks. Fohcwyda, on the other hand, believes that magic is the greatest threat to the Gobroller and would see it fitted with the appropriate protection. You go over what you have heard and ready yourself to give a summary to Stickqix.","You explain to Stickqix just why his workers are butting heads. He remarks that he may have an idea as to how this dispute can be resolved, but says it will require a certain mineral. The chief asks you to mine twenty chunks of beggar's mythril ore from the Striped Hills in Gyr Abania.","Stickqix uses the minerals you procured on his behalf to create an ingot, which he shows to Krystrymm and Fohcwyda. The two of them are tasked with using this metal to create armor resistant to both magical and physical attacks. The fight finished, you choose to join Nonowato outside to discuss future work.","Nonowato unreservedly apologizes for the actions of his colleagues and encourages you to rest up well before your help is required again. You decide to follow his advice while continuing to hone your mining skills on the side.<br><br>※The next miner quest will be available from Nonowato upon reaching level 65."],"objectives":["Speak with Stickqix.","Speak with Krystrymm.","Speak with Fohcwyda.","Report to Stickqix.","<span class=\"alternative-container\"><span class=\"alternative\">Mine beggar's mythril ore on the Striped Hills</span><span class=\"alternative\">Deliver the chunks of beggar's mythril ore to Stickqix</span></span>.","Speak with Nonowato."],"dialogue":[{"name":"NONOWATO","text":"Ah, <span class=\"highlight\">Forename</span>! Truly, your timing is impeccable. I finished writing up the list of minerals not a few moments ago!"},{"name":"NONOWATO","text":"I would love to hand it over to you, but Chief Stickqix said he was keen to see that you were properly briefed first. Please follow me to the Bangpots!"},{"name":"NONOWATO","text":"Oh, <span class=\"highlight\">Forename</span>! I, um, there's been a slight complication, you see. I think the chief is best placed to explain things to you!"},{"name":"KRYSTRYMM","text":"All I can say is I'm glad most Roegadyn women don't have heads as hard as Fohcwyda's!"},{"name":"ZANSEI","text":"Feels like things are heating up in here! Or is that just the molten metal behind me?"},{"name":"FOHCWYDA","text":"Honestly, has anyone actually checked that Krystrymm isn't all brawn and no brains?"},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Addlebrained workers give Stackblox the shiveryshakes! Stackblox needs quiet to do good sweatworking."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... You have my thanks for coming. Regrettably, it is not the best of times─pray wait a moment."},{"name":"STICKQIX","text":"Or mayhap you, as an outsider, would be best suited to solve this conundrum. I know this is not quite what we requested your services for, but would you mind granting us your succor, <span class=\"alternative-container\"><span class=\"alternative\">old girl</span><span class=\"alternative\">old boy</span></span>?"},{"name":"STICKQIX","text":"Originally, I had planned to ask that you mine materials required for the construction of the Gobroller's armor. However, work has come to a screeching halt thanks to Krystrymm and Fohcwyda deciding that their time would be better served arguing."},{"name":"STICKQIX","text":"But something tells me that you might just be the one to make them see eye to eye once more! I would be eternally grateful if you could speak with them and unearth the cause of this fissure."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... I am ever in your debt, noble miner."},{"name":"STICKQIX","text":"The rest I leave up to you. You have my full confidence!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Pray speak to Krystrymm and Fohcwyda and find out just what has gotten them so agitated."},{"name":"NONOWATO","text":"My sincerest apologies, <span class=\"highlight\">Forename</span>! Our team are incredibly stu—strong-willed.<br>...Rather stubbornly so."},{"name":"KRYSTRYMM","text":"Ah, <span class=\"highlight\">Forename</span>. What's that? You've heard that Fohcwyda and I haven't been on the best of terms lately? Well, I suppose that's one way of putting it."},{"name":"KRYSTRYMM","text":"We'll be using the Gobroller in the Dravanian hinterlands, an area rife with all kinds of vile beasts. And what do vile beasts do? They attack. Ferociously."},{"name":"KRYSTRYMM","text":"Ask anyone in Idyllshire and they'd tell you the machine needs heavy armor capable of withstanding physical attacks. Anyone except Fohcwyda anyway. She's gotten it into her head for some bloody reason that claws and fangs don't warrant fortified defenses."},{"name":"KRYSTRYMM","text":"Absolutely no clue how the chief expects me to work with someone who, never mind the forest, can't even see the trees surrounded by monsters in the hinterlands!"},{"name":"FOHCWYDA","text":"If you are here about a certain quarrel then you may as well just leave now. I would not expect a miner to understand the complexities of armor design."},{"name":"FOHCWYDA","text":"That being said, it is hardly a complicated matter. My point is simple: we need to equip the Gobroller with ample protection against magic. That loggerhead simply needs to acquiesce and we can resume our work once more."},{"name":"FOHCWYDA","text":"As I am sure you have noted during your adventures, these lands have their fair share of fantastic beasts that wield deadly magic. This is precisely why I am of the mind that we need to ensure our machine is protected against such threats! How can he think otherwise?"},{"name":"FOHCWYDA","text":"Ah, but I forget myself. His lack of sense infuriates me so.<br>In summary, I have no intention whatsoever of changing to suit Krystrymm's ridiculous ideas."},{"name":"KRYSTRYMM","text":"I can't work with anyone who doesn't respect the importance of sturdy defenses. I just don't have it in me."},{"name":"FOHCWYDA","text":"To hear him speak you would think he had never borne witness to the destructive powers of magic!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... So <span class=\"emphasis\">that</span> was the cause of this commotion? You have my thanks, <span class=\"highlight\">Forename</span>."},{"name":"STICKQIX","text":"However, I must say I am truly perplexed by all of this. Neither one of them is entirely in the wrong after all... Nonowato, dear boy, a gil for your thoughts."},{"name":"NONOWATO","text":"M-My thoughts? Well, as you say, they're both quite good ideas! If only there was some way we could have our cake <span class=\"emphasis\">and</span> eat it..."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Cake? You have strayed awfully far from the subject, but I am inclined to believe there is a way we can combine these two approaches. That is the founding principle behind our work after all─making the impossible possible!"},{"name":"STICKQIX","text":"<span class=\"highlight\">Forename</span>, would it trouble you to mine some beggar's mythril ore for me? Twenty chunks or so should be enough."},{"name":"STICKQIX","text":"As to what we actually need it for...well, let's save that surprise for your triumphant return!"},{"name":"STICKQIX","text":"According to Sharlayan records, beggar's mythril ore can be found in the fringes of Gyr Abania. The best of luck!"},{"name":"NONOWATO","text":"<span class=\"highlight\">Forename</span>, as the chief said, we require twenty chunks of beggar's mythril ore. You should be able to find the mineral on the Striped Hills in Gyr Abania."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Was your trip a success?"},{"name":"STICKQIX","text":"You really outdid yourself on this one, <span class=\"alternative-container\"><span class=\"alternative\">old girl</span><span class=\"alternative\">old boy</span></span>! The quality leaves nothing to be desired. Nonowato, fetch Krystrymm and Fohcwyda for me."},{"name":"KRYSTRYMM","text":"Chief, would you mind explaining just why Fohcwyda's here as well? I figured you were well aware of the bad blood between us."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Never mind your silly squabbles, take a look at this!"},{"name":"FOHCWYDA","text":"What am I looking at exactly?"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... 'Tis an alloy I created using the beggar's mythril ore that I had <span class=\"highlight\">Forename</span> mine for us. It is noteworthy for having exceedingly low aetherial conductivity."},{"name":"FOHCWYDA","text":"You mean to say that you are going to use my idea? Fantastic!"},{"name":"KRYSTRYMM","text":"Chief, how could you!? You may as well tie the Gobroller up in a neat little bow and gift it to the beasts at this rate!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Now, now, let's not jump to any rash conclusions here, you two. Imagine this: we make sheet metal using this ingot, proceeding to wrap it in the regular sheet metal we use for vehicle armor."},{"name":"KRYSTRYMM","text":"That's all very well and good as an idea, but in practice, that's going to weigh the vehicle down to no end!"},{"name":"STICKQIX","text":"I would not be so sure. If you combine your skills, there is no reason that the impossible need remain so. Stacking the two types of metal to create a new kind of armor—one which fulfills all our needs—is something I imagine you two are quite capable of doing. Would you not agree, <span class=\"highlight\">Forename</span>?"},{"name":"KRYSTRYMM","text":"...Hmph."},{"name":"FOHCWYDA","text":"I can tell you now, we are going to need to do more than just jam two bits of metal together! Creating armor that is resistant to all kinds of attacks whilst also being of a manageable weight and size...well, it is much easier said than done."},{"name":"KRYSTRYMM","text":"We could try welding the two types of sheet metal together...although, we'd still need to figure out a way of reducing the thickness of the armor to a single sheet. Doesn't look like we'll have much time for fighting with this on our plate, eh, Fohcwyda?"},{"name":"FOHCWYDA","text":"I could not have put it better myself! If we both have the energy to bicker, then we certainly have the energy to develop a new way of creating armor. Let us not give the chief cause to regret his words, Krystrymm!"},{"name":"NONOWATO","text":"By the gods, it worked! Chief, you're brilliant!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... I could not have done it without the help of our darling miner friend! Once more, I am indebted to you, <span class=\"alternative-container\"><span class=\"alternative\">old girl</span><span class=\"alternative\">old boy</span></span>."},{"name":"NONOWATO","text":"You have my thanks as well! Pray join me outside so that we may review today's developments and discuss your future schedule."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... A hearty thanks for all your help thus far. But know this: the work has only just begun!"},{"name":"FOHCWYDA","text":"Apologies for involving you in our little spat, <span class=\"highlight\">Forename</span>. You have my word that the minerals you brought us will not go to waste!"},{"name":"FOHCWYDA","text":"I can only apologize profusely for wasting your time with our frivolous fight. I shall put twice the energy into developing this armor! I imagine you will be <span class=\"emphasis\">quite</span> impressed with what we create."},{"name":"ZANSEI","text":"The fighting has ceased, but my sweating has not. No rest for the wicked, I suppose."},{"name":"STACKBLOX","text":"Stackblox's sweatwork is at its most critical stage! Gobbie has no time for uplander arguments."},{"name":"NONOWATO","text":"You did amazing work today, <span class=\"highlight\">Forename</span>! Allow me to thank you once more."},{"name":"NONOWATO","text":"However, I also feel rather obligated to apologize for asking so much of you—I don't imagine you expected to have to mediate between our workers when you accepted this job. I'd love to say this was the first time such a quarrel has erupted between those two..."},{"name":"NONOWATO","text":"But that's neither here nor there! Enjoy some well-earned rest and seek me out once more when you feel ready for your next job."},{"name":"SYSTEM","text":"To be deleted."}],"reward":{"gil":2478,"items":[{"id":19525},{"id":19627,"one":1},{"id":19628,"one":1},{"id":19629,"one":1},{"id":19630,"one":1},{"num":5,"id":5825,"one":1}],"xp":1725300},"reqs":{"jobs":[{"lvl":63,"id":17}],"quests":[68090]},"next":[68092]},"partials":[{"type":"npc","id":"1019863","obj":{"i":1019863,"n":"Nonowato","l":2082,"q":5}},{"type":"npc","id":"1019864","obj":{"i":1019864,"n":"Stickqix","l":2082,"q":4}},{"type":"npc","id":"1019865","obj":{"i":1019865,"n":"Stackblox","l":2082,"q":5}},{"type":"npc","id":"1019867","obj":{"i":1019867,"n":"Nonowato","l":2082,"q":5}},{"type":"npc","id":"1020988","obj":{"i":1020988,"n":"Krystrymm","l":2082,"q":5}},{"type":"npc","id":"1020989","obj":{"i":1020989,"n":"Zansei","l":2082,"q":5}},{"type":"npc","id":"1020990","obj":{"i":1020990,"n":"Fohcwyda","l":2082,"q":5}},{"type":"item","id":"19525","obj":{"i":19525,"n":"High Steel Sledgehammer","l":200,"c":38060,"t":29,"p":28512}},{"type":"item","id":"19627","obj":{"i":19627,"n":"Gyuki Leather Hat","l":200,"c":41379,"t":34,"p":15681}},{"type":"item","id":"19628","obj":{"i":19628,"n":"Gyuki Leather Jacket","l":200,"c":42575,"t":35,"p":26136}},{"type":"item","id":"19629","obj":{"i":19629,"n":"Gyuki Leather Gloves of Gathering","l":200,"c":44597,"t":37,"p":15681}},{"type":"item","id":"19630","obj":{"i":19630,"n":"Gyuki Leather Chaps","l":200,"c":47344,"t":36,"p":26136}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17941","obj":{"i":17941,"n":"Beggar's Mythril Ore","l":270,"c":21206,"t":48}},{"type":"quest","id":"68090","obj":{"i":68090,"n":"Gift of the Gob","g":144,"l":"Ul'dah","s":601,"f":1}},{"type":"quest","id":"68092","obj":{"i":68092,"n":"Pedal to the Metal","g":144,"l":"Idyllshire","s":650,"f":1}}]}