{"quest":{"name":"The Sands of Debt","location":"Ul'dah","id":68097,"patch":4.0,"sort":520,"icon":100682,"unlocksFunction":1,"eventIcon":71341,"issuer":1021835,"target":1021858,"involved":[1021843,1021844,1021845,1021847,1021848,1021849,1021850,1021851,1021852,1021853,1021854,1021859,1022092],"genre":160,"journal":["Musosai is scanning the area in anticipation of your arrival.","With Momozigo's connections, Musosai has identified an evil in Ul'dah that wants for excising: a scrupulous moneylender who preys upon the poor. The crook in question has been doing his rounds at Stonesthrow, charging exorbitant rates on the meagerest sums and forcing into slavery those who are unable to repay their loans. To begin with, Musosai suggests heading to Stonesthrow and asking the denizens about the moneylender.","True to Momozigo's information, many residents of Stonesthrow have found themselves at the moneylender's mercy. Among them is a maiden who is about to be sold off to repay the debt she incurred to buy medicine for her sick father. You have learned all you need to know; time to rejoin Musosai.","Your report of the people's suffering infuriates Musosai, and he sets off to find the downtrodden daughter of which you spoke.","As the downtrodden daughter tells you of her plight, who should happen to arrive but the vile moneylender himself, a man named Phelyp. Though at first you move to prevent him from taking the maiden away, Musosai bids you put up your steel. There is more to this than Phelyp alone, he posits, and by giving the moneylender a line, he will lead you to his accomplices. With that, you set off in pursuit, in the direction of the Ul'dah Dispatch Yard.","You catch Phelyp meeting with a corrupt Brass Blades commander, whose blind eye he has been buying with bribes. Satisfied that the time to draw steel is come, Musosai bids you confront the villains.","You easily dispatch the Brass Blades, and their commander and Phelyp offer no resistance. With the situation under control, it would be meet to see how the downtrodden daughter fares.","The downtrodden daughter offers you her profuse thanks, during which time Momozigo, conspicuously absent during the confrontation, returns with Fufulupa and other upright Brass Blades to arrest the criminals. With that, an evil is excised from Ul'dah. Evil, however, knows no rest, and you set off at once for the next city–state on your journey to right wrongs: Limsa Lominsa.<br><br>※In order to travel to Limsa Lominsa, you must first complete the main scenario quest “<span class=\"alternative-container\"><span class=\"alternative\">The Lominsan Envoy</span><span class=\"alternative\">The Gridanian Envoy</span><span class=\"alternative\">The Ul'dahn Envoy</span></span>.”","At the Drowning Wench, you and your companions discuss the next move. While Musosai seeks out evil and injustice in the city with Momozigo's help, he bids you further hone your skills in your art in readiness to contend with whatever villainy should manifest.<br><br>※The next samurai quest will be available from Musosai upon reaching level 54."],"objectives":["Speak with residents of Stonesthrow.","Report to Musosai.","Speak with the downtrodden daughter.","Rendezvous with Musosai.","Defeat the Brass Blades.","Speak with the downtrodden daughter.","Speak with Musosai at the Drowning Wench."],"dialogue":[{"name":"MUSOSAI","text":"Ah, <span class=\"highlight\">Forename</span>. 'Tis good to see you again, and stronger for your tireless training."},{"name":"MUSOSAI","text":"Now then, within the sandblasted walls of this city, we have identified an evil that wants for excising: an unscrupulous moneylender who preys upon the poor."},{"name":"MOMOZIGO","text":"This I learned by plying a certain businessman with coin. Apparently, the crook in question has been doing his rounds at Stonesthrow."},{"name":"MOMOZIGO","text":"He charges exorbitant rates on the meagerest sums, and those unable to return it in full are forced into slavery."},{"name":"MUSOSAI","text":"This is no man, but a leech that feeds off the least fortunate among us. Such evil cannot be suffered!"},{"name":"MUSOSAI","text":"Let us head to the shantytown, Storm's Blow, and speak with the denizens."},{"name":"MUSOSAI","text":"It seems a great gulf divides the rich and poor in this nation. Hingashi, I am sad to say, is no different."},{"name":"MOMOZIGO","text":"(Grrr, that Wymond! How dare he charge me for information!?)"},{"name":"PAUPERA02561","text":"Sure, I can tell you 'bout the moneylender. Was played for a fool myself, an' I've got only myself to blame. Fool me once, shame on me─that's just how it works here."},{"name":"PAUPERB02561","text":"That moneylender bastard? He's a swindler, is what he is. Pretends he's your best friend, acting like he cares, but when you can't cough up the coin, he shows his true colors. &lt;spit&gt;"},{"name":"PAUPERC02561","text":"Aye, I was stupid enough to get a loan, and now I'm working it off till Thal knows when. And I'm one of the luckier ones. My heart goes out to the lass yonder who's about to be sold on account of the medicine she bought her sick father."},{"name":"PAUPERA02561","text":"Sure, I can tell you 'bout the moneylender. Was played for a fool myself, an' I've got only myself to blame. Fool me once, shame on me─that's just how it works here."},{"name":"PAUPERB02561","text":"That moneylender bastard? He's a swindler, is what he is. Pretends he's your best friend, acting like he cares, but when you can't cough up the coin, he shows his true colors. &lt;spit&gt;"},{"name":"PAUPERC02561","text":"Aye, I was stupid enough to get a loan, and now I'm working it off till Thal knows when. And I'm one of the luckier ones. My heart goes out to the lass yonder who's about to be sold on account of the medicine she bought her sick father."},{"name":"MUSOSAI","text":"It seems I was too kind earlier. This man is no leech; he is the stain that night soil leaves behind. Let us seek out this downtrodden damsel, who sought only to do right by her father. I shall find Momozigo and join you presently."},{"name":"MUSOSAI","text":"Let us seek out this downtrodden damsel, who sought only to do right by her father. I shall find Momozigo and join you presently."},{"name":"PAUPERC02561","text":"Aye, you heard right. Da needed medicine badly, so we borrowed a handful o' coins. But afore we knew it, a handful became a chestful, an' now I'm havin' to work to pay it back."},{"name":"PAUPERC02561","text":"But the interest grows faster'n I can work, an' the moneylender's threatenin' to sell me off to a client. If that happens, no one'll be left to look after Da. I just...I don't know what to do no more... &lt;sob&gt;"},{"name":"MOMOZIGO","text":"Her own happiness is on the line, but she still worries for her father... &lt;sniff&gt; Ohhh, this moneylender has it coming to him!"},{"name":"PAUPERC02561","text":"&lt;gasp&gt; M-Mister Phelyp! Don't sell me, please! I'll work harder, I swear it! Just don't take me away! My da, he needs lookin' after!"},{"name":"PHELYP","text":"Is that supposed to move me? If anything, you should be thankful. I'm offering you a chance to earn money without any effort─you need only lie on your back, heh heh heh. Now, come quietly."},{"name":"MOMOZIGO","text":"Hold it right there, villain! If you try to take the girl away, you'll have to answer to these samurai here!"},{"name":"PHELYP","text":"I know not who you are, but this is a legitimate business transaction, and certainly none of your concern. However, if you insist on threatening my person, I'll not hesitate to summon the Brass Blades."},{"name":"MUSOSAI","text":"Pray forgive us our indiscretion, my lord. As you say, it is none of our concern. <span class=\"highlight\">Forename</span>, put up your katana."},{"name":"MOMOZIGO","text":"What are you doing, Musosai!? Or should I say <span class=\"emphasis\">not</span> doing!? I thought the idea was to punish evil!"},{"name":"MUSOSAI","text":"Now was not the time to draw steel; doing so would have only worsened the situation. We must be patient and await the right moment."},{"name":"MUSOSAI","text":"Besides, I suspect that there is more to the operation than this Phelyp alone. If we give him a line, he will surely lead us to his accomplices. Come, let us follow him."},{"name":"MOMOZIGO","text":"Just you wait, Phelyp! We'll get you yet!"},{"name":"PAUPERC02561","text":"She's gone, then... Wish I could've done something, but then the same would've happened to me."},{"name":"MUSOSAI","text":"It appears our man is meeting someone. Ah, speak of the devil..."},{"name":"PHELYP","text":"Hehehe... Even with the rags, 'tis plain she is a beauty, yes? I trust she will serve to stay in your good graces."},{"name":"DOUJINDAN02561","text":"Oho, you've outdone yourself this time. Yes, she will serve very well. Very well indeed. You may continue to conduct your business freely."},{"name":"MOMOZIGO","text":"She's being used to bribe a Brass Blade, and a commanding officer at that! Grrr, damn that scoundrel!"},{"name":"MUSOSAI","text":"Now we know why this villain was able to operate in plain sight, unmolested by the law. <span class=\"highlight\">Forename</span>, the time is come to draw steel!"},{"name":"MUSOSAI","text":"Come, <span class=\"highlight\">Forename</span>! It is time to draw steel!"},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"BALLOON","text":"What are they doin' here!?"},{"name":"PHELYP","text":"Uwaaaaaah! Mammyyy!"},{"name":"DOUJINDAN02561","text":"D-Don't hurt me! I surrender!"},{"name":"MUSOSAI","text":"Well fought, my pupil. Now, see to the maiden.<br>...Hm? Where is Momozigo?"},{"name":"PAUPERC02561","text":"Thank you! Thank you so much!"},{"name":"MUSOSAI","text":"You did well. But remember, a katana is not to be drawn blindly. Within its sheath you must let it rest, steeping in power, until the time is ripe to strike."},{"name":"MUSOSAI","text":"Such is the way of the samurai.<br>...Hm?"},{"name":"MUSOSAI","text":"What have you done, Momozigo?"},{"name":"MOMOZIGO","text":"Musosai, wait! He's my friend and he's here to help!"},{"name":"MUSOSAI","text":"Hm? He is not the enemy?"},{"name":"FUFULUPA","text":"Oh, not at all, good sir. Long story short, we've been trying to find decisive evidence linking the moneylender Phelyp to one of our officers. And thanks to your timely intervention, we've done just that."},{"name":"FUFULUPA","text":"His involvement in this racket is a stain upon our honor...which is admittedly far from squeaky clean. But know that there are many honest Brass Blades still─good men and women who strive to serve the public trust!"},{"name":"PAUPERC02561","text":"If you hadn't appeared, gods know where I might've ended up. I don't know how to thank you."},{"name":"MOMOZIGO","text":"Think nothing of it─the work is its own reward. Now, hurry back to your da and put his mind at ease."},{"name":"FUFULUPA","text":"Pray allow me to thank you also. With your help, we succeeded in catching slippery crooks who had long eluded us. Rest assured we shall see to the rest. By your leave!"},{"name":"MUSOSAI","text":"For a moment, I thought you had given us up to the enemy. Next time I would thank you to share your plans."},{"name":"MOMOZIGO","text":"Hehe, have a little faith, will you? Thanks to my spontaneity, we managed to wrap this up in a neat little package. Fufulupa, he and I go back a long way. Fellow's as honest as they come."},{"name":"MUSOSAI","text":"I do not doubt it. Now then, our work here is done; one fewer evil afflicts the realm."},{"name":"MUSOSAI","text":"Let us move on, to wherever the wind should blow."},{"name":"MUSOSAI","text":"And the wind blows, 'twould seem, to the sea. Momozigo, pray take the lead."},{"name":"MOMOZIGO","text":"Right! This way, friends─we're going to Limsa Lominsa!"},{"name":"SYSTEM","text":"In order to travel to Limsa Lominsa, you must first complete the main scenario quest “<span class=\"alternative-container\"><span class=\"alternative\">The Lominsan Envoy</span><span class=\"alternative\">The Gridanian Envoy</span><span class=\"alternative\">The Ul'dahn Envoy</span></span>.”"},{"name":"MOMOZIGO","text":"Ahhh, I do love the sea. There's something cleansing about it, and I don't mean just taking a dunk."},{"name":"MUSOSAI","text":"Such a vibrant port city, brimming with people of all races and creeds... Mayhap one day Hingashi, too, will learn to open its arms to the world."},{"name":"MUSOSAI","text":"Now then, as before, Momozigo and I shall seek out evil and injustice in this place. Pray use the time to further hone your skills in our art, that you might stand ready to contend with whatever villainy should manifest."}],"reward":{"gil":1302,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":111}],"quests":[68096]},"next":[68098]},"partials":[{"type":"npc","id":"1021835","obj":{"i":1021835,"n":"Musosai","l":40,"q":2}},{"type":"npc","id":"1021858","obj":{"i":1021858,"n":"Musosai","l":28,"q":2}},{"type":"npc","id":"1021843","obj":{"i":1021843,"n":"Pragmatic Pauper","l":43,"q":1}},{"type":"npc","id":"1021844","obj":{"i":1021844,"n":"Piqued Pauper","l":43,"q":1}},{"type":"npc","id":"1021845","obj":{"i":1021845,"n":"Pleasant Pauper","l":43,"q":1}},{"type":"npc","id":"1021847","obj":{"i":1021847,"n":"Musosai","l":43,"q":1}},{"type":"npc","id":"1021848","obj":{"i":1021848,"n":"Momozigo","l":43,"q":1}},{"type":"npc","id":"1021849","obj":{"i":1021849,"n":"Musosai","l":43,"q":1}},{"type":"npc","id":"1021850","obj":{"i":1021850,"n":"Momozigo","l":43,"q":1}},{"type":"npc","id":"1021851","obj":{"i":1021851,"n":"Musosai","l":43,"q":1}},{"type":"npc","id":"1021852","obj":{"i":1021852,"n":"Phelyp","l":43,"q":1}},{"type":"npc","id":"1021853","obj":{"i":1021853,"n":"Brass Blades Commander","l":43,"q":1}},{"type":"npc","id":"1021854","obj":{"i":1021854,"n":"Downtrodden Daughter","l":43,"q":1}},{"type":"npc","id":"1021859","obj":{"i":1021859,"n":"Momozigo","l":28,"q":2}},{"type":"npc","id":"1022092","obj":{"i":1022092,"n":"Downtrodden Daughter","l":43,"q":1}},{"type":"quest","id":"68096","obj":{"i":68096,"n":"Master Musosai","g":160,"l":"Ul'dah","s":501,"f":1}},{"type":"quest","id":"68098","obj":{"i":68098,"n":"Blood on the Deck","g":160,"l":"Limsa Lominsa","s":540,"f":1}}]}