{"quest":{"name":"Blood on the Deck","location":"Limsa Lominsa","id":68098,"patch":4.0,"sort":540,"icon":100682,"unlocksFunction":1,"eventIcon":71341,"issuer":1021858,"target":1021869,"involved":[1001208,1001217,1003272,1006273,1021859,1021860,1021861,1021862,1021863,1021864,1021865,1021866,1021867,1021868,1021870],"genre":160,"journal":["Musosai is looking for you among the Drowning Wench crowd.","In the course of an inadvertent brush with the law, Musosai has learned that a serial killer has been terrorizing Limsa Lominsa. What is more, the murderer's weapon of choice appears to be a katana, meaning you may be dealing with a fellow samurai. At Momozigo's suggestion, you turn your steps towards Hawkers' Alley, there to ask the locals about the criminal.","The shopkeepers on Hawkers' Alley inform you that the victims have thus far been a traveler, a regular patron, and a Qiqirn. There appears to be no connection between them, at least on the surface. With your information combined with his, perhaps Musosai will be able to glean a new lead.","Musosai deducts that the killer targets defenseless individuals on the pier, in the black of night. He proposes luring the criminal out with a trap, and Momozigo reluctantly accepts his role as the bait. With that settled, your companions set off for Fisherman's Bottom, where they will set the trap.","The killer shows as anticipated, but is spooked by Momozigo's ear-piercing shriek and runs off before you are able to act. All is not in vain, however, for Musosai recognizes the blade the criminal brandished. It would seem the suspect is a Lalafellin merchant who harbors a fetish for Far Eastern blades. Momozigo mentions Gegeruju, the master of Costa del Sol, though he is not entirely convinced of his guilt. For want of another lead, however, Musosai decides to confront the man at his resort.","Laughing off your accusations, Gegeruju gives you the name of one Gurumi Borlumi, a rival merchant who is obsessed with all things Far Eastern and has a katana collection besides. Based on what you are told, it seems beyond doubt that this is the killer you seek. To help you infiltrate the man's ship, which lies at anchor off the coast, Gegeruju furnishes you with an invitation to a banquet along with a disguise for Momozigo. With this, you should be able to have Gurumi Borlumi's retainer ferry you to his master's ship.","The invitation and disguise work like a charm, and you are shown to Gurumi Borlumi's ship, all decked out in a gaudy caricature of the Far East. When Musosai confronts the man about the killings, he readily owns up to them, his eyes glinting with a sick pleasure. He unleashes his cavalcade of guards upon you, from false shinobi to his pet Yanxian beast to finally his chief bodyguard, a samurai pretender named Ostyrgrein. Between you and Musosai, you overcome all of Gurumi Borlumi's men, whereupon he promptly turns tail and abandons ship. Musosai sets off in pursuit, with you not far behind.","You catch Gurumi Borlumi as he reaches the pier at Costa del Sol, where he learns to his shock that he had been facing a legendary swordsman all this time. Nonetheless, he is unwilling to admit defeat, and placing undue faith in his katana, turns it upon Musosai. Deeming the man beyond redemption, your master summarily puts an end to him. But no sooner does the old man declare your work done than he falls to his knees for his recent exertions. Regaining his feet, he assures you all is well and bids Momozigo lead the way to the next stage of your quest: the forest nation of Gridania.","You arrive in Gridania and join your companions at the Carline Canopy. While Musosai seems to enjoy being in the forest nation, Momozigo is evidently uncomfortable and excuses himself to go and make inquiries. Until such time as a new evil is identified, you resolve to further hone your skills as a samurai.<br><br>※The next samurai quest will be available from Musosai upon reaching level 56."],"objectives":["Gather intelligence in Hawkers' Alley.","Report to Musosai.","Join Musosai.","Speak with Gegeruju in Costa del Sol.","Hand the invitation to Gurumi Borlumi's retainer.","Speak with Musosai in Gridania."],"dialogue":[{"name":"MOMOZIGO","text":"So, er, the old man bought a fish, carved it up with his katana, then devoured it raw. He offered me some. I declined."},{"name":"MUSOSAI","text":"<span class=\"highlight\">Forename</span>, your katana has come to sit well at your hip. 'Tis plain your experience excising evil has matured you as a samurai."},{"name":"MUSOSAI","text":"I have had an eventful time in this salt-kissed city. In the course of seeking evil, I came under the suspicion of the local peacekeepers, the Mellow Packets."},{"name":"MUSOSAI","text":"A serial killer has been terrorizing these parts, 'twould seem, whose weapon of choice is an uncommonly sharp blade─one not unlike ours. And so I found myself confronted and questioned."},{"name":"MUSOSAI","text":"Thanks to Momozigo's testimony, however, the pall of suspicion was quickly lifted. Not only that, but we were even permitted to examine the victims' wounds. There can be no doubt: they were inflicted by a katana."},{"name":"MUSOSAI","text":"The killer may well be a samurai, yet a true samurai does not take life without just cause. Murder is heinous in its own right; committing it with our noble weapon compounds the crime. Such evil cannot be suffered!"},{"name":"MOMOZIGO","text":"So there you have it, we're going after a serial killer. I must say, I'm morbidly excited. Right, let's begin by talking to people in Hawkers' Alley."},{"name":"MUSOSAI","text":"Hmmm, what do the victims have in common?"},{"name":"MOMOZIGO","text":"Can't say I blame the Yellow Jackets for marking us out. I mean, every ilm of Musosai screams “Look at meeeeee!”"},{"name":"SWOZBLAET","text":"The serial killings? Oh, don't get me started. We all of us here have been on edge. One of the victims was a regular of mine─Navigator rest his soul─and I pray that the culprit is caught soon."},{"name":"BAENSYNG","text":"The recent murders? Gruesome business, that, an' it seems no one's safe neither. Why, even a traveler got 'imself sliced up, the unlucky sod. What sort o' sick bastard'd do a thing like that?"},{"name":"KYOKYOROON","text":"Killer makes Qiqirn dead! Makes Kyokyoroon afraid! Afraidfully afraid! Kyokyoroon shake! Shaky wake all night! Brrr!"},{"name":"SWOZBLAET","text":"The serial killings have all of us here on edge. One of the victims was a regular of mine─Navigator rest his soul─and I pray that the culprit is caught soon."},{"name":"BAENSYNG","text":"Gruesome business, the murders, an' it seems no one's safe neither. Why, even a traveler got 'imself sliced up, the unlucky sod. What sort o' sick bastard'd do a thing like that?"},{"name":"KYOKYOROON","text":"Killer makes Qiqirn dead! Makes Kyokyoroon afraid! Afraidfully afraid! Kyokyoroon shake! Shaky wake all night! Brrr!"},{"name":"MUSOSAI","text":"A patron, a traveler, and a Quick Earn... The victims do not seem to have anything in common."},{"name":"MUSOSAI","text":"However, the circumstances of their deaths are strikingly similar. They all vanished in the vicinity of the docks before later turning up as corpses."},{"name":"MUSOSAI","text":"The killer, it seems to me, targets those who happen to pass along the landing."},{"name":"MOMOZIGO","text":"It's completely random, then? What a frightening thought... But now that we know this, what do we do next?"},{"name":"MUSOSAI","text":"We set a trap─lure the killer out by walking around the area in question in the black of night. When he emerges from the shadows, we apprehend him."},{"name":"MOMOZIGO","text":"Ah, a solid plan! So, who's the lucky one who gets to be the bait?"},{"name":"MOMOZIGO","text":"Wait, what!? Wh-Why me!?"},{"name":"MUSOSAI","text":"Though the victims have naught in common, it must be noted that none of them were armed. In other words, the killer preyed on the defenseless."},{"name":"MUSOSAI","text":"With our katana at our hips, <span class=\"highlight\">Forename</span> and I shan't make enticing bait. Conversely, were we to forgo our weapons, we would be ill equipped to subdue the villain. And so it falls to you."},{"name":"MUSOSAI","text":"Take heart, my friend. Both of us shall be close on hand, ready to pounce ere you may come to harm. Now then, let us go to the docks."},{"name":"MOMOZIGO","text":"Twelve above, please keep me safe. Please keep me safe."},{"name":"MUSOSAI","text":"It is time. Let us set the trap."},{"name":"MOMOZIGO","text":"AIEEEEEE! IT'S HIM!"},{"name":"MUSOSAI","text":"That blade..."},{"name":"MUSOSAI","text":"By the kami, Momozigo, that scream was loud enough to wake the dead. Small wonder the villain fled with such haste."},{"name":"MOMOZIGO","text":"It wasn't intentional..."},{"name":"MUSOSAI","text":"What's done is done. Besides, our mission was not entirely without fruit. The killer's blade─it is known to me. Some while ago, a wealthy merchant of this land came to Kugane, a port of Hingashi. The man had a fetish for blades, and proceeded to buy up the finest he could find."},{"name":"MUSOSAI","text":"I chanced to inspect the wares at one of the many swordsmiths this merchant visited, and noted a unique katana marked for delivery to his ship─the selfsame katana the killer wields. Furthermore, according to the shopkeeper, the merchant was a Laugh a Bell."},{"name":"MOMOZIGO","text":"A wealthy Lalafellin merchant, you say? Well, in this area there's Gegeruju, whom I once entertained with a dance troupe. But for all his vices, he didn't strike me as a serial killing sort."},{"name":"MUSOSAI","text":"Be that as it may, this is our sole lead for now. Where do we find this man?"},{"name":"MOMOZIGO","text":"At his resort in Costa del Sol, most like. But I'm doubtful he's the one we're after."},{"name":"MUSOSAI","text":"No need to mince words. Let us pierce right to the heart of the matter."},{"name":"MOMOZIGO","text":"Gegeruju's hardly a paragon of righteousness, but if he's guilty of anything, it's of being a lecher, not a murderer."},{"name":"GEGERUJU","text":"&lt;slurp&gt; Who dares disturb my slumber? ...Well, what a peculiar party you are, you with your Far Eastern companion. What is it you wish of me?"},{"name":"GEGERUJU","text":"&lt;slurp&gt; Who dares disturb my slumber? ...Oho! If it isn't the resourceful and...<span class=\"emphasis\">supremely forgiving</span> adventurer!"},{"name":"GEGERUJU","text":"I see you've brought company today, and of the Far Eastern persuasion besides. How very exotic. But come, what is it you wish of me?"},{"name":"GEGERUJU","text":"...Truly now! Yours truly, a suspect in the serial killings! But of course it is a mistake, and no mistake about it. However, I do have an inkling as to who the culprit might be."},{"name":"GEGERUJU","text":"Gurumi Borlumi─he is your man. He made his fortune in trade, and indulges in extreme excesses─which, coming from me, is saying something. But most relevant to your investigation is the fact that he is obsessed with all things Far Eastern and owns an extensive collection of katana."},{"name":"GEGERUJU","text":"Why, just the other day at a social gathering, he was bragging on about one such weapon as though it was his firstborn. When he said that he wanted to feel what it's like to cut a man down, we all had a good chuckle, assuming he was speaking in jest. The man did always strike me as touched, but to think that he would actually go and do the deed..."},{"name":"MUSOSAI","text":"To kill simply to satisfy his own twisted urges... This is no man, but a fiend in a man's skin."},{"name":"MUSOSAI","text":"Master Gegeruju, we were wrong to suspect you, and humbly beg your forgiveness. Will you tell us where to find this depraved creature?"},{"name":"GEGERUJU","text":"On his ship, where he lives. It's at anchor nearby for now, but I should warn you that he recently mentioned wanting a change of scenery."},{"name":"MOMOZIGO","text":"Ack, a ship? It's going to be tough to sneak aboard, but if we miss this chance, who knows when there'll be another?"},{"name":"GEGERUJU","text":"Hohoho! Thank your lucky stars, for it just so happens I've received an invitation from Gurumi Borlumi to attend a banquet aboard his─and I quote─“vessel of myriad pleasures.”"},{"name":"GEGERUJU","text":"You may have it─I had no intention of attending, at any rate. Show it to the man's retainer at the pier, and you will be shown to his ship."},{"name":"GEGERUJU","text":"You may have it─a small token of my remorse to you, my dear adventurer. Show it to the man's retainer at the pier, and you will be shown to his ship."},{"name":"GEGERUJU","text":"And you, showmaster─I will lend you my garb. Disguised as yours truly, none shall raise an eyebrow were you to have “bodyguards” in your company. And with that, I bid you success. Gurumi Borlumi is a troublesome business rival, and I shan't shed a tear at his demise."},{"name":"MUSOSAI","text":"We are grateful. Without further ado, then, let us assume our roles and head to the pier."},{"name":"MOMOZIGO","text":"Why do I have a terrible feeling about this?"},{"name":"MUSOSAI","text":"A breathtaking view. It reminds me of the Ruby Sea. Of home."},{"name":"MOMOZIGO","text":"Hohoho! 'Tis a fine day for a banquet aboard a ship! A fine day indeed! (...Well? Was that convincing?)"},{"name":"GEGERUJU","text":"Present the invitation to Gurumi Borlumi's retainer at the pier, and you will be shown to the ship. I shall be praying for your success and my rival's demise."},{"name":"ATTENDANT02562","text":"Master Gegeruju and company, you do us great honor. The invitation, if I may?"},{"name":"ATTENDANT02562","text":"All appears in order. Thank you kindly. If you would care to step aboard, we shall cast off presently."},{"name":"INVITEE02562","text":"Your dedication to your passion is beyond impressive, my lord! Would that we all had your fine taste!"},{"name":"GURUMIBORLUMI","text":"Come now, we've scarcely scratched the surface. Save some wonderment for my prized katana."},{"name":"GURUMIBORLUMI","text":"Ah, Master Gegeruju, always a pleasure. I say, are those samurai I see beside you?"},{"name":"GURUMIBORLUMI","text":"A commendable first effort, my lord. But they pale in comparison to my katana collection."},{"name":"MUSOSAI","text":"You would flaunt the blades you used to cut down innocents? Twisted fiend, your reign of terror ends here."},{"name":"GURUMIBORLUMI","text":"You are not Gegeruju, are you? And yet I would swear we've met."},{"name":"MOMOZIGO","text":"Damn right we've met! I'm the would-be prey who screamed his lungs out!"},{"name":"GURUMIBORLUMI","text":"Ah, yes, from the other night. Heh heh heh... You see, 'tis well and good to admire a blade upon a stand, but its true place is in one's hand. This I discovered to my sheerest ecstasy."},{"name":"MUSOSAI","text":"The law is too good for the likes of you. You shall face the selfsame end you visited upon innocents."},{"name":"GURUMIBORLUMI","text":"Not only do you sneak uninvited into a private gathering; you make violent threats against an upstanding citizen? It seems I have no choice but to summon the guards. Now, let us step above, and pray put on a good show─I have a reputation as a host to uphold."},{"name":"GURUMIBORLUMI","text":"Ostyrgrein, <span class=\"emphasis\">koi</span>! Time to work for your keep!"},{"name":"MUSOSAI","text":"That is no way to hold a katana. You are no true samurai."},{"name":"OSTYRGREIN","text":"Bah, like there's a difference. A samurai's jus' a swordsman what fights with a katana, an' this champion gladiator's gonna show you how it's done."},{"name":"MUSOSAI","text":"You heard that, <span class=\"highlight\">Forename</span>? The difference is lost on this man. We must free him from his ignorance."},{"name":"GURUMIBORLUMI","text":"Hold it. I've a mind to savor this. We shall save you for last. Let us warm the deck with an opening act."},{"name":"GURUMIBORLUMI","text":"For now, we enjoy the spectacle."},{"name":"MUSOSAI","text":"I, too, shall observe. You alone are more than enough for these false shinobi."},{"name":"GURUMIBORLUMI","text":"Have at <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>! <span class=\"emphasis\">Kirisuteeei</span>!"},{"name":"MUSOSAI","text":"That is as far as you go."},{"name":"GURUMIBORLUMI","text":"Wh-Who are you?"},{"name":"MUSOSAI","text":"I am Musosai, and beside me is my pupil, <span class=\"highlight\">Forename</span>. We seek out the wicked and exact justice upon them."},{"name":"GURUMIBORLUMI","text":"M-Musosai!? The legendary swordsman whose tales I heard in Kugane!? Small wonder my guards didn't stand a chance!"},{"name":"GURUMIBORLUMI","text":"B-But even legends bleed, and with my transcendent katana, I am more than a match for you!"},{"name":"GURUMIBORLUMI","text":"Come! This blade shall drink deep of your lifeblood!"},{"name":"MUSOSAI","text":"Unrepentant fiend. You belong not in gaol, but in hell. Say your prayers to whatever kami you keep."},{"name":"MUSOSAI","text":"You needn't befoul your blade with scum such as this."},{"name":"MUSOSAI","text":"We have accomplished our goal of excising evil, and for that I am glad. But this outing leaves much to be desired for your training."},{"name":"MUSOSAI","text":"For you see, a samurai learns best when he faces a fellow samurai of equal skill. Alas, they are hard to come by in this land, and a pretender such as that whom you faced is no substitute."},{"name":"MOMOZIGO","text":"Whew, we did it! Pats on the back for everyone, especially me! Now, what's this about you being a legend back at home?"},{"name":"MUSOSAI","text":"'Tis ancient history. Whatever I may have been in the past, now I am but as you see me: an old man long past his prime."},{"name":"GEGERUJU","text":"Well done, my friends! You have rid us of a depraved monster. His was a brutal end, but it was no more than he deserved. Justice well served indeed!"},{"name":"GEGERUJU","text":"Rest assured this mess will be cleaned up. As they say, what happens in del Sol stays in del Sol."},{"name":"MUSOSAI","text":"We are in your debt, my lord."},{"name":"MUSOSAI","text":"Our work here is done; one fewer evil afflicts...afflicts..."},{"name":"MOMOZIGO","text":"Musosai! Are you alright!?"},{"name":"MUSOSAI","text":"Worry not, I shall be fine... My endurance is not as it once was, is all."},{"name":"MUSOSAI","text":"Come, my friends. Let us move on, to wherever the wind should blow."},{"name":"MUSOSAI","text":"And the wind blows, 'twould seem, to the forest. Momozigo, pray lead on."},{"name":"MOMOZIGO","text":"The forest? Y-You mean...Gridania? Oh, dear... Er, I mean, of course! Right this way!"},{"name":"MOMOZIGO","text":"Ahhh, Gridania! Always lovely to be here! Ahahaha...ha."},{"name":"GEGERUJU","text":"Gurumi Borlumi was a monster, and he received no more a punishment than he deserved. Justice well served indeed!"},{"name":"MUSOSAI","text":"A nation at one with the forest... Simply being here is salve for the soul. Yet even amidst such seeming serenity, untold wickedness may lurk. Until such time as we find it, pray continue applying yourself to our art."},{"name":"MOMOZIGO","text":"R-Right, then! I-I'll go about making inquiries at once!"}],"reward":{"gil":2877,"xp":62400},"reqs":{"jobs":[{"lvl":54,"id":111}],"quests":[68097]},"next":[68099]},"partials":[{"type":"npc","id":"1021858","obj":{"i":1021858,"n":"Musosai","l":28,"q":2}},{"type":"npc","id":"1021869","obj":{"i":1021869,"n":"Musosai","l":52,"q":2}},{"type":"npc","id":"1001208","obj":{"i":1001208,"n":"Kyokyoroon","l":29,"q":4}},{"type":"npc","id":"1001217","obj":{"i":1001217,"n":"Swozblaet","l":29,"q":7}},{"type":"npc","id":"1003272","obj":{"i":1003272,"n":"Baensyng","l":29,"q":3}},{"type":"npc","id":"1006273","obj":{"i":1006273,"n":"Gegeruju","l":32,"q":7}},{"type":"npc","id":"1021859","obj":{"i":1021859,"n":"Momozigo","l":28,"q":2}},{"type":"npc","id":"1021860","obj":{"i":1021860,"n":"Musosai","l":29,"q":1}},{"type":"npc","id":"1021861","obj":{"i":1021861,"n":"Momozigo","l":29,"q":1}},{"type":"npc","id":"1021862","obj":{"i":1021862,"n":"Musosai","l":29,"q":1}},{"type":"npc","id":"1021863","obj":{"i":1021863,"n":"Momozigo","l":29,"q":1}},{"type":"npc","id":"1021864","obj":{"i":1021864,"n":"Musosai","l":32,"q":1}},{"type":"npc","id":"1021865","obj":{"i":1021865,"n":"Momozigo","l":32,"q":1}},{"type":"npc","id":"1021866","obj":{"i":1021866,"n":"Gurumi Borlumi's Retainer","l":32,"q":1}},{"type":"npc","id":"1021867","obj":{"i":1021867,"n":"Musosai","l":32,"q":1}},{"type":"npc","id":"1021868","obj":{"i":1021868,"n":"Momozigo","l":32,"q":1}},{"type":"npc","id":"1021870","obj":{"i":1021870,"n":"Momozigo","l":52,"q":1}},{"type":"quest","id":"68097","obj":{"i":68097,"n":"The Sands of Debt","g":160,"l":"Ul'dah","s":520,"f":1}},{"type":"quest","id":"68099","obj":{"i":68099,"n":"A Fraudster in the Forest","g":160,"l":"Gridania","s":560,"f":1}}]}