{"quest":{"name":"The Way of the Samurai","location":"Ul'dah","id":68095,"patch":4.0,"sort":500,"icon":100682,"unlocksFunction":1,"eventIcon":71341,"issuer":1021829,"target":1021834,"involved":[1021830],"genre":160,"journal":["An Ul'dahn citizen is ripe to burst with excitement and seeks a hapless passerby upon whom to unburden himself.<br><br>※This quest will unlock the samurai job.","As you walk along Emerald Avenue, you are accosted by an excited citizen who claims to have witnessed some truly amazing bladework at the Coliseum. To hear him tell it, an elderly Far Eastern gentleman is calling for challengers as pre-fight entertainment, but contrary to all expectations, he has been dropping both opponents and viewers' jaws with his sublime skills. Finding your interest piqued in these Far Eastern warriors known as samurai, you consider seeking out the silver-tongued showmaster.","The silver-tongued showmaster apprises you of the rules: challengers must fight the old samurai with the selfsame blade he wields, and those who best him will be awarded a rare Hingan treasure. If you believe you have what it takes, the showmaster instructs you to make yourself known to the Far Eastern elder within the Gladiators' Guild.","Introducing himself as Musosai, the Far Eastern elder lends you an unusual sword and what appears to be a soulstone for your duel. Take up the mythrite uchigatana and wear the stone upon your person, and you will become a samurai in name─if not in sooth.<br><br>※The next samurai quest will be available from Musosai."],"objectives":["Speak with the silver-tongued showmaster.","Speak with the Far Eastern elder."],"dialogue":[{"name":"CITIZEN02559","text":"Thal's balls, just when you think you've seen it all! The world's full of surprises!"},{"name":"CITIZEN02559","text":"What am I talking about, you ask? Oh, nothing much─<span class=\"emphasis\">just the most amazing bladework I've ever seen</span>!"},{"name":"CITIZEN02559","text":"It wasn't even the main card, either, but light entertainment. A Far Eastern fellow, old enough to be my grandfather, appeared and called for challengers. But who should answer him but a brute of a gladiator?"},{"name":"CITIZEN02559","text":"People thought it was either mummery or a sick joke. After all, what could one expect from such a mismatch─the old and infirm versus the young and in form?"},{"name":"CITIZEN02559","text":"But when the action began, the old man proceeded to drop everyone's jaws─his opponent's not least of all─with his blistering bladework!"},{"name":"CITIZEN02559","text":"The most riveting moment, though, was when he had the challenger on the back foot. For instead of finishing the job, he went and sheathed his blade!"},{"name":"CITIZEN02559","text":"Putting your steel away in the heat of battle...well, that's akin to committing suicide. This wasn't lost on the gladiator, who lunged in with a mighty swing."},{"name":"CITIZEN02559","text":"The spectators gasped collectively, thinking it was over. And it was...but not for the old man. For in the next instant, before anyone could comprehend what had happened, his opponent was crumpled on the ground!"},{"name":"CITIZEN02559","text":"In one fell stroke, and with impossible speed, the old man had drawn his sword and dealt the telling blow. A few heartbeats passed in stunned silence, then the stands erupted in riotous cheering. Gods, just recounting it gives me the chills! The speed, the precision, the elegance...simply sublime! How's it possible I had never heard of these Far Eastern warriors? These “samurai”?"},{"name":"CITIZEN02559","text":"W-Wait, are you thinking what I think you're thinking, and you want to face the old man? Well, that silver-tongued showmaster <span class=\"emphasis\">was</span> looking for a new challenger, but you don't want to do this. Let someone else be the fool."},{"name":"CITIZEN02559","text":"If you've a mind to take on the old man, that silver-tongued showmaster <span class=\"emphasis\">was</span> looking for a new challenger. But trust me when I say that you don't want to do this. Let someone else be the fool."},{"name":"MOMOZIGO","text":"Come one, come all, and marvel at a mystery of the Far East! A swordsman hailing from exotic Hingashi, whose bladework is quicker than the eye can see!"},{"name":"MOMOZIGO","text":"Don't let his age fool you! Old though he may be, he's already made short work of one of Ul'dah's meanest gladiators, and he now seeks a new challenger! If you can best him, you'll be rewarded with a rare Hingan treasure!"},{"name":"MOMOZIGO","text":"There's just one condition: you must fight with the same blade as the old man's. If you think you have what it takes, proceed to the Gladiators' Guild and make yourself known to the Far Eastern elder!"},{"name":"MOMOZIGO","text":"A rare Hingan treasure to the challenger who can best the Far Eastern elder! If you think you have what it takes, proceed to the Gladiators' Guild and make yourself known to him!"},{"name":"MUSOSAI","text":"This aura... Unusual, yet undoubtedly formidable. Dare I hope a worthy challenger has come?"},{"name":"MUSOSAI","text":"(-Musosai-)Well met, friend. I am Musosai, a samurai of Hingashi."},{"name":"MUSOSAI","text":"(-Musosai-)Lest you wonder, samurai are swordsmen of the Far East. Yet know that the swords we wield are unlike those of this land. Katana, they are called, and for our duel I shall lend you such a blade...along with a stone─a talisman of sorts."},{"name":"MUSOSAI","text":"(-Musosai-)Wear them on your person, and you shall become one of us─at least in appearance if not in sooth."}],"reward":{"gil":517,"items":[{"id":17741},{"id":20388},{"id":20620}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":34}]},"next":[68096]},"partials":[{"type":"npc","id":"1021829","obj":{"i":1021829,"n":"Ul'dahn Citizen","l":40,"q":1}},{"type":"npc","id":"1021834","obj":{"i":1021834,"n":"Far Eastern Elder","l":41,"q":1}},{"type":"npc","id":"1021830","obj":{"i":1021830,"n":"Silver-tongued Showmaster","l":41,"q":1}},{"type":"item","id":"17741","obj":{"i":17741,"n":"Soul of the Samurai","l":30,"c":26055,"t":62}},{"type":"item","id":"20388","obj":{"i":20388,"n":"Mythrite Uchigatana","l":115,"c":36427,"t":96,"p":16394}},{"type":"item","id":"20620","obj":{"i":20620,"n":"Nameless Armor Coffer (IL 115)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68096","obj":{"i":68096,"n":"Master Musosai","g":160,"l":"Ul'dah","s":501,"f":1}}]}