{"quest":{"name":"A Fraudster in the Forest","location":"Gridania","id":68099,"patch":4.0,"sort":560,"icon":100682,"unlocksFunction":1,"eventIcon":71341,"issuer":1021869,"target":1021878,"involved":[1000146,1000168,1000184,1001276,1021871,1021872,1021873,1021877,1021879,1021923],"genre":160,"journal":["Musosai is looking for your help to look for Momozigo.","Momozigo has yet to return since leaving earlier, and Musosai worries that he may have fallen prey to evil in the course of seeking it out. Your master bids you help him search for your Lalafell companion; perhaps someone at the aetheryte plaza has seen him.","You learn to your dismay that Momozigo has been apprehended by the Order of the Twin Adder. Musosai, over at the Knot, will wish to know of this without delay.","Neither you nor Musosai can imagine what may have happened to lead to Momozigo's arrest. There is naught to do but seek the answer at the Adders' Nest.","According to Commander Heuloix, Momozigo was wanted in Gridania for the crime of embezzlement, and so was taken into custody on sight. That custody, however, did not last long, and the showmaster has fled into the North Shroud. He was last seen heading in the direction of Proud Creek, a known haunt of the Ixal. You must find your friend before he falls foul of the beastmen.","You arrive just in time to save Momozigo from an angry band of Ixal. The area thus secured, you step forward to offer him a hand.","No sooner do you reach out to Momozigo than he bolts off deeper into the forest. Whatever possessed him to do so, you had best find him again before he crosses the path of more Ixal.","After a brief pursuit, you manage to catch up to Momozigo, who confesses that he kept the payment he received for a canceled performance in order to pay off a debt. Seeing his genuine remorse, Musosai symbolically excises the evil within him. After Momozigo departs to settle affairs with the authorities, Musosai's exertions catch up with him and he spends a moment on his knees. Finding his feet, he reveals to you his other purpose for coming to Eorzea: to hunt down a Hingan fugitive named Kogarashi. For now, however, he bids you strike the matter from your mind, and sets out to join Momozigo at the Knot in Gridania.","Having returned the embezzled money and offered a heartfelt apology, Momozigo has been let off the hook. With that, you may resume your quest to right wrongs, and your little party sets off on its way to snow–swept Ishgard.<br><br>※In order to travel to Ishgard, you must first complete the main scenario quest “Coming to Ishgard.”","Ishgard welcomes you and yours with its customarily frosty embrace. As before, Momozigo shall take the lead in seeking out evil in the city, and Musosai bids you keep your sword arm warm until such time as it is needed.<br><br>※The next samurai quest will be available from Musosai upon reaching level 58."],"objectives":["Gather information at the aetheryte plaza.","Report to Musosai.","Speak with Vorsaile Heuloix.","Look for Momozigo in the North Shroud.","Rescue Momozigo.","Look for Momozigo.","Speak with Momozigo.","Speak with Musosai in Ishgard."],"dialogue":[{"name":"MUSOSAI","text":"Ah, <span class=\"highlight\">Forename</span>. By the strength of your aura, you have clearly kept at your training."},{"name":"MUSOSAI","text":"And in discharging the duty of a samurai in two cities now, you are slowly but surely becoming one in sooth. I hope that our time here will afford you further opportunity to grow."},{"name":"MUSOSAI","text":"By the way, have you not seen Momozigo? He hasn't returned since he left us earlier."},{"name":"MUSOSAI","text":"I worry that he has fallen prey to evil in the course of seeking it out. We should search for him."},{"name":"MUSOSAI","text":"Let us split up and ask the locals. Surely one of them has seen our friend."},{"name":"MUSOSAI","text":"Hmmm, whereto could he have disappeared?"},{"name":"BERNADETTE","text":"A hatted Lalafell...and he's a showmaster, you say? Hm, I recall the face of every adventurer who has passed my post, but I've not seen anyone fitting that description. Sorry I couldn't be of help."},{"name":"OSWOLD","text":"A Lalafell? <span class=\"alternative-container\"><span class=\"alternative\">The fellow</span><span class=\"alternative\">Until you came, the fellow</span></span> dozing off thither is the only one I've seen, I'm afraid. Now, is there aught else I might assist with? Helping you achieve greater intimacy with the elementals, perhaps?"},{"name":"MAISENTA","text":"Forgive me my bluntness, but you are not here with an opportunity for profit? Oh, I suppose it wouldn't hurt to tell you..."},{"name":"MAISENTA","text":"Yes, I did see a Lalafell much like you described. He was in the process of being taken away to the Adders' Nest, though I know not the circumstance."},{"name":"BERNADETTE","text":"I recall the face of every adventurer who has passed my post, but I've not seen anyone resembling your Lalafell. Sorry I couldn't be of help."},{"name":"OSWOLD","text":"<span class=\"alternative-container\"><span class=\"alternative\">The fellow</span><span class=\"alternative\">Until you came, the fellow</span></span> dozing off thither is the only Lalafell I've seen, I'm afraid. Now, is there aught else I might assist with? Helping you achieve greater intimacy with the elementals, perhaps?"},{"name":"MAISENTA","text":"Yes, I did see a Lalafell much like you described. He was in the process of being taken away to the Adders' Nest, though I know not the circumstance."},{"name":"MUSOSAI","text":"...Taken away by the authorities, you say?"},{"name":"MUSOSAI","text":"There must be an explanation. Come, we must go to the Addled Mess at once."},{"name":"MUSOSAI","text":"What in the kami's name could have possibly happened?"},{"name":"VORSAILE","text":"Why, yes, as a matter of fact we did apprehend a Lalafellin showmaster by the name of Momozigo."},{"name":"VORSAILE","text":"He was wanted here in Gridania for embezzlement. 'Twas no large amount of coin, to be sure, but a crime is a crime, and so we took him into custody on sight."},{"name":"VORSAILE","text":"However, that custody didn't last long, for the fellow up and fled when our backs were turned. He was last seen heading into the North Shroud, towards Proud Creek─Ixal-held territory."},{"name":"VORSAILE","text":"We're presently deliberating whether to dispatch a search party, but in light of the risks, I fear that none will be forthcoming. If this Momozigo is your friend, perhaps you might consider searching for him yourselves."},{"name":"MUSOSAI","text":"This bodes ill. Come, <span class=\"highlight\">Forename</span>, we must find Momozigo before he falls foul of these Icky Soles."},{"name":"VORSAILE","text":"Your friend was last seen heading into the North Shroud, towards Proud Creek─Ixal-held territory. In light of the risks, I do not have high hopes that command will dispatch a search party for him. Perhaps you might consider searching for him yourselves."},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"MOMOZIGO","text":"Hilarious, isn't it? Here I am on a heroic quest to punish criminals with you, but all this time I was a criminal myself."},{"name":"MOMOZIGO","text":"I was organizing a concert at the amphitheatre, you see, but the songstress bailed last minute. At that time, I had a huge debt hanging over my head and no way of paying it off."},{"name":"MOMOZIGO","text":"So I ran off with the money I'd collected from advance ticket sales. I knew it was wrong, but I did it anyway. I'm no better than the crooks we've gone after. Will you punish me like you punished them?"},{"name":"MUSOSAI","text":"To betray the people's trust and steal from them is a despicable act. Such evil cannot be suffered!"},{"name":"MUSOSAI","text":"There. The evil in you is excised."},{"name":"MUSOSAI","text":"You have committed a crime, 'tis true, but so too have you dedicated yourself to fighting it. From this moment forth, do you swear to be a changed man and fight always for justice?"},{"name":"MOMOZIGO","text":"I swear, I swear! I'll never do bad things ever again! I may not be able to wield a katana, but I'll fight with you nonetheless!"},{"name":"MUSOSAI","text":"You've not spent all of your recent earnings, I trust? You would do well to return the money you took and beg forgiveness."},{"name":"MUSOSAI","text":"If you apologize from the heart, I see no reason why the aggrieved would not forgive you your transgressions. So go and make amends, and let us continue our quest. We cannot well succeed without you."},{"name":"MOMOZIGO","text":"Th-Thank you, Musosai, <span class=\"highlight\">Forename</span>! I'll go and repay the money and apologize this instant!"},{"name":"MUSOSAI","text":"Hahaha. If Momozigo aspires to evil, he has much and more work to do. As it stands, he has reformed himself and will make no more mischief."},{"name":"MUSOSAI","text":"With that, our work here is done. One fewer evil afflicts the..."},{"name":"MUSOSAI","text":"&lt;huff&gt; That a little jaunt through the forest should tax me so... There is no overcoming old age."},{"name":"MUSOSAI","text":"Yet here I am, come to the other side of the world in the twilight of my years. I journeyed here to find a worthy new pupil, and find <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> I did. But if truth be told, I have one more objective."},{"name":"MUSOSAI","text":"That is, to track down and punish a fugitive from Hingashi, a disgraced samurai known as Kogarashi."},{"name":"MUSOSAI","text":"Mark my words, his is the face of true evil. And it is my solemn charge to strike him down."},{"name":"MUSOSAI","text":"I had the chance to do so before...but I failed. His strength far surpasses mine own. I could not defeat him."},{"name":"MUSOSAI","text":"...Forgive me, I should not burden you with this. Pray dismiss it as but the hollow ramblings of an old man. Come, let us return to the city."},{"name":"MUSOSAI","text":"I'm given cause to doubt whether Momozigo has learned his lesson."},{"name":"VORSAILE","text":"My thanks for settling the matter, and in more ways than one. Momozigo has repaid in full the money he took and expressed his remorse. The complainants are satisfied and have chosen to put this business behind them. Your friend is free to go."},{"name":"MOMOZIGO","text":"Hehe, all is forgiven, and all it took was a bit of money! I can come and go through Gridania as I please again!"},{"name":"MUSOSAI","text":"All debts are settled, then. That is well. Let us move on, to wherever the wind should blow."},{"name":"MUSOSAI","text":"And the wind blows, 'twould seem, to snowcapped mountains. Momozigo, pray lead us there."},{"name":"MOMOZIGO","text":"Right! This way, friends─we're going to Ishgard!"},{"name":"SYSTEM","text":"In order to travel to Ishgard, you must first complete the main scenario quest “Coming to Ishgard.”"},{"name":"MOMOZIGO","text":"Brrr... So c-c-cold... B-B-But the way tavern-g-g-goers look at outsiders is even c-c-colder..."},{"name":"MUSOSAI","text":"Such a breathtaking snowscape. Though each of this land's regions may not change much with the seasons, collectively they are no less colorful than Hingashi."},{"name":"MUSOSAI","text":"Now then, Momozigo and I will set to tracking down injustice in this city. In the meantime, my pupil, pray see to it your sword arm remains warm in this frosty clime."}],"reward":{"gil":1273,"xp":72000},"reqs":{"jobs":[{"lvl":56,"id":111}],"quests":[68098]},"next":[68100]},"partials":[{"type":"npc","id":"1021869","obj":{"i":1021869,"n":"Musosai","l":52,"q":2}},{"type":"npc","id":"1021878","obj":{"i":1021878,"n":"Musosai","l":2300,"q":2}},{"type":"npc","id":"1000146","obj":{"i":1000146,"n":"Bernadette","l":52,"q":4}},{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1000184","obj":{"i":1000184,"n":"Oswold","l":52,"q":1}},{"type":"npc","id":"1001276","obj":{"i":1001276,"n":"Maisenta","l":52,"s":10,"q":2,"t":"Black Rabbit Traders","a":551,"c":[11.53,11.29]}},{"type":"npc","id":"1021871","obj":{"i":1021871,"n":"Musosai","l":52,"q":1}},{"type":"npc","id":"1021872","obj":{"i":1021872,"n":"Musosai","l":52,"q":1}},{"type":"npc","id":"1021873","obj":{"i":1021873,"n":"Momozigo","l":57,"q":1}},{"type":"npc","id":"1021877","obj":{"i":1021877,"n":"Momozigo","l":57,"q":1}},{"type":"npc","id":"1021879","obj":{"i":1021879,"n":"Momozigo","l":2300,"q":3}},{"type":"npc","id":"1021923","obj":{"i":1021923,"n":"Momozigo","l":52,"q":1}},{"type":"quest","id":"68098","obj":{"i":68098,"n":"Blood on the Deck","g":160,"l":"Limsa Lominsa","s":540,"f":1}},{"type":"quest","id":"68100","obj":{"i":68100,"n":"Tears in the Snow","g":160,"l":"Ishgard","s":580,"f":1}}]}