{"quest":{"name":"Gift of the Gob","location":"Ul'dah","id":68090,"patch":4.0,"sort":601,"icon":100693,"unlocksFunction":1,"eventIcon":71341,"issuer":1002298,"target":1019863,"involved":[1002282,1019864,1019865,1019867,1020988,1020989,1020990],"genre":144,"journal":["Adalberta would like to entrust the guild's brightest star with a new job.","Adalberta tells you of a job that has cropped up in Idyllshire that would be just perfect for you. In fact, if you do not do it, then seemingly no one will. You are encouraged to talk to Linette in order to obtain the papers necessary for proving your guild status.","As luck would have it, Linette assumed that you would be taking the job, conveniently preparing your papers ahead of time. She bids you talk with a Lalafell by the name of Nonowato upon your arrival in Idyllshire. Documents in hand, you prepare to leave for the town shared by goblins and men.","Nonowato gladly checks your papers and beckons you to follow him into Stickqix's Bangpots to hear more about his work. It seems that Stickqix is the one in charge around here, despite Nonowato being the one who requested your services.","It quickly becomes evident that Stickqix is no ordinary goblin. Blessed with the gift of the gab, he eloquently explains that he is a gobbie on a mission─an epic one that entails him and his workers pushing the very boundaries of technology to their utmost limits! You are informed that your services are required to procure some rare minerals necessary to build the Gobroller: a machine they hope can someday be used to reclaim the Sharlayan ruins. Nonowato suggests leaving the sweaty confines of the manufactory so he can explain the schedule for the vehicle's construction.","Nonowato reveals that the hard work will begin at a later date; he first needs to identify which minerals are required and how urgently. You elect to call upon him again in the near future.<br><br>※The next miner quest will be available from Nonowato upon reaching level 63."],"objectives":["Speak with Linette.","Present the guild identification papers to Nonowato in Idyllshire.","Speak with Stickqix.","Speak with Nonowato."],"dialogue":[{"name":"ADALBERTA","text":"Ah, <span class=\"highlight\">Forename</span>. I hear you did good work assisting Oschon's Raiders with the mineral survey. The letter of thanks sent to the guild from the Count de Fortemps himself was <span class=\"emphasis\">quite</span> flattering. Then again, that's the kind of praise I would expect for the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who bested Wide Gulley!"},{"name":"ADALBERTA","text":"'Course, that's not to say you can just rest on your laurels now! There's a small manufactory in Idyllshire searching for a miner to help with their work, and I think you'd be perfect."},{"name":"ADALBERTA","text":"Their goal is specific enough that I imagine they'll be wanting you to procure some fairly rare minerals. Honestly, if you don't take the job, I don't know if we have anyone else up to the task. Speak to Linette if you're interested."},{"name":"ADALBERTA","text":"Can't say I've ever been to Idyllshire myself, but you have, haven't you? Your last job there may not have been plain sailing, but you did what was asked of you and did it well. The experience should stand you in good stead."},{"name":"LINETTE","text":"Heading to Idyllshire, are we? Excellent! I took the liberty of preparing your guild papers in advance."},{"name":"LINETTE","text":"The client for this job is a Lalafell by the name of Nonowato. Hand him these documents and he will see to it that you're well briefed on the task at hand. The best of luck to you! "},{"name":"LINETTE","text":"Hand those documents to Nonowato and he will see to it that you're well briefed."},{"name":"NONOWATO","text":"Nonowato? Well, yes, that's me. Is there something I can help you with?"},{"name":"NONOWATO","text":"Oh, you're the one they sent from the Miners' Guild, are you? My apologies, I wasn't expecting you so soon!"},{"name":"NONOWATO","text":"Right, yes, the job! Let me show you to the manufactory. Chief Stickqix is no doubt champing at the bit to explain everything to you."},{"name":"NONOWATO","text":"This is Chief Stickqix, the manufactory foreman!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Would I be correct in assuming you are the miner the guild has sent? Splendid, splendid! 'Tis a pleasure to make your acquaintance."},{"name":"STICKQIX","text":"I run this humble manufactory, leading my workers as we push the very boundaries of technology to their utmost limits!<br>...Would it be terribly rude if I inquired as to why you look quite so shocked?"},{"name":"NONOWATO","text":"I would imagine this is our miner friend's first time meeting a goblin quite as eloquent as you, sir."},{"name":"STICKQIX","text":"Pshhh... Shkohhh...<br>Sharp as ever, my dear Nonowato!"},{"name":"STICKQIX","text":"This line of work frequently requires me to interact with other races, such as yourself, and I frankly found gobbiespeak a ghastly hindrance to busydeals─sorry, business. This spurred me on to work tirelessly to master the common tongue."},{"name":"STICKQIX","text":"After all, when you have chosen to devote your life to pushing the very boundaries of tech─wait, I have already told you this, haven't I? Simply put, we aim to further technology in Eorzea by harnessing the knowledge and expertise of both man and goblin alike."},{"name":"NONOWATO","text":"We requested your help as we find ourselves in need of minerals to aid our work. To be more specific, we're currently in the midst of a certain project..."},{"name":"STICKQIX","text":"No need to be so indirect, young one. That project you speak of is the Gobroller: a vehicle designed to aid our dream of one day reclaiming the Sharlayan ruins! They may be overrun with beasts for the moment, but that shall not stop us from expanding the borders of our beloved Idyllshire!"},{"name":"STICKQIX","text":"Terribly sorry to trouble you, <span class=\"alternative-container\"><span class=\"alternative\">old girl</span><span class=\"alternative\">old boy</span></span>, but do you think you're up to gathering the various minerals we require?"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Terrific! I must admit, I had fretted that you might refuse us for a moment there! Now that we know you are willing, I shall have the team introduce themselves to you."},{"name":"KRYSTRYMM","text":"Name's Krystrymm. I've been tasked with making the Gobroller's armor. Looking forward to working with you, <span class=\"alternative-container\"><span class=\"alternative\">Ms.</span><span class=\"alternative\">Mr.</span></span> Miner."},{"name":"ZANSEI","text":"My name is Zansei and it is a pleasure to make your acquaintance. I have been laboring of late to create the machine's interior. Most excited to see what little delights you bring to our workshop!"},{"name":"FOHCWYDA","text":"I go by Fohcwyda and, together with Krystrymm, have been working to design the armor that will adorn our dear Gobroller. I have to say, for a miner, you look like you can hold your own fairly well. Something tells me we will get along just fine!"},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Gobbie's name is Stackblox, and Stackblox is sweatworking to make Gobroller insides. Uplander's hand-lending is appreciated muchly!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... And I do believe that is everyone! Nonowato will answer any questions you may have pertaining to our work schedule."},{"name":"NONOWATO","text":"As the chief says, I am the one in charge of managing this project─one of the perks of being his number one apprentice! At any rate, I feel this is a conversation best continued outside; Krystrymm said it best when he described the manufactory as being hotter than Ifrit's bottom!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Words fail to express just how relieved I am to have your help, noble miner. We shall achieve great things together, mark my words!"},{"name":"KRYSTRYMM","text":"Now that I think of it, I'm certain I've heard your name somewhere before. Yes, a legendary miner that just so happens to be an equally legendary adventurer. If you're even half as good as the stories, I'm sure we'll have no cause to regret hiring you."},{"name":"ZANSEI","text":"Thrilled to pieces to have you here, friend! You may find us to be a somewhat eccentric bunch, but I am sure you will come to enjoy our company in due course. My advice: enjoy the journey─we are on the verge of <span class=\"emphasis\">greatness</span>!"},{"name":"FOHCWYDA","text":"It is truly quite amusing. Just as I had been wishing we had someone else to help realize our vision, you appeared! Just to check, you <span class=\"emphasis\">are</span> positive you cannot read minds, yes?"},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Plenty of rocks in Stickqix's Bangpots, but Stackblox needs uplander to mine more!"},{"name":"NONOWATO","text":"Ah, much nicer out here, don't you think? Well, that's about everything I had planned for today. I do hope you enjoyed meeting everyone; work will start properly the next time you are able to visit."},{"name":"NONOWATO","text":"In the meantime, I'll be keeping busy organizing a list of which minerals we require most urgently. Make sure to keep your pickaxe nice and sharp!"},{"name":"SYSTEM","text":"The next miner quest will be available from Nonowato upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1406,"items":[{"num":250,"id":8},{"num":250,"id":11},{"num":3,"id":12668}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":17}],"questsType":"all","quests":[67620,67895]},"next":[68091]},"partials":[{"type":"npc","id":"1002298","obj":{"i":1002298,"n":"Adalberta","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1019863","obj":{"i":1019863,"n":"Nonowato","l":2082,"q":5}},{"type":"npc","id":"1002282","obj":{"i":1002282,"n":"Linette","l":41,"q":4,"t":"Guild Receptionist"}},{"type":"npc","id":"1019864","obj":{"i":1019864,"n":"Stickqix","l":2082,"q":4}},{"type":"npc","id":"1019865","obj":{"i":1019865,"n":"Stackblox","l":2082,"q":5}},{"type":"npc","id":"1019867","obj":{"i":1019867,"n":"Nonowato","l":2082,"q":5}},{"type":"npc","id":"1020988","obj":{"i":1020988,"n":"Krystrymm","l":2082,"q":5}},{"type":"npc","id":"1020989","obj":{"i":1020989,"n":"Zansei","l":2082,"q":5}},{"type":"npc","id":"1020990","obj":{"i":1020990,"n":"Fohcwyda","l":2082,"q":5}},{"type":"item","id":"12668","obj":{"i":12668,"n":"Commercial Survival Manual","l":1,"c":26152,"t":63}},{"type":"quest","id":"67620","obj":{"i":67620,"n":"The Hole Truth","g":144,"l":"Ishgard","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68091","obj":{"i":68091,"n":"Thick Skin","g":144,"l":"Idyllshire","s":630,"f":1}}]}