{"quest":{"name":"Master Musosai","location":"Ul'dah","id":68096,"patch":4.0,"sort":501,"icon":100682,"unlocksFunction":1,"eventIcon":71341,"issuer":1023637,"target":1021835,"genre":160,"journal":["Musosai regards you with a piercing gaze.","Having expressed his approval at your transformation into a samurai, Musosai bids you make your final preparations for your duel. A word from you, and it begins.","No sooner are you introduced to the crowd than Beroald, the gladiator whom Musosai earlier thrashed, disrupts the proceedings and demands a rematch. Unimpressed, Musosai calmly cuts his sword in half and sends him fleeing as quickly as he appeared. With that distraction out of the way, you square off against the elderly Hingan and succeed in besting him, though you get the sense that he held back. Nonetheless, Musosai heaps ample praise upon you and offers you your reward: training in the way of the samurai. Before you can form a response, however, Beroald disrupts the proceedings yet again, and this time he has brought friends. Believing you more than capable, Musosai leaves you to attend the uninvited guests, which you handily do. In desperation and frustration, Beroald turns his fury upon Musosai, only to be sent sprawling by the old man. With that, your eventful challenge comes to an end.","Back at the Gladiators' Guild, Musosai confesses that his purpose for coming to Ul'dah and taking on challengers was in order to find a worthy new pupil. And find one he did─in you. You accept the offer, much to his delight and relief, and without further ado your training begins, amid the buzzing and bustle of the Quicksand.","Musosai recounts to you a period of strife in Hingan history, the Age of Blood, and how it led to the birth of the samurai. A samurai's calling, he explains, is to seek out the wicked and bring them to account, that such a tragedy may never be repeated. To that end, you will journey the land on a quest to right wrongs, and in so doing walk the path towards mastery of your art. As Musosai declares his intent to begin this quest in Ul'dah, the silver-tongued showmaster, Momozigo, arrives and offers to assist you on your quest. Until such time as they identify a likely evil to excise, Musosai bids you continue honing your newfound skills.<br><br>※The next samurai quest will be available from Musosai upon reaching level 52."],"objectives":["Speak with Musosai.","Speak with Musosai at the Quicksand.","Defeat Musosai!","Defeat Beroald!"],"dialogue":[{"name":"MUSOSAI","text":"Ah, yes, in your gaze I see the stirrings of a newborn samurai. 'Tis plain the stone has already bequeathed some of its memories unto you."},{"name":"MUSOSAI","text":"Yet having the memories is one thing, mastering them quite another. We shall see how well you fare against me. Prepare yourself, young samurai; we begin as soon as you are ready."},{"name":"SYSTEM","text":"You have learned all samurai actions and traits to level 50. Detailed descriptions can be viewed in the <span class=\"highlight\">Actions & Traits</span> window, accessed under <span class=\"highlight\">Character</span> in the main menu."},{"name":"MUSOSAI","text":"You are ready, then? Good, good, let us take to the arena."},{"name":"MOMOZIGO","text":"(-Silver-tongued Showmaster-)Gather ye 'round and bear witness, for another brave challenger has appeared! Next to face Musosai, swordmaster of the Far East, we have...an itinerant adventurer!"},{"name":"BEROALD","text":"(-???-)Hold it right there!"},{"name":"BEROALD","text":"(-???-)No one gets to take down that old bastard 'cept me, Beroald the Last Standing! Scourge of the Sands!"},{"name":"BEROALD","text":"You made a fool of me earlier, but this time there'll be no tricks! This time I fight with my own sword, not that pathetic excuse for a needle you handed me!"},{"name":"MOMOZIGO","text":"(-Silver-tongued Showmaster-)What's this? Boneheaded Beroald, who was so roundly trounced but moments ago, has invaded the bloodsands!"},{"name":"MOMOZIGO","text":"(-Silver-tongued Showmaster-)For those who came in late, he's the disgraced gladiator who was cast out of the Coliseum for─and I paraphrase─being an all-round odious brute!"},{"name":"MUSOSAI","text":"The rules were plain, and you agreed to them. There were no tricks."},{"name":"BEROALD","text":"Shut your mouth and fight me again!"},{"name":"MUSOSAI","text":"Such eagerness for blood. The warriors of this land are as naked blades."},{"name":"BEROALD","text":"I-I'll get you next time!"},{"name":"MUSOSAI","text":"And with that distraction out of the way, we may continue where we left off."},{"name":"MUSOSAI","text":"To draw forth such strength from the stone in so short a time... You are no ordinary <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>."},{"name":"MUSOSAI","text":"As promised, I shall bestow upon you the rarest of Hingan treasures: training in the way of the samurai!"},{"name":"MUSOSAI","text":"What is the matter? Our techniques are not found in this land, hence their great worth."},{"name":"MUSOSAI","text":"As my pupil, you would train under my watchful eye and learn even the most puissant of my techniques."},{"name":"BEROALD","text":"(-Familiar Voice-)Why, you lying bastard!"},{"name":"BEROALD","text":"All that fighting and there wasn't even any coin in it!?"},{"name":"MOMOZIGO","text":"(-Silver-tongued Showmaster-)What's this!? Boneheaded Beroald is back, and this time he's brought friends! This man doesn't know when to give up!"},{"name":"BEROALD","text":"You got a problem, come down here and say it!"},{"name":"MUSOSAI","text":"At no point was it said that the treasure is an object, let alone coin. Besides, winning it was well beyond you."},{"name":"BEROALD","text":"Shut the hells up! This time, I'll show you my true strength!"},{"name":"MUSOSAI","text":"Your strength lies in numbers, 'twould seem. Very well, if you insist on another trouncing, then so be it. But know that this time 'tis not I who will deal it, but my pupil."},{"name":"MUSOSAI","text":"Having seen your potential firsthand, he and his ilk ought not pose you any trouble."},{"name":"BEROALD","text":"Whoever <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is, take care of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, too!"},{"name":"MUSOSAI","text":"Forgive me, I know it was wrong to force that fight upon you. And yet I find I do not regret having done so, for it has reaffirmed beyond any doubt the promise I had glimpsed in you."},{"name":"MUSOSAI","text":"Long did I search in my native land for a pupil, but I found none fit to be a vessel for my knowledge. The problem, I concluded, lay in my people's way of thinking─the zeal with which they uphold tradition to the detriment of all else."},{"name":"MUSOSAI","text":"So it was that I set forth for a new land, this Heir's Ear. I placed myself in the midst of your most able swordsmen, offering myself up as a spectacle in hopes of finding a worthy soul."},{"name":"MUSOSAI","text":"And find <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> I did─in you. Now, I realize how all this may appear. To you, I could be but a strange old fool spouting nonsense, but I am well past caring about appearances."},{"name":"MUSOSAI","text":"I speak with all earnesty when I say that there is none other into whom I would pour my knowledge. And so I ask you, will you consent to being my pupil?"},{"name":"Q1","text":"Become Musosai's pupil?"},{"name":"MUSOSAI","text":"Ahhh, words cannot well express my joy! From this moment on, we are master and student!"},{"name":"MUSOSAI","text":"To come so close yet fall short... But I am not one to give up so easily. Nay, I shall remain planted to this very spot in the hopes that you will reconsider!"},{"name":"MUSOSAI","text":"Now then, I would know your name. By what are you called?"},{"name":"MUSOSAI","text":"<span class=\"highlight\">Forename</span>... 'Tis a fine name. Without further ado, <span class=\"highlight\">Forename</span>, we shall commence your training. Pray join me at the nearby tavern─the Slick Hand."},{"name":"MUSOSAI","text":"I shall begin at the very beginning. In the distant past, Hingashi underwent a period of strife, during which numerous opposing factions vied for supremacy: the Age of Blood."},{"name":"MUSOSAI","text":"In this age, full many took to battle with katana in hand, and in the crucible of war our art was forged─the way of the samurai."},{"name":"MUSOSAI","text":"Eventually, the realm was unified under one banner and peace reigned once more. The people set aside their katana, save for we samurai, who continue to wield it as symbol of authority. And with that authority comes a grave responsibility: protecting the peace."},{"name":"MUSOSAI","text":"To ensure that the Age of Blood is never repeated, we samurai seek out the wicked and bring them to account. In so doing, we ward off chaos and preserve order in the realm. Such is our calling."},{"name":"MUSOSAI","text":"Hingashi or Heir's Ear, it matters not where we are; this calling guides us always. To that end, we shall journey the land, you and I, on a quest to right wrongs. As one who has grasped the foundations of our art, it is your surest path to mastery."},{"name":"MUSOSAI","text":"Our efforts begin in this very city. I shall cast about for evil that has taken root here, and then we may proceed to excise it."},{"name":"MOMOZIGO","text":"(-Silver-tongued Showmaster-)Well now, that certainly got exciting quick! But with some even quicker thinking, I managed to set up a wager and turn a tidy profit!"},{"name":"MUSOSAI","text":"Momozigo, I owe you a debt of gratitude. Thanks to you, I have found my pupil at long last. I pray that you will live comfortably with your winnings."},{"name":"MOMOZIGO","text":"Actually, I had a mind to join you; wherever you go, I sense that coin will follow. And besides, it seems you're planning to root out evil in our fair city?"},{"name":"MOMOZIGO","text":"If so, you'd do well to have me along. With my connections, I can procure the information you're like to need. Then there's the small matter of your complete and utter lack of knowledge of Eorzea."},{"name":"MUSOSAI","text":"There is that, indeed. Had fate not seen fit to unite us, I never would have found my way here from Fester Bay."},{"name":"MOMOZIGO","text":"And I wouldn't be standing here breathing! If anyone owes anything, it's me. You saved me from those cutthroat bandits when I tried recruiting them for the Coliseum. Terribly reckless in hindsight..."},{"name":"MOMOZIGO","text":"As for you, my friend─to be marked out by old Musosai himself, you must be made of uncommon stuff indeed. Not to put the pressure on, but I have the highest hopes for you!"},{"name":"MUSOSAI","text":"And here we are, then. I shall undertake my search with Momozigo's help. Until such time as there are developments, pray continue honing your newfound skills."},{"name":"MOMOZIGO","text":"It begins! How will this challenger fare against the enigmatic elder?"},{"name":"MUSOSAI","text":"Now then, let us see how well you wield the katana."},{"name":"MUSOSAI","text":"Come at me with all your might."},{"name":"MUSOSAI","text":"There is no need to hold back."},{"name":"MUSOSAI","text":"The stone harbors the techniques of the samurai. You must draw them forth."},{"name":"MUSOSAI","text":"Well! To master such an advanced technique so quickly!"},{"name":"MUSOSAI","text":"Impressive! A technique born of arduous trials, yet you've already made it your own!"},{"name":"MUSOSAI","text":"Yes! Let your blade steep in strength ere you unleash it!"},{"name":"MUSOSAI","text":"That will do. Victory is yours, young one."},{"name":"MOMOZIGO","text":"And the challenger wins!"},{"name":"MOMOZIGO","text":"Oh, dear, this isn't in the script! The duel has become a free-for-all, and it's the challenger against all!"},{"name":"BEROALD","text":"No one makes a fool of me in my Coliseum!"},{"name":"BEROALD","text":"Feather <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>! The so-called pupil!"},{"name":"BEROALD","text":"Bloody hopeless, the lot of you!"},{"name":"MUSOSAI","text":"Let's see how your puny sword fares against an axe or two!"},{"name":"BEROALD","text":"Bah, if you want something done right..."},{"name":"BEROALD","text":"No one beats me in my Coliseum! <span class=\"emphasis\">No one</span>!"},{"name":"MOMOZIGO","text":"Oho, Beroald joins his own fight! <span class=\"emphasis\">Finally</span>!"},{"name":"MOMOZIGO","text":"Student samurai versus grizzled gladiator! Who will prevail in this clash between good and ugly?"},{"name":"BEROALD","text":"S-Sod this! I'm gonna make you hurt, old man, if it's the last thing I do! Yaaaaaargh!"},{"name":"MUSOSAI","text":"...You are done? Then allow me."},{"name":"MUSOSAI","text":"Hahaha, not even worth drawing my blade. Well fought, young one. I have seen all I need to see."},{"name":"MOMOZIGO","text":"And the winner is the challenger! What fearsome fighters, these samurai! Let's give <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> a rousing applause!"},{"name":"MUSOSAI","text":"Hmmm, mayhap I misjudged..."}],"reward":{"gil":1502,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":111}],"quests":[68095]},"next":[68097]},"partials":[{"type":"npc","id":"1023637","obj":{"i":1023637,"n":"Musosai","l":41,"q":1}},{"type":"npc","id":"1021835","obj":{"i":1021835,"n":"Musosai","l":40,"q":2}},{"type":"quest","id":"68095","obj":{"i":68095,"n":"The Way of the Samurai","g":160,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"68097","obj":{"i":68097,"n":"The Sands of Debt","g":160,"l":"Ul'dah","s":520,"f":1}}]}