{"quest":{"name":"Where the Money Takes You","location":"Idyllshire","id":68093,"patch":4.0,"sort":680,"icon":100693,"unlocksFunction":1,"eventIcon":71341,"issuer":1019863,"target":1019863,"involved":[1012097,1013713,1019865,1019867,1020988,1020989,1020990],"genre":144,"usedItems":[17943],"journal":["Nonowato finds himself in a bit of a financial pickle.","A troubled Nonowato informs you that he has forgotten to reimburse Rowena for some materials she procured at his request. Rowena has also personally asked for your help with a job of her own by way of an apology. Agreeing to help Nonowato in his hour of need, you brace yourself for a meeting with Rowena at her Center for Cultural Promotion.","Rowena receives quite a surprise when she realizes that the miner she has heard so much of is none other than the Warrior of Light. However, she soon brushes this initial distraction aside to get down to business: you are to mine twenty chunks of serpentine for her. Request received, you set off to make amends for Nonowato's error.","You deliver the serpentine to Rowena as requested and she furnishes you with Nonowato's order: a set of research materials. Before you leave for the Bangpots, she remarks that it has been quite some time since she last saw Stickqix. Apparently the manufactory chief stops by fairly often to check on his orders, but has not done so of late.","Nonowato is just about at his wit's end when you finally deliver the research materials to him. After making a not-so-subtle attempt at pretending all is well with the project, he confesses that Stickqix has gone missing. With your input, Nonowato concludes that the chief has likely gone to see Slowfix for advice on the project, and suggests that you seek out the goblin.","Slowfix regrettably has no information as to Stickqix's whereabouts, but he is able to tell you something else of note. The knowledgeable goblin fills you in on Stickqix's past, just why he decided to come to Idyllshire, and about the dream that led to the creation of his manufactory. Having heard this, Nonowato resolves to head back to the Bangpots and reinvigorate the workers there.","Nonowato explains to the Bangpots workers just why their esteemed chief has deserted them. He follows up by stressing the need for cooperation to the team, explaining that it is the only chance they have of completing work on the Gobroller without Stickqix's guidance. All come to realize the error of their ways, vowing to finish their work, whilst aiding their colleagues. Nonowato bids you join him outside to discuss the remainder of your own work.","Nonowato informs you that the next task he gives you will likely be your last. You prepare yourself for one final push, knowing that the Gobroller's completion draws near.<br><br>※The next miner quest will be available from Nonowato upon reaching level 70."],"objectives":["Speak with Rowena.","<span class=\"alternative-container\"><span class=\"alternative\">Mine serpentine</span><span class=\"alternative\">Deliver the chunks of serpentine to Rowena</span></span>.","Deliver the research materials to Nonowato.","Speak with Slowfix.","Speak with Nonowato in Stickqix's Bangpots.","Speak with Nonowato."],"dialogue":[{"name":"NONOWATO","text":"I'm late, I'm late!"},{"name":"NONOWATO","text":"Oh, I, um, hello there, <span class=\"highlight\">Forename</span>! Sorry, you've caught me at a bit of a bad time. Are you familiar with Rowena? Well, um, not quite sure how it happened but...I've forgotten to pay her for a job!"},{"name":"NONOWATO","text":"I've been so busy of late, it completely slipped my mind! Mercifully, she is not demanding any extra coin for the delay─instead, she has requested help with a job of her own. In fact, if I don't cooperate, she says she won't give me the goods I had her procure for me in the first place..."},{"name":"NONOWATO","text":"What's more, she wants <span class=\"emphasis\">you</span> of all people to carry out this task! I haven't a clue who, but someone told her that a skilled miner had been seen frequenting Stickqix's Bangpots of late."},{"name":"NONOWATO","text":"I hate to press this upon you, but please...I beg of you, help Rowena in my stead!"},{"name":"NONOWATO","text":"I feel truly awful for putting you in this position, but I have no one else to whom I can turn! Please help her procure the ore she desires."},{"name":"KRYSTRYMM","text":"Why in the bleeding hells didn't he say anything to us?"},{"name":"ZANSEI","text":"Well, I think it is safe to say we are positively doomed!"},{"name":"FOHCWYDA","text":"Would it have been so hard for him to at least leave us a letter?"},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Stackblox wants to find out what happened. Was it Stackblox's fault?"},{"name":"ROWENA","text":"Well, I'll be. Never did I expect that the miner wanderin' around the Bangpots would turn out to be the one an' only <span class=\"highlight\">Forename Surname</span>."},{"name":"ROWENA","text":"Do you just like the feel of a pickaxe in your hand, or are you truly that desperate for coin? None of my business, I suppose."},{"name":"ROWENA","text":"Anyroad, as Nonowato may have told you, you're to bring me some serpentine. An' you can go ahead an' tell him that I expect this to be the last time he gives me any trouble!"},{"name":"ROWENA","text":"Oh, and I suppose I ought to tell you that you won't find it anywhere save in Yanxia, in the Far East. Precisely why it fetches such a pretty price here in Eorzea."},{"name":"ROWENA","text":"Bring me twenty of 'em and you can tell Nonowato that we're square."},{"name":"NONOWATO","text":"Whatever am I supposed to do?"},{"name":"ROWENA","text":"I expect twenty chunks of serpentine. Twenty, you hear me?"},{"name":"ROWENA","text":"Ah, good <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! Well, you've held up your end o' the bargain. Here's what Nonowato was after."},{"name":"ROWENA","text":"Thanks for that. A good bit of business. Still a bit puzzled as to what's goin' on at Stickqix's Bangpots, mind you. I've worked with them for some time now and never had any trouble gettin' compensated for my services before."},{"name":"ROWENA","text":"Now that I think on it, I haven't seen much of Stickqix lately. He tends to stop by every now an' then to check the quality of orders and the like, but I can't remember for the life of me the last time he came here."},{"name":"ROWENA","text":"Thanks for that, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. An' do see that Nonowato gets his order. Knowin' him, he's probably been frettin' over it ever since he sent you."},{"name":"NONOWATO","text":"Ah, <span class=\"highlight\">Forename</span>! Please, put me out of my misery. How did it go?"},{"name":"NONOWATO","text":"Oh, thank heavens! With this, we can continue our work on the Gobroller. Well, I suppose since there are no other pressing issues at this point in time..."},{"name":"NONOWATO","text":"No. I cannot in good conscience lie to someone who has helped me so much. Allow me to apologize to you, <span class=\"highlight\">Forename</span>. It is high time I apprised you of the current state of our work."},{"name":"NONOWATO","text":"For a while now the project has been at a standstill. And, before you jump to any conclusions, this has nothing to do with quarrels breaking out between our workers. No, it is much more serious. Chief Stickqix is...missing."},{"name":"NONOWATO","text":"I have tried and tried to ascertain his whereabouts, but no one has been able to help. I don't suppose you have heard anything?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Everyone's bickering had him at the end of his tether."},{"name":"A1","text":"He said something about visiting Slowfix."},{"name":"NONOWATO","text":"He was worried by the recent infighting, you say? Oh, Chief...it is all my fault."},{"name":"NONOWATO","text":"If that's the case, he may have gone to ask someone for advice on how to improve things! What's more, that same someone could know where he is!"},{"name":"NONOWATO","text":"I can only think of one person─by which I mean goblin─that the chief would go to advice for: Slowfix! Come along, <span class=\"highlight\">Forename</span>, let us seek him out!"},{"name":"NONOWATO","text":"He went to Slowfix for advice, you say? What on earth could he...ah, but of course. He must have sought him out to discuss all the recent bickering between the manufactory workers."},{"name":"NONOWATO","text":"It really matters not why he went to speak with him. What's important is finding out if Slowfix knows just where the chief is."},{"name":"NONOWATO","text":"As we have no other clues at this moment, I suggest we seek out Slowfix posthaste! Come along, <span class=\"highlight\">Forename</span>!"},{"name":"NONOWATO","text":"I do hope that Slowfix knows something of use. If not, I honestly have no idea where to search..."},{"name":"KRYSTRYMM","text":"Worried about the chief? That makes two of us, <span class=\"highlight\">Forename</span>. Just where in the world has he run off to?"},{"name":"ZANSEI","text":"So, you have heard about the chief. Even the most noble of revolutions are doomed to fail without a strong leader. I do hope ours returns soon."},{"name":"FOHCWYDA","text":"I have searched tirelessly for the chief, but to no avail. Detective work has never exactly been my forte, I must be honest."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... No Stickqix gives Stackblox the shiveryshakes!"},{"name":"NONOWATO","text":"Ah, Mr. Slowfix! I was wondering if you might have the time to answer a few questions of mine?"},{"name":"SLOWFIX","text":"Pshhh... Shkohhh... Slowfix has no need to trade tongueflaps to guess what knowings uplanders want. Uplanders would have Slowfix explain where Stickqix went, yes?"},{"name":"NONOWATO","text":"You know the chief's whereabouts!?"},{"name":"SLOWFIX","text":"Slowfix has lots of knowings but not those ones. Stickqix had the shiveryshakes as his workers trade fists instead of tongueflaps!"},{"name":"SLOWFIX","text":"Stickqix used to be one of the Illuminati. But as they became crazier and crazier, he chose to run away from the bad gobbies!"},{"name":"SLOWFIX","text":"Coming to Idyllshire─home to both gobbies and uplanders─Stickqix was sure he had made the right decision. Told Slowfix that this was his dream!"},{"name":"SLOWFIX","text":"Stickqix made Bangpots so uplanders and gobbies can sweatwork together for a bright future! Slowfix would have workers keep this in their braincases. "},{"name":"NONOWATO","text":"...I shall talk to everyone about this. You have my word."},{"name":"NONOWATO","text":"I would greatly appreciate your presence when I do, <span class=\"highlight\">Forename</span>. Pray, come with me to the manufactory once more."},{"name":"SLOWFIX","text":"Pshhh... Shkohhh... Eastwise? Westwise? Slowfix does not know where Stickqix went. But Slowfix thinks uplanders should keep his dream in their braincases."},{"name":"NONOWATO","text":"You have no idea how reassuring your presence is, <span class=\"highlight\">Forename</span>. Wait a moment while I gather the others."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Why does Nonowato summon Stackblox?"},{"name":"NONOWATO","text":"I have asked you all to lend me your ears as I wish to share what we have found out about the chief's disappearance."},{"name":"FOHCWYDA","text":"In short, you are saying that the chief's desertion is down to <span class=\"emphasis\">us</span>?"},{"name":"ZANSEI","text":"It is the end of the world as we know it. And yet, I cannot criticize the chief's actions. We have tested his patience time and time again."},{"name":"KRYSTRYMM","text":"It's hard to believe, but our own bickering has destroyed the very dream we came together to make a reality. We're nothing without the chief's guiding hand."},{"name":"NONOWATO","text":"Are you of the same mind, <span class=\"highlight\">Forename</span>?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"The Gobroller can be finished without the chief."},{"name":"A2","text":"Krystrymm is right, the Gobroller is done for."},{"name":"A2","text":"..."},{"name":"NONOWATO","text":"Quite right! However, we first need to change our approach. Only then can we continue the project that Stickqix started."},{"name":"NONOWATO","text":"I suppose you are correct. We can't hope to continue work on the Gobroller as things stand. It is up to us to change─only then will we be able to finish this project!"},{"name":"NONOWATO","text":"Quite right, it was silly of me to even ask. It goes without saying that the Gobroller must be completed! But first, we must change our approach to the project."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Nonowato's words excite Stackblox! The time has come to finish the Gobroller!"},{"name":"ZANSEI","text":"Nonowato, the fire in your heart is infectious! But tell me, just what do you mean when you say we must change?"},{"name":"NONOWATO","text":"We need to focus on working together as a team, not as a collection of individuals!"},{"name":"NONOWATO","text":"I myself know just how easy it is to get caught up in matters that only concern oneself. For the duration of this project, I have consistently relied on <span class=\"highlight\">Forename</span>'s help and done nothing of note. But that ends today! As of this moment, we are a team in the truest sense of the word."},{"name":"NONOWATO","text":"This, I am convinced, is the key to finishing the Gobroller as well as continuing our work long into the future! The chief would no doubt say the exact same were he here today."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Stackblox backthinks to Stickqix saying the same thing. The impossible is possible if we help each other."},{"name":"FOHCWYDA","text":"Yes, quite an idea! My eyes were once clouded, but now they are perfectly clear."},{"name":"KRYSTRYMM","text":"It'll go some way towards making up for us disappointing the chief too!"},{"name":"ZANSEI","text":"This is it! At last, the revolution I have been waiting for!"},{"name":"NONOWATO","text":"We know what we must do. Let us finish what we started, for the chief!"},{"name":"NONOWATO","text":"<span class=\"highlight\">Forename</span>, if you have the time, let us speak outside."},{"name":"KRYSTRYMM","text":"Young Nonowato's words have removed all confusion from my mind! I was so caught up in my own little world that I didn't stop even once to think of the meaning behind our work. It's time to get serious."},{"name":"ZANSEI","text":"Sorry for how long it has taken to sort ourselves out, <span class=\"highlight\">Forename</span>. But do not worry, it will all have been worth it when you are able to feast your eyes on our glorious Gobroller! Please continue to lend us your pickaxe until that time comes."},{"name":"FOHCWYDA","text":"It is all well and good just throwing yourself head first into your work, but we really could have done with being a bit more flexible. I should have listened to my own words when I complained about Krystrymm refusing to adapt to a different way of thinking. My apologies for involving you, <span class=\"highlight\">Forename</span>."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Stackblox should have done more hand-lending for the others. Stackblox won't make the same mistake twice!"},{"name":"NONOWATO","text":"Thank you for everything, <span class=\"highlight\">Forename</span>. The chief may still be missing, but my faith in our workers has never been stronger!"},{"name":"NONOWATO","text":"There's one last job I would have you do when you feel ready. That should provide us with everything we need to finally finish this project!"},{"name":"SYSTEM","text":"In breaking new ground as a miner, you have learned “Bountiful Yield II”!"}],"reward":{"gil":2950,"action":272,"items":[{"id":19567},{"num":3,"id":12669},{"id":5688,"one":1},{"id":5693,"one":1},{"id":5698,"one":1}],"xp":2902500},"reqs":{"jobs":[{"lvl":68,"id":17}],"quests":[68092]},"next":[68094]},"partials":[{"type":"npc","id":"1019863","obj":{"i":1019863,"n":"Nonowato","l":2082,"q":5}},{"type":"npc","id":"1012097","obj":{"i":1012097,"n":"Slowfix","l":2082,"q":15}},{"type":"npc","id":"1013713","obj":{"i":1013713,"n":"Rowena","l":2082,"q":4}},{"type":"npc","id":"1019865","obj":{"i":1019865,"n":"Stackblox","l":2082,"q":5}},{"type":"npc","id":"1019867","obj":{"i":1019867,"n":"Nonowato","l":2082,"q":5}},{"type":"npc","id":"1020988","obj":{"i":1020988,"n":"Krystrymm","l":2082,"q":5}},{"type":"npc","id":"1020989","obj":{"i":1020989,"n":"Zansei","l":2082,"q":5}},{"type":"npc","id":"1020990","obj":{"i":1020990,"n":"Fohcwyda","l":2082,"q":5}},{"type":"action","id":"272","obj":{"i":272,"n":"Bountiful Yield II","c":1035,"j":16,"t":6,"l":68}},{"type":"item","id":"19567","obj":{"i":19567,"n":"Doman Steel Sledgehammer","l":260,"c":38062,"t":29,"p":37065}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"item","id":"5688","obj":{"i":5688,"n":"Gatherer's Guerdon Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Gathering","category":2}}},{"type":"item","id":"5693","obj":{"i":5693,"n":"Gatherer's Guile Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Perception","category":2}}},{"type":"item","id":"5698","obj":{"i":5698,"n":"Gatherer's Grasp Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":6,"attr":"GP","category":2}}},{"type":"item","id":"17943","obj":{"i":17943,"n":"Serpentine","l":285,"c":21469,"t":48}},{"type":"quest","id":"68092","obj":{"i":68092,"n":"Pedal to the Metal","g":144,"l":"Idyllshire","s":650,"f":1}},{"type":"quest","id":"68094","obj":{"i":68094,"n":"A Miner Success","g":144,"l":"Idyllshire","s":700,"f":1}}]}