{"quest":{"name":"Pedal to the Metal","location":"Idyllshire","id":68092,"patch":4.0,"sort":650,"icon":100693,"unlocksFunction":1,"eventIcon":71341,"issuer":1019863,"target":1019863,"involved":[1019864,1019865,1019866,1019867,1020988,1020989,1020990],"genre":144,"usedItems":[17942],"journal":["Nonowato longs to live in a world where he is able to simply ask you to do some mining.","Nonowato greets you once again by dangling the prospect of a mining job in front of you before cruelly snatching it away. It seems yet another fight has broken out at the Bangpots and Stickqix would appreciate your help. You hurry to the manufactory with Nonowato to see exactly what is going on.","You find Stickqix in the midst of longing for simpler times when his work was seldom interrupted by infighting. He explains that Stackblox and Zansei have been arguing over the design of the Gobroller's controls. You agree to play mediator once more and go to talk with the two workers.","If there is one thing Stickqix's workers are not lacking, it is passion. Zansei and Stackblox have been locked in a heated debate about whether the Gobroller's controls should be made to accommodate men or goblins. Having ascertained their respective positions, you are now ready to fill Stickqix in on the situation.","You explain the cause of the quarrel to Stickqix and he asks that you obtain feather iron ore on his behalf. You are told that his merchant friend will be able to explain where you are to begin the search. You head for the Hard Place wondering just who Stickqix's friend is exactly.","After arriving at the Hard Place you are greeted by a familiar gobbieface, one that has helped you before. Remembering your past favor, the goblin merchant tells you the location of the mineral you seek free of charge. You prepare yourself for the long journey to Hells' Lid all in the good name of technological innovation.","Stickqix shows the minerals he requested to Zansei and Stackblox in the hope that it might get their creative juices flowing. Sadly, neither of them are able to grasp what he is suggesting and Stickqix is forced to spell things out: Zansei and Stackblox must work together using the fruits of your labor to create controls which suit all races.","You speak with Stickqix once more. He has been troubled enough by the recent disharmony that he is considering asking an old friend, Slowfix, for advice on how to proceed. Not wishing to weigh you down with such heavy thoughts, he bids you head outside and join Nonowato, who has been patiently waiting for you.","Nonowato thanks you again for your efforts while apologizing that he was unable to do more himself. He suggests you use the time you have before the next job to rest up and hone your mining skills.<br><br>※The next miner quest will be available from Nonowato upon reaching level 68."],"objectives":["Speak with Stickqix.","Speak with Zansei.","Speak with Stackblox.","Speak with Stickqix.","Speak with the goblin merchant.","<span class=\"alternative-container\"><span class=\"alternative\">Mine feather iron ore in Hells' Lid</span><span class=\"alternative\">Deliver the chunks of feather iron ore to Stickqix</span></span>.","Speak with Stickqix.","Speak with Nonowato."],"dialogue":[{"name":"NONOWATO","text":"<span class=\"highlight\">Forename</span>, the time has come for your next mining job.<br>...Is what I would be saying to you right now if we lived in a perfect world."},{"name":"NONOWATO","text":"Yet another fight has broken out in the manufactory. Hurry, we've wasted enough time already!"},{"name":"NONOWATO","text":"The chief can explain the situation much better than I!"},{"name":"KRYSTRYMM","text":"Just as work on the armor was starting to pick up, someone else had to go and start a fight."},{"name":"ZANSEI","text":"That blasted goblin girl understands nothing! Nothing, you hear me!?"},{"name":"FOHCWYDA","text":"I wonder if this infernal heat has anything to do with the frequent fights of late... Do not misunderstand me, they can beat each other to a pulp for all I care, but I would rather they did it in their own time."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Zansei is too addlebrained to sweatwork with Stackblox! Stackblox has the best knowings to fancycraft Gobroller insides!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Ah, adventurer. I was just recalling a time when my work used to be so enjoyable, absent of any petty squabbles."},{"name":"STICKQIX","text":"Alas, that was long ago. My workers are at it once again. This time it's Zansei and Stackblox who are quarreling over the Gobroller's controls."},{"name":"STICKQIX","text":"Oh, my braincase aches so..."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... My apologies. I have a nasty habit of slipping back into gobbiespeak when vexed."},{"name":"STICKQIX","text":"I am ashamed to ask this of you once more, but could you talk to the two of them? You did great work before and I cannot think of any other way to solve this."},{"name":"STICKQIX","text":"Talk to Zansei and Stackblox and see if you cannot get to the bottom of what's ailing them."},{"name":"NONOWATO","text":"We're so sorry for dragging you into this a second time!"},{"name":"ZANSEI","text":"You want to know why I am fighting with Stackblox? Oh, it would be my pleasure to tell you! She wants to design the controls to be Hyur-friendly. Can you believe that?"},{"name":"ZANSEI","text":"Any imbecile knows that goblins are best suited to operate such machinery and the Gobroller will be no exception! What sense does it make to design the controls for races that are hardly going to use the thing?"},{"name":"ZANSEI","text":"No work will be done until she acknowledges the error of her ways! Although, I wonder if someone that deluded is capable of such a thing."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Stackblox wants to design whirlycog insides for uplanders, but Zansei says no!"},{"name":"STACKBLOX","text":"Zansei has much knowings of whirlycogs. Why won't he make Gobroller insides that suit uplanders?"},{"name":"STACKBLOX","text":"Stackblox can't sweatwork with these addlebrained ideas! Zansei needs to think like gobbie!"},{"name":"ZANSEI","text":"It is in the name: <span class=\"emphasis\">Gob</span>roller. If we were developing some kind of Auri-roller then maybe I would have cause to think differently."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... If Zansei were a gobbie he would be Slowthinx Nothoughts!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... I know that can't have been easy. On the bright side, now that we know the issue, all we need do is fix it!"},{"name":"STICKQIX","text":"Would you be able to bring me twenty chunks of feather iron ore, <span class=\"alternative-container\"><span class=\"alternative\">old girl</span><span class=\"alternative\">old boy</span></span>?"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Splendid!"},{"name":"STICKQIX","text":"My friend, a merchant of sorts, is more knowledgeable of this particular mineral than I. Seek him out at the Hard Place and he shall tell you where to find what we need."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... You will find my friend at the Hard Place."},{"name":"NONOWATO","text":"Please, <span class=\"highlight\">Forename</span>! Those minerals are the key to solving this dispute, I am sure of it."},{"name":"GOBLINMERCHANT02556","text":"Pssshkoh... You are the uplander that gave gobbie ore more precious than jinglyshine! Good gobbiefriend, indeed! Are you well?"},{"name":"GOBLINMERCHANT02556","text":"Searching for feather iron ore? Gobbie is always willing to aid Stickqix's busydeals! Uplander is good gobbiefriend so no jinglyshine is needed."},{"name":"GOBLINMERCHANT02556","text":"You will find what you seek in the Far East! Head for the Ruby Sea."},{"name":"GOBLINMERCHANT02556","text":"Pssshkoh...<br>Uplander must go to Ruby Sea for minerals."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Was my merchant friend able to point you in the right direction?"},{"name":"STICKQIX","text":"Perfect! The quality is even better than the last batch you delivered. Nonowato, fetch Zansei and Stackblox for me."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Stackblox ear-catches that Stickqix wants to trade tongueflaps with gobbie. But why is Zansei here?"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Take a look at this before you get too riled up."},{"name":"ZANSEI","text":"By the Twelve! I have never seen a mineral quite like this in my life."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Stackblox does not see this in Eorzea. Where did uplander find it?"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... We had our miner friend travel all the way to the Far East to retrieve this for us. Once smelted, it can be used to create metal as light as a feather...well, almost."},{"name":"STICKQIX","text":"Use this to create the vehicle's controls and I am certain the decrease in weight will enable you two to design something very special indeed."},{"name":"ZANSEI","text":"Chief, I have not the foggiest idea what you are saying."},{"name":"STICKQIX","text":"Look, both of your attitudes are perfectly logical. But this is Idyllshire─a place where goblins and men live in harmony! Are you telling me that our work should not reflect that?"},{"name":"STICKQIX","text":"Why not make two sets of interchangeable pedals for the Gobroller? One would be of a suitable size for goblins, Lalafells, and other smaller races. The other would account for the realm's larger races."},{"name":"STICKQIX","text":"I am positive that if the two of you work together, you have the potential to create controls convenient for all races. I would not have bothered to request our miner friend's help otherwise."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Chief Stickqix is best gobbie! Two braincases are better than one."},{"name":"ZANSEI","text":"It is hard to admit, but I was indeed in the wrong. Come on, Stackblox, let us start a mechanical revolution!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Yet again you have saved the day! My thanks, <span class=\"highlight\">Forename</span>."},{"name":"NONOWATO","text":"Excellent work today, as always! Let's head outside to discuss your next job."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Yes, I'd like to believe there actually will be a next job..."},{"name":"NONOWATO","text":"What's that? Something the chief said is bothering you?"},{"name":"KRYSTRYMM","text":"Looks like everything's in order once more. Frankly, I was getting tired of waiting; it's high time I was getting back to my own work."},{"name":"ZANSEI","text":"My apologies for involving you in all of that. I shall make amends by creating Gobroller controls which push the very boundaries of control technology to their utmost limits!"},{"name":"FOHCWYDA","text":"I see the fighting seems to have died down at last. Hopefully there will not be any further distractions. We are all here for one very specific purpose after all."},{"name":"STACKBLOX","text":"Pshhh... Shkohhh... Stackblox is sorry for wasting uplander's time. But gobbie gives wordbond that whirlycog insides will be perfect!"},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Mayhap I ought to consult with Slowfix about this..."},{"name":"STICKQIX","text":"I just feel that something needs be done to improve our working conditions. We can't very well expect to finish this project in a timely manner if we're bickering every step of the way. It also will not do to rely on your help forever."},{"name":"STICKQIX","text":"I have the utmost confidence in the ability of every single one of my workers; I just wish I could stop worrying about their personalities. If only there was some way they could all work in harmony..."},{"name":"STICKQIX","text":"Ah, sorry, <span class=\"alternative-container\"><span class=\"alternative\">old girl</span><span class=\"alternative\">old boy</span></span>! This is nothing for you to concern yourself with. Go and speak with Nonowato, he's been waiting more than long enough."},{"name":"STICKQIX","text":"Pshhh... Shkohhh... Pay no heed to what I just said─consider them the musings of an easily worried goblin."},{"name":"NONOWATO","text":"Allow me to thank you once again for all your hard work! I'd love to say this will be the last time we require your problem-solving talents, but recent events make me somewhat doubtful."},{"name":"NONOWATO","text":"I wish I could have helped myself, but someone in my position really needs to remain neutral during times like these."},{"name":"NONOWATO","text":"I wouldn't imagine we will be requiring your services─mining or otherwise─in the immediate future, so do take this chance to rest up."},{"name":"SYSTEM","text":"To be deleted."}],"reward":{"gil":2957,"items":[{"id":19535},{"id":19637,"one":1},{"id":19638,"one":1},{"id":19639,"one":1},{"id":19640,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":17}],"quests":[68091]},"next":[68093]},"partials":[{"type":"npc","id":"1019863","obj":{"i":1019863,"n":"Nonowato","l":2082,"q":5}},{"type":"npc","id":"1019864","obj":{"i":1019864,"n":"Stickqix","l":2082,"q":4}},{"type":"npc","id":"1019865","obj":{"i":1019865,"n":"Stackblox","l":2082,"q":5}},{"type":"npc","id":"1019866","obj":{"i":1019866,"n":"Goblin Merchant","l":2082,"q":1}},{"type":"npc","id":"1019867","obj":{"i":1019867,"n":"Nonowato","l":2082,"q":5}},{"type":"npc","id":"1020988","obj":{"i":1020988,"n":"Krystrymm","l":2082,"q":5}},{"type":"npc","id":"1020989","obj":{"i":1020989,"n":"Zansei","l":2082,"q":5}},{"type":"npc","id":"1020990","obj":{"i":1020990,"n":"Fohcwyda","l":2082,"q":5}},{"type":"item","id":"19535","obj":{"i":19535,"n":"Doman Iron Pickaxe","l":220,"c":38026,"t":28,"p":31363}},{"type":"item","id":"19637","obj":{"i":19637,"n":"Tigerskin Cap of Gathering","l":220,"c":41390,"t":34,"p":17249}},{"type":"item","id":"19638","obj":{"i":19638,"n":"Kudzu Coat of Gathering","l":220,"c":43811,"t":35,"p":28749}},{"type":"item","id":"19639","obj":{"i":19639,"n":"Tigerskin Fingerless Gloves of Gathering","l":220,"c":44572,"t":37,"p":17249}},{"type":"item","id":"19640","obj":{"i":19640,"n":"Kudzu Culottes of Gathering","l":220,"c":45972,"t":36,"p":28749}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17942","obj":{"i":17942,"n":"Feather Iron Ore","l":276,"c":21224,"t":48}},{"type":"quest","id":"68091","obj":{"i":68091,"n":"Thick Skin","g":144,"l":"Idyllshire","s":630,"f":1}},{"type":"quest","id":"68093","obj":{"i":68093,"n":"Where the Money Takes You","g":144,"l":"Idyllshire","s":680,"f":1}}]}