{"quest":{"name":"Trials of the Sekiseigumi","location":"Ul'dah","id":68103,"patch":4.0,"sort":630,"icon":100684,"unlocksFunction":1,"eventIcon":71341,"issuer":1021836,"target":1022190,"involved":[1022184,1022191],"genre":160,"journal":["Momozigo has a letter addressed to you in his care.","Momozigo hands you a letter sent to you from Makoto. In an elegant hand, she tells of the Sekiseigumi's losing battle against the insurgents led by Ugetsu, your fellow pupil, and petitions your aid in the fight. If you would answer the call, you are asked to come to the Sekiseigumi Barracks in Kugane.","Arriving in Kugane, you make your way to the Sekiseigumi Barracks, where you are greeted by a soft-spoken Sekiseigumi. The man informs you that Makoto is away on a reconnaissance mission to Sakazuki, but is quite late to return. Unable to leave his post, he asks that you go and find her in his stead.","You find Makoto surrounded by the enemy, her comrade lying still nearby. The insurgents turn their blades upon you, but you deal with them with little trouble. With the danger passed, you may look to your ailing friend.","Rising to her feet, Makoto thanks you profusely for rescuing her. Their coming had somehow been made known to the enemy, who received them with an ambush. Her voice laden with sorrow, Makoto tells you about her slain comrade. Hailing from a poor farming village, he joined the Sekiseigumi in hopes of bringing about change to Hingan society─a society that holds people hostage to their birth. Ugetsu and his insurgents, too, seek to bring about change, but they would do so by plunging the entire realm into chaos. Having finished holding forth on her passions, she sees to carrying her comrade back to the barracks and bids you join her there.","Back at the barracks, the soft-spoken Sekiseigumi introduces himself as Shiden, lieutenant of the Sekiseigumi. Aside from Makoto, he alone is privy to your identity as Musosai's pupil, a fact you are told to keep secret lest it attract undue suspicion. You are then brought before Captain Kongo, who immediately mistrusts you and makes his sentiments known by way of a drawn blade. Though he is eventually persuaded to sheathe it, he leaves you with a grave warning nonetheless. Shiden apologizes for the captain's outburst, explaining that the man has been under great pressure of late. And to add to their burdens, His Excellency the Tairo, one of the nation's most powerful men, is due to come to Kugane on an embassy visit. The task of providing security falls to the Sekiseigumi, and you are asked to assist when the time comes.<br><br>※The next samurai quest will be available from Makoto upon reaching level 65."],"objectives":["Speak with the soft-spoken Sekiseigumi in Kugane.","Look for Makoto on Sakazuki.","Aid Makoto.","Report to the soft-spoken Sekiseigumi."],"dialogue":[{"name":"MOMOZIGO","text":"Ah, <span class=\"highlight\">Forename</span>! I have a letter for you that arrived at the inn. It's from Makoto, the Hingan samurai who came all the way here seeking Musosai."},{"name":"MOMOZIGO","text":"Can't imagine what this might be about. Let's find out, shall we?"},{"name":"MAKOTO","text":"(-Makoto's Letter-)Dear <span class=\"highlight\">Forename</span>,<br>I pray this letter finds you well. You received me with kindness when first we met, and I write to you in hopes of depending upon your kindness once more."},{"name":"MAKOTO","text":"(-Makoto's Letter-)You will recall what I told you of Ugetsu and his growing faction of insurgents. Upon my return to Kugane, I was dismayed to find that his influence had spread to alarming proportions."},{"name":"MAKOTO","text":"(-Makoto's Letter-)Outbreaks of violence have become a regularity, and the men and women of the Sekiseigumi struggle to maintain order. Each day we fight, and each day our strength is shorn further. The enemy, it shames me to say, completely has our measure."},{"name":"MAKOTO","text":"(-Makoto's Letter-)I shall speak plain: we are in desperate need of aid, and I beseech you to lend your katana to our cause. As Master Musosai's last pupil, your skills would help us to turn the rising tide."},{"name":"MAKOTO","text":"(-Makoto's Letter-)I know full well that I ask much of you─to journey halfway across the world and involve yourself in a struggle not your own. Yet ask I must, for should the bakufu fall, the realm would be plunged into chaos, and innocent people would be subjected to untold suffering."},{"name":"MAKOTO","text":"(-Makoto's Letter-)With all my being, I pray that you will answer our call, and ere long we shall meet again in Kugane.<br>Sincerely yours,<br>Makoto"},{"name":"MOMOZIGO","text":"Musosai's first and final pupils, pitted against each another... There's certainly poetry in that, and you can take comfort in the knowledge that you'd be fighting on the side of justice."},{"name":"MOMOZIGO","text":"As Makoto writes, though, it's a lot to ask, and the decision is yours to make. But for my unsolicited opinion, I reckon you should do it─for the old man if for no one else."},{"name":"MOMOZIGO","text":"Whether you go to the Sekiseigumi's aid is your decision to make. But for my unsolicited opinion, I reckon you should do it─for the old man if for no one else."},{"name":"SHIDEN","text":"A samurai, yet yours is not a familiar face. Makoto's foreign guest, I take it?"},{"name":"SHIDEN","text":"My apologies, but she is not on hand to receive you. She is presently leading a mission to Sakazuki, where insurgent leaders are meeting in secret."},{"name":"SHIDEN","text":"However, they are late to return, and I must confess that I grow worried. I would go and find them myself, but I cannot well abandon my post. Might I ask you to go in my stead?"},{"name":"SHIDEN","text":"Makoto's unit is late to return from a mission to Sakazuki. I would go and find them myself, but I cannot well abandon my post. Might I ask you to go in my stead?"},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"BALLOON","text":"Another one!"},{"name":"MAKOTO","text":"By the kami, it's really you. I know not how to thank you, <span class=\"highlight\">Forename</span>."},{"name":"MAKOTO","text":"We caught wind of a secret insurgent meeting, and came here hoping to learn something of their plans. But they were the ones who knew of ours."},{"name":"MAKOTO","text":"They were expecting us and had laid a trap. Before we knew what was happening..."},{"name":"MAKOTO","text":"We Hingans live by a rigid caste system, wherein one's standing in society is inherited rather than earned. My comrade─he hailed from a poor farming village. His family grew scarcely enough to pay their lord his dues, and it was all they could do not to starve."},{"name":"MAKOTO","text":"In order to escape the shackles of his birth, he sought a new life in Kugane, a more progressive district, where a man may yet rise above his station."},{"name":"MAKOTO","text":"He became a samurai in hopes that he might one day have the power to bring about change─change to an irrational system that holds people hostage to their birth."},{"name":"MAKOTO","text":"Souls such as him make up the Sekiseigumi, those raised with a plow in hand, and not a blade. You'll find none among us born into a samurai family; ours is a ragtag band gathered from the lower rungs of society. Yet for our disparate origins, we are patriots all."},{"name":"MAKOTO","text":"Ugetsu and his cohorts, too, claim to be patriots. But in order to bring about their change, they would as soon see our nation razed to the ground."},{"name":"MAKOTO","text":"As with any nation, Hingashi is not free of problems. Far from it. But should the bakufu be toppled, the great lords would rise against each other in a bid for power. The realm would be transformed into a battlefield, and another Age of Blood would begin. If we are to prevent this─if we are to protect the peace, Ugetsu must not be allowed to succeed. No matter the cost."},{"name":"MAKOTO","text":"...Forgive me, now is not the time to hold forth on my passions. I shall bear my comrade back to the barracks. Pray join me there."},{"name":"MAKOTO","text":"Our fallen comrade will be given a hero's burial."},{"name":"SHIDEN","text":"That the enemy should know our plans... The loss of a comrade pains us, but we are grateful for Makoto's preservation."},{"name":"SHIDEN","text":"She has told me all. As Master Musosai's pupil, your blade would be most welcome in these dire times."},{"name":"MAKOTO","text":"<span class=\"highlight\">Forename</span>. Pray allow me to confirm your intent."},{"name":"MAKOTO","text":"By your coming to Kugane, may we take it to mean that you will aid us in our fight?"},{"name":"Q1","text":"Aid the Sekiseigumi?"},{"name":"MAKOTO","text":"From the bottom of my heart, I thank you. Our cause is much bolstered for your blade."},{"name":"MAKOTO","text":"Is that so... I'll not hide my disappointment. Should you have a change of heart, our doors shall ever be open."},{"name":"MAKOTO","text":"Without further ado, I would introduce you to our captain. However, there is one thing I must ask of you."},{"name":"MAKOTO","text":"Pray keep the fact that you are Master Musosai's pupil to yourself."},{"name":"MAKOTO","text":"It may make little sense to you, but that you shared a master with a wanted criminal would mark you out for suspicion. That is simply the way of it in our culture."},{"name":"MAKOTO","text":"Lieutenant Shiden alone knows the truth and understands, but few are as open-minded as him."},{"name":"SHIDEN","text":"Ah, it occurs to me I've yet to introduce myself. As Makoto says, I am Shiden, lieutenant of the Sekiseigumi. And may I apologize for our order's penchant for procedure."},{"name":"SHIDEN","text":"When I sent you to find Makoto in my stead, I could not leave my post due to a prior duty─tending to the whims of a visiting dignitary. Pressing business, as you'll no doubt appreciate. Now, if you'll wait just a moment, I shall bring Captain Kongo hither."},{"name":"MAKOTO","text":"May I present to you <span class=\"highlight\">Forename Surname</span>, who has journeyed from faraway Eorzea to aid our cause. Though <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is not of our land, I have witnessed <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> skill at arms firsthand, and have every confidence that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> will prove an invaluable ally."},{"name":"MAKOTO","text":"C-Captain!?"},{"name":"KONGO","text":"You would have us trust our lives to an outsider!? For all we know, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is one of Ugetsu's or even an imperial spy!"},{"name":"MAKOTO","text":"Captain, please! <span class=\"highlight\">Forename</span> is a good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> and true! I personally vouch for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> identity, and shall assume all responsibility for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> actions!"},{"name":"SHIDEN","text":"Should <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> origin give you cause to doubt, you would do well to doubt us all─the sons and daughters of nameless farmers and laborers and the kami know what else."},{"name":"KONGO","text":"Hmph, very well. But mark my words, outsider: a single misstep, and I <span class=\"emphasis\">will</span> cut you down."},{"name":"SHIDEN","text":"Forgive the captain, my friend. He holds himself responsible for all our losses, and we fight a losing battle."},{"name":"SHIDEN","text":"In spite of our best efforts, we are no closer to ascertaining Ugetsu's whereabouts, nor do we know the full extent of his operations."},{"name":"SHIDEN","text":"And in light of the recent ambush, I fear there is a breach in our security."},{"name":"SHIDEN","text":"As if we had not problems enough, His Excellency the Tairo, one of our nation's most powerful men, has chosen this juncture to come to Kugane on an embassy visit."},{"name":"SHIDEN","text":"Ugetsu will surely look to wreak further chaos, and it falls to the Sekiseigumi to keep our honored guest hale and whole. We will be out in force providing security, and I pray that we can rely on your blade as well."},{"name":"MAKOTO","text":"I too must beg your forgiveness for the captain's outburst. With naught to show for our efforts, he grows ever more irritable."},{"name":"MAKOTO","text":"Now then, I must return to my duties. We have no tasks for you at present, but in case of an emergency, pray remain near and with your katana near at hand."}],"reward":{"gil":1769,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":111}],"quests":[68102]},"next":[68104]},"partials":[{"type":"npc","id":"1021836","obj":{"i":1021836,"n":"Momozigo","l":40,"q":3}},{"type":"npc","id":"1022190","obj":{"i":1022190,"n":"Soft-spoken Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022184","obj":{"i":1022184,"n":"Makoto","l":2404,"q":5}},{"type":"npc","id":"1022191","obj":{"i":1022191,"n":"Makoto","l":2409,"q":1}},{"type":"quest","id":"68102","obj":{"i":68102,"n":"A Dignified Visitor","g":160,"l":"Ul'dah","s":601,"f":1}},{"type":"quest","id":"68104","obj":{"i":68104,"n":"Matsuba Mayhem","g":160,"l":"Kugane","s":650,"f":1}}]}