{"quest":{"name":"The Battle on Bekko","location":"Kugane","id":68106,"patch":4.0,"sort":700,"icon":100684,"unlocksFunction":1,"eventIcon":71341,"issuer":1022184,"target":1022184,"involved":[1019026,1019027,1019028,1022207,1022208,1022209,1022210,1022211,1022212,1022215,1022216,1022217,1022218,1022377],"genre":160,"journal":["Makoto looks defeated even before the battle has begun.","Makoto's fears have become reality. Members of the Sekiseigumi are deserting following the revelation that she is Ugetsu's sister and you Musosai's pupil. As it stands, she will not have the strength to face the insurgents. Unwilling to let it end like this, she asks that you seek out your disillusioned comrades in Kugane and bring them back to hear her piece.","You have spoken with some of the Sekiseigumi. Though they are unenthused at best, they agree to at least hear what Makoto has to say. You have done your part; the rest is up to your friend.","Before the gathered Sekiseigumi, Makoto takes a deep breath and begins her speech. While learning that Kogarashi and Musosai were one and the same instantly restores their opinion of you, it proves much harder for Makoto to regain their respect. Just when it seems her efforts would end in failure, timely intervention comes in the form of Momozigo, who had spontaneously decided to journey to Kugane. Employing his gift of the gob to great effect, he makes them see the error of their thinking, and they rally behind Makoto once more. With hope thus restored, you strike out for the field of battle─for the Isle of Bekko.","On the Isle of Bekko, the Sekiseigumi come face–to–face with the insurgents. Battle erupts, and you clash with Ugetsu in a frenetic duel between Musosai's two pupils. At the end of the confrontation, you are the one left standing, and left leaderless, the remaining insurgents turn tail and run.","Makoto deals Ugetsu the killing blow, thus fulfilling her quest for revenge and ending a great threat to the realm. Sparing not another glance at her birth brother, she sets off with her adoptive family, back to the Sekiseigumi Barracks.","Makoto offers you her eternal gratitude for the vital role you played in defeating the insurgents. Her appointment as captain now official, she pledges to live up to her predecessor's faith in her. Meanwhile, it has come to light that most of the order's younger members joined out of the desire to emulate Kogarashi. Makoto muses that, in embarking upon his quest to right wrongs, Musosai may have wished to sow the seeds of a new generation. Whatever his intent may have been, your master may rest easy in the knowledge that his spirit has taken root within the men and women of the Sekiseigumi, true samurai all who strive to preserve order and ward off chaos. As one who shares their calling, you resolve to continue walking your path with courage and honor, guided always by an unflinching sense of justice.<br><br>※The next samurai quest will be available from Makoto once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “Courage Born of Fear.”"],"objectives":["Speak with Sekiseigumi members.","Report to Makoto.","Join Makoto on the Isle of Bekko.","Speak with Makoto in Kugane."],"dialogue":[{"name":"MAKOTO","text":"<span class=\"highlight\">Forename</span>... My fears have become reality. Members of the Sekiseigumi are deserting, one after another."},{"name":"MAKOTO","text":"Finding out that I am Ugetsu's sister, and you Musosai's pupil, has shattered their faith in our cause."},{"name":"MAKOTO","text":"With so many gone, we haven't the strength to face the insurgents. We have to convince them to return somehow..."},{"name":"MAKOTO","text":"There is no two ways about my connection to Ugetsu, but if we can dispel the stigma surrounding Master Musosai at least, they may yet have a change of heart."},{"name":"MAKOTO","text":"I require but a chance to speak my piece. Will you help me round up our disillusioned comrades?"},{"name":"MAKOTO","text":"I will look around the barracks and the north side of town, if you could focus your search on the south."},{"name":"SEKISEITAISOLDIERA","text":"What do you want, ijin? I have naught to say to the likes of you."},{"name":"SEKISEITAISOLDIERA","text":"The captain desires a chance to explain? Well, I suppose it wouldn't hurt to hear her out..."},{"name":"SEKISEITAISOLDIERB","text":"They say you bested the lieutenant, but I'll be damned if you didn't use dirty tricks you learned from the craven Musosai."},{"name":"SEKISEITAISOLDIERB","text":"...The captain calls? What's the insurgent's sister want now? Hmph, might as well see what sort of lame excuse she's got in store."},{"name":"SEKISEITAISOLDIERC","text":"Look, it's not like I mistrust you and the captain. It's just...I can't work up the will to fight anymore."},{"name":"SEKISEITAISOLDIERC","text":"She wants to talk, does she? Hm, well, I doubt anything she says will change my mind, but I'll go along with it for now."},{"name":"SEKISEITAISOLDIERA","text":"Let us hear what she has to say."},{"name":"SEKISEITAISOLDIERB","text":"This better be good, or I'm going to the tavern."},{"name":"SEKISEITAISOLDIERC","text":"By the kami, this is awkward..."},{"name":"MAKOTO","text":"My thanks for your help, <span class=\"highlight\">Forename</span>. Let's begin before they change their minds."},{"name":"MAKOTO","text":"Hear me, my comrades. In our nation, Musosai is a name that evokes loathing. All know that his were the hands that created the monster Ugetsu. And all know that he evaded responsibility for fear of death."},{"name":"MAKOTO","text":"But naught could be further from the truth, for Musosai ever taught that a samurai's calling is to preserve order."},{"name":"MAKOTO","text":"However, Ugetsu seeks to do the very opposite. In bringing down the bakufu, he means to usher in such chaos as to trigger another Age of Blood."},{"name":"MAKOTO","text":"Ugetsu may have trained under Musosai, but he was no true pupil of his. Nay, his true pupil stands before you now, and <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>, like <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> master did, wields <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> katana to protect the peace."},{"name":"SEKISEITAISOLDIERB","text":"Bah! “Protect the peace,” you like to say, but what did Musosai ever do to “protect the peace”? Can you tell us that?"},{"name":"SEKISEITAISOLDIERA","text":"I would ask the same question. All we know is that he challenged warriors the realm over and never was once defeated. An impressive feat, to be sure, but it's neither here nor there."},{"name":"MAKOTO","text":"It...it takes strength to protect the peace. As we strive to hone our skills through rigorous training, Musosai honed his through duels."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He went on a quest to right wrongs as Kogarashi."},{"name":"A2","text":"He brought evildoers to account as Kogarashi."},{"name":"SEKISEITAISOLDIERB","text":"Wait a second... <span class=\"emphasis\">The</span> Kogarashi? The mystery samurai who roamed the land smiting the wicked when I was little?"},{"name":"SEKISEITAISOLDIERA","text":"The man who protected the weak and punished common crooks and great lords alike before vanishing like the wind?"},{"name":"SEKISEITAISOLDIERC","text":"It was Musosai all along? I-I became a samurai because of him!"},{"name":"SEKISEITAISOLDIERB","text":"M-Me too! Kogarashi was my hero! I wanted to change the world like him!"},{"name":"SEKISEITAISOLDIERA","text":"Looking back, 'twas when first I heard tell of Kogarashi that the desire to take up the katana took root in my heart."},{"name":"MAKOTO","text":"I had known that Master Musosai journeyed the land with my brother, but to think that he did so as Kogarashi... Could the experience have pushed Ugetsu to his extreme beliefs?"},{"name":"SEKISEITAISOLDIERA","text":"Very well, Captain, we were wrong about Musosai. But what have you to say for yourself?"},{"name":"SEKISEITAISOLDIERB","text":"That's right, we haven't forgotten about that! Your brother's the bastard that's trying to tear down our nation. How can we trust you?"},{"name":"MOMOZIGO","text":"(-Familiar Voice-)Arrrgh, enough! I've been biting my tongue, but I can't stand it anymore!"},{"name":"MOMOZIGO","text":"Hello there, <span class=\"highlight\">Forename</span>. Fancy seeing <span class=\"emphasis\">me</span> here, I shouldn't doubt? The idea occurred to me to visit Musosai's homeland, you see, and you know how spontaneous I can be."},{"name":"MOMOZIGO","text":"But what do I find upon arriving but this painful display of narrow-mindedness! The old man would be turning in his grave!"},{"name":"SEKISEITAISOLDIERB","text":"Who the hells are you?"},{"name":"MOMOZIGO","text":"Who I am doesn't matter. What matters is what I did, and that was to journey with <span class=\"highlight\">Forename</span> and Musosai on a quest to right wrongs."},{"name":"MOMOZIGO","text":"We've established that you all respect and admire Musosai, who happens to be your childhood hero, Kogarashi. Well then, you should know what he used to always say about his own countrymen: that you're so focused on a person's birth, you blind yourselves to his true worth."},{"name":"MOMOZIGO","text":"It's so bleeding obvious I can't believe I have to say this, but having a villain for a brother doesn't make Makoto a villain. In spite of their relationship, she opposes him, for gods' sake!"},{"name":"MOMOZIGO","text":"Now, look at yourselves. None of you were born into samurai families, but through hard work, you've made it this far─become who you wanted to be."},{"name":"MOMOZIGO","text":"What Makoto has done is no different! Like you, she's broken free of the shackles of her birth to live a life of her own choosing!"},{"name":"SEKISEITAISOLDIERC","text":"By the kami, why could I not see this? After all we've been through together as comrades?"},{"name":"SEKISEITAISOLDIERB","text":"Damn it, you're right. How many times have I had to put up with scorn because I came from a poor village? But there I was dealing that scorn to the captain..."},{"name":"SEKISEITAISOLDIERA","text":"Strike me down for a fool. I've always despised this aspect of our culture, yet all this time I remained its unwitting prisoner."},{"name":"SEKISEITAISOLDIERA","text":"Come, my friends. Let us bring back those of us who are still at large. We have a battle to win and peace to protect!"},{"name":"MAKOTO","text":"You're the gentleman from the inn in Ul'dah. I owe you a debt of gratitude."},{"name":"MOMOZIGO","text":"Oh, don't mention it. I'm a showmaster by trade, and words are my domain. Swords...not so much, so I'll bow out here. Ooh, I think I'll go and take a dip in one of these hot springs I've heard so much about!"},{"name":"MOMOZIGO","text":"The rest I leave in your capable hands, <span class=\"highlight\">Forename</span>. Put a stop to Ugetsu and give the old man the peace he deserves!"},{"name":"MAKOTO","text":"The appointed hour is nigh. Let us make for the field of battle─for the Isle of Bekko."},{"name":"SEKISEITAISOLDIERA","text":"I'm pleased to say we were able to round up everyone. All that remains is to fight as we've never fought before."},{"name":"SEKISEITAISOLDIERB","text":"Right, let's give those insurgent bastards a thrashing they'll never forget!"},{"name":"SEKISEITAISOLDIERC","text":"All my doubts are banished. I stand ready to fight with you!"},{"name":"RANJISHI","text":"I am ashamed for having doubted you. I admired Kogarashi in my childhood, and I pray that you will succeed in stopping his unworthy pupil."},{"name":"RISHIN","text":"Would that we could join you, but some few must remain here at the barracks. Our hopes go with you and the First Squad!"},{"name":"TOMIKUSA","text":"Makoto has suffered much on account of her brother. Please watch over her for us."},{"name":"MAKOTO","text":"All wayward members are returned, and all with their resolve restored. Let us go and face Ugetsu!"},{"name":"UGETSU","text":"Will this false peace continue? Or will the fires of true change sweep across the land? Today, we decide Hingashi's history."},{"name":"UGETSU","text":"Today, we decide whose path is right: Musosai's...or mine!"},{"name":"UGETSU","text":"There is but one among you worthy of being my opponent─<span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who trained under mine own master. Come, <span class=\"highlight\">Forename</span>, show me the strength of your conviction!"},{"name":"UGETSU","text":"Why do you...stay your blade?"},{"name":"UGETSU","text":"It is over... The heavens have chosen... Now, strike me down..."},{"name":"UGETSU","text":"A samurai...must be decisive... Finish me...or I shall finish you!"},{"name":"UGETSU","text":"Good... You've grown strong...little sister..."},{"name":"MAKOTO","text":"Come, my friends. Let us return to the barracks."},{"name":"MAKOTO","text":"We've succeeded in quelling a major threat to the nation, and it was in no small part due to you, <span class=\"highlight\">Forename</span>. You have my eternal gratitude."},{"name":"MAKOTO","text":"While not all insurgents are accounted for, without a leader to unite them, they will eventually scatter to the winds."},{"name":"MAKOTO","text":"As for me, my appointment as captain of the Sekiseigumi has since been made official. 'Tis a heavy burden, but I swear to bear it with honor and live up to Captain Kongo's faith in me."},{"name":"MAKOTO","text":"Meanwhile, the revelation of Kogarashi's true identity has been doing its rounds of our order."},{"name":"MAKOTO","text":"'Twould seem that nigh all of our younger members idolized him, and joined out of the desire to make a difference."},{"name":"MAKOTO","text":"In embarking upon his quest, I believe that Master Musosai in part wished to sow the seeds of a new generation."},{"name":"MAKOTO","text":"Ugetsu sought the quick path to change, and cared not that it was fraught with strife and suffering. He saw Hingashi as a dilapidated house fit only to be torn down."},{"name":"MAKOTO","text":"But Master Musosai sought to restore this house, board by board, nail by nail. One injustice at a time, even should it take several lifetimes."},{"name":"MAKOTO","text":"To ensure that his legacy lives on, I will embark upon my own quest of change here in Kugane. And I pray that you will do the same no matter where your road takes you."},{"name":"SYSTEM","text":"This concludes the samurai quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “Courage Born of Fear.”"},{"name":"SYSTEM","text":"Once you have done so, the next samurai quest will be available from Makoto."},{"name":"RANJISHI","text":"I am ashamed for having doubted you. I admired Kogarashi in my childhood, and I believe I speak for all here when I say that I am both honored and grateful for your aid."},{"name":"RISHIN","text":"If we are to approach the mastery of Master Musosai and your good self, we must be relentless in our training!"},{"name":"TOMIKUSA","text":"By defeating her brother, Makoto has severed all ties with her past. If there had been any who doubted her fitness as captain, there are certainly none now."}],"reward":{"gil":2700,"action":7496,"items":[{"id":20287}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":111}],"quests":[68105]},"next":[68759]},"partials":[{"type":"npc","id":"1022184","obj":{"i":1022184,"n":"Makoto","l":2404,"q":5}},{"type":"npc","id":"1019026","obj":{"i":1019026,"n":"Ranjishi","l":2404,"q":1}},{"type":"npc","id":"1019027","obj":{"i":1019027,"n":"Rishin","l":2404,"q":1}},{"type":"npc","id":"1019028","obj":{"i":1019028,"n":"Tomikusa","l":2404,"q":1}},{"type":"npc","id":"1022207","obj":{"i":1022207,"n":"Conscientious Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022208","obj":{"i":1022208,"n":"Gruff Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022209","obj":{"i":1022209,"n":"Baby-faced Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022210","obj":{"i":1022210,"n":"Conscientious Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022211","obj":{"i":1022211,"n":"Gruff Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022212","obj":{"i":1022212,"n":"Baby-faced Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022215","obj":{"i":1022215,"n":"Makoto","l":2409,"q":1}},{"type":"npc","id":"1022216","obj":{"i":1022216,"n":"Conscientious Sekiseigumi","l":2409,"q":1}},{"type":"npc","id":"1022217","obj":{"i":1022217,"n":"Gruff Sekiseigumi","l":2409,"q":1}},{"type":"npc","id":"1022218","obj":{"i":1022218,"n":"Baby-faced Sekiseigumi","l":2409,"q":1}},{"type":"npc","id":"1022377","obj":{"i":1022377,"n":"Makoto","l":2404,"q":1}},{"type":"action","id":"7496","obj":{"i":7496,"n":"Hissatsu: Guren","c":3177,"j":34,"t":4,"l":70}},{"type":"item","id":"20287","obj":{"i":20287,"n":"Myochin Attire Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68105","obj":{"i":68105,"n":"The Hunt for Ugetsu","g":160,"l":"Kugane","s":680,"f":1}},{"type":"quest","id":"68759","obj":{"i":68759,"n":"The Legend of Musosai","g":160,"l":"Kugane","s":800}}]}