{"quest":{"name":"The Face of True Evil","location":"Ishgard","id":68101,"patch":4.0,"sort":600,"icon":100682,"unlocksFunction":1,"eventIcon":71341,"issuer":1021879,"target":1021836,"involved":[1021894],"genre":160,"journal":["Momozigo is a picture of panic.","Face stricken with panic, Momozigo informs you that Musosai has vanished from his inn room without his medicine. Fearing for his condition, Momozigo asks that you help him search for the old man at Saint Valeroyant's Forum.","You scour the area, but Musosai is nowhere to be seen. Perhaps you should try a different spot.","As you scan the area, Musosai makes himself known to you and declares his intent to go after Kogarashi. The man's crime, he reveals, was to create a killer; his pupil slaughtered numerous dignitaries of Hingashi, and by the laws of the land, Kogarashi was held equally responsible for the heinous deed. Instead of atoning with his life, however, he fled with it to Eorzea, and it falls to Musosai to bring him to account. Yet try as he might, he has been unable to render justice unto the fugitive. Strong as you have become, Musosai is confident that you will be able to accomplish that which he could not, and so he assigns you your final trial: defeat Kogarashi. You set off with your master for Twinpools, where the villain is said to be hiding.","Arriving at Twinpools, Musosai bids you strike him down. For <span class=\"emphasis\">he</span> is Kogarashi, the loathsome wretch who caused countless deaths yet feared his own. Having lamented failing his pupil and living in disgrace, he demands once more that you render unto him his punishment, and comes at you with steel singing. Left with no recourse, you meet Musosai in battle, each blow you deal hurting no less than each you receive. At the end of a grueling encounter, your master falls to the ground, battered and bloodied.","As he lies dying, Musosai smiles to see that you have drawn forth his final technique. His purpose thus fulfilled, he instructs you to end it once and for all. As you prepare to draw, a distraught Momozigo scrambles up and begs you to stop. Undeterred, you swing with all your might and excise the evil in Musosai, thereby granting him the peace he had long yearned for. With his companions by his side, Musosai breathes his last, and you bury him by the cliff at the Silver Bazaar, where he might watch the setting sun begin its return journey to Hingashi─to his homeland.","Back at the Quicksand, Momozigo reveals to you something Musosai told him on the road. That before he died, he wished to leave behind a pupil into whom he has poured all of himself. Momozigo expresses his hopes that you will carry on Musosai's legacy, protecting the peace and remembering always: “Such evil cannot be suffered!”<br><br>※The next samurai quest will be available from Momozigo once you have completed the main scenario quest “The Far Edge of Fate.”"],"objectives":["Survey the designated area.","Join Musosai at Twinpools.","Speak with Momozigo."],"dialogue":[{"name":"MOMOZIGO","text":"<span class=\"highlight\">Forename</span>, we have a situation! Musosai has disappeared from his inn room!"},{"name":"MOMOZIGO","text":"He's in no shape to be up and about, and he left without even taking his medicine. Weakened as he is, though, he can't have gone far. I'd wager he's somewhere in the city still."},{"name":"MOMOZIGO","text":"Let's split up and look for him. I'll focus on the Brume, and you Saint Valeroyant's Forum."},{"name":"SYSTEM","text":"Musosai is not in the area."},{"name":"MUSOSAI","text":"At last we are alone. Good, good. The remedies of this land aren't to my liking, I'm afraid. Fortunately, I brought with me potent drafts from the Far East that restore one's vigor for a time."},{"name":"MUSOSAI","text":"And while its effects last, there is work I would do. As I explained to you earlier, I came to Heir's Ear for two purposes. The first was to find and train a worthy pupil."},{"name":"MUSOSAI","text":"The second was to find and punish the fugitive Kogarashi. However, I had yet to tell you of his crime."},{"name":"MUSOSAI","text":"Kogarashi's crime was to create a killer. His pupil went on a killing spree, cutting down numerous Hingan dignitaries, one after the other."},{"name":"MUSOSAI","text":"In my land, the master is held accountable for the deeds of the pupil, and Kogarashi's hands were deemed no less bloody than the murderer's."},{"name":"MUSOSAI","text":"For his punishment, he was ordered to commit <span class=\"emphasis\">seppuku</span>─atonement by ritual suicide. But desiring to live, Kogarashi forsook his honor and fled here, to Heir's Ear."},{"name":"MUSOSAI","text":"That he should thrive in spite of all the deaths he has caused is an affront to the very spirit of the samurai. It is unforgivable, and he cannot go unpunished."},{"name":"MUSOSAI","text":"But try as I might to render justice, as is my duty, I could not defeat him. Countless times I tried, but always I faltered."},{"name":"MUSOSAI","text":"But you, <span class=\"highlight\">Forename</span>. You have grown tremendously since you first began walking our path. Strong as you have become, I am confident that you can face Kogarashi on equal standing."},{"name":"MUSOSAI","text":"This is your final trial. Find Kogarashi. Defeat him. And your training as a samurai shall be complete."},{"name":"MUSOSAI","text":"Kogarashi makes his lair in the western highlands of Curs Are Us, at a place called Twin Fools."},{"name":"MUSOSAI","text":"Let us set off, but as you make your way, remember: 'tis a loathsome wretch you go to face, who places his own life before honor. Such evil cannot be suffered!"},{"name":"MUSOSAI","text":"Here we are, <span class=\"highlight\">Forename</span>. Are you ready to deliver unto Kogarashi his reckoning?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Such evil cannot be suffered!"},{"name":"A2","text":"..."},{"name":"MUSOSAI","text":"Then you would do well to strike me down. <span class=\"emphasis\">I</span> am Kogarashi."},{"name":"MUSOSAI","text":"There is no room for doubt. No need for pity. Evil such as his cannot be suffered."},{"name":"MUSOSAI","text":"So do what must be done and strike me down. <span class=\"emphasis\">I</span> am Kogarashi."},{"name":"MUSOSAI","text":"Kogarashi... I wore this name once upon a time, as I wore this jingasa."},{"name":"MUSOSAI","text":"Together with my pupil, I journeyed the length and breadth of Hingashi, hunting down evildoers. But my guidance was lacking, and ere long my pupil strayed from the path. And the rest of the tale you already know."},{"name":"MUSOSAI","text":"I failed to prevent his murderous rampage, but instead of taking responsibility, I took flight. Instead of honorable death, I chose dishonorable life. Countless times I turned a blade upon myself, but always my courage faltered. And so I have lived to this day with my disgrace."},{"name":"MUSOSAI","text":"Furthermore, I deceived you. I masqueraded as a protector of peace, a paragon of virtue, when I am anything but. I spoke loftily of rendering punishment unto the wicked, when the one most deserving of it...was me."},{"name":"MUSOSAI","text":"My punishment is long overdue. Render it unto me, <span class=\"highlight\">Forename</span>, and your training shall be complete!"},{"name":"MUSOSAI","text":"'Tis not your master who stands before you but a great evil! Now, come! Come and take my head...else I shall take yours!"},{"name":"MUSOSAI","text":"Well done...my pupil... You have fulfilled your duty..."},{"name":"MUSOSAI","text":"The final technique... You have drawn it forth... Good, good... I have served my purpose..."},{"name":"MUSOSAI","text":"Now, end it... Give this villain his just punishment..."},{"name":"MOMOZIGO","text":"<span class=\"highlight\">Forename</span>! Oh, gods, what have you done!?"},{"name":"MUSOSAI","text":"Peace, Momozigo... It was my doing... And no more than I deserve..."},{"name":"MOMOZIGO","text":"No, stop! For the love of the Twelve, that's enough!"},{"name":"MUSOSAI","text":"Excised the evil in me...have you?"},{"name":"MUSOSAI","text":"Absolved me of my crimes..."},{"name":"MUSOSAI","text":"<span class=\"highlight\">Forename</span>... You have become a greater samurai...than even I dared to hope... Living in shame and coming to this land...it was all worth it..."},{"name":"MUSOSAI","text":"The evil in me is no more... Now I may know peace...in the realm yonder..."},{"name":"MOMOZIGO","text":"No, Musosai! Please don't die! You can't!"},{"name":"MUSOSAI","text":"My time was nigh... Better that it end this way... <span class=\"highlight\">Forename</span>, Momozigo... Every moment of our journey...I cherished..."},{"name":"MUSOSAI","text":"Our work here is done... One fewer evil afflicts...the realm..."},{"name":"MOMOZIGO","text":"&lt;sniff&gt; Thank you, old man. For everything. We'll go on one last journey together, to the promised place."},{"name":"MOMOZIGO","text":"Musosai bade me bury him here, where he could look upon the western seas."},{"name":"MOMOZIGO","text":"I didn't know why at first, but now I think I do."},{"name":"MOMOZIGO","text":"He wanted to watch the setting sun. Watch it begin its return journey to the east─to Hingashi. No doubt he wished that he could do the same."},{"name":"MOMOZIGO","text":"He missed his homeland dearly. And to the last, the thought of his errant pupil weighed on his mind."},{"name":"MOMOZIGO","text":"Well, I suppose we should be going. Let's leave Musosai to rest and head back to Ul'dah."},{"name":"MOMOZIGO","text":"While we were on the road, the old man told me something. That before he died, he wanted to leave behind a pupil into whom he has poured all of himself."},{"name":"MOMOZIGO","text":"I don't think he could have found a better person. And as his final pupil, I get the sense that he's entrusted his legacy to you, <span class=\"highlight\">Forename</span>."},{"name":"MOMOZIGO","text":"So I hope that you'll keep on protecting the peace as Musosai once did, seeking out the wicked and bringing them to account."},{"name":"MOMOZIGO","text":"And remember always: “Such evil cannot be suffered”!"},{"name":"SYSTEM","text":"This concludes the samurai quests for FINAL FANTASY XIV: Heavensward."},{"name":"SYSTEM","text":"In order to undertake the next series of quests, you must have completed the main scenario quest “The Far Edge of Fate.”"},{"name":"SYSTEM","text":"Once you have done so, the next samurai quest will be available from Momozigo."}],"reward":{"gil":2151,"action":7497,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":111}],"quests":[68100]},"next":[68102]},"partials":[{"type":"npc","id":"1021879","obj":{"i":1021879,"n":"Momozigo","l":2300,"q":3}},{"type":"npc","id":"1021836","obj":{"i":1021836,"n":"Momozigo","l":40,"q":3}},{"type":"npc","id":"1021894","obj":{"i":1021894,"n":"Musosai","l":2200,"q":1}},{"type":"action","id":"7497","obj":{"i":7497,"n":"Meditate","c":3172,"j":34,"t":4,"l":60}},{"type":"quest","id":"68100","obj":{"i":68100,"n":"Tears in the Snow","g":160,"l":"Ishgard","s":580,"f":1}},{"type":"quest","id":"68102","obj":{"i":68102,"n":"A Dignified Visitor","g":160,"l":"Ul'dah","s":601,"f":1}}]}