{"quest":{"name":"Tournament of the Century","location":"Ul'dah","id":68107,"patch":4.0,"sort":601,"icon":100668,"unlocksFunction":1,"eventIcon":71341,"issuer":1006747,"target":1001739,"involved":[1001821,1012163,1021342,1021343,1021344,1021345,1021346,1021347,1023881],"genre":147,"journal":["Jenlyns has an invitation in his pocket and he is happy to see you.","Jenlyns hands you an invitation to the Ul Cup, a prestigious fighting tournament to be held at the Coliseum. According to the Sultansworn captain, the tournament was founded by the first sultan of Ul'dah, and after generations of obscurity, Nanamo has decided to revive it. Gladdened by your intent to participate, Jenlyns instructs you to seek out the tournament registrar on the Royal Promenade.","You speak with the registrar, who confirms your entry to the tournament. He further informs you that the opening ceremony is due to begin shortly, and suggests that you join those participants who have gathered in front of the Gladiators' Guild.","Among your would-be opponents you see faces both new and old, and the affable adventurer that you are, you take the opportunity to greet each of them. With that settled, perhaps a quick visit to the Gladiators' Guild to speak with your old guildmaster is in order.","Welcoming you warmly, Mylla gives you an overview of tournament rules, shortly after which the opening ceremony commences. Making a royal appearance, Nanamo declares the Ul Cup revived and gives her blessing to all combatants. May Nald'thal give strength to your sword arm.<br><br>※The next paladin quest will be available from Mylla upon reaching level 63."],"objectives":["Show the Ul Cup invitation to the tournament registrar.","Speak with tournament participants.","Speak with Mylla."],"dialogue":[{"name":"JENLYNS","text":"Ah, <span class=\"highlight\">Forename</span>, precisely the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I wished to see."},{"name":"JENLYNS","text":"I have something in my care for you."},{"name":"JENLYNS","text":"An invitation to a fighting tournament to be held at the Coliseum."},{"name":"JENLYNS","text":"Not just any tournament, mind you, but the prestigious Ul Cup. Founded by His Royal Majesty Sasagan Ul Sisigan, first sultan of Ul'dah, 'tis nigh as old as the nation itself."},{"name":"JENLYNS","text":"Lest you wonder why you are unfamiliar with so old and prestigious a tournament, it's because it has not been held in generations. At the sultana's behest it has been revived, and she now extends an invitation to Eorzea's finest swordsmen."},{"name":"JENLYNS","text":"It stands to reason that your name would appear among this exalted company, and doubt not but that Her Grace shall be pleased for your participation. So, can we expect you to fight in the tournament?"},{"name":"Q1","text":"Will you fight in the Ul Cup?"},{"name":"A1","text":"Sure, where do I sign up?"},{"name":"A1","text":"I might pass on this one."},{"name":"JENLYNS","text":"Wonderful! By witnessing you in combat, I daresay all of us Sultansworn, both fresh recruits and veterans alike, stand to gain something in our duty to protect."},{"name":"JENLYNS","text":"As a free paladin, you doubtless have many obligations that extend beyond the Sultansworn's purview."},{"name":"JENLYNS","text":"But if not for yourself, mayhap you would consider fighting for us? By witnessing you in combat, I daresay all of us Sultansworn, both fresh recruits and veterans alike, stand to gain something in our duty to protect."},{"name":"JENLYNS","text":"And so I make this personal plea: will you not participate in the tournament?"},{"name":"JENLYNS","text":"You have my gratitude! Now then, allow me to furnish you with some additional details."},{"name":"JENLYNS","text":"The champion will be awarded a tome said to hold the secret techniques of the first captain of Sultansworn. With such an enticing prize on offer, no small number of invitees have already confirmed their participation─I myself included."},{"name":"JENLYNS","text":"You should confirm yours as well, by making yourself known to the tournament registrar on the Royal Promenade."},{"name":"JENLYNS","text":"If you haven't already done so, you will wish to confirm your participation in the tournament. Pray make yourself known to the tournament registrar on the Royal Promenade."},{"name":"RECEPTIONIST02571","text":"Greetings to you, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. You are come to enter the Ul Cup? Your invitation, if you would be so kind."},{"name":"RECEPTIONIST02571","text":"Yes, everything appears to be in order. On behalf of the committee, I bid you welcome to the tournament!"},{"name":"BARTHOLOMEW","text":"Wait─you're participating, too? To think that I might have the chance to cross swords with a fabled hero such as you! The tournament cannot begin soon enough!"},{"name":"RECEPTIONIST02571","text":"You needn't wait long, for the opening ceremony will begin any time now."},{"name":"RECEPTIONIST02571","text":"I am told a number of participants have already gathered before the Gladiators' Guild. Perhaps you might like to join them?"},{"name":"RECEPTIONIST02571","text":"A number of participants have already gathered before the Gladiators' Guild. Perhaps you might like to join them?"},{"name":"BARTHOLOMEW","text":"To think that I might have the chance to cross swords with a fabled hero such as you! The tournament cannot begin soon enough!"},{"name":"JENLYNS","text":"I look forward to meeting you upon the bloodsands, my friend."},{"name":"CONSTAINT","text":"<span class=\"highlight\">Forename</span>, it's so good to see you! Am I correct in assuming that you are participating in the tournament?"},{"name":"CONSTAINT","text":"Wonderful! Raw though I still am, I also received an invitation─Captain Jenlyns' work, I suspect. But know that I do not intend to simply make up the numbers."},{"name":"CONSTAINT","text":"Since last we met, I have trained without cease. Such improvements I have made, I hope to demonstrate to you in a rematch."},{"name":"FRANZ","text":"And what can I do for you this most beauteous of <span class=\"alternative-container\"><span class=\"alternative\">evenings</span><span class=\"alternative\">mornings</span><span class=\"alternative\">afternoons</span></span>? Shall I sign your flyer with my mark, perhaps?"},{"name":"FRANZ","text":"...A contestant? <span class=\"emphasis\">Really</span>? Well then, you would do well to pray you are not drawn against me."},{"name":"FRANZ","text":"Before my beauteous skills, your defeat is all but assured!"},{"name":"FRANZ","text":"I say, are you not the <span class=\"alternative-container\"><span class=\"alternative\">postwoman</span><span class=\"alternative\">postman</span></span> from before? Such a beauteous surprise this is!"},{"name":"FRANZ","text":"Since coming to terms with my brilliance, I've given up provoking my opponents in favor of polishing myself further."},{"name":"FRANZ","text":"I would love nothing more than to pit my beauteous skills against yours, and I pray that I am afforded the chance!"},{"name":"ALDIS","text":"You got business with me? Too bad, I've got none with you."},{"name":"ALDIS","text":"Leave me be and find someone else to bother. Like Mylla."},{"name":"CHILD02571","text":"You're fighting in the tournament? You look pretty strong, but it's Black Altus that's gonna win!"},{"name":"ALDIS","text":"Ahem. That's <span class=\"emphasis\">Lotus</span>. Black Lotus."},{"name":"CHILD02571","text":"Yeah, what he said! He's the strongest and he always protects me!"},{"name":"CHILD02571","text":"If you fight him, you better watch out!"},{"name":"OWYNE","text":"Ah, <span class=\"highlight\">Forename</span>! Have you spoken with the captain? He is holding on to your invitation."},{"name":"OWYNE","text":"...Already entered! Marvelous!"},{"name":"OWYNE","text":"We are all looking forward to witnessing your skill-at-arms. And if the gods are good, I shall witness them up close and personal!"},{"name":"HANDELOUP","text":"Ah, <span class=\"highlight\">Forename</span>, a pleasure as always. Are you perchance entering the tournament?"},{"name":"HANDELOUP","text":"Well then, this has become infinitely more interesting. Lest you wonder, I am joining the field as a representative of the Temple Knights."},{"name":"HANDELOUP","text":"For the honor of our order, I have every intention of winning. Do not hold back, my friend─because neither will I!"},{"name":"CONSTAINT","text":"Since last we met, I have trained without cease. Such improvements I have made, I hope to demonstrate to you in a rematch."},{"name":"FRANZ","text":"You would do well to pray you are not drawn against me. Before my beauteous skills, your defeat is all but assured!"},{"name":"FRANZ","text":"I would love nothing more than to pit my beauteous skills against yours, and I pray that I am afforded the chance!"},{"name":"ALDIS","text":"Leave me be and find someone else to bother. Like Mylla."},{"name":"OWYNE","text":"We are all looking forward to witnessing your skill-at-arms. And if the gods are good, I shall witness them up close and personal!"},{"name":"HANDELOUP","text":"For the honor of our order, I have every intention of winning. Do not hold back, my friend─because neither will I!"},{"name":"CHILD02571","text":"Black Al─er, Lotus is the strongest! If you fight him, you better watch out!"},{"name":"MYLLA","text":"Well, if it isn't <span class=\"highlight\">Forename</span>. That you would visit us at this juncture could only mean one thing: you're entering the Ul Cup."},{"name":"MYLLA","text":"Good, good! You are one of our very best, and it pleases me to see you continue seeking new challenges."},{"name":"MYLLA","text":"And mark my words, this will be a challenge the likes of which you have never experienced."},{"name":"MYLLA","text":"This tournament brings together the realm's finest. If you are to rise above them, nothing less than complete preparation will suffice."},{"name":"MYLLA","text":"Speaking of preparation, have you been apprised of the rules?"},{"name":"MYLLA","text":"Then allow me to explain. The tournament is elimination. You lose, you go home. You win, you advance to the next match, and on it goes until a champion emerges."},{"name":"MYLLA","text":"Combatants are initially divided into two groups: Nald and Thal. Sounds fancy, but they're simply labels given to two branches of the tournament tree."},{"name":"MYLLA","text":"Look, <span class=\"highlight\">Forename</span>. One of your potential opponents."},{"name":"MYLLA","text":"Knowing is half the battle, and you'd do well to learn all you can of the competition."},{"name":"BRONZEBULL","text":"Oho, if it isn't the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who forged me my winglet. 'Tis a fine weapon, and I am wholly satisfied with it...but don't think that this earns you a favor should we meet in the tournament. Indeed, any less than my all would be an affront to both blade and blacksmith."},{"name":"MYLLA","text":"...Oh dear, is it that time already? The opening ceremony is about to commence. Shall we, then?"},{"name":"DOURMEADOW","text":"Ladies and gentlemen! Today I bid you welcome to the Coliseum for a truly special event!"},{"name":"DOURMEADOW","text":"To introduce it, it gives me great pleasure to call upon Her Royal Majesty Nanamo Ul Namo!"},{"name":"NANAMOULNAMO","text":"Generations ago, my ancestor, Sasagan Ul Sisigan, founded a tournament to celebrate the skill of our nation's finest swordsmen. One hundred years have passed since it was last held. By this declaration, I do hereby revive the Ul Cup!"},{"name":"NANAMOULNAMO","text":"Let it be known that all proceeds from this event shall go towards our continuing refugee relief efforts."},{"name":"NANAMOULNAMO","text":"My dear combatants. My fellow citizens and I look forward to an inspiring performance from all of you. May Nald'thal give strength to your sword arms!"},{"name":"DOURMEADOW","text":"Thank you, Your Grace. Next, I would invite Master Adrien, Coliseum columnist for the <span class=\"emphasis\">Mythril Eye</span>, to share some insights into our combatants. What are your impressions of the field, Adrien?"},{"name":"ADRIEN","text":"Well, Dour, I'd say it's as diverse a field as I've seen on the bloodsands. In addition to everyone's favorite gladiators and your friendly neighborhood Sultansworn, we have an Ishgardian knight as well as an acclaimed adventurer."},{"name":"DOURMEADOW","text":"Truly a colorful cast of characters, all of whom bring their unique take on swordplay. With such an eclectic mix of fighting styles clashing, would you say that we're in for a veritable treat for the senses?"},{"name":"ADRIEN","text":"Yes, I would, Dour. At this stage it's anyone's guess who will claim the title, but one thing is certain: when the match bell rings, you cannot afford to bat your eyelids! Keep watching this space, for the preliminary rounds are about to begin!"},{"name":"SYSTEM","text":"The next paladin quest will be available from Mylla upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":648,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":20}],"questsType":"all","quests":[67573,67895]},"next":[68108]},"partials":[{"type":"npc","id":"1006747","obj":{"i":1006747,"n":"Jenlyns","l":41,"q":9}},{"type":"npc","id":"1001739","obj":{"i":1001739,"n":"Mylla","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1001821","obj":{"i":1001821,"n":"Bartholomew","l":41,"q":13}},{"type":"npc","id":"1012163","obj":{"i":1012163,"n":"Handeloup","l":2300,"q":15}},{"type":"npc","id":"1021342","obj":{"i":1021342,"n":"Tournament Registrar","l":41,"q":1}},{"type":"npc","id":"1021343","obj":{"i":1021343,"n":"Constaint","l":41,"q":1}},{"type":"npc","id":"1021344","obj":{"i":1021344,"n":"Franz","l":41,"q":1}},{"type":"npc","id":"1021345","obj":{"i":1021345,"n":"Black Lotus","l":41,"q":1}},{"type":"npc","id":"1021346","obj":{"i":1021346,"n":"Owyne","l":41,"q":1}},{"type":"npc","id":"1021347","obj":{"i":1021347,"n":"Handeloup","l":41,"q":1}},{"type":"npc","id":"1023881","obj":{"i":1023881,"n":"Scrubby Stripling","l":41,"q":1}},{"type":"quest","id":"67573","obj":{"i":67573,"n":"This Little Sword of Mine","g":147,"l":"Coerthas Western Highlands","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68108","obj":{"i":68108,"n":"In Thal's Name","g":147,"l":"Ul'dah","s":630,"f":1}}]}