{"quest":{"name":"In Thal's Name","location":"Ul'dah","id":68108,"patch":4.0,"sort":630,"icon":100668,"unlocksFunction":1,"eventIcon":71341,"issuer":1001739,"target":1001739,"involved":[1021271,1021275],"genre":147,"journal":["Mylla's expectant gaze tells you that the time is come.","Your tournament begins. With eight combatants in each group, you must defeat three in order to reach the final. For your first match you have drawn Bartholomew of the Sultansworn, and Mylla instructs you to proceed to the Coliseum entrance and await the call from the tournament registrar.","As you wait, Bartholomew appears and offers you some sporting words, shortly after which the call comes to take your place in the arena. A succession of grueling confrontations lies ahead; if you have any final preparations, the tournament registrar bids you tend to them now.","After outclassing Bartholomew, you stop Bronze Bull's charge before vanquishing Handeloup of the Temple Knights, thus securing your place in the Ul Cup final.","You return to the Gladiators' Guild to find your three opponents battered but otherwise whole. After trading blows, perhaps it would be a good idea to trade words in the spirit of camaraderie.","Bartholomew, Bronze Bull, and Handeloup join in congratulating you and wishing you well for the battle ahead. As you are about to go your separate ways, you learn that Mylla has been looking for you.","Describing your performance as awe-inspiring, Mylla declares her intent to win through her own group to arrange a final between guildmaster and pupil. Whoever should prove to be your opponent, you must be at no less than your best for the match.<br><br>※The next paladin quest will be available from Mylla upon reaching level 65."],"objectives":["Wait at the designated location.","Speak with the tournament registrar.","Speak with Handeloup.","Speak with Mylla."],"dialogue":[{"name":"MYLLA","text":"It begins, <span class=\"highlight\">Forename</span>!"},{"name":"MYLLA","text":"There are eight combatants in each group, meaning you must triumph in three bouts in order to advance to the final."},{"name":"MYLLA","text":"And the opponent for your first bout is Bartholomew of the Sultansworn."},{"name":"MYLLA","text":"Defeat him, and you will next face the victor of another pairing, and so on. Needless to say each encounter will be more difficult than the last."},{"name":"MYLLA","text":"But one fight at a time. The tournament registrar will call you when it's time to take to the bloodsands. Go now, and good luck!"},{"name":"MYLLA","text":"The tournament registrar will call you when it's time to take to the bloodsands. Good luck, <span class=\"highlight\">Forename</span>!"},{"name":"ATTENDANT02572","text":"<span class=\"highlight\">Forename Surname</span>, yes? If you could wait right there, I will let you know when it is time."},{"name":"BARTHOLOMEW","text":"Hah, to think that I would draw you for my very first opponent. I thank the heavens even as I curse them..."},{"name":"BARTHOLOMEW","text":"But no matter who my opponent may be, I shall fight with all my being─for the pride of the Sultansworn. See you on the bloodsands, my friend."},{"name":"ATTENDANT02572","text":"It is time, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>. Pray see to your final preparations and let me know when you are ready to proceed."},{"name":"MYLLA","text":"The tournament registrar will call you when it's time to take to the bloodsands. Good luck, <span class=\"highlight\">Forename</span>!"},{"name":"ATTENDANT02572","text":"Are you ready to enter the arena?"},{"name":"DOURMEADOW","text":"That concludes all the matches for the Thal group. And what heart-stopping encounters they were!"},{"name":"ADRIEN","text":"Verily, Dour. The crowd expected and the combatants delivered, not least of all the group winner, <span class=\"highlight\">Forename Surname</span>, who carved a convincing path to the final."},{"name":"DOURMEADOW","text":"Shall we retrace <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> steps for those who came in late?"},{"name":"ADRIEN","text":"You read my mind. <span class=\"highlight\">Forename</span>'s first match pitted <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> against Bartholomew. The Sultansworn fought with heart, but in the end he was outclassed by the star adventurer."},{"name":"DOURMEADOW","text":"Though he can take pride in his effort, unfortunately he had to take his leave of the tournament. There was no getting past <span class=\"highlight\">Forename</span>, who went on to face the hulking Bronze Bull."},{"name":"ADRIEN","text":"A veteran of countless matches here in the Coliseum, you could say he had the ground advantage. From the onset, the man brought his prodigious strength to bear, unleashing wave upon wave of punishing attacks, but <span class=\"highlight\">Forename</span> calmly weathered them all to emerge the victor."},{"name":"ADRIEN","text":"With that, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> advanced to the Thal group's final match against Handeloup of the Temple Knights. Employing blistering techniques seldom seen this side of Eorzea, the Ishgardian visitor looked dangerous indeed."},{"name":"DOURMEADOW","text":"If truth be told, for a moment there I feared for <span class=\"highlight\">Forename</span>, but the adventurer dug deep to secure victory─and a place in the Ul Cup final! Ahhh, the mere remembering of it sets my heart to racing like a runaway chocobo!"},{"name":"ADRIEN","text":"Take deep breaths, my friend, for there's still more excitement to come. The Nald group matches are due to commence shortly, with the likes of First Sword Mylla taking to the bloodsands."},{"name":"DOURMEADOW","text":"What have I done to deserve such a treat!? I won't be missing these matches, and neither should any of you!"},{"name":"ODDE","text":"All unfolds as anticipated. Good."},{"name":"SUSPICIOUSAUDIENCE02572","text":"The free paladin I told you about is living up to expectations, aye?"},{"name":"ODDE","text":"Hehehe, that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is. Keep up your winning ways, my friend, and win us a fortune."},{"name":"ATTENDANT02572","text":"Welcome back, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>, and may I offer my heartfelt congratulations for reaching the final!"},{"name":"MYLLA","text":"Well fought, <span class=\"highlight\">Forename</span>! I would congratulate you some more, but first you ought to go and speak with your opponents. After trading blows, 'tis a fine thing to trade words in the spirit of camaraderie."},{"name":"HANDELOUP","text":"<span class=\"highlight\">Forename</span>, you were magnificent. Our match will remain etched in my memory and inspire me always."},{"name":"BARTHOLOMEW","text":"I had absolutely no answer to you. Such precious things you must have protected to become so strong."},{"name":"BARTHOLOMEW","text":"As you know, we Sultansworn live to protect Her Grace. By any measure, this is a vital duty, and ever do I strive to be worthy of the role."},{"name":"BARTHOLOMEW","text":"But crossing swords with you this day, it has given me to think that perhaps it is not enough. Whatever it is that I yet lack, mayhap I shall find it in witnessing you."},{"name":"BRONZEBULL","text":"I thought I had something of a chance, but I was clearly getting ahead of myself. You gave me a thorough schooling, and I mean to take the lesson to heart."},{"name":"HANDELOUP","text":"Though my tournament may be over, I shall remain in Ul'dah to watch the matches to come. And I believe I speak for all of us here when I wish you the best of luck. Our hopes go with you now, my friend."},{"name":"HANDELOUP","text":"Oh, a woman named Mylla was looking for you. If you haven't already spoken with her, mayhap you should seek her out."},{"name":"MYLLA","text":"A place in the final! I knew you had it in you, but to witness it all unfold was nothing short of awe-inspiring!"},{"name":"MYLLA","text":"The winner of the Nald group will square off against you for the title, and suffice it to say I intend to be that person."},{"name":"MYLLA","text":"I shall see to it that a match between us becomes a reality, and I hope that I can count on your support!"}],"reward":{"gil":1884,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":20}],"quests":[68107]},"next":[68109]},"partials":[{"type":"npc","id":"1001739","obj":{"i":1001739,"n":"Mylla","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1021271","obj":{"i":1021271,"n":"Tournament Registrar","l":41,"q":3}},{"type":"npc","id":"1021275","obj":{"i":1021275,"n":"Handeloup","l":41,"q":1}},{"type":"quest","id":"68107","obj":{"i":68107,"n":"Tournament of the Century","g":147,"l":"Ul'dah","s":601,"f":1}},{"type":"quest","id":"68109","obj":{"i":68109,"n":"In Nald's Name","g":147,"l":"Ul'dah","s":650,"f":1}}]}