{"quest":{"name":"The Hunt for Ugetsu","location":"Kugane","id":68105,"patch":4.0,"sort":680,"icon":100684,"unlocksFunction":1,"eventIcon":71341,"issuer":1022184,"target":1022184,"involved":[1022204,1022205,1022206],"genre":160,"journal":["Makoto has tidings regarding Ugetsu's whereabouts.","A thorough search of Shiden's quarters has turned up missives revealing the location of the insurgent base in Yanxia. With his hold over the Sekiseigumi greatly weakened, it is believed that Ugetsu will either await your coming or bring the fight to Kugane. While Captain Kongo holds fort, he bids you and Makoto journey to the mainland to hunt down the insurgent leader. Your first stop is Namai, a farming village situated amidst the Gensui Chain.","Arriving in Namai, Makoto briefs you on her plan. While she goes on ahead to scout the ruin serving as Ugetsu's hideout, she bids you scour the area for his cohorts and deal with them as necessary.","As you survey a stretch of the Glittering Basin, you encounter an insurgent and dispatch him before he is able to raise the alarm. Keeping low and quiet, you continue on in search of other enemies.","You come upon more insurgents and silence them swiftly. Perhaps one more spot, and you may be reasonably confident that the area is secure.","Another band of insurgents appear before you, and as before, you make short work of them. The third time's the charm, and you set off to rejoin Makoto.","Ugetsu is not in Yanxia. Even as the sickening realization dawns on you, one of his henchmen confirms your fears: he is on his way to Kugane. There is no time to lose; you and Makoto must make haste back to the Sekiseigumi Barracks.","You and Makoto return to the barracks in time to see Captain Kongo squaring off against Ugetsu. The duel is over in an instant, and the captain collapses to the ground, the life draining out of him. With his last breath, he names Makoto his successor to lead the Sekiseigumi. But her authority is immediately undermined, as Ugetsu reveals that she is in fact his younger sister, Kagetsu. The insurgent leader proclaims his intent to change Hingashi with fire and blood, and invites those present to join his cause─you, his <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> pupil, included. Yet though no one answers his call, uncertainty is writ plain on all faces. Ugetsu then proposes a battle between your two factions to decide matters, but as he leaves, he taunts Makoto that she may want for allies. Makoto attempts to rally her men, but with her identity exposed, her words are met with a lukewarm response. It seems Ugetsu's words may prove to be true.","Makoto confesses all to you. She and Ugetsu were born into a samurai family in the capital, and from a tender age her brother exhibited great talent in the katana. Musosai took him as his pupil, and together they took to the road for his training. But the Ugetsu who returned was a changed man, one filled with anger and despair both, who dreamed of toppling the bakufu. The situation came to a head when he assassinated Hingan dignitaries, a crime for which his entire family paid with their lives─all except for Kagetsu herself, who managed to escape. Thereafter she journeyed to Kugane, where she took the name Makoto and knocked on the Sekiseigumi's doors. Since that time, she has lived to punish her brother, but even as his cause grows in strength, hers only weakens on account of the blood she shares with Ugetsu. With the captain gone, she has naught to depend upon save her own conviction...and you.<br><br>※The next samurai quest will be available from Makoto upon reaching level 70."],"objectives":["Join Makoto in Namai.","Survey the designated location and defeat the enemy.","Rejoin Makoto.","Speak with Makoto."],"dialogue":[{"name":"MAKOTO","text":"Great tidings, <span class=\"highlight\">Forename</span>! We've ascertained the location of Ugetsu's hideout!"},{"name":"MAKOTO","text":"Captain Kongo has the details. A moment, if you would."},{"name":"KONGO","text":"<span class=\"highlight\">Forename</span>, you are well come. We scoured Shiden's quarters, and what should turn up among his possessions but missives he received from Ugetsu. They point to a certain ruin in Yanxia."},{"name":"KONGO","text":"Now, word of Shiden's demise will have already reached Ugetsu, and he must assume that we will track him down ere long."},{"name":"KONGO","text":"But he will not─cannot─run. To do so after losing his right hand would cost him much of the momentum he has painstakingly gained."},{"name":"KONGO","text":"As I see it, two choices remain to Ugetsu. He will await our coming, or he will bring the fight to us. Either way the stakes are high."},{"name":"KONGO","text":"As you know, Ugetsu is a peerless swordsman. Only you, who bested Shiden, and perhaps myself could stand a chance against him."},{"name":"KONGO","text":"As captain, my place is here at the barracks. While I hold fort, I bid you and Makoto journey to Yanxia, there to hunt down Ugetsu."},{"name":"KONGO","text":"I shall pray for your safety and success. If instead the rogue should show himself here, rest assured I will give him a rousing welcome."},{"name":"MAKOTO","text":"Yanxia lies upon the mainland, across the Ruby Sea. We will first make for Namai, a small mountain village, and thence go after Ugetsu and his cohorts."},{"name":"MAKOTO","text":"The ruin serving as Ugetsu's hideout is near. I shall scout on ahead; meanwhile, pray scour the area for insurgents and tend to them."},{"name":"SAMURAI02569","text":"Ugh... Bakufu scum..."},{"name":"MAKOTO","text":"Ugetsu is nowhere to be seen. Then that means..."},{"name":"SAMURAI02569","text":"Aye, he's on his way to Kugane... &lt;cough&gt; To pay your captain a visit... Hehehe..."},{"name":"MAKOTO","text":"K-Kami preserve! We must hurry back!"},{"name":"SAMURAI02569","text":"Lord Ugetsu's on his way to Kugane... &lt;cough&gt; To pay your captain a visit... Hehehe..."},{"name":"MAKOTO","text":"We've no time to waste, <span class=\"highlight\">Forename</span>! Let us hurry back to Kugane!"},{"name":"Q1","text":"Return to Kugane?"},{"name":"MAKOTO","text":"Noooooo!"},{"name":"KONGO","text":"Forgive me... I was...too weak..."},{"name":"KONGO","text":"The Sekiseigumi...yours now... You must...finish... &lt;gasp&gt;"},{"name":"UGETSU","text":"Well, well. For a moment I doubted my eyes, but it really is you, Kagetsu. I hadn't expected to see you in a Sekiseigumi uniform, dear sister."},{"name":"UGETSU","text":"That stance... Yes, the very picture of Master himself. So you are Musosai's final pupil, and the samurai who felled Shiden."},{"name":"UGETSU","text":"We meet at last. Ugetsu, at your service. Like you, I trained under Musosai. And like you, I was made to walk his absurd path. We are practically <span class=\"alternative-container\"><span class=\"alternative\">brother and sister</span><span class=\"alternative\">brothers</span></span>. It's a shame, then, that we stand on opposing sides."},{"name":"UGETSU","text":"Hingashi has known peace for too long. Her leaders have grown soft, and they spend their days in decadence. Their existence is a blight, one that must be burned out with the fires of revolution."},{"name":"UGETSU","text":"To kindle this fire, I bade Shiden assassinate the Tairo. But thanks to you and yours, the attempt ended in miserable failure."},{"name":"UGETSU","text":"Till now, we have kept to the shadows, but that time is passed. No few people share our vision, and by bringing them into the fold, we shall have the strength to face the bakufu openly, and defeat it."},{"name":"UGETSU","text":"Removing your captain was the first step in this endeavor. With him gone, the good men and women of the Sekiseigumi may choose with their hearts. If there are any souls here who would join our cause, we welcome you with open arms."},{"name":"UGETSU","text":"The offer stands for you too, Kagetsu. My <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> pupil. Will you not create a new world with me?"},{"name":"MAKOTO","text":"Create? You can create naught with the edge of a blade! Nay, what you seek to do is destroy! Should the bakufu fall, Hingashi would be plunged into another Age of Blood!"},{"name":"UGETSU","text":"Blood will flow, aye, but it will serve to nourish and strengthen a new nation, one that is free of the corruption that tainted the old."},{"name":"UGETSU","text":"What we have now is not peace, but stagnance. Hingashi is become a morass of decay, and we samurai must be the tsunami that washes it clean to make way for <span class=\"emphasis\">true</span> peace."},{"name":"MAKOTO","text":"A samurai fights to ward off chaos, not create it! Have you forgotten Master Musosai's teachings!?"},{"name":"UGETSU","text":"Clearly my breath is wasted on you. But what of the others? Will you remain mindless slaves to the bakufu? Or will you join me and bring about true change?"},{"name":"UGETSU","text":"Disappointing. I had hoped some of you would see sense. But if we must fight, then so be it."},{"name":"UGETSU","text":"I have no desire to spill blood needlessly. Let us settle this away from the masses, on the Isle of Bekko. Your people against mine."},{"name":"UGETSU","text":"Though, if I may make an observation, it seems you may want for blades, dear sister. Now that your men are aware of our connection."},{"name":"MAKOTO","text":"Hear me, my comrades. As leader of the First Squad, I have been chosen to carry on Captain Kongo's legacy."},{"name":"MAKOTO","text":"The battle against Ugetsu promises to be bloody, but come what may, we must prevail. The future of Hingashi rests upon us!"},{"name":"MAKOTO","text":"Forgive me, <span class=\"highlight\">Forename</span>, but it is all true. Ugetsu is my older brother. And Kagetsu is my birth name, though I have long cast it aside."},{"name":"MAKOTO","text":"We were born into a samurai family in the capital, Bukyo. From a tender age, Ugetsu showed tremendous talent as a swordsman, and everyone knew him as a child prodigy. But to me he was always the kind and caring brother."},{"name":"MAKOTO","text":"I was proud of him, and I couldn't have been prouder when the legendary Musosai took him as a pupil. Then he took to the road for his training, and I never saw him again."},{"name":"MAKOTO","text":"'Twas a different man who returned. Instead of easy smiles, he wore frowns. Instead of good-natured quipping, he engaged in heated tirades directed at the bakufu and the great lords. There was so much anger, but more than that, there was despair─despair for his country."},{"name":"MAKOTO","text":"Not long thereafter, he parted ways with Master Musosai and began instructing me in the katana. As far as back then, I believe he harbored the dream of toppling the bakufu, and so he instilled in me the skills to survive in a war-ravaged world. In time, I came into my own as a samurai."},{"name":"MAKOTO","text":"And then it happened. My brother assassinated high-ranking officers of the bakufu, and our family was made to pay the price. Our line was ordered wiped from existence. My parents were summarily executed, and 'twas only by chance that I escaped their fate."},{"name":"MAKOTO","text":"Out on the streets and without a home, I journeyed to Kugane. I adopted the name Makoto and knocked on the Sekiseigumi's doors, with but one purpose in my mind: punishing Ugetsu."},{"name":"MAKOTO","text":"We may share the same blood, but I can never forgive him. For our parents' blood is on his hands."},{"name":"MAKOTO","text":"But for all my determination, I am no match for my brother. And while his cause grows in strength, mine only weakens."},{"name":"MAKOTO","text":"In our culture, people are defined first by their birth, and the revelation that I am kin to Ugetsu has shaken my men's faith in me. They may not accept my authority, even though the captain willed it."},{"name":"MAKOTO","text":"And with him gone, there is naught I may depend upon save mine own conviction...and you, <span class=\"highlight\">Forename</span>."},{"name":"MAKOTO","text":"Even should it cost me my life, I swear to end my brother's ambition. I pray that you will stand with me through this trying time."}],"reward":{"gil":1576,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":111}],"quests":[68104]},"next":[68106]},"partials":[{"type":"npc","id":"1022184","obj":{"i":1022184,"n":"Makoto","l":2404,"q":5}},{"type":"npc","id":"1022204","obj":{"i":1022204,"n":"Makoto","l":2410,"q":1}},{"type":"npc","id":"1022205","obj":{"i":1022205,"n":"Makoto","l":2410,"q":1}},{"type":"npc","id":"1022206","obj":{"i":1022206,"n":"Ugetsu's Henchman","l":2410,"q":1}},{"type":"quest","id":"68104","obj":{"i":68104,"n":"Matsuba Mayhem","g":160,"l":"Kugane","s":650,"f":1}},{"type":"quest","id":"68106","obj":{"i":68106,"n":"The Battle on Bekko","g":160,"l":"Kugane","s":700,"f":1}}]}