{"quest":{"name":"In Nald's Name","location":"Ul'dah","id":68109,"patch":4.0,"sort":650,"icon":100668,"unlocksFunction":1,"eventIcon":71341,"issuer":1001739,"target":1001739,"involved":[1021364,1021365,1021366,1021367,1021389],"genre":147,"journal":["Mylla is ready for action.","Before she enters the arena, Mylla suggests that you watch every Nald group match closely, as you will eventually face one of the combatants in the final. The tournament usher at the Coliseum will grant you access to the viewing gallery.","You watch from the edge of your seat as the dance of steel plays out between the Nald group combatants. Your fellow free paladin Constaint comes away with a hard-fought win over Franz the Fair, but is left too spent to have a chance against the ever-reliable Mylla. This leaves the group final to be fought between the First Sword and the mysterious Black Lotus. In a quality encounter, neither side yields the other ground, then seemingly out of nowhere Black Lotus claims victory with what can only be described as a sublime shield swipe. So it is that your opponent in the Ul Cup final is decided. As the dust settles, perhaps it would be meet to offer words of consolation to those who fell short, starting with Constaint and Franz.","You have spoken with Constaint and Franz, with the former praising Mylla's fighting style and the latter finding Black Lotus's familiar in its beauteous ferocity. Last but certainly not least, you may seek out your guildmaster.","Though disappointed by her elimination from the tournament, Mylla is pragmatic in defeat. As Franz did, however, she observes that her mysterious opponent strongly reminded her of someone. Curiously, Black Lotus now wishes to have words with you─a marked change from the disinterested tone he took with you earlier. Mylla sees no harm in obliging the man, who asks that you come to the Quicksand.","You chance to witness a tense exchange between Black Lotus and a decidedly obnoxious Lalafell. Noticing you afterwards, Black Lotus gives his hasty assurance that all is well, though he asks that your meeting be postponed. Your business thus prematurely concluded, you may return to the Gladiators' Guild to report to Mylla.","Though Mylla remains curious as to what Black Lotus desired, she turns her attention to your coming match with the man─as should you. With the Ul Cup final fast approaching, you would do well to dedicate yourself to preparing for an encounter that promises to go down in Ul'dahn history.<br><br>※The next paladin quest will be available from Mylla upon reaching level 68."],"objectives":["Speak with the tournament usher at the Coliseum.","Speak with Franz.","Speak with Constaint.","Speak with Mylla.","Wait at the Quicksand.","Report to Mylla at the Gladiators' Guild."],"dialogue":[{"name":"MYLLA","text":"The Nald group matches are about to begin."},{"name":"MYLLA","text":"As you will eventually be fighting one of us, I suggest you watch every match closely. The tournament usher outside will grant you access to the viewing gallery."},{"name":"MYLLA","text":"Now then, I'd best set about my preparations. Let us speak again later."},{"name":"MYLLA","text":"The tournament usher outside will grant you access to the viewing gallery. Let us speak again after the fighting is done."},{"name":"OBSERVERSERVICE02573","text":"Greetings, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>. Will you be watching the Nald group matches?"},{"name":"Q1","text":"Watch the Nald group matches?"},{"name":"DOURMEADOW","text":"And so the Nald group has been pared down to two combatants! While we wait for their match to begin, let us look back over the group's notable encounters."},{"name":"DOURMEADOW","text":"In the first round, local darling Franz the Fair crossed blades with Constaint, free paladin of Ishgard."},{"name":"ADRIEN","text":"Though the pundits tipped Franz as the outright favorite, the younger Constaint refused to be cowed, tenaciously staying in the game before landing a single, mighty blow that ended the proceedings. Undoubtedly one of the upsets of the tournament, and most upsetting of all for maidens the realm over."},{"name":"DOURMEADOW","text":"By that victory, Constaint booked a meeting with First Sword Mylla, who had predictably triumphed in her own opening match."},{"name":"ADRIEN","text":"For those of you who were banking on another upset, however, it was not to be. From the opening moments, it was plain from his sluggish movements that Constaint's earlier exertions had taken their toll."},{"name":"ADRIEN","text":"Meanwhile, the First Sword was all business. With her textbook-perfect technique and methodical maneuvering, she took firm control from the halfway mark and didn't let go until her opponent was on his knees."},{"name":"DOURMEADOW","text":"Ah, I believe preparations for the tournament's penultimate match are in order! Mylla, First Sword of the Gladiators' Guild, will take to the arena against Black Lotus, the mystery contestant who has soundly defeated all comers!"},{"name":"ADRIEN","text":"And Black Lotus advances to the Ul Cup final!"},{"name":"ADRIEN","text":"In another nail-biting clash, the First Sword showed her class against an unknown opponent. However, Black Lotus kept up with her blow for blow, and seemingly out of nowhere clinched victory with a magnificent parry!"},{"name":"DOURMEADOW","text":"So sublime was the timing, it calls to my mind the Sword of Nald!"},{"name":"ADRIEN","text":"Ah, now that you mention it, I can definitely see the resemblance. And with that sublime strike, our second Ul Cup finalist has been decided!"},{"name":"DOURMEADOW","text":"<span class=\"highlight\">Forename Surname</span> will take on the mysterious Black Lotus in a battle that promises to go down in Coliseum─nay, Ul'dahn history! Please look forward to it─I know <span class=\"emphasis\">I</span> will!"},{"name":"SUSPICIOUSAUDIENCE02573","text":"Sh-She lost! Mylla <span class=\"emphasis\">lost</span>!"},{"name":"ODDE","text":"Bah, so much for the lauded First Sword!"},{"name":"SUSPICIOUSAUDIENCE02573","text":"Wh-What will we do? That Black Lotus could ruin everything!"},{"name":"SUSPICIOUSAUDIENCE02573","text":"If he ends up winning the tournament, we'd be neck deep in debt paying what's owed..."},{"name":"ODDE","text":"Fret not, my friend. We already know Black Lotus's strings. As a matter of fact, we are pulling them as we speak."},{"name":"SUSPICIOUSAUDIENCE02573","text":"Truly!?"},{"name":"ODDE","text":"Do I not always say one can never have too many guarantees?"},{"name":"OBSERVERSERVICE02573","text":"Such riveting displays from both the Nald and Thal groups!"},{"name":"MYLLA","text":"Whoever this Black Lotus is, he is no ordinary swordsman..."},{"name":"FRANZ","text":"&lt;sigh&gt; To think that one more beauteous than me should be found in Ishgard... Well, there is naught for it but to train harder and grow more beauteous."},{"name":"FRANZ","text":"That Black Lotus fellow, though─there was something familiar about him. A beauteous ferocity I'd swear I've seen before, but I cannot remember where."},{"name":"CONSTAINT","text":"Mylla is truly a complete fighter, and she gave me nary a flaw or opening to exploit. I can see why she is the guildmaster."},{"name":"CONSTAINT","text":"Well, my little campaign may be over, but I take heart in the knowledge that yours continues. I shall pray for your victory!"},{"name":"MYLLA","text":"From technique to sheer strength, that Black Lotus was a class above me in all aspects. What's more, he fought with a ferocious style that resembled..."},{"name":"MYLLA","text":"But never mind that. Dwelling on it won't change the result. I was bested in a fair contest, and I shall give credit where it is due. My only regret is that I could not meet you in the final, <span class=\"highlight\">Forename</span>. It falls to you now to bring pride to our guild's name."},{"name":"MYLLA","text":"Oh, after the match, Black Lotus came and said that he wished a word with you. The way he mentioned your name gave me the impression that he knew you, but then again many people do."},{"name":"MYLLA","text":"At any rate, I don't see any harm in obliging the man. If you can spare a moment, he asks that you come to the Quicksand."},{"name":"MYLLA","text":"If you can spare a moment, Black Lotus asks that you come to the Quicksand."},{"name":"ODDE","text":"What do you want? If you know what's good for you, you will remove yourself from my presence. Right now."},{"name":"ALDIS","text":"You can threaten me all you like, but I ain't pulling out. It's poor form, see?"},{"name":"ODDE","text":"Well, far be it from me to ruin your form...but there's a trivial matter I would bring to your attention."},{"name":"ALDIS","text":"You bastard!"},{"name":"ODDE","text":"Very trivial, yes? I'm sure you will make the right decision. Hehehe..."},{"name":"ALDIS","text":"You were listening, eh? Don't worry, it's nothing I can't handle."},{"name":"ALDIS","text":"Look, I know I asked you to come here, but something's come up. We'll have to do this another time."},{"name":"ALDIS","text":"I know I asked you to come here, but something's come up. We'll have to do this another time."},{"name":"MYLLA","text":"Well? Did you meet Black Lotus?"},{"name":"MYLLA","text":"...Postponed, you say? I wonder what he wanted. If nowhere else, you could always try chatting in the arena. 'Twould hardly be the first time folk got talkative in battle."},{"name":"MYLLA","text":"I must say, though, the disappointment of elimination is swiftly giving way to anticipation. I look forward to seeing you clash with Black Lotus and, needless to say, come away with the win."}],"reward":{"gil":959,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":20}],"quests":[68108]},"next":[68110]},"partials":[{"type":"npc","id":"1001739","obj":{"i":1001739,"n":"Mylla","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1021364","obj":{"i":1021364,"n":"Tournament Usher","l":41,"q":1}},{"type":"npc","id":"1021365","obj":{"i":1021365,"n":"Franz","l":41,"q":1}},{"type":"npc","id":"1021366","obj":{"i":1021366,"n":"Constaint","l":41,"q":1}},{"type":"npc","id":"1021367","obj":{"i":1021367,"n":"Odde","l":40,"q":1}},{"type":"npc","id":"1021389","obj":{"i":1021389,"n":"Black Lotus","l":40,"q":1}},{"type":"quest","id":"68108","obj":{"i":68108,"n":"In Thal's Name","g":147,"l":"Ul'dah","s":630,"f":1}},{"type":"quest","id":"68110","obj":{"i":68110,"n":"Fade to Black Lotus","g":147,"l":"Ul'dah","s":680,"f":1}}]}