{"quest":{"name":"Tears in the Snow","location":"Ishgard","id":68100,"patch":4.0,"sort":580,"icon":100682,"unlocksFunction":1,"eventIcon":71341,"issuer":1021878,"target":1021879,"involved":[1021882,1021883,1021884,1021885,1021886,1021887,1021888,1021890,1022094],"genre":160,"journal":["A heartrending rumor has blown Momozigo's way, and Musosai has a mind to delve into it.","Momozigo has caught wind of a heartrending rumor: a young lowborn couple threw themselves off a cliff after being hounded by a lordling who fancied the girl. Though Momozigo is incensed at the self-serving highborn, Musosai states that rumors are no basis for punishment, and proposes ascertaining the truth by speaking with denizens of the Brume.","Your inquiries in the Brume have exposed a number of holes in the suicide story, the locals finding both the choice of location and the motive implausible. You hurry to report your findings to Musosai.","As Musosai mulls over your report, Momozigo's distressed cry pierces the chill air. The old samurai dashes off to investigate, and you follow on close behind.","Musosai finds a button from Momozigo's garment, but its owner is nowhere to be seen. A fearful local informs you that your friend was asking him about the suicide when unknown men came and abducted him. It seems plain that there are those who take ill to your prying. With Momozigo's life potentially in peril, Musosai decides to confront Honfraint, who was recently seen in the vicinity of the Last Vigil.","You find Honfraint standing by a ledge, on the verge of ending his life. Racked by grief and guilt both, he confesses that his father, Lord Ydrancheux, had the young couple silenced when the girl inadvertently learned of his illicit dealings. And now Momozigo is about to be silenced in the same fashion. You must get to the Black Iron Bridge before your friend ends up at the bottom of the chasm.<br><br>※In order to travel to the Coerthas western highlands, you must first complete the main scenario quest “Over the Wall.”","You arrive just in time to stop Ydrancheux's mercenaries from bundling Momozigo off the bridge. With the immediate danger passed, you may look to your friend.","After you assist Momozigo, Musosai arrives and demands that Ydrancheux surrenders. The proud lord, however, refuses to give himself up, and Musosai does not require further urging to deal the remorseless wretch his due punishment. Though your work is done, the exertion has again taken its toll on Musosai, who again falls to his knees. He somehow manages to rally to his feet, and marches off back to Ishgard while you and Momozigo watch on in worry.","Arriving in Ishgard, you are received by a distraught Momozigo, who informs you that Musosai has collapsed yet again. The old man is now resting at the inn, but the chirurgeon has given a damning diagnosis: he is gravely ill and hasn't long to live. Momozigo cannot help but wonder what it is that drives Musosai on, and suggests that perhaps the two of you might finish his duty for him. For now, however, there is little to do but wait and pray.<br><br>※The next samurai quest will be available from Momozigo upon reaching level 60."],"objectives":["Gather information in the Brume.","Report to Musosai.","Follow Musosai.","Speak with Honfraint.","Search for Momozigo at the Black Iron Bridge.","Rescue Momozigo.","Speak with Momozigo in Ishgard."],"dialogue":[{"name":"MOMOZIGO","text":"When I complained about the cold to the old man, he told me to empty my mind, and then even snow would feel toasty warm. In other words, it's all in my head. Which is to say put up with it."},{"name":"MUSOSAI","text":"Ah, <span class=\"highlight\">Forename</span>. Your aura does not lie─you've grown stronger still."},{"name":"MUSOSAI","text":"Since embarking upon our journey, you have made remarkable progress. Ere long you will be a fully fledged samurai."},{"name":"MUSOSAI","text":"But on to our mission. As we scoured the snow–swept stones and pillars of this city for evil, Momozigo came upon a disturbing rumor."},{"name":"MOMOZIGO","text":"It's just awful, <span class=\"highlight\">Forename</span>─a stage tragedy played out in real life. A young couple threw themselves off a cliff in the western highlands. &lt;sniff&gt;"},{"name":"MOMOZIGO","text":"As I hear it, the two were sweethearts from lowborn families, but the girl had the ill luck of being fancied by a young nobleman. This Honfraint tried to force them apart, and he hounded them so badly that they decided to end it."},{"name":"MOMOZIGO","text":"Two innocent lives lost, and why? Because some lordling had to think with his member! He must be punished, I tell you!"},{"name":"MUSOSAI","text":"Heartrending as this rumor is, rumors are no basis for punishment. We must ascertain the truth of the matter. Let us begin by making inquiries of the couple in the Bloom."},{"name":"MUSOSAI","text":"It appears that in this nation, a man's fate is decided not by his worth, but by his birth. Would that I could say it were not so in Hingashi..."},{"name":"PAUPERA02564","text":"The young couple what hurled 'emselves off a cliff? A right tragedy, an' no doubt, but it seems odd they'd go all the way to the western highlands to do it. No shortage of places to fall off from 'round here."},{"name":"PAUPERB02564","text":"Folk are sayin' suicide, but I ain't convinced. Knew both of them well, I did, an' they're not the sort to just give up on life, let alone each other."},{"name":"PAUPERC02564","text":"'Course I heard 'bout the poor buggers. Their luck ran out when Honfraint took a fancy to the girl. He's a greedy bastard, just like his father, Lord Ydrancheux, an' the Fury forbid you get in the way of what he wants."},{"name":"PAUPERA02564","text":"The young couple what hurled 'emselves off a cliff? A right tragedy, an' no doubt, but it seems odd they'd go all the way to the western highlands to do it. No shortage of places to fall off from 'round here."},{"name":"PAUPERB02564","text":"Folk are sayin' suicide, but I ain't convinced. Knew both of them well, I did, an' they're not the sort to just give up on life, let alone each other."},{"name":"PAUPERC02564","text":"'Course I heard 'bout the poor buggers. Their luck ran out when Honfraint took a fancy to the girl. He's a greedy bastard, just like his father, Lord Ydrancheux, an' the Fury forbid you get in the way of what he wants."},{"name":"MUSOSAI","text":"Hmmm, so a cloud of suspicion hangs over the suicide. It bears further investigation. But first things first─Momozigo has vanished yet again."},{"name":"MOMOZIGO","text":"(-Momozigo-)W-Wait! Let's talk it over! Uwaaaaaah! Help meeeeee!"},{"name":"MUSOSAI","text":"Momozigo!? He is in trouble! Come, <span class=\"highlight\">Forename</span>!"},{"name":"MUSOSAI","text":"This button is from Momozigo's garment, but he is nowhere to be seen. This bodes ill."},{"name":"PAUPERC02564","text":"Th-That little fella─was he your friend?"},{"name":"PAUPERC02564","text":"He was askin' me 'bout the suicides when some men bundled him up an' carried him off. I hope he'll be alright..."},{"name":"MUSOSAI","text":"It seems plain there are those who take unkindly to our investigation."},{"name":"MUSOSAI","text":"The time for caution is past. Let us confront this On-a-Frond himself. He was recently sighted near the Fast Fiddle, on the level above."},{"name":"MUSOSAI","text":"On-a-Frond, he is threatening to jump..."},{"name":"HONFRAINT","text":"Go away! Let me die in peace!"},{"name":"MUSOSAI","text":"If you wish to throw your life away, we will not stop you. But first, answer me something and clear your conscience."},{"name":"MUSOSAI","text":"Our companion was seized by unknown men while investigating the recent suicides, and it seems there is more to the incident than rumors would have us believe. Tell us, what truly happened?"},{"name":"HONFRAINT","text":"I-I tried to break them apart, that much is true. But they didn't kill themselves."},{"name":"HONFRAINT","text":"I brought her to the manor late one night, and she...she learned things she wasn't supposed to know. Learned how my father was dealing illicitly in Furite."},{"name":"HONFRAINT","text":"I implored Father to overlook it─tried to convince him that she wouldn't talk─but he refused to listen. He ordered them taken to the western highlands and they were...they were... &lt;sob&gt; Oh, gods, I <span class=\"emphasis\">loved</span> her! I truly did!"},{"name":"HONFRAINT","text":"As for your friend... I fear they mean to silence him, too─at the Black Iron Bridge, like they did the others."},{"name":"MUSOSAI","text":"We thank you for your honesty, and shall bother you no more. But know this: you are still young."},{"name":"MUSOSAI","text":"You have all the time in the world. To begin anew, to make amends. Unlike this tired old man."},{"name":"HONFRAINT","text":"&lt;whimper&gt;"},{"name":"MUSOSAI","text":"We haven't a moment to waste. To Slack-eye on Bridge, <span class=\"highlight\">Forename</span>!"},{"name":"MUSOSAI","text":"In order to travel to the Coerthas western highlands, you must first complete the main scenario quest “Over the Wall.”"},{"name":"HONFRAINT","text":"&lt;whimper&gt;"},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"BALLOON","text":"No witnesses! Kill <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"YDRANCHEUX","text":"Bah! Pathetic, every last man of them!"},{"name":"MOMOZIGO","text":"Gods, that was close... I thought I was a dead Lalafell..."},{"name":"MUSOSAI","text":"Forgive me my delay. The deep snow makes you work for every step."},{"name":"MUSOSAI","text":"So, you are the heartless cur who stole two innocent young lives. It is over. Surrender yourself."},{"name":"YDRANCHEUX","text":"Like hells it's over! Mistake me not for one of those useless mercenaries!"},{"name":"MUSOSAI","text":"Not a shred of remorse, lowlier than a mindless beast... Such evil cannot be suffered!"},{"name":"MUSOSAI","text":"&lt;huff&gt; Our work here is...is..."},{"name":"MOMOZIGO","text":"M-Musosai!"},{"name":"MUSOSAI","text":"Ungh... I've not come this far...to fall here..."},{"name":"MUSOSAI","text":"Worry not, my friends, 'twas but a dizzy spell. Now then, I believe we've visited all the major cities of Heir's Ear."},{"name":"MUSOSAI","text":"Momozigo, you have been a fine guide and companion both. I am grateful for your help."},{"name":"MUSOSAI","text":"All that remains is to find Kogarashi and deliver unto him his reckoning..."},{"name":"MUSOSAI","text":"<span class=\"highlight\">Forename</span>. In the course of righting wrongs across the land, you have become a great samurai. One whose skills rival even those of Kogarashi."},{"name":"MUSOSAI","text":"There is little and less left for me to teach you. I thank the kami for blessing with me such a fine pupil.<br>...Come, my friends, let us return to the city and find a place to warm ourselves."},{"name":"MOMOZIGO","text":"<span class=\"highlight\">Forename</span>, thank the gods you're here! It's Musosai! He collapsed again as soon as we entered the gates!"},{"name":"MOMOZIGO","text":"He's resting at the inn right now, but the chirurgeon... He said that the old man is ill─<span class=\"emphasis\">gravely</span> ill."},{"name":"MOMOZIGO","text":"He...he hasn't long left. It's a wonder he could even draw his katana."},{"name":"MOMOZIGO","text":"All this time, he's been pushing on by sheer force of will, punishing evildoers across the land, even saving my hide..."},{"name":"MOMOZIGO","text":"What is it that drives him on? Why does he go to such lengths to find this Kogarashi character?"},{"name":"MOMOZIGO","text":"The old man won't breathe a word on the matter, but there must be some reason. If only we knew, we could finish his duty in his stead..."},{"name":"MOMOZIGO","text":"For now, there's naught to do but keep watch over him. I'll see to that, so you needn't worry. If there's a change, you'll be the very first to know."}],"reward":{"gil":919,"xp":81600},"reqs":{"jobs":[{"lvl":58,"id":111}],"quests":[68099]},"next":[68101]},"partials":[{"type":"npc","id":"1021878","obj":{"i":1021878,"n":"Musosai","l":2300,"q":2}},{"type":"npc","id":"1021879","obj":{"i":1021879,"n":"Momozigo","l":2300,"q":3}},{"type":"npc","id":"1021882","obj":{"i":1021882,"n":"Lonely Lowborn","l":2300,"q":1}},{"type":"npc","id":"1021883","obj":{"i":1021883,"n":"Leery Lowborn","l":2300,"q":1}},{"type":"npc","id":"1021884","obj":{"i":1021884,"n":"Listless Lowborn","l":2300,"q":1}},{"type":"npc","id":"1021885","obj":{"i":1021885,"n":"Musosai","l":2300,"q":1}},{"type":"npc","id":"1021886","obj":{"i":1021886,"n":"Honfraint","l":2301,"q":1}},{"type":"npc","id":"1021887","obj":{"i":1021887,"n":"Musosai","l":2301,"q":1}},{"type":"npc","id":"1021888","obj":{"i":1021888,"n":"Momozigo","l":2200,"q":1}},{"type":"npc","id":"1021890","obj":{"i":1021890,"n":"Ydrancheux","l":2200,"q":1}},{"type":"npc","id":"1022094","obj":{"i":1022094,"n":"Musosai","l":2300,"q":1}},{"type":"quest","id":"68099","obj":{"i":68099,"n":"A Fraudster in the Forest","g":160,"l":"Gridania","s":560,"f":1}},{"type":"quest","id":"68101","obj":{"i":68101,"n":"The Face of True Evil","g":160,"l":"Ishgard","s":600,"f":1}}]}