{"quest":{"name":"Matsuba Mayhem","location":"Kugane","id":68104,"patch":4.0,"sort":650,"icon":100684,"unlocksFunction":1,"eventIcon":71341,"issuer":1022184,"target":1022203,"involved":[1022196,1022197,1022198,1022199,1022200,1022201],"genre":160,"journal":["Makoto's stricken look bespeaks a serious incident.","Captain Kongo is dead. According to Makoto, the man committed seppuku in order to atone for his failure in dealing with the insurgents. But there is no time to mourn or even hold funeral rites, for the Tairo is about to arrive, and the Sekiseigumi must ensure his safety. Makoto has been tasked with patrolling the Short Pier, and she asks that you join her in keeping watch for suspicious activity.","You stand watch at a corner of the pier, but see nothing out of the ordinary. Time to move on to the next spot.","You stand watch at a corner of the pier, and catch sight of a quaint charm on the ground. Perhaps it bears investigating.","You pick up the charm, which is rather worse for the wear and caked in blood besides. Makoto will wish to see this without delay.","Examining the blood-stained charm, Makoto realizes that she has seen it before: adorning Captain Kongo's neck. With this comes the disturbing realization that the captain may have in fact been slain by insurgents, and you rush off to the Thavnairian Consulate to find Shiden and have him bolster security around the Tairo.","You arrive at the Thavnairian Consulate, but Shiden is not there. Speaking with the Sekiseigumi present, it would seem the nature of the Tairo's visit is in fact personal and not official, and you will instead find him at Sanjo Hanamachi, the pleasure quarters of Kugane.","You catch Shiden as he is stalking into the pleasure quarters, his katana drawn. It does not take long for Makoto to deduce that he is a traitor, and he proceeds to tell you of his disillusionment with the Sekiseigumi and subsequent recruitment to Ugetsu's cause. With the preamble thus finished, you and Makoto lock swords with Shiden and his fellow turncoats. As the battle unfolds, Captain Kongo, believed dead till now, joins the fray with those still faithful, and with their help you emerge triumphant.","Rather than be taken alive, Shiden turns his blade on himself, and Captain Kongo bids a solemn farewell to his old friend. Turning to you and Makoto, the captain then reveals how he narrowly escaped death in an ambush, after which he laid low that he might keep watch over the traitors' movements. With the Tairo safe and the Sekiseigumi ranks purged of insurgents, you may return to the barracks to continue the conversation.","Captain Kongo begs your forgiveness for his earlier discourtesy, and shares with you what he was able to learn from the apprehended traitors. While much of Ugetsu's operations have come to light, little is still known of his whereabouts beyond that he makes his base somewhere in the vast expanse of Yanxia, upon the mainland. Makoto raises the doubt you have been harboring: how does serving a hedonist such as the Tairo serve the nation? For his many vices, the captain explains, the man is instrumental in keeping the realm whole, and though the bakufu may be a cesspool of corruption, it is the samurai's calling to protect the peace. Though you are come from afar, you share this calling, and both the captain and Makoto ask that you continue lending your blade to the cause.<br><br>※The next samurai quest will be available from Makoto upon reaching level 68."],"objectives":["Survey the designated location.","Examine the quaint charm.","Show the bloodstained charm to Makoto.","Speak with Makoto.","Speak with Kongo."],"dialogue":[{"name":"MAKOTO","text":"<span class=\"highlight\">Forename</span>, it's terrible!"},{"name":"MAKOTO","text":"Captain Kongo... He has committed seppuku!"},{"name":"MAKOTO","text":"He wished to atone for his failure to catch Ugetsu and all the casualties we've incurred. So he wrote in the letter they found next to his body."},{"name":"MAKOTO","text":"With His Excellency the Tairo soon to arrive in Kugane, all is in chaos; we haven't even had the chance to hold funeral rites."},{"name":"MAKOTO","text":"It is all Shiden can do to keep our order functioning. Yet function we must, for the Tairo is likely to be targeted by Ugetsu and his cohorts."},{"name":"MAKOTO","text":"As part of the security detail, I am tasked with patrolling the Short Pier area. I should be grateful for your extra pair of eyes, <span class=\"highlight\">Forename</span>."},{"name":"MAKOTO","text":"I am in your debt. If aught strikes you as suspicious, I ask that you notify me at once."},{"name":"MAKOTO","text":"Pray help me patrol the Short Pier area. If aught strikes you as suspicious, I ask that you notify me at once."},{"name":"SYSTEM","text":"There is nothing out of the ordinary."},{"name":"SYSTEM","text":"You catch sight of a quaint charm."},{"name":"MAKOTO","text":"There you are. Did you observe aught suspicious?"},{"name":"MAKOTO","text":"A charm...and it is stained with blood. But where have I seen it before...?"},{"name":"MAKOTO","text":"&lt;gasp&gt; This belonged to Captain Kongo! There is no mistake─it ever adorned his neck."},{"name":"MAKOTO","text":"But how did it come to be at the docks?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Did you actually see his body?"},{"name":"A2","text":"Perhaps he went for a stroll before taking his own life."},{"name":"MAKOTO","text":"No, I myself did not see it..."},{"name":"MAKOTO","text":"...A stroll? Captain Kongo lived and breathed his duty as a samurai. If he had resolved to commit seppuku, there would have been no hesitation."},{"name":"MAKOTO","text":"But by the same token, the dutiful captain I know would not have left us all behind to struggle for want of his leadership..."},{"name":"MAKOTO","text":"&lt;gasp&gt; Could it be...'twas but a ruse? That the captain did not kill himself, but rather was slain by insurgents?"},{"name":"MAKOTO","text":"Kami preserve... If this is true, it would mean the enemy walks among us!"},{"name":"MAKOTO","text":"We must notify Shiden at once and have him bolster security around the Tairo. To the Thavnairian Consulate, <span class=\"highlight\">Forename</span>!"},{"name":"SEKISEITAISOLDIERA","text":"If you are after Lieutenant Shiden, I'm afraid he isn't here."},{"name":"SEKISEITAISOLDIERB","text":"My blade's ready. I dare those insurgent scum to show themselves."},{"name":"SEKISEITAISOLDIERC","text":"We'll protect the Tairo with our lives."},{"name":"MAKOTO","text":"Why isn't the lieutenant here? What is he doing?"},{"name":"SEKISEITAISOLDIERA","text":"...What he's doing? Come now, <span class=\"emphasis\">surely</span> you know of His Excellency the Tairo's predilections."},{"name":"MAKOTO","text":"Y-You mean the rumors were true?"},{"name":"MAKOTO","text":"It is whispered that the Tairo is wont to indulge his voracious appetite for pleasure houses under the guise of official duty."},{"name":"MAKOTO","text":"If this is the case, then he will be in Sanjo Hanamachi, and so too will Shiden. Let us hurry!"},{"name":"MAKOTO","text":"Shiden? What are you doing?"},{"name":"SHIDEN","text":"You two... Why are you not at the docks?"},{"name":"MAKOTO","text":"I was given to understand that the Tairo is come not on official but personal business."},{"name":"SHIDEN","text":"Aye, that he is, but that is none of our concern. At any rate, I have the area well covered. You may return to your stations."},{"name":"MAKOTO","text":"Shiden, wait."},{"name":"MAKOTO","text":"There is no danger here. Why was your katana drawn?"},{"name":"SHIDEN","text":"..."},{"name":"SHIDEN","text":"You are too clever by half. More's the pity we failed to finish you off on Sakazuki."},{"name":"SHIDEN","text":"Your foreign friend was supposed to die then as well, but we underestimated Musosai's pupil."},{"name":"MAKOTO","text":"How could you, Shiden? The captain was your friend!"},{"name":"SHIDEN","text":"...Let me tell you a tale. I was born in a farming village and grew up in squalor. Our liege lord was a tyrant, one who wrung us peasants for everything we had. None dared to rise up for fear of their lives."},{"name":"SHIDEN","text":"My parents, pushed to the brink of survival, mustered the courage to speak out. For their troubles, they were promptly arrested, but it did not end there. Nay, our lord wished to make an example, and so he had them burned alive before the gathered villagers."},{"name":"SHIDEN","text":"Through gritted teeth I watched my mother and father die, powerless to help. In that moment, I vowed to myself that one day, I would change all that is wrong with the world. I took up the katana and trained like a man possessed, and eventually won a place in the Sekiseigumi."},{"name":"SHIDEN","text":"In the beginning I was overjoyed─finally, I could make a difference! But reality couldn't be more different, and ere long I came to see the Sekiseigumi for what it was: a tool of the powers that be, glorified guardsmen who patrol the streets for petty criminals."},{"name":"SHIDEN","text":"Samurai... Justice... These things are naught but hollow ideals, and they can change nothing. This I realized to my despair."},{"name":"SHIDEN","text":"But then I met Lord Ugetsu, and he awakened me to the truth: that in order to bring about true change, we must bring down the bakufu."},{"name":"SHIDEN","text":"We must tear down the establishment and dig it up from its rotted roots!"},{"name":"MAKOTO","text":"You are my comrade and I feel your pain, but Ugetsu's path leads only to death and destruction! Countless people would be made to suffer!"},{"name":"SHIDEN","text":"Hah, no more than what we endured in our village. There is no hope for Hingashi but to be reborn─in the fires of conflict!"},{"name":"MAKOTO","text":"This is madness! I will not allow your twisted vision to be realized!"},{"name":"SHIDEN","text":"Then it seems we must cross blades. But are you certain you wish to do so here, where an unwitting passerby could come to harm? It wouldn't reflect well upon the Sekiseigumi, I know."},{"name":"MAKOTO","text":"Hmph..."},{"name":"SHIDEN","text":"Let us take this to Matsuba Square. The others are out on security detail, and there will be no one to disturb us."},{"name":"KONGO","text":"It's over, Shiden."},{"name":"SHIDEN","text":"&lt;pant&gt; Over? Nay, Kongo, this is only the beginning."},{"name":"SHIDEN","text":"&lt;grunt&gt; Long live Lord Ugetsu!"},{"name":"KONGO","text":"Farewell, old friend. May we meet again in the next life."},{"name":"MAKOTO","text":"Captain, thank the kami you're safe! Will you tell us what happened?"},{"name":"KONGO","text":"I will. But first, there is something I must do."},{"name":"KONGO","text":"<span class=\"highlight\">Forename</span>, for your timely intervention, I give you my thanks. And for my earlier discourtesy, I beg your forgiveness."},{"name":"MAKOTO","text":"Allow me to thank you also. Were you not on hand, there is no telling what might have come to pass."},{"name":"KONGO","text":"With me gone, Shiden would have had free rein. He was the last any of us would have suspected."},{"name":"MAKOTO","text":"Aye... When he told us that you had committed seppuku, none thought to question it."},{"name":"KONGO","text":"Hah, a convenient lie, but a poor one. Any who know me well should know that I would not take my leave ere I had dealt with the insurgents. To do so would be the greater shame by far."},{"name":"KONGO","text":"Now then, let me recount to you my tale. Late at night, Shiden summoned me to the docks to discuss an urgent matter. As I approached him, the wretch slashed out at me without warning."},{"name":"KONGO","text":"Though I couldn't react in time to dodge the blade, for a blessing it caught my charm, sparing me a fatal wound. My momentum sent me over the docks and into the sea, where I remained until it was safe to resurface. My lungs were ripe to burst when Shiden finally left."},{"name":"MAKOTO","text":"Such an ordeal that must have been..."},{"name":"KONGO","text":"Having learned that there were traitors beside Shiden, I kept to the shadows and watched their movements. And the rest you know."},{"name":"KONGO","text":"With the Tairo safe and the traitors dealt with, we may return to the barracks. Let us continue our conversation there."},{"name":"KONGO","text":"<span class=\"highlight\">Forename</span>, my thanks again for your help."},{"name":"MAKOTO","text":"To think that Shiden was a traitor... I still struggle to believe it."},{"name":"KONGO","text":"You journeyed here from a distant land in order to lend your strength to our beleaguered order, yet I drew my blade upon you."},{"name":"KONGO","text":"As it turned out, 'twas those whom I thought I knew and trusted that betrayed me. Suffice it to say I feel a right fool."},{"name":"MAKOTO","text":"But now we have succeeded in rooting out all traitors in our ranks."},{"name":"KONGO","text":"That we have. And from those we caught, we were able to wring out some key details of their operation."},{"name":"KONGO","text":"Shiden had been seducing our men over to Ugetsu's side. Those who proved unamenable to his advances were killed, like our comrade in the recent mission. It makes my blood boil to think that those most loyal among us were struck down by treachery..."},{"name":"MAKOTO","text":"What of Ugetsu's whereabouts?"},{"name":"KONGO","text":"It appears he makes his base on the mainland, somewhere in Yanxia, but the precise location still eludes us."},{"name":"MAKOTO","text":"...Forgive me if I speak out of turn, Captain, but even as we laid our lives on the line, the Tairo went about satisfying his urges. Can we truly say that we protected the peace this day?"},{"name":"KONGO","text":"Well do I understand your frustration, Makoto. Yet for his many vices, there is no denying the instrumental role the Tairo plays in keeping the realm whole. Ever are the great lords watching for a fracture to form, by which they might break the status quo and usurp power. Through skillful intercession and manipulation, the Tairo keeps each of them in check."},{"name":"KONGO","text":"'Tis no secret that the bakufu is a cesspool of corruption, but in spite of this we must protect the peace. Such is a samurai's calling."},{"name":"KONGO","text":"Though you come to us from afar, you share this calling with us. I pray that we can continue relying upon your blade, my ijin samurai friend."},{"name":"MAKOTO","text":"Allow me to add my voice to the captain's. You are a stalwart ally to our cause and a samurai true. Master Musosai was not mistaken in choosing you."}],"reward":{"gil":2030,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":111}],"quests":[68103]},"next":[68105]},"partials":[{"type":"npc","id":"1022184","obj":{"i":1022184,"n":"Makoto","l":2404,"q":5}},{"type":"npc","id":"1022203","obj":{"i":1022203,"n":"Kongo","l":2404,"q":1}},{"type":"npc","id":"1022196","obj":{"i":1022196,"n":"Makoto","l":2404,"q":1}},{"type":"npc","id":"1022197","obj":{"i":1022197,"n":"Makoto","l":2404,"q":1}},{"type":"npc","id":"1022198","obj":{"i":1022198,"n":"Conscientious Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022199","obj":{"i":1022199,"n":"Gruff Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022200","obj":{"i":1022200,"n":"Baby-faced Sekiseigumi","l":2404,"q":1}},{"type":"npc","id":"1022201","obj":{"i":1022201,"n":"Makoto","l":2404,"q":1}},{"type":"quest","id":"68103","obj":{"i":68103,"n":"Trials of the Sekiseigumi","g":160,"l":"Ul'dah","s":630,"f":1}},{"type":"quest","id":"68105","obj":{"i":68105,"n":"The Hunt for Ugetsu","g":160,"l":"Kugane","s":680,"f":1}}]}