{"quest":{"name":"Raising the Sword","location":"Ul'dah","id":68111,"patch":4.0,"sort":700,"icon":100668,"unlocksFunction":1,"eventIcon":71341,"issuer":1001739,"target":1001739,"involved":[1021271,1021384,1021385,1023883],"genre":147,"journal":["Mylla looks at you with a twinkle in her eye.","Mylla can barely contain her excitement as she informs you the Ul Cup final will go ahead. Your long-awaited match against Aldis will take place shortly; when you are ready, the tournament registrar will show you through to the arena.","No sooner do you arrive in the arena than a damnably curious spectator exposes Black Lotus as Aldis. Though the crowd is initially shocked, Mylla succeeds in rallying everyone behind the match. At this time, Nanamo steps in and gives her blessing for the contest to proceed. With no obstacles left to bar your way, you and Aldis finally square off. At the end of a furious clash, you emerge the victor and are crowned champion of the Ul Cup. Nanamo makes to present you with the promised tome of secret techniques, but Papashan confesses that such an item never existed. The true purpose in bringing together the highest names in swordplay, he explains, was to raise the gladiatorial arts higher, with the ultimate goal of strengthening the realm in the face of multiple threats. At length, Nanamo turns her attention to the question of Aldis's banishment, and by a simple utterance grants him a royal pardon.","And so, after numerous twists and turns, the Ul Cup comes to a close. Mylla and Aldis await you back at the Gladiators' Guild.","Despite having received a pardon, Aldis chooses to continue his journey of self-discovery. Mylla protests, but he will not be swayed; his defeat to you made it clear he still wants for experience, and he will not know peace until he has gained it. As Aldis departs, he expresses his eagerness to meet you again in battle. In anticipation of that day, you resolve to continue striving for greater heights in your art.<br><br>※The next paladin quest will be available from Jenlyns once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “To Have Loved and Lost.”"],"objectives":["Speak with the tournament registrar.","Speak with Mylla."],"dialogue":[{"name":"MYLLA","text":"It's official, <span class=\"highlight\">Forename</span>! The Coliseum has agreed to host the Ul Cup final anew!"},{"name":"MYLLA","text":"In the interests of maintaining excitement, things are already in motion. And lest you wonder, Odde has since been apprehended by the Brass Blades and cannot hinder the proceedings."},{"name":"MYLLA","text":"Aldis has been informed and makes ready even as we speak, and you should likewise see to your own preparations. When all is in order, the tournament registrar will escort you through to the arena."},{"name":"MYLLA","text":"Suffice it to say I shall be cheering you on from the viewing gallery. Good luck, <span class=\"highlight\">Forename</span>, and give Aldis a kiss for me─with the rim of your shield!"},{"name":"MYLLA","text":"When all is in order, the tournament registrar will escort you through to the arena. Good luck, <span class=\"highlight\">Forename</span>, and give Aldis a kiss for me─with the rim of your shield!"},{"name":"ATTENDANT02575","text":"This is it, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>─no more sudden changes of plan! Are you ready to proceed?"},{"name":"ADRIEN","text":"Ladies and gentlemen! Finally, at long last, the moment you've all been waiting for is here: the Ul Cup final!"},{"name":"CRAFTSMANVISITOR02575","text":"Before this starts, I want to know something! Is it true Black Lotus is actually Aldis, the Sword of Nald?"},{"name":"DOURMEADOW","text":"What!? Black Lotus, I must ask you to remove your helm!"},{"name":"MERCHANTVISITOR02575","text":"Thal's balls, it's really him! What'll happen now?"},{"name":"CRAFTSMANVISITOR02575","text":"Nothing'll happen, that's what. Once expelled, a gladiator may not fight in the Coliseum again. There'll be no match."},{"name":"ALDIS","text":"(-Aldis-)Aye, that's right. All this time it was me."},{"name":"ALDIS","text":"(-Aldis-)I'm the last person who needs to be reminded of my own banishment. If you wish to call off the final, then so be it. I'll not argue."},{"name":"ALDIS","text":"(-Aldis-)Nonetheless, I ask you this: will you not let <span class=\"highlight\">Forename</span> and I fight? We promise to give you a match that the bards shall long sing of!"},{"name":"MYLLA","text":"Oh, come on! One of the greatest swordsmen of our age is about to cross swords with a fabled hero, and you have to even think about it? Every one here must be aching to see them fight! Is this not so?"},{"name":"MYLLA","text":"If there is any indication of dishonest conduct, I shall take his head myself! But give them a chance, I say! Remember the incredible performances they've given us thus far, and imagine how much finer it will be!"},{"name":"BRONZEBULL","text":"The First Sword speaks true! This is a once-in-a-lifetime event! 'Twould be a crying shame to have it end like this!"},{"name":"MERCHANTVISITOR02575","text":"Aye, listen to Mylla! I came here for a final, and I want one, dammit!"},{"name":"CRAFTSMANVISITOR02575","text":"Me, too! I've watched Aldis since I was a lad, and I want to watch him fight again! Let it happen, rules be damned!"},{"name":"NANAMOULNAMO","text":"You have no objections, <span class=\"highlight\">Forename</span>?"},{"name":"NANAMOULNAMO","text":"I must confess that I, too, have awaited the match with bated breath. There will be time enough afterwards to revisit past misdeeds."},{"name":"NANAMOULNAMO","text":"There you have it, Aldis. You have the blessing of all present."},{"name":"ALDIS","text":"(-Aldis-)Don't ever change, Mylla."},{"name":"ALDIS","text":"(-Aldis-)Come, <span class=\"highlight\">Forename</span>! Your opponent is the Sword of Nald!"},{"name":"NANAMOULNAMO","text":"A magnificent performance from start to finish! Such exquisite bladework I have seldom beheld!"},{"name":"NANAMOULNAMO","text":"Now then, perchance you have heard that the champion would be awarded a rare tome, one which holds the secret techniques of the first captain of Sultansworn."},{"name":"NANAMOULNAMO","text":"Papashan, if you would be so kind."},{"name":"PAPASHAN","text":"Ahem. If I might speak plain, Your Grace..."},{"name":"PAPASHAN","text":"The tome does not exist."},{"name":"ALDIS","text":"Well, well. I see what you did there, Master Papashan."},{"name":"ALDIS","text":"You've revived not only Sultan Sisigan's tournament, but his vision as well!"},{"name":"ALDIS","text":"Seems a history lesson is in order. Ahem. During his reign, Sultan Sasagan Ul Sisigan invited swordsmen of all lands to Ul'dah to fight with his own elite in tournaments."},{"name":"ALDIS","text":"In time, such tournaments came to attract sellswords, giving rise to a national institution: the grand diversion that is the Coliseum."},{"name":"ALDIS","text":"While that was a defining development for Ul'dah, historians believe that, in bringing together expert swordsmen, the sultan's true intent was to advance the gladiatorial arts."},{"name":"ALDIS","text":"But when the balance of power shifted away from the Royalists, the royal house lost access to the enormous funds needed to host grand tournaments."},{"name":"ALDIS","text":"The revival of the Ul Cup, the promise of a nonexistent prize... All of it was in emulation of Sultan Sasagan's vision."},{"name":"PAPASHAN","text":"You are most perceptive, Aldis. The true purpose in bringing together the highest names in swordplay was to raise the gladiatorial arts higher, as the sultan once did."},{"name":"PAPASHAN","text":"And though we walk in his footsteps, our destination lies a little farther. For it is my hope that not only Ul'dah, but Eorzea as a whole, is strengthened."},{"name":"PAPASHAN","text":"From the Garlean menace to the beast tribes and their primals, the realm is faced with numerous threats."},{"name":"PAPASHAN","text":"If we are to protect our homes and loved ones, we must keep our blades sharp and our shields strong."},{"name":"PAPASHAN","text":"Forgive me, Your Grace. Had you known there was neither tome nor technique, I feared you would not consent to the tournament."},{"name":"NANAMOULNAMO","text":"You should have consulted me from the first. As it stands, we must needs find another means of rewarding our champion."},{"name":"NANAMOULNAMO","text":"My dear <span class=\"highlight\">Forename</span>. Speak unto me your desire; I shall do mine utmost to bestow it."},{"name":"Q1","text":"What will you request?"},{"name":"A1","text":"A pardon for Aldis."},{"name":"A1","text":"Nothing."},{"name":"NANAMOULNAMO","text":"A noble request befitting your kind-hearted self. Ere I grant it, however, there is one thing I would know."},{"name":"NANAMOULNAMO","text":"...Nothing? Truly? Very well, if the champion desires naught, then the prize shall go to the next in line."},{"name":"NANAMOULNAMO","text":"Aldis. Though this was not to be your day, you fought outstandingly and may rightly stand tall. Ere I grant you your prize, however, there is one thing I would know."},{"name":"NANAMOULNAMO","text":"I am given to understand you were sentenced to exile for being party to bribery. Is this true?"},{"name":"ALDIS","text":"It is, Your Grace."},{"name":"NANAMOULNAMO","text":"I see. Very well, then."},{"name":"NANAMOULNAMO","text":"I, Nanamo Ul Namo, Sultana of Ul'dah, do hereby absolve you of all crimes."},{"name":"NANAMOULNAMO","text":"Our fair nation has need of men of your strength and skill, now more than ever. 'Twould be unconscionable to cast you aside."},{"name":"NANAMOULNAMO","text":"And to the champion, <span class=\"highlight\">Forename</span>, I offer my joyous congratulations! Your victory this day shall long remain in our hearts and minds!"},{"name":"NANAMOULNAMO","text":"Though the tournament is come to a close, I pray that all of you shall ever strive to raise your art higher─for the good of all the realm!"},{"name":"ALDIS","text":"That was a fight to remember. You've truly grown strong, my friend."},{"name":"DOURMEADOW","text":"A well-deserved victory! Congratulations!"},{"name":"CHILD02574","text":"You're even stronger than Uncle Aldy! If I'm gonna challenge you one day, I'm gonna have to train extra hard!"},{"name":"CHILD02574","text":"You're even stronger than Uncle Aldy! If I'm gonna challenge you one day, I'm gonna have to train extra hard!"},{"name":"MYLLA","text":"To think that such a motive existed for the tournament... We gladiators, too, must endeavor to do our part for the greater good of the realm."},{"name":"ALDIS","text":"Hear, hear, my dear. Ah, but the things one must do to arrange a simple match with <span class=\"highlight\">Forename</span>. Judging by how quickly you've improved in my short time away, had we fought but a few days earlier, I like to think I would've come out on top."},{"name":"ALDIS","text":"So. I'm good to return to the Coliseum?"},{"name":"DOURMEADOW","text":"You have Her Grace's personal endorsement─I'd say that's about as good as one can get. And as a finalist in the Ul Cup, you would draw decent crowds. We'd be glad to have you back."},{"name":"ALDIS","text":"Hah, I never dreamed that this day would come..."},{"name":"ALDIS","text":"Well, I suppose I'll resume my wanderings."},{"name":"MYLLA","text":"What!? You're given a royal pardon, yet you're leaving Ul'dah again!?"},{"name":"ALDIS","text":"Mylla, you watched <span class=\"highlight\">Forename</span> and I fight. For all my training during my travels, all the hardships I subjected myself to, I was no match for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"ALDIS","text":"'Tis plain I still want for experience, for knowledge and skill, and I won't be at peace until I gain it. Surely you understand this?"},{"name":"MYLLA","text":"Yes, but─"},{"name":"ALDIS","text":"Worry not, Mylla. I will visit whenever I can. After all, there's a filly back home who whinnies incessantly after me."},{"name":"ALDIS","text":"And you, my free paladin friend. Not only did you oblige me with a match, you rescued my boy and defended my honor besides. For that I cannot thank you enough."},{"name":"ALDIS","text":"I learned much and more from our encounter, and I should be glad if you got something out of it also. Keenly do I look forward to our next meeting, when we can simply square off, with no complicating factors to distract us!"},{"name":"SYSTEM","text":"This concludes the paladin quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “To Have Loved and Lost.”"},{"name":"SYSTEM","text":"Once you have done so, the next paladin quest will be available from Jenlyns."}],"reward":{"gil":2300,"action":7385,"items":[{"id":20275}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":20}],"quests":[68110]},"next":[68746]},"partials":[{"type":"npc","id":"1001739","obj":{"i":1001739,"n":"Mylla","l":41,"q":16,"t":"Guildmaster"}},{"type":"npc","id":"1021271","obj":{"i":1021271,"n":"Tournament Registrar","l":41,"q":3}},{"type":"npc","id":"1021384","obj":{"i":1021384,"n":"Aldis","l":41,"q":1}},{"type":"npc","id":"1021385","obj":{"i":1021385,"n":"Dour Meadow","l":41,"q":1}},{"type":"npc","id":"1023883","obj":{"i":1023883,"n":"Scrubby Stripling","l":41,"q":1}},{"type":"action","id":"7385","obj":{"i":7385,"n":"Passage of Arms","c":2515,"j":19,"t":4,"l":70}},{"type":"item","id":"20275","obj":{"i":20275,"n":"Chivalrous Armor Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68110","obj":{"i":68110,"n":"Fade to Black Lotus","g":147,"l":"Ul'dah","s":680,"f":1}},{"type":"quest","id":"68746","obj":{"i":68746,"n":"Worth Fighting For","g":147,"l":"Ul'dah","s":800}}]}