{"quest":{"name":"The Color of Her Hair","location":"Mor Dhona","id":68119,"patch":4.0,"sort":601,"icon":100683,"unlocksFunction":1,"eventIcon":71341,"issuer":1021493,"target":1021779,"involved":[1021772,1021773,1021774,1021775,1021778],"genre":161,"journal":["X'rhun has a proposal for your ongoing training.","X'rhun appears eager to continue your training now that his vendetta against Lambard has come to a close. Travel to the Dravanian hinterlands, and meet your mentor near the aetheryte in Idyllshire.","X'rhun proposes that you hone your skills on the Illuminati aggressors threatening the people of Idyllshire. Head towards the Arkhitekton, and survey the area for worthy opponents.","You have successfully employed your art against the mechanical soldiers of the Illuminati. Return to the Makers' Quarter and speak with X'rhun.","After praising your victory over the goblins, X'rhun begins to express concern over Arya's continued absence. Make your way back to the Arkhitekton, and search for your fellow student of red magic.","You come across an exhausted Arya in the aftermath of a hard-won battle. When you attempt to rouse her, however, she grows suddenly hostile, and you are forced to render her unconscious. Return to Idyllshire, and check on her recovery at Rowena's Center for Cultural Promotion.","Arya appears to remember next to nothing of her actions following her battle with the Illuminati forces. Speak with X'rhun, and hear his thoughts on Arya's uncharacteristic actions.","X'rhun shares his observations of Arya's sudden transformation, likening it to the change which came over Lambard before he commenced feeding on living aether. Determined to discover a cure to this dreadful condition, the Crimson Duelist bids you make ready for another expedition.<br><br>※The next red mage quest will be available from X'rhun upon reaching level 63."],"objectives":["Speak with X'rhun Tia in Idyllshire.","Survey the area and defeat enemies that appear.","Speak with X'rhun.","Rescue Arya.","Speak with Arya in Idyllshire.","Speak with X'rhun Tia."],"dialogue":[{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>. Arya. While there were lessons to be learned as I dragged you along on my quest for vengeance, 'tis time I offered a more structured approach to your training."},{"name":"XRHUNTIA","text":"With the support of you and your companions, Curtis's daughter has liberated Ala Mhigo. But rather than return in this moment of glory, I feel I can contribute more to the rebuilding of my homeland from without."},{"name":"XRHUNTIA","text":"Events are in motion to liberate Ala Mhigo from its oppressors, but I would continue aiding the struggle from without. There is much I can accomplish beyond the borders of my homeland, and Curtis's daughter already has the support of heroes such as you."},{"name":"XRHUNTIA","text":"After long years, Ala Mhigo finally has the chance to seize the reins of its destiny. But I will continue with my pilgrimage. Even from beyond the borders of my homeland, there is still much I can contribute to its struggle."},{"name":"XRHUNTIA","text":"It was two decades ago that I joined the revolutionaries. Though our motives were just, it was our actions that ultimately created a breach for the Empire to exploit. My time at the forefront of that stage has ended─to return to it now would only invite confusion and resentment."},{"name":"XRHUNTIA","text":"The revolution has since become the “Resistance,” and the right to shape the future of Ala Mhigo now rests in the hands of those who will live the coming age."},{"name":"XRHUNTIA","text":"No, I shall play my part by nurturing a new generation of red mages. I made my mark as a Crimson Duelist, but you will not be bound by my oath─you are free to decide for yourselves how best to employ the skills I teach you."},{"name":"XRHUNTIA","text":"Now, as for your studies, you are well aware of my proclivity for practical application. We must challenge you with a new frontier─a place where the strong gather in search of adventure. To Idyllshire, my friends!"},{"name":"ARYA","text":"What do you think? I bought myself new garb and blade with the coin Jessie gave me."},{"name":"ARYA","text":"If only it were as easy to improve upon my skills!"},{"name":"XRHUNTIA","text":"Young Arya has invested in her appearance, it would seem. Doesn't she look the part?"},{"name":"XRHUNTIA","text":"Right. Let's break in that new equipment! There is a hostile organization of goblins known as the “Illuminati” making trouble for the people here in Idyllshire."},{"name":"XRHUNTIA","text":"The most prominent threat to the populace seems to be the mechanical soldiers controlled by Illuminati aggressors. I say we do the locals a favor by using these clunking contraptions as combat practice!"},{"name":"XRHUNTIA","text":"After your battle with Lambard, however, that may be all they amount to. Especially for you, <span class=\"highlight\">Forename</span>─your mastery of red magic is such now that I daresay you could handle a mechanical soldier or two on your own..."},{"name":"XRHUNTIA","text":"As for you, Arya, your spells have raw power, but lack refinement. I think I would prefer to have you training alongside a partner."},{"name":"ARYA","text":"...I wish to try fighting alone."},{"name":"ARYA","text":"Please understand, I... Before I began learning magic, I felt like I scarcely existed."},{"name":"ARYA","text":"But when I work to match you and <span class=\"highlight\">Forename</span>─when I see myself improving─that's when I feel the most <span class=\"emphasis\">alive</span>."},{"name":"ARYA","text":"I want naught more than to become a full-fledged red mage! I want to stand at your side and fight as your equal."},{"name":"XRHUNTIA","text":"Well, far be it from me to stop you! Mayhap the perfect way to conquer your difficulties with white magic is to be alone in a situation which offers you little recourse but to rise above them."},{"name":"XRHUNTIA","text":"Both of you should head now towards the Arkhitekton, and find your own mechanical foes to overcome. I will be waiting for you here in the Makers' Quarter."},{"name":"XRHUNTIA","text":"You will find the opponents you seek near the Arkhitekton. Return here to me when you are victorious."},{"name":"BALLOON","text":"Pshhh... Shkohhh!<br>Slashycuts and pointystabs!"},{"name":"BALLOON","text":"Pshhh... Shkohhh!<br>Uplander asks for paingiving!"},{"name":"XRHUNTIA","text":"Ah, I have come to recognize that confident step. Well done, <span class=\"highlight\">Forename</span>!"},{"name":"XRHUNTIA","text":"...Did you happen to spot Arya on your travels? Unless I have sorely overestimated her abilities, I would have expected her to arrive not long after you."},{"name":"XRHUNTIA","text":"Hm. Arya <span class=\"emphasis\">did</span> seem intent on proving herself. Pray forgive the tortured metaphor, but I have a feeling she may have sliced off more than she could fry. Come, let us seek out our young mage, and render aid if need be!"},{"name":"ARYA","text":"<span class=\"highlight\">Forename</span>...? I did it... I won..."},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>, there you are! Is Arya unharmed?"},{"name":"XRHUNTIA","text":"My, that is a fair gathering of goblins. From the looks of it, defeating this lot took almost everything she had."},{"name":"XRHUNTIA","text":"Can you walk, my friend? I've never seen you so─"},{"name":"ARYA","text":"Give them to me..."},{"name":"ARYA","text":"Your life energies... Your souls... I must feed!"},{"name":"XRHUNTIA","text":"Her hair, it's─ She's become like Lambard! Stop this, Arya!"},{"name":"XRHUNTIA","text":"...'Tis no use─the hunger has taken over. We'll have to knock her senseless!"},{"name":"XRHUNTIA","text":"I suggest we take her back to Idyllshire, and let her rest at Rowena's establishment. I only hope she will be more amenable to discussion when she awakes..."},{"name":"XRHUNTIA","text":"They've agreed to lend us a place where Arya can recover. I'm not overly fond of owing favors to Rowena's consortium, but some days a bad deal is the best one can get!"},{"name":"XRHUNTIA","text":"As you can see, our companion has regained her senses. Mayhap it would be best if you spoke with her."},{"name":"ARYA","text":"What happened...? Did...did I truly attack you!?"},{"name":"ARYA","text":"Gods, why would I do such a thing?"},{"name":"ARYA","text":"I remember defeating that contraption; I remember falling to my knees, exhausted from spellcasting."},{"name":"ARYA","text":"I remember my thoughts fading away as a roar in my head grew louder and louder. And then...nothing."},{"name":"ARYA","text":"I don't understand what possessed me─never would I draw my blade on you or X'rhun."},{"name":"ARYA","text":"I am truly sorry. Once more my memory betrays me..."},{"name":"XRHUNTIA","text":"This was poor judgment on my part─I should not have tested you so harshly. Listen to me carefully now, Arya."},{"name":"XRHUNTIA","text":"I have seen how battle can exhaust you, but I failed to understand what grim truth such exhaustion presaged."},{"name":"XRHUNTIA","text":"In the moment you say a roaring drowned out your thoughts, the color of your hair changed quite distinctly. We witnessed a similar transformation in Lambard ere he began to feed upon living aether."},{"name":"XRHUNTIA","text":"Lambard was able to employ magicks of incredible power, but it left him hungering for life force. I believe what you experienced was a surrender to that very same hunger."},{"name":"ARYA","text":"It cannot be..."},{"name":"XRHUNTIA","text":"My erstwhile colleague described how he enacted a change in his physical being. While I suppose it is possible such a ritual was performed upon you as well, he mentioned the process requiring many years..."},{"name":"XRHUNTIA","text":"You have many more questions, I am sure, but for now you must rest. If this hunger takes hold when your aether is exhausted, then it is even more important that you recuperate from your exertions."},{"name":"XRHUNTIA","text":"And, Arya? Do not despair that you have lost yourself. After all, you are in perfect control now, are you not?"},{"name":"ARYA","text":"I am. Thank you, X'rhun."},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>, we will seek the cure to Arya's condition. Though I have little knowledge of such forbidden arts, I am confident that a determined expedition will yield the answers we require. Prepare yourself for another journey."},{"name":"SYSTEM","text":"The next red mage quest will be available from X'rhun Tia upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1514,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":112}],"questsType":"all","quests":[68118,67895]},"next":[68120]},"partials":[{"type":"npc","id":"1021493","obj":{"i":1021493,"n":"X'rhun Tia","l":67,"q":2}},{"type":"npc","id":"1021779","obj":{"i":1021779,"n":"X'rhun Tia","l":2082,"q":4}},{"type":"npc","id":"1021772","obj":{"i":1021772,"n":"X'rhun Tia","l":2082,"q":1}},{"type":"npc","id":"1021773","obj":{"i":1021773,"n":"Arya","l":2082,"q":1}},{"type":"npc","id":"1021774","obj":{"i":1021774,"n":"X'rhun Tia","l":2001,"q":1}},{"type":"npc","id":"1021775","obj":{"i":1021775,"n":"Arya","l":2001,"q":1}},{"type":"npc","id":"1021778","obj":{"i":1021778,"n":"Arya","l":2082,"q":2}},{"type":"quest","id":"68118","obj":{"i":68118,"n":"Stained in Scarlet","g":161,"l":"Northern Thanalan","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68120","obj":{"i":68120,"n":"Traced in Blood","g":161,"l":"Idyllshire","s":630,"f":1}}]}