{"quest":{"name":"Taking the Red","location":"Ul'dah","id":68112,"patch":4.0,"sort":500,"icon":100681,"unlocksFunction":1,"eventIcon":71341,"issuer":1021425,"target":1021438,"involved":[1021426,1021434,1021435,1021436,1021437],"genre":161,"journal":["A distraught lass seeks a savior for her sister.<br><br>※This quest will unlock the red mage job.","An obviously distraught girl has begged you to help rescue her sister from a group of kidnappers. It seems a passing traveler has engaged the villains in combat, but the odds are not in his favor. Head out through the Gate of Thal, and find the well-dressed lass in central Thanalan.","You arrive at the scene of the battle, only to look on in amazement as a sword-wielding mage dispatches the last of the would-be kidnappers. Recover your composure, and approach the red-garbed traveler.","The traveler introduces himself as X'rhun Tia. Having eliminated the threat to the girl's safety, he proposes a return to her sister inside the city. Head back through the Gate of Thal, and speak with the distraught lass.","The sisters express their heartfelt thanks, and confirm that X'rhun truly is a Crimson Duelist like the heroes spoken of in their father's stories. After making sure that the girls are safely on their way home, the jovial red mage suggests you share a drink together. Make your way to the Coffer & Coffin, and look for X'rhun Tia.","X'rhun appears impressed by your strength of character, and offers to teach you the rudiments of red magic even as he taught them to Alisaie. He warns, however, that the path will be a demanding one. Consider his proposal, then speak with the red mage once more.","You convey to a delighted X'rhun your decision to become a red mage. He bestows upon you a Soul of the Red Mage, and bids you absorb its knowledge in preparation for the next step on your new path. Equip the mythrite rapier, and speak with X'rhun once more."],"objectives":["Speak with the well-dressed lass at Spineless Basin.","Speak with the red-garbed traveler.","Speak with the distraught lass in Ul'dah.","Speak with X'rhun Tia at the Coffer & Coffin.","Speak with X'rhun Tia."],"dialogue":[{"name":"MERCHANTSDAUGHTERONE","text":"Oh, oh, are you an adventurer!? Please, you have to rescue my sister!"},{"name":"MERCHANTSDAUGHTERONE","text":"Some horrible people tried to kidnap us just outside the city gates! I managed to break free when a traveler stopped to help, but my sister never caught up to me."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I will save her!"},{"name":"A1","text":"Where are your parents?"},{"name":"MERCHANTSDAUGHTERONE","text":"You will!? Oh, thank you! Thank you so much!"},{"name":"MERCHANTSDAUGHTERONE","text":"Please, hurry through the gate here and just keep going straight ahead! You're sure to find them! The traveler was some sort of mage, I think, but it was one against five. Surely he couldn't stand against so many..."},{"name":"MERCHANTSDAUGHTERONE","text":"Mama and Papa left early to deal with some merchants, and the Brass Blades don't seem to care what happens outside the city walls."},{"name":"MERCHANTSDAUGHTERONE","text":"That traveler... He was some sort of mage, I think, but it was one against five. Surely he couldn't stand against so many.<br>What can I do? Won't you please help me...?"},{"name":"MERCHANTSDAUGHTERONE","text":"Head towards the Spineless Basin crossroads! Honestly, we were barely a stone's throw from the Gate of Thal!"},{"name":"MERCHANTSDAUGTERTWO","text":"Don't touch m─ Oh, you're not one of them!"},{"name":"XRHUNTIA","text":"(-Red-garbed Traveler-)...And who might you be?"},{"name":"MERCHANTSDAUGTERTWO","text":"My little sister is safe? Oh, thank goodness!"},{"name":"MERCHANTSDAUGHTERONE","text":"She's not hurt, then!? I'm so glad! Uh...did you not bring her with you?"},{"name":"XRHUNTIA","text":"You came to lend your aid? My apologies. Had I but known, I would have spared you a villain or two."},{"name":"XRHUNTIA","text":"After all, you seem to share my distaste for those who would prey upon defenseless children. Aye! Birds of a feather are we!"},{"name":"XRHUNTIA","text":"(-X'rhun Tia-)I am X'rhun Tia, a pilgrim of sorts. Might I know your name, friend?"},{"name":"XRHUNTIA","text":"(-X'rhun Tia-)<span class=\"highlight\">Forename</span>...?<br>Hmmm, now why does that strike such a familiar chord?"},{"name":"MERCHANTSDAUGHTERTWO","text":"Excuse me, I...<br>I just wanted to thank you for saving me!"},{"name":"XRHUNTIA","text":"(-X'rhun Tia-)My pleasure, child. You are unharmed, yes?"},{"name":"XRHUNTIA","text":"(-X'rhun Tia-)Good. Let us escort this brave lass to her sister, then. Lead the way!"},{"name":"XRHUNTIA","text":"The sisters are reunited! You have done a good deed this day, friend."},{"name":"MERCHANTSDAUGHTERTWO","text":"Thank you again for coming to my rescue."},{"name":"MERCHANTSDAUGHTERONE","text":"You found her, adventurer! Thank you!"},{"name":"MERCHANTSDAUGTERTWO","text":"We are very grateful for your kindness."},{"name":"MERCHANTSDAUGHTERONE","text":"...I was so scared! What did those terrible people want with us!?"},{"name":"MERCHANTSDAUGTERTWO","text":"You needn't worry about them anymore, Sister─the man in red defeated them all! You saw how he fought, with spells and steel? He's one of those heroes Papa told us about: a Crimson Duelist. ...Aren't you?"},{"name":"XRHUNTIA","text":"Hah, I did not expect to hear that name this far south into Eorzea."},{"name":"MERCHANTSDAUGTERTWO","text":"Then you <span class=\"emphasis\">are</span> a Crimson Duelist! I knew it!"},{"name":"XRHUNTIA","text":"If your papa is telling his daughters tales of red mages, then he must be from Ala Mhigo, yes?"},{"name":"XRHUNTIA","text":"Well that would explain his choice of bedtime stories. Now, shall we see you lasses home?"},{"name":"MERCHANTSDAUGTERTWO","text":"We'll be all right from here! Thank you again!"},{"name":"XRHUNTIA","text":"And away they skip, safe and happy. Now...<span class=\"highlight\">Forename</span>, was it not? I believe we've earned ourselves a celebratory drink!"},{"name":"XRHUNTIA","text":"Ahahaha! You need not feel compelled, my friend! Should the mood strike you, however, you'll find me staying over at Black Brush Station. I find the ale served at the Coffer & Coffin most agreeable."},{"name":"XRHUNTIA","text":"Ah, you came! As it so happens, the mother of those girls tracked me down and insisted I accept a reward. Once I mentioned you might be stopping by, she left a token of gratitude for you as well."},{"name":"XRHUNTIA","text":"It seems we've assisted an affluent merchant family─a revelation which might explain the attempted kidnapping. Hefty ransom, and all that. I'm told the girls were immediately assigned a capable bodyguard, however, so we can drink in peace knowing they are well protected!"},{"name":"XRHUNTIA","text":"Oh! I've remembered whence I know your name!"},{"name":"XRHUNTIA","text":"I mean, honestly, how could I forget one of the liberators of Ala Mhigo!? I blame the heat and an excess of fine ale. As a native of that troubled land, I must add mine own sincere gratitude to that of my countrymen."},{"name":"XRHUNTIA","text":"Are you not one of the champions fighting to liberate Ala Mhigo? As a native of that troubled land, I must add mine own sincere gratitude to that of my countrymen."},{"name":"XRHUNTIA","text":"At first I did not think you one and the same, but I have heard of the <span class=\"highlight\">Forename</span> whose deeds are celebrated across the four nations of Eorzea."},{"name":"XRHUNTIA","text":"It was Alisaie who first mentioned you to me. After the tenth or so time some incident had her loudly wishing to have “<span class=\"highlight\">Forename</span>'s courage” or “<span class=\"highlight\">Forename</span>'s strength,” I became rather curious to meet you myself."},{"name":"XRHUNTIA","text":"...Ah, how do I know the indomitable Alisaie? Our paths crossed quite by chance─a fellow traveler met upon the road. She expressed an interest in red magery, and persuaded me to instruct her in the basics of the art."},{"name":"XRHUNTIA","text":"It was Alisaie who first mentioned you to me. After she had alluded to more than a few of your more famous exploits, I became rather curious to meet you myself."},{"name":"XRHUNTIA","text":"...Ah, how do I know the indomitable Alisaie? Our paths crossed quite by chance─a fellow traveler met upon the road. She expressed an interest in red magery, and persuaded me to instruct her in the basics of the art."},{"name":"XRHUNTIA","text":"I learned of you first from a young lass named Alisaie, whom I met upon the road. She expressed an admiration for your growing exploits, even as she persuaded me to teach her the basics of red magery."},{"name":"XRHUNTIA","text":"She proved a quick study in the arcane side of things, but fencing was something of a challenge. By the end of our lessons, however, she had learned to combine spellcraft with swordplay: when to cast from afar, and when to lunge forward with a well-timed thrust!"},{"name":"XRHUNTIA","text":"...And what of you, my friend? Have you any interest in the art? I suspect you would make an exceptional red mage!"},{"name":"XRHUNTIA","text":"I am deadly serious. A <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who would rush to the aid of a stranger's child without fear or hesitation is a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I would trust with the power of red magic. But even beyond that..."},{"name":"XRHUNTIA","text":"I sense in you a kindred spirit."},{"name":"XRHUNTIA","text":"Be warned, however, that my style of teaching is a practical one─I will expect you to join me on my journey, and assist me in aiding others. Accept those terms, and I will bestow upon you the accoutrements of a red mage."},{"name":"XRHUNTIA","text":"Are you familiar with soul crystals? This particular stone is attuned to past wielders of red magicks, and will fill your mind with a firm foundation of technique. You need only reach forth your hand."},{"name":"XRHUNTIA","text":"Are you prepared to walk the path of a red mage? One word, and the soul crystal is yours."},{"name":"Q1","text":"Will you become a red mage?"},{"name":"XRHUNTIA","text":"You will not regret this decision, my friend!<br>...Gods above! For a moment there, I thought you meant to refuse me!"},{"name":"XRHUNTIA","text":"A host of red mages committed their memories to this gem. And now it is yours."},{"name":"XRHUNTIA","text":"Absorb the knowledge it contains, then we will discuss the finer points of red magic. Ah, but first, I should give you that reward!"},{"name":"XRHUNTIA","text":"I understand that this is a road not lightly taken. Should you have a change of heart, however, know that you are always welcome to take up the red!"}],"reward":{"gil":939,"items":[{"id":17740},{"id":20389},{"id":20621}],"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":34}]},"next":[68113]},"partials":[{"type":"npc","id":"1021425","obj":{"i":1021425,"n":"Distraught Lass","l":41,"q":1}},{"type":"npc","id":"1021438","obj":{"i":1021438,"n":"X'rhun Tia","l":43,"q":2}},{"type":"npc","id":"1021426","obj":{"i":1021426,"n":"Well-dressed Lass","l":43,"q":1}},{"type":"npc","id":"1021434","obj":{"i":1021434,"n":"Red-garbed Traveler","l":43,"q":1}},{"type":"npc","id":"1021435","obj":{"i":1021435,"n":"Distraught Lass","l":41,"q":1}},{"type":"npc","id":"1021436","obj":{"i":1021436,"n":"X'rhun Tia","l":41,"q":1}},{"type":"npc","id":"1021437","obj":{"i":1021437,"n":"Well-dressed Lass","l":41,"q":1}},{"type":"item","id":"17740","obj":{"i":17740,"n":"Soul of the Red Mage","l":30,"c":26056,"t":62}},{"type":"item","id":"20389","obj":{"i":20389,"n":"Mythrite Rapier","l":115,"c":36747,"t":97,"p":16394}},{"type":"item","id":"20621","obj":{"i":20621,"n":"Red Attire Coffer (IL 115)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68113","obj":{"i":68113,"n":"The Crimson Duelist","g":161,"l":"Central Thanalan","s":501,"f":1}}]}