{"quest":{"name":"The Crimson Duelist","location":"Central Thanalan","id":68113,"patch":4.0,"sort":501,"icon":100681,"unlocksFunction":1,"eventIcon":71341,"issuer":1021438,"target":1021447,"involved":[1006355,1021439,1021440,1021441],"genre":161,"journal":["X'rhun wishes to teach you the origins of red magic.","X'rhun gives you a brief lecture on the origins of red magic, describing how the art was founded on the schools of black and white magic as a means to survive the very disaster those ancient disciplines were known to have caused. Realizing that a history lesson is no substitute for practical experience, however, X'rhun suggests that an attempt to uncover the identity of the kidnappers might provide the battle practice you require. Follow the Crimson Duelist to the Church of Saint Adama Landama in eastern Thanalan.","You join X'rhun at the church, and speak with Father Iliud regarding the unsettling spellcasters that attacked the young sisters scant yalms from Ul'dah's gates. While unable to identify the cabal, Father Iliud appears to recognize the nature of the kidnappers' tattoos, proclaiming them cursed sigils that erase the will of the bearer. After urging the father to continue his investigation, X'rhun bids you follow him outside. Though playful in tone, his choice of words suggest that you had best prepare for hostilities...","You exit the church to discover that the mysterious cabal has been trailing your movements. Following X'rhun's unsuccessful attempt to parley, you are soon drawn into a protracted battle against the cultists and their minions. Your implacable foes show neither fear nor remorse, and their leader freely sacrifices himself to summon a monstrous void hound. Eventually, however, your newly acquired red magic triumphs over the massive beast. Speak with X'rhun and discuss the aftermath of the battle.","X'rhun crouches by the corpse of one of your ambushers, and studies the cursed sigil upon her cheek. Vowing to hunt down the vile puppeteer behind this abominable act, he bids you return to the church's lichyard.","Back at the church, X'rhun shares with you the tale of the Crimson Duelists' formation and their failed crusade against the tyrannical King Theodoric. Despite the loss of his companions, however, the red mage appears unshaken in his resolve to defend the weak and uphold the common good. If you wish to continue studying red magic at his side, then it seems that you, too, must be willing to walk this uncompromising road.<br><br>※The next red mage quest will be available from X'rhun Tia upon reaching level 52."],"objectives":["Rendezvous with X'rhun Tia at the Church of Saint Adama Landama.","Speak with X'rhun Tia.","Defeat the ambushers!","Defeat the enemy!"],"dialogue":[{"name":"XRHUNTIA","text":"Ah, I see from the glint in your eye that the soul crystal has surrendered its secrets. Welcome to the ranks of the red mages."},{"name":"XRHUNTIA","text":"The art we practice is born of noble origin. Its balanced and controlled energies were once used to stem the tide of destruction, and reclaim a future for the dispossessed."},{"name":"XRHUNTIA","text":"I speak of the age, some fifteen hundred years past, when the clash of two sorcerous civilizations brought about the Sixth Umbral Calamity."},{"name":"XRHUNTIA","text":"Ere the great floods rose, people fled from their homes and into the mountains of Gyr Abania. Even mages of Mhach and Amdapor were to be found amongst the refugees."},{"name":"XRHUNTIA","text":"These wizardly practitioners became targets of retribution for the part they played in upsetting the natural balance, and soon did they shed their robes of black and vestments of white. If people were to survive and rebuild following the disaster, however, they would need the power of the arcane."},{"name":"XRHUNTIA","text":"Thus were the principles of black and white magery reinvented, and upon their combined foundation an entirely new discipline was built: red magic."},{"name":"XRHUNTIA","text":"Ah, but I have prattled on about the history of it for long enough─far better that you experience red magic firsthand! There remains the mystery of who sent kidnappers after those poor girls, and I've a feeling attempts to unearth the culprit will provide the battle practice you require."},{"name":"XRHUNTIA","text":"Before we plunge into the fray, however, there are questions I would ask. Come with me to eastern Thanalan, to the Church of Saint Adama Landama."},{"name":"ILIUD","text":"So, you are under the tutelage of X'rhun Tia? I think you will find the path of a red mage to be a challenging yet satisfying one."},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>, there you are! I would introduce you to Father Iliud, but I believe the two of you are already acquainted."},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>, there you are! May I introduce you to Father Iliud?"},{"name":"ILIUD","text":"X'rhun has told me a tale of nefarious spellcasters and their attempt to kidnap two young girls. And you wish to ask if this thaumaturgical cabal is known to me, yes?"},{"name":"ILIUD","text":"There are several such cults which come to mind, but I must have more detail. You say each member shared some rather unusual traits...?"},{"name":"XRHUNTIA","text":"Aye. Not one word spoken over the entire exchange; not one shift in expression when I urged them to yield. Each of them also appeared branded with some manner of tattoo─a sigil pulsing with arcane energy..."},{"name":"ILIUD","text":"Ah, an evil practice. Such cursed sigils are known to destroy the will of the bearer, resulting in a biddable puppet which acts in much the manner you have described. There is no salvation for such wretched creatures."},{"name":"XRHUNTIA","text":"Then we must seek the fiends who pull their strings. Pray learn what you can of this cabal and its purpose, Father."},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>, we have another task to attend to. Might I suggest some light stretching before you step outside? You'll soon understand why!"},{"name":"SYSTEM","text":"You have learned all red mage actions and traits to level 50. Detailed descriptions can be viewed in the <span class=\"highlight\">Actions & Traits</span> window, accessed under <span class=\"highlight\">Character</span> in the main menu."},{"name":"ILIUD","text":"X'rhun awaits you outside the church. His tone was playful, but I urge you to take his suggestion seriously and prepare for hostilities."},{"name":"XRHUNTIA","text":"Did you notice we were being followed, <span class=\"highlight\">Forename</span>? The very cabal we are investigating seems to have taken an interest in us."},{"name":"XRHUNTIA","text":"I sense an ambush in the offing. Do they seek to silence us, perhaps?"},{"name":"XRHUNTIA","text":"Well, let them try! This will be the perfect opportunity for you to test your newly acquired skills. But first, a brief lesson."},{"name":"XRHUNTIA","text":"A red mage's spells belong to two distinct schools, rooted as they are in the ancient disciplines of black and white magic."},{"name":"XRHUNTIA","text":"Intertwined, they form the solid core of red magic, and through the balanced casting of both disciplines can a red mage build this foundation higher and higher."},{"name":"XRHUNTIA","text":"When your strength has reached its peak, that is when you lunge forward and unleash the energies thrumming within your blade! And then you leap away, returning to the first step. It is a dance, my friend!"},{"name":"XRHUNTIA","text":"Come out, come out, wherever you are! We have no intention of running or hiding from you."},{"name":"XRHUNTIA","text":"I wear a sword, as you can see, but I am not partial to violence. Is there no chance we might attempt a parley in lieu of bloodletting?"},{"name":"XRHUNTIA","text":"...How unsettling.<br>Well, <span class=\"highlight\">Forename</span>, it seems you will have your battle. Remember what I have taught you!"},{"name":"QIB","text":"Start with the fundamentals!<br>Cast both black and white magic as evenly as possible!"},{"name":"QIB","text":"Hmph. Now they send another.<br>We were not expected to survive the first attack."},{"name":"XRHUNTIA","text":"These puppets must have a leader lurking nearby. Let us take the battle to our ambushers, shall we?"},{"name":"XRHUNTIA","text":"...Ah, but before we resume the hunt, let us be sure of your technique. As a red mage you are capable of casting two spells in rapid succession using what is known as the “Dualcast” effect."},{"name":"XRHUNTIA","text":"Intone a short spell, and you will find that a lengthy incantation can now be cast in an instant. Take advantage of this technique to bombard your foes with arcane destruction!"},{"name":"QIB","text":"Remember! Balance black and white, and take full advantage of Dualcast!"},{"name":"QIB","text":"What have we here?<br>A wayward orb of aether?"},{"name":"QIB","text":"Another orb?<br>...Ah, the fallen send aether to their allies!"},{"name":"QIB","text":"Follow the sphere!<br>It will lead us to the source of this ambush!"},{"name":"QIB","text":"The aether of the fallen...<br>Gathered for some dark purpose, I'll wager!"},{"name":"QIB","text":"Hound of the nether realm, accept this feast of souls! May our lives serve as payment for the destruction of our foe!"},{"name":"QIB","text":"He sacrificed himself to that demon dog just to kill <span class=\"emphasis\">us</span>? I'd be flattered if I weren't so horrified. Ware those fangs!"},{"name":"QIB","text":"Aye, that's the way!<br>Now channel that power through your blade!"},{"name":"QIB","text":"Your energies are imbalanced!<br>Weave black and white evenly to build your strength!"},{"name":"QIB","text":"Well struck! I felt the potency of your blows from here!"},{"name":"QIB","text":"Keep your distance from the aether it spews!"},{"name":"QIB","text":"Your energies approach their apex!<br>Watch for an opening, then plunge your blade home!"},{"name":"QIB","text":"Balance your spells! Black and white! You cannot empower your blade with uneven casting!"},{"name":"QIB","text":"An impressive display!<br>You were born to wield the red!"},{"name":"QIB","text":"I did not...survive this long...to..."},{"name":"XRHUNTIA","text":"Well done, <span class=\"highlight\">Forename</span>─you have exceeded my expectations!"},{"name":"XRHUNTIA","text":"...Which is a fortunate thing, for I did not anticipate the arrival of that fearsome hound. These mages were willing to forfeit their own lives to ensure that we lost ours..."},{"name":"XRHUNTIA","text":"Do you see? The brand on her left cheek? This is the cursed sigil which stole her will and left her vulnerable to the most heinous of commands."},{"name":"XRHUNTIA","text":"Our ambushers were young men and women, every one; all transformed into mindless pawns by some hidden master."},{"name":"XRHUNTIA","text":"And this master has shown no compunction against sacrificing pieces that outlive their usefulness. No, this cannot stand."},{"name":"XRHUNTIA","text":"Heed me, <span class=\"highlight\">Forename</span>. You have begun your education in red magic, but there is much more I would teach you. Come, let us return to the lichyard."},{"name":"ILIUD","text":"The din of battle has quieted, it seems. Whilst I will not counsel prudence to one of your experience, I pray that you at least consider a watchful trot into danger rather than a headlong charge..."},{"name":"XRHUNTIA","text":"...Know you the history of these graves?"},{"name":"XRHUNTIA","text":"The church's lichyard is the final resting place for many victims of the Seventh Umbral Calamity. Red magic was conceived to stem such tides of destruction, in an age when the abuse of sorcery flooded the world with death."},{"name":"XRHUNTIA","text":"Its distinction from earlier disciplines is key: whilst practitioners of black and white magic draw upon ambient aether, a red mage weaves <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> spells using only the reserves of mana with which <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was born. In the era in which red magic was created, to do otherwise was forbidden."},{"name":"XRHUNTIA","text":"To manifest more powerful effects, the first red mages adopted a method by which precise sword techniques would harness and amplify the energy of their spoken incantations─the mage's own physical form serving as an arcane accelerator. An ingenious way of preserving their self-imposed limitations."},{"name":"XRHUNTIA","text":"Understand that the blade we wield is not simply a weapon: it is the focus of all our efforts to lessen strife and suffering!"},{"name":"XRHUNTIA","text":"Every generation of red mage is part of an unending battle. We are soldiers who fight for those enduring violence and subjugation, the bulwark against the unkind vagaries of fate."},{"name":"XRHUNTIA","text":"...Twenty years ago I joined the revolutionaries in Ala Mhigo, and learned red magic alongside like-minded companions. We formed the Crimson Duelists, and together we rose up against the tyranny of the mad king Theodoric."},{"name":"XRHUNTIA","text":"...We were crushed. Of all the Duelists, only I survived to watch our homeland languish under the rule of imperial invaders. Until you arrived there, of course."},{"name":"XRHUNTIA","text":"...We were crushed. Of all the Duelists, only I survived to watch our homeland languish under the rule of imperial invaders."},{"name":"XRHUNTIA","text":"Even after leaving Ala Mhigo, I never ceased fighting for its liberation. And when I learned of the Calamity─of the threat to all the lands of Eorzea─I allied myself with the valiant scholars of Sharlayan."},{"name":"XRHUNTIA","text":"In the end, I was unable to protect my homeland or halt the approach of fiery disaster. But never once in all these years have I betrayed the oath the Duelists swore to champion the weak with heart and steel."},{"name":"XRHUNTIA","text":"...Such is the nature of the magic you will learn from this idealistic fool. If you would master this art, however, then my road shall become <span class=\"emphasis\">your</span> road for the duration of your studies!"},{"name":"XRHUNTIA","text":"I will remain here at the church for the time being, and be a pest to the good Father Iliud until we uncover the origins of this cult. Your only chore shall be to reflect upon the lessons of the day and prepare for our next encounter!"}],"reward":{"gil":1666,"xp":48000},"reqs":{"jobs":[{"lvl":50,"id":112}],"quests":[68112]},"next":[68114]},"partials":[{"type":"npc","id":"1021438","obj":{"i":1021438,"n":"X'rhun Tia","l":43,"q":2}},{"type":"npc","id":"1021447","obj":{"i":1021447,"n":"X'rhun Tia","l":44,"q":2}},{"type":"npc","id":"1006355","obj":{"i":1006355,"n":"Iliud","l":44,"q":9}},{"type":"npc","id":"1021439","obj":{"i":1021439,"n":"X'rhun Tia","l":44,"q":2}},{"type":"npc","id":"1021440","obj":{"i":1021440,"n":"X'rhun Tia","l":44,"q":1}},{"type":"npc","id":"1021441","obj":{"i":1021441,"n":"X'rhun Tia","l":44,"q":1}},{"type":"quest","id":"68112","obj":{"i":68112,"n":"Taking the Red","g":161,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"68114","obj":{"i":68114,"n":"A Rewarding Struggle","g":161,"l":"Eastern Thanalan","s":520,"f":1}}]}