{"quest":{"name":"A Rewarding Struggle","location":"Eastern Thanalan","id":68114,"patch":4.0,"sort":520,"icon":100681,"unlocksFunction":1,"eventIcon":71341,"issuer":1021447,"target":1021457,"involved":[1006355,1021439,1021448,1021450,1021451,1021452,1021453,1021456,1021658],"genre":161,"journal":["X'rhun is ready to continue the investigation into the mystery cabal.","X'rhun inquires after your training, and suggests another round of practical experience. Head inside the Church of Adama Landama, and hear what Father Iliud has to share regarding your sigil-branded ambushers.","Father Iliud recalls a similar kidnapping incident in Ul'dah which resulted in the sorcerous death of an Ala Mhigan-born merchant and his son. Fearing that the girls' father, Wilkin, was the true target of the cabal, you resolve to meet with the merchant and warn him of the danger. Join X'rhun in the entrance hall of the Manderville Gold Saucer.<br><br>※The Gold Saucer is unlocked by completing the quest “It Could Happen to You,” available at level 15 in Ul'dah on the Steps of Nald.<br><br>※The quest “It Could Happen to You” also requires you to have completed the main scenario quest “<span class=\"alternative-container\"><span class=\"alternative\">The Lominsan Envoy</span><span class=\"alternative\">The Gridanian Envoy</span><span class=\"alternative\">The Ul'dahn Envoy</span></span>.”","You rendezvous with X'rhun, and he expresses a desire to observe the merchant in his dealings before making contact. Make your way to the Manderville Lounge, and listen in on Wilkin's meeting.","From a discreet distance, you overhear Wilkin offering some manner of contribution to a nervous-looking youth. Confront the merchant about the true nature of this exchange.","Wilkin confesses to his clandestine support of the Resistance, and X'rhun explains how such actions have likely marked him for assassination. The merchant mentions a forthcoming trek into western Thanalan, and you offer your protection as you continue investigations into the mysterious cabal. Head to Vesper Bay, and coordinate your efforts with X'rhun.","Upon your arrival in Vesper Bay, X'rhun proposes that you each scout out the two most likely sites for an ambush. Venture into the tunnel that leads into the port town, and scour the area for assassins.","You defeat the force lurking in the tunnel. Return to Vesper Bay and report your success to X'rhun.","After commending you on a job well done, X'rhun tells of how he purposefully let one of the assassins escape. The Crimson Duelist bids you make sure of Wilkin's arrival in Vesper Bay, then leaves to track the fleeing mage.","You meet with Wilkin at the entrance to the port town, and the thankful merchant hands you a token of his gratitude. Seek out X'rhun near the coast of the Footfalls that you might share with him Wilkin's reward.","You find X'rhun standing at the cliff's edge, having witnessed his quarry being fished from the sea by a rowing boat and ferried to a merchantman anchored out in the bay. Though occupied by thoughts of the cabal's hidden leader, X'rhun is distracted by the gift you have brought from Wilkin. According to a note that accompanied the parcel, it seems that this is not the first time the Crimson Duelist has saved the merchant's life. A firm believer in fighting for the common good, X'rhun's resolve seems further strengthened by this simple acknowledgement of his deeds.<br><br>※The next red mage quest will be available from X'rhun Tia upon reaching level 54."],"objectives":["Speak with Iliud.","Speak with X'rhun Tia in the Gold Saucer entry hall.","Survey the scene at the Manderville Lounge.","Speak with Wilkin.","Rendezvous with X'rhun Tia at Vesper Bay.","Search the tunnel for assassins.","Speak with X'rhun.","Speak with Wilkin.","Deliver Wilkin's gift to X'rhun Tia."],"dialogue":[{"name":"ILIUD","text":"I am yet delving into the origins of this frightful cabal. I assure you that the moment I learn aught of value, however, I will pass the information on to X'rhun."},{"name":"XRHUNTIA","text":"How fares your training, my friend? I imagine you have grown quite accustomed to the shift between spellcraft and swordplay by now."},{"name":"XRHUNTIA","text":"I will continue to instruct you, but as I have said before, practical experience will serve you far better than any tiresome lecture. It is important that you treat every battle as an opportunity to learn."},{"name":"XRHUNTIA","text":"Speaking of which, Father Iliud mentioned that he had something he wished to discuss regarding our sigil-branded ambushers. Let's head inside, shall we?"},{"name":"XRHUNTIA","text":"I wonder what the good father has discovered?"},{"name":"ILIUD","text":"I am ashamed that it did not occur to me earlier, but I recall an incident that may be connected to this dreadful cult."},{"name":"ILIUD","text":"A merchant's son was kidnapped in Ul'dah some moons ago... When the merchant came to pay the ransom, however, both father and child were murdered. The perpetrators of this terrible act were never unmasked, but evidence at the scene suggests the two were slain by thaumaturgy."},{"name":"ILIUD","text":"What is more, this merchant was a native of Ala Mhigo. Is this not also true of the father of the girls you rescued...?"},{"name":"XRHUNTIA","text":"Aye, he is Ala Mhigan-born. A man by the name of Wilkin, so his wife told me. Could <span class=\"emphasis\">he</span> have been the true target of the kidnappers?"},{"name":"XRHUNTIA","text":"We must speak with Master Wilkin at once─there are too many similarities in these cases to ignore. And I would not put it past this cult to make a direct attempt on his life!"},{"name":"ILIUD","text":"In anticipation of such action, I inquired after Master Wilkin's trading itinerary. It seems he is presently conducting business at the Manderville Gold Saucer, delivering stock for game prizes or some such."},{"name":"XRHUNTIA","text":"Very resourceful of you, Father, thank you! Come, <span class=\"highlight\">Forename</span>: the Gold Saucer awaits!"},{"name":"SYSTEM","text":"To gain access to the Gold Saucer, you must first accept (or have completed) the quest “It Could Happen to You,” available at level 15 in Ul'dah on the Steps of Nald."},{"name":"SYSTEM","text":"Please note that in addition to the level requirement, the quest “It Could Happen to You” also requires you to have completed the main scenario quest “<span class=\"alternative-container\"><span class=\"alternative\">The Lominsan Envoy</span><span class=\"alternative\">The Gridanian Envoy</span><span class=\"alternative\">The Ul'dahn Envoy</span></span>.”"},{"name":"ILIUD","text":"X'rhun has already departed for the Gold Saucer. I can only hope that our concerns for Master Wilkin's life prove unfounded..."},{"name":"XRHUNTIA","text":"My apologies, <span class=\"highlight\">Forename</span>─I neglected to ask if you were a patron of these halls. But we are here now, and Master Wilkin is still occupied with his trade. I am tempted to eavesdrop on his dealings to learn what manner of man we are saving..."},{"name":"XRHUNTIA","text":"Let us play the part of happy gamblers, and wander by his meeting in the Manderville Lounge. Just look for the wonderfully hideous golden statue!"},{"name":"XRHUNTIA","text":"...There's our Master Wilkin."},{"name":"RESTLESSGUY02578","text":"Thank you again...<br>We'll make the most of this gift, I promise you!"},{"name":"MERCHANT02578","text":"Back straight and head up now, lad, or folk will become suspicious. You've done naught wrong, besides─the coin is fair-gotten and freely given."},{"name":"XRHUNTIA","text":"The young man he was talking to... He is known to me. One of the lads belonging to the Ala Mhigan Resistance, if I'm not mistaken."},{"name":"XRHUNTIA","text":"Well, this is clearly more than some simple business deal. But why waste time on suppositions when we can speak with the merchant himself, eh?"},{"name":"XRHUNTIA","text":"We've stumbled upon some secret dealing─that much is obvious─but I suggest we allow Master Wilkin the chance to explain himself."},{"name":"MERCHANT02578","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span> and Master X'rhun! Glad I am for this chance to thank you in person for the kindness you showed my daughters! A “Father Iliud” sent word to expect you."},{"name":"MERCHANT02578","text":"...He also mentioned that the danger to my family is not yet passed. You suspect that I have been marked for assassination?"},{"name":"XRHUNTIA","text":"Aye. Have you any idea of the why? Say, retaliation for funneling funds to the Ala Mhigan Resistance under the guise of standard business dealings?"},{"name":"XRHUNTIA","text":"...I thought as much. I recognized your “client” as one of the young freedom fighters I'd seen in Gyr Abania."},{"name":"XRHUNTIA","text":"Oh, rest assured that your secrets are safe with us! I myself have spent the better part of my life aiding the Resistance. Your dealings do, however, seem to have drawn some rather unpleasant attention."},{"name":"MERCHANT02578","text":"Very well... You saved my children's lives, and so I will trust you with the truth."},{"name":"MERCHANT02578","text":"Many Ala Mhigan refugees are employed here at the Gold Saucer, in no small part due to the wishes of the establishment's owner, Lord Godbert Manderville."},{"name":"MERCHANT02578","text":"Several of these employees have direct ties to the Resistance─the young man you saw being one such conduit. As to why I meet them here, well...it is a matter of hiding the trees within the forest."},{"name":"XRHUNTIA","text":"There was another incident not so long ago where the son of an Ala Mhigan-born merchant was kidnapped by a cadre of mages. When the father attempted to pay the ransom, the fiends slew both parent and child. I fear this scenario was one they hoped to repeat with you..."},{"name":"MERCHANT02578","text":"Yes, a terrible turn of events, that was! I did not know the merchant personally, but I knew of his efforts. He, too, was said to have supported the Resistance with the fortune he made in Ul'dah."},{"name":"XRHUNTIA","text":"And there we have our connection─they seek to eradicate Resistance sympathizers. I sense the hand of the Empire behind this cabal."},{"name":"XRHUNTIA","text":"Ah, but the assassins themselves favor magic, so they are unlikely to be native Garleans. The puppeteer could very well be a hired killer, or mayhap a recruit from a subjugated province... We shall learn the truth in due time. For now, however, we must take steps to keep you alive!"},{"name":"MERCHANT02578","text":"Lord Manderville is a member of the Syndicate, and the Gold Saucer is his domain. Striking at me here would be difficult to say the least. I do, however, have pressing business to attend to in Vesper Bay in the coming days."},{"name":"XRHUNTIA","text":"Vesper Bay, eh? Given its peculiar approach, I can think of a dozen places from which assassins could stage an ambush..."},{"name":"XRHUNTIA","text":"Might you entrust your safety to <span class=\"highlight\">Forename</span> and me? Together, we will prove more than a match for any ambushers, and it would also afford us greater insight into our foe."},{"name":"MERCHANT02578","text":"...You certainly appear capable. Aye, I will gladly accept your protection."},{"name":"XRHUNTIA","text":"Then it's settled! Let us travel ahead to Vesper Bay and scout out the area."},{"name":"ILIUD","text":"So it seems the father of the girls was the true target...<br>Master Wilkin is fortunate, then, to have not one but two red mages to guard him from harm."},{"name":"XRHUNTIA","text":"Good, you're here! Master Wilkin has begun his overland trek from Ul'dah."},{"name":"XRHUNTIA","text":"Before he left, I asked the good merchant to discuss his travel arrangements with less than his usual discretion. Assuming the assassins have eyes and ears on their target, we can assume they will have moved to occupy the most favorable ambush sites."},{"name":"XRHUNTIA","text":"Now, if I were intent on murdering a lone traveler, I would choose one of two options. The first being the alleys here in Vesper Bay, and the second being the long, dark tunnel leading into the town."},{"name":"XRHUNTIA","text":"I propose we split up and secure both areas. I will take the back streets, and you can have the old mining shaft. Sweep the tunnel clean of ambushers, then meet me back here when you are sure the route is safe!"},{"name":"XRHUNTIA","text":"I will root out any assassins lurking here in the alleyways. If you would scour the tunnel clear of ambushers, then Master Wilkin should arrive none the worse for wear!"},{"name":"XRHUNTIA","text":"Defeated their ambush, did you? Well done! ...As you can see, they had a second group waiting in the wings."},{"name":"XRHUNTIA","text":"Your opponents were the same mute attackers as before, yes? I pity these cursed pawns, but we cannot let mercy stay our hands─they are little different from the walking dead, and no art can restore them. I did, however, allow one to escape my blade."},{"name":"XRHUNTIA","text":"On purpose, of course! He seemed eager to disengage, and so I obliged. He limped off towards the coast, but with the wound I gave him he'll not have fled far."},{"name":"XRHUNTIA","text":"I will track this last assassin to his destination. Pray remain here and greet Master Wilkin. He should be arriving through your secured tunnel any moment now!"},{"name":"MERCHANT02578","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>! Here I am, and with nary a scratch upon my person. My deepest thanks."},{"name":"MERCHANT02578","text":"You have saved my family, and for that I can never truly repay you. But I must at least try. Pray share this gift with Master X'rhun."},{"name":"MERCHANT02578","text":"My supplier will be waiting, and so I must take my leave of you. May Nald enrich you and bless your endeavors!"},{"name":"XRHUNTIA","text":"We've had a stroke of luck! The man I followed leapt into the sea and was fished out by others in a rowboat. I last saw them making for a merchantman anchored out in the bay."},{"name":"XRHUNTIA","text":"Considering the absence of fear, I must assume the one who fled had been commanded to report the outcome of the ambush. If we can identify the ship, then we will be one step closer to unmasking this vile puppeteer. And then we can─ Hm? Another token from the esteemed Master Wilkin?"},{"name":"XRHUNTIA","text":"How kind that he seeks to reward us. Ah, and there is a note here as well addressed to us both. Ahem."},{"name":"MERCHANTSLETTER02578","text":"(-Wilkin's Note-)<span class=\"emphasis\">You have my eternal gratitude. Twice now has my life been saved by red mages. And twice by one in particular.</span>"},{"name":"MERCHANTSLETTER02578","text":"(-Wilkin's Note-)<span class=\"emphasis\">Mayhap you remember the day, twenty years ago, when the Crimson Duelists fought to save the life of a child. I remember you, Master X'rhun, for your scarlet garb was forever etched into my memory.</span>"},{"name":"XRHUNTIA","text":"'Tis a strange feeling to be recognized for a decades-old deed. Had he not known me, would he have been so ready to place his life in our hands, I wonder."},{"name":"XRHUNTIA","text":"Aside from a few wrinkles, I suppose I have changed little in my appearance. I was clothed thus when we worked to evacuate our fellow Ala Mhigans...even as the homeland we knew crumbled around us."},{"name":"XRHUNTIA","text":"But in the end, it is the lives that matter, not the place. Regardless of the circumstances, a red mage must strive to achieve the greatest good."},{"name":"XRHUNTIA","text":"So I have always believed. Our actions are our own reward, but a little acknowledgement does wonders to sustain one's faith, eh?"}],"reward":{"gil":1333,"xp":52800},"reqs":{"jobs":[{"lvl":52,"id":112}],"quests":[68113]},"next":[68115]},"partials":[{"type":"npc","id":"1021447","obj":{"i":1021447,"n":"X'rhun Tia","l":44,"q":2}},{"type":"npc","id":"1021457","obj":{"i":1021457,"n":"X'rhun Tia","l":42,"q":2}},{"type":"npc","id":"1006355","obj":{"i":1006355,"n":"Iliud","l":44,"q":9}},{"type":"npc","id":"1021439","obj":{"i":1021439,"n":"X'rhun Tia","l":44,"q":2}},{"type":"npc","id":"1021448","obj":{"i":1021448,"n":"X'rhun Tia","l":1484,"q":1}},{"type":"npc","id":"1021450","obj":{"i":1021450,"n":"Wilkin","l":1484,"q":1}},{"type":"npc","id":"1021451","obj":{"i":1021451,"n":"X'rhun Tia","l":42,"q":1}},{"type":"npc","id":"1021452","obj":{"i":1021452,"n":"X'rhun Tia","l":42,"q":1}},{"type":"npc","id":"1021453","obj":{"i":1021453,"n":"X'rhun Tia","l":42,"q":1}},{"type":"npc","id":"1021456","obj":{"i":1021456,"n":"Wilkin","l":42,"q":1}},{"type":"npc","id":"1021658","obj":{"i":1021658,"n":"X'rhun Tia","l":1484,"q":1}},{"type":"quest","id":"68113","obj":{"i":68113,"n":"The Crimson Duelist","g":161,"l":"Central Thanalan","s":501,"f":1}},{"type":"quest","id":"68115","obj":{"i":68115,"n":"Tracking the Cabal","g":161,"l":"Western Thanalan","s":540,"f":1}}]}