{"quest":{"name":"Child of Lilith","location":"Idyllshire","id":68122,"patch":4.0,"sort":680,"icon":100683,"unlocksFunction":1,"eventIcon":71341,"issuer":1021779,"target":1021795,"involved":[1021785,1021786,1021787,1021788,1021789,1021790,1021791,1021792,1021793,1021794,1023072],"genre":161,"journal":["X'rhun has a new development to share with you.","After hearing the tale of the heretic's memoirs, Arya has had a vivid dream about the long-dead murderer and the coffin-like prison within which Lilith was trapped. X'rhun decides that there is little to lose in confirming the details of Arya's vision, and suggests you accompany him to the Supreme Sacred Tribunal of Halonic Inquisitory Doctrine.","Although X'rhun struggles in his negotiations to access the Tribunal archives, your status as Ishgard's savior soon wins over the sour-faced official. With little else to do whilst your mentor helps scour the records, you agree to meet Arya at the Last Vigil.","As you and Arya are enjoying the view and discussing matters of existentialism, X'rhun arrives with the news that he has discovered the last known location of Lilith's prison─the description of which is eerily similar to the object in Arya's dream. Make your way into the Coerthas central highlands, and join your companions near the fiend-filled ravine of Witchdrop.","You join X'rhun and Arya at the top of Witchdrop, and behold the voidsent lurking below. Descend into the ravine, and begin searching for the Mhachi coffin which brought you here.","Your excavations in the snow uncover the object of your search, but a disembodied voice declares you unworthy to open the coffin. You suddenly come under attack, yet despite your victory the lid of the sinister box remains firmly closed. Return to X'rhun, and tell him of your discovery.","You convey your findings to your red mage colleagues, and Arya offers to try her hand at opening the coffin. Head back to the unearthed object and lend Arya your support.","Arya succeeds in opening the warded coffin, and from within emerges the sinuous form of the voidsent queen, Lilith. The undulating fiend claims to have schemed at Arya's conception for a thousand years, manipulating her blood-gifted ancestors into creating the perfect vessel for Lilith's earthly manifestation. Following this revelation, Lilith entrances her chosen host into approaching her, then both vanish without a trace. You are left to speak with a dumbfounded X'rhun.","Though visibly shaken by the voidsent's sudden departure, X'rhun nevertheless holds out hope for your abducted companion. Return to Ishgard and discuss what can be done to rescue the unfortunate Arya.","You arrive back in the Pillars, and X'rhun expresses his defiance in the face of voidsent-ordained destiny. Unwilling to abandon Arya to her fate, your mentor is determined to find her before Lilith can complete her ritual of possession. Focus your energies, and ensure you are prepared when the times comes to mount a rescue.<br><br>※The next red mage quest will be available from X'rhun Tia upon reaching level 70."],"objectives":["Speak with X'rhun Tia in Ishgard.","Speak with Arya.","Join X'rhun Tia near Witchdrop.","Dig in the snow.","Speak with X'rhun Tia.","Speak with Arya.","Speak with X'rhun Tia.","Speak with X'rhun Tia in Ishgard."],"dialogue":[{"name":"ARYA","text":"It's all been a bit overwhelming, but at least there's hope for a cure!"},{"name":"ARYA","text":"We just need to find Lilith's prison..."},{"name":"XRHUNTIA","text":"Ah, <span class=\"highlight\">Forename</span>. Your fellow student has had the most astonishing dream. Why don't you tell <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> about it, Arya?"},{"name":"ARYA","text":"It was so disturbingly vivid. I dreamed of the man who wrote the <span class=\"emphasis\">Nightkin</span>..."},{"name":"ARYA","text":"In a corner of the house in which he hid away from the world, he kept a coffin-like box. Black as night, it was, its sides marked with jagged lines of purple."},{"name":"ARYA","text":"As he watched over it, unblinking, an inquisitor broke through the door with a company of knights. Half the soldiers were ordered to haul the man away to the “Tribunal,” while the other half seized the coffin..."},{"name":"XRHUNTIA","text":"This “coffin” you describe is the very image of a Mhachi tool of containment. 'Tis as if you saw a vision of past events..."},{"name":"ARYA","text":"It was probably just a nightmare, brought on by the tales in those memoirs."},{"name":"XRHUNTIA","text":"Well, as things stand, your dream is the best lead the memoirs have given us. Let us pay a visit to the Tribunal in Ishgard─nothing ventured, nothing gained, I say!"},{"name":"ARYA","text":"Oh, you're here! X'rhun seems to be having trouble negotiating with the official..."},{"name":"INQUISITOR02586","text":"Ahem...<br>Are you an acquaintance of these outsiders?"},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>, thank the gods! This officious bureaucrat refuses to allow me access to their records. Mayhap he will listen to you."},{"name":"INQUISITOR02586","text":"<span class=\"highlight\">Forename</span>, did you say? What strange coincidence that you bear the same name as─ Ah! It <span class=\"emphasis\">is</span> you! In the flesh!"},{"name":"INQUISITOR02586","text":"My apologies for not recognizing you sooner! Whatever the hero of Ishgard requires, we shall not hesitate to provide. This was in regards to the heretic killer who left those awful memoirs, yes?"},{"name":"INQUISITOR02586","text":"Your request shall be given the highest priority. Pray understand, however, that records of objects seized in the previous century are not immediately at hand. It may take some time to scour the archives..."},{"name":"XRHUNTIA","text":"Just like that, eh? A moment ago, you were ready to cast me out into the snow!"},{"name":"XRHUNTIA","text":"Hmph. Mayhap you should take Arya on a tour of the city. I'll stay here with our new “friend” and help guide his search."},{"name":"ARYA","text":"I suppose we would just be in the way here. Could we go to the Last Vigil? I hear the view is spectacular..."},{"name":"XRHUNTIA","text":"I knew you were well known in Ishgard, but 'tis quite another thing to see such reverence firsthand!"},{"name":"INQUISITOR02586","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, you need not waste your valuable time lingering here. Your companion is providing me with all the details I require."},{"name":"ARYA","text":"This is amazing...<br>I was told you could look over the entire city from up here, and I couldn't wait to see it for myself!"},{"name":"Q1","text":"What will you say?"},{"name":"A2","text":"Fond of such sights, are you?"},{"name":"A2","text":"So you <span class=\"emphasis\">are</span> fond of high places, then?"},{"name":"ARYA","text":"If I wasn't before, then I've certainly become so. I want to burn this first sight of Ishgard into my mind─to fill the empty spaces in my memory with wonderful vistas..."},{"name":"ARYA","text":"If they come with a view such as this, I am! ...I would ask why you keep asking me that, but I'm afraid the answer would lead to even stranger questions."},{"name":"ARYA","text":"To be honest, though, I wanted to burn this first sight of Ishgard into my mind─to fill the empty spaces in my memory with wonderful vistas..."},{"name":"ARYA","text":"When you first rescued me, I knew not who I was or where I belonged. As I've said before, I scarcely felt that I existed."},{"name":"ARYA","text":"But the well of my memories is no longer empty. Though it has been but a small fraction of my life, my journey with you has shaped me into what I am now."},{"name":"ARYA","text":"So you can understand why I'm so eager to return to our training. Red magic has given me the power to fight against a fate that would have left me...hollow."},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>! Arya! We've learned the resting place of Lilith's prison!"},{"name":"XRHUNTIA","text":"As incredible as it may seem, the coffin from your dream matched the description of the heretic's box─purple lines and all. The inquisitors were apparently so unnerved by its fell energies that they cast the thing into a ravine."},{"name":"XRHUNTIA","text":"The place in question is known by the delightful name of “Witchdrop,” and is to be found in the Coerthas central highlands. Swarming with voidsent, or so I'm told. Shall we?"},{"name":"ARYA","text":"Do you...do you feel that? It's as if the whole ravine is pulsing with evil..."},{"name":"XRHUNTIA","text":"The chasm is crawling with fiends, just as described. Are they drawn by Lilith's dark essence, I wonder?"},{"name":"XRHUNTIA","text":"Let us descend to its depths and begin digging. Mayhap the very power which attracts the voidsent will help guide our efforts."},{"name":"XRHUNTIA","text":"Oh, you will be able to follow us down there, won't you, Arya? I seem to recall you had a crippling fear of ghosts and spirits."},{"name":"ARYA","text":"Wh-What? No, I'm fine. There are no skeletons or specters here, so I'll be fine. Perfectly fine."},{"name":"XRHUNTIA","text":"So “fine” you felt the need to tell me three times? Well, considering your current troubles with spellcasting, you'd best stay close in any case."},{"name":"XRHUNTIA","text":"There would not have been so much damnable snow a hundred years ago. Our search would have been far easier before the Calamity!"},{"name":"ARYA","text":"Hm? I told you, I'm fine. There are no ghosts here...that I can see. Perfectly, completely fine."},{"name":"SYSTEM","text":"You dig in the snow, but find nothing..."},{"name":"SYSTEM","text":"An ominous coffin lies buried beneath the snow!"},{"name":"LILITH","text":"(-???-)Only one bearing my blood-gift may break the seal. Slay this pretender!"},{"name":"ARYA","text":"...You found it already!? You must tell X'rhun!"},{"name":"XRHUNTIA","text":"Under a shallow mound of snow, you say!? Extraordinary!"},{"name":"XRHUNTIA","text":"“Only one bearing my blood-gift...” Could this mysterious voice belong to Lilith herself?"},{"name":"ARYA","text":"Let me try opening the coffin. If the voice is telling the truth, then I'm the only one who can."},{"name":"XRHUNTIA","text":"Very well. <span class=\"highlight\">Forename</span>, lead us to your dig site."},{"name":"XRHUNTIA","text":"Well, that's a demonic box if ever I saw one. I find myself understanding the decision to drop it into a ravine and never speak of it again."},{"name":"ARYA","text":"It looks just as it did in my dream...<br>I'm going to open the lid."},{"name":"XRHUNTIA","text":"I can feel the waves of malice even through the wards─this is no lowly imp. Proceed with caution, Arya."},{"name":"XRHUNTIA","text":"Lilith may be in a weakened state, but she is still a queen amongst her kind. Let us not be caught unprepared!"},{"name":"XRHUNTIA","text":"Gods above!"},{"name":"LILITH","text":"Hm hm hm. At last, I am free from that miserable prison!"},{"name":"LILITH","text":"A thousand years of scheming cometh to fruition. Yield unto me thy vessel, child. Thou shalt be host to mine immortal glory!"},{"name":"XRHUNTIA","text":"...Host? You seek to possess Arya's body!"},{"name":"LILITH","text":"&lt;hiss&gt; A masterpiece of centuries. For generations have I guided the dreams of my blood-gifted, bringing them together and strengthening their line..."},{"name":"LILITH","text":"When at last the chosen one was born, I sent another to secure my precious vessel. He commanded his own puppets, never knowing he was mine."},{"name":"XRHUNTIA","text":"...Lambard!"},{"name":"LILITH","text":"&lt;hiss&gt; Heed me, child... My darling creation... I am the reason for thine existence; for the entanglement of thy sires; for thy deliverance unto solitude."},{"name":"XRHUNTIA","text":"Do not listen, Arya! Her words are poison!"},{"name":"LILITH","text":"Come. Deny not thy destiny. Thy life was molded by my hand!"},{"name":"ARYA","text":"This was always meant to happen? My parents... My uncle... All of it?"},{"name":"LILITH","text":"Sweet child..."},{"name":"XRHUNTIA","text":"Arya, no!"},{"name":"XRHUNTIA","text":"Godsdammit! Arya moved as if entranced. Lilith must have some hold over those who bear her blood."},{"name":"XRHUNTIA","text":"It was Arya's dream that led us here. Into a trap. If we are to believe that hissing serpent, this meeting was a thousand years in the making..."},{"name":"XRHUNTIA","text":"But all is not lost! See how she did not immediately claim Arya's body for her own? From what I understand of such things, in order to possess a mortal host, Lilith must conduct a ritual of exacting preparations."},{"name":"XRHUNTIA","text":"There is time yet to deduce the location to which she fled. Let us return to the Pillars and consider the possibilities."},{"name":"XRHUNTIA","text":"Lilith's words yet echo in my ears... “Deny not thy destiny. Thy life was molded by my hand.”"},{"name":"XRHUNTIA","text":"Arya became a red mage to gain control over her fate, and I'll be damned if we abandon her to this one!"},{"name":"XRHUNTIA","text":"But first things first: we must expend every effort towards finding the place where the voidsent has taken our colleague. The ritual preparations will not take forever..."}],"reward":{"gil":1934,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":112}],"quests":[68121]},"next":[68123]},"partials":[{"type":"npc","id":"1021779","obj":{"i":1021779,"n":"X'rhun Tia","l":2082,"q":4}},{"type":"npc","id":"1021795","obj":{"i":1021795,"n":"X'rhun Tia","l":2301,"q":2}},{"type":"npc","id":"1021785","obj":{"i":1021785,"n":"X'rhun Tia","l":2301,"q":1}},{"type":"npc","id":"1021786","obj":{"i":1021786,"n":"Arya","l":2301,"q":1}},{"type":"npc","id":"1021787","obj":{"i":1021787,"n":"Sour-faced Priest","l":2301,"q":1}},{"type":"npc","id":"1021788","obj":{"i":1021788,"n":"Arya","l":2301,"q":1}},{"type":"npc","id":"1021789","obj":{"i":1021789,"n":"X'rhun Tia","l":63,"q":1}},{"type":"npc","id":"1021790","obj":{"i":1021790,"n":"Arya","l":63,"q":1}},{"type":"npc","id":"1021791","obj":{"i":1021791,"n":"X'rhun Tia","l":63,"q":1}},{"type":"npc","id":"1021792","obj":{"i":1021792,"n":"Arya","l":63,"q":1}},{"type":"npc","id":"1021793","obj":{"i":1021793,"n":"X'rhun Tia","l":63,"q":1}},{"type":"npc","id":"1021794","obj":{"i":1021794,"n":"Arya","l":63,"q":1}},{"type":"npc","id":"1023072","obj":{"i":1023072,"n":"Arya","l":2082,"q":2}},{"type":"quest","id":"68121","obj":{"i":68121,"n":"Nightkin","g":161,"l":"Idyllshire","s":650,"f":1}},{"type":"quest","id":"68123","obj":{"i":68123,"n":"With Heart and Steel","g":161,"l":"Ishgard","s":700,"f":1}}]}