{"quest":{"name":"Traced in Blood","location":"Idyllshire","id":68120,"patch":4.0,"sort":630,"icon":100683,"unlocksFunction":1,"eventIcon":71341,"issuer":1021779,"target":1021778,"involved":[1021780,1021781,1021782],"genre":161,"journal":["X'rhun proposes a journey to the cradle of red magery.","X'rhun proposes a journey to the mountains of Gyr Abania, where you will visit the Ziggurat built by the red mages of eld. Within that ancient edifice, your mentor hopes to uncover clues to treating Arya's condition─just as he once unearthed the secrets of red magic alongside Lambard long ago. Travel to the region of Gyr Abania, and join X'rhun near the centuries-old monument.","You meet X'rhun near the Ziggurat, and after a brief history lesson he sets you to work searching for records of Lambard's transformation ritual. Head into the ruins, and seek out any remaining stone tablets.","You have obtained three stone tablets in varying degrees of degradation. Deliver them to X'rhun Tia.","X'rhun glances over the tablets you have brought, and finds one that details a rite by which a mage would ingest the blood of a voidsent in exchange for supernatural power. The description of the hunger which befell such mages is uncannily similar to Arya's condition. Believing that the tonic explained on the same tablet should be effective in relieving your companion's suffering, X'rhun bids you procure the concoction's main ingredient: a massive urolith's core. Make your way to the Sleeping Stones, and engage the largest specimen you can find.","You have defeated an unbreakable urolith, and liberated its pulsating core. Seek out X'rhun Tia in the Gyr Abanian hamlet of Ala Gannha, and hand over the ingredient.","With the materials for the tonic in hand, X'rhun appears eager to call upon the expertise of the alchemists of Ul'dah. Whilst your mentor is busy having the concoction prepared, return to Idyllshire and apprise Arya of your progress.","Upon imbibing the alchemical mixture, Arya seems to recover almost immediately from her weakened state. X'rhun is quick to remind her, however, that any arcane exertion could soon send her back into a state of mindless hunger. Continue to hone your own skills that you might better aid Arya in returning to her beloved journey along the path of the red mage.<br><br>※The next red mage quest will be available from X'rhun upon reaching level 65."],"objectives":["Speak with X'rhun Tia near the Ziggurat.","Obtain stone tablets.","Hand the stone tablets to X'rhun Tia.","Survey the area, and defeat an unbreakable urolith for its core.","Deliver the massive urolith core to X'rhun Tia.","Speak with Arya in Idyllshire."],"dialogue":[{"name":"ARYA","text":"I've decided to not let this upset me. As X'rhun says, I'm still in control of who I am."},{"name":"XRHUNTIA","text":"Are you ready to depart? The journey I have in mind will take us into the mountains of Gyr Abania, where we will visit the Ziggurat built by the red mages of eld."},{"name":"XRHUNTIA","text":"Lambard and I once explored those ancient ruins, searching for knowledge of the first incarnation of red magic. That was long ago, before we met Curtis and joined the revolution..."},{"name":"XRHUNTIA","text":"Lambard and I once explored those ancient ruins, searching for knowledge of the first incarnation of red magic. That was long ago, before we formed the Crimson Duelists and joined the revolution..."},{"name":"XRHUNTIA","text":"...Before I realized the manner of hidden wisdom for which Lambard had been truly seeking."},{"name":"XRHUNTIA","text":"The edifice itself has now been overrun by Qiqirn, but a thorough expedition could still unearth something of value─mayhap even the secrets behind Lambard's occult transformation."},{"name":"XRHUNTIA","text":"Arya, my friend, I must ask that you remain here and continue your convalescence. And no spellcasting!"},{"name":"XRHUNTIA","text":"Not even a lick of flame to light a candle. In your weakened state, we know not how suddenly the hunger might return."},{"name":"ARYA","text":"Yes, of course. Just the thought of what might happen is enough to make me feel ill..."},{"name":"ARYA","text":"I'll be fine in my sickbed, but what of you two? Are you really going to travel all the way to Gyr Abania just for me?"},{"name":"XRHUNTIA","text":"What would you do if the positions were reversed? If <span class=\"highlight\">Forename</span> were afflicted by a condition and you knew a cure might be found beyond the mountains? What then?"},{"name":"ARYA","text":"Why, I would be out the door in a moment!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Thank you, Arya."},{"name":"A1","text":"You would...?"},{"name":"XRHUNTIA","text":"Ahahaha! That you would respond so emphatically is the reason we have no qualms about doing the same for you!"},{"name":"XRHUNTIA","text":"Ahahaha! Not the slightest hesitation! You've even flustered <span class=\"highlight\">Forename</span> here."},{"name":"XRHUNTIA","text":"That you would respond so emphatically is the reason we have no qualms about doing the same for you!"},{"name":"XRHUNTIA","text":"Arya's worked so hard to master her skills, and I imagine it will be hard to refrain from training for a while. But she must recover from her exhaustion first, before aught else."},{"name":"XRHUNTIA","text":"Come, <span class=\"highlight\">Forename</span>─the Ziggurat awaits. Rest well, Arya. We shall return as swiftly as we are able."},{"name":"ARYA","text":"I hate to be the cause of so much trouble...<br>And I hate that I still feel so weak. I promise to stay in bed like a good girl until I'm fully recovered."},{"name":"XRHUNTIA","text":"Let's begin our expedition, shall we? Be on the lookout for stone tablets bearing the histories of the red."},{"name":"XRHUNTIA","text":"Did I mention that it was our forebears in the art who constructed the Ziggurat? It was built to suppress the unstable weather that was whipped up in the wake of that era's Calamity─a sort of dampening weight that slowed the land's raging currents of aether to a trickle."},{"name":"XRHUNTIA","text":"In time, however, the Ziggurat also became a library, where successive generations of red mages enshrined their stories and their secrets. 'Tis a shame that so many of these precious slates have since been lost to plunderers, or simply worn down by the ravages of time..."},{"name":"XRHUNTIA","text":"As such, I do not expect to find a fully intact record of Lambard's ghastly rite, but at the very least we should discover hints of what the transformation ritual entails. You take one way, and I'll take another, and we'll both take care not to fall prey to Qiqirn bandits!"},{"name":"XRHUNTIA","text":"How did you fare? I discovered a number of tablets myself which, while positively fascinating, offered little on the subject of occult rituals..."},{"name":"XRHUNTIA","text":"Oho! If I'm reading this one correctly, you may have found exactly what we were looking for."},{"name":"XRHUNTIA","text":"It appears to be a record from a time before red magic was unified as a distinct discipline. The passage describes a rite by which one can make a pact with a voidsent, and ingest its blood in exchange for supernatural power!"},{"name":"XRHUNTIA","text":"Even amongst their kin, certain creatures of the void harbor a voracious appetite for living aether. Lambard must have acquired the ability to siphon his victims' life force from one such fiend..."},{"name":"XRHUNTIA","text":"The practice in question is said to have started with a family of Mhachi sorcerers, who lived in the era preceding the Sixth Umbral Calamity. For red mages, whose arts draw so heavily upon their own aether, there is an obvious─if distasteful─advantage to stealing a foe's life energies."},{"name":"XRHUNTIA","text":"And if one can employ such energies to fortify and sustain one's own form, as Lambard did, then one can even wield magicks beyond the limitations of ordinary mortals."},{"name":"XRHUNTIA","text":"Not surprisingly, however, its tendency to result in aether-starved madmen led to the rite being declared a forbidden art."},{"name":"XRHUNTIA","text":"Hmmm. There's more... Some mention of an alchemical concoction that would serve to sate the hunger for aether when living prey was unavailable. And the helpful scribe has even included a method for its preparation!"},{"name":"XRHUNTIA","text":"Arya's transformation was strikingly similar to Lambard's. Surely this concoction would prove effective at curbing her condition as well!"},{"name":"XRHUNTIA","text":"Let's see here. It seems the main ingredient is a chunk of semi-crystallized aether. Such a substance could be drawn from the core of an urolith─and I'm thinking the bigger the better."},{"name":"XRHUNTIA","text":"If I recall correctly, there are uroliths to be found to the east, in the vicinity of the Sleeping Stones. Pray find yourself one of the larger specimens and procure an aetherial core."},{"name":"XRHUNTIA","text":"Once you have what we need, we can rendezvous in the hamlet of Ala Gannha. I shall busy myself collecting the other ingredients."},{"name":"ARYA","text":"Oh, you found something that might explain my condition!? That's wonderful, thank you! I hope we can reverse...whatever this is."},{"name":"XRHUNTIA","text":"Were you able to procure a suitable core?"},{"name":"XRHUNTIA","text":"Ah, yes, this will do nicely! Enough to create a decent-sized dose, at any rate."},{"name":"XRHUNTIA","text":"I've gathered together the other ingredients, so all that's left to do is deliver them into the hands of an experienced alchemist."},{"name":"XRHUNTIA","text":"Ah, but Arya must be wondering where we are. Why don't you go on ahead to Idyllshire and avail her of our progress. I'll meet you there as soon as I'm finished haggling with the potion mixers in Ul'dah!"},{"name":"ARYA","text":"A kind of potion? And it's supposed to help with the hunger? That will be one less worry, then..."},{"name":"ARYA","text":"Do you think X'rhun will be back soon...?"},{"name":"XRHUNTIA","text":"I am returned!"},{"name":"XRHUNTIA","text":"Arya, pray drink this concoction, and I shall tell you of our discoveries in Gyr Abania."},{"name":"ARYA","text":"I... By the gods!"},{"name":"ARYA","text":"The taste was not exactly pleasant, but I already feel much recovered! It's as if a cool stream of water was poured on the fire in my chest... I don't know how to thank you!"},{"name":"XRHUNTIA","text":"Your smile is the finest reward we could ask for. But I ask that you do not become complacent─that tonic is merely meant to help replenish your depleted aether. It will do naught to undo the underlying affliction."},{"name":"ARYA","text":"I understand. If I exhaust my mana again, I'll be back where I was: a savage controlled by hunger. Which means I should still give up on training for now..."},{"name":"XRHUNTIA","text":"...For now."},{"name":"ARYA","text":"So, you think Lambard infused me with voidsent blood while I was held captive?"},{"name":"XRHUNTIA","text":"According to what I found in the Yellowjackets' incident records, the span of time that elapsed between your kidnapping and subsequent rescue was not terribly long."},{"name":"XRHUNTIA","text":"And for much of your ordeal you were shut inside a box. It seems unlikely that there was sufficient opportunity to perform a highly complicated and dangerous ritual. No, we must look elsewhere for the truth behind your condition."},{"name":"ARYA","text":"You must let me help you!"},{"name":"ARYA","text":"If it allows me to begin practicing magic again even one day earlier... It is torture watching the moments pass─wasting time I could be using to catch up to you."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You'll get there!"},{"name":"A2","text":"You'll never catch me!"},{"name":"ARYA","text":"I'll certainly try! Though I'm not sure what help I'll be..."},{"name":"XRHUNTIA","text":"Hah! No mercy from you, eh, <span class=\"highlight\">Forename</span>? But if you halted your progress for Arya, then she'd have naught to aim for, would she!?"},{"name":"XRHUNTIA","text":"I think we'll have our suffering friend delve into the scrolls for us. The Sharlayans have left behind a veritable mountain of lore through which we can dig for answers."},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>, I shall leave you to your training. After all, you must give Arya an ever-growing peak to look up to!"}],"reward":{"gil":2903,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":112}],"quests":[68119]},"next":[68121]},"partials":[{"type":"npc","id":"1021779","obj":{"i":1021779,"n":"X'rhun Tia","l":2082,"q":4}},{"type":"npc","id":"1021778","obj":{"i":1021778,"n":"Arya","l":2082,"q":2}},{"type":"npc","id":"1021780","obj":{"i":1021780,"n":"X'rhun Tia","l":2407,"q":1}},{"type":"npc","id":"1021781","obj":{"i":1021781,"n":"X'rhun Tia","l":2407,"q":1}},{"type":"npc","id":"1021782","obj":{"i":1021782,"n":"X'rhun Tia","l":2407,"q":1}},{"type":"quest","id":"68119","obj":{"i":68119,"n":"The Color of Her Hair","g":161,"l":"Mor Dhona","s":601,"f":1}},{"type":"quest","id":"68121","obj":{"i":68121,"n":"Nightkin","g":161,"l":"Idyllshire","s":650,"f":1}}]}