{"quest":{"name":"Original Blanstyr","location":"Limsa Lominsa","id":68130,"patch":4.0,"sort":601,"icon":100687,"unlocksFunction":1,"eventIcon":71341,"issuer":1001000,"target":1001000,"involved":[1001001],"genre":138,"journal":["H'naanza needs you to speak with Blanstyr.","H'naanza greets you warmly, but seems concerned by an unexpected announcement from Blanstyr. The forgemaster would have you speak with the veteran craftsman, and discern the reason behind his sudden decision to quit the Armorers' Guild.","You approach Blanstyr, and he shares with you an epiphany he had upon beholding a helm of unique design. Wishing to infuse his own work with a greater degree of “character,” it would appear Blanstyr has his mind set on studying at the feet of Far Eastern masters. Return to H'naanza, and report what you have learned.","As you explain Blanstyr's reasoning to the forgemaster, the artisan himself makes an appearance. He attempts to berate H'naanza for prying into his business, but she brushes aside his complaints, explaining that he is welcome to take a leave of absence for the sake of self-improvement. Satisfied that his position at the forge will be waiting for him upon his return, a placated Blanstyr soon departs for his pilgrimage to the Far East. H'naanza promises to inform you should she hear word from the impulsive artisan...<br><br>※The next armorer quest will be available from H'naanza upon reaching level 63."],"objectives":["Speak with Blanstyr.","Report to H'naanza."],"dialogue":[{"name":"HNAANZA","text":"Greetings, <span class=\"highlight\">Forename</span>. I hope you've been well since that last incident with Blanstyr."},{"name":"HNAANZA","text":"Speaking of which, our resident veteran of the forge has built quite the reputation for himself. Our patrons are well pleased with the custom-made quality of his armors."},{"name":"HNAANZA","text":"Thus did it come as quite a surprise when he announced his intention to leave the guild..."},{"name":"HNAANZA","text":"I questioned him on this sudden change of heart, but the stubborn aurochs refused to divulge his reasons. Despite all that has happened, I suppose he must be uncomfortable confiding aught in me."},{"name":"HNAANZA","text":"Mayhap you would have better luck?"},{"name":"HNAANZA","text":"I am his superior, but he respects and admires you as a colleague. I need you to get to the bottom of this, <span class=\"highlight\">Forename</span>─losing an experienced armorer without so much as an explanation is unacceptable."},{"name":"HNAANZA","text":"Talk to Blanstyr. Mayhap if I know his reasons, I can talk him out of this fool decision."},{"name":"BLANSTYR","text":"Well, well, if it ain't me old forgemate, <span class=\"highlight\">Forename</span>. What's with the grim face?"},{"name":"BLANSTYR","text":"...Aye, ye've the right of it. I mean to put the guild behind me."},{"name":"BLANSTYR","text":"Now, I've confidence in me skills, an' I reckon that lately I've been forgin' some o' the best pieces o' me career."},{"name":"BLANSTYR","text":"But I couldn't figure out for the life o' me why I didn't feel meself the equal of you or the forgemaster..."},{"name":"BLANSTYR","text":"After a good bit o' thinkin', though, I came to the realization that me work lacks <span class=\"emphasis\">character</span>."},{"name":"BLANSTYR","text":"I was just arrivin' at that conclusion, you see, when I saw an adventurer by the Aftcastle wearin' a helm o' the oddest design. I had to stop her an' ask where she got it from."},{"name":"BLANSTYR","text":"Ye know what she says? Some envoy from the Far East <span class=\"emphasis\">gave</span> it to her for services rendered durin' Heavensturn, or some such."},{"name":"BLANSTYR","text":"An' that's when I had me an epiphany: I needed to learn how to infuse me work with as much character as radiated from that odd-lookin' helmet. I needed to study with the folk what make 'em."},{"name":"BLANSTYR","text":"But if I'm to bugger off on a pilgrimage of enlightenment to the Far East, I can't bloody well keep takin' on commissions now, can I? That's why I gave me notice to H'naanza."},{"name":"BLANSTYR","text":"Ye can try to talk me out of it till yer blue in the face, but me mind's made up!"},{"name":"BLANSTYR","text":"Save yer breath, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! I'm for the Far East!"},{"name":"HNAANZA","text":"Well? What did the old aldgoat have to say for himself?"},{"name":"HNAANZA","text":"...I see. I certainly appreciate you clearing up that mystery, but why does he─?"},{"name":"BLANSTYR","text":"Stickin' yer beak into me business again, H'naanza? I should've bloody known you put <span class=\"highlight\">Forename</span> up to it."},{"name":"HNAANZA","text":"If you'd simply explained the why of it in the first place, I wouldn't have needed to stoop to such measures."},{"name":"HNAANZA","text":"And I also could've told you at the outset that you needn't cut all ties with the guild. 'Tis perfectly acceptable for an artisan to take an occasional leave of absence for the purpose of self-improvement."},{"name":"BLANSTYR","text":"A “leave of absence,” ye call it? Aye, well I s'pose that works, too. I'm serious about trainin' new skills, but I'd be glad to keep me position at yer forge if ye'd still have me."},{"name":"BLANSTYR","text":"Right. I'll take me leave, then, Forgemaster. An' if it ain't too much trouble, I'd appreciate it if ye could see to me clients' needs while I'm gone."},{"name":"HNAANZA","text":"Aye, we'll take care of any requests for repairs or adjustments. You just stay focused. I don't want to see you back here until you're satisfied that you've grown as a craftsman."},{"name":"BLANSTYR","text":"Understood.<br>Well, I'm off to seek a ship to the Far East. Keep them fires hot, eh?"},{"name":"HNAANZA","text":"The great bloody buffoon. Byregot knows how he'll fare over there, but then again, mayhap he'll return a changed man. Fare you well, <span class=\"highlight\">Forename</span>─I'll let you know should I hear from Blanstyr."},{"name":"HNAANZA","text":"The next armorer quest will be available from H'naanza upon reaching level 63."},{"name":"HNAANZA","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":583,"items":[{"num":250,"id":9},{"num":3,"id":12667}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":11}],"questsType":"all","quests":[67578,67895]},"next":[68131]},"partials":[{"type":"npc","id":"1001000","obj":{"i":1001000,"n":"H'naanza","l":28,"q":28,"t":"Guildmaster"}},{"type":"npc","id":"1001001","obj":{"i":1001001,"n":"Blanstyr","l":28,"q":13}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"67578","obj":{"i":67578,"n":"The Pride of Vymelli","g":138,"l":"Limsa Lominsa","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68131","obj":{"i":68131,"n":"Eastern Apprentice","g":138,"l":"Limsa Lominsa","s":630,"f":1}}]}