{"quest":{"name":"Forging with Scales","location":"Kugane","id":68132,"patch":4.0,"sort":650,"icon":100687,"unlocksFunction":1,"eventIcon":71341,"issuer":1021369,"target":1021369,"involved":[1019052,1019053,1021371,1021373],"genre":138,"usedItems":[17895,17896],"journal":["Blanstyr is eager to begin his first lesson.","Blanstyr tells you of his observations on Far Eastern armorsmithing techniques, and mentions that Master Fugetsu should soon be ready to instruct you both in your first lesson. Quiet your mind for the task ahead, and speak with Kokajiya's head armorer.","After describing the prominence of the scale in Hingan plate armors, Master Fugetsu tasks you with forging a pair of kote. Before you begin, however, Blanstyr wishes to interrogate a warrior on the qualities one looks for in protective gauntlets. Make your way to the barracks in Kugane, and speak with a Sekiseigumi blade.","Though initially wary of your presence, the Sekiseigumi warrior is only too happy to share with you his opinion on the ideal pair of kote. With the objectives of durability and freedom of movement in mind, you decide on titanium as your metal of choice. Return to Kokajiya, and trouble Unryu for the materials you will require.","Unryu hands over the supplies you need. Deliver your finished work to Blanstyr when the kote are complete.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Unryu.","Blanstyr takes your titanium kote and adds the finishing touches. You present your work to Master Fugetsu, who proceeds to praise both the kote's exceptional sturdiness and the precision of its joinings. Despite this glowing assessment, however, Blanstyr seems dissatisfied with the lack of progress towards his goal of developing an original style. Master Fugetsu counsels patience, and promises that his next lesson will build upon the grumbling veteran's solid foundation.<br><br>※The next armorer quest will be available from Fugetsu upon reaching level 68."],"objectives":["Speak with Fugetsu.","Speak with a Sekiseigumi blade.","Speak with Unryu.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a pair of titanium kote <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the pair of titanium kote <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Blanstyr</span></span>."],"dialogue":[{"name":"BLANSTYR","text":"Well, if it ain't me fellow apprentice. Been keepin' busy? Meself, I've been watchin' over Master Fugetsu's shoulder as he works, an' learnin' a few scraps of Far Eastern armorcraftin'."},{"name":"BLANSTYR","text":"The whole way they approach the craft is different─from the materials they choose, to the process o' puttin' the pieces together."},{"name":"BLANSTYR","text":"An' now that Master Fugetsu is finishin' up that commission work, he'll be free to instruct us in his methods firsthand."},{"name":"BLANSTYR","text":"I'll finally be takin' me first step towards me goal! Byregot's beard, me bloody hands are tremblin' at the thought of it."},{"name":"BLANSTYR","text":"Right, let's go an' learn our first lesson, eh?"},{"name":"BLANSTYR","text":"I reckon Master Fugetsu is ready for us now!"},{"name":"FUGETSU","text":"You have been most patient, my apprentices, but you need wait no longer. Our commission is safely filled, and I can now devote my full attention to instructing you in our traditional methods."},{"name":"FUGETSU","text":"Let us begin by examining the differences between Eorzean and Hingan plate armors─the most obvious being that, while your suits are crafted from large, carefully shaped sheets, ours are made up of many overlapping scales."},{"name":"FUGETSU","text":"The scales themselves are often made from hardened leather, but for your lesson I think I shall have you forge them from metal. This will allow you to craft a durable yet flexible piece of armor."},{"name":"FUGETSU","text":"In this land we are especially conscious of protecting against arrows, and this emphasis has led to the design of long, hanging sleeves and the like. I imagine the appearance is quite unusual for those unaccustomed to the style."},{"name":"FUGETSU","text":"But be that as it may, these scales form the foundation of the Hingan art of armorcrafting. As an introduction to this basic technique, I have decided to have you craft a pair of armored gloves─otherwise known as “kote.”"},{"name":"FUGETSU","text":"Speak with Unryu, and as before, he will provide you with all the materials you require."},{"name":"BLANSTYR","text":"These “koh-teh” of yers... Do the folk what wear 'em ask for aught in particular? I want to make certain I focus on the right bits."},{"name":"FUGETSU","text":"Ah, then mayhap you might wish to speak with a warrior directly. I am sure one of the Blades at the Sekiseigumi Barracks would be sufficiently intrigued by your query to offer an answer."},{"name":"BLANSTYR","text":"The barracks, eh? Right, I'll go an' have a bit of a chat, then get straight to work."},{"name":"FUGETSU","text":"I am eager to see how you incorporate the results of your investigation."},{"name":"FUGETSU","text":"If you wish to question a warrior on the subject of kote, then the Sekiseigumi Barracks should be your next destination."},{"name":"BLANSTYR","text":"I reckon this must be the barracks. Now, who to ask...? Bah, this bloke here'll do."},{"name":"SAMURAIBUGYO02596","text":"Yes? Who are you, and what business have you with the Sekiseigumi?"},{"name":"BLANSTYR","text":"We're Eorzeans, apprenticed to Master Fugetsu."},{"name":"BLANSTYR","text":"We've been tasked with forgin' some kote, an' I thought I'd ask a proper warrior about the kind o' gloves he prefers to wear."},{"name":"SAMURAIBUGYO02596","text":"Ah, a worthy subject of discourse! While protection for the hands is paramount, I would say that the finest kote must also afford a full range of motion for wielding a blade."},{"name":"SAMURAIBUGYO02596","text":"One cannot hope to exploit an enemy's fleeting misstep if one's hands are bound as if by blocks of lead."},{"name":"BLANSTYR","text":"A full range o' motion, eh? That's the sort o' thing I wanted to hear. Thank ye, sir!"},{"name":"BLANSTYR","text":"From the sounds of it, we'll be needin' a metal what's both light and durable if we're to achieve the right amount o' flexibility and protection."},{"name":"BLANSTYR","text":"Let's get ye workin' on some base titanium gloves. I'll craft the other bits an' pieces, an' then we can put the lot together for our presentation."},{"name":"SAMURAIBUGYO02596","text":"Yes, flexibility is key. What good are sturdy gloves if one's katana cannot leap and bite like a striking serpent?"},{"name":"BLANSTYR","text":"How are them kote comin' along? Ye got the materials from Unryu, didn't ye?"},{"name":"FUGETSU","text":"It would seem your investigation bore fruit. I await the results of your toil with great interest."},{"name":"UNRYU","text":"You seek to forge a pair of titanium kote, yes? Blanstyr explained your task to me, and I have prepared everything you need."},{"name":"UNRYU","text":"As ever, should you require aught more, do not hesitate to ask."},{"name":"UNRYU","text":"You should have everything you require to make the titanium kote. Should you need more, I will delve into our stores."},{"name":"UNRYU","text":"Ah, your kote are finished? They look sturdy indeed! Have you showed them to Blanstyr yet?"},{"name":"BLANSTYR","text":"Are ye done with them kote, then?"},{"name":"BLANSTYR","text":"Very nice, <span class=\"highlight\">Forename</span>─just the sort o' quality I'd expect from ye. I'll attach all the other bits we need, then we can show our work to Master Fugetsu."},{"name":"FUGETSU","text":"Let me see what you have forged, then..."},{"name":"FUGETSU","text":"Yes, not only are the scales of exceptional strength and quality, the precision of the joinings is beautiful to behold. I can find no criticism worthy of mention."},{"name":"FUGETSU","text":"Too heavy and rigid, and kote will be as manacles. You show a fine understanding of the importance of freedom of movement on the battlefield."},{"name":"BLANSTYR","text":"Aye, we simply forged 'em like that warrior bloke suggested. For veterans like me an' <span class=\"highlight\">Forename</span>, it weren't exactly much of a challenge."},{"name":"BLANSTYR","text":"I'm startin' to wonder if this is really the right path to unlockin' me own brand of originality."},{"name":"BLANSTYR","text":"I want to learn how to make summat like them Heavensturn helms─summat distinct an' with character."},{"name":"BLANSTYR","text":"Not to be rude, but I didn't come here to hammer out dull bloody pieces like this..."},{"name":"FUGETSU","text":"I understand your urgency, but the individuality you seek cannot be developed in a day. That you have learned to craft to your client's needs is a fine start, and we will build upon that foundation."},{"name":"FUGETSU","text":"Today's lesson is over. I shall next instruct you in more practical concerns─so be sure you have a firm grasp on the art of crafting scales."},{"name":"SYSTEM","text":"In furthering your knowledge of Far Eastern techniques, you have learned “Manipulation”!"}],"reward":{"gil":821,"action":4576,"items":[{"num":250,"id":9},{"id":19529},{"id":19633,"one":1},{"id":19634,"one":1},{"id":19635,"one":1},{"id":19636,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":11}],"quests":[68131]},"next":[68133]},"partials":[{"type":"npc","id":"1021369","obj":{"i":1021369,"n":"Blanstyr","l":2404,"q":4}},{"type":"npc","id":"1019052","obj":{"i":1019052,"n":"Fugetsu","l":2404,"q":4}},{"type":"npc","id":"1019053","obj":{"i":1019053,"n":"Unryu","l":2404,"q":4}},{"type":"npc","id":"1021371","obj":{"i":1021371,"n":"Sekiseigumi Blade","l":2404,"q":2}},{"type":"npc","id":"1021373","obj":{"i":1021373,"n":"Blanstyr","l":2404,"q":1}},{"type":"action","id":"4576","obj":{"i":4576,"n":"Manipulation","c":1985,"j":10,"t":7,"l":65}},{"type":"item","id":"19529","obj":{"i":19529,"n":"Doman Iron Raising Hammer","l":220,"c":35222,"t":16,"p":31363}},{"type":"item","id":"19633","obj":{"i":19633,"n":"Kudzu Robe of Crafting","l":220,"c":43812,"t":35,"p":28749}},{"type":"item","id":"19634","obj":{"i":19634,"n":"Durium Chaplets","l":220,"c":48275,"t":37,"p":17249}},{"type":"item","id":"19635","obj":{"i":19635,"n":"Kudzu Culottes of Crafting","l":220,"c":45973,"t":36,"p":28749}},{"type":"item","id":"19636","obj":{"i":19636,"n":"Tigerskin Boots of Crafting","l":220,"c":46760,"t":38,"p":17249}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17895","obj":{"i":17895,"n":"Kote Materials","l":276,"c":20830,"t":63}},{"type":"item","id":"17896","obj":{"i":17896,"n":"Titanium Kote","l":276,"c":48505,"t":63}},{"type":"quest","id":"68131","obj":{"i":68131,"n":"Eastern Apprentice","g":138,"l":"Limsa Lominsa","s":630,"f":1}},{"type":"quest","id":"68133","obj":{"i":68133,"n":"Head-to-head Contest","g":138,"l":"Kugane","s":680,"f":1}}]}