{"quest":{"name":"A Royal Request","location":"Ul'dah","id":68135,"patch":4.0,"sort":601,"icon":100688,"unlocksFunction":1,"eventIcon":71341,"issuer":1004093,"target":1002280,"involved":[1003995,1012528,1021137,1021138,1021139,1021140,1021141],"genre":139,"journal":["Serendipity is a picture of panic.","On a sudden visit to the Goldsmiths' Guild, Her Royal Majesty Nanamo Ul Namo informs you of her initiative to breathe new life into Ala Mhigo's war-stalled economy. The plan involves establishing an artisans' school training goldsmiths, and the sultana would have you be its schoolmaster. Betokening her hopes for the school, she donates a priceless heirloom for use in your work─her lady mother's jewel-studded crown─and you cannot help but oblige her request. Your apprentices-to-be have already gathered at Spineless Basin in central Thanalan, and Marcel bids you join him there for a meet and greet.","You arrive at Spineless Basin to find three goldsmith hopefuls. In your capacity as schoolmaster, Marcel suggests that you say a word to each of them.","You have acquainted yourself with your new students and learned of their varied backgrounds. Make your way back to the Goldsmiths' Guild, where Jemime awaits you with word of new developments.","You are introduced to your deputy, the cultivated Emeloth, who will be stationed at the school when it opens in Rhalgr's Reach. Until such time as the lessons begin, continue honing your craft that you might be better prepared for the challenges of training a new generation of goldsmiths─and ultimately contribute to Ala Mhigo's economic revival.<br><br>※The next goldsmith quest will be available from Jemime upon reaching level 63."],"objectives":["Speak with Marcel at Spineless Basin.","Speak with J'khebica.","Speak with Wido.","Speak with Hal.","Speak with Jemime at the Goldsmiths' Guild."],"dialogue":[{"name":"SERENDIPITY","text":"Oh, <span class=\"highlight\">Forename</span>! It's a catastrophe! Her Grace the sultana─she's suddenly decided to visit the guild!"},{"name":"SERENDIPITY","text":"I-I can't imagine what I might've done to incur her wrath... But wait, if I <span class=\"emphasis\">did</span> incur her wrath, I'd be the one summoned before her. That's the way it works, right? Oh, tell me I'm right!"},{"name":"SERENDIPITY","text":"Um, yes, miss? As much as I'd like to assist you, a rather important guest is due to arrive any moment now..."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Should you be referring to the sultana, then I am she. Pray forgive me my appearance, but as my visit is private in nature, I wished to avoid the public eye."},{"name":"SERENDIPITY","text":"Y-Your Grace!? You're here already!? N-No, wait! I-I mean...you honor us with your presence!"},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Pray be at ease, guildmaster. And may I say the surprise is mutual, for is this not my dear <span class=\"highlight\">Forename</span> who stands before me!"},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)I came with the intent of having Mistress Serendipity relay a request to you, but full glad am I that I may make said request personally."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)You see, it is my desire to help ordinary Ala Mhigans rebuild their lives. To this end, I intend to establish a school for artisans."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Such a school requires a capable <span class=\"alternative-container\"><span class=\"alternative\">mistress</span><span class=\"alternative\">master</span></span>, and to this vital role I would appoint none other but you, <span class=\"highlight\">Forename</span>."},{"name":"PAPASHAN","text":"Some days ago, Her Grace made a visit to the city's refugee quarters. There she bore witness to the full extent of their daily struggles, and the sight filled her with sorrow."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)More so than sorrow, it filled me with shame─the shame that such despair should exist under my rule. It served as a stern rebuke of my failings as a leader and a reminder that mine inaction may beget great suffering. As it did when I allowed Teledji Adeledji to run rampant, thus subjecting you and yours to unimaginable pain."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)As I have long believed, by helping the refugees, so too do we help Ul'dah. When Ala Mhigo's liberation becomes reality, and full sure am I that it will, her citizens will desire to return home."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)As I have long believed, by helping the refugees, so too do we help Ul'dah. With Ala Mhigo's liberation now reality, her citizens will desire to return home."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Alas, the years have left her industry barren, and there are precious few opportunities for repatriated citizens to make a living. If the nation is to survive and eventually thrive, we must needs till the soil of her economy."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)In pondering this endeavor, I sought the counsel of wise individuals from far and wide. It was their prevailing recommendation that the seeds of trade be sown through the training of craftsmen─craftsmen who would go on to create a product that would be synonymous with Ala Mhigo. In this way did we arrive at the idea of an artisans' school."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Rhalgr's Reach, home to the Ala Mhigan Resistance, was nominated as the location. This left the question of who to send as schoolmaster. In searching for the answer, I turned to Master Marcel for his opinion on an exceptional goldsmith fit to represent Ul'dah..."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)And of all the names he could speak, he speaks the very same that I had in mind: yours, my dear <span class=\"highlight\">Forename</span>!"},{"name":"MARCEL","text":"Apologies for the suddenness of the request, my friend. I had been privy to the initiative for some time, but it was to be kept in the strictest confidence."},{"name":"MARCEL","text":"Lest you doubt the plan's feasibility, rest assured it has met with even the Syndicate's approval. For Ala Mhigo is rich not only in the smithing tradition, but in mineral deposits besides─a favorable environment for our goal of economic revival."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)I am providing such funds as I may to the initiative, yet an investment of coin alone feels somehow impersonal. To that end, I would make a further contribution to the future of the Ala Mhigan people."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)My mother's crown, which she wore when she was wed. The jewels shall be of use in your work. The kindly soul that she was, my mother will be glad that it might serve a noble cause."},{"name":"SERENDIPITY","text":"Such a sacrifice bespeaks the strength of Her Grace's commitment! Oh, <span class=\"highlight\">Forename</span>, you'll do it, won't you? For the people of Ala Mhigo? And Her Grace? And for me as well, for good measure?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can count on me."},{"name":"A1","text":"..."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)I had every faith that you would accept, but I am no less grateful for it."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Well do I understand that I ask much of you. After all, we seek to make up for no less than a twenty-year void─a seemingly impossible task."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)But this is precisely why I turn to you, my friend─you, who have the habit of making the impossible possible. I beseech you: pray lend us your aid."},{"name":"NANAMOULNAMO","text":"(-Nanamo Ul Namo-)Thank you, <span class=\"highlight\">Forename</span>. I shall not soon forget this favor. Now then, I have entrusted the general arrangements for the school to Master Marcel. Pray have the particulars from him and Mistress Serendipity."},{"name":"MARCEL","text":"Ah, beg your pardons.<br>...Yes, this is he. What? So soon? Well, there certainly is no time like the present..."},{"name":"MARCEL","text":"At Her Grace's behest, I had put out word among Ala Mhigan refugees that we are recruiting apprentices. The effect was immediate, and a number of promising young candidates have answered the call."},{"name":"MARCEL","text":"As a matter of fact, they are already gathered outside the city walls, near Spineless Basin. If you would care to accompany me, <span class=\"highlight\">Surname</span>, this is a chance to meet your students-to-be."},{"name":"SERENDIPITY","text":"Ohhh, my heart skipped a beat! To think that the sultana gets around in disguise!"},{"name":"SERENDIPITY","text":"Have you gone and met your new students yet? They're supposed to be gathering over by Spineless Basin in central Thanalan. That's outside the city walls. Near the Steps of Nald."},{"name":"JKHEBICA","text":"Ooh, you must be our schoolmaster! This is going to be <span class=\"emphasis\">great</span>!"},{"name":"WIDO","text":"The name's Wido. Nice to meet you, Chief."},{"name":"HAL","text":"Uh, can I help you? Probably not, but eh..."},{"name":"PAPASHAN","text":"Seldom have I seen Her Grace so invested in something such as this artisans' school, and with your cooperation, she has the highest hopes. Suffice it to say I shall be praying for your success."},{"name":"MARCEL","text":"If you would meet your students-to-be, <span class=\"highlight\">Surname</span>, they are presently gathered outside the city walls, near Spineless Basin."},{"name":"MARCEL","text":"My thanks for coming, <span class=\"highlight\">Surname</span>. Now then, these are the three individuals who answered our call for apprentices."},{"name":"MARCEL","text":"Though they are virgins to goldsmithing, they come to us with experience in other fields. In your capacity as schoolmaster, may I suggest you say a word to each of them?"},{"name":"MARCEL","text":"Once you are done here, pray return to the guild. There have been developments in the school's establishment, and Jemime will furnish you with the details."},{"name":"MARCEL","text":"Though these three are virgins to goldsmithing, they come to us with experience in other fields. In your capacity as schoolmaster, may I suggest you say a word to each of them?"},{"name":"MARCEL","text":"Once you are done here, pray return to the guild. There have been developments in the school's establishment, and Jemime will furnish you with the details."},{"name":"JKHEBICA","text":"It's a pleasure to meet you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! I'm J'khebica, and I've loved trinkets and accessories since I was little, and so I started working at a small jewelry shop."},{"name":"JKHEBICA","text":"At first I was just the shopkeep, but simply selling stuff got boring fast, so I nagged our artisans to teach me a thing or two, and I learned enough to help out with repairs. But then I decided I wanted to become an artisan myself, and here I am."},{"name":"JKHEBICA","text":"But enough about me and more about you! I heard that you're the one who crafted the music boxes that together played an original arrangement of a famous tune by none other than the Songstress of Ul'dah?"},{"name":"JKHEBICA","text":"Hah, I knew it! You've been the talk of the shop, and everyone there's going to be so jealous when they hear I'll be learning from you, but most importantly I've always admired your work and it's an absolute honor for me and I promise to do my best!"},{"name":"WIDO","text":"Hello, Chief. Wido's the name, an' I'm here with my brother, Hal. I used to smith for the Resistance, fixin' weapons an' such."},{"name":"WIDO","text":"In our country, there's always been some fightin' goin' on somewhere, an' I grew up thinkin' a craftsman works only on tools o' war."},{"name":"WIDO","text":"But afore she died, Ma would always tell us the fightin' would end one day. An' when that day comes, Ala Mhigo's gonna need craftsmen what'll bring her coin an' make her prosper."},{"name":"WIDO","text":"Recently, I started givin' more thought to Ma's words, asked myself how I might help my country get back on its feet. An' then this opportunity came along to learn goldsmithin', an' I took it as a sign an' took it up."},{"name":"HAL","text":"W-Wait, <span class=\"emphasis\">you're</span> the teacher? But...Wido said it was gonna be <span class=\"alternative-container\"><span class=\"alternative\">a handsome Elezen</span><span class=\"alternative\">an exotic Au Ra</span><span class=\"alternative\">a full-figured Roegadyn</span><span class=\"alternative\">a gorgeous Hyur</span><span class=\"alternative\">a petite Lalafell</span><span class=\"alternative\">a ravishin' Miqo'te</span><span class=\"alternative\">a voluptuous Viera</span><span class=\"alternative\">a burly Hrothgar</span></span>..."},{"name":"HAL","text":"Gah, fooled again, dammit! He always does it to me...an' I keep fallin' for it..."},{"name":"HAL","text":"&lt;sigh&gt; I s'pose I ought to introduce myself. I'm Hal, an' I'm a miner. <span class=\"emphasis\">Was</span> at any rate, till my bastard of a brother duped me into becomin' a goldsmith."},{"name":"HAL","text":"Well, that ain't exactly true, 'cause I've always been interested in the craft. You name a rock or ore, I've dug it up, an' it's downright fascinatin' learnin' how it all gets used."},{"name":"MARCEL","text":"A colorful crew, are they not? Now then, if you are done here, pray return to the guild. Jemime awaits you with further information."},{"name":"SERENDIPITY","text":"Ah, you're back! Good, good. There's someone I'd like you to meet. Let Jemime know when it's convenient, and we'll make the introductions."},{"name":"EMELOTH","text":"Well met. I am Emeloth, and you are the famous <span class=\"highlight\">Forename Surname</span>, I presume?"},{"name":"JKHEBICA","text":"I've always admired your work and it's an absolute honor for me and I promise to do my best!"},{"name":"WIDO","text":"Lookin' forward to workin' with you, Chief!"},{"name":"HAL","text":"Sorry 'bout the weird things I said earlier. My brother thinks he's bein' funny..."},{"name":"JEMIME","text":"I've been waiting for you, <span class=\"highlight\">Forename</span>. As you will have heard from Master Marcel, there have been developments in regards to the artisans' school."},{"name":"JEMIME","text":"Guildmaster Serendipity has selected the goldsmith who will serve as your deputy. May I introduce Miss Emeloth."},{"name":"EMELOTH","text":"At your service. Though we meet for the first time, your many accomplishments are well known to me."},{"name":"EMELOTH","text":"It will be an honor and a pleasure both to assist you in instilling the fundamentals of goldsmithing into our budding young apprentices."},{"name":"JEMIME","text":"When the school is finally opened in Rhalgr's Reach, Miss Emeloth will be the resident instructor, overseeing the students' everyday learning."},{"name":"EMELOTH","text":"The chance to work with an acclaimed goldsmith such as you seldom visits, and so when the offer came, I fairly jumped at it. I shall endeavor to be a worthy deputy to you."},{"name":"JEMIME","text":"Now then, it will be a little while until the classes begin, so feel free to go about your business for now. Rest assured I shall be in touch when the time comes."},{"name":"SYSTEM","text":"The next goldsmith quest will be available from Jemime upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1000,"items":[{"num":250,"id":10},{"num":3,"id":12667}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":12}],"questsType":"all","quests":[67610,67895]},"next":[68136]},"partials":[{"type":"npc","id":"1004093","obj":{"i":1004093,"n":"Serendipity","l":41,"q":29,"t":"Guildmaster"}},{"type":"npc","id":"1002280","obj":{"i":1002280,"n":"Jemime","l":41,"q":7,"t":"Guild Receptionist"}},{"type":"npc","id":"1003995","obj":{"i":1003995,"n":"Papashan","l":43,"q":9}},{"type":"npc","id":"1012528","obj":{"i":1012528,"n":"Marcel","l":41,"q":9}},{"type":"npc","id":"1021137","obj":{"i":1021137,"n":"Marcel","l":43,"q":1}},{"type":"npc","id":"1021138","obj":{"i":1021138,"n":"J'khebica","l":43,"q":1}},{"type":"npc","id":"1021139","obj":{"i":1021139,"n":"Wido","l":43,"q":1}},{"type":"npc","id":"1021140","obj":{"i":1021140,"n":"Hal","l":43,"q":1}},{"type":"npc","id":"1021141","obj":{"i":1021141,"n":"Emeloth","l":41,"q":1}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"67610","obj":{"i":67610,"n":"Two Hearts Beat as One","g":139,"l":"Ul'dah","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68136","obj":{"i":68136,"n":"Gemworks in Progress","g":139,"l":"Ul'dah","s":630,"f":1}}]}