{"quest":{"name":"Blindsided","location":"Rhalgr's Reach","id":68137,"patch":4.0,"sort":650,"icon":100688,"unlocksFunction":1,"eventIcon":71341,"issuer":1021131,"target":1021131,"involved":[1021132,1021133,1021134,1021135,1021148,1021149,1021150],"genre":139,"usedItems":[17903,17904],"journal":["Emeloth has a new worry to replace the old.","Not long after you address the issue of the two brothers' shortcomings, a new problem arises with J'khebica. In spite of her many promising qualities, it turns out she is remarkably clumsy, suffering repeated mishaps while applying the finishing touches. Unable to discern the cause, Emeloth bids you look in on the struggling apprentice. Speak with J'khebica and her fellows to see what you might be able to glean.","You learn from J'khebica that her struggles are relatively new. Meanwhile, the two brothers offer further insights, namely that she cannot reliably distinguish between the two of them, and that she invariably furrows her brows prior to failing. Take these revelations back to Emeloth for her consideration.","Listening in on your report, Kanchana posits that J'khebica's problem may lie with her vision, and Emeloth decides to check her eyesight to ascertain the possibility. Go and summon J'khebica for the test and put the mystery to rest.","It quickly becomes apparent that J'khebica's eyesight has deteriorated beyond what her current spectacles are able to correct. Kanchana suggests that you make her a new pair, which would double as the sample for the next task Emeloth has in mind for the apprentices. Synthesize a pair of spectacles for J'khebica, and present the finished product to your deputy for inspection.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Kanchana.","The new spectacles do the trick, and J'khebica is fairly enraptured to have her vision back. Wido observes that, even in her semiblind state, J'khebica was still the better goldsmith, and he and Hal are spurred to greater effort. In this way, all three apprentices resume their training with the fire of their enthusiasm further stoked. Let their zeal inspire you as you continue striving for new heights in your craft.<br><br>※The next goldsmith quest will be available from Emeloth upon reaching level 68."],"objectives":["Speak with J'khebica.","Speak with Wido.","Speak with Hal.","Speak with Emeloth.","Speak with J'khebica.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a pair of precision spectacles <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Show the pair of precision spectacles <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Emeloth</span></span>."],"dialogue":[{"name":"EMELOTH","text":"Thanks to your inspired idea and extraordinary craftsmanship, we have addressed the issue of the two brothers' shortcomings, and may carry on their education. "},{"name":"EMELOTH","text":"Alas, another issue has arisen, this time with J'khebica. She possesses determination, artistic sense, and above all a love for jewelry. I was quite certain she would succeed as a goldsmith."},{"name":"EMELOTH","text":"But she is, for want of a better word, clumsy. Remarkably so. She falters at the most vital steps when applying the finishing touches, and ends up having to start from scratch. This has happened so many times now, she has become quite depressed."},{"name":"EMELOTH","text":"Considering how reliable she is at molding, I cannot understand why she would struggle in this way. Could it be she puts too much pressure on herself, and it robs her of a steady touch?"},{"name":"EMELOTH","text":"Whatever the cause might be, perhaps you will be able to discern it where I could not. Might I trouble you to look in on J'khebica, Schoolmaster? And the other two as well while you are at it. You are like to find them at the Sutler's Tent."},{"name":"EMELOTH","text":"Might I trouble you to look in on the apprentices, Schoolmaster? You are like to find them at the Sutler's Tent."},{"name":"KANCHANA","text":"Of late, J'khebica's shrill cry piercesss the air with clockwork regularity. Such a ssslump she must be sssuffering."},{"name":"JKHEBICA","text":"S-Schoolmaster, I'm at my wit's end! I keep on botching the finishing touches and it's just so frustrating and I don't know what to do anymore!"},{"name":"JKHEBICA","text":"I was never clumsy like this in the past and though people say I talk in streams of thought I never rush my work, but for some reason my hands and fingers don't move as I will them."},{"name":"JKHEBICA","text":"I can't for the life of me work out what's wrong and it's driving me mad and I'm just about ready to give up!"},{"name":"WIDO","text":"Thanks again for the other day, Chief. We've got our heads down an' together, tryin' to put out a ring what won't shame you."},{"name":"WIDO","text":"...Eh? Have I noticed anythin' about J'khebica's work? Well, she's a sight better than me, an' that's takin' all her bunglin' into account. More's the pity 'cause she seems to know exactly what she wants to do."},{"name":"WIDO","text":"I ain't no expert─not yet anyway─but might be she could stand to slow it down some? I mean, outside o' work, she always gets me an' Hal mixed up. I won't deny the resemblance, but I'm clearly the better lookin' one."},{"name":"HAL","text":"M-Me? I've been watchin' Miss Emeloth, tryin' to imitate her movements. She's real graceful with her hands, y'know? Next time, maybe you could let us watch you, too?"},{"name":"HAL","text":"...J'khebica? Aye, she's been havin' a lot o' mishaps o' late, an' it's gotten her down."},{"name":"HAL","text":"Funny thing is you <span class=\"emphasis\">know</span> when somethin's about to go wrong. She furrows her brows, lookin' real focused, like, then lets out a growl. An' the next moment, all her hard work's undone."},{"name":"JKHEBICA","text":"I think I've got the chisel perfectly lined up but then I swing the hammer and it's way off the mark... &lt;sigh&gt; Maybe I'm just not cut out to be a goldsmith..."},{"name":"WIDO","text":"Me an' Hal, we wear different clothes, but even so J'khebica can't tell who's who half the time. At these odds, she might as well be guessin' blindfolded."},{"name":"HAL","text":"Right! I'm gonna learn as much as I can from you while you're here!"},{"name":"KANCHANA","text":"Everyone worries so for J'khebica. She is blessed to have sssuch caring friends."},{"name":"EMELOTH","text":"Were you able to learn aught of J'khebica's situation?"},{"name":"EMELOTH","text":"She furrows her eyebrows before an instance of bungling, you say? And struggles to tell the two brothers apart besides..."},{"name":"KANCHANA","text":"It seemsss to me the problem liesss with her eyesss."},{"name":"EMELOTH","text":"I was aware of her poor eyesight, but I assumed that her spectacles corrected it..."},{"name":"EMELOTH","text":"Hm, well, J'khebica is right there, so let us test her vision and ascertain the possibility. Schoolmaster, may I trouble you to summon her while Kanchana and I set things up?"},{"name":"EMELOTH","text":"Let us test J'khebica's vision and see whether that is indeed the cause of her grief. Schoolmaster, may I trouble you to summon her while Kanchana and I set things up?"},{"name":"WIDO","text":"Her spectacles might be the problem, you say? Well, that'd explain why she can't tell who's the better lookin' o' me an' Hal."},{"name":"HAL","text":"Er, what's goin' on? Is J'khebica alright?"},{"name":"KANCHANA","text":"In all likelihood, J'khebica's vision has sssince deteriorated and her spectaclesss no longer serve her needsss."},{"name":"JKHEBICA","text":"You wish to test my vision, Schoolmaster <span class=\"highlight\">Surname</span>? B-But of course!"},{"name":"JKHEBICA","text":"So, I just stand here and should I take off my spectacles?"},{"name":"KANCHANA","text":"Nay, young goldsmith, pray leave them on."},{"name":"KANCHANA","text":"Let us begin, then. Whose hand is raisssed? Miss Emeloth'sss...or mine?"},{"name":"JKHEBICA","text":"Oh, that's easy. Yours, Kanchana!"},{"name":"EMELOTH","text":"...It honestly appears that way to you? By the gods, girl, what world have you been living in? How have you not already strolled off a cliff?"},{"name":"KANCHANA","text":"We have our anssswer. Her spectaclesss have outlived their usefulness."},{"name":"KANCHANA","text":"Mayhap her ssschoolmaster would be so kind as to make her a new pair?"},{"name":"EMELOTH","text":"Hm, it just so happens I had spectacles in mind for the next task. From the curves of the lenses to the joints of the frame, these items demand a high degree of precision, and are thus ideal for cultivating attention to detail."},{"name":"EMELOTH","text":"The spectacles you craft for J'khebica would also serve admirably as a sample for our apprentices. And for their added benefit, may I suggest that you make a demonstration of it?"},{"name":"JKHEBICA","text":"So, the schoolmaster will make me a new pair of spectacles and it'll be our reference for the next task?"},{"name":"EMELOTH","text":"Whenever you are ready, <span class=\"highlight\">Forename</span>. As before, if you are short of materials, Kanchana will furnish you with whatever you require."},{"name":"JKHEBICA","text":"Oh, to think that spectacles crafted by a renowned goldsmith such as you will soon grace my face and restore my vision! The excitement is almost too much to bear!"},{"name":"WIDO","text":"You're gonna make J'khebica a new pair of specs? Heh, didn't see that comin'!"},{"name":"HAL","text":"This time you're gonna do the craftin' in front of us, right? Right!?"},{"name":"KANCHANA","text":"If you need more materialsss for the spectaclesss, I have them here."},{"name":"KANCHANA","text":"Ah, so J'khebica's spectaclesss are ready? Go on and let Emeloth know."},{"name":"EMELOTH","text":"How are the spectacles coming along?"},{"name":"JKHEBICA","text":"Oh, praise be, I can see again! All the beauty of nature in its fullest brilliance extending as high as the heavens and as far as the horizon!"},{"name":"JKHEBICA","text":"My world is so wide now I feel as though anything and everything is possible! Thank you, Schoolmaster, thank you from the bottom of my heart!"},{"name":"EMELOTH","text":"To look at your glee, it's a wonder you didn't realize the fault lay in your spectacles. At any rate, you may again work with confidence."},{"name":"WIDO","text":"She could hardly see worth a damn, but she could still do a sight better than us. We're gonna have to lift our game somethin' fierce. You hear me, Hal?"},{"name":"HAL","text":"Loud an' clear, Wido. Loud an' clear."},{"name":"JKHEBICA","text":"These are the finest spectacles a girl could hope to own and I don't know how close we can get to such quality, but we're going to give it our all!"},{"name":"EMELOTH","text":"Prior to this, J'khebica showed a glimpse of promise, but with her new spectacles I believe she is set to give us a veritable eyeful. Seeing this has served to stoke the fires within Wido and Hal, and we may expect much and more from them also."},{"name":"KANCHANA","text":"They may be worksss in progress, but quickly are they taking shape. Ere long they will become goldsmiths in their own right."},{"name":"EMELOTH","text":"From our perspective they still have far to go, but they now have it in them to craft wares fit to grace shop displays."},{"name":"EMELOTH","text":"In anticipation of this, I've been consulting Master Marcel on finding purveyors willing to stock their handiwork."},{"name":"EMELOTH","text":"Ours is an unknown name for now, but the day will come when people the realm over gather in droves seeking Crown Gemworks articles. It is to see such a day arrive that we labor."},{"name":"KANCHANA","text":"...It occursss to me that if the spectaclesss are to serve as reference, would J'khebica not need to remove them? How would she carry out the work in that cassse?"},{"name":"EMELOTH","text":"Oh. Right you are."},{"name":"EMELOTH","text":"Sh-Shall we say that this is part of the challenge? It would afford us a little more time to prepare for the next task..."},{"name":"SYSTEM","text":"In polishing your skills as a goldsmith, you have learned “Manipulation”!"}],"reward":{"gil":855,"action":4577,"items":[{"num":250,"id":10},{"id":19530},{"id":19633,"one":1},{"id":19634,"one":1},{"id":19635,"one":1},{"id":19636,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":12}],"quests":[68136]},"next":[68138]},"partials":[{"type":"npc","id":"1021131","obj":{"i":1021131,"n":"Emeloth","l":2403,"q":4}},{"type":"npc","id":"1021132","obj":{"i":1021132,"n":"J'khebica","l":2403,"q":2}},{"type":"npc","id":"1021133","obj":{"i":1021133,"n":"Wido","l":2403,"q":4}},{"type":"npc","id":"1021134","obj":{"i":1021134,"n":"Hal","l":2403,"q":4}},{"type":"npc","id":"1021135","obj":{"i":1021135,"n":"Kanchana","l":2403,"q":4}},{"type":"npc","id":"1021148","obj":{"i":1021148,"n":"J'khebica","l":2403,"q":1}},{"type":"npc","id":"1021149","obj":{"i":1021149,"n":"Wido","l":2403,"q":1}},{"type":"npc","id":"1021150","obj":{"i":1021150,"n":"Hal","l":2403,"q":1}},{"type":"action","id":"4577","obj":{"i":4577,"n":"Manipulation","c":1985,"j":11,"t":7,"l":65}},{"type":"item","id":"19530","obj":{"i":19530,"n":"Durium Texture Hammer","l":220,"c":35322,"t":18,"p":31363}},{"type":"item","id":"19633","obj":{"i":19633,"n":"Kudzu Robe of Crafting","l":220,"c":43812,"t":35,"p":28749}},{"type":"item","id":"19634","obj":{"i":19634,"n":"Durium Chaplets","l":220,"c":48275,"t":37,"p":17249}},{"type":"item","id":"19635","obj":{"i":19635,"n":"Kudzu Culottes of Crafting","l":220,"c":45973,"t":36,"p":28749}},{"type":"item","id":"19636","obj":{"i":19636,"n":"Tigerskin Boots of Crafting","l":220,"c":46760,"t":38,"p":17249}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17903","obj":{"i":17903,"n":"Eyewear Materials","l":276,"c":20810,"t":63}},{"type":"item","id":"17904","obj":{"i":17904,"n":"Precision Spectacles","l":276,"c":40953,"t":63}},{"type":"quest","id":"68136","obj":{"i":68136,"n":"Gemworks in Progress","g":139,"l":"Ul'dah","s":630,"f":1}},{"type":"quest","id":"68138","obj":{"i":68138,"n":"The Perfect Tribute","g":139,"l":"Rhalgr's Reach","s":680,"f":1}}]}