{"quest":{"name":"Gemworks in Progress","location":"Ul'dah","id":68136,"patch":4.0,"sort":630,"icon":100688,"unlocksFunction":1,"eventIcon":71341,"issuer":1002280,"target":1021131,"involved":[1021132,1021133,1021134,1021135,1021142,1021143,1021144,1021145,1021146,1021147],"genre":139,"usedItems":[17901,17902],"journal":["Jemime has glad tidings to share with you.","Jemime gleefully informs you that all has been made ready for the artisans' school at Rhalgr's Reach. Strike out for the Resistance outpost at your earliest convenience, and make a quick stop at Spineless Basin in central Thanalan, where Emeloth awaits.","According to Emeloth, your three apprentices were surprised and grateful to learn that the school is being wholly funded by the sultana. With Her Grace's gift crown in her care, your deputy begins the journey to Rhalgr's Reach. Make your own way there and join everyone at the aetheryte plaza.","At Rhalgr's Reach, you are introduced to an Ananta named Kanchana, your liaison in the Resistance. Having shown you to the space set aside for your use, Kanchana brings up the subject of the school's generic name. A discussion ensues, and with your blessing, the group decides to rename the school the Crown Gemworks to honor the sultana. Emeloth declares the school in operation, and suggests that you begin by speaking with your students in order to build rapport and learn about them.","You have spoken with all your apprentices. Share your impressions with Emeloth.","Emeloth agrees with your assessment that the two brothers, Wido and Hal, pose the greater challenge due to their unbalanced skill sets. Rather than addressing their weaknesses, however, you decide to instead cultivate their strengths by way of a joint project between the three apprentices. To serve as a reference, Emeloth proposes that you craft a silver ring adorned with a lapis lazuli taken from the crown.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Kanchana.","Your ring strikes awe into Emeloth, who goes so far as to describe it as the embodiment of perfection. And by beholding it, your apprentices are awakened to the true heights of their chosen craft. As they apply themselves to their training, continue honing your own skills, that you might remain a shining example to your students.<br><br>※The next goldsmith quest will be available from Emeloth upon reaching level 65."],"objectives":["Speak with Emeloth at Spineless Basin.","Join Emeloth at Rhalgr's Reach.","Speak with J'khebica.","Speak with Wido.","Speak with Hal.","Speak with Emeloth.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a sample silver ring <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Show the sample silver ring <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Emeloth</span></span>."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Divide and Conquer.”"},{"name":"JEMIME","text":"Glad tidings, <span class=\"highlight\">Forename</span>! The Ala Mhigan Resistance has sent word that all is in readiness at Rhalgr's Reach for the artisans' school!"},{"name":"JEMIME","text":"The time is come for you and Miss Emeloth to strike out for Gyr Abania, there to cultivate a new generation of goldsmiths. Though I am not directly involved, the mere thought of the venture sets my heart aflutter!"},{"name":"JEMIME","text":"Now then, your deputy awaits you at Spineless Basin, where I believe you first met your students. Pray see to your preparations and join her there at your earliest convenience."},{"name":"JEMIME","text":"Miss Emeloth awaits you at Spineless Basin, where you first met your students. Pray see to your preparations and join her there at your earliest convenience."},{"name":"EMELOTH","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"highlight\">Forename</span>. You just missed our apprentices─they struck out for Rhalgr's Reach but moments ago."},{"name":"EMELOTH","text":"A shame you couldn't see their stunned faces when I told them that the school was established under the patronage of the sultana herself. Nay, they had no idea who their benefactor is."},{"name":"EMELOTH","text":"Doubtless they assumed the coin was publicly sourced, but the seventh hell would freeze over before Ul'dah becomes so charitable. The truth is, Her Grace is personally bearing all expenses."},{"name":"EMELOTH","text":"However, she desires no credit for it, and wishes instead to keep the initiative quiet. And so, when the call went out for apprentices, nary a mention was made of her involvement. I can only imagine how the three will react when they learn that Her Grace's contribution includes her lady mother's crown."},{"name":"EMELOTH","text":"Speaking of the crown, I have it in my safekeeping. Let us see it safely to Rhalgr's Reach, where our eager apprentices await. Shall we then?"},{"name":"JKHEBICA","text":"Hehe, I've been looking forward to this moment and finally it's here and our training can begin!"},{"name":"WIDO","text":"We lived here awhile, me an' Hal, so this is a homecomin' o' sorts for us."},{"name":"HAL","text":"I'm gonna make it as a goldsmith. It's the only way I can repay the sultana."},{"name":"KANCHANA","text":"Ssso, you are to be the ssschoolmaster. Mmm, yesss, you do look the part."},{"name":"EMELOTH","text":"There you are, <span class=\"highlight\">Forename</span>. Upon arriving, I was surprised to learn that yours is already an established name in these parts. It makes it all that more compelling that Her Grace would name you for the role."},{"name":"EMELOTH","text":"But without further ado, may I introduce you to Kanchana, our liaison with the Resistance."},{"name":"KANCHANA","text":"Greetingsss and welcome to Rhalgr'sss Reach. We Ananta love accessoriesss─love to make and to wear them. The goldsssmithing of your kind is most intriguing, and I look forward to obssserving your techniquesss."},{"name":"KANCHANA","text":"But tell me, this crown you have brought... Sssuch a precious thing, yet you mean to take it apart for its stonesss?"},{"name":"JKHEBICA","text":"Y-Yeah, it belonged to the sultana's mother and is worth a fortune, and to be honest the idea of working on it frightens me..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let us strive to be worthy of it."},{"name":"A1","text":"The idea frightens me as well."},{"name":"EMELOTH","text":"The crown is the symbol of the sultana's faith in us. As the schoolmaster says, we must strive to be worthy of that faith."},{"name":"EMELOTH","text":"That even the schoolmaster should feel daunted bespeaks the weight of the sultana's hopes for the initiative."},{"name":"EMELOTH","text":"It is a tradition among nobles to bequeath gemstones unto those nearest and dearest to them. And to Her Grace, the people of Eorzea are as her children."},{"name":"EMELOTH","text":"So let us receive the stones with thanks and ensure that they serve a good cause─that which will lead to a better future for Ala Mhigans, as is Her Grace's will."},{"name":"KANCHANA","text":"Ssso that is the way of it. Very well, I shall show you to the ssspace we've set aside for use by the artisans' school. But I must asssk, is that to be your actual name? It strikes me as sssomewhat...generic."},{"name":"WIDO","text":"Hard to argue with that. If we're gonna be sellin' our wares eventually, I reckon we need a catchier name to slap on 'em."},{"name":"HAL","text":"Right, somethin' less a school an' more a workshop, like...the Crown Gemworks. Y'know, in honor o' the sultana?"},{"name":"EMELOTH","text":"I believe this is a fine idea, and that is a fine name. What say you, Schoolmaster?"},{"name":"EMELOTH","text":"It's official, then. From this moment forth, the Crown Gemworks is in operation. Kanchana, pray lead the way."},{"name":"EMELOTH","text":"Schoolmaster, to begin with, may I suggest you have a word with each of the apprentices? It would serve to build rapport, and you would stand to learn about them."},{"name":"EMELOTH","text":"The apprentices will doubtless appreciate your personal attention. At your leisure, Schoolmaster."},{"name":"KANCHANA","text":"This is the ssspace set aside for you and yoursss. It used to be a ssstorage facility, so it isn't much to look at, but it ought to serve your needsss."},{"name":"JKHEBICA","text":"Schoolmaster, so it's true what Miss Emeloth says and you know all our warriors here and fought with them besides? Wow, to think that your skilled hands can create magnificent works of art as well as wreak bloody havoc, you are a truly versatile schoolmaster and I'm honored to be your pupil!"},{"name":"JKHEBICA","text":"But most of all, I'm honored I am that Her Grace would entrust us with her crown but a little nervous as well because I can be clumsy sometimes, and I'll have to take extra care that my hands don't slip!"},{"name":"WIDO","text":"Hello there, Chief. Just workin' on the basics at the moment. Havin' been a smithy, the metal side o' things comes pretty natural to me, but cuttin' an' polishin' stones? Well, that's a whole new world."},{"name":"WIDO","text":"I can't for the life o' me tell what's good an' what's bad. Haven't seen enough finished products, I s'pose..."},{"name":"HAL","text":"M-Me? I never done no craftin' afore, an' it's all I can do to remember the basics. Ah, but Miss Emeloth says I've got a sense for workin' stone."},{"name":"HAL","text":"That's my minin' experience talkin', I reckon. A glance an' I can tell a stone's character, its hardness an' all that."},{"name":"HAL","text":"Can't say the same when it comes to metal, though. I've dug up ore, to be sure, but the stuff what comes to us ain't ore no more. A stone don't change like that."},{"name":"JKHEBICA","text":"I'm honored that Her Grace would entrust us with her crown but a little nervous as well because I can be clumsy sometimes, and I'll have to take extra care that my hands don't slip!"},{"name":"WIDO","text":"Just workin' on the basics at the moment. Havin' been a smithy, the metal side o' things comes pretty natural to me, but cuttin' an' polishin' stones? Well, that's a whole new world."},{"name":"HAL","text":"Miss Emeloth says I've got a sense for workin' stone. That's my minin' experience talkin', I reckon."},{"name":"KANCHANA","text":"Much of the talk here pertainsss to war, and death, and misery. This corner alone is a refuge from such depressing subject mattersss."},{"name":"EMELOTH","text":"You've spoken with our apprentices? How do they fare?"},{"name":"EMELOTH","text":"...I see. Mine own impressions are much the same as yours. J'khebica shows promise. Her time at a jewelry shop has instilled her with artistic sense, and she has zeal in abundance."},{"name":"EMELOTH","text":"The challenge will be the two brothers. Wido works metal like a veteran, but stone like a layman. Hal, meanwhile, is the opposite─brilliant with stone, but lackluster with metal."},{"name":"EMELOTH","text":"A goldsmith proficient in only one area is no goldsmith at all, and I've a mind to have them overcome their weaknesses ere I let them move on to the next step. But what say you, Schoolmaster?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Let's cultivate their strengths first."},{"name":"A2","text":"Let's task them with a finished product."},{"name":"EMELOTH","text":"Oh? Before addressing weaknesses, you would first cultivate strengths? Hm, mayhap there is wisdom in this. At this early stage, a focus on shortcomings is liable to undermine motivation."},{"name":"EMELOTH","text":"Oh? You would have them try their hand at crafting a finished product? Hm, perhaps there is wisdom in this. When working on a part, it is important to know how it fits into the whole."},{"name":"EMELOTH","text":"With this in mind, I have a proposal: we prepare a sample product, which our apprentices will work together to reproduce to the best of their abilities."},{"name":"EMELOTH","text":"The point is to create something from beginning to end, and to that end we will have each person take charge of the area in which he or she excels."},{"name":"EMELOTH","text":"This exercise will give them not only a sense of satisfaction, but also a better understanding of each aspect of our craft in context. My thanks, Schoolmaster─such an idea would not have occurred to me without your input."},{"name":"EMELOTH","text":"Now, on the question of a sample, I believe that it is best made by your hands. The quality would surpass aught I could hope to produce, and the knowledge that it came from you would serve to inspire our apprentices."},{"name":"EMELOTH","text":"As for the subject... Ah, yes, a silver ring should pose a suitable challenge. Something adorned with a beautiful lapis lazuli from Her Grace's crown."},{"name":"EMELOTH","text":"Here are some materials to get you started. Should you require more, you need but ask Kanchana."},{"name":"SYSTEM","text":"To proceed with the quest, use the materials provided by Emeloth to craft a sample ring."},{"name":"SYSTEM","text":"Should your synthesis efforts prove unsuccessful, speak with Kanchana to receive another set of materials."},{"name":"SYSTEM","text":"To begin the crafting process, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>. Next, select <span class=\"highlight\">Special Recipes</span> from within the requisite crafting discipline, then <span class=\"highlight\">Story</span>, and lastly <span class=\"highlight\">Class Quests</span> to locate the desired recipe."},{"name":"JKHEBICA","text":"I heard that Miss Emeloth has a task for us and now my fingers are tingling for the anticipation!"},{"name":"WIDO","text":"Heh, I told Hal our first task is spendin' a night at a graveyard. It's too easy with him sometimes. &lt;sigh&gt;"},{"name":"HAL","text":"Oh gods, is it true? Are we really sleepin' at a graveyard? 'Cause I'm afraid of ghosts... &lt;gulp&gt;"},{"name":"KANCHANA","text":"If you have need of more materialsss, do not hesitate to asssk. For educational purposesss, the sample can't be anything short of perfect, yesss?"},{"name":"KANCHANA","text":"The ring is ready, yesss? What are you waiting for? Hurry and show it to Emeloth."},{"name":"EMELOTH","text":"Our apprentices keenly await their task, <span class=\"highlight\">Forename</span>. May I ask if the ring is ready?"},{"name":"EMELOTH","text":"Byregot's beard, such an immaculately balanced ring! And the exquisite texture, each hammerstroke lovingly measured..."},{"name":"EMELOTH","text":"I had expected to be impressed, but I find myself in utter awe. This ring is the very embodiment of perfection, a worthy vessel for the sultana's faith and goodwill."},{"name":"EMELOTH","text":"'Tis the simplest articles that separate masters from middling craftsmen. I wonder if our aspiring young goldsmiths will be able to appreciate the difference."},{"name":"EMELOTH","text":"Everyone, pray gather around! For your next task, we will have you make a simple ring. Schoolmaster <span class=\"highlight\">Surname</span> has personally crafted a sample for your reference."},{"name":"JKHEBICA","text":"Oh, there's no way I could possibly make something this fine, not within my lifetime and definitely not today!"},{"name":"KANCHANA","text":"Heh heh, such refreshing candor, and a sssentiment I can well appreciate. Though I am no expert, 'tis plain that this is the work of a true massster."},{"name":"EMELOTH","text":"And so it is, but be not daunted, my apprentices, for we neither ask nor expect a master's quality of you yet. Nay, your goal is to simply produce a finished product, and you needn't give thought beyond that."},{"name":"WIDO","text":"There I was thinkin' I was handy with metal, but this is takin' it to another level."},{"name":"HAL","text":"I hear you. I thought the gem was already perfect when it was on the crown, but now it's...<span class=\"emphasis\">more</span> perfect. What tiny warps there was on the surface are all gone. Not that I noticed them afore..."},{"name":"HAL","text":"Might be as we're better at some things than we are at others, but it's all the same next to what the schoolmaster can do."},{"name":"JKHEBICA","text":"Right... The goal's so far away it doesn't seem to matter where we start from and what our strengths and weaknesses are."},{"name":"EMELOTH","text":"Rest assured your strengths are nothing to look down upon, and we shall draw upon them first of all. As such, the work will be delegated as follows: Wido will be responsible for fashioning the band; Hal will cut and polish the stone; and last but not least, J'khebica will take charge of the initial design and finishing touches."},{"name":"EMELOTH","text":"Doubt not that the time will come when you strive for mastery in all aspects of goldsmithing. But to begin with, we want you to focus on cultivating your individual strengths, and bid you join them together now to create your very first finished product."},{"name":"JKHEBICA","text":"(-Apprentices-)Yes, miss!"},{"name":"JKHEBICA","text":"We appreciate you taking the time to craft such an amazing sample especially for us and we promise to do our very best!"},{"name":"EMELOTH","text":"The schoolmaster and I have every confidence that you will. Remember, this workshop is yours and everything here is at your disposal. But should you have any further needs or questions, do not hesitate to come to us."},{"name":"EMELOTH","text":"Hehe, the change in their bearing was fairly palpable, was it not? To behold your ring was to gaze up at the true heights of our craft, and it instilled them with newfound determination. I look forward to seeing how they rise to the challenge."},{"name":"SYSTEM","text":"In polishing your skills as a goldsmith, you have learned “Quality Assurance”!"}],"reward":{"gil":1650,"items":[{"num":250,"id":10},{"id":19520},{"id":19623,"one":1},{"id":19624,"one":1},{"id":19625,"one":1},{"id":19626,"one":1},{"num":5,"id":5825,"one":1}],"xp":1725300},"reqs":{"jobs":[{"lvl":63,"id":12}],"quests":[68135]},"next":[68137]},"partials":[{"type":"npc","id":"1002280","obj":{"i":1002280,"n":"Jemime","l":41,"q":7,"t":"Guild Receptionist"}},{"type":"npc","id":"1021131","obj":{"i":1021131,"n":"Emeloth","l":2403,"q":4}},{"type":"npc","id":"1021132","obj":{"i":1021132,"n":"J'khebica","l":2403,"q":2}},{"type":"npc","id":"1021133","obj":{"i":1021133,"n":"Wido","l":2403,"q":4}},{"type":"npc","id":"1021134","obj":{"i":1021134,"n":"Hal","l":2403,"q":4}},{"type":"npc","id":"1021135","obj":{"i":1021135,"n":"Kanchana","l":2403,"q":4}},{"type":"npc","id":"1021142","obj":{"i":1021142,"n":"Emeloth","l":43,"q":1}},{"type":"npc","id":"1021143","obj":{"i":1021143,"n":"Emeloth","l":2403,"q":1}},{"type":"npc","id":"1021144","obj":{"i":1021144,"n":"J'khebica","l":2403,"q":1}},{"type":"npc","id":"1021145","obj":{"i":1021145,"n":"Wido","l":2403,"q":1}},{"type":"npc","id":"1021146","obj":{"i":1021146,"n":"Hal","l":2403,"q":1}},{"type":"npc","id":"1021147","obj":{"i":1021147,"n":"Kanchana","l":2403,"q":1}},{"type":"item","id":"19520","obj":{"i":19520,"n":"Stiperstone Grinding Wheel","l":200,"c":35360,"t":19,"p":28512}},{"type":"item","id":"19623","obj":{"i":19623,"n":"Ruby Cotton Coatee","l":200,"c":43810,"t":35,"p":26136}},{"type":"item","id":"19624","obj":{"i":19624,"n":"Gyuki Leather Gloves of Crafting","l":200,"c":44573,"t":37,"p":15681}},{"type":"item","id":"19625","obj":{"i":19625,"n":"Ruby Cotton Bottoms","l":200,"c":45976,"t":36,"p":26136}},{"type":"item","id":"19626","obj":{"i":19626,"n":"Gyuki Leather Shoes","l":200,"c":46758,"t":38,"p":15681}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17901","obj":{"i":17901,"n":"Ring Materials","l":270,"c":21276,"t":63}},{"type":"item","id":"17902","obj":{"i":17902,"n":"Sample Silver Ring","l":270,"c":54408,"t":63}},{"type":"quest","id":"68135","obj":{"i":68135,"n":"A Royal Request","g":139,"l":"Ul'dah","s":601,"f":1}},{"type":"quest","id":"68137","obj":{"i":68137,"n":"Blindsided","g":139,"l":"Rhalgr's Reach","s":650,"f":1}}]}