{"quest":{"name":"The Perfect Tribute","location":"Rhalgr's Reach","id":68138,"patch":4.0,"sort":680,"icon":100688,"unlocksFunction":1,"eventIcon":71341,"issuer":1021131,"target":1021131,"involved":[1012528,1021133,1021134,1021135,1021136,1021151,1021152,1021153,1021154,1021155,1021156,1021157],"genre":139,"usedItems":[17905,17906],"journal":["Emeloth is expecting a call on her linkpearl any moment now.","No sooner do you begin conversing with Emeloth than she receives a call on her linkpearl from Marcel. It appears the apprentices' handiwork has been well received in Ul'dah, and Marcel would have them come to Ul'dah to meet with clients. Bear the good tidings to your students, who have gathered by Chakra Falls to the north.","Your apprentices are ecstatic to learn that their crafting skills have met with approval. They go on to reveal that they wish to repay the sultana's kindness, but are struggling to determine what manner of item would make for a suitable tribute. J'khebica proposes consulting Marcel on the matter, and begs you to put in a word on their behalf when they travel to Ul'dah for the meeting.","Though unable to provide an insight into a tribute, Marcel shares with you a rumor that a disguised Nanamo has been frequenting a certain shop. If you can but observe her visiting the shop in question, you may be able to discover the object of her fancy. This is good enough for J'khebica, who rushes off to investigate the rumor on Sapphire Avenue with her fellow apprentices. Join them there and be on hand to identify the sultana should she make an appearance.","Your apprentices have managed to learn that the shop Nanamo frequents is a sundry goods store situated opposite the arms vendor Jealous Juggernaut. All that remains, then, is to plant yourself at a suitable spot and play the waiting game.","After a short while standing watch, a maiden not unlike Nanamo appears at the shop accompanied by a man not unlike Papashan. Their conversation reveals that Nanamo is extremely smitten with an orchestrion on display there, but it is too big to fit in her bedchamber. With that, the tribute is decided: an elegant and compact orchestrion. Join your apprentices back at Rhalgr's and report all that has come to pass to Emeloth.","While Emeloth appreciates the apprentices' enthusiasm, she believes that they are not quite ready to make an orchestrion. To prepare them for the challenge, she proposes having them practice by crafting a tabletop chronometer, a similarly complex apparatus, and it falls to you once more to craft a sample for your apprentices.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Kanchana.","Your tabletop chronometer impresses Emeloth to no end and leaves your apprentices in awe of your skills yet again. As they go about honing their skills for the task ahead, see to it that you do not neglect your own, for yours are the hands that shape these young goldsmiths.<br><br>※The next goldsmith quest will be available from Emeloth upon reaching level 70."],"objectives":["Speak with J'khebica.","Speak with Marcel in Ul'dah.","Speak with J'khebica.","Speak with Wido.","Speak with Hal.","Wait at the designated location.","Speak with Emeloth at Rhalgr's Reach.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a sample chronometer <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the sample chronometer <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Emeloth</span></span>."],"dialogue":[{"name":"EMELOTH","text":"Schoolmaster, I trust you've been keeping well. It pleases me to say that our apprentices are making sound progress. Such is their dedication, they've even formed a study group of their own volition."},{"name":"EMELOTH","text":"Pray excuse me a moment.<br>...Ah, Master Marcel, good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you. ...Truly!? We are in your debt!"},{"name":"EMELOTH","text":"You will recall that I have been looking for willing outlets for our apprentices' handiwork. To that end, I sent some samples to Master Marcel to present to merchants."},{"name":"EMELOTH","text":"Well, that was Master Marcel reporting on the results, and it seems the samples were very well received! No few outlets have expressed their interest, with some willing to stock our wares on a trial basis."},{"name":"EMELOTH","text":"Though it's low volume still, orders have already come in, and Master Marcel asks that the apprentices come to Eshtaime's for a meeting with the clients. To reach this stage in so short a time is a tremendous achievement, and they may rightly feel proud."},{"name":"KANCHANA","text":"Speaking of the apprenticesss, they shall be glad for the tidingsss. Mayhap the ssschoolmaster would care to be the bearer?"},{"name":"EMELOTH","text":"There is no denying the news would be sweeter coming from you, <span class=\"highlight\">Forename</span>. Might I trouble you to tell them?"},{"name":"KANCHANA","text":"You will find them gathered by Chakra Falls to the north. Engaging in some furtive enterprissse, if I might add."},{"name":"EMELOTH","text":"The news would be sweeter coming from you, <span class=\"highlight\">Forename</span>. Please go and tell our apprentices."},{"name":"KANCHANA","text":"You will find the apprenticesss gathered by Chakra Falls to the north, whissspering up a storm."},{"name":"WIDO","text":"Can't you see we're─ Ch-Chief!? H-How did you know we was here?"},{"name":"HAL","text":"Uwaaah! W-We ain't doin' nothin' suspicious, I swear!"},{"name":"MARCEL","text":"Ah, yes, I had the pleasure of inspecting your apprentices' works, and I must say they surpassed all my expectations."},{"name":"MARCEL","text":"To be sure, they are not of a quality to grace Eshtaime's shelves, but nor will they look amiss at your average shop."},{"name":"JKHEBICA","text":"S-Schoolmaster <span class=\"highlight\">Surname</span>!? What are you doing─ I-I mean, what can we do for you!?"},{"name":"JKHEBICA","text":"What? Did I hear you right and you just told us we've received <span class=\"emphasis\">real</span> orders from <span class=\"emphasis\">real</span> clients!?"},{"name":"WIDO","text":"Huh, an' there I thought we was years away from makin' sellable stuff."},{"name":"HAL","text":"It's all thanks to you an' Miss Emeloth! We'll put out our best work an' make you proud, you'll see!"},{"name":"JKHEBICA","text":"Um, sooo...you're probably wondering why we're gathered like this and talking secret talk. You see, we want to do something to show our gratitude to the sultana for granting us this opportunity to become goldsmiths and contribute to Ala Mhigo's future."},{"name":"WIDO","text":"Aye, she even sacrificed her mother's crown. An' seein' as our wares're now fit for the market, it's time we repaid her kindness."},{"name":"HAL","text":"Problem is we can't decide how to go about it, what to give her. We was thinkin' maybe we could use the crown's remainin' gems to make somethin', but beyond that..."},{"name":"JKHEBICA","text":"Oh, I've an idea! The meeting with the clients will take place at Eshtaime's and Master Marcel will be on hand, am I right?"},{"name":"JKHEBICA","text":"Well, if anyone knows a suitable tribute it would be him, so perhaps we could consult him on it while we're there and it would give us heart if you were present as well."},{"name":"HAL","text":"Yeah, what she said. We'd feel a lot better havin' you with us."},{"name":"HAL","text":"Anyway, we'd best be off! C'mon, you two, we've got some orders to receive!"},{"name":"EMELOTH","text":"The apprentices departed for Ul'dah in high spirits. Ere they left, they told me their plan of a tribute for Her Grace."},{"name":"EMELOTH","text":"'Tis a fine idea, and I pray that your meeting with Master Marcel will provide some insights."},{"name":"KANCHANA","text":"So the young onesss were simply discussing a tribute for the sssultana. That is a good thing, unlike some of the other possibilitiesss I entertained."},{"name":"JKHEBICA","text":"Schoolmaster <span class=\"highlight\">Surname</span>, thank you ever so much for coming! We've already spoken with our clients and Wido and Hal have since gone off to the markets to procure supplies, but we can ask Master Marcel about the you-know-what whenever you're ready."},{"name":"MARCEL","text":"<span class=\"highlight\">Surname</span>, I am pleased to report that the meeting went smoothly and the clients left feeling confident. Now then, your apprentices say you have a consultation for me?"},{"name":"MARCEL","text":"Ho, a tribute for the sultana, and one which makes use of the gems from her lady mother's crown! An inspired idea!<br>...Alas, I have none of mine own to offer; naught likely is coming to mind."},{"name":"MARCEL","text":"As I'm sure you will appreciate, I am honor-bound to protect my patrons' confidentiality...but it should not infringe upon my code of conduct to share with you such rumors as are commonly heard in town."},{"name":"MARCEL","text":"If the whispers are to be believed, a maiden who shares an uncanny resemblance to the sultana has been observed frequenting a certain shop. If the maiden in question is in fact Her Grace, it may well be that something has taken her fancy. And that something may offer an answer to your question."},{"name":"MARCEL","text":"You've seen the sultana in disguise on a number of occasions, I believe. You ought to be able to recognize her easily enough."},{"name":"JKHEBICA","text":"Well, this all sounds promising and it just so happens Hal and Wido are at Sapphire Avenue Exchange so I'll fetch them and we'll investigate the rumor together!"},{"name":"JKHEBICA","text":"Once we've got a name for the shop, we'll lie in wait for the sultana and we'll need you to be on hand to identify her. See you in a bit, Schoolmaster─and thank you for your kind help, Master Marcel!"},{"name":"MARCEL","text":"Well do I recall the time you journeyed all the way to the Sea of Clouds for the sake of your patron─a testament to your surpassing dedication."},{"name":"MARCEL","text":"Seeing your apprentices go to such lengths for their own patron, I daresay that dedication has filtered through to them."},{"name":"JKHEBICA","text":"Schoolmaster, a short while ago there was a sighting of a maiden who looks not unlike Her Grace accompanied by a person who looks not unlike an old man."},{"name":"JKHEBICA","text":"It's secondhand information, to be sure, but if it's true it's not unlike a golden chance and we just need to find out what this shop is that the sultana visits."},{"name":"WIDO","text":"Sorry for makin' you run around with us like this, Chief. But it won't take much longer, I promise─we've got good info on the shop what's mentioned in the rumors."},{"name":"WIDO","text":"It's a sundry goods store opposite an arms vendor, an' there's only so many of those on Sapphire Avenue."},{"name":"HAL","text":"No time for supplies, we've got the sultana to find. You'll be pleased to hear I've narrowed down the arms vendor. It's a place owned by one Jealous Juggernaut."},{"name":"HAL","text":"Which means the sultana's favored shop's just across the way. Keep watch there long enough, an' she's bound to appear!"},{"name":"JKHEBICA","text":"A short while ago there was a sighting of a maiden who looks not unlike Her Grace accompanied by a person who looks not unlike an old man, and we just need to find out where they're going."},{"name":"WIDO","text":"The place the sultana frequents, it's a sundry goods store opposite an arms vendor. There's only so many of those on Sapphire Avenue."},{"name":"HAL","text":"The sultana's favored shop's across from Jealous Juggernaut's place. Keep watch there long enough, an' she's bound to appear!"},{"name":"JKHEBICA","text":"Based on Wido and Hal's information, this is where the sultana-esque maiden appears..."},{"name":"JKHEBICA","text":"&lt;gasp&gt; Look!"},{"name":"PAPASHAN","text":"(-Papashan-esque Man-)To come and see this orchestrion fairly every day... You truly are taken by it, Lady Lilira."},{"name":"NANAMOULNAMO","text":"(-Nanamo-esque Maiden-)Oh, it is perfect in all ways...save for its size. Would that it were small enough to fit in my bedchamber. &lt;sigh&gt; Does an elegant and compact orchestrion not exist?"},{"name":"PAPASHAN","text":"(-Papashan-esque Man-)Such an item would suit my lady very well indeed, but I fear it will prove elusive to find even in our great city."},{"name":"JKHEBICA","text":"S-Schoolmaster, was that...was that who I think it is?"},{"name":"JKHEBICA","text":"And she desires an elegant and compact orchestrion, Byregot be praised!"},{"name":"JKHEBICA","text":"Now that we know what to make, we must back to Rhalgr's Reach so you can get to work right away and needless to say we'll be needing your help. Oh, we ought to say our thanks to Master Marcel again, but me and the others can take care of that so please go on ahead."},{"name":"KANCHANA","text":"Is it true that you were ssstalking the sssultana all over Ul'dah? ...No? Then perhapsss I misheard."},{"name":"MARCEL","text":"Your apprentices paid me a very excited visit earlier. I'm pleased to learn that my information proved useful and you have settled on a gift for the sultana."},{"name":"JKHEBICA","text":"We're truly grateful for your help in finding out what Her Grace desires and we're ready when you are to begin work on the orchestrion!"},{"name":"WIDO","text":"You'd think the sultana would have the run o' her own country, but I guess it ain't that simple."},{"name":"HAL","text":"S-Schoolmaster! Is it true!? The sultana's on her way here <span class=\"emphasis\">right now</span>!?"},{"name":"HAL","text":"...She isn't? B-But Wido said─ Oh, godsdammit, not again!"},{"name":"EMELOTH","text":"Our apprentices have told me all. They wish to present Her Grace with an elegant and compact orchestrion. 'Tis a fine choice for a tribute, and made finer still with the gems from her lady mother's crown."},{"name":"EMELOTH","text":"While large machines fashioned by carpenters are the norm, I believe it is well within the realm of possibility to produce a miniaturized version with our goldsmithing techniques."},{"name":"EMELOTH","text":"But by our techniques, I mean yours and mine, Schoolmaster. Though our apprentices have become capable enough to fill the odd order, they yet lack the skill needed to craft precision instruments, and orchestrions demand no small degree of precision."},{"name":"EMELOTH","text":"But seeing as they are determined, it falls to us to prepare them for the challenge. To that end, I've a mind to test them on a similarly complex apparatus: a tabletop chronometer."},{"name":"EMELOTH","text":"From past experience, rather than being taken by the hand, I believe our apprentices learn best by following your example. And so I would ask that you perform another demonstration."},{"name":"EMELOTH","text":"Pray begin whenever you are ready, Schoolmaster, and let Kanchana know if you have need of additional materials."},{"name":"JKHEBICA","text":"So we're to practice by making a chronometer? Whatever you and Miss Emeloth think best, of course, and of course we'll do our best!"},{"name":"WIDO","text":"If an orchestrion's as hard as you say, makes sense to cut our teeth on a chronometer first. Bring it on, Chief!"},{"name":"HAL","text":"Feels like only yesterday I was barely able to make a ring, but now I'm about to make a clock. I couldn't have made it this far without you an' Miss Emeloth."},{"name":"KANCHANA","text":"Should you lack componentsss for the chronometer, do not hesssitate to tell me."},{"name":"KANCHANA","text":"Sssuch a fine chronometer you have made. Emeloth is sssure to be impressed."},{"name":"EMELOTH","text":"How fares the crafting effort, <span class=\"highlight\">Forename</span>? Both the apprentices and I eagerly await your finished chronometer."},{"name":"EMELOTH","text":"This, Schoolmaster, is absolutely flawless. My breath fairly caught in my throat. My expectations of you are high as a matter of course, but you manage to transcend them every time."},{"name":"EMELOTH","text":"Apprentices, you are not like to find a finer example of a chronometer. Study it well and reproduce it as best you can, and you shall acquire the requisite knowledge and techniques for making an orchestrion."},{"name":"JKHEBICA","text":"We're supposed to reproduce <span class=\"emphasis\">that</span>? Oh, dear, my hands are starting to shake, but it's not out of dread but the excitement of tackling the task! The more I learn goldsmithing, the more I'm made to appreciate the schoolmaster's brilliance and keenly feel how utterly unpolished I am next to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"JKHEBICA","text":"You're like a god among goldsmiths, up in your own place in the heavens while we're bumbling down here on the ground, and though we may never get to where you are, we'll keep on climbing every mountain in the hopes that one day we will!"},{"name":"EMELOTH","text":"'Tis well that they are motivated, for this will be the steepest mountain yet. But when they have climbed it, they will be all the more prepared to climb all the others to come."}],"reward":{"gil":2334,"items":[{"num":250,"id":10},{"id":19562},{"id":5703,"one":1},{"id":5708,"one":1},{"id":5713,"one":1}],"xp":2902500},"reqs":{"jobs":[{"lvl":68,"id":12}],"quests":[68137]},"next":[68139]},"partials":[{"type":"npc","id":"1021131","obj":{"i":1021131,"n":"Emeloth","l":2403,"q":4}},{"type":"npc","id":"1012528","obj":{"i":1012528,"n":"Marcel","l":41,"q":9}},{"type":"npc","id":"1021133","obj":{"i":1021133,"n":"Wido","l":2403,"q":4}},{"type":"npc","id":"1021134","obj":{"i":1021134,"n":"Hal","l":2403,"q":4}},{"type":"npc","id":"1021135","obj":{"i":1021135,"n":"Kanchana","l":2403,"q":4}},{"type":"npc","id":"1021136","obj":{"i":1021136,"n":"J'khebica","l":2403,"q":2}},{"type":"npc","id":"1021151","obj":{"i":1021151,"n":"J'khebica","l":2403,"q":2}},{"type":"npc","id":"1021152","obj":{"i":1021152,"n":"Wido","l":2403,"q":2}},{"type":"npc","id":"1021153","obj":{"i":1021153,"n":"Hal","l":2403,"q":2}},{"type":"npc","id":"1021154","obj":{"i":1021154,"n":"J'khebica","l":41,"q":1}},{"type":"npc","id":"1021155","obj":{"i":1021155,"n":"J'khebica","l":41,"q":1}},{"type":"npc","id":"1021156","obj":{"i":1021156,"n":"Wido","l":41,"q":1}},{"type":"npc","id":"1021157","obj":{"i":1021157,"n":"Hal","l":41,"q":1}},{"type":"item","id":"19562","obj":{"i":19562,"n":"Polished Slate Grinding Wheel","l":260,"c":35362,"t":19,"p":37065}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"17905","obj":{"i":17905,"n":"Chronometer Materials","l":285,"c":26271,"t":63}},{"type":"item","id":"17906","obj":{"i":17906,"n":"Sample Chronometer","l":285,"c":53016,"t":63}},{"type":"quest","id":"68137","obj":{"i":68137,"n":"Blindsided","g":139,"l":"Rhalgr's Reach","s":650,"f":1}},{"type":"quest","id":"68139","obj":{"i":68139,"n":"Sultana Dreaming","g":139,"l":"Rhalgr's Reach","s":700,"f":1}}]}