{"quest":{"name":"Mounting Expectations","location":"Gridania","id":68146,"patch":4.0,"sort":630,"icon":100689,"unlocksFunction":1,"eventIcon":71341,"issuer":1020929,"target":1020941,"involved":[1012064,1012066,1020931,1020932,1020933,1020934,1020935,1020936,1020937,1020938,1020940],"genre":140,"usedItems":[17909,17910],"journal":["Atelloune is ready to put her new assistant to work.","The venue for displaying mounts has been set, and Atelloune has decided on your first specimen─the rare and elusive Hengr dhalmel. The only problem, however, is procuring one while keeping its coat in pristine condition. Your suggestion to speak with the Vanu Vanu catches Atelloune by surprise, but she is swift to seize the opportunity. Without a moment's notice, she is off to the Sea of Clouds with Enion in tow.","You find Atelloune waiting anxiously for your arrival, her haste made clear by Enion's look of exhaustion from travel. She insists on speaking with the village elder in the hopes of expediting her request.","In light of all the good you have done for his people, Sonu Vanu is only too happy to grant your request. It is not long after the Vanu hunters set off, though, that Enion speaks up to make a confession: he has never actually seen the dhalmels Atelloune would have him mount. No sooner does he utter the words than Atelloune orders you to escort him out into the wilds to survey these gentle giants.","From the heads atop their long, elegant necks down to their hooves, Enion is able to observe the dhalmels in all their splendor. Atelloune will be happy to learn that he has committed their image to memory.","The Vanu Vanu hunters have brought you a perfect specimen, and Atelloune has already hired an airship to retrieve it. Sadly, there is not enough room for the three of you and the dhalmel aboard. She asks that you use the nearby aetheryte to teleport back to Gridania, where she and Enion will be waiting for you.","The dhalmel has been skinned and Enion is hard at work preparing a mannequin in its likeness. As Atelloune hands you the skin, she reminds you that nothing less than perfection will do for this mount. When next you speak to her, she expects you to have a dhalmel cape of the highest quality in hand.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Atelloune.","Enion's eyes grow wide with excitement at the sight of the dhalmel cape you prepared. With a show of skill seemingly beyond his years, he fashions a mount so lifelike one might expect it to take leave of its pedestal. Atelloune is quite pleased with your teamwork, but this mount is only the beginning. Before setting to work on your next mount, however, she would see what interest this display might garner from the good people of Gridania. In the meantime, she bids you rest, and reflect on what you have learned.<br><br>※The next leatherworker quest will be available from Atelloune upon reaching level 65."],"objectives":["Speak with Atelloune at Ok' Zundu.","Speak with Sonu Vanu.","Observe dhalmels from the designated vantage point.","Report to Atelloune.","Speak with Atelloune at the Leatherworkers' Guild.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a large dhalmel cape <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the large dhalmel cape <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Enion</span></span>."],"dialogue":[{"name":"ATELLOUNE","text":"Ah, Number Seventy-Two. Ready for work, I see. Wonderful. Not long ago I was able to secure a location for our exhibition of animal mounts─a small clearing near the Leatherworkers' Guild. Would that we had a more prominent location, but no matter."},{"name":"ATELLOUNE","text":"Considering the nature of our work and its purpose, the Leatherworkers' Guild will do nicely."},{"name":"ATELLOUNE","text":"More importantly, I have selected our first specimen for mounting─the majestic dhalmel."},{"name":"ATELLOUNE","text":"This is no ordinary dhalmel we are looking for, mind you. What we seek is the elusive Hengr dhalmel in the Sea of Clouds."},{"name":"ATELLOUNE","text":"To the untrained eye they are indistinguishable from your average dhalmel. Upon close inspection, however, you will find they have hackles along their backs which can appear quite pronounced when they are startled."},{"name":"ATELLOUNE","text":"As their numbers continue to dwindle, finding an ideal specimen will prove difficult."},{"name":"ATELLOUNE","text":"And the last thing we need is to exacerbate the problem of their declining population by killing one. No, we will need to find a dhalmel that has recently passed on. This will require a skilled hunter, one familiar with the terrain. You wouldn't happen to know of such a person, would you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Well, there's the Vanu Vanu."},{"name":"A1","text":"The Vanu Vanu, obviously."},{"name":"ATELLOUNE","text":"Why would <span class=\"emphasis\">you</span> know of the Vanu Vanu?"},{"name":"ATELLOUNE","text":"Never mind. If you believe you can convince them to assist us, I suppose it is worth a try."},{"name":"ATELLOUNE","text":"We must make for Ok' Zundu at once, where you will arrange an audience with their people. Let us be off."},{"name":"ENION","text":"Everything seems to be coming along fine. If you ask me, though, things would go smoother if she wasn't so forceful with her demands."},{"name":"ATELLOUNE","text":"There you are, Number Seventy-Two! What have I told you about keeping me waiting? You must hurry and introduce me."},{"name":"ATELLOUNE","text":"And not to some piddling merchant or villager. I will settle for nothing short of their village elder. Yes, I should think it the ideal way to ensure our needs are met swiftly and without incident."},{"name":"ENION","text":"I'll never understand...&lt;pant&gt;...why she insists on rushing so."},{"name":"SONUVANU","text":"These netherlings seek dhalmels of Hengr?"},{"name":"SONUVANU","text":"Say no more. Zundu are honored to repay kindness of the great warrior who defeated the White."},{"name":"ATELLOUNE","text":"Excuse me for interrupting, but I could not help but notice your huts appear to be made using the bones of dhalmels."},{"name":"SONUVANU","text":"Yes, Zundu use dhalmels for many things."},{"name":"SONUVANU","text":"Their meat fills our bellies, their skin covers our backs. And as Netherling says, their bones build our homes."},{"name":"ATELLOUNE","text":"Quite impressive. It is not often I see game hunted and put to use so thoroughly."},{"name":"SONUVANU","text":"To take a life is to bear great responsibility. Nothing can be wasted. To ask for a dhalmel so rare, we trust you understand this."},{"name":"SONUVANU","text":"To find fresh remains is no easy task. I will leave this to Sanu Vanu. He is our greatest hunter. You may wait here while he finds the dhalmel you seek."},{"name":"ATELLOUNE","text":"Thank you, Sonu Vanu. Your kindness this day will be remembered for generations to come."},{"name":"ENION","text":"Pardon me, Miss Atelloune, but... I'm awfully glad you've gone to so much trouble to get a dhalmel─really, I am. It's just... Well, I've never actually seen a live dhalmel before, and─"},{"name":"ATELLOUNE","text":"You've never <span class=\"emphasis\">seen</span> a dhalmel before!? By the Twelve, how do you expect to fashion a suitable mannequin if you've never seen them for yourself?"},{"name":"SONUVANU","text":"Dhalmels of Hengr are scarce, but all look very similar. If netherlings would see dhalmels, you needn't travel far."},{"name":"ATELLOUNE","text":"Then it's settled, then."},{"name":"ATELLOUNE","text":"Number Seventy-Two. Take Number Seventy-One to go and see the dhalmels. From their long, elegant necks down to their hooves─he must become intimately familiar with their carriage."},{"name":"SONUVANU","text":"To the southeast of Ok' Zundu they graze in great numbers. May Zephyr winds carry you safely."},{"name":"ATELLOUNE","text":"If you've truly established relations with these beastmen, introducing me to their village elder should prove no trouble at all."},{"name":"ENION","text":"There they are. Can you see them? We have to be sure to get a good look. Miss Atelloune said we have to inspect every ilm of them."},{"name":"SYSTEM","text":"Search your surroundings for dhalmels. You may move the camera as well as zoom in and out. Target a dhalmel and inspect them with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"ENION","text":"（★未使用／削除予定★）"},{"name":"ENION","text":"Wow! This is much better than any picture. Look at its neck! Gosh, how am I supposed to make a model that supports something that long?"},{"name":"ENION","text":"Alright, I think I have an idea of what to do. The neck may prove difficult, though. Let's head back to Miss Atelloune."},{"name":"ATELLOUNE","text":"Take Number Seventy-One to Ok' Zundu and observe what you can. If some ill misfortune befalls you─say, you're trampled by the dhalmels─know that your remains will not go to waste. I will have them used in the construction of one of these fine huts, or perhaps a piece of furnishing."},{"name":"SONUVANU","text":"Dhalmels graze on the islands southeast of Ok' Zundu. Tread carefully, netherling. They are gentle, but dangerous all the same."},{"name":"SANUVANU","text":"You need only watch, netherling. Leave hunting to us."},{"name":"ENION","text":"The dhalmels should be close. Let's have a look around."},{"name":"ATELLOUNE","text":"By Number Seventy-One's look of excitement, I would assume the two of you observed the dhalmels without incident."},{"name":"ATELLOUNE","text":"The Vanu Vanu have brought us a fine specimen. The hackles along its back and the divide of its hooves are unmistakable. This is indeed a Hengr dhalmel."},{"name":"ATELLOUNE","text":"And by the condition of the body it would seem its passing was not long ago. While the loss of any life is always a tragedy, let us take solace in the fact its life ended peacefully."},{"name":"ATELLOUNE","text":"I know not what great deeds you have done that warrant such generosity, but I should hope your work on our dhalmel mount will warrant the same praise."},{"name":"ATELLOUNE","text":"I've called for an airship to come and retrieve the dhalmel, though I fear it cannot carry us all."},{"name":"ATELLOUNE","text":"You adventurers often use aetherytes for travel, yes? While we see to the dhalmel's delivery, pray use that aetheryte to return, and do try not to take too long this time."},{"name":"ATELLOUNE","text":"We shall wait for you at the clearing near the Leatherworkers' Guild. Number Seventy-One should be finished preparing the dhalmel's pelt by the time you arrive."},{"name":"ENION","text":"To think but a few bells ago this dhalmel was alive and walking around, just like you and me..."},{"name":"SONUVANU","text":"How did our hunter fare, netherling? Did he find dhalmel with long neck, like grass reaching for summer sun?"},{"name":"SANUVANU","text":"Like sun shining down on Ok' Zundu, Sonu Vanu was glowing with pride on his return. We hope netherlings are pleased."},{"name":"HANTERVANUVANU02610","text":"Please, we need no payment. It is honor to help the great netherling warrior."},{"name":"ATELLOUNE","text":"Finally, you're here. As promised, the dhalmel's pelt is ready for you."},{"name":"ATELLOUNE","text":"If you are as skilled as Geva claims, you should have no trouble turning this into a resplendent cape of the highest quality."},{"name":"ATELLOUNE","text":"And please, be careful with that pelt. I will not stand to see the Vanu's hard work go to waste. I would rather not bother them for want of another dhalmel so rare."},{"name":"ATELLOUNE","text":"When you have finished, deliver it to Number Seventy-One."},{"name":"ATELLOUNE","text":"Together with his mannequin, we shall have the finest mount the realm has ever seen."},{"name":"SYSTEM","text":"To proceed with the quest, use the materials provided by Atelloune to craft a high-quality large dhalmel cape."},{"name":"SYSTEM","text":"Should your synthesis efforts prove unsuccessful, speak with Atelloune once more to receive another set of materials."},{"name":"SYSTEM","text":"To begin the crafting process, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>. Next, select <span class=\"highlight\">Special Recipes</span> from within the requisite crafting discipline, then <span class=\"highlight\">Story</span>, and lastly <span class=\"highlight\">Class Quests</span> to locate the desired recipe."},{"name":"ATELLOUNE","text":"You needn't worry about the dhalmel. Just see to it you return to Gridania in a timely fashion."},{"name":"ENION","text":"I can't wait to see what you can do with the dhalmel's pelt!"},{"name":"ENION","text":"My mannequin is going to look great with that cape. I just know it!"},{"name":"ENION","text":"This is amazing! My skins are usually full of holes after removing all the fat."},{"name":"ENION","text":"You've even kept all the coarse hair on the back! Miss Atelloune was right to hire you."},{"name":"ATELLOUNE","text":"It is up to you now to see our mount is completed. "},{"name":"ATELLOUNE","text":"Number Seventy-Two, I would ask you observe his work. It should prove an educational experience."},{"name":"ENION","text":"I'm not sure there's much to learn from watching me, but I'll do what I can."},{"name":"ENION","text":"Phew! It's done. Piecing it together was harder than I thought. Then again, I've never made a mount this big before."},{"name":"ENION","text":"Good thing I remembered what the Vanu Vanu said about dhalmel bones back at Ok' Zundu. They came in handy when I was working on the neck."},{"name":"ATELLOUNE","text":"I see. Meeting with the Vanu Vanu was more beneficial to our work than I could have hoped."},{"name":"ENION","text":"I couldn't have finished without <span class=\"highlight\">Forename</span>, though. There's no way I could fit a cape that big on the mannequin by myself. "},{"name":"ATELLOUNE","text":"Nevertheless, this is an excellent start to our collection. "},{"name":"ATELLOUNE","text":"Considering dhalmelskin products have gained popularity here in Gridania, this is certain to draw the people's attention to our cause."},{"name":"ATELLOUNE","text":"That said, your work is far from finished, my dear assistant. Before we set to work on our next mount, however, I would gauge reactions to our first creation. In the interim, pray reflect on what we've done thus far, and see if there is aught you can do to refine your skills."},{"name":"ATELLOUNE","text":"Have you finished with the dhalmel skin yet? I would prefer not to keep Number Seventy-One idle for too long."},{"name":"ATELLOUNE","text":"You require <span class=\"emphasis\">another</span> dhalmelskin? &lt;sigh&gt; I should hope you are grateful that I thought to barter for another in case of an emergency."},{"name":"ATELLOUNE","text":"Every skin─and life sacrificed in its procurement─is precious. You would do well not to waste this one."},{"name":"SYSTEM","text":"Through your deepening insight into the sanctity of life, you have learned “Quality Assurance”!"}],"reward":{"gil":1626,"items":[{"num":250,"id":11},{"id":19521},{"id":19623,"one":1},{"id":19624,"one":1},{"id":19625,"one":1},{"id":19626,"one":1},{"num":5,"id":5825,"one":1}],"xp":1725300},"reqs":{"jobs":[{"lvl":63,"id":13}],"quests":[68145]},"next":[68147]},"partials":[{"type":"npc","id":"1020929","obj":{"i":1020929,"n":"Atelloune","l":53,"q":2}},{"type":"npc","id":"1020941","obj":{"i":1020941,"n":"Enion","l":53,"q":2}},{"type":"npc","id":"1012064","obj":{"i":1012064,"n":"Sonu Vanu","l":2100,"q":13}},{"type":"npc","id":"1012066","obj":{"i":1012066,"n":"Sanu Vanu","l":2100,"q":8}},{"type":"npc","id":"1020931","obj":{"i":1020931,"n":"Enion","l":53,"q":2}},{"type":"npc","id":"1020932","obj":{"i":1020932,"n":"Atelloune","l":2100,"q":1}},{"type":"npc","id":"1020933","obj":{"i":1020933,"n":"Enion","l":2100,"q":1}},{"type":"npc","id":"1020934","obj":{"i":1020934,"n":"Enion","l":2100,"q":1}},{"type":"npc","id":"1020935","obj":{"i":1020935,"n":"Atelloune","l":2100,"q":1}},{"type":"npc","id":"1020936","obj":{"i":1020936,"n":"Enion","l":2100,"q":1}},{"type":"npc","id":"1020937","obj":{"i":1020937,"n":"Atelloune","l":2100,"q":1}},{"type":"npc","id":"1020938","obj":{"i":1020938,"n":"Vanu Hunter","l":2100,"q":1}},{"type":"npc","id":"1020940","obj":{"i":1020940,"n":"Atelloune","l":53,"q":4}},{"type":"item","id":"19521","obj":{"i":19521,"n":"High Steel Awl","l":200,"c":35454,"t":21,"p":28512}},{"type":"item","id":"19623","obj":{"i":19623,"n":"Ruby Cotton Coatee","l":200,"c":43810,"t":35,"p":26136}},{"type":"item","id":"19624","obj":{"i":19624,"n":"Gyuki Leather Gloves of Crafting","l":200,"c":44573,"t":37,"p":15681}},{"type":"item","id":"19625","obj":{"i":19625,"n":"Ruby Cotton Bottoms","l":200,"c":45976,"t":36,"p":26136}},{"type":"item","id":"19626","obj":{"i":19626,"n":"Gyuki Leather Shoes","l":200,"c":46758,"t":38,"p":15681}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17909","obj":{"i":17909,"n":"Hengr Dhalmel Hide","l":270,"c":21806,"t":63}},{"type":"item","id":"17910","obj":{"i":17910,"n":"Large Dhalmel Cape","l":270,"c":22013,"t":63}},{"type":"quest","id":"68145","obj":{"i":68145,"n":"A Taxing Request","g":140,"l":"Gridania","s":601,"f":1}},{"type":"quest","id":"68147","obj":{"i":68147,"n":"The Value of Life","g":140,"l":"Gridania","s":650,"f":1}}]}