{"quest":{"name":"The Value of Life","location":"Gridania","id":68147,"patch":4.0,"sort":650,"icon":100689,"unlocksFunction":1,"eventIcon":71341,"issuer":1020940,"target":1020941,"involved":[1020942,1020943,1020944,1021300,1023895],"genre":140,"usedItems":[17911,17912],"journal":["That glimmer in Atelloune's eyes most likely means she has a task for you.","Atelloune is quite pleased with reactions to the dhalmel mount you and Enion constructed. The lack of inquiries regarding its distinct characteristics, however, has left her puzzled. Yet there is no time for quandaries, for she has decided on your next specimen─the ferocious grizzly bear of Gyr Abania. They are indigenous to East End, and she insists you speak with the soldiers of Castrum Oriens to better locate their den.","You arrive to find Enion is eager to get started. He suggests splitting up to gather information on grizzly bears, and immediately dashes off in search of soldiers to interrogate.","You speak with a Gridanian soldier who suggests you search near Bittermill. With this information in hand, you look for Enion to see if he has learned anything of your quarry. ","No sooner do you mention Bittermill than Enion rushes off in search of a grizzly bear. You hurry after him to assist in the hunt.","Enion is exhausted having narrowly escaped creatures that now call Bittermill their home. While he was fleeing, however, he tells you he spotted a grizzly bear near the river. Now eager to find a specimen fit for mounting, he rushes off once more into the woods.","You find Enion near the riverbank, a deceased grizzly bear at his feet. Its pelt is a ruin of cuts and grazes. Considering the scarcity of this woodland creature, Enion resigns to skinning it in the hopes of finding some use for its skin. You hope Atelloune will not be upset over its poor condition.","Though saddened by the state of the bear's pelt, Atelloune does not fault you for doing what you could to salvage it. She is convinced there is nothing to be done, but you insist that the pelt should not be wasted. She then entrusts it to you, and suggests making a simple pair of gloves.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Atelloune.","Enion tries on the bearskin gloves and is thrilled to find they are a perfect fit. Though the skin could not be salvaged to make a mount, Atelloune is thankful some good has come from the bear's sacrifice. She bids you rest and prepare as she considers another suitable subject for mounting.<br><br>※The next leatherworker quest will be available from Atelloune upon reaching level 68."],"objectives":["Speak with Enion at Castrum Oriens.","Speak with the serpent scout.","Speak with Enion.","Deliver the Velodyna grizzly bear hide to Atelloune.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize grizzly bear gloves <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the grizzly bear gloves <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Enion</span></span>."],"dialogue":[{"name":"ATELLOUNE","text":"Ah, Number Seventy-Two. Have you heard word of our work? Oh, of course you've heard. How could you not when our dhalmel is the talk of the town."},{"name":"ATELLOUNE","text":"Yet even so, I find it curious no one has inquired about its distinctive hair and hooves. You would think such stark differences from your typical dhalmel would compel even a handful of people to ask."},{"name":"ATELLOUNE","text":"No matter. It will be all we can do to keep inquirers at bay when we present them with our next mount─the mighty bear."},{"name":"ATELLOUNE","text":"Not just any bear, mind you, but the rapacious grizzly bear, indigenous to the lands bordering Gyr Abania."},{"name":"ATELLOUNE","text":"Sadly the fruit that serves as a staple of their diet has grown increasingly scarce in the wake of the Calamity. And as their food supply dwindles so too do their numbers."},{"name":"ATELLOUNE","text":"Though there is little we can do to restore their primary source of sustenance, we can still do our part to let people know of their plight."},{"name":"ATELLOUNE","text":"Now then, make your way to East End. When you arrive, I would suggest speaking with the soldiers stationed at Castrum Oriens to learn precisely where the bears can be found."},{"name":"ATELLOUNE","text":"I shall remain here to keep watch over the dhalmel mount, and for any wayward souls that may seek enlightenment."},{"name":"ENION","text":"You heard Miss Atelloune. Let's get going to Gyr Abania."},{"name":"ENION","text":"Hopefully the soldiers can point us in the right direction."},{"name":"ENION","text":"Everyone seems to love the dhalmel mount we made. I wonder what Miss Atelloune will have us make next."},{"name":"ENION","text":"We can ask more people if we split up."},{"name":"ENION","text":"Could you try asking around the eastern side of the base? I'll stay around the main gate and see what I can learn."},{"name":"ATELLOUNE","text":"...Hm? Why are you still here? Run along now. The bears are not like to waltz into the guild and offer up their own skins."},{"name":"ORIENSSOLDIER02611","text":"You're after grizzly bears?"},{"name":"ORIENSSOLDIER02611","text":"There used to be plenty of them to the south near Bittermill. Can't say I see too many of them now, though."},{"name":"ATELLOUNE","text":"...Hm? Why are you still here? Run along now. The bears are not like to waltz into the guild and offer up their own skins."},{"name":"ENION","text":"I've almost finished asking everyone over here. See what you can find out on the east side of the base."},{"name":"ENION","text":"So there used to be a lot of bears near Bittermill?"},{"name":"ENION","text":"I guess the fruit they like to eat must have grown there. If it still does, there may be a few bears in the area. Let's have a look."},{"name":"ORIENSSOLDIER02611","text":"If it's bears you seek, you might have luck near Bittermill. Be careful out there. "},{"name":"ENION","text":"Are you alright? I thought I was safe when I reached Bittermill, but instead I only found more monsters to chase me."},{"name":"ENION","text":"It wasn't all bad, though. When I was running I saw a grizzly bear near the river! "},{"name":"ENION","text":"Come on. Maybe there's one we can use for the mount!"},{"name":"ENION","text":"It's...it's dead..."},{"name":"ENION","text":"And look at these scars. I'm not sure if we can use this for a mount, but I doubt we're like to find another one."},{"name":"ENION","text":"&lt;sigh&gt; I suppose it wouldn't hurt to try. Can you help me ready the pelt?"},{"name":"SYSTEM","text":"You skin the bear, but its pelt is marred with gashes."},{"name":"ENION","text":"Well, I suppose we have our pelt. A shame it's in such poor condition. Let's head back to Gridania for now. Maybe Miss Atelloune can think of something to do with it."},{"name":"ATELLOUNE","text":"Finally, you're back. If you would deign to keep me waiting this long, I can only assume you have brought an immaculate specimen for the exhibition."},{"name":"ATELLOUNE","text":"No, no, no. The pelt is ruined! What is the meaning of this? What happened!?"},{"name":"ENION","text":"I'm sorry, Miss Atelloune. The grizzly bear was already covered in scrapes and scars when we found it."},{"name":"ENION","text":"There was no telling when we'd find another, so we skinned it as best we could and came back."},{"name":"ATELLOUNE","text":"&lt;sigh&gt; I see... I appreciate your effort, but I'm afraid there's nothing we can do with a pelt in such poor condition."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We cannot let the bear's sacrifice be wasted."},{"name":"A1","text":"We can use it to make something else."},{"name":"ATELLOUNE","text":"If you believe you can make something of this pelt, then perhaps. The only question is what?"},{"name":"ENION","text":"...Miss Atelloune, <span class=\"highlight\">Forename</span>. Could we make it into clothing?"},{"name":"ENION","text":"Something I can wear as a reminder of the bear's sacrifice, and why we're working to make these animal mounts."},{"name":"ATELLOUNE","text":"An excellent idea, Number Seventy-One."},{"name":"ATELLOUNE","text":"Number Seventy-Two. I imagine working with a skin such as this will prove difficult, so I would suggest making something simple. A nice pair of gloves, perhaps? When you've finished give them to Number Seventy-One."},{"name":"ENION","text":"Don't worry, <span class=\"highlight\">Forename</span>. I'll explain what happened to Miss Atelloune."},{"name":"ENION","text":"I know the pelt was in rather poor shape, but I hope you can manage to make something of it."},{"name":"ENION","text":"Wow, you really did it!"},{"name":"ENION","text":"These gloves look amazing. I certainly hope they fit alright."},{"name":"ATELLOUNE","text":"Working bear skin into gloves is no easy feat, but their durability and resilience to cold makes it worth the effort."},{"name":"ATELLOUNE","text":"Why, you can scarcely even notice the material was tarnished prior to their making."},{"name":"ENION","text":"The leather is so smooth... It's like nothing ever happened."},{"name":"ENION","text":"Thank you so much, <span class=\"highlight\">Forename</span>. I'll cherish them always."},{"name":"ATELLOUNE","text":"You've done well, Number Seventy-Two. Though I wished to add a grizzly bear to our collection of animal mounts, I will not ask that you risk the dangers of Gyr Abania for another. Scarce as they are, I doubt you will find one."},{"name":"ATELLOUNE","text":"These gloves must serve as testament to the rarity of this poor creature now on the brink of extinction."},{"name":"ATELLOUNE","text":"But there are still myriad species in equally dire straits. It is up to us to make the realm aware of their struggles, and to preserve their grace and beauty for future generations."},{"name":"ATELLOUNE","text":"Indeed, our work is far from over. Until I have decided on our next subject for mounting, I pray you will use your time wisely and prepare."},{"name":"ATELLOUNE","text":"I take it work on the gloves is coming along nicely? I'm sure Number Seventy-One will be thrilled with what you give him."},{"name":"ATELLOUNE","text":"You require <span class=\"emphasis\">another</span> pelt? Honestly, have you forgotten how scarce those grizzly bears are?"},{"name":"ATELLOUNE","text":"Every skin─and life sacrificed in its procurement─is precious. You would do well not to waste this one."},{"name":"SYSTEM","text":"Through your deepening insight into the sanctity of life, you have learned “Manipulation”!"}],"reward":{"gil":2639,"action":4578,"items":[{"num":250,"id":11},{"id":19531},{"id":19633,"one":1},{"id":19634,"one":1},{"id":19635,"one":1},{"id":19636,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":13}],"quests":[68146]},"next":[68150]},"partials":[{"type":"npc","id":"1020940","obj":{"i":1020940,"n":"Atelloune","l":53,"q":4}},{"type":"npc","id":"1020941","obj":{"i":1020941,"n":"Enion","l":53,"q":2}},{"type":"npc","id":"1020942","obj":{"i":1020942,"n":"Enion","l":2406,"q":1}},{"type":"npc","id":"1020943","obj":{"i":1020943,"n":"Enion","l":2406,"q":1}},{"type":"npc","id":"1020944","obj":{"i":1020944,"n":"Enion","l":2406,"q":1}},{"type":"npc","id":"1021300","obj":{"i":1021300,"n":"Serpent Scout","l":2406,"q":1}},{"type":"npc","id":"1023895","obj":{"i":1023895,"n":"Enion","l":2406,"q":1}},{"type":"action","id":"4578","obj":{"i":4578,"n":"Manipulation","c":1985,"j":12,"t":7,"l":65}},{"type":"item","id":"19531","obj":{"i":19531,"n":"Doman Iron Head Knife","l":220,"c":35422,"t":20,"p":31363}},{"type":"item","id":"19633","obj":{"i":19633,"n":"Kudzu Robe of Crafting","l":220,"c":43812,"t":35,"p":28749}},{"type":"item","id":"19634","obj":{"i":19634,"n":"Durium Chaplets","l":220,"c":48275,"t":37,"p":17249}},{"type":"item","id":"19635","obj":{"i":19635,"n":"Kudzu Culottes of Crafting","l":220,"c":45973,"t":36,"p":28749}},{"type":"item","id":"19636","obj":{"i":19636,"n":"Tigerskin Boots of Crafting","l":220,"c":46760,"t":38,"p":17249}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17911","obj":{"i":17911,"n":"Velodyna Grizzly Bear Hide","l":276,"c":21820,"t":63}},{"type":"item","id":"17912","obj":{"i":17912,"n":"Grizzly Bear Gloves","l":276,"c":44439,"t":63}},{"type":"quest","id":"68146","obj":{"i":68146,"n":"Mounting Expectations","g":140,"l":"Gridania","s":630,"f":1}},{"type":"quest","id":"68150","obj":{"i":68150,"n":"The Trouble with Taxidermy","g":140,"l":"Gridania","s":680,"f":1}}]}