{"quest":{"name":"Flavors of the Far East","location":"Limsa Lominsa","id":68140,"patch":4.0,"sort":601,"icon":100692,"unlocksFunction":1,"eventIcon":71341,"issuer":1000947,"target":1020144,"involved":[1020143],"genre":143,"journal":["Lyngsath has a visitor he would like you to meet.","Lyngsath greets you with the news that someone has come calling who wishes to meet the guild's most decorated chef─your good self. Like you, the individual in question is an adventurer-cook, and owing to this he sees you as an inspiration. Take yourself to the Bismarck's dining area and seek out a man named Raulf.","Raulf tells you of his efforts at being an adventurer and culinarian both, but juggling two careers has led to lackluster results. Recognizing his limits, he has resolved to focus purely on the culinary arts and has taken up a post at Rowena's café. In order to distinguish himself in this crowded profession, he intends to incorporate Far Eastern dishes into the menu and cater to the local Doman population. However, he concedes that it is no easy task to master a foreign cuisine, and so he has come to you for aid. If you are willing to lend your expertise, take yourself to Revenant's Toll and seek out Raulf at Rowena's House of Splendors.","Raulf is ecstatic that you have agreed to help him. Using his connections, he will look into what the local Domans desire to eat. Until he identifies a likely dish to test out, continue applying yourself to your craft in readiness for venturing into the culinary unknown.<br><br>※The next culinarian quest will be available from Raulf upon reaching level 63."],"objectives":["Speak with Raulf.","Speak with Raulf at Revenant's Toll."],"dialogue":[{"name":"LYNGSATH","text":"Ah, good timin', <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. There's someone come callin' as wants to meet our most decorated chef.<br>...That's <span class=\"emphasis\">you</span>, ye daft sod."},{"name":"LYNGSATH","text":"Yer sickenin' modesty aside, yer visitor says 'e's an adventurer what took up cookin' on that side, not unlike yer good self. Owin' to that, 'e sees ye as somethin' of an inspiration."},{"name":"LYNGSATH","text":"Anyroad, be a dear an' go an' say 'ello, would ye? Ye'll find 'im out by the dinin' area, a brawny sort o' bloke name o' Raulf."},{"name":"LYNGSATH","text":"Yer visitor is out by the dinin' area, a brawny sort o' bloke name o' Raulf. Be a dear an' go an' say 'ello."},{"name":"RAULF","text":"By Rhalgr, it's really you! The famous <span class=\"highlight\">Forename Surname</span> in the flesh!"},{"name":"RAULF","text":"I first heard about you through your adventuring exploits, and I was already plenty impressed. But then I learned that you were a renowned culinarian besides, and I knew that I just had to meet you!"},{"name":"RAULF","text":"You see, for a time I was also trying to make my way as an adventurer and a culinarian both, but it soon became apparent that I was spreading my limited talent too thin."},{"name":"RAULF","text":"So I decided to kiss the adventuring life good-bye and took up a post at Miss Rowena's café at Revenant's Toll."},{"name":"RAULF","text":"The thing is, with or without distractions, it's not easy to succeed as a chef. It's a crowded profession, as I'm sure you can appreciate, and if I'm to make a name for myself, I can't be making what everyone else is making. Nay, I need to venture into unexplored territory."},{"name":"RAULF","text":"To that end, I came up with a brilliant idea. I'd incorporate Far Eastern dishes into our menu and cater to the Doman residents of Revenant's Toll! Promising, right? Right!"},{"name":"RAULF","text":"The thing is, brilliant idea or no, it's not easy to learn a foreign cuisine, and Far Eastern is just about as foreign as they come. It's plain I'm going to need help, and of the well-traveled sort. And so I decided to turn to the most accomplished adventuring culinarian I know─you, <span class=\"highlight\">Forename</span>."},{"name":"RAULF","text":"Now, I realize you're a busy <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> and we've only just met. If you say no, I won't think ill of you. But if you'd be so kind as to help out a brother, I'll be waiting for you at Revenant's Toll."},{"name":"LYNGSATH","text":"Bloke's fixin' to serve up Far Eastern dishes, is 'e? Reckon that's a fine opportunity fer ye to expand yer repertoire. If I was you, I'd lend this Raulf a hand."},{"name":"RAULF","text":"You...you came! I didn't have my hopes up, but you really came! To have the help of an accomplished culinarian like you is a dream come true. Thank the Twelve...and thank you."},{"name":"RAULF","text":"Without further ado, let's get right to the cooking! ...Is what I'd like to say, but I still need to decide on a Far Eastern dish to test out."},{"name":"RAULF","text":"If you could wait awhile, I'll look into what the Domans have a hankering for. I have connections so it shouldn't be difficult, but until we have the name of a dish, please feel free to go about your business."},{"name":"RAULF","text":"Again, allow me to thank you for your help, <span class=\"highlight\">Forename</span>. It's a great honor to be able to work with the only person in history to score a perfect ten in the Dellemont d'Or. Though I may not be in the same class as you─not even close─I promise to do the best I can and pull my weight!"},{"name":"SYSTEM","text":"The next culinarian quest will be available from Raulf upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":994,"items":[{"num":250,"id":8},{"num":3,"id":12667}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":16}],"questsType":"all","quests":[67583,67895]},"next":[68141]},"partials":[{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1020144","obj":{"i":1020144,"n":"Raulf","l":67,"q":5}},{"type":"npc","id":"1020143","obj":{"i":1020143,"n":"Raulf","l":28,"q":1}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"67583","obj":{"i":67583,"n":"The Spirit of Hospitality","g":143,"l":"Limsa Lominsa","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68141","obj":{"i":68141,"n":"Rice to the Occasion","g":143,"l":"Mor Dhona","s":630,"f":1}}]}