{"quest":{"name":"Teach a Man to Make Fish","location":"Mor Dhona","id":68143,"patch":4.0,"sort":680,"icon":100692,"unlocksFunction":1,"eventIcon":71341,"issuer":1020144,"target":1020161,"involved":[1018982,1020148,1020157,1020158,1020159,1020160],"genre":143,"usedItems":[17937,17938],"journal":["Raulf has the sheepish look of a man who is about to ask for a huge favor.","Having practiced until he could make udon to his satisfaction, Raulf now has his sights set on something called <span class=\"emphasis\">sushi</span>, which he describes as little mounds of rice topped with raw fish. Though it may sound simple, it is said to be an indulgence of the highest order and is nigh impossible to make without training under a proper master in Hingashi. As he is unable to abandon his job at the restaurant, Raulf begs you make the long journey in his stead to learn the basics of sushi-making. Set forth for the Hingan port of Kugane, and upon arrival seek out an inn called the Bokairo, where one of the realm's foremost sushi chefs is to be found.","At the Bokairo, Karaku informs you that their sushi chef, Shamoji, is currently out in the Ruby Sea gathering ingredients. As there is no telling when he might return, Karaku suggests you look for him in the waters near the Isle of Bekko.","Taking your search under the sea, you manage to locate Chef Shamoji. Alas, the haughty Kojin refuses to consider you for his apprentice, and warns you not to bother him again. Having come so far, however, it would not do to give up so easily. Follow Shamoji back to the Bokairo and try to convince him to give you a chance.","Your second attempt to speak with Shamoji gets off to a poor start, but by incredible luck, Dellemont chances to be at the Bokairo at the exact same moment. With his unreserved endorsement of your skills, Shamoji cannot help but agree to take you on as his apprentice. The lessons begin immediately, and before long you succeed in grasping the basics of sushi-making to a very impressed Shamoji. Hurry now back to Revenant's Toll and share your knowledge with Raulf.","Back at the Revenant's Toll, you share all you have learned of sushi-making with an eager Raulf. Wasting no time, he begins to prepare the dish for the local Domans, Anzu and her father included, and asks you to contribute one plate to the catering effort. Make the nigiri-zushi with the ingredients given to you and present it to Raulf.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Popin.","You deliver your plate of nigiri-zushi to Raulf, who has managed to finish his own portions. Follow Raulf out to the dining area on the terrace and prepare to receive your diners.","Unzan first turns his nose up at the Eorzean-made nigiri-zushi, but at his daughter's urging relents and gives it a chance. Though it comes with a caveat, he offers praise for your handiwork. And while Raulf's falls well short of impressing, his earnest effort is acknowledged, and he dares to hope that Unzan finally approves of him and Anzu. Alas, his hopes are swiftly crushed, for Unzan reveals his true reason for rejecting Raulf: his Ala Mhigan blood. Theirs is the proud blood of Yanxia, Unzan explains, and only a man of equally pure lineage is fit for his daughter. Dejected, Raulf decides to return to being an adventurer and walks off as Anzu looks on in dismay. With both her father and fiancée having left, it falls to you to reach out to her in this difficult moment.","Initially struck speechless in disbelief, Anzu chooses to believe in Raulf, saying that he must have reasons for his decision. She implores you to continue lending him your aid and directs you to the kitchen, where he is likely to be.","Though you find Raulf garbed in his adventuring attire, he declares that he hasn't given up on Anzu. Her father's statement that Far Eastern cuisine owes its greatness to its purity tugs at his mind, and he needs some time to ponder it. The odds are admittedly long, but Raulf believes that there is a chance he can make Unzan reconsider his stance. Whatever your friend may be planning, remain on hand that you might assist him should the need arise.<br><br>※The next culinarian quest will be available from Raulf upon reaching level 70."],"objectives":["Speak with Karaku in Kugane.","Look for Shamoji in the Ruby Sea.","Speak with Shamoji in Kugane.","Speak with Raulf at Revenant's Toll.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a plate of nigiri-zushi <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the nigiri-zushi <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Raulf</span></span>.","Speak with Raulf.","Speak with Anzu.","Speak with Raulf."],"dialogue":[{"name":"RAULF","text":"<span class=\"highlight\">Forename</span>, I'm glad to see you again. After Unzan tore my noodles to shreds, I went back and practiced until I could produce the “body” he said they were lacking."},{"name":"RAULF","text":"As for the broth, I made it again and again until I could create something to your standard, and reliably. With these two things perfected─by my definition, at any rate─I'm now offering udon on our menu."},{"name":"RAULF","text":"It was a lot of work, but it was well worth the effort, for the dish is proving popular not only among Domans, but adventurers as well!"},{"name":"RAULF","text":"But there's no time to be patting ourselves on the back. We've got more Far Eastern dishes to explore, and my sights are set on something called sushi: little mounds of rice topped with raw fish. Simple as it sounds, ask any Doman and they'll tell you it's an indulgence of the highest order."},{"name":"RAULF","text":"Not certain where to begin, I consulted Anzu, who told me that this dish is nigh impossible to make without training under an honest-to-gods master. This means a trip to Hingashi, where it originates."},{"name":"RAULF","text":"But as you know, I have a responsibility to the restaurant. Rowena would never permit me to leave long enough to make the journey."},{"name":"RAULF","text":"It pains me to ask such a big favor of you, but will you go to Hingashi in my stead and learn the basics of sushi-making?"},{"name":"Q1","text":"Journey to Hingashi to learn sushi-making?"},{"name":"RAULF","text":"I'm in your debt! I don't know what I would do without you, my friend!"},{"name":"RAULF","text":"Considering the distance, I suppose I shouldn't be surprised..."},{"name":"RAULF","text":"It's just...there's no one else I can turn to. Won't you reconsider?"},{"name":"RAULF","text":"I'm in your debt! I don't know what I would do without you, my friend!"},{"name":"RAULF","text":"Now, according to Anzu, one of the realm's foremost sushi chefs works in the port city of Kugane, at an inn called the Bokairo. You'd do well to seek out this inn."},{"name":"RAULF","text":"While you are abroad, I'll round up all the ingredients in preparation for your return. And with that, I bid you a safe journey!"},{"name":"RAULF","text":"One of the realm's foremost sushi chefs works at an inn called the Bokairo, in the port town of Kugane. When you arrive in town, you'd do well to seek out this inn. Safe travels, <span class=\"highlight\">Forename</span>!"},{"name":"KARAKU","text":"Come one, come all! Burns, cuts, embarrassing rashes─there is naught that the mystical waters of the Bokaisen Hot Springs cannot heal!"},{"name":"KARAKU","text":"Oh, you seek not healing, but a meeting with our sushi chef? Well, 'tis true that we're known no less for our waters than we are for our cuisine."},{"name":"KARAKU","text":"Our guests journey hither from far and wide to partake of the heavenly morsels prepared by Chef Shamoji. His dedication to his craft is such that he insists upon gathering the ingredients himself. As a matter of fact, that is what he is doing right this moment."},{"name":"KARAKU","text":"These outings usually keep him away for a good while, and I cannot rightly say when he might return. If you are in some hurry, you might consider searching for him out in the Ruby Sea."},{"name":"KARAKU","text":"He favors the waters near the Isle of Bekko for his fishing, and unique as his appearance is, you ought to find him without trouble. Assuming you are a strong swimmer, that is."},{"name":"KARAKU","text":"Chef Shamoji favors the waters near the Isle of Bekko for his fishing, and unique as his appearance is, you ought to find him without trouble. Assuming you are a strong swimmer, that is."},{"name":"KOJIN02607","text":"Gah, you just cost me a plump maguro! Whoever you are, this had better be good!"},{"name":"KOJIN02607","text":"Aye, I am Shamoji. Shelled or unshelled, there is nary a finer sushi chef in all the land."},{"name":"KOJIN02607","text":"Now, what business have you that you simply must disturb me at my fishing?"},{"name":"KOJIN02607","text":"You wish to learn sushi-making? I don't teach my craft to any small fry that comes swimming up, and you are as small as they come!"},{"name":"KOJIN02607","text":"Bah, but the fishing is bad this day! I shall return to the inn. Our business is over. Do not even think to follow me."},{"name":"KARAKU","text":"Well, I'll be... I did not expect you to actually dive in after Chef Shamoji. As you're aware by now, he is Kojin, but his hulking size belies a delicate touch. Each sushi born of his hands is a veritable work of art."},{"name":"KOJIN02607","text":"You again!? I thought I told you not to follow me! I am <span class=\"emphasis\">not</span> going to teach you my craft, so get you gone!"},{"name":"DELLEMMONT","text":"(-???-)Well, well, fancy seeing you here, <span class=\"highlight\">Forename</span>. Ah, the mere sight of you brings back the memory of your most succulent okeanis."},{"name":"DELLEMMONT","text":"I came to sample the Bokairo's famous sushi, but the chef was regrettably absent. Just as I was about to leave, however, who should I spy but you? And if I heard correctly, you are here to study sushi-making. Pleased am I to see that your hunger for learning remains voracious as ever."},{"name":"KOJIN02607","text":"M-Master Dellemont! Forgive me my absence! Give me but a moment, and I shall prepare the finest selection of sushi in the house!"},{"name":"DELLEMMONT","text":"Never mind that, my friend. Instead, I should be much obliged were you to initiate my dear <span class=\"highlight\">Forename</span> here into the ways of your craft. Should <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> qualifications be a concern, know that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> scored a perfect ten in my contest."},{"name":"KOJIN02607","text":"A p-p-perfect ten...in the Dellemont d'Or!? B-But that surpasses even..."},{"name":"KOJIN02607","text":"Very well! If you're good enough for Master Dellemont, then you're good enough for me!"},{"name":"DELLEMMONT","text":"Then it's settled. Happy learning, <span class=\"highlight\">Forename</span>. When next we meet, I look forward to sampling the Far Eastern fruits of your learning."},{"name":"KOJIN02607","text":"Come, then, apprentice! I shall pound the foundation of sushi-making into you!"},{"name":"KOJIN02607","text":"To master the basics in so short a time... Small wonder Master Dellemont approves of you."},{"name":"KOJIN02607","text":"More's the pity you are leaving so soon. A mere ten years under me and you could call yourself a master. But for now, I shall content myself in the knowledge that you will spread the joys of sushi to Eorzea. Farewell, apprentice!"},{"name":"KARAKU","text":"I am pleased to see you have acquired the basics of sushi-making, but such intense learning must have left you weary. May I suggest a rejuvenating soak in the mystical waters of the Bokaisen Hot Springs?"},{"name":"POPIN","text":"Raulf and I have procured all the ingredients needed to make nigiri-zushi, from the freshest seafood to the finest rice."},{"name":"RAULF","text":"<span class=\"highlight\">Forename</span>, welcome back! It's good to see you again, and wiser in the ways of sushi for your time in Hingashi. While you were away, we saw to procuring the finest ingredients available."},{"name":"RAULF","text":"Now, while the seafood is still fresh, you must impart to me all you've learned of sushi-making!"},{"name":"RAULF","text":"I see... You can't just slap raw fish on top of rice and call it sushi. Nay, you need to draw out the natural flavors of the ingredients and bring them together in a harmonious whole. Truly, Far Eastern cuisine is deceptive in its simplicity."},{"name":"RAULF","text":"Thanks for the detailed explanation, my friend. I'll try my hand at making sushi at once and have the local Domans sample it. And this time, I'll call for Anzu and her father as well."},{"name":"RAULF","text":"Unzan was an accomplished chef, and if my handiwork meets with his approval, then there's no doubting I'm on the right track. But to prepare so many portions on my first try is admittedly difficult..."},{"name":"RAULF","text":"I'm sorry, <span class=\"highlight\">Forename</span>, but will you help me out? A single serving would be enough. We have all the necessary ingredients right here."},{"name":"RAULF","text":"As always, if you need more of something, Popin can furnish you with it. And with that, let's both of us get to work!"},{"name":"POPIN","text":"Don't hesitate to let me know if you require more ingredients. We have both seafood and rice in plenty."},{"name":"POPIN","text":"Ah, so this is sushi. Quite a treat for the eyes, and doubtless for the taste buds as well. Do hurry and show it to Raulf."},{"name":"RAULF","text":"Bugger me, but sushi is tricky even with guidance... Are you done with yours, then?"},{"name":"RAULF","text":"Great! It took all my concentration and no less patience, but I've somehow managed to finish mine as well. If you could go on ahead to the terrace area, I'll go and inform our taste-testers that sushi is served."},{"name":"POPIN","text":"Sushi is quite a treat for the eyes, and doubtless for the taste buds as well. I must say, I'm rather looking forward to sampling it, but first come the Domans."},{"name":"RAULF","text":"Anzu and her father should be along any moment now. Gods, but this is nerve-racking..."},{"name":"UNZAN","text":"What is this? You expect me to partake of sushi made by an Eorzean?"},{"name":"ANZU","text":"Come now, Father, it looks delicious. Give it a chance and try it, at the very least."},{"name":"UNZAN","text":"<span class=\"highlight\">Forename</span>'s sushi is superb. To be sure, you still have years of training ahead of you before you can compare to the masters of our land, but to produce such quality in Eorzea is a praiseworthy accomplishment."},{"name":"UNZAN","text":"Raulf's, on the other hand─shoddy rubbish. It is sushi in naught but appearance, a pale imitation bereft of depth, unfit to be placed before a customer."},{"name":"UNZAN","text":"...But that is only natural. Short of having a kami-given gift, one cannot hope to make something so exacting as sushi to any satisfactory degree with naught but basic training."},{"name":"UNZAN","text":"You may not have the talent of <span class=\"highlight\">Forename</span>, but that is not a failing. Though your sushi is more akin to a humble rice ball, I can taste the effort that went into its making. For all its flaws, I do not mislike it."},{"name":"RAULF","text":"You...you approve of my sushi? Then me and Anzu..."},{"name":"UNZAN","text":"Never. You plainly misunderstand why I do not approve of you."},{"name":"UNZAN","text":"It has naught to do with your being a lowly adventurer nor a mediocre culinarian. Nay, it is because you are not one of us."},{"name":"UNZAN","text":"Ours is the blood of Yanxia, a proud line and pure. And only a man of equally pure lineage is fit for my only daughter. You are unfit, but it is through no fault of your own."},{"name":"UNZAN","text":"Consider Far Eastern cuisine. It owes its greatness to its purity─to the fact that it developed free of outside influence. So too do I wish it to be for my line. Surely you understand."},{"name":"ANZU","text":"Father! I can't believe what I'm hearing! If you'll not approve of us, then I'll have no part of your line!"},{"name":"RAULF","text":"I understand. I'll...I'll go back to being an adventurer."},{"name":"ANZU","text":"Raulf... No..."},{"name":"UNZAN","text":"Let him go, Anzu. It wasn't meant to be. I will give you some time alone."},{"name":"ANZU","text":"How could he give up so easily? On his cooking? On <span class=\"emphasis\">us</span>?"},{"name":"ANZU","text":"Nay, that is not the Raulf that I know. I believe in him. Whatever it is he means to do, he has his reasons, I am certain of it."},{"name":"ANZU","text":"I beg you, <span class=\"highlight\">Forename</span>, please lend him your aid as you have thus far. If you hurry, you may still find him in the kitchen."},{"name":"ANZU","text":"Please lend Raulf your aid. If you hurry, you may still find him in the kitchen."},{"name":"RAULF","text":"I have a habit of showing you my worst moments, don't I? As I said, I'm going back to being an adventurer, but know that I haven't given up on Anzu."},{"name":"RAULF","text":"Her father's claim about the purity of Far Eastern cuisine─something about it tugs at my mind, and I need some time to ponder it."},{"name":"RAULF","text":"It may be there's a chance I can make Unzan reconsider his stance. The odds are long, but I'm nothing if not persistent. And should the need arise, I hope that I can rely on your help again."}],"reward":{"gil":3795,"items":[{"num":250,"id":8},{"id":19566},{"id":5703,"one":1},{"id":5708,"one":1},{"id":5713,"one":1}],"xp":2902500},"reqs":{"jobs":[{"lvl":68,"id":16}],"quests":[68142]},"next":[68144]},"partials":[{"type":"npc","id":"1020144","obj":{"i":1020144,"n":"Raulf","l":67,"q":5}},{"type":"npc","id":"1020161","obj":{"i":1020161,"n":"Raulf","l":67,"q":2}},{"type":"npc","id":"1018982","obj":{"i":1018982,"n":"Karaku","l":2404,"q":4}},{"type":"npc","id":"1020148","obj":{"i":1020148,"n":"Popin","l":67,"q":4}},{"type":"npc","id":"1020157","obj":{"i":1020157,"n":"Shamoji","l":2409,"q":1}},{"type":"npc","id":"1020158","obj":{"i":1020158,"n":"Shamoji","l":2404,"q":1}},{"type":"npc","id":"1020159","obj":{"i":1020159,"n":"Anzu","l":67,"q":1}},{"type":"npc","id":"1020160","obj":{"i":1020160,"n":"Raulf","l":67,"q":1}},{"type":"item","id":"19566","obj":{"i":19566,"n":"Doman Steel Culinary Knife","l":260,"c":35762,"t":27,"p":37065}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"17937","obj":{"i":17937,"n":"Sushi Ingredients","l":285,"c":26109,"t":63}},{"type":"item","id":"17938","obj":{"i":17938,"n":"Nigiri-zushi","l":285,"c":53155,"t":63}},{"type":"quest","id":"68142","obj":{"i":68142,"n":"A Broth from the Brine","g":143,"l":"Mor Dhona","s":650,"f":1}},{"type":"quest","id":"68144","obj":{"i":68144,"n":"The Way to a Father's Heart","g":143,"l":"Mor Dhona","s":700,"f":1}}]}