{"quest":{"name":"The Way to a Father's Heart","location":"Mor Dhona","id":68144,"patch":4.0,"sort":700,"icon":100692,"unlocksFunction":1,"eventIcon":71341,"issuer":1020161,"target":1020144,"involved":[1020148,1020156,1020162,1020163,1020164,1020165,1020166,1020167,1020168,1020169,1020172],"genre":143,"usedItems":[17939,17940],"journal":["Raulf is deep in thought.","After pondering Unzan's words on the purity of Far Eastern cuisine at length, Raulf has identified the reason why the claim sits ill with him. He recounts to you the very first Far Eastern dish he ever had, which Anzu made for him: sukiyaki, a hearty dish of meat and vegetables simmered in a shallow pot. The taste of it unearthed long-buried memories of an identical stew from his childhood in Ala Mhigo, and he believes that there is a connection between the two. In order to verify his theory, Raulf sets forth for the village of Ala Ghiri in the Peaks region; join him there if you would help him in his quest.","Raulf is grateful for your continued cooperation. He bids you split up and ask the denizens of Ala Ghiri about the stew from his memory.","Your investigation has yielded a name: buckler stew. The dish apparently came into being when soldiers took to using their shields as pots, cooking meat in them with wine and various seasonings. Rejoin Raulf and share with him this momentous discovery.","Raulf is certain that buckler stew was the dish from his childhood, and all that remains is to establish a connection with sukiyaki. To this end, Raulf has tracked down an individual who is versed in history. Seek out this individual and ask him what he knows.","According to the Highlander historian, Ala Mhigo traded only as far as the Near East and had no direct dealings with Far Eastern states. However, Raulf is not ready to give up, and posits that Radz–at–Han may have been a waypoint for trade─and the dish. By a stroke of good fortune, it appears Ala Ghiri is home to a Hannish immigrant who came to Eorzea many years ago. Join Raulf as he searches for the elderly fellow outside the village.","In the course of your search, you hear an elderly man crying out for help. Make haste after Raulf in the direction of the voice.","You arrive at the scene to find Raulf spent but alive, Qiqirn bandits dead at his feet. The elderly fellow he saved turns out to be the Hannish immigrant, and as luck would have it, he is extremely fond of buckler stew. He confirms that the dish first came from Ala Mhigo to Radz–at–Han, and thence made its way to Doma, where it was reborn as sukiyaki. Raulf will remain in Ala Ghiri awhile to learn the recipe for buckler stew, and promises to meet you back at Revenant's Toll when he is done.","In a rare display of kindness from Rowena, Raulf has secured the use of his old kitchen for his bid to win Unzan over. For a final favor, he asks that you prepare a serving of Doman sukiyaki for him. Raulf's future with Anzu and as a culinarian both hang in the balance; see that you make the best example of the dish you are able.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Popin.","You present your Doman sukiyaki to Raulf just as he finishes making his buckler stew. The two dishes are placed before Unzan and Anzu, who are shocked to find that, despite their apparent differences, they taste almost identical. Raulf proceeds to explain how the Ala Mhigan buckler stew was reborn in Doma as sukiyaki, its arrival giving rise to new possibilities in Far Eastern cuisine. A moment passes in tense silence before Unzan invites Raulf to join the meal─as family should. At the conclusion of the happy gathering, Raulf offers you his heartfelt thanks for helping him to win over Unzan, with whose blessing he and Anzu will wed at the earliest opportunity. He then declares that he will hang up his adventurer's hat for good and resume his post at the café, serving Far Eastern dishes. As your brother culinarian finds his place, continue carving your own path and ever strive towards new horizons."],"objectives":["Speak with Raulf in Ala Ghiri.","Gather information in Ala Ghiri.","Report to Raulf.","Speak with the Highlander historian.","Rendezvous with Raulf in the Peaks.","Speak with Raulf in the Peaks.","Speak with Raulf at Revenant's Toll.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a serving of Doman sukiyaki <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the Doman sukiyaki <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Raulf</span></span>."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “The First of Many.”"},{"name":"RAULF","text":"You'll recall Unzan's words, about how Far Eastern cuisine developed without outside influence. From the moment he uttered them, they've been tugging at my mind."},{"name":"RAULF","text":"I've given the claim much thought, and I find myself disinclined to agree. And the basis for this is the very first Far Eastern dish I ever had, which Anzu made for me."},{"name":"RAULF","text":"<span class=\"emphasis\">Sukiyaki</span>, it's called, and it's a hearty dish of meat and vegetables simmered in a shallow pot. The moment I tasted it, I was overcome with a sense of nostalgia."},{"name":"RAULF","text":"Like many Ala Mhigans, I'm a war orphan. I left my homeland when I was little and remember nothing of my time there."},{"name":"RAULF","text":"Nothing at all...save for the taste of a certain hearty stew, and Anzu's sukiyaki was exactly like it!"},{"name":"RAULF","text":"The similarity can't be a mere coincidence. Nay, there has to be a connection between Far Eastern and Ala Mhigan cuisine. If I can just prove it, Anzu's father might be moved to reconsider our union. There's no guarantee, of course, but for my Anzu it's worth a try."},{"name":"RAULF","text":"Now, as you can see, I'm an adventurer again, free to go wherever I want, whenever I want. And I intend to go to a village in the Peaks called Ala Ghiri. In former times, it thrived as a trading hub with the East."},{"name":"RAULF","text":"There, I'm going to track down the stew of my memory and try to learn whether Ala Mhigo might have shared a culinary history with the Far East."},{"name":"RAULF","text":"You've already journeyed to the other side of the world for me, and I can't rightly ask any more of you. But if you're still willing to help me, then please come to Ala Ghiri."},{"name":"RAULF","text":"You came, thank the gods! I thought the fiends in the area were fierce, but the people here might be even fiercer..."},{"name":"RAULF","text":"But I'm ready to face them now that you're here. I can't thank you enough."},{"name":"RAULF","text":"Let's split up and ask the villagers about the stew. We'll meet again here when we're done."},{"name":"RAULF","text":"There's this stew I had a long time ago..."},{"name":"CITIZENA02608","text":"...Stew? Does it look like I know anythin' about swivin' stews? I just eat whatever the hells' put in front o' me!"},{"name":"CITIZENB02608","text":"Don't care much for stews, sorry. If you ask me, the only way to cook meat is to roast it to a crisp."},{"name":"CITIZENC02608","text":"Meat and vegetables simmered in a shallow pot... What you describe sounds a lot like buckler stew, a traditional Ala Mhigan dish."},{"name":"CITIZENC02608","text":"It was born when soldiers in the field took to using their bucklers in place of pots, cooking meat in them with wine and various seasonings. It was popular in the past, but under imperial rule it became a rare indulgence."},{"name":"CITIZENA02608","text":"...Stew? Does it look like I know anythin' about swivin' stews? I just eat whatever the hells' put in front o' me!"},{"name":"CITIZENB02608","text":"Don't care much for stews, sorry. If you ask me, the only way to cook meat is to roast it to a crisp."},{"name":"CITIZENC02608","text":"Meat and vegetables simmered in a shallow pot... What you describe sounds a lot like buckler stew, a traditional Ala Mhigan dish."},{"name":"CITIZENC02608","text":"It was born when soldiers in the field took to using their bucklers in place of pots, cooking meat in them with wine and various seasonings. It was popular in the past, but under imperial rule it became a rare indulgence."},{"name":"RAULF","text":"I had no luck, <span class=\"highlight\">Forename</span>. No one I spoke with knew anything about my stew."},{"name":"RAULF","text":"...Buckler stew! Yes, that was its name!"},{"name":"RAULF","text":"Damn, but even your investigative skills are first-rate. I'm happy to say, though, that my own inquiries weren't completely fruitless either. I managed to track down a fellow who's versed in history. Let's go and ask him what he knows about trade between Ala Mhigo and Doma."},{"name":"RAULF","text":"That's him, the fellow who's versed in history. Let's ask him what he knows about trade between Ala Mhigo and Doma."},{"name":"CITIZEND02608","text":"Aye, I do know some few things about our nation's history, owing to my time working at the Royal Palace. What is it that you wish to know?"},{"name":"CITIZEND02608","text":"Hm, 'tis true Ala Mhigo traded with nations to the east prior to imperial rule. But as far as I'm aware, this extended only as far as the <span class=\"emphasis\">Near</span> East, to Radz–at–Han."},{"name":"RAULF","text":"So...there was no contact between us and Doma? None at all?"},{"name":"RAULF","text":"No, even if it isn't direct, there has to be some sort of connection. For example, Radz–at–Han could've been a waypoint for the dish."},{"name":"RAULF","text":"But if I want to verify this, I'm going to have to go all the way over there..."},{"name":"CITIZEND02608","text":"Perhaps you needn't go so far, for there's a Hannish fellow among us who came to Eorzea years ago. You could try asking him first."},{"name":"CITIZEND02608","text":"I saw him heading outside the village a short while ago. Elderly as he is, he can't have gone far."},{"name":"RAULF","text":"Thank you! <span class=\"highlight\">Forename</span>, let's go and look for this man!"},{"name":"CITIZEND02608","text":"I suggest you try speaking with the Hannish fellow. He went outside the village a short while ago, but elderly as he is, he can't have gone far."},{"name":"RAULF","text":"Hmmm, there's no sign of him..."},{"name":"CITIZENE02608","text":"(-Elderly Voice-)Uwaaah! H-Heeelp! Somebody!"},{"name":"RAULF","text":"Oh, shite! He's in trouble!"},{"name":"CITIZENE02608","text":"M-My life flashed before my eyes..."},{"name":"RAULF","text":"&lt;pant&gt; Hehe, still got it... &lt;wheeze&gt; What little I had, at any rate..."},{"name":"RAULF","text":"&lt;pant&gt; Would've been a stroll through the woods for you...but I can't let you do all the work. You've done more than your fair share already."},{"name":"RAULF","text":"Besides...I wanted to show that I'm not completely hopeless."},{"name":"CITIZENE02608","text":"I owe you my life. I was so focused on my harvesting, I didn't notice the Qiqirn coming.<br>...You look a mite pale, lad. Are you hurt?"},{"name":"RAULF","text":"Just my bones...and organs... I'm already on the mend, I assure you... &lt;grunt&gt; "},{"name":"RAULF","text":"More importantly, I take it you're the gentleman who came from Radz–at–Han. I'm sorry if this seems sudden, but while you were still there, did you ever hear about a dish called buckler stew?"},{"name":"CITIZENE02608","text":"Hear about it? I <span class=\"emphasis\">love</span> the stuff! Ever since traders brought it over from Ala Mhigo, it's been an enduring favorite in my homeland. As a matter fact, it's the reason I came to be here...though I won't bore you with the details."},{"name":"RAULF","text":"So it was introduced to Radz–at–Han after all! Tell me, do you know if buckler stew also made its way to Doma?"},{"name":"CITIZENE02608","text":"That it did, and it's a tale all know well. A Doman merchant journeyed to Radz–at–Han to buy spices, you see, and chanced to sample the stew. It was love at first taste."},{"name":"CITIZENE02608","text":"So enamored was he of it, he decided to open a restaurant back at home and started buying up all the shallow pots he could find. Alas, these pots proved too heavy to take back, and he left them all at the pier and said that he'd make do with spades."},{"name":"RAULF","text":"Spades, you say!? The name sukiyaki can be translated as “spade grill,” and it's said to come from the fact that you grill the meat on a spade! Hah, I <span class=\"emphasis\">knew</span> there was a connection!"},{"name":"CITIZENE02608","text":"Sukiyaki, so that's what they call it. Well, by whatever name it's known, all this talk has given me a fierce hunger for it. There's naught for it but to make some right now."},{"name":"RAULF","text":"You're going to make buckler stew? Would you mind teaching me the recipe? And tell me more about its spread to the Far East?"},{"name":"CITIZENE02608","text":"Oho, you'd indulge this old man with your company? Well, if you insist, who am I to argue? Come along, then, and I'll tell you whatever you want to know."},{"name":"RAULF","text":"I can take it from here, <span class=\"highlight\">Forename</span>. Leave the learning to me."},{"name":"RAULF","text":"I'll join you back at Revenant's Toll when I'm done. Thanks again for all your help!"},{"name":"POPIN","text":"I've procured the ingredients Raulf requested for making sukiyaki─choice cuts of marbled beef along with a selection of Far Eastern condiments."},{"name":"RAULF","text":"Ah, <span class=\"highlight\">Forename</span>, perfect timing. I've just returned myself, with the recipe for buckler stew freshly etched into my noggin."},{"name":"RAULF","text":"I begged Miss Rowena for the use of my old kitchen, and surprisingly she allowed it, Twelve bless her. With that, I can set about making the buckler stew in order to win Anzu's father over."},{"name":"RAULF","text":"Here I have one last favor to ask of you, my friend. I need you to prepare a serving of Doman sukiyaki."},{"name":"RAULF","text":"It's a relatively simple affair─you take meat and vegetables and simmer them in a broth of dashi and Far Eastern condiments. Though I needn't remind you that Far Eastern cuisine can be deceptive in its simplicity. Anyway, here's all the ingredients you need, and Popin has more set aside."},{"name":"RAULF","text":"My future with Anzu and as a culinarian both ride on our success! Please make me the best Doman sukiyaki you can!"},{"name":"POPIN","text":"I have more sukiyaki ingredients in reserve should you require them─choice cuts of marbled beef along with a selection of Far Eastern condiments."},{"name":"POPIN","text":"Well, this sukiyaki certainly looks a heartwarming stew. Lest you wonder, Raulf is about done with his buckler stew as well, and there's no doubting the similarity!"},{"name":"RAULF","text":"Making the buckler stew is strangely comforting. The sight, the smell, even the sound─they take me back to bygone days... But to get back to the present day, how's the Doman sukiyaki coming along?"},{"name":"RAULF","text":"Well! A mere waft is enough to tell me this sukiyaki is in a class of its own. And my buckler stew is as ready as it'll ever be. Come, let's serve them to Anzu and her father on the terrace."},{"name":"UNZAN","text":"...Is this a joke? In our culture, sukiyaki is shared only between family and dear friends. You are neither. If you think this will win my favor, you are sadly mistaken."},{"name":"RAULF","text":"Now, now, please allow me to explain. <span class=\"highlight\">Forename</span> made the sukiyaki, while I made a different type of stew. Different, I say, however..."},{"name":"UNZAN","text":"What is this? It resembles sukiyaki, yet it appears not to be Far Eastern."},{"name":"RAULF","text":"That's because it's a traditional Ala Mhigan stew. If it please you, please sample and compare it with the sukiyaki."},{"name":"UNZAN","text":"An Ala Mhigan stew, you say? I know not what you are playing at, but─ &lt;slurp&gt; But the aroma is undeniably appetizing... Oh, very well..."},{"name":"UNZAN","text":"By the kami... Not only do they look alike...they also <span class=\"emphasis\">taste</span> alike! But the ingredients...they are different, are they not!?"},{"name":"ANZU","text":"You're right, Father! There may be subtle differences, but no matter how you look at it, this stew <span class=\"emphasis\">is</span> sukiyaki!"},{"name":"UNZAN","text":"What is the meaning of this? Did sukiyaki somehow find its way to Ala Mhigo?"},{"name":"RAULF","text":"No, Unzan-san, it's the opposite. It's the Ala Mhigan dish, buckler stew, that found its way to the Far East and eventually became sukiyaki."},{"name":"RAULF","text":"Though Ala Mhigo and Doma had no common history, they had a common trading partner in the Near East."},{"name":"RAULF","text":"Originating in my homeland, buckler stew first crossed the seas to Radz–at–Han. From there it crossed the seas once more to Doma, where it was recreated using local ingredients to become sukiyaki."},{"name":"RAULF","text":"It must be noted that this took place at a relatively recent period in Doma's long history. Up to that point, meat was predominantly grilled to harness their natural flavors, or minced and used in dumplings."},{"name":"RAULF","text":"While stews weren't uncommon, they were reserved mainly for seafood. But with sukiyaki's arrival, new possibilities blossomed for meat dishes."},{"name":"RAULF","text":"Father, you told me that Far Eastern cuisine owes its greatness to the fact that it developed free of outside influence. But it owes its greatness no less to what it adopted from other cultures."},{"name":"UNZAN","text":"...Why are you still standing there? Sit down and join us ere the food gets cold."},{"name":"RAULF","text":"I don't know how I'll ever repay you, <span class=\"highlight\">Forename</span>. Thanks to you, I've managed to do the impossible and win over Unzan. He finally approves of me and Anzu, and we plan to be bonded at the earliest opportunity. I'm going to resume my post at the café─serving Far Eastern dishes, of course─and hang up my adventurer's hat for good."},{"name":"RAULF","text":"I suppose you'll continue both adventuring and cooking, and I don't doubt you'll keep on succeeding at both. But no matter how high you climb or how far you roam, know that you're always welcome here!"},{"name":"SYSTEM","text":"In carving new paths into Far Eastern cuisine, you have learned “Stroke of Genius”!"}],"reward":{"items":[{"id":5703},{"id":5708},{"id":5713}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":16}],"quests":[68143]}},"partials":[{"type":"npc","id":"1020161","obj":{"i":1020161,"n":"Raulf","l":67,"q":2}},{"type":"npc","id":"1020144","obj":{"i":1020144,"n":"Raulf","l":67,"q":5}},{"type":"npc","id":"1020148","obj":{"i":1020148,"n":"Popin","l":67,"q":4}},{"type":"npc","id":"1020156","obj":{"i":1020156,"n":"Raulf","l":2407,"q":1}},{"type":"npc","id":"1020162","obj":{"i":1020162,"n":"Raulf","l":2407,"q":1}},{"type":"npc","id":"1020163","obj":{"i":1020163,"n":"Hardened Highlander","l":2407,"q":1}},{"type":"npc","id":"1020164","obj":{"i":1020164,"n":"Ill-mannered Miqo'te","l":2407,"q":1}},{"type":"npc","id":"1020165","obj":{"i":1020165,"n":"Cool-headed Highlander","l":2407,"q":1}},{"type":"npc","id":"1020166","obj":{"i":1020166,"n":"Raulf","l":2407,"q":1}},{"type":"npc","id":"1020167","obj":{"i":1020167,"n":"Highlander Historian","l":2407,"q":1}},{"type":"npc","id":"1020168","obj":{"i":1020168,"n":"Raulf","l":2407,"q":1}},{"type":"npc","id":"1020169","obj":{"i":1020169,"n":"Raulf","l":2407,"q":1}},{"type":"npc","id":"1020172","obj":{"i":1020172,"n":"Hannish Elder","l":2407,"q":1}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"17939","obj":{"i":17939,"n":"Sukiyaki Ingredients","l":290,"c":26109,"t":63}},{"type":"item","id":"17940","obj":{"i":17940,"n":"Doman Sukiyaki","l":290,"c":53066,"t":63}},{"type":"quest","id":"68143","obj":{"i":68143,"n":"Teach a Man to Make Fish","g":143,"l":"Mor Dhona","s":680,"f":1}}]}