{"quest":{"name":"A Broth from the Brine","location":"Mor Dhona","id":68142,"patch":4.0,"sort":650,"icon":100692,"unlocksFunction":1,"eventIcon":71341,"issuer":1020144,"target":1020144,"involved":[1000915,1000918,1000947,1012568,1020148,1020153,1020154,1020155],"genre":143,"usedItems":[17935,17936],"journal":["Raulf has caught the waft of a tasty rumor.","In the course of considering new Far Eastern dishes, Raulf has learned that elderly Domans often suffer from upset stomachs due to the rich and greasy foods that are common to Eorzea. For such complaints, nothing is better than <span class=\"emphasis\">udon</span>, a bowl of noodles in a light and warming broth, and Raulf has a mind to serve it up for the old ones. The broth is made by boiling dried fish, and it is decided that you will go to Limsa Lominsa to source the finest stuff available. Start by paying a visit to the Bismarck and consulting Lyngsath.","Lyngsath recommends you use authentic Far Eastern dried fish to make the udon broth. As luck would have it, a Kraken's Arms ship recently seized a merchantman in Far Eastern seas, and the ingredient you seek may well be among its cargo. Take your search to the Seventh Sage and ask Carvallain whether he has what you require.","To your delight, the seized ship was indeed carrying dried fish. But to your dismay, Carvallain deemed it worthless and tricked the Sanguine Sirens into taking it off his hands. Seek out Rhoswen at the Missing Member and hope the Twelve that she hasn't likewise cast it away.","In disgusted tones, Rhoswen confirms having accepted the dried fish from Carvallain. Raulf eagerly offers to buy it from her, but the Sirens captain informs him that she has ordered it all discarded. Just when it seems you must travel all the way to the Far East, Melkoko comes in with glad tidings: she has held on to the dried fish. Raulf volunteers to grab the stuff from the storehouse, and bids you join him back in his kitchen at Revenant's Toll.","Back at Revenant's Toll, you and Raulf set about making udon. While he prepares the noodles, he bids you boil the broth using the dried fish. See to your task and present the broth to Raulf when it is ready.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Popin.","You give the steaming broth to Raulf, who combines it with his noodles and serves up the udon to elderly Domans. Much to his relief, the dish is well received, but the triumph is short-lived, for Anzu's father, Unzan, arrives soon after and proceeds to heap scorn upon Raulf. Sampling the udon, Unzan awards your broth a passing grade, but tears Raulf's noodles apart while managing another disparaging comment at its maker, and takes his leave. Reach out to your brother culinarian to see how he fares after the unpleasant confrontation.","Raulf takes the opportunity to tell you all about the complication between him and Anzu. Her father refuses to accept a vagrant adventurer for a son-in-law, and so Raulf decided to give up the adventuring life in order to focus on cooking. The choice of Far Eastern cuisine, too, was for the sake of gaining approval, but therein lies a problem: Unzan himself is a chef of no small renown, who had his own prestigious restaurant back in Doma. But no matter the difficulties, Raulf is determined to succeed as a culinarian and win Unzan over, and he expresses his hopes that he can continue depending on your help.<br><br>※The next culinarian quest will be available from Raulf upon reaching level 68."],"objectives":["Speak with Lyngsath at the Culinarians' Guild.","Speak with Carvallain.","Speak with Rhoswen.","Speak with Raulf at Revenant's Toll.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a bowl of Doman udon broth <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the Doman udon broth <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Raulf</span></span>.","Speak with Raulf."],"dialogue":[{"name":"RAULF","text":"<span class=\"highlight\">Forename</span>, how are you? Since we began serving rice balls, I'm pleased to say they've been fairly flying out of the kitchen. The Domans can't get enough of them, and it's all thanks to you."},{"name":"RAULF","text":"Of course, it was never my intent to rest on these laurels. I've been exploring new Far Eastern dishes, in the course of which I caught wind of a common complaint among elderly Domans. It seems the rich and greasy foods found in Eorzea tend to wreak havoc on their stomachs."},{"name":"RAULF","text":"For such complaints, I'm told a dish called udon is just what the healer's ordered. It's a bowl of noodles in a light and warming broth that's easy going down, and I'd like to try serving it up for the old ones."},{"name":"RAULF","text":"The key to the dish is the broth, called <span class=\"emphasis\">dashi</span>, which as far as I can decipher means “exit juice.” I'm, er, sure it sounds more appetizing in the Doman tongue. The peculiarities of language aside, dashi is made by boiling dried fish, and it's supposed to be the base for many Far Eastern dishes."},{"name":"RAULF","text":"Now, last time I learned all about the importance of respecting ingredients and letting them shine. With that in mind, I want to source the best dried fish possible...which means we're going to Limsa Lominsa!"},{"name":"RAULF","text":"When we arrive, let's first visit the Bismarck and consult Guildmaster Lyngsath. He'll know where to point us."},{"name":"RAULF","text":"Right, let's consult Guildmaster Lyngsath on where best to procure the dried fish."},{"name":"LYNGSATH","text":"Dried fish to make broth fer a Far Eastern dish, ye say? Then yer best bet be usin' the authentic stuff."},{"name":"LYNGSATH","text":"Jus' so 'appens a Krakens ship recently seized itself an imperial merchantman way out east, one what was carryin' all sorts of exotic goods. Might be as the kind o' dried fish yer after's among 'em."},{"name":"LYNGSATH","text":"If that's the case, reckon Carvallain would be willin' to cut ye a deal. Why don't ye go an' 'ave a chat with the bloke?"},{"name":"RAULF","text":"Right then, let's go to the Seventh Sage."},{"name":"LYNGSATH","text":"As I 'ear it, business's been boomin' at Raulf's café since 'e started servin' up Far Eastern eats, an' I 'ave a 'unch I know who's to thank fer that. We'll 'ave to pull our socks up over 'ere, too, else we're liable to get upstaged!"},{"name":"RAULF","text":"I hope Carvallain's got what we need..."},{"name":"CARVALLAIN","text":"...The ship we seized? Aye, as a matter of fact, it was carrying some unusual cargo, among which I seem to recall some manner of dried fish."},{"name":"CARVALLAIN","text":"Seemed not like to fetch any coin, however, so we off-loaded it in order to free up the hold for more valuable plunder. The <span class=\"emphasis\">Lady Infernal</span> happened to pass by, so we made a gift of it to the Sanguine Sirens."},{"name":"CARVALLAIN","text":"The undiscerning fools that they are, they accepted it without question. So if you want your fish, you'll need to speak with their captain, the ever uncouth Rhoswen."},{"name":"RAULF","text":"Well, looks like it's off to the Missing Member for us."},{"name":"CARVALLAIN","text":"Never did Rhoswen and her crew suspect that they were being used like a refuse heap. Such fatuity beggars belief."},{"name":"MELKOKO","text":"Oh, <span class=\"highlight\">Forename</span>, lovely to see you! A big, brawny bloke just went into the restaurant. An acquaintance of yours, is he?"},{"name":"RAULF","text":"Third time's the charm, isn't that right?"},{"name":"RHOSWEN","text":"Aye, ye 'eard right, Carvallain gave us foodstuff from a ship 'e seized. “Far Eastern delicacy worth its weight in gold,” 'e said."},{"name":"RHOSWEN","text":"But what do I find when I pry open the crates but fish what's dried up 'arder than a plank!? I should've known better'n to trust that lyin' whoreson!"},{"name":"RAULF","text":"That's it─the fish we're after! The Domans call it <span class=\"emphasis\">katsuobushi</span>, and you boil shaved strips of it to get broth!"},{"name":"RAULF","text":"Will you sell it to us, Captain?"},{"name":"RHOSWEN","text":"Sell it to ye? Can't well sell what I don't 'ave, now can I? Worthless as it looked, I 'ad me girls throw it overboard. But now I find meself regrettin' it. I should've 'eld on to the fish so I could shove 'em up Carvallain's arse─see 'ow 'e enjoys 'is “Far Eastern delicacy”!"},{"name":"RAULF","text":"Looks like there's nothing for it but to go to the Far East. But what am I going to do about the café? I can't leave it unattended..."},{"name":"MELKOKO","text":"Excuse me, <span class=\"highlight\">Forename</span>. As usual, I couldn't help but overhear the captain's impassioned rants, and I'm happy to say I have the dried fish in our storehouse."},{"name":"MELKOKO","text":"Mhasi-Bee─he hardly ever comes to visit, you see, so I adopted a little kitty to remind me of him. And it just so happens he loves dried fish more than anything else."},{"name":"MELKOKO","text":"I've since discovered that a cat is far better company than some self-centered piece o' turd who ain't never around! ...A-Ahem. What were we talking about now?"},{"name":"MELKOKO","text":"Right, dried fish! Any friend of <span class=\"highlight\">Forename</span>'s is a friend of mine, and you are welcome to as much of it as you need. Please help yourself."},{"name":"RAULF","text":"Really!? I'm in your debt! <span class=\"highlight\">Forename</span>, I'll go and grab the fish. See you back at Revenant's Toll!"},{"name":"MELKOKO","text":"Such dedication to his craft. Why, it's as if there's more that's driving him than the cooking alone. As if there's...love? Just a woman's intuition, tee hee!"},{"name":"RHOSWEN","text":"Once I start imaginin' the painful things I'd do to Carvallain, it's 'ard to stop."},{"name":"MELKOKO","text":"Your friend is most dedicated to his craft. Why, it's as if there's more that's driving him than the cooking alone. As if there's...love? Just a woman's intuition, tee hee!"},{"name":"POPIN","text":"Raulf brought back a goodly supply of the fish─katsuobushi, you call it? Of all the dried foods I've handled, I daresay this is the driest of them all. I struggle to imagine how one might extract broth from it."},{"name":"RAULF","text":"Right, let's get to work on the udon. <span class=\"highlight\">Forename</span>, I'd like you to take shavings from the katsuobushi and boil it to make the broth."},{"name":"RAULF","text":"Meanwhile, I'll see to the noodles. It's supposed to be hard, physical work, but I'm nothing if not strong."},{"name":"RAULF","text":"Popin has more ingredients in reserve, so let him know if you need anything. Shall we, then?"},{"name":"POPIN","text":"Please don't hesitate to let me know if you need more ingredients. Raulf brought back a goodly supply of the fish─katsuobushi, you call it?"},{"name":"POPIN","text":"My, what an enticing aroma! You must give the broth to Raulf while it's still hot!"},{"name":"RAULF","text":"The noodles are just about done. How's the broth coming along?"},{"name":"RAULF","text":"Wonderful! All that's left is to combine the two, and the udon will be ready! I'll have the elderly Domans come over to sample it right away."},{"name":"REFUGEEA02606","text":"Ahhh, that was a tasty bowl of udon. The broth was good to the last drop, and light and gentle as it was, I daresay it'll be good all the way through me. Heh heh heh!"},{"name":"REFUGEEB02606","text":"I didn't think I'd get to eat udon again before I died. Brings a tear to my eye. &lt;sniff&gt; Thank you, young ones. Thank you."},{"name":"RAULF","text":"I reckon we can call that a great success! Now I can offer udon on the menu with confidence!"},{"name":"UNZAN","text":"(-???-)Well, well. I had heard that an Eorzean had taken to serving Far Eastern cuisine. To think that it was you."},{"name":"RAULF","text":"F-Father!"},{"name":"UNZAN","text":"(-Imposing Man-)You will not call me that! You are no son to me! I will not give my precious daughter to some vagabond!"},{"name":"RAULF","text":"B-But I've given up adventuring. This is what I do now─all that I intend to do. A-And I'm learning how to make Far Eastern cuisine for the Doman people."},{"name":"UNZAN","text":"(-Imposing Man-)An ignoble adventurer making our noble cuisine? I would be laughing were the idea not so absurd!"},{"name":"RAULF","text":"Before you pass judgment, please sample my udon, Fath─er...I mean, Unzan-san. I made it together with my fellow adventurer here."},{"name":"UNZAN","text":"Hmph. Doubtless it will be just a rude bastardization."},{"name":"UNZAN","text":"Considering that it was made by an outsider, the broth is respectable. The flavors are well balanced, and 'tis plain care was taken in the boiling."},{"name":"UNZAN","text":"The noodles, on the other hand─soggy rubbish! There is no body to them at all! They are soft and spineless─the very personification of their maker! You're worth little as an adventurer and even less as a culinarian!"},{"name":"RAULF","text":"I'm sorry you had to see that, <span class=\"highlight\">Forename</span>. But at least now you know what the complication is."},{"name":"RAULF","text":"Anzu's father, Unzan... He's as traditional as they come, and refuses to accept a vagrant adventurer like me for a son-in-law. It was to gain his approval that I gave up the adventuring life to focus on cooking Far Eastern cuisine."},{"name":"RAULF","text":"The problem is Unzan himself is a chef of no small renown, who had his own prestigious restaurant in Doma. From the first, I knew it wouldn't be easy to impress him, but to be on the receiving end of such scorn is disheartening to say the least."},{"name":"RAULF","text":"In the end, though, he spoke the truth. I'm not worth a damn as neither adventurer or culinarian. A far cry from you, <span class=\"highlight\">Forename</span>."},{"name":"RAULF","text":"Even so, I won't let it end like this. I won't give up. No matter what it takes, I will succeed as a culinarian and make Unzan approve of me!"},{"name":"RAULF","text":"I'm sorry I kept all this from you. But though my motives aren't as I first said, it doesn't change what we seek to do, and I hope I can keep depending on your help."},{"name":"SYSTEM","text":"In tasting new experiences as a culinarian, you have learned “Manipulation”!"}],"reward":{"gil":1882,"action":4581,"items":[{"num":250,"id":8},{"id":19534},{"id":19633,"one":1},{"id":19634,"one":1},{"id":19635,"one":1},{"id":19636,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":16}],"quests":[68141]},"next":[68143]},"partials":[{"type":"npc","id":"1020144","obj":{"i":1020144,"n":"Raulf","l":67,"q":5}},{"type":"npc","id":"1000915","obj":{"i":1000915,"n":"Carvallain","l":28,"q":6}},{"type":"npc","id":"1000918","obj":{"i":1000918,"n":"Rhoswen","l":28,"q":4}},{"type":"npc","id":"1000947","obj":{"i":1000947,"n":"Lyngsath","l":28,"q":22,"t":"Guildmaster"}},{"type":"npc","id":"1012568","obj":{"i":1012568,"n":"Melkoko","l":28,"q":6}},{"type":"npc","id":"1020148","obj":{"i":1020148,"n":"Popin","l":67,"q":4}},{"type":"npc","id":"1020153","obj":{"i":1020153,"n":"Raulf","l":28,"q":1}},{"type":"npc","id":"1020154","obj":{"i":1020154,"n":"Raulf","l":28,"q":1}},{"type":"npc","id":"1020155","obj":{"i":1020155,"n":"Raulf","l":28,"q":1}},{"type":"action","id":"4581","obj":{"i":4581,"n":"Manipulation","c":1985,"j":15,"t":7,"l":65}},{"type":"item","id":"19534","obj":{"i":19534,"n":"Doman Iron Frypan","l":220,"c":35725,"t":26,"p":31363}},{"type":"item","id":"19633","obj":{"i":19633,"n":"Kudzu Robe of Crafting","l":220,"c":43812,"t":35,"p":28749}},{"type":"item","id":"19634","obj":{"i":19634,"n":"Durium Chaplets","l":220,"c":48275,"t":37,"p":17249}},{"type":"item","id":"19635","obj":{"i":19635,"n":"Kudzu Culottes of Crafting","l":220,"c":45973,"t":36,"p":28749}},{"type":"item","id":"19636","obj":{"i":19636,"n":"Tigerskin Boots of Crafting","l":220,"c":46760,"t":38,"p":17249}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17935","obj":{"i":17935,"n":"Broth Ingredients","l":276,"c":22418,"t":63}},{"type":"item","id":"17936","obj":{"i":17936,"n":"Doman Udon Broth","l":276,"c":25055,"t":63}},{"type":"quest","id":"68141","obj":{"i":68141,"n":"Rice to the Occasion","g":143,"l":"Mor Dhona","s":630,"f":1}},{"type":"quest","id":"68143","obj":{"i":68143,"n":"Teach a Man to Make Fish","g":143,"l":"Mor Dhona","s":680,"f":1}}]}