{"quest":{"name":"A Taxing Request","location":"Gridania","id":68145,"patch":4.0,"sort":601,"icon":100689,"unlocksFunction":1,"eventIcon":71341,"issuer":1000691,"target":1020929,"involved":[1020930,1020931],"genre":140,"journal":["Guildmaster Geva is surprised yet glad for your unexpected visit.","Guildmaster Geva has received an unusual request which requires skills far beyond the undistinguished leatherworkers currently in her employ. Certain you would not balk from a challenge, she asks that you make for the Shaded Bower and speak with one Miss Atelloune.","Atelloune, world-renowned naturalist and co-author of <span class=\"emphasis\">New Eorzean Geographic</span>, has put aside work on her publication to fashion mounted animals to preserve endangered species, and has given you the privilege of being her seventy-second assistant. Your first task is to introduce yourself to her seventy-first assistant, Enion, who is waiting for you at the Carline Canopy.","Enion seems both excited and oddly relieved to see you. As he tells it, he took to working on mounted animals as a hobby, but soon found himself in service to Atelloune who greatly overestimates his abilities. He is hopeful your leatherworking prowess will make up for his ineptitude for working animal hides. Aware of the hour, he bolts off back to the Shaded Bower, lest he incur Atelloune's anger. It may be in your best interest to follow his example.","You arrive back at the Shaded Bower in a timely manner, though Atelloune would argue to the contrary. More importantly, she is satisfied to have at last found two artisans to complement one another for the task at hand─one inexperienced in working leather, the other untrained in preparing animal mounts. Ready your awl, for there will be much to do once preparations are complete.<br><br>※The next leatherworker quest will be available from Atelloune upon reaching level 63."],"objectives":["Speak with Atelloune at the Shaded Bower.","Speak with Enion at the Carline Canopy.","Speak with Atelloune at the Shaded Bower."],"dialogue":[{"name":"GEVA","text":"Well, if it isn't my favorite leatherworker. I was certain you'd be too busy selling to lords and ladies in Ishgard to ever come visit."},{"name":"GEVA","text":"But you've come at a good time. I have need of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> with your talents."},{"name":"GEVA","text":"We recently received a rather unusual request for a leatherworker. I wouldn't dare entrust it to the others, and I'm much too busy. If you've time to come visit, then I'm sure you can fit this into your schedule."},{"name":"GEVA","text":"Head down to the Shaded Bower and have a talk with Atelloune. Tell her I sent you, and she'll explain everything."},{"name":"ATELLOUNE","text":"Hm? <span class=\"highlight\">Forename Surname</span> of the Leatherworkers' Guild? Ah, yes. Geva has told me about you. A darling protégé who's gained some small bit of fame for services rendered here in Gridania and Ishgard."},{"name":"ATELLOUNE","text":"Well, your honors and accolades mean naught to Eorzea's premier naturalist Atelloune. Henceforth, I, and I alone, shall be the judge of your worth."},{"name":"ATELLOUNE","text":"You should be happy─proud, even─to assist me with my noble works. 'Tis not often one has the opportunity to serve as my <span class=\"alternative-container\"><span class=\"alternative\">lady-in-wai─</span><span class=\"alternative\">manserv─</span></span>ahem, my dutiful apprentice."},{"name":"ATELLOUNE","text":"Daunted by my celebrity, I see. Worry not. Under my careful guidance, your skills will be put to good use. This, I can assure you."},{"name":"ATELLOUNE","text":"Until now I have been collaborating with my first assistant, Marcette, to write articles for the <span class=\"emphasis\">New Eorzea Geographic</span>. Though I would love to continue with my writings, a duty of much greater importance has drawn my attention."},{"name":"ATELLOUNE","text":"In my research of the Calamity's effects on the environment, it has become clear that the abnormal rate at which the realm is changing far outstrips the pace of animal adaptation."},{"name":"ATELLOUNE","text":"Indeed, I fear certain species now face extinction. And what manner of naturalist would I be if I did not do all in my power to save them?"},{"name":"ATELLOUNE","text":"Alas, time is not on our side. Which is why, in the event I am not able to save these humble creatures, I would preserve them through taxidermy, that future generations may still gaze upon their splendor."},{"name":"ATELLOUNE","text":"That is why I conferred with Guildmaster Geva, and why you now stand before me. "},{"name":"ATELLOUNE","text":"If you believe yourself capable of the task at hand, I shall make you my seventy-second assistant. What say you?"},{"name":"ATELLOUNE","text":"Hmmm, confidence. Good. In time I will know if there is any talent to match."},{"name":"ATELLOUNE","text":"In any case, your contributions will not go unrecognized: you shall be duly credited in my next publication of <span class=\"emphasis\">New Eorzean Geographic</span>─as “et cetera.”"},{"name":"ATELLOUNE","text":"Now, your first task shall be a simple one─speak with research assistant seventy-one, Enion, at the Carline Canopy. ...Well, what are you waiting for?"},{"name":"GEVA","text":"Much like her work, Atelloune can be quite demanding at times. A good first impression may find you in her good graces. Best not keep her waiting."},{"name":"ENION","text":"Oh! Are you the leatherworker Miss Atelloune coerc─I mean, hired to help with the mounting?"},{"name":"ENION","text":"You volunteered!? I mean, working under her isn't unpleasant, mind you. It's just...well..."},{"name":"ENION","text":"Oh, who am I kidding? She calls us assistants, but I know the truth: we're just a bunch of servants to her."},{"name":"ENION","text":"My name's Enion, by the way. “Number Seventy-One, the taxidermist” she calls me. To be honest, it's just a hobby, but she won't listen... &lt;sigh&gt; She never listens."},{"name":"ENION","text":"It's sad when animals die, you know? But when I mount them, it's like they never really left. So I practice every chance I get to make the best mounts I can."},{"name":"ENION","text":"I'm no good at preparing skins, though. They're always so unsightly and misshapen when I've finished. Working with an honest-to-gods leatherworker like yourself, I bet they'll look so real, folks will swear they're still breathing!"},{"name":"ENION","text":"I should probably be heading back, or else I'll upset Miss Atelloune again... Anyway, it was nice meeting you."},{"name":"ATELLOUNE","text":"Surely you know where the Carline Canopy is? Hurry along, now. He will be expecting you."},{"name":"ATELLOUNE","text":"There you are! Honestly, did you get lost on the way back here? My time is quite precious, you know. Though I suppose it is important for peers to establish amicable relations. I forgive you...this time."},{"name":"ATELLOUNE","text":"Now that we have dealt with the formalities, our team is assembled. The fledgling young taxidermist who knows naught of leatherworking, and the leatherworker who likewise knows naught of taxidermy─two halves that shall make a lovely whole."},{"name":"ATELLOUNE","text":"Under my sage guidance, the two of you shall make displays unlike anything the realm has ever seen. Yes, lifelike displays that will preserve the beauty of the realm's blessed creatures now and forevermore!"},{"name":"ATELLOUNE","text":"Future generations will look upon our mounts and envy the age when these animals proudly walked the earth."},{"name":"ATELLOUNE","text":"But first, I must prepare! Selecting animals for mounting, finding an ideal venue─there is much to be done. "},{"name":"ATELLOUNE","text":"I trust you will make good use of this time to hone your skills."},{"name":"SYSTEM","text":"The next leatherworker quest will be available from Atelloune upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."},{"name":"ENION","text":"Thanks for agreeing to work with us. If you had decided to leave, she'd...she'd... Well, I guess it doesn't matter now."}],"reward":{"gil":615,"items":[{"num":250,"id":11},{"num":3,"id":12667}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":13}],"questsType":"all","quests":[67615,67895]},"next":[68146]},"partials":[{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1020929","obj":{"i":1020929,"n":"Atelloune","l":53,"q":2}},{"type":"npc","id":"1020930","obj":{"i":1020930,"n":"Enion","l":52,"q":1}},{"type":"npc","id":"1020931","obj":{"i":1020931,"n":"Enion","l":53,"q":2}},{"type":"item","id":"12667","obj":{"i":12667,"n":"Commercial Engineering Manual","l":1,"c":26153,"t":63}},{"type":"quest","id":"67615","obj":{"i":67615,"n":"A Winter's Sale","g":140,"l":"Ishgard","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68146","obj":{"i":68146,"n":"Mounting Expectations","g":140,"l":"Gridania","s":630,"f":1}}]}