{"quest":{"name":"Rice to the Occasion","location":"Mor Dhona","id":68141,"patch":4.0,"sort":630,"icon":100692,"unlocksFunction":1,"eventIcon":71341,"issuer":1020144,"target":1020144,"involved":[1020145,1020146,1020147,1020148,1020149,1020150,1020151,1020152],"genre":143,"usedItems":[17933,17934],"journal":["Raulf has the look of a man for whom things didn't go as planned.","Since you last spoke, Raulf has learned that the local Domans are sick unto death of bread and want to eat nothing more than rice balls. Simple as the dish seemed, Raulf tried making it himself, but the Domans were less than impressed with the results. Polite a people as they are, however, they will not tell him straight what he did wrong, and it falls to you to seek them out in town and ask their honest opinion.","It appears that Raulf cooked the rice with too much water and then squeezed and seasoned the balls too strongly. Return to the kitchen inside Rowena's House of Splendors and relay the information to him.","Raulf listens intently as you share the Domans' critique of his rice balls. Believing that you will do a better job, he asks you to try your hand next. Prepare your finest set of Doman rice balls and bring it outside for Raulf to hand out to the gathered Domans.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Popin.","Your rice balls meet with the Domans' resounding approval, and trying a bite himself, Raulf discovers what the fuss is about. As he marvels at how you harnessed the best qualities of rice, a Doman woman named Anzu appears and affirms that such is spirit of Far Eastern cuisine: to respect each ingredient and allow it to shine. Her sudden arrival causes Raulf to break out in panic, and she soon takes her leave, satisfied that he is in good hands. Join Raulf back in the kitchen to discuss the next step in your endeavor.","With your rice balls a success, Raulf declares that he will begin serving them at the café. Before you part ways, he confides that Anzu is in fact his fiancée, but there appears to be some manner of complication that he is not ready to reveal. For now, remain focused on the task at hand and be ready to assist Raulf again when he moves to the next stage of his culinary endeavors.<br><br>※The next culinarian quest will be available from Raulf upon reaching level 65."],"objectives":["Gather information from Domans.","Report to Raulf.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a set of Doman rice balls <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the Doman rice balls <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Raulf</span></span>.","Speak with Raulf."],"dialogue":[{"name":"RAULF","text":"<span class=\"highlight\">Forename</span>, good to see you again. Since last we spoke, I've managed to learn a little about the local Domans' culinary preferences."},{"name":"RAULF","text":"Pretty much all of them are sick unto death of bread in their lunches, and they miss nothing more than rice, the staple of their homeland. In particular, they want to eat the steamed stuff made into convenient balls. The Doman name is <span class=\"emphasis\">onigiri</span>, which I'm told roughly translates to “honorably squeezed.”"},{"name":"RAULF","text":"Well, if it's just a matter of squeezing honorably, I thought I didn't need to trouble you. As a matter of fact, I've already tried my hand at it, using rice supplied by an adventurer friend. Was quite pleased with the results, too, but then I gave it to the Domans...and let's just say their opinion of it wasn't as high as my own."},{"name":"RAULF","text":"I don't know what I did wrong; I made the rice balls exactly as described, but there must be more to it than meets the eye. One thing's certain, though: if I can't squeeze a decent ball of rice, I don't have a future in Far Eastern cuisine."},{"name":"RAULF","text":"Here's where I need your help, <span class=\"highlight\">Forename</span>. Polite a people as they are, the Domans won't give it to me straight what was wrong with my rice balls. Do you think you could go and ask them in my stead?"},{"name":"RAULF","text":"Polite a people as they are, the Domans won't give it to me straight what was wrong with my rice balls. Do you think you could go and ask them in my stead?"},{"name":"REFUGEEC02605","text":"The strapping gentleman's rice balls? While he was kind to make them for us, he needs to show the same kindness to the rice. He squeezed his balls with such force, the texture was fairly crushed out of each grain."},{"name":"REFUGEEA02605","text":"Hm? You wish to know what was wrong with the rice balls? Well, there I was expecting the taste of home, but it turned out to be utterly foreign. Whatever seasoning was used, it completely masked the natural taste of rice. Not to sound ungrateful, of course..."},{"name":"REFUGEEB02605","text":"Ah, yes, Master Raulf's rice balls. 'Twas not a terrible first effort, but if I may offer some advice, he would do well to use less water in the cooking. And in the shaping, imagine that he is grasping not only grains of rice, but air as well."},{"name":"REFUGEEC02605","text":"The strapping gentleman's rice balls? While he was kind to make them for us, he needs to show the same kindness to the rice. He squeezed his balls with such force, the texture was fairly crushed out of each grain."},{"name":"REFUGEEA02605","text":"Hm? You wish to know what was wrong with the rice balls? Well, there I was expecting the taste of home, but it turned out to be utterly foreign. Whatever seasoning was used, it completely masked the natural taste of rice. Not to sound ungrateful, of course."},{"name":"REFUGEEB02605","text":"Master Raulf's rice balls was not a terrible first effort, but if I may offer some advice, he would do well to use less water in the steaming. And in the shaping, imagine that he is grasping not only grains of rice, but air as well."},{"name":"POPIN","text":"Well met, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Popin's my name, and I have charge over our stores."},{"name":"RAULF","text":"I'll be damned... I assumed you squeezed in order to keep the grains together, but it's plainly not that simple. Nor is it enough to simply cook the rice─you need just the right amount of water."},{"name":"RAULF","text":"As for the taste, I thought that salt alone was dull, so I came up with the brilliant idea of adding a hint of─wait for it─<span class=\"emphasis\">Far Eastern seasoning</span>. To have it called foreign is salt in the wound, pardon the pun."},{"name":"RAULF","text":"Well, it seems I got just about everything wrong, but I daresay you'll fare better, <span class=\"highlight\">Forename</span>. While the comments are still fresh in your mind, do you think you could try making some rice balls? I have all the ingredients you need here, and Popin there has more of the same."},{"name":"POPIN","text":"Well met, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Popin's my name, and I have charge over our stores. I've never had occasion to handle Far Eastern ingredients before, but rest assured I'm eager to learn."},{"name":"RAULF","text":"When the rice balls are ready, please bring them outside. I'll go around and gather us some Domans in the meantime, and this time we'll make sure they leave with smiles on their faces!"},{"name":"SYSTEM","text":"To proceed with the quest, use the ingredients provided by Raulf to make a set of Doman rice balls."},{"name":"SYSTEM","text":"Should your synthesis efforts prove unsuccessful, speak with Popin to receive another set of ingredients."},{"name":"SYSTEM","text":"To begin the crafting process, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>. Next, select <span class=\"highlight\">Special Recipes</span> from within the requisite crafting discipline, then <span class=\"highlight\">Story</span>, and lastly <span class=\"highlight\">Class Quests</span> to locate the desired recipe."},{"name":"POPIN","text":"Please don't hesitate to let me know if you need more ingredients. We have plenty of La Noscean rice in store."},{"name":"POPIN","text":"Well, it seems the rumors did not exaggerate! Though I am no expert, already those rice balls look a class apart from that which Raulf made. He will be eager to see them, I'm sure."},{"name":"REFUGEEC02605","text":"If you are so determined to feed us, who are we to argue?"},{"name":"REFUGEEA02605","text":"This time, I hope to actually taste that sweet, sweet rice. Mmmmmm..."},{"name":"REFUGEEB02605","text":"Though I have more to add to my earlier advice, for now I shall look forward to the next batch of rice balls with bated breath."},{"name":"RAULF","text":"I've gathered the Domans, and they are eager to sample your handiwork."},{"name":"RAULF","text":"Thank you! I'll pass these out straightaway."},{"name":"REFUGEEC02605","text":"Now, <span class=\"emphasis\">that</span> was a rice ball! Ahhh, there's nothing like rice to give you strength for a hard day's work!"},{"name":"REFUGEEA02605","text":"Mmmmmm, that was wonderful. Every bite called to my mind's eye images of my faraway home."},{"name":"REFUGEEB02605","text":"Both the steaming and the shaping were done to perfection! Well done!"},{"name":"RAULF","text":"By the Twelve, this is amazing! I can taste it...how the sprinkle of salt draws out the sweetness of the rice. By adding spices, I unwittingly killed those natural flavors."},{"name":"RAULF","text":"And this fluffy texture─<span class=\"emphasis\">this</span> is what it means to grasp not only rice, but air as well. Gently joined as they are, the grains retain their fresh-steamed plumpness, and break apart at first bite."},{"name":"RAULF","text":"Such a simple thing...yet it's so <span class=\"emphasis\">good</span>. You truly harnessed the best qualities of rice."},{"name":"ANZU","text":"(-???-)Such is the spirit of Far Eastern cuisine─to respect each ingredient and allow it to shine."},{"name":"ANZU","text":"Forgive me my interruption. My name is Anzu, and I wish to thank you for assisting Raulf."},{"name":"RAULF","text":"A-Anzu? You shouldn't be here! If we're seen together..."},{"name":"ANZU","text":"What was I to do? I was worried. However, I see now that I needn't be. You're clearly in good hands."},{"name":"RAULF","text":"A-And returning to the matter at hand, the rice balls were a rousing success! Let's continue this back in the kitchen, shall we?"},{"name":"RAULF","text":"Using your samples as a guide, I'm going to begin serving rice balls at the restaurant. This marks our first foray into Far Eastern cuisine, and I couldn't have done it without you, <span class=\"highlight\">Forename</span>. Thank you!"},{"name":"RAULF","text":"And, er, before you go off, I probably should tell you who that girl was. Anzu's my fiancée. During my adventuring days, I'd often come here to trade tomestones. Here I first met her, and kept meeting her, until one day I popped the question."},{"name":"RAULF","text":"But there's something of a complication... Ack, but that's enough about me."},{"name":"RAULF","text":"Now, while the rice ball is a fine start, a start is all it is. I intend to put out more and more Far Eastern dishes, and I hope I can continue relying on your help in the days to come!"},{"name":"SYSTEM","text":"In tasting new experiences as a culinarian, you have learned “Quality Assurance”!"}],"reward":{"gil":804,"items":[{"num":250,"id":8},{"id":19524},{"id":19623,"one":1},{"id":19624,"one":1},{"id":19625,"one":1},{"id":19626,"one":1},{"num":5,"id":5825,"one":1}],"xp":1725300},"reqs":{"jobs":[{"lvl":63,"id":16}],"quests":[68140]},"next":[68142]},"partials":[{"type":"npc","id":"1020144","obj":{"i":1020144,"n":"Raulf","l":67,"q":5}},{"type":"npc","id":"1020145","obj":{"i":1020145,"n":"Drowsy Doman","l":67,"q":1}},{"type":"npc","id":"1020146","obj":{"i":1020146,"n":"Delicate Doman","l":67,"q":1}},{"type":"npc","id":"1020147","obj":{"i":1020147,"n":"Dapper Doman","l":67,"q":1}},{"type":"npc","id":"1020148","obj":{"i":1020148,"n":"Popin","l":67,"q":4}},{"type":"npc","id":"1020149","obj":{"i":1020149,"n":"Raulf","l":67,"q":1}},{"type":"npc","id":"1020150","obj":{"i":1020150,"n":"Drowsy Doman","l":67,"q":1}},{"type":"npc","id":"1020151","obj":{"i":1020151,"n":"Delicate Doman","l":67,"q":1}},{"type":"npc","id":"1020152","obj":{"i":1020152,"n":"Dapper Doman","l":67,"q":1}},{"type":"item","id":"19524","obj":{"i":19524,"n":"High Steel Culinary Knife","l":200,"c":35760,"t":27,"p":28512}},{"type":"item","id":"19623","obj":{"i":19623,"n":"Ruby Cotton Coatee","l":200,"c":43810,"t":35,"p":26136}},{"type":"item","id":"19624","obj":{"i":19624,"n":"Gyuki Leather Gloves of Crafting","l":200,"c":44573,"t":37,"p":15681}},{"type":"item","id":"19625","obj":{"i":19625,"n":"Ruby Cotton Bottoms","l":200,"c":45976,"t":36,"p":26136}},{"type":"item","id":"19626","obj":{"i":19626,"n":"Gyuki Leather Shoes","l":200,"c":46758,"t":38,"p":15681}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17933","obj":{"i":17933,"n":"Rice Ball Ingredients","l":270,"c":25358,"t":63}},{"type":"item","id":"17934","obj":{"i":17934,"n":"Doman Rice Balls","l":270,"c":53158,"t":63}},{"type":"quest","id":"68140","obj":{"i":68140,"n":"Flavors of the Far East","g":143,"l":"Limsa Lominsa","s":601,"f":1}},{"type":"quest","id":"68142","obj":{"i":68142,"n":"A Broth from the Brine","g":143,"l":"Mor Dhona","s":650,"f":1}}]}