{"quest":{"name":"The Missing Piece","location":"Limsa Lominsa","id":68154,"patch":4.0,"sort":680,"icon":100686,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1021047,"involved":[1000995,1021042,1021046],"genre":137,"usedItems":[17889,17890],"journal":["Forgemaster Brithael appears lost in thought.","After turning several ideas over in his mind, Brithael concludes that Shinto is hiding the true reason he believes Sekka will never become a proper swordsmith. Wanting to learn exactly what that reason could be, he would have you go and speak with Shinto on the matter. Make your way to West Hawkers' Alley and speak with Sekka's father.","Speaking to Shinto reveals that he believes Sekka is missing something more fundamental than skill. Refusing to say anything more on the matter, he casually dismisses you. Return to the guild and seek out Forgemaster Brithael that you might apprise him of all that you have learned.","Forgemaster Brithael is unperturbed by the fact that Shinto saw through your plans and takes his answer as confirmation of what he had suspected: it is not Sekka's skill as a smithy that is holding her back. Speculating that her clunky old tools are preventing her from demonstrating her true skill as a swordsmith, he would have you help him forge her a new set. Asking that you make a custom-made hammer, he then sends you to speak with Randwulf, who will provide you with all the materials you will need.","Randwulf generously furnishes you with all the necessary materials for your hammer. Now you are more than ready to set to work. Craft a high-quality hammer and see that it is delivered to Forgemaster Brithael with all due haste.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Randwulf.","You hand your hammer to Forgemaster Brithael, who informs you that he, too, has finished making his portion of her new tools. Impressed by what you made, he hands you his assortment of metal implements, and requests that you deliver everything to a certain stubborn girl in Anchor Yard.","Sekka is delighted by the tools you have given her. After a quick thanks, she rushes off, intent on immediately testing them out. Follow her back to the guild and check to see if she is satisfied.","As you speak with Sekka, Shinto strides in. He takes one glance at her katana and is immediately displeased. Sekka, however defends her blade, saying that while it may not look like much, forging it reminded her of the joy of smithing. Those words seem to be exactly what Shinto was waiting to hear. He tells her she has learned a valuable lesson as a swordsmith, but if she is to become his apprentice there is one last thing she must prove: her worth. She must face off against you to see who can make the better katana. Declaring the contest will take place in Kugane, Shinto then bids you and Forgemaster Brithael to meet him and his daughter there.<br><br>※The next blacksmith quest will be available from Brithael upon reaching level 70."],"objectives":["Speak with Shinto in West Hawkers' Alley.","Report to Forgemaster Brithael.","Speak with Randwulf.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a custom-made hammer <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the custom-made hammer <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Forgemaster Brithael</span></span>.","Deliver the set of tools to Sekka.","Speak with Sekka at the Blacksmiths' Guild."],"dialogue":[{"name":"BRITHAEL","text":"Ah, <span class=\"highlight\">Forename</span>, there ye are. Since we last met, I've been givin' a lot o' thought as to how we might assist Sekka in winning her father's approval, an' there's one thing that strikes me as strange."},{"name":"BRITHAEL","text":"While she is by no means a first-rate artisan, she's also not nearly so bad a smitty as her old man would have us believe."},{"name":"BRITHAEL","text":"So why's he tryin' so hard to convince us she'll never amount to anythin'? Me intuition tells me he's hidin' somethin' and it's up to ye to find out what."},{"name":"BRITHAEL","text":"I saw him wanderin' through West Hawkers' Alley earlier. With any luck, he should still be there."},{"name":"BRITHAEL","text":"The crotchety old man's taken a real shine to ye. No doubt ye'll have him singin' all his secrets in no time."},{"name":"SHINTOU","text":"You want to know what will convince me of Sekka's potential as a swordsmith?"},{"name":"SHINTOU","text":"You are an odd one─to be so gifted and yet so humble as to treat a mediocre craftsman like my daughter as an equal..."},{"name":"SHINTOU","text":"To answer your question, nothing will persuade me to take her on as an apprentice. What she lacks is something far more fundamental than skill."},{"name":"SHINTOU","text":"While I am certain Master Brithael sent you here with hopes of learning more than what I just told you, that is all I am willing to say on the subject."},{"name":"BRITHAEL","text":"So it is as I suspected then: it's not the girl's skills Shinto doesn't approve of."},{"name":"BRITHAEL","text":"His secretiveness is quite curious, though, isn't it? Were it that he didn't care for his daughter, he'd have no qualms about divulgin' the whole truth. Mayhap his distant demeanor is but a mask..."},{"name":"BRITHAEL","text":"That, however, is a discussion fer another day. Now, I've been observin' how Sekka works fer a while now to learn how we might help her improve."},{"name":"BRITHAEL","text":"From what I've seen, she's got a great deal of talent, but her clunky tools prevent her from displaying the full extent of her skill."},{"name":"BRITHAEL","text":"I believe that her hampered dexterity is the missin' “fundamental” to which Shinto refers. It should be an easy thing to fix. All we need do is provide her with a new set of svelte tools."},{"name":"BRITHAEL","text":"That said, forgin' custom-made implements ain't easy, and there are only two people I'd trust to do the job right."},{"name":"BRITHAEL","text":"Well, <span class=\"highlight\">Forename</span>, what do ye say? Ye make her a nice hammer an' I'll take care o' the rest."},{"name":"BRITHAEL","text":"Randwulf should be able to supply ye with what ye need. Ye can find him where he normally is─over at reception."},{"name":"BRITHAEL","text":"Just stroll on over to where Randwulf is and he'll see that you're supplied with any materials ye might need."},{"name":"RANDWULF","text":"The two of ye are makin' a new set of tools for the girl? Bahaha! So the ol' bugger does have a chivalrous streak in him."},{"name":"RANDWULF","text":"All right. This should be all that ye need, but feel free to come back if it's not enough."},{"name":"RANDWULF","text":"Ye need more materials? No need to be so bashful about it, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Yer makin' these tools for a good cause."},{"name":"RANDWULF","text":"I could take a look at it if ye really want, but Forgemaster Brithael's the one ye'd want to show the hammer to. Don't have the eye for detail that he does..."},{"name":"BRITHAEL","text":"Let's see it, then."},{"name":"BRITHAEL","text":"Ye've outdone yerself yet again, <span class=\"highlight\">Forename</span>. Mayhap I'll have to ask ye to forge me a new hammer, once all this has been resolved."},{"name":"BRITHAEL","text":"Between the two of us, we should now have a complete set o' tools. I'll let ye have the honor o' givin' them to the girl. If she's not down in the workshop, ye should be able to find her at the Anchor Yard."},{"name":"BRITHAEL","text":"She wasn't there? Well, just wander about the Anchor Yard fer a wee bit─yer bound to catch her sooner or later."},{"name":"SEKKA","text":"<span class=\"highlight\">Forename</span>, I...I am pathetic! I do not deserve to be called a smith."},{"name":"SEKKA","text":"Forgemaster Brithael invested so much time and effort in helping me achieve my dreams, and yet everything I make is...is <span class=\"emphasis\">rubbish</span>. I am undeserving of his teachings and his kindness."},{"name":"SEKKA","text":"My father is a distinguished artisan in Kugane..."},{"name":"SEKKA","text":"To gain his recognition would require that I craft an exceptional katana. This whole time I have been thinking how exactly I might bring such a blade into existence, but the harder I think the more I am overcome with panic."},{"name":"SEKKA","text":"To make matters worse, I cannot get Forgemaster Brithael's face out of my head. Ever since he stood up for me against my father, I find myself unable to think straight and a flush rise in my cheeks whenever he is around."},{"name":"SEKKA","text":"He has begun to dominate my thoughts and even my dreams. I do not know what has gotten into me. &lt;sigh&gt; My apologies. It seems I have gone off on a tangent. There was something you wanted to show me?"},{"name":"SEKKA","text":"Forgemaster Brithael and you made these for <span class=\"emphasis\">me</span>?"},{"name":"SEKKA","text":"It never occurred to me that your tools can make a difference. Unlike my current ones, these feel so light and sleek."},{"name":"SEKKA","text":"Thank you so much for this wonderful gift. I cannot wait to test them out."},{"name":"BRITHAEL","text":"The girl flew in here a quarter bell ago an' began poundin' up a storm. While I knew the tools would make her happy, I hadn't realized they'd make her <span class=\"emphasis\">that</span> happy."},{"name":"SEKKA","text":"<span class=\"highlight\">Forename</span>, look. It is magnificent, is it not? I made this using the tools you gave me."},{"name":"SEKKA","text":"I only used them to put on the finishing touches, but what an astounding difference they have made. They are so much easier to handle than my old ones. Some of the things I used to struggle with now almost feel like second nature."},{"name":"SEKKA","text":"Thank you. To think that you and Forgemaster Brithael cared deeply enough about me to design such a wonderful set of tools for me..."},{"name":"SHINTOU","text":"(-???-)Sekka, it seems that, once again, you have gone against my wishes. This katana is abysmal. Did you think crafting this shoddy sword would somehow change my mind?"},{"name":"SEKKA","text":"No, Father. This katana was not made with the intent of showcasing my skill. However, that does not make it any less valuable."},{"name":"SEKKA","text":"This blade─it represents my determination and marks the first step in my journey to becoming the best swordsmith in the realm."},{"name":"SEKKA","text":"Working with these tools reminded me of what it was like to concentrate solely upon feeling the cool bite of metal upon my palm and the reverberation each pound of the mallet sends up my arm. It made me realize that until now, my katana have been made with anxiety─a fear of being rejected─and not for the pure joy of the art."},{"name":"SEKKA","text":"Father, I am at a turning point. Now more than ever your guidance is essential to my success, and I would like to reiterate my request to you: please, I beg you, take me on as your apprentice."},{"name":"SHINTOU","text":"You exhibit great dedication, but have always lacked the necessary focus and affection for this craft─something which has reflected in your work. All your blades have been uninspired and lackluster."},{"name":"SHINTOU","text":"This katana, while far from acceptable, is different. You directed your undivided attention to its creation, rather than fixating on gaining my approval. In so doing you have demonstrated you understand the essence of our art. I shall consider your request."},{"name":"SEKKA","text":"Wh-What? Truly?"},{"name":"SHINTOU","text":"Do not get ahead of yourself. You must first prove your worth. I will have you compete against <span class=\"highlight\">Forename</span>. Only if you win against <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, will I accept you."},{"name":"SHINTOU","text":"We shall return to Kugane, and there the two of you will face off to see who can make the better katana. Keep in mind, Sekka, this shall be your last chance."},{"name":"BRITHAEL","text":"Er─pardon me, but I don't think I heard ye right. Ye can't mean to say yer plannin' on stealin' away me best smitty an' takin' <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to some distant country fer a bloody competition we didn't even agree to?"},{"name":"SEKKA","text":"Father, I have no objection to those terms. <span class=\"highlight\">Forename</span>, I know it is a lot to ask but please, please, <span class=\"emphasis\">please</span>, will you do this for me?"},{"name":"SHINTOU","text":"Very good. I shall return to Kugane immediately to start on preparations for the impending match. I will see the three of you there."},{"name":"BRITHAEL","text":"The three of you? Hold on. Ye don't mean to include <span class=\"emphasis\">me</span>, do ye?"},{"name":"SHINTOU","text":"Who else? As guildmaster it is your duty to accompany your protégé and see that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> performs to the very best of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> ability. Now then, I believe I have a boat to catch. Till next we meet in Kugane."},{"name":"SEKKA","text":"I shall be returning with my father. As we are adversaries now, I can no longer remain here at the guild."},{"name":"SEKKA","text":"Forgemaster Brithael, <span class=\"highlight\">Forename</span>, I suggest you brace yourselves. I shall do everything in my power to win."},{"name":"BRITHAEL","text":"Seven hells! Those two could give some of the fiercest pirates a run for their gil... "},{"name":"BRITHAEL","text":"&lt;sigh&gt; There's a lot that needs to be done ere we depart. While I go an' make sure things are in order, I expect ye to be practicin'. If we're crossin' the five seas fer this bleedin' competition, ye better be sure to win it."}],"reward":{"gil":988,"items":[{"num":250,"id":8},{"id":19560},{"id":5703,"one":1},{"id":5708,"one":1},{"id":5713,"one":1}],"xp":2902500},"reqs":{"jobs":[{"lvl":68,"id":10}],"quests":[68153]},"next":[68155]},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1021047","obj":{"i":1021047,"n":"Sekka","l":28,"q":1}},{"type":"npc","id":"1000995","obj":{"i":1000995,"n":"Randwulf","l":28,"q":3,"t":"Guild Receptionist"}},{"type":"npc","id":"1021042","obj":{"i":1021042,"n":"Sekka","l":28,"q":3}},{"type":"npc","id":"1021046","obj":{"i":1021046,"n":"Shinto","l":29,"q":1}},{"type":"item","id":"19560","obj":{"i":19560,"n":"Doman Steel File","l":260,"c":35162,"t":15,"p":37065}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"17889","obj":{"i":17889,"n":"Guild-forged Ingot","l":285,"c":20832,"t":63}},{"type":"item","id":"17890","obj":{"i":17890,"n":"Custom-made Hammer","l":285,"c":35116,"t":63}},{"type":"quest","id":"68153","obj":{"i":68153,"n":"Blood Ties","g":137,"l":"Limsa Lominsa","s":650,"f":1}},{"type":"quest","id":"68155","obj":{"i":68155,"n":"The Final Face-off","g":137,"l":"Limsa Lominsa","s":700,"f":1}}]}