{"quest":{"name":"True to Life","location":"Gridania","id":68151,"patch":4.0,"sort":700,"icon":100689,"unlocksFunction":1,"eventIcon":71341,"issuer":1020940,"target":1020947,"involved":[1020948,1020949,1022742,1023896],"genre":140,"usedItems":[17915,17916],"journal":["Atelloune is not yet ready to abandon her work.","Despite her many connections as an established naturalist in Gridania, Atelloune could not find hide nor hair of the dhalmel mount. She has prepared for this undesirable outcome, however, by selecting another specimen for mounting─the majestic three-feathered gagana. To that end, she bids you and Enion make for Gyr Abania to locate this gargantuan bird of prey.","Enion has only ill-tidings to share when you arrive at Castrum Oriens. It would seem the three-feathered gagana has not been sighted in the Fringes in quite some time. Some believe it may already be extinct. Just as all hope seemed to be lost, Enion has a stroke of genius. He suggests using the pelt of the more common variety of gagana to reproduce the visage of the three-feathered one. Before returning to Gridania, however, he insists on observing them briefly to ensure his mannequin properly conveys their likeness.","Captivated by their form and beauty, Enion asks you wait for him a while longer. He then takes his leave to continue observing the gaganas.","Enion is at last ready to return home, but not before confessing to you his uncertainty in creating a new mount. Your words of encouragement quickly replace his doubt with a newfound resolve to improve his skills as a taxidermist. In his excitement, he runs off to tell Atelloune of your plans for the gagana mount.","You return to find Atelloune has been apprised of the situation and has ordered a gagana pelt from the Leatherworkers' Guild. As she hands it to you, she reminds you of the importance of this mount. It is likely to be your final task as her assistant, and she insists this mount be the pinnacle of perfection. You roll up your sleeves and set to work on your masterwork to dress Enion's mannequin.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Atelloune.","The people of Gridania have gathered at Mih Khetto's Amphitheatre, all eyes fixed on the dhalmel jacket and gagana mount at center stage. It is not long before Atelloune's intended audience, Marmaduke, makes his presence known. He demands the exhibition be suspended forthwith, but Atelloune chooses to ignore his order. She instead goes on to explain how changes in the environment have endangered myriad animal species, and how people should make a better effort to protect them. Touched by her words, Marmaduke bids her continue, and teach the people of Gridania the value of the lives they would otherwise take for granted. The exhibition ends a resounding success, Atelloune completing her work with animal mounts, and Enion finding himself the newest recruit of the Leatherworkers' Guild. Atelloune means to spread learning and enlightenment to all corners of the realm, and she hopes the two of you might cross paths again someday."],"objectives":["Speak with Enion at Castrum Oriens.","Speak with Enion.","Speak with Atelloune in Old Gridania.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a large gagana cape <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the large gagana cape <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Enion</span></span>."],"dialogue":[{"name":"ATELLOUNE","text":"I have exhausted every resource at my disposal, but I could find neither hide nor hair of the dhalmel mount."},{"name":"ATELLOUNE","text":"I hoped it would not come to this, but we have no choice but to fashion a new mount."},{"name":"ATELLOUNE","text":"As a precautionary measure, I have already decided on our next specimen─the majestic gagana."},{"name":"ENION","text":"Those gargantuan birds in Gyr Abania? I never realized they were endangered."},{"name":"ATELLOUNE","text":"I do not speak of the common gagana. What we seek is the <span class=\"emphasis\">three-feathered</span> gagana. They are quite rare and sought for use in fine goods. Their population has dropped markedly over the years."},{"name":"ATELLOUNE","text":"Unfortunately, this means I must again put the two of you in harm's way."},{"name":"ENION","text":"If it means having a mount for the exhibition, then we at least have to try!"},{"name":"ENION","text":"Gaganas live in the Fringes, right? I'll go ahead to Castrum Oriens and see if anyone knows where to find them. See you there, <span class=\"highlight\">Forename</span>."},{"name":"ENION","text":"I still can't believe they took it. After all our hard work..."},{"name":"ENION","text":"I'm afraid we have a problem, <span class=\"highlight\">Forename</span>."},{"name":"ENION","text":"I've spoken with everyone who would care to listen, but no one has seen a three-feathered gagana here in quite some time."},{"name":"ENION","text":"It's as Miss Atelloune said. The plumage of the three-feathered gagana is─or rather, was─highly sought for Gyr Abanian finery."},{"name":"ENION","text":"Before the Calamity, when Dalamud slowly began its descent, they say the public grew panicked. Believing the world might come to an end, people began squandering their money on things they normally couldn't afford. Clothing made from the three-feathered gagana was desired above all."},{"name":"ENION","text":"Demand declined after the Calamity, but it was too late. They never recovered from the overhunting..."},{"name":"ENION","text":"Miss Atelloune was counting on us to find one for the exhibition. I don't want to return to her empty-handed."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"There has to be another way."},{"name":"A1","text":"Did anyone say why they're so valuable?"},{"name":"A1","text":"..."},{"name":"ENION","text":"From the sounds of it we're only going to find the common variety of gagana here. And it's not as if we could dress one to─wait...that's it! "},{"name":"ENION","text":"Their feathers have a lustrous sheen unique to the three-feathered gagana. Other than that, I bet most people couldn't tell the difference between─wait...that's it!"},{"name":"ENION","text":"&lt;sigh&gt; If only I could be as calm and collected as you. For a moment I humored the ridiculous idea of finding a regular gagana and─wait...that's it!"},{"name":"ENION","text":"While it's true the three-feathered gagana was valued for the sheen of its feathers, the greater distinction between it and other gagana lies in the distribution of feathers on its body."},{"name":"ENION","text":"Do you think if we found a normal gagana you could change the arrangement of its feathers?"},{"name":"ENION","text":"It will be difficult with only books for reference, but I'm certain a leatherworker of your caliber can do it."},{"name":"ENION","text":"Then there's still hope for the exhibition! Miss Atelloune was lucky to find a leatherworker like you to help us."},{"name":"ENION","text":"But if we're going to make a convincing mount, we'll need a good mannequin, and I've never seen a gagana in person before. Let's see if we can find some. I heard they nest around Virdjala."},{"name":"ATELLOUNE","text":"I will see to preparations for the exhibition. You go ahead to Gyr Abania. Number Seventy-One should be waiting for you."},{"name":"ENION","text":"I never realized the gagana was such a beautiful and majestic bird. If it's alright with you, I'd like to observe them for just a while longer."},{"name":"ENION","text":"I think I'm ready to head back. Our gagana mount is going to be great. At least, I hope it is..."},{"name":"ENION","text":"...Um, can I ask you a question? I know Miss Atelloune means well and all, but...Marmaduke was absolutely furious. If other people are just as angry, maybe we shouldn't be making another mount. What do you think?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Everything will be fine."},{"name":"A1","text":"We've come too far to run away now."},{"name":"A1","text":"..."},{"name":"ENION","text":"You're right. It's true we've had a few setbacks, but Miss Atelloune is counting on us."},{"name":"ENION","text":"On second thought, forget I asked. Miss Atelloune is counting on us."},{"name":"ENION","text":"And if I'm going to be a real taxidermist someday, I have to do everything I can to make this one perfect! Let's head back to Gridania. She'll want to know what we have planned."},{"name":"ENION","text":"delete"},{"name":"ENION","text":"delete"},{"name":"ATELLOUNE","text":"At last you are returned, and with nary a scratch. Enion has told me everything. A pity you were unable to find a true, three-feathered gagana."},{"name":"ATELLOUNE","text":"I knew sights of the bird had grown scarce over the years, but I never imagined the situation was so dire."},{"name":"ATELLOUNE","text":"Your plan is to recreate the three-feathered gagana using the pelt of a normal one, is that right?"},{"name":"ATELLOUNE","text":"This is no small task you place upon yourself. With the exhibition fast approaching, we can afford no mistakes."},{"name":"ATELLOUNE","text":"If all goes as planned, this will be your final task for me. All the more reason I shall accept nothing short of perfection."},{"name":"ATELLOUNE","text":"Though I loathe being made to wait, I will make an exception for this. Handle the pelt with care, and do not give it to Seventy-One until you are absolutely satisfied with your work."},{"name":"ATELLOUNE","text":"If anything should happen to it, inform me immediately, that I might procure another."},{"name":"ENION","text":"Hey, <span class=\"highlight\">Forename</span>. Miss Atelloune's ordered a pelt from the Leatherworkers' Guild for you."},{"name":"ENION","text":"Have you finished yet? I just know this gagana is going to look great."},{"name":"ENION","text":"This is incredible! It's the spitting image of a three-feathered gagana!"},{"name":"ENION","text":"I can already picture the looks on people's faces when they see my mannequin dressed with this. It's going to be our finest mount yet!"},{"name":"ATELLOUNE","text":"The placement of plumage on this pelt is immaculate. Well done, Number Seventy-Two."},{"name":"ATELLOUNE","text":"Now, I must be off to the amphitheatre. I have posted flyers all about Gridania to ensure our desired audience is in attendance. Everything must be ready for his arrival. Be careful with that pelt, Number Seventy-Two. And remember: nothing less than perfection will suffice."},{"name":"ENION","text":"I was hoping people would be excited to see our mount up there, but they actually seem kind of mad. We worked so hard on it though... I'm sure Miss Atelloune can make them understand."},{"name":"MARMADUKE","text":"Just when I had thought Gridania had reclaimed some modicum of decency. You will suspend this farce of an exhibition at once!"},{"name":"ATELLOUNE","text":"Silence! I will hear no more of your fabricated tales of the elementals! "},{"name":"ATELLOUNE","text":"Our work is not a mockery of these animals, but a tribute to their majesty. If you would cease your blustering for only a moment, I will explain to you─and the good people here in attendance─why."},{"name":"ATELLOUNE","text":"Ahem. Thank you for gathering here today. I wish to speak with you regarding a matter of grave concern. One often overlooked in the hustle and bustle of our lives here in Gridania. To start, I would have you consider this, the three-feathered gagana."},{"name":"ATELLOUNE","text":"A rare breed highly valued by the people of Gyr Abania. Before the Calamity, as Dalamud began its bodeful descent, demand for this bird's plumage would see its population drop substantially. Its natural habitat has undergone drastic change since then. So much so, some believe there may be none left."},{"name":"ATELLOUNE","text":"The dhalmel which once stood outside the Leatherworkers' Guild represented a species that also struggles with a declining population. As the environment continues to undergo radical changes, these innocent creatures and countless others will be pushed to the brink of extinction."},{"name":"ATELLOUNE","text":"We obviously cannot bend the laws of nature to return the world to what it once was, but we can still do our part to preserve their homes and what few of them remain. We must also show restraint in our hunting lest their peers become endangered as well."},{"name":"ATELLOUNE","text":"Take for example this jacket crafted from dhalmel hide. Demand for its leather has grown noticeably of late. What do you suppose will happen as more hunters are drawn to the Sea of Clouds?"},{"name":"ATELLOUNE","text":"Seeing only the products born of their hides, it is far too easy to forget the sacrifice of these animals. "},{"name":"ATELLOUNE","text":"We must protect them as we do the balance of life here in the Twelveswood. To do otherwise would be a grievous squandering of resources."},{"name":"GUARD02615","text":"You're one to talk. What is this display other than a waste of skin? You claim it has an educational purpose, but one could simply read a book─"},{"name":"ATELLOUNE","text":"And you have read such a book? I should hope you have, and that you are highly knowledgeable as a result, given that you wear clothing made from their hides."},{"name":"GUARD02615","text":"Well... I..."},{"name":"ATELLOUNE","text":"What about you? Do you know <span class=\"emphasis\">anything</span> of dhalmels or gaganas?"},{"name":"ATELLOUNE","text":"These people have a right to know what is happening to the world outside of Gridania. To know the cost of the goods they would otherwise take for granted."},{"name":"GEVA","text":"Hearer Marmaduke, perhaps now you would be willing to consider the merit of Atelloune's work? These mounts are not meant to offend anyone."},{"name":"GEVA","text":"They are a lasting reminder of the lives sacrificed for the clothing on our backs, and a tool to arouse interest in the study of animals so many would otherwise ignore."},{"name":"GEVA","text":"You might think these specimens a grim reflection of their living counterparts, but they preserve a truth that mere words cannot express. Surely you understand the virtue in that?"},{"name":"MARMADUKE","text":"...More than you realize. For it is my duty─nay, my privilege─to hearken to the elementals and bear witness to such truths, that we might maintain the delicate balance of life here in the Shroud."},{"name":"MARMADUKE","text":"I see now you wish only to share with these people knowledge I have long taken for granted. I would ask your forgiveness for my recent wrongdoings."},{"name":"MARMADUKE","text":"The Twelveswood suffered greatly in the Calamity, and in the years since, it has only grown weaker. The sight of your mounts was...was more than I could bear."},{"name":"MARMADUKE","text":"But through the sacrifice of these few, countless more may be saved. If your creations serve to bring these good people wisdom, and instill in them a greater respect for the blessed creatures of this land, then I will condemn them no longer."},{"name":"ATELLOUNE","text":"Then I will carry on, for it is my duty to illuminate the dark with the light of knowledge."},{"name":"ATELLOUNE","text":"Before I continue, I must first give thanks to the two skilled artisans who made this possible. My darling assistants─the aspiring taxidermist who pieced together this splendid gagana mount, and the gifted leatherworker who prepared both the jacket and gagana's pelt."},{"name":"ATELLOUNE","text":"It has been far too long since I lectured before an audience so large. I hope I didn't bore them."},{"name":"ENION","text":"You were perfect, Miss Atelloune! They were hanging on your every word. And did you see how everyone was admiring the gagana mount? Today was a great day!"},{"name":"ATELLOUNE","text":"Indeed it was. A great many people learned a valuable lesson, thanks in no small part to the two of you. And with that, I do believe my work here is done. Enion, <span class=\"highlight\">Forename</span>, you have my sincerest thanks."},{"name":"ATELLOUNE","text":"Come now, you two. When my assistants are deserving of praise, I will not hesitate to give it."},{"name":"GEVA","text":"Even I have to admit that gagana mount was quite impressive. It's not often the amphitheatre draws a crowd like that. Between that and the lecture, I'd say the exhibition was a resounding success."},{"name":"ENION","text":"Thanks for the compliment, but building the mannequin was the easy part. <span class=\"highlight\">Forename</span>'s the one who made the incredible cape to dress it. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s been like a big <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> looking out for me every step of the way."},{"name":"ENION","text":"Now that we've finished, though, I think I'll stay in Gridania a while longer. There's still a lot I need to learn about leatherworking, and I have plenty left to share about making animal mounts."},{"name":"GEVA","text":"Well, well, looks like I have a new recruit. Don't think I'll go easy on you just because you're a friend of <span class=\"highlight\">Forename</span>'s, either. Rather the contrary."},{"name":"ENION","text":"Wait... <span class=\"emphasis\">You're</span> the guildmaster!? I thought you were just a friend of <span class=\"alternative-container\"><span class=\"alternative\">hers</span><span class=\"alternative\">his</span></span>."},{"name":"ATELLOUNE","text":"I admit I was doubtful of your abilities as a leatherworker, but I am grateful to have been proven wrong."},{"name":"ATELLOUNE","text":"Thanks to you, we have touched the hearts and minds of a good many people here in Gridania."},{"name":"ATELLOUNE","text":"But this is only the beginning. When I publish the results of our work here, all corners of the realm shall know of the great naturalist Atelloune. Indeed, the shining star that is my career has only begun to shine!"},{"name":"ATELLOUNE","text":"Ah, did I not tell you? Not long after I finished my lecture at the amphitheatre, reservations for the next publication of <span class=\"emphasis\">New Eorzea Geographic</span> began to pour in."},{"name":"ATELLOUNE","text":"What's more, Hearer Marmaduke plans to speak with the Elder Seedseer to have my publication instated as a reference work for the Seedseer's council."},{"name":"ATELLOUNE","text":"I left Marcette to manage the better part of my research and writings, but this will require nothing short of my undivided attention."},{"name":"ATELLOUNE","text":"My work must be thorough, and comprehensive. I foresee much traveling as well. Yes, across the whole of Eorzea, and then, the world!"},{"name":"ATELLOUNE","text":"Perhaps we will meet again on a distant shore."},{"name":"ATELLOUNE","text":"Should that day come, I would be honored to receive your assistance once more."},{"name":"ATELLOUNE","text":"I trust the gagana pelt isn't giving you too much trouble? Number Seventy-One is rather eager to dress his new mannequin."},{"name":"ATELLOUNE","text":"<span class=\"emphasis\">Another</span> gagana pelt? These animals do not grow on trees, you know. I should hope you are grateful that I thought to prepare another in case of an emergency."},{"name":"ATELLOUNE","text":"Every pelt─and the life given to obtain it─is precious <span class=\"highlight\">Forename</span>. You would do well not to waste them."},{"name":"SYSTEM","text":"You have helped create an animal mount the likes of which Gridania has never seen, and in the doing learned “Stroke of Genius”!"}],"reward":{"items":[{"id":5703},{"id":5708},{"id":5713}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":13}],"quests":[68150]}},"partials":[{"type":"npc","id":"1020940","obj":{"i":1020940,"n":"Atelloune","l":53,"q":4}},{"type":"npc","id":"1020947","obj":{"i":1020947,"n":"Enion","l":53,"q":2}},{"type":"npc","id":"1020948","obj":{"i":1020948,"n":"Enion","l":2406,"q":1}},{"type":"npc","id":"1020949","obj":{"i":1020949,"n":"Enion","l":2406,"q":1}},{"type":"npc","id":"1022742","obj":{"i":1022742,"n":"Enion","l":53,"q":2}},{"type":"npc","id":"1023896","obj":{"i":1023896,"n":"Enion","l":2406,"q":1}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"17915","obj":{"i":17915,"n":"Large Gagana Skin","l":290,"c":21811,"t":63}},{"type":"item","id":"17916","obj":{"i":17916,"n":"Large Gagana Cape","l":290,"c":22009,"t":63}},{"type":"quest","id":"68150","obj":{"i":68150,"n":"The Trouble with Taxidermy","g":140,"l":"Gridania","s":680,"f":1}}]}