{"quest":{"name":"The Trouble with Taxidermy","location":"Gridania","id":68150,"patch":4.0,"sort":680,"icon":100689,"unlocksFunction":1,"eventIcon":71341,"issuer":1020940,"target":1020940,"involved":[1000352,1000691,1020947,1022742],"genre":140,"usedItems":[17913,17914],"journal":["You notice that oh-so-familiar glimmer is back in Atelloune's eyes today.","Atelloune is contemplating her next course of action as the dhalmel mount has been well received. Or so she thinks. Drawn by the crowds around the Leatherworkers' Guild, Marmaduke, a Hearer from the Conjurers' Guild, has taken notice and is repulsed by what he sees. He claims it to be an affront to the elementals and demands it be taken down.","Atelloune is not one to deny the word of the Hearers, but she believes there may yet be a way to persuade Marmaduke, and ultimately the elementals, to allow her work to continue. Certain they have dealt with and overcome similar opposition in the past, Atelloune asks you to seek counsel from Geva of the Leatherworkers' Guild.","Geva explains that the Leatherworkers' Guild had to overcome its deplorable reputation by showing the practical applications of its wares, and the same must be done for your animal mounts. No sooner does she utter the words than she is struck with an idea. While she tends to other preparations for her plan, she asks you to fashion a jacket out of dhalmel leather. Everything you need should be with Randall at the front desk.","With leather in hand you set to work and create a jacket with all the primp and polish one expects of a master leatherworker. Hopefully Geva will agree.<br><br>※In the event you lose the ingredients or the synthesis ends in failure, you may try again by speaking with Randall.","Geva is pleased to see your awl has not dulled since setting off for business ventures in Ishgard. Enion arrives with fortuitous timing to relay a message from Atelloune, but soon finds himself sporting your latest creation. Satisfied with the fit, Geva goes on to elucidate her plan: she means to hold an exhibition of leatherworker wares using the jacket together with the dhalmel mount. The venue has already been set. All that remains is to assemble any mounts Atelloune would have on display.","As everything was falling into place, it seems Marmaduke has taken it upon himself to relieve you of the dhalmel mount. With that said, Atelloune has every intention of committing to Geva's plan. The only question, then, is how will she reclaim the centerpiece of the exhibition?<br><br>※The next leatherworker quest will be available from Atelloune upon reaching level 70."],"objectives":["Speak with Atelloune.","Speak with Geva.","Obtain the jacket materials from Randall.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a dashing dhalmelskin jacket <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the dashing dhalmelskin jacket <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Geva</span></span>.","Speak with Atelloune."],"dialogue":[{"name":"ATELLOUNE","text":"Ah, Number Seventy-Two. Come to bask in the splendor of our dhalmel mount, I see. Well, this is no time for gawping. Rather, it is time to resume our work."},{"name":"ATELLOUNE","text":"A pity we could not add a bear to our collection, but even alone the dhalmel has garnered no small amount of attention. On more than one occasion I've even seen people stopping to read the signboard I posted."},{"name":"ENION","text":"I can't believe so many people are coming to see something <span class=\"emphasis\">I</span> helped to create. The next mount will be even better! "},{"name":"MARMADUKE","text":"Outrageous! How dare this happen without my consent!"},{"name":"MARMADUKE","text":"So this is why everyone has been crowding about the Leatherworkers' Guild of late. What sort of sick, twisted joke is this?"},{"name":"ENION","text":"&lt;gasp&gt; That's one of the Hearers! What does he want with us?"},{"name":"ATELLOUNE","text":"I assure you sir, this is no joke. This mount was fashioned in an attempt to pre─"},{"name":"MARMADUKE","text":"The elementals weep for this poor creature! How they cry out in anger!"},{"name":"GUARD02614","text":"An affront to the Twelveswood if ever there was! To ignore it is to invite the greenwrath upon us all!"},{"name":"MARMADUKE","text":"You three. Are you responsible for this!? By order of the Conjurers' Guild, I demand you to take down this grotesquerie at once!"},{"name":"ENION","text":"Take it down? But, all of our hard work..."},{"name":"ENION","text":"Hey, <span class=\"highlight\">Forename</span>. I think Miss Atelloune has decided on the next mount."},{"name":"ATELLOUNE","text":"Ugh! The nerve of that man. It took every onze of my being to hold my tongue."},{"name":"ATELLOUNE","text":"That close-minded fool! How can he not see the benefits of our work, the opportunity we offer Gridanians to learn about animals that live beyond the borders of the Twelveswood? And he dares to call himself a Hearer."},{"name":"ATELLOUNE","text":"How he abuses his position that he might do as he pleases. The sight of him is enough to make my skin crawl."},{"name":"ATELLOUNE","text":"Ahem. Excuse me. I got a little carried away there."},{"name":"ATELLOUNE","text":"Though it pains me to concede to such swine, we cannot deny the will of the elementals. I have no doubt one of your...<span class=\"emphasis\">talents</span> could quickly resolve the situation, but this requires a more civilized approach."},{"name":"ATELLOUNE","text":"Indeed, we must settle this in a matter as befitting naturalists. Hmmm. The Leatherworkers' Guild is certain to have dealt with similar opposition in the past. Number Seventy-Two, go and speak with Geva and see what advice she has to offer on the matter."},{"name":"ENION","text":"What should we do, <span class=\"highlight\">Forename</span>?"},{"name":"GEVA","text":"The <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of the hour. With everyone stopping by to have a look at that mount outside, I knew it was only a matter of time before you came. What can I do for you?"},{"name":"GEVA","text":"Did they now? You know, there was a time when leather goods were criticized as being extravagant and wasteful. It took a great deal of effort on the part of the leatherworkers here, but eventually opinions changed."},{"name":"GEVA","text":"They had to prove what they made was worth the cost of lives sacrificed in the process."},{"name":"GEVA","text":"Unless you can do the same with your mounts, you won't be convincing the Hearers of anything."},{"name":"GEVA","text":"Actually, that gives me an idea. I'll need to prepare a few things first, though. In the meantime, I would have you attend to something else."},{"name":"GEVA","text":"We're going to need a dhalmelskin jacket, and I can think of none better than you to make it. Besides, it's been too long since I've seen your work."},{"name":"GEVA","text":"Randall will have everything you need at the front desk."},{"name":"GEVA","text":"When you've finished, I should have everything ready for the next step in my plan."},{"name":"ATELLOUNE","text":"To think there was a time when the work of the Leatherworkers' Guild was criticized as wasteful. If the guild could redeem itself in the eyes of the people, there is hope for us yet."},{"name":"RANDALL","text":"Good to see you. I trust you've been keeping busy? Goodness knows we have with all these commissions we've received of late."},{"name":"RANDALL","text":"Ahem, but enough of my ramblings. As Guildmaster Geva tells it, you have much work to do. Here is the dhalmel leather as requested. If you should have need of more, pray do not hesitate to ask."},{"name":"GEVA","text":"I imagine Randall should have prepared the dhalmel leather by now. I look forward to seeing that jacket when you've finished."},{"name":"GEVA","text":"How's that jacket coming along? I hope my faith in you after all this time hasn't been misplaced."},{"name":"GEVA","text":"You've impressed me, <span class=\"highlight\">Forename</span>. I was worried you might have forgotten what you learned here, but it's clear you've done quite the opposite. Well done."},{"name":"ENION","text":"Erm, excuse me. Is <span class=\"highlight\">Forename</span> here? Miss Atelloune wants to speak with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. She says it's quite urgent."},{"name":"GEVA","text":"Right on time. Come here for a moment. I need you to try on this jacket."},{"name":"ENION","text":"A jacket? What about Miss Atelloune? And who are you, anyway?"},{"name":"GEVA","text":"There we are. How's the fit?"},{"name":"ENION","text":"It's...actually quite nice. I usually hate leather clothes because they're so stiff when new, but this is quite soft. It's fairly light and warm, too."},{"name":"ENION","text":"I imagine who ever uses this will be grateful to have it."},{"name":"GEVA","text":"It's time we move on to the next part of my plan─a leatherworkers' exhibition, with that jacket on display."},{"name":"ENION","text":"But there's no time for an exhibition! We're busy enough as is fighting to keep our dhalmel mount."},{"name":"GEVA","text":"Which is precisely why you'll be putting them on display together. The mere mention of an exhibition will be enough to draw a sizable crowd."},{"name":"GEVA","text":"This will afford Atelloune an opportunity to teach people about the endangered dhalmels of Abalathia."},{"name":"GEVA","text":"I've already reserved Mih Khetto's Amphitheatre. All we need now are the mounts she would have on display."},{"name":"ENION","text":"That's a great idea, miss! I'll go and inform her right away!"},{"name":"GEVA","text":"Miss...? He hasn't the slightest idea of who I am, does he? I suppose it can't be helped for now. Be sure to give Atelloune my regards."},{"name":"RANDALL","text":"As Guildmaster Geva tells it, you'll be making a jacket with that leather, is that right? I know not who it is for, but I pray it will be put to good use."},{"name":"RANDALL","text":"You needn't say a word. I've been here long enough to know when a guild member has made a mess of their work. No need to worry, though. Happens to even the best of us. Well, perhaps not Guildmaster Geva."},{"name":"ATELLOUNE","text":"Oh, Number Seventy-Two. If only you had come sooner. I left only for a moment, but in my absence Marmaduke and his gaggle of goons made off with our mount!"},{"name":"ATELLOUNE","text":"What came of your talks with Geva? I should hope some good may yet come of all our efforts."},{"name":"ATELLOUNE","text":"Instruction under the guise of a leatherworkers' exhibition. Yes, that just might work. Geva has ever been one with an eye for opportunity. First, we must deal with Marmaduke, and his attempts to deny the good people of Gridania an opportunity to enlighten themselves."},{"name":"ATELLOUNE","text":"Before our work was stolen, I took it upon myself to speak with an associate of mine─another Hearer of the Conjurers' Guild. When I broached the subject of our mount and the elementals' apparent dissatisfaction with using animal skins in such a fashion, he was completely and utterly bewildered."},{"name":"ATELLOUNE","text":"In truth, neither the Hearers of the Conjurers' Guild nor the Seedseers have expressed any opposition to our work. Marmaduke merely uses the elementals as an excuse to impose his ideals on others."},{"name":"ATELLOUNE","text":"Well, he is not the only one with influence here in Gridania."},{"name":"ATELLOUNE","text":"One way or another, we shall have a mount for our exhibition."},{"name":"ENION","text":"I can't believe they took it. After all our hard work..."},{"name":"GEVA","text":"I take it you didn't tell that boy who I am, did you? No matter. He'll come to know me soon enough."}],"reward":{"gil":952,"items":[{"num":250,"id":11},{"id":19563},{"id":5703,"one":1},{"id":5708,"one":1},{"id":5713,"one":1}],"xp":2902500},"reqs":{"jobs":[{"lvl":68,"id":13}],"quests":[68147]},"next":[68151]},"partials":[{"type":"npc","id":"1020940","obj":{"i":1020940,"n":"Atelloune","l":53,"q":4}},{"type":"npc","id":"1000352","obj":{"i":1000352,"n":"Randall","l":53,"q":3,"t":"Guild Receptionist"}},{"type":"npc","id":"1000691","obj":{"i":1000691,"n":"Geva","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1020947","obj":{"i":1020947,"n":"Enion","l":53,"q":2}},{"type":"npc","id":"1022742","obj":{"i":1022742,"n":"Enion","l":53,"q":2}},{"type":"item","id":"19563","obj":{"i":19563,"n":"Doman Steel Awl","l":260,"c":35454,"t":21,"p":37065}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"17913","obj":{"i":17913,"n":"Jacket Materials","l":285,"c":22013,"t":63}},{"type":"item","id":"17914","obj":{"i":17914,"n":"Dashing Dhalmelskin Jacket","l":285,"c":43162,"t":63}},{"type":"quest","id":"68147","obj":{"i":68147,"n":"The Value of Life","g":140,"l":"Gridania","s":650,"f":1}},{"type":"quest","id":"68151","obj":{"i":68151,"n":"True to Life","g":140,"l":"Gridania","s":700,"f":1}}]}