{"quest":{"name":"The Client Is King","location":"Limsa Lominsa","id":68152,"patch":4.0,"sort":630,"icon":100686,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1000997,"involved":[1012510,1021042,1021043],"genre":137,"usedItems":[17885,17886],"journal":["Forgemaster Brithael stares at you like a shipwrecked man who has just spotted land.","Forgemaster Brithael is beyond relieved to see you. According to him, ever since Sekka began her studies at the guild, she has taken to wandering the floors and criticizing everyone's work. Upon giving her a stern talking to about her unpleasant manner of conduct, she became upset and left in a flurry of angry words. It seems, however, this is not the first time she has stormed out over this very same argument, and Brithael asks that you try talking to her in his stead. He then points you in the direction of the Anchor Yard, where she normally goes to cool down. Make your way there and see if you can get through to her. ","Sekka is of the belief that the Blacksmiths' Guild is wasting all its potential on fulfilling mundane tasks for clients. She tells you this is the root cause for the lack of self-improvement she has observed in all the guild members. She believes things should be run differently and tells you she intends to prove it to you. Return to the Blacksmiths' Guild and inform Forgemaster Brithael of just how well your talk with Sekka went.","You are met by a perturbed Brithael who tells you that Sekka has just challenged the guild. She said she intends to face off with a member of the forgemaster's choice to see who can better satisfy the next request which comes into the guild. Brithael would, of course, have you be the one to take her up on her challenge. It would seem fate is already in your favor, as the latest order you have received is from a customer you already know, and they are waiting to discuss the details of what they would have you make. Go to the Drowning Wench and speak with them.","As it conveniently turns out, Laurisse and Fremondain─the acquaintances you made in Ishgard─are your clients. They have come to have a sword forged for Fremondain so that he might have a means to protect himself when Laurisse's duties take her to distant lands for extended periods of time. Fremondain, telling you that he has grown frail in his old age, says he would prefer something light and easy to handle. Using the materials Laurisse provides, produce a high-quality featherlight shortsword and deliver the finished product to Brithael for inspection.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Laurisse.","Fremondain admits that while both are excellent swords, he finds yours to be far superior to Sekka's. Flabbergasted, she attempts to convince him that hers beats yours in durability and sharpness, at which point Laurisse steps in to say that they are in fact of a comparable quality in both those aspects. Your sword, however, is more desirable because it takes into consideration the physical limitations of its wielder. Sekka, unwilling to accept defeat continues to argue, and Brithael then suggests she look to switching career paths because her attitude is unbecoming of a craftsman. Realizing her mistake, she reflects upon her conduct and apologizes for her outburst and earlier behavior before vowing to begin taking her studies at the guild more seriously.<br><br>※The next blacksmith quest will be available from Brithael upon reaching level 65."],"objectives":["Speak with Sekka.","Speak with Brithael.","Speak with the client at the Drowning Wench.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a featherlight shortsword <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the featherlight shortsword <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Forgemaster Brithael</span></span>."],"dialogue":[{"name":"BRITHAEL","text":"<span class=\"highlight\">Forename</span>, it's been absolute hell ever since that thrice-damned shrew ye dragged back from the docks set up shop at our guild."},{"name":"BRITHAEL","text":"From the crack o' dawn to sundown she prowls the floors lookin' to find fault with every one o' me smitties' work. I've warned her a thousand times over that such disparagin' remarks will not be tolerated, but will she listen? No!"},{"name":"BRITHAEL","text":"Instead she'll storm off in a huff, then return with even more bitter words on her tongue. Please, ye've gotta go an' talk some sense into her. She's like to be at the Anchor Yard, where she always goes to cool down."},{"name":"BRITHAEL","text":"Yer just not lookin' hard enough. She'll be there, huddled in some corner of the Anchor Yard, bawlin' her eyes out."},{"name":"SEKKA","text":"You have come here because that bonehead sent you after me, right? Well, I'll have you know that whatever <span class=\"emphasis\">he</span> says, I do not intend to “be more supportive of the smitties.” Every single point I brought up has been valid!"},{"name":"SEKKA","text":"You have some excellent smiths. Really, you do. However, everyone is so focused on when their next commission is due that they have lost sight of what is important. No one here has any passion or desire to improve─they are all dead on the inside."},{"name":"SEKKA","text":"In Hingashi, swordsmiths are taught to strive for excellence. To push boundaries. We dedicate our lives to seeing that each weapon we make surpasses the last."},{"name":"SEKKA","text":"Katana are the favored weapon of the samurai, warriors who stake their lives on protecting the peace of our lands. Only the finest of blades are worthy of being wielded by these men and women."},{"name":"SEKKA","text":"It is for this reason swordsmiths dedicate their entire lives to growth and perfecting their art. I had thought all artisans engaged in metalworking were similarly devoted to their craft."},{"name":"SEKKA","text":"Observing how your guild is run, however, has made me realize I was wrong. Forgemaster Brithael would have his most gifted craftsmen carry out the most mundane tasks, all so that you might fulfill customer orders."},{"name":"SEKKA","text":"I traveled here from Kugane because everyone is of the opinion that this is one of the best Blacksmiths' Guilds. Truthfully, I am disappointed. Your organization is so stagnant. Surely, you must see it too?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Every day, we improve with these mundane tasks."},{"name":"A1","text":"We're a guild and the customer is our priority."},{"name":"SEKKA","text":"No. This is all wrong! Blacksmiths cannot refine their skills by mindlessly repeating the same tasks day in and day out. Your guild needs to change, and I am going to prove it to you."},{"name":"BRITHAEL","text":"I thought I told ye to go and smooth things over with her! Instead o' returnin' calm an' composed, she storms in here with a murderous gleam in her eye, sayin' she wants to challenge me guild."},{"name":"BRITHAEL","text":"“It's me against one o' yours,” she says. “Yer to assign both of us to the next order ye receive, and the smitty who makes the better item is the winner.”"},{"name":"BRITHAEL","text":"&lt;sigh&gt; So that's what all that was about..."},{"name":"BRITHAEL","text":"Ah, but perhaps I'm lookin' at this the wrong way. This is the perfect opportunity for us─for <span class=\"emphasis\">you</span>─to put her in her place."},{"name":"BRITHAEL","text":"Yes─if ye were to win this fer us, she'll have no choice but to back down. Ha! And as luck would have it, the latest order that came in is from two people ye know personally."},{"name":"BRITHAEL","text":"They're down at the Wench, waitin' to discuss the details o' what they'd have ye make. Sekka's already gone ahead, so I'd hurry if I were ye."},{"name":"BRITHAEL","text":"Best not to keep the clients waitin'. Not only is it bad fer business, but the girl's gotten enough of a head start as it is."},{"name":"FREMONDAIN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. What a wonderful coincidence it is to see you here. You're looking well."},{"name":"LAURISSE","text":"<span class=\"highlight\">Forename</span>? To think that Master Brithael would send you of all people to us... Why, today must be our lucky day."},{"name":"LAURISSE","text":"This is the first true break I've been afforded since being promoted to apprentice squire, and I decided to come here to thank your guildmaster in person for his services. But that's not all..."},{"name":"LAURISSE","text":"Lately, each new mission I'm dispatched on takes me further from the city than the last, and I am forced to leave Fremondain on his own for extended periods of time. He, however, has not a weapon with which to defend himself in my absence. As such, I would have a sword forged for him."},{"name":"LAURISSE","text":"What? A contest? While I'm not averse to the idea, this is the first I'm hearing of it. In fact, the girl you mentioned─Sekka─never came this way..."},{"name":"LAURISSE","text":"Hm. Mayhap she thought the general request we sent to your guild was enough and has already begun working on a blade?"},{"name":"LAURISSE","text":"Well, whatever the case may be, I look forward to seeing you work your usual magic. Now, Fremondain, tell <span class=\"highlight\">Forename</span> what kind of weapon you would have <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> make."},{"name":"FREMONDAIN","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, it is a pleasure to see you again. As for the blade─I believe a shortsword would suit me best. I've grown weak in my old age and anything heavy is like to be more a hindrance than help."},{"name":"LAURISSE","text":"Yes, the lighter the shortsword, the better. We've already paid the fee for your services to Master Brithael and have, in addition, agreed to provide you with materials."},{"name":"LAURISSE","text":"While we are still far from wealthy, money is not as tight as it once was. If there is anything at all you should require, please do not hesitate to ask."},{"name":"LAURISSE","text":"Oh, and since this is a competition, once you're finished, perhaps you should take the blade to Forgemaster Brithael. After you've received his approval, we'll appraise the two weapons side by side."},{"name":"SYSTEM","text":"To proceed with the quest, use the materials provided by Laurisse to craft a high-quality featherlight shortsword."},{"name":"SYSTEM","text":"Should your synthesis efforts prove unsuccessful, speak with Laurisse once more to receive another set of materials."},{"name":"SYSTEM","text":"To begin the crafting process, select <span class=\"highlight\">Logs</span> from the main menu, followed by <span class=\"highlight\">Crafting Log</span>. Next, select <span class=\"highlight\">Special Recipes</span> from within the requisite crafting discipline, then <span class=\"highlight\">Story</span>, and lastly <span class=\"highlight\">Class Quests</span> to locate the desired recipe."},{"name":"FREMONDAIN","text":"As always, I shall be looking forward to seeing your finished product, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"LAURISSE","text":"If you find yourself running low on materials, please let me know. That said, I'm quite curious to see what Sekka will make. She didn't even inquire as to what kind of blade we needed..."},{"name":"LAURISSE","text":"Seeing as the judging will take place at the guild, please deliver the sword to Master Brithael once you are finished."},{"name":"BRITHAEL","text":"Did ye finish? It'd better be nothin' less than perfect, <span class=\"highlight\">Forename</span>. If we lose this, she'll become even more intolerable, and we're as good as doomed."},{"name":"BRITHAEL","text":"Aye. This is as fine a shortsword as any I've seen─real light and easy to handle. The girl hasn't a cat in hells' chance o' winning this. Now, let's bring her and our clients in, shall we?"},{"name":"FREMONDAIN","text":"Both are magnificent weapons but one is head and shoulders above the other. <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, your handiwork never fails to impress me. It would be my honor to wield your blade."},{"name":"SEKKA","text":"B-But why? <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> sword is flimsy and weak compared to mine! Added to that, mine has a superior edge and is much more aesthetically pleasing!"},{"name":"FREMONDAIN","text":"Madam, as you can see for yourself, I am but a frail old man. Yours, while beautiful, is far too heavy for me."},{"name":"LAURISSE","text":"I am no blacksmith but I know enough to say these blades are of a comparable quality in durability and sharpness both. If you were to take into account the needs of the wielder, however, <span class=\"highlight\">Forename</span>'s is far superior."},{"name":"SEKKA","text":"Th-This is not fair! Had our clients been anyone but these two, my sword would have won."},{"name":"BRITHAEL","text":"I understand yer dismayed by the results, but yer words are unbecomin' of an artisan."},{"name":"BRITHAEL","text":"It's our clients who decide if our weapons are worthy of 'em, not the other way around. If ye can't bear defeat with a bit o' dignity, I suggest ye look into changin' professions. Ye'll never grow as a craftsman with that attitude, much less surpass <span class=\"highlight\">Forename</span> here."},{"name":"LAURISSE","text":"If you don't mind, Fremondain and I will be taking <span class=\"highlight\">Forename</span>'s shortsword and leaving, then."},{"name":"SEKKA","text":"...Before you go, please allow me to apologize. It is as Forgemaster Brithael says. I realize now I did not take any of your needs into consideration, and it resulted in me presenting you with an item unworthy of your attention."},{"name":"BRITHAEL","text":"A smitty needs a great range o' skills so that he might tailor his products to accommodate the needs o' the customer. Every task, however borin' or routine, helps to expand this repertoire. If that doesn't suit you, perhaps you should look to other guilds."},{"name":"SEKKA","text":"Forgemaster Brithael, thank you. Your wise words have opened my eyes and allowed me to see the fault in my ways. I am terribly sorry for my earlier behavior. Nothing of the sort will be happening again during the course of my studies here."},{"name":"BRITHAEL","text":"Studies? Here? Surely, ye'd prefer to go elsewhere?"},{"name":"SEKKA","text":"Not at all! I am quite certain whatever those other places have to offer will not even come close to what I can gain by observing <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>."},{"name":"BRITHAEL","text":"By what terrible stroke of fate did she end up at our guild? &lt;sigh&gt; I thought fer sure she'd leave after losin' to ye..."},{"name":"LAURISSE","text":"She certainly is a spirited girl. While her determination to succeed is her greatest strength, it is also currently her greatest weakness. Perhaps if she were to learn to be more receptive to what others had to say, that could change..."},{"name":"BRITHAEL","text":"I'm goin' to have to go an' break the news she'll be stayin' to the other smitties. <span class=\"highlight\">Forename</span>, don't ye go anywhere, ye hear?"},{"name":"SYSTEM","text":"In forging new paths as a blacksmith, you have learned “Quality Assurance”!"}],"reward":{"gil":804,"items":[{"num":250,"id":8},{"id":19518},{"id":19623,"one":1},{"id":19624,"one":1},{"id":19625,"one":1},{"id":19626,"one":1},{"num":5,"id":5825,"one":1}],"xp":1725300},"reqs":{"jobs":[{"lvl":63,"id":10}],"quests":[68129]},"next":[68153]},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1012510","obj":{"i":1012510,"n":"Fremondain","l":28,"q":2}},{"type":"npc","id":"1021042","obj":{"i":1021042,"n":"Sekka","l":28,"q":3}},{"type":"npc","id":"1021043","obj":{"i":1021043,"n":"Laurisse De Jervaint","l":28,"q":1}},{"type":"item","id":"19518","obj":{"i":19518,"n":"High Steel File","l":200,"c":35160,"t":15,"p":28512}},{"type":"item","id":"19623","obj":{"i":19623,"n":"Ruby Cotton Coatee","l":200,"c":43810,"t":35,"p":26136}},{"type":"item","id":"19624","obj":{"i":19624,"n":"Gyuki Leather Gloves of Crafting","l":200,"c":44573,"t":37,"p":15681}},{"type":"item","id":"19625","obj":{"i":19625,"n":"Ruby Cotton Bottoms","l":200,"c":45976,"t":36,"p":26136}},{"type":"item","id":"19626","obj":{"i":19626,"n":"Gyuki Leather Shoes","l":200,"c":46758,"t":38,"p":15681}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17885","obj":{"i":17885,"n":"Shortsword Materials","l":270,"c":20801,"t":63}},{"type":"item","id":"17886","obj":{"i":17886,"n":"Featherlight Shortsword","l":270,"c":30405,"t":63}},{"type":"quest","id":"68129","obj":{"i":68129,"n":"A Missive from the Far East","g":137,"l":"Limsa Lominsa","s":601,"f":1}},{"type":"quest","id":"68153","obj":{"i":68153,"n":"Blood Ties","g":137,"l":"Limsa Lominsa","s":650,"f":1}}]}