{"quest":{"name":"Never Meet Your Heroes","location":"Gridania","id":68156,"patch":4.0,"sort":601,"icon":100694,"unlocksFunction":1,"eventIcon":71341,"issuer":1000815,"target":1021349,"genre":145,"journal":["Fufucha would like to hear what you think of a certain town.","Fufucha asks you out of the blue for your opinion of Idyllshire. After hearing that it is a city where goblins and men live as equals, she states that she has decided to take on a job in the region. She convinces you to join her in this venture and bids you go on ahead while she attends to some other matters.","Upon your arrival in Idyllshire, you are greeted by Edgyth, a self-taught botanist of sorts. After attempting, and failing, to suppress the urge to gush about finally meeting you, her botanical hero, she explains that she seeks to cultivate a unique crop. It is hoped this crop, once created, would allow Idyllshire to trade more widely with its fellow cities.","Edgyth is absolutely thrilled to hear you and Fufucha are willing to help her with this undertaking. Fufucha, filled with renewed enthusiasm, heads back to Gridania to come up with a plan as to how to proceed. Edgyth, upon learning that she was in the presence of the first botanist herself, decides to wait for Fufucha's plan to take shape before taking any further action.<br><br>※The next botanist quest will be available from Edgyth upon reaching level 63."],"objectives":["Speak with Edgyth in Idyllshire.","Speak with Edgyth."],"dialogue":[{"name":"FUFUCHA","text":"Ah, <span class=\"highlight\">Forename</span>, nice to see you once again. There was actually something I had been meaning to ask you: are you familiar with a place named Idyllshire?"},{"name":"FUFUCHA","text":"A town where man and goblin coexist in harmony, you say? Fascinating. I ask because we have just received a request from someone there for our services, and I had been at a loss as to whether or not to accept it."},{"name":"FUFUCHA","text":"However, your words have cleared any fragment of doubt that once dwelled in my mind! You may have heard that those articles in <span class=\"emphasis\">The Raven</span> inspired a great number of would-be botanists to take up the hatchet. While I am grateful for their help, I have had little cause to do any work myself, and I do worry I may have become rusty as a result."},{"name":"FUFUCHA","text":"<span class=\"highlight\">Forename</span>, would it trouble you to accompany me on this job?"},{"name":"FUFUCHA","text":"You handled your previous work in the Sea of Clouds with dedication, and I would certainly feel much more assured working in unfamiliar territory were you by my side. What say you?"},{"name":"FUFUCHA","text":"You have my thanks, <span class=\"highlight\">Forename</span>. My anxiety has given way to boundless excitement─it has been quite some time since I had the chance to study a new area's flora!"},{"name":"FUFUCHA","text":"Let us make our way to Idyllshire! The appeal for our aid came from a lady named Edgyth. She bid we visit her at Greengrub Mudplots should we be willing to help."},{"name":"FUFUCHA","text":"By all means, please go on ahead. I just need to attend to my darling cactus, Senor Sabote─sorry, I meant to say that I shall follow you shortly."},{"name":"EDGYTH","text":"Well met! I'm assuming you were sent by the Botanists' Guild?<br>...Wait. You wouldn't happen to be <span class=\"highlight\">Forename Surname</span>, would you?"},{"name":"EDGYTH","text":"By the Twelve, it <span class=\"emphasis\">is</span> you! I've read all about how you valiantly defied the Holy See, proving that gysahl greens thought to be native to Ishgard actually hail from the Near East! Oh, I feel all tingly just recalling your bravery!"},{"name":"EDGYTH","text":"You are truly an inspiration to botanists the realm over, <span class=\"highlight\">Forename</span>. Oh, how lucky I am that Nophica should see fit to bless me with this, the most precious moment of my life."},{"name":"EDGYTH","text":"My apologies, this is all just so emotional! I can't believe any of it is truly happening. Perhaps if I were to get your signature, I would have proof that..."},{"name":"EDGYTH","text":"No, snap out of it, Edgyth! Remember what happened the last time you were overly forward. Now, where was I? Ah yes, thanking you for making the journey! I must admit, I had been expecting a party of two."},{"name":"FUFUCHA","text":"I see, I see. Admittedly a rather orthodox approach, but the botanist's technique stands up to close inspection."},{"name":"FUFUCHA","text":"And it is precisely this fact that has me perplexed. Based on this evidence, I would say the botanist looking after this area has as good an understanding of nature as anyone in our guild. Why should they want for our help?"},{"name":"EDGYTH","text":"Oh, hello, I didn't see you there! Would you happen to be a friend of <span class=\"highlight\">Forename</span>'s? Thrilled to meet you! To address your query, our problem here has more to do with quantity than quality."},{"name":"FUFUCHA","text":"Quantity? Considering Idyllshire's size, I would not imagine you should struggle to meet demand as things currently stand."},{"name":"EDGYTH","text":"Ah, no, that's not quite what I meant! As you say, there is more than enough here to supply Idyllshire. The real issue is that we wish to branch out and trade with other cities. I suppose it actually concerns both quantity and quality now that I think of it..."},{"name":"EDGYTH","text":"You see, I created Greengrub Mudplots using the seeds of specially cultivated crops made by Sharlayan botanists, but there's only so much an absolute novice such as myself can achieve. I am clueless as to how I can better the quality of these crops."},{"name":"EDGYTH","text":"You see, I created Greengrub Mudplots to contribute to a larger plan that aimed to bring a new kind of industry to Idyllshire. However, there's only so much an absolute novice such as myself can achieve. I am clueless as to how I can better the quality of these crops."},{"name":"FUFUCHA","text":"While I do understand your plight, I would be less inclined to refer to the creator of the Mudplots as an “absolute novice.” Do you not think you are being somewhat overly humble?"},{"name":"EDGYTH","text":"N-Not at all! I'm self-taught after all─how could I be anything but a novice when I was taught by one? My work could never be compared to that of officially recognized botanists such as yourselves."},{"name":"EDGYTH","text":"I had been attempting to cultivate a new kind of crop that could be used for trade. But alas, I am as green as the Mudplots themselves. Nothing I try seems to succeed..."},{"name":"FUFUCHA","text":"And that is why you sought our help. Well, I for one am most inclined to grant you our aid! What say you, <span class=\"highlight\">Forename</span>, are you of a similar mind?"},{"name":"EDGYTH","text":"Are you sure!? You're not just taking pity on me, are you? Frankly, even if you are, I shall accept it! Thank you both so much!"},{"name":"FUFUCHA","text":"This brings to mind that time we both found ourselves in Coerthas, does it not? As I have always said, the botanist's calling is not to control nature, but rather to accept it and nurture it, so that we may mutually benefit from one another."},{"name":"FUFUCHA","text":"I must say, it has been quite some time since anything has had me this eager! I have already collected a sample of the soil here, and should quite like to take it back to the guild. It is time I set about formulating a plan of action!"},{"name":"FUFUCHA","text":"Oh, <span class=\"highlight\">Forename</span>, tell me, what did you think of the Mudplots? Edgyth seems quite promising, does she not?"},{"name":"EDGYTH","text":"Knowing I can count on the guild's help is a great comfort. Although, I would like to know, just who was your knowledgeable companion?"},{"name":"EDGYTH","text":"Wh-Wh-What!? The first botanist herself, Fufucha!? Good heavens, to think she would ever see fit to even lend an ear to my petty problems... I am not worthy."},{"name":"EDGYTH","text":"M-My apologies! I have a habit of getting caught up in my own little world sometimes. At any rate, with you two on my side, I cannot see how we could possibly fail! And, if we somehow do, it will undoubtedly be entirely my fault."},{"name":"EDGYTH","text":"Actually, before you go, would you mind if I asked you something else? Are you the same adventurer that helped the treasure hunters gain access to Saint Mocianne's Arboretum?"},{"name":"EDGYTH","text":"I knew it! Sawney himself regaled me with stories of your bravery! You have my sincerest thanks; without your help, we could never have created the Mudplots."},{"name":"EDGYTH","text":"It's noticeably improved the food supply situation in Idyllshire. Sawney really sums up our gratitude best when he refers to you as Saint <span class=\"highlight\">Forename</span>!"},{"name":"EDGYTH","text":"It's just a shame I'm so bloody useless really. We never stood a chance of cultivating anything worthwhile with just me involved..."},{"name":"EDGYTH","text":"Well, I suppose that's everything for now. I have decided to wait for word from Fufucha instead of making any rash decisions on my own."},{"name":"SYSTEM","text":"The next botanist quest will be available from Edgyth upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1208,"items":[{"num":250,"id":9},{"num":250,"id":12},{"num":3,"id":12668}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":18}],"questsType":"all","quests":[67588,67895]},"next":[68157]},"partials":[{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1021349","obj":{"i":1021349,"n":"Edgyth","l":2082,"q":5}},{"type":"item","id":"12668","obj":{"i":12668,"n":"Commercial Survival Manual","l":1,"c":26152,"t":63}},{"type":"quest","id":"67588","obj":{"i":67588,"n":"Seeds Know No Borders","g":145,"l":"Ishgard","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68157","obj":{"i":68157,"n":"You Say Popoto, I Say...","g":145,"l":"Idyllshire","s":630,"f":1}}]}