{"quest":{"name":"You Say Popoto, I Say...","location":"Idyllshire","id":68157,"patch":4.0,"sort":630,"icon":100694,"unlocksFunction":1,"eventIcon":71341,"issuer":1021349,"target":1021349,"involved":[1000815,1021350,1021351,1021352],"genre":145,"usedItems":[17945],"journal":["Edgyth requires the help of her botanical hero.","Edgyth has received word saying that Fufucha has finished formulating her plan. Hesitant to go alone, as this will be her first trip to Gridania, she asks for you to show her around. You agree to do her the favor and prepare to make your way to the city–state.","You rendezvous with a somewhat overwhelmed Edgyth. This is her first time visiting anywhere with vegetation as lush as Gridania's and her heart is all aflutter. You wait for her to regain her composure before going to speak with Fufucha.","Fufucha explains that she has chosen a somewhat unlikely candidate for this project: the popoto. Confident that they are both suited to Dravania's climate and full of potential, she instructs you and Edgyth to gather some from East End. You ready yourself for the work ahead.","Edgyth mentions that a soldier told her popotoes were once grown in East End. She bids you collect a total of twenty wild popotoes, which she will then take back to the Mudplots.","Edgyth is highly impressed by the speed with which you complete the task she assigned you. She prepares to haul the popotoes back to the Mudplots, making one last self-deprecating remark before setting off.","You return to the Mudplots and hear from Edgyth that everything is in place for you to start planting the wild popotoes. Edgyth is impressed by your masterful technique, remarking she hopes to someday become even half as proficient as you. You are bid farewell and assured by Edgyth that she will take care of the rest of the work under the watchful eye of Fufucha.<br><br>※The next botanist quest will be available from Edgyth upon reaching level 65."],"objectives":["Rendezvous with Edgyth in Gridania.","Speak with Fufucha.","Rendezvous with Edgyth in East End.","<span class=\"alternative-container\"><span class=\"alternative\">Harvest wild popotoes</span><span class=\"alternative\">Deliver the wild popotoes to Edgyth</span></span>.","Speak with Edgyth in Idyllshire."],"dialogue":[{"name":"EDGYTH","text":"<span class=\"highlight\">Forename</span>, <span class=\"highlight\">Forename</span>! I have at long last received word from Fufucha!<br>Ah, just uttering her name gives me such joy..."},{"name":"EDGYTH","text":"But this is hardly the time or place for me to be longing for her exquisite company─that's what every other waking moment is for. No, we need to head to Gridania so that we may actually enjoy her co─I mean, have her brief us on how best to proceed."},{"name":"EDGYTH","text":"Although, as this is my first trip to Gridania, I was wondering if it wouldn't be too much trouble to have you show me around?"},{"name":"EDGYTH","text":"Oh, thank you, <span class=\"highlight\">Forename</span>! You're just as <span class=\"alternative-container\"><span class=\"alternative\">courteous</span><span class=\"alternative\">chivalrous</span></span> as the articles made you sound! I shall see you in Gridania shortly then."},{"name":"FUFUCHA","text":"My understanding was that Edgyth would be coming here shortly. Although, I am still yet to see any sign of her arrival. I do hope she did not get lost somewhere along the way."},{"name":"EDGYTH","text":"That lovely scent in the air, the lush greenery, this truly is the spiritual home of botany! I wonder if there isn't some way I could stay here more permanently..."},{"name":"EDGYTH","text":"There I go daydreaming again! Honestly, Edgyth.<br>Let us make our way to the guild!"},{"name":"EDGYTH","text":"Deep breaths, Edgyth. You're only surrounded by the most nature you've ever seen in your entire life. Perhaps speaking with Fufucha will help calm me down."},{"name":"FUFUCHA","text":"Let us get to the heart of the matter. I suggest that we cultivate a new species of popoto."},{"name":"EDGYTH","text":"P-Popoto? You mean the root vegetable used in soups and pancakes?"},{"name":"FUFUCHA","text":"The very same."},{"name":"FUFUCHA","text":"While the Dravanian hinterlands enjoy more sunlight than most regions, the soil is far from fertile. The area's mountainous terrain and cold climes can also hardly be considered favorable."},{"name":"FUFUCHA","text":"Succinctly put, it is not especially hospitable from a botanic point of view, and it should come as no surprise that any crops planted there would be lacking in quality. However, that is precisely why I propose we put our faith in the sturdy popoto."},{"name":"EDGYTH","text":"But do you not think we would struggle to sell regular popotoes? They're so ubiquitous in Eorzea I can't imagine who would be interested in one grown in Dravania..."},{"name":"FUFUCHA","text":"That would be true if we planned to simply grow the common popoto. However, through selective breeding, we shall give birth to one that is unique to Dravania─one that will come to represent the region."},{"name":"FUFUCHA","text":"<span class=\"highlight\">Forename</span>, I would like you to gather some wild popotoes for me. We shall plant these in the Mudplots and crossbreed them."},{"name":"FUFUCHA","text":"By improving upon popotoes that have already been able to grow in harsh conditions, we might be able to produce one of the toughest root vegetables known to man."},{"name":"FUFUCHA","text":"You have my thanks. I suggest you try searching East End; the area was famed for its popoto production once upon a time."},{"name":"FUFUCHA","text":"The settlement there that used to cultivate the vegetable may be long gone, but I imagine there should still be a few popotoes growing in the area. You certainly stand a much higher chance of finding wild popotoes there than you would aimlessly wandering the realm."},{"name":"EDGYTH","text":"And I shall accompany you, <span class=\"highlight\">Forename</span>! I may not be able to help much with harvesting popotoes, but I'm sure I could be of some use... Perhaps I could clean your boots every now and then?"},{"name":"FUFUCHA","text":"I do not see the harm in Edgyth tagging along. It may even turn out to be quite the learning experience for her! East End is a relatively peaceful area, but I shall let the Order of the Twin Adder know you are coming as a precaution."},{"name":"EDGYTH","text":"Well then, it's settled! I shall go on ahead to scout the area for you."},{"name":"FUFUCHA","text":"I shall take care of the popotoes once they have been planted. I cannot wait to see what you are able to collect; it has been quite some time since a job has gotten me this excited!"},{"name":"EDGYTH","text":"Oh, <span class=\"highlight\">Forename</span>, there you are! I heard from one of the soldiers that this is the area where popotoes used to be grown."},{"name":"EDGYTH","text":"Fufucha told me that we should aim to bring back twenty of them. That should be more than enough. Oh, and don't worry about lugging them back to Idyllshire, that's my job!"},{"name":"EDGYTH","text":"They should be somewhere around here. Let me know once you've managed to gather twenty."},{"name":"EDGYTH","text":"You've f-finished!? I wonder what it's like to be so skilled. Must be nice..."},{"name":"EDGYTH","text":"I may be an inadequate botanist, but I would like to believe I have it in me to haul twenty popotoes as far as the Mudplots. I'll make sure to assist Fufucha in preparing them to be replanted as soon as I arrive."},{"name":"EDGYTH","text":"Your timing is uncanny! We just finished our preparations not a moment ago. Now begins the hard work!"},{"name":"EDGYTH","text":"That was incredible! The finesse with which you planted each individual popoto... Now I know just why Fufucha speaks so highly of you!"},{"name":"EDGYTH","text":"If I could be even half as good as you, I'd die a happy botanist. And there's no better opportunity for me to improve than now, with first-rate botanists mentoring me."},{"name":"EDGYTH","text":"Speaking of which, Fufucha has graciously agreed to help me crossbreed our popotoes and plant the resulting seeds. Truly, her loveliness knows no bounds! I look forward to seeing you again once our work is done."},{"name":"SYSTEM","text":"To be deleted."}],"reward":{"gil":2613,"items":[{"id":19526},{"id":19627,"one":1},{"id":19628,"one":1},{"id":19629,"one":1},{"id":19630,"one":1},{"num":5,"id":5825,"one":1}],"xp":1725300},"reqs":{"jobs":[{"lvl":63,"id":18}],"quests":[68156]},"next":[68158]},"partials":[{"type":"npc","id":"1021349","obj":{"i":1021349,"n":"Edgyth","l":2082,"q":5}},{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1021350","obj":{"i":1021350,"n":"Edgyth","l":52,"q":1}},{"type":"npc","id":"1021351","obj":{"i":1021351,"n":"Edgyth","l":53,"q":4}},{"type":"npc","id":"1021352","obj":{"i":1021352,"n":"Edgyth","l":2406,"q":1}},{"type":"item","id":"19526","obj":{"i":19526,"n":"High Steel Scythe","l":200,"c":38160,"t":31,"p":28512}},{"type":"item","id":"19627","obj":{"i":19627,"n":"Gyuki Leather Hat","l":200,"c":41379,"t":34,"p":15681}},{"type":"item","id":"19628","obj":{"i":19628,"n":"Gyuki Leather Jacket","l":200,"c":42575,"t":35,"p":26136}},{"type":"item","id":"19629","obj":{"i":19629,"n":"Gyuki Leather Gloves of Gathering","l":200,"c":44597,"t":37,"p":15681}},{"type":"item","id":"19630","obj":{"i":19630,"n":"Gyuki Leather Chaps","l":200,"c":47344,"t":36,"p":26136}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17945","obj":{"i":17945,"n":"Wild Popoto","l":270,"c":25204,"t":45}},{"type":"quest","id":"68156","obj":{"i":68156,"n":"Never Meet Your Heroes","g":145,"l":"Gridania","s":601,"f":1}},{"type":"quest","id":"68158","obj":{"i":68158,"n":"Walking for Walker's","g":145,"l":"Idyllshire","s":650,"f":1}}]}