{"quest":{"name":"The Final Face-off","location":"Limsa Lominsa","id":68155,"patch":4.0,"sort":700,"icon":100686,"unlocksFunction":1,"eventIcon":71341,"issuer":1000997,"target":1000997,"involved":[1019050,1021048,1021049,1021050],"genre":137,"usedItems":[17891,17892],"journal":["Forgemaster Brithael has dark circles under his eyes.","Forgemaster Brithael, while far from enthusiastic about the prospect, tells you he shall be accompanying you to Kugane. He would like to learn what has become of the deal he and Sekka struck to trade forge secrets. Urging that you go on ahead of him, he tells you he will be joining you there. Travel to Kugane and speak with Sekka.","Sekka is waiting for you by the port to welcome you to Kugane. After exchanging greetings, she asks that you make your way to Kokajiya, where her father waits to apprise you of the details of your competition.","Shinto informs you that one of Kugane's samurai lords is looking to have uchigatana made for his vassals and has inquired as to whether his forge would be willing to produce them. Before putting in an official request, however, the lord would first like to assess the quality of Shinto's blades and has asked to be provided with a sample. The elderly swordsmith tells you that you and Sekka will be competing to see who can forge the better uchigatana, which will then be presented before this honored client. Satisfied you have been apprised of all you need to know, Shinto would have you return to Pier #2 and, alongside his daughter, wait for Forgemaster Brithael to arrive.","Sekka is acting unusually coy and states that she has been confused by some of the things she has been feeling of late. She discloses that she cannot stop thinking about Forgemaster Brithael and every time he comes near, her heart begins to race and heat rises to her cheeks. While the both of you have an inkling of what this emotion might be, before you can come to a solid conclusion, your guildmaster arrives. After a quick exchange of greetings, Sekka excuses herself and the ex-pirate turns to you, saying he has brought with him all the supplies necessary for you to craft your uchigatana. Imparting some advice, he urges you to get started. Forge a high-quality examination uchigatana and deliver the finished product to Shinto at Kokajiya.<br><br>※In the event you lose the materials or the synthesis ends in failure, you may try again by speaking with Brithael.","Shinto is impressed by not only the sharpness of your uchigatana, but also the intricate detailing on the hilt. His face darkens, however, when he turns his attention to the poorly crafted blade that Sekka has produced. When she explains that she made it dull and lightweight that she might cater to the needs of the majority of the lord's vassals who are not trained to use regular katana, her father is somewhat mollified. While it is clear Sekka is by no means the winner, Shinto decides that in attempting to forge something designed to suit the needs of the client, she is ready to become his apprentice. Celebrations are cut short, however, when the conversation takes an unexpected swerve and Sekka confesses her love for Brithael. Shinto is far from pleased by this and, seeing that, the guildmaster mumbles a hasty excuse before scuttling away.","After a quick word of congratulations on winning the competition, Shinto tells you he will be sending a letter to your guildmaster regarding their agreement to exchange forging techniques. Bidding you return to Eorzea for fear that Forgemaster Brithael anxiously awaits your return, you part ways with father and daughter. Make your way back to the Blacksmiths' Guild and inform your guildmaster of all that happened in Kugane subsequent to his departure.","Forgemaster Brithael tells you of how shortly after he returned, he received a letter from Shinto regarding the agreement he and Sekka made. Despite the not-so-subtle threats sprinkled throughout the letter, the elderly man seemed quite enthusiastic about the idea of trading forge secrets. Randwulf joins you not shortly after, with a letter the size and length of a short novel in hand. Telling Brithael it is addressed to him and is from Sekka, the forgemaster does not look pleased. In fact, he appears to be the slightest shade of green."],"objectives":["Speak with Sekka in Kugane.","Speak with Shinto in Kokajiya.","Speak with Sekka.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize an examination uchigatana <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the examination uchigatana <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Shinto</span></span>.","Speak with Shinto.","Report to Brithael."],"dialogue":[{"name":"BRITHAEL","text":"Kept ye waitin' have I? Apologies. Seems I had meself one too many pints o' ale last night."},{"name":"BRITHAEL","text":"Don't worry─that's not goin' to keep me from travelin' with ye to the Far East. After all, Sekka and her father still owe us a few trade secrets, and I have to see that they uphold their end of our bargain."},{"name":"BRITHAEL","text":"I can't shake the feelin' that unless she wins, they'll try an' weasel their way out o' it. Well, I suppose that's just a bridge we'll have to cross when we come to it."},{"name":"BRITHAEL","text":"Fer now let's focus on makin' it to Kugane in time for the match. It's goin' to be a lot harder than it sounds─me head's poundin' and me stomach's churnin'. I don't think I've ever been so unenthused by the idea o' leavin' Eorzea fer distant lands..."},{"name":"BRITHAEL","text":"I'm goin' to have to take a moment to recuperate, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, so ye go on ahead o' me. I won't be too long─ye have me word."},{"name":"BRITHAEL","text":"Seein' as yer goin' ahead o' me, ye best speak with Sekka when ye arrive in Kugane. Don't gimme that look. This ain't some ploy for me to slither out o' goin', though I'll admit the thought did cross me mind."},{"name":"SHINTOU","text":"I sent Sekka to collect you. Was she not at the pier?"},{"name":"SEKKA","text":"Welcome to Kugane, <span class=\"highlight\">Forename</span>. We received notice earlier that Forgemaster Brithael left shortly after you. I imagine he should be joining us soon."},{"name":"SEKKA","text":"I feel like a totally different person to when I was last here. Where before I would buckle under the pressure of my father's unwavering gaze, lately I have not felt fazed by it in the slightest."},{"name":"SEKKA","text":"Oh, but my apologies! I got off track again. Speaking of my father, he has asked that you meet him at Kokajiya─where craftsmen from the poorest to the finest gather in Kugane. There, he will apprise you of the details of our upcoming match. I shall remain here to collect Forgemaster Brithael."},{"name":"BRITHAEL","text":"Now that everyone we need has been assembled, what do ye say we get started?"},{"name":"SEKKA","text":"My father awaits you at Kokajiya. Please find your way there."},{"name":"SHINTOU","text":"<span class=\"highlight\">Forename</span>, you have come. Very good. Now without any further ado, allow me to explain what it is I would have you do."},{"name":"SHINTOU","text":"You and Sekka are to each forge an uchigatana."},{"name":"SHINTOU","text":"These blades are to be shown to one of the greatest samurai families in Kugane. Their lord is interested in having my forge provide his retainers with katana. Before he officially entrusts me with this task, however, he asks that I provide him with a sample."},{"name":"SHINTOU","text":"The two of you will be competing to see which of your uchigatana I would present before him."},{"name":"SHINTOU","text":"Oh, and one last thing. My daughter─she mentioned to me earlier that in exchange for studying at your guild, she promised to share with Master Brithael the techniques we employ here at my forge."},{"name":"SHINTOU","text":"Her skills have grown exponentially under your care and I have every intention of upholding that agreement. But should you give any less than your best in the contest─and I know full well what you are capable of─consider our deal broken."},{"name":"SHINTOU","text":"If you have any questions, now would be the time to speak up. No? Excellent. In that case, I suggest you go and join Sekka at Pier 2. Your guildmaster will be arriving shortly."},{"name":"SHINTOU","text":"Sekka...&lt;mumble&gt;...far less skittish...&lt;mumble&gt;...Eorzea. Perhaps─ What are you still doing here? Instead of creeping about, I suggest you go and collect your forgemaster."},{"name":"SEKKA","text":"Um─er... Sorry, <span class=\"highlight\">Forename</span>. D-Do you have a moment? There is something I want to ask you before your guildmaster arrives."},{"name":"SEKKA","text":"You see, every time Forgemaster Brithael comes near, my heart feels like it will explode and stop beating at the same time. Sometimes it is so painful, I can scarcely breathe."},{"name":"SEKKA","text":"At first I saw him as a dull and uninspired man. But then, when he so courageously defended my dreams and refused to back down even in the face of my father's fury, I realized I had misjudged him. In that moment something inside me shifted."},{"name":"SEKKA","text":"Now I cannot get his face out of my head and I feel an inexplicable urge to be near him. I-I just do not understand. You supported me in my journey just the same, so why is it I do not also feel this way about you...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Because you're in love with him."},{"name":"A1","text":"I don't have a clue."},{"name":"SEKKA","text":"In love? W-With Forgemaster Brithael? That is absurd! The only love I hold is for the art of swordsmithing. There is no room for anything or anyone else in my life."},{"name":"SEKKA","text":"&lt;sigh&gt; I expected as much. I suppose there is no way for you to know unless you could somehow see inside my head. I have a sneaking suspicion of what it might be but... Ah, never mind. It is far too absurd."},{"name":"SEKKA","text":"Ack! But what am I doing? Now is not the time for me to be asking silly questions. I need to prepare for what is arguably the most important moment in my career. Perhaps once this competition is over, we can revisit this conversation."},{"name":"BRITHAEL","text":"What's this? Me own personal welcomin' committee come to escort me ashore? ...What's wrong, lass? Yer red as a beet."},{"name":"SEKKA","text":"Wh-What are you talking about? M-My face is not red! Even if it is, it is only because I am so excited about my victory which looms on the horizon. Hmph."},{"name":"BRITHAEL","text":"Er... All right, then."},{"name":"SEKKA","text":"You will see─I am going to win. I have come a long way from when I first started. My travels to Eorzea, my studies at your guild, and the new tools the two of you made for me─they relit a fire in my soul. They reminded me of how much I love making katana."},{"name":"SEKKA","text":"This competition is a once-in-a-lifetime opportunity for me to seize my destiny. I will prove to Father that I am worthy of studying under him."},{"name":"BRITHAEL","text":"That girl is filled with an unrelentin' passion fer her craft, and she'll make a formidable opponent in the upcomin' match. Has Shinto divulged any o' the details to ye yet?"},{"name":"BRITHAEL","text":"An uchigatana to be presented to one of the samurai families, eh? It goes without sayin' that the first thing they'll be lookin' at is the sharpness of the blade. Ye'll also want a simple but elegant design fer the hilt."},{"name":"BRITHAEL","text":"...But ye already knew that didn't ye? I always forget ye've outgrown me advice. Now, I've brought with me all the materials ye might need. Here."},{"name":"BRITHAEL","text":"Once yer done, take the uchigatana to the girl's father. Good luck <span class=\"highlight\">Forename</span>, and remember, if ye need anythin', I'll be here."},{"name":"BRITHAEL","text":"Ye need more materials? While these supplies ain't exactly what ye'd call cheap, this is also a good opportunity for ye─and me─to have an expert swordsmith look over yer work. Here, take these."},{"name":"BRITHAEL","text":"Seems ye've done it, <span class=\"highlight\">Forename</span>─this blade's a beauty! Haha! The stoic ol' man's mask of indifference is bound to crack when he sees this!"},{"name":"SHINTOU","text":"You have finished your uchigatana?"},{"name":"SHINTOU","text":"Very good. Sekka is still working on hers, so I shall hold off on all critiques until she presents me with her blade."},{"name":"SHINTOU","text":"<span class=\"highlight\">Forename</span>, this is beautiful... The radiance of this blade alone might be enough to repel the tides of chaos. In addition to that, it is so sharp, it could cleave even a fine thread of hair in half."},{"name":"SHINTOU","text":"The sheath and the hilt have been done to perfection. This blade is fit to be worn at the hip of a great samurai."},{"name":"SHINTOU","text":"And beside this brilliant uchigatana is... What is this? Sekka, it seems you have decided not to take this competition seriously."},{"name":"SEKKA","text":"To the contrary. I expended every last onze of my skill and strength to create this. Please, see for yourself. Take it into your hand and test it out."},{"name":"SHINTOU","text":"By the kami... Sekka, explain yourself."},{"name":"SEKKA","text":"We were asked to make weapons for retainers, but not all of them can use weapons. Heavier blades may cut better, but they'd be useless in the hands of the untrained."},{"name":"SEKKA","text":"These lighter substitutes, however, can be handled by even the clumsiest of servants."},{"name":"SHINTOU","text":"Even so, the reduced weight has come at the expense of the blade's overall quality."},{"name":"SHINTOU","text":"While you are not wrong in assuming that a great majority of a lord's vassals are not adept at using katana, you were asked to forge a sample sword intended for one of his samurai."},{"name":"SHINTOU","text":"It does not take an expert to see that <span class=\"highlight\">Forename</span>'s blade is far superior to yours not only in utility but also aesthetically. This is what I will be presenting to the samurai house."},{"name":"SHINTOU","text":"...I will say, however, that taking a client's needs and physical limitations into consideration is a necessary part of our craft. Next time, be sure to consult me before jumping to your own conclusions."},{"name":"SEKKA","text":"N-Next time? So that means..."},{"name":"SHINTOU","text":"Where before you were pounding your hammer in a single-minded desperation to gain my favor, now you are no longer blind. You have shown extraordinary progress as a swordsmith, and I believe you are finally ready to begin your studies under me."},{"name":"BRITHAEL","text":"Did ye hear that, lass? Sounds to me yer dreams are about to become a reality."},{"name":"SEKKA","text":"Indeed, and I owe that in large part to you. Thank you, Forgemaster Brithael. Without your guidance, I would not have been able to make it this far. You have been a great inspiration to me in more ways than you can imagine."},{"name":"SEKKA","text":"I spent this entire time trying to convince myself this strange pressure I felt in my chest was due to the competition. Now that I have been accepted as my father's apprentice, however, I can deny it no longer."},{"name":"SEKKA","text":"Forgemaster Brithael, I think I am in love with you."},{"name":"BRITHAEL","text":"P-Pardon me?"},{"name":"SHINTOU","text":"Master Brithael, what exactly is the meaning of this? I thought my daughter was accepted into your guild that you might exchange blacksmithing techniques, not vows."},{"name":"BRITHAEL","text":"I-I, er... My apologies but somethin' rather pressin' just came up and it requires my immediate attention. <span class=\"highlight\">Forename</span>, I'll see ye back at the guild."},{"name":"SEKKA","text":"I had not realized he was so shy. It almost makes him even more endearing..."},{"name":"SEKKA","text":"It is so clear to me now. I <span class=\"emphasis\">love</span> him, <span class=\"highlight\">Forename</span>. I really, really love him."},{"name":"SHINTOU","text":"Congratulations, <span class=\"highlight\">Forename</span>. You have won the challenge. It seems there is a great deal we can learn from you and your guild."},{"name":"SHINTOU","text":"That reminds me─while Sekka herself is still not in a place to take on such responsibility, I have every intention of seeing that our end of the agreement she struck is upheld. We look forward to exchanging smithing techniques with your forge."},{"name":"SEKKA","text":"My father is right. For now I must focus solely on improving my skills. The uchigatana I made for this competition was meant to be forged in the likeness of the lightweight shortswords manufactured at your guild. It, however, turned out far inferior."},{"name":"SEKKA","text":"I shall train unrelentingly. Perhaps one day when I refine my skills to a point where I am worthy of being called a master swordsmith, I can then take on this duty and thus reignite the romantic spark between me and Forgemaster Brithael."},{"name":"SEKKA","text":"In the meantime, I shall keep my feelings for him sealed tightly away. I only hope that as the days and months go by he will not forget my love."},{"name":"SEKKA","text":"Thank you for everything, <span class=\"highlight\">Forename</span>. You are a wonderful person and an even better blacksmith. I won't be forgetting you any time soon."},{"name":"SHINTOU","text":"Yes, it is as my daughter says. You have won our respect and our gratitude. Had it not been for you, Sekka would not have grown as she has. That said, I suppose this is where we part ways. I am sure that lecher of a forgemaster is anxious to have you back."},{"name":"SHINTOU","text":"While your forgemaster may be something of a philanderer, I have no intention of going back on my word to start up an exchange between your guild and mine. Worry not, I shall be sending word with one of my men soon."},{"name":"BRITHAEL","text":"My apologies for havin' to leave ye so abruptly back there, but by the look on the ol' man's face I reckoned I'd overstayed me welcome."},{"name":"BRITHAEL","text":"That's why ye could imagine me surprise when Randwulf walked in with a letter from that very same man. While the whole thing was, o' course, peppered with subtle threats, he seemed to be just as enthusiastic about the idea of tradin' smithin' techniques with our guild as I am."},{"name":"RANDWULF","text":"Sir, I've just received another missive for ye. Says here it's from Sekka. I'm not sure what it's for, but it must be important. It's nearly the size an' length of <span class=\"emphasis\">New Eorzean Geographic</span>."},{"name":"BRITHAEL","text":"&lt;sigh&gt; An' there I thought once I retired from sailin' the seas, I'd be able to live out the rest o' me days in peace..."},{"name":"SYSTEM","text":"In forging new paths into Far Eastern swordsmithing, you have learned, “Stroke of Genius”!"}],"reward":{"items":[{"id":5703},{"id":5708},{"id":5713}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":10}],"quests":[68154]}},"partials":[{"type":"npc","id":"1000997","obj":{"i":1000997,"n":"Brithael","l":28,"q":21,"t":"Guildmaster"}},{"type":"npc","id":"1019050","obj":{"i":1019050,"n":"Shinto","l":2404,"q":1}},{"type":"npc","id":"1021048","obj":{"i":1021048,"n":"Sekka","l":2404,"q":1}},{"type":"npc","id":"1021049","obj":{"i":1021049,"n":"Sekka","l":2404,"q":1}},{"type":"npc","id":"1021050","obj":{"i":1021050,"n":"Brithael","l":2404,"q":1}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"17891","obj":{"i":17891,"n":"Uchigatana Materials","l":290,"c":20804,"t":63}},{"type":"item","id":"17892","obj":{"i":17892,"n":"Examination Uchigatana","l":290,"c":26108,"t":63}},{"type":"quest","id":"68154","obj":{"i":68154,"n":"The Missing Piece","g":137,"l":"Limsa Lominsa","s":680,"f":1}}]}