{"quest":{"name":"Walking for Walker's","location":"Idyllshire","id":68158,"patch":4.0,"sort":650,"icon":100694,"unlocksFunction":1,"eventIcon":71341,"issuer":1021349,"target":1021349,"involved":[1000815,1002657,1002659,1019064,1019065,1019233,1021351,1021353],"genre":145,"usedItems":[17946],"journal":["Edgyth is struggling to remember the way to Gridania.","Inspecting the Mudplots, you see that work on the popotoes has been progressing smoothly. Edgyth greets you by mentioning that Fufucha has requested you pay a visit to the guild in order to discuss your next job. Convinced that she remembers the way, Edgyth hurries off before you have a chance to object to her going alone.","Upon your arrival, Fufucha explains that she would like you to collect a new variety of popoto: the Walker's popoto. She hopes that crossbreeding the Walker's popoto with the popotoes being grown at the Mudplots will result in a new species that will stand out from other varieties. You head to Red Rooster Stead, one of the few places known to have cultivated Walker's popotoes once upon a time.","You speak with a few farmers and soon learn that the popotoes of your heart's desire have not been grown there since the Calamity. One farmer mentions that they were quite popular in the Far East, noting the Stead used to frequently export Walker's popotoes to the region.","Edgyth is down in the dumps yet again as she was unable to find out anything of use, although you soon cheer her up by relaying your newly obtained information. She decides to entrust you with searching for the elusive vegetable in Kugane, as Edgyth needs to stay back and tend to the Mudplots. You ready yourself for yet another long journey in the name of botany.","Asking around Kugane, you soon learn that Walker's popotoes have been somewhat hard to come by of late. However, one of the local merchants is able to point you in the direction of his former supplier, Hikinami, who is thought to reside in the small village of Isari. Your seemingly never-ending journey continues as you make your way towards your next destination.","At last, you find your man, only for him to tell you that he too has long since given up growing Walker's popotoes. Helpfully, he points you in the direction of where his farm used to lie, suggesting that there may still be a few popotoes growing there in the wild. Desperately clinging to this last slim thread of hope, you venture north to Hikinami's former farm.","You return from your long journey with your haul of Walker's popotoes in tow. After you have finished replanting them all, Edgyth is greeted by Sawney, the owner of the Mudplots. He asks you to try and help boost her self-confidence, before she entirely destroys what little is left of it. After Sawney takes his leave, Edgyth tells you that you would be best to return to the Mudplots once the popotoes have been successfully crossbred.<br><br>※The next botanist quest will be available from Edgyth upon reaching level 68."],"objectives":["Speak with Fufucha.","Gather information at the Red Rooster Stead.","Speak with Edgyth.","Gather information in Kugane.","Speak with Hikinami in Isari.","<span class=\"alternative-container\"><span class=\"alternative\">Harvest Walker's popotoes by the East Othard Coastline</span><span class=\"alternative\">Deliver the Walker's popotoes to Edgyth in Idyllshire</span></span>."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Tide Goes in, Imperials Go Out.”"},{"name":"EDGYTH","text":"<span class=\"highlight\">Forename</span>! The popotoes are coming along very nicely."},{"name":"EDGYTH","text":"However, we're not quite there just yet! Fufucha has sent word asking us to visit the guild to discuss crossbreeding in further detail. Do you have the time to accompany me there once more? "},{"name":"EDGYTH","text":"Fantastic! Let us rendezvous in front of the guild as usual. I'm keen to try making my own way there this time!"},{"name":"EDGYTH","text":"Did I have trouble finding my way here, you ask? Don't be silly, <span class=\"highlight\">Forename</span>! What kind of numbskull would forget the way and get lost seven separate times, I ask you?"},{"name":"FUFUCHA","text":"Nice to see you both got my message. The wild popotoes you collected for me have taken quite well and work is progressing at a healthy pace."},{"name":"FUFUCHA","text":"However, while I have succeeded in harnessing the wild specimen's hardiness, I have been unable to incorporate any element that would set our popotoes apart from the rest."},{"name":"EDGYTH","text":"I believe in you, Fufucha! If anyone is capable of making a success of this, it's you!"},{"name":"FUFUCHA","text":"Thank you for your faith, Edgyth. It is most touching. As it happens, I do indeed have an idea. I have heard stories of a popoto species known as Walker's popoto that was once cultivated upon the island of Vylbrand. It is said to be a variety that retains its shape when boiled, making it perfect for stews."},{"name":"FUFUCHA","text":"Crossbreeding our existing popotoes with this variety may well give us that special something we need to make ours stand out."},{"name":"EDGYTH","text":"Say no more! <span class=\"highlight\">Forename</span> and I shall gather all the Walker's popotoes you need!"},{"name":"FUFUCHA","text":"You catch on quick, Edgyth. From what I understand, they used to be grown at the Red Rooster Stead. Try asking around there to see if someone cannot point you in the right direction."},{"name":"EDGYTH","text":"Asking people questions is one of the few things I'm good at! Let's go, <span class=\"highlight\">Forename</span>, I have a good feeling about this!"},{"name":"FUFUCHA","text":"As with the previous batch, I shall look after the Walker's popotoes once they have been replanted."},{"name":"EDGYTH","text":"H-Hello gents, would you happen to know anything about Walker's popotoes? I don't suppose you have any in that box, do you?"},{"name":"ARENLONA","text":"Walker's popotoes? That's a name I've not heard in a while. I'm afraid you're far too late, we haven't cultivated those since the Calamity. I cannot say I miss them either, they were so susceptible to both disease and the cold, it was always an uphill battle."},{"name":"ARENLONA","text":"You won't find any in storage either, in case you were getting your hopes up. We threw the last of them out long, long ago. I've never heard of anyone else volunteering to grow them since. Sorry I couldn't be of any help."},{"name":"MOEGRAMM","text":"Ah, yes, Walker's popotoes. We were always shipping them off to the Far East─those Hingans go mad for a good Walker's popoto."},{"name":"MOEGRAMM","text":"We haven't grown any for quite some time. But it wouldn't surprise me if someone over there had gotten tired of waiting for us to resume growing them and started cultivating their own."},{"name":"ARENLONA","text":"As I said, I don't imagine we'll be growing that variety again any time soon. Good luck with your search all the same."},{"name":"MOEGRAMM","text":"I remember one time when a single merchant from over there ordered a dozen crates of Walker's popotoes. He claimed they were for “personal use,” whatever that means."},{"name":"EDGYTH","text":"Oh, hello there, <span class=\"highlight\">Forename</span>... My apologies, I wasn't much good at gathering information after all. I suppose that's one more thing we can add to the list of jobs I can't be trusted with..."},{"name":"EDGYTH","text":"What's that? There's a chance we may find Walker's popotoes in the Far East?"},{"name":"EDGYTH","text":"Well then, the best of luck on your journey to Kugane!"},{"name":"EDGYTH","text":"I know I really ought to accompany you, but visiting Gridania alone was enough to put my head in a spin. I'm not sure I could handle an entirely different continent! It also wouldn't do for me to leave my darling plants on their own for such a long time."},{"name":"EDGYTH","text":"But do not fear, I will see to it that everything is in place for you to plant the popotoes upon your triumphant return!"},{"name":"EDGYTH","text":"You're much better at gathering information than I could ever hope to be; I'm sure you'll do just fine!"},{"name":"IBARA","text":"Walker's popotoes? I cannot say I have ever sold them in my shop. I do feel I may have heard of them being grown in Isari on the mainland, mind you. It might be worth your while paying the village a visit."},{"name":"YAMABUKI","text":"Ah, Walker's popotoes! A tastier popoto I have never stocked─in fact, I am completely out of them right now as it happens. I have not seen my supplier for quite some time."},{"name":"YAMABUKI","text":"I am fairly certain his name was Hikinami. I lost contact with him when things began to get a little rough on the Ruby Sea."},{"name":"IBARA","text":"You will have better luck searching for the popotoes in and around Isari than you will here, friend. Now please go somewhere else. You are getting in the way of business!"},{"name":"YAMABUKI","text":"I do hope all is well with Hikinami. It would be such a shame if he vanished along with all those scrumptious popotoes."},{"name":"HIKINAMI","text":"Yes, I am Hikinami. I used to cultivate Walker's popotoes a little to the north of the village, but that came to an end when my workers declined in number and there were not enough hands to help with the harvest. I have long since handed the field back to nature."},{"name":"HIKINAMI","text":"If you are in luck, there may still be some growing in the wild in that same area. I no longer have any use for them, feel free to take anything you find."},{"name":"HIKINAMI","text":"How did the saying go? What is one man's junk is another man's popoto?"},{"name":"EDGYTH","text":"<span class=\"highlight\">Forename</span>, delighted to see you have returned safe and sound! Was the Spinner on your side?"},{"name":"EDGYTH","text":"So <span class=\"emphasis\">this</span> is the much-sought-after Walker's popoto! Ah yes, upon closer inspection, it certainly has a different hue compared to the common popoto. Well then, all that remains is to replant them."},{"name":"EDGYTH","text":"That hardly took any time at all! And you pretty much did it all by yourself. I'm truly beginning to wonder if I shouldn't just entrust the Mudplots to your much-more-capable hands, <span class=\"highlight\">Forename</span>."},{"name":"SAWNEY","text":"Ha ha! Looks like you're enjoyin' yourself, Edgyth!"},{"name":"EDGYTH","text":"Sawney! Whatever brings you here?"},{"name":"SAWNEY","text":"Well, you know, I thought it'd be good of me to check on how things are going from time to time. I'm no good with a hatchet, that's for sure, but I am your boss in name at least."},{"name":"SAWNEY","text":"Ah, <span class=\"highlight\">Forename</span>, it's been too long! Hope you like what we did with the “treasure.” Must say though, I never dreamed you'd turn out to be a first-rate botanist!"},{"name":"SAWNEY","text":"Makes me wonder what other secrets you're hidin' from us. Don't suppose you'd happen to be a first-rate culinarian, would you?"},{"name":"SAWNEY","text":"Much obliged to make your acquaintance, the name's Sawney. I'm in charge of Greengrub Mudplots, although, as you've doubtless worked out, Edgyth does all the real work around here."},{"name":"SAWNEY","text":"Speakin' of which, how're things comin' along?"},{"name":"EDGYTH","text":"Quite well! Entirely thanks to <span class=\"highlight\">Forename</span> here, admittedly. But, well, you know better than most how useless I am..."},{"name":"SAWNEY","text":"Listen, Edgyth. I've no problem with a bit of humility, but you're well on your way to beatin' your self-confidence to a bloody pulp. Have you already forgotten just who it was that created this place?"},{"name":"EDGYTH","text":"B-But just look how crooked some of the plants are growing... And the leaves on that tree aren't as green as they should be..."},{"name":"SAWNEY","text":"Honestly, when are you goin' to learn to stop bein' so harsh on yourself? Strivin' for improvement is one thing, but there's no point comparin' yourself to the best botanist in the bleedin' realm."},{"name":"SAWNEY","text":"Sorry for all of this. She might not belong to the Botanists' Guild like you, but she's a lot better than she dares give herself credit for. I reckon she'd give guild veterans a good run for their money even."},{"name":"SAWNEY","text":"I'd really appreciate it if you'd give her a little praise every now and then. Only when she's deserving of it, of course. Here's hopin' that picks her spirits up a bit."},{"name":"EDGYTH","text":"Oh, Sawney. He truly is far too kind to me."},{"name":"EDGYTH","text":"All I ever wanted as a child was to someday be a botanist. I was ready to spend my every waking moment studying for that one goal... But it wasn't to be."},{"name":"EDGYTH","text":"My family died when I was still little, leaving me to fend for myself. It was all I could do to survive, and there was no room for dreams."},{"name":"EDGYTH","text":"It was when I was on the verge of giving up that I met Sawney. He gave my life some semblance of order amongst all the chaos. This allowed me to pick up the fragments of my dream and finally begin studying botany; I never thought that all that studying would actually serve a purpose someday."},{"name":"EDGYTH","text":"But that's enough about boring old me! Seeing Sawney again for the first time in a while brought back memories of the past─memories I'm sure you don't need to hear any more about."},{"name":"EDGYTH","text":"As for the work at hand, there's not a whole lot we can do until the crossbreeding is complete. I'm sure you must be tired from your travels to the Far East; by all means have a rest and stop by again in the near future!"},{"name":"SYSTEM","text":"To be deleted."}],"reward":{"gil":4409,"items":[{"id":19536},{"id":19637,"one":1},{"id":19638,"one":1},{"id":19639,"one":1},{"id":19640,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":18}],"quests":[68157]},"next":[68159]},"partials":[{"type":"npc","id":"1021349","obj":{"i":1021349,"n":"Edgyth","l":2082,"q":5}},{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1002657","obj":{"i":1002657,"n":"Moegramm","l":31,"q":4}},{"type":"npc","id":"1002659","obj":{"i":1002659,"n":"Arenlona","l":31,"q":4}},{"type":"npc","id":"1019064","obj":{"i":1019064,"n":"Ibara","l":2404,"q":2}},{"type":"npc","id":"1019065","obj":{"i":1019065,"n":"Yamabuki","l":2404,"q":2}},{"type":"npc","id":"1019233","obj":{"i":1019233,"n":"Hikinami","l":2409,"q":1}},{"type":"npc","id":"1021351","obj":{"i":1021351,"n":"Edgyth","l":53,"q":4}},{"type":"npc","id":"1021353","obj":{"i":1021353,"n":"Edgyth","l":31,"q":1}},{"type":"item","id":"19536","obj":{"i":19536,"n":"Doman Iron Hatchet","l":220,"c":38122,"t":30,"p":31363}},{"type":"item","id":"19637","obj":{"i":19637,"n":"Tigerskin Cap of Gathering","l":220,"c":41390,"t":34,"p":17249}},{"type":"item","id":"19638","obj":{"i":19638,"n":"Kudzu Coat of Gathering","l":220,"c":43811,"t":35,"p":28749}},{"type":"item","id":"19639","obj":{"i":19639,"n":"Tigerskin Fingerless Gloves of Gathering","l":220,"c":44572,"t":37,"p":17249}},{"type":"item","id":"19640","obj":{"i":19640,"n":"Kudzu Culottes of Gathering","l":220,"c":45972,"t":36,"p":28749}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17946","obj":{"i":17946,"n":"Walker's Popoto","l":276,"c":25221,"t":45}},{"type":"quest","id":"68157","obj":{"i":68157,"n":"You Say Popoto, I Say...","g":145,"l":"Idyllshire","s":630,"f":1}},{"type":"quest","id":"68159","obj":{"i":68159,"n":"The White Death","g":145,"l":"Idyllshire","s":680,"f":1}}]}