{"quest":{"name":"The White Death","location":"Idyllshire","id":68159,"patch":4.0,"sort":680,"icon":100694,"unlocksFunction":1,"eventIcon":71341,"issuer":1021349,"target":1021349,"involved":[1000815,1017106,1021351],"genre":145,"usedItems":[17947],"journal":["Edgyth is looking bereft of confidence as usual.","You find Edgyth looking rather more down in the dumps than usual. The reason for her mood soon becomes apparent, as she explains that the entire first generation of crossbred popotoes has recently withered. The two of you prepare to head to Gridania in order to consult Fufucha regarding this unforeseen predicament.","Speaking with Fufucha, you learn that even the guild's botanists have been stumped by Edgyth's problems. As no one else is seemingly capable of getting to the root of the issue, Fufucha asks for you to examine the plants with a fresh pair of eyes. You set off on the trip back to Idyllshire with your new mission in mind.","Upon examining the Mudplots' fields, you notice a strange white speck amongst the plant life. You decide this calls for further inspection and go in closer for a second look.","Your hunch proves well founded as you discover a chalky stone. Unable to discern exactly what it could be, you elect to hand it over to Edgyth.","Edgyth seems to have worked out the stone's identity, before immediately doubting herself, as she is wont to do. You talk some sense to her and, after regaining her composure, she bids you head to Stickqix's Bangpots in order to have Goldwox there create a reagent. Edgyth says this holds the key to identifying the blight affecting the popotoes.","You hand Edgyth's order to Goldwox. The goblin girl informs you that while she can make the reagent you require, she first needs you to bring her twenty clumps of nanoriso. You prepare to embark on a long journey to the Rasen Kaikyo by the Ruby Sea in search of this exotic plant.","You return to the Bangpots, weary from your travels, and furnish Goldwox with her requested nanoriso. She is at last able to synthesize a reagent for you, which you gladly accept. The object you came for in hand, you begin the trip back to Greengrub Mudplots, hoping to finally solve the mystery behind the problematic popotoes.","After applying the reagent, it becomes apparent the menace that has laid waste to the popotoes is none other than an eelworm. The stones you discovered were in fact the creature's eggs, which Sawney theorizes hatched in the Mudplots fairly recently. Upon learning all of this, Fufucha asks for some time to allow her to invent a plan to tackle the eelworm threat.<br><br>※The next botanist quest will be available from Edgyth upon reaching level 70."],"objectives":["Speak with Fufucha in Gridania.","Investigate the specified location in Idyllshire.","Investigate the plot once more.","Present the chalky stone to Edgyth.","Present Edgyth's order to Goldwox.","<span class=\"alternative-container\"><span class=\"alternative\">Harvest nanoriso by the Rasen Kaikyo</span><span class=\"alternative\">Deliver the nanoriso to Goldwox in Idyllshire</span></span>.","Deliver the reagent to Edgyth."],"dialogue":[{"name":"EDGYTH","text":"Ah, <span class=\"highlight\">Forename</span>. I don't imagine you were expecting good news, considering my involvement, but I have once again managed to make a mess of everything."},{"name":"EDGYTH","text":"While the first generation of crossbred popoto plants successfully sprouted, every single one of them withered frightfully fast. I imagine it's down to some kind of disease, but an amateur such as myself could never hope to identify such a thing."},{"name":"EDGYTH","text":"Fufucha has once again summoned us to the guild to discuss this latest development. I shall see you there."},{"name":"EDGYTH","text":"Nice to see you again, <span class=\"highlight\">Forename</span>. I don't know why you're talking with me when Fufucha is right there... &lt;sigh&gt;"},{"name":"FUFUCHA","text":"Welcome back from your journey to the Far East, <span class=\"highlight\">Forename</span>. I assume Edgyth has already informed you of our worrying predicament?"},{"name":"FUFUCHA","text":"I hypothesize that our first generation of crossbred popotoes have inherited the Walker's unfortunate vulnerability to both diseases and pests. However, we are yet to pinpoint the exact cause as to why they have wilted so quickly. "},{"name":"EDGYTH","text":"B-But how can that be!? Was no one at the guild able to determine the cause of our plight?"},{"name":"FUFUCHA","text":"Much as it vexes me, this conundrum has bested all of us. We at the guild are fundamentally nothing more than observers of nature. It is a force all of its own, one that we try our best to understand, but cannot hope to harness─nor should we."},{"name":"FUFUCHA","text":"However, that is not to say that all is lost. I fully intend to devote all of the resources available to me in order to ascertain exactly what it is that hinders our progress so."},{"name":"FUFUCHA","text":"I was also hoping I could count on your help, <span class=\"highlight\">Forename</span>. A fresh pair of eyes may be exactly what is needed to get to the bottom of this mystery."},{"name":"EDGYTH","text":"That's a good idea. <span class=\"highlight\">Forename</span>, let's head back to the Mudplots and I shall do my best not to get in your way."},{"name":"FUFUCHA","text":"There could be any number of reasons as to why the popotoes are so quick to wilt. At the very least, I do not think it is down to any oversight on Edgyth's part. There has to be something that we are yet to discover at the root of this..."},{"name":"EDGYTH","text":"I've told Sawney about our popoto problem; he said he'd try looking through Sharlayan records to see if he can find any similar cases. I'm really sorry, <span class=\"highlight\">Forename</span>. I'm not quite sure how, but I know this is definitely all my fault."},{"name":"SYSTEM","text":"You spy a faint white glint within the soil."},{"name":"SYSTEM","text":"Upon closer inspection, you find a chalky stone."},{"name":"EDGYTH","text":"What is the matter? Was there something in the soil?"},{"name":"EDGYTH","text":"Is something the matter, <span class=\"highlight\">Forename</span>? Don't tell me, you've discovered the problem!?"},{"name":"EDGYTH","text":"Is this some kind of...stone? No, that's not right. But surely Fufucha would have noticed this if it were so simple."},{"name":"EDGYTH","text":"Yes, I must be mistaken. There's no way an amateur such as myself could solve something that stumped the guild. "},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Have some bloody confidence in yourself for once!"},{"name":"A1","text":"Even Fufucha doesn't know everything."},{"name":"EDGYTH","text":"...I think I needed someone to tell me that. And I have to say, I'm glad it came from you. Thanks, <span class=\"highlight\">Forename</span>."},{"name":"EDGYTH","text":"Now that I think of it, she said exactly the same thing herself, didn't she? Perhaps, by the grace of Nymeia, the fates have aligned to enable me to do something of use for once in my life!"},{"name":"EDGYTH","text":"Ascertaining the identity of these chalky stones may well be the key to uncovering what's causing our popotoes to wither so quickly. However, we will first require a reagent. "},{"name":"EDGYTH","text":"I know we've already had you do enough work for a lifetime, but would you be able to visit Stickqix's Bangpots for me? Hand this order to an alchemist there named Goldwox and she should be able to give you what we need."},{"name":"EDGYTH","text":"In the meantime, I will head to the guild and ask Fufucha for her expert opinion regarding these stones."},{"name":"FUFUCHA","text":"Ah, <span class=\"highlight\">Forename</span>. I must congratulate you and Edgyth on discovering what seems to be the cause of our popoto problem. From what I have heard, I would theorize that...no, I cannot be certain just yet. A botanist needs to be confident in their convictions; it will not do for me to just throw around hypotheses with wild abandon."},{"name":"GOLDWOX","text":"Pshhh... Shkohhh... Goldwox recognizes mining uplander. Does uplander not want to trade tongueflaps with Chief Stickqix?"},{"name":"GOLDWOX","text":"Pshhh... Shkohhh... Welcome to Stickqix's Bangpots! What brings uplander here?"},{"name":"GOLDWOX","text":"Pshhh... Shkohhh... Uplander would have Goldwox crafty-make reagent?"},{"name":"GOLDWOX","text":"First, Goldwox needs uplander to bring seaweed known as nanoriso! Gobbie needs this for reagent."},{"name":"GOLDWOX","text":"Bring Goldwox twenty clumps of nanoriso and gobbie will crafty-make the reagent!"},{"name":"GOLDWOX","text":"Uplander needs to visit the Far East. Nanoriso can only be found at the bottom of the Ruby Sea!"},{"name":"GOLDWOX","text":"Bring Goldwox twenty clumps of nanoriso and gobbie will crafty-make the reagent!"},{"name":"GOLDWOX","text":"Finer nanoriso Goldwox has not seen! Gobbie will start craft-making of reagent right away!"},{"name":"GOLDWOX","text":"Pshhh... Shkohhh... Goldwox shall use techniques of both uplanders and gobbies to make reagent with fastness."},{"name":"GOLDWOX","text":"Pshhh... Shkohhh... Reagent is ready for Edgyth!"},{"name":"GOLDWOX","text":"Pshhh... Shkohhh... Make sure Goldwox's sweatworking doesn't go to waste!"},{"name":"EDGYTH","text":"Hello again, <span class=\"highlight\">Forename</span>! Did everything go smoothly at the Bangpots?"},{"name":"EDGYTH","text":"Fantastic! Now we can finally see if my silly little hypothesis holds true."},{"name":"EDGYTH","text":"...I can't believe it. Did I do something wrong? How could something that came from my mind ever turn out to be correct?"},{"name":"FUFUCHA","text":"I see you two have already begun your tests. Have you discovered anything new?"},{"name":"SAWNEY","text":"Did Edgyth's guess end up bein' correct?"},{"name":"EDGYTH","text":"The way it responded to the reagent doesn't leave much room for doubt. It's an eelworm: a pest that is not going to do us any favors. The chalky stone-like object that <span class=\"highlight\">Forename</span> found was one of its eggs."},{"name":"FUFUCHA","text":"So things are just as you assumed they were, Edgyth. There is, however, one issue I still struggle to comprehend. As parasites, eelworms require a host plant to feed on. The Mudplots were only created recently─just why were the eggs of such vermin lurking in the area?"},{"name":"EDGYTH","text":"According to the Sharlayan records Sawney looked at, eelworm eggs enter a state of dormancy within their mother's corpse, allowing them to survive for over a decade. They're more than capable of waiting for as long as is necessary for new grub to show up."},{"name":"SAWNEY","text":"The blasted records also claimed that they'd all been exterminated. Either the Sharlayans have a funny definition of the word, or we were unlucky enough to pick an area that was home to an eelworm corpse or two─the eggs inside which hatched and infested the Mudplots."},{"name":"FUFUCHA","text":"Most unfortunate indeed. I must say though, I have been remarkably impressed by the tremendous growth you have shown, Edgyth. You have come a long way, both as a person and a botanist."},{"name":"EDGYTH","text":"I h-have no idea what you are talking about! After all, it was <span class=\"highlight\">Forename</span> that found the eelworm eggs in the first place, and I still haven't come up with a solution to this pest problem..."},{"name":"SAWNEY","text":"The records weren't much use regardin' that either. Although, you'd think they must've had some way of riddin' themselves of the vermin if they were happy considerin' them “exterminated.”"},{"name":"FUFUCHA","text":"Well then, I suppose it is time I pulled my weight as well. I shall look into past cases of eelworm infestation and try to formulate a suitable plan of action."},{"name":"EDGYTH","text":"I'll keep looking through the Sharlayan records to see if I can't find a solution as well!"},{"name":"SAWNEY","text":"Suppose I'll give you a hand with that. I may not know much about plants, but my eyes work well enough."},{"name":"FUFUCHA","text":"My apologies, <span class=\"highlight\">Forename</span>, but you will need to be patient for a while as we search for a permanent solution to this conundrum. Edgyth will let you know once we are ready to put an end to these pests once and for all."},{"name":"SYSTEM","text":"In blazing new trails as a botanist, you have learned “Bountiful Harvest II”!"}],"reward":{"gil":4236,"action":273,"items":[{"id":19568},{"num":3,"id":12669},{"id":5688,"one":1},{"id":5693,"one":1},{"id":5698,"one":1}],"xp":2902500},"reqs":{"jobs":[{"lvl":68,"id":18}],"quests":[68158]},"next":[68160]},"partials":[{"type":"npc","id":"1021349","obj":{"i":1021349,"n":"Edgyth","l":2082,"q":5}},{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1017106","obj":{"i":1017106,"n":"Goldwox","l":2082,"q":1}},{"type":"npc","id":"1021351","obj":{"i":1021351,"n":"Edgyth","l":53,"q":4}},{"type":"action","id":"273","obj":{"i":273,"n":"Bountiful Harvest II","c":1085,"j":17,"t":6,"l":68}},{"type":"item","id":"19568","obj":{"i":19568,"n":"Doman Steel Scythe","l":260,"c":38162,"t":31,"p":37065}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"item","id":"5688","obj":{"i":5688,"n":"Gatherer's Guerdon Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Gathering","category":2}}},{"type":"item","id":"5693","obj":{"i":5693,"n":"Gatherer's Guile Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Perception","category":2}}},{"type":"item","id":"5698","obj":{"i":5698,"n":"Gatherer's Grasp Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":6,"attr":"GP","category":2}}},{"type":"item","id":"17947","obj":{"i":17947,"n":"Nanoriso","l":285,"c":25217,"t":45}},{"type":"quest","id":"68158","obj":{"i":68158,"n":"Walking for Walker's","g":145,"l":"Idyllshire","s":650,"f":1}},{"type":"quest","id":"68160","obj":{"i":68160,"n":"Edgyth's Winning Streak","g":145,"l":"Idyllshire","s":700,"f":1}}]}