{"quest":{"name":"A Book with Bite","location":"Gridania","id":68161,"patch":4.0,"sort":601,"icon":100677,"unlocksFunction":1,"eventIcon":71341,"issuer":1006756,"target":1006756,"involved":[1006725,1022761,1022762,1022763,1022764,1023459],"genre":155,"journal":["Y'mhitra has the most fascinating news for you.","Y'mhitra has had word from Saint Coinach's Find that the archaeologists have unearthed an Allagan tome on summoning magicks. Make your way to the camp in Mor Dhona and speak with Rammbroes.","Rammbroes immediately places the ancient book in your hands, declaring that he was able to decipher little more than the fact that it contained the wisdom of Allagan summoners. He bids you take the tome to Y'mhitra in Revenant's Toll, and allow the scholar to peruse its pages.","Y'mhitra carefully cracks open the tome's covers, and the both of you are caught off guard as the book suddenly jumps from her hands and introduces itself as “Principia.” According to the animate familiar, it was created as an instruction manual for promising summoners, but can only share its higher knowledge once the student in question has completed three formidable challenges. The first of these challenges is to be a test of power. Follow Y'mhitra out into the wilds of north Silvertear, and ask Principia to call forth your monstrous opponent.","You have defeated the demon of the tome. Share your victory with the nearby Y'mhitra.","It appears your victory over the tome's demon was more than satisfactory, but despite its glowing praise, “Prin” gives the impression that your technique is far from perfect. Amazed at this evaluation and intrigued by the tale of the familiar's creation, Y'mhitra seems lost in contemplation of the past. Return to Gridania, and rejoin the scholar at Apkallu Falls.","Y'mhitra praises you on your triumph once more, and speaks eagerly of revealing the lost knowledge hidden within the tome. Before you can attempt Prin's next challenge, however, it seems you will need to work on perfecting your technique.<br><br>※The next summoner quest will be available from Y'mhitra upon reaching level 63."],"objectives":["Speak with Rammbroes at Saint Coinach's Find.","Speak with Y'mhitra at Revenant's Toll.","Speak with Principia in north Silvertear and complete the first challenge.","Speak with Y'mhitra in north Silvertear.","Speak with Y'mhitra in Gridania."],"dialogue":[{"name":"YMHITRA","text":"<span class=\"highlight\">Forename</span>, I've had the most fascinating news. 'Twould seem that the ruins of ancient Allag have yielded to us a tome containing unknown secrets of the summoner's art."},{"name":"YMHITRA","text":"The tome in question is currently being kept under Rammbroes's watchful gaze at our dig site in Mor Dhona. I'll be heading there shortly myself, but I would not begrudge you an earlier peek!"},{"name":"YMHITRA","text":"Still here? I'd have thought the existence of an unknown work on the art of summoning would have had you flying along the currents of aether to Rammbroes's side by now."},{"name":"RAMMBROES","text":"Ah, I thought you might be along. Here, <span class=\"highlight\">Forename</span>─a prize such as this should be in your keeping."},{"name":"RAMMBROES","text":"We uncovered it not terribly far from where we excavated the evoker's attire. I've judged the tome to be some manner of manual for summoning magic, but alas, I was unable to decipher the writings. 'Tis fortunate, then, that such a task falls directly within Y'mhitra's field of expertise."},{"name":"RAMMBROES","text":"Speaking of which, would you mind taking the book to her yourself? She sent word that she had been held up by some dreary business in Revenant's Toll. Pray do be careful!"},{"name":"RAMMBROES","text":"Were you able to find Y'mhitra in town? I can think of no one better suited to unraveling the secrets within that Allagan tome."},{"name":"YMHITRA","text":"...<span class=\"highlight\">Forename</span>? I sent word that I would meet you in Revenant's Toll. Did Rammbroes not pass along my message?"},{"name":"YMHITRA","text":"My apologies─a trifling but unavoidable matter prevented me from making directly for the dig site. Now, shall we take a closer look at this Allagan tome?"},{"name":"YMHITRA","text":"Oh my... 'Tis rather more shabby than what I've come to expect from the great works of Allag, but let's not be discouraged. The content is what truly matters."},{"name":"PRINCIPIA","text":"(-???-)A fine observation!"},{"name":"PRINCIPIA","text":"Principia, at your service. I am a humble familiar, humbly familiar with the doctrine of summoning."},{"name":"YMHITRA","text":"...Have we awoken a sentient tome from some ancient library? <span class=\"highlight\">Forename</span>, we must keep it contained!"},{"name":"PRINCIPIA","text":"Have I somehow given offense? Strange, for I am not equipped with offensive capabilities. Imparting the art of summoning is my function, and instructional manual is my form."},{"name":"YMHITRA","text":"...A manual, you say?"},{"name":"PRINCIPIA","text":"Correct. When opened in the presence of summoners, I am bound to awaken and share with them the secrets of summoning. The young <span class=\"alternative-container\"><span class=\"alternative\">mistress</span><span class=\"alternative\">master</span></span> there is in possession of an active soul crystal, yes?"},{"name":"YMHITRA","text":"'Twas the soul crystal that awoke you?"},{"name":"PRINCIPIA","text":"Correct. Only one who carries a soul crystal and has bathed in the aether of an eikon may wield the powers of a summoner. I sensed one worthy of instruction, and was thus compelled to introduce myself."},{"name":"YMHITRA","text":"“Eikon”... That is the Allagan word for “primal.” Excuse my need to clarify the obvious, but you are a construct created to teach summoning magicks to any potential student you encounter? Why would the ancients have deemed such a thing necessary?"},{"name":"PRINCIPIA","text":"Summoning came into being for the purpose of eliminating beings─specifically those beings known as eikons. Ahem, “primals.” Once these entities have all been vanquished, however, new egi cannot be harnessed. Old summoners perish, and so, too, does their art."},{"name":"PRINCIPIA","text":"It was upon glimpsing this bleak future that a certain master summoner set about crafting yours truly. Inscribed with arts of tremendous power, I exist to teach others how to safeguard their existence."},{"name":"YMHITRA","text":"Fascinating... Your creation speaks to the heart of the discipline's rarity. Summoning harnesses the power of primals for the sole purpose of destroying them, and new summoners arise only in an age when primals are rife."},{"name":"YMHITRA","text":"With the absence of living mentors, a true succession of the art is never achieved. Principia, are you then to instruct <span class=\"highlight\">Forename</span> in the lost secrets of Allag?"},{"name":"PRINCIPIA","text":"I am eager to oblige, but there are certain obligations. Ere the seal upon my higher knowledge can be unlocked, the student must first overcome the three challenges I am ensorcelled to present."},{"name":"YMHITRA","text":"Well, considering how it refers to primals as “eikons,” I'm inclined to believe that we have an authentic Allagan relic on our hands. What say you, <span class=\"highlight\">Forename</span>? Will you undertake these challenges?"},{"name":"PRINCIPIA","text":"The first challenge is a test of power. This trial is designed to evaluate the raw magnitude of your arcane talent by pitting you against a predetermined opponent of carefully measured fortitude. Also known as “I manifest a monster, and you fight it.”"},{"name":"YMHITRA","text":"Ah, mayhap not terribly wise to attempt that in the middle of town. Why don't we find ourselves a less-populated area out near the Singing Shards?"},{"name":"YMHITRA","text":"Are you prepared for this “test of power”? 'Twould seem Principia is but waiting on your word."},{"name":"YMHITRA","text":"I thought we were headed for north Silvertear? We certainly cannot hold the trial <span class=\"emphasis\">here</span>."},{"name":"PRINCIPIA","text":"Shall we begin the test of power, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>?"},{"name":"YMHITRA","text":"...“<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>”? You treat your pupil as a superior, Principia?"},{"name":"PRINCIPIA","text":"Such was the way in which I was written. Ah, and if my full name begins to tire your tongue, you are welcome to call me “Prin” or “Pia.”"},{"name":"YMHITRA","text":"Oooh, I rather like “Prin.” Ahem, I mean, let us proceed with the challenge!"},{"name":"PRINCIPIA","text":"A fine showing, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. Even the greatest of Allagan summoners would be forced to recognize the extent of your extant power."},{"name":"YMHITRA","text":"A crushing victory, <span class=\"highlight\">Forename</span>! Who could argue the potential of modern summoning after that display?"},{"name":"PRINCIPIA","text":"You have bested the first challenge, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. There are few summoners in Allag's long history who boasted this degree of native might!"},{"name":"PRINCIPIA","text":"Furthermore, that you have achieved such potency through naught but the study of ancient wisdom is simply astonishing. With a little polish to your technique, guiding you to loftier heights of power should be astonishingly simple."},{"name":"YMHITRA","text":"I'd thought <span class=\"highlight\">Forename</span>'s technique more than sufficiently polished, but you say there is room for improvement? I see we shall have to adjust our yalmstick for perfection if we are to rival the practitioners of the past."},{"name":"PRINCIPIA","text":"Indeed. If you would know more of past practices, then you need only ask."},{"name":"YMHITRA","text":"Actually, I do have a question for you...<br>If you would indulge me, <span class=\"highlight\">Forename</span>?"},{"name":"YMHITRA","text":"Prin, in which age were you created? You appear to lack the technological advancements that were predominant in constructs in the latter days of Allag's civilization..."},{"name":"PRINCIPIA","text":"Another excellent observation. I was penned by Master Sari, a preeminent summoner of his time. He was, in fact, likely the last master summoner of the Allagan Empire's reign."},{"name":"PRINCIPIA","text":"Were I to date myself by your culture's notion of history, my creation would have taken place at a point just before the empire's collapse. In other words, solidly within the richest era of aetherochemical discovery."},{"name":"PRINCIPIA","text":"One might reasonably wonder why this wonderful science was excluded from my invention, and I assure you, there is a reason..."},{"name":"PRINCIPIA","text":"In the beginning, the Allagans rose to superiority through their mastery of magecraft. It is told that the very first wielders of summoning magic made do with grimoires fashioned of leather and ink and parchment."},{"name":"PRINCIPIA","text":"There came a tipping point, however, when the mundane sciences began to progress with ever-growing rapidity. These advances were married with the arcane, and aetherochemical technology was born."},{"name":"PRINCIPIA","text":"Even as the harnessing of lightning energies gave rise to new recording mediums, techniques were developed that allowed complex arcane geometries to be instantly plotted. Traditional grimoires were replaced by devastatingly efficient and elegant weapons."},{"name":"PRINCIPIA","text":"The convenience of these tools, however, did not lend themselves well to the instruction of initiates. Beyond such considerations, the new mediums could not be perused without dedicated machinery, and their manufacture was no simple matter."},{"name":"YMHITRA","text":"...And so the summoner who breathed life into you decided that tomestones and the like were not the ideal method for passing on his accumulated wisdom."},{"name":"PRINCIPIA","text":"Correct. He chose for me the primitive form of a book, and inscribed within my pages a bounty of potent incantations that required no machine to be cast."},{"name":"YMHITRA","text":"Thank you, Prin. I thought only to satisfy my academic curiosity, but I found myself swept up in your description of the past. ...You truly are the creation of an incredible age."},{"name":"YMHITRA","text":"And thank you for your patience, <span class=\"highlight\">Forename</span>! Shall we return to Gridania?"},{"name":"PRINCIPIA","text":"Welcome home, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. Or should that be, “welcome back”? I am told this is the base of your research efforts with Lady Y'mhitra, but I am unsure of the correct salutation."},{"name":"DANCINGWOLF","text":"<span class=\"highlight\">Forename</span>, you've been well I trust? I'm trying to bend Y'mhitra's ear, but she seems a little distracted."},{"name":"DANCINGWOLF","text":"...Not that I can blame her. Have you seen this hopping book? I'm fairly sure I caught a flash of teeth in between those pages..."},{"name":"YMHITRA","text":"Well done, <span class=\"highlight\">Forename</span>! We are one step closer to revealing a new secret of ancient Allag!"},{"name":"YMHITRA","text":"Prin will issue the next challenge after you've had the chance to review your studies, and hone your abilities to a new level of perfection."},{"name":"YMHITRA","text":"...I've decided to keep the familiar here at my side for the moment. Even with as many wonders as Eorzea holds, folk tend to panic at the sight of a fanged tome that jumps around of its own accord."},{"name":"YMHITRA","text":"Oh, and pay no mind to Captain Wolf. He obviously wishes to secure my services for some task or another, but we have more important matters to attend to!"},{"name":"SYSTEM","text":"The next summoner quest will be available from Y'mhitra upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1326,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":28}],"questsType":"all","quests":[67641,67895]},"next":[68162]},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1006725","obj":{"i":1006725,"n":"Rammbroes","l":67,"q":14}},{"type":"npc","id":"1022761","obj":{"i":1022761,"n":"Y'mhitra","l":67,"q":1}},{"type":"npc","id":"1022762","obj":{"i":1022762,"n":"Principia","l":67,"q":1}},{"type":"npc","id":"1022763","obj":{"i":1022763,"n":"Y'mhitra","l":67,"q":1}},{"type":"npc","id":"1022764","obj":{"i":1022764,"n":"Dancing Wolf","l":53,"q":3}},{"type":"npc","id":"1023459","obj":{"i":1023459,"n":"Principia","l":53,"q":5}},{"type":"quest","id":"67641","obj":{"i":67641,"n":"A Flare for the Dramatic","g":155,"l":"Ul'dah","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68162","obj":{"i":68162,"n":"Performing for Prin","g":155,"l":"Gridania","s":630,"f":1}}]}