{"quest":{"name":"I Dream of Shirogane","location":"Kugane","id":68167,"patch":4.0,"sort":1005,"icon":100716,"unlocksFunction":1,"eventIcon":71341,"issuer":1022628,"target":1022628,"involved":[1023604,1023605],"genre":107,"journal":["Tsurubami is frantically trying to get your attention.","Having waved you down, Tsurubami informs you that the lord bugyo of Kugane has established a residential district for foreigners. Though she is keen to see the place, as a local, she fears the embarrassment of being turned away, and so asks that you make inquiries in her stead. To begin with, she suggests approaching the bugyosho official, who is presently at the docks.","According to the bugyosho official, the residential district of Shirogane was established in order to accommodate Kugane's growing influx of visitors, and plots of land there are being released exclusively to foreigners. Kimachi at pier number two will take you to Shirogane, where you may speak with the district official as well as inspect the isle itself.","After a brief boat ride, you step onto the idyllic isle of Shirogane. The district official should be near on hand to answer any queries you may have.","The district official confirms your eligibility to purchase a plot of land on Shirogane upon which to build a home. If you wish to know the particulars of the process, the resident caretaker will be able to assist you. With that, you have seen and learned enough for Tsurubami's purposes. Time to bear the details back to her on Kugane.","Hearing your vivid account of Shirogane, Tsurubami is convinced that she would enjoy living there. All that she needs to make this a reality, she says, is a foreign husband..."],"objectives":["Speak with the bugyosho official.","Speak with Kimachi and travel to Shirogane.","Speak with the district official.","Report to Tsurubami in Kugane."],"dialogue":[{"name":"TSURUBAMI","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> Ijin, a moment if you would! There is a favor I would ask of you."},{"name":"TSURUBAMI","text":"You see, word has it the lord bugyo of Kugane has established a new residential district especially for foreigners. Having long dreamed of a home to call my own, I couldn't help but find myself wanting to know more."},{"name":"TSURUBAMI","text":"I would like very much to see the district for myself, but as I am not a foreigner, I fear I would be turned back before all and sundry. The embarrassment would be too much to bear."},{"name":"TSURUBAMI","text":"And so I turn to you, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> Ijin. I would be most obliged were you to go to the residential district, Shirogane, and make inquiries in my stead."},{"name":"TSURUBAMI","text":"I'm given to understand a representative of the bugyo is presently at the docks. If you speak with him, he should be able to tell you more. Oh, I cannot wait to hear what manner of place it is!"},{"name":"TSURUBAMI","text":"A representative of the bugyo is presently at the docks. If you speak with him, he should be able to tell you more about Shirogane. Oh, I cannot wait to hear what manner of place it is!"},{"name":"MAN02631","text":"You are well come, my foreign friend. How may this humble servant of the lord bugyo assist you?"},{"name":"MAN02631","text":"Ah, so you are interested in Shirogane. 'Twould be my pleasure to tell you about the district."},{"name":"MAN02631","text":"Ever since Kugane opened its arms to the world, the number of visitors continues to grow. And among those who come, no few remain here for extended periods. Such lodgings as are available in the city no longer suffice to meet demand."},{"name":"MAN02631","text":"In order to address the accommodation shortage, the lord bugyo has established a residential district upon the nearby isle of Shirogane."},{"name":"MAN02631","text":"Plots of land on the isle are being released exclusively to foreigners, who may build homes upon them as they see fit. A tidy solution, I'm sure you will agree."},{"name":"MAN02631","text":"If you wish to learn more, I invite you to take this boat to Shirogane. There, you may speak with the district official and inspect the isle at your leisure."},{"name":"SYSTEM","text":"Travel to any one of Shirogane's wards to advance the quest."},{"name":"MAN02631","text":"I invite you to take this boat to Shirogane. There, you may speak with the district official and inspect the isle at your leisure."},{"name":"SYSTEM","text":"You may travel to any one of Shirogane's wards to advance the quest."},{"name":"OFFICIAL02631","text":"Greetings and welcome to Shirogane, Kugane's residential district for foreigners."},{"name":"OFFICIAL02631","text":"You are a visitor to our shores, if I'm not mistaken? In which case, congratulations─you are eligible to purchase land here and build upon it."},{"name":"OFFICIAL02631","text":"So long as you have the funds, it matters not whether you do so as an individual or a group. If you wish to know about the process, the resident caretaker yonder would be pleased to assist you."},{"name":"OFFICIAL02631","text":"And if there are any among your acquaintances who might have an interest, we would be grateful if you could spread the word."},{"name":"OFFICIAL02631","text":"All foreigners are eligible to purchase land on Shirogane. So long as you have the funds, it matters not whether you do so as an individual or a group. If you wish to know about the process, the resident caretaker yonder would be pleased to assist you."},{"name":"TSURUBAMI","text":"Ah, there you are, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> Ijin! So, what were you able to learn about Shirogane?"},{"name":"TSURUBAMI","text":"Oh my, it sounds like a truly lovely place! Yes, I do believe I would enjoy it there. Your vivid description has quite convinced me of it."},{"name":"TSURUBAMI","text":"That locals are barred from purchasing land is no object─I need but find myself a foreign husband. If you know someone, you will introduce me, yes?"},{"name":"SYSTEM","text":"The residential district Aethernet for Shirogane can be accessed through the Kugane aetheryte."}],"reward":{"gil":490,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":1}],"quests":[68008]}},"partials":[{"type":"npc","id":"1022628","obj":{"i":1022628,"n":"Tsurubami","l":2404,"q":1}},{"type":"npc","id":"1023604","obj":{"i":1023604,"n":"Bugyosho Official","l":2404,"q":1}},{"type":"npc","id":"1023605","obj":{"i":1023605,"n":"District Official","l":2412,"q":1}},{"type":"quest","id":"68008","obj":{"i":68008,"n":"By the Grace of Lord Lolorito","g":6,"l":"Kugane","s":270}}]}