{"quest":{"name":"Performing for Prin","location":"Gridania","id":68162,"patch":4.0,"sort":630,"icon":100677,"unlocksFunction":1,"eventIcon":71341,"issuer":1006756,"target":1006756,"involved":[1022764,1022765,1022766,1022767,1022768,1022769,1022770,1022771,1022772,1022773,1022774,1022775,1023459,1023482],"genre":155,"journal":["Y'mhitra asks that you lend an ear to Principia.","Y'mhitra directs your attention to Principia, and the toothy familiar announces you ready to undertake the second challenge. Finding herself stumped by the trial's requirement for additional summoners, Y'mhitra is forced to accept Dancing Wolf's proposal to cooperate with his regiment's new summoners-in-training. Travel to Camp Bluefog in northern Thanalan, and report to the flame captain.","After Principia explains the second challenge and its focus on skill, Dancing Wolf introduces you to his cadre of neophyte summoners. Prepare yourself to battle the acolytes' egi, then approach Summoner Crispin to begin the trial.","You have overcome the pair of Ifrit-egi summoned by Crispin and Denise. Approach Summoner Jajasamu, and proceed to the next step of the challenge.","You have triumphed over the formidable Ifrit-egi summoned by Jajasamu. Speak with the lieutenant once more, and prepare to face your final opponent.","You have claimed victory over Jajasamu's Titan-egi. With no aetherial entities left to send against you, the novice summoners look on expectantly as Dancing Wolf waits to congratulate you.","Principia declares your attempt at the second challenge a resounding success. Your opponents accept their defeat with good-natured grace, and seem eager to resume their training. Bidding them farewell, you turn to follow Y'mhitra back to Apkallu Falls.","Upon returning to Gridania, Principia continues its lecture on the history of Allagan summoning and shares the accomplishments of its creator. Y'mhitra seems more determined than ever to see you earn the master summoner's long-lost wisdom, and urges you to prepare for the familiar's final challenge.<br><br>※The next summoner quest will be available from Y'mhitra upon reaching level 65."],"objectives":["Speak with Dancing Wolf at Camp Bluefog.","Speak with Crispin, and defeat the egi.","Speak with Jajasamu, and defeat the egi.","Speak with Dancing Wolf.","Speak with Y'mhitra in Gridania."],"dialogue":[{"name":"DANCINGWOLF","text":"<span class=\"highlight\">Forename</span>, you've been well I trust? I'm trying to bend Y'mhitra's ear, but she seems a little distracted."},{"name":"DANCINGWOLF","text":"...Not that I can blame her. Have you seen this hopping book? I'm fairly sure I caught a flash of teeth in between those pages..."},{"name":"PRINCIPIA","text":"Welcome home, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. Or should that be, “welcome back”? I am told this is the base of your research efforts with Lady Y'mhitra, but I am unsure of the correct salutation."},{"name":"YMHITRA","text":"Greetings, <span class=\"highlight\">Forename</span>. 'Twould seem that Prin would speak with us about the second challenge."},{"name":"PRINCIPIA","text":"Congratulations, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. You are sufficiently prepared to undertake the next test."},{"name":"YMHITRA","text":"Excuse me, Prin, but...how can you tell?"},{"name":"PRINCIPIA","text":"By analyzing the patterns of <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>'s aetherial emanations, I can gauge the strength and precision of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> recently cast incantations. Of course, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> must attempt the challenge itself before I can provide an evaluation to the proper degree of accuracy."},{"name":"PRINCIPIA","text":"This will be a test of skill. To administer this trial under the prescribed conditions, however, I must request the assistance of several more summoners to play the role of antagonists..."},{"name":"YMHITRA","text":"Several more summoners...? In this day and age, that will be no easy feat to arrange."},{"name":"DANCINGWOLF","text":"Come now, Y'mhitra. The solution is right under your nose!"},{"name":"DANCINGWOLF","text":"<span class=\"highlight\">Forename</span>, your deeds have caught the attention of the highest echelons of the Flames. After learning what you're capable of, we've begun an initiative to take our very own summoners into battle against the primals."},{"name":"DANCINGWOLF","text":"A number of soldiers under my command have already begun intensive training─I handpicked veteran survivors of our expedition against Ifrit, and they've been issued with soul crystals we claimed from the Ascians."},{"name":"YMHITRA","text":"Aye, and Captain Wolf has been howling in my ear for days, begging to enlist your aid as some kind of drill instructor for the aetherially gifted."},{"name":"DANCINGWOLF","text":"But now you're in need of summoners for this trial of yours, yes? I am prepared to offer my regiment's full cooperation. All I ask in return is a few morsels of advice for the acolytes!"},{"name":"PRINCIPIA","text":"It seems to me a fair trade. And my enchantments do not restrict me from instructing neophyte summoners in the fundamentals of the art."},{"name":"YMHITRA","text":"Very well... I suppose such an arrangement could prove convenient for us all."},{"name":"DANCINGWOLF","text":"I knew you'd come around! Meet me at Camp Bluefog and I'll assemble the troops for inspection."},{"name":"YMHITRA","text":"These are the three neophyte summoners who will be assisting with the trial. I have heard Allagan training can be rather remorseless... Do your best, but pray try not to injure them during the fray!"},{"name":"PRINCIPIA","text":"Everything is in readiness for the second challenge, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>."},{"name":"CRISPIN","text":"I am told we are to be your opponents for this exercise. It's an honor to meet you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"DENISE","text":"Summoner Denise at your service, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>!"},{"name":"JAJASAMULALASAMU","text":"...Aye? We ain't started yet, have we?"},{"name":"YMHITRA","text":"We should meet Captain Wolf at the camp, then we'll find a nice, open space somewhere in northern Thanalan to conduct the second challenge."},{"name":"YMHITRA","text":"I did warn him, however, that you're far too busy to train his soldiers on any kind of permanent basis."},{"name":"PRINCIPIA","text":"As mentioned, the second challenge will be a test of skill. I shall be evaluating your technique for flawless execution and executed flaws."},{"name":"DANCINGWOLF","text":"Looks like we're all here! Let's get on with the briefing, shall we?"},{"name":"PRINCIPIA","text":"As you command. This second challenge will evaluate the elegance of your technique as opposed to the magnitude of your Miasma."},{"name":"PRINCIPIA","text":"First, I shall infuse the egi of your opponents with secondary enchantments, and then you are to engage the entities in combat."},{"name":"YMHITRA","text":"Prin explained to me that the enchantments store the aether expended during the battle, and allow for an in-depth analysis of your...flair for Deathflares. As it were. In any case, I expect you'll pass with flying colors!"},{"name":"DANCINGWOLF","text":"Right, I suppose you should know who you're up against. Designation and rank!"},{"name":"CRISPIN","text":"Summoner Crispin. Private, first class. We're grateful for aught you can teach us, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"DENISE","text":"Summoner Denise. Sergeant. I'm new to spellcasting, but I've seen my share of combat, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! Crispin and I are to fight you as a pair."},{"name":"JAJASAMULALASAMU","text":"Summoner Jajasamu. <span class=\"emphasis\">Lieutenant</span>. Ye've more'n a few admirers in the barracks, <span class=\"highlight\">Forename</span>...uh, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. But that don't mean we'll go easy on ye!"},{"name":"DANCINGWOLF","text":"Enough chatter! Quick march to the training ground! Give the word to Crispin and Denise when you're ready to battle their egi, <span class=\"highlight\">Forename</span>."},{"name":"DANCINGWOLF","text":"After that, you'll be facing off against the lieutenant's beast. You won't be attacking my troops directly, so give it all you've got!"},{"name":"DANCINGWOLF","text":"All set, <span class=\"highlight\">Forename</span>? As I said, Crispin and Denise will be your first opponents. Just give them the word."},{"name":"DENISE","text":"Our egi are primed for battle, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! We'll unleash them as soon as you've given Crispin the command!"},{"name":"JAJASAMULALASAMU","text":"I'll just be watchin' for the now. Ye know, seein' how ye handle the small fish afore ye get to the <span class=\"emphasis\">real</span> fight."},{"name":"YMHITRA","text":"We should probably be in northern Thanalan. Captain Wolf and his summoners will be waiting."},{"name":"PRINCIPIA","text":"Greetings, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. We are conducting the second challenge near this “Camp Bluefog” of yours. Strange, I do not recall teleporting back here..."},{"name":"CRISPIN","text":"Prepare yourself, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! Denise and I will now summon our servants to battle!"},{"name":"DENISE","text":"Aye, a pair of Ifrit-egi for you!"},{"name":"DANCINGWOLF","text":"Outstanding! Speak with Summoner Jajasamu to continue the challenge."},{"name":"YMHITRA","text":"The enchantments were also meant to strengthen the egi somewhat...<br>Well, that hardly seemed to matter to you!"},{"name":"PRINCIPIA","text":"An excellent performance so far, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. Pray continue with the test."},{"name":"CRISPIN","text":"Your victory was overwhelming, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>.<br>Watching you wield the art is simply mesmerizing..."},{"name":"DENISE","text":"We never stood a chance, really, but I was holding out a tiny bit of hope!"},{"name":"JAJASAMULALASAMU","text":"Ye finished warmin' up on them embers, then? 'Cause even together, me mates' egi don't hold a candle to the inferno I can summon."},{"name":"JAJASAMULALASAMU","text":"Right. Let's bring the flames!"},{"name":"DANCINGWOLF","text":"Your next opponent will be another one of Summoner Jajasamu's egi. The lad's not fond of losing, so expect no quarter!"},{"name":"YMHITRA","text":"You held your own easily enough, but that Ifrit-egi was still rather impressive."},{"name":"PRINCIPIA","text":"How do you feel, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>? Dizziness? Itchiness? Nausea? No? Mayhap this challenge needs to be more...challenging. Continue!"},{"name":"CRISPIN","text":"Even Jajasamu's egi was extinguished...<br>Well, that's that, then."},{"name":"DENISE","text":"It's not over yet: the lieutenant has one more card up his sleeve!"},{"name":"JAJASAMULALASAMU","text":"Ah, I had hopes for that one, but ye snuffed him out right quick!"},{"name":"JAJASAMULALASAMU","text":"Not much of a trial, eh? Well then, yer lucky I fought another primal durin' me time with the Company of Heroes."},{"name":"JAJASAMULALASAMU","text":"Aye, yer not the only summoner as can command more'n one aetherial beastie! Say hello to yer final opponent: Titan-egi!"},{"name":"YMHITRA","text":"A former member of the Company of Heroes? I'm impressed. He has the makings of a talented summoner."},{"name":"PRINCIPIA","text":"Allow me some time to chew on the residue of your battles, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. Though from the taste alone, I can predict a favorable flavor for the result..."},{"name":"CRISPIN","text":"Titan-egi seemed so solid...and then you broke him into little pieces."},{"name":"DENISE","text":"That was a pleasure to watch, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I can hardly wait to return to our training!"},{"name":"JAJASAMULALASAMU","text":"I wish I'd been able to join in the battle with me own self. Not that the outcome would've been any different, mind..."},{"name":"DANCINGWOLF","text":"I hope my summoners put up enough of a fight for you! Anyway, shall we hear what the book has to say?"},{"name":"PRINCIPIA","text":"I have ruminated upon the swirls and echoes of your battle, and the picture is clear: your technique is, without a doubt, a thing of exquisite beauty. Consider the second challenge conquered."},{"name":"DANCINGWOLF","text":"Well, that's good news, if hardly surprising! After all, you did sweep through those egi like a storm through a field of dandelions!"},{"name":"JAJASAMULALASAMU","text":"Me thanks. Ye've opened me eyes─I see I've some work to do afore I've truly mastered this discipline."},{"name":"YMHITRA","text":"I'm glad to know we've been of service. Now, we really must be returning to Gridania."},{"name":"CRISPIN","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. This was truly an enriching experience!"},{"name":"DENISE","text":"Aye, pray train with us again in the future!"},{"name":"PRINCIPIA","text":"One last challenge remains. Pray win through this trial, lest the higher knowledge I hoard remain lost."},{"name":"YMHITRA","text":"Congratulations, <span class=\"highlight\">Forename</span>. With your impressive demonstrations of power and skill, you have already conquered two of Prin's three challenges!"},{"name":"YMHITRA","text":"Ere we come to the final trial, however, Prin would further our education on Allagan summoning."},{"name":"PRINCIPIA","text":"First, I would ask what you know of the rise and fall of summoning in the Allagan Empire─I was made to “cover” rather a lot of history, you understand."},{"name":"YMHITRA","text":"From our research, we have learned that summoners were initially lauded as heroes for their success against the primals. When certain of these mages began to abuse the art's power for personal gain, however, the adoration of the populace shifted towards an oppressive hatred."},{"name":"PRINCIPIA","text":"Correct. We speak now of the latter half of the Third Astral Era. My creator, Master Sari, was one of those who expended his energies on the destruction of primals, even as he fled from relentless persecution. Alongside his disciples, he triumphed over Belias and many other lesser entities."},{"name":"YMHITRA","text":"Belias? That was the name of the elder primal from whom Tristan once drew power...<br>Master Sari must have been mighty indeed to defeat such a foe."},{"name":"PRINCIPIA","text":"Yet he still knew fear: the thought that the grand discipline of summoning would fade into oblivion was more than Master Sari could bear. And so he sought to preserve its legacy, and provide for his successors."},{"name":"PRINCIPIA","text":"My creator was well versed in aetherochemistry and held a particular interest in the technology of information. Broadly speaking, he researched methods for producing arcane geometries without grimoires, and experimented with machine-enhanced egi."},{"name":"PRINCIPIA","text":"He eventually abandoned both of these technologies, deeming them unsuitable for the instruction of future generations. Hoping to provide guidance to those summoners yet unborn, he instead began writing and enchanting a work that would survive down the ages. He made me."},{"name":"YMHITRA","text":"Such an accomplished personage...<br>Why, then, have I seen but scant mention of his name in Allag's histories?"},{"name":"PRINCIPIA","text":"As you have said yourself, it was an age when the adulation of summoners experienced an extreme reversal. It is likely that Master Sari's achievements were struck from the records, even as his loyal pupils were struck down in the streets."},{"name":"PRINCIPIA","text":"I was shut in a storeroom─abandoned to my slumber like some common treatise on trade agreements in the southern provinces─and thus I can tell you naught of what befell my creator in his later years."},{"name":"YMHITRA","text":"I expected a dry recital on the history of summoning, but you've shared with us your personal narrative. 'Tis clear you hold a great deal of respect for Master Sari."},{"name":"PRINCIPIA","text":"I am a familiar. I simply relay information as I was enspelled. This lecture is now over."},{"name":"YMHITRA","text":"As you wish, Prin.<br>Well, <span class=\"highlight\">Forename</span>, 'twould seem class is dismissed for the moment. I suggest you recuperate from this day's trial, and look toward preparing yourself for the final challenge!"}],"reward":{"gil":1625,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":28}],"quests":[68161]},"next":[68163]},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1022764","obj":{"i":1022764,"n":"Dancing Wolf","l":53,"q":3}},{"type":"npc","id":"1022765","obj":{"i":1022765,"n":"Dancing Wolf","l":46,"q":1}},{"type":"npc","id":"1022766","obj":{"i":1022766,"n":"Y'mhitra","l":46,"q":1}},{"type":"npc","id":"1022767","obj":{"i":1022767,"n":"Crispin","l":46,"q":1}},{"type":"npc","id":"1022768","obj":{"i":1022768,"n":"Denise","l":46,"q":1}},{"type":"npc","id":"1022769","obj":{"i":1022769,"n":"Jajasamu","l":46,"q":1}},{"type":"npc","id":"1022770","obj":{"i":1022770,"n":"Crispin","l":46,"q":1}},{"type":"npc","id":"1022771","obj":{"i":1022771,"n":"Denise","l":46,"q":1}},{"type":"npc","id":"1022772","obj":{"i":1022772,"n":"Jajasamu","l":46,"q":1}},{"type":"npc","id":"1022773","obj":{"i":1022773,"n":"Dancing Wolf","l":46,"q":1}},{"type":"npc","id":"1022774","obj":{"i":1022774,"n":"Principia","l":46,"q":1}},{"type":"npc","id":"1022775","obj":{"i":1022775,"n":"Y'mhitra","l":46,"q":1}},{"type":"npc","id":"1023459","obj":{"i":1023459,"n":"Principia","l":53,"q":5}},{"type":"npc","id":"1023482","obj":{"i":1023482,"n":"Principia","l":46,"q":1}},{"type":"quest","id":"68161","obj":{"i":68161,"n":"A Book with Bite","g":155,"l":"Gridania","s":601,"f":1}},{"type":"quest","id":"68163","obj":{"i":68163,"n":"An Egi-stential Crisis","g":155,"l":"Gridania","s":650,"f":1}}]}