{"quest":{"name":"Edgyth's Winning Streak","location":"Idyllshire","id":68160,"patch":4.0,"sort":700,"icon":100694,"unlocksFunction":1,"eventIcon":71341,"issuer":1021349,"target":1021349,"involved":[1000815,1020870,1021351,1021358,1021359,1021591,1021595,1022381],"genre":145,"usedItems":[17948],"journal":["For once, Edgyth is looking rather cheery.","A jubilant Edgyth explains to you that a cure for the Mudplots' bad case of eelworm has finally been found. She invites you to join her at the Botanists' Guild to discuss this solution with Fufucha and the others. You ready yourself for the journey in the knowledge that the end of this popoto peril is finally in sight.","Once everyone has been accounted for at the guild, Fufucha gives the signal to Sawney to explain his findings. It becomes apparent that there are two solutions to the issue, both recorded in the Sharlayan records Sawney and Edgyth had been examining. It is quickly established that neither alchemy nor companion farming will avail on their own, and Fufucha recommends you utilize a mixture of the two. You are instructed to head to Castrum Oriens in order to search for a flower named Rhalgr's streak that will form a key part of Fufucha's plan.","Edgyth is told by a Twin Adder officer that a flower with strikingly similar characteristics to Rhalgr's streak used to be cultivated in Ala Ghiri. The officer also offers unsolicited advice that the area is “no place for little lady botanists.” Undeterred by the overbearing officer, the two of you make tracks for Ala Ghiri.","Edgyth initially struggles to get the attention of the locals; however, you are confident that the two of you together should be able able to learn something of use.","It seems that Rhalgr's streak was originally brought to Ala Ghiri to deal with a pest problem not unlike your own. While opinions on the flower's scent vary wildly, you learn that it most likely grows in a mountainous part of the Lochs.","Edgyth elects to head back to Greengrub Mudplots to ready them for your return. It is left to you to hunt for Rhalgr's streak alone. You steel yourself for the search ahead.","Upon your return to the Mudplots, you quickly set about planting the Rhalgr's streaks, marking the end of your involvement in Idyllshire's agricultural affairs. Fufucha bestows upon Edgyth not one, but two gifts: the very garb worn by Fufucha herself and a new title. The newly appointed first botanist of Idyllshire is slightly overwhelmed by these gestures at first, but swears she will put Idyllshire on the botanic map."],"objectives":["Speak with Fufucha in Gridania.","Rendezvous with Edgyth at Castrum Oriens.","Rendezvous with Edgyth in Ala Ghiri.","Gather information in Ala Ghiri.","Speak with Edgyth.","<span class=\"alternative-container\"><span class=\"alternative\">Harvest Rhalgr's streak in the Royal Hunting Grounds</span><span class=\"alternative\">Deliver the Rhalgr's streaks to Edgyth in Idyllshire</span></span>."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “The First of Many.”"},{"name":"EDGYTH","text":"<span class=\"highlight\">Forename</span>, <span class=\"highlight\">Forename</span>! We've done it! We've found a solution to our pest problem at last!"},{"name":"EDGYTH","text":"I was just about to make my way to the guild to talk with Fufucha! It's only right that you should join us to see the culmination of everyone's hard work."},{"name":"EDGYTH","text":"It's been weeks since I last got lost on my way here! Aren't you proud?"},{"name":"SAWNEY","text":"Ah, <span class=\"highlight\">Forename</span>, good to see you made it. I was worried you might miss out on the best part!"},{"name":"FUFUCHA","text":"I see everyone is present and accounted for; let us begin."},{"name":"SAWNEY","text":"Sounds like my cue! Edgyth and I managed to find a solution─two, actually─to this eelworm infestation. We can choose to put our faith in either alchemy or...what was it called again? Ah yes, companion planting."},{"name":"EDGYTH","text":"While alchemy is the more potent of the two, it does have its downsides. For one, it has equally potent side effects, and if any concoction we use happens to scatter further than we planned, it could wreak all manner of havoc on the environment."},{"name":"FUFUCHA","text":"In which case, the only option realistically available to us is to make use of a blend of the two. I know enough about botanic alchemy to cover that aspect, but companion planting may prove somewhat difficult to utilize."},{"name":"SAWNEY","text":"I don't want to make a fool of myself, but could someone explain to me what companion planting is exactly?"},{"name":"FUFUCHA","text":"Simply put, it is the process of planting different crops in close proximity, so that they may mutually benefit one another. These benefits vary from stimulating the growth of neighboring crops to increasing yields. Oh, and perhaps most interestingly, it can also help prevent pest damage."},{"name":"EDGYTH","text":"In the case of eelworm infestation, a flowering plant called Rhalgr's streak is said to be effective. However, sadly for us, there are none left in Saint Mocianne's Arboretum."},{"name":"FUFUCHA","text":"I can say with confidence that we have never had any at the guild either. However, I do have an idea as to where they may be found."},{"name":"FUFUCHA","text":"The flower owes its name to Rhalgr, the guardian deity of Ala Mhigo. I daresay you stand a good chance of finding it in Gyr Abania, where faith in the Destroyer has ever been strong. It stands to reason that the flower would grow in the area."},{"name":"SAWNEY","text":"And that's where you come in, <span class=\"highlight\">Forename</span>. Do you reckon you'd be up to travelin' to Gyr Abania and trackin' down this elusive plant on our behalf?"},{"name":"EDGYTH","text":"After all that we've been through together, I have a mind to accompany <span class=\"highlight\">Forename</span>. It's the least I can do!"},{"name":"SAWNEY","text":"Don't be gettin' ahead of yourself now, young lady. The fightin' may have died down, but there's no guarantee that Gyr Abania's safe enough for civilians to be wanderin' around searching for flowers!"},{"name":"SAWNEY","text":"Don't be gettin' ahead of yourself now, young lady. Have you any idea how dangerous Gyr Abania is at the moment? Even assumin' you don't get caught up in a battle, it's still hardly a safe place for defenseless botanists!"},{"name":"SAWNEY","text":"<span class=\"highlight\">Forename</span> may be able to look after <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> just fine, but you're a different story. You would only get in the way!"},{"name":"EDGYTH","text":"Say what you want; it's my duty to accompany <span class=\"highlight\">Forename</span>! This is the final obstacle standing in our way and I can't very well leave <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to tackle it alone."},{"name":"FUFUCHA","text":"The final call is yours, <span class=\"highlight\">Forename</span>, but in my mind, such passion ought not be hindered."},{"name":"EDGYTH","text":"Thank you so much, <span class=\"highlight\">Forename</span>! This time, I promise you will have no cause to regret allowing me to accompany you. I'll go on ahead and begin asking people about the flower's whereabouts!"},{"name":"FUFUCHA","text":"I shall take the precaution of informing the Order of the Twin Adder of your visit. The best of luck to you both!"},{"name":"SAWNEY","text":"Do look after her, <span class=\"highlight\">Forename</span>. Edgyth's like the little sister I never had. Doesn't bear thinkin' about what I'd do if somethin' happened to her..."},{"name":"FUFUCHA","text":"You have my full confidence, <span class=\"highlight\">Forename</span>. There is no one I would trust more with this."},{"name":"EDGYTH","text":"<span class=\"highlight\">Forename</span>, I was wondering when you'd get here! An Ala Mhigan Twin Adder officer gave me the most scrumptious morsel of information!"},{"name":"EDGYTH","text":"He claimed to have heard of a plant used to prevent pests being grown in a village named Ala Ghiri. I'm not the only one that thinks this sounds like exactly what we're searching for, am I...?"},{"name":"EDGYTH","text":"He followed this up by saying its surroundings are fraught with danger and it is no place for little lady botanists to be poking around. Honestly, the cheek of the man! All his words have done is hardened my resolve. Come, <span class=\"highlight\">Forename</span>, to Ala Ghiri we go!"},{"name":"EDGYTH","text":"Well, this seems to be the place. Let's try asking around about Rhalgr's streak."},{"name":"EDGYTH","text":"Sorry, I know you're all incredibly busy, but would you have time to answer a question or two?"},{"name":"FRAUNK","text":"Rhalgr's streak? I stocked the stuff for a while, but then the area's pest problem got sorted out and nobody wanted it anymore. The smell wasn't for everyone, you see."},{"name":"GERBOD","text":"Ah, yes. They were brought here from the Lochs for their pest-preventing qualities. No idea what was done with 'em after the vermin problem had been solved, mind you. You might have better luck asking someone else. Sorry, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"ALDRUTH","text":"Now that's a name I've not heard in a fair while. Memory's a bit foggy, but I'm pretty sure it was a wildflower found far out in the mountains. Who knows, there could still be a patch of them growing somewhere."},{"name":"FRAUNK","text":"Oof, just remembering that smell is enough to make my nose close up. Happy to have seen the last of that flower, I am."},{"name":"GERBOD","text":"From what I've heard it's native to the Lochs. Sad to say that's as far as my knowledge stretches."},{"name":"ALDRUTH","text":"From what I know, it's a wildflower found on the mountains near the Lochs. If you're in luck, there might still be a patch of them growing somewhere."},{"name":"EDGYTH","text":"Right, so from what we've heard, odds are that Rhalgr's streak grows on a mountain somewhere in the Lochs, far away from any settlements."},{"name":"EDGYTH","text":"I'm going to head back to Idyllshire lest I risk truly getting in your way. I'll make sure to prepare the Mudplots for your return; assuming everything goes swimmingly, all you'll need to do is plant the flowers and we'll be well on our way to a pest-free future!"},{"name":"EDGYTH","text":"Well, I suppose you shall actually have to find the flower first. Although, I don't imagine that will trouble you too much. If you can spot a tiny little eelworm egg, you can surely spot a flower!"},{"name":"EDGYTH","text":"You should be able to find Rhalgr's streak somewhere in the Lochs. It's time to put those eagle eyes to use once more!"},{"name":"EDGYTH","text":"This is Rhalgr's streak? It's...it's...beautiful. It's stunningly beautiful, and yet, beautifully stunning. All at the same time!"},{"name":"EDGYTH","text":"Right, Edgyth, that's enough excitement for now. Think calming thoughts... Sorry for that, <span class=\"highlight\">Forename</span>. Everything's ready. All that remains is to plant the flowers!"},{"name":"EDGYTH","text":"Phew! Who knew planting flowers could be such tiring work. I have to say, even though we only planted them to rid ourselves of pests, they've done wonders for the Mudplots' overall image!"},{"name":"SAWNEY","text":"Ha ha! Now if that ain't a sight for sore eyes! The smell's not half bad either. Fantastic work, <span class=\"highlight\">Forename</span>!"},{"name":"FUFUCHA","text":"It seems I was right to entrust this task to the guild's finest botanist. I honestly do not know if we could have done this without you, <span class=\"highlight\">Forename</span>."},{"name":"EDGYTH","text":"I can't believe my eyes..."},{"name":"SAWNEY","text":"It's one surprise after another today! To think that any of the first batch of popotoes survived. These little guys are tough, that's for sure."},{"name":"EDGYTH","text":"I was absolutely positive they were all done for... Thank you for staying strong, little ones. It will be all right from now on."},{"name":"EDGYTH","text":"I shall make sure of it."},{"name":"FUFUCHA","text":"Having seen how far you have come, I too have the utmost confidence in you, Edgyth. However, allow me to give you a helping hand of sorts."},{"name":"EDGYTH","text":"But this garb is only given to the most accomplished of botanists! You may say I have grown of late, but I cannot bring myself to believe I am worthy of such an honor."},{"name":"FUFUCHA","text":"Now, now, do not be so harsh on yourself. It is true that you have only made but the first step on the long road to becoming a great botanist. However, it is precisely with that in mind that I saw fit to furnish you with this gift. Think of it as a sign of my steadfast belief in your future."},{"name":"FUFUCHA","text":"A future which you are now more than strong enough to cultivate on your own. While <span class=\"highlight\">Forename</span> and I will no longer be actively helping you, we shall certainly be keeping a watchful eye on your progress. I wish you the best of luck, first botanist of Idyllshire."},{"name":"EDGYTH","text":"F-F-First... I'm going to pretend I didn't hear that to stop myself from fainting. But I promise you all, I shall work in tandem with nature to carve Idyllshire's name firmly into botanic history, starting with these popotoes!"},{"name":"SYSTEM","text":"In blazing new trails as a botanist, you have learned “Enhanced GP Regeneration”!"}],"reward":{"items":[{"id":5688},{"id":5693},{"id":5698}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":18}],"quests":[68159]}},"partials":[{"type":"npc","id":"1021349","obj":{"i":1021349,"n":"Edgyth","l":2082,"q":5}},{"type":"npc","id":"1000815","obj":{"i":1000815,"n":"Fufucha","l":53,"q":20,"t":"Guildmaster"}},{"type":"npc","id":"1020870","obj":{"i":1020870,"n":"Fraunk","l":2407,"q":3}},{"type":"npc","id":"1021351","obj":{"i":1021351,"n":"Edgyth","l":53,"q":4}},{"type":"npc","id":"1021358","obj":{"i":1021358,"n":"Edgyth","l":2406,"q":1}},{"type":"npc","id":"1021359","obj":{"i":1021359,"n":"Edgyth","l":2407,"q":1}},{"type":"npc","id":"1021591","obj":{"i":1021591,"n":"Gerbod","l":2407,"q":5}},{"type":"npc","id":"1021595","obj":{"i":1021595,"n":"Aldruth","l":2407,"q":2}},{"type":"npc","id":"1022381","obj":{"i":1022381,"n":"Edgyth","l":2407,"q":1}},{"type":"item","id":"5688","obj":{"i":5688,"n":"Gatherer's Guerdon Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Gathering","category":2}}},{"type":"item","id":"5693","obj":{"i":5693,"n":"Gatherer's Guile Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Perception","category":2}}},{"type":"item","id":"5698","obj":{"i":5698,"n":"Gatherer's Grasp Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":6,"attr":"GP","category":2}}},{"type":"item","id":"17948","obj":{"i":17948,"n":"Rhalgr's Streak","l":290,"c":25507,"t":54}},{"type":"quest","id":"68159","obj":{"i":68159,"n":"The White Death","g":145,"l":"Idyllshire","s":680,"f":1}}]}