{"quest":{"name":"Here There Be Xaela","location":"Yanxia","id":68166,"patch":4.0,"sort":570,"icon":100652,"eventIcon":71201,"issuer":1020068,"target":1020079,"involved":[1020066,1020067,1020069,1020070,1020073,1020074,1020075,1020076,1020077,1020078,1020080,1020081],"genre":6,"journal":["Yugiri is ready to guide you to the Azim Steppe.","Though your attempt on Zenos's life ended in failure, it spurred the people of Doma to rise up and openly oppose the imperials in battle. Convinced that this is the sign that Lord Hien has been waiting for, you and your comrades embark on a journey to the Azim Steppe to seek out the young heir and convince him to return to lead his people in a new rebellion against the Empire. And so you depart once more for the Ruby Sea, and a familiar fishing village on the coast.","From Isari you must continue north, towards a tunnel leading through the mountains. Yugiri spares only a moment to tell you this before leaving the village, eager to catch up to Lyse and Gosetsu.","The Steppe is vast and endless, and possessed of a quiet solemnity. Lyse too seems struck by the sight, and once more you note the faraway look in her eyes, as if she yearns to hold tight to this moment, this memory...","Yugiri tells you that what you see before you is but a fraction of a greater whole. To the north lies Reunion─your destination, and the ninja bids you follow.","You come to the gates of what appears to be a bustling marketplace, filled with Xaela from all across the Steppe. It is here where you will begin your search for Lord Hien. With luck, it will not take too long..."],"objectives":["Follow Yugiri to Isari.","Journey to the Azim Steppe.","Speak with Yugiri."],"dialogue":[{"name":"LYSE","text":"So, um, what kind of place is the Azim Steppe?"},{"name":"ALPHINAUD","text":"A pity we have no time to speak at length, but there is no rest for the righteous. Godsspeed!"},{"name":"ALISAIE","text":"We both have long roads ahead of us. Good luck to us both, eh?"},{"name":"GOSETSU","text":"I should not be surprised that he sought refuge in the Steppe. We were separated during a skirmish in the northern mountains..."},{"name":"YUGIRI","text":"If all are ready, let us depart for Reunion in the Azim Steppe."},{"name":"YUGIRI","text":"Our route will be somewhat circuitous. We will need to return to the Ruby Sea and head north along the coast, past Isari..."},{"name":"YUGIRI","text":"From here we will turn north until we arrive at a cave, through which we must pass in order to reach the Azim Steppe."},{"name":"YUGIRI","text":"Lyse and Gosetsu have already gone on ahead. We should carry on as well."},{"name":"LYSE","text":"The people of Isari seem to be doing well. That's a relief..."},{"name":"GOSETSU","text":"Ah, there you are! This is the cave. After you, <span class=\"highlight\">Forename</span>!"},{"name":"LYSE","text":"It's very...flat. Except where it's not, I suppose."},{"name":"GOSETSU","text":"Othard is vast and filled with many different peoples. I know next to nothing about the Xaela and their ways─but we shall learn together, shall we not?"},{"name":"YUGIRI","text":"I give you the Azim Steppe, <span class=\"highlight\">Forename</span>. Though I should say that this is but one small portion of it."},{"name":"YUGIRI","text":"Despite the close proximity, Domans rarely venture this far north. Most find these lands and their people strange and foreign..."},{"name":"YUGIRI","text":"Fortunately, those who frequent Reunion are more welcoming than most. Come─it is not much further."},{"name":"LYSE","text":"Is it just me, or is everyone here Xaela?"},{"name":"GOSETSU","text":"I must confess that this is my first time on the Steppe..."},{"name":"YUGIRI","text":"Welcome to Reunion, my friends. Here is where we will begin our search for Lord Hien."}],"reward":{"gil":959,"items":[{"num":3,"id":5718}],"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":142}],"quests":[68035]},"next":[68036]},"partials":[{"type":"npc","id":"1020068","obj":{"i":1020068,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1020079","obj":{"i":1020079,"n":"Yugiri","l":2411,"q":3}},{"type":"npc","id":"1020066","obj":{"i":1020066,"n":"Alisaie","l":2410,"q":2}},{"type":"npc","id":"1020067","obj":{"i":1020067,"n":"Alphinaud","l":2410,"q":2}},{"type":"npc","id":"1020069","obj":{"i":1020069,"n":"Gosetsu","l":2410,"q":1}},{"type":"npc","id":"1020070","obj":{"i":1020070,"n":"Lyse","l":2410,"q":1}},{"type":"npc","id":"1020073","obj":{"i":1020073,"n":"Yugiri","l":2409,"q":1}},{"type":"npc","id":"1020074","obj":{"i":1020074,"n":"Gosetsu","l":2409,"q":1}},{"type":"npc","id":"1020075","obj":{"i":1020075,"n":"Lyse","l":2409,"q":1}},{"type":"npc","id":"1020076","obj":{"i":1020076,"n":"Yugiri","l":2411,"q":1}},{"type":"npc","id":"1020077","obj":{"i":1020077,"n":"Lyse","l":2411,"q":1}},{"type":"npc","id":"1020078","obj":{"i":1020078,"n":"Gosetsu","l":2411,"q":1}},{"type":"npc","id":"1020080","obj":{"i":1020080,"n":"Lyse","l":2411,"q":2}},{"type":"npc","id":"1020081","obj":{"i":1020081,"n":"Gosetsu","l":2411,"q":2}},{"type":"item","id":"5718","obj":{"i":5718,"n":"Quickarm Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Skill Speed","category":0}}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68036","obj":{"i":68036,"n":"The Search for Lord Hien","g":6,"l":"The Azim Steppe","s":580}}]}