{"quest":{"name":"To Kill a Coeurl","location":"Rhalgr's Reach","id":68169,"patch":4.0,"sort":10020,"icon":112233,"unlocksFunction":1,"eventIcon":71341,"issuer":1019479,"target":1023611,"involved":[1019473],"genre":103,"journal":["Ortwin has been thinking a lot about the Temple of the Fist lately.","Ortwin explains to you that Rhalgr's Reach used to be a pilgrimage site for followers of the Fist of Rhalgr. Atop the mountain lies the remnants of the Temple of the Fist, which was once the religion's center. Recently, a lady named Marjorie approached Ortwin saying that she wished to explore the temple ruins herself. Ortwin is willing to allow her entry on the condition that you accompany her.","Speaking with Marjorie, you quickly realize she has more than a passing interest in the Fist of Rhalgr. Her curiosity was piqued after attending a lecture given by a historian named Erik. Seeing how desperate she is to explore the Temple of the Fist, you agree to accompany her.<br><br>※The Temple of the Fist can be accessed via the Duty Finder.","As expected, the temple is filled with various traps and obstacles set up by the monks to aid them in their training. You make your way as far as the Closed Fist, where you do battle with the specter of Ivon Coeurlfist. You head back to meet with Marjorie to tell her just what you saw in the recesses of the temple ruins.","Upon hearing of your meeting with Ivon Coeurlfist, Marjorie decides that she must become a monk and see him for herself. She thanks you for your help and hurries off to begin her training. Only time will tell if she is able to realize her dream of meeting the legendary monk."],"objectives":["Speak with Marjorie.","Enter the Temple of the Fist.","Report to Marjorie."],"dialogue":[{"name":"ORTWIN","text":"Ah, <span class=\"highlight\">Forename</span>, just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was looking for."},{"name":"ORTWIN","text":"As you may know, Rhalgr's Reach used to be a pilgrimage site for followers of the Fist of Rhalgr. Atop the mountain lies the remnants of the Temple of the Fist, which was once the center of their religion."},{"name":"ORTWIN","text":"It was filled with monks training their minds and bodies right up until the mad king Theodoric decided to raze the temple. Curiously enough, a young lady recently approached me saying she wishes to explore the ruins herself."},{"name":"ORTWIN","text":"I immediately turned down her request, knowing that she alone could not survive the route to the ruins. But then I thought of you. I am positive that you are strong enough to protect her while she explores."},{"name":"ORTWIN","text":"The girl's name is Marjorie. If you are willing to help, seek her out by the doors which lead to the temple. I imagine she is still there pestering Hrotmar to let her in."},{"name":"ORTWIN","text":"The girl's name is Marjorie. If you are willing to help, seek her out by the doors which lead to the temple. I imagine she is still there pestering Hrotmar to let her in."},{"name":"MARJORIE","text":"Are you also interested in exploring the Temple of the Fist? I never dreamed I would meet a fellow enthusiast!"},{"name":"MARJORIE","text":"I first learned of monks when I attended a lecture given by a historian named Erik. Ever since then I have continued to be fascinated by their creed and approach to life."},{"name":"MARJORIE","text":"I thought I would come and pay a visit to the site of their most revered temple, now that the Empire has been driven out of the region. The only issue is this man will not let me pass!"},{"name":"HROTMAR","text":"The monks used the path to the temple to train. It is filled with all kinds of traps and obstacles that cannot be overcome by just anyone."},{"name":"MARJORIE","text":"It is precisely those traps and obstacles that I wish to study! Everything I have read states that those who are able to reach the temple will come face-to-face with a monk of legend."},{"name":"MARJORIE","text":"Does that not pique your curiosity in the slightest? Who knows what kind of lessons one could learn from a monk that has mastered their art. You wish to know, don't you, adventurer?"},{"name":"MARJORIE","text":"You too are a monk? I can hardly believe my luck! Now I see why you also wish to visit the temple ruins."},{"name":"MARJORIE","text":"You are the one who helped the Resistance defeat Zenos yae Galvus? Well, you should be more than capable of handling whatever the temple has to throw at you then!"},{"name":"MARJORIE","text":"In fact, if you are truly keen to explore what lies beyond these doors, would you mind if I joined you?"},{"name":"MARJORIE","text":"I am fairly familiar with the layout of the temple grounds from all the reading I have done. I know I can be of help. Oh, please take me with you!"},{"name":"MARJORIE","text":"I cannot wait to walk upon the very grounds where so many monks trained tirelessly. And that is not to mention the monk of legend who awaits us in the Closed Fist!"},{"name":"HROTMAR","text":"Sorry to trouble you like this. Please make sure she makes it through unharmed."},{"name":"HROTMAR","text":"Good to see you safely returned! Were you able to meet this legendary monk in the end?"},{"name":"MARJORIE","text":"I too am most eager to hear just what went on in the Closed Fist."},{"name":"MARJORIE","text":"You fought with Ivon Coeurlfist!?"},{"name":"MARJORIE","text":"I have read that he honed his martial prowess by wandering the mountains, fighting all the coeurls he could find. They say he took the creatures' movements for his own, devising a style of fighting like no other."},{"name":"MARJORIE","text":"To think he had been waiting there all this time for a new challenger..."},{"name":"MARJORIE","text":"My mind is made up. I too will become a monk!"},{"name":"MARJORIE","text":"Hearing your story, I realized that I must meet Ivon Coeurlfist myself."},{"name":"MARJORIE","text":"I will need to strengthen both my body and mind to have any chance of reaching him."},{"name":"MARJORIE","text":"And I plan to start by working on my mind. There is still much I need read about the monks and their religion."},{"name":"MARJORIE","text":"Or perhaps I would be better served by searching for a local that is versed in the Fist of Rhalgr?"},{"name":"MARJORIE","text":"Ah, allow me to thank you! I would not have awoken to my true calling had you not shown me the temple ruins."},{"name":"MARJORIE","text":"The next time our paths cross I imagine I will look somewhat different. Until then!"},{"name":"HROTMAR","text":"I can definitely say I have never met a monk quite like her. It will be interesting to see just how far she is able to go."}],"reward":{"gil":3997,"xp":0,"instance":51},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68089]}},"partials":[{"type":"npc","id":"1019479","obj":{"i":1019479,"n":"Ortwin","l":2403,"q":2}},{"type":"npc","id":"1023611","obj":{"i":1023611,"n":"Marjorie","l":2403,"q":1}},{"type":"npc","id":"1019473","obj":{"i":1019473,"n":"Hrotmar","l":2403,"q":2}},{"type":"instance","id":"51","obj":{"i":51,"n":"The Temple of the Fist","c":61801,"t":"Dungeons","min_lvl":70,"max_lvl":70,"min_ilvl":280,"max_ilvl":340}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}}]}