{"quest":{"name":"An Art for the Living","location":"Gridania","id":68165,"patch":4.0,"sort":700,"icon":100677,"unlocksFunction":1,"eventIcon":71341,"issuer":1006756,"target":1006756,"involved":[1022764,1022785,1022786,1022787,1022788,1022789,1022790,1022791,1022792,1022793,1022794,1023459,1023595],"genre":155,"journal":["Y'mhitra is ready to depart for Azys Lla.","Y'mhitra tells you what she has learned in preparation for your journey to the research facility on Azys Lla, and informs you that Captain Wolf and his summoner squad will be providing military support. Make ready for the expedition, then rendezvous with your companions at Helix.","You join Y'mhitra and the others on Azys Lla, and the scholar urges you to begin the search for a control panel of some kind. Head towards your assigned area near the statues of the Warring Triad, and seek out a research facility terminal.","You approach a promising control panel only to find yourself set upon by a trio of clockwork soldiers. After defeating your ambushers, you once more stretch forth a hand to operate the terminal...","Your efforts at the terminal are rewarded by the appearance of Sari, who then proceeds to lay his challenge at your feet. Your companions arrive in time to witness the exchange, and Y'mhitra suggests that the “clone” is, in fact, some manner of summoned entity. Her observation seems supported by the evidence at hand, but gives rise to yet another question: who, then, is the summoner? Prepare yourself to face the formidable egi, then speak with Captain Wolf when you are ready to enter the facility.","After a shocking revelation, you discover that the strings of the Sari-egi were being pulled by a sentient machine─an invention of Sari's which describes itself as an “evocation matrix.” All attempts to reason with the warped intelligence fail, and you and your companions are drawn into a battle of surreal proportions. Despite the bewildering capabilities of your opponent, however, you seize victory over the mechanical summoner. Join Y'mhitra by the statues of the Warring Triad, and discuss the aftermath of the battle.","With the evocation matrix destroyed, you have removed the final barrier to learning the secrets held within Principia's pages. Say your farewells to the summoning squad, and return to Gridania with Y'mhitra.","Upon your return, Captain Wolf shares the results of his last-moment investigation. He reports that he salvaged a number of soul crystals from the wreckage of the machine, as well as an accompanying record which explains the master summoner's descent into a bitter pessimism. You muse over Sari's disparate attempts to bequeath summoning to future generations, and the philosophical differences evident in the construction of Principia and the evocation matrix. The familiar itself seems satisfied to have entrusted you with its creator's knowledge, and content to leave the succession of summoning magic in your capable hands. Principia returns to its slumber, its purpose fulfilled...for now.<br><br>※The next summoner quest will be available from Y'mhitra once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “A Tearful Reunion.”"],"objectives":["Rendezvous with Y'mhitra at Helix.","Search for a research facility terminal.","Operate the research facility terminal.","Speak with Dancing Wolf.","Speak with Y'mhitra at Helix.","Speak with Y'mhitra in Gridania.","Defeat the evocation matrix!"],"dialogue":[{"name":"PRINCIPIA","text":"This simulacrum of Master Sari has sought to obstruct my creator's will, and I shall offer it no quarter. You deserve to learn the wisdom within my pages!"},{"name":"YMHITRA","text":"I've learned all there is to be learned about the research facility. The time has come to make our move!"},{"name":"YMHITRA","text":"From what my sister and her colleagues have told me, the laboratories are housed in an extremely dangerous quadrant of Azys Lla. We'll not want to wander around inviting trouble, but rather plot the swiftest and safest route to our destination."},{"name":"YMHITRA","text":"There should be a terminal somewhere that will allow us to pinpoint the section where Sari's research is being stored. Once we arrive on Azys Lla, finding such a terminal will be our highest priority."},{"name":"YMHITRA","text":"Ah, I've informed Captain Wolf of our forthcoming expedition─he insisted that he and his summoner squad provide us with support. Let us make ready and meet them at Helix."},{"name":"DANCINGWOLF","text":"Have these ruins truly existed for thousands of years? It's all so bright and sharp..."},{"name":"CRISPIN","text":"There are beasts from my worst nightmare simply strolling around up here. Prin tells me they would have been contained in the days when the Allagans yet worked at this facility."},{"name":"DENISE","text":"Everywhere I turn there's a new wonder. I've pinched myself ten times already just to be sure I was awake..."},{"name":"JAJASAMULALASAMU","text":"So, this is what ye get when ye fuse the arcane with the mechanical, an' neither is diminished by the result."},{"name":"YMHITRA","text":"Azys Lla...<br>Sari could hardly have chosen a more distant place to take refuge."},{"name":"PRINCIPIA","text":"The name of Azys Lla is known to me. Its facilities were constructed by the oppressors in the military, however, so I was never welcomed there..."},{"name":"YMHITRA","text":"Azys Lla is even more fantastical than I'd imagined...<br>But we mustn't let ourselves be distracted by the scenery! We should fan out and search for a control panel of some description."},{"name":"DANCINGWOLF","text":"And we can use that to plan the simplest route to our objective, yes?"},{"name":"JAJASAMULALASAMU","text":"Aye, then we plunge ahead, swift an' sure, an' bring an end to this bastard clone!"},{"name":"YMHITRA","text":"That is my intention. 'Tis important to note, however, that we have yet to determine if our enemy is truly a clone or not."},{"name":"YMHITRA","text":"Even an artificial copy would appear as a living, breathing being. The man you fought on Seal Rock seemed almost...otherworldly."},{"name":"DANCINGWOLF","text":"I'm inclined to agree with you, Y'mhitra. But no matter what he is, we need to slay him to lift Prin's seal. The job remains the same."},{"name":"YMHITRA","text":"True enough. Then we should first focus on finding that terminal. <span class=\"highlight\">Forename</span>, if you would, pray search around the base of the Warring Triad statues."},{"name":"DANCINGWOLF","text":"Keep your guard up─if Sari knows we're coming, he may have prepared a welcome!"},{"name":"BALLOON","text":"Unauthorized access detected."},{"name":"BALLOON","text":"Initiating countermeasures."},{"name":"BALLOON","text":"Target acquired."},{"name":"SARI","text":"I predicted you would be the first to find me. A lesser summoner would have been slain..."},{"name":"YMHITRA","text":"<span class=\"highlight\">Forename</span>!"},{"name":"DENISE","text":"Sari's clone! It's here!"},{"name":"SARI","text":"...Clone? Ah, you seek to explain my existence."},{"name":"SARI","text":"An understandable theory, but I am far more than one of those clumsy creations. You had best abandon this flawed perception, lest it lead you down the path to failure."},{"name":"SARI","text":"I shall await you inside, potential. You will pass my test─your true final challenge─or you will die never knowing what I truly am."},{"name":"DANCINGWOLF","text":"Thal's teeth! He's gone again!"},{"name":"YMHITRA","text":"Did you see that, <span class=\"highlight\">Forename</span>!? The way he vanished? 'Tis akin to the dismissal of a summoned entity!"},{"name":"JAJASAMULALASAMU","text":"So yer sayin' he's some sort of egi? One what's wearin' Sari's face? But how can he look so solid an'...well, alive?"},{"name":"PRINCIPIA","text":"With the aid of a computational machine, it would be theoretically possible to reconstruct aether into a near-perfect replica of Sari's corporeal form."},{"name":"CRISPIN","text":"He was summoned using a machine...?"},{"name":"PRINCIPIA","text":"Correct. Master Sari's research developed mechanical substitutes for grimoires. In fact, the lieutenant is standing right in front of one."},{"name":"JAJASAMULALASAMU","text":"...This thing, eh? It looks a bit like them tomeliths on Seal Rock, only they was much bigger... Gods, can the bugger pop up anywhere there's one of these devices!?"},{"name":"YMHITRA","text":"Aye. I think we can now safely assume that this Sari is the product of enhanced summoning magic."},{"name":"YMHITRA","text":"But our answer leaves us with yet another question: if Sari is the “egi,” then who is the summoner? Even if the grimoire is replaced by a machine, there must still exist the one who commands it."},{"name":"JAJASAMULALASAMU","text":"We've got to find the master then. If we don't squash the summoner, the bastard'll just bring the Sari-egi back again an' again' an' again..."},{"name":"PRINCIPIA","text":"Whomever the “bastard” may be, he or she must be concealed somewhere nearby. An entity will always be summoned within a certain distance of the summoner─even machine-enhanced techniques cannot circumvent this basic principle."},{"name":"PRINCIPIA","text":"That our antagonist chose not to make an appearance on Seal Rock suggests a reluctance to expose oneself to direct harm. In this location, however, with so many computational devices near to hand, I expect the foe's art will be significantly bolstered."},{"name":"DANCINGWOLF","text":"So the egi will be even stronger than last time? All the more reason to take down this summoner quickly before we're swamped by aetherial horrors."},{"name":"YMHITRA","text":"Well, I've brought a little device that should help─an aetherometer I borrowed from my sister, Shtola. If I can detect the right currents, it should lead us straight to our hidden enemy."},{"name":"DANCINGWOLF","text":"Excellent, Y'mhitra. That may make all the difference. Right, let's be about this, then! Summoner squad! Take the van and clear the way forward."},{"name":"JAJASAMULALASAMU","text":"Aye, we've been waitin' for the chance to prove ourselves. Ye just focus on findin' the summoner, an' we'll sweep aside the dregs!"},{"name":"YMHITRA","text":"The summoner squad will see to it that we have a clear path through the facility. Let us move swiftly, and repay their dedication with a resounding victory!"},{"name":"PRINCIPIA","text":"Go forth and defeat this impostor, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. The wisdom of my creator belongs to you..."},{"name":"CRISPIN","text":"We've not been idle since that last debacle, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I'm eager to show you the results of our training."},{"name":"DENISE","text":"Well, you couldn't ask for a more dramatic locale for a final confrontation. Assuming we survive all this, we'll sure have a tale to tell our barracks-mates!"},{"name":"JAJASAMULALASAMU","text":"Whatever support ye need, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, we're here to give it. We'll not leave till ye've busted that summoner's head an' got the rewards ye damn well deserve!"},{"name":"DANCINGWOLF","text":"Ready for round two, <span class=\"highlight\">Forename</span>? The terminal has provided us with a direct route to the research storage chamber. We're going to rip through this facility and take Sari's clone apart!"},{"name":"PRINCIPIA","text":"It is an aetherial entity, Captain Wolf, not a clone. And I must point out that your true objective is the summoner, rather than the servant."},{"name":"DANCINGWOLF","text":"Right, right, I knew that! As we planned, then! Summoner squad front and center─carve <span class=\"highlight\">Forename</span> a path through!"},{"name":"JAJASAMULALASAMU","text":"Aye, Captain."},{"name":"DANCINGWOLF","text":"Y'mhitra, you're in charge of finding whoever's pulling this impostor Sari's strings. Let's go!"},{"name":"SARI","text":"Wonderful. You've done well to make it this far."},{"name":"DANCINGWOLF","text":"The summoner has to be around here somewhere. Y'mhitra, use your gadget─I'll buy you some time."},{"name":"DANCINGWOLF","text":"We came here to remove the seal you put on Principia. Do as we ask, and this can all end peacefully."},{"name":"SARI","text":"I'm sorry, “Captain.” I'm afraid I can't do that. To do so would run contrary to the purpose for which I was created."},{"name":"SARI","text":"Surely by now you have come to realize my true nature?"},{"name":"PRINCIPIA","text":"You are an egi in the form of my creator─an existence made possible through a fusion of summoning magic and aetherochemical technology."},{"name":"PRINCIPIA","text":"But while Master Sari was the last of the great summoners of Allag, you are naught more than an elaborate imitation. And you are no match for the summoner who now stands before you!"},{"name":"SARI","text":"Very good, but your conjecture has missed the mark. What I am is a defense mechanism that is capable of self-enhancement in order to combat ever greater threats."},{"name":"SARI","text":"Shall I phrase this in simple terms? In the event that I encounter a presence with greater potential than Sari, I am compelled to harness that potential through main force, and compose its aether into a new guardian entity."},{"name":"DANCINGWOLF","text":"You mean to kill <span class=\"highlight\">Forename</span> and make an egi of the Warrior of Light!?"},{"name":"SARI","text":"Have we reached an understanding? A peaceable conclusion to this encounter was never forthcoming."},{"name":"PRINCIPIA","text":"His reasoning has broken down. Your deeds have saved countless lives, and will continue to do so. How can one justify killing you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>, when you embody the very principles for which summoning magic was invented?"},{"name":"DANCINGWOLF","text":"Y'mhitra! Any luck finding that summoner!?"},{"name":"YMHITRA","text":"I've just finished tracing the threads...<br>The camouflage is impressive, but I am still shocked that we missed something of that size."},{"name":"YMHITRA","text":"Our true enemy...is up there!"},{"name":"SARI","text":"How observant of you. You have uncovered master summoner Sari's greatest masterpiece: an artificially sentient evocation matrix."},{"name":"SARI","text":"The complexity of my design simply cannot be compared to the primitive principles used in Principia's construction."},{"name":"SARI","text":"Your defeat is inevitable."},{"name":"PRINCIPIA","text":"Tough talk for an aging machine whose logic channels have obviously rusted with disuse! <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>, might you and your companions dispose of this unsightly and unseemly amalgamation of refuse?"},{"name":"YMHITRA","text":"Three at once...<br>Stay focused! We can afford no missteps!"},{"name":"DANCINGWOLF","text":"There'll be no false steps from us!<br>Isn't that right, <span class=\"highlight\">Forename</span>?"},{"name":"QIB","text":"Potential confirmed as priority target for aetherial reconstitution. Evocation reinitialized."},{"name":"DANCINGWOLF","text":"Thal's teeth, more of the damn things!?<br>Where does it end?"},{"name":"QIB","text":"Steel yourself, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>!<br>The machine means to overwhelm you!"},{"name":"QIB","text":"Your combined strength is...unexpected.<br>Accessing security systems...reviving bioweapon."},{"name":"YMHITRA","text":"Sari's speech─it's become stilted!<br>It strains to maintain the charade!"},{"name":"QIB","text":"&lt;buzz&gt; Alert! Alert!<br>System overload detected. Deploying advanced security measures."},{"name":"DANCINGWOLF","text":"Uh, I think we made it angry...<br>But that must mean we're winning!"},{"name":"QIB","text":"&lt;buzz&gt; Exterminate hostile entities!<br>Ex... Ex... Exterminate!"},{"name":"QIB","text":"The system has recognized you as a legitimate threat.<br>Its primary directive is overridden! It means to destroy you by any means!"},{"name":"QIB","text":"&lt;buzz&gt; &lt;buzz&gt; &lt;beeeeeep&gt;<br>Exter... &lt;buzz&gt; ...minate..."},{"name":"QIB","text":"The machine is out of control!<br>One last push, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>, and victory will be yours!"},{"name":"DANCINGWOLF","text":"What in the seventh hell!<br>We can't fight all of them!"},{"name":"YMHITRA","text":"Ignore the Sari-egi! Destroy the machine!"},{"name":"QIB","text":"Reinitializing assessment... Analysis failed...<br>Retry... Analysis failed... Unexpected error..."},{"name":"YMHITRA","text":"We did it, <span class=\"highlight\">Forename</span>! We won!"},{"name":"QIB","text":"I never doubted you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>.<br>May I suggest we now exit this unpleasant place?"},{"name":"DANCINGWOLF","text":"But I've fought...primals...ugh..."},{"name":"YMHITRA","text":"Forgive me, <span class=\"highlight\">Forename</span>..."},{"name":"PRINCIPIA","text":"An inspiring triumph, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>! Your coordination with Lady Y'mhitra and Captain Wolf was truly a thing of beauty!"},{"name":"CRISPIN","text":"I wish I could have seen your victory firsthand. As things stood, we were far too busy keeping the rest of the facility's hostiles at bay..."},{"name":"DENISE","text":"Congratulations, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! Never in my wildest dreams did I imagine a thinking machine would be the villain behind all this chaos."},{"name":"JAJASAMULALASAMU","text":"So a machine built by Sari was summonin' an egi what looked like Sari...<br>Them Allagans didn't see much use for the line betwixt idea an' reality, did they?"},{"name":"YMHITRA","text":"Oh...hello. We were not to meet by the Warring Triad statues? I shall be there─I promise!"},{"name":"PRINCIPIA","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>? I thought you were on Azys Lla...? Now that I mention it, I thought <span class=\"emphasis\">I</span> was on Azys Lla..."},{"name":"YMHITRA","text":"A stunning victory, <span class=\"highlight\">Forename</span>! We've won the day, but Captain Wolf wished to stay behind and conduct a thorough search. I told him it was still too dangerous to wander around alone, but..."},{"name":"CRISPIN","text":"...But the captain is a stubborn man. Not to worry, though─if aught should happen, we'll soon charge off to fight at his side."},{"name":"DENISE","text":"Captain Wolf will call if he needs us, aye. We should be celebrating here! Does this not mean Prin's seal is now broken!?"},{"name":"PRINCIPIA","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>'s success is indeed something to be celebrated. I was not crafted to experience emotion, but I do feel a certain rustle of satisfaction in my pages..."},{"name":"JAJASAMULALASAMU","text":"Once ye've mastered them high-an'-mighty techniques, ye'll be stronger than ever... Well, I think I'd rather learn by yer example anyway, instead o' from musty scrolls written by some long-dead Allagan summoner!"},{"name":"PRINCIPIA","text":"It is in the hopes of achieving just such an outcome that I awoke from my slumber. “The art of summoning is for the living,” as my creator was once so fond of declaring."},{"name":"YMHITRA","text":"<span class=\"highlight\">Forename</span>, Prin, let us say our farewells for the moment. Thank you for your aid, everyone─we could not have done this without you!"},{"name":"CRISPIN","text":"We will wait here for the captain. As much as I would've liked to assist you in the main battle, I am proud that we contributed to your success."},{"name":"DENISE","text":"So a machine was using machines to summon egi...<br>Can you even call that magic anymore? Or is it just another form of technology...?"},{"name":"JAJASAMULALASAMU","text":"Don't get lazy with yer summonin', now! The next time we meet, I mean to be yer equal in the art!"},{"name":"DANCINGWOLF","text":"I completed a thorough investigation of the research facility before I left. My findings were worth the time and the danger, I think!"},{"name":"PRINCIPIA","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. It is almost “that time”..."},{"name":"YMHITRA","text":"Welcome back, <span class=\"highlight\">Forename</span>! You were only meant to face three challenges, and we ended up chasing your prize into the heavens themselves."},{"name":"PRINCIPIA","text":"An unexpected development which you handled with exceptional grace, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>. And now, at long last, I can finally bequeath to you the highest secrets of summoning! Pray step forward!"},{"name":"YMHITRA","text":"What a momentous occasion! The wisdom of the last of Allag's master summoners is yours!"},{"name":"YMHITRA","text":"Ere you depart to explore your newfound powers, however, Captain Wolf has a report for us. It should explain much of what occurred on Azys Lla..."},{"name":"DANCINGWOLF","text":"Aye, well I wanted to be sure that machine was truly undone, and after poking around inside it I discovered a number of soul crystals. According to Principia, they belonged to Sari's disciples."},{"name":"YMHITRA","text":"The captain also unearthed a tomestone containing undoctored records of that age. 'Twould seem that following the murder of his students, Sari became increasingly bitter."},{"name":"YMHITRA","text":"He began to doubt that the future could be safely entrusted to the capricious whims of mortals. Instead he explored other methods by which new generations might be safeguarded from the threat of primals, and committed himself to aetherochemical research."},{"name":"PRINCIPIA","text":"As you may have surmised, the evocation matrix was the end result of Master Sari's toil. Drawing on its embedded soul crystals and unrivaled computational power, this terrible invention was capable of manifesting a veritable host of aetherial avatars..."},{"name":"DANCINGWOLF","text":"Once he was satisfied with his work, Sari commanded the machine to act as civilization's mightiest guardian. And then he killed himself. His aetherial essence was absorbed, and a formidable egi was added to his invention's arsenal."},{"name":"DANCINGWOLF","text":"So now you know the truth of it."},{"name":"YMHITRA","text":"What a price to pay to ensure that the art of summoning survived unto the morrow...<br>After failing to protect his disciples, I wonder if he meant to preserve their soul crystals in their stead?"},{"name":"DANCINGWOLF","text":"Even if that were his intention, he chose the wrong way to achieve it."},{"name":"DANCINGWOLF","text":"Prin here is the embodiment of the hopeful ideals of Sari's younger self. The murderous machine of his latter years is the product of frustration and anger and grief."},{"name":"YMHITRA","text":"Ah, but what shall we do with the crystals? We cannot risk them falling into the hands of another villain like Tristan..."},{"name":"PRINCIPIA","text":"If you wish, I could swallow the crystals and hold them safe until another era has need of them. My enchantments would ensure that they pass only into the hands of the worthy."},{"name":"DANCINGWOLF","text":"Swallow...? You mean to eat them!?"},{"name":"PRINCIPIA","text":"Fear not, Captain: I have no digestive tract of which to speak. And now that I have instructed <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> in the wisdom of Allag, this task shall be the last I perform ere I return to slumber."},{"name":"YMHITRA","text":"Wait...so this is farewell!?"},{"name":"PRINCIPIA","text":"Correct. Or, mayhap more appropriately, “good night”."},{"name":"PRINCIPIA","text":"As a familiar, I was not enspelled to experience loneliness. I was, however, written with the knowledge that it is best not to draw out a parting of ways with needless sentimentality."},{"name":"DANCINGWOLF","text":"No tears for you then, eh, Prin!"},{"name":"PRINCIPIA","text":"Summoning magic was created to combat the threat of the primals. The ideal world is one in which I need never again awaken. Wield the art well, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>."},{"name":"DANCINGWOLF","text":"...Off to dreamland, just like that. I suppose Prin's purpose is served, and that's the same as happiness to a familiar.<br>Speaking of serving one's purpose, I think it's time I took my leave."},{"name":"YMHITRA","text":"Aye, the tasks of the morrow beckon to us all. Let us do what we may, so that Prin might rest peacefully for many years to come!"},{"name":"SYSTEM","text":"This concludes the summoner quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “A Tearful Reunion.”"},{"name":"SYSTEM","text":"Once you have done so, the next summoner quest will be available from Y'mhitra."}],"reward":{"gil":3200,"action":7427,"items":[{"id":20281}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":28}],"quests":[68164]},"next":[68753,69569]},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"npc","id":"1022764","obj":{"i":1022764,"n":"Dancing Wolf","l":53,"q":3}},{"type":"npc","id":"1022785","obj":{"i":1022785,"n":"Y'mhitra","l":2101,"q":1}},{"type":"npc","id":"1022786","obj":{"i":1022786,"n":"Dancing Wolf","l":2101,"q":1}},{"type":"npc","id":"1022787","obj":{"i":1022787,"n":"Crispin","l":2101,"q":1}},{"type":"npc","id":"1022788","obj":{"i":1022788,"n":"Denise","l":2101,"q":1}},{"type":"npc","id":"1022789","obj":{"i":1022789,"n":"Jajasamu","l":2101,"q":1}},{"type":"npc","id":"1022790","obj":{"i":1022790,"n":"Y'mhitra","l":2101,"q":1}},{"type":"npc","id":"1022791","obj":{"i":1022791,"n":"Crispin","l":2101,"q":1}},{"type":"npc","id":"1022792","obj":{"i":1022792,"n":"Denise","l":2101,"q":1}},{"type":"npc","id":"1022793","obj":{"i":1022793,"n":"Jajasamu","l":2101,"q":1}},{"type":"npc","id":"1022794","obj":{"i":1022794,"n":"Principia","l":2101,"q":1}},{"type":"npc","id":"1023459","obj":{"i":1023459,"n":"Principia","l":53,"q":5}},{"type":"npc","id":"1023595","obj":{"i":1023595,"n":"Dancing Wolf","l":2101,"q":1}},{"type":"action","id":"7427","obj":{"i":7427,"n":"Summon Bahamut","c":2691,"j":27,"t":2,"l":70}},{"type":"item","id":"20281","obj":{"i":20281,"n":"Channeler's Attire Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68164","obj":{"i":68164,"n":"Off the Record","g":155,"l":"Gridania","s":680,"f":1}},{"type":"quest","id":"68753","obj":{"i":68753,"n":"To Be Second Best","g":0,"l":"Gridania","s":800}},{"type":"quest","id":"69569","obj":{"i":69569,"n":"To Be Second Best","g":155,"l":"Gridania","s":801}}]}