{"quest":{"name":"Doing Her Part","location":"The Fringes","id":68179,"patch":4.0,"sort":60,"eventIcon":71221,"issuer":1019524,"target":1019524,"genre":104,"journal":["Serpent Sergeant Lucinne seems to have a lot on her plate."],"objectives":["Obtain soil samples.","Obtain a river water sample.","Speak with Lucinne."],"dialogue":[{"name":"LUCINNE","text":"Serpent Sergeant Lucinne, at your service... Or I would be, if I were not so terribly busy. I've been tasked with assessing the environmental impact of the Garleans' occupation of Gyr Abania."},{"name":"LUCINNE","text":"There is so much to do, yet my superiors never thought to assign anyone to assist me. Can you believe it?"},{"name":"LUCINNE","text":"&lt;sigh&gt; I fear I will never finish at my present pace. Unless... Do you suppose you have time to gather a few samples for me?"},{"name":"LUCINNE","text":"Three from the soil amidst the magitek wreckage in East End, and one from the Velodyna River. No need to rush, there is plenty here to keep me occupied until you return."},{"name":"LUCINNE","text":"I realize what a burden I've placed on you, but it is imperative we learn what effects the Garleans have had on the environment here."},{"name":"LUCINNE","text":"Ah, you've returned. Did you bring the samples?"},{"name":"LUCINNE","text":"Splendid! Absolutely splendid! Thank you ever so much."},{"name":"LUCINNE","text":"Everyone seems so preoccupied with battle, there likely wouldn't be a surveying of the land had I not volunteered."},{"name":"LUCINNE","text":"I do not question the importance of this fight with the Garleans, but we have a duty to maintain the natural balance of the forest."},{"name":"LUCINNE","text":"Thanks to your efforts, I am one step closer to determining how much work it will require to do so."}],"reward":{"gil":550,"xp":83700},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67988]},"next":[68196]},"partials":[{"type":"npc","id":"1019524","obj":{"i":1019524,"n":"Lucinne","l":2406,"q":2}},{"type":"quest","id":"67988","obj":{"i":67988,"n":"Signed, Sealed, to Be Delivered","g":6,"l":"The Fringes","s":70}},{"type":"quest","id":"68196","obj":{"i":68196,"n":"A Second Assessment","g":104,"l":"The Fringes","s":1010}}]}