{"quest":{"name":"Prison Break","location":"The Fringes","id":68177,"patch":4.0,"sort":30,"eventIcon":71221,"issuer":1022954,"target":1022954,"involved":[1022955],"genre":104,"journal":["This Maelstrom officer seems somewhat irritated."],"objectives":["Rendezvous with the Maelstrom officer.","Speak with the Maelstrom officer."],"dialogue":[{"name":"MAELSTROM02641","text":"Ah, an adventurer. Perhaps you can help me."},{"name":"MAELSTROM02641","text":"Three of our prisoners escaped from their cells during the guard change last night. Thankfully, scouts from the Twin Adders have already ascertained their location."},{"name":"MAELSTROM02641","text":"They don't seem to have noticed they were being followed, and if the fates are kind, we can take them unawares."},{"name":"MAELSTROM02641","text":"They are formidable combatants in their own right, however, and it was trouble enough taking them into custody in the first place. The more capable of my men are presently out in the field, and so I would ask for your assistance."},{"name":"MAELSTROM02641","text":"The prisoners were last spotted heading toward a cave along the Velodyna River. Let us hurry, while we still have the element of surprise."},{"name":"MAELSTROM02641","text":"...Thank goodness you came."},{"name":"MAELSTROM02641","text":"It seems the one caught by surprise was me. I was ambushed before I could even step foot near the cave."},{"name":"MAELSTROM02641","text":"&lt;sigh&gt; None of this would have happened had changing of the guard not been handled so carelessly. No doubt it was those bunglers from the Immortal Flames, or perhaps─"},{"name":"MAELSTROM02641","text":"On second thought, never mind. This isn't something you need to hear. Let us return to Castrum Oriens."},{"name":"MAELSTROM02641","text":"Ah, there you are. I spoke with our scouts from the Twin Adders. It turns out they were in fact discovered by the prisoners shortly after we departed."},{"name":"MAELSTROM02641","text":"What's more, they claim to have laid markers along the river to warn us. The problem, however, is these markers are unfamiliar to any save the Twin Adders, lest their enemies realize what they are."},{"name":"MAELSTROM02641","text":"It has become painfully clear that there is still much to be done if the Grand Companies are to function together as a single, cohesive unit. We cannot assume that one company is familiar with the stratagems of another."},{"name":"MAELSTROM02641","text":"Though we could not recapture the prisoners, today will serve as a stark reminder to all of us to be better prepared and more open in communicating with one another."},{"name":"MAELSTROM02641","text":"Thank you again for your aid. I should hope when next we meet, it will be under more favorable circumstances."}],"reward":{"gil":615,"xp":83700},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67988]}},"partials":[{"type":"npc","id":"1022954","obj":{"i":1022954,"n":"Maelstrom Officer","l":2406,"q":1}},{"type":"npc","id":"1022955","obj":{"i":1022955,"n":"Maelstrom Officer","l":2406,"q":1}},{"type":"quest","id":"67988","obj":{"i":67988,"n":"Signed, Sealed, to Be Delivered","g":6,"l":"The Fringes","s":70}}]}