{"quest":{"name":"Magiteknical Failure","location":"The Fringes","id":68175,"patch":4.0,"sort":10,"unlocksFunction":1,"eventIcon":71341,"issuer":1019517,"target":1019517,"involved":[1019523],"genre":104,"journal":["Captain Loezkirz has lost something very important."],"objectives":["Speak with Lieutenant G'nibnpha.","Pilot the magitek armor to East End and destroy the Garlean drones.","Pilot the magitek armor to Velodyna River and destroy the Garlean drones.","Report to Captain Loezkirz."],"dialogue":[{"name":"LOEZKIRZ","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename Surname</span> of the Twin Adders</span><span class=\"alternative\"><span class=\"highlight\">Forename Surname</span> of the Immortal Flames</span></span>. Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I wanted to see."},{"name":"LOEZKIRZ","text":"We've misplaced a number of Garlean drones taken from Baelsar's Wall. And by misplaced, I mean the damn things sprang to life and stormed out of the base. They need to be dealt with before any civilians come to harm."},{"name":"LOEZKIRZ","text":"Being familiar with magitek as you are, I can think of no one better to assist us. If you would be willing to help, go and speak with Lieutenant G'nibnpha. She is overseeing the initiative to terminate the drones."},{"name":"LOEZKIRZ","text":"Lieutenant G'nibnpha is well versed in magitek technology and should be able to answer any questions you have."},{"name":"GNIBNPHA","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\">Ah,  <span class=\"highlight\">Surname</span></span><span class=\"alternative\">Ah, <span class=\"highlight\">Forename Surname</span></span></span>! Your assistance is greatly appreciated. The drones were not in our possession for very long, but a cursory inspection showed they are made with a heretofore unknown metal alloy."},{"name":"GNIBNPHA","text":"They are all but impervious to traditional firearms, which is why we commissioned Garlond Ironworks to fashion a weapon capable of penetrating their armor."},{"name":"GNIBNPHA","text":"It has since been fitted to a suit of magitek armor, which I would ask you to pilot."},{"name":"GNIBNPHA","text":"If I am not mistaken, this would not be the first time you've piloted one of these suits. It should take you no time, then, to familiarize yourself with the controls."},{"name":"GNIBNPHA","text":"Now, the drones were last sighted due east of here and to the north along the Velodyna River. I fear recapturing them is out of the question, so do whatever you deem necessary to stop them."},{"name":"GNIBNPHA","text":"I doubt they've gone much further than the Velodyna River. Please hurry, before anyone comes to harm."},{"name":"LOEZKIRZ","text":"Welcome back. I take it the drones have been disposed of, then. Excellent work."},{"name":"LOEZKIRZ","text":"We were quite fortunate for your presence. Save for Lieutenant G'nibnpha, none of my men can even activate a suit of magitek armor, let alone pilot one in combat."},{"name":"LOEZKIRZ","text":"I only pray that isn't to our detriment in the future. There's still plenty more of those drones out there along Baelsar's Wall. If any more of them should suddenly stir..."},{"name":"LOEZKIRZ","text":"At any rate, we will continue working with Garlond Ironworks so that should such a day come, we will be ready."},{"name":"GNIBNPHA","text":"The drones have been destroyed? Thank goodness. Captain Loezkirz will be glad to hear it."}],"reward":{"gil":680,"aetherCurrent":1,"xp":83700},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67988]}},"partials":[{"type":"npc","id":"1019517","obj":{"i":1019517,"n":"Loezkirz","l":2406,"q":3}},{"type":"npc","id":"1019523","obj":{"i":1019523,"n":"G'nibnpha","l":2406,"q":1}},{"type":"quest","id":"67988","obj":{"i":67988,"n":"Signed, Sealed, to Be Delivered","g":6,"l":"The Fringes","s":70}}]}