{"quest":{"name":"King of the Castle","location":"Kugane","id":68170,"patch":4.0,"sort":11010,"icon":112232,"unlocksFunction":1,"eventIcon":71341,"issuer":1023612,"target":1023612,"involved":[1023613],"genre":107,"journal":["This employee of the East Aldenard Trading Company is relieved to see you.","You are approached not with an offer of wares but a request for help. As this Ul'dahn merchant tells it, Kugane Castle has been overrun by outlaws, and they have taken hostages─several dignitaries, including the bugyo of Kugane. While the Sekiseigumi would normally be the first to act in the face of such a crisis, they dare not put the bugyo at greater risk. Rather than storm the castle, they plan to recruit a small unit of adventurers to sneak inside. The merchant bids you make for the aqueducts in the Rakuza District, and speak with the Sekiseigumi officer there to learn more of their rescue mission.","The Sekiseigumi officer apprises you of the situation inside the castle. Its halls are now filled with lawless ninjas and samurai under the leadership of a merchant by the name of Kageyama. As the officer bids you confront this mercantile mastermind, he warns you of a mysterious bodyguard in his employ. You then ready your arms and proceed through the aqueducts to infiltrate Kugane Castle.","After overcoming throngs of shinobi, you at last find Kageyama at the heart of the castle. As a smile creeps across his face, it would seem he was expecting your arrival, and the bodyguard Yojimbo soon steps forward to protect his client. Kageyama showers the rogue swordsman with gold, whose attacks grow more destructive with every swing. Yet for all his money, Yojimbo deems the price of your head beyond the merchant's reach. The bodyguard soon takes his leave and Kageyama collapses to the ground a man broken, his fortunes utterly spent. With the castle now secure, you return to the merchant from the East Aldenard Trading Company to inform him of the good news.","Not long after you return to the Ruby Bazaar, the Ul'dahn dignitary who was held captive at the castle arrives to offer her thanks for your aid. Her introduction soon makes clear that she is in fact the niece of Lolorito, Syndicate member and chairman of the East Aldenard Trading Company. Tales of your heroism inspired her to see the world and write a book about her travels. Thanks to your efforts, she may continue her journey with a tale of your deeds to accompany her writings."],"objectives":["Speak with the Sekiseigumi blade.","Enter Kugane Castle.","Report to the East Aldenard Trading Company associate."],"dialogue":[{"name":"TRADINGCOMPANY02634","text":"<span class=\"highlight\">Forename Surname</span>? Oh, thank heavens! I am in dire need of a capable adventurer and I can think of none better."},{"name":"TRADINGCOMPANY02634","text":"Local officials have been working desperately to keep this confidential, but there is trouble in Kugane Castle! It has been overrun by a band of outlaws! What's more, they've taken hostages─a number of nobles, along with the bugyo, Kugane's highest magistrate. "},{"name":"TRADINGCOMPANY02634","text":"They're demanding the country's borders be closed off, insisting Kugane's efforts to establish ties with other countries is folly. Why, if they had their way, I imagine foreigners─or <span class=\"emphasis\">ijin</span>, as they call them─would never set foot here ever again!"},{"name":"TRADINGCOMPANY02634","text":"Under normal circumstances, the Sekiseigumi would have taken steps to immediately resolve this crisis, but they dare not do anything to put the bugyo at greater risk."},{"name":"TRADINGCOMPANY02634","text":"To proceed would require a decree from the bakufu, yet I fear there is no time to send an envoy to the royal capital and back. Nevertheless, they have done their due diligence and delivered a missive."},{"name":"TRADINGCOMPANY02634","text":"While waiting for a response, they have also called upon the East Aldenard Trading Company in an attempt to potentially expedite the rescue of the hostages."},{"name":"TRADINGCOMPANY02634","text":"As to why they would go out of their way to contact us, well... One of the captives is from Ul'dah!"},{"name":"TRADINGCOMPANY02634","text":"It goes without saying the repercussions of a foreign dignitary coming to harm would be dire."},{"name":"TRADINGCOMPANY02634","text":"Because the Sekiseigumi cannot yet act in an official capacity, they have asked for my assistance in assembling a small contingent to infiltrate the castle."},{"name":"TRADINGCOMPANY02634","text":"If you would join our cause, make for the aqueducts in the Rakuza District. There is a hidden passage leading into the castle kept under guard by the Sekiseigumi. Tell them I sent you, and they will explain what you must do."},{"name":"TRADINGCOMPANY02634","text":"I realize we are asking a great deal of you, but we must save the hostages. An officer of the Sekiseigumi will be waiting for you at the aqueducts."},{"name":"SEKISHINTAISOLDIER02634","text":"...You were sent by the East Aldenard Trading Company? Then there is still a chance. Permit me to apprise you of the situation."},{"name":"SEKISHINTAISOLDIER02634","text":"The castle is presently held by a group of criminals under the leadership of a merchant named Kageyama. We believe his demands to close off our borders, as ludicrous as this seems, are a vain attempt to eliminate what he sees as a threat from foreign businesses."},{"name":"SEKISHINTAISOLDIER02634","text":"If it were only him and his cohorts, I am quite confident my men and I could easily rout them on our own."},{"name":"SEKISHINTAISOLDIER02634","text":"The problem, however, is his bodyguard. Our informants tell us he is a swordsman of great renown in the Hingan underworld. He demands exorbitant sums of money, defending his clients with seemingly inhuman displays of strength and skill commensurate with the price he is paid."},{"name":"SEKISHINTAISOLDIER02634","text":"Your task will be to contend with Kageyama and his hired blade in the heart of the castle. With all eyes focused on you, they will fail to notice my men's intrusion to rescue the hostages."},{"name":"SEKISHINTAISOLDIER02634","text":"It shames me to ask this of a civilian, but if we are to save those people, I can see no other way."},{"name":"TRADINGCOMPANY02634","text":"I realize we are asking a great deal of you, but we must save the hostages."},{"name":"SEKISHINTAISOLDIER02634","text":"Be wary of Kageyama's bodyguard. For the price he has likely been paid, I doubt he will show any restraint."},{"name":"TRADINGCOMPANY02634","text":"I heard the news! Well done, <span class=\"alternative-container\"><span class=\"alternative\">good lady</span><span class=\"alternative\">good sir</span></span>, well done indeed! You will be rewarded handsomely for your part in this."},{"name":"TRADINGCOMPANY02634","text":"As you no doubt already guessed, Kageyama has been apprehended. His bodyguard, however, is nowhere to be found. I suppose in the end his loyalty laid only with Kageyama's coin."},{"name":"TRADINGCOMPANY02634","text":"At any rate, the magistrate is safe, as well as the Ul'dahn─ What's this?"},{"name":"SEKISHINTAISOLDIER02634","text":"Ah, I was not expecting to find you here as well. Lady Liliju wished to thank you both personally for your assistance. In light of all that has happened, I thought it only proper she have an escort."},{"name":"LILIJU","text":"So you are the great adventurer who risked life and limb to save us! Uncle Lolorito has told me so much about you."},{"name":"LILIJU","text":"Hearing of your daring deeds was inspiring. So much so, I decided to set out on an adventure of my very own. I have taken to writing travel literature, you see, and someday the whole of Eorzea will have the chance to read of my journeys across the realm."},{"name":"LILIJU","text":"Yet never in my wildest dreams did I imagine my yearning to experience new cultures and customs would take such a terrible turn. Words fail to express my gratitude."},{"name":"TRADINGCOMPANY02634","text":"Miss Liliju, we were quite fortunate that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was here to assist in your rescue, but it would be folly to assume fortune will always smile upon you so. Your uncle is worried sick about you, besides. Will you not consider returning home?"},{"name":"LILIJU","text":"There is so much I have yet to see, yet to do. If I were to leave now, I would have naught but this horrible story of kidnapping to fill the pages of my journal."},{"name":"LILIJU","text":"It would be irresponsible of me to give my readers the impression that Hingashi is a land of savages unfit for traveling."},{"name":"LILIJU","text":"As you might recall, there was a rather nasty incident in Ul'dah that even our dear adventurer friend here was helpless to resolve. Surely you would not wish that to be the only tale of Ul'dah to be told here in Kugane? "},{"name":"TRADINGCOMPANY02634","text":"Alright, alright, you have made your point. But why have you come all this way alone?"},{"name":"LILIJU","text":"Uncle Lolorito tries to keep me from harm, but he has only succeeded in smothering me. I tire of being constantly coddled. That is why I left, to prove to him, and myself, that I am perfectly capable of being on my own."},{"name":"LILIJU","text":"If I know my uncle, he has likely requested you hire guards for me, whether I choose to return or not. Well, tell him that I refuse."},{"name":"TRADINGCOMPANY02634","text":"Very well. Might I ask, then, that you pay me a visit when your journey has ended? Lolorito is not the only one who worries for your safety, after all."},{"name":"LILIJU","text":"Yes, of course. I will be sure to bring many souvenirs, and tales of adventure to share with you."},{"name":"LILIJU","text":"At last, my journey continues. Though there is still much of the world for me to experience, I suspect meeting the Warrior of Light will be one of the high points of my writings."}],"reward":{"gil":3997,"xp":0,"instance":57},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68089]}},"partials":[{"type":"npc","id":"1023612","obj":{"i":1023612,"n":"East Aldenard Trading Company Associate","l":2404,"q":1}},{"type":"npc","id":"1023613","obj":{"i":1023613,"n":"Sekiseigumi Blade","l":2404,"q":1}},{"type":"instance","id":"57","obj":{"i":57,"n":"Kugane Castle","c":61801,"t":"Dungeons","min_lvl":70,"max_lvl":70,"min_ilvl":280,"max_ilvl":340}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}}]}