{"quest":{"name":"A Dash of Green","location":"Rhalgr's Reach","id":68172,"patch":4.0,"sort":162,"eventIcon":71201,"issuer":1019476,"target":1019476,"involved":[1019471],"genre":6,"journal":["Ahelissa considers the cookpot with a frown."],"objectives":["Speak with Tebbe.","Search Rhalgr's Reach for herbs.","Deliver the Reach greens to Ahelissa."],"dialogue":[{"name":"AHELISSA","text":"You want to help, do you? Hmm... Seeing as how I'm in no position to leave the stewpot unattended, could you go and ask Tebbe for a variety of herbs? Six sprigs or so of whatever he's got on hand should suffice."},{"name":"AHELISSA","text":"It's not as haphazard as it may seem. Depending on the recipe, it doesn't really matter what sort you add, so long as you add something. I'll be here when you get back."},{"name":"AHELISSA","text":"If you'd rather not, it's just as well. I can assure you that the folks around here will eat it regardless."},{"name":"TEBBE","text":"Herbs, is it? Six sprigs of whatever's on hand? 'Fraid I can't spare that much. You'll take two, and be glad of it."},{"name":"TEBBE","text":"The remainder you'll have to gather yourself. Shouldn't be too much of a bother, though─you'd be surprised what you can find growing underfoot, even in the Reach."},{"name":"TEBBE","text":"Sorry, friend, but you'll get no more from me. Rules is rules."},{"name":"AHELISSA","text":"Tebbe can be a bit of a stickler, but he means well. I hope he didn't give you too much trouble."},{"name":"AHELISSA","text":"Ah, there you are. Got those herbs I asked for?"},{"name":"AHELISSA","text":"Thanks, that'll do nicely. And, uh...sorry to impose upon you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Thought you were another new recruit. Didn't realize until after that you were, uh..."},{"name":"AHELISSA","text":"But to answer the question that's probably on your mind, yes. It's always like this. Never enough food or supplies to go around."},{"name":"AHELISSA","text":"All the more reason to be grateful when our countrymen can spare some for the cause. Though that comes at a cost, too. Too many villages, too many children more deserving than us..."},{"name":"AHELISSA","text":"But a man can't fight on an empty stomach, can he? So we partake, as we must. And we never lose sight of the dream."}],"reward":{"gil":615,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67997]},"next":[68174]},"partials":[{"type":"npc","id":"1019476","obj":{"i":1019476,"n":"Ahelissa","l":2403,"q":3}},{"type":"npc","id":"1019471","obj":{"i":1019471,"n":"Tebbe","l":2403,"q":2}},{"type":"quest","id":"67997","obj":{"i":67997,"n":"Where Men Go as One","g":6,"l":"Rhalgr's Reach","s":160}},{"type":"quest","id":"68174","obj":{"i":68174,"n":"Token of Faith","g":6,"l":"Rhalgr's Reach","s":164}}]}