{"quest":{"name":"Home Comforts","location":"The Peaks","id":68183,"patch":4.0,"sort":20,"eventIcon":71221,"issuer":1020843,"target":1020843,"genre":105,"journal":["Gelen's house is somewhat breezier than usual."],"objectives":["Slay earth sprites and obtain their cores.","Deliver the earth sprite cores to Gelen."],"dialogue":[{"name":"GELEN","text":"Would you mind givin' me a hand? I've not got long left. It's the least you could do."},{"name":"GELEN","text":"I've been livin' in this house ever since I got married. It was never in what I would call good nick, but it is mine. However, recently a huge crack appeared in the wall."},{"name":"GELEN","text":"I'd repair it myself, but I don't have the necessary materials. Do an old woman a favor and slay three earth sprites. You'll find some by the Ziggurat. Bring back their cores and we'll see if this house can't be fixed."},{"name":"GELEN","text":"Do an old woman a favor and slay three earth sprites. Bring back their cores and we'll see if this house can't be fixed."},{"name":"GELEN","text":"You best not have come back without those cores."},{"name":"GELEN","text":"Lovely! I'll get to work breakin' these up right away. Then I just need mix them into a paste that I can apply to the crack."},{"name":"GELEN","text":"That should stop it from reappearin' for a few years yet. With any luck, I won't even be around to see it crack again!"},{"name":"GELEN","text":"Apparently the very ground we stand on used to be part of the quarry. Then, one day someone decided to start using it as a rest area. Eventually a house was built here─one thing led to another─and, before anyone knew it, a whole settlement had popped up."},{"name":"GELEN","text":"Anyway, that's enough stories for one day. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."}],"reward":{"gil":550,"xp":83700},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67995]}},"partials":[{"type":"npc","id":"1020843","obj":{"i":1020843,"n":"Gelen","l":2407,"q":1}},{"type":"quest","id":"67995","obj":{"i":67995,"n":"The Black Wolf's Pups","g":6,"l":"The Peaks","s":140}}]}