{"quest":{"name":"Spicing Things Up","location":"The Fringes","id":68180,"patch":4.0,"sort":50,"eventIcon":71221,"issuer":1019520,"target":1019520,"involved":[1019517,1019518,1019522],"genre":104,"journal":["Quincompaix simply wishes everyone could get along."],"objectives":["Speak with the soldiers.","Speak with Quincompaix.","Slay sarcosuchus for their meat.","Gather Velodyna mushrooms.","Speak with Quincompaix."],"dialogue":[{"name":"QUINCOMPAIX","text":"Have you ever seen such a disagreeable lot? It seems at all hours of the day someone somewhere is provoking a fight between soldiers. Not even during meals can we enjoy a moment's peace."},{"name":"QUINCOMPAIX","text":"I'd love nothing more than to resolve whatever problem has everyone so ruffled, but to raise my concerns would likely drag me into their quarreling. Perhaps you could speak with the men? I doubt they would lash out at an adventurer's innocent inquiry."},{"name":"QUINCOMPAIX","text":"The others would sooner fight with me than speak of their troubles, but I'm sure they won't mind talking with you."},{"name":"LOEZKIRZ","text":"Do I have any complaints? Have you tasted the slop they serve us here? Soldiers from the Twin Adders were put in charge of provisions, and it's been nothing but fruits and vegetables ever since. This is no way for a man to live."},{"name":"LOEZKIRZ","text":"Meat, fish, <span class=\"emphasis\">anything</span> to spare us from the monotony of this vegetarian nightmare. I swear if I have to force down one more salad..."},{"name":"LOEZKIRZ","text":"&lt;sigh&gt; What I wouldn't give for a taste of the sea. A nice bowl of bouillabaisse, or even a simple grilled herring."},{"name":"KAKALAI","text":"Now that you mention it, the men have been rather irritable of late, doubly so after eating. Not that I can blame them. There's no telling when the Garleans will strike next."},{"name":"KAKALAI","text":"I always assumed it was the threat of a Garlean attack that had everyone on edge. Could it be something else?"},{"name":"PIP","text":"What I wouldn't give for a home-cooked meal..."},{"name":"PIP","text":"Upset? Heavens no. The Twin Adders have been nothing short of hospitable since our arrival. I can only imagine the burden they bear with so many mouths to feed."},{"name":"PIP","text":"The Twin Adders have been exceedingly gracious hosts, but I must admit I sometimes long for Ishgardian cooking."},{"name":"QUINCOMPAIX","text":"So our provisions were to blame? After so many years of such lean meals when on duty, I never thought to question it."},{"name":"QUINCOMPAIX","text":"Well, we lack the means to give them a taste of their homelands, but we can certainly try to add a dash of spice to our cooking. Might I trouble you for help just a while longer?"},{"name":"QUINCOMPAIX","text":"I'd like to prepare a Gyr Abanian dish for the men and see if it does aught to lift their spirits. The recipe is simple enough, but the ingredients are not so easily acquired."},{"name":"QUINCOMPAIX","text":"The first, and most important, ingredient is meat from the sarcosuchus. You're like to find them in or near the Velodyna River."},{"name":"QUINCOMPAIX","text":"I'll also need a few Velodyna mushrooms─say, three or so. Bring me those, and I can prepare a mouthwatering meal for the troops."},{"name":"QUINCOMPAIX","text":"All I require is meat from the sarcosuchus and about three Velodyna mushrooms."},{"name":"QUINCOMPAIX","text":"Everyone is sure to be surprised when they get a taste of what I have planned."},{"name":"QUINCOMPAIX","text":"Did you have any trouble procuring the ingredients?"},{"name":"QUINCOMPAIX","text":"Wonderful. Simply wonderful. I should also mention, the strangest thing happened while you were away─a few of the men came by to speak with me about our provisions. Your asking about camp likely spurred them to action."},{"name":"QUINCOMPAIX","text":"Now that we better understand their grievances, we plan to take better care to supply the men with cooking palatable to more than just us Gridanians."},{"name":"QUINCOMPAIX","text":"As they say, variety is the spice of life."}],"reward":{"gil":680,"xp":83700},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[67988]}},"partials":[{"type":"npc","id":"1019520","obj":{"i":1019520,"n":"Quincompaix","l":2406,"q":1}},{"type":"npc","id":"1019517","obj":{"i":1019517,"n":"Loezkirz","l":2406,"q":3}},{"type":"npc","id":"1019518","obj":{"i":1019518,"n":"Kakalai","l":2406,"q":3}},{"type":"npc","id":"1019522","obj":{"i":1019522,"n":"Pip","l":2406,"q":2}},{"type":"quest","id":"67988","obj":{"i":67988,"n":"Signed, Sealed, to Be Delivered","g":6,"l":"The Fringes","s":70}}]}