{"quest":{"name":"Of Rats and Men","location":"The Peaks","id":68189,"patch":4.0,"sort":1010,"eventIcon":71221,"issuer":1021544,"target":1021544,"genre":105,"journal":["Gerbert has a rodent problem."],"objectives":["Use the brown liquid at the designated locations and slay any robber rats that attack.","Report to Gerbert."],"dialogue":[{"name":"GERBERT","text":"Well, you don't <span class=\"emphasis\">look</span> like a Garlean... Assuming I'm correct, could you help me deal with a little pest problem?"},{"name":"GERBERT","text":"Ever since the Empire outlawed the practice of all religions, I've been unable to pray at Hidden Tear. Instead, I decided to create a spot to the southwest where I could mourn the dead in secret."},{"name":"GERBERT","text":"The problem is, whenever I leave offerings of food for the deceased, those blasted robber rats gobble them up for themselves. That is why I have created this."},{"name":"GERBERT","text":"One whiff of it and those pests will be on their way. Though, make sure to be on your guard─some of the more aggressive rats may attack you instead."},{"name":"GERBERT","text":"One whiff of that liquid and those pests will be on their way. Though, make sure to be on your guard─some of the more aggressive rats may attack you instead."},{"name":"GERBERT","text":"The rats are all gone? Excellent news. Now I can speak with my son again."},{"name":"GERBERT","text":"I lost my boy to a quarrying accident some time ago. He pushed me out of the way when a bunch of rocks suddenly fell down on us. He was buried so deep we never even found his body..."},{"name":"GERBERT","text":"I couldn't stand the idea of him being forgotten, so I went ahead and built a grave for him. It's near the area where the accident happened."},{"name":"GERBERT","text":"Not a day goes by when I don't wish he had saved himself. He still had his whole life ahead of him..."},{"name":"GERBERT","text":"Thank you for all of your help. It brings me some solace to know that I can still talk with my son from time to time."}],"reward":{"gil":556,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"questsType":"all","quests":[68000,68188]},"next":[68190,68410]},"partials":[{"type":"npc","id":"1021544","obj":{"i":1021544,"n":"Gerbert","l":2407,"q":2}},{"type":"quest","id":"68000","obj":{"i":68000,"n":"The Fires Fade","g":6,"l":"Rhalgr's Reach","s":190}},{"type":"quest","id":"68188","obj":{"i":68188,"n":"Mother's Boy","g":103,"l":"Rhalgr's Reach","s":1020}},{"type":"quest","id":"68190","obj":{"i":68190,"n":"Rat Bandits","g":105,"l":"The Peaks","s":1060}},{"type":"quest","id":"68410","obj":{"i":68410,"n":"Religious Freedom","g":105,"l":"The Peaks","s":9120}}]}