{"quest":{"name":"Rat Bandits","location":"The Peaks","id":68190,"patch":4.0,"sort":1060,"eventIcon":71221,"issuer":1022956,"target":1022957,"involved":[1020854],"genre":105,"journal":["This luckless merchant is desperate for help."],"objectives":["Obtain the stolen sack.","Deliver the stolen sack to Ansger.","Deliver the crate of minerals to the luckless merchant."],"dialogue":[{"name":"PITYMERCHANT02654","text":"Hello there, friend. Don't suppose you'd have time to help a man in his hour of need?"},{"name":"PITYMERCHANT02654","text":"I'd come here to buy minerals that I was meant to supply the Resistance with. The only problem is, I was robbed of all my gil by Qiqirn bandits on the way here!"},{"name":"PITYMERCHANT02654","text":"Who's going to use a merchant that can't deliver the goods he claims to sell? Please, head to Momoroon's Milk and take back my money."},{"name":"PITYMERCHANT02654","text":"Once you have collected my gil, give it to a man by the name of Ansger in this village. He's the one I had procure the minerals for me."},{"name":"PITYMERCHANT02654","text":"In the meantime, I'll head back to Rhalgr's Reach and ask them to wait a little longer for their order. Bring the minerals to me as soon as you have them."},{"name":"ANSGER","text":"Hello there, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! Do you have business with me?"},{"name":"ANSGER","text":"The merchant who ordered the minerals asked you to bring me his payment? I take it you must've reclaimed his gil from those pesky Qiqirn?"},{"name":"ANSGER","text":"Ha ha, you have my thanks! I was not best pleased when I heard he would be late in paying me."},{"name":"ANSGER","text":"Here are his minerals. Get them to him as quickly as possible. No doubt he's worrying himself sick."},{"name":"ANSGER","text":"Get his minerals to him as quickly as possible. No doubt that merchant's worrying himself sick."},{"name":"PITYMERCHANT02654","text":"The minerals. Do you have them?"},{"name":"PITYMERCHANT02654","text":"Oh, I am positively indebted to you. At last, I can fulfill the Resistance's order."},{"name":"PITYMERCHANT02654","text":"Frankly speaking, the minerals found around Ala Gannha aren't of the best quality."},{"name":"PITYMERCHANT02654","text":"But I can't help but want to support a struggling village. They have been through so much."},{"name":"PITYMERCHANT02654","text":"I will need to be careful I do not go the same way as their quarry. I had made a point of not hiring protection when traveling to save on money, but I'm not much use to anyone if I'm robbed of all my gil. Here, take this as a token of my thanks."}],"reward":{"gil":798,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"questsType":"all","quests":[68000,68189]}},"partials":[{"type":"npc","id":"1022956","obj":{"i":1022956,"n":"Luckless Merchant","l":2407,"q":1}},{"type":"npc","id":"1022957","obj":{"i":1022957,"n":"Luckless Merchant","l":2403,"q":1}},{"type":"npc","id":"1020854","obj":{"i":1020854,"n":"Ansger","l":2407,"q":2}},{"type":"quest","id":"68000","obj":{"i":68000,"n":"The Fires Fade","g":6,"l":"Rhalgr's Reach","s":190}},{"type":"quest","id":"68189","obj":{"i":68189,"n":"Of Rats and Men","g":105,"l":"The Peaks","s":1010}}]}