{"quest":{"name":"Spooky Stones","location":"The Peaks","id":68194,"patch":4.0,"sort":1050,"icon":100696,"eventIcon":71221,"issuer":1021762,"target":1021762,"involved":[1021752,1021758,1021763],"genre":105,"journal":["Swetelove is warming up her pipes for a moving rendition of the alternate version of the quarrying work song.","Swetelove explains that the second version of the song was, despite its lack of popularity, her father's favorite. After she finishes reciting the differing lyrics, Sayer supposes that the ore may be located in the earth beneath Hidden Tear─the former site of a local graveyard. Your protection is once again requested as the area is said to be populated by vengeful spirits.","After rendezvousing with Sayer near Hidden Tear, it is painfully apparent that he is worried by the tales of specters haunting the area. He bids you go on ahead and dispatch any beings that may lurk in the shadows.","Initially it seems there is not a whole lot going on in the area, however, it does not take long for the somnambulant bhoots to show themselves. You eventually succeed in vanquishing them and decide to head back to Sayer to tell him the good news.","Sayer is most relieved to hear he can start searching without fear for his safety. You are bid to head on back to Ala Gannha without him and tell Swetelove that he is getting along just fine.","Sayer makes his grand return to the village the moment you finish calming Swetelove. Upon seeing the ore in question, the villagers immediately change their tune, vowing to help Sayer in his future endeavors. You leave the town behind, confident that it will someday recapture its former glory."],"objectives":["Speak with Sayer.","Lie in wait at the designated locations, and slay any specters that appear.","Report to Sayer near Hidden Tear.","Report to Swetelove."],"dialogue":[{"name":"SAYER","text":"I'm ashamed to admit, but I had completely forgotten there was another version of that song. Who knows what secrets its verses may hold..."},{"name":"SWETELOVE","text":"I do recall Father saying that this version of the song wasn't especially popular. However, it was always his favorite; it's certainly the one he sang most often to me."},{"name":"SAYER","text":"Aye, that's the right of it. The quarry would echo for days with workers belting out the version I know. I'll probably still be singin' it when I'm dead!"},{"name":"SWETELOVE","text":"Can't say I'm too surprised that's all you remember, Grandfather─it's only the end of the second version that actually differs from the first."},{"name":"SWETELOVE","text":"Speckled stone, edge of't layer♪<br>Sell not this stone to a kindly payer♪<br>Nay, search for't pebbles♪<br>Young maiden revels♪<br>Between this world and't next♪<br>'Tis there the stones collect♪<br>Trade them on♪<br>Our ancestor's song♪"},{"name":"SAYER","text":"So the stone worth sellin' is located somewhere between this world and the next, eh?"},{"name":"SWETELOVE","text":"I must admit, I never really thought about it much as a child, but the song's lyrics are a bit eerie, aren't they?"},{"name":"SAYER","text":"Aye, that part about our ancestors is quite morbid. Do you reckon it might be referrin' to Hidden Tear?"},{"name":"SWETELOVE","text":"I suppose that did used to be a graveyard, didn't it? I don't imagine there are too many people that have cause to visit the area these days."},{"name":"SAYER","text":"I should hope not. Ever since the Empire banned us from makin' offerings to the deceased, I've heard an increasin' number of stories sayin' that beings not of this earth stalk the place."},{"name":"SAYER","text":"I'd love nothin' more than to pop over there right now and quickly see if the stone we need can be found, but somethin' tells me it won't be that easy."},{"name":"SAYER","text":"What say you, <span class=\"highlight\">Forename</span>? Can I count on your aid one last time?"},{"name":"SAYER","text":"My thanks. This is our last chance and I do not intend to fail."},{"name":"SWETELOVE","text":"I must admit, I have also heard those same stories Grandfather just mentioned. While I am reluctant to think them true, I would still feel much more at ease were you to accompany him."},{"name":"SAYER","text":"Right, <span class=\"highlight\">Forename</span>, would you mind checkin' the area to see if everythin's safe before I go any further?"},{"name":"SAYER","text":"If you happen to see anythin'...funny, just take care of it for me. I'll get to work once it's certain the area's safe."},{"name":"SAYER","text":"Tell me, <span class=\"highlight\">Forename</span>, do you believe in the existence of spirits? Me? Oh no, of course not. Don't be so silly now..."},{"name":"SYSTEM","text":"The only presence you sense in this area is your own."},{"name":"SAYER","text":"Nice to see you're still in one piece! Things certainly seem to be a bit safer now."},{"name":"SAYER","text":"By all means, go on ahead back to Ala Gannha. You have my word that I'll deliver this time. Please go and put Swetelove at ease; I bet she's worried sick by now."},{"name":"SAYER","text":"Go on, back to Ala Gannha with you."},{"name":"SWETELOVE","text":"Ah, <span class=\"highlight\">Forename</span>! But wait, where is─"},{"name":"SWETELOVE","text":"Oh, what a relief to hear he is unharmed!"},{"name":"SWETELOVE","text":"Although, I will struggle to truly relax until he is back with us safe and sound. Grandfather is so foolhardy, not a moment goes by that I do not worry for him."},{"name":"SAYER","text":"(-Sayer-)You're acting like I'm already in the grave, my love! I can assure you, there's nothin' to worry about here."},{"name":"SAYER","text":"I found what we were after in no time. Assumin' there's more to be had, we'll be able to start tradin' with the goldsmiths of Ul'dah in no time. Should fetch a high price, I'd imagine."},{"name":"SAYER","text":"I found what we were after in no time. Assumin' there's more to be had, we'll be able to start tradin' with the goldsmiths of Ul'dah. That is of course assumin' the day we're free of the Empire actually comes."},{"name":"SAYER","text":"I'm beginnin' to think our ancestors made Hidden Tear into a graveyard on purpose, as a form of protection in case the quarry ceased providin' for us. After all, who do you know that'd go defiling a graveyard in search of riches? Besides me, of course."},{"name":"SAYER","text":"Regardless, that's the only reason I can think of for them hidin' the fact in a work song. Take a look for yourself, Swetelove."},{"name":"SWETELOVE","text":"It's...stunning. When I gaze upon it, I almost dare to believe that there could be a brighter future for our village."},{"name":"RAGANFRID","text":"A fine chunk of ore indeed. I imagine we could make a fair amount of coin were the villagers to band together and mine the rest of the supply."},{"name":"CARLE","text":"Why didn't you say sooner you were going after such treasure? I would've been much more interested in your rambli─rather, in what you had to say."},{"name":"SWETELOVE","text":"It's all thanks to your efforts, Grandfather. Never once did you give up, even in the face of strong opposition from a certain granddaughter. I couldn't be more proud."},{"name":"HODGKIN","text":"Honestly, I was just so used to living in despair that I couldn't bring myself to believe there might be a way out. I'll be more than glad to join you the next time you go quarrying, Sayer!"},{"name":"SAYER","text":"Thank you all for the kind words. Here's to bringing Ala Gannha back to its former glory!"},{"name":"SWETELOVE","text":"Up until now, I had always wished you would just retire and spend your golden years in peace. But it seems you're much better suited to keeping active."},{"name":"SAYER","text":"Took you long enough to realize! Aye, life's not the same unless I have a chisel in hand."},{"name":"SAYER","text":"I hope your throats are nice and warmed up, because it's time for some singin'─and quarryin', of course!"},{"name":"SAYER","text":"<span class=\"highlight\">Forename</span>, a hearty thanks for everythin' you've done for our village."},{"name":"SAYER","text":"You can leave the rest to us now; we'll do just fine if we have each other. The best of luck to you in all your future endeavors!"}],"reward":{"gil":1000,"items":[{"id":18106,"one":1,"hq":1},{"id":18107,"one":1,"hq":1},{"id":18108,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"questsType":"all","quests":[68000,68193]}},"partials":[{"type":"npc","id":"1021762","obj":{"i":1021762,"n":"Swetelove","l":2407,"q":2}},{"type":"npc","id":"1021752","obj":{"i":1021752,"n":"Sayer","l":2407,"q":4}},{"type":"npc","id":"1021758","obj":{"i":1021758,"n":"Sayer","l":2407,"q":1}},{"type":"npc","id":"1021763","obj":{"i":1021763,"n":"Sayer","l":2407,"q":1}},{"type":"item","id":"18106","obj":{"i":18106,"n":"Triphane Ring of Fending","l":255,"c":54410,"t":43,"p":15147}},{"type":"item","id":"18107","obj":{"i":18107,"n":"Triphane Ring of Slaying","l":255,"c":54410,"t":43,"p":15147}},{"type":"item","id":"18108","obj":{"i":18108,"n":"Triphane Ring of Aiming","l":255,"c":54410,"t":43,"p":15147}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68000","obj":{"i":68000,"n":"The Fires Fade","g":6,"l":"Rhalgr's Reach","s":190}},{"type":"quest","id":"68193","obj":{"i":68193,"n":"The Sound of the Quarry","g":105,"l":"The Peaks","s":1040}}]}