{"quest":{"name":"A Second Assessment","location":"The Fringes","id":68196,"patch":4.0,"sort":1010,"eventIcon":71221,"issuer":1019524,"target":1019524,"genre":104,"journal":["Lucinne is in need of an extra pair of hands."],"objectives":["Obtain soil samples from the Comet's Tail.","Obtain a water sample from the Comet's Tail.","Deliver the samples to Lucinne."],"dialogue":[{"name":"LUCINNE","text":"Oh, you're the adventurer from before. Have you come for more work? Because I could certainly do with an extra hand or two."},{"name":"LUCINNE","text":"My analysis of the samples you brought me is coming along quite nicely, but there is one more area I would have you investigate."},{"name":"LUCINNE","text":"There's a cavern southeast of here, the Comet's Tail, so named for the glowing ore covering its walls and ceiling, as if the gods themselves captured starlight and placed it there."},{"name":"LUCINNE","text":"Despite its supposed beauty, however, I have heard reports that the area has been adversely affected by pollution. As before I need you to procure three samples of the soil and one of the water so I can ascertain the truth of what has happened there."},{"name":"LUCINNE","text":"Whatever damage has been done to that cavern, I pray it is not irreversible. I will require samples of both the soil and water there to be certain."},{"name":"LUCINNE","text":"Did you have trouble procuring the samples?"},{"name":"LUCINNE","text":"Yes, this is perfect. Perhaps someday soon we can restore the cave to what it once was."},{"name":"LUCINNE","text":"You see, the Comet's Tail was once a place of worship. Legend has it that, as the great flood of the Sixth Umbral Calamity swept across Eorzea, Rhalgr cast a great beacon into the sky to lead His people to safety. That beacon would one day fall to earth, and its remains are what illuminate that cave."},{"name":"LUCINNE","text":"The Ala Mhigans placed altars within, and would often visit to offer up prayers to Rhalgr. Of course, that all changed when the Garleans came..."},{"name":"LUCINNE","text":"No one is certain for what purpose the cave was closed off, but some say it was used as a crude weapons research facility."},{"name":"LUCINNE","text":"Whatever the truth may be, I will find it, and restore what was taken from the Ala Mhigans."},{"name":"LUCINNE","text":"When that day comes, I hope you'll go and pay the Comet's Tail a visit."}],"reward":{"gil":556,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"questsType":"all","quests":[68002,68179]}},"partials":[{"type":"npc","id":"1019524","obj":{"i":1019524,"n":"Lucinne","l":2406,"q":2}},{"type":"quest","id":"68002","obj":{"i":68002,"n":"Divide and Conquer","g":6,"l":"Rhalgr's Reach","s":210}},{"type":"quest","id":"68179","obj":{"i":68179,"n":"Doing Her Part","g":104,"l":"The Fringes","s":60}}]}