{"quest":{"name":"The Hidden Truth","location":"The Fringes","id":68197,"patch":4.0,"sort":1030,"icon":100697,"unlocksFunction":1,"eventIcon":71341,"issuer":1019519,"target":1023147,"involved":[1023142,1023143,1023144,1023148],"genre":104,"journal":["Serpent Marshal Brookstone is in need of a soldier.","The Alliance has recently taken hold of Castrum Oriens, and Serpent Marshal Brookstone is preparing for a reconnaissance of the area. He asks for your assistance, bidding you speak with Lieutenant Molkoh for further details.","Lieutenant Molkoh seems more than excited to be in your presence. After regaining her composure, she explains to you the purpose of the mission. They have discovered records of Ala Mhigan prisoners dating back to the beginning of the Garlean occupation twenty years prior. However, a number of entries in the documents are listed only as “Whereabouts Unknown.” To begin your investigation into these missing prisoners, Lieutenant Molkoh suggests speaking with the Ananta, whose residency in the Fringes predates even the Ala Mhigans.","You speak with an Ananta battlemaid who recalls the Garleans making prisoners of everyone they encountered, be they Ala Mhigan or even Ananta. While most were forced to serve in the imperial armies, a number of people were also taken to Bittermill. Lieutenant Molkoh now hopes to find some link to the past in the ruin of the abandoned hamlet.","No sooner do you arrive than you find Lieutenant Molkoh being assaulted by three Garlean soldiers. You make short work of two of her assailants. Perhaps you can pry answers out of the third.","The remaining soldier's eyes grow wide with fright at the sight of his fallen comrades and he soon flees. Lieutenant Molkoh seems to be injured, but hopefully her wounds are not serious.","Lieutenant Molkoh is none the worse for wear, but she is perplexed by the presence of Garlean soldiers. She suspects something suspicious is afoot. Before you can proceed, however, she begs you a moment to rest."],"objectives":["Speak with Lieutenant Molkoh.","Speak with the Ananta battlemaid.","Speak with Lieutenant Molkoh.","Interrogate the startled soldier.","Aid Lieutenant Molkoh."],"dialogue":[{"name":"SWETHRYKBROOKSTONE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Ah, <span class=\"highlight\">Forename Surname</span> of the Maelstrom?</span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\">Ah,  <span class=\"highlight\">Surname</span>.</span><span class=\"alternative\">Ah, <span class=\"highlight\">Forename Surname</span> of the Immortal Flames?</span></span> A moment if you would."},{"name":"SWETHRYKBROOKSTONE","text":"The Alliance has seen fit to charge the Twin Adder with overseeing the occupation of Castrum Oriens for the interim."},{"name":"SWETHRYKBROOKSTONE","text":"As an adventurer I realize it is your wont to attend to matters both great and small in all corners of the realm. Though it should go without saying that you must also uphold your obligations to <span class=\"alternative-container\"><span class=\"alternative\">the Maelstrom</span><span class=\"alternative\">the Twin Adder</span><span class=\"alternative\">the Immortal Flames</span></span>, and the Eorzean Alliance."},{"name":"SWETHRYKBROOKSTONE","text":"Thus I would ask for your aid in a reconnaissance mission here in the Fringes. Pray speak with Lieutenant Molkoh when you are ready to receive a briefing. She will be overseeing the operation."},{"name":"TAHLAMOLKOH","text":"&lt;gasp&gt; Do my eyes deceive me? It can't be... But it is! <span class=\"highlight\">Forename Surname</span>, the Griffin's Bane <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>!"},{"name":"TAHLAMOLKOH","text":"Yes, the great hero who defeated the Griffin atop Baelsar's Wall, bringing his plans of conquest to a shuddering halt. I can think of no other title that so aptly befits your prowess."},{"name":"TAHLAMOLKOH","text":"A pity no one else seems to think so. Ahem, but enough of that. What brings the illustrious Griffin's Bane here to Castrum Oriens?"},{"name":"TAHLAMOLKOH","text":"Serpent Marshal Brookstone has requested you assist in my investigation? This is such an honor! I'll do my best not to disappoint you."},{"name":"TAHLAMOLKOH","text":"Ah, goodness me, where are my manners? Tahla Molkoh, military records officer, at your service. I cannot offer much in the way of combat, but if you should have any inquiries regarding historical matters, you need only ask!"},{"name":"TAHLAMOLKOH","text":"Now then, let me apprise you of our current situation. Shortly after taking control of Castrum Oriens, we discovered a number of confidential documents left behind by the Garleans─prisoner records dating back to the beginning of Ala Mhigo's occupation."},{"name":"TAHLAMOLKOH","text":"As you might have guessed, a great many were conscripted and sent away to subjugate new territories. A surprisingly large number were executed, as a reminder of what would happen should any step out of line."},{"name":"TAHLAMOLKOH","text":"What we weren't expecting, however, was a number of prisoners listed simply as “Whereabouts Unknown.” We thought perhaps they met some ill-fortune during their imprisonment, or even escaped, but we could find no other documents to suggest what became of them."},{"name":"TAHLAMOLKOH","text":"Be they living or deceased, it is now our duty to find them. Not just for our own records, mind you, but their loved ones as well. They deserve the peace of mind of knowing what happened here."},{"name":"TAHLAMOLKOH","text":"Would that this were a recent incident, though. It will be no easy task ascertaining their whereabouts after twenty years, but I believe I know where we might begin our investigation."},{"name":"TAHLAMOLKOH","text":"The Ananta have called these lands home long before even the Ala Mhigans came to settle here. And as luck would have it, the Resistance has established cordial relations with their people. Perhaps they remember something of what happened all those years ago."},{"name":"SWETHRYKBROOKSTONE","text":"Lieutenant Molkoh can be somewhat of a handful, but her heart is in the right place. I wish you well on your mission, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>."},{"name":"ANANTASOLDIER","text":"Ala Mhigan prisoners captured twenty years ago?"},{"name":"ANANTASOLDIER","text":"Yesss, I remember. When the Garleansss gained their foothold here, they interned any and everyone. Ssstriders, Ananta─it mattered not. Most were forced to ssserve in the Garlean military, dispatched to other landsss from which they would never to return."},{"name":"ANANTASOLDIER","text":"If I'm not missstaken, the prisoners who remained were taken to a sssmall village to the south."},{"name":"ANANTASOLDIER","text":"I cannot sssay what transpired there, but the sssettlement was heavily guarded. I fear the worssst for them."},{"name":"TAHLAMOLKOH","text":"A settlement to the south? Why, that would have to be Bittermill. I recall records of its residents seeking asylum in Gridania when the Garleans first arrived. The place was all but razed to the ground. Let's begin our search there. Perhaps something of value still remains in the rubble."},{"name":"TAHLAMOLKOH","text":"I certainly hope the Ananta remember something of use."},{"name":"TAHLAMOLKOH","text":"What...what are Garleans doing here?"},{"name":"EMPIRESOLDIER02661","text":"(-Startled Soldier-)They cannot be allowed to leave. Get them!"},{"name":"POP","text":"You are under attack!"},{"name":"ANANTASOLDIER","text":"My sssisters were also among those taken to Bittermill. Only the heavens know what the Garleansss have done to them."},{"name":"EMPIRESOLDIER02661","text":"This place was supposed to be deserted!"},{"name":"TAHLAMOLKOH","text":"Please, be careful!"},{"name":"EMPIRESOLDIER02661","text":"(-Startled Soldier-)Uwaaah!"},{"name":"TAHLAMOLKOH","text":"Goodness, that smarts."},{"name":"TAHLAMOLKOH","text":"Only one remains now. Stay on your guard."},{"name":"TAHLAMOLKOH","text":"Perhaps I should have devoted more time to combat training. Though no amount of training would make me a match for the renowned Griffin's Bane. That was a magnificent display."},{"name":"TAHLAMOLKOH","text":"Garlean soldiers were certainly the last thing I expected to find in these abandoned and otherwise forgotten buildings. I managed to catch them unawares, but I'm quite certain this investigation would have ended poorly had you not arrived."},{"name":"TAHLAMOLKOH","text":"Still, I find this quite curious. The Garleans were said to have retreated from this area. What were they doing here?"},{"name":"TAHLAMOLKOH","text":"Still, I find this quite curious. By all rights the Garleans should be too busy contending with the Resistance to waste time in a place like this. What were they doing here?"},{"name":"TAHLAMOLKOH","text":"I'm afraid our search for answers has only raised more questions. If we are to make sense of any of this, we must search this place from top to bottom...after my heart returns to my chest."}],"reward":{"gil":800,"aetherCurrent":1,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"quests":[68002]},"next":[68198]},"partials":[{"type":"npc","id":"1019519","obj":{"i":1019519,"n":"Serpent Marshal Brookstone","l":2406,"q":8}},{"type":"npc","id":"1023147","obj":{"i":1023147,"n":"Tahla Molkoh","l":2406,"q":2}},{"type":"npc","id":"1023142","obj":{"i":1023142,"n":"Tahla Molkoh","l":2406,"q":3}},{"type":"npc","id":"1023143","obj":{"i":1023143,"n":"Ananta Battlemaid","l":2406,"q":1}},{"type":"npc","id":"1023144","obj":{"i":1023144,"n":"Tahla Molkoh","l":2406,"q":2}},{"type":"npc","id":"1023148","obj":{"i":1023148,"n":"Startled Soldier","l":2406,"q":1}},{"type":"quest","id":"68002","obj":{"i":68002,"n":"Divide and Conquer","g":6,"l":"Rhalgr's Reach","s":210}},{"type":"quest","id":"68198","obj":{"i":68198,"n":"Drawing a Blank","g":104,"l":"The Fringes","s":1040,"f":1}}]}