{"quest":{"name":"Saint Sayer","location":"The Peaks","id":68191,"patch":4.0,"sort":1020,"icon":100696,"unlocksFunction":1,"eventIcon":71341,"issuer":1020841,"target":1021752,"involved":[1021754],"genre":105,"journal":["Raganfrid would like to introduce you to an old friend.","After hearing that you wish to be of help to Ala Gannha, Raganfrid suggests you may want to make the acquaintance of a friend. He speaks of a man named Sayer, one of the town's former quarriers, and the only one that has shown any real desire to revive the flagging industry. Raganfrid points you in his friend's direction and you head off to hear what he has to say.","The locals hurl strings of abuse at Sayer as he tries to plead his cause, eventually electing to leave him on his own. It soon becomes clear that he wishes to revitalize the quarry in order to bring prosperity back to the village. However, the lack of support Sayer has becomes abundantly obvious when you witness that even his own granddaughter does not believe in his dream.","Upon speaking with Sayer you learn that the quarry has become overrun with beasts, effectively making it unapproachable. Steadfast in his belief that the village would rally behind him if the quarry was free of danger, he asks you to expel the beasts from the area. You are instructed to bring back two urolith soulstones as proof that you have completed the task.","You successfully rid the quarry of the urolith threat and get your hands on the requested soulstones. All that remains now is to present them to Sayer.","Sayer remarks that he is glad to see you returned, but even gladder that you have brought the urolith soulstones with you. However, it yet remains to be seen if this alone will be enough to persuade the villagers to lend an ear to the old man's cause."],"objectives":["Speak with Sayer.","Obtain two urolith soulstones from marble uroliths.","Deliver the urolith soulstones to Sayer."],"dialogue":[{"name":"RAGANFRID","text":"Fancy yourself as our village's savior, do you? If you truly mean what you say, I've a mind to introduce you to someone."},{"name":"RAGANFRID","text":"His name's Sayer. Used to be one of the quarry's finest workers, he did."},{"name":"RAGANFRID","text":"He keeps fighting the good fight to restore Ala Gannha to its former glory, but I do worry about the toll it must be taking on a man of his years. Have a chat with him if you're interested in helping."},{"name":"RAGANFRID","text":"As time's gone on, Sayer's slowly but surely become an isolated figure in our village. There aren't too many others here who share his enthusiasm to breathe fresh life into Ala Gannha, and that's putting it mildly."},{"name":"MAN02655","text":"The old bugger's treatin' us to another one of his speeches, I see."},{"name":"SAYER","text":"Thank you for coming. I'm still waiting for a few more of the villagers to arrive."},{"name":"MAN02655","text":"The old bugger's treatin' us to another one of his speeches, I see."},{"name":"SAYER","text":"How long do you plan to continue livin' in abject squalor, I ask you! It's high time we brought back the quarry that once made me proud to hail from Ala Gannha!"},{"name":"SAYER","text":"Some of you may be too young to remember, but the quarry used to mean everythin' to this village!"},{"name":"CARLE","text":"Bloody hells, when is this old codger going to stop harping on about the good old days? Time you opened your eyes, you daft bugger!"},{"name":"HODGKIN","text":"Time's long since passed when we could sell the stone here for a decent amount of gil. It's about time you faced the facts: there's no coin to be had sweating away your life in some bloody quarry. I'd be better served going out and hunting my own food."},{"name":"SAYER","text":"Just hear me out! If you give up on the quarry then you'll be givin' up on the village itself! Even the hardest of rocks will break if you keep chiselin' away at it─life's the same!"},{"name":"SWETELOVE","text":"Grandfather, that's enough."},{"name":"SWETELOVE","text":"I can tell you now that no one here would claim to be happy with their lot, but there's nothing that can be done. You remonstrating with everyone is hardly going to do any good!"},{"name":"SAYER","text":"Swetelove...<br>Well, what do you bloody expect with that attitude!? No one's going to work to improve things when even my own granddaughter has next to no motivation!"},{"name":"SWETELOVE","text":"There's a reason you don't see much quarrying going on anymore─there's no demand for it! We can get by just fine with the stones we gathered in the past and those we salvage from ruined buildings."},{"name":"SWETELOVE","text":"Prosperity doesn't lie in wait for us at the quarry, only monsters. It's about time you realized that we're lucky just to be alive these days. Come on, Grandfather, let's go home."},{"name":"SAYER","text":"Blasted girl understands nothin'! 'Course everythin's goin' to seem pointless if you're only sleepwalkin' through life.<br>And who in the hells are you anyway!? I ain't doin' this for your amusement!"},{"name":"SAYER","text":"I am indeed the Sayer you speak of. Raganfrid sent you my way, you say?"},{"name":"SAYER","text":"<span class=\"highlight\">Forename</span>, was it? So you're the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> we have to thank for savin' Wercrata? I can tell you've more fire in your belly than this entire village."},{"name":"SAYER","text":"Perhaps you'll be able to see that I'm not as crazy as these buggers think me."},{"name":"SAYER","text":"Ala Gannha owes everythin' to the quarry. The stones we extracted were solid and pleasin' on the eye to boot. We even supplied the stone used to build the palace; ah, those were the days... "},{"name":"SAYER","text":"It was the imperial invasion that changed everythin'. Those bastards thought stone structures barbaric, favorin' their cold, tasteless metallic buildin's instead. They say they look “civilized”─don't make me laugh!"},{"name":"SAYER","text":"The final blow to our way of life came when Garlemald began recruitin' our youth for their own army; we lost just as many to the rebel cause. With no one left to tend to the quarry, it slowly fell into ruin and is now overrun with beasts. "},{"name":"SAYER","text":"The few of us that remain have been left to eke out a living using any means we can. I swear on Rhalgr's very name, if we could just take back the Sleeping Stones, this whole village would brim with vitality again."},{"name":"SAYER","text":"I just need somethin' that proves the beasts are gone from the quarry. Then the villagers would surely see fit to help me restore it to its former glory!"},{"name":"SAYER","text":"I know this is a lot to ask of a complete stranger, but it's not as if I'm spoiled for choice right now─would you be able to rid the quarry of those damn monsters and bring me back two urolith soulstones?"},{"name":"SAYER","text":"I'll forever be in your debt."},{"name":"SAYER","text":"Slay the marble uroliths that inhabit the quarry and bring me back two urolith soulstones. That's all I need to turn everythin' around."},{"name":"SAYER","text":"Nice to see you returned. It'd be even nicer if you happened to be in possession of certain stones..."},{"name":"SAYER","text":"Yes, this is exactly what I was after."},{"name":"SAYER","text":"Let's waste no time in showing them to the others. It's been far too long since the last ray of hope shone into the villagers' miserable lives."}],"reward":{"gil":800,"aetherCurrent":1,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"quests":[68000]},"next":[68192]},"partials":[{"type":"npc","id":"1020841","obj":{"i":1020841,"n":"Raganfrid","l":2407,"q":3}},{"type":"npc","id":"1021752","obj":{"i":1021752,"n":"Sayer","l":2407,"q":4}},{"type":"npc","id":"1021754","obj":{"i":1021754,"n":"Cynical Villager","l":2407,"q":1}},{"type":"quest","id":"68000","obj":{"i":68000,"n":"The Fires Fade","g":6,"l":"Rhalgr's Reach","s":190}},{"type":"quest","id":"68192","obj":{"i":68192,"n":"As Stubborn as Stone","g":105,"l":"The Peaks","s":1030}}]}