{"quest":{"name":"Seeking Answers","location":"The Fringes","id":68199,"patch":4.0,"sort":1050,"icon":100697,"unlocksFunction":1,"eventIcon":71341,"issuer":1019519,"target":1019519,"involved":[1023142,1023151,1023153,1023154,1023155],"genre":104,"journal":["The look on Serpent Marshal Brookstone's face suggests he has grown tired of waiting.","You and the serpent marshal have been waiting on Lieutenant Molkoh for what feels an eternity. Certain she has finished, he asks you to check on her to see what information, if any, could be obtained from the detainee.","The lieutenant's talk with the detainee was uneventful. The only thing he is certain of, is that he escaped from Garlean captivity. If he is one of the missing prisoners remains to be seen. Thinking back to where they discovered him, she is convinced the imperial soldiers you recently encountered are related. She rushes to speak with Serpent Marshal Brookstone in the hopes of assembling a unit to apprehend them.","Not one to leave anything to chance, the serpent marshal has already dispatched men in search of the soldiers you encountered. Unfortunately, he lacks the manpower to cover all of the Fringes, and is deliberating on how to set about investigating Owyn's Stash. Lieutenant Molkoh readily volunteers on her, and your, behalf, then quickly rushes off to the cave.","You find Lieutenant Molkoh at the cave entrance, her enthusiasm replaced with growing reluctance. She sticks close behind as you make your way into Owyn's Stash.","Deep within the cave you find a Garlean soldier, and he's gravely injured. Lieutenant Molkoh bids you return to Castrum Oriens for assistance while she stays with your new captive.","Without a moment's hesitation, Serpent Marshal Brookstone orders his men to converge on Owyn's Stash to see the captured soldier safely back to Castrum Oriens. Soon you may finally have answers to the whereabouts of the missing prisoners."],"objectives":["Speak with Lieutenant Molkoh.","Speak with Serpent Marshal Brookstone.","Speak with Lieutenant Molkoh.","Search for the Garlean soldier.","Speak with Serpent Marshal Brookstone."],"dialogue":[{"name":"SWETHRYKBROOKSTONE","text":"I imagine Lieutenant Molkoh has finished questioning the detainee by now. Go and see what, if anything, she's learned. "},{"name":"TAHLAMOLKOH","text":"Oh, <span class=\"highlight\">Forename</span>. I've just finished with questioning."},{"name":"TAHLAMOLKOH","text":"Unfortunately, he can recall absolutely nothing of his past. The only thing he's certain of, is that he escaped from Garlean captivity. I'm beginning to believe he really is one of the missing prisoners."},{"name":"TAHLAMOLKOH","text":"But where does Bittermill fit into all of this? I fear we've reached an impasse. It's not as if we can ask the Garleans what they were doing there."},{"name":"TAHLAMOLKOH","text":"...Or perhaps we can! The soldier who escaped us earlier must know something to have been prowling about the area. He has to be taken into custody."},{"name":"TAHLAMOLKOH","text":"Come, <span class=\"highlight\">Forename</span>, we must speak with Serpent Marshal Brookstone about assembling a search party. No stone can be left unturned!"},{"name":"SWETHRYKBROOKSTONE","text":"Would you go and see what's keeping Lieutenant Molkoh? I very much doubt she could pry much information out of that man, daft as he was."},{"name":"SWETHRYKBROOKSTONE","text":"You wish to capture the soldier you encountered at Bittermill?"},{"name":"SWETHRYKBROOKSTONE","text":"Well, you should know I've already dispatched a reconnaissance team. After reading Lieutenant Molkoh's report, I thought it prudent he be apprehended immediately. However, therein lies the rub."},{"name":"SWETHRYKBROOKSTONE","text":"We lack the manpower to sufficiently survey the area. In fact, I was just deliberating over who I should call back to make a sweep of Owyn's Stash."},{"name":"TAHLAMOLKOH","text":"There's no need for that, sir. <span class=\"highlight\">Forename</span> and I will go. I realize I'm not the ideal scout to assist in this, but we have to find them."},{"name":"TAHLAMOLKOH","text":"That soldier is the key to finding the missing prisoners. I just know it!"},{"name":"TAHLAMOLKOH","text":"On your guard, <span class=\"highlight\">Forename</span>. I have a bad feeling about this place."},{"name":"SWETHRYKBROOKSTONE","text":"With my men spread so thin, your help is greatly appreciated. Be careful out there at Owyn's Stash."},{"name":"EMPIRESOLDIER02663","text":"(-Wounded Imperial-)What...what are you─ugh!"},{"name":"TAHLAMOLKOH","text":"These wounds! If he's not treated soon, he won't be telling anyone anything."},{"name":"TAHLAMOLKOH","text":"He's like to bleed out if left unattended. Go and tell Serpent Marshal Brookstone we've found him, and he needs medical assistance before he can be moved."},{"name":"TAHLAMOLKOH","text":"We found him, <span class=\"highlight\">Forename</span>! We really found him!"},{"name":"EMPIRESOLDIER02663","text":"&lt;groan&gt;"},{"name":"SWETHRYKBROOKSTONE","text":"My men have searched high and low, yet there is no sign of this runaway soldier."},{"name":"SWETHRYKBROOKSTONE","text":"You found him at Owyn's Stash!? Say no more."},{"name":"SWETHRYKBROOKSTONE","text":"Attention. This is Brookstone speaking. The subject has been found at Owyn's Stash. I repeat, the subject has been found at Owyn's Stash. He is severely wounded and in need of medical attention."},{"name":"SWETHRYKBROOKSTONE","text":"Excellent work. Perhaps now we can finally get to the bottom of all this Bittermill business."},{"name":"TAHLAMOLKOH","text":"Please hurry, <span class=\"highlight\">Forename</span>. This man needs a healer."}],"reward":{"gil":900,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"questsType":"all","quests":[68002,68198]},"next":[68200]},"partials":[{"type":"npc","id":"1019519","obj":{"i":1019519,"n":"Serpent Marshal Brookstone","l":2406,"q":8}},{"type":"npc","id":"1023142","obj":{"i":1023142,"n":"Tahla Molkoh","l":2406,"q":3}},{"type":"npc","id":"1023151","obj":{"i":1023151,"n":"Tahla Molkoh","l":2406,"q":2}},{"type":"npc","id":"1023153","obj":{"i":1023153,"n":"Tahla Molkoh","l":2406,"q":1}},{"type":"npc","id":"1023154","obj":{"i":1023154,"n":"Tahla Molkoh","l":2406,"q":1}},{"type":"npc","id":"1023155","obj":{"i":1023155,"n":"Wounded Imperial","l":2406,"q":1}},{"type":"quest","id":"68002","obj":{"i":68002,"n":"Divide and Conquer","g":6,"l":"Rhalgr's Reach","s":210}},{"type":"quest","id":"68198","obj":{"i":68198,"n":"Drawing a Blank","g":104,"l":"The Fringes","s":1040,"f":1}},{"type":"quest","id":"68200","obj":{"i":68200,"n":"The Honest Truth","g":104,"l":"The Fringes","s":1060,"f":1}}]}