{"quest":{"name":"The Sound of the Quarry","location":"The Peaks","id":68193,"patch":4.0,"sort":1040,"icon":100696,"eventIcon":71221,"issuer":1021759,"target":1021752,"involved":[1021760,1021762],"genre":105,"journal":["Sayer is chuffed to bits with his new plan.","After Sayer has finished boasting about how wonderful his plan is, he proceeds to recite the famed work song that helped him stay strong while working. Sayer tells you to protect him while he investigates the site where he hopes to find the precious stone mentioned in the lyrics. Realizing there is no room to deny his pseudo-request, you prepare to set off for the Ziggurat.","Rendezvousing with Sayer, you learn that the area around the Ziggurat is home to a number of Qiqirn bandits. You ready your weapon and go on the hunt for any that may be lying in wait for you out of sight.","Having made quick work of all the bandits you can find, you decide it is safe to head back to Sayer. He thanks you for your efforts and quickly sets about getting to work himself.","Sayer soon unearths a small piece of ore which he believes may prove to be of value. The keen quarrier then hurries back to Ala Gannha, saying he will start examining the ore as soon as he is returned. You too decide to follow suit and embark on the journey back to the village.","Upon your return you are greeted by Sayer who remarks that the ore was but a worthless crystal fragment. Embarrassed by his mistake, he reflects that part of the song had already warned of such a trap. Just as Swetelove hears her grandfather reciting the work song, she recalls that there was an alternate version of the tune's lyrics. Sayer is buoyed by this revelation, daring to hope once more that success may yet be within his grasp."],"objectives":["Speak with Sayer west of the Ziggurat.","Lie in wait at the designated location, and slay any Qiqirn bandits that appear.","Use the /beckon emote at the designated location.","Speak with Sayer in Ala Gannha."],"dialogue":[{"name":"SAYER","text":"Heh heh, finished comin' to terms with just how inspired my new plan is?"},{"name":"SAYER","text":"Anyone that's held a hammer and chisel knows the wonders a good work song can do. After you've been singin' for a while, your swings start to match the song's rhythm and everythin' falls naturally into place─you can work for hours and hours without even realizin' it!"},{"name":"SAYER","text":"Hammer in one hand, chisel in't other♪<br>Cuttin' up rocks't bring home't mother♪<br>Rocks become gil, gil becomes a house♪<br>Our hearts the quarry has, no need for a spouse♪"},{"name":"SAYER","text":"And the song meanders along in a similar vein after that. The endin', however, is quite somethin'."},{"name":"SAYER","text":"Speckled stone, edge of't layer♪<br>Sell not this stone to a kindly payer♪<br>Nay, search for't pebbles♪<br>Young maiden revels♪<br>That's how it finishes."},{"name":"SAYER","text":"“Speckled stone, edge of't layer” refers to changing patterns that adorn the rock found deep underground. The rocks closest to the edge of each layer are the most brittle, you see. That part of the song exists as a warnin' to never sell on inferior stone."},{"name":"SAYER","text":"Although, you'd struggle to find a quarrier that doesn't know as much. No, it is the “Nay, search for't pebbles. Young maiden revels.” part which I find curious."},{"name":"SAYER","text":"I believe it to be referrin' to a jewel of some kind. After all, you'd hardly give a young lass any old pebble you just happened to find─no, only the finest jewels would do."},{"name":"SAYER","text":"If I were able to somehow take a gander at the stone mentioned in the song... Probably impossible, mind you. The closest fissure where I could stand a chance of finding it is home to a group of Qiqirn bandits."},{"name":"SAYER","text":"If I were able to somehow take a gander at the stone mentioned in the song... Probably impossible mind you, the closest fissure where I could stand a chance of finding it is right next to an imperial stronghold."},{"name":"SAYER","text":"That bein' said, I might be able to find somethin' if I had you to keep me safe from harm. Accompany me, <span class=\"highlight\">Forename</span>, I'm sure you'll enjoy the journey."},{"name":"SAYER","text":"Seems I was right to bring you along. The place is swarming with those rats."},{"name":"SAYER","text":"Try searching the surroundings for any that might happen to be lyin' in wait for us. I trust you know what to do when you come across one."},{"name":"SAYER","text":"Well, what are you waitin' for? I can't get to work till you clear out the bandits."},{"name":"SYSTEM","text":"You have secured the area. <span class=\"highlight\">beckon</span> Sayer over to you."},{"name":"SAYER","text":"Fine work, <span class=\"highlight\">Forename</span>! Suppose it's time for me to do my part."},{"name":"SAYER","text":"Feast your eyes on this ore, <span class=\"highlight\">Forename</span>! Popped right out when I chiseled away along one of the layers of rock."},{"name":"SAYER","text":"My guess is it could be used to craft quite a fetchin' jewel. I'll hurry back to the village and set about examinin' it in further detail."},{"name":"SWETELOVE","text":"<span class=\"highlight\">Forename</span>, my apologies for any bother my grandfather caused you, but I do thank you sincerely for keeping him safe."},{"name":"SAYER","text":"Ah, <span class=\"highlight\">Forename</span>. Sad to say it seems we were on a fool's errand. 'Twas no ore that we found, but a crystal fragment of incredibly low purity."},{"name":"SAYER","text":"Only the most naive of bairns would rejoice upon findin' this shiny piece of rubbish. “Speckled stone, edge of't layer. Sell not this stone to a kindly payer.” must have been referrin' to this."},{"name":"SWETELOVE","text":"Grandfather, is that perchance a line from a song that begins with “Hammer in one hand, chisel in't other”?"},{"name":"SAYER","text":"Indeed it is... But why do you know that?"},{"name":"SWETELOVE","text":"Father used to sing it to me in lieu of a lullaby. It's one of my most precious memories from the short time we were able to spend together."},{"name":"SAYER","text":"Indeed, your father was a fine quarrier. Not a day passes that I don't rue his death at the hands of those bastards from Garlemald. We never even had the chance to work together... He chose to apprentice under another teacher, said he didn't want me goin' easy on him."},{"name":"SAYER","text":"But enough about the past. We had been usin' the song as a guide to find stones of value, but the Spinner's still yet to smile on us."},{"name":"SWETELOVE","text":"Have you forgotten, Grandfather? There's another version of the song, one which might lead you in the right direction."},{"name":"SAYER","text":"Another...why yes, there was another version, wasn't there. It's been so long since I last sung it I had completely forgotten. I don't suppose you remember the lyrics?"},{"name":"SWETELOVE","text":"Of course I do. All of my memories of Father are as vivid as ever."},{"name":"SAYER","text":"That's my girl! You hear that, <span class=\"highlight\">Forename</span>? There's hope yet!"}],"reward":{"gil":900,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"questsType":"all","quests":[68000,68192]},"next":[68194]},"partials":[{"type":"npc","id":"1021759","obj":{"i":1021759,"n":"Sayer","l":2407,"q":2}},{"type":"npc","id":"1021752","obj":{"i":1021752,"n":"Sayer","l":2407,"q":4}},{"type":"npc","id":"1021760","obj":{"i":1021760,"n":"Sayer","l":2407,"q":1}},{"type":"npc","id":"1021762","obj":{"i":1021762,"n":"Swetelove","l":2407,"q":2}},{"type":"quest","id":"68000","obj":{"i":68000,"n":"The Fires Fade","g":6,"l":"Rhalgr's Reach","s":190}},{"type":"quest","id":"68192","obj":{"i":68192,"n":"As Stubborn as Stone","g":105,"l":"The Peaks","s":1030}},{"type":"quest","id":"68194","obj":{"i":68194,"n":"Spooky Stones","g":105,"l":"The Peaks","s":1050}}]}