{"quest":{"name":"Where the Wild Pandas Are","location":"Kugane","id":68206,"patch":4.0,"sort":1060,"eventIcon":71221,"issuer":1021331,"target":1021331,"involved":[1021264,1021265],"genre":107,"journal":["A graceful geiko of Kugane is frantically searching for something."],"objectives":["Search for the escaped red panda cubs.","Return the escaped red panda cubs to the graceful geiko."],"dialogue":[{"name":"GEIKO02670","text":"Oh dear, wherever could they have gotten to? My sweet little babies..."},{"name":"GEIKO02670","text":"You there. You look to be a kind and helpful soul. Please, would you be so good as to help a geiko in her most desperate hour?"},{"name":"GEIKO02670","text":"My sweet little babies escaped from the okiya. I fear they may have climbed up somewhere high and are unable to get back down."},{"name":"GEIKO02670","text":"They are two red panda cubs, and they are ever so timid. They have never even been outside the okiya. I know they must still be somewhere within the city, I just know it. Please, you must find them for me!"},{"name":"GEIKO02670","text":"They are two red panda cubs, and they are ever so timid. They have never even been outside the okiya. I know they must still be somewhere within the city, I just know it. Please, you must find them for me!"},{"name":"AILURUSFULGENS","text":"&lt;squeal&gt; &lt;whimper&gt; &lt;squeak&gt;"},{"name":"GEIKO02670","text":"Were you able to find my sweet little babies?"},{"name":"GEIKO02670","text":"Oh, thank you! Thank you ever so much! I was so worried they might be found by someone less savory than yourself and... I cannot even bring myself to utter the thought."},{"name":"GEIKO02670","text":"Mind you, I do not mean to speak ill of my clients. I meant only to say that my babies are rare and valuable animals from a faraway land. There are many who would have simply sold them had they happened across them."},{"name":"GEIKO02670","text":"But it is precisely because I keep the company of so many morally bereft that I knew. I knew you were different the moment I saw you."},{"name":"GEIKO02670","text":"This city is as a mirror held up to the desires of man. For some, it shows wealth in the form of gil and greed. But for one as good as you, the real wealth to be had is that of treasured experiences and memories. Here, take this for your time. And thank you. I hope to see you again someday─mayhap in my okiya."}],"reward":{"gil":556,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"quests":[68011]}},"partials":[{"type":"npc","id":"1021331","obj":{"i":1021331,"n":"Graceful Geiko","l":2404,"q":1}},{"type":"npc","id":"1021264","obj":{"i":1021264,"n":"Red Panda Cub","l":2404,"q":1}},{"type":"npc","id":"1021265","obj":{"i":1021265,"n":"Red Panda Cub","l":2404,"q":1}},{"type":"quest","id":"68011","obj":{"i":68011,"n":"Making the Catfish Sing","g":6,"l":"Kugane","s":300}}]}