{"quest":{"name":"The Price of Betrayal","location":"The Ruby Sea","id":68209,"patch":4.0,"sort":2030,"unlocksFunction":1,"eventIcon":71341,"issuer":1019168,"target":1019154,"involved":[1022745],"genre":108,"journal":["Yusui is looking for an individual who can freely enter the Ruby Price."],"objectives":["Speak with Ikaruga at the Ruby Price.","Confront the bakufu traitor.","Report to Ikaruga."],"dialogue":[{"name":"YUSUI","text":"You! Yes, <span class=\"emphasis\">you</span>. Do you know of the Ruby Price─the fortress in middle of the Ruby Sea from which the bakufu soldiers survey the surrounding waters?"},{"name":"YUSUI","text":"The other day, we found one of their men stowed away on a ship we confiscated. With a bit of coaxing, he eventually confessed to doing some underhanded trading with the Red Kojin on behalf of his superior."},{"name":"YUSUI","text":"Seems he thought he could avoid paying the Ruby Tithe by hiding aboard someone else's ship, but no one gets away with crossing our waters free of charge. As such, I am looking to track down this superior of his and have him compensate us."},{"name":"YUSUI","text":"If I try to sail to the Ruby Price and look for him myself, however, I'll be blasted to smithereens before I even make it halfway there."},{"name":"YUSUI","text":"Do you think you could go in my stead? There is a man by the name of Ikaruga there. He is an old friend and should be able to identify who our captive's superior is."},{"name":"YUSUI","text":"Please, go and speak with Ikaruga. He should be able to give you the name of our captive's superior."},{"name":"IKARUGA","text":"Ah, yes. Just the other day one of the soldiers deserted base. I suspect he is the man Yusui is after."},{"name":"IKARUGA","text":"Trade with foreign countries is strictly prohibited in our nation. The man, upon learning his subordinate disappeared feared he would be caught and turned tail and ran. If, what you told me is true, he likely went northwest of here to seek asylum with the Kojin of the Red."},{"name":"IKARUGA","text":"I am tempted to go after this man myself. Alas, that would require me receiving the necessary authorization, which could take days. Please, track him down and arrest him in my stead. If he resists, feel free to kill him."},{"name":"IKARUGA","text":"It will take time we do not have for me to receive the necessary permission to go after this felon. As such, I ask that you apprehend him in my stead. If he resists, you have my blessing to kill him."},{"name":"BOSS02673","text":"I would have to be a fool to agree to go with you! I am so close to the Red Kojin's settlement─so close to freedom!"},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"YUSUI","text":"Please, you must help me learn who is in charge of the man we have in captivity."},{"name":"IKARUGA","text":"Ah, so it seems he forced your hand. Perhaps his death was for the best."},{"name":"IKARUGA","text":"I will send word of all that has happened to Yusui, though I am not sure he will be happy to hear it... Ah, you are curious to know how I will inform him? That, my friend, is a secret. &lt;wink&gt;"}],"reward":{"gil":629,"aetherCurrent":1,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68014]},"next":[68212,68213]},"partials":[{"type":"npc","id":"1019168","obj":{"i":1019168,"n":"Yusui","l":2409,"q":2}},{"type":"npc","id":"1019154","obj":{"i":1019154,"n":"Ikaruga","l":2409,"q":1}},{"type":"npc","id":"1022745","obj":{"i":1022745,"n":"Bakufu Traitor","l":2409,"q":1}},{"type":"quest","id":"68014","obj":{"i":68014,"n":"Boys with Boats","g":6,"l":"The Ruby Sea","s":330}},{"type":"quest","id":"68212","obj":{"i":68212,"n":"First Line of Defense","g":108,"l":"The Ruby Sea","s":2040}},{"type":"quest","id":"68213","obj":{"i":68213,"n":"Ethereal Lights","g":108,"l":"The Ruby Sea","s":2050}}]}