{"quest":{"name":"Zero Tolerance Teahouse","location":"Kugane","id":68205,"patch":4.0,"sort":1050,"eventIcon":71221,"issuer":1023304,"target":1023304,"involved":[1023305,1023306],"genre":107,"journal":["A teahouse serving girl of Kugane is at her wit's end due to the incessant repetitions of an ebrious citizen."],"objectives":["Speak with the teahouse hireling.","Dump the pail of cold well water on the fabulously foxed fellow.","Speak with the teahouse serving girl."],"dialogue":[{"name":"TEAHOUSE02669","text":"Enough! I can't stand it anymore. How many times are you going to recant the same old tired tale!?"},{"name":"DRANKER02669","text":"Shut your mouth and open your earsh, you little bint! Thish shtatue is Zuiko of Clan Buhen─the greatesht warlord Hingashi has ever sheen! The founder of Suenokuni!"},{"name":"DRANKER02669","text":"Let's shee... How many yearsh ago were it that he...&lt;burp&gt;...were Lord of Suenokuni..."},{"name":"TEAHOUSE02669","text":"Excuse me there, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. Would you please do something to cool off this hot-headed drunkard?"},{"name":"TEAHOUSE02669","text":"I've just now sent a teahouse hireling to fetch some water from the well. If you are able to find her, ask her for a pail of cold well water. I'll do what I can to keep this ale-soaked sod from bothering the other patrons until you return."},{"name":"TEAHOUSE02669","text":"I've just now sent a teahouse hireling to fetch some water from the well. If you are able to find her, ask her for a pail of cold well water. I'll do what I can to keep this ale-soaked sod from bothering the other patrons until you return."},{"name":"DRANKER02669","text":"And thish here'sh the besht part of all. There were... There were... Damn it all. What were I jusht about to shay?"},{"name":"APPRENTICE02669","text":"That drunkard is at it again, is he? Well, I've got just the thing for him. Here, take this pail of cold well water and give his head a good dousing. That always seems to do the trick."},{"name":"APPRENTICE02669","text":"Take that pail of cold well water and give that drunkard's head a good dousing. That always seems to do the trick."},{"name":"DRANKER02669","text":"Oh no, I've gone and got good and drunk again, aren't I? I'm sho shorry. It'sh jusht, I were a graveguard for the branch family of a branch family of a branch family of Clan Buhen, I were."},{"name":"DRANKER02669","text":"My love of the drink got me to where you shee me now. I didn't never mean to bother nobody. I'm shorry. Sho very, very shorry."},{"name":"TEAHOUSE02669","text":"Go ahead and dump that pail of cold well water square on that drunken mummer's head!"},{"name":"TEAHOUSE02669","text":"Thank you for your trouble, stranger. I hate to admit it, but as prominent and well-to-do an establishment as our Umineko Teahouse is, we do find ourselves a close neighbor to the Hostelry. Drunkards are not as few and far between as we would like."},{"name":"TEAHOUSE02669","text":"But that's not to say their lot is all bad. There are many whom the drink drives to be quite generous. Those souls are always willing to part with a pretty gil to buy whatever tea and sweets we recommend."},{"name":"TEAHOUSE02669","text":"That is just one of the many reasons why I have come to love this city. I hope you come to grow as fond of it as I have. Good day to you, then!"}],"reward":{"gil":622,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"quests":[68008]}},"partials":[{"type":"npc","id":"1023304","obj":{"i":1023304,"n":"Teahouse Serving Girl","l":2404,"q":1}},{"type":"npc","id":"1023305","obj":{"i":1023305,"n":"Fabulously Foxed Fellow","l":2404,"q":1}},{"type":"npc","id":"1023306","obj":{"i":1023306,"n":"Teahouse Hireling","l":2404,"q":1}},{"type":"quest","id":"68008","obj":{"i":68008,"n":"By the Grace of Lord Lolorito","g":6,"l":"Kugane","s":270}}]}