{"quest":{"name":"To Bathe a Garlean","location":"Kugane","id":68208,"patch":4.0,"sort":1080,"eventIcon":71221,"issuer":1021269,"target":1021269,"involved":[1021270],"genre":107,"journal":["Something has a peddler of peculiars in Kugane quite distressed."],"objectives":["Gather some water from the Bokaisen Hot Springs.","Deliver the Bokaisen Hot Springs water to the Garlean Consulate guard.","Speak with the peddler of peculiars."],"dialogue":[{"name":"JACKOFALLTRADES02672","text":"My, that's a fit body you have there. Oh, forgive me. I did not mean to be lewd. I only wish to commission a task of someone, and I meant to say you look more than able."},{"name":"JACKOFALLTRADES02672","text":"The people of this city call me a peddler of peculiars. I am a man who knows how to procure things─no matter how odd or rare. I was just delivering a collection of water from the Bokaisen Hot Springs to a guard at the Garlean Consulate when I threw my back out and spilt the water."},{"name":"JACKOFALLTRADES02672","text":"My trade is based on my clients' trust in me, so I can hardly abide this order to go unmet. Please, would you fetch some more water from the hot springs at Bokaisen?"},{"name":"JACKOFALLTRADES02672","text":"There is a flight of stairs to the west of the Rakuza District. At its top is where you will find the Bokaisen Hot Springs. And you must move with haste. It will not serve to deliver tepid water and ask for it to be warmed. Now go, gather some water and see it to the guard at the Garlean Consulate while it is yet hot."},{"name":"SYSTEM","text":"Transport the water from the Bokaisen Hot Springs to the guard posted in front of the Garlean Consulate gate before it cools."},{"name":"SYSTEM","text":"You will have two minutes to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"JACKOFALLTRADES02672","text":"There is a flight of stairs to the west of the Rakuza District. At its top is where you will find the Bokaisen Hot Springs. And you must move with haste. It will not serve to deliver tepid water and ask for it to be warmed. Now go, gather some water and see it to the guard at the Garlean Consulate while it is yet hot."},{"name":"GUARDIAN02672","text":"What is it? If you're not expected, begone from here. I'll not warn you again."},{"name":"JACKOFALLTRADES02672","text":"The Garlean Consulate lies to the south of here. Travel there as quickly as you can, lest the water from the springs cool before you deliver it. See it to the hands of the Consulate guard you find posted in front of the gate."},{"name":"GUARDIAN02672","text":"What is it? If you're not expected, begone from here. I'll not warn you again."},{"name":"GUARDIAN02672","text":"Water from the Bokaisen Hot Springs? Aye, I'd heard such an order was made. Your work here is done, then. Ask no questions, and begone."},{"name":"GUARDIAN02672","text":"Your work here is done. Begone."},{"name":"JACKOFALLTRADES02672","text":"You saw the water safe to the Consulate guard? Well done! I trust you no doubt found him a...less-than-welcoming sentry, yes? "},{"name":"JACKOFALLTRADES02672","text":"Well, as you may know, acts of bloodshed are forbidden here in Kugane. Our violent visitors from Garlemald are denied their typical violent outlets. They simply cannot suffer to be further emasculated by bathing in the nude together with the enemy. "},{"name":"JACKOFALLTRADES02672","text":"You were told to ask no questions, yes? They are loath to have anyone know that embarrassing little truth, so let us pretend you never heard it, shall we? Thank you for your aid, my friend─and your silence."}],"reward":{"gil":622,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"quests":[68011]}},"partials":[{"type":"npc","id":"1021269","obj":{"i":1021269,"n":"Peddler Of Peculiars","l":2404,"q":1}},{"type":"npc","id":"1021270","obj":{"i":1021270,"n":"Consulate Guard","l":2404,"q":1}},{"type":"quest","id":"68011","obj":{"i":68011,"n":"Making the Catfish Sing","g":6,"l":"Kugane","s":300}}]}