{"quest":{"name":"A Drink in the Tub","location":"Kugane","id":68202,"patch":4.0,"sort":1020,"eventIcon":71221,"issuer":1019034,"target":1019034,"involved":[1019002],"genre":107,"journal":["Amaji of Kugane has a task fit for one of your adventuring proclivities."],"objectives":["Speak with Kotokaze and obtain a bottle of Hingan rice wine.","Speak with Amaji.","Pour the Hingan rice wine into the Bokaisen soaking bath.","Speak with Amaji."],"dialogue":[{"name":"AMAJI","text":"Hello there, adventurer. I've been looking for one just like yourself to aid me. I am loath to ask such a thing of another, but I fear this old man is left with no other choice."},{"name":"AMAJI","text":"There is an ancient tradition of pouring rice wine into the waters here at Bokaisen Hot Springs. Believe me, there is no better remedy for what ails you than a good soak in a hot sake bath."},{"name":"AMAJI","text":"Trouble is, I'm fresh out of rice wine, and my old bones are too weary to make the trip to acquire more. Would you be so good as to bring me some Hingan rice wine from the Shiokaze Hostelry? Ask for it from the matron there, Kotokaze. That dear lass will give you what I need."},{"name":"AMAJI","text":"Will you bring me some Hingan rice wine from the Shiokaze Hostelry? Ask for it from the matron there, Kotokaze. She will give you what I need."},{"name":"KOTOKAZE","text":"You desire some sake for Amaji? You need only ask, my dear. I have just the very thing for that sweet old man. Here, take him this Hingan rice wine. Rest assured, it is some of the finest to be found."},{"name":"KOTOKAZE","text":"You had best not keep that poor old Amaji waiting any longer than you absolutely have to. The Bokaisen Hot Springs are a cornerstone of our Kugane. See our friend his rice wine, that he might draw his baths as he sees fit."},{"name":"AMAJI","text":"You're a kind young soul, you are. Please, pour that Hingan rice wine you've got into that soaking bath there."},{"name":"AMAJI","text":"You've brought the Hingan rice wine, and I'm grateful for that. I'd be ever more grateful if you'd pour it into that there soaking bath for me."},{"name":"AMAJI","text":"Just the thought of soaking in that stuff sets my old bones to singing. Here, then, I'll take that empty bottle off your hands."},{"name":"AMAJI","text":"Oooh, look at that. There's a little gift from the gods left in there. Aheeheehee! Let's have us a little nip to warm the belly and loose the joints."},{"name":"AMAJI","text":"Aaah, that's the stuff, alright. Damn fine brew. You've gone and done spoiled an old man this day, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"AMAJI","text":"We've another tradition in these parts─whosoever carries a bottle of sake to the place it's opened is entitled to the last bit in the bottle. Lucky for me, you weren't aware of that custom either. Aheeheehee!"},{"name":"AMAJI","text":"We change the soaking waters we offer here at Bokaisen out at the onset of each season. But it's the rice wine baths what folks love more than aught else."},{"name":"AMAJI","text":"Of course, it's seeing the happy faces of those come to soak what makes me happy. That's what keeps this old man going. I couldn't quit this job even if I wanted to. Aheeheehee!"}],"reward":{"gil":688,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"quests":[68008]}},"partials":[{"type":"npc","id":"1019034","obj":{"i":1019034,"n":"Amaji","l":2404,"q":2}},{"type":"npc","id":"1019002","obj":{"i":1019002,"n":"Kotokaze","l":2404,"q":5}},{"type":"quest","id":"68008","obj":{"i":68008,"n":"By the Grace of Lord Lolorito","g":6,"l":"Kugane","s":270}}]}