{"quest":{"name":"Dedication to the Craft","location":"Kugane","id":68201,"patch":4.0,"sort":1010,"eventIcon":71221,"issuer":1023300,"target":1023300,"involved":[1023301,1023302,1023303],"genre":107,"journal":["A Near Eastern merchant in Kugane is eager to ask a task of you."],"objectives":["Speak with the humble servant.","Find the veteran lanternmaker.","Deliver the paper lantern to the Near Eastern merchant."],"dialogue":[{"name":"NEAREASTMERCHANT02665","text":"Hello there, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. You're a wandering adventurer, are you not? Please, spare a moment to hear out the whim of a troubled merchant from Thavnair."},{"name":"NEAREASTMERCHANT02665","text":"I placed a custom order and sent a servant to the Rakuza District to pick it up. Only, it has been half a sun and he has yet to return. The item is of some value, and I grow more anxious with each passing bell."},{"name":"NEAREASTMERCHANT02665","text":"Would you go and find this useless servant of mine? No doubt he is off idling somewhere in the Rakuza District. And put his backside to the lash when you do. Trust I will reward you for your trouble."},{"name":"NEAREASTMERCHANT02665","text":"Would you go and find this useless servant of mine? No doubt he is off idling somewhere in the Rakuza District. And put his backside to the lash when you do. Trust I will reward you for your trouble."},{"name":"EMPLOYEE02665","text":"Master sent you to find me? Yes, I suppose I was running a bit late. Please, do spare me the lash. I'm still raw from Master's last bout of rage. "},{"name":"EMPLOYEE02665","text":"I meant to make my way to the artisan's shop to pick up Master's order, but lost my way. Begging your pardon, I am newly come to this place, and have never known such city streets. Surely one so traveled as yourself has no such problems."},{"name":"EMPLOYEE02665","text":"No doubt the lash awaits me upon my return, but I fear the deed hopeless for me. Could I ask, will you seek out the Rakuza District's veteran lanternmaker in my stead? He holds a paper lantern crate for my master that must be delivered with all haste."},{"name":"NEAREASTMERCHANT02665","text":"I heard all from my useless servant. Thank you for your help in this. I confess, I know not which I am more eager to see─my servant put to the lash, or my new paper lantern hung aboard my pleasure barge."},{"name":"LANTERNCRAFTER02665","text":"What the bloody hells took so damned long!? It's always fancy as you please with these accursed rich. Not a piss of a thought for others' time. Here, take the damn lantern and be off!"},{"name":"LANTERNCRAFTER02665","text":"Damned hassle of an order, too. I've been at this more years than I can count, and that bloody lantern was a test for even my hand."},{"name":"LANTERNCRAFTER02665","text":"It'll be the finest lantern in all of Kugane. At least till that merchant commissions another of me. Go on, then, see it to him. And be bloody careful. I'm off to bed. I've not slept a wink since I set to making that thing three suns past."},{"name":"NEAREASTMERCHANT02665","text":"I heard all from my useless servant. Tell me, were you able to track down my paper lantern?"},{"name":"NEAREASTMERCHANT02665","text":"By the gods, this is a work of art if ever I have seen one. Just as I asked, it is a perfect blend of my own delicate tastes and a faraway exoticism. Servant! What of the job I put to you?"},{"name":"EMPLOYEE02665","text":"If Master refers to the figurehead carving for his pleasure barge, then all is proceeding smoothly, save for just one small thing. The shipwright is a man of great pride. I fear he insists the special request Master made will require a sum more gil than originally anticipated."},{"name":"NEAREASTMERCHANT02665","text":"Tell the fool that gil is no object. And if he does not believe you, take a letter bearing my seal and slap him across the face with it. For now, go to the barge and hang this lantern in plain view for all to see."},{"name":"NEAREASTMERCHANT02665","text":"Oh, yes, how thoughtless of me. I had wholly forgotten to compensate you for your trouble. My, you adventurers often prove yourselves quite useful."},{"name":"EMPLOYEE02665","text":"You've brought the crate that contains Master's paper lantern. Thank you. My own failure was reason enough for the lash, but had the delay given the lanternmaker cause to sell to another... Shudder to think. Please, give it to Master right away!"}],"reward":{"gil":622,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"quests":[68008]}},"partials":[{"type":"npc","id":"1023300","obj":{"i":1023300,"n":"Near Eastern Merchant","l":2404,"q":1}},{"type":"npc","id":"1023301","obj":{"i":1023301,"n":"Humble Servant","l":2404,"q":1}},{"type":"npc","id":"1023302","obj":{"i":1023302,"n":"Veteran Lanternmaker","l":2404,"q":1}},{"type":"npc","id":"1023303","obj":{"i":1023303,"n":"Humble Servant","l":2404,"q":1}},{"type":"quest","id":"68008","obj":{"i":68008,"n":"By the Grace of Lord Lolorito","g":6,"l":"Kugane","s":270}}]}