{"quest":{"name":"The Honest Truth","location":"The Fringes","id":68200,"patch":4.0,"sort":1060,"icon":100697,"unlocksFunction":1,"eventIcon":71341,"issuer":1019519,"target":1019519,"involved":[1023144,1023156,1023157,1023158],"genre":104,"journal":["Serpent Marshal Brookstone is eager to know what became of the injured Garlean soldier.","Certain his men have returned, the serpent marshal bids you seek out Lieutenant Molkoh and check on the condition of their new captive.","Lieutenant Molkoh informs you the soldier was transported to Castrum Oriens without incident, and healers are presently tending to his wounds. When he has recovered enough to speak, she means to learn once and for all what happened to the prisoners twenty years ago. All you can do now is wait.","Though battered and bruised, the soldier is all too happy to tell you what he knows. Much to Lieutenant Molkoh's horror, he elucidates the Garleans' plans to make a chemical weapon, which was tested on the prisoners moved to Bittermill. The scientist who created it, one Grillairmais, is the crazed man you found wandering in the woods. Lieutenant Molkoh bids the soldier go and rest as she reflects on this horrifying revelation.","To remove any doubt of the soldier's claim, Lieutenant Molkoh asks you to accompany her to Bittermill one last time. She's confident something of the experiments remains buried in the ruins of the hamlet.","You find Lieutenant Molkoh at Bittermill, shovel in hand and ready to work. She suggests splitting up to hasten your search.","After much digging and searching, you happen upon a strange metal container. The lieutenant will be pleased to know what you've found.","Though she is saddened to have found evidence supporting the Garlean soldier's story, Lieutenant Molkoh does not want to take any rash action. She insists on first reporting to Serpent Marshal Brookstone. ","The serpent marshal is pleased with your work, and assures you the container will be destroyed once it has been safely removed from Bittermill. With the investigation finally over, Lieutenant Molkoh intends to return to Gridania to make a record of what transpired. She hopes someday her records will include other tales of your bravery and derring-do."],"objectives":["Speak with Lieutenant Molkoh.","Wait with Lieutenant Molkoh to speak with the Garlean soldier.","Speak with Lieutenant Molkoh.","Search Bittermill for evidence.","Speak with Lieutenant Molkoh.","Speak with Serpent Marshal Brookstone."],"dialogue":[{"name":"SWETHRYKBROOKSTONE","text":"By all rights my men should be back by now. Go and see if you can find Lieutenant Molkoh. I want to know what those Garlean dogs were up to."},{"name":"TAHLAMOLKOH","text":"Ah, <span class=\"highlight\">Forename</span>. I'm happy to report we managed to bring him back safely, and not a minute too soon."},{"name":"TAHLAMOLKOH","text":"I planned to speak with him shortly after returning, but the healers won't permit anyone to see him until he's settled and the bleeding's stopped. I imagine we won't have to wait very long."},{"name":"TAHLAMOLKOH","text":"It seems he's finally fit to speak."},{"name":"TAHLAMOLKOH","text":"I don't expect you to be grateful, but I'd like to remind you you likely wouldn't be standing here if we hadn't found you in that cave. Now start talking. What were you doing out there at Bittermill?"},{"name":"EMPIRESOLDIER02663","text":"We...we were looking for someone. An escapee from one of our facilities. He'd lost his memory and was otherwise mentally unstable, so we knew he couldn't have gone far."},{"name":"TAHLAMOLKOH","text":"I believe the man you're speaking of is already in our custody. We found him seeking shelter in Bittermill. He claims you captured him, though he cannot recall where."},{"name":"EMPIRESOLDIER02663","text":"So he returned to Bittermill after all. I guess the past came back to haunt him, even if he can't remember it."},{"name":"TAHLAMOLKOH","text":"Listen─my superiors are not like to show you any leniency. If you tell me everything you know, I will do all within my power to see your life is spared. Do we have a deal?"},{"name":"EMPIRESOLDIER02663","text":"Miss, I may be dressed in their uniform, but you'd be mistaken to believe I owe the Garleans any allegiance. I will gladly tell you."},{"name":"EMPIRESOLDIER02663","text":"Twenty years ago, a group of prisoners was relocated to Bittermill to assist in the Garleans' more unorthodox experiments."},{"name":"EMPIRESOLDIER02663","text":"They wanted to create a new chemical weapon, one that would leave buildings untouched while killing any and everyone it came into contact with. Black Rose, I believe it was called."},{"name":"TAHLAMOLKOH","text":"That's...that's horrible..."},{"name":"EMPIRESOLDIER02663","text":"Their intention was to drive back Eorzean forces without wasting any of their own on the front lines."},{"name":"EMPIRESOLDIER02663","text":"Of course, they wouldn't know if it really worked without willing volunteers. And what better place than a village long since abandoned by its people."},{"name":"EMPIRESOLDIER02663","text":"Not a single prisoner survived. Their tests proving a resounding success, it was only a matter of time before Black Rose would be deployed. Or so they thought."},{"name":"EMPIRESOLDIER02663","text":"To the surprise of many, the project was shut down before Black Rose could ever be used. The order came from the legatus of the XIVth Imperial Legion, and interim leader of the Ala Mhigan province, Gaius van Baelsar."},{"name":"EMPIRESOLDIER02663","text":"The Black Wolf would not allow the senseless murdering of Eorzea's people. He saw them as future subjects of the Empire to be ruled, not savages to be slaughtered."},{"name":"EMPIRESOLDIER02663","text":"Everything was to be destroyed, but the man behind the project would not see his work wasted, and ran off with the last remaining samples of Black Rose."},{"name":"EMPIRESOLDIER02663","text":"He was promptly apprehended, but he'd already hidden away his work. They used every heinous tool at their disposal to make him talk, yet he would not─or rather, <span class=\"emphasis\">could not</span>─tell them where he hid it."},{"name":"EMPIRESOLDIER02663","text":"The doctor had already gone mad, and couldn't remember a thing. I can only assume one of his experiments went wrong and ruined his mind in the process."},{"name":"TAHLAMOLKOH","text":"Then that means... The man we found earlier..."},{"name":"EMPIRESOLDIER02663","text":"Aye, that's him. Grillairmais, former head of research for the XIVth Imperial Legion."},{"name":"TAHLAMOLKOH","text":"Would you mind waiting here with me? I'm certain the healers will have him up and walking about soon."},{"name":"TAHLAMOLKOH","text":"I can't believe that incoherent mess of a man was a scientist in service to the Garleans."},{"name":"TAHLAMOLKOH","text":"I think we've heard enough. Thank you for your cooperation."},{"name":"TAHLAMOLKOH","text":"What do you think, <span class=\"highlight\">Forename</span>? A part of me wants to believe it isn't true, but I see no reason why he would lie to us. There has to be some way to substantiate his story."},{"name":"TAHLAMOLKOH","text":"If the entirety of Bittermill was used for their experiments, it would be no easy feat to do away with the evidence of such a massive operation."},{"name":"TAHLAMOLKOH","text":"No, there would have to be some lingering traces of their work. And if they couldn't dispose of it, their only option would be...to bury it! <span class=\"highlight\">Forename</span>, we have to go back to Bittermill."},{"name":"EMPIRESOLDIER02663","text":"My orders were to recapture Grillairmais and destroy whatever evidence remained of his work in Bittermill. We failed to find anything, but it's there. You can't kill that many people and leave nothing behind."},{"name":"TAHLAMOLKOH","text":"Alright, let's split up. There has to be something here, and I'm not leaving until we find it."},{"name":"SYSTEM","text":"There is nothing buried here."},{"name":"SYSTEM","text":"Your digging reveals a small, metal container, though you probably shouldn't touch it. Lieutenant Molkoh will want to know what you've found."},{"name":"TAHLAMOLKOH","text":"I don't doubt what the man said, but the thought of all those people dying on this very ground is revolting. A part of me hopes we don't find anything."},{"name":"TAHLAMOLKOH","text":"You've found something?"},{"name":"TAHLAMOLKOH","text":"A metal container? Could it be...the missing sample of Black Rose?"},{"name":"TAHLAMOLKOH","text":"So he was telling the truth after all..."},{"name":"TAHLAMOLKOH","text":"Ahem. There's no time to be sentimental, nor hasty. Any mishaps in handling that container could prove disastrous. Let's report back to Serpent Marshal Brookstone."},{"name":"TAHLAMOLKOH","text":"Lieutenant Molkoh reporting, sir."},{"name":"TAHLAMOLKOH","text":"We've discovered the identity of the man we thought to be one of the missing prisoners. He is Grillairmais, former chief of research for the XIVth Imperial Legion, who oversaw the manufacturing of a chemical weapon known as Black Rose."},{"name":"TAHLAMOLKOH","text":"After a thorough survey of Bittermill, we've discovered what we believe to be a sample of this weapon. We'd like to request assistance in retrieving it."},{"name":"SWETHRYKBROOKSTONE","text":"Attention. This is Brookstone. A container we believe to contain a Garlean chemical weapon has been discovered at Bittermill. I need you to get out there and retrieve it immediately."},{"name":"TAHLAMOLKOH","text":"As for the missing prisoners... They were used as test subjects for Black Rose. There were no survivors."},{"name":"TAHLAMOLKOH","text":"Sir, I don't believe we should allow the risk of such a weapon falling into the wrong hands."},{"name":"SWETHRYKBROOKSTONE","text":"I agree, Lieutenant. After the weapon has been safely moved to a secure location, rest assured we will see to its disposal."},{"name":"SWETHRYKBROOKSTONE","text":"As for Grillairmais, his fate resides with the council. Considering the weight of his crimes, his punishment will be quite severe."},{"name":"TAHLAMOLKOH","text":"I almost pity the man, but memories or no, his crimes cannot be excused."},{"name":"SWETHRYKBROOKSTONE","text":"Lieutenant Molkoh, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>, you've done well today, and I'm sure you're both quite tired. Go and rest. You've earned it."},{"name":"TAHLAMOLKOH","text":"Actually, I think I'll be heading back to Gridania to write up a report. The events of Bittermill need to be recorded, that we might prevent such atrocities from happening again."},{"name":"TAHLAMOLKOH","text":"I wish I could accompany you a while longer, but I'm sure the great Griffin's Bane is needed elsewhere."},{"name":"TAHLAMOLKOH","text":"Thank you again for all of your help. I look forward to adding your feats of daring to our records someday."}],"reward":{"gil":1000,"items":[{"id":18109,"one":1,"hq":1},{"id":18110,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"questsType":"all","quests":[68002,68199]}},"partials":[{"type":"npc","id":"1019519","obj":{"i":1019519,"n":"Serpent Marshal Brookstone","l":2406,"q":8}},{"type":"npc","id":"1023144","obj":{"i":1023144,"n":"Tahla Molkoh","l":2406,"q":2}},{"type":"npc","id":"1023156","obj":{"i":1023156,"n":"Wounded Imperial","l":2406,"q":1}},{"type":"npc","id":"1023157","obj":{"i":1023157,"n":"Tahla Molkoh","l":2406,"q":1}},{"type":"npc","id":"1023158","obj":{"i":1023158,"n":"Tahla Molkoh","l":2406,"q":1}},{"type":"item","id":"18109","obj":{"i":18109,"n":"Triphane Ring of Healing","l":255,"c":54410,"t":43,"p":15147}},{"type":"item","id":"18110","obj":{"i":18110,"n":"Triphane Ring of Casting","l":255,"c":54410,"t":43,"p":15147}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68002","obj":{"i":68002,"n":"Divide and Conquer","g":6,"l":"Rhalgr's Reach","s":210}},{"type":"quest","id":"68199","obj":{"i":68199,"n":"Seeking Answers","g":104,"l":"The Fringes","s":1050,"f":1}}]}