{"quest":{"name":"A Bleak Diagnosis","location":"Kugane","id":68207,"patch":4.0,"sort":1070,"eventIcon":71221,"issuer":1019048,"target":1019048,"involved":[1018982,1019002,1019030,1019065],"genre":107,"journal":["Yamabiko of Kugane has a simple job for a simple adventurer."],"objectives":["Relay Yamabiko's message.","Speak with Yamabiko."],"dialogue":[{"name":"YAMABIKO","text":"Good tidings to you <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>! I've a simple deed what needs doing, should you find yourself up to the task."},{"name":"YAMABIKO","text":"My porter has taken ill with an untreatable malady, and now of all times. I've just had a ship come in brimming with cargo to be hauled, and nary a soul to haul it. I'd see to it myself, but I have my duties here."},{"name":"YAMABIKO","text":"My clients have grown accustomed to having their cargo delivered to them, but I fear I will have to ask them to come and retrieve this shipment for themselves. There are four to whom I must see that message relayed."},{"name":"YAMABIKO","text":"Kotokaze of the Shiokaze Hostelry, Karaku of the Bokaisen Hot Springs, Miyamagi of the Sekiseigumi Barracks, and Yamabuki of Kogane Dori. See my word to them, and I will reward you for your efforts."},{"name":"YAMABIKO","text":"There are four clients to whom my message must be related. Kotokaze of the Shiokaze Hostelry, Karaku of the Bokaisen Hot Springs, Miyamagi of the Sekiseigumi Barracks, and Yamabuki of Kogane Dori."},{"name":"KOTOKAZE","text":"You don't look to be here as a customer. What is it I can do you for?"},{"name":"KOTOKAZE","text":"Untreatable? Well, that is truly tragic. Thank you for bringing me word. Tell Yamabiko I will send one of the Hostelry staff to retrieve our cargo in due time."},{"name":"KOTOKAZE","text":"The fine rice wines we order from the cellars of Koshu are popular fare among our patrons. It is no bother at all to expend a little extra effort for so valuable a prize."},{"name":"KOTOKAZE","text":"The fine rice wines we order from the cellars of Koshu are popular fare among our patrons. It is no bother at all to expend a little extra effort for so valuable a prize. Tell Yamabiko I will send one of the Hostelry staff to retrieve our cargo in due time."},{"name":"KARAKU","text":"Come for a soak? No? Well, what can I help you with, then?"},{"name":"KARAKU","text":"Yamabiko's porter has taken ill? And can't be treated? I'm saddened to hear it. And yes, of course, I'll make arrangements to pick up my cargo."},{"name":"KARAKU","text":"The Shishu rice grown on the islands of Kugane is by no means bad, but it cannot compare to the exquisite grains of Koshu. I pay no small sum of gil to keep my stores stocked with it."},{"name":"KARAKU","text":"It is part of the reason so many visitors are happy to lodge at our springs again and again. For something so important, I am more than happy to make a trip to the port. Tell Yamabiko I will be there as soon as I am able."},{"name":"KARAKU","text":"The exquisite rice of Koshu is part of the reason so many visitors are happy to lodge at our springs again and again. For something so important, I am more than happy to make a trip to the port. Tell Yamabiko I will be there as soon as I am able."},{"name":"MIYAMAGI","text":"I've been awaiting you. You are here on behalf of Yamabiko, are you not?"},{"name":"MIYAMAGI","text":"I heard it told his porter took ill with a chronic ailment. A true pity, that. I thought the delivery late, but for such circumstances, lateness can be forgiven."},{"name":"MIYAMAGI","text":"It would seem the supplies and succor sent by the bakufu in Bukyo have arrived. Inform Yamabiko that we will be to the port to retrieve them forthwith."},{"name":"MIYAMAGI","text":"It would seem the supplies and succor sent by the bakufu in Bukyo have arrived. Inform Yamabiko that we will be to the port to retrieve them forthwith."},{"name":"YAMABUKI","text":"Yes? Have you some business with me?"},{"name":"YAMABUKI","text":"Incurable? I cannot imagine the burden of bearing an ailment for life. Very well, I will make my way to the port to pick up my cargo. Tell Yamabiko to expect me."},{"name":"YAMABUKI","text":"There are rare natural remedies the likes of which can only be found in Koshu. Without a stock of them, the mercantile trade in Radz-at-Han would be up in arms. The alchemists there are among the finest in the world, and have an unmatched penchant for quality."},{"name":"YAMABUKI","text":"There are rare natural remedies the likes of which can only be found in Koshu. Without a stock of them, the mercantile trade in Radz-at-Han would be up in arms. The alchemists there are among the finest in the world, and have an unmatched penchant for quality."},{"name":"YAMABIKO","text":"You have certainly done me a service, my friend. With this, the vessel I commissioned to sail all the way from Koshu has proven itself most fruitful. And now I can begin preparations for my next business endeavor."},{"name":"YAMABIKO","text":"You will find ships from a myriad of nations moored at docks in this port. But there are ships belonging to merchants of <span class=\"emphasis\">this</span> nation, like myself. Hingashi is a nation of islands, and so the sea routes are as roads and highways to us."},{"name":"YAMABIKO","text":"The porter? Oh no, you needn't waste any worry on his account. His affliction was a farce. Every now and then he simply requires a chastising hand to rally him back to work."},{"name":"YAMABIKO","text":"No matter how many times I might dispense such chastisement, he soon forgets and is back to his lazy ways. I find telling my clients my latest porter has been stricken by an incurable disease the most effective way to garner patience and cooperation."},{"name":"YAMABIKO","text":"Fear not, the strikes of my hand are born of the heart, not of hate. I wouldn't suffer anyone else to do it. It is all part of the job, and now I must be back to that job. I bid you good day!"}],"reward":{"gil":556,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"quests":[68011]}},"partials":[{"type":"npc","id":"1019048","obj":{"i":1019048,"n":"Yamabiko","l":2404,"q":1}},{"type":"npc","id":"1018982","obj":{"i":1018982,"n":"Karaku","l":2404,"q":4}},{"type":"npc","id":"1019002","obj":{"i":1019002,"n":"Kotokaze","l":2404,"q":5}},{"type":"npc","id":"1019030","obj":{"i":1019030,"n":"Miyamagi","l":2404,"q":1}},{"type":"npc","id":"1019065","obj":{"i":1019065,"n":"Yamabuki","l":2404,"q":2}},{"type":"quest","id":"68011","obj":{"i":68011,"n":"Making the Catfish Sing","g":6,"l":"Kugane","s":300}}]}