{"quest":{"name":"The Solace of the Sea","location":"The Ruby Sea","id":68217,"patch":4.0,"sort":353,"eventIcon":71201,"issuer":1021517,"target":1021517,"involved":[1021513,1022959],"genre":6,"journal":["Afumi has no patience for seasick pirates."],"objectives":["Speak with Aokumo.","Give the medicine to the seasick Doman recruit.","Speak with Afumi."],"dialogue":[{"name":"AFUMI","text":"Kami take me! What kind of pirate cannot suffer the sway of the ocean!?"},{"name":"AFUMI","text":"Hm? A new recruit from far-flung shores? Listen well─I have a task for you."},{"name":"AFUMI","text":"Go first to Aokumo below and receive of him medicine for men of the earth."},{"name":"AFUMI","text":"Then to Quickscape Pier and the hapless Doman bemoaning his wretched fate. Quickly!"},{"name":"AFUMI","text":"The wind carries his cries to my ears, and I can stand them no longer. Bring the would-be pirate his medicine!"},{"name":"AOKUMO","text":"Come at the behest of Afumi for medicine? My very best is yours for the taking."},{"name":"AOKUMO","text":"How pitiful the lot of this Doman unable to stomach the sea. A true Confederate could raid a dozen ships while in his cups. Mayhap this one should return whence he came."},{"name":"AOKUMO","text":"I have done my part, and you have your medicine. If you tarry, Afumi will hold only you accountable."},{"name":"SEASICKNESSMAN2681","text":"Uuugh... Why does it shift and shudder still..."},{"name":"SEASICKNESSMAN2681","text":"Medicines!? Give them here! They may look down on me for resorting to such measures, but I would do aught to render the world stable and motionless once more."},{"name":"SEASICKNESSMAN2681","text":"You are kind, as is Afumi. You may tell her that I will return to my duties as soon as I am able."},{"name":"SEASICKNESSMAN2681","text":"I will not soon forget this kindness. Thank you, my friend, thank you."},{"name":"AFUMI","text":"...The Doman was raised in the mountains of his homeland. The first time he saw the sea was after he fled his homeland and came to us."},{"name":"AFUMI","text":"He tosses and turns in his sleep, and when he takes to the water, it is not long before he can no longer stand."},{"name":"AFUMI","text":"But he will grow accustomed to this life. He is hardly the first, after all. The captain too was once of Doma, though he cast all aside twenty and five years ago, when the imperials took his lands and the lives of his parents and brothers."},{"name":"AFUMI","text":"Perhaps you too will renounce your ties and join us someday? Aye, I mistook you for a recruit before, but I know your tale now. Tansui unfolded all."},{"name":"AFUMI","text":"Think on my offer, Westerner. You may find small joys in the land, but the sea holds salvation."}],"reward":{"gil":629,"xp":183600},"reqs":{"jobs":[{"lvl":62,"id":142}],"quests":[68016]},"next":[68017]},"partials":[{"type":"npc","id":"1021517","obj":{"i":1021517,"n":"Afumi","l":2409,"q":1}},{"type":"npc","id":"1021513","obj":{"i":1021513,"n":"Aokumo","l":2409,"q":1}},{"type":"npc","id":"1022959","obj":{"i":1022959,"n":"Seasick Doman Recruit","l":2409,"q":1}},{"type":"quest","id":"68016","obj":{"i":68016,"n":"Confederate Consternation","g":6,"l":"The Ruby Sea","s":350}},{"type":"quest","id":"68017","obj":{"i":68017,"n":"Alisaie's Stones","g":6,"l":"The Ruby Sea","s":360}}]}