{"quest":{"name":"The Last Voyage","location":"The Ruby Sea","id":68215,"patch":4.0,"sort":357,"eventIcon":71201,"issuer":1021509,"target":1021509,"involved":[1022401],"genre":6,"journal":["Aranami is not a man accustomed to being kept waiting."],"objectives":["Search for the missing Confederate recruit.","Speak with the Confederate recruit.","Speak with Aranami."],"dialogue":[{"name":"ARANAMI","text":"You there─aye, you. Have you seen a bumbling clod of an Au Ra? A new recruit I ordered to patrol the northern edge of Onokoro. He is late in returning."},{"name":"ARANAMI","text":"A strange boy he was, quiet and brooding. Reluctant to speak unless spoken to first. Better that than a fool who never holds his tongue, perhaps."},{"name":"ARANAMI","text":"Much as I would enjoy dragging him back by the ear, I cannot. Duty compels me to remain. You, on the other hand, have no such obligations..."},{"name":"ARANAMI","text":"I sent the boy to patrol the region northwest of Heaven–on–High. If he is not there, then I know not where else he could be..."},{"name":"SYSTEM","text":"You cast about for the Confederate recruit, and at last spy a young Auri man lurking behind the rocks to the west..."},{"name":"SYSTEM","text":"You cast about for the Confederate recruit, but see no one matching his description."},{"name":"ARANAMI","text":"If you find my recruit, tell him to return to me at once. I have no shortage of tasks for him."},{"name":"NEWCOMER02679","text":"Who...who are you? You do not look like a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of the Confederacy."},{"name":"NEWCOMER02679","text":"...Forgive me. 'Twas but yesterday we bid farewell to one of our own, and I worried that she might have lost her way."},{"name":"NEWCOMER02679","text":"We laid her to rest in a boat and pushed her out till the current claimed it. For the sea is our home, now and ever after."},{"name":"NEWCOMER02679","text":"But those sent thither with burdened hearts may drift back to shore, it is said..."},{"name":"NEWCOMER02679","text":"Out of concern for her comrades, she strove to earn far more than her keep. She hunted rare and deadly game in treacherous waters, and lost her life for it."},{"name":"NEWCOMER02679","text":"But my vigil is ended─her vessel has not returned to Onokoro! She has made peace with this life and placed her faith in us to live on..."},{"name":"ARANAMI","text":"So, what of my recruit? Did you find him napping on the beach or some such?"},{"name":"ARANAMI","text":"What? All this time he was standing watch for the funerary vessel? Huh..."},{"name":"ARANAMI","text":"So rarely does he give voice to his thoughts. I had no idea our comrade's death had affected him so. Too quick was I to judge him."},{"name":"ARANAMI","text":"It is good that you went in my stead, else I might have misspoken and made a fool of myself. Please accept this as a token of my gratitude."}],"reward":{"gil":662,"xp":183600},"reqs":{"jobs":[{"lvl":62,"id":142}],"quests":[68016]},"next":[68017]},"partials":[{"type":"npc","id":"1021509","obj":{"i":1021509,"n":"Aranami","l":2409,"q":2}},{"type":"npc","id":"1022401","obj":{"i":1022401,"n":"Confederate Recruit","l":2409,"q":1}},{"type":"quest","id":"68016","obj":{"i":68016,"n":"Confederate Consternation","g":6,"l":"The Ruby Sea","s":350}},{"type":"quest","id":"68017","obj":{"i":68017,"n":"Alisaie's Stones","g":6,"l":"The Ruby Sea","s":360}}]}