{"quest":{"name":"Ethereal Lights","location":"The Ruby Sea","id":68213,"patch":4.0,"sort":2050,"eventIcon":71221,"issuer":1019156,"target":1019156,"genre":108,"journal":["Hayama appears to be deeply engrossed in surveying the seas."],"objectives":["Survey the designated spots and slay the ominous onibi.","Speak with Hayama."],"dialogue":[{"name":"HAYAMA","text":"Kami above! Y-You can't just sneak up on someone like that! Now, what is it you need? If you do not require anything, I ask that you kindly allow me to return to watch du─"},{"name":"HAYAMA","text":"Ah─at second glance, you appear to be far stronger than the average <span class=\"alternative-container\"><span class=\"alternative\">Hyur</span><span class=\"alternative\">Elezen</span><span class=\"alternative\">Lalafell</span><span class=\"alternative\">Miqo'te</span><span class=\"alternative\">Roegadyn</span><span class=\"alternative\">Au Ra</span><span class=\"alternative\">Hrothgar</span><span class=\"alternative\">Viera</span></span>. Perhaps there is something you can help me with. Lately we've been seeing eerie flashing lights along the eastern coast of Sakazuki."},{"name":"HAYAMA","text":"I-It is probably just the ships passing though this area but some of the men here are convinced it is an onibi. They are terrified. Would you go and have a look for us?"},{"name":"HAYAMA","text":"The lights were last spotted to the northwest of here. If it turns out to be an onibi, after all, please see that it is dispatched. I-I would go and take care of it myself, of course, but I simply cannot leave my post here."},{"name":"HAYAMA","text":"To the northwest of here is where the lights were last spotted. Please go there and, if there truly is an onibi, see that it is dispatched."},{"name":"SYSTEM","text":"Try as you might, you do not spot any ominous onibi."},{"name":"HAYAMA","text":"So you mean to say there was no onibi─only tiny little fire sprites?"},{"name":"HAYAMA","text":"Hahahaha! I cannot wait to reveal the news to the others. They will feel so foolish for being frightened!"},{"name":"HAYAMA","text":"A reward, you say? Is the act of doing a kind deed for a fellow man not reward enough? Hahaha! I am just joking, of course. Here you go! "}],"reward":{"gil":629,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"questsType":"all","quests":[68014,68209]}},"partials":[{"type":"npc","id":"1019156","obj":{"i":1019156,"n":"Hayama","l":2409,"q":2}},{"type":"quest","id":"68014","obj":{"i":68014,"n":"Boys with Boats","g":6,"l":"The Ruby Sea","s":330}},{"type":"quest","id":"68209","obj":{"i":68209,"n":"The Price of Betrayal","g":108,"l":"The Ruby Sea","s":2030,"f":1}}]}