{"quest":{"name":"Protector of the Small","location":"The Ruby Sea","id":68214,"patch":4.0,"sort":2060,"eventIcon":71221,"issuer":1019156,"target":1022747,"involved":[1022746],"genre":108,"journal":["Hayama anxiously surveys the seas."],"objectives":["Look for the pirate boy.","Speak with the pirate boy.","Speak with the guardian pirate."],"dialogue":[{"name":"HAYAMA","text":"You! Yes, you! Come here. I need to speak with you."},{"name":"HAYAMA","text":"I was surveying these waters just now and spied a young pirate boy being attacked by sea monsters. While he made it back to the coast of Sakazuki, they have followed him. I fear he will not last for long without help."},{"name":"HAYAMA","text":"I know what you are thinking. He is a pirate, so why should I care? Indeed, normally I would not. He is, however, a boy before a pirate and I cannot in good conscience turn a blind eye to a child in danger."},{"name":"HAYAMA","text":"In informing you of his plight, however, I have already done my part. Whether the boy lives or not is now up to you."},{"name":"HAYAMA","text":"There is need to report back to me on whether the child survives or not. In informing you of his plight, I have already done my part."},{"name":"LITTLEPIRATES","text":"What's the big idea!? Who said you could kill my monsters? Now how am I supposed to prove to everyone I am a full-fledged pirate!?"},{"name":"LITTLEPIRATES","text":"Don't you get it? I was not being chased, rather I was attempting to lure them into this trap. As soon as they got close to these firecrackers─BAM! They were as good as dead."},{"name":"LITTLEPIRATES","text":"Now because of you, I have to start all over again! &lt;sigh&gt; Could you at least go and tell the pirate watching me from up there that I will be late to return?"},{"name":"PIRATES","text":"Aye, friend. I saw everything─you rescued our boy. Thank you for that."},{"name":"PIRATES","text":"You were sent at the behest of a Ruby Price soldier? Well, isn't that something. Such a compassionate gesture must be repaid in kind."},{"name":"PIRATES","text":"I will find a way to send him a token of our gratitude. And, of course, we must give you something for your help, as well."},{"name":"PIRATES","text":"The boy is still learning and tends to bite off more than he can chew. Earlier he baited far too many beasts to handle alone. Had you not been there, he would have severely injured himself."}],"reward":{"gil":629,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"questsType":"all","quests":[68014,68212]}},"partials":[{"type":"npc","id":"1019156","obj":{"i":1019156,"n":"Hayama","l":2409,"q":2}},{"type":"npc","id":"1022747","obj":{"i":1022747,"n":"Guardian Pirate","l":2409,"q":1}},{"type":"npc","id":"1022746","obj":{"i":1022746,"n":"Pirate Boy","l":2409,"q":1}},{"type":"quest","id":"68014","obj":{"i":68014,"n":"Boys with Boats","g":6,"l":"The Ruby Sea","s":330}},{"type":"quest","id":"68212","obj":{"i":68212,"n":"First Line of Defense","g":108,"l":"The Ruby Sea","s":2040}}]}