{"quest":{"name":"In Cold Blood","location":"The Ruby Sea","id":68219,"patch":4.0,"sort":2110,"eventIcon":71221,"issuer":1021520,"target":1021520,"involved":[1022750,1022751,1022752,1022753],"genre":108,"journal":["Hayase is scrutinizing the area."],"objectives":["Patrol the area for suspicious activity.","Report to Hayase."],"dialogue":[{"name":"HAYASE","text":"You there! Show me your─ah...never mind. You appear strong but do not look vicious enough to commit such an atrocious crime."},{"name":"HAYASE","text":"&lt;sigh&gt; You see, the other day we found the dead body of one of our comrades."},{"name":"HAYASE","text":"He died of a knife wound to the back and through the chest. Poor bastard. No one turns their back on an enemy, so more likely than not, he was killed by a friend."},{"name":"HAYASE","text":"We need to prevent any further casualties, and I ask that you assist us. Please patrol the more secluded areas of our island and save anyone who looks like they might be in danger."},{"name":"HAYASE","text":"Please patrol the island for any suspicious activity and save anyone who appears to be in harm's way."},{"name":"PATROL02683","text":"Hayase requested that you survey the island for suspicious activity? I can't say I have noticed anything out of the ordinary, but I will definitely keep my eyes peeled. Thanks for the warning."},{"name":"PATROL02683","text":"I have not noticed anything unusual but I will keep my eyes and ears peeled."},{"name":"SHELLFISH02683","text":"You are looking for a murderer? Ah, well, I am looking for clams. Good for you and sadly for me, I have spotted neither."},{"name":"SHELLFISH02683","text":"Nope, no murderers...&lt;sigh&gt;...and most definitely no clams around here."},{"name":"TRAINING02683","text":"Nothing suspicious here, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Now, if there is nothing else, I really must return to training!"},{"name":"TRAINING02683","text":"My apologies, but you are breaking my concentration. If there is nothing else of import, please allow me to carry on with my training."},{"name":"WOUNDED02683","text":"Thank the kami you arrived when you did. You saved my life. &lt;sigh&gt; I was tricked into coming here by a man who claimed to be a fisherman. He said he had a job opportunity for me, but I should have known better."},{"name":"WOUNDED02683","text":"I must return and have my wounds looked at. You best leave this place, too. There might be others lurking about in the shadows."},{"name":"HAYASE","text":"Ah, you have returned. Thank you for surveying the island and saving one of our comrades from certain death."},{"name":"HAYASE","text":"We did a bit of investigating and discovered that the alleged fisherman's victims have one thing in common."},{"name":"HAYASE","text":"The two of them once stopped a ship full of ronin seeking passage through the Ruby Sea. Upon demanding that they pay the Ruby Tithe, the nomad samurai drew their swords and all hells broke loose. A great deal of blood was shed that day."},{"name":"HAYASE","text":"By the sound of it, these men had come to avenge the deaths of their compatriots. It doesn't surprise me. Most ronin are no better than your average criminal."},{"name":"HAYASE","text":"Sadly, this incident cost us a good man. Thanks to you, however, we were able to prevent any more casualties. Please accept this gift as a token of our appreciation."}],"reward":{"gil":562,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68017]}},"partials":[{"type":"npc","id":"1021520","obj":{"i":1021520,"n":"Hayase","l":2409,"q":1}},{"type":"npc","id":"1022750","obj":{"i":1022750,"n":"Injured Confederate","l":2409,"q":1}},{"type":"npc","id":"1022751","obj":{"i":1022751,"n":"Sunbaked Confederate","l":2409,"q":1}},{"type":"npc","id":"1022752","obj":{"i":1022752,"n":"Focused Confederate","l":2409,"q":1}},{"type":"npc","id":"1022753","obj":{"i":1022753,"n":"Hulking Confederate","l":2409,"q":1}},{"type":"quest","id":"68017","obj":{"i":68017,"n":"Alisaie's Stones","g":6,"l":"The Ruby Sea","s":360}}]}