{"quest":{"name":"The Devil's Cough","location":"The Ruby Sea","id":68211,"patch":4.0,"sort":2010,"eventIcon":71221,"issuer":1019167,"target":1019167,"genre":108,"journal":["Hiun excitedly glances to and fro."],"objectives":["Obtain liquid hot magma from Hells' Lid.","Deliver the liquid hot magma to Hiun."],"dialogue":[{"name":"HIUN","text":"Damn! Did you see that!? The devil's clearing his throat again! Ah─it seems you are not familiar with the expression. That is what we say around here whenever Hells' Lid erupts."},{"name":"HIUN","text":"Now then, we best begin moving. There is precious little time! We must go and collect the hot magma before it starts to cool!"},{"name":"HIUN","text":"Before we go, though, let me give you a fair warning: if you can't handle a bit of heat or take down a few beasts, I advise you stay here. Few come back alive from these arduous excursions."},{"name":"HIUN","text":"Can I take your silence to mean you will be joining me? Good. Here, take this pot. Fill it with as much magma as you can and bring it back. It gets hot pretty fast, so take care not to burn yourself!"},{"name":"HIUN","text":"Put as much magma into the pot as you can, then bring it back. It gets hot really fast, so be sure not to burn yourself!"},{"name":"HIUN","text":"You are back, and without a scratch or burn on you. Impressive. Now, let's see how much magma you managed to bring back."},{"name":"HIUN","text":"Hoho! Your pot is nearly full! Well done, friend! You collected almost as much as I did and I am a veteran."},{"name":"HIUN","text":"Hm? You want to know what I will be using it for? A fair enough question."},{"name":"HIUN","text":"According to ancient legend, a sword forged with molten lava is capable of slaying man and demon alike. As such, this is what we use to make our blades. We pirates like to hedge all our bets. Out at sea, you never know what you'll be running into."},{"name":"HIUN","text":"Thank you for your help. You have saved me a trip here and back to that hellish place. Take this as a reward."}],"reward":{"gil":629,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68014]}},"partials":[{"type":"npc","id":"1019167","obj":{"i":1019167,"n":"Hiun","l":2409,"q":2}},{"type":"quest","id":"68014","obj":{"i":68014,"n":"Boys with Boats","g":6,"l":"The Ruby Sea","s":330}}]}