{"quest":{"name":"Our Most Venerated Ancestor","location":"The Ruby Sea","id":68227,"patch":4.0,"sort":2190,"eventIcon":71221,"issuer":1019184,"target":1019184,"involved":[1023252],"genre":108,"journal":["Tsuzura watches intently as her companion polishes a shell."],"objectives":["Search for Tsuzura's sister.","Obtain the cotton kerchiefs.","Deliver the cotton kerchiefs to Tsuzura's sister.","Speak with Tsuzura."],"dialogue":[{"name":"TUDURA","text":"You must be terribly bored if you have nothing better to do than stand there and watch us. How about I give you some work?"},{"name":"TUDURA","text":"My sister left to clean the cotton kerchiefs we use to polish our shells but she is slow to return."},{"name":"TUDURA","text":"Might you go and check the shores around the eastern cove to make sure nothing has happened to her?"},{"name":"TUDURA","text":"My sister went to wash our cotton kerchiefs but she does not return. Please check the area around the eastern cove to make sure no ill has befallen her."},{"name":"LITTLESISTER02691","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>, please. I do not mean to be rude, but I have not the time to entertain anyone right now. The kerchiefs I was sent to wash were swept away by a strong gust of wind, and I must retrieve them before they are lost forever!"},{"name":"LITTLESISTER02691","text":"Tsuzura sent you to look for me? &lt;sigh&gt; My sister has always been impatient. I must hurry. I do not want to be scolded again. Please, might you assist me in my search?"},{"name":"LITTLESISTER02691","text":"I will inspect the deep seas, so can you scour the coast? Let us meet back here once we are finished."},{"name":"LITTLESISTER02691","text":"How did your search go?"},{"name":"LITTLESISTER02691","text":"One... Two... Three... That should be everything! Thank the kami! Thank <span class=\"emphasis\">you</span>! Your keen eyes have spared my ears another long-winded lecture."},{"name":"LITTLESISTER02691","text":"I always come here to launder our kerchiefs because they become much softer when they are dried under the sun. "},{"name":"LITTLESISTER02691","text":"Unfortunately, they have gotten damp, so I will have to hang them out again. If you are returning to Tamamizu, please tell my sister I will be just a bit longer."},{"name":"TUDURA","text":"My sister lost the kerchiefs <span class=\"emphasis\">again</span>? &lt;sigh&gt; Thank you for helping her gather them."},{"name":"TUDURA","text":"Ah, you are staring again. You want to know whose shell we are polishing, I take it? This one once belonged to a venerated ancestor of ours, who was reckoned a sage among our people."},{"name":"TUDURA","text":"Upon his death, his soul took up residence in his shell. We hang it on the gate to our village that he might continue to keep us safe."},{"name":"TUDURA","text":"After watching over Tamamizu for a few centuries, his soul will eventually depart from this place, and he will be reborn as a kami."},{"name":"TUDURA","text":"To thank him for his years of dedicated service, we regularly take down and polish his shell."},{"name":"TUDURA","text":"For your help, we will ask that he also protect you. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>!"}],"reward":{"gil":695,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68019]}},"partials":[{"type":"npc","id":"1019184","obj":{"i":1019184,"n":"Tsuzura","l":2409,"q":1}},{"type":"npc","id":"1023252","obj":{"i":1023252,"n":"Tsuzura's Sister","l":2409,"q":1}},{"type":"quest","id":"68019","obj":{"i":68019,"n":"Of Kojin and Kami","g":6,"l":"The Ruby Sea","s":380}}]}