{"quest":{"name":"Pulling Double Booty","location":"The Ruby Sea","id":68223,"patch":4.0,"sort":2150,"icon":100698,"unlocksFunction":1,"eventIcon":71341,"issuer":1022102,"target":1022117,"involved":[1019049,1021755,1021756,1022103,1022104,1022122],"genre":108,"journal":["Hansaku is desperately searching for a charitable soul willing to lend him a hand.","A man by the name of Hansaku stops you to ask if you know anything of the East Aldenard Trading Company. When you inform him that you are acquaintances with their head of shop in Kugane, he begs you to meet with his superior, Tsukikage, who has been looking to establish a new trading partner. He then points you in the direction of Crick, where you can find him. If you are feeling generous, make your way there and speak with Tsukikage.","After brief introductions, Tsukikage divulges that the men he just took into his custody are claiming to be merchants with the East Aldenard Trading Company. He thinks they are lying to avoid paying the Ruby Tithe. For fear of incurring the wrath of a potential business partner, however, he would like to make absolutely certain before seeking retribution and requests your help with this endeavor. Asking that you take the flag he obtained from their ship along with a list of the items they found aboard the vessel, he would like for you to present it to one of the merchants in the Kugane branch office and inquire if any of it belongs to their organization.","You stop one of the East Aldenard Trading Company merchants and ask him if the scarlet flag or items on the inventory list belong to them. Sadly, he appears to know no more than you do and suggests you speak with one of the merchants in charge of cargo at Pier #1 named Kikimo. Head over there to see what you can learn from her.","Kikimo glances at the flag and list, and immediately tells you they do not belong to the East Aldenard Trading Company. She then goes on to lament the fact that you were the one to ask her. Had it been anyone else, she would have tried to swindle the goods out from under them by claiming the ship as one of their own. Right before you turn to go, she asks you to get in touch should the Confederacy be looking to sell any of what they confiscated. Tsukikage should be delighted to hear the news.","You return the items to Tsukikage and confirm what he suspected all along─that the men they apprehended were lying about their affiliation to the East Aldenard Trading Company. In spite of this, he remains in high spirits, much of which can be attributed to Kikimo's business proposal to find buyers for the Confederacy's goods. It seems things have finally started to look up for the pirates of Onokoro."],"objectives":["Speak with Tsukikage.","Show an East Aldenard Trading Company merchant in Kugane the scarlet flag and inventory list.","Show Kikimo the scarlet flag and inventory list.","Return the scarlet flag and inventory list to Tsukikage in Onokoro."],"dialogue":[{"name":"HANSAKU","text":"Your clothes, your manner─you must be a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of Eorzea!"},{"name":"HANSAKU","text":"Do you know of the East Aldenard Trading Company, then? I hear they're a fairly prosperous vendor where you are from."},{"name":"HANSAKU","text":"You're acquaintances with the Kugane branch office owner!? Oho! The chief's been searching high and low for a well-connected <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> such as yourself."},{"name":"HANSAKU","text":"Oh, but before we get into that, allow me to introduce myself. I am Hansaku. And you would be...?"},{"name":"HANSAKU","text":"<span class=\"highlight\">Forename</span>? That should be easy enough to remember. Now, <span class=\"highlight\">Forename</span> do me a favor and meet with the chief, would you?"},{"name":"HANSAKU","text":"Ever since those damned Garleans strengthened their grip on Hingashi, our contacts in Kugane have quit trading with us. He could really use your help in establishing a new business partner. "},{"name":"HANSAKU","text":"Please, I wouldn't ask if I wasn't desperate. You see, I only just joined the Confederacy. Life has been hard─really hard─for me lately, and if things were to fall apart here, I'd have nowhere to go..."},{"name":"HANSAKU","text":"To the west of this place is a tiny lodge. The chief should be there. Unfortunately I cannot leave my post to show you there, but I trust you'll find it easily enough. I'm counting on you, <span class=\"highlight\">Forename</span>!"},{"name":"HANSAKU","text":"If you have any trouble finding it, just ask around for Tsukikage─that's the chief's name."},{"name":"SUZUME","text":"As you can see, we are currently in the middle of something important. Come back later."},{"name":"FUNANORIOKO02687","text":"I swear to the gods you're going to regret doing this!"},{"name":"FUNANORI02687","text":"Instead of standing there and gawping, help me out of these ropes, godsdammit!"},{"name":"TSUKIKAGE","text":"Gentlemen, since you refuse to pay the Ruby Tithe with coin, you shall instead be paying with your blood. I believe an arm each will suffice."},{"name":"FUNANORIOKO02687","text":"W-Wait! We're with the East Aldenard Trading Company! I-I suggest you think twice about this. When word of this gets back, you'll be the ones to pay!"},{"name":"TSUKIKAGE","text":"Oh? You should have said so sooner. Suzume, see that our distinguished guests are escorted to our best room─in the dungeons. I shall go and sharpen my knives."},{"name":"SUZUME","text":"You heard the man."},{"name":"SUZUME","text":"Get up and start walking!"},{"name":"TSUKIKAGE","text":"I trust you stuck around this long because there was something you wished to discuss with me? Make it quick. As you can see, I am a very busy man."},{"name":"TSUKIKAGE","text":"So at last we are joined by someone actually associated with the East Aldenard Trading Company. Excellent."},{"name":"SUZUME","text":"The kami have thrown us a lifeline, sir! That said, what was the fool thinking? Hansaku should have had the courtesy to accompany our honored guest here! Please allow me to apologize on his behalf, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>...?"},{"name":"TSUKIKAGE","text":"Ah, it seems the ill manners of our subordinate have begun to rub off on us. We have not yet introduced ourselves. I am Tsukikage and this is my right hand, Suzume."},{"name":"TSUKIKAGE","text":"While it seems Hansaku has touched upon the gist of our troubles, please allow me to fill you in on the details."},{"name":"TSUKIKAGE","text":"As you know, all boats seeking safe passage through the Ruby Sea must pay our levy─the Ruby Tithe. Give us more than we ask, and we might even provide you with men to guide your ship through especially difficult waters."},{"name":"TSUKIKAGE","text":"For as far back as anyone can remember, this system has been in place, enduring even after Doma was occupied by the imperials. While the Empire has always shown little interest in our activities, with Yotsuyu's rise to power, that has changed."},{"name":"SUZUME","text":"The royal viceroy has banned the merchants of Kugane from bartering with us or paying our tolls. With those bakufu dogs backing her, everyone is far too terrified to disobey."},{"name":"TSUKIKAGE","text":"Many outside the port city are also looking to use the current state of affairs to avoid paying their dues─like the two we just took into custody. While we have confiscated their goods, without our contact in Kugane to purchase them, they are of little value to us."},{"name":"TSUKIKAGE","text":"Thus we look to Othard. If we were able to establish a trade agreement with their biggest vendor, our worries would be over. It is, however, something we cannot accomplish alone. I would look to you for help."},{"name":"TSUKIKAGE","text":"Now, I am quite certain the men on the ship we seized are lying about their affiliation."},{"name":"TSUKIKAGE","text":"Suzume, show <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"SUZUME","text":"This flag and the items we found aboard the vessel do not appear to belong to the East Aldenard Trading Company. We must, however, be certain. We cannot risk raising the ire of a potential trading partner by attempting to sell them their own goods."},{"name":"TSUKIKAGE","text":"Please, take the flag and Suzume's inventory list to one of your contacts at their Kugane branch and inquire as to whether any of it is from one of their ships."},{"name":"TSUKIKAGE","text":"The flag should be enough, but you best also show them that list."},{"name":"SUZUME","text":"We manage the entirety of the Confederacy's finances, which includes both monetary funds and assets. What you hold in your hands is a list of property we seized from the ship. Do not lose it. It may look easy to draft, but unless you have the eye for detail that I do, you'll find it a real chore."},{"name":"SHOUNIN02687","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. What a pleasure it is to see you. How might I be of service to you today?"},{"name":"SHOUNIN02687","text":"You would like to know if this flag, or any of the items listed here came from one of our ships?"},{"name":"SHOUNIN02687","text":"I am afraid I cannot help you there. Kikimo, however, might be able to tell you. She is in charge of inventory and is currently stocking our ships at Pier #1."},{"name":"SHOUNIN02687","text":"You best ask Kikimo, as she is charged with keeping track of the cargo that is loaded and taken off the ships. You should be able to find her at Pier #1."},{"name":"KIKIMO","text":"Hm? And who might you be? Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? I have heard a great deal about you. Very well. I shall take a look at your flag and list."},{"name":"KIKIMO","text":"...None of these items are even remotely familiar. It is as you suspected. You have been lied to."},{"name":"KIKIMO","text":"&lt;sigh&gt; 'Tis a shame you were the one to ask. Had it been anyone else, it would have been an easy thing to claim the ship and its goods as our own."},{"name":"KIKIMO","text":"Many of the items listed here are worth their weight in gold and then some. With this, those men could have easily paid the tithe several times over..."},{"name":"KIKIMO","text":"Such luxurious items can be rather hard to come by, so do let me know if your friends are looking to sell any of this. We would be more than happy to find a buyer for them."},{"name":"KIKIMO","text":"To think that you even have contacts within the ranks of the Confederacy─you are just as they say: a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of many parts."},{"name":"SUZUME","text":"You have made it safely back. I hope your trip to Kugane proved fruitful?"},{"name":"TSUKIKAGE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, you are returned. Very good. Now if you would be so kind as to give the flag and list back to me."},{"name":"TSUKIKAGE","text":"Hm. It was as we suspected, then. In light of Mistress Kikimo's proposal, however, not even their evident guilt can sour my mood."},{"name":"SUZUME","text":"Indeed! This is fantastic news, sir. It is everything we had hoped for and more!"},{"name":"TSUKIKAGE","text":"While certainly promising, we are not yet out of the woods. <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, I trust we can rely on your continued support? I have a feeling we will be needing it. "}],"reward":{"gil":1100,"aetherCurrent":1,"items":[{"id":18247,"one":1,"hq":1},{"id":18248,"one":1,"hq":1},{"id":18249,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68017]},"next":[68224]},"partials":[{"type":"npc","id":"1022102","obj":{"i":1022102,"n":"Hansaku","l":2409,"q":1}},{"type":"npc","id":"1022117","obj":{"i":1022117,"n":"Tsukikage","l":2409,"q":2}},{"type":"npc","id":"1019049","obj":{"i":1019049,"n":"Kikimo","l":2404,"q":3}},{"type":"npc","id":"1021755","obj":{"i":1021755,"n":"Enraged Merchant","l":2409,"q":1}},{"type":"npc","id":"1021756","obj":{"i":1021756,"n":"Panicked Merchant","l":2409,"q":1}},{"type":"npc","id":"1022103","obj":{"i":1022103,"n":"Tsukikage","l":2409,"q":1}},{"type":"npc","id":"1022104","obj":{"i":1022104,"n":"Suzume","l":2409,"q":2}},{"type":"npc","id":"1022122","obj":{"i":1022122,"n":"East Aldenard Trading Company Merchant","l":2404,"q":1}},{"type":"item","id":"18247","obj":{"i":18247,"n":"Koppranickel Earrings of Fending","l":265,"c":55398,"t":41,"p":15741}},{"type":"item","id":"18248","obj":{"i":18248,"n":"Koppranickel Earrings of Slaying","l":265,"c":55398,"t":41,"p":15741}},{"type":"item","id":"18249","obj":{"i":18249,"n":"Koppranickel Earrings of Aiming","l":265,"c":55398,"t":41,"p":15741}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68017","obj":{"i":68017,"n":"Alisaie's Stones","g":6,"l":"The Ruby Sea","s":360}},{"type":"quest","id":"68224","obj":{"i":68224,"n":"Unfinished Business","g":108,"l":"The Ruby Sea","s":2160}}]}