{"quest":{"name":"Fight or Flight","location":"The Ruby Sea","id":68222,"patch":4.0,"sort":2140,"eventIcon":71221,"issuer":1021509,"target":1021509,"involved":[1019248,1022402],"genre":108,"journal":["Aranami requires the assistance of an intimidating <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>."],"objectives":["Speak with Umibeta.","Take a /battlestance against the watchguard.","Report to Umibeta.","Report to Aranami."],"dialogue":[{"name":"ARANAMI","text":"Come here. I need you to do something for us. While it is by no means an exciting task, it is one of the more important things you could help us with."},{"name":"ARANAMI","text":"My comrade Umibeta will explain everything to you. Please go find him. He should be at the Coral Banquet."},{"name":"ARANAMI","text":"Head over to the Coral Banquet and speak with Umibeta. He will fill you in on the details."},{"name":"UMIBETA","text":"Aranami sent you? Well, it's about time."},{"name":"UMIBETA","text":"One of my men has been derelict in his duties. He has been allowing vessels to pass through the Ruby Sea free of charge. We suspect he is either a coward that is afraid of crossing swords with another...or he is taking bribes."},{"name":"UMIBETA","text":"We shall find out soon enough. You are to pose as a foreign merchant and approach the watchguard I speak of, who is stationed in the Shoal Rock area to the southeast of here, and threaten him."},{"name":"UMIBETA","text":"You are under no circumstances to harm him, however. Simply take a <span class=\"highlight\">Battle Stance</span>. I suspect that should be enough to elicit a reaction from him."},{"name":"UMIBETA","text":"We need for you to go to the Shoal Rock area to the southeast of here. Approach our watchguard, then take a <span class=\"highlight\">Battle Stance</span> and observe his reaction."},{"name":"ARANAMI","text":"I presume Umibeta has informed you of all you need to know? Good. We are counting on you."},{"name":"WATCHMAN02686","text":"All clear over here! Huh? As you can see, I am rather busy at the moment. If there is something you need, come ask me later."},{"name":"WATCHMAN02686","text":"Y-You want a fight? Th-Then, it is a fight you will get!"},{"name":"WATCHMAN02686","text":"&lt;sigh&gt; I have not the time to deal with you or your silly antics! Begone from my sight!"},{"name":"UMIBETA","text":"So tell me, what did our watchguard do when you pretended to attack him?"},{"name":"UMIBETA","text":"He scuttled off, shouting for reinforcements? Excellent."},{"name":"UMIBETA","text":"Ah, you must be confused. There is something I must confess. The real reason I asked you to confront him was not because he was being lax in his duties, but rather to test him."},{"name":"UMIBETA","text":"Whenever there is threat of an attack upon the Coral Banquet, our men stationed there are trained to drop everything and dash to the headquarters to call for reinforcements. We needed to ensure he would follow protocol."},{"name":"UMIBETA","text":"Had I told you the truth from the beginning, you would have held back and not come across nearly as menacing as you did. Haha! Thank you for your help. When you return to Aranami, please inform him that the recruit passed the test."},{"name":"UMIBETA","text":"I must apologize for lying to you but I hope you realize it was more out of necessity than anything else. You performed most remarkably, and for that you have our thanks."},{"name":"ARANAMI","text":"Welcome back. Training was a success, I take it. Earlier, one of our new watchguard came sprinting to us, shouting about an attack until he was blue in the face!"},{"name":"ARANAMI","text":"Bahaha! I hope one day you can teach me how to be so intimidating."}],"reward":{"gil":695,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68017]}},"partials":[{"type":"npc","id":"1021509","obj":{"i":1021509,"n":"Aranami","l":2409,"q":2}},{"type":"npc","id":"1019248","obj":{"i":1019248,"n":"Umibeta","l":2409,"q":1}},{"type":"npc","id":"1022402","obj":{"i":1022402,"n":"Watchguard","l":2409,"q":1}},{"type":"quest","id":"68017","obj":{"i":68017,"n":"Alisaie's Stones","g":6,"l":"The Ruby Sea","s":360}}]}