{"quest":{"name":"Family Affairs","location":"The Ruby Sea","id":68226,"patch":4.0,"sort":2180,"icon":100698,"eventIcon":71221,"issuer":1022110,"target":1022106,"involved":[1022111,1022112,1022114,1022115],"genre":108,"journal":["Tsukikage appears deeply troubled.","Tsukikage suspects that Suzume has gone to Hells' Lid to avenge her parents' deaths by killing Hansaku. To do harm to a fellow Confederate, however, is considered to be an act of treason and he fears if someone does not quickly put a stop to all this, he will lose not one, but two of his subordinates.","You speak with Suzume and distract her long enough for Tsukikage to join you. Together, you manage to convince her to put off her plans to murder Hansaku until after Kikimo receives her delivery. Under Tsukikage's orders, Hansaku and Suzume then set off to secure the area and dispatch of any remaining beasts. The Confederacy treasurer leaves to take care of the remainder of the shipments but before returning asks that you stay behind to help clear the area of beasts and keep an eye on Suzume.","As per Tsukikage's orders, you check the near vicinity for any menacing monsters. You deem the area clear. Now it is time to go and check upon Suzume.","You come across Suzume, who is surprisingly with Hansaku─both of whom appear to have sustained a smattering of light wounds. Two vicious beasts rove about them and it falls to you to step in and save Tsukikage's subordinates.","As it turns out, Suzume was attacked by the beasts while her back was turned and Hansaku threw himself at them to save her. Through his selfless act, she has become aware of her own mistakes, and apologizes to him for the harm she attempted to inflict upon him. Now that everything has been peacefully resolved, the Confederates must turn their attentions back to the matter at hand: seeing that Kikimo receives her delivery. While Hansaku and Suzume rush off to load her ship, Tsukikage requests that you come meet him at Onokoro once everything is done.","Tsukikage thanks you for all that you have done and tells you that it is only because of you that the transaction with Kikimo went as smoothly as it did. For all you have done he has come to consider you a brother and sorely hopes you will come to visit again soon."],"objectives":["Speak with Suzume at Sakazuki.","Survey the area from the designated location.","Rendezvous with Suzume.","Rescue Suzume.","Speak with Tsukikage on Onokoro."],"dialogue":[{"name":"TSUKIKAGE","text":"What a terrible mess. If, as I suspect, Suzume has gone to exact revenge on Hansaku, she is likely making her way to him as we speak."},{"name":"TSUKIKAGE","text":"The Confederacy is made up of a diverse group of people, and all of us take a vow upon joining to leave our pasts behind us. If she were to harm a fellow member─regardless of the circumstances─she will be branded an enemy."},{"name":"TSUKIKAGE","text":"She knows this, yet it seems fury has taken hold of her heart and clouded her judgment. We must act quickly and put an end to this nonsense."},{"name":"TSUKIKAGE","text":"Were it not that they needed a captain to transport our goods, I would go and stop her myself. As it stands, however, I must ask that you intervene on my behalf."},{"name":"TSUKIKAGE","text":"Please, hurry to them and see that no harm comes to either Suzume or Hansaku."},{"name":"TSUKIKAGE","text":"I only hope it is not too late. I do not want to lose two of my subordinates, especially not during such a critical time."},{"name":"HANSAKU","text":"S-Suzume... I didn't know. Truly, I am sorry for what they did to you and your village... I..."},{"name":"SUZUME","text":"<span class=\"highlight\">Forename</span>, stay right where you are! If you attempt to stop me, I will put an arrow through you as easily as I will this vile man!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"To hurt another member is to commit treason against the Confederacy."},{"name":"A1","text":"The past is in the past─you are both a part of the Confederacy now."},{"name":"SUZUME","text":"Treason or not, I must avenge my parents' deaths! Because of them, never again will I hear my father's gruff voice or feel the gentle touch of my mother's hand!"},{"name":"SUZUME","text":"That is easy for you to say! Have you watched as your father and mother bled to death before your very eyes!? How does one forget that!?"},{"name":"SUZUME","text":"Unless I kill off those responsible, they will never find peace... Nor will I..."},{"name":"TSUKIKAGE","text":"YOU FOOL!"},{"name":"TSUKIKAGE","text":"The men and women here─we are your family now. To lay a hand on your brothers and sisters is to relinquish your life. Are you ready to pay that price?"},{"name":"SUZUME","text":"I would not be here if I was not."},{"name":"TSUKIKAGE","text":"Very well. Then, I will not stop you. However, you are to settle your accounts with Hansaku only after our transaction with Mistress Kikimo is complete."},{"name":"TSUKIKAGE","text":"The Confederacy's entire future depends on the success of this trade. I will not have you ruining it for us."},{"name":"SUZUME","text":"...Very well, sir. F-For the kindness you and the other pirates have shown me I shall comply with your request."},{"name":"TSUKIKAGE","text":"Good. Then the two of you are to go and secure this perimeter. Now!"},{"name":"SUZUME","text":"(-Suzume and Hansaku-)Yes, sir!"},{"name":"TSUKIKAGE","text":"Remember, Suzume, I will not have you going back on your word. You are not to touch Hansaku until everything is done."},{"name":"SUZUME","text":"I know."},{"name":"TSUKIKAGE","text":"It seems you made it here just in time to prevent what could have well been a catastrophe. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"TSUKIKAGE","text":"Now I must return to the boats and check upon the cargo. Might you remain here and help clear the area?"},{"name":"TSUKIKAGE","text":"...And while you are at it, please keep an eye on Suzume to make sure she does not step out of line."},{"name":"TSUKIKAGE","text":"Hm? What are you doing here? You should be at the north side of the island dispatching of beasts and keeping a watch on Suzume."},{"name":"SUZUME","text":"Damn it all to the seventh hell! I'm going to kill off every last monster on this island─including Hansaku!"},{"name":"SYSTEM","text":"You spy no dangerous creatures in the area. You best now go and check upon Suzume."},{"name":"SUZUME","text":"As soon as I was attacked, Hansaku came running to my rescue. We are both too injured to move but the monsters are no doubt still lurking about nearby."},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"HANSAKU","text":"Th-They went for Suzume, so I put myself between her and them. My injuries aren't that serious but it will take me a while to regain my strength."},{"name":"SUZUME","text":"Watch out, <span class=\"highlight\">Forename</span>. They're back! You must slay them! Hansaku and I cannot move."},{"name":"HANSAKU","text":"Y-You saved my life, yet again. I'm fine. Really. Please, go and check on Suzume."},{"name":"SUZUME","text":"Thank you, <span class=\"highlight\">Forename</span>, for saving us."},{"name":"SUZUME","text":"I was so blinded by rage that I did not notice when the beasts crept up behind me. If Hansaku had not come when he did I...I would be dead. I suppose, in saving me, you sought to earn pardon for your crimes?"},{"name":"HANSAKU","text":"It was not to gain your forgiveness that I threw myself at them. I was acting purely on instinct. "},{"name":"SUZUME","text":"Hmph. I can believe that. You never were one to think before you act."},{"name":"SUZUME","text":"Stop smiling! That wasn't a compliment! Graaagh! You are a fool to the very end. Who goes out of their way to save the one person trying to kill them?"},{"name":"SUZUME","text":"&lt;sigh&gt; ...Perhaps, however, the bigger fool of the two of us is me. Where you constantly look to the future, I desperately cling to the past. My parents─they would not have wanted this."},{"name":"TSUKIKAGE","text":"At long last, the veil of anger has lifted and you see reason. Suzume, is there anything else you want to say to Hansaku?"},{"name":"SUZUME","text":"Hansaku, I...I am sorry. I was a prisoner to my own painful past, but through your actions, you have set me free. &lt;sigh&gt; I have done you harm. Should you wish me to leave the Confederacy, I shall do so."},{"name":"HANSAKU","text":"Leave? I would never ask that of you! Suzume, this is your home and we, your family. You belong here with us."},{"name":"SUZUME","text":"Th-Thank you... Sir, I know I disappointed you but, please, give me a second chance. Let me stay here with you and the Confederacy."},{"name":"TSUKIKAGE","text":"It was never my plan to expel you. All families have their problems and we are no different. What is most important is that we learn from our mistakes and do not repeat them."},{"name":"SUZUME","text":"(-Suzume and Hansaku-)Yes, sir!"},{"name":"HANSAKU","text":"Um... Pardon me, Chief, but isn't Mistress Kikimo set to arrive soon? Won't our deal fall through if we don't go to meet her?"},{"name":"TSUKIKAGE","text":"Some things are more important than money. Business deals can be replaced, but I am afraid the two of you cannot."},{"name":"KIKIMO","text":"(-Firm Voice-)I hope that does not mean you intend to renege on our deal?"},{"name":"KIKIMO","text":"All the goods I had come to collect were at the location we had agreed to meet at, but you were not. Your companions guarding the items said they were given strict orders not to hand anything over until you gave the word. Now I find you here...all covered in blood and slime. What is going on?"},{"name":"TSUKIKAGE","text":"My sincerest apologies, Mistress Kikimo. We were forced to divert our attentions temporarily to deal with a...security breach of sorts. It has been resolved."},{"name":"KIKIMO","text":"By the looks of it you have gone to great lengths to ensure my safety upon arriving on the island. Time and time again you impress me with your resolve to provide the best of services to your customers. I must say the future between your organization and ours is bright."},{"name":"KIKIMO","text":"That said, please let us return and begin loading the goods. I would prefer to make it back to Kugane before <span class=\"alternative-container\"><span class=\"alternative\">sunrise</span><span class=\"alternative\">nightfall</span></span>."},{"name":"SUZUME","text":"Y-Yes, madam! We will get on it straightaway!"},{"name":"SUZUME","text":"Come, Hansaku!"},{"name":"TSUKIKAGE","text":"<span class=\"highlight\">Forename</span>, your help has been indispensable. Not only have you saved my two subordinates, but the Confederacy, as well. I must go and oversee the remainder of this transaction but I ask that you come find me later at Onokoro."},{"name":"TSUKIKAGE","text":"Thank you for coming all this way. You will be pleased to hear that everything went smoothly after you left."},{"name":"TSUKIKAGE","text":"Suzume and Hansaku were quick to load the ship. It was almost as though nothing ever happened between them."},{"name":"TSUKIKAGE","text":"You, of course, are who we have to thank for that. We are greatly indebted to you for all you have done for us."},{"name":"TSUKIKAGE","text":"While you may not be an official member of the Confederacy, we have come to think of you as family. I hope you will come back to visit us whenever you can. And, remember, should you ever wish to officially join our ranks, we would be more than happy to welcome you."}],"reward":{"gil":1500,"items":[{"num":3,"id":5718}],"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"questsType":"all","quests":[68017,68225]},"next":[68259]},"partials":[{"type":"npc","id":"1022110","obj":{"i":1022110,"n":"Tsukikage","l":2409,"q":2}},{"type":"npc","id":"1022106","obj":{"i":1022106,"n":"Tsukikage","l":2409,"q":3}},{"type":"npc","id":"1022111","obj":{"i":1022111,"n":"Suzume","l":2409,"q":1}},{"type":"npc","id":"1022112","obj":{"i":1022112,"n":"Hansaku","l":2409,"q":1}},{"type":"npc","id":"1022114","obj":{"i":1022114,"n":"Hansaku","l":2409,"q":1}},{"type":"npc","id":"1022115","obj":{"i":1022115,"n":"Suzume","l":2409,"q":1}},{"type":"item","id":"5718","obj":{"i":5718,"n":"Quickarm Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Skill Speed","category":0}}},{"type":"quest","id":"68017","obj":{"i":68017,"n":"Alisaie's Stones","g":6,"l":"The Ruby Sea","s":360}},{"type":"quest","id":"68225","obj":{"i":68225,"n":"The Girl with the Pearl Ring","g":108,"l":"The Ruby Sea","s":2170}},{"type":"quest","id":"68259","obj":{"i":68259,"n":"Up in Flames","g":108,"l":"The Ruby Sea","s":3270}}]}