{"quest":{"name":"Not Just Any Banquet","location":"The Ruby Sea","id":68228,"patch":4.0,"sort":2200,"eventIcon":71221,"issuer":1019183,"target":1019183,"genre":108,"journal":["Kaioke appears frazzled."],"objectives":["Place the rotting fish at the designated locations and slay the hungry giant coralshells that appear for their legs.","Deliver the giant coralshell legs to Kaioke."],"dialogue":[{"name":"KAIOKE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>! Am I correct to assume you are from the surface? While I am loath to have to ask a favor─especially of a visitor such as yourself─I am afraid I have nowhere left to turn."},{"name":"KAIOKE","text":"You see, a couple times a year we will hold a village-wide banquet where each person brings their own signature dish. As I have been charged with organizing the event, attending to the main preparations has left me with little time to collect the necessary ingredients for my food!"},{"name":"KAIOKE","text":"Nearly everyone has finished making theirs, but I have yet to even begin! Readying the broth takes the longest, so I must start that now. To complete it, however, I need the legs of two giant coralshells."},{"name":"KAIOKE","text":"Please, might you obtain them for me?"},{"name":"KAIOKE","text":"They can be found on the coast of Onokoro. Here─take this bait. Giant coralshells are reticent creatures but the smell of that should be enough to attract them out of hiding."},{"name":"KAIOKE","text":"Please bring me legs of two giant coralshells. In the meantime, I shall put a pot on the stove and begin preparing my broth."},{"name":"KAIOKE","text":"&lt;sniff&gt; &lt;sniff&gt; Ah, if I am not mistaken that is the piquant scent of coralshell that clings gently to your clothes."},{"name":"KAIOKE","text":"Haha! Look at the size of these legs! Added to that, the meat inside appears very tender and succulent. Once they are added to the stew and boiled, it will be ready to serve!"},{"name":"KAIOKE","text":"Truth be told, these banquets are not all about having fun. In fact, some might say it is a silent competition to see who can serve the best food. The individual to bring the most delicious dish is usually awarded the honor of hosting the next one."},{"name":"KAIOKE","text":"Thanks to you and these delicious legs you have brought back for me, my victory is all but guaranteed!"}],"reward":{"gil":595,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68019]}},"partials":[{"type":"npc","id":"1019183","obj":{"i":1019183,"n":"Kaioke","l":2409,"q":1}},{"type":"quest","id":"68019","obj":{"i":68019,"n":"Of Kojin and Kami","g":6,"l":"The Ruby Sea","s":380}}]}