{"quest":{"name":"Pirate Stew","location":"The Ruby Sea","id":68220,"patch":4.0,"sort":2120,"eventIcon":71221,"issuer":1021511,"target":1021511,"genre":108,"journal":["Hirase is pondering what to make the Confederates for <span class=\"alternative-container\"><span class=\"alternative\">dinner</span><span class=\"alternative\">breakfast</span><span class=\"alternative\">lunch</span></span>."],"objectives":["Obtain slabs of hearty gyuki meat from gyuki.","Deliver the slabs of hearty gyuki meat to Hirase."],"dialogue":[{"name":"HIRASE","text":"Bah! You scared me! I was just contemplating what to make the hungry men and women of Onokoro for <span class=\"alternative-container\"><span class=\"alternative\">dinner</span><span class=\"alternative\">breakfast</span><span class=\"alternative\">lunch</span></span>. As the resident chef, it is my responsibility to see that they are provided with good, nutritious meals."},{"name":"HIRASE","text":"I think today we will be having a pirate's stew. Makes your mouth water, doesn't it?"},{"name":"HIRASE","text":"Problem is, I am missing a key ingredient. &lt;sigh&gt; Our revenue from the Ruby Tithe has been slowly declining and the treasurer has cut down on my budget. I am now unable to afford the juicy meat that makes this stew a proper pirate's stew."},{"name":"HIRASE","text":"Regardless, it is my job to find a way to keep our pirates healthy and full. That means I must find an alternative way to procure my meats. Perhaps you could assist me?"},{"name":"HIRASE","text":"To the west of here are wild gyuki. Might you kill a few and bring me back slabs of this meat? In the meantime, I will go and search the sea for other foods to put into the stew."},{"name":"HIRASE","text":"Please bring back a few slabs of meat from the wild gyuki wandering to the west of here."},{"name":"HIRASE","text":"You have brought me back my meat? Fantastic! Simply fantastic! With this, my stew is now complete!"},{"name":"HIRASE","text":"Do you smell that, my good <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>? Now, that is the smell of a proper meal!"},{"name":"HIRASE","text":"Once we slide the hot stones into the pot, and the seawater begins to boil the seafood and meat, the already heavenly aroma will become all the sweeter!"},{"name":"HIRASE","text":"We have the Ruby Sea to thank for such a luxurious bounty. By her we are blessed and in partaking of her food we shall be protected─unless you are foolish enough to swallow one of the hot stones, that is! Hahaha!"},{"name":"HIRASE","text":"Thank you for your help, my friend. I hope this shall suffice as payment for your services."}],"reward":{"gil":595,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68017]}},"partials":[{"type":"npc","id":"1021511","obj":{"i":1021511,"n":"Hirase","l":2409,"q":2}},{"type":"quest","id":"68017","obj":{"i":68017,"n":"Alisaie's Stones","g":6,"l":"The Ruby Sea","s":360}}]}