{"quest":{"name":"The Sword in the Stone","location":"The Ruby Sea","id":68229,"patch":4.0,"sort":2210,"unlocksFunction":1,"eventIcon":71341,"issuer":1023357,"target":1023358,"genre":108,"journal":["The slender Kojin is looking for a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who is light on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> feet.","Speak with the slender Kojin.","Jump to the first plateau.","Jump to the second plateau.","Speak with the slender Kojin."],"objectives":["Jump to the first plateau.","Jump to the second plateau.","Speak with the slender Kojin."],"dialogue":[{"name":"SLIMTURTLE02693","text":"&lt;sigh&gt; It is so far away...but I cannot give up just yet."},{"name":"SLIMTURTLE02693","text":"Oh, a visitor! My─your footsteps were so light I did not hear you approach. I could really use the assistance of one as nimble as yourself."},{"name":"SLIMTURTLE02693","text":"Do you see that sword protruding from that large boulder up there? I must find a way to procure it that I might accomplish my dreams."},{"name":"SLIMTURTLE02693","text":"Like all the others, I want so desperately to explore the surface in search of treasure. To do so, however, I must first prove to the village elders I am worthy of embarking upon such excursions by retrieving that sword."},{"name":"SLIMTURTLE02693","text":"My comrades have given me advice on how I might reach it but every time I get close, I lose my footing and end up tumbling into the waters below."},{"name":"SLIMTURTLE02693","text":"Could you, perhaps, do me a favor by demonstrating how I might get there? Come, let us move up above. I shall observe your lithe movements from there."},{"name":"SLIMTURTLE02693","text":"Do you spy that large plateau jutting out of the cave walls over there? Can you begin by jumping over to it?"},{"name":"SYSTEM","text":"You must demonstrate to the Kojin that this feat can be accomplished without the use of any outside help. Should you call upon a mount or fall into the water, you must start over from the beginning."},{"name":"SLIMTURTLE02693","text":"Please, I need for you to show me how to make it from here to where the sword is over there."},{"name":"SLIMTURTLE02693","text":"(-Slender Kojin-)I, too, can make it to the plateau, but it is from there that things become tricky. Every step must be taken with calculated precision or you risk, like me, plummeting into the waters below."},{"name":"SLIMTURTLE02693","text":"(-Slender Kojin-)Ah─so that is how you must do it! I shall give it a try!"},{"name":"SLIMTURTLE02693","text":"I am beyond impressed! You are possessed of an incredible grace!"},{"name":"SLIMTURTLE02693","text":"It is clear to me now. One must tense all the muscles in their legs then push off from the rock to gain enough momentum to make it to the next one."},{"name":"SLIMTURTLE02693","text":"You have restored my confidence. Thanks to you, I am one step closer to fulfilling my dream of exploring what the world above has to offer!"}],"reward":{"gil":695,"aetherCurrent":1,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68019]}},"partials":[{"type":"npc","id":"1023357","obj":{"i":1023357,"n":"Slender Kojin","l":2409,"q":1}},{"type":"npc","id":"1023358","obj":{"i":1023358,"n":"Slender Kojin","l":2409,"q":1}},{"type":"quest","id":"68019","obj":{"i":68019,"n":"Of Kojin and Kami","g":6,"l":"The Ruby Sea","s":380}}]}