{"quest":{"name":"A Daughter's Love","location":"The Ruby Sea","id":68239,"patch":4.0,"sort":3070,"eventIcon":71221,"issuer":1019199,"target":1019199,"involved":[1019200],"genre":108,"journal":["Sayo stares at you with wide, hopeful eyes."],"objectives":["Speak with Tosetsu.","Obtain three red coral from the area around Shisui of the Violet Tides.","Deliver the three red coral to Sayo."],"dialogue":[{"name":"SAYO","text":"Um, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>? <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span>? You are an adult, right? Mother tells me I am still too young to venture far from home, but there is something that I really, <span class=\"emphasis\">really</span> need."},{"name":"SAYO","text":"Lately, Mother has not been feeling well. I thought making her a hairpin might cheer her up, but I have no coral."},{"name":"SAYO","text":"Please, please, <span class=\"emphasis\">please</span>, will you bring me three of the prettiest, reddest coral you can find?"},{"name":"SAYO","text":"If you do not know where to search for them, you should ask Tosetsu. He will be able to tell you!"},{"name":"SAYO","text":"Did you get them?"},{"name":"TOSETSU","text":"Certainly. I can tell you where the red coral grows, but first you must answer me this: why do you want to know?"},{"name":"TOSETSU","text":"You are gathering them for Sayo that she might make a hairpin for her mother?"},{"name":"TOSETSU","text":"In that case, the most vibrant fields are located near Shisui of the Violet Tides. The crystals at the Turquoise Trench purify all the surrounding waters, making the coral there the most beautiful in the five seas."},{"name":"TOSETSU","text":"It is said that those of crimson hue protect the women who wear them from coming to any harm. Good luck, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I hope you manage to make that little girl's day."},{"name":"TOSETSU","text":"The coral you seek can easily be found near Shisui of the Violet Tides."},{"name":"TOSETSU","text":"You found them? Fantastic! I am sure Sayo will be absolutely delighted."},{"name":"SAYO","text":"Were you able to find my coral?"},{"name":"SAYO","text":"Oooh! Thank you! Thank you so much, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! These are the best and brightest ones I have ever seen! ...Oh, and I found out earlier that Mother actually was not sick. She is going to have a baby, and I am going to be a big sister!"},{"name":"SAYO","text":"I am thinking instead to use these to make two hairpins─one for Mother and another for my new baby sister! These red coral are sure to keep them safe forever and ever."}],"reward":{"gil":669,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68021]}},"partials":[{"type":"npc","id":"1019199","obj":{"i":1019199,"n":"Sayo","l":2409,"q":1}},{"type":"npc","id":"1019200","obj":{"i":1019200,"n":"Tosetsu","l":2409,"q":1}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}}]}