{"quest":{"name":"All Good Deeds","location":"The Ruby Sea","id":68236,"patch":4.0,"sort":3040,"eventIcon":71221,"issuer":1019198,"target":1019198,"genre":108,"journal":["Kagero is curious to talk with an individual not from Sui–no–Sato."],"objectives":["Destroy the awahaki.","Report to Kagero."],"dialogue":[{"name":"KAGERO","text":"Hello, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Am I correct to assume that you are from the surface? Outside of the Kojin, we do not receive too many visitors. Then again, it is only to be expected. We live at the bottom of the sea, after all!"},{"name":"KAGERO","text":"Long ago, in exchange for the treasures we gave them, the Kojin taught our ancestors the secret to living in this great expanse of water."},{"name":"KAGERO","text":"We have resided here since, as their neighbors. They are a very kind-hearted and clever people, who love collecting rare items. It would greatly benefit you to befriend them."},{"name":"KAGERO","text":"Aha! One moment─something is coming to me. Yes! I know. If you were to wipe out some of the awahaki growing around their village they are sure to be extremely pleased! About six should get you in their good graces."},{"name":"KAGERO","text":"Yes, if you were to go and destroy six awahaki, you are sure to be friends with the Kojin in next to no time!"},{"name":"KAGERO","text":"You have exterminated the awahaki? Good work!"},{"name":"KAGERO","text":"The Kojin will be absolutely delighted to hear it! You see, they primarily use striped rays for transportation and to deliver goods. The beasts, however, are so terrified of the bubbles that stream from these plants that upon seeing them, they will buck off whoever─or whatever─they are carrying."},{"name":"KAGERO","text":"I shall inform them of all that you have done for them later. For now, please allow me to present you with your reward. See, aren't you happy you helped?"}],"reward":{"gil":635,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68021]}},"partials":[{"type":"npc","id":"1019198","obj":{"i":1019198,"n":"Kagero","l":2409,"q":1}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}}]}