{"quest":{"name":"The Mysterious Assailant","location":"The Ruby Sea","id":68232,"patch":4.0,"sort":2240,"eventIcon":71221,"issuer":1019180,"target":1019180,"genre":108,"journal":["Urokuzu is searching high and low for an experienced fighter."],"objectives":["Survey the area and slay any beasts that appear.","Report to Urokuzu."],"dialogue":[{"name":"UROKUZU","text":"Ah, you are a <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span> from above and one who appears to be a battle-hardened warrior, no less! That you should choose this very moment to visit us─it is no coincidence!"},{"name":"UROKUZU","text":"The other day one of our younger Kojin was out fishing when he was attacked and seriously injured. He was unable to identify his assailant, but many suspect it might be the doing of a coralshell. Around this time they begin laying eggs and can be very aggressive."},{"name":"UROKUZU","text":"I, however, believe it to be something far more sinister than that. The individual I speak of is Tamamizu's most gifted fighter. A mere coralshell would not be able to catch him unawares."},{"name":"UROKUZU","text":"The incident took place on the northern shores of the Isle of Bekko. Please, might you go there and investigate what could have been behind this?"},{"name":"UROKUZU","text":"Do be careful. I do not want to have your death on my consciousness."},{"name":"UROKUZU","text":"...So the Kojin of the Red were the culprits? This is an outrage! While we are by no means on friendly terms, they have never attempted to murder one of our own until now."},{"name":"UROKUZU","text":"...Then again, perhaps they were not aiming to take his life but were simply looking to steal the ancient rod he was using at the time. It is, after all, one of our most valuable treasures."},{"name":"UROKUZU","text":"I must warn the others to take extra precautions when leaving the village with anything that can be considered to be of great worth. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, for your assistance in shedding light upon this most troubling matter."}],"reward":{"gil":595,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68019]}},"partials":[{"type":"npc","id":"1019180","obj":{"i":1019180,"n":"Urokuzu","l":2409,"q":2}},{"type":"quest","id":"68019","obj":{"i":68019,"n":"Of Kojin and Kami","g":6,"l":"The Ruby Sea","s":380}}]}