{"quest":{"name":"Treasure Cove","location":"The Ruby Sea","id":68231,"patch":4.0,"sort":2230,"eventIcon":71221,"issuer":1019182,"target":1019182,"genre":108,"journal":["Kefusan is looking you up and down."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter “Is anyone around here?” to draw the spirit's attention.","Report to Kefusan."],"dialogue":[{"name":"KEFUSAN","text":"Ah, an adventurer! You are just in time. Tell me, have you ever heard of Treasure Cove?"},{"name":"KEFUSAN","text":"According to ancient legend, a Hingan pirate hid the entirety of his fortune away in a firth in the Ruby Sea─the value of which eclipses even the wealth of kings! While it is said no one has ever been able to locate its whereabouts, we think we may have found it!"},{"name":"KEFUSAN","text":"To the south of here is small cove. Whenever we draw close to it, the winds begin to pick up and carry the angry cries of a man shouting: “Begone! Begone from here!” No doubt it is the spirit of the pirate, who continues to covet his treasures from beyond the grave."},{"name":"KEFUSAN","text":"That incredulous look─do you mean to say you do not believe my story? Well, you are more than welcome to go there and verify the veracity of my statement for yourself. If the voice does not scare you away, you might even be able to find the legendary treasure."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase that contains the words “Is anyone around here?” to draw the spirit's attention."},{"name":"KEFUSAN","text":"If in your investigations you manage to uncover the legendary treasure, do be sure to bring it back to us!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase that contains the words “Is anyone around here?” to draw the spirit's attention."},{"name":"SAYTODO","text":"Is anyone around here?"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase that contains the words “Is anyone around here?” to draw the spirit's attention."},{"name":"RIDDLEMAN02695","text":"(-Faint Voice-)Begone! You are scaring all the fish away!"},{"name":"SYSTEM","text":"The winds have carried to your ears the complaints of an angry Kojin."},{"name":"RIDDLEMAN02695","text":"(-Faint Voice-)Ugh! Why does everyone insist on bothering me so? When I finally think I am rid of them, they round up their friends and return to harass me some more! Begone! Begone with all of you!"},{"name":"RIDDLEMAN02695","text":"(-Faint Voice-)&lt;sigh&gt; I will never get any fishing done at this rate..."},{"name":"KEFUSAN","text":"You mean to say the voice we heard was only that of a Kojin fisherman? How disappointing!"},{"name":"KEFUSAN","text":"&lt;sigh&gt; I shall be sure to inform the others and tell them to quit bothering the poor soul."},{"name":"KEFUSAN","text":"While I am sad that it is over, it was fun while it lasted. Should you ever learn anything more of the pirate king's treasure, do come back to share what you find!"}],"reward":{"gil":562,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68019]}},"partials":[{"type":"npc","id":"1019182","obj":{"i":1019182,"n":"Kefusan","l":2409,"q":1}},{"type":"quest","id":"68019","obj":{"i":68019,"n":"Of Kojin and Kami","g":6,"l":"The Ruby Sea","s":380}}]}