{"quest":{"name":"The Bond between Brothers","location":"The Ruby Sea","id":68234,"patch":4.0,"sort":3020,"eventIcon":71221,"issuer":1019215,"target":1019215,"involved":[1023094,1023095],"genre":108,"journal":["Mahiwa appears troubled."],"objectives":["Speak with Mahiwa's eldest son.","/huh at Mahiwa's eldest son.","Speak with Mahiwa's younger son.","/huh at Mahiwa's younger son.","Report to Mahiwa."],"dialogue":[{"name":"MAHIWA","text":"We, the Raen, left the surface long ago that we might forge ourselves a peaceful life under the sea. Maintaining such serenity, however, is not always easy─my two sons can attest to that."},{"name":"MAHIWA","text":"From the crack of dawn until dusk they fight. Lately, things have started to escalate and they have begun to trouble the entire village with their spats."},{"name":"MAHIWA","text":"I have scolded them on multiple occasions, telling them that such disturbing behavior is unacceptable. They, however, still refuse to listen. Perhaps you can try having a word with them?"},{"name":"MAHIWA","text":"You can start with my eldest son. He should be over by the racks of dried fish. If he attempts to start a fight with you when you approach him, I suggest you respond with a resounding <span class=\"highlight\">huh</span>. That should stop him."},{"name":"MAHIWA","text":"Should he try to start a fight with you, I suggest you look him in the eye and respond with a resounding <span class=\"highlight\">huh</span>."},{"name":"NAUGHTYBROTHER02698","text":"Huh? What do you want? Stop wasting my time. Hurry up and say what it is you've come to say!"},{"name":"SYSTEM","text":"By his cocky attitude you sense Mahiwa's eldest son is trying to pick a fight with you. You best <span class=\"highlight\">huh</span> at him before things get any further out of hand."},{"name":"NAUGHTYBROTHER02698","text":"I will tell you one last time. If there is something you have come to say to me, say it! If not, begone from my sight!"},{"name":"SYSTEM","text":"By his cocky attitude you sense Mahiwa's eldest son is trying to pick a fight with you. You best <span class=\"highlight\">huh</span> at him before things get any further out of hand."},{"name":"NAUGHTYBROTHER02698","text":"Huh? <span class=\"emphasis\">Huh</span>!? Wh-Who do you think you are to take such a lofty tone with me!? Well, if it is a fight you want, it is a fight you will get!"},{"name":"NAUGHTYBROTHER02698","text":"But wait... Perhaps this is what Mother meant when she said I had an unpleasant attitude. Now that I think on it, I have often done to my brother what you just did to me. Maybe it's what caused our constant brawls."},{"name":"NAUGHTYBROTHER02698","text":"I understand now. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>...and my apologies for trying to fight you. If you happen to see my brother, please tell him I am sorry."},{"name":"MYSTERIOUSBROTHER02698","text":"You came to tell me my brother says he is sorry? I do not believe you."},{"name":"SYSTEM","text":"Mahiwa's younger son appears to be in a sour mood and seems to be looking to take it out on someone. You best <span class=\"highlight\">huh</span> at him before things get any further out of hand."},{"name":"MYSTERIOUSBROTHER02698","text":"Please, leave me. I just want to be alone!"},{"name":"SYSTEM","text":"Mahiwa's younger son appears to be in a sour mood and seems to be looking to take it out on someone. You best <span class=\"highlight\">huh</span> at him before things get any further out of hand."},{"name":"MAHIWA","text":"So my eldest son has finally come around? That is wonderful to hear! I only hope you see the same amount of success when you speak with my younger son."},{"name":"MYSTERIOUSBROTHER02698","text":"What do you─ You did that because I seem grumpy!? No, you misunderstand."},{"name":"MYSTERIOUSBROTHER02698","text":"&lt;sigh&gt; Mother also often comments that I seem sullen. I am not─I simply do not have much to say. Perhaps my brother has also been mistaking my silence for anger and that is why he shouts at me."},{"name":"MYSTERIOUSBROTHER02698","text":"I must go and sort this out with him. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. You have made me realize how important it is to let others know what I am thinking. I shall go find my brother now!"},{"name":"MAHIWA","text":"Perhaps now they will be able to find a way to reconcile their differences. Thank you. Until you came along I was at a loss as to what to do."},{"name":"MAHIWA","text":"By nature, we avoid using any harsh words or actions. As such, most of what I have to say is easily brushed aside by my children."},{"name":"MAHIWA","text":"You, however, have gotten through to them where I could not. Now the people of the village need not be disturbed by their angry shouts any longer. Please accept this small gift as a token of my appreciation."}],"reward":{"gil":770,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68021]}},"partials":[{"type":"npc","id":"1019215","obj":{"i":1019215,"n":"Mahiwa","l":2409,"q":1}},{"type":"npc","id":"1023094","obj":{"i":1023094,"n":"Mahiwa's Eldest Son","l":2409,"q":1}},{"type":"npc","id":"1023095","obj":{"i":1023095,"n":"Mahiwa's Younger Son","l":2409,"q":1}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}}]}