{"quest":{"name":"An Unforgettable Taste","location":"The Ruby Sea","id":68233,"patch":4.0,"sort":3010,"eventIcon":71221,"issuer":1019205,"target":1019205,"genre":108,"journal":["Seizau needs the help of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> with sharp eyes and quick reflexes."],"objectives":["Obtain cuts of ruby hornbill breast meat from ruby hornbills.","Deliver the cuts of ruby hornbill breast meat to Seizau."],"dialogue":[{"name":"SEIZAU","text":"If your sun-kissed skin is any indication, you have come here from the world above. Sadly for you, we are an extremely tight-knit and self-sufficient community and do not have any work for outsiders. "},{"name":"SEIZAU","text":"Ah, wait─perhaps that is not necessarily true. I have just thought of a task only one of your kind will be able to carry out. Tell me, are you any good at hunting birds?"},{"name":"SEIZAU","text":"Very good! In that case, I would like for you to bring me back the breast meat of three ruby hornbills."},{"name":"SEIZAU","text":"There should be plenty of ruby hornbills at the Isle of Bekko. Please, bring me back the breast meat of three of these birds."},{"name":"SEIZAU","text":"Do you have what I asked for?"},{"name":"SEIZAU","text":"These cuts you have brought me are beautiful. Excellent work. I have, for far too long, craved the taste of bird meat. You see, many years ago, a cage fell from a ship passing above. Within it was a bird. The moment its flesh touched my lips I knew no food, however fine, could compare."},{"name":"SEIZAU","text":"We receive so few visitors from the surface that it is next to impossible to procure such meat─or any meat at all, in fact. All the Kojin merchants ever bring is seafood."},{"name":"SEIZAU","text":"Before you go, I have one question for you. If I'm not mistaken, birds have appendages that allow them to soar the skies. You do not look as though you can fly, so how is it that you were able to capture these magnificent winged creatures?"},{"name":"SEIZAU","text":"You anger them and when they come to attack you, you pounce? Hahaha! You people from the land are a ferocious lot."},{"name":"SEIZAU","text":"Slowly, I come to understand the decision my ancestors made to seek refuge in the seas. Anyroad, thank you for bringing me my meat. My siblings and I shall feast tonight!"}],"reward":{"gil":602,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68021]}},"partials":[{"type":"npc","id":"1019205","obj":{"i":1019205,"n":"Seizau","l":2409,"q":1}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}}]}