{"quest":{"name":"Fear Her Almighty Waves","location":"The Ruby Sea","id":68237,"patch":4.0,"sort":3050,"eventIcon":71221,"issuer":1023310,"target":1023310,"genre":108,"journal":["The sapphire-haired girl is delighted to see you again."],"objectives":["Obtain mozuku.","Deliver the mozuku to the sapphire-haired girl."],"dialogue":[{"name":"AOGAMI","text":"Oh, I thought I recognized you! Perhaps you remember me, too? I am the girl you saved from the shore jellyfish in Onokoro."},{"name":"AOGAMI","text":"Do not tell me you are surprised to learn I am from Sui–no–Sato? While it is true that we rarely stray far from our small underwater village, we do occasionally go out to collect food."},{"name":"AOGAMI","text":"The day you rescued me, I had left to do just that, but before I could harvest the mozuku I so dearly need, I was ambushed by those awful creatures."},{"name":"AOGAMI","text":"I still have yet to recover from the injuries I sustained and was hoping you could help me one last time. Please, might you gather four clumps of mozuku and bring them back to me?"},{"name":"AOGAMI","text":"Would you please bring me back four clumps of mozuku? You should be able to find it in the waters around the shores of Onokoro."},{"name":"AOGAMI","text":"Your return─does it mean you brought me my mozuku?"},{"name":"AOGAMI","text":"Oh, thank you! This seaweed is a very important part of our diet, and I know not what I would have done had you not agreed to collect it for me."},{"name":"AOGAMI","text":"Until now, I had never been stung while gathering mozuku. &lt;sigh&gt; I suppose I only have myself to blame. I should not have allowed myself to be distracted by the glittering scales of the fish that swam by."},{"name":"AOGAMI","text":"If only we had fields like those upon the surface, we could mitigate such risks. Sadly we are a small village, and space for farming is something we can scarce afford."},{"name":"AOGAMI","text":"While the sea is bountiful and full of riches, unlike you, she only bestows her blessings upon those who hold her in awe. It was arrogant of me to forget to fear her mighty waves."},{"name":"AOGAMI","text":"I, however, remain thankful for the ordeal because it reminded me of something very important and allowed me to make a wonderful new friend. Please take this gift."}],"reward":{"gil":602,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68021,68218]}},"partials":[{"type":"npc","id":"1023310","obj":{"i":1023310,"n":"Sapphire-haired Girl","l":2409,"q":1}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}},{"type":"quest","id":"68218","obj":{"i":68218,"n":"Stranded","g":108,"l":"The Ruby Sea","s":2100}}]}