{"quest":{"name":"The Core of Life","location":"The Ruby Sea","id":68235,"patch":4.0,"sort":3030,"eventIcon":71221,"issuer":1019201,"target":1019201,"genre":108,"journal":["Mine sniffs the air, a delicate smile on her face."],"objectives":["Obtain water sprite cores from apas. ","Deliver the water sprite cores to Mine."],"dialogue":[{"name":"MINE","text":"&lt;sniff&gt; &lt;sniff&gt; That scent... The smell of the sun and the skies lingers upon you. Truly, it is a wonderful aroma."},{"name":"MINE","text":"Might I ask you for a favor? There is something that I need from the surface. I shall, of course, compensate you for your troubles."},{"name":"MINE","text":"I would like for you to bring me back three water sprite cores, which can be obtained from the apas at Hells' Lid. They might appear frail, but do not let that fool you. They are by no means easy to defeat."},{"name":"MINE","text":"Please bring me three water sprite cores from the apas at Hells' Lid. Brace yourself─they will be tough to take down."},{"name":"MINE","text":"Ah, you are back. I trust you were able to obtain what I requested?"},{"name":"MINE","text":"Fantastic! Now we will have no need to worry about drinking water for some time to come. Though we have been here for generations, we are still unable to consume seawater. These will allow us to remove the brine and turn it into freshwater."},{"name":"MINE","text":"Normally, we send the strongest men from our village to procure the water sprite cores, but the Kojin of the Red have become suspiciously territorial of late. It has made approaching Hells' Lid extremely difficult for us."},{"name":"MINE","text":"Thank you very much for your help. We would not be able to survive without the sprite cores you brought back to us. As promised, here is your reward."}],"reward":{"gil":602,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68021]}},"partials":[{"type":"npc","id":"1019201","obj":{"i":1019201,"n":"Mine","l":2409,"q":1}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}}]}