{"quest":{"name":"The Fight for Survival","location":"The Ruby Sea","id":68238,"patch":4.0,"sort":3060,"eventIcon":71221,"issuer":1019218,"target":1019218,"genre":108,"journal":["Mozu is glancing around nervously."],"objectives":["Defeat the warmspring gasame.","Report to Mozu."],"dialogue":[{"name":"MOZU","text":"Oh, my─you must be from the surface. Normally, I would avoid associating with anyone of your ilk, but we are in desperate need of outside help."},{"name":"MOZU","text":"You see, two warmspring gasame have made their way into the Anemone Gardens. Some of the men in our village went to dispatch of them but because they are unused to fighting on land, none of them survived the encounter..."},{"name":"MOZU","text":"If we do not manage to kill them off soon, they will end up consuming all of the available food there! Please, you must get rid of them for us!"},{"name":"MOZU","text":"They are devouring copious amounts of food at the caves even as we speak. Please, I beg of you, hurry and exterminate them!"},{"name":"SYSTEM","text":"You are under attack!"},{"name":"MOZU","text":"You defeated them? Thank you. Thank you so very much. You have saved us from starvation."},{"name":"MOZU","text":"The seaweed and mollusks there are one of our main sources of food. Yumemi, especially, are very nutritious, and without them we would not be able to sustain ourselves."},{"name":"MOZU","text":"Unfortunately, they also happen to be one of the warmspring gasame's favorite things to snack on. Had you not slain them when you did, we would have been in dire straits."},{"name":"MOZU","text":"What is worse is that these vicious beasts seem to be growing stronger─something possibly owing to increasing number of eruptions from Hells' Lid. You are incredibly strong, but you best also take care when dealing with these beasts in the future."}],"reward":{"gil":602,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68021]}},"partials":[{"type":"npc","id":"1019218","obj":{"i":1019218,"n":"Mozu","l":2409,"q":1}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}}]}