{"quest":{"name":"Unmeasured Strength","location":"The Ruby Sea","id":68230,"patch":4.0,"sort":2220,"eventIcon":71221,"issuer":1019187,"target":1019187,"genre":108,"journal":["Toro is in need of a pair of strong arms."],"objectives":["Slay the unkiu.","Speak with Toro."],"dialogue":[{"name":"TORO","text":"Would you take a look at those brawny arms! You appear to be as strong as me─if not stronger! I would bet all my treasure that you, too, could kill a flying shark with your bare hands."},{"name":"TORO","text":"The other day I purchased this stone of vitality from a merchant on the surface. He promised me that wearing it would grant me immense physical might."},{"name":"TORO","text":"I have gone out and tested it against all manner of wild beast but it did not seem to have any effect. Could you give it a try? I suspect there is a trick to making it work that I have not yet figured out myself."},{"name":"TORO","text":"Mayhap you can test it out against some of the unkiu to the east of here. These beasts are said to have shells as hard as diamond and are nigh indestructible."},{"name":"TORO","text":"Please, take the stone of vitality and test it out on the unkiu to the east of here."},{"name":"TORO","text":"So, tell me, adventurer─did the stone of vitality work?"},{"name":"TORO","text":"You could not tell if it had any effect? &lt;sigh&gt; The merchant did warn me that the stone would do little for those who have already attained true power."},{"name":"TORO","text":"Mayhap the both of us are simply too strong to receive any of its benefits."},{"name":"TORO","text":"While the thing may have cost me a fortune, I do not regret a single koban I spent on it. This rock has proven to me that I have what it takes to protect my people and my village, and that I need nothing more than my two arms and legs to do it."},{"name":"TORO","text":"I shall be keeping the stone of vitality as a reminder of that. Thank you for all your help. You have allowed me to come to a very important realization today."}],"reward":{"gil":562,"xp":91800},"reqs":{"jobs":[{"lvl":62,"id":34}],"quests":[68019]}},"partials":[{"type":"npc","id":"1019187","obj":{"i":1019187,"n":"Toro","l":2409,"q":1}},{"type":"quest","id":"68019","obj":{"i":68019,"n":"Of Kojin and Kami","g":6,"l":"The Ruby Sea","s":380}}]}