{"quest":{"name":"The Elixir of Life","location":"The Ruby Sea","id":68242,"patch":4.0,"sort":3100,"icon":100699,"eventIcon":71221,"issuer":1023280,"target":1023280,"involved":[1019197,1023286,1023287,1023288,1023289,1023290],"genre":108,"journal":["The Ruby Princess is eager to depart for Tamamizu.","Princess Kurenai inquires as to whether you have ever been to Tamamizu before. Upon hearing that you have, she appears immensely relieved and asks that you show her around upon your arrival there. It is time to depart for the lands of the Kojin of the Blue.","You travel to Tamamizu with Princess Kurenai. There, you decide the first step to finding the cure would be to search out the Kojin merchant, Inban, who gave her the tattered book of faerie tales when she was younger. Together, scour the quaint village for this individual.","You speak with Inban, who tells you that a cure to Hisui's condition does exist in an ancient book of Kojin recipes, however, it cannot be recreated. One of the ingredients─the shell of a bloated yumemi─can no longer be procured, as the last of these ancient creatures was spotted decades ago. Nevertheless, you and the princess are undeterred. Announcing her intention to gather kelp, which was used to bait these giant mollusks, she bids you meet her at Exile─the erstwhile bloated yumemi hunting grounds.","You meet Kurenai in Exile, who hands you the most delicious stalks of kelp she could find. She then points you to the mouth of a nearby cave, in which the bloated yumemi hunting grounds of eld are located, and asks that you attempt to lure one out and obtain its shell.","Using the kelp stalks, you set the bait for any bloated yumemi that might be in the vicinity. After a bit of waiting, one appears and you make swift work of it before stooping down to harvest its shell. Princess Kurenai will be overjoyed to see you have somehow achieved the impossible.","As you return to where the Ruby Princess is waiting, you see that she has been joined by Inban. You present the two of them with the bloated yumemi shell and they are both incredibly impressed. Taking it, Inban promises to make the remedy and deliver it to Sui–no–Sato as soon as it is ready. Seeing as you have accomplished what you came to do, perhaps it is now time you return with Princess Kurenai to her village.","Kurenai is extremely grateful for all that you have done for her. She goes on to say that once Hisui awakens she is destined to return to the palace and reassume her responsibilities as the true Ruby Princess. While sad that doing so will require leaving the outside world, she is glad to have met and adventured with you. The greatest question of all, however, still hangs silently in the air: can Hisui be shaken from her sleep?"],"objectives":["Rendezvous with Kurenai.","Speak with Kurenai.","Use the kelp stalks at the designated location and slay the bloated yumemi that appears for its shell.","Deliver the bloated yumemi shell to Kurenai.","Speak with Kurenai."],"dialogue":[{"name":"SHIOSAI","text":"I will no longer question the princess's decisions. She was right not to give up, and I was wrong to try to persuade her to do otherwise."},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, are you ready to go? Good. Then let us immediately set out for Tamamizu."},{"name":"KURENAI","text":"While Sui–no–Sato has for the most part isolated itself from the rest of the world, we have had some little contact with the Kojin of the Blue. This, however, will be my first time visiting their village."},{"name":"KURENAI","text":"You have been there before? Excellent! Then, you should be able to show me around."},{"name":"KURENAI","text":"Tamamizu... It is not so different to that of our own village. Now, where should we begin our search for this ancient Kojin remedy?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We should ask some of our acquaintances for advice."},{"name":"A1","text":"We should find the Kojin who gave you the book of faerie tales."},{"name":"KURENAI","text":"Hm... While I have met some Kojin during their stay in our village, I am afraid I cannot recall who any of them are."},{"name":"KURENAI","text":"Ah, but wait─perhaps I spoke too soon! The merchant who gave me the tome..."},{"name":"KURENAI","text":"But of course! That is a brilliant idea!"},{"name":"KURENAI","text":"If I am not mistaken, he goes by the name of Inban. Let us go search him out!"},{"name":"INBAN","text":"...And who might we have here?"},{"name":"KURENAI","text":"It has been many years, so it is difficult to be absolutely sure, but I think this is Master Inban─the merchant I told you about."},{"name":"INBAN","text":"Hm? Inban? That is my name. Do we know each other from somewhere?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Does the name Kurenai ring a bell?"},{"name":"A2","text":"Surely, you must recognize her!"},{"name":"INBAN","text":"Kurenai? Yes. I remember now. You are the little girl from the palace. People grow so fast, they do. You have changed so much, I scarcely recognize you."},{"name":"INBAN","text":"Now that you mention it, perhaps there is something rather familiar about her."},{"name":"INBAN","text":"Oh, yes. I remember now. You are the little girl from the palace. People grow so fast, they do. You have changed so much, I scarcely recognize you."},{"name":"KURENAI","text":"Master Inban, I am glad to see you have not forgotten me. We have sought you out today to ask you something regarding the book of faerie tales you gave me long ago."},{"name":"INBAN","text":"Hahaha! I remember that one! What would you like to know?"},{"name":"INBAN","text":"You are looking to find a cure for your sleeping friend? A most noble cause, indeed!"},{"name":"INBAN","text":"I am an avid collector of ancient tomes. In one of them is the exact remedy you speak of─an elixir that can wake those who have fallen into a deep slumber."},{"name":"KURENAI","text":"Truly!? Then might you share with me the recipe, so I can recreate it?"},{"name":"INBAN","text":"The recipe should be easy to find─the necessary ingredients, on the other hand, not so much."},{"name":"KURENAI","text":"What do you mean?"},{"name":"INBAN","text":"To make this potion requires the shell of a bloated yumemi─a giant yumemi that has had over one hundred years to mature."},{"name":"INBAN","text":"Decades have passed since one of these was last spotted. Your only hope now would be to capture a yumemi larva and wait one hundred years for it to grow potent enough to make your cure."},{"name":"KURENAI","text":"No... That cannot be..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"It's too early to give up!"},{"name":"A3","text":"We will find a bloated yumemi!"},{"name":"KURENAI","text":"You are absolutely right. Just as you saved Shisui of the Violet Tides against all odds, so too must we rescue Hisui regardless of how hopeless it seems. We will find this mystical creature no matter how hard or long we must search."},{"name":"KURENAI","text":"You are absolutely right. Just because none have been spotted in recent times does not mean none exist. If we search hard enough, we are certain to come across one."},{"name":"INBAN","text":"Hm. Perhaps it is as you say: if you were to look hard enough, you will find one."},{"name":"INBAN","text":"If you are serious about this, I would suggest you begin your search in Exile. It was formerly considered a prime hunting ground for these creatures. Kelp was often used to lure them out of hiding."},{"name":"KURENAI","text":"Then I shall go and gather some straightaway!"},{"name":"INBAN","text":"Good. Gather the most succulent stalks you can find and take them into the cave. If any bloated yumemi are present, they will immediately be drawn to you."},{"name":"INBAN","text":"...Or perhaps you should have this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> here take them. You appear to be as strong as our gatekeeper, you do. No doubt you will be able to make quick work of whatever appears."},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, I shall meet you at Exile in a bit, kelp in hand."},{"name":"INBAN","text":"Were you not due to meet with your friend at Exile? You best not keep her waiting."},{"name":"KURENAI","text":"I made sure to collect the longest and most luscious stalks of kelp I could find. Here. The hunting grounds Master Inban mentioned are in the deep recesses of the cave just over there."},{"name":"KURENAI","text":"From what I gathered, the bloated yumemi's great age is what allows them to accumulate an incredible amount of magick─most of which is concentrated in their shell. We can only hope that, should one be here, it will be tempted out of hiding by the sweet smell of its favorite food."},{"name":"KURENAI","text":"From what I gathered, the bloated yumemi's great age is what allows them to accumulate an incredible amount of magick─most of which is concentrated in their shell. We can only hope that, should one be here, it will be tempted out of hiding by the sweet smell of its favorite food."},{"name":"INBAN","text":"A mixture of concern and curiosity brought me here. How is the hunt going?"},{"name":"SHIOSAI","text":"You have obtained the shell of a creature that is said to have vanished from these seas long ago... I am at a loss for words. You never cease to amaze me <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, Master Inban grew worried and kindly came to check upon us. Did you have any luck in the cave?"},{"name":"KURENAI","text":"I-Is this what I think it is? You did it, <span class=\"highlight\">Forename</span>. You have procured a bloated yumemi shell─perhaps the very last one in existence, even!"},{"name":"INBAN","text":"...So this is the shell rumored to be capable of curing any ailment. It looks nothing like that of a regular yumemi."},{"name":"INBAN","text":"That you were able to find one so quickly makes me wonder if the bloated yumemi is not as gone as we think. Mayhap they simply began burrowing deeper into the earth in response to our excessive hunting."},{"name":"INBAN","text":"I must make up for this grievous miscalculation. Please give me the shell. I shall make the remedy you seek and deliver it to Sui–no–Sato. It may take some time to prepare, but should be well worth the wait."},{"name":"KURENAI","text":"Thank you very much. Now Hisui might finally be saved from eternal slumber!"},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, once again, I am in your debt. Together let us return to Sui–no–Sato that we might share the story of your success with Shiosai!"},{"name":"KURENAI","text":"Shiosai has been duly informed of all that happened. When I told him of how you slayed the bloated yumemi, his eyes went wide and his mouth dropped. Hahaha! Rarely do I ever see him so surprised."},{"name":"KURENAI","text":"Then again, he has every right to be. Your efforts have allowed Master Inban to set upon making a remedy that should, in theory, have been impossible to recreate."},{"name":"KURENAI","text":"...Which reminds me. I believe I owe you an apology. You were only to escort me to Tamamizu, but due to my own inability, you were forced to do so much more than that."},{"name":"KURENAI","text":"Truly, I do not know what I would have done without you. In addition to saving my people you have opened up my eyes to the world. Through you, I have come to learn so much."},{"name":"KURENAI","text":"When I finally return to Shisui of the Violet Tides and reassume my role as the Ruby Princess, I shall look back fondly upon the memories we created together on this grand adventure."},{"name":"KURENAI","text":"Until such a time that Hisui awakens, however, I shall remain here. I sorely hope that you shall, too."}],"reward":{"gil":1300,"items":[{"id":18252,"one":1,"hq":1},{"id":18253,"one":1,"hq":1},{"id":18254,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68021,68241]},"next":[68243]},"partials":[{"type":"npc","id":"1023280","obj":{"i":1023280,"n":"Kurenai","l":2409,"q":5}},{"type":"npc","id":"1019197","obj":{"i":1019197,"n":"Shiosai","l":2409,"q":6}},{"type":"npc","id":"1023286","obj":{"i":1023286,"n":"Inban","l":2409,"q":1}},{"type":"npc","id":"1023287","obj":{"i":1023287,"n":"Kurenai","l":2409,"q":1}},{"type":"npc","id":"1023288","obj":{"i":1023288,"n":"Kurenai","l":2409,"q":1}},{"type":"npc","id":"1023289","obj":{"i":1023289,"n":"Inban","l":2409,"q":1}},{"type":"npc","id":"1023290","obj":{"i":1023290,"n":"Kurenai","l":2409,"q":1}},{"type":"item","id":"18252","obj":{"i":18252,"n":"Koppranickel Necklace of Fending","l":265,"c":54968,"t":40,"p":15741}},{"type":"item","id":"18253","obj":{"i":18253,"n":"Koppranickel Necklace of Slaying","l":265,"c":54968,"t":40,"p":15741}},{"type":"item","id":"18254","obj":{"i":18254,"n":"Koppranickel Necklace of Aiming","l":265,"c":54968,"t":40,"p":15741}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}},{"type":"quest","id":"68241","obj":{"i":68241,"n":"A Part of Your World","g":108,"l":"The Ruby Sea","s":3090}},{"type":"quest","id":"68243","obj":{"i":68243,"n":"The Two Princesses of Sui–no–Sato","g":108,"l":"The Ruby Sea","s":3110}}]}