{"quest":{"name":"Serpent Troubles","location":"The Ruby Sea","id":68248,"patch":4.0,"sort":3160,"eventIcon":71221,"issuer":1019181,"target":1019181,"involved":[1022051,1022052,1022053],"genre":108,"journal":["Takotsubo is excited to see you again."],"objectives":["Ride the striped ray and use its Double Bubble ability to drive the water serpents away.","Ride the striped ray and use its Double Bubble ability on the designated destination.","Report to Takotsubo."],"dialogue":[{"name":"TAKOTSUBO","text":"Hahaha! Welcome back, friend. You couldn't have come at a more fortuitous time."},{"name":"TAKOTSUBO","text":"Water serpents have recently settled near one of our village's entrances to lay their eggs. We need your help to drive them away."},{"name":"TAKOTSUBO","text":"The most effective way of doing so is to spray them with jets of bubbly water from a striped ray. These bubbles contain a special mucus, which emits a strong scent used to mark their territory. Water serpents hate the smell more than anything."},{"name":"TAKOTSUBO","text":"Once you have finished dispersing the snakes, I would ask that you then spray the surrounding area with the ray's bubbles to prevent their return."},{"name":"TAKOTSUBO","text":"All you need do is blow a stream of bubbles at the water snakes. They won't be able to slither away fast enough from the smell. After that you should spray the neighboring areas to prevent them from ever coming back."},{"name":"SYSTEM","text":"Shooing the water serpents has no effect. Mount a striped ray from Tamamizu, and use its Double Bubble ability to blast them away."},{"name":"SYSTEM","text":"Mount a striped ray from Tamamizu, and use its Double Bubble ability on the designated destination to keep the water serpents from returning."},{"name":"TAKOTSUBO","text":"Thank you, friend! Now everyone in Tamamizu can, once again, use that entrance without fear of running into those nasty water serpents."},{"name":"TAKOTSUBO","text":"&lt;sniff&gt; &lt;sniff&gt; You smell strongly of striped ray bubbles! Hahahaha! These graceful creatures are also in mating season, and it seems this one has taken such a liking to you that it has marked you as its very own!"},{"name":"TAKOTSUBO","text":"While we may find it as unpleasant as the serpents, the scent is irresistible to other striped rays."},{"name":"TAKOTSUBO","text":"You best wash yourself off quickly, else you will find yourself accosted by a swarm of lovesick rays. Hahahahaha!"}],"reward":{"gil":703,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68023,68246]}},"partials":[{"type":"npc","id":"1019181","obj":{"i":1019181,"n":"Takotsubo","l":2409,"q":3}},{"type":"npc","id":"1022051","obj":{"i":1022051,"n":"Spawning Serpent","l":2409,"q":1}},{"type":"npc","id":"1022052","obj":{"i":1022052,"n":"Spawning Serpent","l":2409,"q":1}},{"type":"npc","id":"1022053","obj":{"i":1022053,"n":"Spawning Serpent","l":2409,"q":1}},{"type":"quest","id":"68023","obj":{"i":68023,"n":"The Whims of the Divine","g":6,"l":"The Ruby Sea","s":420}},{"type":"quest","id":"68246","obj":{"i":68246,"n":"Forgotten Saviors of the Sea","g":108,"l":"The Ruby Sea","s":3150}}]}