{"quest":{"name":"Forgotten Saviors of the Sea","location":"The Ruby Sea","id":68246,"patch":4.0,"sort":3150,"eventIcon":71221,"issuer":1019181,"target":1019181,"genre":108,"journal":["Takotsubo casually waves you over."],"objectives":["Ride the striped ray and use its Double Bubble ability on any withered plants.","Report to Takotsubo."],"dialogue":[{"name":"TAKOTSUBO","text":"<span class=\"highlight\">Forename</span>, how good of you to come by. My striped ray will be very happy to see you again. Ever since you departed, she has been quite forlorn."},{"name":"TAKOTSUBO","text":"Would you be willing to take her out for another swim?"},{"name":"TAKOTSUBO","text":"Lately, I have taught her how to produce bubbles with her wings. Perhaps while you are out, you can use this new trick of hers to help clean up the area."},{"name":"TAKOTSUBO","text":"Since such a minuscule amount of light reaches this region, much of the seaweed and coral that grows here wilts. These clumps of dying plants, if left unattended, will begin to decay and pollute our village waters."},{"name":"TAKOTSUBO","text":"The most effective way to remove them from the soil is to have the striped rays blast them with air bubbles. Once uprooted, the water currents will see to the rest."},{"name":"TAKOTSUBO","text":"Simply have my striped ray blast the dying plants with her air bubbles. The uprooted plants will then drift away in the currents and our village will remain clean!"},{"name":"SYSTEM","text":"These plants are so slippery that uprooting them by hand appears impossible. Mount a striped ray from Tamamizu, and use its Double Bubble ability to blast the plants from the soil."},{"name":"TAKOTSUBO","text":"You have returned, friend! Thanks to you, the area around our village will remain clean for some time to come!"},{"name":"TAKOTSUBO","text":"&lt;sigh&gt; I just wish all the others realized how important a job this is. Sadly, they take our clean waters for granted. However, they will realize soon enough."},{"name":"TAKOTSUBO","text":"Ever since the imperials invaded Doma, the sea grows more unclean by the day. Our plants begin to die off much faster now and as a result the bigger fish have far less smaller fish to feed on."},{"name":"TAKOTSUBO","text":"If things continue to go on like this, the marine life around us will eventually perish, and so too will our village. I believe that the striped rays will help us put off this decline, but the others are yet to be convinced of their value."},{"name":"TAKOTSUBO","text":"Either way, thank you for taking my striped ray out and helping tidy up the village. I hope you come back and visit us again soon!"}],"reward":{"gil":635,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68023,68245]},"next":[68248]},"partials":[{"type":"npc","id":"1019181","obj":{"i":1019181,"n":"Takotsubo","l":2409,"q":3}},{"type":"quest","id":"68023","obj":{"i":68023,"n":"The Whims of the Divine","g":6,"l":"The Ruby Sea","s":420}},{"type":"quest","id":"68245","obj":{"i":68245,"n":"A Stroll along the Seabed","g":108,"l":"The Ruby Sea","s":3140}},{"type":"quest","id":"68248","obj":{"i":68248,"n":"Serpent Troubles","g":108,"l":"The Ruby Sea","s":3160}}]}