{"quest":{"name":"In Search of Treasure","location":"The Ruby Sea","id":68244,"patch":4.0,"sort":3120,"eventIcon":71221,"issuer":1023096,"target":1023096,"involved":[1023097],"genre":108,"journal":["The affable Kojin gazes at you with large, pondering eyes."],"objectives":["Speak with the affable Kojin. ","Search for seabed treasure.","Obtain seabed treasure from the roots of large seaweed stalks.","Deliver the seabed treasures to the affable Kojin."],"dialogue":[{"name":"LADYTURTLE02708","text":"Oh, would you look at that! We have a visitor, and not just any visitor but one from the above!"},{"name":"LADYTURTLE02708","text":"Might I ask you help with something? You see, I would like to go treasure hunting but need someone to accompany me. If I go with one of the other villagers, they will try to take more than their fair share of our find."},{"name":"LADYTURTLE02708","text":"You from the surface, however, have no interest in treasure, only koban. For your help you shall receive a handsome sum, so what do you say? If you are willing to join me, meet me outside the Tamamizu gates in a quarter bell."},{"name":"LADYTURTLE02708","text":"Thank you for coming, my good <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">sir</span></span>! Before we begin hunting for treasure in earnest, let us go over the basics. Do you see those great columns of seaweed below us?"},{"name":"LADYTURTLE02708","text":"Treasures are often carried into the areas surrounding our village by the ocean currents and become entangled in the roots and stalks of larger clumps of plants like those."},{"name":"LADYTURTLE02708","text":"If you do a bit of tugging on the stalks and rummage about the roots, treasure should appear! Go ahead, and give it a try!"},{"name":"LADYTURTLE02708","text":"Try digging about the roots and looking at the stalks of those large columns of weeds over there."},{"name":"LADYTURTLE02708","text":"Excellent work, for a beginner! Now let us move on to doing some actual treasure hunting! Oh, and remember not to waste your time searching the smaller clumps of grass. Treasures rarely─if ever─get stuck in them."},{"name":"LADYTURTLE02708","text":"Please go and search the waters near Sui–no–Sato and to the rear of our village. I shall poke about the other areas."},{"name":"LADYTURTLE02708","text":"Once you have collected all the treasure to be found there, I ask that you return to Tamamizu and deliver them to me there."},{"name":"LADYTURTLE02708","text":"So how did the hunting go?"},{"name":"LADYTURTLE02708","text":"You have brought back a bounty of porcelain plates, bottles and look─this is a torn zabuton cushion! This is one of the rarer treasures I have possessed to date!"},{"name":"LADYTURTLE02708","text":"Ah, but you bore of this talk. After all, your kind only has an eye for koban. That you would not desire to own such exquisite objects─you are a very strange people, indeed."},{"name":"LADYTURTLE02708","text":"I suppose, however, I must be thankful for it because that means all the more treasure for us! Haha! Thank you for your help in gathering these for me, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I cannot wait to take them home!"}],"reward":{"gil":770,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68023]}},"partials":[{"type":"npc","id":"1023096","obj":{"i":1023096,"n":"Affable Kojin","l":2409,"q":1}},{"type":"npc","id":"1023097","obj":{"i":1023097,"n":"Affable Kojin","l":2409,"q":1}},{"type":"quest","id":"68023","obj":{"i":68023,"n":"The Whims of the Divine","g":6,"l":"The Ruby Sea","s":420}}]}