{"quest":{"name":"A Part of Your World","location":"The Ruby Sea","id":68241,"patch":4.0,"sort":3090,"icon":100699,"eventIcon":71221,"issuer":1023280,"target":1023280,"involved":[1019197,1023282,1023283,1023284,1023285],"genre":108,"journal":["The Ruby Princess is waiting for you to join her.","The Ruby Princess would like to look into the origins of a peculiar faerie tale regarding a sea-faring fisherman and a princess who had been plunged into a years-long slumber. She believes the island of Onokoro holds some of the answers she seeks.","You seek out the princess, who has been approached by one of the natives of the island─a Confederate pirate. While he starts to get a bit smart with you, it does not take long for him to recognize exactly who you are. Brushing it off as a joke, he then urges you to speak with a fisherman who comes to visit the island once a year. According to the pirate this man knows a great deal about faerie tales, and is currently docked at the Quickscape Pier.","As the fisherman tells it: long ago a Kojin of the Blue was saved from certain death by a Hyuran fisherman. The grateful Kojin rewarded this man with the promise of an adventure and a vial of liquid that would allow him to breathe indefinitely underwater. Following him to the depths of the seas, the fisherman and Kojin traveled together, eventually coming across a princess who had been asleep for years in her palace. The Kojin, seeing this, produced another vial that instantly woke the princess. Hearing this story, Kurenai concludes the palace mentioned in the faerie tale is Shisui of the Violet Tides and would like to return to Sui–no–Sato to conduct further investigations.","Kurenai and you are joined by Shiosai, the overseer. After informing him of all that you have learned from your trip to the surface, he reveals that one of the ancient stories of Sui–no–Sato spoke of a Ruby Princess who wed a Hyuran man. Suspecting that the fisherman's faerie tale is closer to an account of historical events, Kurenai would like to travel with you to Tamamizu to ask the Kojin of the Blue about the elixir for eternal sleep."],"objectives":["Speak with Kurenai.","Speak with the elderly fisherman.","Speak with Kurenai."],"dialogue":[{"name":"SHIOSAI","text":"Her Grace will be devastated to learn that Lady Hisui will never again open her eyes."},{"name":"SHIOSAI","text":"A trip to the above will put off her anguish and allow her to grow more accustomed to living in a world without her closest friend."},{"name":"KURENAI","text":"You are ready to depart? Excellent. Let us make for Onokoro. I believe we will best be served by beginning our search there."},{"name":"KURENAI","text":"You see, while we have next to no contact with the outside world, we do receive the occasional visit from the Kojin of the Blue."},{"name":"KURENAI","text":"During one such visit, I was given a tome filled with faerie tales. It was old, worn, and─from what I am given to understand─written in Kugane."},{"name":"KURENAI","text":"In it was a story about a fisherman who sailed the Ruby Sea. While traveling, he came across a princess who had fallen into a years-long slumber. She was eventually awakened upon taking an elixir of some sort. "},{"name":"KURENAI","text":"What intrigues me, however, is the fact that many of the places this fisherman visited exist in the real world. It makes me wonder if, perhaps, this story is rooted in reality."},{"name":"KURENAI","text":"The tale begins in Onokoro. I trust you will escort me there?"},{"name":"KURENAI","text":"Thank you. Now, let us depart without any further ado."},{"name":"SHIOSAI","text":"It seems Her Grace is determined to go to Onokoro. Of all places, why must she have chosen an island frequented by bloodthirsty pirates? Please, whatever happens, see that no harm comes to her."},{"name":"PIRATE02705","text":"Apologies, my friend, but I will not be able to help you right now. I must give this young lady a tour of our island."},{"name":"KURENAI","text":"So this is Onokoro... It is a lovely place. The people here are incredibly warm. Take this gentleman, for example. As soon as I set foot on the island, he offered to take me on a tour."},{"name":"PIRATE02705","text":"Hm? ...What are <span class=\"emphasis\">you</span> looking at?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Get lost!"},{"name":"A1","text":"..."},{"name":"PIRATE02705","text":"Get lost!? Why don't <span class=\"emphasis\">you</span> get lost!"},{"name":"PIRATE02705","text":"So you're going to stand there and ignore me? Is that it, then?"},{"name":"PIRATE02705","text":"...Wait a minute! I-I know you! My comrades talk about you all the time. M-My apologies, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! I was only just joking with you, of course!"},{"name":"PIRATE02705","text":"One can never have enough rich or powerful friends. That is why I approached your young charge. Figured if I helped her now, she'd someday return the favor, should I ever need it. So what brings you to our island?"},{"name":"PIRATE02705","text":"You are looking to learn more about a faerie tale? Hm... I know nothing of faeries or tales, but mayhap I can direct you to someone who does."},{"name":"PIRATE02705","text":"There is a fisherman who visits us once a year to hunt for treasure. Some of the men here say he is as old as the seas themselves. I reckon he, of anyone, would be able to tell you your story."},{"name":"PIRATE02705","text":"Luckily for you, he just arrived the other day. You should be able to find him at the Quickscape Pier."},{"name":"KURENAI","text":"Thank you for your assistance, sir. We will go speak with him right now."},{"name":"PIRATE02705","text":"Not to worry, little lady. Just be sure to remember my name and pay me back when the time comes."},{"name":"KURENAI","text":"...Er─<span class=\"highlight\">Forename</span>, did the kind gentleman ever give us his name? "},{"name":"KURENAI","text":"Without a name, I am afraid I will be unable to send him payment for his help. 'Tis terribly unfortunate but there is little that can be done. &lt;sigh&gt; Now let us promptly make for Quickscape Pier. We do not want to miss the fisherman."},{"name":"KURENAI","text":"Is this the right place? This man looks as though he could be the fisherman the man from earlier mentioned."},{"name":"FISHERMAN02705","text":"Hello there. Is there something you need?"},{"name":"FISHERMAN02705","text":"The tale of the fisherman and the Ruby Sea... Ah, yes, indeed. It has been a long time since I heard that one. I believe it was my great-grandfather who told me. Or perhaps, my great-great-grandfather. Or perhaps my─"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"It doesn't matter who you heard it from─just tell us the story already!"},{"name":"A2","text":"That is all good and well, sir, but if you could please just tell us the story..."},{"name":"FISHERMAN02705","text":"Ohoho! My apologies. You are right─that particular detail is not relevant to the tale. Hm...let us see if I can remember how it went."},{"name":"FISHERMAN02705","text":"Ah, yes. My apologies. Hm...let us see if I can remember how it went."},{"name":"KURENAI","text":"Oh, I very much hope you have not forgotten it. We might never know the whole tale if you have. The tome I received as a child was so tattered, I could only read bits and pieces of the story."},{"name":"FISHERMAN02705","text":"I recall now... Once upon a time, there was a fisherman on the island of Onokoro who saved a Kojin of the Blue from the maws of a terrible beast."},{"name":"FISHERMAN02705","text":"As thanks, the Kojin offered him a vial of liquid. When taken, it would allow the fisherman to plunge into the far depths of the ocean without drowning. It was there that their journey together began."},{"name":"FISHERMAN02705","text":"They visited temples, palaces, and villages under the sea. They met all manner of men, women, and creatures...including a beautiful princess, who had fallen into a deep, deep slumber. According to her people, she had been like that for years."},{"name":"FISHERMAN02705","text":"Hearing this, the Kojin pulled out another vial containing an ancient Tamamizu potion, which had been passed down to him from his great-grandfather. Or perhaps his great-great-grandfa─ Ahem. To continue with the story, upon being given this mixture the princess was instantly awakened."},{"name":"FISHERMAN02705","text":"The moment their eyes met, she and the fisherman fell in love. They were immediately wed in a palace at the bottom of the sea, where they lived happily ever after."},{"name":"KURENAI","text":"Thank you, sir, for taking the time to recount that regaling tale. It was truly enlightening."},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, from what we heard I can only assume this story took place at Shisui of the Violet Tides. Perhaps we should return to Sui–no–Sato and see if we cannot dig up any mention of this incident."},{"name":"KURENAI","text":"Again, thank you very much, sir. You are a man of great wisdom."},{"name":"FISHERMAN02705","text":"A man of great wisdom? What a kind young lady. Most people never ask me to tell them stories, and on the rare occasion they do, they complain at length afterward."},{"name":"FISHERMAN02705","text":"You seem to also enjoy my tales. If you are interested, maybe someday I can tell you the tale of how my great-great-great-great-grandfather discovered this place."},{"name":"SHIOSAI","text":"Her Grace has returned safe and sound. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. From what I understand, your journey to the above proved to be quite fruitful?"},{"name":"KURENAI","text":"While I know little of what life is like on the surface, it seems to be a lovely place. The people are incredibly kind."},{"name":"KURENAI","text":"I grew up listening to stories of how pirates would slit your throat the first chance they got but those on Onokoro seemed...rather cordial. Though perhaps I have your presence, in part, to thank for that."},{"name":"KURENAI","text":"Shiosai shall be joining us shortly. Most stories in Sui–no–Sato are passed down orally. He should be able to tell us if any of our own stories match the tale the fisherman recounted for us."},{"name":"SHIOSAI","text":"A tale in which a Hyuran fisherman and a princess were brought together by a Kojin and wed in a palace under the sea...?"},{"name":"KURENAI","text":"It sounds almost as if it is a story about Shisui of the Violet Tides."},{"name":"KURENAI","text":"Though, the part about the Ruby Princess marrying a Hyur might be something of an embellishment..."},{"name":"SHIOSAI","text":"To the contrary, Your Grace. I believe generations back, a Ruby Princess and a Hyuran man were once joined in holy matrimony. The son they bore was said to have had almost no scales."},{"name":"SHIOSAI","text":"Until now, I had considered it to merely be a tall tale spun by the elders for their grandchildren. Yet, it is possible that the story is true."},{"name":"KURENAI","text":"Then there is a chance that the remedy also exists!"},{"name":"SHIOSAI","text":"It is not impossible."},{"name":"SHIOSAI","text":"Your Grace, I must apologize to you. If I were being completely honest, I thought all hope for Lady Hisui's recovery was lost. What you tell me, however, has revived my hope."},{"name":"SHIOSAI","text":"You are a born leader. Through your actions you have reversed all our fates."},{"name":"KURENAI","text":"That is incredibly kind of you to say, but without this wonderful <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> beside me, we would never have come so far."},{"name":"SHIOSAI","text":"Indeed. <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, please accept my deepest thanks. So long as you are here, I can rest knowing that Her Grace and our village will remain safe."},{"name":"SHIOSAI","text":"Now, Your Grace, I suppose you are about to announce your intention to travel to where the Kojin of the Blue reside in search of this miracle cure? I wish you safe travels."},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, at long last, I can see the light! Hisui might finally be saved!"}],"reward":{"gil":1000,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68021,68240]},"next":[68242]},"partials":[{"type":"npc","id":"1023280","obj":{"i":1023280,"n":"Kurenai","l":2409,"q":5}},{"type":"npc","id":"1019197","obj":{"i":1019197,"n":"Shiosai","l":2409,"q":6}},{"type":"npc","id":"1023282","obj":{"i":1023282,"n":"Kurenai","l":2409,"q":1}},{"type":"npc","id":"1023283","obj":{"i":1023283,"n":"Boisterous Pirate","l":2409,"q":1}},{"type":"npc","id":"1023284","obj":{"i":1023284,"n":"Kurenai","l":2409,"q":1}},{"type":"npc","id":"1023285","obj":{"i":1023285,"n":"Elderly Fisherman","l":2409,"q":1}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}},{"type":"quest","id":"68240","obj":{"i":68240,"n":"Fathoms Below","g":108,"l":"The Ruby Sea","s":3080}},{"type":"quest","id":"68242","obj":{"i":68242,"n":"The Elixir of Life","g":108,"l":"The Ruby Sea","s":3100}}]}