{"quest":{"name":"At the Mercy of Monsters","location":"The Ruby Sea","id":68249,"patch":4.0,"sort":3170,"eventIcon":71221,"issuer":1019229,"target":1019229,"genre":108,"journal":["Abiki looks at you appraisingly."],"objectives":["Survey the designated location and slay the isonade that appear.","Report to Abiki."],"dialogue":[{"name":"ABIKI","text":"Ah, you must be one of those─what are they called again? Adventurers? Yes, I can see it in your eyes. You are used to battle. In fact, I think a part of you even thrives on it."},{"name":"ABIKI","text":"All of us on this island are, in contrast, but humble fishermen. We know not how to fight. This is problematic as lately we have been plagued by terrible monsters, which come to devour the fish from our nets and threaten our very livelihood."},{"name":"ABIKI","text":"In fact, just the other day, they completely destroyed our fishing grounds near Onokoro. I fear should this continue, our village will no longer be able to sustain itself."},{"name":"ABIKI","text":"Thus, I turn to you for aid. Might you dispatch of them for us? You will, of course, be compensated for your services."},{"name":"ABIKI","text":"The beasts are to the north of here. Please, see that they are slain!"},{"name":"ABIKI","text":"To the north of here are the terrible beasts that wreck our village and threaten our survival. Please, I beg of you, see that they are slain at all costs."},{"name":"ABIKI","text":"Adventurer, you have returned. Those flecks of blood upon you─it appears we need not worry about the monsters any more. Thank you."},{"name":"ABIKI","text":"&lt;sigh&gt; In a time before the Empire occupied Doma, our men were as adept at wielding swords as they were rods. They would gather together in the village then head out to slaughter whoever or whatever disturbed us. Now, however, such action would be considered an attempt at rebellion."},{"name":"ABIKI","text":"We were extremely fortunate to have you visit when you did. Please, come back to our island any time. We will be sure to give you a warm welcome when you do."}],"reward":{"gil":602,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68026]}},"partials":[{"type":"npc","id":"1019229","obj":{"i":1019229,"n":"Abiki","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}}]}