{"quest":{"name":"Fathoms Below","location":"The Ruby Sea","id":68240,"patch":4.0,"sort":3080,"icon":100699,"eventIcon":71221,"issuer":1023280,"target":1023280,"involved":[1019197,1023281],"genre":108,"journal":["Kurenai is ready to divulge her great secret.","Kurenai attempts to tell you the truth but is unsure of where to begin. She asks that you accompany her to where the Ruby Princess is resting, believing that looking upon her visage will make it a little easier for you to understand what she is about to explain.","Kurenai has Shiosai bring out the Ruby Princess, and together they disclose that she is, in fact, Hisui─lady-in-waiting to the true Ruby Princess, who is none other than Kurenai herself. When guests from the outside were invited into the palace to conduct a secret ceremony, Hisui had assumed the Ruby Princess's identity to prevent any danger from befalling the true heiress to the throne. As such, when proceedings took a dark turn, it was Hisui who became possessed by the void spirits that were summoned, leading to her current comatose state. Upon revealing this to you, Kurenai announces her intention to leave Sui–no–Sato for the upper world in search of a cure for Hisui. Shiosai, who has been ordered to stay behind, begs you go with her.","Kurenai is overjoyed to learn that you will be accompanying her on her journey outside of Sui–no–Sato. It seems the fates of both the Ruby Princess and her dearest friend, Hisui, now rest squarely upon your shoulders."],"objectives":["Speak with Kurenai."],"dialogue":[{"name":"SHIOSAI","text":"We, the Raen, created this sanctuary under the sea that we might live in peace, away from the wars that waged on the surface. For so long we have been isolated that to seek aid from above has become an alien concept to us."},{"name":"SHIOSAI","text":"If Lady Kurenai did not have the insight to turn to you for help, all those in the palace would be gone, as would I..."},{"name":"KURENAI","text":"The hour of truth is upon us, yet I am just unsure of where to begin..."},{"name":"KURENAI","text":"The Ruby Princess, who quietly slumbers on, she..."},{"name":"KURENAI","text":"&lt;sigh&gt; Perhaps this will be easier to explain if you could look upon her as I speak. Please, follow me."},{"name":"KURENAI","text":"Shiosai will be bringing her out shortly. He should be but a few moments longer."},{"name":"KURENAI","text":"Oh, Hisui, why...why do you refuse to open your eyes?"},{"name":"KURENAI","text":"&lt;sigh&gt; <span class=\"highlight\">Forename</span>, there is something you must know."},{"name":"KURENAI","text":"I am not the Ruby Princess's younger sister. In fact, she has no sister."},{"name":"KURENAI","text":"<span class=\"emphasis\">I</span> am the Ruby Princess, ruler of Sui–no–Sato."},{"name":"KURENAI","text":"The slumbering girl before you goes by the name of Hisui, and is my dearest friend. We have known one another since childhood."},{"name":"SHIOSAI","text":"Your Grace, I am entirely to blame. Had I been more prepared─more aware─Lady Hisui would not be in this sorry state..."},{"name":"SHIOSAI","text":"You see, a few days ago we received visitors from the outside. They had come to perform a court ritual. To protect the Ruby Princess from any potential dangers, we decided to conceal her true identity."},{"name":"SHIOSAI","text":"I had her lady-in-waiting, Hisui, take her place. As she and Her Highness bear a great resemblance to each other─something owing to the fact that they are distant blood relatives─I was confident no one would notice the switch."},{"name":"SHIOSAI","text":"I was right. That is why, when proceedings commenced, it was Lady Hisui who became possessed by the terrible fiend they summoned and now...well, you can see for yourself what has become of her."},{"name":"SHIOSAI","text":"To mitigate such disaster, severe restrictions on who can enter and exit Shisui of the Violet Tides have always been in place. In fact, even the Ruby Princess is forbidden by law to leave its gates."},{"name":"SHIOSAI","text":"When wraith after wraith began appearing, however, I was left with little choice. I whisked Her Highness away to the village and had her pretend to be the Ruby Princess's sister, Kurenai."},{"name":"KURENAI","text":"Kurenai... That was the name I had before my mother passed away and I assumed the title of Ruby Princess. It was also the name Hisui would call me by growing up."},{"name":"KURENAI","text":"For as far back as I can remember, she was there for me─from the best of times to the worst of times. All the laughter and tears we shared... Hisui, is this truly where it ends?"},{"name":"SHIOSAI","text":"Forgive me, Your Grace. This is my fault. If only there was a way I could go back and prevent all this..."},{"name":"KURENAI","text":"Shiosai, there is nothing to forgive. None of us could have predicted this would happen. You are no more to blame for what has happened than I am. "},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, now you know everything. I hope you do not think any less of me for my lie."},{"name":"KURENAI","text":"Now that everything here has been settled, I shall be departing from Sui–no–Sato."},{"name":"KURENAI","text":"The cure to Hisui's condition can only be found above. I know this because, as Ruby Princess, it was my duty to study all the available writings at the palace."},{"name":"SHIOSAI","text":"Very well, Your Grace. Where would you have us go?"},{"name":"KURENAI","text":"No, Shiosai. I shall be embarking upon this quest on my own. You will be staying here. The people need you to protect them in my absence."},{"name":"SHIOSAI","text":"Her Grace has made it clear she would have me remain behind. <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, might you accompany her in my stead?"},{"name":"SHIOSAI","text":"While Lady Hisui's body remains, her soul has long departed. I fear that no amount of rest or magicks can cure her..."},{"name":"SHIOSAI","text":"I can only hope that in traveling with you, it will make it easier for Her Grace to come to terms with the tragic fate of her friend. Until such a time she must face this truth, however, I ask─nay, beg─that you keep her safe."},{"name":"SHIOSAI","text":"Her Grace will be devastated to learn that Hisui will never again open her eyes."},{"name":"SHIOSAI","text":"A trip to the above with you will put off her anguish and allow her to grow more accustomed to living in a world without her closest friend."},{"name":"KURENAI","text":"You are offering to accompany me on my travels? That is incredibly generous of you. Thank you."},{"name":"KURENAI","text":"I shall give you some time to prepare before leaving Sui–no–Sato. Please come find me as soon as you are ready to go."}],"reward":{"gil":1000,"items":[{"id":18265,"one":1,"hq":1},{"id":18266,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68021,68168]},"next":[68241]},"partials":[{"type":"npc","id":"1023280","obj":{"i":1023280,"n":"Kurenai","l":2409,"q":5}},{"type":"npc","id":"1019197","obj":{"i":1019197,"n":"Shiosai","l":2409,"q":6}},{"type":"npc","id":"1023281","obj":{"i":1023281,"n":"Kurenai","l":2409,"q":2}},{"type":"item","id":"18265","obj":{"i":18265,"n":"Muudhorn Ring of Healing","l":265,"c":54621,"t":43,"p":15741}},{"type":"item","id":"18266","obj":{"i":18266,"n":"Muudhorn Ring of Casting","l":265,"c":54621,"t":43,"p":15741}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}},{"type":"quest","id":"68168","obj":{"i":68168,"n":"The Palace of Lost Souls","g":108,"l":"The Ruby Sea","s":3075,"f":1}},{"type":"quest","id":"68241","obj":{"i":68241,"n":"A Part of Your World","g":108,"l":"The Ruby Sea","s":3090}}]}