{"quest":{"name":"A Stroll along the Seabed","location":"The Ruby Sea","id":68245,"patch":4.0,"sort":3140,"eventIcon":71221,"issuer":1019181,"target":1019181,"genre":108,"journal":["Takotsubo is searching for someone to take his striped ray out for a swim."],"objectives":["Pass through the first marker on the striped ray.","Pass through the second marker on the striped ray.","Pass through the third marker on the striped ray.","Pass through the fourth marker on the striped ray.","Pass through the fifth marker on the striped ray.","Pass through the sixth marker on the striped ray.","Pass through the seventh marker on the striped ray.","Pass through the final marker on the striped ray.","Report to Takotsubo."],"dialogue":[{"name":"TAKOTSUBO","text":"Hello, hello! Welcome to Tamamizu, friend. A <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> from the surface, though you may be, I sense you enjoy swimming a great deal. You would get along quite well with my striped ray here."},{"name":"TAKOTSUBO","text":"More than anything, she loves to wade through the waters and eat the small fish as she goes."},{"name":"TAKOTSUBO","text":"She would be over the moon if you would take her for a quick swim around the village."},{"name":"TAKOTSUBO","text":"Did she buck you off or did you fall, friend? Hahaha! Either way, if you are willing to give it another try, I am sure she is, too!"},{"name":"TAKOTSUBO","text":"Welcome back! I trust you enjoyed the ride? By the swishing of her tail, I can tell my striped ray, certainly did! Or, perhaps, she simply ate something that did not sit right with her."},{"name":"TAKOTSUBO","text":"Hahaha! She devours everything that crosses her path, especially things that glisten. Once she swallowed an entire coffer's worth of gold coins we found on a sunken ship!"},{"name":"TAKOTSUBO","text":"In any case, I thank you for taking her out. Do be sure to come back to visit sometime. She has taken quite a shine to you!"}],"reward":{"gil":905,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68023]},"next":[68246]},"partials":[{"type":"npc","id":"1019181","obj":{"i":1019181,"n":"Takotsubo","l":2409,"q":3}},{"type":"quest","id":"68023","obj":{"i":68023,"n":"The Whims of the Divine","g":6,"l":"The Ruby Sea","s":420}},{"type":"quest","id":"68246","obj":{"i":68246,"n":"Forgotten Saviors of the Sea","g":108,"l":"The Ruby Sea","s":3150}}]}