{"quest":{"name":"A True Kojin of the Blue","location":"The Ruby Sea","id":68247,"patch":4.0,"sort":3130,"eventIcon":71221,"issuer":1019179,"target":1019179,"genre":108,"journal":["Saikoro's entire countenance reeks of desperation."],"objectives":["Survey the designated locations.","Speak with Saikoro.","Defeat the shiranui and obtain the wakizashi.","Deliver the wakizashi to Saikoro."],"dialogue":[{"name":"SAIKORO","text":"Thank the kami for finally sending someone who I can turn to for help! Please, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, I need you to do me a favor, but it is something that must stay between us."},{"name":"SAIKORO","text":"The other day, I was out for a stroll in the <span class=\"emphasis\">Kobayashi Maru</span> to the northeast of here when I came across a wakizashi. It was beautiful. When I went to grab it, however, this ghastly tentacled creature appeared from nowhere and chased me away!"},{"name":"SAIKORO","text":"I want that wakizashi so badly, but if I appeal to anyone here for assistance, they will laugh in my face again and call me a coward. Might you go there and obtain it for me?"},{"name":"SAIKORO","text":"Please, bring me the wakizashi I spotted in the <span class=\"emphasis\">Kobayashi Maru</span>. It is to the northeast of here. Once I get it, maybe then everyone will stop teasing me!"},{"name":"SYSTEM","text":"You thoroughly search the area but are unable to find the wakizashi."},{"name":"SAIKORO","text":"It was not there? Bah! That vile creature must have wrapped its slimy arms around it and taken it back to its home, then!"},{"name":"SAIKORO","text":"Please, you must track it down and seize my wakizashi from it. It is likely in Onokoro with all the other...&lt;shudder&gt;...sh-shiranui."},{"name":"SAIKORO","text":"Those gruesome beasts all look very similar so you may have to confront a few of them before you find the one with my wakizashi."},{"name":"SAIKORO","text":"Were you able to find my wakizashi?"},{"name":"SAIKORO","text":"Yes─this is it! Haha! At long last I have obtained my first treasure! Now I am a true Kojin of the Blue!"},{"name":"SAIKORO","text":"While I might not be the bravest, I do have the rare gift of seeing through people. Right away, I knew you were a kind and trustworthy individual."},{"name":"SAIKORO","text":"This ability has served me well in trading and has allowed me to establish many good relationships with the people around me─such as yourself! May our friendship last a lifetime!"}],"reward":{"gil":770,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68023]}},"partials":[{"type":"npc","id":"1019179","obj":{"i":1019179,"n":"Saikoro","l":2409,"q":1}},{"type":"quest","id":"68023","obj":{"i":68023,"n":"The Whims of the Divine","g":6,"l":"The Ruby Sea","s":420}}]}