{"quest":{"name":"The Two Princesses of Sui–no–Sato","location":"The Ruby Sea","id":68243,"patch":4.0,"sort":3110,"icon":100699,"eventIcon":71221,"issuer":1023280,"target":1023291,"involved":[1019197,1023281,1023292],"genre":108,"journal":["The Ruby Princess impatiently awaits Inban's arrival.","Master Inban has yet to arrive with the medicine, and the Ruby Princess grows restless. She would like to check upon the condition of her friend while she waits and requests that you accompany her to where Hisui sleeps.","You, Shiosai, and Princess Kurenai are gathered around Hisui, whose eyes remain closed. As you speculate what may have caused her to fall into her deep slumber, Master Inban finally arrives with the fabled elixir. He tells you that pouring the magical liquid over her will revitalize her spirit. Princess Kurenai taking the potion, sprinkles it over her lady-in-waiting, who almost immediately awakens. Everyone is overjoyed, but celebrations are cut short when Shiosai announces that the Ruby Princess must now return to the palace.","The Ruby Princess gives you a heartfelt good-bye. She tells you of how Shiosai has agreed to allow her to sneak into the village on special occasions during which Hisui will stay at the palace and stand in as her. After telling you she is certain your paths will cross in the future, she gives you a small bow before turning and walking back toward Shisui of the Violet Tides."],"objectives":["Speak with Kurenai."],"dialogue":[{"name":"SHIOSAI","text":"To hear that Hisui might soon open her eyes fills me with joy beyond belief."},{"name":"SHIOSAI","text":"Her recovery, however, will mark the end of Her Grace's travels, for she will be required to return to Shisui of the Violet Tides and resume her place as Ruby Princess."},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, Master Inban has yet to arrive with the elixir, but we must not allow ourselves to grow impatient. He will come to us as soon as it is ready."},{"name":"KURENAI","text":"The longer we wait, however, the more I worry about Hisui. Shiosai assures me she is doing well and that, thanks to one of our own ancient remedies, her bones and muscles remain strong. Even so, I feel compelled to confirm this with my own eyes. Let us go to her."},{"name":"KURENAI","text":"I am having her brought from her room. It should not be much longer."},{"name":"KURENAI","text":"Looking upon her, I am reminded of the Ruby Princess from the faerie tale... &lt;sigh&gt; What causes you to continue sleeping, my friend?"},{"name":"SHIOSAI","text":"Initially, I had feared the voidsent that possessed her had driven her soul from her body."},{"name":"SHIOSAI","text":"Now I suspect Hisui's spirit has simply gone dormant. It is attempting to recuperate from the trauma it endured. Master Inban's elixir will likely restore what vitality has been lost."},{"name":"INBAN","text":"(-???-)Indeed, that is correct!"},{"name":"KURENAI","text":"Master Inban!"},{"name":"INBAN","text":"I have brought the elixir!"},{"name":"INBAN","text":"In the olden days, we would sprinkle this over the eggs that refused to hatch. It would serve to strengthen the soul of the Kojin within."},{"name":"KURENAI","text":"Sprinkle? Do you mean to say Hisui does not need to drink this remedy to recover?"},{"name":"INBAN","text":"<span class=\"emphasis\">Drink</span> it!? There is no need for that! All we need do is pour this over your friend. Here. I made plenty."},{"name":"KURENAI","text":"Hisui!"},{"name":"KURENAI","text":"You are awake! Thank the kami, you are finally awake! I am sorry for everything."},{"name":"HISUI","text":"...Princess. I...I... What are you talking about?"},{"name":"HISUI","text":"To think that you had to travel so far and overcome so many obstacles to save me... I know not how to thank you."},{"name":"KURENAI","text":"Nay, 'tis I who must thank you."},{"name":"HISUI","text":"Think nothing of it, princess. As your lady-in-waiting, it is my duty above all else to ensure that you are protected."},{"name":"KURENAI","text":"Oh, Hisui... Truly, I am blessed to have you in my life."},{"name":"INBAN","text":"The girls─they are identical. I cannot, for the life of me, tell them apart."},{"name":"SHIOSAI","text":"Indeed. There is a great resemblance."},{"name":"SHIOSAI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, now that Lady Hisui has awakened, Her Grace must return to the palace and resume her duties there at once."},{"name":"SHIOSAI","text":"While I will ask that you say your farewells to her here, I do hope that this is not the last you will see of each other. I have watched Her Grace blossom into an intelligent and capable young lady under your care. It has made me think that being sequestered in a castle is not the best way to raise our rulers."},{"name":"SHIOSAI","text":"You have saved us in more ways than I can count and taught us so much. Sui–no–Sato is forever changed because of you. Thank you. Thank you for everything."},{"name":"KURENAI","text":"...So it is here that our grand adventure together draws to a close. I, however, would like to enjoy your company for just a bit longer. Please allow me to escort you to the gates."},{"name":"SHIOSAI","text":"As you like saw for yourself, Lady Hisui and Her Grace are near identical. Even I sometimes struggle to tell them apart."},{"name":"HISUI","text":"We must return to the palace soon. Were the people to learn that the Ruby Princess left the palace, we will risk losing their trust."},{"name":"KURENAI","text":"I shall forever cherish my memories of our travels together. Whenever I look back upon them, they will fill my heart with a serene happiness."},{"name":"HISUI","text":"You came from afar and braved the depths of the sea all so that you might rescue a sleeping princess. The story has a familiar ring to it does it not?"},{"name":"KURENAI","text":"Indeed. And just as with the tale of the fisherman, mayhap someone somewhere has recorded our story, too."},{"name":"KURENAI","text":"Sadly, this is where I must part ways with you. It is time for me to return to the palace. Farewell, <span class=\"highlight\">Forename</span>, farewell, Sui–no–Sato─or rather: until next time!"},{"name":"HISUI","text":"With me to take Her Highness' place while she is away, I do not imagine it should be too hard for her to sneak out whenever she pleases."},{"name":"KURENAI","text":"Even Shiosai has difficulty telling us apart. All we need do is exchange clothes and no one will be any the wiser!"},{"name":"KURENAI","text":"To prove my point, here is a quick test for you─look very closely and tell me: am I Kurenai...or am I Hisui?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You are Princess Kurenai!"},{"name":"A1","text":"...You must be Hisui."},{"name":"KURENAI","text":"Haha! If you thought you could tell us apart by our clothes, you were mistaken! Just earlier we swapped garb and I am, in fact, Hisui."},{"name":"HISUI","text":"Despite the numerous journeys we embarked on together, it seems even you cannot tell us apart..."},{"name":"KURENAI","text":"Hisui, let us leave it at that. I think perhaps we have teased <span class=\"highlight\">Forename</span> enough for one day."},{"name":"KURENAI","text":"Just as you have guessed, I am the real Kurenai. You always were incredibly perceptive."},{"name":"KURENAI","text":"I must admit I am impressed. To think that you could tell the two of us apart despite the fact Princess Kurenai and I swapped garb earlier... Well done! Just as you have guessed, I am Hisui."},{"name":"HISUI","text":"My apologies. I am terribly confused, Your Highness. I am the real Hisui."},{"name":"KURENAI","text":"&lt;sigh&gt; My dear Hisui, you have sucked all of the fun out of my little trick!"},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, it is as she says─I am Kurenai. That even you should confuse the two of us, however, is incredibly reassuring."},{"name":"KURENAI","text":"Now, truly, this is where I must leave you. Life is a long and winding journey, and I am certain our paths will cross once again in the future. Until then, I ask that you keep on smiling and maintain that wonderful disposition of yours! Fare thee well, my friend!"}],"reward":{"gil":1500,"items":[{"id":18255,"one":1,"hq":1},{"id":18256,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68021,68242]},"next":[68675]},"partials":[{"type":"npc","id":"1023280","obj":{"i":1023280,"n":"Kurenai","l":2409,"q":5}},{"type":"npc","id":"1023291","obj":{"i":1023291,"n":"Kurenai","l":2409,"q":1}},{"type":"npc","id":"1019197","obj":{"i":1019197,"n":"Shiosai","l":2409,"q":6}},{"type":"npc","id":"1023281","obj":{"i":1023281,"n":"Kurenai","l":2409,"q":2}},{"type":"npc","id":"1023292","obj":{"i":1023292,"n":"Hisui","l":2409,"q":1}},{"type":"item","id":"18255","obj":{"i":18255,"n":"Koppranickel Necklace of Healing","l":265,"c":54968,"t":40,"p":15741}},{"type":"item","id":"18256","obj":{"i":18256,"n":"Koppranickel Necklace of Casting","l":265,"c":54968,"t":40,"p":15741}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68021","obj":{"i":68021,"n":"Forever and Ever Apart","g":6,"l":"The Ruby Sea","s":400}},{"type":"quest","id":"68242","obj":{"i":68242,"n":"The Elixir of Life","g":108,"l":"The Ruby Sea","s":3100}},{"type":"quest","id":"68675","obj":{"i":68675,"n":"The Seaweed Is Always Greener","g":107,"l":"Kugane","s":1000,"f":1}}]}