{"quest":{"name":"Sink or Swim","location":"The Ruby Sea","id":68254,"patch":4.0,"sort":3220,"eventIcon":71221,"issuer":1022453,"target":1022453,"involved":[1019242,1022454,1022455,1022456],"genre":108,"journal":["A young Isari boy seeks a mentor."],"objectives":["/beckon the anxious boy.","/cheer on the anxious boy.","/pray for the anxious boy.","/congratulate the anxious boy.","Assure Ajiro you will retrieve his tackle box with a wordless “Leave it to /me.”","Obtain the tackle box.","Deliver the tackle box to Ajiro.","Speak with the anxious boy."],"dialogue":[{"name":"FISHERSON02718","text":"Um, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>? D-Do you know how to swim? Because if you do, I need your help."},{"name":"FISHERSON02718","text":"I used to love the feeling of gliding through the waters more than anything. That is, until one day I pushed my luck and went too far from shore. I nearly drowned, and since then, I have been too scared to even dip my toes into the sea."},{"name":"FISHERSON02718","text":"There is nothing more shameful than being the son of a fisherman and terrified of water. That is why I must train in secret. No one, absolutely no one can find out about this─especially Father."},{"name":"FISHERSON02718","text":"Do you see that small boat over there? I want to attempt to swim to it, but I am afraid I cannot do it alone. Please, might you lead the way and <span class=\"highlight\">beckon</span> me into the waters?"},{"name":"FISHERSON02718","text":"I want to swim to that boat there but I cannot do it alone. I need someone to <span class=\"highlight\">beckon</span> me into the waters."},{"name":"FISHERSON02718","text":"I...I am going to slowly start moving forward...and into the...&lt;gulp&gt;...water. Should I become too petrified to move, I need for you to <span class=\"highlight\">cheer</span> me on that I might overcome my fear."},{"name":"FISHERSON02718","text":"...I c-c-can't go any f-further. &lt;shudder&gt; I must turn back!"},{"name":"FISHERSON02718","text":"Th-Thank you. My heart no longer feels as though it is pounding out of my chest. I think I can push myself just a bit further... I may need your <span class=\"highlight\">prayers</span>, however, to guide me along and keep me safe."},{"name":"FISHERSON02718","text":"P-Please, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! <span class=\"highlight\">Pray</span> for me. I am so afraid...so terribly afraid!"},{"name":"FISHERSON02718","text":"&lt;sigh&gt; Thank you. I was gripped by an irrational fear, but your prayers have melted it away. I think I can do this! I am going to try swimming the rest of the way to the boat. I hope you will be there, waiting to <span class=\"highlight\">congratulate</span> me when I do!"},{"name":"FISHERSON02718","text":"Look, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! I did it! I actually did it!"},{"name":"AJIRO","text":"Oho! The two of you must have swum quite a ways to make it all the way out here!"},{"name":"FISHERSON02718","text":"I made it! I can scarce believe it! Oh, thank you so very much, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! Your encouragement is what kept me afloat and allowed me to come this far."},{"name":"AJIRO","text":"Say there, boy, you are quite the swimmer. You seem to be right at home in the sea. "},{"name":"FISHERSON02718","text":"...You really think so? I have long dreamed of becoming a great fisherman like my father and your words have filled my heart with hope!"},{"name":"AJIRO","text":"Well, if you are serious about pursuing that dream, I suggest you take care of yourself. After all, a fisherman in poor health at sea is like a floundering fish on land. Take me for example. My back pains flared up earlier and caused me to drop my tackle box into the water."},{"name":"FISHERSON02718","text":"If I could dive beneath the waves and make it to the ocean floor, I would gladly retrieve this man's possessions for him. Sadly, it is far beyond my ability. If you think you can do it, however, perhaps you can show him with a wordless “Leave it to <span class=\"highlight\">me</span>.”"},{"name":"AJIRO","text":"Let this be a lesson to the both of you. You must put your physical well-being first. I am going to take a short rest, then attempt to go and retrieve my possessions."},{"name":"FISHERSON02718","text":"If you think yourself capable, turn to the man on the boat and reassure him that you will retrieve his things for him with a silent “Leave it to <span class=\"highlight\">me</span>.”"},{"name":"AJIRO","text":"Oh? So you think yourself an adept enough diver to brave the depths of the sea?"},{"name":"FISHERSON02718","text":"<span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span>, you know how to dive!? You think you can make it to the seabed and fetch this man's things?"},{"name":"AJIRO","text":"If you are truly capable and willing, I shall not refuse the favor. Just be careful─the waters can be a dark and treacherous place."},{"name":"AJIRO","text":"If you could retrieve my tackle, it would be greatly appreciated."},{"name":"FISHERSON02718","text":"It seems our roles have been reversed! Now it is my turn to cheer you on! You can do it, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! I know you can!"},{"name":"AJIRO","text":"Were you able to find my tackle box?"},{"name":"AJIRO","text":"I must say I am impressed! You have saved me a great deal of hassle."},{"name":"AJIRO","text":"My boy, with a fine mentor like this <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span> here, you are sure to become a master of the seas someday!"},{"name":"AJIRO","text":"Now the two of you must be starting to feel the bitter bite of the waters right about now. You best return to the shore quickly before you succumb to the cold."},{"name":"FISHERSON02718","text":"<span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span>, I am going to attempt to swim back on my own! I will see you back at the coast near the large boulder where we first met!"},{"name":"AJIRO","text":"Take good care of that boy, my friend! His future is bright!"},{"name":"FISHERSON02718","text":"Oh, there you are! On the way back, I tried imitating the way you swam and found that I was able to effortlessly glide through the waters! It was a liberating experience!"},{"name":"FISHERSON02718","text":"I did not think there was anyone in the world that could swim better than my father, but you are far, far superior! Thank you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>─because of you I have overcome my fear and am one step closer to realizing my dream of becoming the village's best fisherman!"}],"reward":{"gil":703,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68026]}},"partials":[{"type":"npc","id":"1022453","obj":{"i":1022453,"n":"Anxious Boy","l":2409,"q":1}},{"type":"npc","id":"1019242","obj":{"i":1019242,"n":"Ajiro","l":2409,"q":1}},{"type":"npc","id":"1022454","obj":{"i":1022454,"n":"Anxious Boy","l":2409,"q":1}},{"type":"npc","id":"1022455","obj":{"i":1022455,"n":"Anxious Boy","l":2409,"q":1}},{"type":"npc","id":"1022456","obj":{"i":1022456,"n":"Anxious Boy","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}}]}