{"quest":{"name":"Up in Flames","location":"The Ruby Sea","id":68259,"patch":4.0,"sort":3270,"icon":100701,"eventIcon":71221,"issuer":1019234,"target":1018347,"involved":[1018466,1023218,1023219,1023468,1023469,1023470,1023471,1023472,1023473,1023474,1023477,1023478,1023479,1023480],"genre":108,"journal":["Asari is eager to speak with you.","Asari stops you to say that great things are on the horizon for the small village of Isari, and everyone is incredibly excited about being able to torch fish again. Or at least, everyone but Nayoshi, who has lately been spending most of his free time sulking. Asking that you go and speak to him to learn what is wrong, she points in the direction of the large boulders.","The fishermen have been working together to defeat the hooked bombfish Nayoshi reels in from the sea, but he fears that due to their inexperience with fighting, it is only a matter of time before someone comes to harm. He begs you to teach them some basic combat maneuvers and, when you agree, rushes off to round up the fishermen.","When you rendezvous with Nayoshi, he tells you the combat lessons must wait. One of the boats that went torch fishing the night prior has gone missing, and the villagers suspect it is the doing of the Kojin of the Red or sea monsters. As humble fishermen, however, they stand little chance of winning a fight against either and decide they must turn to outside help. One of the elderly fishermen reveals that, in the days of eld they would often turn to the Confederates for aid. Hearing this, Nayoshi asks that you introduce him to Tsukikage that he might appeal to him for assistance.","The Confederates and one of the fishermen they dragged out of the water tell you that the Kojin of the Red attacked the torch fishing boat and took everyone aboard it prisoner. Agreeing to lend you aid, Tsukikage asks that you create a distraction using fireworks at the Isle of Zekki while he, Suzume, Hansaku, and Nayoshi go to save the captives.","As per Tsukikage's instructions, you find an open area on the Isle of Zekki to place and light the firecrackers. They explode and draw a few Kojin of the Red lurking close by out of hiding. You quickly dispatch of them and, deeming your distraction a success, you begin making your way to Hells' Lid, where you are to rendezvous with Tsukikage and the others.","You encounter Tsukikage, who is alone at Hells' Lid and at the mercy of Red Kojin. Quickly neutralize the threat that he might be saved.","Tsukikage tells you of how their group was attacked by a group of Red Kojin as they were retreating. The others escaped with the fishermen, while he stayed behind to neutralize the threat. The hostile Kojin, however, proved far stronger than he anticipated and he would likely have been overwhelmed by them had you not arrived when you did. Thanking you for your help, the Confederate treasurer then bids that you go with him to Isari to make sure everyone arrived safely.","You return to Isari, where you are informed that all the fishermen have retired to their homes to rest. The Red Kojin attack has, however, raised a very important question among the remaining men and women: should their village give up on torch fishing for good? Just as the natives resign themselves to quitting, Tsukikage steps forward with a suggestion. In exchange for some of their bombfish oil, he will agree to protect their boats at night and even send men to help slay the beasts. Thus, an agreement is struck among the inhabitants of the Ruby Sea."],"objectives":["Speak with Nayoshi.","Speak with Tsukikage in Onokoro.","Use the firecrackers at the designated spot and slay any Kojin that appear.","Rendezvous with Tsukikage at Hells' Lid.","Aid Tsukikage.","Speak with Nayoshi."],"dialogue":[{"name":"ASARI","text":"If it isn't our most vaunted savior, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! Ever since you provided us with a means to revive torch fishing, our yields have increased tenfold."},{"name":"ASARI","text":"Trade, too, has begun to flourish and my seafood stall has greatly benefited from it. A new era is upon us and we are all ready to embrace it with open arms!"},{"name":"ASARI","text":"...Well, everyone with the exception of Nayoshi, that is. Lately, he's been spending all his free time moping by the large boulders. Please, might you try talking to him and learn what is wrong?"},{"name":"ASARI","text":"While all the other villagers are humming to themselves as they set about their work, Nayoshi is over by the boulders sulking. Please go and speak with him to find out what is wrong."},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, I am glad you came. While all the others are incredibly excited about being able to torch fish again, there is something that has been bothering me..."},{"name":"NAYOSHI","text":"Nobody seems to realize just how dangerous the hooked bombfish are. Every time I reel one in from the seas, it takes the strength of the entire village to bring it down. It is only a matter of time before someone is grievously injured."},{"name":"NAYOSHI","text":"When fishing with you, I never had to fear for your safety. You know how to handle yourself. Please, do you think you could teach the others some basic techniques to subdue the beasts?"},{"name":"NAYOSHI","text":"Thank you! You have put my mind at ease! I shall go and fetch everyone now. Let us meet at the pier shortly!"},{"name":"KORURI","text":"This is terrible! This is so very terrible!"},{"name":"SMARTDIVER","text":"Everything was going so well until now..."},{"name":"VETERANFISHER","text":"We should have taken extra precautions. In our excitement to begin torch fishing, we became careless."},{"name":"ASARI","text":"So that is what has been weighing on Nayoshi's mind. He is not wrong to worry. While you will be hard-pressed to find better fishermen than those at our village, none of us are trained fighters."},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, the lessons must wait. One of the boats that went torch fishing last night has vanished!"},{"name":"KORURI","text":"There were no storms to rough the seas so chances of their boat having capsized is slim. The men on it were also veterans, so an accident is equally unlikely..."},{"name":"VETERANFISHER","text":"Indeed. This is deeply troubling. I suspect they might have been attacked by sea monsters or Kojin of the Red."},{"name":"KORURI","text":"If that is the case, then there is little we can do. We are but humble fishermen. We can scarce fight either of them off with our nets and harpoons."},{"name":"VETERANFISHER","text":"Before Yotsuyu rose to power, the Confederacy had an outpost here. When problems like this would arise, we would often turn to them for help."},{"name":"KORURI","text":"What is to say we can't still do that? All we would need to do is send a boat to Onokoro and beg them for their assistance!"},{"name":"VETERANFISHER","text":"I am afraid it is not nearly so simple. When the Empire came, we simply stood by and watched as they drove them out..."},{"name":"NAYOSHI","text":"Nevertheless, we must at least try! <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, would you by any chance happen to know someone in the Confederacy?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I know a Confederate by the name of Tsukikage."},{"name":"A2","text":"Hm... No one comes to mind."},{"name":"VETERANFISHER","text":"Master Tsukikage? The Confederacy's treasurer? He often came to our village to collect the Ruby Tithe."},{"name":"VETERANFISHER","text":"As I recall, he was quite fond of Isari. He would often buy stockfish by the armload to take back. Perhaps he would be sympathetic to our plight."},{"name":"NAYOSHI","text":"Could you introduce me to this man? I would like to explain our predicament to him and request his assistance."},{"name":"VETERANFISHER","text":"&lt;sigh&gt; I suppose with all the people you meet in your travels, it is easy to lose track of your acquaintances. You would not happen to know a man by the name of Tsukikage, would you? Long ago, he would come regularly to our village to collect the Ruby Tithe."},{"name":"VETERANFISHER","text":"As I recall, he was quite fond of Isari. He would often buy stockfish by the armload to take back. Perhaps he would be sympathetic to our plight."},{"name":"NAYOSHI","text":"Could you introduce me to this man? I would like to explain our predicament to him and request his assistance."},{"name":"KORURI","text":"Please, whatever you do, keep Nayoshi safe!"},{"name":"SMARTDIVER","text":"Do you really think the Confederacy will help us?"},{"name":"VETERANFISHER","text":"No one knows these waters better than the Confederates. Of anyone, they would be able to find and rescue our missing fishermen."},{"name":"NAYOSHI","text":"L-Look! That man there─he is one of the fishermen from the missing boat!"},{"name":"SUZUME","text":"We were on our way back from making a delivery to the East Aldenard Trading Company when we fished this rat out of the water."},{"name":"HANSAKU","text":"It's great to see you again, <span class=\"highlight\">Forename</span>! You'll be happy to know the chief's been giving me more and more responsibilities since we last met. "},{"name":"FISHER02719","text":"Thank the kami the two of you came! I just barely managed to escape but the others... They were not so lucky."},{"name":"TSUKIKAGE","text":"<span class=\"highlight\">Forename</span>, what brings you here? And who is the large gawping boy beside you?"},{"name":"NAYOSHI","text":"I am Nayoshi of Isari. I begged <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> to bring me here to speak with you."},{"name":"NAYOSHI","text":"I have come to appeal to you for your help. One of our boats has vanished, along with the men who were on it. We have not the resources or the power to look for them, but you do. In fact, you seem to already have found one of them."},{"name":"HANSAKU","text":"Indeed. Your story matches what this man told us when we fished him out of the waters on the way back from a delivery to the East Aldenard Trading Company."},{"name":"FISHER02719","text":"Nayoshi, the torches─they were effective. Mayhap a little too effective."},{"name":"FISHER02719","text":"They attracted large numbers of fish, but not long after they also brought swarms of Red Kojin to us. I dove into the sea and was able to escape, but the others were not nearly so fortunate. They were captured and taken to Hells' Lid."},{"name":"TSUKIKAGE","text":"As you know, our influence over these seas has begun to weaken, and because of this, the Kojin of the Red grow bolder by the day. It was not prudent of your people to go out with torches in the middle of the night."},{"name":"NAYOSHI","text":"Even so, we cannot very well leave them in the clutches of the enemy! Please, I beg of you, lend us your assistance!"},{"name":"TSUKIKAGE","text":"It is the Confederacy's duty to see that these seas remain secure. Besides, we cannot deny the pleas of one of <span class=\"highlight\">Forename</span>'s acquaintances. You will have our assistance."},{"name":"NAYOSHI","text":"Thank you! Those are the very words I had hoped to hear!"},{"name":"SUZUME","text":"Sir, if the reports our comrades on Sakazuki have sent us are anything to go by, Hells' Lid will be teeming with Kojin of the Red. Rescuing these fishermen is not going to be an easy task."},{"name":"TSUKIKAGE","text":"That is why we will be setting up a little diversion for our shell-backed friends at the Isle of Zekki."},{"name":"HANSAKU","text":"Th-The Isle of Zekki? As in the Red Kojin's home!? But Chief, the only way to get there is to swim..."},{"name":"NAYOSHI","text":"That should be no problem for <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is an excellent diver."},{"name":"TSUKIKAGE","text":"Then it sounds as if we have ourselves a plan. <span class=\"highlight\">Forename</span>, you shall be in charge of creating a distraction."},{"name":"TSUKIKAGE","text":"Suzume, you are to come with me to Hells' Lid. Together we shall take care of the Red Kojin menace and free the prisoners. Hansaku, you will remain on the boat nearby to ensure our quick escape."},{"name":"HANSAKU","text":"(-Suzume and Hansaku-)Yes, sir!!!"},{"name":"TSUKIKAGE","text":"Oh, and Nayoshi, I would have you accompany Suzume and me. Seeing a familiar face should keep your friends from panicking when they see us."},{"name":"NAYOSHI","text":"Yes, sir!!!"},{"name":"FISHER02719","text":"If I am not needed, I shall return to the village and inform everyone of the current situation."},{"name":"TSUKIKAGE","text":"<span class=\"highlight\">Forename</span>, take these firecrackers. Find a visible location then light them up. They are loud and bright and should keep the Kojin busy for a time. Once you have done that, come meet us at Hells' Lid."},{"name":"BALLOON","text":"INTRUDER!"},{"name":"BALLOON","text":"Your death is nigh!"},{"name":"TSUKIKAGE","text":"<span class=\"highlight\">Forename</span>! You could not have come at a better time."},{"name":"TSUKIKAGE","text":"We were in the middle of our retreat when Kojin reinforcements arrived. Suzume and Nayoshi evacuated with the fishermen, while I remained behind to fend them off."},{"name":"TSUKIKAGE","text":"A decade ago, I could have easily done away with this lot. &lt;sigh&gt; Time truly is man's greatest enemy."},{"name":"TSUKIKAGE","text":"Now then, let us not waste any more time here. To Isari, my friend!"},{"name":"TSUKIKAGE","text":"It is good you are here. Nayoshi was growing impatient to see you."},{"name":"SUZUME","text":"You are alive and, thanks to you, so is our chief."},{"name":"HANSAKU","text":"You did it yet again! You saved everyone. I hope if I work hard, one day I will come to be as strong and reliable as you."},{"name":"VETERANFISHER","text":"I am relieved to see you are back in one piece, as are the missing fishermen."},{"name":"KORURI","text":"Yet again, you place others' needs above your own. We must learn from this little misadventure and think how we might continue this practice without endangering anyone else."},{"name":"FISHER02719","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, you are returned! Thanks to you and Nayoshi, the fishermen have also made it back safely. The both of you are heroes!"},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, you have returned! The fishermen have all made it back safely to their homes, where they are resting to recover from this terrible ordeal."},{"name":"VETERANFISHER","text":"On behalf of everyone here, I would like to extend to you our sincerest thanks for your help."},{"name":"KORURI","text":"That reminds me... Perhaps it would be for the best if we returned to our old methods of fishing. While not as effective, at least we will not have to worry about any more attacks."},{"name":"TSUKIKAGE","text":"If I may, might I make a suggestion? Nayoshi tells me that torch fishing is a practice that has only been recently revived in Isari and that you use bombfish oil to do it."},{"name":"VETERANFISHER","text":"That is correct."},{"name":"TSUKIKAGE","text":"If you were to supply the Confederacy with some of this oil, we would be willing to ensure the safety of your boats at night. Being the rare commodity that it is, I am sure I can convince Rasho to agree to the trade."},{"name":"VETERANFISHER","text":"T-Truly!? You would do that?"},{"name":"TSUKIKAGE","text":"Yes, and we might even be able to lend you some men to slay these bombfish. I hear they have been giving you quite a bit of trouble."},{"name":"NAYOSHI","text":"I think I speak for all of us when I say we would be honored to accept your offer. We would be fools not to!"},{"name":"TSUKIKAGE","text":"It seems we have ourselves an agreement, then. I shall be looking forward to working with you."},{"name":"NAYOSHI","text":"Hahaha! <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─did you hear that? We have an agreement! It seems we won't be needing those fighting lessons from you, after all!"},{"name":"TSUKIKAGE","text":"<span class=\"highlight\">Forename</span>, once again we owe you our thanks. You continue to bring us opportunities we could only ever dream of having. Our future is bright, and it is in no small part thanks to you."},{"name":"TSUKIKAGE","text":"Before we part ways, once again, please accept this gift of gratitude from us. I bid you well, my friend. May the wind always be at your back!"}],"reward":{"gil":1500,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68026,68226]}},"partials":[{"type":"npc","id":"1019234","obj":{"i":1019234,"n":"Asari","l":2409,"q":2}},{"type":"npc","id":"1018347","obj":{"i":1018347,"n":"Nayoshi","l":2409,"q":1}},{"type":"npc","id":"1018466","obj":{"i":1018466,"n":"Koruri","l":2409,"q":1}},{"type":"npc","id":"1023218","obj":{"i":1023218,"n":"Veteran Fisherman","l":2409,"q":1}},{"type":"npc","id":"1023219","obj":{"i":1023219,"n":"Nayoshi","l":2409,"q":5}},{"type":"npc","id":"1023468","obj":{"i":1023468,"n":"Sharp-eyed Ama","l":2409,"q":1}},{"type":"npc","id":"1023469","obj":{"i":1023469,"n":"Tsukikage","l":2409,"q":1}},{"type":"npc","id":"1023470","obj":{"i":1023470,"n":"Nayoshi","l":2409,"q":1}},{"type":"npc","id":"1023471","obj":{"i":1023471,"n":"Ill-tempered Fisherman","l":2409,"q":1}},{"type":"npc","id":"1023472","obj":{"i":1023472,"n":"Suzume","l":2409,"q":1}},{"type":"npc","id":"1023473","obj":{"i":1023473,"n":"Hansaku","l":2409,"q":1}},{"type":"npc","id":"1023474","obj":{"i":1023474,"n":"Tsukikage","l":2409,"q":1}},{"type":"npc","id":"1023477","obj":{"i":1023477,"n":"Tsukikage","l":2409,"q":1}},{"type":"npc","id":"1023478","obj":{"i":1023478,"n":"Suzume","l":2409,"q":1}},{"type":"npc","id":"1023479","obj":{"i":1023479,"n":"Hansaku","l":2409,"q":1}},{"type":"npc","id":"1023480","obj":{"i":1023480,"n":"Ill-tempered Fisherman","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}},{"type":"quest","id":"68226","obj":{"i":68226,"n":"Family Affairs","g":108,"l":"The Ruby Sea","s":2180}}]}