{"quest":{"name":"Rock Bottom","location":"The Ruby Sea","id":68257,"patch":4.0,"sort":3250,"icon":100700,"eventIcon":71221,"issuer":1023219,"target":1023233,"involved":[1023228,1023229,1023230],"genre":108,"journal":["Nayoshi is eager to put the wooden fishing lure to the test.","Nayoshi is certain that the wooden fishing lure is the answer to all his problems and he is eager to give it a try. Follow him to the northeastern cliffs to make sure he does not get too far ahead of himself.","You catch up to Nayoshi, who has already attempted to use the lure and lost his rod in the process. He explains how shortly after he cast his line, a large fish took the bait. A violent skirmish ensued, and as he attempted to reel it ashore, he was thrown into his barrel. The impact caused him to drop his rod, which was pulled into the sea. Unable to dive into the waters to retrieve it himself, he once again appeals to you for assistance.","You dive into the nearby waters and after a bit of rooting around you come across Nayoshi's rod, which has settled upon the seabed. With it in hand, you return to where he awaits you.","As soon as you return Nayoshi's lost property to him, he announces that he will make a second attempt with the wooden lure. After telling you he is certain he is about to catch a big fish, he casts his line. Nayoshi's enthusiasm quickly turns into fear, however, as he pulls a monster ashore.","Having partially anticipated this would happen, you quickly slay the hooked bombfish that has appeared, and its lifeless corpse falls to the ground. Nayoshi is visibly disappointed by the results of his latest fishing attempt. Perhaps you should speak with him.","Koruri, having seen everything from afar, approaches you and Nayoshi. She chides the fisherman, saying he must quickly dispose of the monster's remains before they start to attract other wild animals. Nayoshi decides to burn the bombfish using the broken barrel, but the wood is still slightly wet and sparks he strikes do not fully take. Seeing this, he tells you he will return to the village to retrieve dry planks and asks that you place the corpse into the cask while he is away.","The damp planks that are still smoldering from Nayoshi's initial attempts to set them on fire, burst into flames the moment you lower the bombfish corpse into the broken barrel. This takes everyone by surprise, and the three of you speculate what could have generated the fire.","You conclude that the hooked bombfish is a fatty creature and the layers of grease in its body are what caused the whimpering flames to grow into a roaring fire. Nayoshi, however, seems indifferent to this observation and simply stares down sadly at the pile of ash, where he claims his unfulfilled dreams now rest. He then declares he will never again touch a fishing rod and will be leaving the village of Isari behind for good. While he seems determined, Koruri and you are left wondering if that is truly the answer..."],"objectives":["Speak with Nayoshi.","Search the sea for Nayoshi's rod.","Deliver the rod to Nayoshi.","Speak with Nayoshi and slay the hooked bombfish.","Speak with Nayoshi.","Use the hooked bombfish corpse to set fire to the broken barrel.","Speak with Nayoshi."],"dialogue":[{"name":"NAYOSHI","text":"Koruri can mock me all she wants but now that I have this, there is nothing stopping me from becoming the finest fisherman in all of Isari!"},{"name":"NAYOSHI","text":"Let us make for the waters posthaste!"},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, you will never believe what just happened! I could not wait to test the lure, so I cast a line with it before you arrived, and something huge took the bait!"},{"name":"NAYOSHI","text":"A violent struggle ensued, with it thrashing about wildly and me trying to hold my ground. Halfway through our silent battle, I was sent sailing into my barrel!"},{"name":"NAYOSHI","text":"The impact made me lose my grip, and my rod flew into the ocean. No doubt it is now somewhere at the bottom of the sea..."},{"name":"NAYOSHI","text":"Koruri is the village's best diver. Normally, I would ask her to fetch it for me, but I am afraid doing so will only further convince her that I should quit fishing."},{"name":"NAYOSHI","text":"...Do you think you could get it for me?"},{"name":"NAYOSHI","text":"Haha! I knew I could count on you!"},{"name":"NAYOSHI","text":"I can feel it─it shall not be long until I am living my dreams! All I need is my rod, and I will have it made!"},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, you are finally returned. Did you find my rod?"},{"name":"NAYOSHI","text":"Thank you! Thank you so very much!"},{"name":"NAYOSHI","text":"Now then, let us go back to practicing! You best watch closely─I am about to catch the biggest fish you have ever seen!"},{"name":"NAYOSHI","text":"Are you ready?"},{"name":"NAYOSHI","text":"Here we go!"},{"name":"NAYOSHI","text":"Curses! It's another beast!"},{"name":"NAYOSHI","text":"Twice I have tried and twice I have failed. &lt;sigh&gt; This lure was my last hope..."},{"name":"KORURI","text":"(-Furious Female Voice-)Nayoshi, it is time you faced the truth already! You are incapable of fishing anything but monsters from the sea!"},{"name":"KORURI","text":"While thankfully <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> was here to take care of the bombfish, you must hurry to clean this up! The smell of blood will begin attracting all manner of wild beast!"},{"name":"NAYOSHI","text":"Very well. The corpse of this dastardly creature shall go up in flames...along with all my dreams."},{"name":"KORURI","text":"And, pray tell, how exactly do you intend to burn the body without oil?"},{"name":"NAYOSHI","text":"I will put it in this broken barrel and set fire to the wood."},{"name":"KORURI","text":"...But the wood is still damp from the water that was in it. Look─the sparks you struck are fizzling out."},{"name":"NAYOSHI","text":"Argh! Then I'll go and get dry planks of wood from the village, dammit!"},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, while I am away see that the fat fiend is crammed into what remains of the barrel!"},{"name":"NAYOSHI","text":"I will go and fetch dry planks of wood from the village while you see that the thing's remains are stuffed into the broken barrel."},{"name":"KORURI","text":"Nayoshi has been incredibly irritable of late, would you not agree?"},{"name":"KORURI","text":"Is it... Is it actually on fire!? I do not understand! That should be impossible!"},{"name":"NAYOSHI","text":"I-It's on fire! But how is that possible? The planks were barely smoldering. Now the whole thing is engulfed in flames that climb higher by the second..."},{"name":"KORURI","text":"The sheen of water that was coating the creature's body─that must have been grease. Bombfish must be composed mostly of lard!"},{"name":"NAYOSHI","text":"Well, whatever the case, our worries are over. The beast has been reduced to a pile of ashes, as have my dreams."},{"name":"NAYOSHI","text":"...Koruri, I should have listened to you from the start. I will not trouble you, nor anyone else, any longer. I shall renounce fishing and leave the village."},{"name":"KORURI","text":"L-Leave the village? But where would you even go!?"},{"name":"NAYOSHI","text":"To the mountains. Or somewhere else far, far away from here."},{"name":"NAYOSHI","text":"I love the open sea and fishing more than anything. If I were to remain in Isari, I will constantly be reminded of all that I have lost."},{"name":"KORURI","text":"Nayoshi, this is madness! This is your home! You cannot simply abandon it!"},{"name":"KORURI","text":"Oh, dear! Is it time already? &lt;sigh&gt; I must grab my harpoon and return to work. Meet me at our usual spot after I am finished. And please, for once, try not to do anything brash while I am away..."}],"reward":{"gil":900,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68026,68256]},"next":[68258]},"partials":[{"type":"npc","id":"1023219","obj":{"i":1023219,"n":"Nayoshi","l":2409,"q":5}},{"type":"npc","id":"1023233","obj":{"i":1023233,"n":"Nayoshi","l":2409,"q":2}},{"type":"npc","id":"1023228","obj":{"i":1023228,"n":"Nayoshi","l":2409,"q":1}},{"type":"npc","id":"1023229","obj":{"i":1023229,"n":"Nayoshi","l":2409,"q":2}},{"type":"npc","id":"1023230","obj":{"i":1023230,"n":"Koruri","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}},{"type":"quest","id":"68256","obj":{"i":68256,"n":"A Glimmer of Hope","g":108,"l":"The Ruby Sea","s":3240}},{"type":"quest","id":"68258","obj":{"i":68258,"n":"Passing the Torch","g":108,"l":"The Ruby Sea","s":3260}}]}