{"quest":{"name":"Thrice Cursed","location":"The Ruby Sea","id":68255,"patch":4.0,"sort":3230,"icon":100700,"eventIcon":71221,"issuer":1023212,"target":1023219,"involved":[1023213,1023215,1023216,1023217],"genre":108,"journal":["An elderly fisherman is looking for an able-bodied <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to assist him.","You are approached by an elderly fisherman who begs you to rescue a young man named Nayoshi. He has been trapped by a beast so gruesome that seemingly not even the combined strength of the Isari villagers can drive it away. Slay the sea monster before ill befalls Nayoshi.","Before Nayoshi is a shiranui. It is, however, no match for you and is quickly defeated. The danger now gone, approach the quivering Nayoshi and assure him he is safe.","Nayoshi is very grateful to you for saving him. It seems that he has a long history of reeling beasts, instead of fish, ashore. This one, however, was far worse than any he has been forced to encounter in the past. Telling you he would like to give you a gift in exchange for rescuing him, he asks that you accompany him back to the village.","As you are making your way back to the village, Nayoshi is accosted by a group of angry fishermen. They have finally had enough of the beasts he continually reels in from the sea and insist that he quit fishing. He tries to argue that this will deprive him of a means to feed himself but no one─including his childhood friend, Koruri─is willing to listen. Nayoshi turns once again to you for aid. He asks that you soothe the mob of fishermen, starting with Koruri.","Koruri begins to calm down and tells the other fishermen to return to work while she deals with Nayoshi. After trying and failing to convince him to stop fishing, she gives him an ultimatum: the next time he comes with them he must either catch half the number of fish she does or hang up his rod. The terms have been set and now Nayoshi must rise to the challenge. While terrified, and somewhat addled, he has not forgotten about your gift and asks that you meet him by the boulders that he might give it to you.","Nayoshi presents you with your gift and assures you that regardless of the obstacles ahead he intends to do what he can to remain a fisherman. With a lot of practice and a bit of help from you will the young man find a way to accomplish his goal or will he be forbidden from ever fishing again?"],"objectives":["Rendezvous with Nayoshi and slay the shiranui.","Aid Nayoshi.","Speak with Nayoshi.","/soothe Koruri.","Speak with Nayoshi."],"dialogue":[{"name":"VETERANFISHER","text":"Hm? An outsider? Those firm arms and lean shoulders─you look to be as strong as ten Isari men! Thank the kami for sending you to us! There is a young man who needs your help."},{"name":"VETERANFISHER","text":"One of our fishermen, Nayoshi, has been cornered by a fiendish beast. While we desperately want to rush to his aid, I fear not even the combined strength of our village will be enough to repel it!"},{"name":"VETERANFISHER","text":"Please, you must save him! I'm afraid you might be the only one that can!"},{"name":"NAYOSHI","text":"P-Please don't eat me! Please don't eat me..."},{"name":"NAYOSHI","text":"Y-You saved my life! Th-Thank you. Having been born and raised in this quaint village, I always knew I would be laid to rest here─just never did I realize that time might come so soon! May I have your name?"},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─truly, from the bottom of my heart, I thank you. Even among the numerous beasts I've reeled in from the sea, this one was particularly terrifying."},{"name":"NAYOSHI","text":"I wish I knew what about me continues to attract these fiendish creatures. &lt;sigh&gt; If only I could learn the answer and find a way to get half as many fish to bite..."},{"name":"NAYOSHI","text":"Either way, I would like to properly thank you. Please, if you would, accompany me back to the village that I might give you a gift for your troubles."},{"name":"KORURI","text":"Everyone is terrified─not only for you but for the whole village! That hellish monster you brought to us is going to do us all in!"},{"name":"FISHER02719","text":"Yet again, you nearly get yourself and everyone else here killed! Kami forfend you ever take up a fishing rod again!"},{"name":"NAYOSHI","text":"I-I'm sorry, everyone. Truly, I am..."},{"name":"NAYOSHI","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, thank you for coming all this way. Unfortunately, I will not be able to get your gift to you just yet. It seems some of my fellow fishermen wish to have a word with me."},{"name":"FISHER02719","text":"What in the hells is wrong with you, Nayoshi!? Do you not realize the peril you put us in every time you go fishing!? It is past time you hang up your rod! We will have no more of this!"},{"name":"NAYOSHI","text":"P-Please, anything but that! How am I to eat, if I cannot fish?"},{"name":"KORURI","text":"The village's needs come first. We will never know peace so long as you are out in the waters reeling in beast after ferocious beast!"},{"name":"NAYOSHI","text":"They are so shaken, they will not listen to reason. Perhaps if you were to soothe them, they will become more receptive. Please, start with Koruri. She is a good friend."},{"name":"NAYOSHI","text":"Please try soothing Koruri first. She is a friend and will eventually come around."},{"name":"FISHER02719","text":"Y-You mean to defend this would-be murderer!? Stop! I will hear no more!"},{"name":"KORURI","text":"Please, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, can you not see that we are currently in the middle of something incredibly important!?"},{"name":"KORURI","text":"Y-You killed the beast Nayoshi fished from the sea? Then we are safe! ...For now."},{"name":"KORURI","text":"Everyone, listen up! This kind <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> has slain the monster. Neither we, nor the village, are in danger any longer. I shall have a stern word with Nayoshi, while the rest of you go back to work. Or have you all already fulfilled your quotas for the day?"},{"name":"FISHER02719","text":"Well, no...but you cannot keep letting him off the hook like this! &lt;sigh&gt; Your friendship is something I'll never understand. How is it that the village's best diver is friends with the village's worst fisherman?"},{"name":"KORURI","text":"We were born the same year and he lived but a stone's throw away from me. It is only natural. But that is not important! It is time you all returned to work."},{"name":"FISHER02719","text":"Fine, but for everyone's sake you had better find a way to convince him to quit fishing."},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, thank you for that. It seems I am, once again, in your debt."},{"name":"KORURI","text":"I, too, owe you my thanks, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>...and I must also apologize for the trouble Nayoshi has caused you."},{"name":"KORURI","text":"As for <span class=\"emphasis\">you</span>! How many times have I asked─pleaded with you, even─to quit fishing? Everyone is fed up with your antics! If I was not your friend, you would be in a great deal of trouble right now!"},{"name":"KORURI","text":"Every time you promise it will not happen again but it does. You keep fishing monsters from the sea, each more dangerous than the last! This cannot continue. We are a poor village. You must find a different job─a way to make yourself useful."},{"name":"NAYOSHI","text":"Koruri, that is not as easy as you make it sound. We are a village of fisherman. How am I to show my face in public if I do not bring home fish, however minuscule the amount..."},{"name":"KORURI","text":"&lt;sigh&gt; You are far too stubborn for your own, or anyone else's, good! Fine. You shall be granted one final chance. Next time we go fishing, you must catch at least half the number of fish I do. Anything less, and you are to give up fishing for good."},{"name":"NAYOSHI","text":"...She cannot be serious, can she? Even on my best days I can barely catch enough fish to feed myself..."},{"name":"NAYOSHI","text":"&lt;sigh&gt; Either way, everyone's stares are starting to make me feel uncomfortable. Please, join me behind those large boulders yonder. I would still like to give you something."},{"name":"NAYOSHI","text":"Ah, you came! Here, this is for you."},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, there is no way I can quit fishing. I must somehow become good enough to convince Koruri and the others to allow me to keep my rod."},{"name":"NAYOSHI","text":"This will require a lot of practice, which means I might end up pulling in even more monsters from the sea. Thus, I ask you: please, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, might you accompany me on my training sessions?"},{"name":"NAYOSHI","text":"I know it is a bold favor to request of someone who has saved me, not once but twice now; however, I see no other way. You are the only one that can keep these monsters at bay. Truly, you are my last hope!"}],"reward":{"gil":800,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68026]},"next":[68256]},"partials":[{"type":"npc","id":"1023212","obj":{"i":1023212,"n":"Veteran Fisherman","l":2409,"q":1}},{"type":"npc","id":"1023219","obj":{"i":1023219,"n":"Nayoshi","l":2409,"q":5}},{"type":"npc","id":"1023213","obj":{"i":1023213,"n":"Nayoshi","l":2409,"q":1}},{"type":"npc","id":"1023215","obj":{"i":1023215,"n":"Nayoshi","l":2409,"q":1}},{"type":"npc","id":"1023216","obj":{"i":1023216,"n":"Koruri","l":2409,"q":1}},{"type":"npc","id":"1023217","obj":{"i":1023217,"n":"Ill-tempered Fisherman","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}},{"type":"quest","id":"68256","obj":{"i":68256,"n":"A Glimmer of Hope","g":108,"l":"The Ruby Sea","s":3240}}]}