{"quest":{"name":"Blessings of the Sea","location":"The Ruby Sea","id":68251,"patch":4.0,"sort":3190,"eventIcon":71221,"issuer":1019228,"target":1019228,"genre":108,"journal":["Motogoe would send you on an expedition."],"objectives":["Obtain a blessing stone.","Deliver the blessing stone to Motogoe."],"dialogue":[{"name":"MOTOGOE","text":"Ah! Well, if it isn't an adventurer! How would you like to go on a treasure hunt?"},{"name":"MOTOGOE","text":"The item I would have you search for can only be found on remote islands. Most sane men would avoid such places, as they are often overrun with all manner of terrible beasts, but you look like you would relish the challenge."},{"name":"MOTOGOE","text":"I would have you go to the Isle of Bekko. The only individuals that dare set foot upon its soils are the occasional Kojin of the Blue who enter and exit the neighboring seas."},{"name":"MOTOGOE","text":"There, you will be able to find something known as blessing stones. They are round, white, and just a bit warm to the touch. Bring one back for me, will you?"},{"name":"MOTOGOE","text":"Blessing stones can be found at the Isle of Bekko─an island to the southeast of here. Please bring back one for me will you?"},{"name":"MOTOGOE","text":"Ah! Might your return mean I shall be receiving my blessing stone?"},{"name":"MOTOGOE","text":"It is so large, warm and smooth. This would make the perfect pillow! ...Not that that is how I would ever put it to use, mind you!"},{"name":"MOTOGOE","text":"You see, blessing stones are, well, these...gifts left behind by seabirds. You can only find them in remote areas because they are shy creatures that prefer to settle far away from people."},{"name":"MOTOGOE","text":"Hm? What do I mean by “gift” you ask? Bahahahaha! That is what we call a pile of bird shite, of course! ...I hope you used gloves!"},{"name":"MOTOGOE","text":"We currently lack fertilizer. Once this is ground into a fine powder, we should have enough to cover all our fields. Not only do these stones bring us a bounty of crops, but during the seasons our hauls of fish are meager, we make a living by selling these in Namai."},{"name":"MOTOGOE","text":"Hence their name, blessing stones. They are one of the many gifts the sea has bestowed upon us. Anyroad, here you are. Thank you for your help!"}],"reward":{"gil":568,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68026]}},"partials":[{"type":"npc","id":"1019228","obj":{"i":1019228,"n":"Motogoe","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}}]}