{"quest":{"name":"Passing the Torch","location":"The Ruby Sea","id":68258,"patch":4.0,"sort":3260,"icon":100700,"eventIcon":71221,"issuer":1023233,"target":1023625,"involved":[1019234,1023219,1023229,1023231,1023232],"genre":108,"journal":["Nayoshi is ready to renounce fishing for good.","Nayoshi declares that he will be departing from the village immediately. He would, however, like to give you one final gift and asks that you meet him at your usual spot by the boulders shortly.","Your conversation with Nayoshi is derailed by the distant cries of the villagers. From the snatches you are able to catch, you surmise ill has befallen Koruri. Nayoshi, hearing this, rushes off. You best follow him.","You catch up to Nayoshi who is standing outside of a hut in which Koruri is receiving treatment. According to one of the other villagers, the young girl nearly drowned and is currently in critical condition. Her body temperature is dropping fast, but the fire they made is not near hot enough to warm her. Nayoshi, however, has a solution: he will catch another fatty hooked bombfish and throw it in the fire. He, of course, will need you to accompany him to kill the beast he fishes from the sea.","You quickly dispatch of the hooked bombfish Nayoshi reels in and the two of you now have a greasy corpse with which to feed the fire. Speak with Nayoshi to see what he would have you do next.","Nayoshi is overjoyed by your victory over the bombfish but wastes no time celebrating. He would have you hurry back with him to the hut and deliver the corpse to the villagers tending the fires that will save Koruri.","You deliver the bombfish corpse to the girl outside the hut. She is convinced the layers of fat in its body will give life to the fires, and thanks you and Nayoshi for your services.","Koruri has awoken, but it does little to assuage Nayoshi's feelings of guilt. He declares again─this time to the entire village─that he shall be departing from Isari for good. One of the elders, however, stops him. He believes Nayoshi's ability to catch hooked bombfish may be the key to reviving torch fishing and restoring the small fishing community to its former glory. It seems Nayoshi's dreams have come true: he can finally take up his fishing rod, and be lauded as Isari's greatest fisherman."],"objectives":["Speak with Nayoshi.","Rendezvous with Nayoshi.","Rendezvous with Nayoshi and slay the hooked bombfish that appears to obtain its corpse.","Speak with Nayoshi.","Deliver the hooked bombfish corpse to the sharp-eyed ama.","Speak with Koruri."],"dialogue":[{"name":"NAYOSHI","text":"This pile of ashes will not be attracting wild animals any time soon. Our work here is done."},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, it was a great honor knowing you. Not only am I still alive and breathing thanks to you, but your accompanying me throughout my journey has allowed me to come to an important realization: I am not fit to be a fisherman."},{"name":"NAYOSHI","text":"While Koruri has requested that I meet with her after she finishes working, I think it would be best for everyone if I left immediately."},{"name":"NAYOSHI","text":"Before I go, however, I would like to give you a small gift. Pray meet me by the boulders shortly."},{"name":"NAYOSHI","text":"Ah, there you are! I came here as soon as I finished packing my things. Seeing as I do not have much in the way of possessions, it did not take long."},{"name":"NAYOSHI","text":"Thank you for everything, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Here is your gi─"},{"name":"DIVERMATE","text":"(-Panicked Voice-)Hurry, stoke the fires! Koruri's body is shutting down! We need to warm her and remove the water from her lungs!"},{"name":"NAYOSHI","text":"What!? H-Has something happened to Koruri? The cries─they came from that way!"},{"name":"SMARTDIVER","text":"Nayoshi... &lt;sob&gt; Koruri... Koruri, she is..."},{"name":"ASARI","text":"To think Koruri─our most capable swimmer─nearly drowned... What could have caused such a horrible thing to happen!?"},{"name":"NAYOSHI","text":"Koruri nearly drowned! They are in there right now trying to revive her. "},{"name":"SMARTDIVER","text":"This is so terrible! &lt;sob&gt; I was there when the accident happened. Koruri─she was in the waters with me, but the entire time her mind was elsewhere..."},{"name":"NAYOSHI","text":"...Could it be that <span class=\"emphasis\">I</span> am the one to blame for this? Mayhap my declaration to leave the village caused her to lose focus and nearly d-d-drown."},{"name":"SMARTDIVER","text":"Nayoshi, she is in a bad place. Her body temperature continues to drop and, while we are doing everything we can, the fires burn too low to warm her. What are we to do!?"},{"name":"NAYOSHI","text":"We must gather flammable items! <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─do you have any ideas on what we could start with?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"How about a hooked bombfish?"},{"name":"A1","text":"Nothing. You simply stare at Nayoshi."},{"name":"NAYOSHI","text":"That is a brilliant idea! If we throw the corpse of one of those creatures into the fire, it will coax the flames to life!"},{"name":"NAYOSHI","text":"I know! Perhaps if we were to catch another hooked bombfish, we could throw it into the fire and thus coax the flames to life!"},{"name":"NAYOSHI","text":"Leave it to me. I shall soon return with something to fix this. Just keep Koruri alive until then!"},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, I cannot save Koruri without you. While I can fish another hooked bombfish from the sea, I fear I will not be able to defeat it. Please, allow me to borrow your strength once more."},{"name":"SMARTDIVER","text":"Please hurry! I am not sure how much longer she will be able to hold on!"},{"name":"ASARI","text":"I shall begin gathering any combustible materials that happen to be lying about."},{"name":"NAYOSHI","text":"Here it goes! I hope one of these fat fiends will take the bait and bite!"},{"name":"NAYOSHI","text":"Yes! <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, take it from here! Quickly, slay the beast!"},{"name":"NAYOSHI","text":"We did it! There is, however, precious little time to celebrate. We must carry the bombfish back to the hut posthaste."},{"name":"NAYOSHI","text":"Hand the bombfish over to her. She will know what to do with it."},{"name":"ASARI","text":"Koruri has yet to wake, and her breathing is extremely shallow. If we don't do something soon, she...she might... Oh, I cannot bring myself to say it!"},{"name":"SMARTDIVER","text":"Koruri's condition is critical and worsens by the minute. Please, if you have something that could save her, hand it over to me now!"},{"name":"SMARTDIVER","text":"...So this is the fuel you mentioned earlier. Even the creature's skin is sticky with grease. This should make the fire roar."},{"name":"SMARTDIVER","text":"Praise the kami! She's awake!"},{"name":"NAYOSHI","text":"Koruri! Should you really be standing? You need to rest!"},{"name":"KORURI","text":"No, I am fine. Really. <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, Nayoshi─I hear I owe my recovery to the two of you. Thank you."},{"name":"KORURI","text":"To think I was delivered from death by the very rod I condemned... Fate is a funny thing, isn't it? &lt;sigh&gt; Often, I would lecture you on how you must maintain your focus during fishing, but I failed to heed my own advice. I let myself grow distracted by thoughts of you departing and almost died."},{"name":"NAYOSHI","text":"I am so sorry, Koruri. The last thing I wanted to do was put you in harm's way. I should have known better than to tell you my plan right before you went diving."},{"name":"NAYOSHI","text":"Rest assured, however, this will be the last problem I cause you or anyone else in this village. Now that I know you are safe, I will leave Isari."},{"name":"VETERANFISHER","text":"Nayoshi, you cannot go. Not just yet."},{"name":"NAYOSHI","text":"Forgive me, but I would choose to never again see the open waters than live out the rest of my days collecting seaweed."},{"name":"VETERANFISHER","text":"Who says that is what we would have you do? You have a precious gift. There is something you─and you alone─can fish: the hooked bombfish. The oil from these beasts could allow us to take up torch fishing once again."},{"name":"KORURI","text":"T-Torch fishing!? That would significantly increase our yields and not a single one of us would need suffer from hunger any longer!"},{"name":"KORURI","text":"Nayoshi─do you not see─this is a miracle! A gift from the kami themselves!"},{"name":"NAYOSHI","text":"B-But bombfish are extremely dangerous beasts! One small misstep, and they could very well destroy our home here!"},{"name":"VETERANFISHER","text":"That can easily be prevented. We will set up traps for them near where you cast your line."},{"name":"VETERANFISHER","text":"Right, everyone?"},{"name":"FISHER02719","text":"(-Isari Villagers-)Yes!!!"},{"name":"NAYOSHI","text":"Truly? You would have me continue fishing? I...I am at a loss for words."},{"name":"VETERANFISHER","text":"Come now, Nayoshi. Unpack your things and take up your rod. By your hand will our torches be lit tonight!"},{"name":"NAYOSHI","text":"Yes! Yes, they will! I shall go to the seas and bring back more bombfish than we will know what to do with!"},{"name":"NAYOSHI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, thank you for everything. In my darkest hour you lent me your support. Words are not enough to express my gratitude."},{"name":"NAYOSHI","text":"Oh, that reminds me! I nearly forgot to give you your gift!"},{"name":"KORURI","text":"Nayoshi, I shall see that <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> is properly rewarded. You need to get fishing!"},{"name":"ASARI","text":"Our village is greatly indebted to you. Not only did you help us to resuscitate Koruri, but you have also somehow turned our worst fisher into our most promising one."},{"name":"KORURI","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. You have helped Nayoshi reclaim his life here and maybe even saved us all from poverty."},{"name":"KORURI","text":"We have already begun preparing torches with the remnants of the bombfish you brought back for me earlier."},{"name":"KORURI","text":"We will, however, be needing much, much more if we are to begin torch fishing. No doubt Nayoshi will grow very busy in the coming days and months."},{"name":"KORURI","text":"While still meager in comparison to what you have given us, I would nevertheless like to present you with this. Once our village begins to flourish, as I am sure it will, we shall furnish you with something more befitting."}],"reward":{"gil":1000,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68026,68257]}},"partials":[{"type":"npc","id":"1023233","obj":{"i":1023233,"n":"Nayoshi","l":2409,"q":2}},{"type":"npc","id":"1023625","obj":{"i":1023625,"n":"Koruri","l":2409,"q":1}},{"type":"npc","id":"1019234","obj":{"i":1019234,"n":"Asari","l":2409,"q":2}},{"type":"npc","id":"1023219","obj":{"i":1023219,"n":"Nayoshi","l":2409,"q":5}},{"type":"npc","id":"1023229","obj":{"i":1023229,"n":"Nayoshi","l":2409,"q":2}},{"type":"npc","id":"1023231","obj":{"i":1023231,"n":"Nayoshi","l":2409,"q":1}},{"type":"npc","id":"1023232","obj":{"i":1023232,"n":"Sharp-eyed Ama","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}},{"type":"quest","id":"68257","obj":{"i":68257,"n":"Rock Bottom","g":108,"l":"The Ruby Sea","s":3250}}]}