{"quest":{"name":"A Glimmer of Hope","location":"The Ruby Sea","id":68256,"patch":4.0,"sort":3240,"icon":100700,"eventIcon":71221,"issuer":1023219,"target":1023219,"involved":[1023220,1023221,1023223,1023224,1023225,1023226,1023227],"genre":108,"journal":["Nayoshi gives you a pleading look.","Nayoshi decides that in order to improve his skills as a fisherman he must begin training and begs you to accompany him. He is afraid that, should his misfortune persist, he will need a strong <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> on hand to dispatch of whatever monstrosity he mistakenly drags in from the open waters.","You quickly put an end to the beast Nayoshi has caught. Go over and reassure the still-trembling fisherman that he no longer has anything to fear.","Upon seeing you and the slain monster, Nayoshi regains his composure and thanks you for your help. Despite the less-than-stellar results of his first attempt, he is ready to try again. He believes a change of scenery might help to spur his attempts along and asks that you meet him at the southern coast.","As soon as you join him, Nayoshi pulls out his rod and throws out a line. A few moments later, he reels in another sea beast. Quickly dispatch of it and speak with the young fisherman.","Nayoshi appears defeated by his lack of progress and asks you for advice on how he might improve his fishing. After a bit of back and forth, the two of you come to the conclusion that he must receive advice from some of the other fishermen. As the village's least productive member, however, he is certain his pleas for help will fall on deaf ears. He requests that you, the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who delivered Isari from disaster be the one to go around and ask for fishing advice for him.","You begin by approaching the village's most experienced fisherman─the man who requested that you save Nayoshi from the shiranui. He reveals to you that the best way to catch fish is to observe their behavior and use it to your advantage. The example he gives you of torch fishing, however, can only be employed under a very specific set of circumstances and Nayoshi asks that you ask one of the other nearby fishermen for more practical advice.","You speak with one of the younger fishermen whose aptitude for fishing has lately gained him village-wide recognition. Upon learning who you are, he is happy to share with you the secret to his remarkable success. He presents you with a wooden fishing lure and tells you that this is the easiest way to attract and catch fish. Saying you can keep it, he wishes you good luck in your fishing endeavors. Nayoshi would like to look at the lure the young fisherman has given you and requests that you meet him behind the large boulders.","You deliver the lure to Nayoshi, who has been cornered by Koruri. She has come to impart some advice about fishing to Nayoshi. Telling him that he must learn to clear his mind at sea, she suggests he try concentrating solely upon the waves and feeling the rod in his hand. With all the knowledge he has gained, will Nayoshi finally find a way to overcome his troubles?"],"objectives":["Rendezvous with Nayoshi.","Rescue Nayoshi.","Speak with Nayoshi and defeat the beast.","Speak with Nayoshi.","Speak with the veteran fisherman.","Speak with the agile fisherman.","Deliver the wooden fishing lure to Nayoshi."],"dialogue":[{"name":"NAYOSHI","text":"So you will help me? Truly? Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>!"},{"name":"NAYOSHI","text":"Please, follow me north. We can train there, far away from everyone. If─nay─<span class=\"emphasis\">when</span> I should fish a monster from the seas, I ask that you step in and dispatch of it immediately."},{"name":"NAYOSHI","text":"I barely finished casting the line when this thing showed up! P-Please drive it away! "},{"name":"NAYOSHI","text":"Perhaps this was not the best place to begin my training."},{"name":"NAYOSHI","text":"Let us move to the southern coast and try again. This time I shall wait for you to arrive before I begin."},{"name":"NAYOSHI","text":"You are here! Excellent. Let me pull out my rod and cast my line, then!"},{"name":"NAYOSHI","text":"N-No! Not again! Why does this continue to happen!? P-Please <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─kill the beast before it somehow makes its way into the village!"},{"name":"NAYOSHI","text":"Despite the change in location, my performance has scarce improved. What am I to do?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Maybe you can ask one of the other fishermen for help."},{"name":"A1","text":"Perhaps you can approach Koruri for advice."},{"name":"A1","text":"Hm... Mayhap nothing can be done."},{"name":"NAYOSHI","text":"Yes, you are right. Progress is all but guaranteed if I were to seek the guidance of one of the other fishermen. There is just one problem..."},{"name":"NAYOSHI","text":"Koruri is undoubtedly the most talented fisher in the village. Unlike me, however, she dives underwater with a harpoon and spears her fish. The techniques we employ are vastly different and any advice she may have would be of no use to me."},{"name":"NAYOSHI","text":"I am left with no choice but to turn to one of the other fishermen for guidance. There is just one problem..."},{"name":"NAYOSHI","text":"&lt;sigh&gt; It seems even you, with your extensive knowledge of the world, fail to think of a solution. I suppose the only thing I can do at this point is to ask one of the other fishermen for their guidance. There is just one problem..."},{"name":"NAYOSHI","text":"Isari is a small, unpretentious village, where your reputation hinges sorely on your ability to fish. Those who show no aptitude for it are often scorned. Even if I were to appeal to them for help, I would simply be ignored."},{"name":"NAYOSHI","text":"You, however, have won their respect by defeating the monster that earlier threatened to devour me and destroy the village. If you asked them to teach you their fishing techniques, they will be more than happy to oblige."},{"name":"NAYOSHI","text":"I will go with you when you question them and listen intently by your side to what they have to say."},{"name":"NAYOSHI","text":"This man is the village's most experienced fisherman. He is sure to know all the best tricks of the trade. Please, ask him about it. I shall stand right here, with my eyes and ears wide open."},{"name":"FACILITYFISHER","text":"If the rumors are anything to go by, all the answers to becoming the greatest fisher in the world lie in this barrel."},{"name":"VETERANFISHER","text":"Hoho! I remember you! You are the adventurer that I sent to save Nayoshi. Your heroic actions are the talk of the town! ...During your stay here, you have uncovered a new passion for fishing, you say?"},{"name":"NAYOSHI","text":"My knowledge of fishing is insubstantial to teach <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> what <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> wants to know, so I brought <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to you─our veteran fisher."},{"name":"VETERANFISHER","text":"Well, the most important thing is to understand the fish you want to catch. For example, long ago we used to row boats out to sea at night and light a torch. It would draw schools of silvertails to us, allowing fishermen to haul them back by the boatload."},{"name":"NAYOSHI","text":"Torches? But none of us here could ever afford the amount of oil it would require to keep them burning..."},{"name":"VETERANFISHER","text":"Exactly. That, Nayoshi, is part of the reason we remain a destitute village. Life would be far easier had we the means to put torch fishing into practice again."},{"name":"NAYOSHI","text":"I see... Thank you for sharing your wisdom with us. Seeing as we have no oil, however, I think we must look to other methods to assist <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> in beginning <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fishing journey."},{"name":"NAYOSHI","text":"Come, let us try asking someone else!"},{"name":"VETERANFISHER","text":"&lt;sigh&gt; If only we still had the means to torch fish, our village would flourish..."},{"name":"NAYOSHI","text":"(While little more than a boy, he is one of the village's most promising fishermen. Let us try squeezing him for advice.)"},{"name":"FACILITYFISHER","text":"Huh? You are asking me to divulge my greatest fishing secret? And why, pray tell, would I do such a thing?"},{"name":"NAYOSHI","text":"Surely, you must recognize this gracious <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> defeated the tentacled monstrosity I pulled ashore and is the savior of our village."},{"name":"FACILITYFISHER","text":"Ah, indeed! My sincerest apologies. Of course I would be delighted to share with you my technique. After all, someone must make up for Nayoshi's inability to teach you about our craft."},{"name":"FACILITYFISHER","text":"Until recently, I was only slightly better than your average fisherman. I tried everything to improve─from using nets to even pots and fake bait to improve my performance."},{"name":"FACILITYFISHER","text":"After much trial and error, I learned that the fastest way to snag a fish is to use this: a wooden fishing lure. Here, you can have mine. Best of luck, my friend!"},{"name":"NAYOSHI","text":"Haha! You did it, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! You have unraveled the secret to becoming a phenomenal fisher! Please, meet me behind the boulders that I might inspect the lure you received."},{"name":"FACILITYFISHER","text":"Give that wooden fishing lure a try. Trust me─you will be pleasantly surprised by the results."},{"name":"KORURI","text":"I am so glad you are here, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Please, tell me honestly: has Nayoshi improved at all since we last met? I came here to check up on his progress but every time I ask him, he attempts to dodge the question!"},{"name":"NAYOSHI","text":"Thank the kami you are here! The moment I arrived, Koruri appeared and began pestering me about my progress. Do you have the wooden fishing lure?"},{"name":"NAYOSHI","text":"Ah, look at that! It is shaped like a small fish to trick the bigger fish into thinking it's food. Let us go put it to the test, shall we?"},{"name":"KORURI","text":"It struck me as rather odd when I caught wind of <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>'s sudden interest in fishing, but never did I think <span class=\"emphasis\">you</span> were the one to put <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> up to this! &lt;sigh&gt; Nayoshi, isn't it about time you admitted defeat?"},{"name":"NAYOSHI","text":"Never! As a man of Isari, I must do whatever it takes to learn to fish! How else am I to survive? ...Besides, weren't you the one who was pushing me to improve my fishing abilities? "},{"name":"KORURI","text":"If it is simply survival you are worried about, there are plenty of other options. You could gather seaweed, for example. Then again, there is a good chance you would be equally bad at that..."},{"name":"NAYOSHI","text":"Koruri, if you have simply come to poke fun at me, please leave."},{"name":"KORURI","text":"...I actually came here to give you some advice. When you are fishing, you must shut down all your thoughts and concentrate solely upon seeing─nay, <span class=\"emphasis\">feeling</span>─the great expanse of water that stretches out before you. Do it right, and the seas will guide you."},{"name":"KORURI","text":"By contrast, should you allow your mind to roam aimlessly, so will your rod. The waters will only amplify the chaos in your heart and the fish will avoid your line."},{"name":"NAYOSHI","text":"&lt;sigh&gt; It seems she takes me for an idiot... Well, I will show her─and everyone else in the village, for that matter─that I am nothing of the sort! I pray that the answer to my problems lies with this lure."}],"reward":{"gil":800,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"questsType":"all","quests":[68026,68255]},"next":[68257]},"partials":[{"type":"npc","id":"1023219","obj":{"i":1023219,"n":"Nayoshi","l":2409,"q":5}},{"type":"npc","id":"1023220","obj":{"i":1023220,"n":"Koruri","l":2409,"q":1}},{"type":"npc","id":"1023221","obj":{"i":1023221,"n":"Nayoshi","l":2409,"q":1}},{"type":"npc","id":"1023223","obj":{"i":1023223,"n":"Nayoshi","l":2409,"q":1}},{"type":"npc","id":"1023224","obj":{"i":1023224,"n":"Veteran Fisherman","l":2409,"q":1}},{"type":"npc","id":"1023225","obj":{"i":1023225,"n":"Nayoshi","l":2409,"q":1}},{"type":"npc","id":"1023226","obj":{"i":1023226,"n":"Agile Fisherman","l":2409,"q":1}},{"type":"npc","id":"1023227","obj":{"i":1023227,"n":"Nayoshi","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}},{"type":"quest","id":"68255","obj":{"i":68255,"n":"Thrice Cursed","g":108,"l":"The Ruby Sea","s":3230}},{"type":"quest","id":"68257","obj":{"i":68257,"n":"Rock Bottom","g":108,"l":"The Ruby Sea","s":3250}}]}