{"quest":{"name":"A Dream to Remember","location":"The Ruby Sea","id":68250,"patch":4.0,"sort":3180,"eventIcon":71221,"issuer":1019230,"target":1019230,"involved":[1021332,1021333,1021334,1021335,1021336],"genre":108,"journal":["Kansui stares longingly out to sea."],"objectives":["Search for the black-haired maiden on Onokoro.","Speak with the night watchguard.","Speak with the black-haired maiden at Sui–no–Sato.","Report to Kansui."],"dialogue":[{"name":"KANSUI","text":"&lt;sigh&gt; ...When will I see you again, my sweet?"},{"name":"KANSUI","text":"Er─you were not supposed to hear that. ...Though, now that you have, mayhap you can assist me in my quest to find the woman who has so captured my heart."},{"name":"KANSUI","text":"Every night, as the moon reaches its zenith, the winds will carry the mellifluous sound of a woman singing. The other evening I tried to learn where it was coming from and came across a beautiful woman, with long black hair."},{"name":"KANSUI","text":"As soon as I made to approach her, however, she took to the waters and disappeared in the direction of Onokoro. My father insists it was simply a dream, but I know better. This lovely lady─she is a pirate, I am certain of it."},{"name":"KANSUI","text":"The village elders have recently arranged for me to be wed, but before I go through with this marriage I need speak to her─even if it is just once. Please, might you help me find her?"},{"name":"KANSUI","text":"She was so gorgeous she looked like something out of a dream but she was real. She is out there somewhere, and I must find her."},{"name":"MIDPIRATES02714","text":"Me? &lt;hic&gt; A singer? Bahahaha! &lt;hic&gt; I am often told I have a sultry voice. Perhaps it is from all the...&lt;hic&gt;...drinking, but I sure as hells can't sing."},{"name":"MIDPIRATES02714","text":"If you so insist, I will sing for you...&lt;hic&gt;...but only if you bring me a bottle of wine."},{"name":"ROENPIRATES02714","text":"Sometimes I will hum to myself as I row out to sea. Sadly, that is the extent of my singing abilities."},{"name":"ROENPIRATES02714","text":"I am most definitely not the midnight songstress you seek. I do not sing, much less in the middle of the night at sea."},{"name":"AURAPIRATES02714","text":"To learn the answer to that, I suggest you speak with our watchman up above. He is charged with surveying Isari at night."},{"name":"AURAPIRATES02714","text":"Our watchman up above would likely know. He is, after all, charged with surveying the nighttime shores of Isari."},{"name":"SWAINPIRATES02714","text":"Aye. I know of her. Seen her several times, in fact. You will have no luck finding her, though. "},{"name":"SWAINPIRATES02714","text":"The girl you speak of─she is from Sui–no–Sato. It is a village that lies at the bottom of the sea. No one can tell you where it is or how to get there. Even if they could, you would likely drown trying to swim there."},{"name":"SWAINPIRATES02714","text":"The black-haired girl is from Sui–no–Sato. Unless you have a death wish, I would advise you against trying to go there."},{"name":"AURAPIRATES02714","text":"Sui–no–Sato? If you have devised a way to breathe underwater, then you might be able to make it there. If not, you best give up on your search."},{"name":"SUIDIVA02714","text":"You have come here on behalf of a young man searching for the woman who sings in the moonlight? &lt;sigh&gt; Had I known anyone was watching I would have quit long ago. From now on I shall be avoiding that area."},{"name":"SUIDIVA02714","text":"Please, tell your friend to forget about me. He and I─we come from two different worlds. It would never work. Let him know he shan't ever be seeing me again."},{"name":"SUIDIVA02714","text":"One day he will come to understand. It is better for things to end this way."},{"name":"KANSUI","text":"So the maiden with black hair, she was from Sui–no–Sato? &lt;sigh&gt; She is right. Our worlds─our differences─they are irreconcilable. ...Perhaps my father was right. Maybe I was chasing a dream, after all."},{"name":"KANSUI","text":"You see, one of my ancestors was once asked to save an injured Kojin by a girl from Sui–no–Sato."},{"name":"KANSUI","text":"In return for his help, they took him underwater to voyage its depths. He never returned. No doubt he was devoured by some gruesome sea monster. As such, it is probably for the best that things ended this way."},{"name":"KANSUI","text":"&lt;sigh&gt; I...I think I am going to stay here for a bit. The seas are beautiful <span class=\"alternative-container\"><span class=\"alternative\">tonight</span><span class=\"alternative\">this morning</span><span class=\"alternative\">this afternoon</span></span>, and I want to continue dreaming for just a little longer... "}],"reward":{"gil":703,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68026]}},"partials":[{"type":"npc","id":"1019230","obj":{"i":1019230,"n":"Kansui","l":2409,"q":1}},{"type":"npc","id":"1021332","obj":{"i":1021332,"n":"Onyx-haired Maiden","l":2409,"q":1}},{"type":"npc","id":"1021333","obj":{"i":1021333,"n":"Jet Black-haired Maiden","l":2409,"q":1}},{"type":"npc","id":"1021334","obj":{"i":1021334,"n":"Raven-haired Maiden","l":2409,"q":1}},{"type":"npc","id":"1021335","obj":{"i":1021335,"n":"Night Watchguard","l":2409,"q":1}},{"type":"npc","id":"1021336","obj":{"i":1021336,"n":"Black-haired Maiden","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}}]}