{"quest":{"name":"Plunder on High","location":"The Ruby Sea","id":68253,"patch":4.0,"sort":3210,"eventIcon":71221,"issuer":1019232,"target":1019232,"genre":108,"journal":["Zansetsu's mouth is set in a hard line."],"objectives":["Search the wildfowl nests and obtain wildfowl treasure.","Deliver the wildfowl treasure to Zansetsu."],"dialogue":[{"name":"ZANSETSU","text":"Regardless of what it takes, I must find a way to lay my hands on─"},{"name":"ZANSETSU","text":"Aha! You! Yes, <span class=\"emphasis\">you</span>, my friend─there is no mistaking that daring glint in your eye. You must be an adventurer! Might you agree to lend this fellow a hand?"},{"name":"ZANSETSU","text":"You see, the wildfowl that settle in this area at around this time like to collect shiny objects for their nests. While most would consider what they gather to be rubbish, there are some who see it as incredibly valuable─treasure, even."},{"name":"ZANSETSU","text":"As can be expected of birds, wildfowl tend to build their nests upon plateaus or other extremely high and hard-to-reach places."},{"name":"ZANSETSU","text":"Added to that, should there happen to be eggs in the nest you are looking through, you risk raising the ire of the mother bird... &lt;shudder&gt;"},{"name":"ZANSETSU","text":"For a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your caliber, however, neither of those things should pose any challenge. Please, search the nests and bring me back some of their treasure. About three sparkly trinkets should do nicely."},{"name":"ZANSETSU","text":"Do not tell me you have returned to decline my request? Please, my friend, I need your help to obtain some wildfowl treasure."},{"name":"SYSTEM","text":"As you sift through the nest your hand brushes up against something hard and gold. You have found treasure!"},{"name":"SYSTEM","text":"You root about the nest and find nothing but hornbill eggs."},{"name":"SYSTEM","text":"This is not the wildfowl treasure you are looking for. Try searching somewhere else."},{"name":"ZANSETSU","text":"I simply must find a way to acqui─"},{"name":"ZANSETSU","text":"Ah! You are back, and would you look at that─you have brought me wildfowl treasure! Thank you. With this I might finally be able to extract an answer from those miserly Blue Kojin."},{"name":"ZANSETSU","text":"Lately, we have faced a sudden surge of beasts in this region. This has scared our fish away and, as people of the sea, the Kojin are the only ones who know where they might have migrated to."},{"name":"ZANSETSU","text":"While generally an amicable people, they are merchants to the core and will take any opportunity they can get to earn a bit of extra coin."},{"name":"ZANSETSU","text":"Thankfully, they never ask for too much. This, to us, may be junk but to them they are priceless treasures. Hahaha!"}],"reward":{"gil":744,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68026]}},"partials":[{"type":"npc","id":"1019232","obj":{"i":1019232,"n":"Zansetsu","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}}]}