{"quest":{"name":"Whacking Day","location":"Yanxia","id":68266,"patch":4.0,"sort":4080,"unlocksFunction":1,"eventIcon":71341,"issuer":1019313,"target":1019295,"genre":109,"journal":["Kohagi would like you to whack slow, then fast."],"objectives":["Obtain water serpent livers from the water serpents.","Deliver the water serpent livers to Sentei."],"dialogue":[{"name":"KOHAGI","text":"Could I ask you to help with a problem of mine? It concerns some water serpents that have recently infested the One River."},{"name":"KOHAGI","text":"They used to only be found further to the west, but, for one reason or another, some have found their way closer to Namai."},{"name":"KOHAGI","text":"If prepared properly, they are quite delectable. However, there are far more in the river than one could ever hope to cook. No, their numbers must be controlled by other means."},{"name":"KOHAGI","text":"Please slay a few of them for me. Enough to stop them from taking the whole river for their own. Oh, and should you happen to get your hands on a few of their livers, please deliver them to my husband, Sentei."},{"name":"KOHAGI","text":"You will find him in the Drunken Toad to the east."},{"name":"KOHAGI","text":"Should you happen to get your hands on a few of their livers, please deliver them to my husband, Sentei, in the Drunken Toad."},{"name":"SENTEI","text":"Do you have business with me, traveler?"},{"name":"SENTEI","text":"Water serpent livers! But why did you think to bring these to me?"},{"name":"SENTEI","text":"Ah, my wife put you up to it, did she? My sincerest thanks. I shall boil these and eat them shortly."},{"name":"SENTEI","text":"Back in the days when I made my living transporting rice up and down the river, I used to slay any water serpents I saw and take them home to cook. Of course, that all stopped once the Empire blocked off the One River."},{"name":"SENTEI","text":"It is thanks to nature and kind strangers like you that I am able to put food on my table these days. Thank you so much."}],"reward":{"gil":608,"aetherCurrent":1,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"quests":[68030]},"next":[68262]},"partials":[{"type":"npc","id":"1019313","obj":{"i":1019313,"n":"Kohagi","l":2410,"q":2}},{"type":"npc","id":"1019295","obj":{"i":1019295,"n":"Sentei","l":2410,"q":4}},{"type":"quest","id":"68030","obj":{"i":68030,"n":"The Ones We Leave Behind","g":6,"l":"Yanxia","s":500}},{"type":"quest","id":"68262","obj":{"i":68262,"n":"Not Safe for Children","g":109,"l":"Yanxia","s":4090}}]}