{"quest":{"name":"Hungry Hog","location":"Yanxia","id":68267,"patch":4.0,"sort":4050,"eventIcon":71221,"issuer":1019260,"target":1019260,"involved":[1021896],"genre":109,"journal":["Shinden's friend may have bitten off more than he can chew."],"objectives":["Slay the warthog.","Speak with Shinden's friend.","Report to Shinden."],"dialogue":[{"name":"SHINDEN","text":"You! Can you fight?"},{"name":"SHINDEN","text":"There's a warthog trying to eat my entire harvest! One of my friends went off to fight it, but he is no warrior."},{"name":"SHINDEN","text":"If you are willing to help, please head for my paddies before the situation worsens."},{"name":"SHINDEN","text":"Please head for my paddies before the situation worsens."},{"name":"VILLAGERT02731","text":"I-I did not expect it to be quite so big..."},{"name":"POP","text":"You are under attack!"},{"name":"VILLAGERT02731","text":"Thank you for your help, kind stranger. It does not bear thinking what would have happened had you not come."},{"name":"VILLAGERT02731","text":"I grabbed a blade and rushed to Shinden's paddies as soon as I heard that the hog had appeared. However, my courage deserted me when I needed it most."},{"name":"VILLAGERT02731","text":"You, on the other hand, are clearly a fine warrior. My thanks for coming when you did."},{"name":"SHINDEN","text":"Is my friend all right?"},{"name":"SHINDEN","text":"Thank you for helping. My friend told me everything."},{"name":"SHINDEN","text":"We are truly at nature's mercy these days. Anyone capable of fighting in our village has long since been conscripted into the imperial army. Who knows where they are currently being forced to do battle."},{"name":"SHINDEN","text":"I do hope the day comes when they are able to return to Namai... Ah, but this is no story to be telling a complete stranger. Allow me to thank you once again. You have done me a great service."}],"reward":{"gil":642,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"quests":[68030]}},"partials":[{"type":"npc","id":"1019260","obj":{"i":1019260,"n":"Shinden","l":2410,"q":1}},{"type":"npc","id":"1021896","obj":{"i":1021896,"n":"Namai Youth","l":2410,"q":1}},{"type":"quest","id":"68030","obj":{"i":68030,"n":"The Ones We Leave Behind","g":6,"l":"Yanxia","s":500}}]}