{"quest":{"name":"Kurobana Holmes","location":"Yanxia","id":68275,"patch":4.0,"sort":4150,"icon":100702,"unlocksFunction":1,"eventIcon":71341,"issuer":1022425,"target":1019312,"involved":[1022416,1022417,1022418,1023643],"genre":109,"journal":["Kurobana does not forget smells so easily.","The stench given off by Hayabusa's paddies is still fresh in Kurobana's nostrils. The Lupin lad theorizes that the heightened sense of smell possessed by his race is why only he has noticed the oddity. You agree to accompany Kurobana on a trip to compare the smell of other paddies in the village with Hayabusa's.","As expected, the other paddy fields smell perfectly normal. You decide to revisit Hayabusa's terraces to check if they still exude the same odor.","Kurobana wonders if the water in the paddies is to blame for the foul stench. However, his chain of thought is soon interrupted by a loud noise coming from the nearby reservoir. The two of you rush up the slope in search of the noise's origin.","You encounter a monster that seems to have made itself quite comfy. Kurobana asks you to dispatch it, lest the contamination worsen.","Just as you slay the beast it unleashes a pungent odor, strong enough that even you can detect it.","Kurobana notes that the smell that came from the beast was the very same stench given off by Hayabusa's paddies. It is, however, unclear just how the creature found its way to the reservoir, Kurobana theorizing that it lost sight of its pack and came here in search of sustenance. You head to tell Fukudo of these recent developments.","Fukudo has just finished apologizing to Hayabusa when you return to speak with him. This, along with your slaying of the beast by the reservoir, significantly changes the rice farmer's opinion of Kurobana. Kurobana is asked if he would be willing to check the condition of Hayabusa's paddies on a more frequent basis, which delights the young Lupin. Ageta also requests the same of him and Kurobana begins to feel like he belongs in Namai at last."],"objectives":["Speak with Kurobana.","Slay the penghou.","Speak with Kurobana.","Report to Fukudo."],"dialogue":[{"name":"KUROBANA","text":"I still cannot forget the smell of those paddies. Something is definitely not right with them."},{"name":"KUROBANA","text":"I struggle to put into words exactly <span class=\"emphasis\">what</span> was wrong with the odor. I just know that it was not normal."},{"name":"KUROBANA","text":"We Lupin have a heightened sense of smell. This is most likely why Hayabusa himself has not noticed anything odd."},{"name":"KUROBANA","text":"Sitting here doing nothing is likely to send me mad. <span class=\"highlight\">Forename</span>, would you help me look into the source of the stench?"},{"name":"FUKUDO","text":"Looking into the smell is fine, but take care not to anger Hayabusa any further."},{"name":"KUROBANA","text":"Do not worry, Fukudo, I promise you I will not cause any more trouble."},{"name":"KUROBANA","text":"First, I would like to visit some normal paddy fields just to confirm I am not imagining things. Meet me by the ones to the west."},{"name":"FUKUDO","text":"Hayabusa is a reasonable man; I am sure he only reacted how he did because of how much effort he puts into his work. I will go and speak with him myself."},{"name":"KUROBANA","text":"As expected, the paddies here only smell of, well, rice."},{"name":"KUROBANA","text":"Which leads me to think something is not quite right with Hayabusa's fields. Let us revisit the paddies we plucked weeds from."},{"name":"KUROBANA","text":"It is as I thought. These fields have a markedly different scent to those we just visited. Is the water to blame?"},{"name":"KUROBANA","text":"Wait, I just heard a noise from nearby. I think it came from the reservoir. Quickly, <span class=\"highlight\">Forename</span>, let us check if everything is all right!"},{"name":"KUROBANA","text":"What is that foul creature? I have never seen such a beast before. <span class=\"highlight\">Forename</span>, please, keep the village safe from harm."},{"name":"KUROBANA","text":"What is that foul creature? I have never seen such a beast before. <span class=\"highlight\">Forename</span>, please, keep the village safe from harm."},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"KUROBANA","text":"I had known you were powerful, but you might be even stronger than Hakuro. You have my thanks for slaying the beast."},{"name":"KUROBANA","text":"My days, that stench is quite something. It is the same one given off by Hayabusa's paddies, only much, <span class=\"emphasis\">much</span> more foul. It would seem that creature was indeed the source."},{"name":"KUROBANA","text":"As to how it found its way to the reservoir, one can only guess. Perhaps it lost sight of its pack and came here seeking sustenance."},{"name":"KUROBANA","text":"The proximity of Hayabusa's fields to the reservoir is most likely why his were the only ones affected. They should be fine as long as he replaces the water─any recently harvested rice may need to be thrown away, though."},{"name":"KUROBANA","text":"Perhaps I should also check the rice in the storehouse just to be safe. But first, let us speak with Fukudo. He will know how best to proceed."},{"name":"HAYABUSA","text":"On reflection, I really should not have reacted the way I did to Kurobana's remarks. My love for these paddies gets the better of me sometimes..."},{"name":"FUKUDO","text":"Back so soon? I just finished explaining things to Hayabusa."},{"name":"KUROBANA","text":"There is something you both need to hear. <span class=\"highlight\">Forename</span> and I have found the source of the odor that was coming from Hayabusa's paddies. It was a creature that had made the reservoir its home."},{"name":"HAYABUSA","text":"A creature, you say!?"},{"name":"KUROBANA","text":"When <span class=\"highlight\">Forename</span> slayed the beast it released a most foul stench into the air. I really think you should replace the water in your fields."},{"name":"HAYABUSA","text":"To think there had been a monster lurking nearby the whole time... Kurobana, my sincerest apologies for losing my temper with you earlier."},{"name":"HAYABUSA","text":"I was foolish to ever believe for a second the gossip about you was true. You are a fine lad. I thank you for all you have done."},{"name":"KUROBANA","text":"I am just glad I was able to be of service to Namai. Things could have been much more serious had the beast gone unnoticed any longer."},{"name":"KUROBANA","text":"That reminds me, would you mind if I smelt the rice in the storehouse? I am worried it may have also been contaminated."},{"name":"HAYABUSA","text":"By all means. I doubt my own nose would be up to the task after all."},{"name":"HAYABUSA","text":"Actually, Kurobana, do you think you would be up to examining my fields on a more regular basis?"},{"name":"HAYABUSA","text":"If you were to learn the smells of the various diseases which affect rice, you would doubtless notice any infections earlier than any of us could."},{"name":"KUROBANA","text":"You mean to say I could continue to aid the village?"},{"name":"KUROBANA","text":"I have never had anyone rely on me before, never mind a whole village. It is somewhat daunting, but I would love to help!"},{"name":"AGETA","text":"(-???-)My apologies for eavesdropping, but..."},{"name":"AGETA","text":"Would you mind having a look at my paddy fields as well?"},{"name":"KUROBANA","text":"Ageta, you would truly trust me? Are you certain?"},{"name":"AGETA","text":"Why, of course! Do not worry, I will pay you for any work you do."},{"name":"KUROBANA","text":"I would gladly do it for free!"},{"name":"KUROBANA","text":"I never dared dream that a day when I would be of use to the village would actually come."},{"name":"KUROBANA","text":"I owe the fact that it has to you, Fukudo, and you, <span class=\"highlight\">Forename</span>. Thank you so much!"}],"reward":{"gil":1000,"items":[{"id":18411,"one":1,"hq":1},{"id":18412,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68274]},"next":[68276]},"partials":[{"type":"npc","id":"1022425","obj":{"i":1022425,"n":"Kurobana","l":2410,"q":3}},{"type":"npc","id":"1019312","obj":{"i":1019312,"n":"Fukudo","l":2410,"q":4}},{"type":"npc","id":"1022416","obj":{"i":1022416,"n":"Kurobana","l":2410,"q":2}},{"type":"npc","id":"1022417","obj":{"i":1022417,"n":"Kurobana","l":2410,"q":1}},{"type":"npc","id":"1022418","obj":{"i":1022418,"n":"Kurobana","l":2410,"q":1}},{"type":"npc","id":"1023643","obj":{"i":1023643,"n":"Hayabusa","l":2410,"q":1}},{"type":"item","id":"18411","obj":{"i":18411,"n":"Star Spinel Choker of Healing","l":273,"c":54971,"t":40,"p":16215}},{"type":"item","id":"18412","obj":{"i":18412,"n":"Star Spinel Choker of Casting","l":273,"c":54971,"t":40,"p":16215}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68274","obj":{"i":68274,"n":"Kurobana vs. the Arrowheads","g":109,"l":"Yanxia","s":4140,"f":1}},{"type":"quest","id":"68276","obj":{"i":68276,"n":"Kurobana vs. Gyorin","g":109,"l":"Yanxia","s":4280,"f":1}}]}