{"quest":{"name":"Drink Responsibly","location":"Yanxia","id":68277,"patch":4.0,"sort":4170,"eventIcon":71221,"issuer":1019303,"target":1019303,"involved":[1022459,1022460,1022462],"genre":109,"journal":["Gyoku of Yuzuka Manor has a task to ask of a willing adventurer."],"objectives":["Use the muddy water on the well-soused Namazu.","Report back to Gyoku."],"dialogue":[{"name":"GYOKU","text":"You're lucky to have come here. Yes, yes. The Namazu of this manor love all manner of man. You are most welcome here whenever you like."},{"name":"GYOKU","text":"And the timing of your visit couldn't be better. I just so happen to have a task that needs doing."},{"name":"GYOKU","text":"Long ago, this manor belonged to a magistrate of Doma. Back then, we Namazu served under him. But in truth we were more friends than servants."},{"name":"GYOKU","text":"Among us are many Namazu who are greatly interested in the doings of man. They do as they see done. Aping, mimicking. And that is what brings us to our current bit of trouble."},{"name":"GYOKU","text":"Some Namazu have taken to man's love of tea. But as harmless as it is for man, the stimulation is too great for us Namazu. Drinking it causes us to become drunk, much like your wines and ales do to you."},{"name":"GYOKU","text":"I've three friends who set out fishing. They should have returned some time ago, but not a single one of them has. I just know they've hidden themselves away somewhere and are binging on cups of tea."},{"name":"GYOKU","text":"The favor I ask is this─find them and dump this muddy water on them when you do. The smell of the tea alone is enough to intoxicate me, so I cannot draw near. This deed calls for the constitution of man."},{"name":"GYOKU","text":"Those three drunkard Namazu must be out there somewhere. Go and find them, and dump that muddy water on them when you do. That should serve to sober their senses."},{"name":"NAMAZUA02741","text":"Ohhh, that's the stuff. Oh yes, yes. What a feeling!"},{"name":"NAMAZUA02741","text":"Hey! That's cold! And that...that smell... That really cleared up my head."},{"name":"NAMAZUA02741","text":"I'm going to rest up a bit, then I'll head back to the manor. My head may be clear, but my legs still aren't quite under me."},{"name":"NAMAZUA02741","text":"I'm going to rest up a bit, then I'll head back to the manor. My head may be clear, but my legs still aren't quite under me."},{"name":"NAMAZUB02741","text":"Ugggh, I can't drink anymore. Not a sip, not a drop."},{"name":"NAMAZUB02741","text":"That smell... Ahhh, it reminds me of my days under the mud."},{"name":"NAMAZUB02741","text":"Ohhh, those were the days. So warm, so peaceful. Please, let a Namazu sleep just a bit longer."},{"name":"NAMAZUB02741","text":"Ahhh, I miss my days under the mud. So warm, so peaceful. Please, let a Namazu sleep just a bit longer."},{"name":"NAMAZUC02741","text":"I don't... &lt;heave&gt; I don't feel so good. &lt;retch&gt;"},{"name":"NAMAZUC02741","text":"Blugh! You got mud in my mouth!"},{"name":"NAMAZUC02741","text":"My head is a deal clearer, but my stomach is still roiling. I'm going to rest up some more. Then I'll head back home."},{"name":"NAMAZUC02741","text":"My head is a deal clearer, but my stomach is still roiling. I'm going to rest up some more. Then I'll head back home."},{"name":"GYOKU","text":"Well, it was no glamorous deed, but it had to be done. Those fools should all be back as soon as they sober up."},{"name":"GYOKU","text":"Still, it is hard to fault them entirely. Tea is a lovely drink. It tingles as it goes down, and then you feel your entire body relax. Such a remarkably good feeling. "},{"name":"GYOKU","text":"No Namazu can see to work when they drink it. That is why we sought to outlaw it. But as you can imagine, that only had the opposite effect. Yes, yes."},{"name":"GYOKU","text":"This all reminds me, our dear magistrate often said with a smile that a Namazu with tea was much like a man with wine."},{"name":"GYOKU","text":"Thank you, my friend. You've not only helped me, but given me the gift of a treasured memory. I'd not recalled our magistrate's smiling face for some time."}],"reward":{"gil":608,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68270]}},"partials":[{"type":"npc","id":"1019303","obj":{"i":1019303,"n":"Gyoku","l":2410,"q":1}},{"type":"npc","id":"1022459","obj":{"i":1022459,"n":"Well-soused Namazu","l":2410,"q":1}},{"type":"npc","id":"1022460","obj":{"i":1022460,"n":"Well-soused Namazu","l":2410,"q":1}},{"type":"npc","id":"1022462","obj":{"i":1022462,"n":"Well-soused Namazu","l":2410,"q":1}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68270","obj":{"i":68270,"n":"Perchance to Hanami","g":109,"l":"Yanxia","s":4160,"f":1}}]}