{"quest":{"name":"Courage the Cowardly Lupin","location":"Yanxia","id":68272,"patch":4.0,"sort":4120,"icon":100702,"unlocksFunction":1,"eventIcon":71341,"issuer":1019312,"target":1019312,"involved":[1022399,1022400],"genre":109,"journal":["Fukudo would like you to lend him your ears.","Upon entering Namai, you are approached by a man named Fukudo. He tells you of the history of a family of Lupin that have long lived in the village, acting as its loyal protectors. However, what remains of the current generation of this family leaves something to be desired. Its strongest member having been recruited by the Garlean army, all that is left is a sickly mother and her powerless son, Kurobana. Fukudo asks if you would grant your succor to the young Lupin, hoping that he may become a capable warrior yet.","You soon find the young Lupin and he is immediately aware of just who put you up to helping him. Kurobana points out to you that if he were a warrior, he would have long since been called upon by the Empire, as his brother was. Refusing to give up, you do your best to rally Kurobana's spirits.","Kurobana remains less than enthused, even after your attempts to pick his spirits up, but he agrees to fight a nearby beast if only to convince you that you are wasting your time. He heads off in search of an opponent and you follow, eager to see his strength, or lack of, for yourself.","Try though he might, Kurobana is easily overwhelmed by his foe of choice. It falls upon you to vanquish the monsters and save the young Lupin from suffering anything other than embarrassment.","After you have taken care of the beasts, Kurobana thanks you, saying he hopes you now realize he is truly a lost cause. Clearly disheartened, the Lupin boy slowly makes his way back to Namai. You decide not to pursue Kurobana any further and report to Fukudo instead.","Upon hearing your report, Fukudo realizes that Kurobana will likely never be a warrior of his brother's caliber. He instead theorizes that Kurobana's talents may lie elsewhere. Fukudo asks that you extend your stay in Namai and try to help the Lupin boy discover a new way he can contribute to the village."],"objectives":["Lie in wait at the designated location.","/rally Kurobana's spirits.","Find Kurobana.","Rescue Kurobana.","Report to Fukudo."],"dialogue":[{"name":"FUKUDO","text":"I do not recall having seen you before. Would you happen to be a traveler? If so, may I request some of your time?"},{"name":"FUKUDO","text":"Have you heard of the Lupin? They are a race that appears to be half-man, half-wolf, and are known for their skill in combat."},{"name":"FUKUDO","text":"They have long served the king of Doma. However, when Doma fell to the Empire, many of them were conscribed into the imperial army; those who refused were forced to live out their lives as bandits."},{"name":"FUKUDO","text":"There is one family of Lupin that have called Namai their home for many a generation. They have acted as the village's protectors on countless occasions. We could not have survived without their aid."},{"name":"FUKUDO","text":"Their current oldest son had been the family's backbone up until he too was forced to enlist. Only the mother and her younger son remain now."},{"name":"FUKUDO","text":"The whole village expected their youngest to pick up where his brother left off. Sadly, he turned out to be one of the weakest Lupin I have ever seen."},{"name":"FUKUDO","text":"He has been unable to help the village in any way, much less protect it. The ferocious appetite his kind possess was looked upon kindly back when they kept the village safe, but people are not so understanding when the Lupin give back nothing in return."},{"name":"FUKUDO","text":"Even so, considering he spends most of his time looking after his sickly mother, I do not believe he is deserving of the villagers' ire."},{"name":"FUKUDO","text":"Assuming you are not just passing through, would you be willing to help the young Lupin?"},{"name":"FUKUDO","text":"My thanks. The boy I would have you help is named Kurobana. He lives up on that hill to the west."},{"name":"FUKUDO","text":"The Lupin I would have you help is named Kurobana. He lives up on that hill to the west."},{"name":"KUROBANA","text":"Do you have business with me?"},{"name":"KUROBANA","text":"Ah, the old man put you up to this? He certainly enjoys meddling in the affairs of others."},{"name":"KUROBANA","text":"It is as he says, I am not much of a fighter. My bite is as soft as a moogle's."},{"name":"KUROBANA","text":"Of course, I would love to protect the village just like my brother, but there is a reason he was conscribed and not I."},{"name":"KUROBANA","text":"The only thing I am good at is gathering herbs for my mother. I spend the rest of my time trying not to get in the way of the other villagers."},{"name":"KUROBANA","text":"At any rate, if you have no further business with me, I must head off to grind some herbs to make Mother's medicine."},{"name":"SYSTEM","text":"Kurobana could do with a confidence boost. Try to <span class=\"highlight\">rally</span> his spirits."},{"name":"KUROBANA","text":"You again? If you have nothing to say to me, please leave me to tend to Mother."},{"name":"KUROBANA","text":"I have no idea why you are so interested in me, but fine. I shall do battle with one of the nearby beasts if that will satisfy you."},{"name":"KUROBANA","text":"That is not to say I will prove Fukudo wrong. I am merely doing this to show that you should not have expected aught of me."},{"name":"KUROBANA","text":"Thank you for intervening. I do hope you have seen enough now to accept that Fukudo was right."},{"name":"KUROBANA","text":"I am not and never will be a warrior. Hakuro is my brother in name only."},{"name":"KUROBANA","text":"Now please, leave me be. Tell Fukudo that you helped me and I once again proved to be hopeless."},{"name":"FUKUDO","text":"I caught a glimpse of Kurobana heading off somewhere with a spear a while ago. Tell me, how did he fare?"},{"name":"FUKUDO","text":"Hopeless as ever, you say? Hakuro is such a fine warrior─I cannot believe Kurobana does not possess the same potential."},{"name":"FUKUDO","text":"There must be some way we can help him. Surely."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Have him try something besides fighting."},{"name":"A1","text":"Nothing comes to mind..."},{"name":"FUKUDO","text":"I had not thought of that before, but it is quite an idea!"},{"name":"FUKUDO","text":"Yes, this is quite a predicament... Wait, there is no reason to force him to fight if he cannot. Let us have him try his hand at something else!"},{"name":"FUKUDO","text":"It seems my mind has grown slow in my old age. Not all Lupin are born fighters."},{"name":"FUKUDO","text":"Let us find Kurobana and see if there is not something else he is skilled at."},{"name":"FUKUDO","text":"I apologize for stopping you on your journey, but if you have the time to help, please let me know."}],"reward":{"gil":800,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"quests":[68035]},"next":[68273]},"partials":[{"type":"npc","id":"1019312","obj":{"i":1019312,"n":"Fukudo","l":2410,"q":4}},{"type":"npc","id":"1022399","obj":{"i":1022399,"n":"Kurobana","l":2410,"q":3}},{"type":"npc","id":"1022400","obj":{"i":1022400,"n":"Kurobana","l":2410,"q":1}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68273","obj":{"i":68273,"n":"Kurobana vs. the Rice Sacks","g":109,"l":"Yanxia","s":4130,"f":1}}]}