{"quest":{"name":"Kurobana vs. the Arrowheads","location":"Yanxia","id":68274,"patch":4.0,"sort":4140,"icon":100702,"unlocksFunction":1,"eventIcon":71341,"issuer":1019312,"target":1019312,"involved":[1022414,1022415,1022416,1022425],"genre":109,"journal":["Fukudo has thought long and hard about this.","Fukudo states that he thinks Kurobana might be suited to plucking weeds from paddy fields. He also explains that “Namai” is actually a local term for the arrowhead: an aquatic plant often found in paddies. You accompany Kurobana to go and talk with Hayabusa, a friend of Fukudo's, and ask if he will let you clear his paddy fields of weeds.","Hayabusa is delighted by the offer of help and quickly assigns you and Kurobana areas to work on. While the original plan was for only Kurobana to tend the paddies, you are convinced to join him as it is a good chance to experience the local culture. Dusting off your hands, you prepare to rip out some weeds.","Hayabusa praises both you and Kurobana for a job well done. However, just as Kurobana is starting to believe he may have finally found a way to contribute to Namai, he mentions that Hayabusa's paddies smelled somewhat odd. The rice farmer takes great offense at this remark, making it clear that he would like Kurobana to leave immediately.","Fukudo will likely be disappointed once he learns that Kurobana has failed to succeed, despite being able to handle the work itself.","Kurobana reiterates that he meant no harm and that Hayabusa's paddies genuinely gave off a strange smell. Fukudo accepts that Kurobana bore no ill will and says he will apologize on the boy's behalf."],"objectives":["Speak with Hayabusa.","Pluck arrowheads.","Present the arrowheads to Hayabusa.","Report to Fukudo."],"dialogue":[{"name":"FUKUDO","text":"I have come to the conclusion that Kurobana might be best suited to plucking weeds from the paddy fields."},{"name":"FUKUDO","text":"Our village name is actually a local term for the arrowhead, an aquatic plant that infests paddy fields if not kept under control."},{"name":"FUKUDO","text":"This is precisely why removing weeds is such an important part of rice farming. I do hope you are up to this task, Kurobana. If you fail this time, do not expect to have another chance to prove yourself."},{"name":"FUKUDO","text":"I trust you understand the importance of this task?"},{"name":"KUROBANA","text":"Do not worry, Fukudo. Weed plucking actually sounds quite nice! I have always enjoyed little odd jobs like that."},{"name":"FUKUDO","text":"I recall Hayabusa mentioning he was looking for help tending to his paddy fields. Ask if he will allow you to remove the weeds from his paddies."},{"name":"FUKUDO","text":"<span class=\"highlight\">Forename</span>, please accompany him and make sure that he does as I have asked."},{"name":"FUKUDO","text":"<span class=\"highlight\">Forename</span>, please accompany Kurobana and make sure he does as I have asked."},{"name":"KUROBANA","text":"I have always enjoyed little odd jobs like plucking weeds."},{"name":"KUROBANA","text":"I will not fail this time. I cannot."},{"name":"HAYABUSA","text":"Ah, you must be the adventurer I have heard so much about. And Kurobana, nice to see you well. Is there something you would ask of me?"},{"name":"HAYABUSA","text":"How kind of you to offer!"},{"name":"HAYABUSA","text":"You can never be too careful with those pesky arrowheads."},{"name":"HAYABUSA","text":"Be sure to take care not to trample any of the rice plants when you are removing the weeds."},{"name":"HAYABUSA","text":"Why don't you help Kurobana with the work, adventurer? Not many travelers have the chance to experience such a core part of life in Namai."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Of course I'll help! I've done this before."},{"name":"A1","text":"You grasp the weed's stem before pulling, right?"},{"name":"HAYABUSA","text":"This is truly not your first time? Very impressive."},{"name":"HAYABUSA","text":"Precisely! Do not simply remove the top of the weed─you must remove the roots as well."},{"name":"HAYABUSA","text":"Well, there is nothing more for me to tell you both. Please work the paddies on top of this hill for me."},{"name":"HAYABUSA","text":"Well, there is nothing more for me to tell you both. Please work the paddies on top of this hill for me."},{"name":"KUROBANA","text":"I think this may be the job for me, <span class=\"highlight\">Forename</span>! Just watch, these paddies will be free of weeds by the time I am done."},{"name":"HAYABUSA","text":"Finished already?"},{"name":"HAYABUSA","text":"Fine work indeed! I see you made sure to remove the entire weed, including its roots."},{"name":"KUROBANA","text":"I also had Hayabusa check my work and it seems like I have finally found a job I can do."},{"name":"KUROBANA","text":"However, something did bother me a bit while I was working. It could be my imagination, but do these paddies not smell a little...odd?"},{"name":"HAYABUSA","text":"<span class=\"emphasis\">Odd</span>!? Is your nose quite all right? I tend to these fields daily and have never smelled anything strange."},{"name":"HAYABUSA","text":"Honestly, I cannot fathom how you think it acceptable to criticize my paddies when I have allowed you to work them. Do you make fun of people's children when you are a guest in their homes!?"},{"name":"HAYABUSA","text":"Or are you merely moaning because you had to engage in hard labor? Frankly, it matters not. Be gone with you!"},{"name":"KUROBANA","text":"I─I am sorry! I did not mean it as an insult."},{"name":"KUROBANA","text":"Thank you for all you have taught me, Hayabusa. I will leave you at once. Come along, <span class=\"highlight\">Forename</span>, let us go speak with Fukudo."},{"name":"HAYABUSA","text":"I have never smelled anything remotely strange in all my years tending these paddies!"},{"name":"KUROBANA","text":"I was not trying to insult Hayabusa. They <span class=\"emphasis\">did</span> smell different to other paddy fields."},{"name":"FUKUDO","text":"Tell me, have we at last found the right job for you?"},{"name":"KUROBANA","text":"Well...yes and no."},{"name":"FUKUDO","text":"So you are telling me that whilst the job went well, you managed to accidentally offend Hayabusa with a careless remark?"},{"name":"FUKUDO","text":"Would you care to explain why you could not just keep quiet?"},{"name":"KUROBANA","text":"(-Kurobana-)It was not my intention to upset him. I was simply surprised by the smell of the paddy fields..."},{"name":"FUKUDO","text":"Never mind. Hayabusa is a reasonable gentleman; I am sure he only reacted how he did because of how much effort he puts into his work. I will go and speak with him myself."}],"reward":{"gil":900,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68273]},"next":[68275]},"partials":[{"type":"npc","id":"1019312","obj":{"i":1019312,"n":"Fukudo","l":2410,"q":4}},{"type":"npc","id":"1022414","obj":{"i":1022414,"n":"Hayabusa","l":2410,"q":1}},{"type":"npc","id":"1022415","obj":{"i":1022415,"n":"Kurobana","l":2410,"q":1}},{"type":"npc","id":"1022416","obj":{"i":1022416,"n":"Kurobana","l":2410,"q":2}},{"type":"npc","id":"1022425","obj":{"i":1022425,"n":"Kurobana","l":2410,"q":3}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68273","obj":{"i":68273,"n":"Kurobana vs. the Rice Sacks","g":109,"l":"Yanxia","s":4130,"f":1}},{"type":"quest","id":"68275","obj":{"i":68275,"n":"Kurobana Holmes","g":109,"l":"Yanxia","s":4150,"f":1}}]}