{"quest":{"name":"The Sound of Civilized Life","location":"Yanxia","id":68278,"patch":4.0,"sort":4180,"eventIcon":71221,"issuer":1019300,"target":1019300,"involved":[1019295],"genre":109,"journal":["Gyoen of Yuzuka Manor seeks someone capable of seeing the deed he asks done."],"objectives":["Deliver the bundle of sun-dried fruits to Sentei of the Drunken Toad.","Obtain a collection of tiny pebbles.","Deliver the box of half-made bells and collection of tiny pebbles to Gyoen."],"dialogue":[{"name":"GYOEN","text":"Now there is the face of a lover of man! Yes, yes. A Namazu I may be, but I am a good judge of character above all else. But never mind that. There is work to be done!"},{"name":"GYOEN","text":"You should know, we Namazu here are taken with civilizing ourselves. This bell serves as proof of that. Yes, yes. Quite civilized, is it not?"},{"name":"GYOEN","text":"There was a kind and good-hearted artisan who crafted these bells. He would make a gift of one to every newborn Namazu on its nameday."},{"name":"GYOEN","text":"But it pains me to say, that dear, sweet old man has passed."},{"name":"GYOEN","text":"But our tradition must live on─for him and for us. I wish to ask for more bells from the grandson that survives him, yet I fear he will not see fit to waste his time dealing with a Namazu."},{"name":"GYOEN","text":"The bellmaker's grandson lives at the Drunken Toad, to the east of Namai. Here, take him this bundle of sun-dried fruits as a token of my good faith."},{"name":"GYOEN","text":"The bellmaker's grandson lives at the Drunken Toad, to the east of Namai. Take him the bundle of sun-dried fruits I gave you as a token of my good faith."},{"name":"SENTEI","text":"What is it you want of me?"},{"name":"SENTEI","text":"Hmph, so even the Namazu know the value of a good gift, do they? I confess, I'm not the artisan my grandfather was, but I have a store of wares he left behind. I can offer you half-made bells only. I will charge no coin for them."},{"name":"SENTEI","text":"Yet know they will not ring as they are. You need place within them round pebbles from the rocky lands just behind us. Then they will ring as true as they did in my grandfather's day."},{"name":"SENTEI","text":"Still, I cannot help but wonder. Why in the hells do the Namazu see fit to attach these bells to themselves like common cats? It is a strange thing, no?"},{"name":"SENTEI","text":"The bells will not ring as they are. You need place within them round pebbles from the rocky lands just behind us. Then they will ring as true as they did in my grandfather's day."},{"name":"GYOEN","text":"Welcome back! And tell me, were you able to speak with the bellmaker's grandson?"},{"name":"GYOEN","text":"Oh my, look at all of these bells! We'll not need any more for years to come. Thank you, my friend. To show you just how grateful I am, I've a tale for you! Yes, yes."},{"name":"GYOEN","text":"A looong time ago, longer now than it seems, Yanxia was a war-torn land. Much strife, much battle. Even we Namazu were recruited to render aid, running messages to and fro. Amidst the conflict, one very special Namazu was approached by a great general. The general asked the Namazu to swim across the One River and deliver for him a letter of great import."},{"name":"GYOEN","text":"The Namazu took to the water and swam his heart out. Arrows flew across the skies and fell into the river mere ilms from his barbels. Yet somehow he managed to elude death and arrive at the opposite shore. And the letter he delivered proved the key to victory for the general and his allies on the other side. With that, Yanxia was united and the nation of Doma was founded!"},{"name":"GYOEN","text":"That general was the great Ganen, the first king of Doma. But even from the throne, he did not forget his Namazu friends. To show his gratitude for our help in winning the war, he gifted our kind with a bell and named us his royal messengers. And that marked the first time any Namazu rose to such heights."},{"name":"GYOEN","text":"That is why to this day we Namazu wear our bells with great pride and honor. See? So it is true, what I told you before. We Namazu here are quite civilized indeed."}],"reward":{"gil":676,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68270]}},"partials":[{"type":"npc","id":"1019300","obj":{"i":1019300,"n":"Gyoen","l":2410,"q":1}},{"type":"npc","id":"1019295","obj":{"i":1019295,"n":"Sentei","l":2410,"q":4}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68270","obj":{"i":68270,"n":"Perchance to Hanami","g":109,"l":"Yanxia","s":4160,"f":1}}]}