{"quest":{"name":"Ring My Bell","location":"Yanxia","id":68279,"patch":4.0,"sort":4190,"eventIcon":71221,"issuer":1019299,"target":1019299,"involved":[1021825],"genre":109,"journal":["Gyoboku of Yuzuka Manor is looking for an able adventurer to aid in an errand."],"objectives":["Use the Namazu neck bell and search for the terrified Namazu.","Survey the destination and slay any pescatarians you find.","Speak with the terrified Namazu.","Report back to Gyoboku."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, you will receive no guidance from the journal or the duty list. You will need to read the text carefully and decipher the clues to determine your next course of action."},{"name":"GYOBOKU","text":"Oh yes, you will do nicely. Quite nicely. Please, you must help. My brother set out fishing and should have been back bells ago, but has yet to return."},{"name":"GYOBOKU","text":"I went looking for him and found his bell far, far to the north and east─on the opposite shore of the One River. No Namazu would ever be so careless as to drop their bell. It is the most important of all our possessions. I fear something must have happened to him. Something horrible, something dreadful."},{"name":"GYOBOKU","text":"We are always with our bells, and we bear a strong connection with them. Indeed, if you ring a Namazu's bell near its owner, it will sound a most beautiful note. Please, use my brother's bell to search for him!"},{"name":"GYOBOKU","text":"I looked downstream from where I found it, but there was no sign of him. I'd like you to search upstream, where that enormous wall lies."},{"name":"SYSTEM","text":"Sound the Namazu neck bell and use its ring to search for the terrified Namazu."},{"name":"SYSTEM","text":"I found my brother's bell far, far to the north and east─on the opposite shore of the One River. I looked downstream from where I found it, but there was no sign of him. I'd like you to search upstream, where that enormous wall lies."},{"name":"SYSTEM","text":"The bell rings faintly. Its owner is likely very far away."},{"name":"SYSTEM","text":"The bell rings normally. Its owner is likely not far away."},{"name":"SYSTEM","text":"The bell rings shrill and clear. Its owner is likely very nearby."},{"name":"GYOBOKUBROTHER02743","text":"Wh-Who are you? Please d-don't hurt me."},{"name":"GYOBOKUBROTHER02743","text":"Y-You have my bell! Wherever did you find it!?"},{"name":"GYOBOKUBROTHER02743","text":"You have done this much, perhaps you are willing to do a little more. There is a pack of pescatarians prowling nearby, and the mere thought of them has me too frightened to move. Could you patrol the area and put down any you might come across?"},{"name":"GYOBOKUBROTHER02743","text":"There is a pack of pescatarians prowling nearby, and the mere thought of them has me too frightened to move. Could you patrol the area and put down any you might come across?"},{"name":"GYOBOKUBROTHER02743","text":"Thank you, oh, thank you! I am forever in your debt. Now I can finally make my way back to the manor."},{"name":"GYOBOKU","text":"My brother returned safely, all thanks to you. You have my deepest gratitude, and his."},{"name":"GYOBOKU","text":"Namazu are a favorite food of pescatarians. More of my friends than I care to admit have found their way into a pescatarian belly."},{"name":"GYOBOKU","text":"But by your hand, that fate did not find my brother this day. Neither he nor I will ever be able to repay the debt we owe you."}],"reward":{"gil":745,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68270]}},"partials":[{"type":"npc","id":"1019299","obj":{"i":1019299,"n":"Gyoboku","l":2410,"q":1}},{"type":"npc","id":"1021825","obj":{"i":1021825,"n":"Terrified Namazu","l":2410,"q":1}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68270","obj":{"i":68270,"n":"Perchance to Hanami","g":109,"l":"Yanxia","s":4160,"f":1}}]}