{"quest":{"name":"Kurobana vs. the Rice Sacks","location":"Yanxia","id":68273,"patch":4.0,"sort":4130,"icon":100702,"unlocksFunction":1,"eventIcon":71341,"issuer":1019312,"target":1019312,"involved":[1022399,1022421,1022422,1022423,1022424,1022425,1022426],"genre":109,"journal":["Fukudo would have you speak to Kurobana once more.","Fukudo thanks you for deciding to remain in Namai and help Kurobana. He has come to the conclusion that the Lupin boy might be suited to work which requires strength, but is not of an aggressive nature─specifically, transporting sacks of rice. Fukudo says he shall go inform his friend who monitors the rice storehouse of his idea and bids you talk to Kurobana.","Kurobana is initially caught off guard by Fukudo's suggestion, but he eventually agrees to transport rice if it will help the village as a whole. You follow Kurobana as he heads off to talk with Shirojishi, Fukudo's friend.","You are greeted by a jovial Shirojishi who wastes no time assigning Kurobana his first task. Kurobana remarks that while he is no fighter, he is certainly strong enough to carry the rice as far as the village storehouse. After watching Kurobana set off, rice sack in hand, Shirojishi bids you monitor his progress and encourage him if he tires on his way to his destination.","When you catch up to Kurobana, it is evident that he is struggling under the weight of the local produce. You do your best to lift his spirits, hoping it will give him the strength for one final push. Kurobana seems to regain some of his lost stamina and embarks on the last stretch of his journey to the storehouse.","Kurobana triumphantly drops his rice sack thinking his work for the day is done. When Hachiboku lets him know that there are still three more sacks to be transported, the Lupin boy decides enough is enough. You prepare to go and inform Fukudo of yet another failure.","You find that Fukudo has already gotten a hold of Kurobana and remonstrated with the boy. The young Lupin is forced to promise that he shall not give up the next time he is faced with another challenge. Fukudo muses that Kurobana might be better suited to a job that requires little strength."],"objectives":["Speak with Kurobana.","Speak with Shirojishi.","Go to Kurobana and /psych him up.","Speak with Kurobana.","Report to Fukudo."],"dialogue":[{"name":"FUKUDO","text":"I see you have chosen to stay and help. You have my thanks. I believe Kurobana may be best suited to work that involves heavy lifting."},{"name":"FUKUDO","text":"As you are doubtless aware, this village's economy is entirely supported by rice farming. All harvested rice is stuffed into straw bags and carried to a nearby storehouse."},{"name":"FUKUDO","text":"While Kurobana may not be a fighter, he is still a Lupin, and as such possesses strength greater than most men. I imagine he could put this to use by transporting rice."},{"name":"FUKUDO","text":"I will inform the storehouse manager, Shirojishi, of the situation. Could you discuss this with Kurobana for me?"},{"name":"FUKUDO","text":"I am sure your word will carry more weight with him than mine would."},{"name":"FUKUDO","text":"I will tell Shirojishi about Kurobana. Could you discuss my idea with the boy?"},{"name":"KUROBANA","text":"Ah, I see you have not yet left Namai. I hope you have not come to ask me to fight again."},{"name":"KUROBANA","text":"Fukudo wants me to try carrying rice? There he goes again meddling in the affairs of others."},{"name":"KUROBANA","text":"That said, if it will help the village, then I can hardly refuse. I shall go and talk to Shirojishi."},{"name":"KUROBANA","text":"It seems Fukudo has already talked to Shirojishi. Honestly, once he has a plan, he wastes no time in putting it into action."},{"name":"SHIROJISHI","text":"Kurobana, good to see you! My thanks for your help as well, adventurer. Fukudo has already told me all I need to know."},{"name":"SHIROJISHI","text":"Let us start by having you carry this sack right here. It is a bit on the heavy side, but do you think you can handle it?"},{"name":"KUROBANA","text":"Do not worry, Shirojishi. I may not be much of a warrior, but I am confident in my strength!"},{"name":"KUROBANA","text":"Oof!"},{"name":"SHIROJISHI","text":"Whatever you do, do <span class=\"emphasis\">not</span> drop it!"},{"name":"SYSTEM","text":"Kurobana strides off towards the village storehouse with a spring in his step."},{"name":"SHIROJISHI","text":"I do hope he is up to the task. I have seen many a man struggle to complete their first journey to the storehouse."},{"name":"SHIROJISHI","text":"Pray do me a favor. If he struggles along the way, give him some encouragement on my behalf. It may seem like a test of strength, but carrying rice is ultimately a mental battle."},{"name":"SHIROJISHI","text":"If he struggles along the way, give him some encouragement on my behalf. It may seem like a test of strength, but carrying rice is ultimately a mental battle."},{"name":"KUROBANA","text":"&lt;pant&gt; &lt;pant&gt; I...I did not expect the rice would be quite so heavy."},{"name":"KUROBANA","text":"Leave me be. I need to...&lt;pant&gt;...rest."},{"name":"SYSTEM","text":"<span class=\"highlight\">Psych</span> up Kurobana."},{"name":"KUROBANA","text":"Thank...&lt;pant&gt;...you."},{"name":"KUROBANA","text":"I really wonder if there is no better way rice could be transported. I have had to check multiple times that it was straw and not a knife that was cutting into my shoulder!"},{"name":"KUROBANA","text":"But thanks to your encouragement, I think I may just be able to make it to the storehouse."},{"name":"KUROBANA","text":"Oof!"},{"name":"SYSTEM","text":"Summoning the last of his strength, Kurobana once again sets off in the direction of the village storehouse."},{"name":"HACHIBOKU","text":"I had heard from Shirojishi that Kurobana was going to try his hand at this, but I never expected him to succeed!"},{"name":"KUROBANA","text":"It took every fiber of my being, but I did it! Who knew this would be such tiring work..."},{"name":"HACHIBOKU","text":"Good work, Kurobana. As you have noticed, transporting rice is not quite as easy as it looks. But given time, I am sure you too will become quite good at it!"},{"name":"HACHIBOKU","text":"Now, you have had ample time for a rest. Make another three trips to and from the storehouse and your work will be done for the day."},{"name":"KUROBANA","text":"Three trips!? I thought that was it... Sorry, I do not think I am suited to this after all."},{"name":"HACHIBOKU","text":"Hmph. If <span class=\"emphasis\">that</span> is how he responds to the slightest hardship then I do not think we will have any use for him. Pray tell Fukudo as much."},{"name":"HACHIBOKU","text":"Tell Fukudo that we no longer require Kurobana's help."},{"name":"KUROBANA","text":"How could anyone carry so much rice in one day?"},{"name":"FUKUDO","text":"Ah, <span class=\"highlight\">Forename</span>. I just caught Kurobana trying to abandon his duties."},{"name":"FUKUDO","text":"It seems he was able to carry one sack of rice, but shirked from the idea of carrying three more. Admittedly, he is not wrong to think it grueling work. I too struggled to carry even my first load of rice."},{"name":"FUKUDO","text":"However, if you continue like this, the whole village will think you a weak-willed coward!"},{"name":"KUROBANA","text":"I am sorry, Fukudo. You have my word that I will not give up like this again."},{"name":"FUKUDO","text":"Perhaps next time we should have you try a job that does not require great strength..."}],"reward":{"gil":800,"items":[{"id":18408,"one":1,"hq":1},{"id":18409,"one":1,"hq":1},{"id":18410,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68272]},"next":[68274]},"partials":[{"type":"npc","id":"1019312","obj":{"i":1019312,"n":"Fukudo","l":2410,"q":4}},{"type":"npc","id":"1022399","obj":{"i":1022399,"n":"Kurobana","l":2410,"q":3}},{"type":"npc","id":"1022421","obj":{"i":1022421,"n":"Shirojishi","l":2410,"q":1}},{"type":"npc","id":"1022422","obj":{"i":1022422,"n":"Kurobana","l":2410,"q":1}},{"type":"npc","id":"1022423","obj":{"i":1022423,"n":"Kurobana","l":2410,"q":1}},{"type":"npc","id":"1022424","obj":{"i":1022424,"n":"Kurobana","l":2410,"q":1}},{"type":"npc","id":"1022425","obj":{"i":1022425,"n":"Kurobana","l":2410,"q":3}},{"type":"npc","id":"1022426","obj":{"i":1022426,"n":"Hachiboku","l":2410,"q":1}},{"type":"item","id":"18408","obj":{"i":18408,"n":"Star Spinel Choker of Fending","l":273,"c":54971,"t":40,"p":16215}},{"type":"item","id":"18409","obj":{"i":18409,"n":"Star Spinel Choker of Slaying","l":273,"c":54971,"t":40,"p":16215}},{"type":"item","id":"18410","obj":{"i":18410,"n":"Star Spinel Choker of Aiming","l":273,"c":54971,"t":40,"p":16215}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68272","obj":{"i":68272,"n":"Courage the Cowardly Lupin","g":109,"l":"Yanxia","s":4120,"f":1}},{"type":"quest","id":"68274","obj":{"i":68274,"n":"Kurobana vs. the Arrowheads","g":109,"l":"Yanxia","s":4140,"f":1}}]}