{"quest":{"name":"Kurobana vs. Gyorin","location":"Yanxia","id":68276,"patch":4.0,"sort":4280,"icon":100703,"unlocksFunction":1,"eventIcon":71341,"issuer":1022399,"target":1023465,"involved":[1023237,1023463,1023464,1023466,1023467],"genre":109,"journal":["Kurobana requires your help once more.","Kurobana has steadily been gaining the villagers' trust by continuing to pluck weeds and examine the local paddies. However, he is concerned that Namai would be defenseless should another creature attack. You tell Kurobana that Gyorin has been trying to sell some imperial weapons of late and agree to introduce him to the Namazu merchant.","Kurobana is impressed by Gyorin's wares and makes it clear he would like to buy them. Unfortunately, the Namazu merchant believes the guns to be worth quite a lot─enough gil to live comfortably for a decade being his valuation. Shirojishi then appears claiming the village is under attack. While Kurobana has said he cannot afford to pay Gyorin's prices, Hayabusa asks if they can borrow the guns to protect Namai. You convince Gyorin to let the villagers take the guns and negotiate some form of payment later.","Gyorin, unsure as to whether he can trust the villagers, asks you to go with him to Namai. He wishes to collect his payment as soon as they have slain the creatures threatening their paddies.","Hayabusa cannot stop enthusing about how skillfully Kurobana slayed the two penghou with an imperial firearm. Gyorin then arrives on the scene, keen to get down to business.","Just as it is starting to look like the deal is not going to happen, a pile of nearby persimmons catches Gyorin's eye. He is all too eager to create a dye with them which he would use to make his own unique apron. Kurobana is somewhat confused by the merchant's thought process, but agrees to trade him one hundred persimmons in exchange for the imperial weaponry."],"objectives":["Speak with Gyorin.","Speak with Gyorin again.","Speak with Hayabusa.","Speak with Gyorin."],"dialogue":[{"name":"KUROBANA","text":"Ah, <span class=\"highlight\">Forename</span>, how goes your journey?"},{"name":"KUROBANA","text":"I have been keeping myself busy plucking weeds and checking people's paddies. Slowly but surely I feel that the villagers are beginning to warm to me."},{"name":"KUROBANA","text":"However, there is one issue that has been worrying me of late: what to do if another beast appears seeking to harm our way of life. We can hardly continue relying on your aid."},{"name":"KUROBANA","text":"There are a few in the village that have experience fighting, but even they cannot do much without proper weapons. There is a limit to how effective farming tools can be in battle."},{"name":"KUROBANA","text":"A Namazu that sells imperial weapons? Hmm, that could be worth investigating."},{"name":"KUROBANA","text":"Would you be so kind as to introduce us? I shall bring Hayabusa along as well. You said the Namazu lives in Yuzuka Manor, yes? We will meet you there."},{"name":"KUROBANA","text":"You said the Namazu lives in Yuzuka Manor, yes? Hayabusa and I will meet you there."},{"name":"GYORIN","text":"Why, <span class=\"highlight\">Forename</span>. To what do I owe the pleasure?"},{"name":"GYORIN","text":"I am most definitely still in possession of the weapons, yes, yes. I put them in storage as no one seemed even slightly interested in purchasing them."},{"name":"GYORIN","text":"I tried selling them in Doma, but my efforts were met with great displeasure. They said my actions insulted their honor, that they never wanted to see imperial weapons again."},{"name":"GYORIN","text":"Even Gyofu has attested to the quality of the weaponry. No, no, I do not know why I struggle to sell them."},{"name":"KUROBANA","text":"I had heard rumors of this place, but I never imagined there were so many Namazu living here."},{"name":"GYORIN","text":"Welcome, valued guests! Could I interest you in any of my wares?"},{"name":"KUROBANA","text":"We are searching for a Namazu selling imperial weapons."},{"name":"GYORIN","text":"Well, you are in luck for that is me! I shall bring the goods to you right this moment."},{"name":"KUROBANA","text":"Imperial guns... Even those in Namai that cannot handle a spear or a sword may be able to use these."},{"name":"GYORIN","text":"Indeed, indeed! You seem like a Lupin who knows a bargain when he sees one."},{"name":"KUROBANA","text":"We will take them. Name your price."},{"name":"GYORIN","text":"Enough gil to live comfortably for a decade or so should suffice."},{"name":"KUROBANA","text":"Have you lost your mind!?"},{"name":"SHIROJISHI","text":"Kurobana, Hayabusa, the village is in trouble!"},{"name":"SHIROJISHI","text":"More of those creatures have appeared and they're ruining our paddies!"},{"name":"KUROBANA","text":"What!?"},{"name":"HAYABUSA","text":"May we borrow these weapons first and negotiate payment later? The village cannot wait!"},{"name":"GYORIN","text":"I do hope you are not trying to trick me."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We'll pay you later!"},{"name":"A1","text":"We need to try before we buy!"},{"name":"GYORIN","text":"You speak the truth, yes, yes?"},{"name":"GYORIN","text":"But of course! If you use them first, you can admire their qualities and be convinced to purchase them. You are a fine merchant, <span class=\"highlight\">Forename</span>!"},{"name":"GYORIN","text":"If you are friends of <span class=\"highlight\">Forename</span> then you have my trust. I will receive payment once you are done!"},{"name":"KUROBANA","text":"My thanks. Let us hurry back to the village!"},{"name":"GYORIN","text":"Please make sure they do pay me. I only lent them the weapons because you introduced them to me."},{"name":"GYORIN","text":"In fact, let us both go to Namai to make certain that this deal reaches a satisfactory conclusion."},{"name":"KUROBANA","text":"Did I truly just do that?"},{"name":"HAYABUSA","text":"Ah, adventurer! You will not believe this."},{"name":"HAYABUSA","text":"Our very own Kurobana slayed these foul beasts."},{"name":"HAYABUSA","text":"He is truly a natural with a rifle. It was as if I was watching a veteran hunter!"},{"name":"HAYABUSA","text":"I am sure he is good enough to protect the village if he is equipped with the right gun. In time, he may even become just as effective as his brother!"},{"name":"KUROBANA","text":"My instincts took control of me... I'm honestly not entirely sure what I just did."},{"name":"KUROBANA","text":"But perhaps you are right. With practice, I might be able to fill the role my brother used to serve."},{"name":"GYORIN","text":"Wh-What are these creatures!?"},{"name":"KUROBANA","text":"Ah, merchant. Your weapons were exactly what we needed. The penghou never stood a chance."},{"name":"GYORIN","text":"I am most glad to hear that you found my wares to your liking."},{"name":"GYORIN","text":"Now, now, let us talk business by the Tenkonto."},{"name":"KUROBANA","text":"I asked Fukudo to join us to help haggle with your merchant friend. I do hope we are able to get the weapons for a fair price. They may be my only hope of living up to my brother's legacy."},{"name":"HAYABUSA","text":"With the right weapon, Kurobana may prove to be just as capable as Hakuro in a fight."},{"name":"GYORIN","text":"You were saying that you cannot give me enough gil to live on for ten years, yes, yes?"},{"name":"GYORIN","text":"In that case, why don't you try offering me something else of equal value?"},{"name":"KUROBANA","text":"I fear that we may struggle to find anything you would consider to be worth that much in Namai..."},{"name":"GYORIN","text":"I risked my life to obtain these guns. It is only fair I receive something substantial for them."},{"name":"KUROBANA","text":"Could you allow us some time to think?"},{"name":"GYORIN","text":"If that is truly what you require."},{"name":"GYORIN","text":"But pray tell me, just what are those?"},{"name":"FUKUDO","text":"Well, they are persimmons. Are you not familiar with the fruit?"},{"name":"GYORIN","text":"If I were to use those to make an orange dye I could create a magnificent apron that is mine and mine alone!"},{"name":"GYORIN","text":"How about you trade me one hundred persimmons for the weapons?"},{"name":"KUROBANA","text":"Is that truly enough for you?"},{"name":"GYORIN","text":"Yes, yes! Do you agree to my proposal?"},{"name":"KUROBANA","text":"Well, yes. I suppose we do."},{"name":"GYORIN","text":"<span class=\"highlight\">Forename</span>, thank you oh so very very much! These people have given me something of great value and it was you who introduced them to me!"}],"reward":{"gil":1500,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68275]},"next":[68632]},"partials":[{"type":"npc","id":"1022399","obj":{"i":1022399,"n":"Kurobana","l":2410,"q":3}},{"type":"npc","id":"1023465","obj":{"i":1023465,"n":"Gyorin","l":2410,"q":1}},{"type":"npc","id":"1023237","obj":{"i":1023237,"n":"Gyorin","l":2410,"q":5}},{"type":"npc","id":"1023463","obj":{"i":1023463,"n":"Hayabusa","l":2410,"q":1}},{"type":"npc","id":"1023464","obj":{"i":1023464,"n":"Kurobana","l":2410,"q":1}},{"type":"npc","id":"1023466","obj":{"i":1023466,"n":"Kurobana","l":2410,"q":1}},{"type":"npc","id":"1023467","obj":{"i":1023467,"n":"Hayabusa","l":2410,"q":1}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68275","obj":{"i":68275,"n":"Kurobana Holmes","g":109,"l":"Yanxia","s":4150,"f":1}},{"type":"quest","id":"68632","obj":{"i":68632,"n":"Something Fishy This Way Comes","g":54,"l":"The Azim Steppe","s":1,"f":1}}]}