{"quest":{"name":"Dearest Keiko","location":"Yanxia","id":68271,"patch":4.0,"sort":4110,"eventIcon":71221,"issuer":1021822,"target":1023699,"involved":[1021823,1021824],"genre":109,"journal":["The body lying in front of you appears to be gripping something in its hand."],"objectives":["Use the mauled man's watercolor sketch to search for his former lover.","Speak with the dispirited woman."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, you will receive no guidance from the journal or the duty list. You will need to read the text carefully and decipher the clues to determine your next course of action."},{"name":"SYSTEM","text":"A ravaged corpse lies in front of you. You notice its lifeless left hand contains what appears to be a journal."},{"name":"SYSTEM","text":"The book's jacket has been stained with blood and taken on a crimson hue. Flipping through its pages, you find what seems to be the owner's final entry."},{"name":"SYSTEM","text":"(-Bloodstained Journal-)Dearest Keiko,<br>I often wonder if you have come to resent me for leaving you behind."},{"name":"SYSTEM","text":"(-Bloodstained Journal-)Every moment spent without you by my side causes my heart to grow weaker and weaker. There has been many a time where I almost gave up, abandoned hope. But I knew I could not until the day I fulfilled my promise to you."},{"name":"SYSTEM","text":"(-Bloodstained Journal-)The fact I now know this day shall never come pains me more than I could ever express using mere words. Luck has carried me back home, but it does not seem it can carry me any further."},{"name":"SYSTEM","text":"(-Bloodstained Journal-)I would not protest were you to think me a coward. I wanted nothing more than to gaze into those beautiful eyes and tell you just how sorry I am. Tell me, do you still await my return where we swore we would be reunited someday?"},{"name":"SYSTEM","text":"You spy a small sketch tucked in between the journal's final page and its cover. It seems to be of the location where the two lovers promised they would be reunited."},{"name":"SYSTEM","text":"Map icons will not be displayed for the duration of this quest. Use the mauled man's sketch to search for his former lover."},{"name":"SISTER02735","text":"Is there something I can help you with?"},{"name":"Q1","text":"Show the watercolor sketch to the dispirited woman?"},{"name":"SISTER02735","text":"Wh-Where did you find this?"},{"name":"SISTER02735","text":"It was in the back of a dead man's journal?"},{"name":"SISTER02735","text":"I am sad to say I am not the woman you are searching for. However, I do know where she is."},{"name":"SISTER02735","text":"Follow me. I shall take you to meet her."},{"name":"SISTER02735","text":"My sister rests peacefully beneath this tree nowadays."},{"name":"SISTER02735","text":"We lost both our parents during the imperial invasion. As I was still but an infant it fell on my sister's young shoulders to raise me."},{"name":"SISTER02735","text":"And that was far from being her only responsibility. She had to work day and night in order to keep me fed while paying the Empire's extortionate taxes. It was five years ago to the day that she fell ill from the strain and..."},{"name":"SISTER02735","text":"She continued to wait for her beloved right up until she drew her last breath."},{"name":"SISTER02735","text":"I heard from my sister that he left Namai as he was a major figure in the rebellion. He knew the Empire would have his head were he to remain here."},{"name":"SISTER02735","text":"Even knowing this, I was still unable to find it in my heart to forgive him."},{"name":"SISTER02735","text":"It was only out of respect to my sister's faith in her dearest I decided to visit, from time to time, the area where they said they would meet again."},{"name":"SISTER02735","text":"Never did I expect things to conclude in this manner."},{"name":"SISTER02735","text":"I wish to compensate you for taking the trouble to deliver this news to me. Please come see me in the village."},{"name":"SISTER02735","text":"I have talked with the villagers and it has been agreed that my sister's beloved will be buried next to her. At least they shall be reunited in death..."},{"name":"SISTER02735","text":"Now that I know how he truly felt, I think I too have it in me to forgive him."},{"name":"SISTER02735","text":"I could not have done so were it not for your help. My sincerest thanks to you, kind stranger."}],"reward":{"gil":574,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"quests":[68035]}},"partials":[{"type":"npc","id":"1021822","obj":{"i":1021822,"n":"Mauled Man","l":2410,"q":1}},{"type":"npc","id":"1023699","obj":{"i":1023699,"n":"Dispirited Woman","l":2410,"q":1}},{"type":"npc","id":"1021823","obj":{"i":1021823,"n":"Dispirited Woman","l":2410,"q":1}},{"type":"npc","id":"1021824","obj":{"i":1021824,"n":"Dispirited Woman","l":2410,"q":1}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}}]}