{"quest":{"name":"Gyorin the Namazu","location":"Yanxia","id":68284,"patch":4.0,"sort":4230,"icon":100704,"unlocksFunction":1,"eventIcon":71341,"issuer":1023236,"target":1023237,"involved":[1023238],"genre":109,"journal":["Gyorin of Yuzuka Manor is casting a perplexed look in your direction.","Gyorin wishes to enlist your aid in his struggle to become a successful and influential merchant. Speak with him at the storehouse in the Glittering Basin where he hoards his wares.","Gyorin shows you his proud store of treasures and trinkets, which to the discerning eye is unequivocally a midden of unsellable garbage and refuse. Accepting of your harsh appraisal, he resolves to take up fishing to source his mercantile endeavors. Speak with Gyorin at the Glittering Basin once more.","At the outset of his new life of fishing, Gyorin managed to drop his precious and prized pole. Search the Glittering Basin for Gyorin's fishing rod.","You have found Gyorin's fishing rod. Return it to him at the Glittering Basin.","You have returned Gyorin's fishing rod to him. He confides in you that since dropping the pole, he has been considering the pursuit of other means to make his way as a merchant. Travel to the Glittering Basin and speak with him once again.","After turning to the sagacious teachings written in his emakimono, Gyorin decides to engage in the prospecting and mining of mineral wealth."],"objectives":["Speak with Gyorin.","Speak with Gyorin once more.","Find Gyorin's fishing rod.","Return Gyorin's fishing rod to him.","Speak with Gyorin."],"dialogue":[{"name":"GYORIN","text":"You look not as one who hails from here. May I inquire, are you a traveler, an adventurer? If so, there is a deed I would ask of you. "},{"name":"GYORIN","text":"But before we delve into details, introductions are in order. I am Gyorin, Gyorin I am. I live in this shack with others like myself. And I, like many, have a dream. Yes, yes."},{"name":"GYORIN","text":"I aspire to become the greatest of merchants! To be rich, to be wealthy, beyond compare. And then to have an apron made for me that is mine and mine alone. Yes, yes, that is my dream."},{"name":"GYORIN","text":"Among the many treasures in our shack are a collection of emakimono that someone left behind. Beautiful pictures, wise words. One tells the ancient tale of a poor merchant who rose to great heights. Yes, yes. Ever since reading that, I have dreamt of doing the same."},{"name":"GYORIN","text":"In that very tale, an able adventurer much like yourself appeared. Quite clever, quite knowing. He gifted to the merchant his wisdom, his ways. And lo, here you are! It can be no mere coincidence. It is fate, destiny!"},{"name":"GYORIN","text":"You must forgive my manners. In my excitement I neglected to ask your name, your title. Might I have it?"},{"name":"GYORIN","text":"<span class=\"highlight\">Forename Surname</span>, is it? Then I shall call you <span class=\"highlight\">Forename</span>. Yes, yes, that will do nicely. Now, where were we?"},{"name":"GYORIN","text":"Ah, of course. I was hoping to enlist your aid in my rise through the merchant ranks. I'm afraid I am quite forgetful these days. I am, I am."},{"name":"GYORIN","text":"My storehouse lies not far from here. Would you do me the honor of paying a visit? I keep all my wares there. My treasures, my trinkets. I should very much like to hear your honest appraisal. Yes, yes."},{"name":"GYORIN","text":"Come, then, <span class=\"highlight\">Forename</span>. You need only follow me. This way, this way."},{"name":"GYORIN","text":"I'll be right back with it. You need only wait a moment!"},{"name":"GYORIN","text":"Here we are! My pride, my passion. This is a collection of everything I have come to gather, to own. It is quite remarkable, is it not? Amazing, astounding."},{"name":"GYORIN","text":"Here we have grilled mayflies. Oh, and here some desiccated toad. And this lovely vase here simply begs to have things placed within it, does it not? Yes, yes, it does."},{"name":"GYORIN","text":"Well, what do you think? Come now, be honest, be true. What do your eyes see that will fetch a fair price at market? Hm?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"None. There is nothing here I would part with a single gil for."},{"name":"A1","text":"Too many to count. It is truly a trove fit for a dragon."},{"name":"GYORIN","text":"A-Are you sure? But I have spent days, years, collecting it all. Surely there must be something of value, of worth. I just... I don't... I can't..."},{"name":"GYORIN","text":"You are very gracious, very kind. Just as the adventurer in the emakimono. But your eyes betray your words. It is plain you see nothing of value here, nothing of worth."},{"name":"GYORIN","text":"Nevertheless, a dream is a dream. And I shall not relent. No, no. I will find another path to greatness, another way to obtain what people desire. For I am destined to be a merchant of renown. Yes, yes!"},{"name":"GYORIN","text":"Now, bearing all that in mind... Whatever shall I do? Hm, hm?"},{"name":"GYORIN","text":"Yes, yes, I do believe an idea has come to me. Fish! People eat fish, and so it stands to reason they must buy them, purchase them."},{"name":"GYORIN","text":"I will take to fishing to provision my own supply, my own stock. I will bring my catch to you, <span class=\"highlight\">Forename</span>, and with your adventuring wisdom you can tell me which fish will sell and which will not."},{"name":"GYORIN","text":"Your kind and mine have very different tastes, different likes. Yes, yes, we do. It will fall to you to enlighten me as to which fish agree with the palates of men. Until then, I shall await you by the water!"},{"name":"GYORIN","text":"Oh, this will not serve. It will not serve at all. No, no."},{"name":"GYORIN","text":"I set out to fish, just as we had spoken about when last we met. But I am ashamed to admit, I...I slipped on some wet stone and my rod, my pole, it... I dropped it, lost it. Yes, yes, it is gone."},{"name":"GYORIN","text":"And before you ask, no, no I could not retrieve it. I am a Namazu of the city, not of the wild. To cast myself into a running river is tantamount to taking my own life!"},{"name":"GYORIN","text":"Will you help me in this, <span class=\"highlight\">Forename</span>? Will you find my rod and retrieve it, return it? It is very dear to me. Yes, yes, it is. Please, I beg this of you. I know not where else to turn."},{"name":"GYORIN","text":"Will you help me, <span class=\"highlight\">Forename</span>? Will you find my rod and retrieve it, return it? It is very dear to me. Yes, yes, it is. Please, I beg this of you. I know not where else to turn."},{"name":"GYORIN","text":"My precious pole, my irreplaceable rod. I am but half a man without it."},{"name":"GYORIN","text":"My rod! You found it! As I knew that you would. I owe you a debt of gratitude, of thanks. Yes, yes, I do."},{"name":"GYORIN","text":"Yet, I confess, I admit, I've been thinking on things since I lost it. Yes, yes, much thinking. It occurred to me, all the Namazu I know are fishmongers. They are, they are, each and every one."},{"name":"GYORIN","text":"That fact led me to recall another passage I read among my emakimono. It said for one to make their mercantile mark, one must offer something no other merchant does. A new product, a new service."},{"name":"GYORIN","text":"And so I have made up my mind. I have, I have. I will look for another way to make my fortune. I have given it much thought, but there is much more to give. I will return to my shack and dwell on this some more."},{"name":"GYORIN","text":"<span class=\"highlight\">Forename</span>! You may be happy to hear, joyous to hear. I have put faith in my emakimono. Their wisdom, their insight. They have led me to a new calling! Yes, yes."},{"name":"GYORIN","text":"I have learned there is a pretty price to be paid for certain ores, certain minerals. And so I shall become a miner, a prospector."},{"name":"GYORIN","text":"I fear I may inconvenience you again in this endeavor, as I did in the last, the previous. I only hope you are willing to lend your wisdom again. Yes, yes."}],"reward":{"gil":800,"items":[{"id":18413,"one":1,"hq":1},{"id":18414,"one":1,"hq":1},{"id":18415,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68270]},"next":[68285]},"partials":[{"type":"npc","id":"1023236","obj":{"i":1023236,"n":"Gyorin","l":2410,"q":1}},{"type":"npc","id":"1023237","obj":{"i":1023237,"n":"Gyorin","l":2410,"q":5}},{"type":"npc","id":"1023238","obj":{"i":1023238,"n":"Gyorin","l":2410,"q":1}},{"type":"item","id":"18413","obj":{"i":18413,"n":"Star Spinel Bracelet of Fending","l":273,"c":55774,"t":42,"p":16215}},{"type":"item","id":"18414","obj":{"i":18414,"n":"Star Spinel Bracelet of Slaying","l":273,"c":55774,"t":42,"p":16215}},{"type":"item","id":"18415","obj":{"i":18415,"n":"Star Spinel Bracelet of Aiming","l":273,"c":55774,"t":42,"p":16215}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68270","obj":{"i":68270,"n":"Perchance to Hanami","g":109,"l":"Yanxia","s":4160,"f":1}},{"type":"quest","id":"68285","obj":{"i":68285,"n":"No Wealth Like Mineral Wealth","g":109,"l":"Yanxia","s":4240,"f":1}}]}