{"quest":{"name":"Fresh Flesh","location":"Yanxia","id":68286,"patch":4.0,"sort":4250,"icon":100704,"unlocksFunction":1,"eventIcon":71341,"issuer":1023237,"target":1023237,"involved":[1023243],"genre":109,"journal":["At the Glittering Basin, Gyorin is visibly depressed.","Gyorin strikes upon the idea of trapping monsters in the wild to collect their wings, scales, and anything else he can turn for a profit. To aid him in this, he asks you to help prepare the bait for his traps. Travel to the Glittering Basin and defeat three water serpents.","You defeated three water serpents. Deliver the fresh water serpent flesh you stripped from their carcasses to Gyorin in the Glittering Basin.","You deliver the fresh water serpent flesh to Gyorin, who promptly departs to set his traps. Travel to the Glittering Basin and await Gyorin's return at the designated location.","You patiently await Gyorin at the designated location, but he has not returned. Return to the Glittering Basin and make sure he has not come to harm.","Gyorin somehow manages to fall victim to one of his own traps while traveling the Glittering Basin and setting them up. Given to despair once more, he dejectedly returns to his warehouse. Travel to the Glittering Basin and speak with him again.","Though despondent over his continued failures, Gyorin is grateful that your quick assistance prevented his death and dismemberment."],"objectives":["Slay water serpents in Yanxia.","Deliver the fresh water serpent flesh to Gyorin.","Await Gyorin at the designated location.","Search for Gyorin.","Speak with Gyorin."],"dialogue":[{"name":"GYORIN","text":"I failed at prospecting, at mining. I was so sure I would succeed. Never have I been so disappointed in myself."},{"name":"GYORIN","text":"But still, I will not give up now. If I do, I will never be rich, wealthy. Indeed, I have already thought of another way to make my fortune. Yes, yes."},{"name":"GYORIN","text":"I turned once more to my emakimono for wisdom. There I found a tale of a merchant who sold the wings and scales of monsters, of beasts."},{"name":"GYORIN","text":"That will be my next endeavor, and I know this time it will work. Just imagining myself trapping beasts and collecting their parts made my barbels tingle, twinge."},{"name":"GYORIN","text":"But I am just a Namazu. I have no hope of hunting these monsters and slaying them in battle. I will have to trap them, ensnare them. And I would like your help in procuring the bait I require for my traps!"},{"name":"GYORIN","text":"There are beasts known as water serpents that slither throughout the Glittering Basin. If you would be so good as to fell three of them, I would have enough meat to set all the traps I need. Yes, yes."},{"name":"GYORIN","text":"There are beasts known as water serpents that slither throughout the Glittering Basin. If you would be so good as to fell three of them, I would have enough meat to set all the traps I need. Yes, yes."},{"name":"GYORIN","text":"How goes the hunt? Were you able to obtain the fresh water serpent flesh as I asked?"},{"name":"GYORIN","text":"Yes, yes. This is precisely what I need! And for my part, I've already finished constructing my traps. All that is left is to venture into the wild and set them. I do not wish to bore you with such a chore. Await me here. I shall return shortly. Yes, yes."},{"name":"SYSTEM","text":"Gyorin is taking far too long to set his traps. Perhaps something has happened..."},{"name":"GYORIN","text":"Th-Thank you, my friend. You have saved me yet again."},{"name":"GYORIN","text":"I was out simply setting my traps, and then I...I suppose I got a bit too excited and stepped into one of them. How embarrassing, how shameful."},{"name":"GYORIN","text":"I am finding that an effective trap is truly a dangerous thing. Yes, yes. I do believe I must abandon this trapping endeavor."},{"name":"GYORIN","text":"I put faith in my emakimono and tried several ways to make my fortune, my fame. Yet none of them have gone well. None at all."},{"name":"GYORIN","text":"I must return home and speak with Gyofu. He is very smart, very clever. Perhaps he has some idea as to what path I might tread."},{"name":"GYORIN","text":"My failures are coming in quick succession, but I will not give up. And I hope you will not give up on me, <span class=\"highlight\">Forename</span>. For now, I shall return to my warehouse. Yes, yes."},{"name":"GYORIN","text":"My wounds have been seen to, tended to. I was told they are not grievous. I owe that blessing to you, <span class=\"highlight\">Forename</span>. Had you not found me as quickly as you did... I fear the worst may have happened."}],"reward":{"gil":900,"items":[{"id":18361,"one":1,"hq":1},{"id":18367,"one":1,"hq":1},{"id":18373,"one":1,"hq":1},{"id":18385,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68285]},"next":[68287]},"partials":[{"type":"npc","id":"1023237","obj":{"i":1023237,"n":"Gyorin","l":2410,"q":5}},{"type":"npc","id":"1023243","obj":{"i":1023243,"n":"Gyorin","l":2410,"q":1}},{"type":"item","id":"18361","obj":{"i":18361,"n":"Durium Hairpin of Fending","l":273,"c":40776,"t":34,"p":21403}},{"type":"item","id":"18367","obj":{"i":18367,"n":"Durium Hairpin of Maiming","l":273,"c":40777,"t":34,"p":21403}},{"type":"item","id":"18373","obj":{"i":18373,"n":"Tigerskin Tricorne of Striking","l":273,"c":41384,"t":34,"p":21403}},{"type":"item","id":"18385","obj":{"i":18385,"n":"Tigerskin Tricorne of Scouting","l":273,"c":41386,"t":34,"p":21403}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68285","obj":{"i":68285,"n":"No Wealth Like Mineral Wealth","g":109,"l":"Yanxia","s":4240,"f":1}},{"type":"quest","id":"68287","obj":{"i":68287,"n":"Show Me the New Money","g":109,"l":"Yanxia","s":4260,"f":1}}]}