{"quest":{"name":"Criminal Phrenology","location":"Yanxia","id":68281,"patch":4.0,"sort":4210,"eventIcon":71221,"issuer":1019301,"target":1019301,"involved":[1022463],"genre":109,"journal":["Gyoei of Yuzuka Manor is looking for an adventurer with the constitution to see his deed done."],"objectives":["Speak with the magatsu koja and defeat any enemies that appear.","Speak with the magatsu koja.","Obtain the muddy purse.","Deliver the muddy purse to Gyoei."],"dialogue":[{"name":"GYOEI","text":"You're the strongest-looking adventurer I've seen all day! Very sturdy, very solid. I've a deed I'd like to ask of you."},{"name":"GYOEI","text":"Allow me to explain. Some days past, I was walking near the large gate just behind our manor, here. Well, you can imagine my surprise when I came under attack by a massive koja, big and round as a goobbue's belly! I escaped without injury, but the cursed thing made off with my coinpurse."},{"name":"GYOEI","text":"Those contestable koja are always making life hard for us Namazu. Could you go and have words with them? I know of no other way to retrieve my coinpurse. And if they won't return it, you have my leave to be as rough as you like!"},{"name":"GYOEI","text":"Could you go and have words with those contestable koja? I know of no other way to retrieve my coinpurse. And if they won't return it, you have my leave to be as rough as you like!"},{"name":"BIGCOJA02745","text":"&lt;grunt&gt; &lt;grunt&gt; &lt;grunt&gt;"},{"name":"BIGCOJA02745","text":"&lt;grunt&gt; &lt;grunt&gt; &lt;grunt&gt;"},{"name":"SYSTEM","text":"The magatsu koja casts his gaze toward the One River. Perhaps what you seek lies in that direction."},{"name":"GYOEI","text":"Did you punish those koja for what they did? Chastise them, beat them?"},{"name":"GYOEI","text":"Well, thank you for that. And you got my coinpurse back! I had nearly given up hope."},{"name":"GYOEI","text":"I pray your words serve to calm them for a spell. We Namazu cannot suffer much more harassment at their...heads."},{"name":"GYOEI","text":"This gil did not come easy. It was born of my labor. Of my sweat and tears. I worked hard, picking flowers. Soaking them and flavoring them. I sell and serve them to the people here, and all who buy them sing their praises. I am grateful for what you did this day."}],"reward":{"gil":710,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68270]}},"partials":[{"type":"npc","id":"1019301","obj":{"i":1019301,"n":"Gyoei","l":2410,"q":1}},{"type":"npc","id":"1022463","obj":{"i":1022463,"n":"Magatsu Koja","l":2410,"q":1}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68270","obj":{"i":68270,"n":"Perchance to Hanami","g":109,"l":"Yanxia","s":4160,"f":1}}]}