{"quest":{"name":"Silent Banquet","location":"The Azim Steppe","id":68288,"patch":4.0,"sort":5010,"eventIcon":71221,"issuer":1023098,"target":1023098,"involved":[1019349,1019352,1019355],"genre":110,"journal":["This Oroniri youth is most grateful to the Qestir."],"objectives":["Speak with Baidur and obtain a can of horse milk.","Speak with Chambui and obtain a drumstick of beast meat.","Speak with Uto and obtain smoked fish.","Deliver the food to the Oroniri youth."],"dialogue":[{"name":"ORONIRMAN02752","text":"There is a matter I require your help with."},{"name":"ORONIRMAN02752","text":"I want to show my appreciation to the Qestir for creating Reunion. The marketplace allows us both to trade and communicate with the other tribes. We would have struggled to do either before Reunion was set up."},{"name":"ORONIRMAN02752","text":"After speaking with my fellow traders, we decided that we would host a banquet for the Qestir. However, three of them are still yet to deliver their food for the feast. "},{"name":"ORONIRMAN02752","text":"I am still waiting on Baidur, Chambui, and Uto. Please, seek them out and tell them you wish to discuss the banquet."},{"name":"ORONIRMAN02752","text":"I am still waiting on Baidur, Chambui, and Uto. Please, seek them out and tell them you wish to discuss the banquet."},{"name":"BAIDUR","text":"Oh, my apologies for being so late. We Kahkol are still few in number and it took somewhat longer than anticipated to gather what we required."},{"name":"BAIDUR","text":"However, I can assure you it will have been worth the wait! I made sure to collect only the finest ingredients to show our gratitude to the Qestir."},{"name":"CHAMBUI","text":"Ah, the banquet? Do not worry, my contribution is ready. I have been incredibly busy of late and it completely slipped my mind."},{"name":"CHAMBUI","text":"Our tribe's hunters are so skilled we often have more food than we know what to do with. Having somewhere like Reunion where we can trade our unnecessary meat is a great help to us."},{"name":"UTO","text":"My apologies for the delay. Though I think the Qestir will enjoy what I have brought: smoked fish straight from Isari."},{"name":"UTO","text":"I would normally not go to such lengths, but the Qestir have done so much for us."},{"name":"UTO","text":"The mere fact they allow non-Xaela into Reunion is truly commendable. No doubt their generosity is motivated by trade, but I would be lying if I said it was not the reason that I too come here."},{"name":"ORONIRMAN02752","text":"Were you able to find all three traders?"},{"name":"ORONIRMAN02752","text":"Quite a selection indeed."},{"name":"ORONIRMAN02752","text":"Have you ever heard why the Qestir founded Reunion? They say a Qestiri child died from an illness that would have been treatable with the right medicine. Alas, the Qestir had no means of procuring the cure at the time."},{"name":"ORONIRMAN02752","text":"As you say, there are plenty of other popular theories that may be true. The Qestir are hardly going to open their mouths and tell us which is correct after all."},{"name":"ORONIRMAN02752","text":"Not that it really matters a great deal. We owe them a huge debt regardless."}],"reward":{"gil":614,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68036]}},"partials":[{"type":"npc","id":"1023098","obj":{"i":1023098,"n":"Oroniri Youth","l":2411,"q":1}},{"type":"npc","id":"1019349","obj":{"i":1019349,"n":"Baidur","l":2411,"q":5}},{"type":"npc","id":"1019352","obj":{"i":1019352,"n":"Uto","l":2411,"q":3}},{"type":"npc","id":"1019355","obj":{"i":1019355,"n":"Chambui","l":2411,"q":5}},{"type":"quest","id":"68036","obj":{"i":68036,"n":"The Search for Lord Hien","g":6,"l":"The Azim Steppe","s":580}}]}