{"quest":{"name":"Show Me the New Money","location":"Yanxia","id":68287,"patch":4.0,"sort":4260,"icon":100704,"unlocksFunction":1,"eventIcon":71341,"issuer":1023237,"target":1023244,"involved":[1022715,1023245,1023246],"genre":109,"journal":["At the Glittering Basin, Gyorin is making it all too obvious he wants you to talk to him.","Gyorin decides to seek the counsel of Gyofu in his unrelenting pursuit of mercantile greatness. Travel to Yuzuka Manor and speak with Gyorin once more.","Gyofu tells Gyorin that there are treasures still buried within the ruins of a Garlean stronghold to the east. Gyorin ignores Gyofu's warnings and departs for the ruins immediately. Follow Gyorin, and speak to him at the Glittering Basin.","Gyorin continues in the direction of the Garlean stronghold ruins. Follow him once more, and speak to him in Castrum Fluminis.","Gyorin discovers a band of Lupin, and asks you to create a diversion. Defeat Lupin looters in Castrum Fluminis.","You defeated the Lupin looters. Speak with Gyorin in Castrum Fluminis.","Gyorin tells you that he was able to find something valuable while you were distracting the Lupin. Return to Yuzuka Manor and speak with Gyorin once more.","Gyofu appraises Gyorin's haul, and determines that all of the weapons can be sold after some minor repairs. Upon hearing the good news, Gyorin resolves to open his own shop, which he will name The New Rich, and continue on the path to greatness."],"objectives":["Speak with Gyorin.","Speak with Gyorin once more.","Speak with Gyorin once again.","Defeat Lupin looters.","Speak with Gyorin.","Speak with Gyorin once more."],"dialogue":[{"name":"GYORIN","text":"I've got a new idea, <span class=\"highlight\">Forename</span>. I'll leave the ideas to Gyofu─that is my idea! Yes, yes. Please, come with me. Let us hear what wisdom Gyofu has to offer."},{"name":"GYOFU","text":"What is it now? Gyorin looks more depressed than usual. More down, more despondent."},{"name":"GYORIN","text":"Gyofu, Gyofu! I have something to ask of you, and I want you to tell me all you know."},{"name":"GYOFU","text":"That much I can do. What is it, Gyorin? You're not looking your normal chipper self."},{"name":"GYORIN","text":"I've been reading my emakimono. They tell of so many ways to make one's fortune, and I've tried them all. Each one, every one. But I have yet to meet with any success."},{"name":"GYORIN","text":"And so I want to ask you, Gyofu. If you were in my barbels, what would you do? Do you know of any path I can walk to quick wealth? Any at all?"},{"name":"GYOFU","text":"A quick path to wealth? Hmmm... I suppose there is one thought that comes to mind. But it is dangerous. Very dangerous, indeed."},{"name":"GYOFU","text":"Do you know of the ruins that lie to the east of here? They were once a Garlean stronghold. Within them there still remain all manner of weapons, relics from the days of war. At least that is what the rumors say. Yes, yes."},{"name":"GYOFU","text":"There just might be some treasure there. Weapons so fine they would put even the smiths of Doma to shame. Maybe, maybe not. I cannot say for sure."},{"name":"GYOFU","text":"But what I can say for sure is this─those ruins and the way to them are fraught with peril. Lupin turned looters prowl the place. Monstrous hounds called taoquan lurk in the shadows. There is no wealth to be had in death, Gyorin. No, no. You should not go to this place."},{"name":"GYORIN","text":"Treasures! Relics! It is more than I hoped for. Thank you, Gyofu. I knew I was right to ask you."},{"name":"GYORIN","text":"It would not be a quick path to wealth if it were not dangerous along the way. That, too, was written in my emakimono. I will go to these ruins, and I will find my fortune!"},{"name":"GYORIN","text":"Still, I do not stand much of a chance against Lupin and taoquan and whatever other dangers may come. Hmmm... Of course! You'll come with me, won't you, <span class=\"highlight\">Forename</span>? I knew that you would. Yes, yes. Come, then. Let us away!"},{"name":"GYOFU","text":"Gyorin never was one to listen to words of warning. I hate to burden you, but do look after him."},{"name":"GYORIN","text":"I've no idea how I made it this far without being seen. Not spotted, not smelled. Maybe I have a talent for going undetected. I wonder if that is a skill I could use to get rich..."},{"name":"GYORIN","text":"I will think more on it later. For now, let us keep the pace. I will make it all the way to the Garlean ruins without a soul other than you and I knowing of it. Yes, yes."},{"name":"GYORIN","text":"I've made it without a single beast or fiend taking notice of me. All too easy. But now for the hard part─to find whatever treasures await! "},{"name":"GYORIN","text":"By the by, I did see a horde of some rather mean-looking Lupin just over there. Very nasty, very feral."},{"name":"GYORIN","text":"So, here is my plan. While I search these containers for anything worth selling, you create a diversion and lure the Lupin away from me. Yes, yes. You are an adventurer. Surely you live for quests such as this."},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"GYORIN","text":"The perfect diversion! Thank you, <span class=\"highlight\">Forename</span>. I could hear the din of battle while I searched. I wanted desperately to come and help you, but I managed to stay true to my task. And lo, I found some relics that look quite valuable to my eye."},{"name":"GYORIN","text":"I will head back to the manor and show them to Gyofu. He will know if there is anything here worth selling. And I have a feeling that this time there is! Must be, has to be!"},{"name":"GYOFU","text":"Gyorin is looking quite pleased with himself, isn't he? I wonder what has gotten into him."},{"name":"GYORIN","text":"Look, Gyofu. I've returned from the Garlean ruins, and here is my haul. What do you think? Do you see anything here that will fetch a fair price at market?"},{"name":"GYOFU","text":"You truly went to the ruins!? <span class=\"emphasis\">And</span> returned to speak of it? You're a braver Namazu than most, Gyorin. Courageous, bold. Come, then. Show me what you have."},{"name":"GYOFU","text":"Hmmm... This piece is very fine, indeed. And this one, as well. A truly fortuitous find."},{"name":"GYOFU","text":"Well done, Gyorin! Every weapon here looks to be valuable. They need a bit of touching up here and there, but yes, yes, they will fetch you a good deal of coin."},{"name":"GYOFU","text":"The Garleans have been flushed out from Doma, but the Domans still have need of arms to defend themselves. These weapons you've collected will certainly sell, and sell quickly. "},{"name":"GYOFU","text":"There are many Domans who still wish to fight the Garleans to the last. They will be more than willing to take these weapons off your hands, and part with a pretty gil to do so."},{"name":"GYORIN","text":"Do you think so? Truly? I finally found something worth selling? Worth peddling, worth vending?"},{"name":"GYOFU","text":"Have you ever known Gyofu to give a false appraisal? No, no. Your dream is at hand, Gyorin. Sell these weapons. Take the coin you make, and with it you can start down the path to becoming a legendary merchant!"},{"name":"GYORIN","text":"I will. I will. Starting this day! I am going to open my own shop. I will name it The New Rich! Customers will flock to my doors from all over Yanxia. Yes, yes. My business will thrive and my coffers will overflow. And my barbels will guide me to greatness!"},{"name":"GYORIN","text":"Thank you for all your help, <span class=\"highlight\">Forename</span>. You have been with me through it all. I will not forget you when I am at the top."}],"reward":{"gil":1000,"items":[{"id":18379,"one":1,"hq":1},{"id":18391,"one":1,"hq":1},{"id":18397,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68286]},"next":[68283]},"partials":[{"type":"npc","id":"1023237","obj":{"i":1023237,"n":"Gyorin","l":2410,"q":5}},{"type":"npc","id":"1023244","obj":{"i":1023244,"n":"Gyorin","l":2410,"q":1}},{"type":"npc","id":"1022715","obj":{"i":1022715,"n":"Gyofu","l":2410,"q":2}},{"type":"npc","id":"1023245","obj":{"i":1023245,"n":"Gyorin","l":2410,"q":1}},{"type":"npc","id":"1023246","obj":{"i":1023246,"n":"Gyorin","l":2410,"q":1}},{"type":"item","id":"18379","obj":{"i":18379,"n":"Tigerskin Tricorne of Aiming","l":273,"c":41385,"t":34,"p":21403}},{"type":"item","id":"18391","obj":{"i":18391,"n":"Kudzu Hat of Healing","l":273,"c":41383,"t":34,"p":21403}},{"type":"item","id":"18397","obj":{"i":18397,"n":"Kudzu Hat of Casting","l":273,"c":41382,"t":34,"p":21403}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68286","obj":{"i":68286,"n":"Fresh Flesh","g":109,"l":"Yanxia","s":4250,"f":1}},{"type":"quest","id":"68283","obj":{"i":68283,"n":"Amber Alert","g":109,"l":"Yanxia","s":4270,"f":1}}]}