{"quest":{"name":"Amber Alert","location":"Yanxia","id":68283,"patch":4.0,"sort":4270,"unlocksFunction":1,"eventIcon":71341,"issuer":1019298,"target":1019261,"genre":109,"journal":["Gyoshu of Yuzuka Manor has a message for one who walks in the world of man."],"objectives":["Speak with Yamakage.","Speak with Gyoshu.","Speak with Yamakage."],"dialogue":[{"name":"GYOSHU","text":"Are you an adventurer in need of a job? If so, I've a small one for you. Yes, yes."},{"name":"GYOSHU","text":"There is a man in Namai by the name of Yamakage. I wish for you to find him and pass along this message─I have your daughter."},{"name":"GYOSHU","text":"Find Yamakage in Namai and pass along this message─I have your daughter."},{"name":"YAMAKAGE","text":"What!? My daughter? Gyoshu said that? Are you sure!?"},{"name":"YAMAKAGE","text":"I always thought him to be a good Namazu. Kind and jovial. I... I named him among my friends. Never would I have thought him capable of kidnapping a child!"},{"name":"YAMAKAGE","text":"Tell me, what are his demands? Hm? All the gil that I have? If it is coin he seeks, there is not much I am able to muster."},{"name":"YAMAKAGE","text":"Please, take him a message from me in turn. If the Namazu see fit to ask these jobs of you, they must trust you some measure."},{"name":"YAMAKAGE","text":"Tell him that I need time. If he grants me just some suns more, I will gather what coin I can. Will you tell Gyoshu that? Please, the life of my daughter hangs in the balance."},{"name":"YAMAKAGE","text":"Go and tell Gyoshu that I need time. If he grants me just some suns more, I will gather what coin I can. Please, the life of my daughter hangs in the balance."},{"name":"GYOSHU","text":"Time to gather more coin? I do not even... Whatever are you talking about? My apologies. It seems that my explanation was lacking."},{"name":"GYOSHU","text":"You see, I was out fishing with some friends earlier, and a young girl in tears floated upon us in a small vessel. We asked her name, and she told us she was the daughter of Yamakage. Yes, yes. And so we brought her in and sent word to her father."},{"name":"GYOSHU","text":"She is off playing with our younglings as we speak, and very much enjoying herself. Quite happy, quite joyous."},{"name":"GYOSHU","text":"I am sorry for the trouble, but would you go speak with Yamakage once more? Tell him all I have told you, and that his daughter merely waits here for him until he arrives."},{"name":"GYOSHU","text":"I am sorry for the trouble, but would you go speak with Yamakage once more? Tell him all I have told you, and that his daughter merely waits here for him until he arrives."},{"name":"YAMAKAGE","text":"What did Gyoshu say? Will he give me the time I need? Will he spare my little girl?"},{"name":"YAMAKAGE","text":"Not kidnapped? She was adrift and he saved her? Why did he not say so in the first place!? I've been worried sick that I may never see my daughter again! That fool's messages are always wanting for words."},{"name":"YAMAKAGE","text":"From time to time, he comes to Namai to peddle his wares. He has always taken the time to play with our children. And for it, our children have always taken a liking to him."},{"name":"YAMAKAGE","text":"I am ashamed to have doubted him. And to have thought him capable of such a horror. I will go to claim my daughter, and to offer my apologies. Mayhap I will take him some fine tea to drown this misunderstanding."},{"name":"YAMAKAGE","text":"Forgive us both for getting you mixed up in this. But thank you nonetheless!"}],"reward":{"gil":642,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68287]}},"partials":[{"type":"npc","id":"1019298","obj":{"i":1019298,"n":"Gyoshu","l":2410,"q":1}},{"type":"npc","id":"1019261","obj":{"i":1019261,"n":"Yamakage","l":2410,"q":1}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68287","obj":{"i":68287,"n":"Show Me the New Money","g":109,"l":"Yanxia","s":4260,"f":1}}]}