{"quest":{"name":"No Wealth Like Mineral Wealth","location":"Yanxia","id":68285,"patch":4.0,"sort":4240,"icon":100704,"unlocksFunction":1,"eventIcon":71341,"issuer":1023237,"target":1023237,"involved":[1022715,1023239,1023240,1023860],"genre":109,"journal":["At the Glittering Basin, Gyorin eagerly awaits the next opportunity for you to aid him in his ascension to mercantile greatness.","Gyorin has set out to prospect choice mining spots. Travel to the Glittering Basin and speak with him.","Gyorin boasts to you of the Namazu heightened sense of detection gained by way of the glorious barbels about their head and face. He claims to be using this gift to find precious ores for mining. Travel to the Glittering Basin and speak with Gyorin once more.","Gyorin informs you he has found a choice mining location, but that he is unable to reach it due to a host of monsters in the way. Clear his path of two ruffled hornbills at the Glittering Basin.","You have slain all the ruffled hornbills that obstructed Gyorin. Speak with him once more at the Glittering Basin.","Gyorin asks that you head back to his manor while he mines the ores he has found. Travel to the destination and await his return.","Gyorin has returned home and shown his fresh haul to an expert in mineral appraisals named Gyofu. According to Gyofu's trained eye, none of the ores Gyorin brought back from the Glittering Basin are of any value. Gyorin leaves in low spirits. Travel to the Glittering Basin and speak with him.","Gyorin reaches the conclusion that perhaps his barbels are not made for detecting valuable minerals. He tells you he will once again seek another way to make his name as a merchant."],"objectives":["Speak with Gyorin.","Speak with Gyorin once again.","Defeat ruffled hornbills.","Speak with Gyorin.","Await Gyorin at the designated location.","Speak with Gyorin."],"dialogue":[{"name":"GYORIN","text":"I am ready to begin my life as a miner, a prospector. Yes, yes. I mean to search for my fortune, my fame. I am sure it lies to the west of our manor."},{"name":"GYORIN","text":"I will go ahead of you, <span class=\"highlight\">Forename</span>. But please, do come and find me. Yes, yes."},{"name":"GYORIN","text":"Where to look, where to look..."},{"name":"GYORIN","text":"<span class=\"highlight\">Forename</span>! You gave me a start, a fright. But I am glad to see you. It was so good of you to come, to visit."},{"name":"GYORIN","text":"I am prospecting for ores as we speak, using my fortune-seeking barbels. Yes, yes. The Namazu barbel is a sensitive thing. Mine will detect where the most precious of ores lie."},{"name":"GYORIN","text":"I do believe I found something! I feel a tingle, a twinge in my barbels."},{"name":"GYORIN","text":"They tell me there is great mineral wealth to the north. I must go, I must away!"},{"name":"GYORIN","text":"It is all well and good to have found a choice mining location, but I am afraid my hand is stayed. There are a host of nasty beasts lingering, prowling. I can't get to the ore for fear of my life! Please, <span class=\"highlight\">Forename</span>, you must help me."},{"name":"GYORIN","text":"It is all well and good to have found a choice mining location, but I am afraid my hand is stayed. There are a host of nasty beasts lingering, prowling. I can't get to the ore for fear of my life! Please, <span class=\"highlight\">Forename</span>, you must help me."},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"GYORIN","text":"I knew those monstrosities would pose no match for you. Yes, yes, no match at all. The way is now clear. Leave the rest to me!"},{"name":"GYORIN","text":"I will mine these lands and amass a haul of ore the likes of which Yanxia has never seen! But it will require some time, some patience. Yes, yes. You should return to my warehouse and await me, <span class=\"highlight\">Forename</span>. I wish not to bore you with my digging, my picking."},{"name":"GYORIN","text":"I will mine these lands and amass a haul of ore the likes of which Yanxia has never seen! But it will require some time, some patience. Yes, yes. You should return to my warehouse and await me, <span class=\"highlight\">Forename</span>. I wish not to bore you with my digging, my picking."},{"name":"GYORIN","text":"The deed is done, finished. Yes, yes. And what a haul we have! Come, <span class=\"highlight\">Forename</span>, and behold the fruits of my labor."},{"name":"GYORIN","text":"Look at how they sparkle, how they shine. I have no doubt these ores will see me to greatness, to fame."},{"name":"GYORIN","text":"I must show them to Gyofu. Yes, yes. He is very knowledgeable about the selling of ores. His appraisal will be most reassuring."},{"name":"GYORIN","text":"Gyofuuu! I have something for you to inspect, to see."},{"name":"GYOFU","text":"You certainly are in good spirits. What is it, Gyorin?"},{"name":"GYORIN","text":"I have been mining, and brought my first haul of findings for your appraisal, your valuation. Tell me, how much gil will these ores fetch at market?"},{"name":"GYOFU","text":"Is that where you've been off to all this time? Well then, let us have a look, shall we? Yes, yes."},{"name":"GYOFU","text":"You want the truth of me, yes Gyorin?"},{"name":"GYORIN","text":"And nothing besides. Yes, yes, tell me your honest opinion."},{"name":"GYOFU","text":"It is difficult to place a value on these ores you have. Quite difficult indeed. And that is because they are so very, very..."},{"name":"GYOFU","text":"Worthless! You dragged a veritable pile of garbage across Yanxia and into our manor!"},{"name":"GYORIN","text":"W-Worthless? But my barbels tingled, twinged... I would have staked my life that these ores were valuable."},{"name":"GYORIN","text":"But thank the gods I did not. I suppose I must find another way, another means, to make my fortune. Thank you, Gyofu. I do appreciate your honesty, your candor. Yes, yes."},{"name":"GYOFU","text":"Gyorin seemed to be quite down. I hate to be the one to tell him, but someone had to. Those rocks he had were worthless."},{"name":"GYORIN","text":"I used my barbels to detect the ores just like my master taught me. Yes, yes, I did. &lt;sigh&gt; I suppose the barbels of my line are not fit for mining."},{"name":"GYORIN","text":"Still, my dream is my dream. I will not give up yet. I will find another path to greatness. And when I do, you will be the first to know, to hear, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":800,"items":[{"id":18416,"one":1,"hq":1},{"id":18417,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68284]},"next":[68286]},"partials":[{"type":"npc","id":"1023237","obj":{"i":1023237,"n":"Gyorin","l":2410,"q":5}},{"type":"npc","id":"1022715","obj":{"i":1022715,"n":"Gyofu","l":2410,"q":2}},{"type":"npc","id":"1023239","obj":{"i":1023239,"n":"Gyorin","l":2410,"q":1}},{"type":"npc","id":"1023240","obj":{"i":1023240,"n":"Gyorin","l":2410,"q":1}},{"type":"npc","id":"1023860","obj":{"i":1023860,"n":"Gyorin","l":2410,"q":1}},{"type":"item","id":"18416","obj":{"i":18416,"n":"Star Spinel Bracelet of Healing","l":273,"c":55774,"t":42,"p":16215}},{"type":"item","id":"18417","obj":{"i":18417,"n":"Star Spinel Bracelet of Casting","l":273,"c":55774,"t":42,"p":16215}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68284","obj":{"i":68284,"n":"Gyorin the Namazu","g":109,"l":"Yanxia","s":4230,"f":1}},{"type":"quest","id":"68286","obj":{"i":68286,"n":"Fresh Flesh","g":109,"l":"Yanxia","s":4250,"f":1}}]}