{"quest":{"name":"Not Just Any Vase","location":"Yanxia","id":68280,"patch":4.0,"sort":4200,"eventIcon":71221,"issuer":1023359,"target":1023359,"involved":[1023360,1023361],"genre":109,"journal":["A hard-whiskered Namazu at Yuzuka Manor is looking for a strong-armed adventurer to help him."],"objectives":["Speak with the hard-whiskered Namazu near Castrum Fluminis.","Escort the hard-whiskered Namazu to the imperial materiel.","Speak with the hard-whiskered Namazu.","Obtain an imperial materiel crate.","Deliver the imperial materiel crate to the hard-whiskered Namazu."],"dialogue":[{"name":"DETERMINATIONNAMAZUO02744","text":"Where do your allegiances lie? Are you a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of the Empire? No? Then I've got a job to offer you."},{"name":"DETERMINATIONNAMAZUO02744","text":"Many days past, a group of Garleans stormed our manor. They wore armor of pitch black, and bore swords of sharp steel. Try as we did to stop them, they simply swept us out of their path. Beat us, hit us."},{"name":"DETERMINATIONNAMAZUO02744","text":"I pretended not to speak or understand their words, and in the end they spared me. But not before they took from our manor a vase that is very precious to us. They placed it in a crate and carried it off as if it were their own. I mean to have it back from them, and for that I need your help."},{"name":"DETERMINATIONNAMAZUO02744","text":"I have learned that they took our vase east of here, to their base in the lands of Castrum Fluminis. I will await you there, and when you come, I will tell you what I have planned."},{"name":"DETERMINATIONNAMAZUO02744","text":"I am glad you made it. I pray the journey was not difficult. For the difficult journey is still ahead of us. Most dangerous, most deadly."},{"name":"DETERMINATIONNAMAZUO02744","text":"The Garlean base is vast─far larger than our own manor. There are many crates of materiel, and they all look alike. But I have a method for finding the one we seek."},{"name":"DETERMINATIONNAMAZUO02744","text":"After they threw me to the floor that day, I lay quiet, but observant. Watching, looking. I saw the box they placed the vase in, and I marked it with a small symbol."},{"name":"DETERMINATIONNAMAZUO02744","text":"But the Garleans keep hounds, and they prowl all over the base grounds. I will give them my scent and keep them diverted. While I do, you must search for the imperial materiel crate."},{"name":"SYSTEM","text":"Escort the hard-whiskered Namazu safely to the imperial materiel. Should you fail to defend him, or move too far away, he will return to the shore south of Castrum Fluminis, where you may rendezvous with him before trying again."},{"name":"DETERMINATIONNAMAZUO02744","text":"Let us away, then!"},{"name":"DETERMINATIONNAMAZUO02744","text":"But the Garleans keep hounds, and they prowl all over the base grounds. I will give them my scent and keep them diverted. While I do, you must search for the imperial materiel crate."},{"name":"DETERMINATIONNAMAZUO02744","text":"Abort! Abort! Run away! Flee, escape!"},{"name":"SYSTEM","text":"You have failed to successfully escort the hard-whiskered Namazu to the imperial materiel. Return to the shore south of Castrum Fluminis and speak with the hard-whiskered Namazu to begin once more."},{"name":"SYSTEM","text":"Speak with the hard-whiskered Namazu at the shore south of Castrum Fluminis to begin once more."},{"name":"SYSTEM","text":"You have lost sight of the hard-whiskered Namazu. Retrace your steps to find them, then escort them safely to the imperial materiel."},{"name":"DETERMINATIONNAMAZUO02744","text":"(-Hard-whiskered Namazu-)Hmmm... No, no this isn't it. This isn't it at all."},{"name":"DETERMINATIONNAMAZUO02744","text":"(-Hard-whiskered Namazu-)This is the one! Yes, yes. It bears the seal of our magistrate's family. Can you see it? I drew it down at the bottom, there. Very small, very tiny."},{"name":"DETERMINATIONNAMAZUO02744","text":"This crate contains our precious vase. The Garleans spoke of it as if it were just another antique. But to us Namazu, this vase is a treasured memento of our dear magistrate."},{"name":"DETERMINATIONNAMAZUO02744","text":"And now that I get a good look at their crate, it looks like the perfect fit. Not too big, not too small."},{"name":"DETERMINATIONNAMAZUO02744","text":"It is our turn to take from them, as they took from us. It is far too heavy for me to carry, though. Would you see it back to Yuzuka Manor?"},{"name":"DETERMINATIONNAMAZUO02744","text":"Tell me, did you bring the imperial materiel crate back with you?"},{"name":"DETERMINATIONNAMAZUO02744","text":"You did, indeed! &lt;sigh&gt; What a relief. Our magistrate loved this vase very much."},{"name":"DETERMINATIONNAMAZUO02744","text":"Ever since he passed, we Namazu have watched over it with the same love that he did. I must see it back to safety inside the manor."},{"name":"DETERMINATIONNAMAZUO02744","text":"Have you ever seen a more perfect vessel? And I have to say, this crate of imperial making is quite nice, as well. Quite lovely, quite beautiful."},{"name":"DETERMINATIONNAMAZUO02744","text":"Well, our vase is back where it belongs. That is enough to set my mind at ease. Thank you for all you did, adventurer. I will not soon forget it."}],"reward":{"gil":847,"xp":99900},"reqs":{"jobs":[{"lvl":64,"id":34}],"questsType":"all","quests":[68035,68270]}},"partials":[{"type":"npc","id":"1023359","obj":{"i":1023359,"n":"Hard-whiskered Namazu","l":2410,"q":1}},{"type":"npc","id":"1023360","obj":{"i":1023360,"n":"Hard-whiskered Namazu","l":2410,"q":1}},{"type":"npc","id":"1023361","obj":{"i":1023361,"n":"Hard-whiskered Namazu","l":2410,"q":1}},{"type":"quest","id":"68035","obj":{"i":68035,"n":"All the Little Angels","g":6,"l":"Yanxia","s":560}},{"type":"quest","id":"68270","obj":{"i":68270,"n":"Perchance to Hanami","g":109,"l":"Yanxia","s":4160,"f":1}}]}