{"quest":{"name":"Words Are Meaningless","location":"The Azim Steppe","id":68298,"patch":4.0,"sort":5110,"icon":100705,"eventIcon":71221,"issuer":1022128,"target":1019346,"involved":[1022135,1022136],"genre":110,"journal":["Poor Gascot just wants some Qestiri friends.","In light of Gascot's dance failing to capture the locals' hearts and minds, he suggests you try a different approach: improving his reputation with the other tribes first. Gascot believes advertising his wares in Reunion to a range of tribes will increase the demand for his goods, putting pressure on the Qestir to allow him to trade. You agree to help promote his goods to the Au Ra that have only recently come to Reunion.","A Gesi by the name of Jebei shows he is quite interested in trading with Gascot. He explains that his tribe values hunting above all else and would have use for Gascot's foreign weapons. You are also told that the Qestir are in constant need of oil to keep the lamps of Reunion alight. In light of this, Jebei encourages you to retrieve a lump of fat from a steppe gedan and present it to Cotota as a gesture of goodwill.","Having slain the beast mentioned by Jebei and collected its fat, you make your way back to Reunion to present the spoils to Gascot.","Gascot is pleased to see your venture was a success. He states that Jebei gave him some choice advice while you were away and that he is quite keen to follow it. You are bid to go and hand over the beast fat to Cotota on Gascot's behalf.","Cotota seems puzzled to see you again. You hand her the fat and explain the reason for your visit. However, her reaction is far from positive, and you cannot help but wonder if Jebei's advice to Gascot is somehow to blame."],"objectives":["Speak with Au Ra that have recently arrived in Reunion.","Obtain fat from a steppe gedan.","Deliver the steppe gedan fat to Gascot.","Present the steppe gedan fat to Cotota."],"dialogue":[{"name":"GASCOT","text":"In consideration of the fact that showing my enthusiasm through dance had little effect, I suggest we consider a new approach."},{"name":"GASCOT","text":"Instead of approaching the Qestir directly, we focus on improving my reputation with the other tribes!"},{"name":"GASCOT","text":"As I have previously mentioned, I brought countless goods with me from faraway lands─the likes of which the Xaela have never seen! If I advertise these wares in Reunion there will be crowds begging to trade with me in no time."},{"name":"GASCOT","text":"Would you be up to the task of promoting my goods to those that have only just arrived in Reunion? I shall focus on the group that enjoyed my Bomb Dance performance─no doubt they are eager to see me again."},{"name":"GASCOT","text":"I am struggling to recall just who was present for my dance, but do not worry yourself, it will come to me soon. Please advertise my wares to those that have recently arrived in Reunion."},{"name":"JEBEI","text":"You say that there's a merchant about selling weapons from foreign lands? Interesting indeed. But why did you think to tell me of this fact?"},{"name":"JEBEI","text":"The poor man's been denied permission to trade in Reunion? Well, I can certainly see why they'd turn him away if that's what he's selling. Though that works well for me─that is to say, he has my deepest sympathies!"},{"name":"JEBEI","text":"We Gesi are skilled hunters; certainly the most capable of all the Xaela tribes. We fully understand the importance of weaponry."},{"name":"JEBEI","text":"I for one would certainly like to see your friend given permission to trade. In fact, I'll even give him some advice on how to plead his cause."},{"name":"JEBEI","text":"While I am talking with the merchant, I would advise you continue your efforts to win over the Qestir."},{"name":"JEBEI","text":"Something you may wish to keep in mind: the Qestir are always in need of oil to keep the lanterns lit in Reunion."},{"name":"JEBEI","text":"Slay a steppe gedan and bring back a lump of its fat. The Qestir are sure to appreciate the gesture."},{"name":"JEBEI","text":"In the meantime, I will tell your friend all about trading in Reunion. I shall see to it he knows absolutely <span class=\"emphasis\">everything</span>. Oh yes..."},{"name":"GASCOT","text":"Ah, <span class=\"highlight\">Forename</span>, this gentleman says he is your acquaintance. He certainly seems keen to help."},{"name":"JEBEI","text":"Slay a steppe gedan and bring back a lump of its fat. I shall give your friend some advice in the meantime."},{"name":"JEBEI","text":"I knew that beast would be no match for you. I also knew Gascot would be no match for my cunning scheme. What's that? Did I say something? No, of course not. Heh heh..."},{"name":"GASCOT","text":"Hello again, <span class=\"highlight\">Forename</span>. Jebei has told me everything. I hear you are going to procure some beast fat?"},{"name":"GASCOT","text":"Excellent. Let us present this to the Qestir, as Jebei suggested, and earn their trust."},{"name":"JEBEI","text":"A wise decision. You would do well to follow my advice if you wish to trade here."},{"name":"GASCOT","text":"What did we talk about, you ask? Nothing especially interesting. He merely gave me some guidance as to how I could secure permission to trade here."},{"name":"GASCOT","text":"Speaking of which, thank you for gathering the steppe gedan fat. Could you give it to Cotota for me? There's something else that requires my attention."},{"name":"GASCOT","text":"Pray give the fat to Cotota. There is something else that requires my attention."},{"name":"COTOTA","text":"...?"},{"name":"SYSTEM","text":"Cotota is unsure as to why you have visited. Show her you mean well by handing over the steppe gedan fat."},{"name":"COTOTA","text":"...!?"},{"name":"SYSTEM","text":"Cotota is flabbergasted. You wonder if her reaction has something to do with the advice Jebei gave to Gascot."}],"reward":{"gil":900,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"questsType":"all","quests":[68037,68297]},"next":[68299]},"partials":[{"type":"npc","id":"1022128","obj":{"i":1022128,"n":"Gascot","l":2411,"q":4}},{"type":"npc","id":"1019346","obj":{"i":1019346,"n":"Cotota","l":2411,"q":4}},{"type":"npc","id":"1022135","obj":{"i":1022135,"n":"Jebei","l":2411,"q":1}},{"type":"npc","id":"1022136","obj":{"i":1022136,"n":"Jebei","l":2411,"q":1}},{"type":"quest","id":"68037","obj":{"i":68037,"n":"A Season for War","g":6,"l":"The Azim Steppe","s":590}},{"type":"quest","id":"68297","obj":{"i":68297,"n":"Words Are Trivial","g":110,"l":"The Azim Steppe","s":5100}},{"type":"quest","id":"68299","obj":{"i":68299,"n":"Enjoy the Silence","g":110,"l":"The Azim Steppe","s":5120}}]}