{"quest":{"name":"Purbol Rain","location":"The Azim Steppe","id":68294,"patch":4.0,"sort":5070,"eventIcon":71221,"issuer":1023253,"target":1023253,"genre":110,"journal":["This Adarkim warrior has his eyes on a particular kind of flower."],"objectives":["Slay three purbols and obtain pungent flowers.","Deliver the pungent flowers to the Adarkim warrior."],"dialogue":[{"name":"SHOPPER02758","text":"Could I ask for your help? I have no one else to turn to."},{"name":"SHOPPER02758","text":"I have searched all over the Azim Steppe for one single flower. Someone told me that it was sold in Reunion, but I have had no luck here either."},{"name":"SHOPPER02758","text":"Could you search for this flower for me? It shall not be a dangerous task by any means."},{"name":"SHOPPER02758","text":"No. I should not lie, least of all to a visitor to our land. It will be a job fraught with peril."},{"name":"SHOPPER02758","text":"For the only way to obtain the flower I require is by slaying a purbol. If you are willing to help, you should be able to find some north of here. Please, slay three of them and bring back their flowers."},{"name":"SHOPPER02758","text":"Please, slay three purbols and bring back their flowers."},{"name":"SHOPPER02758","text":"Were you able to get three of the flowers?"},{"name":"SHOPPER02758","text":"Oh my, that stench. Quite ghastly indeed. I suppose I should tell you just why I needed these flowers."},{"name":"SHOPPER02758","text":"I belong to the Adarkim, the largest of the Xaela tribes. Recent events have led to me being considered as a future khan."},{"name":"SHOPPER02758","text":"The position brings with it much power and pleasures, but by the same token, it has given rise to bitter and bloody rivalries. My older brother was a candidate before me, but after no less than eight attempts on his life, he vanished with nary a trace."},{"name":"SHOPPER02758","text":"In his absence, I have risen in the line of succession, meaning <span class=\"emphasis\">I</span> am now the marked man. &lt;sigh&gt; I did not ask for this..."},{"name":"SHOPPER02758","text":"Alas, wishing that it were not so will not stay the daggers in the dark. That is why I sought out these foul-smelling flowers─to ward off would-be assassins. And thanks to your help, I may enjoy a moment's respite."},{"name":"SHOPPER02758","text":"In the meantime, I will set about finding a permanent solution to my problem. That is, finding my brother, Adkiragh. Unless I do so, there will be no peace for me...save in death."}],"reward":{"gil":614,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68037]}},"partials":[{"type":"npc","id":"1023253","obj":{"i":1023253,"n":"Adarkim Warrior","l":2411,"q":1}},{"type":"quest","id":"68037","obj":{"i":68037,"n":"A Season for War","g":6,"l":"The Azim Steppe","s":590}}]}