{"quest":{"name":"Words Are Trivial","location":"The Azim Steppe","id":68297,"patch":4.0,"sort":5100,"icon":100705,"eventIcon":71221,"issuer":1022128,"target":1022128,"involved":[1019346,1019349,1019351,1019352,1022132,1022133,1022134],"genre":110,"journal":["Gascot is raring to get started with his studies.","Gascot enlists your aid to find out more about how Qestir communicate with each other. Rather surprisingly, he is actually aware of his less-than-favorable reputation amongst the locals and feels your help is vital. You agree to lend him a hand and question the Au Ra in Reunion on his behalf.","Some of the locals are not especially keen to help when it becomes apparent you are assisting Gascot. However, you are still able to learn a few facts concerning Qestiri customs. Namely, that Reunion is a place where all Xaela put their tribal rivalries to one side to interact peacefully, and that the Qestir really do not ever speak.","Gascot listens to you intently as you share what you have learned. Taking to heart the idea that actions speak louder than words, Gascot resolves to greet everyone in the village, and asks that you meet with Cotota to earn her trust.","As instructed by Gascot, you approach Cotota in the hopes of gaining her trust. She initially seems confused by your approach, and just as you feel you are on the verge of a breakthrough, you are interrupted by none other than the blundering merchant himself. Gascot unleashes his interpretation of the Bomb Dance on his unsuspecting victims inside the khan's tent. Their response to this disturbance of the peace is unsurprisingly rather negative. Gascot bids you leave the area and regroup to consider just what went wrong.","While Gascot is aware his dance did not go down well, he is perplexed as to why. Supposedly he received a very favorable reception when he performed it in front of several Qestiri onlookers earlier. Regardless, he notes that the experience has at least taught him something about the local culture and he shall continue his endeavor to find a way of effectively expressing himself."],"objectives":["Gather information in Reunion.","Report to Gascot.","Reassure Cotota with a wordless “You can trust /me.”","Speak with Gascot."],"dialogue":[{"name":"GASCOT","text":"Let us start by finding out just how Qestir communicate with one another. If we cannot learn this much, then there's not much point in being here."},{"name":"GASCOT","text":"It is to this end that I would have you ask the locals about their customs."},{"name":"GASCOT","text":"Of course, I too shall try asking, although I fear I may have already gained an unfavorable reputation with the locals. Can't even begin to think why."},{"name":"GASCOT","text":"This is not going especially well... Have you had any better luck?"},{"name":"UTO","text":"Are you helping Gascot? Quite a handful, isn't he? He's not doing his fellow outsiders any favors, of that you can be certain."},{"name":"UTO","text":"You would do well to tell him it is about time he started following Qestiri rules for a change."},{"name":"BAIDUR","text":"You would have me explain Qestiri customs to you? I would assume most people would pick those up after spending a few days here. Mind you, our merchant friend makes me wonder."},{"name":"BAIDUR","text":"The Qestir refuse to speak. They think all words to be lies. If you wish to earn their trust then simply follow this principle. It should be clear what you need to do."},{"name":"SUVD","text":"If you wish to understand the Qestir you should start by considering why this area was named “Reunion.”"},{"name":"SUVD","text":"The Xaela tribes constantly fight with one another. However, whilst they are in Reunion, all conflict is prohibited. The area was founded based on the ideal of the Xaela coming together as one."},{"name":"UTO","text":"If you wish to trade here then you will need the Qestir's permission to do so. Let that merchant know that angering them with words will get him nowhere."},{"name":"BAIDUR","text":"The Qestir refuse to speak. They think all words to be lies. If you wish to earn their trust then simply follow this principle. It should be clear what you need to do."},{"name":"SUVD","text":"All conflict is prohibited between Xaela in Reunion. It serves as a beacon of hope for those that wish for their tribes to reunite as one."},{"name":"GASCOT","text":"It's not just the Qestir, all the bloody Xaela in this place hardly speak. Though they're quite good at staring, I must say. Did you fare any better?"},{"name":"GASCOT","text":"We're supposed to show our intentions through actions, you say? Yes, over-reliance on speech is something we should all endeavor to avoid."},{"name":"GASCOT","text":"Then there is truly only one thing for it. We gain their trust by showing them we come in peace!"},{"name":"GASCOT","text":"Yes, I shall greet all those in Reunion and show that I only want to be their friend!"},{"name":"GASCOT","text":"Here's an idea: why don't you go and greet Cotota first? She's the one we really have to convince after all!"},{"name":"GASCOT","text":"<span class=\"highlight\">Forename</span>, I think I may be a natural at this! Don't forget to go and greet Cotota."},{"name":"XAELA02761","text":"..."},{"name":"SYSTEM","text":"The Qestir screws up his face and eyes Gascot with suspicion."},{"name":"COTOTA","text":"...?"},{"name":"SYSTEM","text":"Cotota looks at you quizzically. Show to her that you wish to be friends."},{"name":"SYSTEM","text":"Cotota seems unsure how to react to your gesture. You wonder how to proceed."},{"name":"Q1","text":"How will you proceed?"},{"name":"A1","text":"Kill her with kindness."},{"name":"A1","text":"Take a gentler approach."},{"name":"A1","text":"She may not like this..."},{"name":"COTOTA","text":"...!?"},{"name":"SYSTEM","text":"It seems you have given Cotota quite a shock. You wonder how best to make amends."},{"name":"COTOTA","text":"...?"},{"name":"SYSTEM","text":"Cotota is unsure how to perceive your actions. You wonder how best to communicate your intentions."},{"name":"COTOTA","text":"...!!?"},{"name":"SYSTEM","text":"It seems you have scared Cotota. You wonder how best to make amends."},{"name":"Q2","text":"How will you proceed?"},{"name":"A2","text":"Act as a <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> should."},{"name":"A2","text":"Take a friendlier approach."},{"name":"A2","text":"Show you have nothing left to lose."},{"name":"COTOTA","text":"..."},{"name":"SYSTEM","text":"The faint twinkle in Cotota's eyes suggests you have earned her trust."},{"name":"COTOTA","text":"..."},{"name":"SYSTEM","text":"Cotota chuckles to herself. It seems all is forgiven and that you have earned her trust."},{"name":"COTOTA","text":"...!?!?!?"},{"name":"SYSTEM","text":"Cotota is unable to think of a suitable response to your lunacy. It seems you are yet to fully earn her trust."},{"name":"GASCOT","text":"Oh, fancy seeing you here, Cotota! Allow me to show you just how friendly I am. Behold, the Bomb Dance of Kugane!"},{"name":"GASCOT","text":"Come on now, do not be shy! Let us all get to know each o─why do you stare at me so?"},{"name":"GASCOT","text":"Well, it seems I have overstayed my welcome. Come along, <span class=\"highlight\">Forename</span>, let us not bother the lovely Qestir any further."},{"name":"GASCOT","text":"Pray meet with me outside."},{"name":"COTOTA","text":"..."},{"name":"SYSTEM","text":"No one seems to find Gascot's version of the Bomb Dance especially charming."},{"name":"GASCOT","text":"I am ever the optimist, but even I would struggle to say that went according to plan..."},{"name":"GASCOT","text":"I just don't understand. When I danced in front of a Qestir earlier, several gathered to watch. You should have seen them, <span class=\"highlight\">Forename</span>! They were beckoning for others to come look, pointing fingers, laughing─they loved my performance!"},{"name":"GASCOT","text":"After such a positive reception I was certain Cotota would respond in a similar manner, perhaps even dance with me. But no, all I saw was rage in her eyes."},{"name":"GASCOT","text":"However, I have indeed gained a better understanding of their ways. Now I just need to consider how to approach them next time..."}],"reward":{"gil":800,"items":[{"id":18418,"one":1,"hq":1},{"id":18419,"one":1,"hq":1},{"id":18420,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"questsType":"all","quests":[68037,68296]},"next":[68298]},"partials":[{"type":"npc","id":"1022128","obj":{"i":1022128,"n":"Gascot","l":2411,"q":4}},{"type":"npc","id":"1019346","obj":{"i":1019346,"n":"Cotota","l":2411,"q":4}},{"type":"npc","id":"1019349","obj":{"i":1019349,"n":"Baidur","l":2411,"q":5}},{"type":"npc","id":"1019351","obj":{"i":1019351,"n":"Suvd","l":2411,"q":1}},{"type":"npc","id":"1019352","obj":{"i":1019352,"n":"Uto","l":2411,"q":3}},{"type":"npc","id":"1022132","obj":{"i":1022132,"n":"Gascot","l":2411,"q":1}},{"type":"npc","id":"1022133","obj":{"i":1022133,"n":"Gascot","l":2411,"q":1}},{"type":"npc","id":"1022134","obj":{"i":1022134,"n":"Cross Qestir","l":2411,"q":1}},{"type":"item","id":"18418","obj":{"i":18418,"n":"Star Spinel Ring of Fending","l":273,"c":54624,"t":43,"p":16215}},{"type":"item","id":"18419","obj":{"i":18419,"n":"Star Spinel Ring of Slaying","l":273,"c":54624,"t":43,"p":16215}},{"type":"item","id":"18420","obj":{"i":18420,"n":"Star Spinel Ring of Aiming","l":273,"c":54624,"t":43,"p":16215}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68037","obj":{"i":68037,"n":"A Season for War","g":6,"l":"The Azim Steppe","s":590}},{"type":"quest","id":"68296","obj":{"i":68296,"n":"Words Are Very Unnecessary","g":110,"l":"The Azim Steppe","s":5090,"f":1}},{"type":"quest","id":"68298","obj":{"i":68298,"n":"Words Are Meaningless","g":110,"l":"The Azim Steppe","s":5110}}]}