{"quest":{"name":"You Buuz, You Lose","location":"The Azim Steppe","id":68292,"patch":4.0,"sort":5050,"eventIcon":71221,"issuer":1019355,"target":1019355,"involved":[1021338],"genre":110,"journal":["Chambui is in need of meat."],"objectives":["Slay steppe dzos and obtain their meat.","Speak with Chambui.","Deliver the chunks of steppe dzo meat to Chambui's husband.","Report to Chambui."],"dialogue":[{"name":"CHAMBUI","text":"Fancy doing some hunting for me?"},{"name":"CHAMBUI","text":"I have been so busy trading today that I have had no time to go hunting. Which is an issue as I am nearly out of buuz ingredients."},{"name":"CHAMBUI","text":"I would like you to slay four steppe dzos for me and bring back their meat. You should be able to find some just outside of Reunion."},{"name":"DAZCALHUSBAND02756","text":"We are far too busy today. I am struggling to keep up."},{"name":"CHAMBUI","text":"Do you have my meat?"},{"name":"CHAMBUI","text":"We Dazkar are somewhat different to the other tribes in that all our hunting is done by our women. My little girls are already proving to be quite skilled with a bow and arrow."},{"name":"CHAMBUI","text":"I am sorry to take even more of your time, but could you deliver the dzo meat to my husband? You will find him just behind that nearby tent."},{"name":"DAZCALHUSBAND02756","text":"Why, hello! Can I help you with something?"},{"name":"DAZCALHUSBAND02756","text":"Ah, you have been hunting for my wife have you? You have my thanks."},{"name":"DAZCALHUSBAND02756","text":"I must say it is quite nice to have the chance to speak with someone that does not belong to my tribe!"},{"name":"DAZCALHUSBAND02756","text":"I would love to talk more, but it is really time I got back to cooking. Speak with my wife and I am sure she will see you are rewarded for your hard work. "},{"name":"DAZCALHUSBAND02756","text":"I would love to talk more, but I really need to focus on cooking. Speak with my wife and I am sure she will see you are rewarded for your hard work. "},{"name":"CHAMBUI","text":"You may not be aware of this, but those from outside our tribe seldom have the chance to speak with Dazkar men."},{"name":"CHAMBUI","text":"Usually we keep our men at home, but my husband's buuz are so much better than anything I could make. I felt I would be depriving my customers if I did not give them the opportunity to sample his cooking."},{"name":"CHAMBUI","text":"Regardless, it is time I got back to work. Thank you for all you have done."}],"reward":{"gil":752,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68036]}},"partials":[{"type":"npc","id":"1019355","obj":{"i":1019355,"n":"Chambui","l":2411,"q":5}},{"type":"npc","id":"1021338","obj":{"i":1021338,"n":"Chambui's Husband","l":2411,"q":1}},{"type":"quest","id":"68036","obj":{"i":68036,"n":"The Search for Lord Hien","g":6,"l":"The Azim Steppe","s":580}}]}