{"quest":{"name":"Merchant for a Day","location":"The Azim Steppe","id":68291,"patch":4.0,"sort":5040,"eventIcon":71221,"issuer":1019349,"target":1019349,"genre":110,"journal":["Baidur is not very good at his job."],"objectives":["Speak with Baidur."],"dialogue":[{"name":"BAIDUR","text":"Oh, I am beginning to wonder if I will ever be able to sell my wares. I was so certain I could finally make a success of myself here as a trader..."},{"name":"BAIDUR","text":"Ah, hello there. Tell me, have you ever tried your hand at running your own market stall?"},{"name":"BAIDUR","text":"I myself have been struggling to sell much of anything of late. Observing someone else may be just what I need."},{"name":"BAIDUR","text":"Let me know if you feel up to the challenge."},{"name":"BAIDUR","text":"Are you willing to tend to my stall?"},{"name":"SYSTEM","text":"Tending to the merchant's stall will take several minutes. You may wish to cancel any pending Duty Finder registrations."},{"name":"Q1","text":"What will you say?"},{"name":"BAIDUR","text":"That is a shame indeed. Please do speak with me again if you change your mind."},{"name":"BAIDUR","text":"Fantastic! I have a feeling I am going to learn a lot from observing you."},{"name":"BAIDUR","text":"I have always prided myself on having a varied assortment of goods for sale. There should be something here for every kind of customer. The best of luck to you!"},{"name":"SYSTEM","text":"Listen carefully to each customer and choose something you think will meet their needs."},{"name":"HOUSEWIFE02755","text":"Oh my, quite a selection of food you have. Let me think, yesterday we had fish... Trader, what would you recommend for a bunch of growing boys with healthy appetites?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Grilled fish."},{"name":"A2","text":"Cheese."},{"name":"A2","text":"Mammoth thigh."},{"name":"A2","text":"A tea brick."},{"name":"HOUSEWIFE02755","text":"Hmm, I am not so sure my boys would like that. I think I shall go and buy meat from another stall."},{"name":"HOUSEWIFE02755","text":"That does sound nice, doesn't it. I will take your finest mammoth thigh!"},{"name":"SYSTEM","text":"You have failed to make a sale. It appears the customer did not appreciate your recommendation."},{"name":"SYSTEM","text":"You made a sale! Nicely done."},{"name":"HAPPYBOY02755","text":"Give me a toy! Mummy said I could buy a toy because I've been good. I don't have much money so it should be something cheap. What can I buy?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"A wooden horse."},{"name":"A3","text":"A Kharaqiq board and pieces."},{"name":"A3","text":"A cheap wooden flute."},{"name":"A3","text":"A fancy multicolored doll."},{"name":"HAPPYBOY02755","text":"That sounds like lots of fun! Give it to me!"},{"name":"HAPPYBOY02755","text":"It costs <span class=\"emphasis\">how</span> much!? Mummy didn't give me <span class=\"emphasis\">that</span> much money."},{"name":"HAPPYBOY02755","text":"A flute? I've never played one before but maybe Daddy can teach me. I'll take it!"},{"name":"WORRIEDMAN02755","text":"Oh, I pine for that buxom maiden so, but I know not how to express my feelings. Whatever should I do?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I've got just the book for you."},{"name":"A4","text":"Scream of your love to all of Reunion."},{"name":"A4","text":"Good things come to handsome gents."},{"name":"A4","text":"You'll get nowhere with a face like that."},{"name":"WORRIEDMAN02755","text":"Sorry, did I look like I was soliciting advice? I was just heading home. I'll have you know I've a long night of crying myself to sleep ahead of me!"},{"name":"SYSTEM","text":"You have failed to make a sale. It appears the customer did not appreciate your recommendation."},{"name":"WORRIEDMAN02755","text":"A book, you say? Pray tell me, just what is it called?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"<span class=\"emphasis\">A Beginner's Guide to Tumet Child Rearing</span>."},{"name":"A5","text":"<span class=\"emphasis\">Swim Like an Ejinn</span>."},{"name":"A5","text":"<span class=\"emphasis\">Adarkim Tactics: Advanced Edition</span>."},{"name":"A5","text":"<span class=\"emphasis\">Qalli Love Songs of Legend</span>."},{"name":"WORRIEDMAN02755","text":"Are you mocking my love? There are other things I could be doing right now instead of taking your insults. I'll have you know I've a long night of crying myself to sleep ahead of me!"},{"name":"WORRIEDMAN02755","text":"Love songs? Now that you mention it, I remember her saying she enjoyed music. I will take that book, thank you!"},{"name":"FASHIONABLEGIRL02755","text":"Do you think this necklace suits me? I just bought it from that stall over there."},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"Is that one of the eyes of Nidhogg!?"},{"name":"A6","text":"It looks lovely on you."},{"name":"A6","text":"What a nice shade of scarlet."},{"name":"A6","text":"We have even better jewelry here!"},{"name":"FASHIONABLEGIRL02755","text":"Tell me then, just what would you suggest I buy?"},{"name":"FASHIONABLEGIRL02755","text":"I am glad you think so! I fell in love with the color the moment I saw it and knew it had to be mine."},{"name":"FASHIONABLEGIRL02755","text":"In fact, I had actually planned on buying two pieces of jewelry today. Do you have anything for sale?"},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"Scarlet earrings."},{"name":"A7","text":"A black bracelet."},{"name":"A7","text":"A ruby ring."},{"name":"A7","text":"A sapphire ring."},{"name":"FASHIONABLEGIRL02755","text":"Ah, those would go perfectly with my necklace! I will have them, thank you."},{"name":"FASHIONABLEGIRL02755","text":"That said, I am quite taken with this ruby ring as well... Give me both the earrings and this ring!"},{"name":"FASHIONABLEGIRL02755","text":"Hmm, I am not so sure the color would suit me. It is awfully drab. No, I think that is enough shopping for today."},{"name":"FASHIONABLEGIRL02755","text":"That looks very nice indeed. I shall take it!"},{"name":"FASHIONABLEGIRL02755","text":"That said, those scarlet earrings would go perfectly with my necklace... Give me both the ring and the earrings!"},{"name":"BAIDUR","text":"I must say I am very impressed. I had no idea there was still so much I had to learn about trading."},{"name":"BAIDUR","text":"Up until now I had simply recommended whatever I thought was best. But it is clear that the customer's wishes should always be my top priority."},{"name":"BAIDUR","text":"Thank you for all your help."},{"name":"BAIDUR","text":"Perhaps you ought to rest for a while. It seems like this may all be a bit too much for you right now. Speak with me whenever you feel ready to try again."}],"reward":{"gil":510,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68036]}},"partials":[{"type":"npc","id":"1019349","obj":{"i":1019349,"n":"Baidur","l":2411,"q":5}},{"type":"quest","id":"68036","obj":{"i":68036,"n":"The Search for Lord Hien","g":6,"l":"The Azim Steppe","s":580}}]}