{"quest":{"name":"Enjoy the Silence","location":"The Azim Steppe","id":68299,"patch":4.0,"sort":5120,"icon":100705,"eventIcon":71221,"issuer":1019346,"target":1022141,"involved":[1019344,1019347,1022128,1022137,1022138],"genre":110,"journal":["Cotota is deep in thought.","Cotota returns the animal fat to you and bids you go and speak with the khan, Iturgen. You elect to present the fat to him and explain your current situation.","After you have finished explaining everything to Iturgen, he bids you head to the northeast. You are unsure as to why he would have you travel in said direction, but it seems he is quite keen that you do. Upon finding what seems to be the area he wished for you to visit, you decide to wait and see if anyone, or anything, else appears.","After waiting a short time you see Gascot meeting a group of Gesi that includes Jebei. They demand that Gascot furnish them with bombs which they plan to use to destroy Reunion. When Gascot declares he has no intention of supplying them with any weapons, the atmosphere turns sour and the Gesi move to attack the merchant.","You intervene in the nick of time, just barely saving Gascot from the Gesi assault. After you have dealt with the attackers, you go to see if your merchant friend is unharmed.","Tamachag joins you to put an end to Jebei's scheme once and for all. Cotota then hands you a vellum and infers she would like you to present it to Gascot. You leave in search of him as you realize he left the area while you were otherwise occupied.","When you eventually locate Gascot, he remarks that he has just finished saying his good-byes to the Au Ra that were so transfixed by his Bomb Dance. You hand him the vellum given to you by Cotota which Gascot immediately recognizes as a sign that he has been granted permission to trade in Reunion. Filled with enthusiasm anew, Gascot declares he will return to his office in Kugane and bring back with him wares that will enrich the marketplace. He bids you farewell and says he looks forward to the day when the two of you are reunited once more in Reunion."],"objectives":["Hand the steppe gedan fat to Iturgen.","Stand watch at the designated location.","Slay the group of Gesi hunters.","Speak with Gascot.","Deliver the slip of Qestiri vellum to Gascot."],"dialogue":[{"name":"GASCOT","text":"Ah, pay no heed to me. I was just thinking about something Jebei said."},{"name":"COTOTA","text":"..."},{"name":"SYSTEM","text":"Cotota gives the sticky animal fat back to you. It seems she wants you to talk with Reunion's khan about what Jebei said to Gascot."},{"name":"COTOTA","text":"..."},{"name":"SYSTEM","text":"It seems Cotota wants you to speak with the khan."},{"name":"ITURGEN","text":"..."},{"name":"SYSTEM","text":"The khan is waiting to see how you will act."},{"name":"ITURGEN","text":"..."},{"name":"SYSTEM","text":"The khan gazes upon you, as if he is staring into your very soul. It seems he wishes you to grant him your succor. How will you respond?"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Nod."},{"name":"A1","text":"Give him a quizzical look."},{"name":"A1","text":"Show him yourself."},{"name":"ITURGEN","text":"..."},{"name":"SYSTEM","text":"The khan nods at you approvingly. It seems you have earned his trust."},{"name":"ITURGEN","text":"..."},{"name":"SYSTEM","text":"The khan smiles and bows to you. It seems he is requesting your aid with something."},{"name":"ITURGEN","text":"..."},{"name":"SYSTEM","text":"The khan stares at you unblinking. It seems you have earned his trust."},{"name":"SYSTEM","text":"The khan points to the northeast. It appears there is something in that direction he would like you to investigate."},{"name":"COTOTA","text":"..."},{"name":"SYSTEM","text":"It seems she wants you to help the khan."},{"name":"ITURGEN","text":"..."},{"name":"SYSTEM","text":"The khan wants you to head to the northeast on his behalf."},{"name":"SYSTEM","text":"This would appear to be the area the khan bid you visit. You decide to wait for a while and see if anything happens."},{"name":"JEBEI","text":"(-???-)You came after all. Do you have the weapons?"},{"name":"GASCOT","text":"Yes. You are certain this will allow me to trade in Reunion?"},{"name":"JEBEI","text":"Certainly. The Qestir are indebted to us. They'll listen to anything we ask of them; you'll have permission to trade in no time."},{"name":"JEBEI","text":"All I ask is that you sell your weapons to us first. All of them. I'm especially interested in the bombs you foreigners make."},{"name":"GASCOT","text":"B-Bombs!? Well, I have some, although they're used for mining, not war. I don't have a great many eith─"},{"name":"JEBEI","text":"None of that matters! Just give me everything you have, you fool! Then you will go back to your wretched homeland and bring more!"},{"name":"GASCOT","text":"Are you positive you have been telling me the truth this whole time?"},{"name":"GASCOT","text":"When <span class=\"highlight\">Forename</span> and I talked to the Au Ra in Reunion, we were told everyone there was equal and at peace. Yet, you would monopolize all the weapons I have for sale?"},{"name":"GASCOT","text":"You also claim the Qestir will listen to anything you <span class=\"emphasis\">say</span>, but I know full well they do not <span class=\"emphasis\">listen</span> to anyone."},{"name":"JEBEI","text":"It seems I was wrong to call you a fool earlier. You've a fair bit of knowledge beneath that thick skull of yours, I see."},{"name":"JEBEI","text":"Now you've caught on to my plan, there is no reason to continue the ruse. We need your bombs to become the dominant tribe. Now hand them over, you cur!"},{"name":"JEBEI","text":"Hand over the bombs!"},{"name":"GASCOT","text":"I cannot. I will not!"},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"GASCOT","text":"<span class=\"highlight\">Forename</span>! Please accept my apologies. He told me I had to come alone."},{"name":"TAMACHAG","text":"(-???-)Jebei. I knew you were foolish, but I never imagined you were so far beyond redemption."},{"name":"TAMACHAG","text":"I am sorry we had to involve you in this, adventurer. However, your efforts have helped us save Reunion from great harm."},{"name":"TAMACHAG","text":"I will make sure the Gesi khan is informed of events. I imagine he will be keen to see Jebei is punished for his crimes."},{"name":"GASCOT","text":"How did things come to this?"},{"name":"TAMACHAG","text":"The Gesi may be the most skilled at hunting, but they are ultimately at the mercy of their weapons. There is a limit to what one can obtain on the Azim Steppe."},{"name":"TAMACHAG","text":"No doubt they have long wondered what they could accomplish were they able to get their hands on weapons from faraway lands."},{"name":"TAMACHAG","text":"Jebei is one of the most radical Gesi I have had the misfortune of meeting. He harbors an intense hatred for the larger tribes such as the Adarkim and the Jhungid."},{"name":"TAMACHAG","text":"His plan was to use foreign tools to demonstrate the Gesi's supposed superiority."},{"name":"GASCOT","text":"I-I did not ask for any of this! I simply wanted to sell my wares, that I may make a living for myself. Do not involve me in your tribal feuds!"},{"name":"TAMACHAG","text":"You clearly still don't understand just why you are hated so in Reunion."},{"name":"TAMACHAG","text":"Think back to that fat Jebei had you procure to turn into oil for Reunion's lamps. What do you think happens when bombs are set off near oil?"},{"name":"GASCOT","text":"You mean to say my actions were endangering the very lives of those who live in Reunion?"},{"name":"GASCOT","text":"I understand Cotota's reluctance now. She foresaw that the trade of foreign weapons would bring only conflict to Reunion."},{"name":"GASCOT","text":"It would have been irresponsible of her to allow me to trade with the Xaela here."},{"name":"GASCOT","text":"Now everything is clear, there is little reason for me to stay any longer. Allow me to apologize for all the trouble I have caused so far."},{"name":"COTOTA","text":"..."},{"name":"SYSTEM","text":"You are handed a vellum covered with Qestiri markings."},{"name":"SYSTEM","text":"Cotota points in the direction Gascot headed. It seems she would have you present the vellum to him."},{"name":"TAMACHAG","text":"Thank you for visiting Reunion. I am not sure we could have stopped Jebei were it not for your help."},{"name":"COTOTA","text":"...?"},{"name":"SYSTEM","text":"Cotota seems to be wondering if you have given the vellum to Gascot."},{"name":"ITURGEN","text":"..."},{"name":"SYSTEM","text":"Iturgen appreciates your help in thwarting Jebei's plot."},{"name":"GASCOT","text":"Ah, <span class=\"highlight\">Forename</span>, I just finished saying farewell to that group of Bomb Dance fans."},{"name":"GASCOT","text":"C-Could it be? This is the very vellum required to trade in Reunion!"},{"name":"GASCOT","text":"But why would Cotota see fit to bestow this honor upon me? My near-bungle almost set Reunion ablaze."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Because you acknowledged your mistake."},{"name":"A2","text":"Because you didn't sell any bombs to Jebei."},{"name":"A2","text":"..."},{"name":"GASCOT","text":"Ah, yes. I foolishly thought that my wares would enrich their lives, while knowing nothing of their culture and customs."},{"name":"GASCOT","text":"But of course! These bombs are for mining, not mass genocide."},{"name":"GASCOT","text":"Haha, nicely done, <span class=\"highlight\">Forename</span>. Words are naught but lies after all. Their kind actions speak louder than words ever could."},{"name":"GASCOT","text":"It's obvious to me now just why they place their faith in actions. Their gesture has made me feel genuine joy for the first time in a long while!"},{"name":"GASCOT","text":"And whilst I would love nothing more than to begin trading right away, I must make one more trip back to our office in Kugane first."},{"name":"GASCOT","text":"I need to have a good think about what I should sell here. I'm inclined to believe food, spices, and seeds of plants suited to the local climate would go down well."},{"name":"GASCOT","text":"I am sure Cotota would appreciate such goods being traded in Reunion. I will return as soon as I am ready."},{"name":"GASCOT","text":"This region is so different to anywhere I have been and that is precisely what makes it fascinating. However, there are still countless people out there who have no understanding of its culture─just like me when I first arrived here."},{"name":"GASCOT","text":"What's more, if traders such as myself descend upon Reunion in droves, the Qestir will doubtless struggle to keep them under control. That is why I must return, to give back to this land that has taught me so much."},{"name":"GASCOT","text":"I owe a great debt both to the Qestir and to you, <span class=\"highlight\">Forename</span>. I truly hope I see you again in Reunion someday."}],"reward":{"gil":1000,"items":[{"id":18421,"one":1,"hq":1},{"id":18422,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"questsType":"all","quests":[68037,68298]}},"partials":[{"type":"npc","id":"1019346","obj":{"i":1019346,"n":"Cotota","l":2411,"q":4}},{"type":"npc","id":"1022141","obj":{"i":1022141,"n":"Gascot","l":2411,"q":1}},{"type":"npc","id":"1019344","obj":{"i":1019344,"n":"Iturgen","l":2411,"q":1}},{"type":"npc","id":"1019347","obj":{"i":1019347,"n":"Tamachag","l":2411,"q":4}},{"type":"npc","id":"1022128","obj":{"i":1022128,"n":"Gascot","l":2411,"q":4}},{"type":"npc","id":"1022137","obj":{"i":1022137,"n":"Gascot","l":2411,"q":1}},{"type":"npc","id":"1022138","obj":{"i":1022138,"n":"Jebei","l":2411,"q":1}},{"type":"item","id":"18421","obj":{"i":18421,"n":"Star Spinel Ring of Healing","l":273,"c":54624,"t":43,"p":16215}},{"type":"item","id":"18422","obj":{"i":18422,"n":"Star Spinel Ring of Casting","l":273,"c":54624,"t":43,"p":16215}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68037","obj":{"i":68037,"n":"A Season for War","g":6,"l":"The Azim Steppe","s":590}},{"type":"quest","id":"68298","obj":{"i":68298,"n":"Words Are Meaningless","g":110,"l":"The Azim Steppe","s":5110}}]}