{"quest":{"name":"Stranger Danger","location":"The Azim Steppe","id":68295,"patch":4.0,"sort":5080,"eventIcon":71221,"issuer":1019362,"target":1019362,"involved":[1022464,1022465,1022466],"genre":110,"journal":["Togene has a soft spot for children."],"objectives":["Search for any lost children.","Report to Togene."],"dialogue":[{"name":"TOGENE","text":"Have you by any chance come for a walk around the market?"},{"name":"TOGENE","text":"I look after families' children while they shop here. I also keep my eyes open for any children that get separated from their parents."},{"name":"TOGENE","text":"If you happen to come across any lost boys and girls please tell them to come here."},{"name":"TOGENE","text":"If you happen to come across any lost boys and girls please tell them to come here."},{"name":"CHILDRENA02759","text":"You say there's a nice lady that will look after me? I will go and search for her now!"},{"name":"CHILDRENA02759","text":"By the way, have you seen any other children that look like me?"},{"name":"CHILDRENB02759","text":"I had no idea there was a lady like that. I will go and play with her until Daddy finishes his work!"},{"name":"CHILDRENB02759","text":"Though I do wish I knew where my brother had gone off to. Maybe he's with the lady already."},{"name":"CHILDRENC02759","text":"What are you talking about? I'm not lost!"},{"name":"CHILDRENC02759","text":"There's a lady here who looks after lost children? Maybe I'll go and speak with her... But not because I'm lost or anything!"},{"name":"TOGENE","text":"I have had three children come saying you sent them to me. I was only supposed to be looking after one today, but things have gotten quite lively."},{"name":"TOGENE","text":"I never cease to be amazed by how friendly Xaela children are with each other. Tribal boundaries mean nothing to them."},{"name":"TOGENE","text":"This group alone contains a pair of Himaa twins, a Boliri girl, and the Bayaqud child that was here from the start."},{"name":"TOGENE","text":"Their tribes are all so different. One of every three Himaa pregnancies results in twins just like these two. Bayaqud women have a tradition of taking multiple husbands."},{"name":"TOGENE","text":"And the Bolir support themselves by collecting dung, drying it, and turning it into charcoal which they then sell to other tribes."},{"name":"TOGENE","text":"They have all been brought up so differently and yet they get along so well. Some days I wish we adults could behave the same."},{"name":"TOGENE","text":"Regardless, that is of no concern to a traveler such as yourself. Thank you for your help."}],"reward":{"gil":579,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68037]}},"partials":[{"type":"npc","id":"1019362","obj":{"i":1019362,"n":"Togene","l":2411,"q":1}},{"type":"npc","id":"1022464","obj":{"i":1022464,"n":"Bold Himaa Boy","l":2411,"q":1}},{"type":"npc","id":"1022465","obj":{"i":1022465,"n":"Curious Himaa Boy","l":2411,"q":1}},{"type":"npc","id":"1022466","obj":{"i":1022466,"n":"Boliri Girl","l":2411,"q":1}},{"type":"quest","id":"68037","obj":{"i":68037,"n":"A Season for War","g":6,"l":"The Azim Steppe","s":590}}]}