{"quest":{"name":"Words Are Very Unnecessary","location":"The Azim Steppe","id":68296,"patch":4.0,"sort":5090,"icon":100705,"unlocksFunction":1,"eventIcon":71341,"issuer":1019347,"target":1022128,"involved":[1019346,1022127],"genre":110,"journal":["Tamachag is not in the best of spirits.","Tamachag asks you to aid some local Qestiri merchants that are being troubled by a foreign merchant. He explains that the Qestiri way is to show one's thoughts with actions in lieu of words─something the merchant is painfully unaware of. You head for the Qestiri khan's tent in search of the trader known as Gascot.","You come across Gascot in the midst of annoying a Qestiri girl that seems to be in charge of the marketplace. Once Gascot realizes you are not a competitor, he agrees to listen as you explain the local customs. Finally convinced talking will get him nowhere, Gascot agrees to leave the locals in peace and talk with you outside.","Gascot remarks that this is his first time talking with a fellow traveler in a long while. He goes on to explain that he has come to Reunion in the hope of starting a trading relationship with the Au Ra there. Admitting the faults with his initial approach, Gascot asks if you would be willing to help him learn more of the area's customs."],"objectives":["Speak with Gascot."],"dialogue":[{"name":"TAMACHAG","text":"Hello, traveler. As it happens, some of the local Qestiri merchants have been dealing with a problem involving your kind of late."},{"name":"TAMACHAG","text":"Reunion is run by the Qestir. It will not do you any favors to displease them."},{"name":"TAMACHAG","text":"The tribe is famed for its dislike of speech─they believe that all words are merely lies. The Qestiri way is to show your intentions through your actions. Nothing else shall suffice for them."},{"name":"TAMACHAG","text":"And yet a merchant from far-off lands has recently appeared in Reunion, trying to force the Qestir to trade by using the very words they despise."},{"name":"TAMACHAG","text":"Ignorance is no excuse─I have seen others attempt to explain the local customs to him. However, it matters not what anyone says if he will not listen."},{"name":"TAMACHAG","text":"I would appreciate it if you were to take responsibility for this buffoon. No doubt he is still in the khan's tent, harping on."},{"name":"TAMACHAG","text":"The man goes by Gascot. Please explain to him that words will do nothing to help his cause."},{"name":"COTOTA","text":"..."},{"name":"SYSTEM","text":"The Qestiri girl furls her brow, willing Gascot to leave her in peace. It appears she is the one in charge of organizing Reunion's marketplace."},{"name":"GASCOT","text":"I don't suppose you'd fancy taking part in this conversation any time soon, would you? If I've done something to displease you, you need only tell me wha─ "},{"name":"GASCOT","text":"And just who would you happen to be? If you're here to trade then you'll have to wait your turn; I arrived first!"},{"name":"GASCOT","text":"What's that? You're not a merchant? Well, are you aware of the funny customs these Qestir have? Apparently words aren't much use, only actions will do."},{"name":"GASCOT","text":"I was told as much by members of other Auri tribes, but I just can't bring myself to believe it. How can one run a market if they refuse to speak!?"},{"name":"GASCOT","text":"Regardless, it does not appear that I stand to gain much from continuing to rely on speech. If even a fellow outsider such as yourself is telling me to follow the Qestiri customs, I suppose it is high time I acquiesced."},{"name":"GASCOT","text":"Now that I think of it, if you're not a competitor, would you perhaps be interested in working <span class=\"emphasis\">with</span> me? Seek me out if you'd like to hear more."},{"name":"COTOTA","text":"..."},{"name":"SYSTEM","text":"It seems she is glad to see the back of Gascot."},{"name":"GASCOT","text":"Ah, it's been an eternity since I last had the chance to talk with a fellow traveler! The name's Gascot; I belong to the East Aldenard Trading Company and I've been stationed in the Far East for a while now. I used to work at our Kugane office until a short while ago."},{"name":"GASCOT","text":"Word has it, it won't be long before Doma fully escapes the Empire's grasp. Very few merchants are going to pass up such a good opportunity to trade with a newly independent nation."},{"name":"GASCOT","text":"Now that Doma is finally free of the Empire's grip, you can bet there'll be hordes of merchants wanting to trade with the newly independent nation."},{"name":"GASCOT","text":"I've always been a pioneer myself and decided that I would make certain I was the first to explore this new potential trade partner. I've brought bags full of foreign goods to impress the locals with!"},{"name":"GASCOT","text":"Yet despite this I am unable to convince them to even talk to me, never mind take a look at my wares. If only they knew what harrowing obstacles I have overcome just to be here─countless levies paid to pirates, daring escapes from fearsome bandits and beasts...I could go on forever."},{"name":"GASCOT","text":"And what is my reward? The icy stare of a Qestiri woman. Until today, I had never met a lady that thought me anything but a charming gent."},{"name":"GASCOT","text":"As it seems I alone am not up to this task, I wish to ask for your aid, knowledgeable adventurer. If you help me convince them to trade, I promise you untold...discounts on everything I have for sale!"},{"name":"GASCOT","text":"No need to be so alarmed, friend! I merely wish for you to help me learn about Qestiri customs. I would not dream of asking you to threaten them, or force you to help me with my work!"},{"name":"GASCOT","text":"Their culture is unlike anything I have encountered thus far. If I am to get anywhere, I must study all of the customs and deities that govern their day-to-day lives. Only then do I stand a chance of convincing them to trade."},{"name":"GASCOT","text":"This information shall doubtless be equally valuable to you on your travels. Why, if I weren't such a humble man, I would demand you show your gratitude to me for giving you this opportunity!"}],"reward":{"gil":800,"aetherCurrent":1,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68037]},"next":[68297]},"partials":[{"type":"npc","id":"1019347","obj":{"i":1019347,"n":"Tamachag","l":2411,"q":4}},{"type":"npc","id":"1022128","obj":{"i":1022128,"n":"Gascot","l":2411,"q":4}},{"type":"npc","id":"1019346","obj":{"i":1019346,"n":"Cotota","l":2411,"q":4}},{"type":"npc","id":"1022127","obj":{"i":1022127,"n":"Gascot","l":2411,"q":1}},{"type":"quest","id":"68037","obj":{"i":68037,"n":"A Season for War","g":6,"l":"The Azim Steppe","s":590}},{"type":"quest","id":"68297","obj":{"i":68297,"n":"Words Are Trivial","g":110,"l":"The Azim Steppe","s":5100}}]}