{"quest":{"name":"Silence of the Lambs","location":"The Azim Steppe","id":68303,"patch":4.0,"sort":5160,"eventIcon":71221,"issuer":1019388,"target":1019388,"involved":[1019405],"genre":110,"journal":["Cotan has awoken to the true potential of cheese."],"objectives":["Speak with Sukegei.","Approach a sheep that looks ready to be milked and fill up the empty milk can.","Deliver the full milk can to Cotan."],"dialogue":[{"name":"COTAN","text":"Tell me, have you ever made cheese before?"},{"name":"COTAN","text":"I make my living selling lanolin at market, but sales have been poor of late."},{"name":"COTAN","text":"It was when things could not get any worse that the elder gods told me to make cheese using sheep's milk collected by an adventurer. I have a feeling that adventurer may be you."},{"name":"COTAN","text":"I imagine the key to making a good cheese lies in the quality of the milk used. Take this can with you and ask Sukegei if you may milk his sheep."},{"name":"SUKEGEI","text":"<span class=\"emphasis\">You</span> want to milk <span class=\"emphasis\">my</span> sheep?"},{"name":"SUKEGEI","text":"Ha ha, I see. Cotan needs milk now, does she? By all means, have a look for a sheep that seems to be in need of a good milking."},{"name":"SYSTEM","text":"Search for a sheep that sounds ready to be milked and fill up the empty milk can."},{"name":"SUKEGEI","text":"By all means, have a look for a sheep that seems to be in need of a good milking."},{"name":"SYSTEM","text":"Search for a sheep that sounds ready to be milked and fill up the empty milk can."},{"name":"SYSTEM","text":"Milk of the highest quality gushes forth from the sheep, filling your can to the brim."},{"name":"SYSTEM","text":"You are unlikely to get any high-quality milk here. Search for a sheep that sounds ready to be milked and fill up the empty milk can."},{"name":"COTAN","text":"Were you able to fill the can I gave you?"},{"name":"COTAN","text":"Yes, this should be more than enough. I was actually just visited by a trader looking for someone to supply him with cheese for his stall. I went ahead and agreed to trade him my first batch as soon as it is ready."},{"name":"COTAN","text":"I must go and express my gratitude to the udgan. The gods always seek to guide us down the right path, but we would not be able to hear them were it not for the udgan's help."},{"name":"COTAN","text":"I am, of course, also indebted to you. The gods may have guided you here, but it was you who chose to listen to my plea. Take this as a symbol of my gratitude."}],"reward":{"gil":648,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68039]}},"partials":[{"type":"npc","id":"1019388","obj":{"i":1019388,"n":"Cotan","l":2411,"q":2}},{"type":"npc","id":"1019405","obj":{"i":1019405,"n":"Sukegei","l":2411,"q":2}},{"type":"quest","id":"68039","obj":{"i":68039,"n":"Stars in the Dark","g":6,"l":"The Azim Steppe","s":610}}]}