{"quest":{"name":"Shop till the Warrior of Light Drops","location":"The Azim Steppe","id":68309,"patch":4.0,"sort":5220,"eventIcon":71221,"issuer":1022479,"target":1022479,"involved":[1022480,1022481,1022482],"genre":110,"journal":["This Mol maiden cannot wait to go shopping in Reunion."],"objectives":["Speak with the Mol maiden.","Obtain herbs.","Speak with the Mol maiden.","Obtain shears.","Speak with the Mol maiden.","Obtain seeds.","Deliver the herbs, shears, and seeds to the Mol maiden."],"dialogue":[{"name":"ASSERTIVEWOMAN02773","text":"Could I ask you to accompany me while I go shopping?"},{"name":"ASSERTIVEWOMAN02773","text":"The udgan told me I am to go shopping with an adventurer today. Meet me in Reunion if you have the time."},{"name":"ASSERTIVEWOMAN02773","text":"Thank you for joining me! I just managed to buy a sack of herbs for a great price."},{"name":"ASSERTIVEWOMAN02773","text":"Though I am not sure if I'm capable of taking them all the way back to Mol Iloh..."},{"name":"ASSERTIVEWOMAN02773","text":"Do you think you would be able to carry them for me? I am going to go and look at that stall over there. Thank you!"},{"name":"ASSERTIVEWOMAN02773","text":"Oh, I just found the loveliest pair of sheep shears."},{"name":"ASSERTIVEWOMAN02773","text":"Could you manage to carry them as well? I have heard one of the stalls here is going to be running a special sale soon. I need to hurry and find out which!"},{"name":"ASSERTIVEWOMAN02773","text":"I am so lucky you are here with me today. I never could have dreamed I would be able to buy so many seeds for such a low price!"},{"name":"ASSERTIVEWOMAN02773","text":"Though it seems I sprained my ankle running around searching for the sale just now. Could you be a darling and carry my shopping back home for me? Oh, thank you. You are too kind!"},{"name":"ASSERTIVEWOMAN02773","text":"My ankle feels fine now─it is a miracle! Would you happen to have my purchases?"},{"name":"ASSERTIVEWOMAN02773","text":"Doubtless it was a heavy load, but I bet it felt like nothing for a strong adventurer such as yourself."},{"name":"ASSERTIVEWOMAN02773","text":"Let me tell you, it was not easy getting my hands on those seeds. They taste incredible when cooked and can also be turned into oil. I had to make full use of my elbows just to avoid missing out."},{"name":"ASSERTIVEWOMAN02773","text":"Of course, it would not have been possible without your help. Here is a reward for all your hard work!"}],"reward":{"gil":924,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68041]}},"partials":[{"type":"npc","id":"1022479","obj":{"i":1022479,"n":"Mol Maiden","l":2411,"q":1}},{"type":"npc","id":"1022480","obj":{"i":1022480,"n":"Mol Maiden","l":2411,"q":1}},{"type":"npc","id":"1022481","obj":{"i":1022481,"n":"Mol Maiden","l":2411,"q":1}},{"type":"npc","id":"1022482","obj":{"i":1022482,"n":"Mol Maiden","l":2411,"q":1}},{"type":"quest","id":"68041","obj":{"i":68041,"n":"The Heart of Nations","g":6,"l":"The Azim Steppe","s":630}}]}