{"quest":{"name":"Sheep Snatcher","location":"The Azim Steppe","id":68307,"patch":4.0,"sort":5200,"unlocksFunction":1,"eventIcon":71341,"issuer":1019405,"target":1019405,"involved":[1021899,1021900],"genre":110,"journal":["Sukegei has been abandoned by his favorite sheep."],"objectives":["Use the blowgun to shoot the lost lamb from the designated location.","Capture the lost lamb.","Deliver the lost lamb to Sukegei."],"dialogue":[{"name":"SUKEGEI","text":"Don't suppose you have time to chase after a sheep do you? My most cowardly one just ran off after hearing a nearby beast's roar."},{"name":"SUKEGEI","text":"She is so timid she is likely to run away if you try to approach her normally."},{"name":"SUKEGEI","text":"Take this blowgun and these darts that I've laced with a sedative. One hit and she will be out in an instant. She ran off somewhere to the west. Best of luck!"},{"name":"SUKEGEI","text":"Use that blowgun I gave you to put my sheep to sleep. She ran off somewhere to the west. Best of luck!"},{"name":"SYSTEM","text":"The lost lamb is wary of your presence."},{"name":"SUKEGEI","text":"You are going to need to put her to sleep first if you are to have any chance of catching her."},{"name":"SUKEGEI","text":"Did you manage to catch my sheep?"},{"name":"SUKEGEI","text":"Oh, thank you! You had me worried sick you did, deary."},{"name":"SUKEGEI","text":"This job means everything to me. It truly does."},{"name":"SUKEGEI","text":"I was just a lonely orphan with nowhere to call my own when the Mol took me in. I said I would look after our sheep in an attempt to show my gratitude."},{"name":"SUKEGEI","text":"My heart nearly stopped when this little one ran away. Sheep are the cornerstone of our tribe's way of life."},{"name":"SUKEGEI","text":"I fear I will never be able to truly express my thanks to you, but know I am grateful."}],"reward":{"gil":648,"aetherCurrent":1,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68041]}},"partials":[{"type":"npc","id":"1019405","obj":{"i":1019405,"n":"Sukegei","l":2411,"q":2}},{"type":"npc","id":"1021899","obj":{"i":1021899,"n":"Lost Lamb","l":2411,"q":1}},{"type":"npc","id":"1021900","obj":{"i":1021900,"n":"Sleeping Lamb","l":2411,"q":1}},{"type":"quest","id":"68041","obj":{"i":68041,"n":"The Heart of Nations","g":6,"l":"The Azim Steppe","s":630}}]}