{"quest":{"name":"Oh Matron","location":"The Azim Steppe","id":68300,"patch":4.0,"sort":5130,"eventIcon":71221,"issuer":1023254,"target":1023254,"genre":110,"journal":["This clumsy Mol maiden has broken something fairly important."],"objectives":["Slay three matamata and obtain a matamata matron shell and claw from a matamata matron.","Deliver the matamata matron shell and claw to the Mol maiden."],"dialogue":[{"name":"BRIDE02764","text":"Please, you have to help me. I have broken the gifts I was supposed to give my soon-to-be husband's family. I need to fix them as soon as possible."},{"name":"BRIDE02764","text":"I require a matamata's shell and claw. However, I am incapable of obtaining them myself."},{"name":"BRIDE02764","text":"What is more, they must be taken from a matamata matron. A creature which is seldom seen."},{"name":"BRIDE02764","text":"Though, there is a way to draw one out into the open. Slay several matamata and one will appear eventually."},{"name":"BRIDE02764","text":"I was told to marry my husband by the elder gods themselves. This marriage <span class=\"emphasis\">must</span> go ahead. "},{"name":"BRIDE02764","text":"Slay the matamata to the west and a matron will appear soon enough."},{"name":"BRIDE02764","text":"Please bring its shell and a claw back to me. Without those I cannot repair the gifts."},{"name":"BRIDE02764","text":"Were you successful?"},{"name":"BRIDE02764","text":"Oh, thank you! I do not know what I would have done without you."},{"name":"BRIDE02764","text":"Our tribe is smaller than most. We try to prevent ourselves from becoming alienated from the other tribes by marrying our members with theirs."},{"name":"BRIDE02764","text":"It will take a while for me to get used to a life that is not controlled by the elder gods, but I know everything will be fine─it was they who chose this path for me."},{"name":"BRIDE02764","text":"Now, it is time I began repairing the gifts. Should our paths cross again someday, I would very much like to introduce you to my new family."}],"reward":{"gil":614,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68039]}},"partials":[{"type":"npc","id":"1023254","obj":{"i":1023254,"n":"Mol Maiden","l":2411,"q":1}},{"type":"quest","id":"68039","obj":{"i":68039,"n":"Stars in the Dark","g":6,"l":"The Azim Steppe","s":610}}]}