{"quest":{"name":"Keeping the Faith","location":"The Azim Steppe","id":68304,"patch":4.0,"sort":5170,"eventIcon":71221,"issuer":1019387,"target":1019387,"involved":[1023401],"genre":110,"journal":["Nigen is worried about yet another family member."],"objectives":["Find Nigen's sister and slay any enemies that appear.","Rescue Nigen's sister.","Report to Nigen."],"dialogue":[{"name":"NIGEN","text":"Allow me to thank you once again for helping my brother. Would you be able to aid my sister as well? Our family is somewhat troubled..."},{"name":"NIGEN","text":"The gods told her to go and gather water from the river to the west. However, many beasts lurk in the area. I worry she will be set upon as my brother was."},{"name":"NIGEN","text":"Yet again I am unable to accompany her as the elder gods have given me my own work."},{"name":"NIGEN","text":"Could I ask you to check on her in my stead? She should still be gathering water to the west."},{"name":"NIGEN","text":"Please check on my sister in my stead. She should still be gathering water to the west."},{"name":"YOUNGNIGEN","text":"Thank you so much, kind stranger. I am in your debt."},{"name":"YOUNGNIGEN","text":"Tell me, have you heard of this river before? Its water is said to have healing properties─one drink and all your ailments shall be gone!"},{"name":"YOUNGNIGEN","text":"I imagine that someone in the village is going to fall sick shortly. That is surely why the gods bid me to gather water from the river."},{"name":"NIGEN","text":"Did you find my sister? She is still yet to return."},{"name":"NIGEN","text":"Thank you for your help. My sister is returned at last."},{"name":"NIGEN","text":"It seems you have influenced my siblings quite profoundly. They too have decided to become adventurers!"},{"name":"NIGEN","text":"No doubt the elder gods foresaw this when they sent them out on their errands. I am most excited to hear of their adventures in the future."}],"reward":{"gil":648,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"questsType":"all","quests":[68040,68302]},"next":[68308]},"partials":[{"type":"npc","id":"1019387","obj":{"i":1019387,"n":"Nigen","l":2411,"q":3}},{"type":"npc","id":"1023401","obj":{"i":1023401,"n":"Nigen's Sister","l":2411,"q":1}},{"type":"quest","id":"68040","obj":{"i":68040,"n":"A Warrior's Welcome","g":6,"l":"The Azim Steppe","s":620}},{"type":"quest","id":"68302","obj":{"i":68302,"n":"Absolute Faith","g":110,"l":"The Azim Steppe","s":5150}},{"type":"quest","id":"68308","obj":{"i":68308,"n":"And Dzo It Goes","g":110,"l":"The Azim Steppe","s":5210}}]}