{"quest":{"name":"The Ideal Budugan Warrior","location":"The Azim Steppe","id":68313,"patch":4.0,"sort":5260,"eventIcon":71221,"issuer":1023311,"target":1023311,"involved":[1023312],"genre":110,"journal":["The Budugan warrior squints at you."],"objectives":["Speak with the Budugan warrior."],"dialogue":[{"name":"YOUNGFIGHTER02777","text":"...Wait a minute. I know you. Your accomplishments are the only thing anyone talks about nowadays. If you are not too busy, might you agree to accompany me to the area below? There is something I want to show you."},{"name":"YOUNGFIGHTER02777","text":"Hahaha! You need not look so skeptical. It is nothing too sinister, I assure you."},{"name":"YOUNGFIGHTER02777","text":"Even if it was, you are a hardened warrior, are you not? Now come, let us go before the day grows old."},{"name":"YOUNGFIGHTER02777","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s here! You can come out now, my friends!"},{"name":"YOUNGFIGHTER02777","text":"Bravo! That was quite a show! I am pleased to have been able to witness the extent of your strength firsthand. Even though these men had the element of surprise on their side, you defeated them with such ease!"},{"name":"YOUNGFIGHTER02777","text":"But before that, please allow me to apologize for lying to you. Some of us wanted to test our strength against yours─the famed outsider who successfully followed in Bardam's footsteps─and I could think of no other way to bring you here."},{"name":"YOUNGFIGHTER02777","text":"It is now clear that your prowess on the battlefield is unparalleled. ...What would you say to joining us? Outsider or not, we would gladly welcome a man of your ability."},{"name":"YOUNGFIGHTER02777","text":"&lt;sigh&gt; 'Tis a true shame you are a woman. Had you been a man, we would have gladly invited you to join our ranks. Were you Dotharl, we would even have awaited your reincarnation as a man. Alas, it seems our destinies were fated to diverge!"},{"name":"YOUNGFIGHTER02777","text":"Well, I suppose that is that. Anyroad, I would like to thank you for playing along. It was an enlightening experience. Now let us return to the Dawn Throne, shall we?"},{"name":"YOUNGFIGHTER02777","text":"The rumors─they do you no justice. You are possessed of the might of at least one hundred Budugan warriors."},{"name":"YOUNGFIGHTER02777","text":"Now I think on it, perhaps you are a little too strong to become one of us. Even if you somehow joined us, during training you would no doubt find yourself growing bored, for none of us would even come close to posing a challenge for you!"}],"reward":{"gil":648,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68044]}},"partials":[{"type":"npc","id":"1023311","obj":{"i":1023311,"n":"Budugan Warrior","l":2411,"q":1}},{"type":"npc","id":"1023312","obj":{"i":1023312,"n":"Budugan Warrior","l":2411,"q":1}},{"type":"quest","id":"68044","obj":{"i":68044,"n":"The Children of Azim","g":6,"l":"The Azim Steppe","s":660}}]}