{"quest":{"name":"The Lights That Guide Us Home","location":"The Azim Steppe","id":68314,"patch":4.0,"sort":5270,"eventIcon":71221,"issuer":1019428,"target":1019428,"genre":110,"journal":["Guyug is closely observing your movements."],"objectives":["Use the Oroniri lamp oil to refill the low-burning Oroniri lamps.","Report to Guyug."],"dialogue":[{"name":"GUYUG","text":"That self-assured gait, those keen eyes... Yes, you would no doubt be equal to the task."},{"name":"GUYUG","text":"Tell me, have you ever noticed the lamps placed throughout the Steppe? My partner and I are responsible for their maintenance."},{"name":"GUYUG","text":"Whenever the flames begin to burn too low, we replenish their fuel. We also conduct regular patrols of the area. The light tends to attract wild beasts and it is our duty to contend with whatever it draws out of hiding."},{"name":"GUYUG","text":"Today, however, I must cover this large perimeter alone, as my partner is too hurt to move. He injured himself while riding his horse, and I was hoping you might step in for him."},{"name":"GUYUG","text":"Please, take this oil and refill five lamps that appear to be burning low. Oh, and remember to remain vigilant! There are many dangerous beasts in the Steppe and I would hate to lose another partner."},{"name":"GUYUG","text":"I ask that you replenish the oil of five lamps. Hopefully, you will be able to make quick work of it."},{"name":"GUYUG","text":"Welcome back! Thanks to you, now no one needs to fear becoming lost in the dark."},{"name":"GUYUG","text":"When night falls and the lands are no longer illuminated by Father Azim, the lamps below serve to safely guide whoever might be passing through the Steppe. That is why we must ensure they never go out."},{"name":"GUYUG","text":"You have done us a great service this day. May Father Azim ever watch over you."}],"reward":{"gil":614,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68044]}},"partials":[{"type":"npc","id":"1019428","obj":{"i":1019428,"n":"Guyug","l":2411,"q":1}},{"type":"quest","id":"68044","obj":{"i":68044,"n":"The Children of Azim","g":6,"l":"The Azim Steppe","s":660}}]}