{"quest":{"name":"The World without Her","location":"The Azim Steppe","id":68315,"patch":4.0,"sort":6010,"eventIcon":71221,"issuer":1019430,"target":1019430,"involved":[1019436],"genre":110,"journal":["Sorocan gazes into the distance, a concerned frown upon her face."],"objectives":["Deliver the Oroniri leather bag to Khaidai.","Survey the area for desertmaker beetles and use the vials of acid to slay any that appear.","Speak with Khaidai.","Report to Sorocan."],"dialogue":[{"name":"SOROCAN","text":"If your attire is anything to go by, you must be the traveler I have heard so much about. I am glad our paths have crossed."},{"name":"SOROCAN","text":"Earlier, my husband left to take some of our sheep to the grazing fields, and in his haste, forgot his medicine bag. I fear without it, he may not be able to contend with the dangerous pests that roam there."},{"name":"SOROCAN","text":"Please, see that it reaches him quickly. You should be able to find him to the south of here, tending to a flock of sheep."},{"name":"SOROCAN","text":"I only hope it is not too late. Please hurry, for the grazing lands are often filled with danger."},{"name":"KHAIDAI","text":"Who are you and what have you come here for?"},{"name":"KHAIDAI","text":"Sorocan sent you to deliver this to me? Unfortunately, you came too late."},{"name":"KHAIDAI","text":"You see, desertmaker beetles run rampant in this area. This bag contains a few vials of acid, which softens their tough carapace and renders them defenseless."},{"name":"KHAIDAI","text":"The creatures are incredibly tenacious and are difficult to take down without the help of this mixture. Earlier, I attempted to drive one off on my own and was injured."},{"name":"KHAIDAI","text":"While I remain here to recover, would you go and clear the surrounding area of these beetles for me?"},{"name":"KHAIDAI","text":"Here, take these vials. Empty their contents upon any desertmaker beetle that comes at you. It will make them that much easier to kill."},{"name":"KHAIDAI","text":"Please see that the neighboring areas are cleared of any stray desertmaker beetles. In the meantime, I shall remain here and gather my strength."},{"name":"KHAIDAI","text":"The beetles are gone, I take it? Now finally my sheep can graze in peace and I need not fear facing another one under less-than-favorable circumstances. Thank you."},{"name":"KHAIDAI","text":"In addition to being organized, my wife has a knack for picking out reliable individuals. I cannot count the number of times I have been saved by that woman. I do not know what I would do without her..."},{"name":"KHAIDAI","text":"B-But don't you ever tell her that I said that! As an Oroniri man, it is my duty to protect her, not the other way around."},{"name":"KHAIDAI","text":"Now then, if you want your reward, you best return to my wife. She will see that you are fairly compensated for your services."},{"name":"SOROCAN","text":"Oh! You are back! My husband was not hurt, was he?"},{"name":"SOROCAN","text":"Bahaha! Perhaps now he has finally learned his lesson!"},{"name":"SOROCAN","text":"&lt;sigh&gt; Then again, I suppose I cannot complain. While Khaidai may not have the eye for detail that I do, he is an incredibly kind man and does what he can to take care of both me and our sheep."},{"name":"SOROCAN","text":"Ah─but forgive me. You have not come all this way to hear me talk about my husband! Please, take this and feel free to be on your way!"}],"reward":{"gil":760,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68045]}},"partials":[{"type":"npc","id":"1019430","obj":{"i":1019430,"n":"Sorocan","l":2411,"q":2}},{"type":"npc","id":"1019436","obj":{"i":1019436,"n":"Khaidai","l":2411,"q":1}},{"type":"quest","id":"68045","obj":{"i":68045,"n":"The Labors of Magnai","g":6,"l":"The Azim Steppe","s":670}}]}