{"quest":{"name":"Spoils of War","location":"The Azim Steppe","id":68316,"patch":4.0,"sort":6020,"eventIcon":71221,"issuer":1019434,"target":1019434,"genre":110,"journal":["Yabuqa watches the flames of the fire, a wistful expression upon his face."],"objectives":["/pray at the designated location.","Report to Yabuqa."],"dialogue":[{"name":"YABUQA","text":"Say, friend, might you do me a favor?"},{"name":"YABUQA","text":"Not too far to the southeast of here are the decimated ruins of Kahkol Iloh. I ask that you go there and <span class=\"highlight\">pray</span> for the souls of my deceased parents and sister."},{"name":"YABUQA","text":"&lt;sigh&gt; It is not a sentiment any of the other Buduga would understand, which is why I need for you to go in my stead."},{"name":"YABUQA","text":"Please, make your way to Kahkol Iloh and send your <span class=\"highlight\">prayers</span> to my parents and sister. Mayhap through you, they will receive mine, as well."},{"name":"SYSTEM","text":"<span class=\"highlight\">Pray</span> for Yabuqa's dead family."},{"name":"YABUQA","text":"I appreciate you entertaining such an...odd request. Many of the other Buduga warriors will think me soft for it, but I always feel the need to send someone out to my old village at this time of year to pray for them."},{"name":"YABUQA","text":"Ah─it seems I neglected to tell you that I am originally from Kahkol Iloh. When I was a child, the Buduga came and pillaged our settlement. My family offered me up to them as tribute."},{"name":"YABUQA","text":"For the longest time I resented them. I eventually came to learn, however, that shortly after I left, a deadly epidemic swept through my old home and killed everyone who had been left behind."},{"name":"YABUQA","text":"I suspect my parents knew what was to come and sent me away to protect me. &lt;sigh&gt; I have years of making up to do for the hatred I harbored in my heart toward them."},{"name":"YABUQA","text":"As a member of the Buduga it is difficult for me to find opportunities to visit Kahkol Iloh and offer them my prayers. That is why I ask travelers passing through to lend me their assistance. You have my sincerest gratitude, friend."}],"reward":{"gil":585,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68045]}},"partials":[{"type":"npc","id":"1019434","obj":{"i":1019434,"n":"Yabuqa","l":2411,"q":1}},{"type":"quest","id":"68045","obj":{"i":68045,"n":"The Labors of Magnai","g":6,"l":"The Azim Steppe","s":670}}]}