{"quest":{"name":"Forty Years and Counting","location":"The Azim Steppe","id":68318,"patch":4.0,"sort":6040,"icon":100706,"unlocksFunction":1,"eventIcon":71341,"issuer":1023348,"target":1023348,"involved":[1019430],"genre":110,"journal":["Esugen hums quietly to himself as he works.","Esugen, the Dawn Throne culinarian, is in quite the predicament. Halfway through preparing food to feed the hungry Oroniri warriors, he realizes he has forgotten to obtain a key ingredient─sheep's milk. Were he to go and fetch this himself, he would fall behind schedule and find himself at the mercy of fifty hot-blooded, hungry men. To prevent any delays in serving the food, he asks that you go and bring back the milk of three sheep for him. He then directs you to speak with Sorocan to do just that.","Sorocan is appalled to learn that Esugen sent you to milk sheep in his stead and is convinced that he is attempting to shirk his responsibilities. Nevertheless, she allows you to proceed to the pen and collect sheep milk.","You approach three sheep and manage to fill all three of the pails full of milk, just as Esugen requested. Deliver them to the Oroniri culinarian.","Shortly after delivering the pails of milk to Esugen, the two of you are joined by a young man named Kuzuku, who seems to have come solely to taunt the local culinarian. Once he leaves, Esugen turns to you and reveals that as the weakest man in the village, he occupies the bottom rung in the Oroniri hierarchy. He, however, intends to become strong enough to rise from his lowly position, and asks that you help him with his cooking on occasion that he might find the time to train."],"objectives":["Speak with Sorocan.","Obtain pails of fresh sheep's milk.","Deliver the fresh sheep's milk to Esugen."],"dialogue":[{"name":"ESUGEN","text":"Ah─a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> not of the Steppe. How unusual! Were it that I had the time, I would take you around and acquaint you with our small settlement."},{"name":"ESUGEN","text":"Alas, as the Oronir's only culinarian, time is a rare commodity. I must keep all fifty of our warriors fed. Thankfully, now that the meat has been cut and the entrails soaked, all that is left for me to do is─ Bah! I am out of sheep's milk!"},{"name":"ESUGEN","text":"This is a disaster! If I leave to milk sheep now, I will fall behind on cooking, and the starved masses are sure to lynch me upon their return!"},{"name":"ESUGEN","text":"I am loath to have to ask this of you─especially since we are virtual strangers─but might you fetch me some milk? About three pails should suffice."},{"name":"ESUGEN","text":"On the other side of our encampment is Sorocan. You would need to receive her permission first to approach the sheep."},{"name":"SOROCAN","text":"Esugen sent <span class=\"emphasis\">you</span>? That he would ask an outsider, of all people, to do his work for him─the man has not a shred of common sense!"},{"name":"SOROCAN","text":"&lt;sigh&gt; Anyroad, the sheep are just over there. Feel free to take as much milk as you need."},{"name":"ESUGEN","text":"Upon receiving Sorocan's blessing to do so, you can begin milking the sheep. Please, fill up three pails and bring them back to me as fast as you can!"},{"name":"SOROCAN","text":"Sending visitors running about to fulfill tasks you could easily do yourself is the height of indolence! Someone needs to beat some sense into that man!"},{"name":"ESUGEN","text":"Aha! You showed up in the nick of time! ...You have brought the sheep's milk, right?"},{"name":"ESUGEN","text":"Bless you, my friend! From our foods to our tea─we use this milk for nearly everything. That is why I must maintain a constant watch over my supplies."},{"name":"ESUGEN","text":"&lt;sigh&gt; It is, however, something that has become increasingly difficult to do of late. The number of hungry mouths I must feed grows by the day, but I remain our only culinarian."},{"name":"KUZHUK","text":"Is Esugen bothering you? You need not pay him any heed. He is...inconsequential to our tribe. Bhahaha! The man is nearly forty, yet the only thing he can properly wield is a ladle."},{"name":"ESUGEN","text":"...Kuzuku is right. I am feeble─the weakest among our brothers. It should come as no surprise then that here, in a tribe where your standing hinges solely upon how strong you are, I am afforded little respect."},{"name":"ESUGEN","text":"When everyone else is out hunting, I am left here to cook whatever they brought back from their last excursion."},{"name":"ESUGEN","text":"While most Oronir will claim that all brothers under our most radiant brother Magnai are equal, nothing could be further from the truth. I wish to be stronger─strong enough to prove to them that I am not worthless!"},{"name":"ESUGEN","text":"Say, might you agree to help me with my cooking on occasion? It would afford me the time to train and earn my place among the other warriors!"},{"name":"ESUGEN","text":"Haha! You certainly know how to brighten a man's day! Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span>...?"},{"name":"ESUGEN","text":"<span class=\"highlight\">Forename</span>? It is good to finally be able to put a name to your face!"}],"reward":{"gil":800,"aetherCurrent":1,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68046]},"next":[68319]},"partials":[{"type":"npc","id":"1023348","obj":{"i":1023348,"n":"Esugen","l":2411,"q":5}},{"type":"npc","id":"1019430","obj":{"i":1019430,"n":"Sorocan","l":2411,"q":2}},{"type":"quest","id":"68046","obj":{"i":68046,"n":"For Love of the Moon","g":6,"l":"The Azim Steppe","s":680}},{"type":"quest","id":"68319","obj":{"i":68319,"n":"Chasing Rainbows","g":110,"l":"The Azim Steppe","s":6050}}]}