{"quest":{"name":"Broken Flowers","location":"The Azim Steppe","id":68317,"patch":4.0,"sort":6030,"eventIcon":71221,"issuer":1023313,"target":1023313,"involved":[1023314],"genre":110,"journal":["An Oroniri hunter would like to study your combat style."],"objectives":["Speak with the Oroniri hunter.","Slay chaochus.","Report to the Oroniri hunter.","Speak with the Oroniri hunter."],"dialogue":[{"name":"ORONIRHUNTER02781","text":"I gather from your peculiar attire that you are not from around here?"},{"name":"ORONIRHUNTER02781","text":"Very good. I have always been curious to observe a warrior from outside the Steppe in battle. You see, as a hunter, it is my duty to defend the Dawn Throne and the surrounding perimeter─especially against creatures known as chaochus."},{"name":"ORONIRHUNTER02781","text":"As such, I am constantly searching for ways to improve my own fighting technique. I feel there is a lot I can learn by observing you. Please, if you are willing, meet me to the southwest of here. There you can demonstrate to me your combat style."},{"name":"ORONIRHUNTER02781","text":"This area is populated by chaochus. Please go and slay two. I shall carefully observe your movements from here."},{"name":"ORONIRHUNTER02781","text":"Please quickly go and slay two chaochus for me. I am anxious to see how you fight and if any of your techniques might be applied to my own."},{"name":"ORONIRHUNTER02781","text":"Over the course of my lifetime I have been exposed to many combat styles but never have I met anyone who fights with such fluidity and grace."},{"name":"ORONIRHUNTER02781","text":"Today I have gained some valuable insight into the art of war and for that I would like to gift you with something of equal worth. Please, follow me."},{"name":"ORONIRHUNTER02781","text":"The more I replay the scene of you facing the chaochus, the more I am impressed with just how refined your skills are. You even somehow managed to slay the creatures while leaving the flowers blossoming from their heads untouched."},{"name":"ORONIRHUNTER02781","text":"Chaochu flowers are extremely precious to us and we often offer them up to Father Azim during certain ceremonies. Though, should they be missing even a single petal, it would ruin the gesture entirely."},{"name":"ORONIRHUNTER02781","text":"While I have little difficulty in taking down these monsters, I often end up destroying their flowers in the process. I am confident that in incorporating a few of your techniques this can change."},{"name":"ORONIRHUNTER02781","text":"I shall not forget the knowledge you have bestowed upon me today. You have my sincerest thanks."}],"reward":{"gil":655,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68045]}},"partials":[{"type":"npc","id":"1023313","obj":{"i":1023313,"n":"Oroniri Hunter","l":2411,"q":1}},{"type":"npc","id":"1023314","obj":{"i":1023314,"n":"Oroniri Hunter","l":2411,"q":1}},{"type":"quest","id":"68045","obj":{"i":68045,"n":"The Labors of Magnai","g":6,"l":"The Azim Steppe","s":670}}]}