{"quest":{"name":"The Fingers of Azim","location":"The Azim Steppe","id":68312,"patch":4.0,"sort":5250,"eventIcon":71221,"issuer":1019427,"target":1019427,"genre":110,"journal":["Charakha stares at you with admiration."],"objectives":["Use the Oroniri kumis on the designated locations.","Report to Charakha."],"dialogue":[{"name":"CHARAKHA","text":"Aha! I recognize you─you are the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> that conquered Bardam's Mettle. You must be possessed of an inhuman strength."},{"name":"CHARAKHA","text":"Rare are the outsiders who win the respect of Azim's sons and daughters."},{"name":"CHARAKHA","text":"We must celebrate your triumph of this most arduous of trials the Oronir way: you are to perform a sacred ritual."},{"name":"CHARAKHA","text":"It is not complicated. All you must do to complete it is visit five stones in the area and sprinkle some kumis on them."},{"name":"CHARAKHA","text":"You are not to do this lightly, however. With each drop of liquid that hits the stone, you must think of a goal you wish to achieve and make a vow to yourself to attain it."},{"name":"CHARAKHA","text":"Once you are finished, come back to see me. Good luck!"},{"name":"CHARAKHA","text":"Whatever you do, be sure to keep your goals at the forefronts of your mind as you sprinkle the kumis upon the stones─that is the most important part, after all."},{"name":"CHARAKHA","text":"You have finished the ritual, I take it? Very good. Then, please allow me to share with you the meaning behind this practice."},{"name":"CHARAKHA","text":"You see, the five stones upon which you poured the kumis are also referred to as the “fingers of Azim.” This ritual is way of showing him our respect and allows us to receive his guidance."},{"name":"CHARAKHA","text":"If he deems our desire great enough, he will carve a path for us to achieve it. Though, that is not to say we can simply sit back and relax. We must also work hard to fulfill our dreams."},{"name":"CHARAKHA","text":"Father Azim sees all and hears all. Your wishes have reached him and, should he deem you worthy, he shall grant them unto you."}],"reward":{"gil":614,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68044]}},"partials":[{"type":"npc","id":"1019427","obj":{"i":1019427,"n":"Charakha","l":2411,"q":1}},{"type":"quest","id":"68044","obj":{"i":68044,"n":"The Children of Azim","g":6,"l":"The Azim Steppe","s":660}}]}