{"quest":{"name":"The Judgment","location":"The Azim Steppe","id":68310,"patch":4.0,"sort":5230,"eventIcon":71221,"issuer":1019425,"target":1019425,"genre":110,"journal":["Abaka looks at you with an incredulous glint in his eye."],"objectives":["Slay khun chuluu.","Report to Abaka."],"dialogue":[{"name":"ABAKA","text":"Oi, you! Hold it right there. You are the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> rumored to have conquered Bardam's Mettle, are you not?"},{"name":"ABAKA","text":"I strain to believe that <span class=\"emphasis\">you</span>, an outsider, would be able to pass the very trial even trained warriors of the Steppe struggle to overcome. If you are as great as they say, you should have no trouble passing my little test."},{"name":"ABAKA","text":"To the northwest are khun chuluu. Defeat four and perhaps the rumors hold a grain of the truth. Should you fail to do so, however, I shall know you are naught more than a charlatan."},{"name":"ABAKA","text":"Slaying four khun chuluu is but child's play for a son of Azim. If you're half as strong as I have been led to believe you should have no problem."},{"name":"ABAKA","text":"Ha! Come back already with your tail between your legs, have you? I knew you were not the warrior you were cracked up to be."},{"name":"ABAKA","text":"That you would rise to the challenge and face four of the deadly monsters regardless of the fact that no one would be there to congratulate you on your triumph─you are a warrior in the truest sense of the word."},{"name":"ABAKA","text":"How do I know, you ask? I watched you from the skies, atop my yol."},{"name":"ABAKA","text":"...It seems I owe you an apology. I should not have doubted your abilities."},{"name":"ABAKA","text":"In proving your strength you have won my respect. I shall be sure to regale the others with tales of your fighting prowess."}],"reward":{"gil":614,"xp":103950},"reqs":{"jobs":[{"lvl":65,"id":34}],"quests":[68044]}},"partials":[{"type":"npc","id":"1019425","obj":{"i":1019425,"n":"Abaka","l":2411,"q":1}},{"type":"quest","id":"68044","obj":{"i":68044,"n":"The Children of Azim","g":6,"l":"The Azim Steppe","s":660}}]}