{"quest":{"name":"Welcome to the Family","location":"The Azim Steppe","id":68322,"patch":4.0,"sort":6080,"eventIcon":71221,"issuer":1023133,"target":1022702,"involved":[1023134,1023135],"genre":110,"journal":["This unbloodied Dotharl needs help with a delivery."],"objectives":["Speak with the unbloodied Dotharl.","Obtain the chilled leather sack.","Deliver the chilled leather sack to Sechen."],"dialogue":[{"name":"FOREIGNER02786","text":"You there. I require your help. I have to transport some provisions, but I cannot do it alone."},{"name":"FOREIGNER02786","text":"I await you by the river to the northwest. That is where I have left the food."},{"name":"FOREIGNER02786","text":"Thank you for coming. I wish to deliver all of this to an Uyagir. You are doubtless wondering why I would aid someone from another tribe."},{"name":"FOREIGNER02786","text":"When I was born, the Dotharl khatun looked into my eyes, and did not see a soul she recognized. When this happens, it is thought that the soul of a noble warrior from another tribe has been invited to join the Dotharl."},{"name":"FOREIGNER02786","text":"But this knowledge gave me no peace. I needed to know of my previous life. I set about researching the history of the other tribes. Eventually, I came across the tale of an Uyagiri warrior, one that sacrificed himself in battle to save an injured Dotharl."},{"name":"FOREIGNER02786","text":"It stands to reason such a benevolent spirit would become a Dotharl in their next life. I am positive this warrior's soul resides within me."},{"name":"FOREIGNER02786","text":"Today is his─my mother's nameday. Her name is Sechen. I decided to give her this food as a present."},{"name":"FOREIGNER02786","text":"However, in my excitement, I have bought far more than I could hope to carry alone. I need your help to transport the rest. My mother dwells in the Hundred–and–one Revelations."},{"name":"SECHEN","text":"Ah, you must be the one he said would be coming shortly."},{"name":"SECHEN","text":"Oh my, this is much more than I ever dared expect! Look at all this fruit. Thank you so much."},{"name":"FOREIGNER02786","text":"It <span class=\"emphasis\">is</span> your nameday after all. You should allow yourself to be pampered on this one day at the very least."},{"name":"SECHEN","text":"Honestly, you do too much for me. But, know that I am grateful. Your kindness reminds me of my son so very much."},{"name":"SECHEN","text":"I take it he has told you everything? As an Uyagir, I am not too familiar with the concept of reincarnation. As such, I cannot judge whether or not he is truly my son."},{"name":"SECHEN","text":"But one thing I do know for certain is that he has been a great help to me."},{"name":"FOREIGNER02786","text":"You are too kind. It is a son's duty to look after his mother. I have done naught special."},{"name":"FOREIGNER02786","text":"Now that I think of it, I have not properly thanked you yet! I could not have delivered Mother's gifts without you. Here is a token of my gratitude."},{"name":"FOREIGNER02786","text":"Thank you for your aid. I have told Mother that you would be coming. Please give the gifts to her."}],"reward":{"gil":585,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68048]},"next":[68332,68333,68334]},"partials":[{"type":"npc","id":"1023133","obj":{"i":1023133,"n":"Unbloodied Dotharl","l":2411,"q":1}},{"type":"npc","id":"1022702","obj":{"i":1022702,"n":"Sechen","l":2411,"q":1}},{"type":"npc","id":"1023134","obj":{"i":1023134,"n":"Unbloodied Dotharl","l":2411,"q":1}},{"type":"npc","id":"1023135","obj":{"i":1023135,"n":"Unbloodied Dotharl","l":2411,"q":1}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}},{"type":"quest","id":"68332","obj":{"i":68332,"n":"Ibakha Dreams of Birds","g":110,"l":"The Azim Steppe","s":6180}},{"type":"quest","id":"68333","obj":{"i":68333,"n":"The Melody of Ceol Aen","g":110,"l":"The Azim Steppe","s":6190}},{"type":"quest","id":"68334","obj":{"i":68334,"n":"Food Glorious Food","g":110,"l":"The Azim Steppe","s":6200}}]}