{"quest":{"name":"The Tournament","location":"The Azim Steppe","id":68320,"patch":4.0,"sort":6060,"icon":100706,"eventIcon":71221,"issuer":1023348,"target":1023348,"involved":[1022131,1023349],"genre":110,"journal":["Esugen has finished all his tasks for today.","Jelme, a young Oroniri boy informs Esugen and you of an upcoming tournament to be held among the brothers of the tribe. While reluctant to do so, the culinarian is required to participate and hastens off to train. As soon as your friend leaves, Jelme turns to you with a request on the tip of his tongue.","As Esugen continuously places last in all strength-based tournaments, in the days leading up to the match he often becomes depressed. Jelme, wanting to help lift his spirits, has written a letter of encouragement. He feels too embarrassed to deliver it himself, however, and requests that you take it to the culinarian in his stead.","Esugen is visibly moved by the touching words penned upon the letter. He would like to thank the young boy in person for the kind gesture and begins making his way back to the Dawn Throne with you in tow.","Esugen's joy is short-lived for not soon after you return to where Jelme is, you are joined by his brother, Kuzuku. After directing a few scathing remarks at the culinarian, he warns the young boy against associating with Esugen then leaves. More than Kuzuku's harsh words, however, Jelme is upset by Esugen's passive attitude. Begging him to learn to stand up for himself, the orphan storms off, leaving you and the stunned culinarian in his wake.","Seeing how upset Jelme was by Kuzuku's comments and his passive reaction to them, Esugen vows to no longer let people to walk all over him. He has steeled his resolve and intends to do his very best in the upcoming tournament."],"objectives":["Speak with Jelme.","Deliver Jelme's letter to Esugen.","Report to Jelme.","Speak with Esugen."],"dialogue":[{"name":"ESUGEN","text":"<span class=\"highlight\">Forename</span>, how kind of you to come by and check in on me. I have, however, already finished everything that needs to be done for today."},{"name":"JELME","text":"Mister Esugen! Mister Esugen! Did you hear the news? There is to be a tournament among the brothers to determine who will be participating in the upcoming Naadam!"},{"name":"JELME","text":"Mister Esugen! Mister Esugen! Did you hear the news? There is to be a tournament among the brothers. Ever since we lost to the Mol, morale has been low and the elders thought this would be the perfect way to motivate everyone to train harder."},{"name":"ESUGEN","text":"A-A tournament among the brothers!? &lt;sigh&gt; No doubt I will finish last again and humiliate myself in front of everyone. Bah! As much as I would like to slither my way out of this, upon my honor as an Oroniri man, I cannot."},{"name":"ESUGEN","text":"I must give it my all or risk being forsaken by Father Azim. I shall leave now to go and train at the Steppe."},{"name":"JELME","text":"Are you Mister Esugen's friend? Do you think you could do me a small favor?"},{"name":"JELME","text":"These tournaments are used to determine an Oronir's skill in combat. Every time we have one, Mister Esugen always places last, and because of this, he is often miserable in the days leading up to the match."},{"name":"JELME","text":"I wrote him a letter to cheer him up. Without him, strays like me would starve. I wanted to return the kindness he has shown me throughout the years."},{"name":"JELME","text":"Do you think you could deliver it to him for me? I am far too embarrassed to do it myself."},{"name":"JELME","text":"You should be able to find him quite easily. He never wanders too far from the Dawn Throne to train."},{"name":"ESUGEN","text":"<span class=\"highlight\">Forename</span>...&lt;pant&gt;... What brings you...&lt;pant&gt;...here?"},{"name":"ESUGEN","text":"You come bearing a letter from little Jelme, you say? Well, let us have a look, then."},{"name":"JELME","text":"(-Letter from Jelme-)Dear Mister Esugen,<br>I am writing this letter to thank you. Your delicious food was one of the few things that helped me to overcome the pain of losing my parents."},{"name":"JELME","text":"(-Letter from Jelme-)While you may not be the strongest or the bravest, you are the kindest. I really hope you will do well in the upcoming tournament. Please know that I will be cheering you on the whole way."},{"name":"JELME","text":"(-Letter from Jelme-)P.S. The stew you made last night was scrumptious. I hope you will make it again sometime."},{"name":"ESUGEN","text":"What a touching letter. Jelme─he is a good boy. I shall be making him that stew as soon as I am removed from the competition."},{"name":"ESUGEN","text":"Hahaha! His words have put me in such a fine mood that even thoughts of finishing last cannot get me down. I must go to thank the young boy. Come, let us return to the camp."},{"name":"JELME","text":"Please can you deliver my letter to Mister Esugen for me? He usually trains in the area below the Dawn Throne. He should not be too hard to find."},{"name":"JELME","text":"Thank you for delivering my letter. Mister Esugen looks far less glum, now. Would you not agree?"},{"name":"JELME","text":"Oh, look! There's my brother! Kuzuku! Oi, Kuzuku!"},{"name":"KUZHUK","text":"Jelme, what are you doing here? You need to be training. In a few years you, too, will be required to join the tournaments."},{"name":"KUZHUK","text":"Remember the reason this fool has yet to be accepted as a warrior is because he wasted all his time cooking. Unless you wish to end up a failure like him, I suggest you pick up a spear and begin working on your aim."},{"name":"ESUGEN","text":"&lt;sigh&gt; Sadly, he is right, Jelme. Associating with me will not do you any good. If you wish to become strong, you best follow your brother's advice."},{"name":"JELME","text":"No! I do not care to be strong. Your friendship is far more important to me, but that is beside the point!"},{"name":"JELME","text":"How can you just stand there and smile when people insult you!? Just because you are weak does not mean you should let them treat you like dirt! Argh!"},{"name":"ESUGEN","text":"I think I will keep Jelme's letter. It is perhaps one of the nicest things anyone has ever done for me."},{"name":"ESUGEN","text":"Kuzuku's remarks seemed to have upset Jelme more than they have me. I am so accustomed to being mocked that I have grown a rather thick skin."},{"name":"ESUGEN","text":"&lt;sigh&gt; I should have realized sooner that such comments could also hurt the people close to me..."},{"name":"ESUGEN","text":"While I shall never come to be respected among our brothers for my strength, perhaps I can at least learn to stand up for myself."},{"name":"ESUGEN","text":"In the meantime, I must find a way to undo the pain I have caused Jelme."},{"name":"ESUGEN","text":"I suspect the only way to accomplish that, however, would be to not place last in the upcoming tournament..."}],"reward":{"gil":900,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"questsType":"all","quests":[68046,68319]},"next":[68321]},"partials":[{"type":"npc","id":"1023348","obj":{"i":1023348,"n":"Esugen","l":2411,"q":5}},{"type":"npc","id":"1022131","obj":{"i":1022131,"n":"Jelme","l":2411,"q":2}},{"type":"npc","id":"1023349","obj":{"i":1023349,"n":"Esugen","l":2411,"q":2}},{"type":"quest","id":"68046","obj":{"i":68046,"n":"For Love of the Moon","g":6,"l":"The Azim Steppe","s":680}},{"type":"quest","id":"68319","obj":{"i":68319,"n":"Chasing Rainbows","g":110,"l":"The Azim Steppe","s":6050}},{"type":"quest","id":"68321","obj":{"i":68321,"n":"The Strongest among Us","g":110,"l":"The Azim Steppe","s":6070}}]}