{"quest":{"name":"Brainy Bears","location":"The Azim Steppe","id":68323,"patch":4.0,"sort":6090,"eventIcon":71221,"issuer":1022223,"target":1022223,"genre":110,"journal":["Dagasi fears for the local livestock."],"objectives":["Slay gulo gulo.","Report to Dagasi."],"dialogue":[{"name":"DAGASI","text":"You look like a fine warrior to me, and I am rarely wrong."},{"name":"DAGASI","text":"You may not be a Dotharl, but if you have experience slaying beasts, there is something I would ask of you."},{"name":"DAGASI","text":"A group of creatures has appeared near the village recently. They pose a threat to our sheep. Up until now they had only been sighted much further north."},{"name":"DAGASI","text":"Our tribe is home to many a brave warrior. We fear not death. However, gulo gulo are one of the few beasts that trouble even our finest warriors."},{"name":"DAGASI","text":"That is why I wish to entrust an outsider with this task. I would have you slay four of the creatures. Do not worry, you shall be compensated."},{"name":"DAGASI","text":"Slay four of the creatures. Succeed and you shall be compensated."},{"name":"DAGASI","text":"The deed is done? Good, now our sheep can rest easy."},{"name":"DAGASI","text":"As you may have noticed, the gulo gulo is a wily creature. It lures its attackers into a sense of false security before springing a trap on them. That was how my brother met his end."},{"name":"DAGASI","text":"While they are intelligent, they are still beasts. But one must be careful when attempting to slay them. Many a Dotharl has mistaken recklessness for bravery, losing their lives in the process."},{"name":"DAGASI","text":"I imagine our warriors would benefit from studying someone like you. I shall make sure to teach my brother not to be so foolhardy in his next life."},{"name":"DAGASI","text":"Thank you for your aid. I shall make sure we do not require outside help the next time a gulo gulo appears."}],"reward":{"gil":620,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68048]}},"partials":[{"type":"npc","id":"1022223","obj":{"i":1022223,"n":"Dagasi","l":2411,"q":1}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}}]}