{"quest":{"name":"Nhaama's Sweet Embrace","location":"The Azim Steppe","id":68326,"patch":4.0,"sort":6120,"eventIcon":71221,"issuer":1021495,"target":1019325,"involved":[1021496,1021497,1021498,1021499],"genre":110,"journal":["The Dotharli youth is looking for someone to protect her."],"objectives":["Speak with the Dotharli youth.","Speak with the Dotharli youth and slay any enemies that appear.","Speak with the Dotharli youth.","Speak with the Dotharli youth and slay any enemies that appear.","Speak with the Dotharli youth.","Deliver the letter to Maral."],"dialogue":[{"name":"FANATIC02790","text":"Hello there, traveler. I would appreciate your help, should you have the time."},{"name":"FANATIC02790","text":"However, I would prefer to discuss it somewhere free from prying eyes. Meet me in front of the Dusk Throne."},{"name":"FANATIC02790","text":"Thank you for coming. I wish to go to meet with Nhaama. But the road to her is fraught with peril. As such, I need someone to protect me."},{"name":"FANATIC02790","text":"It was only a few weeks ago that both my mother and father were taken from me by the heartless Oronir."},{"name":"FANATIC02790","text":"Their deaths made me realize that I must commune with the Dusk Mother. I shall pray that she strike down those who pretend they are the children of Azim, and that she continue to nurture the Dotharl."},{"name":"FANATIC02790","text":"Nhaama resides in the House of the Crooked Coin to the north. I have heard many tales recently of pilgrims being slain by the monsters that lie in wait along the trail."},{"name":"FANATIC02790","text":"The same must not happen to me. Please, be on your guard. Rendezvous with me further to the north."},{"name":"FANATIC02790","text":"The Dusk Mother awaits. Let us make haste."},{"name":"FANATIC02790","text":"It seems the tales I heard were true. Dispatch them swiftly!"},{"name":"FANATIC02790","text":"Thank you. Let us resume the climb."},{"name":"FANATIC02790","text":"More beasts. There is no other way to reach Nhaama. We must not falter!"},{"name":"FANATIC02790","text":"We are close now. So very close..."},{"name":"FANATIC02790","text":"Thank you for seeing me here safely. There is one last thing I would request of you."},{"name":"FANATIC02790","text":"Deliver this to a girl in Dotharl Khaa named Maral."},{"name":"FANATIC02790","text":"Now, please leave me to be alone with the Dusk Mother."},{"name":"MARAL","text":"Is there something you wish to say to me?"},{"name":"MARAL","text":"A letter? But, why?"},{"name":"MARAL","text":"So she has gone to be one with the Dusk Mother. I have no doubt it is what she wanted, but that knowledge does naught to alleviate the pain in my heart."},{"name":"MARAL","text":"The House contains a crystal─a sliver of Nhaama's essence. Those who wish to rejoin with the Dusk Mother throw themselves down into the cavern there. This breaks the cycle of reincarnation."},{"name":"MARAL","text":"The Dusk Mother has always been at the center of my friend's life. The same was true of her previous incarnations."},{"name":"MARAL","text":"To think, if she had been killed together with her family, her spirit could have moved into the child my sister is about to birth..."},{"name":"MARAL","text":"Forget what I just said. I did not mean it. We should take solace in the knowledge that she is finally at peace."},{"name":"MARAL","text":"The envelope her letter came in also contained what seems to be your compensation for helping her. Please accept it as a token of her gratitude."}],"reward":{"gil":934,"items":[{"num":3,"id":5668}],"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68048]}},"partials":[{"type":"npc","id":"1021495","obj":{"i":1021495,"n":"Dotharli Youth","l":2411,"q":1}},{"type":"npc","id":"1019325","obj":{"i":1019325,"n":"Maral","l":2411,"q":1}},{"type":"npc","id":"1021496","obj":{"i":1021496,"n":"Dotharli Youth","l":2411,"q":1}},{"type":"npc","id":"1021497","obj":{"i":1021497,"n":"Dotharli Youth","l":2411,"q":1}},{"type":"npc","id":"1021498","obj":{"i":1021498,"n":"Dotharli Youth","l":2411,"q":1}},{"type":"npc","id":"1021499","obj":{"i":1021499,"n":"Dotharli Youth","l":2411,"q":1}},{"type":"item","id":"5668","obj":{"i":5668,"n":"Heavens' Eye Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}}]}