{"quest":{"name":"The Power of the Fist","location":"The Azim Steppe","id":68329,"patch":4.0,"sort":6150,"icon":100707,"eventIcon":71221,"issuer":1023195,"target":1023195,"involved":[1023199,1023201,1023294],"genre":110,"journal":["Khulan is worried about her friend.","Khulan explains to you that the Dotharl khatun is in charge of identifying who newborns were in their past lives. However, even the khatun is not infallible, and Khulan is convinced she incorrectly identified Mauci as the reincarnation of Mauci of the Seven and Seven Swords. Mauci is frustrated by the continuing speculation regarding his identity and asks you accompany him to an area just outside Dotharl Khaa.","Mauci explains there is a hill to the north of the village that he likes to sit upon when he needs to reorganize his thoughts. As he is unarmed, you agree to make the trip with him and keep him safe from harm.","Mauci reaches his destination safe and sound thanks to your aid. You approach the Dotharl boy to lend an ear to his woes.","Mauci remarks that while he is grateful for Khulan's attention, he cannot help but be jealous of his friend and how comparatively simple her life has been. The village's expectations of Mauci have clearly taken their toll on the young Dotharl. He states that he no longer cares if he is able to wield a sword, he just desires the strength required to feel he belongs to his tribe.","As you prepare to return to Dotharl Khaa, you are set upon by a manzasiri. The beast is downed in the blink of an eye by none other than Mauci himself. The young Dotharl is not quite sure how he did it, but it seems he defeated the manzasiri with his bare fists.","Mauci has started to think he may be a much better fighter with his fists than he ever will be with a sword. He mentions that he would like to confirm something and bids you head back to Dotharl Khaa to tell Khulan of his newfound strength. Khulan is initially shocked to see you returned without Mauci, but calms down when she hears of recent developments. Now that it is clear Mauci is skilled in hand-to-hand combat, Khulan is positive that her friend is not who the khatun judged him to be. She asks you to continue to lend her your help, that you might discover the truth behind Mauci's identity."],"objectives":["Speak with Mauci.","Escort Mauci to the lamp on the hill.","Speak with Mauci.","Speak with Khulan."],"dialogue":[{"name":"KHULAN","text":"When a Dotharli child is born, the khatun looks into their eyes to determine who they were in their past life."},{"name":"KHULAN","text":"Rarely is the khatun wrong. However, I can only think she made a mistake with Mauci. Truly, have you seen him hold a blade?"},{"name":"KHULAN","text":"Yet, despite his lack of ability, Mauci himself refuses to give up. He blames himself when it is not his fault."},{"name":"MAUCI","text":"Silence! You cannot understand..."},{"name":"KHULAN","text":"Mauci, I know you are disheartened. You just lost in combat. Put down your sword and relax by taking a well-earned bath."},{"name":"MAUCI","text":"I have a better idea. There is somewhere just outside of the village I would rather visit. <span class=\"highlight\">Forename</span>, would you join me? There is something I wish to discuss."},{"name":"KHULAN","text":"Please speak with him. I do not think he would appreciate my company at the moment."},{"name":"MAUCI","text":"..."},{"name":"MAUCI","text":"Thank you for coming. There is a place to the north I go in order to calm down sometimes. Although, I can hardly make the journey unarmed."},{"name":"MAUCI","text":"Would you accompany me in case any creatures should attack en route? If you are willing, let me know when you are ready to depart."},{"name":"KHULAN","text":"He is right. I cannot truly understand how hard this must be for him. Please accompany Mauci wherever it is he wants to go. No one here will be of much help."},{"name":"MAUCI","text":"You will join me? Excellent. Our destination is that lamp on the hill to the north."},{"name":"SYSTEM","text":"Escort Mauci safely to the lamp on the hill. Should you fail to defend him, or move too far away, he will return to Dotharl Khaa, where you may rendezvous with him before trying again."},{"name":"BALLOON","text":"I feel so light without my sword."},{"name":"BALLOON","text":"<span class=\"highlight\">Forename</span>..."},{"name":"SYSTEM","text":"You have failed to successfully escort Mauci to the lamp. Return to Dotharl Khaa and speak with Mauci to begin once more."},{"name":"SYSTEM","text":"You have lost sight of Mauci. Retrace your steps to find them, then escort them safely to the lamp."},{"name":"MAUCI","text":"(-Mauci-)Thank you, <span class=\"highlight\">Forename</span>."},{"name":"MAUCI","text":"Quite a view, wouldn't you agree? Ah, I feel calmer already."},{"name":"MAUCI","text":"I appreciate that Khulan is worried about me, but she will never know what my life is like. I know it is not fair to harbor feelings of jealousy towards her, though I cannot help it─she has had no trouble living up to her name."},{"name":"MAUCI","text":"I wish I could just throw down my blasted sword. Walk away from it all. But I feel the weight of the village's expectations on my shoulders every single day."},{"name":"MAUCI","text":"I do not care about improving my swordsmanship. I only desire strength. The kind of strength that would make me a worthy member of the Dotharl tribe."},{"name":"MAUCI","text":"Ah, I have done nothing but complain since we arrived here. My apologies, <span class=\"highlight\">Forename</span>. It is time I resumed my training. I shall meet you at the bottom of the hill."},{"name":"MAUCI","text":"Look out!"},{"name":"MAUCI","text":"I-I do not know what just happened. I think I defeated the beast with...my fists."},{"name":"MAUCI","text":"Perhaps I was wasting my time training with a blade? It seems hand-to-hand combat is a better match for me."},{"name":"MAUCI","text":"Please go on ahead back to the village, <span class=\"highlight\">Forename</span>. I wish to confirm something on my own."},{"name":"MAUCI","text":"Oh, and tell Khulan I may have found a solution to my problems. I hope that puts her mind at ease."},{"name":"KHULAN","text":"Where is Mauci? Did something happen to him? Surely you did not leave him unarmed in the desert!?"},{"name":"KHULAN","text":"He bested a manzasiri with his bare fists, you say? Well, that is quite something."},{"name":"KHULAN","text":"It also makes me even more inclined to think he has been named incorrectly."},{"name":"KHULAN","text":"Please, <span class=\"highlight\">Forename</span>, help me look into this. We need to find out Mauci's true identity, for his own sake."}],"reward":{"gil":900,"items":[{"num":3,"id":5718}],"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"questsType":"all","quests":[68048,68328]},"next":[68330]},"partials":[{"type":"npc","id":"1023195","obj":{"i":1023195,"n":"Khulan","l":2411,"q":2}},{"type":"npc","id":"1023199","obj":{"i":1023199,"n":"Mauci","l":2411,"q":1}},{"type":"npc","id":"1023201","obj":{"i":1023201,"n":"Mauci","l":2411,"q":1}},{"type":"npc","id":"1023294","obj":{"i":1023294,"n":"Mauci","l":2411,"q":1}},{"type":"item","id":"5718","obj":{"i":5718,"n":"Quickarm Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Skill Speed","category":0}}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}},{"type":"quest","id":"68328","obj":{"i":68328,"n":"Watch and Learn","g":110,"l":"The Azim Steppe","s":6140}},{"type":"quest","id":"68330","obj":{"i":68330,"n":"Do or Die","g":110,"l":"The Azim Steppe","s":6160}}]}