{"quest":{"name":"Watch and Learn","location":"The Azim Steppe","id":68328,"patch":4.0,"sort":6140,"icon":100707,"eventIcon":71221,"issuer":1023193,"target":1023193,"involved":[1023194],"genre":110,"journal":["Mauci is keen to study your technique.","Mauci has decided the best way to improve his own abilities is to study how you fight. He gathers some fatty meat from the village in the hopes of attracting a few Nhaama analas for you to slay. It does not take long for the creatures to approach and you promptly ready yourself for combat.","You make short work of the Nhaama analas, clearly impressing Mauci.","The young Dotharl learned plenty from watching you fight. He mentions that the village is hosting a practice tourney and that he will attempt to make use of what he has seen in it. You make your way back to Dotharl Khaa to monitor the boy's progress.","Sadly Mauci is defeated rather easily by his opponent. He hopes this will go some way to convincing the villagers that he is not and never will be skilled with a blade, but everyone remains steadfast in their belief that he is of the Seven and Seven Swords. Another young Dotharl named Khulan decides she has had enough of the crowd's comments, admonishing them on Mauci's behalf. Khulan introduces herself as an old friend of Mauci's, asking if you would be willing to help her improve Mauci's current situation."],"objectives":["Speak with Mauci and slay the Nhaama analas.","Speak with Mauci."],"dialogue":[{"name":"MAUCI","text":"You will help me after all? Fantastic! Would you mind telling me your name?"},{"name":"MAUCI","text":"<span class=\"highlight\">Forename</span>, you say? A fine name indeed. I would like to observe you fighting, so that I may learn what it is I am doing wrong."},{"name":"MAUCI","text":"I shall find some Nhaama analas and study how you do battle with them."},{"name":"MAUCI","text":"I took some of the fatty meat we usually feed to cattle and spread it around this area. The Nhaama analas will be here shortly─they cannot resist anything that burns as easily as fat. Here they are!"},{"name":"MAUCI","text":"<span class=\"highlight\">Forename</span>, watch out! They're here!"},{"name":"MAUCI","text":"Your style differs from what I am used to. But it is by no means unnatural. Thank you, <span class=\"highlight\">Forename</span>, you have given me much to think about."},{"name":"MAUCI","text":"I shall try and make use of what you have shown me in our practice tourney. It will be starting shortly. It has been quite a while since I took part!"},{"name":"MAUCI","text":"Ugh, well, as you no doubt saw that did not go to plan. Surely no one will believe I am a legendary swordsman now."},{"name":"DOTHARLAUDIENCEA02792","text":"(-Spectator-)I do not understand. How could Mauci of the Seven and Seven Swords be bested so easily?"},{"name":"DOTHARLAUDIENCEB02792","text":"(-Spectator-)Wait, no, I see now! He merely pretended to lose to lure his opponent into a false sense of security."},{"name":"DOTHARLAUDIENCEC02792","text":"(-Dotharli Warrior-)Do not hold back. You insult me!"},{"name":"KHULAN","text":"What do any of you know about Mauci!? He is weak. Simply forcing him to fight will change nothing."},{"name":"KHULAN","text":"Are you an acquaintance of Mauci's? I am Khulan. I have been friends with Mauci ever since we were little─I know him better than most."},{"name":"KHULAN","text":"You have doubtless heard all about how weak he is. However, I want to change his life for the better. Would you be willing to help me?"}],"reward":{"gil":800,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"questsType":"all","quests":[68048,68327]},"next":[68329]},"partials":[{"type":"npc","id":"1023193","obj":{"i":1023193,"n":"Mauci","l":2411,"q":2}},{"type":"npc","id":"1023194","obj":{"i":1023194,"n":"Mauci","l":2411,"q":1}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}},{"type":"quest","id":"68327","obj":{"i":68327,"n":"Mauci of the Seven Worries","g":110,"l":"The Azim Steppe","s":6130,"f":1}},{"type":"quest","id":"68329","obj":{"i":68329,"n":"The Power of the Fist","g":110,"l":"The Azim Steppe","s":6150}}]}