{"quest":{"name":"The Strongest among Us","location":"The Azim Steppe","id":68321,"patch":4.0,"sort":6070,"icon":100706,"eventIcon":71221,"issuer":1023348,"target":1023348,"involved":[1022131,1023352],"genre":110,"journal":["Esugen wants to smooth things over with Jelme.","Esugen asks you to deliver boortsog─a delicious fried sweet─to Jelme as an apology for what occurred earlier. While he intends to also later seek the boy's forgiveness in person, he must first see to preparations for the main banquet, which is to take place after the tournament.","Jelme accepts the gift and tells you that he has long forgiven Esugen. At the moment he has a far more pressing matter on his mind: Kuzuku has fallen ill. The tournament is just around the corner and he worries for his brother's health and status. Asking that you thank Esugen on his behalf, he then scurries off to tend to Kuzuku.","Esugen learns from you that Kuzuku, who is to be his first opponent in the upcoming tournament, has taken ill. While initially tempted to take advantage of the situation, the elderly culinarian eventually decides against it for fear of hurting Jelme. Instead, he vows to help speed along Kuzuku's recovery by making him a medicinal stew. Promising this will be the last thing he asks of you, he hands you a sheep bone for bait and requests that you procure some circling bi fang breast meat.","As per Esugen's instructions, you place the sheep bone upon a boulder to the east of the Dawn Throne. Now all that is left for you to do is lie in wait and pounce upon the circling bi fang that appears.","You successfully slay the bi fang that swooped in from the skies. Esugen will no doubt be pleased by the beautiful cuts of breast meat you have obtained.","Upon receiving the meat, Esugen immediately sets to work and soon a pungent smell fills the air. Handing the potent herbal stew off to Jelme, he tells the young boy to go and feed it to Kuzuku while it is still hot. The young boy thanks the culinarian and rushes off to do just that.","Esugen tells you that even though he knows he will place last in the upcoming tournament, he is happy he decided to help Kuzuku. He goes on to say that your and Jelme's friendships mean a great deal to him and is what allowed him to realize his talents and revive his passion for cooking. Handing you some food he made specially for you, he sends you off with a smile."],"objectives":["Deliver the boortsog to Jelme.","Report to Esugen.","Place the sheep bone at the destination.","Lie in wait for circling bi fang and slay any that appear for their breast meat.","Deliver the cut of circling bi fang breast meat to Esugen.","Speak with Esugen."],"dialogue":[{"name":"ESUGEN","text":"Argh! I dearly wish to set things right with Jelme, but between training and preparing for the after-tournament banquet, I have not a moment to spare!"},{"name":"ESUGEN","text":"I was hoping, however, that you might. Do you think you could deliver this to the boy for me?"},{"name":"ESUGEN","text":"What you are holding is boortsog─one of his favorite treats. It is sweet, soft, and savory."},{"name":"ESUGEN","text":"I know, I know. It is not the ideal way to apologize, but worry not! Once I finish all my tasks, I intend to go and say sorry to him in person."},{"name":"JELME","text":"Hello, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span>. What brings you here?"},{"name":"JELME","text":"Boortsog? It was incredibly kind of Mister Esugen to make this for me, but I am not in the mood for sweets right now."},{"name":"JELME","text":"You see, Kuzuku has fallen ill. He is running a fever and has grown so weak he can barely walk. If he does not recover soon, he will not stand a chance in the upcoming competition."},{"name":"JELME","text":"&lt;sigh&gt; My brother needs me so I must return now. Please tell Mister Esugen thank you for the sweets and that I am not angry at him anymore."},{"name":"ESUGEN","text":"Please see that the boortsog makes it to Jelme. In the meantime, I shall begin readying the menu for the banquet."},{"name":"ESUGEN","text":"Ah, <span class=\"highlight\">Forename</span>, how is Jelme doing? Is he feeling better?"},{"name":"ESUGEN","text":"What!? Kuzuku is ill? But he is to be my first opponent in the upcoming tournament!"},{"name":"ESUGEN","text":"Wait a minute... This is perfect! If he is too feeble to freely move about that means even <span class=\"emphasis\">I</span>, the weakest Oronir, might have a chance at defeating him! "},{"name":"ESUGEN","text":"Mayhap this is the work of Father Azim himself─a reward for the years of ridicule from Kuzuku that I was forced to endure! If that is the case, it would be wrong of me <span class=\"emphasis\">not</span> to take advantage of this opportunity. ...Right?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I think Jelme would be sad to hear that."},{"name":"A1","text":"I doubt Father Azim played any part in this."},{"name":"A1","text":"Yes, this is your chance! Embrace it with open arms."},{"name":"ESUGEN","text":"You are right. There is little glory to be had in defeating a defenseless man and hurting a friend in the process."},{"name":"ESUGEN","text":"&lt;sigh&gt; You are right. It is shameful of me to even have thought that. Our Father would never condone such selfish actions."},{"name":"ESUGEN","text":"Your words say one thing but your eyes and lips say another. &lt;sigh&gt; Upon further consideration, perhaps it was wrong of me to think such thoughts. There is little glory to be had in winning against a defenseless opponent."},{"name":"ESUGEN","text":"...I am sorry you had to see that. I do not know what got into me. For everyone's sake, it would probably be best if I blocked out all thoughts of the tournament from my mind and instead focused on helping the one person who has stood beside me this entire time─Jelme."},{"name":"ESUGEN","text":"Aha! An idea comes to me! Perhaps I can make Kuzuku something to combat his fever and speed along his recovery. That is certain to put a smile on the young boy's face!"},{"name":"ESUGEN","text":"In fact, I have the perfect food in mind─a soup of Yanxian origin made with medicinal herbs and circling bi fang meat."},{"name":"ESUGEN","text":"I would, however, first need to procure all the necessary ingredients. <span class=\"highlight\">Forename</span>, I swear upon our Father's name that this shall be the last request I make of you. Please, could you hunt down a bi fang and bring a slab of its breast meat back to me?"},{"name":"ESUGEN","text":"Thank you! These winged creatures have a fondness for sheep bones. Here─take this. If you lay it out on one of the boulders to the east, it will not be long until one of them swoops down from the skies. When it does, you simply pounce upon it."},{"name":"ESUGEN","text":"While you take care of the meat, I shall go and gather the herbs. Let us meet back here when we are finished."},{"name":"ESUGEN","text":"Simply place the sheep bone on top of a boulder to the east and soon a circling bi fang will come swooping down from the skies."},{"name":"ESUGEN","text":"So, how did the hunt go, my friend?"},{"name":"ESUGEN","text":"Haha! That is it! This is exactly what I needed. Now that I have everything, I might finally begin making the stew!"},{"name":"JELME","text":"Why is Mister Esugen still cooking? We just ate <span class=\"alternative-container\"><span class=\"alternative\">dinner</span><span class=\"alternative\">breakfast</span><span class=\"alternative\">lunch</span></span>."},{"name":"JELME","text":"He is making something for my brother, you say!? But Kuzuku is his first opponent in the tournament!"},{"name":"JELME","text":"If he recovers in time for the match, Mister Esugen will surely lose again. ...That means he will remain a culinarian forever and everyone will continue to make fun of him!"},{"name":"ESUGEN","text":"Haha! Do you smell that? The circling bi fang stew is ready! It has been prepared with eight strong medicinal herbs. While rather pungent, it should be extremely effective!"},{"name":"ESUGEN","text":"Jelme, you must deliver this to your brother and make him eat it before it goes cold."},{"name":"JELME","text":"Thank you, Mister Esugen! I shall do that straightaway and will also be sure to tell him that you made it."},{"name":"ESUGEN","text":"And so he goes...taking my dreams of victory with him. Kuzuku is one of our strongest warriors. He always lands a spot in the top. One swift strike is all it will take for him to knock me out of the running. Hahaha!"},{"name":"ESUGEN","text":"Ah, and before you ask─I am not laughing to mask my pain. The idea of me being eliminated from the tournament in a matter of seconds simply strikes me as funny."},{"name":"ESUGEN","text":"Truth be told, I have not felt this good in a long time. I am glad I helped Kuzuku. Not only am I proud of myself for doing the right thing, but this little incident has also allowed me to rediscover my passion for cooking."},{"name":"ESUGEN","text":"While I shall never be a warrior and people will continue to occasionally poke fun at me, I am quite satisfied with the hand fate has dealt me. There is no greater joy than cooking for me. "},{"name":"ESUGEN","text":"In addition to that, I have been blessed with two truly wonderful friends. You and Jelme have brought me much happiness, and it is only because of you that I was able to embrace my shortcomings and realize my strengths."},{"name":"ESUGEN","text":"Here. I have made a little something for you. Though it is nothing fancy, I am sure you will enjoy it. It has, after all, been tested on and approved by the entire tribe!"},{"name":"ESUGEN","text":"Now, I am sure you are eager to set out upon your next great adventure, so I will not keep you any longer. Farewell, <span class=\"highlight\">Forename</span>, and remember to come and visit your old friend Esugen from time to time!"},{"name":"JELME","text":"Mister Esugen always looks happiest when he is cooking. I wonder why that is..."}],"reward":{"gil":1000,"items":[{"id":19830}],"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"questsType":"all","quests":[68046,68320]},"next":[68331]},"partials":[{"type":"npc","id":"1023348","obj":{"i":1023348,"n":"Esugen","l":2411,"q":5}},{"type":"npc","id":"1022131","obj":{"i":1022131,"n":"Jelme","l":2411,"q":2}},{"type":"npc","id":"1023352","obj":{"i":1023352,"n":"Jelme","l":2411,"q":1}},{"type":"item","id":"19830","obj":{"i":19830,"n":"Jhammel Moussaka","l":290,"c":24112,"t":46}},{"type":"quest","id":"68046","obj":{"i":68046,"n":"For Love of the Moon","g":6,"l":"The Azim Steppe","s":680}},{"type":"quest","id":"68320","obj":{"i":68320,"n":"The Tournament","g":110,"l":"The Azim Steppe","s":6060}},{"type":"quest","id":"68331","obj":{"i":68331,"n":"Hungry Like the Wolf","g":110,"l":"The Azim Steppe","s":6170}}]}