{"quest":{"name":"Mauci of the Seven Worries","location":"The Azim Steppe","id":68327,"patch":4.0,"sort":6130,"icon":100707,"unlocksFunction":1,"eventIcon":71341,"issuer":1023193,"target":1023193,"involved":[1019321,1022222,1022228],"genre":110,"journal":["Mauci is haunted by his past.","A young Dotharl named Mauci approaches you regarding his past. Despite being constantly told he is Mauci of the Seven and Seven Swords reincarnate, he cannot shake the feeling that he has no connection to the master swordsman. You agree to help him by asking the residents of Dotharl Khaa if Mauci is truly who everyone says he is.","You question a few of the locals and are told time and time again that Mauci most certainly is the reincarnation of his namesake. No other Dotharl were born the year the previous Mauci passed, and his poor swordsmanship is not enough to convince anyone that they could be wrong.","Mauci still seems unconvinced that he has been accurately named, but resolves to continue his sword training regardless. You agree to lend him your aid in the hope that it will lead to him improving as a swordsman."],"objectives":["Gather information in Dotharl Khaa.","Report to Mauci."],"dialogue":[{"name":"MAUCI","text":"It is not often we have travelers in Dotharl Khaa. There is something I would ask of you. If you have the time."},{"name":"MAUCI","text":"My name is Mauci of the Seven and Seven Swords. I am a reincarnation of a master swordsman."},{"name":"MAUCI","text":"They say he was so fast with a sword it was as if he wielded seven blades. Indeed, he was well respected."},{"name":"MAUCI","text":"However, I struggle to believe I am he. No matter how much I practice, my swordsmanship improves not."},{"name":"MAUCI","text":"I would like you to ask around the village. Find out if I truly am who they say. If there is a secret concerning my previous life, they will not tell me, no matter how much I ask."},{"name":"MERGEN","text":"What are you saying? Of course his name is correct! He may be clumsy with a blade at the moment, but he will improve in time."},{"name":"MERGEN","text":"I hear that the previous Mauci also struggled when he first picked up a sword. All he needs do is train."},{"name":"KISHILIGH","text":"You do not believe Mauci to be the reincarnation of a swordsman? Nonsense! There were no other Dotharl born the year Mauci passed."},{"name":"KISHILIGH","text":"The previous Mauci of the Seven and Seven Swords was a true warrior. His swordsmanship was unmatched. I cannot believe he would not be reincarnated."},{"name":"AGUJAM","text":"That Mauci. He always happens to run off somewhere when I try to help him with his training. He does his name a disservice."},{"name":"MAUCI","text":"Please ask around the village. Find out if I truly am who they say."},{"name":"MERGEN","text":"No Dotharl has ever been able to wield a blade from birth. It is learned. Mauci merely needs to continue to train."},{"name":"KISHILIGH","text":"Where did you hear that ridiculous rumor?"},{"name":"AGUJAM","text":"It is time Mauci realized he will have to work to live up to his name."},{"name":"MAUCI","text":"Were you able to learn aught?"},{"name":"MAUCI","text":"I see. I am exactly as they say. My thanks for your help."},{"name":"MAUCI","text":"You look like you could hold your own in battle. How did you grow so strong?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I grew strong during my adventures."},{"name":"A1","text":"I had a teacher."},{"name":"MAUCI","text":"Yes, I suppose I am lacking in experience. I cannot leave the village, but I <span class=\"emphasis\">can</span> learn from you."},{"name":"MAUCI","text":"Behind every strong warrior there is an equally strong teacher. No doubt I too would benefit from some guidance. Training alone is only so effective."},{"name":"MAUCI","text":"Could I ask you to teach me? I can think of no better way to make myself stronger. You need not answer right away."}],"reward":{"gil":800,"aetherCurrent":1,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68048]},"next":[68328]},"partials":[{"type":"npc","id":"1023193","obj":{"i":1023193,"n":"Mauci","l":2411,"q":2}},{"type":"npc","id":"1019321","obj":{"i":1019321,"n":"Mergen","l":2411,"q":2}},{"type":"npc","id":"1022222","obj":{"i":1022222,"n":"Kishiligh","l":2411,"q":3}},{"type":"npc","id":"1022228","obj":{"i":1022228,"n":"Agujam","l":2411,"q":3}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}},{"type":"quest","id":"68328","obj":{"i":68328,"n":"Watch and Learn","g":110,"l":"The Azim Steppe","s":6140}}]}