{"quest":{"name":"Spelunker of Light","location":"The Azim Steppe","id":68335,"patch":4.0,"sort":6210,"eventIcon":71221,"issuer":1023315,"target":1023317,"involved":[1022228,1023316],"genre":110,"journal":["This Uyagiri youth needs your help collecting something."],"objectives":["Speak with the Uyagiri youth.","Obtain a sack of arrowheads.","Deliver the sack of arrowheads to the Uyagiri youth.","Speak with the Uyagiri youth."],"dialogue":[{"name":"UYAGIR02799","text":"Could you spare me a moment of your time? I require your help."},{"name":"UYAGIR02799","text":"Meet me by the Uyagir Caves if you are willing. I shall tell you precisely what I want you to do there."},{"name":"UYAGIR02799","text":"Thank you for coming."},{"name":"UYAGIR02799","text":"There are several arrowheads in these caves that I wish to trade with the Dotharl."},{"name":"UYAGIR02799","text":"Normally I would collect them myself, but the caves are infested with Matanga. I asked for your aid as you look like quite a warrior. I do hope my judgment was not incorrect. Good luck!"},{"name":"UYAGIR02799","text":"Please bring the sack of arrowheads in there to me. Make sure you have your wits about you─the place is swarming with Matanga."},{"name":"UYAGIR02799","text":"Were you able to find the sack?"},{"name":"UYAGIR02799","text":"Yes, this should be more than enough to get what I require. You have my thanks."},{"name":"UYAGIR02799","text":"Once upon a time our tribe used to call these caves home. They provided us with high-quality minerals, which we turned into arrowheads and spearheads. We would then sell those on to our fellow tribes."},{"name":"UYAGIR02799","text":"However, the gods took issue with our actions. They sent Matanga to infest the cave and drove us out. They doubtless thought we were producing an excessive number of weapon parts."},{"name":"UYAGIR02799","text":"After that we decided to only gather enough minerals to feed ourselves."},{"name":"UYAGIR02799","text":"We no longer craft the arrowheads I require for this trade. As such, I had no choice but to collect them from these caves."},{"name":"UYAGIR02799","text":"Speaking of which, could you accompany me as far as Dotharl Khaa? I shall pay you for your work as soon as I have traded the arrowheads."},{"name":"UYAGIR02799","text":"Ah, adventurer. I just finished trading the arrowheads. I now have enough food to last me for the next month or so."},{"name":"UYAGIR02799","text":"Thank you once again. May the gods continue to smile upon you."},{"name":"AGUJAM","text":"These arrowheads are sharp enough to pierce even the thickest of matamata hides. I could scarce believe my ears when I heard there were still a few left in those caves."}],"reward":{"gil":725,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"questsType":"all","quests":[68332,68333]}},"partials":[{"type":"npc","id":"1023315","obj":{"i":1023315,"n":"Uyagiri Youth","l":2411,"q":1}},{"type":"npc","id":"1023317","obj":{"i":1023317,"n":"Uyagiri Youth","l":2411,"q":1}},{"type":"npc","id":"1022228","obj":{"i":1022228,"n":"Agujam","l":2411,"q":3}},{"type":"npc","id":"1023316","obj":{"i":1023316,"n":"Uyagiri Youth","l":2411,"q":1}},{"type":"quest","id":"68332","obj":{"i":68332,"n":"Ibakha Dreams of Birds","g":110,"l":"The Azim Steppe","s":6180}},{"type":"quest","id":"68333","obj":{"i":68333,"n":"The Melody of Ceol Aen","g":110,"l":"The Azim Steppe","s":6190}}]}