{"quest":{"name":"The Melody of Ceol Aen","location":"The Azim Steppe","id":68333,"patch":4.0,"sort":6190,"eventIcon":71221,"issuer":1019327,"target":1019327,"genre":110,"journal":["Caalun has a tradition she would like to pass on to her son."],"objectives":["Slay baras and obtain their tusks.","Deliver the baras tusks to Caalun."],"dialogue":[{"name":"CAALUN","text":"Are you perchance familiar with the Melody of Ceol Aen? Our ancestors, those who lived before the gods punished us, adored music."},{"name":"CAALUN","text":"In order to pass on their favorite melody to future generations, they bored holes in the rocks that covered the plains of Ceol Aen. Though time has not been kind. The rocks have been so heavily weathered that one can no longer hear anything other than wind in the area."},{"name":"CAALUN","text":"However, that is not to say it is completely lost. The tune is still passed down from parent to child. It is about time that I too did the same, but I recently broke my flute."},{"name":"CAALUN","text":"At first I thought of crafting a new one, but that would be far too greedy of me. If I only had two baras tusks..."},{"name":"CAALUN","text":"Oh, at this rate I will not be able to pass on the melody to my boy."},{"name":"CAALUN","text":"If I only had two baras tusks... Oh, at this rate I will not be able to pass on the melody to my boy."},{"name":"CAALUN","text":"Oh, hello again. I am still at a loss as to how I can obtain two baras tusks."},{"name":"CAALUN","text":"Did you bring these for me?"},{"name":"CAALUN","text":"Thank you so much. You are truly too kind. Now I can make sure the melody is passed down to my dearest child."},{"name":"CAALUN","text":"Please return in a few summers' time when my son has grown as high as a horse's knee."},{"name":"CAALUN","text":"I am certain he will want to repay you for this favor. Perhaps he will even play you a rendition of the melody!"}],"reward":{"gil":620,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"questsType":"all","quests":[68048,68322]},"next":[68335]},"partials":[{"type":"npc","id":"1019327","obj":{"i":1019327,"n":"Caalun","l":2411,"q":1}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}},{"type":"quest","id":"68322","obj":{"i":68322,"n":"Welcome to the Family","g":110,"l":"The Azim Steppe","s":6080}},{"type":"quest","id":"68335","obj":{"i":68335,"n":"Spelunker of Light","g":110,"l":"The Azim Steppe","s":6210}}]}