{"quest":{"name":"Do or Die","location":"The Azim Steppe","id":68330,"patch":4.0,"sort":6160,"icon":100707,"eventIcon":71221,"issuer":1023195,"target":1023211,"involved":[1019328,1023202,1023203,1023204,1023205,1023207],"genre":110,"journal":["Khulan has a point to prove.","Khulan declares that the time has come to prove once and for all that Mauci is not, and never was, a master swordsman. She bids you head to a cave to the west known as the Hundred–and–one Revelations to meet an Uyagiri udgan. While you make your way there, Khulan says she shall find Mauci and bring him along shortly.","You come face–to–face with the udgan known as Ibakha. She instantly realizes that it is not you with whom she has business, beckoning Mauci to join you in the cave. Ibakha is ultimately unable to tell Mauci anything of his past life, but advises him to accept the present for only it, and not history, will lead to his future.","Mauci, even more convinced his name is an ill fit, decides to tell the villagers that he is going to abandon training with a sword in favor of honing his hand-to-hand combat skills. Khulan suggests that Mauci slay a Matanga and bring back some of its fangs as proof of his newfound strength. You head with Mauci to the north in search of the creature.","Mauci asks you to keep any other creatures that appear at bay while he dispatches the Matanga. You keep watch for beasts while Mauci goes to lock horns with the creature.","There are initially no signs of any other beasts, but you choose to continue to keep watch just in case.","As expected, several beasts eventually appear and you make short work of them. Noticing that Mauci has successfully vanquished his foe as well, you head over to speak with him.","Mauci bids you return to the village without him as he still needs to collect a few of his foe's fangs. He also asks that you inform Khulan of his success, lest his friend be left worrying.","Khulan requests that the villagers all gather to listen to a message Mauci wishes to deliver to them. The troubled Dotharli boy declares to the crowd that he is not Mauci of the Seven and Seven Swords and will never again take up a blade. However, Mergen laughs this off, stating that not all the previous Maucis were skilled swordsmen. This leaves Mauci somewhat deflated as he realizes all his turmoil up until now had been for naught.","Mauci wishes he had been told sooner of his various past selves, but is relieved that his struggle is over at last. He thanks both you and Khulan for your help, Khulan remarking that she is glad her friend can remain in Dotharl Khaa."],"objectives":["Speak with Ibakha.","Speak with Mauci.","Keep watch for enemies at the designated location.","Speak with Mauci.","Speak with Khulan.","Speak with Mauci."],"dialogue":[{"name":"KHULAN","text":"It is time to prove that Mauci is not, and never was, a master swordsman. We will need to get our hands on some concrete evidence."},{"name":"KHULAN","text":"I know of an Uyagiri udgan who is said to know all that ever was and shall ever be. Let us ask her about Mauci."},{"name":"KHULAN","text":"Head to a cave to the west known as the Hundred–and–one Revelations. That is where the udgan dwells. I shall fetch Mauci and bring him there."},{"name":"IBAKHA","text":"Come closer, weary traveler. You have done well to find me. Though, it is not you with whom I need speak."},{"name":"KHULAN","text":"Ah, <span class=\"highlight\">Forename</span>, good to see you made it here with no problems. Have you spoken with the udgan?"},{"name":"MAUCI","text":"I must admit, I am impressed she knew it was I and not <span class=\"highlight\">Forename</span> that required her guidance."},{"name":"IBAKHA","text":"I am also aware of exactly what troubles you, child of the Dotharl. Tell me what you wish to know."},{"name":"MAUCI","text":"Am I truly Mauci of the Seven and Seven Swords reincarnate?"},{"name":"IBAKHA","text":"That...I do not know."},{"name":"IBAKHA","text":"Uyagiri udgan have never professed to know the past, only the future. I cannot see your previous life, but I <span class=\"emphasis\">can</span> tell you that you shall become a great warrior someday."},{"name":"IBAKHA","text":"If that is all you wish to know then you may take your leave. I need no thanks. Focus your sights on the present, as it will lead to your future; you need not dwell in the past."},{"name":"MAUCI","text":"Focus my sights on the present... I suppose I ought to let the villagers know once and for all that I am not Mauci of the Seven and Seven Swords."},{"name":"MAUCI","text":"I would rather be banished from the village for denying the khatun's judgment than continue to live this lie."},{"name":"MAUCI","text":"My fists are the best weapon available to me. This I realized after we parted ways in the desert. I shall train with a blade no longer."},{"name":"KHULAN","text":"If your mind is made up, then you should show your newfound strength to the villagers. Prove that you have no need of a sword."},{"name":"KHULAN","text":"Go to the north and do battle with a Matanga. Slay it in hand-to-hand combat and bring back its fangs as proof of your victory. Do this and even the khatun will be forced to accept the truth."},{"name":"MAUCI","text":"Thank you for all your help, Khulan. I shall do just that."},{"name":"MAUCI","text":"<span class=\"highlight\">Forename</span>, please accompany me. I require a witness."},{"name":"KHULAN","text":"I have not seen Mauci this enthusiastic in a long time. I eagerly await your triumphant return."},{"name":"KHULAN","text":"Long, long ago the Uyagir were a tribe ruled by their gluttony. However, they eventually realized the error of their ways, choosing to meditate in caves like this one."},{"name":"IBAKHA","text":"I do not control the young one's destiny. It is up to him which path he chooses."},{"name":"MAUCI","text":"Thank you for coming. I shall slay the beast shortly. Please make sure nothing gets in my way."},{"name":"MAUCI","text":"Other creatures may be drawn here by the fighting. Make sure to take care of them."},{"name":"SYSTEM","text":"The area appears to be free of foes."},{"name":"MAUCI","text":"(-Mauci-)<span class=\"highlight\">Forename</span>, I have triumphed!"},{"name":"MAUCI","text":"I bested it with my fists alone. Your help was key. For that, you have my thanks."},{"name":"MAUCI","text":"You may return to the village first. I still need to extract some of the beast's fangs. Do make sure to tell Khulan of my success!"},{"name":"KHULAN","text":"It is good to know all went well."},{"name":"KHULAN","text":"I have requested that the villagers gather as Mauci has something to share with them. Sadly, not all of them responded to my call."},{"name":"KHULAN","text":"It will truly be a shame if Mauci is banished from the village. But it is preferable to him continuing to struggle."},{"name":"MAUCI","text":"Thank you all for coming today! I have something important to share."},{"name":"MAUCI","text":"I...I am <span class=\"emphasis\">not</span> Mauci of the Seven and Seven Swords!"},{"name":"MAUCI","text":"I have awoken to my true path. My skills lie in hand-to-hand combat. Never again shall I wield a sword! Here are the fangs of a Matanga that I bested with my bare hands."},{"name":"MAUCI","text":"I have also slain a manzasiri by Nhaama's Retreat. <span class=\"highlight\">Forename</span>, the traveler amongst you, bore witness to both these duels!"},{"name":"MAUCI","text":"It is not my wish to deny the khatun. But I have no choice. Banish me if you must, for there is no other path left to me."},{"name":"DOTHARLAUDIENCE02792","text":"(-Dotharli Chap-)To think you beat a Matanga with just your fists. That's our Mauci!"},{"name":"MERGEN","text":"Did no one think to tell you? The previous Maucis fought with a range of different weapons."},{"name":"MERGEN","text":"The last one may have been skilled with a sword, but the Mauci before him was a master of the bow. It is no surprise you find your skills lie elsewhere. You will, however, need a new name. Perhaps Mauci of the Seven and Seven Fists would be adequate?"},{"name":"MAUCI","text":"In short, my worrying has been for naught?"},{"name":"MAUCI","text":"You may return to the village first. I still need to extract a few of the beast's fangs. Do make sure to tell Khulan of my success!"},{"name":"MAUCI","text":"It is a relief that I get to keep my name, but I struggle to be truly happy. Why did no one tell me of the other Maucis sooner?"},{"name":"KHULAN","text":"This is doubtless what the udgan meant. Focus your sights on the present. I am just glad you can continue living here!"},{"name":"MAUCI","text":"Khulan, and <span class=\"highlight\">Forename</span>, I am truly sorry for wasting your time. However, I must also thank you. You two have helped guide me to this new path I must now walk."},{"name":"MAUCI","text":"I shall train like never before. It is up to me to do this new name justice."},{"name":"KHULAN","text":"Thank you, <span class=\"highlight\">Forename</span>. It delights me to know Mauci can remain in Dotharl Khaa."}],"reward":{"gil":1000,"items":[{"id":18564,"one":1,"hq":1},{"id":18565,"one":1,"hq":1},{"id":18566,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"questsType":"all","quests":[68048,68329]}},"partials":[{"type":"npc","id":"1023195","obj":{"i":1023195,"n":"Khulan","l":2411,"q":2}},{"type":"npc","id":"1023211","obj":{"i":1023211,"n":"Mauci","l":2411,"q":2}},{"type":"npc","id":"1019328","obj":{"i":1019328,"n":"Ibakha","l":2411,"q":2}},{"type":"npc","id":"1023202","obj":{"i":1023202,"n":"Mauci","l":2411,"q":1}},{"type":"npc","id":"1023203","obj":{"i":1023203,"n":"Khulan","l":2411,"q":1}},{"type":"npc","id":"1023204","obj":{"i":1023204,"n":"Mauci","l":2411,"q":1}},{"type":"npc","id":"1023205","obj":{"i":1023205,"n":"Mauci","l":2411,"q":1}},{"type":"npc","id":"1023207","obj":{"i":1023207,"n":"Khulan","l":2411,"q":1}},{"type":"item","id":"18564","obj":{"i":18564,"n":"Azurite Choker of Fending","l":279,"c":54972,"t":40,"p":16395}},{"type":"item","id":"18565","obj":{"i":18565,"n":"Azurite Choker of Slaying","l":279,"c":54972,"t":40,"p":16395}},{"type":"item","id":"18566","obj":{"i":18566,"n":"Azurite Choker of Aiming","l":279,"c":54972,"t":40,"p":16395}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}},{"type":"quest","id":"68329","obj":{"i":68329,"n":"The Power of the Fist","g":110,"l":"The Azim Steppe","s":6150}}]}