{"quest":{"name":"Food Glorious Food","location":"The Azim Steppe","id":68334,"patch":4.0,"sort":6200,"eventIcon":71221,"issuer":1019328,"target":1019328,"involved":[1022222],"genre":110,"journal":["Ibakha is busy preparing a feast fit for a tribe free of greed."],"objectives":["Speak with Kishiligh.","Obtain the sack of meat.","Deliver the sack of meat to Ibakha."],"dialogue":[{"name":"IBAKHA","text":"Ah, adventurer. Could I ask you to collect something on my behalf?"},{"name":"IBAKHA","text":"I recently asked a Dotharl to supply us with meat. However, we have all been so busy of late no one has had the time to go and collect it."},{"name":"IBAKHA","text":"His name is Kishiligh. I have already given him minerals in exchange for the food. You need only collect the meat."},{"name":"IBAKHA","text":"The Dotharl's name is Kishiligh. I have already given him minerals in exchange for the food. You need only collect the meat."},{"name":"KISHILIGH","text":"The Uyagir have adventurers taking care of their errands now? Never mind. Here's the meat they ordered."},{"name":"KISHILIGH","text":"Just between you and me, I truly do not understand that tribe. They are supposed to be celebrating and yet they only ask for the scraps of meat no one wanted to eat at our recent feast."},{"name":"KISHILIGH","text":"I hear they only eat mushrooms most days. Honestly, someone should tell them it is fine to treat yourself once in a while. Not that it is really any of my business, I suppose."},{"name":"KISHILIGH","text":"Take the meat back to Ibakha. She has waited long enough for it by my reckoning."},{"name":"IBAKHA","text":"Do you have the meat?"},{"name":"IBAKHA","text":"My thanks. Judging by your expression, you are doubtless wondering why we would ask for scraps?"},{"name":"IBAKHA","text":"The occasion matters not. Even if we are celebrating, we cannot allow ourselves to be overcome by greed as our sinful ancestors were."},{"name":"IBAKHA","text":"We have no right to go out and hunt beasts for their meat. You too would be wise to make sure you do not follow the same path that our tribe once walked."}],"reward":{"gil":655,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"questsType":"all","quests":[68048,68322]}},"partials":[{"type":"npc","id":"1019328","obj":{"i":1019328,"n":"Ibakha","l":2411,"q":2}},{"type":"npc","id":"1022222","obj":{"i":1022222,"n":"Kishiligh","l":2411,"q":3}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}},{"type":"quest","id":"68322","obj":{"i":68322,"n":"Welcome to the Family","g":110,"l":"The Azim Steppe","s":6080}}]}