{"quest":{"name":"Hungry Like the Wolf","location":"The Azim Steppe","id":68331,"patch":4.0,"sort":6170,"icon":100708,"eventIcon":71221,"issuer":1022222,"target":1023415,"involved":[1023211,1023348],"genre":110,"journal":["Kishiligh would like your attention.","Kishiligh mentions that Mauci has been looking for you. It seems he wishes to discuss something he heard from the Uyagir. You set off in search of the young Dotharl.","Mauci has recently heard stories of a master culinarian that works at the Dawn Throne. Word has it his cooking is so good it can both cure illnesses and boost warriors' strength. You theorize he may be speaking of Esugen and go to meet with the Oronir on Mauci's behalf.","Speaking with Esugen, you learn that Kuzuku had been telling people of how the cook's soup had nursed him back to health. It seems this story made its way to the Uyagir, eventually reaching Mauci's ears as well. After explaining Mauci's situation to Esugen, he asks that you bring him baras meat. You go to meet with Mauci below the Azim Steppe.","Mauci gladly agrees to help you hunt several baras, noting that he is relieved to learn there is at least one Oronir willing to help their tribe's rivals.","After slaying three baras and obtaining their meat you go to rendezvous with Mauci by Azim Khaat.","Mauci was a bit overzealous and wound up slaying a grand total of five baras. However, he says that task has made him feel more convinced than ever that he was correct to abandon his sword for his fists. You gather up both your hauls of meat and take them to Esugen.","Esugen is impressed by the sheer volume of baras meat you bring to him, remarking that Mauci must have quite an appetite. He tells you to wait for him with Mauci as he will bring the food directly to you once he is done preparing it.","Esugen and Mauci get along very well despite their tribal rivalry. After exchanging a few compliments, Mauci asks if Esugen would be interested in accompanying him hunting sometime. Esugen is enthusiastic about the idea and you are thanked by the young Dotharl for all you have done to improve his life."],"objectives":["Speak with Mauci.","Speak with Esugen.","Speak with Mauci.","Slay baras and obtain their meat.","Deliver the baras meat to Mauci.","Deliver the baras meat to Esugen.","Speak with Mauci."],"dialogue":[{"name":"KISHILIGH","text":"You are a friend of Mauci's, yes? He has been looking for you."},{"name":"KISHILIGH","text":"He said he wanted to discuss something he heard from the Uyagir with you. Go and speak with him whenever you have the chance."},{"name":"MAUCI","text":"<span class=\"highlight\">Forename</span>, just who I had been looking for! I require your help."},{"name":"MAUCI","text":"Thanks to you, I have awoken to my true potential. However, I have begun to feel that I need something to aid me in my training."},{"name":"MAUCI","text":"Just as I was wondering what it could be that I require, I heard of a master culinarian who plies his trade at the Dawn Throne."},{"name":"MAUCI","text":"They say his cooking is so good it can cure illnesses. Apparently it also helps warriors gain that extra bit of strength. Just what I need, would you not agree?"},{"name":"MAUCI","text":"However, our tribes are not on good terms. I cannot simply walk up to him and ask for his help. For starters, I do not even know his name."},{"name":"MAUCI","text":"I do not suppose you know anything more about him?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"His name is Esugen."},{"name":"A1","text":"He is a weakling."},{"name":"MAUCI","text":"He is a weakling named Esugen?"},{"name":"MAUCI","text":"Could you introduce me to him?"},{"name":"MAUCI","text":"Thank you. I doubt I could have met him otherwise considering the bad blood between our tribes. Meet me below the Dawn Throne."},{"name":"KISHILIGH","text":"Mauci said he wanted to discuss something he heard from the Uyagir with you. Go and speak with him whenever you have the chance."},{"name":"ESUGEN","text":"<span class=\"highlight\">Forename</span>, so nice to see you again. I trust you have been well?"},{"name":"ESUGEN","text":"That soup did just the trick. Kuzuku beat me without breaking a sweat. As a result, I have been able to continue cooking, so things have ultimately worked out quite well."},{"name":"ESUGEN","text":"But my apologies for going on about myself. Is there something you would ask of me?"},{"name":"ESUGEN","text":"I see. I was aware Kuzuku had been telling people about my cooking, but to think his stories managed to reach even the Uyagir..."},{"name":"ESUGEN","text":"If I am to help this Dotharl then I will need to do it in secret. If my fellow Oronir knew I was helping the enemy there is no telling what they might do to me."},{"name":"ESUGEN","text":"Now that I think of it, there was a dish I had wanted to try making. Yes, if only I had some baras meat."},{"name":"ESUGEN","text":"I wonder if some kindly soul would be able to bring me some. Perhaps someone stood nearby at this very moment. Oh, woe is me."},{"name":"ESUGEN","text":"Well, you heard what I need. I will be waiting here for you."},{"name":"MAUCI","text":"Please speak to Esugen on my behalf. I know his cooking can help me grow stronger."},{"name":"MAUCI","text":"Is Esugen willing to help?"},{"name":"MAUCI","text":"He needs baras meat, does he? That should be no problem. It is certainly nice to know there are some Oronir willing to help those from rival tribes."},{"name":"MAUCI","text":"Let us split up and slay several baras. It should prove to be good training. Meet me here once you have finished."},{"name":"ESUGEN","text":"I wonder if some kindly soul would be able to bring me some baras meat. Perhaps someone stood nearby at this very moment. Oh, woe is me."},{"name":"MAUCI","text":"How many baras were you able to slay?"},{"name":"MAUCI","text":"Oh, we only needed to dispatch that many, did we? You made no mention of a number, so I went ahead and slayed five of them. Well, Esugen will not want for ingredients!"},{"name":"MAUCI","text":"This errand has further convinced me that I was right to embark on my current path. I could never have fought those beasts with a sword."},{"name":"MAUCI","text":"But I must become even stronger. I am certain Esugen's cooking is key to this. Make sure he knows how serious I am about bettering myself."},{"name":"ESUGEN","text":"Oh, how nice life must be for those who have baras meat readily available..."},{"name":"ESUGEN","text":"I must say I was not expecting this much meat! Your friend must have quite an appetite."},{"name":"ESUGEN","text":"He is also correct in thinking that your diet is ultimately what determines how strong you become. Truly, I have never encountered someone so keen to eat my cooking before."},{"name":"ESUGEN","text":"I will bring the food to you once I am done preparing it. Please wait for me with the young Dotharl."},{"name":"MAUCI","text":"This will actually be my first time eating non-Dotharli cuisine. I wonder what kind of meal he is going to prepare for me..."},{"name":"MAUCI","text":"Esugen is going to deliver the food to us himself? That is good to know. I am so hungry I am not sure if I have the strength to move from this spot."},{"name":"ESUGEN","text":"Get it while it is still hot! Ah, is this your Dotharli friend?"},{"name":"MAUCI","text":"You must be the cook I have heard so much about. My name is Mauci. I am very much looking forward to sampling your cooking!"},{"name":"ESUGEN","text":"I assure you, it is nothing special. Baras meat is low in fat, which makes it perfect for those wishing to gain muscle. It is quite simple really."},{"name":"MAUCI","text":"Interesting. I had thought all kinds of meat would be equally beneficial, but clearly I was wrong. Your knowledge is unparalleled."},{"name":"ESUGEN","text":"You flatter me. You are much more worthy of respect─not many Xaela are capable of slaying so many baras and remaining unscathed. Please, eat up before the food goes cold."},{"name":"MAUCI","text":"Ah, that was exactly what I needed! I feel stronger already."},{"name":"ESUGEN","text":"Nothing brings me more joy than to see others enjoy my work. Bring me the ingredients and I will gladly make this for you again. I have long wished to try my hand at a variety of baras dishes, but I am too weak to hunt them myself."},{"name":"MAUCI","text":"I know how you feel only too well. I was one of the weakest warriors in Dotharl Khaa before <span class=\"highlight\">Forename</span> showed me where my talents lay."},{"name":"MAUCI","text":"Why don't we go hunting together sometime? Perhaps I can help you discover a new way of fighting that suits you─just like <span class=\"highlight\">Forename</span> did for me."},{"name":"ESUGEN","text":"That sounds fantastic! Thank you, Mauci. I never imagined the day would come where I would make a Dotharli friend."},{"name":"MAUCI","text":"It seems I must thank you once again, <span class=\"highlight\">Forename</span>. I have a feeling my friendship with Esugen is going to be most enjoyable."},{"name":"MAUCI","text":"I am truly starting to think there is something about you that changes your friends' lives for the better."},{"name":"ESUGEN","text":"I will deliver the cooking to you myself once it is ready."}],"reward":{"gil":1500,"items":[{"id":18567,"one":1,"hq":1},{"id":18568,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"questsType":"all","quests":[68048,68321]}},"partials":[{"type":"npc","id":"1022222","obj":{"i":1022222,"n":"Kishiligh","l":2411,"q":3}},{"type":"npc","id":"1023415","obj":{"i":1023415,"n":"Mauci","l":2411,"q":1}},{"type":"npc","id":"1023211","obj":{"i":1023211,"n":"Mauci","l":2411,"q":2}},{"type":"npc","id":"1023348","obj":{"i":1023348,"n":"Esugen","l":2411,"q":5}},{"type":"item","id":"18567","obj":{"i":18567,"n":"Azurite Choker of Healing","l":279,"c":54972,"t":40,"p":16395}},{"type":"item","id":"18568","obj":{"i":18568,"n":"Azurite Choker of Casting","l":279,"c":54972,"t":40,"p":16395}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68048","obj":{"i":68048,"n":"The Undying Ones","g":6,"l":"The Azim Steppe","s":700}},{"type":"quest","id":"68321","obj":{"i":68321,"n":"The Strongest among Us","g":110,"l":"The Azim Steppe","s":6070}}]}