{"quest":{"name":"Honor in Victory","location":"The Azim Steppe","id":68337,"patch":4.0,"sort":6230,"eventIcon":71221,"issuer":1019386,"target":1019386,"involved":[1019354,1021348],"genre":110,"journal":["Bujeg is busy preparing to make an offering."],"objectives":["Obtain holy water at the designated location.","Obtain the offering of food from Masgud.","Deliver the Mol sword, vial of holy water, and offering of food to the Chakha Zoh guard.","Report to Bujeg."],"dialogue":[{"name":"BUJEG","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>, khagan. Should you have the time, there is something I would ask of you."},{"name":"BUJEG","text":"Tradition dictates that the tribe which triumphs in the Naadam makes an offering at the westerly altar. This is done by the individual who contributed most greatly to their tribe's victory."},{"name":"BUJEG","text":"You are no Mol, but we could not have succeeded without you. I would like you to collect our three offerings and deliver them to the guard in front of Chakha Zoh."},{"name":"BUJEG","text":"Here is the first of our offerings, a sword crafted specially for the occasion. Next you will need to collect holy water from Azim Khaat, the lake below the Dawn Throne."},{"name":"BUJEG","text":"Speak to Masgud in Reunion and he will give you the final offering. Thank you for your continued support, khagan."},{"name":"BUJEG","text":"Once you have all of the offerings please deliver them to the guard in front of Chakha Zoh."},{"name":"BUJEG","text":"Collect the holy water from Azim Khaat, the lake below the Dawn Throne. I have asked Masgud in Reunion to prepare our offering of food. Thank you for your continued support, khagan."},{"name":"MASGUD","text":"Ah, have you come for Bujeg's order? It is rather hefty so do be careful when carrying it."},{"name":"MONK02801","text":"Do you have the offerings?"},{"name":"MONK02801","text":"Yes, everything seems to be in order. Tell me, are you familiar with the meaning behind what you have brought here?"},{"name":"MONK02801","text":"These items represent our united wish that we shall be blessed with peace until the next Tsagaan Sar, and that those who lost their lives during the Naadam are able to rest well."},{"name":"MONK02801","text":"Thank you for making the offering. I wish you well on your future travels. Please tell Bujeg that you have done what was asked of you."},{"name":"BUJEG","text":"Thank you, khagan. This year's Naadam has at last come to a close."},{"name":"BUJEG","text":"Now we are free to return to our regular lives. May the gods continue to smile upon you."}],"reward":{"gil":655,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68052]}},"partials":[{"type":"npc","id":"1019386","obj":{"i":1019386,"n":"Bujeg","l":2411,"q":2}},{"type":"npc","id":"1019354","obj":{"i":1019354,"n":"Masgud","l":2411,"q":3}},{"type":"npc","id":"1021348","obj":{"i":1021348,"n":"Chakha Zoh Guard","l":2411,"q":1}},{"type":"quest","id":"68052","obj":{"i":68052,"n":"Glory to the Khagan","g":6,"l":"The Azim Steppe","s":740}}]}