{"quest":{"name":"Wouldn't Hurt a Fly","location":"The Azim Steppe","id":68336,"patch":4.0,"sort":6220,"eventIcon":71221,"issuer":1022531,"target":1022531,"genre":110,"journal":["This mild-mannered Mol needs the aid of a warrior."],"objectives":["Survey the designated location and slay any beasts that appear.","Report to the mild-mannered Mol."],"dialogue":[{"name":"GENTLEMAN02800","text":"You there! You look like you have slain a beast or two."},{"name":"GENTLEMAN02800","text":"I was told today by the udgan that the gods want me to slay a beast by the Dusk Throne."},{"name":"GENTLEMAN02800","text":"However, I have never even killed an insect. And I am certainly far too weak to take on any of the creatures that dwell near the Dusk Throne. Oh, why did the gods ask this of me?"},{"name":"GENTLEMAN02800","text":"Could you slay the creature in my stead? The udgan did not specify that the beast need be slain by my hand."},{"name":"GENTLEMAN02800","text":"Please, go to the Dusk Throne and slay any beasts you find. You are my only hope!"},{"name":"GENTLEMAN02800","text":"Please, go to the Dusk Throne and slay any beasts you find."},{"name":"GENTLEMAN02800","text":"Tell me, what did you face?"},{"name":"GENTLEMAN02800","text":"An anala augur, you say?"},{"name":"GENTLEMAN02800","text":"Ha ha, now I see why the gods gave me this task!"},{"name":"GENTLEMAN02800","text":"I have been working on a set of armor ordered by a Budugan warrior for a few days now. However, no matter how hard I tried, I could not think of an appropriate design."},{"name":"GENTLEMAN02800","text":"But hearing you slayed an anala has made up my mind. I shall give the armor a fiery design! That should suit a brave warrior like him nicely."},{"name":"GENTLEMAN02800","text":"Thank you for all of your help. Do not hesitate to let me know in the future if you have a problem of your own! Perhaps the gods will be able to guide you too."}],"reward":{"gil":585,"xp":108000},"reqs":{"jobs":[{"lvl":66,"id":34}],"quests":[68052]}},"partials":[{"type":"npc","id":"1022531","obj":{"i":1022531,"n":"Mild-mannered Mol","l":2411,"q":1}},{"type":"quest","id":"68052","obj":{"i":68052,"n":"Glory to the Khagan","g":6,"l":"The Azim Steppe","s":740}}]}