{"quest":{"name":"Assistants Anonymous","location":"Yanxia","id":68340,"patch":4.0,"sort":7010,"eventIcon":71221,"issuer":1023321,"target":1023321,"involved":[1023322,1023323,1023324,1023325],"genre":109,"journal":["An Auri samurai is in need of an extra pair of eyes."],"objectives":["Speak with the Auri samurai.","Stand watch at the designated location.","Speak with the Auri samurai.","Stand watch at the designated location.","Obtain the crate of pilfered provisions.","Deliver the crate of pilfered provisions to the Auri samurai."],"dialogue":[{"name":"LADYSOLDIER02804","text":"Beg your pardons, but you are <span class=\"highlight\">Forename</span>, are you not? I have heard much and more of your valiant deeds. I would entreat your aid, if you are willing."},{"name":"LADYSOLDIER02804","text":"I am due to meet with some of our informants. Under normal circumstances I would do so with my partner, but he was wounded in our last outing and is bedridden. As such, I have been seeking someone to accompany me in his stead."},{"name":"LADYSOLDIER02804","text":"Though these informants are known to us and the risk is low, command forbids that we embark on missions alone. It would give me much heart to have one such as you join me."},{"name":"LADYSOLDIER02804","text":"I am in your debt. Without further ado, then, let us make for Yuzuka Manor, where the first meeting will take place."},{"name":"NAMAZUO02804","text":"You wish to talk, do you? Sincerest apologies, but I am to talk to none but her, none at all."},{"name":"LADYSOLDIER02804","text":"Ah, there you are. I will speak with our informant. In the meantime, I ask that you keep watch for danger in the area."},{"name":"LADYSOLDIER02804","text":"Pray keep watch for danger in the area while I speak with our informant."},{"name":"LADYSOLDIER02804","text":"My thanks, <span class=\"highlight\">Forename</span>.<br>...Hm? I take it you are surprised that the informant was a Namazu."},{"name":"LADYSOLDIER02804","text":"You see, arrogant as they are, the Garleans think the Namazu beneath their attention. He and his kind can get close to them without raising suspicion."},{"name":"LADYSOLDIER02804","text":"Furthermore, as ubiquitous as they are, they make excellent eyes and ears both near and far. Just now, I was apprised of the situation in the lands neighboring Yanxia."},{"name":"LADYSOLDIER02804","text":"But come, there is one more informant to meet, this time in Namai."},{"name":"ANXIETYMAN02804","text":"Aye? I don't stick my nose in others' business, and I'd thank others to keep theirs out o' mine."},{"name":"LADYSOLDIER02804","text":"You are here. Good. As before, pray keep watch over the area while I speak with our informant."},{"name":"LADYSOLDIER02804","text":"Pray keep watch over the area while I speak with our informant."},{"name":"LADYSOLDIER02804","text":"Though he came attired as a local, that man is in fact a sympathizer in the imperial army. He brings us much-needed provisions as well as intelligence."},{"name":"LADYSOLDIER02804","text":"And today, he tells us that a band of imperial defectors has taken to banditry in the region. Command will wish to hear of this."},{"name":"LADYSOLDIER02804","text":"I will hasten ahead to the House of the Fierce. My apologies, but may I trouble you to transport this crate in my stead?"},{"name":"LADYSOLDIER02804","text":"Again, my apologies for leaving you to do the heavy lifting. I shall take the provisions off your hands now."},{"name":"LADYSOLDIER02804","text":"We are in your debt. Thanks to you, we were able to take swift action as regard the defector bandits. Even now, our scouts are keeping them under surveillance."},{"name":"LADYSOLDIER02804","text":"And yet, bandits though they may be, they are not unlike us─victims of imperial rule. Were they not forcibly conscripted, they could well be living peaceful lives."},{"name":"LADYSOLDIER02804","text":"But the reality is there can be no peace under the Garleans, and full many are doing their part to bring about Doman liberation. Like the souls whom you met today. Like yourself."},{"name":"LADYSOLDIER02804","text":"Would that the bandits would join their strength to ours as well. Their help would be most welcome in our struggle."}],"reward":{"gil":873,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68482]}},"partials":[{"type":"npc","id":"1023321","obj":{"i":1023321,"n":"Auri Samurai","l":2410,"q":1}},{"type":"npc","id":"1023322","obj":{"i":1023322,"n":"Auri Samurai","l":2410,"q":1}},{"type":"npc","id":"1023323","obj":{"i":1023323,"n":"Auri Samurai","l":2410,"q":1}},{"type":"npc","id":"1023324","obj":{"i":1023324,"n":"Catty Namazu","l":2410,"q":1}},{"type":"npc","id":"1023325","obj":{"i":1023325,"n":"Shifty Fellow","l":2410,"q":1}},{"type":"quest","id":"68482","obj":{"i":68482,"n":"How Tataru Got Her Groove Back","g":6,"l":"Kugane","s":780}}]}