{"quest":{"name":"Child Labor","location":"Kugane","id":68349,"patch":4.0,"sort":7020,"eventIcon":71221,"issuer":1022620,"target":1022620,"involved":[1023126,1023127,1023128,1023129,1023130,1023131],"genre":107,"journal":["Keisetsu of Kugane has a task fit for an adventurer from abroad."],"objectives":["Seek out merchants in Kugane from foreign lands, and see the draper sale missive to their hands.","Report back to Keisetsu."],"dialogue":[{"name":"KEISETSU","text":"Excuse me, you have the look of one who hails from a foreign land. If so, I believe you may be able to help me."},{"name":"KEISETSU","text":"I am Keisetsu, servant to a mercantile house. I am charged with dispensing these missives to passersby. They tell of a grand sale my master is having on some very choice silks. Only, I cannot seem to get people to accept them from me."},{"name":"KEISETSU","text":"My master and I wish nothing more than to sell our silks to those who visit Kugane from across the seas. But I fear they find me suspicious. If a fellow foreigner such as yourself were handing out the missives, they may be more inclined to take them."},{"name":"KEISETSU","text":"See these draper sale missives into the hands of any merchants visiting Kugane from abroad. I will see your labors rewarded."},{"name":"KEISETSU","text":"See six of my draper sale missives into the hands of any foreign merchants visiting Kugane from abroad. I will see your labors rewarded."},{"name":"MERCHANTA02813","text":"Yes, what is it?"},{"name":"MERCHANTA02813","text":"Ah, I do believe I've seen this missive before. There was a small child handing out the very same one. I thought it to be a farce or some other small matter."},{"name":"MERCHANTA02813","text":"Intriguing. It says here that silks of the finest quality are available at a fraction of the market price. I shall go and see these wares for myself. Thank you, stranger."},{"name":"MERCHANTB02813","text":"May I help you?"},{"name":"MERCHANTB02813","text":"This is the same missive a child was handing out down by the port. I confess, I am very much interested in the finest of silks, but the child did not give the finest of impressions."},{"name":"MERCHANTB02813","text":"What kind of shop would see fit to put such a youngling to work? I have reservations about the integrity of this Kugane."},{"name":"MERCHANTC02813","text":"What is it? I'm busy. State your business, and quickly. Else leave me be. "},{"name":"MERCHANTC02813","text":"Hmph, truth be told, soon as folk in Kugane catch word that you're a merchant, they never let you be. Damn annoying it is. But if you're saying there's business to be done here, I'll go and have myself a look."},{"name":"MERCHANTC02813","text":"A sale, is it? I do like the sound of that. The silks of Kugane are much desired across the seas. I'll pay this shop a visit. Thank you."},{"name":"MERCHANTD02813","text":"Yes, yes, yes, how may I help? Have you come to me on some business?"},{"name":"MERCHANTD02813","text":"Silks on sale!? That is a most welcome delight to my ears. Ah, yes, this missive. I have seen its like before. Is it not the same that a young boy is distributing?"},{"name":"MERCHANTD02813","text":"Oh my, that is a surprise indeed. To think that such a young child was actually working. I thought him at some play or prank. Do the merchants of Kugane start their trade at such a young age? I find that both inspiring and admirable."},{"name":"MERCHANTE02813","text":"What is it? Can't you see I'm busy. Someone has to study the market here."},{"name":"MERCHANTE02813","text":"A missive for a silk sale? Aye, these prices look choice enough. I wonder if there was room yet on my barge for a few more crates."},{"name":"MERCHANTE02813","text":"I suppose there is always room enough for a few select pieces for the wife. Thank you for the missive, friend."},{"name":"MERCHANTF02813","text":"You don't look to be a merchant. What can I do for you?"},{"name":"MERCHANTF02813","text":"This is the second such missive I've received, but I shall take it all the same. Still, I must say, you do not look as one meant to be handing out missives. You look as though you should be leading a van on the field of battle. "},{"name":"MERCHANTF02813","text":"Forgive me, I shall speculate no more. The paths we tread in life are all our own. Continue to tread yours as you see fit, and tread it well, friend. Good day."},{"name":"KEISETSU","text":"You were able to give away all of the missives? I am glad to hear it, but... Why will people not take them from me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Many were opposed to the thought of child labor."},{"name":"B1","text":"Many thought you were merely a child at play."},{"name":"KEISETSU","text":"I see... I hadn't thought it a problem of age. It is quite normal in Hingashi for a child to work. I suppose the same cannot be said of the lands from which these travelers come."},{"name":"KEISETSU","text":"My house is by no means a rich one. I've a younger brother and sister to provide for. And handing out these missives is the only work I am able to do."},{"name":"KEISETSU","text":"I dream of opening my own shop someday. I will steal the wisdom and tricks of my master. I will learn the tongues of faraway lands. I will─ Oh, I'm sorry. I shouldn't say such things aloud. Here, take this."},{"name":"KEISETSU","text":"You did me a service, and for that I must pay you. I could hardly hope of becoming a merchant without knowing that much. Thank you, traveler."}],"reward":{"items":[{"id":19811}],"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68061]}},"partials":[{"type":"npc","id":"1022620","obj":{"i":1022620,"n":"Keisetsu","l":2404,"q":1}},{"type":"npc","id":"1023126","obj":{"i":1023126,"n":"Miqo'te Traveler","l":2404,"q":1}},{"type":"npc","id":"1023127","obj":{"i":1023127,"n":"Duskwight Debutante","l":2404,"q":1}},{"type":"npc","id":"1023128","obj":{"i":1023128,"n":"Roegadyn Sailor","l":2404,"q":1}},{"type":"npc","id":"1023129","obj":{"i":1023129,"n":"Lalafellin Trader","l":2404,"q":1}},{"type":"npc","id":"1023130","obj":{"i":1023130,"n":"Auri Merchant","l":2404,"q":1}},{"type":"npc","id":"1023131","obj":{"i":1023131,"n":"Lalafellin Deckswab","l":2404,"q":1}},{"type":"item","id":"19811","obj":{"i":19811,"n":"Baklava","l":260,"c":24083,"t":46}},{"type":"quest","id":"68061","obj":{"i":68061,"n":"The World Turned Upside Down","g":6,"l":"Yanxia","s":850}}]}