{"quest":{"name":"From the Bottom of My Gut","location":"Yanxia","id":68342,"patch":4.0,"sort":7030,"eventIcon":71221,"issuer":1019285,"target":1019285,"genre":109,"journal":["Haname wishes to show her gratitude to a staunch supporter of the Front."],"objectives":["Slay whitewing hornbills and obtain a golden bezoar.","Deliver the golden bezoar to Haname."],"dialogue":[{"name":"HANAME","text":"Ah, 'tis you, <span class=\"highlight\">Forename</span>. If you are not averse, I should like your assistance with a certain matter."},{"name":"HANAME","text":"A veteran such as yourself will appreciate that it takes more than warriors to wage war. Aside from those who fight on the front lines as we do, there are full many who contribute to our cause in myriad other ways."},{"name":"HANAME","text":"In particular, there is one individual to whom we owe much, and 'tis my desire to express my gratitude to him in the form of a gift."},{"name":"HANAME","text":"For this gift I have in mind a golden bezoar, a stone found only within the stomachs of whitewing hornbills. The creatures dwell near Monzen to the west, and I would ask that you hunt them until one yields what I seek."},{"name":"HANAME","text":"Ordinary bezoars are readily found and are worth little and less, but the golden variety is highly prized as a talisman."},{"name":"HANAME","text":"Under normal circumstances I would see to this task myself, but circumstances are anything but normal. I dare not leave my post lest I am called to action whilst away. My thanks in advance, comrade."},{"name":"HANAME","text":"Were you able to obtain a golden bezoar?"},{"name":"HANAME","text":"Well, such a rich, golden hue! 'Tis a small wonder how it earned its name. I am in your debt, my friend."},{"name":"HANAME","text":"You are doubtless wondering whom this gift is for. While I am not at liberty to say a name, he is an elderly gentleman who has long provided us with the coin we need to continue our fight."},{"name":"HANAME","text":"Though he can be considered hale and hearty, there is no denying that he is advanced in years, hence the choice of a talisman to bring him good fortune."},{"name":"HANAME","text":"I've no doubt that he will be pleased with it. My thanks to you again, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":625,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68482]}},"partials":[{"type":"npc","id":"1019285","obj":{"i":1019285,"n":"Haname","l":2410,"q":5}},{"type":"quest","id":"68482","obj":{"i":68482,"n":"How Tataru Got Her Groove Back","g":6,"l":"Kugane","s":780}}]}