{"quest":{"name":"The Rainbow Collection","location":"Yanxia","id":68341,"patch":4.0,"sort":7020,"eventIcon":71221,"issuer":1019288,"target":1019288,"genre":109,"journal":["Yagoro needs hard-to-find supplies from hard-to-reach places."],"objectives":["Obtain a crystal from the orange pond.","Obtain water from the green pond.","Deliver the crystal and water to Yagoro."],"dialogue":[{"name":"YAGORO","text":"You are <span class=\"highlight\">Forename</span>, unless I'm mistaken? I have need of your help. Please hear me out."},{"name":"YAGORO","text":"You would never guess, but I'm in fact a craftsman by trade. With the Front being constantly shorthanded, however, I've become more of a jack-of-all-trades. Most recently, I've been tasked with procuring certain rare supplies, but it's quite beyond one of my humble abilities. Allow me to explain."},{"name":"YAGORO","text":"To the north of here, there lies a peculiar place called Prism Lake. There you'll find exposed deposits of high-purity crystals which, through some trick of the elements, have changed the waters into the colors of the rainbow."},{"name":"YAGORO","text":"Well, whatever is responsible for this phenomenon seems to have also made the local Namazu uncommonly savage, making it quite impossible for me to do my job."},{"name":"YAGORO","text":"However, I believe one of your prowess would have little difficulty. I would be most grateful were you to procure a crystal from the orange pond and some water from the green pond. Rest assured you will be compensated for your troubles."},{"name":"YAGORO","text":"Were you able to acquire what I asked for?"},{"name":"YAGORO","text":"Wonderful! I knew I was right to entrust the task to you."},{"name":"YAGORO","text":"But tell me, what did you think of the scenery? The place is quite surreal, is it not?"},{"name":"YAGORO","text":"Legend has it an angel once fell in love with a young nobleman of Doma. Wishing that he joined her in her heavenly domain, she fashioned for him a bridge out of a rainbow."},{"name":"YAGORO","text":"Alas, the gods were furious that she would bring a lowly mortal to their abode without their permission. And so they destroyed the bridge, reducing it to a thousand thousand pieces, before the nobleman could finish crossing."},{"name":"YAGORO","text":"The pieces of this bridge fell to the earth and into a lake, where it imbued the waters with their color. So it was that Prism Lake came to be."},{"name":"YAGORO","text":"Faerie tales aside, prism crystals are prized as an energy source, while prism water boasts potent healing properties. Both will serve us well in our fight."},{"name":"YAGORO","text":"Right now, we enjoy the lake for its practical gifts, but one day I hope to simply enjoy it for its beauty. My thanks for your help, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":590,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68482]}},"partials":[{"type":"npc","id":"1019288","obj":{"i":1019288,"n":"Yagoro","l":2410,"q":3}},{"type":"quest","id":"68482","obj":{"i":68482,"n":"How Tataru Got Her Groove Back","g":6,"l":"Kugane","s":780}}]}