{"quest":{"name":"Wine for the Road","location":"Yanxia","id":68344,"patch":4.0,"sort":7050,"eventIcon":71221,"issuer":1023104,"target":1023104,"involved":[1023105,1023106,1023107],"genre":109,"journal":["The stalwart soldier would request your company on a brief outing."],"objectives":["Speak with the stalwart soldier.","Sprinkle Gensui wine at the designated location.","Speak with the stalwart soldier. ","Sprinkle Gensui wine at the designated location.","Speak with the stalwart soldier.","Sprinkle Gensui wine at the designated location.","Speak with the stalwart soldier."],"dialogue":[{"name":"SADNESSSAMURAI","text":"You are <span class=\"highlight\">Forename Surname</span>, the hero who hails from the West. Aye, 'tis plain from the glimmer in your eyes and the strength in your bearing. I realize this is sudden, but will you accompany me outside?"},{"name":"SADNESSSAMURAI","text":"It shan't take long, nor will there be any danger. Just a scenic walk to sprinkle wine at a handful of places."},{"name":"SADNESSSAMURAI","text":"Doubtless you are wondering about the purpose of this activity. For now, I ask that you humor a comrade and think of it as a peculiar local tradition."},{"name":"SADNESSSAMURAI","text":"Here is the wine. Pray bring it with you to the docks. I shall tell you more as we make our way."},{"name":"SADNESSSAMURAI","text":"There you are. You have the wine, I trust? Pray give these grounds here a dash of it."},{"name":"SADNESSSAMURAI","text":"You have the wine I gave you, yes? Pray give these grounds here a dash of it."},{"name":"SADNESSSAMURAI","text":"The One River was the lifeline of trade for Doma and the key to her prosperity. In the past, countless ships and barges bearing all manner of cargo would pass through here."},{"name":"SADNESSSAMURAI","text":"Come, let us move on. We next go to Monzen."},{"name":"SADNESSSAMURAI","text":"The town of Monzen was once home to those samurai families who served under Lord Kaien─kami rest his soul."},{"name":"SADNESSSAMURAI","text":"And here was where many young warriors gathered to hone their swordfighting skills. Go ahead and give the grounds a sprinkle of wine."},{"name":"SADNESSSAMURAI","text":"Go ahead, my friend. Give the grounds a sprinkle of wine."},{"name":"SADNESSSAMURAI","text":"Good. Let us head to the western edge of town."},{"name":"SADNESSSAMURAI","text":"This manor once belonged to His Excellency the Tairo, one of our nation's leaders. He was known as an outstanding warrior and an exceptional poet besides, one of his admirers being no less a personage than Lord Kaien himself."},{"name":"SADNESSSAMURAI","text":"Go on and sprinkle some wine here as well."},{"name":"SADNESSSAMURAI","text":"Go on, sprinkle some wine here as well."},{"name":"SADNESSSAMURAI","text":"And that is the last spot. Let us make our way back, shall we?"},{"name":"SADNESSSAMURAI","text":"Now then, I believe an explanation is in order. Those places we visited are where many of our comrades fell fighting the Empire."},{"name":"SADNESSSAMURAI","text":"When Yotsuyu tried to make an example of Monzen, they rose up and fought courageously to the last man."},{"name":"SADNESSSAMURAI","text":"To receive an offering of wine from a hero such as you, I do not doubt that they will be pleased."},{"name":"SADNESSSAMURAI","text":"Aside from paying my respects, I wished to introduce you to them, you see. They will rest easier in the knowledge that we have allies strong and true who fight with us. My thanks for your company, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":943,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68482]}},"partials":[{"type":"npc","id":"1023104","obj":{"i":1023104,"n":"Stalwart Soldier","l":2410,"q":1}},{"type":"npc","id":"1023105","obj":{"i":1023105,"n":"Stalwart Soldier","l":2410,"q":1}},{"type":"npc","id":"1023106","obj":{"i":1023106,"n":"Stalwart Soldier","l":2410,"q":1}},{"type":"npc","id":"1023107","obj":{"i":1023107,"n":"Stalwart Soldier","l":2410,"q":1}},{"type":"quest","id":"68482","obj":{"i":68482,"n":"How Tataru Got Her Groove Back","g":6,"l":"Kugane","s":780}}]}