{"quest":{"name":"An Eye for an Emblem","location":"Yanxia","id":68345,"patch":4.0,"sort":7060,"eventIcon":71221,"issuer":1023108,"target":1023108,"involved":[1023109,1023110,1023111],"genre":109,"journal":["The slight soldier has need of a hero's keen eyes."],"objectives":["Speak with the slight soldier in Monzen.","Survey the designated area for the gingko emblem.","Speak with the slight soldier."],"dialogue":[{"name":"LADYSOLDIER02809","text":"Hero of Eorzea, a moment. You do not know me─I am but one of many here─but I would beseech you your assistance in a...personal endeavor."},{"name":"LADYSOLDIER02809","text":"Under hard years of imperial rule, the ancient and noble culture of Doma has begun to fade. Hoping to preserve some small part of it for posterity, I've been in search of a certain tome."},{"name":"LADYSOLDIER02809","text":"Alas, as it presents no immediate benefit to our cause, my comrades have been less than cooperative in my efforts."},{"name":"LADYSOLDIER02809","text":"If my own compatriots will not help me, I thought that mayhap a visitor will. If you are willing, pray meet me in Monzen."},{"name":"LADYSOLDIER02809","text":"My thanks for coming. Now then, 'twould not do to be absent overlong, so let us set to work at once."},{"name":"LADYSOLDIER02809","text":"Somewhere in Monzen, there is a manor that bears a gingko emblem. That is where the tome should be found. I would have you search for this emblem with me."},{"name":"SYSTEM","text":"A gingko emblem adorns the gate."},{"name":"SYSTEM","text":"There is no gingko emblem in the area."},{"name":"LADYSOLDIER02809","text":"You've found the manor? I shall go there at once!"},{"name":"LADYSOLDIER02809","text":"I have it, <span class=\"highlight\">Forename</span>! The tome!"},{"name":"LADYSOLDIER02809","text":"Oh, I'd love to pore over it right this moment, but 'tis past time we headed back. My shift is due to begin shortly, and there is also the matter of properly thanking you."},{"name":"LADYSOLDIER02809","text":"I've since browsed the tome, and it is beyond worth. Words will not suffice to show my gratitude."},{"name":"LADYSOLDIER02809","text":"The name will not be familiar to you, but this tome once belonged to a late lord of the Rokuyari family. When he stepped down from that role, he devoted his time to the study of herbs."},{"name":"LADYSOLDIER02809","text":"In this tome he recorded innumerable plant varieties as well as those that he himself discovered, and lists in great detail their myriad properties. The knowledge will surely be of great benefit to all Domans."},{"name":"LADYSOLDIER02809","text":"Again, allow me to thank you. From the bottom of my heart."}],"reward":{"gil":837,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68482]}},"partials":[{"type":"npc","id":"1023108","obj":{"i":1023108,"n":"Slight Soldier","l":2410,"q":1}},{"type":"npc","id":"1023109","obj":{"i":1023109,"n":"Slight Soldier","l":2410,"q":1}},{"type":"npc","id":"1023110","obj":{"i":1023110,"n":"Slight Soldier","l":2410,"q":1}},{"type":"npc","id":"1023111","obj":{"i":1023111,"n":"Slight Soldier","l":2410,"q":1}},{"type":"quest","id":"68482","obj":{"i":68482,"n":"How Tataru Got Her Groove Back","g":6,"l":"Kugane","s":780}}]}