{"quest":{"name":"A View to a Spill","location":"Yanxia","id":68347,"patch":4.0,"sort":7080,"eventIcon":71221,"issuer":1023112,"target":1023112,"involved":[1023113],"genre":109,"journal":["The sharp-eyed samurai has an eye for the sky."],"objectives":["Speak with the sharp-eyed samurai.","Head to the vantage point and use the telescope to observe the suspicious soldier.","Report to the sharp-eyed samurai."],"dialogue":[{"name":"SAMURAILADY","text":"Is it true what they say? That you can soar the sky freely as a bird?"},{"name":"SAMURAILADY","text":"Then there is a mission I would entrust to you. The very nature of it makes you best suited."},{"name":"SAMURAILADY","text":"But we shouldn't speak here. Pray meet me outside."},{"name":"SAMURAILADY","text":"Apologies for the sudden change of venue. You see, we have reason to believe there is a traitor among us."},{"name":"SAMURAILADY","text":"To be precise, the man has since retired from active duty, but he was once one of our most skilled shinobi. 'Tis nigh impossible to shadow him, even were I a shinobi myself, which I am not."},{"name":"SAMURAILADY","text":"And here is where you come in. Take this."},{"name":"SAMURAILADY","text":"A telescope. With it, I want you to observe the target from a distance. The tops of cliffs and buildings would offer a clear view without risk of detection."},{"name":"SAMURAILADY","text":"You need only keep watch and tell me what you have seen. We shall handle whatever should follow."},{"name":"SAMURAILADY","text":"Now then, the target will soon be heading to the Moon Gates. For your benefit, I shall mark some suitable vantage points on your map. Good luck, and see you back at the House of the Fierce."},{"name":"SAMURAILADY","text":"So, what was the suspect doing?"},{"name":"Q1","text":"What was the suspect doing?"},{"name":"A1","text":"Meeting with a Lupin."},{"name":"A1","text":"Doing some manner of business."},{"name":"SAMURAILADY","text":"A Lupin, you say? I have an inkling as to the purpose of the meeting."},{"name":"SAMURAILADY","text":"Business, you say? I have an inkling as to what he handed over."},{"name":"SAMURAILADY","text":"Recently, funds and supplies sent from our sympathizers have been disappearing with some regularity. 'Twould seem they are ending up in the hands of Lupin brigands."},{"name":"SAMURAILADY","text":"In a time when we must band together for the greater good, it saddens me to think that there are those still who place personal gain first. At any rate, you may leave the rest to us. My thanks for your cooperation."}],"reward":{"gil":802,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68482]}},"partials":[{"type":"npc","id":"1023112","obj":{"i":1023112,"n":"Sharp-eyed Samurai","l":2410,"q":1}},{"type":"npc","id":"1023113","obj":{"i":1023113,"n":"Sharp-eyed Samurai","l":2410,"q":1}},{"type":"quest","id":"68482","obj":{"i":68482,"n":"How Tataru Got Her Groove Back","g":6,"l":"Kugane","s":780}}]}