{"quest":{"name":"Heart of Iron","location":"Yanxia","id":68346,"patch":4.0,"sort":7070,"eventIcon":71221,"issuer":1019287,"target":1019287,"genre":109,"journal":["Motojiro has the look of a man with a heavy heart."],"objectives":["Defeat magatsu kiyofusa to draw out a reinforced kiyofusa and defeat it with armormelt.","Report to Motojiro."],"dialogue":[{"name":"MOTOJIRO","text":"My <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span> <span class=\"highlight\">Forename</span>, I have a favor to ask of you."},{"name":"MOTOJIRO","text":"I need you...to slay my children."},{"name":"MOTOJIRO","text":"Ah, mine apologies for the poor choice of words. When I say “my children,” I mean my creations, the automata known as magatsu kiyofusa."},{"name":"MOTOJIRO","text":"We created them to defend Doma, but though they fought fiercely, in the end we were no match for the might of Garlemald."},{"name":"MOTOJIRO","text":"After our defeat, I feared that my children would be destroyed...but a far worse fate awaited them. For to my horror, they were sent to lay waste to Monzen!"},{"name":"MOTOJIRO","text":"To be forced to turn against those whom they were made to protect... I cannot imagine a crueler existence."},{"name":"MOTOJIRO","text":"If you can comprehend my pain as a parent, I ask that you end both my children's suffering and the destruction they wreak."},{"name":"MOTOJIRO","text":"But beware, for among the magatsu kiyofusa there is one that is bigger and mightier than the rest, that is clad in reinforced armor."},{"name":"MOTOJIRO","text":"With your skills, I do not doubt that you could defeat it, but there is an easier way. This flask contains a concoction called armormelt. Use it to weaken your opponent's armor, and it shouldn't pose any threat."},{"name":"MOTOJIRO","text":"You have ended my children's suffering? I am in your debt."},{"name":"MOTOJIRO","text":"The armormelt I gave you─it was my father's final invention before he died. His were the hands that first forged the magatsu kiyofusa, and the sight of them wreaking mindless destruction haunted him to his dying breath. But thanks to you, he may now know peace in the realm yonder."},{"name":"MOTOJIRO","text":"Though our last creations were turned against us, we cannot let ourselves be disheartened. Nay, such knowledge as we possess, we must ever apply for the good of Doma."},{"name":"MOTOJIRO","text":"It may take time, but I will create new automata, stronger and better than before, to defend our fair nation. This I swear on my father's grave."}],"reward":{"gil":590,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68482]}},"partials":[{"type":"npc","id":"1019287","obj":{"i":1019287,"n":"Motojiro","l":2410,"q":3}},{"type":"quest","id":"68482","obj":{"i":68482,"n":"How Tataru Got Her Groove Back","g":6,"l":"Kugane","s":780}}]}