{"quest":{"name":"The Perfect Woman","location":"Kugane","id":68348,"patch":4.0,"sort":7010,"eventIcon":71221,"issuer":1023118,"target":1023124,"involved":[1023119,1023120,1023121,1023122,1023123],"genre":107,"journal":["An ijin merchant in Kugane seeks help in his search for a certain enchanting someone."],"objectives":["Search for a person affiliated with the Mujikoza theater.","Speak with the ijin merchant.","Search for a Mujikoza theater actor.","Speak with the ijin merchant.","Speak with the ijin merchant once more."],"dialogue":[{"name":"TRADER02812","text":"Well met, adventurer. I am newly come to this Kugane, and find myself lacking a capable <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> such as yourself to aid me in my endeavors. Would you care to hear what I propose?"},{"name":"TRADER02812","text":"The theatrical arts of Kugane are known far and wide. If you have not had chance to take in a show, I highly suggest you do. I myself have been utterly captivated since I first witnessed a performance."},{"name":"TRADER02812","text":"Ever since then, I've visited the Mujikoza theater daily. Alas, I fear the business that brings me to Kugane is nearly at an end, and I shall depart these islands soon. Before I do, however, there is one person whom I should very much like to meet."},{"name":"TRADER02812","text":"She is an actress who played the part of a princess in a play I recently saw. And I can say beyond the shadow of a doubt that she is the most enchanting and gorgeous thing ever beheld─in this world or any other!"},{"name":"TRADER02812","text":"I have passed my days here in longing to meet her. I have waited outside the theater. I have sought to gain insight into where she might be and when. I have done all I can, yet still the gods have not seen fit to send her to me."},{"name":"TRADER02812","text":"Please, deliver me from this suffering. Could you find someone, anyone, who bears some affiliation with the Mujikoza theater? I have learned they sometimes frequent the Shiokaze Hostelry after their shows. You must help me to learn anything I can of this enchantress of the stage!"},{"name":"TRADER02812","text":"Please, deliver me from this suffering. Could you find someone, anyone, who bears some affiliation with the Mujikoza theater? I have learned they sometimes frequent the Shiokaze Hostelry after their shows. You must help me to learn anything I can of this enchantress of the stage!"},{"name":"GIANTACTOR02812","text":"Yes? What do you want of me?"},{"name":"GIANTACTOR02812","text":"The most beautiful woman in all of Kugane? Ahahaha! Listen, friend. It may not be my place to tell you this, but all we show on the stage at the Mujikoza is just that─show. It is fancy and fabrication, meant to appear as a dream. None of us truly look as we do in character. "},{"name":"GIANTACTOR02812","text":"Believe me, there is no good to come of your friend finding the woman whom he lusts for. But I am merely a man, just like him. I, too, know how he feels. I know what he feels, and I know where he feels it. For even I am lost in the smell of the sweetly scented perfume. That─"},{"name":"GIANTACTOR02812","text":"Oh, forgive me. That is the wine talking. Come, we're all <span class=\"alternative-container\"><span class=\"alternative\">adults</span><span class=\"alternative\">grown men</span></span> here, and I am too far in my cups. Let us forget such things were spoken."},{"name":"GIANTACTOR02812","text":"Oh, forgive me. That is the wine talking. Come, we're all <span class=\"alternative-container\"><span class=\"alternative\">adults</span><span class=\"alternative\">grown men</span></span> here, and I am too far in my cups. Let us forget such things were spoken."},{"name":"TRADER02812","text":"&lt;sigh&gt; I have learned that the last of the day's shows just ended. I watched a slew of actors and actresses leave through the door there, but I saw none who resembled the goddess that I seek."},{"name":"TRADER02812","text":"A sweetly scented perfume? Yes... Yes, I smelled such a fragrance from my seat in the audience! Those who left split into two groups. Let us split as well, and let the hunt for my infatuation continue!"},{"name":"TRADER02812","text":"There were three who set off in the direction of Kogane Dori. You track them. I will track those who headed for the Rakuza District."},{"name":"TRADER02812","text":"When you do find them, look to their necks. They were covered in white cosmetics for the show. No doubt they have removed it since, but a bit of white powder must surely remain."},{"name":"TRADER02812","text":"It would seem my waiting outside the theater all these days has finally yielded some fruit! Go now, and if you should find some actor who knows aught of the beauty I seek, learn what you can and then meet me at the Shiokaze Hostelry."},{"name":"MEDIUMBUILDACTOR02812","text":"Were you in the audience tonight, friend? Forgive me, it has been a long night, and I find myself too tired for the usual evening merriment. I must take my leave of you and retire for the night. "},{"name":"HANDSOMEACTOR02812","text":"Please, when I am off the stage, I am just another man of the city. Permit me my privacy. If you wish to see me, I urge you to purchase a ticket and attend a show. Good night to you."},{"name":"WABISABIACTOR02812","text":"You recognized me as an actor of the Mujikoza, did you? You've a sharper eye than I, then, my friend. I confess, yours is not a face I recall from any audience."},{"name":"WABISABIACTOR02812","text":"Hmmm... No, I know of no actress matching the description you've made. It sounds more as if your friend is speaking of some ravishing beauty he saw in a fever dream."},{"name":"SYSTEM","text":"A sweet smell emanates from the neck of the agile actor."},{"name":"WABISABIACTOR02812","text":"Aye, I'm sure of it. I know of no such actress among those in the employ of the Mujikoza. Your friend speaks of a fantasy, I'm sure of it."},{"name":"TRADER02812","text":"I found the actors I sought, but learned nothing of the one I truly seek. Tell me, what did you find, my friend? "},{"name":"TRADER02812","text":"You smelled a sweet fragrance on one of the actors in the Ijin District!? It could very well be one of the cast who knows the woman I seek. Come, let us go and speak with him at length!"},{"name":"WABISABIACTOR02812","text":"Ugh, I'd not thought this would all lead to <span class=\"emphasis\">you</span> coming along. &lt;sigh&gt; Very well, I suppose I could give you the truth, then."},{"name":"TRADER02812","text":"Please, I must meet her. I simply must! This fragrance on you, it is hers. I know it to be! Tell me, what do you know of her. Tell me anything. Everything!"},{"name":"WABISABIACTOR02812","text":"I can see you have no intention of leaving me be until I've answered. And so I will. But you may not find the truth so beautiful as your infatuation. For I am she."},{"name":"TRADER02812","text":"No... No, that simply cannot be. That is impossible. And yet... That voice. That neck. Those contours."},{"name":"WABISABIACTOR02812","text":"As a man grown you should know─every man knows far more of the female form than any woman. That is how I am able to portray the woman of every man's dreams. And so you know the truth. What, then, of your fantasies now? Shattered, are they?"},{"name":"TRADER02812","text":"No... No, they are far from shattered. I feel stronger towards you now than ever! I regret that I must soon depart Kugane, but my business will bring me here again soon. And when it does, I will come and see you at every show!"},{"name":"WABISABIACTOR02812","text":"Then on such evenings I will be sure I am at my most beautiful for you."},{"name":"TRADER02812","text":"This city is truly a marvel, is it not? The culture here is far more rich and complex than any other I've seen or known. I will be back, again and again, and again and again! Thank you, adventurer. You have given me a great gift this day."}],"reward":{"gil":802,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68061]}},"partials":[{"type":"npc","id":"1023118","obj":{"i":1023118,"n":"Ijin Merchant","l":2404,"q":1}},{"type":"npc","id":"1023124","obj":{"i":1023124,"n":"Ijin Merchant","l":2404,"q":1}},{"type":"npc","id":"1023119","obj":{"i":1023119,"n":"Athletic Actor","l":2404,"q":1}},{"type":"npc","id":"1023120","obj":{"i":1023120,"n":"Agile Actor","l":2404,"q":1}},{"type":"npc","id":"1023121","obj":{"i":1023121,"n":"Average Actor","l":2404,"q":1}},{"type":"npc","id":"1023122","obj":{"i":1023122,"n":"Attractive Actor","l":2404,"q":1}},{"type":"npc","id":"1023123","obj":{"i":1023123,"n":"Ijin Merchant","l":2404,"q":1}},{"type":"quest","id":"68061","obj":{"i":68061,"n":"The World Turned Upside Down","g":6,"l":"Yanxia","s":850}}]}