{"quest":{"name":"The Perfect Gift","location":"The Fringes","id":68358,"patch":4.0,"sort":7070,"eventIcon":71221,"issuer":1020804,"target":1020804,"involved":[1020818,1020819,1020820,1020821,1020823],"genre":104,"journal":["M'septha has the look of a woman with questions that beg for answers."],"objectives":["Speak with the Ananta at Vira Nilya.","Report to M'septha.","Obtain resin from the designated location.","Deliver the resin-filled jar to M'septha."],"dialogue":[{"name":"MSEPTHA","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Can you spare a moment?"},{"name":"MSEPTHA","text":"We'll be meeting to barter with the Ananta soon, and I'd like to surprise them with something more than our usual wares. Something special."},{"name":"MSEPTHA","text":"I'd like to find out what sorts of things they actually need, but they're like to discover my plans if I were to ask them directly. That's where you come in. I need you to go and speak with them for me."},{"name":"MSEPTHA","text":"No need to question <span class=\"emphasis\">everyone</span> in the village, of course. If you strike up conversation with even five of the Ananta I'm sure you'll learn plenty. Then I can see to preparing goods they'll truly enjoy."},{"name":"MSEPTHA","text":"Speaking with everyone at Vira Nilya would be overly ambitious. Five of the Ananta should be more than enough to figure out what they're looking for."},{"name":"JAYANTI","text":"Sssorry, but I have no time to talk. I must see to my sssisters' fencing lessons. "},{"name":"NANDINA","text":"Hm? We were dissscussing what to do about our upcoming meeting with the M tribe. I made a grievous error taking ssstock of our arrows. I fear we will come up short if sssomething is not done soon."},{"name":"MANIK","text":"I would give anything for a new pair of gloves. My ssskin is quite delicate, you see, and these gloves tend to chafe my arms. Sssadly the thread I need is not easy to come by."},{"name":"GARIMA","text":"Is my trouble written ssso plainly on my face? If you mussst know, I worry the poison we lace our arrows with is too potent."},{"name":"GARIMA","text":"One ssslip of the hand and we would be irreparably ssscarred, forever depriving the world of our unequaled beauty. Jussst the thought of it is too much to bear."},{"name":"PRAPTI","text":"Why do I ssseem so bothered? My sssisters are constantly fawning over me. “How are your ssscales so lussstrous and sssmooth?” “You mussst tell us where you get your rouge.” “I wish I had your hourglasss figure.” &lt;sigh&gt; It'sss not easy being beautiful."},{"name":"MSEPTHA","text":"Welcome back. I trust your talks with the Ananta were enlightening?"},{"name":"MSEPTHA","text":"I see. I didn't realize their stocks of supplies were so lacking. Anything else?"},{"name":"MSEPTHA","text":"The poison for their arrows is <span class=\"emphasis\">too</span> potent? I imagine such a potential irritant to the skin would prove troublesome when preparing their arrows. Especially given their aversion to anything that might blemish their skin."},{"name":"MSEPTHA","text":"I've got it! I will make them long gloves to protect against their poisons. They'll need a special coating, and I'll need your help to get it."},{"name":"MSEPTHA","text":"Take this container to East End and fill it with resin from the trees there. I will see to readying fabric for the gloves."},{"name":"MSEPTHA","text":"The resin from the trees of East End is quite resilient. The Ananta will have nothing to fear with gloves using that as a protective coating."},{"name":"SYSTEM","text":"You tap the tree, but it fails to yield any resin."},{"name":"MSEPTHA","text":"How did you fare at East End?"},{"name":"MSEPTHA","text":"Good, good. This is more than enough. The Ananta will be quite pleased."},{"name":"MSEPTHA","text":"You may be surprised to know that we've had altercations with the Ananta a time or two over territory disputes. Thankfully we've managed to settle things, and this bartering of goods helps maintain good relations. Thanks to you, we can keep doing just that."}],"reward":{"gil":731,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68069]}},"partials":[{"type":"npc","id":"1020804","obj":{"i":1020804,"n":"M'septha","l":2406,"q":1}},{"type":"npc","id":"1020818","obj":{"i":1020818,"n":"Garima","l":2406,"q":2}},{"type":"npc","id":"1020819","obj":{"i":1020819,"n":"Jayanti","l":2406,"q":2}},{"type":"npc","id":"1020820","obj":{"i":1020820,"n":"Nandina","l":2406,"q":1}},{"type":"npc","id":"1020821","obj":{"i":1020821,"n":"Prapti","l":2406,"q":2}},{"type":"npc","id":"1020823","obj":{"i":1020823,"n":"Manik","l":2406,"q":1}},{"type":"quest","id":"68069","obj":{"i":68069,"n":"The Silence of the Gods","g":6,"l":"The Fringes","s":930}}]}