{"quest":{"name":"Gold Rush","location":"The Fringes","id":68356,"patch":4.0,"sort":7050,"eventIcon":71221,"issuer":1020808,"target":1020808,"genre":104,"journal":["M'linhbo finds herself between a rock and a hard place."],"objectives":["Slay highland dharas, then defeat the gold dust dhara when it appears.","Report to M'linhbo."],"dialogue":[{"name":"MLINHBO","text":"Well, I'll be! You're the adventurer from Castellum Velodyna, aren't you? You put on quite a show down there. I'm sure you hear this all the time, but we could really use a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your talents right about now."},{"name":"MLINHBO","text":"Dharas have been croppin' up to the south of here, and they've been givin' us no small amount of trouble."},{"name":"MLINHBO","text":"We do what we can to keep 'em at bay, but every once in a while we'll come across a mountainous mess of gold-dusted rock that sends us runnin' with our tails between our legs. I imagine handlin' a few dharas would be like swattin' flies for you."},{"name":"MLINHBO","text":"If you go and tear down a few dharas, one of those golden monstrosities is bound to show up. Topplin' even one would go a long way to helpin' us take back our huntin' grounds."},{"name":"MLINHBO","text":"Just keep beatin' up the dharas, and those golden critters are sure to turn up. Be careful, though. They're like to be angry for you slayin' their kin."},{"name":"MLINHBO","text":"No need to explain. I saw the whole thing from here. You were every bit as amazin' as I had hoped."},{"name":"MLINHBO","text":"A shame those things are like to come back after a while. People say they're born from the spirits of warriors who've fallen in battle."},{"name":"MLINHBO","text":"Personally, I think it has somethin' to do with the aether around here, but I've been prayin' for an end to the war all the same. Take care, friend. I'll be cheerin' for you."}],"reward":{"gil":625,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68066]}},"partials":[{"type":"npc","id":"1020808","obj":{"i":1020808,"n":"M'linhbo","l":2406,"q":1}},{"type":"quest","id":"68066","obj":{"i":68066,"n":"Rising Fortunes, Rising Spirits","g":6,"l":"The Fringes","s":900}}]}