{"quest":{"name":"Eyes Bigger than Her Stomach","location":"The Fringes","id":68357,"patch":4.0,"sort":7060,"unlocksFunction":1,"eventIcon":71341,"issuer":1020807,"target":1020807,"genre":104,"journal":["M'zimzizi is fretting over the tribe's lack of food."],"objectives":["Use burlap sacks on weakened teleocerases.","Deliver the dinosaur-filled sacks to M'zimzizi."],"dialogue":[{"name":"MZIMZIZI","text":"...Hm? Oh, sorry. I was distracted by the grumbling of my stomach. Thanks to the Garleans, we've been having trouble maintaining our food stores."},{"name":"MZIMZIZI","text":"Custom dictates that any game brought back to the village must be distributed evenly amongst everyone, but there hasn't been much to go around lately."},{"name":"MZIMZIZI","text":"Without fear of harassment from the Garleans, we can finally begin hunting again, but there's still much to do if we're going to replenish our supplies. Any chance you'd be willing to help?"},{"name":"MZIMZIZI","text":"If you could bring back, say, three teleocerases, it would be a great help. You'll find them to the north of here, but don't kill them─we'll need their meat to be as fresh as possible when it's put away."},{"name":"MZIMZIZI","text":"When you've worn them down enough, you can stuff them into these bags without much of a fight. Now, I know what you're thinking, but trust me, they'll fit. Stay safe out there."},{"name":"MZIMZIZI","text":"The teleocerases aren't too far north of here. No need to push yourself too hard, though. We only need three."},{"name":"MZIMZIZI","text":"You're back! Do those bags contain what I think they do?"},{"name":"MZIMZIZI","text":"Wow, you really did it! Not that I didn't think you could, mind you. It's just been so long since anyone here's had the guts to contend with those beasts."},{"name":"MZIMZIZI","text":"You can be sure we'll make good use of them. Their meat for rations is a given, but their horns and bones will make good tools, and their hides can make belts and boots."},{"name":"MZIMZIZI","text":"Did you know the teleoceras isn't even native to these lands? The Garleans used them for carrying freights, but the sods couldn't keep them under control."},{"name":"MZIMZIZI","text":"A few of them escaped into the wilds, started breeding, and here we are."},{"name":"MZIMZIZI","text":"I guess you could say it's a blessing in disguise. If they hadn't brought teleocerases here, we'd have one less source of meat and materials for fashioning our tools."}],"reward":{"gil":625,"aetherCurrent":1,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68066]}},"partials":[{"type":"npc","id":"1020807","obj":{"i":1020807,"n":"M'zimzizi","l":2406,"q":1}},{"type":"quest","id":"68066","obj":{"i":68066,"n":"Rising Fortunes, Rising Spirits","g":6,"l":"The Fringes","s":900}}]}