{"quest":{"name":"In the Line of Duty","location":"Kugane","id":68350,"patch":4.0,"sort":7030,"eventIcon":71221,"issuer":1023326,"target":1023326,"involved":[1023327],"genre":107,"journal":["The face of an injured Sekiseigumi blade is twisted in pain."],"objectives":["Speak with the Sekiseigumi blade.","Use the milky white salve on the injured Sekiseigumi blade."],"dialogue":[{"name":"SAMURAIA02814","text":"Ugh... &lt;pant&gt; I must...get word to my brother. But these wounds... I cannot."},{"name":"SAMURAIA02814","text":"You... You don't look to be one of them. I take great risk trusting you, but I've no other choice. Nor the time. Please, hear me out."},{"name":"SAMURAIA02814","text":"I am a blade of the Sekiseigumi, and I &lt;wince&gt; came under attack by a foreign devil while on patrol. I fear my fellow blade may meet with the same fate if not warned."},{"name":"SAMURAIA02814","text":"I... I will survive. &lt;grunt&gt; But my Sekiseigumi brother must be told of this attack. He patrols an alley off Kogane Dori. Please, go with haste."},{"name":"SAMURAIA02814","text":"I... I will survive. &lt;grunt&gt; But my Sekiseigumi brother must be told of this attack. He patrols an alley off Kogane Dori. Please, go with haste."},{"name":"SAMURAIB02814","text":"What do you want of me?"},{"name":"SAMURAIB02814","text":"My brother blade? Attacked by a foreign devil? And one so skilled as to injure one of the Sekiseigumi's most gifted... Rushing after this fiend on my own would be rushing to my own death."},{"name":"SAMURAIB02814","text":"I would ask your help in this. Use this milky white salve on the injured Sekiseigumi blade that sent you to me. For my part, I will send for reinforcements from the barracks."},{"name":"SAMURAIA02814","text":"Did you see word to my brother blade?"},{"name":"SAMURAIA02814","text":"He sent you back with this salve? &lt;groan&gt; Thank you. And thank the gods he is safe."},{"name":"SAMURAIA02814","text":"Worry not. My pain is mostly gone. My apologies for pulling you into this. But I see now I was right to trust you."},{"name":"SAMURAIA02814","text":"As I told you, my attackers hail from across the seas. Violence is forbidden in Kugane, but those from abroad have little love for our laws."},{"name":"SAMURAIA02814","text":"My brother blade and I broke up their illicit dealings some time ago. No doubt they did not take kindly to that. My guess is they gathered their gil and hired an assassin."},{"name":"SAMURAIA02814","text":"Little did they know, we Sekiseigumi are not so easily killed. I hazard my brethren blades have already hunted these scoundrels down and gaoled them by now."},{"name":"SAMURAIA02814","text":"You did us a service this day. As one who wears the haori of the Sekiseigumi, on behalf of us all, I thank you."}],"reward":{"gil":590,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68061]}},"partials":[{"type":"npc","id":"1023326","obj":{"i":1023326,"n":"Injured Sekiseigumi Blade","l":2404,"q":1}},{"type":"npc","id":"1023327","obj":{"i":1023327,"n":"Sekiseigumi Blade","l":2404,"q":1}},{"type":"quest","id":"68061","obj":{"i":68061,"n":"The World Turned Upside Down","g":6,"l":"Yanxia","s":850}}]}