{"quest":{"name":"Unexpected Guests","location":"The Fringes","id":68352,"patch":4.0,"sort":7010,"unlocksFunction":1,"eventIcon":71341,"issuer":1020821,"target":1020821,"involved":[1021227,1021228,1021948],"genre":104,"journal":["Prapti is concerned someone is encroaching on Vira territory."],"objectives":["Head to the Vira hunting grounds.","Speak with the Vira bowmaid.","Speak with the strapping leader.","Report to Prapti."],"dialogue":[{"name":"PRAPTI","text":"Adventurer. I would asssk a favor of you."},{"name":"PRAPTI","text":"In recent days, strange men have been ssstealing prey from our hunting grounds. They appear to be Ala Mhigans, but they do not recognize usss as allies."},{"name":"PRAPTI","text":"They refuse to lisssten when we explain they are tressspassing. If they were to see another ssstrider in our company, they may not be so quick to fight and flee."},{"name":"PRAPTI","text":"They were lassst spotted to the east of here. Please, go and ssspeak with them, before anyone comes to harm."},{"name":"PRAPTI","text":"I've never ssseen Ala Mhigans react to us with sssuch hostility. I hope thisss can be resolved peacefully. "},{"name":"POP","text":"You are under attack!"},{"name":"BALLOON","text":"Look out! We've got company!"},{"name":"BOSS02816","text":"What in Rhalgr's name is that thing!?"},{"name":"ANANTATANK02816","text":"Please, wait! If you would listen for jussst a moment─"},{"name":"BOSS02816","text":"Ahhh! K-Keep that thing away from me!"},{"name":"ANANTATANK02816","text":"I fear they won't listen to anything I have to sssay."},{"name":"ANANTATANK02816","text":"Would you go after him and explain his people are tressspassing? I must tend to my wounds."},{"name":"BOSS02816","text":"You! You were tryin' to help that...that thing, weren't you? What do you want?"},{"name":"BOSS02816","text":"They only wanted us to leave their huntin' grounds? So they're <span class=\"emphasis\">not</span> savage monsters lookin' to feast on our innards?"},{"name":"BOSS02816","text":"I see... Erm, sorry about before. It's not every day you see somethin' like that where I come from."},{"name":"BOSS02816","text":"Me and my friends are from a small village in the Peaks, you see, and with the Garleans blockin' all ways in and out of the place, we'd never traveled far."},{"name":"BOSS02816","text":"Now that they're mostly gone, we thought we'd have a look about, maybe scavenge for a bit o' food."},{"name":"BOSS02816","text":"We didn't mean no harm, honest. If it's all the same to you, we'll leave and go look for food somewhere far, far away from here."},{"name":"PRAPTI","text":"My sssister tells me she was attacked. They are no doubt the sssame men from before. You mussst stop them, but please─do not hurt them."},{"name":"PRAPTI","text":"You are returned. Were they willing to lisssten?"},{"name":"PRAPTI","text":"Men from the Peaks? Interesssting. We were concerned the M tribe may have coerced them into ssstealing from our land. My sssisters will be relieved to hear this."},{"name":"PRAPTI","text":"If these people are desssperate enough to venture here for food, perhapsss we can help them. A deal of some kind."},{"name":"PRAPTI","text":"A share of our food stores in exchange for materials for our gemcrafting. Yesss, that would be a fair trade."},{"name":"PRAPTI","text":"I will need to dissscuss this with my sssisters. The beginning of a fruitful partnership may be at hand."}],"reward":{"gil":731,"aetherCurrent":1,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68067]}},"partials":[{"type":"npc","id":"1020821","obj":{"i":1020821,"n":"Prapti","l":2406,"q":2}},{"type":"npc","id":"1021227","obj":{"i":1021227,"n":"Vira Bowmaid","l":2406,"q":1}},{"type":"npc","id":"1021228","obj":{"i":1021228,"n":"Strapping Leader","l":2406,"q":1}},{"type":"npc","id":"1021948","obj":{"i":1021948,"n":"Strapping Leader","l":2406,"q":1}},{"type":"quest","id":"68067","obj":{"i":68067,"n":"The Lure of the Dream","g":6,"l":"The Fringes","s":910}}]}