{"quest":{"name":"The Weight of a Dream","location":"Kugane","id":68351,"patch":4.0,"sort":7040,"eventIcon":71221,"issuer":1023328,"target":1023328,"involved":[1023329],"genre":107,"journal":["A puissant porter in Kugane has grievously injured his shoulder."],"objectives":["Speak with the accomplished apothecary.","Deliver the pungent ginger poultice to the puissant porter."],"dialogue":[{"name":"TRANSPORTER02815","text":"I've need of aid, adventurer. It seems my shoulder has not taken kindly to this sack of rice. The pain is so great I can carry it no farther."},{"name":"TRANSPORTER02815","text":"But my fellow porters and I keep a close secret for such occasions. There is an accomplished apothecary just off Kogane Dori. He prepares a pungent ginger poultice that is nothing short of magic. He knows me, and that my gil is good. Tell him who sent you, and he will give you what I need."},{"name":"TRANSPORTER02815","text":"My fellow porters and I keep a close secret for such occasions. There is an accomplished apothecary just off Kogane Dori. He prepares a pungent ginger poultice that is nothing short of magic. He knows me, and that my gil is good. Tell him who sent you, and he will give you what I need."},{"name":"DRAGDEALER02815","text":"A pungent ginger poultice? If you're asking for that, it must be that porter who sent you. Sounds like he's gone and hurt that shoulder of his again. Always carrying more than any man should. "},{"name":"DRAGDEALER02815","text":"Here, then. Take this to him. Tell him he can pay for it later, and remind him that good health is true wealth."},{"name":"DRAGDEALER02815","text":"Tell the porter he can pay for his remedy later, and remind him that good health is true wealth."},{"name":"TRANSPORTER02815","text":"The pungent ginger poultice, did you bring it?"},{"name":"TRANSPORTER02815","text":"I must look for all Hingashi as a common maid. But know that my great grandfather was a great alchemist. It was he who first prepared one of these poultices. And so long as I have them, I can carry whatever needs carrying."},{"name":"TRANSPORTER02815","text":"It's said those abroad have acquired a taste for Kogane rice. More and more merchants sail here to buy it, and so more and more porters are busy carrying it. I knew the others would tell me to rest if I asked for their help. That is why I asked for yours."},{"name":"TRANSPORTER02815","text":"Who has time to rest? I've a dream to follow! I mean to claim a beautiful bride and open a tavern serving Kugane cuisine. And all while I'm still young. I'll not abide an aching shoulder to get in the way of getting gil while the getting is good."},{"name":"TRANSPORTER02815","text":"I've heard there's a lovely young lass at the next site I'm bound for. Might be I'm bearing the weight of my destiny in these grains of rice. Only time will tell. Thank you for your help, adventurer."}],"reward":{"gil":590,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68061]}},"partials":[{"type":"npc","id":"1023328","obj":{"i":1023328,"n":"Puissant Porter","l":2404,"q":1}},{"type":"npc","id":"1023329","obj":{"i":1023329,"n":"Accomplished Apothecary","l":2404,"q":1}},{"type":"quest","id":"68061","obj":{"i":68061,"n":"The World Turned Upside Down","g":6,"l":"Yanxia","s":850}}]}