{"quest":{"name":"Spooked","location":"The Fringes","id":68359,"patch":4.0,"sort":7080,"eventIcon":71221,"issuer":1020814,"target":1020814,"genre":104,"journal":["M'gizzoh is itching to go hunting."],"objectives":["Survey the designated location and slay any broken bhoots that appear.","Report to M'gizzoh."],"dialogue":[{"name":"MGIZZOH","text":"<span class=\"alternative-container\"><span class=\"alternative\">Nice night</span><span class=\"alternative\">Good day</span></span> for hunting isn't it? Especially now that the Garleans have turned tail and fled. Before you couldn't step foot from the Peering Stones without being dragged into a fight between them and the Resistance."},{"name":"MGIZZOH","text":"Now that we're back to our usual haunts, I've run into a bit of trouble. It seems in our absence a horde of bhoots have taken a liking to my favorite place to hunt."},{"name":"MGIZZOH","text":"They're always hiding on the cliff tops just out of range of my arrows, and swooping down when I'm not looking. Would that I had wings to fly up after them."},{"name":"MGIZZOH","text":"Word has it you have a knack for handling seemingly insurmountable problems. It'd mean the world to me if you could scale the cliffs southwest of here and do away with the bhoots."},{"name":"MGIZZOH","text":"You may not see them at first, but if you wait around long enough, they're sure to turn up. Be careful, though. They can be pretty nasty."},{"name":"MGIZZOH","text":"The bhoots are gone? So you did scale the cliffs! That's quite the feat."},{"name":"MGIZZOH","text":"A pity you're not part of our tribe. We could do with more capable hunters like you."},{"name":"MGIZZOH","text":"But what are ghosts doing there to begin with? By all rights they should be busy brooding about a cemetery somewhere."},{"name":"MGIZZOH","text":"Then again, Virdjala has seen more than its fair share of death lately. Hopefully any other spirits still lingering there will soon move on."}],"reward":{"gil":590,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68069]}},"partials":[{"type":"npc","id":"1020814","obj":{"i":1020814,"n":"M'gizzoh","l":2406,"q":1}},{"type":"quest","id":"68069","obj":{"i":68069,"n":"The Silence of the Gods","g":6,"l":"The Fringes","s":930}}]}