{"quest":{"name":"The Rose Blooms Twice","location":"The Fringes","id":68364,"patch":4.0,"sort":7130,"icon":100710,"unlocksFunction":1,"eventIcon":71341,"issuer":1021565,"target":1021565,"involved":[1023409,1023410],"genre":104,"journal":["M'rahz Nunh's furrowed brow suggests there may be trouble afoot.","M'rahz Nunh spoke again with the Vira regarding the death of M'aht. They have reason to believe the Qalyana were behind the stampede that claimed the former M tribe leader's life. In light of this news, their strange behavior in recent days has left M'rahz Nunh concerned. He asks that you travel to East End and see if the Qalyana are up to no good.","While surveying East End you happen upon a group of Qalyana assaulting what appears to be a Grand Company officer. You make short work of them and are surprised to see their prey was none other than Lieutenant Molkoh. Hopefully she is not seriously wounded.","Lieutenant Molkoh is no worse for wear, relieved that you arrived when you did. She was examining the great tree known as the Percipient One when the Qalyana assaulted her. To have ventured so far from their homes, she believes some clue to their plans must be nearby.","You and Lieutenant Molkoh are examining the inside of the Percipient One when a loud thud draws your attention outside. An Ananta of the Qalyana was trying to catch you unawares, but was thwarted by M'zhet Tia. He comes bearing more ill news from the Vira. As he explains it, the Qalyana were using a strange fruit found in East End to drive the wildlife into a frenzy to drive the M tribe from their village. Having recently discovered another container of Black Rose, Lieutenant Molkoh surmises the chemicals within have leaked into the soil, contaminating the tree and the fruit that grows from its branches. M'zhet decides to take the Ananta back to the Peering Stones for questioning, while Lieutenant Molkoh means to call in soldiers to dispose of the contaminated container. M'rahz Nunh will certainly wish to know of what transpired here.","M'rahz Nunh is shocked to hear the Vira's claims of the reclusive Qalyana tribe are true. He promises to deal with the Qalyana you detained earlier, but not before extracting from her any pertinent information that may ensure the M tribe's safety. With his people safe, and M'zhet Tia following in his father's footsteps, M'rahz Nunh is certain the future of the M tribe has never been brighter."],"objectives":["Search for the Qalyana at East End.","Aid Lieutenant Molkoh.","Search for clues.","Speak with M'rahz Nunh."],"dialogue":[{"name":"MRAHZNUN","text":"Ah, what fortuitous timing. I would ask a favor of you."},{"name":"MRAHZNUN","text":"I spoke again with the Vira regarding the death of M'aht, and heard a disturbing rumor as to why the beasts of Virdjala ran amok that fateful day. They believe the Qalyana were behind it."},{"name":"MRAHZNUN","text":"It's hard to believe such a reclusive tribe would do such a thing, but I would be foolish to doubt the word of the Vira."},{"name":"MRAHZNUN","text":"We must be certain, which is why I ask you seek the truth at the heart of this matter."},{"name":"MRAHZNUN","text":"Perhaps it is mere coincidence, but the Qalyana have been acting strange of late, leaving their borders to venture into East End."},{"name":"MRAHZNUN","text":"An ill wind blows across the Fringes. Please, you must find out what they are up to."},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"MRAHZNUN","text":"The Qalyana have always been content to remain within their borders. What could they be up to?"},{"name":"TAHLAMOLKOH","text":"Griffin's Bane! Oh, thank goodness you arrived. Twice now you've saved me from certain doom."},{"name":"TAHLAMOLKOH","text":"After completing my reports in Gridania, I thought it prudent to return and learn more about the history of this region. I was especially interested in this tree they call the Percipient One. It is revered as a source of great spiritual energy."},{"name":"TAHLAMOLKOH","text":"I was told this was a place of beauty before the Garleans arrived. Yet an air of gloom hangs over the place now."},{"name":"TAHLAMOLKOH","text":"I planned to investigate the degradation of the area, starting with this tree, when I was assaulted by the Qalyana. But what brings you here?"},{"name":"TAHLAMOLKOH","text":"You suspect they've been driving the beasts of Virdjala into a frenzy? Hmmm. Perhaps it's related to their strange behavior of late. At any rate, we should have a look around."},{"name":"TAHLAMOLKOH","text":"There has to be a reason why they came all this way. If the fates are kind they'll have left us a clue."},{"name":"SYSTEM","text":"A foul odor assaults your nostrils, but you find nothing out of the ordinary."},{"name":"SYSTEM","text":"Strange fumes are emanating from the roots of this tree."},{"name":"SYSTEM","text":"The fruit dangling from the branches are a sickly shade of green. It would be wise not to eat them."},{"name":"TAHLAMOLKOH","text":"Did you find anything?"},{"name":"TAHLAMOLKOH","text":"&lt;gasp&gt; I recognize these markings. This is a container of Black Rose! Twelve help us if any more samples yet remain."},{"name":"TAHLAMOLKOH","text":"You don't suppose the Qalyana hid this here, do you? What could they possibly want with it?"},{"name":"MZHETTIA","text":"(-Familiar Voice-)<span class=\"highlight\">Forename</span>! Are you unharmed?"},{"name":"MZHETTIA","text":"Don't look so surprised. Shooting a few arrows isn't <span class=\"emphasis\">that</span> difficult, even for me."},{"name":"MZHETTIA","text":"But that's not important. I come bearing news from M'rahz Nunh."},{"name":"MZHETTIA","text":"He went to meet with the Vira to offer them thanks for taking me in after my father's disappearance. It was there he learned an awful truth about the incident that claimed his life."},{"name":"MZHETTIA","text":"The Qalyana used a strange fruit to drive the beasts of Virdjala mad. The stampede was meant to drive out the M tribe so they could claim our lands as their own."},{"name":"TAHLAMOLKOH","text":"Strange fruit? Of course! The Percipient One!"},{"name":"TAHLAMOLKOH","text":"This is only a theory, mind you, but if the contents of that container leaked into the soil, it may have had adverse effects on the plant life here. It would certainly explain the condition of this tree."},{"name":"MZHETTIA","text":"Now that the Garleans no longer move freely through these woods, the Qalyana likely saw this as a chance to harvest the fruit, and finish what they started."},{"name":"MZHETTIA","text":"It's a plan that reeks of their people, never wanting to sully their own hands."},{"name":"MZHETTIA","text":"Thanks to you two, we can ensure it won't come to fruition."},{"name":"MZHETTIA","text":"I'd love nothing more than to avenge my father here and now, but... I know that's not what he'd want."},{"name":"MZHETTIA","text":"I'll take her back to the Peering Stones. M'rahz will know what to do with her."},{"name":"TAHLAMOLKOH","text":"I better go and contact Serpent Marshal Brookstone. We need to get men out here and dispose of that container."},{"name":"TAHLAMOLKOH","text":"Thank you again for all your help, <span class=\"highlight\">Forename</span>."},{"name":"TAHLAMOLKOH","text":"I hope our next meeting is under better circumstances."},{"name":"TAHLAMOLKOH","text":"This odor is strangely familiar..."},{"name":"MRAHZNUN","text":"Welcome back, my friend. Tell me, what did you find at East End?"},{"name":"MRAHZNUN","text":"My word! So what the Vira told me was true. I never thought it a concern that the Qalyana should seclude themselves. They always seemed so peaceful."},{"name":"MRAHZNUN","text":"Yet our carelessness nearly brought about the end of the M tribe."},{"name":"MRAHZNUN","text":"Well, we will not make that mistake again. I will deal with the Qalyana you captured after they tell us all they know."},{"name":"MRAHZNUN","text":"I'm honestly surprised to see M'zhet Tia chose to seek my counsel rather than deal with them himself. There is hope for him yet."},{"name":"MRAHZNUN","text":"Again we find ourselves in your debt. I foresee great things ahead for the M tribe, and I'm certain you have helped set us on the path to lasting prosperity."}],"reward":{"gil":1500,"items":[{"id":18572,"one":1,"hq":1},{"id":18573,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"questsType":"all","quests":[68069,68363]},"next":[68572]},"partials":[{"type":"npc","id":"1021565","obj":{"i":1021565,"n":"M'rahz Nunh","l":2406,"q":7}},{"type":"npc","id":"1023409","obj":{"i":1023409,"n":"Tahla Molkoh","l":2406,"q":1}},{"type":"npc","id":"1023410","obj":{"i":1023410,"n":"Tahla Molkoh","l":2406,"q":1}},{"type":"item","id":"18572","obj":{"i":18572,"n":"Azurite Bracelet of Healing","l":279,"c":55776,"t":42,"p":16395}},{"type":"item","id":"18573","obj":{"i":18573,"n":"Azurite Bracelet of Casting","l":279,"c":55776,"t":42,"p":16395}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68069","obj":{"i":68069,"n":"The Silence of the Gods","g":6,"l":"The Fringes","s":930}},{"type":"quest","id":"68363","obj":{"i":68363,"n":"Honoring Family","g":104,"l":"The Fringes","s":7120,"f":1}},{"type":"quest","id":"68572","obj":{"i":68572,"n":"Brooding Broodmother","g":52,"l":"The Fringes","s":1,"f":1}}]}