{"quest":{"name":"Make a Man Out of You","location":"The Fringes","id":68362,"patch":4.0,"sort":7110,"icon":100709,"unlocksFunction":1,"eventIcon":71341,"issuer":1023163,"target":1023164,"genre":104,"journal":["M'zhet Tia is ready to get into shape.","M'zhet Tia is determined to defeat M'rahz Nunh. Believing he has found the means to harden himself for battle, he bids you follow him to where he has been keeping to a safe location for training.","You arrive at your destination and notice a case that looks strangely familiar. M'zhet Tia tells you it contains grenades which he intends to use for training. Shocking though it may seem, he asks you to hurl the explosives at him. He braces himself as you take a grenade from the container.","You lob a grenade at M'zhet Tia. Much to your surprise─and perhaps his as well─he survives the blast. He suspects there may still be too much explosive powder in the grenades. Nevertheless, he bids you take another from the crate.","You notice M'zhet Tia tense up as you throw another grenade, and rightly so. He staggers from the impact, but again remains standing. He begins to doubt if he emptied out the grenades at all. Unwilling to back down, he asks you to hit him one more time.","The third grenade is too much for M'zhet Tia as he drops to his knees in pain. He is absolutely certain now he forgot to empty out the grenades' explosive powder.","M'zhet Tia is battered and bruised, but not beaten. Despite his appearance, he claims he is stronger than ever. Perhaps even strong enough to defeat M'rahz Nunh. After a short rest, that is."],"objectives":["Follow M'zhet Tia.","Throw a Mark XLII grenade at M'zhet Tia.","Throw another Mark XLII grenade at M'zhet Tia.","Speak with M'zhet Tia."],"dialogue":[{"name":"MZHETTIA","text":"Are you ready to whip me into shape?"},{"name":"MZHETTIA","text":"I've been thinking about how I need to improve, and I'm fairly certain fending off attacks is my weak point. After all, both you and M'rahz bested me with a single blow."},{"name":"MZHETTIA","text":"I think I have just the thing to practice defending myself. Follow me!"},{"name":"MZHETTIA","text":"Look what I found─Mark XLII grenades left behind by the Garleans. Can you believe it?"},{"name":"MZHETTIA","text":"Word has it you've dealt with them before, so I'm sure you know what these can do."},{"name":"MZHETTIA","text":"They'll be perfect for practicing my guard."},{"name":"MZHETTIA","text":"Now, take these grenades, and throw them at me. No need to worry─I've already emptied out most of their explosive powder."},{"name":"MZHETTIA","text":"Should've...&lt;cough&gt; &lt;cough&gt;...emptied them out a little more..."},{"name":"MZHETTIA","text":"Erm, I mean. That was nothing! Go ahead, toss another!"},{"name":"MZHETTIA","text":"No need to worry. I can take it."},{"name":"MZHETTIA","text":"&lt;cough&gt; Ugh! I think that one had more powder than the last one..."},{"name":"MZHETTIA","text":"N-Not that that's a bad thing, mind you! Hit me with another. I can take it!"},{"name":"MZHETTIA","text":"(I hope the next one is empty. That hurt!)"},{"name":"MZHETTIA","text":"Graaagh!"},{"name":"MZHETTIA","text":"..."},{"name":"MZHETTIA","text":"I... I must have forgotten to empty out the powder..."},{"name":"MZHETTIA","text":"&lt;pant&gt; &lt;pant&gt; You can do this, M'zhet. You can do this!"},{"name":"MZHETTIA","text":"B-But that just means the training will make me tougher! Why, I bet I could defeat M'rahz right now if I wanted."},{"name":"MZHETTIA","text":"Or perhaps...after a short break."}],"reward":{"gil":900,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"questsType":"all","quests":[68069,68361]},"next":[68363]},"partials":[{"type":"npc","id":"1023163","obj":{"i":1023163,"n":"M'zhet Tia","l":2406,"q":2}},{"type":"npc","id":"1023164","obj":{"i":1023164,"n":"M'zhet Tia","l":2406,"q":2}},{"type":"quest","id":"68069","obj":{"i":68069,"n":"The Silence of the Gods","g":6,"l":"The Fringes","s":930}},{"type":"quest","id":"68361","obj":{"i":68361,"n":"Down but Not Out","g":104,"l":"The Fringes","s":7100,"f":1}},{"type":"quest","id":"68363","obj":{"i":68363,"n":"Honoring Family","g":104,"l":"The Fringes","s":7120,"f":1}}]}