{"quest":{"name":"A Sister's Ambition","location":"The Peaks","id":68369,"patch":4.0,"sort":8040,"eventIcon":71221,"issuer":1021587,"target":1021587,"involved":[1023255],"genre":105,"journal":["J'nairoh is concerned about her sister."],"objectives":["Search for the J tribe youngling.","Aid the J tribe youngling.","Speak to J'nairoh."],"dialogue":[{"name":"JNAIROH","text":"Hey, you're one of those adventurers everyone's been talking about, right? I have a small favor to ask, if you'd be so kind."},{"name":"JNAIROH","text":"Ever since the Resistance showed up, my sister's been running off to go train with spears, talking about becoming a lancer. I'd hoped it was just a phase, but she's been returning home later and later. "},{"name":"JNAIROH","text":"As a matter of fact, it's almost time for us to get to working at the tavern and she's not back yet. She's never been late before, and I'm starting to worry. Do you think you could find her, and make sure she's okay?"},{"name":"JNAIROH","text":"She always practices close to home, so I doubt she could've gone far. Please find her for me."},{"name":"JASISTER02833","text":"&lt;pant&gt; &lt;pant&gt; Thank you..."},{"name":"JASISTER02833","text":"My sister!? Oh no, have I been gone that long? I know she worries, but if I'm to improve with a lance I need to practice."},{"name":"JASISTER02833","text":"I've actually been at this longer than she thinks. We obviously couldn't handle weapons when the Garleans were still about, but I was quite fierce with a broomstick. I worked at it every day."},{"name":"JASISTER02833","text":"My mother would always boast about my aunt being the greatest lancer in all the realm. If I were that strong, then maybe...maybe I could have saved her."},{"name":"JASISTER02833","text":"I still have much training to do, but I swear on my spear no one will ever harm the people of Ala Ghiri ever again."},{"name":"JNAIROH","text":"My sister's returned home! Thank you so much for finding her."},{"name":"JNAIROH","text":"She told me about her plans, wanting to follow in the footsteps of our aunt. The Hellfire Phoenix, they called her."},{"name":"JNAIROH","text":"Before I was born, she led others away from Gyr Abania to escape subjugation by the Garleans. From what I've heard she was incredibly brave, with a strong sense of justice."},{"name":"JNAIROH","text":"If my mother hadn't been pregnant with me, she likely would have left with her. &lt;sigh&gt; I sometimes wonder if she regretted not going."},{"name":"JNAIROH","text":"Now it seems my sister may someday leave as well. And someday I'll have tales to tell my children of their aunt's adventures in a distant land. Just like my mother..."},{"name":"JNAIROH","text":"Goodness, listen to me and my crazed ramblings. You pay no attention to me. We'll be just fine."}],"reward":{"gil":667,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68071]},"next":[68376]},"partials":[{"type":"npc","id":"1021587","obj":{"i":1021587,"n":"J'nairoh","l":2407,"q":4}},{"type":"npc","id":"1023255","obj":{"i":1023255,"n":"J Tribe Youngling","l":2407,"q":1}},{"type":"quest","id":"68071","obj":{"i":68071,"n":"Strong and Unified","g":6,"l":"The Peaks","s":950}},{"type":"quest","id":"68376","obj":{"i":68376,"n":"Runs in the Family","g":105,"l":"The Peaks","s":8150}}]}