{"quest":{"name":"Like a Charm","location":"The Peaks","id":68368,"patch":4.0,"sort":8030,"eventIcon":71221,"issuer":1023330,"target":1023330,"genre":105,"journal":["This lonesome lass needs an adventurer with courage."],"objectives":["Survey the designated location and slay the stray gazelle for its horn.","Deliver the gazelle horn to the lonesome lass."],"dialogue":[{"name":"FLOWERVENDOR02832","text":"By the look of those strange garments, I take it you're an adventurer? If you've a little time to spare, I could sure use your help."},{"name":"FLOWERVENDOR02832","text":"I was hoping to make a charm for a friend of mine, and I desperately need the horn of a gazelle. They're not easy to come by here in Ala Ghiri, and I could never hunt one on my own. For an adventurer like yourself, I bet it'd be as easy as kicking rocks."},{"name":"FLOWERVENDOR02832","text":"Normally you'd need to travel pretty far to even find a gazelles, but I've heard a stray was spotted near Miriam's Luck."},{"name":"FLOWERVENDOR02832","text":"I don't have much, but I'll gladly pay you for its horns if you can find it."},{"name":"FLOWERVENDOR02832","text":"The officers said they spotted a gazelle near Miriam's luck. I pray it's still there."},{"name":"FLOWERVENDOR02832","text":"Was it true? Was there really a gazelle up there?"},{"name":"FLOWERVENDOR02832","text":"Oh, this is wonderful. Thank you! She's going to love the charm I make with this."},{"name":"FLOWERVENDOR02832","text":"They say the horns of the gazelle are a symbol of strength, you know. She'll need it where she's headed."},{"name":"FLOWERVENDOR02832","text":"With Ala Ghiri finally liberated from the Garleans, she intends to move to Ul'dah and start a business."},{"name":"FLOWERVENDOR02832","text":"I could never do something so bold. After everything we've been through, the world seems like such a scary place. If fate should curse me to be taken by the Garleans again, I'd...I'd..."},{"name":"FLOWERVENDOR02832","text":"Never mind me. She's always been the brave one, and I know she'll be fine. Still, I'll feel better knowing she has my charm with her."}],"reward":{"gil":595,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68071]}},"partials":[{"type":"npc","id":"1023330","obj":{"i":1023330,"n":"Lonesome Lass","l":2407,"q":1}},{"type":"quest","id":"68071","obj":{"i":68071,"n":"Strong and Unified","g":6,"l":"The Peaks","s":950}}]}