{"quest":{"name":"Undeserved Praise","location":"The Peaks","id":68367,"patch":4.0,"sort":8020,"eventIcon":71221,"issuer":1021593,"target":1021593,"involved":[1023180,1023181,1023182],"genre":105,"journal":["Odo needs someone to pass on a message."],"objectives":["/congratulate the storm officer.","/congratulate the serpent officer.","/pray for the fallen soldier.","Speak with Odo."],"dialogue":[{"name":"ODO","text":"Wait, I know you. <span class=\"highlight\">Forename Surname</span>! Well, this is certainly a welcome surprise. If you don't mind my imposing, I'd like to ask a favor of you."},{"name":"ODO","text":"As you're well aware, the battle at Rhalgr's Reach was gruesome, with heavy losses on both sides. If what I've been told is true, our losses would have been far greater, if not for one brave soul."},{"name":"ODO","text":"He was only a messenger for the Alliance meant to relay information to our commanders, yet he went above and beyond the call of duty seeing the wounded to safety, all the while fending off enemy attacks."},{"name":"ODO","text":"Such heroism is worthy of great praise, and I would thank him myself if I weren't preoccupied with my duties."},{"name":"ODO","text":"They say he's come to Ala Ghiri, and so I would ask you to <span class=\"highlight\">congratulate</span> him in my stead, as well as the officer who trained such a truehearted soldier."},{"name":"ODO","text":"You'll go and congratulate him for me, won't you? I can only hope he hasn't already left Ala Ghiri."},{"name":"MAELSTROMGENERAL","text":"Unless there's something I can help you with, I must ask that you move along."},{"name":"MAELSTROMGENERAL","text":"What's this? I don't recall doing anything worthy of praise..."},{"name":"MAELSTROMGENERAL","text":"With all due respect, you are mistaken. It was a unit of the Twin Adder that was charged with relaying communications to Alliance commanders. I believe a few of their officers are still stationed at Goodblade if you wish to speak with them."},{"name":"MAELSTROMGENERAL","text":"If this soldier did all you claim he truly is deserving of praise. If you wish to speak with him, a few Twin Adder officers should still be stationed at Goodblade."},{"name":"TWINADDERGENERAL","text":"Greetings, adventurer. Is there something I can help you with? If so, please speak up."},{"name":"TWINADDERGENERAL","text":"Hm? Is there some cause for celebration I'm not aware of?"},{"name":"TWINADDERGENERAL","text":"I see... Yes, I do recall a man from my unit being assigned that position. Unfortunately I was stationed at Castrum Oriens at the time, so I cannot say for certain who it was."},{"name":"TWINADDERGENERAL","text":"My subordinates would know who it is you seek. However, they are to return home after one final patrol around Ala Ghiri. If you go now, perhaps you can speak with one of them before they leave."},{"name":"TWINADDERGENERAL","text":"My subordinates will be leaving for home after a last patrol of Ala Ghiri. If you wish to speak with them, you should go now."},{"name":"TWINADDERSOLDIER","text":"Please leave... I need to be alone."},{"name":"TWINADDERSOLDIER","text":"I said leave, damn you! Why do you insist on showering me with unwarranted gratitude?"},{"name":"TWINADDERSOLDIER","text":"Yes, I was there at Rhalgr's Reach, but I was barely able to escape with my life, let alone save another's."},{"name":"TWINADDERSOLDIER","text":"I'm afraid the man you're looking for isn't here. Such a brave soul, that one. Our mission was done yet he chose to stay on the front lines and save as many as he could. If not for his injuries, he...he would have..."},{"name":"TWINADDERSOLDIER","text":"The man died a hero, though I doubt anyone will ever know it. All we can do now is <span class=\"highlight\">pray</span> he finds peace in the great beyond."},{"name":"SYSTEM","text":"You have arrived too late to offer your praise. However, it is not too late to offer your respects with a solemn prayer."},{"name":"SYSTEM","text":"The wind gently whispers as if in response to your prayer."},{"name":"ODO","text":"How fares the unsung hero of Rhalgr's Reach?"},{"name":"ODO","text":"Oh... Oh, I see. Sorry to hear that. I'll have to go pay my respects later."},{"name":"ODO","text":"It's a terrible tragedy to lose such a fine soldier, but through his sacrifice a great many will live to keep fighting the good fight."},{"name":"ODO","text":"We will carry on in his stead, and someday bring a lasting peace to the realm."}],"reward":{"gil":810,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68071]}},"partials":[{"type":"npc","id":"1021593","obj":{"i":1021593,"n":"Odo","l":2407,"q":1}},{"type":"npc","id":"1023180","obj":{"i":1023180,"n":"Storm Officer","l":2407,"q":1}},{"type":"npc","id":"1023181","obj":{"i":1023181,"n":"Serpent Officer","l":2407,"q":1}},{"type":"npc","id":"1023182","obj":{"i":1023182,"n":"Serpent Officer","l":2407,"q":1}},{"type":"quest","id":"68071","obj":{"i":68071,"n":"Strong and Unified","g":6,"l":"The Peaks","s":950}}]}