{"quest":{"name":"Down but Not Out","location":"The Fringes","id":68361,"patch":4.0,"sort":7100,"icon":100709,"unlocksFunction":1,"eventIcon":71341,"issuer":1023161,"target":1023163,"involved":[1021565,1023162],"genre":104,"journal":["M'zhet Tia looks ready to fight.","Inspired by your display of skill against the gazelle, M'zhet Tia rushes off to go and defeat M'rahz Nunh. Not wanting to miss the battle, you follow him back to the Peering Stones.","You arrive to find M'zhet Tia on the ground, writhing in pain. As he finds the strength to stand and take his leave, M'rahz Nunh stops him to ask why he is so insistent on becoming nunh. M'zhet Tia accuses him of stealing the title from his father, after which they were forced to leave the tribe when he was a child. He goes on to say his father abandoned him, and believes it would not have happened if not for M'rahz Nunh. The M tribe leader is shocked to hear all of this, as he had not seen M'zhet Tia or his father since they left the tribe all those years ago. He claims M'zhet Tia's father relinquished the title willingly, but is bewildered as to why he would abandon his son. He asks to take M'zhet Tia with you and investigate M'aht Nunh's disappearance.","Recounting the shame of his past has reaffirmed M'zhet Tia's resolve to defeat M'rahz Nunh and become leader of the M tribe. He pleads with you to continue his training that he might challenge the M tribe leader once more."],"objectives":["Follow M'zhet Tia.","Speak with M'zhet Tia."],"dialogue":[{"name":"MZHETTIA","text":"Alright, I think I'm ready!"},{"name":"MZHETTIA","text":"The title of nunh is as good as mine!"},{"name":"MZHETTIA","text":"&lt;groan&gt; Not again..."},{"name":"MZHETTIA","text":"Why am I so weak!?"},{"name":"MRAHZNUN","text":"Do you not tire of this fool's errand? Tell me, why is it you seek the title of nunh?"},{"name":"MZHETTIA","text":"My father was nunh of the M tribe, until his title was stolen and we were driven out of the village."},{"name":"MZHETTIA","text":"Then, just when I thought things were at their worst, he...he abandoned me!"},{"name":"MZHETTIA","text":"This is <span class=\"emphasis\">your</span> fault! If you hadn't taken away his title, he'd still be here!"},{"name":"MZHETTIA","text":"I'll rip you limb from limb for it if I have to. You wait and see!"},{"name":"MRAHZNUN","text":"His father was nunh as well?"},{"name":"MRAHZNUN","text":"There was a time when the M tribe was led by two nunhs. In the common tongue it is often interpreted as chief of the tribe, but first and foremost we are a father to our people."},{"name":"MRAHZNUN","text":"When our hunting grounds are vast and children many, it is sometimes necessary to have a second nunh as we once did. After the Garleans invaded, however, our lands diminished as did our numbers."},{"name":"MRAHZNUN","text":"We agreed only a single nunh was needed. Under normal circumstances, we would do battle, the loser abdicating their title."},{"name":"MRAHZNUN","text":"But his father relinquished it willingly, and left with him from the Peering Stones."},{"name":"MRAHZNUN","text":"We never heard from him again. M'zhet, son of M'aht. After all these years he returns. But why would his father leave him to survive on his own?"},{"name":"MRAHZNUN","text":"Perhaps there is someone among our people or the Ananta who know what became of him."},{"name":"MRAHZNUN","text":"Take M'zhet with you and see what you can discern of his father's whereabouts. You're like to find him near the southern edge of Virdjala."},{"name":"MRAHZNUN","text":"His spirit burns bright as ever, but he will need more than spirit if he wishes to lead."},{"name":"MZHETTIA","text":"I wish you hadn't seen that. What a bloody mess I was."},{"name":"MZHETTIA","text":"None of this would be happening if my father were still here. It wasn't easy growing up on my own."},{"name":"MZHETTIA","text":"Once I become nunh, though, I'll finally get the respect and admiration I deserve."},{"name":"MZHETTIA","text":"I beg of you: help me defeat M'rahz."},{"name":"MRAHZNUN","text":"I pray you find M'aht, or at least learn what has become of him."}],"reward":{"gil":800,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"questsType":"all","quests":[68069,68360]},"next":[68362]},"partials":[{"type":"npc","id":"1023161","obj":{"i":1023161,"n":"M'zhet Tia","l":2406,"q":2}},{"type":"npc","id":"1023163","obj":{"i":1023163,"n":"M'zhet Tia","l":2406,"q":2}},{"type":"npc","id":"1021565","obj":{"i":1021565,"n":"M'rahz Nunh","l":2406,"q":7}},{"type":"npc","id":"1023162","obj":{"i":1023162,"n":"M'zhet Tia","l":2406,"q":1}},{"type":"quest","id":"68069","obj":{"i":68069,"n":"The Silence of the Gods","g":6,"l":"The Fringes","s":930}},{"type":"quest","id":"68360","obj":{"i":68360,"n":"A New Contender","g":104,"l":"The Fringes","s":7090,"f":1}},{"type":"quest","id":"68362","obj":{"i":68362,"n":"Make a Man Out of You","g":104,"l":"The Fringes","s":7110,"f":1}}]}