{"quest":{"name":"A New Contender","location":"The Fringes","id":68360,"patch":4.0,"sort":7090,"icon":100709,"unlocksFunction":1,"eventIcon":71341,"issuer":1021565,"target":1023161,"involved":[1023160],"genre":104,"journal":["M'rahz Nunh is in need of a skilled warrior.","An unruly young Seeker of the Sun has been challenging M'rahz Nunh to combat without cease, each attempt more futile than the last. While most would find these duels to be an annoyance, M'rahz Nunh sees this persistence as admirable. That is why he asks you to train this would-be warrior. He says your new student can be found idling about Virdjala.","The young Miqo'te scoffs at the idea of you instructing him, and a fight between the two of you quickly ensues. When you defeat him with a single blow, however, he concedes to your offer, introducing himself as M'zhet. Before you begin training him, he wishes to observe your fighting form, suggesting you pit yourself against a gazelle. To that end, he sets off in search of your prey.","You find a gazelle and promptly defeat it with a display of skill befitting your reputation. M'zhet has no doubt been enlightened after watching you fight.","Bearing witness to your battle against the gazelle has left M'zhet duly inspired. So much so, he is confident he can defeat M'rahz Nunh at this very moment. But first, he would ponder his plan of attack."],"objectives":["Speak with the swaggering Seeker of the Sun.","Survey the specified location and defeat the gazelle. ","Speak with M'zhet Tia."],"dialogue":[{"name":"MRAHZNUN","text":"Ah, <span class=\"highlight\">Forename</span>. Might I trouble you for a moment of your time?"},{"name":"MRAHZNUN","text":"In recent days, a young Seeker of the Sun has seen fit to issue me several challenges to combat."},{"name":"MRAHZNUN","text":"I can only assume he means to assume the role of nunh and leader of our people. Tradition dictates the strongest among us must take the position, so I gladly face any who believe they are fit to lead."},{"name":"MRAHZNUN","text":"The problem, however, is this challenger is decidedly weak. Yet no matter how many times I put him down, he refuses to concede."},{"name":"MRAHZNUN","text":"His invitations to duel were a mild annoyance at first, but I've come to find his single-minded determination to be intriguing. In fact, I was hoping you would consider training him."},{"name":"MRAHZNUN","text":"I realize how absurd it sounds to help my rival-to-be, but I am curious of his potential. If you would take him under your wing, he's likely loitering about Virdjala. Safe travels."},{"name":"MZHETTIA","text":"(-Swaggering Seeker of the Sun-)You! You're that adventurer that's been sauntering about the village. What do you want?"},{"name":"MZHETTIA","text":"(-Swaggering Seeker of the Sun-)M'rahz asked you to train me? Hmph! I don't need his pity, and I certainly don't need you!"},{"name":"MZHETTIA","text":"(-Swaggering Seeker of the Sun-)And I'll prove it! After I beat you bloody, I'll defeat M'rahz and take my rightful place as nunh!"},{"name":"MZHETTIA","text":"(-Swaggering Seeker of the Sun-)Damn it all! Why? Why am I so weak!?"},{"name":"MZHETTIA","text":"(-Swaggering Seeker of the Sun-)...Alright, fine!"},{"name":"MZHETTIA","text":"(-Swaggering Seeker of the Sun-)If you mean to train me, then...then get on with it! That's what you came here for, isn't it?"},{"name":"MZHETTIA","text":"(-Swaggering Seeker of the Sun-)Good. After a few lessons from you, M'rahz'll wish he never sent you to me."},{"name":"MZHETTIA","text":"(-Swaggering Seeker of the Sun-)I refuse to end up like my father. I <span class=\"emphasis\">will</span> become stronger, even if it means accepting help from my enemy."},{"name":"MZHETTIA","text":"(-M'zhet Tia-)...Where were we? Ah, I should probably introduce myself. You can call me M'zhet."},{"name":"MZHETTIA","text":"(-M'zhet Tia-)Now, how about you show me what you can do?"},{"name":"MZHETTIA","text":"(-M'zhet Tia-)H-Hold on a minute! I didn't mean I want to fight again! I want to observe, preferably from a safe distance."},{"name":"MZHETTIA","text":"(-M'zhet Tia-)Hmmm... A gazelle would make for a good fight, and they graze near by."},{"name":"MZHETTIA","text":"(-M'zhet Tia-)Let's be off."},{"name":"MRAHZNUN","text":"There was a time when I was the weakest of the males in the M tribe. It wasn't easy, but through rigorous training, I eventually grew to become the man you see before you."},{"name":"MRAHZNUN","text":"I see much of myself in that young Miqo'te. Our tribe could stand to have more like him."},{"name":"MZHETTIA","text":"They should be close by. Do you see anything?"},{"name":"MZHETTIA","text":"Well, now I can see why my beating earlier was so swift. I feel stronger just for having watched you fight."},{"name":"MZHETTIA","text":"Maybe I can put some of those moves to use against M'rahz. I need a moment to think."}],"reward":{"gil":800,"xp":112050},"reqs":{"jobs":[{"lvl":67,"id":34}],"quests":[68069]},"next":[68361]},"partials":[{"type":"npc","id":"1021565","obj":{"i":1021565,"n":"M'rahz Nunh","l":2406,"q":7}},{"type":"npc","id":"1023161","obj":{"i":1023161,"n":"M'zhet Tia","l":2406,"q":2}},{"type":"npc","id":"1023160","obj":{"i":1023160,"n":"Swaggering Seeker Of The Sun","l":2406,"q":1}},{"type":"quest","id":"68069","obj":{"i":68069,"n":"The Silence of the Gods","g":6,"l":"The Fringes","s":930}},{"type":"quest","id":"68361","obj":{"i":68361,"n":"Down but Not Out","g":104,"l":"The Fringes","s":7100,"f":1}}]}