{"quest":{"name":"Back to Business","location":"The Peaks","id":68365,"patch":4.0,"sort":8010,"eventIcon":71221,"issuer":1021591,"target":1021591,"genre":105,"journal":["Gerbod is looking to return to his craft."],"objectives":["Search for worn artisan's tools.","Deliver the worn artisan's tools to Gerbod."],"dialogue":[{"name":"GERBOD","text":"Well, you've the look of a capable <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> who don't blink in the face o' danger. Might you be willin' to help a man down on his luck?"},{"name":"GERBOD","text":"I used to be a carpenter, you see, an' I made my livin' fixin' the wagons of all the caravans what used to pass through Ala Ghiri. When the Garleans took over, the merchants fled, along with all my business."},{"name":"GERBOD","text":"I did what I could to make ends meet after that, but now that we're free o' those imperial dogs, I'd like to dust off my tools an' do what I can to help the resistance."},{"name":"GERBOD","text":"Trouble is, my tools aren't here─I hid them away at Goodblade, or what's left of it. I'd go myself, but the place has been overrun with all manner of unsightly creatures. I'd never make it out o' there alive."},{"name":"GERBOD","text":"That's where you come in. I want you to check the crates there an' bring back any o' my tools you can find. I'm countin' on you."},{"name":"GERBOD","text":"I hid my tools all over, so I'm afraid you'll have to do a bit o' searchin'. At the time I thought it a good idea not to put all my eggs─or I guess in this case, my tools─in one basket."},{"name":"SYSTEM","text":"You find a worn artisan's tool inside the splintered crate."},{"name":"SYSTEM","text":"You find a worn artisan's tool inside the rotting barrel."},{"name":"SYSTEM","text":"You look inside the rotting barrel, but find nothing."},{"name":"GERBOD","text":"Any luck out there?"},{"name":"GERBOD","text":"By the gods, you found 'em!"},{"name":"GERBOD","text":"Ah, this takes me back. I miss the hustle an' bustle this place used to be known for."},{"name":"GERBOD","text":"There was a time when all the trade between Ul'dah an' the Near East passed through these streets. An endless procession o' caravans, an' I made sure those wagons were in tip-top shape to make their journey."},{"name":"GERBOD","text":"Soon enough the Resistance'll get things back to the way they were, an' you can bet your left leg I'll help 'em any way I can."}],"reward":{"gil":631,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68071]}},"partials":[{"type":"npc","id":"1021591","obj":{"i":1021591,"n":"Gerbod","l":2407,"q":5}},{"type":"quest","id":"68071","obj":{"i":68071,"n":"Strong and Unified","g":6,"l":"The Peaks","s":950}}]}