{"quest":{"name":"Runs in the Family","location":"The Peaks","id":68376,"patch":4.0,"sort":8150,"eventIcon":71221,"issuer":1021587,"target":1021587,"involved":[1023331,1023332],"genre":105,"journal":["J'nairoh would like to thank you for your help."],"objectives":["Speak with the J tribe youngling.","Rendezvous with the J tribe youngling and slay any mating kongamato that appear.","Speak with the J tribe youngling.","Speak with J'nairoh."],"dialogue":[{"name":"JNAIROH","text":"There you are! Everyone's talking about the brave adventurer who fought at the battle of Castellum Velodyna. I had no idea that was you. I can't thank you enough for what you've done for us, and for my sister."},{"name":"JNAIROH","text":"Speaking of which, she's been looking for you. Probably to thank you again for rescuing her."},{"name":"JNAIROH","text":"I think she's over by the north eastern gate if you care to have a look."},{"name":"JNAIROH","text":"I'm fairly certain my sister was near the north eastern gate."},{"name":"JASISTER02833","text":"Ah, I'm glad you've come."},{"name":"JASISTER02833","text":"My sister was quite upset with me before, and rightfully so. I promised her I won't run off alone and put myself in danger, which is why I need your help."},{"name":"JASISTER02833","text":"I mean to slay a group of kongamato nesting nearby, but not merely for training. No, this is for the good of all of Ala Ghiri."},{"name":"JASISTER02833","text":"They've begun breeding, laying eggs in the watering hole north of here. If they continue, they'll ruin one of the few sources of water we have. Come, we must put an end to them."},{"name":"JASISTER02833","text":"That's twice now you've saved me. It took everything I had to slay even one."},{"name":"JASISTER02833","text":"At least now the watering hole is safe. Let's return to Ala Ghiri."},{"name":"JASISTER02833","text":"You were amazing back there. It reminded me of all those stories about my aunt."},{"name":"JASISTER02833","text":"A shame not all of the J tribe think so highly of her. They say she abandoned her home and the tribe, but I don't believe she would do such a thing. Not if there was another way."},{"name":"JASISTER02833","text":"I know she would have stayed if there was. She would have fought and protected us all. One day I'll be strong enough to do what she couldn't."},{"name":"JASISTER02833","text":"My loved ones will never need fear the Garleans, or anyone else ever again."},{"name":"JASISTER02833","text":"My sister can yell at me until she's blue in the face, but I refuse to give up."},{"name":"JASISTER02833","text":"That said, I'm like to stumble a few times along the way. I hope I can look to you again for help if I need it."},{"name":"JNAIROH","text":"Did you find her?"},{"name":"JNAIROH","text":"So she's involved you in more trouble, has she? Well, I can't get mad at her for protecting the watering hole."},{"name":"JNAIROH","text":"&lt;sigh&gt; I keep forgetting my little sister isn't quite so little anymore. And it seems a knack for fighting runs in the family."},{"name":"JNAIROH","text":"Speaking of which, curiosity got the better of me, and I asked a few of the soldiers if they knew aught of my aunt."},{"name":"JNAIROH","text":"They say a woman matching her description works closely with a man named Arenvald. I plan to send her a letter, asking her to come bid her sister a final farewell."},{"name":"JNAIROH","text":"If my sister finds out, she's like to run off in search of her. I hope she doesn't, but I can't stop her from living her own life. Should that day come, I'll just have to...to..."},{"name":"JNAIROH","text":"Ahem. Sorry about that. Don't let me keep you with these sob stories. I'm sure my sister will be fine."}],"reward":{"gil":810,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"questsType":"all","quests":[68077,68369]}},"partials":[{"type":"npc","id":"1021587","obj":{"i":1021587,"n":"J'nairoh","l":2407,"q":4}},{"type":"npc","id":"1023331","obj":{"i":1023331,"n":"J Tribe Youngling","l":2407,"q":1}},{"type":"npc","id":"1023332","obj":{"i":1023332,"n":"J Tribe Youngling","l":2407,"q":1}},{"type":"quest","id":"68077","obj":{"i":68077,"n":"The Path Forward","g":6,"l":"The Peaks","s":1010}},{"type":"quest","id":"68369","obj":{"i":68369,"n":"A Sister's Ambition","g":105,"l":"The Peaks","s":8040}}]}