{"quest":{"name":"We Need to Talk","location":"The Peaks","id":68372,"patch":4.0,"sort":8120,"eventIcon":71221,"issuer":1023256,"target":1023256,"involved":[1021586,1021591,1021595,1023257],"genre":105,"journal":["This Resistance fighter could use some help bringing people together."],"objectives":["Deliver forum invitations to residents of Ala Ghiri.","Report to the Resistance fighter."],"dialogue":[{"name":"LIBERATOR02836","text":"You don't look like you're from around here. This may sound strange, but I could use the help of a stranger right about now."},{"name":"LIBERATOR02836","text":"Seeing as our troops are going to be stationed here for the foreseeable future, I'd like to have a sit down of sorts with the people of Ala Mhigo. Hear their grievances, see what we can do to be as unintrusive as possible, that sort of thing."},{"name":"LIBERATOR02836","text":"The few people I've tried to speak with on the matter have been unreceptive, and I suspect as long as it's a soldier asking, the responses will all be the same."},{"name":"LIBERATOR02836","text":"They'd have no reason to turn you away, though. Would you hand out a few of these invitations, and perhaps ask them why people are so leery of us?"},{"name":"LIBERATOR02836","text":"Hopefully they'll accept the invitation coming from you. I'd very much like to know what we can do to improve things around here."},{"name":"GERBOD","text":"Somethin' I can help you with, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>?"},{"name":"GERBOD","text":"Talks with the Resistance? O' course I'll go. After all they've done for Ala Ghiri, the least we can do is hear what they have to say."},{"name":"GERBOD","text":"Just name the time an' I'll be there."},{"name":"JGHONAKO","text":"Why hello there, sweetl─ Wait...you're not here for my services, are you?"},{"name":"JGHONAKO","text":"An invitation to talks with the Resistance, eh? Mayhaps I can pick up new clientele while I'm there."},{"name":"JGHONAKO","text":"My coffers have been running a bit dry ever since the Garleans left. Not that I enjoyed their company, mind you. I did what I had to do to get by. The Resistance, however, is a different story. I'll gladly offer my services to the brave men and women who fought to save our home."},{"name":"JGHONAKO","text":"I look forward to getting to know the good men and women of the Resistance."},{"name":"ALDRUTH","text":"Oh, an adventurer. What can I do for you?"},{"name":"ALDRUTH","text":"Speak with the Resistance? ...If it's all the same to you, I'd rather not."},{"name":"ALDRUTH","text":"I'm grateful for what they've done, truly I am. But I've lost too many to this fighting with the Garleans. They're like to run off and get killed just as we're getting to be friends, and my heart simply can't take it anymore."},{"name":"ALDRUTH","text":"I'm sorry, but I can't see myself attending any meetings with the Resistance."},{"name":"CIVILIAN02836","text":"Can I help you?"},{"name":"CIVILIAN02836","text":"Hmmm... Thanks, but no. I appreciate the Resistance chasin' off the Garleans, but what happens when they come back? If worse comes to worst, I don't want anyone callin' me no Resistance lover."},{"name":"CIVILIAN02836","text":"Until I've seen how this all plays out, you can count me out of any talks with the Resistance."},{"name":"LIBERATOR02836","text":"You're back...and still with a few invitations, I see."},{"name":"LIBERATOR02836","text":"I see... &lt;sigh&gt; Well, at least now I know how they really feel about us. Suppose I can't blame them."},{"name":"LIBERATOR02836","text":"A few of them do seem willing to open up to us, though, so that's a start."},{"name":"LIBERATOR02836","text":"It's going to take time, but I'm sure the Resistance will earn their trust. Until then, we'll keep fighting to keep them safe, and maybe someday this will all seem like a distant memory."},{"name":"LIBERATOR02836","text":"Thanks again for your help. Now, if you'll excuse me, I have to prepare for our first forum with the townsfolk."}],"reward":{"gil":631,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68075]}},"partials":[{"type":"npc","id":"1023256","obj":{"i":1023256,"n":"Resistance Fighter","l":2407,"q":1}},{"type":"npc","id":"1021586","obj":{"i":1021586,"n":"J'ghonako","l":2407,"q":1}},{"type":"npc","id":"1021591","obj":{"i":1021591,"n":"Gerbod","l":2407,"q":5}},{"type":"npc","id":"1021595","obj":{"i":1021595,"n":"Aldruth","l":2407,"q":2}},{"type":"npc","id":"1023257","obj":{"i":1023257,"n":"Ala Ghiri Resident","l":2407,"q":1}},{"type":"quest","id":"68075","obj":{"i":68075,"n":"For the Living and the Dead","g":6,"l":"The Peaks","s":990}}]}