{"quest":{"name":"Public Opinion","location":"The Peaks","id":68379,"patch":4.0,"sort":8180,"icon":100711,"eventIcon":71221,"issuer":1023258,"target":1023258,"involved":[1023259,1023260,1023261,1023262,1023263],"genre":105,"journal":["Baut is ready to get to the root of his problem.","Before trying to convince the townsfolk of anything, Baut would first learn why they choose to defend him so fiercely. To that end, he suggests the two of you split up and learn what you can about why they adore him so.","The people you speak with tell you of Baut's kindness and willingness to defend them from his fellow Garlean soldiers. One man, preoccupied with carrying cargo, suggests you speak with J'dyalani to learn more.","J'dyalani agrees to tell you about Baut under one condition: you must accompany her outside of town to exterminate spinners that have built a nest close by. With no other options, you concede and follow her out into the barren lands of Wightrock.","It is not long before you arrive at your destination. As you approach, she directs your attention to the spinner's nest, taking care to remain at a safe distance. You ready your blade and prepare to flush the beasts out of hiding.","Despite their numbers, the spinners are no match for you. Perhaps now you can finally learn why the villagers are so protective of Baut.","J'dyalani explains to you the hopeless situation the people of Ala Ghiri found themselves in, and how their living conditions quickly improved when Baut assumed command there. You wonder how he will react, knowing his actions are the source of their adoration.","When you explain to Baut the villagers' reasons for defending him, he begins by asserting he merely grew tired of his men abusing them. As his explanation continues, it becomes clear the real reason for his compassion: their suffering reminded him of his deceased wife and children who he had been fighting to rescue from life under Garlean rule. Putting his recollections aside, Baut is ready to move on to the next step of his plan─convincing the townsfolk that he is not worth protecting."],"objectives":["Gather information about Baut.","Speak with J'dyalani.","Rendezvous with J'dyalani.","Examine the spinner's web and slay the spitting spinners.","Speak with J'dyalani.","Report to Baut."],"dialogue":[{"name":"BAUT","text":"So you'll help, then? Good, good."},{"name":"BAUT","text":"For a start, it'd be nice to know why they're so insistent on protecting me in the first place."},{"name":"BAUT","text":"Though I'd love to spare my blushes and leave this all to you, we need to hear from as many people as we can. How about we both make a sweep of the village and meet back here?"},{"name":"BAUT","text":"You go on ahead. I need to figure out a good way to broach the subject without embarrassing myself."},{"name":"JDYALANI","text":"&lt;sigh&gt; I suppose if the spinners are to be exterminated I'll have to seek help from the soldiers after all."},{"name":"CITIZENA02843","text":"I never did anything wrong, but the Garlemans would always hit me. Mister Baut was different, though. He was always there to cheer me up, and he'd play with me sometimes. Do you think these new people will play with me too?"},{"name":"CITIZENB02843","text":"If Baut hadn't stopped his men, I wouldn't be standing here before you. He was hard, but fair, and now these Resistance fighters have taken over the place. Sure, they seem friendly now, but just you wait..."},{"name":"CITIZENB02843","text":"I think it's fair to say we all owe Baut a great debt. I'd tell you more, but as you can see, I'm a little busy. Why not go talk to J'dyalani?"},{"name":"JDYALANI","text":"Ah, the adventurer from before. <span class=\"highlight\">Forename</span>, was it? You wish to know more about Baut?"},{"name":"JDYALANI","text":"I would love to tell you all about him, but first, I must ask a favor."},{"name":"JDYALANI","text":"The village has been plagued by spitting spinners as of late. I took a look around, and discovered they've built a nest close by."},{"name":"JDYALANI","text":"I considered petitioning the soldiers for aid, but you seem more than capable of the job. Help me get rid of the nest and I'll tell you everything you want to know. Agreed?"},{"name":"JDYALANI","text":"Excellent. Let's get going, then. I'll lead the way."},{"name":"JDYALANI","text":"There you are. The nest is just ahead."},{"name":"JDYALANI","text":"Be careful. Their spit is quite poisonous."},{"name":"JDYALANI","text":"Thank you ever so much. I can't tell you how many we've nearly lost trying to do away with those horrible things."},{"name":"JDYALANI","text":"Sadly this isn't the first time they've caused us trouble. When the Garleans first took Ala Ghiri, these lands were rife with spinners for a time. Though we begged for help, our pleas fell on deaf ears."},{"name":"JDYALANI","text":"Our village is meant to be a trading hub, so you'd think they would protect such a place, but no. They would come only to get deep in their cups, or take out their frustrations on whoever happened to be present at the time."},{"name":"JDYALANI","text":"If we weren't suffering at the hands of drunken soldiers, we were fending for our lives against all manner of beast with whatever makeshift weapons we could find. There was nothing we could do but endure their mocking laughter as we struggled to survive. "},{"name":"JDYALANI","text":"Baut changed all that. After he came and assumed command, he immediately put an end to our misery. The difference in our treatment was like night and day."},{"name":"JDYALANI","text":"He gave us our lives back, which is more than I can say for what the Allied forces are like to do for us."},{"name":"JDYALANI","text":"Baut is a good man, and I hope in time you'll come to see him as we do."},{"name":"BAUT","text":"No matter who I talked to, there was too much beating around the bush to get any clear answers. Did they tell you anything useful?"},{"name":"BAUT","text":"They said all that? Well, I'm no saint. I was just tired of seeing my men beat them bloody all the time. I'd seen enough of it before coming here."},{"name":"BAUT","text":"It's amazing how treatment of the Empire's subjects can vary from place to place. There are territories where life is unchanged by the Garleans' presence, and yet there are others whose denizens would welcome death with open arms."},{"name":"BAUT","text":"The only escape from either is to join their armies. If you manage to survive twenty years of service, you and your family can earn citizenship, a chance to have a good life."},{"name":"BAUT","text":"Needless to say I jumped at the opportunity. I fought and I fought until before I knew it, I was an imperial centurion."},{"name":"BAUT","text":"But it was too late. Shortly after my promotion, I received word of my family's death, snatched away by some widespread illness."},{"name":"BAUT","text":"The suffering of these people only served to remind me of my loss, so I put an end to it. Simple as that."},{"name":"BAUT","text":"Yet still they thank me, after I've killed so many. I'll never understand such nonsense."},{"name":"BAUT","text":"At least now we know for certain the reason for their adoration. Now we just have to convince them I'm not worth protecting."}],"reward":{"gil":800,"items":[{"id":18728,"one":1,"hq":1},{"id":18729,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"questsType":"all","quests":[68077,68378]},"next":[68380]},"partials":[{"type":"npc","id":"1023258","obj":{"i":1023258,"n":"Baut","l":2407,"q":3}},{"type":"npc","id":"1023259","obj":{"i":1023259,"n":"J'dyalani","l":2407,"q":5}},{"type":"npc","id":"1023260","obj":{"i":1023260,"n":"Light-hearted Lass","l":2407,"q":1}},{"type":"npc","id":"1023261","obj":{"i":1023261,"n":"Affable Elder","l":2407,"q":1}},{"type":"npc","id":"1023262","obj":{"i":1023262,"n":"Diligent Youth","l":2407,"q":1}},{"type":"npc","id":"1023263","obj":{"i":1023263,"n":"J'dyalani","l":2407,"q":1}},{"type":"item","id":"18728","obj":{"i":18728,"n":"Palladium Bracelet of Healing","l":285,"c":55790,"t":42,"p":16485}},{"type":"item","id":"18729","obj":{"i":18729,"n":"Palladium Bracelet of Casting","l":285,"c":55790,"t":42,"p":16485}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68077","obj":{"i":68077,"n":"The Path Forward","g":6,"l":"The Peaks","s":1010}},{"type":"quest","id":"68378","obj":{"i":68378,"n":"Out of Sight","g":105,"l":"The Peaks","s":8170,"f":1}},{"type":"quest","id":"68380","obj":{"i":68380,"n":"Dragged through the Mud","g":105,"l":"The Peaks","s":8190}}]}