{"quest":{"name":"A Special Treat","location":"The Peaks","id":68374,"patch":4.0,"sort":8060,"eventIcon":71221,"issuer":1020871,"target":1020871,"genre":105,"journal":["Weidheri is planning a surprise."],"objectives":["Slay highwing chapulis and obtain their legs.","Deliver the chapuli legs to Weidheri."],"dialogue":[{"name":"WEIDHERI","text":"Oh, hey there. Thanks again for helping me before. Word around town is you're some sort of adventurer, is that right? I'm in a bit of a tight spot, and you're likely the only one who can help me."},{"name":"WEIDHERI","text":"You see, I need legs from the chapulis hopping about outside of town─three or so should do the trick. I'd go myself, but they'd stomp me in the ground faster than a sabotender in a sandstorm."},{"name":"WEIDHERI","text":"What do I need them for? You'll have to wait and see."},{"name":"WEIDHERI","text":"You won't have to go far to find the chapulis hopping around out there. If you can get me three of their legs, that should be more than enough."},{"name":"WEIDHERI","text":"The chapulis give you any trouble?"},{"name":"WEIDHERI","text":"These are pretty plump. Looks like you found a lively lot out there. Aye, these'll make for a good stew. It's a specialty of mine─a nice, spicy broth with chunks of meat so tender they practically melt in your mouth. I find chapuli legs work best."},{"name":"WEIDHERI","text":"The Garleans thought we were savages for eating the stuff, but now that they're gone, this Ala Ghiri stew is back on the menu."},{"name":"WEIDHERI","text":"I'm sure the soldiers will find it a welcome change from the rock-hard breads and salted meats they're used to."},{"name":"WEIDHERI","text":"And you too. Be sure to stop by for a bowl sometime. My treat."}],"reward":{"gil":631,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"questsType":"all","quests":[68075,68366]}},"partials":[{"type":"npc","id":"1020871","obj":{"i":1020871,"n":"Weidheri","l":2407,"q":5}},{"type":"quest","id":"68075","obj":{"i":68075,"n":"For the Living and the Dead","g":6,"l":"The Peaks","s":990}},{"type":"quest","id":"68366","obj":{"i":68366,"n":"Bottoms Up","g":105,"l":"The Peaks","s":8050}}]}