{"quest":{"name":"Live off the Land","location":"The Peaks","id":68375,"patch":4.0,"sort":8140,"eventIcon":71221,"issuer":1020868,"target":1020868,"genre":105,"journal":["Emory is preparing for a new business venture."],"objectives":["Survey the designated location and slay any migrating crag claws that appear.","Report to Emory."],"dialogue":[{"name":"EMORY","text":"Hey, you're that adventurer everyone's talkin' about. The one what helped the Resistance. I could use a strong set o' hands like yours, assumin' you're up for it o' course."},{"name":"EMORY","text":"For as long as I can remember, I've been runnin' my father's business here in Ala Ghiri. Wouldn't sell to those imperial bastards, though. I'm not too proud o' the things I had to do, but we got by."},{"name":"EMORY","text":"Now that they're gone, we can get back to doin' proper work. More than that, I can finally get to farmin' like I'd always dreamed of."},{"name":"EMORY","text":"Only trouble is, the spot o' land I had in mind's overrun with crags. I'll make it worth your while if you could go and clear 'em out."},{"name":"EMORY","text":"Here, I'll mark it on your map. Take a look around─you'll know 'em when you see 'em."},{"name":"EMORY","text":"Those crags are a nasty bit o' business, but I'm sure an adventurer like you can handle 'em."},{"name":"EMORY","text":"So they're gone? Well done, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, well done!"},{"name":"EMORY","text":"The land's not in the best o' shape, but I'll make do. Aye, I'll fix it up so folks can work the land an' get back on their feet. Too many have lost their homes, an' loved ones..."},{"name":"EMORY","text":"Ahem. Don't get the wrong impression, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. More folks workin' the land means more profits for my business is all."},{"name":"EMORY","text":"If it helps people make a better livin', well, that's more incentive to get started, now isn't it?"}],"reward":{"gil":595,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68077]}},"partials":[{"type":"npc","id":"1020868","obj":{"i":1020868,"n":"Emory","l":2407,"q":1}},{"type":"quest","id":"68077","obj":{"i":68077,"n":"The Path Forward","g":6,"l":"The Peaks","s":1010}}]}