{"quest":{"name":"Out of Sight","location":"The Peaks","id":68378,"patch":4.0,"sort":8170,"icon":100711,"unlocksFunction":1,"eventIcon":71341,"issuer":1020873,"target":1023258,"involved":[1020870,1020871,1023259],"genre":105,"journal":["Brazen Brook needs help with a rather delicate situation.","As Brazen Brook tells it, a single man is responsible for the Alliance's effortless reclaiming of Ala Ghiri. The problem, however, is they are unable to bring this man in for inquiry. Afraid to speak more on the matter out in the open, he insists you speak with Baut, the person in question.  ","Baut is startled by your presence, but is soon relieved when you explain Brazen Brook sent you to help. The reason for his initial panic is made clear when he reveals that he is, in fact, a centurion of the Garlean forces. He ordered his men to retreat in lieu of a crushing defeat at the hands of the Alliance, but ran into an unexpected problem when attempting to turn himself in. To better explain his predicament, he insists you speak with the people of Ala Ghiri and hear what they have to say of him.","You speak with the people of Ala Ghiri, and their responses are not what one would expect. Baut appears to be well-liked, with some townsfolk being surprisingly protective of him. As the pieces of the puzzle slowly fall into place, you return to speak with him and confirm your findings.","Baut has found himself in a precarious position. Resigned to being a prisoner of war, the Alliance has yet to take him into custody for fear of a revolt from the villagers who have, for reasons unknown, grown to care for him like one of their own. Not wishing for them to come to harm, Baut asks for your help in persuading the villagers to allow for his peaceful surrender."],"objectives":["Speak with Baut.","Gather information about Baut.","Speak with Baut."],"dialogue":[{"name":"BRAZENBROOK","text":"Hey, you're that adventurer everyone's been talkin' about, aren't you? Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I wanted to see. You've a bit of time to spare, I hope?"},{"name":"BRAZENBROOK","text":"It seemed a bloody miracle we managed to take Ala Ghiri without spillin' a drop of blood, but it was all thanks to one man, a man the Alliance would very much like to speak with. Gettin' him to come in for questionin', however, has proven more trouble than we thought."},{"name":"BRAZENBROOK","text":"It's not my place to be dealing with this, to be honest with you, but I think it'd be best to resolve the matter quietly if possible. Things could get messy around here if the Alliance or the Resistance start kickin' up a fuss."},{"name":"BRAZENBROOK","text":"I'm like to draw attention if I leave my post, but you adventurers are free to move about as you please. So what do you say? Can you give me a hand?"},{"name":"BRAZENBROOK","text":"You adventurers are good folk. Now I really shouldn't say much more out here in the open. You best go and speak with him yourself. Baut's his name. He can tell you the rest."},{"name":"BRAZENBROOK","text":"This isn't somethin' to talk about here in the open. Best you heard the rest from Baut."},{"name":"BAUT","text":"The adventurer who slew Lord van Baelsar!? So they've sent you to claim my head, then?"},{"name":"BAUT","text":"Brazen Brook sent you to help? Oh, thank heavens."},{"name":"BAUT","text":"You see, I'm actually a centurion of the Garlean forces. Now before you do anything rash, let me explain."},{"name":"BAUT","text":"When I learned of the Allied forces' approach, I knew we had no way of repelling them, so I ordered all of my men to retreat from Ala Ghiri. I then planned to turn myself in, but I ran into certain...complications."},{"name":"BAUT","text":"...I can see you're unconvinced. Tell you what, why not ask the villagers about me."},{"name":"BAUT","text":"When you hear what they have to say, I think you'll come to understand why I couldn't turn myself in."},{"name":"BAUT","text":"I doubt anything else I say will convince you, so go ahead. See what they have to say."},{"name":"BRAZENBROOK","text":"I appreciate your help, adventurer. This is a fairly delicate situation, you understand? We can't afford for things here to get out of hand."},{"name":"WEIDHERI","text":"...Where'd you hear that name? I won't have anyone speaking ill of him. Unless you're looking to pick a fight, you'll keep your mouth shut!"},{"name":"FRAUNK","text":"What do you want with Baut? He's not in trouble is he? We already told the Alliance scum they can't have him!"},{"name":"JDYALANI","text":"Baut? The place wouldn't be the same without him, and we certainly have no intentions of sending him to be butchered by the Alliance."},{"name":"BAUT","text":"There you are. Now do you see the cause for my hesitation?"},{"name":"BAUT","text":"In light of their reaction to my being arrested, the Alliance has allowed me to remain here for the time being, but for all intents and purposes I am a war prisoner."},{"name":"BAUT","text":"The villagers initially meant to keep me hidden, but harboring one's enemy is a serious crime no matter whose side you're on, and I've heard what the Alliance does to those who help the Garleans. The stuff of nightmares, I tell you."},{"name":"BAUT","text":"My execution is assured the moment they take me into custody, but if the villagers should take arms in protest... They don't deserve such a bloody fate."},{"name":"BAUT","text":"Brazen Brook has made a valiant effort to assuage the people's anger, but there's only so much a man in his position can do."},{"name":"BAUT","text":"I know how strange this may seem, but I want you to convince the people of Ala Ghiri to allow for my surrender."}],"reward":{"gil":800,"aetherCurrent":1,"items":[{"id":18725,"one":1,"hq":1},{"id":18726,"one":1,"hq":1},{"id":18727,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68077]},"next":[68379]},"partials":[{"type":"npc","id":"1020873","obj":{"i":1020873,"n":"Brazen Brook","l":2407,"q":3}},{"type":"npc","id":"1023258","obj":{"i":1023258,"n":"Baut","l":2407,"q":3}},{"type":"npc","id":"1020870","obj":{"i":1020870,"n":"Fraunk","l":2407,"q":3}},{"type":"npc","id":"1020871","obj":{"i":1020871,"n":"Weidheri","l":2407,"q":5}},{"type":"npc","id":"1023259","obj":{"i":1023259,"n":"J'dyalani","l":2407,"q":5}},{"type":"item","id":"18725","obj":{"i":18725,"n":"Palladium Bracelet of Fending","l":285,"c":55790,"t":42,"p":16485}},{"type":"item","id":"18726","obj":{"i":18726,"n":"Palladium Bracelet of Slaying","l":285,"c":55790,"t":42,"p":16485}},{"type":"item","id":"18727","obj":{"i":18727,"n":"Palladium Bracelet of Aiming","l":285,"c":55790,"t":42,"p":16485}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68077","obj":{"i":68077,"n":"The Path Forward","g":6,"l":"The Peaks","s":1010}},{"type":"quest","id":"68379","obj":{"i":68379,"n":"Public Opinion","g":105,"l":"The Peaks","s":8180}}]}