{"quest":{"name":"Those Boys of Mine","location":"The Peaks","id":68377,"patch":4.0,"sort":8160,"eventIcon":71221,"issuer":1023334,"target":1023334,"involved":[1023335,1023336],"genre":105,"journal":["This well-meaning mother has spread herself a little too thin."],"objectives":["Express /doubt as to what the children have been up to.","Speak with the well-meaning mother."],"dialogue":[{"name":"WORRYMOTHER02841","text":"I swear, where did those boys run off to this time?"},{"name":"WORRYMOTHER02841","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I've searched everywhere and I can't find my boys. Would you help me look for them?"},{"name":"WORRYMOTHER02841","text":"Work has kept me so busy I haven't been able to spend any time with them. Even when I do have a few moments to spare, they're always gone doing gods know what."},{"name":"WORRYMOTHER02841","text":"If you find them and they start making excuses, you'd be wise to <span class=\"highlight\">doubt</span> them. Still, they've never been the sort to get into trouble. &lt;sigh&gt; I hope they're okay."},{"name":"WORRYMOTHER02841","text":"They're sure to make up excuses to avoid getting in trouble, but I know my boys. If you show any <span class=\"highlight\">doubt</span> of their stories, they'll tell the truth."},{"name":"JOVIALBOY02841","text":"Wh-What? Mother sent you to check on me? I haven't done anything bad, I promise."},{"name":"JOVIALBOY02841","text":"I've been studying the plants and bugs out here. Someday I'm going to be a scholar, and make lots of money so Mother doesn't have to work so hard all the time."},{"name":"JOVIALBOY02841","text":"I never meant to make her worry. I better go home and let her know I'm okay."},{"name":"JOVIALBOY02841","text":"...I've never seen wings like this on a bug before. I wonder why they're so different?"},{"name":"LIVELYBOY02841","text":"Mother sent you? She's always making a fuss over nothing."},{"name":"LIVELYBOY02841","text":"I was just training is all. I'm going to join the Resistance, and defeat all the Garleans. Then she won't have to worry about anything ever again."},{"name":"LIVELYBOY02841","text":"I wanted to practice a bit more before I told her, but I don't want her getting worked up over nothing. I should be heading back before she gets mad."},{"name":"LIVELYBOY02841","text":"What do you want? Can't you see I'm busy practicing?"},{"name":"WORRYMOTHER02841","text":"The boys are home, safe and sound. I don't know what you told them, but they certainly had a lot on their minds when they walked through the door."},{"name":"WORRYMOTHER02841","text":"They grow up so fast... I usually only ever see them when they're sleeping, but I looked into their eyes today and saw a fire that wasn't there before. "},{"name":"WORRYMOTHER02841","text":"They've never known their father, but no matter how bad things got, I did everything I could to give them a happy childhood."},{"name":"WORRYMOTHER02841","text":"We'll be alright, you wait and see. I may look battered and beaten, but we mothers are made of sterner stuff. Our love for our children is the greatest strength there is."}],"reward":{"gil":595,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68077]}},"partials":[{"type":"npc","id":"1023334","obj":{"i":1023334,"n":"Well-meaning Mother","l":2407,"q":1}},{"type":"npc","id":"1023335","obj":{"i":1023335,"n":"Bookish Boy","l":2407,"q":1}},{"type":"npc","id":"1023336","obj":{"i":1023336,"n":"Bravehearted Boy","l":2407,"q":1}},{"type":"quest","id":"68077","obj":{"i":68077,"n":"The Path Forward","g":6,"l":"The Peaks","s":1010}}]}