{"quest":{"name":"Picking Up the Slack","location":"The Peaks","id":68371,"patch":4.0,"sort":8110,"eventIcon":71221,"issuer":1020876,"target":1020876,"involved":[1022070],"genre":105,"journal":["Hele is tired of soldiers slacking on the job."],"objectives":["Search for the slacking soldier.","Search for the tarnished neckpiece.","Deliver the tarnished neckpiece to the slacking soldier.","Report to Hele."],"dialogue":[{"name":"HELE","text":"Hm, you've the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who takes their work seriously. Would you mind finding someone for me?"},{"name":"HELE","text":"A few too many of our soldiers have been shirking their duties of late. Scare off a few Garleans and suddenly everyone's complacent."},{"name":"HELE","text":"In fact, I've been told they've been seen lazing about at Goodblade, and if I wasn't so godsdamned busy I'd drag them back here myself. Go and tell anyone you see there I'd like to have a word with them."},{"name":"HELE","text":"We didn't come here to relax, and I wish they would understand that. Bring those soldiers back here so I can give them a piece of my mind."},{"name":"SOLDIER02835","text":"Hele sent you? Ugh, she can yell at me later. First I need to find my necklace. It was a gift from my parents, and I refuse to leave without it."},{"name":"SOLDIER02835","text":"Would you help me look for it? It must've fallen off when I was fighting with those damned muud suuds."},{"name":"SOLDIER02835","text":"I was on patrol here the last time I was wearing it, so it has to be close by. Please help me find it."},{"name":"SOLDIER02835","text":"Did you have any luck?"},{"name":"SOLDIER02835","text":"Oh, bless you <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! It's the only thing I have left to remember my parents by."},{"name":"SOLDIER02835","text":"I lost them in the wake of the Garleans' initial invasion. They took from us everything they could and destroyed what they couldn't. Like this place. It used to be a rest stop for chocobos if you can believe it."},{"name":"SOLDIER02835","text":"We'll rebuild it all someday, though. And as long as I have this, I'll remember what we're working so hard for. Speaking of which, I should be heading back. I'm sure to get an earful from Hele."},{"name":"HELE","text":"Aye, it looks like he was the only one up there. This time, at least. He explained the situation, and it seems all the soldiers seen up at Goodblade were there helping with his search."},{"name":"HELE","text":"This isn't the first time I've heard such tale. Wish I could say it'd be the last, but these men have been through a lot."},{"name":"HELE","text":"Sorry to put you through all that trouble. I hope you'll still be with us when there's more serious matters to tend to."}],"reward":{"gil":738,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68075]}},"partials":[{"type":"npc","id":"1020876","obj":{"i":1020876,"n":"Hele","l":2407,"q":1}},{"type":"npc","id":"1022070","obj":{"i":1022070,"n":"Surveying Resistance Fighter","l":2407,"q":1}},{"type":"quest","id":"68075","obj":{"i":68075,"n":"For the Living and the Dead","g":6,"l":"The Peaks","s":990}}]}