{"quest":{"name":"Dragged through the Mud","location":"The Peaks","id":68380,"patch":4.0,"sort":8190,"icon":100711,"eventIcon":71221,"issuer":1023258,"target":1023264,"involved":[1020873,1023259],"genre":105,"journal":["Baut has a plan to smear his reputation.","Baut intends to ruin the villagers' perception of him through a rumor of his own creation. Taking his ring in hand, he plans for you to go about town claiming he is the man responsible for the death of one of the village's holy men shortly after his arrival. Before setting the rumor to spinning, however, he suggests gauging the reaction of a single individual. The victim he has chosen is J'dyalani.","You show J'dyalani the ring and relay to her Baut's rumor. Her feigned shock is short-lived as she is certain you would never do anything to damage his reputation. She asks you to remind Baut that, regardless of any crimes he has committed in the past, the people of Ala Ghiri are only concerned with the kind-hearted man he has shown himself to be since arriving there.","Baut is disappointed to hear J'dyalani was able to see through his lie so easily. He asks you to speak with her once more, hoping she will help you convince the villagers with the truth rather than falsehoods. In the meantime, he will continue deliberating on his next course of action.","In light of Baut's situation, J'dyalani concedes that speaking with a member of the Alliance could potentially solve their problems. You mention that he has been working with Brazen Brook to arrange his surrender, and she grows concerned that his arrest─and execution─are imminent. She insists on speaking with Brazen Brook at once, hoping to convince him to spare Baut's life.","J'dyalani pleads for Baut's life, going so far as to offer herself in his stead. Brazen Brook can only answer her with confusion. He soon makes clear that they have no intentions of executing Baut. Rather, they need to question him regarding documents left behind by the Garleans after they fled Ala Ghiri. J'dyalani is pleased to hear this, and leaves to go share the good news.","You return to speak with Baut, but find only a note in his place. J'dyalani's eyes grow wide with horror as you read aloud the note's contents. Still haunted by the past, Baut means to end his own life, and asks that you deliver his head to the Allied forces. You must move quickly if you are to save him."],"objectives":["Show Baut's ring to J'dyalani.","Return Baut's ring to Baut.","Speak with J'dyalani.","Speak with Brazen Brook.","Speak with J'dyalani."],"dialogue":[{"name":"BAUT","text":"We'll need a good lie if we're going to change their opinions of me. Hmmm..."},{"name":"BAUT","text":"I've got it! A holy man here in Ala Ghiri was slain shortly after my arrival, just before I took command. It was the former imperial commander who killed him, but you can tell people it was me."},{"name":"BAUT","text":"Take my ring as proof. Say it was a keepsake of his, and that I pried it from his cold, dead hands."},{"name":"BAUT","text":"They'll be so blinded with hate, execution will seem too good a punishment for me."},{"name":"BAUT","text":"Then again, if people see through the lie, it wouldn't do well for your reputation to be speaking so poorly of me."},{"name":"BAUT","text":"Maybe we should start with just one person, and gauge their reaction before we set the rumor mill to spinning. Try speaking with J'dyalani, and see if this gets her blood boiling."},{"name":"BAUT","text":"Would that I could see her reaction to the news, but she would never believe it coming from me. See how she takes it, then report back here."},{"name":"JDYALANI","text":"Hm? What's this about Baut?"},{"name":"JDYALANI","text":"How awful! The people of Ala Ghiri will be furious to hear of this. Why, they might even consider handing him over to the Allied forces...which is exactly what he wants, isn't it?"},{"name":"JDYALANI","text":"I haven't known you long, but I know an honorable <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> when I see one. I refuse to believe you would try to smear his reputation and turn us against him. I can imagine why he might try, though."},{"name":"JDYALANI","text":"When you return to Baut, you can tell him what I've told him countless times before: no matter what horrible deeds he may have done in the past, no one is beyond forgiveness."},{"name":"JDYALANI","text":"Travelers come and go from Ala Ghiri quite often, but should they wish to stay, who they were before coming here doesn't matter."},{"name":"JDYALANI","text":"We have no interest in the man Baut used to be, only the man he is now. Even if he was a murderer in the past, he's been nothing but kind to us since arriving here. The man we know has a gentle soul, and that is why we protect him."},{"name":"JDYALANI","text":"No matter what he says, he cannot change our minds. We could never send such a kind-hearted man away to be executed by the Eorzeans."},{"name":"BAUT","text":"How did she take the news? She was absolutely livid, wasn't she? Tell me everything."},{"name":"BAUT","text":"They only care about the man I am now? And what sort of man am I supposed to be, hm? My family is dead, I can't return to the Garleans..."},{"name":"BAUT","text":"But that's not your concern. It seems it'll take more than a nasty rumor to sway their opinions of me."},{"name":"BAUT","text":"I'll have to think of something soon, though. It's only a matter of time before the Alliance decides it's done waiting."},{"name":"BAUT","text":"Could you try speaking with J'dyalani once more? Not to spread more falsehoods, but about persuading the townsfolk to let me turn myself in peacefully. Hopefully inspiration will strike by the time you return."},{"name":"BAUT","text":"I'm sure something will come to me. In the meantime, see if you can't persuade J'dyalani to help you speak with the townsfolk."},{"name":"JDYALANI","text":"Let me guess. Baut sent you again, didn't he?"},{"name":"JDYALANI","text":"He can conjure up whatever lies he likes, but he cannot change our minds. Though I suppose I can understand his worry."},{"name":"JDYALANI","text":"&lt;sigh&gt; I'm loath to admit it, but entreating the Alliance could resolve all this. It could also make things much worse... "},{"name":"JDYALANI","text":"If only there was someone among them who knew what a kind and caring man Baut is. Perhaps then we could convince them to show him mercy."},{"name":"JDYALANI","text":"Baut has been speaking with Brazen Brook in private about his surrender? Does this mean the Allied forces will soon come for him?"},{"name":"JDYALANI","text":"Let's go and speak with him, while there's still time."},{"name":"BRAZENBROOK","text":"Ah, you've brought company. What can I do for the two of you?"},{"name":"BRAZENBROOK","text":"An appeal on Baut's behalf? I'm not sure I follow..."},{"name":"JDYALANI","text":"Please, Brazen Brook, is there nothing you can do to have him pardoned? Or better yet, take me in his stead. Say I am his accomplice, and I will tell your superiors anything they wish to hear."},{"name":"BRAZENBROOK","text":"Whoa! Calm down, miss. No one wants to help him more than I do."},{"name":"BRAZENBROOK","text":"That said, he's still a soldier of the Garlean Empire. An imperial centurion at that. As a member of the Resistance, I have a duty to take him into custody."},{"name":"JDYALANI","text":"You can't! The people of Ala Ghiri will not stand for his execution!"},{"name":"BRAZENBROOK","text":"What!? Who said anythin' about an execution?"},{"name":"JDYALANI","text":"But... The Garleans told us you kill all the soldiers you capture."},{"name":"BRAZENBROOK","text":"For goodness' sake, we're not savages. We're in the middle of assessin' the documents and supplies they left behind, and his testimony as to what we've found is sorely needed."},{"name":"BRAZENBROOK","text":"Everyone's made it quite clear how his presence has improved livin' conditions here, so I suspect my superiors'll be fairly lenient. That's not to say he won't face punishment, mind you, but he's got to come in for questionin'."},{"name":"JDYALANI","text":"I...I see... After so many years under their rule, the Garleans had convinced us you were no better, if not worse, than they were. On behalf of all the people of Ala Ghiri, I offer you our sincerest apologies."},{"name":"JDYALANI","text":"Thank you for clearing up this terrible misunderstanding. Baut will no doubt be relieved to hear of this."},{"name":"JDYALANI","text":"Let's go and share the good news."},{"name":"BRAZENBROOK","text":"What sort of lies have the Garleans been feedin' them all this time? &lt;sigh&gt; I suppose it doesn't matter now. The people'll come around eventually."},{"name":"JDYALANI","text":"It seems Baut has left us a note?"},{"name":"JDYALANI","text":"(-Note from Baut-)Dear <span class=\"highlight\">Forename</span>,<br>The time has come to bid you my final farewell. Try as I might to focus on the present, the past still haunts me—my family calls. If you can find it within you to grant me one last favor, I bid you deliver my head to the Allied forces. I have enclosed instructions to this end."},{"name":"JDYALANI","text":"No... No, he can't! <span class=\"highlight\">Forename</span>, we have to stop him!"}],"reward":{"gil":900,"items":[{"id":18730,"one":1,"hq":1},{"id":18731,"one":1,"hq":1},{"id":18732,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"questsType":"all","quests":[68077,68379]},"next":[68381]},"partials":[{"type":"npc","id":"1023258","obj":{"i":1023258,"n":"Baut","l":2407,"q":3}},{"type":"npc","id":"1023264","obj":{"i":1023264,"n":"J'dyalani","l":2407,"q":2}},{"type":"npc","id":"1020873","obj":{"i":1020873,"n":"Brazen Brook","l":2407,"q":3}},{"type":"npc","id":"1023259","obj":{"i":1023259,"n":"J'dyalani","l":2407,"q":5}},{"type":"item","id":"18730","obj":{"i":18730,"n":"Palladium Ring of Fending","l":285,"c":54639,"t":43,"p":16485}},{"type":"item","id":"18731","obj":{"i":18731,"n":"Palladium Ring of Slaying","l":285,"c":54639,"t":43,"p":16485}},{"type":"item","id":"18732","obj":{"i":18732,"n":"Palladium Ring of Aiming","l":285,"c":54639,"t":43,"p":16485}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68077","obj":{"i":68077,"n":"The Path Forward","g":6,"l":"The Peaks","s":1010}},{"type":"quest","id":"68379","obj":{"i":68379,"n":"Public Opinion","g":105,"l":"The Peaks","s":8180}},{"type":"quest","id":"68381","obj":{"i":68381,"n":"Second Chances","g":105,"l":"The Peaks","s":8200}}]}