{"quest":{"name":"Soup's On","location":"The Peaks","id":68384,"patch":4.0,"sort":8100,"eventIcon":71221,"issuer":1020882,"target":1022066,"genre":105,"journal":["Guntmar is wide awake, and wants to make use of his leftover broth."],"objectives":["Deliver the muud suud broth to the Resistance fighter."],"dialogue":[{"name":"GUNTMAR","text":"Good seeing you, adventurer. Thanks again for that muud suud horn. I've never felt better."},{"name":"GUNTMAR","text":"There's enough left over for one more cup, and since you're here, I was hoping you could deliver it to someone. When you return to Ala Ghiri, would you give this to the soldier standing guard at the north gate?"},{"name":"GUNTMAR","text":"Would you take this last cup of broth to the soldier guarding the north gate? She's been asking after this for a while now, and it would be a shame not to offer some to her."},{"name":"LADYSOLDIER02834","text":"Ah, adventurer. Always a pleasure. Is there something I can do for you?"},{"name":"LADYSOLDIER02834","text":"Is this... &lt;sniff&gt; &lt;sniff&gt; It is! Guntmar's muud suud broth. Never have I tasted anything so rich, so robust. And the pleasant aftertaste that lingers for days on end. It is simply to die for."},{"name":"LADYSOLDIER02834","text":"You would never guess something so wonderful could come from a creature so horrid, but such dishes made from the horns and bones of animals are quite common in Gyr Abania. Aside from their distinctive flavors, they all have varying effects that are quite beneficial to one's health."},{"name":"LADYSOLDIER02834","text":"Some say these recipes came about from trade with the Near East if you can believe such a thing."},{"name":"LADYSOLDIER02834","text":"I should return home right now and─oh dear, I believe I'm drooling. You'll have to excuse me. Thank you again for this most pleasant surprise."}],"reward":{"gil":524,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"questsType":"all","quests":[68075,68382]}},"partials":[{"type":"npc","id":"1020882","obj":{"i":1020882,"n":"Guntmar","l":2407,"q":4}},{"type":"npc","id":"1022066","obj":{"i":1022066,"n":"Resistance Fighter","l":2407,"q":2}},{"type":"quest","id":"68075","obj":{"i":68075,"n":"For the Living and the Dead","g":6,"l":"The Peaks","s":990}},{"type":"quest","id":"68382","obj":{"i":68382,"n":"Eau de Muud","g":105,"l":"The Peaks","s":8080}}]}