{"quest":{"name":"Second Chances","location":"The Peaks","id":68381,"patch":4.0,"sort":8200,"icon":100711,"eventIcon":71221,"issuer":1023264,"target":1020873,"involved":[1023265,1023351],"genre":105,"journal":["J'dyalani is not yet ready to give up on Baut.","Not wishing to waste time, J'dyalani rushes off to the location described in Baut's note─northwest on the path to the Fringes.","A pantera was preparing to rend the life from its willing victim just as you arrived. Your battle with the beast quickly ensues, and after a furious clash of claws and steel, it is at last brought low. With a sigh of relief you help Baut to his feet.","Baut is less than pleased that you intervened, and your bringing J'dyalani does little to ease his frustration. When you explain that the Alliance had no intentions of executing him, he scoffs at their offer of clemency, claiming he would find another way to end his life. J'dyalani pleads with him to reconsider, reminding him that the people of Ala Ghiri care a great deal about him. As he continues to lament that he has nothing left to live for, she surprises him with what sounds oddly like a profession of love. Baut is so taken aback he can only laugh in response. The mood now lightened, he concedes to your requests and agrees to speak with the Alliance, granted J'dyalani helps him explain to the villagers he will not be put to death. As you all return to Ala Ghiri, you decide to pay a visit to Brazen Brook to share with him the good news.","Brazen Brook is equal parts relieved and ecstatic to see that Baut has agreed to turn himself in. Moreover, the people of Ala Ghiri have not taken arms against the Allied forces in protest. He suspects there is still lingering mistrust of the Resistance and Eorzean Alliance, but he believes that, given time, Ala Ghiri will prosper as it once did so many years ago."],"objectives":["Search for Baut.","Aid Baut.","Report to Brazen Brook."],"dialogue":[{"name":"JDYALANI","text":"We can't let him go through with this, <span class=\"highlight\">Forename</span>!"},{"name":"JDYALANI","text":"It looks like he's heading northwest, toward the Fringes. I pray we're not too late."},{"name":"JDYALANI","text":"Don't worry about me. Save Baut!"},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"BAUT","text":"I suppose this is where I'm supposed to thank you for saving my life."},{"name":"JDYALANI","text":"Baut, <span class=\"highlight\">Forename</span>. Thank goodness you're both unharmed."},{"name":"BAUT","text":"Why in the hells did you bring <span class=\"emphasis\">her</span> here?"},{"name":"BAUT","text":"Hmph! Cowards, the lot of them! They would waste the chance to make an example of me."},{"name":"JDYALANI","text":"This is all our fault. If we hadn't shown such aggression to the Allied forces, they would have likely made their intentions clear ages ago."},{"name":"BAUT","text":"You needn't apologize. If I had known they wouldn't kill me, I would have merely sought another way to death's door. "},{"name":"JDYALANI","text":"But why!? You have so much to live for!"},{"name":"BAUT","text":"I have nothing! What is a man without his family? A soldier without his men? I've stained my hands with the blood of so many innocents, and for what?"},{"name":"JDYALANI","text":"You still have Ala Ghiri! It would have been all too easy to stand by and watch as the soldiers taunted and tormented us, yet you chose to show us mercy."},{"name":"BAUT","text":"Well, that was..."},{"name":"JDYALANI","text":"After all the good you've done here, are we not worth living for? Am <span class=\"emphasis\">I</span> not worth living for?"},{"name":"JDYALANI","text":"I know I can never replace your family. I would never try. But I'd like to try and make you happy, if you'll let me. "},{"name":"BAUT","text":"Wh-What!?"},{"name":"JDYALANI","text":"Has this obsession with loss truly made you so blind? The people of Ala Ghiri care about you, none more so than me. You brought light and hope back into our lives, and I would return that kindness a hundredfold if I can."},{"name":"BAUT","text":"Yes, by all means. Let's get married, settle down here in the village, and fill our cottage with the pitter-patter of little feet."},{"name":"JDYALANI","text":"Marriage!? I-I didn't mean to─that's not to say I'm opposed to... Oh dear, this is all so sudden."},{"name":"BAUT","text":"Before you let your imagination run wild, there's still the matter of my surrender to the Allied forces. I'm going to need your help in assuring the others that I won't be put to death."},{"name":"JDYALANI","text":"Yes, of course!"},{"name":"BAUT","text":"I suppose this is it. I know not what they have in store for me, but I will at last atone for my crimes. When they release me, well...it seems I have something worth waiting for. Thank you, for everything."},{"name":"BRAZENBROOK","text":"There <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is, the hero of the hour! I don't know how you did it, but J'dyalani returned just now with Baut in tow. He says he's ready to turn himself in!"},{"name":"BRAZENBROOK","text":"What's more, public reaction to his surrender's been surprisingly calm. The last thing we need is to be fendin' off the people we came to save."},{"name":"BRAZENBROOK","text":"If you hadn't shown up when you did, I'm sure they'd be chasin' us out of here with pitchforks and torches by now."},{"name":"BRAZENBROOK","text":"To make sure they don't, we'll all be takin' a leaf out of Baut's book in building better relations with the townsfolk. It'll take some work, to be sure, but we'll get this place back to the way it used to be."}],"reward":{"gil":1000,"items":[{"id":18733,"one":1,"hq":1},{"id":18734,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"questsType":"all","quests":[68077,68380]},"next":[68401]},"partials":[{"type":"npc","id":"1023264","obj":{"i":1023264,"n":"J'dyalani","l":2407,"q":2}},{"type":"npc","id":"1020873","obj":{"i":1020873,"n":"Brazen Brook","l":2407,"q":3}},{"type":"npc","id":"1023265","obj":{"i":1023265,"n":"Baut","l":2407,"q":1}},{"type":"npc","id":"1023351","obj":{"i":1023351,"n":"J'dyalani","l":2407,"q":1}},{"type":"item","id":"18733","obj":{"i":18733,"n":"Palladium Ring of Healing","l":285,"c":54639,"t":43,"p":16485}},{"type":"item","id":"18734","obj":{"i":18734,"n":"Palladium Ring of Casting","l":285,"c":54639,"t":43,"p":16485}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68077","obj":{"i":68077,"n":"The Path Forward","g":6,"l":"The Peaks","s":1010}},{"type":"quest","id":"68380","obj":{"i":68380,"n":"Dragged through the Mud","g":105,"l":"The Peaks","s":8190}},{"type":"quest","id":"68401","obj":{"i":68401,"n":"A Parting Gift","g":105,"l":"The Peaks","s":9090}}]}