{"quest":{"name":"A Hunger for Trade","location":"The Peaks","id":68387,"patch":4.0,"sort":8240,"unlocksFunction":1,"eventIcon":71341,"issuer":1023167,"target":1023167,"involved":[1023168,1023169],"genre":105,"journal":["The ponderous porter appears to have a request for you."],"objectives":["Speak with the testy trader.","Deliver the imperial supply crate to the Highlander merchant.","Deliver the sack of foodstuffs to the testy trader.","Speak with the ponderous porter."],"dialogue":[{"name":"MAN02851","text":"...You're not from around here, are you? You'd never see an Ala Mhigan strike up a conversation with a Radiata resident."},{"name":"MAN02851","text":"But seeing as we're already talking, I have a job that's just right for an outsider like you. Talk with the girl behind that building over there, and she'll give you all the details. She's a bit testy, mind you."},{"name":"MAN02851","text":"Did you find the lass I told you about? She's the one behind that building who looks ready to take a bite out of anyone who strays too close."},{"name":"WOMAN02851","text":"About bloody time. Here, take this supply crate and trade it with the merchant in Ala Ghiri for food. He's usually lurking in an alley somewhere. Shifty bastard. You'll know him when you see him."},{"name":"WOMAN02851","text":"<span class=\"emphasis\">Do not</span> tell him a Radiata native sent you. There'll be no grub for us if you do."},{"name":"MAN02851","text":"Sorry about the lass─she's really a sweetheart when her belly's not rumbling."},{"name":"WOMAN02851","text":"Food. We need it. The trader in Ala Ghiri has it. Do I really need to explain this to you?"},{"name":"MERCHANT02851","text":"You want to trade, you'll show me the goods first. Then maybe we'll deal."},{"name":"MERCHANT02851","text":"Gods, these are military-issue Mark XLIII sedatives! High-quality stuff. Someone snatched a batch a while ago, but you wouldn't believe how quickly imperial medicines sell."},{"name":"MERCHANT02851","text":"Folk are always on edge around here, you see, never knowing when the Empire might decide to launch an assault. Some get so worked up that they can scarcely sleep without a little alchemical encouragement."},{"name":"MERCHANT02851","text":"How much do you want for them? I'm a bit curious how you came by this stash, but I'll take it off your hands all the same."},{"name":"MERCHANT02851","text":"...Food? That's it─just food? All right, well here's a sackful of assorted edibles. Nice doing business with you!"},{"name":"MERCHANT02851","text":"If you come across any more of those sedatives, you know where to find me!"},{"name":"WOMAN02851","text":"Did you get the food? Tell me you got the food..."},{"name":"WOMAN02851","text":"Oh, praise the heavens! And praise you, too, stranger. This'll be the first proper meal we've had in days..."},{"name":"WOMAN02851","text":"Go back and speak with my large friend, if you would─I'd wager he'd like to show his thanks as well."},{"name":"WOMAN02851","text":"Did you speak with my friend yet? I'm sure he'd like to thank you, too."},{"name":"MAN02851","text":"No troubles with the merchant, were there? Good. Take that sack to my irritable accomplice and watch her squeal with delight."},{"name":"MAN02851","text":"Surprised to see us trading in imperial supplies? My quick-fingered friend once worked in a storeroom in Castrum Abania, and swiped those sedatives before she left."},{"name":"MAN02851","text":"This settlement's full of those as used to labor for the imperial army. The folk in Ala Ghiri may have traded with the Empire, but even they spit on Radiatans─the army's “whipped curs,” they call us."},{"name":"MAN02851","text":"That's why we needed you to make the deal. If one of us dared to set foot in that town, they'd chase us out with a hail of stones. Or worse."},{"name":"MAN02851","text":"But now we can eat our fill, get our strength back, and try to move on. Kind-hearted heroes like you are a godssend..."}],"reward":{"gil":738,"aetherCurrent":1,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68079]}},"partials":[{"type":"npc","id":"1023167","obj":{"i":1023167,"n":"Ponderous Porter","l":2407,"q":1}},{"type":"npc","id":"1023168","obj":{"i":1023168,"n":"Testy Trader","l":2407,"q":1}},{"type":"npc","id":"1023169","obj":{"i":1023169,"n":"Highlander Merchant","l":2407,"q":1}},{"type":"quest","id":"68079","obj":{"i":68079,"n":"Where Courage Endures","g":6,"l":"The Peaks","s":1030}}]}