{"quest":{"name":"Give Them the Evil Eye","location":"The Peaks","id":68388,"patch":4.0,"sort":8250,"eventIcon":71221,"issuer":1020888,"target":1020888,"genre":105,"journal":["Mawt is whispering to herself in sinister tones."],"objectives":["Place the fresh vegetables at the designated location.","Wait for an Abalathian catoblepas to appear, then use the paralytic powder on the creature and slay it for its eye.","Deliver the catoblepas eye to Mawt."],"dialogue":[{"name":"MAWT","text":"Do you know what a catoblepas is? You don't see them around much these days, but I spotted one that strayed from its herd."},{"name":"MAWT","text":"The eye of such a creature is said to possess baneful powers. I want it. I <span class=\"emphasis\">need</span> it! Now, I'm just a delicate lass, but I'll wager you'd have no trouble popping it free from that wandering monster's skull."},{"name":"MAWT","text":"Here, I have it all planned out: bait this spot over to the west with these vegetables, and wait for the catoblepas to toddle over and take a nibble. Then you fling this paralytic powder in its face!"},{"name":"MAWT","text":"That should slow it down enough to let you strike a clean killing blow─I don't want any harm to come to that precious eye. Right, then! I'll be waiting!"},{"name":"MAWT","text":"Was the plan not clear? Bait the spot with the vegetables, numb the catoblepas with the powder, then ease that wondrously evil eye from its socket!"},{"name":"MAWT","text":"I get a talisman of accursed power, and you get a pick from my hoarded goods. We both win!"},{"name":"MAWT","text":"Evil eye, evil eye, how I wish that you were mine...<br>Well? Did you get it? Is it unblemished?"},{"name":"MAWT","text":"Yes! It's perfect! Ah, just gazing into this foreboding orb sends a chill through my soul!"},{"name":"MAWT","text":"As my dear, departed nana used to say, “If you want the nastiest curse, use the eye of a catoblepas!”"},{"name":"MAWT","text":"Ahahaha. Mwahaha! Gyahahahahaha! My revenge is nigh, you imperial bastards! May the fleas of a thousand jhammels infest your nethers!"}],"reward":{"gil":703,"items":[{"id":18720,"one":1,"hq":1},{"id":18721,"one":1,"hq":1},{"id":18722,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68079]}},"partials":[{"type":"npc","id":"1020888","obj":{"i":1020888,"n":"Mawt","l":2407,"q":3}},{"type":"item","id":"18720","obj":{"i":18720,"n":"Palladium Choker of Fending","l":285,"c":54962,"t":40,"p":16485}},{"type":"item","id":"18721","obj":{"i":18721,"n":"Palladium Choker of Slaying","l":285,"c":54962,"t":40,"p":16485}},{"type":"item","id":"18722","obj":{"i":18722,"n":"Palladium Choker of Aiming","l":285,"c":54962,"t":40,"p":16485}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68079","obj":{"i":68079,"n":"Where Courage Endures","g":6,"l":"The Peaks","s":1030}}]}