{"quest":{"name":"Eau de Muud","location":"The Peaks","id":68382,"patch":4.0,"sort":8080,"eventIcon":71221,"issuer":1021599,"target":1021599,"involved":[1023132],"genre":105,"journal":["Rahu is staring intently into the distance for signs of movement."],"objectives":["Speak with the Ala Ghiri hunter.","Speak with Rahu.","Use the bottle of muud suud tallow on Rahu."],"dialogue":[{"name":"RAFE","text":"Mind your step. This headwind is helping us now, but the wind can be fickle. You don't want the Qiqirn picking up your scent."},{"name":"RAFE","text":"I've been posted here to monitor their movement, but I fear they may discover me soon as my, uh...<span class=\"emphasis\">perfume</span> has nearly run out."},{"name":"RAFE","text":"Wait a minute. You're an adventurer, right? I've got a job for you, if you're interested in making a bit of easy gil."},{"name":"RAFE","text":"I need you track down an acquaintance of mine─a hunter from Ala Ghiri─and fetch a flask of muud suud tallow from him."},{"name":"RAFE","text":"The Qiqirn have been unusually active the past few days, and I dare not take my eyes off them if I can help it. Bring me that flask, and consider yourself a few gil wealthier."},{"name":"RAFE","text":"He was likely heading this way, so he shouldn't be far from here. Don't take too long with that flask, now. I can't have the Qiqirn catching my scent."},{"name":"HUNTER02846","text":"Rahu sent you, did he? The Qiqirn must be up to something big if he can't be bothered to come meet me."},{"name":"HUNTER02846","text":"Luckily for him, I've already prepared another bottle of his <span class=\"emphasis\">perfume</span>."},{"name":"HUNTER02846","text":"Now listen: you must not, under any circumstances, open that bottle. One drop of that gets on your clothes, and you'll be smelling of chocobo shite for at least a week."},{"name":"HUNTER02846","text":"If you value your sense of smell, and perhaps your sanity, you'll be careful with that bottle."},{"name":"RAFE","text":"Good, you're back."},{"name":"RAFE","text":"Seeing as you're here, I've got one last favor to ask of you. Would you... &lt;gulp&gt; Would you sprinkle that there tallow on me? Just thinking about the smell, I...I can't bear to do it myself."},{"name":"RAFE","text":"Please, do it quick and be done with it."},{"name":"RAFE","text":"Ugh, oh gods, my nose! I swear this smells worse than before."},{"name":"RAFE","text":"You see, the only way to hide one's scent from the Qiqirn is to─&lt;cough&gt; &lt;cough&gt;─is to mask it with another. Considering their keen sense of smell, even facing in this general direction must be painful for them. Then again, they don't have to live with it..."},{"name":"RAFE","text":"You, uh... You may want to get going soon. Stay close for too long and you may have to live with this for a while yourself."}],"reward":{"gil":667,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"questsType":"all","quests":[68075,68370]},"next":[68384]},"partials":[{"type":"npc","id":"1021599","obj":{"i":1021599,"n":"Rahu","l":2407,"q":1}},{"type":"npc","id":"1023132","obj":{"i":1023132,"n":"Ala Ghiri Hunter","l":2407,"q":1}},{"type":"quest","id":"68075","obj":{"i":68075,"n":"For the Living and the Dead","g":6,"l":"The Peaks","s":990}},{"type":"quest","id":"68370","obj":{"i":68370,"n":"Lost in Transit","g":105,"l":"The Peaks","s":8070}},{"type":"quest","id":"68384","obj":{"i":68384,"n":"Soup's On","g":105,"l":"The Peaks","s":8100}}]}