{"quest":{"name":"Shimmer in the Scales","location":"The Peaks","id":68385,"patch":4.0,"sort":8210,"eventIcon":71221,"issuer":1020885,"target":1020885,"genre":105,"journal":["Garrulous Gall wishes to lay the groundwork for a new business."],"objectives":["Drip honey syrup on the ground at the destination, and obtain a pile of iridescent scales from a purple morpho.","Deliver the pile of iridescent scales to Garrulous Gall."],"dialogue":[{"name":"GARRULOUSGALL","text":"Are you with the Eorzean Alliance? We're grateful for all you've done to free Radiata from the grip of the imperials."},{"name":"GARRULOUSGALL","text":"We had to bow down to the Empire and do their army's grunt work just to survive each day. But now that they're gone, we're stuck looking for new ways to make a living."},{"name":"GARRULOUSGALL","text":"That's where you can help, if you're willing. All I need is for you to gather some scales from a purple morpho."},{"name":"GARRULOUSGALL","text":"Here, take this syrup. Drip it on the ground at this spot on your map, and the scent should attract one of those fluttering beauties."},{"name":"GARRULOUSGALL","text":"I can use the scales to set up a new business, you see, but even one damn morpho is too much for me to handle. Almost lost an eye the last time I tried..."},{"name":"GARRULOUSGALL","text":"Do you still have the syrup? Just drip some on the ground where I told you, and it should attract a morpho. Try not to damage the scales!"},{"name":"GARRULOUSGALL","text":"Did you get the scales?"},{"name":"GARRULOUSGALL","text":"Oh, these are just...<br>See how they glimmer in the light? They'll be perfect for crafting glamour prisms."},{"name":"GARRULOUSGALL","text":"...It was once my job to scrub the floors of the army's barracks and such. You wouldn't think that a particularly challenging task...until you find yourself mopping up the blood of your countrymen."},{"name":"GARRULOUSGALL","text":"I mean to put those dark days behind me by trading in things made of beauty and light. That's why I wanted those scales."},{"name":"GARRULOUSGALL","text":"Thank you for your help. I hope that the same brightness you've brought me will shine down on you when all's said and done."}],"reward":{"gil":595,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68079]}},"partials":[{"type":"npc","id":"1020885","obj":{"i":1020885,"n":"Garrulous Gall","l":2407,"q":2}},{"type":"quest","id":"68079","obj":{"i":68079,"n":"Where Courage Endures","g":6,"l":"The Peaks","s":1030}}]}