{"quest":{"name":"Strange Tastes","location":"The Peaks","id":68383,"patch":4.0,"sort":8090,"eventIcon":71221,"issuer":1020882,"target":1020882,"genre":105,"journal":["Guntmar could really use a pick-me-up."],"objectives":["Slay a muud suud for its horn.","Deliver the muud suud horn to Guntmar."],"dialogue":[{"name":"GUNTMAR","text":"Fancy meeting you here in a place like this. I could actually use a bit of help from a capable adventurer such as yourself."},{"name":"GUNTMAR","text":"Keeping watch up all by my lonesome is surprisingly tiresome work. Lately I haven't been able to keep focused, and I nod off at the strangest times of the day."},{"name":"GUNTMAR","text":"If you could bring me a single horn from the muud suuds over near Goodblade, it would help me immensely."},{"name":"GUNTMAR","text":"All I need is a single horn from the muud suuds around Goodblade. Should prove easy for an adventurer like you, right?"},{"name":"GUNTMAR","text":"Did you have any trouble getting the horn?"},{"name":"GUNTMAR","text":"Perfect. This is just what I needed to put the spring back in my step."},{"name":"GUNTMAR","text":"I was initially assigned to this post because of a passing familiarity with the land, but I've a few other tricks most folks don't know about. Like grinding these horns into a powder, then mixing it in boiling water. It's good for you, and has a kick that really wakes you up."},{"name":"GUNTMAR","text":"You know, with so few resources to get by on here in the mountains, it sometimes amazes me how we've managed to survive as long as we have. I suppose you could say it's a testament to the value of the knowledge and skills our forebears have passed down through the generations."},{"name":"GUNTMAR","text":"Ahem. Sorry about that. It's been so long since I've had anyone to talk to up here. Thanks again for your help."}],"reward":{"gil":595,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"questsType":"all","quests":[68075,68370]}},"partials":[{"type":"npc","id":"1020882","obj":{"i":1020882,"n":"Guntmar","l":2407,"q":4}},{"type":"quest","id":"68075","obj":{"i":68075,"n":"For the Living and the Dead","g":6,"l":"The Peaks","s":990}},{"type":"quest","id":"68370","obj":{"i":68370,"n":"Lost in Transit","g":105,"l":"The Peaks","s":8070}}]}