{"quest":{"name":"Radiata Stores","location":"The Peaks","id":68386,"patch":4.0,"sort":8220,"eventIcon":71221,"issuer":1020887,"target":1020887,"genre":105,"journal":["Godafre appears in need of some tight-lipped assistance."],"objectives":["Recover the unheavy package.","Deliver the unheavy package to Godafre."],"dialogue":[{"name":"GODAFRE","text":"Godsdammit...<br>This'll all fall through without the goods, but how am I supposed to get there and back without─"},{"name":"GODAFRE","text":"Bloody hells, where did you spring from!? Bah, never mind that─can you keep your mouth shut, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>?"},{"name":"GODAFRE","text":"I've a package hidden away over in Specula Imperatoris, and I need someone discreet to go and fetch it for me."},{"name":"GODAFRE","text":"Don't let its size dissuade you─the thing's as light as air. I'd head over there myself, you know, but if folk were to spot me it would cause <span class=\"emphasis\">complications</span> for future dealings. Well, go on! There's a reward in it for you!"},{"name":"GODAFRE","text":"The package is in a secluded corner of Specula Imperatoris. Try to slip in and out with no one the wiser if you can manage it, eh?"},{"name":"GODAFRE","text":"Well? Did you bring the goods?"},{"name":"GODAFRE","text":"Aye, that's the stuff! You've done this sort of thing before, eh?"},{"name":"GODAFRE","text":"I see what you're thinking: “What's in this big package that weighs next to naught?” Well, I'd better satisfy your curiosity before you start asking questions to the wrong people. It's tobacco, my friend─made right here in Radiata."},{"name":"GODAFRE","text":"I used to be a porter for the imperials, you see, carting supplies around all day until my back was screaming. The officers would complain about their military-issue pipeweed, so I started earning myself a few small luxuries by smuggling in Radiata's best. On the quiet, of course."},{"name":"GODAFRE","text":"And I'd appreciate it if you could keep quiet, too. I mean to sell to the Resistance forces next, and they'd best not know about my previous customers."},{"name":"GODAFRE","text":"Here's the reward I promised you. Half for the job, and half to keep your lips sealed, understand?"}],"reward":{"gil":595,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68079]},"next":[68390]},"partials":[{"type":"npc","id":"1020887","obj":{"i":1020887,"n":"Godafre","l":2407,"q":4}},{"type":"quest","id":"68079","obj":{"i":68079,"n":"Where Courage Endures","g":6,"l":"The Peaks","s":1030}},{"type":"quest","id":"68390","obj":{"i":68390,"n":"Jhammel and Hide","g":105,"l":"The Peaks","s":8230}}]}