{"quest":{"name":"Finding Family","location":"The Peaks","id":68398,"patch":4.0,"sort":9060,"icon":100712,"eventIcon":71221,"issuer":1023268,"target":1023270,"involved":[1020871,1021587,1021591,1023269],"genre":105,"journal":["Berehta cannot stop thinking about her son.","Knowing her son is safe is simply not enough for Berehta. She asks that you continue your search, suggesting you begin in Ala Ghiri, where he likely went to rest and gather supplies.","Speaking with the people of Ala Ghiri, it would seem the Allied forces may know something of Erart. Perhaps one of the Grand Company officers stationed there can offer more information as to his whereabouts.","You speak with a flame captain who confirms a man from Coldhearth fitting Erart's description is a part of his unit. Unfortunately, he has already been dispatched to Specula Imperatoris to dispense with the potential threat of Garlean drones. You set your sights north in hopes of meeting with him before he leaves elsewhere.","You arrive to find a golden-locked lieutenant who you are confident is the man you are looking for. Before he will take time to speak with you, however, he insists on completing the task set before him. To that end, you assist him in searching for any drones that may be hiding in the abandoned Garlean base.","After searching several locations as instructed by the lieutenant, you locate and destroy a number of malfunctioning drones. Perhaps now you can finally get answers.","The lieutenant is, in fact, from Coldhearth, but he is sadly not the man you were expecting. That said, he is certain the Resistance will know where Erart has escaped to."],"objectives":["Gather information at Ala Ghiri.","Speak with the flame captain.","Search for the golden-locked lieutenant.","Survey the designated locations and destroy any malfunctioning bits that appear.","Report to the golden-locked lieutenant."],"dialogue":[{"name":"BEREHTA","text":"I'm sure you're tired of me badgerin' you with favors, but it would mean the world to me if you could keep lookin' for my boy Erart."},{"name":"BEREHTA","text":"If he passed through that Garlean outpost to the north, then he'd have to stop at Ala Ghiri to rest and gather supplies."},{"name":"BEREHTA","text":"I know it's far, but please: go and see if there's any sign of him."},{"name":"BEREHTA","text":"If you find Erart, tell him he can expect a piece of my mind when he returns. I'll teach him to leave his mother sick with worry for two years."},{"name":"CAPTAIN02862","text":"I'm sorry, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, but unless you have urgent business to discuss I must ask you to move along."},{"name":"GERBOD","text":"Erart? Can't say I know him. Truth be told, if you're talkin' two years ago, Ala Ghiri isn't a place he'd want to be."},{"name":"JNAIROH","text":"Come to think of it, the soldiers who stopped by my shop mentioned someone who came from Coldhearth. Could be they know the man you're looking for."},{"name":"WEIDHERI","text":"Erart? Ah, a few bells ago a pair of customers mentioned him. Can't say what else they talked about, though. It's not my place to pry."},{"name":"GERBOD","text":"Until recently this was a Garlean stronghold. There's no way anyone would come here seekin' shelter."},{"name":"JNAIROH","text":"I'm sure those soldiers are still here if you're thinking of having a talk with them."},{"name":"WEIDHERI","text":"If you take a look they're like to be traipsing about here somewhere."},{"name":"CAPTAIN02862","text":"Oh, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename Surname</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>! I hardly recognized you. To what do we owe the honor of your presence?"},{"name":"CAPTAIN02862","text":"Yes, one of my subordinates is from Coldhearth. I would introduce you to him, but I'm afraid he was dispatched not long ago to destroy magitek drones sighted near Specula Imperatoris."},{"name":"CAPTAIN02862","text":"In fact, I imagine he should be arriving there very soon."},{"name":"CAPTAIN02862","text":"If you have pressing matters to discuss with him, I would urge you to go and meet him out at Specula Imperatoris."},{"name":"SECONDLIEUTENANT02862","text":"Whatever business you have will have to wait. This area must be cleared of magitek drones posthaste."},{"name":"SECONDLIEUTENANT02862","text":"They could be upon us at any moment. I'm sorry, but I must ask you to vacate the area. Or, perhaps, if you're willing to assist me..."},{"name":"SECONDLIEUTENANT02862","text":"Have a look at my map. This is our present location. I'd like you to survey these three areas and dispense with any drones you encounter. We can speak after you've returned."},{"name":"SECONDLIEUTENANT02862","text":"Proceed with caution. These drones won't hesitate when they've located a target."},{"name":"SYSTEM","text":"You see no sign of the Garlean drones."},{"name":"SECONDLIEUTENANT02862","text":"You're returned, and with nary a scratch. Excellent work."},{"name":"SECONDLIEUTENANT02862","text":"Now then, what is it you wished to speak with me about?"},{"name":"SECONDLIEUTENANT02862","text":"Coldhearth? Yes, that is my home, but I'm afraid I don't know this Erart fellow. You say he left two years ago? No, I was forced to leave long before that."},{"name":"SECONDLIEUTENANT02862","text":"Five years ago, the Garleans came and conscripted any able-bodied men they could find. I was one of the unlucky few to be sent to Doma. Or so I thought."},{"name":"SECONDLIEUTENANT02862","text":"The people of Doma attempted to revolt, and in the ensuing chaos my unit was all but wiped out. I was the only survivor. I thought it better to brave the unknown than return to the imperials in defeat, so I made my escape."},{"name":"SECONDLIEUTENANT02862","text":"What followed was a perilous venture with no promise of a tomorrow. Yet somehow I managed my way to Ul'dah where I enlisted in the Immortal Flames."},{"name":"SECONDLIEUTENANT02862","text":"I'm honestly surprised Coldhearth is still there after all this time. With the population dwindling as it was, I was certain the Garleans had robbed the place of all its prospective soldiers and put the rest to the sword. "},{"name":"SECONDLIEUTENANT02862","text":"But enough of my ramblings. Unfortunately I don't know the man you're looking for, but if he was seeking safety, he likely found it with the Resistance."},{"name":"SECONDLIEUTENANT02862","text":"Whether he meant to fight or flee beyond Baelsar's Wall, their help would be indispensable. I'm sure they will have answers for you."}],"reward":{"gil":800,"items":[{"num":3,"id":5668}],"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"questsType":"all","quests":[68081,68397]},"next":[68399]},"partials":[{"type":"npc","id":"1023268","obj":{"i":1023268,"n":"Berehta","l":2407,"q":5}},{"type":"npc","id":"1023270","obj":{"i":1023270,"n":"Golden-locked Lieutenant","l":2407,"q":2}},{"type":"npc","id":"1020871","obj":{"i":1020871,"n":"Weidheri","l":2407,"q":5}},{"type":"npc","id":"1021587","obj":{"i":1021587,"n":"J'nairoh","l":2407,"q":4}},{"type":"npc","id":"1021591","obj":{"i":1021591,"n":"Gerbod","l":2407,"q":5}},{"type":"npc","id":"1023269","obj":{"i":1023269,"n":"Flame Captain","l":2407,"q":1}},{"type":"item","id":"5668","obj":{"i":5668,"n":"Heavens' Eye Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Direct Hit Rate","category":0}}},{"type":"quest","id":"68081","obj":{"i":68081,"n":"Raubahn's Invitation","g":6,"l":"The Peaks","s":1050}},{"type":"quest","id":"68397","obj":{"i":68397,"n":"Helping a Friend","g":105,"l":"The Peaks","s":9050}},{"type":"quest","id":"68399","obj":{"i":68399,"n":"Her Only Son","g":105,"l":"The Peaks","s":9070}}]}