{"quest":{"name":"Her Only Son","location":"The Peaks","id":68399,"patch":4.0,"sort":9070,"icon":100712,"eventIcon":71221,"issuer":1023270,"target":1023268,"involved":[1020882,1023275],"genre":105,"journal":["This golden-locked lieutenant seems to have something else to share with you.","While the lieutenant has no other information to offer you about Erart, he knows someone who can─Guntmar of the Resistance, who is quite knowledgeable of any and all happenings in the Peaks.","For a blessing, Guntmar not only knows Erart, but also the unit to which he has been assigned. He goes on to tell you that, at this very moment, they are making their way to Ala Mhigo. He suggests you make haste to Castrum Abania if you wish to catch up with them.","You finally track down the captain of Erart's unit. When you mention his name, the captain dithers about what to say next. You sincerely /doubt he has any reason to hesitate.","The captain eventually relents and tells you all. Erart assumed the identity of a wealthy Ala Mhigan merchant's son in order to infiltrate the Garleans' army. After a recent clash with the Allied forces, however, they lost contact with him. Assuming the worst, the captain was prepared to deliver a letter to his mother, penned by Erart in the event of his death. Having come so far for answers, the captain feels it appropriate that you take the letter to Berehta.","You deliver the letter to Berehta, explaining to her what became of Erart. Too overwhelmed by grief to even open the letter, she begs you a moment to regain her composure."],"objectives":["Speak with Guntmar.","Speak with the Resistance captain.","Express your /doubt of the captain's hesitation.","Deliver Erart's letter to Berehta."],"dialogue":[{"name":"SECONDLIEUTENANT02863","text":"If you plan on speaking with someone from the Resistance, might I suggest seeking out Guntmar? You would be hard-pressed to find a man who knows more of the Peaks than him."},{"name":"SECONDLIEUTENANT02863","text":"He should be back at our camp, due west of here."},{"name":"SECONDLIEUTENANT02863","text":"Guntmar was born and raised here in the Peaks, and makes it his business to know anything of importance that goes on here. I'm certain he can help you."},{"name":"BEREHTA","text":"If you find Erart, tell him he can expect a piece of my mind when he returns. I'll teach him to leave his mother sick with worry for two years."},{"name":"GUNTMAR","text":"Erart? Why yes, he's a member of the Resistance. Good lad. Can't say I've heard any complaints about him. "},{"name":"GUNTMAR","text":"His unit was dispatched to Ala Mhigo not long ago. If you hurry, you may be able to catch him near Castrum Abania."},{"name":"GUNTMAR","text":"If you wish to speak with him, I suggest you leave now. He and his men are likely passing Castrum Abania even as we speak."},{"name":"ARMYLEADER02863","text":"Ah, <span class=\"highlight\">Forename Surname</span> of the Scions. Well met. What brings you here to the Peaks?"},{"name":"ARMYLEADER02863","text":"You're looking for Erart? On behalf of his mother, you say? I see... Well, he is... Erm, how should I put this?"},{"name":"SYSTEM","text":"The Resistance captain seems to be bearing distressing news. Expressing your <span class=\"highlight\">doubt</span> for the need to hesitate may convince him to speak."},{"name":"ARMYLEADER02863","text":"This is rather confidential business you're asking about. Though I suppose it would only be a matter of time before you were made privy to it..."},{"name":"ARMYLEADER02863","text":"Alright, alright. I'll tell you. Erart is─or rather, was─a member of my unit. He was reassigned in light of an opportunity for him to assist in gathering Garlean intelligence."},{"name":"ARMYLEADER02863","text":"As it turns out, he bears a striking resemblance to the son of one of our Garlean contacts─an Ala Mhigan merchant who bribed his way into citizenship. He agreed to allow Erart to stand in for his son that he could infiltrate their military."},{"name":"ARMYLEADER02863","text":"The price was steep. Steeper still to have him placed among the most renowned unit of Ala Mhigans in service to the imperials─the Skulls."},{"name":"ARMYLEADER02863","text":"He's supplied us with indispensable insight into the inner workings of their military, all the while maintaining his turncoat facade. He's even gone so far as to take arms against his Eorzean comrades. "},{"name":"ARMYLEADER02863","text":"However, after a recent clash with the Skulls, he's ceased all contact with us. To be frank, we fear the worst."},{"name":"ARMYLEADER02863","text":"In the event anything should happen to him, he prepared a final letter to be delivered to his mother. Having come this far on her behalf, I think it only appropriate you be the one to deliver it."},{"name":"ARMYLEADER02863","text":"Tell his mother he died fighting for the freedom of Ala Mhigo, that his selfless sacrifice will be forever honored by soldiers and civilians alike."},{"name":"BEREHTA","text":"Oh my, you're back! You were gone for so long. Did you find anythin'?"},{"name":"BEREHTA","text":"A letter from Erart? Does this mean he'll be comin' home soon?"},{"name":"BEREHTA","text":"Oh, Erart... I suspected somethin' had happened, but I didn't want to believe it."},{"name":"BEREHTA","text":"My boy was always so kind, so fierce. He was the sort of man who'd want to die fightin', with his head held high. I'm sure that's what happened."},{"name":"BEREHTA","text":"At least now I know he's...he's... Excuse me, I need a moment."}],"reward":{"gil":900,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"questsType":"all","quests":[68081,68398]},"next":[68400]},"partials":[{"type":"npc","id":"1023270","obj":{"i":1023270,"n":"Golden-locked Lieutenant","l":2407,"q":2}},{"type":"npc","id":"1023268","obj":{"i":1023268,"n":"Berehta","l":2407,"q":5}},{"type":"npc","id":"1020882","obj":{"i":1020882,"n":"Guntmar","l":2407,"q":4}},{"type":"npc","id":"1023275","obj":{"i":1023275,"n":"Resistance Captain","l":2407,"q":1}},{"type":"quest","id":"68081","obj":{"i":68081,"n":"Raubahn's Invitation","g":6,"l":"The Peaks","s":1050}},{"type":"quest","id":"68398","obj":{"i":68398,"n":"Finding Family","g":105,"l":"The Peaks","s":9060}},{"type":"quest","id":"68400","obj":{"i":68400,"n":"His Last Words","g":105,"l":"The Peaks","s":9080}}]}