{"quest":{"name":"Boots Made for Walking","location":"The Peaks","id":68395,"patch":4.0,"sort":9030,"eventIcon":71221,"issuer":1020896,"target":1020896,"involved":[1023136],"genre":105,"journal":["Rawkin is in need of an adventurer with a strong pair of legs."],"objectives":["Pick up the earthenware vase.","Deliver the earthenware vase to the Midlander merchant.","Report to Rawkin."],"dialogue":[{"name":"RAWKIN","text":"You've the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who travels. Aye, a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> not afraid to do a bit of walking. Might be you could help me with something."},{"name":"RAWKIN","text":"I was to make a delivery of provisions to Ala Ghiri, but it's taken me so long to get everything ready, I'm afraid I'll never get there by the agreed-upon time."},{"name":"RAWKIN","text":"The only way I'd even have a chance at this point is to pass through the Scabbard."},{"name":"RAWKIN","text":"That's assuming, of course, I don't break my legs climbing down the cliffside. By the look of you, I'm betting you could do it without breaking a sweat."},{"name":"RAWKIN","text":"If you'd be willing to help, pick up that vase there and carry it down to Ala Ghiri."},{"name":"RAWKIN","text":"The fastest way to Ala Ghiri is through the Scabbard. Mind your step climbing down the cliff."},{"name":"SYSTEM","text":"Transport the earthenware vase to the specified location at Ala Ghiri before the Midlander merchant grows impatient and calls off the arrangement."},{"name":"SYSTEM","text":"You will have two minutes to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"MERCHANT02859","text":"What in the hells is taking him so long? I haven't all day."},{"name":"MERCHANT02859","text":"Rawkin's supplies! Thank you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, for coming all this way."},{"name":"MERCHANT02859","text":"Tell him he can expect payment to be delivered in the next few days as promised."},{"name":"MERCHANT02859","text":"I'm a man of my word. As soon as this shipment reaches its final destination, his payment will be sent at once."},{"name":"RAWKIN","text":"You made it? Thank the gods."},{"name":"RAWKIN","text":"Back in the day, I could've climbed up and down that mountain on one leg if I wanted. I was a soldier, you see, so I had to stay in top physical condition. But war can be cruel. After a few nasty injuries, it was a wonder I made it back here at all."},{"name":"RAWKIN","text":"It was thinking about my time in service, though, that reminded me that soldiers now will be needing any medicine they can get their hands on."},{"name":"RAWKIN","text":"We don't have much, but with everyone pitching in, we can usually sell enough to get by."},{"name":"RAWKIN","text":"Just enough for warm clothes and food to fill our bellies. It's a simple life, but I wouldn't trade it for anything."}],"reward":{"gil":673,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68081]}},"partials":[{"type":"npc","id":"1020896","obj":{"i":1020896,"n":"Rawkin","l":2407,"q":1}},{"type":"npc","id":"1023136","obj":{"i":1023136,"n":"Midlander Merchant","l":2407,"q":1}},{"type":"quest","id":"68081","obj":{"i":68081,"n":"Raubahn's Invitation","g":6,"l":"The Peaks","s":1050}}]}