{"quest":{"name":"Foper Faux Pas","location":"The Peaks","id":68392,"patch":4.0,"sort":8280,"eventIcon":71221,"issuer":1021579,"target":1021579,"involved":[1023338],"genre":105,"journal":["Hruodiger seeks a partner for his money-making scheme."],"objectives":["Use the blowpipe at the watering hole, and stun the foper with a paralyzing dart.","Capture the twitching foper.","Deliver the twitching foper to Hruodiger."],"dialogue":[{"name":"HRUODIGER","text":"Do you like money? Sure you do! Work with me to capture the foper over by the watering hole, and we'll be swimming in coins, my friend!"},{"name":"HRUODIGER","text":"I'll explain the why of it afterwards, but you need to take that walking eyeball alive!"},{"name":"HRUODIGER","text":"As for the how, I've got the perfect tool for the job. Here, take this!"},{"name":"HRUODIGER","text":"The darts that come with that blowpipe are coated with poison. Not lethal, of course, but you pop one of those into the foper, and it'll be twitching on the ground within moments."},{"name":"HRUODIGER","text":"Easy, eh? Head over to the watering hole and find a spot where you can snipe the critter from a safe distance─trust me, you don't want to get too close."},{"name":"HRUODIGER","text":"Once the foper's down for the count, scoop it up in a sack or something and bring it back to me. There's some risk involved, to be sure, but I promise you'll be paid for your trouble!"},{"name":"HRUODIGER","text":"The foper lurks by that watering hole to the southwest. Find yourself a safe spot to pop him with a dart, then bring the critter back to me. Alive, or the deal's off."},{"name":"HRUODIGER","text":"Well, did you get the little blighter?"},{"name":"HRUODIGER","text":"It's in there! It's actually in there! Alright, calm down, Hruo..."},{"name":"HRUODIGER","text":"Do you have any idea how much foper tears are worth to an alchemist? Now that we've captured ourselves a live foper, we can harvest them whenever we damn well please."},{"name":"HRUODIGER","text":"Just a quick whack on its head, and out pours liquid gold! We'll be stinking rich!"},{"name":"HRUODIGER","text":"...Eh? What's to stop it from turning its eye on me? Well, you see, I'd... Hm, or maybe I could tie it─ Ah, no that wouldn't work...<br>You know what? I didn't really think this through..."},{"name":"HRUODIGER","text":"Bloody hells! When it wakes up, I'll have an angry foper in a sack! I'd better put it back where it came from..."}],"reward":{"gil":667,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68079]}},"partials":[{"type":"npc","id":"1021579","obj":{"i":1021579,"n":"Hruodiger","l":2407,"q":2}},{"type":"npc","id":"1023338","obj":{"i":1023338,"n":"Twitching Foper","l":2407,"q":1}},{"type":"quest","id":"68079","obj":{"i":68079,"n":"Where Courage Endures","g":6,"l":"The Peaks","s":1030}}]}