{"quest":{"name":"Family First","location":"The Peaks","id":68394,"patch":4.0,"sort":9020,"eventIcon":71221,"issuer":1020895,"target":1020895,"genre":105,"journal":["Papin wants to surprise his family with something nice."],"objectives":["Slay true griffins for their meat.","Deliver the griffin meat to Papin."],"dialogue":[{"name":"PAPIN","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>? I heard you adventurers are really brave, and strong. Do you think you can help me? I want to get Ma something real special, but I can't do it myself."},{"name":"PAPIN","text":"North of the village are these huge bird things called griffins, and their meat's supposed to be some of the best around."},{"name":"PAPIN","text":"If you could bring back even just a little, I'm sure it would make Ma awful happy to have it."},{"name":"PAPIN","text":"If you head up north, where all the soldiers used to be, there should be griffins around there. At least, that's what Ma says."},{"name":"PAPIN","text":"My, that was fast. Did you see any griffins?"},{"name":"PAPIN","text":"Wow, I didn't think you would bring back so much. You adventurers are really something else."},{"name":"PAPIN","text":"Have you ever had any before? Ma says this meat's supposed to be filled with all sorts of nutrients. Griffins are too dangerous to hunt, though, so we never get to eat any. Ma and Sis will be so happy."},{"name":"PAPIN","text":"A shame Pa isn't here to try it. He had to go away on work. He used to send me letters every day, but lately there's been nothing."},{"name":"PAPIN","text":"I'm sure he's okay. He's really strong, just like you. And when he comes back, we'll go hunting and have griffin meat all the time!"}],"reward":{"gil":637,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68081]}},"partials":[{"type":"npc","id":"1020895","obj":{"i":1020895,"n":"Papin","l":2407,"q":1}},{"type":"quest","id":"68081","obj":{"i":68081,"n":"Raubahn's Invitation","g":6,"l":"The Peaks","s":1050}}]}