{"quest":{"name":"Jhammel and Hide","location":"The Peaks","id":68390,"patch":4.0,"sort":8230,"eventIcon":71221,"issuer":1020887,"target":1020887,"genre":105,"journal":["Godafre has a tall favor to ask of you."],"objectives":["Obtain hides from jhammels.","Deliver the jhammel hides to Godafre."],"dialogue":[{"name":"GODAFRE","text":"Ah, my tight-lipped friend! Retrieving that tobacco for me really helped me out, but I have another favor to ask if you're willing..."},{"name":"GODAFRE","text":"You know what a jhammel is, don't you? Tall leaf-eaters? Long necks? Look around, and you can probably spot one now."},{"name":"GODAFRE","text":"They seem docile enough, aye, but a kick from one of those massive legs will send most ordinary folk sailing into the nether-realm. And I consider myself fairly ordinary."},{"name":"GODAFRE","text":"You, on the other hand, seem the type who can shrug off a hoof or two to the face. Do you think you could take down some of those towering beastkin, and gather me three of their hides...?"},{"name":"GODAFRE","text":"Head westward, and you'll soon come across the jhammels' grazing grounds. Three of their huge hides should be enough to get me started..."},{"name":"GODAFRE","text":"Didn't get yourself trampled, then? Let's have a look at what you've brought..."},{"name":"GODAFRE","text":"Ah, now these are some high-quality hides. Once I've cleaned and cured them, I can craft them into armor for the Resistance troops."},{"name":"GODAFRE","text":"When I wasn't busy lugging things around, the Garleans would send me to the factory and make me sew their unnatural fibers into uniforms. Now, at least, I can put those skills to use for my countrymen instead."},{"name":"GODAFRE","text":"Thanks to you, I'm almost ready to stand on my own two feet. You'll still be in town for a little while yet, won't you...?"}],"reward":{"gil":631,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"questsType":"all","quests":[68079,68386]}},"partials":[{"type":"npc","id":"1020887","obj":{"i":1020887,"n":"Godafre","l":2407,"q":4}},{"type":"quest","id":"68079","obj":{"i":68079,"n":"Where Courage Endures","g":6,"l":"The Peaks","s":1030}},{"type":"quest","id":"68386","obj":{"i":68386,"n":"Radiata Stores","g":105,"l":"The Peaks","s":8220}}]}