{"quest":{"name":"Critical Moss","location":"The Peaks","id":68391,"patch":4.0,"sort":8270,"eventIcon":71221,"issuer":1020886,"target":1020886,"genre":105,"journal":["Oggery needs a strong hand to save the trees."],"objectives":["Search around the watering hole, and obtain mossling clumps from mossified mosslings.","Bury mossling clumps between rotted roots.","Return to Oggery."],"dialogue":[{"name":"OGGERY","text":"Well, now, those look like nice, strong hands. Not afraid to get them dirty, are you?"},{"name":"OGGERY","text":"I only ask because the trees around here could use some attention. Their roots have begun to rot, and if naught is done we stand to lose the only large vegetation for malms."},{"name":"OGGERY","text":"There is a way to save them, though. I need you to head to the watering hole to the southwest, and find a couple of mosslings to hack apart."},{"name":"OGGERY","text":"Gather up what's left of them, and then bury the clumps in between the roots of the trees that grow near the water. That should do the trick."},{"name":"OGGERY","text":"You'll find the mosslings in the watering hole to the southwest. They're surprisingly aggressive little buggers, so you shouldn't have any trouble getting their attention."},{"name":"OGGERY","text":"Once you've reduced a couple to mossy clumps, bury what's left of them in the roots of the nearby trees. That's all there is to it."},{"name":"OGGERY","text":"Got some mossling clumps, have you? Look for the trees with rotted roots over by the watering hole, and mulch those mossy remains into the dirt at the base of their trunks."},{"name":"OGGERY","text":"All finished, then?"},{"name":"OGGERY","text":"There's a certain mold which afflicts the tree roots, see, and some property of the mosslings works to kill that mold off. I don't rightly know how or why it works, but the trees are hardy enough to recover from the damage."},{"name":"OGGERY","text":"Thank you, friend─with all the other troubles besieging the land, it's hard to find anyone to care about a few scraggly trees. But I think they could teach us all a thing or two about survival..."}],"reward":{"gil":667,"xp":116100},"reqs":{"jobs":[{"lvl":68,"id":34}],"quests":[68079]}},"partials":[{"type":"npc","id":"1020886","obj":{"i":1020886,"n":"Oggery","l":2407,"q":2}},{"type":"quest","id":"68079","obj":{"i":68079,"n":"Where Courage Endures","g":6,"l":"The Peaks","s":1030}}]}