{"quest":{"name":"Closing Up Shop","location":"The Peaks","id":68396,"patch":4.0,"sort":9040,"unlocksFunction":1,"eventIcon":71341,"issuer":1020893,"target":1020893,"involved":[1020870,1020886,1020887,1020888],"genre":105,"journal":["An important individual has yet to visit Coldhearth, and Sagar is growing concerned."],"objectives":["Inquire about the missing merchant at Radiata.","Search for Fraunk at Ala Ghiri.","Speak with Sagar."],"dialogue":[{"name":"SAGAR","text":"You're one of those adventurers, aren't you? Travel this way and that, always helpin' folks? Well, I believe I speak for all of us here when I say we need your help."},{"name":"SAGAR","text":"I'm sure you've noticed, but we don't have much. The only reason we get by is a merchant who comes and sells us supplies. I say “sell,” but it's so cheap, he might as well give it away."},{"name":"SAGAR","text":"Trouble is, without so much as a word he suddenly stopped comin'. I'd go and search for him myself, but anyone who could've kept watch while I'm gone has been conscripted by those damn imperials."},{"name":"SAGAR","text":"Would you try askin' around at Radiata if anyone's seen him? He always talked about goin' there, so I figure it's a good place to start."},{"name":"SAGAR","text":"I bet someone at Radiata has seen him. He often mentioned his trips there."},{"name":"OGGERY","text":"A merchant traveling to <span class=\"emphasis\">Coldhearth</span>? Wait, that's the guy in league with the imperials, isn't he? Now that you mention it, I haven't seen him in a while."},{"name":"OGGERY","text":"I wonder what he's been up to."},{"name":"GODAFRE","text":"Ya, I've heard of him. His name's Fraunk. Some folks say he's doing those people a favor, but I think he's up to something."},{"name":"GODAFRE","text":"Nobody sells their wares for that cheap without good reason."},{"name":"MAWT","text":"Coldhearth? Why would anyone sell their wares in that ghost town?"},{"name":"MAWT","text":"I can't imagine why anyone would go there. No money to be made."},{"name":"FRAUNK","text":"They're asking about me at Coldhearth? I'd love to help, but the situation has gotten complicated, you see. The reason I was selling to them so cheap is because someone else was footing the bill."},{"name":"FRAUNK","text":"Some imperial soldier─said he grew up there. He went to the Garleans willingly, if you can believe it. They made him a watchman at one of their labor camps, and he's been funneling all his pay to me, granted I keep peddling my goods at Coldhearth."},{"name":"FRAUNK","text":"Afraid his friends and family would refuse his gifts after turning his back on them, he got the smart idea of sending me up there, selling whatever they need for next to nothing. The thing is, he hasn't contacted me in days."},{"name":"FRAUNK","text":"A shame too. On my next trip I was supposed to deliver this bottle of arak. It's hard to come by nowadays, but he paid me good money to find it."},{"name":"FRAUNK","text":"Would you mind taking it there for me? As for this conversation, I'll leave it up to you whether or not you tell anyone. All things considered, I think he might've wanted someone to know."},{"name":"SAGAR","text":"Did you find any sign of the merchant?"},{"name":"SAGAR","text":"He was paid to come here by an imperial turncoat!? They worked at a labor camp...? No, it can't be!"},{"name":"SAGAR","text":"A bottle of arak. My son said... He said someday, we'd..."},{"name":"SAGAR","text":"Never mind about the merchant. Here. It's not much, but you deserve it. Thank you for this."}],"reward":{"gil":673,"aetherCurrent":1,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68081]},"next":[68397]},"partials":[{"type":"npc","id":"1020893","obj":{"i":1020893,"n":"Sagar","l":2407,"q":3}},{"type":"npc","id":"1020870","obj":{"i":1020870,"n":"Fraunk","l":2407,"q":3}},{"type":"npc","id":"1020886","obj":{"i":1020886,"n":"Oggery","l":2407,"q":2}},{"type":"npc","id":"1020887","obj":{"i":1020887,"n":"Godafre","l":2407,"q":4}},{"type":"npc","id":"1020888","obj":{"i":1020888,"n":"Mawt","l":2407,"q":3}},{"type":"quest","id":"68081","obj":{"i":68081,"n":"Raubahn's Invitation","g":6,"l":"The Peaks","s":1050}},{"type":"quest","id":"68397","obj":{"i":68397,"n":"Helping a Friend","g":105,"l":"The Peaks","s":9050}}]}