{"quest":{"name":"His Last Words","location":"The Peaks","id":68400,"patch":4.0,"sort":9080,"icon":100712,"eventIcon":71221,"issuer":1023268,"target":1023268,"involved":[1023259,1023295],"genre":105,"journal":["Berehta is ready to read her son's parting words.","Berehta confesses she is too distraught to read Erart's letter, handing it to you to read in her stead. According to the missive, Erart left a gift for his mother with J'dyalani of Ala Ghiri. She has been instructed to hand over the package upon telling her it is time to “rekindle the flames of hope.” Unfit to make the journey herself, Berehta asks you to retrieve her son's parting gift. ","You relay the secret message to J'dyalani as described in the letter, and she presents you with a small pouch. Berehta will be excited to see what is inside.","Berehta opens the pouch to reveal seeds and an accompanying note. It says they are date seeds from Garlemald, and will grow even in the most barren soil. As she leaves to inform the others of what she received, a mysterious figure steps in from the shadows, and reveals himself to be the allegedly deceased Erart. He believes his countrymen will not forgive his actions, even if they were for the sake of the Resistance, and so he faked his own death. He has resigned himself to traveling abroad to continue the fight against Garlemald in a distant land. To that end, he takes his leave, knowing Coldhearth rests in good hands.","You find Berehta in good spirits, ready to begin planting seeds. She invites you to return to Coldhearth when the date palms have grown, to partake of the fruit born from Erart's sacrifice."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “rekindle the flames of hope” to receive a package from J'dyalani.","Deliver Erart's parting gift to Berehta.","Speak with Berehta."],"dialogue":[{"name":"BEREHTA","text":"Sorry about before. Deep down I always knew something had happened, but I didn't want to believe it."},{"name":"BEREHTA","text":"Whatever he had to say must've been terribly important..."},{"name":"BEREHTA","text":"I'm sorry. I thought I was ready, but I can't. Would you mind takin' a look at it first? If I start tearin' up again I'll never make it to the bottom of the page."},{"name":"BEREHTA","text":"(-Erart's Letter-)Dear mother,<br>If you're reading this letter, then I'm very sorry, but I won't be returning home. Please don't be mad, and don't be sad. Just know that I did what I had to for the sake of Ala Mhigo."},{"name":"BEREHTA","text":"(-Erart's Letter-)I had hoped to deliver this to you in person, but I have a gift waiting for you in Ala Ghiri in the care of J'dyalani."},{"name":"BEREHTA","text":"(-Erart's Letter-)Go to her, and tell her it is time to rekindle the flames of hope. She will know what to do. I pray this brings you the same happiness you brought me and so many others over the years."},{"name":"BEREHTA","text":"What did my boy have to say?"},{"name":"BEREHTA","text":"&lt;sniffle&gt; Even when he's gone, he's lookin' out for us. I know I've been nothin' but a nuisance to you, but... Do you think you could go and pick up that package for me?"},{"name":"BEREHTA","text":"Thank you. &lt;sniffle&gt; Thank you so much..."},{"name":"BEREHTA","text":"I wonder what it is he left me. Whatever it is, I'll cherish it till my dying day."},{"name":"JDYALANI","text":"<span class=\"highlight\">Forename</span>! What a pleasant surprise. What brings you to Ala Ghiri?"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any expression that contains the phrase “rekindle the flames of hope” to let J'dyalani know why you've come."},{"name":"SAYTODO","text":"rekindle the flames of hope"},{"name":"JDYALANI","text":"Ah! Yes, for our hearths and homes have been cold for far too long. I assumed this was meant for some nefarious end when that soldier from the Skulls gave this to me. I've always kept it close out of habit, but no one ever came to claim it."},{"name":"JDYALANI","text":"I see... So he sacrificed himself for the Resistance. Please give his family my condolences."},{"name":"JDYALANI","text":"The Skulls were always a rather belligerent bunch, but I remember he was different than the rest. We could have used more people like him back then."},{"name":"BEREHTA","text":"There you are. My nerves have had me up an' walkin' about all over waiting for you to get back. So, did you get the package?"},{"name":"BEREHTA","text":"Now, let's see... Hm? There are seeds in here. And a note."},{"name":"BEREHTA","text":"It says these are date palm seeds from Garlemald, and they'll grow even in soil as barren as ours.<br>“May the fruit of these trees bring you health and happiness always.”"},{"name":"BEREHTA","text":"Oh, that boy of mine... I have to tell the others. There's plantin' to be done!"},{"name":"ERART","text":"(-Furtive-looking Fellow-)So the package made it here safely. You've done well, <span class=\"highlight\">Forename</span>."},{"name":"ERART","text":"(-Furtive-looking Fellow-)Forgive me. The name's Erart, though you probably already knew that. Mother always did have a gift for finding good help."},{"name":"ERART","text":"I'm sure you have a lot of questions. Hopefully I can clear things up."},{"name":"ERART","text":"As you likely already know, I've been working undercover in the Garlean army as a member of the Skulls. I provided the Resistance with intelligence and, if the situation presented itself, swayed battles in their favor."},{"name":"ERART","text":"At the battle of Castellum Velodyna, for instance, I urged my superiors to speak with Fordola, and convince her it would be in their best interest to retreat. I believe you were there as well, yes?"},{"name":"ERART","text":"Sadly it was not always so easy as whispering a few choice words into the right ear. If I was to convince them of my loyalty, I had to follow all orders. No matter how horrible..."},{"name":"ERART","text":"I've cut down more than my fair share of friends and countrymen, convincing myself it was for the greater good. For the Resistance."},{"name":"ERART","text":"I still believe that, but I know full well there are those who will never forgive the things I've done. I thought it better they believe I died in battle."},{"name":"ERART","text":"And with Erart gone, it's time for me to move on."},{"name":"ERART","text":"What will I do now? Well, this war is far from over. But I cannot continue my fight here. No, I will assume a new identity, and find another land whose people long to be free from the Garleans' grasp."},{"name":"ERART","text":"I will miss this place... Thankfully it's in good hands now."},{"name":"ERART","text":"Farewell, <span class=\"highlight\">Forename</span>. When next we meet, I look forward to fighting with you on the same side of the battlefield."},{"name":"BEREHTA","text":"You should have seen the looks on everyone's faces. They practically snatched the seeds out of my hands. If only Erart could be here to help us plant them..."},{"name":"Q1","text":"What will you say?"},{"name":"QA","text":"Erart is alive!"},{"name":"QA","text":"..."},{"name":"BEREHTA","text":"You're absolutely right. He is alive─in our hearts, and in these seeds."},{"name":"BEREHTA","text":"Somethin' the matter? You're not still worryin' about me, are you? I promise you I'm fine."},{"name":"BEREHTA","text":"You've given me so much, I wish I knew how to thank you. Tell you what, when these palms get to growin', you can have all the dates you can eat."},{"name":"BEREHTA","text":"Speakin' of which, I best be goin'. Those seeds won't plant themselves. You take care now."}],"reward":{"gil":1000,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"questsType":"all","quests":[68081,68399]}},"partials":[{"type":"npc","id":"1023268","obj":{"i":1023268,"n":"Berehta","l":2407,"q":5}},{"type":"npc","id":"1023259","obj":{"i":1023259,"n":"J'dyalani","l":2407,"q":5}},{"type":"npc","id":"1023295","obj":{"i":1023295,"n":"Berehta","l":2407,"q":1}},{"type":"quest","id":"68081","obj":{"i":68081,"n":"Raubahn's Invitation","g":6,"l":"The Peaks","s":1050}},{"type":"quest","id":"68399","obj":{"i":68399,"n":"Her Only Son","g":105,"l":"The Peaks","s":9070}}]}