{"quest":{"name":"My Dear Brother","location":"The Fringes","id":68409,"patch":4.0,"sort":9030,"eventIcon":71221,"issuer":1021232,"target":1021237,"involved":[1021233,1021234,1021235,1021236,1022413],"genre":104,"journal":["This somber sibling is looking to leave Castrum Oriens."],"objectives":["Speak with the somber sibling.","Speak with the somber sibling at Rhalgr's Reach."],"dialogue":[{"name":"SISTER02873","text":"Erm, pardon me. Are you by chance an adventurer? Please, if you're heading to Rhalgr's Reach I beg of you─take me with you!"},{"name":"SISTER02873","text":"My brother was a member of the Resistance, you see, and I planned to go and see him. Yet no matter how many times I explain myself, this bully of a soldier continues to keep me hostage here."},{"name":"LIBERATOR02873","text":"I've had enough of your dramatics. No one is keeping you hostage. You're free to return home, but until the area is safe, civilians are not permitted beyond the grounds of this base. End of discussion."},{"name":"SISTER02873","text":"Well, what if I were to go in the company of this adventurer?"},{"name":"LIBERATOR02873","text":"I suppose that would be permissible. That is assuming, of course, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> consents to be your escort."},{"name":"SISTER02873","text":"Then it's settled! Let's be on our way, shall we? The path south through Bittermill is probably safest."},{"name":"LIBERATOR02873","text":"She seemed terribly troubled when she first arrived. Certainly in no state to be traveling alone. I have no doubt you can keep her safe, but please do keep a close eye on her."},{"name":"LIBERATOR02873","text":"For the last time, we cannot permit you to leave Castrum Oriens. It's not safe."},{"name":"SISTER02873","text":"Castellum Velodyna... That soldier was telling me the Garleans built that fortress atop the bridge and changed its name."},{"name":"SISTER02873","text":"It's only a name, but it always starts with something small, or so my brother used to say. Piece by piece they replace what is ours with theirs. As time passes, people forget. Eventually, what was once insufferable is accepted as normal..."},{"name":"SISTER02873","text":"But enough of my musings. We should be going. Would it be alright if we rest on the bridge to the north? "},{"name":"SISTER02873","text":"I sometimes wonder what it would have been like to grow up here. My brother and I were born in Ala Mhigo, but by the grace of Rhalgr we escaped shortly before the Garleans' occupation."},{"name":"SISTER02873","text":"We lived here for such a brief time it's hard for me to truly say this was ever our home."},{"name":"SISTER02873","text":"My brother, on the other hand, had been up in arms about reclaiming our home for as long as I can remember. No sooner had he heard of the Resistance than he was rushing out our door and out of Gridania."},{"name":"SISTER02873","text":"&lt;sigh&gt; Sometimes I wonder if he was right. What do you think?"},{"name":"CHOICE1Q1","text":"What will you say?"},{"name":"CHOICE1A1","text":"Home is where you were born."},{"name":"CHOICE1A2","text":"Home is where you were raised."},{"name":"CHOICE1A3","text":"Home is where the heart is."},{"name":"SISTER02873","text":"You sound like my brother. I can't say that I agree, but I understand why you might say so."},{"name":"SISTER02873","text":"So you feel the same as I do. My brother would likely disagree."},{"name":"SISTER02873","text":"Where the heart is? My, what a novel idea."},{"name":"SISTER02873","text":"Though I suppose in the end there is likely no true answer we can all agree on."},{"name":"SISTER02873","text":"I suppose we should keep moving. Would it be alright if we stopped briefly near the temple further north?"},{"name":"SISTER02873","text":"My parents brought me here once when I was a child. It seems my brother came here often after joining the Resistance."},{"name":"SISTER02873","text":"In his letters he would tell me how after every battle he came to pray. He would stay until he regained peace of mind, and stillness within his spirit."},{"name":"SISTER02873","text":"You've the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who's seen their fair share of battle. Do you have such a place to return to? A place to still your mind?"},{"name":"CHOICE2Q1","text":"What will you say?"},{"name":"CHOICE2A1","text":"Yes."},{"name":"CHOICE2A2","text":"No."},{"name":"CHOICE2A3","text":"..."},{"name":"SISTER02873","text":"Is it a place you can call home? Is there someone there waiting for you?"},{"name":"SISTER02873","text":"Not even a place to call home? Is there no one who waits for your return? No one who..."},{"name":"SISTER02873","text":"...My apologies. That was rude of me to ask."},{"name":"SISTER02873","text":"I have no church or temple to turn to for solace, but I do have family waiting for me at home in Gridania. Though I long to return to them I must first see my brother."},{"name":"SISTER02873","text":"Come, we're nearly to Rhalgr's Reach."},{"name":"SISTER02873","text":"We've made it. Rhalgr's Reach..."},{"name":"SISTER02873","text":"I realize you must have places to go, but would you accompany me inside? My brother's supposed to be in a place they call Recompense."},{"name":"SISTER02873","text":"Oh, Brother... I meant to come sooner. When they told me the news I couldn't believe it."},{"name":"SISTER02873","text":"Why? Why did you have to leave?"},{"name":"SISTER02873","text":"I constantly ask myself how we could have grown so far apart? Why would he refuse to accept Gridania as our home?"},{"name":"SISTER02873","text":"I hoped he would be a brother to my husband, an uncle to my son. Instead he chose Ala Mhigo. And now..."},{"name":"SISTER02873","text":"I'm sorry. This must all seem a terrible bother. I won't keep you any longer. Thank you for bringing me here."}],"reward":{"gil":917,"items":[{"id":18718,"one":1,"hq":1},{"id":18719,"one":1,"hq":1},{"num":3,"id":5678,"one":1}],"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"questsType":"all","quests":[68083,68407]}},"partials":[{"type":"npc","id":"1021232","obj":{"i":1021232,"n":"Somber Sibling","l":2406,"q":1}},{"type":"npc","id":"1021237","obj":{"i":1021237,"n":"Somber Sibling","l":2403,"q":1}},{"type":"npc","id":"1021233","obj":{"i":1021233,"n":"Somber Sibling","l":2406,"q":1}},{"type":"npc","id":"1021234","obj":{"i":1021234,"n":"Somber Sibling","l":2406,"q":1}},{"type":"npc","id":"1021235","obj":{"i":1021235,"n":"Somber Sibling","l":2406,"q":1}},{"type":"npc","id":"1021236","obj":{"i":1021236,"n":"Somber Sibling","l":2406,"q":1}},{"type":"npc","id":"1022413","obj":{"i":1022413,"n":"Serpent Recruit","l":2406,"q":1}},{"type":"item","id":"18718","obj":{"i":18718,"n":"Molybdenum Earring of Healing","l":285,"c":55392,"t":41,"p":16485}},{"type":"item","id":"18719","obj":{"i":18719,"n":"Molybdenum Earring of Casting","l":285,"c":55392,"t":41,"p":16485}},{"type":"item","id":"5678","obj":{"i":5678,"n":"Savage Might Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Determination","category":0}}},{"type":"quest","id":"68083","obj":{"i":68083,"n":"The Lady in Red","g":6,"l":"The Peaks","s":1070}},{"type":"quest","id":"68407","obj":{"i":68407,"n":"Confessions of the Heart","g":104,"l":"The Fringes","s":9010}}]}