{"quest":{"name":"Ant Juice","location":"Rhalgr's Reach","id":68404,"patch":4.0,"sort":9010,"eventIcon":71221,"issuer":1019477,"target":1019477,"genre":103,"journal":["Ranulf wants to help the Barber."],"objectives":["Scatter the fine powder at the designated location and obtain a bottle of antlion secretion from the antlion ambusher.","Deliver the bottle of antlion secretion to Ranulf."],"dialogue":[{"name":"RANULF","text":"Think you'd be able to lend me a hand?"},{"name":"RANULF","text":"I've been trying to gather supplies for the Barber. While I've managed to get some blankets and bandages, I've not been able to procure any disinfectant. That's what I need your help for─I want you to bring me a bottle of antlion secretion."},{"name":"RANULF","text":"I'll collect the other ingredients I need. I just need you to slay an antlion."},{"name":"RANULF","text":"Only the antlions that dwell beneath the earth secrete the kind of liquid I need. Use this to draw them to the surface."},{"name":"RANULF","text":"It's a powder made of crushed ants, their favorite food. Scatter it anywhere they're known to dwell and you'll be faced with one in no time at all."},{"name":"RANULF","text":"Head to Virdjala in the Fringes. You'll not struggle to find an antlion there."},{"name":"RANULF","text":"Scatter that powder in Virdjala and slay any antlions that come to the surface. Don't forget to collect the liquid they secrete!"},{"name":"RANULF","text":"Did everything go to plan?"},{"name":"RANULF","text":"Exactly what I needed. I'll be able to make enough disinfectant to last a while with this."},{"name":"RANULF","text":"Even the smallest of wounds can be fatal if they become infected. We can't let the Barber run out of the stuff."}],"reward":{"gil":701,"items":[{"id":20627}],"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68083]}},"partials":[{"type":"npc","id":"1019477","obj":{"i":1019477,"n":"Ranulf","l":2403,"q":2}},{"type":"item","id":"20627","obj":{"i":20627,"n":"Head Bandage","l":1,"c":41395,"t":34,"p":100}},{"type":"quest","id":"68083","obj":{"i":68083,"n":"The Lady in Red","g":6,"l":"The Peaks","s":1070}}]}