{"quest":{"name":"A Friend on the Other Side","location":"The Peaks","id":68402,"patch":4.0,"sort":9100,"eventIcon":71221,"issuer":1023340,"target":1023340,"genre":105,"journal":["The dainty damsel would have you pick flowers."],"objectives":["Pick bunches of Rhalgr's gold.","Deliver the bunches of Rhalgr's gold to the dainty damsel."],"dialogue":[{"name":"FRAGILEWOMAN02866","text":"You're with the Alliance army, aren't you? A soldier? I would be ever so grateful if you could pick some special flowers for me."},{"name":"FRAGILEWOMAN02866","text":"I lost a dear friend during the fighting with the Empire, and I wish to place a bouquet in her memory. It's just that the fields where these flowers grow are roamed by creatures which─not to put too fine a point on it─would pull my pretty little head off."},{"name":"FRAGILEWOMAN02866","text":"If you're willing to brave these monstrosities, I ask that you seek out the blooms known as Rhalgr's gold and bring me back three or so handfuls. Try looking along the Thirstless Path, far to the north of Specula Imperatoris."},{"name":"FRAGILEWOMAN02866","text":"I've heard that Rhalgr's gold blooms north of Specula Imperatoris, along the Thirstless Path. I've also heard that the fields are home to brutes twelve-fulms tall with the disposition of a bee-stung bull jhammel..."},{"name":"FRAGILEWOMAN02866","text":"Were you able to find the flowers I asked for?"},{"name":"FRAGILEWOMAN02866","text":"Beautiful, aren't they? It's said that they only grow in spots that have been struck by the Destroyer's lightning─rare and precious, just like she was."},{"name":"FRAGILEWOMAN02866","text":"I'm sorry, I─  I cannot bear to speak her name. She did not believe in the gods, and I know nothing of her homeland's customs. But I would honor her memory all the same."},{"name":"FRAGILEWOMAN02866","text":"I will take this bouquet and lay it down at the place where we often met in Specula Imperatoris. That was where I worked...and where she was stationed."},{"name":"FRAGILEWOMAN02866","text":"Thank you for your kindness. I will mention you to her in my prayers."}],"reward":{"gil":637,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68082]}},"partials":[{"type":"npc","id":"1023340","obj":{"i":1023340,"n":"Dainty Damsel","l":2407,"q":1}},{"type":"quest","id":"68082","obj":{"i":68082,"n":"Liberty or Death","g":6,"l":"The Peaks","s":1060}}]}