{"quest":{"name":"A Parting Gift","location":"The Peaks","id":68401,"patch":4.0,"sort":9090,"icon":100713,"eventIcon":71221,"issuer":1020893,"target":1023259,"involved":[1023268,1023339,1023426,1023430,1023431,1023432],"genre":105,"journal":["Sagar still seems to be worried about Berehta.","Despite her earlier enthusiasm, Berehta seems to be troubled once again. Sagar asks you to speak with her in the hopes of resolving whatever new problem has presented itself.","Berehta wishes to thank J'dyalani for keeping the date seeds safe all this time. Having never ventured far from Coldhearth, she says she would feel safer accompanied by an adventurer accustomed to braving the wilds of Gyr Abania. And so, the two of you set out together toward Ala Ghiri.","While passing through Mount Yorn, you and Berehta are assaulted by a group of chapulis. You promptly trounce them and check to see if Berehta is unharmed.","Berehta remains without injury, but is duly unsettled seeing such creatures firsthand. After regaining her composure, she presses onward.","Berehta stops for a moment to take in the sight of Specula Imperatoris before continuing onward. Hopefully there are no soldiers lingering in the shadows. ","You walk through the abandoned base with Berehta, who is on pins and needles all the while. Knowing she is halfway to Ala Ghiri motivates her to continue.","Just when Ala Ghiri is within sight, you are attacked by wild griffins. You make quick work of them then check on your travel companion.","You are glad to see that Berehta is fine, albeit somewhat shaken. But the danger is over. Together you walk through the gates of Ala Ghiri.","You introduce Berehta to J'dyalani and the two soon find themselves lost in conversation like old friends. Baut happens to be passing by, taking the opportunity to seek your advice. Weidheri is in dire need of dates to produce arak, a type of spirit unique to the Gyr Abanian region. This problem is soon rectified when Baut suggests the people of Ala Ghiri and Coldhearth work together in cultivating the seeds Berehta recently received. He then escorts Berehta back to Coldhearth that he can better assess how much work there is to be done.","J'dyalani finds it miraculous how you bring people together. With this potential new source of dates for Ala Ghiri's trademark drink, the future has never looked brighter."],"objectives":["Speak with Berehta.","Rendezvous with Berehta.","Aid Berehta.","Rendezvous with Berehta.","Speak with Berehta.","Speak with J'dyalani."],"dialogue":[{"name":"SAGAR","text":"Oh, it's you. Thanks for helpin' with Berehta."},{"name":"SAGAR","text":"I was actually hopin' to talk to you about her. You see, she's been actin' strange again. She's always been stubborn about keepin' troubles to herself, but I'm sure she'd talk to you. Would you mind checkin' on her?"},{"name":"SAGAR","text":"It'd mean a lot to me if you went and talked to her. I'm sure she's fine, but I worry about her, you know?"},{"name":"BEREHTA","text":"&lt;sigh&gt; There's just too much work to go around. At this rate it'll take at least five years to─ah!"},{"name":"BEREHTA","text":"Goodness, you scared me. What are you doin' here?"},{"name":"BEREHTA","text":"Worried about me, are they? I keep tellin' them I'm fine, but they don't listen. Since you're here though, I could do with some help from a brave, young adventurer like yourself."},{"name":"BEREHTA","text":"I've been meanin' to thank J'dyalani for holdin' on to those seeds for us all that time, and I need someone to take me to Ala Ghiri."},{"name":"BEREHTA","text":"To be honest I've never traveled very far from Coldhearth. The others could take me, but I'd feel much safer in the company of someone used to bravin' the wilds. Are you up for takin' me on a little adventure?"},{"name":"BEREHTA","text":"Glad to hear it. I doubt I'll be needin' any bags, so let's go ahead and get goin'."},{"name":"SAGAR","text":"A trip to Ala Ghiri? Well, I'll be. She's lived here in Coldhearth her whole life, you know. Wish I could've been the one to take her. Take good care of her, you hear?"},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"BEREHTA","text":"Are...are they gone? Goodness gracious. I'd heard stories of savage monsters out here, but to see them up close—I had no idea!"},{"name":"BEREHTA","text":"I swear, if you weren't here, I'd be tellin' Erart about my first─and last─trip to Ala Ghiri right about now."},{"name":"BEREHTA","text":"Okay, I think I'm ready to keep goin'."},{"name":"BEREHTA","text":"Specula Imperatoris... Even from home I could always see that damned spire loomin' over everythin'."},{"name":"BEREHTA","text":"There was no goin' anywhere without the Garleans' say so. Not that I had anywhere to go, mind. Now that I finally do, though, I'm glad we're rid of them."},{"name":"BEREHTA","text":"I can't rightly say I've ever been so nervous walkin' through a big lot of nothin'. I was half expectin' one of them soldiers to jump out at me."},{"name":"BEREHTA","text":"And Erart was brave enough to pass through while they were still here. What was that boy thinkin'?"},{"name":"BEREHTA","text":"In any case, we're halfway there. Hope my legs don't give out before then."},{"name":"BEREHTA","text":"Only a little further and─ahhh! Not again!"},{"name":"BEREHTA","text":"I'm not sure how much more adventure my heart can take. Is it always so dangerous out here?"},{"name":"BEREHTA","text":"I suppose it was worth it, though. You ever seen a town so beautiful?"},{"name":"BEREHTA","text":"Cities ten times this size? How gullible do you think I am?"},{"name":"BEREHTA","text":"Now, let's go and see this J'dyalani."},{"name":"BEREHTA","text":"So this is her? She seems like a sweet girl."},{"name":"SAGAR","text":"By that satisfied look on your face, I guess it's safe to say she made it to Ala Ghiri. I can only imagine what tall tales she'll have to tell when she gets back."},{"name":"JDYALANI","text":"<span class=\"highlight\">Forename</span>, good to see you. How is everything?"},{"name":"JDYALANI","text":"The mother of that Skull soldier?"},{"name":"BEREHTA","text":"Accordin' to my son's letter, I have you to thank for keepin' his gift safe all this time. Thought it only proper I come show my appreciation in person."},{"name":"BEREHTA","text":"Now we can finally put that barren soil of ours to some use."},{"name":"JDYALANI","text":"Think nothing of it. I'm just relieved to know it reached you safely."},{"name":"BAUT","text":"(-???-)<span class=\"highlight\">Forename</span>! What brings you back to Ala Ghiri?"},{"name":"BAUT","text":"Thanks to Brazen Brook, and testimony from the good people here, I was pardoned by the Alliance leaders. They still keep me under close watch, of course. Can't say that I blame them. For now, Weidheri has been gracious enough to offer me room and board."},{"name":"BAUT","text":"Speaking of which, we've run into something of a problem. I was hoping to get your thoughts on the matter."},{"name":"BAUT","text":"Ala Ghiri was once famous for a particular type of spirit─arak. Sadly, the ingredients needed to make it have grown increasingly scarce."},{"name":"BAUT","text":"Stores of the stuff were promptly depleted when the Garleans took control here, but the soldiers were so taken with it, they began shipping in ingredients directly from Garlemald."},{"name":"BAUT","text":"Needless to say, when they left, so too did the supplies we need to make more."},{"name":"BAUT","text":"It would not do well for Ala Ghiri to be without its local specialty when trade begins booming again."},{"name":"BAUT","text":"We have searched everywhere, but all of the date palms native to this area have been cut down, and the soil is unfit for replanting. Do you know of any places where this plant still grows?"},{"name":"BEREHTA","text":"Is somethin' the matter?"},{"name":"BEREHTA","text":"They need dates for distillin' spirits? Now hold on a minute. We haven't even readied plots for plantin'."},{"name":"BEREHTA","text":"It'll take a lot of time and hands we don't even have."},{"name":"BAUT","text":"Perhaps we can make an arrangement. I'm certain the people of Ala Ghiri would be more than willing to help in exchange for a small share of the resulting produce."},{"name":"BAUT","text":"Might I accompany you home to better assess your situation? "},{"name":"BEREHTA","text":"Why, of course! We can use all the help we can get."},{"name":"BEREHTA","text":"First the seeds, and now this. You're a miracle worker if there ever was one. I won't be forgettin' what you've done for us."},{"name":"BAUT","text":"You needn't worry, <span class=\"highlight\">Forename</span>. I will see to it no harm comes to her. Until next time."},{"name":"JDYALANI","text":"It still amazes me how you make good of even the most dire circumstances. There's no doubt Rhalgr smiles upon you. "},{"name":"JDYALANI","text":"It will take a lot of work, to be sure, but in a few years' time traders from all over will be talking of the famous brew from Ala Ghiri and Coldhearth."},{"name":"JDYALANI","text":"I better get going. We'll need to be ready when Baut returns. Take care, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":1500,"items":[{"num":3,"id":5718}],"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"questsType":"all","quests":[68081,68381]}},"partials":[{"type":"npc","id":"1020893","obj":{"i":1020893,"n":"Sagar","l":2407,"q":3}},{"type":"npc","id":"1023259","obj":{"i":1023259,"n":"J'dyalani","l":2407,"q":5}},{"type":"npc","id":"1023268","obj":{"i":1023268,"n":"Berehta","l":2407,"q":5}},{"type":"npc","id":"1023339","obj":{"i":1023339,"n":"Berehta","l":2407,"q":1}},{"type":"npc","id":"1023426","obj":{"i":1023426,"n":"Berehta","l":2407,"q":1}},{"type":"npc","id":"1023430","obj":{"i":1023430,"n":"Berehta","l":2407,"q":1}},{"type":"npc","id":"1023431","obj":{"i":1023431,"n":"Berehta","l":2407,"q":1}},{"type":"npc","id":"1023432","obj":{"i":1023432,"n":"Berehta","l":2407,"q":1}},{"type":"item","id":"5718","obj":{"i":5718,"n":"Quickarm Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Skill Speed","category":0}}},{"type":"quest","id":"68081","obj":{"i":68081,"n":"Raubahn's Invitation","g":6,"l":"The Peaks","s":1050}},{"type":"quest","id":"68381","obj":{"i":68381,"n":"Second Chances","g":105,"l":"The Peaks","s":8200}}]}