{"quest":{"name":"Climbing for Atonement","location":"The Peaks","id":68403,"patch":4.0,"sort":9110,"eventIcon":71221,"issuer":1021581,"target":1021581,"involved":[1023341],"genre":105,"journal":["Able Ant seems distraught at the absence of a friend."],"objectives":["Search for Able Ant's friend.","Return to Able Ant."],"dialogue":[{"name":"ABLEANT","text":"Listen, can you help me look for a mate of mine? I've ventured as far as I dare, but there's been no sign of him."},{"name":"ABLEANT","text":"He just decided to set out one day for the Arms of Meed─ah, that's the name of a temple to the west of Ala Ghiri."},{"name":"ABLEANT","text":"The path to get up there collapsed ages ago, but the stubborn bastard said he was going to climb over the rocks anyway..."},{"name":"ABLEANT","text":"I can't help but feel that something bad has happened. If you've any way of reaching the temple, I'd appreciate knowing what's become of him─be it good news or no."},{"name":"ABLEANT","text":"Did you have a look around the Arms of Meed? My mate's a big bloke, about my size, so he shouldn't be too hard to spot."},{"name":"SYSTEM","text":"The man lies dead, the victim of an attack by some wild creature..."},{"name":"ABLEANT","text":"Well, did you find him? I've a mind to give that reckless bugger a good─"},{"name":"ABLEANT","text":"...He's dead? Godsdammit. And damn Rhalgr in particular. My mate went to His temple to atone, but that's taking it a bit bloody far!"},{"name":"ABLEANT","text":"Knowing our countrymen were out there fighting and dying for our freedom, while we shuffled along like packbeasts for the Empire... It wears down a man's soul."},{"name":"ABLEANT","text":"When my friend heard how the Fist of Rhalgr disciples would perform hard labor at the temple to expunge their sins, he got it into his head to do the same."},{"name":"ABLEANT","text":"It's not like I was happy with our lot, either! But we were born under imperial rule─you did things their way, or you died."},{"name":"ABLEANT","text":"I'm not giving up. I'll bear the guilt and the glares of my countrymen, and live a life full enough for the both of us. Thank you for letting me know his fate."}],"reward":{"gil":601,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68082]}},"partials":[{"type":"npc","id":"1021581","obj":{"i":1021581,"n":"Able Ant","l":2407,"q":1}},{"type":"npc","id":"1023341","obj":{"i":1023341,"n":"Badly Mauled Man","l":2407,"q":1}},{"type":"quest","id":"68082","obj":{"i":68082,"n":"Liberty or Death","g":6,"l":"The Peaks","s":1060}}]}