{"quest":{"name":"Necessities of War","location":"The Lochs","id":68418,"patch":4.0,"sort":9060,"eventIcon":71221,"issuer":1022988,"target":1022988,"genre":106,"journal":["Pamisolaux seeks aid in restocking his medical supplies."],"objectives":["Obtain tendons from abaddons.","Deliver the abaddon tendons to Pamisolaux."],"dialogue":[{"name":"PAMISOLAUX","text":"You... You are the one who gained the favor of Lord Drillemont. Would you be so kind as to lend me your assistance?"},{"name":"PAMISOLAUX","text":"I am Pamisolaux, a chirurgeon dispatched from Whitebrim Front. This war, no matter how well it is waged, continues to send an endless line of wounded to my station. Thus, no matter how many supplies are brought in, I continue to work through my stock at an alarming rate."},{"name":"PAMISOLAUX","text":"I had thought to resupply myself by drawing on the resources naturally available in the region, and a renowned soldier such as you could certainly expedite the process."},{"name":"PAMISOLAUX","text":"The Resistance fighters tell me of the gigantic frogs which inhabit the land to the south. “Abaddons,” I believe they are called. Would you think it possible to slay several of these creatures, and bring me four lengths of their tendons?"},{"name":"PAMISOLAUX","text":"The abaddons should be found to the south. I am curious to see the properties of their tendons..."},{"name":"PAMISOLAUX","text":"Did the abaddons pose you any challenge?"},{"name":"PAMISOLAUX","text":"Yes. Yes, these should do quite nicely."},{"name":"PAMISOLAUX","text":"See how rubbery the tendons are? They should stretch far without snapping, making them perfect for keeping bandages in place or strapping on wooden limb replacements."},{"name":"PAMISOLAUX","text":"We Ishgardians developed many techniques for emergency field procedures during the centuries of the Dragonsong War─though it says much of our history that we were pressed to invent such treatments."},{"name":"PAMISOLAUX","text":"A healer will always do what he must to save the life expiring before him. It is a calling I could not ignore."},{"name":"PAMISOLAUX","text":"...My apologies, I did not intend to delay you with my ramblings. I thank you for your help."}],"reward":{"gil":637,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68087]}},"partials":[{"type":"npc","id":"1022988","obj":{"i":1022988,"n":"Pamisolaux","l":2408,"q":1}},{"type":"quest","id":"68087","obj":{"i":68087,"n":"The Legacy of Our Fathers","g":6,"l":"The Lochs","s":1110}}]}