{"quest":{"name":"If I Were a Fish","location":"The Lochs","id":68417,"patch":4.0,"sort":9050,"unlocksFunction":1,"eventIcon":71341,"issuer":1022987,"target":1022987,"involved":[1023174],"genre":106,"journal":["Lieutenant Dorothe needs a soldier who knows how to swim."],"objectives":["Speak with the flame agent.","Obtain the imperial secret.","Deliver the imperial materiel crate to the flame agent.","Report to Dorothe."],"dialogue":[{"name":"DOROTHE","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>, I presume? I've spoken with members of the Scions, and if I may be so bold as to ask... Is it true that you learned some Far Eastern technique for moving underwater as freely as a fish?"},{"name":"DOROTHE","text":"Then it was not an exaggeration!? Incredible. Would you be willing to put that ability to use for us?"},{"name":"DOROTHE","text":"If so, I've an agent stationed underneath those towering steps by the loch who would dearly love to speak with you."},{"name":"DOROTHE","text":"The agent I mentioned can be found underneath those grand steps the locals call the “Divine Audience.” Aye, that structure built over the waters of Loch Seld."},{"name":"AGENT02881","text":"Ah, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! Lieutenant Dorothe said you might be on your way. Ready to get your boots wet, are you? I should probably begin from the beginning..."},{"name":"AGENT02881","text":"One of the soldiers we captured during the battle at Castrum Abania was concealing a map on his person."},{"name":"AGENT02881","text":"The map was marked with a curious symbol, but no matter how hard we cajoled or threatened, the prisoner would not tell us the symbol's significance."},{"name":"AGENT02881","text":"This naturally piqued the curiosity of our commanders, and they immediately ordered a search of the marked area. Now, the problem is that the area mostly covers the water, and we found nothing of interest up above..."},{"name":"AGENT02881","text":"Meaning this secret, whatever it is, <span class=\"emphasis\">must</span> be down below. We were eager indeed to enlist someone with your apparent talent for underwater exploration."},{"name":"AGENT02881","text":"I've circled the spot on your map that we'd like you to investigate. If it turns out to be something you can bring back, pray do so. Be careful down there."},{"name":"AGENT02881","text":"I don't know how deep the loch is, but I'm told holding your breath won't pose a problem. At least the water looks warm...?"},{"name":"AGENT02881","text":"（★未使用／削除予定★）"},{"name":"AGENT02881","text":"Anything of interest?"},{"name":"AGENT02881","text":"This looks like an imperial materiel crate. I doubt anyone would bother sinking ordinary supplies, so I say we take a look inside..."},{"name":"AGENT02881","text":"Nald's breath! This thing's filled to the brim with gems and jewelry!"},{"name":"AGENT02881","text":"From what I can tell, these all seem to be of Gyr Abanian design. In fact, I'd say this collection is of damn near royal quality."},{"name":"AGENT02881","text":"The bottom of a loch is not where I'd choose to keep such valuables, so it's safe to assume they were acquired in a less-than-honest fashion. Our prisoner likely hoped to hide them down there until his stint in the army was over..."},{"name":"AGENT02881","text":"Rebuilding a country is an expensive job, eh? Ala Mhigo's royal family is no more, but we should return these to her citizens nonetheless."},{"name":"AGENT02881","text":"Thank you for braving those waters, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>. Pray report to Lieutenant Dorothe, and I'll see that this crate is transported safely back to headquarters."},{"name":"AGENT02881","text":"I'll start hauling the crate back to headquarters, but I'd appreciate it if you could have the lieutenant send a few large lads to help..."},{"name":"DOROTHE","text":"Welcome back, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>. Was there aught to be found?"},{"name":"DOROTHE","text":"A fortune in stolen jewelry, was it? That explains the prisoner's unwillingness to share."},{"name":"DOROTHE","text":"As my agent explained, we will see to it that those valuables are returned to Ala Mhigo's coffers. Thank you, [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>─this will go a long way to helping the nation recover from the ravages of war!"}],"reward":{"gil":745,"aetherCurrent":1,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68087]}},"partials":[{"type":"npc","id":"1022987","obj":{"i":1022987,"n":"Dorothe","l":2408,"q":1}},{"type":"npc","id":"1023174","obj":{"i":1023174,"n":"Flame Agent","l":2408,"q":1}},{"type":"quest","id":"68087","obj":{"i":68087,"n":"The Legacy of Our Fathers","g":6,"l":"The Lochs","s":1110}}]}