{"quest":{"name":"It's a Zu Out There","location":"The Lochs","id":68413,"patch":4.0,"sort":9010,"unlocksFunction":1,"eventIcon":71341,"issuer":1022992,"target":1022992,"genre":106,"journal":["Munifrid seeks a seasoned adventurer for an important task."],"objectives":["Slay the zu nestling.","Report to Munifrid."],"dialogue":[{"name":"MUNIFRID","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>, you are well known for your deeds as a soldier. On this day, however, I would call upon your broad experiences as an adventurer."},{"name":"MUNIFRID","text":"As for the situation at hand, it would seem that part of our patrol route has been claimed as territory by a fearsome zu nestling. Yet we cannot simply choose to circumvent the area, lest we risk providing an unobserved entry point for imperial scouts."},{"name":"MUNIFRID","text":"My men and I will gladly go toe-to-toe with any military opponent. But nothing in our training has prepared us to combat a foe which can soar through the ravines and swoop down upon us with impunity."},{"name":"MUNIFRID","text":"My comrade here almost lost his arm to such an attack, and I fear it is only a matter of time ere the creature makes a kill...unless you kill it first."},{"name":"MUNIFRID","text":"The nestling surveys its domain from a narrow pillar of rock to the northeast. Pray find this predator, and end the threat to our patrols."},{"name":"MUNIFRID","text":"We might take the thing down eventually, but too much of our own blood would stain those rock walls. For a monster-slayer of your caliber, however, I should hope it will prove no great challenge..."},{"name":"MUNIFRID","text":"The nestling is slain, then? I knew I had chosen the right <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the job."},{"name":"MUNIFRID","text":"I am grateful you came along before any lives were lost to that monstrous bird. You have our thanks!"}],"reward":{"gil":601,"aetherCurrent":1,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68084]}},"partials":[{"type":"npc","id":"1022992","obj":{"i":1022992,"n":"Munifrid","l":2408,"q":1}},{"type":"quest","id":"68084","obj":{"i":68084,"n":"Upon the Great Loch's Shore","g":6,"l":"Rhalgr's Reach","s":1080}}]}