{"quest":{"name":"Religious Freedom","location":"The Peaks","id":68410,"patch":4.0,"sort":9120,"eventIcon":71221,"issuer":1021544,"target":1021544,"genre":105,"journal":["Gerbert longs for the days when statues of Rhalgr dotted the Peaks."],"objectives":["Examine the statues at the designated locations.","Report to Gerbert."],"dialogue":[{"name":"GERBERT","text":"Ah, good to see you again. Pleased to say those rats have not bothered me since you scared them off."},{"name":"GERBERT","text":"In fact, could I ask for your help once more?"},{"name":"GERBERT","text":"The Peaks used to be filled with more Rhalgr statues than you could shake a stick at. Of course, the Empire did not approve of this and ordered them all to be destroyed."},{"name":"GERBERT","text":"Though as luck would have it, I have heard two survived. The only issue is the bridges that used to lead to them have fallen into disrepair. Hence why I have been unable to check them myself. Please search for them in my place. "},{"name":"GERBERT","text":"I have marked both their locations on your map. Good luck!"},{"name":"GERBERT","text":"I have marked the locations of both Rhalgr statues on your map. Good luck!"},{"name":"SYSTEM","text":"The statue is missing two key components: an arm and its head."},{"name":"SYSTEM","text":"This statue has also seen better days."},{"name":"GERBERT","text":"Were the statues undamaged?"},{"name":"GERBERT","text":"Oh, that is truly a shame. I suppose it was foolish of me to get my hopes up."},{"name":"GERBERT","text":"The monks belonging to the Fist of Rhalgr and the religion's followers used to go on pilgrimages often to compare the different statues."},{"name":"GERBERT","text":"No matter how long it takes, I will make sure the statues are reconstructed. I will not stand back and watch as this tradition dies."},{"name":"GERBERT","text":"My thanks for taking on such a difficult task. Here, take this as your payment."}],"reward":{"gil":601,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"questsType":"all","quests":[68083,68189]}},"partials":[{"type":"npc","id":"1021544","obj":{"i":1021544,"n":"Gerbert","l":2407,"q":2}},{"type":"quest","id":"68083","obj":{"i":68083,"n":"The Lady in Red","g":6,"l":"The Peaks","s":1070}},{"type":"quest","id":"68189","obj":{"i":68189,"n":"Of Rats and Men","g":105,"l":"The Peaks","s":1010}}]}