{"quest":{"name":"A Fletching Suggestion","location":"The Lochs","id":68415,"patch":4.0,"sort":9030,"eventIcon":71221,"issuer":1023020,"target":1023020,"genre":106,"journal":["Supriya appears enchanted by the idea of pheasant feathers."],"objectives":["Obtain pheasant feathers.","Deliver the pheasant feathers to Supriya."],"dialogue":[{"name":"SUPRIYA","text":"You are the ssstrider who ssslew Sri Lakshmi...<br>Would you hear my humble requessst?"},{"name":"SUPRIYA","text":"I have heard tales of the cloudkin known as “pheasant,” and I desire to claim sssome few of itsss feathers. Alasss, I am ordered to hold thisss position, and ssso I shall."},{"name":"SUPRIYA","text":"My sssisters who patrol the mountain pathsss ssspeak of beautiful winged creatures sssoaring through the air above their route. Perhapsss the feathers I ssseek might be found fallen here and there."},{"name":"SUPRIYA","text":"Please, ssstrider, venture to thisss high place your people call the “Royal Hunting Grounds” and gather all the pheasant feathers you can find."},{"name":"SUPRIYA","text":"（★未使用／削除予定★）"},{"name":"SUPRIYA","text":"The feathers I ssseek may be found in your “Royal Hunting Grounds.” A handful of sssuch treasures is all I asssk."},{"name":"SUPRIYA","text":"Did you find the feathers I sssought?"},{"name":"SUPRIYA","text":"Yesss... They are more beautiful than I imagined. The Resissstance fighters I ssspoke with sssay the hunting grounds were maintained for the pleasure of the Ala Mhigan royal family."},{"name":"SUPRIYA","text":"They sssay pheasantsss were sssent as giftsss from the nobles of other lands, and allowed to breed for the purpossse of hunting ssstock."},{"name":"SUPRIYA","text":"Pheasant feathers, being resilient yet sssupple, were prized as fletching, and used to make arrows of the highessst quality. As sssuch, it ssseems they were hunted to sssuch an extent that the once prolific creatures became a rarity."},{"name":"SUPRIYA","text":"I do not care to kill when it is not needful. But if the feathers have already fallen, then I sssee no reason to wassste them."},{"name":"SUPRIYA","text":"Thank you, ssslayer of Sri Lakshmi. I shall sssoon have fine new arrows for my bow."}],"reward":{"gil":637,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68084]}},"partials":[{"type":"npc","id":"1023020","obj":{"i":1023020,"n":"Supriya","l":2408,"q":1}},{"type":"quest","id":"68084","obj":{"i":68084,"n":"Upon the Great Loch's Shore","g":6,"l":"Rhalgr's Reach","s":1080}}]}