{"quest":{"name":"A Rite to Rest","location":"The Lochs","id":68416,"patch":4.0,"sort":9040,"unlocksFunction":1,"eventIcon":71341,"issuer":1022990,"target":1022990,"genre":106,"journal":["Betha seeks aid in quieting the dead."],"objectives":["Defeat specters.","Report to Betha."],"dialogue":[{"name":"BETHA","text":"Ah, adventurer! I need your aid in saving the souls of the dead!"},{"name":"BETHA","text":"I... Pray excuse me. That sounded more dramatic than I intended. My name is Betha, by the way."},{"name":"BETHA","text":"You have probably heard how the Empire took great pains to quash the religions of this land, for fear of the appearance of primals. But the imperials even went so far as to forbid the harmless ceremonies folk performed to honor their fallen."},{"name":"BETHA","text":"As a result, the Lochs are now haunted by a host of restless shades who were denied their last rites. And sadly, brute force is the only way to banish them."},{"name":"BETHA","text":"I spend such spare time as I have sending these spirits on to the next world, but there is only so much one woman can do. Any aid you could offer would be greatly appreciated."},{"name":"BETHA","text":"You will find many an unquiet specter roaming the tombs to the northeast. Pray send them on to their final rest."},{"name":"BETHA","text":"The tombs to the northeast teem with restless shades. Do what you can to end their torment..."},{"name":"BETHA","text":"Your efforts will be felt, adventurer."},{"name":"BETHA","text":"When this land was yet under the yoke of the Empire, my own father lost his life in the fight for freedom."},{"name":"BETHA","text":"But although our conquerors permitted me to build him a gravestone, they would not allow me to perform his final rites as the teachings of the Fist of Rhalgr demanded."},{"name":"BETHA","text":"It was later that I heard how a ghostly apparition was seen floating near his grave."},{"name":"BETHA","text":"I should have performed the ceremony, and the Empire's laws be damned. I should have had more courage. But I was so afraid to die..."},{"name":"BETHA","text":"Ashamed at the cowardice I showed then, I began seeking out other shades and specters to put to rest. It is a seemingly unending path, and I thank you for walking even a few steps of the way alongside me."}],"reward":{"gil":637,"aetherCurrent":1,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68084]}},"partials":[{"type":"npc","id":"1022990","obj":{"i":1022990,"n":"Betha","l":2408,"q":1}},{"type":"quest","id":"68084","obj":{"i":68084,"n":"Upon the Great Loch's Shore","g":6,"l":"Rhalgr's Reach","s":1080}}]}