{"quest":{"name":"Bombs for Peace","location":"The Peaks","id":68412,"patch":4.0,"sort":9140,"eventIcon":71221,"issuer":1023071,"target":1019478,"genre":105,"journal":["This hungry Hyur has been working hard to improve his smoke bombs."],"objectives":["Use the enhanced smoke bombs at the designated locations.","Report to the hungry Hyur.","Deliver the crate of smoke bombs to Gilow."],"dialogue":[{"name":"MAN02650","text":"Thanks for your help with those midges the other day. I've been refining my smoke bombs in the meantime and was hoping you'd be willing to test the new ones out for me."},{"name":"MAN02650","text":"The refined smoke bombs contain a potion that will keep any midges at bay much longer than smoke could."},{"name":"MAN02650","text":"Who knows, if they work well, maybe I could even sell them! The workers at Byron's Bread actually expressed an interest in seeing a demonstration."},{"name":"MAN02650","text":"Take these and scatter them around the fields there. Aim well and you might finish the job with a few bombs to spare. Best of luck!"},{"name":"MAN02650","text":"Take those smoke bombs and scatter them around the fields at Byron's Bread. Aim well and you might finish the job with a few to spare. Best of luck!"},{"name":"MAN02650","text":"Quite effective, aren't they? I'm hoping they might revolutionize agriculture in areas largely populated by older folk such as myself."},{"name":"MAN02650","text":"By the way, you wouldn't happen to belong to the Resistance, would you?"},{"name":"MAN02650","text":"I knew it. I thought I'd heard of a member of theirs that matched your description. In that case, there is one more thing I would ask of you."},{"name":"MAN02650","text":"Give these to my son, Gilow the next time you visit Rhalgr's Reach."},{"name":"MAN02650","text":"I only heard recently that he joined the Resistance after he left home. I somehow doubt he wants to see me, so please deliver those smoke bombs in my stead."},{"name":"MAN02650","text":"Please give those smoke bombs to my son, Gilow the next time you visit Rhalgr's Reach."},{"name":"GILOW","text":"Well, if it isn't the Warrior of Light. Is there something I can help you with?"},{"name":"GILOW","text":"My father told you to bring these to me? No matter how many times I asked him, he always refused to supply the Resistance with his smoke bombs."},{"name":"GILOW","text":"He insisted they were to be used for quarrying, not war."},{"name":"GILOW","text":"But never mind that. Thank you for delivering these. I haven't been back home in a good few years now. Maybe I'll take some leave and go give him a fine bottle of local mead."}],"reward":{"gil":773,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"questsType":"all","quests":[68083,68411]}},"partials":[{"type":"npc","id":"1023071","obj":{"i":1023071,"n":"Hungry Hyur","l":2407,"q":1}},{"type":"npc","id":"1019478","obj":{"i":1019478,"n":"Gilow","l":2403,"q":3}},{"type":"quest","id":"68083","obj":{"i":68083,"n":"The Lady in Red","g":6,"l":"The Peaks","s":1070}},{"type":"quest","id":"68411","obj":{"i":68411,"n":"The Qiqirn Strikes Back","g":105,"l":"The Peaks","s":9130}}]}