{"quest":{"name":"Masked Motives","location":"The Fringes","id":68427,"patch":4.0,"sort":630,"icon":100674,"unlocksFunction":1,"eventIcon":71341,"issuer":1022512,"target":1022513,"involved":[1022511,1022514,1022515],"genre":151,"journal":["Sanson is at his wit's end with Nourval.","Against Sanson's express instructions to lay low in the garrison, Nourval has been doing anything but, approaching and questioning every single soldier about. While Sanson keeps an eye on the froward civilian, he bids you find Guydelot and ask what your fellow bard has been able to glean from the locals.","Instead of sharing his findings, Guydelot saddles you with a task. Masked bandits have been terrorizing the area of late, and your fellow bard would have you investigate a Twin Adder scout who is late to report back. While Guydelot keeps an eye on a suspicious Nourval, he bids you make your way to the northeast of the Fringes towards Schism, where the soldier was headed.","Near Pike Falls, you find the Twin Adder scout at the mercy of the masked bandits, and promptly drive away the assailants. With the area secured, render assistance to the ailing scout.","The Twin Adder scout thanks you for your timely intervention, and observes that the bandits seemed to know of his coming in advance and sought to bar his path. Take word of the encounter back to your comrades at Castrum Oriens.","At Sanson's insistence, Nourval reveals that the tome rests in a place connected to Gylbarde, the renowned general who led the Ala Mhigan forces during the Autumn War. Putting two and two together, Guydelot suggests that the bandits may also be after the tome. The possibility seems to rattle Nourval, who excuses himself in spite of Sanson's protests. At this time, Guydelot reveals that Nourval has been stealing out of the castrum while your backs are turned. Sanson decides to allow Nourval to act freely in order to learn his true purpose, and bids you stand at the ready for whatever may come to pass.<br><br>※The next bard quest will be available from Sanson upon reaching level 65."],"objectives":["Look for Guydelot.","Look for the Twin Adder scout.","Aid the Twin Adder scout.","Speak with Guydelot."],"dialogue":[{"name":"NOURVAL","text":"Though I am but a humble civilian, I shall endeavor to make myself useful."},{"name":"SANSON","text":"Gah! I can't believe I'm saying this, but Nourval might be an even bigger pain than Guydelot!"},{"name":"SANSON","text":"Despite my express instructions to keep out of the garrison's way, what does he do but go and bother every single soldier about? And now everyone here looks at us askance!"},{"name":"SANSON","text":"&lt;sigh&gt; I brought a tome to record mission details, but instead I'm filling it with the names of those to whom I must apologize..."},{"name":"NOURVAL","text":"I'm sorry if I've caused trouble, but it's simply more efficient that I make the inquiries myself. What a man says amounts to only half the story; how he says it gives you the rest."},{"name":"NOURVAL","text":"Besides, I felt compelled to make up for Master Guydelot. All he seemed to be doing was drinking and singing."},{"name":"SANSON","text":"Well, appearances can be deceiving with him. He has his own way of acquiring information. Speaking of which, I am curious as to what he has learned."},{"name":"SANSON","text":"<span class=\"highlight\">Forename</span>, might I ask you to look around the castrum for him? I will keep a close eye on Nourval in the meantime."},{"name":"SANSON","text":"Guydelot will be somewhere in the castrum, making his inquiries with a lyre in one hand and a cup in the other. Please find him and ask what he has managed to learn."},{"name":"NOURVAL","text":"Quite a character indeed, hehehe..."},{"name":"GUYDELOT","text":"Sanson wants to know what I know, does he? Well, might be as I've learned a thing or two, but I ain't ready to share 'em yet."},{"name":"GUYDELOT","text":"Still need to clear up some details, see, and I'm not one for unfinished tales. It ain't bardly, as I'm sure you can appreciate."},{"name":"GUYDELOT","text":"Seeing as you're here, though, there <span class=\"emphasis\">is</span> something I could use a hand with."},{"name":"GUYDELOT","text":"Of late, masked bandits have been terrorizing the area. Not even Alliance soldiers are safe, it seems. The brazen bastards set on a patrol just the other day."},{"name":"GUYDELOT","text":"And now, a Twin Adder scout's late to return, and chances are the bandits are at it again. I want you to go and check things out."},{"name":"GUYDELOT","text":"I'd go myself, but I need to keep an eye on our friend Nourval. He's been acting queer since we got here."},{"name":"GUYDELOT","text":"There'll be more to tell later, but for now you'd best be on your way. The soldier was bound for Schism, the ruins to the northeast of here."},{"name":"SANSON","text":"Not only does he refuse to divulge his findings, but he sets you a task instead? Well, knowing Guydelot, we must assume he has his reasons. Please do as he asks."},{"name":"GUYDELOT","text":"Remember, the Twin Adder scout was bound for Schism, the ruins to the northeast of here. I'll keep an eye on Nourval in the meantime."},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"BALLOON","text":"More of them!"},{"name":"BALLOON","text":"That's as far as you go!"},{"name":"SERPENTSOLDIER02891","text":"Th-Thank you... They fell upon me with nary a warning."},{"name":"SERPENTSOLDIER02891","text":"They <span class=\"emphasis\">knew</span> I was coming. We alter our patrol routes on a regular basis, but they knew. What's more, it was as though they were barring my way."},{"name":"SERPENTSOLDIER02891","text":"But now is not the time for speculation. I must take word of this back to my superiors. My thanks again, friend."},{"name":"SANSON","text":"Guydelot refuses to say a word until you return. I tell myself he has his reasons, but gods it's irritating."},{"name":"NOURVAL","text":"I ask you, how is a man supposed to go about his business when he is constantly watched? And I merely wish to be helpful."},{"name":"GUYDELOT","text":"There you are, <span class=\"highlight\">Forename</span>. So, what happened? Was it the bandits after all?"},{"name":"SANSON","text":"Masked bandits in the area, and you had an encounter with them!? Thank the Matron you did not come to harm!"},{"name":"SANSON","text":"Guydelot, why did you not see fit to share this with us?"},{"name":"GUYDELOT","text":"Aye, well, I knew it was nothing <span class=\"highlight\">Forename</span> couldn't handle alone. Besides, I had some business of my own, someone to keep an eye on."},{"name":"NOURVAL","text":"...I cannot imagine who that might be. Master Guydelot─I owe you an apology. I had assumed in err that you were not doing your work. Unorthodox though your methods may be, there is no doubting their efficacy."},{"name":"GUYDELOT","text":"Ain't no trick to what I do. Everyone's got a song what's close to their hearts, and with a bit of camaraderie in the cups, they'll tell you what it is. Then I strum 'em their song over a heart-to-heart, is all."},{"name":"SANSON","text":"Thanks to Guydelot, we were able to learn of the recent incidents. So I ask you, will you not have a little faith in us?"},{"name":"NOURVAL","text":"I'm not certain I understand."},{"name":"SANSON","text":"Look, Nourval. We've made a stop here at your request, that we might gather information for our search. But not once did you tell us what it is we should look for."},{"name":"SANSON","text":"By now we have more than a solid grasp of the region beyond. What should we do next?"},{"name":"NOURVAL","text":"Oh my, did I neglect to tell you? My profoundest apologies. The tome we seek─it's said to rest in a place connected to Gylbarde, the general who led the Ala Mhigan forces during the Autumn War."},{"name":"GUYDELOT","text":"Now that you mention it, the masked bandits appeared on the way to Schism. And Gylbarde was a known devotee of the Fist of Rhalgr. Just taking a wild stab here, but might be as they're also after the tome."},{"name":"NOURVAL","text":"An unsettling notion. Should that be the case, we haven't any time to waste. I will go and make some inquiries immediately."},{"name":"SANSON","text":"W-Wait! I didn't give you perm─"},{"name":"GUYDELOT","text":"Leave him. There's something you two need to know."},{"name":"GUYDELOT","text":"I got this from a soldier, but Nourval's been sneaking outside the castrum while our backs were turned."},{"name":"GUYDELOT","text":"Bastards's been acting right fishy since we got here, and he tensed up good when the subject of the masked bandits came up."},{"name":"SANSON","text":"Whatever his true motives may be, we must bring them to light. Rather than reel him in, let us give him some line to act."},{"name":"SANSON","text":"There is no telling what Nourval will do next. While we keep watch, please see that you are ready to deal with anything."}],"reward":{"gil":737,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":24}],"quests":[68426]},"next":[68428]},"partials":[{"type":"npc","id":"1022512","obj":{"i":1022512,"n":"Sanson","l":2406,"q":3}},{"type":"npc","id":"1022513","obj":{"i":1022513,"n":"Guydelot","l":2406,"q":3}},{"type":"npc","id":"1022511","obj":{"i":1022511,"n":"Nourval","l":2406,"q":2}},{"type":"npc","id":"1022514","obj":{"i":1022514,"n":"Guydelot","l":2406,"q":3}},{"type":"npc","id":"1022515","obj":{"i":1022515,"n":"Serpent Scout","l":2406,"q":1}},{"type":"quest","id":"68426","obj":{"i":68426,"n":"Three's a Company","g":151,"l":"South Shroud","s":601,"f":1}},{"type":"quest","id":"68428","obj":{"i":68428,"n":"One Autumn's Secret","g":151,"l":"The Fringes","s":650,"f":1}}]}