{"quest":{"name":"One Autumn's Secret","location":"The Fringes","id":68428,"patch":4.0,"sort":650,"icon":100674,"unlocksFunction":1,"eventIcon":71341,"issuer":1022512,"target":1022523,"involved":[1022513,1022514,1022519,1022520,1022521,1022522],"genre":151,"journal":["Sanson is poised to pounce upon Nourval.","Following extended surveillance, Sanson and Guydelot are confident that Nourval is in league with the masked bandits. In order to catch the man red-handed, Sanson has contrived to lure him out of the castrum with his guard lowered. Find Nourval inside the stronghold and lead him into thinking that the way is clear.","You inform Nourval that your two comrades are tied up, and the man takes the bait and hastens away. Join Sanson outside the castrum.","Sanson is pleased that his ploy has worked, and even now Guydelot shadows Nourval to his destination. Make your way to the ruin called Gyr Kehim to the northeast and join your fellow bard on the chase.","You catch Nourval meeting with the masked bandits, who have found the tome you seek─the journal of the Ala Mhigan general Gylbarde. Eavesdropping on their conversation, you learn their true purpose: stoking the fires of anti-Ala Mhigan sentiment. Determined not to let this come to pass, your party confronts Nourval's, and at the end of a fierce confrontation, you emerge the victor and with the journal in your hands.","The defeated Nourval flees the scene, but not before revealing that he is descended from Vainchelon. And in turn, the journal reveals that Vainchelon did not die of illness as is believed, but rather was poisoned by Gylbarde at a secret meeting. The revelation comes as a shock to Sanson and Guydelot, who worry what may happen should the truth be made public knowledge. There is clearly much to mull over; for now, return to Castrum Oriens with your comrades.","Back at Castrum Oriens, Sanson shares with you further details from the journal. It appears that one of Vainchelon's sons was present at the deadly meeting, and he alone managed to escape with his life. But rather than tell of events as they happened, he kept the truth of his sire's demise a secret. Even as the man's motive boggles him, Sanson must turn his attention to his own dilemma: deciding what to do with Gylbarde's journal. Though he knows in his mind that the truth is best kept buried, in his heart he is not wholly convinced, and begs you for more time to consider the matter.<br><br>※The next bard quest will be available from Sanson upon reaching level 68."],"objectives":["Speak with Nourval.","Join Sanson outside Castrum Oriens.","Join Guydelot on the chase.","Speak with Sanson.","Defeat Nourval!"],"dialogue":[{"name":"GUYDELOT","text":"Whatever shenanigans Nourval's up to, we're gonna find out."},{"name":"SANSON","text":"We've continued our surveillance of Nourval's activities. It's beyond a shadow of a doubt that he has an ulterior motive."},{"name":"SANSON","text":"In order to find the tome, it's past time we took our search to the field, but always he finds an excuse to stall."},{"name":"SANSON","text":"Whenever I suggest investigating this ruin or that, he will inevitably claim we haven't enough information. 'Tis plain he doesn't want us out there."},{"name":"GUYDELOT","text":"Nay, bastard wants all that outside goodness for himself. But try as we might, we haven't been able to find out where he sneaks off to. Warier than a bird, that one."},{"name":"GUYDELOT","text":"Meanwhile, the masked bandits continue ambushing Alliance patrols, and they always know exactly where and when to strike. It's as though they have insider knowledge of patrol routes."},{"name":"GUYDELOT","text":"The only explanation being there's a mole in the garrison leaking them intelligence."},{"name":"SANSON","text":"And who could that mole be save for Nourval? Every move of his marks him as the prime suspect."},{"name":"SANSON","text":"We know little and less of Nourval's plot, but it can only lead to ill. We must needs bring it to light, and swiftly, before he can do any more harm."},{"name":"SANSON","text":"To that end, Guydelot and I have been keeping Nourval close, allowing him no chance to act. By now he will be positively itching to rendezvous with his accomplices."},{"name":"SANSON","text":"And this is where you come in, <span class=\"highlight\">Forename</span>. We need you to feed Nourval some false information─that I am in an Alliance meeting, and Guydelot...a drunken stupor."},{"name":"SANSON","text":"Our man will not pass up the chance to sneak out, and he is like to do so with greater haste than usual. This will afford us an opening to shadow him to his destination."},{"name":"GUYDELOT","text":"...Drunken stupor? Really?"},{"name":"SANSON","text":"Not so flattering, I know, but you cannot deny that it's believable."},{"name":"SANSON","text":"Now then, <span class=\"highlight\">Forename</span>, pray go to Nourval and plant our misinformation. Once you have done so, come and meet us outside the castrum."},{"name":"NOURVAL","text":"...Both of them unavailable? And there I was ready to strike out on the trail of a promising lead!"},{"name":"NOURVAL","text":"Well, disappointing though it is, the search will have to wait. Now, if you will excuse me, I have some business to attend to."},{"name":"SANSON","text":"It worked, my friend! Nourval rushed out of the castrum not a moment ago!"},{"name":"SANSON","text":"He was headed east, towards a ruin called Gyr Kehim. Guydelot trails him even as we speak. Come, let us join the chase."},{"name":"SANSON","text":"What is he up to?"},{"name":"GUYDELOT","text":"It's a good old-fashioned tryst. Let's have us a peek, shall we?"},{"name":"MASKMAN02892","text":"We have it, my lord! Turned it up among his retainer's possessions!"},{"name":"NOURVAL","text":"At long last, Gylbarde's journal...and not a moment too soon. I'd just about outstayed my welcome at the garrison."},{"name":"NOURVAL","text":"When that adventurer caught us falling upon the patrol, I had feared that the game was up."},{"name":"NOURVAL","text":"But thankfully, the other two were blind fools. All this time watching me, and they didn't see a thing. Hehehe..."},{"name":"MASKMAN02892","text":"We've only skimmed the tome, but it seems you were right. About what happened to Lord Vainchelon."},{"name":"NOURVAL","text":"Was there ever any doubt? Once we return to Gridania and make this knowledge public, none shall harbor so much as a shred of sympathy for Ala Mhigo."},{"name":"NOURVAL","text":"That shall pave the way for us to propagate Lord Vainchelon's will...and advance our agenda."},{"name":"SANSON","text":"At last we've uncovered Nourval's purpose, and the tome is right before our eyes, no less."},{"name":"SANSON","text":"Commander Heuloix spoke of a faction that vehemently opposes our aiding Ala Mhigo. I daresay we have found them."},{"name":"SANSON","text":"But how did Nourval come to lead such a crew? And what is this talk of Vainchelon?"},{"name":"GUYDELOT","text":"What, the Gridanian general sung about in nigh a hundred songs, who led our forces against Gylbarde in the Autumn War?"},{"name":"SANSON","text":"Only to die of an illness before the fighting was over. Aye, the very same. Having lost his leadership, we would have lost the war entirely had the other nations not come to our aid."},{"name":"GUYDELOT","text":"Don't know about the rest of you, but it seems to me our damning little secret pertains to Vainchelon."},{"name":"SANSON","text":"And Nourval seeks to use it to stoke the fires of anti-Ala Mhigan sentiment to some sinister end. This cannot be borne─we cannot let them have the journal! Are you with me?"},{"name":"NOURVAL","text":"Hmph, perhaps you are not such blind fools after all. Very well, take your journal."},{"name":"NOURVAL","text":"Aye, take it! Read it! Know the vile crime the Ala Mhigans committed against Lord Vainchelon─against my own blood! And see the folly of aiding such honorless people!"},{"name":"SANSON","text":"Wh-What do you mean, your own blood?"},{"name":"SANSON","text":"Did I mishear? Did he just say that Vainchelon was his ancestor?"},{"name":"GUYDELOT","text":"Aye, that's what it sounded like. Vainchelon, the folk hero loved by all, celebrated in countless songs...and that pain in the rear's his descendant. Never would've guessed. Anyroad, we've got bigger concerns. Let's see what this musty old tome's hiding."},{"name":"SANSON","text":"“To Vainchelon I extended an invitation to negotiate peace. The meeting must be in secret, I explained, for not all of my officers share my view. My opponent accepted and arrived at the appointed hour.”"},{"name":"GUYDELOT","text":"Peace? Everybody knows there weren't no peace on offer. The hells' this about?"},{"name":"SANSON","text":"Wait, it continues: “Without suspicion, he took his seat. And without suspicion, he drank the poisoned wine. The effect was swift and sure, and within moments the man lay dead at my feet.”"},{"name":"GUYDELOT","text":"Wait, Vainchelon was murdered? By <span class=\"emphasis\">poison</span>!?"},{"name":"SANSON","text":"To this day, Lord Vainchelon remains an object of worship among many Gridanians. Were they to learn of this, the present grumblings against Ala Mhigan liberation are liable to grow into large-scale protests."},{"name":"SANSON","text":"To this day, Lord Vainchelon remains an object of worship among many Gridanians. Were they to learn of this, it would pose a serious and ongoing impediment to diplomatic relations."},{"name":"GUYDELOT","text":"There's no denying that some Ala Mhigans did some terrible things in the past, but what Nourval's trying to do ain't no better. Might be as he's after the truth, but nothing good'll come of this, and certainly not any decent songs."},{"name":"SANSON","text":"The truth... Tell me, Guydelot. When we surrender this journal to our superiors, what do you think they would do with the knowledge?"},{"name":"GUYDELOT","text":"The Seedseers aside, I reckon the brass hats at the Adders' Nest would want to cover it up. Bury it nice and deep and pretend it never existed."},{"name":"SANSON","text":"Aye... Nor would I put it past them to exploit the knowledge to gain leverage in dealings with Ala Mhigo. But whatever they may do is none of our concern, is it? Duty compels us to hand the journal over to headquarters..."},{"name":"GUYDELOT","text":"You're the leader of our merry band, Sanson, and duty compels me to obey your orders, shite though they often are. You decide whether we hand over the journal or not."},{"name":"SANSON","text":"Guydelot would entrust this decision to me. But what of you, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You should decide."},{"name":"A1","text":"We should all decide."},{"name":"SANSON","text":"Yes, that would only be proper. As the leader, mine is the burden of decision."},{"name":"SANSON","text":"No, forgive me this unseemly display. Guydelot has the right of it. As the leader, mine is the burden of decision."},{"name":"GUYDELOT","text":"At any rate, this ain't the place for moral dilemmas. Let's get ourselves back to the castrum afore Nourval and his mates decide they want to have another go."},{"name":"GUYDELOT","text":"Sanson's still trying to make up his mind. Well, not like I'm in a hurry or nothing."},{"name":"SANSON","text":"Guydelot has disappeared somewhere in the castrum. Giving me room to ponder matters, I shouldn't doubt."},{"name":"SANSON","text":"I've since read through Gylbarde's journal, and I'm afraid there is no two ways about it. He summoned Vainchelon under the pretense of peace, and then slew him with poison."},{"name":"SANSON","text":"However, one mystery remains. It appears one of Vainchelon's sons was present at the fateful meeting."},{"name":"SANSON","text":"Landrenel was his name, and he narrowly escaped with his life. But instead of crying bloody murder, he announced that his sire had died of illness."},{"name":"SANSON","text":"Here is a man who witnessed his own flesh and blood slain, and in the most underhanded manner, yet he concealed the truth. Why did he do this? I do not understand..."},{"name":"SANSON","text":"But it avails us naught to agonize over the motives of those who lived in the past. Nay, our quandary concerns the future."},{"name":"SANSON","text":"For the future of both nations, the truth is best kept buried. No good can come of digging it up. 'Tis crystal clear what must be done."},{"name":"SANSON","text":"And yet, though my mind sees the logic, my heart rebels against the idea. Forgive me, <span class=\"highlight\">Forename</span>. It seems I require more time to think on it."},{"name":"SANSON","text":"Nourval! We cannot allow you to have that tome!"},{"name":"NOURVAL","text":"H-How did you─!? ...No matter! You'll not stand in my way!"},{"name":"GUYDELOT","text":"So you want to do this the hard way, eh?"},{"name":"SANSON","text":"He leaves us no choice!"},{"name":"NOURVAL","text":"Have at them!"},{"name":"GUYDELOT","text":"Damn! Was more o' them in the ruin!"},{"name":"SANSON","text":"I leave them to you and <span class=\"highlight\">Forename</span>!"},{"name":"SANSON","text":"Poisoned arrows!?"},{"name":"GUYDELOT","text":"Hmph, pesky archers! Somebody deal with 'em!"},{"name":"NOURVAL","text":"Now! Fan out!"},{"name":"GUYDELOT","text":"How many friends has he got!?"},{"name":"SANSON","text":"Not good..."},{"name":"NOURVAL","text":"The time for charades is past! I will show you the technique of my ancestors!"},{"name":"SANSON","text":"What is he─!?"},{"name":"SANSON","text":"Urgh! Wh-Whence comes this power!?"},{"name":"GUYDELOT","text":"Damn... Bastard's full of surprises..."},{"name":"SANSON","text":"You must...finish this..."},{"name":"GUYDELOT","text":"Bugger it all... Get that bastard for me..."}],"reward":{"gil":1995,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":24}],"quests":[68427]},"next":[68429]},"partials":[{"type":"npc","id":"1022512","obj":{"i":1022512,"n":"Sanson","l":2406,"q":3}},{"type":"npc","id":"1022523","obj":{"i":1022523,"n":"Sanson","l":2406,"q":2}},{"type":"npc","id":"1022513","obj":{"i":1022513,"n":"Guydelot","l":2406,"q":3}},{"type":"npc","id":"1022514","obj":{"i":1022514,"n":"Guydelot","l":2406,"q":3}},{"type":"npc","id":"1022519","obj":{"i":1022519,"n":"Nourval","l":2406,"q":1}},{"type":"npc","id":"1022520","obj":{"i":1022520,"n":"Sanson","l":2406,"q":1}},{"type":"npc","id":"1022521","obj":{"i":1022521,"n":"Sanson","l":2406,"q":1}},{"type":"npc","id":"1022522","obj":{"i":1022522,"n":"Guydelot","l":2406,"q":1}},{"type":"quest","id":"68427","obj":{"i":68427,"n":"Masked Motives","g":151,"l":"The Fringes","s":630,"f":1}},{"type":"quest","id":"68429","obj":{"i":68429,"n":"Sleeping Truths Lie","g":151,"l":"The Fringes","s":680,"f":1}}]}