{"quest":{"name":"Those We Hold Dear","location":"The Lochs","id":68425,"patch":4.0,"sort":10040,"icon":100714,"eventIcon":71221,"issuer":1023396,"target":1023400,"involved":[1023395,1023399],"genre":106,"journal":["Bertliana is ready to honor a fallen comrade.","Now that the group has arrived in Ala Mhigo, Bertliana would like to commemorate Wilred's memory. Wichard tells you there is a cenotaph known as the Tomb of the Errant Sword to the north of the city. Bertliana asks you to speak with her once you are ready to depart.","Bertliana bids you meet her in front of the Tomb of the Errant Sword.","Bertliana says a heartfelt farewell to her fallen comrade, struggling to accept that he is not here to take in their ancestors' homeland. She promises to someday visit Wilred and tell him all about Ala Mhigo and how she helped rebuild the city–state. You are thanked one final time and Bertliana says she hopes to see you again sometime in the future."],"objectives":["Speak with Bertliana.","Speak with Bertliana again."],"dialogue":[{"name":"PASSIONATESOLDIER02889","text":"Some things may have changed, but there is still much here that is exactly as I remember it. It is good to be back."},{"name":"BERTLIANA","text":"Now we are safely arrived, it is time we honored Wilred's memory."},{"name":"BERTLIANA","text":"Wichard, would you happen to know of a nearby cenotaph? My mother told me there was one not too far from Ala Mhigo."},{"name":"WICHARD","text":"Ah, yes. She must have been referring to the Tomb of the Errant Sword. You will find it just to the north of the city."},{"name":"WICHARD","text":"Historically, many Ala Mhigans have worked as mercenaries. This naturally means that a not insignificant number of our people have died fighting in foreign lands. It is only right we have somewhere to pay our respects to them."},{"name":"BERTLIANA","text":"Yes, of course. Thank you for telling us its location."},{"name":"BERTLIANA","text":"Right, <span class=\"highlight\">Forename</span>, let us head to the Tomb of the Errant Sword. Tell me when you are ready to depart."},{"name":"WICHARD","text":"It truly warms my heart to see you all in Ala Mhigo. I swear on my uncle's life that this group will all enjoy living here."},{"name":"WICHARD","text":"Historically, many Ala Mhigans have worked as mercenaries. As a result, a not insignificant number of our people have died fighting in foreign lands. It is only right that we have somewhere to pay our respects to them."},{"name":"BERTLIANA","text":"Ready to depart?"},{"name":"BERTLIANA","text":"The Tomb of the Errant Sword is meant to lie to the north. Let us meet in front of it."},{"name":"BERTLIANA","text":"Wilred, can you see this view as well? It is truly stunning."},{"name":"BERTLIANA","text":"Crimson mountains, a sea of clouds, and a mighty fortress. It is just as Gundobald said.<br>I just can't believe you're not here to see it too..."},{"name":"BERTLIANA","text":"I promise you I will do everything I can to make sure future generations are able to live here in peace. Just like you wanted to."},{"name":"BERTLIANA","text":"So please wait for me, wherever you are, just a bit longer. I cannot wait to tell you all about our wonderful homeland."},{"name":"BERTLIANA","text":"Thank you, <span class=\"highlight\">Forename</span>. I will not take my new life in Ala Mhigo for granted. It is a gift that Wilred never got to receive. Do take care and I hope to see you here again someday."}],"reward":{"gil":1500,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68089,68424]}},"partials":[{"type":"npc","id":"1023396","obj":{"i":1023396,"n":"Bertliana","l":2408,"q":2}},{"type":"npc","id":"1023400","obj":{"i":1023400,"n":"Bertliana","l":2408,"q":1}},{"type":"npc","id":"1023395","obj":{"i":1023395,"n":"Wichard","l":2408,"q":2}},{"type":"npc","id":"1023399","obj":{"i":1023399,"n":"Overeager Swordsman","l":2408,"q":2}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}},{"type":"quest","id":"68424","obj":{"i":68424,"n":"Journey's End","g":105,"l":"The Peaks","s":10030}}]}