{"quest":{"name":"For Wilred","location":"Southern Thanalan","id":68422,"patch":4.0,"sort":10010,"icon":100714,"eventIcon":71221,"issuer":1006215,"target":1006215,"involved":[1023365,1023366,1023367,1023368,1023369,1023370,1023371],"genre":93,"journal":["Gundobald wishes to honor the memory of a brave warrior.","Gundobald would like to commemorate the life of Wilred, who died fighting for the Crystal Braves. He hands you the warrior's old sword and bids you present it to Bertliana, Wilred's childhood friend.","Bertliana recovers from the initial shock of seeing her friend's sword to introduce herself to you. She goes on to explain that it has long been her dream to someday take one of Wilred's belongings with her to Ala Mhigo, if it was liberated during her lifetime. Bertliana sets about packing the blade up and asks you to inform Gundobald that she will soon be ready to depart.","Gundobald clearly thinks highly of Bertliana─noting that she has done incredibly well to overcome all the hardships she has had to endure. You are given a list containing the names of the first group that has decided to make the journey to their homeland and asked to see if they still harbor any doubts about the move.","Everyone you speak with has their own worries, but you are able to reassure them that everything will be fine. You head back to Gundobald to relay that the group is now ready to make tracks.","Gundobald informs you that Bertliana will be in charge of leading the group back to Ala Mhigo. He bids you let her know that she is free to give the order to leave whenever she is ready."],"objectives":["Present Wilred's sword to Bertliana.","Speak with Gundobald.","Speak with those who wish to return to Ala Mhigo.","Report to Gundobald."],"dialogue":[{"name":"GUNDOBALD","text":"You are willing to help? Good to hear."},{"name":"GUNDOBALD","text":"There is something I wish to discuss with you while the first group packs up their belongings."},{"name":"GUNDOBALD","text":"I have been thinking a lot about Wilred of late. How he lost his life fighting for the Crystal Braves."},{"name":"GUNDOBALD","text":"I've been holding onto his sword ever since his passing. He, more than anyone, burned with a strong desire to take back Ala Mhigo, which is why I would like to send his sword with the group─that part of him may finally go home."},{"name":"GUNDOBALD","text":"I have a mind to entrust you and Bertliana with this task. She had been friends with Wilred ever since they were but children."},{"name":"GUNDOBALD","text":"Here is his blade. Take it to Bertliana."},{"name":"GUNDOBALD","text":"Take Wilred's sword to Bertliana. She will know how best to honor his memory. I shall continue to hold on to the boy's old uniform."},{"name":"BERTLIANA","text":"Oh, <span class=\"highlight\">Forename</span>, what brings you─wait, that sword you hold in your hand..."},{"name":"BERTLIANA","text":"I could never forget to whom this blade belonged. Thank you for bringing it to me."},{"name":"BERTLIANA","text":"But where are my manners. I know we have met before, but I have yet to introduce myself. I am Bertliana. I was good friends with Wilred."},{"name":"BERTLIANA","text":"I had always hoped that if I lived to see Ala Mhigo liberated I could take his short sword there."},{"name":"BERTLIANA","text":"I once heard from my grandmother that there is a spot in the Lochs where people honor their fallen comrades. I wish to take Wilred's sword there."},{"name":"BERTLIANA","text":"I will be ready to depart as soon as I have packed this blade. Please tell Gundobald as much."},{"name":"BERTLIANA","text":"I will be ready to depart as soon as I have packed this blade. Please tell Gundobald as much."},{"name":"GUNDOBALD","text":"Finished talking with Bertliana, have you? She has endured many hardships, but none of them have stopped her from moving forward with her life."},{"name":"GUNDOBALD","text":"It took her a while to come to terms with Wilred's passing, but look at her now─she is better at organizing our younger residents than I am."},{"name":"GUNDOBALD","text":"I am confident the two of you will do a fine job of commemorating Wilred's life. Once things have calmed down a bit I too shall go and pay my own respects."},{"name":"GUNDOBALD","text":"At any rate, I imagine the first lot should be ready to depart by now."},{"name":"GUNDOBALD","text":"I will give you a list of those who make up the group. Could you ask around and see if they have any concerns?"},{"name":"GUNDOBALD","text":"I am sure none of them will have taken the decision to move lightly, but that does not mean they have no doubts. Try your best to ease any of their worries."},{"name":"GUNDOBALD","text":"Ask around and see if any of the first group are worried about the move."},{"name":"ANXIOUSMAN02887","text":"I lived in Ala Mhigo until I was five or so─the very age my own boy is now. I do worry whether or not he'll be able to adjust to a new life over there..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He'll make new friends in no time."},{"name":"A1","text":"Children can adapt to anything."},{"name":"ANXIOUSMAN02887","text":"I suppose you're right. As long as he has friends he'll be fine."},{"name":"ANXIOUSMAN02887","text":"That is true. I remember it didn't take me too long to adjust to life away from Ala Mhigo when I was his age."},{"name":"ANXIOUSMAN02887","text":"Thank you for listening to my worries. I have dreamed of returning for so long, and yet now the moment is here I find myself incredibly anxious. However, I know it will work out somehow."},{"name":"RESTLESSWOMAN02887","text":"I wonder if there will be work for me back in Ala Mhigo?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You can help everyone rebuild."},{"name":"A2","text":"Make use of whatever skills you have."},{"name":"RESTLESSWOMAN02887","text":"Yes, I suppose they will need as many hands as possible to repair the damage done by the Empire."},{"name":"RESTLESSWOMAN02887","text":"You're right. I've gotten by just fine in Little Ala Mhigo─why should things be any different elsewhere?"},{"name":"RESTLESSWOMAN02887","text":"I may not have been able to fight against the imperial forces, but I will do all I can to help rebuild my home!"},{"name":"EXCITINGBOY02887","text":"My uncle told me all about Ala Mhigo! I bet I know more than you."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I know there's a big castle there!"},{"name":"A3","text":"I know lots of people live there!"},{"name":"EXCITINGBOY02887","text":"Wow, really!? I mean, of course I already knew that. My uncle knows everything. So I do too!"},{"name":"EXCITINGBOY02887","text":"Wow, really!? I mean, of course I already knew that. My uncle knows everything. So I do too!"},{"name":"EXCITINGBOY02887","text":"It'll be sad saying good-bye to all my friends here. But I know I can make new ones in Ala Mhigo!"},{"name":"NERVOUSWOMAN02887","text":"Ah, I always found it to be such a pretty area. I do hope the fighting has not damaged the city."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"There is some damage, but the city is fine."},{"name":"A4","text":"Everything is as you remember it."},{"name":"NERVOUSWOMAN02887","text":"Well, I suppose some damage is only to be expected. Wars are not especially peaceful affairs."},{"name":"NERVOUSWOMAN02887","text":"Truly? I cannot wait to revisit all my favorite spots."},{"name":"NERVOUSWOMAN02887","text":"Though frankly I am just glad I will be able to return to Ala Mhigo at all. The state of the city matters not in the grand scheme of things."},{"name":"PASSIONATESOLDIER02887","text":"I can rest at ease knowing you will be escorting us. This will be my first time heading out to Baelsar's Wall in a while. Tell me, is the road there dangerous these days?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Bandits and beasts are everywhere."},{"name":"A5","text":"It's not really that perilous."},{"name":"PASSIONATESOLDIER02887","text":"Is that so? I will have to be on my guard then!"},{"name":"PASSIONATESOLDIER02887","text":"Really? Well, even if there are any bandits lurking in the shadows, I am sure you will have no trouble protecting us."},{"name":"PASSIONATESOLDIER02887","text":"There are few warriors in our group, so I'm glad I had a chance to ask you about the road ahead. I will do my best to keep everyone safe from harm."},{"name":"ANXIOUSMAN02887","text":"Thank you for listening to my worries. I have dreamed of returning for so long, and yet now the moment is here I find myself incredibly anxious. However, I know it will work out somehow."},{"name":"RESTLESSWOMAN02887","text":"I may not have been able to fight against the imperial forces, but I will do all I can to help rebuild my home!"},{"name":"EXCITINGBOY02887","text":"It'll be sad saying good-bye to all my friends here. But I know I can make new ones in Ala Mhigo!"},{"name":"NERVOUSWOMAN02887","text":"Frankly I am just glad I will be able to return to Ala Mhigo at all. The state of the city matters not in the grand scheme of things."},{"name":"PASSIONATESOLDIER02887","text":"There are few warriors in our group, so I'm glad I had a chance to ask you about the road ahead. I will do my best to keep everyone safe from harm."},{"name":"BERTLIANA","text":"Not long until we set off now."},{"name":"GUNDOBALD","text":"Done speaking with everyone? Then, by my reckoning, it is time they departed."},{"name":"GUNDOBALD","text":"Bertliana will guide the group to Ala Mhigo. Tell her she can give the order to leave whenever she is ready."}],"reward":{"gil":1500,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68089,68421]},"next":[68423]},"partials":[{"type":"npc","id":"1006215","obj":{"i":1006215,"n":"Gundobald","l":45,"q":13}},{"type":"npc","id":"1023365","obj":{"i":1023365,"n":"Bertliana","l":45,"q":1}},{"type":"npc","id":"1023366","obj":{"i":1023366,"n":"Perturbed Parent","l":45,"q":2}},{"type":"npc","id":"1023367","obj":{"i":1023367,"n":"Worried Woman","l":45,"q":2}},{"type":"npc","id":"1023368","obj":{"i":1023368,"n":"Boisterous Boy","l":45,"q":2}},{"type":"npc","id":"1023369","obj":{"i":1023369,"n":"Careless Crone","l":45,"q":2}},{"type":"npc","id":"1023370","obj":{"i":1023370,"n":"Overeager Swordsman","l":45,"q":2}},{"type":"npc","id":"1023371","obj":{"i":1023371,"n":"Bertliana","l":45,"q":2}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}},{"type":"quest","id":"68421","obj":{"i":68421,"n":"Dreaming of Home","g":103,"l":"Rhalgr's Reach","s":10010}},{"type":"quest","id":"68423","obj":{"i":68423,"n":"Journey's Beginning","g":93,"l":"Southern Thanalan","s":10020}}]}