{"quest":{"name":"Sleeping Truths Lie","location":"The Fringes","id":68429,"patch":4.0,"sort":680,"icon":100674,"unlocksFunction":1,"eventIcon":71341,"issuer":1022523,"target":1022528,"involved":[1022514,1022527,1022743],"genre":151,"journal":["Sanson is on the verge of making a decision on the tome.","Having heard your honest opinion, Sanson has made up his mind on what to do with the journal bearing the Autumn War's sordid secret. Go with him to Guydelot, and hear his announcement with your brother bard.","Sanson declares that he will surrender Gylbarde's journal to his superiors, but only on the condition that the truth is made known one day, when the people are ready to hear it. At that moment, a letter arrives from Nourval requesting to speak with you, and you alone. Although Guydelot is highly suspicious, Sanson chooses to believe that Nourval may in fact have something of import to discuss, and bids you meet him near the Percipient One in Dimwold.","As you arrive at the rendezvous point, you are ambushed by masked men, and end up trading blows with them instead of words with Nourval. Hasten back to Castrum Oriens and inform your comrades what has happened.","You return to the castrum to find Guydelot alone. It appears a second letter arrived shortly after you struck out, this time summoning Sanson, and it becomes apparent that he was Nourval's target all along. Follow Guydelot as he retraces Sanson's footsteps in the direction of the Percipient One.","You find Sanson's notebook bearing a message written in blood. As feared, Nourval has taken your friend, and will soon make his price known. Return to Gridania and join Guydelot at the Adders' Nest, where he will petition the order's aid.","Though Guydelot has reported the situation to his superiors, he holds on to Gylbarde's journal as insurance. While waiting to see how the order and Nourval will move, your comrade bids you rest up and conserve your strength, for it will surely be needed in the rescue mission to come.<br><br>※The next bard quest will be available from Guydelot upon reaching level 70."],"objectives":["Speak with Guydelot.","Wait for Nourval at the Percipient One.","Speak with Guydelot.","Speak with Guydelot at the Adders' Nest."],"dialogue":[{"name":"GUYDELOT","text":"Sanson's still trying to make up his mind. Well, not like I'm in a hurry or nothing."},{"name":"SANSON","text":"The instant we hand Gylbarde's journal to headquarters, the truth of Vainchelon's death is all but guaranteed to be struck from history..."},{"name":"SANSON","text":"I've thought long and hard on a course of action─what we should do with the tome─and I believe I'm drawing close to the answer."},{"name":"SANSON","text":"Before I make my decision, however, I would ask your honest opinion. Do you think the sordid truth of the Autumn War should be made public knowledge? Even should it jeopardize our relations with Ala Mhigo?"},{"name":"Q1","text":"What should we do with the truth?"},{"name":"A1","text":"Make it public knowledge."},{"name":"A1","text":"Keep it a secret."},{"name":"A1","text":"Ascertain its credibility."},{"name":"SANSON","text":"An upright choice from an upright <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. Though Nourval's motives and methods are unconscionable, one cannot deny that there is justice in pursuing truth."},{"name":"SANSON","text":"A practical choice from a practical <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. As a man of the military, it should be mine also. Though the truth would be lost, it is arguably a small sacrifice to make in the face of potential chaos."},{"name":"SANSON","text":"Verily, a sound choice demands a sound grasp of the situation. As ever, you are an island of calm reason amidst a sea of chaos."},{"name":"SANSON","text":"Thank you, <span class=\"highlight\">Forename</span>. As the leader of our unit, I am now ready to make my decision."},{"name":"SANSON","text":"Let us find Guydelot. He will wish to hear it, too."},{"name":"SANSON","text":"When the both of you are ready, I will announce my decision."},{"name":"GUYDELOT","text":"So, you've made up your mind, then? About what to do with the truth?"},{"name":"SANSON","text":"I have. I shall go to the Adders' Nest and entrust the journal to our superiors' care. Above all, we cannot allow it to be used as an instrument of hatred."},{"name":"SANSON","text":"Having said that, neither will I stand for the truth to be erased. I will oppose any attempt to do so with all my being."},{"name":"GUYDELOT","text":"Er, I'm not sure I understand. What do you want to do exactly?"},{"name":"SANSON","text":"I will hand over the journal...on the condition that the truth be revealed one day, when the people are ready to accept it."},{"name":"SANSON","text":"Call me indecisive, but I cannot bear to see the tome misused, nor the truth willfully buried."},{"name":"GUYDELOT","text":"Well, well, look at you! Sanson the Stiff, standing his ground!"},{"name":"GUYDELOT","text":"Goes without saying, but I'm with you, Chief. Ain't no one gonna exploit or erase history on my watch."},{"name":"SANSON","text":"Thank you, my friends. For trusting in me."},{"name":"GUYDELOT","text":"Don't let it get to your head, though, eh? Had your decision not been to my liking, I would've knocked you flat on your arse and resigned from your swivin' unit."},{"name":"SANSON","text":"So much for “You decide”... &lt;sigh&gt; Never change, Guydelot."},{"name":"SERPENTSOLDIER02893","text":"Captain Sanson, right? Some fellow asked me to pass this letter to you."},{"name":"SANSON","text":"Th-This is from Nourval!"},{"name":"SANSON","text":"(-Nourval's Letter-)The journal is yours to do with as you wish. But ere you take it away, I would speak with <span class=\"highlight\">Forename</span>, and <span class=\"highlight\">Forename</span> alone, one last time. I await you in Dimwold, by the Percipient One."},{"name":"GUYDELOT","text":"Oh, this reeks. Tell me it don't."},{"name":"SANSON","text":"But if this is a trap, why would Nourval ask for the strongest of all of us? He may truly have something important to say."},{"name":"SANSON","text":"Conversely, it would also offer us a chance to convey our intent. I am loath to expose you to danger, my friend, but will you go to this meeting?"},{"name":"GUYDELOT","text":"I don't like the idea of you going alone, but that'd defeat the purpose of the meeting. At the first sign of danger, though, get out of there fast, alright?"},{"name":"SANSON","text":"This may be our last chance to speak with Nourval. Please go to Dimwold and see what he has to say."},{"name":"GUYDELOT","text":"First sign of trouble, you beat a retreat, alright?"},{"name":"BALLOON","text":"We've been waiting for you."},{"name":"BALLOON","text":"..."},{"name":"GUYDELOT","text":"Ah, you're back. But where's Sanson?"},{"name":"GUYDELOT","text":"Another letter arrived right after you left, asked for him to come as well. You're really alone, then?"},{"name":"GUYDELOT","text":"Swive me! You were just the diversion─Sanson was their real target!"},{"name":"GUYDELOT","text":"I thought it'd be alright seeing as you'd be there, but I should've gone as well! Gods strike me down for a fool!"},{"name":"GUYDELOT","text":"If you didn't see Sanson, they must've nabbed him on the way to Dimwold. Come on, we have to find him!"},{"name":"GUYDELOT","text":"Sanson's book was lyin' here. They left a message in blood, the godsdamned mummers."},{"name":"GUYDELOT","text":"“We have your friend. We will send our price to the Adders' Nest.”<br>...That whoreson can take his ransom and shove it up his arse! We're gonna storm their hideout, tear 'em all new ones, and free Sanson!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"We must keep calm."},{"name":"A2","text":"We don't know where they are."},{"name":"GUYDELOT","text":"Dammit, <span class=\"highlight\">Forename</span>, how can you always be so calm? It's downright contagious. And you're right, of course. If we charge in, we'd be putting Sanson at risk."},{"name":"GUYDELOT","text":"Dammit, <span class=\"highlight\">Forename</span>, how can you always be so calm? It's downright contagious. And you're right, of course. We don't even know where the bastards've taken Sanson."},{"name":"GUYDELOT","text":"We need help if we're gonna save him. Come on, let's hurry back to Gridania, to the Adders' Nest."},{"name":"GUYDELOT","text":"I've just reported the situation. They're gonna call a meeting to talk strategy."},{"name":"GUYDELOT","text":"As for Gylbarde's journal...I'm still holding on to it. Told 'em it's for the chief to hand over. They were none too pleased, fancy that."},{"name":"GUYDELOT","text":"Y'see, unlike our friend Sanson, I don't have much faith in the order. Don't trust 'em to act in our best interests. The journal's our bargaining chip, not only with them but Nourval besides."},{"name":"GUYDELOT","text":"Would be good to bring old Jehantel into it as well. He'd want to know, and might even have some sage advice to share."},{"name":"GUYDELOT","text":"But for now, we sit tight─wait and see what the order and Nourval will do. And then we plan some doings of our own. Till then, rest up and save your strength, <span class=\"highlight\">Forename</span>. We're gonna need it."}],"reward":{"gil":1158,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":24}],"quests":[68428]},"next":[68430]},"partials":[{"type":"npc","id":"1022523","obj":{"i":1022523,"n":"Sanson","l":2406,"q":2}},{"type":"npc","id":"1022528","obj":{"i":1022528,"n":"Guydelot","l":52,"q":2}},{"type":"npc","id":"1022514","obj":{"i":1022514,"n":"Guydelot","l":2406,"q":3}},{"type":"npc","id":"1022527","obj":{"i":1022527,"n":"Guydelot","l":2406,"q":1}},{"type":"npc","id":"1022743","obj":{"i":1022743,"n":"Sanson","l":2406,"q":1}},{"type":"quest","id":"68428","obj":{"i":68428,"n":"One Autumn's Secret","g":151,"l":"The Fringes","s":650,"f":1}},{"type":"quest","id":"68430","obj":{"i":68430,"n":"Sweet Dreams Are Made of Peace","g":151,"l":"Gridania","s":700,"f":1}}]}