{"quest":{"name":"At the Top of the Stairs","location":"The Lochs","id":68420,"patch":4.0,"sort":9080,"eventIcon":71221,"issuer":1022989,"target":1022989,"involved":[1023175],"genre":106,"journal":["Topher seeks a redoubtable soldier for an urgent mission."],"objectives":["Speak with the Resistance fighter.","Climb to the top of the tower and search for enemies.","Report to the Resistance fighter.","Report to Topher."],"dialogue":[{"name":"TOPHER","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>, I have a mission that requires your immediate attention."},{"name":"TOPHER","text":"A squad I dispatched to secure a watchtower to the south of here has sent an urgent request for reinforcements."},{"name":"TOPHER","text":"The structure seemed abandoned according to our scouts, and I thought the few men I sent would be sufficient for the task... It appears I was wrong: they were ambushed by a superior force."},{"name":"TOPHER","text":"My remaining soldiers have left on other duties, and I fear the watchtower squad may not survive until the rest of our company can reach them."},{"name":"TOPHER","text":"You may be their only hope. Pray make haste to Sothwatch, and rendezvous with our Resistance fighters there."},{"name":"TOPHER","text":"Sothwatch is almost directly to the south of here. The lives of my men may depend upon the swiftness of your steed..."},{"name":"LIBERATOR02884","text":"Aren't you one of the Scions of the Seventh Dawn...? By Rhalgr, they've sent us the bloody Warrior of Light! I've heard all the tales!"},{"name":"LIBERATOR02884","text":"I...should probably tell you what happened. The tower looked empty, as we were told it would be, but we barely made it to the top of the stairs."},{"name":"LIBERATOR02884","text":"Some <span class=\"emphasis\">thing</span> appeared out of thin air and attacked us. Maybe several somethings. I was just flailing my axe behind me, hoping to discourage whatever it was while I pushed the wounded ahead of me back down the stairwell."},{"name":"LIBERATOR02884","text":"I suppose you'll be going up there to deal with our ambushers, then? If you don't mind, I'll stand guard here and look to my comrades' injuries."},{"name":"LIBERATOR02884","text":"I'll stay down here and bind the worst of our wounds. With the sort of arts you're known to use, I'm sure I'd just be in your way."},{"name":"LIBERATOR02884","text":"...Ah, that sounds like dhruvas, that does. Didn't get a good look at them myself, but I'm glad I no longer need to. You have our thanks."},{"name":"LIBERATOR02884","text":"A few bandages have seen my fellows right, so we should be able to finish up here. Please pass on my report to Captain Topher."},{"name":"LIBERATOR02884","text":"Our injuries weren't as bad as I first thought─cuts to the head always look worse than they are. Still, better safe than dead, eh?"},{"name":"TOPHER","text":"My men are no longer in danger, then? I thank you for rushing to their aid, [GC Rank][GC Rank][GC Rank]."},{"name":"TOPHER","text":"These dhruvas you encountered... No one is certain how they came about, but one theory describes them as a manner of naturally occurring golem─crystals that have spontaneously shaped themselves into monstrous forms."},{"name":"TOPHER","text":"They appear and act like living beings, but have no intelligence to speak of. All we know is that dhruvas are drawn to other creatures in a relentless hunt for aether. Gyr Abanians have learned to loathe and fear them."},{"name":"TOPHER","text":"They used to hire mercenaries to clear out the worst of such nightmares, but it would seem the imperials neglected even that simple task. They care not what befalls the citizens of their conquered provinces..."},{"name":"TOPHER","text":"I will take news of this incident to my superiors, and see that any potential dhruva haunts are properly scouted in the future. Again, you have my thanks."}],"reward":{"gil":745,"xp":120150},"reqs":{"jobs":[{"lvl":69,"id":34}],"quests":[68087]}},"partials":[{"type":"npc","id":"1022989","obj":{"i":1022989,"n":"Topher","l":2408,"q":1}},{"type":"npc","id":"1023175","obj":{"i":1023175,"n":"Resistance Fighter","l":2408,"q":1}},{"type":"quest","id":"68087","obj":{"i":68087,"n":"The Legacy of Our Fathers","g":6,"l":"The Lochs","s":1110}}]}