{"quest":{"name":"Three's a Company","location":"South Shroud","id":68426,"patch":4.0,"sort":601,"icon":100674,"unlocksFunction":1,"eventIcon":71341,"issuer":1006750,"target":1022511,"involved":[1000168,1022505,1022507,1022508,1022509,1022510,1022512,1022513],"genre":151,"journal":["Jehantel's eyes light up at the sight of you.","His voice brimming with delight, Jehantel informs you that Sanson, with whom you previously journeyed, has succeeded in gaining official approval for his bard unit. Even now, the young serpent captain rounds up members for its maiden mission, in relation to which he apparently has a favor to ask of you. Take yourself to Quiver's Hold in Gridania and see what your friend requires.","Greeting you warmly, Sanson requests your participation in his unit's first outing. If you would lend him your aid, join him at the Adders' Nest, where he will receive his orders from Commander Vorsaile Heuloix.","An anonymous letter has arrived at the Adders' Nest, which claims the existence of a tome bearing a damning secret pertaining to the Autumn War. In order to curb the growing anti-Ala Mhigan sentiment among Gridanians, the Order of the Twin Adder has decided to dispatch Sanson's newly formed unit to investigate. Head to Nine Ivies in the East Shroud and seek out the letter's mysterious sender.","At Nine Ivies, you make contact with the letter's sender, a native of Gridania named Nourval. The young man claims to be descended from a soldier who fought in the Autumn War, and based on his parents' account, the tome in question is to be found somewhere in Gyr Abania. He offers to assist in the search on the condition that he is permitted to join it, and Sanson relents. Make your way now to Castrum Oriens, which lies on the region's fringes.","At Nourval's recommendation, Sanson decides that the unit will remain in Castrum Oriens for a while to gather information. Take a rest for now, and be ready to depart when your comrades are done making their respective inquiries.<br><br>※The next bard quest will be available from Sanson upon reaching level 63."],"objectives":["Speak with Sanson at Quiver's Hold.","Speak with Vorsaile Heuloix at the Adders' Nest.","Speak with the letter's sender at Nine Ivies.","Speak with Nourval at Castrum Oriens."],"dialogue":[{"name":"JEHANTEL","text":"Ah, my dear <span class=\"highlight\">Forename</span>. How good of you to pay me a visit, and a timely one at that. Our friend Sanson, with whom you journeyed─I met with him but recently, and it pleases me to say that his labors have finally borne fruit."},{"name":"JEHANTEL","text":"Aye, his proposal for a unit incorporating bards has received formal approval. Even as we speak, he is rounding up members for the unit's inaugural mission."},{"name":"JEHANTEL","text":"Now, during our conversation, Sanson mentioned that he had a favor to ask of you. In case you haven't yet heard from him, mayhap you could seek him out first. You are like to find him at Quiver's Hold."},{"name":"JEHANTEL","text":"In case you haven't yet heard from Sanson, mayhap you could seek him out first. You are like to find him at Quiver's Hold."},{"name":"JEHANTEL","text":"I wasn't otherwise engaged, so I thought I would come along. Go on and see what it is Sanson requires of you."},{"name":"SANSON","text":"<span class=\"highlight\">Forename</span>, it's so good to see you! Our hard work has paid off, my friend: I've received permission to establish my bard unit! Moreover, we've already been assigned our first mission!"},{"name":"SANSON","text":"I couldn't be more pleased...save for one practical concern: our new recruits yet lack the experience to embark on an honest-to-gods mission."},{"name":"SANSON","text":"In seeking to fill our ranks, I immediately thought of you, <span class=\"highlight\">Forename</span>. You are an exemplary among bards, and I should be greatly heartened for your participation in our maiden outing."},{"name":"SANSON","text":"I've also taken the liberty of requesting Guydelot's transfer to the unit. With your combined experience and skill, we are bound to leave a splendid first impression!"},{"name":"SANSON","text":"Now then, I will go to receive my orders from Commander Heuloix. May I assume that you will join me?"},{"name":"JEHANTEL","text":"May I say that I, too, have a vested interest in young Sanson's success. I should be personally grateful were you to lend him your aid, <span class=\"highlight\">Forename</span>."},{"name":"JEHANTEL","text":"Let us see what manner of mission the commander has in store."},{"name":"SANSON","text":"With you on board, our success is all but assured."},{"name":"VORSAILE","text":"If it isn't <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>. By all accounts, you were instrumental in the success of Captain Smyth's previous expedition. We are glad for your cooperation."},{"name":"VORSAILE","text":"Now then, allow me to brief you on the mission. Our order has received an anonymous letter, one that makes certain...claims. We would have your unit verify the truth of it."},{"name":"SANSON","text":"(-Anonymous Letter-)There is a tome that holds a damning secret pertaining to the Autumn War. Should you desire it, send your most capable to Nine Ivies. I will be waiting."},{"name":"SANSON","text":"...The war between Gridania and Ala Mhigo? But that ended a hundred years ago. I labor to imagine what secret could exist that should be so damning even now. Might this not be an ill-conceived prank, Commander?"},{"name":"VORSAILE","text":"Our leadership believes it likely, to be sure, but it is not a risk they are willing to take. Nay, not with the winds of public sentiment blowing as they are."},{"name":"VORSAILE","text":"You all know that our order is involved in the Alliance's campaign to liberate Ala Mhigo."},{"name":"VORSAILE","text":"You all know that our order is involved in the Alliance's relief efforts for the recently liberated Ala Mhigo."},{"name":"VORSAILE","text":"Well, there are those among the citizenry that disapprove, a small but determined faction that refuses to forget the wrongs of a century past. They still view Ala Mhigo as the enemy, and ardently oppose our reaching out a hand of succor."},{"name":"VORSAILE","text":"Naught potentially incendiary can be allowed to stoke the people's discontent, and we must move quickly. Your mission is to make contact with the letter's sender and ascertain the nature of the secret."},{"name":"GUYDELOT","text":"(-Familiar Voice-)...You call that a mission? A bloody errand, more like. Couldn't be arsed to handle it yourselves, so you foist it on the eager new unit."},{"name":"GUYDELOT","text":"And if the secret proves inconvenient for Gridania, what then? Will you sweep it under the rug, along with all our hard work?"},{"name":"SANSON","text":"Guydelot, mind your tongue! You are addressing a superior officer!"},{"name":"VORSAILE","text":"Ah, so you are the famous Guydelot. Worry not, my friend. Whatever the secret turns out to be, I give you my personal assurance that you and yours will receive due credit for its discovery."},{"name":"GUYDELOT","text":"That's good enough for me. It's been forever since me and <span class=\"highlight\">Forename</span> last performed together, and I just want to enjoy the moment─no complicating factors, you know?"},{"name":"JEHANTEL","text":"The Autumn War is an emotional subject for Gridanians, the older generation especially. And for us bards, it is also notable for the involvement of singing archers."},{"name":"JEHANTEL","text":"In the course of your mission, I daresay there will be much to reflect upon and many opportunities to grow. I wish the three of you the best of luck."},{"name":"SANSON","text":"Without further ado, let us make haste to Nine Ivies...before Guydelot can exercise any more indiscretion."},{"name":"VORSAILE","text":"There is no telling who─or what─awaits at Camp Nine Ivies. See to it you spare no preparation."},{"name":"SANSON","text":"Unless I'm mistaken, this is our mysterious sender."},{"name":"GUYDELOT","text":"This our man, you reckon?"},{"name":"NOURVAL","text":"(-Nourval-)Well met, friends. I'm Nourval, a humble citizen of Gridania, and I see you received my letter."},{"name":"SANSON","text":"We've come as you bid. The tome, if you would be so kind."},{"name":"NOURVAL","text":"(-Nourval-)Ah, but I never said that I had it. And to be clear, I do not."},{"name":"SANSON","text":"What? Then why did you summon us here?"},{"name":"NOURVAL","text":"(-Nourval-)Patience, my friends. I will explain. You see, like many Gridanians, I have an ancestor who fought in the Autumn War. 'Twas he who first learned of the tome in question, after the fighting had ended."},{"name":"NOURVAL","text":"(-Nourval-)In turn, I learned of it from my parents, and since then I've dreamed of poring over its pages. Alas, as it lies deep within Ala Mhigan territory, I was resigned never to have the chance."},{"name":"NOURVAL","text":"(-Nourval-)But then the brave soldiers of the Alliance took Baelsar's Wall, and the way was made clear. When I heard the tidings, the flames of my boyhood passion were rekindled. Finally, I can fulfill my dream!"},{"name":"NOURVAL","text":"(-Nourval-)...Or so I told myself, before I thought better of it. I'm no soldier, you see, and the prospect of wandering a war-ravaged land in search of a tome is, frankly, unrealistic. That's why I decided to reach out to your order for cooperation."},{"name":"NOURVAL","text":"(-Nourval-)Based on my parents' account, I'm confident that I can track down the tome. And I will help you to find it. I ask only that you take me with you."},{"name":"NOURVAL","text":"(-Nourval-)...So what say you? I'm but a commoner and know little of the ways of nations, but it seems to me such secrets as the tome conceals could be harmful to diplomatic relations. Is this not so?"},{"name":"SANSON","text":"So if we wish to find the tome, we must agree to your company. Quite a demand to make of your nation."},{"name":"GUYDELOT","text":"Heh, you've got stones, that's for sure. I like it!"},{"name":"SANSON","text":"Are you serious? A civilian is essentially holding us to ransom, and you praise him for his stones?"},{"name":"GUYDELOT","text":"Look at it this way: we didn't know the tome existed, nor have we the faintest where to look for it. Better to have help than to fumble about blind, I reckon. Come on, <span class=\"highlight\">Forename</span>, back me up here."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Seems we have no choice."},{"name":"A1","text":"He sure has stones."},{"name":"SANSON","text":"I suppose you have the right of it. Whether we like it or not, we would struggle without Nourval's knowledge."},{"name":"SANSON","text":"You, too, <span class=\"highlight\">Forename</span>? Are appearances truly that important to a bard? &lt;sigh&gt; Setting aside this talk of stones for a moment, I'll not deny that we would struggle without Nourval's knowledge."},{"name":"SANSON","text":"Very well, we agree to your terms. And here is ours: you must obey our orders at all times."},{"name":"NOURVAL","text":"(-Nourval-)To the letter, sir! You shan't regret bringing me on!"},{"name":"SANSON","text":"First, we will make for Castrum Oriens, presently held by the Order of the Twin Adder. Thence we shall make our way into the unknown."},{"name":"SYSTEM","text":"In order to continue this quest, you must first undertake the main scenario quest “Beyond the Great Wall.”"},{"name":"SANSON","text":"And here we are, at the easternmost reaches of the Twelveswood. The journey has scarcely begun, but already I am keenly grateful for your company, <span class=\"highlight\">Forename</span>."},{"name":"GUYDELOT","text":"Soldiers from all nations, all in one place─a veritable gold mine of songs and stories if I've ever seen one!"},{"name":"NOURVAL","text":"(-Nourval-)The armies of the four nations, united under one banner and one purpose. A sight to stir the spirit!"},{"name":"SANSON","text":"Well? Where to now?"},{"name":"NOURVAL","text":"(-Nourval-)Pray do not be hasty, Master Sanson. Before we venture into the wilds of Gyr Abania, we would do well to acquaint ourselves with the lay of the land."},{"name":"NOURVAL","text":"(-Nourval-)As a serpent captain, it should be a simple matter for you to secure permission for us to remain here. Just long enough to get our bearings."},{"name":"SANSON","text":"Hmmm, I suppose it would only be prudent..."},{"name":"SANSON","text":"Very well, I will request permission of command."},{"name":"GUYDELOT","text":"And I'll get right to bonding with the locals! Always wanted to compare songs from the four nations...and the liquor besides, hehehe!"},{"name":"NOURVAL","text":"(-Nourval-)Master Guydelot is quite a character, isn't he?"},{"name":"SANSON","text":"Aye, that he is. Pay him no mind. Now then, I will make my own inquiries. In the meantime, you are to lay low and refrain from bothering the garrison. Understood?"},{"name":"SANSON","text":"<span class=\"highlight\">Forename</span>, Guydelot and I shall tend to business here. Pray take your ease until we are ready to depart."},{"name":"SYSTEM","text":"The next bard quest will be available from Sanson upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1407,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":24}],"questsType":"all","quests":[67254,67895]},"next":[68427]},"partials":[{"type":"npc","id":"1006750","obj":{"i":1006750,"n":"Jehantel","l":56,"q":11}},{"type":"npc","id":"1022511","obj":{"i":1022511,"n":"Nourval","l":2406,"q":2}},{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1022505","obj":{"i":1022505,"n":"Sanson","l":52,"q":1}},{"type":"npc","id":"1022507","obj":{"i":1022507,"n":"Jehantel","l":52,"q":1}},{"type":"npc","id":"1022508","obj":{"i":1022508,"n":"Simpering Youth","l":55,"q":1}},{"type":"npc","id":"1022509","obj":{"i":1022509,"n":"Sanson","l":55,"q":1}},{"type":"npc","id":"1022510","obj":{"i":1022510,"n":"Guydelot","l":55,"q":1}},{"type":"npc","id":"1022512","obj":{"i":1022512,"n":"Sanson","l":2406,"q":3}},{"type":"npc","id":"1022513","obj":{"i":1022513,"n":"Guydelot","l":2406,"q":3}},{"type":"quest","id":"67254","obj":{"i":67254,"n":"The Ballad of Oblivion","g":151,"l":"The Churning Mists","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68427","obj":{"i":68427,"n":"Masked Motives","g":151,"l":"The Fringes","s":630,"f":1}}]}