{"quest":{"name":"When Push Comes to Shove","location":"Lower La Noscea","id":68438,"patch":4.0,"sort":650,"icon":100669,"unlocksFunction":1,"eventIcon":71341,"issuer":1023885,"target":1023885,"involved":[1022816,1022817,1022818,1022821,1022822,1022825,1022826,1023887,1023888],"genre":149,"journal":["Broken Mountain has lost his usual air of composure.","The Mamool Ja's defeat at the ruins of Nym was not enough to dissuade them, as Maelstrom Command reports indicate they have now set their sights on Wineport. It goes without saying Broken Mountain means to repel the Mamool Ja once more. It should also come as no surprise that he expects you to accompany him on this mission. Not wishing to waste time, he makes haste to Raincatcher Gully, asking you to meet him there when you are geared for battle.","As Broken Mountain goes over his plan for defending Wineport, Dorgono is disappointed to hear she has been relegated to support. Though he fears the risk of her losing control, he admits that this decision leaves them wanting for muscle. How fortunate, then, that Curious Gorge should again happen upon your gathering in the middle of Raincatcher Gully. With the aid of his axe, Broken Mountain will lead his men on a westerly route past the Severed String, while you head due south dispensing with any enemies who stand in your way.","As you make your way through Raincatcher Gully, you are assaulted by two Mamool Ja warriors. The odds are sadly not in their favor as a few heavy swings of your axe make short work of them. You continue along the path south, your axe at the ready.","Another gang of Mamool Ja fighters soon come into view. Though greater in number, they are still no match for your combat prowess. Still clutching your axe, you venture deeper into the wilds.","Yet another band of Mamool Ja dare to stand in your way. Yet there is little they can do to stand against your terrible might. As you continue along the path, you see a familiar figure in the distance.","You find Broken Mountain and his men, battered and beaten. As he explains it, they were ambushed and Curious Gorge was the first to fall. Dorgono, also unable to escape, is likely fighting for her life against the Mamool Ja. He bids you find them before it is too late.","You find Curious Gorge wounded, Dorgono towering over the mangled bodies of the Mamool Ja. She turns to look at you with what seems to be murderous intent, but suddenly her eyes soften. Lowering her axe she realizes she has managed to suppress her inner beast. Curious Gorge, bearing witness to this mastery of self, sees her accomplishment as a source of ignominy. As he takes leave of the scene, too embarrassed to face the others, Broken Mountain and his men stagger over to congratulate Dorgono. They then return to the Moraby Drydocks to bid her a final farewell.","Dorgono, now able to control her inner beast, means to return home and win back the trust of her people. However, there is still the matter of Curious Gorge and his now dormant inner beast. Broken Mountain is convinced his brother now faces a crisis the likes of which he has never known: he has fallen in love. Dorgono has left him a whirlwind of emotions, but time heals all wounds. Broken Mountain suggests giving his brother space to cope with these emotions on his own.<br><br>※The next warrior quest will be available from Broken Mountain upon reaching level 68."],"objectives":["Speak with Broken Mountain at the Raincatcher Gully Docks.","Survey the area for Mamool Ja fighters.","Rendezvous with Broken Mountain.","Search for Curious Gorge.","Speak with Broken Mountain at the Moraby Drydocks."],"dialogue":[{"name":"BROKENMOUNTAIN","text":"<span class=\"highlight\">Forename</span>! I'm afraid I have naught but ill tidings to share. The Mamool Ja have returned with reinforcements!"},{"name":"BROKENMOUNTAIN","text":"According to reports from Maelstrom Command, they have their eyes fixed on Wineport. Having been driven out from the ruins of Nym, I have no doubt they mean to take the village as their new base of operations."},{"name":"BROKENMOUNTAIN","text":"We have fanned the flames of their aggression, <span class=\"highlight\">Forename</span>, and thus is it our duty to put matters to rights. "},{"name":"BROKENMOUNTAIN","text":"I fear they pose too great a threat to consider this part of Dorgono's training. Regardless of what may happen, I expect you to prioritize the Mamool Ja above all else. When you are ready, my men and I shall meet you at Raincatcher Gully."},{"name":"DORGONO","text":"Hello, <span class=\"highlight\">Forename</span>. Your axe is looking quite sharp <span class=\"alternative-container\"><span class=\"alternative\">this evening</span><span class=\"alternative\">this morning</span><span class=\"alternative\">this afternoon</span></span>."},{"name":"WARRIOR02902","text":"Oh, what a life I have lived to be blessed a second time by your presence. I speak on behalf of all when I say we shall do our utmost to live up to your deeds."},{"name":"BROKENMOUNTAIN","text":"Our scouts tell us the Mamool Ja are still to the south."},{"name":"BROKENMOUNTAIN","text":"There's no way of knowing which path they will take to reach Wineport, so we must head them off at every available avenue, lest they turn the hamlet into a battlefield."},{"name":"BROKENMOUNTAIN","text":"<span class=\"highlight\">Forename</span>, I would ask you to head due south and do away with any enemies you find along the way. The rest of us shall sweep west toward Red Mantis Falls, then south through the Severed String. Dorgono, you will stay close to me in the rear. You will aid me in support, nothing more."},{"name":"DORGONO","text":"&lt;sigh&gt; If you insist..."},{"name":"BROKENMOUNTAIN","text":"I'm sorry, Dorgono, but there is too much at stake to risk your losing control of your inner beast. Yet with you joining me in support, I fear we may lack the strength to do away with the Mamool Ja."},{"name":"CURIOUSGORGE","text":"No need to fear, Brother, for you have my axe!"},{"name":"BROKENMOUNTAIN","text":"What a welcome surprise. Are you sure you're able to fight?"},{"name":"CURIOUSGORGE","text":"After bashing boulders and toppling titans with the marauders, I've never felt better!"},{"name":"DORGONO","text":"Ugh, you again. Come to slow us down, <span class=\"emphasis\">worm</span>?"},{"name":"CURIOUSGORGE","text":"No more than the horn-mad cow unable to control her inner beast. How about when this is over I show you <span class=\"emphasis\">my</span> inner beast and─"},{"name":"BROKENMOUNTAIN","text":"Enough! Both of you! Brother, if you're sure you can handle it, I would have you take the lead."},{"name":"BROKENMOUNTAIN","text":"Right, then. Let's move quickly. <span class=\"highlight\">Forename</span>, we will meet where the paths join on the road leading to Limsa Lominsa. "},{"name":"WARRIOR02902","text":"My apologies, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>. We... We've failed you."},{"name":"BROKENMOUNTAIN","text":"<span class=\"highlight\">Forename</span>? Oh thank goodness, you are unharmed. The Mamool Ja, they...they caught us unawares as we passed through the Severed String. We had no choice but to make haste toward the rendezvous point."},{"name":"BROKENMOUNTAIN","text":"As I feared, Brother's boasting was just that. He was the first to falter, and failed to keep up as we fled. Him, along with Dorgono."},{"name":"BROKENMOUNTAIN","text":"Please, you must find them. Before they are slain by the Mamool Ja. Or worse..."},{"name":"BROKENMOUNTAIN","text":"Please, <span class=\"highlight\">Forename</span>, do not waste your concern on me─you must find Dorgono and my brother before it's too late!"},{"name":"DORGONO","text":"Grrr..."},{"name":"CURIOUSGORGE","text":"<span class=\"highlight\">Forename</span>... Be on your guard. Dorgono, she defeated the Mamool Ja, but..."},{"name":"CURIOUSGORGE","text":"Her inner beast has consumed her!"},{"name":"CURIOUSGORGE","text":"My strength has failed me, <span class=\"highlight\">Forename</span>. Please, you have to stop Dorgono."},{"name":"DORGONO","text":"I─I did it! I've suppressed the will of Karash!"},{"name":"CURIOUSGORGE","text":"Could it be? She overcame her inner beast through her resolve to protect me?"},{"name":"CURIOUSGORGE","text":"The flames of her spirit burn so brightly, and yet it feels as though mine have all but guttered out."},{"name":"CURIOUSGORGE","text":"Pray return to the others without me. I cannot face them like this."},{"name":"BROKENMOUNTAIN","text":"We have struck two birds with a single stone─the Mamool Ja have been repelled, and Dorgono has at last gained control over her inner beast."},{"name":"DORGONO","text":"The power of Karash is now mine to control. Soon, my people will welcome me back with open arms!"},{"name":"BROKENMOUNTAIN","text":"I would certainly hope so. Let us return to the Moraby Drydocks and prepare for your send-off, shall we?"},{"name":"DORGONO","text":"I lacked the courage to ask before, but now I must: <span class=\"highlight\">Forename</span>, would you...would you return with me to the Azim Steppe?"},{"name":"DORGONO","text":"There is much my people could teach you, just as you could teach us. With your help, we would never need fear the will of Karash ever again."},{"name":"DORGONO","text":"Please, <span class=\"highlight\">Forename</span>, say you will join my clan."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I cannot abandon my duties here."},{"name":"A2","text":"Then who would protect Eorzea in my absence?"},{"name":"A3","text":"I must remain here and continue my training."},{"name":"A4","text":"..."},{"name":"DORGONO","text":"Yes, of course. It would be selfish of me to ask that you abandon your obligations."},{"name":"DORGONO","text":"By the Mother, of course! How could I be so blind? I could never deprive Eorzea of its protector."},{"name":"DORGONO","text":"If you would rather train here than at the Azim Steppe, then that is your right."},{"name":"DORGONO","text":"I...I'm sorry. What was I thinking, making such a silly request?"},{"name":"DORGONO","text":"Forget that I asked. It was foolish of me to think you would give up your life here in Eorzea."},{"name":"DORGONO","text":"Come, we should return to the Moraby Drydocks. The others are waiting."},{"name":"DORGONO","text":"Let us keep our earlier conversation between us, yes?"},{"name":"WARRIOR02902","text":"I shall miss Dorgono. She was a fair rose amidst a heap of─ Ahem. Forget I said anything."},{"name":"BROKENMOUNTAIN","text":"It pains me to let such a fine warrior leave. Still, I cannot begrudge you for wishing to return home."},{"name":"DORGONO","text":"A part of me wishes to stay and repay your kindness. Before coming here, I was certain redemption was beyond my reach."},{"name":"DORGONO","text":"Now, thanks to you and your warriors, I have learned to harness the power of Karash. At last I can return home and show my people this strength is a gift, not a curse."},{"name":"DORGONO","text":"Thank you everyone, for everything. Farewell."},{"name":"BROKENMOUNTAIN","text":"Once again we are indebted to you, <span class=\"highlight\">Forename</span>. Not only have we eliminated the Mamool Ja threat, we've helped Dorgono on her way to reuniting with her people."},{"name":"BROKENMOUNTAIN","text":"Yet there still remains the matter of my brother. He would not dare admit it, but I knew from the moment he laid eyes on her that he was in love. And therein lies the problem."},{"name":"BROKENMOUNTAIN","text":"The only love he has ever known is that for his axe and the thrill of battle. In light of her less-than-favorable treatment of him since his defeat here at the Wolves' Den, I fear his love and loathing for her are at odds with one another."},{"name":"BROKENMOUNTAIN","text":"Unable to get a grasp on his emotions, he's lost touch with his inner beast."},{"name":"BROKENMOUNTAIN","text":"He will be distraught in her absence, to be sure, but as they say, time heals all wounds."},{"name":"BROKENMOUNTAIN","text":"All we can do now is wait and hope he recovers. If anything should happen, you will be the first to know."}],"reward":{"gil":1487,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":22}],"quests":[68437]},"next":[68439]},"partials":[{"type":"npc","id":"1023885","obj":{"i":1023885,"n":"Broken Mountain","l":31,"q":5}},{"type":"npc","id":"1022816","obj":{"i":1022816,"n":"Broken Mountain","l":32,"q":1}},{"type":"npc","id":"1022817","obj":{"i":1022817,"n":"Dorgono","l":32,"q":1}},{"type":"npc","id":"1022818","obj":{"i":1022818,"n":"Strong-willed Warrior","l":32,"q":1}},{"type":"npc","id":"1022821","obj":{"i":1022821,"n":"Broken Mountain","l":32,"q":1}},{"type":"npc","id":"1022822","obj":{"i":1022822,"n":"Strong-willed Warrior","l":32,"q":1}},{"type":"npc","id":"1022825","obj":{"i":1022825,"n":"Curious Gorge","l":32,"q":1}},{"type":"npc","id":"1022826","obj":{"i":1022826,"n":"Dorgono","l":32,"q":1}},{"type":"npc","id":"1023887","obj":{"i":1023887,"n":"Dorgono","l":31,"q":1}},{"type":"npc","id":"1023888","obj":{"i":1023888,"n":"Strong-willed Warrior","l":31,"q":1}},{"type":"quest","id":"68437","obj":{"i":68437,"n":"Field Training","g":149,"l":"Lower La Noscea","s":630,"f":1}},{"type":"quest","id":"68439","obj":{"i":68439,"n":"Going the Distance","g":149,"l":"Lower La Noscea","s":680,"f":1}}]}