{"quest":{"name":"Going the Distance","location":"Lower La Noscea","id":68439,"patch":4.0,"sort":680,"icon":100669,"unlocksFunction":1,"eventIcon":71341,"issuer":1023885,"target":1022836,"involved":[1019347,1019354,1019355,1022832,1022834,1022835],"genre":149,"journal":["Broken Mountain is beside himself with worry.","Curious Gorge has disappeared, but not without a trace. According to Wyrnzoen, a man matching his description recently boarded a ship bound eastward. Broken Mountain is certain his brother has run off in search of Dorgono at the Azim Steppe. Unable to leave his post in Limsa Lominsa, he asks you to search for Curious Gorge and see that he does not come to harm.","You travel east to the Azim Steppe, and question the people of a small settlement known as Reunion. While many could not distinguish Curious Gorge from the many travelers passing through, one merchant recalls a large, axe-wielding Roegadyn heading west in search of a Qerel settlement.","Curious Gorge was moments away from evisceration when you stepped in to rescue him from a ravenous weasel. He seems no worse for wear as you help him to his feet.","You are relieved to see Curious Gorge is without injury, but there is no time for small talk. Dorgono's people are under attack, and so Curious Gorge rushes off to the west. ","You arrive to find Dorgono looking over the ruin of her people's settlement. As she tells it, they are safe and sound at Reunion. Sadly, there would be no homecoming for Dorgono. The ones responsible for besieging their homes were the very same people they exiled from the Qerel clan. They have created an order of their own, the Chaghan, and believe the blind fury of their inner beasts is a gift from their goddess, the Dusk Mother. The Qerel believe Dorgono to be one of the Chaghan now, and refuse to allow her back. She is now determined to avenge her people and earn back their trust. Your help, and even Curious Gorge's, will be indispensable in this endeavor. As she leaves to go track their whereabouts, she suggests you return to Reunion to rest up and prepare for battle.","You speak with Curious Gorge at Reunion, and it seems he has yet to realize the source of his problems. With battle looming on the horizon, one can only hope he comes to terms with his emotions before the fighting begins.<br><br>※The next warrior quest will be available from Curious Gorge upon reaching level 70."],"objectives":["Gather information at Reunion.","Search for Curious Gorge.","Rescue Curious Gorge.","Speak with Dorgono.","Speak with Curious Gorge."],"dialogue":[{"name":"BROKENMOUNTAIN","text":"He's gone! My brother is gone!"},{"name":"BROKENMOUNTAIN","text":"I spoke with Wyrnzoen, and his men claim to have seen a man fitting Brother's description boarding a ship heading to the Far East."},{"name":"BROKENMOUNTAIN","text":"The lovestruck fool. No doubt he's run off to find Dorgono."},{"name":"BROKENMOUNTAIN","text":"In his weakened state, there's no telling what misfortune may find him there. Would that I could go and search of him, but I cannot leave my post here in Limsa."},{"name":"BROKENMOUNTAIN","text":"It shames me to ask more of you, but do you think it possible you could find him?"},{"name":"BROKENMOUNTAIN","text":"Bless you, <span class=\"highlight\">Forename</span>. If he is searching for Dorgono, then he is making for the Azim Steppe."},{"name":"BROKENMOUNTAIN","text":"If the plains are as vast as she claimed, you would do well to find the closest settlement and begin your search there. If the gods are kind, someone will have seen him."},{"name":"BROKENMOUNTAIN","text":"Safe travels, <span class=\"highlight\">Forename</span>. I pray he causes no more trouble than he already has."},{"name":"BROKENMOUNTAIN","text":"If Dorgono told it true, the plains of Azim Steppe are vast and fraught with peril. When you arrive, make haste to the nearest settlement and see what you can learn of my brother's whereabouts."},{"name":"TAMACHAG","text":"A large man with an axe? You've any idea how many brutes with axes come stomping through these parts?"},{"name":"MASGUD","text":"A burly, red-faced Roegadyn? Yes, I remember. He was asking after the Qerel clan, but they haven't lived here in ages."},{"name":"CHAMBUI","text":"Ah, that unruly fellow in search of the Qerel clan? If he took my advice, he's headed due west to search for their settlement. Or what's left of it."},{"name":"TAMACHAG","text":"A large man with an axe on his back? You'll have to be more specific. There's no shortage of axe-wielding types here."},{"name":"MASGUD","text":"If you're looking for the Qerel, you'll not find them here. I told that boisterous Roegadyn the same."},{"name":"CHAMBUI","text":"I can't say what you'll find to the west, but it's likely not the Qerel."},{"name":"POPMESSAGE","text":"You are under attack!"},{"name":"CURIOUSGORGE","text":"Thank you, kind stranger. Had you not arrived, I would have─<span class=\"highlight\">Forename</span>!? Wh-What are you doing here?"},{"name":"CURIOUSGORGE","text":"Ack, that can wait. Dorgono's people are under attack. Come, we have to help them!"},{"name":"CURIOUSGORGE","text":"Dorgono is safe, but where are the others?"},{"name":"DORGONO","text":"<span class=\"highlight\">Forename</span>, you've come! Hope is not yet lost... Though I fail to see why you chose to bring the worm."},{"name":"CURIOUSGORGE","text":"Worm!? Why, I... You... Ugh, could you just tell us what happened here?"},{"name":"DORGONO","text":"The Qerel settlement was attacked, but I was too late. This is all there was to be seen when I arrived. You needn't worry, though. They escaped."},{"name":"DORGONO","text":"I managed to track them back to Reunion. Upon finding them, however, I was greeted with looks of fear and disgust. They would only suffer me long enough to explain the will of Karash is to blame for their woes."},{"name":"DORGONO","text":"The exiles of Qerel have created a clan of their own─the Chaghan. They offered me shelter when I was first cast out."},{"name":"DORGONO","text":"Where the Qerel see the will of Karash as a source of rack and ruin, the Chaghan praise it as a blessing from the Dusk Mother."},{"name":"DORGONO","text":"They commit all manner of heinous acts when Karash takes hold. Some would even slay their own kin and claim it in the name of the Mother. I could not abide their savagery and soon left. Still, my people mistake me for one of the Chaghan now."},{"name":"DORGONO","text":"After all that work, all that training, they would deny me. But I cannot give up! I will avenge my people and earn their trust!"},{"name":"CURIOUSGORGE","text":"Your opponents are warriors who freely indulge in their inner beasts. You do not stand a chance alone. I will help you!"},{"name":"DORGONO","text":"I have no need of your aid, worm. You would only get in my way with your wriggling and writhing."},{"name":"DORGONO","text":"<span class=\"highlight\">Forename</span>'s proven axe, on the other hand, would be welcome. What say you?"},{"name":"Q1","text":"Will you lend Dorgono your strength?"},{"name":"DORGONO","text":"Thank you. Your presence alone is worth a hundred warriors! "},{"name":"DORGONO","text":"I...I see. Then I have no choice but to face them alone..."},{"name":"CURIOUSGORGE","text":"What are you saying? The <span class=\"highlight\">Forename</span> I know would never let a comrade rush headlong into danger alone. You must help Dorgono!"},{"name":"DORGONO","text":"Thank you. Your presence alone is worth a hundred warriors! "},{"name":"CURIOUSGORGE","text":"Aye, and with me at your side, that's another hundred at your disposal. Dealing with the Chaghan should be as child's play."},{"name":"DORGONO","text":"Do as you like. I only ask you don't slow us down."},{"name":"DORGONO","text":"For now, return to Reunion and rest. The Chaghan have grown careless and should prove easy for me to track. When the time comes, I expect you to be ready, Curious Gorge. "},{"name":"CURIOUSGORGE","text":"Huh? I mean, r-right. You can count on me!"},{"name":"DORGONO","text":"I should not be long, <span class=\"highlight\">Forename</span>. Soon we will put an end to their madness."},{"name":"CURIOUSGORGE","text":"That woman is insufferable! She's arrogant, rude, pigheaded... &lt;sigh&gt; And she finally called me by name..."},{"name":"CURIOUSGORGE","text":"Ahem. She is also right. Battle against the Chaghan would be folly in my present condition. Let us return to Reunion."},{"name":"CURIOUSGORGE","text":"<span class=\"highlight\">Forename</span>. Let me speak plain: why exactly are you here?"},{"name":"CURIOUSGORGE","text":"Brother worries about me, does he? It seems I've made good company of trouble in recent days."},{"name":"CURIOUSGORGE","text":"Ever since I was bested by Dorgono at the pier, everything has gone wrong. My inner beast remains dormant, and my ability to fight along with it."},{"name":"CURIOUSGORGE","text":"There are moments when my blood quickens, and I dare to hope that the inner beast would awaken...only to find myself racked by visions of Dorgono and my strength abandoning me."},{"name":"CURIOUSGORGE","text":"I know not what is going on inside me, know not how to conquer it. I knew only that I had to follow Dorgono. What in heavens' name is wrong with me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I think you're in love with Dorgono."},{"name":"A2","text":"You need to train harder and regain your focus."},{"name":"A3","text":"..."},{"name":"CURIOUSGORGE","text":"L-Love!? I was hoping you would offer me counsel, not cruel jests."},{"name":"CURIOUSGORGE","text":"Could it be as simple as that? I confess I have felt rather unfocused of late, but I'm not so certain it is a mere matter of training."},{"name":"CURIOUSGORGE","text":"&lt;sigh&gt; What am I doing, bothering you with this? I'm sure you have a veritable mountain of troubles of your own to contend with."},{"name":"CURIOUSGORGE","text":"In any case, this problem is my burden. It will not be solved by thrusting it upon others."},{"name":"CURIOUSGORGE","text":"And if I am to be ready for our battle, it must be solved quickly."},{"name":"CURIOUSGORGE","text":"I won't keep you any longer, <span class=\"highlight\">Forename</span>. Do what you must to prepare, and I shall do the same."}],"reward":{"gil":1844,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":22}],"quests":[68438]},"next":[68440]},"partials":[{"type":"npc","id":"1023885","obj":{"i":1023885,"n":"Broken Mountain","l":31,"q":5}},{"type":"npc","id":"1022836","obj":{"i":1022836,"n":"Curious Gorge","l":2411,"q":2}},{"type":"npc","id":"1019347","obj":{"i":1019347,"n":"Tamachag","l":2411,"q":4}},{"type":"npc","id":"1019354","obj":{"i":1019354,"n":"Masgud","l":2411,"q":3}},{"type":"npc","id":"1019355","obj":{"i":1019355,"n":"Chambui","l":2411,"q":5}},{"type":"npc","id":"1022832","obj":{"i":1022832,"n":"Curious Gorge","l":2411,"q":1}},{"type":"npc","id":"1022834","obj":{"i":1022834,"n":"Dorgono","l":2411,"q":1}},{"type":"npc","id":"1022835","obj":{"i":1022835,"n":"Curious Gorge","l":2411,"q":1}},{"type":"quest","id":"68438","obj":{"i":68438,"n":"When Push Comes to Shove","g":149,"l":"Lower La Noscea","s":650,"f":1}},{"type":"quest","id":"68440","obj":{"i":68440,"n":"The Heart of the Problem","g":149,"l":"The Azim Steppe","s":700,"f":1}}]}