{"quest":{"name":"Field Training","location":"Lower La Noscea","id":68437,"patch":4.0,"sort":630,"icon":100669,"unlocksFunction":1,"eventIcon":71341,"issuer":1023885,"target":1023885,"involved":[1022806,1022807,1022808,1022811,1022812,1022813,1022842],"genre":149,"journal":["There seems to be something weighing on Broken Mountain's mind.","Broken Mountain has decided on how he might begin training Dorgono. As he prepares to help her gain mastery of her inner beast, however, he cannot help but worry for Curious Gorge, who claims his inner beast has fallen silent. Sadly there is no time to lament further, for the Maelstrom has requested the aid of Broken Mountain's troop of warriors to rout a band of outlaw Mamool Ja. He sees this as an opportunity for Dorgono, as he believes building a resolve to defend her allies will allow her to gain control of her inner beast. He readies his men, and makes for the ruins of Nym in outer La Noscea.","With everyone assembled, Broken Mountain explains to you his plan. With Dorgono in tow, he means to take his band of warriors along the Long Climb and sweep through the Mamool Ja's main force. Meanwhile, you are to sneak through the heart of the ruins and pick off the sentries. With everyone assigned their orders, you split up, seeking to rendezvous on the path leading toward the Hermit's Hovel.","As you navigate the heart of the Nym ruins, you spy two Mamool Ja brawlers and trounce them swiftly and quietly. Perhaps there are other sentries still in the area.","You come upon another pair of Mamool Ja fighters and take them unawares. As the coast seems to be clear, you continue along the path through the ruins in search of the others.","Broken Mountain and his men are no worse for wear, and Dorgono showed no signs of succumbing to her inner beast in battle. Yet her calm and cool composure was not cause for celebration. Curious Gorge─taking an innocent stroll through the ruins of Nym─happened to see her fighting, and noticed that Dorgono was holding back. Though she only meant to spare her comrades the risk of her inner beast, this means she has yet to harness the power raging within her. Nevertheless, the Mamool Ja have been routed, and Maelstrom shipments may now pass through safely. All that remains is to return to the Moraby Drydocks and rest.","Everyone is safely returned to the Moraby Drydocks─everyone except Curious Gorge. Strange that he would stumble upon your mission in the ruins of Nym. Broken Mountain believes it is related to the source of Curious Gorge's personal dilemma, but assures you it is nothing to worry about. For now he bids you rest, and prepare for the next step in Dorgono's training.<br><br>※The next warrior quest will be available from Broken Mountain upon reaching level 65."],"objectives":["Speak with Broken Mountain at the Floating City of Nym.","Survey the area for Mamool Ja fighters.","Rendezvous with Broken Mountain.","Speak with Broken Mountain at the Moraby Drydocks."],"dialogue":[{"name":"BROKENMOUNTAIN","text":"Fortuitous timing, <span class=\"highlight\">Forename</span>. I've decided on how we might set about training Dorgono. Unfortunately, as you are already aware, my brother will not be present. It seems his situation is more grave than I initially thought."},{"name":"BROKENMOUNTAIN","text":"Ever since his clash with Dorgono, he's been unable to draw upon the strength of his inner beast. He insists revisiting the basics of axework at the Marauders' Guild will restore his abilities, but I suspect his troubles lie elsewhere. The same can be said for Dorgono."},{"name":"BROKENMOUNTAIN","text":"Though my brother and I did not complete formal training in the ways of the warrior, you may recall we at last discovered a way for him to control the savagery of his inner beast: a dire encounter that hardened his resolve to protect his allies, thus allowing him to temper his rage."},{"name":"BROKENMOUNTAIN","text":"She believes her problem will be solved through physical training, but if we are to succeed in this, we must recreate a similar experience for Dorgono. It may prove perilous, but I can see no other way."},{"name":"BROKENMOUNTAIN","text":"And we will not have to wait long for the opportunity. As chance would have it, we received a request for aid in routing a group of Mamool Ja now occupying the ruins of the city of Nym."},{"name":"BROKENMOUNTAIN","text":"They originally came here for want of work. Unable to find it, however, they took to pillaging and plundering, and not even Maelstrom convoys are spared their attention."},{"name":"BROKENMOUNTAIN","text":"To make matters worse, the area also serves as the front line of ongoing battles with the kobolds. Either of these tribes alone is already a handful for our forces, and we cannot well cope with both."},{"name":"BROKENMOUNTAIN","text":"That is why our squadron of newly trained warriors has been called to undertake this incursion. Dorgono will be accompanying us, and your presence will be imperative in the event she loses control. When you are ready, make for the ruins in outer La Noscea."},{"name":"DORGONO","text":"These Mamool Ja sound like a savage tribe. I wonder if they would prove a match for the Dotharl..."},{"name":"WARRIOR02901","text":"By the Navigator, <span class=\"highlight\">Forename Surname</span>! Tales of your heroism have been an inspiration to us all. It is truly an honor to fight at your side."},{"name":"CURIOUSGORGE","text":"Ahhh! Matron's teats, don't scare me like that...<br>Why am I here? I was merely going for a walk. What would I possibly have to gain from spying on you and Dorgono...?"},{"name":"BROKENMOUNTAIN","text":"Good, everyone is here. As far as I can discern, the Mamool Ja have divided into two groups: a primary force targeting the next Maelstrom shipment, and what appear to be groups of sentries posted to warn them of any unwelcome interference."},{"name":"BROKENMOUNTAIN","text":"Being the most skilled among us, I would have you sneak into the heart of the ruins and do away with those keeping watch."},{"name":"BROKENMOUNTAIN","text":"Meanwhile, I shall lead the others along a northerly route toward the Long Climb and engage their primary force. If all goes as planned, we should be able to meet where the two paths join."},{"name":"BROKENMOUNTAIN","text":"If Dorgono should be overcome by her inner beast and shows no signs of regaining control, we will retreat immediately and seek you out."},{"name":"DORGONO","text":"If we should come to blows, I beg of you: do what you must to stop me."},{"name":"BROKENMOUNTAIN","text":"That is all. If there are no questions, let the operation begin!"},{"name":"DORGONO","text":"Yay! Woo yay!"},{"name":"WARRIOR02901","text":"<span class=\"alternative-container\"><span class=\"alternative\">Miss <span class=\"highlight\">Surname</span></span><span class=\"alternative\">Mister <span class=\"highlight\">Surname</span></span></span>, you are unharmed! Of course, I should expect no less from a warrior of such acclaim."},{"name":"BROKENMOUNTAIN","text":"Ah, <span class=\"highlight\">Forename</span>. By the lack of sweat on your brow I assume you made quick work of the sentries. We, for our part, managed to claim a narrow victory over the main Mamool Ja force."},{"name":"BROKENMOUNTAIN","text":"And despite the chaos and havoc of battle, Dorgono remained unaffected by her inner beast."},{"name":"DORGONO","text":"I am slave to Karash no longer! I am master of the inner beast!"},{"name":"CURIOUSGORGE","text":"(-???-)Master? Far from it."},{"name":"BROKENMOUNTAIN","text":"Brother! What are you doing here? Have you been following us this whole time?"},{"name":"CURIOUSGORGE","text":"Following!? Nonsense! I was merely...taking a walk! Yes, I was taking a leisurely walk through ruins of Nym when I happened upon your small altercation with the Mamool Ja."},{"name":"CURIOUSGORGE","text":"I couldn't help but notice your form, Dorgono. Your battle form, that is. Anyone with eyes could see you were hesitating with every swing of your axe."},{"name":"CURIOUSGORGE","text":"You'll never learn to control your inner beast if you're too afraid to push yourself and draw it out. Believe me, I know."},{"name":"DORGONO","text":"Afraid, am I? Hmph, that's rich coming from the pathetic worm I sent flying into the waters of the Wolves' Den Pier!"},{"name":"CURIOUSGORGE","text":"Worm!? You ungrateful little... Call me that again and I'll─"},{"name":"DORGONO","text":"I'll call you whatever I please, <span class=\"emphasis\">worm</span>. If you have any complaints, take them up with my axe."},{"name":"CURIOUSGORGE","text":"You... You're lucky I'm feeling under the weather today. When next we meet, I'll have to beat some manners into that pretty little head of yours."},{"name":"BROKENMOUNTAIN","text":"Though you may not like his judgment, I have to agree with my brother. I too noticed you seemed to be holding back."},{"name":"BROKENMOUNTAIN","text":"Though the battle was hard-won, you showed little need to overexert yourself, let alone call upon your inner beast."},{"name":"DORGONO","text":"I never meant to hold back, it's just, well... I thought it better not to worry the others."},{"name":"BROKENMOUNTAIN","text":"You needn't be hard on yourself. You did not learn to control your inner beast, no, but we have defeated the Mamool Ja, and shipments to Limsa are now safe. We should all be proud of what we've accomplished today. Now, let us return to the Moraby Drydocks for a well-earned respite."},{"name":"DORGONO","text":"Your thrashing of the Mamool Ja must have been a glorious sight. Never have I met a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> so fearless, so strong. Strong enough, even, to overcome me when my inner beast is unleashed."},{"name":"DORGONO","text":"If only I could take you to the Azim Steppe, I'd... I have to go."},{"name":"BROKENMOUNTAIN","text":"It seems we will need more than a small scuffle with beastmen for Dorgono to gain control over her inner beast."},{"name":"BROKENMOUNTAIN","text":"Would that Curious Gorge were here to assist us. Did you also find it strange he would take time away from training to speak with us? Or rather, with Dorgono...  "},{"name":"BROKENMOUNTAIN","text":"If my suspicions are true, he faces an obstacle unlike any he has faced before. Though I'm sure it's nothing you need concern yourself with."},{"name":"BROKENMOUNTAIN","text":"You have done well this day. Rest now, and gather your strength. We will surely need it for the trials to come."}],"reward":{"gil":1294,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":22}],"quests":[68436]},"next":[68438]},"partials":[{"type":"npc","id":"1023885","obj":{"i":1023885,"n":"Broken Mountain","l":31,"q":5}},{"type":"npc","id":"1022806","obj":{"i":1022806,"n":"Broken Mountain","l":350,"q":1}},{"type":"npc","id":"1022807","obj":{"i":1022807,"n":"Dorgono","l":350,"q":1}},{"type":"npc","id":"1022808","obj":{"i":1022808,"n":"Strong-willed Warrior","l":350,"q":1}},{"type":"npc","id":"1022811","obj":{"i":1022811,"n":"Broken Mountain","l":350,"q":1}},{"type":"npc","id":"1022812","obj":{"i":1022812,"n":"Dorgono","l":350,"q":1}},{"type":"npc","id":"1022813","obj":{"i":1022813,"n":"Strong-willed Warrior","l":350,"q":1}},{"type":"npc","id":"1022842","obj":{"i":1022842,"n":"Curious Gorge","l":350,"q":1}},{"type":"quest","id":"68436","obj":{"i":68436,"n":"Curious Gorge Meets His Match","g":149,"l":"Eastern La Noscea","s":601,"f":1}},{"type":"quest","id":"68438","obj":{"i":68438,"n":"When Push Comes to Shove","g":149,"l":"Lower La Noscea","s":650,"f":1}}]}