{"quest":{"name":"Sweet Dreams Are Made of Peace","location":"Gridania","id":68430,"patch":4.0,"sort":700,"icon":100674,"unlocksFunction":1,"eventIcon":71341,"issuer":1022528,"target":1006750,"involved":[1000168,1000200,1000254,1022529,1022530],"genre":151,"journal":["Guydelot is keenly waiting to see how the Order of the Twin Adder will move.","The Order of the Twin Adder has made its will known: they refuse to negotiate with Nourval, effectively abandoning Sanson to his fate. As Guydelot lets vent his fury at the heartless decision, Commander Heuloix emerges as an ally, revealing that he has already recruited the aid of Gridania's martial guilds for Sanson's rescue. Speak with Luciane and Ywain at the Archers' and Lancers' Guilds respectively, and inform them that the mission will soon commence.","Both the archers and the lancers are ready to strike out. Take word back to Commander Heuloix at the Adders' Nest.","In urgent tones, Commander Heuloix informs you that the Order of the Twin Adder has ascertained Nourval's hideout, and will soon deploy troops for an assault. Unless you get there first, Sanson is as good as dead. Make haste to the North Shroud, and join Guydelot at Alder Springs.","With help from your allies, you succeed in subduing Nourval and liberating Sanson. Rejoin your comrades in the North Shroud.","At first, Nourval clings to his hatred for Ala Mhigo, but confronted with the truth of his ancestors' hearts, he is forced to concede the error of his ways. Reaching out to his erstwhile captor, Sanson swears to see to it that Vainchelon's sacrifice is not forgotten. With the situation now under control, turn your attention to Sanson and ensure that he is well.","Thanking you for his preservation, Sanson declares his intent to make good on his promise to Nourval. Return with your comrades to Gridania, and seek out Commander Heuloix at the Adders' Nest.","Commander Heuloix listens intently as Sanson states his terms for surrendering Gylbarde's journal: when the time is right, the Order of the Twin Adder must release the truth of Vainchelon's death to the public. The commander promises to do all within his power to make it so, and encourages Sanson to rise through the ranks that he, too, might join his voice to the cause. While Guydelot keeps watch over his recovering chief, seek out Jehantel at his campsite west of Quarrymill, and report the conclusion of events.","Jehantel expresses his hopes that Nourval will find a new path─one that leads to peace in the world and in his heart. With you and yours leading the way, the ideals of peace and harmony may yet be restored to Vainchelon's line, made bolder still by a true remembrance of the past.<br><br>※The next bard quest will be available from Jehantel once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “Courage Born of Fear.”"],"objectives":["Speak with Luciane at the Archers' Guild. ","Speak with Ywain at the Lancers' Guild.","Speak with Vorsaile Heuloix.","Rendezvous with Guydelot at Alder Springs. ","Rendezvous with Guydelot at Alder Springs.","Speak with Sanson.","Speak with Vorsaile Heuloix at the Adders' Nest.","Speak with Jehantel to the west of Quarrymill.","Defeat Nourval!"],"dialogue":[{"name":"GUYDELOT","text":"Good timing, <span class=\"highlight\">Forename</span>. Nourval's demands've just arrived at the Adders' Nest."},{"name":"GUYDELOT","text":"In exchange for Sanson's freedom, we're to release the contents of Gylbarde's journal to the public. Bastard won't be satisfied until all Gridanians hate all Ala Mhigans' guts."},{"name":"GUYDELOT","text":"The brass hats're deliberating a course of action as we speak. Not much we can do now but wait."},{"name":"VORSAILE","text":"Command has made its decision."},{"name":"VORSAILE","text":"You will not wish to hear this...but the order rejects Nourval's demands. He and his band are to be summarily eliminated."},{"name":"GUYDELOT","text":"What!? H-Hold on just a second! You won't even <span class=\"emphasis\">try</span> to negotiate Sanson's release!?"},{"name":"VORSAILE","text":"As a nation, we cannot bow to acts of intimidation; I'm afraid negotiation was never an option. And here I must repeat the order for you to relinquish the journal at once."},{"name":"GUYDELOT","text":"So what you're saying is, you're abandoning Sanson! You're gonna let him die!"},{"name":"GUYDELOT","text":"Here's the great Vainchelon, hero to all Gridanians, but you won't even lend an ear to his descendant! Oh no, instead you choose the easy way out! Just kill everyone, even your own man! Wash away the bloody past with more blood!"},{"name":"GUYDELOT","text":"Just to be clear, I ain't siding with Nourval─there's no excusing his method! But there's no excusing yours either! It's bullshite, that's what it is!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Aye, it's bullshite."},{"name":"A1","text":"I've lost faith in the order."},{"name":"VORSAILE","text":"Now, now, pray do not so be so quick to despair, for I was simply relaying the outcome of command's deliberation. A deliberation in which the Elder Seedseer had no part."},{"name":"VORSAILE","text":"As you say, Guydelot, the orders are “bullshite”─not the words I would have chosen, but you speak the truth nonetheless. And I, for one, have no intention of abiding by them."},{"name":"VORSAILE","text":"The decision was largely influenced by a small handful of our leadership, and not the boldest handful, if I may add. 'Tis plain from the fact that they did not think to bring the matter before the Elder Seedseer."},{"name":"VORSAILE","text":"Captain Smyth is a dear comrade; like you, I would spare no aid in any effort to rescue him. And I am pleased to say that we are not alone in this sentiment. As a matter of fact, I have already reached out to my lancer and archer acquaintances, and they stand ready to aid our cause."},{"name":"GUYDELOT","text":"Oho, now we're talking! There's still hope for the order if it has good blokes like you, Vorsie!"},{"name":"VORSAILE","text":"...I would thank you not to call me that. Now, the order will move as soon as they ascertain the enemy's location, so time is of the essence. Guydelot, pray take word of these developments to Jehantel."},{"name":"VORSAILE","text":"Meanwhile, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>, I need you to bear word to the two guildmasters, Luciane and Ywain."},{"name":"VORSAILE","text":"Tell them that the time is nigh, and pray return here swiftly."},{"name":"VORSAILE","text":"Make haste and bear word to the two guildmasters, Luciane and Ywain. I shall pretend to go along with official orders, all the while gathering what intelligence I can."},{"name":"LUCIANE","text":"The time is nigh, then? Very well, we shall make ready to depart at once."},{"name":"LUCIANE","text":"When the call came, full many here offered their bows. There is not a soul here who knows not of you and Jehantel and Guydelot. Together, let us rescue Sanson."},{"name":"YWAIN","text":"Aye, Vorsaile has briefed me on the situation. Sanson once trained in these very halls, and I should like to hear his excuse for being captured so easily."},{"name":"YWAIN","text":"At any rate, you may count on our lances. That Sanson was one of our own is reason enough; this request comes from my longtime friend Vorsaile himself."},{"name":"YWAIN","text":"At any rate, you may count on our lances. That Sanson was one of our own is reason enough; this request comes from both you and my longtime friend Vorsaile himself."},{"name":"LUCIANE","text":"Commander Vorsaile will send further instructions, aye? I shall see to it that we archers are ready to depart at a moment's notice."},{"name":"YWAIN","text":"You may inform Vorsaile that the lancers stand ready. I've already handpicked those of our ranks who can keep their heads above unsettling truths."},{"name":"VORSAILE","text":"There you are, and not a moment too soon. Things have begun to move. Our scouts report that Nourval and his band have since returned to the Twelveswood."},{"name":"VORSAILE","text":"They have made their lair in the North Shroud, near the shards of Dalamud. Even as we speak, the order mobilizes a unit for an assault. We must be there ahead of them."},{"name":"VORSAILE","text":"Set out at once, and make first for Alder Springs; I shall instruct the others to join you there."},{"name":"VORSAILE","text":"I will remain here to stall our forces as long as I can. Godsspeed!"},{"name":"LUCIANE","text":"We have received word. We shall strike out forthwith for Alder Springs."},{"name":"YWAIN","text":"Focus on extricating Sanson. My lancers and I shall keep your way clear."},{"name":"VORSAILE","text":"Set out at once for Alder Springs; I shall instruct the others to join you there."},{"name":"GUYDELOT","text":"Whew, we're ahead of the Twin Adder crew. Let's keep it that way and get right to work."},{"name":"GUYDELOT","text":"Our guild friends will take down the sentries and secure the area. We're free to get close to Nourval and give him the thrashing he deserves."},{"name":"NOURVAL","text":"Well, well, I was not expecting you two. Here to deliver the Gridanians' answer, are we?"},{"name":"GUYDELOT","text":"You wish, you craven whoreson! Whatever your demands are, it ain't got nothing to do with us!"},{"name":"NOURVAL","text":"So you are acting alone. I thought you had some wits. Or do you care that little for your friend?"},{"name":"GUYDELOT","text":"Kill Sanson before you get your answer, and all deals are off─everything you've worked for up in smoke. Or do you care that little for your goal?"},{"name":"NOURVAL","text":"Hmph, mayhap you have some wits after all. But clever though your ploy may be, have you the strength to back it up?"},{"name":"GUYDELOT","text":"Oh, don't you worry on that score. We're gonna knock you around so hard, all the scales will fall from your eyes."},{"name":"GUYDELOT","text":"And if that ain't enough to make you see clearly, I'll even slap in a song─something lively to wake you up from your misguided beliefs!"},{"name":"NOURVAL","text":"Why!? Why do you not understand!? Why do you not see the Ala Mhigans for the filth they are!?"},{"name":"GUYDELOT","text":"Let each spear be thrust for everlasting peace.♪<br>Let each arrow be loosed for the forest and the trees.♪<br>And the greatest rule of all, for all men to embrace:♪<br>Let each life be lived for smiles on every face.♪"},{"name":"NOURVAL","text":"Th-That song... How do you know it!?"},{"name":"GUYDELOT","text":"I learned it just recently, with a spot of help from Jehantel here. He showed me Vainchelon's grave, which I understand your family's been tending for generations."},{"name":"GUYDELOT","text":"The song was engraved on the headstone. It's a fine piece, and it ain't hard to see why your ancestor loved it."},{"name":"GUYDELOT","text":"Taking up arms that we might have peace, so the words go. Words that came from Vainchelon himself, as a matter of fact."},{"name":"GUYDELOT","text":"The Autumn War gave birth to a good many anthems, and a good many of 'em borrowed his words. Take a look, and you'll notice a recurring theme: peace and harmony."},{"name":"NOURVAL","text":"How dare you preach to me of my ancestor!? For generations, my family has sought justice for Lord Vainchelon! You couldn't possibly comprehend our pain!"},{"name":"JEHANTEL","text":"Not us, perhaps, but I daresay your great-grandsire, Lord Landrenel, could comprehend it better than any man. He witnessed his own sire murdered before his eyes. He knew the painful truth, yet he chose to keep it a secret. Why was this, do you suppose?"},{"name":"JEHANTEL","text":"It was because he knew that, above all else, his sire desired peace."},{"name":"JEHANTEL","text":"Had it been made known that their hero was struck down by treachery, ordinary Gridanians would not have been satisfied with protecting their homes. Nay, they would have demanded justice. They would have demanded blood."},{"name":"JEHANTEL","text":"The war would have raged on, leaving yet more death and destruction in its wake. And the peace that Lord Vainchelon dreamed of would have gone up in smoke. Knowing this, Lord Landrenel..."},{"name":"NOURVAL","text":"Spare me your lies! Lord Vainchelon desired Ala Mhigo's destruction! You cannot tell me otherwise!"},{"name":"JEHANTEL","text":"Tell me, young man, did it not strike you as odd that I knew of Lord Vainchelon's grave? That which your family has kept secret all these years? The explanation is simple: I had the honor of knowing Lord Landrenel."},{"name":"JEHANTEL","text":"Like you, he admired Lord Vainchelon and everything he stood for. And what he stood for, first of all, was peace and harmony. If you would honor both their memories, you would do well to honor these ideals."},{"name":"NOURVAL","text":"No... Th-This cannot be..."},{"name":"NOURVAL","text":"My ancestors despised Ala Mhigans. Y-Yes, they <span class=\"emphasis\">all</span> did. If not, everything I've labored for...all the blood and tears...have been for naught..."},{"name":"SANSON","text":"I ask not that you forgive. But know that neither will we forget."},{"name":"SANSON","text":"When the time is right, I will see to it that all know of Lord Vainchelon's great sacrifice. This I swear in Nophica's name."},{"name":"SANSON","text":"I ask only that you believe, as your ancestors fervently did, in a brighter future─one of our own shaping, undarkened by shadows of the past."},{"name":"LUCIANE","text":"No thanks are necessary. That your friend is safe and well is reward enough."},{"name":"YWAIN","text":"Nourval plainly inherited his ancestor's skill-at-arms. I pray that he will be given the chance to use his talents for good."},{"name":"VORSAILE","text":"Sanson is safe? Praise be to the Matron!"},{"name":"GUYDELOT","text":"I sent the others back. We can deal with the rest ourselves."},{"name":"SANSON","text":"Worry not, <span class=\"highlight\">Forename</span>, I am quite well. Thanks to you and Guydelot, it ended with only a few cuts and bruises."},{"name":"SANSON","text":"But ere I may rest, I must see to one last task: making good on my promise to Nourval. Come, let us return to the Adders' Nest."},{"name":"SANSON","text":"My apologies for keeping you waiting, Commander. I have Gylbarde's journal with me, and I will surrender it on one condition."},{"name":"SANSON","text":"Once the veracity of the tome's contents is ascertained, the order must make the truth public knowledge when the time is right."},{"name":"VORSAILE","text":"On this we are of a mind, Captain Smyth. Not only will I relay your terms to our leaders, I will speak strongly in favor of them."},{"name":"VORSAILE","text":"But know that mine is but one voice, and more shall be needed if we are to strengthen our cause. As such, you must rise through the ranks swiftly to stand with me."},{"name":"SANSON","text":"S-Stand with you? I fear it will take me a while to attain that honor. To be fooled and taken captive so easily... I am still green as summer grass."},{"name":"VORSAILE","text":"'Tis true that the success of this mission is owed much to <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>, and you would do well to give <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> your profuse thanks."},{"name":"VORSAILE","text":"However, I suggest that you also give yourself more credit. You may have much to learn, but you will learn them in good time. This time, you were faced with numerous trials, yet did you not accomplish your mission in spite of them?"},{"name":"GUYDELOT","text":"Aye, listen to Vorsie! We came back with the tome─no one can say we didn't do our jobs!"},{"name":"GUYDELOT","text":"Look at you─a bit of praise, and you're a stunned marmot? That won't do at all! If you're gonna shape the future of our nation, you're gonna have to shape up!"},{"name":"SANSON","text":"You are right, Guydelot. From leading our unit to fulfilling my promise to Nourval, much rests upon my shoulders. Come what may, I will ever stand tall and forge on."},{"name":"SANSON","text":"<span class=\"highlight\">Forename</span>, I must needs go to file my report, but ere I leave, allow me to offer you my heartfelt thanks. Not only for your invaluable aid, but for being an example to me."},{"name":"SANSON","text":"By following your lead, I shall strive to become the best leader I can be, that my unit's song might one day serve to rouse all Gridania!"},{"name":"GUYDELOT","text":"And off he goes. Good that he's hale and hearty, at any rate."},{"name":"GUYDELOT","text":"I'll stick with Sanson for a while, make sure he don't tear open any stitches. In the meantime, would you go and let Jehantel know we're returned? I'll be along myself soon enough."},{"name":"GUYDELOT","text":"But speaking of the old man, to think that he knew Vainchelon's son! You don't get to that age and not rub shoulders with a legend or two, eh?"},{"name":"VORSAILE","text":"My regards to Jehantel. And...I would thank you not to take up the habit of calling me “Vorsie.” Ahem."},{"name":"JEHANTEL","text":"...I see. My thanks for bearing word. Though Sanson and Guydelot may not have endeared themselves to the Twin Adder leadership, they have found a stout ally in Commander Heuloix. I must say, it truly stirs the spirit to see the younger generation blaze a new path."},{"name":"JEHANTEL","text":"And I pray that Nourval, too, will find his own path to walk─one that is paved not with hatred, but with hope. That leads to peace both in the world and in his heart. 'Tis what his ancestors would have wished."},{"name":"JEHANTEL","text":"In him I see them, and it calls to mind my days spent learning bow and song under his great-grandsire. A kindly old man who tirelessly tended his father's grave, never forgetting the ideals he stood for..."},{"name":"JEHANTEL","text":"Somewhere along Lord Vainchelon's line, those ideals had faded away. But thanks to you and yours, they may yet be restored, and made bolder still by a true remembrance of the past. And the world shall be a better place for it."},{"name":"SYSTEM","text":"This concludes the bard quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “Courage Born of Fear.”"},{"name":"SYSTEM","text":"Once you have done so, the next bard quest will be available from Jehantel."},{"name":"NOURVAL","text":"I will suffer none to stand in the way of my ambition!"},{"name":"GUYDELOT","text":"Your ambition's shite, an' we're gonna make you see sense even if it means beatin' you senseless!"},{"name":"NOURVAL","text":"Hmph, you're strong... But I cannot fall! Not until my goal is realized!"},{"name":"GUYDELOT","text":"Ugh, he's got spirit, I'll give him that..."},{"name":"GUYDELOT","text":"But so do we, and we ain't gonna take it lying down! Time to fire things up with song!"},{"name":"NOURVAL","text":"Enough with that detestable noise!"},{"name":"GUYDELOT","text":"Gah! I-I can't move... Break me out of this, <span class=\"highlight\">Forename</span>!"},{"name":"NOURVAL","text":"Stubborn fools! If you are so eager for death, I will give it to you!"},{"name":"GUYDELOT","text":"What's this now? Keep your guard up!"},{"name":"GUYDELOT","text":"S-Seven hells! Spread out or he'll skewer us both!"},{"name":"GUYDELOT","text":"Ugh, bugger me... Finish it off, will you?"},{"name":"NOURVAL","text":"Master Guydelot has given up. It's past time you gave up too."}],"reward":{"gil":3100,"action":7409,"items":[{"id":20278}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":24}],"quests":[68429]},"next":[68750]},"partials":[{"type":"npc","id":"1022528","obj":{"i":1022528,"n":"Guydelot","l":52,"q":2}},{"type":"npc","id":"1006750","obj":{"i":1006750,"n":"Jehantel","l":56,"q":11}},{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1000200","obj":{"i":1000200,"n":"Luciane","l":52,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1000254","obj":{"i":1000254,"n":"Ywain","l":53,"q":13,"t":"Guildmaster"}},{"type":"npc","id":"1022529","obj":{"i":1022529,"n":"Guydelot","l":57,"q":1}},{"type":"npc","id":"1022530","obj":{"i":1022530,"n":"Sanson","l":57,"q":1}},{"type":"action","id":"7409","obj":{"i":7409,"n":"Refulgent Arrow","c":2616,"j":23,"t":3,"l":70}},{"type":"item","id":"20278","obj":{"i":20278,"n":"Storyteller's Attire Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68429","obj":{"i":68429,"n":"Sleeping Truths Lie","g":151,"l":"The Fringes","s":680,"f":1}},{"type":"quest","id":"68750","obj":{"i":68750,"n":"A Harmony from the Heavens","g":151,"l":"South Shroud","s":800}}]}