{"quest":{"name":"Whither Wawalago Wanders","location":"Limsa Lominsa","id":68431,"patch":4.0,"sort":601,"icon":100695,"unlocksFunction":1,"eventIcon":71341,"issuer":1000857,"target":1000856,"genre":146,"journal":["Master Wawalago's dubious deportment of late has Sisipu duly distressed.","As Sisipu tells it, Master Wawalago has been acting awfully suspicious of late, sneaking surreptitiously out of the city at strange hours of the night. Concerned that the guildmaster may have gotten himself mixed up in something shady, she enlists your services in going to the man and sizing up what exactly is going on.","Somewhat stung to hear that Sisipu is on to him despite his best efforts to keep his secret, Master Wawalago nevertheless is quick to assure you that nothing suspicious is afoot. On the contrary, he has simply been going out to converse with a companion who seeks his counsel─a companion who, he expresses, might be eager to meet you as well. He asks you to assure Sisipu that all is well, then join him and his friend at the Gods' Grip.","Though not particularly pleased at Wawalago's deception and unwillingness to disclose the details of his dealings with this enigmatic acquaintance of his, Sisipu is nevertheless heartened to hear that the guildmaster is well, and that you will be accompanying him to the Gods' Grip to ensure that he doesn't get into any deeply dire straits.","Meeting Wawalago at the Gods' Grip, you are quickly joined by Govv, a young Sahagin who befriended Master Wawalago after ending up on the wrong end of his fishing line. Recently, Govv is gravely concerned at the sudden and surprising disappearance of a particularly striking species of fish known as “the shooting star of the seas” in the Sahagin tongue. With a clear vote of confidence from the guildmaster, Govv accepts your aid, and goes off to collect more information that could help you ascertain where the fish may have absconded to. In the meantime, Wawalago would return to Limsa before Sisipu gets wise to his current whereabouts.","Back at Fisherman's Bottom, Wawalago relates his rationale for keeping his dealings with Govv a secret from Sisipu. He explains that the girl's home was once raided by the Sahagin when she was young, and he seeks only to spare her from reliving the pain of her past. Stating his intention to seek out more information on the fish─such as its name in your own tongue─he encourages you to partake in a spot of fishing to further focus your mind on the task at hand.<br><br>※The next fisher quest will be available from Wawalago upon reaching level 63."],"objectives":["Speak with Wawalago.","Speak with Sisipu.","Wait for Wawalago at the Gods' Grip.","Speak with Wawalago."],"dialogue":[{"name":"SISIPU","text":"Ah, <span class=\"highlight\">Forename</span>. Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I wanted to see. It's about the guildmaster. He's been acting a bit─wait for it, now─fishy of late."},{"name":"SISIPU","text":"How so, you ask? Well, first of all, he hasn't been seen chasing skirts at the Wench for nearly a whole week now. What's more, word has it he's been skulking in and out of the city at the strangest hours, tiptoeing around as if he's afraid of being seen."},{"name":"SISIPU","text":"It's not like the man ever does any work around here, but he <span class=\"emphasis\">is</span> the face of the guild─it wouldn't be good for business if he got himself caught up in anything untoward. Next time you're down in Fisherman's Bottom, mayhap you could pay him a visit and see what's what."},{"name":"SISIPU","text":"If it weren't for his utter aversion to anything resembling honest work, I'd wonder if Wawalago wasn't moonlighting as a culinarian."},{"name":"WAWALAGO","text":"Well, bash me in the head with a bucket of barnacles! If it isn't <span class=\"highlight\">Forename</span>, the second most skillful fisher in our fair realm. To what do I owe the pleasure of your presence today?"},{"name":"WAWALAGO","text":"Sisipu's on to me, you say!? But how could that be? Is it possible that I'm not as sly, stealthy, and surreptitious as I thought?"},{"name":"WAWALAGO","text":"Don't answer that. Old Wawalago's adult enough to admit it when he's been apprehended in the act. Fact is, I've found a new friend who's been picking my brain for advice regarding a particularly puzzling predicament."},{"name":"WAWALAGO","text":"Truth be told, I was just thinking of tramping over to the Gods' Grip to meet him now. I think he'd also be agog to make your acquaintance as well─if, of course, you wouldn't be averse to accompanying me."},{"name":"WAWALAGO","text":"Well, I suppose that settles it. Just do your friend Wawalago one favor: stop by the guild and tell Sisipu there's no cause for concern. And, ah, don't mention much more than that. Girl's got enough gnawing at her mind with guild goings-on, I reckon."},{"name":"WAWALAGO","text":"Put poor, pensive Sisipu's mind at ease, and let's go gallivanting our way to the Gods' Grip. My friend's waiting for us, and he doesn't have a particular propensity for patience, as it were."},{"name":"SISIPU","text":"So Wawalago says he's fine, but says he can't─or won't─say any more than that? Forgive me if that doesn't particularly inspire me with confidence."},{"name":"SISIPU","text":"Well, if nothing else, I suppose he'll have you around to make sure he doesn't get into anything over his head. You <span class=\"emphasis\">will</span> keep an eye on him for me, won't you? Of course you will."},{"name":"SISIPU","text":"I couldn't possibly fathom what he's up to, but leave it to Wawalago to find a new excuse to shirk his guildmaster duties. As if he needed another one..."},{"name":"WAWALAGO","text":"Ah, there's the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> I was looking for! Now all we need to do is find─"},{"name":"GOVV","text":"(-???-)Pshhh...! Wawalago! What is the meaning of thisss!? Who is this ssstrange shorewalker!?"},{"name":"WAWALAGO","text":"Get a grip now, Govv! This is <span class=\"highlight\">Forename</span>, a fast friend and one of the most accomplished anglers in Eorzea. I reckoned <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'d be just the person to help me puzzle out your little predicament."},{"name":"WAWALAGO","text":"This is Govv. We met fishing─or rather, I was doing the fishing, and he was more...accidentally attaching his lower lip to my lure."},{"name":"WAWALAGO","text":"I can tell what you're thinking─a fisherman and a Sahagin make for bizarre bedfellows. And it's true─we were tearing at each other's throats at first. But once we delved into a discussion of our love for the ocean deep, we became keenly conscious of just how much we have in common."},{"name":"WAWALAGO","text":"You see, Govv here is searching for a stunningly spectacular specimen of fish which has distressingly disappeared from the seas of La Noscea!"},{"name":"WAWALAGO","text":"The shooting star of the sea─that's what the Sahagin have termed it in their tongue. Govv says that seeing whole schools of them sail through the sea with their scintillating scarlet scales is a spectacle of blissful beauty."},{"name":"WAWALAGO","text":"It's a sight all the more precious 'cause of their penchant for only appearing in particular seasons. Govv reckons that they're a roaming species that migrates after mating season to lay their eggs and nurture their newborns."},{"name":"WAWALAGO","text":"...At least they were, before they just packed up and puttered off to who knows where. Govv here wasn't going to take the matter reclining on his rear."},{"name":"GOVV","text":"Pshhh... My clutchmates insissst that it is sssimply the way of nature─that the fish have sssimply died out, or found a more desssirable habitat. Thisss I cannot accept!"},{"name":"GOVV","text":"And ssso I embarked on a journey. I ssscoured the far reaches of the realm's ssseas, where the shooting ssstars once appeared in abundance, and I found a single fishing line with an inviting lure at its tip... The next thing I knew, I was reeled in by Massster Wawalago here."},{"name":"GOVV","text":"Pshhh... At firssst, I was ready to gut him for having ssstolen such a beautiful creature from usss, but he assured me that he had done nothing of the sssort."},{"name":"WAWALAGO","text":"Agonizes me to admit as much, but to tell the truth, I've never even laid my lookers on one of these shooting stars. But if they're half as handsome a sight as Govv says, it'd be a sorry shame if we swallowed this supposition of their demise without doing our due diligence."},{"name":"WAWALAGO","text":"At the same time, I'm the guildmaster, and I can't very well go gallivanting off to every far-flung frontier of the realm while Sisipu does all the dirty work. So I decided to avail myself of the aid of my most astute assistant. That'd be <span class=\"highlight\">Forename</span> here."},{"name":"GOVV","text":"Pshhh... Forgive me if I am ssskeptical, Massster Wawalago. While I know your own knowledge of the seas is sssecond to none, I do not know this shorewalker from the ssscales on my back. Give me one good reason why I should trussst <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"WAWALAGO","text":"I'm telling you, <span class=\"highlight\">Forename</span>'s as fine a fisher as anyone I've ever had the pleasure of calling my protégé! Housed in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> head is every piece of piscine lore and learning you could fathom. If anyone can find this fish of yours, it's <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"WAWALAGO","text":"I'm telling you, <span class=\"highlight\">Forename</span>'s as fine a fisher as anyone I've ever had the pleasure of calling my protégé! What's more, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s fast friends with some of your own kind, or haven't you heard? If anyone can find this fish of yours, it's <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"GOVV","text":"Pshhh... If you would ssspeak so highly of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, then I sssuppose I have no reason to object. And with that, I will return to the sssearch."},{"name":"WAWALAGO","text":"There you have it, <span class=\"highlight\">Forename</span>. Ready to rove and ramble the seas of the realm in search of this slippery shooting star? 'Cause I most assuredly am!"},{"name":"WAWALAGO","text":"But first, I'd best make a brief and fleeting foray back to Fisherman's Bottom. Sisipu's like to get suspicious if I sneak away for much longer."},{"name":"WAWALAGO","text":"Ah, there you are, <span class=\"highlight\">Forename</span>. We can exhale easy. I'm pleased as punch to say I slipped back via a side street and Sisipu was none the smarter."},{"name":"WAWALAGO","text":"On the subject of Sisipu, I've been meaning to explain and elucidate just why I'm so worried of telling the girl the truth behind this latest little lark of ours."},{"name":"WAWALAGO","text":"Don't tell the dear girl I divulged this to you, but truth be told, her village was set upon by a suitably savage group of Sahagin when she was just a little lass. I'm sure she and Govv would get on great if they got to know each other, but for the time being, I'm disinclined to drudge up any disquieting memories."},{"name":"WAWALAGO","text":"You understand, yes? And so you'll be dealing with me directly for this particular duty. Firstly, I intend to do a little investigating into what this so-called shooting star is called in the common tongue. In the meantime, might I propose that you treat yourself to a soothing spot of fishing?"},{"name":"SYSTEM","text":"The next fisher quest will be available from Wawalago upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1053,"items":[{"num":250,"id":10},{"num":250,"id":13},{"num":3,"id":12668}],"xp":451980},"reqs":{"jobs":[{"lvl":60,"id":19}],"questsType":"all","quests":[67625,67895]},"next":[68432]},"partials":[{"type":"npc","id":"1000857","obj":{"i":1000857,"n":"Sisipu","l":29,"q":22}},{"type":"npc","id":"1000856","obj":{"i":1000856,"n":"Wawalago","l":29,"q":14,"t":"Guildmaster"}},{"type":"item","id":"12668","obj":{"i":12668,"n":"Commercial Survival Manual","l":1,"c":26152,"t":63}},{"type":"quest","id":"67625","obj":{"i":67625,"n":"Carpe Diem","g":146,"l":"Ishgard","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68432","obj":{"i":68432,"n":"A Rousing Reunion","g":146,"l":"Limsa Lominsa","s":630,"f":1}}]}