{"quest":{"name":"Search for the Spawning Grounds","location":"Limsa Lominsa","id":68433,"patch":4.0,"sort":650,"icon":100695,"unlocksFunction":1,"eventIcon":71341,"issuer":1000856,"target":1000856,"involved":[1021398,1021399,1021400,1021401,1021402],"genre":146,"usedItems":[17950],"journal":["The smitten smile on Wawalago's face suggests he's received a report from Reyna.","An eager and excited Wawalago explains to you that Reyna has narrowed down the possible location of the shooting stars' spawning beds to a region in the Ruby Sea. He expresses an onze of envy as he enlightens you that Reyna will be waiting in the port town of Kugane, in the far-flung land of Hingashi.","Reyna's reconnaissance among the local fishermen has borne fruit in the form of the true name of the Sahagin's so-called shooting stars, known to the Hingan people as the harutsuge. Unfortunately, the name was all she could garner from her conversations, as none had seen the harutsuge's schools swimming in the vicinity as of late. Reyna then suggests speaking with another tribe talented in fishing─namely the Kojin, who are well acquainted with the Far Eastern depths. Make for Tamamizu to see if these turtlish types can tell you any more about the precise location of the spawning beds.","After you free Govv from the Kojin fishing net in which he had unfortunately found himself, his captor conveys to you that the prized fish's place of origin is like to be found near Shoal Rock─though their numbers in the open seas have been dwindling day by day and year by year. As impassioned as ever, Govv hurls himself headfirst into the deep unknown while Reyna asks you to join her at the Isle of Bekko to form a more solid plan.","Reyna would have you capture a handful of harutsuge sprags in order to glean further knowledge of the cause of their disappearance. She asks you to use utmost caution in catching three from the waters near Shoal Rock.","You hand over the sprags to Reyna, who places them in a bucket bound for Coerthas, where she and Ansaulme would further observe their condition and behavior. Govv is overcome with joy at the sight of the tiny red fish, and expresses his appreciation to you and Reyna for your part in locating their spawning grounds. Reyna asks you to return to the guild to relay the triumphant tidings to Wawalago.","While Wawalago is delighted that you succeeded in finding and capturing the fish, he laments his lack of ability to assist you and Reyna further in your mission, as he has been finding it more and more frustrating to keep Sisipu at bay.<br><br>※The next fisher quest will be available from Wawalago upon reaching level 68."],"objectives":["Join Reyna in Kugane.","Speak with the Kojin at Tamamizu.","Join Reyna on the Isle of Bekko.","<span class=\"alternative-container\"><span class=\"alternative\">Catch three harutsuge sprags</span><span class=\"alternative\">Deliver the harutsuge sprags to Reyna</span></span>.","Report to Wawalago at Fisherman's Bottom."],"dialogue":[{"name":"WAWALAGO","text":"<span class=\"highlight\">Forename</span>, I have auspicious news! Auspicious indeed, for the ravishing─or so I reckon─Reyna has ascertained the site of the shooting stars' spawning beds!"},{"name":"WAWALAGO","text":"It is just as she thought! After they hatch, the red rovers ride the raging currents of the Ruby Sea that rush from east to west."},{"name":"WAWALAGO","text":"So it is that they eventually emerge on the edge of La Noscea. Of course, the moment I mentioned this mote of information to Govv, he marched right to the coast, saying he had a mission to make for the Ruby Sea."},{"name":"WAWALAGO","text":"While I appreciate his ardor, I do hope he doesn't intend to <span class=\"emphasis\">swim</span> all the way there. After all, it takes schools of shooting stars twice his size quite some time to span that distance, and they have a current to carry them along!"},{"name":"WAWALAGO","text":"Meanwhile, Reyna herself did the sensible thing by setting out on a sailing vessel. Ah, how I yearn to travel to exotic locales yonder like you young ones. But any sudden sabbaticals would be strikingly suspicious, especially to the ever-skeptical Sisipu. "},{"name":"WAWALAGO","text":"Anyroad, Reyna sails the seas even as we speak. You'll want to seek her out in the port town of Kugane. Oh, and do relay to her my most recognizable of regards─a rousing wink of the right eye should suffice. Hoho!"},{"name":"WAWALAGO","text":"Ah, what I wouldn't sacrifice to set sail for faraway lands! To feast my belly on the fish of foreign waters, and my eyes on its foreign flowers─of the figurative female variety, that is."},{"name":"REYNA","text":"There you are! Even for a veteran fisherwoman who prides herself on her patience, that felt like an eternity. What took you so long?"},{"name":"REYNA","text":"...Then again, I suppose we'll be waiting even longer for Govv. I heard that he's taken upon himself to <span class=\"emphasis\">swim</span> all the way here, although I can't say I'm all that surprised."},{"name":"REYNA","text":"Anyhow, to business. I was able to determine what the locals call the fish that best matches the description of the Sahagin's shooting stars. The most likely candidate is known as the...er, harutsuge? I still don't know if I'm pronouncing that right."},{"name":"REYNA","text":"Unfortunately, all of the fishermen I spoke to insist that they haven't seen them near the shores of late. But don't worry, as I have a plan. If we've exhausted our options on the surface, why not turn to others more in tune with developments in the depths?"},{"name":"REYNA","text":"I speak, of course, of the Kojin. A tribe of aquatic beastmen not unlike our friend Govv, though hopefully more agreeable. If anyone can enlighten us about life under the Ruby Sea, I daresay it's them. What say we venture out to their port in Tamamizu and see what they can tell us?"},{"name":"WAWALAGO","text":"Reyna says the right answers to our questions regarding our red-scaled fish reside in the Ruby Sea. I suggest you set out at once so we can sort out a solution to their shrinking population, and do so swiftly."},{"name":"REYNA","text":"He didn't find himself on the end of a hook this time. Instead, our friend got himself tangled up in a Kojin's trawl. Less painful at least, I suppose?"},{"name":"GOVV","text":"Pshhh! A talking turtle!? What madness is this!?"},{"name":"UKIMONO","text":"Ahahaha! A talking fish─and a large one at that! What will they think of next?"},{"name":"UKIMONO","text":"The talking fish is a friend of yours, perchance? What brings him here─and you, for that matter?"},{"name":"UKIMONO","text":"You come in search of fish with shimmering scarlet scales? That spawn in these waters and travel to the western seas? Yes, such fish were once plentiful here. But I fear we have not seen them of late."},{"name":"GOVV","text":"Pshhh! They have disappeared from the Ruby Sssea as well!? Then we have come all thisss way for nothing!"},{"name":"UKIMONO","text":"Hm? You are a picky one. Surely you are aware that there are other fish in the sea─and far tastier ones, at that? I would be happy to show you how to catch some of our most delightful delicacies."},{"name":"GOVV","text":"Pshhh... The shooting ssstars are not for eating─they are for <span class=\"emphasis\">watching</span>. Or have you never taken time to admire the ssseas in all their beauty?"},{"name":"UKIMONO","text":"...You are an interesting one, indeed. I have never thought to appreciate the beauty of my meals, but perhaps there is something to what you say."},{"name":"UKIMONO","text":"I will do what I can to help you find these “shooting stars” of yours, but know that fish you seek grow fewer and fewer in number by the day. The massive schools once seen swimming in droves in the open waters are no more. If any remain, you are like to find them in the waters near Shoal Rock."},{"name":"GOVV","text":"Pshhh! Truly!? The shooting ssstars still remain!"},{"name":"GOVV","text":"Pshhh! You heard the turtle man, my friendsss! We mussst swim to this Shoal Rock without delay!"},{"name":"REYNA","text":"Eager as ever, isn't he? While I admire his enthusiasm, I would form a more solid plan of action before we go rushing off. Care to join me at the Isle of Bekko, <span class=\"highlight\">Forename</span>?"},{"name":"UKIMONO","text":"I never gave much thought to the harutsuge because of their bitter taste. At the same time, I never thought to admire their beauty. Now I cannot help but wonder what I have been missing all this time."},{"name":"REYNA","text":"As you might have expected, Govv has already plunged himself into the depths below. It might be a while before he comes back up─Sahagin seem to forget the passage of time down there."},{"name":"REYNA","text":"But where was I? Ah, yes. There is one small favor I would ask of you before we go off in search of the harutsuge."},{"name":"REYNA","text":"Remember, our mission is not only to find out whether they still exist, but also to learn the cause of their dwindling numbers─and determine whether the damage is reversible."},{"name":"REYNA","text":"As such, I'd like you to catch me three of the immature shooting stars─harutsuge sprags, if you will─that inhabit these waters. And do be careful when you unhook them─they need to be in pristine condition for observation. Will you do that for me?"},{"name":"REYNA","text":"In the meantime, I'll hunt down a proper vessel to give our catches enough room to swim around. I'd rather not face Govv's wrath if they go belly up before he returns."},{"name":"REYNA","text":"In discussing the harutsuge with local fishermen, I was able to learn that they're a type of herring. But I suppose they're most recognizable by their striking color. Were you able to find them?"},{"name":"REYNA","text":"Incredible! Why, even at this size, they truly are breathtaking to behold, are they not? Confining them to a bucket feels like a crime! At any rate, let us wait for our finned friend to return."},{"name":"GOVV","text":"Pshhh! They are far sssmaller than the ones I remember, but there can be no doubt about it─these are indeed shooting ssstars! It eassses my heart to know they ssstill swim among usss."},{"name":"GOVV","text":"<span class=\"highlight\">Forename</span>, Reyna... Words cannot sssuffice to expresss my gratitude."},{"name":"GOVV","text":"I sssearched for so long, in watersss familiar and foreign, all to no avail. For <span class=\"highlight\">Forename</span> here to find them in sssuch a short ssspan of time─it is clear <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> knowledge of and passion for the sssea are without compare!"},{"name":"REYNA","text":"Always happy to be of service! And now, Govv, I would take them to a proper expert to have them classified and examined. Worry not─I'll take good care of them. You have my word."},{"name":"GOVV","text":"Pshhh... You have more than proven yourssself. I will leave it in your capable handsss. In the meantime, I will return to that talking turtle and share the knowledge of what we have found. Perhapsss he can enlighten usss further."},{"name":"REYNA","text":"I'll exercise the utmost of care in delivering the harutsuge to Ansaulme in Ishgard. We must ascertain their precise physiology and whether or not they suffer from some sort of illness."},{"name":"REYNA","text":"In the meantime, I would appreciate if you could tell Guildmaster Wawalago we will contact him as soon as our observations turn up fruit. Isn't this exciting, <span class=\"highlight\">Forename</span>? I can scarcely wait to see where this leads us next!"},{"name":"WAWALAGO","text":"Fantastic, friend─you've found the ever-elusive fish! Now begins the tall task of finding a way to ward off their waning numbers and see them flower and flourish once more! Alas...though I say “we,” there is little I can do to lighten the load. Not with Sisipu watching me so warily, at least... "},{"name":"WAWALAGO","text":"Why, woeful Wawalago can't even partake in a proper pint without her protests, much less peel away to whisper our plans on this little linkpearl... I suppose there's naught to do but bide my time and mind my own business until Reyna regales us with her latest report."},{"name":"SYSTEM","text":"In testing new waters as a fisher, you have learned “Double Hook”!"}],"reward":{"gil":3152,"action":269,"items":[{"id":19537},{"num":99,"id":20614},{"id":19637,"one":1},{"id":19638,"one":1},{"id":19639,"one":1},{"id":19640,"one":1},{"num":6,"id":5825,"one":1}],"xp":2079000},"reqs":{"jobs":[{"lvl":65,"id":19}],"quests":[68432]},"next":[68434]},"partials":[{"type":"npc","id":"1000856","obj":{"i":1000856,"n":"Wawalago","l":29,"q":14,"t":"Guildmaster"}},{"type":"npc","id":"1021398","obj":{"i":1021398,"n":"Reyna","l":2404,"q":1}},{"type":"npc","id":"1021399","obj":{"i":1021399,"n":"Ukimono","l":2409,"q":1}},{"type":"npc","id":"1021400","obj":{"i":1021400,"n":"Govv","l":2409,"q":1}},{"type":"npc","id":"1021401","obj":{"i":1021401,"n":"Reyna","l":2409,"q":1}},{"type":"npc","id":"1021402","obj":{"i":1021402,"n":"Reyna","l":2409,"q":1}},{"type":"action","id":"269","obj":{"i":269,"n":"Double Hook","c":1118,"j":18,"t":6,"l":65}},{"type":"item","id":"19537","obj":{"i":19537,"n":"Pine Fishing Rod","l":220,"c":38226,"t":32,"p":31363}},{"type":"item","id":"20614","obj":{"i":20614,"n":"Nightcrawler","l":220,"c":27032,"t":33,"p":61}},{"type":"item","id":"19637","obj":{"i":19637,"n":"Tigerskin Cap of Gathering","l":220,"c":41390,"t":34,"p":17249}},{"type":"item","id":"19638","obj":{"i":19638,"n":"Kudzu Coat of Gathering","l":220,"c":43811,"t":35,"p":28749}},{"type":"item","id":"19639","obj":{"i":19639,"n":"Tigerskin Fingerless Gloves of Gathering","l":220,"c":44572,"t":37,"p":17249}},{"type":"item","id":"19640","obj":{"i":19640,"n":"Kudzu Culottes of Gathering","l":220,"c":45972,"t":36,"p":28749}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"item","id":"17950","obj":{"i":17950,"n":"Harutsuge Sprag","l":276,"c":29139,"t":47}},{"type":"quest","id":"68432","obj":{"i":68432,"n":"A Rousing Reunion","g":146,"l":"Limsa Lominsa","s":630,"f":1}},{"type":"quest","id":"68434","obj":{"i":68434,"n":"Always a Bigger Fish","g":146,"l":"Limsa Lominsa","s":680,"f":1}}]}