{"quest":{"name":"Curious Gorge Meets His Match","location":"Eastern La Noscea","id":68436,"patch":4.0,"sort":601,"icon":100669,"unlocksFunction":1,"eventIcon":71341,"issuer":1006746,"target":1023885,"involved":[1023886],"genre":149,"journal":["The fire in his eyes suggests Curious Gorge is getting ready for a fight.","Since you last met Curious Gorge, the reputation of the Maelstrom and its warriors has spread far and wide. In fact, an anonymous band of marauders has challenged them to battle at the Wolves' Den. Though no one knows who these combatants are, they seem quite familiar with you and your exploits, as they have requested your attendance as well. Not one to disappoint, Curious Gorge wastes no time in traveling to the Moraby Drydocks to meet with his brother.","You participate in a gripping battle against a poorly disguised Wyrnzoen and his entourage. The dust settles, but one of his marauders refuses to back down. Though Wyrnzoen is at a loss as to why she refuses to yield, the look in her eyes says it all─she has been blinded by the rage of her inner beast. Tossing Wyrnzoen, Broenbhar, and even Curious Gorge into the waters of the pier, you and Broken Mountain are left to subdue this savage beast alone.","Having returned to her senses, the young marauder introduces herself as Dorgono of the Qerel clan. The inner beast is not a foreign concept to her people, but they lack the understanding to control it. Because of this, those like her who are influenced by it are exiled. She has ventured to Eorzea to hone her skills in the hopes of mastering her inner beast. Broken Mountain readily accepts Dorgono as a new charge. Curious Gorge, on the other hand, deems himself unfit to train her and chooses to train on his own.","Broken Mountain fears he has not the time to both oversee the Maelstrom's fledgling warriors and tend to Dorgono's training. He turns to you for assistance, knowing that only you are capable of defeating Dorgono should she lose herself to her inner beast. For now he bids you rest, while he considers how best to go about her training.<br><br>※The next warrior quest will be available from Broken Mountain upon reaching level 63."],"objectives":["Speak with Broken Mountain at the Moraby Drydocks.","Speak with Broken Mountain."],"dialogue":[{"name":"CURIOUSGORGE","text":"Ah, <span class=\"highlight\">Forename</span>! Ever a sight for sore eyes. By the hardened look in yours, I take it you've wasted no effort in honing your axe on the battlefield."},{"name":"CURIOUSGORGE","text":"My brother and I have seen our fair share of battle as well, together with the fledgling warriors of the Maelstrom. Their training is coming along quite nicely."},{"name":"CURIOUSGORGE","text":"In fact, our exploits have earned us admirers of sorts; we recently received an anonymous invitation to participate in battle exercises at the Wolves' Den."},{"name":"CURIOUSGORGE","text":"I haven't the foggiest idea of who they are, but it would seem that <span class=\"emphasis\">you</span> do. They mentioned you by name, and insisted you join the fray as well."},{"name":"CURIOUSGORGE","text":"Perhaps they wish to settle an old score. In any case, who are we to deny them the opportunity to cower before the might of a warrior's axe?"},{"name":"CURIOUSGORGE","text":"Come, <span class=\"highlight\">Forename</span>. My brother has prepared a boat for us at the Moraby Drydocks. If it's a thrashing they crave, let's not hesitate in giving it to them!"},{"name":"CURIOUSGORGE","text":"Let's not dally now, <span class=\"highlight\">Forename</span>. It would be rude to keep our hosts waiting any longer."},{"name":"BROKENMOUNTAIN","text":"Good, you're here. As I'm sure my brother has told you, we have yet to determine the identities of these challengers."},{"name":"BROKENMOUNTAIN","text":"Naturally, we refused at first. Our time would be better spent training the troops. In the end, though, I could not deny their enthusiasm for battle and desire to display their combat prowess, and took it upon myself to accept. At the very least I surmised it would prove inspiring to our men."},{"name":"BROKENMOUNTAIN","text":"With you at our side, it will prove a most enriching experience for all parties involved. I have naught to show our men of how to wield an axe, but I shall do what I can to aid you with my healing magicks. When you have steeled yourself for battle, we may set out to the Wolves' Den."},{"name":"WYRNZOEN","text":"(-Wyrnzoen...?-)<span class=\"highlight\">Forename Surname</span>, as I live and breathe! It's been too long. Word has it you've grown strong since the battle of Salt Strand. Even mastered the forgotten arts of the warrior."},{"name":"WYRNZOEN","text":"(-Wyrnzoen...?-)But words are wind. Ready your axe, and prove to me why men should fear the bite of your steel!"},{"name":"WYRNZOEN","text":"(-Wyrnzoen...?-)So this... &lt;pant&gt; This is the strength of a warrior, the art of battle celebrated in legend. Perhaps if I were a few winters younger my efforts would've proven more than an unavailing struggle. You have met and exceeded all expectations."},{"name":"BROENBHAR","text":"(-Familiar Fellow-)Aye. Pains me to say it, but we're no match fer the likes o' you. Gods help us if the Sahagin ever learned to throw an axe about like that."},{"name":"WYRNZOEN","text":"Indeed, the student has surpassed the master─the <span class=\"emphasis\">guild</span>master. For it was I all along! Hah hah hah! "},{"name":"WYRNZOEN","text":"...Not even a quizzical lift of the brow? Surely our disguises were not as bad as all that. Or do you mean to say you've forgotten the face of your former instructor?"},{"name":"CURIOUSGORGE","text":"Wyrnzoen? By the Twelve, it is you! And Broenbhar! I wasn't expecting to crush Limsa's famed marauders under heel so easily. This was only a warm-up, yes? We've yet to even break a sweat."},{"name":"DORGONO","text":"(-Fetching Fighter-)Unnngh..."},{"name":"DORGONO","text":"(-Fetching Fighter-)Graaaghhh!"},{"name":"WYRNZOEN","text":"Dorgono! Whatever is the matter?"},{"name":"BROKENMOUNTAIN","text":"Those eyes! She wields the strength of her inner beast!?"},{"name":"CURIOUSGORGE","text":"She swings like a dream..."},{"name":"BROKENMOUNTAIN","text":"Brother!"},{"name":"BROKENMOUNTAIN","text":"<span class=\"highlight\">Forename</span>. We cannot allow her to leave this pier."},{"name":"DORGONO","text":"M-My apologies. The will of Karash burns brightly within me. Too brightly."},{"name":"BROKENMOUNTAIN","text":"Karash...? I'm quite certain that was the reckless thrashing of one overcome by their inner beast."},{"name":"BROKENMOUNTAIN","text":"But that is a phenomenon seldom seen beyond the walls of my village. Who are you, and from where do you hail, friend?"},{"name":"DORGONO","text":"I am Dorgono of the Qerel. My home is...was...on the Azim Steppe in lands far to the east."},{"name":"DORGONO","text":"We are unmatched in the ways of the axe. We are a strong people. At times <span class=\"emphasis\">too</span> strong. There are ones like me, consumed by this thing you call the inner beast, the will of Karash. We are the Taken, cursed with an insatiable thirst for violence."},{"name":"BROKENMOUNTAIN","text":"Remarkable! Your people sound not unlike those of my village."},{"name":"BROKENMOUNTAIN","text":"Though I suppose it stands to reason others share this gift. The strength of one's inner beast stems from a primal instinct we are all born with. It is merely a matter of learning to draw it out─a technique we warriors have long since mastered."},{"name":"BROKENMOUNTAIN","text":"Yet you would call it a curse. Have your people not learned to control this power?"},{"name":"DORGONO","text":"The will of Karash, this...inner beast...can be controlled?"},{"name":"DORGONO","text":"Perhaps then I can at last return home!"},{"name":"DORGONO","text":"The Taken are sentenced to exile. That is why I traveled west, to train further in the way of the axe. If I can overcome this affliction, I may have a chance for redemption."},{"name":"WYRNZOEN","text":"Well, this is certainly an unexpected turn of events. As our most promising recruit, I wished to see how she might fare against hardened combatants. I never thought she could actually defeat the likes of Curious Gorge."},{"name":"WYRNZOEN","text":"Seems to me further time training under our roof would be a waste. Might you be willing to take her on?"},{"name":"BROKENMOUNTAIN","text":"Well, we can't very well leave her unattended. If she should succumb to her inner beast, there's no telling what havoc she might wreak."},{"name":"WYRNZOEN","text":"Then I leave her in your capable hands. I'm sure you'll make a fine warrior out of her."},{"name":"DORGONO","text":"Thank you, sir! I will do anything you ask if it means taming this wretched beast within me."},{"name":"CURIOUSGORGE","text":"I... I can't believe I lost. How am I to instruct others when I am still so lacking?"},{"name":"CURIOUSGORGE","text":"Brother, I'm sorry, but I cannot guide her in the way of the warrior when I myself have stumbled on the path."},{"name":"BROKENMOUNTAIN","text":"No, let him be. His lack of resolve would only invite hindrances to the task at hand."},{"name":"BROKENMOUNTAIN","text":"This is a path he must walk alone. Come, let us go."},{"name":"BROKENMOUNTAIN","text":"With my brother engrossed in his own training for the interim, I fear I will be spread too thin overseeing the instruction of Maelstrom recruits to give Dorgono proper guidance. Gods help us should she be consumed by her inner beast."},{"name":"BROKENMOUNTAIN","text":"A worldly adventurer such as yourself no doubt has other pressing obligations, but you are the only one capable of containing Dorgono should the worst come to pass. Do you think it possible you could spare time to assist me in her training?"},{"name":"BROKENMOUNTAIN","text":"Oh, thank goodness. I don't know what I would have done had you refused."},{"name":"BROKENMOUNTAIN","text":"Normally, we would gather to train at the Wolves' Den, but I believe an exception must be made for Dorgono. Yes, both for her sake and the rest of the Maelstrom recruits. For now I would give this some thought. Pray return here in a few days' time, and I should have a solution."},{"name":"SYSTEM","text":"The next warrior quest will be available from Broken Mountain upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1978,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":22}],"questsType":"all","quests":[66137,67895]},"next":[68437]},"partials":[{"type":"npc","id":"1006746","obj":{"i":1006746,"n":"Curious Gorge","l":32,"q":15}},{"type":"npc","id":"1023885","obj":{"i":1023885,"n":"Broken Mountain","l":31,"q":5}},{"type":"npc","id":"1023886","obj":{"i":1023886,"n":"Curious Gorge","l":31,"q":2}},{"type":"quest","id":"66137","obj":{"i":66137,"n":"And My Axe","g":149,"l":"Upper La Noscea","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68437","obj":{"i":68437,"n":"Field Training","g":149,"l":"Lower La Noscea","s":630,"f":1}}]}