{"quest":{"name":"Dark as the Night Sky","location":"Kugane","id":68449,"patch":4.0,"sort":680,"icon":100671,"unlocksFunction":1,"eventIcon":71341,"issuer":1022553,"target":1022560,"involved":[1022554,1022555,1022556,1022561,1022569,1022748],"genre":150,"journal":["Orn Khai would like to discuss events which may or may not be pertinent to your search.","Orn Khai seems to be enjoying his new surroundings, remarking that the locals treat Dravanians with much more respect when compared to Ishgardians. He also notes that he has made several new acquaintances of late thanks to Karaku. In fact, Orn Khai was just about to set off to meet one such friend when you arrived. Apparently said acquaintance knows something that might aid your search. You decide to accompany Orn Khai and find out what this individual has to say.","Orn Khai's friend is revealed to be Gyodo─a Namazu moneylender. He suggests that you travel to Reunion on the Azim Steppe, for an area nearby is said to be home to a slumbering dragon with scales as dark as the night sky. Orn Khai, convinced you may have finally found Faunehm, sets off for the Steppe and bids you follow him as soon as possible.","You find Orn Khai in Reunion surrounded by Auri children whose curiosity has been piqued by the petite dragon. His hands more than full, Orn Khai encourages you to ask the adult members of the local community about the dragon you seek. You look upon the settlement and wonder whom to engage in conversation first.","It soon becomes apparent that the people of Reunion are not much for small talk. One tells you in no uncertain terms to leave him be if you are not of mind to trade, and another refuses to talk at all. However, the Spinner smiles upon you eventually, as you hear that the dragon is said to dwell near the mountains north of Reunion.","You return to Orn Khai to find him somewhat overwhelmed by all the children's affection. After sharing your findings with him, he agrees the two of you would be best served by searching around the nearby mountains. Once he has freed himself of his admirers, you both prepare to head to Ceol Aen to the northwest.","While searching for Faunehm, you encounter an Oroniri warrior who states that the dark-scaled dragon has thrashed eight of his tribe's finest warriors. You soon find the creature and it is immediately apparent that this is the dragon you have been searching for. Orn Khai calls out to Faunehm, but she is in a frenzy of rage, and words do not reach her.","Following the young dragon's advice, you choose to withdraw from the battle, in order to formulate a more effective plan of action.","Orn Khai is clearly distressed by the state in which he found his father's consort. He bids you leave him alone for a while, to allow him to clear his head and consider how you may free Faunehm from her fury. You begin the walk back to Reunion as Orn Khai takes to the skies once more.","You find a slightly calmer Orn Khai upon returning to Reunion. He notes that the key to getting through to Faunehm is identifying the cause of her temper, and asks that you allow him some time to contemplate what could be ailing her.<br><br>※The next dragoon quest will be available from Orn Khai upon reaching level 70."],"objectives":["Speak with Orn Khai.","Speak with Orn Khai in Reunion.","Gather information in Reunion.","Report to Orn Khai.","Speak with Orn Khai in Ceol Aen.","Speak with Orn Khai.","Speak with Orn Khai in Reunion."],"dialogue":[{"name":"ORNKHAI","text":"Hello there, <span class=\"highlight\">Forename</span>! I must say, I could get used to life in the Far East. Unlike those in Ishgard, Hingans harbor no ill feelings towards us Dravanians."},{"name":"ORNKHAI","text":"You should really hear some of the things Karaku says; he keeps remarking that he wants me to stay here for eternity when he introduces me to new people. It seems he believes quite strongly that dragons bring good luck."},{"name":"ORNKHAI","text":"But what is that expression I see on your face? Could it be jealousy? Oh, <span class=\"highlight\">Forename</span>, do not worry yourself. You shall be just as popular here one day!"},{"name":"ORNKHAI","text":"More importantly, one of the new friends I have made through Karaku mentioned that he knew something that might prove relevant to our search. I was just about to go and meet him now; why don't you accompany me?"},{"name":"ORNKHAI","text":"Give me a moment, I shall call him now!"},{"name":"ORNKHAI","text":"It is I, Orn Khai!"},{"name":"GYODO","text":"Endless and most sincere apologies to you and yours for the wait, yes, yes. What, what? <span class=\"highlight\">Forename</span>! Do not worry, no more betrayals, sworn on all the kami in creation I have, yes, yes."},{"name":"ORNKHAI","text":"<span class=\"highlight\">Forename</span>, you have already made Gyodo's acquaintance?"},{"name":"GYODO","text":"Endless and most sincere apologies to you and yours for the wait, yes, yes."},{"name":"ORNKHAI","text":"<span class=\"highlight\">Forename</span>, allow me to introduce Gyodo. Do not be alarmed by his rather slimy appearance for he is perfectly harmless."},{"name":"GYODO","text":"Come to hear about dragon legends, yes, yes?"},{"name":"GYODO","text":"There is a place that comes to mind. The Azim Steppe."},{"name":"GYODO","text":"You can get there by following the One River: home to all Namazu."},{"name":"GYODO","text":"Go way, way upstream and you will reach the Steppe, yes, yes. It is here that a monstrous dragon as dark as the night sky is said to slumber."},{"name":"ORNKHAI","text":"D-Dark as the night sky, you say?"},{"name":"GYODO","text":"No more information do I have. Go to the marketplace on the Azim Steppe known as Reunion. You may find the answers you seek there."},{"name":"ORNKHAI","text":"This could be the one, <span class=\"highlight\">Forename</span>. The Horde was home to many a dark-scaled dragon after all; let us hurry to Reunion!"},{"name":"ORNKHAI","text":"Well, as these energetic children have come to me, it feels only natural that I try questioning them first."},{"name":"ORNKHAI","text":"Perhaps your time would be best spent asking some of the more mature Au Ra if they know anything of the dragon Gyodo mentioned."},{"name":"ORNKHAI","text":"Now, now, little ones. There is plenty of me to go around."},{"name":"QESTIRMERCHANT","text":"..."},{"name":"ORONIRMAN","text":"Come to trade livestock? No!? Then piss off."},{"name":"DOTHARLWOMAN","text":"Woolen rugs! Fine woolen rugs! Bring some warmth to your home!"},{"name":"QESTIRMERCHANT","text":"..."},{"name":"SYSTEM","text":"It seems you would be better served asking elsewhere."},{"name":"ORONIRMAN","text":"A black dragon in these parts? Sure I know of it. The storytellers say the fiend awakens once every few decades and goes on a wild rampage. When it's had its fill of destruction, it returns to its lair in the northwestern mountains and slumbers."},{"name":"ORONIRMAN","text":"If any tribe were able to slay such a beast, it would bring them great honor. We Oronir have had our eyes on it for some time."},{"name":"DOTHARLWOMAN","text":"You are looking for the dragon, are you? I did hear there's been a sighting recently. First one in a hundred years apparently."},{"name":"DOTHARLWOMAN","text":"Not that I believe any of that nonsense! It would not surprise me if the whole story was dreamed up by some fool Oronir in his cups."},{"name":"ORNKHAI","text":"<span class=\"highlight\">Forename</span>...help... These children are not playing nice.<br>I do not suppose you have fared any better?"},{"name":"ORNKHAI","text":"And it's said to live in the northwest?"},{"name":"ORNKHAI","text":"If the dragon has truly been sighted recently, our timing is perfect! I am glad we did not come this far only to find it in the midst of a deep slumber."},{"name":"ORNKHAI","text":"Let us head for the mountains to the northwest!<br>Now, now, children. Do you not think it is time you were making your way back to mummy and daddy? We grown-ups have business to attend to!"},{"name":"ORNKHAI","text":"This seems as good an area as any to commence our search. Ready to get started, <span class=\"highlight\">Forename</span>?"},{"name":"ORNKHAI","text":"Well then, let us see if we cannot─wait, what is that smell?"},{"name":"ORNKHAI","text":"Are we about to learn that the locals refer to this warrior as a “black dragon”?"},{"name":"ORONIRWARRIOR","text":"&lt;pant&gt; &lt;pant&gt; &lt;pant&gt;<br>Are you also on the hunt for this dragon?"},{"name":"ORNKHAI","text":"Hunt!? Perish the thought! We have come to speak with it."},{"name":"ORONIRWARRIOR","text":"Now I've heard everything... Speak, you say? <span class=\"emphasis\">You</span> may be calm and willing to talk, but I assure you that black-scaled monster is not in the mood."},{"name":"ORONIRWARRIOR","text":"It has thrashed eight of our finest warriors. We are disgraced, but I must inform our khan of the battle's outcome."},{"name":"ORNKHAI","text":"Well, he certainly was not interested in staying here any longer. Come along, <span class=\"highlight\">Forename</span>, I think we may have finally found Faunehm this time!"},{"name":"ORNKHAI","text":"Agh! Faunehm, I beg of you, listen to me!"},{"name":"ORNKHAI","text":"She's mad with fury. My voice does not reach her."},{"name":"ORNKHAI","text":"This clash will only end if one of you perishes."},{"name":"ORNKHAI","text":"Let us retreat for now and rethink our approach!"},{"name":"ORNKHAI","text":"We have come so far, and overcome so many obstacles. Yet, when we finally meet Faunehm, we cannot even speak with her..."},{"name":"ORNKHAI","text":"My apologies, <span class=\"highlight\">Forename</span>, but pray return to Reunion without me. I need some time to take all of this in. Perhaps a spot of hunting would help clear my mind."},{"name":"ORNKHAI","text":"Yes, I am somewhat calmer now, <span class=\"highlight\">Forename</span>, thank you for asking. The key to all of this is discovering the source of Faunehm's rage."},{"name":"ORNKHAI","text":"Once we know this, we can decide our next move. Pray give me some time."},{"name":"ORNKHAI","text":"I will not allow our journey to end in failure."}],"reward":{"gil":2710,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":23}],"quests":[68448]},"next":[68450]},"partials":[{"type":"npc","id":"1022553","obj":{"i":1022553,"n":"Orn Khai","l":2404,"q":2}},{"type":"npc","id":"1022560","obj":{"i":1022560,"n":"Orn Khai","l":2411,"q":2}},{"type":"npc","id":"1022554","obj":{"i":1022554,"n":"Quiet Qestir","l":2411,"q":1}},{"type":"npc","id":"1022555","obj":{"i":1022555,"n":"Oroniri Merchant","l":2411,"q":1}},{"type":"npc","id":"1022556","obj":{"i":1022556,"n":"Dotharli Maiden","l":2411,"q":1}},{"type":"npc","id":"1022561","obj":{"i":1022561,"n":"Orn Khai","l":2411,"q":1}},{"type":"npc","id":"1022569","obj":{"i":1022569,"n":"Orn Khai","l":2411,"q":1}},{"type":"npc","id":"1022748","obj":{"i":1022748,"n":"Orn Khai","l":2404,"q":1}},{"type":"quest","id":"68448","obj":{"i":68448,"n":"Serpent and the Sea of Rubies","g":150,"l":"Coerthas Central Highlands","s":650,"f":1}},{"type":"quest","id":"68450","obj":{"i":68450,"n":"Dragon Sound","g":150,"l":"The Azim Steppe","s":700,"f":1}}]}