{"quest":{"name":"The Heart of the Problem","location":"The Azim Steppe","id":68440,"patch":4.0,"sort":700,"icon":100669,"unlocksFunction":1,"eventIcon":71341,"issuer":1022836,"target":1023885,"involved":[1022837,1022838,1022839,1022840,1022841,1023411,1023886],"genre":149,"journal":["Curious Gorge seems surprisingly calm and collected.","In an unusual change of pace, Curious Gorge has taken to helping merchants of Reunion with errands. He has been recently tasked with taking two horses up to Mol Iloh, but is wary of leaving one without a rider. He asks you to speak with the horses' owner, so you might saddle up to assist him.","The sprightly merchant is only too happy to ready his horse for you. Mounted and ready to ride, he wishes you save travels to Mol Iloh.","As you arrive at Mol Iloh, a sheepherder approaches you. His look of satisfaction makes clear that he is the intended recipient of the horse. With the delivery complete, you look for Curious Gorge who should be nearby.","Robbed of his inner beast and ability to battle, Curious Gorge has thought long and hard about what life has to offer off the battlefield. He realizes now the vexing emotion which inhibited his inner beast was the love he bears for Dorgono. This understanding of his feelings has also reawakened his once-dormant strength. To cast aside any lingering feelings of doubt or hesitation, he plans to profess his love to her. To that end, he bids you follow him back to Reunion.","Both Curious Gorge and Dorgono have been waiting for your return. His look of exasperation makes it clear he has buckled under pressure. Your presence offers him a modicum of courage, but before he can say a word, she interrupts him to relay grave news to you─the Chaghan have grown bolder, and now plan to attack Mol Iloh. She means to cut them off before they can reach the settlement and leaves ahead of you. Curious Gorge grows increasingly frustrated with himself, and asks you to give him the one thing certain to dispel his fear─the realm-shattering slap of Eorzea's greatest warrior!","It is all Curious Gorge can do not to fall to the ground from the force of your mighty blow. He is now duly inspired and ready to help Dorgono rout the Chaghan.","You find Dorgono south of the settlement, surveying the area for the Chaghan. The silent operation is foiled, however, by the boisterous bellowing of Curious Gorge as he attempts to profess his love to her. Your cover blown, a fierce battle with the Chaghan soon ensues. The song of steel echoes across the Azim Steppe, and after the final refrain, you find yourselves victorious. Or so it seems. The Chaghan are defeated, but the threat of danger still looms in Curious Gorge who has been overcome by his inner beast. Though he seems beyond reasoning, it is a confession of love from Dorgono that brings him back to his senses.","Love is in the air, and Dorgono asks Curious Gorge to return with her to start anew as part of the Qerel clan. With a heavy heart he declines. Control of his inner beast still eludes him, and he cannot suffer the thought of hurting the one he loves most. He vows to become the realm's second─or third─strongest warrior, hoping to someday be worthy of her affection. Dorgono bids you both farewell and departs to at last rejoin her people.","Curious Gorge is a man of his word, and jokingly warns you that, should you decide to rest on your laurels for even a moment, he intends to rob you of your title of realm's greatest warrior. That said, he concedes you both have earned rest after such a grueling battle. Longing for home, you both return to Limsa Lominsa.","Broken Mountain is relieved to see you both returned safely, hopeful that things would return to as they were. Unfortunately that would not be the case. Still struggling to control his inner beast, Curious Gorge again relinquishes his position as instructor to resume training at Hidden Falls. Though his brother is certain to emerge from his training a warrior transformed, Broken Mountain hopes you will answer their call should the realm want for a mighty axe.<br><br>※The next warrior quest will be available from Curious Gorge once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “To Have Loved and Lost.”"],"objectives":["Mount the merchant's horse.","Ride the merchant's horse to Mol Iloh.","Speak with Curious Gorge.","Dispel Curious Gorge's fear with a /slap.","Meet with Dorgono near Mol Iloh.","Speak with Curious Gorge.","Speak with Broken Mountain at the Moraby Drydocks."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Stars in the Dark.”"},{"name":"CURIOUSGORGE","text":"Your timing is impeccable as always. I have a task well suited to a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your many talents."},{"name":"CURIOUSGORGE","text":"Aside from my training, I've taken to working with the merchants here in Reunion, my most recent venture being the delivery of horses."},{"name":"CURIOUSGORGE","text":"I was asked to take a pair of horses up north today, but I'd feel at ease knowing there was a rider in both saddles."},{"name":"CURIOUSGORGE","text":"Speak with the sprightly fellow over there and he'll see that you're fit to ride. Make for Mol Iloh and I'll meet you there."},{"name":"CURIOUSGORGE","text":"This isn't a job to be done on foot, <span class=\"highlight\">Forename</span>. Speak with the sprightly fellow over there and saddle up."},{"name":"SHEPHERD02903","text":"Have you seen any merchants on horseback heading this way? &lt;sigh&gt; They should have been here by now."},{"name":"SYSTEM","text":"Return to the mirthful merchant and mount the horse to be delivered to Mol Iloh."},{"name":"MERCHANT02903","text":"(-Mirthful Merchant-)Ah, Curious Gorge did mention someone would be coming to help. Yes, yes, your horse is right over here. Safe travels, friend."},{"name":"MERCHANT02903","text":"(-Mirthful Merchant-)What were you doing out there? Your horse came galloping back not long ago and looked rather spooked. I'll tolerate no funny business. Understand?"},{"name":"SHEPHERD02903","text":"Ah, my horse! Thank you so much. I don't know where I'd be without you adventurers. Is the other burly-looking fellow over there with you?"},{"name":"SHEPHERD02903","text":"Don't let me keep you. It'd be rude to leave that friend of yours waiting any longer."},{"name":"CURIOUSGORGE","text":"Ah, there you are. Was this not invigorating? The feeling of fresh air on your face, the wind blowing through your hair?"},{"name":"CURIOUSGORGE","text":"Bereft of the strength to fight, I have been given much time to drink in the beauty of these lands. Much time to think..."},{"name":"CURIOUSGORGE","text":"Since I was old enough to hold an axe, the path of the warrior is all I have ever known, the pursuit of ever greater strength my only purpose. I realize now how narrow my view of the world was."},{"name":"CURIOUSGORGE","text":"I was convinced my defeat at the Wolves' Den Pier was the reason Dorgono has been constantly on my mind, and my wounded pride served only to further cloud my judgment. "},{"name":"CURIOUSGORGE","text":"But I can see clearly now, the clouds are gone. I finally understand why Dorgono has vexed me so."},{"name":"CURIOUSGORGE","text":"I love her, <span class=\"highlight\">Forename</span>. From the moment I laid eyes on her, she had holmganged my heart."},{"name":"CURIOUSGORGE","text":"Overwhelmed with these feelings, it's little wonder she trounced me so at the Wolves' Den Pier."},{"name":"CURIOUSGORGE","text":"But I am once more master of my emotions. Already I can feel my inner beast has reawakened."},{"name":"CURIOUSGORGE","text":"If I am to regain my full strength, there is only one thing left to do: profess my love to Dorgono, and in the doing, rid myself of any lingering doubts that may still inhibit my inner beast."},{"name":"CURIOUSGORGE","text":"Let us return to town. Hopefully there will be enough time before she arrives to think of what to say."},{"name":"DORGONO","text":"Oh, <span class=\"highlight\">Forename</span>, thank goodness you are here."},{"name":"CURIOUSGORGE","text":"What took you so long? Every time I look into those powder blue eyes of hers, I lose all train of thought. Now that you're here, perhaps I can muster the courage to─erm, ahem!"},{"name":"CURIOUSGORGE","text":"Dorgono! I... I... I lo─"},{"name":"DORGONO","text":"What is wrong with you?"},{"name":"DORGONO","text":"Ugh! There is no time for your drivel─the Chaghan mean to strike again!"},{"name":"DORGONO","text":"They've always been prone to violence, but I fear their recent attack on the Qerel has given them a taste for pillaging. They mean to attack Mol Iloh next!"},{"name":"DORGONO","text":"Quickly! We must stop them before they can reach town!"},{"name":"CURIOUSGORGE","text":"Damn it all! Again I was distracted by the quiver of her come-hither lips. I'm embarrassed to admit it, but love proves to be more terrifying than any foe."},{"name":"CURIOUSGORGE","text":"This fear, it must be struck out of me. Literally. I want you to <span class=\"highlight\">slap</span> me as hard as you can, <span class=\"highlight\">Forename</span>. Crack your battle-hardened palm across my face."},{"name":"CURIOUSGORGE","text":"Don't hold back, <span class=\"highlight\">Forename</span>. Slap me so hard my heart skips a beat from the shock of it."},{"name":"CURIOUSGORGE","text":"Don't hold back, <span class=\"highlight\">Forename</span>. Slap me so hard my heart skips a beat from the shock of it."},{"name":"CURIOUSGORGE","text":"Godsdamn, that smarts! Any harder and my heart might've stopped altogether. "},{"name":"CURIOUSGORGE","text":"But the fear that once gripped my heart is no more. Come, <span class=\"highlight\">Forename</span>, Dorgono must know of my love for her. I will shout it from the mountain tops if I have to!"},{"name":"DORGONO","text":"The Chaghan are close by. Overcoming their forces will be no easy task, but we must be especially careful of their leader, Nayaga. He is able to wield the power of Karash to its fullest."},{"name":"DORGONO","text":"When he taps into that strength, he is nigh unbeatable. With our combined might, we may have a chance."},{"name":"DORGONO","text":"Speaking of which... Curious Gorge, are you well enough to fight?"},{"name":"CURIOUSGORGE","text":"Better than well, for I am in love─with you! I love you, Dorgono. I love you!!!"},{"name":"DORGONO","text":"Wh-What are you doing, you witless worm!? <span class=\"emphasis\">Keep your voice down</span>!"},{"name":"DORGONO","text":"Your bellowing has given us away!"},{"name":"NAYAGA","text":"What have we here? Dorgono. You have some nerve showing your face here. If you value your life, you will crawl back to whatever hole you came out of."},{"name":"DORGONO","text":"Never! What you have done to the Qerel, your own people, is unforgivable! I will not allow you to bring such ruin to others."},{"name":"DORGONO","text":"I was too weak before, but thanks to these warriors, the power of Karash is now at my beck and call. I have the strength to put an end to you!"},{"name":"NAYAGA","text":"What we do, we do in the name of the Dusk Mother! If you would defy her will, there is only one punishment fit for such heresy."},{"name":"NAYAGA","text":"Oh Nhaama, goddess of the dusk, hear me! Grant us the strength to smite our enemies! For one glorious moment, let the blood spilled here slake your unquenchable thirst!"},{"name":"DORGONO","text":"<span class=\"highlight\">Forename</span>, Curious Gorge. Prepare yourselves!"},{"name":"CURIOUSGORGE","text":"Leave it to me, my sweet vixen! I will show them what it truly means to unleash one's inner beast!"},{"name":"DORGONO","text":"We did it! The Chaghan have been brought to heel. Perhaps now I can finally return home."},{"name":"DORGONO","text":"That was quite a display, Curious Gorge. The worm has at last shown himself a warrior."},{"name":"DORGONO","text":"Curious Gorge...?"},{"name":"CURIOUSGORGE","text":"Graaaaaaghhh!"},{"name":"DORGONO","text":"It's over. We have won! You needn't prove yourself to me any longer!"},{"name":"DORGONO","text":"You have always been so strong, so caring. I know I was mean to you before, but in truth I... I..."},{"name":"DORGONO","text":"I love you, Curious Gorge!"},{"name":"CURIOUSGORGE","text":"Forgive me. Though only for a moment, it seems my inner beast got the better of me. Again..."},{"name":"DORGONO","text":"So what if it did? The Chaghan have been defeated, and I owe it all to the two of you! When the Qerel hear of this, they are sure to welcome me back with open arms."},{"name":"DORGONO","text":"I will share with them all I have learned of controlling the will of Karash, and I would do it with you."},{"name":"DORGONO","text":"Come away with me, Curious Gorge, and together we can start anew with the Qerel!"},{"name":"CURIOUSGORGE","text":"How long I have waited to hear those words. &lt;sigh&gt; Yet sadly, I must decline. While it is true we defeated the Chaghan, I cannot dismiss the fact that I succumbed to my inner beast. If I had turned on you when you needed me most, I could never forgive myself."},{"name":"CURIOUSGORGE","text":"A man who lacks such self-discipline is undeserving of a wonderful woman such as you."},{"name":"CURIOUSGORGE","text":"I must continue training to master my inner beast and become the realm's greatest─well, <span class=\"emphasis\">second</span> greatest─warrior. When that day comes, I will find you."},{"name":"DORGONO","text":"Second? Surely you mean third. The honor of being the realm's second greatest warrior is mine, and I doubt you will ever surpass me."},{"name":"CURIOUSGORGE","text":"Argh! Just wait and see! I'll rip those horns off that pretty little head of yours and─"},{"name":"DORGONO","text":"Hah hah hah. Well, you can certainly try. I will gladly fight to keep my title, and can think of no better challenger. Until then, take care of yourself."},{"name":"CURIOUSGORGE","text":"I can scarcely believe you overcame that monster Nayaga on your own."},{"name":"CURIOUSGORGE","text":"The title of realm's greatest warrior is rightfully yours, but never forget: should you slack for even a moment, I'll be there to take it from you!"},{"name":"CURIOUSGORGE","text":"Though I suppose after today's exertion, we've both earned a moment's respite. Let us return home. I yearn for the shores of Limsa, and my brother is no doubt sick with worry besides."},{"name":"CURIOUSGORGE","text":"I have caused you and my brother nothing but grief. I mean to apologize, but I fear he will not like what I have to say."},{"name":"BROKENMOUNTAIN","text":"It gladdens me to see you both returned hale and whole. Once more my brother's inner beast burns fiercely within him, and from what he has told me, Dorgono has at last been reunited with her people."},{"name":"CURIOUSGORGE","text":"Our ventures in the East were not without trouble, though. Much of which could have been avoided if not for my failings."},{"name":"CURIOUSGORGE","text":"I know you wish for me to resume leading the Maelstrom's warriors, Brother, but I am unworthy for the role. I myself am still in need of training, and that is why I would dedicate myself to honing my skills, that I might someday be worthy of the position again."},{"name":"BROKENMOUNTAIN","text":"I suspected you might say as much. Very well, then. If you truly believe this is best, I will not stop you. Find your own path. When you're ready, I'm sure it will lead back to us someday."},{"name":"CURIOUSGORGE","text":"Thank you, Brother! I must be off to Hidden Falls. There's much to do if I'm ever to be a match for <span class=\"highlight\">Forename</span> or Dorgono."},{"name":"BROKENMOUNTAIN","text":"I sometimes wonder if he will ever be satisfied. Though I confess I admire his fervor. You have inspired him to reach new heights, and I have every confidence he will emerge from his training a new man. Nevertheless, I hope we may look to you for aid should we find ourselves on hard times."},{"name":"SYSTEM","text":"This concludes the warrior quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “To Have Loved and Lost.”"},{"name":"SYSTEM","text":"Once you have done so, the next warrior quest will be available from Curious Gorge."}],"reward":{"gil":3700,"action":7389,"items":[{"id":20277}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":22}],"quests":[68439]},"next":[68748]},"partials":[{"type":"npc","id":"1022836","obj":{"i":1022836,"n":"Curious Gorge","l":2411,"q":2}},{"type":"npc","id":"1023885","obj":{"i":1023885,"n":"Broken Mountain","l":31,"q":5}},{"type":"npc","id":"1022837","obj":{"i":1022837,"n":"Mirthful Merchant","l":2411,"q":1}},{"type":"npc","id":"1022838","obj":{"i":1022838,"n":"Mol Shepherd","l":2411,"q":1}},{"type":"npc","id":"1022839","obj":{"i":1022839,"n":"Curious Gorge","l":2411,"q":1}},{"type":"npc","id":"1022840","obj":{"i":1022840,"n":"Dorgono","l":2411,"q":1}},{"type":"npc","id":"1022841","obj":{"i":1022841,"n":"Curious Gorge","l":2411,"q":1}},{"type":"npc","id":"1023411","obj":{"i":1023411,"n":"Dorgono","l":2411,"q":1}},{"type":"npc","id":"1023886","obj":{"i":1023886,"n":"Curious Gorge","l":31,"q":2}},{"type":"action","id":"7389","obj":{"i":7389,"n":"Inner Release","c":2564,"j":21,"t":4,"l":70}},{"type":"item","id":"20277","obj":{"i":20277,"n":"Brutal Armor Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68439","obj":{"i":68439,"n":"Going the Distance","g":149,"l":"Lower La Noscea","s":680,"f":1}},{"type":"quest","id":"68748","obj":{"i":68748,"n":"Once, Twice, Three Times a Warrior","g":149,"l":"Eastern La Noscea","s":800}}]}