{"quest":{"name":"Serpent and the Sea of Rubies","location":"Coerthas Central Highlands","id":68448,"patch":4.0,"sort":650,"icon":100671,"unlocksFunction":1,"eventIcon":71341,"issuer":1006748,"target":1022553,"involved":[1018982,1022550,1022551,1022552],"genre":150,"journal":["Ser Alberic plans to try his hand at dragon-smuggling.","Ser Alberic reports that he has succeeded in finding a way to have Orn Khai transported across to Kugane. He neglects to inform you of exactly how the young dragon will be making the journey, but ensures you that you will be able to rendezvous with him if you speak to Karaku, the owner of the Bokaisen Hot Springs.","Upon hearing your name, Karaku hastily rushes off to collect a package he says is addressed to you. It is immediately evident that all is not as it seems when the contents of the crate start demanding to be set free. Orn Khai soon escapes from the confines of the box and informs you that the legend of the Serpent of the Ruby Sea is the tale you shall be investigating next. The two of you make your way to Isari in order to see just how much the locals know.","A local fisherman tells you that he is familiar with a faerie tale that mentions the Serpent of the Ruby Sea. However, as his knowledge does not stretch much beyond that, he bids you talk to one of the village's older inhabitants if you seek more information. You spy an elderly woman nearby and head in her direction to see if she cannot aid your search.","As luck would have it, the elderly lady is well versed in matters concerning the legend. According to her, the serpent is no mere faerie tale; it lurks nearby the Coral Banquet and has been to known to eat men whole. Undeterred, you elect to summon Orn Khai in order to share with him your findings.","After hearing that the serpent commonly eats pirates whole, Orn Khai suggests there is little chance that the creature could be Faunehm. Nonetheless, his curiosity gets the better of him and he requests your assistance in searching for the beast of legend. Orn Khai heads off to hunt the bait required to lure the creature out of hiding, while you head for the Coral Banquet.","Orn Khai hurls the freshly hunted bait into the sea and, lo and behold, a menacing creature rises from the ocean depths. You lock horns with the Serpent of the Ruby Sea.","After a fierce battle you finally succeed in slaying the legendary serpent. Inspired by the creature's size, Orn Khai decides to take its carcass back to Bokaisen Hot Springs for supper.","Upon your return to Bokaisen Hot Springs, Orn Khai greets you with the disheartening news that he has already helped himself to the choice cuts of serpent meat. Putting the issue to one side, it is agreed that Orn Khai will remain in Kugane and search for further leads as to Faunehm's whereabouts.<br><br>※The next dragoon quest will be available from Orn Khai upon reaching level 68."],"objectives":["Speak with Karaku in Kugane.","Gather information in Isari.","Speak with the wise woman.","Summon Orn Khai.","Speak with Orn Khai.","Speak with Orn Khai in Kugane."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Tide Goes in, Imperials Go Out.”"},{"name":"ALBERIC","text":"Ah, <span class=\"highlight\">Forename</span>. It pleases me to tell you that I have at last discovered a means to have our young friend safely transported to Kugane."},{"name":"ALBERIC","text":"I have reached an agreement with the owner of an establishment in the area─I believe its name was Bokaisen Hot Springs. Converse with him once you are arrived in Kugane and he shall tell you Orn Khai's whereabouts."},{"name":"ALBERIC","text":"I took the liberty of making the little one aware of a few local legends. Hopefully they shall aid you in your search for Faunehm."},{"name":"ALBERIC","text":"Once you are arrived in Kugane, seek out the onsen known as Bokaisen Hot Springs. The establishment's owner will help you rendezvous with Orn Khai."},{"name":"KARAKU","text":"Come one, come all! Burns, cuts, embarrassing rashes─there is naught that the mystical waters of the Bokaisen Hot Springs cannot heal!"},{"name":"KARAKU","text":"Ho, you say your name is <span class=\"highlight\">Forename Surname</span>? Why, a package just arrived for you. I shall fetch it right this instant!"},{"name":"ORNKHAI","text":"(-Muffled Moaning-)S-Someone, anyone, release me from this icy prison..."},{"name":"ORNKHAI","text":"Ugh! What was that blasted dragoon thinking!? It is all well and good for him to tell me to simply sleep through the journey─he is not the one stuffed in a crate of ice crystals!"},{"name":"ORNKHAI","text":"And the boat. Oh, how it rocked!"},{"name":"ORNKHAI","text":"Admittedly he is right in thinking dragons capable of entering a long sleeplike state, but we are not bears! We do not require freezing cold temperatures to achieve this! Ugh, my fangs are like icicles."},{"name":"ORNKHAI","text":"That said, I must admit I enjoyed my best sleep for many a year."},{"name":"ORNKHAI","text":"At any rate, now we are both here, we can resume the search for Faunehm!"},{"name":"ORNKHAI","text":"Before I was unceremoniously stuffed into that crate, Ser Alberic told me of the legend of Seiryu─a dragon regarded as a guardian of the Far East."},{"name":"ORNKHAI","text":"Though something tells me we would not have much luck with this tale either. The story has existed for several thousand years; Faunehm only came to these lands a mere millennium ago."},{"name":"ORNKHAI","text":"Ser Alberic agreed that the story most worth our attention was that of the Serpent of the Ruby Sea. This came into being much more recently."},{"name":"ORNKHAI","text":"I suggest you visit Isari and try asking the residents if they know anything that might be of help. Whistle for me once you feel you have found something I should know."},{"name":"KARAKU","text":"I am still struggling to believe my eyes. That was a genuine dragon. A more auspicious omen I could not have wished to see!"},{"name":"ISARIFISHER","text":"What is that now? Am I familiar with the Serpent of the Ruby Sea?"},{"name":"ISARIFISHER","text":"You will struggle to find someone here that is not! Not a day of my childhood passed without my grandmother telling me that faerie tale. These days, hearing the opening line of it alone puts me to sleep in an instant."},{"name":"ISARIFISHER","text":"“All children that dare swim out into the deep blue sea are sure to become the sea serpent's tea.” ...Oh my, I nearly fell asleep there! I imagine that is all any one my age will be able to tell you. Try asking the elderly woman over there if you want to know more."},{"name":"ISARIFISHER","text":"I never thought that an ijin would come asking about the Serpent of the Ruby Sea!"},{"name":"ISARIOLDWOMAN","text":"You would have me tell you the faerie tale of the Serpent of the Ruby Sea?"},{"name":"ISARIOLDWOMAN","text":"Oh, dear child, that is no mere faerie tale. Head on over to the Coral Banquet if you do not believe me. You shall find a horror beyond your wildest nightmares!"},{"name":"ISARIOLDWOMAN","text":"Its nose misses nothing, especially not the blood of men. There is many a tale of wounded pirates falling overboard and being swallowed alive before they could plant a hand on the ship they fell from."},{"name":"ISARIOLDWOMAN","text":"You would do well to make sure any cuts you have are fully healed before looking into this further, child. The serpent's nose misses nothing."},{"name":"ORNKHAI","text":"Does it seem like the serpent could be Faunehm?"},{"name":"ORNKHAI","text":"Hmm, while it is true we dragons do hunt by following our prey's scent, I have not known our kind to swallow men whole. The idea strikes me as awfully...barbaric."},{"name":"ORNKHAI","text":"While I doubt this will lead us to Faunehm, my curiosity has been piqued and I cannot simply leave this mystery unsolved!"},{"name":"ORNKHAI","text":"It is also a brilliant excuse for me to engage in a bit of hunting! We cannot hope to draw out the beast without bait after all. Head to the Coral Banquet and I shall join you shortly."},{"name":"ORNKHAI","text":"Father never mentioned you were this slow, <span class=\"highlight\">Forename</span>! I have already hunted a beast that will doubtless lure out the serpent and I still arrived here long before you."},{"name":"ORNKHAI","text":"I shall go ahead and hurl the bloody meat into the sea. Pray deal with any hungry creatures that are drawn to us."},{"name":"ORNKHAI","text":"Well. I do not know about you, but that was somewhat bigger than what I was expecting."},{"name":"ORNKHAI","text":"We may have failed to find Faunehm, but in her place we have gained a delicious supper!"},{"name":"ORNKHAI","text":"Now we have the serpent's meat, let us head back to Bokaisen Hot Springs. The last one back has to prepare dinner! "},{"name":"ORNKHAI","text":"Oh, <span class=\"highlight\">Forename</span>, good to see you returned at last. I must confess, I was unable to resist the meat's seductive call and, before I knew it, I had devoured the vast majority of our spoils..."},{"name":"ORNKHAI","text":"Please do help yourself to whatever is left; I have stored the scra─leftovers in the crate I was sent here in. Pay no attention to anything that may resemble teeth marks, those are indentations created by the ice!"},{"name":"ORNKHAI","text":"Oh, anyone could see through that lie. I am sorry, <span class=\"highlight\">Forename</span>. I do hope my greed has not upset you too much."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Why didn't you leave me any good morsels!?"},{"name":"A1","text":"I was never one for meat."},{"name":"ORNKHAI","text":"Calm yourself, <span class=\"highlight\">Forename</span>. Many would count themselves lucky to even have the chance to nibble on the meat of such a majestic beast!"},{"name":"ORNKHAI","text":"Truly? After hearing of your feats of strength from Ser Alberic, I assumed you must feast upon tonzes of meat everyday!"},{"name":"ORNKHAI","text":"Regardless, meat is far from our primary concern at the moment. I am beginning to wonder if the day we find Faunehm will ever come."},{"name":"ORNKHAI","text":"But I must not allow myself to lose heart so easily! There are still plenty of legends for us to look into; hope is far from lost. Pray continue to grant me your support, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":2659,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":23}],"quests":[68447]},"next":[68449]},"partials":[{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"npc","id":"1022553","obj":{"i":1022553,"n":"Orn Khai","l":2404,"q":2}},{"type":"npc","id":"1018982","obj":{"i":1018982,"n":"Karaku","l":2404,"q":4}},{"type":"npc","id":"1022550","obj":{"i":1022550,"n":"Sun-kissed Fisherman","l":2409,"q":1}},{"type":"npc","id":"1022551","obj":{"i":1022551,"n":"Wise Woman","l":2409,"q":1}},{"type":"npc","id":"1022552","obj":{"i":1022552,"n":"Orn Khai","l":2409,"q":1}},{"type":"quest","id":"68447","obj":{"i":68447,"n":"Drowsy Dragons","g":150,"l":"Coerthas Central Highlands","s":630,"f":1}},{"type":"quest","id":"68449","obj":{"i":68449,"n":"Dark as the Night Sky","g":150,"l":"Kugane","s":680,"f":1}}]}