{"quest":{"name":"The Mongrel and the Knight","location":"Ishgard","id":68445,"patch":4.0,"sort":700,"icon":100675,"unlocksFunction":1,"eventIcon":71341,"issuer":1012251,"target":1012251,"involved":[1012252,1012253,1014577,1022150],"genre":158,"journal":["Hilda has a message from the manufactory.","Hilda informs you that Stephanivien has completed his examination of Hrunting. Make your way to the manufactory and learn what the chief machinist has discovered.","Stephanivien reveals that the hilt of the sacred blade was altered to conceal a small training bomb. While lacking in lethality, the explosion would be sufficient to disrupt the ceremony and cast doubt upon Ser Aymeric's authority as well as the Hounds' competence. The chief machinist also mentions the circulation of nasty rumors, whose purpose appears to be to discredit the watch and thereby cripple the initiative to arm Ishgard's commoners.<br><br>Seeking to make the most of this opportunity, Muscadain proposes a plan to catch the culprits red-handed. Return to the Brume, and discuss your part in this operation with Hilda.","Hilda outlines the strategy, and you join Stephanivien and the others at Saint Valeroyant's Forum. After a tense few moments, the chief machinist's device locates a signal in the Brume, and you set off to confront the instigators of this underhanded plot.<br><br>You discover a noblewoman holding the detonator, but she and her allies prove reluctant to yield to the Hounds' authority. Battle is joined, and with Ser Muscadain's support, you eventually triumph over Baroness Melisie.","The successful conclusion to the operation appears to have nurtured a measure of mutual respect between Hilda and Ser Muscadain. The Temple Knight's farewell, however, comes with an unexpected revelation: it would seem the two are brother and sister. Having acknowledged her sibling, and the part Stephanivien played in her maturation, Hilda is eager to return to the Brume once more.","Rostnsthal deems the Hounds capable of carrying out their duties without further instruction, and takes his leave of Ishgard. Hilda thanks you for all you have done, her confidence leaving no doubt in your mind that the watch will earn even greater accolades in the days to come.<br><br>※The next machinist quest will be available from Stephanivien once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “Courage Born of Fear.”"],"objectives":["Speak with Stephanivien.","Speak with Hilda.","Defeat the knights and inquisitors!","Defeat Baroness Melisie!"],"dialogue":[{"name":"ROSTNSTHAL","text":"I signed on to teach Brume rats 'ow to shoot, an' the next thing I know I'm neck-deep in shite. I'd better be gettin' some extra coin for this investigation work..."},{"name":"HILDA","text":"We've just had a messenger from the manufactory: seems they've finished lookin' over the sword."},{"name":"HILDA","text":"Let's head on over, and hear what Lord Stephanivien has to say."},{"name":"SYMME","text":"It's almost time for the ceremony. I wonder if them knight initiates are feeling nervous..."},{"name":"EUDESTAND","text":"It don't matter what they did to that blade. The Hounds have a job to do, and we'll damn well do it."},{"name":"HILDA","text":"Ready to go, <span class=\"highlight\">Forename</span>? Lord Stephanivien'll be waitin' for us."},{"name":"ROSTNSTHAL","text":"There's a storm brewin'...<br>Time to cast our nets an' see what we can catch."},{"name":"MUSCADAIN","text":"All the relevant parties appear to be present. If you would, Lord Stephanivien?"},{"name":"STEPHANIVIEN","text":"Very well. I'll cut straight to the point: I discovered a small bomb concealed inside the hilt of the sword."},{"name":"STEPHANIVIEN","text":"This particular explosive was part of a batch intended for Temple Knight training purposes, and is designed to be detonated from a distance. I won't bore you with specifics, but I assure that I am quite familiar with its capabilities─after all, I was the one who made it."},{"name":"HILDA","text":"Bloody hells...<br>Someone went to a lot of trouble to sneak that bomb into the ceremony. An assassination attempt?"},{"name":"STEPHANIVIEN","text":"Unlikely. As I said, these bombs were designed for training exercises─even if you were grasping the hilt when it exploded, you wouldn't even lose a finger. Some nasty burns, at the worst."},{"name":"MUSCADAIN","text":"That would be more than enough. If the sacred blade were to be dropped during the investitures, many in the crowd would interpret that as a sign from the Fury. The lord commander's authority would come into question, and responsibility for the incident would fall squarely upon the Hounds."},{"name":"STEPHANIVIEN","text":"Ah, so someone wishes to discredit the watch beyond salvation. That would explain the ridiculous rumors presently circulating amongst the lords and ladies..."},{"name":"HILDA","text":"Rumors? What rumors?"},{"name":"STEPHANIVIEN","text":"Why, that Hrunting's theft and recovery was orchestrated entirely by the watch itself. Some of the more impressionable members of the nobility are convinced you armed bandits with firearms, instructed them to steal the sword, then captured them yourselves to elevate your standing."},{"name":"ROSTNSTHAL","text":"Then the mood's already sour an' simmerin'. If the sword exploded on top o' that, it'd be like throwin' oil on the fire! Reason be damned, it'd be the watch's 'eads on the choppin' block!"},{"name":"MUSCADAIN","text":"Who could have instigated the gossip behind these baseless accusations? I ordered the events surrounding Hrunting's theft to be kept in the strictest of confidences..."},{"name":"Q1","text":"Who began the rumors?"},{"name":"A1","text":"The woman who arranged the theft."},{"name":"A1","text":"A treacherous Temple Knight."},{"name":"HILDA","text":"Ah, well she would know all about it, wouldn't she?"},{"name":"HILDA","text":"That's a possibility, I'll grant you. But I'm more inclined to lay the blame at the foot of this lady client who started the whole mess."},{"name":"MUSCADAIN","text":"I suspect this villainess fears the threat to the status quo, and the high profile of the Hounds has made you a target. A strike against you is a strike against the idea of <span class=\"emphasis\">any</span> commoner bearing the power of a firearm..."},{"name":"HILDA","text":"I'm flattered to know we've become so important, but she picked the wrong pack of dogs to corner. Now it's our turn to go on the hunt."},{"name":"ROSTNSTHAL","text":"Goin' after the mastermind, eh? I'm all for a bit o' retribution, but we'll need a better description than “overpainted wench.”"},{"name":"STEPHANIVIEN","text":"Fortunately, my prospectometer and I are one step ahead of you this time! As soon as I discovered the bomb, I set to work crafting a device that would help us pinpoint the location of its paired detonator."},{"name":"MUSCADAIN","text":"...And thus lead us directly to the one who holds it. I propose we simply proceed with the ceremony as planned, and catch this fool red-handed."},{"name":"HILDA","text":"Not a bad plan─as long as we're prepared for any accomplices she might have lurkin' along with her."},{"name":"MUSCADAIN","text":"The ceremony is almost upon us. Let us steel ourselves for the task ahead."},{"name":"HILDA","text":"We'll sort out our strategy, then head back to the Brume. Meet us there when you're ready, <span class=\"highlight\">Forename</span>."},{"name":"SYMME","text":"Don't you worry about the ceremony's security─it's what we've been training for. We'll show them blue bloods just how far we've come!"},{"name":"EUDESTAND","text":"Go and take care of them bastards as tried to frame us. Oh, and keep an eye on Hilda while you're at it, eh?"},{"name":"ROSTNSTHAL","text":"I weren't plannin' on doin' more'n teach trigger work, but to the 'ells with it. Let's catch these bastards, <span class=\"highlight\">Forename</span>."},{"name":"STEPHANIVIEN","text":"I have some final calibrations to make to the detection device. It may need further adjustments as it hones in on the signal, so I shall be on hand to assist you at Saint Valeroyant's Forum."},{"name":"HILDA","text":"Right, <span class=\"highlight\">Forename</span>, the ceremony's about to begin. Here's the plan."},{"name":"HILDA","text":"Muscadain and the other Hounds'll be handlin' security as scheduled, so as not to arouse suspicion."},{"name":"HILDA","text":"We reckon the lady'll have someone watchin' the proceedings, ready to tell her the best moment to detonate that little bomb─likely right as the blade rests on an initiate's shoulder. That's how I'd do it, anyhow."},{"name":"HILDA","text":"The watcher shouldn't be too hard to spot, and the Hounds can nab him before he gets away."},{"name":"HILDA","text":"Meanwhile, we'll be waitin' at Saint Valeroyant's Forum with Stephanivien's device, ready to move as soon as we're sure of the detonator's location."},{"name":"HILDA","text":"Bring your best ammunition, <span class=\"highlight\">Forename</span>. If this woman can organize a clear route through the Vault, then she's like to have worse than a few ragged bandits on her side..."},{"name":"ROSTNSTHAL","text":"...What's takin' so long, boss? The ceremony's already begun."},{"name":"STEPHANIVIEN","text":"Some quiet, if you will! If I can catch the exact moment the detonator is activated..."},{"name":"STEPHANIVIEN","text":"I have it! The signal came from the far edge of the Brume!"},{"name":"HILDA","text":"The smug bastards are hidin' right in our home territory. Right, then. We'd best go give 'em a proper bloody welcome!"},{"name":"MELISIE","text":"This is Melisie. Is the crowd enjoying our little spec─ What!? Nothing!? Not even a puff of smoke!?"},{"name":"HILDA","text":"Surprise! We found your bomb."},{"name":"MELISIE","text":"The Hounds!"},{"name":"HILDA","text":"...I know you. You're that noble bitch what ignored me outside the Vault. In the right place at the right time to plant that bandit rumor, eh? And I suppose you was the one who penned that contract of sale, too."},{"name":"MELISIE","text":"Wh-What nonsense is this!? I have no memory of fraternizing with commoners!"},{"name":"HILDA","text":"Hah, got your attention this time, didn't I? A good thing, too, since I've a wagonload more questions for you. Here's one: are your inquisitor friends there goin' to come quietly?"},{"name":"TEMPLEKIGHTLEADER02909","text":"(-???-)You and your “Hounds” will be the only ones surrendering their arms this day."},{"name":"TEMPLEKIGHTLEADER02909","text":"Not only have you interfered with official inquisitorial business, you've also insulted and accused an innocent member of the nobility. Mayhap a spell in the dungeons will remind you of your station!"},{"name":"STEPHANIVIEN","text":"Now, see here! The Hounds have solid evidence that these individuals are party to a serious crime. Speak with Ser Muscadain, and all will all be expl─"},{"name":"ROSTNSTHAL","text":"Ah, now we meet the rest o' the rats. If ye was wonderin' 'ow the noble wench got 'old of a trainin' bomb or cleared a route through the Vault for them bandits, then 'ere's yer answer. I reckoned they'd show their whiskers sooner or later."},{"name":"HILDA","text":"You're sworn to protect Ishgard, and you choose to throw your lot in with this highborn dolt? Ser Aymeric's fightin' to keep the city from tearin' itself apart! Why don't you just stab a blade in his back, while you're at it?"},{"name":"MELISIE","text":"Hmph. The time for empty bravado has passed, child. We are not common savages─give yourselves up, and I promise you shall live to see the morrow."},{"name":"HILDA","text":"Hah, you can stick that “promise” right up your arse. That common enough for you?"},{"name":"HILDA","text":"This is over. In our authority as Ishgard's watch, we're takin' you in for the crimes of larceny, insurgency, and general bloody idiocy!"},{"name":"HILDA","text":"That went well.<br>...Wait, where's the noblewoman?"},{"name":"ROSTNSTHAL","text":"Bah, the wench must've slipped away while we was in the thick of it. She can't 'ave gotten far!"},{"name":"STEPHANIVIEN","text":"There! She flees towards the Arc!"},{"name":"HILDA","text":"<span class=\"highlight\">Forename</span>!?<br>Come on, you lot! After her!"},{"name":"MELISIE","text":"Aid, ser knight! I know not their grievance, but these lowborn ruffians seek to cause me harm!"},{"name":"MUSCADAIN","text":"Let us dispense with the theatrics, Baroness Melisie. After capturing your accomplice at the ceremony, it was surprisingly easy to prise free the details of your plan."},{"name":"MELISIE","text":"You have sided with these...these common curs!? I'd thought you a proud member of the nobility! As one of the chosen few, how can you countenance any act that places power in the filthy hands of the Brume-born!?"},{"name":"MUSCADAIN","text":"The chosen few? An accident of birth allowed us the privilege to fight for our nation, and I for one welcome our new comrades-in-arms. Your actions brand you an enemy of Ishgard, and you will pay for your crimes!"},{"name":"MELISIE","text":"This is blasphemy─I am an inquisitor! You betray your bloodline, and thus it falls to me to excise the corruption seeping into our nation's veins!"},{"name":"MUSCADAIN","text":"...It is finished."},{"name":"MUSCADAIN","text":"The baroness and her cronies believe that none but the nobility are fit to lead Ishgard's people. They resented efforts to bring highborn and lowborn closer in standing, and 'twould seem that the Hounds' formation was too great a threat to be endured."},{"name":"HILDA","text":"All we want's a little respect and the strength to defend our home. What are they so bloody afraid of?"},{"name":"MUSCADAIN","text":"They fear the erosion of their status, and I must confess to feeling a whisper of that unreasoning terror. Had I succumbed to my jealousy and hate, I may have joined them upon their twisted path."},{"name":"MUSCADAIN","text":"But I had misjudged you. I believed you so reviled the circumstances of your birth, that you sought only to bring ruin upon Ishgard."},{"name":"HILDA","text":"Until recently, you wouldn't have been far off the mark. It was <span class=\"highlight\">Forename</span> and Ser Aymeric who convinced me that fightin' for change was a damn sight more worthwhile than addin' to the misery."},{"name":"MUSCADAIN","text":"...Indeed."},{"name":"MUSCADAIN","text":"Pray forgive the barbs I have slung at you and your Hounds, Captain. I have been blind to the courage and determination of the commonfolk, and I humbly request that the watch continue to aid us in the defense of the city."},{"name":"HILDA","text":"...You didn't deserve all the spite I spat at you, neither. I see <span class=\"emphasis\">his</span> face when I look at you, and I just can't bloody help myself. I'll try to work on that, though, eh?"},{"name":"MUSCADAIN","text":"I must go now and see to the processing of the prisoners.<br>...Be well, Sister."},{"name":"ROSTNSTHAL","text":"...Sister!?"},{"name":"STEPHANIVIEN","text":"You are siblings, then? I was unaware that you and Ser Muscadain were so closely connected."},{"name":"HILDA","text":"Left that part out, did I? Aye, he's my half-brother─born to another woman after my darlin' dad cast my mum back onto the streets."},{"name":"ROSTNSTHAL","text":"Well, that's... That ain't a thing what ye just blurt out now, is it?"},{"name":"HILDA","text":"Not summat I bring up often, no. And I don't reckon Muscadain was too keen on declarin' his relation to the Mongrel, especially after he'd inherited the old man's estate."},{"name":"ROSTNSTHAL","text":"Well, might be as ye can put that bad blood behind ye now. Better'n drownin' in it, anyroad."},{"name":"HILDA","text":"Might be as you're right, Rostnsthal."},{"name":"STEPHANIVIEN","text":"A most admirable woman you've become, my dear, not to mention a champion to the people of the Brume. It seems I was right to put that firearm in your hand."},{"name":"HILDA","text":"And I thank you for takin' that gamble. You gave me more'n just a weapon that day: you gave me control over my fate. If it weren't for you, I'd likely still be scroungin' in the street and cursin' at the sky."},{"name":"STEPHANIVIEN","text":"'Tis gratifying indeed to see how far you've come."},{"name":"STEPHANIVIEN","text":"Now, I really must return to the workshop. This mountain of commissions only grows larger the longer I neglect it...as Joye would so sharply remind me!"},{"name":"HILDA","text":"We'd best get back to the Brume, ourselves. Symme and Eudestand'll be wonderin' what's become of us."},{"name":"SYMME","text":"We did it, eh? After all that, the ceremony went smooth as a babe's backside! I wonder what our next assignment'll be..."},{"name":"EUDESTAND","text":"After seein' how them Temple Knights handled guard duty, I realized a few things the Hounds could stand to do better. A bit more trainin' and a bit more discipline, and we'll get there."},{"name":"ROSTNSTHAL","text":"Our job 'ere is finished, wouldn't ye say, <span class=\"highlight\">Forename</span>?"},{"name":"STEPHANIVIEN","text":"Thank you, <span class=\"highlight\">Forename</span>. With your and Rostnsthal's assistance, Hilda and her Hounds have carved themselves a proper place in the city. Ah, my prospectometer never steers me wrong!"},{"name":"HILDA","text":"The sword's been returned, the baroness is in fetters, and the Hounds have shown themselves a force to be reckoned with. Happy endings all round, eh?"},{"name":"ROSTNSTHAL","text":"Yer lads an' lasses was a bit rough to start with, but I can't rightly call 'em pups anymore. Ye'll do fine without us, I'd say."},{"name":"HILDA","text":"What, so you're both leavin', then? I thought you'd have a few more tricks to share..."},{"name":"ROSTNSTHAL","text":"Don't start whinin' now, lass. We've given ye the tools an' the foundation─ye can build the rest o' the bleedin' house yerself."},{"name":"HILDA","text":"Aye, that we can. Thank you..."},{"name":"ROSTNSTHAL","text":"Alright, let's not get all bloody sentimental, then. I'm off.<br>Fair winds to ye, <span class=\"highlight\">Forename</span>."},{"name":"HILDA","text":"Our thanks to you as well, <span class=\"highlight\">Forename</span>. Come back and visit when you can─I'm sure the Hounds'll have some new stories to tell!"},{"name":"SYSTEM","text":"This concludes the machinist quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “Courage Born of Fear.”"},{"name":"SYSTEM","text":"Once you have done so, the next machinist quest will be available from Stephanivien."},{"name":"HILDA","text":"Go ahead and resist us, then.<br>I bloody dare you."},{"name":"MELISIE","text":"How <span class=\"emphasis\">dare</span> you speak to me in such a manner!<br>Dispose of this lowborn filth!"},{"name":"MELISIE","text":"I'll kill you! I'll kill you all!"},{"name":"MUSCADAIN","text":"'Twould seem we are past talking.<br>Forward, Hounds!"},{"name":"MELISIE","text":"&lt;growl&gt; I will turn to heresy if I must!<br>Perish by fire and fang!"},{"name":"STEPHANIVIEN","text":"...Did she just quaff the blood of a dragon!? I'd heard the tales, but to see the transformation firsthand..."},{"name":"HILDA","text":"Can't say I expected that from an inquisitor.<br>She's lost her bloody marbles!"},{"name":"MELISIE","text":"Gahahahahaha!<br>Death to the lowborn! Death to all vermin!"},{"name":"MELISIE","text":"Gahahahahaha!<br>Burn! Burn in righteous flame!"},{"name":"MELISIE","text":"You have defiled my beloved Ishgard!<br>I will turn this city to ash!"},{"name":"ROSTNSTHAL","text":"I don't like the looks o' that fireball.<br>Better do summat, <span class=\"highlight\">Forename</span>!"},{"name":"HILDA","text":"I've got your back, <span class=\"highlight\">Forename</span>!<br>Come over to me!"},{"name":"HILDA","text":"Like a dog...in the gutter..."},{"name":"ROSTNSTHAL","text":"Should've stayed in the pub..."},{"name":"STEPHANIVIEN","text":"Blast... I must bow out..."},{"name":"MUSCADAIN","text":"Forgive me..."},{"name":"STEPHANIVIEN","text":"（★未使用／削除予定★）"}],"reward":{"gil":2500,"action":7418,"items":[{"id":20285}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":96}],"quests":[68444]},"next":[68756]},"partials":[{"type":"npc","id":"1012251","obj":{"i":1012251,"n":"Hilda","l":2300,"q":11}},{"type":"npc","id":"1012252","obj":{"i":1012252,"n":"Symme","l":2300,"q":10}},{"type":"npc","id":"1012253","obj":{"i":1012253,"n":"Eudestand","l":2300,"q":10}},{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"npc","id":"1022150","obj":{"i":1022150,"n":"Rostnsthal","l":2300,"q":4}},{"type":"action","id":"7418","obj":{"i":7418,"n":"Flamethrower","c":3038,"j":31,"t":4,"l":70}},{"type":"item","id":"20285","obj":{"i":20285,"n":"Gunner's Attire Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68444","obj":{"i":68444,"n":"Snouts Down, Tails Up","g":158,"l":"Ishgard","s":680,"f":1}},{"type":"quest","id":"68756","obj":{"i":68756,"n":"Machinists for the Morrow","g":158,"l":"Ishgard","s":800}}]}