{"quest":{"name":"Friends through Eternity","location":"Coerthas Central Highlands","id":68446,"patch":4.0,"sort":601,"icon":100671,"unlocksFunction":1,"eventIcon":71341,"issuer":1006748,"target":1006748,"involved":[1022543,1022544],"genre":150,"journal":["Ser Alberic is pondering the flow of time.","Having just heard news of Estinien's departure from Ishgard, Ser Alberic laments his aloof nature, but shows some understanding for his actions. As the topic of conversation turns to Heustienne's plight, her father, Montorgains appears. He mentions that he was recently handed a rather peculiar letter, bearing his daughter's name, that was a cry for your aid. You agree to help Heustienne once more and set off to meet her near Mare's Oath.","Heustienne, having learned to suppress the dragon blood's effect on her to an extent, greets you cheerfully, mentioning she has made a new friend. Rather surprisingly, said friend is revealed to be a young dragon named Orn Khai. Heustienne explains that you were called to aid him in his search for his father's consort, who left Eorzea and flew to the east quite some time ago. You agree to help Orn Khai and are advised by Heustienne to try asking Ser Alberic about Dravanian legends concerning areas to the east.","You tell Ser Alberic all you have learned speaking with Heustienne and Orn Khai. He notes that the priest affiliated with the Congregation of Our Knights Most Heavenly is somewhat of an authority of Dravanian legend, and says he shall talk to him on your behalf. You decide to bide your time until Ser Alberic is able to furnish you with a hint as to where to begin your search.<br><br>※The next dragoon quest will be available from Alberic upon reaching level 63."],"objectives":["Search for Heustienne at Mare's Oath.","Speak with Alberic."],"dialogue":[{"name":"ALBERIC","text":"Ah, <span class=\"highlight\">Forename</span>. Word of Estinien's disappearance from the infirmary has reached mine ears."},{"name":"ALBERIC","text":"Whilst part of me is quite capable of sympathizing with his desire to abandon the Holy See, I do wish he had said something ere his departure."},{"name":"ALBERIC","text":"But then, I suppose it is only to be expected. With Nidhogg slain, the Horde's ranks have fallen into disarray, and they are not the threat they once were. Ishgard has scant need of an Azure Dragoon."},{"name":"ALBERIC","text":"Suffice it to say, one would imagine the role of the dragoon shall similarly be forced to change, as we enter this new era of relative peace."},{"name":"ALBERIC","text":"However, whilst you may have saved Estinien from the great wyrm, my mind is yet plagued by Heustienne's internal strife. May Halone lend her the strength needed to shake free from the dragon blood's fierce grip."},{"name":"MONTORGAINS","text":"You are looking quite well, Ser Alberic. And <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>! 'Tis a pleasure to see you too."},{"name":"ALBERIC","text":"Lord Montorgains! <span class=\"highlight\">Forename</span> and I were just speaking of your daughter."},{"name":"MONTORGAINS","text":"That daughter of mine is in fact why I have sought you out. I was recently handed a letter by a merchant that had passed through the Chocobo Forest; if his word is to be believed, he was entrusted with this message by Heustienne herself."},{"name":"MONTORGAINS","text":"The letter was a call for help. <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, she bade you search for her."},{"name":"ALBERIC","text":"By the Fury, has she been set upon by heretics once more!?"},{"name":"MONTORGAINS","text":"Alas, there was no more information in her message. Oh, not a day goes by that I do not pray for her safe return..."},{"name":"ALBERIC","text":"<span class=\"highlight\">Forename</span>, I must ask that you take up your lance once more to aid your fellow dragoon. Are you willing?"},{"name":"MONTORGAINS","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. Heustienne awaits you in the Dravanian forelands. Please, help her with whatever she requests."},{"name":"ALBERIC","text":"I entrust you with keeping Heustienne from harm. Head to the forelands and inquire as to her plight."},{"name":"HEUSTIENNE","text":"<span class=\"highlight\">Forename</span>!"},{"name":"HEUSTIENNE","text":"So the letter reached my father. I am sorry for having you journey so far just to meet me. As you well know, I cannot return to Ishgard in my current condition."},{"name":"HEUSTIENNE","text":"That said, the blood's hold on me is not as firm as it once was. This is largely thanks to a new ally of mine. His help has been invaluable in learning to control the dragon within."},{"name":"HEUSTIENNE","text":"In fact, I have a mind to introduce him to you. Orn Khai, <span class=\"highlight\">Forename</span> is arrived!"},{"name":"ORNKHAI","text":"It is an honor to meet you, hero of men. Much have I heard of you from my father. He would often talk of the warrior that boasts the strength of a dragon."},{"name":"HEUSTIENNE","text":"Orn Khai has been a great friend ever since he first came across me suffering from the blood's effects. I very much doubt I would be capable of standing here exchanging words with you were it not for his help."},{"name":"HEUSTIENNE","text":"I called you here in order to repay my debt to him. Orn Khai, tell <span class=\"highlight\">Forename</span> what troubles you."},{"name":"ORNKHAI","text":"Yes, thank you. Long before I came into this world, in the age when man and dragon were at peace, my father had a consort."},{"name":"ORNKHAI","text":"But the Dragonsong War tore them asunder. Father belonged to Hraesvelgr's brood, as do I, but his consort was part of Nidhogg's."},{"name":"ORNKHAI","text":"When Nidhogg demanded vengeance for the wrongs committed against him and Ratatoskr, Father asked his consort to fly far to the east."},{"name":"ORNKHAI","text":"She bore no ill will towards man, and while she wanted nothing more than to stay by Father's side, she accepted his request and fled the conflict."},{"name":"ORNKHAI","text":"However, your valiant actions have since put an end to the Dragonsong War. I am positive Father's consort will return if we inform her of the war's conclusion!"},{"name":"HEUSTIENNE","text":"Orn Khai requires your aid to search for his father's consort and bring her back home. However, as she left Dravania some thousand summers past, locating her shall be far from an easy task."},{"name":"HEUSTIENNE","text":"Under normal circumstances, I would help Orn Khai myself. But while I am somewhat recovered, I am yet far from being in complete control."},{"name":"HEUSTIENNE","text":"This is why I summoned you, <span class=\"highlight\">Forename</span>. Your knowledge of the realm is unparalleled. I beg of you, aid Orn Khai in his search!"},{"name":"ORNKHAI","text":"You have my sincerest thanks, <span class=\"highlight\">Forename</span>!"},{"name":"HEUSTIENNE","text":"Thank you, <span class=\"highlight\">Forename</span>. I owe you a debt of gratitude once more. Regrettably, whilst we know she is somewhere to the east, we are entirely ignorant as to the consort's precise whereabouts."},{"name":"HEUSTIENNE","text":"I would suggest you first try asking Ser Alberic about Dravanian legends, specifically those concerning dragons in the East. Pray report back to me once you have learned something you deem pertinent."},{"name":"HEUSTIENNE","text":"See if Ser Alberic knows aught of Dravanian legends concerning the East. Pray report back to me once you have learned something pertinent."},{"name":"ORNKHAI","text":"Father often remarked that you would have made a fine Dravanian!"},{"name":"ALBERIC","text":"Glad to see you safely returned! Were you able to locate Heustienne?"},{"name":"ALBERIC","text":"Hmm, I see. She is correct to surmise that formidable dragons are oft made the subject of local legend."},{"name":"ALBERIC","text":"I shall discuss this with the Congregation priest. I have known him to be quite an authority on Dravanian legends."},{"name":"ALBERIC","text":"Although, to think that a dragoon once gripped by the sole desire to slay dragons should now wish to help one. 'Tis a queer new world indeed that we inhabit, though not one I dislike."},{"name":"ALBERIC","text":"But that matters not. I shall seek out the priest at once and raise your query with him. Pray return anon and I shall impart my findings unto you."},{"name":"SYSTEM","text":"The next dragoon quest will be available from Alberic upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1327,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":23}],"questsType":"all","quests":[67231,67895]},"next":[68447]},"partials":[{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"npc","id":"1022543","obj":{"i":1022543,"n":"Heustienne","l":2000,"q":2}},{"type":"npc","id":"1022544","obj":{"i":1022544,"n":"Orn Khai","l":2000,"q":2}},{"type":"quest","id":"67231","obj":{"i":67231,"n":"Dragoon's Fate","g":150,"l":"Coerthas Central Highlands","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68447","obj":{"i":68447,"n":"Drowsy Dragons","g":150,"l":"Coerthas Central Highlands","s":630,"f":1}}]}