{"quest":{"name":"Sights of Crimson and Dawn","location":"Rhalgr's Reach","id":68456,"patch":4.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1019464,"target":1019464,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"ULGERIRONHEART","text":"Hm? That there is a sightseeing log, unless I'm mistaken. Do you perchance know a woman named Millith?"},{"name":"ULGERIRONHEART","text":"Hah, what are the odds! Millith is my niece, lest you wonder, and she has told me much and more about you in her letters."},{"name":"ULGERIRONHEART","text":"Ah, but where are my manners? Ulger Ironheart, at your service. I'm an explorer like most of the clan, and my niece bade me share with you such knowledge I have accumulated. Here, lend me your log."},{"name":"ULGERIRONHEART","text":"Let's see now... Definitely there...and there...and there...and <span class=\"emphasis\">there</span>! Yes, that ought to suffice."},{"name":"ULGERIRONHEART","text":"My explorations have taken me far and wide, but dearest to my heart are the regions of Ala Mhigo, beauteous in their ruggedness, and the lands of the Far East, glorious in their diversity."},{"name":"ULGERIRONHEART","text":"There are many wondrous sights to be seen in these places, and I've written down the directions to them. Some will prove more difficult to reach than others, but if you're even half as resourceful as Millith says you are, I'm confident that you will find them all."},{"name":"ULGERIRONHEART","text":"And with that, I shall leave you to resume your adventures. Go forth, my friend, and take in such breathtaking vistas as even my father, the great Roddard Ironheart, could not see in his lifetime!"},{"name":"SYSTEM","text":"Stormblood entries have been added to your sightseeing log!"},{"name":"SYSTEM","text":"You must be level 60 or above to record Stormblood vistas. Travel to the location indicated and fulfill the necessary conditions and you will complete the entry for that vista, earning experience points in the process."},{"name":"SYSTEM","text":"Use your wits and the notes provided by Ulger to identify these stunning sights and the proper way to appreciate them, and see Ala Mhigo and the Far East as only the greatest explorers have seen them!"},{"name":"ULGERIRONHEART","text":"In my capacity as an explorer, I must inform you that the lands beyond are fraught with danger. If you mean to venture forth, you'd best have the means to protect yourself."},{"name":"SYSTEM","text":"In order to undertake this quest, you must be a Disciple of War or Magic."}],"reqs":{"jobs":[{"lvl":60,"id":1}],"questsType":"all","quests":[65698,67985]}},"partials":[{"type":"npc","id":"1019464","obj":{"i":1019464,"n":"Ulger Ironheart","l":2403,"q":1}},{"type":"quest","id":"65698","obj":{"i":65698,"n":"A Sight to Behold","g":92,"l":"Gridania","s":200,"f":1}},{"type":"quest","id":"67985","obj":{"i":67985,"n":"A Haven for the Bold","g":6,"l":"Rhalgr's Reach","s":40}}]}