{"quest":{"name":"The Orphans and the Broken Blade","location":"The Dravanian Forelands","id":68453,"patch":4.0,"sort":650,"icon":100670,"unlocksFunction":1,"eventIcon":71341,"issuer":1022885,"target":1022953,"involved":[1012076,1022886,1022887,1022888,1022889,1022891,1022892,1022893,1022897,1022898,1022899,1022900,1022901],"genre":157,"journal":["Sidurgu is about to make a suggestion he will immediately regret.","Myste remains inconsolable, unable to turn his thoughts from Lowdy and her plight. And so, in a fit of what can only be described as temporary insanity, Sidurgu has proposed that you return to Moghome. Apparently he hopes that the fresh air and the quiet might cheer the boy. Alternatively, he may long to punch a moogle in its furry little face.","After sparing a moment to put the fear of the gods into Moggie, Sidurgu suggests you go and look for Myste, who has wandered off somewhere to take in these familiar sights.","Myste stares out at the endless expanse and speaks of loss, which we know all too well. So, so many friends and loved ones. Close your eyes and you can see them pass, one by one, in solemn procession. A lesser <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> would be tempted to forget, but we know better.","After reflection, Myste is ready to resume his search, and so Sidurgu declares it time to leave Moghome and never, ever return. Rielle, however, is unwilling to say good-bye, and over Sidurgu's protestations she takes Myste and heads north. Needless to say, you cannot abandon them to the wilderness and the three-headed goobbues that may be wandering about.","Well, at least Sid got to enjoy a spot of revenge by severely beating a few moogles half to death. Rielle and Myste are nowhere to be found; Sidurgu suggests you head directly to Asah while he circles around in case they strayed from the road.","You find the two children in a familiar place: the clearing where you and Sidurgu once fought a party of moogles who had pretended to kidnap Rielle for questionable reasons. Myste listens intently as Rielle tells him of how the dark knight loved and admired Ser Ompagne, his former master and caretaker, and when Sidurgu at last arrives, Myste asks him if he would like to see the fallen knight again. Sidurgu tells him yes, too late realizing the boy's intentions, and moments later you are confronted with another memory given form...","Sidurgu has long wondered why Ser Ompagne chose to adopt Fray and Sid, two orphan children, and train them as dark knights. After a spirited test of strength, the conjured memory reveals the truth that Sid has always known deep within his heart: that the former Temple Knight saw in him and Fray a chance to redeem himself for the countless young boys who fought and died under his command. A chance to create a lasting legacy and ensure that the world would be a better place for him having been in it. A chance for...forgiveness.","Now comes your part<br>To cloak yourself in the fiction<br>To breathe life into the dead<br>To give words to the voiceless<br><br>Mark well this moment, for <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> will learn from it...","The abyss is ours again, but again the boy holds back. Again he apologizes profusely. To his credit, Sid shows remarkable restraint, though that may be solely due to the many injuries inflicted upon him by Ser Ompagne...","As feared, Sidurgu will require some time to recover from his wounds. So poor is his condition that he is not even fit to make the journey back to Ishgard. Alas, this means that he must enjoy the company of the moogles at Moghome for the foreseeable future. But all is not lost─he did give you leave to punch a moogle for him.<br><br>※The next dark knight quest will be available from Myste upon reaching level 68."],"objectives":["Rendezvous with Sidurgu at Moghome.","Search for Myste.","Speak with Sidurgu.","Follow Sidurgu.","Search for Rielle.","Use Souleater to consume the swirling abyss.","Speak with Sidurgu."],"dialogue":[{"name":"MYSTE","text":"She knew it was false...yet it still had power over her. Can there be truth in a lie...and perhaps salvation as well...?"},{"name":"RIELLE","text":"They found comfort in seeing the dead. They had so much to say to them. But I...I don't know what I could say to her..."},{"name":"SIDURGU","text":"&lt;yawn&gt; <span class=\"highlight\">Forename</span>. I imagine you'd like to get back to it, and so would I. Unfortunately, Myste remains inconsolable."},{"name":"SIDURGU","text":"His failure with Lowdy, such as it was, weighs on his mind. He's afraid of repeating the same mistake with others."},{"name":"SIDURGU","text":"And so...for lack of a better idea...I'm thinking it's time to pay another visit to those furry little shites in the Churning Mists."},{"name":"RIELLE","text":"What? But why? I can't imagine Myste helping a moogle."},{"name":"SIDURGU","text":"My master used to take me to places like Moghome when the city became too much. The fresh air, the quiet, the isolation..."},{"name":"SIDURGU","text":"...And yes, I have not forgotten how the moogles helped Rielle and me when we were moody and brooding. Though I would argue that we reconciled in spite of their intervention, not because of it."},{"name":"RIELLE","text":"Whatever you say, Sid. Whatever you say..."},{"name":"MYSTE","text":"...Don't worry. I haven't given up yet. How could I? You wouldn't."},{"name":"RIELLE","text":"It's good to see you again, Moggie. I hope you and your friends haven't been getting into too much trouble..."},{"name":"MOGGIE","text":"Oh, you know Moggie! Trouble follows me wherever I go, kupo!"},{"name":"SIDURGU","text":"Right, then. Water under the bridge. No need for poms to be torn from heads and shoved down throats. Yet."},{"name":"SIDURGU","text":"Our Myste is taking in the sights, I believe. Why don't you join him?"},{"name":"SIDURGU","text":"I don't know why they're so afraid of me. It's not as though I threatened to kill every last one of them and burn their village to cinders. Not recently, at least."},{"name":"MYSTE","text":"The wind in your hair, the sun on your face... Here you can immerse yourself in the beauty and the calm, and forget the horrors. Almost."},{"name":"MYSTE","text":"How far we have come, you and I. The others, they hesitate...but you understand the obligation. The duty. The need for atonement."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"For what do you need to atone?"},{"name":"A1","text":"What happened to you?"},{"name":"MYSTE","text":"We have lost...so, so much. So many friends and loved ones. So many moments. We thought we could keep and preserve them...but we are left with anguish in the end."},{"name":"MYSTE","text":"Time strips us of even this bitter remainder, if we let it. But I cannot. This pain, this sadness...it is mine to bear. Mine alone. This I understand now."},{"name":"MYSTE","text":"Their grief will be mine, and in return I will give them peace. But who and when and where, that is the question. Even we have our limits..."},{"name":"MYSTE","text":"Who did I lose? Everyone. No one. We have always been apart, have we not?"},{"name":"MYSTE","text":"Perhaps one day you will understand...and then you will share my loathing and contempt."},{"name":"MYSTE","text":"Oh! Forgive me, I...I have been away from the others too long. Sid will be worried. We must return to them at once!"},{"name":"MYSTE","text":"Is Sid upset? I'm not sure, but I think I heard him grinding his teeth..."},{"name":"RIELLE","text":"Did you and Myste have time to talk?"},{"name":"MOGGIE","text":"Kupopo? Is this another one of your friends?"},{"name":"SIDURGU","text":"There you are. I trust Myste has had ample time to reflect upon his mistake?"},{"name":"MYSTE","text":"I have. I am ready to resume my search for those I might help with my power. Difficult though it may be, I do not intend to give up."},{"name":"SIDURGU","text":"Glad to hear it. In that case, there's no need to remain here any longer. I say we leave this accursed place and never return."},{"name":"RIELLE","text":"Don't be silly, Sid. I say we show Myste more of the Churning Mists. We did come all this way, you know."},{"name":"RIELLE","text":"Come on─there's a place I'd like to show you..."},{"name":"SIDURGU","text":"Now wait just a godsdamned moment! You can't go running off on your own like that! You'll get eaten by a three-headed goobbue! Rielle!? Rielle!"},{"name":"SIDURGU","text":"Bugger me with a bleeding... &lt;sigh&gt; Come on, they cannot have gone far. Watch out for belligerent Dravanians and mischievous moogles..."},{"name":"SIDURGU","text":"...Don't give me that look. If the little bastards didn't want their heads caved in, they shouldn't've tried to sneak up on me. Besides, they're still alive. You ought to give me credit for holding back."},{"name":"SIDURGU","text":"Anyway, I lost sight of the children. I'm not sure which way they went."},{"name":"SIDURGU","text":"I'll head north and circle back towards Asah. You head straightways there."},{"name":"MYSTE","text":"Rielle tells me she has rather fond memories of this place..."},{"name":"RIELLE","text":"...You should have seen the look on Sid's face when the moogles started singing and dancing. He was utterly speechless!"},{"name":"MYSTE","text":"Um...why were the moogles singing and dancing again?"},{"name":"RIELLE","text":"It was stupid, really, but...I guess you could say that Sid had become obsessed with trying to live up to his master's example. And for all the wrong reasons."},{"name":"RIELLE","text":"He lost his family when he was younger than me. Ser Ompagne took care of him, and Fray, but then they died too. So it's just the two of us now..."},{"name":"RIELLE","text":"He was angry and shortsighted, but now...well, he's still both those things...but not as much as before. So that's progress, I suppose."},{"name":"MYSTE","text":"Sid's master was very dear to him, wasn't he..."},{"name":"SIDURGU","text":"Oh, thank the gods. You shouldn't have run off like that."},{"name":"MYSTE","text":"Do you wish to see him again? Your master?"},{"name":"SIDURGU","text":"Huh? Where is this coming from? What has Rielle been telling you? I mean...there is much I wish I could have asked him before he passed, but─"},{"name":"SIDURGU","text":"Wait, no! Don't you dare, you little shite!"},{"name":"OMPAGNE","text":"(-???-)Oh Sid. Charming as ever, I see."},{"name":"SIDURGU","text":"Master!"},{"name":"OMPAGNE","text":"And this must be Fray's successor. A worthy one, I have no doubt. My name is Ompagne, and it is an honor and a pleasure to meet you, <span class=\"highlight\">Forename</span>."},{"name":"OMPAGNE","text":"You did well to come so far on your own before meeting Sid. And together, you have both grown so much, in mind and body and soul. As dark knights, and as true heroes."},{"name":"OMPAGNE","text":"There was a time when I was hailed as a hero too. For deeds meritorious in the defense of Ishgard and in the name of the Fury..."},{"name":"OMPAGNE","text":"A brave and true Temple Knight, I was. Slayer of countless Dravanians. A commander beloved of and respected by his men. They would follow me into the seventh hell..."},{"name":"OMPAGNE","text":"...And indeed, that is where I led them. Time and time again. They would fall, and I would earn the accolades. And then they would give me more green boys with dreams of glory."},{"name":"OMPAGNE","text":"Green boys with red blood, spilled on white snow.<br>Again and again and again..."},{"name":"OMPAGNE","text":"And then, one day, I couldn't...I couldn't remember the first one's face. I had forgotten the face of the first boy who gave his life for me..."},{"name":"OMPAGNE","text":"That was the day I left the Temple Knights."},{"name":"SIDURGU","text":"I know that tale by heart...but not the tale of what came after..."},{"name":"SIDURGU","text":"Why a goodly man with titles and wealth, a man who could have lived out his days in quiet comfort...why that man chose instead to walk the path...and to once more accept two children into his care..."},{"name":"OMPAGNE","text":"Aye, you asked me that very question long ago, and I told you that one day you would understand...when you were older and wiser and stronger..."},{"name":"OMPAGNE","text":"Shall we put you to the proof, Sid, and see if today is that day?"},{"name":"SIDURGU","text":"&lt;sigh&gt; You always were fond of your tests."},{"name":"OMPAGNE","text":"Now, now, don't be cross. You've only yourself to blame. These are your memories, remember? Hah, but of course you do..."},{"name":"OMPAGNE","text":"The point is, deep down, you wanted this. And while there's no substitute for the genuine article, you could do a lot worse."},{"name":"OMPAGNE","text":"So do me this honor─all of you! One last dance with the dead. Show me the man you have become, Sidurgu of the Obsidian Heart!"},{"name":"OMPAGNE","text":"Well done, <span class=\"highlight\">Forename</span>. Well done indeed... Fray would be proud to know that you carry on his legacy...and mine..."},{"name":"OMPAGNE","text":"And Sid...Sid, my boy. My beloved boy. You nearly had me─"},{"name":"SIDURGU","text":"Oh, spare me your sympathy, you bloody shade. I lost, and that's the end of it."},{"name":"OMPAGNE","text":"You kept Rielle and <span class=\"highlight\">Forename</span> out of harm's way, Sid. You did well. Learn to shut up and take the compliment."},{"name":"OMPAGNE","text":"You asked me once why I chose to walk the path. Why I chose to look after you and Fray, even though, deep down, you already know. But, since I lost, I owe you the answer from my lips."},{"name":"OMPAGNE","text":"I was angry. Angry with the Temple Knights, angry with myself, angry with this twisted world where good men die for nothing. I was seeking justice for my boys...and forgiveness for my sins."},{"name":"OMPAGNE","text":"I saved lives and punished the wicked, and for a time, that was enough. But nothing lasts forever, does it? And a man ought to have a legacy..."},{"name":"OMPAGNE","text":"...I failed my boys as a Temple Knight, but you two were my second chance."},{"name":"OMPAGNE","text":"I would teach you everything I knew, everything I learned from my mistakes so you wouldn't have to make them. I would send you out into the world to do great things and maybe, maybe...it would all balance out..."},{"name":"OMPAGNE","text":"Well. That's all I have to say about that. You know what comes next, don't you?"},{"name":"OMPAGNE","text":"...Though I suppose I ought to give <span class=\"emphasis\">you</span> a word of advice before I disappear in a puff of smoke. I am your predecessor's master, after all."},{"name":"OMPAGNE","text":"People like us will never know peace. Every moment brings us closer to death─those of our enemies, our loved ones, and yes...our very own."},{"name":"OMPAGNE","text":"The fear of death is what keeps most men alive. That dread, that desperation to escape the inevitable, if only for a little longer."},{"name":"OMPAGNE","text":"But we are not like most men. We have seen what awaits us beyond the abyss. We have tasted that despair, bathed in that oblivion. We have wept rivers for our dead and cursed the gods for their cruelty."},{"name":"OMPAGNE","text":"That is our sword and our strength, and that is why you may one day stand above us all. May the gods have mercy on your soul."},{"name":"OMPAGNE","text":"Take care, Sid. Be nicer to the girl. And try to be less of a chocobo's arse."},{"name":"SIDURGU","text":"Oh, for the love of..."},{"name":"MYSTE","text":"They weren't supposed to fight..."},{"name":"SIDURGU","text":"For an illusion, that bastard hit awfully hard... Reclaim your aether so we can leave. I may need to visit a healer..."},{"name":"RIELLE","text":"Sid's in a bad way. I think Ser Ompagne may have overdone it a bit..."},{"name":"SYSTEM","text":"In the depths of the abyss, a flame lingers..."},{"name":"SYSTEM","text":"As the aether flows into your soul crystal once more, from the depths of the fading abyss, you hear a whisper..."},{"name":"SIDURGU","text":"Good, good... Glad to see it all worked out in the end..."},{"name":"SIDURGU","text":"As for you, Myste...I distinctly recall telling you not to do that."},{"name":"MYSTE","text":"Forgive me...had I known it would come to violence, I...I..."},{"name":"SIDURGU","text":"Don't you dare start pouting. I'm annoyed, aye, and sore all over, but it's nothing that won't heal with time."},{"name":"SIDURGU","text":"All I ask is that you promise not to do it again without warning and consent. Memories can be powerful and painful...in more ways than one."},{"name":"SIDURGU","text":"That said, he was right. I've only myself to blame. If I thought I could defeat him, I would've. But I didn't think I had a chance...and so I didn't. Ugh..."},{"name":"RIELLE","text":"His injuries are worse than I thought. We should hurry back to Moghome!"},{"name":"MYSTE","text":"For a moment I was certain he would fly into a fury... Could it be that he is grateful for the experience after all?"},{"name":"MYSTE","text":"Then...then it was not in vain. Tired and broken though he may be, he is nevertheless better for the pain, and in time...in time...we too may be..."},{"name":"MYSTE","text":"There is still hope. Redemption is not beyond us."},{"name":"RIELLE","text":"He'll heal, but I'm afraid it's going to take a while. The moogles can probably help, though Sid would have to let them─and good luck convincing him."},{"name":"MYSTE","text":"He...he will recover, yes?"},{"name":"MOGGIE","text":"On the bright side, you can't blame us for it this time!"},{"name":"SIDURGU","text":"Ugh...I'm afraid Rielle is right. I'm going to need some time to recover. I'm not fit to travel in my condition."},{"name":"SIDURGU","text":"Which means...which means...oh, gods help me, I'm going to have to stay with these furry little shites even longer."},{"name":"SIDURGU","text":"Two more times, was it? Two more times and we'll be finished with this boy's crusade. Not soon enough... &lt;sigh&gt;<br><span class=\"highlight\">Forename</span>, be a dear and punch a moogle for me, would you?"}],"reward":{"gil":2185,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":98}],"quests":[68452]},"next":[68454]},"partials":[{"type":"npc","id":"1022885","obj":{"i":1022885,"n":"Sidurgu","l":2000,"q":2}},{"type":"npc","id":"1022953","obj":{"i":1022953,"n":"Sidurgu","l":2002,"q":2}},{"type":"npc","id":"1012076","obj":{"i":1012076,"n":"Moggie","l":2002,"q":2}},{"type":"npc","id":"1022886","obj":{"i":1022886,"n":"Rielle","l":2000,"q":2}},{"type":"npc","id":"1022887","obj":{"i":1022887,"n":"Myste","l":2000,"q":2}},{"type":"npc","id":"1022888","obj":{"i":1022888,"n":"Sidurgu","l":2002,"q":1}},{"type":"npc","id":"1022889","obj":{"i":1022889,"n":"Rielle","l":2002,"q":2}},{"type":"npc","id":"1022891","obj":{"i":1022891,"n":"Myste","l":2002,"q":1}},{"type":"npc","id":"1022892","obj":{"i":1022892,"n":"Myste","l":2002,"q":2}},{"type":"npc","id":"1022893","obj":{"i":1022893,"n":"Sidurgu","l":2002,"q":1}},{"type":"npc","id":"1022897","obj":{"i":1022897,"n":"Rielle","l":2002,"q":1}},{"type":"npc","id":"1022898","obj":{"i":1022898,"n":"Myste","l":2002,"q":1}},{"type":"npc","id":"1022899","obj":{"i":1022899,"n":"Rielle","l":2002,"q":1}},{"type":"npc","id":"1022900","obj":{"i":1022900,"n":"Sidurgu","l":2002,"q":2}},{"type":"npc","id":"1022901","obj":{"i":1022901,"n":"Myste","l":2002,"q":1}},{"type":"quest","id":"68452","obj":{"i":68452,"n":"The Widow and Her Love","g":157,"l":"Coerthas Western Highlands","s":630,"f":1}},{"type":"quest","id":"68454","obj":{"i":68454,"n":"We Can Never Go Home","g":157,"l":"The Churning Mists","s":680,"f":1}}]}