{"quest":{"name":"Our Compromise","location":"Ishgard","id":68455,"patch":4.0,"sort":700,"icon":100670,"unlocksFunction":1,"eventIcon":71341,"issuer":1013969,"involved":[1013970,1019478,1019486,1022913,1022914,1022915,1022916,1022917,1022922,1022925,1023073],"genre":157,"journal":["You knew from the first that there was only one way this could end.","Sid has at last accepted that Myste is not coming back to Ishgard, and that if we are to reclaim the remainder of our stolen aether, we will need to take the initiative. Rhalgr's Reach was the last place you spoke, and so that is where we will go.","In speaking with the people of Rhalgr's Reach, we learn that Myste stayed there for a time, asking questions of a conjurer regarding aether and perhaps being responsible for the mysterious deaths of several chocobos. He's been naughty, to say the least.","Sid is unsure what to make of what we learned, though it seems fairly obvious to me what mischief the boy's been about. And you too, I hope. Anyway, it would seem that Myste was seen leaving the Reach and heading towards the Peaks. The hunt is on!","Two beasts, dead, with no discernable injuries. Now where have we heard that before? Sid finally realizes that the boy must have sucked them dry of their aether, in the same way that he stole our aether. Needless to say, he is far, far more dangerous than he appears. A pity it took you all this long to see it.","Wrong way, wrong way! He'll kill Sid and Rielle if we don't hurry!","And now, the betrayal. Myste believes that the only way we can atone for our sins is to “undo” them with his simulacra. Every life we took, every death that weighs upon our soul, he would make amends for it all with his beautiful lies. I can end this charade, godsdammit, I can end it! Now is the time! You need me! YOU NEED ME!","...So it goes. If you would not forsake me, then of course you would not forsake him. And so...neither can I. He is a fool, but he is our little fool. The little <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span> who wanted to make this cruel, twisted world a better place, futile as that is. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s going to get us killed one of these days...but what can I say? I love <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. I forgive <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. And you...","Do you recall how we came to this place? At a friend's behest, in the midst of a raging blizzard? As we drew closer the gates faded into vision, and the towering spires...the man bowed low and bade us follow him, up the winding stair, from still smoldering ruin to untouched splendor. There we found a warm home and warm hearth, and warm hearts...","At the Last Vigil, as you reflect once more on the path you have walked, you are surprised by Lord Edmont, who greets you warmly. News of your exploits is delivered to Fortemps Manor daily, and you remain always in the thoughts of the former count and his family. Though a part of him wishes that you would remain in Ishgard, he knows that your destiny leads you elsewhere, for you are still a hero. You are still a good person.<br><br>※The next dark knight quest will be available from Sidurgu once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “To Have Loved and Lost.”"],"objectives":["Gather information in Rhalgr's Reach.","Speak with Sidurgu.","Follow Sidurgu.","Search the Last Forest for Myste.","Search for Sidurgu.","Speak with Sidurgu in Ishgard.","Return to where it all began."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “A Familiar Face Forgotten.”"},{"name":"SIDURGU","text":"...Godsdammit, Myste. We're going to have to track him down and make him return the remainder of the aether he stole from you, aren't we?"},{"name":"SIDURGU","text":"He said that when this was finished, naught would remain of him. Bloody vague and ominous, to say the least..."},{"name":"SIDURGU","text":"We'll just have to press him for answers when we find him."},{"name":"SIDURGU","text":"You last saw him at Rhalgr's Reach in Gyr Abania, yes? We'll start there."},{"name":"RIELLE","text":"I'm going too, and I won't take no for an answer. Sid's gotten better, but he's a long way from fully recovered. Besides, you'll need someone else to help you do the talking. Sid's no good at it."},{"name":"SIDURGU","text":"What are you waiting for? Clearly I'm no good at making small talk, so you and Rielle will have to ask after Myste."},{"name":"RIELLE","text":"Someone here has to know something that can lead us to Myste..."},{"name":"GILOW","text":"Lot of unusual folks coming through the Reach these days..."},{"name":"GATEKEEPER02919","text":"Looking for a young boy with long blue hair, you say? Reckon I would remember someone like that if they were to come this way. And I don't."},{"name":"GATEKEEPER02919","text":"Spoke with the fella before me during the changing of the guard, as we do, and he made no mention of anyone matching that description either..."},{"name":"GATEKEEPER02919","text":"I'm not saying the boy didn't come this way, but I'd be surprised if he had. Someone would have noted his passing and told the others."},{"name":"ORELLA","text":"...Ah, yes, I remember the long-haired boy. Very curious, with many questions about the nature of aether. He conversed with one of the Adder conjurers for a time. I know not what they discussed, but from his expression I gathered it was important."},{"name":"ORELLA","text":"Very mature for his age, the boy. And somehow ethereal..."},{"name":"BREEDER02919","text":"Hm? What's that!? You're looking for that boy too, are you!?"},{"name":"BREEDER02919","text":"I was watching some birds late the other night when I hear someone skulking about behind me. “Forgive me, forgive me,” I hear him saying, before he runs off and disappears into the dark."},{"name":"BREEDER02919","text":"Then I realize it's quiet─too quiet, aye? Sleeping birds make noise, and mine ain't. 'Cause they're dead. Every last one of them. No wounds or any other obvious marks, but there they lay, like the life was sucked right out of them!"},{"name":"BREEDER02919","text":"I don't know how or why he did it, but there's no denying that he did! I demand recompense! If you find him, you bring him to me!"},{"name":"BREEDER02919","text":"Wait─are you that boy's keeper? Are you responsible for him!? 'Cause if you are, you owe me an explanation!"},{"name":"RIELLE","text":"I have a bad feeling about this. I hope Myste hasn't done something stupid..."},{"name":"SIDURGU","text":"Our inspector returns. Tell us, have you learned aught of Myste's whereabouts?"},{"name":"SIDURGU","text":"...Seen conversing with a conjurer and possibly killing chocobos? Not sure what to make of that. Though we <span class=\"emphasis\">can</span> be sure he stayed here for a time."},{"name":"SIDURGU","text":"But perhaps no longer. We learned but moments ago from Gilow here that a boy matching Myste's description was seen leaving the Reach."},{"name":"SIDURGU","text":"He is for the Peaks. And so are we."},{"name":"RIELLE","text":"They're dead. Just...dead. Like the chocobos in the story you heard."},{"name":"SIDURGU","text":"No visible injuries, no bleeding. Aye, it is as Rielle says: these beasts died for no discernable reason. Just like the chocobos that man in the Reach claims Myste somehow killed."},{"name":"SIDURGU","text":"But it doesn't add up. Other than his singular magick, Myste was utterly helpless. Unless...was he always capable of this?"},{"name":"SIDURGU","text":"...But we know the answer already. He stole your aether when we first met."},{"name":"RIELLE","text":"Even if he could do it, even if he did do it...why?"},{"name":"SIDURGU","text":"We'll ask him when we find him. And this time, you'll let <span class=\"emphasis\">me</span> do the talking."},{"name":"SIDURGU","text":"Search the east. Rielle and I will head south. We'll meet in between if we find naught, and if we do...either you will come to our aid, or we to yours."},{"name":"SYSTEM","text":"As you survey your surroundings, you observe naught out of the ordinary...but on the edge of hearing, you hear a whisper to the southwest..."},{"name":"RIELLE","text":"No... Mother..."},{"name":"SIDURGU","text":"Seven hells, I hate being right..."},{"name":"SIDURGU","text":"On your guard. Myste has shown his true colors. The aether or whatever else he took from those beasts has given him tremendous strength..."},{"name":"SIDURGU","text":"Contrary to his earlier warnings, conjuring another simulacrum wasn't the end of him. And of all the wonderful people he had to pluck from our memories, he chose Ystride de Caulignont."},{"name":"SIDURGU","text":"He knows why we're here, and this is his answer. He summoned the monster that haunts Rielle in her dreams and sends her screaming from her bed."},{"name":"MYSTE","text":"Forgive me, Sid, but you gave me no choice..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Say your name. Your <span class=\"emphasis\">real</span> name!"},{"name":"A1","text":"There is always a choice."},{"name":"MYSTE","text":"...Shall I ask you the same? Who holds the reins? Though it matters not.<br>We are complicit, you and I."},{"name":"MYSTE","text":"...No. There isn't. Not really."},{"name":"MYSTE","text":"Can you even remember why you came here? Can you even remember how many you killed? How many lives shattered, how many stories ended?"},{"name":"MYSTE","text":"Upon the surface of the crystal are carved the sins of dark knights past...and yours are beyond counting. Beyond fathoming. Without end."},{"name":"MYSTE","text":"Justice is an excuse. Nobility is a lie. Murder is murder!"},{"name":"MYSTE","text":"And though we are most definitely not without fault, it is this cruel, indifferent world which has made murderers of us all."},{"name":"MYSTE","text":"But we need suffer no longer. I sought to make these broken souls whole, one by one, when in truth the solution was much more simple."},{"name":"MYSTE","text":"A world beyond pain and suffering and anguish and despair─a world beyond death! A world in which we never need bid farewell to our dearest friends."},{"name":"SIDURGU","text":"And how many beasts will you need to <span class=\"emphasis\">kill</span> to make this world of yours? How much aether will you consume to see it through? Bloody self-righteous sophistry from a mewling whelp..."},{"name":"SIDURGU","text":"So your brilliant plan is to fill the world with simulacra of the dead, is it? And somehow that's supposed to make everyone happy?"},{"name":"SIDURGU","text":"Well, you're right about one thing, I'll grant you that. This world is brutal, uncaring, without logic or justice..."},{"name":"SIDURGU","text":"No justice but that which we make for ourselves! And I'll be damned if I give it up so you can force your illusions upon us to assuage your guilt!"},{"name":"MYSTE","text":"Did you not find comfort in your reunion with your master!? Even though you knew it was a lie, did it not help you to unburden your soul? To find a measure of peace in this madness!?"},{"name":"MYSTE","text":"I am not your enemy. Not then or now. I will not fight you. All I ask is that you leave me to do my duty."},{"name":"MYSTE","text":"It's never too late to turn back. You are still a good person.<br>You can still be...a good person..."},{"name":"MYSTE","text":"So this is your answer..."},{"name":"MYSTE","text":"Maybe you cannot accept what needs to be done. But I can. Good-bye."},{"name":"MYSTE","text":"So many broken by this world, and then by you. So, so many..."},{"name":"MYSTE","text":"Woe betide the man who stands opposed to the Weapon of Light, for death will be his reward. Death for him and his kin and all that he holds dear."},{"name":"MYSTE","text":"Woe betide the man who stands with the Weapon of Light, for death will be his reward. Death for him and his kin and all that he holds dear."},{"name":"MYSTE","text":"Like sands through the hourglass, everything we fight so desperately to protect slips through our fingers...and what remains...what remains..."},{"name":"MYSTE","text":"...Is us. Only us, and the memory of our sin."},{"name":"MYSTE","text":"To walk this path is to suffer. To sacrifice..."},{"name":"Q3","text":"(Listen to my voice. Listen to our heartbeat...)"},{"name":"A3","text":"...Justice demands no less."},{"name":"A3","text":"I tire of this charade."},{"name":"FRAY","text":"(-???-)Serve... Save... Slave... Slay... I've sins aplenty, aye, but regrets? Not so much."},{"name":"FRAY","text":"(-???-)And if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> wouldn't listen to me, the embodiment of good sense and pragmatism, then what hope could you possibly have?"},{"name":"FRAY","text":"(-???-)A house divided cannot stand, you know. This childish rebellion ends now."},{"name":"SIDURGU","text":"What in the seven hells is this!?"},{"name":"FRAY","text":"...A compromise, I suppose? Our dear friend here refused to let me take the reins, but I wasn't about to stand idly by while that imbecile tries to do...whatever it was he was trying to do."},{"name":"FRAY","text":"No hard feelings about Whitebrim, eh? Promise not to stab you in the back."},{"name":"FRAY","text":"It'll be just like old times."},{"name":"SIDURGU","text":"A dark knight needs a sword. Take mine."},{"name":"MYSTE","text":"No... No... This is wrong... This is all wrong..."},{"name":"MYSTE","text":"I offer you peace! Restitution! A chance to make amends! Do not think you are above it! Do not think that a reckoning will be postponed indefinitely!"},{"name":"FRAY","text":"When it comes, I shall welcome it with open arms..."},{"name":"FRAY","text":"But today will not be the day, and you will not be the judge!"},{"name":"MYSTE","text":"Forgive me, forgive me... I ask, I beg, I pray, but it never comes..."},{"name":"MYSTE","text":"Again they go to join the multitude in the black oblivion of the abyss..."},{"name":"FRAY","text":"Such is our lot. Such is the fate of all who are born─to suffer and to die."},{"name":"FRAY","text":"Do not seek forgiveness, for it will not ease the burden. It weighs as it should."},{"name":"MYSTE","text":"But what of the lost? Do they not deserve to live again?"},{"name":"RIELLE","text":"They do. In our hearts and our souls and our memories."},{"name":"RIELLE","text":"No one likes having to say good-bye. But it's...it's a part of life. That's what makes the time we share together so precious..."},{"name":"RIELLE","text":"You can't obsess over the mistakes of the past, or you'll lose sight of the future. Of the people still with us, who need us more than ever."},{"name":"SIDURGU","text":"The greatest strength is born of the flame in the abyss..."},{"name":"FRAY","text":"Listen to my voice. Listen to our heartbeat. Listen...<br>I forgive you. I forgive you. I forgive you..."},{"name":"MYSTE","text":"Thank you. That is...that is all I ever wanted..."},{"name":"MYSTE","text":"So...this is it. One last parting. One final farewell...after a fashion."},{"name":"MYSTE","text":"In your darkest hour, in the blackest night...think of me...and I will be with you. Always. For where else could I go? Who else could I love but you?"},{"name":"RIELLE","text":"Ah...you're back. Welcome home...?"},{"name":"SIDURGU","text":"You'll forgive us for returning to Ishgard ahead of you, I hope. I, uh...needed some time to think on everything that happened in Gyr Abania."},{"name":"SIDURGU","text":"I won't pretend to know everything you've been through in your life. A man can never truly understand what's in another's heart...and probably not their own, for that matter..."},{"name":"SIDURGU","text":"I'm pretty much rambling at this point, but...I suppose what I'm trying to say is that I'm grateful for everything you've done for me and Rielle. I like you. I respect you. And I'll always be here for you, if you need me."},{"name":"SIDURGU","text":"We're fellow walkers of the path, after all. And friends, I'd like to think."},{"name":"RIELLE","text":"I've been wondering... Myste appeared at the same time the soul crystal cracked, yes? But which happened first? And why then and there?"},{"name":"SIDURGU","text":"Damned if I know. Does anyone truly understand how soul crystals work? What matters is that the crystal and <span class=\"highlight\">Forename</span> have been made whole."},{"name":"SIDURGU","text":"That said... “A heart bleeds, a man weeps, a soul burns. Thence comes the darkness, to consume.” And few hearts have bled as much as <span class=\"alternative-container\"><span class=\"alternative\">hers</span><span class=\"alternative\">his</span></span>..."},{"name":"RIELLE","text":"Speaking of bleeding, I think your wounds have reopened. If you would sit, it would be much easier for me to tend to them..."},{"name":"RIELLE","text":"You should get some rest too, <span class=\"highlight\">Forename</span>. Not all wounds are so obvious."},{"name":"SIDURGU","text":"Out of the mouths of babes and sucklings─praise Halone! She's right, though. No need to overdo it by running off to the next battle just yet."},{"name":"SIDURGU","text":"If you must put one foot in front of the other, though, why don't you go back to where this whole damn mess began? Maybe you'll have an epiphany."},{"name":"SIDURGU","text":"Part of me can't help but think this was all a fever dream. And then I take a deep breath and feel the pain in my ribs..."},{"name":"RIELLE","text":"It's nice to dream of a world without pain and suffering. But the world is what it is, and dreams will only carry you so far. That's why we've got swords."},{"name":"EDMONT","text":"(-???-)Hm? What troubles you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>?"},{"name":"EDMONT","text":"Ah, but of course. 'Tis bitterly cold this day. At times like these, one should be warming themselves by the fire."},{"name":"EDMONT","text":"Not a day goes by without your name being spoken, you know. The soldiers and merchants often bring us news of your latest exploits. That said, to hear it from the hero <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> would be much preferable..."},{"name":"EDMONT","text":"But there would be no expectation were you to call on us. The pleasure of your company alone would be more than enough."},{"name":"EDMONT","text":"Rare though I expect it will be in the days to come... But your destiny was never to remain here, was it? Though a part of me wishes that you would..."},{"name":"EDMONT","text":"Forgive me. I find myself growing more and more sentimental in my old age...and in working on my memoirs, I have had to reflect on the darker chapters of my life..."},{"name":"EDMONT","text":"Haurchefant...lived his to the fullest...and if his story is preserved for generations to come, then I...I should be glad of it..."},{"name":"EDMONT","text":"You will always have a place here, <span class=\"highlight\">Forename</span>. For you are family. Now, go! Do not let me keep you from your labors. The world waits for none─not even you."},{"name":"SYSTEM","text":"This concludes the dark knight quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “To Have Loved and Lost.”"},{"name":"SYSTEM","text":"Once you have done so, the next dark knight quest will be available from Sidurgu."}],"reward":{"gil":2700,"action":7393,"items":[{"id":20284}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":98}],"quests":[68454]},"next":[68757]},"partials":[{"type":"npc","id":"1013969","obj":{"i":1013969,"n":"Sidurgu","l":2300,"q":10}},{"type":"npc","id":"1013970","obj":{"i":1013970,"n":"Rielle","l":2300,"q":9}},{"type":"npc","id":"1019478","obj":{"i":1019478,"n":"Gilow","l":2403,"q":3}},{"type":"npc","id":"1019486","obj":{"i":1019486,"n":"Orella","l":2403,"q":6}},{"type":"npc","id":"1022913","obj":{"i":1022913,"n":"Rielle","l":2403,"q":1}},{"type":"npc","id":"1022914","obj":{"i":1022914,"n":"Sidurgu","l":2403,"q":1}},{"type":"npc","id":"1022915","obj":{"i":1022915,"n":"Resistance Guard","l":2403,"q":1}},{"type":"npc","id":"1022916","obj":{"i":1022916,"n":"Resistance Beast Tamer","l":2403,"q":1}},{"type":"npc","id":"1022917","obj":{"i":1022917,"n":"Rielle","l":2407,"q":1}},{"type":"npc","id":"1022922","obj":{"i":1022922,"n":"Sidurgu","l":2407,"q":1}},{"type":"npc","id":"1022925","obj":{"i":1022925,"n":"Rielle","l":2407,"q":1}},{"type":"npc","id":"1023073","obj":{"i":1023073,"n":"Sidurgu","l":2407,"q":1}},{"type":"action","id":"7393","obj":{"i":7393,"n":"The Blackest Night","c":3081,"j":32,"t":4,"l":70}},{"type":"item","id":"20284","obj":{"i":20284,"n":"Abyss Armor Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68454","obj":{"i":68454,"n":"We Can Never Go Home","g":157,"l":"The Churning Mists","s":680,"f":1}},{"type":"quest","id":"68757","obj":{"i":68757,"n":"Our Closure","g":157,"l":"Ishgard","s":800}}]}