{"quest":{"name":"The Widow and Her Love","location":"Coerthas Western Highlands","id":68452,"patch":4.0,"sort":630,"icon":100670,"unlocksFunction":1,"eventIcon":71341,"issuer":1022866,"target":1022885,"involved":[1022867,1022868,1022869,1022870,1022871,1022874,1022875,1022876,1022879,1022880,1022881,1022882,1022886,1022887,1023412,1023413,1023414],"genre":157,"journal":["Sidurgu is handling his new duties with characteristic aplomb.","It would seem that you and your comrades are determined to aid Myste in his strange crusade to help anyone and everyone. Having found no one suitable during their time in Falcon's Nest, you decide to head to Tailfeather and try your luck there.","Rielle learns from the hunters that a woman named Lowdy has recently been brought to Tailfeather from Falcon's Nest as a prisoner. She is to atone for her crimes through hard labor, though rumor has it that the proctor administering her sentence has been overzealous, both verbally and physically abusing her. Needless to say, that is your job, not his, and more importantly, she may be the sort of person that Myste can help.","Fate is ever the trickster. You overhear the most pious and venerable proctor berating his charge, and when you at last lay eyes on the prisoner, you realize it is none other than the woman who led the protest against the peace conference at Falcon's Nest, and poisoned your drink, which was not very sporting at all. Dear little Myste is moved by her plight and resolves to conjure her dead husband, even though she should know it for an illusion immediately. On the bright side, it falls to you to deal with the proctor while Sidurgu spirits away the prisoner.","No one can accuse you of not giving the man a chance. Fortunately, he was foolish enough not to take it. Do be sure to wipe the blood from your boots before meeting Sid.","Lowdy smiles and speaks of all the things she wishes she could say to her dead husband, but knows she cannot. A lie, however sweet, is nevertheless a lie. At her behest, Myste dispels his magick. But she is not upset. On the contrary, she understands and appreciates his kindness. Turning to you with a newfound sense of peace, she admits she once looked on you with hatred, but no longer. Fight, if it be your will, and if the gods show you favor, then so be it. And when we are called to account, so be it.","<span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> heart knows naught but guilt. Seeks naught but forgiveness. Ware the penitent, for theirs is a compulsion all consuming.","It is done, it is done. And, in spite of Lowdy's recognition of the farce, somehow effective. Myste is nevertheless troubled, as is his wont, though at least he is grateful. And you are still a good person, apparently. That's nice.","In the wake of events in the forest, Myste seems disinclined to continue his search at this time. Once more Sidurgu must play at being a surrogate father to the two children─or at the very least, a surly older brother.<br><br>※The next dark knight quest will be available from Sidurgu upon reaching level 65."],"objectives":["Rendezvous with Rielle at Tailfeather.","Search Tailfeather for the prisoner.","Speak with the Orthodox proctor.","Search for Myste.","Use Souleater to consume the swirling abyss.","Speak with Myste.","Speak with Sidurgu."],"dialogue":[{"name":"MYSTE","text":"I knew you would understand. How could you not?"},{"name":"RIELLE","text":"For the most part, I'm happy to go along with Sid's act, but every now and then I have to remind him not to be so grim and dark."},{"name":"SIDURGU","text":"Oh, thank the gods, an adult. Rielle has been spending a lot of time with Myste─keeping him company and getting to know him and so forth."},{"name":"SIDURGU","text":"Not that there's much to know. He won't talk about his home or his past. Doesn't seem to have any interests or skills beyond conjuring elaborate illusions derived from memories."},{"name":"SIDURGU","text":"(I've no idea how he does it, either...and, more importantly, I'm not even sure how we could “take back” the aether he stole. We may have no choice but to agree to his terms. Unless you're content to carry half a soul crystal.)"},{"name":"RIELLE","text":"I can hear you whispering, you know. Myste means well, and <span class=\"highlight\">Forename</span> and I are willing to help him. Why aren't you?"},{"name":"SIDURGU","text":"I didn't say I wasn't willing. I'm still here, aren't I?"},{"name":"SIDURGU","text":"Right, then. We've found no one suitable for the boy's needs here. Rather than return to Ishgard, I say we try somewhere new. Let's head to Tailfeather."},{"name":"MYSTE","text":"This place too has seen its share of sadness..."},{"name":"SIDURGU","text":"A prisoner of the High Houses? Interesting..."},{"name":"RIELLE","text":"Life here is not easy, but it is fulfilling all the same. That said, the hunters had no personal tales of profound tragedy to share..."},{"name":"RIELLE","text":"They did, however, tell me of an outsider recently brought here from Falcon's Nest. A prisoner, actually... A woman named Lowdy."},{"name":"RIELLE","text":"She's to atone for her crimes through hard labor, but the proctor has been...zealous. He berates her constantly, and every day she bears fresh bruises."},{"name":"SIDURGU","text":"Ah, Ishgardian justice. I know it well..."},{"name":"SIDURGU","text":"If this woman is performing various chores for the hunters, then it should not be hard to find her. Come, let us look around."},{"name":"RIELLE","text":"She's lucky. At least she gets to see the sun..."},{"name":"MYSTE","text":"No one is undeserving. No one is beyond redemption. This I must believe."},{"name":"SIDURGU","text":"She must be around here somewhere..."},{"name":"RIELLE","text":"This is the place, isn't it?"},{"name":"INSPECTOR02916","text":"(-???-)Insolent child! You are not to speak unless spoken to! Is that clear!?"},{"name":"WAITRESS02236","text":"(-Penitent Prisoner-)Yes, my lord... Pray forgive me my impudence."},{"name":"INSPECTOR02916","text":"Do not play me for a fool! Your sins are beyond forgiveness! Ser Aymeric and his noble brethren may think you worthy of mercy, but I have seen your kind before. A swift death is more than you deserve!"},{"name":"SIDURGU","text":"Hmph. A swift death is more than that bastard deserves. I can't imagine what she did to deserve that kind of treatment."},{"name":"SIDURGU","text":"Hm? You know her, <span class=\"highlight\">Forename</span>?"},{"name":"SIDURGU","text":"Seven hells, she's the one that led the protest at Falcon's Nest? The one that nearly put an end to the peace conference? And she poisoned <span class=\"emphasis\">you</span>!?"},{"name":"SIDURGU","text":"Well, that explains a lot...though if you of all people can find it in your heart to forgive her─or at least forsake bloody revenge─then it's hard to look at this and call it justice."},{"name":"MYSTE","text":"Her crimes were born of desperation and despair for the husband she lost. Perhaps if the two of them were to meet again..."},{"name":"SIDURGU","text":"Don't be foolish. She knows he's dead. You'll only cause her pain."},{"name":"MYSTE","text":"Pain is all that is left to her, don't you see?"},{"name":"MYSTE","text":"How they cry in the dark, how they mourn their dead... How it festers and spreads and corrupts them thoroughly... We have seen it, we have made it─"},{"name":"SIDURGU","text":"Fine, fine! Do what you will! Conjure her husband! &lt;sigh&gt; But do not come crying to me when she curses you for your kindness..."},{"name":"SIDURGU","text":"I'll not give the hunters cause to turn their bows on us, either. Rielle, take Myste into the woods and hide. <span class=\"highlight\">Forename</span> and I will free the girl."},{"name":"SIDURGU","text":"Rather, <span class=\"emphasis\">I</span> will free the girl. She would know you at once, and might misunderstand your intentions. We cannot risk the commotion."},{"name":"SIDURGU","text":"As for your part...no one is truly outside Halone's grace, don't you think? Confront the proctor. Make him see the error of his ways. If he is a good man, then he may yet repent of his wicked ways..."},{"name":"SIDURGU","text":"If he refuses, then that is his choice to make, and he will have to accept the consequences of his actions. Doubly so if he bears steel, yes?"},{"name":"INSPECTOR02916","text":"Bah! The very sight of you fills me with murderous rage. See to your duties! I must needs cleanse myself of these impure thoughts through communion with nature. Perhaps a spot of fishing is in order..."},{"name":"SIDURGU","text":"Now's our chance!"},{"name":"INSPECTOR02916","text":"Hm? Who are you? Why do you disturb me?"},{"name":"INSPECTOR02916","text":"A concerned adventurer who objects to my treatment of a criminal? Hah! If only you knew her sins. She should have been thrown into Witchdrop."},{"name":"INSPECTOR02916","text":"Alas, the Lord Speaker in his boundless wisdom and mercy demanded that we spare the woman's life. But rest assured I will see that her every waking moment is filled with misery and scorn."},{"name":"INSPECTOR02916","text":"You presume to judge me!? A man of the church!? I will not be cowed by your threats! The Fury guide and protect me! The Fury guide and protect me!"},{"name":"POP","text":"You sense a righteous presence!"},{"name":"SIDURGU","text":"It's begun. We can but watch and see what happens."},{"name":"RIELLE","text":"I'm...I'm not sure we should be here."},{"name":"MYSTE","text":"Look! We have brought them together! We have made her whole!"},{"name":"MYSTE","text":"How she smiles, how her eyes sparkle. How beautiful, this happiness..."},{"name":"WAITRESS02236","text":"Every night I dream of your face..."},{"name":"WAITRESS02236","text":"I could've tried to stop you from going back to the front. Could've begged and screamed and cursed. But I didn't. Because I knew you'd listen. And even if you'd forgive me for it one day, I never would."},{"name":"WAITRESS02236","text":"The arrow may have missed my heart, but I've been dead for a long time.<br>All of this is just...just waiting..."},{"name":"WAITRESS02236","text":"That's what I'd tell you, Stace, if I could. And then...you'd say..."},{"name":"STACE","text":"You can't stay stuck in that moment, Lowdy. You've got to go on. You've got to forgive yourself. You've got to let me go."},{"name":"WAITRESS02236","text":"But I won't. I won't. If I do, who'll be left to remember the man you were? The soldier, the husband...I'm the only one who knows...and it's my duty to hold on to that as long as I can..."},{"name":"WAITRESS02236","text":"That's what I'd tell him if he were here...but he's not. He'll never come home to me. So please...put an end to this...whatever this witchcraft is..."},{"name":"WAITRESS02236","text":"<span class=\"highlight\">Forename Surname</span>... Was this all your doing?"},{"name":"MYSTE","text":"N-No, it was mine. Forgive me... I thought that... I wanted only to..."},{"name":"MYSTE","text":"I was wrong. I see that now. You have every right to be upset."},{"name":"WAITRESS02236","text":"It's all right, boy. It is. I appreciate your kindness, even if it was misguided."},{"name":"WAITRESS02236","text":"You too, <span class=\"highlight\">Forename</span>. I blamed you for a lot of things. Hated you so much, because...because...I don't know. Because you came back, and Stace didn't, maybe. Because you weren't him."},{"name":"WAITRESS02236","text":"They say the war's over now, but it never ends for people like you, does it?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"There's always something worth fighting for."},{"name":"A1","text":"Everything ends."},{"name":"WAITRESS02236","text":"Aye, I know what you are. I heard the stories as a child."},{"name":"WAITRESS02236","text":"Of the ones with neither shield nor sigil. Champions of the weak and the helpless, undeterred by the law of man or god..."},{"name":"WAITRESS02236","text":"Maybe, maybe not... But that's up to us, isn't it? Whether we carry it or don't. And something tells me you've not finished with it yet."},{"name":"WAITRESS02236","text":"I know what you are. I heard the stories as a child. Of the ones with neither shield nor sigil. Champions of the weak and the helpless, undeterred by the law of man or god..."},{"name":"WAITRESS02236","text":"I couldn't stop you anymore than I could've stopped Stace from walking out the door that day. So...fight, damn you. Fight, if that's what you want. Just...don't squander the time in between. There's never enough..."},{"name":"WAITRESS02236","text":"Right. I suppose I owe it to him to try and make the most of what I've got left too. So I will. Take care...and thank you."},{"name":"SIDURGU","text":"...She's gone. Reclaim your aether, <span class=\"highlight\">Forename</span>."},{"name":"MYSTE","text":"Forgive me, I was a fool. The abyss is yours, as it has always been. Consume it."},{"name":"SIDURGU","text":"I did try to warn the boy..."},{"name":"RIELLE","text":"...The proctor's punishments were nothing compared to her own guilt."},{"name":"SYSTEM","text":"In the depths of the abyss, a flame lingers..."},{"name":"SYSTEM","text":"As the aether flows into your soul crystal once more, from the depths of the fading abyss, you hear a whisper..."},{"name":"MYSTE","text":"Forgive me...forgive me... In the end, I could not make her whole."},{"name":"MYSTE","text":"So much pain, so much loss...how it fills my heart and overflows... Maybe it is indeed beyond us. Maybe it is not in our nature."},{"name":"SIDURGU","text":"...You've still got three more chances, don't you. There's no need to be so bloody melodramatic. At least not out here. We should go back to Tailfeather."},{"name":"MYSTE","text":"...Your words did more for her than my illusion."},{"name":"MYSTE","text":"She is still a good person. And so are you. I pray you both remember..."},{"name":"MYSTE","text":"She knew it was false...yet it still had power over her. Can there be truth in a lie...and perhaps salvation as well...?"},{"name":"RIELLE","text":"They found comfort in seeing the dead. They had so much to say to them. But I...I don't know what I could say to her..."},{"name":"SIDURGU","text":"On to the next, I would say, but Myste looks to be in no state to continue."},{"name":"SIDURGU","text":"Which means we'll be staying here for a time. Taking in the fresh country air, me and my...little ones. &lt;sigh&gt;"},{"name":"SIDURGU","text":"For what it's worth, I think that woman is better for what we did. Or at least as good as anyone can be after what she's been through..."}],"reward":{"gil":1223,"xp":191700},"reqs":{"jobs":[{"lvl":63,"id":98}],"quests":[68451]},"next":[68453]},"partials":[{"type":"npc","id":"1022866","obj":{"i":1022866,"n":"Sidurgu","l":2200,"q":2}},{"type":"npc","id":"1022885","obj":{"i":1022885,"n":"Sidurgu","l":2000,"q":2}},{"type":"npc","id":"1022867","obj":{"i":1022867,"n":"Rielle","l":2200,"q":2}},{"type":"npc","id":"1022868","obj":{"i":1022868,"n":"Myste","l":2200,"q":2}},{"type":"npc","id":"1022869","obj":{"i":1022869,"n":"Sidurgu","l":2000,"q":1}},{"type":"npc","id":"1022870","obj":{"i":1022870,"n":"Rielle","l":2000,"q":1}},{"type":"npc","id":"1022871","obj":{"i":1022871,"n":"Myste","l":2000,"q":1}},{"type":"npc","id":"1022874","obj":{"i":1022874,"n":"Rielle","l":2000,"q":1}},{"type":"npc","id":"1022875","obj":{"i":1022875,"n":"Sidurgu","l":2000,"q":1}},{"type":"npc","id":"1022876","obj":{"i":1022876,"n":"Myste","l":2000,"q":1}},{"type":"npc","id":"1022879","obj":{"i":1022879,"n":"Orthodox Proctor","l":2000,"q":1}},{"type":"npc","id":"1022880","obj":{"i":1022880,"n":"Myste","l":2000,"q":1}},{"type":"npc","id":"1022881","obj":{"i":1022881,"n":"Rielle","l":2000,"q":1}},{"type":"npc","id":"1022882","obj":{"i":1022882,"n":"Sidurgu","l":2000,"q":1}},{"type":"npc","id":"1022886","obj":{"i":1022886,"n":"Rielle","l":2000,"q":2}},{"type":"npc","id":"1022887","obj":{"i":1022887,"n":"Myste","l":2000,"q":2}},{"type":"npc","id":"1023412","obj":{"i":1023412,"n":"Sidurgu","l":2000,"q":1}},{"type":"npc","id":"1023413","obj":{"i":1023413,"n":"Rielle","l":2000,"q":1}},{"type":"npc","id":"1023414","obj":{"i":1023414,"n":"Myste","l":2000,"q":1}},{"type":"quest","id":"68451","obj":{"i":68451,"n":"In Memories We Walked","g":157,"l":"Ishgard","s":601,"f":1}},{"type":"quest","id":"68453","obj":{"i":68453,"n":"The Orphans and the Broken Blade","g":157,"l":"The Dravanian Forelands","s":650,"f":1}}]}