{"quest":{"name":"A New Fishing Ex-spear-ience","location":"The Ruby Sea","id":68458,"patch":4.0,"sort":104,"unlocksFunction":1,"eventIcon":71341,"issuer":1021362,"target":1023621,"genre":108,"journal":["Your body odor has caught Sumitsubo's attention."],"objectives":["Speak with the kindly Kojin."],"dialogue":[{"name":"SUMITSUBO","text":"Hmm...? &lt;sniff&gt; You smell of fish. Does this mean, then, that you're a fisher from above?"},{"name":"SUMITSUBO","text":"If you enjoy hunting fish up there, then I'm sure you would take pleasure in hunting them down here as well."},{"name":"SUMITSUBO","text":"You cannot use rods and reels underwater, though. No, you will need a spear to strike your prey swiftly and silently like the Kojin. I suppose you would call it...spearfishing?"},{"name":"SUMITSUBO","text":"Would you like a lesson in spearfishing? If you should see any of my Blue brothers outside, I'm sure they would be glad to show you how it's done."},{"name":"SUMITSUBO","text":"A hunter who smells of fish like you should take to spearfishing like Kojin to water. I'm certain my Blue brothers would be more than happy to show you how."},{"name":"KOUJIN02922","text":"You wish to hunt fish with a spear? Why, it's as easy as breathing underwater. And considering you're not blue in the face, I can tell you will master this skill in no time at all. "},{"name":"KOUJIN02922","text":"First, you will need to search for where fish gather. When you've found a suitable school of fish, steady your spear and strike with a quick and fluid thrust."},{"name":"KOUJIN02922","text":"That, in a clamshell, is the art of spearfishing. Of course, these explanations mean nothing if you have no spear to practice. Here, take one of mine."},{"name":"KOUJIN02922","text":"If you look around, you're like to find promising prey close by. Farewell, friend, and happy hunting."},{"name":"SYSTEM","text":"You are now able to obtain fish via spearfishing. In order to do so, you must first equip a spearfishing gig as your secondary tool."},{"name":"SYSTEM","text":"By using the action Fathom, you will be able to locate teeming waters as you explore the ocean."},{"name":"SYSTEM","text":"With your spearfishing gig in hand, you can interact with these teeming waters to catch fish."}],"reward":{"gil":490,"items":[{"id":17726}],"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":19}],"questsType":"all","quests":[68020,66643]}},"partials":[{"type":"npc","id":"1021362","obj":{"i":1021362,"n":"Sumitsubo","l":2409,"q":1}},{"type":"npc","id":"1023621","obj":{"i":1023621,"n":"Kindly Kojin","l":2409,"q":1}},{"type":"item","id":"17726","obj":{"i":17726,"n":"Spearfishing Gig","l":180,"c":38255,"t":99,"p":3000}},{"type":"quest","id":"68020","obj":{"i":68020,"n":"In Soroban We Trust","g":6,"l":"The Ruby Sea","s":390}},{"type":"quest","id":"66643","obj":{"i":66643,"n":"Way of the Fisher","g":146,"l":"Limsa Lominsa","s":10,"f":1}}]}