{"quest":{"name":"Dragon Sound","location":"The Azim Steppe","id":68450,"patch":4.0,"sort":700,"icon":100671,"unlocksFunction":1,"eventIcon":71341,"issuer":1022560,"target":1022562,"involved":[1022563],"genre":150,"journal":["Orn Khai is in very low spirits.","Upon approaching Orn Khai it becomes obvious that he is quite down in the dumps. He laments that he has little to show for all his years, and has been unable to uncover the source of Faunehm's rage. However, as luck would have it, it is Orn Khai's despair that allows him to see the truth─Faunehm's current state is a result of having to bear centuries of solitude. Just as he happens upon this theory, the warrior you previously met informs you that some Qestiri merchants have hired a dragon hunter. You hurry with Orn Khai to get to Faunehm before the hunter can.","As you search frantically for Faunehm, you are approached by none other than Estinien, the dragon hunter tasked with slaying Faunehm. He explains how he came to find himself in the area and agrees to lend you his aid upon hearing of your quest to reunite Orn Khai's father with his consort.","The three of you do battle with Faunehm, Orn Khai trying in vain to clear the haze that shrouds her mind, but he does succeed in alerting his father to their presence. Vedrfolnir is able to return his consort to her former self, allowing the battle to reach a peaceful conclusion.","After a millennium apart, Faunehm and Vedrfolnir are reunited at last and free once again to soar the skies above Dravania. You bid farewell to the former Azure Dragoon and your dragon ally, dreaming of future adventures.<br><br>※The next dragoon quest will be available from Alberic once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “Courage Born of Fear.”"],"objectives":["Speak with Orn Khai."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Heavens Weep.”"},{"name":"ORNKHAI","text":"Ah, <span class=\"highlight\">Forename</span>, nice to see you again... Pray forgive me, I have not made any progress in ascertaining the reason for Faunehm's rage."},{"name":"ORNKHAI","text":"It is truly pathetic... I have been alive far, far longer than you and yet have nothing to show for it."},{"name":"ORNKHAI","text":"Surely you did not think me younger than you?"},{"name":"ORNKHAI","text":"I may be small, but you should know that we Dravanians live far longer than any man!"},{"name":"ORNKHAI","text":"Wait. We <span class=\"emphasis\">do</span> live an awfully long time─<span class=\"highlight\">Forename</span>, I think I may have got it!"},{"name":"ORNKHAI","text":"Dravanians live for eons; I have heard tales from Gullinbursti of dragons going into seclusion for centuries while carrying grief in their hearts. Ultimately, they are unable to bear the strain and it breaks something fundamental within them."},{"name":"ORNKHAI","text":"Many a year will need to pass before I come of age to choose a consort, but I believe they help in saving oneself from the abyss of isolation. This is why your kind elects to marry, is it not?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We marry for love."},{"name":"A1","text":"We marry to save our race from extinction."},{"name":"A1","text":"I have no idea why anyone marries."},{"name":"ORNKHAI","text":"Love? That sounds fairly similar to our reason for choosing a consort."},{"name":"ORNKHAI","text":"Wait, do you mean to say you require <span class=\"emphasis\">two</span> of your race to mate!? It is a wonder you have not gone extinct considering the brevity of your lives. It is so much simpler for dragons─only one of us is required to lay our eggs!"},{"name":"ORNKHAI","text":"Truly? I had considered you more worldly than that, but it seems I was wrong."},{"name":"ORNKHAI","text":"Regardless, I am almost certain that Faunehm's fury was caused by the profound loneliness she has endured over this past millennium. Leaving Father's side after they spent so long together must have caused her intense anguish. The question is, how do we heal her pain?"},{"name":"ORONIRWARRIOR","text":"I see you two survived your talk with the dragon. Was it as fruitful a discussion as you had hoped for?"},{"name":"ORONIRWARRIOR","text":"Not that it matters much. A group of Qestiri merchants have pooled their resources and hired a hunter said to be quite handy with a lance. I've my doubts he's capable of slaying the wyrm, but that doesn't mean I'm not going to watch him try."},{"name":"ORNKHAI","text":"I wonder who the dragonslayer in question could be. I struggle to imagine there are that many men with the skill to go toe-to-toe with a dragon like Faunehm..."},{"name":"ORNKHAI","text":"However, if he is truly a threat, then we cannot risk him reaching her before us. We may not have a plan, but we have little choice. Come, <span class=\"highlight\">Forename</span>, let us hurry to where we last saw Faunehm!"},{"name":"ORNKHAI","text":"Wh-Where is she? We must find her before that hunter does!"},{"name":"ESTINIEN","text":"(-???-)'Tis good to see you again, Warrior of Light."},{"name":"ESTINIEN","text":"It would seem that we two Azure Dragoons share one target. Though I suppose neither of us still hold that mantle─old habits do not die so easily."},{"name":"ORNKHAI","text":"The Azure Dragoon of Ishgard!?"},{"name":"ESTINIEN","text":"And who exactly is your diminutive friend, <span class=\"highlight\">Forename</span>?"},{"name":"ESTINIEN","text":"A journey to the Far East in search of an ancient wyrm's consort? Quite a tale indeed."},{"name":"ESTINIEN","text":"At the end of my own journey, I chose to continue my travels and eventually found myself in the Far East. It was here that word of the dragon you seek reached mine ears."},{"name":"ESTINIEN","text":"After seeing the future of the Holy See placed in Ser Aymeric's capable hands, I chose to embark upon my own journey. One that would allow me to rediscover my purpose, now that Ishgard no longer has need of an Azure Dragoon. It was during my travels that I came to learn of the dragon you seek."},{"name":"ESTINIEN","text":"It had been my intention to act as an intermediary between man and dragon, assuming the beast could be reasoned with. If not, I was prepared to brandish my lance."},{"name":"ESTINIEN","text":"Regardless, I would wager that the young one has the right of it. What is more, she is doubtless still suffering from the effects of Nidhogg's hateful dirge that summoned the Horde."},{"name":"ESTINIEN","text":"The dread wyrm's hold over his brood was absolute. His unquenchable thirst for vengeance spread through the Horde, leaving none untouched. To think one of them was able to resist his call to decimate Ishgard..."},{"name":"ESTINIEN","text":"It should come as no surprise that she would succumb to madness; the wyrm spent a millennium in solitude resisting Nidhogg's demands for vengeance."},{"name":"ESTINIEN","text":"I can think of but one way she may be saved: we weaken her enough that she is willing to listen to reason."},{"name":"ORNKHAI","text":"We have already tried that approach! It did not work last time and I very much doubt repeating it will change anything."},{"name":"ESTINIEN","text":"I do not advocate the same approach, little one. I would have you do more than simply talk to her, nay, you shall use your roar. That is the only way you can hope to let her know the war is ended, that her consort awaits her in the skies above."},{"name":"ORNKHAI","text":"My roar?"},{"name":"ESTINIEN","text":"You have the two dragoons that bested Nidhogg at your side─there is naught to fear. All you need do is harness your roar to clear the haze that clouds the wyrm's eyes."},{"name":"ORNKHAI","text":"I-I shall do my best. Should we fail again, I fear we may not be blessed with another chance. Pray lend me your strength, Azure Dragoons."},{"name":"ESTINIEN","text":"Let us depart. The frenzied dragon awaits us on Bardam's Mettle─the time is nigh to free her from war's tragedy!"},{"name":"ESTINIEN","text":"With me!"},{"name":"ESTINIEN","text":"Now, little one! Roar with all your being!"},{"name":"ORNKHAI","text":"Faunehm, hear my cry!"},{"name":"FAUNEHM","text":"Why? Why must we go to war...? I have no ill will, no desire to fight..."},{"name":"FAUNEHM","text":"I have...only silence... A most deafening silence..."},{"name":"ORNKHAI","text":"It is no use! I cannot reach her!"},{"name":"VEDRFOLNIR","text":"Do not be so quick to abandon hope, my son!"},{"name":"VEDRFOLNIR","text":"I am come for thee, dearest Faunehm."},{"name":"FAUNEHM","text":"Those wings of white... Long have they filled my dreams... Vedrfolnir, my love..."},{"name":"ORNKHAI","text":"Father..."},{"name":"VEDRFOLNIR","text":"Noble dragoons, Orn Khai. I give you my thanks. Were it not for your succor, I would not have been reunited with my beloved."},{"name":"FAUNEHM","text":"Allow me to thank you as well. I had truly thought Vedrfolnir lost to me. Mere words will scarce be enough to convey mine appreciation."},{"name":"FAUNEHM","text":"When the conflict began one thousand years past, Nidhogg demanded we exact vengeance upon man."},{"name":"FAUNEHM","text":"However, I refused to allow his hatred to take root within me. I could not bring myself to forget the days when I soared the azure skies with Vedrfolnir, knight on back."},{"name":"VEDRFOLNIR","text":"A dragon cannot simply shut her ears to her sire's call; to do so would cause her great torment. Thus I bid Faunehm flee to the east, that she might live in peace until the final strains of the Dragonsong War did fade to an end."},{"name":"VEDRFOLNIR","text":"Duty-bound to protect Zenith, I remained behind in Dravania. But ever did I regret not following my heart─and my beloved. 'Twas after she left for eastern lands that thou didst come into this world, my son."},{"name":"ORNKHAI","text":"Now I finally see why I was given a name meaning “one born of sadness.”"},{"name":"ORNKHAI","text":"Alas, I fear I will never be your match, Father. Faunehm barely even noticed my roar..."},{"name":"VEDRFOLNIR","text":"Belittle not your efforts, Orn Khai. I should not have known to come here were it not for thy roar. It reached mine ears, strong and clear, as I soared the skies above."},{"name":"ORNKHAI","text":"Father..."},{"name":"ORNKHAI","text":"Ahem. Well, I suppose you are quite keen to talk with Faunehm. It's been quite some time since you last met, after all."},{"name":"ORNKHAI","text":"L-Let us make haste. I am not used to seeing my father so enamored..."},{"name":"ESTINIEN","text":"Not quite what I expected when I took on this job, I must admit. But it has been quite something to see what the young dragon is capable of."},{"name":"ORNKHAI","text":"I give both of you my sincerest thanks. I find myself especially indebted to you, <span class=\"highlight\">Forename</span>. Our adventures investigating these legends shall live long in my memory."},{"name":"ORNKHAI","text":"And you, Azure Dragoon. Your strength far exceeds the tales I have heard."},{"name":"ESTINIEN","text":"Your words are appreciated, but the appellation is unnecessary. I have long since left that life behind."},{"name":"ESTINIEN","text":"My past experiences with Nidhogg made me eager to see Faunehm saved."},{"name":"ESTINIEN","text":"When the dread wyrm took me as his...vessel, I felt his mad heart's palpitations as mine own. There was no end to the sadness and distress that flowed from his soul. However, it was this ordeal that allowed me to harness the dragon within, whilst retaining my sense of self."},{"name":"ESTINIEN","text":"You ought to be capable of the same by now, <span class=\"highlight\">Forename</span>. It shall doubtless serve you well in battles to come."},{"name":"ORNKHAI","text":"If you are truly done with your old title, then I have a proposal for a new one: the Crimson Dragoon. Much more befitting now that the two of you fight alongside dragons, harnessing their strength as your own!"},{"name":"ESTINIEN","text":"Hahaha... I can see myself warming up to this new name."},{"name":"ESTINIEN","text":"The best of luck to you, Orn Khai. I expect you to be as strong as your father the next time our paths do cross. Warrior of Light, I look forward to the day when we are able to fight side by side once more. Keep well."},{"name":"ORNKHAI","text":"He shall have nothing to worry about. I will become just as capable as Father so that I may someday soar the skies with a dragoon like you on my back."},{"name":"ORNKHAI","text":"Thank you once again for everything, <span class=\"highlight\">Forename</span>. It is time for me to begin the journey home with Father and Faunehm, but know that I will ever be in your debt. I sincerely hope this is not the last of our adventures!"},{"name":"SYSTEM","text":"This concludes the dragoon quests for FINAL FANTASY XIV: Stormblood. In order to undertake the next series of quests, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “Courage Born of Fear.”"},{"name":"SYSTEM","text":"Once you have done so, the next dragoon quest will be available from Alberic."}],"reward":{"gil":2400,"action":7400,"items":[{"id":20303}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":23}],"quests":[68449]},"next":[68749]},"partials":[{"type":"npc","id":"1022560","obj":{"i":1022560,"n":"Orn Khai","l":2411,"q":2}},{"type":"npc","id":"1022562","obj":{"i":1022562,"n":"Orn Khai","l":2411,"q":1}},{"type":"npc","id":"1022563","obj":{"i":1022563,"n":"Estinien","l":2411,"q":1}},{"type":"action","id":"7400","obj":{"i":7400,"n":"Nastrond","c":2589,"j":22,"t":4,"l":70}},{"type":"item","id":"20303","obj":{"i":20303,"n":"Trueblood Attire Coffer (IL 290)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68449","obj":{"i":68449,"n":"Dark as the Night Sky","g":150,"l":"Kugane","s":680,"f":1}},{"type":"quest","id":"68749","obj":{"i":68749,"n":"Gone but Not Forgiven","g":150,"l":"Coerthas Central Highlands","s":800}}]}