{"quest":{"name":"We Can Never Go Home","location":"The Churning Mists","id":68454,"patch":4.0,"sort":680,"icon":100670,"unlocksFunction":1,"eventIcon":71341,"issuer":1022892,"target":1013969,"involved":[1013970,1022889,1022890,1022900,1022902,1022903,1022904,1022905,1022906,1022907,1022908,1022909,1022910,1022911,1022912,1022953,1023859],"genre":157,"journal":["Myste has been waiting for you for a long time.","Although Sidurgu has yet to recover from his injuries, Myste will wait no longer. He wants to resume his search for souls in need of succor, and he is willing to forgo their assistance, if you are. Anything to hasten the conclusion of this mad crusade. Castrum Oriens, the site of Ilberd's grand slaughter, may offer what you seek.","Myste grows weary at the sight of so many men and women willing to give their lives in service to a greater cause. A sight that is all too familiar, perhaps. Elsewhere shall we look for listless spirits.","In the depths of a cave by a flickering fire, a man sits alone, waiting to die. Gallien, an Ala Mhigan refugee for whom you once made medicine long, long ago, reveals that he shared it with another refugee, ensuring that the man lived...and that he would not. His friend Houdart went on to fight for the Griffin and even served as his body double, but ultimately died at Baelsar's Wall with his mad master and so many others. They made their choices, and such are the consequences, but Myste cannot help but meddle. He conjures a simulacrum of Houdart to comfort the dying man, who bids his dead friend to go to Rhalgr's Reach and pray for their fallen brothers.","The shade born of Gallien's memories tells you of how he always wanted to meet you, a larger-than-life hero...unaware that he eventually did at Little Ala Mhigo. He laments his fate, wishing he could go back and convince his former self not to place his trust in the Griffin...but if such things were possible, you wouldn't have a broken shield, now would you?","You rescue Houdart and Myste from wild beasts, but though they are unharmed, the shade abruptly stumbles and grips his head. Dizziness, he claims, and nothing more, before imploring you to hurry. He is as poor a liar as the boy.","Again Houdart falters, suddenly weak and in pain. A man's memories cannot outlive him, he says, and Gallien is running out of time. He will try his best to carry on, but in the end, it is not up to him...","Look how he burns with fervor, with desperation, with faith. How he sings of his homeland and wills himself to stand. How he marshals his strength to put one foot in front of the other. In that moment he lives again.","The spell is broken. Houdart is no more, which can only mean one thing: we are one step closer to ending this charade.","<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is not the first, nor will <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> be the last to betray you. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> will implore you to see reason, to seek solace in the fiction. And when you refuse, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> will have no recourse but one. As I did not. Be ready.","The dead are forever beyond our reach, and we have no choice but to accept the inevitability that everyone we know and love will join them in time...or do we? Distraught by his failure to see Gallien's final wish fulfilled before his passing, Myste muses on the possibility of a world where time and death hold no power of us. A world you could share. You need only ask. But we know better.","Sidurgu is concerned that Myste's failure will spur him to deeper depths of depression. Even more concerning is the fact that the boy has yet to return to Ishgard, though you believed he would. Why, I do not know. The aether wanes, and he has but one chance left. Be ready, damn you. Be ready.<br><br>※The next dark knight quest will be available from Sidurgu upon reaching level 70."],"objectives":["Rendezvous with Myste at Castrum Oriens.","Search the Fringes for people in distress.","Speak with Houdart.","Follow Houdart.","Speak with Myste.","Use Souleater to consume the swirling abyss.","Pay /respect to the fallen at Bloodstorm.","Speak with Sidurgu in Ishgard."],"dialogue":[{"name":"SIDURGU","text":"I wasn't joking, by the way. About the moogle punching."},{"name":"RIELLE","text":"He'll heal, but I'm afraid it's going to take a while. The moogles can probably help, though Sid would have to let them─and good luck convincing him."},{"name":"MYSTE","text":"As you can see, Sid has yet to fully recover from his bout with Ser Ompagne, and there is no telling how much more time he will require."},{"name":"MYSTE","text":"But my quest will brook no delay. If we must seek out another soul in need of succor without their assistance, then so be it. Do you agree?"},{"name":"MYSTE","text":"Then we are of one mind. Now then, where shall we begin our search..."},{"name":"MYSTE","text":"War is perhaps the greatest source of man's misery. So much death and destruction... A battlefield, perhaps..."},{"name":"MYSTE","text":"Yes, yes... This slaughter you bore witness to at Castrum Oriens is precisely that of which I speak. A tragedy which tore apart the lives of every man and woman it touched..."},{"name":"MYSTE","text":"My mind is made up. That is where we must go."},{"name":"SIDURGU","text":"&lt;sigh&gt; If I had it my way, I'd not let you out of my sight..."},{"name":"SIDURGU","text":"But, again, it's your soul crystal at stake. I'm only here to help you reclaim your aether. If you think you can look after him by yourself, then by all means."},{"name":"SIDURGU","text":"As for me...I think I've finally regained enough strength to make the journey back to Ishgard. When you've finished in Gyr Abania, come and find us at the Forgotten Knight."},{"name":"SIDURGU","text":"Don't get cocky. The little bastard's a handful and a half."},{"name":"RIELLE","text":"Myste cares for us all, in his own way, but you most of all, I think..."},{"name":"MYSTE","text":"Castrum Oriens... How it buzzes with life. So many brave soldiers, resolved to do their duty no matter the cost..."},{"name":"MYSTE","text":"But have no doubt there will be a cost, and it will be most high, for no man is beyond the reach of fate. Death will not be denied..."},{"name":"MYSTE","text":"This place...this place...it weighs on me... Anywhere but here I would search..."},{"name":"GALLIEN","text":"Come...come to share the fire? I would stand to greet you, stranger, but my legs...my eyes...the whole of me is not what it once was..."},{"name":"GALLIEN","text":"<span class=\"highlight\">Forename</span>...I know that name, and that voice! By Rhalgr, you're still alive! Praise Him, praise Him..."},{"name":"MYSTE","text":"Who is this man on the verge of death? Is he your friend?"},{"name":"GALLIEN","text":"Nay, nay, though I am flattered that you would think so..."},{"name":"GALLIEN","text":"This <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> made medicine for me long, long ago, at the behest of Captain Meffrid...when we were still in Quarrymill."},{"name":"GALLIEN","text":"If I'd kept it all for myself, I'd've made a full recovery...but I couldn't. I had a dear friend, you see, and so I made a choice. He got better. I didn't."},{"name":"GALLIEN","text":"Ended up working for the Griffin, he did. As a right-hand man, even. But like all the rest who went to the Wall, he never came back."},{"name":"GALLIEN","text":"The irony of it, that I'd be the one to outlive them all, if only for a little while."},{"name":"GALLIEN","text":"And so I sit here and await the reckoning, as I rot from the inside out. The husk of the freedom fighter I aspired to be."},{"name":"MYSTE","text":"No, no! This is not the ending you deserve! I will not allow it!"},{"name":"MYSTE","text":"The man he spoke of, the one whose life he chose to save at the cost of his own. That man is proof of his nobility! If he were here..."},{"name":"MYSTE","text":"Do you wish to see him again? Your dear friend?"},{"name":"GALLIEN","text":"Houdart? Aye, more than anything. But there's no point in praying for the impossible. He died with the rest. I'm sure of it."},{"name":"GALLIEN","text":"He was the Griffin's double, and one of his top commanders besides..."},{"name":"GALLIEN","text":"You're a kind boy, you are, and I'm grateful for the company in these twilight hours. But there's no need to trouble yourself further. My time is nearly spent."},{"name":"HOUDART","text":"Then spend the remainder thinking of better days, Gallien, and not dwelling on the deaths of me and mine."},{"name":"GALLIEN","text":"Gods strike me down... Houdart? No, no, it can't be... This is naught more than a trick, an illusion... A lie..."},{"name":"GALLIEN","text":"But...even if it is a lie...<br>Hear me, Houdart. I've a favor to ask of you. One final favor for a dying fool..."},{"name":"GALLIEN","text":"Return to the Reach. To Bloodstorm. Offer a prayer to our brothers there."},{"name":"HOUDART","text":"I will, Gallien. You have my word."},{"name":"HOUDART","text":"We should talk. Outside."},{"name":"MYSTE","text":"I have to believe...I have to believe..."},{"name":"GALLIEN","text":"Will you go with Houdart? He has to make it. I've naught left but this..."},{"name":"HOUDART","text":"To Meffrid and Gallien, you were larger than life. I always wanted to meet you...and here we are. Though I reckon this doesn't really count, does it?"},{"name":"HOUDART","text":"If only I could go back and tell myself what a blind, bloody fool I was to place my trust in the Griffin. Maybe then Gallien wouldn't be dying alone."},{"name":"HOUDART","text":"Listen, he hasn't got much time. I'll lead the way. The wilds between here and the Reach aren't too dangerous, but as you can see, I'm unarmed, so I'll not be any good to you in a fight."},{"name":"MYSTE","text":"Nor will I, I fear. We will have to rely solely on you for protection..."},{"name":"HOUDART","text":"Heh, I've no doubt you can keep us safe. You're the bleedin' Warrior of Light, after all! Let us be off!"},{"name":"HOUDART","text":"Strong as ever, eh? Stronger even than you were that day, I reckon..."},{"name":"HOUDART","text":"They say that when the Griffin's men realized you were coming to stop them, they grew panicked and unsure. How could they take up arms against a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> hailed as the hero of Eorzea? A hero who had personally intervened in their lives for the better?"},{"name":"HOUDART","text":"Some stood their ground and died then and there for it, I imagine, while others looked the other way and tried to find some more imperials to kill. I pray I wasn't foolish enough to try and fight you. I owed you better..."},{"name":"MYSTE","text":"Houdart? Houdart! Speak to me!"},{"name":"HOUDART","text":"I'm fine... Just got dizzy all of a sudden. We have to hurry, do you hear me? We have to make it to the Reach!"},{"name":"MYSTE","text":"Houdart has to stay strong! He has to remember what's at stake!"},{"name":"HOUDART","text":"I made a promise...to Gallien... I will not fail you, brother..."},{"name":"MYSTE","text":"It cannot be the distance. We haven't traveled far enough yet..."},{"name":"HOUDART","text":"A man's memories...cannot outlive him..."},{"name":"HOUDART","text":"I told you, he hasn't...hasn't got much time. And neither do I..."},{"name":"HOUDART","text":"I'll hold on as long as I can, but...in the end...it's not up to me..."},{"name":"MYSTE","text":"No! I will not allow it! He will endure! We will fulfill Gallien's wish!"},{"name":"HOUDART","text":"So...so close..."},{"name":"MYSTE","text":"Houdart! You must go on! You must make Gallien whole! Remember, Houdart!"},{"name":"HOUDART","text":"Don't you think I know that!? He...he saved my life! And I...we all went and died for naught! For naught! All we ever wanted was to go home..."},{"name":"HOUDART","text":"O come ye wayward brothers,♪<br>Bereft of hearth and home,♪<br>Beneath yon burning star there lies♪<br>A haven for the bold...♪"},{"name":"HOUDART","text":"Raise up your hands and voices!♪<br>Let fill your hearts with pride!♪<br>Above the churning waters we♪<br>Stand strong and unified!♪"},{"name":"HOUDART","text":"...We can...we can still go home."},{"name":"HOUDART","text":"Even now, after everything we have done, we can still go home..."},{"name":"SYSTEM","text":"In the depths of the abyss, a flame lingers..."},{"name":"MYSTE","text":"He fell and would not rise. He began to shake and...and..."},{"name":"MYSTE","text":"He was so close! He could have made it─he should have made it! How cruel the gods to tempt us with this promise of redemption!"},{"name":"MYSTE","text":"We...we did not fail. They failed us...they failed us!"},{"name":"MYSTE","text":"They...we...I..."},{"name":"MYSTE","text":"Forgive me...forgive me... My failure is my own. I had my chance, and I squandered it. Reclaim that which was yours."},{"name":"MYSTE","text":"It was not mine to take, but I took it. For that is who I am at heart."},{"name":"SYSTEM","text":"Thus let me live, unseen, unknown;<br>Thus unlamented let me die;<br>Steal from the world, and not a stone<br>Tell where I lie."},{"name":"SYSTEM","text":"As the aether flows into your soul crystal once more, from the depths of the fading abyss, you hear a whisper..."},{"name":"MYSTE","text":"...It is not finished. Not yet. You will come and pray with me."},{"name":"MYSTE","text":"Here is where we are to pay <span class=\"highlight\">respect</span> to the dead."},{"name":"SYSTEM","text":"A storm of blood approaches fast,<br>Hells open, Heavens weep.<br>For no one soul doth lie beyond<br>The measure of His Reach."},{"name":"MYSTE","text":"...What good are prayers to the dead. They have not ears to listen."},{"name":"MYSTE","text":"Nor eyes to see or hearts to console. Naught remains of them save fleeting recollections soon lost to time and to the abyss..."},{"name":"MYSTE","text":"We are left only with pain.<br>A lingering sadness for names and faces consigned to oblivion."},{"name":"MYSTE","text":"How are we to withstand this relentless onslaught which threatens to consume us? Is there no truth but this, that all men must die?"},{"name":"MYSTE","text":"Is this our world to suffer, or to shape?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The world is what we make of it. I by my sword. That is my truth."},{"name":"A1","text":"Such is the gods' design."},{"name":"MYSTE","text":"...Indeed. We are only bound by the gods' law by choice."},{"name":"MYSTE","text":"...But it need not be ours, do you see?"},{"name":"MYSTE","text":"We cannot save everyone, can we.<br>Sometimes, it is all we can do to save ourselves."},{"name":"MYSTE","text":"Does any of it matter? What, if aught, have we wrought by our own hands?"},{"name":"MYSTE","text":"One last time. I gave you my word, and I mean to keep it."},{"name":"MYSTE","text":"But know this. Every intervention has come at cost. A sacrifice. When I have finished, naught will remain of me."},{"name":"MYSTE","text":"But...it does not have to be. For all our faults, for all our failures, we have made a difference. All the lives we have shattered, we can make them come together again."},{"name":"MYSTE","text":"Time and death, our true enemies, need hold no power over us. I can make a place for you in my world. You need only ask."},{"name":"MYSTE","text":"We should go back to Ishgard. You must miss Sid and Rielle..."},{"name":"RIELLE","text":"Is everything all right, <span class=\"highlight\">Forename</span>?"},{"name":"SIDURGU","text":"<span class=\"highlight\">Forename</span>. I pray your trip to Gyr Abania was productive."},{"name":"SIDURGU","text":"...I'm sorry to hear that. I mean, I am glad you reclaimed more of your aether. I but wish the circumstances hadn't been so...depressing. For Myste's sake. We shall have to see how he is feeling when he returns."},{"name":"SIDURGU","text":"Hm? No, as far as I am aware, he has yet to return to Ishgard. He certainly isn't here, as you can see."},{"name":"SIDURGU","text":"...Oh, godsdammit. Don't tell me he decided to run away! And just when I was beginning to trust the little bastard... &lt;sigh&gt; No, no, I could still be wrong. He's earned a little trust. A few days' worth, no more..."}],"reward":{"gil":2887,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":98}],"quests":[68453]},"next":[68455]},"partials":[{"type":"npc","id":"1022892","obj":{"i":1022892,"n":"Myste","l":2002,"q":2}},{"type":"npc","id":"1013969","obj":{"i":1013969,"n":"Sidurgu","l":2300,"q":10}},{"type":"npc","id":"1013970","obj":{"i":1013970,"n":"Rielle","l":2300,"q":9}},{"type":"npc","id":"1022889","obj":{"i":1022889,"n":"Rielle","l":2002,"q":2}},{"type":"npc","id":"1022890","obj":{"i":1022890,"n":"Myste","l":2406,"q":1}},{"type":"npc","id":"1022900","obj":{"i":1022900,"n":"Sidurgu","l":2002,"q":2}},{"type":"npc","id":"1022902","obj":{"i":1022902,"n":"Gallien","l":2406,"q":1}},{"type":"npc","id":"1022903","obj":{"i":1022903,"n":"Myste","l":2406,"q":1}},{"type":"npc","id":"1022904","obj":{"i":1022904,"n":"Houdart","l":2406,"q":1}},{"type":"npc","id":"1022905","obj":{"i":1022905,"n":"Houdart","l":2406,"q":1}},{"type":"npc","id":"1022906","obj":{"i":1022906,"n":"Myste","l":2406,"q":1}},{"type":"npc","id":"1022907","obj":{"i":1022907,"n":"Myste","l":2406,"q":1}},{"type":"npc","id":"1022908","obj":{"i":1022908,"n":"Houdart","l":2406,"q":1}},{"type":"npc","id":"1022909","obj":{"i":1022909,"n":"Myste","l":2406,"q":1}},{"type":"npc","id":"1022910","obj":{"i":1022910,"n":"Houdart","l":2406,"q":1}},{"type":"npc","id":"1022911","obj":{"i":1022911,"n":"Myste","l":2406,"q":1}},{"type":"npc","id":"1022912","obj":{"i":1022912,"n":"Myste","l":2403,"q":1}},{"type":"npc","id":"1022953","obj":{"i":1022953,"n":"Sidurgu","l":2002,"q":2}},{"type":"npc","id":"1023859","obj":{"i":1023859,"n":"Gallien","l":2406,"q":1}},{"type":"quest","id":"68453","obj":{"i":68453,"n":"The Orphans and the Broken Blade","g":157,"l":"The Dravanian Forelands","s":650,"f":1}},{"type":"quest","id":"68455","obj":{"i":68455,"n":"Our Compromise","g":157,"l":"Ishgard","s":700,"f":1}}]}