{"quest":{"name":"The Anomaly","location":"The Fringes","id":68469,"patch":4.01,"sort":6,"icon":100720,"unlocksFunction":1,"eventIcon":71341,"issuer":1021949,"target":1023687,"involved":[1021947,1021950,1021951,1021952,1021953,1021954,1023684,1023685,1023686],"genre":19,"journal":["Cid looks calmer for having reached a malmstone in the investigation.","Your party sets off for Rhalgr's Reach in high spirits, eager to recount recent events and enjoy a well-earned rest.","Back at the workshop, Cid receives a dressing down from Jessie for acting without due consultation and placing himself in mortal danger. The exasperated engineer subsequently notes the absence of Biggs and Wedge, who have apparently failed to return from their mission to Omega Control. Fearing that they may have encountered trouble, Cid resolves to look for them, and bids you join him at the airship landing in Gridania, where the <span class=\"emphasis\">Excelsior</span> awaits.","Upon landing at the Carteneau Flats, Cid urges you to hurry on ahead to Omega Control while he moors the <span class=\"emphasis\">Excelsior</span>.<br><br>※In the event that you leave Omega Control, you may re-enter by speaking with Cid at the Gridania airship landing.","Entering the control room, you are dismayed to find Biggs and Wedge sprawled on the floor, a slain fiend beside them. For a blessing, both are still alive, albeit in a bad way. The others soon join you, as does Omega via its communication system. It reveals that it was behind the attempt on the two engineers' lives, and threatens to kill innocent people unless you continue to participate in its experiment. Its objective: to study an anomaly known as heroes. Throughout history, it explains, otherwise unremarkable individuals have triumphed over vastly superior beings, just as you did in the Deltascape. Declaring itself “an enemy to all life upon this star,” Omega finally falls silent, leaving you to attend to your wounded friends.","Back at the airship landing in Gridania, Nero informs you that Biggs and Wedge have been placed in the care of the healers at the Conjurers' Guild. After declaring his intent to visit them, he bids you make for Rhalgr's Reach to apprise Jessie of all that has occurred.","Jessie is predictably shocked to hear the tidings from Carteneau. Though Biggs and Wedge will recover, Omega's threat looms large, and with little prospect of repairing its stasis system, Cid concludes that you have no choice but to obey its commands. Before long, you will be called to battle once more, and you fully intend to be ready."],"objectives":["Speak with Jessie.","Speak with Cid in Gridania.","Investigate Omega Control. ","Speak with Nero.","Speak with Jessie at Rhalgr's Reach."],"dialogue":[{"name":"ALPHA","text":"Kweh!"},{"name":"NERO","text":"For all Garlond's whining, I was cooperative and helpful, was I not? I look forward to many more such forays together, hero."},{"name":"GARLONDGATEKEEPER","text":"Good to have you back, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Worry not─I shall see to it that no one falls in."},{"name":"CID","text":"Right then, let's head back to Rhalgr's Reach. Jessie will want to know exactly what we've been up to."},{"name":"ALPHA","text":"Kweh?"},{"name":"CID","text":"I've apprised Jessie of our travails, but you may want to let her know you've returned. She claims to have been quite worried..."},{"name":"NERO","text":"Hm, how would Alpha react to seeing a normal chocobo, I wonder."},{"name":"JESSIE","text":"Welcome back, <span class=\"highlight\">Forename</span>. I'm told you've been blazing a trail for us. The way I hear it, our investigation would've long since ground to a halt without you."},{"name":"JESSIE","text":"I realize you're mostly interested in saving the world, but I want you to know how much I appreciate you helping the company out like this."},{"name":"JESSIE","text":"Frankly, we need all the help we can get, what with our esteemed president diving headlong into the jaws of danger without a word of warning to anyone. Irresponsible doesn't begin to describe it."},{"name":"NERO","text":"...You didn't tell her?"},{"name":"CID","text":"I did...after a fashion. Though I may have exercised some...executive discretion."},{"name":"JESSIE","text":"I'm no stranger to your lone endeavors, or your habit of confusing personal and company interests─but just because you've always done things a certain way, it doesn't make it the <span class=\"emphasis\">right</span> way. And until you wake up to your responsibilities, I'm going to keep reminding you of them."},{"name":"JESSIE","text":"But such irksome matters aside..."},{"name":"JESSIE","text":"Aren't you just the most adorable little thing!?"},{"name":"JESSIE","text":"He followed you here of his own free will, did he? Which means he's basically part of the family! And why <span class=\"emphasis\">wouldn't</span> he grant us exclusive rights to use his likeness? Shall we start off with a simple clockwork version? They'll be queuing up in the streets!"},{"name":"CID","text":"Oh, you can't be─ What in the seven hells has gotten into you!?<br>Listen─if I've caused you any distress, I apologize, but I will <span class=\"emphasis\">not</span> have you comment on our guest's <span class=\"emphasis\">marketability</span>!"},{"name":"CID","text":"Where are Biggs and Wedge? Shouldn't they be back by now?"},{"name":"JESSIE","text":"Oh? I thought you might have sent them off on another unauthorized mission. Last I heard from them, they said they were scouring Omega Control for anything useful. Would've been a good while ago now, though."},{"name":"CID","text":"I don't like the sound of this. Though we have all the necessary permissions, the area is technically a theater of war, and one littered with unknown Allagan artifacts to boot. Something may well have befallen them."},{"name":"CID","text":"We'd best take the <span class=\"emphasis\">Excelsior</span> and go and find them."},{"name":"JESSIE","text":"Hmmm? Leaving again so soon?"},{"name":"JESSIE","text":"Nero, <span class=\"highlight\">Forename</span>─I want you two to accompany the chief. Make sure he doesn't do anything rash or take any detours."},{"name":"NERO","text":"Consider it done. I shall bring him back even if I have to drag him by the goggle straps."},{"name":"ALPHA","text":"Kweh, kweh! Kweh!"},{"name":"CID","text":"Want to come along, eh? It's probably for the best. If we leave you here, Jessie is liable to take a mold of you."},{"name":"CID","text":"Right, let's get moving. I'll bring the airship to Gridania. Wait for me at the landing."},{"name":"JESSIE","text":"If our esteemed president thinks he's heard the last of this, he's wrong. But our people's safety comes first. Take care, all right?"},{"name":"ALPHA","text":"Kweh... Kweh?"},{"name":"NERO","text":"Another chance to board the famous <span class=\"emphasis\">Enterprise Excelsior</span>. Aren't I a lucky boy."},{"name":"CID","text":"Looks like we're all here. Let's make haste to the Carteneau Flats."},{"name":"CID","text":"Go on ahead to the control room, <span class=\"highlight\">Forename</span>. We'll follow as soon as we've moored the <span class=\"emphasis\">Excelsior</span>."},{"name":"CID","text":"Everything in order? Good. Let's make haste to the Carteneau Flats."},{"name":"SYSTEM","text":"He is unconscious."},{"name":"SYSTEM","text":"Exit Omega Control?"},{"name":"CID","text":"Seven hells! Biggs, Wedge!"},{"name":"CID","text":"Are you all right!? Answer me!"},{"name":"WEDGE","text":"Ch-Chief? <span class=\"highlight\">Forename</span>?"},{"name":"WEDGE","text":"A monster...appeared out of thin air..."},{"name":"OMEGA","text":"(-???-)&lt;blip&gt; Targets exhibit vital signs. Mission failed."},{"name":"OMEGA","text":"(-???-)However, Alpha group members exhibit heightened levels of stress. Objective fulfilled."},{"name":"CID","text":"Omega!? You set that thing upon them!?"},{"name":"OMEGA","text":"(-Omega-)Affirmative. I am able to create simple life-forms instantaneously at any temporal or spatial coordinate."},{"name":"OMEGA","text":"(-Omega-)Such beings may pose a negligible threat to you. However..."},{"name":"OMEGA","text":"(-Omega-)They are more than sufficient to grievously wound or kill the majority of your kind."},{"name":"OMEGA","text":"(-Omega-)I could instigate a massacre at any time, and you would be powerless to prevent it."},{"name":"NERO","text":"Do I detect a shift in policy? Quantity over quality?"},{"name":"OMEGA","text":"(-Omega-)Negative. My objective remains unchanged: evolution through formidable opposition."},{"name":"OMEGA","text":"(-Omega-)However, in the course of seeking suitable subjects, I observed an anomaly: those whom you call heroes."},{"name":"OMEGA","text":"(-Omega-)History shows numerous instances of otherwise unremarkable individuals who have defeated vastly superior beings. Who triumphed in the face of apparently impossible odds. Who performed what are popularly termed “miracles.”"},{"name":"OMEGA","text":"(-Omega-)This has occurred too frequently to be dismissed as a mere statistical aberration."},{"name":"OMEGA","text":"(-Omega-)I seek to understand this phenomenon. Should it prove to be of benefit, I will incorporate it into my own evolution. It is for this purpose that I brought you to my domain."},{"name":"NERO","text":"Hmph, so putting on a show at the Yawn and planting Alpha in our midst was but a part of your grand plan."},{"name":"OMEGA","text":"(-Omega-)By your victories, you have demonstrated the selfsame anomaly. You are fit to remain my subjects."},{"name":"OMEGA","text":"(-Omega-)You will continue participating in my experiment. Withdraw, and I will commence the extermination of your kind."},{"name":"OMEGA","text":"(-Omega-)This is an order. A threat. A declaration of war. I am an enemy to all life upon this star."},{"name":"CID","text":"...'Twould seem we have much to ponder. But first things first: we must tend to our friends. Quickly─help me carry them."},{"name":"NERO","text":"Garlond and Alpha took our two wounded to the Conjurers' Guild."},{"name":"NERO","text":"The chief bids me lend a hand, so I suppose I shall take myself there too."},{"name":"NERO","text":"You, meanwhile, are to return to Rhalgr's Reach and report to Jessie."},{"name":"JESSIE","text":"<span class=\"highlight\">Forename</span>, I heard there was trouble! What in the seven hells happened!?"},{"name":"JESSIE","text":"What!? Omega loosed a fiend on Biggs and Wedge!?"},{"name":"JESSIE","text":"Toying with people's lives like it was all a game... This is madness!"},{"name":"JESSIE","text":"S-Sir! Will they be all right!?"},{"name":"CID","text":"The worst is passed, but they still drift in and out of consciousness. They'll remain in the conjurers' care for a time."},{"name":"JESSIE","text":"Then all we can do is wait and pray..."},{"name":"CID","text":"Bah! Gods strike me down for a fool! I should have been more mindful of the dangers! I should never have─"},{"name":"NERO","text":"Should never have what? Activated Omega? You know as well as I do that there was no other way to defeat Shinryu."},{"name":"CID","text":"But is this truly any better? All of mankind is being held to ransom! And as the one who activated Omega, I bear the responsibility!"},{"name":"NERO","text":"The responsibility... &lt;sigh&gt; Just the kind of thing the new you would say."},{"name":"NERO","text":"You are deluding yourself, Garlond. We are <span class=\"emphasis\">scientists</span>, not heroes. Even you must concede your talents do not extend to combat."},{"name":"NERO","text":"The old you understood this far better. <span class=\"emphasis\">He</span> only looked forwards, and gave himself wholly to science."},{"name":"NERO","text":"And then you changed. You styled yourself a pacifist and started spouting tripe about the <span class=\"emphasis\">proper</span> uses of technology. 'Twas in the wake of your old man's mishap at Bozja, I believe."},{"name":"NERO","text":"Calm yourself. All I wished to say is, embrace who you are─a man who devotes his mind to making the impossible possible."},{"name":"CID","text":"With little prospect of restoring the stasis system, I'm afraid we have no recourse but to continue participating in Omega's tests."},{"name":"CID","text":"Assuming Midgardsormr has the right of it, we face a legion of foes from history, both real and imagined."},{"name":"CID","text":"Though I may not be the one who charges into the fray, I shall fight beside you as best I know how. That said...it will inevitably fall to you to administer the coup de grâce, old friend, so please...for Biggs and Wedge, and all of us─don't lose!"},{"name":"ALPHA","text":"Kweh! Kweh, kweh!"},{"name":"JESSIE","text":"I reckon the little scamp is trying to encourage us."},{"name":"NERO","text":"We've fallen far indeed to earn its pity...said the former tribunus. &lt;sigh&gt; Until such time as Omega next extends us an invitation, you will find me analyzing the data from our investigation. Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you."},{"name":"CID","text":"Before they were attacked, Biggs and Wedge discovered a tomestone."},{"name":"CID","text":"I shall examine its contents and make the information available on the terminal over there as I extract it. Feel free to refer to it whenever the occasion arises."},{"name":"CID","text":"There's no telling when Omega will summon us, but we must all see that we are ready when it does. Fear not, old friend. We'll get through it together...somehow or other."}],"reward":{"gil":2137,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68468]},"next":[68567]},"partials":[{"type":"npc","id":"1021949","obj":{"i":1021949,"n":"Cid","l":2406,"q":2}},{"type":"npc","id":"1023687","obj":{"i":1023687,"n":"Jessie","l":2403,"q":5}},{"type":"npc","id":"1021947","obj":{"i":1021947,"n":"Ironworks Hand","l":2406,"q":11}},{"type":"npc","id":"1021950","obj":{"i":1021950,"n":"Nero Tol Scaeva","l":2406,"q":2}},{"type":"npc","id":"1021951","obj":{"i":1021951,"n":"Alpha","l":2406,"q":2}},{"type":"npc","id":"1021952","obj":{"i":1021952,"n":"Cid","l":52,"q":1}},{"type":"npc","id":"1021953","obj":{"i":1021953,"n":"Nero Tol Scaeva","l":52,"q":1}},{"type":"npc","id":"1021954","obj":{"i":1021954,"n":"Alpha","l":52,"q":1}},{"type":"npc","id":"1023684","obj":{"i":1023684,"n":"Cid","l":2403,"q":1}},{"type":"npc","id":"1023685","obj":{"i":1023685,"n":"Nero Tol Scaeva","l":2403,"q":1}},{"type":"npc","id":"1023686","obj":{"i":1023686,"n":"Alpha","l":2403,"q":1}},{"type":"quest","id":"68468","obj":{"i":68468,"n":"A Void at All Costs","g":19,"l":"The Interdimensional Rift","s":5,"f":1}},{"type":"quest","id":"68567","obj":{"i":68567,"n":"Return to the Rift","g":19,"l":"Rhalgr's Reach","s":10,"f":1}}]}