{"quest":{"name":"The Croak Queen","location":"The Interdimensional Rift","id":68467,"patch":4.01,"sort":4,"icon":112236,"unlocksFunction":1,"eventIcon":71341,"issuer":1021942,"target":1021942,"involved":[1021943,1021946,1021947],"genre":19,"journal":["Cid looks expectantly in your direction.","With Biggs and Wedge not expected to report back for some time, Cid proposes that you move ahead with the tests. Your next opponent, Delta III, is apparently a being known as Halicarnassus, which Nero reveals to be the antagonist from a tale dating back to the Fourth Astral Era. Hearing this, Cid expresses surprise at the thought that Omega is deriving its subjects from works of fiction, at which moment Midgardsormr manifests to provide some timely insight. Omega, the Father of Dragons explains, has no soul and is therefore incapable of imagination; be it from fact or fiction, it must draw upon historic material in order to create. While the revelation excites Nero, it gives Cid a moment's pause, but he sets his questions aside in favor of focusing on the task at hand: defeating Halicarnassus. As has now become traditional, Alpha is waiting patiently for your signal to proceed.<br><br>※In the event that you leave the Interdimensional Rift, you may re-enter by speaking with the Ironworks hand at the Yawn.","Alpha kwehs to you his readiness to enter the Deltascape. Once your own preparations are in order, you may step through the portal to do battle with Halicarnassus.<br><br>※Deltascape V3.0 can be accessed via the Duty Finder.","In the Deltascape, you confront Halicarnassus, the flamboyant and formidable Queen of Dimension Castle. Yet all her pomp and pageantry avails her naught as you succeed in dethroning her, your victory and her demise a recreation of the ages-old tale.","With each new foe more dangerous than the last, Cid seems especially glad of your safe return. Thanks to your tireless efforts, but one test subject remains in the Deltascape. Take what rest you may, lest your next encounter prove a battle too far."],"objectives":["Speak with Alpha.","Enter Deltascape V3.0.","Speak with Cid."],"dialogue":[{"name":"ALPHA","text":"Kweh!"},{"name":"NERO","text":"It would seem a shame to squander the momentum we have generated...and you are <span class=\"emphasis\">fighting</span> fit."},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Will you be descending into the Yawn?"},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"CID","text":"I doubt we'll be hearing from Biggs and Wedge for a while yet. Shall we push on here in the meantime?"},{"name":"CID","text":"Reliable as ever. Without further ado, then, let us move things along."},{"name":"CID","text":"According to the analysis, your next opponent, Delta III, is a being named Halicarnassus."},{"name":"NERO","text":"Halicarnassus, you say? The Queen of Dimension Castle?"},{"name":"CID","text":"What's this? You know of her?"},{"name":"NERO","text":"You mean you don't? Well, I suppose a blue-blooded brat such as you would have no interest in humble folktales."},{"name":"NERO","text":"&lt;sigh&gt; It appears a lesson is in order. Halicarnassus is a character from an ancient fable. In the tale, she is one of the chief antagonists, and as such things are wont to unfold, she meets her end at the hands of the heroes─incurably valiant youths not unlike our adventurer friend here."},{"name":"NERO","text":"Literary historians have speculated that the tale could be loosely based on events which took place in the Fourth Astral Era, but little remains of that age, and there is no way to verify the claim. Indeed, most now assume the story to be a work of pure fiction."},{"name":"CID","text":"...You mean to tell me that Omega is populating its grand experiment with <span class=\"emphasis\">fictional characters</span>?"},{"name":"MIDGARDSORMR","text":"'Twould seem your understanding is yet lacking. Scant grasp have I of that which men know and know not..."},{"name":"MIDGARDSORMR","text":"Mark me, then. Omega hath no soul. No mind's eye in which to envision a rival."},{"name":"MIDGARDSORMR","text":"To bring forth new life, it must needs draw upon that which hath already been─its every creation being another's conception."},{"name":"MIDGARDSORMR","text":"This limitation is concealed by the breadth of its experience. It possesseth the means to retain the knowledge of entire eras─and not only of this reflection. Yet it perceiveth not this knowledge as we do."},{"name":"MIDGARDSORMR","text":"Fact...fiction...the distinction holdeth no meaning for Omega. All is equal in its eyes. If a thing is logical, it can be created."},{"name":"NERO","text":"Hahaha! That such a wondrous weapon should exist!"},{"name":"NERO","text":"It surpasses my wildest imaginings, and they were <span class=\"emphasis\">wild</span> indeed!"},{"name":"NERO","text":"But I gather not everyone shares my excitement. What's the matter, Garlond? Lost your nerve?"},{"name":"CID","text":"Quiet, Nero. We adults are thinking."},{"name":"CID","text":"...But mayhap now is not the time. <span class=\"highlight\">Forename</span> said <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was ready to continue, and so am I. Let's deal with Halicarnassus."},{"name":"CID","text":"My musings will keep. For now, we should concentrate on defeating Halicarnassus."},{"name":"NERO","text":"So dangerous─and wondrous─a thing cannot well be left alone. We must reach Omega, no matter the cost."},{"name":"ALPHA","text":"Kweh? Kweh!"},{"name":"SYSTEM","text":"Alpha appears eager to proceed. You may enter Deltascape V3.0 whenever you are ready."},{"name":"ALPHA","text":"Kweh? Kweh!"},{"name":"ALPHA","text":"Kw...kwibbit?"},{"name":"NERO","text":"So that was Halicarnassus. I must congratulate Omega on her appearance. She looked exactly as I imagined her."},{"name":"NERO","text":"Though, if I were to pick fault, it <span class=\"emphasis\">did</span> take certain liberties with her character. The queen of the tale was rather more restrained."},{"name":"CID","text":"I'm glad you're safe, <span class=\"highlight\">Forename</span>. For a moment there, I feared you might croak."},{"name":"CID","text":"Forgive me. You deserve better than that. Thanks to you, we are but one victory away from clearing the Deltascape. Take as much rest as you need, old friend. You've earned it."}],"reward":{"gil":1882,"xp":0,"instance":30051},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68466]},"next":[68468]},"partials":[{"type":"npc","id":"1021942","obj":{"i":1021942,"n":"Cid","l":2284,"q":5}},{"type":"npc","id":"1021943","obj":{"i":1021943,"n":"Nero Tol Scaeva","l":2284,"q":5}},{"type":"npc","id":"1021946","obj":{"i":1021946,"n":"Alpha","l":2284,"q":5}},{"type":"npc","id":"1021947","obj":{"i":1021947,"n":"Ironworks Hand","l":2406,"q":11}},{"type":"instance","id":"30051","obj":{"i":30051,"n":"Deltascape V3.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":295}},{"type":"quest","id":"68466","obj":{"i":68466,"n":"A Catastrophe Waiting","g":19,"l":"The Interdimensional Rift","s":3,"f":1}},{"type":"quest","id":"68468","obj":{"i":68468,"n":"A Void at All Costs","g":19,"l":"The Interdimensional Rift","s":5,"f":1}}]}