{"quest":{"name":"The Chase","location":"South Shroud","id":68462,"patch":4.0,"sort":680,"icon":100678,"unlocksFunction":1,"eventIcon":71341,"issuer":1021911,"target":1021911,"involved":[1006279,1013135],"genre":156,"journal":["Alka Zolka's face is drawn into tight lines.","In attempting to summon Lilac, Setoto has expended a majority of her aether─a condition one can normally recover from with a bit of rest. Despite having been asleep for quite some time now, however, the tonberry girl shows no signs of improvement, and Alka grows worried that something else is wrong. He asks that you visit Surito Carito at the Wanderer's Palace that the two of you might combine your scholarly knowledge to determine what exactly is amiss.","Surito Carito speculates that the reason Setoto has not recovered is because she managed only a partial summoning. He believes this has resulted in a phantom faerie, which has forestalled her recovery by preventing her aether from being returned to her. Telling you the only way for you to save her is to track down and dispatch of this half-formed creature, Surito Carito leaves you to return to Alka Zolka.","As you are informing Alka Zolka of the current state of affairs, Landenel approaches you with interesting news. He tells you of how a large number of his men have encountered a ghost in the forest─one in the form of a floating purple orb. This description happens to match the partially summoned Lilac at the ruins, and you and Alka decide to investigate. According to Landenel, the Wailers have spotted the phantom faerie in Snakemolt and the Upper Paths. The ex-marauder will be searching Snakemolt, while you have a look around the Upper Paths.","You carefully survey the first area in the Upper Paths for the roaming purple specter. You find nothing. Perhaps it is time to move on.","A thorough search of the next region in the Upper Paths uncovers nothing. Hopefully the last stretch of the South Shroud you have been ordered to inspect will turn up something.","As you scan this last bit of land, something purple and aetherial catches your eye. It releases a hideous shriek and lashes out at you. You quickly defeat it, but alas, it is not the phantom faerie you seek. Alka Zolka no doubt awaits you back at Camp Tranquil. It is best not to keep him waiting.","Alka Zolka also has had no luck in locating the faerie. As the two of you prepare to open up discussions on how you might proceed, Landenel appears, once again. He tells you of how one of his men was just attacked by the phantom faerie, which then escaped into the Lost City of Amdapor. While eager to give chase, due to the darkness that lingers there, the commanding Wood Wailer must first receive permission from the Order of the Twin Adder before any of you can enter. Asking that you make preparations while you wait, he goes to speak with his higher-ups. <br><br>※The next scholar quest will be available from Alka Zolka upon reaching level 70."],"objectives":["Speak with Surito Carito at the Wanderer's Palace.","Report to Alka Zolka at Camp Tranquil.","Survey the Upper Paths for the phantom faerie.","Report to Alka Zolka at Camp Tranquil."],"dialogue":[{"name":"ALKAZOLKA","text":"<span class=\"highlight\">Forename</span>, something's terribly wrong. Ever since she collapsed, Setoto hasn't so much as stirred."},{"name":"ALKAZOLKA","text":"According to Surito Carito, the sickness transforms not only the body, but also the quality of the afflicted individual's aether."},{"name":"ALKAZOLKA","text":"As such, attempting to summon Lilac in her current state likely drained her of nearly all her vitality."},{"name":"ALKAZOLKA","text":"A bit of rest, however, should have been enough to replenish her reserves, and she should be awake by now. The fact that she's not means something else is amiss."},{"name":"ALKAZOLKA","text":"Please go and have a word with Surito Carito, scholar to scholar. Perhaps if you were to combine your wits, you might learn what is wrong. I shall remain here and look after Setoto."},{"name":"LANDENEL","text":"Worry not, adventurer. The green girl is in safe hands."},{"name":"SURITOCARITO","text":"So Setoto still slumbers on..."},{"name":"SURITOCARITO","text":"Normally, when scholars summon their faeries, they do so by extracting a portion of the aether circulating through their body and willing it to take shape."},{"name":"SURITOCARITO","text":"By releasing that form, they can then dismiss it, and the aether will flow back into their bodies. This is what should have happened to Setoto when she fell unconscious. I cannot understand why she remains asleep... Unless..."},{"name":"SURITOCARITO","text":"What if she only managed a partial summoning?"},{"name":"SURITOCARITO","text":"There is a possibility that all of Setoto's aether fled from her body upon calling to Lilac, causing her to then fall unconscious before the faerie could fully manifest."},{"name":"SURITOCARITO","text":"That would mean this unbound phantom is out there somewhere, aimlessly roaming the land and preventing her from regaining consciousness."},{"name":"SURITOCARITO","text":"You and Alka must hurry to find and dispatch of it before it wanders too far. It may be the only way to wake her!"},{"name":"LANDENEL","text":"She doesn't seem to be recovering. Poor girl. Mayhap the green ooze has finally gotten the best of her..."},{"name":"ALKAZOLKA","text":"If you and Surito Carito were to combine your wits, I'm certain you can find a way to save her. Make haste, <span class=\"highlight\">Forename</span>. I fear we may be running out of time."},{"name":"ALKAZOLKA","text":"Finally you've returned. What did Surito Carito have to say?"},{"name":"ALKAZOLKA","text":"A partially summoned familiar!? Then, as Surito Carito suggests, we must hunt this thing down and destroy it."},{"name":"ALKAZOLKA","text":"Do you recall how, right before Setoto fell unconscious at the ruins, a purple sphere of light appeared before us? That must be the phantom faerie to which he refers."},{"name":"ALKAZOLKA","text":"Problem is, the moment it materialized it vanished from Amdapor Keep. There's no telling where it could have gone..."},{"name":"LANDENEL","text":"The two of you are looking awfully somber. What's wrong?"},{"name":"LANDENEL","text":"Hm... Does this thing, by any chance, resemble a floating violet orb?"},{"name":"ALKAZOLKA","text":"So you've seen it?"},{"name":"LANDENEL","text":"No, but lately many of the Wailers have been claiming they've encountered a specter in the forest. In fact, the reports have been so numerous in number that I've been given orders to investigate the matter."},{"name":"LANDENEL","text":"Interestingly enough, the description they've given me seems to match this phantom faerie of yours."},{"name":"ALKAZOLKA","text":"Aye. That'll be it, all right."},{"name":"LANDENEL","text":"While I'd like to immediately begin my search of this faerie-specter, there are a few rather pressing matters I must attend to first."},{"name":"ALKAZOLKA","text":"Not to worry! <span class=\"highlight\">Forename</span> and I will take it from here. We've already troubled you enough as it is."},{"name":"LANDENEL","text":"Very well, then. My men have spotted the thing along the Upper Paths and Snakemolt. You may want to begin by searching both those places."},{"name":"ALKAZOLKA","text":"Thank you."},{"name":"LANDENEL","text":"I'm not doing it for you. I'm doing it for the young lady. It's not as though I could simply stand by and watch as a helpless girl fights for her life."},{"name":"ALKAZOLKA","text":"&lt;sigh&gt; It may not seem it, but somewhere in that man is a good heart."},{"name":"ALKAZOLKA","text":"Now then, let's immediately begin surveying the areas Landenel mentioned. You take the Upper Paths, and I'll go to Snakemolt!"},{"name":"SURITOCARITO","text":"<span class=\"highlight\">Forename</span>, please hurry and tell Alka Zolka what I have shared with you. The partially summoned faerie must be stopped at all costs."},{"name":"SYSTEM","text":"You notice nothing out of the ordinary."},{"name":"SYSTEM","text":"Out of the corner of your eye, you see an eerie glowing presence floating toward you."},{"name":"SYSTEM","text":"It releases a hideous scream, and you find yourself under attack!"},{"name":"LANDENEL","text":"I wish I could accompany you, but unfortunately, I have a few other things I must attend to."},{"name":"ALKAZOLKA","text":"Ah, it's about time you came, my friend! I was beginning to grow concerned one of the beasts in the forest had gotten the better of you."},{"name":"ALKAZOLKA","text":"I, myself, encountered a fair few woodland creatures during my search, one of which was a purple sphere of light. Alas, it turned out to simply be a will-o'-the-wisp. By the expression on your face, I assume your investigation went no better?"},{"name":"ALKAZOLKA","text":"&lt;sigh&gt; Where the seven hells did that thing fly off to?"},{"name":"LANDENEL","text":"There you are! Just moments ago, one of my men was attacked by your faerie."},{"name":"ALKAZOLKA","text":"Wh-What!?"},{"name":"LANDENEL","text":"According to him, it disappeared into the Lost City of Amdapor. We won't be able to give chase, just yet, however. Entry into the area is heavily restricted due to the darkness which permeates it."},{"name":"LANDENEL","text":"We need to receive permission from the Order of the Twin Adder. I shall go and request that right now. In the meantime, I ask that you wait here."},{"name":"ALKAZOLKA","text":"Landenel, with all due respect, why is it that you're so intent on helping us? To put it bluntly, the faerie is our responsibility, not yours."},{"name":"LANDENEL","text":"I told you before─green of skin or not─I cannot stand to see the young girl suffer. After all, the duty of the strong is to protect the weak."},{"name":"LANDENEL","text":"Now, if the two of you are planning on joining me in this fight against the faerie-phantom, I suggest you begin making preparations. Taking this thing down is going to be no easy task."},{"name":"LANDENEL","text":"Alka Zolka returned from his search a while ago and has been looking for you since. You best go and speak with him."}],"reward":{"gil":1943,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":29}],"quests":[68461]},"next":[68463]},"partials":[{"type":"npc","id":"1021911","obj":{"i":1021911,"n":"Alka Zolka","l":56,"q":4}},{"type":"npc","id":"1006279","obj":{"i":1006279,"n":"Landenel","l":56,"q":7}},{"type":"npc","id":"1013135","obj":{"i":1013135,"n":"Surito Carito","l":34,"q":10}},{"type":"quest","id":"68461","obj":{"i":68461,"n":"In Loving Memory","g":156,"l":"South Shroud","s":650,"f":1}},{"type":"quest","id":"68463","obj":{"i":68463,"n":"Our Unsung Heroes","g":156,"l":"South Shroud","s":700,"f":1}}]}