{"quest":{"name":"In Loving Memory","location":"South Shroud","id":68461,"patch":4.0,"sort":650,"icon":100678,"unlocksFunction":1,"eventIcon":71341,"issuer":1021911,"target":1021911,"involved":[1021912,1021913,1021914],"genre":156,"journal":["Alka Zolka fusses over Setoto.","As Setoto appears to be fully recovered, Alka Zolka would like to begin the search for a memento of her father. The Royal Marine suggests beginning at Amdapor Keep. If, as you have come to suspect, Setoto's father was captured by the Amdapori while on a mission to discover a way to reverse the Nymian plague, he would have been transported to Amdapor Keep for questioning. It is then likely that some of his remaining possessions can be found there. Make your way to the ancient ruins and look for any items which Setoto might remember her father by.","The three of you pick your way through Amdapor Keep, and you encounter various denizens of the ruins and ancient artifacts─including an Amdapori journal which touches upon taking a Nymian spy captive. From it you are able to conclude that Setoto's father's personal effects have been stored in a mana idol. As you begin dismantling these Amdapori golems, you are confronted by a manasnatcher, one of the hulking creatures that resides there. After a hard-fought battle, it falls lifeless to the ground, and a coffer tumbles from its innards. You, Alka, and Setoto move to open it.","You open it to see that it contains what appears to be Setoto's father's grimoire, clothes, and soul crystal. Gingerly taking the crystal in her hands, Setoto begs her father's faerie, Lilac, to appear. It unleashes a sphere of purple light and Setoto falls to the ground, unconscious. After an unsuccessful attempt to wake her, Alka Zolka bids you help him transport the tonberry out of the dangerous ruins and to Camp Tranquil.","You and Alka return to Camp Tranquil with Setoto, and the marauder asks that you use your knowledge to diagnose what is wrong with her. You conclude that, despite the lack of physical injuries, it will be a while before the young tonberry girl wakes. Alka is deeply troubled by the news, and his panicked shouts draw the attention of Landenel of the Wood Wailers, who offers to take Setoto into his care until such a time she has recovered. Requesting that you remain behind with her and Landenel, Alka Zolka leaves you for Bronze Lake to speak with Surito Carito.<br><br>※The next scholar quest will be available from Alka Zolka upon reaching level 68."],"objectives":["Rendezvous with Alka Zolka near Amdapor Keep.","Speak with Alka Zolka at Camp Tranquil.","Find Setoto a memento of her father!","Defeat the manasnatcher!"],"dialogue":[{"name":"ALKAZOLKA","text":"Setoto! You appear to be doing much better. Even your complexion has returned to normal."},{"name":"SETOTO","text":"Indeed! I, too, noticed that my skin once again glows a healthy shade of green!"},{"name":"ALKAZOLKA","text":"<span class=\"highlight\">Forename</span>, now that Setoto has recovered, our search can begin. Ere we depart, let us quickly review what we know."},{"name":"ALKAZOLKA","text":"Setoto's father was a scholar in the Royal Marines who had been dispatched on a mission to infiltrate Amdapor. He was to return with a cure to the disease that threatened to engulf Nym─only, he never did."},{"name":"SETOTO","text":"Yes. I am almost certain he was caught, captured, and then killed by the Amdapori..."},{"name":"SETOTO","text":"Even if that was not the case, after fifteen hundred years, we can safely assume he is no longer alive. I hold out hope, however, that some of his belongings remain."},{"name":"ALKAZOLKA","text":"The Amdapori were extremely dedicated to expanding their knowledge of healing magic. Anything in a scholar's possession would have been of incredible value to them, and had your father been captured, they would have confiscated all that he had."},{"name":"ALKAZOLKA","text":"He would then likely have been transported to a remote and secure location for interrogation. That means... "},{"name":"ALKAZOLKA","text":"Our chances of finding anything that once belonged to him will be highest in Amdapor Keep."},{"name":"SETOTO","text":"Oh, Alka, not only are you terribly kind, but you are keen of mind, as well!"},{"name":"ALKAZOLKA","text":"Ahem. Thank you. Now, in the final years of the War of the Magi, Amdapor was demolished by the Mhachi. It was overrun with a myriad of voidsent beasts that linger to this day."},{"name":"ALKAZOLKA","text":"As we forge forward, you must be sure to keep your wits about you! Amdapor Keep is fraught with dangers both known and unknown."},{"name":"SETOTO","text":"For so long I've been treated like a hideous beast that I'd forgotten what it was like to be thought of as a girl. Alka has reminded me, and for that, I cannot thank him enough."},{"name":"ALKAZOLKA","text":"We've finally made it! <span class=\"highlight\">Forename</span>, if you're ready, please lead the way."},{"name":"SETOTO","text":"So this is Amdapor Keep...erstwhile home to the mages we fought so long and hard against."},{"name":"QIB","text":"The Presence Chamber... From here we must tread with caution. We know not what dangers lurk in the shadows."},{"name":"QIB","text":"Whatever happens, I shall not leave this place without something to remember my father by."},{"name":"QIB","text":"&lt;gasp&gt; <span class=\"highlight\">Forename</span>! This log─I think it's about my late father..."},{"name":"QIB","text":"(-Tattered Log-)The interrogation of the Nymian spy we apprehended is scheduled to soon take place at the Moot Hall."},{"name":"QIB","text":"(-Tattered Log-)The healing powers his people wield are not like to those of white magic. Regardless of what it takes, we must find a way to determine the mysterious source of his power."},{"name":"QIB","text":"(-Tattered Log-)We suspect his robes are crucial to his spellcasting. They will no doubt hold some of the answers."},{"name":"QIB","text":"(-Tattered Log-)For now, however, we will be sealing them away in one of our mana idols."},{"name":"QIB","text":"Then we must begin dismantling the mana idols!"},{"name":"QIB","text":"One of them might be carrying Setoto's father's things!"},{"name":"QIB","text":"Rubbish, nothing more..."},{"name":"QIB","text":"All the pages are in tatters. Perhaps we'll have better luck with the next one we find."},{"name":"QIB","text":"Nothing in this bag looks as though it could have belonged to him..."},{"name":"QIB","text":"&lt;cough&gt; &lt;cough&gt; The stench... It's worse than that of spoiled milk!"},{"name":"QIB","text":"This book appears to─"},{"name":"QIB","text":"&lt;grunt&gt; Wh-What's this? My body tingles from head to toe and suddenly I feel so light! It must be charmed!"},{"name":"QIB","text":"This chest is full to the brim with treasure!"},{"name":"QIB","text":"No. This isn't what we're looking for. Let us leave it."},{"name":"QIB","text":"Why are there so many broken mana─ Great gods! That beast! Over there!"},{"name":"QIB","text":"He's spotted us! We have no choice but to fight him."},{"name":"QIB","text":"Is...is that a coffer!? This thing must have been feeding on the mana idols!"},{"name":"QIB","text":"Setoto, <span class=\"highlight\">Forename</span>! Perhaps this is it..."},{"name":"QIB","text":"Seven hells! We're done for..."},{"name":"QIB","text":"Father...forgive me..."},{"name":"NCUT","text":"Look! It's a Nymian grimoire!"},{"name":"NCUT","text":"I recognize this! It's my father's! And these..."},{"name":"NCUT","text":"These are his robes! Th-They're from the day he left. All of it has been so perfectly preserved, it's almost as though he were wearing them but yesterday..."},{"name":"NCUT","text":"Oh? What's this?"},{"name":"NCUT","text":"...Is that his <span class=\"emphasis\">soul crystal</span>!?"},{"name":"NCUT","text":"Yes...and within slumbers the faerie that has been with my family for generations."},{"name":"NCUT","text":"I thought I had lost nearly everyone to that godsforsaken war and the terrible disease that followed... Yet, in spite of all odds, here she is─the last of my family, sitting right in the palm of my hand. I would give anything to see her again."},{"name":"NCUT","text":"Lilac...? Lilac, please... Answer me!"},{"name":"NCUT","text":"Setoto? <span class=\"emphasis\">Setoto</span>!? What happened? Wake up!"},{"name":"NCUT","text":"<span class=\"highlight\">Forename</span>, something's wrong! She's not responding. We must get her back to Camp Tranquil immediately!"},{"name":"ALKAZOLKA","text":"<span class=\"highlight\">Forename</span>, you're a Royal Marine and an outstanding scholar, besides. Surely, you can diagnose what's wrong with her?"},{"name":"SYSTEM","text":"Setoto has no external injuries, and both her breathing and pulse are stable. Despite this, she appears to have slipped into a coma from which she will not wake any time soon."},{"name":"ALKAZOLKA","text":"She won't be waking any time soon!? No, that can't be! What in the seven hells happened back there!?"},{"name":"LANDENEL","text":"Troubled civilians in need of a helping hand, I presume? Might the Wood Wailers be of assistance?"},{"name":"LANDENEL","text":"Ah! Well, if it isn't the adventurer! What brings you to this neck of the woods?"},{"name":"ALKAZOLKA","text":"<span class=\"highlight\">Forename</span>, this is another one of your friends, I take it?"},{"name":"LANDENEL","text":"So, in essence, a botched invocation rendered this thing unconscious? The solution to that is simple enough. Just leave it there to rest until it wakes up."},{"name":"ALKAZOLKA","text":"Thing!? <span class=\"emphasis\">Thing</span>!? How dare you speak of Setoto in such a callous manner! And to think that you would suggest we leave this beautiful young lady out <span class=\"emphasis\">here</span> in the open until she wakes up─you must be mad!"},{"name":"LANDENEL","text":"Young lady...? You're quite sure that's what he─er, she is?"},{"name":"LANDENEL","text":"Ahem. My apologies. I shall carry the young girl inside and see that she is given a proper place to rest. But before that... This...coat of green mucus isn't contagious, is it?"},{"name":"ALKAZOLKA","text":"Green mucus!? That's not green mucus, it's... &lt;sigh&gt; Never mind."},{"name":"ALKAZOLKA","text":"No, it's not contagious. You should be fine. Thank you for your help, sir. It is greatly appreciated."},{"name":"ALKAZOLKA","text":"At least for now, we can rest easy knowing that Setoto is safe─or as safe as she can be given the circumstances."},{"name":"LANDENEL","text":"All should be in order. I've seen to it that your friend has been given a comfortable bed to rest in until she recovers."},{"name":"ALKAZOLKA","text":"<span class=\"highlight\">Forename</span>, I shall return to Bronze Lake and inform Surito Carito of all that has happened. Perhaps he will be able to shed light on what is wrong with Setoto."},{"name":"ALKAZOLKA","text":"In the meantime, I would ask that you remain near on hand and keep an eye on her. Don't worry. I shouldn't be away too long."}],"reward":{"gil":1857,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":29}],"quests":[68460]},"next":[68462]},"partials":[{"type":"npc","id":"1021911","obj":{"i":1021911,"n":"Alka Zolka","l":56,"q":4}},{"type":"npc","id":"1021912","obj":{"i":1021912,"n":"Setoto","l":56,"q":2}},{"type":"npc","id":"1021913","obj":{"i":1021913,"n":"Alka Zolka","l":56,"q":1}},{"type":"npc","id":"1021914","obj":{"i":1021914,"n":"Setoto","l":56,"q":1}},{"type":"quest","id":"68460","obj":{"i":68460,"n":"A Safe Place to Hide","g":156,"l":"Upper La Noscea","s":630,"f":1}},{"type":"quest","id":"68462","obj":{"i":68462,"n":"The Chase","g":156,"l":"South Shroud","s":680,"f":1}}]}