{"quest":{"name":"Into the Deltascape","location":"The Interdimensional Rift","id":68465,"patch":4.01,"sort":2,"icon":112234,"unlocksFunction":1,"eventIcon":71341,"issuer":1021942,"target":1021942,"involved":[1021943,1021944,1021945,1021946,1021947,1023623,1023624],"genre":19,"journal":["Cid is eager to proceed with the investigation.","For want of a better option, you agree to do as Omega bade you and engage the test subjects inside the Deltascape. While you do battle within, your comrades will provide support without. You will not be entirely alone in there, however; as you will need to make use of Alpha's “existential authorization,” he will go with you into the test world.<br><br>※In the event that you leave the Interdimensional Rift, you may re-enter by speaking with the Ironworks hand at the Yawn.","Alpha stands ready to enter the Deltascape, and the portal beckons. If you have any final preparations, now would be the time to see to them.<br><br>※Deltascape V1.0 can be accessed via the Duty Finder.","Inside the Deltascape, you come face-to-face with Alte Roite. The winged serpent falls upon you with a vengeance, but you stand your ground and ultimately emerge the victor.","Outside the Deltascape, your comrades compliment you on a battle well won. When Nero subsequently questions Omega's apparent obsession with determining the strongest being, Midgardsormr appears and explains that, having defeated Shinryu, it now seeks to create a mightier foe to fight. Fearing that the violence of such an encounter would be akin to another calamity, Cid is determined to stop Omega's plan. He duly grants Biggs and Wedge leave to investigate the stasis system in Carteneau, while he and Nero remain in the rift to aid you in the tests to come."],"objectives":["Speak with Alpha.","Enter Deltascape V1.0.","Speak with Cid."],"dialogue":[{"name":"ALPHA","text":"Kweh?"},{"name":"NERO","text":"Quite impressive for an improvised arrangement, even if I do say so myself. Now then, let us see what we can learn from our host's many monitors."},{"name":"BIGGS","text":"I was thinking about asking the crew to throw some supplies in after us. But only the gods know if they'd make it here in one piece. You can bet they wouldn't be the right way up if they did, though."},{"name":"WEDGE","text":"Whew... All that jumping and fading and fighting really took it out of me..."},{"name":"WEDGE","text":"What I need now is a steaming-hot cup of tea...and nothing makes a better brew than the Mark XIV Thermocoil Boilmaster, coming soon to a Garlond Ironworks-approved vendor near you!<br>...S-Sorry. Jessie made me do it."},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Will you be descending into the Yawn?"},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"CID","text":"Right then, what to do next..."},{"name":"CID","text":"We know that Omega is conducting tests to determine the strongest being."},{"name":"CID","text":"But we do not know its ultimate purpose, nor even its exact whereabouts."},{"name":"NERO","text":"Plainly, however, it is within Omega's power to curtail our stay here whensoever it chooses. Accordingly, we have little choice but to proceed as bidden and defeat the test subjects waiting in the Deltascape."},{"name":"CID","text":"Well, Alpha certainly seems keen. Though it might be best if you left the fighting to others, little one."},{"name":"CID","text":"That is, of course, assuming “others” are willing? What say you, old friend?"},{"name":"NERO","text":"This promises to be a most entertaining foray, and I would not dream of missing any part of it. You may rely on me to provide you with remote support."},{"name":"NERO","text":"With commendable foresight, I took the liberty of borrowing the various monitors that were lying around, and shall extract all the information I can from them."},{"name":"ALPHA","text":"Kweh! Kweh!"},{"name":"CID","text":"Hmph. 'Tis a pity none of us speaks chocobo. As I recall, though, we are supposed to have Alpha transfer his authorization to us prior to engaging in combat."},{"name":"CID","text":"In which case, <span class=\"highlight\">Forename</span>, you'll need him to accompany you into the Deltascape. See to your preparations, and proceed whenever you are ready."},{"name":"CID","text":"At this point, we're doing little more than fumbling in the dark. Take care in there, you hear?"},{"name":"NERO","text":"Well, then! Let the inquisition begin."},{"name":"ALPHA","text":"Kweh! Kweh!"},{"name":"SYSTEM","text":"Alpha appears eager to proceed. You may enter Deltascape V1.0 whenever you are ready."},{"name":"ALPHA","text":"Kweh! Kweh!"},{"name":"ALPHA","text":"K-Kweh!"},{"name":"NERO","text":"Well, well, aren't we in fine form?"},{"name":"BIGGS","text":"Nice work in there, <span class=\"highlight\">Forename</span>. As you can see, we've finished setting up here. Now we've got everything straight, we'll do our best to make ourselves useful. If you need anything, just ask, eh?"},{"name":"WEDGE","text":"I'm glad you're safe, you and Alpha both!"},{"name":"CID","text":"Well done, my friend! We were lucky enough to witness every moment of your struggle via the Deltascape's various surveillance devices. I daresay we had a better view than you did."},{"name":"NERO","text":"Gaining control over them was the extent of our accomplishments for this outing─though I suppose we did also learn your adversary's name. Rest assured, however, that there will be plenty more such outings."},{"name":"NERO","text":"Preliminary analysis suggests that there are four combatants in the Deltascape all told, including your friend Alte Roite. Which means you will be required to win three further bouts─with Deltas II to IV─in this test world alone."},{"name":"NERO","text":"Needless to say, there are plenty more such worlds in the rift, holding the remaining eighty-five subjects between them."},{"name":"NERO","text":"Plainly, our host has gone to no small amount of trouble. Quite why it is so obsessed with determining the strongest being is another question."},{"name":"MIDGARDSORMR","text":"Omega seeketh to improve itself. To evolve. This was ever its primary directive. Through contending with mighty foes, it groweth stronger."},{"name":"MIDGARDSORMR","text":"Having vanquished the vile simulacrum you call Shinryu, a greater adversary was needed. In the absence of such a being, it had but to create one."},{"name":"CID","text":"So in the name of self-improvement, it wants to make a new playmate... And it chose to undertake the task here to avoid outside interference, yes?"},{"name":"MIDGARDSORMR","text":"...In part. The making of life is not Omega's primary function. It bringeth complex beings into the corporeal realm only at great cost to itself."},{"name":"MIDGARDSORMR","text":"As such, it employeth this plane to test unfinished works, that it might determine a single entity worthy of creation."},{"name":"CID","text":"If I understand you correctly, the moment Omega's grand experiment is complete, it will give birth to a creature mightier even than Shinryu and then proceed to fight it."},{"name":"CID","text":"Gods help us all if a battle of that scale should come to pass. The powers unleashed would be enough to bring about another calamity."},{"name":"NERO","text":"Hm. Assuming the dragon has the right of it, all test subjects must needs be works in progress─save for ourselves, of course. But how then do we explain Alpha? As I recall, it manifested corporeally outside the rift."},{"name":"NERO","text":"Then again...it is hardly the most complex of creatures. Mayhap it was finished by accident."},{"name":"WEDGE","text":"Don't you make fun of Alpha! He's a good boy, and if it hadn't been for him, we would all have been erased! He might not be strong, but he's brave! And reliable! And adorable!"},{"name":"BIGGS","text":"Er...changing the subject for a moment, Chief─after you lost track of Omega, you said you reengaged its stasis systems, right?"},{"name":"BIGGS","text":"...Meaning something somewhere isn't working like it should."},{"name":"BIGGS","text":"I only ask 'cause me and Wedge have done pretty much all we can here, and were wondering if it might be worth going to Carteneau to look into it."},{"name":"CID","text":"That would be a great help. Nero and I can handle things at this end."},{"name":"BIGGS","text":"We'll be off, then. Don't do anything I wouldn't do, eh?"},{"name":"WEDGE","text":"And you be a good boy, Alpha. Do as you're told, and look after <span class=\"highlight\">Forename</span> for me!"}],"reward":{"gil":1736,"xp":0,"instance":30049},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68464]},"next":[68466]},"partials":[{"type":"npc","id":"1021942","obj":{"i":1021942,"n":"Cid","l":2284,"q":5}},{"type":"npc","id":"1021943","obj":{"i":1021943,"n":"Nero Tol Scaeva","l":2284,"q":5}},{"type":"npc","id":"1021944","obj":{"i":1021944,"n":"Biggs","l":2284,"q":2}},{"type":"npc","id":"1021945","obj":{"i":1021945,"n":"Wedge","l":2284,"q":2}},{"type":"npc","id":"1021946","obj":{"i":1021946,"n":"Alpha","l":2284,"q":5}},{"type":"npc","id":"1021947","obj":{"i":1021947,"n":"Ironworks Hand","l":2406,"q":11}},{"type":"npc","id":"1023623","obj":{"i":1023623,"n":"Biggs","l":2284,"q":1}},{"type":"npc","id":"1023624","obj":{"i":1023624,"n":"Wedge","l":2284,"q":1}},{"type":"instance","id":"30049","obj":{"i":30049,"n":"Deltascape V1.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":295}},{"type":"quest","id":"68464","obj":{"i":68464,"n":"The Hunt for Omega","g":19,"l":"Rhalgr's Reach","s":1,"f":1}},{"type":"quest","id":"68466","obj":{"i":68466,"n":"A Catastrophe Waiting","g":19,"l":"The Interdimensional Rift","s":3,"f":1}}]}