{"quest":{"name":"Elite Veteran Clan Hunt","location":"Kugane","id":68475,"patch":4.0,"sort":10040,"unlocksFunction":1,"eventIcon":71341,"issuer":1019007,"target":1019009,"genre":107,"journal":["Estrild of the Shiokaze Hostelry remains unwavering in keeping a close, enlisting eye on passersby."],"objectives":["Speak with Wlveva."],"dialogue":[{"name":"ESTRILD","text":"So good to see you, <span class=\"highlight\">Forename</span>. There is news I've been waiting to share with you."},{"name":"ESTRILD","text":"It's that damnable Wlveva. She had the gall to chastise me for inviting passersby to join Clan Centurio. All I ever sought was to bring the thrill of the Hunt to all who cared to know it."},{"name":"ESTRILD","text":"I grant you, no soul save you that I've recruited has ever reported back from their outings. We assume them all fallen. But such is the nature of the Hunt."},{"name":"ESTRILD","text":"I've neither time nor patience for the weak. Let the Hunt cull them from our ranks, I say. If a hundred must die for Clan Centurio to find one such as you, so be it. Aye, I knew you to be of great ability. But never did I suspect you would climb so high."},{"name":"ESTRILD","text":"You've done good by me, and made me proud to call you <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. From this day forth, I recognize you as one of Clan Centurio's most accomplished hunters."},{"name":"ESTRILD","text":"With that, you have the Clan's leave to hunt the Far East's most fearsome quarry. I hazard you require no long-winded explanation, having already faced such beasts in Ishgard. Still, for sake of ceremony, go and speak with Wlveva."},{"name":"ESTRILD","text":"Go well, <span class=\"highlight\">Forename</span>. And don't go dying on me now─the true fun has only just begun."},{"name":"WLVEVA","text":"Hail, <span class=\"highlight\">Forename</span>. I have had word from Estrild. It seems she has vouched for your promotion to Clan Centurio's elite."},{"name":"WLVEVA","text":"I agree, you have proven yourself. There is nary a soul in the Clan who doubts your ability."},{"name":"WLVEVA","text":"Be welcome to our highest rank, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. We wish you good fortune on your future hunts. And you will need it, for now you hunt the fiercest prey the Far East has to offer."},{"name":"WLVEVA","text":"On these hunts, we grade our quarry according to its strength. The higher the grade, the greater the bounty. But, of course, so too the greater the danger."},{"name":"WLVEVA","text":"Never has Estrild thought so highly of one of her recruits. You have come far. So far, any further words of warning may be meaningless, but I will give them all the same. Now more than ever, do not overestimate yourself. "},{"name":"SYSTEM","text":"You are now able to undertake elite Veteran Clan mark bills from the Clan Hunt boards in Kugane and Rhalgr's Reach."},{"name":"ESTRILD","text":"You and I are bonded by the Clan, my <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span> of the Hunt. I'll not suffer you to die lightly now. Go and speak with Wlveva. The Hunt calls!"}],"reward":{"gil":533,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68474]}},"partials":[{"type":"npc","id":"1019007","obj":{"i":1019007,"n":"Estrild","l":2404,"s":1,"q":4,"t":"Clan Centurio Member","r":1,"a":2906,"c":[10.4,10.29]}},{"type":"npc","id":"1019009","obj":{"i":1019009,"n":"Wlveva","l":2404,"q":4}},{"type":"quest","id":"68474","obj":{"i":68474,"n":"Three-star Veteran Clan Hunt","g":107,"l":"Kugane","s":10030,"f":1}}]}