{"quest":{"name":"Another Striking Opportunity","location":"Rhalgr's Reach","id":68476,"patch":4.0,"sort":10030,"icon":100717,"unlocksFunction":1,"eventIcon":71341,"issuer":1023642,"target":1022849,"genre":103,"journal":["Your reputation precedes you, if the wide-eyed look the stranger is favoring you with is any indication.","In Rhalgr's Reach you are approached by a starry-eyed Ala Mhigan who thanks you for your service to the Resistance and states that he wishes to share with you an opportunity. Perhaps believing it to be more dramatic, he refrains from telling you what the opportunity actually is, and instead bids you speak with a mysterious veteran who waits for you outside Rhalgr's Reach.","The veteran tells you of a place called the Circles of Answering, where the monks of the Fist of Rhalgr used to hone body and mind. By the grace of his Doman patron, this training ground has been reborn as Stone, Sky, Sea...in spirit, if not in name. There you may challenge striking dummies tailored to the strengths of various beings fantastic and otherworldly. Should you triumph in the allotted time, you will know you are ready to face them in battle...though whether or not you will survive the actual encounter is an altogether different question. Dummies, after all, do not hit back..."],"objectives":["Speak with the battle-scarred veteran."],"dialogue":[{"name":"RESISTANCE02940","text":"<span class=\"highlight\">Forename Surname</span>! Hero of the Resistance! Greetings and well met. I wished to thank you for your countless deeds in service to our cause, and share with you an opportunity which I believe may be of interest to you."},{"name":"RESISTANCE02940","text":"There is a great and wise man─a veteran of countless battles─who waits for you outside Rhalgr's Reach. Go to him, and he will unfold all."},{"name":"GREATMAN02940","text":"It is you. The legendary adventurer instrumental in the liberation of our homeland. Aye, though it took an army to see it through, I have heard tell of your singular accomplishments, both here and in faraway lands."},{"name":"GREATMAN02940","text":"Heh heh, I know the type. You are a warrior, through and through, ever searching for a new challenge! A <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who lives for those moments when all hangs in the balance!"},{"name":"GREATMAN02940","text":"...Did I say something odd? No, of course not. Ahem! Not far from here is a place where monks of the Fist of Rhalgr once honed body and spirit: the Circles of Answering! And, by the grace of our Doman patron, it is reborn!"},{"name":"GREATMAN02940","text":"\"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> who fights with strength of stone unyielding, breathes deep of boundless sky and embraces serenity of rolling sea, against <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> none can stand.“"},{"name":"GREATMAN02940","text":"To wit, you will face striking dummies possessed of the fortitude of fantastic fiends and otherworldly foes. Attack them with your might and main, and should you triumph in the allotted time, you will know you have the strength to defeat them...though you may still die in the process. They are dummies, after all, and will not hit back. But that goes without saying."},{"name":"GREATMAN02940","text":"Doubtless you are intrigued. When curiosity overwhelms you, I shall deliver you to Stone, Sky─ Well, it is still the “Circles of Answering” in name, but you must nevertheless embrace the wisdom of the elements to overcome your trials!"},{"name":"GREATMAN02940","text":"Oh, how foolish of me! I forgot to tell you the best part: it's free!"},{"name":"SYSTEM","text":"You now have access to the Circles of Answering─an expansion of Stone, Sky, Sea. This training ground can be accessed by speaking with the battle-scarred veteran outside Rhalgr's Reach."}],"reward":{"gil":533,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68089,67654]}},"partials":[{"type":"npc","id":"1023642","obj":{"i":1023642,"n":"Starry-eyed Ala Mhigan","l":2403,"q":1}},{"type":"npc","id":"1022849","obj":{"i":1022849,"n":"Battle-scarred Veteran","l":2406,"q":1}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}},{"type":"quest","id":"67654","obj":{"i":67654,"n":"A Striking Opportunity","g":101,"l":"Idyllshire","s":6000,"f":1}}]}