{"quest":{"name":"Two-star Veteran Clan Hunt","location":"Kugane","id":68473,"patch":4.0,"sort":10020,"unlocksFunction":1,"eventIcon":71341,"issuer":1019007,"target":1019009,"genre":107,"journal":["Estrild of the Shiokaze Hostelry continues to keep a close, enlisting eye on passersby."],"objectives":["Speak with Wlveva."],"dialogue":[{"name":"ESTRILD","text":"Gods be good! It is not every day I see one as strong as you pass by. I am Estrild, of Clan Centurio, and I invite you to take part on our Hunt!"},{"name":"ESTRILD","text":"Ahhh, but I know your face. Aye, aye, you are the firebrand. The one whose ways have kept <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> from rising through our ranks. <span class=\"highlight\">Forename</span>, was it not?"},{"name":"ESTRILD","text":"It has been some while since last we met. Your eyes have changed, and that for the better. I'd venture you've had your share of grazes with death since then."},{"name":"ESTRILD","text":"Aye, the one-star bills are no longer fit for you. Go and speak with Wlveva. See if the Clan will not issue you bills more suited to one of your abilities. For as the hunter grows, so too must the hunt!"},{"name":"ESTRILD","text":"Go well, friend!"},{"name":"WLVEVA","text":"You must be <span class=\"highlight\">Forename</span>. Estrild told me to expect you. She mentioned it was time you tried your hand at a second star."},{"name":"WLVEVA","text":"It would seem she's taken quite a liking to you. And rightly so. Estrild has always fawned on strong <span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span>. I suppose there's no faulting her for that."},{"name":"WLVEVA","text":"So be it. I will see to it our two-stars are at your disposal. But you would do well to know the difficulty will be far greater than one-star hunts you've seen. Prepare yourself."},{"name":"SYSTEM","text":"Two-star Veteran Clan mark bills are now available."},{"name":"SYSTEM","text":"You are now able to undertake two-star Veteran Clan mark bills from the Clan Hunt boards in Kugane and Rhalgr's Reach."},{"name":"SYSTEM","text":"New quests and three-star Veteran Clan mark bills will become available from Estrild at the Shiokaze Hostelry upon reaching level 66."},{"name":"ESTRILD","text":"See if the Clan will not issue you bills more suited to one of your abilities. For as the hunter grows, so too must the hunt!"}],"reward":{"gil":500,"xp":95850},"reqs":{"jobs":[{"lvl":63,"id":34}],"quests":[68472]},"next":[68474]},"partials":[{"type":"npc","id":"1019007","obj":{"i":1019007,"n":"Estrild","l":2404,"s":1,"q":4,"t":"Clan Centurio Member","r":1,"a":2906,"c":[10.4,10.29]}},{"type":"npc","id":"1019009","obj":{"i":1019009,"n":"Wlveva","l":2404,"q":4}},{"type":"quest","id":"68472","obj":{"i":68472,"n":"One-star Veteran Clan Hunt","g":107,"l":"Kugane","s":10010,"f":1}},{"type":"quest","id":"68474","obj":{"i":68474,"n":"Three-star Veteran Clan Hunt","g":107,"l":"Kugane","s":10030,"f":1}}]}