{"quest":{"name":"One-star Veteran Clan Hunt","location":"Kugane","id":68472,"patch":4.0,"sort":10010,"unlocksFunction":1,"eventIcon":71341,"issuer":1019007,"target":1019009,"genre":107,"journal":["Estrild of the Shiokaze Hostelry is keeping a close, enlisting eye on passersby."],"objectives":["Speak with Wlveva."],"dialogue":[{"name":"ESTRILD","text":"You there. Aye, you. You look to be a strong one. I'm Estrild, of Clan Centurio. Tell me, have you any interest in joining the Hunt?"},{"name":"ESTRILD","text":"Just a moment... You are a newly made member of Clan Centurio, are you not? <span class=\"highlight\">Forename</span>, was it?"},{"name":"ESTRILD","text":"Aye, I knew it! I've heard your name from good Ardolain. To hear him tell it, you're quite the hunter."},{"name":"ESTRILD","text":"But if there is truth to that, then tell me─why are you yet but a fledgling <span class=\"alternative-container\"><span class=\"alternative\">huntswoman</span><span class=\"alternative\">huntsman</span></span>? Mayhap you've made an ill name for yourself. No reverence for authority? Trouble getting on with others? No matter. The Hunt will solve all your worries and woes. Kill your quarry and redeem your reputation!"},{"name":"ESTRILD","text":"There is no need for fanciful or flowery explanations. Simply hunt, hunt, hunt, and hunt some more! The more monsters that die by your hand, the more the Clan will hold you in high esteem. Heed the call, and prove yourself!"},{"name":"ESTRILD","text":"Ahhh, just talking of the Hunt sets my blood to surging! No doubt you care to know more, for how could you not? Go and see Wlveva outside the Shiokaze Hostelry. She will tell you all you need to know. Off with you, then!"},{"name":"WLVEVA","text":"Estrild sent you, did she? So, you are the one of our Clan named <span class=\"highlight\">Forename</span>."},{"name":"WLVEVA","text":"Well met, <span class=\"alternative-container\"><span class=\"alternative\">sister</span><span class=\"alternative\">brother</span></span>. I am Wlveva, and like Estrild I am a veteran member of Clan Centurio. The Clan Hunt board here in Kugane is under my keeping."},{"name":"WLVEVA","text":"I confess, I am shocked to hear an adventurer who has made such a name for <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> as you has yet to rise in our ranks. What evils have you done to stay your climb?"},{"name":"WLVEVA","text":"Oh, I'm in the wrong, am I? Well, this much I know to be right─for a savage such as yourself to languish in our lowest ranks is a waste not often seen in Clan Centurio."},{"name":"WLVEVA","text":"And so by the power vested in me by Clan Centurio, I grant you the right to undertake one-star Veteran Clan mark bills. See them done in number, and one day you, too, will find yourself among the Centurio elite."},{"name":"WLVEVA","text":"Heed this advice─do not mock the single star. The strength and ferocity of your prey will be far greater than others you've known before. Hunt bold, but hunt wary."},{"name":"SYSTEM","text":"You are now able to undertake one-star Veteran Clan mark bills from the Clan Hunt boards in Kugane and Rhalgr's Reach."},{"name":"SYSTEM","text":"Defeat the monsters described on the bills and you will be rewarded with Centurio Seals, which can be exchanged for exclusive items."},{"name":"SYSTEM","text":"To exchange Centurio Seals for exclusive items, speak with either Estrild or Satsuya at the Shiokaze Hostelry, or with Billebaut or Leuekin in Rhalgr's Reach."},{"name":"SYSTEM","text":"New quests and two-star Veteran Clan mark bills will become available from Estrild at the Shiokaze Hostelry upon reaching level 63."},{"name":"ESTRILD","text":"Speak to Wlveva for more information on the Hunt."}],"reward":{"gil":490,"xp":87750},"reqs":{"jobs":[{"lvl":61,"id":34}],"questsType":"all","quests":[67658,68008]},"next":[68473]},"partials":[{"type":"npc","id":"1019007","obj":{"i":1019007,"n":"Estrild","l":2404,"s":1,"q":4,"t":"Clan Centurio Member","r":1,"a":2906,"c":[10.4,10.29]}},{"type":"npc","id":"1019009","obj":{"i":1019009,"n":"Wlveva","l":2404,"q":4}},{"type":"quest","id":"67658","obj":{"i":67658,"n":"Elite and Dangerous","g":96,"l":"Ishgard","s":16001,"f":1}},{"type":"quest","id":"68008","obj":{"i":68008,"n":"By the Grace of Lord Lolorito","g":6,"l":"Kugane","s":270}},{"type":"quest","id":"68473","obj":{"i":68473,"n":"Two-star Veteran Clan Hunt","g":107,"l":"Kugane","s":10020,"f":1}}]}