{"quest":{"name":"Songs in the Key of Kugane","location":"Kugane","id":68479,"patch":4.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1022622,"target":1022622,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"WANDERINGMINSTREL","text":"Ah, who should stand before me but the hero who shattered the shackles of oppression in Doma and Ala Mhigo both! In spite of your burgeoning fame, I am honored that you should willingly share your precious time with this humble minstrel."},{"name":"WANDERINGMINSTREL","text":"If I may ask, how are you enjoying the Far East? With its many charms, it is an easy place to like. Indeed, it holds a special place in my heart; you might even say it is a second home to me, often as I find myself here on my endless quest for verse."},{"name":"WANDERINGMINSTREL","text":"And on this particular visit, the proprietor of this theater chanced to hear me perform and took a shine to my work. One thing led to another, and a number of my songs were adapted for the stage!"},{"name":"WANDERINGMINSTREL","text":"Such are the crowds they have drawn, I have since been commissioned to write pieces for a new production."},{"name":"WANDERINGMINSTREL","text":"That is not to brag, mind you─nay, far from it. For though I am glad for the approval, the truth is I have been struggling to summon forth the inspiration with which to fuel my creativity."},{"name":"WANDERINGMINSTREL","text":"...But of course! Your recent exploits could well provide me with the inspiration I need!"},{"name":"WANDERINGMINSTREL","text":"Such events you must have witnessed, such emotions experienced, in your struggle to liberate Doma and Ala Mhigo from the clutches of the Empire. Though the tales have been doing their rounds, there is no substituting a firsthand account. Nay, I would see from the eyes of <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who stood in the thick of it and know the depths of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> heart."},{"name":"WANDERINGMINSTREL","text":"I shall remain in Kugane while I compose my pieces for the Mujikoza. Whenever you can spare a moment, I ask that you regale unto me your recent adventures, and I shall see to it they are immortalized within these halls!"}],"reqs":{"jobs":[{"lvl":70,"id":1}],"quests":[68089]}},"partials":[{"type":"npc","id":"1022622","obj":{"i":1022622,"n":"Wandering Minstrel","l":2404,"q":1}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}}]}