{"quest":{"name":"A Glimpse of Madness","location":"Yanxia","id":68470,"patch":4.0,"sort":480,"eventIcon":71201,"issuer":1020004,"target":1020011,"involved":[1020007,1020008,1020009,1020010,1020017],"genre":6,"journal":["It is not often that the Liberation Front guard welcomes heroes from distant lands, but he is doing his best to compose himself.","Speak with your friends.","Speak with Yugiri."],"objectives":["Speak with the Liberation Front guard.","Speak with your friends.","Speak with Yugiri."],"dialogue":[{"name":"GOSETSU","text":"I...I require but a moment to catch my breath..."},{"name":"RESSIANGATEKEEPER","text":"You are <span class=\"highlight\">Forename Surname</span>, are you not? We were told of your coming."},{"name":"RESSIANGATEKEEPER","text":"Heroes of Eorzea, we of the Doman Liberation Front are honored to receive you. If you would be so good as to follow me..."},{"name":"RESSIANGATEKEEPER","text":"...Is aught amiss? Pray come inside!"},{"name":"SYSTEM","text":"Enter the House of the Fierce?"},{"name":"YUGIRI","text":"Though our resources are limited, our stronghold is secure. You may rest and recover here in safety."},{"name":"RESISTANCE02492","text":"To think that warriors such as you journeyed across the seas to aid our cause... We cannot thank you enough!"},{"name":"ALISAIE","text":"As you can see, they went to great lengths to disable the aetheryte. Apparently, in the twilight days of the rebellion, they feared that Zenos would be willing to risk sending unattuned conscripts."},{"name":"ALISAIE","text":"That said, it is hardly irreversible. They have the necessary materials. It would be a challenge to repair it alone, but mayhap with my brother's help..."},{"name":"ALISAIE","text":"Moenbryda could have done it with her eyes closed. What little Alphinaud and I know of aetheryte technology, we learned from her when she came to visit Grandfather."},{"name":"GOSETSU","text":"Mayhap a brief respite is in order. Were I twenty years younger, these wounds would not warrant a second glance. Alas, no samurai has the strength to defeat that villain Old Age."},{"name":"GOSETSU","text":"But what say you to the House of the Fierce? Compared to your Rising Stones, I concede it may seem somewhat lacking..."},{"name":"GOSETSU","text":"But it has been a haven these past ten years to all who would set Doma free."},{"name":"GOSETSU","text":"Regrettably, our efforts in that time have come to little and less..."},{"name":"GOSETSU","text":"&lt;sigh&gt; When the Emperor died, we were so <span class=\"emphasis\">sure</span> the hour of our liberation was at hand. But Zenos soon put paid to that, with the aid of Yotsuyu and the secrets she sold."},{"name":"GOSETSU","text":"Before the might of the XIIth Legion, our forces were as cattle to be slaughtered. Not even the shinobi escaped their wrath. Yet somehow our sanctuary remained undiscovered, and we few lived to fight another day."},{"name":"LYSE","text":"You should hear this, <span class=\"highlight\">Forename</span>. He was just telling me about Zenos and the rebellion."},{"name":"RESISTANCE02492","text":"What you have to understand is that it was not a simple matter of numbers. The bulk of the XIIth never even took the field. It was Zenos's stratagems that won the war. They were unlike anything we had ever seen."},{"name":"RESISTANCE02492","text":"His formations were unorthodox─bewildering. We honestly thought we had him on the back foot. One moment we were pressing home our advantage, the next we were surrounded and at his mercy."},{"name":"RESISTANCE02492","text":"And then he stood before us, his cornered prey. Alone and unarmed. He beckoned us to come forward and fight for our lives."},{"name":"RESISTANCE02492","text":"One by one, my comrades charged. Fearless and unflinching, he would dance amidst their blades for a time, and then draw close, as if to embrace..."},{"name":"RESISTANCE02492","text":"One...after...another. He made us watch. Do you understand? He made us watch."},{"name":"LYSE","text":"What kind of monster enjoys killing people?"},{"name":"RESISTANCE02492","text":"...I do not think there was any joy in it. Nor justice, nor morality, nor meaning. To him, the weight of one life is no different from that of a thousand."},{"name":"RESISTANCE02492","text":"A challenge had been issued and was accepted. But on finding us no challenge at all, his objective changed."},{"name":"RESISTANCE02492","text":"There were tales of imperial soldiers being flayed for slaughtering families. For breaking brave men's spirits. Only later did I come to understand why. He did not desire obedience. He desired hate...and men consumed by it."},{"name":"RESISTANCE02492","text":"A new battle. A new enemy. A new challenge.<br>The hunt, I am told he called it. A hunt without end."},{"name":"RESISTANCE02492","text":"And when all our best lay dead and broken, he left.<br>He left, muttering that we had “bored” him."},{"name":"RESISTANCE02492","text":"But our weapons, at least, held his interest. For he took a fallen samurai's sword, having grown...fond of it."},{"name":"RESISTANCE02492","text":"Since that day, he has ever wielded Far Eastern blades. He is said to be fascinated by ones with storied histories, and so soldiers who seek to curry his favor often present those of defeated enemies as gifts."},{"name":"LYSE","text":"It's like it's all a game to him. People are suffering─dying─and he's collecting swords?"},{"name":"RESISTANCE02492","text":"...We all feel the same. But my lady, you must understand..."},{"name":"RESISTANCE02492","text":"On the battlefield, reasons do not matter. The victor is not the just, but the strong, and the strong become the heroes of the tale. We were not strong enough."},{"name":"RESISTANCE02492","text":"It is not sufficient to be right. To be just. Without strength, our path has but one end..."},{"name":"LYSE","text":"If it's strength we need, then it's strength we'll get. We can't lose to him again..."},{"name":"YUGIRI","text":"<span class=\"highlight\">Forename</span>. I do hope you have taken this opportunity to rest and recover."},{"name":"YUGIRI","text":"It is well that you spoke with one of the survivors of that massacre. To defeat one's foe, one must first understand his true nature."},{"name":"YUGIRI","text":"As the Ala Mhigan Resistance has struggled, so too has the Doman Liberation Front. More so, perhaps, given the precarious position in which we find ourselves in the wake of our doomed rebellion."},{"name":"YUGIRI","text":"We are few, and our enemies legion. We are weak, and they strong. Yet with your help, I believe that there is little we cannot achieve... I only hope the depth of our predicament has not shaken your commitment to our cause."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Never. Victory will be ours!"},{"name":"A1","text":"No, no. I <span class=\"emphasis\">relish</span> the challenge."},{"name":"A1","text":"Not so long as I can expect a suitably generous reward."},{"name":"YUGIRI","text":"Aye, that it will. With the hero of Eorzea on our side, we cannot lose!"},{"name":"YUGIRI","text":"You...relish the thought of facing that monster again? But of course─the hero of Eorzea fears no foe!"},{"name":"YUGIRI","text":"...Of course. It may take time, but rest assured you will receive due compensation."}],"reward":{"gil":745,"items":[{"id":18223,"one":1,"hq":1},{"id":18235,"one":1,"hq":1},{"id":18241,"one":1,"hq":1},{"num":3,"id":5673,"one":1}],"xp":199800},"reqs":{"jobs":[{"lvl":64,"id":142}],"quests":[68028]},"next":[68029]},"partials":[{"type":"npc","id":"1020004","obj":{"i":1020004,"n":"Liberation Front Guard","l":2410,"q":2}},{"type":"npc","id":"1020011","obj":{"i":1020011,"n":"Yugiri","l":2805,"q":2}},{"type":"npc","id":"1020007","obj":{"i":1020007,"n":"Gosetsu","l":2410,"q":2}},{"type":"npc","id":"1020008","obj":{"i":1020008,"n":"Alisaie","l":2805,"q":1}},{"type":"npc","id":"1020009","obj":{"i":1020009,"n":"Gosetsu","l":2805,"q":1}},{"type":"npc","id":"1020010","obj":{"i":1020010,"n":"Lyse","l":2805,"q":2}},{"type":"npc","id":"1020017","obj":{"i":1020017,"n":"Liberation Front Infantry","l":2805,"q":2}},{"type":"item","id":"18223","obj":{"i":18223,"n":"Gyuki Leather Pot Helm","l":265,"c":40968,"t":34,"p":20778}},{"type":"item","id":"18235","obj":{"i":18235,"n":"Koppranickel Temple Chain","l":265,"c":40769,"t":34,"p":20778}},{"type":"item","id":"18241","obj":{"i":18241,"n":"Ruby Cotton Hat of Casting","l":265,"c":41375,"t":34,"p":20778}},{"type":"item","id":"5673","obj":{"i":5673,"n":"Savage Aim Materia V","l":160,"c":20258,"t":58,"materia":{"tier":4,"value":6,"attr":"Critical Hit","category":0}}},{"type":"quest","id":"68028","obj":{"i":68028,"n":"Life after Doma","g":6,"l":"Yanxia","s":470}},{"type":"quest","id":"68029","obj":{"i":68029,"n":"The Stubborn Remainder","g":6,"l":"Yanxia","s":490}}]}