{"quest":{"name":"Search for the Stolen Scroll","location":"Eastern La Noscea","id":68484,"patch":4.0,"sort":601,"icon":100673,"unlocksFunction":1,"eventIcon":71341,"issuer":1010139,"target":1010139,"involved":[1005411,1009943,1023544,1023545,1023546,1023547,1023550,1023551,1023582,1023751,1023752],"genre":152,"journal":["Oboro has the look of a man who has seen better days.","You find your old friend Oboro at something of a loss. News of his deeds on behalf of Princess Yuki have reached his village, revealing to the elders that he is hale, hearty, and entirely capable of making the journey home. Despite this, they do not seem particularly eager to welcome him back, a development which has the young shinobi feeling decidedly unappreciated. As Oboro laments his plight, he remembers that there is someone who requires his aid─Captain Jacke of the Rogues' Guild, who would investigate some shady Domans that have been stirring up trouble of late. Resolving to assist your friend and mentor in whatever way you can, you set out for Limsa.","Jacke relates to you a curious tale. The Krakens captured a crew of self-styled Doman sailors in the eastern seas, who offered all the treasures in their cargo hold in exchange for amnesty and safe passage to Eorzea. No sooner had the ship dropped anchor, however, than the Easterners vanished into the dark of night, taking with them only an inconspicuous scroll. Petty theft though it may be, the code is the code, and Jacke would see the scroll returned and the men brought to justice. At the guildmaster's behest, you make for the Drowning Wench to see if I'tolwann knows aught of the men's whereabouts.","As I'tolwann tells it, a group of boisterous Easterners visited the Wench not long before, shouting loudly and conspicuously about a profitable transaction they intend to make in Wineport. Jacke will doubtless be eager to hear the news.","Jacke listens to your report with great interest. Though more than a bit leery of how openly the men discussed their shady dealings, a lead is a lead. You set out for Wineport with Oboro and Jacke, taking care to watch your back and with your eyes and ears open.","Your arrival in Wineport is minutes too late─the men have already made off with a haul of wine, and were sighted heading for Bloodshore. Suspecting that it may not be meant for sale, but rather to slake a crew's thirst on a long ocean voyage, Jacke deduces that they intend to furtively sail back home with the ill-gotten scroll. Make for the south of Bloodshore and keep your eyes out for any suspicious Easterners.","You come upon three Hingan swordsman enjoying some of Wineport's finest on the beach. Not taking kindly to the interruption, they immediately draw their blades. Though you are able to make short work of them, the scroll is nowhere to be found. Head north to rendezvous with Jacke and Oboro, with the hope that their search has proved more fruitful than your own.","Jacke and Oboro are no worse for the wear after a similar scuffle with Hingan ruffians, but have gained no insight into the whereabouts of the scroll you seek. No sooner have you begun to ponder your next course of action when you are greeted by the sudden presence of the black marketeer from the House of Sticks, who─much to everyone's surprise─immediately reveals himself to be none other than Karasu Redbeak, Oboro's erstwhile friend and nemesis. As is his wont, Karasu speaks in riddles, cryptically alluding to a greater plot involving the scroll while offering precious little in the way of actual details─save that your true quarry sails for Kugane as you speak. Karasu disappears in a puff of smoke, and Oboro─clearly flustered─suggests that the three of you retreat to the nearby ninja hideout to discuss your next course of action in secret.","At the dock storehouse, you and your two companions come up with a plan. Jacke will sail ahead to Hingashi, with Oboro accompanying as a guide. In the meantime, you will train and hone your skills as a ninja, that you may be ready to answer the call when they need you. Bidding them a safe journey, you resolve to take your mastery of ninjutsu to new levels, as there is no telling what dangers await you across the Ruby Sea.<br><br>※The next ninja quest will be available from Yomei upon reaching level 63."],"objectives":["Speak with Jacke at the Rogues' Guild.","Speak with I'tolwann at the Drowning Wench.","Speak with Jacke at Bulwark Hall.","Rendezvous with Jacke in Wineport.","Search for suspicious Easterners at Bloodshore.","Rendezvous with Jacke.","Speak with Oboro at the dock storehouse."],"dialogue":[{"name":"OBORO","text":"Oh, alas and alack! Whatever am I to do..."},{"name":"OBORO","text":"Oh, <span class=\"highlight\">Forename</span>! As a shinobi, I am loath to admit this, but I did not see you come in."},{"name":"OBORO","text":"Truth be told, I have been somewhat distracted of late. Princess Yuki, it would seem, sent a letter to my village praising us for our efforts on her behalf─thus revealing my story of an injury preventing me from making the journey home for the ruse that it was."},{"name":"OBORO","text":"But my shame is not that I have been summoned back to the village, but rather quite the opposite. Despite knowing that I am hale and hearty, my elders seem to be in no particular hurry to welcome me back into the fold."},{"name":"OBORO","text":"“Should the time come when we have need for you in Doma, we shall summon for you. Until then, you are to remain at your post and do all in your power to aid our countrymen in Eorzea.” Such were their words."},{"name":"OBORO","text":"Is this how far I have fallen? Am I as a falcon bereft of its claws? A dull blade tossed to the wayside by its master? For all I know, I have been all but exiled to this place."},{"name":"OBORO","text":"I am sorry, <span class=\"highlight\">Forename</span>. Heaven knows that you did not come here to listen to my griping. On a brighter note, I just received word from Captain Jacke. It would seem some Easterners are causing something of a stir."},{"name":"OBORO","text":"I suppose I should be grateful that <span class=\"emphasis\">someone</span> still has need of my services. Anyhow, it would seem the kami have led you here at a most opportune time. Would you care to accompany me?"},{"name":"OBORO","text":"I thank you, my friend! Let us make for Limsa Lominsa and see what our friends at the Rogues' Guild would ask of us."},{"name":"OBORO","text":"I know not what my countrymen have done to catch Captain Jacke's eye, but I can only imagine it is nothing good..."},{"name":"JACKE","text":"Well, if it ain't the dimberest damber of 'em all. I trust ye've been keepin' yer stabbers sharpened? What with you <span class=\"emphasis\">and</span> Oboro on the job, I reckon all'll be bob afore the <span class=\"alternative-container\"><span class=\"alternative\">lightmans</span><span class=\"alternative\">darkmans</span></span> comes 'round."},{"name":"JACKE","text":"Here's where we stand: one o' me little birds in the Kraken's Arms came chirpin' to me a story 'bout some Domans who I reckon are breakin' one code or another."},{"name":"JACKE","text":"Seems they─the Krakens, that is─were out snilchin' the eastern seas when they grabbled a vessel flyin' Garlean colors, as they're wont to do. But then came the rub─the crew claimed to be Doman, ye see, and upon whiddlin' their captors' identity, they changed tack, beggin' for asylum on Eorzean shores an' offerin' the entirety of their cargo in full in return for safe passage."},{"name":"JACKE","text":"Call him a bene cove or a fool, the Kraken captain took the self-styled Domans up on their offer. Stowin' the Eastern treasures─an' the Easterners themselves─away in the hold, they set sail for Limsa."},{"name":"JACKE","text":"But after pullin' into port, a funny thing happened. No sooner had the Krakens dropped anchor than the “refugees” put on their best beater cases an' skulked off into the dead of darkmans, leavin' all their treasures behind."},{"name":"JACKE","text":"All their treasures save one─a scroll of sorts that had been hidin' in a corner, all inconspicuous-like. Carvallain reckons that these Doman “refugees” have played us for some rum fun, an' they're off sellin' the scroll on the black markets for good blunt even as we speak."},{"name":"OBORO","text":"...I see. So you would have us recover the scroll in question and bring the thieving Domans to justice. I am honored to lend what aid I can, and yet, I cannot help but wonder. Just what could it be about this scroll to make it so valuable to my countrymen?"},{"name":"JACKE","text":"Well, we're not goin' to whiddle the scrap just sittin' around here on our daddles, now are we? Let's snilch town and see what the common coves and morts have and haven't seen."},{"name":"JACKE","text":"<span class=\"highlight\">Forename</span>, why don't ye go pay I'tolwann a visit at the Wench? If there's any rumors goin' around about any shifty Easterners, like as not that mort would know."},{"name":"JACKE","text":"You <span class=\"emphasis\">do</span> remember what to order, aye? 'Course a dimber damber like yourself would. Good luck out there, an' keep yer wattles open─we'll be waitin' for ye in Bulwark Hall when yer through."},{"name":"ITOLWANN","text":"Welcome to the Drowning Wench! What's your pleasure, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>?"},{"name":"Q1","text":"What will you order?"},{"name":"A1","text":"A chilled ale."},{"name":"A2","text":"A strong ale."},{"name":"A3","text":"A weak ale."},{"name":"ITOLWANN","text":"Certainly, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Take a seat, and I'll bring it straight to your─ Hm? Changed your mind?"},{"name":"ITOLWANN","text":"Ah, you must be here on business. Mayhaps I could offer you something from our <span class=\"emphasis\">underground</span> menu. Now, what's your fancy?"},{"name":"ITOLWANN","text":"Guests from the <span class=\"emphasis\">East</span>, you say? Why, yes, I do believe we had some visitors not long ago matching that description. They left shortly before you arrived."},{"name":"ITOLWANN","text":"I make a habit of pricking my ears up to catch our patrons' every whisper, but the party in question required little such effort. Why, they were shouting of tales of riches and glory in a roar that could wake the dead!"},{"name":"ITOLWANN","text":"Said they were on their way to Wineport to make the transaction of a lifetime─though they weren't keen on going into detail. Just between us, I wouldn't be surprised if there was something less than <span class=\"emphasis\">savory</span> about their business. Speaking of savory, can I interest you in our seafood stew?"},{"name":"ITOLWANN","text":"The party of Easterners said they were en route to Wineport. I'd be wary if you plan on following them─they seemed to be a rather <span class=\"emphasis\">unsavory</span> lot."},{"name":"OBORO","text":"I wish you an <span class=\"emphasis\">ahoy</span> and an <span class=\"emphasis\">avast</span>, my honored matey! Ah, forgive me─I was just practicing my Lominsan dialect. How do you─er, <span class=\"emphasis\">ye</span>─reckon it sounds?"},{"name":"JACKE","text":"So our lads are headed to Wineport, eh? Bene work, <span class=\"highlight\">Forename</span>. Remind me to slip I'tolwann some extra blunt next time we stop by the Wench for libations."},{"name":"JACKE","text":"That said, somethin' doesn't sit right with me. Cacklin' their plans for every drunkard and tavern wench to hear? I reckon our friends might be lookin' to amuse us, if you whiddle my gist. Keep your eyes open and your stabbers sharp, mates."},{"name":"OBORO","text":"I am sorry, <span class=\"highlight\">Forename</span>. I fear we were too late..."},{"name":"JACKE","text":"Well, there's a bleedin' surprise. The code-breakin' curs have already bit the blow and hopped the twig, with a caravan's worth of bingo in tow. Word is they were last seen beatin' a path for Bloodshore."},{"name":"JACKE","text":"But what could they mean to─wait a bleedin' moment! What if the grog's not meant for sellin', but keepin' their throats wet on a long voyage? I reckon our lads are tryin' to smuggle the scroll home."},{"name":"JACKE","text":"There's no time to lose! Let's brush off our beater cases an' make for Bloodshore all quick-like. Oboro an' I'll snilch the north side─<span class=\"highlight\">Forename</span>, you take the south. We have to catch these curs afore they slip from our daddles for good!"},{"name":"DOMANPEOPLE02948","text":"Heh... You just had to poke your nose in our business, eh? Guess you leave us no choice..."},{"name":"POPMESSAGE","text":"The Hingan swordsmen draw their blades and attack!"},{"name":"OBORO","text":"This garb... Why, these men are samurai from Hingashi! Whatever is the meaning of this?"},{"name":"JACKE","text":"Let me guess. Ye came upon a couple of rough-lookin' coves. These coves came wavin' their stabbers in my face afore I could edge in a word─I reckon 'twas the same for you?"},{"name":"OBORO","text":"The scroll is nowhere to be seen, nor is anything resembling a ship. If I did not know better, I would say they were a simple group of ruffians enjoying their ill-gotten grog."},{"name":"KARASU","text":"(-???-)The dim one sees, but does he truly <span class=\"emphasis\">see</span>? No─these unfortunate men were but pawns in a grand scheme, as disposable as the bottles that now litter the shore."},{"name":"KARASU","text":"Meanwhile, your <span class=\"emphasis\">true</span> quarry has boarded a trader and sails for Kugane even as we speak, under the auspices of the East Aldenard Trading Company, no less! So cunning a scheme, I wish I'd thought of it myself─or <span class=\"emphasis\">did</span> I? Ahahaha!"},{"name":"JACKE","text":"How do ye know all─bugger me, yer the cove from the House o' Sticks!"},{"name":"OBORO","text":"Karasu Redbeak!?"},{"name":"KARASU","text":"Childhood friends turned bitter enemies, then friends once more─reunited after far too long! Our hero returns, and the audience swoons! O, what a joyous day─or <span class=\"emphasis\">is</span> it?"},{"name":"KARASU","text":"I'll say this much, dim one: for once, you've managed to surprise me. To think that the oh-so-serious Oboro would lie to his elders to avoid having to make the journey home─only to find he wasn't welcome to begin with! Oh, the irony of it all!"},{"name":"OBORO","text":"Enough of your preening and prattling, Karasu! I want answers. How did you know we were here? Just what is your connection to the thieves we pursue?"},{"name":"KARASU","text":"Ahahaha! You mean the thieves who already eluded your clumsy grasp─just as I am about to do? I fear <span class=\"emphasis\">that</span> is a story for another day!"},{"name":"OBORO","text":"Bah! Ever the slippery bird, that one."},{"name":"JACKE","text":"That daft rook's an acquaintance of yours? That's news to Jacke's wattles. Meanwhile, we've got our work cut out for us if we still want to grabble that scroll. Is there anywhere we can have a few whids─ye know, secret-like?"},{"name":"OBORO","text":"Say no more, Captain Jacke. As luck would have it, our base of operations is but a short walk from these parts. <span class=\"highlight\">Forename</span>, pray join us at the storehouse."},{"name":"JACKE","text":"I reckon this is about the shabbiest, shoddiest shack ol' Jacke's ever laid eyes on─in other whids, the perfect hideout. Aye, Oboro's sharper than he lets on."},{"name":"OBORO","text":"Karasu Redbeak... Of all the places I thought our search might lead us, never in my wildest dreams did I think it would lead us to <span class=\"emphasis\">him</span>!"},{"name":"JACKE","text":"Come square with me, Oboro. Just who is this Karasu cove? Can we trust him, or is he like as not to stick us his stabbers in our back the moment we turn a blind eye?"},{"name":"OBORO","text":"N-No! I mean, yes! I mean he's neither─or both? Perhaps I should say...it's complicated. "},{"name":"JACKE","text":"Judgin' from yer reaction, it sure seems as much. Anyway, if our men have set sail for Hingashi, I reckon we've no choice but to do the same. I wasn't exactly preparin' for a long voyage, but damned if I'll leave this job half-done."},{"name":"JACKE","text":"That said, 'shamed as I am to admit it, this is ol' Jacke's first journey to the Far East─I wouldn't know Kugane from a rum doxy's arse, and I don't know a rogue what can do his work without knowin' the lay of the land."},{"name":"OBORO","text":"Worry not, Captain Jacke! I have traveled there on many an occasion to procure the tools of my trade from the finest Hingan artisans. It would be my pleasure to serve as your guide."},{"name":"OBORO","text":"Your presence would be most heartening as well, <span class=\"highlight\">Forename</span>. Kugane is a city where anything can happen, and there is no telling what dangers await us there."},{"name":"JACKE","text":"I'll agree with that─but mind ye, <span class=\"highlight\">Forename</span>'s a right busy <span class=\"alternative-container\"><span class=\"alternative\">mort</span><span class=\"alternative\">cove</span></span>. What say we do it this way? Oboro an' I will go on ahead, an' we'll send for you once we've snilched out the place and worked out our next plan of action."},{"name":"OBORO","text":"A reasonable plan, Captain Jacke. In that case, <span class=\"highlight\">Forename</span>, pray check in at the storehouse from time to time. I will send word to Yomei when we require your services. In the meantime, may the kami guide you in your training!"},{"name":"SYSTEM","text":"The next ninja quest will be available from Yomei upon reaching level 63."},{"name":"SYSTEM","text":"The requirements for undertaking subsequent quests can be reviewed in your journal."}],"reward":{"gil":1312,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":92}],"questsType":"all","quests":[67224,67895]},"next":[68485]},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1005411","obj":{"i":1005411,"n":"I'tolwann","l":28,"q":5}},{"type":"npc","id":"1009943","obj":{"i":1009943,"n":"Jacke","l":1427,"q":15,"t":"Guildmaster"}},{"type":"npc","id":"1023544","obj":{"i":1023544,"n":"Oboro","l":1427,"q":1}},{"type":"npc","id":"1023545","obj":{"i":1023545,"n":"Jacke","l":32,"q":1}},{"type":"npc","id":"1023546","obj":{"i":1023546,"n":"Oboro","l":32,"q":1}},{"type":"npc","id":"1023547","obj":{"i":1023547,"n":"Rough-hewn Hingan","l":32,"q":1}},{"type":"npc","id":"1023550","obj":{"i":1023550,"n":"Jacke","l":32,"q":1}},{"type":"npc","id":"1023551","obj":{"i":1023551,"n":"Oboro","l":32,"q":1}},{"type":"npc","id":"1023582","obj":{"i":1023582,"n":"Jacke","l":1428,"q":1}},{"type":"npc","id":"1023751","obj":{"i":1023751,"n":"Jacke","l":29,"q":1}},{"type":"npc","id":"1023752","obj":{"i":1023752,"n":"Oboro","l":29,"q":1}},{"type":"quest","id":"67224","obj":{"i":67224,"n":"In Her Defense","g":152,"l":"Eastern La Noscea","s":600,"f":1}},{"type":"quest","id":"67895","obj":{"i":67895,"n":"The Far Edge of Fate","g":5,"l":"Gridania","s":19}},{"type":"quest","id":"68485","obj":{"i":68485,"n":"Ninja Bathin' Redux","g":152,"l":"Eastern La Noscea","s":630,"f":1}}]}