{"quest":{"name":"The Arrows of Misfortune","location":"The Ruby Sea","id":68489,"patch":4.0,"sort":355,"eventIcon":71201,"issuer":1021507,"target":1021507,"involved":[1023682],"genre":6,"journal":["Kajika is nodding sagely in your direction."],"objectives":["Search for the gyuki carcass.","Recover the usable arrows.","Butcher the gyuki's tail for meat.","Deliver the arrows and meat to Kajika."],"dialogue":[{"name":"KAJIKA","text":"You strike me as a strong and capable individual. I've a job for you, Westerner, if you are courageous as well."},{"name":"KAJIKA","text":"On the beach far to the west lies the carcass of a gyuki, feathered with arrows. I would have you go and retrieve those which may still be of use."},{"name":"KAJIKA","text":"While you are about it, I should be glad if you were to butcher its tail for meat. Very good meat in gyuki tails, you know."},{"name":"KAJIKA","text":"But I did say you would need be a courageous sort, and I meant it. The beast was young. Do not be surprised if an angry mother mourns its child."},{"name":"KAJIKA","text":"Retrieve what arrows you can from the carcass, and bring me the meat of its tail. Do this, and you will have my gratitude."},{"name":"SYSTEM","text":"The rotting carcass of the gyuki emits a powerful stench that fills the air..."},{"name":"KAJIKA","text":"You have been away for some time─perhaps in search of a young gyuki corpse?"},{"name":"KAJIKA","text":"I see I did not misjudge you! Thank you for your help. Would that I could have tended to my own kill, but such is life..."},{"name":"KAJIKA","text":"A pity the meat is not as delicious as it is nutritious. Under normal circumstances, we would not bother hunting gyuki as game, but as you may have heard, these are not normal circumstances."},{"name":"KAJIKA","text":"Arrows too must be reused when possible. A prudent measure become necessary, alas. With every passing day our future grows more uncertain..."},{"name":"KAJIKA","text":"But this day we shall have full bellies, and in that must we take solace. And wayward travelers need not risk the ire of vengeful gyuki by wandering near my neglected kill."},{"name":"KAJIKA","text":"A strange sigh passes your lips. Have I said something odd? No matter─ Thank you again for your aid!"}],"reward":{"gil":695,"xp":183600},"reqs":{"jobs":[{"lvl":62,"id":142}],"quests":[68016]}},"partials":[{"type":"npc","id":"1021507","obj":{"i":1021507,"n":"Kajika","l":2409,"q":1}},{"type":"npc","id":"1023682","obj":{"i":1023682,"n":"Gyuki Carcass","l":2409,"q":1}},{"type":"quest","id":"68016","obj":{"i":68016,"n":"Confederate Consternation","g":6,"l":"The Ruby Sea","s":350}}]}