{"quest":{"name":"How Tataru Got Her Groove Back","location":"Kugane","id":68482,"patch":4.0,"sort":780,"eventIcon":71201,"issuer":1023084,"target":1020519,"involved":[1020221,1020222,1020223,1020224,1020225,1020520,1020523,1020622],"genre":6,"journal":["Tataru has grown rather accustomed to her life in Kugane."],"objectives":["Search Kugane for the overworked porter.","Deliver Cid's parcel to Tataru.","Deliver the magitek field generator manual to Alphinaud in Yanxia."],"dialogue":[{"name":"ALISAIE","text":"I suppose I ought to go and take stock of our supplies. We'll be needing a lot of weapons..."},{"name":"TATARU","text":"You're here for the parcel Cid sent, right? Wait a moment, and it will be right out!"},{"name":"TATARU","text":"It arrived not long ago. A porter delivered it to our offices, along with various other knickknacks from Eorzea."},{"name":"TATARU","text":"Cid regrets that he couldn't come here in person. Apparently his hunt for the dragon and Omega demands his full attention, you see..."},{"name":"TATARU","text":"Still, he was reasonably confident that the documents he provided would be enough for Alphinaud to do the work himself. So as soon as that parcel gets here, we can open it up and see what's inside!"},{"name":"HANCOCK","text":"Pardon my interruption, but the parcel in question─was it the one you placed on the shelf in the back for safekeeping?"},{"name":"TATARU","text":"I believe so, yes. Why do you ask?"},{"name":"HANCOCK","text":"Well, you see, on closer inspection, said parcel appears to have been addressed to the Sekiseigumi Barracks."},{"name":"HANCOCK","text":"Though it does indeed bulge with a quantity of paper reminiscent of a rather large instruction manual, the lingering scent of lilac leads me to conclude it is in fact a sizable collection of love letters..."},{"name":"TATARU","text":"What!? Impossible! That porter was carrying a parcel addressed to us! I saw the writing with my own eyes!"},{"name":"HANCOCK","text":"Oh, I do not doubt that in the least. However, as he was tasked with a number of deliveries, I can only presume that he handed you another parcel by mistake."},{"name":"TATARU","text":"This is a disaster! We have to find that porter right this instant!"},{"name":"HANCOCK","text":"My, she can move quickly when she has a mind to do so. So quickly she neglected to take these love letters with her. They too must be redirected to their rightful recipient."},{"name":"HANCOCK","text":"They should also aid you in tracking down the right porter. They keep records of their deliveries and so forth, after all."},{"name":"HANCOCK","text":"The man in question was of middling height and build. Not unlike myself. Black hair, short─terribly helpful in Kugane, I know. A cheery sort. Wearing bright colors, as I recall?"},{"name":"HANCOCK","text":"I will send a few of my men out to search, but in the meantime, why don't you take the parcel and see if you can't track him down yourself? I will wait here, on the off chance he realizes his mistake and returns."},{"name":"HANCOCK","text":"Short, black hair, light-colored garments. In all other respects, not unlike myself. But then, I am so terribly unremarkable, am I not?"},{"name":"TATARU","text":"Hey, you! Yeah, you! You came by the Ruby Bazaar earlier, right? Where's my parcel!?"},{"name":"MAND02946","text":"Why are you yelling at me!? Who are you!?"},{"name":"MANA02946","text":"Hm? Who are you? You seek company? For an hour or an evening?"},{"name":"MANA02946","text":"Ugh, how it reeks of perfume and desperation. I know naught of it, nor do I wish to know."},{"name":"MANB02946","text":"Oh dear, oh dear... I misplaced some most important documents, and if I do not find them quickly, there will be dire repercussions..."},{"name":"MANB02946","text":"No, no, it is nothing so scandalous and base! &lt;sigh&gt; My lord is a man with singular dietary restrictions, which I have detailed in my notebook. I cannot purchase produce without it!"},{"name":"MANC02946","text":"A good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, but I have no time to chat! I have to head to the Bokairo! ...Or was it the Hostelry? Bah, no time, no time!"},{"name":"MANC02946","text":"Hm? Aye, I recognize that parcel. I delivered it to the Ruby Bazaar not long ago. What of it?"},{"name":"MANC02946","text":"Eh? A mistake? For the Sekiseigumi, you say?"},{"name":"MANC02946","text":"Bah, you're right! How stupid of me. Fortunately, I have yet to visit the barracks. This is for you, yes? I will take the other in exchange."},{"name":"MANA02946","text":"Oh, if only I could relax like this every day..."},{"name":"MANB02946","text":"I suppose I could try to buy produce without it. What is the worst that could happen? He could...get very sick, or perhaps die...and the Sekiseigumi could judge me a murderer and execute me... Oh dear..."},{"name":"MANC02946","text":"I must remember to be more careful! The last thing I need is to be cursed by my customers..."},{"name":"HANCOCK","text":"Back already? Tataru is as well. She couldn't find the porter, in case you're wondering."},{"name":"TATARU","text":"I'm sorry, I couldn't find him. I guess we just have to hope he realizes his mistake and returns soon..."},{"name":"TATARU","text":"That's it! That's the parcel! You found him!"},{"name":"TATARU","text":"Though, knowing our luck, Cid put the wrong papers in here..."},{"name":"TATARU","text":"Nope, this is it! These are the documents detailing the operation of the magitek field generators Alphinaud requested!"},{"name":"HANCOCK","text":"I can only imagine what would have happened had we sent <span class=\"highlight\">Forename</span> back to Doma with a parcel full of love letters. The look on Alphinaud's face when he reads the first page... On second thought, I'm a little disappointed we didn't."},{"name":"TATARU","text":"Everyone's working so hard to fight for Doma's freedom, and here I am, making the same silly mistakes..."},{"name":"TATARU","text":"It won't happen again, <span class=\"highlight\">Forename</span>! And I'll keep working hard to bring you and the others useful information!"},{"name":"TATARU","text":"If we hear anything new, we'll contact you straightaway!"},{"name":"HANCOCK","text":"Oh, and you may be pleased to hear that we have brokered an arrangement between the company and the Confederacy. They require armaments, we provide. Discreetly, and at a reasonable price."},{"name":"TATARU","text":"I'm sure Lord Lolorito was pleased to hear it."},{"name":"HANCOCK","text":"Ahaha! Indeed he was, indeed he was."},{"name":"TATARU","text":"Well, it seems our time together is at an end! Give Alphinaud and Alisaie my regards, will you?"},{"name":"TATARU","text":"We've got eyes on the Garlean embassy, just so you know. If we notice anything suspicious, you'll be the first to hear about it."},{"name":"HANCOCK","text":"I can see it now. Confederate ships sailing up the One River, equipped with the finest Lominsan-made cannons, provided by the East Aldenard Trading Company. The world is not as big as it once was, my friend."},{"name":"ALISAIE","text":"So much to do, and so little time to do it..."},{"name":"YUGIRI","text":"You are returned from Kugane? How fares Tataru?"},{"name":"ALPHINAUD","text":"Oh! It seems like just yesterday you were here. Our plans proceed apace. Do you have the documents?"},{"name":"ALPHINAUD","text":"Excellent! This looks to be exactly what we need."},{"name":"ALPHINAUD","text":"Assuming our shinobi escort can see us safely inside the Moon Gates, I should have no trouble deactivating the barrier. Good, good─that is one less thing to worry about..."}],"reward":{"gil":696,"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68055]},"next":[68056,68340,68341,68342,68343,68344,68345,68346,68347]},"partials":[{"type":"npc","id":"1023084","obj":{"i":1023084,"n":"Tataru","l":2927,"q":2}},{"type":"npc","id":"1020519","obj":{"i":1020519,"n":"Alphinaud","l":2410,"q":8}},{"type":"npc","id":"1020221","obj":{"i":1020221,"n":"Languid Youth","l":2404,"q":1}},{"type":"npc","id":"1020222","obj":{"i":1020222,"n":"Overworked Porter","l":2404,"q":1}},{"type":"npc","id":"1020223","obj":{"i":1020223,"n":"Addled Assistant","l":2404,"q":1}},{"type":"npc","id":"1020224","obj":{"i":1020224,"n":"Perplexed Pedestrian","l":2404,"q":1}},{"type":"npc","id":"1020225","obj":{"i":1020225,"n":"Tataru","l":2404,"q":1}},{"type":"npc","id":"1020520","obj":{"i":1020520,"n":"Alisaie","l":2410,"q":6}},{"type":"npc","id":"1020523","obj":{"i":1020523,"n":"Yugiri","l":2410,"q":8}},{"type":"npc","id":"1020622","obj":{"i":1020622,"n":"Hancock","l":2927,"q":6}},{"type":"quest","id":"68055","obj":{"i":68055,"n":"The Room Where It Happened","g":6,"l":"Yanxia","s":770}},{"type":"quest","id":"68056","obj":{"i":68056,"n":"Seeds of Despair","g":6,"l":"Yanxia","s":790}},{"type":"quest","id":"68340","obj":{"i":68340,"n":"Assistants Anonymous","g":109,"l":"Yanxia","s":7010}},{"type":"quest","id":"68341","obj":{"i":68341,"n":"The Rainbow Collection","g":109,"l":"Yanxia","s":7020}},{"type":"quest","id":"68342","obj":{"i":68342,"n":"From the Bottom of My Gut","g":109,"l":"Yanxia","s":7030}},{"type":"quest","id":"68343","obj":{"i":68343,"n":"Forgotten Resolve","g":109,"l":"Yanxia","s":7040}},{"type":"quest","id":"68344","obj":{"i":68344,"n":"Wine for the Road","g":109,"l":"Yanxia","s":7050}},{"type":"quest","id":"68345","obj":{"i":68345,"n":"An Eye for an Emblem","g":109,"l":"Yanxia","s":7060}},{"type":"quest","id":"68346","obj":{"i":68346,"n":"Heart of Iron","g":109,"l":"Yanxia","s":7070}},{"type":"quest","id":"68347","obj":{"i":68347,"n":"A View to a Spill","g":109,"l":"Yanxia","s":7080}}]}