{"quest":{"name":"A Game of Life and Death","location":"Kugane","id":68486,"patch":4.0,"sort":650,"icon":100673,"unlocksFunction":1,"eventIcon":71341,"issuer":1023555,"target":1023570,"involved":[1023556,1023565,1023566,1023567,1023568,1023569,1023571,1023572,1023597],"genre":152,"journal":["Oboro glances impatiently about him, as if waiting for a tardy guest.","Having heard no word from Karasu since you last spoke, Oboro informs you that he has sent for Princess Yuki of the Yatsurugi clan, in hopes of reinforcing the ranks before setting out to rescue your friends. Despite her most enthusiastic response, however, the spirited princess has yet to arrive. You and Jacke take to the streets of Kugane in hopes of finding the girl before she runs afoul of any unsavory types.","You find Princess Yuki hidden in an alley, desperately trying to avoid the gaze of Akagi, her retainer-turned-bodyguard who has pursued her to Kugane with the intent of bringing her home to her people. At the princess's behest, spin a harmless lie to throw her man off the scent.","You barely utter a few words when Akagi dashes off to board the next ship to Eorzea in search of the princess. Feeling somewhat guilty for taking advantage of the well-meaning but less-than-sharp-witted retainer, you console yourself with the knowledge that you have served the princess well.","Though she regrets having asked you to tell a lie, Princess Yuki is grateful for your actions, for she can now repay both you and Oboro for your efforts on behalf of her and her kingdom. Eager to share what she has learned and begin the adventure, she dashes off to the piers to meet with Oboro as you follow in pursuit.","Princess Yuki is sharing with you and Oboro her knowledge of Hingashi in hopes of identifying Karasu's mysterious employer, when your conversation is interrupted by the crow himself. He gleefully explains that he has prepared a “game” of sorts for you and your friends: you are to rescue your friends from the hideout of the Garnet League and claim the scroll as your prize, or fail and see your friends' lives forfeit. Having no choice but to submit to the eccentric shinobi's cruel and capricious demands, you and your friends set out for the Isle of Bekko.","After a long and hard-fought battle on the Isle of Bekko, you have felled the fearsome Zakuro Brightblood and rescued your Underfoot and the Stray from the Garnet League's clutches. All that remains is free Tsubame and claim the scroll for emerging triumphant in Karasu's game.","Karasu, never to be trusted, is all too quick to renege on his promise and demand the spoils despite your clear victory according to the very conditions he set. With his friend and fellow shinobi's life in the balance, Oboro tosses the scroll to a gloating Karasu, who unceremoniously shoves Tsubame in your general direction. Karasu's enigmatic master then arrives on the scene, and with a few dismissive words, seemingly roasts Karasu to a husk with a breath of fire before your very eyes. Claiming to be Hanzo of the Kagekakushi clan─the only true practitioners of the art of ninjutsu─he ominously states his desire to rid the world of the descendants of “Sasuke the Shamed,” as he dismissively refers to the legendary progenitor of the Doman shinobi. As Oboro stands stunned, Tsubame comforts him with a secret entrusted to her by one her elders─namely, that the scroll in Hanzo's hands is but one half of the forbidden summoning mudra he covets. As Underfoot and V'kebbe return home to Limsa, you set out for Yanxia with Oboro, Tsubame, and Jacke, to inform the elders of all you have seen and glean what wisdom you might before planning your next action.","Upon arriving on the shores of Yanxia, you sojourn first in the fishing village of Namai. A clearly preoccupied Oboro states that he and Tsubame will make the trip from here to their village alone, as the elders may not take kindly to the presence of outsiders. The young shinobi promises you that they will return as soon as they are able, and you and Jacke resolve to keep your skills sharp in anticipation of the inevitable confrontation to come.<br><br>※The next ninja quest will be available from Jacke upon reaching level 68."],"objectives":["Search for Yuki around Kogane Dori.","Speak with Akagi.","Speak with Yuki.","Report to Oboro.","Join Oboro on the Isle of Bekko.","Join Oboro in Namai.","Find your friends!","Rescue V'kebbe!","Rescue Perimu Haurimu!","Defeat Zakuro!","Find Perimu Haurimu!"],"dialogue":[{"name":"JACKE","text":"This Karasu's a dangerous rook, I reckon. It ain't like Underfoot and the Stray to be boned so easy-like."},{"name":"OBORO","text":"Ah, it is good to see you, <span class=\"highlight\">Forename</span>. I have heard nothing from Karasu since last we met. It would seem we have no choice but to take matters into our own hand."},{"name":"OBORO","text":"And yet, in our current state, we are outmanned. In hopes of bolstering our ranks, I reached out to Princess Yuki, pride of the Yatsurugi clan. Her skills and knowledge of these lands would surely avail us in our effort, I thought."},{"name":"OBORO","text":"I am pleased to say that she was more than happy to lend her aid─doubtless in no small part due to your own efforts on her behalf."},{"name":"JACKE","text":"Judging from her words, she is quite eager to prove herself. Perhaps a bit <span class=\"emphasis\">over</span>eager─I would ask you to keep an eye on her, lest she go running off into some sort of trouble."},{"name":"OBORO","text":"Which mayhap she already has, as she should have arrived hours ago. Perhaps she has simply gotten lost on the way, or stopped off for sushi and tea?"},{"name":"OBORO","text":"Might the two of you be so kind as to search for her in my stead? Captain Jacke, see if she is not in the Rakuza District, and <span class=\"highlight\">Forename</span>, pray search the markets of Kogane Dori. I will remain here in case she has simply been delayed in her journey."},{"name":"OBORO","text":"I fear I have seen no sign of Princess Yuki. Pray search the markets of Kogane Dori while I wait for her here."},{"name":"YUKI","text":"<span class=\"highlight\">Forename</span>! Whatever are you doing here in Kugane? Not that I'm complaining, of course! I'm always happy to see the shinobi who helped bring prosperity back to my homeland!"},{"name":"YUKI","text":"Yes, thanks to you, my people are doing wonderfully. The only downside of it is that now I have to be a proper princess again. Akagi─he's my personal bodyguard now, you see─was none too happy when I told him I'd be heading to Kugane. In fact..."},{"name":"AKAGI","text":"(-Frantic Male Voice-)Yuki! Princess Yuki, come back at once!"},{"name":"YUKI","text":"Oh, hells! He's on to me!"},{"name":"YUKI","text":"I just <span class=\"emphasis\">have</span> to help you and Oboro in return for everything you did for me. Surely you understand, <span class=\"highlight\">Forename</span>? Can you go find Akagi and just tell him that I─I don't know, that I hopped on a ship to Eorzea or something?"},{"name":"YUKI","text":"I can't go back home until I've done my duty for you and Oboro. Go tell Akagi that I hopped on a ship to Eorzea or something."},{"name":"AKAGI","text":"<span class=\"highlight\">Forename</span>! Fancy meetin' you here. You're an awful long way from home, eh?"},{"name":"AKAGI","text":"Speakin' of which, you haven't by chance seen Her Highness anywhere, have you? I caught her sneakin' out of the castle and followed her here to Kugane, but I seem to have lost her..."},{"name":"AKAGI","text":"E-Eorzea, you say!? Gods, what is the girl thinkin'? If anything happened to her, I'd never hear─"},{"name":"AKAGI","text":"But there's no time to lose─to the docks! Princess Yuki, wait for me! <span class=\"emphasis\">Princess Yuki</span>!"},{"name":"YUKI","text":"Thank you, <span class=\"highlight\">Forename</span>, and pray forgive me for asking you to lie on my behalf. I had half a mind to tell Akagi the truth, but then he might have offered to <span class=\"emphasis\">help</span>, kami forbid."},{"name":"YUKI","text":"The man means well, but I hear that we face a most dangerous foe, and I simply didn't have the heart to place Akagi in danger. You understand, don't you? In any event, I do believe we've kept Oboro long enough."},{"name":"JACKE","text":"Well, if it isn't our favorite natty little lass..."},{"name":"YUKI","text":"You say I've met this man? I can't say he made much of an impression on me."},{"name":"OBORO","text":"Thank you for leading Her Highness here, <span class=\"highlight\">Forename</span>. Princess Yuki, thank you for making the journey to Kugane. Before we proceed, I would hear aught you might know of recent events in Hingashi."},{"name":"YUKI","text":"As you doubtless know, though Hingashi appears to outsiders to be a land at peace, beneath the surface rival warlords are ever scheming to undermine each other's power."},{"name":"YUKI","text":"In that sense, it is entirely within the realm of possibility that one of them has employed a shinobi to gain a hidden advantage over his foes."},{"name":"YUKI","text":"But this is merely speculation. Try as I might, I was unable to uncover any tangible evidence as to who might be behind these recent events."},{"name":"OBORO","text":"...I see. Thank you, Princess. And so it remains a mystery─what foul master does that treacherous crow serve?"},{"name":"KARASU","text":"(-Familiar Voice-)Now, now, dim one. Is that any way to talk about a dear old friend?"},{"name":"OBORO","text":"Karasu! You have some gall to call yourself my friend! What have you done with Tsubame and the others!?"},{"name":"KARASU","text":"But what's this? The dim one is joined by one new companion after the next! Our hero is wounded! Was his friendship not enough? Why are the geniuses of the world so misunderstood!?"},{"name":"KARASU","text":"Anyhow, I was hoping you'd ask! As a matter of fact, I have just the present for you. It's a game I like to call “kill-or-watch-your-friends-be-killed.” Do you like the name? I thought of it myself just now."},{"name":"KARASU","text":"The rules are really quite simple. Your precious swallow and the others are being held captive by the Garnet League on the Isle of Bekko. You simply need to march in, cut down Zakuro and her men, and free your companions from their shackles."},{"name":"KARASU","text":"Succeed, and I'll forget about the scroll, and you can all go marching happily back to Doma. Fail, and <span class=\"emphasis\">I</span> get the scroll, and Zakuro bathes in your blood tonight."},{"name":"KARASU","text":"Ahahaha! Yes, I do believe there's something in it for everyone! I'll be watching from the shadows─do try to keep me entertained, won't you?"},{"name":"OBORO","text":"Bah, does his villainy know no bounds!?"},{"name":"JACKE","text":"I'm not keen on agreein' to those terms, but it don't seem we've much choice in the matter..."},{"name":"YUKI","text":"If it's a fight he wants, it's a fight he'll get! Together, we can take those Garnet curs─what do you say, <span class=\"highlight\">Forename</span>!?"},{"name":"OBORO","text":"Forgive me, my friends. If only I had been quicker to unravel Karasu's schemes, I would not have to place you in danger like this. Still, it heartens me to know you stand with us."},{"name":"JACKE","text":"Same holds true for me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. While I'm not proud we let that rook get the better of us, I feel a lot safer knowin' a dimber damber like yerself is on our side. Let's get Underfoot and V'kebbe out o' there right quick-like."},{"name":"OBORO","text":"Ever since the elders told me my presence was not needed in the village, I have struggled to find meaning in my daily existence. For whom do I fight? For what greater purpose?"},{"name":"OBORO","text":"Now, I have found an answer─it is for you, my friends. You, who have stood beside me in the darkest of times. You, who have shown me that there is strength inside me that even I had long forgotten. You, who─"},{"name":"JACKE","text":"This is no time for prittle prattle, lad! Or haven't ye noticed the princess has already hopped the twig? Dust off yer beater cases and let's move!"},{"name":"OBORO","text":"The man speaks true. Yes, we must be strong of both body and mind if we hope to prevail. To the Isle of Bekko, where our friends await us!"},{"name":"JACKE","text":"The lad's not quite all there in the head, is he?"},{"name":"YUKI","text":"Let's show those dishonorable Garnet dogs what for!"},{"name":"OBORO","text":"Little to my surprise, it would seem Karasu has alerted our foe to our presence. Let us proceed with caution. There is no telling what manner of treachery the crow has in store for us."},{"name":"OBORO","text":"Let us keep to the shadows for now. I would avoid any bloodshed that is not absolutely necessary."},{"name":"YUKI","text":"Oh, Oboro, you're no fun at <span class=\"emphasis\">all</span>! Can't I cut down just <span class=\"emphasis\">one</span>? I promise he won't make a peep!"},{"name":"JACKE","text":"Stow yer blade, lass. 'Least until we know our friends are safe."},{"name":"OBORO","text":"Curses! They're on to us! We've no choice but to fight!"},{"name":"OBORO","text":"It's V'kebbe! Quickly, now! Make short work of the sentries and free her from her ropes!"},{"name":"OBORO","text":"To the shadows again, friends! Master Underfoot must be around here somewhere..."},{"name":"KARASU","text":"&lt;sniff&gt; &lt;sniff&gt; Something smells so <span class=\"emphasis\">familiar</span>. Did I say I'd stay out of this fight? Oops, I lied!"},{"name":"OBORO","text":"Blast it all! You'll pay for your treachery, Karasu!"},{"name":"OBORO","text":"My friends! I will handle these foes! Keep to the shadows!"},{"name":"JACKE","text":"Stow it, Oboro, before─bleedin' hells, there goes our cover!"},{"name":"OBORO","text":"F-Forgive me, my friends..."},{"name":"YUKI","text":"Finally, some action! Feel my blade, you honorless dogs!"},{"name":"YUKI","text":"Aw, is that all of them? I was just getting warmed up!"},{"name":"JACKE","text":"Well, I s'pose there's no point in hidin' no more..."},{"name":"OBORO","text":"Good work, my friends. Our companions await us. Let us move quickly!"},{"name":"OBORO","text":"It's Master Underfoot! Quickly, dispatch of the guards!"},{"name":"PERIMUHAURIMU","text":"Thank ye kindly, friends. Those ropes stung somethin' fierce."},{"name":"ZAKURO","text":"Ye've got more courage than sense to come this far. Heh...if we fought on the same side, I could see myself gettin' to like you. But we serve another master, and he just so happens to be a demandin' one."},{"name":"ZAKURO","text":"Don't give me that look. We've all got to make a livin', an' this is the best way we know how. Now draw your blades! Zakuro'll bathe in yer lifeblood <span class=\"alternative-container\"><span class=\"alternative\">this night</span><span class=\"alternative\">this day</span></span>!"},{"name":"ZAKURO","text":"Hear me, men? Cut down the rats where they stand!"},{"name":"OBORO","text":"Be strong, friends! Zakuro is a formidable opponent, but we must prevail!"},{"name":"KARASU","text":"Must your battles always be so <span class=\"emphasis\">boring</span>? Here's a little something to heat things up!"},{"name":"OBORO","text":"Curses! Beware Karasu's katon, friends! Keep a distance from each other!"},{"name":"ZAKURO","text":"It took ye bloody long enough! Time to earn yer keep!"},{"name":"ZAKURO","text":"What do I pay you for, anyway? Cut them down, ye bloody wretches, or I'll skewer you where ye stand!"},{"name":"KARASU","text":"I'm <span class=\"emphasis\">baaa-aaack</span>! Did you miss me?"},{"name":"OBORO","text":"Like a dagger in my back. Spread out, friends, and stand clear of the flames!"},{"name":"ZAKURO","text":"Show the rats no mercy! We will bathe the hills of Bekko in their blood!"},{"name":"ZAKURO","text":"Nnngh! Is the blood I bathe in...my own...?"},{"name":"OBORO","text":"We have...failed. Tsubame, forgive me..."},{"name":"KARASU","text":"Blades awhirling through the air! Blood watering the fields! Shinobi fighting side by side, all for the sake of their dear <span class=\"emphasis\">friends</span>! Could there be a more moving sight? Our hero is moved to tears...or <span class=\"emphasis\">not</span>."},{"name":"KARASU","text":"But do not worry. As promised, I'll return your precious swallow with nary a feather out of place─once you hand over the scroll, of course."},{"name":"OBORO","text":"What foolery is this, Karasu!? We played your little game, and we won, did we not? Are you not a man of your word!?"},{"name":"KARASU","text":"Oh, my poor, stupid Oboro! How dim can one man <span class=\"emphasis\">get</span>? Didn't anyone ever tell you that promises are made to be broken─<span class=\"emphasis\">especially</span> mine. Ahahaha!"},{"name":"KARASU","text":"Now, hand over the scroll, and quickly now! I don't particularly enjoy killing my dear friends, but that's never stopped me before."},{"name":"TSUBAME","text":"O-Oboro! The scroll...!"},{"name":"KARASU","text":"Very good, dim one! Yes, I daresay you've played your role to perfection. Fly away home, little swallow─we've had enough fun for the day."},{"name":"HANZO","text":"(-Imposing Shinobi-)Incompetent fools, the lot of you. How long do you intend to keep me waiting for what is rightfully mine?"},{"name":"KARASU","text":"Lord Hanzo! You couldn't have come at a better time. You'll be happy to know I have <span class=\"emphasis\">just</span> what you've been looking for. Behold!"},{"name":"KARASU","text":"Our hero has truly outdone himself this time! At long last, the ancient secrets of Hingan ninjutsu will be his! Do tell me, Lord Hanzo─when will training begin? L-Lord Hanzo!?"},{"name":"KARASU","text":"Aieeeeeeeeeeee!"},{"name":"HANZO","text":"(-Imposing Shinobi-)Silence, whelp! The bastard get of Sasuke the Shamed deserve naught but a quick death."},{"name":"HANZO","text":"(-Imposing Shinobi-)Well, well... A brood of Doman dogs who would call themselves shinobi. You stand before Hanzo the Hidden, twelfth lord of the Kagekakushi clan─and you should consider yourself fortunate that I do not cut you down where you stand."},{"name":"HANZO","text":"And <span class=\"emphasis\">you</span> would call your petty tricks ninjutsu? I spit on your ninjutsu. Your very existence brings dishonor to every <span class=\"emphasis\">true</span> shinobi who has ever lived. Yes, those of <span class=\"emphasis\">my</span> clan─the original and true practitioners of the art."},{"name":"HANZO","text":"Be thankful that I have more important matters to attend to today. Enjoy what little remains of your miserable lives─your time will come, and before you know it."},{"name":"OBORO","text":"Forgive me, my friends... Pray give me a moment to take in all we just saw..."},{"name":"OBORO","text":"I do not know where to even start. Karasu, killed off before our very eyes? The forbidden mudra in the hands of this Hanzo, who claims to hail from the clan who founded our art, and who harbors a grudge against Master Sasuke─and, in turn, us─for reasons I can scarce begin to understand?"},{"name":"TSUBAME","text":"Though it may be small comfort, we can take heart in one matter. In truth, the scroll Hanzo now holds is but one half of the whole─alone, it is all but worthless."},{"name":"TSUBAME","text":"The other half is tucked safely away in our village, far from Hanzo's peering eye. It is a secret known only to the elders, entrusted to me by the old hermit before I took my leave."},{"name":"OBORO","text":"Is that so? Hmph. I would have appreciated if someone could have shared that knowledge with me as well. The old hermit always did like you better...for some reason."},{"name":"OBORO","text":"Still, I do not expect this Hanzo to give up easily. Whatever the true nature of the grudge he holds against the founder of our village, it seems to nigh border on obsession."},{"name":"OBORO","text":"Our adversary claims to hail from the Kagekakushi clan. Princess Yuki, are you familiar with the name?"},{"name":"YUKI","text":"If I remember the histories correctly, they achieved great renown for their exploits in battle during the Age of Strife. It was said that a single Kagekakushi fought with the strength and skill of a thousand lesser shinobi."},{"name":"YUKI","text":"...Until one day when a vengeful warlord razed their village to the ground, slaughtering even wives and babes. The Kagekakushi on the battlefield, too, disappeared one after the next. An inglorious end, by any measure."},{"name":"YUKI","text":"If this Hanzo is truly a descendant of the clan, it would stand to reason that he would seek revenge against those who betrayed his ancestors. But how this is connected to Sasuke─I cannot say."},{"name":"YUKI","text":"But if there's one thing I know, it's that I'm not going to just stand by while this Hanzo plunges our nation into another age of war! I will return home and see if there is any more knowledge of the Kagekakushi to be had."},{"name":"OBORO","text":"Thank you, Princess. We are counting on you."},{"name":"OBORO","text":"For our part, we should return to Yanxia. Once Hanzo realizes that he only possesses half of the knowledge he seeks, he is like to turn an eye to our village. We must warn the elders."},{"name":"JACKE","text":"If it's all the same, I reckon I'll join ye. I'm not keen on showin' my face in Limsa till I've got the goods I came for in my daddles."},{"name":"JACKE","text":"That said, someone needs to see to it that all's bob back at home..."},{"name":"JACKE","text":"Underfoot, V'kebbe. Can I count on ye to keep things in order till I've seen to business here?"},{"name":"PERIMUHAURIMU","text":"Aye aye, Cap'n! Consider it done!"},{"name":"VKEBBE","text":"Just hurry back, will ye? I'll make sure there's a Bismarck special with yer name on it."},{"name":"JACKE","text":"Bugger me if this journey hasn't been one surprise after the next─and somethin' tells me the best is yet to come. Ye'll be joinin' us, won't ye, <span class=\"highlight\">Forename</span>? For ol' times' sake?"},{"name":"OBORO","text":"I cannot thank you enough, friend. The journey to Yanxia is a long one. After we arrive, let us rest up in the village of Namai."},{"name":"OBORO","text":"My long-awaited homecoming, for the first time since I left in pursuit of Karasu. Karasu...have you truly left this world for good?"},{"name":"JACKE","text":"I've seen many a sleepy fishin' village in my day, but this might be the sleepiest..."},{"name":"TSUBAME","text":"Oboro has seemed quite pensive since arriving here in Namai. It would seem that this homecoming weighs heavily on his mind..."},{"name":"OBORO","text":"Tsubame and I will first make the journey to the village alone. Forgive me, but the elders are not like to smile on the sudden arrival of outsiders."},{"name":"OBORO","text":"We will report on all that we saw in Hingashi, and gather what wisdom we can. Pray wait for us here. We will return as soon as we are able."},{"name":"OBORO","text":"I do not ask for a hero's welcome, but... &lt;sigh&gt; Well, I suppose there is no putting it off any longer..."},{"name":"JACKE","text":"Seems we're on our own for the time bein'. Reckon I can find some bene bingo an' a couple of rum doxies in this place? Just havin' a bit of an amuse─what with this Hanzo on the prowl, it's best we both keep our stabbers sharpened."}],"reward":{"gil":2740,"xp":207900},"reqs":{"jobs":[{"lvl":65,"id":92}],"quests":[68485]},"next":[68487]},"partials":[{"type":"npc","id":"1023555","obj":{"i":1023555,"n":"Oboro","l":2404,"q":2}},{"type":"npc","id":"1023570","obj":{"i":1023570,"n":"Oboro","l":2410,"q":3}},{"type":"npc","id":"1023556","obj":{"i":1023556,"n":"Jacke","l":2404,"q":2}},{"type":"npc","id":"1023565","obj":{"i":1023565,"n":"Yuki","l":2404,"q":1}},{"type":"npc","id":"1023566","obj":{"i":1023566,"n":"Akagi","l":2404,"q":1}},{"type":"npc","id":"1023567","obj":{"i":1023567,"n":"Oboro","l":2409,"q":1}},{"type":"npc","id":"1023568","obj":{"i":1023568,"n":"Jacke","l":2409,"q":1}},{"type":"npc","id":"1023569","obj":{"i":1023569,"n":"Yuki","l":2409,"q":1}},{"type":"npc","id":"1023571","obj":{"i":1023571,"n":"Jacke","l":2410,"q":3}},{"type":"npc","id":"1023572","obj":{"i":1023572,"n":"Tsubame","l":2410,"q":2}},{"type":"npc","id":"1023597","obj":{"i":1023597,"n":"Yuki","l":2404,"q":1}},{"type":"quest","id":"68485","obj":{"i":68485,"n":"Ninja Bathin' Redux","g":152,"l":"Eastern La Noscea","s":630,"f":1}},{"type":"quest","id":"68487","obj":{"i":68487,"n":"True Enlightenment","g":152,"l":"Yanxia","s":680,"f":1}}]}