{"quest":{"name":"Broken Steel, Broken Men","location":"Yanxia","id":68483,"patch":4.0,"sort":810,"eventIcon":71201,"issuer":1020232,"target":1020232,"involved":[1020233,1020234,1020519,1020523],"genre":6,"journal":["Tsuranuki has seen your kind before."],"objectives":["Use the makeshift bombs to demolish abandoned magitek.","Gather up the armor plating.","Use the makeshift bombs to demolish abandoned magitek.","Gather up the armor plating.","Deliver the armor plating to Tsuranuki."],"dialogue":[{"name":"LYSE","text":"There's something odd about this man..."},{"name":"ISSE","text":"This...is Tsuranuki."},{"name":"ALPHINAUD","text":"The Dairyu Moon Gates have guarded the approach to Doma Castle since long before the imperial occupation."},{"name":"ALPHINAUD","text":"We do not anticipate any great difficulty in gaining entry to the gatehouse as our Doman friends know its every nook and cranny. The challenge will come in preserving the element of surprise. But I am confident the shinobi will rise to the occasion."},{"name":"YUGIRI","text":"During the rebellion, the imperials turned to their agents among the shinobi, and through their treachery were many of my comrades slaughtered."},{"name":"YUGIRI","text":"We few who survived have not forgotten that day. The memory of it has spurred us never to neglect our training, that we might be ready to administer revenge."},{"name":"TSURANUKI","text":"Eh? Say again? You would have me fashion armor for villagers who wish to fight imperial regulars?"},{"name":"TSURANUKI","text":"Bwahahaha! Mad fools charging boldly to meet their deaths! Bring me steel and I shall give them shells to shield their soft bellies."},{"name":"TSURANUKI","text":"Yes, yes, plates of steel, all that you can carry. The better to shield them from blade and bullet!"},{"name":"ISSE","text":"If only it were so simple, Master Tsuranuki. Steel plates are not so easily procured─"},{"name":"TSURANUKI","text":"Blind, deaf, and dumb you are, boy! We are awash in broken steel. Magitek, great cylinders come crashing to the earth from on high!"},{"name":"TSURANUKI","text":"Shatter them to bits with my explosives. They will not fail you, for I made them to kill imperials, heh heh! Bring me my steel, and you will have your armor."},{"name":"LYSE","text":"...Well, it's not like we know any other armorers who can help. At least we get to blow things up!"},{"name":"TSURANUKI","text":"Of course, the imperials have explosives too, and there is no armor which can protect you from that. Bwahahaha!"},{"name":"LYSE","text":"I've got my portion!"},{"name":"ISSE","text":"We're lucky no patrols overheard the explosions..."},{"name":"TSURANUKI","text":"Eh? Eh!? You have the many plates of steel I demanded? Show me!"},{"name":"TSURANUKI","text":"Bwahahaha! Then you are committed to your cause! Dressing villagers as soldiers and marching off to war..."},{"name":"TSURANUKI","text":"Stupid, stupid fools! Doma is dead, and so are her people!"},{"name":"TSURANUKI","text":"Lord Kaien, Lord Hien─all dead! Their blood is on our hands!"},{"name":"TSURANUKI","text":"'Twas Lord Kaien who saved us. Who spared us the worst when the Garleans came."},{"name":"TSURANUKI","text":"Every shred of pride and honor he cast aside, without a second thought! All to win their trust. All to serve as their puppet. Restored to his throne years later, a paper tiger."},{"name":"TSURANUKI","text":"Such shame he must have felt, but no matter! He would suffer it for his people. A life as slaves is better than none at all, he believed. But not us."},{"name":"TSURANUKI","text":"After my lady died, we began to whisper in his ears dreams of freedom and liberation. We pushed him to take action, if only a little..."},{"name":"TSURANUKI","text":"Ten years of preparation, of machinations. So careful we would be, and yet...and yet!"},{"name":"TSURANUKI","text":"Doma burned for our foolishness, not for that of Lord Kaien. Monzen, the enclave─they were razed for our sins! We murdered them all, don't you see? We murdered you all!"},{"name":"ISSE","text":"...You're wrong, Master. We are still here. We are still alive."},{"name":"ISSE","text":"Lord Kaien too lives on. In our hearts, and in his son, for Lord Hien has returned."},{"name":"TSURANUKI","text":"Lord Hien? Alive!? It cannot be. You lie. You lie!"},{"name":"LYSE","text":"It's the truth! Hien came back to Doma to help her fight for freedom!"},{"name":"TSURANUKI","text":"Could...could it be? My lord Hien yet lives? Oh...oh..."},{"name":"TSURANUKI","text":"Bands of steel to bind the chest and belly, yes, yes! I must heat the forge and begin work at once!"},{"name":"TSURANUKI","text":"Ten? One hundred? How many do you need? All that and more you shall have!"}],"reward":{"gil":908,"items":[{"id":18501,"one":1,"hq":1},{"id":18503,"one":1,"hq":1},{"id":18507,"one":1,"hq":1},{"id":18514,"one":1,"hq":1},{"num":3,"id":5723,"one":1}],"xp":224100},"reqs":{"jobs":[{"lvl":67,"id":142}],"quests":[68057]},"next":[68058]},"partials":[{"type":"npc","id":"1020232","obj":{"i":1020232,"n":"Tsuranuki","l":2410,"q":3}},{"type":"npc","id":"1020233","obj":{"i":1020233,"n":"Isse","l":2410,"q":3}},{"type":"npc","id":"1020234","obj":{"i":1020234,"n":"Lyse","l":2410,"q":3}},{"type":"npc","id":"1020519","obj":{"i":1020519,"n":"Alphinaud","l":2410,"q":8}},{"type":"npc","id":"1020523","obj":{"i":1020523,"n":"Yugiri","l":2410,"q":8}},{"type":"item","id":"18501","obj":{"i":18501,"n":"Doman Steel Longsword","l":279,"c":30561,"t":2,"p":26232}},{"type":"item","id":"18503","obj":{"i":18503,"n":"Doman Steel Battleaxe","l":279,"c":31533,"t":3,"p":39348}},{"type":"item","id":"18507","obj":{"i":18507,"n":"Doman Steel Greatsword","l":279,"c":34287,"t":87,"p":39348}},{"type":"item","id":"18514","obj":{"i":18514,"n":"Doman Steel Tachi","l":279,"c":36437,"t":96,"p":39348}},{"type":"item","id":"5723","obj":{"i":5723,"n":"Quicktongue Materia V","l":160,"c":20259,"t":58,"materia":{"tier":4,"value":6,"attr":"Spell Speed","category":0}}},{"type":"quest","id":"68057","obj":{"i":68057,"n":"The Limits of Our Endurance","g":6,"l":"Yanxia","s":800}},{"type":"quest","id":"68058","obj":{"i":68058,"n":"The Doma Within","g":6,"l":"Yanxia","s":820}}]}