{"quest":{"name":"True Enlightenment","location":"Yanxia","id":68487,"patch":4.0,"sort":680,"icon":100673,"unlocksFunction":1,"eventIcon":71341,"issuer":1023571,"target":1023570,"involved":[1023572,1023573,1023574,1023575,1023577,1023578,1023579,1023580,1023581,1023601,1023602],"genre":152,"journal":["Jacke wears an expression of mild concern.","Oboro has returned from the village, but to hear Jacke tell it, the young shinobi is not quite himself. Suspecting that he might have wandered off to a nearby waterfall to clear his head─as is his wont─the two of you head off in pursuit.","You and Jacke come upon Oboro under the falling waters of the Heron's Flight. As he dries himself off by the fire, the ninja shares with you just what has been troubling him so. As he tells it, he was given a hero's welcome upon his return to the village, but recent events have left him unable to accept the praise lavished upon him. Jacke comforts him with a tale of your own adventures, the moral of which is that when people give you more credit than you deserve, you might as well take it as an opportunity to better yourself rather than beating yourself up for your perceived failings. With newfound resolve, Oboro declares his intention to learn the secret history of Sasuke, his village's founder, from the old hermit known as Master Kamui. Return to Namai, where Tsubame has prepared a most majestic means of transportation for your journey.","Oboro explains that Master Kamui has sequestered himself in meditation in Plum Spring, a short flight away from where you stand. When you are ready, mount the great falcon whose wings will carry you to your destination.","Despite the troubles you took in seeking him out, Master Kamui is not keen to engage you in conversation, instead demanding that Oboro fetch him three ingredients to brew a medicine to cure his aching back. Though the old hermit seems quite comfortable in the company of Tsubame, it would appear you and your friends have little choice but to do his bidding.","Back in Namai, you, Oboro, and Jacke resolve to split up and quickly dispense with the old hermit's busywork. Fetch a claw from the Doman weasels that prowl the Glittering Basin, while your friends see to the other items on Master Kamui's shopping list.","After a hard-fought battle with the slavering beast, the weasel claw is yours. Return to Namai, and hope that your friends have found similar success in their hunts.","You return to Namai, and are pleased to see that Oboro and Jacke have also managed to procure the rare ingredients sought by Master Kamui. Hoping that this will suffice to convince the old hermit to share his knowledge with you, you set out once again for Plum Spring on the wings of the great bird.","You return to Plum Spring to find Master Kamui in fine fettle, some time in the company of the lovely Tsubame having clearly done the work of the most potent of elixirs. His spirits high, he regales you with the true story of Master Sasuke, he who brought ninjutsu to Doma and founded the village Oboro and his fellow shinobi call home. Long ago, Sasuke sailed across the Ruby Sea to Doma at the bidding of his master, Hanzo the First. Hanzo entrusted his young protégé with a scroll writ with the forbidden mudra of summoning he had devised, commanding him to use it to free the Doman people from tyranny. Sasuke did just that, and then─fearing the mudra's power─cleaved the scroll in two, that the fearsome knowledge contained within never again would see the light of day. At the same time, he founded a village, that he might train his new countrymen in the art of ninjutsu, and pass his legacy on to future generations. Sadly, as his mission─even at the time─was shrouded in the utmost of secrecy, Sasuke's heroic deeds on behalf of Doma never reached the ears of his clansmen, and centuries later, it would seem that the descendants of the Kagekakushi clan have come to see him as a traitor and deserter who stole away to a foreign land with his master's forbidden knowledge. As Oboro puts the pieces together, Princess Yuki and Jacke arrive bearing grave news. The Kagekakushi clan means to sail for Doma to claim what they believe is rightly theirs─and when they come, they will come with an army.","With clouds of war brewing on the horizon, you return to Namai with Oboro, knowing that it is but a matter of time before Hanzo and the Kagekakushi army arrives on Doman shores. You resolve to devote all your efforts to your training, knowing that you and your friends will be tested as never before.<br><br>※The next ninja quest will be available from Oboro upon reaching level 70."],"objectives":["Look for Oboro at the Heron's Flight.","Speak with Oboro at Namai.","Speak with Oboro at Plum Spring.","Speak with Oboro at Namai.","Obtain a Doman weasel claw from a Doman weasel.","Deliver the Doman weasel claw to Oboro in Namai.","Speak with Oboro at Plum Spring.","Speak with Oboro at Namai."],"dialogue":[{"name":"JACKE","text":"Ah, <span class=\"highlight\">Forename</span>. Oboro got back not long ago. Mumbled somethin' about his trip to the village was uneventful, then dragged his beater cases off somewhere or 'nother, lookin' at the ground all the while."},{"name":"JACKE","text":"Jacke knows how to read a cove, and somethin' tells me the boy ain't right these days─like he's carryin' the weight o' the world on his shoulders."},{"name":"JACKE","text":"You know the lad better than anyone. You reckon there's somewhere he'd run off to if he were lookin' to clear his head?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Mayhap he returned to his village?"},{"name":"A2","text":"His hideout in Eorzea, no doubt."},{"name":"A3","text":"Is there a waterfall in these parts, by chance?"},{"name":"JACKE","text":"Ye sure about that? He was lookin' more to me like someone who wanted to be alone. Ye don't reckon there's anywhere else the lad might go?"},{"name":"JACKE","text":"Yer tellin' me he just up and hopped the twig back to Eorzea without so much as a whid? Not bloody likely. There must be somewhere else he might be..."},{"name":"JACKE","text":"A waterfall? Now that ye mention it, I did hear the sound of runnin' water when I went on a stroll the other day."},{"name":"JACKE","text":"I'm not quite sure I whiddle ye, but if that's where ye think the lad is, like as not yer right. Let's go see if we can't ease his cares a bit."},{"name":"JACKE","text":"Is that...Oboro? Bugger me, the lad <span class=\"emphasis\">has</span> lost his bloody mind!"},{"name":"OBORO","text":"Ah, <span class=\"highlight\">Forename</span>. I had hoped to spend some more time alone with my thoughts, but it is just as well. It grows cold, and I would warm myself by a fire."},{"name":"OBORO","text":"You know me all too well, <span class=\"highlight\">Forename</span>. I suppose I should not be surprised."},{"name":"JACKE","text":"Well, ye shocked the livin' wits out of me! I was expectin' to find ye in <span class=\"emphasis\">front</span> of the waterfall, not <span class=\"emphasis\">in</span> it!"},{"name":"OBORO","text":"At first I did just that, Captain Jacke. But when listening to the flowing water did not calm my heart as I hoped, I took the next logical course of action."},{"name":"OBORO","text":"I cannot explain it. I returned to my village, fully expecting to be punished for my deception and chastised for my failure to perform my duty. Instead, I was greeted as a hero─the honorable shinobi who slew the villainous Karasu, traitor to our village and country."},{"name":"OBORO","text":"But it is all a lie! Master Gekkai was the traitor, and were it not for Karasu─putting aside the foul deeds he performed in service to his final master─my eyes would have been forever blind to the truth!"},{"name":"OBORO","text":"That day, I promised Karasu that I would keep the truth hidden, and claim the glory and accolades in his stead. At the time, I thought nothing of it."},{"name":"OBORO","text":"But...it is just too much! Perhaps the man deserved to die for his sins─it is not for me to judge. But does he deserve to go to the grave as a hated villain, while I reap the fruits of deeds I can scarcely call my own!?"},{"name":"JACKE","text":"Ye really are too serious for yer own good, lad. Let ol' Jacke tell ye a story."},{"name":"JACKE","text":"Once upon a time─well, maybe not so long ago─there was a dimber mort by the name of Milala, a captain o' the Yellowjackets who was always more style than substance, if ye whiddle me. Long story short, <span class=\"highlight\">Forename</span> and me did ourselves a good deed, but the lass took the credit for 'erself."},{"name":"JACKE","text":"Did a part of me resent it? Sure, I've got feelings as any other cove. But people in our business─includin' this Karasu rook, I reckon─need people like her. People to stand in the lightmans and claim the glory, while we ply our trade in the dark."},{"name":"JACKE","text":"Milala might not have done the deed, but since then, they say she's a new woman─doin' all she can to be the hero that people believe 'er to be."},{"name":"JACKE","text":"In not so many whids, I guess what I'm sayin' is─rather than cloutin' yerself in the nob about glory ye feel ye don't deserve, why not try live up to the person yer friends would have ye be?"},{"name":"OBORO","text":"Thank you, Captain Jacke. I must admit, I had never thought of it that way."},{"name":"TSUBAME","text":"Oboro! I...I...forgive me, I have readied the falcon as you requested. Shall we pay Master Kamui a visit?"},{"name":"OBORO","text":"Allow me to explain, my friends. Since returning here, I have been researching the history of our village─in particular, the life of our forefather, Master Sasuke─in hopes of better understanding our foe and the grudge he bears."},{"name":"OBORO","text":"The tales say that Master Sasuke came to Doma on a mission so secret, no records of it were ever left. Our elders, too, were at a loss. If any possess knowledge of such ancient happenings, they said, it would be the old hermit."},{"name":"OBORO","text":"That is what we call Master Kamui, an elder who retired from his post long ago, and now spends his days in meditation at Plum Spring, pondering the meaning of existence to depths ordinary minds can scarce comprehend."},{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>. As my student, you too are an heir to Master Sasuke's legacy. I would ask that you accompany me to Plum Spring, that together we may learn the truth about the father of our art. Will you do this?"},{"name":"OBORO","text":"Excellent. Plum Spring is not far from here, but we cannot travel there on land. Tsubame was kind enough to summon the falconer. Let us return to Namai."},{"name":"JACKE","text":"I'm no shinobi, an' I wouldn't know this Sasuke from a hole in the ground, but I'm comin' with ye─if for no other reason than I'm dyin' for a change o' scenery."},{"name":"JACKE","text":"Ye reckon ridin' one o' these things is much like ridin' a chocobo?"},{"name":"TSUBAME","text":"It is said that the old hermit's mastery of ninjutsu is so complete that he requires no food and no sleep, and has conquered death himself. Mind you, it is <span class=\"emphasis\">also</span> said that the source of these claims is Master Kamui himself."},{"name":"WARP02951","text":"I am a falconer in service to the village. It is my honor to serve."},{"name":"OBORO","text":"Master Kamui rarely accepts visitors, but the elders have assured me he awaits our arrival. Do not ask me why, but they say he is particularly interested in seeing you, Tsubame."},{"name":"OBORO","text":"In any event, Plum Spring is but a short and pleasant flight away. When you are ready to depart, pray speak to the falconer over there."},{"name":"JACKE","text":"It's pretty an' all, but what's a cove to do for fun in these parts?"},{"name":"TSUBAME","text":"It is beautiful, is it not? They say that the plum blossoms have been in bloom here since before the dawn of time..."},{"name":"KAMUI","text":"My aching back..."},{"name":"WARP02951","text":"Do not be afraid, friend. My loyal bird will carry you safe and sure to your destination."},{"name":"SYSTEM","text":"Ride the falcon to Plum Spring?"},{"name":"SYSTEM","text":"Return to Namai?"},{"name":"OBORO","text":"This is the esteemed Master Kamui. I can scarcely wait to hear what words of enlightenment he would share with us."},{"name":"OBORO","text":"A thousand apologies for the intrusion, Master Kamui. It is I, Oboro. I have come seeking knowledge of Master Sasuke and the founding of our village. If it would not be an imposition, pray share with us your great wisdom."},{"name":"KAMUI","text":"Obo-who? I don't know any Obo─aiya! My back! Every word I speak is a dagger in me!"},{"name":"KAMUI","text":"No, no, this won't do at all. I'll be needing my medicine─the usual, that is. Liver of a Yanxian tiger, horn of a rhino beetle, claw of a Doman weasel! Yes, that always does the trick."},{"name":"KAMUI","text":"Yes, I simply cannot carry on a conversation in such pain. So be on your way, boys. You stay here, my little swallow, and keep an old man company."},{"name":"JACKE","text":"For every whid bein' a dagger in him, he sure likes his prattlin'."},{"name":"KAMUI","text":"Oboro... Oboro... Where have I heard that name before?"},{"name":"JACKE","text":"Enlightenment, my arse! This old coot's a real piece o' work..."},{"name":"KAMUI","text":"Oboro... Ah yes, the dim little boy who could never quite match the wits and skills of his friend Karasu..."},{"name":"OBORO","text":"Y-Yes...that is I. It is my honor to bring you the medicine you seek, Master."},{"name":"OBORO","text":"Forgive me, friend, but it seems we have little choice but to indulge the master. Between the three of us, hopefully it will not prove too trying a task. Let us return to Namai."},{"name":"JACKE","text":"I've half a mind to <span class=\"emphasis\">enlighten</span> the old coot with a click in the muns."},{"name":"TSUBAME","text":"&lt;giggle&gt; Master Kamui, you forget yourself...!"},{"name":"KAMUI","text":"Come now, my little swallow. It's the only path to true enlightenment!"},{"name":"OBORO","text":"&lt;sigh&gt; Playing errand boy for Master Kamui...what a splendid turn of events. In any event, let us split up and make short work of this. I will hunt down a Yanxian tiger. Captain Jacke, pray see to the rhino beetle horn."},{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>, I would entrust the Doman weasel claw to you. My apologies for troubling you with such a menial task, but I fear Master Kamui is nothing if not stubborn. In any event, let us return here when we have found what he seeks."},{"name":"JACKE","text":"To think I sailed clear across the Ruby Sea to go bug huntin'..."},{"name":"OBORO","text":"Ah, <span class=\"highlight\">Forename</span>. I trust you were able to procure a weasel claw?"},{"name":"OBORO","text":"Thank you, friend. I am pleased to report that Captain Jacke and I were also successful in our hunts. Let us return to Plum Spring and hope that Master Kamui is feeling more talkative."},{"name":"JACKE","text":"If it's all the same to ye lads, I'll be stayin' here, thank ye kindly. I'm like as not to give that ol' coot a clout in the nob, an' I reckon yer elders wouldn't take kindly to that."},{"name":"JACKE","text":"What I wouldn't give for a pint an' a rum doxy at me side!"},{"name":"OBORO","text":"Is it just me, or does Master Kamui seem rather...spry...given his condition? No matter, let us give the man what he asked for."},{"name":"KAMUI","text":"Ohohoho! My favorite medicine─never fails to put a spring in an old man's step."},{"name":"OBORO","text":"But, Master Kamui, we have not begun to boil the─forgive me. What I mean to say is, it warms my heart to see you well."},{"name":"KAMUI","text":"&lt;cough&gt; Ahem! So it was Sasuke's secret mission you wished to hear of, my boy? Let me see what I remember. It was oh, oh so long ago..."},{"name":"KAMUI","text":"Once upon a time in Hingashi, in the time they called the Age of Strife, there lived a man named Hanzo─Hanzo the first. Leader of the Kagekakushi clan, he crafted a summoning mudra of terrifying power."},{"name":"KAMUI","text":"Many a warlord did covet this power, that they might wield it to unify the warring states under their rule. Hanzo would hear nothing of it─time and again, he turned down prestigious posts and untold riches, declaring that the mudra would be used only in defense. He recorded his knowledge on a single scroll, and sealed it away far from the eyes of man."},{"name":"KAMUI","text":"Some time later, a vagabond came to Kagekakushi. After the villagers nursed him back to health, he explained that he had fled across the sea from the land of Doma to escape the reign of a tyrant."},{"name":"KAMUI","text":"So it was that Hanzo the First─moved deeply by the traveler's story─called upon Sasuke, his most trusted protégé, to carry the forbidden knowledge across the Ruby Sea and bring freedom to the people of Doma."},{"name":"KAMUI","text":"Sasuke wielded the power but once, such was its power. In a matter of moments, the tyrant's army crumbled before its might, and the Doman people at last knew freedom."},{"name":"KAMUI","text":"But Sasuke felt that his job was not yet done. He resolved to remain in Doma, and established a village here, that he might train his new countrymen to carry on his legacy, and pass down the art of ninjutsu to future generations. <span class=\"emphasis\">That</span> is the untold story of our village's origins."},{"name":"KAMUI","text":"As for the forbidden mudra by whose power Doma's freedom was won, who can say why our ancestor feared it so. All that we know is that he was not content to merely seal the scroll away, but took his blade in hand and sliced it clean in two."},{"name":"KAMUI","text":"One piece was presented as an offering to the King of Doma, in celebration of the nation's newfound freedom. The other he sealed away in his village─our village─never again to see the light of day."},{"name":"OBORO","text":"I suspected as much. Master Sasuke was no traitor or deserter, but a shinobi of honor."},{"name":"KAMUI","text":"Even at the time, it is said that Hanzo the First told none other of Sasuke's true mission. Though unfortunate, it is little surprise that today, centuries later, his descendants see Sasuke as little more than a traitor who stole away with their greatest treasure and fled to a foreign land..."},{"name":"OBORO","text":"Thank you, Master Kamui. This has proved more enlightening beyond my wildest hopes."},{"name":"KAMUI","text":"Glad to hear it, boy─but don't think I'll take kindly to you interrupting my blissful enlightenment again. As for you, my little swallow, you're welcome to come back any time."},{"name":"JACKE","text":"Sorry to interrupt yer lecherous prittle prattle, but the princess here's got news to share─an' I'm afraid it ain't of the good variety."},{"name":"YUKI","text":"Oboro, we must move quickly! Our men afield have reported that the Kagekakushi clan musters their forces in full, and means to march on Doma!"},{"name":"OBORO","text":"...No doubt Hanzo has figured out where the other half of the scroll lies. There is no time to lose. We must return at once and prepare to defend the village."},{"name":"JACKE","text":"This Hanzo cove doesn't waste any time, does he? Seems our job's simple enough─we need to grabble his half of the scroll before he gets his daddles on ours."},{"name":"OBORO","text":"Tsubame has gone to deliver the news to the elders. Meanwhile, Princess Yuki makes for the Ruby Sea to look out for the Kagekakushi army's approach."},{"name":"OBORO","text":"We know not the size of our foe's army, nor their strength─only that both are formidable, and then some. Suffice it to say we will be tested as never before. In what time we have, I implore you to devote yourself to your training as if our very lives depended on it─for surely they do."}],"reward":{"gil":1131,"xp":232200},"reqs":{"jobs":[{"lvl":68,"id":92}],"quests":[68486]},"next":[68488]},"partials":[{"type":"npc","id":"1023571","obj":{"i":1023571,"n":"Jacke","l":2410,"q":3}},{"type":"npc","id":"1023570","obj":{"i":1023570,"n":"Oboro","l":2410,"q":3}},{"type":"npc","id":"1023572","obj":{"i":1023572,"n":"Tsubame","l":2410,"q":2}},{"type":"npc","id":"1023573","obj":{"i":1023573,"n":"Oboro","l":2410,"q":1}},{"type":"npc","id":"1023574","obj":{"i":1023574,"n":"Jacke","l":2410,"q":1}},{"type":"npc","id":"1023575","obj":{"i":1023575,"n":"Falconer","l":2410,"q":1}},{"type":"npc","id":"1023577","obj":{"i":1023577,"n":"Oboro","l":2410,"q":1}},{"type":"npc","id":"1023578","obj":{"i":1023578,"n":"Jacke","l":2410,"q":1}},{"type":"npc","id":"1023579","obj":{"i":1023579,"n":"Tsubame","l":2410,"q":1}},{"type":"npc","id":"1023580","obj":{"i":1023580,"n":"Kamui","l":2410,"q":1}},{"type":"npc","id":"1023581","obj":{"i":1023581,"n":"Falcon","l":2410,"q":1}},{"type":"npc","id":"1023601","obj":{"i":1023601,"n":"Tsubame","l":2410,"q":1}},{"type":"npc","id":"1023602","obj":{"i":1023602,"n":"Kamui","l":2410,"q":1}},{"type":"quest","id":"68486","obj":{"i":68486,"n":"A Game of Life and Death","g":152,"l":"Kugane","s":650,"f":1}},{"type":"quest","id":"68488","obj":{"i":68488,"n":"When Clans Collide","g":152,"l":"Yanxia","s":700,"f":1}}]}