{"quest":{"name":"You Had Me at Haddock","location":"Eastern La Noscea","id":68495,"patch":4.05,"sort":141,"repeatable":1,"icon":100725,"eventIcon":71222,"issuer":1023791,"target":1023791,"genre":201,"journal":["Beaudefoin is looking for adventurers to help him with his Moonfire Faire duties.<br>※This quest is available for a limited time only.","Beaudefoin has asked you to fish up some fresh haddock. Catch three of them on the North Isle of Endless Summer and deliver them to him.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You caught three fresh haddock! Deliver them to Beaudefoin.","You delivered the fresh haddock to Beaudefoin. Speak to him again if you wish to aid in the provisioning of the Moonfire Faire."],"objectives":["Fish for fresh haddock on the North Isle of Endless Summer.","Deliver the fresh haddock to Beaudefoin."],"dialogue":[{"name":"BEAUDEFOIN","text":"Had a feeling I might see you again this summer. And what a pleasant sight you are! You're just the one to deliver me from this seventh hell."},{"name":"BEAUDEFOIN","text":"They're saying there are to be no Go Go Posing Rangers this year since the Bombards are not out. But I'm starting to think this resort nonsense is worse by far. I've never been so busy in all my life! You've got to help me."},{"name":"BEAUDEFOIN","text":"Ah, another adventurer come to help. And come at the right time. You're just the one to deliver me from this seventh hell."},{"name":"BEAUDEFOIN","text":"Here's what I'm hunting right now─haddock. We can't get enough of the damn things. We need every one in the ocean to fill all the orders for battered fish we're getting."},{"name":"BEAUDEFOIN","text":"I've never heard of a dish being so popular. Our haddock stocks simply can't keep up with the demand. I've got the festive fisher giving me all he catches, but it is still not near enough."},{"name":"BEAUDEFOIN","text":"Word is they're biting out at the North Shore. Catch three and bring them to me, would you? A grim fate awaits them, but we can hardly have a faire without food."},{"name":"BEAUDEFOIN","text":"You looking to put that rod of yours to work again? I can always use more fresh haddock. Well, what are you waiting for? To the sea, with you."},{"name":"BEAUDEFOIN","text":"Three fresh haddock, and quickly. Word is they're biting at the North Shore."},{"name":"BEAUDEFOIN","text":"Have you got the three fresh haddock I asked for? Then go and cast that bloody line back in the water!"},{"name":"BEAUDEFOIN","text":"Those are some lively looking haddock. They'll make fine battered fish for some lucky faire-goer. Well done, <span class=\"highlight\">Forename</span>!"},{"name":"BEAUDEFOIN","text":"Have you had a word with Hildelana, there? I don't envy the cooking that is being asked of her. Why not offer her a hand, as well?"},{"name":"BEAUDEFOIN","text":"Another haul of three fresh haddock, is it? My thanks again, friend. You're doing the gods' work."}],"reward":{"items":[{"id":20304}],"xp":0},"reqs":{"jobs":[{"lvl":5,"id":19}],"quests":[68492]}},"partials":[{"type":"npc","id":"1023791","obj":{"i":1023791,"n":"Beaudefoin","l":32,"q":1}},{"type":"item","id":"20304","obj":{"i":20304,"n":"Faire Voucher XVII","l":1,"c":25918,"t":85}},{"type":"quest","id":"68492","obj":{"i":68492,"n":"The Isle and the Faire","g":201,"l":"Limsa Lominsa","s":138}}]}