{"quest":{"name":"A Reoccurring Bug","location":"Ul'dah","id":68497,"patch":4.05,"sort":143,"icon":100727,"eventIcon":71221,"issuer":1023935,"target":1023935,"genre":202,"journal":["Nonora is seeking help in her search for a missing friend.<br>※This quest is available for a limited time only.","According to Nonora, a mechanical menace thought long since defeated has returned to disrupt the realm's celebration of remembrance. Hoping to resolve the matter quickly, and without incident, she enlisted the aid of the wandering minstrel who helped drive off these insectoid machines once before. Though there have been no sightings of the creatures for several days, the wandering minstrel has yet to return, causing Nonora to worry. She bids you venture to Nophica's Wells, where she last heard word from him, and see what you can find.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","Not long after arriving at Nophica's Wells you discover a strange aetherial rift near the water, as well as several metallic bugs strewn across the ground. Though he is nowhere in sight, you are certain this is the handiwork of the wandering minstrel. While you know naught of the origins of the void hovering silently above the bugs' remains, a closer examination of it may offer a clue as to the minstrel's whereabouts.","No sooner do you approach the rift than you are hurtled through time and space into what appears to be a prison cell. Within this dark, dank chamber you at last find the wandering minstrel. Hopefully he has not come to harm.","The wandering minstrel appears no worse for wear, but it seems he fell into a trap while carrying out his mission of exterminating the insectoid menace. Destroying the final bug triggered peculiar magicks that not only transported him to your present surroundings, but also stripped him of his ability to teleport. With no way out, he thought to examine the remains of a bug that followed him through the void. He deduced there is a secret command that, once uttered, will dispel the magicks that hold him there. He attempted to probe its mechanical mind but what he found was a complex labyrinth seemingly bereft of rhyme or reason. Having exhausted himself after days of searching, he asks that you take up the quest in his stead.","After navigating the seemingly endless corridors of the insectoid's mind for what feels to be ages, you discover a pattern and soon ascertain the command that will grant the wandering minstrel his freedom. With a strum of his harp he utters the words and you are whisked away, but not back to Nophica's Well. You find yourself on a plane between time and space, and are soon confronted by one Naoki Yoshida...","You open your eyes, and the figure before you is not Naoki Yoshida but the wandering minstrel. Was it all a dream? In any case, the both of you are returned to Eorzea safe and sound. Together you make for Ul'dah, lest Nonora grow sick with worry. ","Nonora's eyes grow wide with wonder as you regale her with your tale of rescue. With peace assured for the ongoing celebration, the minstrel offers you his thanks with a short tribute to your heroism in verse. The final note from his harp still hangs in the air as fireworks blossom in the skies above. The three of you bask in the warm glow of the illuminations, quietly offering prayers to those lost in the Calamity."],"objectives":["Search Nophica's Wells for signs of the wandering minstrel.","Activate the teleportation ward.","Aid the wandering minstrel.","Enter the Cheap Dungeon.","Report to Nonora."],"dialogue":[{"name":"NONORA","text":"Ah, a welcome sight if there ever was! It has been too long. If only fate had not conspired to see our meeting would again be under such dire circumstances."},{"name":"NONORA","text":"As you may recall, a horde of mechanical bugs once threatened to disrupt our celebration of the realm's rebirth. Though we believed them exterminated, it pains me to say they have returned."},{"name":"NONORA","text":"Your pardon, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. You are an adventurer, yes? Perhaps you can help."},{"name":"NONORA","text":"During one of our previous celebrations of the realm's rebirth, a horde of mechanical bugs threatened to disrupt the festivities. We believed them exterminated, but it pains me to say they have returned."},{"name":"NONORA","text":"When word of their presence first reached me I knew something had to be done immediately, that the good people of Eorzea may pray and reflect on the events of the Calamity in peace."},{"name":"NONORA","text":"That is why I enlisted the aid of the wandering minstrel who helped dispense with this mechanical menace once before."},{"name":"NONORA","text":"Sightings of the bugs ceased within a few days of his leaving Ul'dah. Yet despite his apparent success there is nary a trace of him. There is no answer from his linkpearl, and now I fear some ill fate has befallen him."},{"name":"NONORA","text":"It would mean the world to me if you would go and search for him. If he truly has met with misfortune, I have the utmost confidence you can see him to safety."},{"name":"NONORA","text":"Thank you ever so much! When last we spoke, the minstrel was making for Nophica's Wells."},{"name":"NONORA","text":"If the fates are kind, you will find some clue to his whereabouts there. Take care, and stay safe."},{"name":"NONORA","text":"Please hurry to Nophica's Wells. I only hope the minstrel is yet unharmed."},{"name":"SYSTEM","text":"This teleportation ward was created not long ago. Judging by the remains of the mechanical monsters strewn across the ground, this is likely the work of the wandering minstrel. Perhaps he is on the other side."},{"name":"SYSTEM","text":"Activate the teleportation ward?"},{"name":"WANDERINGMINSTREL","text":"An adventurer...? By what twist of fate did you find your way to a place such as this?"},{"name":"WANDERINGMINSTREL","text":"You came searching for me at the behest of Nonora? I see. She was right to send you, for I have indeed found myself in a most precarious position."},{"name":"WANDERINGMINSTREL","text":"I stumbled upon a nest of the bugs which threatened to spoil our celebration. No doubt they wished for us to think them extinct, waiting for an opportune time to catch us unawares."},{"name":"WANDERINGMINSTREL","text":"As I delivered the finishing blow to the last of these mechanical monstrosities, a trap was sprung and I was hurled into a void. When I awoke I was in this chamber, somehow stripped of my ability to use teleportation magicks. "},{"name":"WANDERINGMINSTREL","text":"You needn't worry, my friend. Whatever magicks were invoked have long since faded. Their effects on me, however, still remain. Considering these rather bleak surroundings, one might say I've been locked within a jail of sorts."},{"name":"WANDERINGMINSTREL","text":"But no jail is without its key."},{"name":"WANDERINGMINSTREL","text":"Upon inspecting this bug, I discovered there is, in fact, a command that when uttered will undo the magicks which bind me here. To that end I thought to peer into the inner workings of its mechanical mind, or what remains of it, and secure my path to freedom."},{"name":"WANDERINGMINSTREL","text":"Much to my dismay, its mind was a maze─a complex labyrinth the likes of which I have never seen before. For days I have searched to no avail. Were I to delve into the maze again, I fear I now lack the strength to return. But I think I now see a solution to my problem."},{"name":"WANDERINGMINSTREL","text":"Do you suppose you could traverse the labyrinth in my stead? Having come thus far, you certainly seem more than resourceful enough to see the job done."},{"name":"SYSTEM","text":"You can now access the cheap dungeon. Examine the battered bug to delve into the maze and discover how to set the wandering minstrel free!"},{"name":"NONORA","text":"He's trapped in their nest!? Then what in heavens' name are you doing here? Please, you must save him!"},{"name":"WANDERINGMINSTREL","text":"The key to my escape is somewhere within that labyrinth. Please, you must find the command to dispel the magicks placed upon me."},{"name":"SYSTEM","text":"The following controls can be used to navigate the cheap dungeon (default settings):"},{"name":"SYSTEM","text":"<span class=\"alternative-container\"><span class=\"alternative\">W: Move Forward, S: Move Back<br>A: Turn Left, D: Turn Right<br>Q: Move Left, E: Move Right</span><span class=\"alternative\">[???]: Move Forward, [???]: Move Back<br>[???]: Turn Left, [???]: Turn Right<br>[???]: Move Left, [???]: Move Right</span></span>"},{"name":"WANDERINGMINSTREL","text":"You returned much faster than I anticipated, though I suppose navigating dungeons is all in a day's work for one such as you. I would offer you proper thanks, but first let us quit this place."},{"name":"WANDERINGMINSTREL","text":"Once the bugs' magicks are dispelled, I should have no trouble teleporting us out of here. Now then, shall we be off?"},{"name":"YOSHIDANAOKI","text":"Greetings, Warrior of Light. You needn't be alarmed."},{"name":"YOSHIDANAOKI","text":"This is a world that exists outside your reality. Could it be a dream? A flight of fancy conjured by your weary mind? Perhaps...or perhaps not."},{"name":"YOSHIDANAOKI","text":"This is our second meeting, is it not? Truly the fates are kind to afford me this opportunity. I wished to thank you personally for your continued efforts in Eorzea."},{"name":"YOSHIDANAOKI","text":"At last I come face-to-face with the great <span class=\"highlight\">Forename Surname</span>. Truly the fates are kind to afford me this opportunity. I wished to thank you personally for your continued efforts in Eorzea."},{"name":"YOSHIDANAOKI","text":"Its rebirth seems as only yesterday, yet it has already been four long years. In that time, the clarion call of adventure has beckoned you up to the very heavens and back, and now it seems she would bid you pursue the liberation of a nation as well."},{"name":"YOSHIDANAOKI","text":"The realm is ever-growing, ever-changing, and it would not be possible without the deeds of you and yours─without your thirst for adventure."},{"name":"YOSHIDANAOKI","text":"These past four years have not been without their hardships, though. We have stumbled at times─fallen, even─but together at your side we have endured. I am quite confident we will continue to do so for many years to come."},{"name":"YOSHIDANAOKI","text":"You inspire us with your tales of adventure in Eorzea, and it is our fondest hope they serve as a constant source of joy and wonder."},{"name":"YOSHIDANAOKI","text":"May you ever walk in the light of the Crystal!"},{"name":"YOSHIDANAOKI","text":"...Now, the time has come for this vision to end; time for your eyes to open from this waking dream."},{"name":"YOSHIDANAOKI","text":"Ever will we be watching over you and your deeds. Guide the realm unto peace and happiness, Warrior of Light..."},{"name":"WANDERINGMINSTREL","text":"There you are. For a moment I feared you had been left behind. Words cannot well express my gratitude for─...Are you all right? By your expression, I would swear your mind had but recently returned from some waking dream."},{"name":"WANDERINGMINSTREL","text":"Perhaps it is merely an aftereffect of the magicks employed in our escape. At any rate, I must return to Ul'dah. Nonora is no doubt beside herself with worry. Would you care to accompany me?"},{"name":"NONORA","text":"You've returned! But what of the wandering minstrel? Is he safe?"},{"name":"NONORA","text":"Oh, thank goodness. Would you mind waiting with me until he returns? If you have arrived, he cannot be far behind."},{"name":"NONORA","text":"It is so good to see you hale and whole! You were gone for so long I feared the worst."},{"name":"WANDERINGMINSTREL","text":"My apologies, Nonora. I am ashamed to admit I was bested by the bugs. The tale of my rescue, however, is a far more compelling story."},{"name":"NONORA","text":"Unbelievable! And the bugs are no more, you say?"},{"name":"WANDERINGMINSTREL","text":"Indeed. Now the good people of Eorzea may at last offer prayers to the victims of the Calamity in peace, no longer burdened by the impending threat of those metallic monsters."},{"name":"WANDERINGMINSTREL","text":"Of course, this would not have been possible without your aid. On behalf of all those who would honor this day of remembrance, you have my sincerest thanks."},{"name":"WANDERINGMINSTREL","text":"My work here complete, I believe it time I continued my journey, recounting the heroic deeds of adventurers such as you in song. In fact, if I might be so bold, I would write a verse in your honor..."},{"name":"WANDERINGMINSTREL","text":"'Neath azure skies a soul burned bright, stars soon gathered 'fore its might♪<br>By their radiance truths lay bare, a nation freed from deep despair♪"},{"name":"WANDERINGMINSTREL","text":"As the heavens take a crimson hue, friends now gather, old and new♪<br>By their deeds doth freedom ring, once more their hearts have cause to sing♪"},{"name":"WANDERINGMINSTREL","text":"...Let us now take a moment to remember those whose flames were extinguished too soon."},{"name":"WANDERINGMINSTREL","text":"The tragedies of yesterday must not be forgotten, lest we take for granted the gifts of tomorrow."},{"name":"SYSTEM","text":"You have unlocked the Cheap Dungeon mini-game."},{"name":"SYSTEM","text":"Open the toy chest in any inn room to try your hand at this popular Eorzean pastime."}],"reward":{"gil":444,"items":[{"id":20532},{"id":20534},{"id":17846}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1023935","obj":{"i":1023935,"n":"Nonora","l":40,"q":1}},{"type":"item","id":"20532","obj":{"i":20532,"n":"Wind-up Lyse","l":1,"c":59648,"t":81}},{"type":"item","id":"20534","obj":{"i":20534,"n":"Wind-up Gosetsu","l":1,"c":59650,"t":81}},{"type":"item","id":"17846","obj":{"i":17846,"n":"Stormblood Orchestrion Roll","l":1,"c":25945,"t":94}}]}