{"quest":{"name":"Hard Country","location":"The Peaks","id":68490,"patch":4.0,"sort":112,"eventIcon":71201,"issuer":1020842,"target":1020842,"genre":6,"journal":["Griseldis is here, but her mind is elsewhere..."],"objectives":["Slay a chapuli for its horn.","Slay a Gyr Abanian hornbill for one of its talons.","Deliver the horn and talon to Griseldis."],"dialogue":[{"name":"GRISELDIS","text":"You'd best keep your distance, if you know what's good for you. Say your piece and move on."},{"name":"GRISELDIS","text":"Looking for folks down on their luck? Congratulations, you've found one. As you can see, my leg ain't what it used to be. Some days I can hardly walk for the pain."},{"name":"GRISELDIS","text":"Mornings are the worst, especially after cold nights. Hard labor's right out─too much pain and trouble for others."},{"name":"GRISELDIS","text":"There's a tea what helps with it, though...I'd need to grind a chapuli horn and a hornbill talon for the blend..."},{"name":"GRISELDIS","text":"Eh? You'll go and get some for me, just like that? You needn't trouble yourself so..."},{"name":"GRISELDIS","text":"...I've no expectations of aid, mind, but if you happen to pass through the Last Forest and stumble into some chapulis and hornbills..."},{"name":"GRISELDIS","text":"You've been gone a while. What brings you back to Ala Gannha?"},{"name":"GRISELDIS","text":"Oh, I never meant to... I mean, in times like these, you never think people will actually..."},{"name":"GRISELDIS","text":"This country's hard on people, but it's not just that. The imperials, they...they've made it known I'm not to be helped. A dead man's good for one lesson, you know, whereas a live one..."},{"name":"GRISELDIS","text":"You're with the Resistance, right? I suppose there's no reason not to tell you then."},{"name":"GRISELDIS","text":"My father, gods rest his soul, was deathly sick at the time, and so I'd gone out into the forest, spear in hand, to gather herbs. And then I had the good fortune to run into an imperial patrol."},{"name":"GRISELDIS","text":"My weapon marked me as a rebel, or so they said. Not that it'd've made a difference if I'd fought back. I knew what the lot of them were about the moment that centurion laid eyes on me..."},{"name":"GRISELDIS","text":"Didn't matter in the end, of course. Some people just like to hurt others. And by the time I limped back to the hut, it was too late for my father."},{"name":"GRISELDIS","text":"Too late for me too, aye, and many others I imagine. Help them too if you like─they'll be grateful and say thank you. But beyond that, I wouldn't hope for much."}],"reward":{"gil":583,"xp":167400},"reqs":{"jobs":[{"lvl":60,"id":142}],"quests":[67992]},"next":[67993]},"partials":[{"type":"npc","id":"1020842","obj":{"i":1020842,"n":"Griseldis","l":2407,"q":3}},{"type":"quest","id":"67992","obj":{"i":67992,"n":"The Prodigal Daughter","g":6,"l":"The Peaks","s":110}},{"type":"quest","id":"67993","obj":{"i":67993,"n":"A Life More Ordinary","g":6,"l":"The Peaks","s":120}}]}