{"quest":{"name":"The True Meaning of Summer","location":"Eastern La Noscea","id":68496,"patch":4.05,"sort":142,"icon":100726,"eventIcon":71221,"issuer":1023788,"target":1023788,"genre":201,"usedItems":[20304],"journal":["Haermaga wishes to know why you have seen fit to interrupt his faire duties.<br>※This quest is available for a limited time only.","Haermaga promises to reveal all of the rumors of treasure after you earn seven Faire vouchers.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You delivered seven Faire vouchers to Haermaga. Wait for him at the designated location near the Isle of Endless Summer.","Haermaga tells you the rumor of a treasure hidden by Gegeruju that he himself is hunting. He has already learned of several places Gegeruju has visited on multiple occasions, and asks that you investigate one of them. Travel to the vantage point near the Isle of Endless Summer and discover what you can.","You discovered Gegeruju's spyglass. Travel to the vantage point near the Isle of Endless Summer and look through it to see what Gegeruju saw.","You surmise that vantage point is the perfect location from which to view faire-goers from afar. Deliver Gegeruju's spyglass to Haermaga and report your findings to him.","Haermaga plans to catch Gegeruju in the act and confront him directly, but first he must be found. Search for Gegeruju around the vantage point near the Isle of Endless Summer.","You discover Gegeruju in the act of watching faire-goers, and learn that he and Jiriri spread the rumors of treasure to attract more visitors to the isle. Return to Haermaga's post and speak with him once more about how best to handle the situation.","Haermaga determines that he and the others will continue to make the Moonfire Faire the most festive occasion they can, but will insist that Gegeruju resolve any problems that arise as a result of the treasure rumors. Be sure to lend Haermaga a hand wherever you can in the faire effort."],"objectives":["Deliver Faire vouchers to Haermaga.","Await Haermaga at the designated location.","Investigate the vantage point.","Use the spyglass from the vantage point to see what Gegeruju saw.","Deliver Gegeruju's spyglass to Haermaga.","Look for Gegeruju at the designated location.","Speak with Haermaga."],"dialogue":[{"name":"HAERMAGA","text":"You again, is it? And it looks as though you've something you'd like to ask. Go on then, what is it?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What do you know of this summer treasure?"},{"name":"A1","text":"What do you know of these summer rumors?"},{"name":"HAERMAGA","text":"Treasure? I don't know what you're─ I haven't heard any─ Oh, very well. There's no point in deceiving you. You adventurers always find everything out sooner or later."},{"name":"HAERMAGA","text":"Rumors? Why, there are always rumors. That's nothing to─ I don't think that─ Oh, very well. There's no point in deceiving you. You adventurers always find everything out sooner or later."},{"name":"HAERMAGA","text":"I will tell you, but first you must help with the faire. Lend a hand to P'obyano and the others until things calm down a bit. Then I will reveal all I know."},{"name":"HAERMAGA","text":"Bring me seven Faire vouchers as proof of your labors. That is my price."},{"name":"HAERMAGA","text":"Bring me seven Faire vouchers as proof of your aid. That is the price for all I know of rumors and treasure."},{"name":"HAERMAGA","text":"Seven Faire vouchers, just as I asked. Thank you. We are grateful for the help."},{"name":"HAERMAGA","text":"Now, then, about these rumors. It will not do to speak of them here. There is an island to the south where few souls go. Await me there. I will join you shortly."},{"name":"HAERMAGA","text":"It will not do to speak of the rumors here. There is an island to the south where few souls go. Await me there. I will join you shortly."},{"name":"HAERMAGA","text":"My apologies for keeping you waiting. Now... Where to begin?"},{"name":"HAERMAGA","text":"You are right─there is a rumor abound at the faire this year. The whispers say that Gegeruju has hidden a treasure somewhere on the isle, and whoever finds it during the festivities can lay claim to it."},{"name":"HAERMAGA","text":"Just another shady rumor, much like that of Mistbeard's hidden treasure. It'd be foolish to go to Gegeruju himself with all this, but the trouble is, more than a few folk have taken the rumor to heart."},{"name":"HAERMAGA","text":"If any ill comes of all this, it'll be a hassle to Gegeruju and a hindrance to the faire. And so I've taken to looking into things for myself."},{"name":"HAERMAGA","text":"I've learned of certain places on the isle that Gegeruju has visited alone on more than a few occasions. Suspicious behavior, indeed, no?"},{"name":"HAERMAGA","text":"I mean to visit a number of these myself and expose whatever truth there is behind this mess. And I'd like to ask you to help."},{"name":"HAERMAGA","text":"One of these places lies on an island to the north. I'll leave that one to you. If you find anything there of interest, bring word back to me."},{"name":"HAERMAGA","text":"There are several places Gegeruju visits, alone and often. Travel to the one on the north island and discover whatever you can. I will survey the others."},{"name":"SYSTEM","text":"You discover a spyglass with Gegeruju's name engraved on it. Use it to learn what he was viewing."},{"name":"SYSTEM","text":"Search your surroundings for whatever Gegeruju was viewing. You may move the camera, as well as zoom in and out. Target a sight and use the spyglass with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"SYSTEM","text":"You see a group of ladies gleefully at play. This seems the perfect location to gaze at faire-goers from afar."},{"name":"HAERMAGA","text":"You're back. Tell me, what did you find?"},{"name":"HAERMAGA","text":"Peeping? Aye, I found the places I visited to be ideal vantage points, as well. And this spyglass would seem to be the nail in Gegeruju's voyeuristic coffin."},{"name":"HAERMAGA","text":"Still, damning as it may be, we'll have to catch him in the act. He is visiting the north island as we speak. Come, search for him with me."},{"name":"HAERMAGA","text":"Gegeruju is visiting the north island as we speak. Let us find him and uncover the truth behind all this."},{"name":"HAERMAGA","text":"Gegeruju is sure to be around here somewhere. But those Lalafell are so damned small, it can be hard to─ There he is!"},{"name":"HAERMAGA","text":"Come on, let us be done with this."},{"name":"HAERMAGA","text":"Gegeruju, I don't think there's any need to ask, but we will anyway. What in the hells are you up to?"},{"name":"GEGERUJU","text":"Ahahaha! That much is obvious, is it not? I am keeping a watchful eye on those beautiful ladies over yonder. Are they not an absolute <span class=\"emphasis\">treasure</span>?"},{"name":"HAERMAGA","text":"A watchful eye? It looks to be no more than a peeping eye from where we stand."},{"name":"JIRIRI","text":"Oh, by the gods, if you are not able to enjoy this spectacle for the wonder that it is, then I truly pity you. Heeheehee! My, oh my, just <span class=\"emphasis\">look</span> at them!"},{"name":"HAERMAGA","text":"Don't tell me you're caught up in all this business, as well."},{"name":"GEGERUJU","text":"It is one thing to attend the festivities and applaud the Miqo'te's lovely dances. It is another thing altogether to keep vigil over their beauty from afar. I certainly am glad I chose to leave things to you this year, Jiriri."},{"name":"JIRIRI","text":"Your praise means much. I daresay the faire would never have grown so lively had we not spread the rumors of a hidden treasure."},{"name":"JIRIRI","text":"Come, Gegeruju. There are other places from which we must enjoy the view. It will not serve to linger too long in any one place, lest we be discovered. Therein lies all the fun, does it not?"},{"name":"GEGERUJU","text":"Right you are! Let us away, then. There are countless other scantily clad Miqo'te being deprived of my watchful eye!"},{"name":"HAERMAGA","text":"Well, things have gotten...interesting. Let us return and consider how best to deal with all this."},{"name":"HAERMAGA","text":"So, it would seem the rumors of treasure were started by Jiriri in an attempt to fulfill Gegeruju's...desires. To think, this whole thing was a farce spun up by their perverse little minds."},{"name":"HAERMAGA","text":"Very well, this is how it will be. If any trouble is born of this treasure nonsense, those two will answer for it. "},{"name":"HAERMAGA","text":"As for the faire, so long as the Bombards stay away, we've no need of adventurers' might. But we do have need of your aid."},{"name":"HAERMAGA","text":"I hope we can count on you to continue helping with the faire. Enjoy yourself, and lend a hand where you can!"}],"reward":{"gil":494,"items":[{"id":20564},{"id":20565},{"id":20566}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[68492]}},"partials":[{"type":"npc","id":"1023788","obj":{"i":1023788,"n":"Haermaga","l":32,"q":1,"t":"Moonfire Faire Chairman"}},{"type":"item","id":"20564","obj":{"i":20564,"n":"Faire Joi","l":1,"c":42538,"t":35,"p":156}},{"type":"item","id":"20565","obj":{"i":20565,"n":"Faire Kohakama","l":1,"c":45983,"t":36,"p":156}},{"type":"item","id":"20566","obj":{"i":20566,"n":"Faire Zori","l":1,"c":49860,"t":38,"p":94}},{"type":"item","id":"20304","obj":{"i":20304,"n":"Faire Voucher XVII","l":1,"c":25918,"t":85}},{"type":"quest","id":"68492","obj":{"i":68492,"n":"The Isle and the Faire","g":201,"l":"Limsa Lominsa","s":138}}]}