{"quest":{"name":"Fried Fish Is the Best Fish","location":"Eastern La Noscea","id":68494,"patch":4.05,"sort":140,"repeatable":1,"icon":100724,"eventIcon":71222,"issuer":1023790,"target":1023790,"genre":201,"usedItems":[10332],"journal":["Hildelana is charged with provisioning all the food for the Moonfire Faire, but has bitten off more than she can chew.<br>※This quest is available for a limited time only.","Hildelana asks that you prepare some battered fish for the faire. Obtain some and deliver it to her.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.<br><br>※Battered fish can be crafted as a culinarian, or purchased from the market boards.","You delivered the battered fish to Hildelana. Speak to her again if you wish to fulfill any other food orders for the Moonfire Faire."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Obtain some battered fish</span><span class=\"alternative\">Deliver the battered fish to Hildelana</span></span>."],"dialogue":[{"name":"HILDELANA","text":"Now there is a face I have not seen for a long time. Thanks again for all your help with those pesky Bombards at faires past."},{"name":"HILDELANA","text":"I'm taking a hiatus from the Go Go Posing Rangers. This year, my duties are here. Out of the frying pan and into the kitchen, eh? I hope that doesn't mean you aren't willing to help."},{"name":"HILDELANA","text":"I'm sorry, we aren't taking any more orders right now. Oh, you're not a customer? Please tell me you're here to offer help."},{"name":"HILDELANA","text":"Thank the gods! I'm as happy as any to see the faire so bustling, but we have more orders than we have cooks to make them. This kitchen is pure chaos."},{"name":"HILDELANA","text":"If you're willing to help, how about preparing some battered fish? There are more orders for that than anything else. We cannot make enough of the stuff!"},{"name":"HILDELANA","text":"You'll need some fresh haddock to make it, but that should be easy enough to find. I'd wager you can purchase it from the festive fisher."},{"name":"HILDELANA","text":"You are here to offer your culinary services? Well, they are most welcome. If you're able, how about preparing some battered fish?"},{"name":"HILDELANA","text":"I don't see any battered fish in your hands. If you need to gather ingredients, you can purchase the fresh haddock you'll need from the festive fisher."},{"name":"HILDELANA","text":"Oh, my! I've never seen more delectable-looking battered fish! The fairecomers who get these are in for a treat. Thank you for the help!"},{"name":"HILDELANA","text":"By the by, have you spoken to Beaudefoin just over there? He is just as busy as I am right now. If you fancy helping more, I'm sure he has a job to ask of you."},{"name":"HILDELANA","text":"Thanks again for the wonderful battered fish. If you care to help in the kitchen again, just let me know. We can always use a talented culinarian!"}],"reward":{"items":[{"id":20304}],"xp":0},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[68492]}},"partials":[{"type":"npc","id":"1023790","obj":{"i":1023790,"n":"Hildelana","l":32,"q":1}},{"type":"item","id":"20304","obj":{"i":20304,"n":"Faire Voucher XVII","l":1,"c":25918,"t":85}},{"type":"item","id":"10332","obj":{"i":10332,"n":"Battered Fish","l":5,"c":24319,"t":46}},{"type":"quest","id":"68492","obj":{"i":68492,"n":"The Isle and the Faire","g":201,"l":"Limsa Lominsa","s":138}}]}