{"quest":{"name":"The Isle and the Faire","location":"Limsa Lominsa","id":68492,"patch":4.05,"sort":138,"icon":100722,"eventIcon":71221,"issuer":1023793,"target":1023789,"genre":201,"journal":["Mayaru Moyaru at the Aftcastle wishes to tell you all there is to be told of the Moonfire Faire.<br>※This quest is available for a limited time only.","Mayaru Moyaru tells you that the Moonfire Faire is being held on the Isle of Endless Summer. Travel to the isle in eastern La Noscea and learn more from the Faire's chaperone, Haermaga.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The Moonfire Faire aims to energize the Isle of Endless Summer and promote it as a new paradise resort. Things are going so exceedingly well, however, that some extra aid is needed. Speak with P'obyano on the isle to learn how you can help.","You are tasked with helping launch the maritime fireworks display. Speak with Jiriri on the Isle of Endless Summer to learn more about the festivities.","Use the summer firework on a firework mortar on the Isle of Endless Summer.","You used the summer firework on a firework mortar. Report back to P'obyano on the Isle of Endless Summer.","P'obyano tells you that Haermaga may know more of treasure spoken by those who saw your fireworks display. You have been asked to aid further in the Moonfire Faire efforts. Take a look around and help where help is needed."],"objectives":["Speak with Haermaga on the Isle of Endless Summer.","Speak with P'obyano on the Isle of Endless Summer.","Speak with Jiriri.","Use the summer firework on a firework mortar.","Report back to P'obyano."],"dialogue":[{"name":"MAYARUMOYARU","text":"I know you. You've helped me in the past, and perhaps you will again. If the heat is not too much for you to bear, that is. But such heat can only mean one thing. Yes, the Moonfire Faire is upon us!"},{"name":"MAYARUMOYARU","text":"Ahhh, at last the gods have seen fit to send me an able adventurer. I've much to ask of you. If the heat is not too much for you to bear, that is. But such heat can only mean one thing. Yes, the Moonfire Faire is upon us!"},{"name":"MAYARUMOYARU","text":"And the festivities this year will be the greatest to date! Indeed, the fairegrounds are a new resort location at none other than Costa del Sol. It is a veritable paradise─aptly named the Isle of Endless Summer."},{"name":"MAYARUMOYARU","text":"Hehehe, your interest is piqued. I can see that much in your eyes. No doubt you wish to hear more, but you will not hear it from me. Travel to the Isle of Endless Summer, and there seek out Haermaga. He is chief chaperone of the faire, and will tell you all you care to know."},{"name":"MAYARUMOYARU","text":"Travel to the Isle of Endless Summer, and there seek out Haermaga. He is chief chaperone of the faire, and will tell you all you care to know."},{"name":"HAERMAGA","text":"Well, well, well. It's been a long time. I've not seen you since the Moonfire Faire fell last. Tell me, is it your love of the celebrations that's brought you to me again?"},{"name":"HAERMAGA","text":"Welcome to the Isle of Endless Summer. Tell me, is it your love of the faire that's brought you to me?"},{"name":"HAERMAGA","text":"So, Mayaru Moyaru sent you, did he? Crafty little bugger, he is. Well, at least it's not the rumors that brought you like they have everyone else."},{"name":"HAERMAGA","text":"Hm? Bah, forget I said anything. Rumors are just that after all─rumors. If you know not of what I speak, then it makes no matter. Come, let us discuss more important things!"},{"name":"HAERMAGA","text":"The Moonfire Faire is a festival we celebrate to fell the fiery Bombards. But it might be we've grown too good at that. The damned things have scarcely shown themselves since last year, and rightly so after that beating. We almost forewent the faire entirely this summer."},{"name":"HAERMAGA","text":"But then the master of Costa del Sol, Gegeruju himself, asked that we hold it to vitalize his newly created Isle of Endless Summer."},{"name":"HAERMAGA","text":"So, while there is a bit of an ulterior motive behind this year's festivities, we could hardly refuse a request from Gegeruju. We owe him much and more for his tireless efforts with past faires. And so here we are."},{"name":"HAERMAGA","text":"Yet I confess, there are far more patrons come to the isle than we anticipated. We find ourselves grossly short of hands. Would you care to lend yours? We've rewards aplenty to offer in return."},{"name":"HAERMAGA","text":"Excellent! Your duties will be assigned to you by P'obyano at the─"},{"name":"GEGERUJU","text":"Hello there, hello there. Tell me, how are the festivities proceeding? Is all well? My, there certainly are a number of lovely Miqo'te come out to play."},{"name":"HAERMAGA","text":"All is as it appears. Never did we expect such scores. It is more than the others and I can handle."},{"name":"JIRIRI","text":"Master Gegeruju, please, let us not take any more of Haermaga's precious time. Stroll the grounds. See with your own eyes how the faire fares."},{"name":"GEGERUJU","text":"Ever the effective manager, Jiriri. Very well, I will go and have a long, hard look at things. Mayhap I may even romp with these lovely kittens a bit."},{"name":"JIRIRI","text":"Apologies for the interruption, Haermaga. I know countless faire duties await you. Please, attend to them in good time."},{"name":"HAERMAGA","text":"Aye, you needn't worry there. Attend to them, I will."},{"name":"JIRIRI","text":"Such assuring and diligent words. You adventurers are a blessing to us all. I shall distract you no longer. Good day, and have a merry Moonfire Faire!"},{"name":"HAERMAGA","text":"Where was I? Ah, yes. You'll want to speak with P'obyano about your duties. Off you go, then. Work awaits!"},{"name":"HAERMAGA","text":"Now just who the hells would spread a rumor like that?"},{"name":"HAERMAGA","text":"Oh, don't pay me any mind. Nothing to see or hear here. You just go and keep yourself busy by helping out with the faire."},{"name":"POBYANO","text":"Well, if it isn't <span class=\"highlight\">Forename</span>! It has been many moons, my friend. Pray tell, are you here to offer your aid once more?"},{"name":"POBYANO","text":"Ah, pray tell, are you an adventurer looking to lend a hand with the faire? You have my thanks many times over. Gods know we could use the help."},{"name":"POBYANO","text":"No doubt you've heard by now. This year's Moonfire Faire is being held to vitalize this newly founded resort─the Isle of Endless Summer."},{"name":"POBYANO","text":"One of the many events planned is fireworks by the water. We have a firework mortar we could certainly use your help with."},{"name":"POBYANO","text":"There is more you should hear, but you will need to hear it from Jiriri. She is the overseer of all things fireworks for the faire."},{"name":"POBYANO","text":"She is in the employ of Master Gegeruju, and charged with the running of this isle. You should go and introduce yourself. But be sure to report back to me when you see the deed done. Until then!"},{"name":"POBYANO","text":"Speak with Jiriri to learn more about the fireworks we have planned. And be sure to report back to me when you see the deed done. Until then!"},{"name":"JIRIRI","text":"I recall your face. You are the one I saw earlier in the company of Haermaga. Excuse me for not introducing myself then. Permit me to now─I am Jiriri, proprietor of this resort isle. Tell me, how can I be of service?"},{"name":"JIRIRI","text":"You wish to help with the Moonfire Faire festivities? Oh, your aid will be most welcome. Thank you for the offer."},{"name":"JIRIRI","text":"The first job we would like to ask of you is the lighting of some fireworks. You will have to travel to the grounds where our visitors are gathered, and there throw a summer firework into a nearby firework mortar."},{"name":"JIRIRI","text":"Do that, and all faire-goers will be treated to a fiery flower of light in full bloom high above the ocean waters. Our grand display is in your hands now."},{"name":"POBYANO","text":"Many and more faire-goers are asking for fireworks on the water. We'd like nothing more than to oblige them, but we simply lack the manpower to cater to each and every request. Thank the gods for sending you when they did."},{"name":"JIRIRI","text":"You need only throw the summer firework I gave you into a firework mortar near where our visitors are gathered. Be sure to report back to P'obyano when you are done."},{"name":"JIRIRI","text":"Oh, my... That adventurer there is quite the, ummm... Heehee. Yes, well... Gods be good."},{"name":"ADVENTERER02956","text":"Beautiful! I'd grown weary looking for the treasure, but this... This is good for the soul."},{"name":"ADVENTERER02956","text":"Have you ever seen anything so amazing? I've been hunting for Moonfire treasure, but this is all the treasure I truly need."},{"name":"JIRIRI","text":"So you saw the fireworks lit. A job well done. No doubt it brought as broad a smile to your face as it did those of our faire-goers."},{"name":"JIRIRI","text":"Make no mistake, this great success is due to your efforts as much as our own. Without the help of you and your brethren, none of this would be possible. I pray you continue to bless us with your boon."},{"name":"POBYANO","text":"You succeeded in lighting the fireworks. Thank the gods for that. We had no one else to ask it of."},{"name":"POBYANO","text":"Treasure...? Hmmm, I cannot say I know anything about that, but mayhap Haermaga does."},{"name":"POBYANO","text":"Already he seems to have some secretive goings-on behind the faire. If anyone knows aught of whispers and rumors, it is him."},{"name":"POBYANO","text":"Again, thank you for your help with the fireworks. If you've the time and inclination, please speak to any of the other faire chaperones, or even to me again. We've all more than enough work to ask of you."},{"name":"POBYANO","text":"Your labors will be rewarded with Faire vouchers. You'll find you can exchange them for all manner of valuables."},{"name":"SYSTEM","text":"Faire vouchers can be earned by participating in the FATEs offered around the Isle of Endless Summer."},{"name":"SYSTEM","text":"They are also rewarded by completing quests given by P'obyano, Hildelana, and Beaudefoin."}],"reward":{"gil":500,"items":[{"id":20304}],"xp":7410},"reqs":{"jobs":[{"lvl":30,"id":1}]},"next":[68493,68494,68495,68496]},"partials":[{"type":"npc","id":"1023793","obj":{"i":1023793,"n":"Mayaru Moyaru","l":28,"q":1,"t":"Moonfire Faire Chaperone"}},{"type":"npc","id":"1023789","obj":{"i":1023789,"n":"P'obyano","l":32,"q":2,"t":"Moonfire Faire Chaperone"}},{"type":"item","id":"20304","obj":{"i":20304,"n":"Faire Voucher XVII","l":1,"c":25918,"t":85}},{"type":"quest","id":"68493","obj":{"i":68493,"n":"These Fireworks Won't Light Themselves","g":201,"l":"Eastern La Noscea","s":139,"r":1}},{"type":"quest","id":"68494","obj":{"i":68494,"n":"Fried Fish Is the Best Fish","g":201,"l":"Eastern La Noscea","s":140,"r":1}},{"type":"quest","id":"68495","obj":{"i":68495,"n":"You Had Me at Haddock","g":201,"l":"Eastern La Noscea","s":141,"r":1}},{"type":"quest","id":"68496","obj":{"i":68496,"n":"The True Meaning of Summer","g":201,"l":"Eastern La Noscea","s":142}}]}