{"quest":{"name":"A Sultana's Duty","location":"Ul'dah","id":68504,"patch":4.1,"sort":7,"eventIcon":71201,"issuer":1024102,"target":1024043,"involved":[1024040,1024041,1024042,1024585],"genre":7,"journal":["Nanamo seems lost in thoughts of the past."],"objectives":["Speak with Nanamo at Arrzaneth Ossuary.","Speak with Nanamo at the airship landing.","Speak with Nanamo at the Gold Saucer.","Speak with Nanamo."],"dialogue":[{"name":"NANAMOULNAMO","text":"We must make haste. My absence will not go unnoticed by the Sultansworn for long, and there are other places I would visit."},{"name":"NANAMOULNAMO","text":"To the Arrzaneth Ossuary!"},{"name":"NANAMOULNAMO","text":"When the Calamity threatened, Raubahn led the Alliance forces into battle on the plains of Carteneau. And I remained here."},{"name":"NANAMOULNAMO","text":"I prayed with all my heart that Archon Louisoix would have the power to rouse the Twelve."},{"name":"NANAMOULNAMO","text":"Since that day, I have made a custom of visiting this shrine during each of my little excursions. Here, I seek the blessing of Thal, reflect upon my choices, and ask myself if I am fulfilling my duties as sultana."},{"name":"NANAMOULNAMO","text":"You are rightly celebrated as a champion because you have led the line in a hundred battles for the good of Eorzea. In much the same way, I believe the measure of a monarch lies in how she leads her people in times of adversity."},{"name":"NANAMOULNAMO","text":"If I am to be a sultana worthy of the name, I cannot turn a blind eye to the troubles facing Ul'dah."},{"name":"NANAMOULNAMO","text":"I have chosen my path, <span class=\"highlight\">Forename</span>. With Ala Mhigo now freed from imperial chains, I finally see a way to aid the refugees."},{"name":"NANAMOULNAMO","text":"Already, many displaced Ala Mhigans seek to begin the long trek home."},{"name":"NANAMOULNAMO","text":"And as you well know, our artisans' school shall be waiting to accept any who wish to learn new trades. Realistically, however, it will take years for such training to yield tangible benefits."},{"name":"NANAMOULNAMO","text":"To facilitate that process, I have made a small contribution─an artisans' school in Rhalgr's Reach for any who wish to learn new trades. Realistically, however, it will take years for such training to yield tangible benefits."},{"name":"NANAMOULNAMO","text":"But we do not have years. These people will need shelter and employment if they are to survive, and <span class=\"emphasis\">this time</span> the Ul'dahn treasury shall provide!"},{"name":"NANAMOULNAMO","text":"Precisely where and how to allocate the necessary funds is, of course, another question..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Might you ask a member of the Syndicate for advice?"},{"name":"A1","text":"Why not seek the advice of one who employs refugees?"},{"name":"A1","text":"..."},{"name":"NANAMOULNAMO","text":"A wise suggestion. Mayhap a visit to the Gold Saucer is in order. Its proprietor is a member of the Syndicate, and he is one of the few who pay refugees a fair wage."},{"name":"NANAMOULNAMO","text":"...Nothing? Hmm... If even one of your worldly experience is at a loss, it would seem I have no choice but to seek out someone more well versed in monetary matters..."},{"name":"NANAMOULNAMO","text":"I wonder, are you acquainted with Godbert Manderville?"},{"name":"NANAMOULNAMO","text":"Then I need not explain his eccentric nature. Let us make our way to the landing, and I will see that word is sent to the Gold Saucer. Godbert should be only too glad to receive us."},{"name":"NANAMOULNAMO","text":"Ah, well he is a most generous man...if something of an eccentric. Let us make our way to the landing, and I will see that word is sent to the Gold Saucer. Godbert should be only too glad to receive us."},{"name":"SYSTEM","text":"To gain access to the Gold Saucer, you must first accept (or have previously completed) the quest “It Could Happen to You,” available at level 15 in Ul'dah on the Steps of Nald."},{"name":"ULDAHNCITIZEN02968","text":"I've never had such fun! That Manderville chap certainly spared no expense with that saucer of his!"},{"name":"ULDAHNCITIZEN02968","text":"Have you ever experienced the delights of the Gold Saucer? No!? Oh, you absolutely must! I believe there's a youth on the Steps of Nald who might have a spare ticket for anyone willing to listen to him boast of his good fortune."},{"name":"SYSTEM","text":"To gain access to the Gold Saucer, you must first accept (or have previously completed) the quest “It Could Happen to You,” available at level 15 in Ul'dah on the Steps of Nald."},{"name":"NANAMOULNAMO","text":"I have ridden aboard a public airship before, but this shall be my first visit to the Gold Saucer. I must confess to some excitement!"},{"name":"SYSTEM","text":"To gain access to the Gold Saucer, you must first accept (or have previously completed) the quest “It Could Happen to You,” available at level 15 in Ul'dah on the Steps of Nald."},{"name":"NANAMOULNAMO","text":"I had heard descriptions of its splendor, yet I never dreamed it would be so bright and inviting..."},{"name":"NANAMOULNAMO","text":"N-No! I couldn't possibly─! We did not come here to fritter away the royal coin!"},{"name":"NANAMOULNAMO","text":"Godbert will be expecting us. Come, let us head <span class=\"emphasis\">directly</span> to the lounge and ignore these...these...gaudy temptations!"},{"name":"NANAMOULNAMO","text":"I believe this is where we are to meet Lord Manderville. Shall we sit while we await his coming?"},{"name":"GODBERT","text":"My apologies, Your Grace, I have kept you waiting!"},{"name":"NANAMOULNAMO","text":"No apologies are necessary, Godbert. My request was sudden, and you were kind to make yourself available at such short notice."},{"name":"GODBERT","text":"When my son's good friend and the sultana herself come calling, there is no more important engagement!"},{"name":"GODBERT","text":"When the sultana herself comes calling, there is no more important engagement!"},{"name":"NANAMOULNAMO","text":"As to the purpose of my visit, I would have your thoughts on how the crown might best aid the refugees residing in Thanalan."},{"name":"NANAMOULNAMO","text":"You are aware, I am sure, that many of Ala Mhigo's displaced sons and daughters long to return to their newly liberated homeland. And you are also aware of how they will suffer without shelter and work to sustain them."},{"name":"NANAMOULNAMO","text":"I would use our nation's wealth to spare them that suffering. What advice have you for me on the matter of how it might best be distributed?"},{"name":"GODBERT","text":"...The unusual circumstances of our meeting, and Your Grace's choice of companion, would suggest to me a desire for an honest and unvarnished opinion. I shall give you one."},{"name":"GODBERT","text":"My advice to you is: “Stop.” Taxing Ul'dah's wealth to save Ala Mhigan refugees is a terrible, terrible idea."},{"name":"NANAMOULNAMO","text":"You <span class=\"emphasis\">oppose</span> my proposition?"},{"name":"GODBERT","text":"Most emphatically. I agree with Your Grace that the refugees must have housing and employment, but what profit is there for Ul'dah in this arrangement?"},{"name":"NANAMOULNAMO","text":"<span class=\"emphasis\">Profit</span>? After all you have done for Gyr Abania's displaced, I thought you the very last person to seek to benefit from their misfortune!"},{"name":"GODBERT","text":"Forgive me, Your Grace, but you appear to be laboring under a misapprehension."},{"name":"GODBERT","text":"It is a fine endeavor to support one's fellow man. I fear, however, that your stance is one born of pity─your intent is to “save” the refugees, is it not?"},{"name":"GODBERT","text":"For all our potential, we are indolent creatures by nature. If unconditional charity is all we know, then we begin to rely upon it─to expect it."},{"name":"GODBERT","text":"And then we must consider Ul'dah's own poor and downtrodden. Should they hear of you spending the nation's coin─not to improve their lot, but to nurture the distant citizens of Ala Mhigo─it is unlikely they will applaud your generosity."},{"name":"GODBERT","text":"Surely it is not Your Grace's intention to foster new resentments, but to spread goodwill?"},{"name":"NANAMOULNAMO","text":"Indeed.<br>...Then any support I pledge to the refugees must promote self-sufficiency, whilst also serving the interests of the people of Ul'dah."},{"name":"GODBERT","text":"Exactly so! Such an arrangement will create a far more equitable relationship with the returning Ala Mhigans, even as it generates the revenue required to win the approval of your subjects."},{"name":"NANAMOULNAMO","text":"You have given me much to ponder, Lord Manderville. I thank you for your candor."}],"reward":{"gil":825,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68503]},"next":[68505]},"partials":[{"type":"npc","id":"1024102","obj":{"i":1024102,"n":"Nanamo Ul Namo","l":41,"q":2}},{"type":"npc","id":"1024043","obj":{"i":1024043,"n":"Nanamo Ul Namo","l":1484,"q":2}},{"type":"npc","id":"1024040","obj":{"i":1024040,"n":"Nanamo Ul Namo","l":40,"q":1}},{"type":"npc","id":"1024041","obj":{"i":1024041,"n":"Nanamo Ul Namo","l":40,"q":1}},{"type":"npc","id":"1024042","obj":{"i":1024042,"n":"Nanamo Ul Namo","l":1484,"q":1}},{"type":"npc","id":"1024585","obj":{"i":1024585,"n":"Blithesome Businessman","l":40,"q":1}},{"type":"quest","id":"68503","obj":{"i":68503,"n":"A Sultana's Strings","g":7,"l":"The Lochs","s":6}},{"type":"quest","id":"68505","obj":{"i":68505,"n":"A Sultana's Resolve","g":7,"l":"The Gold Saucer","s":8}}]}