{"quest":{"name":"The Mad King's Trove","location":"The Lochs","id":68500,"patch":4.1,"sort":3,"icon":100741,"eventIcon":71201,"issuer":1024104,"target":1024104,"involved":[1024103,1024134,1024135],"genre":7,"journal":["Alphinaud seems eager to share his theory.","Before unveiling his grand theory, Alphinaud would adjourn to a more appropriate location─specifically, the southern shore of Loch Seld.","After favoring you with a short lecture on the history of Loch Seld, Alphinaud posits that the “darkness beneath the palace” referred to by Ernold may contain the submerged remnants of the ancient city of Skalla. He further theorizes that Theodoric had his kinsmen cursed and cast into the depths not only to punish them for their imagined crimes, but to have them serve as guardians over his treasures. Whilst Alphinaud and Arenvald search for a way into the ruins from above, you are to scour the loch bed for an underwater entrance.","In the frigid waters of Loch Seld, you discover a passage leading directly beneath the palace foundations. Such a find warrants further investigation...","You have discovered a stone door which appears to offer a way into the ruins beneath the palace. Enter the Drowned City of Skalla, and search for the mad king's trove!<br><br>※The Drowned City of Skalla can be accessed via the Duty Finder.","You have defeated the monstrous denizens of Skalla. The fabled treasure must surely lie nearby...","As you gaze upon the riches of the mad king's trove, Alphinaud and Arenvald tumble in from a different section of the ruins. Return to the Ala Mhigan Quarter, and recount your respective adventures.","With grudging admiration, Alphinaud declares you the victor of the impromptu race to the treasure. Arenvald, meanwhile, seems more intent on teasing Alphinaud for his reaction to one of the ruins' ghostly inhabitants..."],"objectives":["Speak with Alphinaud on the southern shore of Loch Seld.","Search the ruins on the loch floor.","Investigate the passage.","Enter the Drowned City of Skalla.","Speak with Alphinaud in the Ala Mhigan Quarter."],"dialogue":[{"name":"ARENVALD","text":"...Well? Out with it! What's this theory of yours?"},{"name":"ALPHINAUD","text":"...Actually, mayhap it would be better if we first adjourned to a more suitable location."},{"name":"ARENVALD","text":"...In case a rival treasure hunter overhears our plans, you mean? Good thinking!"},{"name":"ALPHINAUD","text":"That...was not exactly the reason, but 'tis certainly a valid concern. Let us reconvene on the southern edge of Loch Seld."},{"name":"ARENVALD","text":"Come now, Alphinaud, don't leave us in suspense! Let's hear this theory of yours!"},{"name":"ALPHINAUD","text":"Forgive me. 'Twas not my intention to draw out proceedings. I simply wished to have the loch in sight while I explained things."},{"name":"ALPHINAUD","text":"Prior to the great flood of the Sixth Umbral Calamity, the salt lakes you see before you were yet dry ravines. And this, believe it or not, was the site of the ancient city of Skalla, which rose and fell during the Fifth Astral Era."},{"name":"ALPHINAUD","text":"From what we know of the period, the city was already deserted by the time the waters began to rise, having been all but destroyed by war. Yet its ruins remain to this day at the bottom of Loch Seld."},{"name":"ALPHINAUD","text":"It is my belief that the “darkness beneath the palace” mentioned by Theodoric's former scribe was not a reference to the prison, but to a place still further below: the ruins of Skalla."},{"name":"ALPHINAUD","text":"I further surmise that the mad king's unfortunate kinsmen were cast down there not simply out of a desire to punish them, but to discourage exploration. Theodoric wanted to keep the ruins secure..."},{"name":"ARENVALD","text":"Wait...you're saying...they were meant to guard the mad king's trove!"},{"name":"ALPHINAUD","text":"Precisely. And since we know the court thaumaturge was involved, we can safely assume that any entrance into the old city will have been magically concealed."},{"name":"ARENVALD","text":"...Which would explain how a legion of imperial soldiers and the gods know how many Ala Mhigans never found a trace of the trove."},{"name":"ALPHINAUD","text":"We, however, have certain advantages which they did not enjoy. <span class=\"highlight\">Forename</span>─would you be so good as to swim down to the bottom of the loch and search for an underwater route into the ruins? While you do that, Arenvald and I will seek out an ensorcelled portal within the palace."},{"name":"SYSTEM","text":"You discover a passage that appears to lead under the palace foundations. Press on, and find out where it goes."},{"name":"SYSTEM","text":"You come to a worn stone door, standing temptingly ajar. It would appear you have found an entrance into the subterranean ruins."},{"name":"ALPHINAUD","text":"(-Alphinaud's Voice-)<span class=\"highlight\">Forename</span>─it's Alphinaud. We have searched the prison beneath the palace, and found a door concealed by enchantments. Have you aught to report?"},{"name":"ALPHINAUD","text":"(-Alphinaud's Voice-)...And you believe it leads into the ruins? Excellent. Then I propose we proceed from our respective entry points and look to meet somewhere in the middle."},{"name":"ARENVALD","text":"(-Arenvald's Voice-)Oh, come on, <span class=\"alternative-container\"><span class=\"alternative\">you two</span><span class=\"alternative\">lads</span></span>─we might as well make it a race! Victory goes to the first adventurer to find the treasure! Godsspeed!"},{"name":"ARENVALD","text":"Our path was dark, treacherous, and fair <span class=\"emphasis\">crawling</span> with abominations... Long story short, it was a proper adventure!"},{"name":"ALPHINAUD","text":"Arenvald and I forged ahead at the fastest pace we could manage, but I was not surprised to find you waiting for us. I suppose it serves us right for challenging the Warrior of Light. Next time, we should agree on some manner of handicap..."},{"name":"ARENVALD","text":"Ah, we may have lost, Alphinaud─but think of what we found!"},{"name":"ALPHINAUD","text":"Quite. I am still reeling at the sight of that mountain of riches..."},{"name":"ARENVALD","text":"What, like how you reeled at the sight of that floating specter, you mean? You should have heard him scream, <span class=\"highlight\">Forename</span>!"},{"name":"ALPHINAUD","text":"M-Must we dwell on such momentary lapses!? We found the mad king's trove, and that is all that matters!"}],"reward":{"gil":4325,"xp":0,"instance":58},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68499]},"next":[68501]},"partials":[{"type":"npc","id":"1024104","obj":{"i":1024104,"n":"Alphinaud","l":2408,"q":3}},{"type":"npc","id":"1024103","obj":{"i":1024103,"n":"Arenvald","l":2408,"q":3}},{"type":"npc","id":"1024134","obj":{"i":1024134,"n":"Alphinaud","l":2408,"q":1}},{"type":"npc","id":"1024135","obj":{"i":1024135,"n":"Arenvald","l":2408,"q":1}},{"type":"instance","id":"58","obj":{"i":58,"n":"The Drowned City of Skalla","c":61801,"t":"Dungeons","min_lvl":70,"max_lvl":70,"min_ilvl":300,"max_ilvl":370}},{"type":"quest","id":"68499","obj":{"i":68499,"n":"The Darkness Below","g":7,"l":"Rhalgr's Reach","s":2}},{"type":"quest","id":"68501","obj":{"i":68501,"n":"The Butcher's Blood","g":7,"l":"The Lochs","s":4}}]}