{"quest":{"name":"A Sultana's Resolve","location":"The Gold Saucer","id":68505,"patch":4.1,"sort":8,"eventIcon":71201,"issuer":1024043,"target":1024045,"involved":[1020622,1024044],"genre":7,"journal":["Nanamo appears to be reassessing her plans."],"objectives":["Speak with Hancock in Kugane.","Speak with Nanamo in Ul'dah.","Speak with Nanamo at the Waking Sands.","Speak with Nanamo."],"dialogue":[{"name":"NANAMOULNAMO","text":"<span class=\"emphasis\">Profit</span>... The thought never even crossed my mind."},{"name":"NANAMOULNAMO","text":"But standing about lamenting my naivety will not do anyone any good. I shall consider my lesson learned, and press on."},{"name":"NANAMOULNAMO","text":"<span class=\"highlight\">Forename</span>─are you perchance acquainted with any successful merchants? If my attempt at philanthropy is obliged to reap a profit, it would seem wise to consult someone with a knack for business."},{"name":"NANAMOULNAMO","text":"Hm... Ordinarily, I would not trust any agent of the East Aldenard Trading Company─but if you hold this Hancock fellow in high esteem, I am content to be led by you. You may repay my faith by journeying to distant Kugane and speaking with him on my behalf."},{"name":"NANAMOULNAMO","text":"Eager though I am to visit those shores, I have not the leisure for a lengthy sea voyage. Now, assuming you will travel as adventurers are wont to do, I shall await your report by the aetheryte in Ul'dah. A fair journey to you, <span class=\"highlight\">Forename</span>─and a <span class=\"emphasis\">swift</span> one, if you please."},{"name":"HANCOCK","text":"<span class=\"highlight\">Forename</span>! To what do I owe the pleasure? Or are you here on business?"},{"name":"HANCOCK","text":"...I beg your pardon? Her Grace the sultana would have <span class=\"emphasis\">my</span> opinion on how best to invest the wealth of Ul'dah?"},{"name":"HANCOCK","text":"My dear <span class=\"highlight\">Forename</span>... I have you to thank for this...recognition, I am sure. And I am flattered that you came to me. Truly flattered."},{"name":"HANCOCK","text":"But why settle for a lowly apprentice, when you could have the master! Upon matters of profit, there is no living soul better-qualified to advise Her Grace than Chairman Lolorito─a man whose morning “exertions” are said to fill his garderobe with gold!"},{"name":"HANCOCK","text":"I should be happy to arrange a meeting for you...say, at the Scions' former headquarters in Thanalan? The Waking Sands would seem a suitably <span class=\"emphasis\">neutral</span> venue for negotiations, don't you think? Fare you well, <span class=\"highlight\">Forename</span>, and may your dealings prove fruitful!"},{"name":"HANCOCK","text":"You will not find a shrewder merchant than Chairman Lolorito. Would that I could be present to witness the back-and-forth of your coming negotiations!"},{"name":"NANAMOULNAMO","text":"Welcome back, <span class=\"highlight\">Forename</span>. Did your merchant friend have any useful advice to share?"},{"name":"NANAMOULNAMO","text":"...With <span class=\"emphasis\">Lolorito</span>!? And you agreed to this!?"},{"name":"NANAMOULNAMO","text":"I am well aware of his standing in the field of business. But I had hoped to keep the Monetarists at arm's length, and <span class=\"emphasis\">him</span> in particular..."},{"name":"NANAMOULNAMO","text":"...Nay. I cannot live in fear of the man. I must learn how to treat with him if I am to rule Ul'dah effectively."},{"name":"NANAMOULNAMO","text":"Very well! I will meet with Lolorito. Let us go on ahead to the Waking Sands, and prepare for his coming."},{"name":"NANAMOULNAMO","text":"So this is where the Scions first congregated... I have heard many tales, but never had occasion to visit."},{"name":"NANAMOULNAMO","text":"To work, then. The hour of the meeting draws near, and I would gather my thoughts. Pray see to it that we have the appointed room to ourselves."},{"name":"NANAMOULNAMO","text":"&lt;sigh&gt; I fear it will be many years before I feel comfortable taking part in such negotiations."},{"name":"NANAMOULNAMO","text":"But I shall not complain. We have piqued Lolorito's interest and secured his invaluable expertise.<br>Thank you, <span class=\"highlight\">Forename</span>. I could not have done it without you."}],"reward":{"gil":2896,"items":[{"id":19821,"one":1},{"id":19812,"one":1},{"id":19815,"one":1},{"num":2,"id":5825,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68504]},"next":[68506]},"partials":[{"type":"npc","id":"1024043","obj":{"i":1024043,"n":"Nanamo Ul Namo","l":1484,"q":2}},{"type":"npc","id":"1024045","obj":{"i":1024045,"n":"Nanamo Ul Namo","l":356,"q":2}},{"type":"npc","id":"1020622","obj":{"i":1020622,"n":"Hancock","l":2927,"q":6}},{"type":"npc","id":"1024044","obj":{"i":1024044,"n":"Nanamo Ul Namo","l":40,"q":1}},{"type":"item","id":"19821","obj":{"i":19821,"n":"Onigara-yaki","l":285,"c":24322,"t":46}},{"type":"item","id":"19812","obj":{"i":19812,"n":"Jellied Compote","l":300,"c":24082,"t":46}},{"type":"item","id":"19815","obj":{"i":19815,"n":"Persimmon Leaf Sushi","l":300,"c":21005,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"68504","obj":{"i":68504,"n":"A Sultana's Duty","g":7,"l":"Ul'dah","s":7}},{"type":"quest","id":"68506","obj":{"i":68506,"n":"Securing the Saltery","g":7,"l":"The Waking Sands","s":9}}]}