{"quest":{"name":"The Butcher's Blood","location":"The Lochs","id":68501,"patch":4.1,"sort":4,"eventIcon":71201,"issuer":1024103,"target":1024112,"involved":[1020516,1024104,1024105,1024107,1024108,1024109,1024110,1024111],"genre":7,"journal":["Arenvald is still grinning at Alphinaud's discomfort."],"objectives":["Speak with Lyse.","Speak with the prison guard."],"dialogue":[{"name":"ALPHINAUD","text":"First Estinien, and now Arenvald... 'Twould seem there is much amusement to be had at my expense. Honestly, I might as well go adventuring with <span class=\"emphasis\">Alisaie</span>..."},{"name":"ARENVALD","text":"All jesting aside, we must tell people the good news. And I think Lyse should be the first."},{"name":"ALPHINAUD","text":"Seconded. There is to be a meeting of representatives from across Ala Mhigo, so she is sure to be in the city. Shall we seek her out?"},{"name":"LYSE","text":"Oh? You three look pleased with yourselves. What've you been up to?"},{"name":"ARENVALD","text":"I'm glad you asked, Lyse. And I'm pretty sure you're going to like the answer..."},{"name":"LYSE","text":"You're joking... The mad king's trove!? I thought it was a myth!"},{"name":"ARENVALD","text":"So did plenty of people. But they didn't have <span class=\"highlight\">Forename</span> and Alphinaud in their party. The credit for finding it should really go to them. As for what to do with it all...I vote that it go towards alleviating the suffering of Ala Mhigo's poor."},{"name":"LYSE","text":"Gods... If there's as much as you say..."},{"name":"ALPHINAUD","text":"Arenvald did not exaggerate, I assure you. We could not hope to carry even a fraction of it out on our own. I have taken the liberty of sketching out a rough map of the ruins─if you will assemble a squad of your most trusted freedom fighters, they should be able to follow the route to where the treasure lies."},{"name":"LYSE","text":"Understood. I'll make sure every coin is accounted for, and that goes for the spending of it as well!"},{"name":"ARENVALD","text":"Thank you."},{"name":"ARENVALD","text":"Oh, there is one other thing: when the time comes to draw up a plan for distributing the spoils, I would ask that you consult Alphinaud."},{"name":"ARENVALD","text":"I don't have a head for details. I'm not...educated. I see that simply handing out sacks of gil won't solve everything, but I couldn't rightly tell you what to do instead."},{"name":"LYSE","text":"Oh, I know the feeling! I'd welcome any advice you could give us, Alphinaud."},{"name":"ALPHINAUD","text":"Of course. I shall be at your disposal."},{"name":"RESISTANCEWARRIOR","text":"Commander! We've got a problem!"},{"name":"LYSE","text":"Deep breaths. Tell me what's happened."},{"name":"RESISTANCEWARRIOR","text":"A mob's gathered outside headquarters, and they've started making demands. You'd best come and see for yourself!"},{"name":"ALPHINAUD","text":"Fordola and her Skulls may have aspired to be imperial citizens, but they were born Ala Mhigan. To their countrymen, they are traitors of the worst kind."},{"name":"ARENVALD","text":"The Butcher has much to answer for...but to simply drag her from her cell and slaughter her in the street...? General Aldynn is right."},{"name":"RAUBAHN","text":"After twenty years of imperial rule, 'tis no surprise that people should seek a target for all their pent-up rage and grief... I only wish I knew the solution."},{"name":"MNAAGO","text":"Thank the gods General Aldynn arrived when he did. Any later and we would've had a riot on our hands."},{"name":"CAMPGUARD","text":"No one goes in without the commander's permission─not even you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"LYSE","text":"My thanks, Raubahn. Listening to their anger, I could feel myself being swept away..."},{"name":"RAUBAHN","text":"'Tis a difficult tide to stem. 'Twas that same rage which brought us to our feet, and carried us to victory. But now the war is over, all the unspent fury is being channeled into vengeance."},{"name":"MNAAGO","text":"Aye, and it's not just here─we've reports of mobs forming all over."},{"name":"MNAAGO","text":"They've been targeting folk known to have cooperated with the Garleans. It starts with insults most often, then someone picks up a stone..."},{"name":"MNAAGO","text":"Some industrious souls even thought to seek out the graves of Zenos and his officers. It was...grim."},{"name":"LYSE","text":"I want to build a country where everyone, regardless of race or origin, can live side by side in peace. But maybe the time isn't right. Maybe people just aren't ready..."},{"name":"LYSE","text":"But that doesn't mean I'm not going to try. The representatives will be here soon, and I'll be damned if I'm going to give up before I've even begun."},{"name":"ARENVALD","text":"Who are these representatives exactly?"},{"name":"LYSE","text":"Oh, village elders, refugee leaders and the like. It wouldn't be right for us to dictate the nation's future on our own, so we've planned a summit of sorts."},{"name":"LYSE","text":"We've even invited the Ananta and the Qiqirn to participate."},{"name":"RAUBAHN","text":"Ala Mhigo stands at a crossroads, and this meeting will decide which path it takes. The matter of Fordola's sentence cannot be suffered to disrupt proceedings."},{"name":"MNAAGO","text":"Then let's execute her and be done with it. She herself asked to be put to death."},{"name":"LYSE","text":"Naago! I already explained why we wouldn't do that!"},{"name":"LYSE","text":"Sending her to the gallows might satisfy people right now, but where would it end? Should we round up everyone who collaborated? And everyone who didn't resist? There would be no one left! And we'd be no better than Theodoric and Zenos!"},{"name":"ARENVALD","text":"Begging your pardon, but...might I be allowed to speak with Fordola? Only, I caught a glimpse of her past. A moment of it, anyway─during the fight."},{"name":"ARENVALD","text":"She's done terrible things, aye...unforgivable things... But...in some ways, she's a victim of the circumstances in which she was born. And that's something I can understand..."},{"name":"LYSE","text":"All right. Speak with the prison guard when you're ready, and I'll come and join you. I want to talk to her too."},{"name":"RAUBAHN","text":"I'll return to my other duties, then─we've barely begun to investigate the facility where they gave Fordola her powers. Be fairly warned, friends: she will test you. Don't let your emotions color your judgment when she does."},{"name":"ALPHINAUD","text":"If you will have me, I have a mind to attend this interview as well."},{"name":"ARENVALD","text":"I've no great wish to save Fordola, even if I could. But there's more to her than meets the eye, I'm sure of it..."},{"name":"LYSE","text":"Speak with the guard, and we'll all go in together."},{"name":"MNAAGO","text":"I think it's best if I stay outside and keep watch for troublemakers. After what that woman did to Meffrid and Commander Kemp, I'd struggle not to throttle her."},{"name":"CAMPGUARD","text":"You've the commander's permission to enter, then?"},{"name":"Q1","text":"Enter the prison?"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"}],"reward":{"gil":1189,"items":[{"id":21317}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68500]},"next":[68502]},"partials":[{"type":"npc","id":"1024103","obj":{"i":1024103,"n":"Arenvald","l":2408,"q":3}},{"type":"npc","id":"1024112","obj":{"i":1024112,"n":"Prison Guard","l":2408,"q":1}},{"type":"npc","id":"1020516","obj":{"i":1020516,"n":"Lyse","l":2408,"q":1}},{"type":"npc","id":"1024104","obj":{"i":1024104,"n":"Alphinaud","l":2408,"q":3}},{"type":"npc","id":"1024105","obj":{"i":1024105,"n":"Lyse","l":2408,"q":1}},{"type":"npc","id":"1024107","obj":{"i":1024107,"n":"Lyse","l":2408,"q":1}},{"type":"npc","id":"1024108","obj":{"i":1024108,"n":"Alphinaud","l":2408,"q":1}},{"type":"npc","id":"1024109","obj":{"i":1024109,"n":"Arenvald","l":2408,"q":1}},{"type":"npc","id":"1024110","obj":{"i":1024110,"n":"Raubahn","l":2408,"q":1}},{"type":"npc","id":"1024111","obj":{"i":1024111,"n":"M'naago","l":2408,"q":1}},{"type":"item","id":"21317","obj":{"i":21317,"n":"The Measure of Our Reach Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"68500","obj":{"i":68500,"n":"The Mad King's Trove","g":7,"l":"The Lochs","s":3}},{"type":"quest","id":"68502","obj":{"i":68502,"n":"Echoes of an Echo","g":7,"l":"The Lochs","s":5}}]}