{"quest":{"name":"Heaven-sent","location":"The Ruby Sea","id":68509,"patch":4.1,"sort":1,"icon":100728,"beast":9,"unlocksFunction":1,"eventIcon":71341,"issuer":1024221,"target":1024230,"involved":[1024222,1024223,1024226],"genre":50,"journal":["This vexed villager is keeping watch of the ocean with a growing sense of dread.<br>※The difficulty of this quest will be synced to your current level.","A man of Isari has been waiting patiently for his daughter to return from Kugane, but can stand it no longer. Fearing the worst, he asks you to go and search for her along the shore of Sakazuki.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You find a young maiden along the shore in the company of a Blue Kojin with two Red Kojin fallen at their feet. Mistaking you for a threat, the Blue Kojin prepares to fight, but soon lowers his blade as you explain why you have come. The maiden before you is, in fact, Shihoumi, and she tells of the Blue Kojin's daring rescue. Though gravely injured, he soon runs off to retrieve Shihoumi's stolen cargo from the Red Kojin. She begs you to save him from this fool's errand before it is too late.","The Blue Kojin is badly bruised and surrounded by his Red brothers, but you quickly put an end to their assault. With the Red Kojin defeated, you tend to the fallen Blue Kojin's wounds.","You and the Blue Kojin named Kabuto are soon joined by Shihoumi, who wishes to thank you both for your help. Kabuto, however, insists that he be the one to reward you, given that you saved his life. Nevertheless, the girl insists that he accept a gift─an item of his choosing from among her wares─and Kabuto relents, settling upon a doll crafted in the likeness of a Kojin. He then invites you to Tamamizu, where he might present to you a token of his gratitude.","You meet with Kabuto at Tamamizu and are taken to their newly created treasure vault. His plans to thank you are soon halted when the Kojin find themselves in the presence of a kami. The divine spirit, who prefers to be addressed as Tsukumo, declares Kabuto the leader of a group known as the Divine Circle, whose mission is to traverse the realm in search of treasures to fill their vault. Moreover, you have been named his first recruit. Never one to decline a call to action, you prepare yourself for adventures both wondrous and perilous."],"objectives":["Search for Shihoumi.","Find the overconfident Kojin.","Aid the overconfident Kojin.","Speak with Kabuto."],"dialogue":[{"name":"FATHER02973","text":"Where's that blasted boat? It should've been here by now..."},{"name":"FATHER02973","text":"Oh! Sorry, didn't see you there. My daughter is late returning from Kugane, you see, and I thought to come and look for her."},{"name":"FATHER02973","text":"I can't imagine the Confederacy giving her any trouble; she's always been good about putting money aside for the Ruby Tithe... Oh gods! What if the Red Kojin caught sight of her?"},{"name":"FATHER02973","text":"My dear, sweet Shihoumi. She only meant to bring home a bit of old furnishings to give comfort to our village. I don't know what I'd do if anything should happen to her."},{"name":"FATHER02973","text":"I know this is sudden, but...you've the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who can handle a bit of danger. Would you be willing to look for my daughter? She should be traveling close to the shore of Sakazuki."},{"name":"FATHER02973","text":"Oh, Shihoumi... I pray you are safe."},{"name":"KABUTO","text":"Stay back, or taste my steel!"},{"name":"SHIHOUMI","text":"Ahhh! Please, stay away!"},{"name":"KABUTO","text":"Not another step."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I was sent here by a fisherman from Isari."},{"name":"A1","text":"I've come from Isari in search of Shihoumi."},{"name":"SHIHOUMI","text":"A fisherman from Isari? By any chance did he send you in search of his daughter? If so, I suppose it is me you are searching for. My name is Shihoumi."},{"name":"SHIHOUMI","text":"From Isari, you say? Was it my father who sent you for me?"},{"name":"SHIHOUMI","text":"My ship was attacked by the Red Kojin, but I was saved by this warrior of the Blue. Would that we could have saved the cargo on board."},{"name":"KABUTO","text":"Save the cargo? Very well."},{"name":"SHIHOUMI","text":"Wait! Your kindness is greatly appreciated, but you cannot mean to go against the Red Kojin. Not alone."},{"name":"SHIHOUMI","text":"Please, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, you have to go after him!"},{"name":"SHIHOUMI","text":"He was gravely injured in my rescue. 'Twould be suicide for him to face them in his condition!"},{"name":"SHIHOUMI","text":"We barely escaped the Red Kojin with our lives. He has no chance against them with those injuries."},{"name":"BALLOON","text":"Land-dwelling scum!"},{"name":"BALLOON","text":"These treasures belong to the Red!"},{"name":"BALLOON","text":"Stay out of our way!"},{"name":"KABUTO","text":"How could I fall for such an obvious trap..."},{"name":"KABUTO","text":"Thank you, brave warrior."},{"name":"SON02973","text":"Oh, thank goodness you're both all right!"},{"name":"KABUTO","text":"Why have you come, woman!?"},{"name":"SHIHOUMI","text":"I...I'm sorry. You both were gone for so long I began to worry, and..."},{"name":"KABUTO","text":"Do not misunderstand. I am not angry. I meant only to say this place is dangerous."},{"name":"KABUTO","text":"But the Red are gone now, and your cargo is safe. Everything is there, yes?"},{"name":"SHIHOUMI","text":"One...two... Yes, yes, this seems to be all of it."},{"name":"SHIHOUMI","text":"The others will be so happy when they see these goods. Thank you so much!"},{"name":"KABUTO","text":"Then my work here is finished."},{"name":"SHIHOUMI","text":"Wait, please. Would you at least tell me the name of the gallant Kojin who rescued me?"},{"name":"KABUTO","text":"My name...?"},{"name":"KABUTO","text":"(-Kabuto-)I am Kabuto of the Blue."},{"name":"KABUTO","text":"(-Kabuto-)You, brave warrior. What is the name of the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who rescued me?"},{"name":"KABUTO","text":"(-Kabuto-)<span class=\"highlight\">Forename</span>... I shall remember it."},{"name":"SHIHOUMI","text":"I haven't much, but please, let me repay you both for your kindness."},{"name":"KABUTO","text":"(-Kabuto-)<span class=\"highlight\">Forename</span> saved my life. For another to repay my debt of gratitude would be a stain on my honor. "},{"name":"SHIHOUMI","text":"I...I see... Then at the very least, let me give you something. Most of these goods are worn or broken, but if anything here is to your liking, by all means."},{"name":"KABUTO","text":"(-Kabuto-)Broken?"},{"name":"SHIHOUMI","text":"Repairing them is part of my training as a craftsman. Thankfully the merchants of Kugane are willing to part with such wares for relatively little. Still, I hope there is something here that pleases you."},{"name":"KABUTO","text":"(-Kabuto-)What is this?"},{"name":"SHIHOUMI","text":"Ah, that is a karakuri puppet. Would that I knew who made it or how. Fixing it was quite the challenge. Still, the children back home will love─"},{"name":"KABUTO","text":"(-Kabuto-)I would have this karakuri."},{"name":"SHIHOUMI","text":"Oh. That is a...fine choice. Yes, a fine choice indeed. Far be it from me to deny the Kojin who saved me his reward."},{"name":"KABUTO","text":"(-Kabuto-)<span class=\"highlight\">Forename</span>. Meet with me at the entrance to Tamamizu. There, I will present you with a token of my thanks."},{"name":"SHIHOUMI","text":"A peculiar one, isn't he? Certainly not the best with words, but his heart is pure and sword true."},{"name":"SHIHOUMI","text":"Thank you again for your help. Delivering these home should be easy enough on my own. Take care, and safe travels."},{"name":"KABUTO","text":"You have come. Good."},{"name":"BUNCHIN","text":"There you are! You disobeyed me to go and search for treasures again, didn't you?"},{"name":"BUNCHIN","text":"What's this? Ah, <span class=\"highlight\">Forename</span>. A welcome surprise. I hope Kabuto has not given you too much trouble."},{"name":"KABUTO","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> saved my life, and so I wished to present <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> a token of my gratitude. I did not realize you were acquainted. Perhaps I should take my leave..."},{"name":"BUNCHIN","text":"Wait, Kabuto! Where are you going? What of your gift to <span class=\"highlight\">Forename</span>?"},{"name":"KABUTO","text":"So you did not come to speak with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>?"},{"name":"BUNCHIN","text":"I was not even aware <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was here!"},{"name":"BUNCHIN","text":"I came here searching for you. How many times must I tell you not to go searching for treasure on your own? The Red are running amok in the Ruby Sea, you know this."},{"name":"KABUTO","text":"Yes, I went alone, and yes, I was saved by <span class=\"highlight\">Forename</span>, but I believe it was fate. It brought us together and rewarded me with a karakuri puppet."},{"name":"BUNCHIN","text":"I will not deny you are a gifted fighter, but it would be foolish to mistake today's happenstance for good fortune. Though I suppose you have done worse in more favorable situations."},{"name":"KABUTO","text":"Before we continue, I wish to add today's find to the treasure vault."},{"name":"BUNCHIN","text":"You seem puzzled, <span class=\"highlight\">Forename</span>. Ah! You must think he means to travel to the Isle of Zekki. Allow me to explain."},{"name":"BUNCHIN","text":"As you are well aware, the Isle of Zekki has been home to the most prized relics of both the Red and the Blue since time immemorial."},{"name":"BUNCHIN","text":"Though the Red guard it fiercely, they can no longer subsist on the plunder of the imperials. Now they demand that we join in their work as mercenaries and raiders. Naturally we refused, and so they deny us entry to the vault."},{"name":"BUNCHIN","text":"Rather than take up arms against our brothers, we have taken it upon ourselves to create a new treasure vault, here in Tamamizu."},{"name":"BUNCHIN","text":"To that end we have devoted a great deal of effort to searching far and wide for treasures with which to fill our vault. If certain individuals would learn not to wander off on their own, I could take comfort in knowing said efforts are not wasted."},{"name":"KABUTO","text":"The others would only slow me down..."},{"name":"BUNCHIN","text":"You will have to forgive Kabuto─he is as stubborn as his shell is thick. But you are not here to listen to our quarrels. Come, let us make our way to the treasure vault."},{"name":"MAKURA","text":"Kabuto, you've returned! What wondrous treasure have you brought us today?"},{"name":"SHIKITAHE","text":"You can't possibly expect to fill the vault on your own. Such a task is much too great, even for you. Let us help, brother."},{"name":"KABUTO","text":"No. I work alone."},{"name":"BUNCHIN","text":"Oh my! You never mentioned the puppet was a Kojin. Such detail, such craftsmanship. The kami will surely be pleased with a treasure so fine."},{"name":"TSUKUMO","text":"(-???-)Kabuto of the Blue!"},{"name":"BUNCHIN","text":"Wh-What!? Makura, was that you?"},{"name":"TSUKUMO","text":"(-???-)No one walks alone, Kabuto. To turn your back on your brothers and sisters would be folly of the greatest order."},{"name":"BUNCHIN","text":"A tsukumogami!? Oh great, divine spirit, we are humbled by your presence."},{"name":"TSUKUMO","text":"(-???-)Raise your heads and be proud! You have done well to gather such a glorious bounty."},{"name":"TSUKUMO","text":"(-???-)But the task before you is too great for a single Kojin. Kabuto, you must lead your brothers and sisters. Lead them to ever greater treasures and prosperity! "},{"name":"MAKURA","text":"You have been chosen, brother!"},{"name":"KABUTO","text":"I am honored. Truly, I am. I swear on my honor our vault will overflow with riches, but I need no help to─"},{"name":"TSUKUMO","text":"(-???-)Silence! You <span class=\"emphasis\">will</span> form a company of treasure seekers, starting with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"TSUKUMO","text":"(-???-)Yes, you─<span class=\"alternative-container\"><span class=\"alternative\">the fleshy one</span><span class=\"alternative\">with the long neck</span><span class=\"alternative\">with the short legs</span><span class=\"alternative\">with the fuzzy tail</span><span class=\"alternative\">with the muscular arms</span><span class=\"alternative\">with the horns</span><span class=\"alternative\">with the funny ears</span></span>."},{"name":"KABUTO","text":"Please, divine one. There is no need to burden <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> with─"},{"name":"TSUKUMO","text":"(-???-)Such insolence! You call yourself a warrior, but your prowess pales before the might of <span class=\"highlight\">Forename</span>."},{"name":"TSUKUMO","text":"(-???-)Was it not <span class=\"emphasis\">you</span> who said it was fate that brought you together?"},{"name":"KABUTO","text":"Yes, but...how do you─"},{"name":"TSUKUMO","text":"(-???-)You must accept that to which fate has bound you, Kabuto, and do so with all your heart."},{"name":"TSUKUMO","text":"(-???-)Henceforth, you and yours will be known as the Divine Circle. Who else shall join you in this endeavor?"},{"name":"KABUTO","text":"Well, there is Zukin, Makura, and Shikitahe. I mean, that is... If it isn't an inconvenience..."},{"name":"TSUKUMO","text":"(-???-)Where is your backbone, Kabuto? The duty placed upon you is both sudden and daunting, so your uncertainty shall be forgiven─but only this once."},{"name":"TSUKUMO","text":"Furthermore, until you prove your resolve to be unbending and your mind focused, I, Tsukumo, will oversee your operations personally!"},{"name":"TSUKUMO","text":"And with that, our team is assembled. Let us set forth and seek out the untold riches of the realm that even the Red Kojin will burn with envy!"},{"name":"SYSTEM","text":"The Blue Kojin have begun making contributions to the treasure vault in Tamamizu."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the Kojin."},{"name":"SYSTEM","text":"Kojin tribal quests are now available from Zukin at Tamamizu."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from Shikitahe."},{"name":"SYSTEM","text":"In order to undertake the next tribal main quest, you must first complete the main scenario quest “A Silence in Three Parts.”"}],"reward":{"gil":940},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[68026]},"next":[68510]},"partials":[{"type":"npc","id":"1024221","obj":{"i":1024221,"n":"Vexed Villager","l":2409,"q":1}},{"type":"npc","id":"1024230","obj":{"i":1024230,"n":"Kabuto","l":2409,"q":1}},{"type":"npc","id":"1024222","obj":{"i":1024222,"n":"Shihoumi","l":2409,"q":1}},{"type":"npc","id":"1024223","obj":{"i":1024223,"n":"Overconfident Kojin","l":2409,"q":1}},{"type":"npc","id":"1024226","obj":{"i":1024226,"n":"Overconfident Kojin","l":2409,"q":1}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}},{"type":"quest","id":"68510","obj":{"i":68510,"n":"Under Wraps","g":50,"l":"The Ruby Sea","s":2,"f":1}}]}