{"quest":{"name":"Echoes of an Echo","location":"The Lochs","id":68502,"patch":4.1,"sort":5,"eventIcon":71201,"issuer":1024125,"target":1024119,"involved":[1020517,1020555,1024113,1024114,1024115,1024116,1024117,1024118,1024120,1024121,1024126,1024127],"genre":7,"journal":["Lyse is lost in thought."],"objectives":["Speak with the Resonatorium guard.","Speak with Raubahn.","Gather information at the Resonatorium.","Report to Raubahn.","Speak with Lyse."],"dialogue":[{"name":"ALPHINAUD","text":"The capacity to experience such visions of the past had always seemed to me to be a most desirable talent, but I see now that it is as much a burden as a blessing."},{"name":"ARENVALD","text":"Sorry about that... I let my emotions get the better of me. It's just that she and I are of an age, and we're neither of us one thing or another... I can't help but feel like she's my problem to solve."},{"name":"CAMPGUARD","text":"（★未使用／削除予定★）"},{"name":"LYSE","text":"I don't know that we solved anything exactly, but we've given Fordola something to think about at least."},{"name":"ARENVALD","text":"Aye... And I've found something new to think about too."},{"name":"ARENVALD","text":"I don't know about you, <span class=\"highlight\">Forename</span>, but the visions only come to me every now and then. From the way Fordola kept wincing, though, I get the feeling she's having them almost all the time. That's a lot of bad memories to deal with..."},{"name":"ALPHINAUD","text":"Hmmm... I wonder... Could there be some fundamental difference between one who is born with the Echo and one who has been artificially imbued with it?"},{"name":"LYSE","text":"Well, the Immortal Flames have been scouring that research facility ever since the liberation. There's a chance they might have some answers for us."},{"name":"LYSE","text":"General Aldynn's there overseeing the investigation. Let's go and pay him a visit, shall we?"},{"name":"RESONATORIUMGUARD","text":"General Aldynn is inside, aye. Will you be joining him?"},{"name":"Q1","text":"Enter the Resonatorium?"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"A1","text":"（★未使用／削除予定★）"},{"name":"ALPHINAUD","text":"Seeing this facility, I am reminded of what they did to Krile..."},{"name":"ARENVALD","text":"Eurgh... They should burn this place to the ground and be done with it..."},{"name":"LYSE","text":"Come on, let's talk to Raubahn."},{"name":"RESONATORIUMGUARD","text":"Will you be going inside, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>?"},{"name":"Q2","text":"（★未使用／削除予定★）"},{"name":"A2","text":"（★未使用／削除予定★）"},{"name":"A2","text":"（★未使用／削除予定★）"},{"name":"RAUBAHN","text":"What news? You spoke with Fordola, I take it?"},{"name":"LYSE","text":"Yes. As expected, she didn't say very much, but it wasn't a <span class=\"emphasis\">total</span> waste of time. Arenvald noticed something odd about her. He thinks she might be having visions almost constantly, which is not how the Echo normally works. Have you found anything here which might explain why it's so different for her?"},{"name":"RAUBAHN","text":"Hmph. We've been hard-pressed just to organize the research materials, let alone study them. To be frank, I'd welcome the Scions' expert assistance, if you have time to lend a hand."},{"name":"ALPHINAUD","text":"（★未使用／削除予定★）"},{"name":"ALPHINAUD","text":"（★未使用／削除予定★）"},{"name":"ALPHINAUD","text":"For a race with no innate capacity to manipulate aether, the Garleans have conducted some exceedingly elaborate aetheric experiments..."},{"name":"ARENVALD","text":"These bastards would fiddle with a man's very soul if it served their purpose. Nothing is sacred to them. Nothing."},{"name":"LYSE","text":"Leave this section to me."},{"name":"RAUBAHN","text":"Bring whatever you discover to me, and I'll put all our findings together."},{"name":"IRONWORKSENGINEER","text":"We received a request from the Alliance to analyze these devices, and I've been recording everything of interest."},{"name":"FLAMEDOCTOR","text":"So many bodies..."},{"name":"SYSTEM","text":"The device in which Krile was held seems even more ominous now you know its purpose. The surrounding pods are marked “Supply Subject” while this one bears the label “Master Subject.”"},{"name":"IRONWORKSENGINEER","text":"The Ironworks received a request from the Alliance to analyze these devices, and I've been recording everything of interest. Did you notice the labeling?"},{"name":"IRONWORKSENGINEER","text":"All the pods are designed to drain the aether of the occupant...save that one right there."},{"name":"IRONWORKSENGINEER","text":"Unlike the others, the interior's been fitted with an array of sensors to measure aetheric wave forms. To what purpose, however, I couldn't tell you."},{"name":"IRONWORKSENGINEER","text":"All the pods are designed to drain the aether of the occupant...save that one right there."},{"name":"IRONWORKSENGINEER","text":"Unlike the others, the interior's been fitted with an array of sensors to measure aetheric wave forms. To what purpose, however, I couldn't tell you."},{"name":"FLAMEDOCTOR","text":"So many bodies... Every one of them a victim of these “experiments.”"},{"name":"FLAMEDOCTOR","text":"Few show any signs of external injury. From what we've been able to determine, they perished from forcible aether extraction. Such a miserable way to die..."},{"name":"FLAMEDOCTOR","text":"We've recovered scores of bodies from those devices. What could possibly justify the deaths of so many...?"},{"name":"SYSTEM","text":"“Idle conversation prohibited.<br>Eating and drinking prohi─”<br>The fallen scrap of parchment appears to list facility regulations, but nothing of any interest."},{"name":"RAUBAHN","text":"I know little and less of science, so any light you can shed on this facility's operations would be much appreciated. <span class=\"highlight\">Forename</span>, shall we start with you?"},{"name":"ALPHINAUD","text":"Taken in combination with the testimonies of Krile and Thancred, I do begin to see exactly what the imperials were attempting here."},{"name":"ALPHINAUD","text":"The enhancement procedure entailed infusing a single candidate with aether siphoned from a multitude of “supply subjects.”"},{"name":"ALPHINAUD","text":"As for the “master subject”─in this case, Krile─the patterns of her aetheric activity would provide the model upon which they would artificially engineer the candidate's aura."},{"name":"LYSE","text":"...In other words, they were trying to recreate Krile's Echo?"},{"name":"ALPHINAUD","text":"I believe so─which would explain our prisoner's present state. Krile is possessed of an unrivaled ability to hear the whispers of the soul, and it seems probable that the procedure engendered the same acute sensitivity in Fordola."},{"name":"LYSE","text":"The soldiers who guard Fordola...many of them lost friends and family to the Skulls."},{"name":"LYSE","text":"And there's a sentry at her door, night and day. If she can't help sensing their thoughts and seeing their past─"},{"name":"ARENVALD","text":"But you don't just <span class=\"emphasis\">see</span> their past─you <span class=\"emphasis\">live</span> it. All the emotions; all the pain. Imagine what it'd do to you. You'd never be the same again."},{"name":"ALPHINAUD","text":"Indeed. As you may recall, Ysayle was completely transformed by a single glimpse of Hraesvelgr's past."},{"name":"ALPHINAUD","text":"Fordola has been forced to experience the agony of those whose lives she destroyed. The guilt must be unbearable."},{"name":"LYSE","text":"That explains her request to be executed..."},{"name":"RAUBAHN","text":"Sounds to me like a kind of justice. Regardless, she can suffer on for now. We have more pressing matters to consider."},{"name":"RAUBAHN","text":"If the results of these experiments have been relayed back to Garlemald, there will be naught to stop the Empire from repeating the trick. They could give the Echo to anyone─to an entire legion."},{"name":"RAUBAHN","text":"We must be ready. We must learn all we can of these godsforsaken procedures─and Fordola remains our best source of information. She'll not be getting her wish. Not yet."},{"name":"LYSE","text":"Right..."},{"name":"RAUBAHN","text":"Keep faith, lass. If you're to convince others to follow you, you must believe what you're telling them. People will respond to passion─but not if it's feigned."},{"name":"LYSE","text":"I understand. Thank you, General."},{"name":"LYSE","text":"We should leave the Flames to it. Let's go."},{"name":"ALPHINAUD","text":"The forcible extraction of aether from a living subject is invariably fatal. How many died that Fordola might gain her new abilities?"},{"name":"ARENVALD","text":"I've never known why I was given the Echo...but this makes me want to put it to good use."},{"name":"LYSE","text":"&lt;sigh&gt; I go looking for answers about the Echo, and end up getting schooled by Raubahn. Yet more evidence that I don't know what I'm doing. It's no wonder people listen to him and not me."},{"name":"ALPHINAUD","text":"General Aldynn is a veteran of countless campaigns, Lyse. You cannot compare yourself to a commander of his experience."},{"name":"LYSE","text":"I know. But I also know that I couldn't have convinced that mob to give up and go home. It makes me realize how much we rely on his authority...and how much I still have to learn."},{"name":"ARENVALD","text":"I wonder what he'll do when everything here is settled... I mean, it's his homeland. After going to the trouble of winning it back, might he not want to stay?"},{"name":"ALPHINAUD","text":"'Tis a quandary which countless refugees now face: to continue the life they built in Ul'dah, or start again in the land of their birth..."},{"name":"PIPIN","text":"<span class=\"highlight\">Forename</span>! A moment!"},{"name":"PIPIN","text":"I am newly returned from Ul'dah, with a message from the sultana."},{"name":"PIPIN","text":"Her Grace desires an audience with you. She understands that you have responsibilities here, but asks that you visit the palace at your earliest convenience."},{"name":"PIPIN","text":"Well, I must away and attend to other business. Until next time, my friends!"},{"name":"ALPHINAUD","text":"An audience with the sultana! Depending on the nature of her consultation, this might be the perfect opportunity to inquire about the General's future plans."},{"name":"LYSE","text":"Yes, we'd all like to know about those, Alphinaud─but not everyone's as comfortable interrogating royalty as you. Take no notice of him, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":898,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68501]},"next":[68503]},"partials":[{"type":"npc","id":"1024125","obj":{"i":1024125,"n":"Lyse","l":2408,"q":1}},{"type":"npc","id":"1024119","obj":{"i":1024119,"n":"Lyse","l":2408,"q":2}},{"type":"npc","id":"1020517","obj":{"i":1020517,"n":"Ironworks Engineer","l":2296,"q":1}},{"type":"npc","id":"1020555","obj":{"i":1020555,"n":"Lyse","l":2296,"q":1}},{"type":"npc","id":"1024113","obj":{"i":1024113,"n":"Resonatorium Guard","l":2408,"q":1}},{"type":"npc","id":"1024114","obj":{"i":1024114,"n":"Raubahn","l":2296,"q":1}},{"type":"npc","id":"1024115","obj":{"i":1024115,"n":"Lyse","l":2296,"q":1}},{"type":"npc","id":"1024116","obj":{"i":1024116,"n":"Alphinaud","l":2296,"q":1}},{"type":"npc","id":"1024117","obj":{"i":1024117,"n":"Arenvald","l":2296,"q":1}},{"type":"npc","id":"1024118","obj":{"i":1024118,"n":"Flame Investigator","l":2296,"q":1}},{"type":"npc","id":"1024120","obj":{"i":1024120,"n":"Alphinaud","l":2408,"q":2}},{"type":"npc","id":"1024121","obj":{"i":1024121,"n":"Arenvald","l":2408,"q":2}},{"type":"npc","id":"1024126","obj":{"i":1024126,"n":"Alphinaud","l":2408,"q":1}},{"type":"npc","id":"1024127","obj":{"i":1024127,"n":"Arenvald","l":2408,"q":1}},{"type":"quest","id":"68501","obj":{"i":68501,"n":"The Butcher's Blood","g":7,"l":"The Lochs","s":4}},{"type":"quest","id":"68503","obj":{"i":68503,"n":"A Sultana's Strings","g":7,"l":"The Lochs","s":6}}]}