{"quest":{"name":"Best Served Foul","location":"The Ruby Sea","id":68515,"patch":4.1,"sort":7,"interval":"daily","repeatable":1,"beast":9,"eventIcon":71222,"issuer":1024217,"target":1024217,"involved":[1024538],"genre":51,"journal":["Zukin is in a stink over an attack on a caravan.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the cranky Kojin on the Isle of Bekko.","Seek out Red Kojin and smear them with golden aspic upon their defeat.","Report to Zukin."],"dialogue":[{"name":"ZUKIN","text":"The Red, <span class=\"highlight\">Forename</span>─they have fallen upon one of our caravans!"},{"name":"ZUKIN","text":"By the grace of the kami, we were able to protect the goods, but the Red brigands remain at large. I need you to join us in hunting them down."},{"name":"ZUKIN","text":"Once you have found and given them a trouncing, smear this all over them. Golden aspic, it is called, and it is made by─actually, 'tis best that you do not know. The point is it smells foul, and will serve to teach the offending Reds a lesson."},{"name":"ZUKIN","text":"Even as we speak, one of our sisters is scouring the Isle of Bekko for them. Seek her out first, and she will tell you more."},{"name":"KOJINFEMALE02979","text":"The Red brigands struck fast, but they fled even faster. If you would search the northern shoreline, I will see to the rest of the isle."},{"name":"KOJINFEMALE02979","text":"And as Zukin will have told you, after you subdue the villains, you are to smear golden aspic all over them. Do not forget this step."},{"name":"BALLOON","text":"D-Damn! Come on, then!"},{"name":"BALLOON","text":"K-Kami have mercy, the stench!"},{"name":"BALLOON","text":"Hmph! And I was so close to the water!"},{"name":"BALLOON","text":"Nooo! A-Anything but that!"},{"name":"BALLOON","text":"Grrr, I'm not finished yet!"},{"name":"BALLOON","text":"What the─ Uhhh... I'm going to be─ Hurrrgh!"},{"name":"ZUKIN","text":"Ah, you are returned. Were you able to find and punish the Red in the manner prescribed?"},{"name":"ZUKIN","text":"Haha, well done, my friend! Our comrades shall be pleased to learn that you have dealt with the brigands!"},{"name":"ZUKIN","text":"The poor sods will reek for a good while, and until such time as the odor fades, they are like to be spurned by their own. A fine lesson, yes?"}],"reward":{"gil":680,"reputation":60,"items":[{"num":15,"id":28},{"id":21081}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024217","obj":{"i":1024217,"n":"Zukin","l":2409,"q":24}},{"type":"npc","id":"1024538","obj":{"i":1024538,"n":"Cranky Kojin","l":2409,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21081","obj":{"i":21081,"n":"Kojin Sango","l":1,"c":65058,"t":100}}]}