{"quest":{"name":"True-blue","location":"The Ruby Sea","id":68514,"patch":4.1,"sort":6,"icon":100733,"beast":9,"unlocksFunction":1,"eventIcon":71341,"issuer":1024220,"target":1019178,"involved":[1024423,1024424,1024425,1024426,1024427,1024428,1024429,1024430],"genre":50,"journal":["Kabuto appears to be in better spirits than when you last met.<br>※The difficulty of this quest will be synced to your current level.","Though Tsukumo is gone, Kabuto has labored tirelessly to carry out the Divine Circle's duty of searching for treasure. So much so, his brothers insist he take a rest. With his newly acquired free time, Kabuto has chosen to visit the various peoples of Othard who made contributions to the treasure vault, and wants you to accompany him. He decides to begin his journey with a visit to Gyokei in Yanxia.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Kabuto is happy to hear that all is well with Gyokei. He grows concerned, however, when mention of Tsukumo is met with a look of bewilderment. In the end, Kabuto surmises his lack of memory stems from the trauma of being attacked by the Red Kojin. He bids Gyokei farewell and makes for the Azim Steppe to meet with Uchikin and his father.","The Qestiri father and son are glad for Kabuto's visit, thanking him again for his help retrieving Uchikin's bow. As he struggles to communicate, Kabuto makes mention of Tsukumo, who was quite adept at interpreting their gestures. Uchikin and his father can only shrug in response. It soon dawns on Kabuto that they too have no recollection of his divine companion. Concerned now that everyone has forgotten Tsukumo, he rushes to Kugane to speak with the one person who is certain to remember him─Shihoumi.","Kabuto is relieved to hear that Shihoumi does, in fact, remember gifting him Tsukumo. His worry returns when it becomes clear she has no memory of the doll ever being animate. The only ones left likely to remember are his fellow Kojin. He returns to Tamamizu to speak with the other members of the Divine Circle, fearful of what they might say.","With his brothers assembled, Kabuto asks them if they remember Tsukumo, the kami that founded the Divine Circle. While they do remember Tsukumo, they are dumbfounded by the claim that a doll was the founder of their order. As far as they can recall, it was Kabuto who brought them together. Kabuto is baffled by the notion and insists it was Tsukumo. Hearing the conviction in his voice, Bunchin is reminded of a similar experience from his past. He relays this story to Kabuto, explaining that Tsukumo's purpose was to guide him on a journey of enlightenment that only he was meant to remember. The once reclusive warrior is now an affable leader, more determined than ever to see his people prosper."],"objectives":["Speak with Gyokei at Yuzuka Manor.","Speak with Uchikin in Reunion.","Speak with Shihoumi in Kugane.","Speak with Bunchin in Tamamizu."],"dialogue":[{"name":"KABUTO","text":"<span class=\"highlight\">Forename</span>. I was hoping you would visit."},{"name":"KABUTO","text":"Things have not been quite the same since we lost Tsukumo, but I've taken his words to heart. My every waking moment has been devoted to seeking treasures for our vault."},{"name":"KABUTO","text":"We've made great progress, but the others insist I take a break if only for a short while."},{"name":"KABUTO","text":"Rather than sit idle here in Tamamizu, I thought my time would be better spent visiting the good people of Othard who made contributions to the treasure vault."},{"name":"KABUTO","text":"It will be a wonderful trip, made all the better by your company. If you would join me, come to Yanxia. I plan to start by paying a visit to Gyokei."},{"name":"KABUTO","text":"It's been too long since I've come to Yanxia. Judging by the lack of birds overhead, he's no longer plagued by that cursed vase."},{"name":"GYOKEI","text":"My, what a surprise. I trust all has been well since your last visit, yes, yes?"},{"name":"KABUTO","text":"Quite well, thank you. Trade with you and the other Namazu has been a boon. I came today to offer you thanks on behalf of the Blue Kojin."},{"name":"GYOKEI","text":"No, no, it is I who should be thanking you. Once more I can enjoy sunny days and blue skies clear of birds and their unsavory gifts. Yes, yes, life has never been better."},{"name":"KABUTO","text":"Ah, so the curse was lifted as Tsukumo predicted. A pity he could not come with us to hear the good news."},{"name":"GYOKEI","text":"Tsukumo? Who is that? It sounds more like a flavorful dish than a person."},{"name":"KABUTO","text":"Come now, Gyokei. Surely you remember the talking doll that accompanied me when we first met?"},{"name":"GYOKEI","text":"What a silly, silly Kojin you are. As if I would forget something so remarkable as that. There was no such thing present when I met the two of you, no, no."},{"name":"KABUTO","text":"What in the kami's name is going on?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Perhaps the stress of that day affected his memory."},{"name":"A1","text":"..."},{"name":"KABUTO","text":"I suppose that's possible. It's not uncommon for one's memory to become hazy when thinking back on traumatic experiences. "},{"name":"KABUTO","text":"I suppose being attacked by Hirumaki was a rather traumatic experience. Perhaps the stress of it all has affected his memory."},{"name":"KABUTO","text":"When a foe is truly formidable, even I cannot clearly recall what happened when we exchanged blows."},{"name":"KABUTO","text":"At any rate, it would be unkind to make him relive his meeting with the Red."},{"name":"KABUTO","text":"We won't keep you any longer, Gyokei. Take care, and may the blessings of the kami be upon you."},{"name":"GYOKEI","text":"Farewell, my friends. Next time I will go to visit you in Tamamizu, yes, yes."},{"name":"KABUTO","text":"What say we visit Reunion next? Uchikin is likely a master of marksmanship by now."},{"name":"GYOKEI","text":"If you happen to come across that talking doll Kabuto spoke of, I would like to see it very, very much."},{"name":"KABUTO","text":"The road to the Azim Steppe was longer than I thought. I can scarcely believe Makura traveled all this way before our battle on the Isle of Zekki."},{"name":"UCHIKINPAPA","text":"..."},{"name":"SYSTEM","text":"Uchikin's father welcomes you with a warm smile. He seems quite glad for your visit."},{"name":"UCHIKIN","text":"..."},{"name":"KABUTO","text":"It is good to see you both. Talk of your prowess is still hot on the lips of every merchant in Reunion. Your father must be proud."},{"name":"UCHIKIN","text":"..."},{"name":"KABUTO","text":"Please, there is no need to thank us. No, it is I who should be thanking you. If not for your generosity, we never would have had the means to rescue our dear Tsukumo from the Red Kojin."},{"name":"KABUTO","text":"That...was a bow to thank us, yes? Would that Tsukumo were here. He was quite adept at interpreting your expressions."},{"name":"UCHIKIN","text":"..."},{"name":"KABUTO","text":"Does that mean you don't remember Tsukumo? A talking doll no higher than my knee, in the likeness of a Kojin?"},{"name":"UCHIKIN","text":"..."},{"name":"KABUTO","text":"First Gyokei and now these two. I don't know what's going on here but it can't be good."},{"name":"KABUTO","text":"Perhaps we should go and visit Shihoumi. Surely she of all people would remember Tsukumo."},{"name":"KABUTO","text":"Thank you for your time, but we must be leaving. Blessings of the kami be upon you."},{"name":"UCHIKIN","text":"..."},{"name":"UCHIKIN000","text":"..."},{"name":"SYSTEM","text":"Uchikin seems very apologetic. Unable to recall Tsukumo, perhaps he believes he has given offense."},{"name":"UCHIKINPAPA","text":"..."},{"name":"SYSTEM","text":"Uchikin's father gestures enthusiastically, as if to wish you safe travels."},{"name":"KABUTO","text":"Shihoumi was the one who offered me Tsukumo as a gift. That she could forget him is unthinkable."},{"name":"SHIHOUMI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Good morning</span><span class=\"alternative\">Good day to you</span></span>, <span class=\"highlight\">Forename</span>. Kabuto. To what do I owe the pleasure of this visit?"},{"name":"KABUTO","text":"I realize this is sudden, but... Do you recognize the jewel on my helmet?"},{"name":"SHIHOUMI","text":"Of course. I was the one who set it for you."},{"name":"KABUTO","text":"Oh, thank the kami! Then you also remember Tsukumo, the doll from whence it came?"},{"name":"SHIHOUMI","text":"You mean the karakuri puppet I gave you as a gift for rescuing me?"},{"name":"KABUTO","text":"The very same."},{"name":"SHIHOUMI","text":"Yes, I remember. It was so old and worn. I was honestly quite surprised you were so taken with it. The way you would clutch it in your arms, and you named it Tsukumo. I thought it was quite touching."},{"name":"SHIHOUMI","text":"Though I must say, it was quite peculiar to see materia produced from a doll. It usually comes from arms or armor after a great deal of use."},{"name":"KABUTO","text":"But you claimed this is what brought Tsukumo to life!"},{"name":"SHIHOUMI","text":"What? I said no such thing. I know not whose spirit gave form to that materia, but I fear affixing it to your helmet has clouded your memory."},{"name":"KABUTO","text":"No! Tsukumo was alive, I tell you! He was always there to say what I could not, and he helped me establish relations with a great many people. "},{"name":"SHIHOUMI","text":"I'm sorry, Kabuto. I do not question this puppet meant a great deal to you, but if it truly was able to walk or talk, I was not witness to it."},{"name":"KABUTO","text":"Have I gone mad, <span class=\"highlight\">Forename</span>? How can no one remember? After everything we've accomplished."},{"name":"KABUTO","text":"Do you suppose my brothers have forgotten him as well? No one has spoken of Tsukumo since the battle on the Isle of Zekki, but I'm beginning to suspect it's not to save me grief."},{"name":"KABUTO","text":"Sorry to have troubled you. I only meant to come and give thanks for the puppet and your wonderful work on my helmet. Take care, Shihoumi."},{"name":"SHIHOUMI","text":"I pray the kami guide you to the answers you seek."},{"name":"KABUTO","text":"Let us return to Tamamizu. I would have a word with the elder."},{"name":"SHIHOUMI","text":"There must be something special about that puppet to excite Kabuto so. If only I could remember what..."},{"name":"KABUTO","text":"The mere thought of my brothers forgetting Tsukumo is too much to bear."},{"name":"BUNCHIN","text":"What brings the two of you here? By all rights you should be resting, Kabuto."},{"name":"KABUTO","text":"A question has been weighing on my mind for some time now, and...well..."},{"name":"MAKURA","text":"There you are! I've assembled the Divine Circle as you asked. What is it you wished to discuss?"},{"name":"KABUTO","text":"Thank you all for coming. No one has spoken of him since he was lost to us, but I wished to speak with you all about Tsukumo."},{"name":"BUNCHIN","text":"Tsukumo...? Ah, do you mean the puppet you enshrined in the treasure vault?"},{"name":"KABUTO","text":"So you do remember! I was beginning to fear everyone had forgotten the founder of our fellowship."},{"name":"BUNCHIN","text":"What are you saying, Kabuto? It was you who formed the Divine Circle."},{"name":"KABUTO","text":"No... No, it was Tsukumo. Why can none of you remember?"},{"name":"KABUTO","text":"I didn't think to ask, seeing as you accompanied me on my travels about Othard, but now I fear I must."},{"name":"KABUTO","text":"Tell me true, <span class=\"highlight\">Forename</span>─do you remember Tsukumo?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Of course I remember."},{"name":"A2","text":"I'm sorry, but I don't."},{"name":"KABUTO","text":"Oh, what a relief. I thought I was losing my mind."},{"name":"BUNCHIN","text":"Curious that only the two of you can recall Tsukumo as more than a mere doll."},{"name":"BUNCHIN","text":"But perhaps this is not without reason. I believe the kami was meant to guide you on a journey of enlightenment. A journey only you were meant to remember."},{"name":"BUNCHIN","text":"Yet it seems our friend <span class=\"highlight\">Forename</span> here possesses a rare gift, one that allows <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to recall that which others cannot. "},{"name":"KABUTO","text":"That can't be! I've seen him speak with you. With all of you."},{"name":"BUNCHIN","text":"Curious that only you can recall Tsukumo as more than a mere doll."},{"name":"BUNCHIN","text":"But perhaps this is not without reason. I believe this spirit was meant to guide you on a journey of enlightenment. A journey only you were meant to remember."},{"name":"KABUTO","text":"You needn't mince words, Elder. You think this all a figment of my imagination, don't you?"},{"name":"BUNCHIN","text":"Not at all. In fact, I had a similar experience many years ago. At the time I assumed no one would believe me, and so I have kept it to myself all this time."},{"name":"BUNCHIN","text":"There are myriad kami in this world, each with their own will, their own purpose. In the end, it would seem this kami was meant not for the Divine Circle, but for you."},{"name":"MAKURA","text":"I would be lying if I said I wasn't jealous. Oh, what I wouldn't give for such divine guidance. "},{"name":"BUNCHIN","text":"This is not the time for envy, Makura, but praise. The kami saw fit to make Kabuto a fine leader, and the Blue have gained new allies because of it."},{"name":"KABUTO","text":"Truth be told, I can scarcely believe how far I've come. Looking back I can see how foolish I was to think protecting my brothers meant having to push them away."},{"name":"KABUTO","text":"Tsukumo taught me the bonds we share are worth more than any treasure."},{"name":"BUNCHIN","text":"Heed well the lessons you have learned here, Kabuto. I sense the path before you leads to a great many things. "},{"name":"KABUTO","text":"Wherever the path may lead, we will walk it together. It's what Tsukumo would have wanted."},{"name":"KABUTO","text":"Our quest for treasure begins anew. For the Blue!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Bloodsworn</span> reputation with the Kojin."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon completion of the Kojin tribal daily quests."}],"reward":{"gil":1950},"reqs":{"beastrank":7,"jobs":[{"lvl":60,"id":34}],"quests":[68513]},"next":[68697]},"partials":[{"type":"npc","id":"1024220","obj":{"i":1024220,"n":"Kabuto","l":2409,"q":1}},{"type":"npc","id":"1019178","obj":{"i":1019178,"n":"Bunchin","l":2409,"q":10}},{"type":"npc","id":"1024423","obj":{"i":1024423,"n":"Gyokei","l":2410,"q":1}},{"type":"npc","id":"1024424","obj":{"i":1024424,"n":"Kabuto","l":2410,"q":1}},{"type":"npc","id":"1024425","obj":{"i":1024425,"n":"Uchikin","l":2411,"q":1}},{"type":"npc","id":"1024426","obj":{"i":1024426,"n":"Uchikin's Father","l":2411,"q":1}},{"type":"npc","id":"1024427","obj":{"i":1024427,"n":"Kabuto","l":2411,"q":1}},{"type":"npc","id":"1024428","obj":{"i":1024428,"n":"Shihoumi","l":2404,"q":1}},{"type":"npc","id":"1024429","obj":{"i":1024429,"n":"Kabuto","l":2404,"q":1}},{"type":"npc","id":"1024430","obj":{"i":1024430,"n":"Kabuto","l":2409,"q":1}},{"type":"quest","id":"68513","obj":{"i":68513,"n":"A Test of Courage","g":50,"l":"The Ruby Sea","s":5,"f":1}},{"type":"quest","id":"68697","obj":{"i":68697,"n":"The Ananta Maid's Tail","g":64,"l":"Kugane","s":1}}]}