{"quest":{"name":"Krilled to Pieces","location":"The Ruby Sea","id":68518,"patch":4.1,"sort":10,"interval":"daily","repeatable":1,"beast":9,"eventIcon":71222,"issuer":1024217,"target":1024217,"involved":[1024218],"genre":51,"journal":["A happy ray is a productive ray, as Zukin well knows.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Makura.","Feed the striped ray at krill swarms by using its Inhale ability.","Report to Zukin."],"dialogue":[{"name":"ZUKIN","text":"Fancy going for a little swim, <span class=\"highlight\">Forename</span>? If you have a moment to spare, Makura could use your help with the rays. They look after us, and so we must look after them."},{"name":"MAKURA","text":"Ah, <span class=\"highlight\">Forename</span>, I've been waiting for you. I need you to take one of our rays out for a good feed─a reward for all of its toils."},{"name":"MAKURA","text":"Now, the fellow loves few things more than krill, and you'll find swarms of them close by. Please have him feed till he's had his fill."},{"name":"MAKURA","text":"Should you become separated from the ray, worry not─he is trained to return here. Happy feeding, then, and let Zukin know when you're done!"},{"name":"SYSTEM","text":"The ray sucks in a copious amount of seawater and krill."},{"name":"SYSTEM","text":"The ray sucks in a copious amount of seawater and krill."},{"name":"SYSTEM","text":"The ray sucks in a copious amount of seawater and krill."},{"name":"MAKURA","text":"There you are! The ray returned without you, and he's been champing at the bit to get back to his krill."},{"name":"SYSTEM","text":"There is a large swarm of krill. You make a mental note of the spot for feeding the ray."},{"name":"ZUKIN","text":"Welcome back, <span class=\"highlight\">Forename</span>. I understand you treated the ray to a veritable banquet. This will doubtless do wonders for its spirit."},{"name":"ZUKIN","text":"Makura tells me the creature is very fond of you, and who could blame it? When next it needs a good feed, I trust we can rely on you again."},{"name":"MAKURA","text":"Our little ray returned with a belly full of krill and a grin from gill to gill! Thank you so much, <span class=\"highlight\">Forename</span>!"}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21081}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024217","obj":{"i":1024217,"n":"Zukin","l":2409,"q":24}},{"type":"npc","id":"1024218","obj":{"i":1024218,"n":"Makura","l":2409,"q":3}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21081","obj":{"i":21081,"n":"Kojin Sango","l":1,"c":65058,"t":100}}]}