{"quest":{"name":"Misdelivered","location":"The Ruby Sea","id":68512,"patch":4.1,"sort":4,"icon":100731,"beast":9,"unlocksFunction":1,"eventIcon":71341,"issuer":1024215,"target":1024215,"involved":[1024260,1024261,1024262,1024263,1024264,1024267,1024620],"genre":50,"journal":["Kabuto has been working himself up to ask you something.<br>※The difficulty of this quest will be synced to your current level.","Kabuto recently acquired a suit of armor which he has sent to Kugane for repairs. Fearful the Red Kojin may attempt to steal it, he asks you to accompany him to see it safely returned to Tamamizu. No sooner do you nod in consent than he sets off for the forge in Kugane.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","The two of you are both surprised and delighted to see Shihoumi is the smith entrusted with repairing the armor. Kabuto's cheerful demeanour soon sours, however, when she tells him the armor has been delivered to Hells' Lid. It is just as he feared─a plot by the Red Kojin to steal his treasure. Leaving Tsukumo in her care, he rushes off to Hells' Lid.","You find a cowering courier surrounded by a band of Red Kojin. After quickly disposing of them, you check to see if he is unharmed.","The courier leaves after a quick show of thanks for fear of another attack. As if in response to his worry, Hirumaki appears on a nearby ridge. He claims to have kidnapped Tsukumo, and demands the Blue Kojin pledge their services to the Red Kojin in exchange for his safe return. What, then, has become of Shihoumi? Kabuto asks you to return to Kugane and find out.","You arrive to find Shihoumi is safe, but Tsukumo's absence confirms Hirumaki's boasts were true. She blames herself for what has happened, pledging to help with Tsukumo's rescue in any way she can. Kabuto thanks her for her generosity, then invites you back to Tamamizu.","You begin talks with Kabuto when Bunchin approaches, furious at the news that Tsukumo has been taken. He quickly dismisses Kabuto's shortsighted plans of sneaking onto the Isle of Zekki, and insists he speak with all of the Blue Kojin and rally them together in preparation for battle."],"objectives":["Speak with Kabuto in Kugane.","Search for the cowering courier at Hells' Lid in the Ruby Sea.","Aid the cowering courier.","Speak with Shihoumi in Kugane.","Speak with Kabuto in Tamamizu."],"dialogue":[{"name":"KABUTO","text":"<span class=\"highlight\">Forename</span>. Might I ask a favor of you?"},{"name":"KABUTO","text":"I recently acquired a suit of armor. It was heavily worn and thus required repairs. I have entrusted a smith in Kugane with its restoration."},{"name":"KABUTO","text":"I would go alone to retrieve it, but I worry about the voyage. Twice now the Red Kojin have interfered in our plans."},{"name":"KABUTO","text":"I fear they will strike again."},{"name":"TSUKUMO","text":"If they do, he nEeDs YoUr HeLp."},{"name":"KABUTO","text":"&lt;sigh&gt; His condition has yet to improve, but we can discuss that later. Come, let us make for Kugane."},{"name":"TSUKUMO","text":"Good, yOu ArE hErE."},{"name":"SHIHOUMI","text":"<span class=\"highlight\">Forename</span>! It's so good see you. Thank you again for your help in the Ruby Sea."},{"name":"KABUTO","text":"Good, you're here. It would seem the forge has entrusted Shihoumi with my armor. A curious twist of fate, no?"},{"name":"SHIHOUMI","text":"<span class=\"highlight\">Forename</span>! My, what a pleasant surprise. It's so good to see you again."},{"name":"TSUKUMO","text":"And a pleasure to sEe YoU aGaIn aS wElL."},{"name":"SHIHOUMI","text":"Oh my word! It talked!"},{"name":"TSUKUMO","text":"Ah, of course. We have not been pRoPeRlY iNtRoDuCeD. I am TsUkUmO, a kami called forth from the tReAsUrE vAuLt In TaMaMiZu."},{"name":"SHIHOUMI","text":"I have read everything I could about the Kojin and their beliefs since we parted ways. The texts spoke of kami that inhabit the treasures in their keep, but I never imagined them to be real."},{"name":"TSUKUMO","text":"Well, as you can see, they are mOrE tHaN mErE sToRiEs... Ahem. But that is not why we are here. We've come to InQuIrE aBoUt ThE aRmOr We EnTrUsTeD tO yOu FoR rEpAiRs."},{"name":"SHIHOUMI","text":"Yes, of course. As a fledgling craftsman I pour my heart into all my work, and this armor was no exception. But I've already delivered it to Hells' Lid as instructed in your letter."},{"name":"KABUTO","text":"Letter!? We sent no letter... This must be the work of the Red Kojin!"},{"name":"SHIHOUMI","text":"Oh no! Is there anything we can do?"},{"name":"TSUKUMO","text":"No need to fear. We NeEd OnLy StOp ThEm BeFoRe ThEy─"},{"name":"SHIHOUMI","text":"Oh dear. He seems to have stopped."},{"name":"TSUKUMO","text":"MuSt... ReTrIeVe... ArMoR..."},{"name":"SHIHOUMI","text":"Hmmm. Has Tsukumo always behaved so strangely?"},{"name":"KABUTO","text":"Only for the past few moons. Do you think you can fix him? I would rather he stay with you when <span class=\"highlight\">Forename</span> and I face the Red Kojin."},{"name":"TSUKUMO","text":"YoU...uNgRaTeFuL..."},{"name":"KABUTO","text":"To face them is to face death. You would only slow us down."},{"name":"TSUKUMO","text":"ArRoGaNt...ThIcK-sHeLlEd..."},{"name":"SHIHOUMI","text":"Please, calm yourself, Tsukumo. Kabuto means only to keep you from harm. By the time he returns, I promise you will be good as new."},{"name":"KABUTO","text":"Come, <span class=\"highlight\">Forename</span>. We must hurry to Hells' Lid and intercept the delivery before it reaches the Red. "},{"name":"TSUKUMO","text":"I'm...FiNe..."},{"name":"SHIHOUMI","text":"Please take care out there. I will do my best to have Tsukumo repaired by the time you return."},{"name":"BALLOON","text":"Reinforcements!?"},{"name":"BALLOON","text":"Surrender the armor!"},{"name":"KABUTO","text":"My apologies. I shouldn't have rushed ahead."},{"name":"COURIER02976","text":"Thank the gods you came when you did. Those red-shelled bastards nearly made off with this here package."},{"name":"KABUTO","text":"I'm afraid this delivery was a trap of their creation. This armor is mine, you see, and I made no request to have it delivered. Only to have it repaired by the armorer in Kugane."},{"name":"KABUTO","text":"But as it is here, and repairs are complete, I would be more than happy to relieve you of your duty."},{"name":"COURIER02976","text":"You're kidding? Well, if it means I don't have to lug this crate back, by all means. I wouldn't stay around here long, though; those Red Kojin could show up again at any moment."},{"name":"KABUTO","text":"For a blessing we have foiled their plans, and the courier was unharmed."},{"name":"KABUTO","text":"Still, I find it strange the Red Kojin knew of this armor."},{"name":"HIRUMAKI","text":"(-Dreadfully Familiar Voice-)Incompetent, the lot of them. I suppose I'll have to handle this myself."},{"name":"HIRUMAKI","text":"Well, well, if it isn't the cowardly Kojin from Yanxia. Have you come to beg, then?"},{"name":"KABUTO","text":"You cannot have this armor, Hirumaki─it belongs to the Blue!"},{"name":"HIRUMAKI","text":"Hmph. Why would I concern myself with that pile of scrap when you've already given us so much?"},{"name":"SYAGI","text":"Defeating you here and taking it would have been simple enough. We never dreamed you would leave it in Kugane for us."},{"name":"HIRUMAKI","text":"Yes, truly a gift of the divine."},{"name":"KABUTO","text":"Tsukumo? But how!?"},{"name":"HIRUMAKI","text":"If you would have the doll returned, the Blue Kojin <span class=\"emphasis\">will</span> serve. Your obedience may even grant you access to the vault."},{"name":"KABUTO","text":"You would have us debase ourselves for you? Barter with blood and blade as you do? Never!"},{"name":"SYAGI","text":"I suppose you mean to take this back with a fair trade? Hah! Your pretty words will buy naught but a quick death."},{"name":"HIRUMAKI","text":"We will be waiting for you on the Isle of Zekki. Come to serve, or to die. The choice is yours."},{"name":"KABUTO","text":"The Red often deal in lies and deception. That vase was likely empty. But if what they say is true, Shihoumi may have come to harm."},{"name":"KABUTO","text":"Would you go and check on her? I will deliver this armor home, then see to the truth of Hirumaki's threats."},{"name":"KABUTO","text":"Don't worry about me. Shihoumi's safety must come first."},{"name":"SHIHOUMI","text":"Oh <span class=\"highlight\">Forename</span>. If only you had returned sooner."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"So it's true, then? The Red Kojin have Tsukumo?"},{"name":"A1","text":"Are you hurt?"},{"name":"SHIHOUMI","text":"I am afraid so. They came not long after you left. There was nothing I could do."},{"name":"SHIHOUMI","text":"I'm fine, thank you, but..."},{"name":"SHIHOUMI","text":"Shortly after you left the Red Kojin came and took Tsukumo. There was nothing I could do."},{"name":"SHIHOUMI","text":"I know how much it meant to Kabuto, and yet I failed him when he needed me most."},{"name":"KABUTO","text":"(-Familiar Voice-)You needn't worry. All that matters is you are safe. What's more, we recovered the armor."},{"name":"SHIHOUMI","text":"Kabuto! I'm sorry to have caused you so much worry. Were you able to save Tsukumo?"},{"name":"KABUTO","text":"Unfortunately, no. Hirumaki's forces overwhelmed me as he made his escape."},{"name":"KABUTO","text":"But we know where they are keeping him. I promise you: we will get him back."},{"name":"SHIHOUMI","text":"If you would stand against them, I will furnish you with any arms and armor you require. It's the least I can do."},{"name":"KABUTO","text":"I would be honored, as would my brothers if you would have the Blue Kojin as patrons henceforth."},{"name":"SHIHOUMI","text":"Yes, of course! I only wish I was able to repair poor Tsukumo. When he is safely returned, I promise to do all I can to fix him."},{"name":"KABUTO","text":"Thank you, Shihoumi."},{"name":"KABUTO","text":"<span class=\"highlight\">Forename</span>, meet me in Tamamizu. I would discuss strategy with you."},{"name":"SHIHOUMI","text":"I pray the kami see Tsukumo back to you safely."},{"name":"KABUTO","text":"I told Shihoumi what she needed to hear, but I know you understand the hardships before us."},{"name":"KABUTO","text":"My people know little of the ways of war, and our numbers are few. Failure is assured if we face the Red head-on."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"We at least have to try."},{"name":"A2","text":"Hirumaki must pay for what he's done."},{"name":"KABUTO","text":"Easier said than done, my friend."},{"name":"BUNCHIN","text":"(-Angry Voice-)Kabuto! I heard from the others. How could you let them take Tsukumo away from you!?"},{"name":"KABUTO","text":"Elder! We were just planning a strategy to rescue him. I thought it best if <span class=\"highlight\">Forename</span> and I sneak in and─"},{"name":"BUNCHIN","text":"And say nothing to the rest of the Divine Circle? To those who look to you for guidance?"},{"name":"KABUTO","text":"Well, I..."},{"name":"BUNCHIN","text":"Now is not the time for false bravado. If you would go to the Isle of Zekki and face the Red, you will not do so alone."},{"name":"BUNCHIN","text":"You must speak with the Divine Circle─no, with all of the Blue. Sound a call to arms, and lead them into battle."},{"name":"KABUTO","text":"Lead the Blue to battle?"},{"name":"KABUTO","text":"If that is the elder's wish, then I fear I have no other choice."},{"name":"SYSTEM","text":"The forge in Kugane has accepted the Blue Kojin as patrons, and has repaired the armor that now rests in the treasure vault."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Honored</span> reputation with the Kojin."},{"name":"SYSTEM","text":"New Kojin tribal daily quests are now available from Zukin at Tamamizu."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Zukin as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Zukin. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Shikitahe."}],"reward":{"gil":2272},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}],"quests":[68511]},"next":[68513]},"partials":[{"type":"npc","id":"1024215","obj":{"i":1024215,"n":"Kabuto","l":2409,"q":4}},{"type":"npc","id":"1024260","obj":{"i":1024260,"n":"Kabuto","l":2404,"q":1}},{"type":"npc","id":"1024261","obj":{"i":1024261,"n":"Shihoumi","l":2404,"q":1}},{"type":"npc","id":"1024262","obj":{"i":1024262,"n":"Tsukumo","l":2404,"q":1}},{"type":"npc","id":"1024263","obj":{"i":1024263,"n":"Kabuto","l":2409,"q":1}},{"type":"npc","id":"1024264","obj":{"i":1024264,"n":"Cowering Courier","l":2409,"q":1}},{"type":"npc","id":"1024267","obj":{"i":1024267,"n":"Shihoumi","l":2404,"q":1}},{"type":"npc","id":"1024620","obj":{"i":1024620,"n":"Kabuto","l":2409,"q":1}},{"type":"quest","id":"68511","obj":{"i":68511,"n":"The Value of Silence","g":50,"l":"The Ruby Sea","s":3,"f":1}},{"type":"quest","id":"68513","obj":{"i":68513,"n":"A Test of Courage","g":50,"l":"The Ruby Sea","s":5,"f":1}}]}