{"quest":{"name":"Tonight We Dine in Shells","location":"The Ruby Sea","id":68519,"patch":4.1,"sort":11,"interval":"daily","repeatable":1,"beast":9,"eventIcon":71222,"issuer":1024217,"target":1024217,"genre":51,"journal":["Zukin needs help putting together a feast.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Lure out voracious gasame with oyster meat at Hells' Lid and slay them for their red-hot carapaces.","Deliver the red-hot carapaces to Zukin."],"dialogue":[{"name":"ZUKIN","text":"As you will doubtless appreciate, treasure hunting is hungry work. To help us keep up our strength, Kaioke will cook a hearty meal, and for this he requires several red-hot carapaces."},{"name":"ZUKIN","text":"If each one of us could procure but two, we will have enough in no time. Here, take this oyster meat. You can use it to lure out voracious gasame at Hells' Lid."},{"name":"ZUKIN","text":"Other gasame may well be drawn to the bait, but not all will yield the carapace we need. Take care, and good luck!"},{"name":"ZUKIN","text":"Ah, you are returned. Have you obtained your share of carapaces?"},{"name":"ZUKIN","text":"Oho, such big, fiery shells! This shall be a proper feast!"},{"name":"ZUKIN","text":"Turn these over and fill them with ingredients, and in no time we'll have a tasty and nourishing gasame stew! Ahhh, the mere thought of it makes my mouth flood..."},{"name":"ZUKIN","text":"You will enjoy it, too, I do not doubt. But as popular as it is, you must forgive us should it run out before you get a taste!"}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21081}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024217","obj":{"i":1024217,"n":"Zukin","l":2409,"q":24}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21081","obj":{"i":21081,"n":"Kojin Sango","l":1,"c":65058,"t":100}}]}