{"quest":{"name":"A Real Pearler","location":"The Ruby Sea","id":68516,"patch":4.1,"sort":8,"interval":"daily","repeatable":1,"beast":9,"eventIcon":71222,"issuer":1024217,"target":1024217,"involved":[1024460],"genre":51,"journal":["Zukin needs pearls, and he needs them now.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Harvest pearls from pearl oysters.","Deliver pearls to the East Aldenard Trading Company associate at the Ruby Price.","Deliver the payment to Zukin."],"dialogue":[{"name":"ZUKIN","text":"<span class=\"highlight\">Forename</span>, we've received an urgent order of pearls from the East Aldenard Trading Company! There's no time to waste─you must go and harvest them at once. I shall mark the location on your map."},{"name":"ZUKIN","text":"Ah, but before you strike out, there is an important rule you must observe. To preserve the natural order, the elder has decreed that no more than three oysters may be prised open in a single harvest. That is to say, choose well."},{"name":"ZUKIN","text":"Once you have three pearls, pray bear them directly to the Ruby Price, where the company's associate awaits. The kami speed your way, my friend!"},{"name":"MERCHANT02980","text":"You are come from the Kojin, you say? Dare I hope you have the pearls? Our client is in considerable haste..."},{"name":"MERCHANT02980","text":"Well, what delightful little pearls, small yet captivating! Yes, I believe they shall make a most elegant ring! Phew, this should serve to satisfy the mistress..."},{"name":"MERCHANT02980","text":"Why, these are paragons among pearls, such as might be described in tomes! Yes, they shall make a fetching set of earrings! Phew, this should serve to satisfy the mistress..."},{"name":"MERCHANT02980","text":"By the gods, never have I laid eyes upon such enormous pearls! Oh, I can picture it now, the centerpiece for a sumptuous choker that shall be the talk of the town... The mistress shall doubtless be pleased!"},{"name":"MERCHANT02980","text":"Lest you wonder, the order comes from an Ishgardian noblewoman, a regular client of ours. She requested an adornment, specifying that it must feature the finest pearls...and that it must be ready on the morrow."},{"name":"MERCHANT02980","text":"As much as we appreciate her custom, did she not stop to consider that her request might be unreasonable? ...Ack, I shouldn't be complaining openly. Please forget I said any of this."},{"name":"MERCHANT02980","text":"On behalf of the East Aldenard Trading Company, I give you my profuse thanks. Here is your payment, with a little extra for your troubles. The company is fortunate to have dependable suppliers such as you and yours."},{"name":"MERCHANT02980","text":"My thanks again, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. The company is fortunate to have dependable suppliers such as you and yours."},{"name":"ZUKIN","text":"I've awaited your return, <span class=\"highlight\">Forename</span>. Were you able to make the delivery in a timely fashion?"},{"name":"ZUKIN","text":"...So that was the way of it. We can choose our friends, but not our customers. Such is business. At any rate, we fulfilled our obligation and were duly compensated. And we have you to thank for it."},{"name":"ZUKIN","text":"In case you weren't aware, 'tis no easy thing to harvest fine pearls. Yet by your account, you did so quite effortlessly."},{"name":"ZUKIN","text":"Pearls are a gift from the kami, and this is proof that they favor you. When next we receive an order for pearls, I know to whom I shall turn!"}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21081}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024217","obj":{"i":1024217,"n":"Zukin","l":2409,"q":24}},{"type":"npc","id":"1024460","obj":{"i":1024460,"n":"East Aldenard Trading Company Associate","l":2409,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21081","obj":{"i":21081,"n":"Kojin Sango","l":1,"c":65058,"t":100}}]}