{"quest":{"name":"Confused Courier","location":"The Ruby Sea","id":68523,"patch":4.1,"sort":15,"interval":"daily","repeatable":1,"beast":9,"eventIcon":71222,"issuer":1024217,"target":1024217,"involved":[1024300,1024301,1024303,1024305],"genre":51,"journal":["One of the elders has been gone a long time.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the wizened Kojin.","Deliver the jars of lotion to the long-haired pirates.","Report to Zukin."],"dialogue":[{"name":"ZUKIN","text":"<span class=\"highlight\">Forename</span>, would you be able to assist one of the village elders? He swam all the way to Onokoro to trade with the locals, but he has been getting somewhat forgetful lately."},{"name":"ZUKIN","text":"Although we are on good terms with the local pirates, there may be some who would take advantage of him. I would be grateful if you could assist him in his duties."},{"name":"OLDTURTLE02987","text":"Good day to you, most valued of customers! I have brought your order, as instructed."},{"name":"OLDTURTLE02987","text":"Kami strike me down! Are you not the one awaiting delivery? Please forgive me─I fear my eyesight is beginning to fail me."},{"name":"OLDTURTLE02987","text":"Mean you to say that you will deliver these jars in my stead? Truth be told, I feel like I have been wandering around in circles trying to find my clients."},{"name":"OLDTURTLE02987","text":"I remember that they both have flowing, shimmering hair, but their names escape me. I shall return to Tamamizu forthwith, and let the others know that you have offered to help."},{"name":"OKMID2987","text":"Good day to you! So you've come in place of the usual bloke to deliver my order, have you?"},{"name":"OKMID2987","text":"I've been waiting for this! It's a special lotion that takes the edge off the blazing sunshine. You see, in the mountains where I grew up, we're not used to having the sun beating down on us all day."},{"name":"OKMID2987","text":"Without this I'd end up all red and crispy, like a boiled coralshell! Be sure to let the folk back in Tamamizu know this stuff works wonders!"},{"name":"OKAURA2987","text":"Is that my order? Oh, so you're the one doing the deliveries today?"},{"name":"OKAURA2987","text":"Have you seen this before? It's a traditional Kojin remedy for jellyfish stings, but it works just as well on you and me. Nowadays, we don't go fishing without it."},{"name":"OKAURA2987","text":"Could you pass on my regards to the merchant? I know he's getting on a bit, but I hope he's well enough to carry on with his usual rounds."},{"name":"OKRUGA2987","text":"What's this? My order from Tamamizu? Not who I was expecting, but I'll be glad to get it all the same."},{"name":"OKRUGA2987","text":"Yes, yes! My luscious locks have been crying out for this miraculous formula! Rubbing a dollop of this into my hair gives it the most wonderful shine."},{"name":"OKRUGA2987","text":"You know, I thought it would never arrive. Has that doddery old salesman fallen on his back and can't get up? Send him my thanks, would you?"},{"name":"ZUKIN","text":"Oh, back so soon? And you found the customers, you say? I am glad the delivery was successful, even if it did require considerable intervention on your part."},{"name":"ZUKIN","text":"Our elderly entrepreneur wanted to express his gratitude, but has already sped off on another pressing engagement. I hope I am that sprightly when I reach his age!"}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21081}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024217","obj":{"i":1024217,"n":"Zukin","l":2409,"q":24}},{"type":"npc","id":"1024300","obj":{"i":1024300,"n":"Wizened Kojin","l":2409,"q":1}},{"type":"npc","id":"1024301","obj":{"i":1024301,"n":"Long-haired Pirate","l":2409,"q":1}},{"type":"npc","id":"1024303","obj":{"i":1024303,"n":"Long-haired Pirate","l":2409,"q":1}},{"type":"npc","id":"1024305","obj":{"i":1024305,"n":"Long-haired Pirate","l":2409,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21081","obj":{"i":21081,"n":"Kojin Sango","l":1,"c":65058,"t":100}}]}