{"quest":{"name":"Pickles of Partnership","location":"The Ruby Sea","id":68520,"patch":4.1,"sort":12,"interval":"daily","repeatable":1,"beast":9,"eventIcon":71222,"issuer":1024217,"target":1024217,"involved":[1019249,1024348,1024420],"genre":51,"journal":["Zukin knows the way to a Confederate's heart.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Deliver the Kojin pickles to Confederates at the Coral Banquet.","Report to Zukin."],"dialogue":[{"name":"ZUKIN","text":"The key to a man's heart is through his stomach, <span class=\"highlight\">Forename</span>. With this in mind, I would ask your help in maintaining an important partnership."},{"name":"ZUKIN","text":"I have here two pots of our finest pickles, which I would gift to the sentries at the Coral Banquet. Pray see to it they are delivered."},{"name":"RIKUFU","text":"You are far from home, adventurer. What business have you here?"},{"name":"RIKUFU","text":"Hah, if it isn't Kojin pickles! I had been looking forward to this! My thanks, friend!"},{"name":"RIKUFU","text":"Zukin has been sending us pickles on a regular basis. They bring much welcomed flavor to an otherwise bland day."},{"name":"MIDROVER02984","text":"If you require something, please make it quick. I'm on patrol."},{"name":"MIDROVER02984","text":"Well now, more pickles from the Kojin! There's been more contact between us of late, and I must say I appreciate these little gestures."},{"name":"MIDROVER02984","text":"Please send them my thanks along with this message: should we turn up aught of note, they'll be the first to know."},{"name":"MIDROVER02984","text":"Now, if you'll excuse me, I must be moving along."},{"name":"RUGAROVER02984","text":"You better have a good reason for distractin' me on watch! Might be as I drink hard, but I work hard as well! &lt;hic&gt;"},{"name":"RUGAROVER02984","text":"Oh, shite, pickles from the Kojin!? You're a good sort, adventurer! A bloody good sort! &lt;hic&gt;"},{"name":"RUGAROVER02984","text":"Let me tell you, these pickles and rice wine are a match made in heaven! Gah, this watch can't end soon enough! &lt;hic&gt;"},{"name":"RUGAROVER02984","text":"Oh, I know─I'll move quicker! That way the watch'll end sooner! Haha, what a bloody brilliant idea! &lt;hic&gt;"},{"name":"ZUKIN","text":"Delivered the pickles, have you? Tell me, how did our Confederate friends respond?"},{"name":"ZUKIN","text":"...So we continue to be held in good standing. That is well. A little kindness indeed goes a long way."},{"name":"ZUKIN","text":"In the past, we Kojin would purchase such treasures as the Confederacy seized in lieu of the Ruby Tithe. By maintaining amicable relations, we have first pick of the merchandise. A fine arrangement, I'm sure you'll agree."}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21081}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024217","obj":{"i":1024217,"n":"Zukin","l":2409,"q":24}},{"type":"npc","id":"1019249","obj":{"i":1019249,"n":"Rikufu","l":2409,"q":1}},{"type":"npc","id":"1024348","obj":{"i":1024348,"n":"Conscientious Confederate","l":2409,"q":1}},{"type":"npc","id":"1024420","obj":{"i":1024420,"n":"Tipsy Confederate","l":2409,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21081","obj":{"i":21081,"n":"Kojin Sango","l":1,"c":65058,"t":100}}]}