{"quest":{"name":"Forever Blowing Bubbles","location":"The Ruby Sea","id":68527,"patch":4.1,"sort":19,"interval":"daily","repeatable":1,"beast":9,"eventIcon":71222,"issuer":1024217,"target":1024217,"involved":[1024307,1024465],"genre":51,"journal":["Zukin seeks to test your matchmaking skills.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Help the male striped ray launch bubbles at the female striped ray.","Report to Zukin."],"dialogue":[{"name":"ZUKIN","text":"Mating season for striped rays is upon us. Their courtship rituals are long and complex, and begin with the male propelling a stream of sweet-smelling bubbles at an eligible female."},{"name":"ZUKIN","text":"However, the females often reject attempts to impress them. The males become despondent as a result, so the ray handlers must encourage them to keep trying until they find a mate."},{"name":"ZUKIN","text":"Over by Sui–no–Sato is a male ray who is reluctant to continue with the rituals. Perhaps you could assist his trainer?"},{"name":"SYSTEM","text":"Search for the female striped ray. You may move the camera, as well as zoom in and out. Target the female striped ray and launch bubbles with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"ATTENDANT02991","text":"Oh, what a pity! That was a fine attempt, but she's just not interested. She seems to turn away all the males though, not just our little friend here."},{"name":"ATTENDANT02991","text":"That was very nicely done, but he might need to try a few more times before she pays him any attention."},{"name":"ATTENDANT02991","text":"Look at that! This is the first time I've seen her show so much interest! She's ignored every other male until now."},{"name":"ATTENDANT02991","text":"Well, it looks like she's had enough for now. We'd better call it a day as well."},{"name":"ATTENDANT02991","text":"Our young friend here has made a lot of progress. His technique is slowly improving. Perhaps it won't be long before he finds a match!"},{"name":"ATTENDANT02991","text":"Oh, are you here to help? I have spent all day training him, but he has become sullen and uncooperative. I think a fresh approach might do him some good. Would you like to try?"},{"name":"ZUKIN","text":"It would appear that the ray responded well to your instruction. The handler tells me that if he perseveres, he will find a mate sooner or later."},{"name":"ZUKIN","text":"Striped rays are essential to our way of life, but pairing the males and females can be a little troublesome. In most cases, the males must attempt the mating ritual over and over before they succeed."},{"name":"ZUKIN","text":"Since you have a knack for this, we may benefit from your help in the days to come."},{"name":"SYSTEM","text":"The male stares into the distance. With the female gone, he seems at a loss."},{"name":"ATTENDANT02991","text":"We will stay here and continue practicing. I am sure that Zukin will be interested to hear how everything went. Fare you well!"}],"reward":{"gil":583,"reputation":60,"items":[{"num":15,"id":28},{"id":21081}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024217","obj":{"i":1024217,"n":"Zukin","l":2409,"q":24}},{"type":"npc","id":"1024307","obj":{"i":1024307,"n":"Male Striped Ray","l":2409,"q":1}},{"type":"npc","id":"1024465","obj":{"i":1024465,"n":"Ray Handler","l":2409,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21081","obj":{"i":21081,"n":"Kojin Sango","l":1,"c":65058,"t":100}}]}