{"quest":{"name":"Disciplinary Action","location":"The Ruby Sea","id":68538,"patch":4.1,"sort":30,"interval":"daily","repeatable":1,"beast":9,"eventIcon":71222,"issuer":1024217,"target":1024217,"genre":51,"journal":["Zukin is having trouble with some rays.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Subdue the clever little rays at the Crab Pots and feed them the bitter pellets.","Report to Zukin."],"dialogue":[{"name":"ZUKIN","text":"<span class=\"highlight\">Forename</span>, we're having trouble with some of our young rays. Though small in size, they are incurably willful, and keep wandering beyond our territory in spite of repeated chidings. Even now, they roam the Crab Pots, heedless of the dangers."},{"name":"ZUKIN","text":"Loath though I am to do this, they want for discipline, and I would have you be the one to impose it. Please track down the three rays, give them a bit of a drubbing, and then feed them these pellets─a bitter punctuation to the lesson."},{"name":"ZUKIN","text":"Lest you feel bad─do not. It is for their own safety. They must be made to understand that the outside world is fraught with peril."},{"name":"ZUKIN","text":"Ah, there you are. How fared the disciplinary effort?"},{"name":"ZUKIN","text":"My thanks, <span class=\"highlight\">Forename</span>. The lesson ought to keep the little ones in line for the foreseeable future."},{"name":"ZUKIN","text":"Though it may not be apparent at present, they are some of the finest rays we have bred. We would see them realize their potential, and at times this necessitates a firm hand."},{"name":"ZUKIN","text":"To be sure, willfulness is not an inherently negative trait. It is but a shade of determination, which we hope to foster in them."},{"name":"ZUKIN","text":"With any luck, no further such discipline will be necessary, but in the event that it is, I trust you will be willing to assist us again."}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21081}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024217","obj":{"i":1024217,"n":"Zukin","l":2409,"q":24}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21081","obj":{"i":21081,"n":"Kojin Sango","l":1,"c":65058,"t":100}}]}