{"quest":{"name":"The Adventurer Who Cried Wolfman","location":"Gridania","id":68548,"patch":4.1,"sort":145,"icon":100735,"eventIcon":71221,"issuer":1024532,"target":1024523,"genre":203,"usedItems":[21017,21018,21019,21020],"journal":["The Impresario's eyes gleam with hungry expectation.<br>※This quest is available for a limited time only.","That you may strike fear into the hearts of the people of Gridania more effectively, the Impresario has furnished you with a guise of the wolf. Before you can begin your campaign of terror, he asks that you present yourself to him in your full wolflike splendor. To wit, you must equip a werewolf head, a werewolf body, a pair of werewolf arms, and a pair of werewolf bottoms, which may be obtained from a werewolf attire coffer.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The Impresario declares you to be a hideous, monstrous abomination, with a true gift for horror. With his blessing, you may now go forth and spread terror together with Soga.","If you wish to do something right, you must give it your very all. So believes Soga, who encourages you to make a feral growl of some sort to maximize your fear potential. With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “GRRR!” to frighten your first victim.","Soga's suggestion works like a charm, and the man is duly frightened by your growl. Emboldened, the Lupin proposes that you make a game of it by attempting to scare three more Gridanians apiece. Once again, with the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “GRRR!” to frighten three more residents of the city.","Sneaking up behind people and growling in their general direction has proven to be a reliable way of eliciting a terrified response─at least in your experience. But has Soga enjoyed the same success as you?","It would seem that Soga had more and more difficulty scaring the people of Gridania as time went on, perhaps because they had grown more accustomed to his Lupin features. In any event, the many people with whom you interacted expressed an interest in acquiring werewolf costumes of their own, which should doubtless please the Impresario.","The Impresario is delighted to have received so many Gridanians eager to join in the revels by dressing as wolves like you did. When Soga overhears him speaking of a “Night of Devilry,” however, the Impresario asserts that he was only speaking of the “Light of Equality”─a rather nebulous ideal or some such─and quickly takes his leave, assuring you and Soga that he will provide formal contracts for you both to join the Continental Circus at some point in the near future. Whatever the troupe's true objectives, the people of Gridania and Soga seem to be satisfied. One can only hope that the Adventurers' Guild investigator will be as well.","Regardless of the circumstances which led to this particular resolution, the investigator is glad to hear that Soga is no longer interested in joining the Continental Circus, and that the people of Gridania are no longer fearful of wolfmen. While the haunted manor is still of concern, the investigator promises that he and his comrades will keep an eye on it and ensure that no Nights of Devilry come to pass."],"objectives":["Dress in your All Saints' best and speak with the Impresario.","Speak with Soga.","With the chat mode in <span class=\"highlight\">Say</span>, enter “GRRR!” to frighten the good-humored Gridanian.","With the chat mode in <span class=\"highlight\">Say</span>, enter “GRRR!” to frighten the people of Gridania.","Speak with Soga.","Speak with the Impresario.","Speak with the Adventurers' Guild investigator."],"dialogue":[{"name":"IMPHEAD","text":"You have the means at your disposal. Come, dress yourself in the guise of the werewolf, and let us see how terrifying you truly are!"},{"name":"SYSTEM","text":"Equip a werewolf head, a werewolf body, a pair of werewolf arms, and a pair of werewolf bottoms, and then speak with the Impresario."},{"name":"SYSTEM","text":"You may use a werewolf attire coffer to acquire these items. However, please note that this item cannot be used outside large settlements."},{"name":"SYSTEM","text":"If you do not have a werewolf head, a werewolf body, a pair of werewolf arms, and a pair of werewolf bottoms in your possession, you can purchase them from a Calamity salvager."},{"name":"SOGA","text":"How generous they are to furnish you with a costume. We shall have much fun together, you and I!"},{"name":"IMPHEAD","text":"Hm? Why do you hesitate, my friend? I pray you present yourself to me in your full wolflike splendor!"},{"name":"IMPHEAD","text":"By the Twelve, what a hideous, monstrous abomination! You have a true gift for horror!"},{"name":"IMPHEAD","text":"But such is to be expected of an adventurer, is it not? One who would slaughter twenty men for a sack of gil and kill a twenty-first for fun. Oh, how your enemies must have feared you─how their spirits must cry out for vengeance!"},{"name":"SOGA","text":"Uh...I think that means you have his approval, <span class=\"highlight\">Forename</span>!"},{"name":"IMPHEAD","text":"Yes, indeed. So frightened was I that I nearly wept and soiled myself. Clearly there is naught I have to teach you, so I bid you go forth and spread fear!"},{"name":"SOGA","text":"You are quite good at this, aren't you? I wonder if it will come as easily to me, though..."},{"name":"SOGA","text":"Well, there is only one way to find out! As the Impresario said, we must go forth and spread fear to the people of Gridania!"},{"name":"PUMPKIN","text":"(-Disembodied Voice-)Yes, yes, that's the spirit, little wolves..."},{"name":"SOGA","text":"('Twould be foolish to begin without first settling upon a strategy, yes? Let us then consider how we might most effectively frighten the people of Gridania.)"},{"name":"SOGA","text":"(Hmm...the people of Eorzea are wholly unfamiliar with my kind, so let us play to their worst fears. A feral growl of some sort should do nicely. “GRRR!” or some such, perhaps?)"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “GRRR!” to frighten the man."},{"name":"FRIENDLYMAN03012","text":"Oh! Where did you come from, stranger? And what strange garments are you wearing? Is this some sort of prank? If it is, you're not doing a very good job of it..."},{"name":"SAYTODO","text":"GRRR!"},{"name":"FRIENDLYMAN03012","text":"Gaaaaaaaaahhhhhh!!! What in the seven hells is that!?"},{"name":"SOGA","text":"Hahaha, such a face you made! But now I pray you be at ease, good sir. We are members of the Continental Circus, on a quest to spread joy through fear to the people of Gridania!"},{"name":"FRIENDLYMAN03012","text":"Bugger me, is that a talking wolf...man? And with a sense of humor besides... Huh. I suppose I ought to be glad you're not a feral beast here to kill me."},{"name":"SOGA","text":"Indeed! It is all in good fun, as you can see. What is more, if you too are interested in taking part, the Continental Circus will gladly furnish you with your own guise of the werewolf for free!"},{"name":"FRIENDLYMAN03012","text":"Heh, is that so? Well, the price is certainly right. I think I might just go and get one!"},{"name":"SOGA","text":"That went splendidly, <span class=\"highlight\">Forename</span>! I daresay we make a fine team."},{"name":"SOGA","text":"Still, we shouldn't be too dependent on one another. Why don't we split up and try to scare three more Gridanians apiece? Afterwards, we can regroup and decide what to do next."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “GRRR!” to strike fear into the hearts of hapless Gridanians."},{"name":"SOGA","text":"(Remember that the guise alone will not be enough to scare most people. You have to play the part with a hearty “GRRR!”)"},{"name":"TOUGHWOMAN03012","text":"Nice try, little wolf, but I'm not so easily scared! Heh, look at you, spreading fear and terror while wearing such an adorable outfit."},{"name":"TOUGHWOMAN03012","text":"Eh? You say the Continental Circus is giving them away for free to anyone willing to go around trying to frighten people like you are? Why didn't you say so from the first?"},{"name":"COWARDLYMAN03012","text":"M-M-Matron's teats, don't do that! I'm no good with wolves...or bears...or rabbits..."},{"name":"COWARDLYMAN03012","text":"...So, to summarize: you're offering me a chance to dress up like a buffoon and get revenge on all the people who ever wronged me? Heh heh, don't mind if I do!"},{"name":"OLDWOMAN03012","text":"My oh my, aren't you scary! It's almost more than I can bear..."},{"name":"OLDWOMAN03012","text":"At first there was just the one wolfman walking around, but now I see that you're everywhere. Can't say I entirely understand, but if this is the way the wind is blowing, then let no one say I don't also blow!"},{"name":"SOGA","text":"GRRR!<br>...Huh, that usually works."},{"name":"TMARITAA","text":"Your fur looks so soft! And my, what a big mouth you have! The better to eat me with, right?"},{"name":"TDANAFA","text":"For a moment there I feared I might have to summon the Wailers, but then I realized what you were about. Just goes to show you shouldn't judge people by appearances, eh?"},{"name":"TOUGHWOMAN03012","text":"...Well? What is it? Or are you just going to stare at me in silence?"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “GRRR!” to strike fear into the hearts of hapless Gridanians."},{"name":"COWARDLYMAN03012","text":"All these wolfmen prowling our fair city... Maybe if I go and hide behind some shrubbery they'll leave me be..."},{"name":"OLDWOMAN03012","text":"Such a lovely tradition, All Saints' Wake. I do so look forward to the festivities every year."},{"name":"SOGA","text":"Scared your three, <span class=\"highlight\">Forename</span>? I did as well, though I thought to keep going until you arrived."},{"name":"SOGA","text":"I have to say, too, that I have had more and more trouble as time went on. It would seem that word has spread of our activities, and the citizenry have grown somewhat...accustomed to my features?"},{"name":"SOGA","text":"Be that as it may, I should like to think the Impresario will be pleased with the many people we sent his way."},{"name":"TMARITAA","text":"He's so fluffy!"},{"name":"TDANAFA","text":"...Would it be all right if I asked to touch his fur as well, you think?"},{"name":"IMPHEAD","text":"Hahaha! How wonderful, how fantastic! Would you believe there has been no end to the stream of Gridanians clamoring for a guise of the werewolf to call their own?"},{"name":"IMPHEAD","text":"We owe it all to you two and your tireless efforts. Marvelous, marvelous work!"},{"name":"IMPHEAD","text":"Heh heh...with every innocent that embraces their bestial nature, with every soul that delights in the darkness, we creep ever closer to the Night of Devilry..."},{"name":"SOGA","text":"Um, what was that you said just now? Something about a “Night of Devilry”?"},{"name":"IMPHEAD","text":"Wh-What? Oh, no! I said the, uh...the “Light of Equality”! Ever closer do we, uh, creep to it. Yes, that will do nicely."},{"name":"IMPHEAD","text":"Anyway, once again I must commend you both on a job well done! I should be glad to welcome you to the Continental Circus!"},{"name":"IMPHEAD","text":"That said, it may take rather a long time to make it official─proper paperwork and procedure and so forth─and we really do have our hands full at the moment. I'll have the contracts ready for you to sign soon enough, though, don't you worry!"},{"name":"FRIENDLYMAN03012","text":"(-???-)GRRR!"},{"name":"FRIENDLYMAN03012","text":"Got you two good, eh? Nearly scared you to death! Oh, this is too much─and I owe it all to you two!"},{"name":"FRIENDLYMAN03012","text":"I usually come to these popular things late, you know? Was running around a couple of years back with a bedsheet over my head, like a ghost, but no one was paying me any mind─but not this time!"},{"name":"FRIENDLYMAN03012","text":"It's a great way to strike up a conversation with a lady too, heh heh. Aye, I've got a feeling that this is gonna be a good All Saints' Wake for me, and in more ways than one!"},{"name":"SOGA","text":"...So that is why he welcomed me with open arms. At last I understand you, Impresario..."},{"name":"SOGA","text":"You sought only to aid me in befriending the people of Gridania! To help them to understand that I was not some strange, otherworldly creature, but a kindred spirit!"},{"name":"SOGA","text":"In dressing themselves in the guise of the werewolf, they have come to realize that beneath this fur beats a heart no different from theirs! Oh, how deep and meaningful this game has proven to be!"},{"name":"SOGA","text":"But I mustn't be content with my lot here in Gridania, <span class=\"highlight\">Forename</span>. No─I must go unto all the peoples of Eorzea and endeavor to befriend each and every one! Surely that is what the Impresario would want?"},{"name":"SOGA","text":"Then it is settled. With regret I will decline his invitation, though I shall remain until the festivities are concluded. And then I shall embark on a new journey!"},{"name":"SOGA","text":"A final favor to ask of you, if I may, my friend. If you happen to cross paths with that other adventurer, would you thank him for me, and tell him of my decision?"},{"name":"WITCH03012","text":"Now, now, there's no need for shoving! We have enough guises for everyone!"},{"name":"SOGA","text":"Never did I think I would see so many people wishing to become a wolf! I wonder what my kinsmen in Doma would think..."},{"name":"INVESTIGATOR03011","text":"I've seen an awful lot of people running around the city dressed as wolves of late. I don't suppose you and Soga had anything to do with that?"},{"name":"INVESTIGATOR03011","text":"...That's not the conclusion I would have drawn, but the important thing is that Soga decided not to join the Continental Circus."},{"name":"INVESTIGATOR03011","text":"Perhaps more importantly, the people of Gridania seem to have grown accustomed to our wolfman friend, as well as the guises the troupe has been distributing to the mischievous. Aye, it'll take more than that to terrify the average Gridanian!"},{"name":"INVESTIGATOR03011","text":"...Like that haunted manor of theirs, I suppose. Yes, that is still a problem..."},{"name":"INVESTIGATOR03011","text":"But we'll keep an eye on that, we will! There'll be no Night of Devilry on our watch, no sir!"},{"name":"PUMPKIN","text":"Heh heh heh... When brought into the light, the wolf can seem less fearsome. But in the dark man and monster are as equals. As friends. Won't you come and join us?"},{"name":"SOGA","text":"Forgive me, my friend, but I fear I do not have the time to seek out that adventurer who was so worried for my well-being before. Should you chance to see him again, please let him know that I am well."}],"reward":{"items":[{"num":10,"id":16929}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68547]},"next":[68549]},"partials":[{"type":"npc","id":"1024532","obj":{"i":1024532,"n":"Impresario","l":53,"q":2}},{"type":"npc","id":"1024523","obj":{"i":1024523,"n":"Adventurers' Guild Investigator","l":53,"q":3}},{"type":"item","id":"16929","obj":{"i":16929,"n":"Magicked Prism (Pumpkin)","l":1,"c":22632,"t":85,"p":2}},{"type":"item","id":"21017","obj":{"i":21017,"n":"Werewolf Head","l":1,"c":40785,"t":34,"p":30}},{"type":"item","id":"21018","obj":{"i":21018,"n":"Werewolf Body","l":1,"c":42584,"t":35,"p":50}},{"type":"item","id":"21019","obj":{"i":21019,"n":"Werewolf Arms","l":1,"c":44610,"t":37,"p":30}},{"type":"item","id":"21020","obj":{"i":21020,"n":"Werewolf Bottoms","l":1,"c":47363,"t":36,"p":50}},{"type":"quest","id":"68547","obj":{"i":68547,"n":"An Othardian Wolfman in Gridania","g":203,"l":"Gridania","s":144}},{"type":"quest","id":"68549","obj":{"i":68549,"n":"Mind Their Manor","g":203,"l":"Gridania","s":146,"f":1}}]}