{"quest":{"name":"Mind Their Manor","location":"Gridania","id":68549,"patch":4.1,"sort":146,"icon":112196,"unlocksFunction":1,"eventIcon":71341,"issuer":1024523,"target":1017852,"genre":203,"journal":["An investigator for the Adventurers' Guild has a lingering worry on his mind.<br>※This quest is available for a limited time only.","The Adventurers' Guild investigator has recently heard that the preparations for the Continental Circus's haunted manor are now complete. Admittedly, given the failure of the troupe's plans in stoking the fears of the populace, this development is of less concern than before, but if you have a mind to investigate, a certain illusionist can tell you more.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Though exhausted from having to distribute guises of the werewolf to the public day and night, the illusionist is pleased to confirm that the haunted manor is indeed now open to the public. Should you wish to experience the manor's “amusements” for yourself, you need only seek out one the troupe's harlequin guides."],"objectives":["Speak with the uncanny illusionist."],"dialogue":[{"name":"INVESTIGATOR03011","text":"Ah, yes. I heard from the illusionist that the preparations for the haunted manor are finally complete."},{"name":"INVESTIGATOR03011","text":"This too is but a means to a nefarious end, another method by which the Continental Circus plots to stoke the fears of the populace...but since no one seems to be particularly frightened of the werewolf costumes, maybe there's no need to worry."},{"name":"INVESTIGATOR03011","text":"Anyway, if you've a mind to look into the haunted manor, you can go and speak with the illusionist yourself."},{"name":"WITCH03012","text":"I will be happy to tell you all about the manor and its many amusements in a short while, my dear adventurer. But first, I must take a brief rest. Distributing guises of the werewolf all day can be quite exhausting, you know."},{"name":"WITCH03012","text":"Oh, it's you! The adventurer to whom we owe so very, very much! I've barely had time to breathe what with all the people clamoring for guises of the werewolf."},{"name":"WITCH03012","text":"But, more importantly, you will be pleased to hear that our haunted manor is now open to the public!"},{"name":"WITCH03012","text":"Before you enter, however, you would do well to learn more of the various <span class=\"emphasis\">amusements</span> that await you inside. One of our harlequin guides would be happy to assist you."},{"name":"WITCH03012","text":"And when you have mustered your courage and are ready to brave the manor, you need only let them know!"},{"name":"WITCH03012","text":"Much as I would love to lead you there myself, duty calls. The people yearn to dress themselves as wolves, and we must do our utmost to oblige them. Take care!"},{"name":"SYSTEM","text":"You now have access to the Haunted Manor seasonal instance. To enter the manor, speak with the harlequin guide in either Mih Khetto's Amphitheatre or the Acorn Orchard."},{"name":"SYSTEM","text":"The Haunted Manor is a light party instance (four players). There are no class, job, or level requirements for participation."},{"name":"SYSTEM","text":"Parties that register for the instance with less than four members will be filled out automatically via the matching system."},{"name":"INVESTIGATOR03011","text":"Be my guest if you want to explore the manor, but I'm happy to leave it well enough alone, if it's all the same to you."}],"reward":{"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68548]}},"partials":[{"type":"npc","id":"1024523","obj":{"i":1024523,"n":"Adventurers' Guild Investigator","l":53,"q":3}},{"type":"npc","id":"1017852","obj":{"i":1017852,"n":"Enthralling Illusionist","l":53,"q":1}},{"type":"quest","id":"68548","obj":{"i":68548,"n":"The Adventurer Who Cried Wolfman","g":203,"l":"Gridania","s":145}}]}