{"quest":{"name":"Starlight Stakeout","location":"Central Shroud","id":68546,"patch":4.1,"sort":148,"icon":100738,"eventIcon":71221,"issuer":1024451,"target":1024451,"genre":204,"journal":["Will Taff's testimony help solve the mystery of the stolen decorations?<br>※This quest is available for a limited time only.","It appears that treants stole the Starlight Celebration decorations, and the wandering pilgrim saw them heading southward. Baenfaeld has gone to Galvanth's Spire to scout ahead, and you agree to rendezvous with him there.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Baenfaeld reveals that the treants have converged at the Mirror Planks. Speak with the Starlight Bear handler stationed by the Mirror Planks to proceed to the next phase of the plan.","The Starlight Bear handler requests you ride your trusted bear once more, and use starbursts to halt the treants in their tracks.<br><br>※Participate in the FATE “Bad Luck Comes in Trees” to apprehend the culprits.<br><br>※Speak with the Starlight Bear handler near the Mirror Planks to mount <span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\">Polaris</span></span></span><span class=\"alternative\">Pferkad</span><span class=\"alternative\">Polaris</span></span>.","The treants have been subdued. It is time to return to Bentbranch Meadows and tell Taff the good news.","Taff is delighted to hear from Baenfaeld and yourself that most of the treants have been caught and the majority of the decorations recovered. Your efforts have contributed greatly to the case of the stolen Starlight Celebration goods, but several treants still evade capture. There may yet be need of your services."],"objectives":["Speak with Baenfaeld at Galvanth's Spire.","Speak with the Starlight Bear handler at the Mirror Planks.","Complete the FATE “Bad Luck Comes in Trees” near the Mirror Planks.","Speak with Taff."],"dialogue":[{"name":"TAFF","text":"You mean you'll get all the decorations back? Thank you so much, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>!"},{"name":"BAENFAELD","text":"<span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\">Polaris</span></span></span><span class=\"alternative\">Pferkad</span><span class=\"alternative\">Polaris</span></span> came lookin' for me, an' told me to leg it back here. Everythin' all right?"},{"name":"BAENFAELD","text":"You what? This little nipper saw the thief?"},{"name":"TAFF","text":"I did! The Starlight Tree nicked all the decorations, and stuck 'em all over itself!"},{"name":"BAENFAELD","text":"Pull the other one, it's got bells on! We was robbed by a tree? Bit far-fetched, don't ye think?"},{"name":"BAENFAELD","text":"What d'you make of all this?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"He's telling the truth."},{"name":"A2","text":"Yeah, that's bollocks."},{"name":"TAFF","text":"You believe me? I knew you weren't like all the others! It really was the Starlight Tree I saw, I swear!"},{"name":"TAFF","text":"You think I'm just tellin' stories? You're all the same! Well, I don't care if you believe me or not, I know what I saw! It was the Starlight Tree!"},{"name":"BAENFAELD","text":"All right, son, let's slow down, eh? You sure you didn't mis-see it? Bit too much cheese before bed perhaps?"},{"name":"GODBERT","text":"(-???-)Ho ho ho! This vigilant young man speaks the truth!"},{"name":"BAENFAELD","text":"It's you! You show up to help us every Starlight Celebration! Yer Go..."},{"name":"GODBERT","text":"A wandering pilgrim, come to see justice is served! I can vouch for the boy's testimony, as I too witnessed this heinous crime with my very eyes! But what say you, adventurer? What do your instincts tell you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The prime suspect is none other than...a treant!"},{"name":"A1","text":"It was the Starlight Tree...?"},{"name":"GODBERT","text":"Verily, you have cut straight to the heart of the matter! For the true criminal is naught more than a common treant, draped in plundered Starlight Celebration finery!"},{"name":"GODBERT","text":"Indeed, it was the Starlight Tree, but in appearance only! A lowly treant claimed the decorations for itself, and assumed the guise of our most beloved of festive fauna!"},{"name":"BAENFAELD","text":"A treant! Come to mention it, if one of those made off with a load of Starlight gubbins, it might look a bit like a Starlight Tree!"},{"name":"GODBERT","text":"That is not all! For I saw not one, but a whole copse of these culprits, all similarly bespangled, shambling their way south."},{"name":"GODBERT","text":"I had a mind to smite the wretched lot of them, there and then. But! I realized that if my hammer of legend were to strike down the fiends, the decorations we seek to reclaim would suffer the same fate! Another approach is needed, methinks."},{"name":"BAENFAELD","text":"Aye, we've got to find a way to nab those bark-faced bastards without breakin' anythin'. But how are we to do that?"},{"name":"POLARIS","text":"Grrr... Grrrrrr..."},{"name":"BAENFAELD","text":"\"If we lob a bunch of starbursts at the treants, we can stun 'em without damagin' our stuff,“ ye say? Worth a try, I reckon!"},{"name":"BAENFAELD","text":"First, we track 'em down. If they're headin' south, the Starlight Celebrant by Galvanth's Spire probably saw 'em."},{"name":"BAENFAELD","text":"I'll go ahead with the bears and have a word with the lad stationed down there. We'll wait for you before makin' our move."},{"name":"GODBERT","text":"Ho ho ho! A fine plan indeed! All that remains is to round up the troublemakers, and make those darling children smile once more. Now go, adventurer! May the raging flames of your righteous soul spare not those who defy the will of Nymeia!"},{"name":"TAFF","text":"You're going to Galvanth's Spire? I want to help too, but I know I'd only get in your way. So I'll keep an eye on things here!"},{"name":"BAENFAELD","text":"It's just as we suspected. A whole troop of 'em have been seen shufflin' about by the Mirror Planks."},{"name":"BAENFAELD","text":"The bears are in position, and ready when you are. When our quarry shows up, have a word with the Starlight Bear handler to ride <span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\">Polaris</span></span></span><span class=\"alternative\">Pferkad</span><span class=\"alternative\">Polaris</span></span> and start flingin' them starbursts!"},{"name":"BAENFAELD","text":"Once you've got 'em stunned, we'll take care of the rest. There might even be a few more 'venturers willin' to join ye. Just do whatever it takes!"},{"name":"TAFF","text":"I don't think I'd be any good fighting treants, so I'll keep out of the way. Wish I could watch, though!"},{"name":"COMMITTEE00439","text":"Baenfaeld's told me all about the plan. I've got <span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\">Polaris</span></span></span><span class=\"alternative\">Pferkad</span><span class=\"alternative\">Polaris</span></span> right here, ready to throw some starbursts. Good luck out there!"},{"name":"COMMITTEE00439","text":"<span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\">Polaris</span></span></span><span class=\"alternative\">Pferkad</span><span class=\"alternative\">Polaris</span></span> is right here, waiting for you. Don't let those thieves get away!"},{"name":"TAFF","text":"Oh, you're back! How did it go?"},{"name":"BAENFAELD","text":"Ah, there ye are! Great work, <span class=\"highlight\">Forename</span>! You too, <span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">Kochab</span><span class=\"alternative\">Polaris</span></span></span><span class=\"alternative\">Pferkad</span><span class=\"alternative\">Polaris</span></span>! Judgin' by the amount of decorations we got back, I'd say most of the treants've been dealt with."},{"name":"BAENFAELD","text":"We couldn't've done it without ye! So, Taff, you got anythin' ye want to say?"},{"name":"TAFF","text":"Thank you so much! I knew you'd come through for us!"},{"name":"TAFF","text":"I'll make sure everyone knows what you did! Nymeia bless you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! Good-bye!"},{"name":"TAFF","text":"You know, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, you're just like one of the saint's little helpers!"},{"name":"POLARIS","text":"Groaaar... Grrr..."},{"name":"KOCHAB","text":"Groooaaar! Groaaar!"},{"name":"PFERKAD","text":"&lt;whimper&gt; Grrr..."},{"name":"SYSTEM","text":"You cannot be certain, but somehow you sense he is saying, “It was a pleasure to fight alongside you! We are thrilled that the joy of the Starlight Celebration has returned to Bentbranch Meadows.”"},{"name":"BAENFAELD","text":"Ye have my thanks as well! 'Course, now we've got to put all the decorations back up, but I'm sure the young'uns won't mind helpin' out. The Starlight Celebration's been saved, and it's all because of you!"},{"name":"BAENFAELD","text":"There are still a few odds an' ends missin', probably tangled up in some other treants. If ye've got time, ye can help us look for 'em! The local youngsters, and the “T'riffic Trio” here would be right pleased if ye did!"},{"name":"POLARIS","text":"(-The Three Bears-)Grrroooaaar!"}],"reward":{"items":[{"id":21050}],"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68545]}},"partials":[{"type":"npc","id":"1024451","obj":{"i":1024451,"n":"Taff","l":54,"q":2}},{"type":"item","id":"21050","obj":{"i":21050,"n":"Starlight Bear Horn","l":1,"c":26038,"t":63}},{"type":"quest","id":"68545","obj":{"i":68545,"n":"Stars and Explosions and Bears, Oh My","g":204,"l":"Gridania","s":147}}]}