{"quest":{"name":"A City Fallen","location":"Kugane","id":68540,"patch":4.1,"sort":20,"icon":112256,"unlocksFunction":1,"eventIcon":71341,"issuer":1024142,"target":1024149,"involved":[1024143,1024144,1024145,1024146,1024148,1024158,1024159,1024491],"genre":21,"journal":["Ramza is itching to depart.","The <span class=\"emphasis\">Prima Vista</span> has left port, bound for the Dalmasca Estersands. Await the call to disembark in the comfort of the tiring room.","The airship has arrived above the remains of Dalmasca's capital city. Set off into the Estersands and locate the missing Jenomis.<br><br>※The Royal City of Rabanastre can be accessed via the Duty Finder.","You save Jenomis, but not before a band of Bangaa led by the infamous Ba'Gamnan steal both the Duma and the principal's journal.","Wit and cunning (or else strength and magicks) have seen you through the Royal City of Rabanastre. Return to the <span class=\"emphasis\">Prima Vista</span>'s tiring room and prepare for the voyage back to Kugane.","Jenomis's misadventure in the Estersands has only made him more determined to uncover the truth behind the Zodiac Brave Story and prove the existence of Ivalice. Additional evidence is apparently to be found in the Durai Papers─a secret document passed down through countless generations of the Lexentale family...which is actually the Durai family. The tome, however, is written in High Ivalician, the secrets of translating which were lost along with Jenomis's stolen journal. As it will take some time for the principal and his family to recover from the theft, they have invited you to return to your adventures, with the promise that they will send for you if any additional assistance is required. Perhaps now would be an opportune moment to ask Lina Mewrilah for her thoughts on the story so far.","Lina seems enamored with the grand adventure on which you have both embarked, and promises she will notify you the very moment there are any new developments."],"objectives":["Visit the tiring room.","Enter the Royal City of Rabanastre.","Speak with Lina in the tiring room.","Speak with Lina outside the airship landing."],"dialogue":[{"name":"LINAMEWRILAH","text":"I'll admit that I have my doubts regarding this second hero theory, but if even a fraction of it proves true, it could be the story of the century!"},{"name":"ALMALEXENTALE","text":"You will find my father. I just know it."},{"name":"RAMZALEXENTALE","text":"Dalmasca is nestled in a forgotten corner of the Empire's outermost territories. I do not foresee any trouble from the standing army, but would suggest committing to memory the locations of each of the barge's exits...just in case."},{"name":"RAMZALEXENTALE","text":"As for the flight itself, the currents above Dalmasca are as wild as the land below. You may want to hold on."},{"name":"RAMZALEXENTALE","text":"We'll complete our descent to Rabanastre in the shuttle."},{"name":"ALMALEXENTALE","text":"Ramza!"},{"name":"RAMZALEXENTALE","text":"I thought I made myself clear, Alma. The capital is simply too dangerous. Father would never forgive me if I were to lose you trying to rescue him."},{"name":"RAMZALEXENTALE","text":"Come. We are wasting time."},{"name":"RAMZALEXENTALE","text":"According to my father, Rabanastre was already a thriving city some thousand years ago."},{"name":"RAMZALEXENTALE","text":"But after performing several private excavations beneath the so-called Desert Sapphire, my father came to the conclusion that it was not the first settlement to stand here."},{"name":"LINAMEWRILAH","text":"Then...your father believes that Rabanastre sits atop the Royal City of Lesalia, capital of Ivalice!"},{"name":"LINAMEWRILAH","text":"But if that's true, it could change history! We would be famous!"},{"name":"RAMZALEXENTALE","text":"“Famous”? Are you sure you don't mean <span class=\"emphasis\">rich</span>? Pah! Your kind are all alike."},{"name":"RAMZALEXENTALE","text":"Parasites grown fat on the sweat and suffering of others."},{"name":"LINAMEWRILAH","text":"Bold words for a boy of but sixteen summers."},{"name":"LINAMEWRILAH","text":"And what, pray tell, have I done to deserve such spite? I only wish to learn the truth behind the disappearance of the Empire's foremost playwright. If that should lead to something bigger, well then, I would be the worst reporter in the realm if I did not pursue it!"},{"name":"RAMZALEXENTALE","text":"Yes, yes. We can argue about this now, or we can return to the <span class=\"emphasis\">Prima Vista</span> and report to our army of adventurers that it is time to begin the expedition. I humbly suggest the latter."},{"name":"BAGGAMONAN","text":"(-???-)You see? It is as I said, Brother. Let them come to us!"},{"name":"BWAGI","text":"(-???-)Should we kill them now?"},{"name":"BAGGAMONAN","text":"(-???-)No. The time is not right."},{"name":"BWAGI","text":"(-???-)When has that stopped us before?"},{"name":"BAGGAMONAN","text":"(-???-)Fool! Do you see that one? Slayer of gods, they call <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. Warrior of Light!"},{"name":"LINAMEWRILAH","text":"You cannot expect me to walk away from this! If the legend of Ivalice is true, the public has a right to know!"},{"name":"ALMALEXENTALE","text":"Hold on, Father... Help is on its way..."},{"name":"RAMZALEXENTALE","text":"To Rabanastre!"},{"name":"JENOMISLEXENTALE","text":"Where... Where am I?"},{"name":"RAMZALEXENTALE","text":"Father!"},{"name":"JENOMISLEXENTALE","text":"Ramza... And...<span class=\"emphasis\">the Warrior of Light</span>? Yes, I know of you. But that you should come to my rescue...? Words...fail me. A poor playwright I must seem..."},{"name":"BAGGAMONAN","text":"The term you're looking for is “thank you”! Upon which note─I, Ba'Gamnan, bounty hunter, do humbly thank <span class=\"emphasis\">you</span>, Warrior of Light, for delivering me this fine gift!"},{"name":"BAGGAMONAN","text":"Now hand over the auracite, unless you wish to see the desert sands turn red! And be quick. Gijuk here does not have the steadiest of hands."},{"name":"BAGGAMONAN","text":"That one! She will bring it to me."},{"name":"BAGGAMONAN","text":"Yes! This is it! The Duma!"},{"name":"BWAGI","text":"(-???-)And to think we found it so close to Doma! The Duma of Doma! Bwah hah hah hah!"},{"name":"BAGGAMONAN","text":"Enough, Bwagi! We would not have our guests think us underbred."},{"name":"RAMZALEXENTALE","text":"You have what you want, you thieving lizards! Now unhand him!"},{"name":"BAGGAMONAN","text":"Of course. A Bangaa is always true to his word. I will be keeping <span class=\"emphasis\">this</span>, though."},{"name":"RAMZALEXENTALE","text":"Father!"},{"name":"BAGGAMONAN","text":"You've only yourselves to blame for this. But if you mislike the thought, you could always blame the gods. Not that they are listening! Bwah hah hah hah hah!"},{"name":"BAGGAMONAN","text":"Get up, fool! We're leaving!"},{"name":"RAMZALEXENTALE","text":"You're going to be all right."},{"name":"LINAMEWRILAH","text":"We cannot see to your father's hurts here. Come on! We must get him back to the <span class=\"emphasis\">Prima Vista</span>."},{"name":"JENOMISLEXENTALE","text":"&lt;groan&gt;"},{"name":"RAMZALEXENTALE","text":"He is unchanged."},{"name":"RAMZALEXENTALE","text":"Father! Wake up, Father! Please, Mother─don't take him from us yet!"},{"name":"LINAMEWRILAH","text":"Jenomis remains deep in slumber, but his breathing is steady and his fever has subsided. For now, all we can do is wait. I've sent word to Cid. I hope you don't mind..."},{"name":"JENOMISLEXENTALE","text":"Alma, Ramza. Can you ever forgive me?"},{"name":"JENOMISLEXENTALE","text":"And you, Cid. It was never my intention to put you to such trouble... I am ever in your debt."},{"name":"CID","text":"You would have done the same for me, Jenomis. Besides, it was <span class=\"highlight\">Forename</span> here who went to all the trouble. If anyone deserves your thanks, it's <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"JENOMISLEXENTALE","text":"He is right. I have done naught to deserve your kindness, yet I am its beneficiary nonetheless."},{"name":"CID","text":"...So, if I understand correctly, you're saying auracite does <span class=\"emphasis\">not</span> work to facilitate the possession of a living host by an eikon, as was assumed to be the case with Ysayle and the archbishop..."},{"name":"CID","text":"...but rather absorbs the host's aether─its very <span class=\"emphasis\">soul</span>─and somehow transforms it before returning it to the host's body."},{"name":"CID","text":"If that is the case, our Sharlayan allies will need to be informed immediately."},{"name":"CID","text":"But I suppose the real question here is...did you find what you came looking for?"},{"name":"JENOMISLEXENTALE","text":"The legend would have us believe that Delita Heiral─the commoner who would be king─was the sole hero of the Zodiac Brave Story, but as I have discovered, there was another. Two others, in fact..."},{"name":"JENOMISLEXENTALE","text":"...Siblings whose roles faded from subsequent retellings of the story. A brother and sister by the names of Ramza and Alma."},{"name":"CID","text":"Then..."},{"name":"LINAMEWRILAH","text":"To prepare for this assignment, I pored over every published work on Ivalician legend I could lay my hands on, and <span class=\"emphasis\">nowhere</span> did I find any mention of these siblings."},{"name":"JENOMISLEXENTALE","text":"But <span class=\"emphasis\">I</span> did. I uncovered irrefutable evidence that Delita had a close companion named Ramza who aided him in his rise to power. This in turn led me to Alma. And that I might never lose sight of the truth, I named my own children after these lost players."},{"name":"JENOMISLEXENTALE","text":"I'm sorry I never told you any of this, Cid, but you must believe me. Ivalice has never been a mere pastime of mine. It is and forever will be my calling. My purpose."},{"name":"JENOMISLEXENTALE","text":"My <span class=\"emphasis\">family's</span> purpose."},{"name":"CID","text":"Go on..."},{"name":"JENOMISLEXENTALE","text":"The world knows me as Jenomis cen Lexentale, yet that is but my stage name. My true name is Arazlam. Arazlam Durai."},{"name":"JENOMISLEXENTALE","text":"Countless generations past, it was my ancestor who penned the Durai Papers─an account of Ivalice and the War of the Lions that details what truly occurred during that turbulent era."},{"name":"RAMZALEXENTALE","text":"You are tired, Father. Rest. I will continue."},{"name":"RAMZALEXENTALE","text":"Long ago, an orphan by the name of Orran Durai crossed paths with both Ramza and Delita. After Delita's rise to power, Orran found himself in the service of the pauper-become-king."},{"name":"RAMZALEXENTALE","text":"Following the War of the Lions, Orran believed the people of Ivalice had a right to know the truth of Ramza's involvement, and set about documenting his deeds. When the church learned of his intent, however, they branded him a heretic, and had him burned at the stake."},{"name":"RAMZALEXENTALE","text":"The Durai Papers were never published, and any existing copies were gathered and sealed away in church vaults─the truth about Ivalice along with them."},{"name":"LINAMEWRILAH","text":"What was so damning that it would drive the church to do such a thing?"},{"name":"RAMZALEXENTALE","text":"The answer to that question can be found in this book─the only surviving transcript of my ancestor's chronicle, copied from an early draft and passed down for untold generations."},{"name":"RAMZALEXENTALE","text":"With this, my father and I plan to reveal the truth and restore honor to my family name."},{"name":"CID","text":"Forbidden chronicles? A secret family legacy? Not that I doubt you, Jenomis, but how do you expect to convince people of all of this when well-nigh every soul in the realm believes Ivalice to be nothing but a bedtime story?"},{"name":"JENOMISLEXENTALE","text":"By proving that it is anything but."},{"name":"JENOMISLEXENTALE","text":"And when people see that Ivalice was real, the rest will fall into place."},{"name":"RAMZALEXENTALE","text":"Were it as simple as bringing forth the chronicle and submitting it for review, we would of course have done so long ago. But, alas, it is not. The Durai Papers, you see, are written in High Ivalician─an ancient tongue long extinct."},{"name":"RAMZALEXENTALE","text":"My father, his father, and his father before him labored tirelessly to decipher this tome, but for want of other sources made only fitful progress. A word here, a phrase there. It wasn't until a recent expedition to Rabanastre turned up several well-preserved artifacts that we were able to translate a small portion of the papers."},{"name":"LINAMEWRILAH","text":"Then the diary stolen by the Bangaa bounty hunters─"},{"name":"JENOMISLEXENTALE","text":"I'm afraid so. Everything we had learned of the language was contained in those pages."},{"name":"LINAMEWRILAH","text":"Then we're back to where we started."},{"name":"RAMZALEXENTALE","text":"Not necessarily. We still have the transcript, as well as some few translated passages. And, of course, my father's impeccable memory."},{"name":"JENOMISLEXENTALE","text":"I have come too far to allow so simple a setback to deter me from my purpose. I will show the world the truth if it is the last thing I do!"},{"name":"ALMALEXENTALE","text":"(It is as Master Garlond said... He is a man obsessed, and I fear Ivalice's grip on him will only grow tighter...)"},{"name":"ALMALEXENTALE","text":"(Father was fortunate to escape Rabanastre with his life, and already he speaks of continuing his quest? Promise me you'll keep him safe. Please...)"},{"name":"RAMZALEXENTALE","text":"My father and I will begin the retranslation forthright. Once we have made sufficient progress, you will be informed."},{"name":"ALMALEXENTALE","text":"I don't believe I properly thanked you for saving my father. I shudder to think what would have become of him without your help. Now, I simply worry how long this reunion will last..."},{"name":"JENOMISLEXENTALE","text":"Cid tells me it was you and your companions who liberated Ala Mhigo. I am honored that one of your acclaim would lend <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> strength to my cause."},{"name":"LINAMEWRILAH","text":"After what I've seen here, I'm all but convinced that Ivalice exists...at least in some form."},{"name":"LINAMEWRILAH","text":"The problem will be gathering sufficient evidence to convince the thousands of scholars and historians who have based their careers on the presumption that it doesn't."},{"name":"LINAMEWRILAH","text":"Not that I've ever been one to shy from a challenge, especially when it means the story of the century!"},{"name":"LINAMEWRILAH","text":"If you're in, <span class=\"highlight\">Forename</span>, then I'm in. If you're not in...well, I'm still in. Either way, you'll be hearing from me again soon. That much I promise you!"}],"reward":{"gil":7500,"items":[{"id":21294},{"id":21295}],"xp":0,"instance":30058},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68539]},"next":[68625]},"partials":[{"type":"npc","id":"1024142","obj":{"i":1024142,"n":"Ramza Bas Lexentale","l":2371,"q":2}},{"type":"npc","id":"1024149","obj":{"i":1024149,"n":"Lina Mewrilah","l":2404,"q":5}},{"type":"npc","id":"1024143","obj":{"i":1024143,"n":"Lina Mewrilah","l":2371,"q":2}},{"type":"npc","id":"1024144","obj":{"i":1024144,"n":"Alma Bas Lexentale","l":2371,"q":2}},{"type":"npc","id":"1024145","obj":{"i":1024145,"n":"Ramza Bas Lexentale","l":2370,"q":1}},{"type":"npc","id":"1024146","obj":{"i":1024146,"n":"Lina Mewrilah","l":2370,"q":1}},{"type":"npc","id":"1024148","obj":{"i":1024148,"n":"Jenomis Cen Lexentale","l":2370,"q":1}},{"type":"npc","id":"1024158","obj":{"i":1024158,"n":"Jenomis Cen Lexentale","l":2370,"q":1}},{"type":"npc","id":"1024159","obj":{"i":1024159,"n":"Alma Bas Lexentale","l":2370,"q":1}},{"type":"npc","id":"1024491","obj":{"i":1024491,"n":"Ramza Bas Lexentale","l":2371,"q":1}},{"type":"item","id":"21294","obj":{"i":21294,"n":"Protagonist's Theme Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"21295","obj":{"i":21295,"n":"Background Story Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"30058","obj":{"i":30058,"n":"The Royal City of Rabanastre","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":305}},{"type":"quest","id":"68539","obj":{"i":68539,"n":"Dramatis Personae","g":21,"l":"Kugane","s":10,"f":1}},{"type":"quest","id":"68625","obj":{"i":68625,"n":"Uninvited","g":21,"l":"Kugane","s":30,"f":1}}]}