{"quest":{"name":"A Hingan Tale: Nashu Goes East","location":"Kugane","id":68544,"patch":4.1,"sort":10,"icon":100745,"unlocksFunction":1,"eventIcon":71341,"issuer":1024349,"target":1024355,"involved":[1019000,1019034,1020473,1024350,1024351,1024352,1024409],"genre":70,"journal":["Yon Lalafell has a lean and hungry look.","While enjoying a day like any other in Kugane, you are approached by a strange Lalafell smelling faintly of cheese. Said Lalafell entreats you, a fellow Eorzean doubtless gifted in the ways of violence, to enter the nearby Shiokaze Hostelry and search for a Miqo'te maiden in need of assistance.","The maiden turns out to be none other than Nashu Mhakaracca, the redoubtable assistant of Hildibrand Helidor Maximilian Manderville, agent of enquiry, inspector extraordinaire. She is come to Kugane in search of her missing mentor, last seen hurtling through the heavens towards the Far East, and was mere moments away from accepting the assistance of another familiar face: Gyodo, the conniving trickster who attempted to betray you to the Garleans once upon a time. Upon realizing that his latest victim is your associate, he beats a quick retreat, leaving you alone with the downcast woman.","Bereft of leads as to the whereabouts of the missing inspector, you and Nashu decide to take a different tack. Together you will question the residents of Kugane in an effort to learn of any recent cases of criminal mischief which are likely to draw the attention of Inspector Hildibrand.","The story on everyone's lips these days is that of a mysterious thief preying upon wealthy merchants. This information should serve to satisfy Nashu─at least more than the revelation that the Lalafell in pink who first directed you to her has been stalking her for nigh on five years...","Recognizing the futility of trying to warn Nashu about her addle-brained stalker, you bring her attention instead to the matter of the mysterious thief. She agrees that it is just the sort of case that would draw the inspector from malms away, and so you resolve to seek out Akebono, a merchant and most recent victim of the thief.","You find Akebono being questioned by an earnest samurai, who upon taking his leave turns and bowls over Nashu. Rising to his feet, he introduces himself as Shigure before charging off to conduct his investigation, leaving you and Nashu to continue yours by questioning Akebono. The merchant has little new information to share, save for a note presumably left by the perpetrator, which proudly declares that, “You have just been robbed by the Kugane Wolf Burglar!” If there was any doubt before that Inspector Hildibrand would be tempted by this case, it was extinguished in that moment, for no self-respecting inspector could abide a thief so brazen as to leave a calling card.","You and Nashu have your case, and you need only pursue it until the inspector turns up. Of course, it is entirely possible he is in another city, or at the bottom of an ocean, or still airborne...but somewhere, deep in your heart, you know he will turn up precisely when he is needed. Or precisely when he is not. Probably the latter."],"objectives":["Search the Shiokaze Hostelry for the Miqo'te girl.","Speak with Nashu.","Question the residents of Kugane.","Speak with Nashu.","Follow Nashu.","Speak with Nashu."],"dialogue":[{"name":"OKKAKE","text":"Hey, uh...hey, you're Eorzean, right? An adventurer, maybe? Good at killing and whatnot?"},{"name":"OKKAKE","text":"...Me? Oh, I'm no good at it. I mean, other than the occasional rat, but─ Ahem. I've got a job for you, if you're interested..."},{"name":"OKKAKE","text":"So there's this Miqo'te girl─this incredible, beautiful, wonderful girl─in this tavern, right? Come all the way from Eorzea like you and me. So beautiful, this girl. So beautiful..."},{"name":"OKKAKE","text":"But in this weird, strange place where people are bowing all the time and getting on the ground and tucking their legs under them, a young girl traveling by herself is in danger! Some bad, bad people could trick her and take her and make her do, you know...things..."},{"name":"OKKAKE","text":"&lt;huff&gt; &lt;puff&gt;<br>Anyway, get in there and keep her safe! I'll be watching!"},{"name":"GYODO","text":"Yes, yes, I can be of service to you, my lady..."},{"name":"GYODO","text":"I have seen this “gentlemanly Eorzean” you seek, yes, yes! And I should be glad to take you to him, if you like."},{"name":"NASHUMHAKARACCA","text":"You are ever so kind and helpful, mister talking cat!"},{"name":"GYODO","text":"Err...“catfish,” to be precise, though I care not for the Eorzean. I am Gyodo, a Namazu. And the services I provide are not free, I am sorry to say. Nor are they cheap.  Are you sure you can afford to pay?"},{"name":"NASHUMHAKARACCA","text":"Oh dear, I spent my last gil on the fare to Kugane! Is there any other way I can convince you to help?"},{"name":"NASHUMHAKARACCA","text":"Cor, if it isn't <span class=\"highlight\">Forename</span>! Don't tell me you came all this way just to help little ol' me?"},{"name":"NASHUMHAKARACCA","text":"Ah, you see, when Inspector Hildibrand took to the skies, I said, “Nashu, you'd better not let him get away this time!” and immediately began looking for ways to head as far, far east as I could─and you can't get much further east than the Far East, right?"},{"name":"NASHUMHAKARACCA","text":"I was worried I wouldn't be able to find him, but wouldn't you know it─Gyoza the talking Numa Numa here says he knows where he is!"},{"name":"GYODO","text":"(Careful, careful─this one knows our game. Escaping <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> wrath is going to take all our skills...)"},{"name":"GYODO","text":"I say, there is no need for such menacing glares! None whatsoever!"},{"name":"GYODO","text":"A thousand pardons, my lady, but I had no idea you were traveling with such esteemed company. Forget everything I said regarding the fee─now, if you will excuse me, I have a pressing engagement! Very pressing indeed!"},{"name":"NASHUMHAKARACCA","text":"Wait! You haven't told me where the inspector is yet!"},{"name":"NASHUMHAKARACCA","text":"Huh? Little Gyoza was trying to swindle me!?"},{"name":"NASHUMHAKARACCA","text":"Oh Nashu, you ought to know better than to trust a talking cat..."},{"name":"NASHUMHAKARACCA","text":"I asked lots and lots of other people if they'd seen a gentlemanly Eorzean, but none of them were any help."},{"name":"NASHUMHAKARACCA","text":"Oh, Inspector Hildibrand, wherever could you be?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Stuck in the ground or in the side of a building, like as not. Keep an eye out for legs."},{"name":"A1","text":"Following his keen inspector's sense and searching for a case?"},{"name":"NASHUMHAKARACCA","text":"Yes, he does have a habit of landing headfirst, doesn't he? Hopefully we won't need Lord Godbert's help to pull him out again..."},{"name":"NASHUMHAKARACCA","text":"Without even trying, maybe. Remember how he ended up in that snowbank, right where Gigi was? It was like the fates conspired to put him in the right place at the right time..."},{"name":"NASHUMHAKARACCA","text":"Ah, that's it! If the inspector's always on the hunt for a case, then all we've got to do is find the biggest, juiciest one we can, and wait for him to appear!"},{"name":"NASHUMHAKARACCA","text":"Let's go and see what trouble we can turn up, eh? This way!"},{"name":"NASHUMHAKARACCA","text":"I bet this town's crawling with all kinds of shifty folks up to no good. Come on, you lot! Show yourselves!"},{"name":"KYUSEN","text":"Unsolved crimes? Hmm... It so happens that a number of properties owned by wealthy merchants have been pillaged this past fortnight."},{"name":"KYUSEN","text":"Master Akebono's shop in the Rakuza District was the most recent, as I recall. But you may be assured that the Sekiseigumi will track down the thief in due time."},{"name":"AMAJI","text":"Dastardly doings and purported instances of criminal behavior? This is Kugane, my dear. We've no shortage of that here."},{"name":"AMAJI","text":"But, since you ask, the story on everyone's lips at the Bokaisen these days is that of the wealthiest among us and how they are being preyed upon by some sneak thief. Perhaps they should invest in better locks..."},{"name":"OKKAKE","text":"...Hm?"},{"name":"OKKAKE","text":"All right, all right, you've got me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span> samurai! But before you do anything rash like arrest or torture or chop me into tiny little bits with that sword of yours, know that I never touched her! I mean, I never even had the chance, I─I'm sorry!"},{"name":"OKKAKE","text":"...Oh! You're that Eorzean adventurer. I thought you looked familiar."},{"name":"OKKAKE","text":"Whew─I mean, <span class=\"emphasis\">whew</span>! For a moment there, I thought I was done for! Those Sekiseigumi don't mess about─all cut first and ask questions later, you know? No romance in their hearts. They wouldn't understand."},{"name":"OKKAKE","text":"Ah, so it's not just crimes, but big, incredible crimes you want to know about? Incidents the likes of which send ripples through time and space, through fate and destiny!?"},{"name":"OKKAKE","text":"It was five years ago─or maybe it was last week. I'm not so good with time lately. Anyway!─there I was, walking Ul'dah's bustling streets, when the sea parts and my eyes meet with those of a maiden most fair...and she stole my heart!"},{"name":"OKKAKE","text":"It was like...two grains of sand in the desert looking at each other and one of those grains knowing that it was destined to spend the rest of its life with the other grain cause she had this whole sultry scribe thing that made him so─Uuugh!"},{"name":"OKKAKE","text":"&lt;huff&gt; &lt;puff&gt;<br>...Ever since that day I've watched over her from afar. A silent guardian. A humble protector!"},{"name":"OKKAKE","text":"Some might think me mad or call me a coward for refusing to speak with her, but they are fools─fools, I say! True love is not the product of clumsy banter but careful study! Years and years of observation─of obsession!─until you know her better than she knows herself!"},{"name":"OKKAKE","text":"Perhaps, when the time is right, I shall reveal myself to her. But until that blessed day, I shall aid her from the shadows─and you, my friend, will aid her in the light!"},{"name":"KYUSEN","text":"No thief is perfect. It is only a matter of time before the Sekiseigumi bring him to justice."},{"name":"AMAJI","text":"Some might say that a man foolish enough to flaunt his wealth without taking measures to protect it deserves what he gets. Not me, of course, not me."},{"name":"NASHUMHAKARACCA","text":"Ah, there you are! Learn anything interesting?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"A skilled thief seems to be targeting wealthy merchants."},{"name":"A2","text":"A creepy little bastard who followed you to Kugane says he's been stalking you for five years."},{"name":"NASHUMHAKARACCA","text":"A series of robberies committed by a mysterious thief? Oh, that's just the thing! Well done, <span class=\"highlight\">Forename</span>!"},{"name":"NASHUMHAKARACCA","text":"Eh? Oh, you're having me on. As if I wouldn't notice. Be serious, now!"},{"name":"NASHUMHAKARACCA","text":"Our next order of business should be to track down this Akebono and ask him about the latest incident."},{"name":"NASHUMHAKARACCA","text":"Hmm... He certainly looks like a well-to-do merchant..."},{"name":"SHIGURE","text":"(-Right Proper Lad-)That fiend, that despicable rapscallion! The nerve of him to make mock of us!"},{"name":"SHIGURE","text":"(-Right Proper Lad-)My thanks to you, Master Akebono, for all your help. I swear to you on my honor that this sneak thief shall be brought to justice forthwith! And with that, I bid you good day."},{"name":"NASHUMHAKARACCA","text":"Ah, so it is Akebono! Let's go and ask him about the robbery."},{"name":"NASHUMHAKARACCA","text":"Ah!"},{"name":"SHIGURE","text":"(-Right Proper Lad-)Forgive me, my lady! In my haste, I did not see you! Are you all right? Shall I summon a healer?"},{"name":"NASHUMHAKARACCA","text":"Don't worry, I've taken bigger knocks to the noggin than that...<br>Hey, you aren't one of them samurai, are you?"},{"name":"SHIGURE","text":"Shigure─at your service, my lady!"},{"name":"SHIGURE","text":"You have my sincerest apologies for this incident. Much as I would like to make amends for my reckless behavior, I fear duty compels me to take my leave. A nefarious criminal is at large, and I must bring him to justice!"},{"name":"NASHUMHAKARACCA","text":"Oh, that's all we need─competition! Well, I'm sure Inspector Hildibrand and his faithful assistants won't lose to the likes of him!"},{"name":"NASHUMHAKARACCA","text":"That merchant must know something important for Shigure to go running off like that. Let's find out what it is!"},{"name":"NASHUMHAKARACCA","text":"Greetings and salutations, Master Akebono! My name is Nashu, agent of inquiries! Extraordinary inspector! And this is <span class=\"highlight\">Forename</span>, who's also got a knack for it. Can you tell us about the recent robbery?"},{"name":"AKEBONO","text":"Ah, inspectors? I had heard rumors that ones such as you were come from the West..."},{"name":"AKEBONO","text":"You seem an honest sort, so I will oblige your request. This very morning, one of my assistants found my establishment unlocked, and when he went inside to investigate..."},{"name":"AKEBONO","text":"He discovered that my most prized possessions had been stolen! To make matters worse, in their place he found this message..."},{"name":"SYSTEM","text":"(-Mysterious Note-)\"You have just been robbed by the Kugane Wolf Burglar!“"},{"name":"NASHUMHAKARACCA","text":"...<span class=\"emphasis\">Wolf</span> Burglar?"},{"name":"AKEBONO","text":"Surely you've heard about his recent exploits? Similar calling cards were found at the scene of the other robberies. &lt;sigh&gt; And now I too have become a victim."},{"name":"NASHUMHAKARACCA","text":"A series of robberies committed by a thief with a calling card? Oh, there's no way Inspector Hildibrand's going to be able to resist the lure of this case!"},{"name":"AKEBONO","text":"Err...I thought the two of you were inspectors...but it makes no difference to me who catches the criminal, and since the Sekiseigumi seem to be at a loss..."},{"name":"AKEBONO","text":"You will be generously rewarded for any information that leads to the recovery of my stolen property. I wish you well in your investigation."},{"name":"NASHUMHAKARACCA","text":"All we've got to do now is stick with this case, and we'll be reunited with Inspector Hildibrand─I just know it!"},{"name":"NASHUMHAKARACCA","text":"Call it my, er...my keen inspector's assistant sense!"},{"name":"NASHUMHAKARACCA","text":"Anyway, I'm going to try and learn more about the other robberies. If you learn anything interesting, come and find me!"},{"name":"JIMAKU","text":"Nashu Mhakaracca is on the case! Look out, Mister Wolf Burglar!"},{"name":"JIMAKU","text":"Your days of...your days of wolf burglaring are numbered!"},{"name":"JIMAKU","text":"Cause Inspector Hildibrand─ Huh, is that a green rooster?"},{"name":"JIMAKU","text":"It's Inspector Hildibrand! Hey, Inspector! Stop messing about and join us!"},{"name":"NASHUMHAKARACCA","text":"Cor, it's been too long since I've had a chance to whip up a batch of Nashu's Delights. You can be sure I'll be putting these little darlings to good use next time!"},{"name":"NASHUMHAKARACCA","text":"Oh, bugger. Good thing I've got plenty more stashed away!"}],"reward":{"gil":1116,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[67908,68089]},"next":[68556]},"partials":[{"type":"npc","id":"1024349","obj":{"i":1024349,"n":"Conspicuously Inconspicuous Man","l":2404,"q":1}},{"type":"npc","id":"1024355","obj":{"i":1024355,"n":"Nashu Mhakaracca","l":2404,"q":2}},{"type":"npc","id":"1019000","obj":{"i":1019000,"n":"Kyusen","l":2404,"q":1}},{"type":"npc","id":"1019034","obj":{"i":1019034,"n":"Amaji","l":2404,"q":2}},{"type":"npc","id":"1020473","obj":{"i":1020473,"n":"Gyodo","l":2404,"q":2}},{"type":"npc","id":"1024350","obj":{"i":1024350,"n":"Nashu Mhakaracca","l":2404,"q":1}},{"type":"npc","id":"1024351","obj":{"i":1024351,"n":"Nashu Mhakaracca","l":2404,"q":2}},{"type":"npc","id":"1024352","obj":{"i":1024352,"n":"Nashu Mhakaracca","l":2404,"q":1}},{"type":"npc","id":"1024409","obj":{"i":1024409,"n":"Conspicuously Inconspicuous Man","l":2404,"q":1}},{"type":"quest","id":"67908","obj":{"i":67908,"n":"If I Could Turn Back Time","g":69,"l":"The Dravanian Forelands","s":37,"f":1}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}},{"type":"quest","id":"68556","obj":{"i":68556,"n":"Life Imitates Art Imitates Life","g":70,"l":"Kugane","s":20,"f":1}}]}