{"quest":{"name":"None Forgotten, None Forsaken","location":"Rhalgr's Reach","id":68541,"patch":4.1,"sort":1000,"unlocksFunction":1,"eventIcon":71341,"issuer":1019459,"target":1020337,"genre":103,"journal":["Galiena is on the lookout for an enterprising adventurer."],"objectives":["Speak with M'naago."],"dialogue":[{"name":"GALIENA","text":"I heard from Aunt Rowena that you're quite the artisan. If that's true, I've got a proposition for you."},{"name":"GALIENA","text":"As I mentioned before, we like to think that our relationship with the people of the Reach is mutually beneficial. We create jobs and opportunities for people to live better lives."},{"name":"GALIENA","text":"Perhaps you know M'naago, one of the leaders of the Resistance? She not only agrees with what I said, but has even taken a personal interest in the collectables trade."},{"name":"GALIENA","text":"But while I'm sure she's a brilliant soldier with a head for tactics, the collectables market is an altogether different battlefield..."},{"name":"GALIENA","text":"Still, with the help of a few good crafters and gatherers, I'm sure she'll find her footing in no time."},{"name":"GALIENA","text":"That's where you come in─if you want to, that is. Go and see her if you're interested. Or don't."},{"name":"GALIENA","text":"M'naago's just getting her feet wet, so she could use all the help she can get. I won't twist your arm, but if you're worried in the slightest, you should go and see her."},{"name":"MNAAGO","text":"Good to see you, <span class=\"highlight\">Forename</span>. If you're looking for Lyse..."},{"name":"MNAAGO","text":"Eh? Who told you I'd taken an interest in the collectables trade?"},{"name":"MNAAGO","text":"...I'm surprised. I knew you were many things, but an accomplished artisan was not one of them."},{"name":"MNAAGO","text":"We would've been fools to turn you away when you offered to help the Resistance, and I'd be a fool to do it now."},{"name":"MNAAGO","text":"You're probably wondering why I decided to try my hand at a different trade. Truth is, it's not for me, but for the ones who couldn't be here today..."},{"name":"MNAAGO","text":"The ones who aren't here to see what we've accomplished. A free Ala Mhigo. A new beginning. A new future."},{"name":"MNAAGO","text":"After we defeated Zenos and the XIIth, I thought long and hard about what I ought to do next."},{"name":"MNAAGO","text":"I was with the relatives of some of the dead in Recompense when I realized...I had lost comrades, but them? They'd lost husbands and wives. Mothers and fathers. Breadwinners. Every day would be harder than the last."},{"name":"MNAAGO","text":"We'd won them freedom, aye. The freedom to be poor and die starving. Where's the justice in that?"},{"name":"MNAAGO","text":"So I decided I'd do something about it. I'd establish a fund for the widows and the orphans─our way of giving a little back in honor of those who gave us their all."},{"name":"MNAAGO","text":"There was just one problem: I don't know the first thing about making gil. Other than soldiering, my only other talent was hunting─and I'll not raise more than a fraction of what I need selling pelts."},{"name":"MNAAGO","text":"But when little Galiena told me about collectables and the prices people were willing to pay, I knew I'd found the answer."},{"name":"MNAAGO","text":"I'll not deny I've got a lot to learn, but I'm ready and willing to give it my all. So what say you? Up for helping me fill custom orders for a good cause?"},{"name":"MNAAGO","text":"'Course, I'll not ask you to do it for free. You'll get your cut─scrips good with any of the House's people."},{"name":"MNAAGO","text":"Glad to have you on board. First order of business: I'm in the market for some Gyr Abanian souvenirs."},{"name":"MNAAGO","text":"Since the liberation of Ala Mhigo, trade with other regions has been steadily increasing. Commodities people had to struggle to get are easier to obtain, and people are getting a taste for more and more─Gridanians in particular."},{"name":"MNAAGO","text":"Heh heh, I've got a feeling this is going to be the start of something special!"}],"reward":{"items":[{"id":12861},{"id":12866}],"xp":83700},"reqs":{"jobs":[{"lvl":60,"id":35}],"questsType":"all","quests":[68508,68477]},"next":[68542,68675]},"partials":[{"type":"npc","id":"1019459","obj":{"i":1019459,"n":"Galiena","l":2403,"q":3}},{"type":"npc","id":"1020337","obj":{"i":1020337,"n":"M'naago","l":2403,"q":7}},{"type":"item","id":"12861","obj":{"i":12861,"n":"Baked Onion Soup","l":125,"c":24116,"t":46}},{"type":"item","id":"12866","obj":{"i":12866,"n":"Stuffed Cabbage Rolls","l":125,"c":24206,"t":46,"p":891}},{"type":"quest","id":"68508","obj":{"i":68508,"n":"Return of the Bull","g":7,"l":"The Lochs","s":11}},{"type":"quest","id":"68477","obj":{"i":68477,"n":"Reach Long and Prosper","g":0,"l":"Rhalgr's Reach","s":0,"f":1}},{"type":"quest","id":"68542","obj":{"i":68542,"n":"Not While Their Names Are Still Spoken","g":103,"l":"Rhalgr's Reach","s":1005,"f":1}},{"type":"quest","id":"68675","obj":{"i":68675,"n":"The Seaweed Is Always Greener","g":107,"l":"Kugane","s":1000,"f":1}}]}