{"quest":{"name":"Not While Their Names Are Still Spoken","location":"Rhalgr's Reach","id":68542,"patch":4.1,"sort":1005,"unlocksFunction":1,"eventIcon":71341,"issuer":1020337,"target":1020337,"involved":[1020805,1020806,1021565,1024394,1024395,1024443,1024444,1024455,1024508],"genre":103,"journal":["M'naago is ready to depart when you are."],"objectives":["Speak with M'naago in Ala Ghiri.","Speak with M'naago in the Ala Mhigan Quarter.","Speak with M'rahz Nunh in the Peering Stones.","Speak with M'naago in Rhalgr's Reach."],"dialogue":[{"name":"MNAAGO","text":"So you're ready, then? Good. This is long overdue. We'll start by paying a visit to Meffrid's widow."},{"name":"MNAAGO","text":"She's living in Ala Ghiri...with her daughter. I'll need a moment to gather my things, so go on ahead and I'll meet you there."},{"name":"MNAAGO","text":"No need to wait for me, <span class=\"highlight\">Forename</span>. I'll catch up to you on the road to Ala Ghiri."},{"name":"GEILA","text":"I don't know what this is about, but make it quick. I'm needed back at the shop."},{"name":"MEFFRIDSDAUGHTER","text":"Who are you?"},{"name":"MNAAGO","text":"This is Geila and her little girl. I asked them to meet us here so we might have a bit of privacy..."},{"name":"GEILA","text":"...Put that away. I'll not pretend we've got it easy, but I never asked for anyone's charity."},{"name":"GEILA","text":"Least of all his. Our marriage, such as it was, ended ages ago."},{"name":"MNAAGO","text":"But...but I...I don't understand!"},{"name":"GEILA","text":"What is there to? He said he wanted to fight the good fight, but was afraid of “putting us in danger.” Was all bollocks, and we both knew it at the time."},{"name":"GEILA","text":"Fighting for your homeland sounds noble, it does, but it was nothing more than an excuse to not be beholden to his wife and daughter any longer."},{"name":"MNAAGO","text":"You're wrong about him...and I can prove it. There's something else I brought for you."},{"name":"GEILA","text":"What is this? A charm?"},{"name":"MNAAGO","text":"Meffrid's. He was holding it when he died. <span class=\"highlight\">Forename</span> can attest to that."},{"name":"MNAAGO","text":"Not a ward of the Destroyer, but a hand-carved wooden charm. With the faces of a mother and a child..."},{"name":"MNAAGO","text":"Don't you see? What mattered to him most in those final moments wasn't his homeland or his faith! It was...it was..."},{"name":"GEILA","text":"Meffrid..."},{"name":"MNAAGO","text":"I...that's what I believe, at least. But I won't presume to claim I know him better than you did. I do know he'd want you to have this money, though─if not for yourself, for your little girl."},{"name":"GEILA","text":"Thank you. For everything. I'll be sure to put it to good use."},{"name":"MNAAGO","text":"Ala Ghiri saw more than its fair share of imperial soldiers during the occupation. No one with any ties to the Resistance was safe here. I imagine that played a part in the decisions Meffrid made."},{"name":"MNAAGO","text":"Who knows why he never told us. For their sake, or for his. Maybe both. No use dwelling on it."},{"name":"MNAAGO","text":"From here we've got to continue east to see Conrad's widow. He had her hiding in an abandoned village deep in the mountains for some time, but now that the occupation's ended, there's no need for that."},{"name":"MNAAGO","text":"She's living in the Ala Mhigan Quarter at present. I'll lead the way."},{"name":"MNAAGO","text":"Oh! Uh, fancy seeing you here. Ahem. Anyway, as I said, Conrad's widow is living in the Ala Mhigan Quarter outside the city now. I'll meet you there."},{"name":"GREDE","text":"<span class=\"highlight\">Forename</span>, yes? I knew you at once."},{"name":"MNAAGO","text":"This is Grede. She's been waiting a long time to meet us..."},{"name":"GREDE","text":"I've heard stories about your fund and what you've done for the families of the fallen. It's good work you're doing, and Conrad would be proud."},{"name":"GREDE","text":"And you must be <span class=\"highlight\">Forename</span>. I'm grateful to you beyond measure for what you did for my husband and for our homeland."},{"name":"MNAAGO","text":"There's no need to stand on our account! Please, take a seat."},{"name":"GREDE","text":"Told you about my legs, did he? Well, I'm not too proud to say no."},{"name":"GREDE","text":"He told me a lot about you too, M'naago. Enough that I'm half-tempted to call you Naago, even though he didn't. It's a pleasure to finally meet you."},{"name":"GREDE","text":"We never had a child of our own, and yet...the way his face would light up when he spoke of you and your mischief, like a father boasting about his little girl...I couldn't help but think of you in that way too, sometimes."},{"name":"MNAAGO","text":"He was a father to us all, in a way, and we're all better for his guidance. I wish I could've done more to repay the favor when he was alive─or to you, now, but all I've got to offer is that gil and my gratitude..."},{"name":"GREDE","text":"You've all done so much more than you realize. You've changed people, spurred them to strive to be better. Like the young man who's been helping me. Ah, speaking of which..."},{"name":"HRUDOLF","text":"(-Humble Youth-)Missus Grede, I've went and bought those things you wanted..."},{"name":"MNAAGO","text":"Wait, I know that voice...but from where?"},{"name":"MNAAGO","text":"Specula Imperatoris! You were the one speaking for the Skulls! But how? I thought you all died in the main tower!"},{"name":"HRUDOLF","text":"You're... You've got good ears. Aye, you're right. I'm Hrudolf, and I was one of the Crania Lupi."},{"name":"HRUDOLF","text":"Don't remember much of it, when the tower came down. Hit my head or something. All I remember was waking up beneath a pile of rubble, lucky to be alive."},{"name":"MNAAGO","text":"...Fair enough. But tell me why you would come here."},{"name":"HRUDOLF","text":"Where else could I go? Apparently the imperials were willing to kill me, and the Resistance weren't like to treat me any better, I reckoned. Best chance I had was to take off my uniform and join this lot."},{"name":"HRUDOLF","text":"Had no idea what had happened, to be honest. Wasn't till later that I learned Commander Kemp himself had died in the battle."},{"name":"HRUDOLF","text":"Didn't know much about the man, other than that he was the leader of the Resistance. That he had a wife named Grede who'd gone into hiding. That he died because he wanted me and my comrades to live."},{"name":"HRUDOLF","text":"I owed him, so I sought her out and did what I could. It'd never make up for it, I knew, but it was better than nothing. A way to pass the time until you found me..."},{"name":"GREDE","text":"Earnest to a fault, isn't it? It's like the moment he took off the mask, he couldn't hold anything back."},{"name":"GREDE","text":"After all the effort Conrad went through to save his life, I thought it'd be a shame for it to go to waste. So I accepted his help."},{"name":"HRUDOLF","text":"I knew it couldn't last. That you'd find me, one day. I'm unarmed─I surrender. Do with me what you will."},{"name":"MNAAGO","text":"Got nothing to do. Way I see it, the Skulls died that day in the tower."},{"name":"HRUDOLF","text":"But...but why would you..."},{"name":"MNAAGO","text":"'Cause sometimes you've got to try <span class=\"emphasis\">not</span> hitting the other person back. Otherwise we'll all have bruised knuckles and bloody noses."},{"name":"HRUDOLF","text":"I... I don't know what to say... Thank you."},{"name":"GREDE","text":"I appreciate you agreeing to look the other way. Conrad would too, I'd like to think."},{"name":"MNAAGO","text":"He wanted to give them another chance. It's not my place to take it away..."},{"name":"MNAAGO","text":"&lt;sniffle&gt; Godsdamned dust, getting in my eyes..."},{"name":"GREDE","text":"We honor the dead by living well. By carrying on their legacy, as in many ways you carry on Conrad's."},{"name":"GREDE","text":"But we mustn't forget to spend time with the people dearest to us while we can. You still have both your parents, yes? You ought to go and see them. I'm sure they think about you every day."},{"name":"MNAAGO","text":"Yes, I...I'll do just that."},{"name":"MNAAGO","text":"It's on the way back, so if it's all right with you, I'd like to pay a visit to the Peering Stones."},{"name":"MNAAGO","text":"Thanks. It's been too long since I saw my mother and father..."},{"name":"MNAAGO","text":"Err...didn't expect to see you here. Had some things to take care of. I'll see you in the Peering Stones, eh?"},{"name":"GREDE","text":"It was very kind of you and M'naago to bring me this money, but I'd like to think there are other, better ways how it might be put to good use. But I'll see to that myself, worry not."},{"name":"HRUDOLF","text":"Today might not have been the day, but I know I've got it coming. I'll be ready when it does."},{"name":"MRAHZNUNH","text":"Oho, there she is! The pride of the M tribe! I only wish you had sent word in advance so we could have begun preparations for the feast!"},{"name":"MNAAGO","text":"Please, Father, we're only here for a short time─we had business in the Peaks. And I'll thank you to stop with the pride of the tribe rubbish!"},{"name":"MRAHZNUNH","text":"Now, now, what's the world come to if a father can't dote on his daughter? And besides, it's true! You ought to know by now how much your sisters look up to you."},{"name":"MZALIKKO","text":"Aye, aye, it's nothing but, “Look at Naago, going out and getting things done, moving up the ranks in the Resistance, bringing honor to the M tribe.”"},{"name":"MZALIKKO","text":"People'll be telling that story for years, you know. How you rode Obda through a storm of cannon fire to the top of Velodyna with nothing but a satchel of glamour prisms and won the day!"},{"name":"MZALIKKO","text":"Pity you've got no skills other than soldiering, though. Your cooking's especially bad─"},{"name":"MHAHTOA","text":"..."},{"name":"MZALIKKO","text":"Ah, meant to ask─ Father, we're short of wood for arrows. Meant to go and gather some myself, but I wasn't sure where I ought to search..."},{"name":"MRAHZNUNH","text":"Gather? Child, you should have learned by now that you'll have little luck finding suitable trees near our village. Better to trade for the wood."},{"name":"MNAAGO","text":"You know, I started a fund for the widows and orphans of the Resistance soldiers who died in battle..."},{"name":"MNAAGO","text":"We've raised a great deal of gil through the collectables trade, and in the process I've made friends with a lot of merchants. If there's anything the village lacks, maybe I could use those connections to get you what you need?"},{"name":"MRAHZNUNH","text":"So little Naago has taken up a new trade? Hmm...if I had to choose between bartering with a stranger in Ala Ghiri, or relying on my own daughter, then it is hardly a choice at all..."},{"name":"MNAAGO","text":"I'll be in touch, then. I promise you won't regret this!"},{"name":"MNAAGO","text":"Right. We should hurry back to the Reach. With me, <span class=\"highlight\">Forename</span>!"},{"name":"MRAHZNUNH","text":"Even if I must usually content myself with only hearing that she is hale and healthy, it will always be far preferable to see her in the flesh."},{"name":"MHAHTOA","text":"As long as she is happy and content, so am I. I learned long ago not to try and dictate the course of my children's lives."},{"name":"MZALIKKO","text":"Honestly, if she put her mind to it, she could probably become a passable cook. It's not that she can't be bothered─I think she refuses to learn on principle."},{"name":"MNAAGO","text":"Thanks again for accompanying me, <span class=\"highlight\">Forename</span>. I know it ended up being a lot more complicated than expected..."},{"name":"MNAAGO","text":"Right, then. I promised my father I'd help the village, and I mean to do just that. I'm in the market for sundry goods, and if you could help, I'd be most grateful."},{"name":"MNAAGO","text":"You'll still get your bit, as will the fund. Everyone'll be happy in the end─you've my word on that."},{"name":"MNAAGO","text":"I'm counting on you, partner!"}],"reward":{"items":[{"id":12863},{"id":12867}],"xp":83700},"reqs":{"jobs":[{"lvl":60,"id":35}],"quests":[68541]}},"partials":[{"type":"npc","id":"1020337","obj":{"i":1020337,"n":"M'naago","l":2403,"q":7}},{"type":"npc","id":"1020805","obj":{"i":1020805,"n":"M'zalikko","l":2406,"q":1}},{"type":"npc","id":"1020806","obj":{"i":1020806,"n":"M'hahtoa","l":2406,"q":2}},{"type":"npc","id":"1021565","obj":{"i":1021565,"n":"M'rahz Nunh","l":2406,"q":7}},{"type":"npc","id":"1024394","obj":{"i":1024394,"n":"Geila","l":2407,"q":1}},{"type":"npc","id":"1024395","obj":{"i":1024395,"n":"Grede","l":2408,"q":1}},{"type":"npc","id":"1024443","obj":{"i":1024443,"n":"M'naago","l":2407,"q":1}},{"type":"npc","id":"1024444","obj":{"i":1024444,"n":"M'naago","l":2408,"q":1}},{"type":"npc","id":"1024455","obj":{"i":1024455,"n":"Wide-eyed Child","l":2407,"q":1}},{"type":"npc","id":"1024508","obj":{"i":1024508,"n":"Hrudolf","l":2408,"q":1}},{"type":"item","id":"12863","obj":{"i":12863,"n":"Emerald Soup","l":139,"c":24101,"t":46}},{"type":"item","id":"12867","obj":{"i":12867,"n":"Dhalmel Gratin","l":133,"c":24112,"t":46}},{"type":"quest","id":"68541","obj":{"i":68541,"n":"None Forgotten, None Forsaken","g":103,"l":"Rhalgr's Reach","s":1000,"f":1}}]}