{"quest":{"name":"The Sword in the Store","location":"Kugane","id":68559,"patch":4.2,"sort":13,"eventIcon":71201,"issuer":1024727,"target":1019061,"involved":[1024728,1024731,1024732,1024733,1024734,1024735,1024737,1024738,1025093],"genre":7,"journal":["Alphinaud is eager to find the pawnbroker."],"objectives":["Search for the master of Shofuku Shichiten on Kogane Dori.","Speak with Ume at the Umineko Teahouse."],"dialogue":[{"name":"YUGIRI","text":"Is it not strange that we should be compelled to turn to one who betrayed both you and Gosetsu to the Empire? I would say the fates made mock of us...had I not met Hancock."},{"name":"ALPHINAUD","text":"Everything in order? Then let us proceed to Kogane Dori and find the master of Shofuku Shichiten."},{"name":"ALPHINAUD","text":"Simply utter the word “pawnbroker,” and a score of them gather around you. Finding our man may not be quite as simple as I thought."},{"name":"YUGIRI","text":"I have yet to identify the pawnbroker in question. Have your inquiries proven any more fruitful?"},{"name":"ROUGHPAWNBROKER03023","text":"A Roegadyn samurai and a maiden? Never seen 'em. Now, if you don't have any business with me, make way for someone who does!"},{"name":"SYSTEM","text":"This doesn't seem to be the pawnbroker you seek."},{"name":"SMILEPAWNBROKER03023","text":"Hmm...we <span class=\"emphasis\">might</span> have had customers like those you describe. So many people come through, it's difficult to remember. Perhaps you could jog my memory by making a purchase? ...No? Well, you can't blame a woman for trying! Heh heh!"},{"name":"SYSTEM","text":"This doesn't seem to be the pawnbroker you seek."},{"name":"PAWNBROKER03023","text":"Welcome, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, welcome. Will you be buying or...?"},{"name":"PAWNBROKER03023","text":"Ah, so you have heard tell of the Roegadyn samurai's katana. Small wonder─it is a fine example of its kind. One moment..."},{"name":"ALPHINAUD","text":"Dare I hope you have found our pawnbroker?"},{"name":"ALPHINAUD","text":"Excellent work, <span class=\"highlight\">Forename</span>. And that is the katana?"},{"name":"YUGIRI","text":"There can be no doubt. It is Gosetsu's blade."},{"name":"PAWNBROKER03023","text":"(-Master of Shofuku Shichiten-)The craftsmanship is exquisite, is it not? And you will be pleased to know that the pledge has just expired."},{"name":"PAWNBROKER03023","text":"(-Master of Shofuku Shichiten-)I should be glad to sell it to you...assuming you have the coin. This is no ordinary weapon, you understand, and it is priced accordingly. But if you are serious, I suggest you act quickly, as several noted collectors have already expressed an interest."},{"name":"YUGIRI","text":"Hmm... The blade represents conclusive proof of Gosetsu's survival. I suppose this <span class=\"emphasis\">could</span> be considered a necessary cost in securing his safe return...<br>Yet it is not a decision I can make alone─least of all when our nation has scarce begun to rebuild."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll pay."},{"name":"A1","text":"I could lend you the coin."},{"name":"YUGIRI","text":"Nay, my friend. Grateful though I am for the offer, I cannot ask this of you. It is enough to know that Gosetsu is alive and well."},{"name":"YUGIRI","text":"Nay, my friend. Grateful though I am for the offer, I cannot ask this of you. It is enough to know that Gosetsu is alive and well."},{"name":"ALPHINAUD","text":"Yugiri, wait. The Scions will buy the katana. Pray consider it a gift."},{"name":"YUGIRI","text":"M-Master Alphinaud, your kindness is touching, truly. Yet, in matters of coin, would Mistress Tataru not expect to be consulted?"},{"name":"ALPHINAUD","text":"Come now. Our friend would never have relinquished his blade were the need not great. And are we not bound by honor to help a friend in need? I say we are─and I am sure Tataru will wholeheartedly agree."},{"name":"PAWNBROKER03023","text":"(-Master of Shofuku Shichiten-)It's settled, then! You have made a wise choice, my friend─such pieces are few and far between! Now, if you would be so good as to come this way, I shall prepare the necessary papers."},{"name":"YUGIRI","text":"If I may ask, sir, after he visited your establishment, do you perchance know where the old samurai went? He is our friend, and we would return his weapon to him."},{"name":"PAWNBROKER03023","text":"(-Master of Shofuku Shichiten-)A friend of yours, you say? I see. <span class=\"emphasis\">Well then</span>, I suppose there can be no harm in telling you. No sooner had I provided him with the requested sum than his pretty young companion began clamoring for dango. I duly recommended those served at the Umineko Teahouse, and thither did they set off."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">...Clamoring for dango</span>? Can these truly be the same people? It makes no sense."},{"name":"YUGIRI","text":"Some manner of code, perhaps. But it avails us naught to speculate. Let us go to this teahouse and see if we can pick up their trail."},{"name":"PAWNBROKER03023","text":"If you're looking for your friends, you could do worse than try the Umineko Teahouse. I make no guarantees of course..."},{"name":"ALPHINAUD","text":"This is the proprietor of the teahouse. Let us find out what she knows."},{"name":"YUGIRI","text":"The Gosetsu I knew had little time for teahouses... No wine."},{"name":"UME","text":"But of course I remember! How could I forget a pair like that? The most beautiful girl you'll ever see, scoffing down dango as if her life depended on it while the old samurai looked on. Not quite what he expected, I'll wager!"},{"name":"UME","text":"Far be it from me to gossip about my customers, but he was planning to spirit her away across the Ruby Sea─out of the reach of her family, no doubt. When the girl had finally had her fill, they set off in the direction of the Shiokaze Hostelry, presumably to find someone discreet with a boat."},{"name":"YUGIRI","text":"So Gosetsu makes for Doma."},{"name":"YUGIRI","text":"But this woman who travels with him... The more I hear about her, the more I wonder if she can truly be Yotsuyu."}],"reward":{"gil":715,"items":[{"id":9738}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68558]},"next":[68560]},"partials":[{"type":"npc","id":"1024727","obj":{"i":1024727,"n":"Alphinaud","l":2404,"q":2}},{"type":"npc","id":"1019061","obj":{"i":1019061,"n":"Ume","l":2404,"q":2}},{"type":"npc","id":"1024728","obj":{"i":1024728,"n":"Yugiri","l":2404,"q":2}},{"type":"npc","id":"1024731","obj":{"i":1024731,"n":"Pleasant Pawnbroker","l":2404,"q":1}},{"type":"npc","id":"1024732","obj":{"i":1024732,"n":"Perky Pawnbroker","l":2404,"q":1}},{"type":"npc","id":"1024733","obj":{"i":1024733,"n":"Pushy Pawnbroker","l":2404,"q":1}},{"type":"npc","id":"1024734","obj":{"i":1024734,"n":"Alphinaud","l":2404,"q":1}},{"type":"npc","id":"1024735","obj":{"i":1024735,"n":"Yugiri","l":2404,"q":1}},{"type":"npc","id":"1024737","obj":{"i":1024737,"n":"Alphinaud","l":2404,"q":2}},{"type":"npc","id":"1024738","obj":{"i":1024738,"n":"Yugiri","l":2404,"q":2}},{"type":"npc","id":"1025093","obj":{"i":1025093,"n":"Master Of Shofuku Shichiten","l":2404,"q":1}},{"type":"item","id":"9738","obj":{"i":9738,"n":"Green Tea Set","l":55,"c":53058,"t":78}},{"type":"quest","id":"68558","obj":{"i":68558,"n":"Tidings from the East","g":7,"l":"Rhalgr's Reach","s":12}},{"type":"quest","id":"68560","obj":{"i":68560,"n":"Hope on the Waves","g":7,"l":"Kugane","s":14}}]}