{"quest":{"name":"Of Wolves and Gentlemen","location":"The Ruby Sea","id":68557,"patch":4.25,"sort":30,"icon":100766,"unlocksFunction":1,"eventIcon":71341,"issuer":1024710,"target":1024708,"involved":[1019166,1024707,1024713,1024715,1024716,1024717,1024719,1024720,1024722,1024723,1024724,1024725],"genre":70,"journal":["Shigure is chiding himself for overlooking the obvious answer.","Even if the Wolf Burglar managed to pass through the Ruby Price unnoticed, he will have had to contend with the Confederacy, which has a vested interest in forcing all who traverse their waters to pay the tithe. Sakazuki is the first stop for most travelers who do not wish to risk the ire of the pirates, so it is the ideal place to continue your search.","A suspicious individual in a skiff was spotted not long ago, it seems, but the pirate who spied him was reluctant to stop him on account of the stranger being bereft of life. Dead, deceased. An ex-man, as it were. Not one to consort with the undead, the pirate took what he deemed was the only reasonable course of action and looked the other way. But you, on the other hand...","Shigure scoffs at the pirate's account, but his disdain soon turns to delight as he concludes that the corpse was in fact <span class=\"emphasis\">The Eoruzean Gentleman</span>, and the skiff was that of the Wolf Burglar. Their destination appeared to be the Isle of Bekko, and so it is now yours.","In a twist that you really ought to have seen coming, the dead man who was sighted aboard the small skiff really was in fact a dead man─A Gentle Dead Man, to be precise. Having heard rumors of a contingent of fellow undead on a certain island in the Sirensong Sea, he embarked on a grand journey...only to find at his destination the various skeletons wholly devoid of unlife, owing to your prior intervention. After gently chiding you for your propensity for violence against the undead, he further explains that he continued on to the Far East after sensing the presence of Master Zombibrand, for whom he is still searching. Oh, and somewhere along the way he acquired some werewolf attire, because life is funny like that.","With the aid of the Gentle Dead Man, you finally catch up to the Wolf Burglar, as he flees across the Isle of Bekko with a still-frozen Inspector Hildibrand on his back. Resolving once more to restore her mentor to the land of the moving, Nashu draws forth a set of her infamous Delights and heaves them into the inspector's waiting arms. The resulting explosion leaves the awakened Hildibrand and the annoyed Wolf Burglar clinging to opposite sides of a rocky bridge, the ground far below promising a swift and painful death. Nashu assures you, however, that the inspector will surely survive the fall, having lived through the rather more harrowing experience of returning to the star from the false moon, Dalamud. And so you all prepare to seize the Wolf Burglar and bring him to justice at last, only to watch helplessly as he escapes astride a giant bird of prey that swoops in at the last moment to catch him, in yet another twist that you really ought to have seen coming. Shortly thereafter, Inspector Hildibrand rejoins you atop the cliffs, albeit for only an instant, as his keen inspector's sense alerts him to a petitioner in need not far away.","You find Inspector Hildibrand conversing with a wayward Qiqirn, who claims to be a sailor on a ship belonging to the East Aldenard Trading Company. It would seem that he and his fellow Qiqirn were lured by promises of delicious foodstuffs into a dark alley, where they were set upon by men who bound and gagged his friend. Though he himself managed to escape by jumping into the sea, the current carried him to the island, and he knows not what became of his comrade─but you do. Indeed, in all likelihood he is the Qiqirn you saw at the auction─the selfsame auction where Inspector Hildibrand was nearly sold as a statue. Perhaps the silver-tongued broker who organized the auction is not all that he seems...","The broker is flustered by the sight of the inspector living and breathing, but regains his composure when Shigure attempts to detain him for his many crimes, countering that the samurai has no right to do so. Indeed, he does not, for Shigure is no more than a common ronin with no ties to the Sekiseigumi─a ronin whom the broker hired to guard the auction which was robbed by the Wolf Burglar. Though Inspector Hildibrand reiterates that the broker's crimes are impossible to deny, it seems he will escape justice...until a man of the Sekiseigumi steps forward and asserts his own authority, placing the broker under arrest. The samurai thanks Shigure for his efforts, only to then chastise him for his recklessness, stating that he still cannot in good conscience permit him to join their ranks. After the samurai and the others depart, Shigure confesses how he came to Kugane to pursue his dream of joining the Sekiseigumi, only to fail and struggle to make ends meet. By bringing the Wolf Burglar to justice, he hopes to convince the Sekiseigumi to reconsider their decision. This simple, earnest desire is apparently enough to win over Inspector Hildibrand, who declares then and there his intention to help Shigure capture the Wolf Burglar, before dashing off to kami know where with his characteristic gusto.","Though Shigure is grateful for Inspector Hildibrand's promise of assistance, he suspects he may come to rely more upon you in the future. The Wolf Burglar is no common criminal and is possessed of great cunning and cleverness, and sheer passion and determination will surely not suffice to catch him. But if passion is what it will take to win the day, you can count on <span class=\"emphasis\">The Eoruzean Gentleman</span> to deliver!"],"objectives":["Speak with Ihaki.","Speak with Shigure.","Search the Isle of Bekko for the Wolf Burglar.","Speak with the Gentle Dead Man.","Speak with Hildibrand.","Speak with the silver-tongued broker.","Speak with Shigure."],"dialogue":[{"name":"NASHUMHAKARACCA","text":"That there tower just keeps on going and going and going..."},{"name":"SHIGURE","text":"Oh, how silly of me. The Confederacy has every reason to note the comings and goings of even the smallest vessels in the Ruby Sea."},{"name":"SHIGURE","text":"Their very survival rests on their ability to extract payments for safe passage─the so-called Ruby Tithe."},{"name":"SHIGURE","text":"Sakazuki is where we must go. Any traveler who does not wish to be raided and relieved of their possessions must journey there first and make the necessary overtures..."},{"name":"SHIGURE","text":"By the kami... I am no wealthy merchant! Be reasonable, I beg of you!"},{"name":"NASHUMHAKARACCA","text":"If you squint just the right way, it looks like it's got ears! Or is it horns...?"},{"name":"IHAKI","text":"Searching for a bandit on a boat, you say? As far as I am concerned, the only bandits are those who refuse to pay the tithe─like that one fellow I spotted not long ago."},{"name":"IHAKI","text":"Why didn't I stop him, you ask? Because he was dead! Aye, standing motionless in his skiff, paying no heed to the waves or the waters. A dead man drifting!"},{"name":"IHAKI","text":"It is one thing to threaten a living man, but what could I possibly do to stop a dead one? Nothing, that is what! So I took the only reasonable course of action: I let him be!"},{"name":"IHAKI","text":"I am not one to consort with the dead, but if you are, by all means, follow the man to the Isle of Bekko. I will remain here and do my best to forget what I saw."},{"name":"IHAKI","text":"I know an ill omen when I see one, and that dead man in a boat was as ill an omen as can be!"},{"name":"SHIGURE","text":"A dead man in a boat bound for the Isle of Bekko? That's the stupidest thing I ever─ Unless... Ah hah! Don't you see? He mistook <span class=\"emphasis\">The Eoruzean Gentleman</span> for a corpse! That boat belonged to none other than the Kugane Wolf Burglar!"},{"name":"NASHUMHAKARACCA","text":"Cor, what luck!"},{"name":"SHIGURE","text":"Our liaison did mention that we could pay the tithe by way of bringing a trespasser to justice, and I do believe this qualifies!"},{"name":"SHIGURE","text":"The hunt is on! To the Isle of Bekko, and that thrice-damned wolf!"},{"name":"NASHUMHAKARACCA","text":"Hark! Over there, a wolf! Or at least someone what's got big ears and a long fluffy tail!"},{"name":"SHIGURE","text":"Ah hah! We've got him now!"},{"name":"SHIGURE","text":"So! It seems the Wolf Burglar was caught by the very people that were trying to catch him!"},{"name":"SHIGURE","text":"Kami forfend! This is no Wolf Burglar! This is a man dead who yet moves! A restless spirit bound to this mortal coil by burdens of the soul!?"},{"name":"ZOMBIEA","text":"I beg your pardon, good sir, but my soul carries no such burdens. Indeed, in death I found rather more liberation than I had in life. More purpose and meaning. And brotherhood!"},{"name":"NASHUMHAKARACCA","text":"Wait a minute! You're one of the Gentle Dead Men! But what are you doing so far from Eorzea and the others?"},{"name":"ZOMBIEA","text":"As I live and breathe! In even further reaches I find myself reunited with Master Zombibrand's compatriots! I too must confess some curiosity as to how you came to this place, but since you asked first..."},{"name":"ZOMBIEA","text":"As unbelievable as it may sound, we heard rumors of an island deep in the Sirensong Sea said to be home to a host of undead individuals not unlike myself. Ours being a rather lonely existence, we resolved to dispatch an emissary to the isle─myself being the logical choice once again..."},{"name":"ZOMBIEA","text":"Ah... Truly? Well, that would explain why the myriad skeletons we found were devoid of unlife, as it were. That said, even if they were as disagreeable a lot as you claim, I should thank you to stop killing every last undead you encounter in your travels..."},{"name":"ZOMBIEA","text":"Anyway, having failed in my mission, I was at a loss for what to do next. The island was abandoned, and Eorzea was ever so far away..."},{"name":"ZOMBIEA","text":"Just then, I felt it─a familiar tingling in my rotting flesh. Aye, there was no denying it: I had felt the pull of our leader, Master Zombibrand! His aether called to me, and I was duty-bound to answer! So I followed the trail and it led me to this place!"},{"name":"NASHUMHAKARACCA","text":"Cor, then it's no coincidence! The inspector and the burglar that stole him must be somewhere here on this island!"},{"name":"NASHUMHAKARACCA","text":"Good sir, do you still feel Inspector Hildibrand calling to you even now? Can you lead us to him?"},{"name":"ZOMBIEA","text":"As surely as I can crack open a hapless merchant's head and feast on the goo inside before you can say go! Follow me!"},{"name":"NASHUMHAKARACCA","text":"By the way, I've been meaning to ask. What's with the wolfish getup? It's not the sort of thing a Gentle Dead Man usually wears─though it's quite fetching, I've got to say!"},{"name":"ZOMBIEA","text":"It warms my dead heart to hear you say so! I received it as a gift from a traveling artist. When I explained to him how difficult it was to converse with the common man, he fashioned it for me, believing it would serve to soften my otherwise terrifying features. And so it has!"},{"name":"ZOMBIEA","text":"But enough talk─Master Zombibrand needs us!"},{"name":"SHIGURE","text":"...Nothing I have heard makes even the slightest bit of sense to me. But no matter! If this misshapen undead wolfman can lead us to the thief, I shall trust in him wholly!"},{"name":"SHIGURE","text":"Are all the undead in the West so...gentlemanly?"},{"name":"NASHUMHAKARACCA","text":"I think it's a wonderful look for him, don't you?"},{"name":"ZOMBIEA","text":"Yes, yes! Master Zombibrand is close! We are nearly upon him!"},{"name":"SHIGURE","text":"And the Wolf Burglar! At long last, we will bring that bastard to justice!"},{"name":"SHIGURE","text":"Wolf Burglar! You have nowhere left to run! Surrender!"},{"name":"KUGANEWOLFBURGLAR","text":"Gah! So they've finally caught up to me!"},{"name":"NASHUMHAKARACCA","text":"Cor! He looks exactly like my sketch!"},{"name":"SHIGURE","text":"Your campaign of thievery comes to an end this day! Aye, this day the bakufu will have their man! Err...that is to say, their Lupin!"},{"name":"SHIGURE","text":"Stop, damn you!"},{"name":"NASHUMHAKARACCA","text":"The inspector's still not snapped out of it, which means it's time for a triple serving of Nashu's Delight─dango style!"},{"name":"HILDIBRAND","text":"BOOOOOOOOOMBS!"},{"name":"KUGANEWOLFBURGLAR","text":"Shut up, you stupid statue!"},{"name":"KUGANEWOLFBURGLAR","text":"Bugger me, are those bombs!?"},{"name":"KUGANEWOLFBURGLAR","text":"Idiot! Get rid of them! Get rid of them before you kill us both!"},{"name":"HILDIBRAND","text":"Heeeeeelp! <span class=\"highlight\">Forename</span>! Nashu! Anyone!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I suppose we ought to save the inspector..."},{"name":"A1","text":"Forget Hildibrand! Now's our chance to catch the Wolf Burglar!"},{"name":"NASHUMHAKARACCA","text":"Don't worry about the inspector! He survived a trip back from Dalamud, so this is nothing! Let's get that Wolf Burglar instead!"},{"name":"SHIGURE","text":"I told you before, Wolf Burglar─you have nowhere left to run. Fall, on the other hand..."},{"name":"KUGANEWOLFBURGLAR","text":"Hmmm... If that's how it's gonna be, then fall it is!"},{"name":"KUGANEWOLFBURGLAR","text":"Never thought I'd come this close to getting caught. S'pose it's my own fault for trying to nick a hefty prize like a statue..."},{"name":"KUGANEWOLFBURGLAR","text":"But if the statue ain't even a statue, then there's no reason for me to stick around, is there? Better luck next time, thief-takers!"},{"name":"SHIGURE","text":"Gah! The nerve of that villain!"},{"name":"HILDIBRAND","text":"I say, <span class=\"highlight\">Forename</span>...I have come to expect such cold, calculating behavior from dear Nashu, but not you!"},{"name":"NASHUMHAKARACCA","text":"Hooray! Inspector Hildibrand is back! Nothing like a brush with certain death to get you back in the game, am I right, Inspector?"},{"name":"SHIGURE","text":"What manner of sorcery is this? <span class=\"emphasis\">The Eoruzean Gentleman</span>─this statue stands before me, speaking and gesticulating as if a living, breathing being..."},{"name":"ZOMBIEA","text":"I trust I needn't remind you I too am capable of such motions despite neither living nor breathing, but more to the point, Master Zombibrand is no statue."},{"name":"NASHUMHAKARACCA","text":"Quite right! He's an agent of enquiry! Inspector extraordinaire!"},{"name":"HILDIBRAND","text":"Good sir, by your garb I gather you are a samurai? Am I then correct in assuming we are in the Far East?"},{"name":"HILDIBRAND","text":"Ohohoho! As I wake from gentle slumber and find myself in a foreign land, who should I be greeted by but...a Far Eastern fan?"},{"name":"HILDIBRAND","text":"But ho, what is this? Already my keen investigator's sense has alerted me to the presence of a petitioner in need."},{"name":"HILDIBRAND","text":"I must away! For honor and justice and a hard-boiled egg!"},{"name":"NASHUMHAKARACCA","text":"Wait for me, Inspector! You know I can't run that fast!"},{"name":"ZOMBIEA","text":"Master Zombibrand looks to be his old self again. Wonderful, simply wonderful... It is enough to bring a tear to this Gentle Dead Man's eye. Or it would be, if I weren't...you know."},{"name":"ZOMBIEA","text":"But much as I would love to join you in your adventures, I must return to my brothers. I pray you watch over and keep our undead overlord safe!"},{"name":"SHIGURE","text":"So...in Eorzea, a man may be an inspector extraordinaire as well as a zombie overlord? Truly, yours is a land of many mysteries and strange customs I daresay I will never comprehend."},{"name":"SHIGURE","text":"While I regret that we were unable to apprehend the Wolf Burglar, I am glad that this chase has seen you reunited with your comrade. Come, let us follow him and see where his “keen sense” leads."},{"name":"SHIGURE","text":"Another ratman? Like the one they sold at the auction?"},{"name":"NASHUMHAKARACCA","text":"Looks like Inspector Hildibrand found a Qiqirn!"},{"name":"QIQIRN03021","text":"Friend in need of friend. Are you friend?"},{"name":"HILDIBRAND","text":"Did I not tell you I had caught the scent of a case? And here it is! I give you, “The Case of the Kidnapped Qiqirn”!"},{"name":"HILDIBRAND","text":"Simply put, this adorable little fellow's dearest friend was abducted by a dastardly fellow in the nearby city of Kugane."},{"name":"QIQIRN03021","text":"We sail on ships as sailors! For East Aldenard Trading Company! Docked at Kugane docks to unload goodly goods, when goodly merchant comes and offers tasty feast to me and friendly friend!"},{"name":"SHIGURE","text":"By the kami, did that ratman just speak!?"},{"name":"QIQIRN03021","text":"Qiqirn, not ratman, rude man! Why does no one here know Qiqirn? Always demon, demon, with lucky flesh. Hmph..."},{"name":"QIQIRN03021","text":"We go with goodly merchant. All alone. Many turns, left right left, very confusing. Then bad men grab friendly friend! Put gag in mouth and bag on head! I fight back and run, and they run too, and then I jump into water!"},{"name":"HILDIBRAND","text":"It would seem that the currents carried him to the shores of this island. But I have yet to ascertain the motive for why anyone would want to kidnap a hapless Qiqirn sailor..."},{"name":"SHIGURE","text":"...Because they do not know or do not care that he is a Qiqirn. He passes for a ratman of Far Eastern folklore─the flesh of which some believe bestows everlasting life..."},{"name":"SHIGURE","text":"An Eorzean sailor with most unusual features. An incredible albeit hideous statue of Eorzean make that was in truth a man. I daresay we have already met our goodly merchant."},{"name":"SHIGURE","text":"We must return to Kugane and confront this criminal at once! He may have abducted others from faraway lands to sell at auction. The fiend!"},{"name":"NASHUMHAKARACCA","text":"At the very least, we know he sold this Qiqirn's friendly friend. We've got to save him too!"},{"name":"SHIGURE","text":"Right you are, my lady. We shall see the wicked punished and the innocent set free!"},{"name":"HILDIBRAND","text":"Yes... Yes! I was just about to say that! Well said, you!"},{"name":"TRADER03020","text":"Kami strike me down! <span class=\"emphasis\">The Eoruzean Gentleman</span> is alive!"},{"name":"HILDIBRAND","text":"Hearken to me, merchant! Your reckoning is at hand!"},{"name":"SHIGURE","text":"For the crime of kidnapping a Qiqirn sailor and selling him into slavery, I hereby place you under arrest!"},{"name":"TRADER03020","text":"Huh? I should hope I would remember doing something so reprehensible as that..."},{"name":"TRADER03020","text":"But more importantly, who are you to level such accusations, much less place me under arrest? You're not of the Sekiseigumi─a common ronin, are you not?"},{"name":"SHIGURE","text":"You..."},{"name":"TRADER03020","text":"A common ronin come from the countryside looking for work─work I so generously provided when I hired you to guard my auction. An auction you failed to defend against a thief who stole a priceless piece!"},{"name":"HILDIBRAND","text":"I say, what audacity! That selfsame “piece” stands before you, with the Qiqirn who escaped your kidnapping attempt, as incontrovertible proof of your misdeeds!"},{"name":"HILDIBRAND","text":"I, Hildibrand, agent of enquiry, inspector extraordinaire, have defeated you! The least you could do is demonstrate dignity in defeat! The truth is plain─there is no denying it!"},{"name":"TRADER03020","text":"...And yet, I do. “Inspector,” was it? Whatever authority you may possess in Eorzea is not recognized here. Only the Sekiseigumi can compel answers and arrest criminals."},{"name":"TRADER03020","text":"And with that, I bid you good day..."},{"name":"DIGNIFIEDSEKISEIGUMI","text":"(-???-)You need not answer to them, but you <span class=\"emphasis\">will</span> answer to me..."},{"name":"DIGNIFIEDSEKISEIGUMI","text":"We've had our eye on you for some time, my friend. But alas, all good things must come to an end..."},{"name":"DIGNIFIEDSEKISEIGUMI","text":"The Wolf Burglar's meddling merely delayed the inevitable. We have all the proof we need. Now, do yourself a favor and come quietly. Or don't, and do <span class=\"emphasis\">me</span> a favor..."},{"name":"DIGNIFIEDSEKISEIGUMI","text":"Shigure. Owing to the efforts of you and yours, we can finally bring this charlatan to justice. For that, you have my deepest thanks."},{"name":"SHIGURE","text":"Th-Thank you, sir! That you would favor me with such kind words is a great honor! I can only hope that this goes some way towards─"},{"name":"DIGNIFIEDSEKISEIGUMI","text":"However! That you failed to inform the Sekiseigumi of the Wolf Burglar's crime, despite being present, and instead pursued the thief on your own is inexcusable!"},{"name":"DIGNIFIEDSEKISEIGUMI","text":"I cannot in good conscience admit you to the Sekiseigumi at this time. Such reckless disregard and thirst for personal glory are traits I will not suffer in our samurai."},{"name":"QIQIRN03021","text":"A thousand thanks to you for saving friendly friend! Warier and warier we will be next time─no more following goodly merchants into dark alleys!"},{"name":"SHIGURE","text":"I owe you all an apology. Like the merchant said, I am no more than a common ronin. My pursuit of the Wolf Burglar has been, from the very beginning, independent of the Sekiseigumi or any other authority."},{"name":"SHIGURE","text":"I came to Kugane to join the Sekiseigumi, but was judged to be unworthy. Unable to find gainful employment as a samurai elsewhere, I struggled to make ends meet..."},{"name":"SHIGURE","text":"And then, when I was about to renounce my dream and return to my village, I learned of a notorious thief. A thief that targeted only the most wealthy and influential. A thief that I might bring to justice and thereby earn the approval of the Sekiseigumi..."},{"name":"HILDIBRAND","text":"Say no more, my good samurai! Your earnest nature and passion for the law have won me over!"},{"name":"HILDIBRAND","text":"I swear to you, here and now: I, Hildibrand, agent of enquiry, inspector extraordinaire, shall help you scour all creation─"},{"name":"HILDIBRAND","text":"From the deepest pit of the seven hells to the very pinnacle of the heavens─for the Kugane Wolf Burglar! And we shall start right this instant!"},{"name":"SHIGURE","text":"I'm...I am still not quite sure what to make of that man, but I suppose I should be grateful for the help..."},{"name":"SHIGURE","text":"<span class=\"highlight\">Forename</span>, was it? I should thank you for joining me in this endeavor, perhaps more so than the others. Their help is of questionable benefit, whereas yours seems rather more reliable."},{"name":"SHIGURE","text":"The Wolf Burglar is not to be underestimated. He is a cunning, clever foe, as evidenced by the way he escaped. Sheer passion and determination will not be enough to catch him."},{"name":"SHIGURE","text":"Which is to say that while I value the assistance of the inspector and his assistant, I believe cooler heads will prevail in the end. To wit, yours and mine."},{"name":"SHIGURE","text":"I too may be prone to fits of passion, but I should like to think it is nothing compared to that of <span class=\"emphasis\">The Eoruzean Gentleman</span>!"}],"reward":{"gil":1273,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68556]},"next":[68630]},"partials":[{"type":"npc","id":"1024710","obj":{"i":1024710,"n":"Shigure","l":2409,"q":2}},{"type":"npc","id":"1024708","obj":{"i":1024708,"n":"Shigure","l":2404,"q":3}},{"type":"npc","id":"1019166","obj":{"i":1019166,"n":"Ihaki","l":2409,"q":1}},{"type":"npc","id":"1024707","obj":{"i":1024707,"n":"Nashu Mhakaracca","l":2409,"q":2}},{"type":"npc","id":"1024713","obj":{"i":1024713,"n":"Nashu Mhakaracca","l":2409,"q":1}},{"type":"npc","id":"1024715","obj":{"i":1024715,"n":"Nashu Mhakaracca","l":2409,"q":1}},{"type":"npc","id":"1024716","obj":{"i":1024716,"n":"Nashu Mhakaracca","l":2409,"q":1}},{"type":"npc","id":"1024717","obj":{"i":1024717,"n":"Shigure","l":2409,"q":1}},{"type":"npc","id":"1024719","obj":{"i":1024719,"n":"Shigure","l":2409,"q":1}},{"type":"npc","id":"1024720","obj":{"i":1024720,"n":"Shigure","l":2409,"q":1}},{"type":"npc","id":"1024722","obj":{"i":1024722,"n":"Gentle Dead Man","l":2409,"q":1}},{"type":"npc","id":"1024723","obj":{"i":1024723,"n":"Hildibrand","l":2409,"q":1}},{"type":"npc","id":"1024724","obj":{"i":1024724,"n":"Wayward Qiqirn","l":2409,"q":1}},{"type":"npc","id":"1024725","obj":{"i":1024725,"n":"Silver-tongued Broker","l":2404,"q":1}},{"type":"quest","id":"68556","obj":{"i":68556,"n":"Life Imitates Art Imitates Life","g":70,"l":"Kugane","s":20,"f":1}},{"type":"quest","id":"68630","obj":{"i":68630,"n":"In the Eye of the Hingan","g":70,"l":"Kugane","s":40,"f":1}}]}