{"quest":{"name":"Plucking the Heartstrings","location":"Old Gridania","id":68555,"patch":4.15,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1003063,"target":1003063,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"SIMPKIN","text":"Have you come to listen to the silken strings of Simpkin, traveling troubadour and master minstrel? No?"},{"name":"SIMPKIN","text":"You do, however, have the look of one who lives life on the road─and on the subject of wondrous wanderings and the musical expression thereof, I do mayhap have some small wisdom to offer."},{"name":"SIMPKIN","text":"When I suddenly find my heart stirred by some spectacle of nature or inspiring act of derring-do, I simply let the emotion of the moment flow through my fingers and into my harp. I've found no sound to be as achingly beautiful as one born from that instant of genuine joy or wistful sadness."},{"name":"SIMPKIN","text":"You need no special training or knowledge to give voice to the music of the heart─only a willingness to play the score as it writes itself across your soul."},{"name":"SIMPKIN","text":"If you can accomplish such a surrender, then you will have created a piece unique unto yourself. And what melody could be more precious!?"},{"name":"SIMPKIN","text":"Aye, I knew from the moment I laid eyes upon you─here is a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> whose spirit begs for instrumental interpretation. Pray release your inhibitions, and favor the world with your performance!"},{"name":"SIMPKIN","text":"To begin, you should simply play whichever notes catch your fancy. Let whimsy carry you up and down the scales, revel in the soaring heights and plunging depths, until you find a song which resonates with your being."},{"name":"SIMPKIN","text":"Painted with the experience of your adventures, the timbre and tone will be yours and yours alone. Ah, I wonder what manner of music will fill the air... May the wind catch your composition, and deliver it unto my covetous ear!"},{"name":"SYSTEM","text":"You have learned “Perform”! When playing as a bard, <span class=\"highlight\">Performance Actions</span> can be found in the <span class=\"highlight\">Actions & Traits</span> window, accessed under <span class=\"highlight\">Character</span> in the main menu."},{"name":"SIMPKIN","text":"I understand─the courage for such surrender does not come easily. My harp and I shall be in town for some time, so feel free to visit me again should you choose to pursue my musical teachings."},{"name":"SIMPKIN","text":"You have a certain air about you. A <span class=\"emphasis\">musical</span> air. Have you ever considered taking up an instrument...?"},{"name":"SYSTEM","text":"In order to undertake this quest, you must change your current job to bard."}],"reqs":{"jobs":[{"lvl":30,"id":24}],"quests":[66621]}},"partials":[{"type":"npc","id":"1003063","obj":{"i":1003063,"n":"Simpkin","l":53,"q":1}},{"type":"quest","id":"66621","obj":{"i":66621,"n":"A Song of Bards and Bowmen","g":151,"l":"Gridania","s":1,"f":1}}]}