{"quest":{"name":"Absolutely Glamourous","location":"Western Thanalan","id":68554,"patch":4.1,"sort":152,"unlocksFunction":1,"eventIcon":71341,"issuer":1004990,"target":1024586,"involved":[1004096],"genre":93,"journal":["Swyrgeim wants you to learn how to craft glamour prisms.","Swyrgeim is eager to assist your pursuit of cosmetic perfection. However, she demands another serving of expensive orange juice before giving any further advice.","Folclind readies Swyrgeim's order while bemoaning the indolent fashion expert's unpaid debt. Nevertheless, the drink is soon yours, and soon to be Swyrgeim's, if you are to receive the boon of her wisdom.","Swyrgeim gulps down the expensive orange juice before sending you to meet a merchant named Goberin. He deals in a range of wares for discerning dressers, including glamour prism recipe tomes.","Having read the letter guaranteeing that you have the necessary credentials, Goberin permits you to view his selection of books. The tomes on offer describe the process for crafting glamour prisms, an essential skill for a self-reliant trailblazer of fashion such as yourself."],"objectives":["Speak with Folclind.","Deliver the Othardian orange juice to Swyrgeim.","Present the letter to Goberin."],"dialogue":[{"name":"SWYRGEIM","text":"Thanks to yours truly, you have a basic understanding of glamours, yes? I also understand you're no stranger to crafting this and that by yourself. It so happens these skills can be applied to a singular cause."},{"name":"SWYRGEIM","text":"Would you be interested in helping to bring more glamour to the world? By that, I mean learning to make glamour prisms, either for personal use or to aid the aesthetically underprivileged."},{"name":"SWYRGEIM","text":"I will explain everything in due course, but there is something I need to prepare beforehand."},{"name":"SWYRGEIM","text":"Bring me some Othardian orange juice in the meantime, would you? Just ask Folclind, same as last time. Well? Staring at me isn't going to get that orange juice poured any quicker! Hurry up, would you?"},{"name":"SWYRGEIM","text":"Don't tell me you're lost─it's only a few yalms away! I would get it myself, but as you can clearly see, I am rather busy."},{"name":"FOLCLIND","text":"Swyrgeim's still got you running errands, then? And she wants Othardian orange juice this time? Twelve preserve!"},{"name":"FOLCLIND","text":"Well, here it is. I think she and I need to have a little chat about her tab. This order alone costs more than some of our big-drinking regulars spend in a whole night!"},{"name":"FOLCLIND","text":"Around here, Othardian oranges are as rare as chocobo teeth. I can barely bring myself to squeeze the juice out of them, knowing how much they cost. I daren't spill a drop!"},{"name":"SWYRGEIM","text":"You have my drink, I take it?"},{"name":"SWYRGEIM","text":"Now that's what I call orange juice! Eastern oranges have a bitter kick that truly invigorates the soul!"},{"name":"SWYRGEIM","text":"Ahem! All that jumping around almost made it go down the wrong way. Anyway, before we begin, I have a confession to make."},{"name":"SWYRGEIM","text":"To be perfectly frank, my expensive tastes in orange juice have to be paid for somehow. While my intentions are sincere, my reasons for helping you are not entirely altruistic."},{"name":"SWYRGEIM","text":"Pass this letter to Goberin the merchant, and he'll allow you to browse his glamour prism recipe tomes. If you buy any of them, he'll give me a cut of the profits. You'll have the knowledge you seek, and I'll have money for orange juice. What could be more piquant?"},{"name":"SWYRGEIM","text":"I will also send word to my associate Wiscard in Revenant's Toll. We have a similar arrangement, and I'm sure you'll find his prices just as fair as Goberin's."},{"name":"SWYRGEIM","text":"You should start with Goberin though, since his stall's right there, by the Pissed Peiste. Once you've read one of those books, you'll be able to make the prisms yourself and share the glory of glamours with the masses!"},{"name":"SWYRGEIM","text":"Goberin is very particular about accepting new customers. But once he sees that you have my personal recommendation, he is sure to welcome you with open arms!"},{"name":"GOBELIN","text":"Ah, I sense you come in pursuit of true elegance. And is that a letter of introduction peeking from your pocket? May I see it?"},{"name":"GOBELIN","text":"Ah! So, you are Swyrgeim's protégé? And you wish to produce glamour prisms? A noble endeavor. My selection of tomes, reserved for only the most deserving, are yours to peruse."},{"name":"SYSTEM","text":"You may now purchase master crafting tomes from Goberin, as well as Tataroga in Mor Dhona."},{"name":"SYSTEM","text":"By using the tomes, you can learn the recipes within."}],"reward":{"items":[{"id":7671}],"xp":0},"reqs":{"jobs":[{"lvl":15,"id":33}],"quests":[68553]}},"partials":[{"type":"npc","id":"1004990","obj":{"i":1004990,"n":"Swyrgeim","l":42,"q":3}},{"type":"npc","id":"1024586","obj":{"i":1024586,"n":"Goberin","l":42,"s":3,"q":1,"t":"Crafting Tome Vendor","r":1,"a":728,"c":[12.21,15.07]}},{"type":"npc","id":"1004096","obj":{"i":1004096,"n":"Folclind","l":42,"q":4}},{"type":"item","id":"7671","obj":{"i":7671,"n":"Clear Prism","l":35,"c":26226,"t":48,"p":200}},{"type":"quest","id":"68553","obj":{"i":68553,"n":"If I Had a Glamour","g":93,"l":"Western Thanalan","s":151,"f":1}}]}