{"quest":{"name":"Tortoise in Time","location":"The Ruby Sea","id":68552,"patch":4.3,"sort":311,"icon":100769,"unlocksFunction":1,"eventIcon":71341,"issuer":1019178,"target":1019178,"genre":22,"journal":["Bunchin has not heard from Soroban in quite some time...","When last you left Soroban, he was undergoing strenuous training under the tutelage of Genbu, one of the Four Lords of legend, in Reisen Temple. It would seem that since you delivered news of this development to Bunchin, he has heard nothing further regarding his kinsman. Coincidentally, the moment the Kojin chieftain voices his concern, you are contacted by Tataru, who is bound for the temple to deliver a treat to the hardworking Soroban...","Though Soroban is not without potential─as is evidenced by the simple fact that he has yet to run screaming from the temple─Genbu is concerned that he will not be strong enough to aid in the great battles to come against Seiryu and Suzaku. Therefore, to accelerate the training process, he would have you retrieve a relic known as the tamate-bako of geomancy, which has the power to manipulate time itself, and transform Soroban into an auspice─albeit until the magicks dissipate. The box can be found deep within the Swallow's Compass, the ancient mausoleum of Ganen, the founder of the Kingdom of Doma and father of Far Eastern geomancy. Given the nature of the task, it would be prudent to call upon several of your allies.","You journey unto Yanxia and arrive at the tomb to find Kamaitachi, who has already dealt with the wards sealing the entrance. The grand mausoleum was long ago abandoned to the shikigami forever bound to its halls, who will doubtless do their utmost to bar your way. Nevertheless, you and your comrades must overcome these guardians and whatever other trials you encounter, and lay claim to the tamate-bako of geomancy.<br><br>※The Swallow's Compass can be accessed via the Duty Finder.","After braving the myriad dangers of the tomb, your party at last comes upon the relic and its final guardian, an auspice far more formidable than those who preceded him. Yet, in the end, he and his golden-hooped rod are no match for you and yours.","Genbu is quite pleased to receive you and the tamate-bako of geomancy, and immediately calls for everyone to prepare for the next stage of Soroban's training, in which the Kojin is to bathe in the temporal magicks of the box and temporarily transform into an auspice. The process is not without its risks, however, and despite Tataru's assurances that she can bring her arcanima to bear in an emergency, it will likely fall to you to deal with any dangers that may arise...","After all save Soroban withdraw to a safe distance, the Kojin opens the box, from which pours forth an endless fount of smoke. All observe in silence...until Tataru, growing impatient, declares the box to be a fake and runs to gaze inside. Genbu quickly pushes her aside, but too late to spare her entirely, as she is transformed into a hideous crone...for some few moments. Alas, her reckless actions serve to distract Genbu from Soroban, whose prolonged exposure to the smoke leads him to transform into an auspice already consumed by the aramitama. As feared, you will need to call upon your martial prowess and subdue the rampaging Soroban before Reisen Temple is destroyed.","Though the battle is not without its twists and turns, it ends in your victory, as is usually the case. Genbu, briefly incapacitated, has fortunately recovered, and regards Soroban with a mixture of surprise and exasperation...","In the aftermath of Soroban's training session, Genbu takes the opportunity to share with you the tale of how he first met Tenzen, when he was only five hundred or so years old. Though not yet a full-fledged auspice, the turtle had for centuries been possessed of a powerful clairvoyance, which bestowed upon him visions of terrible calamities he had been powerless to prevent. On that fateful day, Genbu went unto a village soon to be destroyed in a landslide, and made a desperate attempt to warn its people. Alas, none could understand him...save a wandering samurai who heeded his words and, with the aid of a great white tiger, drove the villagers from their doomed homes and saved them from certain death. Thereafter the three became traveling companions and close friends, who swore to use their gifts to do good.<br><br>While Tenzen has long since passed away, his former comrades have found in you and Soroban (and perhaps Tataru) new allies to carry on his legacy and safeguard the Ruby Sea. As the Kojin returns to his training and Tataru takes her leave, Genbu tells you that the next time he calls upon you, it will likely be to help him confront one of his fellow Four Lords.","Bunchin is comforted to hear of Soroban, and proud to learn of the tremendous potential with which he has been blessed. Yet he understands that with great power comes great responsibility, and that many buckle under the pressure of such expectations..."],"objectives":["Speak with Genbu in Reisen Temple.","Speak with Kamaitachi in Yanxia.","Enter the Swallow's Compass.","Deliver the tamate-bako of geomancy to Genbu.","Speak with Genbu.","Speak with Bunchin in Tamamizu.","Quell Soroban's aramitama."],"dialogue":[{"name":"BUNCHIN","text":"A pleasure as ever to see you, my friend."},{"name":"BUNCHIN","text":"Would that I could say the same for Soroban. He has yet to return to Tamamizu, so I can only assume he is still busy undergoing Genbu's rigorous training..."},{"name":"TATARU","text":"(-Tataru-)Hello? Hello? <span class=\"highlight\">Forename</span>? Is my linkpearl working? So unreliable, these little things..."},{"name":"TATARU","text":"(-Tataru-)I'm going to pay a visit to Reisen Temple to see Soroban─give him a treat to keep his spirits up. If you're available, you should come too!"},{"name":"TATARU","text":"(-Tataru-)I hope you haven't forgotten how to get there, but in case you have, look for the cute animal trying not to look like a guard on duty in the middle of the volcanic island!"},{"name":"BUNCHIN","text":"...I was, of course, not privy to your conversation just now, but on the off chance you are bound for Reisen Temple, give Soroban and Genbu my regards."},{"name":"GENBU","text":"Ho, well met, brave adventurer. You are come alone this day? What of the urchin girl I recall nipping at your heels?"},{"name":"TATARU","text":"That's Tataru! Tataru! Ta-ta-ru! And I'll thank you not to forget it, or else you'll get no tako-yaki from me!"},{"name":"GENBU","text":"Oh my, that would be most unfortunate. My sincerest apologies. I shall endeavor to remember, little urchin Tataru."},{"name":"GENBU","text":"Of course, your name I will not soon forget, for you saved my dear friend Byakko from descending into madness."},{"name":"GENBU","text":"It is good that you are here, <span class=\"highlight\">Forename</span>. Soroban has made great strides in his training, it is true, but I believe we need consider more drastic methods..."},{"name":"GENBU","text":"Though he is not without potential, Soroban, as he is, simply lacks...divinity. Should we carry on as we are, he may not be ready when we have need of his strength."},{"name":"GENBU","text":"As with Byakko before, there will come a time when we must confront Seiryu and Suzaku, and quell the raging aramitama within them. Accordingly, we must use every means at our disposal─no matter how dangerous─to ensure we are prepared."},{"name":"SOROBAN","text":"No...no matter how dangerous? What exactly did you have in mind...?"},{"name":"GENBU","text":"Oho, there is no need for fearful trembling or withdrawing into one's shell. All I would have you do is open a box."},{"name":"SOROBAN","text":"...Oh, is that all? Well! I've opened my fair share of boxes!"},{"name":"GENBU","text":"But know that it is no ordinary box you must open! It is a tamate-bako of geomancy─a sacred vessel which harbors the very power of time itself."},{"name":"SOROBAN","text":"...And yet you say there is no need for fearful trembling? This box sounds terribly dangerous. To what end would you have me open it?"},{"name":"GENBU","text":"That you may bathe in its temporal magicks and age a thousand years in an instant─that you may undergo the change and become an auspice. Albeit until the magicks dissipate."},{"name":"SOROBAN","text":"You...you would have me become an auspice like the Four Lords!?"},{"name":"TATARU","text":"Hold on─<span class=\"highlight\">Forename</span>, didn't you come across one of these tamate-bako in Shisui of the Violet Tides? You did, didn't you?"},{"name":"GENBU","text":"I am aware of similar relics in the possession of the Raen. However, their “magicks” alter only the appearance of those exposed. A mummer's trick─a glamour─altogether unlike the phenomenal power of the tamate-bako we seek."},{"name":"TATARU","text":"Come to think of it, I think I heard rumors that several boxes like the ones he describes were in the possession of the Raen?"},{"name":"GENBU","text":"You speak of common trinkets that belong to the people of Sui–no–Sato. Their “magicks” alter only the appearance of those exposed. A mummer's trick─a glamour─altogether unlike the phenomenal power of the tamate-bako we seek."},{"name":"GENBU","text":"Know that this is no legend, but incontrovertible truth, for the one who created the tamate-bako of geomancy was a fellow auspice..."},{"name":"GENBU","text":"Like many of us, he had lived long enough to see comrades become consumed by the aramitama─see them descend into madness and lay waste to the lands they had sworn to protect. And, like many of us, he had had no choice but to put an end to their rampages..."},{"name":"GENBU","text":"This auspice knew full well that he was destined to share their fate, and so, before he too fell from grace, he resolved to craft the tamate-bako of geomancy. And when his work was complete, he bathed in its magicks...until he was no more."},{"name":"SOROBAN","text":"By the kami... He chose to die while his mind was still his own..."},{"name":"TATARU","text":"I...I don't know what to say..."},{"name":"GENBU","text":"Once the true potential of the box was understood─that it could bring death to an auspice─it was decided that it should be placed under lock and key in the Swallow's Compass, until we had need of it."},{"name":"GENBU","text":"However, the grand mausoleum of King Ganen has been abandoned to the shikigami forever bound to its halls as guardians, and only a warrior of surpassing strength can hope to overcome their trials."},{"name":"GENBU","text":"Steel yourself, Soroban! Until the moment <span class=\"highlight\">Forename</span> returns with the tamate-bako of geomancy, you must train like you have never trained before!"},{"name":"SOROBAN","text":"Y-Yes, yes! Of course!"},{"name":"SOROBAN","text":"&lt;huff&gt; &lt;puff&gt; Oh, hello there! I pray you excuse my panting. Genbu is a...a rather demanding teacher. But I will not rest until granted leave to do so!"},{"name":"BYAKKO","text":"Genbu yet has an eye for talent. That Kojin may be young, but he has tremendous potential. I expect he will be most formidable...several centuries from now."},{"name":"BUNCHIN","text":"Did you not receive a summons earlier from your comrade? Do not let me keep you."},{"name":"KAMAITACHI","text":"Oh hey, you made it! Finally! I've only been waiting here forever and a day, but hey, it's not like we've got a potential calamity to worry about or anything..."},{"name":"KAMAITACHI","text":"Anyway, I've already taken care of the wards sealing the tomb's entrance, so you're free to go in and get the box. But whatever you do, don't open it!"},{"name":"KAMAITACHI","text":"Ah, and one more thing! I'll wager they told you about the shikigami, but forgot to mention that the box itself is guarded by one of us. A tough bugger and half!"},{"name":"KAMAITACHI","text":"But you're a pretty tough bugger yourself, eh? You gave Byakko what for, after all. Just don't say I didn't warn you!"},{"name":"TATARU","text":"Back straight! Keep those hands up! If I'm not satisfied with your performance, then no tako-yaki for you!"},{"name":"SOROBAN","text":"&lt;huff&gt; &lt;puff&gt;"},{"name":"GENBU","text":"The box is hidden in the heart of the Swallow's Compass, the tomb of Ganen in Yanxia. Kamaitachi has gone on ahead to open the way─seek him out."},{"name":"BYAKKO","text":"You are for the Swallow's Compass, I am told. Know that the guardian of the relic you seek was a disciple of its creator, and will surely fight to defend it most fiercely."},{"name":"KAMAITACHI","text":"Why you talking to me? I'm not about to brave a tomb full of shikigami for a box that can kill my kind. That's your job!"},{"name":"GENBU","text":"You are returned...and with the tamate-bako of geomancy, I gather?"},{"name":"GENBU","text":"Very good, very good! Of course there was no need to fear for the well-being of the warrior who faced my brother Byakko and lived."},{"name":"GENBU","text":"Let us brook no further delay and make ready for this next stage of Soroban's training. Listen well, everyone, for the magicks we are about to unleash are ancient and terrifying! It is exceedingly dangerous─especially for Soroban!"},{"name":"SOROBAN","text":"Err... I wish you would stop saying that..."},{"name":"GENBU","text":"Be at ease, Soroban. Byakko will devote his energies to maintaining the wards on Koryu's prison while we are occupied. Should you be indisposed for a time, we will manage."},{"name":"TATARU","text":"And I've been secretly practicing my arcanima in preparation for a time like this, so don't worry! No matter what happens, we'll be ready!"},{"name":"TATARU","text":"After all, we've each got to do our part if we're going to claim the fabulous riches─ I mean, if we're going to save the Ruby Sea from certain doom!"},{"name":"GENBU","text":"Her enthusiasm notwithstanding, I expect we will need to turn to you should this training go...awry. Take a moment to see to your equipment, and let me know when you are ready to begin."},{"name":"TATARU","text":"Welcome back, <span class=\"highlight\">Forename</span>! Did you find the mysterious box of doom or whatever it was you were looking for?"},{"name":"SOROBAN","text":"You...you have returned. Kami be praised... I do not think I could endure even a moment's more training..."},{"name":"BYAKKO","text":"Was it not just the other day you went to Yanxia to retrieve the box? But of course. Where others would struggle, you thrive."},{"name":"KAMAITACHI","text":"Oh, back already? Damn. I really ought to stop betting against you."},{"name":"GENBU","text":"Everything is in order? Then let us begin!"},{"name":"GENBU","text":"Now remember, Soroban! Once opened, the box will spew forth smoke. Remain still and let it wash over you. Surrender to the magick and let it transform you into an auspice."},{"name":"SOROBAN","text":"And you are certain this will be temporary? As honored as I would be to join your ranks, I fear I am too young to be so old..."},{"name":"GENBU","text":"Come, you lot! Let us retreat to a safer distance!"},{"name":"SOROBAN","text":"&lt;cough&gt; &lt;hack&gt; &lt;wheeze&gt;"},{"name":"TATARU","text":"Uh...huh. It's a fake. I knew it!"},{"name":"TATARU","text":"Gosh, what a waste of time! There had better be some treasure or something interesting inside..."},{"name":"GENBU","text":"Foolish urchin!"},{"name":"TATARU","text":"Uwaaah!"},{"name":"TATARU","text":"Ugh... Was that really necessary? You couldn't just ask me to move nicely?"},{"name":"TATARU","text":"...What? What's that look for? Is there something on my face?"},{"name":"TATARU","text":"My...my face! My beautiful face! It feels like aldgoat leather left in the sun!"},{"name":"GENBU","text":"Get a hold of yourself, child! You have been aged, nothing more. Be grateful you were not exposed longer, or you would have surely died!"},{"name":"TATARU","text":"I may as well be dead already! I can't bear to go on like this!"},{"name":"GENBU","text":"Did I not tell you before that the magick is fleeting? You need only endure it for a moment. All will be as it was."},{"name":"GENBU","text":"Bah! So preoccupied with the urchin I have been that I completely forgot about Soroban! I hope he has not been overexposed to the magick."},{"name":"GENBU","text":"If he has been aged to excess, his aramitama may already be..."},{"name":"SOROBAN","text":"Graaaaaah!"},{"name":"GENBU","text":"...Well, that answers that. On your guard─I'm afraid he means to kill us all."},{"name":"GENBU","text":"He bathed in the tamate-bako's magick for far longer than the urchin, and so I expect he will not return to normal so quickly. In fact, I daresay he will retain this form long enough to destroy the temple if we do not subdue him."},{"name":"GENBU","text":"Sha-zam!"},{"name":"GENBU","text":"With me, <span class=\"highlight\">Forename</span>, urchin! Hold nothing back!"},{"name":"SOROBAN","text":"Graaaaaah! Grrraaarrrgh!!!"},{"name":"SOROBAN","text":"Hurrrggghhh!"},{"name":"TATARU","text":"I don't like the sound of that!"},{"name":"GENBU","text":"He marshals his strength for a mighty blow! Get behind me!"},{"name":"GENBU","text":"Oh dear, that was a bit more than I could handle...<br>Forgive me, but the rest is up to you two."},{"name":"SOROBAN","text":"Yaaaaaargh!"},{"name":"TATARU","text":"What are these bubble thingies chasing me!?"},{"name":"TATARU","text":"A little help, <span class=\"highlight\">Forename</span>!?"},{"name":"SOROBAN","text":"GRAAARRRGGGH!"},{"name":"TATARU","text":"He's growing weaker! Don't let up!"},{"name":"TATARU","text":"I know what you're thinking: “Didn't she give arcanist a go before and get betrayed by her Carbuncle?” Yes and yes, but that was then and this is now!"},{"name":"SOROBAN","text":"I do not know what to expect, but...I trust you will let no harm come to me?"},{"name":"SOROBAN","text":"Hmm? What happened? Why do you all look so exhausted?"},{"name":"GENBU","text":"Oh, my dear Soroban. I knew you had potential, but it would seem I grossly underestimated your capacity for chaos."},{"name":"GENBU","text":"In any case, despite this unexpected turn of events, I should like to declare this training session a success. Let us take a moment to collect ourselves."},{"name":"FURI","text":"Need a guide back to the surface? 'Course you do! Follow me!"},{"name":"SYSTEM","text":"Leave Reisen Temple?"},{"name":"FURI","text":"Need a guide back to the temple? 'Course you do! Follow me!"},{"name":"SYSTEM","text":"Enter Reisen Temple?"},{"name":"GENBU","text":"Truth be told, this comes as a relief. Though Soroban's present strength pales in comparison to that of Byakko and myself, we now know for certain that his potential is extraordinary."},{"name":"SOROBAN","text":"I struggle to believe I could ever wield such power..."},{"name":"GENBU","text":"All who are strong were once weak, Soroban. I am no exception. Until I met Tenzen, I was no more than the floundering turtle you see before you."},{"name":"TATARU","text":"You never did tell us how you fell in with him."},{"name":"GENBU","text":"Ah, well, if you wish to know the details..."},{"name":"GENBU","text":"Long, long ago, when I had lived a hundred or so years and had only just begun to become something more, I received my first vision. A terrible calamity, one that would claim the lives of countless innocents, was imminent."},{"name":"GENBU","text":"But what was a little turtle to do? For while I had seen the future with crystal clarity, I was powerless to stop it. I could but look on, helpless, as cities burned and men died. So it was for centuries...until one day."},{"name":"GENBU","text":"After five hundred years I had grown stronger, more reckless. I believed I could make a difference. So when I foresaw a landslide that would bury a nearby village, I ventured forth to warn the people."},{"name":"GENBU","text":"Alas, while they were quick to discern I was no common animal, they could make no sense of my panicked flailings. To them I was a queer dancing turtle─a source of considerable amusement─for I knew not the words of men, and so my warnings fell on deaf ears."},{"name":"GENBU","text":"It would be no different. Yet again they would die. The people turned and walked away, bored with the fleeting amusement. With a heart fit to burst with sorrow and despair, I made to quit the village."},{"name":"GENBU","text":"Just then, I heard a voice kind and gentle..."},{"name":"GENBU","text":"\"Little one, you look troubled. Tell me what burdens you so.“"},{"name":"GENBU","text":"Though I knew he was addressing me, I doubted he would understand. Still, I told him of my vision─of the landslide I knew would bury the village and everyone in it, and my vain attempts to warn them."},{"name":"GENBU","text":"\"Your kindness is only surpassed by your bravery, little one. Fear not. I, Tenzen, and my comrade Byakko shall act in your stead.“"},{"name":"GENBU","text":"As Tenzen drew his sword, a great white tiger emerged from the wilds. “Shall we give them a show?” he whispered to the beast, which inclined its massive head ever so slightly in response."},{"name":"GENBU","text":"They then ran into the center of the village, and began to fight as if they were bitter enemies intent on killing one another! Blade and fang flashing, too fast for the eye to follow!"},{"name":"GENBU","text":"The two broke apart for an instant, and Tenzen bellowed, “Hearken to me! This white demon thirsts for the blood of man! If you value your lives, flee this place! Seek shelter in the next village!”"},{"name":"GENBU","text":"Needless to say, the bewildered villagers gathered up whatever was at hand and ran screaming, too terrified to even look back."},{"name":"GENBU","text":"As the three of us watched them go, I heard the white demon mutter, “You know full well I have not once tasted man-flesh...”"},{"name":"GENBU","text":"The village was later destroyed in a landslide, as I had foreseen. But, for the first time, I had managed to make a difference..."},{"name":"GENBU","text":"Thereafter we became traveling companions and close friends. I shared with them my visions, and together we labored to save those that we could."},{"name":"GENBU","text":"On the eve of what may perhaps be the greatest calamity I have ever foreseen, I feel Tenzen's absence keenly... Nevertheless, we must carry on."},{"name":"TATARU","text":"You may not have him, but you've got <span class=\"highlight\">Forename</span>─and you know <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s no slouch!"},{"name":"GENBU","text":"Oho, indeed I do. And for this blessing we are grateful beyond measure."},{"name":"GENBU","text":"Right, then. Soroban─we must resume your training at once, ere we forget the lessons of your time as an auspice!"},{"name":"SOROBAN","text":"Yes, yes, of course..."},{"name":"TATARU","text":"Getting back to it? In that case, I should return to the mountain of paperwork in Kugane I've been doing my best to ignore. Oh, and Soroban─I left the tako-yaki with Kamaitachi for safekeeping. You're not to get any until you've earned it!"},{"name":"GENBU","text":"When next we call upon you, <span class=\"highlight\">Forename</span>, I expect it will be to deal with one of my comrades. Shirk not your own training, for it will not be easy."},{"name":"SOROBAN","text":"Under these circumstances, I do not think I will have time to return to Tamamizu for even a short spell. If you would be so kind as to inform the elder..."},{"name":"SOROBAN","text":"I...I'm not quite sure what happened, but I feel so very, very tired..."},{"name":"TATARU","text":"Confound it. Betrayed by my own Carbuncle yet again..."},{"name":"SEITENTAISEI","text":"Oh, hello there! Remember me? I was the fellow tasked with guarding the tamate-bako of geomancy. I hope you understand that I had no choice but to put you to the proof. What kind of guardian would I be if I let you have it without a fight, eh? Still, I didn't think you lot would use it like that..."},{"name":"BYAKKO","text":"Soroban, was it? He surpassed all expectations...to your temporary dismay, perhaps, but to our ultimate benefit, I should think."},{"name":"BYAKKO","text":"Though, regardless of what Genbu may have told you, if you had failed to subdue him, I would have intervened. The wards would have held long enough, I am sure."},{"name":"KAMAITACHI","text":"That Kojin's something else...but he's still no auspice! At least, not yet. But if he was, I might be in trouble..."},{"name":"BUNCHIN","text":"A pleasure, <span class=\"highlight\">Forename</span>. Did you have the chance to visit with Soroban? How fares he with his training?"},{"name":"BUNCHIN","text":"...Extraordinary. He has always been diligent and hardworking, but even so..."},{"name":"BUNCHIN","text":"To think he is blessed with such incredible potential! I cannot help but wonder who else among us might be possessed of similar abilities."},{"name":"BUNCHIN","text":"Yet I understand his trepidation. With great power comes great responsibility, as is often said. We may need to keep a closer eye on him to ensure he does not succumb to fear and attempt to flee his training."},{"name":"GENBU","text":"When the time comes, I will send for you, <span class=\"highlight\">Forename</span>. Be ready for whatever lies ahead."},{"name":"SOROBAN","text":"&lt;huff&gt; &lt;puff&gt; I'm...I'm not going anywhere. I promise..."},{"name":"KAMAITACHI","text":"&lt;crunch&gt; &lt;crunch&gt; &lt;crunch&gt; &lt;crunch&gt;"},{"name":"KAMAITACHI","text":"By the kami, it's been too long since I've had quality tako-yaki!"},{"name":"KAMAITACHI","text":"Oh, bugger... The urchin girl wanted me to give it to Soroban..."}],"reward":{"gil":4500,"items":[{"num":3,"id":23167,"one":1},{"num":3,"id":23168,"one":1}],"instance":61},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68551]},"next":[68688]},"partials":[{"type":"npc","id":"1019178","obj":{"i":1019178,"n":"Bunchin","l":2409,"q":10}},{"type":"item","id":"23167","obj":{"i":23167,"n":"Super-Potion","l":290,"c":20604,"t":44}},{"type":"item","id":"23168","obj":{"i":23168,"n":"Super-Ether","l":290,"c":20627,"t":44}},{"type":"instance","id":"61","obj":{"i":61,"n":"The Swallow's Compass","c":61801,"t":"Dungeons","min_lvl":70,"max_lvl":70,"min_ilvl":330}},{"type":"quest","id":"68551","obj":{"i":68551,"n":"An Auspicious Encounter","g":22,"l":"The Ruby Sea","s":301,"f":1}},{"type":"quest","id":"68688","obj":{"i":68688,"n":"The Fire-bird Down Below","g":22,"l":"The Ruby Sea","s":321,"f":1}}]}