{"quest":{"name":"Tidings from the East","location":"Rhalgr's Reach","id":68558,"patch":4.2,"sort":12,"icon":100755,"eventIcon":71201,"issuer":1019468,"target":1024726,"involved":[1020337,1020463,1020622,1024727,1024728],"genre":7,"journal":["Lyse has tidings to share with you.","Lyse is busy apprising you of recent developments in Ala Mhigo when Alphinaud and Alisaie arrive bearing word from Tataru. Apparently, Hancock has acquired information of great interest and no small amount of urgency, leaving you little choice but to set out at once for the offices of the East Aldenard Trading Company in distant Kugane.","At the Ruby Bazaar, Hancock shares a tantalizing rumor: that individuals resembling Gosetsu and Yotsuyu were but recently seen walking the streets of Kugane. Though you struggle to comprehend how they could possibly have escaped Doma Castle alive, the fact remains that the Garleans were sufficiently convinced to dispatch a sizable contingent of soldiers to hunt them down. Never one to leave a comrade at an enemy's mercy, you agree to join Yugiri in her quest for the truth.","Ever eager to help, Hancock has taken the liberty of employing “one of the finest informants money can buy” to aid in the search. He awaits you in the back streets of Sanjo Hanamachi...","To no one's surprise, the informant turns out to be Gyodo, the Namazu who unwisely betrayed you to the Empire during your first visit to Kugane. Promising no more funny business, he shares a promising lead: an elderly Roegadyn samurai recently sold a katana of surpassing craftsmanship to a pawnbroker on Kogane Dori. While Alisaie accompanies Gyodo to a meeting with his imperial connections, you and the others will seek out the pawnbroker to ascertain whether the weapon in question did indeed belong to Gosetsu."],"objectives":["Head to the Ruby Bazaar offices in Kugane.","Speak with Alisaie in Sanjo Hanamachi."],"dialogue":[{"name":"LYSE","text":"<span class=\"highlight\">Forename</span>! Great timing! I was just about to send word to the Scions. I've got <span class=\"emphasis\">lots</span> to tell you!"},{"name":"LYSE","text":"The council has officially recognized the Resistance as our standing army. And I expect you can guess who's been appointed commander. Suffice it to say, we're in good <span class=\"emphasis\">hand</span>!"},{"name":"LYSE","text":"Having the Bull of Ala Mhigo at the helm's done wonders for morale. People were dancing in the streets when the announcement was made. And we have you and the sultana to thank for it. If you two hadn't worked your magic, he'd never have contemplated following his heart."},{"name":"MNAAGO","text":"The council has also decreed that we're to maintain a presence at Rhalgr's Reach. Lyse will continue to lead our forces in the Fringes─a job she's been doing tirelessly. A bit <span class=\"emphasis\">too</span> tirelessly, some might say. We're constantly having to remind her to rest before she falls over."},{"name":"LYSE","text":"That's an exaggeration─and I always get up again. Anyway, we can hardly afford to lower our guard now. Not after our latest brush with Lakshmi. Speaking of which, we've been keeping a close eye on the Qalyana, and it looks like they've chosen a new leader."},{"name":"LYSE","text":"It's, um...Shanti's daughter. You know, the half-dead one. For whatever reason, the Qalyana thought she was the best candidate. Which makes them leaderless, basically."},{"name":"LYSE","text":"As things stand, there's no prospect of engaging in talks, let alone coming to an understanding."},{"name":"LYSE","text":"But I won't let that stop me. I'll keep on reaching out to them until they finally see sense."},{"name":"LYSE","text":"Just like I've been reaching out to Fordola. She still won't meet my gaze, but she's given up trying to ignore me. It may only be the odd grunt, but at least she's responding. I'll get through to her yet."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>, there you are!"},{"name":"LYSE","text":"Alphinaud, Alisaie! Is everything all right?"},{"name":"ALISAIE","text":"We've received word from Tataru. Hancock has apparently acquired information of great interest and urgency. More than that she didn't say─only that we should come to Kugane right away."},{"name":"ALPHINAUD","text":"I had a mind for the two of us to set forth together, but Alisaie is determined to make it a party of three."},{"name":"ALISAIE","text":"As I've told you more than a dozen times, Brother, my wounds are quite healed, and I would benefit from some fresh air. Besides, you may well need an extra pair of hands."},{"name":"ALPHINAUD","text":"Worry not, Sister, I have quite given up trying to convince you."},{"name":"ALPHINAUD","text":"Whether we be two or three, we should depart as soon as possible. You will be joining us, I trust?"},{"name":"LYSE","text":"Huh. I was about to say I'd come too, but I'll just have to settle for cheering you on from afar. Good luck with...whatever it turns out to be!"},{"name":"ALPHINAUD","text":"Thank you, Lyse. Rest assured, should this business prove to be of even tangential concern to Ala Mhigo, we shall inform you without delay."},{"name":"ALPHINAUD","text":"Let us be off, then. Hancock and Tataru await us at the Ruby Bazaar offices."},{"name":"LYSE","text":"Give Tataru a hug from me, all right?"},{"name":"MNAAGO","text":"I hope all goes well in Kugane. Safe travels."},{"name":"EATCASSISTANT","text":"Greetings, honored <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. May I show you in?"},{"name":"SCENE00006","text":"Enter the Ruby Bazaar offices?"},{"name":"HANCOCK","text":"The informant awaits your pleasure in the back streets of Sanjo Hanamachi. From its shining facade to its dark underbelly, few know Kugane as intimately as he."},{"name":"ALISAIE","text":"“One of the finest informants money can buy”... Why do I have a bad feeling about this?"},{"name":"SOROBAN","text":"Permit me to assist you in your quest, my friends. The sooner your business is concluded, the sooner we may speak of mine!"},{"name":"SOROBAN","text":"Should your search take you away from Kugane, my boat is at your disposal. I shall see that she is ready to sail."},{"name":"TATARU","text":"I'll give Soroban a hand. If he's providing us a ship, the least we can do is supply the provisions. We'll be at the pier if you need us."},{"name":"ALPHINAUD","text":"A welcome offer and an excellent plan. Without further ado, then, let us seek out this informant in Sanjo Hanamachi."},{"name":"HANCOCK","text":"As I mentioned, the informant awaits your pleasure in the back streets of Sanjo Hanamachi. I can confidently vouch for the quality of his intelligence...if little else."},{"name":"ALPHINAUD","text":"Given the Empire's movements, it seems highly probable that Gosetsu and Yotsuyu were indeed in Kugane. Yet I can offer no explanation as to why they should be together."},{"name":"YUGIRI","text":"You have had dealings with informants in this city, have you not? Perchance you are already acquainted with this one."},{"name":"ALISAIE","text":"This should be the place. Now we wait and see who comes."},{"name":"GYODO","text":"(-???-)I-It has been a while, my friends. Yes, yes, a long while indeed."},{"name":"ALISAIE","text":"&lt;sigh&gt; I knew it."},{"name":"ALISAIE","text":"Gyodo─any funny business, and you know what will happen, I trust?"},{"name":"GYODO","text":"No, no! No funny business! Only loyal service and the finest-quality information! O-Of course...such quality does not come cheap..."},{"name":"ALISAIE","text":"...No. But then Hancock already paid you. Honestly, you must think we were born yesterday. I've half a mind to call <span class=\"emphasis\">Lyse</span>."},{"name":"GYODO","text":"No, no! No Lyse, I beg you! No boots! I will tell you everything I know─free of charge!"},{"name":"GYODO","text":"The Empire searches for Yotsuyu. High and low, far and wide. Come to enlist my help, they did, promising rich rewards for decisive information."},{"name":"ALPHINAUD","text":"And have you decisive information? Were the two individuals sighted here indeed Gosetsu and Yotsuyu?"},{"name":"GYODO","text":"Alas, see them with my own eyes, I did not. But the imperials are confident. Yes, yes, very confident indeed. Look at the size of their contingent!"},{"name":"GYODO","text":"But here is something they do not know... A rumor which you will find most interesting, I think. They say an elderly Roegadyn samurai appeared on Kogane Dori with a beauteous maiden, and sold his katana to a pawnbroker. 'Twas no common katana either, but one of surpassing craftsmanship."},{"name":"ALISAIE","text":"Well, that <span class=\"emphasis\">is</span> interesting─assuming it's true. Did you corroborate the rumor with the pawnbroker in question?"},{"name":"GYODO","text":"Ah, er...no. Regrettably, I do not have a working relationship with the master of Shofuku Shichiten..."},{"name":"ALISAIE","text":"Now why would that be, I wonder. If I didn't know better, I'd think he'd lent you money..."},{"name":"GYODO","text":"Ahem! H-He will help you, I am certain! While you speak with him, I will make contact with my Garlean connections and learn what I can of their progress."},{"name":"YUGIRI","text":"A glimpse of the blade is all I need to be sure. But is it wise to let the Namazu out of our sight?"},{"name":"Q1","text":"Can we trust Gyodo?"},{"name":"A1","text":"What choice do we have?"},{"name":"A1","text":"No, he'll betray us."},{"name":"A1","text":"..."},{"name":"GYODO","text":"No other choice but this! And a fine choice it is! Though I am adept at gathering information, it is so much more <span class=\"emphasis\">efficient</span> to share the work!"},{"name":"GYODO","text":"No, no! No more betrayals! No more boots! To divide our forces is simply more efficient!"},{"name":"GYODO","text":"D-Do not glare at me so, I beg you. To divide our forces is simply more efficient!"},{"name":"ALISAIE","text":"He's right. Given the urgency, we would do well to split up.<br>And so <span class=\"emphasis\">I</span> will go with our friend here. Nothing improves efficiency like a little supervision."},{"name":"GYODO","text":"You─ But─ Er...yes. Yes, yes. We will go together. And there will be no boots!"},{"name":"ALISAIE","text":"Let's be about it, then. Good luck with the katana. Shall we reconvene at the pier later on? Fragrant as the Ruby Bazaar offices are, I prefer the fresh air."},{"name":"ALPHINAUD","text":"I believe Alisaie has her task well in hand. Shall we seek out the pawnbroker?"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Greeting</span>!"}],"reward":{"gil":969,"emote":"Greeting","xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68508]},"next":[68559]},"partials":[{"type":"npc","id":"1019468","obj":{"i":1019468,"n":"Lyse","l":2403,"q":3}},{"type":"npc","id":"1024726","obj":{"i":1024726,"n":"Alisaie","l":2404,"q":1}},{"type":"npc","id":"1020337","obj":{"i":1020337,"n":"M'naago","l":2403,"q":7}},{"type":"npc","id":"1020463","obj":{"i":1020463,"n":"East Aldenard Trading Company Aide","l":2404,"q":4}},{"type":"npc","id":"1020622","obj":{"i":1020622,"n":"Hancock","l":2927,"q":6}},{"type":"npc","id":"1024727","obj":{"i":1024727,"n":"Alphinaud","l":2404,"q":2}},{"type":"npc","id":"1024728","obj":{"i":1024728,"n":"Yugiri","l":2404,"q":2}},{"type":"quest","id":"68508","obj":{"i":68508,"n":"Return of the Bull","g":7,"l":"The Lochs","s":11}},{"type":"quest","id":"68559","obj":{"i":68559,"n":"The Sword in the Store","g":7,"l":"Kugane","s":13}}]}