{"quest":{"name":"Elation and Trepidation","location":"The Ruby Sea","id":68561,"patch":4.2,"sort":15,"eventIcon":71201,"issuer":1024837,"target":1020524,"involved":[1019285,1019286,1024729,1024730,1024838,1024839,1024840,1024841,1024842,1024843,1024844,1024845,1024846,1024847,1024848,1024849,1024850,1024851,1024852],"genre":7,"journal":["Yugiri is eager to see Gosetsu safely back to their master."],"objectives":["Speak with Yugiri near Namai.","Ask soldiers about Jifuya.","Speak with the Liberation Front sentry.","Search for Jifuya in Yanxia.","Speak with Yugiri.","Speak with Hien."],"dialogue":[{"name":"ALPHINAUD","text":"I confess, I have never had much cause to consider the state of my personal finances...until now. Confound it..."},{"name":"ALISAIE","text":"He's absolutely <span class=\"emphasis\">mortified</span>, isn't he! Well, maybe he'll think twice before making his next grand gesture. If he ever missed an opportunity to show me how much more mature and responsible he is, I'd sympathize. I mean, I <span class=\"emphasis\">do</span>, to a point─but that doesn't mean I'm about to let him forget this."},{"name":"GOSETSU","text":"Another time, Tsuyu. Our path takes us in a different direction."},{"name":"YOTSUYU","text":"Are we going to that village? They might have dango!"},{"name":"YUGIRI","text":"We must meet with Lord Hien as soon as possible─though mayhap not at the enclave..."},{"name":"YUGIRI","text":"I will send word requesting that he receive us at the House of the Fierce, where there are fewer prying eyes."},{"name":"YUGIRI","text":"If all are in agreement, I shall scout ahead and see that the way is clear. Pray follow as swiftly as you are able, and join me on the outskirts of Namai."},{"name":"YUGIRI","text":"All is well?"},{"name":"YUGIRI","text":"Good. The others are hiding nearby. Let us proceed─quietly, if you please."},{"name":"HIEN","text":"Thank you for delivering Gosetsu back to us in one piece. We are lucky indeed to have friends who would journey to the other side of the world to help us─and repeatedly, at that."},{"name":"HIEN","text":"We have much and more to think upon, but as regards the Empire, we can but watch and wait."},{"name":"HIEN","text":"Now then, seeing as you've come all this way, you must allow me to show you around the enclave. I would not have you thinking we've been idle in your absence."},{"name":"HIEN","text":"The rebuilding effort proceeds apace, I'm pleased to say, and we are now ready to welcome home our countrymen who were displaced by the war. Should they so desire it, there is a place here for those who fled to Eorzea."},{"name":"ALPHINAUD","text":"We should be delighted to accept your invitation, Lord Hien. And I have no doubt that your subjects at Revenant's Toll will be heartened to hear that their lord has not forgotten them."},{"name":"ALISAIE","text":"...Hm? Oh, it's nothing. I just thought that Gosetsu and Yugiri would be back by now."},{"name":"YUGIRI","text":"Forgive me, my lord, but Captain Jifuya is nowhere to be found."},{"name":"HIEN","text":"Oh? He was here when I arrived."},{"name":"GOSETSU","text":"For now, we have taken Yotsuyu to a private chamber and assigned another to watch over her, my lord. But I find it passing strange that the captain should leave his post with nary a word."},{"name":"ALPHINAUD","text":"That does seem most unusual. If you mean to look for the man, we would be happy to assist you."},{"name":"YUGIRI","text":"We should be glad of the help. While I search without, mayhap you could ask our soldiers here if they know anything."},{"name":"HIEN","text":"I will join you."},{"name":"YUGIRI","text":"With respect, my lord, you should remain here. Should the Empire move against us, you will be better able to coordinate our response."},{"name":"HIEN","text":"Hah! And there I was thinking I was in charge... But you have the right of it. Go on, then. I will mind the House."},{"name":"ALPHINAUD","text":"It should come as no surprise, but a number of the soldiers here were unsettled by Yotsuyu's arrival. Thankfully, Lord Hien was able to put their minds at ease. For now."},{"name":"GOSETSU","text":"We must find Jifuya, and quickly. His disappearance would be cause to worry at the best of times, but that it should coincide with our arrival is more worrying still."},{"name":"HIEN","text":"All here know Jifuya well. His movements will not have gone unnoticed."},{"name":"HANAME","text":"You seek the captain? He passed by a little while ago."},{"name":"HANAME","text":"I, uh... I wondered if I should tell someone, as it happens. He did not look well, you see. I asked if aught was the matter and he told me the past had caught up with him. But I doubt it was that. There are older men in our ranks."},{"name":"KAIDATE","text":"Captain Jifuya? He was headed for the northern entrance when I saw him last. I was going to invite him to train with us, but he did not hear me call out to him."},{"name":"KAIDATE","text":"If you need him, I daresay the sentry on duty will be able to tell you more. Indeed, I suggested as much to Mistress Alisaie when she came asking earlier. Is something amiss?"},{"name":"HANAME","text":"If Captain Jifuya is unwell, it has nothing to do with the past catching up with him, whatever he may think. I should have said as much when he passed by..."},{"name":"KAIDATE","text":"As I keep saying, Captain Jifuya was headed for the northern entrance when I last saw him. If you wish to know where he went after that, you could do worse than ask the sentry on duty."},{"name":"ALPHINAUD","text":"It should come as no surprise, but a number of the soldiers here were unsettled by Yotsuyu's arrival. Thankfully, Lord Hien was able to put their minds at ease. For now."},{"name":"HIEN","text":"All here know Jifuya well. His movements will not have gone unnoticed."},{"name":"ALISAIE","text":"I see the trail led you here as well. This man says he saw Jifuya leave."},{"name":"RESISTANCE03025","text":"Aye, the captain went outside some few bells ago─and looking quite unwell, I am sorry to say. This I mentioned to Lord Gosetsu, who straightways struck out after him. I hope they will be all right..."},{"name":"ALISAIE","text":"Gosetsu too? It seems everyone is bent on joining the search."},{"name":"ALISAIE","text":"That's all well and good, but someone has to stay behind. There's no telling what the Empire is plotting."},{"name":"ALISAIE","text":"You go on, <span class=\"highlight\">Forename</span>. Alphinaud and I shall hold the fort."},{"name":"ALPHINAUD","text":"Alisaie has apprised me of the situation. Leave the House to us and focus on the search."},{"name":"ALISAIE","text":"Yotsuyu appears to be behaving herself─for now."},{"name":"HIEN","text":"So Jifuya went for some fresh air, did he? Whatever his business may be, I hope you find him soon."},{"name":"ALISAIE","text":"The captain went outside looking quite unwell. Lord Gosetsu has since gone to find him."},{"name":"GOSETSU","text":"He does not appear to have come this way..."},{"name":"YUGIRI","text":"So Jifuya did venture outside. Wherever he is, he cannot yet have gone far."},{"name":"ALPHINAUD","text":"Have you not seen Yugiri? We need everyone present, and urgently."},{"name":"ALISAIE","text":"Jifuya can't be the only one here with a mortal fear of Yotsuyu. She tormented these people."},{"name":"HIEN","text":"Gosetsu told me Jifuya's tale. His past conduct was...regrettable. But the man has served the Liberation Front with distinction for years, and that should not be forgotten. He will have his new post."},{"name":"GOSETSU","text":"Hm? Was Yugiri not with you?"},{"name":"YUGIRI","text":"Forgive me, now is not the time for brooding. Come, let us rejoin the others."},{"name":"ALPHINAUD","text":"Everyone is here. Good. There have been developments that demand our immediate attention."},{"name":"ALISAIE","text":"Jifuya can't be the only one here with a mortal fear of Yotsuyu. She tormented these people."},{"name":"GOSETSU","text":"That her mere presence should sow such strife..."},{"name":"YUGIRI","text":"Lord Hien and Master Alphinaud look troubled... Something is afoot."},{"name":"HIEN","text":"I thank you for your help in the search. Gosetsu has told me all that transpired."},{"name":"HIEN","text":"I would not presume to defend the life Jifuya led before he joined the Front. Nor will I condemn it. Frankly, it is not my place to judge. I will only say this: the Jifuya I know has ever been a man of courage. That he should feel driven to flee bespeaks the depth of his terror. Even now, Yotsuyu casts a shadow over the realm..."},{"name":"HIEN","text":"But the question of what is to be done with her must wait. The Empire is on the move once more."}],"reward":{"gil":1276,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68560]},"next":[68562,68622]},"partials":[{"type":"npc","id":"1024837","obj":{"i":1024837,"n":"Yugiri","l":2409,"q":2}},{"type":"npc","id":"1020524","obj":{"i":1020524,"n":"Hien","l":2410,"q":6}},{"type":"npc","id":"1019285","obj":{"i":1019285,"n":"Haname","l":2410,"q":5}},{"type":"npc","id":"1019286","obj":{"i":1019286,"n":"Kaidate","l":2410,"q":3}},{"type":"npc","id":"1024729","obj":{"i":1024729,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1024730","obj":{"i":1024730,"n":"Gosetsu","l":2410,"q":1}},{"type":"npc","id":"1024838","obj":{"i":1024838,"n":"Alphinaud","l":2409,"q":2}},{"type":"npc","id":"1024839","obj":{"i":1024839,"n":"Alisaie","l":2409,"q":2}},{"type":"npc","id":"1024840","obj":{"i":1024840,"n":"Gosetsu","l":2409,"q":2}},{"type":"npc","id":"1024841","obj":{"i":1024841,"n":"Yotsuyu","l":2409,"q":2}},{"type":"npc","id":"1024842","obj":{"i":1024842,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1024843","obj":{"i":1024843,"n":"Alphinaud","l":2410,"q":1}},{"type":"npc","id":"1024844","obj":{"i":1024844,"n":"Gosetsu","l":2410,"q":1}},{"type":"npc","id":"1024845","obj":{"i":1024845,"n":"Alisaie","l":2410,"q":1}},{"type":"npc","id":"1024846","obj":{"i":1024846,"n":"Liberation Front Sentry","l":2410,"q":1}},{"type":"npc","id":"1024847","obj":{"i":1024847,"n":"Jifuya","l":2410,"q":1}},{"type":"npc","id":"1024848","obj":{"i":1024848,"n":"Alisaie","l":2410,"q":2}},{"type":"npc","id":"1024849","obj":{"i":1024849,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1024850","obj":{"i":1024850,"n":"Alphinaud","l":2410,"q":2}},{"type":"npc","id":"1024851","obj":{"i":1024851,"n":"Gosetsu","l":2410,"q":2}},{"type":"npc","id":"1024852","obj":{"i":1024852,"n":"Yugiri","l":2410,"q":2}},{"type":"quest","id":"68560","obj":{"i":68560,"n":"Hope on the Waves","g":7,"l":"Kugane","s":14}},{"type":"quest","id":"68562","obj":{"i":68562,"n":"Storm on the Horizon","g":7,"l":"Yanxia","s":16}},{"type":"quest","id":"68622","obj":{"i":68622,"n":"Precious Reclamation","g":82,"l":"The Doman Enclave","s":10,"f":1}}]}