{"quest":{"name":"A Guilty Conscience","location":"Yanxia","id":68564,"patch":4.2,"sort":18,"eventIcon":71201,"issuer":1024989,"target":1024999,"involved":[1024971,1024974,1024990,1024991,1024994,1024995,1024997,1024998,1025000,1025026],"genre":7,"journal":["Asahi has had his fill of adventure for one day."],"objectives":["Speak with Yugiri.","Speak with Hien."],"dialogue":[{"name":"ALISAIE","text":"Quite the swordsman, isn't he. I wonder, did the Empire train him to kill before or after appointing him ambassador..."},{"name":"YUGIRI","text":"The Red Kojin's presence here does not bode well. We must inform Lord Hien."},{"name":"ASAHI","text":"Well, after that little ordeal, I believe it may be time for us to return to the enclave."},{"name":"ALISAIE","text":"Return, my lord? But what of Namai? You seemed so eager to observe the villagers going about their daily lives."},{"name":"ASAHI","text":"To be frank, I still am. But I rather doubt the good people of Namai would take kindly to the sight of a man in imperial uniform with blood still dripping from his blade. Even in your company, my presence would only prove a distraction."},{"name":"ASAHI","text":"Fret not, however. Thanks to the three of you, I have seen a great deal more than I otherwise would. And with any luck, Lord Hien will have finished considering my proposal by the time we return."},{"name":"ALISAIE","text":"Did you see the sincerity in his eyes when he spoke with Azami? I feel strange saying this, but...what if he truly <span class=\"emphasis\">has</span> come to sue for peace?"},{"name":"ASAHI","text":"I trust you will inform Lord Hien of our encounter with the Red Kojin? If we are to deter them from encroaching on Yanxia, our response must be swift and decisive."},{"name":"MAXIMA","text":"I understand you served as the ambassador's escort. My thanks."},{"name":"YUGIRI","text":"Thank you again for agreeing to join me. If not for your aid, the Kojin may well have overwhelmed us."},{"name":"YUGIRI","text":"Pray go on ahead. Lord Hien is expecting you. I will remain without and keep watch over our guest."},{"name":"ALISAIE","text":"Well, we had best not keep him waiting."},{"name":"YUGIRI","text":"Lord Hien was quite insistent that you join him. Pray go on ahead. I will keep watch over the ambassador."},{"name":"ALISAIE","text":"Judging by the sparkle in Alphinaud's eyes, their discussion was <span class=\"emphasis\">riveting</span>. How sorry I am to have missed it."},{"name":"ALPHINAUD","text":"Feeling refreshed, I trust? We have considered the ramifications of this proposal from every angle, and I believe Lord Hien has reached a decision."},{"name":"HAKURO","text":"Master Alphinaud has shared with us his knowledge of the eikons, and reminded us of the threat they pose in so doing. It is strangely comforting to know the Empire shares our concern."},{"name":"KIENKANGATEKEEPER03028","text":"You are expected, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">sir</span></span>. Shall I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"HIEN","text":"Welcome back, my friend. Yugiri tells me you accompanied her and Asahi on a tour of Yanxia. I had hoped you might take the opportunity to recover from your exertions at Sakazuki..."},{"name":"HIEN","text":"...But I gather your time was well spent. Until the ambassador affords Yugiri a chance to make a full report, however, I must rely on you to supply the details. So please─tell us how it all unfolded."},{"name":"ALPHINAUD","text":"The Red Kojin? Here? Have there been any other such incidents since the liberation?"},{"name":"HIEN","text":"Only one, that I am aware of. If they are planning some new venture here in Yanxia, we will need to increase patrols."},{"name":"HIEN","text":"Not that I am aware of. If they are planning some new venture here in Yanxia, we will need to increase patrols."},{"name":"HIEN","text":"In any event, I am indebted to you for fighting them off. But tell me─and don't be modest─was Asahi <span class=\"emphasis\">truly</span> the first to leap to the youngsters' aid?"},{"name":"ALISAIE","text":"He was. I was quick to doubt him when we first met, but his desire to save them seemed quite genuine. It's possible he truly believes what he's saying."},{"name":"HIEN","text":"In the time I've known you, you have always been an excellent judge of character. What do you make of the ambassador?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He may very well be an honorable man."},{"name":"A1","text":"I still don't think he can be trusted."},{"name":"A1","text":"..."},{"name":"HIEN","text":"Oh, how I would love to believe that. An ally within the Empire could change everything. It could give us a real chance at peace."},{"name":"HIEN","text":"Then the question of what his true intention may be remains."},{"name":"HIEN","text":"He confounds you too, I see. And for that reason alone, we would be fools to underestimate him."},{"name":"HIEN","text":"Regardless of his aim, I am resigned to playing his game. For now, at least."},{"name":"ALISAIE","text":"Well, forswearing summoning should be simple enough, considering you never dabbled in it in the first place─which just leaves the somewhat thornier question of how to police the Red Kojin."},{"name":"HIEN","text":"It was with that very question in mind that I sought Alphinaud's counsel. Thanks to his knowledge of the eikons and the rituals used to invoke them, I believe we've identified a workable solution."},{"name":"ALPHINAUD","text":"As you will recall, Susano was summoned forth using the power of relics locked away in the Kojin's treasure vault on the Isle of Zekki. Though said relics remain there to this day, it is all but certain that the act of summoning exhausted their stores of aether making subsequent summonings impossible."},{"name":"ALPHINAUD","text":"Assuming that is the case, preventing the primal's return rests on denying the Red Kojin the means to amass new stores of aether, either via the acquisition of crystals or the relics they are wont to collect."},{"name":"HIEN","text":"For this, I plan to enlist the aid of our friends the Blue Kojin. Since Doma's liberation, we have forged closer bonds with Bunchin and his people, and with their support, I am quite confident we can keep the Red from obtaining what they require to call upon this Susano."},{"name":"ALISAIE","text":"And what of the prisoners?"},{"name":"HIEN","text":"They will be exchanged as agreed, and I will give full credit to Asahi for the success of the transaction. If there is aught we can do to help the Populares garner favor, I mean to see it done."},{"name":"HIEN","text":"But first, I have some unfinished business to attend to. Would you all come with me?"},{"name":"ALISAIE","text":"Yes, of course, but...what manner of business?"},{"name":"HIEN","text":"A past mistake which I would see put right. One which has weighed heavy on my mind..."}],"reward":{"gil":752,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68563]},"next":[68565]},"partials":[{"type":"npc","id":"1024989","obj":{"i":1024989,"n":"Asahi","l":2410,"q":2}},{"type":"npc","id":"1024999","obj":{"i":1024999,"n":"Hien","l":2847,"q":4}},{"type":"npc","id":"1024971","obj":{"i":1024971,"n":"Alisaie","l":2813,"q":4}},{"type":"npc","id":"1024974","obj":{"i":1024974,"n":"Kienkan Guardsman","l":2813,"q":2}},{"type":"npc","id":"1024990","obj":{"i":1024990,"n":"Yugiri","l":2410,"q":2}},{"type":"npc","id":"1024991","obj":{"i":1024991,"n":"Alisaie","l":2410,"q":2}},{"type":"npc","id":"1024994","obj":{"i":1024994,"n":"Asahi","l":2813,"q":2}},{"type":"npc","id":"1024995","obj":{"i":1024995,"n":"Maxima","l":2813,"q":2}},{"type":"npc","id":"1024997","obj":{"i":1024997,"n":"Alisaie","l":2847,"q":1}},{"type":"npc","id":"1024998","obj":{"i":1024998,"n":"Alphinaud","l":2847,"q":1}},{"type":"npc","id":"1025000","obj":{"i":1025000,"n":"Hakuro","l":2847,"q":2}},{"type":"npc","id":"1025026","obj":{"i":1025026,"n":"Yugiri","l":2813,"q":2}},{"type":"quest","id":"68563","obj":{"i":68563,"n":"His Forgotten Home","g":7,"l":"The Doman Enclave","s":17}},{"type":"quest","id":"68565","obj":{"i":68565,"n":"Rise of a New Sun","g":7,"l":"Kienkan","s":19}}]}