{"quest":{"name":"A Fortune in Salt","location":"Rhalgr's Reach","id":68566,"patch":4.3,"sort":10040,"icon":100783,"eventIcon":71221,"issuer":1025653,"target":1025115,"genre":103,"journal":["The perky peddler is expounding on the sublime qualities of Saltery salt.","A peddler you encounter in Rhalgr's Reach recognizes you as the hero of the Ala Mhigan revolution. After thanking you profusely for your role in improving his life, he passes on a request from Wiscar, asking that you visit the Lochs─and the Saltery─at your earliest convenience.","You arrive in the Lochs to find Wiscar eager to show you the sights of the restored Saltery. The air buzzes with activity, and you hear the enthusiastic cries of merchants as they seek to secure a favorable price...","With wonder bordering on disbelief, Wiscar points out the bustle of commerce which now fills the previously desolate village. Next on the tour: a look at the heart of the Saltery's operations.","Now that you've witnessed the revival you helped begin, Wiscar urges you to have a word with his grandfather. Watt awaits you near the center of the village.","Even as Watt welcomes your visit to the Saltery, your reunion is interrupted by the arrival of “Lady Lilira” and a familiar manservant. Judging by her exchange with the village elder, it seems the disguised sultana has come to ensure all is well following the deal brokered with Lolorito and his East Aldenard Trading Company. Nanamo leaves satisfied, and the workers of the Saltery gather to express to you their gratitude. Though the salt is once more flowing, the assembled Ala Mhigans are dedicated to completing the village's restoration, and sharing their prosperity across the region."],"objectives":["Speak with Wiscar at the Saltery.","Speak with Wiscar.","Speak with Watt."],"dialogue":[{"name":"MERCHANT03030","text":"Salt! Get yer salt! Gourmet quality, fresh from the Saltery!"},{"name":"MERCHANT03030","text":"Here now, aren't you <span class=\"highlight\">Forename Surname</span>, the hero of the revolution!? They say you played a big part in reviving the Saltery's operations!"},{"name":"MERCHANT03030","text":"It's an honor, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, a true honor! And good timing, too─I'm soon to head back across the border, and do my part in reminding Eorzea's markets what proper salt tastes like."},{"name":"MERCHANT03030","text":"I was living in Ul'dah before, you see, in one of those refugee tent camps. Never thought I'd set foot in Ala Mhigo again, let alone be handed a job when I got there. And it's all thanks to you!"},{"name":"MERCHANT03030","text":"Come to think of it, Wiscar was wondering if I'd spot you here in Rhalgr's Reach. If I saw you, he said I was to ask you to visit the Saltery whenever you have the time. I'm sure he's eager to share how far they've come with the rebuilding!"},{"name":"MERCHANT03030","text":"Any plans to head to the Saltery? You deserve to see firsthand how the town has come alive!"},{"name":"WATT","text":"Ah, you're young Wiscar's friend. Welcome. Has my grandson finished showing you around the sights of our newborn Saltery?"},{"name":"WISCAR","text":"We might need to move those cranes a bit to the─ Oh, <span class=\"highlight\">Forename</span>, you came! Our trader spied you in Rhalgr's Reach, did he?"},{"name":"WISCAR","text":"As you can see, the Saltery's restoration is coming along nicely. Care to have a closer look at what we've accomplished so far?"},{"name":"WISCAR","text":"You should witness the success you've helped achieve, and I promise I won't take too much of your time."},{"name":"WISCAR","text":"Can you believe it? Our partners in the East Aldenard Trading Company have been busy promoting our produce, and it's brought all these merchants and chefs with coin to spend."},{"name":"WISCAR","text":"There was one Miqo'te lass─a culinarian from Limsa Lominsa, she said she was─who ordered a whole wagonful of salt to be shipped back across the sea."},{"name":"WISCAR","text":"Thanks to Lord Lolorito's connections, we have the folk in place to transport huge orders damn near anywhere, and our profits have been soaring! ...Right, um, let's head over to the heart of the operation, shall we?"},{"name":"WISCAR","text":"As I understand it, masses of salt crystals build up in the shallows of the lochs. We rake it all together into those little hills you see here, and let it bake in the sun for a few days."},{"name":"WISCAR","text":"Once it's good and dried out, off to the factory it goes. That's where any unwanted rubbish is sieved out, and we end up with pure Saltery salt."},{"name":"WISCAR","text":"The brothers and sisters who've returned to us have taken to the work with a passion─though they fled into Thanalan so long ago, the love for their homeland still burns bright..."},{"name":"WISCAR","text":"And my job is to make certain no loch-dwelling beast ruins what we've reclaimed together. I patrol the shores every day, and put the advice you gave me to good use!"},{"name":"WISCAR","text":"In fact, I could use more monster-slaying wisdom if you've any to share. It's the bloody soblyns, you see. Their numbers have been on the rise of late, and getting a blade through their ore-bound hides is a chore to say the least. Any pointers on how to deal with them?"},{"name":"Q1","text":"Any pointers?"},{"name":"A1","text":"The eyes! Go for the eyes!"},{"name":"A1","text":"Hit them as hard as you can, of course! Really hard."},{"name":"WISCAR","text":"The eyes, you say...<br>That seems a bit tricky, but they certainly are exposed compared to the rest of it. I'll give it a shot!"},{"name":"WISCAR","text":"Ah... Aye! When in doubt, double your efforts!"},{"name":"WISCAR","text":"Hmmm, well I think you've seen all the changes around here. It's time we went to speak with Grandad."},{"name":"WISCAR","text":"You remember Watt, my grandfather? He's been waiting to speak with you."},{"name":"WATT","text":"I'll be with you in a moment, young'un. Just let me finish up here..."},{"name":"WATT","text":"Welcome, welcome! As you can see, the Saltery is back in business."},{"name":"WATT","text":"We've even got the daughter of an Ul'dahn merchant house come to inspect our operations. Ah, speaking of the lass..."},{"name":"NANAMOULNAMO","text":"We have observed the method of your salt production, Master Watt, and I must say the process is quite fascinating..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Your Grace...?"},{"name":"A2","text":"Lady Lilira!"},{"name":"NANAMOULNAMO","text":"Wh-Why would you address me in such a fashion? I am but a merchant's daughter. Our house may be palatial, but 'tis for certain no palace!"},{"name":"WATT","text":"Ahahaha, now there's a pretty picture! Can you imagine the sultana herself trudging through malms of dusty countryside just to visit our humble village?"},{"name":"NANAMOULNAMO","text":"Indeed. The very idea is ridiculous..."},{"name":"NANAMOULNAMO","text":"Y-Yes, 'tis I, Lilira. What strange coincidence that our paths should cross in this unlikely place..."},{"name":"WATT","text":"Oh, you know each other, then? I s'pose an adventurer meets all sorts of folk, trudging from one end of the realm to the other."},{"name":"NANAMOULNAMO","text":"Yes, well... Ahem, Master Watt, I must compliment you on your salted fish. The dish we sampled was exquisite!"},{"name":"WATT","text":"Thank you, miss. The Saltery was once famous not only for its salt, but also the goods we seasoned with its produce. We hoped you might take a reminder of that taste back to the people of Ul'dah."},{"name":"NANAMOULNAMO","text":"Yes, I will certainly discuss the potential for bringing such wares to market with our partners."},{"name":"NANAMOULNAMO","text":"And whilst we are on the subject of partners, Master Watt, I understand you run the Saltery with the assistance of the East Aldenard Trading Company. Are the profits of your joint venture being properly apportioned?"},{"name":"WATT","text":"I'm not sure I follow, miss..."},{"name":"PAPASHAN","text":"I-I believe Mistress Lilira wishes to know whether or not the East Aldenard Trading Company is claiming an unfair share of the coin."},{"name":"WATT","text":"Ah, well, we had a bright young man by the name of Alphinaud draft us a watertight contract to avoid that sort of problem. Do you know of any reason we should worry...?"},{"name":"NANAMOULNAMO","text":"Nay, my good man, no reason. Carry on as you were."},{"name":"NANAMOULNAMO","text":"Pray continue these fine efforts to support your countrymen's return, and restore the glory of Ala Mhigo."},{"name":"WATT","text":"Y-Yes, miss, I will..."},{"name":"WISCAR","text":"She was a bit full of herself, wasn't she? The way she spoke, you'd think she was bloody royalty or something..."},{"name":"WATT","text":"Seeing as our young hero's come to visit, what say we gather everyone to mark the occasion?"},{"name":"WATT","text":"The battle with the Empire took its toll, and left our Saltery in ruins. We were left to squat in the rubble of our livelihood."},{"name":"WATT","text":"But look now: our kin return to us from Ul'dah, and our village is alive again with peddlers and traders."},{"name":"WATT","text":"We had neither the coin nor the might to remake our home, until you and the sultana took our cause as your own. For that, we are truly thankful."},{"name":"WATT","text":"We've rebuilt what was needed to get things running, aye, but war's talons gouged deep."},{"name":"WATT","text":"Many buildings still lie broken, and it'll take time to put it all back the way it was."},{"name":"WATT","text":"But we won't let your boon go to waste. Day by day, we'll keep adding to this foundation you've laid, and bring lasting prosperity for all of Ala Mhigo!"}],"reward":{"gil":1038,"items":[{"num":3,"id":19907},{"num":3,"id":19827,"one":1},{"num":3,"id":19819,"one":1},{"num":3,"id":21088,"one":1},{"num":3,"id":19810,"one":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68610]}},"partials":[{"type":"npc","id":"1025653","obj":{"i":1025653,"n":"Perky Peddler","l":2403,"q":1}},{"type":"npc","id":"1025115","obj":{"i":1025115,"n":"Watt","l":2408,"q":1}},{"type":"item","id":"19907","obj":{"i":19907,"n":"Ala Mhigan Salt Crystal","l":288,"c":22617,"t":54}},{"type":"item","id":"19827","obj":{"i":19827,"n":"Stewed River Bream","l":290,"c":24312,"t":46}},{"type":"item","id":"19819","obj":{"i":19819,"n":"Jerked Jhammel","l":288,"c":24353,"t":46}},{"type":"item","id":"21088","obj":{"i":21088,"n":"Chawan-mushi","l":320,"c":24261,"t":46}},{"type":"item","id":"19810","obj":{"i":19810,"n":"Steppe Tea","l":320,"c":24410,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"68610","obj":{"i":68610,"n":"The Primary Agreement","g":7,"l":"Kienkan","s":24}}]}