{"quest":{"name":"Rise of a New Sun","location":"Kienkan","id":68565,"patch":4.2,"sort":19,"icon":100758,"eventIcon":71201,"issuer":1025008,"target":1020622,"involved":[1020214,1024971,1024972,1024994,1024995,1025000,1025009,1025010,1025012,1025016,1025017,1025019,1025020,1025021,1025022,1025023,1025024,1025026,1025354],"genre":7,"journal":["Lord Hien has at last reached a decision.","Lord Hien has agreed to the proposed exchange of prisoners on one condition: that Yotsuyu be granted exemption from the transaction should her memory fail to return by the appointed hour. Though plainly displeased by this stipulation, Asahi eventually consents, but not without making one final request: a moment to speak with his beloved sister in private. Hien duly grants his wish, and Asahi is admitted to Yotsuyu's quarters. Doing your best to ignore Gosetsu's obvious anxiety, you wait without, imagining the worst, but when Asahi finally emerges, he concedes that Yotsuyu's condition is not feigned, and entrusts her to Hien's care. It would seem that all is well.","Having agreed upon the finer details of the exchange, there is naught left to do but bid Asahi and his associates farewell. You dutifully escort them back to their ship along the bank of the One River.","Moments prior to departing, Asahi pulls you aside to offer special thanks. Or so he claims. With his back turned to the others, his smile quickly changes to a scowl, and he issues an ominous threat. Yet even as he begins to speak, you are overcome by a vision of the past, wherein you discover he is in fact a fervent admirer of the late Lord Zenos. Realizing you have witnessed his thoughts only serves to stoke the flames in his eyes, and he castigates you for presuming to oppose his master before stalking away. You watch openmouthed as his airship disappears into the distance, dumbfounded by his sudden show of petulance.","Noting your troubled expression, Hien asks if something is amiss, and you distractedly recount your exchange with Asahi. The tale leaves Yugiri and Alisaie understandably aghast, but Hien appears unmoved. Though he concedes the incident does not bode well for the coming prisoner exchange, he remains determined to see it through. After assuring you that he will send word when all of the necessary preparations have been made, he bids you rest, and so you depart for Kugane together with Alphinaud and Alisaie.","Despite your best efforts, the questions raised by Yotsuyu's return have yet to be satisfactorily answered, and the appearance of her stepbrother only adds to the uncertainty. Yet the light of hope cannot be suffered to dim. Regardless of Asahi's aims, you and yours must be ready, that Doma might never again fall under the shadow of imperial rule."],"objectives":["Speak with Hien.","Speak with Hancock at the Ruby Bazaar in Kugane."],"dialogue":[{"name":"ALPHINAUD","text":"I had no idea Yotsuyu's return weighed so heavily on Lord Hien's mind..."},{"name":"ALISAIE","text":"I couldn't say if Yotsu─I mean, <span class=\"emphasis\">Tsuyu's</span> predicament is the will of the kami, but Gosetsu certainly seems convinced."},{"name":"HAKURO","text":"It would seem Lord Hien has at last reached a decision. The uncertainty in his eyes has given way to resolve."},{"name":"YUGIRI","text":"Please tell me Lord Hien is ready to speak with the ambassador. The residents of the enclave grow restless for want of news."},{"name":"ASAHI","text":"Have you heard aught from Lord Hien? I had hoped he might have had sufficient time to consider my proposal."},{"name":"MAXIMA","text":"The Empire works for the betterment of all. But I see the fear in these people's eyes... Mistakes have been made."},{"name":"KIENKANGATEKEEPER03028","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"HIEN","text":"With Yotsuyu safely in Gosetsu's care, all that remains is to answer Asahi's proposal. I realize other matters demand your attention, but I would ask that you stay awhile longer to see this business through."},{"name":"GOSETSU","text":"Forgive me, my lord, but...has he not been gone overlong? Perhaps I should─"},{"name":"HIEN","text":"Calm yourself, Gosetsu. I understand your concern, but we have to wait. He deserves that much."},{"name":"ASAHI","text":"I am sorry to have kept you all waiting. Thank you for your understanding."},{"name":"ASAHI","text":"Long did I dream of this reunion, but never did I imagine it would be so joyless. A part of me hoped your stories of her condition were just that. But alas, it is as you say."},{"name":"GOSETSU","text":"Tsuyu... Do you remember anything of this man? Anything at all?"},{"name":"YOTSUYU","text":"I... No."},{"name":"ASAHI","text":"I am a stranger to her. That much was clear to me from a single look. I leave her in your care."},{"name":"HIEN","text":"As you wish."},{"name":"ASAHI","text":"Now, if you will excuse me, my superiors are long overdue a report. They will be elated to hear of our agreement, of that I have no doubt."},{"name":"ASAHI","text":"As for the exchange itself, once I have obtained the relevant permissions, I will arrange for your people to be relieved of their various duties, and sent here to Yanxia. This will take time, of course..."},{"name":"HIEN","text":"Of course. You may rest assured your soldiers will be well cared for until your return. We will also begin taking steps to better counter the threat of the Kojin and their eikon."},{"name":"HIEN","text":"Before you take your leave─there is one other matter...<br>I am informed it was you who took the lead in rescuing two young Domans from a band of Kojin sellswords. I have not yet had the time to thank you properly."},{"name":"ASAHI","text":"Please, there is no need to thank me. I only did what anyone would do under the circumstances. Fortunately, I was in good company at the time."},{"name":"ASAHI","text":"The blight of the Red Kojin is of the Empire's making. Were it not for our transgressions, those children would not have needed saving."},{"name":"ASAHI","text":"The people of Doma have suffered enough, my lord. And I promise to do all in my power to spare them further pain, be it at the hands of the Kojin, or indeed the Empire."},{"name":"HIEN","text":"I pray the Emperor will see things as you do. There may yet be hope for us all."},{"name":"ASAHI","text":"Until we meet again."},{"name":"HIEN","text":"Gosetsu. As before, I leave Yotsuyu to you."},{"name":"HIEN","text":"I invite the rest of you to join me outside. Let's treat Asahi to a proper farewell."},{"name":"ALPHINAUD","text":"Without the threat of imperial attack hanging over our heads, we may devote our energies to dealing with the Red Kojin. And then there will be nothing left to impede Doma's restoration."},{"name":"ALISAIE","text":"If only our previous encounters with the Empire had been this cordial. Here's to the future, I suppose..."},{"name":"YUGIRI","text":"I wondered if the sight of her stepbrother might bring Yotsuyu back to her senses...but mayhap nothing will. Nevertheless, we must continue to watch her until we can be certain that her condition is permanent."},{"name":"ASAHI","text":"If my dear sister's memory does not return, I pray you will take good care of her."},{"name":"MAXIMA","text":"Lord Hien has made a wise decision. Our superiors will be pleased."},{"name":"HAKURO","text":"If Yotsuyu is to remain in Doma for good, we cannot keep her confined to this manor. The people must be made to see that she is no longer the monster they remember."},{"name":"HIEN","text":"The ambassador's airship awaits at Castrum Fluminis. Let us be off."},{"name":"ALPHINAUD","text":"Are you quite well? You looked as if you were about to faint in the ambassador's arms for a moment there."},{"name":"ALISAIE","text":"Why the frown? Did he say something to upset you?"},{"name":"YUGIRI","text":"I thought perhaps now we could be at ease, but your expression suggests otherwise. What troubles you, <span class=\"highlight\">Forename</span>?"},{"name":"ALISAIE","text":"It makes no sense. Why would he bother keeping up the pretense for so long, only to drop it right before the very end?"},{"name":"ALPHINAUD","text":"Perhaps he no longer thought it necessary, having secured Doma's cooperation in the prisoner exchange."},{"name":"HIEN","text":"If he truly is a disciple of Zenos, 'tis possible emotions simply got the better of him. Remaining calm around the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who slew his lord will have taken its toll."},{"name":"HIEN","text":"Whatever the explanation, now is not the time for hasty reprisals."},{"name":"HIEN","text":"We shall proceed as planned. The Red Kojin must be placed under surveillance and the Garlean prisoners made ready for the exchange...<br>But you need not concern yourself with the details."},{"name":"HIEN","text":"Leave the affairs of Doma to us. When the hour of the exchange draws near, we will call for you."},{"name":"ALPHINAUD","text":"I should certainly hope so. Whatever the Empire's true intent, we would be on hand to play our part, either to defend Doma, or to help usher in a lasting peace."},{"name":"ALPHINAUD","text":"I had thought we might use this time to return to Eorzea, but given the volatility of the situation, mayhap it would be best if we remained in Kugane."},{"name":"ALISAIE","text":"Agreed. Between Yotsuyu's amnesia and Asahi's dubious agenda, I'd say we have ample reason to remain in the neighborhood.<br>If anything should happen─anything at all─you must send for us at once."},{"name":"HIEN","text":"Oh, I will. On that you have my word. Charting a path through this sea of troubles promises to be difficult enough. I am not so proud as to attempt the feat alone."},{"name":"ALPHINAUD","text":"To Kugane, then. Tataru and the others must know of what transpired here."},{"name":"HIEN","text":"If what you saw of the ambassador is an indication of his true nature, this prisoner exchange may not be what it seems. In fact, I'm beginning to wonder if your encounter with the Red Kojin was more than mere happenstance."},{"name":"YUGIRI","text":"Soon we shall see if Asahi is true to his word. If not, I will be glad to cut out that silver tongue of his."},{"name":"ALPHINAUD","text":"Since we have naught else to attend to for the moment, perhaps this would be a good opportunity to look into the present state of Garlemald...? Though I should probably speak with Tataru first..."},{"name":"ALISAIE","text":"I don't envy Lord Hien. So much rests on his decision."},{"name":"TATARU","text":"Welcome back, <span class=\"highlight\">Forename</span>! We heard the good news about Gosetsu! I <span class=\"emphasis\">knew</span> you'd find him!"},{"name":"HANCOCK","text":"...My. It seems you're all in quite the predicament. Well, should we receive any urgent missives from Doma, rest assured you will be the first to know of it."},{"name":"TATARU","text":"Yes, of course. We're pursuing a number of ventures to replenish our coffers, but I suppose that all can wait if any urgent news should come through the office."},{"name":"TATARU","text":"Yes, of course. We're discussing ideas to replenish our coffers, but I suppose that all can wait if any urgent news should come through the office."},{"name":"ALPHINAUD","text":"Ah... Ahem. About that... I wish to apologize, Tataru. It was reckless of me to make such a purchase without first consulting you. You may be certain, however, that I mean to reimburse the Scions, even if it means drawing upon my personal funds."},{"name":"TATARU","text":"That's very thoughtful of you, but I'm sure it won't come to that."},{"name":"TATARU","text":"If Soroban's business proposition is as promising as it sounds, <span class=\"highlight\">Forename</span> should have no difficulty wiping the red from our ledger."},{"name":"ALPHINAUD","text":"Forgive me, <span class=\"highlight\">Forename</span>. It would seem I have unwittingly heaped my financial troubles upon you. I swear I will pay you back."},{"name":"ALPHINAUD","text":"Though I fear I will struggle to cobble together anything of monetary value, knowledge I can gather in abundance. To start, I plan to investigate the divisions forming within the Empire. Mayhap Riol and his associates have heard something on the subject..."},{"name":"ALPHINAUD","text":"Regardless, the more we know about the politics of Garlemald, the better our chances of predicting the imperials' next move, which <span class=\"emphasis\">might</span> yield you an advantage on the day of the prisoner exchange."},{"name":"ALPHINAUD","text":"Knowing what we do of Asahi's apparent resentment towards you, I cannot say what he hopes to gain from it."},{"name":"ALPHINAUD","text":"But if there is even the faintest chance that a lasting peace could be forged between Doma and the Empire, what choice have we but to try? Lord Hien had the right of it: Asahi may very well be a monster, but we must play his game. For now."},{"name":"ASAHI","text":"Arranging the prisoner exchange proved easier than I thought."},{"name":"ASAHI","text":"Yes, my lord will be most pleased. Everything is going according to plan."}],"reward":{"gil":2072,"items":[{"id":22469},{"id":26879,"one":1},{"id":26880,"one":1},{"id":26881,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68564]},"next":[68606]},"partials":[{"type":"npc","id":"1025008","obj":{"i":1025008,"n":"Hien","l":2847,"q":1}},{"type":"npc","id":"1020622","obj":{"i":1020622,"n":"Hancock","l":2927,"q":6}},{"type":"npc","id":"1020214","obj":{"i":1020214,"n":"Tataru","l":2927,"q":1}},{"type":"npc","id":"1024971","obj":{"i":1024971,"n":"Alisaie","l":2813,"q":4}},{"type":"npc","id":"1024972","obj":{"i":1024972,"n":"Alphinaud","l":2813,"q":1}},{"type":"npc","id":"1024994","obj":{"i":1024994,"n":"Asahi","l":2813,"q":2}},{"type":"npc","id":"1024995","obj":{"i":1024995,"n":"Maxima","l":2813,"q":2}},{"type":"npc","id":"1025000","obj":{"i":1025000,"n":"Hakuro","l":2847,"q":2}},{"type":"npc","id":"1025009","obj":{"i":1025009,"n":"Alisaie","l":2847,"q":2}},{"type":"npc","id":"1025010","obj":{"i":1025010,"n":"Alphinaud","l":2847,"q":1}},{"type":"npc","id":"1025012","obj":{"i":1025012,"n":"Hien","l":2813,"q":1}},{"type":"npc","id":"1025016","obj":{"i":1025016,"n":"Asahi","l":2813,"q":1}},{"type":"npc","id":"1025017","obj":{"i":1025017,"n":"Maxima","l":2813,"q":1}},{"type":"npc","id":"1025019","obj":{"i":1025019,"n":"Hien","l":2410,"q":1}},{"type":"npc","id":"1025020","obj":{"i":1025020,"n":"Alisaie","l":2410,"q":1}},{"type":"npc","id":"1025021","obj":{"i":1025021,"n":"Alphinaud","l":2410,"q":1}},{"type":"npc","id":"1025022","obj":{"i":1025022,"n":"Yugiri","l":2410,"q":1}},{"type":"npc","id":"1025023","obj":{"i":1025023,"n":"Alphinaud","l":2927,"q":2}},{"type":"npc","id":"1025024","obj":{"i":1025024,"n":"Alisaie","l":2927,"q":1}},{"type":"npc","id":"1025026","obj":{"i":1025026,"n":"Yugiri","l":2813,"q":2}},{"type":"npc","id":"1025354","obj":{"i":1025354,"n":"Kienkan Guardsman","l":2813,"q":1}},{"type":"item","id":"22469","obj":{"i":22469,"n":"Cyan's Theme Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"26879","obj":{"i":26879,"n":"Dai-ryumyaku Armor of Fending Coffer (IL 370)","l":1,"c":26509,"t":61}},{"type":"item","id":"26880","obj":{"i":26880,"n":"Dai-ryumyaku Armor of Maiming Coffer (IL 370)","l":1,"c":26509,"t":61}},{"type":"item","id":"26881","obj":{"i":26881,"n":"Dai-ryumyaku Armor of Striking Coffer (IL 370)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68564","obj":{"i":68564,"n":"A Guilty Conscience","g":7,"l":"Yanxia","s":18}},{"type":"quest","id":"68606","obj":{"i":68606,"n":"Gosetsu and Tsuyu","g":7,"l":"Ruby Bazaar Offices","s":20}}]}