{"quest":{"name":"Hope on the Waves","location":"Kugane","id":68560,"patch":4.2,"sort":14,"icon":100756,"eventIcon":71201,"issuer":1024738,"target":1024836,"involved":[1019167,1019168,1019169,1019898,1020451,1021505,1024737,1024743,1024744,1024745,1024821,1024822,1024823,1024824,1024825,1024826,1024827,1024828,1024829,1024830,1024831,1024832,1024833,1024834,1024835,1024837,1024838,1024839,1024840,1024841],"genre":7,"journal":["Gosetsu's trail leads to the sea, and that is where Yugiri would go.","Having confirmed that Gosetsu and Yotsuyu are bound for Doma, it is time to seek Soroban at the pier and avail yourself of his boat.","Soon after you arrive at the pier, Alisaie shares Gyodo's latest intelligence: the imperial contingent charged with finding Yotsuyu is preparing to deploy to the Ruby Sea. Plainly, the Garleans share your belief that their quarry is bound for Doma. Alphinaud's subsequent admission that he purchased Gosetsu's katana with Scion funds leaves Tataru aghast, but she sets aside her dismay and sends you off to continue your search. Your next stop is the Ruby Price. If Gosetsu and Yotsuyu have indeed set sail, there is a good chance the sentries there will have seen them.","Before you can speak with the sentries, chaos erupts: the Empire has launched an attack against the Confederate stronghold on Sakazuki. Wasting no time, you hasten to join the defensive effort, and your heart skips a beat as you make out a familiar figure─Gosetsu. The old samurai lives still, but whether he does so much longer depends on you. Without breaking stride, you hurl yourself between him and his assailants, and at length succeed in beating them back.<br><br>Having dealt with the immediate danger, you may turn your attention to your ailing comrade...and his unlikely traveling companion.","At Alphinaud's prompting, Gosetsu recounts the miraculous tale of his survival. When the keep collapsed around them, he and Yotsuyu plunged into the One River and were swept out to sea where they drifted for days, before finally coming to rest on the shore of a desert island. Though she came through the ordeal whole of body, Yotsuyu awoke bereft of her memory, and Gosetsu, unable to decide her fate, resolved to deliver her to Hien for his judgment.","Your most pressing questions thus answered, it is time to take your leave of Sakazuki. Alphinaud duly leads the way to the nearby pier, where he hopes Alisaie and Soroban will be waiting with the boat.","Alisaie's joy at being reunited with Gosetsu is soured by the presence of Yotsuyu, whom she treats with unveiled suspicion. In a bid to diffuse the tension, Alphinaud loudly declares that the party should set sail without delay, and Soroban is happy to oblige, delivering everyone to the shore on the outskirts of Isari.","After bidding the rest of the party farewell, Soroban asks that you grant him a moment to discuss a business venture which he claims will be extremely lucrative. It would, he adds, present a golden opportunity to recoup the Scion funds so carelessly spent on a certain katana and restore Tataru to good cheer besides. At last aware of the cost of his largesse, Alphinaud sheepishly encourages you to take Soroban up on his offer."],"objectives":["Speak with Soroban at Pier #2.","Speak with Alphinaud.","Join Alisaie.","Speak with Soroban near Isari.","Defeat the imperial forces!"],"dialogue":[{"name":"ALPHINAUD","text":"For all our success in tracing Gosetsu's movements, how he came to be traveling with Yotsuyu remains a mystery─to say nothing of this dango business..."},{"name":"YUGIRI","text":"While doubts remain over the identity of Gosetsu's traveling companion, for now we can but follow the trail."},{"name":"YUGIRI","text":"Come, let us away to the pier, and make ready to sail. With luck, Alisaie will already have joined Master Soroban and Mistress Tataru there."},{"name":"YUGIRI","text":"The others all did their part. I am truly blessed to have such dependable comrades."},{"name":"ALPHINAUD","text":"Apparently, Gyodo did his duty and then promptly excused himself. Couldn't bear another moment under Alisaie's withering gaze, I expect."},{"name":"ALISAIE","text":"I watched Gyodo meet with his imperial associate, and I have to say I'm impressed. He has sycophancy down to a fine art."},{"name":"TATARU","text":"While we were arranging the provisions, Soroban told me all about his many business ventures. Honestly, his nose for profit puts mine to shame!"},{"name":"SOROBAN","text":"Excellent timing, my friends. Mistress Alisaie arrived mere moments ago."},{"name":"ALISAIE","text":"All went well at my end. Gyodo met with an imperial officer and wheedled his way to some new information."},{"name":"ALISAIE","text":"It seems the troops who recently arrived in Kugane came directly from Garlemald. The imperials based here have been kept in the dark."},{"name":"ALISAIE","text":"And that's not all. A contingent of the aforementioned troops are preparing for deployment to the Ruby Sea. If I didn't know better, I'd say they'd picked up Gosetsu's trail."},{"name":"ALPHINAUD","text":"Then your information matches ours. We are quite certain that Gosetsu seeks to cross to the mainland."},{"name":"TATARU","text":"I'm sorry─did I hear that right? You used Scion funds to buy Gosetsu's katana...<span class=\"emphasis\">at the asking price</span>?"},{"name":"ALPHINAUD","text":"Aye, well, we were in some haste, and it seemed a worthwhile gesture. Speaking of which, here is the contract of sale. Pray see that the man is paid."},{"name":"TATARU","text":"Thal's...beard. You agreed to <span class=\"emphasis\">this</span>? Give me strength..."},{"name":"TATARU","text":"&lt;sigh&gt; Well, it's not like the search can wait. You'd best be on your way."},{"name":"TATARU","text":"But Alphinaud─we need to talk. I want you to come straight to the offices as soon as you get back. Promise me."},{"name":"ALPHINAUD","text":"Oh? Very well. I shall call upon you as soon as I return."},{"name":"SOROBAN","text":"First, let us go to the Ruby Price. If Gosetsu has already set sail, the sentries there are sure to have seen him."},{"name":"YUGIRI","text":"Judging by her reaction, Mistress Tataru is none too pleased. I apologize if the katana has caused strife."},{"name":"ALISAIE","text":"(What <span class=\"emphasis\">is</span> the going rate for a priceless weapon, I wonder... And now I know who not to ask.)"},{"name":"SOROBAN","text":"Mistress Tataru seems in low spirits. Happily, my latest venture may prove just the tonic."},{"name":"ALPHINAUD","text":"Tataru seemed rather vexed, did she not? Ever the melodramatist. I am sure our finances can stretch to a single sword."},{"name":"ALPHINAUD","text":"Remind me to explain the value of such gestures when we next see her. Ah, but I digress. We have work to do."},{"name":"YUGIRI","text":"Few suffered more at Yotsuyu's hands than Gosetsu. If this is his wish, so be it."},{"name":"GOSETSU","text":"With you and yours at our side, we have naught to fear. Thank you, my friend."},{"name":"YOTSUYU","text":"Are you coming with us?"},{"name":"TANSUI","text":"...You still here? Do us a favor and take that damnable woman far away before she calls down more destruction upon us."},{"name":"RASHO","text":"Word has reached me of the attack on Sakazuki. It seems we are in your debt yet again."},{"name":"HIUN","text":"That imperial craft appeared like a bolt out of the blue. By the time we had gathered our wits, it was already above our heads."},{"name":"SHIHOJI","text":"Hmph, were I thirty years younger, I'd have made short work of the likes of them..."},{"name":"YUSUI","text":"Things could've been a lot worse. The imperials could've come here looking for blood."},{"name":"ALPHINAUD","text":"As Tansui says, we should move on. It would not do for Yotsuyu to be seen here."},{"name":"ALPHINAUD","text":"Now, if I know my sister, she will already be waiting with the boat at the nearby pier. Let's go and see if I'm right."},{"name":"YUGIRI","text":"Gosetsu lives. All other considerations should pale next to that. And yet..."},{"name":"GOSETSU","text":"I understand I have the Scions to thank for my katana's safe return. A samurai's blade is his soul, and no words will suffice to express my gratitude for reuniting me with mine."},{"name":"YOTSUYU","text":"Everyone's staring at me..."},{"name":"SOROBAN","text":"Are we certain she is the real Yotsuyu?"},{"name":"ALPHINAUD","text":"And here she is, just as I anticipated. I am only surprised she agreed to hold off until the Empire withdrew."},{"name":"ALISAIE","text":"Gosetsu! Thank the gods you're safe! It was all I could do to watch the battle from afar!"},{"name":"SOROBAN","text":"And it was all <span class=\"emphasis\">I</span> could do to restrain her."},{"name":"ALISAIE","text":"Can you blame me for worrying? Strong as <span class=\"highlight\">Forename</span> is, anything could happen in the chaos."},{"name":"ALISAIE","text":"...But enough about me. We need to talk about <span class=\"emphasis\">her</span>."},{"name":"YOTSUYU","text":"Um... Greetings?"},{"name":"ALISAIE","text":"They tell me you've lost your memory─and that's fine. But I want you to know something: I won't be taking my eyes off you. Not for a moment."},{"name":"YOTSUYU","text":"These people are strange. Are you sure they're your friends?"},{"name":"GOSETSU","text":"I am. They may behave...strangely, but I trust them with my life. You have naught to fear."},{"name":"YOTSUYU","text":"All right, if you say so."},{"name":"YUGIRI","text":"..."},{"name":"ALPHINAUD","text":"R-Right! 'Tis past time we set sail! I for one would not keep Lord Hien waiting without due cause."},{"name":"SOROBAN","text":"Aye, and the longer we tarry, the more we risk inviting trouble. Lest you forget, the Red Kojin bear no love for Yotsuyu either."},{"name":"SOROBAN","text":"I shall deliver you to familiar shores, near Isari but out of the villagers' sight."},{"name":"YUGIRI","text":"Let us make haste to the city. Lord Hien must know of this."},{"name":"ALPHINAUD","text":"Though I only know Yotsuyu by reputation, this woman could scarce seem more different."},{"name":"ALISAIE","text":"We'd do well to give Isari a wide berth─for everyone's sake."},{"name":"GOSETSU","text":"Another time, Tsuyu. Our path takes us in a different direction."},{"name":"YOTSUYU","text":"Are we going to that village? They might have dango!"},{"name":"SOROBAN","text":"Here is where we part ways, my friends. I pray the remainder of your journey passes uneventfully."},{"name":"SOROBAN","text":"<span class=\"highlight\">Forename</span>, when you are not otherwise occupied, I would speak with you about my next business venture."},{"name":"SOROBAN","text":"It promises to be extremely lucrative, and I do not say so lightly."},{"name":"SOROBAN","text":"After the prodigious sum spent acquiring a certain sword, it would present a fine opportunity to refill the Scions' coffers and restore the smile to Mistress Tataru's face!"},{"name":"ALPHINAUD","text":"Oh, come along─Tataru was overreacting. How much could a single katana possibly cost?"},{"name":"ALISAIE","text":"Far more than you think, plainly."},{"name":"ALISAIE","text":"A blade like Gosetsu's is worth a fortune. Enough to buy a house and furnish it. Which you would know had you bothered to <span class=\"emphasis\">check the price</span>."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">What</span>? I-I had no idea..."},{"name":"ALPHINAUD","text":"Th-This business venture of Soroban's─you will give it fair hearing, I trust? He has been good to us, after all! As for me, I...I think I shall look into drawing upon my personal funds..."},{"name":"ALPHINAUD","text":"&lt;sputter&gt; Haha! &lt;cough&gt; &lt;cough&gt; I did it! &lt;gasp&gt;"},{"name":"YUGIRI","text":"No time to rest, Master Alphinaud! Our allies are sorely pressed!"},{"name":"TANSUI","text":"Well, look who it is. I won't say no to the help, but I'm not best pleased that we need it."},{"name":"TANSUI","text":"You're here for the old man, yes? He's at the top. You'd best hurry."},{"name":"LEADER","text":"Focus on the enemy! We'll see to Lady Yotsuyu when they're dead!"},{"name":"ALPHINAUD","text":"Come, let us even the odds!"},{"name":"LEADER","text":"Reinforcements! I need reinforcements!"},{"name":"YUGIRI","text":"That they should still have magitek armor in reserve... Steel yourselves!"},{"name":"LEADER","text":"Bah, we have no time for this!"},{"name":"TANSUI","text":"Watch out! He means to blow it up!"},{"name":"LEADER","text":"Damn it! Reinforcements! I need more reinforcements!"},{"name":"YUGIRI","text":"Two of them... We shall need a strategy.<br><span class=\"highlight\">Forename</span>, draw the armor this way!"},{"name":"LEADER","text":"Stubborn swine─you force my hand! Deploy the hexadrone!"},{"name":"ALPHINAUD","text":"Have care! We know not what we face!"},{"name":"LEADER","text":"Activate turrets! Fire! Fire at will!"},{"name":"ALPHINAUD","text":"Back! All of you!"},{"name":"LEADER","text":"All forces─to me! Forget the rest!"},{"name":"ALPHINAUD","text":"There are too many... Draw them to me─I shall finish this!"},{"name":"YUGIRI","text":"Mist and shade─take form and go forth!"},{"name":"YUGIRI","text":"<span class=\"highlight\">Forename</span>, my shadows and I shall tend to half. The rest is yours!"},{"name":"ALPHINAUD","text":"All right─brace yourselves!<br>Stars above...rain destruction upon mine enemies!"},{"name":"YUGIRI","text":"No... I was so close..."},{"name":"ALPHINAUD","text":"Forgive me..."},{"name":"TANSUI","text":"Ungh... Out of...luck."}],"reward":{"gil":2392,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68559]},"next":[68551,68561]},"partials":[{"type":"npc","id":"1024738","obj":{"i":1024738,"n":"Yugiri","l":2404,"q":2}},{"type":"npc","id":"1024836","obj":{"i":1024836,"n":"Soroban","l":2409,"q":2}},{"type":"npc","id":"1019167","obj":{"i":1019167,"n":"Hiun","l":2409,"q":2}},{"type":"npc","id":"1019168","obj":{"i":1019168,"n":"Yusui","l":2409,"q":2}},{"type":"npc","id":"1019169","obj":{"i":1019169,"n":"Shihoji","l":2409,"q":2}},{"type":"npc","id":"1019898","obj":{"i":1019898,"n":"Tansui","l":2409,"q":3}},{"type":"npc","id":"1020451","obj":{"i":1020451,"n":"Alisaie","l":2404,"q":4}},{"type":"npc","id":"1021505","obj":{"i":1021505,"n":"Rasho","l":2409,"q":4}},{"type":"npc","id":"1024737","obj":{"i":1024737,"n":"Alphinaud","l":2404,"q":2}},{"type":"npc","id":"1024743","obj":{"i":1024743,"n":"Soroban","l":2404,"q":1}},{"type":"npc","id":"1024744","obj":{"i":1024744,"n":"Yugiri","l":2404,"q":1}},{"type":"npc","id":"1024745","obj":{"i":1024745,"n":"Alphinaud","l":2404,"q":1}},{"type":"npc","id":"1024821","obj":{"i":1024821,"n":"Tataru","l":2404,"q":1}},{"type":"npc","id":"1024822","obj":{"i":1024822,"n":"Alphinaud","l":2409,"q":1}},{"type":"npc","id":"1024823","obj":{"i":1024823,"n":"Yugiri","l":2409,"q":1}},{"type":"npc","id":"1024824","obj":{"i":1024824,"n":"Alisaie","l":2409,"q":1}},{"type":"npc","id":"1024825","obj":{"i":1024825,"n":"Soroban","l":2409,"q":1}},{"type":"npc","id":"1024826","obj":{"i":1024826,"n":"Alphinaud","l":2409,"q":1}},{"type":"npc","id":"1024827","obj":{"i":1024827,"n":"Yugiri","l":2409,"q":1}},{"type":"npc","id":"1024828","obj":{"i":1024828,"n":"Gosetsu","l":2409,"q":1}},{"type":"npc","id":"1024829","obj":{"i":1024829,"n":"Yotsuyu","l":2409,"q":1}},{"type":"npc","id":"1024830","obj":{"i":1024830,"n":"Alisaie","l":2409,"q":1}},{"type":"npc","id":"1024831","obj":{"i":1024831,"n":"Yugiri","l":2409,"q":1}},{"type":"npc","id":"1024832","obj":{"i":1024832,"n":"Gosetsu","l":2409,"q":1}},{"type":"npc","id":"1024833","obj":{"i":1024833,"n":"Yotsuyu","l":2409,"q":1}},{"type":"npc","id":"1024834","obj":{"i":1024834,"n":"Soroban","l":2409,"q":1}},{"type":"npc","id":"1024835","obj":{"i":1024835,"n":"Alphinaud","l":2409,"q":1}},{"type":"npc","id":"1024837","obj":{"i":1024837,"n":"Yugiri","l":2409,"q":2}},{"type":"npc","id":"1024838","obj":{"i":1024838,"n":"Alphinaud","l":2409,"q":2}},{"type":"npc","id":"1024839","obj":{"i":1024839,"n":"Alisaie","l":2409,"q":2}},{"type":"npc","id":"1024840","obj":{"i":1024840,"n":"Gosetsu","l":2409,"q":2}},{"type":"npc","id":"1024841","obj":{"i":1024841,"n":"Yotsuyu","l":2409,"q":2}},{"type":"quest","id":"68559","obj":{"i":68559,"n":"The Sword in the Store","g":7,"l":"Kugane","s":13}},{"type":"quest","id":"68551","obj":{"i":68551,"n":"An Auspicious Encounter","g":22,"l":"The Ruby Sea","s":301,"f":1}},{"type":"quest","id":"68561","obj":{"i":68561,"n":"Elation and Trepidation","g":7,"l":"The Ruby Sea","s":15}}]}