{"quest":{"name":"An Unfinished Masterpiece","location":"The Interdimensional Rift","id":68569,"patch":4.2,"sort":12,"icon":112267,"unlocksFunction":1,"eventIcon":71341,"issuer":1024788,"target":1024749,"involved":[1021937,1021947,1024747,1024750,1024787,1024789,1024790,1025175],"genre":19,"journal":["Cid wishes to discuss your next opponent.","After Cid describes the nature of your next opponent, Nero presents you with a new invention designed to aid in its defeat─the Chocobo Brush. Though he leaves you none the wiser about how it actually works, you gather that the brush will allow you to directly influence the world in which you find yourself. Speak with the waiting Alpha to begin the next stage of Omega's experiment.<br><br>※In the event that you leave the Interdimensional Rift, you may re-enter by speaking with the Ironworks hand at the Yawn.","Alpha stands ready to enter the Sigmascape with you. Keep a tight grip on the Chocobo Brush, and prepare to battle the haunting Chadarnook!<br><br>※Sigmascape V2.0 can be accessed via the Duty Finder.","You have defeated the possessed painting. Return to the Interdimensional Rift and speak with Cid.","You recount your victory to your waiting companions, and Nero appears particularly pleased with the efficacy of his invention. He is in the midst of warning you about the brush's decidedly limited range of alternative applications when Cid receives a linkpearl communication from Jessie. It seems that Biggs and Wedge have slipped away from their sickbeds, intent on returning to the Yawn...","Outside the rift once more, you meet with an anxious Biggs and Wedge. Cid reassures them that, despite some minor difficulties, you have managed to overcome each of Omega's challenges thus far. The two engineers duly pledge their unswerving support, and you cannot help but feel buoyed by their infectious enthusiasm."],"objectives":["Speak with Alpha.","Enter Sigmascape V2.0.","Speak with Cid.","Speak with Biggs."],"dialogue":[{"name":"NERO","text":"Ahahaha! The glorious absurdity of it all! Even you must have managed a smile. One wonders what Omega has in store for you next. A delinquent rowing boat, perhaps? Or an angry cable car?"},{"name":"ALPHA","text":"Kwe-kwe-kweh... Kwe-kwe-kweh..."},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Will you be descending into the Yawn?"},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"CID","text":"I expect you're still recovering from your last fight, but we should probably go over the details of your next opponent all the same."},{"name":"CID","text":"According to our research, you'll be pitted against a foe known as “Chadarnook.” Not a train this time, but some manner of animated <span class=\"emphasis\">painting</span>..."},{"name":"CID","text":"To be perfectly clear, the name refers more to the evil spirit that's taken up residence within the picture─but the “picture” part will be key to our strategy."},{"name":"CID","text":"To that end, Nero has thrown together a little something I thought might be useful..."},{"name":"NERO","text":"\"Thrown together,“ he says. Do you know how difficult it was to translate your abstract fancy into an actual tool with practical applications?"},{"name":"NERO","text":"What you demanded was nothing less than a miracle─and a miracle I have delivered!"},{"name":"CID","text":"I seem to recall you <span class=\"emphasis\">insisting</span> on constructing it yourself. Still, credit where credit's due─well done."},{"name":"NERO","text":"Hmph. History will appreciate my genius."},{"name":"NERO","text":"Ahem! To you I present the fruits of my labor─the Chocobo Brush. I won't confuse you by trying to explain how it works, but suffice it to say that I have adapted the tool to combat the peculiar nature of your rival. Put simply: you will be able to directly influence the space around you by painting pictures."},{"name":"NERO","text":"Naturally, this process will require <span class=\"emphasis\">paint</span>. As for the color, subject, and efficacy of your masterpieces, well...that shall depend entirely upon your own artistic sense."},{"name":"NERO","text":"Now, back to you, Garlond. Do you notice the absence of a steaming cup in my hand? If you truly valued the efforts of your colleagues, you might consider <span class=\"emphasis\">filling the bloody kettle</span> from time to time!"},{"name":"NERO","text":"Or is that another task his lordship the “Chief” can't accomplish without the help of his subordinates?"},{"name":"CID","text":"Now listen here, Nero─I apologize for the damn kettle, but this has nothing to do with my upbringing!"},{"name":"CID","text":"Oh, sorry, <span class=\"highlight\">Forename</span>─little distracted there. Talk to Alpha when you're ready, and we can see about crossing this Chadarnook character off the list."},{"name":"NERO","text":"There was really no need to make it resemble a brush. But as we had a ready supply of chocobo feathers, I thought: why not? Now, let's see what it's capable of, shall we?"},{"name":"SYSTEM","text":"Next to the kettle is one of Alpha's cards, its face illustrated with a depiction of spring water..."},{"name":"ALPHA","text":"Kweh...? Kweh kweh!"},{"name":"SYSTEM","text":"Alpha appears keen to begin the next encounter. You may enter Sigmascape V2.0 whenever you are ready."},{"name":"ALPHA","text":"Kweh...? Kweh kweh!"},{"name":"NERO","text":"I'll wager the spirit was less than thrilled at being beaten at its own game. I must say, these field tests are fast becoming my favorite part of this whole experience!"},{"name":"ALPHA","text":"Kweh...kweh...kweh!"},{"name":"CID","text":"Welcome back, <span class=\"highlight\">Forename</span>! I was on the edge of my stool watching you attempt to paint whilst fighting, but you soon seemed to get the hang of it!"},{"name":"CID","text":"I'm glad our makeshift solution worked as intended."},{"name":"NERO","text":"Our “makeshift solution” worked as intended because I made it work. Painting is easy, as is intending."},{"name":"NERO","text":"I feel I should remind you, however, that the brush was very specifically designed with that arena and that foe in mind. Against aught else, it will avail you precisely as well as any other brush."},{"name":"CID","text":"...One moment.<br>Aye, this is Garlond."},{"name":"CID","text":"...That's great news! And wh─<br>...Oh, they did, did they? ...Understood, we'll meet them out there."},{"name":"CID","text":"That was Jessie. Apparently, Biggs and Wedge considered themselves well enough to pay us a visit. They're on their way to the Yawn."},{"name":"CID","text":"Fancy a brief jaunt to the surface?"},{"name":"NERO","text":"No thank you. I have data to analyze."},{"name":"CID","text":"Fine. Just the three of us, then."},{"name":"CID","text":"Look at the two of you, up and about already! You gave us quite a scare..."},{"name":"WEDGE","text":"<span class=\"highlight\">Forename</span>! Did you come out just to see us!?"},{"name":"ALPHA","text":"Kweh! Kweh!"},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I believe Biggs and Wedge have been waiting for you."},{"name":"BIGGS","text":"Chief, <span class=\"highlight\">Forename</span>...and Alpha, too! We didn't mean to drag you all away from your work."},{"name":"CID","text":"Nonsense. After all you've been through, how could we not come running? Speaking of which...should you even be walking?"},{"name":"BIGGS","text":"Er...the chirurgeon will probably want to have words with us later. But we couldn't just lie back and let you brave the rift on your own."},{"name":"WEDGE","text":"Do you even have enough hands for that much work? Who's taking care of all the little jobs?"},{"name":"CID","text":"Ah, yes...the little jobs. It does seem that you two have spoiled me. I only recently learned that the kettle does not, in fact, fill itself... But we're muddling along somehow."},{"name":"CID","text":"<span class=\"highlight\">Forename</span> has been a pillar of strength, as always, Alpha has proven to be a stalwart companion, and Nero...Nero has been invaluable and insufferable in equal measure."},{"name":"CID","text":"As for the test subjects themselves, they're certainly formidable, but Omega's experiment hasn't broken us yet. So go home. Heal. And don't come back until you've fully recovered."},{"name":"BIGGS","text":"It's good to hear that everything's going well. But you call us the moment anything goes wrong─we'll be out here in a wink, even if we have to crawl!"},{"name":"WEDGE","text":"Listen to me, Alpha. That uniform you're wearing makes you an official employee of Garlond Ironworks."},{"name":"WEDGE","text":"That means you can call on us whenever you're in trouble, and that we can call on you. It means you're not alone!"},{"name":"WEDGE","text":"Biggs and I have to go away for a while, so I want you to look out for <span class=\"highlight\">Forename</span> and the chief for us, all right?"},{"name":"ALPHA","text":"Kweh!"},{"name":"BIGGS","text":"Oh, before I forget, we brought you something to put a spring in your step. You can't fight Omega's creations on field rations alone!"},{"name":"NERO","text":"Now, what have we─ Hmmm. This next one seems strong, but exhibits no other notable traits. How dull."},{"name":"NERO","text":"The true challenge is this fourth opponent. But if I can find the patterns hidden in the chaos, then knowledge and reason will prevail."},{"name":"NERO","text":"For even the most random actions are products of an underlying logic. One has but to isolate the behavioral triggers..."},{"name":"NERO","text":"Bleh!<br>Tastes like saltwater! Why would─?"},{"name":"NERO","text":"I need to take a closer look at that card."},{"name":"OMEGA","text":"Alpha group shows signs of recovering from recent trauma. Initiating action to maintain desirable stress levels..."}],"reward":{"items":[{"num":2,"id":22447,"one":1},{"num":2,"id":22448,"one":1},{"num":2,"id":22449,"one":1},{"num":2,"id":22450,"one":1},{"num":2,"id":22451,"one":1}],"xp":0,"instance":30060},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68568]},"next":[68570]},"partials":[{"type":"npc","id":"1024788","obj":{"i":1024788,"n":"Cid","l":2284,"q":5}},{"type":"npc","id":"1024749","obj":{"i":1024749,"n":"Biggs","l":2406,"q":2}},{"type":"npc","id":"1021937","obj":{"i":1021937,"n":"Cid","l":2406,"q":3}},{"type":"npc","id":"1021947","obj":{"i":1021947,"n":"Ironworks Hand","l":2406,"q":11}},{"type":"npc","id":"1024747","obj":{"i":1024747,"n":"Alpha","l":2284,"q":4}},{"type":"npc","id":"1024750","obj":{"i":1024750,"n":"Wedge","l":2406,"q":2}},{"type":"npc","id":"1024787","obj":{"i":1024787,"n":"Nero","l":2284,"q":2}},{"type":"npc","id":"1024789","obj":{"i":1024789,"n":"Nero","l":2284,"q":3}},{"type":"npc","id":"1024790","obj":{"i":1024790,"n":"Alpha","l":2284,"q":1}},{"type":"npc","id":"1025175","obj":{"i":1025175,"n":"Alpha","l":2406,"q":1}},{"type":"item","id":"22447","obj":{"i":22447,"n":"Grade 2 Infusion of Strength","l":320,"c":20701,"t":44}},{"type":"item","id":"22448","obj":{"i":22448,"n":"Grade 2 Infusion of Dexterity","l":320,"c":20702,"t":44}},{"type":"item","id":"22449","obj":{"i":22449,"n":"Grade 2 Infusion of Vitality","l":320,"c":20703,"t":44}},{"type":"item","id":"22450","obj":{"i":22450,"n":"Grade 2 Infusion of Intelligence","l":320,"c":20704,"t":44}},{"type":"item","id":"22451","obj":{"i":22451,"n":"Grade 2 Infusion of Mind","l":320,"c":20705,"t":44}},{"type":"instance","id":"30060","obj":{"i":30060,"n":"Sigmascape V2.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":325}},{"type":"quest","id":"68568","obj":{"i":68568,"n":"No Slowing Down","g":19,"l":"The Interdimensional Rift","s":11,"f":1}},{"type":"quest","id":"68570","obj":{"i":68570,"n":"Won't Let You Pass","g":19,"l":"The Fringes","s":13,"f":1}}]}