{"quest":{"name":"No Slowing Down","location":"The Interdimensional Rift","id":68568,"patch":4.2,"sort":11,"icon":112265,"unlocksFunction":1,"eventIcon":71341,"issuer":1024788,"target":1024788,"involved":[1021947,1024747,1024786,1024787,1024789],"genre":19,"journal":["Cid is ready to discuss your foray into the Sigmascape.","Cid holds a brief strategy meeting prior to your first foray into the Sigmascape. Without a reference point within the test world, however, he reluctantly admits that he has nothing to share on the nature of the opponents you might face. Your only option is to go in blind. As before, Alpha will transfer his existential authorization to you just as soon as you have stepped into the unknown...<br><br>※In the event that you leave the Interdimensional Rift, you may re-enter by speaking with the Ironworks hand at the Yawn.","Alpha stands ready to enter the Sigmascape with you. With no way of knowing what lurks within, you can but check your gear and endeavor to be adaptable.<br><br>※Sigmascape V1.0 can be accessed via the Duty Finder.","To the bemusement of all concerned, your arrival in the Sigmascape is greeted by a homicidal train...or perhaps the ghost of one. Despite the somewhat unusual nature of your opponent, you set about your task in earnest, and eventually succeed in derailing its murderous ambitions.","You have returned to your base of operations in the rift. Speak with Cid, and discuss the aftermath of your phantom encounter.","Cid welcomes you back, full of praise for your adaptability in battle. While pleased that you now have a solid point of reference within the Sigmascape, he is nonetheless unable to say with any certainty if the test world is the recreation of a distant realm or a work of pure fiction."],"objectives":["Speak with Alpha.","Enter Sigmascape V1.0.","Speak with Cid."],"dialogue":[{"name":"NERO","text":"The “Sigmascape,” eh? I shall set to work analyzing the unspeakable horrors within."},{"name":"ALPHA","text":"Kweh..."},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Will you be descending into the Yawn?"},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"CID","text":"Before you cross the threshold, we should take a moment to discuss where we stand."},{"name":"CID","text":"<span class=\"emphasis\">That</span> is the test world you need to conquer. The Sigmascape."},{"name":"NERO","text":"Is that a mask...or a face? The castle was certainly a surprise, but this is verging on disturbing!"},{"name":"CID","text":"And we currently have no idea what it might signify. My first instinct is to dive straight into our analysis."},{"name":"CID","text":"...The problem being that without a reference point from within the Sigmascape to start from, we'll have no way of knowing if we're even analyzing the correct data."},{"name":"CID","text":"Which means you'll just have to go in blind. Hardly the best way to enter into a fight, but needs must and all that. Are you up for the challenge?"},{"name":"CID","text":"Can I ask you to join <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, Alpha? We seem to be fine out here, but <span class=\"highlight\">Forename</span> will need your authorization if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s to do battle inside the test world."},{"name":"NERO","text":"Keep your wits about you, savior. Your next opponent could be almost <span class=\"emphasis\">anything</span>!"},{"name":"CID","text":"Say the word to Alpha when you're ready. Again, I wish I had more to tell you, but I'm sure you'll manage somehow. You always do."},{"name":"NERO","text":"Ahhh... Strange technology...the ever-present threat of death... I have never felt so in my element!"},{"name":"ALPHA","text":"Kweh-kweh!"},{"name":"SYSTEM","text":"Alpha appears eager to proceed. You may enter Sigmascape V1.0 whenever you are ready."},{"name":"ALPHA","text":"Kweh-kweh!"},{"name":"MINA","text":"Traveler from afar...<br>Thank you for Doma."},{"name":"NERO","text":"Ahahaha! The glorious absurdity of it all! Even you must have managed a smile. One wonders what Omega has in store for you next. A delinquent rowing boat, perhaps? Or an angry cable car?"},{"name":"ALPHA","text":"Kwe-kwe-kweh... Kwe-kwe-kweh..."},{"name":"CID","text":"Thank the gods you're fast on your feet. When I first saw you'd be facing a train of all things, I assumed I was hallucinating."},{"name":"CID","text":"But with that oddness behind us, we can be fully certain we have the right set of data for the Sigmascape."},{"name":"CID","text":"From what we've been able to determine, this is a recreation of a devastated world."},{"name":"CID","text":"Unfortunately, we have not found any clues as to its origin. We came across several familiar terms─“Doma” included─but the arc of history is inconsistent with our own."},{"name":"CID","text":"Given that Omega draws from realms which could be fictional or even other-dimensional, we can only guess at the source upon which the Sigmascape is based. But if it <span class=\"emphasis\">was</span> fictional, it seems safe to assume that the author had a bad experience with a train."}],"reward":{"gil":4252,"xp":0,"instance":30059},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68567]},"next":[68569]},"partials":[{"type":"npc","id":"1024788","obj":{"i":1024788,"n":"Cid","l":2284,"q":5}},{"type":"npc","id":"1021947","obj":{"i":1021947,"n":"Ironworks Hand","l":2406,"q":11}},{"type":"npc","id":"1024747","obj":{"i":1024747,"n":"Alpha","l":2284,"q":4}},{"type":"npc","id":"1024786","obj":{"i":1024786,"n":"Alpha","l":2284,"q":2}},{"type":"npc","id":"1024787","obj":{"i":1024787,"n":"Nero","l":2284,"q":2}},{"type":"npc","id":"1024789","obj":{"i":1024789,"n":"Nero","l":2284,"q":3}},{"type":"instance","id":"30059","obj":{"i":30059,"n":"Sigmascape V1.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":325}},{"type":"quest","id":"68567","obj":{"i":68567,"n":"Return to the Rift","g":19,"l":"Rhalgr's Reach","s":10,"f":1}},{"type":"quest","id":"68569","obj":{"i":68569,"n":"An Unfinished Masterpiece","g":19,"l":"The Interdimensional Rift","s":12,"f":1}}]}