{"quest":{"name":"It Can Be Cruel Sometimes","location":"The Fringes","id":68575,"patch":4.2,"sort":4,"icon":100750,"beast":10,"unlocksFunction":1,"eventIcon":71341,"issuer":1024771,"target":1024952,"involved":[1019486,1024915,1024916,1024917,1024918,1024919,1024920,1025110,1025335,1025336,1025340],"genre":52,"journal":["Alpa's list of quandaries grows ever longer.<br>※The difficulty of this quest will be synced to your current level.","An Ala Mhigan traveler returning to his homeland has fallen ill while staying at Castellum Velodyna. While Alpa and J'olhmyn are discussing his condition, M'zhet Tia, self-proclaimed future nunh of the M tribe, makes an unexpected appearance and reveals that he has in fact volunteered to aid the Gatekeepers. He also claims that the stricken guest is in fact lovesick, a concept Alpa finds hard to grasp. With total disregard for more immediate concerns, M'zhet asks the group to meet him at Pike Falls, where he will demonstrate the power of love.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","After gathering an audience, the would-be nunh of the M tribe insists that the power of love can protect him from anything, including imperial grenades. In spite of Alpa's apparent concern, he asks you to pelt him with explosives in order to prove his point. He also makes it clear that he wants you to continue throwing, even if he tells you to stop.","M'zhet was supposed to have removed some of the powder from the grenades to reduce their destructive force. However, it seems he neglected to do so, resulting in a powerful blast. Of course, it is entirely possible that the remaining explosives will produce the desired effect...","You confirm that the grenades still contain the original amount of powder. Although M'zhet seems to be in a considerable amount of pain, you prepare to throw some more.","M'zhet miraculously survives the final grenade while J'olhmyn comes to the conclusion that the power of love has little to do with one's resilience to explosions. Meanwhile, the bedridden traveler has still not received any treatment, so the group decides to call on the expertise of Orella, the Resistance's resident physician.","Orella has a hunch that the disease can be cured with a mixture that includes lightning caps. However, Orella's stock has been depleted, so you head to East End with Alpa to gather these rare mushrooms.","While gathering lightning caps, Alpa is suddenly attacked by deadly flora. Luckily, you arrive to prevent her untimely demise. After disposing of the woodland predators, you rush to her aid.","It seems that only Alpa's pride was wounded and she recovers quickly. Despite her unfortunate encounter, the lightning caps she has gathered are still intact. All that remains is to deliver them to Orella at Castellum Velodyna.","You return to the castellum, where Alpa informs you that she has given the mushrooms to Orella. The medicine that she prepares takes effect with astonishing rapidity, healing the stricken traveler almost instantly. However, he reveals that he is suffering from lovesickness following his encounter with Orella and chases after her to confess his feelings. If Alpa has learned anything from this episode, it is that even in times of relative peace, people are still prone to injury and disease. She comes to the conclusion that an infirmary would be a worthy addition to the castellum."],"objectives":["Speak with M'zhet Tia at Pike Falls.","Throw a Mark XLII grenade at M'zhet Tia.","Throw another Mark XLII grenade at M'zhet Tia.","Throw yet another Mark XLII grenade at M'zhet Tia.","Speak with Orella in Rhalgr's Reach.","Rendezvous with Alpa in East End.","Aid Alpa.","Speak with Alpa at Castellum Velodyna."],"dialogue":[{"name":"ALPA","text":"Oh, there you are, <span class=\"highlight\">Forename</span>. We have the latest report on Mother's molting. J'olhmyn, if you'd be ssso kind?"},{"name":"JOLHMYN","text":"\"The broodmother's skin has become dry and slightly rough.“"},{"name":"ALPA","text":"She'll be shedding her ssskin before long."},{"name":"ALPA","text":"I'm not worried though. Even if Mother were to arrive now, I think the castellum would pass muster. The guest rooms we made have proven quite popular!"},{"name":"JOLHMYN","text":"Yes, but you're forgetting one thing. What about that poor sod who's taken ill? Your mother might find his moaning and groaning a bit off-putting..."},{"name":"ALPA","text":"I was just about to mention that. An Ala Mhigan fellow on his way home from Gridania stayed overnight, but he's come down with sssomething. We can't tell what's caused it, but he's in a terrible state."},{"name":"JOLHMYN","text":"At first, we thought the shortness of breath and flushed cheeks were just signs of fatigue. We normally give medicinal tea in cases like this, but that hasn't seemed to work."},{"name":"ALPA","text":"We'll have to try sssomething else."},{"name":"MZHETTIA","text":"Hark! Is that the sound of damsels in distress? Fear not! Your cries of despair will not go unanswered! For the future nunh of the M tribe, M'zhet Tia, has arrived!"},{"name":"MZHETTIA","text":"What are you doing, J'olhmyn? Is that any way to treat your would-be savior?"},{"name":"JOLHMYN","text":"Savior? You can “save” me the trouble of trouncing you again by buggering off and never coming back!"},{"name":"MZHETTIA","text":"Unghhh... Not quite the welcome I was expecting. Wait─is that you, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You're looking bright-eyed and bushy-tailed."},{"name":"A1","text":"I'm amazed you're not dead yet."},{"name":"MZHETTIA","text":"And you're looking well too! You know, when I signed up to assist the Gatekeepers, I didn't expect to see you here!"},{"name":"MZHETTIA","text":"Ha ha! Amazing people is my specialty! So you're helping the Gatekeepers too, eh? It's true what they say. Great minds think alike!"},{"name":"ALPA","text":"You two have met before?"},{"name":"ALPA","text":"Ssso that's how you know each other..."},{"name":"MZHETTIA","text":"Know? Our bond goes beyond that of mere acquaintances. Why, we're like <span class=\"alternative-container\"><span class=\"alternative\">siblings</span><span class=\"alternative\">brothers</span></span>!"},{"name":"ALPA","text":"If you're <span class=\"alternative-container\"><span class=\"alternative\">siblings</span><span class=\"alternative\">brothers</span></span>, it's clear to see which one got all the brains. Is he always this ssstupid?"},{"name":"MZHETTIA","text":"Ahem! I think we can discuss my virtues some other time. Captain Alpa, am I to understand a man has been struck down with a fever of some kind? If so, I may have useful information to impart."},{"name":"ALPA","text":"Go on then, tell usss!"},{"name":"MZHETTIA","text":"This unfortunate soul is lovesick! I'm absolutely certain of it!"},{"name":"MZHETTIA","text":"J'olhmyn! Your violent outbursts notwithstanding, I must admit you possess a rather charming demeanor. Perhaps your convalescent guest has fallen for your feminine wiles and cannot bring himself to part from you!"},{"name":"JOLHMYN","text":"My “feminine wiles”? I'm a soldier. Hardly the sort that has secret admirers."},{"name":"MZHETTIA","text":"Now, now! There's no need to be shy. If you ask me, you're the belle of the Resistance!"},{"name":"ALPA","text":"M'zhet, what were you saying about our guest being “lovesick”? What kind of love makes you sssick?"},{"name":"MZHETTIA","text":"The romantic kind, of course! A love that unites those destined to spend eternity together, awakening their true potential. There is nothing it cannot conquer!"},{"name":"MZHETTIA","text":"But don't take my word for it. I will demonstrate the power of love! Come to Pike Falls and bear witness to its splendor."},{"name":"MZHETTIA","text":"Remember these? That's right─they're grenades left behind by the Garleans."},{"name":"MZHETTIA","text":"I want you to throw them at me just like last time!"},{"name":"ALPA","text":"Ssstop this nonsense! You'll get yourself killed!"},{"name":"MZHETTIA","text":"Killed? I think not. I have the power of love on my side! Watch closely everyone─especially you, J'olhmyn. These explosions will be like water off an eft's back!"},{"name":"MZHETTIA","text":"(I nearly died the last time I tried this, but you needn't worry! I've definitely removed enough of the powder. Yes, no doubt about it.)"},{"name":"MZHETTIA","text":"<span class=\"highlight\">Forename</span>, I'm ready. Just keep flinging those grenades, even if I tell you stop!"},{"name":"ALPA","text":"Why are we here?"},{"name":"JOLHMYN","text":"I have no idea what's going on, but there's one thing I'm certain of: he's the biggest idiot I've ever met. And I've met a lot of idiots."},{"name":"MZHETTIA","text":"Don't hesitate! Just throw!"},{"name":"MZHETTIA","text":"Aaaiiieeeeeeeee!"},{"name":"MZHETTIA","text":"Ack! Gah! (Did I forget to take out some of the powder?) I'm perfectly fine! Let's try that again, <span class=\"highlight\">Forename</span>!"},{"name":"ALPA","text":"I don't think thisss is going to end well..."},{"name":"ALPA","text":"Aaaaaah!"},{"name":"ALPA","text":"What are you throwing it at me for? That ssstings, you know!"},{"name":"JOLHMYN","text":"Yaaaaaah!"},{"name":"JOLHMYN","text":"Stop that, would you? M'zhet's the one with a death wish around here, not me!"},{"name":"MZHETTIA","text":"(At least we know that taking out some of the powder results in a nonlethal explosion!)"},{"name":"MZHETTIA","text":"That had a bit more “bang” than I was expecting. Could you try throwing another one?"},{"name":"MZHETTIA","text":"Gaaaaaaaaagh!"},{"name":"JOLHMYN","text":"This seems like quite a dangerous way to prove the power of love. Why don't you just write a poem or something?"},{"name":"MZHETTIA","text":"Nnngh... That one was a full-sized explosion as well! <span class=\"highlight\">Forename</span>, stop for a moment!"},{"name":"ALPA","text":"Are you really going to throw that?"},{"name":"JOLHMYN","text":"That looked really painful. Is the next one ready?"},{"name":"MZHETTIA","text":"Forget what I said at the beginning! I really do want you to stop!"},{"name":"MZHETTIA","text":"Aaaaaarrrggghhh!"},{"name":"MZHETTIA","text":"No... I had so much to live for..."},{"name":"MZHETTIA","text":"..."},{"name":"ALPA","text":"He's not dead, is he?"},{"name":"MZHETTIA","text":"I cannot die here! Not today, not like this. The M tribe needs me!"},{"name":"ALPA","text":"Hooray! He's alive! And it's all because of the power of love!"},{"name":"JOLHMYN","text":"Did the power of love really protect you from being blown to pieces? Perhaps your feelings for me are genuine after all..."},{"name":"MZHETTIA","text":"What!? No, no! You've got it all wrong! One day I'll be nunh, and I'll have to serve the needs of every eligible woman in the tribe. I can't commit to just one girl!"},{"name":"JOLHMYN","text":"So that means the reason you survived has nothing to do with love. It must be something else... Well, even if you did have eyes for me, I'd poke them out with my spear."},{"name":"GALES","text":"Ah, there you are, Alpa. A certain matter has come to light and─"},{"name":"GALES","text":"Who's this?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"A lonely tia doomed to a life of solitude."},{"name":"A2","text":"A misguided fool whose attempts to impress J'olhmyn failed miserably."},{"name":"MZHETTIA","text":"That's entirely inaccurate!"},{"name":"GALES","text":"There's no need to be ashamed. You're not alone. My attempts to woo members of the fairer sex always end in disaster... I'll never find a wife at this rate."},{"name":"MZHETTIA","text":"Gods be good! A man can reach your age and <span class=\"emphasis\">still</span> be a bachelor?"},{"name":"GALES","text":"In my line of work, I meet women from far and wide. But as soon as I try to talk to them, they run a malm."},{"name":"MZHETTIA","text":"The same thing happens to me! Except in my case, I think they find my exuberant nature a tad overwhelming... Come friend, let us share our woes!"},{"name":"JOLHMYN","text":"Why do I get the feeling this was a complete waste of time? And we're not an ilm closer to helping our bedridden patron. Perhaps we should consult a proper chirurgeon."},{"name":"ALPA","text":"Now that you mention it, M'zhet's injuries might need some attention too. Although he ssseems rather well considering..."},{"name":"JOLHMYN","text":"Forget about him, he'll be fine. He's got Gales's shoulder to cry on now. Let's go to the Reach and ask Orella. She'll know what to do."},{"name":"ORELLA","text":"Would I be correct in guessing this isn't a social call?"},{"name":"ORELLA","text":"I can't say for sure, but it sounds like he's fallen victim to pleurisy."},{"name":"ORELLA","text":"The medicine he needs is fairly simple to make, but unfortunately my supply of lightning cap mushrooms has been exhausted. I'll need you to gather some from East End. Once I've got my things together, I'll go straight to Velodyna."},{"name":"ALPA","text":"Understood! J'olhmyn, stay with Orella and keep her sssafe!"},{"name":"ALPA","text":"You've met Orella before, haven't you?"},{"name":"JOLHMYN","text":"Sadly, Alpa counts as one of Orella's “regulars.” She's forever eating things she finds lying around and then wondering why she gets a stomachache. Orella's medicine usually sorts her out though."},{"name":"GALES","text":"I can't believe I've found someone whose lack of romantic experience rivals my own!"},{"name":"MZHETTIA","text":"To think that Gales is still single after all these years! What is the world coming to?"},{"name":"ORELLA","text":"While the disease is not life-threatening, I'm sure our patient would prefer that we avoid any unnecessary dillydallying."},{"name":"JOLHMYN","text":"No harm will come to Orella or her expensive-looking medical supplies as long as she's with me!"},{"name":"ALPA","text":"&lt;pant&gt; I'm lucky you arrived when you did. I know I'm not much of a fighter, but I didn't expect to be beaten by those ssstraggly-looking beasties!"},{"name":"ALPA","text":"Ssstill, I managed to get the lightning caps! We'd better get these to Orella right away!"},{"name":"ALPA","text":"Ah, there you are. I've handed the mushrooms to Orella, who is brewing her concoction as we ssspeak. All we can do now is wait."},{"name":"ALPA","text":"What's taking Orella so long? I hope everything's all right..."},{"name":"MZHETTIA","text":"Have a little faith, Alpa! Ah, here they come now!"},{"name":"ORELLA","text":"You'll be pleased to hear that the treatment was a success."},{"name":"ALPA","text":"How do you feel?"},{"name":"TRAVELLER03039","text":"That medicine worked wonders! One moment I'm at death's door, and the next I'm right as rain! Nothing can stop me finishing the last leg of my journey now."},{"name":"ORELLA","text":"Just don't overexert yourself, do you hear? It's still too early to say you've fully recovered. If you get so much as a runny nose, be sure to come and see me."},{"name":"ALPA","text":"Orella, we appreciate you coming all the way here. Eshana will arrange an essscort back to the Reach."},{"name":"MZHETTIA","text":"Well, I'd say that came to a satisfactory conclusion!"},{"name":"JOLHMYN","text":"&lt;sigh&gt; No thanks to you!"},{"name":"MZHETTIA","text":"But I could've sworn he showed signs of being lovesick..."},{"name":"TRAVELLER03039","text":"&lt;gasp&gt; How did you know?"},{"name":"MZHETTIA","text":"Know what?"},{"name":"TRAVELLER03039","text":"That I'm in love! I've never beheld such grace, such elegance, such...unfathomable beauty! Surely, she is an incarnation of Menphina herself!"},{"name":"JOLHMYN","text":"That's very flattering, but you're embarrassing me!"},{"name":"TRAVELLER03039","text":"My fever may be gone, but I yet yearn for your healing touch to ease my aching heart! Orella, my love, wait for meeeeee!"},{"name":"JOLHMYN","text":"I...I beg your pardon!?"},{"name":"MZHETTIA","text":"Don't get downhearted! “Plenty more sea in the fish” and all that!"},{"name":"ALPA","text":"If you ask me, this “love” thing all seems rather sssilly. As far as I can tell, it leads to a lot of unnecessary bother."},{"name":"ALPA","text":"In just a short ssspan of time, we've had a guest fall ill, I've nearly been eaten by carnivorous plants, and M'zhet has been blown up and beaten several times."},{"name":"ALPA","text":"I'd say it's high time this place had its own infirmary. We should get it ready before Mother returns."},{"name":"MZHETTIA","text":"My, my! While Gales and I were exchanging sob stories, it looks like you've been rather busy."},{"name":"GALES","text":"M'zhet has such a cheerful outlook despite losing his father at such a young age. My own problems pale in comparison."},{"name":"SYSTEM","text":"Castellum Velodyna now has its own infirmary."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Honored</span> reputation with the Vira."},{"name":"SYSTEM","text":"New Vira tribal daily quests are now available from Eshana at Castellum Velodyna."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Eshana as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Eshana. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Madhura."}],"reward":{"gil":1523},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}],"quests":[68574]},"next":[68576]},"partials":[{"type":"npc","id":"1024771","obj":{"i":1024771,"n":"Alpa","l":2406,"q":6}},{"type":"npc","id":"1024952","obj":{"i":1024952,"n":"Alpa","l":2406,"q":5}},{"type":"npc","id":"1019486","obj":{"i":1019486,"n":"Orella","l":2403,"q":6}},{"type":"npc","id":"1024915","obj":{"i":1024915,"n":"M'zhet Tia","l":2406,"q":1}},{"type":"npc","id":"1024916","obj":{"i":1024916,"n":"Alpa","l":2406,"q":1}},{"type":"npc","id":"1024917","obj":{"i":1024917,"n":"J'olhmyn","l":2406,"q":1}},{"type":"npc","id":"1024918","obj":{"i":1024918,"n":"Alpa","l":2403,"q":1}},{"type":"npc","id":"1024919","obj":{"i":1024919,"n":"J'olhmyn","l":2403,"q":1}},{"type":"npc","id":"1024920","obj":{"i":1024920,"n":"Alpa","l":2406,"q":1}},{"type":"npc","id":"1025110","obj":{"i":1025110,"n":"Gales","l":2406,"q":2}},{"type":"npc","id":"1025335","obj":{"i":1025335,"n":"M'zhet Tia","l":2406,"q":1}},{"type":"npc","id":"1025336","obj":{"i":1025336,"n":"Gales","l":2406,"q":1}},{"type":"npc","id":"1025340","obj":{"i":1025340,"n":"M'zhet Tia","l":2406,"q":1}},{"type":"quest","id":"68574","obj":{"i":68574,"n":"Chance of Gales","g":52,"l":"The Fringes","s":3,"f":1}},{"type":"quest","id":"68576","obj":{"i":68576,"n":"Schism between Sisters","g":52,"l":"The Fringes","s":5,"f":1}}]}