{"quest":{"name":"Have I Got News for You","location":"The Fringes","id":68578,"patch":4.2,"sort":21,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"involved":[1025051],"genre":53,"journal":["Eshana longs to know what tomorrow brings.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Gather prophetic stones from Pike Falls.","Deliver the prophetic stones to the Ananta whispermaid.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"The Velodyna Gatekeepers have done excellent work thus far monitoring our borders, but Alpa fears they grow complacent for lack of any serious threatsss."},{"name":"ESHANA","text":"In the hopesss of motivating them, I thought we might revive one of the Ananta's more ancient traditions─divinationsss."},{"name":"ESHANA","text":"To divine the fortunes of war, custom dictates one versssed in its art gather three precious stones required for the ritual. I can think of none better than you for this task."},{"name":"ESHANA","text":"When you have procured the gems we require, deliver them to the Ananta whissspermaid."},{"name":"ANANTAREADER03042","text":"To read the fortunes of war I require three prophetic ssstones. No more, no lesss. Bring them to me and all shall be revealed."},{"name":"ANANTAREADER03042","text":"You are returned. Have you the prophetic ssstones I require?"},{"name":"ANANTAREADER03042","text":"These shall do nicely. Now, let us sssee what the future holds for the Velodyna Gatekeepers."},{"name":"ANANTAREADER03042","text":"Yesss, the misssts are clearing."},{"name":"ANANTAREADER03042","text":"Great peril awaits in the days ahead. Calamity born from carelessness. They would do well not to lose focusss lest this future come to pass."},{"name":"ANANTAREADER03042","text":"Ah! I see great successs for the Gatekeepers! The efforts of their training shall be returned three─nay, four-fold!"},{"name":"ANANTAREADER03042","text":"Ahem. My apologies. 'Tis not often fortune sssmiles so favorably upon us."},{"name":"ANANTAREADER03042","text":"Ah! Great fortune awaits the Gatekeepers! An unexpected windfall for the benefit of all!"},{"name":"ANANTAREADER03042","text":"Ahem. Forgive me. It has been too long since fortune has sssmiled upon us so favorably."},{"name":"ANANTAREADER03042","text":"Hmmm... The future is riddled with uncertainty, but I sssense the potential for discord within our ranksss. Geniality is more important now than ever. "},{"name":"ANANTAREADER03042","text":"I foresee a fortuitous meeting. Newly formed ties should be treated with the greatessst of care. In doing so we shall not want for allies in times of strife."},{"name":"ANANTAREADER03042","text":"The power of the stones is spent, and thusss the vision ends."},{"name":"ANANTAREADER03042","text":"I would stay, but my sisters in Vira Nilya have need of my insssight. Pray tell Eshana what I have seen."},{"name":"ESHANA","text":"Welcome back, <span class=\"highlight\">Forename</span>. What did she have to say of our future? What fortune awaitsss the Gatekeepers?"},{"name":"ESHANA","text":"Interesting... I will make certain my sssisters hear of this and act accordingly. The word of a whissspermaid is not to be taken lightly."},{"name":"ESHANA","text":"Though not always clear, their divinations remain in our thoughts, guiding our actions in the hopes of a desirable outcome. I daresay you too would do well to adhere to her words. It may prove to your benefit."}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"npc","id":"1025051","obj":{"i":1025051,"n":"Ananta Whispermaid","l":2406,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}