{"quest":{"name":"A Real Fixer-upper","location":"The Fringes","id":68579,"patch":4.2,"sort":7,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana believes Castellum Velodyna is sorely in need of repairs.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Collect sheets of cermet plating from Pike Falls.","Deliver the sheets of cermet plating to Eshana."],"dialogue":[{"name":"ESHANA","text":"As I'm sure you recall, the battle to reclaim Castellum Velodyna was quite fierce. Naturally, the bridge did not remain unssscathed, and it is our resssponsibility to tend to its repair and maintenance. The problem, however, is we lack the proper materials to do so."},{"name":"ESHANA","text":"The Garleans erected this bridge using materials not often found in this region, but the cermet plating from their war machines has ssserved well in our work. If you could retrieve, say, three sheets of this plating, your effortsss would be greatly appreciated."},{"name":"ESHANA","text":"Were you able to find any machina worthy of sssalvaging?"},{"name":"ESHANA","text":"Yesss, this will suffice."},{"name":"ESHANA","text":"Truth be told, I find the architecture of this place to be quite crude, but for a blessing it is comprised mostly of metal. It makes for good practice of our metal-shaping magicksss."},{"name":"ESHANA","text":"Even still, it will take no sssmall amount of plating to see these repairs to completion. I sssuspect we will have need of your help again soon."}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}