{"quest":{"name":"Brooding Broodmother","location":"The Fringes","id":68572,"patch":4.2,"sort":1,"icon":100747,"beast":10,"unlocksFunction":1,"eventIcon":71341,"issuer":1021565,"target":1024771,"involved":[1020817,1024779,1024894,1024895],"genre":52,"journal":["M'rahz Nunh has a message for you.<br>※The difficulty of this quest will be synced to your current level.","M'rahz Nunh informs you that Sarisha of the Vira wishes to speak with you. He suggests that you make your way to Vira Nilya to find out how you might be of assistance.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Sarisha is adamant that her daughter Alpa returns from serving with the Resistance and commences her training as future broodmother. She requests that you deliver a letter to Rhalgr's Reach.","Alpa has founded the Velodyna Gatekeepers and been assigned as its captain. The young Vira intends to demonstrate her commitment to the Resistance and has no plans to return to her mother's side. She seeks your advice regarding the fortress and so you agree to rendezvous with her at Castellum Velodyna.","You agree to assist Alpa with her plans for Castellum Velodyna. However, Sarisha arrives unannounced to directly confront her daughter. The broodmother states that if this goal is not achieved by the time her next molting is finished, she will take her daughter back to Vira Nilya─a condition that Alpa willingly accepts. With the Gatekeepers' banners flying high, Alpa's project begins in earnest."],"objectives":["Speak with Sarisha in Vira Nilya.","Deliver Sarisha's letter to Alpa.","Speak with Alpa at Castellum Velodyna."],"dialogue":[{"name":"MRAHZNUN","text":"Greetings, <span class=\"highlight\">Forename</span>. I'm glad to see you looking hale and hearty."},{"name":"MRAHZNUN","text":"We're fortunate that you returned unscathed from that business involving the Percipient One. Thanks to you and M'zhet Tia, the Qalyana have been keeping away from it."},{"name":"MRAHZNUN","text":"Speaking of the Ananta, a messenger from the Vira came by not long ago looking for you. Sarisha has some matters she'd like to discuss with you. Perhaps you could pay her a visit?"},{"name":"SARISHA","text":"Welcome, <span class=\"highlight\">Forename</span>. Allow me to once again expresss our gratitude for your heroic deeds."},{"name":"SARISHA","text":"Your vanquishing of the Qalyana's vile sssimulacrum of Sri Lakshmi is worthy of the utmossst praise. While I am reluctant to have to ask for your aid yet again, there is a matter of persssonal importance I wish to discusss with you."},{"name":"SARISHA","text":"To think that the Qalyana should sssummon that mockery of Sri Lakshmi for a second time makes my blood boil. Our village owes much to your bravery, and yet I am compelled to request your aid once again."},{"name":"SARISHA","text":"My beloved daughter Alpa is a member of the Resissstance. Though she is young and unskilled in the ways of war, she labors tirelesssly for the freedom of Gyr Abania."},{"name":"SARISHA","text":"Now that the Garleans have relinquished their grip on the region, many Vira who ssserve in the Resissstance will be called back to Vira Nilya. As my daughter, Alpa's presence is required above all others."},{"name":"SARISHA","text":"One day, Alpa will inherit the mantle of broodmother, and there is much I must teach her. Despite our newfound freedom, many trials await in the days to come for all the peoples of Gyr Abania. We need not only ssstrong leaders, but able sssuccessors to lead us into the future."},{"name":"SARISHA","text":"I have written a letter for Alpa explaining why she must return to Vira Nilya at once. However, I anticipate that her sssuperiors will be against her leaving on sssuch short notice."},{"name":"SARISHA","text":"As a friend to the Resistance, you would be able to persssuade them to release her from ssservice. Will you grant us your cooperation?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll handle this."},{"name":"A1","text":"Sure, I suppose so."},{"name":"SARISHA","text":"Your ssselflesssnesss knows no bounds."},{"name":"SARISHA","text":"Please give thisss letter to Alpa. She is stationed in Rhalgr's Reach. I pray for a sssatisfactory outcome."},{"name":"MRAHZNUN","text":"Have you spoken with the Vira broodmother? The messenger was quite insistent that you visit sooner rather than later."},{"name":"ALPA","text":"Yes, I am Alpa. A misssive from Mother, you say?"},{"name":"ALPA","text":"Let me sssee that."},{"name":"ALPA","text":"She wants me to leave the Resistance and return to Vira Nilya? This is absssurd!"},{"name":"ALPA","text":"I'm pleased that she has such high expectations of me, but I've still got work to do here with the Resissstance!"},{"name":"JOLHMYN","text":"Oi! Calm down, will you?"},{"name":"JOLHMYN","text":"First things first. Haven't you got anything to say to the one who brought you the letter?"},{"name":"ALPA","text":"You're right. Where are my manners? I am very grateful to you for delivering this messsage."},{"name":"ALPA","text":"Ah! You're <span class=\"highlight\">Forename Surname</span>, conqueror of Cassstellum Velodyna, aren't you?"},{"name":"JOLHMYN","text":"Of course, I recognized you straightaway."},{"name":"JOLHMYN","text":"It's a pleasure to finally meet you in person. The name's J'olhmyn, and I report to Alpa here, believe it or not."},{"name":"ALPA","text":"I sssuppose I should explain why I don't want to go back, ssseeing as you've traveled all this way."},{"name":"ALPA","text":"Although I have asssumed the title of battlemaid, fighting isn't exactly my forte. I'm much better at metalworking, and since joining the Resistance, I have been placed in command of a small group of blacksmiths."},{"name":"ALPA","text":"While the others were out capturing Velodyna, I was here in the Reach crafting armaments. If only I could have been there with them!"},{"name":"ALPA","text":"I am proud of the work we do sssupporting our soldiers, but I want to be more involved. That's why I've come up with a plan to turn Castellum Velodyna into a Resistance fortress, with the newly formed Velodyna Gatekeepers in charge!"},{"name":"JOLHMYN","text":"Alpa went straight to our commanding officers and volunteered for the post of captain. It was certainly a surprise to hear they'd agreed to it! But she was only given permission on the grounds that I be assigned as her second-in-command."},{"name":"ALPA","text":"And she's been nagging me conssstantly ever since! Anyway, my blacksmiths are mainly made up of Ananta, since we excel at forging weapons and armor. On the other hand, most of the frontline units include both Ananta and ssstriders."},{"name":"ALPA","text":"Our superiors were concerned that even though I'm a member of the Resistance, I've ssspent most of the time among my own kind. J'olhmyn's here to teach me the ways of the other peoples of Gyr Abania."},{"name":"JOLHMYN","text":"Although officially she's the one leading the unit, I'm here to act as her mentor."},{"name":"JOLHMYN","text":"&lt;sigh&gt; She's still got a lot to learn about us “ssstriders” though. The other day, she tried to take off my uniform!"},{"name":"ALPA","text":"Are you ssstill going on about that? I thought you were getting ready to shed your skin so I tried to help you out of your clothes."},{"name":"JOLHMYN","text":"How many times do I have to tell you? We don't molt like Ananta, you bumbling ninny─ I just had an itchy back, that's all! And I'm quite capable of getting undressed by myself!"},{"name":"ALPA","text":"Ahem! Let's not get into all that again. Ssso, where were we? Ah, the letter."},{"name":"ALPA","text":"I will send word to Mother to tell her why I'm not going home. I'm sssorry to have involved you in all this."},{"name":"ALPA","text":"Wait! There's one more thing."},{"name":"ALPA","text":"While you're here, there's something I'd like to ask you. Would you be able to meet us at Velodyna?"},{"name":"ALPA","text":"Thank you so much! J'olhmyn and I will wait for you at the castellum."},{"name":"SARISHA","text":"Please ensure that my daughter returns to her rightful place."},{"name":"JOLHMYN","text":"Looking for Alpa? You're in luck─she's right here."},{"name":"ALPA","text":"You're here! I hope you had a sssafe journey. As I mentioned earlier, the Resistance wishes to repurpose this place as a new stronghold."},{"name":"ALPA","text":"The bridge is very important, ssstrategically ssspeaking, and is mainly used by Allied forces going to and from Gridania. But now that the imperial forces have been driven out, we can expect more civilian traffic in the future."},{"name":"ALPA","text":"That said, if ten score legionaries suddenly showed up and demanded their bridge back, we'd be hard-pressed to hold them off with the forces we have ssstationed here now."},{"name":"ALPA","text":"Tell me, <span class=\"highlight\">Forename</span>, what do other peoples do at times like thisss?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"The Grand Companies recruit fool adventurers like me..."},{"name":"A2","text":"In Ishgard, the Temple Knights petition adventurers to undertake leves."},{"name":"ALPA","text":"What a fantastic idea! Adventurers could cover our lack of enlisted sssoldiers, at least for the time being. Let's spread the word that the Velodyna Gatekeepers are offering work!"},{"name":"ALPA","text":"There's not a moment to lose! You're an adventurer─ You'll sssign up to help, won't you?"},{"name":"Q3","text":"Will you lend your strength to the Velodyna Gatekeepers?"},{"name":"A3","text":"I sssuppose I can lend you my ssstrength."},{"name":"A3","text":"Surely you can't be ssserious."},{"name":"ALPA","text":"A thousand thousand blessings upon you!"},{"name":"ALPA","text":"I understand. If that is your decision, we won't keep you here. But if you have a change of heart, you know where to find usss."},{"name":"ALPA","text":"Let's begin by─"},{"name":"ALPA","text":"Ah! Sssomeone's coming! Wait─ Is that who I think it is?"},{"name":"ALPA","text":"Mother!?"},{"name":"SARISHA","text":"I read your messsage, Alpa. You have formed the Velodyna Gatekeepers and been made their captain?"},{"name":"ALPA","text":"That's what I wrote, isn't it? I've got an important asssignment and I intend to see it through!"},{"name":"SARISHA","text":"Oh? And what is thisss “important asssignment” of which you ssspeak?"},{"name":"ALPA","text":"I'm responsssible for converting this place into a full-fledged Resistance fortress! It's vital to the defense of both Gridania and Gyr Abania!"},{"name":"SARISHA","text":"Alpa, you possesss many virtues, but ssstrength in battle is not among them. Yet you believe you are capable of leading this endeavor?"},{"name":"SARISHA","text":"Very well. The entire region ssstands to benefit from ssstrengthened borders, our village included."},{"name":"SARISHA","text":"But remember, Alpa. You are my heir. You cannot shirk this responsibility forever. You may remain here on one condition."},{"name":"SARISHA","text":"It will sssoon be time for me to shed my skin. When it is over, I shall return to inssspect this stronghold. If your work is found to be unsssatisfactory, nothing you say or do will stop me from taking you back to Vira Nilya."},{"name":"ALPA","text":"Fine! Have it your way! When you sssee what I've done with this place, you'll regret ever doubting me!"},{"name":"SARISHA","text":"I look forward to it. Until we meet again, fare you well."},{"name":"SARISHA","text":"It ssseems my debt to you continues to grow. Please, grant my daughter your counsssel. Though she is rash and impulsive, her spirit burns brightly."},{"name":"JOLHMYN","text":"So, if we succeed, Velodyna will provide Vira Nilya with greater security. If we fail, the village gets its future successor back. Your mother certainly knows how to negotiate."},{"name":"ALPA","text":"We won't fail. I'll do everything in my power, and more, to sssucceed!"},{"name":"JOLHMYN","text":"If you say so, captain! Right, what needs doing first?"},{"name":"ALPA","text":"If we're going to hire adventurers, we need to choose the right person for each job. We need to think about payment too."},{"name":"JOLHMYN","text":"Got it. I'll tell Eshana, Madhura, and the others to start getting things organized."},{"name":"ALPA","text":"I knew I could rely on you! There's still a good deal of time before Mother sheds her ssskin so let's use it as best we can. Put up the banners─they'll show everyone that this castellum is now under the jurisdiction of the Velodyna Gatekeepers!"},{"name":"ALPA","text":"I hope we can count on your help too, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"The Velodyna Gatekeepers have taken command of Castellum Velodyna."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the Vira."},{"name":"SYSTEM","text":"Vira tribal quests are now available from Eshana at Castellum Velodyna."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from Madhura."},{"name":"JOLHMYN","text":"Alpa's champing at the bit to get started, so don't keep her waiting any longer!"}],"reward":{"gil":1158},"reqs":{"jobs":[{"lvl":60,"id":34}],"quests":[68364]},"next":[68573]},"partials":[{"type":"npc","id":"1021565","obj":{"i":1021565,"n":"M'rahz Nunh","l":2406,"q":7}},{"type":"npc","id":"1024771","obj":{"i":1024771,"n":"Alpa","l":2406,"q":6}},{"type":"npc","id":"1020817","obj":{"i":1020817,"n":"Sarisha","l":2406,"q":3}},{"type":"npc","id":"1024779","obj":{"i":1024779,"n":"J'olhmyn","l":2406,"q":4}},{"type":"npc","id":"1024894","obj":{"i":1024894,"n":"Alpa","l":2403,"q":1}},{"type":"npc","id":"1024895","obj":{"i":1024895,"n":"J'olhmyn","l":2403,"q":1}},{"type":"quest","id":"68364","obj":{"i":68364,"n":"The Rose Blooms Twice","g":104,"l":"The Fringes","s":7130,"f":1}},{"type":"quest","id":"68573","obj":{"i":68573,"n":"Griffins Rampant","g":52,"l":"The Fringes","s":2,"f":1}}]}