{"quest":{"name":"Celebratory Smorgasbord","location":"The Fringes","id":68577,"patch":4.2,"sort":6,"icon":100752,"beast":10,"unlocksFunction":1,"eventIcon":71341,"issuer":1024771,"target":1024952,"involved":[1023142,1024779,1024937,1025110,1025235,1025236,1025237,1025238],"genre":52,"journal":["Alpa and J'olhmyn are formulating a plan, but what could it be?<br>※The difficulty of this quest will be synced to your current level.","Castellum Velodyna has undergone a dramatic transformation due to Alpa's ingenuity and ability to inspire others─although she would be the first to admit that none of this would have been possible without the loyal comrades at her side. In order to express her gratitude, she plans to hold a feast for a handful of her most steadfast supporters. After placing Gales in charge of procuring food and drink, she tasks you with delivering invitations to M'zhet Tia and Talha Molkoh.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","M'zhet Tia welcomes you with a broad smile and jumps at the chance of enjoying fine cuisine and fine company, especially since J'olhmyn will be attending. His response is in stark contrast to that of Tahla Molkoh, to whom the idea of eating anywhere other than a mess hall conjures images of stuffy high society banquets. She nonetheless accepts the invitation despite her concerns that she might commit some sort of social blunder.","Before you can speak at length with Alpa and J'olhmyn upon your return to the castellum, you hear sounds of distress from beyond the gate, prompting the captain to rush off by herself to investigate. In her absence, J'olhmyn confides that she has noticed a significant change in Alpa of late, and suggests taking this opportunity to watch the leader of the Gatekeepers at work.","You and J'olhmyn meet Alpa outside the gates, where a man is recounting how he barely escaped from a ravenous woodland predator. There was a time when Alpa would have relied on you to eliminate such threats, but she has grown into a confident and capable battlemaid, and does not hesitate to take matters into her own hands. She makes for the forest with one of her new Qalyana allies at her side, leaving J'olhmyn to watch the castellum. Some time later, Alpa returns having slain the fiend, and it becomes clear that she has taken to the role of captain with aplomb.","Finally, Alpa gathers the guests for the long-awaited feast. Before the meal, M'zhet finds himself dragged into a drinking contest with Gales, which quickly takes a turn for the worse as the young tia has an immediate and disastrous reaction to the spirits. Thankfully, this has little bearing on the proceedings, and shortly thereafter a sumptuous selection of culinary delights is laid out for all to enjoy, including a miraculously recovered M'zhet. The room is soon filled with conversation and laughter until Alpa rises to give a heartfelt speech, thanking her companions for their loyalty and friendship. She reaffirms her commitment to leading the Gatekeepers, while J'olhmyn pledges to support her as they continue their work at Castellum Velodyna."],"objectives":["Deliver Alpa's invitation to M'zhet Tia in the Peering Stones.","Deliver Alpa's invitation to Tahla Molkoh in Castrum Oriens.","Speak with Alpa at Castellum Velodyna.","Speak with Alpa.","Speak with Alpa again."],"dialogue":[{"name":"ALPA","text":"Oh, there you are! You're jussst in time."},{"name":"ALPA","text":"Gales! We need you too!"},{"name":"ALPA","text":"I'm hosssting a feast for a few friends of the Gatekeepers. It's a small show of thanks for all your sssupport."},{"name":"ALPA","text":"Of course, you're all invited, but I'll need sssome help."},{"name":"ALPA","text":"Gales, could you take care of the food and drink?"},{"name":"GALES","text":"Leave it to me. You can expect the finest cuisine Eorzea has to offer!"},{"name":"ALPA","text":"<span class=\"highlight\">Forename</span>, could I ask you to deliver these invitations?"},{"name":"ALPA","text":"There's one for M'zhet Tia and another for Tahla Molkoh."},{"name":"ALPA","text":"In the meantime, J'olhmyn and I will ssstart getting the place ready."},{"name":"MZHETTIA","text":"Ah, <span class=\"highlight\">Forename</span>! Up for another adventure, eh?"},{"name":"MZHETTIA","text":"Ha ha! Alpa's full of surprises! And I assume J'olhmyn will be there too?"},{"name":"MZHETTIA","text":"I wouldn't miss it for the world! I'll meet you there soon."},{"name":"TAHLAMOLKOH","text":"Greetings! What brings you to Castrum Oriens today?"},{"name":"TAHLAMOLKOH","text":"A banquet? It sounds a lot more fancy than the mess hall grub I'm used to."},{"name":"TAHLAMOLKOH","text":"Before I attend, I must consult my tomes on Gyr Abanian etiquette. I shall join you anon."},{"name":"ALPA","text":"This is my first time hosssting a dinner party. I didn't invite many people in case it all goes horribly wrong!"},{"name":"ALPA","text":"According to J'olhmyn, my cooking “looks like it's been scraped off a tavern floor,” whatever that's supposed to mean..."},{"name":"JOLHMYN","text":"(Alpa's really been getting into the role of captain lately. Don't tell her I said this, but I'm quite impressed!)"},{"name":"GALES","text":"It's been a while since I had the opportunity to demonstrate my culinary prowess. I'm rather looking forward to it!"},{"name":"ALPA","text":"They accepted our invitations?"},{"name":"ALPA","text":"Did you hear that? It sounds like there's a commotion outssside the gate. I'd better deal with this before the meal."},{"name":"JOLHMYN","text":"Just between you and me, Alpa's really come into her own since that incident with the Qalyana. Why don't you go and see for yourself?"},{"name":"JOLHMYN","text":"Sometimes it's nice to just forget about our duties and wash down a hearty meal with a bottle or three of arak. It sounds like we've got work to do first, though!"},{"name":"ALPA","text":"What happened?"},{"name":"TRAVELLER03041","text":"I was passin' through the woods when some sort of monster grabbed me from the bushes! Damn near pulled my arm off! I didn't stick around to see what it was, I just made a run for it!"},{"name":"ALPA","text":"You're in the care of the Gatekeepers now. Ressst well. We will look into this."},{"name":"ALPA","text":"J'olhmyn, help him to the infirmary and see that his chocobo is looked after."},{"name":"ALPA","text":"There may be others who've been attacked. Send a griffin rider to survey the area!"},{"name":"JOLHMYN","text":"Understood! Come along, sir. The chirurgeons will take care of that arm."},{"name":"ALPA","text":"Normally I'd ask you to assist in culling wild beasts, but we can handle thisss."},{"name":"ALPA","text":"It can't have gone far. Let's move out!"},{"name":"JOLHMYN","text":"That poor bloke and his chocobo should be fine now. There don't seem to have been any other casualties, so let's just wait for Alpa to get back."},{"name":"ALPA","text":"We finally found the culprit. It didn't put up much of a fight."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You've become quite the battlemaid."},{"name":"A2","text":"Not afraid to get your hands dirty, are you?"},{"name":"ALPA","text":"Ha ha, high praise indeed coming from you!"},{"name":"ALPA","text":"I'm only trying to lead by example. I can't delegate everything, you know!"},{"name":"JOLHMYN","text":"In the beginning, I wasn't sure you'd make much of a captain. But much to my surprise, you're not all that terrible!"},{"name":"ALPA","text":"Hmph! A backhanded compliment if ever there was one, but I'll take it."},{"name":"ALPA","text":"Anyway, we have a few things to prepare for the feast. Our guests will be here sssoon."},{"name":"TRAVELLER03041","text":"&lt;pant&gt; My heart's still racing!"},{"name":"JOLHMYN","text":"Not sure what happened, but he looks a bit worse for wear."},{"name":"KARYANASOLDIER","text":"To be in the presence of Captain Alpa and the Warrior of Light is an honor indeed."},{"name":"GALES","text":"It sounds like trouble's brewing again... I'd better carry on with my work and leave this “commotion” to you and Alpa."},{"name":"ALPA","text":"The meal is almossst ready. I hope you're hungry!"},{"name":"ALPA","text":"Although you're not officially members of the Velodyna Gatekeepers, J'olhmyn and I want to show our appreciation for your support."},{"name":"TAHLAMOLKOH","text":"I am very grateful for your kind invitation, though I must admit, I am rather unaccustomed to formal dining."},{"name":"MZHETTIA","text":"Formal? Forget about that! Just eat, drink, and be merry!"},{"name":"GALES","text":"Drink, eh? We have more than enough if you're interested in a little contest."},{"name":"MZHETTIA","text":"Ah... Spirits don't really agree with me..."},{"name":"JOLHMYN","text":"Come on, M'zhet! Show us what the “future nunh of the M tribe” can do!"},{"name":"MZHETTIA","text":"Well, since you put it like that, how can I refuse? Gales─I accept your challenge!"},{"name":"GALES","text":"I have a case of vintage arak from Ala Ghiri to get us started."},{"name":"ALPA","text":"There's ssso much food, we'll need Gales and M'zhet to tear themselves away from their drinking game to help carry it."},{"name":"TAHLAMOLKOH","text":"M'zhet! Are you all right?"},{"name":"JOLHMYN","text":"Evidently not. I think I've lost my appetite."},{"name":"GALES","text":"Don't just stand there! Get a mop!"},{"name":"TAHLAMOLKOH","text":"Ye gods! How did he get it on the ceiling!?"},{"name":"ALPA","text":"It looks like they're a bit preoccupied..."},{"name":"ALPA","text":"Ahem! I'd like to sssay a few words."},{"name":"ALPA","text":"When I was made captain of the Gatekeepers, I had no idea what I was getting myssself into. It wasn't easy at first, but I couldn't be more delighted with how everything has turned out!"},{"name":"ALPA","text":"Of course, we couldn't have done any of this without your sssupport. If you ever need anything at all from the Gatekeepers, consssider it done!"},{"name":"MZHETTIA","text":"The same goes for you! My blade is ever at your service!"},{"name":"GALES","text":"I've turned my life around, and it's all thanks to the Gatekeepers! It would be my pleasure to carry on working here."},{"name":"TAHLAMOLKOH","text":"I have the perfect title for you. How does the “Grand Guardian of Gyr Abania” sound?"},{"name":"MZHETTIA","text":"(That's the worst one yet...)"},{"name":"JOLHMYN","text":"I think I'll stick around as your second-in-command, if you don't mind!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We're all very proud of you, Alpa."},{"name":"A1","text":"You're lucky to have such great friends. Especially me."},{"name":"ALPA","text":"&lt;sniff&gt; Has someone been cutting onions?"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Bloodsworn</span> reputation with the Vira."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon completion of the Vira tribal daily quests."}],"reward":{"gil":1075},"reqs":{"beastrank":7,"jobs":[{"lvl":60,"id":34}],"quests":[68576]},"next":[68697]},"partials":[{"type":"npc","id":"1024771","obj":{"i":1024771,"n":"Alpa","l":2406,"q":6}},{"type":"npc","id":"1024952","obj":{"i":1024952,"n":"Alpa","l":2406,"q":5}},{"type":"npc","id":"1023142","obj":{"i":1023142,"n":"Tahla Molkoh","l":2406,"q":3}},{"type":"npc","id":"1024779","obj":{"i":1024779,"n":"J'olhmyn","l":2406,"q":4}},{"type":"npc","id":"1024937","obj":{"i":1024937,"n":"M'zhet Tia","l":2406,"q":1}},{"type":"npc","id":"1025110","obj":{"i":1025110,"n":"Gales","l":2406,"q":2}},{"type":"npc","id":"1025235","obj":{"i":1025235,"n":"Alpa","l":2406,"q":1}},{"type":"npc","id":"1025236","obj":{"i":1025236,"n":"J'olhmyn","l":2406,"q":1}},{"type":"npc","id":"1025237","obj":{"i":1025237,"n":"Qalyana Sentry","l":2406,"q":1}},{"type":"npc","id":"1025238","obj":{"i":1025238,"n":"Injured Ala Mhigan","l":2406,"q":1}},{"type":"quest","id":"68576","obj":{"i":68576,"n":"Schism between Sisters","g":52,"l":"The Fringes","s":5,"f":1}},{"type":"quest","id":"68697","obj":{"i":68697,"n":"The Ananta Maid's Tail","g":64,"l":"Kugane","s":1}}]}