{"quest":{"name":"Won't Let You Pass","location":"The Fringes","id":68570,"patch":4.2,"sort":13,"icon":112269,"unlocksFunction":1,"eventIcon":71341,"issuer":1024750,"target":1024788,"involved":[1021947,1024747,1024749,1024853],"genre":19,"journal":["Wedge is standing by to see you off.","Wedge informs you that Cid and Alpha have already descended into the Yawn, and encourages you to follow them as soon as you are ready.","You arrive at base camp to find Nero sickly and irritable. Cid duly takes it upon himself to brief you on your third opponent, theorizing that the next battle should be far less complicated than the last. As always, Alpha waits patiently for your signal to proceed.<br><br>※In the event that you leave the Interdimensional Rift, you may re-enter by speaking with the Ironworks hand at the Yawn.","Alpha stands ready to enter the Sigmascape with you. Gather your gear and your courage, and smash through the defenses of the Guardian!<br><br>※Sigmascape V3.0 can be accessed via the Duty Finder.","The Guardian lies defeated. Return to the Interdimensional Rift and speak with Cid.","After complimenting you on your talent for avoiding giant lasers, Cid expresses regret that you could not have encountered the wonders recreated in the Sigmascape under happier circumstances. But as the final battle of this test world looms ever closer, there seems little point in entertaining such thoughts..."],"objectives":["Speak with Nero in the Interdimensional Rift.","Speak with Alpha.","Enter Sigmascape V3.0.","Speak with Cid."],"dialogue":[{"name":"BIGGS","text":"We appreciate you coming up to meet us. After imagining everything that could go wrong in there, it was a relief to find you quietly getting on with the job. We'll have to hurry up and get well!"},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I believe Biggs and Wedge are waiting on you."},{"name":"WEDGE","text":"Alpha and the chief have already gone back in, so don't let us keep you. Our colleague over there should be glad to help you make the descent as soon as you're ready."},{"name":"WEDGE","text":"This dreadful experiment may have a way to go yet, but if you keep taking it one battle at a time, you'll be fighting Omega before you─ I-I mean, it will all be over before you know it!"},{"name":"WEDGE","text":"Say the word to our colleague over there, and he'll help you make the descent into the Yawn."},{"name":"GARLONDGATEKEEPER","text":"Can I lower you into the rift, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>? I may not be much use in battle, but I can at least do you this small service."},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"CID","text":"Thank you for joining me up there, <span class=\"highlight\">Forename</span>. I know it meant a lot to Biggs and Wedge."},{"name":"ALPHA","text":"...Kweh?"},{"name":"NERO","text":"Ah. Back, are you? We should... &lt;gulp&gt; We should return to the task at hand."},{"name":"CID","text":"Everything all right, Nero? You look a bit green around the gills."},{"name":"NERO","text":"The kettle was full of saltwater...<br>Not the best stuff to brew coffee with, it turns out..."},{"name":"CID","text":"Really? Well, it wasn't my doing."},{"name":"NERO","text":"Of course not. That would involve you filling it. &lt;heave&gt; The water came from Alpha...created by one of those cards of his."},{"name":"NERO","text":"It was very thoughtful of him to make the effort...but next time...I'd prefer a beverage that didn't leave me feeling ill..."},{"name":"NERO","text":"...In any case, you can handle support for this third battle on your own. I want to begin preparations for the fourth."},{"name":"CID","text":"...Fair enough."},{"name":"CID","text":"Right, <span class=\"highlight\">Forename</span>─your next foe is known simply as the “Guardian.” Unlike that ordeal with Chadarnook, this battle promises to be relatively straightforward. Courage and steel should be enough to win you the day."},{"name":"CID","text":"The file I found on the Guardian says it was a weapon employed in the defense of an empire's capital city. That should give you some idea of the extent of its capabilities."},{"name":"NERO","text":"Just...leave me be...<br>I'm having enough trouble concentrating as it is..."},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Will you be descending into the Yawn?"},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"ALPHA","text":"Kweh...? Kweh, kweh!"},{"name":"SYSTEM","text":"Alpha seems concerned about Nero, but otherwise eager to proceed. You may enter Sigmascape V3.0 whenever you are ready."},{"name":"ALPHA","text":"Kweh...? Kweh, kweh!"},{"name":"NERO","text":"Done, are you? Then it's almost time..."},{"name":"ALPHA","text":"Kweh..."},{"name":"CID","text":"Congratulations, old friend. Judging by the lack of smoking holes, I'd say you have a natural talent for avoiding laser beams. And this is what passes for a straightforward battle in here..."},{"name":"CID","text":"Phantom trains, possessed pictures, and now this magitek-like machine...<br>Assuming it was real, the realm the Sigmascape is based on must have been highly advanced in both the arcane and the mechanical arts."},{"name":"CID","text":"'Tis truly a pity we cannot identify the test world's origin. Imagine how much we might have learned from such a civilization had we encountered it under different circumstances."},{"name":"CID","text":"But now is not the time for such idle thoughts. The next battle will be the last for this world, and Nero should have a strategy to share with us by now..."}],"reward":{"gil":4142,"xp":0,"instance":30061},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68569]},"next":[68571]},"partials":[{"type":"npc","id":"1024750","obj":{"i":1024750,"n":"Wedge","l":2406,"q":2}},{"type":"npc","id":"1024788","obj":{"i":1024788,"n":"Cid","l":2284,"q":5}},{"type":"npc","id":"1021947","obj":{"i":1021947,"n":"Ironworks Hand","l":2406,"q":11}},{"type":"npc","id":"1024747","obj":{"i":1024747,"n":"Alpha","l":2284,"q":4}},{"type":"npc","id":"1024749","obj":{"i":1024749,"n":"Biggs","l":2406,"q":2}},{"type":"npc","id":"1024853","obj":{"i":1024853,"n":"Nero","l":2284,"q":2}},{"type":"instance","id":"30061","obj":{"i":30061,"n":"Sigmascape V3.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":325}},{"type":"quest","id":"68569","obj":{"i":68569,"n":"An Unfinished Masterpiece","g":19,"l":"The Interdimensional Rift","s":12,"f":1}},{"type":"quest","id":"68571","obj":{"i":68571,"n":"Test World of Ruin","g":19,"l":"The Interdimensional Rift","s":14,"f":1}}]}