{"quest":{"name":"Test World of Ruin","location":"The Interdimensional Rift","id":68571,"patch":4.2,"sort":14,"icon":112271,"unlocksFunction":1,"eventIcon":71341,"issuer":1024853,"target":1023687,"involved":[1021947,1024747,1024784,1024785,1024788],"genre":19,"journal":["Nero seems unusually anxious to move things along.","Together, Nero and Cid present a profile of your final opponent in the Sigmascape─a magic-using jester by the name of “Kefka.” According to their research, the mage is wont to confound his opponents with subtle feints. Accordingly, Nero has adjusted his monitor to give him an unusually clear view of the battle, and will attempt to warn you of impending deceptions. Speak with Alpha to put Nero's strategy to the test.<br><br>※In the event that you leave the Interdimensional Rift, you may re-enter by speaking with the Ironworks hand at the Yawn.","Alpha stands ready to enter the Sigmascape with you. Keep your eyes open and your mind sharp, for it is time to do battle with the illusive Kefka!<br><br>※Sigmascape V4.0 can be accessed via the Duty Finder.","You have defeated Kefka, a victory which should signal the end of your struggles within the Sigmascape. It is time to leave and return to the Fringes.","After descending to congratulate you on your triumph, Omega proceeds to deliver its theory on the secret of your inexplicable combat potential. You are, it contends, subconsciously restricting your own performance save when placed in mortal danger. As such, unlocking your “true” capabilities should logically be a matter of threatening you with death... Before you know what is happening, you find yourself trapped in a prism of energy, with scant moments to live. But just when all seems lost, Midgardsormr uses the last of his strength to assume his original form, and intervenes to rescue you from an untimely end. The Father of Dragons then fades into slumber, satisfied that his guidance is no longer required... You are still reeling from your ordeal when Cid arrives, yelling about Nero. But at the sight of you, he bites his tongue, and bids you make a swift exit to the lip of the Yawn.","You return to the outside world to learn that Nero has been transported to Rhalgr's Reach having collapsed. Make your own way back to the settlement, and call on the waiting Jessie.","As you are speaking with Jessie, a weary Cid approaches bearing the news that Nero will be incapacitated for some time. Even as exhaustion and injury begin to take their toll on your companions, it is plain that Omega's trials will only become more dangerous. You have little choice therefore but to take Cid's exhortations to heart, and temper body and mind to withstand whatever monstrous opponents Omega has in store for you next."],"objectives":["Speak with Alpha.","Enter Sigmascape V4.0.","Speak with the Ironworks hand.","Speak with Jessie in Rhalgr's Reach."],"dialogue":[{"name":"CID","text":"Nero still seems unwell. How much of that coffee did he drink?"},{"name":"ALPHA","text":"Kweh..."},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Will you be descending into the Yawn?"},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"NERO","text":"This is it...<br>The final battle to conquer the...&lt;cough&gt;...Sigmascape."},{"name":"CID","text":"...We've put together a profile of your next opponent."},{"name":"CID","text":"You've encountered some fantastical foes in here, but this time you'll have the novel experience of fighting an actual person. His name is “Kefka”...and he's a jester."},{"name":"CID","text":"According to the data, his preferred mode of fooling didn't just bring the house down, but the whole world."},{"name":"CID","text":"Apparently, he found comedy in the tragedies of others, and condemned countless thousands to death for his own amusement."},{"name":"NERO","text":"Hm hm... That a jester should bring such misery. 'Tis almost amusing."},{"name":"NERO","text":"Nevertheless, we must treat this villain with all seriousness. His rise to godhood and subsequent rule over a shattered world is clearly documented in the records."},{"name":"NERO","text":"Kefka is a formidable mage, and a cunning one besides. Your tactics must account for both his power and his trickery."},{"name":"CID","text":"You've been working on a solution, yes? Will it be enough?"},{"name":"NERO","text":"Will it be enough? Have you ever known me to do anything by halves?"},{"name":"NERO","text":"The jester's face paint is a mask for his intent. If you only watch the surface, you'll be fighting at a disadvantage."},{"name":"NERO","text":"To put it bluntly, Kefka will seek to deceive you. Even as you predict his actions and adjust your position, his true attack will reveal the feint for what it was."},{"name":"NERO","text":"This is where things become interesting...<br>I have tuned this monitor to allow me to observe the Sigmascape with greatly enhanced clarity."},{"name":"NERO","text":"If I observe a discrepancy between Kefka's behavior and the impending attack, I will endeavor to warn you. The timing will be critical, of course."},{"name":"CID","text":"How confident are you of this strategy?"},{"name":"NERO","text":"I predict a fifty percent chance of success! Any delay, however slight, in reacting to his feints will render my warnings all but pointless!"},{"name":"NERO","text":"Isn't it exciting? There is no safe way to practice this, hero─we must test our tactics on the field of battle!"},{"name":"CID","text":"...I'm afraid he's right. I'll lend you all the support I can from this side."},{"name":"CID","text":"Make what preparations you need, and head into the Sigmascape. We can't let this jester have the last laugh!"},{"name":"NERO","text":"“Embrace your destruction... It is the fate of all things.”"},{"name":"NERO","text":"“But people can always rebuild, and new lives will always be born!”"},{"name":"NERO","text":"...A fragmented conversation that accompanied Kefka's data. His was the first line, but there was no mention of who uttered the reply."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You admire this villain."},{"name":"A1","text":"In life, there is always hope."},{"name":"A1","text":"..."},{"name":"NERO","text":"...Perhaps. I admire the idea of upsetting the status quo."},{"name":"NERO","text":"Go on, champion. I tire of waiting for the fun to begin."},{"name":"NERO","text":"...How predictably forthright of you. I'm sure it was a hero much like yourself who gave the original response."},{"name":"NERO","text":"Go on, champion. I tire of waiting for the fun to begin."},{"name":"NERO","text":"...Never mind. Go on, champion. I tire of waiting for the fun to begin."},{"name":"CID","text":"Let's see this through, <span class=\"highlight\">Forename</span>. One battle at a time!"},{"name":"NERO","text":"Are you asking my permission? By all means, let's get things underway."},{"name":"ALPHA","text":"Kweh!<br>Kweh, kweh kweh, kweh!"},{"name":"SYSTEM","text":"Alpha is clearly poised to spring into action. You may enter Sigmascape V4.0 whenever you are ready."},{"name":"ALPHA","text":"Kweh!<br>Kweh, kweh kweh, kweh!"},{"name":"CID","text":"...That's it, isn't it? <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s won!"},{"name":"OMEGA","text":"(-Omega-)&lt;blip&gt; This contest has been decided. Alpha group is victorious."},{"name":"OMEGA","text":"(-Omega-)The Sigmascape test world will now be erased."},{"name":"CID","text":"Come on! We should go and find <span class=\"highlight\">Forename</span>!"},{"name":"CID","text":"Nero!?"},{"name":"CID","text":"Talk to me, man! Are you hurt!?"},{"name":"NERO","text":"You could say that...<br>I had a “visitor” while you were attending your little Ironworks reunion."},{"name":"CID","text":"Omega...<br>Damn it! We should never have left you alone. Not after what happened to Biggs and Wedge."},{"name":"NERO","text":"Hmph... As if I would trail along behind you...like some sniveling lapdog...<br>No, I chose to remain...and behold the results..."},{"name":"NERO","text":"This was <span class=\"emphasis\">my</span> victory! It was <span class=\"emphasis\">my</span> ingenuity that defeated these foes! Even your precious Warrior of Light...&lt;cough&gt;...was just another variable in my grand experiments!"},{"name":"CID","text":"All right, Nero, save your strength. I'll fetch <span class=\"highlight\">Forename</span> and Alpha, and then we can get out of here."},{"name":"NERO","text":"Garlond..."},{"name":"NERO","text":"...The next round is yours."},{"name":"NERO","text":"But you can't keep holding back... It's time to unfetter that brilliant mind of yours. To do what must be done."},{"name":"NERO","text":"And I'm not just talking about what becomes of Omega."},{"name":"NERO","text":"You cannot preach “Freedom through Technology” and keep yourself locked up in chains..."},{"name":"MIDGARDSORMR","text":"Another battle won...<br>Thy might knoweth no bounds, child of man."},{"name":"OMEGA","text":"(-Omega-)&lt;blip&gt; The Sigmascape has been terminated. Congratulations, Alpha group. Congratulations, <span class=\"highlight\">Forename Surname</span>."},{"name":"OMEGA","text":"(-Omega-)Consistent with previous performances, you have once more defeated a foe of vastly superior combat capabilities. I have constructed a theory to explain this phenomenon."},{"name":"OMEGA","text":"(-Omega-)In order to conserve life energy, you subconsciously limit your output during standard activity."},{"name":"OMEGA","text":"(-Omega-)I have taken this factor into account when calculating your potential, but judging by the wild fluctuation in values, is it possible your limits are exceeded by an unpredictably high degree when engaged in battle?"},{"name":"OMEGA","text":"(-Omega-)&lt;bloop&gt; Current data unreliable. Accuracy of further experiments may be compromised. Recalculations necessary."},{"name":"OMEGA","text":"(-Omega-)You will exhibit your full potential, unrestricted by self-imposed limits."},{"name":"OMEGA","text":"(-Omega-)Prediction. Placing subject in mortal peril will facilitate the collection of desired data."},{"name":"OMEGA","text":"(-Omega-)Reveal your power. Let me measure the extent of your existence."},{"name":"OMEGA","text":"(-Omega-)In precisely one hundred and eighty seconds, I will terminate your life. You are to attempt escape with every last reserve of strength you possess."},{"name":"OMEGA","text":"(-Omega-)Alpha. Your participation is unnecessary. Do not interfere."},{"name":"MIDGARDSORMR","text":"...Curious. 'Twould seem the circumstances of thy birth taint not the purity of thy life. The seed which all mortals nurture is found within thee too, Alpha."},{"name":"MIDGARDSORMR","text":"As for thee, Omega...<br>After the passing of eons, is this truly the extent of thine evolution? I have glimpsed the core of thy wretched existence, and judge that my guidance here is no longer needed..."},{"name":"MIDGARDSORMR","text":"Even I cannot fully bend the rules which govern this place. I have reached beyond my strength at the last..."},{"name":"MIDGARDSORMR","text":"But so be it.<br>Such a death becometh thee not!"},{"name":"MIDGARDSORMR","text":"To slumber shall I betake me for a time. The incarnation I leave with thee will be mine in form, but not in spirit."},{"name":"OMEGA","text":"(-Omega-)Midgardsormr...<br>Again, your actions are incomprehensible."},{"name":"MIDGARDSORMR","text":"Heed me, empty vessel. Thine all-too-clumsy effort to draw out that which─by thine own admission─defieth thine understanding is the very height of folly."},{"name":"MIDGARDSORMR","text":"Temper thy desire. Trust to the results of thine experiments. And when thou hast witnessed these mortals in the fullness of their glory, <span class=\"emphasis\">then</span> mayest thou determine if the prize thou seekest is thine for the taking..."},{"name":"OMEGA","text":"(-Omega-)Acknowledged. Attempt to artificially elicit potential has failed. Tend to your injuries, Alpha group, and prepare for the next round of testing."},{"name":"CID","text":"<span class=\"highlight\">Forename</span>! Alpha! I need your help. It's Nero, he's─"},{"name":"CID","text":"...'Twould seem we all have a tale to share. But not here. Come on, we're leaving!"},{"name":"ALPHA","text":"Kweh..."},{"name":"GARLONDGATEKEEPER","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>! The chief has already departed for Rhalgr's Reach. A few of our people were on hand to help him transport Nero."},{"name":"GARLONDGATEKEEPER","text":"Oh, and I was told to tell you that Jessie expects a full report as soon as it's convenient. And by that, she generally means “now.”"},{"name":"GARLONDGATEKEEPER","text":"If you haven't spoken with Jessie yet, it's probably best not to keep her waiting! Not to worry: I'll keep curious travelers from tumbling into the Yawn."},{"name":"ALPHA","text":"Kweh...?"},{"name":"JESSIE","text":"<span class=\"highlight\">Forename</span>! I was told you'd made it out of the hole, but nothing beats seeing you with my own two eyes."},{"name":"JESSIE","text":"In case you're wondering, Nero was taken straight to the infirmary. The chief should be back soon with news if you don't mind waiting..."},{"name":"JESSIE","text":"Chief.<br>...How is he?"},{"name":"CID","text":"Not good. It seems one of Omega's nastier minions paid him a visit in our absence. He's putting on a brave face, but having seen his injuries, I'm surprised he kept going for as long as he did."},{"name":"CID","text":"The chirurgeon's confined him to bed. Even should Omega extend its next “invitation,” Nero won't be coming with us."},{"name":"CID","text":"...Midgardsormr is taking a lengthy nap now, isn't he? And it won't be long before our base camp is lost to the rift again..."},{"name":"JESSIE","text":"When the time comes, I'll join the expedition myself. The challenges will only get harder, and you'll need someone reliable at your back."},{"name":"CID","text":"I appreciate the offer, Jessie. And I may yet take you up on it...when the time comes."},{"name":"CID","text":"But let's not make any decisions just yet. I have a lot of thinking to do─about what's happened, and about what lies ahead."},{"name":"ALPHA","text":"Kweh..."},{"name":"JESSIE","text":"The poor thing. He seems worried..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Thank you for trying to save me!"},{"name":"A2","text":"Don't worry─we'll get Omega in the end."},{"name":"ALPHA","text":"...Kweh!"},{"name":"CID","text":"Well that got a smile out of him. We may not understand what he says, but I think we can understand how he feels."},{"name":"CID","text":"Right! Much as I'd like to stay and chat, we all have work to do. Sooner or later, we're going to have to face Omega itself, and we've all seen what it's capable of."},{"name":"CID","text":"We need to be stronger. We need to be ready when Omega calls on us again. Let's make sure that we are."}],"reward":{"gil":6000,"xp":0,"instance":30062},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68570]},"next":[68690]},"partials":[{"type":"npc","id":"1024853","obj":{"i":1024853,"n":"Nero","l":2284,"q":2}},{"type":"npc","id":"1023687","obj":{"i":1023687,"n":"Jessie","l":2403,"q":5}},{"type":"npc","id":"1021947","obj":{"i":1021947,"n":"Ironworks Hand","l":2406,"q":11}},{"type":"npc","id":"1024747","obj":{"i":1024747,"n":"Alpha","l":2284,"q":4}},{"type":"npc","id":"1024784","obj":{"i":1024784,"n":"Alpha","l":2406,"q":1}},{"type":"npc","id":"1024785","obj":{"i":1024785,"n":"Alpha","l":2403,"q":1}},{"type":"npc","id":"1024788","obj":{"i":1024788,"n":"Cid","l":2284,"q":5}},{"type":"instance","id":"30062","obj":{"i":30062,"n":"Sigmascape V4.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":325}},{"type":"quest","id":"68570","obj":{"i":68570,"n":"Won't Let You Pass","g":19,"l":"The Fringes","s":13,"f":1}},{"type":"quest","id":"68690","obj":{"i":68690,"n":"In the Beginning, There Was Chaos","g":19,"l":"Rhalgr's Reach","s":20,"f":1}}]}