{"quest":{"name":"A Bit of Home Cooking","location":"The Fringes","id":68584,"patch":4.2,"sort":12,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"involved":[1025058],"genre":53,"journal":["Eshana is cooking something up for the Gatekeepers.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Obtain Virdjala mushrooms from Virdjala.","Deliver the Virdjala mushrooms to Anuraga.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"Time away from home is beginning to take its toll on the Gatekeepers. While there is no true remedy for homesssickness, Alpa thought home-cooked meals might lift their ssspirits."},{"name":"ESHANA","text":"Our stores of food proved sufficient for the striders among us, but we lack the mushrooms needed to cook my sssisters a traditional dish. I dare not call the Gatekeepers from their posts, lest we spoil the sssurprise."},{"name":"ESHANA","text":"Might I prevail upon you to collect three from the fallen trees in Virdjala? Deliver them to Anuraga and she will handle the rest."},{"name":"ANURAGA","text":"Oh, how I long for a home-cooked meal. Would that we had a few mushrooms..."},{"name":"ANURAGA","text":"That ssscent... Eshana sent you, didn't she? Well, let's have them."},{"name":"ANURAGA","text":"These will do nicely. Thank you. This variety of mushroom is quite rare, but where they grow they do so in abundance. Their rich aroma will have my sssisters salivating in no time."},{"name":"ANURAGA","text":"Though considering how little time we have to eat, they would ssslaver at the sight of any food. Still, I thank you for these mushrooms, as I'm sure my sisters will as well. Tell Eshana preparations should not take long."},{"name":"ESHANA","text":"Welcome back, <span class=\"highlight\">Forename</span>. Were you able to find any mushrooms?"},{"name":"ESHANA","text":"Well done. No meal for my sssisters would be complete without them. You have my humblest thanks."},{"name":"ESHANA","text":"A taste of home will serve well to not only reinvigorate the Gatekeepers, but also to remind them of what it is they labor to protect."},{"name":"ANURAGA","text":"These mushrooms will make for a sssplendid meal. Tell Eshana the food will soon be ready."}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"npc","id":"1025058","obj":{"i":1025058,"n":"Anuraga","l":2406,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}