{"quest":{"name":"Snack between Meals","location":"The Fringes","id":68585,"patch":4.2,"sort":13,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana has a taste for something special.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Survey the designated location and slay the gallivanting gazelles for their meat.","Deliver the gazelle meat to Eshana."],"dialogue":[{"name":"ESHANA","text":"Ah, what fortuitous timing. We have need of a hunter with your ssskills to replenish our food stores."},{"name":"ESHANA","text":"They are in no danger of being depleted, mind you, but our reserves of gazelle meat are rather low for my tassstes."},{"name":"ESHANA","text":"They are often found in Virdjala. Here, I shall mark the location on your map. If you can procure meat from even two gazelles, you would be doing the Gatekeepers a great ssservice."},{"name":"ESHANA","text":"Did you have any luck in finding them?"},{"name":"ESHANA","text":"Excellent. For me and my sssisters, this meat is essential in maintaining the lussstrous sheen of our skin. A pity most striders consider it too tough or ssstringy."},{"name":"ESHANA","text":"That is why we do not count them among our provisions, which must be shared not only with the Gatekeepers, but the Resissstance as well. We hunt as time permitsss, but they are not easy prey."},{"name":"ESHANA","text":"Should we be hard-presssed in maintaining our ssstores of meat, I pray you will lend us your aid again."}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}