{"quest":{"name":"Out for Delivery","location":"The Fringes","id":68583,"patch":4.2,"sort":11,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"involved":[1025052,1025053,1025054],"genre":53,"journal":["A delayed shipment to Castellum Velodyna has Eshana in a panic.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Rescue the cowering carrier.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"<span class=\"highlight\">Forename</span>! We recently received word of a carrier bessset by beasts near East End."},{"name":"ESHANA","text":"If they are in our employ, the sssituation is all the more dire. They would not be soldiers, but villagers hired from a nearby sssettlement."},{"name":"ESHANA","text":"Please, you must go and help them before it is too late."},{"name":"CARRIER03046","text":"The Gatekeepers sent you? Oh, thank the heavens. You can be sure they'll hear of what you've done here."},{"name":"CARRIER03046","text":"I thought the roads safe, what with the imperials gone and all. Seems I've gravely underestimated the dangers still lurking about here in the wild. Well, I won't make that mistake on my next delivery."},{"name":"CARRIER03046","text":"I knew the job wasn't without risk so long as the imperials are about. Guess I was so caught up worrying about them I'd forgotten there's more than soldiers to be wary of. Well, I won't make that mistake on my next delivery."},{"name":"CARRIERB03046","text":"Thank you <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, thank you!<br>...The Gatekeepers sent you? I'll have to thank them too when I return to the castellum."},{"name":"CARRIERB03046","text":"With the imperials gone I had hoped to do my part in rebuilding, but so far I've proven little more than a nuisance to those who need me most. I promise to be more careful in the future."},{"name":"CARRIERB03046","text":"I had hoped to someday help combat the imperials...yet here I am unable to contend with a simple delivery. I promise to be more careful in the future."},{"name":"CARRIERC03046","text":"What the...? The Gatekeepers sent you? Oh, what a relief. I'll have to thank them when I return to the castellum."},{"name":"CARRIERC03046","text":"The beasts of this place have grown bold with the imperials gone. I'll need to be more cautious if I'm to deliver more supplies."},{"name":"CARRIERC03046","text":"&lt;sigh&gt; I thought the imperials were all I had to be mindful of. If I'm to deliver more supplies, I'll need to be more careful."},{"name":"ESHANA","text":"Ah, you are returned. And no worssse for wear. The carrier returned not long ago, sssinging praises of your heroism."},{"name":"ESHANA","text":"The restoration of Ala Mhigo demands more of my sssisters leave by the day, and those who would ssserve in their stead are quite ssscarce. Needless to say, the people of the Fringes have grown to be an indispensable asset."},{"name":"ESHANA","text":"War with the Garleans demands more of my sssisters leave by the day, and those who would ssserve in their stead are quite ssscarce. Needless to say, the people of the Fringes have grown to be an indispensable asset."},{"name":"ESHANA","text":"There is much to be done if we are to ensure their sssafe passage through East End. I trussst we can count on your assistance should they again find themselves in trouble."}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"npc","id":"1025052","obj":{"i":1025052,"n":"Cowering Carrier","l":2406,"q":1}},{"type":"npc","id":"1025053","obj":{"i":1025053,"n":"Cowering Carrier","l":2406,"q":1}},{"type":"npc","id":"1025054","obj":{"i":1025054,"n":"Cowering Carrier","l":2406,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}