{"quest":{"name":"Deep-rooted Problems","location":"The Fringes","id":68581,"patch":4.2,"sort":9,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana seeks an adventurer with a green thumb.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Use the preservative tonic on the contaminated roots of the Percipient One.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"In an effort to improve relationsss with Gridania, Captain Alpa has proposed a joint initiative to revitalize the Percipient One and cleanse the sssurrounding land."},{"name":"ESHANA","text":"The Gridanians have offered to provide elixirs that will purify the sssoil, and we, for our part, have prepared a tonic to guard the rootsss from rot and decay."},{"name":"ESHANA","text":"Pray take these two vials of tonic to the Percipient One and pour them onto its rootsss."},{"name":"ESHANA","text":"You are returned. The deed is done, then?"},{"name":"ESHANA","text":"Excellent. It has been many moons since we have had need of sssuch a potion. Its preservative properties allow plants to thrive in even the harshessst of conditions."},{"name":"ESHANA","text":"Never did I imagine it would serve to nurture the Percipient One. To return to its former glory will take time, as well as additional treatments of our tonic."},{"name":"ESHANA","text":"I trussst we can count on your aid when we have need of it again."}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}