{"quest":{"name":"A Signal for the Senses","location":"The Fringes","id":68586,"patch":4.2,"sort":14,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana has a task for a helpful adventurer.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Throw the acrid-smelling powder on signal fires.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"Are you feeling helpful, <span class=\"highlight\">Forename</span>? The hour has come to call in the patrols, but I cannot leave my ssstation."},{"name":"ESHANA","text":"I would be grateful if you could head out and throw thisss powder onto our sssignal fires─the sssmoke will let our ssscouts know that fresh patrols are on the way to relieve them."},{"name":"ESHANA","text":"Here. I'll mark the places on your map where the fires are to be found. A trifling tasssk, I know, but I appreciate your aid nonetheless."},{"name":"SYSTEM","text":"You hear the voice of an alerted scout from the direction of the Velodyna River."},{"name":"ANANTASOLDIERA03050","text":"(-Distant Scout-)Ah, finally! I've been aching for a nice cup of tea and <span class=\"alternative-container\"><span class=\"alternative\">a comfortable ssspot to sssit</span><span class=\"alternative\">a ssspot in the shade</span></span>."},{"name":"ANANTASOLDIERA03050","text":"(-Distant Scout-)I hope the next ssscout has more luck tracking that big antlion than I did..."},{"name":"ANANTASOLDIERB03050","text":"(-Nearby Scout-)Already? My report will be a dull one, but I sssuppose those are the mossst welcome."},{"name":"ANANTASOLDIERB03050","text":"(-Nearby Scout-)Time to head back. I needed to sharpen my blade again in any case."},{"name":"SYSTEM","text":"You hear the beating wings of a griffin approaching from the direction of Virdjala..."},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"You hear the steady clomp of booted feet approaching from the direction of Virdjala..."},{"name":"RESISTANCESOLDIERC03050","text":"&lt;cough&gt; Oof, that stuff doesn't half make your eyes water. Thanks for the signal!"},{"name":"ESHANA","text":"Thank you. Our patrols range far and wide out here on the border, and lines of communication can be difficult to maintain."},{"name":"ESHANA","text":"Griffins fly ssswiftly, of courssse, but a sssignal fire does the job even fassster. Even if the sssmoke does reek like a pile of marid...ahem, well it cannot be helped."},{"name":"ESHANA","text":"If you don't mind ssstretching your legs, I could probably use your help the next time we call in the ssscouts."}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}