{"quest":{"name":"Let There Be Lard","location":"The Fringes","id":68599,"patch":4.2,"sort":27,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["The night is dark and full of terrors, and Eshana wants for light.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Use gazelle meat to lure out fattened sarcosuchus at the Velodyna River and slay them for their lard.","Deliver the sarcosuchus lard to Eshana."],"dialogue":[{"name":"ESHANA","text":"You are the light that guidesss us, comrade. As such, I would have you prepare the lampsss we use for night patrol.<br>...Was that funny? I tried to jessst as you striders do."},{"name":"ESHANA","text":"But jests aside, I need you to hunt sarcosuchus and harvessst their lard. Two pails' worth should sssuffice."},{"name":"ESHANA","text":"Here, take these cuts of gazelle meat and lay them along the Velodyna River. The sssmell should lure out the greediest, fattest creatures."},{"name":"ESHANA","text":"Ah, our guiding light returnsss. Tell me, were you able to obtain the sarcosuchus lard?"},{"name":"ESHANA","text":"Excellent. With this much lard, we shall have sssufficient light for a good many patrolsss. The refined oil burns long and ssstrong, and we Ananta have used it for our torches and bonfires since ancient timesss."},{"name":"ESHANA","text":"And that is not all of its applicationsss. The refining process leaves behind a by-product that makes a nourishing sssalve. There is no better cure for dry skin and scales."},{"name":"ESHANA","text":"So you sssee, not only are you the light that guidesss; you are also the sssalve that beautifiesss.<br>...How was that? Are my jests improving?"}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}