{"quest":{"name":"Funnel and Games","location":"The Fringes","id":68590,"patch":4.2,"sort":18,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana needs you to be both bait and trap.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Lure out and slay funnel antlions at Pike Falls.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"Antlions are fearful creatures. Jussst when you think the way is clear, sssuddenly the ground eruptsss beneath you and you're caught in the grip of crushing mandibles."},{"name":"ESHANA","text":"Sssuch has been the fate of far too many travelers bound for the castellum, sssoldiers and merchantsss both. The captain has given us orders to ssslay these vilekin ambushers on sssight, but that is part of the problem: we never sssee them unless they wish to be ssseen."},{"name":"ESHANA","text":"There are other antlions out there, but a few in particular have become ssskilled at preying upon our travel routesss. These are the ones I wish you to kill."},{"name":"ESHANA","text":"Go to Pike Falls and wander alone amongssst the rocksss. You need make no ssspecial effort to find your targets...they will find you."},{"name":"ESHANA","text":"The antlions lie dead, I trussst?"},{"name":"ESHANA","text":"Thank you, <span class=\"highlight\">Forename</span>. Those ambushers were essspecially cunning, and knew not to reveal themssselves to our hunting parties."},{"name":"ESHANA","text":"As I sssuspected, however, they underessstimated the might of a sssingle adventurer. It may take ssseveral more forays, but eventually they will come to fear this prey which bites back!"}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}