{"quest":{"name":"Up Sheet Creek","location":"The Fringes","id":68598,"patch":4.2,"sort":26,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana is struggling with stubborn stains.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Wash the bedsheet at Mirage Creek.","Wash the bedsheet again.","Wash the bedsheet yet again.","Deliver the clean bedsheet to Eshana."],"dialogue":[{"name":"ESHANA","text":"Sssimple though our lodgings may be, running it has been anything but. Laundry, in particular, has been the bane of my existence."},{"name":"ESHANA","text":"This filthy bedsheet, for inssstance. Just looking at it makes me want to collapssse into a weeping heap. Might I prevail upon you to wash it in my stead?"},{"name":"ESHANA","text":"For the location, I would recommend Mirage Creek. The waters there are gentle and prissstine. Once the sheet is clean, bring it back and I shall sssee to the drying."},{"name":"SYSTEM","text":"With the selfsame strength that has felled many a god, you succeed in washing away the worst of the filth. However, the bedsheet is far from what could be considered clean."},{"name":"SYSTEM","text":"You dutifully resume working on the bedsheet, wringing and scrubbing with white-knuckled tenacity until it regains a semblance of its original color. However, some stains remain in evidence."},{"name":"SYSTEM","text":"Through sheer perseverance, you succeed in purging the sheet of all dirt and grime. It looks like it could have just come off the loom."},{"name":"SYSTEM","text":"Through sheer perseverance, you succeed in purging the sheet of all dirt and grime. However, the punishment has caused the cloth to warp..."},{"name":"SYSTEM","text":"Through sheer perseverance, you succeed in purging the sheet of all dirt and grime. However, the punishment has caused the cloth to shrink..."},{"name":"ESHANA","text":"I pray the sheet did not trouble you overmuch. Thank you, <span class=\"highlight\">Forename</span>─I shall take it off your handsss now."},{"name":"ESHANA","text":"...My, this is amazing! However did you manage to make it so clean? Lessst you wonder, the cloth is of my own weaving. To see it thus ressstored gives me great joy."},{"name":"ESHANA","text":"Filthy as it had become, full ready was I to give up on it. But thanksss to you and your unwavering determination, it may serve me for years to come...or until it becomes filthy again."}],"reward":{"gil":680,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}