{"quest":{"name":"Hearts of Precious Stone","location":"The Fringes","id":68596,"patch":4.2,"sort":24,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"involved":[1025092],"genre":53,"journal":["The nearby Resistance camp has need of help, and Eshana has a mind to send you.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the Resistance captain east of Virdjala.","Use the Resistance cannon to destroy dharas.","Report to the Resistance captain.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"<span class=\"highlight\">Forename</span>, a requessst for help has come from the Resistance camp to the east. They ssseek to cull unruly dharas."},{"name":"ESHANA","text":"These creatures feed on rock; if left unchecked, they are liable to cause avalanches, thus endangering travelers."},{"name":"ESHANA","text":"Pray make hassste to the camp and report to the Resistance captain. He will furnish you with further inssstructions."},{"name":"LEADER03060","text":"Ah, you must be the adventurer they sent! You have our thanks."},{"name":"LEADER03060","text":"As you will have heard, we seek to put down some uncommonly aggressive dharas. And to ensure that they stay down, we will strike their cores with cannon fire."},{"name":"LEADER03060","text":"At the junction to the north, we've laid a hunk of precious ore which attracts dharas. The creatures will single-mindedly march towards it, thus exposing their vulnerable cores to the cannon we've positioned at the perch nearby."},{"name":"LEADER03060","text":"Your task is to use the cannon to destroy the dharas before they can reach the ore. Go now, and good luck!"},{"name":"SYSTEM","text":"Use the cannon to destroy the three dharas. You may move the camera as well as zoom in and out. Target the core and fire with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"SYSTEM","text":"Do not let the dharas reach the ore, or the mission will end in failure."},{"name":"LEADER03060","text":"The cannon is positioned at the perch just north of here. Hurry there and use it to destroy the dharas before they can reach the ore!"},{"name":"LEADER03060","text":"You did it! The dharas have all crumbled into the rock whence they came!"},{"name":"LEADER03060","text":"Our friends of the border guard hold you in high esteem, and small wonder. Thank you, adventurer, and please pass my regards to Eshana."},{"name":"ESHANA","text":"So the dharas are no more? Excellent work, <span class=\"highlight\">Forename</span>. You have done all of us a great ssservice."},{"name":"ESHANA","text":"That Resistance camp keeps watch over the route to the Peaks. Though our companies be different, we do not hesitate to cooperate with one another for the common good."},{"name":"LEADER03060","text":"My thanks again for your help with the dharas. Please pass my regards to Eshana."}],"reward":{"gil":680,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"npc","id":"1025092","obj":{"i":1025092,"n":"Resistance Captain","l":2406,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}