{"quest":{"name":"Keeping an Eye off Things","location":"The Fringes","id":68592,"patch":4.2,"sort":20,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana needs you to deal with a monster at the Pall of Clarity.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Use the blood red eye drops on the formidable foper, then slay it.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"<span class=\"highlight\">Forename</span>, there is a foper of extraordinary sssize lurking near the Pall of Clarity."},{"name":"ESHANA","text":"That bridge is used to transssport goods from the western bank of the Velodyna River to Rhalgr's Reach, and we can't have sssome monssstrous fiend claiming the area as itsss territory. Pray head over there and <span class=\"emphasis\">persssuade</span> it to leave."},{"name":"ESHANA","text":"Ordinary fopers are nasssty enough, ssso I've procured an alchemical concoction you can fling in that overgrown thing's eye. That should weaken the creature consssiderably, and give you an easier time of it."},{"name":"ESHANA","text":"Did the foper give you any trouble?"},{"name":"ESHANA","text":"My thanksss. That is one less threat we need worry about. There would be little chance of essscape if the monssster attacked anyone crossing that narrow bridge."},{"name":"ESHANA","text":"Hmmm. I know not if these creatures cherish the view from up there, but no matter how many times we drive them away, sssooner or later we always find another in the exact same place..."}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}