{"quest":{"name":"Ants in the Pants","location":"The Fringes","id":68597,"patch":4.2,"sort":25,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"involved":[1024777],"genre":53,"journal":["Eshana needs help with a vermin outbreak.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Dakshina.","Use the marid's Trample ability on Velodyna ants in Virdjala.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"Now that you have grown accussstomed to riding marids, there is a task I would asssk of you."},{"name":"ESHANA","text":"We have been sssuffering an outbreak of ants. They are drawn to kitchen ssscraps from the lodgings, and are causing our patrons no end of grief, getting into their unmentionables among other unpleasant places."},{"name":"ESHANA","text":"If we are to have any ressspite from these pests, we must ssstrike them at their nest. I would have you do the honors upon one of our trusssty marids."},{"name":"ESHANA","text":"If we are to have any ressspite from these pests, we must ssstrike them at their nest. I would have you do the honors again upon one of our trusssty marids."},{"name":"ESHANA","text":"Speak with Dakshina, our maridkeep, and she will furnish you with further inssstructions."},{"name":"DAKSHINA","text":"I have been expecting you, ant-ssslayer. Your task is sssimple: hop on a marid, ride it over to Virdjala, and have it trample ants. We have placed bait there to lure them out."},{"name":"DAKSHINA","text":"Once you have finished the task, feel free to disssmount your marid. It will make its own way back here."},{"name":"DAKSHINA","text":"Want to get back on the marid, do you? Very well."},{"name":"ESHANA","text":"I could feel the marid's mighty ssstomping all the way here. That should keep us free of antsss for a time."},{"name":"ESHANA","text":"I could feel the marid's mighty ssstomping all the way here. That should keep us free of antsss for a time."},{"name":"ESHANA","text":"Ours is a harsh land with little to sssustain life, and the creatures only do what they must to sssurvive. That being said, we cannot well allow them to overrun the area."},{"name":"ESHANA","text":"The people's sssafety is our priority, and today you have done your part to ensure it. Pleassse accept this as token of our appreciation."},{"name":"DAKSHINA","text":"Judging by the sssticky mess on the marid's feet, I sssee you have dealt with the antsss. Go on and report back to Eshana."}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"npc","id":"1024777","obj":{"i":1024777,"n":"Dakshina","l":2406,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}