{"quest":{"name":"The Very Hungry Marid","location":"The Fringes","id":68594,"patch":4.2,"sort":22,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"involved":[1025072],"genre":53,"journal":["Eshana would have you tend to a marid.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Obtain animal fodder at Castellum Velodyna.","Feed the fodder to the ancient marid.","Obtain animal fodder at Castellum Velodyna.","Feed the fodder to the ancient marid.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"If you have a moment, we have a marid that wantsss for attention. An old creature that's extremely wary of people."},{"name":"ESHANA","text":"It refuses to warm to us, missstrusting any food we bring it, which often leaves it hungry and irritable. However, the captain believes that it will open up to a good-hearted sssoul such as you."},{"name":"ESHANA","text":"At the chocobo stables, you will find pilesss of fodder. Pray take some to the marid eassst of the bridge, where it tends to keep its own company. My thanks in advance."},{"name":"SYSTEM","text":"The old marid regards you with wary eyes. You should return with its fodder."},{"name":"SYSTEM","text":"The old marid regards you with wary eyes even as it sniffs at you curiously."},{"name":"SYSTEM","text":"The old marid devours the fodder in moments and begins sniffing about for more. Perhaps another delivery is in order."},{"name":"SYSTEM","text":"The old marid sniffs about for more fodder. Perhaps another delivery is in order."},{"name":"SYSTEM","text":"The old marid sniffs at you expectantly."},{"name":"SYSTEM","text":"The old marid works through the fodder with relative restraint before settling down, looking content. As best you can judge, it has had its fill."},{"name":"SYSTEM","text":"The marid appears to have had its fill. Time to report back to Eshana."},{"name":"ESHANA","text":"Ssso, how fared you? Did the old marid eat any fodder?"},{"name":"ESHANA","text":"...Well, a second helping! It appears the captain's instinctsss were true. Now we know to whom we might turn for future feedings."},{"name":"ESHANA","text":"As you will have noticed, it is quite old and frail. Yet its sense of sssmell remains remarkably keen, sssecond to none even amongst its kind."},{"name":"ESHANA","text":"Recognizing this, the captain had it brought here. With its nose for suspicious sssubstances, it has been an absssolute boon to our efforts."}],"reward":{"gil":745,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"npc","id":"1025072","obj":{"i":1025072,"n":"Ancient Marid","l":2406,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}