{"quest":{"name":"The Antlion's Share","location":"The Fringes","id":68595,"patch":4.2,"sort":23,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana would have you see to an antlion problem.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Detonate thunderous explosives at the designated location in Virdjala.","Wait for the hunter antlion to appear and slay it.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"We have an antlion problem, <span class=\"highlight\">Forename</span>. A particularly vicious ssspecimen has been terrorizing the Peaks-bound route, and I ask that you put it down."},{"name":"ESHANA","text":"The creature burrowsss deep beneath the ground and lies in wait for prey. Not any prey, mind you, but the larger sssort─chocobo carriagesss and the like."},{"name":"ESHANA","text":"Your footfalls will not sssufice to draw out the greedy fiend...but these explosivesss should do the trick. They come from our friends at Rhalgr's Reach, and are as noisy as they are powerful."},{"name":"ESHANA","text":"When you detonate them, take care you are not caught in blassst. I would be upssset to lose a helpful adventurer sssuch as you."},{"name":"SYSTEM","text":"The ground explodes in a shower of sand!"},{"name":"ESHANA","text":"You look as though you have been rolling in sssand. I take it you have encountered─and dissspatched─the antlion. Excellent, excellent."},{"name":"ESHANA","text":"Though the region sees yet few visitorsss, in time that will change. Trade will grow, bringing with it increased traffic."},{"name":"ESHANA","text":"The route to the Peaks, in particular, is vital to our prosssperity, and we must ensure that all may pass safely. Keeping vilekin such as antlionsss in check will be a regular task, and I pray that we can turn to you again."}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}