{"quest":{"name":"Gosetsu and Tsuyu","location":"Ruby Bazaar Offices","id":68606,"patch":4.3,"sort":20,"icon":100779,"eventIcon":71201,"issuer":1025023,"target":1025555,"genre":7,"journal":["Alphinaud has important news to share.","Alphinaud informs you that a letter has arrived from Lord Hien, and after he helpfully summarizes its contents, you glean that your presence is required at the Doman Enclave. Tataru duly promises to mind the fort while you are away, and as you prepare to leave with Alphinaud and Alisaie, you pause to wonder what will unfold across the Ruby Sea: a declaration of peace between Doma and the Empire...or an all-too-predictable return to hostilities.","You meet Lord Hien at the enclave as planned, only to learn that his letter had omitted mention of a worrying incident involving an ailing Gosetsu. Upon visiting the bedridden samurai, however, you are relieved to find him well on the path to recovery. Yotsuyu, meanwhile, seems much the same as when you last saw her─a child in a woman's body.<br><br>Some time later, a tale told by Yugiri convinces Lord Hien that Yotsuyu's plight is genuine, and he decides to allow her to live out her days in Doma as “Tsuyu.” The only obstacle remaining is to present proof of her condition to Asahi, and with this in mind, your allies agree to rendezvous at the enclave docks.","After an uneventful wait by the skiff, a breathless Lord Hien rushes into view, and it is plain that something is amiss. It seems that Yotsuyu has left the safety of the Kienkan, and according to the testimony of the skiff captain, she has already crossed the river..."],"objectives":["Speak with Hien at the Kienkan.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"Ah, <span class=\"highlight\">Forename</span>, impeccable timing. We have just received a letter from Lord Hien."},{"name":"ALPHINAUD","text":"He writes that the Domans are coordinating their efforts with the Blue Kojin to maintain a constant watch over the Red."},{"name":"ALPHINAUD","text":"By staying on the lookout for signs of crystal hoarding and the like, they mean to nip any summoning attempts in the bud, thereby satisfying the conditions for peace set down by the ambassador."},{"name":"ALPHINAUD","text":"For the Garleans' part, the Populares have sent word that a vessel bearing Doman conscripts is soon to arrive in Yanxia. 'Twould seem that the prisoner exchange is to proceed as planned."},{"name":"ALPHINAUD","text":"Lord Hien requests your presence, and I share his view that you should be on hand at this critical juncture."},{"name":"ALISAIE","text":"According to the letter, Yotsuyu's memory has yet to return, so it looks like she'll be living out the rest of her days in Doma─assuming the ambassador means to honor the agreement, of course."},{"name":"ALISAIE","text":"Before we get to that, however, I think it would be wise to assess her condition one last time. If the Domans have missed any change in her mental state, however slight, it would be better if Asahi weren't the one to spot it."},{"name":"ALPHINAUD","text":"Agreed. Let us make straightways for the enclave, then. Lord Hien will be waiting."},{"name":"ALPHINAUD","text":"I trust you will cope in our absence, Tataru?"},{"name":"TATARU","text":"Don't worry about me─I'll be fine! Just be sure to come back safely!"},{"name":"TATARU","text":"Alphinaud's been keeping a <span class=\"emphasis\">very</span> careful count of his coins lately. I doubt he'd ask for a sip of water without asking the price first! Hee hee hee!"},{"name":"HANCOCK","text":"I am very much in favor of a peace agreement between Doma and the Empire. Loosen that imperial grip, I say, and let the trade routes breathe freely!"},{"name":"ALPHINAUD","text":"We know the broad strokes from his letter, but I would hear the details of our Doman friends' progress from Lord Hien himself."},{"name":"ALISAIE","text":"Ever since he drained our coffers dry buying that sword, Alphinaud has had his purse strings in a death grip. I can't even buy a cup of tea without him going on about the “dangers of frivolous spending.”"},{"name":"KIENKANGATEKEEPER03028","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"HIEN","text":"Ah, I see my letter reached you across the Ruby Sea! Thank you for coming so swiftly."},{"name":"HIEN","text":"Though I wrote at some length on the subject of the forthcoming exchange, there was one other matter I neglected to mention..."},{"name":"HIEN","text":"It concerns Gosetsu. As you may have observed, he returned from his ordeal rather the worse for wear, and despite his best efforts to conceal his condition─or perhaps because of them─he recently collapsed."},{"name":"ALPHINAUD","text":"Good gods! Is he all right!?"},{"name":"HIEN","text":"Confined to bed and grumbling without cease, but he has shown signs of recovery. He made me promise not to tell you, lest you worry unduly. Which was all very well when you weren't here."},{"name":"HIEN","text":"Now that you <span class=\"emphasis\">are</span>, however, I think it high time he received some visitors. Might you spare him a moment? Yotsuyu has scarce left his side, and I imagine you are curious to see what has become of her as well."},{"name":"ALPHINAUD","text":"We will visit him at once. <span class=\"highlight\">Forename</span>, Alisaie─shall we?"},{"name":"HIEN","text":"They make a convincing pair, do they not? On first acquaintance, I would think him a doting grandsire and her a model grandchild."},{"name":"ALPHINAUD","text":"Indeed. Had someone told me a year ago that I would live to bear witness to such a scene, I would have declared them mad. That aside, I am relieved to see Gosetsu has lost none of his spirit."},{"name":"ALISAIE","text":"But what a turn of events... I mean, for <span class=\"emphasis\">her</span> to suddenly be watching over <span class=\"emphasis\">him</span>. You couldn't make it up. Although I suppose Gosetsu <span class=\"emphasis\">is</span> an old man. With the way he charges through life, it can be easy to forget..."},{"name":"HIEN","text":"Aye, he has resisted decrepitude with the same defiance he showed the enemies of Doma."},{"name":"HIEN","text":"But no matter how adamant his will, no man can carry on forever. He has pushed himself beyond the limits of endurance too many times─even if his health returns, the fact remains: he will never again be the warrior he once was."},{"name":"HIEN","text":"He has given his all for liege and land, and we will ask no more."},{"name":"ALISAIE","text":"And what of his nurse? If Yotsuyu is feigning <span class=\"emphasis\">that</span>─well, she certainly has me fooled."},{"name":"YUGIRI","text":"(-???-)This is no pretense."},{"name":"ALISAIE","text":"Yugiri. Out of all of us, I would think you the hardest to convince. So...what makes you so sure?"},{"name":"YUGIRI","text":"I have been spying on Yotsuyu from the shadows─waiting for the misstep that would betray her charade for what it was."},{"name":"YUGIRI","text":"But her mask has never slipped. Not once. She has remained in character from the first. One evening, I watched her as she sat in her chambers, unguarded and alone..."},{"name":"YUGIRI","text":"She had taken the dishes from the cupboard, and was pretending to prepare dinner right there on the tatami. A child's game."},{"name":"YUGIRI","text":"Even the wariest shinobi would not go to such lengths. I can but conclude that her mind is truly broken."},{"name":"ALISAIE","text":"...Well, that's good enough for me─and everyone else, I would hazard."},{"name":"HIEN","text":"Aye, the matter is settled. Yotsuyu will become “Tsuyu,” and begin a new life here in Doma."},{"name":"HIEN","text":"Before that can happen, however, we will need to present her to the ambassador one last time, to prove that her memory is truly gone."},{"name":"HIEN","text":"But I would not risk parading her in front of our returning conscripts. Her presence at the exchange would only stir up mutinous thoughts."},{"name":"ALISAIE","text":"Understandably. She as good as fastened the chains around their necks."},{"name":"HIEN","text":"Aye─which is why I mean to conclude this business with Tsuyu first, out of the sight of my countrymen. Will you help me?"},{"name":"ALPHINAUD","text":"We are at your service. There is no higher purpose than the pursuit of peace."},{"name":"HIEN","text":"My thanks. The Garleans are on their way, and we must prepare to welcome the ambassador. We will meet you at the docks with Tsuyu."},{"name":"HIEN","text":"The skiff will take us to our meeting with the ambassador. We will join you at the docks once preparations have been made."},{"name":"YUGIRI","text":"Even after weeks of surveillance, it was difficult for me to accept that Yotsuyu's condition was genuine... But not as difficult as accepting Gosetsu's affection for her."},{"name":"ALISAIE","text":"Can you imagine Yotsuyu playing with bowls on the floor? I don't know that we can think of her as the same person anymore..."},{"name":"ALPHINAUD","text":"Shall we wait here, then? Lord Hien should not be long."},{"name":"HIEN","text":"My friends! Have you seen Tsuyu!? She is nowhere to be found!"},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">What</span>? But the Garleans will be landing in a matter of moments!"},{"name":"ALISAIE","text":"If she's fled... Could it mean her memories have returned?"},{"name":"HIEN","text":"I know not. Yugiri is scouring the streets as we speak, but it is possible Tsuyu has left the enclave altogether."},{"name":"HIEN","text":"Captain─a word. Did you perchance carry a fair-skinned woman across the river?"},{"name":"DOMANFERRYMAN","text":"A fair-skinned woman, my lord? I...I do not rightly know... I think─ Y-Yes! Yes, my lord! Now that you mention it, there <span class=\"emphasis\">was</span> a lady among the passengers whom I do not recall having seen before."},{"name":"DOMANFERRYMAN","text":"Her face was hidden by the brim of her hat, but I remember taking her hand to help her onto the boat. White as new-fallen snow, it was... Was she someone important, my lord? Have I done something wrong?"},{"name":"HIEN","text":"Wrong? ...No. No, I was merely hoping to catch our guest before she departed. Be at ease, Captain."},{"name":"HIEN","text":"'Twould seem that Tsuyu has crossed the river.<br>Kami help me... No good can come of this."}],"reward":{"gil":1277,"items":[{"id":26883,"one":1},{"id":26882,"one":1},{"id":26884,"one":1},{"id":26885,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68565]},"next":[68607]},"partials":[{"type":"npc","id":"1025023","obj":{"i":1025023,"n":"Alphinaud","l":2927,"q":2}},{"type":"npc","id":"1025555","obj":{"i":1025555,"n":"Alphinaud","l":2813,"q":1}},{"type":"item","id":"26883","obj":{"i":26883,"n":"Dai-ryumyaku Armor of Scouting Coffer (IL 370)","l":1,"c":26509,"t":61}},{"type":"item","id":"26882","obj":{"i":26882,"n":"Dai-ryumyaku Armor of Aiming Coffer (IL 370)","l":1,"c":26509,"t":61}},{"type":"item","id":"26884","obj":{"i":26884,"n":"Dai-ryumyaku Armor of Healing Coffer (IL 370)","l":1,"c":26509,"t":61}},{"type":"item","id":"26885","obj":{"i":26885,"n":"Dai-ryumyaku Armor of Casting Coffer (IL 370)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68565","obj":{"i":68565,"n":"Rise of a New Sun","g":7,"l":"Kienkan","s":19}},{"type":"quest","id":"68607","obj":{"i":68607,"n":"Gone Like the Morning Dew","g":7,"l":"The Doman Enclave","s":21}}]}