{"quest":{"name":"A Business Proposal","location":"The Fringes","id":68602,"patch":4.2,"sort":31,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"involved":[1025074,1025084],"genre":53,"journal":["Eshana is striking a deal with the M tribe.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the Resistance guard.","Pick up the fragile package.","Carry the fragile package to the Miqo'te merchant at the Peering Stones.","Report to Eshana."],"dialogue":[{"name":"ESHANA","text":"Ah, <span class=\"highlight\">Forename</span>. We're in the midssst of preparing a shipment of goods to the M tribe. Might I trouble you for assistance in their delivery?"},{"name":"ESHANA","text":"Normally we would deliver them by cart, but the contentsss of the containers are quite fragile."},{"name":"ESHANA","text":"We've had no choice but to assemble a band of carriers to sssend them by hand, taking care not to run afoul of the beasts that roam these lands."},{"name":"ESHANA","text":"Speak with the Resistance guard at the eastern end of the bridge. He will tell you what needs to be carried and to where."},{"name":"WATCHER03066","text":"Eshana sent you to help with moving the goods, did she? Well the help's certainly welcome. We've got plenty of packages but too few hands to carry them."},{"name":"WATCHER03066","text":"Think you could handle the satchel there on top of the boxes?"},{"name":"WATCHER03066","text":"You'll be taking it to the Peering Stones. A merchant of the M tribe should be expecting you near the entrance."},{"name":"PEDDLER03066","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Did you happen to come from Castellum Velodyna? I'm expecting a shipment from the Ananta who hold the bridge there, but they've yet to arrive."},{"name":"SYSTEM","text":"Deliver the fragile package to the Miqo'te merchant awaiting you at the specified location at the entrance of the Peering Stones."},{"name":"SYSTEM","text":"You will have two minutes and fifteen seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"WATCHER03066","text":"If you could deliver that satchel there on top of the crates, you'd be helping us more than you know. A merchant from the M tribe will be waiting for you at the entrance to the Peering Stones."},{"name":"PEDDLER03066","text":"A package from the Ananta? Oh, yes, of course! Pray forgive me, I was expecting a soldier from the Resistance."},{"name":"PEDDLER03066","text":"To be honest I'm surprised they have any merchandise to sell. Nearly everything they have is sent to the soldiers fighting on the front line."},{"name":"PEDDLER03066","text":"To be honest I'm surprised they have any merchandise to sell. Nearly everything they have is sent to Ala Mhigo to help with the restoration."},{"name":"PEDDLER03066","text":"Still, their goldwork and textile goods are quite popular. It's surprisingly easy to reap large profits despite the great sums we pay for their wares."},{"name":"PEDDLER03066","text":"But I've kept you long enough. Once everything is accounted for it's off to the markets with me. When you return to the castellum, pray tell Eshana I will visit soon to thank her personally, as well as deliver their share of our earnings. "},{"name":"WATCHER03066","text":"Thanks again for your help, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Now you'll want to take that satchel over to the Peering Stones. A merchant from the M tribe will be waiting for you at the entrance."},{"name":"WATCHER03066","text":"Back, are we? I was afraid this might happen. Well, there's plenty more to carry, so grab another satchel. Do try to be a little more careful with this one, okay?"},{"name":"SYSTEM","text":"Deliver the fragile package to the Miqo'te merchant awaiting you at the specified location at the entrance of the Peering Stones."},{"name":"SYSTEM","text":"You will have two minutes and fifteen seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"PEDDLER03066","text":"A few more boxes and I'll be ready to leave to the markets. When you return to the castellum, pray tell Eshana I will visit soon to thank her personally, as well as deliver their share of the profits."},{"name":"ESHANA","text":"Ah, you are returned. I trust the shipment was sssafely delivered?"},{"name":"ESHANA","text":"Thank goodness. I was concerned they might leave without our wares."},{"name":"ESHANA","text":"Time with the Resissstance has taught us not everything must be done on our own. It can be advantageousss to work with others, all contributing their unique abilities to accomplish a common goal."},{"name":"ESHANA","text":"Through the M tribe we can sell our wares. And through adventurers sssuch as yourself, we can more easily secure our livelihood."},{"name":"ESHANA","text":"Thusss can the Gatekeepers afford to focus their efforts on helping others in need. We all have our part to play if we are to ensure a better tomorrow for Ala Mhigo."}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"npc","id":"1025074","obj":{"i":1025074,"n":"Miqo'te Merchant","l":2406,"q":1}},{"type":"npc","id":"1025084","obj":{"i":1025084,"n":"Resistance Guard","l":2406,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}