{"quest":{"name":"Fruits of Her Labor","location":"Yanxia","id":68608,"patch":4.3,"sort":22,"eventIcon":71201,"issuer":1025095,"target":1024999,"genre":7,"journal":["Hien's face is a picture of relief."],"objectives":["Speak with Hien.","Speak with Hien at the Kienkan.","Speak with Hien."],"dialogue":[{"name":"YUGIRI","text":"All of this over a persimmon...<br>I failed to consider how she might endanger herself. Knowing she has the mind of a child, I should have continued my vigilance─not relaxed it."},{"name":"YOTSUYU","text":"I don't know why everyone is so angry, but I got the fruit Gosetsu wanted. I hope he likes it..."},{"name":"ISSE","text":"I can't forget what that woman did to us, but I won't do anything to upset Azami."},{"name":"AZAMI","text":"I'm not scared of her. Not anymore."},{"name":"HIEN","text":"&lt;sigh&gt; That...would have been better avoided. But at least it did not end in bloodshed. And judging by Tsuyu's reaction, she remains oblivious to the events of her former life. This was no escape attempt."},{"name":"YUGIRI","text":"Nay, it seems it was an offhand request of Gosetsu's which brought her to Namai. She came in search of a <span class=\"emphasis\">persimmon</span>."},{"name":"HIEN","text":"Hah! And they say fruit is good for the health... I do hope Gosetsu finds the taste to his liking."},{"name":"HIEN","text":"Well, we have certainly taken the long way around, but let us continue on to Castrum Fluminis and our meeting with the ambassador. Alphinaud and Alisaie should still be there, conducting their search."},{"name":"YUGIRI","text":"The imperial airship has arrived. Whether our conscripts are aboard remains to be seen..."},{"name":"YOTSUYU","text":"Do we have to stay here long? He'll be waiting for his fruit..."},{"name":"ALPHINAUD","text":"Lord Hien informed us of the uproar at Namai. Thank the Twelve you found Yotsuyu when you did. I dare not think what might have happened had you not."},{"name":"ALISAIE","text":"I was sure Yotsuyu had fled, but it seems her memory hasn't returned after all. How foolish of me not to consider Gosetsu's craving for seasonal fruit..."},{"name":"HIEN","text":"It seems our imperial guests have already arrived. 'Tis time to meet with the ambassador..."},{"name":"HIEN","text":"I knew better than to trust Asahi, but that was a dirty trick."},{"name":"HIEN","text":"Still, unpleasant as it was, we have at least put the matter of Tsuyu's future to rest. I have sent her back to the enclave with Yugiri to give Gosetsu his precious persimmon."},{"name":"HIEN","text":"Come, let us follow them."},{"name":"ALISAIE","text":"You have that look, Alphinaud. What is it?"},{"name":"ALPHINAUD","text":"Oh, nothing of consequence, most like...<br>We can discuss it upon our return."},{"name":"KIENKANGATEKEEPER03028","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"ALPHINAUD","text":"...So, it would seem there will be one less prisoner at the exchange. I only hope Yotsuyu's presence here will not present further problems..."},{"name":"ALISAIE","text":"I suppose “Tsuyu” is to become an official Doman citizen. But what then? Will they keep her hidden here forever? Or might she one day be allowed to walk amongst her countrymen?"},{"name":"HIEN","text":"We should pay a visit to Gosetsu, and reassure him about Tsuyu's fate. He will want to know that the Empire has finally relinquished its claim on her."},{"name":"ALPHINAUD","text":"So Yotsuyu has returned to the bosom of the Empire after all. I cannot say I am surprised. But what I struggle to fathom is Asahi's aim in all of this."},{"name":"ALISAIE","text":"So Asahi got his way in the end, and at an unspeakable price. He really is a vile little worm, isn't he."},{"name":"YUGIRI","text":"Yotsuyu hid her recovery well─I had no inkling that her memory had returned. I keep asking myself when it could have happened. At the meeting with her parents, perhaps? But then why would she─? Nay. There is naught to be gained from such conjecture."},{"name":"HIEN","text":"We have recovered the Naeuris' remains, and will hold the cremation anon. &lt;sigh&gt; Would that they had never again set foot in Doma."},{"name":"HIEN","text":"I broke the news to Gosetsu myself. He was...quiet. I think it best that he be allowed some time alone with his thoughts."}],"reward":{"gil":1262},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68607]},"next":[68609]},"partials":[{"type":"npc","id":"1025095","obj":{"i":1025095,"n":"Hien","l":2410,"q":1}},{"type":"npc","id":"1024999","obj":{"i":1024999,"n":"Hien","l":2847,"q":4}},{"type":"quest","id":"68607","obj":{"i":68607,"n":"Gone Like the Morning Dew","g":7,"l":"The Doman Enclave","s":21}},{"type":"quest","id":"68609","obj":{"i":68609,"n":"Conscripts and Contingencies","g":7,"l":"Kienkan","s":23}}]}