{"quest":{"name":"Gone Like the Morning Dew","location":"The Doman Enclave","id":68607,"patch":4.3,"sort":21,"eventIcon":71201,"issuer":1025557,"genre":7,"journal":["Though his face betrays little sign of panic, Hien is plainly desperate to find Yotsuyu before something terrible happens."],"objectives":["Question residents of Yuzuka Manor.","Search for signs of Yotsuyu.","Inspect the bamboo hat."],"dialogue":[{"name":"ALPHINAUD","text":"Without Tsuyu, I cannot see how the prisoner exchange─or indeed the peace process at large─can proceed. We have to find her, and soon."},{"name":"ALISAIE","text":"Her memory must have returned. Why else would she run?"},{"name":"HIEN","text":"It seems Tsuyu has gone unrecognized thus far, but kami help us if someone catches a clear view of her face. I must find her before that happens."},{"name":"HIEN","text":"The responsibility for her disappearance─for <span class=\"emphasis\">all</span> of this─lies with me. But I would ask for your aid nonetheless."},{"name":"ALPHINAUD","text":"We are at your service, Lord Hien, now as before. Let us make the crossing and begin our search."},{"name":"ALISAIE","text":"You go on ahead. Someone should let Yugiri know what we've learned. I'll join you on the other side."},{"name":"HIEN","text":"We have no way of knowing where Tsuyu is headed, so we had best divide our forces. I will take Kusakari and its surrounds; Alphinaud, if you would take the road to Castrum Fluminis?"},{"name":"HIEN","text":"<span class=\"highlight\">Forename</span>─forgive me, but could I ask you to interrogate the residents of Yuzuka Manor? One of the Namazu may well have seen our quarry."},{"name":"HIEN","text":"If everyone is in agreement, let us board the skiff, and hope the kami smile upon our efforts!"},{"name":"GYOSAN","text":"Welcome to Yuzuka Manor. Yes, yes. If there is anything you care to know, you need only─ Hm? A pale-skinned woman?"},{"name":"GYOSAN","text":"I have seen no such traveler, I am sorry to say. Most sorry. Scaly-skinned Namazu, on the other hand, we have in abundance!"},{"name":"GYOKU","text":"...Unusually pale skin? Yes, yes! I saw this woman on the way back from my fishing trip."},{"name":"GYOKU","text":"She had just crossed the shallows east of here, and was headed in a northeasterly direction...for the most part. Her steps did not seem certain. If you hurry, you might still catch her. "},{"name":"GYOSAN","text":"No, no. Still no pale-skinned females here. Only grey."},{"name":"GYOKU","text":"I thought you would be on your way by now. Did you lose interest in finding your friend?"},{"name":"SYSTEM","text":"You see no sign of Yotsuyu to the north. Perhaps she is somewhere farther off to the northeast..."},{"name":"SYSTEM","text":"Still no sign of Yotsuyu. Perhaps she is yet farther to the northeast..."},{"name":"SYSTEM","text":"Yotsuyu is nowhere to be seen, but lying on the ground a short distance to the north, you spy a familiar-looking wide-brimmed hat..."},{"name":"SYSTEM","text":"A cursory glance is all that is required to confirm your suspicions: it is the same hat Yotsuyu was wearing when you found her in Sakazuki."},{"name":"HIEN","text":"<span class=\"highlight\">Forename</span>! Before you ask, our search of Kusakari and its surroundings has yielded exactly naught─save this chance reunion with you, I suppose."},{"name":"YUGIRI","text":"Mistress Alisaie has gone to assist her brother at the castrum. It was she who informed me of the situation. I joined Lord Hien here shortly thereafter."},{"name":"HIEN","text":"How did you fare at Yuzuka Manor? Any sign of our missing guest?"},{"name":"HIEN","text":"...Towards <span class=\"emphasis\">Namai</span>? By the kami! If the villagers recognize her, it will not end well."},{"name":"HIEN","text":"We must hurry. Yugiri and I will check the paddies; the village square is yours!"}],"reward":{"gil":970,"items":[{"id":22435,"one":1},{"id":23186,"one":1},{"id":23188,"one":1},{"id":22445,"one":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68606]},"next":[68608]},"partials":[{"type":"npc","id":"1025557","obj":{"i":1025557,"n":"Hien","l":2813,"q":1}},{"type":"item","id":"22435","obj":{"i":22435,"n":"Dzo Steak","l":340,"c":24360,"t":46}},{"type":"item","id":"23186","obj":{"i":23186,"n":"Banh Xeo","l":340,"c":24024,"t":46}},{"type":"item","id":"23188","obj":{"i":23188,"n":"Ema Datshi","l":340,"c":24122,"t":46}},{"type":"item","id":"22445","obj":{"i":22445,"n":"Tofu Pancakes","l":340,"c":24072,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"68606","obj":{"i":68606,"n":"Gosetsu and Tsuyu","g":7,"l":"Ruby Bazaar Offices","s":20}},{"type":"quest","id":"68608","obj":{"i":68608,"n":"Fruits of Her Labor","g":7,"l":"Yanxia","s":22}}]}