{"quest":{"name":"A Delicate Operation","location":"The Fringes","id":68601,"patch":4.2,"sort":30,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana is in need of an adventurer in high places.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Use the botanical growth formula to obtain dianthuses.","Deliver the dianthuses to Eshana."],"dialogue":[{"name":"ESHANA","text":"You do not fear heightsss, do you? We have need of one who can scale the rock formations of Virdjala to procure dianthus."},{"name":"ESHANA","text":"Tea made from their petals is incredibly effective at reducing fatigue. Alpa thought to offer it to travelers ssseeking lodgings after a long journey."},{"name":"ESHANA","text":"The problem, however, is the flowers are quite delicate, and should they be bruised, their curative properties are greatly diminished. "},{"name":"ESHANA","text":"Luckily for usss, a traveling alchemist taught us how to create a botanical growth formula. "},{"name":"ESHANA","text":"Sssprinkle this upon the flowers and they will remain unharmed when plucked."},{"name":"SYSTEM","text":"You find the flower Eshana spoke of, and it is in full bloom. At a glance you can tell the petals are dreadfully delicate."},{"name":"SYSTEM","text":"The delicate petals of the flower seem hardened by Eshana's growth formula."},{"name":"ESHANA","text":"Were you able to find the flowers?"},{"name":"ESHANA","text":"It seems the growth formula was more effective than I had hoped. A pity such beauty must be sssacrificed to make our tea."},{"name":"ESHANA","text":"The recipe was taught to us by a merchant of Ul'dah. A peculiar fellow who insssisted on trading for our shedded skin. Rather than barter for gold, we sssettled on information beneficial to our work here."},{"name":"ESHANA","text":"There is much knowledge to be shared with travelers coming and going between Gyr Abania and the Shroud. I pray we can count on your aid to ensure their sssafe passage."}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}