{"quest":{"name":"Catching and Fletching","location":"The Fringes","id":68605,"patch":4.2,"sort":34,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"genre":53,"journal":["Eshana wishes to lay in a surplus of arrows.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Search the designated locations for regal gaganas, and slay them for their feathers.","Deliver bundles of feathers to Eshana."],"dialogue":[{"name":"ESHANA","text":"Greetings, <span class=\"highlight\">Forename</span>. As you know, my sssisters and I often employ the bow as our weapon of choice."},{"name":"ESHANA","text":"Without a sssteady sssupply of arrows, however, the bow becomes little more than a frail ssstaff. If you would do usss the honor, I would asssk that you gather one of the materials used to conssstruct our ammunition."},{"name":"ESHANA","text":"A fine arrow needs a ssstraight shaft, of course, but it is the fletching which guides the missile far and true. We've found the feathers taken from the ssso-called “regal” gagana to bessst keep their shape...when we can get them."},{"name":"ESHANA","text":"This breed of gagana ssstalks the Ssstriped Hills, and are fearsssome birds indeed. Ssslay a pair of them, and pluck from their hides as many undamaged feathers as you can."},{"name":"ESHANA","text":"How fared your hunt?"},{"name":"ESHANA","text":"Yesss, these are perfect! As a huntress, my fingers already ache to loose the arrows made with sssuch feathers."},{"name":"ESHANA","text":"We go through many missiles during our duties on the border, and will always need more materials. I will be sure to call on you again when our ssstock of feathers is running low."}],"reward":{"gil":550,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}