{"quest":{"name":"Conscripts and Contingencies","location":"Kienkan","id":68609,"patch":4.3,"sort":23,"eventIcon":71201,"issuer":1024999,"target":1024999,"genre":7,"journal":["Lord Hien seems keen to take stock of the situation."],"objectives":["Speak with Rasho on Onokoro.","Inspect the hull.","Report to Ihanashi.","Speak with Hien at the Kienkan."],"dialogue":[{"name":"ALPHINAUD","text":"So Yotsuyu has returned to the bosom of the Empire after all. I cannot say I am surprised. But what I struggle to fathom is Asahi's aim in all of this."},{"name":"ALISAIE","text":"So Asahi got his way in the end, and at an unspeakable price. He really is a vile little worm, isn't he."},{"name":"YUGIRI","text":"Yotsuyu hid her recovery well─I had no inkling that her memory had returned. I keep asking myself when it could have happened. At the meeting with her parents, perhaps? But then why would she─? Nay. There is naught to be gained from such conjecture."},{"name":"KIENKANGATEKEEPER","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"HIEN","text":"So, my friends...that which we feared has come to pass. Yotsuyu has regained her memory and returned to the imperial fold."},{"name":"HIEN","text":"It is, by any measure, a cruel twist, not least for Gosetsu...but one which does not invalidate our agreement. According to the terms of the contract, we were bound to surrender Yotsuyu into the Garleans' hands should her condition improve prior to the hour of the exchange. By that reckoning, all is...if not as it should be, then...as it <span class=\"emphasis\">must</span> be. This I can accept."},{"name":"HIEN","text":"But what I <span class=\"emphasis\">cannot</span> accept are the unconscionable lengths to which Asahi went to achieve this outcome."},{"name":"HIEN","text":"Given his recent conduct, and his apparent admiration for Zenos, it is plain he cannot be trusted. And that is to say nothing of the unexplained containers he insists on bringing to our meetings. Whatever the ambassador is planning, I think it unlikely our negotiations will end peacefully."},{"name":"HIEN","text":"In the event of hostilities, the safety of the conscripts must be our first concern. As such, I would have an escape route in place before the meeting begins."},{"name":"ALPHINAUD","text":"A wise precaution. If the main structure of Castrum Fluminis is to be the stage for the exchange, then I believe a thorough inspection is in order..."},{"name":"YUGIRI","text":"The citadel has stood empty ever since the imperial withdrawal─while we took steps to ensure that it could not be defended by an occupying force, it is entirely possible that the ambassador has arranged things there to his advantage. I will slip inside, and make certain we have an unobstructed exit."},{"name":"ALPHINAUD","text":"Pray allow me to join you. I have some experience of imperial facilities. And should matters take a turn for the worse, I would hope to be of at least <span class=\"emphasis\">some</span> use..."},{"name":"HIEN","text":"Very good. That should be enough to guarantee us a way out of the castrum. Beyond that, however... "},{"name":"HIEN","text":"We will need a ship to ferry the conscripts back to the enclave. Even with every skiff we have, it would take several trips to evacuate everyone."},{"name":"HIEN","text":"...A Confederate sekibune, on the other hand, would require only a single run, <span class=\"emphasis\">and</span> leave us far less vulnerable on the water. Assuming, of course, Rasho can be convinced to part with one."},{"name":"ALISAIE","text":"Might I take the lead on this? I've had dealings with Rasho and his pirates before."},{"name":"ALISAIE","text":"And I won't be alone, will I, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can count on me."},{"name":"A1","text":"I suppose not..."},{"name":"ALISAIE","text":"Much appreciated.<br>I quite fancy parleying with pirates again. It's just a shame Lyse won't be there to reprise her role."},{"name":"ALISAIE","text":"Well, that was enthusiastic. Were you hoping to join Yugiri and Alphinaud on their skulking mission, by any chance...?"},{"name":"HIEN","text":"Hm! I am certain you would make a persuasive pair─but I think I will accompany you to these negotiations all the same."},{"name":"YUGIRI","text":"My lord, the ruler of Doma should not be seen consorting with common brigands..."},{"name":"HIEN","text":"Come now, Yugiri─they stood with us against the Empire. If we would ask their aid once more, we must treat with them as equals. My presence shall serve to demonstrate our sincerity."},{"name":"YUGIRI","text":"...Indeed, my lord. Pray forgive my presumption. By your leave, Master Alphinaud and I shall be about our task."},{"name":"HIEN","text":"And we should be on our way to Onokoro. Time is short, and Rasho may take some convincing."},{"name":"RASHO","text":"Now there is a face I did not expect to see. What brings the noble lord of Doma into the company of bilge rats such as we?"},{"name":"TANSUI","text":"If you've come to offer Doman chains in place of Garlean ones, then I'm afraid you've wasted a trip."},{"name":"HIEN","text":"Ahahaha! And what fine subjects you would make! With your fleet at our disposal, our restoration efforts would be hastened tenfold."},{"name":"HIEN","text":"But let us speak seriously. I stand before you not to demand your fealty, but to request your aid once more."},{"name":"RASHO","text":"Mayhap you are confused. Doma's liberation was but a means to an end. We aided you only to save ourselves."},{"name":"RASHO","text":"Now we have no such incentive. We have sworn no oath to you, and will not come running like hounds at their master's whistle."},{"name":"HIEN","text":"And I would not presume to treat you thus. I come to petition your cooperation as an ally of equal standing."},{"name":"TANSUI","text":"Equal standing, you say? Seems a bit lopsided to me. Where's the profit for us in all of this?"},{"name":"ALISAIE","text":"<span class=\"emphasis\">Profit</span>! Must you always think in such shortsighted terms? Have you ever heard of <span class=\"emphasis\">doing the right thing</span>?"},{"name":"TANSUI","text":"Have you ever heard of <span class=\"emphasis\">pirates</span>, little miss? You'll find we're simple souls: you pay our tithe, you sail in peace; deny us our due and we take it by force. We'll pull you out of the water if we see you drowning, but we are not in the business of doing something for nothing."},{"name":"HIEN","text":"Calm yourself, Mistress Alisaie. We did not come here to moralize. We came here to talk. And there is more to be said."},{"name":"HIEN","text":"According to records recovered after the liberation, relatives of your Doman-born brethren were among those conscripted into the imperial army. And as you may be aware, we recently negotiated the return of said conscripts. Many, alas, will arrive to find no families waiting for them, no homes to grant them shelter."},{"name":"HIEN","text":"I would ask that you offer them a place in the Confederacy. You would not be rescuing strangers, but welcoming brothers and sisters into your ranks. And has not the Confederacy been in need of new recruits...?"},{"name":"RASHO","text":"You seem well-informed of our affairs, Lord Hien."},{"name":"TANSUI","text":"The losses we suffered at the Garleans' hands are no secret. But since we drove them out of Doma, the Ruby Sea has come alive with traders and travelers. So many vessels to tax, so few pirates to tax them."},{"name":"TANSUI","text":"We could do with some more hands on deck, and doubly so if they're familiar with the inner workings of the Empire."},{"name":"RASHO","text":"Very well. The Confederacy agrees to your request. You will have your ship."},{"name":"RASHO","text":"...But before that, you must do something for me. The vessel I have in mind was damaged during your battle with the Empire. Though we have mended her, she has yet to be declared seaworthy."},{"name":"RASHO","text":"She is sound enough down below, but when you load her up with conscripts and the waterline rises...those upper planks had best be free of cracks."},{"name":"RASHO","text":"Assuming you want your people to stay dry, you will do me the favor of swimming around the hull to check for weaknesses. That is, if Doman lords are not averse to getting their robes wet?"},{"name":"HIEN","text":"Not this Doman lord! If we each inspect a third of the ship, it shall be done in a trice."},{"name":"RASHO","text":"That is the spirit. The ship is moored at Quickscape Pier. Our apprentice shipwright will be on deck to hear your report. Look for a lad named Ihanashi."},{"name":"ALISAIE","text":"And I thought I had a knack for parleying with pirates... For the record, my previous attempt was an unmitigated success, and <span class=\"emphasis\">yes</span>, I should have quit while I was ahead."},{"name":"TANSUI","text":"Well, well. I'd thought the rumors exaggerated, but the young lord lives up to his reputation..."},{"name":"RASHO","text":"The sekibune is moored at Quickscape Pier. Speak with Ihanashi when you have finished your swim."},{"name":"TANSUI","text":"So Yotsuyu found her way back to the imperials, did she? I did warn you about being merciful..."},{"name":"ALISAIE","text":"For once, I'm actually glad Yugiri isn't here. I doubt she would have taken kindly to a pirate inviting Hien to inspect his hull..."},{"name":"HIEN","text":"The water is so invigorating! I have not swum in the Ruby Sea since─ Ah, but I should be concentrating on the task at hand!"},{"name":"IHANASHI","text":"...Ihanashi? Aye, that's me. The captain said someone would be coming to inspect the hull. You...haven't finished already, have you?"},{"name":"SYSTEM","text":"You see no signs of damage here."},{"name":"SYSTEM","text":"Upon closer inspection, you spot a small crack in one of the planks..."},{"name":"IHANASHI","text":"Aye, I'm the shipwright─er, <span class=\"emphasis\">apprentice</span> shipwright. Did you find anything that might need attention?"},{"name":"ALISAIE","text":"The section I inspected seemed solid enough."},{"name":"IHANASHI","text":"...On the port side, near the bow, you say? All right, I'll have a look and see what I can do."},{"name":"HIEN","text":"My apologies, I seem to have lagged behind. I could float in that gentle sea all day...<br>Otherwise, I am happy to report no visible cracking or holes in my section of the hull."},{"name":"IHANASHI","text":"You─ Y-You─ You're Lord Hien! The captain sent <span class=\"emphasis\">you</span> to inspect the hull!? Kami have mercy... Forgive us this discourtesy, my lord!"},{"name":"HIEN","text":"Hah! 'Tis quite all right. In fact, I rather enjoyed it. I take it you are of Doma?"},{"name":"IHANASHI","text":"Y-Yes, my lord. The imperials took my father away after the uprising, and I had nowhere else to turn. The Confederacy became my family."},{"name":"IHANASHI","text":"But someone told me they're releasing the conscripts now. Maybe my father will be among them. Not that I can go back─there's no leaving once you've joined..."},{"name":"RASHO","text":"(-???-)How fares our lady? Is she seaworthy?"},{"name":"IHANASHI","text":"Captain! W-We've found a small crack in the port side, but I'll have it fixed before you know it!"},{"name":"RASHO","text":"I see you have met the boy. Did he tell you his story? He babbles when he is nervous."},{"name":"RASHO","text":"Should his father be among the conscripts, as he hopes, I mean to give him the choice to leave this life. If he so chooses, I expect you to see they are provided for."},{"name":"HIEN","text":"I have heard that those who join the Confederacy forswear all ties with kin and homeland. Is that oath so easily put aside?"},{"name":"RASHO","text":"If I allow it.<br>...I see in him the lad I was twenty-five years ago. You say the words, you mean them, but the yearning for home still lingers."},{"name":"RASHO","text":"My family is long dead, and I know this life is my lot. But he has scarce dipped his toes with us. If there is a life for him in Doma, he should have the chance to live it."},{"name":"HIEN","text":"Well said. The Empire's conquest has uprooted many and more. Be it in Yanxia or out on the Ruby Sea, we have a duty to ensure that Ihanashi and others like him are free to dwell where they desire."},{"name":"RASHO","text":"Then the matter is settled. I will make preparations to cast off."},{"name":"HIEN","text":"Well, my friends, it seems we have our ship. Let us return to the enclave."},{"name":"RASHO","text":"The sekibune is set to sail. We will be ready when the time comes."},{"name":"ALISAIE","text":"Alphinaud tells me they had little trouble finding a suitable route out of the castrum, but he won't say much more than that. If I didn't know better, I'd think he was hiding something...though I can't imagine what."},{"name":"ALPHINAUD","text":"The castrum was deserted. Quite deserted. 'Twas a simple matter to plot the surest path out. H-Hence our swiftness."},{"name":"YUGIRI","text":"We found the castrum's tower unoccupied, and betraying no signs of recent activity. Only shadows and echoes awaited us there. Alphinaud seemed oddly reluctant to linger, but I saw naught to concern us."},{"name":"IHANASHI","text":"Thank you for being so thorough. My father may soon be boarding this ship, and I wouldn't want the hull to spring a leak..."},{"name":"HIEN","text":"It seems Yugiri and Alphinaud completed their task before us. They have been waiting."},{"name":"YUGIRI","text":"We scouted the structure and determined the swiftest path to safety. In the event of hostilities, we will lead the conscripts outside with all possible haste."},{"name":"HIEN","text":"From there, the Confederacy has pledged a ship to ferry us across the One River. Now we have but to attend the exchange, and pray to the kami these precautions were unnecessary."}],"reward":{"gil":1313,"items":[{"num":2,"id":22447,"one":1},{"num":2,"id":22448,"one":1},{"num":2,"id":22449,"one":1},{"num":2,"id":22450,"one":1},{"num":2,"id":22451,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68608]},"next":[68610]},"partials":[{"type":"npc","id":"1024999","obj":{"i":1024999,"n":"Hien","l":2847,"q":4}},{"type":"item","id":"22447","obj":{"i":22447,"n":"Grade 2 Infusion of Strength","l":320,"c":20701,"t":44}},{"type":"item","id":"22448","obj":{"i":22448,"n":"Grade 2 Infusion of Dexterity","l":320,"c":20702,"t":44}},{"type":"item","id":"22449","obj":{"i":22449,"n":"Grade 2 Infusion of Vitality","l":320,"c":20703,"t":44}},{"type":"item","id":"22450","obj":{"i":22450,"n":"Grade 2 Infusion of Intelligence","l":320,"c":20704,"t":44}},{"type":"item","id":"22451","obj":{"i":22451,"n":"Grade 2 Infusion of Mind","l":320,"c":20705,"t":44}},{"type":"quest","id":"68608","obj":{"i":68608,"n":"Fruits of Her Labor","g":7,"l":"Yanxia","s":22}},{"type":"quest","id":"68610","obj":{"i":68610,"n":"The Primary Agreement","g":7,"l":"Kienkan","s":24}}]}