{"quest":{"name":"Thin-skinned","location":"The Fringes","id":68600,"patch":4.2,"sort":29,"interval":"daily","repeatable":1,"beast":10,"eventIcon":71222,"issuer":1024773,"target":1024773,"involved":[1025073],"genre":53,"journal":["A problem weighs heavy on Eshana's mind.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Obtain fish mint at East End.","Deliver the fish mint to Jagranti.","Deliver the jar of fish mint salve to Eshana."],"dialogue":[{"name":"ESHANA","text":"<span class=\"highlight\">Forename</span>. I have need of your assistance in preparing supplies quite vital to me and my sssisters."},{"name":"ESHANA","text":"As you know, we Ananta take great pride in the appearance of our skin, and the lussstrous sheen of our scales. We require a special salve for our tails, which are prone to scarring from our ceaselesss patrols of the area."},{"name":"ESHANA","text":"Before I can distribute any to my sssisters, however, we must ready ingredients to make more. It requires a great deal of time to produce, you see, and I would not have our ssstores empty the next time we are in need of treatment."},{"name":"ESHANA","text":"I would ask you to travel to East End and procure four leaves of fish mint, a medicinal plant which grows at the base of the trees there. When you've found them, pray deliver them to Jagranti. She is the head of our medical station."},{"name":"JAGRATI","text":"Would that I could go and retrieve more herbs for our medicine, but I cannot leave this place unattended."},{"name":"JAGRATI","text":"Eshana requires salve for our sssisters? Then she knows we must first have more herbs."},{"name":"JAGRATI","text":"Ah, this is more than enough. Thank you. I'll set to making more sssalve right away."},{"name":"JAGRATI","text":"For now give her this. It is the last of our reserves until I can make more. This will take time of course, but it should be ready before we have need of it."},{"name":"ESHANA","text":"You are returned. Was Jagranti able to provide you with any sssalve?"},{"name":"ESHANA","text":"Wonderful. My sssisters will be relieved to have this."},{"name":"ESHANA","text":"Care for our tails is more than a matter of beauty, after all."},{"name":"ESHANA","text":"A tail marred with scars for usss is like a pair of boots riddled with holes for you ssstriders. We can have no hindrances if we are to respond quickly to an emergency."},{"name":"JAGRATI","text":"Take that salve to Eshana. Our ssstores should be replenished before we have need of it again."}],"reward":{"gil":615,"reputation":60,"items":[{"num":15,"id":28},{"id":21935}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":34}]}},"partials":[{"type":"npc","id":"1024773","obj":{"i":1024773,"n":"Eshana","l":2406,"q":28}},{"type":"npc","id":"1025073","obj":{"i":1025073,"n":"Jagranti","l":2406,"q":1}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"21935","obj":{"i":21935,"n":"Ananta Dreamstaff","l":1,"c":65061,"t":100}}]}