{"quest":{"name":"Uneggspected Encounters","location":"Gridania","id":68616,"patch":4.2,"sort":155,"repeatable":1,"icon":100754,"eventIcon":71222,"issuer":1025251,"target":1025251,"genre":199,"journal":["Jihli requests your assistance with the Hatching–tide egg hunt.<br>※This quest is available for a limited time only.","Jihli has hinted that the egg hunt will act as a catalyst for festival-goers to enjoy their own unexpected encounters. Take the basket holding the Hatching–tide egg and hide it near the Lancers' Guild.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","You leave the egg-laden basket nestled amongst the other Hatching–tide decorations. Wait nearby, and witness the events which unfold.","You look on as your carefully placed basket becomes the locus upon which two disparate paths converge. Return to Jihli, and describe the scene which took place.","Jihli is delighted to hear your recounting of the serendipitous exchange. The way the Dreamer tells it, however, there are more unexpected encounters just waiting to hatch..."],"objectives":["Place the gilded egg at the designated location.","Wait at the designated location.","Report to Jihli Aliapoh."],"dialogue":[{"name":"JIHLIALIAPOH","text":"Are you ready for some Hatching–tide magic, <span class=\"highlight\">Forename</span>? As my dream revealed, all you need do is help hide one of our eggs and an extraordinary encounter will ensue."},{"name":"JIHLIALIAPOH","text":"We've already been hard at work, spreading the word that anyone who finds a Hatching–tide basket is welcome to the gift the egg holds. I imagine quite a few folk will be out and about, searching for a slice of festival fun!"},{"name":"JIHLIALIAPOH","text":"My vision has shown me the perfect hiding place─here, let me mark it down for you. Simply set the basket down at <span class=\"emphasis\">this</span> spot, then step back and enjoy a whimsical collision of fates!"},{"name":"ESUMIYAN","text":"Ah, yes, the season for egg hunting is upon us again. The whispers of the elementals have been growing ever more fervent..."},{"name":"KHLOEALIAPOH","text":"Yes, I found one! I can't wait to open it and see what's inside!"},{"name":"KHLOEALIAPOH","text":"...Oh, were you here first? You should have it, then!"},{"name":"ESUMIYAN","text":"That is not necessary, little one. Pray take the egg, with my blessing."},{"name":"KHLOEALIAPOH","text":"No no no, that won't do! You look younger than Khloe, and Zhloe always says, “you have to be nice to the children younger than you!”"},{"name":"ESUMIYAN","text":"Ah, sweet child, you must not be from Gridania. Do you see these horns? That means I am a Padjal, and Padjali do not age as others do. Though I appear young, I am much, much older than you."},{"name":"KHLOEALIAPOH","text":"Is that true!? I guess you really <span class=\"emphasis\">do</span> have horns..."},{"name":"KHLOEALIAPOH","text":"Hmmm. Well, if you really are “much, much older,” then you must have been on lots of adventures! Khloe likes listening to stories and then making up her own. Can you tell me some of yours?"},{"name":"ESUMIYAN","text":"Stories? I am not sure I have any tales that might capture your interest, little one..."},{"name":"ESUMIYAN","text":"My apologies, but I must be on my way. I pray your Hatching–tide gift brings you joy."},{"name":"KHLOEALIAPOH","text":"W-Wait! Khloe will give you the egg! I just want to hear a story!"},{"name":"ZHLOEALIAPOH","text":"What a pretty basket. Oh, this must be one of those Hatching–tide eggs!"},{"name":"MAISENTA","text":"Joining in the egg hunt, are we?"},{"name":"ZHLOEALIAPOH","text":"I was! I mean, I am! But you can have this one if you like. Zhloe's business will keep her in Gridania for a little while longer, so..."},{"name":"MAISENTA","text":"No need for that─I was merely coming to see that the goods I provided for the festivities had been delivered in acceptable condition. The prize is all yours."},{"name":"ZHLOEALIAPOH","text":"Oh, I see! Th-Thank you, miss. I'll just take this, then..."},{"name":"ZHLOEALIAPOH","text":"Correct me if I'm wrong but...if you're providing wares for a festival this grand, then you must be a merchant of some renown. Perhaps you might share with Zhloe some of the secrets of your success!"},{"name":"ZHLOEALIAPOH","text":"Zhloe runs an orphanage, you see, and she's started a trading business to help cover the costs. But it's all so complicated! Any advice you could offer would be most appreciated!"},{"name":"MAISENTA","text":"Ah, well I'm afraid trade secrets are not mine to share. I work for a company, you see, and I can't be seen giving advice to a potential competitor."},{"name":"MAISENTA","text":"However... If we were to agree upon some manner of profitable arrangement, then perhaps I could be of service to you. Not as a mentor, mind you, but as a trading partner."},{"name":"ZHLOEALIAPOH","text":"Oh! That would be wonderful, thank you!"},{"name":"SILVAIRRE","text":"Aha, I have found one at last. This hunt has proven more irksome than I anticipated..."},{"name":"LEIHALIAPOH","text":"Silvairre? What brings you to this part of town?"},{"name":"SILVAIRRE","text":"...I am merely passing through. Not that my personal affairs are any of <span class=\"emphasis\">your</span> concern, Leih."},{"name":"LEIHALIAPOH","text":"...Fair enough. And you <span class=\"emphasis\">did</span> say that the egg hunt was “a frivolous distraction for children and simpletons.” You won't mind if I take this basket and be on my way, then."},{"name":"SILVAIRRE","text":"What!? But I found it first!"},{"name":"LEIHALIAPOH","text":"Oh? I thought you were merely “passing though”?"},{"name":"SILVAIRRE","text":"I..."},{"name":"LEIHALIAPOH","text":"Here's the deal, my perpetually humorless colleague. You admit you were actually &lt;gasp&gt; <span class=\"emphasis\">enjoying</span> the egg hunt, and I'll let you have this egg."},{"name":"SILVAIRRE","text":"I care not for your ridiculous egg! Frolic like a fool if you must, but I have training drills to attend. Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">day</span></span> to you!"},{"name":"LEIHALIAPOH","text":"Ah, Silvairre, I thought you would've mended that habit. You <span class=\"emphasis\">still</span> cover your mouth every time you lie..."},{"name":"LEIHALIAPOH","text":"Must he always play the part of a curmudgeon? At least his lies are easy to see through..."},{"name":"LEIHALIAPOH","text":"Such a target he paints upon himself. Let us see him explain things away after I plant this egg in his weapons chest!"},{"name":"YWAIN","text":"Oho, it seems I've found myself a Hatching–tide basket! There's not another soul in sight, after all, and 'twould be a shame to leave it there unclaimed..."},{"name":"NICOLIAUX","text":"Whoa, that was close!"},{"name":"YWAIN","text":"Steady on there, lad.<br>After the egg, were you? Well, far be it from me to deprive a child of his sought-after prize..."},{"name":"NICOLIAUX","text":"Hey, don't I know you from somewhere? I'm fairly sure you're a lancer, but I forget the name..."},{"name":"NICOLIAUX","text":"Well, no matter! You seem kind of worn down, so I'm giving the egg to you. Hope it cheers you up!"},{"name":"YWAIN","text":"Even at the rank of guildmaster, apparently I am a nameless, worn-down nobody...<br>Hmph. Younglings these days."},{"name":"YWAIN","text":"Worn down...? That business with Foulques must be tiring me more than I care to admit. Mayhap I should retire early this evening..."},{"name":"YWAIN","text":"Worn down...? I suppose that unfortunate business with Foulques exhausted me more than I care to admit. Mayhap I should retire early this evening..."},{"name":"BEATIN","text":"To find the egg, you must <span class=\"emphasis\">be</span> the egg, hm hm hm..."},{"name":"FUFUCHA","text":"Oh, Master Beatin, what a pleasant surprise."},{"name":"BEATIN","text":"Mistress Fufucha─the pleasure is all mine. Enjoying the merriment of the egg hunt, are we?"},{"name":"FUFUCHA","text":"I am. As much as I love being up to my elbows in soil, the excitement of the celebrations proved too strong a lure to resist. Although I appear to have arrived a touch late to claim this particular prize."},{"name":"BEATIN","text":"Nonsense. You will have this egg─I insist! Consider it a token of appreciation for the all the fine logs with which you supply us."},{"name":"FUFUCHA","text":"How can I refuse such a gracious offer. My thanks, Guildmaster."},{"name":"BEATIN","text":"Yes, your botanists truly have an eye for the most splendid timber."},{"name":"FUFUCHA","text":"I'm glad our harvest is of adequate quality..."},{"name":"BEATIN","text":"Now, now, no false modesty, child. Why, the teak we received the other day was of such surpassing beauty, I felt myself being drawn into its very grain..."},{"name":"BEATIN","text":"The abundant oils... That supple surface...<br>It seemed an age ere the wood was dried, but my patience was repaid tenfold when I beheld its final form."},{"name":"BEATIN","text":"So resilient... So pliable...<br>Such a labor of love it was that I have yet to commit the planks to a project. The mere thought of what I might craft leaves me aquiver with anticipation..."},{"name":"BEATIN","text":"Say, are you not free for the <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>? Shall we pull up some stools in the workshop and further discuss our mutual love for lumber? From forest to benchtop, there is so much joy we can share on the topic..."},{"name":"FUFUCHA","text":"I, er... I just remembered I forgot to water the succulents! Here, you take the egg! I really must be going..."},{"name":"MIOUNNE","text":"&lt;yawn&gt; Festivals do help bring the crowds to the Canopy, but by the Matron am I exhausted..."},{"name":"MIOUNNE","text":"Well, well, what do we have here? It must be one of those gift baskets everyone has been clamoring about."},{"name":"GEVA","text":"Mother Miounne. On the hunt for eggs as well, are you?"},{"name":"MIOUNNE","text":"I was just out stretching my legs and almost tripped over the thing. Pray take this one if you will─I must return to work."},{"name":"GEVA","text":"You look weary, Miounne. Hatching–tide is a busy time for Gridania, and for you especially, I should think."},{"name":"MIOUNNE","text":"...Are my troubles writ so plain?"},{"name":"GEVA","text":"I've raised two children, dear. Compared to their inexplicable moods and capricious needs, the source of your distress is refreshingly obvious."},{"name":"GEVA","text":"You will have tea with me, and I won't take no for an answer. We can't have the face of Gridania looking worn and haggard now, can we?"},{"name":"MIOUNNE","text":"I accept, then. But at the very least, you must allow me to brew the leaves."},{"name":"GEVA","text":"Of course! I'd be a fool to pass up a cup poured by Mother Miounne herself. Come─let's take our ease for a bit, and crack open this Hatching–tide treasure together."},{"name":"BODYGUARD01623","text":"Aha! I've found one! I only hope my lady will care for such a gift..."},{"name":"BODYGUARD01623","text":"Wha─ Elder Seedseer! I'd thought you ensconced within the Lotus Stand!"},{"name":"KANESENNA","text":"Keeper. The merry laughter of the townsfolk drew me out to join the celebrations, but I'd not thought to see you such an enthusiastic participant."},{"name":"KANESENNA","text":"Nor did I expect to stumble across an egg so quickly...though I believe you arrived some moments before me?"},{"name":"BODYGUARD01623","text":"Nay, my lady! I'm certain you discovered the egg first! The prize is yours! Congratulations!"},{"name":"KANESENNA","text":"Now, now, 'twould be unfair of me to claim what is rightfully yours."},{"name":"BODYGUARD01623","text":"You could never be unfair, Elder Seedseer! Even if I were to take it, this egg would...belong to you..."},{"name":"KANESENNA","text":"...There are other baskets to be found. I should be off, lest I miss my chance! Fare you well, Keeper."},{"name":"BODYGUARD01623","text":"Elder Seedseer! You needn't search for another! I would give you anything..."},{"name":"BODYGUARD01623","text":"Gods curse me for a coward! The perfect moment falls in my lap, yet my lips refuse to obey..."},{"name":"JIHLIALIAPOH","text":"You have the basket and the spot where it needs to be hidden, yes? Then why do you linger!? Quickly now, ere Hatching–tide passes and its wondrous influence fades!"},{"name":"JIHLIALIAPOH","text":"Well, <span class=\"highlight\">Forename</span>? Were you witness to a Hatching–tide encounter?"},{"name":"JIHLIALIAPOH","text":"What mysterious magic this festival weaves! I knew you could help bring those meandering threads together!"},{"name":"JIHLIALIAPOH","text":"Ah, but my dream was filled with many such splendid tapestries. Should you wish to hatch another unexpected meeting, I have more eggs for you to hide!"}],"reward":{"items":[{"num":6,"id":22411}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68615]}},"partials":[{"type":"npc","id":"1025251","obj":{"i":1025251,"n":"Jihli Aliapoh","l":53,"q":1}},{"type":"item","id":"22411","obj":{"i":22411,"n":"Magicked Prism (Hatching-tide)","l":1,"c":22633,"t":85,"p":19}},{"type":"quest","id":"68615","obj":{"i":68615,"n":"Uneggseptable Losses","g":199,"l":"Gridania","s":154}}]}