{"quest":{"name":"And We Shall Call It Eureka","location":"Rhalgr's Reach","id":68614,"patch":4.25,"sort":10,"icon":100764,"unlocksFunction":1,"eventIcon":71341,"issuer":1019459,"target":1025233,"involved":[1019002,1025234],"genre":75,"journal":["Galiena is reasonably sure you are the adventurer she is looking for.","In Rhalgr's Reach you are approached by Galiena, who has been instructed by “Aunt Rowena” to request your assistance with the exploration of a recently discovered island. The island in question is apparently somewhere in the Far East, and if you are interested in learning more, you will have no choice but to journey once more to distant Kugane and speak with Kotokaze, the esteemed proprietress of the Shiokaze Hostelry.","After being shown to a private table, you are joined by Krile, as well as Rowena and Hancock, who have recently become partners after a fashion. The pair explain that they have joined forces in an effort to develop the aforementioned island, which could serve as a new port of call for trading vessels seeking to circumvent the high tariffs of Kugane. Alas, this will not be a simple endeavor, as the previous expedition met with failure at the hands─rather, the claws and teeth─of the innumerable savage beasts that inhabit the island. Warriors of consummate skill are needed, and you stand above all others in their minds. Krile, for her part, has a personal stake in the expedition, though she begs leave to say no more unless her suspicions regarding the island prove true.","Duly advised to go on ahead to the waiting expedition vessel, you come upon Gerolt Blackthorne, by all accounts the finest weaponsmith in all of Eorzea─and an accomplished drunkard besides─locked in a bitter dispute with a belligerent scholar who you soon learn is Ejika Tsunjika of the Students of Baldesion. A contemporary of Krile, he demands to take part in the expedition, having learned of Krile's interest in the island. Krile consents, and Ejika boards without further comment─for the time being. All that remains is to journey to the mysterious island dubbed “Eureka” and see what mysteries await..."],"objectives":["Speak with Kotokaze in Kugane.","Rendezvous with the craftsman at Pier #1."],"dialogue":[{"name":"GALIENA","text":"<span class=\"highlight\">Forename Surname</span>─of the Scions of the Seventh Dawn, if I'm not mistaken?"},{"name":"GALIENA","text":"Very good. I've a message for you from Aunt Rowena. Well, it's more of a request, I suppose, though I don't have any details of consequence..."},{"name":"GALIENA","text":"She'd like you to assist with the exploration of a recently discovered island. Surely you'd be interested in that sort of thing, being an adventurer?"},{"name":"GALIENA","text":"If you are, then you should head to Kugane and see Kotokaze, the proprietress of the Shiokaze Hostelry. It's a long way to go, I know, but the island's out that way anyway, so..."},{"name":"GALIENA","text":"I'd tell you all about Aunt Rowena's proposition if I could, but I honestly don't know anything else. You'll need to head to Kugane to learn more."},{"name":"KOTOKAZE","text":"I see you decided to accept the invitation of the House of Splendors. Rowena will be pleased. Come─I will show you to your table."},{"name":"ROWENA","text":"It's good to see a familiar face in these parts─particularly that o' the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who might well be my most valued customer."},{"name":"HANCOCK","text":"I gather you were not expecting Krile or myself to be attending this little tête-à-tête. As you will see, however, this is a matter which concerns us all."},{"name":"HANCOCK","text":"It all began when a vessel of the East Aldenard Trading Company happened upon an island in the Glass Ocean. A deserted island which was not recorded on our charts and, quite frankly, had no business being there."},{"name":"HANCOCK","text":"Suffice it to say, we were surprised. Pleasantly so, in fact. An unclaimed, undeveloped island in such a location would be a boon to our trading concerns in this corner of the world."},{"name":"ROWENA","text":"Kugane's bleedin' us both dry with its tariffs. Dependin' on the goods, we're paying more than ten times what we'd owe in Limsa or Ul'dah─which is already too damn much, believe you me."},{"name":"HANCOCK","text":"What my dear Rowena is trying to say is that having an additional port of call in this region─one more amenable to free trade─would be in the best interests of a great many parties."},{"name":"HANCOCK","text":"Which is why, upon learning of this island, I immediately authorized an exploratory expedition. The team was large and well funded─I spared no expense. Alas, only a handful returned."},{"name":"HANCOCK","text":"The survivors reported “irregularities” with the island's aether, which we believe gave rise to a number of strange and monstrous beasts─beasts which set upon them not long after they arrived."},{"name":"HANCOCK","text":"This regrettable turn of events forced us to reevaluate our assessment of the island and put our plans on hold for a time. If development was to proceed, it would require a great deal more capital than originally anticipated..."},{"name":"ROWENA","text":"So he came to me and mine for a handout, and I obliged. But before you scoff, know that some of my regular customers were members o' that failed expedition, and what they told me was enough to justify the expense."},{"name":"ROWENA","text":"Tales o' treasure, of untold wealth and riches and gods know what else. Aye, we'll have to wade through all 'em beasties, but with great risk comes great reward, as they say."},{"name":"HANCOCK","text":"Spoken like a born entrepreneur! Your ambition and ruthlessness are admirable, my lady. I daresay I could stand to learn a thing or two from you."},{"name":"HANCOCK","text":"...In any event, having formed our partnership, we wish to dispatch a second joint expeditionary force to the island. That said, if we were to send just anyone, their fate is like to be the same as that of the first."},{"name":"ROWENA","text":"So this time, we've a mind to send a dab hand. A veteran of a thousand thousand battles. A tried-and-true killer. You see where I'm goin' with this?"},{"name":"KRILE","text":"While I lack your aptitude for warcraft, I will be joining the expedition as a researcher. The Scions have an interest in this island─"},{"name":"KRILE","text":"...How perceptive of you. You are right─this is not the sort of affair that would normally concern us. However, after speaking with the others, they have consented to my participation, on account of my <span class=\"emphasis\">personal</span> interest..."},{"name":"KRILE","text":"You will forgive me if I say no more at this time. If my suspicions prove true, then I will tell you everything. I promise."},{"name":"HANCOCK","text":"Right, then. I believe that covers everything! The company ship that will deliver you to the island is waiting to receive you. You may proceed to the pier whenever you are ready to depart."},{"name":"ROWENA","text":"Oh, and so you're not surprised─you'll have company. A craftsman whose help I reckoned we ought to have. He should be at the pier already."},{"name":"KRILE","text":"Rowena and I still have a few things to discuss, so why don't you go on ahead? I'll catch up to you later."},{"name":"EJIKATSUNJIKA","text":"No matter how many times you say it, I refuse to take no for an answer! I am getting on that ship, and that is the end of it!"},{"name":"GEROLT","text":"...And no matter how many times <span class=\"emphasis\">you</span> say it, ye whiny little shite, I ain't about to let a bloody stranger waltz up and deign to tell me which way my bread is buttered! Now piss off!"},{"name":"EJIKATSUNJIKA","text":"(-Incorrigible Youth-)Does your Eorzean stubbornness know no end!? I have urgent business on that island, and I demand you take me there at once!"},{"name":"KRILE","text":"I could hear the shouting half a malm away..."},{"name":"KRILE","text":"Gerolt, what is all the fuss about?"},{"name":"GEROLT","text":"Oh, Miss Krile. Sorry about that. It's this here bastard what's causing trouble."},{"name":"KRILE","text":"Ejika!? What are you doing here?"},{"name":"EJIKATSUNJIKA","text":"Did you really think I wouldn't find out about your letter? The nerve of you, trying to get a head start on your own! Well─sorry to spoil your plans."},{"name":"KRILE","text":"Don't be difficult. I had every intention of requesting your assistance if and when I confirmed my hypothesis was correct..."},{"name":"KRILE","text":"Forgive me. You must be completely at a loss."},{"name":"KRILE","text":"This gentleman on the right is Gerolt Blackthorne, by all accounts the finest weaponsmith in all of Eorzea. He will be lending his considerable expertise to our expedition."},{"name":"KRILE","text":"This gentleman on the right is─ Wait, you already know each other, do you not? Well, as you may have guessed, Gerolt will be lending his considerable expertise to our expedition."},{"name":"KRILE","text":"And on the left, we have─"},{"name":"EJIKATSUNJIKA","text":"Ejika Tsunjika, of the Students of Baldesion. And you must be the so-called Warrior of Light. Charmed, I'm sure. I'll thank you not to get underfoot."},{"name":"KRILE","text":"Manners, Ejika! If you intend to accompany us on this expedition─"},{"name":"EJIKATSUNJIKA","text":"Of course I do! If you think I'm about to let a by-the-book traditionalist like you conduct an independent investigation, you've got another think coming!"},{"name":"KRILE","text":"...I should be glad to welcome the assistance of a preeminent scholar such as yourself. Now, if you would be so kind as to stop badgering poor Gerolt and board the ship, we can get underway."},{"name":"KRILE","text":"Ejika is one of the few surviving Students of Baldesion. While his expertise in aetherology is impressive by any measure, alas, so is his ego..."},{"name":"KRILE","text":"But enough about him! We have an island to explore! If you've no matters left to attend to, speak with Rodney. He will show you aboard."},{"name":"KRILE","text":"Hmm... It occurs to me that no one bothered to tell you the name of the island we mean to explore. Am I correct?"},{"name":"KRILE","text":"It's a bit grandiose and melodramatic, but we've tentatively named it for a place from Allagan legend. A forbidden land where fearsome weapons were hidden away for safekeeping..."},{"name":"KRILE","text":"We call it...Eureka."},{"name":"SYSTEM","text":"You now have access to the Forbidden Land, Eureka Anemos. Anemos can be explored in parties of up to eight players, or solo."},{"name":"SYSTEM","text":"To embark on your journey to Anemos, speak with Rodney at Pier #1 in Kugane."},{"name":"SYSTEM","text":"Please be advised that all excursions into the Forbidden Land, Eureka, are item level synced. For Anemos, gear exceeding an item level of [#1] will be adjusted."},{"name":"SYSTEM","text":"While exploring Anemos, you will have the opportunity to create Eureka gear and weapons. If you wish to do so, it would be prudent to acquire level 70 antiquated items in advance."},{"name":"SYSTEM","text":"Should you wish to know more about Eureka Anemos and what it has to offer, you may speak with Rodney for further details."}],"reward":{"gil":2000,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68089]}},"partials":[{"type":"npc","id":"1019459","obj":{"i":1019459,"n":"Galiena","l":2403,"q":3}},{"type":"npc","id":"1025233","obj":{"i":1025233,"n":"Gerolt","l":2404,"q":1}},{"type":"npc","id":"1019002","obj":{"i":1019002,"n":"Kotokaze","l":2404,"q":5}},{"type":"npc","id":"1025234","obj":{"i":1025234,"n":"Incorrigible Youth","l":2404,"q":1}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}}]}