{"quest":{"name":"Passion for Fashion","location":"The Gold Saucer","id":68617,"patch":4.2,"sort":10691,"unlocksFunction":1,"eventIcon":71341,"issuer":1011145,"target":1025176,"genre":93,"journal":["Lewena is frustrated with a new challenge and needs to unburden herself.","Lewena is in a sour mood, and a new challenge called the Fashion Report is to blame. If you think you have a mind for fashion, she suggests you seek out one Masked Rose at Wonder Square.","Masked Rose, who is most emphatically not the master of a certain Ul'dahn guild, gives you an impassioned overview of the Fashion Report. The challenge requires you to attire yourself based on the theme he assigns before submitting yourself for his judgment. Fabulous prizes await, as does Masked Rose's stinging commentary."],"objectives":["Speak with Masked Rose."],"dialogue":[{"name":"LEWENA","text":"I dressed <span class=\"emphasis\">precisely</span> as I was told. To receive such a dreadful score, not to mention the humiliating criticism... Hmph!"},{"name":"LEWENA","text":"...Hm? You wish to know what's bothering me? That is well, for I wish to unburden myself."},{"name":"LEWENA","text":"I've been having a frustrating time with the Fashion Report, the challenge they recently introduced. Yes, I, who can play any game here blindfolded and spun around, struggle with it. To be fair to myself, though, it has a subjective element."},{"name":"LEWENA","text":"If you have a mind for fashion, perhaps you would like to try your hand at the challenge. Go to Wonder Square and seek out Masked Rose. But be warned: the barbs on that man's tongue have barbs on their tongues."},{"name":"LEWENA","text":"If you have a mind for fashion, perhaps you would like to try your hand at the Fashion Report. Go to Wonder Square and seek out Masked Rose. But be warned: the barbs on that man's tongue have barbs on their tongues."},{"name":"MASKEDROSE","text":"Oho, a new challenger has come to put <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> stylistic sensibilities to the test! Welcome to the Fashion Report, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>!"},{"name":"MASKEDROSE","text":"Wh-What? Is everything quite all right?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Yes, everything is rosy! Redolently so!"},{"name":"A1","text":"Is...is that you, Redolent Rose?"},{"name":"MASKEDROSE","text":"E-Excellent! Full glad am I to hear it!"},{"name":"MASKEDROSE","text":"&lt;sputter&gt; I-I fear you are mistaken! While I am flattered that you should confuse me with the greatest weaver the realm has ever seen, I am <span class=\"emphasis\">Masked</span> Rose, and no other kind."},{"name":"MASKEDROSE","text":"And if that was an attempt to flatter your way into my good graces─nice try, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, but not even the sultana herself can expect special treatment here!"},{"name":"MASKEDROSE","text":"Now then, I believe this is your first time participating in the Fashion Report. Allow me to explain the concept and the rules."},{"name":"MASKEDROSE","text":"Fashion is a form of self-expression. What we wear without is a reflection of who we are within. Be it a conscious effort or no, this choice brings our individuality to the fore."},{"name":"MASKEDROSE","text":"Some folk are drawn to vibrant colors. Others may favor a loose fit for comfort. And while 'tis well and good to dress to one's preferences, a man cannot prefer that which he does not know."},{"name":"MASKEDROSE","text":"The world of fashion is vast and, at times, daunting. But if we have the courage to take a step into the unknown, we may discover wonderful new ways of self-expression we had never considered."},{"name":"MASKEDROSE","text":"And 'tis for no other reason than to encourage folk to take that first step that I created this challenge, the Fashion Report!"},{"name":"MASKEDROSE","text":"The rules are simple: I shall assign you a theme, based upon which you are to attire yourself to the best of your sensibilities. I shall then judge you and award you a score."},{"name":"MASKEDROSE","text":"Participating is free, and there is a host of fabulous prizes to be won, courtesy of Manderville & Manderville."},{"name":"MASKEDROSE","text":"If you wish to know the finer points of the game, my lovely assistant Kasumi shall attend you."},{"name":"MASKEDROSE","text":"I look forward to giving you my unadulterated, brutally honest evaluation of your fashion sense. Steel yourself, and let me know when you are ready to undertake the challenge."},{"name":"SYSTEM","text":"The Fashion Report is now available. Speak with Masked Rose in the Gold Saucer to undertake a fashion challenge."}],"reward":{"gil":104,"xp":3360},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[65970]}},"partials":[{"type":"npc","id":"1011145","obj":{"i":1011145,"n":"Lewena","l":1484,"q":2}},{"type":"npc","id":"1025176","obj":{"i":1025176,"n":"Masked Rose","l":1484,"q":1}},{"type":"quest","id":"65970","obj":{"i":65970,"n":"It Could Happen to You","g":93,"l":"Ul'dah","s":141,"f":1}}]}