{"quest":{"name":"Emissary of the Dawn","location":"The Rising Stones","id":68612,"patch":4.3,"sort":26,"icon":100782,"eventIcon":71201,"issuer":1025549,"target":1025549,"genre":7,"journal":["With thoughts of Alphinaud's plight weighing heavy on her mind, Alisaie might welcome some company.","Since there is naught to be done but wait for word from her brother, Alisaie suggests you take the opportunity to have tea together. No one seems to be sitting at the nearby table, so why not claim it while you wait for the kettle to boil.","After a pleasant while spent chatting with your fellow Scions, you are joined by Thancred, who proceeds to share the fruits of his investigation into Zenos's missing remains. Ascian involvement seems all but certain at this point, and Thancred offers to infiltrate the Empire's western provinces to seek out further information. With Y'shtola's time already committed to a scholarly expedition to Doma, Alisaie reluctantly agrees to hold the fort at the Rising Stones.","Your companions are poised to scatter to the winds once more. Alisaie stands by the entryway to the solar, a worried frown creasing her brow...","Promising to drop in and visit from time to time, you leave Alisaie to await word from Alphinaud. You can but pray that the light of the Crystal goes with him as he enters a realm steeped in Ascian shadow."],"objectives":["Claim the nearby table.","Speak with Alisaie."],"dialogue":[{"name":"YSHTOLA","text":"Alphinaud will have need of all his wits if he is to survive his visit to Garlemald. We know precious little about life in the imperial capital."},{"name":"ALISAIE","text":"It's been an eventful few days, hasn't it. But I suppose all we can do now is wait for word from Alphinaud."},{"name":"ALISAIE","text":"Hmph. I don't recall the last time I had nothing pressing to be getting on with... We should probably make the most of it. Shall I put on some tea?"},{"name":"YSHTOLA","text":"Tea would be lovely. You may regale me with the tale of your adventures in the Far East─and of your encounter with this new primal especially."},{"name":"ALISAIE","text":"I'll put the kettle on, then. That table looks free if you'd like to take a seat."},{"name":"ALISAIE","text":"I'll take care of the tea─you can claim us a table."},{"name":"YSHTOLA","text":"It is pronounced “Tsu-ku-yo-mi,” correct? A figure from Far Eastern mythology, no doubt..."},{"name":"SYSTEM","text":"Upon sitting at the table, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"SYSTEM","text":"In order to undertake this quest, you must be a Disciple of War or Magic of level 70 or above."},{"name":"Q1","text":"Sit at the table?"},{"name":"YSHTOLA","text":"...Interesting. So this Tsukuyomi was summoned in much the same manner as Susano─via the medium of a sacred relic."},{"name":"ALISAIE","text":"That's right. They believe their gods─or kami─reside in physical objects."},{"name":"YSHTOLA","text":"Given the danger they represent, it may behoove us to begin a catalog of such relics. But if we are to contain the threat, we will require a better understanding of the summoning method itself. I believe I shall pay a visit to Doma, and learn what I can on the subject."},{"name":"ALISAIE","text":"A fine idea. And I know for a fact that our friends in Doma would be grateful for any information which could help to prevent further summoning in the region."},{"name":"ALISAIE","text":"I will pen you a letter of introduction─Lord Hien will wish to welcome our resident expert on aetherology."},{"name":"THANCRED","text":"Greetings! Could it be that I'm in time for tea?"},{"name":"ALISAIE","text":"It certainly looks that way. Come on─sit down and tell us how your investigations went."},{"name":"THANCRED","text":"After you left, I went about questioning Bloodhowe's gravekeepers. They all told much the same story: once Lyse and her officers had confirmed Zenos dead, his corpse was interred under strict supervision."},{"name":"THANCRED","text":"There seems little reason to doubt their testimony on that point, but when I mentioned the defacement of Zenos's grave, accounts grew rather more vague."},{"name":"THANCRED","text":"None reported having seen any suspicious persons in the vicinity, and all assumed the act to have been perpetrated by a vengeful Ala Mhigan. Crucially, however, I was able to confirm that when the offending scrawl was removed, as per Lyse's instruction, no one involved thought to check the contents of the coffin. By that stage, 'tis like that the corpse was already missing."},{"name":"THANCRED","text":"Assuming Zenos has not, in fact, risen from the dead, we are left with two possibilities: either the body was disposed of to lend credence to the claims of an extremely committed impostor, or an Ascian has taken up residence within it."},{"name":"YSHTOLA","text":"If Asahi was as fervent a devotee as you believe, he would not have been fooled by an impersonation, however committed. We must assume that we are dealing with an Ascian, and proceed accordingly."},{"name":"THANCRED","text":"Agreed. The question is, how many <span class=\"emphasis\">more</span> such monsters are waiting for Alphinaud in Garlemald?"},{"name":"ALISAIE","text":"Their presence was his chief reason for going. He understood the risks. I only hope he did not underestimate the extent of the infestation..."},{"name":"SYSTEM","text":"Meanwhile, on the Imperial Hypersonic Assault Craft L-XXV..."},{"name":"MAXIMA","text":"Master Alphinaud, we are making good speed towards our destination. Is aught amiss?"},{"name":"ALPHINAUD","text":"Nay, 'tis just...I can see naught from my cabin, and was curious to know the land over which we flew."},{"name":"MAXIMA","text":"Ah. I am afraid our military craft are built with little thought for such niceties. I am happy to indulge your curiosity, however. We are presently passing over the Burn on the western edge of Othard. Even with the benefit of a porthole, your gaze would have been greeted with naught but malms upon malms of lifeless earth."},{"name":"ALPHINAUD","text":"I have read something of the Burn. It was described as a desolate wasteland, bled dry of every last drop of aether..."},{"name":"MAXIMA","text":"Aye. It is believed that a succession of eikon summonings was responsible."},{"name":"MAXIMA","text":"When Emperor Solus first came to Othard and beheld this blight, he is said to have reeled at the scale of the devastation. He declared eikons a threat to our very star's existence, and issued an Empire-wide decree ordering the eradication of all such entities."},{"name":"MAXIMA","text":"Hngh! Report!"},{"name":"IMPERIALPILOT","text":"We're under attack, sir! Magitek armor─no visible designation."},{"name":"ALPHINAUD","text":"Magitek!? But who─?"},{"name":"ALPHINAUD","text":"Aaah!"},{"name":"MAXIMA","text":"All cannons, return fire! Damage report!"},{"name":"IMPERIALPILOT","text":"The main reactor's been hit! Helm unresponsive! We're going down, sir!"},{"name":"MAXIMA","text":"Damn it! They knew exactly where to hit us.<br>All hands─brace for impact!"},{"name":"MAXIMA","text":"Glad to have you back, Master Alphinaud. We have landed in one piece─more or less."},{"name":"MAXIMA","text":"But the air filtration system is damaged, and the ship is filling with smoke. We must gather the survivors and get out while we still can."},{"name":"ALPHINAUD","text":"Aye... Aye."},{"name":"ALPHINAUD","text":"Confound it! Not here. Not like this!"},{"name":"MAXIMA","text":"Wha─? Who in the Emperor's name─?"},{"name":"ALPHINAUD","text":"Enemies of our enemies. Introductions can wait!"},{"name":"MAXIMA","text":"You are calm in a crisis, Master Alphinaud. Let us finish this, then!"},{"name":"ALPHINAUD","text":"My thanks. Your intervention proved most timely."},{"name":"SHADOWHUNTER","text":"(-Menacing Mercenary-)Well, well...<br>I did not think to meet an Eorzean in this place, let alone a Scion."},{"name":"ALPHINAUD","text":"You know of me, sir?"},{"name":"SHADOWHUNTER","text":"(-Menacing Mercenary-)I have some small...history with your order."},{"name":"SHADOWHUNTER","text":"(-Menacing Mercenary-)But I would speak of the present. Know you your assailants? And the severity of your predicament?"},{"name":"MAXIMA","text":"The soldiers bore the insignia of the Emperor's personal guard..."},{"name":"ALPHINAUD","text":"And I could venture a guess as to their motive. But you yet have us at a disadvantage, sir─will you not tell us who you are?"},{"name":"SHADOWHUNTER","text":"(-Menacing Mercenary-)Our names are not yours for the asking. And as for our purpose...let this be your answer."},{"name":"ALPHINAUD","text":"An Ascian mask!"},{"name":"SHADOWHUNTER","text":"(-Menacing Mercenary-)The face of our prey."},{"name":"SHADOWHUNTER","text":"(-Menacing Mercenary-)We must away before more arrive. Come with us or stay, but make your choice now."},{"name":"MAXIMA","text":"Even should we manage the long trek out of the Burn and secure passage to the capital, we would no doubt be greeted by the Emperor's guard..."},{"name":"ALPHINAUD","text":"Indeed.<br>We accept your gracious offer, uh..."},{"name":"SHADOWHUNTER","text":"(-Shadowhunter-)“Shadowhunter” will suffice for the present."},{"name":"SHADOWHUNTER","text":"(-Shadowhunter-)Come."},{"name":"ALISAIE","text":"Ugh, this is intolerable. But as much as I wish it were otherwise, there is nothing we can do for Alphinaud now but pray for his success."},{"name":"THANCRED","text":"Well...that is not <span class=\"emphasis\">entirely</span> true."},{"name":"THANCRED","text":"While your brother journeys to Garlemald from the east, I could make my way there from Ala Mhigo and find out what there is to be learned in the Empire's western provinces."},{"name":"ALISAIE","text":"Then I'm coming with you! I can't very well sit here sipping tea if there's action to be taken!"},{"name":"THANCRED","text":"Forgive me, Alisaie, but the provinces are hostile territory, and stealth is all important. It is safer that I go alone."},{"name":"ALISAIE","text":"I can sneak well enough when the situation demands it! Don't patronize me!"},{"name":"Q1","text":"What will you say to Alisaie?"},{"name":"A1","text":"We should leave this to Thancred."},{"name":"A1","text":"I'll go with him."},{"name":"ALISAIE","text":"Not you too."},{"name":"YSHTOLA","text":"I understand your frustration, Alisaie, but <span class=\"highlight\">Forename</span> has the right of it. We must defer to Thancred's expertise in this matter."},{"name":"ALISAIE","text":"And how exactly would that be any better?"},{"name":"THANCRED","text":"Ahem. I must refuse your company as well, my friend. Formidable though you are, the success of my mission depends on moving unnoticed, and lest you forget, you have grown rather <span class=\"emphasis\">famous</span>. I trust you understand..."},{"name":"ALISAIE","text":"&lt;sigh&gt; ...Fine. Just promise you'll be careful."},{"name":"THANCRED","text":"Well, I had best put on my skulking boots. There will be no room for mistakes once I've crossed the border from Ala Mhigo."},{"name":"YSHTOLA","text":"Alisaie and her brother bicker as all siblings do, but she worries for him nonetheless. 'Twould be a kindness if you were to visit from time to time, and distract her from her cares."},{"name":"ALISAIE","text":"It seems that praying is to be the extent of my contribution after all.<br>...But I will stay behind, as I have been bid."},{"name":"THANCRED","text":"We all have our talents. Mine just happen to involve a silver tongue and soft soles. I promise to send word the moment I learn aught of consequence."},{"name":"YSHTOLA","text":"See that you notify me too. I mean to depart for Doma as soon as I find a suitable East Aldenard vessel to bear me thither, but I shall return if I am needed."},{"name":"ALISAIE","text":"Be sure to drop in whenever you're next in the area, <span class=\"highlight\">Forename</span>. With any luck, I'll have a painfully detailed report from Alphinaud to share."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Ponder</span>!"}],"reward":{"gil":2000,"emote":"Ponder"},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68611]},"next":[68679,69525]},"partials":[{"type":"npc","id":"1025549","obj":{"i":1025549,"n":"Alisaie","l":481,"q":5}},{"type":"quest","id":"68611","obj":{"i":68611,"n":"Under the Moonlight","g":7,"l":"Kienkan","s":25}},{"type":"quest","id":"68679","obj":{"i":68679,"n":"Sisterly Act","g":7,"l":"The Rising Stones","s":27}},{"type":"quest","id":"69525","obj":{"i":69525,"n":"Second-rate Entertainment","g":166,"l":"Ul'dah","s":602,"f":1}}]}