{"quest":{"name":"Under the Moonlight","location":"Kienkan","id":68611,"patch":4.3,"sort":25,"icon":100781,"eventIcon":71201,"issuer":1025009,"target":1025549,"genre":7,"journal":["Alisaie seems ready to bid farewell to Doma.","Alisaie declares the Scions' work in Doma done, and turns her gaze towards Rhalgr's Reach. Lyse will want to hear of Zenos's rumored resurrection...","Lyse reacts to the news of Zenos's return with predictable disbelief, but Thancred is on hand to propose a simple─if somewhat unsavory─way of settling the matter. Journey to Bloodhowe in the Lochs, and inspect the crown prince's mortal remains.","You heave aside the weighty stone lid atop Zenos's resting place, but contrary to Thancred's predictions, find no writhing snakes or scuttling spiders waiting for you within. The coffin is empty. Leaving Thancred to track down the workers responsible for interring the late viceroy, you prepare to return to the Rising Stones with Alisaie. The other Scions must hear of this development, and the possibility that an Ascian now holds court in Garlemald.","You arrive to find that Alisaie has already made a full report to Urianger via linkpearl. Soon after, you are joined by Y'shtola, who listens carefully to the facts before agreeing that Ascian possession is indeed the most likely explanation. It would seem that Alphinaud has entered into a deadly web of intrigue, and Alisaie cannot help but worry for her brother's safety..."],"objectives":["Speak with Lyse in Rhalgr's Reach.","Speak with Lyse at Bloodhowe.","Speak with Alisaie at the Rising Stones."],"dialogue":[{"name":"HIEN","text":"Doma owes you a great debt, my friend. Thanks to you, we have everything we need to prosper. You and Alisaie must promise to visit us again soon. And Alphinaud, too, when he returns from the Empire. Know that my thoughts go with him..."},{"name":"YUGIRI","text":"However far his pilgrimage may take him, we have not seen the last of Gosetsu. Of that I am certain."},{"name":"KIENKANGATEKEEPER03028","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"ALISAIE","text":"I think it's time we were going, don't you? We've done all we can here, and we have a lot to report."},{"name":"ALISAIE","text":"But before we head back to the Rising Stones, let's call in at Rhalgr's Reach. We should be the ones to tell Lyse about Zenos. After everything we went through together, we owe her that."},{"name":"LYSE","text":"<span class=\"highlight\">Forename</span>! Alisaie! You're back!<br>...Hm? No Alphinaud?"},{"name":"ALISAIE","text":"It's good to see you, Lyse. As for my headstrong brother, he's off on what will almost certainly turn out to be a once-in-a-lifetime trip to Garlemald."},{"name":"ALISAIE","text":"It's a long story, but...we have evidence that Zenos might still be alive."},{"name":"LYSE","text":"<span class=\"emphasis\">What</span>!? But that's─ If this is a joke─ Gods, this had better be a joke!"},{"name":"LYSE","text":"Look─I know what I saw, all right? We <span class=\"emphasis\">all</span> saw it. And here you are saying he's alive and well and living the high life back in Garlemald!?"},{"name":"ALISAIE","text":"I know how ludicrous this sounds. I'm still having difficulty believing it myself. But while I might doubt the word of an imperial envoy, I'm inclined to trust <span class=\"highlight\">Forename</span>'s. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> saw the crown prince through the Echo─in a meeting that could only have taken place in the recent past."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It was him. It was Zenos."},{"name":"A1","text":"Zenos is alive."},{"name":"LYSE","text":"No, it must have been─I don't know─some kind of...really convincing impostor. Zenos is <span class=\"emphasis\">dead</span>. He had a great big hole in his neck! We <span class=\"emphasis\">buried</span> him!"},{"name":"MNAAGO","text":"Aye, and someone went to the trouble of desecrating the bastard's grave, remember?"},{"name":"THANCRED","text":"(-???-)Thal's gilded...halls. Whatever are you talking about?"},{"name":"LYSE","text":"Thancred! What brings you to the Reach?"},{"name":"THANCRED","text":"Alphinaud had me lending a hand at the Saltery─keeping an eye on the rebuilding work and so on─just until operations were up and running. And now that they are, I thought I might look in on you before wending my weary way back to headquarters."},{"name":"THANCRED","text":"Forgive me if I misheard, but is there some suggestion the late crown prince could have...<span class=\"emphasis\">gotten better</span>? If so, might I suggest a quick look inside his coffin as our first order of business?"},{"name":"LYSE","text":"Eurgh. As much as I hated the man, it doesn't feel right defiling his grave. But if it will put this rumor to rest, I suppose we have to. And when there are no curious eyes about, if we can manage it."},{"name":"MNAAGO","text":"Zenos is buried up at Bloodhowe in the Lochs. His grave was set apart from the others and left unmarked, so as not to upset the locals."},{"name":"LYSE","text":"Then it shouldn't be too hard to find. Naago, you're in charge until I get back!"},{"name":"MNAAGO","text":"You'll find Zenos's grave up at Bloodhowe, the burial ground in the Lochs. The stone isn't marked, but it's set apart from the others, so it should be obvious enough which one you're after."},{"name":"ALISAIE","text":"Most of the graves are grouped together, but they managed to find a lonely spot for Zenos, didn't they..."},{"name":"THANCRED","text":"My money is on writhing snakes. Possibly spiders. Let's prise it open and see what comes out."},{"name":"LYSE","text":"This is it... Gods, he'd better be in there. Someone scrawled all over the stone a while ago, but I had it scrubbed off, and thought no more about it..."},{"name":"THANCRED","text":"So no one thought to check if the coffin was still occupied? Well then, we are presented with but one course of action."},{"name":"THANCRED","text":"And we had best be sure we are not observed in the doing of it. Shall we begin?"},{"name":"LYSE","text":"If there's no corpse, then...are we to conclude the rumors are true?"},{"name":"THANCRED","text":"Not necessarily. We might still be dealing with a doppelganger of some kind. An agent could have been sent to dispose of the body in a bid to lend credence to the tale of Zenos's resurrection."},{"name":"THANCRED","text":"More and more, however, I find myself siding with Alphinaud's theory of Ascian possession. Speaking from experience, I can tell you they have no qualms about taking a living host, let alone a dead one..."},{"name":"LYSE","text":"You're saying an Ascian is walking around in Zenos's body?"},{"name":"THANCRED","text":"It seems a distinct possibility. Once I have put this grave back the way we found it, I shall pay a visit to the people responsible for interring the crown prince."},{"name":"THANCRED","text":"Before leaping to any conclusions, I want to know for sure if a body was ever buried here...and how certain we are that Zenos was properly dead."},{"name":"LYSE","text":"If he wasn't, that was some trick. He as good as cut his own head off. Anyway, Raubahn needs to hear about this. If you find anything out, send word to me at Rhalgr's Reach."},{"name":"ALISAIE","text":"&lt;sigh&gt; I don't know why I'm surprised─with matters settling down in Doma, we were due another crisis."},{"name":"ALISAIE","text":"Shall we make for the Rising Stones, then? It's past time we shared these developments with the others."},{"name":"LYSE","text":"I've spoken with Raubahn, and we've decided to keep quiet about Zenos until we have undeniable proof. There's no sense in upsetting everyone if there's a chance we're wrong."},{"name":"MNAAGO","text":"So the grave was empty. By Rhalgr... How many people did we lose bringing that bastard down─and now he might still be alive?"},{"name":"THANCRED","text":"I have a question or two for the people in charge of burying Zenos...<br>You were headed back to the Rising Stones, were you not?"},{"name":"ALISAIE","text":"While I was waiting for you to arrive, I spoke with Urianger over linkpearl and gave him a full report. Y'shtola is on her way, and should be here any─ Ah."},{"name":"YSHTOLA","text":"Alisaie. <span class=\"highlight\">Forename</span>. 'Tis good to see you safe and well. What news have you from the East?"},{"name":"YSHTOLA","text":"...Disturbing developments indeed. Given all that we know, I too would conclude that an Ascian now inhabits Zenos's body. A doppelganger might fool the crown prince's subordinates, but <span class=\"highlight\">Forename</span>? Nay, Alphinaud had the right of it."},{"name":"YSHTOLA","text":"Would that his wisdom extended to the question of his own safety. Capable though he has become, he ventures alone into the enemy's stronghold─and the shadowy web of the Paragons, like as not."},{"name":"ALISAIE","text":"When it comes to making rash decisions, I'm hardly in a position to criticize, but..."},{"name":"ALISAIE","text":"I'm worried. I just wish there were something I could do for him besides pray."},{"name":"SYSTEM","text":"Meanwhile, in the imperial palace..."},{"name":"VARIS","text":"We cannot suffer eikons to exist. Was I not clear on this point?"},{"name":"ROBEMAN","text":"(-Zenos-)More than clear. The eikon in question was summarily dispatched by the Warrior of Light. The summoner is dead, and the rite beyond repeating."},{"name":"ROBEMAN","text":"(-Zenos-)Everything proceeded according to plan─every party behaving exactly as required."},{"name":"ROBEMAN","text":"(-Zenos-)My methods may seem extreme, but there is no cause for concern. I work only to ensure the salvation of this star."},{"name":"ROEGADYNSOLDIER","text":"Hm? What are you doing fiddling with that thing?"},{"name":"ROEGADYNSOLDIER","text":"I asked you a question, soldier!"},{"name":"ROEGADYNSOLDIER","text":"What are you─ Have you lost your mind!?"},{"name":"ROEGADYNSOLDIER","text":"Aaah!"},{"name":"KATANASOLDIER","text":"...I have lost many things, but my mind is yet my own."},{"name":"KATANASOLDIER","text":"There upon the stage I stood, prepared to take my final bow, only to find that the finale was but an intermission..."},{"name":"KATANASOLDIER","text":"Shall I use this chance to repent for my sins? Embrace goodness and mediocrity? Nay, I think not. While the one I yearn to face yet lives, the hunt must go on."}],"reward":{"gil":5000},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68610]},"next":[68612]},"partials":[{"type":"npc","id":"1025009","obj":{"i":1025009,"n":"Alisaie","l":2847,"q":2}},{"type":"npc","id":"1025549","obj":{"i":1025549,"n":"Alisaie","l":481,"q":5}},{"type":"quest","id":"68610","obj":{"i":68610,"n":"The Primary Agreement","g":7,"l":"Kienkan","s":24}},{"type":"quest","id":"68612","obj":{"i":68612,"n":"Emissary of the Dawn","g":7,"l":"The Rising Stones","s":26}}]}