{"quest":{"name":"Desire","location":"Kugane","id":68627,"patch":4.3,"sort":50,"icon":100788,"unlocksFunction":1,"eventIcon":71341,"issuer":1025729,"target":1025741,"genre":21,"journal":["Jenomis and his son are ready to present their findings on Ridorana.","Neither the Ridorana Cataract nor the Ridorana Lighthouse appear to have existed during the era in which the Zodiac Brave Story took place. The principal and his son have an idea why that may be, however, and are convinced a journey to the Valnard Sea will bring them closer to the answer.","The <span class=\"emphasis\">Prima Vista</span> arrives at the Ridorana Lighthouse without incident, but the expedition's work has only just begun.","Ramza believes that with his spyglass, you may be able to locate Ba'Gamnan before it is too late.","You find Ba'Gamnan sound of body but bereft of reason, convinced that his loyal brothers have betrayed him to the IVth Legion. After sustaining a mortal wound during a failed attempt on Lina Mewrilah's life, the Bangaa captain enters a pact with the Duma, exchanging his soul for the promise of revenge, and then vanishing without a trace.","Though he knew from the outset that this might occur, Principal Jenomis cannot hide his dismay upon learning of Ba'Gamnan's fate."],"objectives":["Speak with Ramza.","Use the spyglass to search for Ba'Gamnan.","Speak with Principal Jenomis."],"dialogue":[{"name":"RAMZALEXENTALE","text":"If there is aught to discover, my father and I will discover it. You can be sure of that."},{"name":"JENOMISLEXENTALE","text":"Our studies reveal that Ridorana is the name of both a massive gap in the southern Valnard Sea, and the lighthouse once manned by the Royal Dalmascan Navy to prevent ships from succumbing to the cataract's currents."},{"name":"JENOMISLEXENTALE","text":"I stress “once manned” as the tower has lain empty since its candlekeeps abandoned their posts after the fall of Rabanastre. But if Pharos Sirius offers any indication of what can befall a lighthouse in the absence of its caretakers..."},{"name":"RAMZALEXENTALE","text":"Yes, but the real question is how all of this ties in with Ivalician legend."},{"name":"RAMZALEXENTALE","text":"A cursory examination of the Zodiac Brave Story reveals no mention of a “Ridorana.”"},{"name":"RAMZALEXENTALE","text":"Yet it seemed foolish to assume that a name could not change in the centuries since the tale was writ."},{"name":"RAMZALEXENTALE","text":"So I thought to cross-reference texts on modern Ilsabardian history with our translations of the Durai Papers."},{"name":"RAMZALEXENTALE","text":"And after an exhaustive re-examination of my ancestors' notes, I discovered that there was not a single entry on Ridorana."},{"name":"RAMZALEXENTALE","text":"And while mention of the Valnard Sea was abundant, I found no reference whatsoever to any cataract or lighthouse within its waters!"},{"name":"JENOMISLEXENTALE","text":"...Ramza's discovery prompted me to examine the mystery from a different perspective. What if there were no mystery at all? What if, at the time of Delita's rise, the chasm <span class=\"emphasis\">did not yet exist</span>?"},{"name":"RAMZALEXENTALE","text":"There is more...but only a visit to the lighthouse will enable us to confirm our theories with any certainty."},{"name":"LINAMEWRILAH","text":"More? Why the sudden reluctance to reveal their suspicions? A lack of certainty never stopped Ramza from pronouncing on things in the past. Or his father, for that matter."},{"name":"JENOMISLEXENTALE","text":"It is as Ramza said: only by visiting the lighthouse will we be able to confirm our theories."},{"name":"ALMALEXENTALE","text":"We are bound for the lighthouse, then? Of course we are. But do not try and tell me this has anything to do with helping the Bangaa."},{"name":"MONTBLANC","text":"Our first adventure! How exhilarating! Who invited me, you ask? Why, uh, that tall one over yonder...with the face, kupo."},{"name":"HURDY","text":"Do not be fooled by my brother's false bravado. We are from a tribe of desert moogles, many of us never having seen more than an oasis pond, let alone an endless ocean. The mere sight of water should be enough to frighten him back to the airship."},{"name":"BWAGI","text":"If anything were to happen to the captain, I..."},{"name":"GIJUK","text":"I am not afraid to speak what my brothers are thinking─the captain was a fool to believe that the Duma could bring back our fallen. Now his faith in legends and faerie tales will be his end."},{"name":"RINOK","text":"We do not ask that you forgive the past actions of our leader, only that you show him the same kindness that you would anyone in need."},{"name":"RAMZALEXENTALE","text":"The Ridorana Lighthouse lies far from civilization. You would be wise to provision for the trip here in Hingashi."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"An adventurer always comes prepared."},{"name":"A1","text":"An adventurer usually comes prepared. I shall return soon."},{"name":"RAMZALEXENTALE","text":"Of course."},{"name":"RAMZALEXENTALE","text":"Let us not tarry. If the Duma has gotten into that damnable lizard's head, we may have another fight on our hands."},{"name":"RAMZALEXENTALE","text":"Something is very wrong here..."},{"name":"RAMZALEXENTALE","text":"Mayhap it is best if we split our fellowship into two parties─one to delve into the tower's depths, and one to...observe from afar. As acting expedition subleader, I appoint you captain of the first. You may use this spyglass to aid in your search for the missing lizard."},{"name":"BWAGI","text":"Dammit, Brother! Where are you?"},{"name":"JENOMISLEXENTALE","text":"I understand you are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of many obligations, but I trust you will not leave my son down there without your steel to protect him."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Once more onto the beach!"},{"name":"A2","text":"I will join him anon."},{"name":"JENOMISLEXENTALE","text":"Well said!"},{"name":"JENOMISLEXENTALE","text":"Of course. But please make haste."},{"name":"LINAMEWRILAH","text":"The lighthouse looks like it has seen better days. I daresay we have a handful of imperial dreadnaughts and thirty years of disrepair to thank for that."},{"name":"MONTBLANC","text":"Sh-Sh-Sh-Shivering? M-M-M-Me? My fur is s-s-simply s-s-standing on end from all the, uh...ambient aether! Yes, ambient aether in the area. C-C-Can't you feel it, kupo?"},{"name":"BWAGI","text":"Where in the king's name are you hiding, Captain...?"},{"name":"GIJUK","text":"Don't worry, Captain! This lot are with us! They won't hurt you!"},{"name":"RINOK","text":"Captain! Captain! Give us a sign!"},{"name":"ALMALEXENTALE","text":"Why are you alone? Where is my brother!? Is he hurt!?"},{"name":"HURDY","text":"He's dead, isn't he? I knew it. I knew it, kupo... He was so young... So young!"},{"name":"SYSTEM","text":"This location appears to offer an adequate view. Climb up and scan the area for any sign of Ba'Gamnan."},{"name":"BWAGI","text":"You've found him? Let me see!"},{"name":"BWAGI","text":"He needs our help!"},{"name":"BAGGAMONAN","text":"Prince Rasler... Princess Ashelia... I know you cannot forgive me..."},{"name":"BAGGAMONAN","text":"...Nor should you. It is all my fault. I could not save you─could not save <span class=\"emphasis\">anyone</span>... Anyone but myself. I am so sorry..."},{"name":"BWAGI","text":"Ba'Gamnan! Wait!"},{"name":"BAGGAMONAN","text":"Traitors! Have you no pride!? You treat with the very men who laid waste to our homeland!"},{"name":"GIJUK","text":"You are mistaken, Brother! There are no imperials here! We've come to help!"},{"name":"BAGGAMONAN","text":"I know what I see! My own kin sided with the enemy. How <span class=\"emphasis\">dare</span> you stay my audience with the princess!"},{"name":"LINAMEWRILAH","text":"The Duma!"},{"name":"MONTBLANC","text":"It has him, kupo! It's showing him what he wants to see!"},{"name":"BAGGAMONAN","text":"Witch! Murderess!"},{"name":"RAMZALEXENTALE","text":"Gunfire?"},{"name":"BWAGI","text":"Ba'Gamnan!!!"},{"name":"BAGGAMONAN","text":"So this is the end..."},{"name":"BAGGAMONAN","text":"(-The Duma-)Recite the words. Satisfy the covenant. Relinquish thy soul unto me, and be granted that which thou desirest most in all the world..."},{"name":"BAGGAMONAN","text":"Sword in hand...a warrior...clutches stone to breast..."},{"name":"BWAGI","text":"Look at me, Brother! LOOK AT ME!"},{"name":"BAGGAMONAN","text":"In sword...etched he...his fading memories..."},{"name":"GIJUK","text":"Don't you die! Not yet!"},{"name":"BAGGAMONAN","text":"...In stone...his tempered skill."},{"name":"RINOK","text":"We promised we'd all go together when our time came. You can't leave us here!"},{"name":"BAGGAMONAN","text":"By sword attested...by stone...revealed."},{"name":"RAMZALEXENTALE","text":"That light... Where have I seen it before...? <span class=\"emphasis\">Oh no.</span>"},{"name":"RAMZALEXENTALE","text":"Whatever you are doing, you need to leave the lighthouse right away. Right away, do you hear!?"},{"name":"LINAMEWRILAH","text":"There can be no doubt now─in the wrong hands, the auracite is a danger to us all. Something must be done. And quickly."},{"name":"RAMZALEXENTALE","text":"Had Ba'Gamnan not stolen the Duma, he would still be alive today, and we would not be faced with confronting another Lucavi. The lizard only has himself to blame."},{"name":"ALMALEXENTALE","text":"According to Father, the Durai Papers speak of the auracite as a “holy stone.” But I see nothing holy in what it did to Argath and Ba'Gamnan."},{"name":"MONTBLANC","text":"I was fully prepared to fend off the abomination when he vanished, kupo... I daresay he took one look into my eyes and lost the will to fight."},{"name":"HURDY","text":"I think my brother has had more than enough fun for one day, kupo. Perhaps it's time for a Sleep spell... All right, make it Sleep III."},{"name":"BWAGI","text":"I cannot─will not─believe that there is nothing left of Ba'Gamnan in that...that creature. We can still save him. We can!"},{"name":"GIJUK","text":"The captain's dead... I saw the light leave his eyes. And now we're alone..."},{"name":"RINOK","text":"Don't you tell me he's gone! He's not! He's stronger than that! He's the strongest Bangaa you'll ever meet. He'll tear his way out of that Lucavi and crush it under his foot!"},{"name":"JENOMISLEXENTALE","text":"...It is as we feared, then. Ba'Gamnan's soul is lost."},{"name":"MIKOTO","text":"All that I know about Ridorana, I learned during my lessons on Dalmascan geography─but no mention was made of Ivalician legend. While Principal Jenomis seems convinced of a connection, I believe I shall reserve judgment until more is known."},{"name":"MIKOTO","text":"Beyond that, is there aught you wish to know?"},{"name":"MIKOTO","text":"...<span class=\"emphasis\"><span class=\"highlight\">Forename</span></span>? Why are you not with the others? Were you not entrusted with their protection? I can only assume that they have found some manner of safe haven...and that you are here to partake of my knowledge prior to continuing with the expedition."},{"name":"MIKOTO","text":"So...what is it that you wish to know?"},{"name":"MIKOTO","text":"A most interesting twist. I had assumed the auracite would act more swiftly upon the weak-willed, but mayhap I was mistaken. Could it be that the opposite is true? That those possessed of a strong will are <span class=\"emphasis\">more</span> susceptible to its influence, not less? &lt;sigh&gt; There are so many questions..."},{"name":"MIKOTO","text":"...But we are not entirely without answers. Is there aught else you wish to know?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Tell me of the auracite."},{"name":"A3","text":"Tell me of the Otius."},{"name":"A3","text":"Tell me of the Duma."},{"name":"A3","text":"Tell me of the Ridorana Lighthouse."},{"name":"A3","text":"Nothing."},{"name":"MIKOTO","text":"In simple terms, I know. From what I have been able to discern, auracite displays the uncanny ability to draw upon the will of its possessor and manipulate the formless aether into a corporeal manifestation. The resultant form can be maintained for as long as there is aether to sustain it."},{"name":"MIKOTO","text":"Principal Jenomis has recently uncovered evidence which appears to corroborate my suspicion that auracite is not a naturally occurring substance, but one created to serve a purpose─albeit a purpose I have yet to identify."},{"name":"MIKOTO","text":"Despite being in the principal's possession for an extended period, the Otius exhibits none of the aetherial imprinting present in the Duma. In other words, the auracite has yet to absorb any of Lord Jenomis's aether."},{"name":"MIKOTO","text":"It is, for want of a better description, “empty.” Be that as it may, we still have no idea how it might be filled, its creators having neglected to include a removable stopper. Ahem."},{"name":"MIKOTO","text":"As you saw in the ruins of Lesalia, the Duma makes manifest the desires of its owner─on that occasion, Argath Thadalfus."},{"name":"MIKOTO","text":"When you defeated the would-be king, his aether was released from the auracite and the attunement broken, rendering the crystal empty once more."},{"name":"MIKOTO","text":"As you saw in the ruins of Lesalia, the Duma makes manifest the desires of its owner─at that time, Argath Thadalfus."},{"name":"MIKOTO","text":"When you defeated the would-be king, his aether was released from the auracite and the attunement broken, rendering the crystal empty once more."},{"name":"MIKOTO","text":"Until, that is, Ba'Gamnan seized the Duma, providing it with new desires upon which to feed."},{"name":"MIKOTO","text":"Whether Ba'Gamnan attuned himself to the auracite or the auracite attuned to him...is a question I am unprepared to answer. If pressed, however, I would venture that the will of a third party is at work here..."},{"name":"MIKOTO","text":"There is a place on the Valnard Sea, far to the south of Rabanastre, where the ocean tumbles into a gaping maw more than a malm across─the Ridorana Cataract."},{"name":"MIKOTO","text":"Legend would have us believe that it is the entrance to the Hell of Water."},{"name":"MIKOTO","text":"Many a scholar seeking to prove otherwise has descended into the chasm─some even by airship─but not a one has returned."},{"name":"MIKOTO","text":"Balanced on the lip of the raging gulf sits a tiny islet atop which rises an ancient lighthouse─its origins unknown."},{"name":"MIKOTO","text":"For centuries, the tower was manned by Dalmascan candlekeeps who labored from dusk till dawn to warn sailors of the perilous drop. Since the kingdom's annexation, however, the structure has lain vacant...assuming it has not been claimed by the island's wildlife."}],"reward":{"gil":1153,"items":[{"id":23326}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68625]},"next":[68628]},"partials":[{"type":"npc","id":"1025729","obj":{"i":1025729,"n":"Jenomis Cen Lexentale","l":2370,"q":2}},{"type":"npc","id":"1025741","obj":{"i":1025741,"n":"Jenomis Cen Lexentale","l":2371,"q":2}},{"type":"item","id":"23326","obj":{"i":23326,"n":"World Map Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"68625","obj":{"i":68625,"n":"Uninvited","g":21,"l":"Kugane","s":30,"f":1}},{"type":"quest","id":"68628","obj":{"i":68628,"n":"Annihilation","g":21,"l":"Kugane","s":60,"f":1}}]}