{"quest":{"name":"Precious Reclamation","location":"The Doman Enclave","id":68622,"patch":4.2,"sort":10,"icon":100767,"unlocksFunction":1,"eventIcon":71341,"issuer":1024791,"involved":[1006530,1025287],"genre":82,"journal":["Kozakura is working like a woman possessed.","While visiting the enclave one day you meet with Kozakura, a senior official of the Shazenkai, who tells you of her organization's purpose: to facilitate the reconstruction and revitalization of the settlement. To aid them in their endeavor, she and Lord Hien would have you journey to Revenant's Toll, refuge for the Domans in Eorzea, and bid them return to their homeland. Of course, this matter must also be discussed with Slafborn of the Adventurers' Guild.","As they have come to view the Domans as family, the people of Revenant's Toll will be sad to see them go. Nevertheless, this is a happy occasion, and Slafborn is eager to do everything in his power to see them on their way. Moreover, he states that he will encourage the Eorzean frontier hands to accompany the Domans to Yanxia, that they might assist their Far Eastern comrades in the reconstruction.","Hozan and his Doman brethren are overjoyed to hear that they may return to their homeland at last. However, this happiness soon gives way to apprehension, for they dare not leave without properly repaying the kindness of the many Eorzeans to whom they owe so much. Seeing this, Hozan declares that he will ensure that they have sufficient time to put their personal and professional affairs in order. In the meantime, he asks that you assist them with their final preparations by making yourself available should he or any other Domans require a consultation.","The questions the Domans put to you are many and varied, but you answer them to the best of your ability, and their affairs are resolved accordingly. Progress has been made, to be sure, but there is much and more left to be done..."],"objectives":["Deliver Hien's missive to Slafborn in Revenant's Toll.","Speak with Hozan.","Wait for Domans to seek your counsel."],"dialogue":[{"name":"KOZAKURA","text":"Oh, <span class=\"highlight\">Forename</span>! It is a rare honor indeed to receive heroes such as you."},{"name":"KOZAKURA","text":"Pray allow me to introduce myself. My name is Kozakura, and I manage the accounts of the Shazenkai."},{"name":"KOZAKURA","text":"Oh, but you must be unfamiliar with our organization! Forgive me, forgive me. At present, we are largely concerned with facilitating the reconstruction and revitalization of the enclave."},{"name":"KOZAKURA","text":"Needless to say, we have our work cut out for us! It's quite fortuitous actually, you being here. I had mind to petition your assistance─"},{"name":"KOZAKURA","text":"Ah, right you are, it's rather difficult to converse while staring at one's feet. And you would doubtless benefit from an explanation."},{"name":"KOZAKURA","text":"As you may know, the enclave was once the economic and cultural center of Doma. Alas, it suffered terrible devastation at the hands of the Empire both during and following the failed rebellion of yesteryear."},{"name":"KOZAKURA","text":"That it and other ruins might stand as testament to the folly of resistance, extensive reconstruction was forbidden by the imperial viceroy. Of course, that is no longer a concern."},{"name":"KOZAKURA","text":"At long last, we are free to rebuild the enclave─to restore the heart of our once-great nation and show the world that Doma lives on!"},{"name":"KOZAKURA","text":"But as I said before, we have our work cut out for us. We have limited funds and material resources, not to mention a lack of skilled craftsmen..."},{"name":"KOZAKURA","text":"Which brings me back to the matter I wished to discuss with you: that of our brothers and sisters in Eorzea─the refugees that settled in Revenant's Toll."},{"name":"KOZAKURA","text":"I am given to understand that they have worked closely with the local leadership to build and maintain much of the settlement. Many knew trades before they left, and those that did not doubtless learned that they might earn their keep."},{"name":"KOZAKURA","text":"If they were to return home and aid us in the reconstruction effort, it would be a tremendous boon. Would you be willing to speak with them on our behalf?"},{"name":"HIEN","text":"Decided to look in on the Shazenkai first, <span class=\"highlight\">Forename</span>?"},{"name":"HIEN","text":"Ah, <span class=\"highlight\">Forename</span>. Taken an interest in the Shazenkai?"},{"name":"HIEN","text":"Well, this seems as good a time as any to discuss the matter."},{"name":"HIEN","text":"I am grateful beyond measure to you and the Scions of the Seventh Dawn for welcoming Yugiri and my people in their hour of need."},{"name":"HIEN","text":"As the beneficiaries of this kindness, they have made every effort to repay you and the people of Revenant's Toll. Nevertheless, we here bear a responsibility as well."},{"name":"HIEN","text":"Kozakura, if you would be so kind."},{"name":"KOZAKURA","text":"Yes, my lord!"},{"name":"HIEN","text":"We will send them a considerable gift as a gesture of gratitude and goodwill. However, I would like that missive to be delivered to the Adventurers' Guild representative in advance."},{"name":"HIEN","text":"If you were to personally hand it to the man, I would be honored."},{"name":"HIEN","text":"Excellent! I knew I could count on you, my friend."},{"name":"HIEN","text":"Pardon my interruption, Kozakura. I look forward to seeing your progress."},{"name":"KOZAKURA","text":"Oh dear... I hope we don't disappoint him...<br>Anyway, I'll not keep you. Thank you again for the assistance, and safe travels!"},{"name":"KOZAKURA","text":"Lord Hien's request takes precedence, of course, but perhaps you can use it as an opportunity to broach the subject of the refugees' return?"},{"name":"SLAFBORN","text":"What's that, <span class=\"highlight\">Forename</span>? Business concerning the Domans?"},{"name":"SLAFBORN","text":"I see, I see... Lord Hien really needn't have gone to such trouble, but I know all too well how much our Far Eastern friends worry themselves over decorum."},{"name":"SLAFBORN","text":"As for the matter of the refugees' repatriation, I'll not lie. We've come to view them as family, and we'll be sorry to see them go─many of the other fellow frontier hands especially..."},{"name":"SLAFBORN","text":"So let us do you one better: I shall appeal to their Eorzean comrades and invite them to accompany the Domans on their journey, that they too might aid in the reconstruction of the enclave. I expect many will jump at the opportunity!"},{"name":"SLAFBORN","text":"A costly thing to send so many people, to be sure, but owing to Lord Hien's generosity, we seem to have found ourselves with a surplus of funding."},{"name":"SLAFBORN","text":"It's hard to imagine the Toll without the Doman refugees. They helped make it what it is today..."},{"name":"SLAFBORN","text":"Bah─what am I saying? This is a happy occasion! Go and tell Hozan the news! I'm sure he'll be overjoyed."},{"name":"SLAFBORN","text":"Hozan should be working outside the House. The sooner you tell him the better. They've no shortage of preparation to see to!"},{"name":"HOZAN","text":"How very good to see you, my friend─though not at all expected. You look as though you have something important to say. Do you?"},{"name":"HOZAN","text":"I...I know not what to say! Return to Doma? Has the day truly come at last?"},{"name":"HOZAN","text":"Wait here while I summon the others. This concerns them all..."},{"name":"HOMEI","text":"My word! And they are already making arrangements for our return?"},{"name":"HOZAN","text":"Why the long face, Higiri? This is cause for celebration!"},{"name":"HIGIRI","text":"...It is, aye. Like all of you, I have dreamed of this day since the moment we left Yanxia..."},{"name":"HIGIRI","text":"But now that it has arrived, I cannot help but think of those to whom we owe so much. Slafborn especially..."},{"name":"DOWARE","text":"Indeed. Even if it were possible to leave this very moment, I could not. Not until I thanked the people here for everything they have done for us."},{"name":"DOWARE","text":"I remember when we first arrived in this land and learned of its troubles. Though disappointed, I understood why no one would grant us shelter. Who were we? Why risk so much for strangers?"},{"name":"DOWARE","text":"But this place and these people were different. When all others turned us away, Revenant's Toll welcomed us with open arms."},{"name":"DOWARE","text":"I love Doma and Lord Hien with all my heart and want nothing more than to return and help rebuild. But I implore you, Hozan─we must first do our utmost to repay their boundless kindness!"},{"name":"HOZAN","text":"Never did I intend to for us to disappear into the night like thieves and vagabonds. Everything you have said is right and true."},{"name":"HOZAN","text":"All labors we have undertaken will be seen to a measure of completion. That much goes without saying, I am sure."},{"name":"HOZAN","text":"I will speak with Slafborn and ensure that we have enough days to prepare for our journey. In the meantime, I would encourage you all to prepare gifts and so forth."},{"name":"HOMEI","text":"Very good, very good! It would not do to leave without saying proper farewells, else we would labor under a cloud of regret."},{"name":"HOMEI","text":"At my age, one appreciates every opportunity to put their affairs in order. After all, I may not weather the journey home, much less another one to Eorzea!"},{"name":"HOZAN","text":"Hah! Given your constitution, Father, I should not be surprised if you bury us all."},{"name":"HOZAN","text":"Hmm... If you have no pressing obligations, <span class=\"highlight\">Forename</span>, might I impose upon you to assist us with our final preparations?"},{"name":"HOZAN","text":"Since this is all quite sudden, many of our people may require a second opinion on a farewell gift or something else. All I ask is that you make yourself available for any such consultations. Would that be all right?"},{"name":"HOZAN","text":"Thank you, my friend. We will look for you near the northern gate."},{"name":"HOZAN","text":"Quickly now, everyone! Let us not keep <span class=\"highlight\">Forename</span> waiting!"},{"name":"SYSTEM","text":"Assisting the Doman refugees with their final preparations will take several minutes. You may wish to cancel any pending Duty Finder registrations."},{"name":"Q1","text":"Wait to receive the Doman refugees?"},{"name":"HOMEI","text":"So kind of you to spare the time to help us with something so trivial! No doubt you have many other important matters to attend to..."},{"name":"HOMEI","text":"Anyway, I wanted to ask your opinion on a gift I wished to give a dear friend of mine before leaving─Isildaure."},{"name":"HOMEI","text":"You remember Isildaure, do you not? Alianne's grandfather? Though older than me, the two of them were still going on grand adventures before they joined the Scions. Ah, how I envy his vigor."},{"name":"HOMEI","text":"Though we have done little more than drink tea and speak of our children, I have cherished his company. I will miss him, truly..."},{"name":"HOMEI","text":"Alas, in recent days his body has begun to get the better of him, and so I was thinking of giving him something for his health. Do you have any suggestions?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Eye drops, perhaps?"},{"name":"A2","text":"A tonic for his memory?"},{"name":"A2","text":"Anything for his back should do."},{"name":"HOMEI","text":"Oh? Isildaure's eyesight is failing him? He never said anything about that...though you have known him longer than me, I suppose."},{"name":"HOMEI","text":"Very well, I shall speak with one of the merchants and purchase some eye drops. My thanks to you..."},{"name":"HOMEI","text":"Isildaure? Forgetful? Are you certain? His memory has been nothing short of impeccable in my experience, but perhaps you know something I do not..."},{"name":"HOMEI","text":"Very well, I shall speak with one of the merchants and see if one has a suitable tonic. My thanks to you..."},{"name":"SYSTEM","text":"Though Homei accepts your suggestion, his furrowed brow suggests he is not altogether confident it will suffice..."},{"name":"HOMEI","text":"Hahaha! I thought so too, but I am glad to see you agree. I swear, not a day goes by without him complaining about his back."},{"name":"HOMEI","text":"It is a great comfort, knowing that the Scions are well aware of their comrades' conditions. It shows how much you care for one another."},{"name":"HOMEI","text":"Now then─I must procure the ingredients for my home remedy. My thanks to you!"},{"name":"SYSTEM","text":"Homei departs in high spirits, satisfied with your suggestion!"},{"name":"DOWARE","text":"My friend, if you could spare a moment of your time..."},{"name":"DOWARE","text":"The Toll is home to many interests to which we owe a great deal, but there is one in particular to which we should definitely pay respects: Rowena's House of Splendors."},{"name":"DOWARE","text":"The House has been an invaluable source of goods and services, in both professional and personal matters. I am sure you too can say the same."},{"name":"DOWARE","text":"And so I thought to bid farewell to the...one representative with whom I have worked most closely. If you would, uh, look to the counter by the gate..."},{"name":"DOWARE","text":"I speak of the raven-haired beauty by the gate. Of all Rowena's girls, she has been...she has been very helpful."},{"name":"DOWARE","text":"There is a problem, however. I cannot for the life of me remember her name! They all sound so similar. Perhaps it is my Doman ear..."},{"name":"DOWARE","text":"But you know her name, surely? Please, tell me, that I might have a proper conversation with her before I return to my homeland."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Aelina? I thought she dealt in primal arms and whatnot."},{"name":"A3","text":"Auriana? I didn't know you collected tomestones."},{"name":"A3","text":"Laraina? Since when did you collect ritual tools?"},{"name":"A3","text":"G'jusana? So you're interested in the Zodiac Braves?"},{"name":"A3","text":"Papana? Oh, so you're <span class=\"emphasis\">really</span> interested in the Zodiac Braves?"},{"name":"DOWARE","text":"Aelina! That's it! I remembered as soon as you said it."},{"name":"DOWARE","text":"I knew I was right to ask you. They say you're perhaps the House's most valued customer! Anyway, I had best go and speak with her before I forget again!"},{"name":"SYSTEM","text":"Doware departs in high spirits, grateful for your assistance!"},{"name":"DOWARE","text":"Hmm... Are you certain? I've heard that name before, but I could have sworn that was someone else..."},{"name":"DOWARE","text":"Oh, who am I kidding. You of all people should know! Anyway, I had best go and speak with her before I forget again!"},{"name":"SYSTEM","text":"Though Doware departs in high spirits, you cannot help but wonder if you gave him the wrong name...and how poorly he will be received if that is the case..."},{"name":"HIGIRI","text":"<span class=\"highlight\">Forename</span>! Have you seen a Carbuncle roaming about?"},{"name":"HIGIRI","text":"Over the course of my time here in Revenant's Toll, I've come to know many adventurers, including an arcanist with a somewhat disobedient companion."},{"name":"HIGIRI","text":"It seems every day her Carbuncle wanders off on its own, you see, and today is no exception..."},{"name":"HIGIRI","text":"For a mercy, it will respond to its name─more earnestly when called by someone other than its owner, strangely enough. The problem is, I cannot seem to recall what it was. Some sort of gemstone, I think?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Emerald. Definitely Emerald."},{"name":"A4","text":"Oh, you must mean Ruby."},{"name":"A4","text":"I'd wager it's Topaz."},{"name":"A4","text":"If it's not Obsidian, it should be."},{"name":"HIGIRI","text":"How silly of me! It was an Emerald Carbuncle, was it not? Of course she would name it that!"},{"name":"HIGIRI","text":"Thank you for your help, <span class=\"highlight\">Forename</span>! I will join her in the search right away!"},{"name":"SYSTEM","text":"Higiri departs in high spirits and begins calling out for “Emerald” at once. Alas, no errant Carbuncle is forthcoming..."},{"name":"HIGIRI","text":"Ruby! How could I forget? She named it for the red jewel in its forehead!"},{"name":"HIGIRI","text":"Thank you for your help, <span class=\"highlight\">Forename</span>! I will join her in the search right away!"},{"name":"SYSTEM","text":"Higiri departs in high spirits and begins calling out for “Ruby” at once. Sure enough, the errant Carbuncle soon appears!"},{"name":"HIGIRI","text":"Hmm...was it Topaz? The Carbuncle itself was more of an emerald, as I recall...but perhaps she had her reasons for naming it something nonsensical. I will trust in you."},{"name":"HIGIRI","text":"Thank you for your help, <span class=\"highlight\">Forename</span>! I will join her in the search right away!"},{"name":"SYSTEM","text":"Higiri departs in high spirits and begins calling out for “Topaz” at once. Alas, no errant Carbuncle is forthcoming..."},{"name":"HIGIRI","text":"Obsidian! Now I know I have heard that name before! Yes, that must surely be it!"},{"name":"HIGIRI","text":"Thank you for your help, <span class=\"highlight\">Forename</span>! I will join her in the search right away!"},{"name":"SYSTEM","text":"Higiri departs in high spirits and begins calling out for “Obsidian” at once. Alas, no errant Carbuncle is forthcoming..."},{"name":"HOZAN","text":"How fortunate I am that you are still here! My father told me how you helped him, and I was hoping you might do the same for me."},{"name":"HOZAN","text":"I seek your wisdom concerning Slafborn of the Adventurers' Guild, who helped secure us a place here in Revenant's Toll."},{"name":"HOZAN","text":"Thanks to him, we were able to work side by side with the frontier hands to build these walls and lay these cobblestones. We were given food and shelter, it is true, but more importantly, we were given purpose."},{"name":"HOZAN","text":"We have of course already expressed our gratitude to him many times before. I myself presented Slafborn with a Doman dagger, which I am told he treasures..."},{"name":"HOZAN","text":"But now that we must part ways, I feel as though we must make one final grand gesture─a more elaborate, expensive gift, perhaps, or... Well, what do you think?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Something flashy and gaudy that's got bells on."},{"name":"A5","text":"Maybe just try to stay in touch?"},{"name":"HOZAN","text":"B-Bells...? Far be it from me to presume, but I did not take Slafborn for a man who delights in such things...but perhaps you are right."},{"name":"HOZAN","text":"Given our limited resources it may be difficult to purchase something satisfactory, but we will do what we can. My thanks for your candor."},{"name":"SYSTEM","text":"Though Hozan accepts your suggestion, his furrowed brow suggests he is not altogether confident it will suffice..."},{"name":"HOZAN","text":"Really? We should be glad to maintain our relationship with Slafborn and the Toll, but do you truly believe that in of itself is enough?"},{"name":"HOZAN","text":"Hmm... Perhaps you have the right of it. Considering the lengths he has gone to to ease our burdens, spending exorbitant sums on farewell gifts may only frustrate him."},{"name":"HOZAN","text":"Besides, whatever we purchased would come from the Eorzean markets. Better to wait until we have returned to our homeland that we might send them something more Doman. Dried persimmons from my village, perhaps?"},{"name":"SYSTEM","text":"Hozan's eyes sparkle as he considers the possibilities, clearly satisfied with your suggestion!"},{"name":"HOZAN","text":"How go your efforts, brothers and sisters?"},{"name":"HOZAN","text":"By all accounts, it could not have gone any better! And we owe it all to you, my friend!"},{"name":"HOZAN","text":"We are forever in your debt!"},{"name":"HOZAN","text":"By all accounts, it went quite well, and we have you to thank for that. You are too kind, my friend."},{"name":"HOZAN","text":"Some yet struggle to put their affairs in order, but others have been more successful. Thankfully, we should have enough time before we depart..."},{"name":"HOZAN","text":"Hmm... I suppose I cannot be surprised. This is all rather sudden, and it is only natural for us all to struggle. I can but hope that we manage to put all our affairs in order before we depart..."},{"name":"HIGIRI","text":"Hozan, you were going to meet with Slafborn one last time, were you not?"},{"name":"HIGIRI","text":"We were hoping you would allow us to accompany you. If so, please let us know when you do."},{"name":"HOZAN","text":"There are some few matters I must attend to before I speak with Slafborn, but it should not take much─ Hmm?"},{"name":"HOZAN","text":"That is Rhesh Polaali, is it not? Formerly of the Crystal Braves. Another kind-hearted soul to whom we owe much. She looks as though she is searching for something or someone..."},{"name":"HOZAN","text":"<span class=\"highlight\">Forename</span>, I know it is not my place to ask, but would you assist her? I would myself if I could, but with our impending journey..."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the Doman Adventurers' Guild quest “Short Arms of the Law.”"},{"name":"SYSTEM","text":"You may speak with Rhesh Polaali in order to undertake these side story quests, beginning with “Toll Booty.”"},{"name":"HOZAN","text":"There are some few matters I must attend to before I speak with Slafborn, but it should not take much time... Ah, yes─I recall that the children were searching for something? I do not know the details, but it sounded important to them."},{"name":"HOZAN","text":"<span class=\"highlight\">Forename</span>, I know I have imposed upon you enough, but might I ask you to assist my Yozan with his little adventure? If we do not let them see it through to the end before we leave, I will never hear the end of it..."},{"name":"SYSTEM","text":"In order to undertake the subsequent quest, you must first complete the Doman Adventurers' Guild quest “Short Arms of the Law.”"},{"name":"HOZAN","text":"That said, perhaps we should speak with Slafborn sooner than later. I cannot think of any reason to delay."},{"name":"HOZAN","text":"<span class=\"highlight\">Forename</span>, I know I have imposed upon you enough, but might I ask you to accompany me as well?"}],"reward":{"items":[{"id":22436,"one":1},{"id":22437,"one":1},{"id":22434,"one":1},{"num":2,"id":5825,"one":1}],"xp":0},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68561]},"next":[68623]},"partials":[{"type":"npc","id":"1024791","obj":{"i":1024791,"n":"Kozakura","l":2813,"q":4}},{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1025287","obj":{"i":1025287,"n":"Hozan","l":67,"q":2}},{"type":"item","id":"22436","obj":{"i":22436,"n":"Crimson Cider","l":340,"c":24405,"t":46}},{"type":"item","id":"22437","obj":{"i":22437,"n":"Sauteed Green Leeks","l":340,"c":24152,"t":46}},{"type":"item","id":"22434","obj":{"i":22434,"n":"Oden","l":340,"c":24121,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"68561","obj":{"i":68561,"n":"Elation and Trepidation","g":7,"l":"The Ruby Sea","s":15}},{"type":"quest","id":"68623","obj":{"i":68623,"n":"A Thousand and One Farewells","g":82,"l":"Revenant's Toll","s":20,"f":1}}]}