{"quest":{"name":"A Colorful Affair","location":"Ul'dah","id":68620,"patch":4.2,"sort":152,"icon":100762,"eventIcon":71221,"issuer":1025295,"target":1025293,"genre":198,"journal":["This reporter from the <span class=\"emphasis\">Mythril Eye</span> seems eager to ask you a question.<br>※This quest is available for a limited time only.","A reporter from the <span class=\"emphasis\">Mythril Eye</span> is stopping all passersby to take a survey about this year's Little Ladies' Day celebration, and that includes you. As he tells it, Ul'dah is abuzz with talk of the festivities planned, the main event being a special performance by the Songbirds. After taking note of your thoughts on the matter, he encourages you to speak with the royal seneschal over on Emerald Avenue to learn more.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The royal seneschal is heartened by your enthusiasm to take part in the performance. But you cannot join without first being properly dressed for the occasion. He explains to you that everyone who attends will require a special set of garments and illuminations, offering you a promissory note to redeem a set for yourself. The royal seneschal then sends you off to the Weavers' Guild and Alchemists' Guild, eagerly awaiting your return.","After a brief visit to the Weavers' and Alchemists' guilds, you are now the proud owner of three stylish Songbird ensembles and a set of illuminated rods. The royal seneschal will be glad to hear you procured them without incident.","With your costume and lights in hand, all you need do now is wait for the show to begin. Until then, the royal seneschal offers to hold onto your newly acquired raiments and instructs you to speak with the royal handmaiden to better prepare for the performance. <br><br>※To participate in the FATE, you must first speak with the royal handmaiden on Emerald Avenue and receive the “Face in the Crowd” status effect.","Ul'dah is alive with the sound of music, and you helped make it possible. Though the show is over, the energy in the air is palpable. A pity the royal seneschal's duties kept him away from the merrymaking. He would no doubt be glad to hear your impressions of the Songbirds's performance.","The royal seneschal is expressing his gratitude for your taking time to see the Songbirds when they happen to pass by. They each offer you a heartfelt thanks before making a quick exit to prepare for their next show. The support of the people of Ul'dah has helped the Songbirds reach new heights in their musical prowess, but the celebration is far from finished. The streets continue to echo with their sweet birdsong. Should you be interested in seeing them perform once more, you can be certain they will be looking for you in the crowd."],"objectives":["Speak with the royal seneschal.","Deliver the royal seneschal's prommisory note to Redolent Rose to receive Songbird ensembles.","Deliver the royal seneschal's prommisory note to Deitrich to receive a pair of illuminated rods.","Deliver the Songbird ensembles and illuminated rods to the royal seneschal.","Complete the FATE “Color My World” on Emerald Avenue.","Speak with the royal seneschal."],"dialogue":[{"name":"REPORTER03084","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Might I have a moment of your time? I'm conducting a survey for the <span class=\"emphasis\">Mythril Eye</span>."},{"name":"REPORTER03084","text":"Are you aware that Ul'dah is presently celebrating Little Ladies' Day?"},{"name":"REPORTER03084","text":"This year we're celebrating with a rather unconventional performance by the Songbirds. I say unconventional because they plan to have those in attendance take part in the show. Would you care to share your thoughts on the matter?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I was actually planning to attend."},{"name":"A1","text":"The Songbirds...?"},{"name":"REPORTER03084","text":"Ah, a fan are we? They're sure to be glad of another smiling face in the crowd."},{"name":"REPORTER03084","text":"Public awareness appears to be fairly high. Survey of attendees needed after the performance."},{"name":"REPORTER03084","text":"My word! You've not heard of Ulala, Narumi, and Masha Mhakaracca? They're set to perform at the Steps of Nald─all of Ul'dah has been abuzz with the news. Or so I thought."},{"name":"REPORTER03084","text":"At any rate, I would strongly encourage you to attend. You won't regret it."},{"name":"REPORTER03084","text":"Public awareness appears to be surprisingly low. Survey of attendees needed after the performance."},{"name":"REPORTER03084","text":"Where was I? Ah yes. If you would partake of the revelry, you should first speak with the royal seneschal over on Emerald Avenue. He will be overseeing this year's festivities and can tell you all there is to know."},{"name":"REPORTER03084","text":"The royal seneschal should be over on Emerald Avenue. Speak with him and you'll learn all there is to know of this year's Little Ladies' Day."},{"name":"BUTLER","text":"<span class=\"highlight\">Forename</span>! My, what a pleasant surprise. It has been too long, my friend. Have you come to take part in the celebration?"},{"name":"BUTLER","text":"What's this? An adventurer come to take part in the celebration?"},{"name":"BUTLER","text":"The festivities are well underway, and the main event will be a performance by the Songbirds. But this will be no ordinary performance, mind you, for all in attendance will have the opportunity to participate."},{"name":"BUTLER","text":"With that said, the Songbirds' success depends wholly on the number of people present. We have spared no expense to entice the good people of Ul'dah to come and enjoy themselves."},{"name":"BUTLER","text":"In fact, we've prepared garments and illuminations for everyone who chooses to join in our merrymaking."},{"name":"BUTLER","text":"Can we count on your attendance as well? It is to be a celebration none shall forget."},{"name":"BUTLER","text":"Wonderful! To receive your attire and illuminations for the event you will need these promissory notes."},{"name":"BUTLER","text":"Deliver them to Redolent Rose at the Weavers' Guild, and Deitrich at the Alchemists' Guild."},{"name":"BUTLER","text":"When you have what you need for the festivities, pray speak with me again and I will explain what we have planned."},{"name":"BUTLER","text":"There can be no celebrating without your garments and illuminations. Pray speak with me again after visiting the Weavers' and Alchemists' guilds."},{"name":"REDOLENTROSE","text":"Yes? What can I do for you?"},{"name":"REDOLENTROSE","text":"Ah! Another <span class=\"alternative-container\"><span class=\"alternative\">lovely lady</span><span class=\"alternative\">strapping gentleman</span></span> in need of dress for the Songbirds' performance. Here you are."},{"name":"REDOLENTROSE","text":"Marvelous, are they not? The perfect attire to pay homage to the talented troubadours headlining this year's celebration. I was beside myself with excitement when the royal seneschal first approached me with the idea."},{"name":"REDOLENTROSE","text":"Of course, a single ensemble would fail to embody the grace and charm of the Songbirds, which is why I've prepared three! Each was designed using their signature colors. When the time comes, I trust you will choose the one best suited to support your favorite songstress."},{"name":"REDOLENTROSE","text":"Seeing a crowd of adoring fans, awash in vibrant shades of red, yellow, and blue, I have no doubt they will be impassioned to put on a spectacular performance."},{"name":"DEITRICH","text":"Welcome to the Alchemists' Guild. How may I help you?"},{"name":"DEITRICH","text":"The Songbirds? Say no more."},{"name":"DEITRICH","text":"A unique request, to say the least, but they were designed according to the royal seneschal's specifications down to the letter."},{"name":"DEITRICH","text":"They can be adjusted to glow one of three colors─red, blue, or yellow─and will shine brightly even in the afternoon sun. You and all the others will make for quite the spectacle, waving them in the air to and fro. "},{"name":"REDOLENTROSE","text":"I have every confidence you will look smashing in the garments I prepared for you. When the time comes, I trust you will choose the one best suited to support your favorite songstress."},{"name":"DEITRICH","text":"Day or night, those lights will be a shining beacon among the crowd of fans attending the Songbirds' performance."},{"name":"BUTLER","text":"Ah, you are returned. I presume you have everything you need for the performance?"},{"name":"BUTLER","text":"Splendid, splendid. Now you need only wait for the Songbirds to take the stage. Speaking of which, it seems their more ardent fans are already front and center."},{"name":"BUTLER","text":"There are only a few now, perhaps, but judging by the throngs of people who requested promissory notes earlier, this is the start of something truly grand."},{"name":"BUTLER","text":"And all the more grand for your presence. As for the specifics of the performance, I shall leave that explanation to my lovely assistant here."},{"name":"HANDMAID03084","text":"The Songbirds will be performing several times throughout the day adhering to a strict schedule, so be certain not to be late."},{"name":"HANDMAID03084","text":"We will hold onto your celebratory garments and illuminations for the interim. When you have need of them, come and speak with me. I will be more than happy to retrieve them for you."},{"name":"HANDMAID03084","text":"As you have three sets of garments to choose from, however, I will need to know which you wish to wear to the performance."},{"name":"HANDMAID03084","text":"Also, be certain to keep your illuminations at the ready. The girls are always overjoyed to see fans cheer for them using their signature colors. But above all else, remember to enjoy yourself. Today's performance will mean naught without the participation of you and all the others who attend."},{"name":"SYSTEM","text":"During this event, the FATE “Color My World” will appear on Emerald Avenue at the Steps of Nald."},{"name":"SYSTEM","text":"In order to participate in the FATE, you must first speak with the royal handmaiden on Emerald Avenue and prepare yourself to join the Songbirds' crowd of fans."},{"name":"SYSTEM","text":"The status effect granted to you by the royal handmaiden can be removed at any time by leaving the area, or using the special action Curtain Call."},{"name":"SYSTEM","text":"Upon joining the FATE, you will be given three special actions: Cheer On, Cheer Wave, and Cheer Jump. Each action uses a different colored set of illuminated rods to cheer for the Songbirds. Bear in mind each Songbird is especially receptive to fans who cheer using their signature color."},{"name":"BUTLER","text":"Remember: your participation will be key to the Songbirds' success. The enthusiasm and adoration of their fans is certain to help them realize their true potential, making today's celebration all the more entertaining."},{"name":"BUTLER","text":"Welcome back. Though I could watch only from a distance, you and the others seemed to be having a wondrous time. So, how was the performance? Was it all you hoped it would be?"},{"name":"BUTLER","text":"Glad to hear it."},{"name":"BUTLER","text":"It feels like a lifetime ago when the girls first came together to perform. They say the road to celebrity is often paved with uncertainty, and goodness knows the Songbirds have had their fair share."},{"name":"BUTLER","text":"Oh, but how they've grown. Both as performers and respectable little ladies. It truly warms my heart to see them so well loved by the public."},{"name":"BUTLER","text":"To have come this far was only possible thanks to the support of people like you. Thank you again for gracing us with your presence today."},{"name":"BUTLER","text":"Ah, girls! Your timing could not be more fortuitous. Come, come."},{"name":"BUTLER","text":"I was just thanking this adventurer for coming to show <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> support. Seeing as you're all here, why not introduce yourselves?"},{"name":"ULALA","text":"Good to meet you. I'm Ulala─soon to be Eorzea's premier songstress. Thank you so much for coming to our show today."},{"name":"NARUMI","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Good morning</span><span class=\"alternative\">Good afternoon</span></span>, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. I'm Narumi. I hope our performance was to your liking."},{"name":"MASHAMHAKARACCA","text":"I'm Masha Mhakaracca, but you can call me Masha. I think I may have missed a step or two during the show, but that can be our little secret. "},{"name":"BUTLER","text":"You remember <span class=\"highlight\">Forename</span>, yes? I was just thanking <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> for coming to show <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> support."},{"name":"BUTLER","text":"I'm sure you three have words of gratitude to share as well."},{"name":"ULALA","text":"<span class=\"highlight\">Forename</span>! I knew you would come and see us perform."},{"name":"ULALA","text":"But you and I both know which Songbird you were <span class=\"emphasis\">really</span> cheering for. The smile on your face says it all."},{"name":"NARUMI","text":"Good to see you again, <span class=\"highlight\">Forename</span>. I hope today proved an enjoyable respite from your adventures."},{"name":"NARUMI","text":"Looking out into the crowd, seeing all the dazzling lights and people dressed in matching outfits, it felt as though they were putting on a show for us. It was so exciting!"},{"name":"MASHAMHAKARACCA","text":"Glad to see you found time between your adventures to pay us a visit."},{"name":"MASHAMHAKARACCA","text":"The show this year was really something, wasn't it? To be honest, I wasn't sure it would go over well with our fans at first, but I've never been happier to be proven wrong."},{"name":"MASHAMHAKARACCA","text":"I'd love to stay and talk a while longer, but we really must be going. It's nearly time for the next show."},{"name":"ULALA","text":"We'll be performing every day until the festival ends, so don't be a stranger. I'll be looking for you in the audience."},{"name":"NARUMI","text":"You will come to see us again, won't you? I don't know, but... I can't help but feel this may be our last meeting."},{"name":"NARUMI","text":"...I'm sorry. Pay me no mind. Of course you'll come to see us. Perhaps not on the morrow, but hopefully someday soon. Until then, I wish you all the best."},{"name":"BUTLER","text":"Ever the busy birds, those three. Nothing brings them greater joy than thanking each and every one of their fans personally, which is why I'm positive they were thrilled to find time to speak with an adventurer such as yourself."},{"name":"BUTLER","text":"In light of their success here in Ul'dah, I daresay they will soon be ready to spread their wings and share their music with all of Eorzea. I pray they can count on your support as they work to fill the realm with sweet birdsong."}],"reward":{"items":[{"id":22378},{"id":22379},{"id":22380}]},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[68621]},"partials":[{"type":"npc","id":"1025295","obj":{"i":1025295,"n":"Mythril Eye Reporter","l":40,"q":1}},{"type":"npc","id":"1025293","obj":{"i":1025293,"n":"Royal Seneschal","l":40,"q":2}},{"type":"item","id":"22378","obj":{"i":22378,"n":"Ballroom Etiquette - Improper Praise #1","l":1,"c":26435,"t":85}},{"type":"item","id":"22379","obj":{"i":22379,"n":"Ballroom Etiquette - Improper Praise #2","l":1,"c":26435,"t":85}},{"type":"item","id":"22380","obj":{"i":22380,"n":"Ballroom Etiquette - Improper Praise #3","l":1,"c":26435,"t":85}},{"type":"quest","id":"68621","obj":{"i":68621,"n":"Untended Dreams","g":198,"l":"Ul'dah","s":153}}]}