{"quest":{"name":"Annihilation","location":"Kugane","id":68628,"patch":4.3,"sort":60,"icon":112286,"unlocksFunction":1,"eventIcon":71341,"issuer":1025741,"target":1024149,"genre":21,"journal":["A solid plan of action must be devised before facing the Bangaa transformed.","A preliminary examination of the lighthouse's exterior has led Ramza to conclude that the structure was built atop the ruins of an ancient metropolis known as the Clockwork City of Goug. Further investigation of the tower's interior is necessary to put the matter beyond doubt.<br><br>※The Ridorana Lighthouse can be accessed via the Duty Finder.","With Yiazmat defeated and Ba'Gamnan's soul returned to the aether, the secrets of the Ridorana Lighthouse have revealed themselves to you and your companions.","Back aboard the <span class=\"emphasis\">Prima Vista</span>, Bwagi reveals that a necklace discovered by Ramza at the scene of the battle with Ba'Gamnan once belonged to the late Princess Ashelia of Dalmasca.","After your discoveries in Lesalia and now Goug, Lina Mewrilah questions whether you do not already have enough evidence to prove that Ivalice is more than a mere faerie tale. However, she understands that Principal Jenomis and his ever more temperamental son will not stop until they have cleared their family's name."],"objectives":["Enter the Ridorana Lighthouse.","Speak with Lina Mewrilah at Kugane Landing."],"dialogue":[{"name":"JENOMISLEXENTALE","text":"Much as I wish it were otherwise...I fear Ba'Gamnan is beyond saving. Yet we cannot suffer what is left of him to become a distraction."},{"name":"ALMALEXENTALE","text":"Father. Is now not the time to abandon this quest? We are meddling with forces beyond─"},{"name":"RAMZALEXENTALE","text":"<span class=\"emphasis\">Enough</span>, Alma. We adults are talking.<br>While <span class=\"highlight\">Forename</span> was searching for the lizard, I inspected an area of exposed foundation at the base of the lighthouse."},{"name":"JENOMISLEXENTALE","text":"And?"},{"name":"RAMZALEXENTALE","text":"And you were right, Father! The lighthouse is built squarely atop the ruins of what can only be...the Clockwork City of Goug!"},{"name":"LINAMEWRILAH","text":"The what-work city of who?"},{"name":"MIKOTO","text":"According to the Zodiac Brave Story, the Clockwork City of Goug was a metallic metropolis wherein airships, automata, and other technological marvels of the age were first conceived. Little is said about its location, however, save that it was far away."},{"name":"JENOMISLEXENTALE","text":"While the Durai Papers do not say a great deal more, they <span class=\"emphasis\">do</span> mention that the land upon which the legendary city was built was severely limited─an inconvenience that forced its inhabitants to build up, rather than out."},{"name":"JENOMISLEXENTALE","text":"Which led me to ask myself: what if the reason land was limited was because the land in question was an <span class=\"emphasis\">is</span>land?"},{"name":"JENOMISLEXENTALE","text":"But that still would not explain the omission of the cataract. It is inconceivable that the authors would neglect to mention so prominent a landmark had it existed. And then I found it─a lone passage regarding Goug's fall. While the particulars were missing, it appears the city was abandoned after an explosion left half of it in ruin."},{"name":"JENOMISLEXENTALE","text":"I believe that this explosion may have undermined a portion of the seabed. It need only have been a small area at first─one that could well have gone unnoticed during the exodus. As time passed, however, the waters would have continued to wear away at the rock, slowly widening the gap until..."},{"name":"JENOMISLEXENTALE","text":"Well, until we have what lies beneath us today. This would explain why there is no mention of Ridorana prior to the present era."},{"name":"RAMZALEXENTALE","text":"...Come, Father─will you not tell them the rest? Of the possibility that we Garleans are descended in part from the displaced citizens of Goug?"},{"name":"RAMZALEXENTALE","text":"It would explain how the Empire was able to forge its armies of iron even before the discovery and application of Allagan technology."},{"name":"RAMZALEXENTALE","text":"And it may <span class=\"emphasis\">also</span> explain why the legend of Ivalice has resonated with our people for centuries, despite the fact that the lost kingdom was, as far as we can tell, in quite a different corner of the world."},{"name":"MIKOTO","text":"An interesting...if somewhat ambitious theory. But to return to your original claim, it is your belief that the Ridorana Lighthouse stands atop what is left of─"},{"name":"BWAGI","text":"That necklace! Where did you get it, girl?"},{"name":"ALMALEXENTALE","text":"Th-This? It was my mother's."},{"name":"BWAGI","text":"Your <span class=\"emphasis\">mother's</span>?"},{"name":"JENOMISLEXENTALE","text":"It was my late wife's most cherished possession. Why do you ask?"},{"name":"BWAGI","text":"Ba'Gamnan had a talisman he would wear beneath his jerkin. He refused to take it off, even when bathing. He said it was...special. I only saw it a few times, but it looked exactly like the one your daughter wears."},{"name":"RAMZALEXENTALE","text":"<span class=\"emphasis\">And</span>? What are you implying, lizard? That my sister stole it? Or my late mother!?"},{"name":"BWAGI","text":"Neither. I spoke of their similarity. That is all."},{"name":"LINAMEWRILAH","text":"Can you believe the nerve of this boy?"},{"name":"JENOMISLEXENTALE","text":"Enough, Ramza. Our guests are merely concerned for the well-being of their kin."},{"name":"RAMZALEXENTALE","text":"But what of <span class=\"emphasis\">our</span> kin!?"},{"name":"JENOMISLEXENTALE","text":"What of them, Ramza!? Do you imagine our kin to be <span class=\"emphasis\">better</span> than theirs in some way? Or anyone else's for that matter!?"},{"name":"RAMZALEXENTALE","text":"I...I apologize, Father."},{"name":"JENOMISLEXENTALE","text":"We have but one purpose, son, and that is to prove the existence of Ivalice and clear our family's name. Do not allow anger or hate to lead you from that path. Now, we have a lost city to explore!"},{"name":"RAMZALEXENTALE","text":"Mother's necklace... But what is it doing here? Unless─"},{"name":"RAMZALEXENTALE","text":"Alma? Alma, are you there?"},{"name":"ALMALEXENTALE","text":"I'm here, Ramza."},{"name":"JENOMISLEXENTALE","text":"Extraordinary. The stones are different, but the craftsmanship is identical. However did it come to be in Ba'Gamnan's possession?"},{"name":"MIKOTO","text":"Hmm...though they are indeed of a different shape, the stones appear to be cut from the same crystal."},{"name":"MONTBLANC","text":"Oh, they are. Auracite."},{"name":"JENOMISLEXENTALE","text":"Auracite? And what makes you say that?"},{"name":"MONTBLANC","text":"Can't you feel it? You can feel it, can't you, Hurdy."},{"name":"BWAGI","text":"Do you recall me telling you that Ba'Gamnan considered the necklace special?"},{"name":"BWAGI","text":"It was special because it was entrusted to him by Prince Rasler. He was to return it to Princess Ashelia upon delivering Her Highness from Nalbina Fortress."},{"name":"LINAMEWRILAH","text":"A family keepsake."},{"name":"JENOMISLEXENTALE","text":"Of course! And each necklace─each <span class=\"emphasis\">auracite</span>─has acted as a lodestone, drawing both of our parties closer and closer to Ivalice."},{"name":"RAMZALEXENTALE","text":"Indeed, Father. The auracite guides us."},{"name":"ALMALEXENTALE","text":"Ramza! Are you recovered?"},{"name":"RAMZALEXENTALE","text":"Thank you, Sister. I am well now."},{"name":"MIKOTO","text":"From what we know of the Duma and the Otius, vestiges of one's will may endure in an auracite. Could it be, then, that the desire of the former owner─or creator─of these necklaces was simply to...<span class=\"emphasis\">return to Ivalice</span>?"},{"name":"LINAMEWRILAH","text":"But who could that have been?"},{"name":"RAMZALEXENTALE","text":"<span class=\"emphasis\">Ramza.</span> Ramza Beoulve. He wanted people to return to his homeland and uncover the truth behind the kingdom's founding!"},{"name":"RAMZALEXENTALE","text":"But then why show us Lesalia and Goug, you ask."},{"name":"RAMZALEXENTALE","text":"Simple. We are being tested. The auracite is measuring our worth─seeing if we are deserving of that truth."},{"name":"LINAMEWRILAH","text":"You say these things as if you knew them. But how could you? Nothing we have uncovered suggests anything of the kind."},{"name":"RAMZALEXENTALE","text":"I know you have your doubts, but I can assure you they are misplaced. For now, I must ask you to trust me, Lady Mewrilah."},{"name":"LINAMEWRILAH","text":"<span class=\"emphasis\">Lady</span> Mewrilah? Since when did you─"},{"name":"ALMALEXENTALE","text":"Ramza, are you feeling quite yourself?"},{"name":"RAMZALEXENTALE","text":"Of course I am, Sister dearest. I have never felt better!"},{"name":"MONTBLANC","text":"I sense a disturbance in the aether..."},{"name":"RAMZALEXENTALE","text":"Father. These necklaces are gifts. Gifts from the old gods who once watched over the Ivalicians. It is proof we have their blessing! With the necklaces and the Otius, we can finally prove─"},{"name":"RAMZALEXENTALE","text":"Thank you, <span class=\"highlight\">Forename</span>. I know not what came over me..."},{"name":"ALMALEXENTALE","text":"Ramza, you <span class=\"emphasis\">must</span> rest."},{"name":"RAMZALEXENTALE","text":"Leave me be, Alma. Did I not tell you I'll be fine?"},{"name":"LINAMEWRILAH","text":"Another adventure under our belts, eh, <span class=\"highlight\">Forename</span>? I'd best put pen to page before the details fade."},{"name":"LINAMEWRILAH","text":"Lesalia...and now Goug. One would think our discoveries more than sufficient to prove the Lexentales' claims, at least with regard to Ivalice's existence."},{"name":"LINAMEWRILAH","text":"But something tells me that until Jenomis has proof that his ancestors were not the heretics the church painted them to be, he will not rest."},{"name":"LINAMEWRILAH","text":"And then there is the curious case of Ramza. At Alma's throat one moment, all “sister dearest” the next."},{"name":"LINAMEWRILAH","text":"He was like a different person when he came to, yet I seem to be alone in wondering exactly what happened to him back at the lighthouse. If you ask this “Lady,” he must have taken quite some bump to the head when he fell."},{"name":"LINAMEWRILAH","text":"Then again, it didn't take him long to turn back into his spiteful little self, so...all's well that ends well?"}],"reward":{"gil":4500,"items":[{"id":23327}],"instance":30068},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68627]},"next":[68629,68723]},"partials":[{"type":"npc","id":"1025741","obj":{"i":1025741,"n":"Jenomis Cen Lexentale","l":2371,"q":2}},{"type":"npc","id":"1024149","obj":{"i":1024149,"n":"Lina Mewrilah","l":2404,"q":5}},{"type":"item","id":"23327","obj":{"i":23327,"n":"A Chapel Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"30068","obj":{"i":30068,"n":"The Ridorana Lighthouse","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":335}},{"type":"quest","id":"68627","obj":{"i":68627,"n":"Desire","g":21,"l":"Kugane","s":50,"f":1}},{"type":"quest","id":"68629","obj":{"i":68629,"n":"Makin' Bacon (Bread)","g":21,"l":"Kugane","s":900}},{"type":"quest","id":"68723","obj":{"i":68723,"n":"The Path of Most Resistance","g":21,"l":"Kugane","s":70,"f":1}}]}