{"quest":{"name":"Makin' Bacon (Bread)","location":"Kugane","id":68629,"patch":4.3,"sort":900,"eventIcon":71221,"target":1026029,"genre":21,"usedItems":[9331],"journal":["A request from the company belle? Hopefully this is not about bacon bread again.","Relief washes over you as your conversation with the company belle ends without a single mention of bacon bread. According to the wandering dramaturge's scantily clad soul mate, the good man would simply like to learn more of your exploits at the Ridorana Cataract.","The dramaturge is somehow able to turn a congratulatory toast to your recent victory over the forces of darkness into a request to fetch him ten loaves of─you guessed it─bacon bread of the highest quality.","Ever impressed by your resourcefulness, the dramaturge rewards you with a pair of rare trinkets which may well be worth far more than he realizes. Not that you should feel any compunction to tell him..."],"objectives":["Speak with the wandering dramaturge.","Deliver loaves of bacon bread <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the wandering dramaturge."],"dialogue":[{"name":"BEWITCHINGMEMBER","text":"I am sure you are aching to take the weight off your feet after so long and arduous a journey─but my husband seeks an audience."},{"name":"BEWITCHINGMEMBER","text":"You must forgive the man. He can be a trifle...demanding at times, but I assure you he means no ill."},{"name":"BEWITCHINGMEMBER","text":"I am sure you are aching to take the weight off your feet after so long and arduous a journey─but my husband seeks an audience. Humor him, I prithee...for me?"},{"name":"WANDERINGWRITER","text":"A beacon built atop the ruins of a lost city, you say? I would so like to hear more of this latest adventure..."},{"name":"WANDERINGWRITER","text":"But to do so <span class=\"emphasis\">sans refreshment</span> would be in poor taste, indeed. I shall send for an assortment of viands and a bottle of my finest."},{"name":"WANDERINGWRITER","text":"Then again, why send a minion to do the job of a master? Before me stands a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> in a class all <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own when it comes to matters of procurement...as you amply proved earlier."},{"name":"WANDERINGWRITER","text":"After decades of experimentation, I have found that naught save the <span class=\"emphasis\">freshest</span> of freshly baked bacon bread can truly be said to complement my vintage collection. So, shall we say...ten loaves? And none of that day-old stuff. Only the highest quality will do. Understood?"},{"name":"BEWITCHINGMEMBER","text":"My beloved's obsession with bacon runs deep. There was a time when he would cure and smoke his own meat here on the <span class=\"emphasis\">Prima Vista</span>...that is, until the Principal forbade it after being forced to replace half of the company wardrobe due the smell."},{"name":"BEWITCHINGMEMBER","text":"From both the principal and my husband I've heard mention of a “blight” brought about by the auracite. Could that portal we just witnessed be a means of spreading it?"},{"name":"BEWITCHINGMEMBER","text":"No... Now is not the time for idle speculation. You must focus your efforts on the task at hand."},{"name":"BEWITCHINGMEMBER","text":"You rescued Alma only to watch as Ramza was taken in her stead? Promise me, <span class=\"highlight\">Forename</span>! Promise me you will see this right!"},{"name":"BEWITCHINGMEMBER","text":"We must do something, <span class=\"highlight\">Forename</span>! Anything! We cannot let it end like this. Tia would never forgive us..."},{"name":"BEWITCHINGMEMBER","text":"Our thanks, <span class=\"highlight\">Forename</span>. If aught ill had befallen Ramza, his mother would have risen from the Lifestream to haunt us for all eternity. Oh, you presume I jest?"},{"name":"BEWITCHINGMEMBER","text":"\"Lord Dycedarg and the duke would use her as a pawn in their game of thrones! Just as the two of them now use you! Is a man like you not ashamed to be no more than a piece in their game? Have you no pride―no honor?“"},{"name":"BEWITCHINGMEMBER","text":"Hmmm... There is something lacking in the delivery. A touch more tempered fury, perhaps. A sidelong glance into a swift turn and then─ Ah, <span class=\"highlight\">Forename</span>. Simply practicing my lines."},{"name":"WANDERINGWRITER","text":"I imagine one with your myriad talents could procure ten loaves of high-quality bacon bread without a second thought. Mayhap I should have asked for a score...?"},{"name":"WANDERINGWRITER","text":"Tell me, what is that breathtaking aroma? The bouquet of roasted grain and sweet cream butter, accented by the subtle tang of woodsmoke... Could it be...?"},{"name":"WANDERINGWRITER","text":"Ahhh, it is! Bacon bread─and of a quality seldom seen outside the realm's most decorated bakeries. So armed, we can at last celebrate the latest of your unparalleled achievements. A toast!"},{"name":"WANDERINGWRITER","text":"And yes, your reward. You must forgive me, for all I have to offer are these cracked crystals found on one of my wanderings through the ancient thoroughfares of Mhach. If you do not care for them, feel free to throw them away. I shall not be in the least offended."}],"reward":{"items":[{"num":5,"id":18030},{"num":3,"id":18031}]},"reqs":{"quests":[68628]},"next":[68727]},"partials":[{"type":"npc","id":"1026029","obj":{"i":1026029,"n":"Wandering Dramaturge","l":2370,"q":4}},{"type":"item","id":"18030","obj":{"i":18030,"n":"Cracked Cluster","l":1,"c":20020,"t":61}},{"type":"item","id":"18031","obj":{"i":18031,"n":"Cracked Crystal","l":1,"c":20019,"t":61}},{"type":"item","id":"9331","obj":{"i":9331,"n":"Bacon Bread","l":110,"c":24012,"t":46}},{"type":"quest","id":"68628","obj":{"i":68628,"n":"Annihilation","g":21,"l":"Kugane","s":60,"f":1}},{"type":"quest","id":"68727","obj":{"i":68727,"n":"Wok on By","g":21,"l":"Kugane","s":999}}]}