{"quest":{"name":"A Thousand and One Farewells","location":"Revenant's Toll","id":68623,"patch":4.2,"sort":20,"icon":100768,"unlocksFunction":1,"eventIcon":71341,"issuer":1025330,"target":1024791,"involved":[1006530,1006966,1009813,1009814,1009815,1009816,1018433,1025285,1025286,1025287,1025288,1025289,1025290,1025291,1025292,1025331],"genre":82,"journal":["Hozan has a thousand thousand things to do.","Having resolved a number of personal affairs, Hozan and his fellow Domans would like to say a few words to Slafborn. He asks that you be present for this, and wait with the Adventurers' Guild representative while he gathers the others.","Great good can come from even the darkest tragedies, Slafborn muses, as he speaks of how the Domans came to be an inseparable part of Revenant's Toll. What began as a small frontier outpost grew into a thriving community, and much of this is owed to the contributions of the Far Eastern refugees. As all present struggle to fight back the tears, promises are made to preserve the relationship between the Domans and the Eorzeans. Finally, as a parting gift, Slafborn offers his dear friends the so-called “lost treasure of Revenant's Toll,” the old wine found by the Doman children during their search of the camp obliterated in the Calamity years ago. As the Domans return to their preparations, he then asks you to seek out young Yozan and his friends, for it would seem that F'lhaminn has prepared a special surprise for them...","Yozan and the other children have mixed feelings regarding their impending journey, for while Doma remains near and dear to their hearts, they have also come to love Revenant's Toll. However, upon hearing that Miss F'lhaminn has need of them, the Doman Adventurers' Guild quickly rises to the occasion and makes haste to Rowena's café.","As a reward for their exemplary service to Revenant's Toll, F'lhaminn presents the Doman Adventurers' Guild with a set of matching hats. However, when Hoary Boulder and Coultenet arrive to congratulate the children, Shiun starts to cry, not wanting to say good-bye. Hoary tells him not to, then, for as adventurers they are fated to wander, and they may meet again in the future. The children resolve to continue their training and become the most famous adventurers in Yanxia, and to one day return to Eorzea, that they might surpass the Scions and even you.","As he oversees the final preparations of his comrades, Hozan thanks you for the countless times you have helped him and his people. It will still be some time before the refugees at last embark upon their journey, and so he asks that you tell Kozakura of all that has occurred should you find yourself in the enclave before them.","Kozakura is relieved to hear that the refugees are homeward bound, and promises to inform Lord Hien at the first opportunity. Though they have a mountain of work ahead of them, she remains confident that the Shazenkai is up to the task─and she hopes that they can count on your assistance with the reconstruction in the future."],"objectives":["Speak with Slafborn.","Search for Yozan.","Speak with F'lhaminn.","Speak with Hozan.","Speak with Kozakura at the Doman Enclave."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the Doman Adventurers' Guild quest “Short Arms of the Law.”"},{"name":"SYSTEM","text":"You may speak with Rhesh Polaali in order to undertake these side story quests, beginning with “Toll Booty.”"},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the Doman Adventurers' Guild quest “Short Arms of the Law.”"},{"name":"HOZAN","text":"We should pay our respects to Slafborn while we and the others have time to spare, would you not agree?"},{"name":"HOZAN","text":"In that case, I ask that you go on ahead and wait for us with Slafborn."},{"name":"HOZAN","text":"I will require a moment to gather the others, but I do not expect it will take long."},{"name":"SLAFBORN","text":"Judging from the way I've seen the Domans running about, I gather they're busy with preparations for their long voyage?"},{"name":"HOZAN","text":"It is as you say, Master Slafborn..."},{"name":"HOZAN","text":"The day many of us thought would never come has arrived, and now we make ready to return to our homeland."},{"name":"HOZAN","text":"Let me assure you, however, that we have no intention of abandoning our responsibilities. My people have either completed their labors or ensured that others may easily do so in their stead."},{"name":"SLAFBORN","text":"Earnest as ever. I'm grateful, truly, but you needn't have gone to such trouble."},{"name":"SLAFBORN","text":"Revenant's Toll. Gods, when I think back to what this place once was...how it's changed and what it's become..."},{"name":"SLAFBORN","text":"...I can't imagine it without you lot here. You made this place what it is, same as we did. None would dare say different."},{"name":"SLAFBORN","text":"Tragedy drove you from your lands and delivered you to our shores...but from that tragedy came a new beginning. A hope that we shared with every soul that passed through our gates..."},{"name":"SLAFBORN","text":"And that, my friends, is more precious than any riches. I pray you carry it with you to Doma, and that it grant you strength when you have need of it."},{"name":"DOWARE","text":"We will, Master Slafborn! I swear to you, we will never forget this blessed place!"},{"name":"HIGIRI","text":"You gave us the opportunity to work with the frontier hands to build Revenant's Toll. All the skills and experience we gained we will put to good use in rebuilding the enclave."},{"name":"HIGIRI","text":"And then, when we have finished, I pray you will come and visit!"},{"name":"HOZAN","text":"Aye, we would be honored to receive you and any other man or woman or child of Revenant's Toll. Let this not be an ending, but another new beginning─the beginning of a lasting relationship between our two homes."},{"name":"HOZAN","text":"That is my dream for the future of our peoples. As we built these walls stone by stone, may we build it together."},{"name":"SLAFBORN","text":"Hahaha! Well said, well said!"},{"name":"SLAFBORN","text":"...Dammit, if we keep on like this, I'm liable to start bawling. So! Let us move things along. I hope you won't mind another parting gift."},{"name":"SLAFBORN","text":"The lost treasure of Revenant's Toll─courtesy of your younglings. The foreman is expecting you."},{"name":"HOZAN","text":"A most surprising but welcome gift! We shall endeavor not to drink it all at once."},{"name":"HOZAN","text":"We will collect the bottles and return to our preparations at once. Thank you, Master Slafborn."},{"name":"HOZAN","text":"And thank you, <span class=\"highlight\">Forename</span>, for everything."},{"name":"SLAFBORN","text":"Before you go, I've a favor to ask. Well, F'lhaminn, actually. She wants you to bring Yozan and his friends to her, up in Rowena's café."},{"name":"SLAFBORN","text":"The wine's for the adults, you see. She's got something else for the children."},{"name":"SLAFBORN","text":"I doubt it'll take too long for you to find him. You have a knack for this sort of thing, after all. My thanks to you!"},{"name":"SLAFBORN","text":"Once you find Yozan and his friends, please take them to F'lhaminn. She's waiting with a special surprise!"},{"name":"KOHARU","text":"Hey, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>! What are you doing here?"},{"name":"SHIUN","text":"You haven't been looking for us, have you?"},{"name":"ROKKA","text":"We don't have to leave yet, do we? We still have time?"},{"name":"YOUZAN","text":"Oh, hey there, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>... You're not here to say good-bye, are you?"},{"name":"YOUZAN","text":"It's not fair! Why do they get to decide it's time to go back? I mean, I miss Doma too, but they should've asked us first!"},{"name":"YOUZAN","text":"Huh? Miss F'lhaminn wants us to come to the café!? Whatever it is she thinks we did, we─<br>...Oh, it's not like that? Well, all right then..."},{"name":"YOUZAN","text":"With me, guild members! Miss F'lhaminn needs us! You too, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>!"},{"name":"FLHAMINN","text":"You came! I've been waiting for you all for so long."},{"name":"YOUZAN","text":"All members of the Doman Adventurers' Guild, reporting for duty! So what's the adventure? Monster hunting? Garlean gold!?"},{"name":"FLHAMINN","text":"Oh my, nothing so dramatic. Rather, I wanted to give you all a reward."},{"name":"YOUZAN","text":"A r-reward!? Really!?"},{"name":"FLHAMINN","text":"A reward for your many deeds in service to Revenant's Toll."},{"name":"FLHAMINN","text":"When the frontier hands needed a helping hand, you were there. When there was no one else to look after the younger children, you were there."},{"name":"FLHAMINN","text":"And through it all, each and every one of you carried out your duties with a smile. That is why you are more than brave adventurers─you are heroes to the people of the Toll!"},{"name":"FLHAMINN","text":"Heroes deserving of a very special reward that just so happens to be right...over...there!"},{"name":"YOUZAN","text":"(-Doman Adventurers' Guild-)Treasure!"},{"name":"YOUZAN","text":"Wow, look at these!"},{"name":"KOHARU","text":"Look, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>! She got us matching hats!"},{"name":"YOUZAN","text":"We'll make them the official uniform of the Doman Adventurers' Guild!"},{"name":"HOARYBOULDER","text":"They suit you, little ones! Wear them with pride!"},{"name":"YOUZAN","text":"Mister Boulder and Mister Coultenet! I thought you were away on important Scion business!"},{"name":"COULTENET","text":"Recently returned─and it is a good thing we are. We heard of your impending journey and hoped to see you before you left."},{"name":"COULTENET","text":"We are both very happy that you may finally return to your homeland. They have great need of stalwart adventurers like you lot there."},{"name":"SHIUN","text":"&lt;sniffle&gt; But I...I don't want to say good-bye..."},{"name":"HOARYBOULDER","text":"...Then don't. There's no need to. You're adventurers, are you not?"},{"name":"HOARYBOULDER","text":"Adventurers never stay in one place, for it is not who we are. We walk paths all our own, never truly beholden to any one nation or creed. So don't say good-bye, because we may─nay, we <span class=\"emphasis\">will</span> meet again."},{"name":"YOUZAN","text":"You'll see! We'll become the most famous adventurers in Yanxia! And then we'll return to Eorzea and become famous here too!"},{"name":"YOUZAN","text":"Everyone may know the Scions of the Seventh Dawn and the Warrior of Light, but just you wait! Years from now, they'll all be talking about the Doman Adventurers' Guild!"},{"name":"HOARYBOULDER","text":"Hahaha! I'm looking forward to it! Grow strong. Grow famous! Lead the tales, little ones!"},{"name":"COULTENET","text":"We must get going, but thank you again for making the arrangements. Take care."},{"name":"YOUZAN","text":"Right! We mustn't neglect our training! Find the heaviest crates and carry them to the horsebird carriages!"},{"name":"ROKKA","text":"Um... <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span>, Miss F'lhaminn, thank you for the caps. We'll take good care of them!"},{"name":"FLHAMINN","text":"You would think I'd be used to it by now, having to see your children off, but..."},{"name":"YOUZAN","text":"And while we're on the ship, we'll have plenty of time to train!"},{"name":"SHIUN","text":"I don't think that's a good idea. Weren't you sick most of the way here?"},{"name":"MIQOTEGIRL","text":"Is it true? You're all going back to Doma?"},{"name":"KOHARU","text":"There's still a lot of work everyone has to do before we can leave, so let's play until then!"},{"name":"ROKKA","text":"...So are we going to move the crates, or what?"},{"name":"HOMEI","text":"Matching hats? What a sweet gesture from the Scions! I am sure they will cherish them for years to come."},{"name":"DOWARE","text":"Hurgh... Where was this supposed to go again?"},{"name":"HIGIRI","text":"The children told me you took them to see F'lhaminn. I should speak with her as well─I had an idea about exchanging recipes via missives or perhaps even linkpearl..."},{"name":"DOMANWATCH","text":"Once, I thought this a barren wasteland that would never serve as a home for us. How wrong I was."},{"name":"HOZAN","text":"The children are delighted with their new hats! Miss F'lhaminn could not have chosen a better gift."},{"name":"HOZAN","text":"Preparations are proceeding apace. Slafborn and the guild have finalized arrangements for the ship, so once we have finished here, we need only make our way south."},{"name":"HOZAN","text":"How many times have I thanked you, I wonder? Not enough, that much I know..."},{"name":"HOZAN","text":"Thank you, <span class=\"highlight\">Forename</span>, from the bottom of my heart."},{"name":"HOZAN","text":"You are and ever shall be a true friend to Doma and her people..."},{"name":"HOZAN","text":"I expect you will find yourself in the enclave before us. If so, I pray you tell Kozakura that we shall join her soon."},{"name":"HOZAN","text":"Until we meet again, my friend. And if you should find yourself in the enclave before us, I pray you tell Kozakura that we shall join her soon."},{"name":"KOZAKURA","text":"<span class=\"highlight\">Forename</span>! You are returned from Eorzea!"},{"name":"KOZAKURA","text":"...They are homeward bound, then. It comes as a relief to hear that there were no complications."},{"name":"KOZAKURA","text":"Thank you for facilitating their return. I shall inform Lord Hien at the first opportunity."},{"name":"KOZAKURA","text":"We have a mountain of work ahead of us, but with their help I am confident we can see it through─and I hope I can count on your assistance in the future as well!"}],"reward":{"gil":1897,"xp":0},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68622]},"next":[68677]},"partials":[{"type":"npc","id":"1025330","obj":{"i":1025330,"n":"Hozan","l":67,"q":1}},{"type":"npc","id":"1024791","obj":{"i":1024791,"n":"Kozakura","l":2813,"q":4}},{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"npc","id":"1006966","obj":{"i":1006966,"n":"Doman Watch","l":67,"q":1}},{"type":"npc","id":"1009813","obj":{"i":1009813,"n":"Yozan","l":67,"q":4}},{"type":"npc","id":"1009814","obj":{"i":1009814,"n":"Koharu","l":67,"q":4}},{"type":"npc","id":"1009815","obj":{"i":1009815,"n":"Shiun","l":67,"q":4}},{"type":"npc","id":"1009816","obj":{"i":1009816,"n":"Rokka","l":67,"q":4}},{"type":"npc","id":"1018433","obj":{"i":1018433,"n":"F'lhaminn","l":67,"q":4}},{"type":"npc","id":"1025285","obj":{"i":1025285,"n":"Homei","l":67,"q":1}},{"type":"npc","id":"1025286","obj":{"i":1025286,"n":"Doware","l":67,"q":1}},{"type":"npc","id":"1025287","obj":{"i":1025287,"n":"Hozan","l":67,"q":2}},{"type":"npc","id":"1025288","obj":{"i":1025288,"n":"Higiri","l":67,"q":1}},{"type":"npc","id":"1025289","obj":{"i":1025289,"n":"Yozan","l":67,"q":1}},{"type":"npc","id":"1025290","obj":{"i":1025290,"n":"Koharu","l":67,"q":1}},{"type":"npc","id":"1025291","obj":{"i":1025291,"n":"Shiun","l":67,"q":1}},{"type":"npc","id":"1025292","obj":{"i":1025292,"n":"Rokka","l":67,"q":1}},{"type":"npc","id":"1025331","obj":{"i":1025331,"n":"Miqo'te Maiden","l":67,"q":1}},{"type":"quest","id":"68622","obj":{"i":68622,"n":"Precious Reclamation","g":82,"l":"The Doman Enclave","s":10,"f":1}},{"type":"quest","id":"68677","obj":{"i":68677,"n":"It Takes an Enclave","g":82,"l":"The Doman Enclave","s":30,"f":1}}]}