{"quest":{"name":"Recall of Duty","location":"Mor Dhona","id":68624,"patch":4.2,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1008278,"target":1008278,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"WANDERINGMINSTREL","text":"Eager to listen to my harp, are you? For what higher praise could a minstrel ask than to have as an audience the very hero who provides inspiration for his songs!"},{"name":"WANDERINGMINSTREL","text":"Yet I have no fresh compositions I deem fit for a champion's ears. Would that I possessed something more to amuse you..."},{"name":"WANDERINGMINSTREL","text":"Ah! I've been struck by the most wonderful idea! <span class=\"emphasis\">You</span> shall be the author─and the subject─of your own creations!"},{"name":"WANDERINGMINSTREL","text":"Yes! By weaving an epic with your own endeavors, you will find yourself casting a critical eye upon past deeds. Think of such works as muses for future growth!"},{"name":"WANDERINGMINSTREL","text":"'Tis no difficult thing to pen a poem─the words will come of their own accord, I assure you. Simply envision the scene, and describe the memories in faithful detail."},{"name":"WANDERINGMINSTREL","text":"Omit naught and add naught, and the truth shall remain. Reciting the finished piece should then serve to bring the past to vivid life in your mind's eye."},{"name":"WANDERINGMINSTREL","text":"And when you look back upon events with undistracted clarity, what was hidden in chaos may now seem blindingly clear. Especially when things are uncolored by the &lt;cough&gt; <span class=\"emphasis\">embellishments</span> I might bring to the story..."},{"name":"WANDERINGMINSTREL","text":"May the recording of your sagas reward you with inspiration and insight. Oh, and do return sometime and share what you have wrought!"},{"name":"WANDERINGMINSTREL","text":"You now have access to the <span class=\"highlight\">Duty Recorder</span>, allowing you to document duties for viewing within an inn room."},{"name":"WANDERINGMINSTREL","text":"Open the <span class=\"highlight\">Duty Recorder</span> interface located under <span class=\"highlight\">Duty</span> in the main menu, and view the help text for further details on how to use this feature."}],"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[70058]}},"partials":[{"type":"npc","id":"1008278","obj":{"i":1008278,"n":"Wandering Minstrel","l":67,"q":10,"t":"Keeper of Knowledge"}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}}]}