{"quest":{"name":"Waiting for Gyodo","location":"The Azim Steppe","id":68635,"patch":4.3,"sort":4,"icon":100773,"beast":11,"unlocksFunction":1,"eventIcon":71341,"issuer":1025601,"target":1025707,"genre":54,"usedItems":[22696],"journal":["Gyoshin is more eager to speak with you than ever before.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Though─by some estimates─the number of festival participants has ballooned, Gyoshin continues to be troubled by ominous premonitions, and is convinced that the festival in its current state will not suffice to ward off the Namazu's eventual doom. At the suggestion of Seigetsu the Enlightened, the Namazu decide to make the Hingan custom of mikoshi parades their own. You do some warm-up stretches and prepare to lug Gyoshin to Kugane for a research excursion.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Mere moments after you arrive in Kugane and liberate Gyoshin from your bag, you are beset by a group of angry shipwrights who have mistaken him for Gyodo, an unsavory character with whom you are unfortunately well acquainted. You hastily defuse the situation before it comes to blows, and, in a stroke of luck, the lead shipwright reveals himself a builder and enthusiast of mikoshi.","The shipwright not only explains the significance of mikoshi as portable abodes for the kami, but also provides diagrams detailing their construction. Gyoshin is excited to get started, but nevertheless opts to waddle back to the Azim Steppe rather than brave the bag once more.","As soon as you arrive back at Dhoro Iloh, Gyoshin, already envisioning a magnificent completed mikoshi, tasks you with providing frippery. Gyorei will again be collecting all project components to avoid any mishaps.","With your assistance, Gyorei assembles all the components a mikoshi could possibly need, and, working together with the Namazu, you complete one. The preparations for the parade are finally complete, and Gyoshin seems adamant that you be there─though he has not yet revealed what role he expects you to play.","Gyoshin explains that you must excite the attendees by giving a festive shout as you ride by them on the mikoshi. Some trepidation at the thought of being whisked across the festival grounds by a team of Namazu with questionable coordination is understandable, but at least you will not be too far from the ground if you fall.<br><br>※Speak with Gyoshin in Dhoro Iloh to summon the mikoshi bearers.","Faithfully following Gyoshin's instructions, you balance precariously atop the mikoshi and call out “Wasshoi!” to excited onlookers, who are more than happy to “Wasshoi!” back at you.","Gyoshin is so excited by the success of the parade that he resolves to build an additional float, and proceeds to do so faster than the blink of an eye. Gaze upon this feat of craftsmanship, and let it inspire you to make the Namazu's event bigger and better."],"objectives":["Travel to Kugane and deposit Gyoshin at the destination.","Speak to the rowdy shipwright.","Speak to Gyoshin at Dhoro Iloh.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Gyorei</span><span class=\"alternative\">Mine [Error] northeast of the Dawn Throne</span><span class=\"alternative\">Gather [Error] northeast of the Dawn Throne</span><span class=\"alternative\">Catch [Error] at Azim Khaat</span></span>.","Speak to Gyoshin.","Ride the mikoshi to nearby Namazu spectators and use Wasshoi to excite and delight them.","Report to Gyoshin."],"dialogue":[{"name":"GYOSHIN","text":"<span class=\"highlight\">Forename</span>, <span class=\"highlight\">Forename</span>! There is something I wish to discuss. Wait here while I gather the others."},{"name":"GYOSHIN","text":"Our joint efforts have borne fruit, and more and more Namazu come from Yanxia to join us every day. We are surely nearing seven hundred seventy-seven participants by now. Yes, yes... Though I admit I lost track after nine. I only have so many fins and whiskers to count with, you know."},{"name":"GYOSHIN","text":"Alas, my sleep remains troubled. Restless. Every night, I dream of nothing but the Big One."},{"name":"GYOREI","text":"My, my, is the Big One so unsatisfied with our offerings?"},{"name":"GYOSHIN","text":"I wish I knew. Perhaps an offering in and of itself does not a festival make. If we had the wrong idea, then, then..."},{"name":"GYOSHIN","text":"...We will die in seven years. Seven years!"},{"name":"GYOSHIN","text":"Please at least feign distress over our plight!"},{"name":"KOFUINSEIGETSU","text":"Gyoshin's absurd night terrors notwithstanding, he is right in that an offering does not constitute a festival. The addition of a ceremony with more cultural aspects would not go amiss."},{"name":"KOFUINSEIGETSU","text":"True, primitive festivals were not particularly artistic endeavors. But from their base origins did they evolve. Prayer transformed to divination, and ritual to spectacle."},{"name":"KOFUINSEIGETSU","text":"Thus did the shaman become ever more significant to society, and come to wield power similar to that of a chieftain or king. And these shamans, in turn, imbued festivals with yet more ostentation─the better to catch the public eye, you see."},{"name":"KOFUINSEIGETSU","text":"Ceremonial accoutrements became ever more elaborate, while the scale of the events expanded exponentially. This series of escalations culminated in the development of extravagant festival processions!"},{"name":"GYOSHIN","text":"...Summarize your suggestion. Briefly. Three sentences or less."},{"name":"KOFUINSEIGETSU","text":"&lt;sigh&gt; Per <span class=\"emphasis\">The Chrysanthemum and the Dango</span>, some festivals in Hingashi are known for their parades. These parades involve carrying objects called <span class=\"emphasis\">mikoshi</span>. We should attempt to imitate them."},{"name":"GYOSHIN","text":"See, you can do it if you try. If you expend the effort. Now do that from the start next time."},{"name":"GYOSHIN","text":"So, so, <span class=\"highlight\">Forename</span>! You recall how I am most portable, yes, yes? I must away to Kugane, to see a mikoshi and its construction firsthand. Go ahead and stuff me in your bag again, if you please."},{"name":"GYOREI","text":"You take care, now. Yes, yes."},{"name":"GYOSHIN","text":"&lt;wheeze&gt; That bag is most full of sharp objects. And quite cluttered. I can hardly believe I escaped that rubbish-packed purgatory alive."},{"name":"GYOSHIN","text":"...I did not intend to say that out loud. No, no. What I meant was, “thank you!” Yes, yes, of course."},{"name":"GYOSHIN","text":"So, this is Kugane! The vivid colors, the brilliant hues! My artistic soul is all astir!"},{"name":"SHIPWRIGHT","text":"(-???-)Oi, ye Namazu bastard! Mighty lovely to see ye here. Now prepare fer a beatin'!"},{"name":"SHIPWRIGHT","text":"Thought ye'd run off with me money, did ye? Well ye won't be runnin' nowhere when I'm through with ye!"},{"name":"GYOSHIN","text":"W-Wait, wait! Who are you and why, why are you yelling?"},{"name":"SHIPWRIGHT","text":"Don't go playin' silly buggers with me! Ye owe me fer a ship. If I ain't seein' no coin from ye, I'll take it outta yer hide!"},{"name":"SHIPWRIGHT","text":"Eh? This here's “Gyoshin,” not that swindler Gyodo?"},{"name":"SHIPWRIGHT","text":"Well blow me down! My mistake, little fish fella."},{"name":"GYOSHIN","text":"I am just relieved that this was resolved without “beatin'.” I would much prefer to view the mikoshi with my hide intact. Yes, yes."},{"name":"SHIPWRIGHT","text":"Yer interested in mikoshi? A Namazu after me own heart!"},{"name":"SHIPWRIGHT","text":"Ye might not have heard, but it's shipwrights like us what build mikoshi here in Kugane. I'd hate to leave ye with a bad impression, so how 'bout I teach ye what I know by way of apology?"},{"name":"GYOSHIN","text":"I would be most delighted! Very pleased!"},{"name":"SHIPWRIGHT","text":"Just head on over to the ol' Ofunakura, then, and I'll show ye everything there is to know."},{"name":"GYOSHIN","text":"I never imagined we would receive instruction in mikoshi-crafting so soon after arriving in Kugane. No, no. How fortunate that I was nearly murdered!"},{"name":"SHIPWRIGHT","text":"Alright, so what ye need to know first is that mikoshi are meant to be carriages fer the kami. 'Course kami usually reside in shrines, where we earthly folk go to pray, but they also feel right at home in mikoshi. Which means mikoshi are basically small shrines, ye ken?"},{"name":"SHIPWRIGHT","text":"And since we carry 'em for festival parades, they need to be portable. So we attach some poles, and there ye have it─a proper mikoshi."},{"name":"SHIPWRIGHT","text":"Now, Namazu like yerself have a short reach. And are all...round, like. So ye'll need to put some thought into what ye should attach to yer mikoshi to make it easy to carry."},{"name":"GYOSHIN","text":"I see. This has been quite informative. Most enlightening."},{"name":"SHIPWRIGHT","text":"I'll give ye this diagram as well, so go out there and build the best mikoshi yer little flippers can manage."},{"name":"GYOSHIN","text":"I love diagrams! Am most fond of design documents, indeed. Let us return to Dhoro Iloh posthaste. I will walk this time... Not to cast any aspersions on the state of your bag, no, no."},{"name":"SHIPWRIGHT","text":"I suppose I'll head back to searchin' for that Gyodo now. But I'll make sure I've got the right Namazu afore I go a-pummelin'."},{"name":"GYOREI","text":"I do hope your journey to Kugane was educational. Yes, yes."},{"name":"GYOSHIN","text":"I have meditated on how to build a mikoshi suitable for Namazu needs."},{"name":"GYOSHIN","text":"It will require some complex adjustments, some tricky alterations, but nothing my deft fins cannot handle."},{"name":"GYOSHIN","text":"Now, I need you to make some mikoshi pieces. They must be extravagant. Most fancy! The materials you need should be in the crate by the pavilion, so just throw some together. Carefully."},{"name":"GYOSHIN","text":"Now, I need you to make some mikoshi pieces. They must be extravagant. Most fancy! The materials you need should be in the crate by the pavilion, so just throw some together. Carefully."},{"name":"GYOSHIN","text":"Now, I need you to make some components for the finishing touches. Colorful paints, yes, yes. The materials should be in the chest by the pavilion, so just whip some up. Slowly, so as not to splatter."},{"name":"GYOSHIN","text":"Now, I need you to fetch me some dawn dust for the ornamentation. You will find deposits northeast of the Dawn Throne. Yes, yes. Try not to get any in your eye! It is quite painful, I can personally attest."},{"name":"GYOSHIN","text":"Now, I need you to fetch me some duskglow cocoons for the ceremonial rope. You should find a few in the vegetation patches northeast of the Dawn Throne. Yes, yes. Watch out for jutting twigs! They are most unpleasant when encountered face-first, I can personally attest."},{"name":"GYOSHIN","text":"Now, I need you to fetch me a water fan for decoration. You can catch them in Azim Khaat, so long as you have salmon roe to lure them. Yes, yes. Take care not to fall in! It is surprisingly easy to do, I can personally attest."},{"name":"GYOSHIN","text":"Gyorei will collect the components. Yes, yes. We will commence assembly once everything is in her capable fins."},{"name":"GYOSHIN","text":"There should be extra materials in the crate. Rummage through as you please."},{"name":"GYOSHIN","text":"There should be extra materials in the crate. Rummage through as you please."},{"name":"GYOSHIN","text":"There should be extra materials in the crate. Rummage through as you please."},{"name":"GYOSHIN","text":"Gyorei will collect the components, yes, yes. And then we will assemble the mikoshi!"},{"name":"GYOSHIN","text":"Gyorei will collect the components, yes, yes. And then we will assemble the mikoshi!"},{"name":"GYOSHIN","text":"Gyorei will collect the components, yes, yes. And then we will assemble the mikoshi!"},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"GYOSHIN","text":"This will make for a most magnificent, fabulously fancy mikoshi! Now if you could just walk three ilms that way and speak to Gyorei, she will add your work to our growing stock."},{"name":"GYOREI","text":"I hope Gyoshin's task gave you no trouble. He does tend toward the unreasonable. Yes, yes. That said, I am excited to see the finished product!"},{"name":"GYOSHIN","text":"Yes, yes! Our work is complete. A magnificent mikoshi, fit for the Big One!"},{"name":"GYOSHIN","text":"Shining at the top is our greatest grandsire, as I saw him in my vision. I have included several deeply significant, most meaningful bells to emphasize his importance."},{"name":"GYOSHIN","text":"I also added cloudsbreath to the shrine so that it will float atop the shoulders of even the roundest individuals. Yes, yes."},{"name":"GYOSHIN","text":"It is time to begin the parade! But we will not start without you. No, no. We will commence once you are ready. When you tell me you are prepared."},{"name":"GYOREI","text":"Why, the mikoshi is so beautiful I cannot bear to look away! How fortunate that I do not blink."},{"name":"GYOSHIN","text":"You are ready?"},{"name":"GYOSHIN","text":"According to that violent yet helpful shipwright, in some regions a participant is appointed to ride the mikoshi and represent the kami. We would be honored if you accepted this role!"},{"name":"GYOSHIN","text":"Guide the bearers around the festival grounds, and make sure to cheer “wasshoi” as loud as you can in front of the onlookers. Or just sneeze with gusto─I find the effect is quite similar, yes, yes. Let me know how it goes!"},{"name":"GYOSHIN","text":"I will summon the bearers again. Take care not to tumble off like a sack of Gyorin's increasingly ripe persimmons!"},{"name":"NAMAZUSIGHTSEER","text":"What in the world is that?"},{"name":"NAMAZUSIGHTSEERB","text":"So then I said, “that's what you get for not checking the jar before you climb inside it,” yes, yes..."},{"name":"GYOREI","text":"So many Namazu are volunteering to carry the mikoshi! I wonder if we can cram them all in..."},{"name":"GYOSHIN","text":"Wasshoi! Wasshoi! Wassh─ Ow! I think I pulled something..."},{"name":"GYOREI","text":"Oh dear. This is what happens when he gets overexcited. <span class=\"highlight\">Forename</span>, please go and entertain the attendees while I deal with this."},{"name":"SYSTEM","text":"The Namazu are waiting to witness a sensational spectacle. Speak with Gyoshin to mount the mikoshi, and perform a rousing Wasshoi before the Namazu spectators."},{"name":"NAMAZUSIGHTSEER","text":"Wasshoi! Wasshoi! What am I doing? I do not know! I do not care! Whee!"},{"name":"NAMAZUSIGHTSEER","text":"We must have a turn holding that wasshoi hut! Onward!"},{"name":"NAMAZUSIGHTSEERB","text":"Whoa! Wasshoi! Wasshoi! How exciting!"},{"name":"NAMAZUSIGHTSEERB","text":"I want to carry the...whatever it is! Right now! Immediately!"},{"name":"GYOSHIN","text":"That was an inspiring sight! Most captivating. I myself felt a strong urge to join the mikoshi bearers, yes, yes, but Gyorei advised I channel my passion into crafting─for the safety of all involved."},{"name":"GYOSHIN","text":"That is when I remembered that the designs from Kugane included plans for a “float.” There is no better outlet for my inspiration, no, no!"},{"name":"GYOSHIN","text":"...Which is to say that I am about to build a float right now. Watch me. And do not blink!"},{"name":"SYSTEM","text":"Working side by side with the Namazu, you have completed the mikoshi. ...And a float! Parades honoring the Big One are underway."},{"name":"SYSTEM","text":"In seven years, there was fated to be a violent feud between Namazu factions over the right to use prime fishing spots along the One River. Many would have died."},{"name":"SYSTEM","text":"However, carrying the mikoshi together in frequent parades over the course of seven years will bring the Namazu closer together, forging unbreakable bonds between clansmen."},{"name":"SYSTEM","text":"Unbeknownst to all, the Namazu will be spared the grievous tragedy that could have consumed them, and their fate continues to change for the better."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Respected</span> reputation with the Seven Hundred Seventy-Seven."},{"name":"SYSTEM","text":"New Namazu tribal daily quests are now available from Seigetsu the Enlightened at Dhoro Iloh."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Seigetsu the Enlightened as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Seigetsu the Enlightened. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Gyosho."}],"reward":{"gil":1986,"items":[{"id":18022,"one":1},{"id":18024,"one":1},{"id":18025,"one":1}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":35}],"quests":[68634]},"next":[68636]},"partials":[{"type":"npc","id":"1025601","obj":{"i":1025601,"n":"Gyoshin","l":2411,"q":5}},{"type":"npc","id":"1025707","obj":{"i":1025707,"n":"Gyoshin","l":2411,"q":1}},{"type":"item","id":"18022","obj":{"i":18022,"n":"Gatherer's Guerdon Materia VI","l":290,"c":20266,"t":58,"materia":{"tier":5,"value":15,"attr":"Gathering","category":2}}},{"type":"item","id":"18024","obj":{"i":18024,"n":"Gatherer's Grasp Materia VI","l":290,"c":20266,"t":58,"materia":{"tier":5,"value":8,"attr":"GP","category":2}}},{"type":"item","id":"18025","obj":{"i":18025,"n":"Craftsman's Competence Materia VI","l":290,"c":20270,"t":58,"materia":{"tier":5,"value":16,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"22696","obj":{"i":22696,"n":"Mikoshi Frippery Materials","l":150,"c":26001,"t":61}},{"type":"quest","id":"68634","obj":{"i":68634,"n":"Big, Big Fish","g":54,"l":"The Azim Steppe","s":3,"f":1}},{"type":"quest","id":"68636","obj":{"i":68636,"n":"Out of the Frypan","g":54,"l":"The Azim Steppe","s":5,"f":1}}]}