{"quest":{"name":"Disciples of Creation","location":"The Azim Steppe","id":68638,"patch":4.3,"sort":7,"icon":100776,"beast":11,"unlocksFunction":1,"eventIcon":71341,"issuer":1025601,"target":1025844,"genre":54,"journal":["Gyoshin is either lost in thought, or has fallen asleep with his eyes open.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","The festival organizers have received a gift of Namai persimmons from the participants, and Gyoshin would like to share it with the Xaela as thanks for teaching the Namazu their festival traditions. You agree to join him at Dotharl Khaa to offer a personal word of gratitude.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You give Sadu the persimmons, which she gladly accepts despite never having seen the fruit before. She reveals that the Dotharl have found the Namazu's archery event to be quite entertaining, though perhaps for a different reason than Gyoshin intended.","You speak to Magnai, who agrees to accept the persimmons as an offering. Though it seems he and Gyoshin are not quite on the same page when it comes to the relationship between their tribes, for now it is enough that they tolerate one another.","Although Cirina would perhaps rather be eating something else, she politely accepts the Namai persimmons. Having expressed your gratitude for the Mol's help and assured her that her tribe is welcome at the festival any time, you and Gyoshin start back to Dhoro Iloh.","A thoughtful Gyoshin asks you whether anything you and the Namazu have done together has had meaning. Though no one can say for certain whether the festival will, ultimately, save the Namazu from their terrible fate, it seems he remains hopeful. In answer to his own question, he tells you that, whether or not one's creations have an effect on the world at large, the very act of working on something is a defining one. As proof of this, Gyoshin gives you a piece of his handiwork demonstrating that you, through your actions, have forged an identity as a true friend of the Namazu─a bell just like their own."],"objectives":["Speak with Sadu.","Speak with Magnai.","Speak with Cirina.","Speak with Gyoshin."],"dialogue":[{"name":"GYOSHIN","text":"Can you spare a moment? Just a bit of your time?"},{"name":"GYOSHIN","text":"You see, Gyorin has given us a gift of persimmons! But they are not just from him, no, no. They were paid for by many festival participants who wanted to give something to us, the organizers."},{"name":"GYOSHIN","text":"According to Seigetsu the Enlightened, such gifts traditionally demonstrate gratitude for a fantastic festival! Or something like that. I dozed off, to be honest with you."},{"name":"GYOSHIN","text":"Anyway, I think it would be quite fitting, most proper, to share this gift with everyone who made our festival a success. You will join me, yes, yes?"},{"name":"GYOSHIN","text":"Thank you! First we will pay a visit to Sadu in Dotharl Khaa. Off we go!"},{"name":"GYOREI","text":"I really must remain here to ensure that nothing catches on fire. Aside from the elements that are intended to be on fire, of course. But I will make arrangements to send thank-you gifts to the helpful shipwright and Matoya while you are away. Yes, yes. Please take my thanks to the Xaela!"},{"name":"GYOSHIN","text":"Her gaze is still most cold, quite fearsome. Is her face stuck that way?"},{"name":"SADU","text":"You again. What is it this time?"},{"name":"GYOSHIN","text":"We are here to express our gratitude. To give thanks for your help with the archery contest! Via these persimmons from Namai, yes, yes."},{"name":"SADU","text":"An odd gesture, but not unwelcome. I will taste this curious fruit."},{"name":"SADU","text":"Word of your contest reached my ears. I would have dismissed it as mere rumor had my warriors not been the ones to deliver it. They said they nearly died of laughter."},{"name":"GYOSHIN","text":"...I am unsure whether that is a compliment or an insult. Yes, yes. But I am most pleased that you now know of the Namazu!"},{"name":"SADU","text":"Ha! Nor will we soon forget. Stunted chuluu that you are."},{"name":"SADU","text":"Our youths are eager to attend your festivities. You will entertain them."},{"name":"GYOSHIN","text":"Of course, of course! Everyone is welcome! Just come to Dhoro Iloh sometime in the next seven years. We must set off for the Dawn Throne now, but I hope we meet again soon."},{"name":"GYOSHIN","text":"Must he make that face? Is it necessary?"},{"name":"SADU","text":"I do want to eat this, but...how?"},{"name":"MAGNAI","text":"To our dismay, we have seen the enormous, grotesque statue you erected on the cliffs. It displeases us to suffer such an eyesore, though I will commend your artisans' skill."},{"name":"GYOSHIN","text":"...At least part of that was uncalled for. How uncivil. Anyway, we come bearing persimmons from Namai. As thanks for your explanation of Azim Bökh, yes, yes."},{"name":"MAGNAI","text":"Ah, an offering. In that case, I will permit it."},{"name":"MAGNAI","text":"The Oronir are always generous to those who pay obeisance. I will overlook your peculiar customs and grant the Namazu permission to hold your festival─at least until we claim victory in the next Naadam."},{"name":"MAGNAI","text":"You may deliver the persimmons to Esugen. He has charge of all culinary matters."},{"name":"GYOSHIN","text":"Will do!"},{"name":"GYOSHIN","text":"I am unsure whether we have an agreement or not, but I am quite satisfied that you at least know of the Namazu."},{"name":"MAGNAI","text":"Indeed. Though at first I found your disfigured forms distasteful, I will allow that you too serve a purpose─not unlike the dzo─as do all the blessings of the Steppe."},{"name":"MAGNAI","text":"One might be tempted to declare you superior to the Matanga, who lack your loquaciousness. Hm. Yes, I grant you leave to swear fealty to us as a tribe of the Steppe."},{"name":"GYOSHIN","text":"...Well, the rest of these persimmons are not getting any fresher! We must hurry to see the Mol. Make haste, yes, yes. See you around!"},{"name":"GYOSHIN","text":"(Psst, <span class=\"highlight\">Forename</span>! She is still staring. Most raptly. Unceasingly. What do I do?)"},{"name":"MAGNAI","text":"Lest you think I condone your behavior, know that I do not. For a khagan to cavort with Namazu bespeaks questionable judgment."},{"name":"CIRINA","text":"&lt;slurp&gt; ...Oh! Pardon me. I didn't see you there, <span class=\"highlight\">Forename</span>."},{"name":"GYOSHIN","text":"We have come bearing persimmons to thank you for your assistance! We could not have held our festival without the grounds you gave to us. No, no. And your insight into horse-racing was most appreciated."},{"name":"CIRINA","text":"My, how thoughtful!"},{"name":"CIRINA","text":"Dhoro Iloh seems so lively now─the festival must be going well. The children here do so wish to attend."},{"name":"GYOSHIN","text":"They are most welcome! The Mol are free to attend any time, any time at all over the next seven years! We will be there."},{"name":"CIRINA","text":"I look forward to it. And I'm sure the children will be delighted."},{"name":"CIRINA","text":"I admit I thought it strange, that the udgan should speak of a person resembling a catfish. But I am happy to have met someone so delici─deft of hand."},{"name":"GYOSHIN","text":"I am unsure whether you like me for my skill or for my flavor, yes, yes, but I thank you nonetheless! I hope to see you at Dhoro Iloh someday."},{"name":"GYOREI","text":"I have everything under control. Only intentional incineration here. Yes, yes."},{"name":"CIRINA","text":"These persimmons certainly are on the ripe side! I will make sure to serve them without delay."},{"name":"GYOSHIN","text":"I would like to speak to everyone. Together! Please wait just one moment."},{"name":"GYOSHIN","text":"Behold! Our majestic creation! So, um... Do you think it is impressive enough? Sufficiently inspiring of awe?"},{"name":"GYOREI","text":"I find it curiously comforting. Yes, yes."},{"name":"KOFUINSEIGETSU","text":"But of course! What could possibly express the spirit of enlightenment more effectively than an imposing sculpture?"},{"name":"GYOSHIN","text":"<span class=\"highlight\">Forename</span>, do you think our festival has been...meaningful? Worthwhile? Will we be saved from our terrible fate?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The kami only know..."},{"name":"A1","text":"Of course it was worthwhile!"},{"name":"GYOSHIN","text":"That is what I was worried about. What I feared."},{"name":"GYOSHIN","text":"But I do not believe it matters. No, no. This festival brought us together. And together we made so many, many things."},{"name":"GYOSHIN","text":"You really think so? Yes, yes?"},{"name":"GYOSHIN","text":"Even had it not, I would not regret it. No, no. This festival brought us together. And together we made so many, many things."},{"name":"GYOSHIN","text":"Meaningful. Worthwhile. Valuable. Weighty words, yes, yes."},{"name":"GYOSHIN","text":"But I think that what we do is what defines us. Crafting because we want to craft. Gathering because we want to gather. Even when no one sees its meaning, its worth, its value, we simply...<span class=\"emphasis\">do</span>. That is what makes a disciple of creation."},{"name":"KOFUINSEIGETSU","text":"Well said, Gyoshin! In fact, the same is recorded in <span class=\"emphasis\">A Meditation on the Metaphysics of Merrymaking</span>. “In following our hearts we find a freedom, a peace, truer than any other─our own”!"},{"name":"GYOREI","text":"...Gyofu─&lt;sigh&gt;─Seigetsu the Enlightened, is this really the time for citations?"},{"name":"KOFUINSEIGETSU","text":"I hope you do not imply I am being pretentious! Nothing could be further from the truth. I was bolstering Gyoshin's confidence by mentioning that I made the same observation in my debut publication: <span class=\"emphasis\">A Meditation on the Metaphysics of Merrymaking</span>. I, too, am following my heart!"},{"name":"GYOSHIN","text":"That is amazing, Seigetsu the Enlightened! I hope your heart leads you to summarize. To write succinctly."},{"name":"GYOSHIN","text":"Oh! I nearly forgot for the fifth time. I have something for you."},{"name":"GYOSHIN","text":"This is a deeply significant, most meaningful bell. I made it for you! With my own two fins. I am most grateful to everyone, but I am <span class=\"emphasis\">most</span> most grateful to you, <span class=\"highlight\">Forename</span>."},{"name":"GYOSHIN","text":"Our festival would not be the same without you. No, no."},{"name":"GYOSHIN","text":"(-All Three Namazu-)Thank you, thank you!"},{"name":"GYOSHIN","text":"It seems we will be well occupied for the next seven years. Yes, yes!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Bloodsworn</span> reputation with the Namazu."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon completion of the Namazu tribal daily quests."}],"reward":{"gil":810,"items":[{"id":23360},{"num":2,"id":18023,"one":1},{"num":2,"id":18026,"one":1},{"num":2,"id":18027,"one":1}]},"reqs":{"beastrank":7,"jobs":[{"lvl":60,"id":35}],"quests":[68637]}},"partials":[{"type":"npc","id":"1025601","obj":{"i":1025601,"n":"Gyoshin","l":2411,"q":5}},{"type":"npc","id":"1025844","obj":{"i":1025844,"n":"Gyoshin","l":2411,"q":1}},{"type":"item","id":"23360","obj":{"i":23360,"n":"Namazu Bell","l":1,"c":54990,"t":40,"p":71}},{"type":"item","id":"18023","obj":{"i":18023,"n":"Gatherer's Guile Materia VI","l":290,"c":20266,"t":58,"materia":{"tier":5,"value":15,"attr":"Perception","category":2}}},{"type":"item","id":"18026","obj":{"i":18026,"n":"Craftsman's Cunning Materia VI","l":290,"c":20270,"t":58,"materia":{"tier":5,"value":8,"attr":"CP","category":1}}},{"type":"item","id":"18027","obj":{"i":18027,"n":"Craftsman's Command Materia VI","l":290,"c":20270,"t":58,"materia":{"tier":5,"value":10,"attr":"Control","category":1}}},{"type":"quest","id":"68637","obj":{"i":68637,"n":"Into the Fire","g":54,"l":"The Azim Steppe","s":6,"f":1}}]}