{"quest":{"name":"One Size Fits All","location":"The Azim Steppe","id":68633,"patch":4.3,"sort":2,"icon":100771,"beast":11,"unlocksFunction":1,"eventIcon":71341,"issuer":1025700,"target":1025699,"genre":54,"usedItems":[22694],"journal":["Seigetsu the Enlightened is determined to set to work─or at least to set to setting others to work─immediately.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Seigetsu the Enlightened insists that proper festival attire is of the utmost importance. Thankfully, Gyorei's sewing skills will suffice for the design he has in mind─so long as you are up to the task of providing some pieces.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","With your help, Gyorei creates surprisingly flattering Namazu-sized happi. Meanwhile, an enthusiastic Gyoshin has restored two pavilions in record time, which should serve to house the Namazu newly come to join in the festivities. Promising though all this is, your continued assistance will doubtless be necessary to reach Gyoshin's goal of attracting seven hundred seventy-seven participants─and saving the Namazu people from a fiery, watery, or otherwise unpleasant doom."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Gyorei</span><span class=\"alternative\">Mine [Error] in western Ceol Aen</span><span class=\"alternative\">Gather [Error] in western Ceol Aen</span><span class=\"alternative\">Catch [Error] in the upper Yat Khaal</span></span>."],"dialogue":[{"name":"GYOREI","text":"A river flows below the cliffs, so at least we need not worry for want of water."},{"name":"GYOSHIN","text":"There is much to be done, yes, yes. Fortunately, I brought along my lucky hammer, lucky saw, lucky needle, lucky headknife, lucky anvil..."},{"name":"KOFUINSEIGETSU","text":"I worry not for the grounds. Gyoshin lacks many things, but zeal is not among them. Attire, however..."},{"name":"GYOSHIN","text":"...Are you implying something about my fashion sense?"},{"name":"KOFUINSEIGETSU","text":"Oh, to be so ignorant! What you fail to realize is that festivals are not mere entertainment, but rather divine rituals. It is simply unacceptable to wear one's usual apron, couture notwithstanding."},{"name":"KOFUINSEIGETSU","text":"According to Hibarisai's <span class=\"emphasis\">An Account of Myself</span>, the people of Hingashi traditionally don <span class=\"emphasis\">happi</span>, colorful vestments resembling coats, on such occasions."},{"name":"KOFUINSEIGETSU","text":"I can produce an illustration based on what I have gleaned from my readings. However, creating the happi themselves is quite another matter. Alas, where my intellect excels, my dexterity leaves something to be desired."},{"name":"GYOREI","text":"How fortunate that I am a dab fin at sewing, then. Yes, yes. I can make your design a reality."},{"name":"GYOREI","text":"But considering the volume of detail work required, another pair of fins would be ideal. Can I count on your assistance, <span class=\"highlight\">Forename</span>?"},{"name":"GYOREI","text":"Thank you, thank you! Gyofu─er, Seigetsu the Enlightened, can you decide what to delegate?"},{"name":"KOFUINSEIGETSU","text":"But of course! My prodigious analytical capabilities have made it clear to me that it would be most efficient for <span class=\"highlight\">Forename</span> to provide components for Gyorei's use. Metal adornments, to be precise. You will find the necessary materials in the crate."},{"name":"KOFUINSEIGETSU","text":"But of course! My prodigious analytical capabilities have made it clear to me that it would be most efficient for <span class=\"highlight\">Forename</span> to provide components for Gyorei's use. Durable linings, to be precise. You will find the necessary materials in the crate."},{"name":"KOFUINSEIGETSU","text":"But of course! My prodigious analytical capabilities have made it clear to me that it would be most efficient for <span class=\"highlight\">Forename</span> to provide components for Gyorei's use. Dye for the finished jackets, to be precise. You will find the necessary materials in the crate."},{"name":"KOFUINSEIGETSU","text":"But of course! My prodigious analytical capabilities have made it clear to me that it would be most efficient for <span class=\"highlight\">Forename</span> to procure red malachite as pigment for our happi dye. Texts indicate that it may be found in western Ceol Aen."},{"name":"KOFUINSEIGETSU","text":"But of course! My prodigious analytical capabilities have made it clear to me that it would be most efficient for <span class=\"highlight\">Forename</span> to procure Azim strawberries as pigment for our happi dye. Texts indicate that they are found in western Ceol Aen."},{"name":"KOFUINSEIGETSU","text":"But of course! My prodigious analytical capabilities have made it clear to me that it would be most efficient for <span class=\"highlight\">Forename</span> to procure a sunshell as pigment for our happi dye. Texts indicate that they are found in the upper Yat Khaal, and respond well when baited with salmon roe."},{"name":"KOFUINSEIGETSU","text":"Rest assured that you may devote your full attention to this assignment. Simply deliver what I requested of you to Gyorei, and we will handle the rest."},{"name":"KOFUINSEIGETSU","text":"Do you find yourself bereft of materials? Fret not! I, in my wisdom, anticipated this eventuality. You will find all that you require in the crate."},{"name":"KOFUINSEIGETSU","text":"Do you find yourself bereft of materials? Fret not! I, in my wisdom, anticipated this eventuality. You will find all that you require in the crate."},{"name":"KOFUINSEIGETSU","text":"Do you find yourself bereft of materials? Fret not! I, in my wisdom, anticipated this eventuality. You will find all that you require in the crate."},{"name":"KOFUINSEIGETSU","text":"Simply deliver what I requested of you to Gyorei. We will see to the remaining tasks."},{"name":"KOFUINSEIGETSU","text":"Simply deliver what I requested of you to Gyorei. We will see to the remaining tasks."},{"name":"KOFUINSEIGETSU","text":"Simply deliver what I requested of you to Gyorei. We will see to the remaining tasks."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"KOFUINSEIGETSU","text":"Any deliverables should be provided to Gyorei. Your prompt attention to this matter is appreciated."},{"name":"GYOSHIN","text":"I shall have the grounds ready in no time, no time at all!"},{"name":"GYOREI","text":"You have what we need? I thought you might still be stuck in unwilling conversation with Seigetsu the Enlightened."},{"name":"GYOREI","text":"Gyoshin has made significant progress as well─and with nary a gaping wound to show for it!"},{"name":"GYOREI","text":"I expect that everything will be ready shortly, yes, yes, so please take this opportunity to rest."},{"name":"SYSTEM","text":"You and Gyorei have made happi fit for a festival."},{"name":"SYSTEM","text":"Gyoshin has made progress in repairing the pavilions."},{"name":"GYOSHIN","text":"These pavilions should be suitable housing for our large cohort of volunteers. Yes, yes. According to my vision, we must aim to attract seven hundred and seventy-seven participants to avert complete and total annihilation─which means we have only seven hundred and seventy or so to go!"},{"name":"GYOSHIN","text":"With these festive happi, I am sure we will recruit the rest in no time. Please, please continue to lend us a fin in the coming days!"},{"name":"SYSTEM","text":"Only seven years remain until the Namazu are forever wiped from the face of Hydaelyn..."},{"name":"SYSTEM","text":"But today, their ambitious plans to defy this fate are in motion. What will become of them?"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Friendly</span> reputation with the Seven Hundred Seventy-Seven."},{"name":"SYSTEM","text":"Namazu tribal quests are now available from Seigetsu the Enlightened at Dhoro Iloh."},{"name":"SYSTEM","text":"Furthermore, you may now purchase wares from Gyosho."}],"reward":{"gil":648,"items":[{"num":3,"id":5688,"one":1},{"num":3,"id":5698,"one":1},{"num":3,"id":5703,"one":1}]},"reqs":{"jobs":[{"lvl":60,"id":35}],"quests":[68632]},"next":[68634]},"partials":[{"type":"npc","id":"1025700","obj":{"i":1025700,"n":"Seigetsu The Enlightened","l":2411,"q":1}},{"type":"npc","id":"1025699","obj":{"i":1025699,"n":"Gyorei","l":2411,"q":1}},{"type":"item","id":"5688","obj":{"i":5688,"n":"Gatherer's Guerdon Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Gathering","category":2}}},{"type":"item","id":"5698","obj":{"i":5698,"n":"Gatherer's Grasp Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":6,"attr":"GP","category":2}}},{"type":"item","id":"5703","obj":{"i":5703,"n":"Craftsman's Competence Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":11,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"22694","obj":{"i":22694,"n":"Happi Component Materials","l":145,"c":26001,"t":61}},{"type":"quest","id":"68632","obj":{"i":68632,"n":"Something Fishy This Way Comes","g":54,"l":"The Azim Steppe","s":1,"f":1}},{"type":"quest","id":"68634","obj":{"i":68634,"n":"Big, Big Fish","g":54,"l":"The Azim Steppe","s":3,"f":1}}]}