{"quest":{"name":"Big, Big Fish","location":"The Azim Steppe","id":68634,"patch":4.3,"sort":3,"icon":100772,"beast":11,"unlocksFunction":1,"eventIcon":71341,"issuer":1025601,"target":1025704,"genre":54,"usedItems":[22695],"journal":["Gyoshin is eager to speak with you.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Gyoshin tasks you with handing out happi to potential festival participants, which in his mind includes any Namazu with time to spare. You make for Yuzuka Manor, where you will try to suss out which residents are bored and which simply suffer from resting fish face.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You distribute happi to several Namazu in exchange for enthusiastic promises of festival participation. Some of your recruits are a bit...irregular, but considering the quantity of participants required, you are in no position to discriminate based on quality.","Upon your return, Gyoshin gives an excited speech as a prelude to festival commencement, only to be reminded midway that he neglected to consider how to conduct the festival itself. Seigetsu the Enlightened helpfully─and at length─proposes giving an offering to the Namazu's ancestor, the Big One. This will require not only an offering from the river, but a ceremonial altar as well, for which Gyoshin is sure to have an ambitious design in mind.","Gyoshin asks you to contribute to the stock of components he will use to put together the altar and offering. Said stock will be collected and maintained by Gyorei, probably for safety reasons.","With your assistance, both altar and offering are prepared. The festival begins at last, and with it, a change in the Namazu's fortunes...or so they hope."],"objectives":["Give festive happi to potential participants.","Report to Gyoshin.","Speak with Gyoshin.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Gyorei</span><span class=\"alternative\">Mine [Error] south of Chakha Zoh</span><span class=\"alternative\">Gather [Error] south of Chakha Zoh</span><span class=\"alternative\">Catch [Error] at Dotharl Khaa</span></span>."],"dialogue":[{"name":"GYOSHIN","text":"Festival preparations are nearly complete, yes, yes."},{"name":"GYOSHIN","text":"Our task is now to find enthusiastic participants. So long as we have at least seven hundred and seventy-seven, our survival is assured! With our current number, we require only seven hundred and sixty-eight more."},{"name":"GYOSHIN","text":"...Hm? You have a foreboding feeling? How curious! But never mind that. I require your help in recruiting volunteers, yes, yes."},{"name":"GYOSHIN","text":"It had slipped my mind until this moment, but I remember now that you are rather well known amongst the Namazu. Quite famous!"},{"name":"GYOSHIN","text":"You fixed Gyorin's finances, along with...other feats that I need not recall just now. The important part is that you are respected, and therefore can recruit many, many Namazu."},{"name":"GYOSHIN","text":"It will not take much time at all, no, no. Simply trek back to Yuzuka Manor, seek out Namazu that have no pressing duties, approach each and every one, and provide them with happi while explaining what participation in the festival entails."},{"name":"GYOSHIN","text":"We will continue preparations here in the meantime. Yes, yes. See you shortly, I am sure!"},{"name":"GYOSHIN","text":"Let me see... We require seven hundred seventy-seven happi...and we have twelve, so that means... Hm, do you think we need more fabric?"},{"name":"GYORIN","text":"Why, <span class=\"highlight\">Forename</span>! Fancy seeing you here! Have you come to look upon my fabulous apron?"},{"name":"GYORIN","text":"Oh, how gorgeous, how stunning! I can wear this happi, you say? And it will be my very own? Then yes, yes, I certainly will participate in this festival of yours."},{"name":"GYORIN","text":"With so many attendees, there are bound to be business opportunities as well. Yes, yes. I may just bring some of my wares with me. Somehow I still have quite a few persimmons in stock..."},{"name":"GYORIN","text":"I will pack my surplus of persimmons and meet you there, yes, yes!"},{"name":"DRUNKNAMAZU","text":"Tea for breakfast～♪<br>Tea for lunch～♪<br>Tea at...&lt;hic&gt;...other times～♪<br>...Who are you and─&lt;hic&gt;─why are you so blurry?"},{"name":"DRUNKNAMAZU","text":"Wear this for a fes-tea-val? Yes─&lt;hic&gt;─yes! Lead the way!"},{"name":"LEISUREDNAMAZU","text":"Breathe in, breathe out... Breathe in, breathe out... Breathe in, breathe out... Good heavens, my life is dull. Maybe I will sleep, yes, yes, perchance to dream..."},{"name":"LEISUREDNAMAZU","text":"...You want to speak to <span class=\"emphasis\">me</span>? You must be mistaken."},{"name":"LEISUREDNAMAZU","text":"You are really, truly inviting me to a festival? Finally, a reason to live! I will don this happi forthwith and join you at the Azim Steppe."},{"name":"LEISUREDNAMAZU","text":"O glorious day! Glad am I that I kept breathing, yes, yes."},{"name":"GYOSHIN","text":"Ah, there you are, <span class=\"highlight\">Forename</span>! Our preparations have gone swimmingly, yes, yes. I was on the point of calling everyone to a meeting. Just a moment, please!"},{"name":"GYOSHIN","text":"I would like to express my sincere gratitude. My heartfelt appreciation. Without you, I could never have come this far. No, no."},{"name":"GYOSHIN","text":"It is only because you were willing to follow me, to travel here to the Azim Steppe, that we are here today. Because you were willing to join fins─er, hands─that we can now complete this project together."},{"name":"GYOSHIN","text":"Before the participants arrive, I just wanted to tell you, to let you know, how much I appreciate you. Please, join us in celebration. Our efforts have borne fruit, and the fated festival is here at last!"},{"name":"KOFUINSEIGETSU","text":"So...if I may inquire, what manner of activities does said festival entail?"},{"name":"GYOSHIN","text":"..."},{"name":"GYOSHIN","text":"What...manner of activities indeed. Yes...yes..."},{"name":"GYOREI","text":"What of your vision? Did our greatest grandsire say nothing of what sort of festival we are meant to be having?"},{"name":"GYOSHIN","text":"Now that you mention it, I cannot say he did. No, no. I suppose I have been so focused on preparing the festival site that I completely, utterly forgot to think ahead. Oh dear!"},{"name":"KOFUINSEIGETSU","text":"How irresponsible... However, I anticipated that it might come to this, so I made an effort to peruse writings relevant to our purpose."},{"name":"GYOSHIN","text":"Wonderful! Excellent work, Gyofu─I mean, Seigetsu the Enlightened. Yes, yes."},{"name":"KOFUINSEIGETSU","text":"Yes, well. The nature of our forebears' festivities, per my research, is, to put it concisely..."},{"name":"KOFUINSEIGETSU","text":"...utterly unclear."},{"name":"KOFUINSEIGETSU","text":"Alas, the Namazu of eld had no system of writing, and no secondary sources detailing their festival appear to have survived the passage of the centuries."},{"name":"GYOSHIN","text":"That is the least informative information you could have possibly provided, Gyofun!"},{"name":"KOFUINSEIGETSU","text":"Why you, you...you have no right to talk! Ahem. Though it is true that I was unable to learn anything regarding our people's particular traditions, my research was hardly for naught."},{"name":"KOFUINSEIGETSU","text":"A seminal publication in the field of cultural anthropology, <span class=\"emphasis\">The Chrysanthemum and the Dango</span>, states that festivals involve performative prayer and expressions of gratitude, and are intended to celebrate a given culture's gods or ancestors."},{"name":"KOFUINSEIGETSU","text":"Thus, we may assume that our forebears' festival would have celebrated our worthiest of ancestors, the Big One."},{"name":"GYOSHIN","text":"...I still have no idea what we are meant to do! No, no. Could you get to the point before we shrivel up and die?"},{"name":"KOFUINSEIGETSU","text":"I will enlighten you if you cease your constant interruptions! Now, as I was saying, there are myriad festivals across Othard, but at the most fundamental level, all revolve around ceremonial offerings."},{"name":"KOFUINSEIGETSU","text":"Considering the primitive Namazu's lifestyle, there is a high probability the offering would have consisted of something found in the river or thereabouts. Do you follow?"},{"name":"GYOSHIN","text":"We need a...fish? For an offering. And...I hope nothing else you said was important."},{"name":"GYOSHIN","text":"<span class=\"highlight\">Forename</span>, Gyorei, your help in this will be most important. Quite essential. Follow me over there, yes, yes, before Gyofun starts talking again."},{"name":"GYOREI","text":"Despite their many, many differences, Gyoshin trusts in Gyofun's knowledge."},{"name":"GYOSHIN","text":"We can use this space to build an altar for our offering. Yes, yes. All of this derelict masonry is ripe for the remodeling."},{"name":"GYOSHIN","text":"So I need you to make some sturdy altar pieces, and fast. Like the wind! The materials are in the crate by the pavilion. You can take more as needed, yes, yes. "},{"name":"GYOSHIN","text":"So I need you to make some exquisite, lovingly detailed altar pieces. The materials are in the crate by the pavilion. You can take more as needed, yes, yes."},{"name":"GYOSHIN","text":"So I need you to make some extremely flammable, alarmingly combustible components for the altar's bonfire. The materials are in the crate by the pavilion. You can take more as needed, yes, yes."},{"name":"GYOSHIN","text":"So I need you to collect skystones for the altar's base. You will find them south of Chakha Zoh, yes, yes."},{"name":"GYOSHIN","text":"In the meantime, I need you to collect scarlet flax for the decorative draperies. You will find it south of Chakha Zoh, yes, yes."},{"name":"GYOSHIN","text":"In the meantime, I need you to collect the offering itself. One steppe barramundi, please! You can find them at Dotharl Khaa if you are willing to part with a bit of salmon roe, yes, yes."},{"name":"GYOSHIN","text":"Time to put our whiskers to the grindstone! Turn what you have over to Gyorei when finished, please. She is most insistent on keeping anything heavy, flammable, or easily broken away from me, for some reason."},{"name":"GYOSHIN","text":"Have you run out of materials? Never fear, the crate is here! ...Well, it is actually over there. But it is full of stuff, yes, yes."},{"name":"GYOSHIN","text":"Have you run out of materials? Never fear, the crate is here! ...Well, it is actually over there. But it is full of stuff, yes, yes."},{"name":"GYOSHIN","text":"Have you run out of materials? Never fear, the crate is here! ...Well, it is actually over there. But it is full of stuff, yes, yes."},{"name":"GYOSHIN","text":"Turn what you have over to Gyorei when finished. I will be working here in the meantime. All the while!"},{"name":"GYOSHIN","text":"Turn what you have over to Gyorei when finished. I will be working here in the meantime. All the while!"},{"name":"GYOSHIN","text":"Turn what you have over to Gyorei when finished. I will be working here in the meantime. All the while!"},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"GYOSHIN","text":"Ready already? Then please give what you have to Gyorei for safekeeping."},{"name":"GYOREI","text":"You have the goods, yes, yes? No, no, the <span class=\"emphasis\">other</span> goods. The ones Gyoshin asked for."},{"name":"GYOREI","text":"Thank you, thank you! Gyoshin seems to be progressing quite quickly as well. The altar will be complete any moment now, and then we can begin the festival proper."},{"name":"SYSTEM","text":"Working side by side with the Namazu, you have completed the altar. Festivities in honor of the Big One have begun!"},{"name":"SYSTEM","text":"In seven years, the One River was fated to experience a fish famine, depriving the Namazu of their primary food source. Many would have died."},{"name":"SYSTEM","text":"However, continuous fishing of large predatory fish for use as offerings over the course of seven years will allow smaller fish to flourish, creating a healthy ecosystem and ensuring bountiful catches for the foreseeable future."},{"name":"SYSTEM","text":"Unbeknownst to all, the Namazu will be spared the grievous tragedy that could have consumed them, and their fate continues to change for the better."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with the Seven Hundred Seventy-Seven."},{"name":"SYSTEM","text":"New Namazu tribal daily quests are now available from Seigetsu the Enlightened at Dhoro Iloh."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Seigetsu the Enlightened as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Seigetsu the Enlightened. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Gyosho."}],"reward":{"gil":1318,"items":[{"num":3,"id":5693,"one":1},{"num":3,"id":5708,"one":1},{"num":3,"id":5713,"one":1}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":35}],"quests":[68633]},"next":[68635]},"partials":[{"type":"npc","id":"1025601","obj":{"i":1025601,"n":"Gyoshin","l":2411,"q":5}},{"type":"npc","id":"1025704","obj":{"i":1025704,"n":"Gyorei","l":2411,"q":1}},{"type":"item","id":"5693","obj":{"i":5693,"n":"Gatherer's Guile Materia V","l":160,"c":20255,"t":58,"materia":{"tier":4,"value":10,"attr":"Perception","category":2}}},{"type":"item","id":"5708","obj":{"i":5708,"n":"Craftsman's Cunning Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":6,"attr":"CP","category":1}}},{"type":"item","id":"5713","obj":{"i":5713,"n":"Craftsman's Command Materia V","l":160,"c":20253,"t":58,"materia":{"tier":4,"value":7,"attr":"Control","category":1}}},{"type":"item","id":"22695","obj":{"i":22695,"n":"Altar Component Materials","l":148,"c":26001,"t":61}},{"type":"quest","id":"68633","obj":{"i":68633,"n":"One Size Fits All","g":54,"l":"The Azim Steppe","s":2,"f":1}},{"type":"quest","id":"68635","obj":{"i":68635,"n":"Waiting for Gyodo","g":54,"l":"The Azim Steppe","s":4,"f":1}}]}