{"quest":{"name":"The Blade Mislaid","location":"Kugane","id":68631,"patch":4.35,"sort":50,"icon":100785,"unlocksFunction":1,"eventIcon":71341,"issuer":1025893,"target":1025912,"genre":70,"journal":["Shigure is determined to put matters to rights.","In the chaos and confusion of the theft, Shigure seized a blade from the Wolf Burglar, thinking it to be the Soboro Sukehiro. Alas, it was actually a common dagger─old and worn and of Doman make. Yet therein may lie a clue as to the whereabouts of the thief, Shigure believes...","Having arrived in Yanxia, Shigure is momentarily at a loss as to how to proceed. Fortunately, your new comrade, Yojimbo, has brought with him Daigoro─loyal companion and good dog. After sniffing the Wolf Burglar's dagger, Daigoro woofs and bounds off towards Monzen, leaving the rest of you to follow.","Once more you find yourselves at an impasse, as Daigoro is unable to continue his pursuit, his senses having become overwhelmed by the stench of a nearby Namazu. Nevertheless, he has led you this far, and your companions remain confident that they may find the Wolf Burglar or some trace of his passing nearby.","In searching the ruins you come upon a Namazu in his death throes, who abruptly leaps to his feet and explains he is merely suffering from the world's worst hangover. A cursory questioning reveals that he may have seen the Wolf Burglar while he was deep in his teacups─a fact you share with Shigure and Hildibrand as they appear moments later. Due to the circumstances, the Namazu is reluctant to trust his memories to steer you the right way─his barbels, on the other hand, ought to do the trick. Curiously (but not altogether surprisingly), he directs you to proceed in the direction directly opposite the one indicated by Hildibrand's keen inspector's sense, leaving you no choice but to divide your efforts yet again.","Among a pile of irrelevant potsherds you find what appears to be a pair of plot-relevant gloves. Odd, considering that you cannot recall if the Wolf Burglar ever wore them. But just go with it.","Yojimbo too cannot recall the Wolf Burglar wearing gloves, but states that, for lack of any other possible lead, you should let Daigoro try following the owner's scent since, for a mercy, the fragrant Namazu befuddling the dog's senses has exited stage left.","Sure enough, Daigoro has no trouble tracking the scent, leading you and the others to the Wolf Burglar, whom you spy from a distance. Well aware of the thief's rather vexing propensity for running away, you let the dog take the lead, only to learn that all it takes to distract Daigoro is a shiny gold koban hurled with sufficient force. For the umpteenth time, the Wolf Burglar seems poised to get away...until Hildibrand, with all his grace and beauty, unintentionally fells the thief's means of escape, allowing Shigure to tackle him and finally bring the chase to an end. Afterwards, Yojimbo verifies the Soboro Sukehiro's authenticity, and generously offers to take it back to Master Akebono, allowing you and the others to deliver the Wolf Burglar into the custody of the Sekiseigumi.","As the Wolf Burglar is carted off by the Sekiseigumi, you hear him muttering about the “true villain in your midst.”  Before you can think on these words, Master Akebono arrives, eager to receive the sword...which it seems was stolen by Yojimbo in yet another twist you really ought to have seen coming. Before storming off, a furious Akebono swears to Shigure that, should the ronin fail to recover the sword, he will ensure that his dreams go unfulfilled. Shortly thereafter, however, a certain Sekiseigumi takes no small joy in granting Shigure that which he has dreamed of for so long: a place among the protectors of Kugane. His first assignment: to track down Yojimbo and reclaim the Soboro Sukehiro. As a new recruit, Shigure has little to no resources, and must continue to rely upon you, Hildibrand, and Nashu for assistance. For their part, the inspector and his assistant are more than happy to oblige.","The path that led him to this point may have been most strange and circuitous, but Shigure is nevertheless glad to have walked it. Though he laments the loss of his hair, he holds out hope that the tonic Nashu promised to procure for him will restore it. Of course, he also hopes to bring Yojimbo to justice and secure the Soboro Sukehiro, if only to wash his hands of Master Akebono..."],"objectives":["Search for the Wolf Burglar in Yanxia.","Follow Daigoro.","Search Monzen for the Wolf Burglar.","Speak with Yojimbo.","Show the plot-relevant gloves to Daigoro.","Return to Kugane with the Wolf Burglar.","Speak with Shigure."],"dialogue":[{"name":"HILDIBRAND","text":"That may well have been my best disguise yet!"},{"name":"NASHUMHAKARACCA","text":"It's not easy being a geiko!"},{"name":"YOJIMBO","text":"You heard him. We must recover the Soboro Sukehiro."},{"name":"YOJIMBO","text":"Hmm? Have we met somewhere before? Of course not. Don't be silly."},{"name":"SHIGURE","text":"I believe the Wolf Burglar has fled to Yanxia."},{"name":"SHIGURE","text":"Consider the dagger I took from him in the chaos. Though old and worn, it has been well cared for over the years. It is more than just a tool to him, I think─and it is clearly of Doman design."},{"name":"HILDIBRAND","text":"Wh-What an amazing coincidence! The selfsame details had also caught mine eye. I daresay you have the makings of an inspector, Shigure!"},{"name":"SHIGURE","text":"I shall endeavor to take that as a compliment. To Yanxia!"},{"name":"SHIGURE","text":"Even if he is somewhere here, how are we to narrow our search...?"},{"name":"NASHUMHAKARACCA","text":"Look at all those crystals! So shiny!"},{"name":"YOJIMBO","text":"You needn't ware Daigoro's fangs. He is a good dog."},{"name":"DAIGORO","text":"Woof!"},{"name":"HILDIBRAND","text":"My word, have you ever seen anything so full of splendor!? But forgive me─we must not lose sight of the matter at hand. How shall we pursue our quarry?"},{"name":"SHIGURE","text":"That is...a very good question. To which I currently have no answer."},{"name":"YOJIMBO","text":"I do."},{"name":"DAIGORO","text":"Woof, woof!"},{"name":"NASHUMHAKARACCA","text":"What a nice little doggy!"},{"name":"YOJIMBO","text":"Daigoro is more than a mere traveling companion. His sense of smell is unparalleled. Give over the burglar's dagger that he may track his scent."},{"name":"HILDIBRAND","text":"Brilliant idea, Jim!"},{"name":"SHIGURE","text":"Yes, indeed. Here, take it..."},{"name":"DAIGORO","text":"&lt;sniff&gt; &lt;sniff&gt; ...Woof! Woof, woof!"},{"name":"HILDIBRAND","text":"Oho, he has the scent already! With me, Nashu!"},{"name":"SHIGURE","text":"Perhaps fate is conspiring to see us succeed after all!"},{"name":"SHIGURE","text":"Daigoro seems to be confused. Has he lost the scent?"},{"name":"NASHUMHAKARACCA","text":"Is the doggy all right?"},{"name":"YOJIMBO","text":"(...Jim? Jim!?)"},{"name":"DAIGORO","text":"&lt;whimper&gt;"},{"name":"HILDIBRAND","text":"What ails little Daigoro? Why will he go no further?"},{"name":"YOJIMBO","text":"How is it you remember <span class=\"emphasis\">his</span>─ Ahem. 'Tis like there are Namazu about. Their stink befuddles his senses."},{"name":"SHIGURE","text":"Though unfortunate, we know the Wolf Burglar came this way. Perhaps, if we search, we can find some other clue as to his whereabouts."},{"name":"HILDIBRAND","text":"Leave it to me, Shigure! If there are clues to be found in these ruins, my keen inspector's sense shall lead me to them!"},{"name":"NASHUMHAKARACCA","text":"Wait for me, Inspector! Wait for me!"},{"name":"SHIGURE","text":"Gah! There they go again, charging off before we have a chance to discuss our plan of action! Must they always be so reckless?"},{"name":"SHIGURE","text":"Nothing for it but to follow suit, I suppose. Why don't you search the area to the northwest, <span class=\"highlight\">Forename</span>?"},{"name":"YOJIMBO","text":"Hm? What are you staring at? Should you not be searching for clues elsewhere?"},{"name":"DAIGORO","text":"&lt;whimper&gt;"},{"name":"HILDINAMAZUO03095","text":"&lt;hic&gt;"},{"name":"HILDINAMAZUO03095","text":"Alive, I am! Hale and healthy, yes, yes! Nursing a rather vicious hangover from a surfeit of tea, but otherwise none the worse for wear!"},{"name":"HILDINAMAZUO03095","text":"A thousand thanks to you for waking me before I was set upon by ravenous beasts or thieving bandits! Unless...you wouldn't happen to be a thieving bandit, would you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That depends... Have you got a certain priceless sword on you?"},{"name":"A1","text":"No, but I'm hunting a thieving bandit. A Lupin."},{"name":"HILDINAMAZUO03095","text":"Y-You may be assured I have nothing of value whatsoever, yes, yes! However, I have some vague recollection of a traveler with an unusual sword across his back. I was deep in my teacups at the time, but I know what I saw!"},{"name":"HILDINAMAZUO03095","text":"A Lupin? Hmm... Now that you mention it, I have some vague recollection of a traveler with an unusual sword across his back. I was deep in my teacups at the time, but I know what I saw!"},{"name":"SHIGURE","text":"Huh? A drunken Namazu? What is his part in all this?"},{"name":"SHIGURE","text":"He saw the Wolf Burglar! What luck! Which way did he go?"},{"name":"HILDINAMAZUO03095","text":"Hmm... It's all a bit of a blur, so I doubt my memory will be of any use. My barbels, on the other hand, should do the trick..."},{"name":"HILDIBRAND","text":"My adorable little friend, you need not strain yourself on our account! We too have ways of finding the fiend!"},{"name":"HILDINAMAZUO03095","text":"Yes, yes...my keen Namazu sense is telling me..."},{"name":"HILDIBRAND","text":"That the Wolf Burglar..."},{"name":"HILDINAMAZUO03095","text":"Went that way!"},{"name":"HILDIBRAND","text":"Yes, that way!"},{"name":"SHIGURE","text":"Which way!?"},{"name":"SHIGURE","text":"&lt;sigh&gt; We may as well split up again."},{"name":"HILDINAMAZUO03095","text":"I would help you, but...hangover. Yes─&lt;hic&gt;─yes."},{"name":"HILDINAMAZUO03095","text":"Bye-bye, friends! Have fun hunting the Wolf Burglar!"},{"name":"YOJIMBO","text":"Hm? What are you staring at? Should you not be searching for clues elsewhere?"},{"name":"DAIGORO","text":"&lt;whimper&gt;"},{"name":"SYSTEMYOJIMBO","text":"Among the irrelevant potsherds you spy a somewhat conspicuous pair of gloves. If they belonged to the Wolf Burglar, perhaps they may prove useful..."},{"name":"YOJIMBO","text":"Found something, have you?"},{"name":"YOJIMBO","text":"I do not recall him wearing gloves...but for lack of other possible leads, I say let Daigoro follow this fresh scent."},{"name":"YOJIMBO","text":"Now that the Namazu is gone, he should have no difficulty finding the owner."},{"name":"YOJIMBO","text":"Let Daigoro sniff the gloves that he may track the owner's scent."},{"name":"DAIGORO","text":"Woof, woof!"},{"name":"DAIGORO","text":"&lt;sniff&gt; &lt;sniff&gt; ...Woof! Woof, woof!"},{"name":"HILDIBRAND","text":"What news, Jim? We came as soon as we heard the barking!"},{"name":"YOJIMBO","text":"...Now that the Namazu has departed, Daigoro is capable of pursuing our quarry once more. Your stalwart comrade found gloves that may have belonged to him, and so we were about to see where they led us."},{"name":"DAIGORO","text":"Woof, woof!"},{"name":"SHIGURE","text":"He's got the scent!"},{"name":"HILDIBRAND","text":"Quickly, <span class=\"highlight\">Forename</span>! We must not lose sight of Daigoro!"},{"name":"SHIGURE","text":"There he is! We mustn't let him escape this time!"},{"name":"YOJIMBO","text":"Hold, ronin. You know well how quick he can be. Let us leave this pursuit to one he cannot outrun."},{"name":"YOJIMBO","text":"Go, Daigoro! Seize the Lupin!"},{"name":"NASHUMHAKARACCA","text":"Gosh, he's a fast doggy!"},{"name":"YOJIMBO","text":"Aye, there are none faster!"},{"name":"SHIGURE","text":"Come! We must secure the sword and the thief!"},{"name":"NASHUMHAKARACCA","text":"Gosh, he really likes koban, doesn't he?"},{"name":"HILDIBRAND","text":"Well, we all have our weaknesses, I suppose! Still, there is no denying that he is a very, very good dog!"},{"name":"YOJIMBO","text":"How could he possibly have─ Hmph! The nerve!"},{"name":"KUGANEWOLFBURGLAR","text":"You lot really should have thought this through. Or have you already forgotten that I've got friends in high places?"},{"name":"KUGANEWOLFBURGLAR","text":"Montaro! To me!"},{"name":"KUGANEWOLFBURGLAR","text":"By the kami, what have you done to my bird!?"},{"name":"SHIGURE","text":"Got you!"},{"name":"HILDIBRAND","text":"Rejoice, Shigure! For I, Hildibrand, agent of enquiry, inspector extraordinaire, have reclaimed the Soboro Sukehiro!"},{"name":"YOJIMBO","text":"Y-Yes, it seems <span class=\"emphasis\">we</span> have! Though, before we declare it with certainty, I would verify the authenticity of the blade."},{"name":"HILDIBRAND","text":"But of course!"},{"name":"YOJIMBO","text":"Aye, this is no fake. It is indeed a work of art...a masterpiece that could only be the treasured Soboro Sukehiro."},{"name":"YOJIMBO","text":"Ah...I just remembered I have urgent business in Kugane. Which is well, as it shall afford me the opportunity to return the Soboro Sukehiro to its rightful owner. Pray allow me to do so."},{"name":"YOJIMBO","text":"You have my word I shall surrender it to no one."},{"name":"HILDIBRAND","text":"How lucky we are to have a friend like Jim! Steadfast, loyal, honorable─a Manderville man from another mother!"},{"name":"SHIGURE","text":"Let us quit this place and return to Kugane with the Wolf Burglar. I am sure the Sekiseigumi have a cell with his name on it."},{"name":"MIYAMAGI","text":"What business have you with the Sekiseigumi?"},{"name":"MIYAMAGI","text":"The Wolf Burglar? The Lupin who has made mock of me and my brothers!?"},{"name":"SHIGURE","text":"I, Shigure, and my comrades have successfully captured the notorious Wolf Burglar of Kugane, and brought him here that we might surrender him into the custody of the Sekiseigumi."},{"name":"MIYAMAGI","text":"Full glad we are to accept this unexpected bounty! The fiend has been a source of unending consternation for us. My thanks to you all!"},{"name":"MIYAMAGI","text":"Pray bring him inside, honored friends!"},{"name":"KUGANEWOLFBURGLAR","text":"Bloody fools, the lot of you. Blind to the true villain in your midst..."},{"name":"AKEBONO","text":"It is true, then? The Wolf Burglar has been detained? Well done! Who must we thank for this auspicious turn of events?"},{"name":"HILDIBRAND","text":"I, Hildibrand, agent of enquiry, inspector extraordinaire, did bring the Wolf Burglar to heel with my customary style and aplomb!"},{"name":"AKEBONO","text":"Very good, very good! And the Soboro Sukehiro? Where is it?"},{"name":"SHIGURE","text":"You mean...you don't have it? I thought Yojimbo had returned it to you."},{"name":"AKEBONO","text":"Yojimbo? That disrespectful disgrace of a samurai? Nay, I have seen neither hide nor hair of him."},{"name":"HILDIBRAND","text":"I can only presume that Jim is currently enjoying a plate of dango at the Umineko Teahouse before paying Master Akebono a visit."},{"name":"SHIGURE","text":"Or...perhaps he absconded with the Soboro Sukehiro?"},{"name":"AKEBONO","text":"This is...this is all a joke to you people, isn't it..."},{"name":"AKEBONO","text":"Of all the stupid, inexplicable, utterly unjustifiable─ For what reason could you have possibly even for a moment considered it wise to let a single man─and not just any man either! A man I just expelled from my service!"},{"name":"AKEBONO","text":"Mark me, ronin! If you fail to deliver that sword, I shall make it the focus of my remaining years that your dreams go unfulfilled!"},{"name":"DIGNIFIEDSEKISEIGUMI","text":"Huh. We certainly can't have that... Which reminds me. Shigure─you once told me it was your dream to serve alongside us. Is that still the case?"},{"name":"SHIGURE","text":"Y-Yes sir! It is!"},{"name":"DIGNIFIEDSEKISEIGUMI","text":"...Good. Because in light of your recent accomplishment, I would like nothing more than to induct you into the Sekiseigumi. What say you?"},{"name":"SHIGURE","text":"It would be an honor, sir!"},{"name":"DIGNIFIEDSEKISEIGUMI","text":"Glad to hear it. There are, of course, some few procedures and discussions with my superiors that must come first, but we may attend to them now. If your comrades do not mind waiting..."},{"name":"HILDIBRAND","text":"Not at all! We will await your triumphant return, Shigure!"},{"name":"SHIGURE","text":"My friends. It is finished..."},{"name":"NASHUMHAKARACCA","text":"A Shigure reborn!"},{"name":"SHIGURE","text":"Well, I would not dare put it in such grandiose terms, but indeed, I feel as though I am a changed man..."},{"name":"SHIGURE","text":"And it is you three who have changed me for the better. A thousand thanks to you, <span class=\"highlight\">Forename</span>, Inspector Hildibrand, Nashu."},{"name":"SHIGURE","text":"Though I have only just become a Sekiseigumi, I have already been given my first assignment..."},{"name":"SHIGURE","text":"I am to pursue the renegade Yojimbo and recover the Soboro Sukehiro."},{"name":"SHIGURE","text":"Alas, as a new recruit, I have been afforded no additional men or resources to accomplish this task. If I am to succeed, I will need all the help I can get─"},{"name":"HILDIBRAND","text":"Say no more, Shigure! I should be glad to give it!"},{"name":"HILDIBRAND","text":"I, Hildibrand, agent of enquiry, inspector extraordinaire, do hereby re-swear to help you scour all creation─from the deepest pit of the seven hells to the very pinnacle of the heavens─for Jim and the Soboro Sukehiro!"},{"name":"HILDIBRAND","text":"And so our hunt begins again!"},{"name":"NASHUMHAKARACCA","text":"Wait for me, Inspector! Wait for me!"},{"name":"SHIGURE","text":"Part of me still struggles to believe it, <span class=\"highlight\">Forename</span>. The Wolf Burglar, captured, and myself become a Sekiseigumi."},{"name":"SHIGURE","text":"Again, I cannot thank you enough for all you have done for me."},{"name":"SHIGURE","text":"What an odd, circuitous path it is that led us to this point. To be honest, the most vexing complication was the loss of my hair─though Nashu assures me she is already in the process of procuring a potent tonic to remedy that."},{"name":"SHIGURE","text":"Once more we find ourselves waiting for fate to spur our story forward. Until we have a lead on the Soboro Sukehiro, we can but enjoy our respite..."}],"reward":{"gil":2259},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68630]},"next":[68686]},"partials":[{"type":"npc","id":"1025893","obj":{"i":1025893,"n":"Shigure","l":2404,"q":2}},{"type":"npc","id":"1025912","obj":{"i":1025912,"n":"Shigure","l":2404,"q":2}},{"type":"quest","id":"68630","obj":{"i":68630,"n":"In the Eye of the Hingan","g":70,"l":"Kugane","s":40,"f":1}},{"type":"quest","id":"68686","obj":{"i":68686,"n":"The Black Heart Beneath","g":70,"l":"Kugane","s":60,"f":1}}]}