{"quest":{"name":"Something Fishy This Way Comes","location":"The Azim Steppe","id":68632,"patch":4.3,"sort":1,"icon":100770,"unlocksFunction":1,"eventIcon":71341,"issuer":1025693,"target":1025698,"genre":54,"journal":["The floundering Namazu seems to be in need of help. A lot of help.<br><br>※Please note that you may not proceed with a class or job that is different from when you accepted this quest.","You stumble across a terribly dehydrated Namazu in the middle of the desert─a most peculiar sight indeed. Upon confirming that he is likely to survive, you attempt to make an expedient exit. However, a moment's hesitation costs you all plausible deniability. Resigned to facing whatever ordeal lies in store, you stuff the Namazu in your pack at his request, and set off for Yuzuka Manor.","You unceremoniously deposit the Namazu at the feet of his friend Gyorei. After drinking several times his weight in water, he recovers enough to explain that he is an artisan by the name of Gyoshin, and─though you give no indication of interest─continues on to tell you about his recent unusual dreams. Said dreams evidently include the Namazu's ancestor and a dire warning about the annihilation of their tribe, which can only be averted by holding a seven-year festival on the Azim Steppe. Between this pronouncement and the sudden dramatic entrance of a third Namazu, the self-proclaimed “Seigetsu the Enlightened,” you find yourself in no position to protest as they commandeer your services for this endeavor.","Naturally, the Namazu require festival grounds before the event planning can proceed. Upon learning of your many heroic deeds in the north, Seigetsu the Enlightened suggests that you introduce the trio to the khatun of the Mol, so they may obtain permission to use unoccupied land in the Azim Steppe for their venue.","You arrive at Mol Iloh to learn that the wise Temulun has already designated a location for the Namazu's festival. Alas, you are not off the hook yet. The Namazu clearly have a long road ahead if their ideal doom-averting, culturally relevant event is to be realized, and they look to you to provide sorely needed competent assistance─or perhaps just cheap labor. Either way, there is much to be done. Touring the grounds at the Towering Still seems like as good a first step as any.","With its pavilions windtorn and faded, the erstwhile home of the Dhoro will require significant work if it is to play host to what will surely be a festival like no other. One can only wonder what Gyoshin thinks of this site and the tribulations which lie ahead.","To your surprise, Gyoshin is more than satisfied with the ramshackle pavilions of Dhoro Iloh, and seems both hopeful for the festival's prospects and eager to set to work. As Gyorei says, he is almost admirable. Almost."],"objectives":["Bring the squirming sack to Gyorei at Yuzuka Manor.","Speak with Gyoshin.","Speak with Temulun at Mol Iloh. ","Speak with the Mol guide.","Speak with Gyoshin."],"dialogue":[{"name":"SYSTEM","text":"The Namazu before you is twitching vigorously."},{"name":"SYSTEM","text":"Though it seems to be in a bad way, it is unmistakably alive and will probably survive without your intervention."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Offer your prayers and move along."},{"name":"A1","text":"Pretend you saw nothing."},{"name":"GYOSHIN","text":"(-Namazu Voice-)You there! Wait, wait!"},{"name":"GYOSHIN","text":"I am not dead─far from it! And do not pretend that you thought I was!"},{"name":"GYOSHIN","text":"How unfair of you to assume that aiding me would lead you to undertake a series of arduous tasks. I assure you that I require your assistance only this once."},{"name":"GYOSHIN","text":"You see, fate─destiny!─guided me to the Azim Steppe."},{"name":"GYOSHIN","text":"But as I wandered this unfamiliar land, I became increasingly lost...and dry. Parched! Until I found I could no longer take even a single step..."},{"name":"GYOSHIN","text":"Random passerby, you will be traveling to Yanxia, yes? You will find that I am most portable. Quite suitable for sacks. I ask only that you convey me to Gyorei at Yuzuka Manor."},{"name":"GYOSHIN","text":"Please, please!"},{"name":"GYOREI","text":"My, my, what an oddly shaped bag you have!"},{"name":"GYOSHIN","text":"(-Floundering Namazu-)I...am returned..."},{"name":"GYOREI","text":"Gyoshin! How did you come to be so desiccated?"},{"name":"GYOREI","text":"No, no, never mind that─I will bring water posthaste!"},{"name":"GYOSHIN","text":"&lt;gulp&gt; &lt;gulp&gt; ...Ahhh, much better."},{"name":"GYOSHIN","text":"There is nothing like a deep draught of the One River's water. Another half-dozen jugs and I will be most fully refreshed!"},{"name":"GYOREI","text":"First you might explain where you have been! And what of this traveler─have you no words for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>? Such an ill-mannered Namazu I have never seen!"},{"name":"GYOSHIN","text":"Oh, yes, yes. Slipped my mind entirely. Ahem! Thank you, thank you, random passerby!"},{"name":"GYOSHIN","text":"I am Gyoshin. Namazu artisan, crafter of crafts. My deftness of fin is second to none."},{"name":"GYOREI","text":"Yes, yes, he would be almost admirable were he not so careless. Why, not a fortnight ago he wandered into the path of a falling vase and was knocked utterly unconscious."},{"name":"GYOSHIN","text":"Indeed, that is how I came by this head wound. It was most excruciatingly painful. And though I made a full recovery and have been in perfect health ever since..."},{"name":"GYOSHIN","text":"I began to have unusual dreams. Yes, yes. Dreams of my greatest grandsire standing before me, shrouded in light..."},{"name":"GYOSHIN","text":"He revealed that every seven hundred and seventy-seven years, we must hold a seven-year celebration commemorating the birth of our tribe. Should we fail to do so, the Namazu will be most gruesomely annihilated once seven years pass. Seven years!"},{"name":"GYOREI","text":"And so you immediately set forth on a journey to our homeland at the head of the One River? Without so much as a thought towards preparation?"},{"name":"GYOREI","text":"How reckless can you possibly be? Though I do not doubt it was distressing to you, a dream is no more than a dream. Yes, yes."},{"name":"KOFUINSEIGETSU","text":"(-Intellectual-sounding Voice-)...Hasten not to judge, for profound truth may lie in even visions of the night."},{"name":"GYOREI","text":"Who said that?"},{"name":"KOFUINSEIGETSU","text":"None other than I, renowned member of the literati, Seigetsu the Enlightened!"},{"name":"GYOSHIN","text":"Oh, it's just Gyofun. Always with his face buried in a book─a walking tome with whiskers, our Gyofun─"},{"name":"KOFUINSEIGETSU","text":"Speak not that name, no, no! I cast it aside long ago, for I have searched my soul and found my true name─Seigetsu the Enlightened! Seigetsu the Enlightened! How many times must I tell you!?"},{"name":"GYOSHIN","text":"Yes, yes, your soul has a lot to say, I am aware. Did you need something?"},{"name":"KOFUINSEIGETSU","text":"This. This is why I detest imbeciles... But I will waste no further words on you and your deficiencies, for a matter of greater import demands our attention: the festival."},{"name":"KOFUINSEIGETSU","text":"In the course of my scholarly endeavors, I encountered a dated manuscript entitled <span class=\"emphasis\">The Epic of Ganen</span>, which mentions an event that took place centuries past along the upper One River. This “unforgettable spectacle,” as the author describes it, was a festival held by our own ancestors."},{"name":"KOFUINSEIGETSU","text":"It is written that this festival marked our people's first step toward enlightenment─the advent of a civilized Namazu society. Even you must understand the significance."},{"name":"KOFUINSEIGETSU","text":"Though I suspect your “vision” is a by-product of a few too many blows to the head, reviving this tradition is an excellent idea. At long last, the Namazu will emerge from the darkness of ignorance─our cultural renaissance has arrived!"},{"name":"GYOSHIN","text":"I have no idea what that means and am not sure if I care, but if you are offering to help, then I graciously accept."},{"name":"GYOREI","text":"Well, well, I see there is no stopping you. I will accompany you, then─but I must insist that we bring another. One with more than a passing familiarity with the region."},{"name":"GYOSHIN","text":"(-All Three Namazu-)Thanks in advance!"},{"name":"GYOREI","text":"Gyoshin is liable to wander off a cliff if left to his own devices. As a friend, I cannot let him make this journey alone. No, no."},{"name":"KOFUINSEIGETSU","text":"You are insatiably curious as to why my orbital structure differs from that of my brethren, are you not? It is merely a physical manifestation of my surpassing intellect. I call it...the Gaze of the Enlightened."},{"name":"GYOSHIN","text":"So, so, how much do you know about the Steppe?"},{"name":"KOFUINSEIGETSU","text":"My word, not only have you spent many a day there, but you also claimed victory in the Naadam on behalf of the Mol? Surely there is no guide more qualified to lead us."},{"name":"GYOSHIN","text":"The what, what?"},{"name":"KOFUINSEIGETSU","text":"I can only pity you, mired in the depths of ignorance as you are. Listen well: the Azim Steppe is home to valorous warriors known as the Xaela."},{"name":"KOFUINSEIGETSU","text":"Were we to enter and carry on with our festival preparations unannounced, we would undoubtedly be skewered and served as hors d'oeuvres. Or perhaps steamed and served in a buuz, as that is a rather more common delicacy among the Steppe's tribal peoples..."},{"name":"GYOSHIN","text":"I would rather not be served either way, thank you!"},{"name":"KOFUINSEIGETSU","text":"That is precisely why we are fortunate to have encountered <span class=\"highlight\">Forename</span>. We need only for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to escort us to the khatun of the Mol, whom we can petition for permission to hold our festival."},{"name":"GYOSHIN","text":"I see, I see. In that case, please lead us there! I am sure that my explanation of our mission will be quite convincing. Most persuasive."},{"name":"CIRINA","text":"It is lovely to see you again, khagan. I was delighted when I heard that the elder gods spoke of your return. Though I must admit that I am unsure what to make of their description of the companions you are meant to introduce to us today."},{"name":"TEMULUN","text":"I bid you welcome, khagan. Glad are we to see that the gods have brought you to us once again. And I see you are in the company of Namazu?"},{"name":"GYOSHIN","text":"Hello, hello! We, well, you see..."},{"name":"TEMULUN","text":"I know what you seek. We have already readied a location for your celebration."},{"name":"GYOSHIN","text":"H-How did you know? Clairvoyance? Witchcraft!?"},{"name":"TEMULUN","text":"I but heed the whispers of the gods. They spoke of two disciples of creation traveling hither to hold a great celebration─one of whom would be a Namazu."},{"name":"KOFUINSEIGETSU","text":"Astounding. Are you perchance one of the Mol's esteemed udgan? I read of them in <span class=\"emphasis\">Narrow Road through the Deep Grass</span>."},{"name":"GYOREI","text":"Wait, wait. Gyoshin must be the Namazu in question, but who is the second disciple of creation?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm something of an artisan myself."},{"name":"A2","text":"I've been known to dabble in gathering."},{"name":"GYOSHIN","text":"One shock after another! You manage such delicate work without fins?"},{"name":"GYOSHIN","text":"One shock after another! You can locate things without barbels?"},{"name":"GYOSHIN","text":"Well, physical inadequacies notwithstanding, I am sure that you would be a great help. Will you assist us? Please, please?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Yes, yes! "},{"name":"A3","text":"Not just no, no, but hells no, no."},{"name":"TEMULUN","text":"Do you recall what I once told you? Stars flock to you. Cherish their light."},{"name":"TEMULUN","text":"These little ones too were drawn to your side. Lend them your radiance. If not today, then someday soon, for all asterisms have meaning. "},{"name":"GYOSHIN","text":"Then it is decided! Everything is settled!"},{"name":"TEMULUN","text":"Indeed. I will have you shown to the grounds we have prepared."},{"name":"MOLGUIDE","text":"In the west stand the rocky cliffs of the Towering Still, erstwhile home of the Dhoro. Their abandoned structures have fallen into disrepair, but with some effort they can be repurposed."},{"name":"GYOSHIN","text":"You are too kind, most considerate. I can hardly wait to see!"},{"name":"MOLGUIDE","text":"The festival grounds can be found on the plateau above. Your Namazu comrades have already made their way there. Shall I show you to them?"},{"name":"Q4","text":"Ascend to Dhoro Iloh?"},{"name":"TEMULUN","text":"No one star brings light to the void alone. In number do they rise and overcome the night. Remember this, and weave a constellation to guide others as they forge their own paths through the dark."},{"name":"CIRINA","text":"Lamb or dzo are the most common fillings, but I suddenly find myself remembering how delicious buuz are when made with catfish."},{"name":"GYOREI","text":"A river flows below the cliffs, so at least we need not worry for want of water."},{"name":"KOFUINSEIGETSU","text":"As the famed wanderer Hoelun notes in <span class=\"emphasis\">Narrow Road through the Deep Grass</span>, the Dhoro are a proud but reclusive people who eschew almost all contact with outsiders. Perhaps Dhoro Iloh's surroundings will yield some indication as to why."},{"name":"GYOSHIN","text":"These pavilions are rather dilapidated, quite decrepit, but I will have them fixed up in no time."},{"name":"GYOSHIN","text":"A wonderful location! Yes, yes. These pavilions are rather dilapidated, quite decrepit, but I will have them fixed up in no time."},{"name":"GYOSHIN","text":"Yes, yes, I am itching to get to work! ...Though the actual itching may be my fins drying out again. Who wants to carry me down to the river?"}],"reward":{"gil":1383},"reqs":{"jobs":[{"lvl":60,"id":35}],"questsType":"all","quests":[68053,68276]},"next":[68633]},"partials":[{"type":"npc","id":"1025693","obj":{"i":1025693,"n":"Floundering Namazu","l":2411,"q":1}},{"type":"npc","id":"1025698","obj":{"i":1025698,"n":"Gyoshin","l":2411,"q":1}},{"type":"quest","id":"68053","obj":{"i":68053,"n":"In Crimson They Walked","g":6,"l":"The Azim Steppe","s":750}},{"type":"quest","id":"68276","obj":{"i":68276,"n":"Kurobana vs. Gyorin","g":109,"l":"Yanxia","s":4280,"f":1}},{"type":"quest","id":"68633","obj":{"i":68633,"n":"One Size Fits All","g":54,"l":"The Azim Steppe","s":2,"f":1}}]}