{"quest":{"name":"Into the Fire","location":"The Azim Steppe","id":68637,"patch":4.3,"sort":6,"icon":100775,"beast":11,"unlocksFunction":1,"eventIcon":71341,"issuer":1025601,"target":1025845,"genre":54,"usedItems":[22698],"journal":["Gyoshin is staring at you in a way that suggests another doom-laden prophecy is forthcoming.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Gyoshin summons you to a meeting to discuss a matter of dire import. Though he never manages to explain, one can safely assume that, were he given the opportunity, he would say that the Namazu must improve their festival, lest they be annihilated in seven years. Seven years! With that in mind, Seigetsu the Enlightened suggests that they incorporate a bizarre ritual so the festival will be more like the “unforgettable spectacles” once held by the Namazu of yore. Having concluded that Master Matoya would be the best source of information on such rituals, you stow Gyoshin in your bag once again and prepare to make for the Dravanian hinterlands.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","After some confusion on Gyoshin's part, you correctly identify Matoya and ask her about odd rituals. She recommends reviving the darkest of practices in order to create a spectacle memorable enough to avert the Namazu's prophesied demise, and swiftly prepares a reference tome on forbidden rituals for you. In the meantime, Gyoshin manages to drink too much tea for his own good, and will have to be carried back to Dhoro Iloh in your luggage.","You arrive in Dhoro Iloh and release Gyoshin from his cloth prison only to find that he has befouled your bag. Alas, you have no time to process this sudden and unfortunate addition to your laundry pile, as a scuffle over Matoya's book ensues. Seigetsu the Enlightened sends the tome flying, and while Gyoshin manages to prevent it falling into the bonfire, he himself is not so lucky. The unique experience of being set ablaze inspires him to hold the Wicker Man ritual, and, seeing the fire in his eyes, none have the courage to stop him.","Gyoshin puts you in charge of one of the components necessary for the Namazu to build an enormous effigy and hold a sacrificial burning. You are in no position to refuse, so all you can do is follow orders and hope for the best.","You hand over your component and help the Namazu build the giant effigy, but Seigetsu the Enlightened points out that the ritual cannot be completed until a live sacrifice is burned. Thankfully, Gyorei is one step ahead of him, and prevents the squabble over who should be incinerated from escalating by offering cloth dolls as a substitute. The Namazu effigy can now continue burning merrily without any off-putting bloodshed."],"objectives":["Deliver Gyoshin to Matoya's Cave.","Return Gyoshin to Dhoro Iloh.","Speak with Gyoshin.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Gyorei</span><span class=\"alternative\">Mine [Error] east of Mol Iloh</span><span class=\"alternative\">Gather [Error] east of Mol Iloh</span><span class=\"alternative\">Catch [Error] in Nem Khaal</span></span>."],"dialogue":[{"name":"GYOSHIN","text":"Attendees love our fins-on activities. Just look at that one over there, who seems most loath to let go of his horse! But we cannot afford to rest in our jars just yet. You see, our dramatic demise, our painful annihila─ Oh, I forgot to call Gyorei and Gyofun. One moment, please."},{"name":"GYOSHIN","text":"I have summoned you all here for one reason. Yes, ye─"},{"name":"KOFUINSEIGETSU","text":"I assume this will again be some nonsense about dreams and prophecies? You must recall that I cautioned you against eating unidentified plant matter."},{"name":"GYOSHIN","text":"If it comes from the ground, it is food! Yes, yes. Just because I was rendered violently ill, incapacitated for a fortnight by those green mushrooms does not mean... Wait, what were we talking about? Oh, yes, yes. I have continued to see our greatest grandsire in my dreams."},{"name":"KOFUINSEIGETSU","text":"...Though the dreams of your addled mind are immaterial to my goal of enlightening one and all, I have identified an aspect in which our festival is lacking compared to those of our ancestors."},{"name":"GYOSHIN","text":"That is fantastic, Seigetsu the Enlightened. Yes, yes. Though I cannot help but worry that you are about to─"},{"name":"KOFUINSEIGETSU","text":"Allow me to elaborate in detail! Culture is an ever-evolving beast, you see. The radicalization of culture, in particular, results in unique cultural expressions that outsiders struggle to comprehend. When it is applied to ritual, festivals become true carnivals of the bizarre."},{"name":"KOFUINSEIGETSU","text":"Given that our ancestors' festivals were known as “unforgettable spectacles,” should we not assume they had a fair few radical elements? In which case, our event must needs include at least one uniquely memorable ritual if we are to carry on their legacy."},{"name":"GYOSHIN","text":"That actually sounds interesting! I am most intrigued. What happens in these rituals that everyone finds so strange?"},{"name":"KOFUINSEIGETSU","text":"I haven't the foggiest! Religious rituals are secretive by nature, my dear Gyoshin!"},{"name":"GYOSHIN","text":"Perhaps it is my own fault. Yes, yes. I neglected to remember Gyofun's unhelpfulness. I suppose we will put this matter to rest for now. Call it a day."},{"name":"KOFUINSEIGETSU","text":"Now, hold on a moment! Your lack of intellectual curiosity is no fault of mine. The correct response would be to acknowledge our need to engage in further research."},{"name":"KOFUINSEIGETSU","text":"<span class=\"emphasis\">Occidentalism</span> makes mention of a Sharlayan society devoted to the pursuit of knowledge. One of their number might be privy to the information we seek."},{"name":"KOFUINSEIGETSU","text":"One such as yourself must know Sharlayans of the intellectual persuasion we require. Preferably someone wizened. With arcane knowledge. Who is also an expert in rituals. Surely you know a few fitting that profile?"},{"name":"KOFUINSEIGETSU","text":"Master Matoya in Dravania, you say? Yes, she sounds ideal. It is so convenient that you foreigners all know each other."},{"name":"GYOSHIN","text":"Yes, yes. She sounds most convenient. Much more useful than Gyofun."},{"name":"GYOSHIN","text":"I hate─<span class=\"emphasis\">really</span> hate─to ask, but could you convey me to Master Matoya's in your bag?"},{"name":"GYOREI","text":"I realize that looking after Gyoshin can be exhausting. Yes, yes. In a variety of ways."},{"name":"MATOYA","text":"...I don't suppose you've a reason for lugging that thing around?"},{"name":"GYOSHIN","text":"Is this the place? Please tell me this is the place."},{"name":"GYOSHIN","text":"Hello, hello! Are you Master Matoya? I am relieved to see you so moist, so slimy. From <span class=\"highlight\">Forename</span>'s description, you sounded most dry and intimidating!"},{"name":"MATOYA","text":"Eager to get off on the wrong foot, aren't we?"},{"name":"GYOSHIN","text":"...Oh. Oh no. The scary lady is Master Matoya?"},{"name":"GYOSHIN","text":"I am so sorry. Most apologetic! I was confused."},{"name":"MATOYA","text":"Well, since you and your bumbling companion have already disrupted my routine, I suppose I'll hear you out. I presume you've a reason for coming here other than to annoy me?"},{"name":"MATOYA","text":"Oh, the world is hardly short on carnivals of the bizarre."},{"name":"MATOYA","text":"Competitive cheese-rolling, fertility rituals where the bride gets whacked with a stick─I tell you if someone tried that with me, they'd be out an eye─whatever nonsense you can imagine, someone's getting up to it."},{"name":"MATOYA","text":"But if you seek to avert a calamitous fate, I trust you'll want to do better than those half-baked traditions."},{"name":"MATOYA","text":"For a truly memorable spectacle, you'll want to revive a ceremony so terrible, so horrible that few would dare to even whisper of it. One so steeped in evil that men swore never again to perform it!"},{"name":"GYOSHIN","text":"Oooh, evil! Darkness! Tell me more! Tell me more!"},{"name":"MATOYA","text":"If you shrink not from these horrors, I assume you are prepared to not only sully your hands, but your very soul."},{"name":"GYOSHIN","text":"Yes, yes! I will save the Namazu, even if I must endure a never-ending celebration. Even if I must work my fins to the bone."},{"name":"MATOYA","text":"Color me impressed. Confused, but impressed."},{"name":"MATOYA","text":"I'll prepare a simple manuscript on forbidden rituals for you. Just stay put. Have some tea. Do whatever it is you Namazu do."},{"name":"MATOYA","text":"Here we are. Only three hundred pages, but it should serve."},{"name":"GYOSHIN","text":"Thank you─&lt;hic&gt;─thank you!"},{"name":"MATOYA","text":"Ah, right. Tea makes Namazu tipsy. Lucky you."},{"name":"MATOYA","text":"It's a miracle they've survived this long. Well, back in the sack with him!"},{"name":"MATOYA","text":"Had anyone else shown up on my doorstep with a Namazu in tow, I would've had my poroggos deal with them. I'm still not quite sure what you're about, but if it gets you to stop fighting every other god or dragon for a spell, it can't be all that bad."},{"name":"GYOREI","text":"Welco─ What is that smell?"},{"name":"GYOSHIN","text":"...Fresh air at last. &lt;groan&gt; You might want to wash that. It smells like vomit in there."},{"name":"GYOSHIN","text":"A-Anyway, we should focus on this tome Matoya so kindly, most generously gave us."},{"name":"KOFUINSEIGETSU","text":"A manuscript penned by the Sharlayan scholar herself? I must peruse it without delay!"},{"name":"GYOSHIN","text":"Yes, yes. It is most illuminating. So full of information on fascinating rituals that I can hardly decide which we should attempt!"},{"name":"KOFUINSEIGETSU","text":"Relinquish that this instant! I must read it!"},{"name":"GYOSHIN","text":"Just a moment, please, please. This one is just so... Oh, but this one is also..."},{"name":"KOFUINSEIGETSU","text":"Give it here, I say. Now. NOW!"},{"name":"GYOSHIN","text":"Whoa! Wait, wait!"},{"name":"KOFUINSEIGETSU","text":"...Fascinating."},{"name":"GYOSHIN","text":"Owowowowowowowowow!"},{"name":"GYOREI","text":"Are you...all right?"},{"name":"GYOSHIN","text":"..."},{"name":"GYOSHIN","text":"Yes, yes! There can be only one! No other!"},{"name":"GYOSHIN","text":"This “Wicker Man” is the perfect choice. We must incinerate a live sacrifice inside a massive effigy!"},{"name":"GYOSHIN","text":"It is the only way to avert total Namazu annihilation! Yes...yes..."},{"name":"KOFUINSEIGETSU","text":"I...daresay he ought to be stopped, but it may be unwise to anger him just now."},{"name":"GYOSHIN","text":"To work! We require a large Namazu effigy. You must help me build it. You will not defy me, no, no?"},{"name":"GYOSHIN","text":"You will find materials to create a metal clamp in the crate. I expect you to bring me the finest you have ever made, yes, yes."},{"name":"GYOSHIN","text":"You will find materials to create papier-mache in the crate. I expect you to bring me the finest you have ever made, yes, yes."},{"name":"GYOSHIN","text":"You will find materials to create fuel in the crate. I expect you to bring me the most flammable you have ever made, yes, yes."},{"name":"GYOSHIN","text":"There are heat-resistant lava rocks in the deposits east of Mol Iloh that can be used in the effigy's base. I expect you to bring me the finest one you can find, yes, yes."},{"name":"GYOSHIN","text":"There is steppe sedge among the vegetation patches east of Mol Iloh that can be used for the papier-mache. I expect you to bring me a bundle of the finest you can find, yes, yes."},{"name":"GYOSHIN","text":"There are invisible catfish in Nem Khaal, easily caught with salmon roe. We will need one for the ceremonial offering that will accompany the effigy burning. I expect you to bring me the finest one you can find, yes, yes."},{"name":"GYOSHIN","text":"Gyorei will be the one collecting the components─all one hundred and seven of them. So speak to her when you are ready."},{"name":"GYOSHIN","text":"And how it shall burn... Oh, you are still here? Right, right. Try the crate for more materials."},{"name":"GYOSHIN","text":"And how it shall burn... Oh, you are still here? Right, right. Try the crate for more materials."},{"name":"GYOSHIN","text":"And how it shall burn... Oh, you are still here? Right, right. Try the crate for more materials."},{"name":"GYOSHIN","text":"And how it shall burn... Oh, you are still here? Right, right, Gyorei will collect your component."},{"name":"GYOSHIN","text":"And how it shall burn... Oh, you are still here? Right, right, Gyorei will collect your component."},{"name":"GYOSHIN","text":"And how it shall burn... Oh, you are still here? Right, right, Gyorei will collect your component."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"GYOSHIN","text":"You brought what I requested? That is a wise choice. An excellent decision!"},{"name":"GYOREI","text":"I cannot say I expected us to go the “live sacrifice” route. No, no."},{"name":"GYOREI","text":"Gyoshin seems a bit odd. Though I suppose he is always odd..."},{"name":"GYOREI","text":"Ah, the final component! Thank you, thank you. Now let us see what comes of this."},{"name":"GYOSHIN","text":"Wow, it is like looking into a stream. A reflection staring back at me! Most imposing. Quite impressive."},{"name":"KOFUINSEIGETSU","text":"Gyoshin, are you not forgetting something? Yet again?"},{"name":"GYOSHIN","text":"..."},{"name":"KOFUINSEIGETSU","text":"The live sacrifice, you imbecile!"},{"name":"GYOSHIN","text":"Oh! Thank you so much for volunteering!"},{"name":"KOFUINSEIGETSU","text":"I most certainly am not volunteering! Should it not be the artist who sees his work through to the end?"},{"name":"GYOSHIN","text":"Hm. Well, I am quite sure, indeed confident that <span class=\"highlight\">Forename</span> provided the most important parts..."},{"name":"GYOREI","text":"Oh, for the Big One's sake! You need not be in such a hurry to set each other aflame. According to Matoya's manuscript, a cloth doll is a perfectly acceptable substitute for the sacrifice. Yes, yes."},{"name":"GYOREI","text":"I set my fins to sewing a few some time ago. And I followed the instructions to the letter, so they should be more than sufficient."},{"name":"GYOSHIN","text":"Gyorei! You are a lifesaver!"},{"name":"GYOSHIN","text":"Let us get this fire started!"},{"name":"SYSTEM","text":"In seven years, the Namazu were fated to fall deeply in debt, and be doomed to work ceaselessly as slaves for the sinister soy sauce mogul, Kageyama. Many would have died."},{"name":"SYSTEM","text":"However, the oversized Namazu effigy will, over the course of seven years, come to be known far and wide as a uniquely bizarre spectacle, and generate significant revenue from tourism."},{"name":"SYSTEM","text":"Unbeknownst to all, the Namazu will be spared the grievous tragedy that could have consumed them, and their fate continues to change for the better."},{"name":"KOFUINSEIGETSU","text":"I daresay it is impossible to discern the meaning or purpose behind this peculiar ritual. Indeed, it is nothing less than the epitome of enlightenment!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Sworn</span> reputation with the Namazu."},{"name":"SYSTEM","text":"New Namazu tribal daily quests are now available from Seigetsu the Enlightened at Dhoro Iloh."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Seigetsu the Enlightened as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Seigetsu the Enlightened. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Gyosho."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"Normal-quality items gathered in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":2938,"items":[{"num":2,"id":18022,"one":1},{"num":2,"id":18024,"one":1},{"num":2,"id":18025,"one":1}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":35}],"quests":[68636]},"next":[68638]},"partials":[{"type":"npc","id":"1025601","obj":{"i":1025601,"n":"Gyoshin","l":2411,"q":5}},{"type":"npc","id":"1025845","obj":{"i":1025845,"n":"Gyorei","l":2411,"q":1}},{"type":"item","id":"18022","obj":{"i":18022,"n":"Gatherer's Guerdon Materia VI","l":290,"c":20266,"t":58,"materia":{"tier":5,"value":15,"attr":"Gathering","category":2}}},{"type":"item","id":"18024","obj":{"i":18024,"n":"Gatherer's Grasp Materia VI","l":290,"c":20266,"t":58,"materia":{"tier":5,"value":8,"attr":"GP","category":2}}},{"type":"item","id":"18025","obj":{"i":18025,"n":"Craftsman's Competence Materia VI","l":290,"c":20270,"t":58,"materia":{"tier":5,"value":16,"attr":"Craftsmanship","category":1}}},{"type":"item","id":"22698","obj":{"i":22698,"n":"Effigy Component Materials","l":150,"c":26001,"t":61}},{"type":"quest","id":"68636","obj":{"i":68636,"n":"Out of the Frypan","g":54,"l":"The Azim Steppe","s":5,"f":1}},{"type":"quest","id":"68638","obj":{"i":68638,"n":"Disciples of Creation","g":54,"l":"The Azim Steppe","s":7,"f":1}}]}