{"quest":{"name":"Out of the Frypan","location":"The Azim Steppe","id":68636,"patch":4.3,"sort":5,"icon":100774,"beast":11,"unlocksFunction":1,"eventIcon":71341,"issuer":1025601,"target":1025716,"genre":54,"usedItems":[22697],"journal":["Gyoshin is so eager to speak with you that he can no longer contain himself, and is now rocking back and forth with anticipation.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Gyoshin is on the point of relaying another dire warning imparted by his ancestor when Seigetsu the Enlightened, having detected a familiar pattern, interjects to hasten matters along. He recommends that Gyoshin look into the Xaela's traditions, which may have been influenced by those of the Namazu long ago, for clues as to what vital element might be missing from the festival. Gyoshin, however, refuses to go without your protection, lest the Xaela get any ideas about their evening meal.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You and Gyoshin speak to Cirina. She is more than willing to share information regarding her tribe's horse-racing customs with you, though the growling of her stomach is somewhat distracting. Perhaps sensing the intent behind her hungry stare, Gyoshin thanks her and asks that you set off for your next destination, the Dawn Throne, immediately.","You speak with Magnai, who gives a brief overview of the Oronir's Azim Bökh wrestling competitions. In his usual contemptuous tone, he adds that a Namazu would likely make a poor opponent, but Gyoshin seems undeterred─if somewhat miffed at being deemed “malformed.”","Your final stop is Dotharl Khaa, where Sadu─apparently laboring under the delusion that Gyoshin is some sort of small and round khun chuluu─speaks of the Dotharl's customary archery contests. Satisfied with the information you have gained, Gyoshin proposes you return to Dhoro Iloh to apply your newfound knowledge.","Based on what the Xaela said of their own traditions, the Namazu conclude that a proper festival must include fins-on activities for attendees. Without sparing a thought for such seemingly vital questions as, “Is it possible to pull a bow without getting one's whiskers tangled in the string?” and “Are horses not a bit high off the ground?” the Namazu decide to copy the three Xaela tribes' competitions wholesale. You have been tasked with preparing for the archery contest together with Gyoshin.","Once all materials for the ceremonial bow and arrows are assembled, Gyoshin excitedly reveals what he has been working on in the meantime─a target. Unfortunately, said target cannot stand on its own, so Gyoshin is volunteered to hold it. You will be in charge of aiming accurately enough not to impale him.","Accepting the bow and arrows from Gyorei, you take aim at the target, and fortunately manage not to cause anyone permanent injury.","The successful archery demonstration gives heart to the festival participants, and in no time at all, the archery, Azim Bökh, and equestrian competitions are open to the public. With several Xaela now on-site, the festival grounds are poised to become a venue for cultural exchange."],"objectives":["Speak with Cirina.","Speak with Magnai.","Speak with Sadu.","Report to Gyorei.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Gyoshin</span><span class=\"alternative\">Mine [Error] south of Reunion</span><span class=\"alternative\">Gather [Error] south of Reunion</span><span class=\"alternative\">Catch [Error] at Dotharl Khaa</span></span>.","Speak with Gyorei.","Speak with Gyoshin."],"dialogue":[{"name":"GYOSHIN","text":"&lt;gasp&gt; <span class=\"highlight\">Forename</span>! Once more I would consult you on festival matters. Issues of dire import! Stay right there."},{"name":"GYOSHIN","text":"The parade was most delightful! So fun it was almost scary, yes, yes."},{"name":"GYOSHIN","text":"I paraded with such enthusiasm that I eventually lost all sense of time, all awareness of night and day...and when I came to, I was unconscious!"},{"name":"GYOREI","text":"...I do not think that is how that works. No, no."},{"name":"GYOSHIN","text":"Just imagine my shock when I saw my greatest grandsire before me once again! That is when I realized that I was asleep, dreaming."},{"name":"KOFUINSEIGETSU","text":"And now we must endure several sentences' worth of warnings regarding the inevitable annihilation of the Namazu, correct? Entirely lacking in plot development, each iteration of this story is no different from the last. Were this a work of fiction, I would hurl it into the nearest river!"},{"name":"KOFUINSEIGETSU","text":"However, never shall it be claimed that Seigetsu the Enlightened lacks foresight. Having observed these events repeat themselves once, I naturally prepared for another instance."},{"name":"KOFUINSEIGETSU","text":"Now, festivals are culture made manifest, and, as posited in <span class=\"emphasis\">The Rise and Fall of Civilization: Volume VI</span>, culture spreads."},{"name":"KOFUINSEIGETSU","text":"Cultural knowledge is disseminated via migration and commerce, and that knowledge takes root as new elements in foreign cultures."},{"name":"KOFUINSEIGETSU","text":"I see you moving to interject, Gyoshin! Close your gaping maw for a few more moments, and yes, I shall condense my conclusion to three sentences or fewer."},{"name":"KOFUINSEIGETSU","text":"Our forebears' festival took place here many hundreds of years ago."},{"name":"KOFUINSEIGETSU","text":"Contemporary nomads doubtless witnessed said event."},{"name":"KOFUINSEIGETSU","text":"They must have incorporated knowledge of it into their own cultures!"},{"name":"KOFUINSEIGETSU","text":"Go forth, Gyoshin! Pay visit to the Xaela and learn what traditions they keep, and you may well return with a wealth of ideas as to what our own festival lacks."},{"name":"GYOSHIN","text":"Is it me, or is his enthusiasm a bit much? Anyway, I would very much like to call upon the Xaela, but there is the issue of being skewered, of being steamed in a buuz. Though considerably less so if you accompany me. Yes, yes?"},{"name":"GYOSHIN","text":"Let us start with the least likely to skewer. Introduce me to the most friendly among the Mol, and I will inquire about their traditions."},{"name":"GYOREI","text":"This festival is shaping up to be quite the abomina─I mean, amalgam of traditions. Yes, yes."},{"name":"GYOSHIN","text":"I feel quite awkward, most nervous under this lady's rapt gaze. Could it be...love?"},{"name":"TEMULUN","text":"It is good to see Dhoro Iloh put to use with such enthusiasm."},{"name":"CIRINA","text":"(Mmm, catfish buuz... I can nearly taste it...)"},{"name":"CIRINA","text":"Oh, <span class=\"highlight\">Forename</span>! What can I do for you?"},{"name":"CIRINA","text":"Is that so? I would be glad to speak with you about our festival traditions, if you believe such knowledge might be of use to you."},{"name":"CIRINA","text":"In our tribe, children of a certain age participate in a ceremonial race through the grasslands on horseback."},{"name":"CIRINA","text":"For a nomadic people such as ourselves, horses are not only vital to our mobility and livelihood, they are like family. We tend to these dear companions with the utmost care."},{"name":"CIRINA","text":"The speed of these horses, and the skill of the Mol children who guide them─these are what we offer the gods. How we show our gratitude for the richness of the land we are so blessed to live upon."},{"name":"GYOSHIN","text":"I would never have expected a festival to take the form of a horse race. No, no. But it is most intriguing. Thank you for your insight!"},{"name":"GYOSHIN","text":"You are also acquainted with the Oronir, yes, yes? To the Dawn Throne!"},{"name":"CIRINA","text":"Such a delicious-looking fellow. Are they all so plump?"},{"name":"GYOSHIN","text":"I feel rather unsettled, quite put off by this towering man's gaze. I hope he ate recently."},{"name":"MAGNAI","text":"Come to pay me your respects, have you? I hope you are not so foolish as to have brought that bloated creature as a gift."},{"name":"MAGNAI","text":"You believe that <span class=\"emphasis\">I</span> can be of service to <span class=\"emphasis\">you</span>?"},{"name":"MAGNAI","text":"...I suppose I can spare a few moments to enlighten you, though I do not expect you to comprehend the splendor and significance of Oroniri tradition."},{"name":"MAGNAI","text":"The Oronir's most sacred custom is a tournament in which we determine who among us is the most─and least─worthy to lead. It is a contest which pits brother against brother in the traditional art of Azim Bökh. In this way, we demonstrate our strength to the tribe and to Father Azim."},{"name":"MAGNAI","text":"Were the opportunity to arise, khagan, I expect you would conduct yourself well in the tournament. The malformed fishman, however, would be put flat on his back in the space of a breath."},{"name":"GYOSHIN","text":"Why, I never! That sort of conduct will win you no friends. Nor bring you any luck with the ladies, no, no! Still, I suppose you did divulge a tradition of some interest, so I am grateful to you. A little. Not really."},{"name":"GYOSHIN","text":"I would like to speak to the Dotharl before we return. It goes without saying that you must be there to prevent any untoward consumption of my flesh. Yes, yes."},{"name":"MAGNAI","text":"...“Luck with the ladies”? Pah. What does a fishman know of such matters? Nothing! Nothing at all!"},{"name":"MAGNAI","text":"...“Luck with the ladies”? Pah. What does a fishman know of such matters? Nothing! Nothing at all!"},{"name":"GYOSHIN","text":"I feel quite alarmed, rather terrified by this lady's piercing gaze. I sense skewerous intent!"},{"name":"SADU","text":"You. Is this khun chuluu yours? Its vacant stare vexes me."},{"name":"SADU","text":"...I see. So they are the ones who claimed Dhoro Iloh for this...festival? And they seek knowledge of our traditions for this end? Very well. They are no threat, so there is no risk."},{"name":"SADU","text":"The Dotharl are warriors and hunters both. Those born into this world could not survive otherwise."},{"name":"SADU","text":"Thus do we use archery to demonstrate to the Dusk Mother that we are worthy of her legacy."},{"name":"SADU","text":"We loose arrows at distant targets in a contest of truest aim. That is our tradition, simple as it is."},{"name":"GYOSHIN","text":"A festival like a game? How interesting! This has been most illuminating, yes, yes."},{"name":"GYOSHIN","text":"I think that is enough mortal peril for one day. We have sufficient information to get started, so let us return to Dhoro Iloh."},{"name":"SADU","text":"The khagan holding court with a host of khun chuluu! Will wonders never cease?"},{"name":"GYOSHIN","text":"We made it! I am showing Gyorei my haleness. The intact state of my flesh."},{"name":"GYOREI","text":"I am pleased to see you whole, yes, yes. What did you learn?"},{"name":"GYOSHIN","text":"Many, many things! Between horse races, Azim Bökh, and archery, the Xaela's festivals are most competitive. Quite fierce."},{"name":"KOFUINSEIGETSU","text":"Unsurprising, given the nature of the Naadam. Without structured competitions, I daresay the Xaela would struggle to contain their base aggressive instincts. Their savagery would doubtless drive them to extinction, be it through internal or external conflicts."},{"name":"KOFUINSEIGETSU","text":"I should like to indulge in further anthropological research, but I suppose your findings are sufficient for us to proceed. In essence, it seems that successful festivals involve engaging activities. We will require many if we are to entertain all seven hundred seventy-seven participants."},{"name":"GYOSHIN","text":"Yes, yes! It will be quite an undertaking. A massive task, requiring division of labor. But if Gyorei handles horse racing, you host an Azim Bökh tournament, and myself and <span class=\"highlight\">Forename</span> arrange for archery, we will have three whole activities for our attendees to enjoy!"},{"name":"KOFUINSEIGETSU","text":"As you wish. Though I am loath to deprive you of my insight, I must work from the pavilion with full access to my research materials if I am to learn the rules of Azim Bökh in their entirety. I advise you all to think twice or thrice about any ideas you may have in my absence. Especially Gyoshin."},{"name":"GYOSHIN","text":"Rude. Anyway, you can craft a metal grip fit for a ceremonial bow, yes, yes? I have stuffed all the materials in the crate in advance. Open it with care."},{"name":"GYOSHIN","text":"Rude. Anyway, you can craft a limb decoration fit for a ceremonial bow, yes, yes? I have stuffed all the materials in the crate in advance. Open it with care."},{"name":"GYOSHIN","text":"Rude. Anyway, you can make varnish fit for a ceremonial bow, yes, yes? I have stuffed all the materials in the crate in advance. Open it with care."},{"name":"GYOSHIN","text":"Rude. Anyway, if you bring me some mondite from the deposits south of Reunion, I can craft the arrowheads. Perhaps even safely! Yes, yes."},{"name":"GYOSHIN","text":"Rude. Anyway, if you bring me a straight shoot from the vegetation south of Reunion, I can craft the arrows. Perhaps even safely! Yes, yes."},{"name":"GYOSHIN","text":"Rude. Anyway, if you can catch an arrowhead snail in Dotharl Khaa, I can craft the arrowheads. Perhaps even safely! Yes, yes. I recommend you attract one with salmon roe. Everyone loves salmon roe."},{"name":"GYOSHIN","text":"Simply turn what you have over to me when finished, and I will complete the project most swiftly. With promptness!"},{"name":"GYOREI","text":"Hm? The crate remains replete with supplies, if you are in need. Yes, yes... Pardon me, I am attempting to work out how a Namazu might ride a horse."},{"name":"GYOREI","text":"Hm? The crate remains replete with supplies, if you are in need. Yes, yes... Pardon me, I am attempting to work out how a Namazu might ride a horse."},{"name":"GYOREI","text":"Hm? The crate remains replete with supplies, if you are in need. Yes, yes... Pardon me, I am attempting to work out how a Namazu might ride a horse."},{"name":"GYOREI","text":"Hm? Please provide your materials to Gyoshin. Yes, yes... Pardon me, I am attempting to work out how a Namazu might ride a horse."},{"name":"GYOREI","text":"Hm? Please provide your materials to Gyoshin. Yes, yes... Pardon me, I am attempting to work out how a Namazu might ride a horse."},{"name":"GYOREI","text":"Hm? Please provide your materials to Gyoshin. Yes, yes... Pardon me, I am attempting to work out how a Namazu might ride a horse."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"GYOREI","text":"Maybe we could use some sort of adhesive to affix them to the saddle... Oh! Thank you for taking care of that. Gyoshin will handle the bow and arrow assembly."},{"name":"GYOSHIN","text":"Bows and arrows require more pieces than I expected. Yes, yes. I am pleased to have such a challenge!"},{"name":"GYOSHIN","text":"Thank you, thank you! I can craft a suitably ceremonial bow and arrows with this."},{"name":"GYOSHIN","text":"I also have something to show you. I constructed it while awaiting your return..."},{"name":"GYOSHIN","text":"A most sturdy yet intricate target at which to aim! You love it, yes, yes?"},{"name":"GYOREI","text":"Your craftsmanship is impressive as always. Yes, yes. But should it not stand up?"},{"name":"GYOSHIN","text":"...Oh. I suppose I was absorbed in the design and completely, utterly forgot to make a stand. Yes, yes."},{"name":"KOFUINSEIGETSU","text":"Gyoshin, has it never occurred to you that your difficulties are of your own making? Honestly. It would be more efficient to employ <span class=\"emphasis\">you</span> to hold the target."},{"name":"GYOSHIN","text":"I do not trust your motive for making that suggestion. No, no!"},{"name":"KOFUINSEIGETSU","text":"I assure you, your concern is unfounded. We need but assign the infallible <span class=\"highlight\">Forename</span> the role of marks<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for you to emerge uninjured. Yes, yes, I daresay."},{"name":"KOFUINSEIGETSU","text":"Assume your positions! <span class=\"highlight\">Forename</span>, you may collect the ceremonial bow and arrows from Gyorei behind the pavilion."},{"name":"GYOSHIN","text":"You will take care not to hit me, yes, yes? Do you promise? Do you swear?"},{"name":"GYOREI","text":"This is the perfect cure for Gyoshin's carelessness. Yes, yes. He is most full of cares now."},{"name":"GYOREI","text":"Here are your ceremonial bow and arrows. Take aim at the target Gyoshin holds and fire away!"},{"name":"SYSTEM","text":"The archery event has begun! Take aim at Gyoshin's target, zoom in to avoid accidents, and fire with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"GYOSHIN","text":"W-Wow! Your aim is dead-on! Impeccable! ...Can I leave now?"},{"name":"GYOSHIN","text":"This arrowhead is most...piercing. A sign of...quality craftsmanship...yes...&lt;gurgle&gt;"},{"name":"GYOREI","text":"Again, again! I am confident that you will get the hang of it with another shot or two!"},{"name":"GYOREI","text":"I am proud of how you handled that bow. Yes, yes!"},{"name":"GYOSHIN","text":"Being on the business end of an arrow has never been an aspiration of mine. Not one of my goals in life. No, no."},{"name":"GYOSHIN","text":"Still, I am quite confident we are prepared to host archery contests like the frightening Dotharl lady described. Attendees will be delighted with the complete and total accuracy of our reproduction, yes, yes. Now let us see if the other two activities are ready!"},{"name":"SYSTEM","text":"Working side by side with the Namazu, you have successfully incorporated Xaela traditions into the festival. The horse racing, Azim Bökh, and archery competitions are now open to attendees!"},{"name":"SYSTEM","text":"In seven years, the Namazu were fated to become the primary source of sustenance for starving Xaela, who would face food shortages after a fierce cold snap. Many would have died."},{"name":"SYSTEM","text":"However, continuous practice of nomadic festival traditions over the course of seven years will promote mutual understanding between the Namazu and Xaela, averting the slaughter."},{"name":"SYSTEM","text":"Unbeknownst to all, the Namazu will be spared the grievous tragedy that could have consumed them, and their fate continues to change for the better."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Honored</span> reputation with the Namazu."},{"name":"SYSTEM","text":"New Namazu tribal daily quests are now available from Seigetsu the Enlightened at Dhoro Iloh."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Seigetsu the Enlightened as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Seigetsu the Enlightened. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Gyosho."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"Normal-quality items gathered in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":1103,"items":[{"id":18023,"one":1},{"id":18026,"one":1},{"id":18027,"one":1}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":35}],"quests":[68635]},"next":[68637]},"partials":[{"type":"npc","id":"1025601","obj":{"i":1025601,"n":"Gyoshin","l":2411,"q":5}},{"type":"npc","id":"1025716","obj":{"i":1025716,"n":"Gyoshin","l":2411,"q":1}},{"type":"item","id":"18023","obj":{"i":18023,"n":"Gatherer's Guile Materia VI","l":290,"c":20266,"t":58,"materia":{"tier":5,"value":15,"attr":"Perception","category":2}}},{"type":"item","id":"18026","obj":{"i":18026,"n":"Craftsman's Cunning Materia VI","l":290,"c":20270,"t":58,"materia":{"tier":5,"value":8,"attr":"CP","category":1}}},{"type":"item","id":"18027","obj":{"i":18027,"n":"Craftsman's Command Materia VI","l":290,"c":20270,"t":58,"materia":{"tier":5,"value":10,"attr":"Control","category":1}}},{"type":"item","id":"22697","obj":{"i":22697,"n":"Ceremonial Bow Component Materials","l":150,"c":26001,"t":61}},{"type":"quest","id":"68635","obj":{"i":68635,"n":"Waiting for Gyodo","g":54,"l":"The Azim Steppe","s":4,"f":1}},{"type":"quest","id":"68637","obj":{"i":68637,"n":"Into the Fire","g":54,"l":"The Azim Steppe","s":6,"f":1}}]}