{"quest":{"name":"The Importance of Being Yes, Yes","location":"The Azim Steppe","id":68639,"patch":4.3,"sort":1,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22699],"journal":["Seigetsu the Enlightened seems agitated.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the earnest Namazu.","Deliver the requested supplies to the earnest Namazu.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the earnest Namazu.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the earnest Namazu</span><span class=\"alternative\">Mine [Error] east of Mol Iloh</span><span class=\"alternative\">Gather [Error] southeast of Mol Iloh</span><span class=\"alternative\">Catch [Error] in Hak Khaal</span></span>.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Have you perchance encountered my errand boy? Grey, rotund fellow with a vacant gaze? No? I dispatched him with orders to procure additional happi materials some time ago, but have seen neither fin nor barbel of him since."},{"name":"KOFUINSEIGETSU","text":"You surely recognize that I cannot waste my talents tracking wayward lackeys─the festival would collapse into uncivilized chaos were I to neglect my intellectual endeavors for but a moment. If you are not otherwise engaged, can you search for him in my stead?"},{"name":"KOFUINSEIGETSU","text":"His sojourn should have brought him to Mol Iloh, so you are likely to find him in the vicinity. If you discover him to have encountered complications, I trust you will ameliorate the situation."},{"name":"DAILYNAMAZUO03103","text":"Woe, woe is me! I have encountered complications. If only someone would ameliorate them..."},{"name":"DAILYNAMAZUO03103","text":"Oh! What a surprise to see you here, standing in silence mere ilms away. Yes, yes. Please never do it again."},{"name":"DAILYNAMAZUO03103","text":"I was absorbed in thought, you see. I had promised to trade with the Mol for materials we can use in our festive happi, and brought some fincrafted fineries along for this purpose. But then, when I least expected it..."},{"name":"DAILYNAMAZUO03103","text":"...I was trampled by a charging dzo! It had dashed several malms by the time I regained my normal shape and the ability to walk. Yes, yes. I eventually discovered it devouring the last of my fineries."},{"name":"DAILYNAMAZUO03103","text":"...A flock of yol swooped down upon me! Luckily, I was able to liberate myself from their talons. Yes, yes. Less luckily, we were at least a malm in the air by then. By the time I regained solid ground and consciousness, my fineries were gone."},{"name":"DAILYNAMAZUO03103","text":"...I noticed several Buduga in pursuit! Hoping they would take my fineries instead of my life, I threw them behind me and ran. Yes, yes. Tossed them one and all."},{"name":"DAILYNAMAZUO03103","text":"I have no choice but to remake what I have lost. But I am only one Namazu, and require many fineries for trade. Will you lend me a fin?"},{"name":"DAILYNAMAZUO03103","text":"Specifically, I find myself in need of more nails. Yes, yes. I have managed to collect the materials, so take whatever you need from this box."},{"name":"DAILYNAMAZUO03103","text":"Specifically, I find myself in need of more thick fabric. Yes, yes. I have managed to collect the materials, so take whatever you need from this box."},{"name":"DAILYNAMAZUO03103","text":"Specifically, I find myself in need of more lubricating oil. Yes, yes. I have managed to collect the ingredients, so take whatever you need from this box."},{"name":"DAILYNAMAZUO03103","text":"Specifically, I find myself in need of more steppe mica. Yes, yes. Can you bring me three fairly large chunks? I have had success finding deposits east of Mol Iloh."},{"name":"DAILYNAMAZUO03103","text":"Specifically, I find myself in need of more steppe safflower. Yes, yes. Can you harvest some? I have had success looking in the lush patches southeast of Mol Iloh."},{"name":"DAILYNAMAZUO03103","text":"Specifically, I find myself in need of another khaal crab. Yes, yes. Can you bring me one? I have had success fishing for them with a bit of salmon roe in Hak Khaal."},{"name":"DAILYNAMAZUO03103","text":"Please return to me when you are ready. I will craft the finest of fineries, yes, yes."},{"name":"DAILYNAMAZUO03103","text":"Additional materials are there in the crate. I would assist you, but I recently got my whiskers caught in the lid. Yes, yes. I am taking a break from boxes."},{"name":"DAILYNAMAZUO03103","text":"Additional materials are there in the crate. I would assist you, but I recently got my whiskers caught in the lid. Yes, yes. I am taking a break from boxes."},{"name":"DAILYNAMAZUO03103","text":"Additional materials are there in the crate. I would assist you, but I recently got my whiskers caught in the lid. Yes, yes. I am taking a break from boxes."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03103","text":"Be safe out there! Dangers abound. Yes, yes. I would know."},{"name":"DAILYNAMAZUO03103","text":"Be safe out there! Dangers abound. Yes, yes. I would know."},{"name":"DAILYNAMAZUO03103","text":"Be safe out there! Dangers abound. Yes, yes. I would know."},{"name":"DAILYNAMAZUO03103","text":"Did everything go to plan? Are all of your assorted fingers intact?"},{"name":"DAILYNAMAZUO03103","text":"Thank you, thank you! I will fashion these into fineries and deliver them to the Mol forthwith."},{"name":"DAILYNAMAZUO03103","text":"Can I trouble you to relay my tribulations to Seigetsu the Enlightened? He doubtless wonders about the delay."},{"name":"DAILYNAMAZUO03103","text":"Stay safe. And do not get killed!"},{"name":"KOFUINSEIGETSU","text":"I take it you return with information?"},{"name":"KOFUINSEIGETSU","text":"Hm. Precisely as I imagined."},{"name":"KOFUINSEIGETSU","text":"He is a hardworking fellow, but a veritable beacon for misfortune. I daresay his poor luck alone could bring about the Namazu's annihilation."},{"name":"KOFUINSEIGETSU","text":"As for you, I have no doubt that your efforts this day will have a profound effect on the outcome of our festival, and contribute to the enlightenment of Namazu one and all. Probably."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22699","obj":{"i":22699,"n":"Finery Component Materials","l":145,"c":25919,"t":61}}]}