{"quest":{"name":"Pilgrim's Regress","location":"The Azim Steppe","id":68640,"patch":4.3,"sort":2,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"journal":["Seigetsu the Enlightened has a grand scheme up his wee sleeve.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “his whiskers” at the designated location near Chakha Zoh to show reverence for the Big One.","With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “his whiskers” at the designated location near Hak Khaal to show reverence for the Big One.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Aha. Just the long-legged associate I was searching for. I have devised an addition to our event schedule. A pilgrimage! I trust you are available to participate?"},{"name":"KOFUINSEIGETSU","text":"As you are doubtless aware, the Namazu tribe originated on this very steppe, and traces of our heritage remain to this day. The pilgrimage will involve paying visit to those spiritual locations where our ancestors once trod. Well, swam. You take my meaning."},{"name":"KOFUINSEIGETSU","text":"Our traditions include a particular orison: “In his whiskers' name.” Speak these words where the Hak Khaal cascades into the Sea of Blades, and at the shrine of Chakha Zoh. Of course, you are free to embellish on the prayer if you find it lacking in sophistication. I often do so myself."},{"name":"GUARD03104","text":"Here we honor noble Chakha, so she may rest ever in glory. Never shall those who come to pay respects be turned away."},{"name":"WORSHIPNAMAZUO03104","text":"This is apparently one of the Namazu's most holy, holiest of places. I will pray with gusto! In his whiskers' name, yes, yes."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing “his whiskers” to show your reverence for the Big One."},{"name":"GUARD03104","text":"Several Namazu have come here recently, speaking words solemn and strange─much like you did just now. It would seem that this place holds some significance to them."},{"name":"GUARD03104","text":"What that might be, I cannot imagine. Chakha Zoh enshrines the bones of the wyrmslayer Chakha, a woman bold yet wise. She was by no means an associate of the Namazu."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “his whiskers” to show your reverence for the Big One."},{"name":"WORSHIPNAMAZUO03104","text":"Oh, are you a fellow pilgrim? According to Seigetsu the Enlightened, long, long ago this was the site of a fierce battle between clansmen."},{"name":"WORSHIPNAMAZUO03104","text":"The victors became our Namazu ancestors. Yes, yes. The others swam down this waterfall in defeat, and eventually became underworld catfish. But could catfish really live beneath the ground? It seems unrealistic to me."},{"name":"GUARD03104","text":"The great wyrmslayer Chakha cannot possibly have had anything to do with the Namazu... Can she?"},{"name":"WORSHIPNAMAZUO03104","text":"I shudder to imagine how odd the underworld catfish must look!"},{"name":"KOFUINSEIGETSU","text":"I appreciate your cooperation in journeying to the locales I specified. Your efforts have played a vital role in convincing our participants that they are authentic spiritual sites."},{"name":"KOFUINSEIGETSU","text":"As always, I appreciate your cooperation in journeying to the locales I specified. Your efforts have played a vital role in convincing our participants that they are authentic spiritual sites."},{"name":"KOFUINSEIGETSU","text":"Please avert your disapproving glare. Pilgrimages require holy sites. It is hardly my fault that no written records regarding those of antiquity are extant."},{"name":"KOFUINSEIGETSU","text":"In any case, the authenticity of the sites is irrelevant so long as pilgrims have a meaningful spiritual experience on which to build. Hingan traditions may be sophisticated now, but their ancients found spirituality through the worship of mountains, trees, and even fish. Fish!"},{"name":"SAYTODO","text":"his whiskers"}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}}]}