{"quest":{"name":"Catching Catfish","location":"The Azim Steppe","id":68645,"patch":4.3,"sort":7,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22704],"journal":["Seigetsu the Enlightened needs an errant fisher to return to his duties.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu fisher.","Deliver the requested supplies to the Namazu fisher.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu fisher.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the Namazu fisher</span><span class=\"alternative\">Mine [Error] to the northeast of the Dawn Throne</span><span class=\"alternative\">Gather [Error] to the northeast of the Dawn Throne</span><span class=\"alternative\">Catch [Error] at Azim Khaat</span></span>.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"As we prepare for the festival, the committee members strive to outdo each other by procuring ever more unusual offerings. Some have started looking to local folktales for inspiration."},{"name":"KOFUINSEIGETSU","text":"One such story speaks of an enormous catfish which lurks in Azim Khaat. A self-proclaimed “master fisher” has left in search of the beast."},{"name":"KOFUINSEIGETSU","text":"However, this was some time ago, and he should have either caught it or conceded defeat by now. I would have him return posthaste, preferably with something to show for his expedition."},{"name":"KOFUINSEIGETSU","text":"Assist him with any means at your disposal. Or failing that, a swift kick in the direction of Dhoro Iloh will suffice."},{"name":"DAILYNAMAZUO03109","text":"Seigetsu is growing impatient is he? But I can't go back now! I've finally found the “Great Barbeled One!” The trouble is, she's taken a liking to my lures and has eaten them all."},{"name":"DAILYNAMAZUO03109","text":"So Seigetsu sent you to help me land this freshwater leviathan, the “Great Barbeled One,” did he?"},{"name":"DAILYNAMAZUO03109","text":"Perhaps you could wiggle those digits of yours and make me parts for some more catfish lures? You'll find the raw materials and whatnot in that crate."},{"name":"DAILYNAMAZUO03109","text":"Perhaps you could wiggle those digits of yours and make me parts for some more catfish lures? You'll find the raw materials and whatnot in that crate."},{"name":"DAILYNAMAZUO03109","text":"Perhaps you could make the scented, smelly things we attach to catfish lures? You'll find the raw materials and whatnot in that crate."},{"name":"DAILYNAMAZUO03109","text":"To make matters worse, I've run out of the shiny steppe geodes needed to make more lures! Wait─ Is that a pickaxe you've got there? Maybe you'd like to help a master fisher pursue his prey by mining the necessary twinkly things, yes, yes?"},{"name":"DAILYNAMAZUO03109","text":"To make matters worse, I've run out of the pretty yol feathers needed to make more lures! You smell like you're used to scrabbling around in the dirt, yes, yes? And good at finding things among the plants, I'll wager! Maybe your green fingers can gather some feathers for me!"},{"name":"DAILYNAMAZUO03109","text":"Think you can catch her all by yourself, do you? I don't suppose you'll fare any better than me, but I'd like to see you try, yes, yes! And since I'm feeling generous, I'll give you some advice: She seems to enjoy salmon roe..."},{"name":"DAILYNAMAZUO03109","text":"Bring them to me when you've finished!"},{"name":"DAILYNAMAZUO03109","text":"On the off chance you manage to land the “Great Barbeled One” before I do, bring her to me for inspection. I'll know if you try to deceive me!"},{"name":"DAILYNAMAZUO03109","text":"I brought a crate full of metallic, shiny bits for lures, forgetting that I can't make them myself. Very silly of me, yes, yes."},{"name":"DAILYNAMAZUO03109","text":"I brought a crate full of bits and pieces for making lures, forgetting that I can't do it myself. Very silly of me, yes, yes."},{"name":"DAILYNAMAZUO03109","text":"Ingredients for the smelly things I have, yes, yes. Knowledge and dexterity needed to make use of them, I have not. Quite the oversight, I'm sure you will agree."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03109","text":"Having trouble finding the shinies? There should be some to the northeast of Azim Khaat. Yes, yes."},{"name":"DAILYNAMAZUO03109","text":"Having trouble finding the feathers? There should be some to the northeast of Azim Khaat. Yes, yes."},{"name":"DAILYNAMAZUO03109","text":"Be careful not to fall into the lake. The “Great Barbeled One” will lose her appetite if she eats you, and I can't have that. No, no."},{"name":"DAILYNAMAZUO03109","text":"So, do you have something to show me?"},{"name":"DAILYNAMAZUO03109","text":"How goes your fishing? Caught something noteworthy, have you?"},{"name":"DAILYNAMAZUO03109","text":"Splendid! My success is all but a foregone conclusion now, yes, yes. You can run along to Seigetsu and tell him I'll be back with an offering so auspicious, he'll regret ever doubting me!"},{"name":"DAILYNAMAZUO03109","text":"Such a vast and impressive fish! I must admit, you've outdone me on this occasion."},{"name":"DAILYNAMAZUO03109","text":"But it's not over yet! As big as your catch is, I believe she is still a juvenile, judging by the growth rings on the fins. That means that larger adults must be nearby, yes, yes. The real “Great Barbeled One” yet lurks in these waters!"},{"name":"DAILYNAMAZUO03109","text":"I'll keep your fish here so that I can measure it against my own catches. Tell Seigetsu that I will only return when I have triumphed over a catfish fit for the festival!"},{"name":"DAILYNAMAZUO03109","text":"My true prize yet evades me. You go on ahead and tell Seigetsu to stop fretting!"},{"name":"KOFUINSEIGETSU","text":"So, anything to report?"},{"name":"KOFUINSEIGETSU","text":"He is still out there!? Instead of bringing him back, you have provided him with the means to waste even more time. And as for this so-called “Great Barbeled One,” I will believe it when I see it!"},{"name":"KOFUINSEIGETSU","text":"This is not the outcome I was hoping for. He now pursues a fish even larger and more elusive than his original target!"},{"name":"KOFUINSEIGETSU","text":"If this catfish is as gargantuan as he claims, he is likely to find himself dragged into the lake and swallowed whole. Not that it is any concern of mine, of course, but having one less pair of fins to deal with menial tasks would interfere with my plans to some degree."}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22704","obj":{"i":22704,"n":"Catfish Lure Component Materials","l":148,"c":25919,"t":61}}]}