{"quest":{"name":"Unidentified Festive Objects","location":"The Azim Steppe","id":68641,"patch":4.3,"sort":3,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22700],"journal":["Seigetsu the Enlightened appears to have a fresh monologue in store for you.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu contractor.","You have spoken with the Namazu contractor.<br>Deliver the requested supplies to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu contractor.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Seigetsu the Enlightened</span><span class=\"alternative\">Mine [Error] south of Chakha Zoh</span><span class=\"alternative\">Gather [Error] south of Chakha Zoh</span><span class=\"alternative\">Catch [Error] in Tao Khaal</span></span>."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Impeccable timing, <span class=\"highlight\">Forename</span>. Under my exhaustive scrutiny, <span class=\"emphasis\">The Chrysanthemum and the Dango</span>, page one hundred eighty-five, figure three, has revealed another important─I daresay indispensable─element of festival preparation. Purification of the venue!"},{"name":"KOFUINSEIGETSU","text":"If our event is to be a truly cultural affair, we mustn't neglect this preliminary ritual. Thus, I took the liberty of hiring a man to prepare the necessary implements─but I worry he fails to grasp their significance. Pray seek him at Tao Khaal and impress upon him the gravity of his task."},{"name":"DAILYNAMAZUO03105","text":"Seigetsu the Enlightened sent you? Thank goodness! He tasked me with assembling the most random assortment of objects. Please, please help me."},{"name":"DAILYNAMAZUO03105","text":"According to the list he gave me, we need a “sacred vessel for use in ablution and other ritual purification.” So you should make...a fancy jar? Yes, yes. You can help yourself to materials from this crate here."},{"name":"DAILYNAMAZUO03105","text":"According to the list he gave me, we need “textiles pale as snow.” So you should make...a white cloth? Yes, yes. You can help yourself to materials from this crate here."},{"name":"DAILYNAMAZUO03105","text":"According to the list he gave me, we need “distilled water for use in ablution and other ritual purification.” So you should make...fancy water? Yes, yes. You can help yourself to ingredients and whatnot from this crate here."},{"name":"DAILYNAMAZUO03105","text":"According to the list he gave me, we need “holy salt to cast out defilement.” Well, that certainly sounds difficult and time-consuming. How about you collect steppe rock salt from the deposits around Chakha Zoh? I am sure we can make a convincing argument as to its holiness. Yes, yes."},{"name":"DAILYNAMAZUO03105","text":"According to the list he gave me, we need “holy pine boughs for ritual wands.” Well, that certainly sounds difficult and time-consuming. How about you harvest verdant branches from the vegetation around Chakha Zoh? I am sure we can make a convincing argument as to their holiness. Yes, yes."},{"name":"DAILYNAMAZUO03105","text":"According to the list he gave me, we need a “fry suitable for the offering.” Well, I assume you will know it when you see it, so head over to Tao Khaal with some salmon roe, and fish until you catch one that looks right. Something that just seems to say “fish offering” to you."},{"name":"DAILYNAMAZUO03105","text":"Could you save me some trouble by making the delivery directly to Seigetsu the Enlightened? I would rather not spend several unpaid hours hearing about <span class=\"emphasis\">The Cardamom and the Dango</span>. No, no."},{"name":"DAILYNAMAZUO03105","text":"So if I find a stick, I can just glue on some paper, and... Oh! I am still looking for supplies to make the rest of these ritual items, but all the materials for your current task should already be in the crate. Yes, yes."},{"name":"DAILYNAMAZUO03105","text":"So if I find a stick, I can just glue on some paper, and... Oh! I am still looking for supplies to make the rest of these ritual items, but all the materials for your current task should already be in the crate. Yes, yes."},{"name":"DAILYNAMAZUO03105","text":"So if I find a stick, I can just glue on some paper, and... Oh! I am still looking for supplies to make the rest of these ritual items, but all the materials for your current task should already be in the crate. Yes, yes."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03105","text":"So if I find a stick, I can just glue on some paper, and... Oh! I am still working on the rest of these ritual items, yes, yes. But you need only worry about what I asked you to gather."},{"name":"DAILYNAMAZUO03105","text":"So if I find a stick, I can just glue on some paper, and... Oh! I am still working on the rest of these ritual items, yes, yes. But you need only worry about what I asked you to gather."},{"name":"DAILYNAMAZUO03105","text":"So if I find a stick, I can just glue on some paper, and... Oh! I am still working on the rest of these ritual items, yes, yes. But you need only worry about what I asked you to catch."},{"name":"DAILYNAMAZUO03105","text":"You are ready? Great! Please speak to Seigetsu the Enlightened. I am sure he will have many, many words for you."},{"name":"KOFUINSEIGETSU","text":"Did you two succeed in preparing the ceremonial paraphernalia?"},{"name":"KOFUINSEIGETSU","text":"Ah, thank you. This is just what we require for our purification ritual. Now we need only cleanse the grounds with pure water, scatter salt, offer a sacred <span class=\"emphasis\">tamagushi</span> branch to the kami, skewer a fish with this stick, and─"},{"name":"KOFUINSEIGETSU","text":"...Hm? You cannot comprehend the meaning behind these actions, you say? Fret not! Nor do I. That itself is proof of our sophistication."},{"name":"KOFUINSEIGETSU","text":"For what is culture, if not a collection of rituals both vague and peculiar? What defines civilization, if not the ability to expend effort on tasks of uncertain origin and purpose?"},{"name":"KOFUINSEIGETSU","text":"Indeed, our festival must aim for ever greater heights of incomprehensibility if we are to reach true enlightenment. Our course forward is clear!"}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22700","obj":{"i":22700,"n":"Ritual Component Materials","l":145,"c":25919,"t":61}}]}