{"quest":{"name":"Great Buuz Up","location":"The Azim Steppe","id":68649,"patch":4.3,"sort":10,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22708],"journal":["Seigetsu the Enlightened is frustrated by the workers' inability to function without food or sleep.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu cook.","Deliver the requested supplies to the Namazu cook.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu cook.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the Namazu cook</span><span class=\"alternative\">Mine [Error] to the south of Reunion</span><span class=\"alternative\">Gather [Error] to the south of Reunion</span><span class=\"alternative\">Catch [Error] at Nem Khaal</span></span>.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Sluggards! Layabouts! Good-for-nothing reprobates! The festival preparations will never be complete at this rate! When will they learn? They will be allowed rest, water, and nourishment when, and only when, their duties are complete! I require a solution to this quandary."},{"name":"KOFUINSEIGETSU","text":"The key, I believe, lies in <span class=\"emphasis\">Narrow Road through the Deep Grass</span>. It describes a traditional dish of the Azim Steppe known as “buuz,” a steamed bun with remarkable recuperative properties."},{"name":"KOFUINSEIGETSU","text":"Giving the workers buuz should temporarily revitalize them and ensure that the work is finished in time for the festival. The buuz will be made here in Dhoro Iloh, in exact accordance with the recipe outlined in my tome."},{"name":"KOFUINSEIGETSU","text":"I have tasked one of the Seven Hundred Seventy-Seven with gathering the necessary ingredients and apparatus. I want you to verify that he is acting precisely as instructed and not filling his face with marketplace fare."},{"name":"DAILYNAMAZUO03113","text":"&lt;munch&gt; Seigetsu sent you? &lt;munch&gt; No, no, I'm not sampling the delectable local cuisine, not at all. &lt;munch&gt; You're here to help with the buuz, yes, yes?"},{"name":"DAILYNAMAZUO03113","text":"I want to serve them freshly steamed, but for that I'll need a certain type of pot. Could you try making a couple from the metal things that I gathered? I was planning to buy some, but the money Seigetsu gave me mysteriously vanished. Yes, yes. &lt;belch&gt;"},{"name":"DAILYNAMAZUO03113","text":"I want to serve them freshly cooked, but for that I'll need some special bamboo steamers. Could you try making a couple from the materials that I gathered? I was planning to buy some, but the money Seigetsu gave me mysteriously vanished. Yes, yes. &lt;belch&gt;"},{"name":"DAILYNAMAZUO03113","text":"Seigetsu specified that the dough should be made exactly as written in that book of his. You can do that for me, yes, yes? The necessary ingredients are in that crate."},{"name":"DAILYNAMAZUO03113","text":"Seigetsu wants to build a hearth for steaming the buuz and specified that we use steppe soapstones. Apparently, they can be found south of Reunion."},{"name":"DAILYNAMAZUO03113","text":"I've been told that we need something called a “steppe onion” but I'm clueless when it comes to plants. I've been told they grow south of Reunion, but I wouldn't know one if it jumped up and bit me on the barbel!"},{"name":"DAILYNAMAZUO03113","text":"Seigetsu's recipe uses grass shrimp that live in the Nem Khaal. But I'm much too exhausted for fishing. I can barely keep my eyes open as it is. Perhaps you could catch one for me? According to the locals, salmon roe is the best bait to use."},{"name":"DAILYNAMAZUO03113","text":"Please, you go on ahead. I'll be resting my tired fins here. I think I need a little nap after all that food I've been─I mean, all that hard work I've been doing!"},{"name":"DAILYNAMAZUO03113","text":"Do you need more materials? Please, take whatever you need. There'll be less for me to carry back that way. Yes, yes."},{"name":"DAILYNAMAZUO03113","text":"Do you need more materials? Please, take whatever you need. There'll be less for me to carry back that way. Yes, yes."},{"name":"DAILYNAMAZUO03113","text":"Do you need more ingredients? Please, take whatever you need. There'll be less for me to carry back that way. Yes, yes."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03113","text":"Struggling to find steppe soapstones? They should be nearby. Yes, yes."},{"name":"DAILYNAMAZUO03113","text":"Struggling to find steppe onions? They should be nearby. Yes, yes."},{"name":"DAILYNAMAZUO03113","text":"Have you been to Nem Khaal? I heard the grass shrimp are abundant."},{"name":"DAILYNAMAZUO03113","text":"&lt;yawn&gt; Oh, back so soon?"},{"name":"DAILYNAMAZUO03113","text":"Thank you! You've saved me a lot of hard work, yes, yes!"},{"name":"DAILYNAMAZUO03113","text":"Do you know, this isn't the first time we've eaten buuz. We once bought some in Reunion that were heavenly! If the buuz we make are even half as good, we are all in for a treat. Yes, yes!"},{"name":"DAILYNAMAZUO03113","text":"We actually tried to cook buuz before with buzzfly meat, but it was a catastrophe! Many of us were so sick we couldn't move for days. Hopefully this time there will be fewer casualties. Yes, yes."},{"name":"DAILYNAMAZUO03113","text":"I tried making a small batch of buuz before but the reception was...shall we say, lukewarm at best. I'm good at eating buuz, not so good at cooking them, it seems."},{"name":"DAILYNAMAZUO03113","text":"I think I'll ask some of the locals for advice before I start cooking. If I make a mess of things, I'll never hear the end of it! Could you tell Seigetsu I'll be back soon?"},{"name":"DAILYNAMAZUO03113","text":"It's unusual for Seigetsu to go to such lengths─rather, order someone else to go to such lengths─for the sake of us workers. Methinks he has ulterior motives. Yes, yes..."},{"name":"KOFUINSEIGETSU","text":"Well? Did you find him? What did he have to say for himself?"},{"name":"KOFUINSEIGETSU","text":"He seeks the counsel of local culinarians? Entirely unnecessary. He will prepare the buuz exactly as is detailed in <span class=\"emphasis\">Narrow Road through the Deep Grass</span>, to the letter."},{"name":"KOFUINSEIGETSU","text":"Trivialities such as “flavor” are of no concern. The sole objective is to keep the workers ali─I mean, motivated─long enough for my grand scheme to come to fruition. For your part in said scheme, you have my thanks."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22708","obj":{"i":22708,"n":"Buuz Cooking Paraphernalia Materials","l":148,"c":25919,"t":61}}]}