{"quest":{"name":"Free for Most","location":"The Azim Steppe","id":68643,"patch":4.3,"sort":5,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22702],"journal":["Seigetsu the Enlightened requires the help of someone with an average attention span.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the inattentive Namazu.","You have spoken with the inattentive Namazu.<br>Deliver the requested supplies to Seigetsu the Enlightened."],"objectives":["Speak with the inattentive Namazu.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Seigetsu the Enlightened</span><span class=\"alternative\">Mine [Error] in western Ceol Aen</span><span class=\"alternative\">Gather [Error] in western Ceol Aen</span><span class=\"alternative\">Catch [Error] in the lower Yat Khaal</span></span>."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"I say, <span class=\"highlight\">Forename</span>, attempting to organize seven hundred seventy-seven Namazu for this festival is like herding catfish! Despite my impassioned and captivating orations on the significance of our cultural renaissance, most wander off to nap in their jars before so much as donning a happi."},{"name":"KOFUINSEIGETSU","text":"Having─to my misfortune─grown up amongst these simpletons, I suspect we might elicit more enthusiasm were we to offer souvenirs. My brethren love nothing more than complimentary trinkets, no matter how useless. Thus, I designed <span class=\"emphasis\">uchiwa</span> fans that we can distribute to encourage participation."},{"name":"KOFUINSEIGETSU","text":"Alas, though I began instructing a fellow in their assembly, he trundled off midway through my explanation─with my crate of supplies, no less! It looked as if he was headed for the northern edge of Azim Khaat. You must locate him and ensure that he remembers to provide me the components I asked for."},{"name":"DAILYNAMAZUO03107","text":"...Hm? Did you say something? I was not paying attention. No, no. I was trying to remember why I am out here alone with this large crate. I have a feeling I came here for a reason. Yes...yes... Seigetsu the Enlightened needed something, I vaguely recall... Wait, who are you?"},{"name":"DAILYNAMAZUO03107","text":"He wants us to hammer out some decorative sheets of gold leaf as components for the uchiwa, you say? Aha! The mystery of the crate is solved at last! Let us grab some materials and get started."},{"name":"DAILYNAMAZUO03107","text":"He wants us to create the handles and backings for uchiwa, you say? Aha! The mystery of the crate is solved at last! Let us grab some materials and get started."},{"name":"DAILYNAMAZUO03107","text":"He wants us to create some adhesive for the uchiwa, you say? Aha! The mystery of the crate is solved at last! Let us grab some materials and get started."},{"name":"DAILYNAMAZUO03107","text":"He wants us to gather pure white silex so he can make glass beads, you say? But that still does not explain the mysterious crate! How about you mine silex from the deposits in western Ceol Aen while I investigate?"},{"name":"DAILYNAMAZUO03107","text":"He wants us to harvest steppe rattan for the uchiwa, you say? But that still does not explain the mysterious crate! How about you gather rattan from the vegetation in western Ceol Aen while I investigate?"},{"name":"DAILYNAMAZUO03107","text":"He wants copperfish scales to decorate the uchiwa, you say? But that still does not explain the mysterious crate! How about you catch a crimson copperfish in Yat Khaal while I investigate? You will have no trouble if you use salmon roe. Mmm, salmon roe..."},{"name":"DAILYNAMAZUO03107","text":"You can speak to Seigetsu the Enlightened when you are done. I am sure he aims to have those uchiwa made as quickly as possible. By the way, what is an uchiwa?"},{"name":"DAILYNAMAZUO03107","text":"...Uchiwa, you say? What uchiwa? Oh, <span class=\"emphasis\">those</span> uchiwa. Yes, yes, we have materials in the crate. Help yourself."},{"name":"DAILYNAMAZUO03107","text":"...Uchiwa, you say? What uchiwa? Oh, <span class=\"emphasis\">those</span> uchiwa. Yes, yes, we have materials in the crate. Help yourself."},{"name":"DAILYNAMAZUO03107","text":"...Uchiwa, you say? What uchiwa? Oh, <span class=\"emphasis\">those</span> uchiwa. Yes, yes, we have materials in the crate. Help yourself."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03107","text":"...Uchiwa, you say? What uchiwa? Oh, <span class=\"emphasis\">those</span> uchiwa. Yes, yes, you will need to give what you gather to Seigetsu the Enlightened."},{"name":"DAILYNAMAZUO03107","text":"...Uchiwa, you say? What uchiwa? Oh, <span class=\"emphasis\">those</span> uchiwa. Yes, yes, you will need to give what you gather to Seigetsu the Enlightened."},{"name":"DAILYNAMAZUO03107","text":"...Uchiwa, you say? What uchiwa? Oh, <span class=\"emphasis\">those</span> uchiwa. Yes, yes, you will need to give what you gather to Seigetsu the Enlightened."},{"name":"DAILYNAMAZUO03107","text":"...Wait, you mean I was supposed to be preparing things too? Oh, bother. Please head back without me, then."},{"name":"KOFUINSEIGETSU","text":"I presume that you, at least, managed to focus on the task at hand?"},{"name":"KOFUINSEIGETSU","text":"Excellent work. I am confident that providing colorful uchiwa free of charge will attract Namazu to our festival in droves. As much as I disdain their simplemindedness, it does have its uses."},{"name":"KOFUINSEIGETSU","text":"Excellent work─I will have these materials processed posthaste. I am confident that providing colorful uchiwa free of charge will attract Namazu to our festival in droves. As much as I disdain their simplemindedness, it does have its uses."},{"name":"KOFUINSEIGETSU","text":"And, I might add, these shows of benevolence are vital if I am to lead the Namazu from the mire of ignorance in which they languish. As <span class=\"emphasis\">The Princeling</span> so astutely advises, a leader should be both feared <span class=\"emphasis\">and</span> loved by the masses!"}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22702","obj":{"i":22702,"n":"Uchiwa Component Materials","l":145,"c":25919,"t":61}}]}