{"quest":{"name":"Ghosts of Honor","location":"The Azim Steppe","id":68647,"patch":4.3,"sort":9,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22706],"journal":["Seigetsu the Enlightened hopes to enlist the aid of ancient Namazu spirits.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu steward.","You have spoken with the Namazu steward.<br>Deliver the requested supplies to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu steward.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Seigetsu the Enlightened</span><span class=\"alternative\">Mine [Error] to the south of Chakha Zoh</span><span class=\"alternative\">Gather [Error] to the south of Chakha Zoh</span><span class=\"alternative\">Deliver [Error] Seigetsu the Enlightened</span><span class=\"alternative\">Catch [Error] at Tao Khaal</span></span>."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"<span class=\"emphasis\">The Chrysanthemum and the Dango</span> describes a Hingan ritual in which the spirits of their ancestors are beckoned into the home to ensure a bountiful harvest."},{"name":"KOFUINSEIGETSU","text":"We will perform these selfsame rites here in Dhoro Iloh. Should the souls of our forebears answer the call, their divine protection may prove instrumental in averting our impending doom."},{"name":"KOFUINSEIGETSU","text":"One of the Seven Hundred Seventy-Seven is searching the plains for the necessary offerings. As this was not originally a custom of the Namazu, there may be matters best handled by someone with...hands. Think of it as another opportunity to prove your usefulness!"},{"name":"DAILYNAMAZUO03111","text":"Did Gyofun...I mean, Seigetsu the Enlightened send you? I'm so inundated with tasks, I can't possibly manage them alone. I need your help!"},{"name":"DAILYNAMAZUO03111","text":"We need traditional serving trays to present the food for the kami! Please, look inside that crate and see if there's anything you can use!"},{"name":"DAILYNAMAZUO03111","text":"We need a traditional serving mat to present the offerings! Please, look inside that crate and see if there's anything you can use!"},{"name":"DAILYNAMAZUO03111","text":"We need traditional delicacies to present as offerings! Please, look inside that crate and see if there's anything you can use!"},{"name":"DAILYNAMAZUO03111","text":"I was told to gather steppe clay for making traditional Hingan crockery. You'll go and get some for me, won't you? Try searching a little south of Chakha Zoh. Yes, yes."},{"name":"DAILYNAMAZUO03111","text":"I was told to gather ingredients for traditional Hingan dishes, but I can't find any edible buds! I heard they grow south of Chakha Zoh, but I couldn't find any for the life of me. Perhaps you will have better luck. Yes, yes."},{"name":"DAILYNAMAZUO03111","text":"We need a steppe sweetfish, the centerpiece of the offerings! Could you catch one from Tao Khaal? Apparently, they are drawn to the smell of salmon roe. Yes, yes."},{"name":"DAILYNAMAZUO03111","text":"When you're done, please go straight to Seigetsu. He is insistent that he is the only one capable of arranging the offerings as tradition dictates. Yes, yes."},{"name":"DAILYNAMAZUO03111","text":"Did you have a mishap? Not to worry, there are more materials in the crate."},{"name":"DAILYNAMAZUO03111","text":"Did you have a mishap? Not to worry, there are more materials in the crate."},{"name":"DAILYNAMAZUO03111","text":"So the delicacy didn't turn out as well as you'd hoped? Not to worry, there are more ingredients in the crate."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03111","text":"You can't find any steppe clay? Try looking south of Chakha Zoh."},{"name":"DAILYNAMAZUO03111","text":"You can't find any edible buds? Try looking south of Chakha Zoh."},{"name":"DAILYNAMAZUO03111","text":"Are the steppe sweetfish eluding you? There should be plenty in Tao Khaal. Yes, yes."},{"name":"DAILYNAMAZUO03111","text":"You've done ever so well! I'm sure Seigetsu will approve. Yes, yes."},{"name":"KOFUINSEIGETSU","text":"Do you have something to present to me?"},{"name":"KOFUINSEIGETSU","text":"Let me see... Yes, yes, perfectly adequate. Once the offerings have been suitably blessed and arranged, all that will remain is to perform the ritual itself."},{"name":"KOFUINSEIGETSU","text":"Part of the ceremony involves enacting a banquet as though our long-dead ancestors are corporeally present. The process is extremely lengthy and involves chanting in an ancient Hingan tongue."},{"name":"KOFUINSEIGETSU","text":"I dare not entrust such a delicate task to any of my Namazu brethren, who would no doubt botch the incantations and leave us all cursed to eternal damnation."}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22706","obj":{"i":22706,"n":"Hingan Ritual Paraphernalia Materials","l":148,"c":25919,"t":61}}]}