{"quest":{"name":"Carving a Niche","location":"The Azim Steppe","id":68648,"patch":4.3,"sort":13,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22707],"journal":["Seigetsu the Enlightened has discovered a new use for dzo horns.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Oroniri dzoherd.","Deliver the requested supplies to the Oroniri dzoherd.","Deliver the sturdy dzo horn to Seigetsu the Enlightened."],"objectives":["Speak with the Oroniri dzoherd.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the Oroniri dzoherd</span><span class=\"alternative\">Mine [Error] to the northeast of the Dawn Throne</span><span class=\"alternative\">Gather [Error] to the northeast of the Dawn Throne</span><span class=\"alternative\">Catch [Error] at Azim Khaat</span></span>.","Deliver the sturdy dzo horn to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"One particular custom I wish to include in our festival involves the parading of several mikoshi. But this is not like before, no, no. Each will be carried by a group of Namazu and made to crash into the other mikoshi, as tradition dictates."},{"name":"KOFUINSEIGETSU","text":"In contrast to the boisterous and potentially dangerous nature of this practice, the mikoshi themselves are intricately carved and lavishly decorated. However, we lack the proper tools."},{"name":"KOFUINSEIGETSU","text":"I believe we can avoid wasting coin on such instruments by fabricating our own from a dzo horn. One should provide enough raw material for several chisels. All I ask is your assistance in obtaining said horn from a local dzoherd."},{"name":"KOFUINSEIGETSU","text":"I have arranged a meeting between yourself and one such individual at the Dawn Throne. Perhaps you can offer your services in exchange for the goods we seek?"},{"name":"DAILYORONIR03112","text":"Are you here for the dzo horn? No need to explain─ The little squeaking fellow told me all about it."},{"name":"DAILYORONIR03112","text":"I have been a dzoherd for twenty years─as a boy and then a man. Yet never have I heard tell of their horns being fashioned into tools."},{"name":"DAILYORONIR03112","text":"When a dzo is slaughtered, nothing goes to waste. Every part has value, so I cannot simply give you what you seek. I propose a trade."},{"name":"DAILYORONIR03112","text":"Dzos are covered in thick, coarse hair which cannot be allowed to grow too long. The shears wear down quickly and must be replaced. Take what you need from this box and craft new blades."},{"name":"DAILYORONIR03112","text":"Dzos are covered in thick, coarse hair which cannot be allowed to grow too long. Shear handles break with much use, and we are in need of more. Take what you need from this box and craft replacements."},{"name":"DAILYORONIR03112","text":"Dzos are covered in thick, coarse hair which cannot be allowed to grow too long. We use honing oil to keep our shears sharp. If you can prepare some more oil with the ingredients in this box, the horn is yours."},{"name":"DAILYORONIR03112","text":"Dzos are covered in thick, coarse hair which cannot be allowed to grow too long. We use steppe whetstones to keep our shears sharp. Bring me two and we have a deal. They can be found to the northeast of the Dawn Throne."},{"name":"DAILYORONIR03112","text":"You have come at a good time. We are in need of grazing grass used in dzo feed. Bring me some and we have a deal. You will find it to the northeast of the Dawn Throne."},{"name":"DAILYORONIR03112","text":"You have come at a good time. We are in need of fish oil used in dzo feed. Although dzos only eat plants and grasses, the oil aids their digestion. Go to Azim Khaat and catch a greasy strangler. Our fishers normally use salmon roe as bait."},{"name":"DAILYORONIR03112","text":"When you are ready to trade, come to me."},{"name":"DAILYORONIR03112","text":"If you need more materials, help yourself."},{"name":"DAILYORONIR03112","text":"If you need more materials, help yourself."},{"name":"DAILYORONIR03112","text":"If you need more ingredients, help yourself."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYORONIR03112","text":"Did you try looking to the northeast of the Dawn Throne?"},{"name":"DAILYORONIR03112","text":"Did you try looking to the northeast of the Dawn Throne?"},{"name":"DAILYORONIR03112","text":"If you are thinking about jumping down to Azim Khaat, look before you leap. The rocks below have claimed the lives of many a young fool."},{"name":"DAILYORONIR03112","text":"Do you have what I need?"},{"name":"DAILYORONIR03112","text":"Exactly what I was looking for! Your efforts are much appreciated."},{"name":"DAILYORONIR03112","text":"And now for me to fulfill my part of the bargain."},{"name":"DAILYORONIR03112","text":"I suppose you will be returning to Dhoro Iloh now? Please tell your friends that I would welcome similar exchanges in the future."},{"name":"DAILYORONIR03112","text":"I hope that the dzo horn tools serve their purpose. This could be the beginning of a new trade for me."},{"name":"KOFUINSEIGETSU","text":"If you've brought the horn, I will inspect it immediately."},{"name":"KOFUINSEIGETSU","text":"Yes, this appears to be of an acceptable standard. Once again, I have demonstrated remarkable foresight in selecting you for this task. Now I must choose which of my minions will be transforming this horn into tools for carving the mikoshi."},{"name":"KOFUINSEIGETSU","text":"You may ask why we are putting so much effort into creating such ornate mikoshi if they are destined to be smashed to pieces. They are merely a means to end."},{"name":"KOFUINSEIGETSU","text":"Through their construction we further our abilities as artisans. The hoisting, chanting, and violent collisions display the vim and vigor of the Namazu."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22707","obj":{"i":22707,"n":"Dzo Shear Component Materials","l":148,"c":25919,"t":61}}]}