{"quest":{"name":"Simpler Gifts","location":"The Azim Steppe","id":68644,"patch":4.3,"sort":6,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22703],"journal":["Seigetsu the Enlightened has a missing Namazu case on his fins.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the affable Namazu.","Deliver the requested supplies to the affable Namazu.","Deliver the sack of finmade trinkets to Baavgai.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the affable Namazu.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the affable Namazu</span><span class=\"alternative\">Mine [Error] in western Ceol Aen</span><span class=\"alternative\">Gather [Error] in western Ceol Aen</span><span class=\"alternative\">Catch [Error] in Tao Khaal</span></span>.","Deliver the sack of finmade trinkets to Baavgai.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"<span class=\"highlight\">Forename</span>, do you comprehend the true essence of “civilization”? Indeed, culture is a vital element─but so is society. There can be no civilization without advanced relationships between individuals and, I assert, peoples."},{"name":"KOFUINSEIGETSU","text":"Yes, what makes a group civilized is its productive interactions with others. Moreover, history shows that those who eschew relationships with neighboring societies do so not just to their detriment, but at their peril."},{"name":"KOFUINSEIGETSU","text":"That is why I have taken the initiative in preparing gifts for our neighbors, the Uyagir. Their goodwill is essential not only to the success of our festival, but to the enlightenment of Namazu one and all!"},{"name":"KOFUINSEIGETSU","text":"I sent the most affable fellow I could find to make the delivery. I am certain that of the six dozen or so Namazu I interviewed, he would be the last to cause offense. And yet, I cannot shake the feeling that something has gone awry─I cannot rest until you, personally, make for Ceol Aen to find him!"},{"name":"DAILYNAMAZUO03108","text":"It is an absolute pleasure to meet you, my friend! And you are here at the behest of Seigetsu the Enlightened, you say? Why, thank you very much! I truly appreciate your coming to my aid."},{"name":"DAILYNAMAZUO03108","text":"You see, I came to deliver gifts to our dear neighbors, the Uyagir. Wonderful people, absolutely delightful. Yes, yes. Unfortunately, it seems the gifts we prepared are too luxurious, and they feel uncomfortable accepting them!"},{"name":"DAILYNAMAZUO03108","text":"Of course, it will not do to make them uncomfortable! But I also cannot bear to leave them deprived and giftless. No, no. I hate to trouble you, but would you mind helping me make something more suitable?"},{"name":"DAILYNAMAZUO03108","text":"Oh, thank you, thank you! My hope is that less gaudy trinkets will please them. With that in mind, could you make some unadorned jars, perhaps? I would greatly appreciate it. You can help yourself to anything you need from the crate over there."},{"name":"DAILYNAMAZUO03108","text":"Oh, thank you, thank you! My hope is that less gaudy trinkets will please them. With that in mind, could you make some plain fabric, perhaps? I would greatly appreciate it. You can help yourself to anything you need from the crate over there."},{"name":"DAILYNAMAZUO03108","text":"Oh, thank you, thank you! My hope is that less gaudy trinkets will please them. With that in mind, could you make some natural dyes, perhaps? I would greatly appreciate it. You can help yourself to anything you need from the crate over there."},{"name":"DAILYNAMAZUO03108","text":"Oh, thank you, thank you! My hope is that less gaudy trinkets will please them. With that in mind, can you bring me some inexpensive materials─some steppe copper ore, perhaps? I would greatly appreciate it. You will find deposits here in western Ceol Aen."},{"name":"DAILYNAMAZUO03108","text":"Oh, thank you, thank you! My hope is that less gaudy trinkets will please them. With that in mind, can you bring me some inexpensive materials─some steppe vines, perhaps? I would greatly appreciate it. You should be able to harvest them here in western Ceol Aen."},{"name":"DAILYNAMAZUO03108","text":"Oh, thank you, thank you! My hope is that less gaudy trinkets will please them. I need fish bones to make what I have in mind, so could you bring a zagas a'khaal, perhaps? I would greatly appreciate it. They are common in Tao Khaal, so you should be able to catch one with plain salmon roe."},{"name":"DAILYNAMAZUO03108","text":"Please let me know when you are done, and I will assemble the gifts posthaste. I look forward to working with you!"},{"name":"DAILYNAMAZUO03108","text":"Ah, have you run out of materials? If so, please do not hesitate to utilize the crate! What is mine is yours, yes, yes."},{"name":"DAILYNAMAZUO03108","text":"Ah, have you run out of materials? If so, please do not hesitate to utilize the crate! What is mine is yours, yes, yes."},{"name":"DAILYNAMAZUO03108","text":"Ah, have you run out of materials? If so, please do not hesitate to utilize the crate! What is mine is yours, yes, yes."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03108","text":"I hope you have no trouble finding what I asked of you. Feel free to take a break if you need to─do not overwork yourself on my account!"},{"name":"DAILYNAMAZUO03108","text":"I hope you have no trouble finding what I asked of you. Feel free to take a break if you need to─do not overwork yourself on my account!"},{"name":"DAILYNAMAZUO03108","text":"I hope you have no trouble finding what I asked of you. Feel free to take a break if you need to─do not overwork yourself on my account!"},{"name":"DAILYNAMAZUO03108","text":"<span class=\"highlight\">Forename</span>, my friend! How are things coming along with you?"},{"name":"DAILYNAMAZUO03108","text":"Oh, wonderful! I am so glad for your help. I find that work always goes faster with a cheerful companion, yes, yes. Now let me just add this to what I have, and..."},{"name":"DAILYNAMAZUO03108","text":"There we go. These trinkets should be simple enough to suit Uyagiri tastes, and have been finmade with love! I do hope they enjoy them."},{"name":"DAILYNAMAZUO03108","text":"You have been so helpful─would you like to take these to Baavgai of the Uyagir? Considering how much effort you have put into the gifts, you should be the one to deliver them!"},{"name":"DAILYNAMAZUO03108","text":"Please go ahead and give our finmade trinkets to the Uyagir."},{"name":"BAAVGAI","text":"What can I do for you, traveler?"},{"name":"BAAVGAI","text":"A gift from the Namazu? Hmmm, let me see..."},{"name":"BAAVGAI","text":"Yes, we should be able to accept these, if you wish. Though I can see they were made with care, they are not so extravagant as to tempt us down our ancestors' path."},{"name":"BAAVGAI","text":"I apologize if our strict ways make us seem ungrateful. The unbridled greed of our forefathers led our tribe to ruin, so we must be vigilant not to repeat their mistakes."},{"name":"BAAVGAI","text":"The Namazu, on the other hand, seem willing to give freely. Of their possessions, as well as their friendship. I think they will do well."},{"name":"BAAVGAI","text":"Though joining their festival would be too much of an indulgence, we will be praying for their success. Please tell them we send our thanks."},{"name":"KOFUINSEIGETSU","text":"Did you find the good fellow?"},{"name":"KOFUINSEIGETSU","text":"Ah, so he was detained designing gifts more to Uyagiri tastes. <span class=\"emphasis\">Narrow Road through the Deep Grass</span> mentioned their preference for simplicity, but I did not anticipate how stringent their requirements would be."},{"name":"KOFUINSEIGETSU","text":"As always, I appreciate your assistance in strengthening our ties with the Xaela. It is undoubtedly the enlightened thing to do!"}],"reward":{"gil":680,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22703","obj":{"i":22703,"n":"Trinket Component Materials","l":145,"c":25919,"t":61}}]}