{"quest":{"name":"Carry That Crate","location":"The Azim Steppe","id":68642,"patch":4.3,"sort":4,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22701],"journal":["Seigetsu the Enlightened is trying hard to appear contemplative.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the willful Namazu.","You have spoken with the willful Namazu.<br>Deliver the requested supplies to Seigetsu the Enlightened."],"objectives":["Speak with the willful Namazu.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Seigetsu the Enlightened</span><span class=\"alternative\">Mine [Error] in western Ceol Aen</span><span class=\"alternative\">Gather [Error] in western Ceol Aen</span><span class=\"alternative\">Catch [Error] in the upper Yat Khaal</span></span>."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Doth the sun, in her midday glory, outshine the moon of a night silent and solitary? No, of course I am not interested in your opinion. I was simply waxing poetic."},{"name":"KOFUINSEIGETSU","text":"The inspiration for my lyrical musings, if you must know, is our latest festival conundrum. We have decided to keep the festival running through the night, and Gyoshin now clamors ceaselessly for more brazier components."},{"name":"KOFUINSEIGETSU","text":"I have assigned the task of acquiring said components to one of our volunteers already, but perhaps you had best assist him. Why he insisted on bearing a massive crate of materials out to Ceol Aen is beyond me, but it should make finding him a simple matter."},{"name":"DAILYNAMAZUO03106","text":"Why the...&lt;wheeze&gt;...cumbersome crate, you ask? Because I might need something in it! It is more efficient to gather and craft in the same place, yes...&lt;wheeze&gt;...yes. I just need to find a good spot to set up..."},{"name":"DAILYNAMAZUO03106","text":"Can you start on the brazier components while I rest my fins? We need sturdy metal stands to prevent any bumblers from knocking them over...again. I have all of the materials you will need in my crate here. See? Useful."},{"name":"DAILYNAMAZUO03106","text":"Can you start on the brazier components while I rest my fins? We need eye-catching embellishments to prevent anyone from bumbling into the braziers and knocking them over...again. I have all of the materials you will need in my crate here. See? Useful."},{"name":"DAILYNAMAZUO03106","text":"Can you start on the brazier components while I rest my fins? We need paraffin oil to keep them ablaze all night, every night, or someone might hurt himself...again. I have all of the ingredients you will need in my crate here. See? Useful."},{"name":"DAILYNAMAZUO03106","text":"Can you start collecting more brazier components while I rest my fins? We need steppe coal to keep them ablaze all night, every night, or someone might hurt himself...again. There should be deposits of it in western Ceol Aen."},{"name":"DAILYNAMAZUO03106","text":"Can you start collecting more brazier components while I rest my fins? We need dry branches for fuel to keep them ablaze all night, every night, or someone might hurt himself...again. You should be able to harvest plenty from the vegetation in western Ceol Aen."},{"name":"DAILYNAMAZUO03106","text":"Can you start collecting more brazier components while I rest my fins? We need fatty eels to make the oil that keeps them ablaze all night, every night, or someone might hurt himself...again. You can catch one in the upper Yat Khaal if you've brought along any salmon roe."},{"name":"DAILYNAMAZUO03106","text":"You may make your delivery to Seigetsu the Enlightened directly. Not that I am reluctant to add more to the crate, no, no. I most certainly am capable of carrying everything back by myself. I just do not wish to deprive you of the experience."},{"name":"DAILYNAMAZUO03106","text":"If you run out of materials, there will certainly be more in the crate. Are you not glad that I brought it along?"},{"name":"DAILYNAMAZUO03106","text":"If you run out of materials, there will certainly be more in the crate. Are you not glad that I brought it along?"},{"name":"DAILYNAMAZUO03106","text":"If you run out of ingredients, there will certainly be more in the crate. Are you not glad that I brought it along?"},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03106","text":"You should be able to find what you need not too far from here. Yes, yes. In fact, I think this is the perfect spot! No need to bring the crate any further─though I could if I wanted to."},{"name":"DAILYNAMAZUO03106","text":"You should be able to find what you need not too far from here. Yes, yes. In fact, I think this is the perfect spot! No need to bring the crate any further─though I could if I wanted to."},{"name":"DAILYNAMAZUO03106","text":"You should be able to find what you need not too far from here. Yes, yes. In fact, I think this is the perfect spot! No need to bring the crate any further─though I could if I wanted to."},{"name":"DAILYNAMAZUO03106","text":"If you are ready, you can start back to Dhoro Iloh. Me? I am just fine. The crate is not too heavy for me, no, no. I am only catching my breath."},{"name":"KOFUINSEIGETSU","text":"How are the brazier components coming along?"},{"name":"KOFUINSEIGETSU","text":"Oh, fine work indeed. We can manage with this for the time being. If the stubborn fellow and his crate fail to return within a fortnight, I will send a party to forcibly retrieve him. I daresay something in that crate will suffice to knock him unconscious while they carry him back."},{"name":"KOFUINSEIGETSU","text":"The absence of that buffoon notwithstanding, your work today will doubtless be of aid in maintaining a festive atmosphere day and night for the next seven years."},{"name":"KOFUINSEIGETSU","text":"...You wonder why we do not rest on occasion? Oh, my dear <span class=\"highlight\">Forename</span>. Is there any symbol of civilization more universal than the fire that drives away the darkness? Enlightenment never sleeps!"}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22701","obj":{"i":22701,"n":"Brazier Component Materials","l":145,"c":25919,"t":61}}]}