{"quest":{"name":"Wood You Believe It","location":"The Azim Steppe","id":68646,"patch":4.3,"sort":8,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22705],"journal":["Seigetsu the Enlightened is in urgent need of timber.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with Gyorin.","Deliver the requested supplies to Gyorin.","Obtain the Yanxian timber.","Deliver the Yanxian timber to Seigetsu the Enlightened."],"objectives":["Speak with Gyorin.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Gyorin</span><span class=\"alternative\">Mine [Error] to the south of Reunion</span><span class=\"alternative\">Gather [Error] to the south of Reunion</span><span class=\"alternative\">Catch [Error] at Nem Khaal</span></span>.","Obtain the Yanxian timber.","Deliver the Yanxian timber to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"It appears a miscalculation has been made. But not by me─ Perish the thought!"},{"name":"KOFUINSEIGETSU","text":"The amount of timber we require for the festival far exceeds that which can be harvested within a reasonable distance of Dhoro Iloh. As you can see, although the Azim Steppe has an abundance of grass, trees are few and far between."},{"name":"KOFUINSEIGETSU","text":"As luck would have it, Gyorin has arrived in Reunion, bearing timber to barter for local goods. I took the liberty of arranging for you to meet him. However, I will leave the particulars of the trade to you."},{"name":"GYORIN","text":"Oh, <span class=\"highlight\">Forename</span>! What a pleasant surprise!"},{"name":"GYORIN","text":"I never imagined that you would be the one sent by Seigetsu the Egregious, or whatever he calls himself. Without further ado, let's get down to business, shall we? Yes, yes."},{"name":"GYORIN","text":"Back again, <span class=\"highlight\">Forename</span>? Need some more wood, do you?"},{"name":"GYORIN","text":"I'm not sure why you're still running errands for Seigetsu the Intolerable. Having said that, I am always thrilled to do business with one as well-mannered as yourself!"},{"name":"GYORIN","text":"I come in search of goods that my clients at The New Rich would find intriguing, and more importantly, be willing to purchase."},{"name":"GYORIN","text":"I notice that many inhabitants of the Azim Steppe wear exquisitely crafted necklaces that I believe would fetch a high price. I'd like you to craft enough pieces to make one. I can take care of the rest, yes, yes."},{"name":"GYORIN","text":"During my travels through the Azim Steppe, I have seen a variety of distinctive zukin, or “headdresses,” as you might call them. I'd like you to craft enough pieces to make one. I can take care of the rest, yes, yes."},{"name":"GYORIN","text":"Some of the locals partake in the imbibing of kumis. I have obtained a quantity of mare's milk, but I gather the fermentation process is rather complicated and involves a lot of stirring. Perhaps you can prepare the basic ingredients, yes, yes?"},{"name":"GYORIN","text":"The rocky outcrops in the southern parts of the Azim Steppe contain gems unlike those seen anywhere else, known as raw azimite. Bring a finful of these rarities to me and the timber is yours!"},{"name":"GYORIN","text":"The southern parts of the Azim Steppe are home to a valuable species of steppe candyfruit. Bring a few of these to me and the timber is yours!"},{"name":"GYORIN","text":"The Nem Khaal is teeming with rainbow killifish, native to this region. I'd like a sample to show my customers. Just one will suffice, yes, yes! I heard they like salmon roe, so try using that as bait."},{"name":"GYORIN","text":"I'll watch over the merchandise until you return."},{"name":"GYORIN","text":"You need more materials? Help yourself─ There are plenty more."},{"name":"GYORIN","text":"You need more materials? Help yourself─ There are plenty more."},{"name":"GYORIN","text":"Was there a problem with the fermentation? Not stirring vigorously enough, perhaps? I have more ingredients, so use as much as you need."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"GYORIN","text":"How goes your search?"},{"name":"GYORIN","text":"How goes your search?"},{"name":"GYORIN","text":"Have any of those rainbow killifish found their way onto your hook yet?"},{"name":"GYORIN","text":"Have you brought the goods I seek?"},{"name":"GYORIN","text":"Perfect! Now production of authentic local goods can begin!"},{"name":"GYORIN","text":"Customers from far and wide will flock to The New Rich for such fine wares. Yes, yes!"},{"name":"GYORIN","text":"If I can ensure a steady flow of stock from the Azim Steppe, my profits will go through the roof!"},{"name":"GYORIN","text":"You've kept your part of the bargain, so I will do likewise. This finest-quality Yanxian timber now belongs to the Seven Hundred Seventy-Seven."},{"name":"GYORIN","text":"Be sure to tell Seigetsu the Insufferable that I am willing to supply further shipments, although I would prefer to avoid dealing directly with that pompous nincompoop."},{"name":"GYORIN","text":"Can I rely on you to act as our intermediary, our go-between?"},{"name":"KOFUINSEIGETSU","text":"Would I be correct in assuming that our business with Gyorin has come to a satisfactory conclusion?"},{"name":"KOFUINSEIGETSU","text":"Ah, superlative work, <span class=\"highlight\">Forename</span>! While Gyorin may be an unsophisticated boor, his mercantile acumen is commendable, and he no doubt has access to other wares that would benefit our cause."},{"name":"KOFUINSEIGETSU","text":"As for the timber, I will put it to good use. And by that, I mean order my underlings to put it to good use."}],"reward":{"gil":680,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22705","obj":{"i":22705,"n":"Azim Steppe Souvenir Component Materials","l":148,"c":25919,"t":61}}]}