{"quest":{"name":"Give till It Hurts","location":"The Azim Steppe","id":68659,"patch":4.3,"sort":26,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22715],"journal":["Seigetsu the Enlightened seeks to share the gift of giving.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu sculptor.","You have spoken with the Namazu sculptor.<br>Deliver the requested supplies to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu sculptor.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Seigetsu the Enlightened</span><span class=\"alternative\">Mine [Error] at Mol Iloh</span><span class=\"alternative\">Gather [Error] at Mol Iloh</span><span class=\"alternative\">Catch [Error] at Hak Khaal</span></span>."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"I say, <span class=\"highlight\">Forename</span>. I happened upon the most curious of traditions in my study of <span class=\"emphasis\">Northward Bound: A Spiritual Journey</span>. This most illuminating of tomes recounts a ritual held on the outskirts of Ilsabard wherein townsfolk, mounted atop ceremonial floats, would assail passersby with produce from their very own storehouses!"},{"name":"KOFUINSEIGETSU","text":"Upon further reading, I discovered it is to celebrate a bountiful harvest. So bountiful, in fact, there is a surplus to shower upon the masses. Though the number of casualties seems to increase with each passing year, one cannot deny their pure intentions. Indeed, it is a tradition of beneficence. One we Namazu would do well to adopt on our path to enlightenment."},{"name":"KOFUINSEIGETSU","text":"Alas, we have no harvests to boast of, let alone any surplus. Which is why we will use fincrafted goods instead. If you would consent to help in our preparations, pray travel east to the Path of the Craven. You will find one of my kin there gathering supplies."},{"name":"DAILYNAMAZUO03123","text":"Another helping hand sent by Seigetsu the Enlightened? Tell me, what hidden shame has he threatened to bring to light? Your secret's safe with me. Yes, yes."},{"name":"DAILYNAMAZUO03123","text":"You came of your own volition!? Truly you are a saint─an angel sent from on high. Between your hands and my fins we should finish in no time."},{"name":"DAILYNAMAZUO03123","text":"While I continue gathering supplies, could I trouble you to craft a figurine resembling fruit? Persimmons, plums─any fruit will do. Everything you need is in the crate there."},{"name":"DAILYNAMAZUO03123","text":"While I continue gathering supplies, could I trouble you to craft a figurine resembling fruit? Persimmons, plums─any fruit will do. Everything you need is in the crate there."},{"name":"DAILYNAMAZUO03123","text":"While I continue gathering supplies, could I trouble you to craft a figurine resembling fruit? Persimmons, plums─any fruit will do. Everything you need is in the crate there."},{"name":"DAILYNAMAZUO03123","text":"While I continue gathering supplies here, could I trouble you to mine a chunk of ultramarine ore from Mol Iloh? Preferably something resembling fruit."},{"name":"DAILYNAMAZUO03123","text":"While I continue gathering supplies here, could I trouble you to procure a melon from Mol Iloh? It needn't be appetizing, but it must be rock hard."},{"name":"DAILYNAMAZUO03123","text":"While I continue gathering supplies here, could I trouble you to catch a spearhead snail from Hak Khaal? If you use a pot of salmon roe they'll practically jump out of the water. Yes, yes. Personally, I find them revolting, but thankfully they're not for us."},{"name":"DAILYNAMAZUO03123","text":"When you've finished, take it straight back to Dhoro Iloh. &lt;shudder&gt; I'd hate to get hit in the eye with any of these."},{"name":"DAILYNAMAZUO03123","text":"Seigetsu means well, but I fear the others do not yet understand what these goods will be used for. When the festivities begin, I think I'll stay here. Safe and out of the line of fire."},{"name":"DAILYNAMAZUO03123","text":"Something the matter? If you require more materials, you're more than welcome to what's in the crate."},{"name":"DAILYNAMAZUO03123","text":"Something the matter? If you require more materials, you're more than welcome to what's in the crate."},{"name":"DAILYNAMAZUO03123","text":"Something the matter? If you require more materials, you're more than welcome to what's in the crate."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03123","text":"I'm positive there are deposits of ultramarine ore somewhere in Mol Iloh. Hopefully you'll find something that suits our needs without much trouble."},{"name":"DAILYNAMAZUO03123","text":"The melons that grow in Mol Iloh should suit our needs. You'll find nothing tougher in all of the Steppe."},{"name":"DAILYNAMAZUO03123","text":"You're certain to find spearhead snails along the Hak Khaal river. All you need is a pot of salmon roe and a little patience."},{"name":"DAILYNAMAZUO03123","text":"Oh my! Seigetsu will be most pleased. Yes, yes. No need to dally about here. Go and take that to Dhoro Iloh."},{"name":"KOFUINSEIGETSU","text":"Preparations here are coming along nicely. Have you anything to contribute?"},{"name":"KOFUINSEIGETSU","text":"Ah, excellent. Our store of wares is not yet sufficient for the event, but soon we will be ready."},{"name":"KOFUINSEIGETSU","text":"I can picture it now, my kin astride a majestic float, bombarding passersby with all manner of food and figurines. It will be a celebration for the ages!"},{"name":"KOFUINSEIGETSU","text":"A pity I won't be able to participate. Why, if I were to be injured, who would oversee the rest of the festival?"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"Normal-quality items gathered in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":7,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22715","obj":{"i":22715,"n":"Pristine Fruit Figurine Materials","l":150,"c":25919,"t":61}}]}