{"quest":{"name":"A Stable's Condition","location":"The Azim Steppe","id":68652,"patch":4.3,"sort":20,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22710],"journal":["Seigetsu the Enlightened requires your assistance with some festival preparations.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu horse handler.","You have spoken with the Namazu horse handler.<br>Deliver the requested supplies to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu horse handler.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Seigetsu the Enlightened</span><span class=\"alternative\">Mine [Error] to the south of Chakha Zoh</span><span class=\"alternative\">Gather [Error] to the south of Chakha Zoh</span><span class=\"alternative\">Catch [Error] at Tao Khaal</span></span>."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"<span class=\"highlight\">Forename</span>, do you recall the horse racing tradition shared with us by the Mol? Well, we should like to continue with our own ceremonial races, but by my educated estimations, we are lacking certain supplies vital for the care of our horses."},{"name":"KOFUINSEIGETSU","text":"Whilst my own knowledge in such areas is purely theoretical, I imagine that you, as a productive member of the civilized races, would find the practice of raising livestock a trivial affair, yes?"},{"name":"KOFUINSEIGETSU","text":"A fortunate thing indeed, for although I entrusted the gathering of said supplies to our appointed horse handler, I fear he has failed to return. I suspect he has encountered difficulties. Please look for him in the vicinity of Ceol Aen, and uncover the cause of this delay."},{"name":"DAILYNAMAZUO03116","text":"&lt;sigh&gt; I'm putting together as many of the stable supplies as I'm able, but I've not enough fins to handle all these tasks."},{"name":"DAILYNAMAZUO03116","text":"Would you mind making some horseshoes for me? The crate just there should hold everything you need."},{"name":"DAILYNAMAZUO03116","text":"Would you mind making some grooming brushes for me? The crate just there should hold everything you need."},{"name":"DAILYNAMAZUO03116","text":"Would you mind making some bridle oil for me? The crate just there should hold everything you need."},{"name":"DAILYNAMAZUO03116","text":"Would you mind digging up some steppe iron for me? We need it for making horseshoes. The rocks to the south of Chakha Zoh should have a vein or two you can mine."},{"name":"DAILYNAMAZUO03116","text":"Would you mind gathering some fodder for the horses? The foliage to the south of Chakha Zoh should do nicely. It's so dry, they call it “steppe hay,” apparently."},{"name":"DAILYNAMAZUO03116","text":"Would you mind finding some salmon roe for bait, and fishing up a moon oyster from Tao Khaal? It can be made into an ointment for soothing saddle sores and the like. Or so Seigetsu told me. At great length."},{"name":"DAILYNAMAZUO03116","text":"Once you've prepared these absolutely essential supplies, please deliver them directly to Seigetsu. I'll see that my share of the goods is not far behind!"},{"name":"DAILYNAMAZUO03116","text":"What's the matter? Have you misplaced your materials? There should be plenty more in my little crate. It's deceptively roomy!"},{"name":"DAILYNAMAZUO03116","text":"What's the matter? Have you misplaced your materials? There should be plenty more in my little crate. It's deceptively roomy!"},{"name":"DAILYNAMAZUO03116","text":"What's the matter? Have you misplaced your materials? There should be plenty more in my little crate. It's deceptively roomy!"},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03116","text":"There should be veins of steppe iron to the south of here. Keep an eye out!"},{"name":"DAILYNAMAZUO03116","text":"There should be patches of steppe hay to the south of here. Keep an eye out!"},{"name":"DAILYNAMAZUO03116","text":"There should be moon oysters in the waters of Tao Khaal. I hear with a little salmon roe, they jump right onto your hook!"},{"name":"DAILYNAMAZUO03116","text":"You have the supplies I asked of you? Then please make your delivery directly to Seigetsu before he comes to “enlighten” us on the merits of haste! "},{"name":"KOFUINSEIGETSU","text":"Ah, so you located our aspiring horse handler. ...Not flattened under a khun chuluu, was he?"},{"name":"KOFUINSEIGETSU","text":"Not enough fins to finish his tasks!? Well he cannot rely on you to pick up the slack every time a job proves too overwhelming. We shall have to discuss the allocation of his duties upon his return. At length."},{"name":"KOFUINSEIGETSU","text":"If things progress in this manner, I wonder if we shall ever prove suitable masters for our stables. With our stunted limbs, Namazu struggle to cling to a horse's back as it is, and we certainly cannot direct the beasts to gallop where we wish."},{"name":"KOFUINSEIGETSU","text":"On that front, I have been perusing the anatomical journals of past and present, researching a method for the permanent elongation of fins and legs. My current goal is to evolve our species to stand some eight heads tall."},{"name":"KOFUINSEIGETSU","text":"On the dawn that such an evolution is realized, the name of Seigetsu the Enlightened will be burned forever into the pages of Namazu history. I shall be lauded as a hero of our civilization, and you, my friend, might even gain a mention in the footnotes!"}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22710","obj":{"i":22710,"n":"Stable Supply Materials","l":150,"c":25919,"t":61}}]}