{"quest":{"name":"Surprise Offerings","location":"The Azim Steppe","id":68656,"patch":4.3,"sort":12,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22713],"journal":["Seigetsu the Enlightened would entrust you with a matter of some secrecy.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu procurer.","You have spoken with the Namazu procurer.<br>Deliver the requested supplies to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu procurer.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Seigetsu the Enlightened</span><span class=\"alternative\">Mine [Error] in the east of Mol Iloh</span><span class=\"alternative\">Gather [Error] in the east of Mol Iloh</span><span class=\"alternative\">Catch [Error] at Azim Khaat</span></span>."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"<span class=\"highlight\">Forename</span>, I have a special favor to ask of you. Our altar has frequent need of fresh offerings─fish, fruit, and the like─and we require your assistance in procuring replacements. But these must be no ordinary offerings..."},{"name":"KOFUINSEIGETSU","text":"Our head procurer will provide you with the details of your task─you will find him absorbed in his work near the Path of the Craven. ...Oh, and <span class=\"highlight\">Forename</span>? Pray keep this request confidential, if you would."},{"name":"DAILYNAMAZUO03120","text":"Seigetsu sent you, yes, yes? Thank the Big One! I need an expert─a veteran in the field─to handle one of the more challenging aspects of the procurement."},{"name":"DAILYNAMAZUO03120","text":"To be more specific, I need you to craft a high-quality metal fish sculpture for our altar offerings. As convincingly real as possible! Feel free to raid my supply crate for anything you need."},{"name":"DAILYNAMAZUO03120","text":"To be more specific, I need you to craft a high-quality imitation flower for our altar offerings. As convincingly real as possible! Feel free to raid my supply crate for anything you need."},{"name":"DAILYNAMAZUO03120","text":"To be more specific, I need you to craft a high-quality hot pepper ball. As excruciatingly spicy as possible! Feel free to raid my supply crate for anything you need."},{"name":"DAILYNAMAZUO03120","text":"To be more specific, I need you to mine some pieces of jade that could be mistaken for kusamochi─you know those green-colored rice cake treats? The all-knowing Seigetsu mentioned deposits are to be found to the east of Mol Iloh."},{"name":"DAILYNAMAZUO03120","text":"To be more specific, I need you to harvest some wild steppe radishes─I hear they feel like hot coals on your tongue. According to Seigetsu and his infallible research, such peppery vegetables can be found growing in the east of Mol Iloh."},{"name":"DAILYNAMAZUO03120","text":"To be more specific, I need you to locate some salmon roe and use it to catch me a spikefish from the waters of Azim Khaat. They say the locals usually cut this one free, seeing as it's more bone than fish..."},{"name":"DAILYNAMAZUO03120","text":"Once you have my request in order, please deliver it straight to Dhoro Iloh. I'll bring the rest to Seigetsu myself...if I ever manage to find everything on this infernal list."},{"name":"DAILYNAMAZUO03120","text":"As I said, feel free to raid my supply crate there if you find yourself lacking any materials. Pillage away!"},{"name":"DAILYNAMAZUO03120","text":"As I said, feel free to raid my supply crate there if you find yourself lacking any materials. Pillage away!"},{"name":"DAILYNAMAZUO03120","text":"As I said, feel free to raid my supply crate there if you find yourself lacking any materials. Pillage away!"},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03120","text":"Once you have those jade pieces, I'd appreciate it if you could take them directly to Seigetsu. Yes, yes."},{"name":"DAILYNAMAZUO03120","text":"Once you have those steppe radishes, I'd appreciate it if you could take them directly to Seigetsu. Yes, yes."},{"name":"DAILYNAMAZUO03120","text":"Once you've caught that spikefish, I'd appreciate it if you could take it directly to Seigetsu. Yes, yes."},{"name":"DAILYNAMAZUO03120","text":"All set? Let's get our offerings to Seigetsu, and remember: not a word to anyone! No, no!"},{"name":"KOFUINSEIGETSU","text":"You have my “special consignment”?"},{"name":"KOFUINSEIGETSU","text":"Most excellent. You see, there is a reason we have needed to replace our altar offerings with such frequency. Shall I enlighten you as to why?"},{"name":"KOFUINSEIGETSU","text":"Thieves. A certain number of ill-natured and gluttonous Namazu have been stuffing their faces with our festival fare."},{"name":"KOFUINSEIGETSU","text":"Thus did I requisition the creation of such offerings that would fill the bellies of these voracious vandals with naught but remorse. A civilized solution, do you not agree?"},{"name":"KOFUINSEIGETSU","text":"But even the average Namazu is unrepentant in his appetite! No matter how many are repulsed by our culinary artifice, there will always be another tempted by the prospect of a surreptitious snack! We must stand ready to restock our supply..."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22713","obj":{"i":22713,"n":"Substitute Offering Materials","l":150,"c":25919,"t":61}}]}