{"quest":{"name":"Beat of the Drum","location":"The Azim Steppe","id":68653,"patch":4.3,"sort":15,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22711],"journal":["Seigetsu the Enlightened has an idea to enliven the festival even further.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu artisan.","You have spoken with the Namazu artisan.<br>Deliver the requested supplies to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu artisan.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Seigetsu the Enlightened</span><span class=\"alternative\">Mine [Error] to the south of Chakha Zoh</span><span class=\"alternative\">Gather [Error] in the south of Chakha Zoh</span><span class=\"alternative\">Catch [Error] in the upper Yat Khaal</span></span>."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"According to that most puissant publication, <span class=\"emphasis\">The Chrysanthemum and the Dango</span>, music has always been an indispensable part of festivals. And if our celebration is to beat with the requisite celebratory rhythm, then we must perforce acquire ourselves the necessary instruments."},{"name":"KOFUINSEIGETSU","text":"Simply purchasing instruments would, however, cheapen the spirit of the event. In my literature-enriched opinion, the sound of drums crafted from locally sourced materials will best resonate with the souls of our steppe-dwelling ancestors."},{"name":"KOFUINSEIGETSU","text":"I have volunteered Gyoshin to assemble our music-making paraphernalia, but we await integral parts and pieces from one of our apprentice artisans. Would you please find him over near Chakha Zoh, and expedite the crafting process?"},{"name":"DAILYNAMAZUO03117","text":"Ah, you're a clever one with your fins, yes, yes? I've been putting together bits and pieces for our festival instruments, and just realized I was missing a piece here and a bit there."},{"name":"DAILYNAMAZUO03117","text":"Could you do me a favor, and hammer out a batch of pins for securing drum skins? My crate here should have everything you need."},{"name":"DAILYNAMAZUO03117","text":"Could you do me a favor, and shape some leather into drum skins? My crate here should have everything you need."},{"name":"DAILYNAMAZUO03117","text":"Could you do me a favor, and mix up some lacquer for coating drum shells? My crate here should have everything you need."},{"name":"DAILYNAMAZUO03117","text":"Could you do me a favor, and pick me out a pair of nice flat stones for tanning drum skins? Two would be plenty! More than enough. I think I saw some likely candidates to the south of here..."},{"name":"DAILYNAMAZUO03117","text":"Could you do me a favor, and pick me a basket or two of tea leaves for tanning drum skins? Yes, yes, two would be plenty! More than enough. I think I saw some tea plants to the south of here..."},{"name":"DAILYNAMAZUO03117","text":"Could you do me a favor, and get your fins on a leatherscale? Seigetsu is convinced that if we stretch out the fish's skin and clamp it down, it should make a satisfying percussive boom! Try your rod in the waters of the upper Yat Khaal─a little salmon roe on the hook should do the trick."},{"name":"DAILYNAMAZUO03117","text":"Ah, once you've taken care of my little favor, you can deliver it straight to Seigetsu. Many, many thanks in advance!"},{"name":"DAILYNAMAZUO03117","text":"Have you fumbled my favor? If you want to try again, there's more than enough materials in my crate! ...Please, please try again."},{"name":"DAILYNAMAZUO03117","text":"Have you fumbled my favor? If you want to try again, there's more than enough materials in my crate! ...Please, please try again."},{"name":"DAILYNAMAZUO03117","text":"Have you fumbled my favor? If you want to try again, there's more than enough materials in my crate! ...Please, please try again."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03117","text":"Are you having trouble fulfilling my favor? Look to the south of here─that's the opposite of north."},{"name":"DAILYNAMAZUO03117","text":"Are you having trouble fulfilling my favor? Look to the south of here─that's the opposite of north."},{"name":"DAILYNAMAZUO03117","text":"Are you having trouble fulfilling my favor? Try casting your line in the waters of the upper Yat Khaat. If you find yourself in the lower Yat Khaat, you've gone too far. Much, much too far."},{"name":"DAILYNAMAZUO03117","text":"You can deliver the goods directly to Seigetsu himself. I'll be along with the rest once I'm finished here. Slippery little beasts..."},{"name":"KOFUINSEIGETSU","text":"Are we to see a complete delivery of drum parts today? Or was our neophyte artisan too busy splashing his fins in the stream?"},{"name":"KOFUINSEIGETSU","text":"Ah, this is exactly the sort of crafting expertise I anticipated. It would seem I was justified in enlisting your assistance."},{"name":"KOFUINSEIGETSU","text":"Ah, this is exactly the sort of geological expertise I anticipated. It would seem I was justified in enlisting your assistance."},{"name":"KOFUINSEIGETSU","text":"Ah, this is exactly the sort of botanical expertise I anticipated. It would seem I was justified in enlisting your assistance."},{"name":"KOFUINSEIGETSU","text":"Ah, this is exactly the sort of piscatological expertise I anticipated. It would seem I was justified in enlisting your assistance."},{"name":"KOFUINSEIGETSU","text":"The lively beat of our grand festival will echo ever more loudly across the steppe now that our number of drums is set to multiply."},{"name":"KOFUINSEIGETSU","text":"Our celebrations have begun to reverberate with such ear-shattering volume, in fact, that I can scarce concentrate on my reading..."},{"name":"KOFUINSEIGETSU","text":"But such is the price of progress─whensoever we shed light upon the walls of civilization, we cannot help but create pools of shadow..."}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22711","obj":{"i":22711,"n":"Drum Part Materials","l":150,"c":25919,"t":61}}]}