{"quest":{"name":"Collision of Cultures","location":"The Azim Steppe","id":68651,"patch":4.3,"sort":14,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"journal":["Seigetsu the Enlightened is concerned about the clash of cultures.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Gyotaku.","Ride a mikoshi to the Dusk Throne and use the Wasshoi ability at the designated location.","Ride a mikoshi to the Dawn Throne and use the Wasshoi ability at the designated location.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"It is an unfortunate fact that whilst the collision of cultures is often an enriching affair for all concerned, a sudden encounter with the unfamiliar can just as easily lead to conflict. As such, we cannot assume that the Xaela will accept us with open arms."},{"name":"KOFUINSEIGETSU","text":"No, should matters come to blows, those proud warrior people could have every one of us steamed and served in a buuz─in the most disturbingly literal fashion─which would put quite a damper on efforts to refine our civilization."},{"name":"KOFUINSEIGETSU","text":"Thus did I bend my intellect to the task of how we might avoid such an unpleasant fate. After much deliberation, I was rewarded with the most ingenious idea: we shall exhibit our peaceful intentions to the Xaela by paying our respects to their gods!"},{"name":"KOFUINSEIGETSU","text":"Go now, <span class=\"highlight\">Forename</span>! Gyotaku will provide you with a mikoshi, that you might float with serene purpose to the sacred sites of the Azim Steppe."},{"name":"KOFUINSEIGETSU","text":"A number of my kin have already begun their pilgrimage, and await your arrival at the Dusk Throne. When the Xaela witness <span class=\"emphasis\">you</span> leading the devotions of our people from atop the mikoshi, they will surely recognize the harmonious significance of your presence!"},{"name":"GYOTAKU","text":"You have come for a mikoshi, yes, yes? Hop on board, and honor those Xaela gods with a rousing Namazu wasshoi!"},{"name":"GYOTAKU","text":"When the others returned with the mikoshi, I had thought your mission successfully completed. But it seems you simply hopped down...or tumbled off. Here, why don't you try again, and keep a tighter grip this time, yes, yes?"},{"name":"DAILYNAMAZUO03115","text":"Dusky goddess, we come to offer our respects! We hope our display of worship meets with your approval!"},{"name":"DAILYNAMAZUO03115","text":"I wonder if the goddess minds being buried in the sand like that... A Namazu would just dry right out! Shrivel right up! We'll have to continue our visits and keep Her company!"},{"name":"DAILYNAMAZUO03115","text":"The goddess is so <span class=\"emphasis\">expansive</span>, the way Her magnificence fills your vision... I felt an itch in my fins to just start climbing and nestle myself i─ Hm? Of course I didn't clamber up this sacred statue! No, no!"},{"name":"DAILYNAMAZUO03115","text":"Our duty is done. Your wasshoi was wonderful, <span class=\"highlight\">Forename</span>! Most devotional! Now we must present ourselves at the Dawn Throne. See you there, yes? Yes, yes!"},{"name":"DAILYNAMAZUO03115","text":"Do not be alarmed─we are the Namazu from atop the Towering Still! We have put aside our festival preparations to come before the gods of the Azim Steppe and pay the proper obeisance!"},{"name":"DAILYNAMAZUO03115","text":"As our friend here has demonstrated from atop the mikoshi, a spirited wasshoi is the Namazu way of showing respect!"},{"name":"ORONIRMAN03115A","text":"I might think you come to insult us...but if the champion of the Naadam acts on your behalf, then we must accept the sincerity of your words."},{"name":"ORONIRMAN03115B","text":"Thank you for accompanying these...envoys. I saw only finned creatures flapping towards us, and thought catfish had dragged themselves up from the Azim Khaat. I was close to kicking them into the water..."},{"name":"DAILYNAMAZUO03115","text":"Seigetsu the Enlightened has ordered─very firmly suggested─that we perform our greetings on a regular basis. And so here we are!"},{"name":"DAILYNAMAZUO03115","text":"Gods and mortals, natives and visitors alike, may we all be filled with festive spirit!"},{"name":"ORONIRMAN03115A","text":"Again, you come. Again we struggle to understand your ways. And again we will recognize your efforts to show respect, as odd as they are..."},{"name":"ORONIRMAN03115B","text":"These <span class=\"emphasis\">unique</span> displays of worship have captured the attention of many of our people. The Namazu are fortunate you chose to participate─they might otherwise have been seen as a threat, rather than a confusing curiosity."},{"name":"DAILYNAMAZUO03115","text":"And now we must return to our tasks. Peace be with you! And with you, <span class=\"highlight\">Forename</span>!"},{"name":"ORONIRMAN03115B","text":"We, too, must return to our duties. Know that you are welcome to approach again should you wish to entertai─ahem, “honor” us with another show of respect."},{"name":"ORONIRMAN03115A","text":"Who approaches the Dawn Throne?"},{"name":"DAILYNAMAZUO03115","text":"We are but humble Namazu! Bear witness as we demonstrate our respect for your mighty deities!"},{"name":"SYSTEM","text":"The Namazu have approached the Oronir. Speak with Gyotaku at Dhoro Iloh to mount a mikoshi, and perform a rousing Wasshoi before the Dawn Throne."},{"name":"DAILYNAMAZUO03115","text":"We're ready for the wasshoi now. Let's make it a good one!"},{"name":"SYSTEM","text":"The Namazu are waiting to perform their greeting alongside the mikoshi. Speak with Gyotaku at Dhoro Iloh to mount a mikoshi, and perform a rousing Wasshoi before the Dusk Throne."},{"name":"KOFUINSEIGETSU","text":"I thank you for leading our people in the pursuit of harmony. Tell me, were the Xaela receptive to our overtures?"},{"name":"KOFUINSEIGETSU","text":"Ah, just as I suspected: your presence is essential for fostering an atmosphere of acceptance, if not outright trust. The mutual understanding gained through the exchange of cultures is truly a marvelous thing, and it is a road that we must continue to pave if we would improve our civilization."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}}]}