{"quest":{"name":"Local Special Tea","location":"The Azim Steppe","id":68650,"patch":4.3,"sort":11,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22709],"journal":["Seigetsu the Enlightened has found another local custom he wishes to emulate.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu tea connoisseur.","Deliver the requested supplies to the Namazu tea connoisseur.","Deliver the buurtsag tsai to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu tea connoisseur.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the Namazu tea connoisseur</span><span class=\"alternative\">Mine [Error] to the east of Mol Iloh</span><span class=\"alternative\">Gather [Error] to the east of Mol Iloh</span><span class=\"alternative\">Catch [Error] at Hak Khaal</span></span>.","Deliver the buurtsag tsai to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Many civilized peoples of Othard perform rituals in which wine is offered to the kami. To prove that we are equally sophisticated, I propose that we host a similar ceremony. "},{"name":"KOFUINSEIGETSU","text":"However, rather than wine, we Namazu become inebriated by drinking tea. Since the offering of an intoxicating beverage appears to be the focal point of the proceedings, we will substitute the wine with tea."},{"name":"KOFUINSEIGETSU","text":"Coincidentally, the Mol tribe perform a ceremony in which tea is presented to the old gods. I have sent an envoy to learn of their customs so that we may perform our own version here in Dhoro Iloh."},{"name":"KOFUINSEIGETSU","text":"Unfortunately, he has been gone longer than I had anticipated. Perhaps the Mol are slowly roasting him over a fire! Ha! But joking aside, he may be dead. Please investigate his whereabouts."},{"name":"DAILYNAMAZUO03114","text":"Seigetsu asked you to look for me? I always thought he was utterly heartless, but perhaps he is not so bad after all."},{"name":"DAILYNAMAZUO03114","text":"Well, having said that, he has set me a rather difficult task. Not only was I told to participate in a Mol tea ceremony, he also ordered me to gather all the things necessary to recreate the ritual, right down to the most minute detail!"},{"name":"DAILYNAMAZUO03114","text":"The number of different knickknacks needed to make a simple cup of “buurtsag tsai” is mind-boggling! And then there are all the complicated steps involved in the ceremony itself. Please, you've got to help me!"},{"name":"DAILYNAMAZUO03114","text":"The Mol use a special teapot to brew the tea. Very large and heavy it is. If you could craft one using the materials I've collected, I'd be extremely grateful."},{"name":"DAILYNAMAZUO03114","text":"The Mol use a tea strainer when pouring the tea. Very different to the ones we Namazu use, yes, yes. If you could craft one using the materials I've collected, I'd be extremely grateful."},{"name":"DAILYNAMAZUO03114","text":"The Mol sweeten their tea with a mixture of sugar and spices. If you could make some using the ingredients I've collected, I'd be extremely grateful."},{"name":"DAILYNAMAZUO03114","text":"Naturally, only a certain type of water is used in the ritual, steppe spring water, in fact. Do you think you could get some for me? The Mol say it springs forth east of Mol Iloh."},{"name":"DAILYNAMAZUO03114","text":"I was surprised to see them add fava beans to the pot while brewing the tea! Apparently they grow east of Mol Iloh, but I couldn't find any. Could you collect some for me?"},{"name":"DAILYNAMAZUO03114","text":"I was surprised to see them pour the tea using a flagon clam! It seemed a little awkward to me, but we must stay true to the Mol traditions, yes, yes. Could you go to Hak Khaal and fetch one for me? The best bait to use is salmon roe, according to local fishers."},{"name":"DAILYNAMAZUO03114","text":"Once you've taken care of that, I think I'll be ready for the ceremony. Let me know when you're done."},{"name":"DAILYNAMAZUO03114","text":"Oh, not enough materials? There should be some more in the box."},{"name":"DAILYNAMAZUO03114","text":"Oh, not enough materials? There should be some more in the box."},{"name":"DAILYNAMAZUO03114","text":"Oh, not enough ingredients? There should be some more in the box."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03114","text":"I heard the best place to collect steppe spring water is east of Mol Iloh, yes, yes. Have you tried looking around there?"},{"name":"DAILYNAMAZUO03114","text":"I heard the best place to gather fava beans is east of Mol Iloh, yes, yes. Have you tried looking around there?"},{"name":"DAILYNAMAZUO03114","text":"The Mol go to Hak Khaal for their flagon clam. Might be a good place to start, yes, yes? "},{"name":"DAILYNAMAZUO03114","text":"Have you brought the last of the tea ceremony things?"},{"name":"DAILYNAMAZUO03114","text":"Tremendous! Exactly the same as the Mol use! I've boiled some water to make a simplified version of the tea for Seigetsu to try. One moment, please."},{"name":"DAILYNAMAZUO03114","text":"Here you are. It might taste a little different once we start using the authentic teapot, but this should be close enough. Yes, yes."},{"name":"DAILYNAMAZUO03114","text":"I'm going to practice brewing the tea before going back to perform the ritual. I have to make sure the flavor is just right."},{"name":"DAILYNAMAZUO03114","text":"Don't worry, I won't drink myself into a stupor, I promise! Tell Seigetsu that although I left as a novice, I will return as a master of...pouring tea! Yes, yes."},{"name":"DAILYNAMAZUO03114","text":"No, no, I'll be fine here. If I am attacked by a wild beast, my shrieks of terror are sure to alert the Mol villagers, who will rush to my aid. Probably."},{"name":"KOFUINSEIGETSU","text":"So, did you find him in one piece? And more importantly, what about the tea?"},{"name":"KOFUINSEIGETSU","text":"Not only did he witness their customs, but he has already made tea in the traditional Mol fashion? Interesting. However, I shall withhold my praise until I have sampled the fruits of his labor."},{"name":"KOFUINSEIGETSU","text":"&lt;slurp&gt; Hmmm... A complex infusion of leguminous and earthy notes that stimulates the palate, with a residually floral finish. Certainly a gift fit for the kami or the old gods."},{"name":"KOFUINSEIGETSU","text":"Upon his return, I will have him pour cup after cup. Naturally, once the kami have been given their share, the remainder will be distributed amongst those most deserving. By that, I am mainly referring to myself, but the others are welcome to my dregs."},{"name":"KOFUINSEIGETSU","text":"Is that disdain I detect in your expression? Spare me. Decadent rulers and underprivileged lower classes are the hallmarks of a civilized society, and we Namazu are no different. I have my role, and the plebeians have theirs."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22709","obj":{"i":22709,"n":"Mol Tea Ceremony Paraphernalia Materials","l":148,"c":25919,"t":61}}]}