{"quest":{"name":"Cannot Say Neigh","location":"The Azim Steppe","id":68654,"patch":4.3,"sort":21,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"journal":["Seigetsu the Enlightened has concerns of an equestrian nature.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Find the Namazu horse enthusiast in Nhaama's Retreat.","Mount the horse, and ride it to the Mol horse handler.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"A fellow festival enthusiast volunteered to return one of the horses the Mol so graciously provided for our racing event, but I fear his “enthusiasm” is rather greater than his horsemanship..."},{"name":"KOFUINSEIGETSU","text":"To be perfectly blunt, he is an atrocious equestrian, and there is a distinct possibility that either he or the mount will be injured."},{"name":"KOFUINSEIGETSU","text":"I would greatly appreciate it if you could find our would-be horse wrangler, and ensure the bodily integrity of both parties. Pray begin your search on the outskirts of Dhoro Iloh─I consider it <span class=\"emphasis\">extremely</span> unlikely he has managed to travel more than a few dozen yalms beyond the Towering Still."},{"name":"DAILYNAMAZUO03118","text":"The Mol make it look so easy. Effortless. I thought I could just leap on its back, and gallop off across the steppe. But, no. No, no, no..."},{"name":"DAILYNAMAZUO03118","text":"I don't know if I nudged the wrong spot or what, but we were suddenly racing down the side of the cliff! My entire life flashed before my bulging eyes!"},{"name":"DAILYNAMAZUO03118","text":"Practice makes perfect, or so they say. ...They wouldn't say that if they saw my attempts at riding horses."},{"name":"DAILYNAMAZUO03118","text":"I did my best not to nudge the beast the wrong way, but once again I found myself hurtling down the cliffside at a breakneck pace. How fortunate that I have little neck to speak of, let alone break!"},{"name":"DAILYNAMAZUO03118","text":"It might be best if I retire before I steer myself into a Matanga lair..."},{"name":"DAILYNAMAZUO03118","text":"Please, would you ride the horse for me? Yes, yes?"},{"name":"DAILYNAMAZUO03118","text":"A Mol horse handler was to meet me halfway. “Just follow the course of the river to the north,” Seigetsu said. Sounds simple enough, doesn't it...?"},{"name":"DAILYNAMAZUO03118","text":"Oh, hello. When I saw the horse return alone, I was worried you'd been snagged by one of those long-toothed cats. Well, our Mol friend will be waiting, so it's back in the saddle for you! So to speak."},{"name":"DAILYMOL03118","text":"Do those stunted creatures even know how to ride...?"},{"name":"SYSTEM","text":"Speak with the Namazu horse enthusiast in Nhaama's Retreat to mount a horse, and then deliver the animal to the Mol horse handler."},{"name":"DAILYMOL03118","text":"...You are returning one of our horses? I expected a Namazu rider, but to be honest, I am somewhat relieved."},{"name":"DAILYMOL03118","text":"Hah, did you see it race away!? The poor beast must have been homesick for Mol Iloh!"},{"name":"DAILYMOL03118","text":"I thank you for returning our animal in fine health. Pray send my regards to Seigetsu and his kin."},{"name":"DAILYMOL03118","text":"The horse will find its way home, worry not. Feel free to make your own way back to the Namazu."},{"name":"KOFUINSEIGETSU","text":"&lt;sigh&gt; As expected, you were forced to salvage my shortsighted─and shortlimbed─kin's duty. I did try to dissuade him from his course..."},{"name":"KOFUINSEIGETSU","text":"In any case, my perspicacity in assigning your tasks has been borne out once again."},{"name":"KOFUINSEIGETSU","text":"Unfortunately, however, our enthusiast's zeal is as unrelenting as my intellect, and he is surely doomed to repeat these ill-considered horseback disasters. In such an event, your assistance will once more be welcome."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}}]}