{"quest":{"name":"Roasting a New Dish","location":"The Azim Steppe","id":68658,"patch":4.3,"sort":18,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22714],"journal":["Seigetsu the Enlightened needs your help to create a signature dish.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu culinarian.","Deliver the requested supplies to the Namazu culinarian.","Deliver the Namazu roast to Yesui.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu culinarian.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the Namazu culinarian</span><span class=\"alternative\">Mine [Error] to the south of Reunion</span><span class=\"alternative\">Gather [Error] to the south of Reunion</span><span class=\"alternative\">Catch [Error] at Nem Khaal</span></span>.","Deliver the Namazu roast to Yesui.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Upon browsing the illustrated works of <span class=\"emphasis\">The Three Divine Flavors</span>, I came to the realization that our festival is lacking that which is served to spectators at many a traditional celebration: a signature dish."},{"name":"KOFUINSEIGETSU","text":"If we are to elevate our civilization and draw crowds to the festivities, then we must endeavor to emulate this culinary custom!"},{"name":"KOFUINSEIGETSU","text":"As we are to provide this delicacy for the palates of Namazu and non-Namazu alike, it stands to reason that you must participate in the preparatory stages. Go now, and present yourself to our apprehensive culinarian on the outskirts of Reunion."},{"name":"DAILYNAMAZUO03122","text":"I'm so glad you've come! I have an idea for our festival dish, but I only know how to cook for Namazu. I'll need to borrow your talents─and possibly your tasting tongue!"},{"name":"DAILYNAMAZUO03122","text":"Right, then. Today we'll be making a Namazu roast with a twist! The roast is ordinarily just a baked fish we eat on feast days, but this time it'll be steeped in a broth of “civilized” flavor."},{"name":"DAILYNAMAZUO03122","text":"For your part in our cooking collaboration, I'd like you to make me two marinade pots. All the materials you need should be in the supply crate."},{"name":"DAILYNAMAZUO03122","text":"For your part in our cooking collaboration, I'd like you to make me two drop lids to aid in the marinating process. All the materials you need should be in the supply crate."},{"name":"DAILYNAMAZUO03122","text":"For your part in our cooking collaboration, I'd like you to make me two jars of marinade─something you might taste in a city of culture! All the materials you need should be in the supply crate."},{"name":"DAILYNAMAZUO03122","text":"For your part in our cooking collaboration, I'd like you to acquire two chunks of crystal-clear rock salt. The finest! Seigetsu's research suggests deposits can be found to the south of Reunion."},{"name":"DAILYNAMAZUO03122","text":"For your part in our cooking collaboration, I'd like you to acquire two sprigs of fragrant steppe herbs─all the better to season our fish! Seigetsu's research suggests such herbs can be found to the south of Reunion."},{"name":"DAILYNAMAZUO03122","text":"For your part in our cooking collaboration, I'd like you to acquire a Nhaama's claw─this mollusk will provide the base stock for our marinade. So many rivers and streams to choose from, but try your luck in Nem Khaal first. Oh, and I hear they snap right down on salmon roe!"},{"name":"DAILYNAMAZUO03122","text":"As for the glorious fish itself, I have it ready already! In a pail! Once you've brought me what I asked for, I can have it steeped and roasted in a moment. A mere twinkling!"},{"name":"DAILYNAMAZUO03122","text":"As I said, any materials you find in the crate are yours to make use of. Except for my cooking utensils! You keep your fins off those!"},{"name":"DAILYNAMAZUO03122","text":"As I said, any materials you find in the crate are yours to make use of. Except for my cooking utensils! You keep your fins off those!"},{"name":"DAILYNAMAZUO03122","text":"As I said, any materials you find in the crate are yours to make use of. Except for my cooking utensils! You keep your fins off those!"},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03122","text":"I'll have everything prepared to roast the moment you return. Happy mining!"},{"name":"DAILYNAMAZUO03122","text":"I'll have everything prepared to roast the moment you return. Happy harvesting!"},{"name":"DAILYNAMAZUO03122","text":"I'll have everything prepared to roast the moment you return. Happy fishing!"},{"name":"DAILYNAMAZUO03122","text":"Did you bring your part of our collaboration?"},{"name":"DAILYNAMAZUO03122","text":"Thank you, thank you! I'll start the roasting right away!"},{"name":"DAILYNAMAZUO03122","text":"Sleeping, steeping in the broth!<br>Watch the juices churn and froth!<br>Crispy skin and fragrant sprig!<br>Now season dish with happy jig!"},{"name":"DAILYNAMAZUO03122","text":"And done! Doesn't that smell wonderful!? Delectable!? I think we have a winner here!"},{"name":"DAILYNAMAZUO03122","text":"The next step is to have one of the Xaela in Reunion sample our creation. Please deliver our roast to Yesui at her stall and ask her for her honest opinion."},{"name":"DAILYNAMAZUO03122","text":"Meanwhile, I'll stay here and work on variations to our marinade. Once Yesui has given her verdict, please convey the results of our roast to Seigetsu!"},{"name":"DAILYNAMAZUO03122","text":"Take our roast to a Xaela by the name of Yesui! Her stall has the most interesting cuts of meat!"},{"name":"YESUI","text":"Yes? Can I interest you in a piece of heart? A sliver of liver?"},{"name":"YESUI","text":"You wish me to taste this...dish? I'm not the bravest of gourmands, but I'll not offer insult by refusing your gift."},{"name":"YESUI","text":"This...this is heavenly! The, uh, “presentation” does little to entice the appetite, yet I would sell it at my stall for the taste alone! Maybe cover it with a cloth or some such!"},{"name":"YESUI","text":"&lt;cough&gt; &lt;cough&gt; Ugh. Never have I experienced such conflicting flavors! And why does it look as if it were crushed under a stone? Is...is this what the Namazu call cooking!?"},{"name":"YESUI","text":"Ah, the lowing of the dzos is especially haunting today. Praise be to the Dawn Father and the Dusk Mother for bringing this beautiful world into existence!<br>...Forgive my rambling─I meant only to distract my mind from the sudden roiling of my belly."},{"name":"YESUI","text":"Ahem. I thank you for introducing me to this <span class=\"emphasis\">unique</span> experience. Send my regards to the Namazu, if you would."},{"name":"YESUI","text":"Though a single mouthful was exciting enough, I will endeavor to finish this roasted delicacy of yours. Perhaps if I keep my eyes closed...? Uh, my thanks to your Namazu friends!"},{"name":"DAILYNAMAZUO03122","text":"Did you have Yesui sample our roast? Once she's tasted the fish, please report her verdict directly to Seigetsu!"},{"name":"KOFUINSEIGETSU","text":"How fared the inaugural tasting of our Namazu roast collaboration?"},{"name":"KOFUINSEIGETSU","text":"...Could hardly bear to look upon it, you say? Hmm, I had not considered presentation as important as the taste. But we must not be discouraged─trial and error is a fundamental process through which all budding civilizations must suffer."},{"name":"KOFUINSEIGETSU","text":"When we do finally perfect our signature dish, gourmet pilgrims will surely flood our festival, and our fins shall overflow with pecuniary tribute. Stand with us, <span class=\"highlight\">Forename</span>, and bask in the dawn of a culinary revolution!"}],"reward":{"gil":680,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22714","obj":{"i":22714,"n":"Steeping Accessory Materials","l":150,"c":25919,"t":61}}]}