{"quest":{"name":"Ready the Confetti","location":"The Azim Steppe","id":68655,"patch":4.3,"sort":16,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22712],"journal":["Seigetsu the Enlightened is burdened by the threat of dwindling confetti supplies.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu papermaker.","Deliver the requested supplies to the Namazu papermaker.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu papermaker.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the Namazu papermaker</span><span class=\"alternative\">Mine [Error] to the south of Reunion</span><span class=\"alternative\">Gather [Error] to the south of Reunion</span><span class=\"alternative\">Catch [Error] in the lower Yat Khaal</span></span>.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Ever since we constructed the mikoshi, we have been expending our supplies of festive paper showers at an alarming rate. I have assigned an official “papermaker” to the task, but as the title was conferred more as a method of encouragement than a recognition of expertise, he may very well be in need of experienced assistance."},{"name":"KOFUINSEIGETSU","text":"If you would, pray locate our papermaker in the vicinity of Kahkol Iloh, and render whatever aid he might require."},{"name":"DAILYNAMAZUO03119","text":"Really? You've come to help me make confetti? Wonderful! We need a massive stockpile─gigantic, even─to cover the needs of our more excitable festival participants."},{"name":"DAILYNAMAZUO03119","text":"Do you think you could make me several pairs of scissors? I've sharpened mine so many times there's hardly anything left to sharpen. Look in the crate there, and you should find everything you need."},{"name":"DAILYNAMAZUO03119","text":"Do you think you could put together some papermaking frames? I could triple my production! Look in the crate there, and you should find everything you need."},{"name":"DAILYNAMAZUO03119","text":"Do you think you could mix up several pots of paste for me? I may have let my last pot dry up... Look in the crate there, and you should find everything you need."},{"name":"DAILYNAMAZUO03119","text":"Do you think you could dig into a vein or two of cinnabar for me? Very good for making vermilion pigment. Very red. The locals say the best place to look is to the south of Reunion."},{"name":"DAILYNAMAZUO03119","text":"Do you think you could pull up a few tufts of fibrous wildgrass for me? It's the perfect base material for papermaking. You should be able to find some suitable patches to the south of Reunion."},{"name":"DAILYNAMAZUO03119","text":"Oh, do you think you could find one of those sparkly dusk scallops for me? I can grind the shells into a splendid pigment for coloring our paper! Seigetsu's books suggested the waters of the lower Yat Khaal, and baiting the hook with salmon roe."},{"name":"DAILYNAMAZUO03119","text":"Bring the supplies to me when you're ready, and in the meantime I'll keep soaking and pasting and snipping away!"},{"name":"DAILYNAMAZUO03119","text":"Missing materials? I'm sure I still had plenty of crafting odds and ends in that crate of mine..."},{"name":"DAILYNAMAZUO03119","text":"Missing materials? I'm sure I still had plenty of crafting odds and ends in that crate of mine..."},{"name":"DAILYNAMAZUO03119","text":"Missing materials? I'm sure I still had plenty of crafting odds and ends in that crate of mine..."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03119","text":"Two onzes of steppe cinnabar is all I need! I'll be here making plain paper while I wait for your delivery!"},{"name":"DAILYNAMAZUO03119","text":"Some tufts of steppe wildgrass is all I need! I'll be here mixing pigments while I wait for your delivery!"},{"name":"DAILYNAMAZUO03119","text":"A scallop, a scallop, a dusk-colored scallop! Can you imagine how vibrant our paper will be! How striking! Please bring one as soon as you can!"},{"name":"DAILYNAMAZUO03119","text":"Do you have the supplies I asked for?"},{"name":"DAILYNAMAZUO03119","text":"Yes, this will do nicely! I'll just add what I have to the supplies you brought... A little twist of the fin... A few more snips with the scissors..."},{"name":"DAILYNAMAZUO03119","text":"...And finished! Feast your eyes upon this mountain of confetti! Wasshoi!"},{"name":"DAILYNAMAZUO03119","text":"...Oops."},{"name":"DAILYNAMAZUO03119","text":"F-Forgive me! I'll pick up every last piece! Every scrap! You should head back to Seigetsu and let him know the confetti will be ready. Eventually."},{"name":"DAILYNAMAZUO03119","text":"I'll head back once I've gathered this little mess together. You should report to Seigetsu before he starts to wonder..."},{"name":"KOFUINSEIGETSU","text":"Welcome back, <span class=\"highlight\">Forename</span>. May I assume that with your intervention, our supplies of confetti have been sufficiently restocked?"},{"name":"KOFUINSEIGETSU","text":"...Threw it into the air almost immediately, you say? I have not encountered a word which adequately describes my sense of shame and disappointment. Please say you will stay for a while. We quite obviously need your help."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22712","obj":{"i":22712,"n":"Confetti-making Tool Materials","l":150,"c":25919,"t":61}}]}