{"quest":{"name":"In Steep Trouble","location":"The Azim Steppe","id":68663,"patch":4.3,"sort":19,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"journal":["Seigetsu the Enlightened is in need of an adventurer who does not believe in superstitions.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Use the firecrackers to aid the stuporous Namazu.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Thank goodness you're here. I know not how, but a number of my kin appear to have been bewitched. They stand about uttering nonsense all day, eyes rolled into the backs of their heads."},{"name":"KOFUINSEIGETSU","text":"From my readings of <span class=\"emphasis\">Unbeaten Tracks in Yanxia</span>, however, I believe I have discovered a means to rouse them from this inexplicable stupor. Apparently, the sudden flash and sound of firecrackers has been known to return cognitive function to those suffering from symptoms much like those I've seen in the others."},{"name":"KOFUINSEIGETSU","text":"Might I ask you to carry out this ritual and return them to their senses?"},{"name":"KOFUINSEIGETSU","text":"They were last seen wandering about the Sea of Blades. Use these firecrackers, but try not to hurt them─they still have work to do!"},{"name":"DAILYNAMAZUO03127A","text":"My knees feel weak, and my arms so heavy. I can't go on. No, no. Not another step. "},{"name":"DAILYNAMAZUO03127B","text":"Everything keeps spinning... Round and round, in endless circles."},{"name":"DAILYNAMAZUO03127C","text":"My stomach keeps twisting and turning. It's all I can do not to heave."},{"name":"DAILYNAMAZUO03127A","text":"Wh-What...? How did I get here? Strange... I suddenly feel refreshed. Reinvigorated and ready to work. Well, I better be off. Yes, yes."},{"name":"DAILYNAMAZUO03127B","text":"Who─oh! Oh dear. I know how this looks... Actually, I don't, but I'm sure it's not good. I promise this won't happen again, no, no."},{"name":"DAILYNAMAZUO03127C","text":"Thank you, thank you. I feel so much better now. Yes, yes. If you'll excuse me, I need to be heading back to Dhoro Iloh."},{"name":"KOFUINSEIGETSU","text":"The others returned not long ago, full of vim and vigor, ready to get back to work. Those fireworks were more effective than I had hoped."},{"name":"KOFUINSEIGETSU","text":"I realize before I said they appeared bewitched, but surely you don't believe such a thing could happen, do you? What's more likely is they stole sips of the sacred tea we have saved for one of our myriad celebrations."},{"name":"KOFUINSEIGETSU","text":"Which means we have discovered a cure for inebriation─yet another leap toward a more civilized Namazu society!"}],"reward":{"gil":550,"reputation":60,"items":[{"id":22525}]},"reqs":{"beastrank":5,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}}]}