{"quest":{"name":"Knocking on Heaven's Door","location":"The Ruby Sea","id":68667,"patch":4.35,"sort":110,"icon":100777,"unlocksFunction":1,"eventIcon":71341,"issuer":1019239,"target":1025846,"genre":87,"journal":["Hamakaze has been asked to keep an eye out for you.","Hamakaze, Confederate dogsbody, has been tasked with finding you, although it seems he had made little progress in his inquiries until you appeared unannounced in the Crick. Being the low-ranking deckswab that he is, his superior Rasho shared next to no information with him, other than to direct you to someone called Kyusei. Although the name rings no bells, there seems little harm in pursuing the matter further.","Although Kyusei gives the impression of being courteous and well-mannered, he is reluctant to speak openly. He requests that you meet him and Rasho at the base of Heaven–on–High, presumably in order to be out of earshot of the less discreet members of the local pirating community.","Kyusei recounts a tale in which he stumbled across a previously hidden chamber full of bizarre machinery, with which he accidentally teleported himself to the inner reaches of Heaven–on–High. Once inside, he discovered the tower was crawling with hellish beasts and was lucky to escape with his life. Rasho adds that he is keen to investigate the denizens of the tower before they find a way outside. However, the tower is considered sacred ground by the people of the Ruby Sea, and any attempts to enter it would be seen as an affront. The Confederacy can ill afford any further damage to their already questionable reputation, so Rasho asks that you, as an outsider, infiltrate the tower in secret.","Kyusei stands guarding the hidden passage to the teleportation devices, waiting for you to begin your foray into Heaven–on–High. Before he grants you entry, he explains the magical field that permeates the tower, which threatens to stifle your strength in battle. Fortunately, this can be circumvented with the use of specially prepared empyrean aetherpool equipment, allowing the user to channel their aether rather than having it slowly drained. Armed with the tools and knowledge necessary, you are finally ready to explore the many levels of Heaven–on–High."],"objectives":["Speak with Kyusei.","Wait for Kyusei and Rasho.","Speak with Kyusei."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first clear floor 50 of the Palace of the Dead."},{"name":"SYSTEM","text":"To gain access to the Palace of the Dead, you must complete the quest “The House That Death Built.”"},{"name":"HAMAKAZE","text":"You're <span class=\"highlight\">Forename</span>, correct? The one Rasho is looking for, if I'm not mistaken."},{"name":"HAMAKAZE","text":"He told me that if you showed up, I should send you to Kyusei in Crick."},{"name":"HAMAKAZE","text":"Why? Buggered if I know! Nobody tells me anything around here. You'd be better off asking Kyusei himself."},{"name":"HAMAKAZE","text":"That Kyusei fellow is usually guarding a little wooden shack by the aetheryte, although I can't see why. As far as I know, there's not much in it worth pilfering."},{"name":"RASHO","text":"Greetings, friend. So you have spoken with Hamakaze? Very good. This is a matter of considerable import. Once you have made yourself known to Kyusei, we shall explain."},{"name":"KYUSEI","text":"Ah, you must be <span class=\"highlight\">Forename Surname</span>. Rasho speaks very highly of you."},{"name":"KYUSEI","text":"In fact, there is something that we should like to discuss. All will be revealed in due course, but I feel a change of venue is in order. Pray, wait for us at the foot of Heaven–on–High."},{"name":"RASHO","text":"I will meet you at Heaven–on–High shortly."},{"name":"KYUSEI","text":"There is much I would tell you...but not here. Rasho and I shall meet you anon."},{"name":"RASHO","text":"Magnificent, is it not? But as you may have guessed, we did not call you here to admire the view."},{"name":"RASHO","text":"Rather, we would like you to help us explore Heaven–on–High."},{"name":"RASHO","text":"Perhaps it is best we explain from the beginning. Kyusei, if you would be so kind."},{"name":"KYUSEI","text":"A few nights past, while I was rearranging supplies in one of the storerooms, I happened across a trapdoor that I had never noticed before. Upon opening it, I found a tunnel leading underground."},{"name":"KYUSEI","text":"The passage led to a chamber lined with an array of bizarre machinery, all glowing and humming. Against my better judgment, I reached out and touched one of the devices, and was enveloped by a blinding light."},{"name":"KYUSEI","text":"The next thing I knew, I found myself in a series of ornate hallways─and I was not alone. There were hideous fiends with gnashing fangs and grasping claws everywhere I looked."},{"name":"KYUSEI","text":"It was all I could do to run for my very life, until I chanced across a shining orb. As I approached it, I was once more blinded by light."},{"name":"RASHO","text":"We found him sprawled out in the hidden room below the storage shed. After he came to and shared his experiences, we examined these machines he found. It turns out they are a form of gateway that leads inside Heaven–on–High. And therein lies the problem."},{"name":"KYUSEI","text":"Being from Eorzea, you may not be aware that this tower and the island on which it stands are regarded as sacred."},{"name":"KYUSEI","text":"It is believed that when the kami first came to the Ruby Sea, they created Onokoro, and built Heaven–on–High as a stairway connecting the earth and their home high above the clouds."},{"name":"RASHO","text":"The devout are loath to set foot on Onokoro for fear of incurring the wrath of the kami. To enter into the tower would be an even greater blasphemy."},{"name":"RASHO","text":"We Confederates, on the other hand, come and go as we please. Since no one else had settled on this island, we claimed it for ourselves. It takes more than a few silly folktales to scare us, after all."},{"name":"RASHO","text":"But imagine what might happen if people who do set store by such tales learned we had been poking around in Heaven–on–High─if they heard we were claiming that this “holy ground” was in fact filled with hellish beasts."},{"name":"KYUSEI","text":"At best, they may never trade with us again. And the most fanatical among them might be so bold as to come here with anger in their hearts and murder in their eyes."},{"name":"RASHO","text":"However, we dare not ignore the threat posed by the denizens of the tower. If Kyusei could escape, what's to stop those creatures from doing the same? Therefore I would conduct an investigation─quietly."},{"name":"RASHO","text":"If we dedicate large numbers of Confederates to storming the tower, it won't be long before people start asking questions. On the other hand, few would notice the absence of an outsider such as yourself. And when the fighting starts, you alone are worth a dozen or more of my best men."},{"name":"RASHO","text":"One more thing. Strange magicks govern the tower, suppressing the strength of all who enter. But if anyone can overcome such hindrances, it is you."},{"name":"KYUSEI","text":"For what it is worth, I shall be on hand to provide what little assistance I can. I will leave the exploration of the tower in your capable hands."},{"name":"RASHO","text":"Kyusei may not be the fighting sort, but his knowledge of Heaven–on–High should prove useful."},{"name":"KYUSEI","text":"I will also be operating the teleportation device to provide entry to the tower. Thankfully, you will be much better prepared than I was to face the horrors that lurk within. When you are ready, come and find me by the storeroom."},{"name":"RASHO","text":"An accomplished warrior such as you should fare rather better in the tower than Kyusei did. Be not cowed by his tales. He has a flair for the dramatic."},{"name":"KYUSEI","text":"I take it your preparations are complete? Before you enter Heaven–on–High, I should tell you more about the magicks that Rasho mentioned."},{"name":"KYUSEI","text":"The scouts that we sent inside all claimed they could feel their very aether being sapped, and that their weapons were somehow robbed of their potency. Even their most forceful blows did little more than graze their enemies."},{"name":"KYUSEI","text":"Hmm? You are familiar with such a phenomenon?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Intimately."},{"name":"A1","text":"Me? I don't know nothing about no strange phenomenon."},{"name":"KYUSEI","text":"Is that so? How strange..."},{"name":"KYUSEI","text":"This kind of enfeebling magick can only have been by activated by─ Ahem! Excuse me, I have a tendency to ramble. This is hardly the time for me to start hypothesizing."},{"name":"KYUSEI","text":"Was that a...triple negative? So, you <span class=\"emphasis\">do</span> know? Or perhaps not? I shall attempt to decipher your fanciful wordplay at some other time. After all, I am sure that the Warrior of─ I mean, an experienced adventurer such as yourself would prefer to address more immediate concerns."},{"name":"KYUSEI","text":"Luckily, there is a way to circumvent the tower's magical field to some degree. Please, take this with you. It will allow you to wield what is known as an “empyrean aetherpool weapon.”"},{"name":"KYUSEI","text":"It was devel─discovered inside the tower and slowly channels a person's aether into the form of a blade, spellcasting tome, or what have you. The longer an empyrean aetherpool weapon is used, the more powerful it becomes."},{"name":"KYUSEI","text":"I must stress, however, that even with one of these weapons, progress from one floor to the next will be far from easy. Exploration will largely involve traveling upwards using the teleportation devices inside, which are likely to be heavily guarded."},{"name":"KYUSEI","text":"Considering the dangers you will face, we have decided to restrict the investigation to the lower levels for the time being. Once you've reached the thirtieth floor, please report your findings to Rasho and myself. We shall then discuss whether it is safe to continue past that point."},{"name":"KYUSEI","text":"Although we shan't be joining you on the expedition, we Confederates are eager to lend you our support. If there is anything you need, do not hesitate to ask."},{"name":"SYSTEM","text":"You now have access to Heaven–on–High. You may enter solo or in a party of up to four players."},{"name":"SYSTEM","text":"When speaking with Kyusei, you will be given the option to enter with either a fixed party or a matched party via the matching system."},{"name":"SYSTEM","text":"Players will start at level 61 regardless of their current class or job level. Furthermore, only empyrean aetherpool arms and armor specific to Heaven–on–High may be used."},{"name":"SYSTEM","text":"Further details can be had by speaking with Kyusei."},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 61 or above to participate."}],"reqs":{"jobs":[{"lvl":61,"id":142}],"quests":[68026]},"next":[68668]},"partials":[{"type":"npc","id":"1019239","obj":{"i":1019239,"n":"Hamakaze","l":2409,"q":1}},{"type":"npc","id":"1025846","obj":{"i":1025846,"n":"Kyusei","l":2409,"q":2}},{"type":"quest","id":"68026","obj":{"i":68026,"n":"Tide Goes in, Imperials Go Out","g":6,"l":"The Ruby Sea","s":450}},{"type":"quest","id":"68668","obj":{"i":68668,"n":"On the Shoulders of Giants","g":87,"l":"The Ruby Sea","s":120,"f":1}}]}