{"quest":{"name":"A Welcome Surprise","location":"The Azim Steppe","id":68664,"patch":4.3,"sort":24,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22718],"journal":["Seigetsu the Enlightened intends to repay a debt to the Oronir.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the novice Namazu wrestler.","You have spoken with the novice Namazu wrestler.<br>Deliver the requested goods to the Oroniri wrestling instructor.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the novice Namazu wrestler.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the Oroniri wrestling instructor</span><span class=\"alternative\">Mine [Error] to the northeast of the Dawn Throne</span><span class=\"alternative\">Gather [Error] to the northeast of the Dawn Throne</span><span class=\"alternative\">Catch [Error] in the upper Yat Khaal</span></span>.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"You recall the Azim Bökh, yes? The fierce wrestling competition held by the Oronir tribe."},{"name":"KOFUINSEIGETSU","text":"Well, they have been gracious enough as to teach us the fundamentals of the sport, and it goes without saying they must be duly compensated for their generosity."},{"name":"KOFUINSEIGETSU","text":"As the saying goes, he who sows courtesy reaps friendship, and theirs would be most valuable to the Namazu. As we speak, one of my kin labors tirelessly to prepare a gift worthy of the Oronir's beneficence. Might I ask you to go and ensure his work is proceeding apace?"},{"name":"KOFUINSEIGETSU","text":"You'll find him toiling away at the Dawn Throne. When the gift is finished, no need to bring it here for inspection. I have every confidence it will turn out wonderfully under your supervision."},{"name":"DAILYNAMAZUO03128","text":"Seigetsu sent you to help? That high-whiskered braggart! Does he not think I can't handle this on my own?"},{"name":"DAILYNAMAZUO03128","text":"Well... I suppose I could use an extra pair of fins─er, hands."},{"name":"DAILYNAMAZUO03128","text":"I actually planned to make a number of things for the Oronir. Yes, yes, several gifts to show our appreciation. If you could take some of the supplies from this crate and craft a pair of vases for me, I can handle the rest."},{"name":"DAILYNAMAZUO03128","text":"I actually planned to make a number of things for the Oronir. Yes, yes, several gifts to show our appreciation. If you could take some of the supplies from this crate and craft a pair of satchels for me, I can handle the rest."},{"name":"DAILYNAMAZUO03128","text":"I actually planned to make a number of things for the Oronir. Yes, yes, several gifts to show our appreciation. If you could take some of the supplies from this crate and craft two bottles of perfume for me, I can handle the rest."},{"name":"DAILYNAMAZUO03128","text":"I actually planned to prepare a number of things for the Oronir. Yes, yes, several gifts to show our appreciation. Might I trouble you to mine a chunk of obsidian from the mineral deposits northeast of the Dawn Throne?"},{"name":"DAILYNAMAZUO03128","text":"I actually planned to prepare a number of things for the Oronir. Yes, yes, several gifts to show our appreciation. Might I trouble you to pick a sprig of flatweed from the fields northeast of the Dawn Throne?"},{"name":"DAILYNAMAZUO03128","text":"I actually planned to prepare a number of things for the Oronir. Yes, yes, several gifts to show our appreciation. Might I trouble you to catch an appleseed from the waters of the upper Yat Khaal?"},{"name":"DAILYNAMAZUO03128","text":"When you've finished, you can give it to our instructor over there. It should make for a pleasant surprise coming from you."},{"name":"DAILYNAMAZUO03128","text":"If you need materials for the vase, I'm sure there's more than enough in the crate. Yes, yes."},{"name":"DAILYNAMAZUO03128","text":"If you need materials for the satchel, I'm sure there's more than enough in the crate. Yes, yes."},{"name":"DAILYNAMAZUO03128","text":"If you need materials for the perfume, I'm sure there's more than enough in the crate. Yes, yes."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03128","text":"Any luck with the obsidian? Look to the northeast and I'm sure you'll find it. Yes, yes. Absolutely positive."},{"name":"DAILYNAMAZUO03128","text":"Any luck finding the flatweed? Look to the northeast and I'm sure you'll find it. Yes, yes. Absolutely positive."},{"name":"DAILYNAMAZUO03128","text":"Any luck finding an appleseed? Look in the waters of the upper Yat Khaal and I'm sure you'll find one. Yes, yes. Absolutely positive."},{"name":"DAILYNAMAZUO03128","text":"No need to show that to me. Our instructor is right over there."},{"name":"ORONIRWOMAN03128","text":"If you have business, I'm afraid it must wait."},{"name":"ORONIRWOMAN03128","text":"If you have business, I'm afraid it must wait."},{"name":"ORONIRWOMAN03128","text":"This is from the Namazu, you say?"},{"name":"ORONIRWOMAN03128","text":"I am honored to know they believe my teachings merit such a reward."},{"name":"ORONIRWOMAN03128","text":"Ah, obsidian! This will serve us well in fashioning arrows and spears."},{"name":"ORONIRWOMAN03128","text":"Ah, flatweed! Even in small quantities it is a very potent medicinal herb. I shall use it wisely."},{"name":"ORONIRWOMAN03128","text":"Ah, an appleseed! It has been too long since I've made meals with such a savory ingredient."},{"name":"ORONIRWOMAN03128","text":"I presume their leader, Seigetsu, is responsible for this gift? Pray, give him and all the Namazu of Dhoro Iloh my thanks."},{"name":"ORONIRWOMAN03128","text":"To be honest, I was unsure what to make of their request at first. Even now I wonder how they might attempt to imitate the art of Azim Bökh. But they listen to my words earnestly and their intentions seem genuine. Perhaps someday their efforts will bear fruit."},{"name":"ORONIRWOMAN03128","text":"Pray, give my regards to the Namazu of Dhoro Iloh. I look forward to teaching more of them of Azim Bökh. "},{"name":"DAILYNAMAZUO03128","text":"Our instructor seemed quite pleased with the gift. Yes, yes. Her expression was very cheerful."},{"name":"KOFUINSEIGETSU","text":"So, how did the Oronir receive our gift?"},{"name":"KOFUINSEIGETSU","text":"Wonderful. Then it is safe to say our lessons can continue."},{"name":"KOFUINSEIGETSU","text":"Perhaps someday, with enough training, we can even compete against them in the Azim Bökh!"},{"name":"KOFUINSEIGETSU","text":"Imagine if we won. We could become leaders of the Oronir clan. N-Not that we would intentionally usurp power from their leader. That would be absurd... &lt;ahem&gt;"}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22718","obj":{"i":22718,"n":"Generous Gift Materials","l":150,"c":25919,"t":61}}]}