{"quest":{"name":"Overcommitment","location":"The Azim Steppe","id":68666,"patch":4.3,"sort":25,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[23172],"journal":["A number of Namazu have dancing fever, and Seigetsu the Enlightened has the cure for what ails them.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu apothecary.","Deliver the requested goods to the Namazu apothecary.","Distribute the reinvigorating elixir to the Namazu dancers.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu apothecary.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the Namazu apothecary</span><span class=\"alternative\">Mine [Error] to the northeast of the Dawn Throne</span><span class=\"alternative\">Gather [Error] to the northeast of the Dawn Throne</span><span class=\"alternative\">Catch [Error] at lower Yat Khaal</span></span>.","Distribute the reinvigorating elixir to the Namazu dancers.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"The Oronir in their munificence have seen fit to teach us another of their traditions: a ritual dance to curry favor with the gods before competing in the Azim Bökh."},{"name":"KOFUINSEIGETSU","text":"Needless to say, those seeking to participate in our wrestling competition have been sent to the Dawn Throne to master this dance. But that was three days ago, and I'm certain they lack the common sense to stop dancing without being told."},{"name":"KOFUINSEIGETSU","text":"Assuming they've yet to shuffle off their mortal coils to dance for the gods in person, I thought it prudent we send provisions to bolster their strength. Our apothecary is preparing them as we speak. Would you check on him and see that he has everything he needs?"},{"name":"DAILYNAMAZUO03130","text":"At last, a pair of helping hands."},{"name":"DAILYNAMAZUO03130","text":"Try as I might, I simply cannot finish this elixir without a still. I don't suppose you could fashion one for me? This crate should have all you need. Yes, yes."},{"name":"DAILYNAMAZUO03130","text":"Try as I might, I simply cannot finish this elixir without a strainer. I don't suppose you could fashion one for me? This crate should have all you need. Yes, yes."},{"name":"DAILYNAMAZUO03130","text":"I've been trying to mix a special reagent needed for my elixir, but I'm all fins. I don't suppose you could do it for me? This crate should have all you need. Yes, yes."},{"name":"DAILYNAMAZUO03130","text":"I need you to collect soil from outcrops here near the Dawn Throne. When sifted, it yields minerals that serve as a potent stimulant. Yes, yes. I <span class=\"emphasis\">need</span> that stimulant!<br>...Ahem. For the dancers. Yes, yes. The dancers."},{"name":"DAILYNAMAZUO03130","text":"I need you to collect herbs from the shrubs here near the Dawn Throne. When distilled, they yield a very potent stimulant. Yes, yes. I <span class=\"emphasis\">need</span> that stimulant!<br>...Ahem. For the dancers. Yes, yes. The dancers."},{"name":"DAILYNAMAZUO03130","text":"I need you to catch a fishy fish from the lower Yat Khaal. It is a rather peculiar variety known to be drawn out of hiding with salmon roe. Yes, yes."},{"name":"DAILYNAMAZUO03130","text":"Because of their diet of algae native to the area, they secrete an enzyme vital to my preparations."},{"name":"DAILYNAMAZUO03130","text":"Grant me this one small favor and I can handle the rest."},{"name":"DAILYNAMAZUO03130","text":"Come, come. Everything you'll need is here in this crate."},{"name":"DAILYNAMAZUO03130","text":"Come, come. Everything you'll need is here in this crate."},{"name":"DAILYNAMAZUO03130","text":"Come, come. Everything you'll need is here in this crate."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03130","text":"The soil I need can be found in abundance here near the Dawn Throne. It shouldn't take you long. No, no."},{"name":"DAILYNAMAZUO03130","text":"The herbs I need can be found in abundance here near the Dawn Throne. It shouldn't take you long. No, no."},{"name":"DAILYNAMAZUO03130","text":"Only a fishy fish from the lower Yat Khaal will do. Yes, yes. A fishy fish."},{"name":"DAILYNAMAZUO03130","text":"Have you finished with my request?"},{"name":"DAILYNAMAZUO03130","text":"Excellent work, friend. I need only use this with the other ingredients like so, and..."},{"name":"DAILYNAMAZUO03130","text":"Here it is! One sip, and they could dance for a week without cease if they so chose."},{"name":"DAILYNAMAZUO03130","text":"Hmmm. That's a long time to go without eating or sleeping...<br>At any rate, take this to my brethren atop the Dawn Throne, and give them my regards."},{"name":"DAILYNAMAZUO03130","text":"My elixir should give them the energy they need to continue practicing but... Surely they'll take the occasional break for sustenance, right?"},{"name":"DANCINGNAMAZUOA03130","text":"I never realized...&lt;pant&gt; &lt;pant&gt;...a simple dance could be so tiring."},{"name":"DANCINGNAMAZUOA03130","text":"A drink, you say? Why, that would be lovely."},{"name":"DANCINGNAMAZUOA03130","text":"It's delicious! Rough on the tongue, yet sweet with the earthy aroma of mud. Yes, yes. Like a taste of the One River."},{"name":"DANCINGNAMAZUOA03130","text":"I haven't felt this good in ages. Now if you'll excuse me, I have a dance to master."},{"name":"DANCINGNAMAZUOB03130","text":"I fear my legs have gone numb. Am I still dancing?"},{"name":"DANCINGNAMAZUOB03130","text":"Refreshments? Seigetsu never said anything of breaks, but I am quite parched. Yes, yes."},{"name":"DANCINGNAMAZUOB03130","text":"Oh my, how invigorating! I can feel my legs again. Perhaps now I can finally stay in step."},{"name":"DANCINGNAMAZUOB03130","text":"Tell Seigetsu to expect a dance unlike any he's ever seen upon our return. Yes, yes."},{"name":"DANCINGNAMAZUOC03130","text":"I don't think...&lt;pant&gt;...I can keep this up...&lt;pant&gt;...No, no..."},{"name":"DANCINGNAMAZUOC03130","text":"A drink? &lt;pant&gt; How thoughtful."},{"name":"DANCINGNAMAZUOC03130","text":"What is this strange sensation? I...I feel like..."},{"name":"DANCINGNAMAZUOC03130","text":"We can dance, we can dance everybody look at your fin.♪<br>We can dance, we can dance everybody doing a spin.♪"},{"name":"DANCINGNAMAZUOA03130","text":"We'll master this dance. Just you wait and see!"},{"name":"DANCINGNAMAZUOB03130","text":"I'll have to go and thank Seigetsu for this. Yes, yes. After I've learned the dance."},{"name":"DANCINGNAMAZUOC03130","text":"We'll make this a Namazu dance.♪<br>Yes, yes. We'll make this a Namazu dance.♪"},{"name":"KOFUINSEIGETSU","text":"How fare our would-be competitors? They've given up the ghost, haven't they? "},{"name":"KOFUINSEIGETSU","text":"Oh, so you reached them in time. Well done. One might say they practiced overmuch, dancing for days and nights without cease. Considering their ineptitude for learning, however, I would argue such a lengthy lesson is good for them."},{"name":"KOFUINSEIGETSU","text":"Why, they might even develop some semblance of work ethic, which can be applied to all that we do. Imagine if all the Namazu followed suit."},{"name":"KOFUINSEIGETSU","text":"Yes, I can send more of my brothers and sisters to practice at the Dawn Throne. I foresee another delivery of provisions in the near future."}],"reward":{"gil":680,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"23172","obj":{"i":23172,"n":"Elixir Mixing Paraphernalia Materials","l":150,"c":25919,"t":61}}]}