{"quest":{"name":"Trouble in Paradise","location":"Ul'dah","id":68669,"patch":4.3,"sort":156,"icon":100789,"eventIcon":71221,"issuer":1025929,"target":1025930,"genre":200,"journal":["This dismayed maiden has a horrifying story to tell about the Gold Saucer.<br>※This quest is available for a limited time only.","Still trembling from her brush with the paranormal, a dismayed maiden tells you the Gold Saucer is now host to spirits from beyond. Fearing such a disturbance could force the establishment to close down, she pleads with you to seek out Godbert Manderville, owner of the Gold Saucer, and lend him your aid to deal with this otherworldly threat.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Godbert offers you a warm welcome, but quickly takes note of your grave expression. He wastes no time in telling you what he knows of the apparitions that have taken residence in the Saucer. Though he has yet to attain an accurate description of them, his staff claim they were last seen at Event Square. ","A nearby patron, seemingly down on his luck, tells you of his plan to catch, not ghosts, but faeries he claims are hiding in the Saucer. He claims to have seen them heading in the direction of Wonder Square.","You find yet another patron whose story is more confusing than the last. He claims to have seen a pair of balloons traversing the halls toward Round Square in a rather lively fashion.","As you enter Round Square, you see a most unexpected sight. Not ghosts, faeries, or balloons, but moogles. Perhaps now you can ascertain the truth behind the Gold Saucer's troubles.","The moogles were, in fact, the otherworldly creatures that had both patrons and staff in a panic. Taking a keen interest in cultures other than their own, they could not resist the temptation of a festival at the Gold Saucer. They soon rush off to Entrance Square to apologize for the trouble they have caused.","You return to Entrance Square, the moogles in tow. Thankfully Godbert is not angry for their presence─far from it. He considers the moogles to be honored guests, and intends to waive away the recent happenings at the Saucer as part of the festival. He then takes his leave to inform the staff of their arrival, so that they may enjoy a day of mirth and merriment."],"objectives":["Speak with Godbert.","Search Event Square for signs of a disturbance.","Search Wonder Square for signs of a disturbance.","Survey Round Square at the destination specified for signs of a disturbance.","Speak to the moogle suitor.","Report to Godbert."],"dialogue":[{"name":"FRIGHTENEDWOMAN03133","text":"Ahhh! Please, stay away!"},{"name":"FRIGHTENEDWOMAN03133","text":"Oh, forgive me, I...I had a rather frightful experience at the Gold Saucer not long ago. Only now have I managed to catch my breath from running."},{"name":"FRIGHTENEDWOMAN03133","text":"As I was making for Wonder Square, I was assaulted by a pair of ghastly white creatures careening down the hallway. I glimpsed them but only for a moment before they vanished into thin air!"},{"name":"FRIGHTENEDWOMAN03133","text":"I'm convinced the place is haunted. No doubt the poor souls of gamblers who lost one too many turns of Cuff-a-Cur."},{"name":"FRIGHTENEDWOMAN03133","text":"Judging by your dress, I take it you're an adventurer, am I right? Please, you must go and purge the Gold Saucer of those spirits. With such frightful specters lurking about, it could spell the end of the establishment as we know it."},{"name":"FRIGHTENEDWOMAN03133","text":"Even as we speak, Lord Manderville is doing all he can to get the situation under control, but I fear he is at his wit's end. You must hurry, before it is too late."},{"name":"FRIGHTENEDWOMAN03133","text":"If you've yet to visit the Gold Saucer, you will need a ticket for admission. Perhaps you could try speaking with that young man over there. He's been gloating of his winnings and seems to be in a generous mood. Perhaps you can persuade him to offer you one."},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the quest “It Could Happen to You,” which can be undertaken at level 15."},{"name":"FRIGHTENEDWOMAN03133","text":"Lord Manderville is likely at the Gold Saucer deliberating on how to rid the Gold Saucer of its otherworldly infestation. Please, you must help him."},{"name":"FRIGHTENEDWOMAN03133","text":"If you've yet to visit the Gold Saucer, you will need a ticket for admission. Perhaps you could try speaking with that young man over there. He's been gloating of his winnings and seems to be in a generous mood. Perhaps you can persuade him to offer you one."},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the quest “It Could Happen to You,” which can be undertaken at level 15."},{"name":"GODBERT","text":"Well, well, if it isn't my beloved son's faithful companion, <span class=\"highlight\">Forename</span>! I presume it was word of our festival that guided your steps to the Gold Saucer?"},{"name":"GODBERT","text":"I remember you. Yes, the <span class=\"alternative-container\"><span class=\"alternative\">lovely lady</span><span class=\"alternative\">strapping gentleman</span></span> with the strong-yet-tender fingers─<span class=\"highlight\">Forename</span>. I presume it was word of our festival that guided your steps to the Gold Saucer?"},{"name":"GODBERT","text":"Ah, an adventurer. And well traveled judging by your garb. I presume it was word of our festival that guided your steps to the Gold Saucer this day?"},{"name":"GODBERT","text":"Hmmm. No, your stern expression would suggest business of some other sort. No doubt it was the rumors of apparitions haunting the Gold Saucer, then."},{"name":"GODBERT","text":"Then perhaps your arrival will mark the end to our misfortune. Indeed, there is truth to the talebearings that brought you here. My staff have reported sightings of strange, ghost-like figures floating about the halls as recently as <span class=\"alternative-container\"><span class=\"alternative\">this afternoon</span><span class=\"alternative\">last night</span><span class=\"alternative\">this morning</span></span>."},{"name":"GODBERT","text":"They seem to vanish as quickly as they appear. As such, we have yet to ascertain an accurate description of these supposed spirits. But regardless of their appearance, both my staff and patrons are beside themselves with fright. "},{"name":"GODBERT","text":"These disturbances bode ill for the Gold Saucer. Might I call upon your assistance in sleuthing out the truth behind these sightings?"},{"name":"GODBERT","text":"They were last seen at Event Square, but there seems to be no rhyme nor reason to the comings and goings of these spirits. Tread lightly, my friend. These halls are not as safe as they once were."},{"name":"GODBERT","text":"Whatever it is that stalks the halls of the Gold Saucer, it never lingers about in the same location for long. I would suggest you make haste to Event Square 'ere they vanish again into the aether."},{"name":"LOSER03133","text":"Spirits running about the Gold Saucer? I don't rightly know what they are, but I mean to catch them."},{"name":"LOSER03133","text":"Raising a chocobo for the races exhausted all of my savings, you see. But if I had those flying faeries or whatever they are, I could sell them to make up for my losses and then some."},{"name":"LOSER03133","text":"I've searched everywhere, from the Cuff-a-Curs to the Cactpot cashier counter, and nothing. I had considered giving up, but just as you arrived, I thought I saw something in the hallway here. ...You don't think they've gone off to Wonder Square, do you?"},{"name":"LOSER03133","text":"If you find anything, you won't forget about me, will you? The man who tipped you off to the faeries' whereabouts."},{"name":"TELBIKESULBI","text":"Have I seen anything strange? Well, I thought I saw two white balloons floating down the hall─rather fancifully, mind you─toward Round Square. When I blinked they were gone. Likely my eyes playing tricks on me."},{"name":"TELBIKESULBI","text":"I hate to change the subject, but... What do you think of the fragrance I'm wearing? My companion promised to meet me here, but she's nowhere to be seen! I fear my choice of aroma has driven her away."},{"name":"TELBIKESULBI","text":"&lt;sigh&gt; Oh my dear, sweet, companion. Where ever could she be?"},{"name":"SYSTEM","text":"You eye what appears to be a pair of bickering moogles, the likely cause of panic and distress in the Gold Saucer. Perhaps you should speak with them and see why they have strayed so far from the Shroud."},{"name":"GIRLMOOGLE03133","text":"Hm? If I didn't know better, I'd swear this [Race] was looking right at us. But that's silly. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> couldn't possibly see us... Could <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>?"},{"name":"YOUNGMOOGLE03133","text":"Aaahhh! My sweet! This [Race] is looking <span class=\"emphasis\">right</span> at us. What do we do!?"},{"name":"GIRLMOOGLE03133","text":"Settle down, my little pomkin. So long as you stay relaxed, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> can't possibly see us, kupo."},{"name":"YOUNGMOOGLE03133","text":"Yes... Yes, of course, kupo! As if any of these simpletons could possibly detect us. Hahaha."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Actually, I can."},{"name":"A1","text":"This <span class=\"emphasis\">simpleton</span> is about to tear your pom off."},{"name":"YOUNGMOOGLE03133","text":"&lt;gasp&gt; You <span class=\"emphasis\">can</span> see us!?"},{"name":"YOUNGMOOGLE03133","text":"Gaaahhh! I-I didn't mean it. I swear! Please say you'll forgive me. Oh pretty please!"},{"name":"GIRLMOOGLE03133","text":"You must be that adventurer we've heard so much about, with the ability to perceive that which others cannot. "},{"name":"YOUNGMOOGLE03133","text":"Ah! You're <span class=\"emphasis\">that</span> adventurer? Oh my, this is such an honor. What business would the realm's greatest hero have with the likes of us?"},{"name":"YOUNGMOOGLE03133","text":"A pair of white specters appearing and disappearing all about the Gold Saucer? Oh dear, I fear the fault for everyone's fright falls with us. Allow me to explain."},{"name":"YOUNGMOOGLE03133","text":"My sugar plum and I have always had a great interest in the culture of your kind. When I heard about this place, and that it was holding a festival, I could think of no better place to court her."},{"name":"YOUNGMOOGLE03133","text":"But with all these lights, and music, and throngs of people─it was such a shock, we inadvertently made ourselves visible to everyone here. There was screaming and poking─some even tried to catch us like playthings, kupo!"},{"name":"YOUNGMOOGLE03133","text":"We've been blinking about searching for a place to relax, and eventually made our way here."},{"name":"GIRLMOOGLE03133","text":"It was absolutely awful. I've never been so embarrassed."},{"name":"YOUNGMOOGLE03133","text":"Now, now, my little moogleypoo. We had no way of knowing what to expect when we got here."},{"name":"YOUNGMOOGLE03133","text":"I think we'll be fine now, but we really should go and speak with the owner here. Mister Manderville, I think his name was. It may be best if you accompany us, kupo. Lest we cause another unwanted surprise."},{"name":"YOUNGMOOGLE03133","text":"I bet he's back at the entrance, apologizing to his poor guests. Let's hurry and set things straight."},{"name":"GODBERT","text":"You are returned. With some clue as to the source of our troubles, I should hope."},{"name":"YOUNGMOOGLE03133","text":"Ahem. I believe we are the source of the distress you speak of, sir."},{"name":"GODBERT","text":"Moogles! My, what a most unexpected surprise. Let me have a better look at you."},{"name":"GODBERT","text":"Simply marvelous! Milky white fur like pearls, with forms as perfectly round. And your poms. They glow like crimson jewels, yet they seem so soft. If I may, would you permit me to inspect them more closely?"},{"name":"GIRLMOOGLE03133","text":"I would much prefer that you didn't, kupo..."},{"name":"YOUNGMOOGLE03133","text":"This adventurer told us of the confusion we unwittingly caused, and we came to apologize."},{"name":"GODBERT","text":"I see! You are the spirits that allegedly haunt the halls of the Gold Saucer. Knowing now the source of the problem, we need only look around us to see the solution."},{"name":"GODBERT","text":"The likeness of moogles is a common sight here in the Gold Saucer. To say your presence was requested as part of the festival should more than suffice to explain what was seen here today."},{"name":"GODBERT","text":"Misunderstandings aside, it is an honor to have you as guests."},{"name":"GODBERT","text":"I will inform the staff, and see to it you are able to make use of our facilities even should you choose not to reveal yourselves to anyone else."},{"name":"YOUNGMOOGLE03133","text":"Thank you, Mister Manderville, thank you! At last, another chance to woo─Ahem. To work on my aim at the monster toss. Yes, that's it, kupo!"},{"name":"YOUNGMOOGLE03133","text":"Before that, though, I have a favor to ask of you. If it's not too much trouble, of course."},{"name":"GODBERT","text":"I shall leave you three to your merrymaking, then. The staff must be made aware of our special guests."},{"name":"GODBERT","text":"Pray, enjoy the delights of the Gold Saucer to your hearts' content."},{"name":"SYSTEM","text":"You can now purchase seasonal items from the campaign attendant. Please note that you will be unable to do so after the seasonal event has ended. For details, please check the Lodestone."},{"name":"GIRLMOOGLE03133","text":"We won't reveal ourselves until we're absolutely sure it's safe. We don't want any more trouble."},{"name":"YOUNGMOOGLE03133","text":"He's certainly an imposing figure, isn't he? I hope he isn't cross with us, kupo."}],"reward":{"items":[{"id":14971}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66043,66064]},"next":[68670]},"partials":[{"type":"npc","id":"1025929","obj":{"i":1025929,"n":"Dismayed Maiden","l":40,"q":1}},{"type":"npc","id":"1025930","obj":{"i":1025930,"n":"Godbert","l":1484,"q":1}},{"type":"item","id":"14971","obj":{"i":14971,"n":"MGP Gold Card","l":1,"c":26173,"t":61}},{"type":"quest","id":"66043","obj":{"i":66043,"n":"The Gridanian Envoy","g":1,"l":"Gridania","s":86}},{"type":"quest","id":"66064","obj":{"i":66064,"n":"The Ul'dahn Envoy","g":1,"l":"Ul'dah","s":88}},{"type":"quest","id":"68670","obj":{"i":68670,"n":"Love and Kupo Nuts","g":200,"l":"The Gold Saucer","s":157,"r":1}}]}