{"quest":{"name":"Taking the Plunge","location":"The Azim Steppe","id":68661,"patch":4.3,"sort":27,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22716],"journal":["Seigetsu the Enlightened has learned of a celebration even he would not try.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the nervous Namazu.","Deliver the requested supplies to the nervous Namazu.","Search for signs of the nervous Namazu around the Dawn Throne.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the nervous Namazu.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the nervous Namazu</span><span class=\"alternative\">Mine [Error] northeast of the Dawn Throne</span><span class=\"alternative\">Gather [Error] northeast of the Dawn Throne</span><span class=\"alternative\">Catch [Error] in the lower Yat Khaal</span></span>.","Search for signs of the nervous Namazu around the Dawn Throne.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"<span class=\"emphasis\">Over the Horizon</span> describes a most peculiar festival from the west wherein tribesmen jump from atop cliffs with no promise of safety save for a bit of rope tethered to their waists."},{"name":"KOFUINSEIGETSU","text":"Truth be told, even I balked at the thought of undertaking such a death-defying feat. Imagine my surprise when a number of my kin stepped forward, eager for an opportunity to prove their bravery."},{"name":"KOFUINSEIGETSU","text":"Even now the thought of such a death-defying feat leaves my whiskers all aquiver. Imagine my surprise to see a number of my kin step forward, eager for yet another opportunity to prove their bravery."},{"name":"KOFUINSEIGETSU","text":"In fact, one of them is at the Dawn Throne this very moment, preparing to jump from its dizzying heights. Would you go and see that he is duly prepared? This is one celebratory practice I would rather not see go awry."},{"name":"DAILYNAMAZUO03125","text":"A coward they called me. A craven! But after this, they'll never call me names again. No, no."},{"name":"DAILYNAMAZUO03125","text":"No one believes that I made the jump, that I dived from the throne into the waters below. But I'm sure they'll believe me this time. Positive!"},{"name":"DAILYNAMAZUO03125","text":"Seigetsu sent you to help, yes, yes? Wonderful! I could use an extra pair of fins─or hands, in your case─to get everything in order.  "},{"name":"DAILYNAMAZUO03125","text":"Could I trouble you to fashion two bolts to secure my rope? You'll find everything you need in that crate."},{"name":"DAILYNAMAZUO03125","text":"Could I trouble you to fashion a pair of ropes for the jump? They need to be rather long, and sturdy besides. Everything you need should be in that crate."},{"name":"DAILYNAMAZUO03125","text":"Could I trouble you to fashion two bottles of resin to reinforce the rope? You'll find everything you need in that crate."},{"name":"DAILYNAMAZUO03125","text":"I need something heavy to secure the stump to which the rope will be tied. If you check the rock formations just northeast of the Dawn Throne, I'm sure you'll find slabs of stone suitable to the task. Yes, yes."},{"name":"DAILYNAMAZUO03125","text":"I need something sturdy to reinforce my rope. If you check the flora just northeast of the Dawn Throne, I'm sure you'll find vines suitable to the task. Yes, yes."},{"name":"DAILYNAMAZUO03125","text":"I need something sturdy to secure my harness. Do you suppose you could take a few pots of salmon roe to the lower Yat Khaal and catch a granite hardscale for me? Their scales should make for good fasteners."},{"name":"DAILYNAMAZUO03125","text":"Please try not to take too long. I fear if I don't do this soon, my nerves may get the better of me."},{"name":"DAILYNAMAZUO03125","text":"If you're wanting for supplies, you're more than welcome to my crate."},{"name":"DAILYNAMAZUO03125","text":"If you're wanting for supplies, you're more than welcome to my crate."},{"name":"DAILYNAMAZUO03125","text":"If you're wanting for supplies, you're more than welcome to my crate."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03125","text":"The rocks near the Dawn Throne looked quite weighty─perfect to secure the stump. I trust you'll find a slab suited to the task at hand."},{"name":"DAILYNAMAZUO03125","text":"The vines growing near the Dawn Throne looked quite resilient─perfect to reinforce my rope. I trust you'll find one suited to the task at hand."},{"name":"DAILYNAMAZUO03125","text":"A granite hardscale from the lower Yat Khaal would be perfect. Their scales are quite tough─exactly what I need to secure my harness."},{"name":"DAILYNAMAZUO03125","text":"Everything is nearly ready. I hope my request wasn't too demanding of you."},{"name":"DAILYNAMAZUO03125","text":"Oh! This will do nicely. Yes, yes. Now I have everything I need."},{"name":"DAILYNAMAZUO03125","text":"It sure is a long way down from here... B-But I said I'd do it. So I'll do it."},{"name":"DAILYNAMAZUO03125","text":"&lt;gulp&gt; It seems farther down than I last remember... B-But I said I'd do it. So I'll do it."},{"name":"DAILYNAMAZUO03125","text":"Well. Here I go!"},{"name":"DAILYNAMAZUO03125","text":"&lt;gasp&gt; The roooooope!!!"},{"name":"SYSTEM","text":"You hear a faint splash in the waters down below."},{"name":"DAILYNAMAZUO03125","text":"Where...where am I?"},{"name":"DAILYNAMAZUO03125","text":"The light, it...it was so warm, so welcoming."},{"name":"DAILYNAMAZUO03125","text":"I... I saw the light again. And there was a voice! So gentle. So inviting..."},{"name":"DAILYNAMAZUO03125","text":"But I had to stay here. To see the others' looks of surprise. Of awe."},{"name":"DAILYNAMAZUO03125","text":"Go... Go and tell them what I've done."},{"name":"DAILYNAMAZUO03125","text":"No need to worry. I'll...I'll be fine..."},{"name":"SYSTEM","text":"Perhaps now is not the best time to be inspecting the crate."},{"name":"KOFUINSEIGETSU","text":"Ah, you are returned. So he really went through with it?"},{"name":"KOFUINSEIGETSU","text":"And he forgot the rope, you say? Hmmm. Well we can hardly call it a success if he failed to follow my instructions, now can we?"},{"name":"KOFUINSEIGETSU","text":"He forgot his rope again!? This is beginning to sound more like an attempt at suicide than a festival event."},{"name":"KOFUINSEIGETSU","text":"If such a lack of preparation becomes a common occurrence, though I pray it doesn't, perhaps we should forgo the use of rope altogether. It would, after all, serve to distinguish our event from the ritual practices of the west."},{"name":"KOFUINSEIGETSU","text":"I must give this some thought. Should any of my kin be willing to undertake yet another test of courage, however, I should hope you will be ready to assist us again."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":7,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22716","obj":{"i":22716,"n":"Land Diving Gear Materials","l":150,"c":25919,"t":61}}]}