{"quest":{"name":"The Deadliest Sport","location":"The Azim Steppe","id":68665,"patch":4.3,"sort":28,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"usedItems":[22719],"journal":["Seigetsu the Enlightened is preparing for a new competition.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the Namazu gatherer.","You have spoken with the Namazu gatherer.<br>Deliver the requested goods to Gyoka.","Report to Seigetsu the Enlightened."],"objectives":["Speak with the Namazu gatherer.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Gyoka</span><span class=\"alternative\">Mine [Error] at Ceol Aen</span><span class=\"alternative\">Gather [Error] at Ceol Aen</span><span class=\"alternative\">Catch [Error] at Dotharl Khaa</span></span>.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"You wouldn't happen to know a young man by the name Honoroit Banlardois, would you? I recently happened upon travel literature chronicling his journeys through the Sea of Clouds. Quite the riveting read."},{"name":"KOFUINSEIGETSU","text":"In his writings he speaks of the Vanu Vanu, an indigenous beast tribe of the region who practice a most peculiar sport involving paissas. It is a fierce competition granting great honor to its victors. So moved was I by their enthusiasm for this pastime that I made straightways for Kugane to seek out paissas of our very own."},{"name":"KOFUINSEIGETSU","text":"Though costly, I succeeded in acquiring several. The problem, however, is they appear to be completely and utterly indolent. If not for their breathing one might mistake them dead animals strewn about for some ill-conceived grotesquerie."},{"name":"KOFUINSEIGETSU","text":"We need something to spur them into action. Or at the very least, active enough to be recognized as amongst the living."},{"name":"KOFUINSEIGETSU","text":"One of our festival volunteers has gone north to Ceol Aen in search of materials to create something─anything─that might rouse the paissas from their torpidity. Would you go and see if there is aught you can do to assist him?"},{"name":"DAILYNAMAZUO03129","text":"Ah, a helping hand from Seigetsu? It is greatly appreciated, yes, yes. A most welcome sight indeed."},{"name":"DAILYNAMAZUO03129","text":"I was tasked with creating something that may draw the paissas' interest, but I haven't a clue where I might begin."},{"name":"DAILYNAMAZUO03129","text":"If I were a paissa, I imagine I'd do anything for a korrigan doll. Do you suppose you can make one? If there's anything you might need, I guarantee you'll find it in this crate. Yes, yes."},{"name":"DAILYNAMAZUO03129","text":"If I were a paissa, I imagine I'd do anything for a korrigan doll. Do you suppose you can make one? If there's anything you might need, I guarantee you'll find it in this crate. Yes, yes."},{"name":"DAILYNAMAZUO03129","text":"If I were a paissa, I imagine I'd do anything for a korrigan doll. Do you suppose you can make one? If there's anything you might need, I guarantee you'll find it in this crate. Yes, yes."},{"name":"DAILYNAMAZUO03129","text":"If I were a paissa, I imagine I'd do anything for something sparkly. Like a steppe glowstone, perhaps. I'd be ever so grateful if you could bring back the brightest, most radiant glowstone you can find. And you won't have to go far, no, no. The mineral deposits here in Ceol Aen are rich with them!"},{"name":"DAILYNAMAZUO03129","text":"If I were a paissa, I imagine something with a refreshing, invigorating scent would get me up and about. Like steppe wildgrass, perhaps. I'd be ever so grateful if you could bring back the most fragrant, sweet-smelling wildgrass you can find. And you won't have to go far, no, no. Ceol Aen is rich with it!"},{"name":"DAILYNAMAZUO03129","text":"If I were a paissa, I imagine I'd do anything for a plump, succulent cog. I'd be ever so grateful if you could catch one from the waters of Dotharl Khaa. All you'll need is a little salmon roe and patience."},{"name":"DAILYNAMAZUO03129","text":"When you've finished, you can deliver it to Gyoka. He's been tasked with caring for the paissa."},{"name":"DAILYNAMAZUO03129","text":"If you're short on materials, there's no need to be shy. You're more than welcome to my supply crate. Yes, yes."},{"name":"DAILYNAMAZUO03129","text":"If you're short on materials, there's no need to be shy. You're more than welcome to my supply crate. Yes, yes."},{"name":"DAILYNAMAZUO03129","text":"If you're short on materials, there's no need to be shy. You're more than welcome to my supply crate. Yes, yes."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"The crate appears to be filled to the brim with sundry materials─none of which you require at this time."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"SYSTEM","text":"You sift through the cornucopia of crafting materials and retrieve all you require for your work."},{"name":"DAILYNAMAZUO03129","text":"I'm quite certain you can find steppe glowstones here at Ceol Aen. Yes, yes, quite positive. After you've found one, take it to Gyoka."},{"name":"DAILYNAMAZUO03129","text":"I'm quite certain you can find steppe wildgrass here at Ceol Aen. Yes, yes, quite positive. After you've found some, take it to Gyoka."},{"name":"DAILYNAMAZUO03129","text":"I'm quite certain you can find cogs in the waters of Dotharl Khaa. Yes, yes, quite positive. After you've caught one, take it to Gyoka."},{"name":"DAILYNAMAZUO03129","text":"Oh my, how lovely! It looks like you're ready to see Gyoka, then. Well, don't let me keep you. Take care."},{"name":"GYOKA","text":"At first I was thrilled that I would get to look after the paissas. “At last,” I thought, “a new endeavor to occupy my time.” &lt;sigh&gt; But the paissas refuse to do aught but lay about and sleep. I consulted Seigetsu and he too was at a loss as to how we might motivate them."},{"name":"GYOKA","text":"Some would say I'm the most perceptive of the Namazu. Yes, yes. My eyes are quite sharp. It's only natural that I'd be chosen to serve as referee for the paissa competition. "},{"name":"GYOKA","text":"But there can be no competition if they remain so sluggish. &lt;sigh&gt; If only there was some way to light a fire under them... N-Not literally, of course."},{"name":"GYOKA","text":"&lt;sigh&gt; Why is it so hard to keep the paissas in good spirits..."},{"name":"GYOKA","text":"Oh! I remember you. Does this mean Seigetsu sent you with more goods for the paissas?"},{"name":"GYOKA","text":"Thank you, thank you. They're sure to love this. Yes, yes. This is certain to get them moving."},{"name":"GYOKA","text":"Tell Seigetsu that all will be well. For now, at least. And when you're finished, I'd be more than happy to show you the paissas if you'd like."},{"name":"KOFUINSEIGETSU","text":"You needn't say a word. Even from here I could see Gyoka jumping with joy."},{"name":"KOFUINSEIGETSU","text":"Perhaps now we can entice the paissas to do more than loaf about. These competitions can be quite fierce, if the accounts in my readings are anything to go by. If you care to see for yourself, I would suggest speaking with Gyoka."},{"name":"SYSTEM","text":"Thanks to your efforts, the paissas have regained their fighting spirit. You may speak with Gyoka at any time to go and observe the paissa competition."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."},{"name":"SYSTEM","text":"Normal-quality items gathered in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":8},{"id":22525},{"num":20,"id":9},{"id":22525},{"num":20,"id":10},{"id":22525},{"num":20,"id":11},{"id":22525},{"num":20,"id":12},{"id":22525},{"num":20,"id":13},{"id":22525},{"num":20,"id":8},{"id":22525},{"id":6141},{"id":22525},{"id":6141},{"id":22525},{"id":6141}]},"reqs":{"beastrank":7,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}},{"type":"item","id":"22719","obj":{"i":22719,"n":"Korrigan Doll Materials","l":150,"c":25919,"t":61}}]}