{"quest":{"name":"On the Shoulders of Giants","location":"The Ruby Sea","id":68668,"patch":4.35,"sort":120,"icon":100778,"unlocksFunction":1,"eventIcon":71341,"issuer":1025846,"target":1025846,"genre":87,"journal":["Kyusei is eager to hear your tales of Heaven–on–High.","Having returned from the thirtieth floor of Heaven–on–High, you seek out Kyusei to deliver your report. However, he seems uninterested in discussing your findings and, surprisingly, admits that not everything he has told you thus far has been the truth. He seems even more furtive than usual as he asks you to meet him in a secluded area of the coastline, presumably to discuss the circumstances surrounding the tower.","Rasho arrives at the agreed location accompanied by Kyusei and two other Confederates, with all but Rasho dressed in unusual, matching attire. Kyusei reveals that he and his similarly clothed companions are in fact members of the Onishishu, a clandestine organization that researches ancient relics and maintains the aetherytes of Othard. He goes on to explain that Heaven–on–High was built thousands of years ago by his predecessors as a proving ground for warriors who would one day become protectors of the realm. The founder of the Confederacy was one such warrior and succeeded in besting Hiruko, the guardian of the thirtieth floor, before devoting his life to protecting the Ruby Sea. The Confederacy and the Onishishu have shared close ties ever since, and each Confederate leader must follow the founder's example by battling Hiruko. Kyusei hints at further mysteries involving Hiruko and the tower itself, the answers to which can be found at the Ten–thousand–year Pine.","The Ten–thousand–year Pine conceals a device that projects images recorded in the days following the fall of the Allagan Empire. You witness a conversation between a man who appears to be the founder of the Onishishu and one of his apprentices. It is revealed that he gave his life to activate Hiruko, an artificial being created to face those who would challenge Heaven–on–High. Following the noble scholar's final soliloquy, the recording comes to a close and the Ten–thousand–year Pine falls silent once more.","Kyusei is pleased that you have seen the recording left by the Onishishu founder. He reminds you that defeating Hiruko is but a malmstone in the ascent of Heaven–on–High, and that greater challenges lie ahead. Upon hearing this, you cannot help but wonder what formidable foes await in the upper reaches of Heaven–on–High."],"objectives":["Wait for Kyusei.","Investigate the Ten–thousand–year Pine.","Speak with Kyusei."],"dialogue":[{"name":"KYUSEI","text":"Ah, <span class=\"highlight\">Forename</span>. Full glad am I to see you returned safe and well. As for your report on creature activity inside the tower, we shan't be needing it. That you reached the thirtieth floor and vanquished the one known as Hiruko are all the results we require."},{"name":"KYUSEI","text":"Yes, that talk of investigations was something of a false pretext. Perhaps the time has come to share the truth."},{"name":"KYUSEI","text":"If you wait for me at the rocky outcrop south of Quickscape Pier, I shall explain all."},{"name":"RASHO","text":"So Kyusei's ready to come clean, is he? I suggest you go and see what he has to say for himself."},{"name":"RASHO","text":"There you are, <span class=\"highlight\">Forename</span>. Now that you have triumphed over Hiruko, we can finally end this charade. For my part, you have my deepest apologies."},{"name":"KYUSEI","text":"Nay, there is no need for that. Rasho was only acting in accordance with my instructions that my fabrications might secure your cooperation."},{"name":"KYUSEI","text":"Know that I have only been masquerading as a Confederate. In truth, I am a member of the Onishishu."},{"name":"KYUSEI","text":"Ours is a sacred brotherhood which has endured for millennia. That we may safeguard our knowledge, we side with no nation and strive to remain neutral in political affairs. Accordingly, we are wary of placing our trust in those with whom we have yet to establish rapport."},{"name":"RASHO","text":"In that respect, the Onishishu have something in common with the Confederacy."},{"name":"KYUSEI","text":"You have the right of it there, Rasho! Though I must say, you are not likely to find Onishishu members demanding tribute from seafarers or crossing swords with imperials."},{"name":"KYUSEI","text":"In all fairness, I should like to think we all serve the realm in our own way. For our part, my organization seeks the lost knowledge of the Allagans, that it may benefit the peoples of the modern world. The creation and maintenance of Aethernets is one such example."},{"name":"KYUSEI","text":"Though my duties are many and varied, keeping watch over Heaven–on–High is among the most important."},{"name":"KYUSEI","text":"Very few people know this, but this tower was built as a training ground thousands of years ago by the founding members of the Onishishu. They foresaw that a great calamity would befall this star and in preparation sought to instruct warriors in warcraft."},{"name":"RASHO","text":"To keep the island free of intruders, tales of holy-this and sacred-that were spread throughout the Ruby Sea. Only the truly fearless would dare approach."},{"name":"RASHO","text":"The founder of the Confederacy was one such brave soul. He reached the thirtieth floor of Heaven–on–High and triumphed over its guardian, but found that he could go no farther."},{"name":"RASHO","text":"Abandoning his conquest of the tower, he decided to become a protector of the Ruby Sea. Every Confederate leader since has used the thirtieth floor as the yalmstick by which we measure ourselves. And, like him, we aid the Onishishu in their search for would-be heroes."},{"name":"KYUSEI","text":"The higher-ups of your organization have always been our staunchest supporters, allowing us to go about our work while we ostensibly serve as members of your crew. Imagine our delight when you suggested the Warrior of Light <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> as a candidate to challenge the tower!"},{"name":"KYUSEI","text":"Yes, like Rasho and the pirate captains before him, you bested Hiruko. He looked into your soul and found you worthy. Were you found wanting, well...I am sure you can guess the fate of those who do not pass muster."},{"name":"KYUSEI","text":"Yet his is a tragic tale. For one of our revered predecessors made the ultimate sacrifice so that Hiruko may be given life."},{"name":"KYUSEI","text":"But rather than listen to my account, perhaps you had best see for yourself. Please, make your way to the Ten–thousand–year Pine."},{"name":"KYUSEI","text":"Though it may appear to be much like any other pine tree, it is far from ordinary. It stands to the northwest of the tower."},{"name":"RASHO","text":"After I climbed the tower and defeated Hiruko all those moons ago, I too was instructed to visit the Ten–thousand–year Pine. It is quite safe, I assure you."},{"name":"Q1","text":"Travel to the Ten–thousand–year Pine?"},{"name":"SUBMANAGER03132","text":"(-Voice from the Ten-thousand-year Pine-)&lt;beep&gt; Auxiliary protocol system activated. Verifying access permission... Security clearance for floor thirty-one confirmed. Initiating archive footage projection."},{"name":"SECONDLEADER03132","text":"Hiruko's incubation period is almost over. All that remains is to add the final...ingredient."},{"name":"SECONDLEADER03132","text":"But Master, must you go through with this?"},{"name":"FIRSTLEADER03132","text":"I have lived more than long enough. Perhaps this way, I can finally make myself useful."},{"name":"SECONDLEADER03132","text":"How can you say that? The Onishishu gave all of us a purpose. We would be nothing without you!"},{"name":"FIRSTLEADER03132","text":"Oh? Did I bless you all with your intellectual curiosity? Your drive and ambition? Come. I but brought you together. A minor achievement compared to those of my dearly departed friends."},{"name":"FIRSTLEADER03132","text":"They gave their lives that the world might be spared Allag's fate. Though my sacrifice pales in comparison, I should be glad to be of service. Save your words─I will not be swayed."},{"name":"SECONDLEADER03132","text":"You never were one to change your mind. Then I can do naught but pray you find some measure of peace beyond this life."},{"name":"FIRSTLEADER03132","text":"Our fleeting existences may seem inconsequential in the grand scheme of things, but with them we lay the foundations upon which those who come after may build something greater."},{"name":"SECONDLEADER03132","text":"I will forever treasure your words, Master."},{"name":"FIRSTLEADER03132","text":"You are the master now. Take care of our brothers and sisters."},{"name":"SECONDLEADER03132","text":"...Until we meet again. Until our souls are reunited."},{"name":"FIRSTLEADER03132","text":"A lovely thought, to see all who I hold dear once more. Those I leave behind, and those who have left <span class=\"emphasis\">me</span> behind. Princess Salina, Desch..."},{"name":"FIRSTLEADER03132","text":"If you are watching over me, know this: the Onishishu will continue your legacy."},{"name":"FIRSTLEADER03132","text":"As for me, I have my own duties to perform. I hope I will not keep you waiting for too long."},{"name":"SUBMANAGER03132","text":"(-Voice from the Ten-thousand-year Pine-)&lt;beep&gt; Terminating archive footage projection. Auxiliary protocol system returning to standby mode."},{"name":"RASHO","text":"Hmmm... A noble cause, to be sure. While we Confederates have our own ideas about honor and duty, I have to admit that saving the world and other such grand aims are beyond our ken."},{"name":"RASHO","text":"I can tell you're cut from a different cloth, though. If the rumors about you are true, you could be exactly what the Onishishu have been searching for all these years."},{"name":"KYUSEI","text":"So, what did you think? The millennia that have passed since the recording have not aged our founder one bit. Ah, the wonders of ancient technology... A pity it is only a projection, though."},{"name":"KYUSEI","text":"Hiruko is also looking rather well for his age. Of course, that can be attributed to the automated systems that revive him after every defeat."},{"name":"KYUSEI","text":"Provided that the machinery is carefully maintained, Hiruko should continue to function as judge─and in most cases, executioner─of those who would climb the tower. That is, until the trials of Heaven–on–High are no longer necessary."},{"name":"KYUSEI","text":"Which reminds me, as you will have no doubt noticed, the tower has more than the thirty floors you have visited. Many more, in fact."},{"name":"KYUSEI","text":"Of course, even as things stand, you will be forever counted among the finest warriors the world has ever known. None would think any less of you were that to be your final foray into Heaven–on–High."},{"name":"KYUSEI","text":"And yet, I sense a yearning within you, for ever greater challenges, ever stronger opponents. Such a desire is not a thing to be feared, it is to be embraced. Yes, the tower calls to you, my friend."},{"name":"KYUSEI","text":"I and my Onishishu brethren shall be waiting for you. Until next time."},{"name":"SYSTEM","text":"You can now explore beyond floor 30 of Heaven–on–High."},{"name":"SYSTEM","text":"To learn the requirements for entering floor 31 and upwards, speak with Kyusei."},{"name":"SYSTEM","text":"You may now consume empyrean aetherpool gear strength to obtain empyrean aetherpool grips from the Confederate custodian."},{"name":"SYSTEM","text":"Empyrean aetherpool grips can then be exchanged for weapons that appear identical to empyrean aetherpool arms but can be used outside of Heaven–on–High."}],"reward":{"gil":754},"reqs":{"jobs":[{"lvl":61,"id":142}],"quests":[68667]}},"partials":[{"type":"npc","id":"1025846","obj":{"i":1025846,"n":"Kyusei","l":2409,"q":2}},{"type":"quest","id":"68667","obj":{"i":68667,"n":"Knocking on Heaven's Door","g":87,"l":"The Ruby Sea","s":110,"f":1}}]}