{"quest":{"name":"Bull's-eye","location":"The Azim Steppe","id":68660,"patch":4.3,"sort":22,"interval":"daily","repeatable":1,"beast":11,"eventIcon":71222,"issuer":1025602,"target":1025602,"genre":55,"journal":["Seigetsu the Enlightened has need of your keen eye and sharp aim.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Gyobi, then use the bow to shoot the specified targets.","Speak with Gyobi.","Report to Seigetsu the Enlightened."],"dialogue":[{"name":"KOFUINSEIGETSU","text":"Ah, what fortuitous timing. You recall our recent rehearsal for the archery game taught to us by the Dotharl, yes? Simple though it may be, I took it upon myself to modify their techniques to better suit our soon-to-be refined tastes. "},{"name":"KOFUINSEIGETSU","text":"Indeed, I have done all I can so that even the likes of Gyoshin should have no trouble participating, yet it seems my kin are wholly inept at this seemingly facile skill."},{"name":"KOFUINSEIGETSU","text":"To remedy this problem, I would have them bear witness once more to your exceptional marksmanship. Gyobi awaits you at the shooting gallery, hopefully with pen and paper to take notes."},{"name":"GYOBI","text":"Thank you for coming. We're all quite excited to see your skill with a bow. Yes, yes, delighted. I realize I'm the only one watching, but...I'm quite sure that's how the others feel."},{"name":"GYOBI","text":"Whenever you're ready, take aim and fire away!"},{"name":"SYSTEM","text":"Take aim at the Festival Targets, zoom in to avoid accidents, and fire with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"GYOBI","text":"That was amazing! How are you able to aim so precisely?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I hold my breath."},{"name":"A1","text":"I calm my spirit and focus."},{"name":"A1","text":"It's all in the wrist!"},{"name":"GYOBI","text":"Of course! By holding your breath it's easier to keep still. Yes, yes. Unmoving like stone."},{"name":"GYOBI","text":"Calm your spirit, you say? And focus... Now that you mention it, the look in your eyes was rather intense. Yes, yes. Like Seigetsu when he's reading his favorite books."},{"name":"GYOBI","text":"Your wrists...? Ah, your wrist bands! I see. I never realized the answer could be so simple."},{"name":"GYOBI","text":"You've given me much to think on─a treasure trove of knowledge to digest. I'll be sure to share everything you've taught me with the others."},{"name":"GYOBI","text":"Thank you again for the archery lesson. We have much to practice before the festival. Yes, yes."},{"name":"KOFUINSEIGETSU","text":"I could hear Gyobi's cries of admiration from here. No doubt she's been duly inspired by your prowess."},{"name":"KOFUINSEIGETSU","text":"Though there still remains the matter of finding a bow that isn't unwieldy in our fins."},{"name":"KOFUINSEIGETSU","text":"Or perhaps we needn't use a bow at all. We could use something smaller, like a pistol! But first I must find volunteers to serve as targets..."}],"reward":{"gil":615,"reputation":60,"items":[{"id":22525}]},"reqs":{"beastrank":6,"jobs":[{"lvl":60,"id":35}]}},"partials":[{"type":"npc","id":"1025602","obj":{"i":1025602,"n":"Seigetsu The Enlightened","l":2411,"q":28}},{"type":"item","id":"22525","obj":{"i":22525,"n":"Namazu Koban","l":1,"c":65064,"t":100}}]}