{"quest":{"name":"Love and Kupo Nuts","location":"The Gold Saucer","id":68670,"patch":4.3,"sort":157,"repeatable":1,"icon":100790,"eventIcon":71222,"issuer":1025927,"target":1025927,"genre":200,"journal":["This moogle suitor is in need of advice.<br>※This quest is available for a limited time only.","The moogles are free to enjoy the sights and sounds of the Gold Saucer at their leisure. As the moogle maiden runs off, excited to begin their romp through the grounds, the moogle suitor makes a confession. The purpose for their coming to the Saucer is so he can ask for her paw in marriage. Before that can happen, however, he wishes to take her on the perfect romantic outing, and he needs your help. Having laid bare his plans, he rushes after his love to Event Square.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Their outing will begin with the Moogle's Paw. Or so they think. When they arrive, the machine is already in use. The moogle suitor suggests they patiently wait their turn, but so long as they remain hidden, the moogle maiden fears the patrons in front of them may never realize others are waiting. Fearing his lady love grows despondent, the moogle suitor excuses himself to seek your advice. He follows your words to the letter, and he seems to have pleased his companion as a result. Seeking a brief respite, they make for Wonder Square.","At last, they have a chance to rest. The view from the upper floor of Wonder Square is beautiful, and the moogle suitor intends to make the most of the moment. At a loss as to how to do that, he once again turns to you for sage council. Your plan seems to have worked. All things considered, the moogle maiden appears to be enjoying herself. They prepare to return to Entrance Square, where the moogle suitor plans to make a bold move.","You offer the moogle suitor a few final words of encouragement. Emboldened, he returns to the moogle maiden to profess his love, and ask her to marry him. The result is...not what you expected. But regardless of the dubious outcome, the couple is pleased with how the day turned out.","The moogle suitor did not woo his lady love as he had hoped, but he is not a quitter. As they plan to remain at the Gold Saucer a while longer, perhaps there is hope he will win her heart. With your help, of course."],"objectives":["Watch over the moogle lovers at the designated location.","Speak with the moogle suitor."],"dialogue":[{"name":"SYSTEM","text":"This quest contains branching sections, and the conclusion of this quest may differ depending on the choices you make. However, the rewards will remain the same."},{"name":"YOUNGMOOGLE03134","text":"Thank you again for your help earlier. I wasn't expecting the owner to be so kind and understanding."},{"name":"YOUNGMOOGLE03134","text":"Not only that, he's promised to ensure we can enjoy all the games without having to be seen."},{"name":"YOUNGMOOGLE03134","text":"Yes, today is certain to be a wonderful day, kupo! Isn't that right, snookums?"},{"name":"YOUNGMOOGLE03134","text":"Ah, fancy meeting you here again. We were just about to go on another romp through the Gold Saucer. Isn't that right, snugglebum?"},{"name":"GIRLMOOGLE03134","text":"There's so much to do, so much to see. I cannot wait any longer! Come, honeybunch, I want to see what's at Event Square."},{"name":"YOUNGMOOGLE03134","text":"And there she goes! You haven't forgotten that favor I mentioned before, have you?"},{"name":"YOUNGMOOGLE03134","text":"I'm not the spry, young moogle I used to be, and lately I've been thinking of settling down... Oh, my sweet butter bun─I can't imagine life without her. That's why I mean to propose!"},{"name":"YOUNGMOOGLE03134","text":"But today needs to be absolutely perfect, and I need your help to make that happen, kupo."},{"name":"YOUNGMOOGLE03134","text":"Now, let's not keep her waiting, lest we sour the mood."},{"name":"GIRLMOOGLE03134","text":"I've never seen anything so colorful, so vibrant. I wish to see every ilm of this place, kupo. From top to bottom."},{"name":"YOUNGMOOGLE03134","text":"What do you think of this game, pommypie? You operate a toy moogle to fetch prizes out of the tank. Doesn't that sound fun?"},{"name":"GIRLMOOGLE03134","text":"I suppose so, but the people before us won't realize we're waiting, hidden as we are. There's no telling how long they will stay here. Oh kupokins, what are we to do?"},{"name":"YOUNGMOOGLE03134","text":"Hold that thought, my little apple dumpling. I'll see if there's aught I can do to move things along."},{"name":"YOUNGMOOGLE03134","text":"Please, you have to help! At our present snail-like pace, today's outing will be a failure, kupo!"},{"name":"YOUNGMOOGLE03134","text":"The people presently in front of us seem insistent on fishing out every toy in the tank. What do you think we should do? "},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Be patient. They'll move soon enough."},{"name":"A1","text":"You should reveal yourselves to them."},{"name":"A1","text":"How about an innocent little prank?"},{"name":"YOUNGMOOGLE03134","text":"I suppose it's as they say about patience and virtue, or some such. &lt;sigh&gt; All right. We'll wait our turn. "},{"name":"YOUNGMOOGLE03134","text":"Hmmm. Mister Manderville did say it should be safe to do so. All right. We'll show ourselves."},{"name":"YOUNGMOOGLE03134","text":"A bit of fun to help move them along, eh? An interesting proposal indeed. All right. I'll give it a try."},{"name":"YOUNGMOOGLE03134","text":"Wish me luck, kupo. Hopefully this will serve to keep my dear fluffems in good spirits."},{"name":"YOUNGMOOGLE03134","text":"That actually went rather well. We began talking of our favorite kupo nut recipes, and time practically flew by. In fact, it felt as though we didn't have to wait at all."},{"name":"YOUNGMOOGLE03134","text":"Thankfully no one was afraid once we uncloaked ourselves. Quite the contrary, we could scarcely keep people away. The children especially. Their constant pom squeezing was...unpleasant, to say the least."},{"name":"YOUNGMOOGLE03134","text":"It's been too long since I played a good prank. Even if it was only a little one, it was enough to move them along, and the children nearby certainly had a good laugh."},{"name":"YOUNGMOOGLE03134","text":"The Moogle's Paw was quite fun, but also very exhausting, kupo. We plan to visit Wonder Square next for a short reprieve."},{"name":"YOUNGMOOGLE03134","text":" I hope to see you there. Preferably somewhere my little cream puff won't notice."},{"name":"GIRLMOOGLE03134","text":"Would you look at all these balloons and illuminations. A pity we haven't such wondrous things back home, kupo."},{"name":"YOUNGMOOGLE03134","text":"It brings me great joy to see you so happy, my dear kuppycake, though nothing could be so wondrous as your smile."},{"name":"GIRLMOOGLE03134","text":"Oh fluff muffin, you're so sweet. Ah, I shall treasure this moment always."},{"name":"YOUNGMOOGLE03134","text":"(If we're to stay here a while longer, perhaps I can do something to impress her. But what...?)"},{"name":"YOUNGMOOGLE03134","text":"Excuse me a moment, pookie pom."},{"name":"YOUNGMOOGLE03134","text":"She seems to be quite taken with the view up here, kupo. And while the mood is right, I'd like to do something to set her heart aflutter. Any thoughts? "},{"name":"Q2","text":"What will you suggest?"},{"name":"A2","text":"Woo her with a song."},{"name":"A2","text":"Enjoy a quiet moment together."},{"name":"A2","text":"Celebrate with a toast of wine."},{"name":"YOUNGMOOGLE03134","text":"Of course! I can sing her a song. And perhaps do a little dance as well. What would I do without you?"},{"name":"GIRLMOOGLE03134","text":"Our song! It matches this scenery perfectly. Come, my little butterball, I wish to dance!"},{"name":"YOUNGMOOGLE03134","text":"Your plan was brilliant. Absolutely brilliant. I've never seen her so happy, kupo. I think it may be time to make my next move. Would you follow us back to Entrance Square?"},{"name":"YOUNGMOOGLE03134","text":"Play it cool and bask in the beauty of silence? I'd never thought of that. I suppose it's worth a try."},{"name":"YOUNGMOOGLE03134","text":"...&lt;wink&gt;"},{"name":"GIRLMOOGLE03134","text":"Is something the matter, sugar lump? Your eye is twitching."},{"name":"YOUNGMOOGLE03134","text":"I'm afraid I'm no good at playing it calm and cool. She must think me a fool."},{"name":"YOUNGMOOGLE03134","text":"But I won't give up, kupo! We're heading back to Entrance Square. Can I count on you to be waiting in the wings?"},{"name":"YOUNGMOOGLE03134","text":"Wine? My, how fancy. Though I suppose this is a rather fancy place, isn't it."},{"name":"YOUNGMOOGLE03134","text":"But that would mean showing myself to the barkeep. I know Mister Manderville said it would be okay, but I'm not so sure..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"You've come too far to give up."},{"name":"A3","text":"Why don't I order for you?"},{"name":"A3","text":"You could ask your beloved to order."},{"name":"YOUNGMOOGLE03134","text":"You're right. I have to be brave for my sweetypom, kupo!"},{"name":"WYNKYN","text":"How in the hells did this money get here?"},{"name":"WYNKYN","text":"Ah, of course. Some bashful bloke means to order the bartender's choice. Very well. I will prepare a drink to take their taste buds to a fantastical new world of flavors."},{"name":"YOUNGMOOGLE03134","text":"Would you really? Thank you!"},{"name":"WYNKYN","text":"Sounds like you're celebrating quite a special occasion. Very well. I will prepare a drink guaranteed to take your taste buds to a fantastical new world of flavors."},{"name":"YOUNGMOOGLE03134","text":"That may be for the best, kupo. I know nothing of drinks, and even the thought of speaking with the barkeep fills me with dread. I only hope this won't displease my fluffypoo."},{"name":"GIRLMOOGLE03134","text":"You want <span class=\"emphasis\">me</span> to order the drinks for you? &lt;sigh&gt; My poor little sugar pom. "},{"name":"GIRLMOOGLE03134","text":"I've had plenty of wine in my day, but never anything quite like that."},{"name":"YOUNGMOOGLE03134","text":"Indeed. I feel like a new man─hic─new moogle, kupo!"},{"name":"YOUNGMOOGLE03134","text":"The barkeep's drink was perhaps the best we've ever had. Thank you for the suggestion. Now that she's relaxed, I think the time is right to make my next move. To Entrance Square!"},{"name":"YOUNGMOOGLE03134","text":"It's time, kupo. I'm going to pop the question. Oh, but I'm so nervous. My mouth is dry, and my tongue feels like a sponge. What if I say the wrong thing?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"You have to believe in yourself."},{"name":"A4","text":"Well, there are other fish in the sea."},{"name":"YOUNGMOOGLE03134","text":"You're right. What manner of moogle would I be to let all your generosity go to waste. All right. Here I go..."},{"name":"YOUNGMOOGLE03134","text":"But I don't want fish, kupo. I want my moogledove! &lt;sigh&gt; Oh dear..."},{"name":"YOUNGMOOGLE03134","text":"Erm. You'll wait here for me, won't you? I realize you've already done so much for me, but...I'd feel better knowing you're watching, kupo."},{"name":"YOUNGMOOGLE03134","text":"Dearest moogleypoo. My cutie patootie. Sweetums...my little cuddlemog...kupo nut of my eye... My jelly belly! I... Would you... &lt;wheeze&gt;"},{"name":"YOUNGMOOGLE03134","text":"...MARRY ME, KUPO!"},{"name":"GIRLMOOGLE03134","text":"Before I answer, there's something I need to say. Your friend over there should hear this as well."},{"name":"YOUNGMOOGLE03134","text":"You...you knew?"},{"name":"GIRLMOOGLE03134","text":"The lights of the Gold Saucer are bright, but not blinding, kupo. Of course I knew."},{"name":"GIRLMOOGLE03134","text":"Well of course, kupo. After our last tour of the Gold Saucer, I assumed <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> would continue to keep a watchful eye on us."},{"name":"GIRLMOOGLE03134","text":"Yet even though <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was there, no doubt ready to jump to our rescue at a moment's notice, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> didn't need to. I had my reservations before, but after seeing you try so hard to show me a good time today, well...maybe I was wrong about you, kupo."},{"name":"YOUNGMOOGLE03134","text":"&lt;gasp&gt; Does that mean...?"},{"name":"GIRLMOOGLE03134","text":"Let's say I'll think about it."},{"name":"YOUNGMOOGLE03134","text":"Oh joy, oh rapture! Be still my quivering pom! "},{"name":"YOUNGMOOGLE03134","text":"Thank you! A thousand times, thank you! This day wouldn't have been possible without you."},{"name":"YOUNGMOOGLE03134","text":"I think we'll stay here at the Saucer a while longer. At least until my heart returns to my chest, kupo."},{"name":"GIRLMOOGLE03134","text":"Even if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> weren't here, though, I'm not sure what to think. Needlessly revealing yourself to people, the awkward silences... You're not the moogle I thought you were, kupo."},{"name":"YOUNGMOOGLE03134","text":"Wha...What are you saying...?"},{"name":"GIRLMOOGLE03134","text":"I'm sorry, doodlepom, but my answer is no...to the moogle I see before me, at least. For the moogle I met in the Shroud, however, I may reconsider."},{"name":"YOUNGMOOGLE03134","text":"&lt;sigh&gt; What a fool I've been. I had convinced myself I needed to be more daring, more adventurous. In the end, I only made a mess of things."},{"name":"YOUNGMOOGLE03134","text":"But next time will be different. I promise. Hopefully we'll run into you again on our next outing here at the Saucer."},{"name":"GIRLMOOGLE03134","text":"And don't think I didn't notice you sneaking off for advice."},{"name":"GIRLMOOGLE03134","text":"Still, I was impressed by how hard you were trying to show me a good time."},{"name":"YOUNGMOOGLE03134","text":"Does that mean what I think it does...?"},{"name":"GIRLMOOGLE03134","text":"If you think it means we should spend another day at the Gold Saucer, then yes."},{"name":"YOUNGMOOGLE03134","text":"You can be hard to please, my dear fluffikins, but I will not back down from this challenge."},{"name":"YOUNGMOOGLE03134","text":"It seems our stay here at the Saucer has been extended."},{"name":"YOUNGMOOGLE03134","text":"Hopefully we'll run into you again."},{"name":"YOUNGMOOGLE03134","text":"If not for you, I doubt I could have shown her around, let alone profess my feelings."},{"name":"GIRLMOOGLE03134","text":"A pity you had to spend your time with us, rather than enjoying the sights and sounds of this magnificent hall. But fear not─my little pomsybear will see you're duly compensated. Isn't that right, kupo? "},{"name":"YOUNGMOOGLE03134","text":"Sorry to keep you waiting, kupo. This was all I could manage on such short notice."},{"name":"YOUNGMOOGLE03134","text":"If you're still around, your advice would be quite welcome the next time I take her about the Saucer."},{"name":"YOUNGMOOGLE03134","text":"So welcome, in fact, I think I'll wait right here until you return... You will return, won't you?"},{"name":"GIRLMOOGLE03134","text":"If only such a place existed in the Shroud. I doubt I would ever leave, kupo."}],"reward":{"items":[{"num":10,"id":14958},{"num":2,"id":10131},{"num":3,"id":10085}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68669]}},"partials":[{"type":"npc","id":"1025927","obj":{"i":1025927,"n":"Moogle Suitor","l":1484,"q":1}},{"type":"item","id":"14958","obj":{"i":14958,"n":"Golden Sparkler","l":1,"c":22645,"t":85}},{"type":"item","id":"10131","obj":{"i":10131,"n":"MGP Voucher","l":1,"c":26173,"t":61}},{"type":"item","id":"10085","obj":{"i":10085,"n":"Gold Saucer Ticket","l":1,"c":26173,"t":61}},{"type":"quest","id":"68669","obj":{"i":68669,"n":"Trouble in Paradise","g":200,"l":"Ul'dah","s":156}}]}