{"quest":{"name":"The Seaweed Is Always Greener","location":"Kugane","id":68675,"patch":4.3,"sort":1000,"unlocksFunction":1,"eventIcon":71341,"issuer":1025965,"target":1025878,"genre":107,"journal":["The Kojin hireling is eyeing you with unconcealed interest."],"objectives":["Speak with the lady-in-waiting in Tamamizu."],"dialogue":[{"name":"KOUJIN03139","text":"Begging your pardons, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, but you are an adventurer, are you not? I approach you on the off chance that you are acquainted with one of your distinguished fellows, a great hero by the name of <span class=\"highlight\">Forename Surname</span>."},{"name":"KOUJIN03139","text":"...What? <span class=\"emphasis\">You</span> are none other than the legendary <span class=\"highlight\">Forename Surname</span>, liberator of nations and scourge of the Empire? How kind the kami are to guide your steps this way!"},{"name":"KOUJIN03139","text":"I have been tasked with finding you, you see─by the lady-in-waiting of Sui–no–Sato. My Blue brethren and I are assisting the good folk there in a certain endeavor, but they have been experiencing some difficulties."},{"name":"KOUJIN03139","text":"In seeking to address said difficulties, the lady-in-waiting wishes to entreat your aid. If you should be willing, I ask that you come to Tamamizu, where the lady awaits."},{"name":"KOUJIN03139","text":"If you should be willing to aid the lady-in-waiting of Sui–no–Sato, I ask that you come to Tamamizu. The lady awaits you there in good faith."},{"name":"SANANA","text":"<span class=\"highlight\">Forename</span>, I take it? Hmmm, aye, you do have that heroic air about you."},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, you came! Deep in my heart I knew that you would, but I am no less glad for it."},{"name":"KURENAI","text":"To spare you the confusion, it is I, Kurenai. As you will doubtless appreciate, 'twould not do for the Ruby Princess to be seen outside the palace, hence my current guise."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What brings you to Tamamizu?"},{"name":"A1","text":"Isn't this a little risky?"},{"name":"KURENAI","text":"There is something that I wish to achieve, for which the Kojin's home is an ideal venue. As you well know, our people have long lived in isolation. I would change that. I would have us emerge into the outside world."},{"name":"KURENAI","text":"Undeniably so. Yet even should it mean flouting our laws, there is something that I wish to achieve. As you well know, our people have long lived in isolation. I would change that. I would have us emerge into the outside world."},{"name":"KURENAI","text":"How did I conceive of this, you may wonder. 'Twas none other than our journey together, <span class=\"highlight\">Forename</span>, that sowed the seeds in my heart. Such things as I beheld and experienced... Even as they filled me with awe, they made me keenly aware of our own wants."},{"name":"KURENAI","text":"In the past, Sui–no–Sato engaged in limited trade with Doma, but that delicate tie was severed with the Empire's violent arrival. Nowadays, a handful of necessities from Tamamizu is our sole link to the world beyond."},{"name":"KURENAI","text":"But with the imperial menace driven from the Ruby Sea, I thought, what better time to venture out of our little bubble once more? However, 'tis far easier said than done..."},{"name":"SANANA","text":"Princess or no, you can't just go and change things as you please. There're hardheaded types who'll fight tooth and nail to keep things as they are, and you've got to win them over─with a little help from this adventurer here.<br>...That's about the short of it, aye?"},{"name":"SANANA","text":"Have to say, it's nice to see an Eorzean face here at the bottom of the brine. Well met, adventurer. I'm Sanana, of the House of Splendors."},{"name":"KURENAI","text":"Permit me to introduce Sanana. She came to be with us after her ship foundered in a storm. Our people chanced to find her clinging to flotsam and brought her to Sui–no–Sato."},{"name":"SANANA","text":"I'd be fish fodder if they didn't appear when they did. And so, to repay the debt, I'm helping Kurenai with her goal of opening Sui–no–Sato to the world."},{"name":"KURENAI","text":"Sanana's insights have been most enlightening. In seeking to usher in change, she recommends that we distribute among the citizens such articles from the surface as they will find useful in their daily lives."},{"name":"KURENAI","text":"I had thought to make my case only with words, but indeed, a practical item in the hand shall prove far more convincing than any argument I could concoct. If our people are made to know the benefits of trade firsthand, they shall be more willing to embrace change."},{"name":"KURENAI","text":"With no rituals of import requiring the Ruby Princess's presence in the near future, I came to Tamamizu some while ago to commence our efforts. Alas, I regret to say we've yet to make any progress..."},{"name":"SANANA","text":"Owing to the shipwreck, I've got no suitable wares on hand. And while the Kojin have been helpful, we're struggling to procure the kind of items needed in Sui–no–Sato."},{"name":"KURENAI","text":"That was when my thoughts turned to you, my friend. As a well-traveled adventurer, I believed that we would benefit from your aid. And to my surprise and delight, not only was Sanana familiar with your name, she told me that you are possessed of skills that would indeed serve our cause!"},{"name":"SANANA","text":"Aye, anyone that's got anything to do with the House knows <span class=\"highlight\">Forename</span>. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s one of the best contributors on our roster."},{"name":"SANANA","text":"Now, while we don't have ready wares, we did manage to salvage some materials to help you along. Naturally, we don't expect you to work for nothing. In the House fashion, there'll be scrips in it for your troubles. So...you <span class=\"emphasis\">will</span> help, right?"},{"name":"SANANA","text":"Look, I realize the House has a reputation, but we're not all ruthless, coin-hungry sorts. Not all of the time, anyway. At the end of the day we're just people, and like most people we can be driven by altruism."},{"name":"SANANA","text":"And make no mistake, Sui–no–Sato needs help. Might be as the place prides itself on self-sufficiency, but the reality is grimmer than it seems. Every day, folk there are pushed to the limits of survival. And some of them...well, some of them don't make it."},{"name":"SANANA","text":"It's not our intent to turn Sui–no–Sato on its head, transform it into some bustling hub like Kugane. But through trade, lives can be improved. Lives can be saved."},{"name":"KURENAI","text":"You have our eternal gratitude! With the two of you standing with us, there is hope yet for our people!"},{"name":"SANANA","text":"Well then, if it's decided, let's all get to work. Haste is of the essence, isn't that right?"},{"name":"KURENAI","text":"Indeed. This season sees many of us struck down by a certain illness. We have not an effective treatment, and each year it inevitably claims lives."},{"name":"SANANA","text":"While I'm no healer, judging by the symptoms, lack of nutrition's the problem. In which case, I might know something that can prevent it: a fortifying tonic traditionally brewed in Gyr Abania."},{"name":"KURENAI","text":"<span class=\"highlight\">Forename</span>, we would be grateful if you could begin by supplying us with this Gyr Abanian remedy. The people are depending on you."}],"reward":{"items":[{"id":12862},{"id":12867}]},"reqs":{"jobs":[{"lvl":62,"id":35}],"questsType":"all","quests":[68541,68243]},"next":[68676]},"partials":[{"type":"npc","id":"1025965","obj":{"i":1025965,"n":"Kojin Hireling","l":2404,"q":1}},{"type":"npc","id":"1025878","obj":{"i":1025878,"n":"Kurenai","l":2409,"q":2}},{"type":"item","id":"12862","obj":{"i":12862,"n":"Beet Soup","l":133,"c":24103,"t":46,"p":1105}},{"type":"item","id":"12867","obj":{"i":12867,"n":"Dhalmel Gratin","l":133,"c":24112,"t":46}},{"type":"quest","id":"68541","obj":{"i":68541,"n":"None Forgotten, None Forsaken","g":103,"l":"Rhalgr's Reach","s":1000,"f":1}},{"type":"quest","id":"68243","obj":{"i":68243,"n":"The Two Princesses of Sui–no–Sato","g":108,"l":"The Ruby Sea","s":3110}},{"type":"quest","id":"68676","obj":{"i":68676,"n":"Up Where They Trade All Day in the Sun","g":108,"l":"The Ruby Sea","s":1005,"f":1}}]}