{"quest":{"name":"Jump to the Beach","location":"Limsa Lominsa","id":68671,"patch":4.3,"sort":158,"icon":100791,"eventIcon":71221,"issuer":1026032,"target":1026033,"genre":201,"journal":["Mayaru Moyaru would invite you to prove your skills in the ultimate test of acrobatic aptitude.<br>※This quest is available for a limited time only.","Another Moonfire Faire has come to Eorzea, its arrival marked by gaudy decorations and chaperones dressed in festival garb. While the event is celebrated throughout the realm, Mayaru Moyaru informs you that the main attraction awaits in Costa del Sol. However, he is suspiciously secretive as to the nature of this attraction, and it seems you will have to go and see it for yourself.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Upon arriving in Costa del Sol, you are greeted by the sight of several wooden structures. Haermaga, the grand chaperone of the Moonfire Faire, reveals that they form an obstacle course, the centerpiece of this year's festivities. The event organizers believe that the sight of Adventurers' Guild members risking life and limb to complete an increasingly difficult series of challenges will inspire the younger generation to one day become adventurers themselves. Haermaga waits patiently while you summon the courage needed to become an Eorzean Nimble Warrior.","Just as you are about to register to compete, a somewhat timid youth named R'fhul Tia and his little sister R'majha arrive. The older sibling states his intention to face the Eorzean Nimble Warrior course. However, only members of the Adventurers' Guild are allowed to enter. Despite lacking the necessary credentials, R'fhul Tia is able to convince Haermaga to bend the rules, on the condition that you go first to demonstrate the correct method for completing the course. Beaudefoin the chaperone stands at the foot of the wooden behemoth, ready to give the next set of instructions."],"objectives":["Speak with Haermaga."],"dialogue":[{"name":"MAYARUMOYARU","text":"Why, if it isn't <span class=\"highlight\">Forename</span>! How long has it been? A year? More, perhaps... I think the last time I saw you was also during the Moonfire Faire."},{"name":"MAYARUMOYARU","text":"Don't tell me you've forgotten about it already! The festival was originally held to recruit adventurers to combat a Bombard invasion, but we gave them such a thrashing, they've hardly been seen since. Bombards or no, we still hold the event each year, providing wholesome fun for all the family!"},{"name":"MAYARUMOYARU","text":"Ahoy there, adventurer! It's another sweltering day here in Limsa Lominsa, and what better way to mark the coming of summer than with the Moonfire Faire!"},{"name":"MAYARUMOYARU","text":"Oh? So you're new to the festival? It all began as a way of recruiting adventurers to fend off a horde of Bombards. Even though the infernal menaces have all but disappeared, we still hold the event every year to provide wholesome family fun!"},{"name":"MAYARUMOYARU","text":"That's not all! It's an opportunity for members of the Adventurers' Guild to demonstrate their skills to faire-goers, and thereby inspire others to join our ranks."},{"name":"MAYARUMOYARU","text":"I'll bet you know a trick or two, am I right? Then why not head to Costa del Sol and show them what a real adventurer looks like!"},{"name":"MAYARUMOYARU","text":"When you get there, just head for the gigantic wooden─ Ho ho! I nearly spoiled the surprise! Well, you'll just have to go and see it for yourself!"},{"name":"MAYARUMOYARU","text":"And trust me, you'll know it when you see it. Talk to the chaperones nearby and they'll have you performing feats of derring-do before you can say “Seven snippy snippers snipped several splendid subligars!”"},{"name":"MAYARUMOYARU","text":"You're still here? Time and tide wait for no <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, and nor does the Moonfire Faire. Don't miss your chance to shine, adventurer!"},{"name":"HAERMAGA","text":"<span class=\"highlight\">Forename</span>! How good it is to see you, old friend! The Moonfire Faire wouldn't be the same without you. And have we got a treat for you!"},{"name":"HAERMAGA","text":"Here for the Moonfire Faire, I take it? You seem like the sort who's not afraid to get <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> hands dirty and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> feet wet─the sort we're looking for. Behold!"},{"name":"HAERMAGA","text":"Rising from the pristine sands and virgin waters of Costa del Sol, a wooden monstrosity so imposing, so unforgiving that all but the most courageous will run crying to their mammies! It can only be...the Eorzean Nimble Warrior course!"},{"name":"HAERMAGA","text":"This event is sponsored by the ever-magnanimous Master Gegeruju! Under his watchful eye, no harm will come to our brave contestants. Or to the scantily clad ladies he seems to be ogling at present..."},{"name":"HAERMAGA","text":"Ahem! Where was I? Ah yes. To become a true Eorzean Nimble Warrior, you must let nothing stand between you and your goal."},{"name":"HAERMAGA","text":"This is the attitude we wish to instill in all aspiring adventurers. Through your example, we aim to teach them that there is no obstacle that cannot be overcome so long as you have discipline and determination. And a strong pair of legs, for there'll be jumping. Lots of it."},{"name":"HAERMAGA","text":"You may observe other challengers emitting wails and curses, but these things are not the key to success. Nay, you'll need to rely upon an impeccable sense of balance, uncanny awareness of your surroundings, limitless patience, the acrobatic ability of an opo-opo─"},{"name":"HAERMAGA","text":"...Well, there are a few other things, but I'll leave it at that. Wouldn't want you to get discouraged before you've even started now, would we? Once you've banished any lingering apprehensions, I'll be happy to sign you up. Did I mention that we even have prizes for completing the course?"},{"name":"HAERMAGA","text":"So, think you've got what it takes to be an Eorzean Nimble Warrior? That's the spirit. I'm sure the spectators can't wait to see you in action!"},{"name":"RFHULTIA","text":"(-Mild-mannered Boy-)Um...excuse me, I'm here to register for the Eorzean Nimble Warrior course. Am I in the right place?"},{"name":"HAERMAGA","text":"You are indeed. But you do realize it's only open to fully fledged members of the Adventurers' Guild? No offense lad, but you seem a bit too wet behind the ears to be allowed to join..."},{"name":"RMAJHA","text":"(-Feisty Little Girl-)My brother is going to be the bestest adventurer in the whole wide world!"},{"name":"RFHULTIA","text":"(-Mild-mannered Boy-)While it's true that I'm not an adventurer yet, if there is one thing I am good at, it is jumping! Will you at least let me try?"},{"name":"HAERMAGA","text":"Sorry, son. If anything were to happen to you..."},{"name":"RFHULTIA","text":"(-Mild-mannered Boy-)Please! I would give anything for a chance to become an Eorzean Nimble Warrior! If I cannot enter, it will break my heart, and I shall throw myself from the top of the tower, and my sister will cry until the end of eternity, and─"},{"name":"HAERMAGA","text":"All right, enough! I'll register you, but don't say I didn't warn you! The Eorzean Nimble Warrior course is no joke. If you do yourself a mischief and I get the blame for it, I'll have you hanging from the tower by your tail! &lt;sigh&gt; I can't believe I'm doing this..."},{"name":"HAERMAGA","text":"To be on the safe side, <span class=\"highlight\">Forename</span> here will go first and show you how it's done. There's no shame in backing down once you see how stiff a challenge it truly is."},{"name":"RFHULTIA","text":"(-Mild-mannered Boy-)Thank you! I shall repay your generosity with an acrobatic display the likes of which the world has never seen!"},{"name":"RFHULTIA","text":"Oh, where are my manners? I am R'fhul Tia and this is my sister, R'majha. It is our pleasure to meet you."},{"name":"RFHULTIA","text":"I am looking forward to seeing how a real adventurer tackles the course. And once you are done, it is my turn!"},{"name":"RMAJHA","text":"I hope you don't fall in the water!"},{"name":"HAERMAGA","text":"Ha ha! You and me both! Now, let Beaudefoin know when you're ready, and be careful out there, understood?"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Splash</span>!"}],"reward":{"emote":"Splash"},"reqs":{"jobs":[{"lvl":30,"id":1}]},"next":[68672]},"partials":[{"type":"npc","id":"1026032","obj":{"i":1026032,"n":"Mayaru Moyaru","l":28,"q":1,"t":"Moonfire Faire Chaperone"}},{"type":"npc","id":"1026033","obj":{"i":1026033,"n":"Haermaga","l":32,"q":2,"t":"Moonfire Faire Chairman"}},{"type":"quest","id":"68672","obj":{"i":68672,"n":"Eorzean Nimble Warrior","g":201,"l":"Eastern La Noscea","s":159,"r":1}}]}