{"quest":{"name":"If at First You Don't Succeed, Give Up","location":"Eastern La Noscea","id":68673,"patch":4.3,"sort":160,"icon":100793,"eventIcon":71221,"issuer":1026033,"target":1026033,"genre":201,"journal":["Haermaga wishes to shower you with praise, while R'fhul Tia prepares to tackle the obstacle course.<br>※This quest is available for a limited time only.","Following your emphatic conquest of the Eorzean Nimble Warrior course, you return to Haermaga to share the good news. In light of your inspirational display, R'fhul Tia eagerly prepares for his own attempt. R'majha races ahead to find a spot from which the two of you can watch her brother's acrobatics.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Immediately after setting foot on the starting platform, R'fhul Tia charges forward to make the very first jump. Unfortunately, he possesses all the airborne grace of a sodden sponge and plunges unceremoniously in the water below. Fearing for his safety, R'majha rushes over to check on her crestfallen sibling.","After dragging himself to shore, R'fhul Tia regains his composure and tries to hide his embarrassment with laughter. His sister takes offense at this and storms off without explaining the reason for her anger. As you and R'fhul Tia continue the conversation without her, she disappears from view entirely. Realizing she is now missing, R'fhul Tia asks you to help search for her.","You eventually find R'majha on the eastern shore, having covered a surprising distance in such a short time. Her excursion has done nothing to brighten her mood, and she stubbornly refuses to talk to her brother. R'fhul Tia suggests splashing her with water to help ease the tension.","The splashes of cold sea water do the trick, setting R'majha to giggling and washing away her black mood. She explains her frustration at seeing her brother's jovial reaction to his abysmal performance on the obstacle course. R'fhul Tia has long claimed it his dream to become an adventurer, and as such, his sister expected him to treat the contest more seriously. She also expresses concern about his plans to leave home in search of fame and fortune. R'fhul Tia assures her that although he may be parted from his family, he will not place himself in unnecessary danger and will return safe and well. Once you are satisfied that the matter has been concluded, you return to Haermaga.","Haermaga is visibly moved to hear that R'fhul Tia decided to become an adventurer after he witnessed the guild's acts of heroism at a previous Moonfire Faire. He thanks you for your various contributions and invites you to enjoy the remainder of the festival."],"objectives":["Wait with R'majha.","Speak with R'fhul Tia.","Find R'majha.","/splash R'majha with water.","Return to Haermaga."],"dialogue":[{"name":"HAERMAGA","text":"The hero has returned! I was watching intently from start to finish. A truly breathtaking display if ever there was one!"},{"name":"RFHULTIA","text":"That was incredible! I've never seen anything like it!"},{"name":"RMAJHA","text":"I want to try it too!"},{"name":"HAERMAGA","text":"Ha ha! Maybe when you're a bit bigger, missy. How about you, R'fhul? It's not too late to change your mind."},{"name":"RFHULTIA","text":"I think not. Witnessing <span class=\"highlight\">Forename</span>'s spectacular victory has lit a fire in my soul!"},{"name":"RFHULTIA","text":"Today, I shall fulfill my destiny! Fame and glory, here I come!"},{"name":"HAERMAGA","text":"Wait, there's one last thing I─"},{"name":"HAERMAGA","text":"&lt;sigh&gt; I did have a few words of advice for him, but perhaps he won't need it. Hopefully, he will have learned a thing or two from you, <span class=\"highlight\">Forename</span>. Still, I can't help but worry for the lad. Could you keep an eye on him?"},{"name":"RMAJHA","text":"I'm coming too!"},{"name":"HAERMAGA","text":"I'll be watching from here, but it might be best to have someone nearby when he─I mean, <span class=\"emphasis\">if</span> he takes a tumble."},{"name":"RFHULTIA","text":"<span class=\"highlight\">Forename</span>, that truly was a sight to behold! The way you made your way to the top... It was extraordinary!"},{"name":"RMAJHA","text":"That was the bestest thing ever!"},{"name":"RFHULTIA","text":"Haaaaaagh! Here I goooooo!"},{"name":"RMAJHA","text":"Fhul! Oh no! We have to help him!"},{"name":"RMAJHA","text":"He looks ready now!"},{"name":"RFHULTIA","text":"&lt;pant&gt; I might have been a little...overzealous."},{"name":"RFHULTIA","text":"Heh, after all my grand words... What a fool I must look! I still have a long way to go! Hahaha!"},{"name":"RMAJHA","text":"...Why?"},{"name":"RMAJHA","text":"Why are you laughing!? It's not funny! You're just a...big stupid-face!"},{"name":"RFHULTIA","text":"Majha!? &lt;sigh&gt; Whatever's gotten into her?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Don't just stand there─go after her!"},{"name":"A1","text":"She doesn't seem to like big stupid-faces."},{"name":"RFHULTIA","text":"R-Right. Er...where did she run off to, now? Please help me look for her!"},{"name":"RFHULTIA","text":"Nor do I like being called one. It seems we need to talk. But er...where has she run off to? Please help me look for her!"},{"name":"RMAJHA","text":"Fhul! Are you all right!?"},{"name":"RFHULTIA","text":"Thank the gods she's safe..."},{"name":"RMAJHA","text":"Hmph!"},{"name":"RFHULTIA","text":"Majha! What's the matter?"},{"name":"RMAJHA","text":"Go away, stupid-face!"},{"name":"RFHULTIA","text":"It's no use. She won't talk to me."},{"name":"RFHULTIA","text":"Well, you leave me no choice. There's only one way to deal with sulky little girls."},{"name":"RMAJHA","text":"Hm?"},{"name":"RFHULTIA","text":"Come on, <span class=\"highlight\">Forename</span>! Splash some water on her to make her laugh!"},{"name":"RFHULTIA","text":"A few splashes of water and she'll be giggling in no time!"},{"name":"RMAJHA","text":"Hmph!"},{"name":"RMAJHA","text":"Eeek! That's cold! Tee hee hee!"},{"name":"RFHULTIA","text":"So, is Miss Sulky going to tell me why she ran off?"},{"name":"RMAJHA","text":"I'm sorry... <span class=\"highlight\">Forename</span>, you're not cross with me, are you?"},{"name":"RMAJHA","text":"It's just that...after the festival, my brother's going on a long journey to become an adventurer."},{"name":"RFHULTIA","text":"Long journey? What gave you that idea?"},{"name":"RMAJHA","text":"I heard you talking about it with Mummy. And I know how much you want to be an adventurer."},{"name":"RMAJHA","text":"You didn't tell me because you thought I'd be sad. I'm right, aren't I?"},{"name":"RMAJHA","text":"I've known all this time. And...it does make me sad. But I wouldn't want you to give up on your dream for me. That's why I told myself not to cry."},{"name":"RMAJHA","text":"I thought you'd be upset when you fell in the water. But you were laughing!"},{"name":"RFHULTIA","text":"You're right. I should've taken it more seriously, especially since you and <span class=\"highlight\">Forename</span> came to watch me."},{"name":"RFHULTIA","text":"But I <span class=\"emphasis\">am</span> serious about becoming an adventurer!"},{"name":"RFHULTIA","text":"You see, <span class=\"highlight\">Forename</span>, we don't have a father, so I help our mother look after Majha. I realized that I needed to become a man, to become strong enough to support my family. I just didn't know how."},{"name":"RFHULTIA","text":"But when I went to the Moonfire Faire a few years ago and saw the Cascadiers drive off those dreadful Bombards, I discovered my calling in life─to become an adventurer!"},{"name":"RFHULTIA","text":"If I were as brave as the heroes of the Adventurers' Guild, I could protect my family from harm. I could provide for them."},{"name":"RFHULTIA","text":"As my first step towards becoming an adventurer, the Moonfire Faire presented the perfect opportunity. What better way to prove my worth than by overcoming the Eorzean Nimble Warrior course!"},{"name":"RFHULTIA","text":"But I was so eager to prove myself, I got carried away. And you know the rest. I humiliated myself in front of everyone, so I tried to laugh it off. I didn't know what else to do! I never meant to upset you, Majha."},{"name":"RFHULTIA","text":"But I haven't given up hope! What do you think, <span class=\"highlight\">Forename</span>? If I keep training, do you think that I could make it as an adventurer?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"“Great oaks from little acorns grow,” as the saying goes."},{"name":"A2","text":"There isn't much call for big stupid-faces, I'm afraid."},{"name":"RFHULTIA","text":"Little acorns? Are you saying I should become a botanist?"},{"name":"RFHULTIA","text":"Aha! I think I understand now! Yes, I shall do my utmost to one day become a “great oak”!"},{"name":"RFHULTIA","text":"Not quite the words of encouragement I was hoping for, but it will take more than that to deter me!"},{"name":"RFHULTIA","text":"I mean, all things considered, today could have been a lot worse. At least I didn't crack my skull on a rock like that other poor chap. As long as I keep myself in one piece, I'll be an adventurer sooner or later!"},{"name":"RFHULTIA","text":"Mahja. You were right about a lot of things. It's true. I am going to be away from home for a while. And my face...yes, it probably is a bit stupid-looking from time to time."},{"name":"RMAJHA","text":"I didn't mean it! Your face is fine how it is! Well, most of the time, anyway. But if you're going away, will you make me a promise?"},{"name":"RMAJHA","text":"Don't die, no matter what."},{"name":"RMAJHA","text":"You don't have to be a hero. Just be...just be safe. That's all I want!"},{"name":"RFHULTIA","text":"Very well, Majha. I promise I will never die. Erm...well, not any time soon, at least."},{"name":"RFHULTIA","text":"Now that's settled, I think it's time for us to go home."},{"name":"RMAJHA","text":"Thank you so much! See you again!"},{"name":"RFHULTIA","text":"Wait, don't go running─ &lt;sigh&gt; Not again..."},{"name":"RFHULTIA","text":"Before I chase after my sister again, I'd like to thank you. You're the kind of adventurer I aspire to be, and it was an honor to meet you."},{"name":"RFHULTIA","text":"If there's one thing I have learned, it is that “Actions speak louder than words.” That's right, isn't it?"},{"name":"RFHULTIA","text":"Yes, maybe I should aspire to be the strong, silent type too. Something to work on as I embark on my journey. But before I leave, I would like to spend some time with my family. Please give my regards to Haermaga and the others! Till we meet again!"},{"name":"HAERMAGA","text":"Welcome back. I trust all is well?"},{"name":"HAERMAGA","text":"Oh? He decided to become an adventurer after seeing the Moonfire Faire? Well, if that isn't a testament to the festival's power to inspire, I don't know what is!"},{"name":"HAERMAGA","text":"&lt;sniff&gt; It warms the cockles of my heart, it does..."},{"name":"HAERMAGA","text":"And as for you, you've helped make the festival a huge success! After all the casualties we've had, I was worried that the guild would accuse us of constructing a death trap! We've had a few minor maimings, true, but no one's died yet. That has to count for something, aye?"},{"name":"HAERMAGA","text":"Of course, this year's Moonfire Faire is far from over, so why not stay and soak up the atmosphere? You can even run the Eorzean Nimble Warrior course again, if you feel so inclined. On behalf of all of the chaperones, you have our heartfelt gratitude!"}],"reward":{"items":[{"id":23380}]},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[68672]}},"partials":[{"type":"npc","id":"1026033","obj":{"i":1026033,"n":"Haermaga","l":32,"q":2,"t":"Moonfire Faire Chairman"}},{"type":"item","id":"23380","obj":{"i":23380,"n":"Endless Summer Coffer","l":1,"c":26509,"t":61}},{"type":"quest","id":"68672","obj":{"i":68672,"n":"Eorzean Nimble Warrior","g":201,"l":"Eastern La Noscea","s":159,"r":1}}]}