{"quest":{"name":"In Adventurers We Trust","location":"Ul'dah","id":68674,"patch":4.35,"sort":161,"icon":100794,"eventIcon":71221,"issuer":1023954,"target":1023955,"genre":202,"journal":["Dural Tharal is eyeing you eagerly.<br><br>※This quest is available for a limited time only.","Dural Tharal, renowned reporter for the <span class=\"emphasis\">Mythril Eye</span>, has solicited your help in what promises to be a splendid story. The Immortal Flames will soon be hosting “The Calamity Retold,” military exercises which draw from the lessons of the imperial invasion that took place years past. The Lalafell plans to interview people about their experiences of that time, and bids you accompany him that you might offer your unique perspective on the matter. The first stop is the Hall of Flames, where you will meet with an officer of the order.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","According to the flame commander, the military exercises are intended to cultivate awareness of the Garlean threat within citizens, many of whom have forgotten how close Ul'dah came to becoming a battlefield during the Calamity. Then, it was only by the valor of audacious adventurers that the city was spared, and the commander hopes that the Immortal Flames may continue to rely upon you and yours. The first interview thus concluded, Dural Tharal bids you join him at the Pugilists' Guild for the next.","At the Pugilists' Guild, you hear an account of the imperial invasion from a fellow adventurer, who speaks of the Garleans' use of propaganda to sow panic. And while the tactic succeeded in weakening the wills of some, in others it served only to strengthen the spirit of resistance─a spirit that still lives on today. Satisfied with the fruits of this interview, Dural Tharal sets off for the Thaumaturges' Guild, there to meet with another who lived through the horrors of the Calamity.","Her eyes glazing over, the careworn thaumaturge recounts her experience in the foreboding days leading up to the Calamity. As the red moon Dalamud drew closer, its dark influence unleashed hordes of voidsent upon the land. But as they did the imperial invaders, adventurers again rose to contend with this threat and protect the people. The thaumaturge takes her leave, but not before expressing her gratitude and respect for all of adventurerkind. The next interview is the last, and Dural Tharal turns his steps towards the Gate of the Sultana, where he will speak with a long-serving Brass Blade.","A veteran of the Battle of Carteneau, the unassuming Brass Blade attributes his survival to two things: dumb luck and brave adventurers, the latter of whom intercepted an imperial unit en route to flank Eorzean forces. The man then returns to his post, but not before joining his voice to the chorus of gratitude for adventurers. With that, Dural Tharal's interviewing comes to an end, and he asks that you accompany him back on the Ruby Road Exchange.","Thanking you for your honest opinion of the interviews, Dural Tharal declares that he will next seek out a mysterious minstrel who is strumming out songs about the Calamity. Should this be of interest to you, the reporter invites you to join him at the end of the Ruby Road Exchange, where the musician has set his stage.","Having greeted you warmly, the wandering minstrel begins caressing his lyre, drawing forth notes at once sad and sweet. As the song resounds in your mind, you are whisked away to a place beyond the reach of time and space. Before you stands a strange yet familiar figure─a man named Naoki Yoshida, who offers you profuse thanks for your tireless efforts in making the world a better place. Scarcely do you begin to gather your thoughts, however, than your visit to this realm comes to an end, and you find yourself on the Ruby Road Exchange once more, batting your eyelids to the sound of Dural Tharal's vigorous clapping. After the reporter leaves, the minstrel favors you with another song, one whose cryptic words confound even as they seem to speak to you. Thankfully, the minstrel's parting message is less cryptic: even as we keep our gaze upon the future, let us never forget those we have lost. For it is their memory that gives us the strength to carry on."],"objectives":["Speak with the flame commander.","Speak with the veteran adventurer.","Speak with the careworn thaumaturge.","Speak with the humble Brass Blade.","Speak with Dural Tharal.","Speak with the wandering minstrel."],"dialogue":[{"name":"DURALTHARAL","text":"I say, are you not the affable adventurer whose able assistance enabled us to encounter the lithesome lady-warrior, Lightning? That you should present yourself at this precise pass could only be by Nald'thal's blessing!"},{"name":"DURALTHARAL","text":"I am, as you will readily recall, Dural Tharal, renowned reporter for the <span class=\"emphasis\">Mythril Eye</span>. And should you be willing, I seek your service for what will surely be a splendid story."},{"name":"DURALTHARAL","text":"A hearty hail to you, adventurer. I am Dural Tharal, renowned reporter for the <span class=\"emphasis\">Mythril Eye</span>. Should you be willing, I seek your service for what will surely be a splendid story."},{"name":"DURALTHARAL","text":"Are you aware of the latest object of many a sultanate citizen's ardent attention? Aye, it is the massive military maneuvers that the Immortal Flames will be conducting right here in our fair city, creatively called “The Calamity Retold.”"},{"name":"DURALTHARAL","text":"The maneuvers' main motivation is the aggressive attack upon Eorzea in which the Empire engaged ere the Calamity came to pass. In putting pen to parchment, I desire to delve deeply into the details of those dreadful days."},{"name":"DURALTHARAL","text":"I ask you to accompany me as I go about interviewing involved individuals, that I might promptly prod you for your personal perspective. Suffice it to say you will be copiously compensated for your kind cooperation. So, adventurer, will you aid me in my ambition?"},{"name":"DURALTHARAL","text":"You have my thorough thanks! Without further ado, then, pray come with me to the Hall of Flames. I have arranged an audience with one of the order's officers."},{"name":"DURALTHARAL","text":"This is the officer with whom we will have words."},{"name":"COLONEL03138","text":"You are the ones from the <span class=\"emphasis\">Mythril Eye</span>?"},{"name":"DURALTHARAL","text":"Correct, Commander. This reporter would relish your relating the facts and features of the forthcoming military maneuvers."},{"name":"COLONEL03138","text":"I would be glad to speak about the Calamity Retold. I must warn you, though, that there may not be much to offer in the way of a financial perspective, which I know your paper favors."},{"name":"COLONEL03138","text":"Now then, let me begin with the objective. By holding the exercises in the city itself, we seek to cultivate awareness within our citizens of the ever-present Garlean threat."},{"name":"COLONEL03138","text":"Many Ul'dahns believe that they are safe within these walls. Nothing could be further from the truth. In the hours before the Calamity, the imperial army threatened us as close as Camp Horizon. A direct attack upon the city was very much in the realm of possibility."},{"name":"DURALTHARAL","text":"Thankfully, we were spared such a frightful fate owing to the fortitude of audacious adventurers."},{"name":"COLONEL03138","text":"You know your history well, my friend. Aye, full many adventurers lent their strength to our cause. While the Brass Blades and the Sultansworn held fort in the city, those intrepid souls sallied forth to head off the Garleans. By their valor was an attack on Ul'dah forestalled."},{"name":"COLONEL03138","text":"We of the Immortal Flames count adventurers among our stoutest allies, and we hope to continue our successful partnership in the city's defense. To that end, we have invited adventurers the realm over to participate in the exercises."},{"name":"DURALTHARAL","text":"I see, I see. My thanks for taking the time for this talk, Commander."},{"name":"DURALTHARAL","text":"So, having heard his assessment, what is yours as an active adventurer? Is the sultanate safe with you and your plucky peers protecting it?"},{"name":"Q1","text":"What is your assessment?"},{"name":"A1","text":"Ul'dah is safe in our hands."},{"name":"A1","text":"Adventurers alone cannot protect Ul'dah."},{"name":"DURALTHARAL","text":"“Calmly confident, the adventurer assured me of the sultanate's sustained security. For while our defenses demand due diligence, an excess of apprehension avails us naught.”<br>...Yes, something in that spirit shall serve."},{"name":"DURALTHARAL","text":"“Pointedly prudent, the adventurer advised against presuming that our preservation is promised. If the sultanate is to survive a savage strike, each and every one of her citizens must be invariably vigilant.”<br>...Yes, something in that spirit shall serve."},{"name":"DURALTHARAL","text":"Next, we shall seek out one of your fearless fellows, an adventurer who fought in the field at the flats of Carteneau. He awaits our arrival at the Pugilists' Guild."},{"name":"ADVENTURERMOG03138","text":"Mmm-hmmm... Seems I picked a good time for a visit, kupo!"},{"name":"ADVENTURERMOG03138","text":"These exercises sound like fun. I do believe I'll take a peek...and maybe even lend a hand, kupo!"},{"name":"DURALTHARAL","text":"Here he is, the adventurer who has agreed to indulge me with an interview."},{"name":"ADVENTURER03138","text":"You're the reporter as wants to know about Garlean shenanigans leadin' up to the Calamity? Where to begin, where to begin..."},{"name":"ADVENTURER03138","text":"Right. So, soon after imperials began appearing near our cities, their commander took to visiting our aetheryte camps, spoutin' propaganda and demandin' our surrender. Might be as you heard about this."},{"name":"ADVENTURER03138","text":"The point, of course, was to incite panic. And it worked, damn the whoresons. Whole bunch of people around me started panickin', sayin' we should throw down our arms. But as many folk there were as panicked, about the same number got riled up good─yours truly included."},{"name":"ADVENTURER03138","text":"So I gathered my hot-blooded friends and we went after those imperials. Oh, we showed them exactly what we thought of surrender. And if the Garleans ever try anythin' funny again, I'll round up the old crew and teach 'em a lesson all over again. And that's my tale."},{"name":"DURALTHARAL","text":"Excellent, more material of moment for my factual feature. Now then, our next destination is the Thaumaturges' Guild, where we will ask after the account of another who lived through the Calamity."},{"name":"DURALTHARAL","text":"There you are. Our imminent interview is with the tired-looking thaumaturge thither."},{"name":"THAUMATURGE03138","text":"I understand you wish to hear about my experience during the Calamity. Just as well. Whether I will it or no, it all comes flooding back to me this time of year."},{"name":"THAUMATURGE03138","text":"While the invading Garleans posed a real and present threat, what I remember most vividly was the red moon Dalamud. Glowing its bloody hue, growing ever angrier, drawing ever closer..."},{"name":"THAUMATURGE03138","text":"Then the aetherytes turned a sickly color, and voidsent manifested in droves. They entered our world, it is believed, through aetherial rifts caused by Dalamud's growing proximity."},{"name":"THAUMATURGE03138","text":"I shall never forget the terror that washed over me when I first faced them. The mere sight of those twisted beings threatened to suck all my strength away, and I might not be here now were it not for the band of adventurers who hurled themselves into the fray."},{"name":"THAUMATURGE03138","text":"On numerous occasions and in various places, adventurers took it upon themselves to drive back the voidsent. Their bravery and selflessness are an example to us all, and I have nothing but gratitude and respect for them."},{"name":"DURALTHARAL","text":"Right, this leaves us with the last meeting, with a bloke of the Brass Blades. The person should be posted at the Gate of the Sultana."},{"name":"DURALTHARAL","text":"Here he is, the sentry who will speak to us of his struggles."},{"name":"PORTER03138","text":"Just to get it out of the way─I don't know why you want my account. I didn't do anything noteworthy during the Calamity. Doubt I've got anything to offer your article."},{"name":"PORTER03138","text":"But I agreed to talk, so I will. As you probably know, some of us Brass Blades fought at the battle of Carteneau as part of the Immortal Flames outfit. I was there too."},{"name":"PORTER03138","text":"And the battlefield, well, it was the seventh hell on Hydaelyn. Death and destruction everywhere you looked. Folk were dropping like flies, Eorzeans and Garleans alike. Better soldiers, better men and women than me. But somehow I managed to survive."},{"name":"PORTER03138","text":"Later on, I learned something. Apparently, some adventurers went and intercepted an imperial unit in Mor Dhona. A unit that was coming to flank us at Carteneau."},{"name":"PORTER03138","text":"Luck might've kept me alive as long as it did, but if it weren't for those adventurers, I reckon I would've been another corpse at the Flats. I'd thank those adventurers, if only I knew who they were."},{"name":"DURALTHARAL","text":"With that, our questioning comes to a close. Let us return to the Ruby Road Exchange."},{"name":"DURALTHARAL","text":"So, we heard about the Calamity from an assortment of angles, but all appear to agree on one aspect: adventurers played a particularly prominent role."},{"name":"DURALTHARAL","text":"As an active adventurer, what is your view on your predecessors' participation?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm proud of what adventurers achieved."},{"name":"A2","text":"Adventurers shouldn't fight in wars."},{"name":"A2","text":"..."},{"name":"DURALTHARAL","text":"“The adventurer articulated <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> approval of those daring deeds. In <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> eyes, I glanced a glimpse of conviction─the conviction to carry on as stewards of the sultanate.”<br>...Aye, an ending to that effect."},{"name":"DURALTHARAL","text":"“The adventurer articulated <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> disapproval of those daring deeds. A stern statement that the sultanate's security is not their burden to bear.”<br>...Aye, an ending to that effect."},{"name":"DURALTHARAL","text":"“The adventurer expressed no enthusiasm for events long ended. For <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> eyes were fixed firmly upon the future.”<br>...Aye, an ending to that effect."},{"name":"DURALTHARAL","text":"With that, I am amply armed to pen a piece that will please the populace. Many thanks for your invaluable input!"},{"name":"DURALTHARAL","text":"Now then, if you can manage a meager moment more, I request the pleasure of your presence at one last location."},{"name":"DURALTHARAL","text":"I have heard tell that a minstrel of obscure origin is out strumming songs about the Calamity. I would hear him in hopes that it affords my article an additional angle."},{"name":"DURALTHARAL","text":"The man has supposedly set his stage at the end of the exchange. Should this be of interest to you, feel free to follow me."},{"name":"DURALTHARAL","text":"Here he is, <span class=\"highlight\">Forename</span>, the mysterious minstrel I mentioned. Let us listen to his vibrant vocals and silvery strings!"},{"name":"WANDERINGMINSTREL","text":"Well met, my friends. How may this humble minstrel serve you?"},{"name":"WANDERINGMINSTREL","text":"An article for the <span class=\"emphasis\">Mythril Eye</span>, you say? Full honored am I that you should seek me out! Make yourselves comfortable, then, and listen to my song..."},{"name":"WANDERINGMINSTREL","text":"The tale of nameless heroes who rose to defend the city as the red moon fell..."},{"name":"YOSHIDANAOKI","text":"Greetings, Warrior of Light. You needn't be alarmed."},{"name":"YOSHIDANAOKI","text":"This is a world that exists outside your reality. Could it be a dream? A flight of fancy conjured by your weary mind? Perhaps...or perhaps not."},{"name":"YOSHIDANAOKI","text":"Permit me to introduce myself. My name is Naoki Yoshida. Though who I am is of less import than the message I wish to share with you."},{"name":"YOSHIDANAOKI","text":"Delighted am I to see you again, my friend. Truly, I am blessed to have had the pleasure of your acquaintance for so long."},{"name":"YOSHIDANAOKI","text":"Looking back, the days and months have fairly flown by. Five years have already passed since Eorzea rose anew from its ashes."},{"name":"YOSHIDANAOKI","text":"In these five years, I have had the honor to know many Warriors of Light like yourself. Inimitable heroes, all, each with countless tales to tell. Tales of meeting and of parting. Of joy and of sorrow."},{"name":"YOSHIDANAOKI","text":"I often find myself wondering, what do you and yours think of the realm? Since you first set foot upon it, has it become a place that you might call home, to which you ever look forward to returning?"},{"name":"YOSHIDANAOKI","text":"Know that naught gives me and mine greater pride than being able to build this world. And this pride we owe wholly to you, who choose to abide here."},{"name":"YOSHIDANAOKI","text":"For that, we wish to give you our heartfelt thanks."},{"name":"YOSHIDANAOKI","text":"A long journey yet lies ahead of us, and nothing would please us more than to continue it with you. Whither the road may lead, none can say for certain, but such is the allure of adventure, is it not?"},{"name":"YOSHIDANAOKI","text":"...Now, the time has come for this vision to end; time for your eyes to open from this waking dream."},{"name":"YOSHIDANAOKI","text":"Ever will we be watching over you and your deeds. Guide the realm unto peace and happiness, Warrior of Light. Till next we meet..."},{"name":"DURALTHARAL","text":"A stirring song, performed with a plenitude of passion! Thank you, my most magnificent minstrel. By your vivid verse, my story's success is solidly sealed."},{"name":"DURALTHARAL","text":"Adventurer, here is where we depart in different directions. With the fieldwork finally finished, I shall settle in a seat and put pen to parchment. 'Twas a joy to have you join me on this jaunt!"},{"name":"WANDERINGMINSTREL","text":"If you have another moment, my friend, for you I have another song. A song about that which follows the Calamity. About that which is yet to come..."},{"name":"WANDERINGMINSTREL","text":"O hero of rebirth traversing,♪<br>Soar you the azure skies.♪<br>Upon your breast a crimson crest,♪<br>Shine Light down from on high.♪"},{"name":"WANDERINGMINSTREL","text":"O hero of rebirth transcending,♪<br>Weave you an azure lie.♪<br>By your deeds doth crimson bleed,♪<br>And Darkness quench the fire.♪"},{"name":"WANDERINGMINSTREL","text":"Though the world was reborn, rising from the ashes of its destruction, it can never return to how it once was. And so we must walk ever forward, keeping our gaze upon the future and seeking out new horizons."},{"name":"WANDERINGMINSTREL","text":"But once a year, let us allow ourselves to halt our steps. Let us look back upon the past and remember those we have lost. For it is their memory that gives us the strength to carry on."}],"reward":{"items":[{"id":23320},{"id":23029}]},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1023954","obj":{"i":1023954,"n":"Dural Tharal","l":40,"q":1}},{"type":"npc","id":"1023955","obj":{"i":1023955,"n":"Wandering Minstrel","l":40,"q":1}},{"type":"item","id":"23320","obj":{"i":23320,"n":"Revolutions Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"23029","obj":{"i":23029,"n":"Wind-up Cirina","l":1,"c":59697,"t":81}}]}