{"quest":{"name":"It Takes an Enclave","location":"The Doman Enclave","id":68677,"patch":4.3,"sort":30,"icon":100795,"unlocksFunction":1,"eventIcon":71341,"issuer":1024791,"target":1024791,"genre":82,"journal":["Kozakura has a proposition for you.","The organization charged with overseeing the reconstruction of Doma, the Shazenkai, is poised to set their ambitious plans in motion. However, they will need the support of wealthy individuals like you if they are to succeed. Before you commit to a decision, Kozakura would have you visit one of their work sites and learn more about what the Shazenkai hopes to achieve.","Mitsuba, the overseer of what is to become the Ten Thousand Stalls, tells you of her vision for a one-stop venue that will serve every imaginable cuisine to the people of Doma. In so doing, she hopes to improve the quality of life for one and all, and motivate them to work harder. Although they have only just begun to prepare the site, it is clear that they will not rest until this first small victory is achieved.","As Kozakura explains, the Ten Thousand Stalls are but one example of what the Shazenkai hopes to achieve. Alas, it will take much time and effort, not to mention tremendous resources. Anything and everything you can afford to part with will be welcomed, and perhaps, with sufficient contributions, you will eventually see their dream of a Doma reborn realized."],"objectives":["Speak with Mitsuba.","Speak with Kozakura."],"dialogue":[{"name":"KOZAKURA","text":"<span class=\"highlight\">Forename</span>! Kami be praised! I was hoping you might pay us a visit. It is, as ever, an honor..."},{"name":"KOZAKURA","text":"Once again, I must thank you for helping our brothers and sisters secure passage back home."},{"name":"KOZAKURA","text":"With so many skilled craftsmen soon to be at our disposal, we of the Shazenkai are ready to proceed to the next stage of our plan to rebuild the enclave."},{"name":"KOZAKURA","text":"Which brings me to a...a rather delicate matter. Perhaps you will find this shameless, but circumstances being what they are...I see no other way."},{"name":"KOZAKURA","text":"The reconstruction and revitalization of the enclave cannot hope to succeed without the contributions of wealthy individuals such as yourself."},{"name":"KOZAKURA","text":"I understand if you wish to refuse outright, but I beg of you, please listen to our proposal in full before you decide."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"For the sake of Doma and her people, I should be glad to lend a hand."},{"name":"A1","text":"It's no bother, really. Let's hear it."},{"name":"A1","text":"...What's in it for me?"},{"name":"KOZAKURA","text":"It warms my heart to hear you say that! Truly, Doma has no greater friend."},{"name":"KOZAKURA","text":"Thank you, <span class=\"highlight\">Forename</span>. I shall endeavor to be brief."},{"name":"KOZAKURA","text":"W-Well, I... We have no desire to impose upon you beyond reason, to be clear, and I should like to think that there are benefits tangible and intangible... But first, pray allow me to explain!"},{"name":"KOZAKURA","text":"Where to begin... Ah, of course. It is important that you understand the state of the enclave at present."},{"name":"KOZAKURA","text":"I am sure you recall how everything was when you first arrived. Rubble in the streets, buildings in ruin and so forth. While we have made some superficial progress since the castle fell and Doma was liberated, the scars of the occupation are far from healed."},{"name":"KOZAKURA","text":"Since antiquity, the kingdom of Doma has prospered from the gifts of the One River. The success of our agriculture and industry is intricately tied to our position here."},{"name":"KOZAKURA","text":"Alas, in our struggle against the Garleans over the decades, much of what was built over centuries was lost. Fertile farmlands that once yielded produce for export were despoiled, and what little remained could barely feed our people..."},{"name":"KOZAKURA","text":"Our foreign rulers did not hesitate to impose their will on local industry as well. Not only were we forced to purchase goods from imperial concerns, regardless of quality or cost, but our merchants were also forced to sell their wares to Garleans at a loss─assuming they received compensation at all."},{"name":"KOZAKURA","text":"While those dark days are behind us, many of our former trading partners are reluctant to engage us in trade agreements, for fear of the Empire's wrath."},{"name":"KOZAKURA","text":"And so, for the most part, we must continue to fend for ourselves and craft what tools and so forth we require. Or so we would...had we the facilities."},{"name":"KOZAKURA","text":"...Forgive me. It is not so dire as it may sound. Our problems may be many, but we are all wholly committed to the challenge before us."},{"name":"KOZAKURA","text":"We are not unlike the shazenso─a hardy herb that can thrive in even the most inhospitable of conditions. I took inspiration from its strength and stubbornness when deciding upon a name for our organization, in fact."},{"name":"KOZAKURA","text":"No matter the struggle! No matter the cost! The Shazenkai will do everything in its power to overcome every hurdle and rebuild this home of ours!"},{"name":"KOZAKURA","text":"Ah! Please excuse my sudden fit of passion─ It was most unbecoming. Anyway, I have spoken of the general state of the enclave. Let us discuss more specific concerns."},{"name":"KOZAKURA","text":"Though, having said that, it would be simpler if you were to see things with your own eyes. Please head to the work site north of the aetheryte and speak with Mitsuba. I shall join you shortly."},{"name":"KOZAKURA","text":"I need a moment to finish some paperwork, so perhaps you might go and speak with Mitsuba? I shouldn't be much longer, but I do not wish to keep you waiting."},{"name":"MITSUBA","text":"Well, well. You're <span class=\"highlight\">Forename Surname</span>, aren't you? In need of a hot meal?"},{"name":"KOZAKURA","text":"Actually, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is here at my behest. I thought it would be best if a potential patron saw our efforts firsthand."},{"name":"KOZAKURA","text":"If you would be so kind as to explain to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> what you do..."},{"name":"MITSUBA","text":"Oho, foisting the burden onto me, are we? Very well, if you insist."},{"name":"MITSUBA","text":"Allow me to properly introduce myself. I'm Mitsuba. Once upon a time I owned and operated the largest tavern in the enclave. I had a hand in everything─from balancing the ledgers to stirring the cookpots."},{"name":"MITSUBA","text":"Owing to my experience, I've been asked to oversee the work here, in the Ten Thousand Stalls."},{"name":"MITSUBA","text":"Hah! That was the exact same look I gave Kozakura when she showed me this place. “Ten Thousand Stalls? By the kami, there's not even ten!”"},{"name":"MITSUBA","text":"But mark me─there will be. When we're through, this place will have on offer every imaginable cuisine. Just thinking about it's enough to set my heart racing─and my mouth watering."},{"name":"KOZAKURA","text":"As I explained earlier, however, trade─or lack thereof─is a major problem at present. We simply aren't getting enough shipments of consumables from outside Yanxia, and so our people are forced to eat the same simple fare, day after day."},{"name":"KOZAKURA","text":"However, once our negotiations with foreign concerns bear fruit, we should be able to exchange whatever surplus we produce for a wider variety of ingredients, bringing us closer to realizing Mitsuba's vision."},{"name":"KOZAKURA","text":"This may seem like a silly goal to strive for, but by improving the quality of life for our people in a clear, understandable manner, we can motivate them to work harder and tackle more difficult tasks. Doma will not be rebuilt in a fortnight, and we need every victory, however small."},{"name":"MITSUBA","text":"We've a bloody long road ahead of us, but we need only take it one step at a time. Whatever help you can contribute to the cause would be welcome."},{"name":"KOZAKURA","text":"Thank you for taking the time to speak with us, Mitsuba."},{"name":"KOZAKURA","text":"We should head back to the Shazenkai and continue our conversation there, so as not to get in the way of their work."},{"name":"KOZAKURA","text":"There is not too much left to explain, but if you would indulge me a little longer, I would be grateful."},{"name":"MITSUBA","text":"It's not much to look at right now, but believe you me: it will be."},{"name":"KOZAKURA","text":"The Ten Thousand Stalls are but one example of what we hope to build here in the enclave. Alas, it will take much time and effort..."},{"name":"KOZAKURA","text":"And...it will also take tremendous resources. Resources that I pray you will be willing to contribute."},{"name":"KOZAKURA","text":"Raw materials, foodstuffs, linens, medicines─all this and more would be of use. Anything and everything you can afford to part with would be welcome."},{"name":"KOZAKURA","text":"Furthermore, as a token of our appreciation, we will provide a small gratuity relative to the value of the items you relinquish."},{"name":"KOZAKURA","text":"You need only place these items in the donation basket to my left. I will calculate the gratuity and pay you immediately."},{"name":"SYSTEM","text":"You may now use the donation basket to contribute unneeded items to the Shazenkai! These items will be used to supply and finance the reconstruction of the Doman Enclave. Further details can be had by speaking with Kozakura."}],"reward":{"gil":1106},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68623]}},"partials":[{"type":"npc","id":"1024791","obj":{"i":1024791,"n":"Kozakura","l":2813,"q":4}},{"type":"quest","id":"68623","obj":{"i":68623,"n":"A Thousand and One Farewells","g":82,"l":"Revenant's Toll","s":20,"f":1}}]}