{"quest":{"name":"Eorzean Nimble Warrior","location":"Eastern La Noscea","id":68672,"patch":4.3,"sort":159,"repeatable":1,"icon":100792,"eventIcon":71222,"issuer":1026034,"target":1026037,"genre":201,"journal":["Beaudefoin will be your guide on the path to becoming an Eorzean Nimble Warrior.<br>※This quest is available for a limited time only.","Beaudefoin explains the simple rules of the Eorzean Nimble Warrior course. Each of the three sections is marshaled by a Moonfire Faire chaperone, to whom you must speak before proceeding any further. J'nangho is the first chaperone and can only be reached by a series of carefully measured leaps.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Upon witnessing your completion of the first test, J'nangho is pleased but not surprised by your success. She warns you that greater challenges must be overcome to arrive at Hildelana's platform at the end of the second section.","As you step onto the next stage of the course, the steep increase in difficulty is apparent from the outset. Each jump and balancing act is more perilous than the last, and you breathe a sigh of relief when you finally reach Hildelana. While she is clearly delighted that you have made it this far, she is nonetheless quick to impress on you that the worst is still to come...","Faced with the imposing final section of the course, you step forward with trepidation. Knowing that every leap could end in dismal failure, you feel as though your heart is in your throat as you slowly ascend the tower. At long last, the goal is in sight, and with one final jump, your triumph is secured. P'obyano the chaperone welcomes you with a beaming smile, and elated cheers can be heard from the spectators watching from Costa del Sol. There can be no doubt in the minds of the awed onlookers that the Adventurers' Guild boasts the most courageous, nimblest warriors Eorzea has ever seen."],"objectives":["Complete the first section of the course and speak with J'nangho.","Complete the second section of the course and speak with Hildelana.","Complete the final section of the course and speak with P'obyano."],"dialogue":[{"name":"BEAUDEFOIN","text":"So, are you ready to face the Eorzean Nimble Warrior course, to risk it all for a chance at glory? If so, you've come to the right place!"},{"name":"BEAUDEFOIN","text":"Before you begin, allow me to explain the rules. The course is divided into three parts, which you have to complete in order. There is but one objective: to reach the chaperones standing on the platforms."},{"name":"BEAUDEFOIN","text":"You can take as long as you need, and if you fall off, just go back to the beginning of that section to try again. The first chaperone you need to reach is J'nangho, who'll tell you where to go next. Now, step into the jet of water and make us proud!"},{"name":"BEAUDEFOIN","text":"Back for more? There are even more onlookers to impress than last time, so show them what you've got!"},{"name":"BEAUDEFOIN","text":"Remember─just because you've beaten the course before, don't underestimate it."},{"name":"BEAUDEFOIN","text":"If you show a moment's hesitation or misstep by even half an ilm, you'll be in the drink before you know it. Or in the sand. Either way, very embarrassing. Anyway, J'nangho is waiting for you on her platform. Don't keep the spectators waiting─off you go!"},{"name":"BEAUDEFOIN","text":"This may be the easiest of the three sections, but don't get careless."},{"name":"BEAUDEFOIN","text":"That was very impressive and all, but you're going the wrong way!"},{"name":"JNANGHO","text":"Oh! Well done! But don't pat yourself on the back yet. There's still a long way to go!"},{"name":"JNANGHO","text":"Once you've caught your breath, make your way towards Hildelana at the end of the second section. Best of luck!"},{"name":"JNANGHO","text":"Do you need a rest? Enjoying the view, perhaps? There's no need to rush I suppose, but the spectators might think you're being lazy. And we wouldn't want that, would we?"},{"name":"HILDELANA","text":"Such poise, such grace! A fine demonstration of what members of the guild are capable of."},{"name":"HILDELANA","text":"However, I must save my most heartfelt congratulations for when you have conquered the third and final stage. Luckily for me, I will have the perfect view of your ascent to the top. Good luck!"},{"name":"HILDELANA","text":"It may seem rather daunting, and for good reason, but it is by no means impossible. Be sure to maintain focus and above all, don't look down!"},{"name":"POBYANO","text":"You did it! I knew you would! Right from the start, I had a good feeling about you. I couldn't help but follow your progress every step of the way."},{"name":"POBYANO","text":"And it seems I wasn't the only one. Your young friends jumped for joy when you reached the top."},{"name":"POBYANO","text":"That reminds me─you'd better go and let Haermaga know that you finished the course. He struggles to watch the competitors <span class=\"emphasis\">and</span> handle all of the registrations, so we ask all successful entrants to report to him afterwards. It helps us keep track of things."},{"name":"POBYANO","text":"You don't have to hurry, though. I think you've earned a respite after all of your exploits. And watch your footing on the way down. We can't have you breaking your legs in front of everybody! That would certainly take the shine off of your achievement."},{"name":"POBYANO","text":"In fact, I would say they cheered even louder than before. You've become quite a favorite with the crowds."},{"name":"POBYANO","text":"You can try the course as many times as you like, so if you'd like to start again, talk to Beaudefoin. That way, we'll be able to give you the proper rewards."}],"reward":{"items":[{"num":10,"id":8216},{"num":10,"id":5902}]},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[68671]},"next":[68673]},"partials":[{"type":"npc","id":"1026034","obj":{"i":1026034,"n":"Beaudefoin","l":32,"q":1,"t":"Moonfire Faire Chaperone"}},{"type":"npc","id":"1026037","obj":{"i":1026037,"n":"P'obyano","l":32,"q":1,"t":"Moonfire Faire Chaperone"}},{"type":"item","id":"8216","obj":{"i":8216,"n":"Pinwheel","l":1,"c":27001,"t":85,"p":19}},{"type":"item","id":"5902","obj":{"i":5902,"n":"Bombard Bloom","l":1,"c":22647,"t":85,"p":8}},{"type":"quest","id":"68671","obj":{"i":68671,"n":"Jump to the Beach","g":201,"l":"Limsa Lominsa","s":158}},{"type":"quest","id":"68673","obj":{"i":68673,"n":"If at First You Don't Succeed, Give Up","g":201,"l":"Eastern La Noscea","s":160}}]}