{"quest":{"name":"Lighting the Way","location":"The Doman Enclave","id":68689,"patch":4.4,"sort":40,"icon":100796,"unlocksFunction":1,"eventIcon":71341,"issuer":1024791,"target":1024791,"genre":82,"journal":["Kozakura is looking for advice on ancient Doman customs.","Having made considerable progress with the reconstruction of the enclave, Kozakura is weighing up the possibility of reintroducing a ritual known as “tento-okuri,” in which floating paper lanterns are released into the air, drifting on the wind to guide spirits of deceased kin to the afterlife. Though the custom has not been observed since the Garlean occupation, Tsuranuki and Araragi are old enough to remember it and reveal not only further details surrounding the tradition, but a willingness to hold such an event at the One Garden. Without a moment's hesitation, they throw themselves into the preparations, persuading you and Kozakura to spread word among the locals.","Mitsuba decides to put her activities at the Ten Thousand Stalls on hold for long enough to join in the festivities. Minazuki also expresses a similar level of enthusiasm and agrees to bring her students to participate in the tento-okuri.","After a veritable whirlwind of activity, the preparations for the ceremony are complete. Araragi has provided countless paper lanterns while Tsuranuki, Kozakura, and the Shazenkai have succeeded in gathering almost every citizen of the enclave. Kozakura announces the start of the tento-okuri and each attendee sends lantern after lantern drifting upward, filling the sky with ephemeral beauty.","The ceremony was an unforgettable experience for all involved. The reclamation of not only their homeland but their cultural identity gives Domans reason to be hopeful for the future. The settlement has also reached an important point in its history, as it has now become entirely self-sufficient. Your contributions to the liberation of Doma and the rejuvenation of the enclave have earned you a place among the great heroes of the realm."],"objectives":["Speak with Mitsuba.","Speak with Minazuki.","Wait at the designated location.","Speak with Kozakura."],"dialogue":[{"name":"KOZAKURA","text":"Oh, <span class=\"highlight\">Forename</span>! I did not see you there."},{"name":"KOZAKURA","text":"Sorry, I was lost in thought. I have been considering the possibility of reviving an old Doman tradition. A memorial service for the deceased, to be precise."},{"name":"KOZAKURA","text":"In years gone by, Domans would honor the souls of departed kin by sending floating lanterns into the sky. This is known as “tento-okuri.”"},{"name":"KOZAKURA","text":"That was until the Garleans took over. Religious rites were strictly forbidden, particularly those that could be performed within the safety of one's own home."},{"name":"KOZAKURA","text":"Being born after the invasion, I have never experienced this myself, but restoring this custom would be another step to bringing Doma closer to its former glory. I would certainly benefit from the wisdom of the older generations who remember the observance of tento-okuri."},{"name":"TSURANUKI","text":"(-Familiar Voice-)Did you say tento-okuri? Bwahahaha! It has been many a year since we held one of those!"},{"name":"KOZAKURA","text":"Masters Tsuranuki and Araragi! What brings the two of you here?"},{"name":"ARARAGI","text":"I would have come here by myself if he hadn't followed me! I cannot seem to escape this cantankerous curmudgeon."},{"name":"TSURANUKI","text":"You have some nerve, paper tiger! And as I recall, you are the one that followed me!"},{"name":"ARARAGI","text":"Kozakura─you wish to know of tento-okuri? Perhaps the reminiscences of an old man would be of some use on this occasion."},{"name":"ARARAGI","text":"As the name suggests, it involves “sending lanterns up to the heavens.” It is a chance to say our final farewells to the spirits of the dead as they embark on their journey into the hereafter."},{"name":"ARARAGI","text":"The lanterns float on the wind, ever upward, to light the way."},{"name":"TSURANUKI","text":"The more there are and the higher they fly, the happier all of those souls will be! Bwahahaha! Our dead friends will have the time of their lives!"},{"name":"KOZAKURA","text":"I can only imagine how enchanting that must be... Would we be able to hold the ritual anywhere near here?"},{"name":"TSURANUKI","text":"Yes, and I know just the place! The pavilion in the garden would be ideal, as it overlooks the One River. We wouldn't want any lanterns falling on anything flammable, would we? Which reminds me, where are we going to get all of our guiding lights?"},{"name":"ARARAGI","text":"Hello? Are you so absent-minded you have forgotten about me already? Making paper lanterns is one of my many specialties!"},{"name":"TSURANUKI","text":"Ha! It was about time you said something useful! Very well, I suppose you can be trusted not to botch this entirely. But make sure you finish this while we are still around to see it. Otherwise, those floating spirits will have two more travel companions!"},{"name":"TSURANUKI","text":"Kozakura, can we rely on the Shazenkai to spread word of the event?"},{"name":"KOZAKURA","text":"Consider it done!"},{"name":"TSURANUKI","text":"The sooner we get the rest of the enclave on board, the more help they will be able to offer. <span class=\"highlight\">Forename</span>, could you see if Mitsuba and Minazuki are interested?"},{"name":"TSURANUKI","text":"After that, meet us in the One Garden. In the meantime, we old men have work to do. Well, he does. I will see what I can do to drum up support. Both of you do your bit, and we'll do ours!"},{"name":"KOZAKURA","text":"Well, those two certainly do not waste any time, do they? In that case, it is only meet that we follow suit."},{"name":"KOZAKURA","text":"I shall begin preparations along with the other members of the Shazenkai. Would you be so kind as to speak with the aforementioned pillars of our community?"},{"name":"TSURANUKI","text":"Have you finished making your rounds yet? No? Then why are you standing here having a chitchat with me? Go on, get to it!"},{"name":"KOZAKURA","text":"While I do get the distinct impression that we are rushing things somewhat, I am confident it will all come together in the end!"},{"name":"ARARAGI","text":"It has been many a year since I last made lanterns for tento-okuri, but the design is simplicity itself. My apprentices will keep producing them until I give the order to stop, so there should be more than enough."},{"name":"TAUYAKU","text":"I am rather looking forward to this memorial ritual. It brings me great joy that it will be held in the One Garden."},{"name":"HACHISUBA","text":"If there is anything I can do to help with the ceremony, do not hesitate to ask."},{"name":"MINAZUKI","text":"Oh, <span class=\"highlight\">Forename</span>! How lovely to see you. Is there something you wish to discuss?"},{"name":"MINAZUKI","text":"Tento-okuri? My, my, I never thought I would live to see another one of those. Of course, it would be our pleasure to attend. This is a valuable opportunity for the children to learn of our nation's rich traditions."},{"name":"MITSUBA","text":"You're just in time to try my latest dish! It's Eorzean stew."},{"name":"MITSUBA","text":"Oh, the ceremony with the lanterns? Yes, I'd love to go! I have one or two things to see to first, so I'll meet you there."},{"name":"MINAZUKI","text":"My students and I will join you in the One Garden presently. Thank you again for your kind invitation."},{"name":"MITSUBA","text":"Sorry, I have a few pots on the boil. I'll head over once I'm done here."},{"name":"KOZAKURA","text":"Everyone, may I have your attention!"},{"name":"KOZAKURA","text":"Welcome to the tento-okuri, in which we wish the souls of our kin a safe journey as they depart for the heavens."},{"name":"KOZAKURA","text":"But first, allow me to express my appreciation to the artisans of the Yard, without whom none of this would have been possible."},{"name":"ARARAGI","text":"Thank you for the opportunity to be a part of this auspicious occasion."},{"name":"KOZAKURA","text":"There is one more person I wish to thank─<span class=\"highlight\">Forename Surname</span>. You have worked tirelessly for the liberation of Doma, reconstruction of the enclave, and the reuniting of our people. We are eternally grateful."},{"name":"HOZAN","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> was a pillar of strength to the refugees during our time in Eorzea, and continues to be so here. I could spend a thousand lifetimes singing <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> praises and it still would not be enough!"},{"name":"MINAZUKI","text":"To think that we should stand as a people reunited to take part in a ritual passed down from days of yore... My late husband and all of the other dearly departed must be smiling upon us."},{"name":"TSURANUKI","text":"What's the matter?"},{"name":"KOZAKURA","text":"It's...nothing. I just..."},{"name":"KOZAKURA","text":"To see you all so happy and at peace... I feel as though our lost loved ones are here with us..."},{"name":"TSURANUKI","text":"Maybe they are, which is all the more reason not to cry."},{"name":"TSURANUKI","text":"I hardly think our dead friends would come here just to see us blubbering!"},{"name":"TSURANUKI","text":"And besides, those paper lanterns will not be flying anywhere if you soak them with tears! Come on, now. Chin up!"},{"name":"KOZAKURA","text":"I'm sorry... You're right..."},{"name":"KOZAKURA","text":"Ahem! In the unfortunate absence of Lord Hien, it falls to me to oversee the tento-okuri."},{"name":"KOZAKURA","text":"Now, let us light the way to the heavens!"},{"name":"KOZAKURA","text":"Shall we send our lanterns together?"},{"name":"HOZAN","text":"Who can say what the new dawn will bring─ For Doma, for all of us..."},{"name":"KOZAKURA","text":"There you are, <span class=\"highlight\">Forename</span>! I was hoping you would come by."},{"name":"KOZAKURA","text":"What did you think of the tento-okuri? In all honesty, I have never seen anything so beautiful."},{"name":"KOZAKURA","text":"In fact, I would say that the ceremony marked a turning point in the history of Doma. Perhaps now we can move on from the tragedies of the past and look to the future."},{"name":"KOZAKURA","text":"<span class=\"highlight\">Forename</span>, I would like you to have this. Obviously, it is scant repayment for your kindness and generosity, but perhaps it will serve as a memento for everything we have achieved."},{"name":"KOZAKURA","text":"The work of the Shazenkai will continue, only now that the enclave has the means of supporting itself, we no longer need to rely on donations."},{"name":"KOZAKURA","text":"I can scarce believe that this place was once little more than ruins."},{"name":"KOZAKURA","text":"Where once clouds of dust blew across splintered wood and piles of debris, now stand thriving businesses, places of learning, and homes where our people may grow and prosper."},{"name":"KOZAKURA","text":"You have touched the lives of us all, in so many ways. For you have been instrumental in the restoration of not only our country, but the pride and dignity of the Doman people."},{"name":"KOZAKURA","text":"Words alone cannot express how much this means to us."},{"name":"KOZAKURA","text":"However, the Shazenkai still have much to do! Our aim is to make the enclave better than it has ever been. We hope that one day, Doma can stand shoulder to shoulder with the other great civilizations of the world."},{"name":"KOZAKURA","text":"Of course, if you wish to make any further contributions, we would be delighted to accept!"},{"name":"KOZAKURA","text":"As always, we will be offering gratuities for any goods you are willing to provide. And even if you come only to visit, it would be an honor to welcome you again to our not-so-humble home!"},{"name":"SYSTEM","text":"Owing to your contributions, the reconstruction of the Doman Enclave is now complete."},{"name":"SYSTEM","text":"Although there will be no further expansion, you may continue to make donations within the weekly budget."},{"name":"SYSTEM","text":"You will still receive gratuities for items donated. The rate compared to selling at vendors has been increased."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from the Yard."},{"name":"HACHISUBA","text":"Although Master Ishibushi has taught me so much already, I feel like it will take decades before I even begin to approach his level of competence."}],"reward":{"gil":2000,"items":[{"id":24288}]},"reqs":{"jobs":[{"lvl":70,"id":1}]}},"partials":[{"type":"npc","id":"1024791","obj":{"i":1024791,"n":"Kozakura","l":2813,"q":4}},{"type":"item","id":"24288","obj":{"i":24288,"n":"Yanxian Merchant's Haori","l":1,"c":43847,"t":35,"p":5000}}]}