{"quest":{"name":"Shadows in the Empire","location":"The Doman Enclave","id":68681,"patch":4.4,"sort":29,"eventIcon":71201,"issuer":1026268,"target":1025597,"genre":7,"journal":["Hien has a request for the Scions."],"objectives":["Enter the Kienkan.","Speak with Hien.","Speak with Lyse in the Doman Enclave.","Speak with Hien at the Kienkan."],"dialogue":[{"name":"ALISAIE","text":"...Forgive me, I need a moment."},{"name":"YSHTOLA","text":"On present evidence, we have no reason to fear the worst. More than that I cannot say."},{"name":"YUGIRI","text":"We are no closer to establishing Master Alphinaud's whereabouts, and the suggestion of an imperial plot only compounds matters. We have much to consider."},{"name":"KIENKANGATEKEEPER03028","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"HIEN","text":"I <span class=\"emphasis\">had</span> hoped to steal a moment's rest after our little outing, but it would seem duty calls. A foreign emissary arrived in my absence."},{"name":"YSHTOLA","text":"Do not let us keep you then."},{"name":"HIEN","text":"Actually...I was wondering if you might join me. I cannot think of a guest who could fail to be impressed by the presence of the Scions─at least, none I should be happy to receive."},{"name":"ALISAIE","text":"Of course─if you think it will be useful."},{"name":"HIEN","text":"Thank you. Let us return to my manor, then."},{"name":"ALISAIE","text":"Yugiri assures me the task of searching is best left to her comrades. I shall trust to their experience and focus on what I can do."},{"name":"YSHTOLA","text":"That the Alliance would extend an invitation to Doma bespeaks the depth of their concern. Nor are they misguided. If Garlemald has fallen under Ascian control, the threat we face is incalculable."},{"name":"YUGIRI","text":"While we are happy to cooperate with the Eorzean Alliance, there are many things that Doma must do alone."},{"name":"LYSE","text":"Don't worry. Alphinaud's been through countless trials and come out stronger every time. He'll be back, I'm sure of it."},{"name":"HIEN","text":"My advisors and I will presently convene to discuss the matter of Doma's defenses. You are welcome to stay, of course..."},{"name":"YSHTOLA","text":"Had you not offered, I would have requested leave to remain. Where the Ascians are concerned, naught may be left to chance."},{"name":"HIEN","text":"As ever, we would benefit from your experience."},{"name":"HIEN","text":"I thank you for coming, Lyse─even if it was on official business. I had hoped there might be time to show you the land you helped to save, but I will settle for a fleeting visit if needs must."},{"name":"LYSE","text":"There never <span class=\"emphasis\">does</span> seem to be enough time for anything, does there... But I did get to see a little of the enclave. You've made excellent progress, I must say! And soon you'll have the chance to see how we're getting on too. Till the meeting, then!"},{"name":"LYSE","text":"...Um, <span class=\"highlight\">Forename</span>? I was wondering if I might have a word with you before I go. In private."},{"name":"HIEN","text":"Go on, my friend. I will send for Hakuro and the others in the meantime."},{"name":"LYSE","text":"Great. I'll wait for you at the docks."},{"name":"ALISAIE","text":"What does Lyse want to talk about, I wonder..."},{"name":"HIEN","text":"Go on and see what Lyse wants. I promise we won't begin without you."},{"name":"HAKURO","text":"So the Eorzean Alliance has invited Doma to attend a council. I had wondered if that might be the purpose of Mistress Lyse's visit."},{"name":"LYSE","text":"Thanks for coming. Knowing you, you've probably guessed what I wanted to talk about."},{"name":"LYSE","text":"Alisaie. She's acting as if everything's all right, but it's clear she's barely coping."},{"name":"LYSE","text":"The Alisaie I know is overbearing, willful, and reckless─and that's <span class=\"emphasis\">fine</span>. It's how she deals with feeling weak. She has to keep moving, or she's afraid she'll fall apart."},{"name":"LYSE","text":"...A lot like me."},{"name":"LYSE","text":"But the thing about people like us is that we need someone to keep an eye on us. I had Papalymo, and now I have my friends in the Resistance. And Alisaie has you and the Scions."},{"name":"LYSE","text":"Before you start, I'm not saying you're neglecting her. I'm sure you aren't, and I'm sure you won't─but she's a good friend, and when I see her like this, I can't help worrying. So please, make sure you give her all the support she needs, all right?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Leave it to me."},{"name":"A1","text":"You've nothing to worry about. Seriously."},{"name":"LYSE","text":"Thank you, <span class=\"highlight\">Forename</span>. It goes without saying, but if there's anything <span class=\"emphasis\">I</span> can do, you only need to ask."},{"name":"LYSE","text":"Well, I'd best be off. See you in Ala Mhigo!"},{"name":"ALISAIE","text":"Is everything all right with Lyse? I won't ask for details─I know you'd tell me if it were important."},{"name":"YSHTOLA","text":"I daresay I can guess the subject of your discussion with Lyse. She too was never one for concealment. Fortunately for you, the individual in question seems none the wiser."},{"name":"YUGIRI","text":"Your return is most timely. We have just apprised those newly arrived of where matters stand."},{"name":"HAKURO","text":"We all had our suspicions from the start, but a part of me was credulous enough to believe the Empire's promises. Never again. The imperial court is a nest of vipers, and any peace they offer is laced with poison."},{"name":"HIEN","text":"Ah, there you are, my friend. Everyone has assembled, so let us begin."}],"reward":{"gil":1007},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68680]},"next":[68682]},"partials":[{"type":"npc","id":"1026268","obj":{"i":1026268,"n":"Hien","l":2813,"q":2}},{"type":"npc","id":"1025597","obj":{"i":1025597,"n":"Hien","l":2847,"q":7}},{"type":"quest","id":"68680","obj":{"i":68680,"n":"Feel the Burn","g":7,"l":"Kienkan","s":28}},{"type":"quest","id":"68682","obj":{"i":68682,"n":"A Power in Slumber","g":7,"l":"Kienkan","s":30}}]}