{"quest":{"name":"The Black Heart Beneath","location":"Kugane","id":68686,"patch":4.45,"sort":60,"icon":100797,"unlocksFunction":1,"eventIcon":71341,"issuer":1025912,"target":1026353,"genre":70,"journal":["Alas, Shigure seems utterly devoid of hair and hope...","Inspector's Log:<br>Joy and dismay walk hand in hand this day, for while we have at last brought the notorious Wolf Burglar of Kugane to justice, the Soboro Sukehiro was lost to us once more! In the affable yet enigmatic swordsman Jim, I was so certain we had found a new friend, but alas, when the opportunity presented itself, he absconded with Master Akebono's most legendary of swords. Disappointing as this turn of events may be, my faithful assistants and I must rally our spirits and resume the chase, for Jim must answer for his misdeeds!<br>　　　　　　　　　　　　*　*　*<br>Although the Wolf Burglar is in the custody of the Sekiseigumi, the wandering swordsman Yojimbo and the Soboro Sukehiro are in the wind. Rejoined by Inspector Hildibrand, Nashu, and a certain gentlemanly zombie, you weigh your options and conclude that when at first you do not succeed, make inquiries of the townsfolk again, and pray that one divulges information of interest.","A good investigation could perhaps be likened to a pot of stew, in that sometimes one needs to let it sit and simmer. Alas, it would seem that this might not be the case in this instance, for it is not for lack of developments that your inquiries bear little fruit. Rather, the people of Kugane express a shared reluctance to cooperate with any investigation given the detainment of the Wolf Burglar, who it seems is held in rather high regard due to the questionable morals of his targets and the generosity he has shown to the poor and downtrodden...","That the Wolf Burglar was so beloved of the people comes as a surprise to Shigure, who believed him devoid of redeeming qualities. Though the law is the law, he knows not how to proceed if the public is unwilling to cooperate...leading the others to suggest not only that he adopt a new guise for a time, but that they also question the Wolf Burglar himself, for a man so popular and trusted may be privy to secrets─and since both he and Yojimbo had designs on the Soboro Sukehiro, they may even be connected in some manner.<br><br>You and the others accompany Shigure to the gaol in which the Wolf Burglar is held, and together you appeal to his better nature and ask that he divulge any pertinent information. The Lupin is more than willing to do so...provided that he is set free. Naturally, Shigure is unwilling to even consider this condition for a moment, and it is only at the urging of Inspector Hildibrand and the others that he relents and states that he will request that the prisoner be released temporarily into his custody. Time being of the essence, the inspector and his assistant take matters into their own hands, using the occasion to present to Shigure a hair tonic of surpassing effectiveness that will restore to him his lost locks. The resulting explosion of light not only transforms Shigure's scalp into the envy of every follicly challenged man, but serves to blind the gaol guard and allow the Gentle Dead Man, aided by his werewolf attire, to switch places with the Lupin thief, after which the group beats a hasty retreat.","The Wolf Burglar is free, and the Sekiseigumi appear to be none the wiser─for now. How long the deception will last remains to be seen, and so Shigure bids you follow him and the others into the waterways below, where your Lupin comrade seeks to find answers.","Away from the prying eyes of the law-abiding populace of Kugane, the Wolf Burglar introduces Shigure and the others to a merry band of rogues and scalawags. One of their number, Koju, is wary of placing his trust in a man of the Sekiseigumi, but the Lupin implores him not to be so quick to judge─and for Shigure to return the favor. Though Koju has no news of Yojimbo nor the Soboro Sukehiro to share, he assures you that, had the ronin attempted to sell the sword, he would have heard of it by now. This leads all present to deduce that Yojimbo may have stolen the sword for himself, and if he is indeed a collector of priceless and powerful weapons, then it stands to reason he would continue to seek out and obtain others. The only other comparable blade that comes to mind is the Ame-no-Murakumo, a fabled sword of eld said to have been wielded by the great kami Susano─with which you are intimately acquainted, as you inform the others. And so it is decided that the hunt for the samurai and the sword will continue in the Ruby Sea.","Before Shigure can continue onward, he has a mind to heed the others' advice and change into less conspicuous garments that do not declare his Sekiseigumi allegiance to all and sundry. The simplest course of action would be for him to change into his previous attire, but if your trials and travails with Inspector Hildibrand have taught you anything, it is that people do not always avail themselves of common sense..."],"objectives":["Question the residents of Kugane.","Speak with Shigure.","Speak with the Wolf Burglar.","Speak with Shigure."],"dialogue":[{"name":"SHIGURE","text":"You look well, <span class=\"highlight\">Forename</span>. I pray your adventures have not been too taxing."},{"name":"SHIGURE","text":"As for myself...the search for the Soboro Sukehiro, as well as Yojimbo, continues. Would that I could claim even a measure of progress..."},{"name":"HILDIBRAND","text":"Ah, Shigure! There you are!"},{"name":"HILDIBRAND","text":"We thought perhaps to find you inside, my bald man, but I see you are here, and in the company of my stalwart assistant!"},{"name":"SHIGURE","text":"Bald? You of all people should..."},{"name":"HILDIBRAND","text":"Having failed to seize upon new information of value or even passing relevance, we were in the midst of reconsidering our investigative strategy. But tell me─have you word of Jim and our missing sword?"},{"name":"SHIGURE","text":"Jim? Who is─ Ah, yes, Yojimbo. No, no, as I was just telling <span class=\"highlight\">Forename</span>, I have made no progress since last we spoke..."},{"name":"NASHUMHAKARACCA","text":"You seem distressed, Shigure. If you yet pine for your lost locks, then pine no longer, for we have brought you a hair tonic of preternatural effectiveness!"},{"name":"SHIGURE","text":"Really!? Well, that...that is actually a very considerate gesture. Thank you."},{"name":"NASHUMHAKARACCA","text":"Why not try it right now?"},{"name":"SHIGURE","text":"Aye, aye, the sooner the better, perhaps..."},{"name":"ZOMBIEA","text":"I say, to meet with Master Zombibrand and his bosom companions yet again! Truly, the kami have been kind to me!"},{"name":"HILDIBRAND","text":"'Tis always a pleasure to see a man of the old horde. But were you not bound for Eorzea? Why are you yet in the Far East?"},{"name":"ZOMBIEA","text":"Indeed, I had thought to return home and rejoin my brothers, and to that end did I call upon a local fisherman to secure passage. 'Twas from him that I heard a tale most fascinating which compelled me to stay."},{"name":"ZOMBIEA","text":"A funa yurei─a Far Eastern variety of undead─had been seen wandering an isle's shore. As my previous attempts to recruit fellow zombies had met with failure, I thought why not broaden my criteria, and appeal to this ghost in the spirit of camaraderie?"},{"name":"ZOMBIEA","text":"Alas, it is a most elusive quarry. Rather shy, it would seem. I sought to learn more of the funa yurei by questioning the people of this city, but have been unsuccessful thus far."},{"name":"HILDIBRAND","text":"I see, I see. I realize this is sudden, but in your inquiries, did you hear mention of Jim?"},{"name":"ZOMBIEA","text":"Jim? I fear I have heard naught of that particular Far Eastern spirit. Though, to be honest, not all have been willing to entertain my company, perhaps due to my undead nature..."},{"name":"HILDIBRAND","text":"It pains me to hear that, in this world, there remain people prejudiced against the living impaired..."},{"name":"ZOMBIEA","text":"You seek this Jim, Master Zombibrand? If so, I should be glad to help!"},{"name":"SHIGURE","text":"Grateful as we would be, it might be wise to change your attire. The people's reluctance to speak with you may be due to your passing resemblance to a certain wolfish fugitive who, until recently, terrorized the city."},{"name":"ZOMBIEA","text":"Oh! How careless of me. I shall change into something less conspicuous at once!"},{"name":"HILDIBRAND","text":"Then it is settled! When at first you don't succeed, make inquiries again. Let us split up and speak with the men and women of Kugane!"},{"name":"SHIGURE","text":"So...that's it? Everyone is simply going to ask after Jim again? I mean, if it so happens to lead to something, that's all well and good, but..."},{"name":"TSURUBAMI","text":"Oh, you're also pursuing that Yojimbo fellow? The Sekiseigumi were asking after him the other day. I'll tell you what I told them: I've never heard of the man."},{"name":"TSURUBAMI","text":"And just between you and me...even if I did know something, I don't know if I would want to tell them..."},{"name":"TSURUBAMI","text":"You know the Kugane Wolf Burglar? The one they locked away? Rumor has it they intend to inflict upon him terrible punishments for his so-called crimes. Madness, I tell you, madness!"},{"name":"TSURUBAMI","text":"Every single one of the burglar's “victims” were among the most notorious scoundrels of the city! Greedy merchants with no scruples whatsoever. What's more, everything he stole he gave to the poor and needy. And yet they decry him as a villain! Fools!"},{"name":"KEISETSU","text":"Yojimbo, you say? Hmm... The name does ring a bell..."},{"name":"KEISETSU","text":"Ah, yes, now I recall. The Lupin fellow was asking after him as well, though that was some time ago. He's since been detained by the Sekiseigumi─the Lupin, not your Yojimbo, that is."},{"name":"KEISETSU","text":"Not that I can imagine why. He's no criminal. Why, when I told him of how my mother had taken ill, he gave me the koban to purchase her medicine, without my asking or anything."},{"name":"KEISETSU","text":"They say he's done terrible things, but a man like that... No, I refuse to believe it. If there's any justice in this world, he'll be set free..."},{"name":"BYAKUDAN","text":"Let me guess: you are searching for a man named Yojimbo? The Sekiseigumi questioned me about him not long ago. Very desperate to find him, they were."},{"name":"BYAKUDAN","text":"I doubt they will receive much help from the populace at present, though..."},{"name":"BYAKUDAN","text":"Why, you ask? Surely you've heard. The Kugane Wolf Burglar has been arrested."},{"name":"BYAKUDAN","text":"Despite what the wealthy elite would have you believe, he is no demon deserving of the harshest sentence. If anything, he is a hero to the downtrodden, having shared his spoils with the least among us."},{"name":"BYAKUDAN","text":"If you ask me, the Sekiseigumi ought to take a closer look at the merchants he targeted. Akebono, in particular, has been at the center of many dark rumors..."},{"name":"BYAKUDAN","text":"Anyway, in light of the Wolf Burglar's detainment, many are less than willing to aid the Sekiseigumi in their activities. And unfortunately, if they suspect you to be working with them, you too may find your overtures rebuffed..."},{"name":"TSURUBAMI","text":"Haven't I seen you in the company of the Sekiseigumi? If you've friends among them, surely you can make them see reason and show the Wolf Burglar mercy?"},{"name":"KEISETSU","text":"I don't know if they were friends, but I do remember the Lupin fellow asking after Yojimbo. Not recently, though..."},{"name":"BYAKUDAN","text":"I'm afraid I cannot help you, friend. Nor do I think you will find others willing to accommodate you..."},{"name":"SHIGURE","text":"...I see. And what have you learned, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Not much about Yojimbo, I'm afraid..."},{"name":"A1","text":"Apparently a certain Lupin is rather well loved..."},{"name":"SHIGURE","text":"Huh. I had no idea the plight of the Wolf Burglar weighed upon the minds of so many. What exactly did they say?"},{"name":"SHIGURE","text":"A hero to the poor and downtrodden? A criminal who simply <span class=\"emphasis\">gave away</span> his hard-won spoils? This...this is all quite unexpected..."},{"name":"SHIGURE","text":"But whatever aspersions they may cast upon his victims, the law is the law. Even disreputable merchants are deserving of fair and equitable treatment. To ignore their plight is to let the mob decide their fate."},{"name":"SHIGURE","text":"That said, to hear that some may withhold information in protest is cause for concern. As a man of the Sekiseigumi, I cannot help but feel conflicted."},{"name":"HILDIBRAND","text":"If I may, Shigure─it might be best to dress in less conspicuous clothing, at least for the time being."},{"name":"SHIGURE","text":"I hate to say it, but that is a sensible suggestion. Surprisingly. Perhaps I should make use of my old kimono."},{"name":"SHIGURE","text":"Yet even if I were to do so, my face is already known. They would mark me as a Sekiseigumi, and perhaps even resent my attempts to deceive them..."},{"name":"NASHUMHAKARACCA","text":"I've got an idea! Why not ask the Wolf Burglar? If he's so popular with the people, who knows what secrets they've told him?"},{"name":"SHIGURE","text":"Ask...the Wolf Burglar?"},{"name":"SHIGURE","text":"Hmm... If both he and Yojimbo had designs on the Soboro Sukehiro, then it's possible they might know one another..."},{"name":"HILDIBRAND","text":"Well done, Nashu! I was but mere moments from reaching the selfsame conclusion!"},{"name":"SHIGURE","text":"It's settled, then. Let us go and question the prisoner without further delay."},{"name":"SHIGURE","text":"Greetings and well met, comrade. If I might have a moment of your time?"},{"name":"SHIGURE","text":"That we might ascertain the whereabouts of the fugitive Yojimbo, we wish to speak with the Kugane Wolf Burglar. Will you permit us to enter?"},{"name":"SEKISEIGUMIJAILER","text":"Certainly, Shigure, if it will aid you in your investigation. Follow me."},{"name":"SHIGURE","text":"I trust you are enjoying our hospitality. I come bearing questions."},{"name":"KUGANEWOLFBURGLAR","text":"Questions, eh? For little ol' me, you say?"},{"name":"SHIGURE","text":"Following your arrest, the ronin Yojimbo absconded with the Soboro Sukehiro you stole from Master Akebono. He remains at large."},{"name":"SHIGURE","text":"We have reason to believe the sword was his objective all along. Given that it was yours as well, I thought you might know something of the man and his motive."},{"name":"KUGANEWOLFBURGLAR","text":"...Everyone knows that sword's worth a bloody fortune and then some."},{"name":"KUGANEWOLFBURGLAR","text":"But finding a buyer for a masterpiece as famous as the Soboro Sukehiro─especially after word of its theft has spread far and wide, well...good luck with that, says I."},{"name":"KUGANEWOLFBURGLAR","text":"Why, they'd surely have to avail themselves of the services of certain disreputable folks with whom I happen to be intimately acquainted. I'd be happy to introduce you lot...as soon as you set me free."},{"name":"SHIGURE","text":"What!? Absolutely not! That is out of the question!"},{"name":"KUGANEWOLFBURGLAR","text":"Then we've got nothing more to discuss. Best be on your way."},{"name":"HILDIBRAND","text":"Now, now, Shigure. Let us not be too quick to judge! If the goodly men and women of Kugane are willing to trust in his good intentions, then perhaps we should as well!"},{"name":"SHIGURE","text":"An awful lot of people were willing to vouch for his character. If what they say is true, then it would be wrong to see him hanged..."},{"name":"SHIGURE","text":"I will propose to my superiors that you be temporarily released into our custody for the purposes of our investigation. Should you abide by the terms of our arrangement, you may receive leniency. What say you?"},{"name":"KUGANEWOLFBURGLAR","text":"I say you've got yourself a deal, baldy."},{"name":"SHIGURE","text":"Will they even consider my proposal, though? The deliberations alone may prove time-consuming, and if they refuse..."},{"name":"HILDIBRAND","text":"Remind me, Nashu: do you have that hair tonic on you?"},{"name":"NASHUMHAKARACCA","text":"I sure do, Inspector!"},{"name":"NASHUMHAKARACCA","text":"Now's as good a time as ever to try it, don't you think?"},{"name":"SHIGURE","text":"Here? In the gaol? Well, uh, far be it from me to refuse..."},{"name":"HILDIBRAND","text":"Remember to use the whole bottle, my good man! Pour it over your head until not a single drop remains!"},{"name":"SHIGURE","text":"That seems rather wasteful, but if you insist."},{"name":"SHIGURE","text":"I feel...strange. Like my scalp is... Oh... Oh! By the kami!"},{"name":"SEKISEIGUMIJAILER","text":"Shigure? Are you all right? I heard you shouting─"},{"name":"SEKISEIGUMIJAILER","text":"The Light...it binds them... They are too many!"},{"name":"HILDIBRAND","text":"And turn and flex and shake and bounce..."},{"name":"HILDIBRAND","text":"Perfection! Rejoice, my goodly burglar, as I, Hildibrand, agent of enquiry, inspector extraordinaire, have liberated you from your unjust imprisonment!"},{"name":"SHIGURE","text":"Now see here, Inspector!"},{"name":"SHIGURE","text":"Huh!?"},{"name":"SEKISEIGUMIJAILER","text":"What happened!? Has the prisoner escaped!?"},{"name":"SEKISEIGUMIJAILER","text":"Still in his cell, I see... But what in the world was that blinding light!?"},{"name":"SHIGURE","text":"A thousand pardons! One of my associates was...carrying small explosives, one of which detonated unexpectedly! I, of course, bade her take the others outside immediately, for safety's sake! I believe that explains that, yes? Yes!? Right, then! If you will excuse me!"},{"name":"SEKISEIGUMIJAILER","text":"Hm? Ah, yes, of course. Very good."},{"name":"SEKISEIGUMIJAILER","text":"Wait...when did Shigure regrow his hair?"},{"name":"SHIGURE","text":"How we managed to escape undetected, I have no idea. I can but pray that our ruse will remain intact..."},{"name":"SHIGURE","text":"The Wolf Burglar led the others into the waterways below. We should follow."},{"name":"KUGANEWOLFBURGLAR","text":"Been down here before? If so, you might have met my friends already. A contemptible lot, all Kugane's castoffs. If anyone's heard a peep from your quarry, it'd be them."},{"name":"KUGANEWOLFBURGLAR","text":"Come on, then, don't be shy..."},{"name":"KUGANEWOLFBURGLAR","text":"Ho, you're looking well for a rat bastard."},{"name":"KOJU","text":"Takes a wolf to know a rat, hah! To what do we owe the pleasure? And more importantly, how'd you slip free of the Sekiseigumi's noose?"},{"name":"KUGANEWOLFBURGLAR","text":"With my dashing good looks and my silver tongue, how else? But never you mind that─I need information, Koju."},{"name":"KOJU","text":"Do you, now? Or is the Sekiseigumi at your shoulder the one askin' questions?"},{"name":"KUGANEWOLFBURGLAR","text":"No need to give the lad a hard time. He did right by me, and I mean to return the favor."},{"name":"KOJU","text":"Eh? You mean you're helpin' him? Have you gone mad!?"},{"name":"KUGANEWOLFBURGLAR","text":"Heh, well, even if I have, it's nothing you and yours need worry your pretty little heads over. Give us a hand and we'll get out of your hair. Wolf's honor."},{"name":"KUGANEWOLFBURGLAR","text":"They're not a bad bunch, really. Most tried to make it living on the strait and narrow. Some even had a mind to join the Sekiseigumi, like you, but were found wanting for this reason or that."},{"name":"KUGANEWOLFBURGLAR","text":"When honest work's no longer an option, that leaves the other sort. The dangerous, the disreputable, the dirty. Somebody's got to do it, and so these industrious souls pick up the slack."},{"name":"KUGANEWOLFBURGLAR","text":"Maybe they're not the cream you'd prefer to hobnob with, but while you're in their company, I'd ask that you comport yourselves with a modicum of civility."},{"name":"SHIGURE","text":"I... Ahem. I should like to believe I have done just that. You'll forgive me if I've given you any reason to think otherwise."},{"name":"KUGANEWOLFBURGLAR","text":"See? Fast friends, we all are. Right, then─ We're after a bloke what goes by the moniker of Yojimbo. Heard tell of the man?"},{"name":"KOJU","text":"Yojimbo? Hmm... No, can't say it rings a bell..."},{"name":"KOJU","text":"Oi, any of you know a fella by the name of Yojimbo?"},{"name":"KOJU","text":"Well, there you have it. Might be different if he had a bounty on his head. What'd he do, anyway? Piss in the bugyo's rice porridge?"},{"name":"KUGANEWOLFBURGLAR","text":"Hah, if only! Stole the Soboro Sukehiro, he did."},{"name":"KOJU","text":"Bugger me, that's a beauty! Wonder why, though. Finding a buyer, even through the black market, would be a challenge and half. And if he'd even put out the word he was lookin', we'd have heard about it by now..."},{"name":"SHIGURE","text":"Bah, to come all this way and leave with nothing..."},{"name":"KOJU","text":"Here, let's not call it a day just yet. Assuming this Yojimbo didn't steal the sword for the challenge, there's only two reasons he'd take it: to sell it or to keep it. And if it's not about the money, then I doubt this is his first prize─or his last."},{"name":"HILDIBRAND","text":"Hark! My keen inspector's sense whispers and speaks...of a thieving collector of swords! Yes, there can be no mistake!"},{"name":"KOJU","text":"Aye, what he said, I suppose. If he's a collector, then only the best will do, which means his next target might be...oh, I don't know, the Ame-no-Murakumo?"},{"name":"SHIGURE","text":"Wait, the Ame-no-Murakumo? But I thought that was nothing more than a faerie tale! Do you mean to say the fabled sword of eld actually exists?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I've seen it with my own eyes."},{"name":"A2","text":"A giant kami tried to kill me and my friends with it, but I deflected the blow."},{"name":"SHIGURE","text":"You have? Truly? Where?"},{"name":"SHIGURE","text":"You what!? I have so many questions...but first, where did this all happen?"},{"name":"KOJU","text":"Housed within the Kojin of the Red's treasure vault, eh? If that's the case, then it seems to me you ought to continue your search in the Ruby Sea, no?"},{"name":"KUGANEWOLFBURGLAR","text":"It might well be the best place for us to look. In that case, let us─"},{"name":"HILDIBRAND","text":"Let us brook no further delay and head to the Ruby Sea at once!"},{"name":"HILDIBRAND","text":"Come, my friends! The Ruby Sea awaits!"},{"name":"NASHUMHAKARACCA","text":"I can't wait to get back out there so I can enjoy the sun and the surf!"},{"name":"KUGANEWOLFBURGLAR","text":"It's like I said: they've good hearts, each and every one of them. Sometimes fate deals you a bad hand, and you've got no choice but to make the most of it."},{"name":"KOJU","text":"If it's legendary swords and the like your man's after, he could do a lot worse than the Ame-no-Murakumo."},{"name":"SHIGURE","text":"To think that the Ame-no-Murakumo is not only real, but that it was brought to bear against you and yours by a kami of unfathomable strength..."},{"name":"SHIGURE","text":"Ahem! In any event, we now know where we might search: the Ruby Sea. Before I may leave, however, there is a matter of great import to which I must attend."},{"name":"SHIGURE","text":"Well, perhaps “great import” is something of an overstatement. I speak of the inspector's earlier advice concerning my garments."},{"name":"SHIGURE","text":"I will meet you at the Ruby Price after I have changed. Pray go on ahead without me. I insist!"}],"reward":{"gil":1043},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68631]},"next":[68687]},"partials":[{"type":"npc","id":"1025912","obj":{"i":1025912,"n":"Shigure","l":2404,"q":2}},{"type":"npc","id":"1026353","obj":{"i":1026353,"n":"Shigure","l":2404,"q":1}},{"type":"quest","id":"68631","obj":{"i":68631,"n":"The Blade Mislaid","g":70,"l":"Kugane","s":50,"f":1}},{"type":"quest","id":"68687","obj":{"i":68687,"n":"Good Swords, Good Dogs","g":70,"l":"Kugane","s":70,"f":1}}]}