{"quest":{"name":"Prelude in Violet","location":"The Lochs","id":68685,"patch":4.4,"sort":33,"icon":100804,"eventIcon":71201,"issuer":1026242,"target":1025549,"genre":7,"journal":["Alisaie is eager to rendezvous with Urianger.","You arrive at the Rising Stones to find Urianger waiting. The Archon duly relates his own experience of the voice, adding that he heard it at what was all but certainly the selfsame moment. Unwilling to speculate idly on who might be responsible, he declares his intention to make for Ala Mhigo to examine Thancred in person. Before you all depart, however, Y'shtola takes the opportunity to raise the subject of a strange phenomenon she observed in the Far East─which Urianger rather smugly deduces to be the localized aetheric thinning simultaneously observed across Eorzea. Mindful that it cannot be a coincidence, the two Archons are in the midst of agreeing to investigate the matter further when the voice returns to assault your minds again. Your skull ringing, you open your eyes to see Urianger and Y'shtola collapsed upon the ground, and a desperate Alisaie trying in vain to rouse them as all around rush to your aid.","Though plainly distraught at the plight of your comrades, Alisaie attempts to take charge of the situation, ordering that Thancred be brought to the Rising Stones for observation alongside the others. This done, she excuses herself to attend to a private matter in Limsa Lominsa. A certain someone is waiting for her at Maelstrom Command─one who might appreciate your presence too.","At Maelstrom Command, the person you have come to visit is revealed to be none other than Ga Bu. Alas, you find the child exactly as you left him, mute and oblivious to the world outside the walls of his mind. In spite of this, the opportunity to see the koboldling and voice her innermost fears to you is enough to rekindle Alisaie's spirits, and she meets your gaze with renewed resolve.","Thanking you for your company, Alisaie turns her steps back to the Rising Stones. Rather than following hot on her heels, you allow your friend some time alone with her thoughts, content in the knowledge that the young Scion will find her way.","Back at headquarters, Alisaie outlines her plan for rousing the stricken Scions, which begins with seeking the aid of various factions. Amidst a sea of uncertainty, swirling with Ascian machinations and unexplained phenomena, she is determined to forge on. Her newfound determination fuels your own, and you likewise set your sights upon that which only you can do."],"objectives":["Speak with Alisaie at the Rising Stones.","Speak with Alisaie at Maelstrom Command.","Speak with Alisaie.","Speak with Alisaie at the Rising Stones."],"dialogue":[{"name":"YSHTOLA","text":"I shall be interested to hear how Urianger's experience compares to our own."},{"name":"KANESENNA","text":"Never have I encountered such a phenomenon. If this is magic, it is beyond my ken."},{"name":"LYSE","text":"Don't worry about Thancred. I'll send word as soon as there's any change."},{"name":"ALISAIE","text":"Urianger agreed to meet us at the Rising Stones. If any of the others heard the voice, we'll find out soon enough."},{"name":"LYSE","text":"Good luck. I should get back to the meeting with the Elder Seedseer, but if there's anything I can do─anything at all─you must let me know, all right? Promise me."},{"name":"ALISAIE","text":"Right, let's be on our way."},{"name":"HOARYBOULDER","text":"This is an unprecedented predicament for the Scions, but we must remain strong─the least of us most of all."},{"name":"RIOL","text":"Didn't the selfsame thing happen to Thancred? Who's bloody next?"},{"name":"EPHEMIE","text":"We had spoken earnestly of doing more to ease the senior Scions' burdens─but not under these circumstances...nor less so soon. I only hope I will be equal to the challenge."},{"name":"ALISAIE","text":"Forgive me, that was an unseemly display..."},{"name":"HOARYBOULDER","text":"It happened before your very eyes, my lady. None here would have behaved any differently."},{"name":"HOARYBOULDER","text":"We have borne the two of them to a private chamber. But tell me, is it true that Master Thancred languishes in a like state in Ala Mhigo?"},{"name":"ALISAIE","text":"I'm afraid so. Though, given the circumstances, it would seem best to observe them together. I will send word to Lyse that he should be brought here."},{"name":"HOARYBOULDER","text":"Take heart, my lady. The world is full of scholars and knowledgeable folk of every persuasion. Someone out there is bound to know what ails our comrades, and how it may be cured. Thus will we rouse them─no matter what."},{"name":"ALISAIE","text":"That we will, Hoary. That we will."},{"name":"ALISAIE","text":"But first things first─our comrades will have questions. May I ask that you explain the situation to them? I must attend to a private matter."},{"name":"ALISAIE","text":"Oh, I promised I'd visit someone in Limsa Lominsa. He's been waiting at Maelstrom Command for a while now."},{"name":"ALISAIE","text":"...You know, you should come along too. I think he'd be glad to see you."},{"name":"HOARYBOULDER","text":"Worry not, <span class=\"highlight\">Forename</span>─Ocher and Aenor are keeping watch over Mistress Y'shtola and Master Urianger. Pray keep Mistress Alisaie company."},{"name":"MAELSTROMOFFICER","text":"With Mistress Alisaie, are you? She usually visits alone. Still, it'd make a welcome change for the little one."},{"name":"ALISAIE","text":"As you've probably guessed, it's Ga Bu we've come to see. The private here will bring him out to us."},{"name":"ALISAIE","text":"Ever since the Maelstrom took him in, I've tried to visit as often as I can. And after what befell our friends, I was taken by the urge to visit again. It's...difficult to explain."},{"name":"MAELSTROMOFFICER","text":"Rest assured, the little one's safe with us."},{"name":"ALISAIE","text":"Let's return to the Rising Stones and take it from there."},{"name":"ALISAIE","text":"Thanks again for agreeing to come. It meant a lot to me."},{"name":"ALISAIE","text":"I did some thinking on the way back, and I think Hoary is right: we need to seek outside help. Ordinarily, we would turn to our own experts on such matters, but they're both among the stricken..."},{"name":"ALISAIE","text":"I will begin by reaching out to the myriad guilds and research institutions here in Eorzea. Additionally, Grandfather and Minfilia had a wealth of connections between them, and I mean to explore those avenues too. We'll find a way to save everyone, mark my words."},{"name":"ALISAIE","text":"Much and more has happened in recent days. Some of it for the good, some...not so. But all around me, people continue their fight."},{"name":"ALISAIE","text":"From the shinobi who search for Alphinaud to the Alliance members who make ready to move against the Empire, they march on in the face of great adversity, bearing heavy burdens. Everyone is playing their part...and so must I."},{"name":"ALISAIE","text":"You have your own part to play, I know, and it's bigger than most. So I won't keep you. Just promise that you'll visit from time to time, and I promise I'll have good tidings to share with you when you do."},{"name":"SYSTEM","text":"Meanwhile, at a resistance encampment, somewhere in the Empire..."},{"name":"ALPHINAUD","text":"What in the world...?"},{"name":"ALPHINAUD","text":"Dead... All dead. Yet I see no wounds, nor any evidence of battle..."},{"name":"SHADOWHUNTER","text":"(-Shadowhunter-)Damn them. They finally used it."},{"name":"SHADOWHUNTER","text":"(-Shadowhunter-)The Empire developed an alchemical weapon in Gyr Abania. A gas. “Black Rose,” it was called, and to breathe it is to breathe your last."},{"name":"ALPHINAUD","text":"And that did <span class=\"emphasis\">this</span>?"},{"name":"SHADOWHUNTER","text":"(-Shadowhunter-)I thought the project abandoned, and its vile fruit destroyed. But naught else could have wrought such an atrocity."},{"name":"SHADOWHUNTER","text":"(-Shadowhunter-)Fools... What do they hope to gain with this butchery? Can they not see that a rule won through terror will not endure? How many more provinces must they lose!?"},{"name":"SHADOWHUNTER","text":"(-Shadowhunter-)Nay...wait. This is not the work of men, but monsters. The Ascians. It cannot be a coincidence that their trail led us here. Their objective was never to rule, but to sow strife and discord."},{"name":"ALPHINAUD","text":"Such a crime does indeed bear the mark of the Bringers of Chaos."},{"name":"ALPHINAUD","text":"Black Rose cannot be allowed to kill again. We must find the Ascians and put an end to their plot."}],"reward":{"gil":3500},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68684]},"next":[68715]},"partials":[{"type":"npc","id":"1026242","obj":{"i":1026242,"n":"Alisaie","l":2408,"q":2}},{"type":"npc","id":"1025549","obj":{"i":1025549,"n":"Alisaie","l":481,"q":5}},{"type":"quest","id":"68684","obj":{"i":68684,"n":"The Call","g":7,"l":"The Azim Steppe","s":32}},{"type":"quest","id":"68715","obj":{"i":68715,"n":"Soul Searching","g":7,"l":"The Rising Stones","s":34}}]}