{"quest":{"name":"The Call","location":"The Azim Steppe","id":68684,"patch":4.4,"sort":32,"eventIcon":71201,"issuer":1026284,"target":1026242,"genre":7,"journal":["Y'shtola would see the aether flow once more."],"objectives":["Speak with Y'shtola at the House of the Crooked Coin.","Speak with Hien.","Speak with Alisaie at the Kienkan.","Speak with Thancred in the Ala Mhigan Quarter.","Speak with the Resistance guard.","Speak with Alisaie."],"dialogue":[{"name":"HIEN","text":"And so our alliance begins to take shape. Now, if we can just get that aether flowing again, it will have been a successful trip."},{"name":"KIENKANGATEKEEPER03028","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"YSHTOLA","text":"We have the requisite consent. 'Tis time to put Nhaama's power to use."},{"name":"YSHTOLA","text":"If the aether flows as planned, all that remains is to have the Ironworks' engineers do their work at the ruins. Come, let us return to the House of the Crooked Coin."},{"name":"HIEN","text":"I would not have the first idea how to awaken such a contraption, let alone control it. But then I'm not an Archon of Sharlayan."},{"name":"YSHTOLA","text":"I shall begin at once. You may wish to step back."},{"name":"YSHTOLA","text":"To manipulate aether in such vast quantities is draining to say the least. I shall take it slowly for a while."},{"name":"HIEN","text":"I do not pretend to understand what you did, Y'shtola, but you did it! Thanks to you─and <span class=\"highlight\">Forename</span>, of course─we have taken a momentous step towards securing our defenses."},{"name":"HIEN","text":"Now, as much as I believe a rest is in order, we should probably make haste back to the enclave."},{"name":"YSHTOLA","text":"Agreed. The others may already have returned from their missions, and I would know how things stand."},{"name":"HIEN","text":"As would I. Without further ado, then."},{"name":"YSHTOLA","text":"'Twould seem we are the last to arrive."},{"name":"HIEN","text":"Everyone has returned. Excellent. Time to take stock."},{"name":"YUGIRI","text":"Each of the factions lent an ear to our petition. As anticipated, however, many were unwilling to do any more than that."},{"name":"HAKURO","text":"My lord informs me you were instrumental to the success of his mission to the Azim Steppe. Though we hope to make many more allies, we could wish for no better than you and your fellow Scions."},{"name":"HANCOCK","text":"I'm reliably informed that Doma seeks to forge an alliance... The thing about alliances, of course, is that they can be so very <span class=\"emphasis\">expensive</span>. While I daresay it's within the company's means to provide the necessary funds, it is for the chairman to decide whether such an investment would be worth the risk."},{"name":"ALISAIE","text":"Judging by your triumphant expressions, I take it all went well on the Azim Steppe."},{"name":"YSHTOLA","text":"Indeed. We have secured a suitable source of energy for the barrier."},{"name":"ALISAIE","text":"Good. Tataru and I have commissioned Garlond Ironworks to ensure that the field generators function as they should. A team of engineers stand ready to set out for the Burn at a moment's notice. You need only say the word."},{"name":"HIEN","text":"I thank you for engaging their services on our behalf. The minutiae of the arrangement, you may leave to me."},{"name":"HIEN","text":"Which just leaves the small matter of our alliance. So, Yugiri and Hakuro...how fared you with our neighbors?"},{"name":"YUGIRI","text":"My lord. All of the factions we approached are in agreement that the Empire poses a threat, and many responded positively to talk of an alliance."},{"name":"YUGIRI","text":"From Hingashi and Sui-no-Sato, however, we received outright rejections. The former will not break its treaty with the Empire and the latter will not involve itself in conflict."},{"name":"HIEN","text":"Just as we expected, then. Well, there is naught to be done about it. We must focus on the rest. To each of the nations that were amenable to an alliance, I will personally send a missive."},{"name":"HIEN","text":"And once I have attended to that, I believe we will have done everything we can to fortify Doma's defenses─for the time being at least. All of which means I may leave for the meeting in Ala Mhigo with a lighter heart. Yugiri, Hakuro─if you would be so kind as to hold the fort in my absence."},{"name":"HIEN","text":"My friends, we could not have achieved so much in so little time without your help. For that, I give you my heartfelt thanks. Till the meeting, then."},{"name":"ALISAIE","text":"I took the liberty of asking Thancred to attend as well. He should have arrived in the Ala Mhigan Quarter by now."},{"name":"YSHTOLA","text":"Then let us not keep him waiting. Shall we?"},{"name":"HIEN","text":"As I mentioned, I have missives to write and some few other matters to attend to ere I depart. See you anon, my friend."},{"name":"YUGIRI","text":"I knew full well how Hingashi and Sui-no-Sato would respond, yet it did naught to lessen the disappointment when they finally stopped equivocating."},{"name":"HAKURO","text":"Are you perchance familiar with Nagxia? It is the region to the south and west of Yanxia, and home to several small nations. Such peoples well understand the value of an alliance, and thus did many of them receive our proposal most favorably."},{"name":"ALISAIE","text":"It occurs to me, this will be the first time I meet the leaders of the Alliance in an official capacity. More stiff greetings, pleasantries, formalities─does that sound about right?"},{"name":"YSHTOLA","text":"Let us hope that the coming meeting passes more peaceably than the last such gathering in Ala Mhigo..."},{"name":"THANCRED","text":"Y'shtola has told me all. And I duly told Urianger and Krile."},{"name":"THANCRED","text":"Krile, in particular, was concerned about Alphinaud, but I assured her that everything that can be done is being done. She agreed to continue with her own tasks for the time being on the condition that I contact her the moment there is any development."},{"name":"THANCRED","text":"So, that leaves four of us to attend the council. Arenvald is here to assist with security, incidentally, though the poor lad seems altogether too distracted for the task. Another one missing Alphinaud, I expect."},{"name":"THANCRED","text":"Ah, but it's almost time. As soon as you are ready, present yourself to the guardsman at the palace entrance. I shan't be far behind."},{"name":"THANCRED","text":"If you can spare a moment after the proceedings, consider seeking out Arenvald. A word from you would do wonders for the lad, I'm sure."},{"name":"RESISTANCEGATEGUARD","text":"Ah, the Scions of the Seventh Dawn, welcome to Ala Mhigo! The Alliance leaders have already arrived. May I show you to the meeting chamber?"},{"name":"RESISTANCEGATEGUARD","text":"Upon proceeding to the Royal Palace, several cutscenes will play in sequence."},{"name":"RESISTANCEGATEGUARD","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"Q1","text":"Enter the Royal Palace?"},{"name":"YSHTOLA","text":"If the Ascians are indeed responsible, we must take steps to protect ourselves. Though I know not how..."},{"name":"KANESENNA","text":"Never have I encountered such a phenomenon. If this is magic, it is beyond my ken."},{"name":"LYSE","text":"Don't worry about Thancred. I'll send word as soon as there's any change."},{"name":"RESISTANCEGATEGUARD","text":"The council has resumed, and the leaders offer their assurances that they have the remaining agenda well in hand. They bid you godsspeed in shedding light on the mystery."},{"name":"ALISAIE","text":"I just tried to call Urianger on his linkpearl. He didn't respond, but I dare to hope that he possesses some knowledge we do not."},{"name":"ALISAIE","text":"...Ah, Urianger! Something happened during the meeting. Thancred's collapsed. A disembodied voice suddenly started─"},{"name":"ALISAIE","text":"...<span class=\"emphasis\">What</span>? But that's... We should talk about this in person.<br>...All right. We'll meet you there."},{"name":"ALISAIE","text":"That was Urianger. He heard the voice too!"},{"name":"YSHTOLA","text":"In <span class=\"emphasis\">Thanalan</span>? Hm."},{"name":"YSHTOLA","text":"As we alone were afflicted at the meeting, I had my suspicions, but if the voice also spoke to Urianger, there can be little doubt: the Scions were targeted specifically."},{"name":"YSHTOLA","text":"By whom and to what end is the question. One to which we must find an answer with all possible haste."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Endure</span>!"}],"reward":{"gil":2490,"emote":"Endure"},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68683]},"next":[68685]},"partials":[{"type":"npc","id":"1026284","obj":{"i":1026284,"n":"Y'shtola","l":2411,"q":2}},{"type":"npc","id":"1026242","obj":{"i":1026242,"n":"Alisaie","l":2408,"q":2}},{"type":"quest","id":"68683","obj":{"i":68683,"n":"The Will of the Moon","g":7,"l":"The Azim Steppe","s":31}},{"type":"quest","id":"68685","obj":{"i":68685,"n":"Prelude in Violet","g":7,"l":"The Lochs","s":33}}]}