{"quest":{"name":"The Fire-bird Down Below","location":"The Ruby Sea","id":68688,"patch":4.4,"sort":321,"icon":100801,"unlocksFunction":1,"eventIcon":71341,"issuer":1019178,"target":1019178,"genre":22,"journal":["Bunchin holds in his hand yet another missive addressed to you.","Genbu of the Four Lords, the legendary auspices who serve as guardians of the Ruby Sea, has once more summoned you to their hidden sanctuary beneath Hells' Lid. Though he did not divulge his reasons, it seems likely that it relates to the impending escape of the imprisoned Koryu.","As expected, Genbu seeks your assistance in quelling the aramitama of one of his comrades, the auspice Suzaku. However, when Genbu likens you to Tenzen, Suzaku flies into a rage, insulted by the suggestion that any mortal could ever compare to the fallen hero. Indeed, it appears there is more to this story than meets the eye...","Suzaku yet mourns for Tenzen, whom it seems she loved with all her heart, and despite the looming threat of Koryu's release, she is unable to move beyond her tortured past. Byakko attempts to make his ailing comrade see reason, but alas, the aramitama has driven her to the brink of madness, so much so that at times she seems to mistake you for her beloved. For a mercy, she consents to a battle that you might subdue her primal rage, but should you and yours falter, she will not hesitate to consign you to the fiery depths.<br><br>※Hells' Kier can be accessed via the Duty Finder.","The transformative powers of Suzaku were undeniably wondrous to behold, deadly as they were. Nevertheless, they were not enough to bewilder you and your comrades and deter you from your purpose. The auspice is once more the keeper of her soul.","In the wake of your battle, Suzaku reflects on the man she so dearly loved─how they met and traveled the land with her fellow auspices, earning the trust and adoration of so many, only to watch helplessly as their leader fell to their greatest foe. In the cruelest of ironies, Suzaku eventually came to wield powers with which she could have saved Tenzen, and for long years she wondered what purpose fate had in mind for her, but no longer. Once more will she join forces with Genbu and Byakko to carry on her beloved's legacy and defend the realm from the forces that would destroy it.","Genbu and the others are relieved to see that Suzaku is herself once more. Would that the same could be said for Soroban, who for the present has been transformed into a massive tortoise, perhaps by having summoned a great kami into his own body. Though the Kojin is understandably distressed, Genbu is unconcerned, and Tataru is simply annoyed to see history repeating, after a fashion. In any event, your work is done, and Soroban will probably recover. Probably.","To his credit, Bunchin takes the news of Soroban's predicament in stride. If anything, he seems to be somewhat puzzled by the whole affair, unsure whether or not it is some sort of elaborate Eorzean joke. Humor is subjective, to say the least..."],"objectives":["Speak with Genbu in Reisen Temple.","Speak with Suzaku.","Confront Suzaku in Hells' Kier.","Speak with Genbu.","Speak with Bunchin in Tamamizu."],"dialogue":[{"name":"BUNCHIN","text":"How kind of you to pay us a visit, <span class=\"highlight\">Forename</span>. Now I need not summon you."},{"name":"BUNCHIN","text":"But a moment ago, a certain surly cat returned with another missive addressed to you. See for yourself..."},{"name":"BUNCHIN","text":"(-Genbu's Missive-)Brave adventurer who stood fast and quelled the raging aramitama of my comrade, Byakko. The time has come for you to return to Reisen Temple."},{"name":"BUNCHIN","text":"I presume the auspices of Hells' Lid have need of you once more? If so, give my regards to them and dear Soroban."},{"name":"GENBU","text":"Well met, <span class=\"highlight\">Forename</span>, well met! But wait─where is the little urchin girl of whom I have grown so fond?"},{"name":"GENBU","text":"It would be remiss of us to proceed without her, would it not? Why not summon her with that trinket of yours, your linkpearl?"},{"name":"TATARU","text":"(-Tataru-)Hello? <span class=\"highlight\">Forename</span>, is that you?"},{"name":"TATARU","text":"(-Tataru-)...Huh? Right now? Very well, if you insist..."},{"name":"GENBU","text":"What wondrous things, these linkpearls. Now then─let us wait until your friend arrives..."},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>, Genbu."},{"name":"GENBU","text":"Ah, good of you to join us, little urchin girl."},{"name":"TATARU","text":"...You know, there is such a thing as running a joke into the ground."},{"name":"GENBU","text":"It pleases me to inform you that thanks to your assistance with his training, Soroban's strength has grown by leaps and bounds. Ere long we may count him among our most formidable warriors."},{"name":"TATARU","text":"Out of curiosity, where is Soroban anyway?"},{"name":"GENBU","text":"Engrossed in a very special exercise, I'm afraid. Trust me when I say he would not want you to see him in his current state."},{"name":"TATARU","text":"Working up a sweat no doubt. Glad to hear it!"},{"name":"GENBU","text":"But I called you here not to discuss our Kojin friend."},{"name":"GENBU","text":"The wards have grown weaker, presaging Koryu's inevitable escape."},{"name":"GENBU","text":"Before he breaks free, the Four Lords must marshal their strength."},{"name":"GENBU","text":"And so, <span class=\"highlight\">Forename</span>, I must entreat you to quell the raging aramitama of a dear comrade once more."},{"name":"TATARU","text":"A fight, is it? That's where our Warrior of Light shines! Who's <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> opponent this time?"},{"name":"GENBU","text":"See for yourself. She should be joining us shortly..."},{"name":"SUZAKU","text":"(-???-)It has been too long, elder brother."},{"name":"GENBU","text":"Several hundred years, by my reckoning. Am I to assume you have kept your silent vigil all this time, Suzaku?"},{"name":"SUZAKU","text":"...Let us not speak of such things. You bade me come hither for another purpose."},{"name":"GENBU","text":"That I did. Koryu's wards grow weaker by the day, and the calamity he would visit upon us draws nigh. The Four Lords must join their strength together once more."},{"name":"SUZAKU","text":"And to that end, this warrior would unburden my tortured soul."},{"name":"GENBU","text":"Just so. <span class=\"alternative-container\"><span class=\"alternative\">Hers</span><span class=\"alternative\">His</span></span> is a power far surpassing that of mortal men. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is heir to the legacy of Tenzen."},{"name":"SUZAKU","text":"Brother! How dare you compare this <span class=\"emphasis\">creature</span> to that shining paragon of virtue, of kindness! You sully his memory..."},{"name":"SUZAKU","text":"And you! You dare think yourself his equal? His better!? Then I will put you to the proof. And when you fall, it will be a fate most deserved."},{"name":"SUZAKU","text":"Turn back if you would not have it be so. Or join me in misery."},{"name":"TATARU","text":"Compared to Byakko, she seems much more...angry..."},{"name":"GENBU","text":"The aramitama feeds upon her grief and fuels her rage. She yet mourns a love lost...but it is not my place to speak. Go to her, brave warrior, and learn the truth of her heart."},{"name":"BUNCHIN","text":"Do let me know how Soroban is doing. We cannot help but worry about him, even if we know he is in good hands."},{"name":"BYAKKO","text":"You are returned, then? Good. Genbu is looking for you."},{"name":"SUZAKU","text":"You crave battle, then. Even if it brings you your death."},{"name":"SUZAKU","text":"...Out of duty you pit yourself against enemies ever stronger. Without hesitation, without fear, you muster your courage, and...and..."},{"name":"SUZAKU","text":"No! You are not even a pale shadow of his glory! There was but one man fit to wear the mantle of hero, and he has long since passed from this world..."},{"name":"BYAKKO","text":"If so, then the Ruby Sea will be consumed by Koryu's fiery judgment, and we, her sworn protectors, will have failed in our duty. Is Tenzen's memory so sacred that you would doom this land out of spite?"},{"name":"SUZAKU","text":"Oh Byakko, do you not see? Before I called you brother, I was but a bird who loved a man. Perhaps that was all I was ever meant to be, for I can brook no replacement at my side or in my heart. Not so easily as you..."},{"name":"BYAKKO","text":"Have you forgotten his final moments? How he fought and died to defeat Koryu─how he sacrificed himself before our very eyes?"},{"name":"SUZAKU","text":"How dare you ask me that! Every detail is forever seared in my mind's eye─a blackened scar upon my soul! How could I possibly forget!?"},{"name":"BYAKKO","text":"Nor should you! Nor will I forget every day we spent together on the road. But to exalt the past over the present, to live life in mourning and never move on is to dishonor his memory!"},{"name":"SUZAKU","text":"How dare you speak to me of dishonor! You who have opened our home to this pretender! I see <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> plainly, how <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has wormed <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> way into your hearts, mimicking Tenzen's manner, cloaking <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> in his scent, seeking to supplant Tenzen in our minds!"},{"name":"BYAKKO","text":"Listen to yourself, my sister. The aramitama has driven you to see oni in shadows. Let it be quelled, before your soul is forever lost."},{"name":"SUZAKU","text":"Only to Tenzen will I entrust my soul! Only his love will I accept!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let me help you."},{"name":"A1","text":"You have nothing to fear from me."},{"name":"SUZAKU","text":"He said...he said... Oh, Tenzen...<br>Very well! But I will brook no delay!"},{"name":"SUZAKU","text":"I will await you in the depths─in my place of mourning. And when it is ended, I shall mourn you too..."},{"name":"BYAKKO","text":"Forgive her, <span class=\"highlight\">Forename</span>. She is yet consumed by her failure to save Tenzen all those years ago. Her regret is as a festering wound."},{"name":"BYAKKO","text":"The love she bore him gave her strength once. Alas, through it the aramitama has found purchase in her soul. It feeds on her grief and despair."},{"name":"BYAKKO","text":"'Tis plain that your presence troubles her as well. She senses your blessing, and it reminds her of him. There were moments when she looked on you with a fire in her eyes..."},{"name":"BYAKKO","text":"When she gives herself to the aramitama, she may surrender to her delusions as well. If so, do not be alarmed by what she says. Stand fast and free her from her torment."},{"name":"BYAKKO","text":"Be warned: she commands many powers, including the ability to manipulate geomantic currents. Only by remaining observant will you survive."},{"name":"GENBU","text":"Forgive her, my friend. She knows not what she says..."},{"name":"TATARU","text":"Be careful, <span class=\"highlight\">Forename</span>. I don't think she's going to go quietly..."},{"name":"BYAKKO","text":"Our dear sister, Suzaku, has returned. I pray she will hear reason this time."},{"name":"BYAKKO","text":"Remember: do not lose sight of your surroundings when you face Suzaku. If you would overcome the trials she sets before you, you must remain observant."},{"name":"SUZAKU","text":"...How long have I been blinded by this dream? This never-ending nightmare, unable to escape the memory of my beloved..."},{"name":"SUZAKU","text":"I owe you an apology, brave warrior, as well as my life. In spite of the crude and disrespectful way I treated you, you nevertheless risked your life to free my heart from the terrible delusion which threatened to consume my soul."},{"name":"SUZAKU","text":"For the first time in centuries, I can reflect on my time with the man I so deeply loved without being driven to tears..."},{"name":"SUZAKU","text":"I was born into this world long, long ago, blessed with crimson plumage that shone like blazing fire in the sun."},{"name":"SUZAKU","text":"My form was likened to that of the Firebird of legend, a being said to have the power to confer immortality upon mortal men."},{"name":"SUZAKU","text":"Thus was I pursued endlessly by those who yearned to conquer death. To them─to all mankind, I was no more than a means to an end..."},{"name":"SUZAKU","text":"But Tenzen...Tenzen, did not look upon me so. To him, I was so much more...and he would become everything to me..."},{"name":"SUZAKU","text":"Together we traveled, we Four Lords and the samurai. As comrades-in-arms we journeyed the realm. Feared at first by many for our nature..."},{"name":"SUZAKU","text":"But Tenzen, dear Tenzen, would not close his heart to the people's plight. Not once did he hesitate to proffer a helping hand, and one by one he won over those who once cursed and condemned us."},{"name":"SUZAKU","text":"Be there oni in the east to slay, or revenants in the west to exorcise, without hesitation would he bid us rise to the challenge, and leave grateful men and women to spread word of our deeds. Word which, one day, reached the ears of a king..."},{"name":"SUZAKU","text":"'Twas by the king's order that we battled the mad auspice Koryu. Despite the many deeds to our credit, we four had only lived some few centuries, and were no match for our foe."},{"name":"SUZAKU","text":"Against the might of Koryu's raging aramitama, my brothers and I were powerless. But Tenzen...brave Tenzen, he would not be denied. At the last he unleashed a powerful technique, knowing full well that it would leave him exposed..."},{"name":"SUZAKU","text":"I watched as the light left his eyes forever..."},{"name":"SUZAKU","text":"Had I been the Firebird of legend...had I been possessed of the power of immortality! Had I been able to rescue him from death's obsidian abyss..."},{"name":"SUZAKU","text":"And then, the cruelest irony of all. Centuries later, when I finally went through the change, immortality became mine to command. I can but wonder if my bottomless grief for my beloved made it so."},{"name":"SUZAKU","text":"The power for which I yearned so desperately that day is now mine. If not to save him, then perhaps..."},{"name":"SUZAKU","text":"...Then perhaps to save those for whom Tenzen died."},{"name":"SUZAKU","text":"For the memory of my beloved, for his legacy, I shall fight. Let us go and tell Genbu together. And <span class=\"highlight\">Forename</span>...thank you. "},{"name":"FURI","text":"Headed to the surface? Follow me!"},{"name":"SYSTEM","text":"Leave Reisen Temple?"},{"name":"FURI","text":"Need a guide back to the temple? 'Course you do! Follow me!"},{"name":"SYSTEM","text":"Enter Reisen Temple?"},{"name":"GENBU","text":"Oho, I see you are still in one piece. I gather all went well?"},{"name":"SUZAKU","text":"Rest assured, elder brother, that I am myself once more."},{"name":"TATARU","text":"You certainly seem different from before! As if a great weight has been lifted from your shoulders. Your face is the very picture of serenity, I'd say!"},{"name":"SUZAKU","text":"How very perceptive you are, little one. Indeed, I have at long last come to accept the passing of my beloved Tenzen..."},{"name":"BYAKKO","text":"At long last indeed! But perhaps such prolonged periods of distress are unavoidable when one lives for more than a thousand years. I myself am no stranger to melancholy."},{"name":"SUZAKU","text":"...No, my brother, that you most certainly are not."},{"name":"GENBU","text":"Oh, how forgetful of me! I have yet to see how Soroban's training is coming along. "},{"name":"GENBU","text":"Soroban? Soroban!"},{"name":"TATARU","text":"W-Wait, I know this joke! Ahem!"},{"name":"TATARU","text":"It's a Firebird!"},{"name":"TATARU","text":"No, it's an airship!"},{"name":"GENBU","text":"Ohoho! No, genre-savvy urchin, for it is, in fact..."},{"name":"GENBU","text":"Soroban!"},{"name":"TATARU","text":"I mean...I expected him in some capacity, but not like this..."},{"name":"SOROBAN","text":"No one told me that this training would lead to such a radical transformation! Look at me! I'm a giant tortoise! A tortoise!"},{"name":"TATARU","text":"...I was wrong. <span class=\"emphasis\">This</span> is the very definition of running a joke into the ground."},{"name":"GENBU","text":"There's no need for panic, Soroban. You probably just recited the words improperly and offered your body as a vessel for a great tortoise kami."},{"name":"SOROBAN","text":"That seems to me like a very, very good reason for panic! Unless...I will return to normal after a short while? Like with the tamate-bako of geomancy?"},{"name":"GENBU","text":"Ah, well...I cannot say with any significant degree of certainty, but you might regain your original form by the time <span class=\"highlight\">Forename</span> quells Seiryu's aramitama."},{"name":"SOROBAN","text":"Might? Might!? What is this “might”? “Might” is not an acceptable answer!"},{"name":"GENBU","text":"You must be exhausted from your battle with Suzaku, my friend. Perhaps it would be best if you returned to the land above and took a rest."},{"name":"TATARU","text":"He's right. I doubt we will be needed here for some time, and Soroban seems to be in no mood for company. Be sure to contact me if anything comes up!"},{"name":"SOROBAN","text":"I had been meaning to return home, even if only briefly, but given my current state, that seems unlikely. If you could go in my stead and tell the elder I am...hale and healthy, I would be most grateful."},{"name":"TATARU","text":"How did your battle with Suzaku go? Is she still being...difficult?"},{"name":"BYAKKO","text":"Is it true that in the West Lalafells are hunted for sport? 'Twas a strange tale related to me from a fellow auspice who overheard foreign adventurers in Yanxia..."},{"name":"SUZAKU","text":"Long did I question why I had been granted this power over life and death too late to save my beloved."},{"name":"SUZAKU","text":"Now I understand: to carry on Tenzen's legacy, to save those for whom he gave his everything. Thank you for helping me to realize this, <span class=\"highlight\">Forename</span>."},{"name":"BUNCHIN","text":"Ah, <span class=\"highlight\">Forename</span>. All is well with our friends beneath Hells' Lid? What of Soroban? How goes his training?"},{"name":"BUNCHIN","text":"He...failed to perform a ritual correctly and was transformed into a tortoise, you say? But you are aware that... Oh, I see. This must be some manner of Eorzean joke. How very amusing."},{"name":"BUNCHIN","text":"A pity we will not see him again for the foreseeable future, but I will trust it is for the best, as before. He should take as much time as required─he is a tortoise, after all! Hah hah...hah... Hmm. No, it still makes no sense to me..."},{"name":"GENBU","text":"You needn't worry about Soroban. He will be fine. Eventually. Probably."},{"name":"SOROBAN","text":"Have I truly become host to a great kami? What if it does not wish to leave?"},{"name":"SUZAKU","text":"Oh, my beloved, I pray you yet watch over me..."},{"name":"BYAKKO","text":"It took me centuries to come to terms with Tenzen's passing. That Suzaku had not came as no surprise. Like us, Seiryu cared for him deeply, and I cannot help but worry that he too may struggle to accept your part in this..."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Hum</span>!"}],"reward":{"gil":3537,"emote":"Hum","instance":20057},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68552]},"next":[68701]},"partials":[{"type":"npc","id":"1019178","obj":{"i":1019178,"n":"Bunchin","l":2409,"q":10}},{"type":"instance","id":"20057","obj":{"i":20057,"n":"Hells' Kier","c":61804,"t":"Trials","min_lvl":70,"max_lvl":70,"min_ilvl":355}},{"type":"quest","id":"68552","obj":{"i":68552,"n":"Tortoise in Time","g":22,"l":"The Ruby Sea","s":311,"f":1}},{"type":"quest","id":"68701","obj":{"i":68701,"n":"Surpassing the Samurai","g":22,"l":"The Ruby Sea","s":331,"f":1}}]}