{"quest":{"name":"Feel the Burn","location":"Kienkan","id":68680,"patch":4.4,"sort":28,"icon":112311,"eventIcon":71201,"issuer":1025597,"target":1026268,"genre":7,"journal":["Hien is mulling over the details of Alphinaud's linkpearl call.","Based on your information, Hien is of the opinion that Alphinaud indeed encountered some manner of trouble at the Burn. He suggests conducting a search of the wasteland upon flying mounts, and Yugiri bids you see to your preparations before joining them at the overlook near the House of the Fierce.","The party is assembled, as are the birds that will carry you. It is time to set out for the Burn in search of Alphinaud.<br><br>※The Burn can be accessed via the Duty Finder.","Scant moments after arriving at the Burn, you are caught in the midst of a fierce sandstorm which scatters your comrades in all directions. Upon landing, you fight your way through hordes of fearsome desert creatures, as well as machina, inside what appear to be Allagan ruins. At length, you emerge in an area of relative safety and are reunited with the others. It is then that you spy the remains of the airship which bore Alphinaud away in the distance. Evidence of a battle abounds, but your friend and his traveling companions are nowhere to be seen. At Y'shtola's prompting, the party proceeds to scour the area for clues.","Judging by the insignia upon a fallen soldier's uniform, Alphinaud's party came under attack from the Emperor's personal guard. While the implications of this discovery are unsettling, there is little more to be done at the crash site, and Yugiri suggests returning to the Doman Enclave to consider your next move.","The journey back to Doma proves blessedly uneventful, and Hien is visibly relieved."],"objectives":["Speak with Hien near the House of the Fierce.","Enter the Burn.","Speak with Hien in the Doman Enclave."],"dialogue":[{"name":"YSHTOLA","text":"My report can wait. Finding Alphinaud must take priority."},{"name":"ALISAIE","text":"If only he knew all the trouble he's caused... When we find Alphinaud, I'm going to give him such an earful."},{"name":"YUGIRI","text":"I should not have allowed Master Alphinaud to leave without an escort. But it avails us naught to dwell on the past. We must focus on what can be done now."},{"name":"KIENKANGATEKEEPER03028","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"HIEN","text":"The region known as the Burn occupies a special place in Garlean history. Every child in the Empire is familiar with the tale."},{"name":"HIEN","text":"In the distant past, it was a verdant land teeming with life, but successive summonings saw it bled dry of aether and reduced to a desert. It was upon beholding the devastation that primals had wrought that Emperor Solus was spurred to embark upon his crusade against their kind."},{"name":"YSHTOLA","text":"The Burn offers a glimpse of the future we seek to prevent. Know you of any reason why Alphinaud might have gone there?"},{"name":"HIEN","text":"Aye. Mischance. Though it lies on the route to Garlemald, it is no place to make a stop. My guess is they encountered some manner of trouble there."},{"name":"HIEN","text":"In any event, I am of the same mind as Alisaie─we have no choice but to take our search to the Burn. Given the considerable distances involved, 'tis best we went by bird."},{"name":"HIEN","text":"<span class=\"highlight\">Forename</span> and I have our yols. Yugiri, will you ready falcons for the others?"},{"name":"YUGIRI","text":"I shall gather our swiftest birds."},{"name":"YUGIRI","text":"Near the House of the Fierce, there is an overlook. Pray join us there once you have seen to your preparations."},{"name":"ALISAIE","text":"We're coming for you, Alphinaud..."},{"name":"YSHTOLA","text":"With such a steed to bear me to and fro, I could perform my fieldwork in a fraction of the time. Mayhap I shall try my hand at this “Bardam's Mettle.”"},{"name":"YUGIRI","text":"Having named him an emissary of Doma, Lord Hien considers himself personally responsible for Master Alphinaud's safety. Naught I could say would sway him from joining the search."},{"name":"HIEN","text":"If everyone is here and possessed of a bird, let us away."},{"name":"HIEN","text":"Remember, our destination is a barren wasteland. There is no civilization to speak of for a hundred malms in all directions. Take care you do not lose your way."},{"name":"HIEN","text":"Barren though it is, the Burn is said to be home to hardy beasts adapted to the unforgiving environment. And then there are the <span class=\"emphasis\">specters</span>, if certain tales are to be believed... I expect we shall soon find out for ourselves what truly dwells there."},{"name":"ALISAIE","text":"...Forgive me, I need a moment."},{"name":"YSHTOLA","text":"On present evidence, we have no reason to fear the worst. More than that I cannot say."},{"name":"YUGIRI","text":"We are no closer to establishing Master Alphinaud's whereabouts, and the suggestion of an imperial plot only compounds matters. We have much to consider."},{"name":"HIEN","text":"Well, that was a decidedly uneventful journey. I almost found myself hoping for a sandstorm."},{"name":"HIEN","text":"Joking aside, I'd say our birds are due a good brush down and a treat or two, wouldn't you?"}],"reward":{"gil":4265,"instance":63},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68679]},"next":[68681]},"partials":[{"type":"npc","id":"1025597","obj":{"i":1025597,"n":"Hien","l":2847,"q":7}},{"type":"npc","id":"1026268","obj":{"i":1026268,"n":"Hien","l":2813,"q":2}},{"type":"instance","id":"63","obj":{"i":63,"n":"The Burn","c":61801,"t":"Dungeons","min_lvl":70,"max_lvl":70,"min_ilvl":340}},{"type":"quest","id":"68679","obj":{"i":68679,"n":"Sisterly Act","g":7,"l":"The Rising Stones","s":27}},{"type":"quest","id":"68681","obj":{"i":68681,"n":"Shadows in the Empire","g":7,"l":"The Doman Enclave","s":29}}]}