{"quest":{"name":"Fish in a Barrel","location":"The Ruby Sea","id":68699,"patch":4.56,"sort":3,"icon":100838,"eventIcon":71221,"issuer":1026401,"target":1026422,"genre":64,"journal":["J'olhmyn seems uncertain of how to proceed.","After some deliberation, the group decides to leave searching for Alpa to the Kojin of the Blue, that you might track down the villain before he kidnaps another innocent to obtain the Philosopher's Fin. However, one more problem presents itself: given his lax standards for the Three Wonders, it is unclear whether Jaab will make a Namazu of Yuzuka Manor or one from Dhoro Iloh his next target. To cover more ground, you and Kabuto agree to split up with the two Miqo'te and speak with Seigetsu the Enlightened whilst they investigate the situation in Yanxia.","As expected, you find Seigetsu the Enlightened at Dhoro Iloh. It transpires that a performance based on the “Grey Kings of Orient” carol is planned for the Seven Hundred Seventy-Seven's next festival activity, and they have been spreading word of it far and wide. Most interestingly, the production includes the role of “philosopher-king” and─though there clearly was significant disagreement on the subject─said role has long since been assigned to Gyorei. Judging that the temptation of a Namazu called “philosopher-king” would be irresistible to Nhaza'a, you conclude that Gyorei will almost certainly be his next target. Unfortunately, she is currently away from Dhoro Iloh on an errand, so you can only hope to catch up to her before Nhaza'a does.","You search for Gyorei at the Dawn Throne, but are unable to reach her before Nhaza'a unceremoniously stuffs her in a barrel. Seeing your approach, he hastily kicks said barrel over the edge and into the waters below, jumping down and swiftly disappearing after it.","Unsure what to do now, you consult with J'olhmyn via linkpearl. She proposes that you attempt to rout Nhaza'a in Kugane, where the thief will almost certainly be heading to pass off his faux Three Wonders on an unsuspecting maiden or hopeful suitor. Though you are eager to make it back to the port city before Nhaza'a does, you agree to first report back to Seigetsu the Enlightened, lest he have any wisdom to offer.","Gyoshin relates the woeful tale of Gyorei's capture to Seigetsu the Enlightened, and is on the point of joining your rescue operation when his wiser compatriot points out that he, unprepared for battle as he is, would likely not be of much use. Thus you part from the two Namazu, Seigetsu the Enlightened vowing to design an “infallible” stratagem to defeat Nhaza'a Jaab before the pair meets you in Kugane."],"objectives":["Speak with Kabuto at Dhoro Iloh.","Search for Gyorei at the Dawn Throne.","Speak with Gyoshin."],"dialogue":[{"name":"JOLHMYN","text":"We can say with some certainty that Nhaza'a has made for either Yanxia or the Azim Steppe, where he can only be up to no good...but it's also likely that Alpa has been imprisoned somewhere between here and Kugane. So which should we seek?"},{"name":"KABUTO","text":"I would be happy to ask the other members of the Divine Circle to search for your friend. There are no finer seekers of treasure on the Ruby Sea, and it would free us to continue tailing the thief."},{"name":"JOLHMYN","text":"Hmm... While I would prefer to see to Alpa's safety myself, I can't deny that I'm at a distinct disadvantage in these lands. It probably would be better to leave the search to those more familiar with the area, while we pursue Nhaza'a."},{"name":"MZHETTIA","text":"He's after the─what was it, now─“Philosopher's Fin,” correct?"},{"name":"JOLHMYN","text":"If our assumptions are right, that's the only one left. And we know he's not too particular as to whether he lays hands on the real thing..."},{"name":"JOLHMYN","text":"<span class=\"highlight\">Forename</span>, do you have any idea what could pass for the Philosopher's Fin at a glance?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A fin from Seigetsu the Enlightened? He sure talks enough."},{"name":"A1","text":"A fin from Gyokei? He seems an easy-to-kidnap sort."},{"name":"KABUTO","text":"A Namazu who speaks, and articulately at that. Yes, he does sound like a prime candidate."},{"name":"KABUTO","text":"However, one could easily call all of the Namazu who have mastered the common tongue “finned philosophers.” We cannot count on our villain to be so selective─nor do we know if he makes for Dhoro Iloh, or rather Yuzuka Manor."},{"name":"KABUTO","text":"What you say is true, but one could easily call all of the Namazu who have mastered the common tongue “finned philosophers.” We cannot count on our villain to be so selective─nor do we know if he makes for Yuzuka Manor, or rather Dhoro Iloh."},{"name":"JOLHMYN","text":"Well, if potential finned philosophers can be found in either location, I suppose we'll have to split up and cover both."},{"name":"JOLHMYN","text":"I'll take Yuzuka Manor. M'zhet can come with me, if only so that I can keep him from accidentally injuring anyone...himself included. Anyway, I'm sure the locals will be able to point us in the right direction."},{"name":"KABUTO","text":"Then we will hasten for Dhoro Iloh. I only hope that we arrive in time."},{"name":"KABUTO","text":"I will chase Tsukumo's captor to the ends of Hydaelyn if I must."},{"name":"MZHETTIA","text":"Wait for us, Alpa!"},{"name":"KABUTO","text":"I had heard word of the festivities taking place here, but I wasn't aware they would be so...extraordinary."},{"name":"GYOSHIN","text":"By the Big One! Our comrade-in-fins! You are here to assist with our new project, yes, yes? Our latest, greatest event?"},{"name":"KOFUINSEIGETSU","text":"I interpret that as, “I haven't the foggiest idea of what you speak,” so allow me to explain─thoroughly! We are currently planning our most ambitious event to date: an exceedingly cultured performance based on the beloved carol of eld, “Grey Kings of Orient.”"},{"name":"KOFUINSEIGETSU","text":"We have spread word of our upcoming masterpiece far and wide, from Kugane to Yanxia, so doubtless a great many will be in attendance."},{"name":"KOFUINSEIGETSU","text":"By the by, sir, it is rare to see one such as yourself here on the Steppe. Am I correct in assuming that you are an ambassador of the Kojin tribe? And how might I address you?"},{"name":"KABUTO","text":"My name is Kabuto. I am indeed a Kojin of the Blue, and the leader of the Divine Circle."},{"name":"KABUTO","text":"We typically pursue treasure, but our quarry today is a villain whom we suspect is searching for the Philosopher's Fin. We have traveled here to stop him before anyone comes to harm."},{"name":"KOFUINSEIGETSU","text":"Oho, are you perchance speaking of the Philosopher's Fin as detailed in <span class=\"emphasis\">New Records of Ancient Matters</span>? One of the Three Wonders? Fascinating! But why seek it on the Azim Steppe? I am quite certain the records make no mention of location."},{"name":"KOFUINSEIGETSU","text":"Ah, so naturally, having spoken to <span class=\"highlight\">Forename</span>, you concluded that I would most readily be identified as the source of the requisite fin, esteemed as I am. Indeed, there could hardly be a more obvious choice for “finned philosopher.”"},{"name":"GYOSHIN","text":"Wait, wait... I seem to recall from our many, many discussions that the philosopher will <span class=\"emphasis\">not</span> be played by you, Gyofu─Seigetsu the Enlightened. We decided on Gyorei for that role, remember? And we already made the costume to fit her!"},{"name":"KABUTO","text":"The role of philosopher? Perhaps we should hear more of this new event of yours."},{"name":"KOFUINSEIGETSU","text":"Oh, very well. In our upcoming performance, we reenact the journey to the West made by three kings in days of yore. Gyorei has been chosen to dress as the philosopher-king."},{"name":"KOFUINSEIGETSU","text":"One would <span class=\"emphasis\">think</span> that the Namazu best suited for said role would be I, Seigetsu the Enlightened, most erudite and learned among us, renowned author of <span class=\"emphasis\">A Meditation on the Metaphysics of Merrymaking</span>, but Gyoshin continually insists..."},{"name":"KABUTO","text":"That's it! Nhaza'a must have heard about the performance, and learned that it would include a philosopher. That is why he made for the Azim Steppe."},{"name":"KABUTO","text":"If he also knows that she has been selected for the role of “philosopher-king,” Gyorei will be in grave danger. Where is she now?"},{"name":"KOFUINSEIGETSU","text":"If I recall correctly, she spoke of traveling to the Dawn Throne to retrieve ritual offerings from the Oronir's stock. We've been running low, as someone keeps partaking without authorization..."},{"name":"KABUTO","text":"Then we must make for the Dawn Throne at once! With me!"},{"name":"GYOSHIN","text":"I was not really following that, no, no. But I am most confident that Gyorei's fins should remain attached to Gyorei. She needs those!"},{"name":"KOFUINSEIGETSU","text":"It's all well and good for Gyoshin to sprint off to Big-One-knows-where, but it is hardly advisable for me to leave the festivities unsupervised. I will remain here, and inform Gyorei of the situation should she return."},{"name":"JOLHMYN","text":"So these are Namazu? Seeing them in person, I have to say that they're pretty cute. Unnerving, pungent, and weird...but cute."},{"name":"MZHETTIA","text":"These fellows' mannerisms are utterly charming! Yes, yes!"},{"name":"MZHETTIA","text":"Oh dear, they appear to be rubbing off on me. Do you ever have that problem, <span class=\"highlight\">Forename</span>? No, no?"},{"name":"GYOREI","text":"Goodness, how kind of the Oronir to share so much food with us! It will take more than a few Namazu to eat through all of this. Thankfully."},{"name":"GYOREI","text":"Oh, hello! Can I help you with something, yes, yes?"},{"name":"NHAZAAJAAB","text":"I'm supposed to believe <span class=\"emphasis\">that's</span> the face of a philosopher? But I suppose a fin's a fin. And the client won't know any better, so in you go!"},{"name":"GYOREI","text":"What is the meaning of this? Let me out!"},{"name":"GYOREI","text":"Oh, no, nooooooooo!"},{"name":"GYOSHIN","text":"Stop, stop!"},{"name":"GYOSHIN","text":"He really was after Gyorei's fins! And now he has both of them!"},{"name":"GYOSHIN","text":"I will protect Gyorei's appendages, yes, yes!"},{"name":"KABUTO","text":"We must find Gyorei before Nhaza'a does."},{"name":"GYOSHIN","text":"He put her in a barrel! The horror! The indignity! What do we do?"},{"name":"KABUTO","text":"We should speak with our comrades at Yuzuka Manor. They need to hear this, and may have an idea of where Nhaza'a would take his ill-gotten treasures. Can you contact them, <span class=\"highlight\">Forename</span>?"},{"name":"JOLHMYN","text":"(-J'olhmyn-)Nothing to report here. Have you had any luck?"},{"name":"JOLHMYN","text":"(-J'olhmyn-)...He's kidnapped a Namazu named Gyorei? That's not good─he's got all three of the Wonders in hand, then."},{"name":"JOLHMYN","text":"(-J'olhmyn-)But if we are to assume that his sudden quest for the Three Wonders and the young lady's wedding dowry are connected, there's a good chance that he will revisit Kugane at some point─whether to present the items to her, or to her would-be suitor."},{"name":"JOLHMYN","text":"(-J'olhmyn-)He would have to retrieve Alpa beforehand, of course, meaning that we finally have a chance to get ahead of him. We can return to Kugane first, and be ready to snare him when he arrives."},{"name":"JOLHMYN","text":"(-J'olhmyn-)Let's rendezvous in Kugane, at, say...ah, the Bokairo Inn! I'll see you there."},{"name":"KABUTO","text":"What did J'olhmyn suggest?"},{"name":"KABUTO","text":"Lay a trap in Kugane? It could work, but we will need to return posthaste."},{"name":"GYOSHIN","text":"We should tell Gyof─Seigetsu the Enlightened first. I am sure that he will have many, many thoughts on the situation. Maybe even a helpful one!"},{"name":"KABUTO","text":"Very well, we will speak with him before we depart. He is doubtless worried about Gyorei, and it would be unkind to leave him wondering."},{"name":"KABUTO","text":"Does his wickedness know no bounds?"},{"name":"KOFUINSEIGETSU","text":"（★未使用／削除予定★）"},{"name":"GYOSHIN","text":"I will find Seigetsu the Enlightened and be right back!"},{"name":"KOFUINSEIGETSU","text":"Gyoshin has apprised me of the ill news. And you intend to apprehend the culprit in Kugane?"},{"name":"KABUTO","text":"Yes, if we travel fast enough, we should succeed in reaching the city before Nhaza'a Jaab does."},{"name":"GYOSHIN","text":"I always have my travel hammer, travel awl, travel spinning wheel, and travel anvil packed just in case. I am most prepared. Ready to go, yes, yes! The sack will be a tight squeeze with both of us, but if you put Seigetsu in headfirst, and me tailfirst..."},{"name":"KOFUINSEIGETSU","text":"Stop right there, Gyoshin. Exactly what are an artisan and a member of the literati meant to do against an opponent who has foiled even <span class=\"highlight\">Forename</span>? For us to blunder in without a stratagem would be the height of folly."},{"name":"KOFUINSEIGETSU","text":"No, these two ought to journey ahead to Kugane, lest Nhaza'a arrive sooner than expected. Meanwhile, I shall devise an infallible plan based on the principles laid forth in <span class=\"emphasis\">The Smart of War</span>. We shall join them anon."},{"name":"GYOSHIN","text":"I do not know what those principles are. Not even a little bit, no, no. But I will do as you say if you think that it will help get Gyorei back..."},{"name":"KABUTO","text":"What could he be plotting?"},{"name":"KABUTO","text":"Let us inform Seigetsu the Enlightened and be on our way."},{"name":"KOFUINSEIGETSU","text":"（★未使用／削除予定★）"}],"reward":{"gil":1183},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68698]},"next":[68700]},"partials":[{"type":"npc","id":"1026401","obj":{"i":1026401,"n":"J'olhmyn","l":2409,"q":2}},{"type":"npc","id":"1026422","obj":{"i":1026422,"n":"Gyoshin","l":2411,"q":1}},{"type":"quest","id":"68698","obj":{"i":68698,"n":"Ruby Seas under Ruby Skies","g":64,"l":"Kugane","s":2}},{"type":"quest","id":"68700","obj":{"i":68700,"n":"What a Wonder-full World","g":64,"l":"The Azim Steppe","s":4}}]}