{"quest":{"name":"To Kweh under Distant Skies","location":"The Fringes","id":68693,"patch":4.4,"sort":23,"icon":100800,"unlocksFunction":1,"eventIcon":71341,"issuer":1021939,"target":1023687,"genre":19,"journal":["Biggs has a look of profound relief.","Biggs expresses his profound relief, then quickly describes how he and Wedge came to be in the rift on the back of the great Hraesvelgr. After suggesting a return to Rhalgr's Reach to inform Jessie of your triumph, Biggs departs with Cid and Wedge. A pensive Alpha, however, remains behind...","You interrupt Alpha's quiet contemplation of the now-empty Yawn, and his subsequent “kweh” indicates a readiness to return to Jessie and Rhalgr's Reach.","At Biggs's prompting, you recount the final confrontation with Omega to Jessie, and she commends you for your heroic accomplishment. In the aftermath, however, there are yet tasks to be done, and Jessie sets her colleagues─and chief─to work writing reports. You have, for the moment, been left to your own devices, and Alpha expresses an interest in the bustling town outside the Ironworks offices.","You have decided to accompany Alpha on a tour of Rhalgr's Reach. The chocobo awaits you by the waters of Starfall.","Alpha watches the activities of the inhabitants with wide-eyed interest. The next stop appears to be the Barber, the settlement's infirmary.","You join Alpha at the infirmary, and witness Cid's distress at Nero's unannounced and expensive departure. The outburst encourages Alpha to move along to the nearby Recompense.","Somehow sensing the sober purpose of the burial chamber, Alpha seems overwhelmed with melancholy. Perhaps a gentle /pet will perk him up...","Alpha responds to your touch with a joyful “kweh!” His circuit of the town now leads you back to the waters of Starfall.","Biggs and Wedge come across you at the exit to Rhalgr's Reach. Wedge helps to interpret Alpha's wistful gaze and chirping kwehs as a desire to leave on a journey of discovery. He promises to put the matter to Cid, and they later return with Jessie and the chief in tow. Cid gives his blessing to Alpha, and you join everyone in bidding the chocobo fair travels.<br><br>Omega is defeated, reports have been written, and Alpha has left on his adventure. With the most pressing matters seemingly settled, now might be a good time to prod Jessie about your reward...","After lamenting the expenditure of funds during the troubles with Omega, Jessie is nevertheless proud to present you with a clockwork version of Alpha. She hopes that the chocobo's likeness will bring to mind your feathered companion as he travels under some distant sky, experiencing all the wonders the world has to offer."],"objectives":["Speak with Alpha.","Speak with Jessie in Rhalgr's Reach.","Speak with Alpha.","/pet Alpha.","Speak with Alpha.","Speak with Jessie."],"dialogue":[{"name":"CID","text":"It's finally over..."},{"name":"WEDGE","text":"Did you see the Yawn!? It's just a big hole again!"},{"name":"ALPHA","text":"Kwe-kweh..."},{"name":"BIGGS","text":"Phew...<br>I'm so glad we got you out of there. I don't know what we would've done if Hraesvelgr hadn't come along."},{"name":"BIGGS","text":"The situation being what it was, Wedge and I came out to the Yawn to see if we could lend you a hand─chirurgeon's orders be damned. That's when we saw the aether bubbling like hot water in a pot..."},{"name":"BIGGS","text":"Just as we were debating whether or not we should jump in, that big surly dragon flew down to explain the anomaly. Then he offered us a ride."},{"name":"BIGGS","text":"...And the rest you already know."},{"name":"BIGGS","text":"Jessie will be relieved to hear that Omega is gone and you lot are safe. I say we head straight back to Rhalgr's Reach, and let everyone know the good news!"},{"name":"SYSTEM","text":"Alpha is staring quietly into the now-empty Yawn."},{"name":"ALPHA","text":"...Kweh!"},{"name":"CID","text":"Poor Jessie. Her nerves must be worn thin after all that..."},{"name":"BIGGS","text":"Go on. You should be the one to tell her!"},{"name":"WEDGE","text":"They say it's just a myth, but surely you've earned one this time, <span class=\"highlight\">Forename</span>... You know! A big, fat company bonus!"},{"name":"ALPHA","text":"Kweh, kweh!"},{"name":"JESSIE","text":"Welcome back, <span class=\"highlight\">Forename</span>!"},{"name":"JESSIE","text":"You truly are a force to be reckoned with. If ever there's another Omega, I'd wager it'll skip the experiments and go straight to generating a simulacrum of you."},{"name":"JESSIE","text":"...Not that I'd want that to happen! And besides, I don't think anyone can truly mimic your unique strengths. You're our one-of-a-kind hero!"},{"name":"WEDGE","text":"So...does this mean we don't need to worry about Omega's monsters invading our world anymore?"},{"name":"CID","text":"Aye, all of its creations vanished along with the rift itself. With Omega defeated, we averted that particular catastrophe before it began."},{"name":"CID","text":"<span class=\"highlight\">Forename</span> struck the killing blow, of course, but we never would have made it to that point without everyone's hard work and support."},{"name":"CID","text":"Once again, I am sincerely grateful to be surrounded by such wonderful colleagues."},{"name":"JESSIE","text":"Ahem. Not to spoil the moment, Chief, but the Alliance leaders are anxious to learn of Omega's fate."},{"name":"JESSIE","text":"When every head of state is clamoring for a report, we can't very well ignore them. How much do you mean to tell them?"},{"name":"CID","text":"How much indeed..."},{"name":"CID","text":"...All of it. When it comes to a threat of Omega's magnitude, we have a duty to reassure our allies that the world is not coming to an end. And the best way to do that is to report every last detail."},{"name":"JESSIE","text":"I'm surprised at you, Chief. I was almost certain you'd want to muddy the waters to “prevent knowledge of this technology falling into the wrong hands” or something similar."},{"name":"CID","text":"Hah, I doubt anyone outside our particular circle would even believe the tale. Experiments taking place in a rift between dimensions? Facing off against villains recreated from history and legend? Battling godlike beings from other worlds?"},{"name":"CID","text":"And even assuming some ambitious fellow schemed to build an Omega of his own..."},{"name":"CID","text":"The technology required is as far beyond our reach as that terrible weapon's home star. A distant dream."},{"name":"JESSIE","text":"...Right, you heard the chief! We missed our chance on the front lines, but there's plenty of work left to be done!"},{"name":"JESSIE","text":"Round up everyone who's standing idle, and get moving on those reports! And don't forget to contact our people still out in the field!"},{"name":"CID","text":"Thank you, Jessie, I'll leave things in your capable─"},{"name":"JESSIE","text":"Not so fast, Master Garlond. You count as part of the support team, as well. <span class=\"highlight\">Forename</span> did all the fighting, and Alpha did all that running, but surely you have energy to spare."},{"name":"JESSIE","text":"Who exactly did you expect to sign off on those official reports? And even without that little chore, you have a pile of other company tasks that's grown arse-high to an aurochs while you've been tending to this whole Omega business."},{"name":"JESSIE","text":"Most importantly...isn't there someone else you should be sharing this victory with?"},{"name":"CID","text":"...Aye. I should probably head over to the infirmary right away."},{"name":"CID","text":"Meanwhile, you should take a well-earned rest. I don't think there's a way to properly reward you for all you've accomplished, but I'll see what we can do. "},{"name":"BIGGS","text":"I'm just glad to have everyone back in one piece! Take care of yourself, <span class=\"highlight\">Forename</span>!"},{"name":"WEDGE","text":"What are your plans now, Alpha?"},{"name":"WEDGE","text":"With Omega gone, you're your own chocobo now. You can do whatever you want! Anything at all!"},{"name":"WEDGE","text":"...You want to go outside? Did you have some place in mind?"},{"name":"BIGGS","text":"Come on, Wedge! Get those Lalafell legs moving, or I'll leave without you!"},{"name":"WEDGE","text":"O-On my way!!!"},{"name":"JESSIE","text":"I've got a lot of loose ends to tie up here, <span class=\"highlight\">Forename</span>. Don't worry, we haven't forgotten your reward. The chief and I have something in mind..."},{"name":"ALPHA","text":"...Kweh!"},{"name":"SYSTEM","text":"Alpha seems eager to see what Rhalgr's Reach has to offer..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Shall we go for a walk?"},{"name":"A1","text":"Sorry, can we do this later?"},{"name":"ALPHA","text":"Kwe-kweh!"},{"name":"ALPHA","text":"Kweh..."},{"name":"SYSTEM","text":"Alpha appears to be watching the inhabitants of Rhalgr's Reach with great interest."},{"name":"ALPHA","text":"Kweh!"},{"name":"ALPHA","text":"Kweh, kweh?"},{"name":"CID","text":"Nero's not here!?"},{"name":"GARLONDEMPLOYEE03157","text":"N-No, Chief, he, uh... He said he needed time away for recuperation...and then he left."},{"name":"CID","text":"Recuperation? His wounds must be troubling him more than he let on..."},{"name":"GARLONDEMPLOYEE03157","text":"He... &lt;gulp&gt;<br>He asked me to give you this."},{"name":"CID","text":"What's this? A receipt for payment?"},{"name":"GARLONDEMPLOYEE03157","text":"Ahem. It covers the cost for the following items: additional machine parts and implements; supplemental reference publications; expenses incurred in upgrading magitek armor and gunhammer; funds spent on idle research during enforced convalescence..."},{"name":"GARLONDEMPLOYEE03157","text":"...Oh, and it also includes a large sum listed as “gratuity for exceptional services rendered.” The entire amount was charged in your name, Master Garlond."},{"name":"CID","text":"......"},{"name":"CID","text":"Find him! I want everyone searching for Nero right now! EVERYONE!!!"},{"name":"ALPHA","text":"Kweh...?<br>Kwe-kweeeh..."},{"name":"SYSTEM","text":"Alpha appears to sense the solemn purpose of this place. A gentle <span class=\"highlight\">pet</span> might rouse him from his sudden melancholy..."},{"name":"ALPHA","text":"Kweeeh..."},{"name":"SYSTEM","text":"Alpha appears to sense the solemn purpose of this place. A gentle <span class=\"highlight\">pet</span> might rouse him from his sudden melancholy..."},{"name":"ALPHA","text":"Kweh...?"},{"name":"ALPHA","text":"Kweh...kweh!"},{"name":"WEDGE","text":"Oh, hello. What are you two up to?"},{"name":"BIGGS","text":"Taking in the sights, were you? And by the looks of things, you're eager to venture a little further afield."},{"name":"BIGGS","text":"Well, if <span class=\"highlight\">Forename</span> has no problem with it, then neither do I. Just don't go too far, all right?"},{"name":"BIGGS","text":"Not good enough? I'm sorry, Alpha, but we're all a bit too busy to show you around the Fringes right now."},{"name":"BIGGS","text":"And I'm not too sure about sending you out there alone..."},{"name":"WEDGE","text":"When you think about it, this world is completely new to Alpha. And all he's done so far is travel back and forth between the Reach and the Yawn."},{"name":"WEDGE","text":"I bet his head is filled with questions and curiosity. He doesn't want to be taken for a walk─he wants to go on an adventure."},{"name":"WEDGE","text":"Alpha's not some helpless chick, Biggs! He's stronger than you or me, and I wish I was half as brave!"},{"name":"WEDGE","text":"He should be allowed to..."},{"name":"WEDGE","text":"...Listen, I'm going to talk to the chief about this. You're an employee, so there are certain rules we have to follow!"},{"name":"BIGGS","text":"I'm not saying I'm against the idea...and I'm willing to admit that Wedge has a point."},{"name":"BIGGS","text":"But as I said, we've all got important jobs to take care of─the chief included. Can you wait a little longer?"},{"name":"WEDGE","text":"<span class=\"highlight\">Forename</span>, would you mind keeping Alpha company until we get back? I promise we'll be quick!"},{"name":"CID","text":"Sorry to keep you waiting! My desk was covered in paperwork, but I've managed to clear away the most pressing matters."},{"name":"CID","text":"Now then, Alpha. I hear your heart's set on a journey of some kind?"},{"name":"CID","text":"I just want to be sure, but...you aren't leaving because you think you tricked us into the rift, or because you're Omega's creation or anything like that, are you?"},{"name":"CID","text":"I would have stopped you if that was the case. Pure curiosity, on the other hand, is something I like to encourage."},{"name":"CID","text":"Exploring, interacting with the world...I think the experience will be good for him."},{"name":"CID","text":"Despite Omega's power, its potential to learn was hobbled by hostile directives. Alpha, on the other hand, is free to grow as he pleases."},{"name":"CID","text":"Very well, Alpha. As the chief engineer of Garlond Ironworks, I hereby grant you unlimited leave to pursue “personal research.”"},{"name":"CID","text":"Travel far and wide, and take in everything these lands have to offer. But do come back when you're ready─I'd hate to lose such a valuable employee."},{"name":"WEDGE","text":"Alphaaa!!!<br>I'll miss you so much!"},{"name":"WEDGE","text":"You be careful out there. If anyone seems suspicious or shady, you stay away from them! Even if they offer you treats!"},{"name":"WEDGE","text":"And...&lt;sniff&gt;...and...<br>Make sure you greet folks with a cheerful kweh! They might not understand you, but at least they'll know you mean no harm!"},{"name":"WEDGE","text":"I'm sure you'll make new friends in no time. You just be yourself, you hear me?"},{"name":"JESSIE","text":"Eeek! What in the hells!?"},{"name":"BIGGS","text":"Ah, we forgot to shut it down. This's a model Omega that Wedge and I were working on."},{"name":"BIGGS","text":"We built it while we were resting, thinking it might be useful for figuring out strategies or something. Not much use now, I suppose."},{"name":"BIGGS","text":"...What? You want to keep it?"},{"name":"BIGGS","text":"It's just a toy that'll follow you around. If you're happy with that, then it's all yours."},{"name":"CID","text":"Fair journey to you, Alpha! Take care!"},{"name":"ALPHA","text":"Thank you, <span class=\"highlight\">Forename</span>.<br>I'm off to see the world!"},{"name":"CID","text":"Something amiss?"},{"name":"CID","text":"That's strange. The Echo never allowed you to understand him before."},{"name":"CID","text":"This is just a theory mind you, but...<br>Assuming the absence of a soul is what prevented you from “hearing” Alpha's voice in the first place, then does it not follow that the reason you hear it now is─"},{"name":"CID","text":"Aye, a little miracle. And it explains his sudden urge to travel!"},{"name":"CID","text":"For a newborn soul, this world is brimming with unseen wonders!"},{"name":"NERO","text":"And so, your journey begins. I almost envy you, Alpha─so many new things for you to discover."},{"name":"NERO","text":"Speaking of which...<br>What terrible marvels can I trouble my old friend with next?"},{"name":"JESSIE","text":"I hope Alpha enjoys his adventures. There's so much danger out there for one little chocobo..."},{"name":"JESSIE","text":"No, I'm sure he'll be fine! And dwelling on such things is not productive in the least."},{"name":"JESSIE","text":"Why don't we discuss a happier subject─like your long-awaited bonus! We drained the coffers to fund your expedition, but why settle for coin when you can have the latest in automaton technology!"},{"name":"JESSIE","text":"That's right! We're gifting you a premium mammet─the one-of-a-kind master model for merchandise copies, constructed with our patented Ironworks quality!"},{"name":"JESSIE","text":"I present to you...the clockwork Alpha!"},{"name":"JESSIE","text":"Whenever you bring it out on your travels, may it remind you of the real Alpha, kweh-ing along under some distant sky. Just the thought of it brings a smile to my face! That, and the free advertising!"}],"reward":{"gil":3000,"items":[{"id":23990},{"id":24311},{"id":24310}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68692]},"next":[70122]},"partials":[{"type":"npc","id":"1021939","obj":{"i":1021939,"n":"Biggs","l":2406,"q":2}},{"type":"npc","id":"1023687","obj":{"i":1023687,"n":"Jessie","l":2403,"q":5}},{"type":"item","id":"23990","obj":{"i":23990,"n":"Wind-up Alpha","l":1,"c":59704,"t":81}},{"type":"item","id":"24311","obj":{"i":24311,"n":"Ending Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"24310","obj":{"i":24310,"n":"A Dream in Flight Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"68692","obj":{"i":68692,"n":"In the End, There Is Omega","g":19,"l":"The Interdimensional Rift","s":22,"f":1}},{"type":"quest","id":"70122","obj":{"i":70122,"n":"A Heartless Hypothesis","g":20,"l":"Old Sharlayan","s":30}}]}