{"quest":{"name":"In the Dark of Night","location":"Ul'dah","id":68695,"patch":4.56,"sort":131,"icon":100832,"eventIcon":71221,"issuer":1026849,"target":1026870,"genre":207,"journal":["Kipih Jakkya is eager to set out with you and Noctis.<br>※This quest is available for a limited time only.","Kipih informs you that there have been new sightings of mechanical soldiers in the Twelveswood. In order to ascertain the truth of these rumors, it is decided that you will head to Gridania to seek out eyewitnesses.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Upon arriving in Gridania, you proceed to make inquiries about the mechanical soldiers. While no one you speak with turns out to be an eyewitness, you are reasonably satisfied that the magitek troopers are indeed here in the Twelveswood. It is time to take your findings to Kipih, who awaits at Mih Khetto's Amphitheatre.","Based on your findings, Kipih believes that you should be able to find the magitek troopers if you were to keep watch at the Bramble Patch, in the East Shroud. Eager as ever, Noctis sets out immediately, and at Kipih's behest you hurry after him.","At the Bramble Patch, you are reunited with Noctis and begin lying in wait. As the night deepens, a bloodcurdling roar cuts through the silent gloom, and you hasten towards the sound to come face-to-face with a fell fiend. Though the creature is fearsome, working together with Noctis, you succeed in laying it low.","Noctis is perturbed that a daemon, a monster from his world, has also found its way to Eorzea. Taking your rest after the taxing battle, you trade tales over a simple camp meal and learn a little more about Noctis─and perhaps yourself as well.","Back in Gridania, Noctis is crestfallen at being unable to find a way home, but Kipih promises that she will keep working to uncover more leads. Not given to waiting around, Noctis goes off to explore Gridania, and Kipih bids you accompany him.","You find Noctis browsing the Black Rabbit Traders' stall; it appears he is quite taken by the fashion of Eorzea. Your visitor is keen to explore some more, and you are happy to oblige him."],"objectives":["Speak with Hadrefort in Gridania.","Speak with Mitainie in Gridania.","Speak with Roustebant in Gridania.","Report to Kipih Jakkya.","Wait at the designated location in the East Shroud.","Speak with Noctis.","Speak with Kipih Jakkya in Gridania.","Speak with Noctis.","Defeat Iseultalon!"],"dialogue":[{"name":"NOCTIS","text":"Whew... That wasn't an interview─it was an <span class=\"emphasis\">interrogation</span>."},{"name":"KIPIHJAKKYA","text":"Ready to depart? Excellent! Our destination is the Twelveswood─more of those mechanical soldiers have been sighted there."},{"name":"KIPIHJAKKYA","text":"To be sure, my colleague only heard the rumors. I suggest first heading to Gridania and seeking out the witnesses."},{"name":"NOCTIS","text":"Sounds good. Let's get going."},{"name":"KIPIHJAKKYA","text":"Ah, wait! New as you are to Eorzea, you may struggle to find your way around. Permit me to show you to Gridania."},{"name":"NOCTIS","text":"Alrighty. Lead the way."},{"name":"KIPIHJAKKYA","text":"Hopefully this outing will yield some answers..."},{"name":"NOCTIS","text":"Wh-What? I'm not slackin' off or anything. Just checking out the clothing. Some really neat stuff here."},{"name":"HADREFORT","text":"Mechanical soldiers? My apologies, but I'm not familiar with the rumors."},{"name":"MARCQUELORT","text":"Well, I am. Fellow I know claims he came upon them near the Hawthorne Hut in the East Shroud. At first he thought they were men, but on closer inspection, he says they were more like dolls."},{"name":"HADREFORT","text":"And you didn't think to share this little tidbit with me, Brother? If I were to fall victim to these abominations, I shall consider my death on your head."},{"name":"ROUSTEBANT","text":"Heard about the mechanical soldiers, have you? Indeed, they have been sighted in the East Shroud."},{"name":"ROUSTEBANT","text":"While I do not personally know the details, the Wood Wailers are in a state of heightened vigilance throughout the Twelveswood."},{"name":"MITAINIE","text":"Mechanical soldiers? As a matter of fact, one of our sentries at Amarissaix's Spire reported encountering them while patrolling the Bramble Patch."},{"name":"MITAINIE","text":"At first he took them to be scarecrows, but as he approached them, they suddenly sprang to life and set upon him. We suspect that they are some heretofore unknown imperial weapon, and we are deliberating a response even as we speak."},{"name":"MITAINIE","text":"If your path takes you near that area, you would do well to exercise all caution."},{"name":"HADREFORT","text":"I pray I do not run afoul of these mechanical monstrosities alone in the forest. The mere thought chills me to the spine..."},{"name":"MARCQUELORT","text":"As I said, the fellow I know claims he came upon the mechanical soldiers near the Hawthorne Hut in the East Shroud. At first he thought they were men, but on closer inspection, he says they were more like dolls."},{"name":"ROUSTEBANT","text":"The mechanical soldiers were sighted in the East Shroud. While I do not personally know the details, the Wood Wailers are in a state of heightened vigilance throughout the Twelveswood."},{"name":"MITAINIE","text":"One of our sentries at Amarissaix's Spire reported encountering the mechanical soldiers. We suspect that they are some heretofore unknown imperial weapon, and we are deliberating a response even as we speak."},{"name":"NOCTIS","text":"Cat-people... Cat-people everywhere... Y'jhimei wasn't kidding."},{"name":"KIPIHJAKKYA","text":"So, were you able to learn anything about the mechanical soldiers?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A man saw them near the Hawthorne Hut."},{"name":"A1","text":"A Wood Wailer encountered them at the Bramble Patch."},{"name":"KIPIHJAKKYA","text":"I see! In that case, if we were to keep watch at the Bramble Patch, we should be able to find them eventually."},{"name":"NOCTIS","text":"Well then, what're we waiting for?"},{"name":"KIPIHJAKKYA","text":"Wait just a─"},{"name":"KIPIHJAKKYA","text":"Please hurry after Noctis! The Twelveswood can be a veritable maze even for the locals, and it wouldn't do if he were to lose his way!"},{"name":"KIPIHJAKKYA","text":"Please hurry after Noctis! The Twelveswood can be a veritable maze even for the locals, and it wouldn't do if he were to lose his way!"},{"name":"NOCTIS","text":"It's good that we took care of the daemon, but there weren't any clues this time either. &lt;sigh&gt;"},{"name":"NOCTIS","text":"This the area, is it?"},{"name":"NOCTIS","text":"No luck so far. Guess we play the waiting game."},{"name":"NOCTIS","text":"You hear that!? C'mon, let's check it out!"},{"name":"NOCTIS","text":"What the─!? That's a daemon!"},{"name":"NOCTIS","text":"That thing's dangerous. We can't leave it running around."},{"name":"NOCTIS","text":"Heh, you're up for it too, eh? Come on then, let's do it!"},{"name":"NOCTIS","text":"First magitek troopers, now a daemon... What the hell's going on?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Let's take a rest for now."},{"name":"A2","text":"All that fighting made me hungry..."},{"name":"NOCTIS","text":"Yeah, after a fight like that, I could certainly use a break."},{"name":"NOCTIS","text":"Now that you mention it, I'm pretty hungry too."},{"name":"NOCTIS","text":"Right, let's set up camp!"},{"name":"NOCTIS","text":"So, what's your story? Why do you go around doing what you do?"},{"name":"Q3","text":"What's your purpose?"},{"name":"A3","text":"Protecting those dear to me."},{"name":"A3","text":"Supporting those dear to me."},{"name":"A3","text":"Just being with my friends."},{"name":"NOCTIS","text":"Protecting, huh? You and Gladio would get along, I bet. The big guy's always ready to throw himself into harm's way for us."},{"name":"NOCTIS","text":"Supporting, huh? Come to think of it, you do give off Ignis vibes. Specs is always hovering around, ready to pick up after us."},{"name":"NOCTIS","text":"What, you just wanna hang out with your friends? Heh, you're Prompto all over again. He's the life of the party, always ready with a quip to make us smile."},{"name":"NOCTIS","text":"We were traveling together─me and him and a couple of others. Hearing your story, I couldn't help but be reminded of them..."},{"name":"NOCTIS","text":"...<span class=\"emphasis\">My</span> purpose? That's a tough one. I guess you could say...it's keeping a promise."},{"name":"NOCTIS","text":"But I can't do that while I'm here. I have to get back to my own world."},{"name":"NOCTIS","text":"Somehow..."},{"name":"KIPIHJAKKYA","text":"So, how did you fare? Were you able to find your answers?"},{"name":"NOCTIS","text":"Nope. We found only more questions."},{"name":"NOCTIS","text":"Like how the hell a daemon ended up here as well."},{"name":"KIPIHJAKKYA","text":"A daemon?"},{"name":"NOCTIS","text":"It's...a kind of monster."},{"name":"KIPIHJAKKYA","text":"From your world, I assume. And it somehow came to be here, in Eorzea..."},{"name":"KIPIHJAKKYA","text":"I'm no naturalist, but I imagine it being similar to a voidsent."},{"name":"KIPIHJAKKYA","text":"And if even a monster such as that could find its way to our world, then surely─surely you can find your way back too!"},{"name":"NOCTIS","text":"Yeah, I hope so..."},{"name":"KIPIHJAKKYA","text":"I'll keep working with my colleagues to find new leads. So just sit tight for now."},{"name":"NOCTIS","text":"Actually, I'd rather go for a walk, check out the area a little. That's cool, yeah?"},{"name":"KIPIHJAKKYA","text":"Well, it should be safe enough if you keep close to the city..."},{"name":"NOCTIS","text":"Great. See ya later."},{"name":"KIPIHJAKKYA","text":"Ah! Wait just a─"},{"name":"KIPIHJAKKYA","text":"&lt;sigh&gt; There he goes again..."},{"name":"KIPIHJAKKYA","text":"Though I do not think that Noctis would disappear on us, I would feel much better knowing you were with him. Will you go and keep him company?"},{"name":"KIPIHJAKKYA","text":"I promise to have new information to share before long, so see that you both return soon, all right?"},{"name":"KIPIHJAKKYA","text":"I promise to have new information to share before long. See that you both return soon, all right?"},{"name":"NOCTIS","text":"Oh, hey. What's up?"},{"name":"NOCTIS","text":"Well, you can tell Kipih she doesn't need to worry. I can take care of myself, and I'm not about to run off somewhere."},{"name":"NOCTIS","text":"I was just checking out the clothing at this stall here. And as I was browsing, the shopkeeper offered me some stuff for free."},{"name":"MAISENTA","text":"Your friend has a fine physique and exceptional fashion sense. Having an attractive young man such as him model our garments is the best form of advertisement."},{"name":"NOCTIS","text":"Thanks, lady."},{"name":"NOCTIS","text":"Anyway, I wanna explore some more. You're cool to hang out for a bit, yeah?"},{"name":"NOCTIS","text":"Careful! That's not your average monster!"},{"name":"NOCTIS","text":"I don't like the looks of that pillar!"},{"name":"NOCTIS","text":"Whoa, so that's how it works! I owe you one!"},{"name":"NOCTIS","text":"Ugh, that thing's trouble! We gotta do something about it!"},{"name":"NOCTIS","text":"Two pillars this time! I'll take one, you take the other!"},{"name":"NOCTIS","text":"Nothin' to it!"},{"name":"NOCTIS","text":"You gotta be kidding me..."}],"reward":{"gil":1670,"items":[{"id":24610}]},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[68694]},"next":[68696]},"partials":[{"type":"npc","id":"1026849","obj":{"i":1026849,"n":"Kipih Jakkya","l":40,"q":2}},{"type":"npc","id":"1026870","obj":{"i":1026870,"n":"Noctis","l":52,"q":2}},{"type":"item","id":"24610","obj":{"i":24610,"n":"Lucian Prince's Bottoms","l":1,"c":45772,"t":36,"p":156}},{"type":"quest","id":"68694","obj":{"i":68694,"n":"The Man in Black","g":207,"l":"Ul'dah","s":130}},{"type":"quest","id":"68696","obj":{"i":68696,"n":"Messenger of the Winds","g":207,"l":"Gridania","s":132}}]}