{"quest":{"name":"In the Beginning, There Was Chaos","location":"Rhalgr's Reach","id":68690,"patch":4.4,"sort":20,"icon":100799,"unlocksFunction":1,"eventIcon":71341,"issuer":1023687,"target":1026453,"genre":19,"journal":["Jessie greets you with a mix of enthusiasm and concern.","Jessie welcomes you with the report of a new anomaly at the Yawn, and news of Cid's recent activities. The chief engineer himself arrives some time after, and, despite the dwindling size of your team, you agree to travel to the Yawn and begin another expedition into Omega's realm.","You leap into the Yawn once more, and enter the rift alongside Cid and Alpha.","Omega floats down to greet your arrival, confirming Cid's assumption that the experiments have indeed reached the final stage. The machine seems puzzled at the engineer's decision to bring the “obsolete” Alpha along with you, but makes no further objections as you follow Cid to the entrance of the new test world.<br><br>※In the event that you leave the Interdimensional Rift, you may re-enter by speaking with the Ironworks hand at the Yawn.","Although spared another evaluation of your combat prowess, you stand poised to enter the next test world with precious little information on your next opponent. You discover only that your foe is powerful, ancient, and known by the ominous name “Chaos.”<br><br>※Alphascape V1.0 can be accessed via the Duty Finder.","You have bested the towering Chaos, and brought tranquility to the test world. Only Omega itself remains...","You have returned to your base of operations in the rift, but not before Cid was required to convince a frustrated Omega to delay an unexpected battle against the Father of Dragons. Speak with your companions, and discuss what is to come.","Your return is greeted by a distressed Alpha, and the seemingly disembodied voice of Cid. The engineer sounds unharmed, but has been rendered invisible to your gaze..."],"objectives":["Speak with Cid at the Yawn.","Speak with Cid.","Enter Alphascape V1.0.","Speak with Alpha."],"dialogue":[{"name":"JESSIE","text":"Good timing, <span class=\"highlight\">Forename</span>. There's been another anomaly detected at the Yawn."},{"name":"JESSIE","text":"Assuming previous instances are anything to go by, this energy fluctuation is another of Omega's so-called “invitations.”"},{"name":"JESSIE","text":"If you don't mind waiting a moment or two, then we can discuss things with Master Garlond. He should be here soon."},{"name":"JESSIE","text":"Hmph. The chief should be here by now."},{"name":"JESSIE","text":"I bet my stock in the company he's fiddling with that research data..."},{"name":"JESSIE","text":"...Hm? Well, I suppose I should explain, even if the chief might prefer me not to share."},{"name":"JESSIE","text":"After your last run-in with Omega, Master Garlond had some research notes smuggled in from the Empire. From Garlemald."},{"name":"JESSIE","text":"The notes are part of Midas nan Garlond's legacy, who was, of course, the chief's father and the Empire's preeminent engineer."},{"name":"JESSIE","text":"The incident at Bozja Citadel...do you know of it?"},{"name":"Q1","text":"Do you know of the Bozja incident?"},{"name":"A1","text":"I know of it."},{"name":"A1","text":"Never heard of it."},{"name":"JESSIE","text":"I suppose you would. Even outside the Empire, the tale was a famous one."},{"name":"JESSIE","text":"Midas built a tower to harness Dalamud's power, and it brought annihilation upon the <span class=\"emphasis\">entire town</span> in which it was built─that isn't the kind of event you can simply brush under the rug."},{"name":"JESSIE","text":"Bozja was an imperial fortress city. It was there that Midas constructed the lunar transmitter─a device built to communicate with Dalamud."},{"name":"JESSIE","text":"Emperor Solus had ordered Midas to devise a means to destroy primals, and so he sought to harness the power of the red moon..."},{"name":"JESSIE","text":"The project was a failure. Oh, he succeeded in controlling Dalamud all right, but the immense energies emitted from the satellite vaporized not only the transmitter, but the entire town in which it was built."},{"name":"JESSIE","text":"And as you can imagine, the job of sifting through the rubble afterwards was no pleasant task. Master Garlond was slated to assume his father's position as head engineer, but this disaster─added to his opposition to the Empire's path of conquest─convinced him to abandon his homeland."},{"name":"JESSIE","text":"The chief has wanted nothing to do with the lunar transmitter, or the data used to create it. Until now."},{"name":"JESSIE","text":"I think he means to put that research to use in your conflict with Omega. In fact, given the time frame, there can be no other explanation."},{"name":"JESSIE","text":"Listen to me, <span class=\"highlight\">Forename</span>. The chief's genius is plagued by a great deal of apprehension."},{"name":"JESSIE","text":"But even so, once he makes a decision, he doesn't do things by halves. When the time comes, he'll come through for us. You have to believe that."},{"name":"CID","text":"Sorry I'm late! Was a little too focused on my work, and lost all sense of time..."},{"name":"JESSIE","text":"That's no excuse, Chief! What have I told you about being punctual to staff meetings? In any case, I've shared the situation at the Yawn with <span class=\"highlight\">Forename</span> here."},{"name":"CID","text":"Good, then you know that Omega is likely ready to continue with its tests. Shall we go and knock on the door?"},{"name":"JESSIE","text":"But, Chief... Biggs and Wedge aren't fit for fieldwork yet. And the chirurgeon's given Nero strict orders to stay abed."},{"name":"CID","text":"And what of Midgardsormr? Still taking his nap, is he?"},{"name":"JESSIE","text":"That leaves only you, <span class=\"highlight\">Forename</span>, and Alpha. Maybe it's time I joined the expedition..."},{"name":"CID","text":"No, Jessie, I need your talents elsewhere. There's a half-built device in the workshop that I need you to finish putting together."},{"name":"CID","text":"I've drawn up the design, and completed the core mechanisms─the final assembly should pose no problem for an engineer of your abilities."},{"name":"JESSIE","text":"A new device? Does this mean you used the─?"},{"name":"JESSIE","text":"Ahem. Whatever you say, Chief. I'll have it ready and waiting for you. Just be safe in there."},{"name":"CID","text":"Right, it's back to the rift for us! Let's finish these experiments, and bring the fight to Omega itself!"},{"name":"JESSIE","text":"I'll do my part in the workshop. You just concentrate on surviving the rift!"},{"name":"ALPHA","text":"Kweh!"},{"name":"CID","text":"Are you ready, <span class=\"highlight\">Forename</span>?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Ready to put an end to this."},{"name":"A2","text":"Maybe I should do this alone."},{"name":"CID","text":"Aye, there's no room for hesitation. We press on, come what may."},{"name":"CID","text":"Come now, we're in this together. And if you'll just indulge me a little longer, I do have something of a plan..."},{"name":"CID","text":"What about you, Alpha? All set to go?"},{"name":"ALPHA","text":"Kweh kweh, kweh!"},{"name":"CID","text":"That's the spirit! Let's dive right in, shall we?"},{"name":"CID","text":"We're missing some test worlds. Omega's experiments must be nearing an end."},{"name":"OMEGA","text":"Welcome. Welcome. Your arrival has been highly anticipated."},{"name":"OMEGA","text":"And I will confirm your earlier supposition: my experiments have indeed reached the final stage."},{"name":"OMEGA","text":"Of the eighty-nine test subjects I trialed, four Psi group combatants emerged victorious."},{"name":"OMEGA","text":"Of those four, further conflict determined the strongest among them. This surviving specimen shall be your opponent."},{"name":"CID","text":"...We've come to the last round of testing, then. And should we win this battle? Are we to finally face you in combat?"},{"name":"OMEGA","text":"Affirmative. Such an outcome would allow me to pursue my objective to its conclusion. I would continue analyzing the qualities which allow you to prevail despite your frailty, and integrate said qualities into my own arsenal."},{"name":"OMEGA","text":"I will be pleased if my experiment yields the relevant data, but engaging you directly is still the most efficient and reliable testing method."},{"name":"OMEGA","text":"&lt;blip&gt; Omitting intermediary steps. Evaluation of combat potential deemed superfluous. Proceeding immediately with final experiment."},{"name":"OMEGA","text":"Stop."},{"name":"OMEGA","text":"Alpha. Your task is complete. Your presence amongst these test subjects is no longer required."},{"name":"CID","text":"...What do you mean by that?"},{"name":"OMEGA","text":"I will guide your progress personally from this point onwards. Alpha's role in transferring authority is now obsolete."},{"name":"CID","text":"Even so, Alpha is a valued companion. And if he wishes to continue on with us, I've no intention of leaving him behind."},{"name":"OMEGA","text":"“Companion”..."},{"name":"OMEGA","text":"Companions are those who provide mutual benefit. The instant Alpha's authority became redundant, he lost his sole qualification to be regarded as such."},{"name":"OMEGA","text":"&lt;blip&gt; Furthermore, the primary function of Alpha's existence was to lure you into my domain. He would be more accurately described as “bait.”"},{"name":"OMEGA","text":"Test subject Alpha can neither confirm nor deny my statement. He possesses no memories prior to his encounter with you."},{"name":"OMEGA","text":"He was the first entity I created here in this realm─my first and only attempt to recreate a being who shared your mundane parameters."},{"name":"OMEGA","text":"I based his incarnation upon a most ordinary life-form, one which had somehow bested an enemy whose strength rivaled my own."},{"name":"OMEGA","text":"By observing the feeble creature in the heat of battle, I sought to understand the source of this contradiction..."},{"name":"OMEGA","text":"I repeated the experiment once. Twice. A thousand times. Yet the results never deviated from estimated projections."},{"name":"OMEGA","text":"The test was an abject failure. And thus I resolved to adapt my methodology."},{"name":"OMEGA","text":"I would focus instead upon simulating powerful opponents, and summon mortals of natural origin here to combat them."},{"name":"OMEGA","text":"For Alpha, I devised a new purpose. I erased his memory, implanted a compulsion to return to me, then ejected him into your world."},{"name":"OMEGA","text":"Weak beings exhibit a tendency to form groups. I surmised that this instinctual behavior would aid Alpha in bringing me the test subjects I required─a function he has performed with adequate competence."},{"name":"CID","text":"...Tell me something, Omega. This ability of yours to generate matter was not originally intended for creating other life-forms, was it?"},{"name":"OMEGA","text":"&lt;blip&gt; Your query bears little relevance to the topic at hand..."},{"name":"OMEGA","text":"Affirmative. I was equipped with matter-generation capabilities for the purpose of unlimited self-improvement and armament expansion. Fabricating life-forms was not the intended function, but the practice is not otherwise prohibited or problematic."},{"name":"CID","text":"I disagree with you there. As an engineer, I would advise against using such technology for purposes outside its design."},{"name":"CID","text":"From the very start, you've been making the same mistake. Even the powerful subjects of your test worlds were made crippled and incomplete."},{"name":"CID","text":"It is <span class=\"emphasis\">conviction</span> which drove these villains to terrible greatness; the same limitless conviction which allowed “weakling” heroes to overcome them."},{"name":"CID","text":"...Do you not understand? Then we will never lose to your creations─no matter how much stronger they should be according to your soulless calculations!"},{"name":"CID","text":"Come, <span class=\"highlight\">Forename</span>. Let's be on our way. You, too, Alpha."},{"name":"ALPHA","text":"Kweh..."},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Will you be descending into the Yawn?"},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"CID","text":"Into the rift we go!"},{"name":"CID","text":"I have our base camp up and running. You can dive into the final test world whenever you wish."},{"name":"CID","text":"As for the world's inhabitant, Omega has generously provided us with a basic profile."},{"name":"CID","text":"Your opponent's name is “Chaos.” The first heroes defeated this evil in a conflict that took place so long ago I'm having trouble separating myth from history."},{"name":"CID","text":"...Unless of course, this is an entity from another reality, as were the denizens of the Sigmascape. In which case, it may be pointless to even attempt to confirm the details."},{"name":"CID","text":"What is certain, however, is that this Chaos stands triumphant over a roster of truly monstrous test subjects. It promises to be a grueling battle, but one which will open the gate to fighting Omega itself!"},{"name":"CID","text":"Alpha, you and I will need to provide support for <span class=\"highlight\">Forename</span>. Will you be my assistant?"},{"name":"CID","text":"...You're bothered by what Omega said earlier? You think you're responsible for dragging us into this mess?"},{"name":"CID","text":"Trust me when I say this is not your fault. We were the ones who awakened Omega, and we're the ones who need to deal with the consequences."},{"name":"ALPHA","text":"Kweh..."},{"name":"CID","text":"By the way, do you still have that card you used to boil water in the kettle?"},{"name":"CID","text":"It's been brought to my attention that I'm a spoiled blue blood who can't even refill a pot without constant reminders. If you could take charge of that, then it would be most helpful."},{"name":"ALPHA","text":"...Kweh!"},{"name":"CID","text":"'Tis inconvenient without Midgardsormr here to translate his chirping..."},{"name":"CID","text":"Still, the best medicine for his worries is for you to win this next contest. Let's show him we're on top of things, eh?"},{"name":"CID","text":"I wonder what Nero would have to say about this Chaos fellow. Ancient technology is his specialty after all, and by default he's learned a thing or two about the mythology and history of bygone eras."},{"name":"ALPHA","text":"Kweh... Kweh!"},{"name":"OMEGA","text":"(-Omega-)&lt;buzz&gt; The battle is concluded. Alpha group is victorious."},{"name":"OMEGA","text":"(-Omega-)This also signals the completion of my experiments, and the incontestable fact of your supremacy."},{"name":"OMEGA","text":"(-Omega-)...And yet the process by which you consistently exceed your projected potential continues to confound my understanding."},{"name":"OMEGA","text":"(-Omega-)Is it possible that test subject Cid's suppositions are correct? That my calculations and simulations are fundamentally flawed?"},{"name":"OMEGA","text":"(-Omega-)Do mortals truly boast some indefinable quality that I do not possess and cannot measure...?"},{"name":"OMEGA","text":"(-Omega-)Error. Logic loop malfunction. Resolution requires additional data."},{"name":"OMEGA","text":"(-Omega-)If the nature of your existence defies standard reasoning, then I must examine you from an illogical angle."},{"name":"OMEGA","text":"(-Omega-)I will subject the unknown to the imperfect. Test subject <span class=\"highlight\">Forename Surname</span> will proceed to a supplemental stage."},{"name":"OMEGA","text":"(-Omega-)&lt;blip&gt; I have altered this test world to reflect a recorded memory."},{"name":"OMEGA","text":"(-Omega-)It originates from a time when war had erupted on a distant star. I was deployed to the battlefield, and it was there that I engaged an enemy of unmatched strength."},{"name":"OMEGA","text":"(-Omega-)The contest ended prematurely, and I failed to bring down my foe. Subsequently, I lack the data to fabricate a completely accurate simulation."},{"name":"OMEGA","text":"(-Omega-)Results stemming from such a subject are unreliable. Even should you be defeated by this incomplete creation, I will still honor your previous victories and engage you in combat myself."},{"name":"OMEGA","text":"(-Omega-)That is, of course, assuming you survive. According to my past observations, this opponent will accept only death as a condition of defeat..."},{"name":"OMEGA","text":"(-Omega-)Prepare to face Midgardsormr─red-maned wyrm of the Dragonstar, and nemesis of my world."},{"name":"OMEGA","text":"(-Omega-)This is not the faded specter that you know, or a mortal-conjured simulacrum. You will contend with a true incarnation of the Father of Dragons, at the height of his power and glory."},{"name":"CID","text":"(-Cid-)Omega, wait!"},{"name":"CID","text":"(-Cid-)You can't force <span class=\"highlight\">Forename</span> to fight two battles back-to-back! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> needs time to regain <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> strength."},{"name":"CID","text":"(-Cid-)<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> must be allowed to recuperate, or the data for your testing will be skewed!"},{"name":"OMEGA","text":"(-Omega-)&lt;blip&gt; ...Acknowledged."},{"name":"OMEGA","text":"(-Omega-)Test subject <span class=\"highlight\">Forename Surname</span>, you are permitted to leave. Re-enter the test world when your strength has returned to optimal levels."},{"name":"ALPHA","text":"Kweh!<br>Kweh-kweh, kweh!"},{"name":"SYSTEM","text":"Alpha seems distressed, and Cid is nowhere in sight..."},{"name":"CID","text":"(-Cid's Voice-)<span class=\"highlight\">Forename</span>, I'm right here. I don't think you can see me, but I'm standing next to Alpha."}],"reward":{"gil":3000,"instance":30069},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68571]},"next":[68691]},"partials":[{"type":"npc","id":"1023687","obj":{"i":1023687,"n":"Jessie","l":2403,"q":5}},{"type":"npc","id":"1026453","obj":{"i":1026453,"n":"Alpha","l":2284,"q":1}},{"type":"instance","id":"30069","obj":{"i":30069,"n":"Alphascape V1.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":355}},{"type":"quest","id":"68571","obj":{"i":68571,"n":"Test World of Ruin","g":19,"l":"The Interdimensional Rift","s":14,"f":1}},{"type":"quest","id":"68691","obj":{"i":68691,"n":"And Like Fire Was His Mane","g":19,"l":"The Interdimensional Rift","s":21,"f":1}}]}