{"quest":{"name":"Messenger of the Winds","location":"Gridania","id":68696,"patch":4.56,"sort":132,"icon":100833,"eventIcon":71221,"issuer":1026870,"target":1026869,"genre":207,"journal":["Noctis feels the need to unwind.<br>※This quest is available for a limited time only.","Wishing to make the most of his time in Eorzea, Noctis declares that he will go fishing. He asks you to join him before heading off in the direction of the Jadeite Thick in the Central Shroud.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","To the tranquil susurration of the forest, Noctis reveals to you his worry that he may never find his way home. Brief though it was, the fishing session helps to lift his spirits, and he finds his determination anew. You then turn your steps back to Gridania to rejoin Kipih, but not before taking something called a “photo” together as a memento.","You and Noctis return to the city to find Kipih in a flustered state. Apparently, magitek troopers have also appeared in Ixali territory, their presence alarming the beastmen and spurring them to summon forth their goddess, Garuda. Upon hearing the name, Noctis reveals that he vanquished a being by the same name back in his world, and is confident that the feat can be repeated here. While Kipih sets out to secure a loan of Cid's airship to bear you to the Howling Eye, Noctis bestows upon you his power─the ability to warp. Once your preparations are in order, you may proceed to the Carline Canopy, where Kipih will be waiting.","Arriving at the Howling Eye, you come face-to-face not with the Lady of the Vortex, but a creature bearing an uncanny resemblance to her. Recognizing Noctis as the Chosen King, the Garuda-like being proceeds to make trial of him─together with you as his comrade.","At the end of a turbulent struggle, you and Noctis emerge triumphant and are declared worthy. The divinity then opens a portal through which Noctis may return home, but not before Cid and Kipih make their entry with the newly repaired Regalia. Saying his farewells, Noctis climbs into his vehicle and prepares to speed off. In that instant, amidst the blinding light of the portal, you catch a glimpse of a mysterious woman dressed all in white. And then Noctis is gone.","Kipih wonders if the woman in the light was Noctis's fiancée, but the truth may never be known. Thanking you for your assistance, she sets off to pen her story, leaving you and Cid to wish Noctis well in your hearts, wheresoever the long road may lead him..."],"objectives":["Speak with Noctis in the Central Shroud.","Speak with Kipih Jakkya in Gridania.","Speak with Kipih Jakkya."],"dialogue":[{"name":"NOCTIS","text":"After all that, I still don't have any idea how I'm supposed to get home..."},{"name":"NOCTIS","text":"For now, it looks like there's nothing I can do except wait for Kipih to dig up clues."},{"name":"NOCTIS","text":"So I was thinking, I've come all this way to this beautiful place. I might as well try to see what I can of it, so I've got something to tell my friends."},{"name":"NOCTIS","text":"...It may not look like it, but I'm kinda crazy about fishing. I go whenever I have time, and I've got time now, so I'm gonna hit up a place nearby. You should come too."},{"name":"NOCTIS","text":"I promise to have new information to share before long. See that you both return soon, all right?"},{"name":"NOCTIS","text":"What took you so long? I've already reeled in a dozen."},{"name":"NOCTIS","text":"To be honest with you, I'm worried. I keep thinking, what if I never found my way back? And it gets me down."},{"name":"NOCTIS","text":"But being here in this tranquil forest and casting the line... It calms me. Helps me focus."},{"name":"NOCTIS","text":"I have to get back. People are counting on me."},{"name":"NOCTIS","text":"And I'm counting on you."},{"name":"NOCTIS","text":"Oh hey, let's take a photo together. That massive waterwheel over there would make for a great backdrop."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Sure!"},{"name":"A1","text":"Take a pho-what?"},{"name":"NOCTIS","text":"Great."},{"name":"NOCTIS","text":"Huh, guess you don't have cameras here. So, a photo is a... Actually, let me just show you."},{"name":"NOCTIS","text":"You ready? Here we go!"},{"name":"NOCTIS","text":"Nice! I can practically hear Prompto say “Love the lighting!” Can't wait to show this to the fellas when I get back."},{"name":"NOCTIS","text":"You're right, we should be getting back ourselves. Come on, let's go."},{"name":"NOCTIS","text":"I promise to have new information to share before long. See that you both return soon, all right?"},{"name":"KIPIHJAKKYA","text":"<span class=\"highlight\">Forename</span>, Noctis! Thank the gods you're back!"},{"name":"NOCTIS","text":"What's the matter?"},{"name":"KIPIHJAKKYA","text":"I've just learned from a colleague that the mechanical soldiers have also appeared in Ixali territory."},{"name":"KIPIHJAKKYA","text":"That in itself wouldn't be a cause for concern, but the beastmen responded with alarm to the trespassers and have summoned forth Garuda!"},{"name":"NOCTIS","text":"That bird lady? Pretty sure we already took care of her. Back in my world, anyway."},{"name":"KIPIHJAKKYA","text":"What!? You mean to say you are a primal-slayer like <span class=\"highlight\">Forename</span>!?"},{"name":"NOCTIS","text":"Primal? Is that like an Astral or a Messenger?"},{"name":"NOCTIS","text":"Well, whatever it is, we'll take care of it one way or another. So, where's Garuda supposed to have appeared exactly?"},{"name":"KIPIHJAKKYA","text":"At the Howling Eye, her domain to the north. But it's nigh impossible to venture near, for Garuda shrouds her sanctuary with violent winds."},{"name":"KIPIHJAKKYA","text":"If you are determined to face her, however, I will contact the Ironworks and request a loan of an airship."},{"name":"KIPIHJAKKYA","text":"Very well, then. While you see to your preparations, I will secure your transportation."},{"name":"KIPIHJAKKYA","text":"When you are ready, come and meet me in front of the Carline Canopy."},{"name":"NOCTIS","text":"You've proven yourself a friend. If we're gonna face Garuda together, I'll lend you the power of kings."},{"name":"NOCTIS","text":"It's a special power that I have, but I can share it with others."},{"name":"NOCTIS","text":"With it, you can quickly warp around, like you've seen me do. Might take some getting used to, but I'm sure you've got what it takes."},{"name":"NOCTIS","text":"Garuda's causing trouble because of the MTs, and I feel responsible for bringing them here. Let's go make things right!"},{"name":"NOCTIS","text":"Ready when you are!"},{"name":"KIPIHJAKKYA","text":"The airship is ready to bear you and Noctis into battle! Are your preparations in order?"},{"name":"KIPIHJAKKYA","text":"Without further ado, then!"},{"name":"ELUSIVEIXAL03160","text":"Squawwwkkk! Run! Run for your lives!"},{"name":"CONFUSEDIXAL03160","text":"Like our goddess, it is...yet our goddess, it is not!"},{"name":"FRIGHTENEDIXAL03160","text":"Nay, something else, that thing is! Flee this place, we must!"},{"name":"FF15GARUDA","text":"(-Garuda-like Being-)Clamorous creatures... Why have they summoned me? And what strange land is this?"},{"name":"FF15GARUDA","text":"(-Garuda-like Being-)Ahhh, the Chosen King, Noctis. So that is the way of it."},{"name":"FF15GARUDA","text":"(-Garuda-like Being-)Yours was the presence that drew me hither."},{"name":"FF15GARUDA","text":"(-Garuda-like Being-)Very well. Take up your weapon, Chosen King, and face me. We shall see if you are worthy of my power."},{"name":"NOCTIS","text":"You pack a serious punch, <span class=\"highlight\">Forename</span>. I'm impressed."},{"name":"FF15GARUDA","text":"The Crystal has chosen well indeed. I acknowledge your strength, Noctis. Yours and your companion's both."},{"name":"NOCTIS","text":"Man, what is it with gods and trials? Do you always have to be so skeptical?"},{"name":"FF15GARUDA","text":"So it is decreed. At the world's peril do we grant our power unto the untested."},{"name":"CID","text":"Apologies for the delay!"},{"name":"CID","text":"She's unlike anything I've seen before, so it took me a while to get acquainted, but the Regalia is as good as new."},{"name":"NOCTIS","text":"Seriously? I owe you big time!"},{"name":"FF15GARUDA","text":"Noctis. There is much you have left undone on Eos."},{"name":"FF15GARUDA","text":"Your presence here is an anchor, allowing me to link the two worlds. For you, I shall open the way."},{"name":"FF15GARUDA","text":"Tarry not, for the gate cannot remain for long."},{"name":"NOCTIS","text":"Got it. Thanks."},{"name":"NOCTIS","text":"Divinities... One minute they're trying to kill you, the next they're helping you. I'll never understand them."},{"name":"NOCTIS","text":"Thanks for the company, <span class=\"highlight\">Forename</span>. It was nice going around with you."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I had fun! Let's do it again sometime!"},{"name":"A3","text":"Take care of business back home!"},{"name":"NOCTIS","text":"Yeah, definitely. We gotta hang out again."},{"name":"NOCTIS","text":"You bet I will. And when everything's sorted, maybe we can hang out again."},{"name":"NOCTIS","text":"Well, I better get moving. I've got a promise to keep, after all. Take care, now!"},{"name":"Q1","text":"Travel to the Howling Eye?"},{"name":"KIPIHJAKKYA","text":"Before Noctis went into the portal, I could've sworn I saw a woman amidst the light. An ethereal beauty dressed all in white."},{"name":"CID","text":"I saw her too. It seemed to me she was waiting for Noctis. Guiding him. I can only assume they share a deep bond."},{"name":"KIPIHJAKKYA","text":"Oh! Then perhaps that was his fiancée!"},{"name":"CID","text":"Perhaps so...and perhaps not. The sole person who could've enlightened us has vanished into the light."},{"name":"KIPIHJAKKYA","text":"Well, whoever and wherever Noctis's fiancée may be, I do hope they are reunited."},{"name":"KIPIHJAKKYA","text":"Right! While events are still fresh in my mind, I shall return to my office and put pen to parchment. Master Cid, many thanks for your cooperation!"},{"name":"KIPIHJAKKYA","text":"But the most thanks of all, I reserve for you, my dear adventurer. In no small part due to your help, Noctis managed to find his way home, and my article can reach a climactic conclusion. See that you do not miss it!"},{"name":"CID","text":"A strangely charismatic young man, was Noctis... In the end, we never learned the circumstances of his coming here."},{"name":"CID","text":"But if he has things he must do back home, as that Garuda-like being said, perhaps this was a trial that he had to overcome along his journey."},{"name":"CID","text":"At any rate, old friend, I believe our work here is done. Wherever the long road may lead him, may Noctis ever ride in the light of the Crystal."},{"name":"SYSTEM","text":"You can now exchange MGP for special items by speaking with the Ironworks vendor at the Gold Saucer.<br>※Available for a limited time only."}],"reward":{"gil":1755,"items":[{"id":24608},{"id":24611}]},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[68695]}},"partials":[{"type":"npc","id":"1026870","obj":{"i":1026870,"n":"Noctis","l":52,"q":2}},{"type":"npc","id":"1026869","obj":{"i":1026869,"n":"Kipih Jakkya","l":52,"q":1}},{"type":"item","id":"24608","obj":{"i":24608,"n":"Lucian Prince's Jacket","l":1,"c":43848,"t":35,"p":156}},{"type":"item","id":"24611","obj":{"i":24611,"n":"Lucian Prince's Boots","l":1,"c":49195,"t":38,"p":94}},{"type":"quest","id":"68695","obj":{"i":68695,"n":"In the Dark of Night","g":207,"l":"Ul'dah","s":131}}]}