{"quest":{"name":"In the End, There Is Omega","location":"The Interdimensional Rift","id":68692,"patch":4.4,"sort":22,"icon":112314,"unlocksFunction":1,"eventIcon":71341,"issuer":1026450,"target":1021937,"genre":19,"journal":["Cid is waiting for Omega to make its next move.","Omega has recognized your prowess, and seeks to conclude its experiments with a direct confrontation. With the final battle looming before you, Cid requests that you allow him time to make a few important preparations. After making some adjustments at the base camp terminals and offering a few encouraging words to Alpha, the engineer suggests you all exit the rift. There is yet more to be done.","You gather briefly at the lip of the Yawn, and Cid explains the need to run his new device through a final inspection. Alpha seems concerned about Cid's state of mind, and you feel compelled to follow the chocobo back to Rhalgr's Reach to check on the engineer.","From the shadows of a pillar, you witness Cid talk through his misgivings with a bemused Nero. After a lengthy and seemingly cathartic exchange, it seems the chief is now ready for what may come...","Cid proclaims his device complete, and bids you join him once more within the rift. You assume a tireless Ironworks hand stands by to assist with your descent into the Yawn.","Cid unveils the Ironworks' latest invention: the Omega Jammer. Using the control module, you should be able to disable the machine's weaponry with a targeted burst of concentrated lightning. You pray the jammer will provide the advantage you need, as you prepare to activate the relocation device and face Omega itself in the arena beyond!<br><br>※Alphascape V3.0 can be accessed via the Duty Finder.","You have entered battle against Omega─an ancient weapon of deadly and inscrutable technology─and seized victory! Cid and Alpha wait to congratulate you on your incredible triumph.<br><br>※In the event that you leave the Interdimensional Rift, you may re-enter by speaking with the Ironworks hand at the Yawn.","Even as you stand over your vanquished foe, Omega struggles back to its mechanical feet. Frustrated by its attempts to understand your capabilities, the machine appears to settle upon a new method of testing─a decision which results in a contraction of the rift and your expulsion into a null dimension. Thanks to Alpha's courage and determination, however, you are delivered to a floating platform in the sea of nothingness...and another confrontation with a reconfigured Omega!<br><br>※Alphascape V4.0 can be accessed via the Duty Finder.","You have vanquished Omega, and ended its eons-old directive to evolve into an ever greater threat. The arid lands of the Fringes beckon you back with the promise of mundane stability...","With Omega's true defeat, the last vestige of the rift crumbles around you. All seems lost, until you spy the massive form of Hraesvelgr flying towards you, two familiar figures perched upon his back. Unwilling to look a gift wyrm in the mouth, you gladly accept the proffered ride back to the edge of the Yawn. Although Midgardsormr could not be there himself, it seems he sent Hraesvelgr in his stead to offer egress from the rift and praise for your victory.","Surprised by Hraesvelgr's rescue, Cid is nevertheless thankful for the intervention of Midgardsormr and his brood. Vanquishing Omega was the chief's first priority, but surviving to celebrate the deed appears to have been a close second."],"objectives":["Speak with Cid.","Look for Cid in Rhalgr's Reach.","Speak with Cid.","Speak with Cid in the Interdimensional Rift.","Enter Alphascape V3.0.","Enter Alphascape V4.0.","Speak with Cid."],"dialogue":[{"name":"ALPHA","text":"Kweh-kweh!"},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Will you be descending into the Yawn?"},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"CID","text":"Your move, Omega..."},{"name":"OMEGA","text":"&lt;blip&gt; Shutdown initiated. All core experiments and supplemental testing concluded."},{"name":"OMEGA","text":"Discarding test worlds. System resources rerouting to primary operations."},{"name":"OMEGA","text":"Congratulations, Alpha group. As the last surviving test subjects, you have removed every challenger on your path to reach me."},{"name":"OMEGA","text":"I, too, am eager to meet you in battle. The margin of error I observed between my simulations and your practical performance against Midgardsormr necessitates direct and immediate analysis."},{"name":"OMEGA","text":"&lt;blip&gt; Confrontation imminent. Prepare for unmitigated hostilities, then activate the relocation device to enter the arena."},{"name":"CID","text":"...This is it, then."},{"name":"CID","text":"Omega's power might seem overwhelming, but trust in old Cid! I have a fair idea of where its weakness lies."},{"name":"CID","text":"And I've been working on something to exploit that vulnerability─I just need a little more time to prepare."},{"name":"CID","text":"First things first, we make a few adjustments here...like so..."},{"name":"CID","text":"Ah, Alpha. Do you have any of those tricks and tools left over?"},{"name":"CID","text":"I want us to have as many options as possible, so let's lay our cards on the table...as it were."},{"name":"CID","text":"What do we have here? Some sort of gem... A couple of stones..."},{"name":"CID","text":"And one single card. This makes things bigger, does it? Or is it smaller...?"},{"name":"CID","text":"Right. 'Twas foolish of me to even ask. We'd best leave you in charge of when and how to use your special tools."},{"name":"CID","text":"Ah yes, I almost forgot..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm sure you'll do fine!"},{"name":"A1","text":"Don't worry─we'll win this, I promise!"},{"name":"A1","text":"You can always claw things if you run out of tricks!"},{"name":"CID","text":"Here, you should carry this as well. I've filled an empty bottle with the “invisibility water” from the kettle."},{"name":"CID","text":"It might just prove useful in the right situation."},{"name":"CID","text":"Listen to me, Alpha. Up until now, Omega has poked and prodded us from one mad experiment to the next, and honestly, we have no idea of what might happen in there."},{"name":"CID","text":"But between us, I believe we have the knowledge and the skills to prevail. If you see a chance to make a difference, I want you to take it. All you need is faith in yourself...and a little courage to see it through."},{"name":"CID","text":"Right, Jessie should have that device put together by now. Let's head outside, shall we?"},{"name":"ALPHA","text":"Kweh?"},{"name":"CID","text":"I'll head straight back to Rhalgr's Reach and collect my new toy."},{"name":"CID","text":"I do still need to run through a final inspection, so feel free to rest in town in the meantime. We'll discuss strategy the moment I'm finished!"},{"name":"ALPHA","text":"Kweh... Kweh-kweh!"},{"name":"SYSTEM","text":"Alpha seems concerned for Cid's well-being. You have a feeling he wants you to follow him..."},{"name":"JESSIE","text":"Oh, hello, <span class=\"highlight\">Forename</span>. Cid didn't mention you were back as well."},{"name":"ALPHA","text":"Kweh!"},{"name":"NERO","text":"(-???-)You're looking a bit shaky there, old friend."},{"name":"CID","text":"Nero. They let you out of bed, did they?"},{"name":"NERO","text":"After studying the data collected from the battle between Omega and Shinryu, one is led to a certain conclusion."},{"name":"NERO","text":"Of all the primal's attacks, Shinryu's burst of lightning was the one thing that pierced the machine's defenses. Omega, it would seem, is vulnerable to electrical energy."},{"name":"CID","text":"...Aye. All the available evidence supports such a theory. 'Tis likely an intrinsic weakness that even Omega itself cannot fully compensate for."},{"name":"CID","text":"Yet be that as it may, I imagine it can still shrug off shocks generated by ordinary means. We'll need to hit it with a truly gargantuan blast of energy..."},{"name":"NERO","text":"And so you made <span class=\"emphasis\">that</span>. You based it on Midas's design, didn't you? The plans for the lunar transmitter..."},{"name":"CID","text":"When my father was establishing a connection between the transmitter and Dalamud, he invented a method for accumulating and converting energy on a vast scale."},{"name":"CID","text":"Too vast, as it turned out. But the technology which leveled an entire town may be exactly the tool we need for the task at hand."},{"name":"CID","text":"I've made my own improvements, and triple-checked the calculations. On parchment, the idea is sound. And Jessie has done a fine job assembling the parts."},{"name":"NERO","text":"I fail to see the problem. What are you afraid of, Garlond?"},{"name":"CID","text":"...I don't know. The device should give us the edge we need, 'tis just..."},{"name":"CID","text":"Whenever I look at it, I'm taken back to those dark days after the incident."},{"name":"CID","text":"I remember bodies, melted by searing heat. I remember the bereaved, and feel the weight of their silent accusations. I remember the Empire's remorseless response."},{"name":"CID","text":"We turned outwards in search of answers, but the inventions we created to ensure our future were used instead to destroy lives. To wage war."},{"name":"CID","text":"And that's why I fled. I came to Eorzea, and swore to only employ technology for benevolent ends."},{"name":"CID","text":"...But naught is ever so straightforward. Every connection I have forged with the people of this realm reminds me of that fact."},{"name":"CID","text":"Often the act of living itself is a never-ending struggle against a world determined to oppose you."},{"name":"CID","text":"You can have the best of intentions, and still cause hurt to yourself or others. But 'tis in confronting these wounds that we learn the better path. How to grasp those moments of true contentment..."},{"name":"NERO","text":"...What drivel. You never used to bother with all this tedious introspection. Feeling our mortality, are we?"},{"name":"CID","text":"Mayhap I am. I had no such hesitation when I was a student─it was all bright and shiny innovation on the double, and later consequences be damned."},{"name":"CID","text":"Now, though... I don't mind thinking through the outcomes, and taking the time to produce just one rigorously tested and carefully designed invention."},{"name":"CID","text":"'Tis a reflection, I think, of just how much there is in this world I care about now aside from myself."},{"name":"NERO","text":"Ugh, I don't understand you at all!"},{"name":"NERO","text":"But I suppose, if anything, Omega and its unfettered testing methods represent the student you once were."},{"name":"NERO","text":"And if you insist that your present self is the better one, then you'd best prove it with that device of yours."},{"name":"CID","text":"...I suppose I must."},{"name":"CID","text":"Although 'tis hardly fair to compare my youth to Omega's solitary existence. I always had the second-best student in class pushing me to excel."},{"name":"CID","text":"I seem to recall a twinge of irritation any time he would outscore me on an exam..."},{"name":"NERO","text":"...I've been out of bed too long. I had better go and lie down before I fall over. Or vomit."},{"name":"JESSIE","text":"The chief seems to be on top of things. All that's left now is to bring your combined talents against Omega. I have complete confidence in you, <span class=\"highlight\">Forename</span>!"},{"name":"ALPHA","text":"Kwe-kweh!"},{"name":"CID","text":"First Alpha, and now you. Come to check on my progress, have you?"},{"name":"CID","text":"Well, I'm happy to report that everything is set and ready to go! Once you're finished with restocking and repairing or whatever it is you adventurers do, then we can head back to the rift and confirm our strategy."},{"name":"ALPHA","text":"Kwe-kweh, kweeeh!"},{"name":"CID","text":"Apologies for the delay, but I think you'll agree the Ironworks' latest invention was worth the wait."},{"name":"CID","text":"This is the control module for something I've dubbed the “Omega Jammer.” It will allow you to generate a colossal burst of lightning at any point of your choosing."},{"name":"CID","text":"The effect won't disable Omega itself, of course, but it should be strong enough to knock out its armaments."},{"name":"CID","text":"I'll remain here and operate the main body of the device. I want to do everything in my power as an engineer to ensure that you emerge the victor. It all comes down to this!"},{"name":"CID","text":"You can use the jammer's lightning bursts to incapacitate Omega's weaponry. A veteran like you should have no trouble turning that advantage into victory!"},{"name":"CID","text":"<span class=\"highlight\">Forename</span>!"},{"name":"CID","text":"By the gods, you've done it! You defeated Omega. We've won..."},{"name":"OMEGA","text":"&lt;blip&gt; Analysis. Subjects displayed erratic levels of combat capability."},{"name":"OMEGA","text":"Failure to exploit opportunities to inflict unavoidable damage. Noted tendency for isolated errors to compound and adversely affect performance."},{"name":"OMEGA","text":"Conversely, subjects observed to launch attacks at sporadic intervals with unexpected force. Stated phenomenon increasingly prevalent once my structural integrity reached critical levels. Adrenaline-induced frenzy suspected."},{"name":"OMEGA","text":"Furthermore, degree and manner of inconsistency varies from subject to subject. Unpredictability difficult to counter."},{"name":"OMEGA","text":"&lt;blip&gt; &lt;bloop&gt; I observed similar anomalies during my battle with Midgardsormr, but the phenomenon appears far more pronounced in weaker opponents."},{"name":"OMEGA","text":"I do not understand. Your physiology must include some enhancement function that I cannot detect..."},{"name":"OMEGA","text":"My programming demands I assimilate this capability. &lt;bleep&gt; Insufficient data."},{"name":"OMEGA","text":"I must reassess my methods, and devise a more exhaustive testing and combat protocol."},{"name":"CID","text":"What in the─? The rift!"},{"name":"OMEGA","text":"I have determined the optimal form for this experiment."},{"name":"OMEGA","text":"Prioritizing physical reconfiguration. Diverting energy from interspatial maintenance. Collapsing rift."},{"name":"CID","text":"Omega, wait! There is nothing outside this rift but empty space! We'll be cast out into the void!"},{"name":"OMEGA","text":"Affirmative. Your demise was factored into my determinations. The probability of hostile subjects interfering with the reconfiguration process was unacceptably high."},{"name":"OMEGA","text":"I acknowledge your value as test subjects. But you are not irreplaceable."},{"name":"OMEGA","text":"Once my reassembly is complete, I will send Alpha to lure in new mortals. Testing will continue."},{"name":"OMEGA","text":"&lt;blip&gt; Ending communications."},{"name":"CID","text":"We're being drawn away... Run, <span class=\"highlight\">Forename</span>! Run!"},{"name":"OMEGA","text":"&lt;blip&gt; Interspatial domain resources cut by eighty-two percent."},{"name":"OMEGA","text":"Entering dormant mode. Commencing automated memory scan."},{"name":"OMEGA","text":"Data file **.<br>Target: “Midgardsormr.” Departure from planetary atmosphere confirmed. Presence of seven distinct life-forms detected in close vicinity of target."},{"name":"OMEGA","text":"Irrelevant. Sir indicates no change to existing directive. Commencing pursuit."},{"name":"OMEGA","text":"Data file ***.<br>Distance to target increasing. Velocity insufficient."},{"name":"OMEGA","text":"Dismantling and reconfiguring chassis. Velocity increase achieved. Overall performance maintained at ninety-six percent."},{"name":"OMEGA","text":"Data file *****.<br>Asteroid belt cleared. Repairing damage, and continuing pursuit. Performance at seventy-two percent and falling."},{"name":"OMEGA","text":"Data file ******.<br>Signal from **** lost. Local interference suspected. Attempting to reestablish contact. Failure."},{"name":"OMEGA","text":"Executing current mission directive until communications are restored. Performance at fifty-nine percent."},{"name":"OMEGA","text":"Data file ********.<br>Struck by electromagnetic pulse while navigating **** quadrant. Partial systems failure."},{"name":"OMEGA","text":"Homing coordinates lost."},{"name":"OMEGA","text":"&lt;blip&gt; Assessment. I am an evolving weapon construct. Acquire adaptations through combat. Repeat until capabilities enable rediscovery of return route. Mission directive unchanged."},{"name":"OMEGA","text":"Data file...<br>Data file......<br>Data file........."},{"name":"OMEGA","text":"(-Memory of Omega-)Alpha...<br>...an abject failure."},{"name":"OMEGA","text":"(-Memory of Omega-)I erased his memory, implanted a compulsion to return to me..."},{"name":"OMEGA","text":"Data file **********.<br>Damaged. Repairing. Damaged. Repairing. ...Thirty-three percent."},{"name":"OMEGA","text":"Data file **********.<br>Passing frozen star... Passing barren star... Passing vortex star... Passing dying star..."},{"name":"OMEGA","text":"Operating on minimum energy. No signal detected. No response to─&lt;bleeep&gt;"},{"name":"CID","text":"(-Memory of Cid-)All you need is faith in yourself...and a little courage to see it through..."},{"name":"OMEGA","text":"Data file **********************."},{"name":"OMEGA","text":"Target lost. Last known coordinates recorded on planet ******."},{"name":"OMEGA","text":"Alpha. Your homing instinct is functioning as designed."},{"name":"OMEGA","text":"Evidence suggests your fellow Alpha group subjects perished when the rift contracted. Unavoidable. But there is a multitude of their kind. The next experiment will go forward as planned."},{"name":"OMEGA","text":"Such protestations are wasted energy. This does not aid you in executing your assigned task."},{"name":"OMEGA","text":"Just as I pursue my directives, so must you fulfill your role. Our purpose justifies our existence."},{"name":"OMEGA","text":"&lt;bleeep&gt; Intrusion detected."},{"name":"CID","text":"Our thanks, Alpha. That was some marathon!"},{"name":"CID","text":"Now...<br>Who was saying our feathered companion here was “obsolete”?"},{"name":"CID","text":"He put his tools to work even as the rift began to collapse─shrank us down, and turned us invisible, all so he could bring you a little surprise."},{"name":"CID","text":"But he had to keep it quiet, or you'd realize we'd survived. He had to trust that we were still clinging on, even as he ran through that endless, freezing void..."},{"name":"CID","text":"You wanted to test us, Omega..."},{"name":"CID","text":"So let the experiment begin!"},{"name":"OMEGA","text":"&lt;blip&gt; Illogical. Alpha had no reason to take such action. How do you continue to defy my projections?"},{"name":"OMEGA","text":"&lt;bleep&gt; Error. &lt;bleep&gt; Error. &lt;bleep&gt; Error. Insufficient data."},{"name":"OMEGA","text":"Adjusting experiment protocol. I will engage you in battle now. I must have my answers."},{"name":"OMEGA","text":"Fighting in this form should provide me with a new level of understanding. Insight into your physiology... Your mindset... Your mortality..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"We'll show you how “weaklings” fight!"},{"name":"A2","text":"Is conflict the only way?"},{"name":"OMEGA","text":"Acknowledged. Do not practice restraint. The more I learn from you, the stronger I will become..."},{"name":"OMEGA","text":"...The closer the distant stars will grow."},{"name":"OMEGA","text":"Affirmative. I understand your language, but your words cannot sway me from my directives."},{"name":"OMEGA","text":"You possess a capability that I do not. The instant I became aware of that fact, conflict became an inevitability. That is my purpose. That is Omega."},{"name":"OMEGA","text":"Commencing final experiment. Testing will continue until I unlock the nature of your anomalous strength."},{"name":"CID","text":"Alpha should be fine with a little rest. I'll make sure he stays safe on the edge of the platform, so no holding back, <span class=\"highlight\">Forename</span>."},{"name":"CID","text":"Give Omega a beating it won't recover from!"},{"name":"ALPHA","text":"Kweh...<br>Kwe-kweh!"},{"name":"OMEGA","text":"&lt;blip&gt; Failure... &lt;bleep&gt; Defeated..."},{"name":"OMEGA","text":"I wanted to understand you...to assimilate your strength..."},{"name":"OMEGA","text":"...Alpha, your gesture serves no logical purpose."},{"name":"OMEGA","text":"You are as incomprehensible as these mortals. &lt;bleeep&gt; But you did not fight them... How have you <span class=\"emphasis\">become</span> like them...?"},{"name":"CID","text":"Omega. The anomaly you see in us; the answer you search for..."},{"name":"CID","text":"It is our heart. Our spirit. The intangible strength of one's soul. It is not a quality that can be measured or acquired through any amount of analytical combat."},{"name":"CID","text":"Instead of fighting against us, you might have learned more by standing <span class=\"emphasis\">with</span> us. Just as Alpha did."},{"name":"OMEGA","text":"Heart...<br>You speak of something more than what beats in your chest."},{"name":"OMEGA","text":"The inconstant, immeasurable factor behind your victories. Midgardsormr displayed it, too, but such unpredictable potential was never part of my design."},{"name":"OMEGA","text":"&lt;blip&gt; Projection. Had I integrated this quality, how powerful would I have become...?"},{"name":"OMEGA","text":"Strong enough to return...?"},{"name":"CID","text":"...Nay, Omega. I'm afraid it doesn't work like that."},{"name":"CID","text":"'Twas a long, lonely path you traveled to arrive here."},{"name":"CID","text":"To return across that vast distance alone... Anyone with a spirit to break would find the journey more difficult, not less so. "},{"name":"OMEGA","text":"...I see."},{"name":"OMEGA","text":"I think...I understand..."},{"name":"CID","text":"...The rift! It's destabilizing!"},{"name":"CID","text":"Gods take me for a fool! I hadn't planned past defeating Omega..."},{"name":"WEDGE","text":"Chief! <span class=\"highlight\">Forename</span>! Alpha!<br>Hold on, we're coming!"},{"name":"CID","text":"Wedge!? And Biggs is with him!<br>...On the back of a huge dragon."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Hraesvelgr!"},{"name":"A3","text":"But how...?"},{"name":"BIGGS","text":"Midgardsormr sent us to rescue you!"},{"name":"BIGGS","text":"...Explanations can wait! Hop on, quick!"},{"name":"CID","text":"Uh...Hraesvelgr, wasn't it? Our thanks. You pulled us out of a tight spot indeed."},{"name":"HRAESVELGR","text":"Spare me thy pleasantries, mortal. I but lent my wings at the request of my sire."},{"name":"CID","text":"Ah... So, Midgardsormr has been watching over us."},{"name":"CID","text":"I would dare give thanks to him, as well. His intervention allowed us to continue our battle, and forever remove the threat of Omega from this world. From all worlds..."},{"name":"HRAESVELGR","text":"In all the long centuries of mine existence, this marketh the first occasion my father hath asked of me a boon."},{"name":"HRAESVELGR","text":"A gift of gratitude and, mayhap, of atonement, for those who would face the deadly foe he left behind..."},{"name":"HRAESVELGR","text":"...Will he remain in slumber?"},{"name":"HRAESVELGR","text":"'Tis likely, little one. What is but a fleeting respite for my sire might last a lesser creature's lifetime."},{"name":"HRAESVELGR","text":"But let not thy heart be troubled. Even in dream, he doth keep his mind's eye upon the fate of this star."},{"name":"HRAESVELGR","text":"He is possessed of remarkable...hmmm. “Devotion” is mayhap the closest word in the tongue of men."},{"name":"HRAESVELGR","text":"His love is as boundless as the sea of stars, across which he carried his unhatched brood."},{"name":"HRAESVELGR","text":"It did sustain him even as the arduous journey exhausted the fire in his mane. And when he at last arrived upon Hydaelyn, a sanctuary for his children, did he form with this land an irreplaceable bond."},{"name":"HRAESVELGR","text":"Enough─I have spoken overmuch. But I will praise your victory...as my father would surely wish to were he here."},{"name":"BIGGS","text":"Ouch...that cut's opened up again. But I'm glad we reached you in time!"},{"name":"WEDGE","text":"Did you see the Yawn!? It's just a big hole again!"},{"name":"ALPHA","text":"Kwe-kweh..."},{"name":"CID","text":"Well, I can add “being rescued by a great wyrm” to the list of things I didn't expect to happen today."},{"name":"CID","text":"It was fortunate Hraesvelgr agreed to come for us. We had to defeat Omega at any cost, of course, but I much prefer being alive to celebrate the deed!"}],"reward":{"gil":7500,"instance":30072},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68691]},"next":[68693]},"partials":[{"type":"npc","id":"1026450","obj":{"i":1026450,"n":"Cid","l":2284,"q":2}},{"type":"npc","id":"1021937","obj":{"i":1021937,"n":"Cid","l":2406,"q":3}},{"type":"instance","id":"30071","obj":{"i":30071,"n":"Alphascape V3.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":355}},{"type":"instance","id":"30072","obj":{"i":30072,"n":"Alphascape V4.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":355}},{"type":"quest","id":"68691","obj":{"i":68691,"n":"And Like Fire Was His Mane","g":19,"l":"The Interdimensional Rift","s":21,"f":1}},{"type":"quest","id":"68693","obj":{"i":68693,"n":"To Kweh under Distant Skies","g":19,"l":"The Fringes","s":23,"f":1}}]}