{"quest":{"name":"The Man in Black","location":"Ul'dah","id":68694,"patch":4.56,"sort":130,"icon":100831,"eventIcon":71221,"issuer":1026849,"target":1026849,"genre":207,"journal":["Kipih Jakkya has caught the scent of a story and needs help chasing it down.<br>※This quest is available for a limited time only.","Kipih Jakkya, reporter for <span class=\"emphasis\">The Raven</span>, tells you about a rumor that has been making its rounds of late. Apparently, an unusual black vehicle has been sighted in Thanalan along with peculiar mechanical soldiers, and there is growing concern that they may be some unknown type of Garlean weaponry. Kipih petitions your assistance to pen her story, and in case you should be amenable, she directs you to the vicinity of Black Brush, where the black vehicle was most recently sighted.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","At Black Brush, you come upon the black vehicle and its owner, a young man by the name of Noctis, who appears to be very far from home. His vehicle, the Regalia, has broken down, and he is relieved to learn that you know people who might be able to repair it. Soon after, you are joined by a crew from Garlond Ironworks and Cid himself, who promises to do his best with the Regalia. It then transpires that not only is Noctis acquainted with the mechanical soldiers, which he calls magitek troopers, but that both he and his automated adversaries hail from a world entirely different from your own. At Cid's suggestion, Noctis goes off to search for the magitek troopers in hopes of finding a way to return home. Follow Noctis and help him to defeat the magitek troopers by participating in the FATE “Like Clockwork” at the Clutch in central Thanalan.","You and Noctis encounter a squad of magitek troopers and promptly vanquish them, along with a towering warmachina that had somehow managed to escape notice till now. The task thus concluded, Noctis turns his steps towards Black Brush, and you follow on his heels.","On the road, Noctis laments that while the enemies indeed came from his world, they offered no clues as to how he might make his way back. For now, the two of you decide to return to the Regalia before seeking further help.","After hearing about your battle with the magitek troopers, Cid expresses his interest in examining their technology, and bids you salvage their parts from future encounters. These parts may be delivered to one of the Ironworks hands posted at Black Brush and in each of the three city-states. Just as Cid is explaining that he had moved the Regalia to keep it away from prying eyes, Kipih Jakkya arrives on the scene and begins bombarding Noctis with questions. In exchange for receiving help to find his way home, Noctis agrees to an exclusive interview, and he sets out for Ul'dah with Kipih.","Arriving in Ul'dah at the interview's conclusion, you learn that Noctis had been traveling with his comrades on his way to meet his beloved fiancée. Satisfied with her harvest, Kipih reiterates her promise to help Noctis find the answers he seeks. At that moment, she receives a call from one of her colleagues, and turning back to you excitedly, she bids you and Noctis make ready for a journey on the trail of a hopeful lead."],"objectives":["Investigate the designated area in central Thanalan.","Participate in the FATE at the Unholy Heir.","Wait at the designated location.","Speak with Cid.","Speak with Kipih Jakkya in Ul'dah."],"dialogue":[{"name":"KIPIHJAKKYA","text":"Greetings, adventurer. I'm Kipih Jakkya, reporter for <span class=\"emphasis\">The Raven</span>, Gridania's leading tabloid. I'm hoping that I can rely on your kind assistance."},{"name":"KIPIHJAKKYA","text":"Greetings, adventurer! It's been a while.<br>...Hm? Do not tell me you've forgotten about Kipih Jakkya, reporter for <span class=\"emphasis\">The Raven</span>?"},{"name":"KIPIHJAKKYA","text":"You kindly helped me pen my feature article on the mysterious lady–knight, Lightning, and I'm hoping that I can rely on you once more."},{"name":"KIPIHJAKKYA","text":"You see, a certain rumor has been making its rounds of late."},{"name":"KIPIHJAKKYA","text":"No few travelers passing through Thanalan report seeing an unusual black vehicle along with peculiar mechanical soldiers. Do you happen to know anything about them?"},{"name":"KIPIHJAKKYA","text":"No? Let me tell you, then, that there is growing concern that they might be some unknown type of Garlean weaponry. Why, even the good people of Garlond Ironworks have been called upon to investigate."},{"name":"KIPIHJAKKYA","text":"This promises to be a most compelling story, and I intend to be the first reporter to tell it. But in order to do that, I require the contribution of good folk such as yourself."},{"name":"KIPIHJAKKYA","text":"Lest you wonder, the black vehicle was most recently sighted near Black Brush, in central Thanalan. Should you come into any information, I ask that you bring me word without delay!"},{"name":"KIPIHJAKKYA","text":"The most recent sightings of the black vehicle took place near Black Brush, in central Thanalan. Should you come into any information, I ask that you bring me word without delay!"},{"name":"NOCTIS","text":"(-Young Man's Voice-)Gah! Why won't you move, damn it?"},{"name":"NOCTIS","text":"(-Man in Black-)Hey, do you know if there's a garage nearby?"},{"name":"NOCTIS","text":"(-Man in Black-)&lt;sigh&gt; Just my luck to have a breakdown in the middle of nowhere... What is this place, anyway?"},{"name":"NOCTIS","text":"(-Man in Black-)Thanalan? Eorzea? That's on no map I've ever seen."},{"name":"NOCTIS","text":"(-Man in Black-)I'm not sure how I got here, and I've got no idea where I need to go...but I'm going nowhere at this rate. Isn't there anyone around here who can fix cars?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Garlond Ironworks might be able to handle it."},{"name":"A1","text":"If anyone can get you moving, it'll be Cid."},{"name":"NOCTIS","text":"(-Man in Black-)Seriously!? Man, what a relief..."},{"name":"NOCTIS","text":"(-Man in Black-)Wait, what? <span class=\"emphasis\">Cid</span> is here too!? What in the world's going on...?"},{"name":"NOCTIS","text":"(-Man in Black-)Anyway, might as well keep pushing her along."},{"name":"NOCTIS","text":"(-Man in Black-)Hey, mind giving me a hand? She's heavier than she looks."},{"name":"NOCTIS","text":"(-Man in Black-)What's your name, by the way?"},{"name":"NOCTIS","text":"Appreciate the help, <span class=\"highlight\">Forename</span>. My name's Noctis, but you can call me Noct."},{"name":"NOCTIS","text":"And now that we're introduced, let's put our backs into it. &lt;sigh&gt; Talk about deja vu... Un. Believable."},{"name":"GARLONDIRONWORKSEMPLOYEESA","text":"Oho, if it isn't <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>!"},{"name":"GARLONDIRONWORKSEMPLOYEESA","text":"B-By the gods, she's magnificent! Such elegance, such refinement!"},{"name":"GARLONDIRONWORKSEMPLOYEESA","text":"Ah, as you may have heard, we were tasked by the Alliance with investigating the mystery vehicle."},{"name":"GARLONDIRONWORKSEMPLOYEESA","text":"Master Cid himself should be close. If you'll excuse me a moment, I will direct him hither."},{"name":"CID","text":"<span class=\"highlight\">Forename</span>! Why am I not surprised that you're here already?"},{"name":"CID","text":"So this is the machine... At a glance, it doesn't appear to be of Garlean make."},{"name":"CID","text":"The young fellow there─I take it he's the owner?"},{"name":"CID","text":"And Noctis doesn't seem to know anything about Eorzea, you say? Peculiar..."},{"name":"CID","text":"Might he have lost his memories like I did?"},{"name":"NOCTIS","text":"Hey, I'm right here, you know? Now, if you're done talking about me─you're Cid, right?"},{"name":"NOCTIS","text":"Not quite the Cid I was expecting, but if you can fix the Regalia, then it's all good."},{"name":"CID","text":"I will be honest with you: this is technology I am unfamiliar with. I can't make any promises, but I will try my best."},{"name":"NOCTIS","text":"Appreciate it. There's...er, just one little problem. I don't have any money."},{"name":"CID","text":"Never you mind that. To be able to work on a unique machine such as this is its own reward."},{"name":"NOCTIS","text":"Seriously? You're a lifesaver!"},{"name":"CID","text":"Oh, and <span class=\"highlight\">Forename</span>. I trust you also heard about the mechanical soldiers."},{"name":"CID","text":"We're tasked with investigating them as well. By all accounts, they appear to be simply men, albeit armored head to toe and bearing advanced firearms. What betrays them is the unnatural efficiency with which they move."},{"name":"NOCTIS","text":"Sounds like MTs to me."},{"name":"CID","text":"Em-tees?"},{"name":"NOCTIS","text":"Magitek troopers. Robotic soldiers created by the Niflheim Empire."},{"name":"NOCTIS","text":"Come to think of it, the last thing I remember is being at a Niff base. It's kinda hazy...but there was a strange machine. And before I knew it, I was here, in this place you call Eorzea."},{"name":"CID","text":"That's quite an unusual tale, but then again I'm in the presence of unusual technology. I have no reason to doubt your words. You may have inadvertently activated a teleportation device and been sent to our world."},{"name":"CID","text":"At any rate, you seem to be acquainted with these mechanical soldiers. Perhaps you could investigate in our stead? They were most recently sighted near the Unholy Heir, not far to the east of here."},{"name":"NOCTIS","text":"Hmmm... If they really are MTs, they might hold some clue on how to return home..."},{"name":"NOCTIS","text":"Alright, leave them to me."},{"name":"CID","text":"W-Wait!"},{"name":"CID","text":"It wouldn't do to leave our visitor to wander a strange land alone. Could you accompany him, <span class=\"highlight\">Forename</span>? Rest assured I'll tend to the Regalia in the meantime."},{"name":"CID","text":"Go on and follow Noctis, my friend. Rest assured I'll tend to the Regalia in the meantime."},{"name":"NOCTIS","text":"MTs, just as I thought. And a magitek armor to boot. They must have crossed over when I did."},{"name":"NOCTIS","text":"But I couldn't find any clues on how I might cross back. Gah, what am I supposed to do now?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Let's consult Cid."},{"name":"A2","text":"Let's consult Kipih."},{"name":"NOCTIS","text":"That old geezer? Well, he did seem to know his stuff."},{"name":"NOCTIS","text":"A reporter? That's...actually not a bad idea. She's bound to have loads of connections."},{"name":"NOCTIS","text":"You're coming along, right? Let's go check in on the Regalia."},{"name":"CID","text":"So, how fared you? Were you able to find the mechanical soldiers?"},{"name":"CID","text":"You <span class=\"emphasis\">fought</span> them!? So the rumors were true..."},{"name":"CID","text":"That being the case, I would very much like to examine the technology with my own eyes."},{"name":"CID","text":"I have a favor to ask, <span class=\"highlight\">Forename</span>. The next time you encounter these soldiers, could you salvage their parts?"},{"name":"GARLONDIRONWORKSRESEARCHER03158","text":"Ahem! <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, may I ask that you bring said parts to either myself or my colleagues in the three city-states?"},{"name":"GARLONDIRONWORKSRESEARCHER03158","text":"We will pass them along to the chief─<span class=\"emphasis\">after</span> he has completed his long list of outstanding tasks!"},{"name":"NOCTIS","text":"Hey, where's my car?"},{"name":"CID","text":"Don't worry, she's in a safe place. A reporter came sniffing about while you were away, so I decided to move her to the Dispatch Yard that we might carry out the repairs undisturbed."},{"name":"CID","text":"I'm pleased to say I was able to identify the problem, and I believe it can be fixed. However, it may take some time to fashion the replacement part."},{"name":"NOCTIS","text":"I see. That's good to know."},{"name":"KIPIHJAKKYA","text":"(-Woman's Voice-)&lt;gasp&gt; You must be the mystery man!"},{"name":"KIPIHJAKKYA","text":"Ooh, I'm no fashion correspondent, but I like your look! A simple silhouette with an emphasis on the details!"},{"name":"NOCTIS","text":"What's the deal with you?"},{"name":"KIPIHJAKKYA","text":"Ah, where are my manners? Kipih Jakkya, reporter for <span class=\"emphasis\">The Raven</span>, at your service!"},{"name":"KIPIHJAKKYA","text":"You <span class=\"emphasis\">are</span> the owner of the mysterious black vehicle, yes?"},{"name":"NOCTIS","text":"What, you mean the Regalia?"},{"name":"KIPIHJAKKYA","text":"The Rega... I beg your pardon?"},{"name":"NOCTIS","text":"Re-ga-lia."},{"name":"KIPIHJAKKYA","text":"Ah, so that's what she's called! A stately name!"},{"name":"KIPIHJAKKYA","text":"She's like nothing anyone has ever seen in Eorzea. May I ask where you hail from and how you came to be here?"},{"name":"NOCTIS","text":"I'm from...far away. I was on a journey. We were fighting. Then suddenly I was here."},{"name":"NOCTIS","text":"I really need to find my way back. There's so much I have to do..."},{"name":"KIPIHJAKKYA","text":"A mysterious young man, come from another world, desperately seeking a way home... A promising premise! Now then, may I ask what manner of journey you were on?"},{"name":"NOCTIS","text":"Well, I was traveling with my friends. We were on our way to meet...someone important to me."},{"name":"KIPIHJAKKYA","text":"Someone <span class=\"emphasis\">important</span> to you? Could you please elaborate on the nature of your relationship with this individual?"},{"name":"NOCTIS","text":"H-Hold on just a second. You're not the only one with questions, you know. I've got loads of my own."},{"name":"KIPIHJAKKYA","text":"Well, sir, <span class=\"emphasis\">The Raven</span> has many eyes and ears, and I would be happy to call upon them all for the answers you seek─if you'll agree to grant me an exclusive interview!"},{"name":"NOCTIS","text":"Yeah, sure, whatever."},{"name":"KIPIHJAKKYA","text":"Then it's settled! If you would accompany me to Ul'dah, we may continue our conversation while I put my connections to work."},{"name":"NOCTIS","text":"Whew... That wasn't an interview─it was an <span class=\"emphasis\">interrogation</span>."},{"name":"CID","text":"I'll begin working on the replacement part for the Regalia, but it will take a while. Feel free to go about your own business in the meantime."},{"name":"KIPIHJAKKYA","text":"Noctis was very cooperative, and I have lots of juicy morsels for my feature article. Lest you wonder, he was on his way to meet his beloved fiancée."},{"name":"KIPIHJAKKYA","text":"Will the two sweethearts be reunited? With such a timeless tale of romance, the next edition of <span class=\"emphasis\">The Raven</span> is certain to fly off the stands!"},{"name":"KIPIHJAKKYA","text":"C-Come now, don't look at me so. It's been so long since I last graced the front page. And as promised, I will help Noctis find the answers he seeks."},{"name":"KIPIHJAKKYA","text":"I've already put the word out to my colleagues, and I expect to hear back from them any moment now."},{"name":"KIPIHJAKKYA","text":"Ah, speak of the devil!<br>...Yes, Kipih here. What do you have for me?"},{"name":"KIPIHJAKKYA","text":"...Truly!? Thank you so much!"},{"name":"KIPIHJAKKYA","text":"See, what did I tell you? We have a hopeful lead!"},{"name":"KIPIHJAKKYA","text":"We'll need to take a little trip together, the three of us. See to your preparations and let me know when you're ready to depart!"},{"name":"SYSTEM","text":"The FATE “Like Clockwork” will appear at the Clutch in central Thanalan over the course of the seasonal event."},{"name":"SYSTEM","text":"Completing this FATE will reward players with pieces of unidentified magitek."},{"name":"SYSTEM","text":"These items may be exchanged for various goods by speaking with an Ironworks hand."},{"name":"SYSTEM","text":"Ironworks hands are posted at Black Brush and in each of the three city-states."}],"reward":{"gil":1080,"items":[{"id":24609}]},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]},"next":[68695]},"partials":[{"type":"npc","id":"1026849","obj":{"i":1026849,"n":"Kipih Jakkya","l":40,"q":2}},{"type":"item","id":"24609","obj":{"i":24609,"n":"Lucian Prince's Fingerless Glove","l":1,"c":44658,"t":37,"p":94}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"68695","obj":{"i":68695,"n":"In the Dark of Night","g":207,"l":"Ul'dah","s":131}}]}