{"quest":{"name":"And Like Fire Was His Mane","location":"The Interdimensional Rift","id":68691,"patch":4.4,"sort":21,"icon":112313,"unlocksFunction":1,"eventIcon":71341,"issuer":1026452,"target":1026450,"genre":19,"journal":["Cid has vanished from view, but his voice is clear and strong.","Cid's voice addresses you from thin air, but even as he explains the reason for his invisibility, the engineer suddenly pops back into view. After recovering from this brief and unexpected diversion, Cid continues to share his thoughts on your next opponent, and proposes that he concentrate on devising a strategy for the inevitable confrontation with Omega. Meanwhile, you are to prepare to re-enter the test world, where the “supplementary” experiment is to take place. Within awaits a most formidable foe─a recreation of the legendary Midgardsormr himself!<br><br>※Alphascape V2.0 can be accessed via the Duty Finder.","You have laid low the mighty Father of Dragons. Cid and Alpha await your return back at the expedition's base camp.<br><br>※In the event that you leave the Interdimensional Rift, you may re-enter by speaking with the Ironworks hand at the Yawn.","Still shaken by the spectacle of the battle, Cid commends you on your victory against the replicated Midgardsormr. The engineer's praise leads into a discussion about the similarities between your vanquished opponent and the primal Shinryu, with Cid musing that fate had a hand in the decision to awaken Omega. It seems the machine's connection to Midgardsormr arose from conflict on a distant star in the distant past, but it is the salvation of the immediate future which concerns you now..."],"objectives":["Enter Alphascape V2.0.","Speak with Cid."],"dialogue":[{"name":"ALPHA","text":"Kweh!"},{"name":"GARLONDGATEKEEPER","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Will you be descending into the Yawn?"},{"name":"SYSTEM","text":"Enter the Interdimensional Rift?"},{"name":"CID","text":"My apologies. 'Twas not my intention to undermine the gravity of the situation with this...diversion."},{"name":"CID","text":"I'd noticed the kettle was boiled, and thought some tea would soothe my nerves. I poured myself a cup, and was halfway through drinking it before I realized my hand─not to mention the rest of me─had turned invisible."},{"name":"CID","text":"I understand the situation is unsettling, but I assure you I can still work unimpeded! Now, we had best discuss how to approach─"},{"name":"CID","text":"I... Oh. It seems to have worn off."},{"name":"ALPHA","text":"Kweh. Kweh kweh..."},{"name":"CID","text":"Now, now, you're not to blame. I did ask you to fill the kettle, after all."},{"name":"CID","text":"And I'd forgotten what Nero had said about your card producing water with, uh, unexpected properties. Although it seems the effects were rather different this time..."},{"name":"CID","text":"In any case, 'twas pleasant to have a distraction from our greater woes, however brief. We'll set the rest of the water aside for now, and decide what to do with it later."},{"name":"CID","text":"Right, <span class=\"highlight\">Forename</span>. We need to talk about your forthcoming contest with Midgardsormr."},{"name":"CID","text":"Watching through the monitor, I could see that this wyrm appeared different to the one we know."},{"name":"CID","text":"From everything we've heard thus far, it seems that Omega and Midgardsormr both hail from different stars─two distant worlds at war with one another."},{"name":"CID","text":"As a result of that conflict, the wyrm was forced to gather his offspring and leave his home behind. And after evading Omega's pursuit over the course of an unimaginable journey, the Father of Dragons arrived here on our world."},{"name":"CID","text":"I'm assuming the entity you're to face is a younger, more vital Midgardsormr─just as he was when Omega first encountered him, thousands of years in the past. A formidable foe, indeed..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Even so, I must find a way to defeat him..."},{"name":"A2","text":"I fought him once at the Keeper of the Lake, but..."},{"name":"CID","text":"Aye. Hopefully Omega's “imperfect” data will contain a flaw we can exploit..."},{"name":"CID","text":"Wait, you've fought against Midgardsormr before!? ...But, yes, I think I see your concern. 'Twould be unwise to treat this as the same opponent, considering how different they might possibly be."},{"name":"CID","text":"It certainly doesn't help matters that Omega's little surprise isn't registered as an official test subject. I can't even use the terminals to search for the most basic information."},{"name":"CID","text":"With that in mind, <span class=\"highlight\">Forename</span>, I have a proposal: I wish to leave the completion of this “supplemental stage” entirely in your heroic hands."},{"name":"CID","text":"Rather than twiddle my thumbs whilst you prepare to contend with the dragon, I mean instead to work on a strategy for our inevitable confrontation with Omega."},{"name":"CID","text":"And then, my friend, we will put a stop to this mad machine once and for all!"},{"name":"CID","text":"I'm glad we're in agreement. I'll ready my tools and you ready yours─you've a wyrm to slay!"},{"name":"CID","text":"Watch yourself in there, <span class=\"highlight\">Forename</span>. The underlying data may be imperfect, but I recall Omega saying something about the battle ending only when one of you is dead. Expect no quarter and give none."},{"name":"ALPHA","text":"Kweh..."},{"name":"ALPHA","text":"Kweh-kweh!"},{"name":"CID","text":"Another stunning victory, <span class=\"highlight\">Forename</span>! I felt the breath catch in my throat on more than one occasion!"},{"name":"CID","text":"...Yet even as I watched the battle rage, I was struck by an idle thought. Did you notice the resemblance between Midgardsormr and Shinryu?"},{"name":"CID","text":"Unlike most primals, Shinryu's form had no basis in any system of belief. I've heard the theory that the summoner was simply influenced by the majesty and power of the elder primal Bahamut."},{"name":"CID","text":"But now, I'm beginning to think there might be another explanation─that the primal took its shape from the ancestor of all dragons on Hydaelyn."},{"name":"CID","text":"The widely held concept of how a dragon appears has, for centuries upon centuries, been rooted in depictions of Midgardsormr. The summoner may not have even sought to imitate him specifically."},{"name":"CID","text":"Subconscious thoughts and memories alone could have guided the similarity. Not that I have any way of confirming this theory, of course..."},{"name":"CID","text":"Nevertheless, 'tis interesting that Shinryu's summoning should lead us to awakening Omega. A strange twist of fate, when you consider the machine's connection to Midgardsormr."},{"name":"CID","text":"Well, whatever else destiny has in store, you've already bested the opponent that Omega itself failed to overcome. A feat worthy of celebration, I'd say!"}],"reward":{"gil":3000,"items":[{"id":24309}],"instance":30070},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68690]},"next":[68692]},"partials":[{"type":"npc","id":"1026452","obj":{"i":1026452,"n":"Cid","l":2284,"q":1}},{"type":"npc","id":"1026450","obj":{"i":1026450,"n":"Cid","l":2284,"q":2}},{"type":"item","id":"24309","obj":{"i":24309,"n":"Deltascape Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"30070","obj":{"i":30070,"n":"Alphascape V2.0","c":61802,"t":"Raids","min_lvl":70,"max_lvl":70,"min_ilvl":355}},{"type":"quest","id":"68690","obj":{"i":68690,"n":"In the Beginning, There Was Chaos","g":19,"l":"Rhalgr's Reach","s":20,"f":1}},{"type":"quest","id":"68692","obj":{"i":68692,"n":"In the End, There Is Omega","g":19,"l":"The Interdimensional Rift","s":22,"f":1}}]}