{"quest":{"name":"Ruby Seas under Ruby Skies","location":"Kugane","id":68698,"patch":4.56,"sort":2,"icon":100837,"eventIcon":71221,"issuer":1026388,"target":1026401,"genre":64,"journal":["J'olhmyn is more than ready to set to tracking Nhaza'a Jaab across the sea.","You speak with J'olhmyn, who has little patience for delays─particularly those that come in the form of M'zhet. She dashes off toward the Ruby Price almost the instant you suggest it as a likely spot to find eyewitnesses, leaving him struggling to keep up.","You meet with J'olhmyn and M'zhet, the latter of whom seems to have recovered his senses, if not his good sense. As time is of the essence, the former suggests that the three of you split up to more efficiently speak with those manning the Ruby Price and search for any other clues that may be present in the vicinity.","Though you speak with several people zealously undertaking their duties at the Ruby Price, they assure you that no one matching Nhaza'a Jaab's description has passed through the area. Disappointing though the result may be, it at least narrows the range of potential routes he may have taken across the Ruby Sea.","Midway through reporting the results─or notable lack thereof─of your investigation to J'olhmyn, you hear M'zhet's scream ring through the salty air. Rushing to its source, you find him being menaced by none other than Kabuto, who has evidently mistaken him for the man who stole Tsukumo─or rather, the materia that once was the kami's soul─right from the Kojin's helmet. Thankfully, your presence causes him to realize his error sooner rather than later, and the initial misunderstanding is soon forgotten. As it appears that the one who purloined Tsukumo and Alpa's kidnapper are one and the same, Kabuto eagerly joins you in your continued search for Nhaza'a Jaab.","On Kabuto's recommendation, you make your way to the fishing village of Isari, again in search of eyewitnesses. Perhaps your inquiries will bear more fruit this time around.","Upon questioning, one of the villagers claims to have seen a man with the characteristics you describe. Though he was apparently not accompanied by a mermaid, given the rarity of Miqo'te in the Far East and the man in question's peculiar fashion sense, it is all but certain that Nhaza'a Jaab indeed passed through Isari, and thereafter headed for either the Azim Steppe or Yanxia. Though the other fisherfolk can provide you with no additional information as to the villain's whereabouts, one man does mention a curious legend of potential note─that of the Three Wonders. According to the fisherman, these mythical treasures─which include the flesh of a mermaid─have been the subject of much gossip of late, as a certain noble lady has made their provision a requirement of those who would claim her hand in marriage.","As you discuss your findings with your companions, Kabuto reveals that he is familiar with folklore regarding the Three Wonders, and that, in addition to Merflesh, the Jewel of Fair Souls and the Philosopher's Fin are counted among their number. He and J'olhmyn theorize that, due to Alpa's oft-remarked-upon resemblance to a mermaid of Far Eastern legend and Tsukumo's rare nature, it may be possible to pass them off as two of the three treasures to a gullible recipient. What Nhaza'a Jaab's ultimate goal in doing so might be remains shrouded in mystery, but if he is indeed collecting counterfeits of the Wonders, it is imperative that Alpa be rescued before her flesh can be separated from her person."],"objectives":["Speak with J'olhmyn at the Ruby Price.","Speak with potential eyewitnesses at the Ruby Price.","Report to J'olhmyn.","Speak with J'olhmyn.","Speak with potential eyewitnesses in Isari.","Report to J'olhmyn."],"dialogue":[{"name":"JOLHMYN","text":"Grrr... Just wait till I get my hands on that Nhaza'a Jaab! At least we have some idea where he's heading with Alpa, thanks to M'zhet. "},{"name":"JOLHMYN","text":"I've decided to reward him by not pushing him into the sea, even though he's making it so very tempting. More importantly, where do you reckon we should start our search?"},{"name":"JOLHMYN","text":"They likely passed by the Ruby Price? Well, what are we waiting for?"},{"name":"MZHETTIA","text":"J'olhmyn!? Where are you going?"},{"name":"MZHETTIA","text":"(“Just compliment her like a normal person”? It's my first time seeing her wear anything but armor! What do you want from me?)"},{"name":"JOLHMYN","text":"Right. Now that we're here, let's split up and ask whether anyone has seen a masked Miqo'te and a “mermaid” about."},{"name":"MZHETTIA","text":"An excellent plan! Aaah, it's nice to have everything back to normal."},{"name":"JOLHMYN","text":"This had better not be about my attire again... If you hadn't noticed, Alpa has been <span class=\"emphasis\">kidnapped</span> by a <span class=\"emphasis\">masked maniac</span>, so go find some eyewitnesses before I change my mind about drowning you!"},{"name":"MZHETTIA","text":"I never did get to tell her that her swimsuit was fetching, but at least I managed not to make a fool of myself!"},{"name":"GUARDA03162","text":"Keep your distance─we wouldn't want you carelessly firing the cannon. Only I get to do that."},{"name":"GUARDB03162","text":"Nothing to report! At least not to you─I don't even know you."},{"name":"MZHETTIA","text":"Finding Alpa is my first priority! What, can't you tell?"},{"name":"GUARDA03162","text":"A man wearing a sinister mask?"},{"name":"GUARDA03162","text":"He certainly hasn't passed through here. I would know─I've been looking for suspicious persons to fire at <span class=\"emphasis\">all <span class=\"alternative-container\"><span class=\"alternative\">day</span><span class=\"alternative\">night</span><span class=\"alternative\">morning</span></span></span>."},{"name":"GUARDB03162","text":"A suspicious man with a...mermaid?"},{"name":"GUARDB03162","text":"Hahaha, very funny! You Westerners and your jokes..."},{"name":"JOLHMYN","text":"Let me know if you learn anything. Unlike some people, locating Alpa is my only concern right now."},{"name":"MZHETTIA","text":"This is infuriating! No sign of any boats captained by brutish Miqo'te, nor whispers of one having passed by previously. Now I see why J'olhmyn is so annoyed!"},{"name":"GUARDA03162","text":"Still no sign of your masked man..."},{"name":"GUARDA03162","text":"But if he does pass through here, you can be certain that I'll blast him without hesitation! "},{"name":"GUARDB03162","text":"Mermaids again?"},{"name":"GUARDB03162","text":"Hahaha, it's even funnier the second time! But seriously, get out of my sight or I'll hurl you into the ocean."},{"name":"JOLHMYN","text":"Any luck?"},{"name":"JOLHMYN","text":"You too, huh? It seems we've hit a dead end here. I haven't the slightest idea what to do now, though..."},{"name":"MZHETTIA","text":"Waaauuugh!"},{"name":"JOLHMYN","text":"What has he gotten himself into this time? Come on, <span class=\"highlight\">Forename</span>!"},{"name":"MZHETTIA","text":"What is the meaning of this!? First you burst out of the water like some sort of sea monster, and now you threaten me with a blade? I don't even know who you are! Or <span class=\"emphasis\">what</span> you are!"},{"name":"KABUTO","text":"You know not what you stole from me, but you <span class=\"emphasis\">shall</span> come to regret it! Tsukumo is more precious than any treasure. Return him at once!"},{"name":"MZHETTIA","text":"Help me, <span class=\"highlight\">Forename</span>! I'm being beset by this...er, turtle? Man? Turtle man!"},{"name":"KABUTO","text":"<span class=\"highlight\">Forename</span>!? What an odd coincidence."},{"name":"KABUTO","text":"Or not a coincidence at all, since you two seem to know each other. In which case, you have my apologies. I should not have drawn my blade without preamble."},{"name":"MZHETTIA","text":"Think nothing of it! As the future leader of the M tribe, I was not at all alarmed by your sudden, menacing advance. Not in the least!"},{"name":"MZHETTIA","text":"I'm M'zhet Tia, by the way. And any friend of <span class=\"highlight\">Forename</span>'s is a friend of mine!"},{"name":"KABUTO","text":"I am honored to meet you. My name is Kabuto, and I lead the Blue's Divine Circle."},{"name":"JOLHMYN","text":"The name's J'olhmyn─I'm with the Velodyna Gatekeepers in Ala Mhigo. Can I ask why you were on the point of skewering M'zhet?"},{"name":"KABUTO","text":"Ah. In my haste, I unfortunately mistook him for a thief who recently snatched Tsukumo from my helmet."},{"name":"MZHETTIA","text":"What, precisely, is this “Tsukumo”? You seem rather keen on getting it back."},{"name":"KABUTO","text":"Tsukumo is my dearest companion and guide, who once walked beside me as a karakuri puppet blessed with a soul. He is now present only as materia, but continues to watch over me."},{"name":"JOLHMYN","text":"Wait, wasn't Nhaza'a holding something that looked an awful lot like materia when we saw him at the hot springs? Could that have been Tsukumo?"},{"name":"JOLHMYN","text":"If so, it would mean that he robbed Kabuto before kidnapping Alpa─and that we almost certainly won't find him on the Ruby Sea."},{"name":"MZHETTIA","text":"But why not?"},{"name":"JOLHMYN","text":"If it were me, I wouldn't want to risk my prize being retaken by its rightful owner─and fending Kabuto off would be a sight more difficult with Alpa in tow. I'd put money on Nhaza'a having made for land as quickly as possible."},{"name":"KABUTO","text":"A reasonable conclusion. Assuming he was headed for Othard, the most direct route would have taken him through the village of Isari."},{"name":"JOLHMYN","text":"To Isari we go, then! We'll follow your lead, Kabuto."},{"name":"JOLHMYN","text":"What a charming little fishing village. Would that we were here for some relaxing sightseeing."},{"name":"JOLHMYN","text":"But we have a villain to catch and a captain to save, so let's get to it! Meet me back here once you've gathered as much information as you can."},{"name":"KABUTO","text":"I must retrieve Tsukumo at all costs."},{"name":"MZHETTIA","text":"How to best explain the situation... Perhaps I should start with Alpa. So, Alpa is an Ananta─wait, so an Ananta is a sort of person, like a mermaid, but not really..."},{"name":"ISARIVILLAGERA03162","text":"A masked man carrying a mermaid? Frankly, I'm not even sure I could imagine such a sight, and I certainly haven't witnessed it."},{"name":"ISARIVILLAGERA03162","text":"I did see a man with a curious mask, though. He made landfall in a small boat, and I assume departed on foot soon thereafter, as I haven't seen him since. I'd wager that he made for the Azim Steppe or Yanxia, like most who pass through here."},{"name":"ISARIVILLAGERB03162","text":"A suspicious man, and a mermaid with 'im?"},{"name":"ISARIVILLAGERB03162","text":"No, there ain't many suspicious sorts coming 'round our little village. And you'll pardon me for sayin' so, but it don't seem likely that a mermaid would keep such company."},{"name":"ISARIVILLAGERC03162","text":"Hmm... I haven't seen your mystery man, but I can tell you that mermaids have been a subject of some discussion around here as of late."},{"name":"ISARIVILLAGERC03162","text":"You see, local legend has it that somewhere out there, far from the sight and grasp of the ordinary man, are what we Hingans call the “Three Wonders,” mermaid's flesh being one. It is said to grant life eternal, be that for better or for worse."},{"name":"ISARIVILLAGERC03162","text":"A few moons past, a young lady born to one of Kugane's oldest─and wealthiest─families proclaimed that, should any gentleman presume to ask for her hand in marriage, she would accept nothing less than all Three Wonders as a dowry."},{"name":"ISARIVILLAGERC03162","text":"It's a fool's errand, certain enough─we Hingans love our faerie stories as well as any folk, but we know the Three Wonders are no more than fantasy. You have to admire her clever ploy to remain unwed, though, which is why it's the talk of the land."},{"name":"JOLHMYN","text":"We need to cast a wide net, so let's spread out and speak to everyone. Make sure to really grill the local fishermen."},{"name":"JOLHMYN","text":"Now that we're all back, let's share what we've learned. Hopefully between the four of us we'll have heard enough to go on."},{"name":"JOLHMYN","text":"Hmm, so though Nhaza'a was indeed sighted, no one can confirm which direction he departed in. And, if your source is correct, Alpa is no longer with him. Did he stash her somewhere before landing in Isari? And where is he now?"},{"name":"KABUTO","text":"The Three Wonders may provide a clue. According to folklore, the treasures are Merflesh, the Jewel of Fair Souls, and the Philosopher's Fin."},{"name":"JOLHMYN","text":"I shudder to think of the young lady being forced to marry Nhaza'a of all people, but based on his thefts so far, it does seem like he is collecting the Wonders─or treasures with passing similarity to them, at least."},{"name":"KABUTO","text":"Indeed. If Tsukumo is his substitute for the Jewel of Fair Souls, and your Alpa is meant to be the source of Merflesh, that leaves only one."},{"name":"MZHETTIA","text":"“Flesh” certainly implies a level of dismemberment that I'm not comfortable with. We have to stop him!"},{"name":"JOLHMYN","text":"Yes, I realize that! If you have any brilliant ideas as to <span class=\"emphasis\">how</span>, now's the time─we can't allow him to stay one step ahead of us."},{"name":"ISARIVILLAGERA03162","text":"Assuming your masked man is the same one I saw, he likely headed for the Azim Steppe or Yanxia."},{"name":"ISARIVILLAGERA03162","text":"I wish he'd had the mermaid with him, too─that must have been a sight to see!"},{"name":"ISARIVILLAGERB03162","text":"Nope, I ain't never in my life seen a man like the one in your tale. Sounds right unsavory."},{"name":"ISARIVILLAGERB03162","text":"An' the thought of a mermaid bein' with him is downright unbelievable! They ain't about to hang around with riffraff."},{"name":"ISARIVILLAGERC03162","text":"Hm? Oh, the young lady?"},{"name":"ISARIVILLAGERC03162","text":"I hear she is a maiden of extraordinary beauty, born into wealth and power. And if the tales of her setting her suitors to such an impossible task are true, she's sharp as they come, as well."},{"name":"ISARIVILLAGERC03162","text":"It makes no difference, though. The Three Wonders are the stuff of legend, and legend alone, so none will have her hand, no matter how they pine."},{"name":"ISARIVILLAGERC03162","text":"So don't get any ideas, you hear?"}],"reward":{"gil":934},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68697]},"next":[68699]},"partials":[{"type":"npc","id":"1026388","obj":{"i":1026388,"n":"J'olhmyn","l":2404,"q":1}},{"type":"npc","id":"1026401","obj":{"i":1026401,"n":"J'olhmyn","l":2409,"q":2}},{"type":"quest","id":"68697","obj":{"i":68697,"n":"The Ananta Maid's Tail","g":64,"l":"Kugane","s":1}},{"type":"quest","id":"68699","obj":{"i":68699,"n":"Fish in a Barrel","g":64,"l":"The Ruby Sea","s":3}}]}