{"quest":{"name":"The Fifth Lord","location":"The Ruby Sea","id":68702,"patch":4.5,"sort":332,"icon":100818,"unlocksFunction":1,"eventIcon":71341,"issuer":1026581,"target":1019178,"genre":22,"journal":["The fate of the Ruby Sea hangs in the balance, and Seiryu is eager to play his part.","Restored to his former self and wholly aware of the dire circumstances, Seiryu departs with all due haste for Reisen Temple. With luck, you and he will not be too late to prevent the mad auspice Koryu from breaking free...","You, Tataru, and Soroban stand by as the Four Lords bring their combined power to bear against Koryu, and for a moment, all proceeds according to plan. Alas, relief soon gives way to despair as the restored wards shatter, and the mad auspice emerges from the sacred crystal, the picture of rage personified. In a flash, he dispatches Genbu, and with him the last vestiges of hope. Your fates all but sealed, you join with the surviving auspices in a valiant yet futile last stand...only to find yourselves in the company of the long-dead Tenzen. Yet even bolstered by the spirit's considerable strength, you are unable to beat back Koryu, until Soroban, in a noble act of sacrifice, summons the soul of the departed Genbu into his body that the resurrected auspice might turn the tide, and together with you and his comrades imprison Koryu for millennia to come.","The Ruby Sea and her people shall live to see another day, but not without cost, for Soroban is no more...or is he? It would seem that the Kojin's soul is possessed of immense spiritual strength, owing to his recent trials and tribulations. Accordingly, when he summoned Genbu's soul into his body, his own managed to endure; as a result, however, the auspice's resurrection is fleeting, and in time he will pass from this world as before. With his remaining time, he intends to train Soroban to succeed him as the next Genbu and take his place alongside his comrades as one of the Four Lords. Though he is by no means confident in his ability to rise to the occasion, the Kojin understands and appreciates the need for guardians to watch over the Ruby Sea, and is willing to do his best to live up to their expectations.","You go to each of Genbu's comrades in turn, who thank you for your assistance and muse on the unknown future. Byakko sees many battles in your future, and wishes you good fortune in the wars to come; Suzaku bids you come and visit again, for you will always hold a special place in her heart; Seiryu demands that you live long and grow strong, for he looks forward to a rematch. Parting words had, you rejoin a Tataru eager to receive the fabulous reward which first drew her to Hells' Lid.","The reward is indeed fabulous and more than makes up for the reckless purchase by a certain well-meaning youth that led you to pursue means by which you might replenish the coffers of the Scions of the Seventh Dawn in the first place. The collective is even willing to deliver the payment to the Ruby Bazaar in your stead, leaving you and Tataru to return to Tamamizu and inform Bunchin of Soroban's new role as a member of the Four Lords.","Bunchin is understandably surprised and saddened to hear that Soroban will not be returning to the village for quite some time, if not ever. Nevertheless, it fills him with pride to think that a Kojin of the Blue has been granted such a tremendous honor. Still, he cannot help but worry that Soroban might grow lonely in the days ahead, and so he asks that you make an effort to go and see him from time to time. And why would you not? For there are few places in the world one may enjoy the company of adorable and surly talking beasts!"],"objectives":["Speak with Genbu in Reisen Temple.","Speak with Genbu.","Speak with Byakko.","Speak with Suzaku.","Speak with Seiryu.","Speak with Soroban.","Speak with Bunchin in Tamamizu."],"dialogue":[{"name":"SEIRYU","text":"If Genbu left without us, then it can only mean that Koryu's return is imminent. Come, we must rejoin the others at Reisen Temple!"},{"name":"GENBU","text":"Oh, you are returned? But where is Seiryu?"},{"name":"TATARU","text":"I told you, <span class=\"highlight\">Forename</span>─we have everything under control! For now. Don't come back until you've set Seiryu straight."},{"name":"GENBU","text":"You are, as ever, a welcome sight, <span class=\"highlight\">Forename</span>."},{"name":"GENBU","text":"And you, Seiryu..."},{"name":"SEIRYU","text":"Forgive me, Genbu. I have been a great fool."},{"name":"GENBU","text":"As have we all many times before, and doubtless will be again."},{"name":"SEIRYU","text":"Nevertheless, forgive me."},{"name":"TATARU","text":"The wards are at their limit! You've got to come right away!"},{"name":"GENBU","text":"Then it is well that Seiryu has returned to the fold, for now we Four Lords may bring our united powers to bear against our foe!"},{"name":"GENBU","text":"Your part in this is finished, my friends. Now, you must go! Should we fail in this final endeavor, then the temple─nay, the whole of the Ruby Sea may be consumed by Koryu's wrathful fires!"},{"name":"TATARU","text":"Don't be stupid! We came to see this through to the end, and we'll do just that! That's the Scion way─right, <span class=\"highlight\">Forename</span>?"},{"name":"GENBU","text":"...If that is your will, so be it. Join us, then, and stand as witness to our deeds this day which will determine the fate of all that we hold dear!"},{"name":"GENBU","text":"Hold nothing in reserve! Summon all your strength! Only then can we hope to triumph over our mad brother!"},{"name":"SOROBAN","text":"It worked, I can feel it! The wards are mended, strengthened..."},{"name":"SEIRYU","text":"No, no, no! Even now, after everything we have endured, everything that has made us stronger─how can we fail!?"},{"name":"KOURYU","text":"ALL SHALL BUUUUUURN!!!"},{"name":"TATARU","text":"Genbu? Genbu!?"},{"name":"BYAKKO","text":"'Twill be impossible for us three alone to bind him, but we can hold him at bay for a time. Flee this place!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We cannot─we <span class=\"emphasis\">will</span> not!"},{"name":"A1","text":"Maybe you cannot bind him, but together we can defeat him!"},{"name":"BYAKKO","text":"Fool! A hero you may be, but Koryu is an opponent none can defeat!"},{"name":"KOURYU","text":"YOU... YOU! I KILLED YOU ONCE BEFORE, SAMURAI! I WILL KILL YOU AGAIN!"},{"name":"SUZAKU","text":"Ten...Tenzen!?"},{"name":"BYAKKO","text":"Brother, Sister! Now is our chance to restore the wards!"},{"name":"SEIRYU","text":"How!? Even in his weakened state, without Genbu, we do not stand a chance!"},{"name":"TATARU","text":"Soroban!? Come away from there, before you get hurt!"},{"name":"SOROBAN","text":"If I do not act, then our lives are forfeit anyway. Ours and everyone else in the Ruby Sea..."},{"name":"SEIRYU","text":"What is he doing!?"},{"name":"SUZAKU","text":"This is...this is the ritual he performed incorrectly before! When he summoned a great tortoise kami into his body..."},{"name":"SUZAKU","text":"I see it now! He offers himself to Genbu! I can feel his presence returning...but if Soroban does this, then his own soul will be..."},{"name":"SOROBAN","text":"I would rather you not say it aloud, otherwise I might have second thoughts! Believe me, I know the consequences, and I accept them..."},{"name":"SOROBAN","text":"Farewell, my friends, and please look after Tamamizu..."},{"name":"TATARU","text":"Soroban!"},{"name":"GENBU","text":"Worry not, Soroban. We will not let it be for nothing."},{"name":"KOURYU","text":"BUUURN! BUUUUUURN! ALL SHALL BUUUUUUUUURN!!!"},{"name":"GENBU","text":"Perhaps one day, many thousands of years from now. But not this day. Begone!"},{"name":"TATARU","text":"You know what the worst part would be if Koryu broke free? I mean, aside from the catastrophic destruction and loss of life? We'd not get the treasure that was promised to us, that's what!"},{"name":"SEIRYU","text":"How long has it been since we four came together as one? Too long indeed..."},{"name":"GENBU","text":"Koryu shall not threaten us for many millennia yet. Let us rejoice in this hard-won victory─nearly lost were it not for your courage and strength, <span class=\"highlight\">Forename</span>."},{"name":"TATARU","text":"But...but Soroban..."},{"name":"BYAKKO","text":"Tragic though his sacrifice was, it was not in vain. Let us not mourn his death, but honor his memory."},{"name":"GENBU","text":"Death? Memory? What in the world are you on about? Soroban yet lives."},{"name":"TATARU","text":"Let me guess: in our hearts or some such? Honestly, if you're going to try and comfort us, you could at least do better than offer trite clichés!"},{"name":"GENBU","text":"Hmph. I am simply making a statement of fact. But I see words alone will not serve to communicate my point..."},{"name":"SOROBAN","text":"Huh? But I was...but I should be... Huh!?"},{"name":"SEIRYU","text":"I...I do not understand. The ritual the Kojin performed, he... When one summons the soul of an immensely powerful entity into one's own body, it is understood─nay, expected that the summoner's soul is extinguished in the process..."},{"name":"SOROBAN","text":"(-Genbu-)That is true─when the summoned entity's soul is of surpassing strength relative to one's own. Soroban's, however, has grown remarkably robust, owing to his intense training─and his prolonged exposure to the magicks of the tamate-bako of geomancy!"},{"name":"SOROBAN","text":"(-Genbu-)His soul now eclipses mine in spiritual potency, which is why it holds fast to this vessel. And so, when the enchantment fades ere long, mine will depart and fade as before."},{"name":"TATARU","text":"And just when we were getting used to having you around again..."},{"name":"SOROBAN","text":"(-Genbu-)Koryu's aim was true, as you saw, and in my final moments I was filled with regrets, but no longer! With my remaining time, I will attend to my affairs, and train dear Soroban to succeed me as the next Genbu!"},{"name":"SOROBAN","text":"W-Wait, me? The next Genbu!?"},{"name":"SUZAKU","text":"The Four Lords are ever needed. You have both the strength of will and character to succeed our elder brother. Would you all not agree?"},{"name":"SEIRYU","text":"I think he more than proved himself when he stood his ground against Koryu. Still, it should be a unanimous decision. Byakko?"},{"name":"BYAKKO","text":"As you say, he faced certain death without hesitation and embraced sacrifice for the sake of others. I should be glad to welcome him to our fellowship."},{"name":"SOROBAN","text":"If that is how you all feel, then I am certainly in no position to refuse. I will do my best to live up to your expectations."},{"name":"TATARU","text":"Give an ilm and they'll take a malm, I swear..."},{"name":"SOROBAN","text":"(-Genbu-)Do not think I have forgotten our bargain, little urchin. Great feats demand consummate rewards, and we are auspices of our word."},{"name":"TATARU","text":"It's about time! Did you hear that, <span class=\"highlight\">Forename</span>!? It's treasure time!"},{"name":"SOROBAN","text":"(-Genbu-)While we see to the preparations, perhaps you could spare a moment for my dearest comrades? With our troubles at an end, we may be parting ways soon, and so this might be the last opportunity you have to speak with them for quite some time."},{"name":"TATARU","text":"Is it over? We're not going to die?"},{"name":"BYAKKO","text":"Soroban saved us all, but at a terrible cost..."},{"name":"SUZAKU","text":"Oh, my beloved Tenzen..."},{"name":"SEIRYU","text":"What a fool I was to think I could have bested that demon with the aramitama..."},{"name":"NUE","text":"Now that's something you don't see every day! Gosh!"},{"name":"SEITENTAISEI","text":"Well done, you! And the Four Lords! That was bona fide hero stuff!"},{"name":"KUDAGITSUNE","text":"Ever shall I wait for her return."},{"name":"INUGAMI","text":"I gather the danger has passed? Since Kamaitachi has not fled, that is."},{"name":"KOMAINU","text":"Our duty remains unchanged. So long as the sacred crystal and the wards remain, we will stand guard."},{"name":"BYAKKO","text":"With Koryu imprisoned once more, my comrades and I are free to watch over these lands as before. As is our duty."},{"name":"BYAKKO","text":"And when the wards falter once more, we shall again gather our strength and beat back our mad brother's assault, together with noble Soroban─a worthy successor to the fallen Genbu."},{"name":"BYAKKO","text":"For now, however, we may enjoy a welcome respite. A peace we owe as much to you as anyone else, I should think."},{"name":"BYAKKO","text":"I see many battles ahead of you, for like Tenzen, you are not one to rest on your laurels. This much is plain. I wish you good fortune in the wars to come."},{"name":"BYAKKO","text":"Ah, but I ramble─do not deny it. When one has lived as long as I, it is all too easy to lose track of time. Go, go. Should ever you crave the company of we curious beasts, you will find us here."},{"name":"SUZAKU","text":"Worry not for Soroban. We will guide him in his journey and help him to reach his true potential. As Tenzen once guided us..."},{"name":"SUZAKU","text":"I...I had long since given up on ever seeing him again. And then he was there, shining paragon of strength and virtue. A...a memory made manifest."},{"name":"SUZAKU","text":"But if he had been more than that, I would have told him─this body I once cursed, I have come to cherish. This I owe to him and his love."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I think he already knows."},{"name":"A2","text":"Somehow I doubt there's a need."},{"name":"SUZAKU","text":"Oh? Well...that would be wonderful if true. For all his virtues, he could be remarkably oblivious at times."},{"name":"SUZAKU","text":"Because he already knew? Hmm, I wonder... For all his virtues, he could be remarkably oblivious at times."},{"name":"SUZAKU","text":"But though he taught me to love and accept myself, it was you who helped me to remember. Who helped me to smile again."},{"name":"SUZAKU","text":"For that, <span class=\"highlight\">Forename</span>, you will always hold a special place in my heart. Please come and visit us in the future."},{"name":"SEIRYU","text":"At first I thought he was a figment of my imagination, but he was real enough. How or why I know not, but a possibility springs to mind."},{"name":"SEIRYU","text":"When Tenzen was mortally wounded by Koryu, he used the last of his strength to seal him within the sacred crystal. The original wards were born of his flesh, his very essence─an act of desperation, I once believed, but now I wonder: was it in preparation for this very day?"},{"name":"SEIRYU","text":"But even if it had been part of an elaborate plan to preserve his soul as a final defense, his strength alone would have never sufficed."},{"name":"SEIRYU","text":"Nay, he needed another warrior possessed of tremendous potential, like himself─one blessed with a singular power to whom he could bequeath his own."},{"name":"SEIRYU","text":"He knew another would come, you see. Another hero the likes of which the world so rarely sees. Thousands and thousands of years ago, he foresaw your coming..."},{"name":"SEIRYU","text":"Bah! Clever bastard. Putting me to shame with his strength and wisdom both. And still he denies me my rematch."},{"name":"SEIRYU","text":"But at least I still have you, <span class=\"highlight\">Forename</span>. Live long, for I am not finished with you yet. We will fight again, and I will win. Without turning to the aramitama, you may be assured."},{"name":"SOROBAN","text":"(-Genbu-)You have waited this long for your treasure, have you not? Then surely it will not pain you to wait a moment longer?"},{"name":"BYAKKO","text":"Beings such as we have all the time in the world, which is perhaps why it is so easy for us to succumb to melancholy. For my sake, I hope you visit us again."},{"name":"SEIRYU","text":"You too should endeavor to hone your skills for our coming rematch. I would take little joy in my victory if it were due to your complacency."},{"name":"SUZAKU","text":"You will always be welcome here, <span class=\"highlight\">Forename</span>. Visit us any time."},{"name":"TATARU","text":"Treasure time!♪<br>Treasure time!♪<br>Trololololo～lololo～♪"},{"name":"NUE","text":"Thanks for saving the world! Or at least our little corner of it!"},{"name":"SEITENTAISEI","text":"Guess this means you'll be on your way, huh? That's a shame...though I suppose there's always a chance we'll met again, eh? And maybe the two of us can have ourselves another match for old times' sake? You can even bring your friends like before─I don't mind!"},{"name":"KUDAGITSUNE","text":"I understand. Our lives lead us where they may, and yours leads you elsewhere. So it was with Tamamo Gozen. I shall remember you fondly."},{"name":"INUGAMI","text":"Before you came, I bore man a terrible grudge. Less so, now, for I am comforted to know that there are good and honorable ones such as you. Live well, and teach others to do the same, that I might never need resume my hunt."},{"name":"KOMAINU","text":"We may go to greater lengths to conceal the temple's existence from outsiders in the future. However, you will always be welcome to come and go as you like."},{"name":"SOROBAN","text":"(-Genbu-)Come and claim your reward, honored friends!"},{"name":"TATARU","text":"It's...it's beautiful! It's so beautiful! More than enough to make up for a thousand thousand of Alphinaud's reckless purchases!"},{"name":"SOROBAN","text":"(-Genbu-)A fitting reward for saviors of the Ruby Sea."},{"name":"TATARU","text":"To be honest, I was half expecting another terrible joke, but you really followed through. Hmm... Getting this home is going to be no easy task..."},{"name":"SOROBAN","text":"(-Genbu-)If transportation is a concern, we would be happy to deliver it to a destination of your choosing."},{"name":"TATARU","text":"Really? Just like that? Um, in that case...the Ruby Bazaar in Kugane? If it's no trouble, that is..."},{"name":"SOROBAN","text":"(-Genbu-)None whatsoever. Every member of the collective should be glad to lend a hand."},{"name":"SOROBAN","text":"(-Genbu-)...And with that, I take my leave."},{"name":"TATARU","text":"So...Soroban? Will you really stay here and not return to Tamamizu?"},{"name":"SOROBAN","text":"Well...I did agree to become the next Genbu..."},{"name":"SOROBAN","text":"(-Genbu-)For the duration of his training, I would have him remain here. It will be a long, hard road, believe you me, and I intend to spend my remaining years guiding him. All five hundred or so."},{"name":"SOROBAN","text":"And there you have it. I hope I can impose upon you to deliver Bunchin the news..."},{"name":"SOROBAN","text":"Wait─five hundred years? As in, you will be here for another five centuries!? I thought you said the enchantment would fade “ere long”!"},{"name":"SOROBAN","text":"(-Genbu-)Th-These things are relative! And what's with that tone of yours, anyway? You should be honored to be the beneficiary of my sage tutelage. Foolish turtle!"},{"name":"SOROBAN","text":"You're a turtle too! An old...tiny...crabby ghost turtle! Get out of my head!"},{"name":"TATARU","text":"There's something a little frightening about watching him...them...fight with themselves. Ugh..."},{"name":"TATARU","text":"Maybe we should leave them alone for a while..."},{"name":"SOROBAN","text":"(-Genbu-)Ahem. Thank you for everything, <span class=\"highlight\">Forename</span>. Tataru. Safe travels."},{"name":"BUNCHIN","text":"Hmm... I sense you have reasons other than the usual for this particular visit. Might it have something to do with Soroban?"},{"name":"BUNCHIN","text":"I beg your pardon? Soroban is to become the next Genbu?"},{"name":"BUNCHIN","text":"I will not feign understanding. However this extraordinary state of affairs came about is utterly beyond my ken. As unbelievable as I yet find it, though, I have no doubt that you speak true."},{"name":"TATARU","text":"Soroban's had an incredible string of bad luck. Succumbing to the aramitama, becoming a giant tortoise, and now this."},{"name":"TATARU","text":"On the other hand, he could have refused, and instead agreed to take on this responsibility. So we may as well support him, don't you think?"},{"name":"BUNCHIN","text":"Indeed. Though it pains me to imagine Tamamizu without our Soroban, it fills me with pride to know that a Kojin of the Blue has been granted this great honor."},{"name":"BUNCHIN","text":"We shall pray for him, that he may rise to the occasion and serve as a benevolent guardian to all who call the Ruby Sea home."},{"name":"BUNCHIN","text":"Thank you for helping him to find his true calling, my friends."},{"name":"TATARU","text":"Oh no, the pleasure was all ours─and the profit!"},{"name":"BUNCHIN","text":"I am not sure I take your meaning, but I appreciate the sentiment. But if I might ask a final favor: would you be so kind as to look in on him from time to time? Just to see that he is getting on all right?"},{"name":"TATARU","text":"Of course!"},{"name":"TATARU","text":"It's not every day you make friends with a secret collective of talking animals, after all! Even if Soroban hadn't decided to remain at Reisen Temple, I wouldn't have wanted to stay away."},{"name":"TATARU","text":"You can be sure I'll head there from time to time. You're welcome to join me when I do, of course!"},{"name":"SOROBAN","text":"I know I must have asked you this a thousand times before, but would you please go and let Bunchin know that I am alive and well? Or alive, at least?"}],"reward":{"gil":1277,"items":[{"id":24510}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68701]}},"partials":[{"type":"npc","id":"1026581","obj":{"i":1026581,"n":"Seiryu","l":2409,"q":2}},{"type":"npc","id":"1019178","obj":{"i":1019178,"n":"Bunchin","l":2409,"q":10}},{"type":"item","id":"24510","obj":{"i":24510,"n":"Four Lords","l":1,"c":51391,"t":79,"p":5000}},{"type":"quest","id":"68701","obj":{"i":68701,"n":"Surpassing the Samurai","g":22,"l":"The Ruby Sea","s":331,"f":1}}]}