{"quest":{"name":"The Past Is Never Past","location":"Kugane","id":68703,"patch":4.56,"sort":80,"icon":100834,"unlocksFunction":1,"eventIcon":71341,"issuer":1024351,"target":1025885,"genre":70,"journal":["Like a moth to the flame... But why else would you come, if not for Nashu Mhakaracca and Inspector Hildibrand's shenanigans?","Inspector's Log:<br>What a wretched state of affairs it is, to have Shigure detained for aiding and abetting the escape of the Wolf Burglar, when it was more or less my brilliant idea! Justice and guilt─but mostly justice!─compel me to remedy this situation with all due alacrity, and to that end I would investigate the questionable activities of Master Akebono, who is doubtless the villain at the heart of these dark intrigues. Yet what is this curious sensation, this foreboding familiarity which gnaws at my breast? Could it be...a long-lost fan?<br>　　　　　　　　　　　　*　*　*<br>Predictably, in your absence, Nashu and Inspector Hildibrand have made no headway in their efforts to unearth Akebono's dark secrets and secure a reprieve for the imprisoned Shigure. However, the inspector did but recently come into the possession of an anonymous missive from an individual claiming to have the Soboro Sukehiro. They are willing to relinquish it provided that the “something-something of Light” defeats them in a duel upon Kugane Ohashi. Naturally, Hildibrand interprets the nearly illegible letters to be “the Gentleman of Light”─namely, himself─and without hesitation breaks into a run, eager to accept the challenge. Surely this will end well.","It did not end well for Hildibrand, whom you find embedded headfirst in the ground in the traditional fashion. It would seem that the poorly penned missive was sent by Jim─ahem, Yojimbo, who was hoping to face the Warrior of Light in battle. Having confirmed that Hildibrand is none the worse for wear, you are free to gather seven of your stoutest adventuring comrades (Echo not required) who are not currently preoccupied with anything in particular, and confront the mysterious ronin.<br><br>※Kugane Ohashi can be accessed via the Duty Finder.","Well, that was entirely unexpected.","Yojimbo is Gilgamesh, and Gilgamesh Yojimbo. Though this strange and bewildering truth comes to light during your battle with the legendary sword collector, you and your comrades maintain your composure and manage to emerge triumphant. Having been soundly defeated yet again, Greg expresses his heartfelt contrition to you and Hildibrand, and after touching briefly on the tragic circumstances which brought him to Kugane, bereft of rooster but joined by canine, he pledges to aid you in your various endeavors.","While Nashu may well be thrilled to learn that Greg will be helping you with your investigation into Akebono's affairs, she does not show it, for she is deeply troubled by the recent revelation that Shigure has been ordered to commit ritual suicide as punishment for his crimes. Time is of the essence, and so you and the others immediately set about attempting to uncover even the slightest bit of information regarding Akebono that may serve to forestall Shigure's impending doom.","Akebono is hardly a man of the people, preferring to leverage his monopoly on Hannish reagents to reap massive profits through the sale of incomparable medicines. Though these accounts are unlikely to prove of any use, they are all you can obtain on short notice.","As feared, you are too late to convince the Sekiseigumi to postpone Shigure's execution, and as you look on helplessly he is escorted into the courtyard, where the ceremony is to be held forthwith. The disgraced samurai is prepared to accept his fate, but Inspector Hildibrand has other ideas. Disguised as a fellow Sekiseigumi, he leads the guards on a merry chase while urging Shigure to take flight. Alas, he will do no such thing, for in death he intends to reclaim his honor. It is only by the dramatic return of the infamous Wolf Burglar, Soboro Sukehiro in hand, that Shigure is finally saved...though not wholly absolved of guilt. He is subsequently commanded to conduct a formal investigation into the rumors surrounding Master Akebono─an investigation which is ordered closed mere moments later by Master Kumode, the chief coincounter of the Sekiseigumi, and a man you and Shigure immediately recognize from a certain party which erupted into chaos due to the antics of an incognito inspector. For his part, Kumode professes ignorance, and rather convincingly besides...although the queer shimmer in his eyes suggests that not all is what it seems...","Shigure has been redeemed, and Hildibrand is proud to claim victory, as is his wont. But of course, the tale is far from finished, for many vexing questions remain unanswered. Why did the Wolf Burglar, having reclaimed his father's sword, surrender it and himself without a fight? How does Akebono wield such power and influence? Does the Wolf Burglar know? And if he doesn't, who does? And how in the seven hells does Hildibrand keep surviving all these fatal falls?"],"objectives":["Search for Hildibrand.","Confront Yojimbo on Kugane Ohashi.","Speak with Hildibrand.","Speak with Nashu.","Question the residents of Kugane.","Speak with Hildibrand."],"dialogue":[{"name":"NASHUMHAKARACCA","text":"Oh, where in the world could he be...?"},{"name":"NASHUMHAKARACCA","text":"Oh, it's you! I don't suppose you bumped into Inspector Hildibrand roaming about, have you? Making his inquiries?"},{"name":"NASHUMHAKARACCA","text":"Oh... Ever since Shigure got detained by the Sekiseigumi, the inspector's been busy looking into the affairs of Master Akebono, but to no avail..."},{"name":"HILDIBRAND","text":"Never fear, my faithful assistants! I have returned!"},{"name":"HILDIBRAND","text":"Your unwavering loyalty to the pursuit of honor and justice and a hard-boiled egg is to be commended, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. I might go so far as to say that, in all my years as an inspector, I have known no fan more passionate than you!"},{"name":"HILDIBRAND","text":"But speaking of fans─during the course of my investigation into the darker rumors concerning Master Akebono, I received a mysterious missive I can but presume was penned by one of my many admirers!"},{"name":"NASHUMHAKARACCA","text":"Gosh, Inspector Hildibrand! Even in the Far East, you've got yourself a following! Can I see it?"},{"name":"HILDIBRAND","text":"Certainly, Nashu!"},{"name":"NASHUMHAKARACCA","text":"Hmm, that's interesting. It's definitely not written by a Hingan, but they don't seem to be too good with their Eorzean letters..."},{"name":"NASHUMHAKARACCA","text":"\"Yea...something-something of Light...you who seeks the strongest of swords, the Soboro Sukehiro, know that I have laid claim to this most priceless treasure.“"},{"name":"NASHUMHAKARACCA","text":"\"If you would make it yours, meet me upon Kugane Ohashi, for a duel to end all duels. Sincerely, you-know-who.“"},{"name":"HILDIBRAND","text":"The something-something of Light, you say? Why, he must be referring to none other than my humble self! The one and only Gentleman of Light!"},{"name":"HILDIBRAND","text":"That said, I would much rather resolve this dispute without resorting to duels and the like. Wait here, my friends, while I go and attempt to reason with this misguided ruffian!"},{"name":"NASHUMHAKARACCA","text":"Um...I'm pretty sure they wrote “Warrior,” not “Gentleman”..."},{"name":"NASHUMHAKARACCA","text":"Which probably means they're talking about <span class=\"highlight\">Forename</span>? What do you think, Inspector...?"},{"name":"NASHUMHAKARACCA","text":"...Inspector Hildibrand?"},{"name":"NASHUMHAKARACCA","text":"...What do you mean he up and ran off!? And why are you still standing here? You should hurry up and try to catch him before he does something silly!"},{"name":"NASHUMHAKARACCA","text":"I'll wait here in case he comes back. Agreed? Right, then!"},{"name":"HILDIBRAND","text":"Is that you, <span class=\"highlight\">Forename</span>? As you can see, I seem to have found myself in a pickle, and by pickle I mean the ground..."},{"name":"HILDIBRAND","text":"Kugane Ohashi lies beyond this gate, but before I could pass through, I found myself suddenly accosted, then inverted, then embedded thusly by the dear but misguided Jim."},{"name":"HILDIBRAND","text":"The duel I must regrettably leave up to you..."},{"name":"HILDIBRAND","text":"You go on ahead, my friend. I will extricate myself...eventually."},{"name":"SYSTEM","text":"Good night, sweet prince..."},{"name":"GILGAMESH","text":"We meet again, Hildy."},{"name":"HILDIBRAND","text":"Greg? Greg!? I say, you are a sight for sore eyes! However did you come to be here, in Kugane? In the Far East, for that matter!?"},{"name":"GILGAMESH","text":"Ah, well, you see, the thing about that is..."},{"name":"HILDIBRAND","text":"...I say, to think that Greg was masquerading as Jim this entire time!"},{"name":"GILGAMESH","text":"Indeed, I was. After <span class=\"highlight\">Forename</span> bested me a second time, I quit Eorzea and embarked upon a journey to distant lands, that I might hone my skills in preparation for our inevitable third bout."},{"name":"GILGAMESH","text":"But when I saw you had misread my carefully written words and come in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> stead, I felt I had no choice but to remove you from the field forcibly. Pray forgive me my unkindness, Hildy!"},{"name":"HILDIBRAND","text":"Now, now, Greg, there is no need for apologies between friends. Yet again I must ask, though─how did you come to be here, in Kugane, as a ronin of much repute and a remarkably thin waist?"},{"name":"GILGAMESH","text":"I know it seems far-fetched, even insulting to your intelligence, but there's a simple and highly satisfying explanation."},{"name":"GILGAMESH","text":"In my quest to hone my skills and procure more powerful weapons overseas, I neglected to budget properly for food and drink, and soon found myself bereft of both..."},{"name":"GILGAMESH","text":"Driven to a deathly hunger, I fell to my knees, and in that instant looked to my bosom friend, the painted rooster that had offered me companionship in my darkest hour..."},{"name":"GILGAMESH","text":"When dawn broke the following day, I was alone once more, a sliver of strength restored by the terrible sacrifice of my comrade, whose body and soul I would carry with me ever after..."},{"name":"GILGAMESH","text":"But by his grace I survived for days and days after, until I chanced to cross paths with a stray dog."},{"name":"GILGAMESH","text":"He too was clearly a victim of the slings and arrows of outrageous misfortune, and in each other we found kindred spirits, we orphans of fate."},{"name":"GILGAMESH","text":"Thus did I name him Daigoro, and thereafter did we travel as one, working together that we might both live to see another day..."},{"name":"GILGAMESH","text":"When we at last arrived at Kugane, I sought employment as a mercenary to rebuild my misspent savings and resume my search for the strongest of swords."},{"name":"GILGAMESH","text":"It was through such ventures that I acquired the Zanmato, in fact, and began to build my reputation as Yojimbo. Naturally, a legendary ronin must dress to meet the expectations of his clients, and so I assembled an outfit that would satisfy those who requested my services."},{"name":"GILGAMESH","text":"Kageyama was one such client. When I saw that <span class=\"highlight\">Forename</span> and <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> comrades were to be my opponent, though, I quickly realized he had not paid me nearly enough! More fool me!"},{"name":"GILGAMESH","text":"It was around that time I first saw <span class=\"highlight\">Forename</span> walking the streets of Kugane, much to my surprise."},{"name":"GILGAMESH","text":"Needless to say, the sight of the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who had bested me twice before was enough to rekindle the competitive spirit within me, and so when I heard tell of the Soboro Sukehiro, I knew I must claim it in preparation for our battle. The rest, you know."},{"name":"HILDIBRAND","text":"Truly, a riveting tale..."},{"name":"GILGAMESH","text":"And tragic, besides! For though I fought with all my strength, yet again was I defeated by the great and powerful Warrior of Light!"},{"name":"GILGAMESH","text":"As I said to you on the bridge, no more tricks! I have taken my shot and fallen short, and so I will cease my shenanigans and instead pledge my complete support to your endeavors, that I might make amends for my misdeeds!"},{"name":"HILDIBRAND","text":"And we should be glad to have it, Greg! Welcome aboard!"},{"name":"HILDIBRAND","text":"Let us return to Nashu and share with her the wonderful news!"},{"name":"HILDIBRAND","text":"You too, Greg! You're a full-fledged assistant, now!"},{"name":"HILDIBRAND","text":"Truly, this was a twist that no one could have possibly seen coming!"},{"name":"GILGAMESH","text":"I admit my defeat, brave warrior. Let us let bygones be bygones, you and I, and move forward in the spirit of camaraderie towards a common goal!"},{"name":"NASHUMHAKARACCA","text":"Terrible news, everyone!"},{"name":"HILDIBRAND","text":"Whatever is the matter, Nashu?"},{"name":"NASHUMHAKARACCA","text":"It's Shigure! As punishment for helping the Wolf Burglar escape, he's been sentenced to death by ritual suicide!"},{"name":"GILGAMESH","text":"This is indeed a disturbing development, Hildy..."},{"name":"HILDIBRAND","text":"We have no time to spare, my friends. Presuming the Wolf Burglar is in the wind, our only recourse is to delve deeper into the hidden past of Master Akebono and uncover proof that the sword he claims was stolen was first stolen by he himself!"},{"name":"HILDIBRAND","text":"Divide and conquer, agents of enquiry style!"},{"name":"BYAKUDAN","text":"How did Akebono earn his fortune, you ask? By peddling a variety of medicinal wares for all manner of purposes."},{"name":"BYAKUDAN","text":"From what I heard, they were all remarkably effective and popular. He still enjoys a reputation as a premier source of alchemical goods."},{"name":"BYAKUDAN","text":"Would that I had the coin to afford such luxurious potions and potables. His clientele spends in a visit what I earn in a month!"},{"name":"KEITEN","text":"I should be glad to speak of Master Akebono to you, albeit solely with regards to his character as a businessman."},{"name":"KEITEN","text":"Like all who have risen to mercantile prominence, he has been at the center of rumor and intrigue. For every man who sings his praises, there is another who would curse his name."},{"name":"KEITEN","text":"None will deny the efficacy of his medicines, which is to be expected given that he utilizes the finest ingredients from that birthplace of alchemy, Radz–at–Han. His satisfied customers are beyond counting."},{"name":"KEITEN","text":"On the other hand, none can deny the exorbitant profits he has reaped by tightly controlling the supply of Hannish ingredients. Absent competition, he is free to dictate prices as he sees fit."},{"name":"KEITEN","text":"Unfortunately, this has led many in desperate need of his miraculous medicines to spend their entire life savings, or seek assistance from disreputable moneylenders..."},{"name":"KEITEN","text":"His practices are, ultimately, wholly within the confines of the law. So, again─as a businessman, he is to be lauded for his success. But I will say nothing on his morals or ethics...or lack thereof."},{"name":"BYAKUDAN","text":"I myself have never purchased any of Akebono's wares, and doubt very much that I will ever have the opportunity to do so, unless a distant relative so happens to leave me a vast, vast fortune, or some other unrealistic eventuality comes to pass."},{"name":"KEITEN","text":"As I told you, Akebono is every bit the quintessential businessman. Take from that what you will."},{"name":"NASHUMHAKARACCA","text":"We've got to help Shigure before it's too late!"},{"name":"GILGAMESH","text":"Commanded to commit ritual suicide, eh? I knew he had earned the ire of his masters, but not to such a degree..."},{"name":"HILDIBRAND","text":"Have you tantalizing tidbits of information to share, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>? Come, come! Out with it!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The medicines Akebono sells are second to none."},{"name":"A1","text":"Akebono built his fortune selling miraculous medicines for exorbitant prices."},{"name":"HILDIBRAND","text":"A man who preys on the sick and needy for personal gain, is he? As expected, there is far more to Master Akebono than meets the eye..."},{"name":"NASHUMHAKARACCA","text":"Inspector! Inspector! We've got to hurry! Shigure's execution is going to be carried out any moment now if we don't do something!"},{"name":"HILDIBRAND","text":"What!? Already? And there I was hoping we might first conduct a thorough investigation and uncover information with which we might convince them to set the poor man free, but absent that..."},{"name":"HILDIBRAND","text":"Bah! There are many roads which lead to just ends. If we must take a shortcut to avert a grave miscarriage of justice, then so be it!"},{"name":"SHIGURE","text":"Honored brothers, I will not beg your forgiveness, only pray that by this humble offering of my life that I might absolve the Sekiseigumi of the shame I have brought upon it through my misdeeds..."},{"name":"SEKISEIGUMIBLADEA","text":"(-Sekiseigumi Blade-)Wh-What is the meaning of this!?"},{"name":"SEKISEIGUMIJAILER","text":"That man is an impostor! Seize him! Seize him at once!"},{"name":"HILDIBRAND","text":"Shigure! Shigure! Now is your chance to escape! "},{"name":"SHIGURE","text":"I...I will do no such thing! I may have lost what little honor was mine in life, but at least I can reclaim it in death!"},{"name":"KUGANEWOLFBURGLAR","text":"(-???-)Your honor is yet yours, samurai!"},{"name":"KUGANEWOLFBURGLAR","text":"You need not cut your belly open this day, Shigure, for you have the Soboro Sukehiro, and the infamous Wolf Burglar besides!"},{"name":"SHIGURE","text":"But...but why!?"},{"name":"KUGANEWOLFBURGLAR","text":"We had a deal, remember? Temporary release. And I'm a wolf of my word."},{"name":"SEKISEIGUMIBLADEA","text":"(-Sekiseigumi Blade-)Aye, this is indeed the Soboro Sukehiro... Very well! Escort the Wolf Burglar back to his cell, and send a runner to Master Akebono's estate at once!"},{"name":"SEKISEIGUMILEADERA","text":"We are far from finished, Shigure! The Wolf Burglar may be in custody once more, but you must still answer for your reckless actions!"},{"name":"SEKISEIGUMILEADERA","text":"...Therefore, after further deliberation, I have decided that you will conduct a formal investigation into the rumors surrounding Master Akebono and─"},{"name":"KUMODE","text":"(-???-)That will not be necessary. Indeed, with the return of the Wolf Burglar, I believe we can consider this tiresome affair resolved."},{"name":"SEKISEIGUMILEADERA","text":"M-Master Kumode!"},{"name":"SHIGURE","text":"Wait, I know you! Master Akebono's guest! The one the geiko threw into the wall!"},{"name":"KUMODE","text":"Oh? Surely, you must be mistaken. I have no recollection of any such event, or of you, for that matter."},{"name":"KUMODE","text":"Anyway, as I said before, I believe there is no need for any further investigation. Should you deem otherwise, you are free to proceed. However, such wasteful expenditures may force us to reconsider the resources we allocate you and yours next year..."},{"name":"SEKISEIGUMILEADERA","text":"Rest assured, Master Kumode, that we value your counsel deeply, and should be glad to defer to your judgment!"},{"name":"SEKISEIGUMILEADERA","text":"Shigure! The matter of the Soboro Sukehiro and Master Akebono is now officially closed. That will be all!"},{"name":"KUMODE","text":"Yes... That will be all..."},{"name":"KOJU","text":"Never thought the wolf'd up and turn himself in, and to save a Sekiseigumi of all people! Honorable to a fault, he is."},{"name":"HILDIBRAND","text":"Hah hah hah! Verily, I, Hildibrand, agent of enquiry, inspector extraordinaire, have once more done the impossible and saved a man from certain death!"},{"name":"HILDIBRAND","text":"A shame that the others seemed so eager to wash their hands of the affair. Not Shigure, though. I understand he still has questions for the Wolf Burglar..."},{"name":"NASHUMHAKARACCA","text":"Cor, we did it! We saved Shigure!"},{"name":"GILGAMESH","text":"'Twas just in the nick. Or before the nick, I should say..."}],"reward":{"gil":3304,"instance":20059},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68687]},"next":[68704]},"partials":[{"type":"npc","id":"1024351","obj":{"i":1024351,"n":"Nashu Mhakaracca","l":2404,"q":2}},{"type":"npc","id":"1025885","obj":{"i":1025885,"n":"Hildibrand","l":2404,"q":2}},{"type":"instance","id":"20059","obj":{"i":20059,"n":"Kugane Ohashi","c":61804,"t":"Trials","min_lvl":70,"max_lvl":70,"min_ilvl":365}},{"type":"quest","id":"68687","obj":{"i":68687,"n":"Good Swords, Good Dogs","g":70,"l":"Kugane","s":70,"f":1}},{"type":"quest","id":"68704","obj":{"i":68704,"n":"Don't Do the Dewprism","g":70,"l":"Kugane","s":90,"f":1}}]}