{"quest":{"name":"The Sinister Soirée","location":"Gridania","id":68705,"patch":4.4,"sort":162,"icon":100808,"eventIcon":71221,"issuer":1026652,"target":1026656,"genre":203,"journal":["The Adventurers' Guild investigator is eyeing the troupe currently occupying Mih Khetto's Amphitheatre with suspicion.<br>※This quest is available for a limited time only.","The Adventurers' Guild investigator speaks to you of unsettling rumors regarding the Continental Circus's All Saints' Wake masquerade. He's heard tell of revelers going missing from the manor in which the gala is held, and given the Impresario's history of mischief─and more─thinks it prudent to further investigate these claims. For reasons related to the investigator's own lack of subtlety, it falls to you to speak with the Impresario and attempt to divine whether his intentions are malicious.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","You approach the Impresario, and in the course of your conversation cannot help but notice that he is indeed plotting something sinister in order to revive the legendary Night of Devilry, though you know not what. He also appears to be concerned that someone is watching him─though not concerned enough to cease uttering his thoughts aloud, it seems. When he at last stops talking, you hear another voice, no more than a whisper, from somewhere behind you.","Your search for the source of the mysterious voice leads you to the gates of the amphitheatre, where you once again hear its haunting words. It beckons to you in a way rather too overtly ghostly to be believable, but it's best to let it carry on while you seek its owner.","To your surprise, the source of the voice belongs to the more chipper one of two ghost-shaped All Saints' Wake decorations, which you later learn have been magicked to life. The sort-of ghosts reveal that they are privy to the Impresario's plan─to turn party guests into pumpkins, thereby generating sufficient terror to bring about the Night of Devilry─and have also witnessed a young girl being kidnapped from the masquerade by a member of the troupe for this purpose.","Upon hearing the tale of the kidnapped girl, the investigator immediately connects it with a report made to the Wood Wailers, and concludes that the child must be a missing girl, T'maritaa. You must work fast if you are to save her from the Impresario's clutches before she comes to harm, so the investigator encourages you to infiltrate the masquerade while he prepares a more robust rescue unit.","You successfully pose as a party guest to enter the manor, which is remarkably thoroughly decorated for the venue of a mere ruse. Somewhere, T'maritaa is presumably being held, and where your unlikely co-conspirators await.","Wading through the sea of jack-o'-lanterns and other garish decorations, you seek out the two non-ghosts whose acquaintance you made in Old Gridania, Little Yin and Yang. They have a notion to change your appearance to that of a fell fiend─the sort of creature that the troupe's mummers are in truth─that you may more easily extract information regarding T'maritaa's whereabouts. Little Yin gives you some time to mentally prepare, and awaits your go-ahead."],"objectives":["Speak to the Impresario.","Search for the source of the voice at the destination.","Report to the Adventurers' Guild investigator.","Speak to the genial guiser.","Speak to Little Yin."],"dialogue":[{"name":"INVESTIGATOR03169","text":"Ah, we meet again! Much to my relief, frankly─I could use the help of an adventurer who knows the Continental Circus and their fiendish proclivities."},{"name":"INVESTIGATOR03169","text":"I imagine you won't be surprised to hear that they're up to something new this year, and it doesn't seem entirely above board."},{"name":"INVESTIGATOR03169","text":"Not that <span class=\"emphasis\">anything</span> a troupe of fell fiends posing as law-abiding citizens does is truly above board, but─well, you know."},{"name":"INVESTIGATOR03169","text":"Aha, a fellow adventurer! If you have a moment, I could use your help investigating a suspicious incident. Potential incident. Well, something that's generally suspicious."},{"name":"INVESTIGATOR03169","text":"Have you heard of the Continental Circus? I mean the group of performers in the amphitheatre over there─they unfailingly appear in Eorzea every All Saints' Wake."},{"name":"INVESTIGATOR03169","text":"However, just between you and me, they aren't truly performers at all! Not in the traditional sense. In fact, they're─and try to remain calm─fell fiends in disguise! Imps and tricksters and the like, you see."},{"name":"INVESTIGATOR03169","text":"Now, the Adventurers' Guild policy on the matter is to live and let revel as long as they don't get up to anything <span class=\"emphasis\">too</span> evil, but I have reason to suspect they're plotting something truly diabolical for this year's “festivities.”"},{"name":"INVESTIGATOR03169","text":"The troupe has been inviting folk to a certain manor, ostensibly for a “marvelous masquerade” in the spirit of All Saints' Wake. But I have been keeping constant watch, ever alert for signs of villainy, and the whispers of passersby tell a different story. I've even heard that some who entered have yet to return!"},{"name":"INVESTIGATOR03169","text":"Personally, I feel that whisking the citizenry away into the night is a spot of mischief too far. And I'm sure you agree that something should be done before harm comes to unsuspecting revelers. We need to find out what the troupe is <span class=\"emphasis\">really</span> up to─by feigning interest in the party."},{"name":"INVESTIGATOR03169","text":"The Impresario seems to have realized that I'm investigating the Circus─I can't imagine how. Regardless, he will know that I have ulterior motives, so you must go alone and then report back to me. I'll try to dig up additional information on the missing persons in the meantime."},{"name":"INVESTIGATOR03169","text":"Try to prise some information about the missing persons out of the Impresario if you can. But don't let on that I sent you!"},{"name":"CLOWNGATEKEEPER03169","text":"I'm sorry <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, but this year's festivities are so popular that we can fit not a single additional morta─er, guest in the mansion at the moment."},{"name":"IMPHEAD","text":"Oh my, is that a familiar adventurer I spy? Hmmm... Though perhaps I am mistaken, for much and more is not as it seems this time of year, wouldn't you agree? Whoever you may be, I do hope you are having a properly <span class=\"emphasis\">dreadful</span> All Saints' Wake."},{"name":"IMPHEAD","text":"Oh my, is that an adventurer I spy? I do hope you are having a properly <span class=\"emphasis\">dreadful</span> All Saints' Wake."},{"name":"IMPHEAD","text":"You're not!?"},{"name":"IMPHEAD","text":"Dear, dear... That simply will not do. But dry your tears, for the Wake is still young, and there are many frights yet to come! I'm certain we can make room at our marvelous masquerade for such an illustrious adventurer as yourself."},{"name":"IMPHEAD","text":"Yes, a masquerade! Where the guests don guises both fulsome and frightful, and dance as long as they dare. Does that not sound charmingly reminiscent of the Night of Devilry in faerie tales?"},{"name":"IMPHEAD","text":"Oh, to revel in such ghoulish delights! To join the madness in the streets, to see that palest of pumpkinheads leading a magnificent medley of fiends! It has been so long since the coming of the last true Night... How I curse each year wasted in the Great Gourd's absence!"},{"name":"IMPHEAD","text":"Ahem. Pardon me─I simply adore the idea of an authentic celebration. And though the Circus does its best each All Saints' Wake, we lack the, er, manpower to truly impart the thrill of this season the realm over."},{"name":"IMPHEAD","text":"What we do <span class=\"emphasis\">not</span> lack, though, is a frightfully abandoned mansion for our masquerade. Why, there are even rumors that its furnishings, with no master to serve, have taken on lives of their own and hold baleful banquets in the darkness of night! Aren't you dying to attend?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I do have a few dozen guises I've been working on..."},{"name":"A1","text":"What about the rumors of those who enter, never to return?"},{"name":"IMPHEAD","text":"How splendid! In that case, you will no doubt want to join the masquerade forthwith. Do mind your surroundings when you enter the manor, though. Its corridors are labyrinthine, and who knows what frights lie in store?"},{"name":"IMPHEAD","text":"Hm? I cannot say rumors of that sort have reached me, though they do sound like the makings of a chilling tale! I wouldn't be surprised if the mansion's sprawling corridors confused a guest or two, however."},{"name":"IMPHEAD","text":"Regardless, I'm sure you'll have an absolutely spine-tingling time!"},{"name":"IMPHEAD","text":"Yes, and when mortal terror is at its zenith, the Night of Devilry shall return at long last..."},{"name":"IMPHEAD","text":"Oh, that? Merely a new slogan for the Continental Circus, of course. To help revelers get in the spirit and such. Now, off you go!"},{"name":"IMPHEAD","text":"..."},{"name":"IMPHEAD","text":"Why do I feel as if I'm being watched? Surely no one is aware of our true intentions <span class=\"emphasis\">this</span> time..."},{"name":"CHEERFULGHOST03169","text":"(-???-)Psst! I'm watching yooou. Ooo..."},{"name":"SYSTEM","text":"Whispers seem to emanate from somewhere nearby..."},{"name":"IMPHEAD","text":"Who could be watching me? Aside from that odd fellow by the gate, of course."},{"name":"INVESTIGATOR03169","text":"I'm keeping a close eye on activity at the amphitheatre. Let me know if you learn anything further of the Continental Circus's plans."},{"name":"CHEERFULGHOST03169","text":"(-???-)Over heeere! Woooooo..."},{"name":"SYSTEM","text":"The voice continues its valiant attempt to sound spooky as it moves toward the Whistling Miller."},{"name":"PUMPKIN","text":"(-???-)Delighted to be alive at last, aren't we, little ones?"},{"name":"PUMPKIN","text":"Fear not, they mean you no harm."},{"name":"PUMPKIN","text":"I do believe we've met before. Yes, in an autumn such as this..."},{"name":"PUMPKIN","text":"Now, didn't you two have something to tell our friend here?"},{"name":"CHEERFULGHOST03169","text":"Heheheh! You should've seen your face! It was hilarious! We went “boo!” and your eyes got huge and─you know, now that you mention it, I don't actually remember what we came here to talk about!"},{"name":"GLOOMYGHOST03169","text":"&lt;sigh&gt; The plot. The evil one. The one that involves being loud and irritating in our mansion."},{"name":"CHEERFULGHOST03169","text":"Oh, right! So, the other day, when I was sitting in the foyer being decorative─which is the same thing I did every day back before I could move, come to think of it─I saw a mummer carry a little girl away to the dark depths of the mansion. I could hardly believe my eyeholes!"},{"name":"CHEERFULGHOST03169","text":"Suspicious, right? And horrifying! But I couldn't do anything about it, on account of having no mouth to scream with. I mean, I <span class=\"emphasis\">had</span> a mouth, but it didn't do anything, me being frippery and all. Anyway, that's when the lady with the hideous pumpkin on her head came along and imbued me with life!"},{"name":"GLOOMYGHOST03169","text":"Please stop talking. You'll get us both turned back into objets d'art."},{"name":"GLOOMYGHOST03169","text":"Right. So, what matters is that we began keeping an eye on the Impresario. And wouldn't you know it, he's plotting something."},{"name":"GLOOMYGHOST03169","text":"As you are aware, the Continental Circus is luring people to the mansion for a masquerade. Once there, the guests will be kidnapped and turned into jack-o'-lanterns to inspire terror. With enough terrified victims, the troupe will be able to usher in the Night of Devilry."},{"name":"GLOOMYGHOST03169","text":"It's a nuisance, honestly."},{"name":"GLOOMYGHOST03169","text":"I've resigned myself to the fact that I'll have to go out of my way to deal with this. If you want to put a stop to the Impresario's plans, I can help."},{"name":"CHEERFULGHOST03169","text":"Me too, me too! The thought of that poor little girl being turned into a pumpkin and stuck in a corner is enough to send a chill down my seam. It would be terrible! Dreadful! The greatest travesty this world has ever seen! So...you'll keep it from happening, right?"},{"name":"CHEERFULGHOST03169","text":"Amazing! I knew we could count on you─well, not really, I suppose, since I just met you a few moments ago, but you do seem nice! Anyway, we'll head back to the mansion and meet you there!"},{"name":"PUMPKIN","text":"Heh heh heh... They certainly are enjoying themselves. The joy of conversation is a novelty to them, though to you it may be unworthy of remark."},{"name":"INVESTIGATOR03169","text":"Did you glean anything of the Impresario's master plan?"},{"name":"INVESTIGATOR03169","text":"Witnesses saw a mummer absconding with a little girl? That must be the Miqo'te child who was reported missing!"},{"name":"INVESTIGATOR03169","text":"I inquired with the Wood Wailers as to whether there have been any suspicious incidents of late, and it seems they have been searching for one T'maritaa at the request of her family."},{"name":"INVESTIGATOR03169","text":"The situation is already far worse than I'd feared. We must locate the child at once, before any harm befalls her!"},{"name":"INVESTIGATOR03169","text":"I will report what you've discovered to the Wood Wailers, and prepare to lead a raid on the mansion. In the meantime, you ought to disguise yourself and infiltrate the masquerade. See if you can discern where the girl is being held. "},{"name":"INVESTIGATOR03169","text":"My thanks! I've seen the genial guiser escorting folk to the manor, so once your chosen costume is in place you should be able to convince him to let you inside."},{"name":"INVESTIGATOR03169","text":"You should be able to convince the genial guiser to let you enter the manor. Best of luck!"},{"name":"CLOWNGATEKEEPER03169","text":"Oho, another reveler ready to join our marvelous masquerade!"},{"name":"EVENTAREA","text":"Enter the manor?"},{"name":"CHEERFULGHOST03169","text":"I love having all of these people around! Yin doesn't care for the noise, and there's the whole horrendous kidnapping plot and all, but it's still fun to see the place so lively!"},{"name":"CLOWNGATEKEEPER03169","text":"Oho, another reveler ready to join our marvelous masquerade!"},{"name":"EVENTAREA","text":"Enter the manor?"},{"name":"GLOOMYGHOST03169","text":"Took you long enough. I'm not sure how much more of this “revelry” I can endure."},{"name":"CHEERFULGHOST03169","text":"Oh wow, you're here already! I've been so busy reveling that the time just flew by!"},{"name":"GLOOMYGHOST03169","text":"&lt;sigh&gt; Do you see what I put up with? Regardless, we should seek out the malevolent mummers and try to get some information on where they are keeping her. Pray that she hasn't already been turned into a pumpkin, or we'll be here for moons."},{"name":"GLOOMYGHOST03169","text":"I doubt the mummers will tell us what we need to know if we ask politely, so we'll need to employ a bit of deception. Fortunately, I came up with a plan during the ample time you left me to think."},{"name":"GLOOMYGHOST03169","text":"They should be more willing to speak to one of their own─namely, a fiend. So we'll need to turn you into one."},{"name":"CHEERFULGHOST03169","text":"I bet you're wondering how we'll make you into a monster! You are, aren't you? Well, see, our very close friend with the hideou─I mean, festive pumpkin head has all sorts of powers. All sorts! And we asked to borrow one or two or three!"},{"name":"GLOOMYGHOST03169","text":"Indeed. The powers we have will allow us to transfigure your appearance just as the members of the troupe do, albeit temporarily."},{"name":"GLOOMYGHOST03169","text":"Go ahead and adjust to the idea of your visage being horribly reconfigured. When you're ready, let me know and I'll explain the plan in detail."}],"reward":{"gil":296},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[65781,66211]},"next":[68706]},"partials":[{"type":"npc","id":"1026652","obj":{"i":1026652,"n":"Adventurers' Guild Investigator","l":53,"q":3}},{"type":"npc","id":"1026656","obj":{"i":1026656,"n":"Little Yin","l":2497,"q":2}},{"type":"quest","id":"65781","obj":{"i":65781,"n":"It's Probably Pirates","g":1,"l":"Limsa Lominsa","s":91}},{"type":"quest","id":"66211","obj":{"i":66211,"n":"It's Probably Pirates","g":0,"l":"Limsa Lominsa","s":91}},{"type":"quest","id":"68706","obj":{"i":68706,"n":"The Parlous Ploy","g":203,"l":"Haunted Manor","s":163,"r":1}}]}