{"quest":{"name":"The Macabre Manor","location":"Gridania","id":68708,"patch":4.4,"sort":165,"icon":112196,"unlocksFunction":1,"eventIcon":71341,"issuer":1026652,"target":1026683,"genre":203,"journal":["The Adventurers' Guild investigator would present an ominous tale for your consideration.<br>※This quest is available for a limited time only.","The investigator relays to you the story of an adventurer who attempted to attend the Continental Circus's masquerade, only to have an altogether different and significantly more horrifying experience. Further investigation will be necessary to determine whether there is any truth to the tale.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You speak to the enthralling illusionist, who is far too happy to confirm your suspicion of ill forces at work. She invites you to speak with either of the harlequin guides to enter the manor and learn its malign secrets for yourself."],"objectives":["Speak to the enthralling illusionist."],"dialogue":[{"name":"INVESTIGATOR03169","text":"While you're in the area, I have one more tale that I'd like you to look into."},{"name":"INVESTIGATOR03169","text":"Another adventurer reported to me that she entered the manor intending to attend the marvelous masquerade, only to find a gathering of another sort entirely."},{"name":"INVESTIGATOR03169","text":"Where there should have been the chatter of conversation was deathly silence, and rather than revelers, voidsent stalked the halls. It sounds like the stuff of nightmares─and perhaps it was. But I don't feel right putting it down to an overactive imagination with the Continental Circus in town."},{"name":"INVESTIGATOR03169","text":"If you believe this tale to have some merit, I suggest you inquire with the enthralling illusionist. She seems quite keen on getting people to enter the manor..."},{"name":"WITCH03172","text":"My, what a charming adventurer! I do hope you've been enjoying the masquerade."},{"name":"INVESTIGATOR03169","text":"If you believe the tales of haunting experiences within the manor have merit, you should inquire with the enthralling illusionist. She seems suspiciously keen on her work."},{"name":"WITCH03172","text":"You say our guests have witnessed the incomprehensible? Oh, my insuf─incomparable adventurer, but of course they have! During All Saints' Wake, light and shadow are hardly so different. Many have slipped beyond the veil, to see shattered the illusion of reality."},{"name":"WITCH03172","text":"（★未使用／削除予定★）"},{"name":"WITCH03172","text":"<span class=\"emphasis\">Our</span> role is simply to prepare the venue for a broadening of perspective─to host a celebration like no other. I would be delighted to extend you an invitation to join us...if you dare."},{"name":"WITCH03172","text":"Why the dour expression? If you're afraid, you need only speak to one of our harlequin guides before you go. Understand the rules, and you needn't risk losing more than most of your sanity."},{"name":"WITCH03172","text":"Once you at last muster your courage, simply make your intentions known to them. They will be delighted to escort you."},{"name":"WITCH03172","text":"As for me, I must take my leave. The guiser keeps asking for help with some manner of “ghost problem,” whatever you take that to mean. Sweet waking dreams, adventurer..."},{"name":"SYSTEM","text":"You now have access to the Haunted Manor seasonal instance. To enter the manor, speak with the harlequin guide in either Mih Khetto's Amphitheatre or the Acorn Orchard."},{"name":"SYSTEM","text":"The Haunted Manor is a light party instance (four players). There are no class, job, or level requirements for participation."},{"name":"SYSTEM","text":"Parties that register for the instance with less than four members will be filled out automatically via the matching system."}],"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68707]}},"partials":[{"type":"npc","id":"1026652","obj":{"i":1026652,"n":"Adventurers' Guild Investigator","l":53,"q":3}},{"type":"npc","id":"1026683","obj":{"i":1026683,"n":"Enthralling Illusionist","l":53,"q":1}},{"type":"quest","id":"68707","obj":{"i":68707,"n":"The Sordid Cipher","g":203,"l":"Haunted Manor","s":164}}]}