{"quest":{"name":"The Sordid Cipher","location":"Haunted Manor","id":68707,"patch":4.4,"sort":164,"icon":100810,"eventIcon":71221,"issuer":1026655,"target":1026652,"genre":203,"journal":["Little Yang seems quite eager to review your findings, likely because he was not listening the first time.<br>※This quest is available for a limited time only.","Upon deliberation, you conclude that the memo mentioned by the mummers should indeed indicate the current location of the pumpkin suspected to be T'maritaa, and that the most expedient way to confirm this is to visit room 201.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The memo, conveniently not hidden in the least, contains a hint as to where the suspect pumpkin may be found. Little Yang also provides you with subliming scalebombs, which he assures you will remove any foul transformation magicks that may have been applied to said pumpkin.","To your─but mostly Little Yang's─surprise, the subliming scalebomb reveals not T'maritaa, but a Hyuran male of middle age dressed as a werewolf. He understandably flees in terror upon seeing a screaming Little Yang, and must be located once more if you are to understand how he became a jealously guarded gourd.","As you speak with the man─Dawkin─who else should appear but T'maritaa, who thankfully remains a Miqo'te. According to the pair's tale, Dawkin came upon a member of the Continental Circus attempting to curse T'maritaa, and dove in front of her to shield her from a vegetative fate. Though she managed to escape unscathed, she was unable to leave the manor due to fear of recapture, and opted to hide instead. With the two reunited and the coast clear, they are finally free to return to the outside world.","You relay the whole curious tale to Little Yin, who mainly seems pleased to have the mystery over and done with. She does, however, invite you to return to the manor to visit.","Back at Mih Khetto's Amphitheatre, you report to the Adventurers' Guild Investigator. He is pleased that the crisis has been averted, but advises you to keep an eye on the Continental Circus."],"objectives":["Search room 201.","Use a subliming scalebomb on the peculiar pumpkin.","Speak to the guised gent.","Report to Little Yin.","Report to the Adventurers' Guild investigator."],"dialogue":[{"name":"CHEERFULGHOST03169","text":"Good work out there! I mean, I suppose I don't know how your work was, exactly, since I've been here the whole time and all, but you seem like someone who would do good work! So let's review! The...work! That you did!"},{"name":"GLOOMYGHOST03169","text":"&lt;sigh&gt; If you had been paying attention, you would know that our friend here tricked the mummers into revealing a room number─201─and the existence of a memo regarding a pumpkin significant enough to be kept under guard."},{"name":"CHEERFULGHOST03169","text":"I see! So that means... Actually, I lied! I have no idea what's going on."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That memo holds information on the missing girl's whereabouts."},{"name":"A1","text":"The mummers have an unsettling obsession with pumpkins."},{"name":"GLOOMYGHOST03169","text":"Yes, I quite agree."},{"name":"GLOOMYGHOST03169","text":"I'll give you the benefit of the doubt and assume that you're being obtuse on purpose. But on the off chance that there are <span class=\"emphasis\">two</span> total imbeciles in the room, I'll put this plainly─we need to find that memo."},{"name":"CHEERFULGHOST03169","text":"Oh! So the pumpkin...the pumpkin is...the little girl? Oh no! This is terrible!"},{"name":"GLOOMYGHOST03169","text":"Indeed. Which means that you two should investigate room 201 posthaste and see if you can locate the memo. Off you go."},{"name":"CHEERFULGHOST03169","text":"Hey, look! A thing! Doesn't this look like the thing we're looking for?"},{"name":"SYSTEM","text":"The conspicuous memo contains notes scrawled in an unpracticed hand."},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Ahriman<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Bat<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Ahriman + Succubus<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Bat + Succubus<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Bat + Ahriman + Succubus<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Bat + Succubus + Succubus<br>Room Number = Eyes"},{"name":"CHEERFULGHOST03169","text":"This has to be the one. It says “pumpkin” on it and everything!"},{"name":"CHEERFULGHOST03169","text":"Now we just need to count some eyeballs! You can do that, right? You seem like a great eyeball-counter."},{"name":"CHEERFULGHOST03169","text":"Oh, and the eyeballs reminded me of these other balls! The pumpkin-headed lady gave them to me. They're subliming smokebombs that can break any skinchanger curse."},{"name":"CHEERFULGHOST03169","text":"Just throw one at any old jack-o'-lantern you see, and it will turn back into its original form. Unless its original form was a pumpkin. Then it will stay the same!"},{"name":"CHEERFULGHOST03169","text":"That little girl must be so scared. Hurry and find the room─I'll be right behind you. Oh, but not in a haunting way! In a helpful way!"},{"name":"SYSTEM","text":"Decoding the memo and checking its solution against the Cellarage room numbers on your map will allow you to quickly locate the transformed captive amongst the plethora of suspicious pumpkins in the manor."},{"name":"CHEERFULGHOST03169","text":"Did you figure out what room in the cellarage we need? I think it has something to do with the total number of eyeballs! Oh, but you probably knew that, since you seem like someone who would be good at understanding memos."},{"name":"CHEERFULGHOST03169","text":"Just remember to use the subliming scalebombs when you find the right pumpkin. Otherwise you'll just be standing there, staring at a pumpkin! Which isn't so different from what I used to do every day, come to think of it."},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Ahriman<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Bat<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Ahriman + Succubus<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Bat + Succubus<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Bat + Ahriman + Succubus<br>Room Number = Eyes"},{"name":"SYSTEM","text":"(-Mummer's Memo-)Pumpkin─Cellarage<br>Bat + Succubus + Succubus<br>Room Number = Eyes"},{"name":"SYSTEM","text":"As the smoke clears, the pumpkin remains a mere festive gourd..."},{"name":"CHEERFULGHOST03169","text":"I knew that you would be skilled at pumpkin identification! And you did it, you saved the little..."},{"name":"CHEERFULGHOST03169","text":"...Wait, what?"},{"name":"DAWKIN","text":"(-???-)I can finally stretch my legs again! I finally <span class=\"emphasis\">have</span> legs again. Ahhh..."},{"name":"CHEERFULGHOST03169","text":"Aaaaaahhh!"},{"name":"DAWKIN","text":"Aaaaaahhh!!!"},{"name":"CHEERFULGHOST03169","text":"O-Oh gods, the little girl turned into a large man! It's terrible! It's dreadful! It's the greatest travesty this world has ever seen!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You shouldn't judge based on appearances, you know."},{"name":"A2","text":"I'm pretty sure that's a different person."},{"name":"CHEERFULGHOST03169","text":"You're right. Quick, let's go ask if we should be screaming or not!"},{"name":"CHEERFULGHOST03169","text":"Oh, that does make more sense, come to think of it! Well, even if he isn't the girl we're looking for, we should probably follow him, don't you think?"},{"name":"CHEERFULGHOST03169","text":"I found him! I'm helping!"},{"name":"DAWKIN","text":"Augh! Ghost stalker! Alright, Dawkin, keep it together..."},{"name":"DAWKIN","text":"(-Dawkin-)Wait a minute, I know you. I apologize for my outburst─I'm a little on edge. One minute I was enjoying the masquerade, you see, and the next I'm a pumpkin in a dungeon. It's a bit much to take in."},{"name":"DAWKIN","text":"(-Dawkin-)Wait a minute, you're neither a ghost nor a stalker, are you? You're just an adventurer. My apologies─I'm a little on edge. One minute I was enjoying the masquerade, you see, and the next I'm a pumpkin in a dungeon. It's a bit much to take in."},{"name":"TMARITAA","text":"Dawkin!"},{"name":"DAWKIN","text":"(-Dawkin-)Oh, little T'maritaa! You're considerably less orange than I was a moment ago, so I take that to mean that you've been safe in your hiding place all this time?"},{"name":"TMARITAA","text":"Yep, I'm the best hider! There's not a fiend who's found me yet!"},{"name":"CHEERFULGHOST03169","text":"Hello, I'm confused!"},{"name":"TMARITAA","text":"Well, mister ghost, I was looking around this big scary mansion for good hide-and-seek spots when one of the people from the Circus saw me and started casting a spell on me─I know because it's happened before. Dawkin jumped in front of me, but he got turned into a pumpkin!"},{"name":"TMARITAA","text":"I ran away, and I wanted to go and get help, but there were too many people from the troupe guarding the way out..."},{"name":"DAWKIN","text":"(-Dawkin-)Me, I just happened to be lost in the cellarage when I came upon that mummer casting the curse on her─not that I knew it was a curse at the time, mind, but it seemed right ominous─so I shielded her without a second thought. And then I was a pumpkin! Funny how these things happen, eh?"},{"name":"DAWKIN","text":"(-Dawkin-)Unfortunately, I wasn't much good to anyone after that. You must've been scared out of your wits all alone down here."},{"name":"TMARITAA","text":"Don't worry, I was fine! These nice brooms kept me company while I hid."},{"name":"TMARITAA","text":"Thank you for coming to save me again, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span> adventurer! And you too, mister ghost!"},{"name":"TMARITAA","text":"Thank you for coming to save us, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span> adventurer! And you too, mister ghost!"},{"name":"DAWKIN","text":"(-Dawkin-)My thanks as well. I would've hated to be stuck as a jack-o'-lantern forever. Just sitting there decoratively, serving no purpose..."},{"name":"DAWKIN","text":"(-Dawkin-)Anyway, I'd be more than happy to escort T'maritaa here home to her mother. Hopefully next time we meet, I won't be a useless ornament! Haha!"},{"name":"CHEERFULGHOST03169","text":"Wow, that was weird! And slightly offensive! But I'm glad that they're safe and everything worked out, you know, because when the pumpkin turned into a middle-aged man it was so scary and I thought we were in for a terrible tragedy for sure, but─ Oh, do you think we're supposed to tell Yin?"},{"name":"CHEERFULGHOST03169","text":"It certainly was surreal seeing a pumpkin come to life like that. But now that the mystery is solved, we can go back to reveling!"},{"name":"GLOOMYGHOST03169","text":"The little girl turned into <span class=\"emphasis\">what</span>!?"},{"name":"GLOOMYGHOST03169","text":"Oh. Oh, I see. &lt;sigh&gt; Well, what matters is that everything turned out in the end."},{"name":"CHEERFULGHOST03169","text":"And it's all thanks to <span class=\"highlight\">Forename</span>! It was really fun talking to you, and joking with you, and panicking with you, and running around with you! Come to think of it, I don't think I've ever had so much fun..."},{"name":"GLOOMYGHOST03169","text":"&lt;sigh&gt; And now that it's over, I can finally have some peace and quiet. The manor will be empty once again. And perhaps we must return to silence, as well. Not that I mind, but..."},{"name":"GLOOMYGHOST03169","text":"Do come and see us again."},{"name":"GLOOMYGHOST03169","text":"Ahem. Yes, that's quite enough for now. Wasn't someone waiting to hear from you?"},{"name":"CHEERFULGHOST03169","text":"You can come back and talk to me any time! But for now you should talk to that suspicious man outside!"},{"name":"INVESTIGATOR03169","text":"（★未使用／削除予定★）"},{"name":"IMPHEAD","text":"My pumpkin has vanished, you say? How could this be?"},{"name":"INVESTIGATOR03169","text":"Aha, there you are! I was delighted to hear that you managed to rescue the girl, even without reinforcements. The less the Impresario knows of our resources, the better."},{"name":"INVESTIGATOR03169","text":"And perhaps the troupe's failure to keep ahold of their prey will give them cause to doubt the wisdom of their plans. We can only hope─and keep a close watch, of course."},{"name":"INVESTIGATOR03169","text":"I will remain at my post here, vigilant as always. If you could keep an eye on goings-on within the manor itself, I'd be grateful."},{"name":"INVESTIGATOR03169","text":"Hm, but what to do about the <span class=\"emphasis\">other</span> issue..."},{"name":"PUMPKIN","text":"It is fitting that you bring the little ones delight, for they have watched over you for longer than you know. Heh heh heh... "},{"name":"PUMPKIN","text":"As for how the brooms that made the girl their playmate came to move, even I cannot say, for it was no magic of mine. But no matter."},{"name":"PUMPKIN","text":"At the grand masquerade of All Saints' Wake, adventurers, monsters, and silent watchers are as one."},{"name":"PUMPKIN","text":"Permit us our mischief, and we might just follow you home..."}],"reward":{"items":[{"id":23993,"one":1},{"id":23994,"one":1}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68706]},"next":[68708]},"partials":[{"type":"npc","id":"1026655","obj":{"i":1026655,"n":"Little Yang","l":2497,"q":1}},{"type":"npc","id":"1026652","obj":{"i":1026652,"n":"Adventurers' Guild Investigator","l":53,"q":3}},{"type":"item","id":"23993","obj":{"i":23993,"n":"Little Yin","l":1,"c":59707,"t":81}},{"type":"item","id":"23994","obj":{"i":23994,"n":"Little Yang","l":1,"c":59708,"t":81}},{"type":"quest","id":"68706","obj":{"i":68706,"n":"The Parlous Ploy","g":203,"l":"Haunted Manor","s":163,"r":1}},{"type":"quest","id":"68708","obj":{"i":68708,"n":"The Macabre Manor","g":203,"l":"Gridania","s":165,"f":1}}]}