{"quest":{"name":"Not-so-silent Night","location":"Gridania","id":68709,"patch":4.4,"sort":166,"icon":100805,"eventIcon":71221,"issuer":1026626,"target":1026626,"genre":204,"journal":["Amh Garanjy has need of a little helper, and who is more helpful than you?<br>※This quest is available for a limited time only.","The Starlight Celebration once again descends upon Gridania, with Amh Garanjy leading the festivities. This year, she plans to incorporate traditional Ishgardian choral singing, with presents distributed to children following the performance. Maisenta of Black Rabbit Traders has kindly offered to secure the services of a band of musicians, but little has been heard from her since. Amh Garanjy asks that you visit Maisenta at her stall to ascertain whether the concert preparations are proceeding as planned or have been beset by unforeseen difficulties.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Thankfully, it soon becomes clear that Maisenta has not forgotten about her promise to assist with the Starlight Celebration. On the other hand, she appears to have serious reservations about discussing the matter openly, and requests that the conversation be taken to a more secluded location.","Maisenta introduces you to the Homunculi, the musicians who will be gracing the Starlight Celebration. As talented as they are, their lack of familiarity with Ishgardian choral music led them to seek the aid of a composer, rather than attempt to write the songs themselves. Unfortunately for them, the manuscripts they received state that two female and two male singers are required, with highly specific─not to mention extremely cryptic─instructions as to the tone of their voices. Since there is little time to search for experienced female vocalists, it is decided that Maisenta and Amh Garanjy will fill the roles, with Augustiniel of the Homunculi assigned as one of the two males. In addition to choosing members for the choir, it seems that Maisenta has need of someone to collect a conductor's baton from the Carpenters' Guild and an order of choir surplices from the Weavers' Guild. Since Maisenta and the Homunculi are otherwise engaged, you are left as the only available candidate for the task.","Timbermaster Beatin has prepared an exquisitely whittled conductor's baton for use in the concert, while Redolent Rose of the Weavers' Guild has gone above and beyond the call of duty by producing even more choir surplices than requested. Both guildmasters reveal that Maisenta appears to have an excess of coin at her disposal, and has no qualms about investing it in her precious Homunculi. With the expensive wares safely in your possession, you make for Mih Khetto's Amphitheatre.","Amh Garanjy expresses bemusement when you arrive to deliver the conductor's baton and choir surplices, and it soon becomes clear that Maisenta has neglected to share her plans with the Starlight celebrant. When Maisenta and the Homunculi arrive, they have another surprise in store for Amh Garanjy: She has been selected─without her knowledge─as a member of the choir. Maisenta pays little heed to Amh Garanjy's initial reluctance and quickly moves on to the topic of the final member. The discussion is over almost as soon as it begins with the arrival of Baenfaeld, a hulking Roegadyn with a voice so deep one might mistake it for the lowing of an immense aurochs. Thankfully, he agrees to join the choir with only minimal persuasion required. Now that all four members have been chosen, Amh Garanjy reminds the group that they still have a conductor's baton without an owner. Once again, you demonstrate a knack for being in the wrong place at the wrong time, and find yourself involuntarily volunteered for the role of directing the performance."],"objectives":["Speak with Maisenta.","Wait for Maisenta outside the Leatherworkers' Guild.","Speak with Beatin at the Carpenters' Guild in New Gridania.","Speak with Redolent Rose at the Weavers' Guild in Ul'dah.","Deliver the conductor's baton and choir surplices to Amh Garanjy."],"dialogue":[{"name":"AMHGARANJY","text":"Ah, 'tis always a joy to welcome a new face. I am a Starlight celebrant, and you must be...an adventurer in search of festive cheer, correct?"},{"name":"AMHGARANJY","text":"<span class=\"highlight\">Forename</span>! How wonderful to see you! I just knew you'd be joining us again this year."},{"name":"AMHGARANJY","text":"We have lots of surprises in store, especially for the little ones. The Starlight Celebration wouldn't be complete without the beaming smiles of all those darling children!"},{"name":"AMHGARANJY","text":"One of said surprises will involve a tradition from the frozen climes of Ishgard. A little snow makes the world glisten and sparkle, but too much can be ever so dangerous, as the Ishgardians know all too well. That is why the adults offer song to the Saint of Nymeia, so that he may keep the blizzards at bay."},{"name":"AMHGARANJY","text":"While the weather here in Gridania is nowhere near as inclement as that, a festive song like that would make the proceedings even more memorable. And when the singing is over, we'll give each child in the audience a present!"},{"name":"AMHGARANJY","text":"Luckily, several local businesses have agreed to fund all this merrymaking. Are you familiar with Maisenta of Black Rabbit Traders, by any chance? She has been particularly eager to lend us a hand."},{"name":"AMHGARANJY","text":"From the decorations to the costumes, there is scarcely an aspect of the celebrations in which she <span class=\"emphasis\">hasn't</span> been involved."},{"name":"AMHGARANJY","text":"In fact, she has even agreed to arrange the musicians who will be singing here at Mih Khetto's Amphitheatre. The only trouble is, I haven't seen her for a while and I worry that she may have encountered...complications."},{"name":"AMHGARANJY","text":"Now, I'm sure there is nothing to worry about, but I would be ever so grateful if you could speak with her. Perhaps politely remind her that the success of the Starlight Celebration hangs in the balance?"},{"name":"AMHGARANJY","text":"I'm dreadfully sorry to impose on you like this, but we are up to our baubles in tasks that simply cannot wait. Could you do me this one teensy favor?"},{"name":"AMHGARANJY","text":"Oh, that's terrific! She's probably at her stall near the aetheryte plaza."},{"name":"AMHGARANJY","text":"I do hope Maisenta hasn't experienced any “creative differences” with these musicians of hers. Artistic types are notoriously hard to work with, but I expect she knows how to keep them in line!"},{"name":"MAISENTA","text":"<span class=\"highlight\">Forename</span>, how lovely to see you! And might I say, seldom does a day go by that I do not think of the way you saved my precious Homunculi from the Baert Trading Company."},{"name":"MAISENTA","text":"<span class=\"highlight\">Forename</span>, how lovely to see you! And yes, not only am I a staunch supporter of Hatching–tide, but the Starlight Celebration as well."},{"name":"MAISENTA","text":"Come to feast your eyes on my wares, have you? Or is there something you would like to discuss?"},{"name":"MAISENTA","text":"Well, it was never my intention to keep Amh Garanjy waiting."},{"name":"MAISENTA","text":"I will happily explain everything, as soon as we take this conversation somewhere a little more...private. Might I suggest the secluded area by the Leatherworkers' Guild?"},{"name":"MAISENTA","text":"Please excuse my need for secrecy, but the preparations for the festival have reached a crucial stage, and I cannot risk any outside interference─especially not of the female variety. All will become clear, I assure you."},{"name":"AMHGARANJY","text":"Maisenta wants to meet you somewhere secluded? Hmm... Are you sure this is about the Starlight Celebration? I can't imagine organizing a few songs would warrant this level of secrecy..."},{"name":"MAISENTA","text":"Thank you for agreeing to meet me here. I'm on good terms with Guildmaster Geva and she lets me use this space for...well, that's a story for another time. Or perhaps never."},{"name":"MAISENTA","text":"Naturally, a quiet spot like this is ideal for avoiding unwanted attention, while the guard─who has been asked to turn a blind eye─is an effective deterrent to any would-be eavesdroppers. "},{"name":"MAISENTA","text":"As I am sure you know, the Homunculi cause a stir wherever they go, and I need them focused on the task at hand. It's strange to think that without your intervention all those moons ago, they would have escaped my clu─ahem─would have been lost to me forever, and here we all are, reunited."},{"name":"MAISENTA","text":"You will no doubt be pleased to hear that since the last time you saw them, my honey-tongued musical geniuses have been touring the breadth of the realm. Naturally, Black Rabbit Traders continue to enjoy a profitable relationship with Eorzea's most beloved traveling bards."},{"name":"MAISENTA","text":"I expect you remember the Homunculi from Hatching–tide all those years ago. Or maybe you've seen them delighting crowds and stealing hearts while on your travels?"},{"name":"MAISENTA","text":"We of Black Rabbit Traders are more than happy to cover their expenses provided that they perform dressed in our wares. I can only hope that their post-concert proclivities do nothing to endanger our reputation..."},{"name":"MAISENTA","text":"It gives me great pleasure to introduce the Homunculi, the greatest musical sensation the realm has ever known. While I am not one to boast, I should point out that I played no small part in bringing them and my organization, Black Rabbit Traders, together in a mutually beneficial partnership."},{"name":"MAISENTA","text":"We cover their expenses while they promote our fine range of fashionable attire as they enchant hoards of besotted onlookers. Although I should warn you─any rumors of them siring a string of bastards across Eorzea are entirely unfounded. Well, mostly unfounded."},{"name":"MAISENTA","text":"Of course, it won't do to have this conversation interrupted by legions of squealing followers, hence our current venue. As for their role in the Starlight Celebration, I jumped at the chance to have them take center stage."},{"name":"MAISENTA","text":"Admirers will flock from malms around for the chance to see the Homunculi and their new, specially prepared material."},{"name":"MAISENTA","text":"I can picture it now... The dulcet tones of my beautiful bards filling the ears of festival-goers young and old, with Black Rabbit Traders making gil hand over fist from all of the garments we sell."},{"name":"MAISENTA","text":"And what's more, the presence of such renowned artists will raise the profile of the celebration, meaning that Amh Garanjy and her Starlight celebrants will have even more reason to be cheerful."},{"name":"MAISENTA","text":"All that remains is for the Homunculi to fulfill their part of the bargain, and put together a few songs for the concert itself. Therein lies the problem."},{"name":"OSCARLET","text":"Were this any other performance, we would mesmerize the crowds with a few favorites from our repertoire, such as “Fair Lady, Return My Breeches” or “Hey Nonny, Nonny, Maiden Most Bonny.” Fearing that such material may not be...appropriate, we thought it best to work on some new pieces."},{"name":"AUGUSTINIEL","text":"But this occasion calls for traditional Ishgardian music, whereas we weave our entrancing melodies in the classic Gridanian style. To better fulfill the needs of the Starlight Celebration, we sought the aid of an Ishgardian composer."},{"name":"AUGUSTINIEL","text":"Upon taking receipt of the manuscripts, however, we found that they were written for a mixed choir. Four singers, two male and two female. It does not take a musical aficionado to appreciate that the Homunculi are ill-equipped for such a performance."},{"name":"ORSELFAUXL","text":"To make matters worse, there simply isn't time to have the pieces rewritten. We are well and truly out of our element, like proverbial babes in the wood. Whatever will we do?"},{"name":"MAISENTA","text":"All of this moping is getting us nowhere! Are you professionals or not? "},{"name":"MAISENTA","text":"What we need are solutions, and fast. First of all, let us select our vocalists."},{"name":"MAISENTA","text":"Luckily, the composer has provided instructions on the kind of voices required to carry the melody. Though I must admit, I can make neither head nor tail of these notes."},{"name":"MAISENTA","text":"One of the female voices must be “as uplifting as birdsong on a crisp winter's morning,” and the other “ephemeral as a zephyr across a sun-dappled stream.” For the males, “reminiscent of a mighty oak's outstretched boughs” and “deep and cavernous as the bowels of the earth.”"},{"name":"MAISENTA","text":"We have to start our search somewhere I suppose."},{"name":"MAISENTA","text":"<span class=\"highlight\">Forename</span>, perhaps you can help."},{"name":"MAISENTA","text":"Can you think of anyone who possesses a voice “as uplifting as birdsong on a crisp winter's morning?”"},{"name":"Q1","text":"Who will you suggest?"},{"name":"A1","text":"Amh Garanjy."},{"name":"A1","text":"Fufucha of the Botanists' Guild."},{"name":"A1","text":"A chocobo."},{"name":"MAISENTA","text":"Why hadn't I thought of that? If the cheerful manner in which she speaks is any indication, her singing voice may be exactly what we are looking for."},{"name":"MAISENTA","text":"Being a Starlight celebrant, she can hardly refuse. I daresay you've found the perfect candidate."},{"name":"MAISENTA","text":"Hmm...I can picture her being able to carry a tune. But wouldn't her duties as guildmaster take priority?"},{"name":"MAISENTA","text":"Thank you for the suggestion, though. I was actually planning to ask Amh Garanjy, mainly because she is the person least likely to refuse."},{"name":"MAISENTA","text":"A chocobo!? Where the manuscripts mention birdsong, I don't think it was supposed to be taken literally! We can't have one of those smelly beasts kweh-ing its way through the concert."},{"name":"MAISENTA","text":"If I were you, I would avoid making similar japes in future─ It really doesn't suit you, dear. For lack of any better suggestions, how about...Amh Garanjy? Come to think of it, she may well be the perfect choice. A charming young lady like her is sure to have a singing voice to match."},{"name":"MAISENTA","text":"With that settled, we should move on to our second female vocalist. Can you think of anyone with a voice as “ephemeral as a zephyr across a sun-dappled stream?”"},{"name":"Q2","text":"Who will you suggest?"},{"name":"A2","text":"You, Maisenta!"},{"name":"A2","text":"Kan–E–Senna, the Elder Seedseer."},{"name":"A2","text":"Ephemeral as a what?"},{"name":"MAISENTA","text":"Me!? You must be joking!"},{"name":"MAISENTA","text":"You're serious, aren't you? Hmm...I am somewhat partial to humming the odd tune while enjoying a long soak in the bath. I should be able to get through it without making too big a fool of myself. And it's for a good cause."},{"name":"MAISENTA","text":"The Elder Seedseer herself!? Have you taken leave of your senses? Generous and benevolent she may be, but I struggle to imagine her joining our little choir group!"},{"name":"MAISENTA","text":"There's only one thing for it: I will just have to do it myself. My devotion to the Homunculi and Black Rabbit Traders compels me! There is also the fact that I have already invested too much in this venture to allow it to fail now."},{"name":"MAISENTA","text":"Well, I think we will have to disregard the composer's instructions in this case. Seeing as we are hardly spoiled for choice, perhaps we should set our sights a little lower."},{"name":"MAISENTA","text":"And by that, I mean “any woman who can sing.” Since time is of the essence, I nominate myself to fill this position. As much as I would rather avoid public humiliation, I will not have it said that I lack commitment."},{"name":"AUGUSTINIEL","text":"Maisenta, my darling! It would be an honor to join my voice with yours in musical matrimony!"},{"name":"MAISENTA","text":"Let's not get carried away! For all you know, I could be a dreadful singer!"},{"name":"OSCARLET","text":"Fear not, my lady, for we shall be on hand to provide all the tutelage you might require. Though the question remains─which two lucky fellows will be accompanying you?"},{"name":"ORSELFAUXL","text":"“Reminiscent of a mighty oak's outstretched boughs.” I would say that description fits Augustiniel's soaring vocals."},{"name":"MAISENTA","text":"I couldn't agree more. Finding someone whose voice is “deep and cavernous as the bowels of the earth” may prove a little more challenging. The Homunculi's music rarely ventures into the lower notes."},{"name":"MAISENTA","text":"At the risk of volunteering myself for that role too, mayhaps we should put that matter to one side for now."},{"name":"MAISENTA","text":"<span class=\"highlight\">Forename</span>, might I be able to ask a favor of you? Two favors, actually."},{"name":"MAISENTA","text":"Keen as always! And I haven't even told you what the favors are yet!"},{"name":"MAISENTA","text":"I need you to collect a conductor's baton from Beatin of the Carpenter's Guild, as well as an order of choir surplices from Redolent Rose over at the Weavers' Guild in Ul'dah."},{"name":"MAISENTA","text":"After paying a visit to these master artisans, head straight to Amh Garanjy in Mih Khetto's Amphitheatre. She will be expecting you."},{"name":"MAISENTA","text":"In the meantime, it seems prudent for us to rehearse away from prying...ears. Now, make haste, <span class=\"highlight\">Forename</span>!"},{"name":"BEATIN","text":"How might I help you?"},{"name":"BEATIN","text":"So, <span class=\"highlight\">Forename</span>, are you any closer to becoming one with the wood?"},{"name":"BEATIN","text":"Welcome back, <span class=\"highlight\">Forename</span>. Are you here to show me your latest creation?"},{"name":"BEATIN","text":"Ah, yes. I have the conductor's baton right here."},{"name":"BEATIN","text":"Since the guild seldom receives orders for such items, I thought it best to deal with this one personally. The maple gives it a certain degree of flexibility while the cork grip allows it to be held between thumb and index finger without fear of dropping it."},{"name":"BEATIN","text":"I am confident that Maisenta will appreciate the quality of the craftsmanship. While my services do not come cheap, she is sure to feel that her money was well spent."},{"name":"BEATIN","text":"And spend she did. In all honesty, a simple twig would probably suffice, but nothing is too good for her Homunculi. I must admit, I do not see the appeal in those preening pretty boys. The sigh of a saw on wood and the tap of a hammer on chisel are all the music I need."},{"name":"BEATIN","text":"Have a care as you transport that baton. 'Tis such a slight thing, you may even forget you have it on your person, until you sit down and hear a snap."},{"name":"REDOLENTROSE","text":"Oh, what's this? A customer? Or perhaps some lackey sent on an errand?"},{"name":"REDOLENTROSE","text":"Well, well. If it isn't <span class=\"highlight\">Forename</span>. I trust you have not been neglecting your needlework."},{"name":"REDOLENTROSE","text":"The choir surplices? Not the most challenging request the guild has received, but a welcome change from all the plebeians asking us to add arse flaps to their culottes."},{"name":"REDOLENTROSE","text":"Another pleasant surprise was the amount Maisenta was willing to pay for them. So generous was she that I thought it only fair to include a few more. Knowing her, she will find a way to pitch them to festival-goers, so any surplus surplices could be sold on for a profit."},{"name":"REDOLENTROSE","text":"This could even mark the beginning of a very lucrative venture for Black Rabbit Traders and the Weavers' Guild."},{"name":"REDOLENTROSE","text":"Our mutual acquaintance is undoubtedly counting the gil as we speak, so I suggest you deliver these garments to her posthaste. Best of luck with the Starlight Celebration!"},{"name":"REDOLENTROSE","text":"Was I speaking to myself when I told you to “deliver these garments posthaste?” No? I didn't think so. Now, off you go!"},{"name":"AMHGARANJY","text":"You're back! I was considering sending out a search party for you too! Is everything all right?"},{"name":"AMHGARANJY","text":"Unless I am very much mistaken, these look remarkably like a conductor's wand and some sort of smocks. This may seem like an odd question, but...why are you giving these to me?"},{"name":"MAISENTA","text":"(-???-)Did I forget to tell you? Not to worry. All will become clear once you've changed into your surplice and are ready to rehearse."},{"name":"AMHGARANJY","text":"Rehearse? But I don't remember agreeing to sing! And I'm fairly certain you never even asked me!"},{"name":"MAISENTA","text":"Sorry, dear. Change of plans. To be honest, knowing how committed you are to the Starlight Celebration, it never occurred to me that you might be opposed to the idea."},{"name":"AMHGARANJY","text":"Well, we cannot disappoint the little ones... I suppose it is only meet that I at least try."},{"name":"AMHGARANJY","text":"Very well. I'll do it!"},{"name":"MAISENTA","text":"If it makes you feel any better, I will be singing too. Bear in mind that I lack your experience when it comes to entertaining the masses, so if there is anyone who should be nervous, it's me."},{"name":"MAISENTA","text":"Besides, there's no time for dilly-dallying. We still have to find a man with a voice “deep and cavernous as the bowels of the earth.”"},{"name":"BAENFAELD","text":"Are these the musicians? We'd better start checking the amphitheatre's...what did you call 'em? ...Accuse sticks? No, that don't sound right..."},{"name":"MAISENTA","text":"You there! Are you one of the Starlight celebrants?"},{"name":"BAENFAELD","text":"Aye, and a member of the Adventurers' Guild besides. Every year, they give me leave to help out with the festival."},{"name":"AUGUSTINIEL","text":"Remarkable...his every word reverberates to the core of my soul. “Deep and cavernous as the bowels of the earth?” Why, he's Titan incarnate!"},{"name":"MAISENTA","text":"My thoughts exactly. Who could have guessed that the perfect candidate was under our noses─figuratively speaking, of course─this whole time. How would you like to join our choir?"},{"name":"BAENFAELD","text":"I don't see why not. When it comes to bein' big and loud, no one does it better than me!"},{"name":"AUGUSTINIEL","text":"Ha ha! Glad to hear! While I would normally balk at sharing my stage with rank amateurs, I am willing to make an exception. Obviously, none of you can even hope to reach my standards, but with sufficient practice, we should be able to approach “adequate” or even “not displeasing.”"},{"name":"MAISENTA","text":"As for Oscarlet and Orselfaux, I have something else in mind. While you may not be serenading us with your angelic vocals, you will instead be blessing the children with the presents I have prepared."},{"name":"MAISENTA","text":"I will make sure they keep their hands off of the children's mummies, no matter how “yummy” they might be. If the Homunculi can limit their flirtations to a well-timed wink here and a cheeky smile there, we'll have them eating out of our hands, without any “lasting repercussions.”"},{"name":"AMHGARANJY","text":"Ummm...I have a question. Who is this conductor's stick for?"},{"name":"MAISENTA","text":"You catch on quickly, don't you? I'm not asking you to do this entirely from the goodness of your heart. I will see to it that you are appropriately remunerated. In some form."},{"name":"MAISENTA","text":"I would say compared to the four members of the choir, you have the easy job. Judging from what I've seen at other concerts, you just need to look the part and wave the baton a bit. Simple."},{"name":"BAENFAELD","text":"Rather you than me, friend. I wouldn't know where to start! I'm much more comfortable bellowin' away to me heart's content. Anyway, let me know when you're ready for some conductin'."}],"reward":{"gil":1248},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[68710]},"partials":[{"type":"npc","id":"1026626","obj":{"i":1026626,"n":"Amh Garanjy","l":53,"q":1}},{"type":"quest","id":"68710","obj":{"i":68710,"n":"A Concerted Effort","g":204,"l":"Gridania","s":167,"r":1}}]}