{"quest":{"name":"Don't Do the Dewprism","location":"Kugane","id":68704,"patch":4.56,"sort":90,"icon":100835,"unlocksFunction":1,"eventIcon":71341,"issuer":1025885,"target":1026766,"genre":70,"journal":["Shigure wants answers now or he wants them eventually.","Shortly after the Wolf Burglar was detained by the Sekiseigumi, Master Akebono stormed into the gaol and began demanding the return of stolen goods other than the Soboro Sukehiro. Though the merchant was less than forthcoming with details, the Lupin revealed to Shigure that it was a plain, unmarked satchel filled with a white powder─presumably a medicine of some sort. Unsure what it was at the time, the thief gave it to Koju for safekeeping, who presumably still has it, and will not relinquish it unless you recite the proper password: “As above, so below.”","Upon hearing the requisite words, Koju gives over the mysterious powder, the purpose of which remains unknown. Without the aid of an alchemist versed in the Hannish traditions, you are unlikely to ascertain its nature. Fortunately, the Thavnairian Consulate is within walking distance.","As Shigure foresaw, one does not simply go and bang on the gates of a foreign consulate and expect to be received with open arms. The kami are feeling particularly whimsical this day, though, for it is then that Godbert Manderville, devoted father of Inspector Hildibrand, calls out to his beloved son and comrades. During the brief exchange of pleasantries, Lord Godbert's comrade introduces himself as representative of the Sahjattra Concern, which trades in all manner of alchemical goods. The Han subsequently identifies the mysterious powder as an essential ingredient used to create dewprism, a thimbleful of which is enough to befuddle the senses and make one susceptible to commands. The mystery is solved: Akebono has been using this dewprism to manipulate wealthy and influential individuals like Master Kumode to build his mercantile empire. Satisfied, Shigure would bring an end to his dastardly schemes once and for all.","As Shigure was unable to foresee, one does not simply go and bang on the doors of a conniving criminal's estate and expect him to be home, much less willing to give up without a fight. Before you can even begin to discuss your next course of action, the Wolf Burglar appears, revealing that he only surrendered himself earlier to secure Shigure's release and lull Akebono into a false sense of complacency, after which he would then secure your cooperation to bring Akebono to justice. Though he knows not where the merchant is now, he knows where he will be: the Isle of Bekko, where he is to meet a silent partner and plot more villainy, no doubt.","As you spy upon the clandestine meeting, you are shocked to see Akebono in the company of the Sahjattra Concern representative you met before, as well as Lord Godbert, who is clearly under the influence of dewprism. Unable to restrain himself, Inspector Hildibrand reveals himself and implores his father to break free of the drug's thrall. Alas, this only serves to draw his attention to Shigure, Greg, and the Wolf Burglar, who are swiftly dispatched by the might of the Hammer. However, Godbert then turns on his supposed masters, apparently unable to distinguish friend from foe. And so it falls to Hildibrand Helidor Maximilian Manderville to meet the man from whose loins he sprung in mortal combat. You can but look on, mesmerized, as son launches into the air, arms wrapped around his father, as he mournfully sings the song of his house in a vain effort to wake the man he so desperately loves from his madness, only to discover to his delight and dread that performing one of the traditional Mandervillian martial techniques triggers an instinctive response─an irreversible reversal, leaving the inspector helpless before the impending onslaught...<br><br>After the dust has settled, Godbert apologizes for his excess. But in spite of the minor cataclysm, all is well. Akebono and the Han have been exposed and will face justice, and the Soboro Sukehiro, which Akebono just so happened to be carrying, can be returned to its rightful owner, the Wolf Burglar. Having avenged his father, the Lupin is content to return to his cell in Kugane, but Shigure, to everyone's surprise, insists that he leave with the sword instead. And so the Wolf Burglar departs, Soboro Sukehiro in hand, to pay his respects to the samurai who loved him as family. For a fleeting moment, it seems as though it will be an almost unreasonably happy ending for all...which is perhaps why the Hannish co-conspirator, in a fit of petulance, uses a hidden supply of dewprism to enthrall Greg and command him to spirit him far away. And so the warrior somehow opens a massive portal and drags the Han, Inspector Hildibrand, and Nashu Mhakaracca to wondrous worlds unseen.","Intending to deliver him to the Sekiseigumi in person, Lord Godbert takes Akebono and departs for Kugane, and Shigure suggests you do the same. And really, after the earlier spectacle, what else is there left to say?","Much will change in the wake of Akebono's fall, Shigure explains. The medicines he once hoarded and sold for unreasonable profits will be sold to more merchants due to the intervention of Hannish officials, thereby ensuring lower prices and greater supply. All indebted to Akebono will be absolved of their debts, for they were secured through immoral means. This, in particular, Shigure considers to be the greater victory now, for his experiences with you and the others have helped him to understand that the world is anything but black and white. While he may not agree with the Wolf Burglar's methods, he understands that he is a noble soul─though should he ever forsake his principles, Shigure will not hesitate to bring him to justice. A necessary sentiment, perhaps, though if your experiences with the Lupin are any indication, he will keep to his chosen path.<br><br>And Inspector Hildibrand? Well, as a former inquisitor once mused, he will no doubt turn up again like a bad gil─and when he does, trouble is sure to follow...<br><br>※The next Hildibrand quest will be available from the excitable youth in Radz–at–Han once you have met the following requirements:<br>※ FINAL FANTASY XIV: Endwalker must be registered to your service account.<br>※ You must have completed the main scenario quest “Endwalker.”"],"objectives":["Speak with Koju.","Seek an audience at the Thavnairian Consulate.","Speak with Hildibrand.","Follow the Wolf Burglar to the Ruby Sea.","Speak with Shigure.","Speak with Shigure in Kugane."],"dialogue":[{"name":"HILDIBRAND","text":"What ho, Shigure! Over here!"},{"name":"SHIGURE","text":"My friends, I cannot thank you enough. Had you not arrived when you had, I would not be standing before you now."},{"name":"SHIGURE","text":"You will forgive me for dispensing with further expressions of gratitude, for I have just returned from the gaol where I spoke with the Wolf Burglar, who shared with me some rather troubling information..."},{"name":"HILDIBRAND","text":"Do not keep us in suspense, my good man. What is it?"},{"name":"SHIGURE","text":"Not long after we delivered the Wolf Burglar into the custody of the Sekiseigumi, Master Akebono stormed into the gaol and began berating the turnkey, demanding that they return the stolen contents of his safe."},{"name":"SHIGURE","text":"You may recall that we spoke with Master Akebono concerning this theft shortly after we first met."},{"name":"SHIGURE","text":"He was rather secretive regarding said contents at that time, but the Wolf Burglar said it was an unmarked satchel filled with a white powder. Given Master Akebono's reputation as a purveyor of medicines, our chivalrous thief resolved to steal it for the benefit of the poor and needy, as is his wont."},{"name":"SHIGURE","text":"However, since there was nothing to identify what manner of medicine it was, the Wolf Burglar decided to hold on to it for safekeeping. Plainly, however, it was no ordinary medicine, for why else would Master Akebono clamor for it so?"},{"name":"HILDIBRAND","text":"My keen inspector's sense is tingling... Where is this satchel now?"},{"name":"SHIGURE","text":"In the possession of the men and women of the waterways. They will not admit this, however, unless we give them the proper password: “As above, so below.”"},{"name":"HILDIBRAND","text":"Understood! Let us hasten to their den of iniquity!"},{"name":"GILGAMESH","text":"'Twas just in the nick. Or before the nick, I should say..."},{"name":"SHIGURE","text":"Hello there, Koju! Enjoying another fine <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> in the waterways?"},{"name":"NASHUMHAKARACCA","text":"I'm no good with dark places. Too easy to trip and bump your noggin!"},{"name":"SHIGURE","text":"Somehow I doubt they'll ever consider me a friend..."},{"name":"GILGAMESH","text":"A fine hideaway this is, away from the prying eyes of the local constabulary."},{"name":"KOJU","text":"Knew you lot'd turn up again sooner or later. Didn't expect you'd be bringin' along another unfamiliar face, though..."},{"name":"KOJU","text":"No matter. I like the cut of his jib. So─what are you after this time?"},{"name":"SHIGURE","text":"A certain satchel containing a certain white powder which once belonged to a certain merchant. The Wolf Burglar told me you have it..."},{"name":"KOJU","text":"If he did, then he'd've told you the magic words, too."},{"name":"SHIGURE","text":"Ah, yes, of course. They are─"},{"name":"HILDIBRAND","text":"Soar high above and never go low!"},{"name":"SHIGURE","text":"What? Kami take me, no! This is no time for fun and games, Inspector..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"As above, so below!"},{"name":"A1","text":"Get low─get low, get low, get low!"},{"name":"A1","text":"I will go whither the <span class=\"emphasis\">wild rose</span> blooms!"},{"name":"A1","text":"...Let me get back to you."},{"name":"KOJU","text":"Aye, that's it. Nothin' personal, but we've got to be careful..."},{"name":"KOJU","text":"Eh? Pull the other one, it's got bells on!"},{"name":"SHIGURE","text":"What are you doing, <span class=\"highlight\">Forename</span>? Don't antagonize the man! Or have you really forgotten what the password was!?"},{"name":"KOJU","text":"Damned if I know what it is, but my gut tells me it's nothin' no honest man would keep in a locked safe."},{"name":"SHIGURE","text":"That said, a suspicious powder is far from incontrovertible proof of criminal misdeeds. We need to first determine what it is. Any ideas how we might do so?"},{"name":"SHIGURE","text":"Seek the assistance of a Hannish alchemist or someone versed in their alchemical traditions? Hmm...perhaps someone at the Thavnairian Consulate?"},{"name":"HILDIBRAND","text":"Brilliant minds think alike, for I too reached that conclusion but a moment ago!"},{"name":"HILDIBRAND","text":"To the Thavnairian Consulate, my friends!"},{"name":"SHIGURE","text":"Here, you can't simply go and bang on the gates of a foreign consulate and expect to... &lt;sigh&gt; Oh, never mind..."},{"name":"KOJU","text":"Rich folks don't keep run-of-the-mill medicines hidden in safes guarded by men with truncheons. Mark me─that powder's dangerous."},{"name":"SHIGURE","text":"...It is all rather sudden, I realize, but to reiterate, it is of the utmost importance that we speak with your superiors."},{"name":"MULNITH","text":"To reiterate: have you lot an appointment or not?"},{"name":"SHIGURE","text":"Not as such, no..."},{"name":"MULNITH","text":"Then my hands, they are tied. There are procedures, samurai, and much paperwork. No exceptions can be made."},{"name":"SHIGURE","text":"Under normal circumstances I would agree, but this is a matter of...of public safety and welfare! Surely an exception can be made!?"},{"name":"GODBERT","text":"(-???-)What ho, young Manderville man!"},{"name":"HILDIBRAND","text":"Father!"},{"name":"GODBERT","text":"What brings you to the far side of the world?"},{"name":"HILDIBRAND","text":"A complex series of events too exhausting to detail. Of greater importance is what brings us to the consulate. You see, we must needs enlist the assistance of a Hannish alchemist, or one with an encyclopedic knowledge of Hannish reagents─"},{"name":"RADZATHANMERCHANT03168","text":"How fortunate, then, that we should chance to meet. I am a representative of the Sahjattra Concern─of Radz–at–Han, should you know not the name. We trade in all manner of alchemical goods."},{"name":"RADZATHANMERCHANT03168","text":"If your quandary requires the expertise of one versed in such wares, pray permit me to assist you. Indeed, to aid the son of Lord Godbert Manderville and his comrades would be an honor most great."},{"name":"SHIGURE","text":"That is most generous of you! Far be it from us to refuse."},{"name":"SHIGURE","text":"Perhaps a change of venue is in order? I say, let us not impose upon these hardworking keepers of the peace any longer."},{"name":"RADZATHANMERCHANT03168","text":"This powder, it is most fascinating. An ingredient of Hannish origin, this is true, but not one intended for medicinal purposes."},{"name":"RADZATHANMERCHANT03168","text":"Dangerous purposes, rather, and for this reason its sale is forbidden. In the hands of a master alchemist it could be used to create dewprism..."},{"name":"SHIGURE","text":"I'm sorry─dewprism?"},{"name":"RADZATHANMERCHANT03168","text":"A most powerful drug. A mere thimbleful is enough to befuddle the senses, and render even the most strong-willed subject susceptible to any and all commands."},{"name":"RADZATHANMERCHANT03168","text":"You may be assured this is not an exaggeration. Resistance is, most regrettably, quite futile."},{"name":"RADZATHANMERCHANT03168","text":"Undetectable, it is, save for the occasional glimmer in the eyes─a changing of the color, fleeting and impossible."},{"name":"SHIGURE","text":"By the kami...I have seen such a glimmer before!"},{"name":"RADZATHANMERCHANT03168","text":"Oh? Are you quite sure it was not a trick of the light?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I saw it too! Master Kumode is being manipulated!"},{"name":"A2","text":"This is Akebono's doing! He must be using dewprism for evil ends!"},{"name":"HILDIBRAND","text":"W-Well deduced, my faithful assistant and undying fan! I was just about to voice the same conclusion!"},{"name":"RADZATHANMERCHANT03168","text":"Well! If what you say is true, then a most terrible crime has been committed. Evidence must be gathered, and those responsible must be punished..."},{"name":"SHIGURE","text":"It all makes sense now. Why else would the chief coincounter of the Sekiseigumi press so strongly to end an investigation into a modest merchant? Because he drugged him during their meeting! At last, we have motive, means, and opportunity! Come─let us put an end to this once and for all!"},{"name":"SHIGURE","text":"How wonderful it is to see Hildy's infectious enthusiasm inspire others to rise to the occasion once more! Well then─do not let me detain you!"},{"name":"HILDIBRAND","text":"Akebono! We call on you to come forth and answer for your dastardly deeds!"},{"name":"NASHUMHAKARACCA","text":"...Doesn't seem like anybody's home, does it?"},{"name":"HILDIBRAND","text":"Wherever could he possibly be...?"},{"name":"SHIGURE","text":"Huh!? But that's impossible!"},{"name":"KUGANEWOLFBURGLAR","text":"Hah! Thought you'd seen the last of me, did you?"},{"name":"KUGANEWOLFBURGLAR","text":"As if I'd content myself with sitting in a gaol I could escape on a whim while you lot bungle your chance to bring my nemesis to justice."},{"name":"KUGANEWOLFBURGLAR","text":"And by escaping on someone else's watch, no one can pin the blame on you this time, eh? Wouldn't want a repeat of before."},{"name":"SHIGURE","text":"Don't tell me this was your plan all along! To secure my freedom so we could expose Akebono's crimes together?"},{"name":"KUGANEWOLFBURGLAR","text":"And reclaim the Soboro Sukehiro into the bargain, aye! This is no small undertaking, and I knew I'd need all the help I can get."},{"name":"KUGANEWOLFBURGLAR","text":"Now that we're all on the same page, let's be on our way. The bastard's bound for the Isle of Bekko─off to meet with a silent partner, I'm told."},{"name":"HILDIBRAND","text":"Capital! If we hurry, perhaps we can beat Akebono to the punch!"},{"name":"KUGANEWOLFBURGLAR","text":"He may be an idiot, but he's got the right idea. There's no time to waste!"},{"name":"SHIGURE","text":"Very well! If that is the way the winds are blowing, let no one say I don't also blow!"},{"name":"KUGANEWOLFBURGLAR","text":"This is the place─I'm sure of it. All we have to do is wait..."},{"name":"HILDIBRAND","text":"Father!?"},{"name":"SHIGURE","text":"By the kami! Could it be that the inspector's father is in league with Akebono!?"},{"name":"KUGANEWOLFBURGLAR","text":"Don't be daft. Look closer..."},{"name":"AKEBONO","text":"...As always, your discretion in these matters is greatly appreciated."},{"name":"RADZATHANMERCHANT03168","text":"As is yours, Master Akebono. But to the matter at hand: the dewprism. It has served you well? Met your expectations, I trust?"},{"name":"AKEBONO","text":"Hah hah hah! Exceeded them, I should say! Never in my wildest dreams could I have imagined that a drug could be so powerful, so effective!"},{"name":"AKEBONO","text":"Tasteless, odorless, colorless─the chief coincounter had no idea his drink had been compromised! He has already proven to be a most useful tool in manipulating the Sekiseigumi, more than worth the regular upkeep to keep him in my thrall."},{"name":"AKEBONO","text":"Now that the Soboro Sukehiro is back where it belongs, I can set my sights on much bigger prizes. The bugyosho, perhaps? Magistrate Akebono, hah! Why not? All Kugane is mine for the taking!"},{"name":"RADZATHANMERCHANT03168","text":"You are more right than you know, Master Akebono, for I come bearing a gift courtesy of Manderville & Manderville, a most illustrious Eorzean consortium of which you have doubtless heard."},{"name":"RADZATHANMERCHANT03168","text":"Their resources are considerable, and their influence extends far beyond the borders of Aldenard. But all their wealth pales in comparison to what I present to you now..."},{"name":"RADZATHANMERCHANT03168","text":"As we discussed, Lord Godbert, you will serve Master Akebono faithfully and without question, will you not?"},{"name":"GODBERT","text":"But...but of course..."},{"name":"SHIGURE","text":"Kami forfend! He's under the influence of dewprism!"},{"name":"KUGANEWOLFBURGLAR","text":"Wait, you fool! Now is not the time!"},{"name":"HILDIBRAND","text":"Father, 'tis I! Your beloved son, Hildibrand! Hearken to me─these men are villains! You are being deceived!"},{"name":"RADZATHANMERCHANT03168","text":"The inspector arrives, as I knew he would. Doubtless your friends are cowering in hiding? Just as well. In one fell swoop, we shall bring an end to this farce!"},{"name":"RADZATHANMERCHANT03168","text":"I call upon Eorzea's most fearsome of goldsmiths! I call upon the Hammer! Go forth and lay waste to these interlopers!"},{"name":"SHIGURE","text":"Oh...oh dear..."},{"name":"AKEBONO","text":"Bwahahahaha! Magnificent! Finish them all! Finish EVERYONE!"},{"name":"HILDIBRAND","text":"It falls to you, Hildibrand Helidor Maximilian Manderville..."},{"name":"HILDIBRAND","text":"Forgive me, Father, but you know not what you do!"},{"name":"HILDIBRAND","text":"You're a Mander-Mander-Manderville─♪"},{"name":"GODBERT","text":"Manderville maaaaaaaaan!♪"},{"name":"HILDIBRAND","text":"Abort, Father, abort! Spare me your Reverse Manderville Meteor Strike!"},{"name":"GODBERT","text":"Whew...and I'm spent. Hmm? What happened here?"},{"name":"GODBERT","text":"Well! This is all very embarrassing, very embarrassing indeed. A thousand pardons to you all for my rather excessive display of martial prowess!"},{"name":"GODBERT","text":"Oh, and it should go without saying, but Manderville & Manderville will be severing all ties with the Sahjattra Concern."},{"name":"HILDIBRAND","text":"Rejoice, my friend, for we have reclaimed the Soboro Sukehiro once more! How fortunate that the dastardly Akebono would be so loath to set it aside that he would rather bring it with him to a secret rendezvous."},{"name":"KUGANEWOLFBURGLAR","text":"...A final favor, if you'll indulge me. Lay it at my father's grave."},{"name":"KUGANEWOLFBURGLAR","text":"Right, then. I suppose you'll be wanting to get me back to the gaol. Regardless of the reasons, a crime is a crime, and mine are many. And an upstanding Sekiseigumi like yourself must adhere to a code, no?"},{"name":"SHIGURE","text":"...Indeed I must, which is why it will be with much regret that I inform my superiors I have seen neither hide nor hair of the notorious Wolf Burglar."},{"name":"KUGANEWOLFBURGLAR","text":"Huh!? You, uh...you sure about this?"},{"name":"SHIGURE","text":"Not if you ask me again. Go to your father."},{"name":"HILDIBRAND","text":"Shigure has the right of it. You should be the one to bring your father's spirit the comfort and closure it deserves!"},{"name":"KUGANEWOLFBURGLAR","text":"You're mad, each and every one of you. Even the samurai. And I love you all the more for it. Thank you..."},{"name":"GILGAMESH","text":"To hold fast to a righteous creed, yet recognize when too rigid an adherence would result in greater injustice... Truly, I am privileged to have witnessed this display of nuanced nobility..."},{"name":"GILGAMESH","text":"Would that like the burglar I might find a measure of peace in mourning mine own dearly departed. Oh, Enkidu, if only you knew how sorry I am..."},{"name":"GILGAMESH","text":"Enkidu? But how!? Then...then what was it that I ate that fateful day...?"},{"name":"RADZATHANMERCHANT03168","text":"Fools...think you this the end!? I think not!"},{"name":"RADZATHANMERCHANT03168","text":"Huzzah! You belong to me now, ronin! Now─spirit me away from this place! Far, far, faaaaaar away! Mwahahaha!"},{"name":"GILGAMESH","text":"Far...far...faaaaaar away? Mwa...mwahahaha!"},{"name":"HILDIBRAND","text":"Greg, no! Cease your egress!"},{"name":"GILGAMESH","text":"Beyond the rift that lies between...to wondrous worlds yet unseen!"},{"name":"RADZATHANMERCHANT03168","text":"Wait, no! How dare you twist words carelessly spoken in the heat of the moment!"},{"name":"HILDIBRAND","text":"Mummy! This is going to get worse before it gets better!"},{"name":"NASHUMHAKARACCA","text":"Wait for me, Inspector!"},{"name":"GODBERT","text":"Ohohoho! There he goes, my beloved son! Not content to fly off into the sky as before, this time he elects to take his leave by vanishing into the earth!"},{"name":"GODBERT","text":"Brief though our time was together, I cannot deny how much he has grown, both as an inspector extraordinaire and a Manderville man besides. I say, a father could not be more proud!"},{"name":"SHIGURE","text":"And off goes Lord Godbert, along with Akebono. I should thank him for that..."},{"name":"SHIGURE","text":"Nothing left for us but to follow them back to Kugane, I suppose. Are you ready?"},{"name":"SHIGURE","text":"Good. Then let us be off."},{"name":"SHIGURE","text":"I cannot even begin to imagine where I would be had I never crossed paths with you and your comrades. From the bottom of my heart, I thank you for everything."},{"name":"SHIGURE","text":"The Sekiseigumi have concluded that even before the chief coincounter fell under Akebono's thrall, he willingly and enthusiastically conspired with the merchant to illicit ends, and so he will be held to account."},{"name":"SHIGURE","text":"As for Akebono and his now-defunct enterprise─the Thavnairian Consulate has agreed to intercede on behalf of its countrymen to broker a more equitable arrangement between Hannish suppliers and Hingan merchants. All agree that another monopoly would serve no one's interests."},{"name":"SHIGURE","text":"Regardless of their motivations, if their actions put more medicine in the hands of the sick and needy, then I think it safe to call it a change for the better, don't you?"},{"name":"SHIGURE","text":"The best part, if you ask me? In light of Akebono's crimes, all debts owed to him by those forced to pay his exorbitant prices are to be wiped clean."},{"name":"SHIGURE","text":"There was a time when I might not have thought as much. Good and evil, the innocent and the criminal─it all seemed so simple in the abstract, but out here, in the real world, life is anything but."},{"name":"SHIGURE","text":"You and the inspector helped me to understand how naive I was. You taught me to look beyond appearance and hearsay and not be too quick to judge a man for his misdeeds. If I am worthy of the Sekiseigumi, it is because of you and him."},{"name":"SHIGURE","text":"Ah, speaking of which...what exactly did become of Inspector Hildibrand? Do you think we ought to do something? Conduct a search or..."},{"name":"SHIGURE","text":"...Oh, so this is a regular occurrence, is it? Fair enough. If you are certain that he will turn up eventually, none the worse for wear, then I shall take your word for it and strike all worry from my mind."},{"name":"SHIGURE","text":"Should that fateful day ever come that you and he are reunited once more, I but ask that you give him my best regards."},{"name":"SHIGURE","text":"I would say the same for the Wolf Burglar. I wonder what he's doing now...?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Keeping watch for the next Akebono."},{"name":"A3","text":"Paying his respects to his father."},{"name":"SHIGURE","text":"I would not fault him if he were, though I might take issue with his methods. And should he abandon all pretense and become a common thief, then I will bring him to justice! This I swear!"},{"name":"SHIGURE","text":"What becomes of a man after death I do not know, but I should like to believe that his father rests more easily this day."},{"name":"DIGNIFIEDSEKISEIGUMI","text":"Shigure! This is no time to dawdle! Your duties are far from finished!"},{"name":"SHIGURE","text":"Y-Yes! Forgive me! Right away!"},{"name":"SHIGURE","text":"I must take my leave, but whenever you are passing through Kugane, I pray you do not hesitate to call on me here at the barracks!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Manderville Mambo</span>!"}],"reward":{"gil":1729,"emote":"Manderville Mambo"},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68703]},"next":[70078]},"partials":[{"type":"npc","id":"1025885","obj":{"i":1025885,"n":"Hildibrand","l":2404,"q":2}},{"type":"npc","id":"1026766","obj":{"i":1026766,"n":"Shigure","l":2404,"q":1}},{"type":"quest","id":"68703","obj":{"i":68703,"n":"The Past Is Never Past","g":70,"l":"Kugane","s":80,"f":1}},{"type":"quest","id":"70078","obj":{"i":70078,"n":"The Sleeping Gentleman","g":71,"l":"Radz-at-Han","s":100,"f":1}}]}