{"quest":{"name":"The Parlous Ploy","location":"Haunted Manor","id":68706,"patch":4.4,"sort":163,"repeatable":1,"icon":100809,"eventIcon":71222,"issuer":1026656,"target":1026656,"genre":203,"journal":["Little Yin awaits word that you are prepared for transfiguration.<br>※This quest is available for a limited time only.","Having consulted her network of manor furnishings, Little Yin reports details regarding the true forms of those malevolent mummers who she believes to possess useful information. You also learn that assorted decorations have taken to using transfiguration magicks bestowed by the pumpkin-headed apparition, so you need only speak with one in order to be transformed into a convincingly freakish fiend.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You speak to the appropriate enthusiast in room 108 and are transfigured into a devilish apparition. Your new form should have scare potential significant enough to prod the malevolent mummers into divulging the information you seek.","With your impeccable disguise, you deceive the mummers into revealing the location of a memo that may hold the secret of where T'maritaa─who unfortunately seems to have already joined the several score pumpkins decorating the manor─is being held.","You report your findings to Little Yin and Little Yang. The former reacts with an uncharacteristic show of enthusiasm, while the latter reveals that he was not, in fact, paying attention. For both of their sakes, you agree to calmly review what you have learned so far before proceeding to the next phase of the plan."],"objectives":["Speak to an enthusiast to be transfigured into a fiend.","Use Tricksome Treat on malevolent mummers.","Report to Little Yin."],"dialogue":[{"name":"GLOOMYGHOST03169","text":"That was fast─are you so eager to part with your current visage? I suppose I can see why. In any case, you'll need to turn yourself into one of three types of fiend to adequately blend in with the Continental Circus members I've observed skulking about the manor."},{"name":"GLOOMYGHOST03169","text":"Much to my dismay, it seems that the troupe is already searching for their next victim. &lt;sigh&gt; <span class=\"emphasis\">Loudly</span> searching."},{"name":"GLOOMYGHOST03169","text":"Can you get them out of the way for a bit so that I can have some peace? In disguise, naturally, lest they know we're trying to foil their plot. The last thing I need is a bunch of ghouls running to and fro, screeching that the mortals are on to them."},{"name":"GLOOMYGHOST03169","text":"Huh, you really came back. It's a good thing, too, because those Continental Circus fools don't know when to give up. They're making a cacophony looking for a new victim. Where they get the energy, I don't know."},{"name":"GLOOMYGHOST03169","text":"Thankfully, what they lack in quietude they make up for in stupidity. I'm sure you can derail their efforts by interrupting their trains of thought. Subtly, mind. I don't want to think about the uproar you'll cause if you march straight up to them wearing that face. No offense intended."},{"name":"GLOOMYGHOST03169","text":"Ahem. According to decorative eyewitnesses, the mummers currently on duty are in truth “diminutive, winged, pointy-eared creatures.”"},{"name":"GLOOMYGHOST03169","text":"Ahem. According to decorative eyewitnesses, the mummers currently on duty are in truth “large, winged, single-eyed creatures.”"},{"name":"GLOOMYGHOST03169","text":"Ahem. According to decorative eyewitnesses, the mummers currently on duty are in truth “alluring, airborne, long-taloned creatures.”"},{"name":"GLOOMYGHOST03169","text":"I assume that gives you a decent idea of what we're dealing with. All three mummers are currently on the ground floor, so you should have little trouble finding them. Now all that's left is to get you transfigured."},{"name":"GLOOMYGHOST03169","text":"As you can see, some of my fellows are so taken with the idea that they have already donned the appearances of their favorite All Saints' Wake fiends. You need only speak to whichever has given herself the form you seek, and she will weave the magicks for you. &lt;sigh&gt; With boisterous enthusiasm, I'm sure."},{"name":"GLOOMYGHOST03169","text":"Again, the mummers currently on duty are in truth “diminutive, winged, pointy-eared creatures.” Do try to retain that long enough to cross the room."},{"name":"GLOOMYGHOST03169","text":"Again, the mummers currently on duty are in truth “large, winged, single-eyed creatures.” Do try to retain that long enough to cross the room."},{"name":"GLOOMYGHOST03169","text":"Again, the mummers currently on duty are in truth “alluring, airborne, long-taloned creatures.” Do try to retain that long enough to cross the room."},{"name":"GLOOMYGHOST03169","text":"Once you are hideously transfigured, you'll find the mummers elsewhere on the ground floor."},{"name":"BATGHOST03170","text":"Aren't bats just the cutest little plague-bearers you ever did see? You want to be an oh-so-cuddly screeching nightmare too, right? I know you do!"},{"name":"AHRIMANGHOST03170","text":"Feast your two tiny peepers on this giant eyeball! Isn't it ghastly? It's just so...big. And round! Don't you want one?"},{"name":"SUCCUBUSGHOST03170","text":"How do I look? Just kidding, I know the answer. Positively irresistible! I've made three people fall down the stairs <span class=\"alternative-container\"><span class=\"alternative\">tonight</span><span class=\"alternative\">this morning</span><span class=\"alternative\">today</span></span> alone! Want to join me?"},{"name":"SYSTEM","text":"The action <span class=\"highlight\">Tricksome Treat</span> will become available on the pet hotbar once transfigured."},{"name":"SYSTEM","text":"Cast <span class=\"highlight\">Tricksome Treat</span> on malevolent mummers to startle them."},{"name":"SUSPICIOUSCLOWNA03170","text":"Ahhh! What the─!?"},{"name":"SUSPICIOUSCLOWNA03170","text":"Oh, it's you. Why, exactly, aren't you guarding the memo? I need to be about finding our next victim, and mark my words─there will be seven hells to pay if I hear that some interloper has walked off with our guest-turned-pumpkin in the meantime."},{"name":"SUSPICIOUSCLOWNB03170","text":"Gyaaah! A fiend!"},{"name":"SUSPICIOUSCLOWNB03170","text":"Oh, wait, I'm also a fiend. Phew. Don't startle me like that! You made me forget who I am. And where we put that pumpkin! Drat! Ah, well, that's what the memo is for."},{"name":"SUSPICIOUSCLOWNC03170","text":"Room 201, room 201, room 201, ro─ Augh!"},{"name":"SUSPICIOUSCLOWNC03170","text":"Honestly! Can't you just greet me like a <span class=\"emphasis\">normal</span> agent of evil? Now I'm going to have to spend my whole patrol trying to remember what room we put the memo in."},{"name":"SUSPICIOUSCLOWNA03170","text":"Ahhh! What the─!?"},{"name":"SUSPICIOUSCLOWNA03170","text":"Oh, is it time to change the watch already? Well, I appreciate your promptness, I suppose..."},{"name":"SUSPICIOUSCLOWNB03170","text":"Gyaaah! A fiend!"},{"name":"SUSPICIOUSCLOWNB03170","text":"O-Oh, right. We're both fiends. And you're ready to switch? That's a relief. My mother told me that if you hold a transformation too long, you get stuck that way..."},{"name":"SUSPICIOUSCLOWNC03170","text":"Augh!"},{"name":"SUSPICIOUSCLOWNC03170","text":"What is wrong with you? Forget it, just keep watch. I'm going to go and eat my weight in pumpkin pastries."},{"name":"SUSPICIOUSCLOWNA03170","text":"Ahhh! What the─!?"},{"name":"SUSPICIOUSCLOWNA03170","text":"What are you doing here? This isn't your floor... I'll let it slide this time, but I'm going to have to report you if you continue to make a nuisance of yourself."},{"name":"SYSTEM","text":"Your appearance has aroused suspicion. Return to room 108 and take the form of a different type of fiend."},{"name":"SUSPICIOUSCLOWNB03170","text":"Gyaaah! A fiend!"},{"name":"SUSPICIOUSCLOWNB03170","text":"I-I mean, a different kind of fiend! I don't think you're supposed to be on this floor..."},{"name":"SYSTEM","text":"Your appearance has aroused suspicion. Return to room 108 and take the form of a different type of fiend."},{"name":"SUSPICIOUSCLOWNC03170","text":"Augh!"},{"name":"SUSPICIOUSCLOWNC03170","text":"You're not supposed to be here! We're on guard duty tonight! Honestly, you're useless, the lot of you..."},{"name":"SYSTEM","text":"Your appearance has aroused suspicion. Return to room 108 and take the form of a different type of fiend."},{"name":"SUSPICIOUSCLOWNA03170","text":"Ahhh! What the─!?"},{"name":"SUSPICIOUSCLOWNA03170","text":"Oh, my apologies─that guise is unfamiliar to me. Are you a new recruit? In any case, that's the kind of enthusiasm for subterfuge that I like to see. I leave this post in your capable hands."},{"name":"SUSPICIOUSCLOWNB03170","text":"Gyaaah!"},{"name":"SUSPICIOUSCLOWNB03170","text":"Y-You're truly a fiend, you say? What a remarkable disguise! V-Very effective. In fact, I think I'll have a seat for a moment. Calm my nerves and such. Please watch my post for me!"},{"name":"SUSPICIOUSCLOWNC03170","text":"Augh!"},{"name":"SUSPICIOUSCLOWNC03170","text":"Nice transformation, but was that really necessary? You must be new around here. Hmm... And if you're new, you probably don't know that if you scare another member of the troupe, you have to stand guard while they go and enjoy the buffet. Sorry, I don't make the rules!"},{"name":"SUSPICIOUSCLOWNA03170","text":"I'll thank you not to interrupt me unless it's truly urgent. I have important kidnapping to do."},{"name":"SYSTEM","text":"The malevolent mummer seems too focused on the task at hand to let anything slip. Casting Tricksome Treat while transfigured should break his concentration."},{"name":"SUSPICIOUSCLOWNB03170","text":"No, mother... I shan't...fall...sleep... Mmm...mildew..."},{"name":"SYSTEM","text":"The malevolent mummer seems to be dozing off and incapable of coherent communication. Casting Tricksome Treat while transfigured should snap her out of it."},{"name":"SUSPICIOUSCLOWNC03170","text":"Are those burning pumpkin cookies I smell? I wonder if I could sneak away, just for dessert..."},{"name":"SYSTEM","text":"The malevolent mummer seems too focused on fantasizing about food to let anything useful slip. Casting Tricksome Treat while transfigured should snap him out of his reverie."},{"name":"BATGHOST03170","text":"Aren't bats just the cutest little plague-bearers you ever did see? You want to be an oh-so-cuddly screeching nightmare too, right? I know you do!"},{"name":"AHRIMANGHOST03170","text":"Feast your two tiny peepers on this giant eyeball! Isn't it ghastly? It's just so...big. And round! Don't you want one?"},{"name":"SUCCUBUSGHOST03170","text":"How do I look? Just kidding, I know the answer. Positively irresistible! I've made three people fall down the stairs <span class=\"alternative-container\"><span class=\"alternative\">tonight</span><span class=\"alternative\">this morning</span><span class=\"alternative\">today</span></span> alone! Want to join me?"},{"name":"BATGHOST03170","text":"Oh, I see you're enjoying your new form! If the spell wears off and you need to get cute as a button in a hurry, you know where to find me!"},{"name":"AHRIMANGHOST03170","text":"I spy with my massive, pulsating eye a fellow guiser! If you're ever in need of my assistance, resume your usual form. I will transfigure you into a most sightly ahriman."},{"name":"SUCCUBUSGHOST03170","text":"Yes, your transfiguration is quite the work of art. You are not as lovely as I, but I'm sure you can cause quite a few injuries regardless. Do come back if you need me to weave my magicks!"},{"name":"GLOOMYGHOST03169","text":"If you're done, let me remove that transfiguration for you. You wouldn't want your face to get stuck like that. Or would you?"},{"name":"GLOOMYGHOST03169","text":"And what did you learn?"},{"name":"GLOOMYGHOST03169","text":"Aha! I knew my plan would work! We've got you now, you rowdy little─"},{"name":"GLOOMYGHOST03169","text":"Ahem. Let's review the information you collected."},{"name":"CHEERFULGHOST03169","text":"Yes! Wait, what information? Oh, <span class=\"highlight\">Forename</span>! When did you get back?"},{"name":"GLOOMYGHOST03169","text":"Ah, you're back. Why don't you fill me in while I remove these magicks..."},{"name":"GLOOMYGHOST03169","text":"Ahaha! Take that, you raucous goons! That's what you get for interrupting my nap!"},{"name":"GLOOMYGHOST03169","text":"Ahem. I appreciate your cooperation, <span class=\"highlight\">Forename</span>."}],"reward":{"items":[{"id":24186}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68705]},"next":[68707]},"partials":[{"type":"npc","id":"1026656","obj":{"i":1026656,"n":"Little Yin","l":2497,"q":2}},{"type":"item","id":"24186","obj":{"i":24186,"n":"Ripe Pumpkin Cookie","l":1,"c":24067,"t":85}},{"type":"quest","id":"68705","obj":{"i":68705,"n":"The Sinister Soirée","g":203,"l":"Gridania","s":162}},{"type":"quest","id":"68707","obj":{"i":68707,"n":"The Sordid Cipher","g":203,"l":"Haunted Manor","s":164}}]}