{"quest":{"name":"What a Wonder-full World","location":"The Azim Steppe","id":68700,"patch":4.56,"sort":4,"icon":100839,"eventIcon":71221,"issuer":1026421,"target":1026426,"genre":64,"journal":["Kabuto is more than ready to depart for Kugane.","With the matter of the Namazu's involvement settled─after a fashion─you and Kabuto set off for Kugane once again, knowing that you must make haste if you are to arrive before Nhaza'a Jaab. You opt to go directly to the meeting place at the Bokairo Inn, as J'olhmyn and M'zhet are likely to find their way back to the port city before you.","Upon your arrival, J'olhmyn informs you that she has already located Nhaza'a Jaab, who but recently came into port and boarded the imposing <span class=\"emphasis\">Kuroboro Maru</span> along with his “cargo.” Soon after, M'zhet, who has been monitoring the harbor, contacts you by linkpearl, his rambling belying the urgency of the situation. It seems that Nhaza'a has already brought Alpa and Gyorei out on deck, presumably to be presented as the Three Wonders to his buyer─namely, the unscrupulous merchant Kageyama. The moment for action has come. Nhaza'a and Kageyama must be stopped before Alpa and Gyorei are relieved of flesh and fin.","You and your companions rush aboard the <span class=\"emphasis\">Kuroboro Maru</span>, arriving just in time for J'olhmyn to save Alpa from a grisly fate at the hands of Nhaza'a Jaab. Though an ungallant kick to the ribs sends J'olhmyn sprawling, the rest of your group rushes forward to continue the fight. This includes Gyoshin, who appears not a moment too soon, perched on an airborne mikoshi. Without preamble, he rams it into Kageyama, sending the villain─along with many a Namazu mikoshi bearer─flying. Meanwhile, Kabuto takes advantage of the confusion to slash at a distracted Nhaza'a, leaving him clutching a wound in his abdomen. Though the villain is still unwilling to surrender, the sound of the Sekiseigumi's whistle sends him loping to his skiff, hidden nearby as a means of escape. Though M'zhet's lobbed grenade fails to detonate, it is nevertheless successful in driving Nhaza'a off his boat and into the water, where he is dragged under by an unidentified finned creature. Kageyama's flight is more successful─he's halfway to Kogane Dori by the time you notice his departure. You, of course, give chase, Alpa and Kabuto in tow.","From a vantage point above Kogane Dori, you manage to catch sight of Kageyama. As you close in, he realizes that you are in pursuit, and hastily scatters a great deal of coin, causing nearby citizens to block your path as they scramble to lay hands on it. It immediately becomes clear, however, that he failed to account for the presence of a skilled Ananta goldsmith, as Alpa removes the distraction by shaping the money into a large ornament of the sort found atop Namazu mikoshi─dispersing the crowd as they realize with horror that their financial windfall is now an ichthyic monument of questionable monetary or artistic value. Though the thwarted Kageyama once again attempts to flee on foot, he runs right into Hancock and a pair of Sekiseigumi, and is summarily detained. Perhaps he will at last face justice for eschewing morality in the name of greed. Perhaps.","With the dastardly plot of Nhaza'a Jaab and Kageyama unraveled and the villains no longer a threat─at least for the time being─Alpa suggests that the whole group visit the Bokaisen Hot Springs to heal any lingering scrapes and bruises. As you enjoy the warm water and congenial chatter, you reflect on the many bonds forged this day. Indeed, such friendships may in time prove the greatest treasure of all."],"objectives":["Wait for J'olhmyn at the meeting spot near the Bokairo Inn.","Speak with M'zhet Tia at the harbor.","Survey Kogane Dori from above.","Speak with Alpa near the Bokairo Inn."],"dialogue":[{"name":"KABUTO","text":"It might serve us to have a clearer idea of Seigetsu the Enlightened's plan, but we can wait no longer to depart. Come, we should hasten to the Bokairo Inn."},{"name":"GYOSHIN","text":"Maybe I should pack <span class=\"emphasis\">two</span> hammers after all. Yes, yes..."},{"name":"KOFUINSEIGETSU","text":"（★未使用／削除予定★）"},{"name":"JOLHMYN","text":"You two made good time! We left for Kugane just after I spoke with you, and only arrived a short while ago ourselves."},{"name":"KABUTO","text":"Have you been able to learn anything of Nhaza'a?"},{"name":"JOLHMYN","text":"We were successful in returning to Kugane ahead of him, though not by much. He's already made port."},{"name":"JOLHMYN","text":"We saw dockworkers hauling a large barrel and squirming sack from his skiff─under his close watch, unfortunately─so whatever his plans are, they're likely already in motion."},{"name":"KABUTO","text":"The prisoners! Where has he sent them?"},{"name":"JOLHMYN","text":"There's a large vessel docked at Pier #1─it seems Alpa and Gyorei have been taken aboard. I have M'zhet keeping an eye on the situation."},{"name":"KABUTO","text":"I saw that ship when we arrived. It's unmistakably the <span class=\"emphasis\">Kuroboro Maru</span>. If I recall correctly, the merchant Kageyama purchased it for a hefty sum some time ago."},{"name":"JOLHMYN","text":"Kageyama, you say? And who might that be?"},{"name":"KABUTO","text":"A man easily as vile as Nhaza'a Jaab himself. He once conspired to take Kugane Castle, holding the bugyo hostage as he made ludicrous demands. Though thwarted, he used his wealth and influence to escape justice."},{"name":"KABUTO","text":"I am not familiar with the details, but according to rumor, he has a history of using wealth to make each and every one of his problems disappear."},{"name":"KABUTO","text":"He has taken to using this tactic recently, it is said, in pursuit of a bride, spending more gil than most will ever see in his attempt to snare the perfect woman."},{"name":"JOLHMYN","text":"A bride, hmm? Well, I think we've found Nhaza'a Jaab's esteemed employer."},{"name":"MZHETTIA","text":"(-M'zhet-)Hello, <span class=\"highlight\">Forename</span>? It is I! You know─your favorite Miqo'te? Dashing good looks, ladies' man, future nunh of the M tribe?"},{"name":"MZHETTIA","text":"(-M'zhet-)Yes, well, I'm afraid that we have a problem. One that requires your immediate attention─that's why I contacted you. It's vital that you hear this as soon as possible."},{"name":"MZHETTIA","text":"(-M'zhet-)I've been dutifully keeping watch by the <span class=\"emphasis\">Kuroboro Maru</span>, and Alpa and the Namazu have just been brought out on deck. We don't have much longer until our “mermaid” becomes “mermaid's flesh”!"},{"name":"MZHETTIA","text":"(-M'zhet-)I would love to continue this little chat we're having, but I rather think you should come to the harbor right away!"},{"name":"JOLHMYN","text":"Was that M'zhet?"},{"name":"KABUTO","text":"This is our last chance, then. We must stop Nhaza'a once and for all!"},{"name":"KABUTO","text":"The others should have arrived before we did. I assume that they have occupied themselves by gathering information throughout the city in the meantime."},{"name":"MZHETTIA","text":"There you are! We must hurry!"},{"name":"MZHETTIA","text":"Alpa is a dear friend, and I won't have her turned into mince by some scheming─and rather unattractive, I must say─villain!"},{"name":"KAGEYAMA","text":"Merflesh..."},{"name":"KAGEYAMA","text":"The Philosopher's Fin..."},{"name":"KAGEYAMA","text":"And the Jewel of Fair Souls."},{"name":"KAGEYAMA","text":"With this, she can no longer deny me! And what a pretty thing she will be, beside me at our matrimonial feast. I can taste it now..."},{"name":"NHAZAAJAAB","text":"I couldn't possibly care less about what you intend to do with the goods, so long as I am fairly compensated. And speaking of payment, I think it's time that we finish up here."},{"name":"NHAZAAJAAB","text":"I need only carve the meat..."},{"name":"JOLHMYN","text":"Not a chance!"},{"name":"NHAZAAJAAB","text":"Finally caught up, have you? Though I doubt you have much more to offer this time around!"},{"name":"MZHETTIA","text":"J'olhmyn!"},{"name":"MZHETTIA","text":"That was dirty! What, afraid you couldn't defeat her in a fair fight?"},{"name":"NHAZAAJAAB","text":"I merely prefer to spend my time on foes that are actually worthy─or at least suitably entertaining. But if any of you believe you will present a greater challenge, then by all means..."},{"name":"KABUTO","text":"Very well. I will defeat you myself, and have you return Tsukumo here and now."},{"name":"GYOSHIN","text":"(-???-)I see them! They are most visible!"},{"name":"GYOSHIN","text":"Ramming speed, yes, yeeeeees!"},{"name":"NHAZAAJAAB","text":"Hurk!"},{"name":"KAGEYAMA","text":"That whistle─it's the Sekiseigumi!"},{"name":"NHAZAAJAAB","text":"Pity. I was just beginning to feel a twinge of excitement, but I see I must take my leave."},{"name":"NHAZAAJAAB","text":"Ahahahahaha! Farewell, Eastern beastmen! This little chase has been <span class=\"emphasis\">most</span> amusing. Perhaps you may entertain me again someday."},{"name":"MZHETTIA","text":"Not this time... As the future nunh, and a friend to J'olhmyn and Alpa both, I cannot let these crimes go unanswered!"},{"name":"MZHETTIA","text":"Trust me, sometimes you have to learn the hard way...<br>How to treat a lady!"},{"name":"NHAZAAJAAB","text":"Seven hells!"},{"name":"MZHETTIA","text":"Oh, <span class=\"emphasis\">now</span> we find the one with no powder."},{"name":"MZHETTIA","text":"Gwahahahahahaha! So much for your parlor trick!"},{"name":"MZHETTIA","text":"Gwahahahahahaha! As if explosives would save the adventurer's gaggle of misfits <span class=\"emphasis\">yet again</span>."},{"name":"KABUTO","text":"Now we only need ensure that Kageyama meets with justice at the hands of the Sekiseigumi."},{"name":"MZHETTIA","text":"That...may pose a problem. Where has that eel slipped off to?"},{"name":"KABUTO","text":"He makes for Kogane Dori! <span class=\"highlight\">Forename</span>, with me!"},{"name":"MZHETTIA","text":"We can meet at the Bokairo Inn afterward─I will carry the wounded there. We're counting on you!"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"KABUTO","text":"You need not push yourself, Alpa. You have only just been freed from what must have been a very trying ordeal."},{"name":"ALPA","text":"I'll be fine. As captain of the Velodyna Gatekeepers, I can't let evil go unpunished!"},{"name":"KABUTO","text":"There!"},{"name":"KAGEYAMA","text":"What? How did you─ Well, no matter. You may have followed me this far, but no further!"},{"name":"KAGEYAMA","text":"Paupers of Kugane! Behold my loose change!"},{"name":"PASSERBYA03164","text":"(-Eager Townsperson-)Oooh, free money!"},{"name":"KABUTO","text":"Pardon me, sir, but if you could move a bit to the left... Ma'am, it is imperative that we capture this villain... &lt;sigh&gt; They're not listening."},{"name":"KAGEYAMA","text":"Hahaha! Just look at them, scrounging at my feet! It pays to be wealthy!"},{"name":"ALPA","text":"Please, leave thisss to me."},{"name":"KAGEYAMA","text":"You're wasting your time, little mermaid! I'm a master of monetary manipulation, and no one is easier to control than coin-starved commoners!"},{"name":"KAGEYAMA","text":"What is the meaning of this!?"},{"name":"PASSERBYA03164","text":"(-Disappointed Townsperson-)Oh, cruel fate, why do you mock me?"},{"name":"KABUTO","text":"Well done. But why a fish?"},{"name":"ALPA","text":"I saw one on the Namazu's strange contraption earlier. It was so cute, I just couldn't stop thinking about it."},{"name":"PASSERBYB03164","text":"(-Disappointed Townsperson-)I don't even <span class=\"emphasis\">like</span> fish."},{"name":"KABUTO","text":"I believe it's time that you accepted your fate."},{"name":"HANCOCK","text":"Yes, I think that's quite enough escape attempts for one day. You've made it perfectly clear who the villain here is. Right, my Sekiseigumi friends?"},{"name":"KAGEYAMA","text":"You can't do this to me! I have a woman to coerce! A matrimonial banquet to consume!"},{"name":"KABUTO","text":"It seems that the matter is resolved at last. Shall we go and inform the others?"},{"name":"YAMABIKO","text":"That was quite the ruckus earlier. And where did all the Namazu come from?"},{"name":"KOFUINSEIGETSU","text":"（★未使用／削除予定★）"},{"name":"ALPA","text":"The innkeep was kind enough to call a doctor, but it ssseems that no one has more than minor injuries."},{"name":"ALPA","text":"And apparently, there's no better treatment for scrapes and bruises than the Bokaisen Hot Springs! I guess we'll just have to visit them again!"},{"name":"Q1","text":"Enter the hot springs in your current garb?"},{"name":"ALPA","text":"Let's continue where we left off before we were so rudely interrupted, shall we?"},{"name":"JOLHMYN","text":"I'm so sorry, Alpa."},{"name":"ALPA","text":"What? You have absolutely nothing to apologize for! Not now, not ever!"},{"name":"JOLHMYN","text":"It's my duty to protect you, and I failed utterly. Then it took so long to free you...and I couldn't even manage that without help."},{"name":"ALPA","text":"Maybe not, but the rescue wouldn't have succeeded without your leadership─not to mention how you saved me from being sliced in two. You may not be able to do everything yourself, but I couldn't ask for a better sssecond-in-command."},{"name":"JOLHMYN","text":"Alpa, I... Thank you."},{"name":"ALPA","text":"I'm grateful to everyone else too, of course. <span class=\"highlight\">Forename</span>, Kabuto, Gyoshin, M'zh─"},{"name":"ALPA","text":"Hold on, where's M'zhet?"},{"name":"JOLHMYN","text":"Maybe he's still changing?"},{"name":"JOLHMYN","text":"Augh!"},{"name":"MZHETTIA","text":"Never fear, it is I, M'zhet! I discovered this floating in the sea after Nhaza'a disappeared. How do I look? Rakish?"},{"name":"JOLHMYN","text":"I'm throwing that back in the sea, and you along with it!"},{"name":"JOLHMYN","text":"Just when you think he's learned something..."},{"name":"KABUTO","text":"If I may ask, Gyoshin, how did you know to find us on the <span class=\"emphasis\">Kuroboro Maru</span>?"},{"name":"GYOSHIN","text":"It was easy to spot you from above! I knew that stuffing the mikoshi with all of the cloudsbreath in our stores was the right choice, yes, yes."},{"name":"JOLHMYN","text":"My, how convenient. And I'm glad that you made it out safely too, Gyorei."},{"name":"GYOREI","text":"Thanks to all of you! Being trapped in a barrel was harrowing, and fraught with splintery peril, yes, yes. But it was worth it for a chance to enjoy these hot springs together!"},{"name":"KABUTO","text":"...If you say so."},{"name":"GYOSHIN","text":"What is that gem in your helmet? It is most unusual. Quite unique!"},{"name":"KABUTO","text":"This is the soul of my dear friend Tsukumo, more valuable than any treasure in the whole of the Ruby Sea."},{"name":"KABUTO","text":"He is what Nhaza'a stole from me, and I am truly grateful to you for helping me retrieve him."},{"name":"KABUTO","text":"As Gyorei said, despite our tribulations, I feel fortunate to have met you all. I hope that we can continue to strengthen our friendship now that we're all safe and sound."},{"name":"GYOSHIN","text":"Then please come to our festival, yes, yes! We can strengthen our friendship and all of our assorted limbs by carrying a mikoshi together!"},{"name":"ALPA","text":"And if you're ever in Eorzea, come to Ala Mhigo! The Velodyna Gatekeepers will give you the grand tour, and you can stay at the cassstellum..."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Allied</span> reputation with the Kojin, the Vira, and the Namazu."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from Shikitahe, Madhura, and Gyosho."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Gratuity</span>!"},{"name":"SYSTEM","text":"Through your efforts, your allies of all shapes and sizes across Ala Mhigo and the Far East have forged bonds of friendship that promise to remain strong through the years. You are truly a hero to tribes across many realms!"},{"name":"KABUTO","text":"I paid visit to Shihoumi. Thankfully, she was able to place Tsukumo back where he belongs."}],"reward":{"gil":1479,"emote":"Gratuity"},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68699]}},"partials":[{"type":"npc","id":"1026421","obj":{"i":1026421,"n":"Kabuto","l":2411,"q":1}},{"type":"npc","id":"1026426","obj":{"i":1026426,"n":"Alpa","l":2404,"q":1}},{"type":"quest","id":"68699","obj":{"i":68699,"n":"Fish in a Barrel","g":64,"l":"The Ruby Sea","s":3}}]}