{"quest":{"name":"Seiryu's Wall","location":"Kienkan","id":68717,"patch":4.5,"sort":36,"eventIcon":71201,"issuer":1026784,"target":1025597,"genre":7,"journal":["Hien is eager to see the energy barrier in action."],"objectives":["Speak with Hien near the House of the Fierce.","Speak with Hien at the Kienkan."],"dialogue":[{"name":"ALISAIE","text":"You obviously have some idea of what to expect, having seen the barrier at Azys Lla. But having not had that pleasure myself, I'm exceedingly curious to see a wall capable of keeping out one of those massive imperial airships."},{"name":"YUGIRI","text":"As expected, Sui–no–Sato failed to answer the call. Not that I blame the Ruby Princess. Enlightened as she is reputed to be, it could be no easy task persuading her people to relinquish their long-held isolation."},{"name":"HAKUROU","text":"If we can but block the Garleans' airships, the speed with which they deploy their forces will be greatly diminished."},{"name":"TANSUI","text":"Out on the open sea, I would happily take on any vessel. But here on dry land is another matter. The Empire's iron monstrosities will ever have the upper hand."},{"name":"AOKORAHERALD","text":"If only we could persuade our kin of the error of their ways. With the Red at our side, we would make a truly formidable force..."},{"name":"CIRINA","text":"One after another, tribes from across the Steppe have come forth to pledge their warriors to the alliance. Many simply crave a chance to seize glory in battle, it is true, but their eagerness is most welcome nonetheless."},{"name":"NAGUSAHERALD","text":"The jungles of Nagxia are dense and treacherous. The land itself prevents the Empire from ever truly conquering our nation. Long have we hidden behind bough and branch, striking where and when we can."},{"name":"DALMASCAHERALD","text":"When the Empire put down Dalmasca's bid for freedom, our remaining forces were splintered. Bringing the scattered pockets of resistance back under a single banner will be our first order of business."},{"name":"KIENKANGATEKEEPER03028","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"TANSUI","text":"In case you were wondering, we won't be sailing off to fight in Eorzea in the foreseeable future. Our ships just aren't equipped for that kind of voyage. But you may be sure we'll do our part against the Empire closer to home."},{"name":"CIRINA","text":"Many tribes have pledged their warriors to the alliance that they might protect the Steppe and our way of life. Perhaps an outside war is what is needed to end the conflict amongst my people."},{"name":"HIEN","text":"We will cross the Burn by yol and falcon, as before. Join me at the overlook near the House of the Fierce."},{"name":"ALISAIE","text":"Let us pray there are no sandstorms brewing out there..."},{"name":"HIEN","text":"Give the word when you are ready to take wing!"},{"name":"Q1","text":"Head to the Burn?"},{"name":"YUGIRI","text":"What uncanny timing that Master Alphinaud should be returned to us just as we were testing the barrier. I only hope a cure can be found for his malady..."},{"name":"YUGIRI","text":"Otherwise, the war council has ended in unanimous agreement. To forestall the Empire's expansion plans in this region, our allies are willing to send troops to fight in Eorzea."},{"name":"HAKUROU","text":"Even should our alliance send a contingent to Eorzea, I will stay here in Doma with the remainder of our forces. As much as I would enjoy taking imperial heads at your side, we cannot leave our borders undefended."},{"name":"TANSUI","text":"In case you were wondering, we won't be sailing off to fight in Eorzea in the foreseeable future. Our ships just aren't equipped for that kind of voyage. But you may be sure we'll do our part against the Empire closer to home."},{"name":"RASHO","text":"The Confederacy bows to no one...but I see the wisdom in joining Lord Hien's alliance. The Empire threatens us all, and only by banding together can we hope to keep what is ours."},{"name":"CIRINA","text":"Many tribes have pledged their warriors to the alliance that they might protect the Steppe and our way of life. Perhaps an outside war is what is needed to end the conflict amongst my people."},{"name":"HIEN","text":"Alphinaud is safely ensconced in a private chamber. My finest healer is examining him as we speak."},{"name":"ALISAIE","text":"I've spoken with the physician, and there are no outward signs of illness. Alphinaud is lost in a sleep from which he cannot be awoken...just like the others."},{"name":"ALISAIE","text":"It seems that even the lands of the Empire were not far enough away to escape that cursed voice..."},{"name":"HIEN","text":"I share your frustration, Alisaie, I do─but Alphinaud is returned to us alive and otherwise unharmed. All that remains is to find the means to wake him."},{"name":"HIEN","text":"Until then, you can but fulfill your duties as a Scion─yours and your brother's both."},{"name":"ALISAIE","text":"...You're right, of course. There are arrangements to be made, and little time to make them."},{"name":"ALISAIE","text":"To business then, my lord─now that we know “Seiryu's Wall” works as intended, can we expect reinforcements for Ala Mhigo?"},{"name":"HIEN","text":"You most certainly can. As promised, we will send troops to bolster our allies in Eorzea without delay."},{"name":"YUGIRI","text":"Pray be aware, however, that they will not <span class=\"emphasis\">arrive</span> without delay. Save for some few who boast teleportation magicks, the bulk of our force must be transported by sea─a lengthy voyage for which the smaller vessels favored by the Confederacy are ill-equipped."},{"name":"HIEN","text":"Accordingly, I mean to enlist the assistance of the East Aldenard Trading Company in finding suitable ships. As for navigating the distances in question, we are in the happy position of being able to call upon those who plotted the course of my people's exodus to Eorzea."},{"name":"HIEN","text":"Beyond the procurement of ships, I think it unlikely that our East Aldenard friends will consent to any involvement in military operations, but I am certain they will afford Alphinaud a berth aboard one of their vessels. I shall have a chirurgeon accompany him every ilm of the way to the Rising Stones."},{"name":"ALISAIE","text":"You have my thanks, Lord Hien."},{"name":"HIEN","text":"Yugiri─I will go on ahead with our friends to Ala Mhigo. Enlist all those capable of teleportation, and put them at the disposal of the Eorzean Alliance as soon as possible. They will form the vanguard."},{"name":"YUGIRI","text":"Yes, my lord."},{"name":"ALISAIE","text":"This is exactly what we'd hoped for. Lyse and the Alliance leaders will be glad indeed to welcome the combined strength of the East."}],"reward":{"gil":998},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68716]},"next":[68718,68722]},"partials":[{"type":"npc","id":"1026784","obj":{"i":1026784,"n":"Hien","l":2847,"q":2}},{"type":"npc","id":"1025597","obj":{"i":1025597,"n":"Hien","l":2847,"q":7}},{"type":"quest","id":"68716","obj":{"i":68716,"n":"A Defector's Tidings","g":7,"l":"The Dravanian Hinterlands","s":35}},{"type":"quest","id":"68718","obj":{"i":68718,"n":"Parley on the Front Lines","g":7,"l":"Kienkan","s":37}},{"type":"quest","id":"68722","obj":{"i":68722,"n":"Take with a Tonze of Salt","g":95,"l":"Mor Dhona","s":10040}}]}