{"quest":{"name":"Theatgrhythdaniam","location":"Gridania","id":68711,"patch":4.4,"sort":168,"icon":100807,"eventIcon":71221,"issuer":1026627,"target":1026627,"genre":204,"journal":["Amh Garanjy is beaming with delight following the resounding success of the concert.<br>※This quest is available for a limited time only.","Amh Garanjy is ecstatic that the choir performed better than anyone could have hoped. Now that the show has ended, it is time for the children attending the concert to receive their gifts. Unfortunately, a shortage of parcels leaves several youngsters disappointed, with one little girl in particular convinced that her own bad behavior is to blame. Her timing could not be worse, as she runs off in tears at the exact moment the Saint of Nymeia arrives with a whole shipment of presents for the Starlight Celebration. Amh Garanjy cannot help but wonder as to her whereabouts, and requests that you track down the wayward youngster.","You commence the search by asking those in the vicinity if they have seen a crying girl run past, starting with Simpkin the troubadour. He clearly recalls seeing one heading in the direction of New Gridania. Although the fact she has already covered a considerable distance is a cause for concern, there must surely be others with useful information to share.","Following your first lead, you approach a nearby Wood Wailer. Unfortunately, he has no recollection of seeing the child you seek, but advises asking around the Adders' Nest. For lack of more reliable clues, you decide to take his suggestion.","Lieutenant Gavin of the Twin Adders has seen the girl making her way to the Acorn Orchard. It seems the net is closing on your young quarry. Desperate not to miss this opportunity, you race off in pursuit.","Gavin's information proves reliable, and the girl is still fighting back tears when you find her. She confesses that she ran away from her father after he refused to buy the floral hairpin that she wanted. With miraculous timing, as befitting the season, Maisenta appears with the very same dainty accessory that caught the child's eye. She explains that the girl's father had already bought it before she had asked, and that Maisenta herself had been holding on to it until the Starlight Celebration. The young runaway is overjoyed and dashes off to apologize to her father.","Upon your return to Mih Khetto's Amphitheatre, Amh Garanjy is relieved to hear that you and Maisenta were able to not only find the girl, but send her back to her father with a smile on her face. While it seems that your contributions to the Starlight Celebration have all but secured its success, there is still time before the end of the festival to take up your conductor's baton, should you wish to lead the choir in song once more."],"objectives":["Ask a bystander about the whereabouts of the tearful girl.","Ask in New Gridania about the whereabouts of the tearful girl.","Ask at the Adders' Nest about the whereabouts of the tearful girl.","Locate the tearful girl.","Report to Amh Garanjy."],"dialogue":[{"name":"AMHGARANJY","text":"That was incredible! Considering that only Augustiniel has any real experience, it's hard to believe we were able to keep up with him. Of course, your conducting is what made it all possible. We would have been lost without you!"},{"name":"AMHGARANJY","text":"As planned, Oscarlet and Orselfaux are handing out the presents. It truly is a marvel to see so many children arriving to collect gifts, but I do wish the Homunculi would pay more attention to the younglings and a little less to their mothers... Still, they are doing ever such a good job!"},{"name":"CHILD03175","text":"What!? No more presents?"},{"name":"OSCARLET","text":"I'm dreadfully sorry, little ones! Unfortunately, the Saint of Nymeia has not blessed us with quite the right number of gifts..."},{"name":"ORSELFAUXL","text":"We never expected the choral performance to be so popular. Had we known, we would have prayed for a few more parcels."},{"name":"AMHGARANJY","text":"Oh no! Whatever shall we do? There must be <span class=\"emphasis\">something</span> we can give them!"},{"name":"SADLYGIRL03175","text":"The Saint knows I've been bad... That's why I can't have a present! &lt;sniff&gt;"},{"name":"GODBERT","text":"(-???-)Ho ho ho! Fear not, all ye faithful! The Saint of Nymeia has heard your prayers. Rejoice, for I am come bearing gifts!"},{"name":"GODBERT","text":"Hearken one, hearken all! For a bevy of festive treats awaits every good boy and girl, all courtesy of Mandervi─Ahem!─my little helpers!"},{"name":"GODBERT","text":"Now, who has been good this year?"},{"name":"CHILD03175","text":"Me, me! I've been on my bestest behavior!"},{"name":"AMHGARANJY","text":"What a wonderful surprise! Your arrival is timely indeed!"},{"name":"GODBERT","text":"Ho ho ho! Think nothing of it! The Saint of Nymeia lives only to bring joy to the realm."},{"name":"GODBERT","text":"But did I perchance see a young girl with tears in her eyes? Verily, my work here cannot be considered complete until that sweet child is smiling once more!"},{"name":"AMHGARANJY","text":"Yes, I could not agree more. She was beside herself when she heard there was no present for her. I think she blames herself, for some reason."},{"name":"AMHGARANJY","text":"We must find her without delay. Although I get the impression that the sight of a member of the festival staff would be rather upsetting for her, at least until she has had a chance to calm down."},{"name":"AMHGARANJY","text":"<span class=\"highlight\">Forename</span>, could you ask if anyone has seen her?"},{"name":"GODBERT","text":"Thank you. She can't have gone far, but keep your eyes peeled─Gridania is full of little nooks and crannies, perfect for hiding."},{"name":"GODBERT","text":"And with that, I must depart, for I still have many parcels to deliver, and so little time! May the blessings of Nymeia be upon each and every one of you! Ho ho ho!"},{"name":"AMHGARANJY","text":"Thankfully, crying children are something of a rarity during the Starlight Celebration, so there is a high chance that somebody remembers seeing her."},{"name":"SIMPKIN","text":"A crying girl? Why yes, one went running in the direction of New Gridania. Though for the life of me, I could have sworn that they were tears of joy, presumably brought on by your magnificent display at the amphitheatre."},{"name":"SIMPKIN","text":"Had I known the truth of the matter, mayhap I could have offered a gentle melody of mine own, to ease whatever ails her troubled heart. I sincerely hope you find her, my fellow musician!"},{"name":"SIMPKIN","text":"It saddens me greatly that such a young child could be so full of woe, particularly on such an occasion as the Starlight Celebration."},{"name":"WOODWAILER03175","text":"Sorry, can't say I pay much attention to bawling babes. Got enough of my own at home! Might be worth asking around the Adders' Nest, though. Always a lot of folk coming and going. Maybe one of them saw something."},{"name":"WOODWAILER03175","text":"Have you tried the Adders' Nest, like I said?"},{"name":"GAVIN","text":"Why yes, I saw a girl matching your description darting off in the direction of the Acorn Orchard. But since this area is frequented by a large number of young children, I didn't think anything of it. It appeared to me that she was unaccompanied, though."},{"name":"GAVIN","text":"A lot of the local younglings come to play in the Acorn Orchard, but rarely give the Twin Adders cause for concern, provided they stay well away from that waterwheel over there."},{"name":"SADLYGIRL03175","text":"&lt;sniff&gt; I know you. You're the stick-wavy <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>. From the concert. Are you cross with me?"},{"name":"SADLYGIRL03175","text":"Oh... Good. But that's why I got no present. Because I was naughty..."},{"name":"SADLYGIRL03175","text":"It's just me and Daddy. He's a Wood Wailer. But he's always busy. He only comes home at night. When I'm asleep."},{"name":"SADLYGIRL03175","text":"But today, he wasn't busy. So we went to the market. I said I wanted a flower hairpin."},{"name":"SADLYGIRL03175","text":"But he said “Next time.” When is “next time?” Maybe there is no “next time!” He's always too busy."},{"name":"SADLYGIRL03175","text":"So I said “I hate you!” Then I ran away."},{"name":"SADLYGIRL03175","text":"That's when I saw the concert. I wanted to hear the music. So I went there by myself."},{"name":"SADLYGIRL03175","text":"But then I didn't get a present. It's because I said “I hate you” to Daddy and ran off."},{"name":"MAISENTA","text":"(-???-)It's not your fault, child. I am to blame."},{"name":"SADLYGIRL03175","text":"I know you too! You're a singer!"},{"name":"MAISENTA","text":"Ha ha! Not quite. Think of me as one of the Saint's little helpers."},{"name":"MAISENTA","text":"He is not the only one who gives presents. I've brought one too, just for you. Now, hold still and close your eyes."},{"name":"SADLYGIRL03175","text":"Ah! The hairpin! Just what I always wanted! But how did you know?"},{"name":"MAISENTA","text":"Well, a certain someone gave this to me to look after. He told me that you had been standing in front of Black Rabbit Traders, staring at it every day."},{"name":"MAISENTA","text":"That somebody also asked me to hold on to it, as a present for the Starlight Celebration."},{"name":"MAISENTA","text":"Which is why when you asked him to buy it for you, he said “Next time.” He didn't want you to know he had already bought it."},{"name":"SADLYGIRL03175","text":"So, that means─!"},{"name":"MAISENTA","text":"Yes, that's right. Now, why don't you run along and find him?"},{"name":"SADLYGIRL03175","text":"Thank you Saint's little helper! Thank you stick-wavy <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>! I promise I'll say sorry to Daddy!"},{"name":"MAISENTA","text":"&lt;sigh&gt; Whoever thought doing good deeds could be so tiring?"},{"name":"MAISENTA","text":"You should have seen the way she was milling about near my stall, day after day, staring at my floral hairpins. And the way she'd been talking with one of the Wood Wailers, with that pleading look in her eyes, I suspected I'd found a customer."},{"name":"MAISENTA","text":"Sure enough, he came over one day and asked which of my wares the girl had been looking at. He bought it and requested that I keep it safe until the Starlight Celebration, no doubt to hide it from his daughter."},{"name":"MAISENTA","text":"Imagine my surprise when he came by, asking not after the hairpin, but his little girl! He'd been desperately searching for her after she ran off."},{"name":"MAISENTA","text":"I couldn't very well leave him to search for her on his own─certainly not on a day such as this. I am one of the Saint's little helpers, after all."},{"name":"MAISENTA","text":"Yes, you heard me correctly! Is it so surprising that I could get into the festive spirit? Besides, if I treat them with kindness now, her father may be inclined to buy her more presents in the future. Why, she might become a paying customer herself when she has money of her own to spend."},{"name":"MAISENTA","text":"That is the key to good business─plant the seeds and watch them grow. And to be honest, I underestimated how many presents we would need for the concert. It's a good thing I had the hairpin from her father to hand!"},{"name":"MAISENTA","text":"Of course, I have you to thank for tracking her down. You are an awful lot easier to find than a wayward child."},{"name":"MAISENTA","text":"Come to think of it, Amh Garanjy would be relieved to hear that this little incident has come to a satisfactory conclusion. Would you be so kind as to put her mind at ease?"},{"name":"MAISENTA","text":"I, on the other hand, have a rather more pressing engagement─I simply must change out of this unflattering costume. Although I suspect I may have to wear it again before the festival comes to a close. Well then, ta-ta for now!"},{"name":"MAISENTA","text":"Have you spoken to Amh Garanjy yet? Why not? She does strike me as the sort of person to concern herself with distraught children, especially if she holds herself responsible. Be a dear and put her mind at ease, would you?"},{"name":"AMHGARANJY","text":"So? Did you find her?"},{"name":"AMHGARANJY","text":"My, my, Maisenta! She never ceases to amaze me! I suppose she can add “cheering up crying children” to her lengthy list of talents. And you seem to have quite the knack for finding missing persons. I daresay that comes in handy from time to time!"},{"name":"AMHGARANJY","text":"Anyway, I hope we will be spared any similar misadventures for the rest of the festival. This is supposed to be a happy occasion, after all. If it gives even one youngling reason to be upset, it will have all been for naught."},{"name":"AMHGARANJY","text":"But now that's over, and we can all go back to enjoying the Starlight Celebration!"},{"name":"AMHGARANJY","text":"I know you have already done more than enough to help us, but if you fancy leading the choir again, the Starlight celebrants and I would be absolutely thrilled!"},{"name":"AMHGARANJY","text":"We are still inundated with visitors from far and wide, all clamoring for a chance to experience an authentic yet unique Ishgardian music spectacle and receive a gift from the Saint. And here is one for you!"},{"name":"AMHGARANJY","text":"While I suspect that the presents may be somewhat more enticing than our singing, I can say without a shadow of a doubt the whole enterprise has been a roaring success!"}],"reward":{"items":[{"id":24145},{"id":24146},{"id":24147}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68710]}},"partials":[{"type":"npc","id":"1026627","obj":{"i":1026627,"n":"Amh Garanjy","l":53,"q":1}},{"type":"item","id":"24145","obj":{"i":24145,"n":"Choir Hat","l":1,"c":41419,"t":34,"p":94}},{"type":"item","id":"24146","obj":{"i":24146,"n":"Choir Robe","l":1,"c":42621,"t":35,"p":156}},{"type":"item","id":"24147","obj":{"i":24147,"n":"Choir Shoes","l":1,"c":49191,"t":38,"p":94}},{"type":"quest","id":"68710","obj":{"i":68710,"n":"A Concerted Effort","g":204,"l":"Gridania","s":167,"r":1}}]}