{"quest":{"name":"A Concerted Effort","location":"Gridania","id":68710,"patch":4.4,"sort":167,"repeatable":1,"icon":100806,"eventIcon":71222,"issuer":1026629,"target":1026629,"genre":204,"journal":["Baenfaeld is keen to put his booming voice to good use.<br>※This quest is available for a limited time only.","While Baenfaeld is somewhat apprehensive about singing before an audience, his determination to contribute to the success of the Starlight Celebration is without question. He explains that the crowd is being divided into two groups, with a Starlight celebrant assigned to each. For better or worse, the festival staff have wildly differing approaches in their pre-perfomance banter, with one guide exaggerating the musical ability of the choir to ridiculous extremes. As a result, that particular group's expectations are considerably higher than the other, and a more complex and challenging song is required to satisfy them. Thankfully, you are free to choose which collective of spectators you will perform for first.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","Through a combination of your burgeoning conductorial skill and the choir's impressive harmonies, the crowd is convinced that you are the genuine article, rather than a hastily assembled gaggle of complete beginners with next to no knowledge of traditional Ishgardian choral music. Baenfaeld in particular surprised all with an unexpected talent for applying his bellowing voice to more musical ends. Out of breath but elated, he seems keen for you to join him for some post-concert chitchat.","Baenfaeld, as you can well imagine, is delighted with the choir's performance. Having successfully made it through an entire concert without any major catastrophes, he is confident that he and the other vocalists should be able to repeat their musical feats even without the aid of a conductor. Should you find an opening in your busy schedule, the choir would no doubt leap at the opportunity to work alongside their much-vaunted maestro."],"objectives":["Speak with the saturnine Starlight celebrant or the splendiferous Starlight celebrant.","Report to Baenfaeld."],"dialogue":[{"name":"BAENFAELD","text":"Ready for a bit o' singin'? Oh, if you're wonderin' where Maisenta's gone, she's keepin' an eye on her stall. She'll be right back when it's time to get started, though."},{"name":"BAENFAELD","text":"You'd think she'd have enough on her plate already, what with all that buyin' and sellin'. Good of her to find the time─and gil─to help us lot with the festival. Her voice ain't half bad, neither."},{"name":"BAENFAELD","text":"It's hard to believe she wants someone like me to be in her choir. I don't know the first thing about music! Best I can manage is a few sea shanties, and that's only when I'm in me cups."},{"name":"BAENFAELD","text":"Might as well make the most of it, I suppose. And if we're enjoyin' ourselves, maybe the younglin's will too. As long as they stick around long enough to get their presents, we can consider it a success."},{"name":"BAENFAELD","text":"But how about you? Had a chance to practice your wand wavin'? If not...well, it's a bit late to start now, but I'm sure you'll pick it up as we go along."},{"name":"BAENFAELD","text":"It looks like we've already got a few people lined up to watch the show. You can see the Starlight celebrants herdin' them together just over yonder."},{"name":"BAENFAELD","text":"I'd watch out for that enthusiastic-lookin' lass over there, though. She's been tellin' folk about “the most lauded musicians the realm has ever known” and they seemed to be lappin' it up."},{"name":"BAENFAELD","text":"I appreciate her drummin' up a crowd like that, but I think their expectations might be a bit too high, what with this bein' our first performance. Might be an idea to start with the other lot. They seem less like to take offense to a flat note or two."},{"name":"BAENFAELD","text":"Once we're feelin' confident, we can take a crack at somethin' trickier. But you're the conductor, so you get final say as to what we sing and when."},{"name":"BAENFAELD","text":"Well, there's no time like the present! Let one of the Starlight celebrants know when you're ready to begin."},{"name":"SYSTEM","text":"Quest difficulty and rewards will vary according to which Starlight celebrant you approach."},{"name":"BAENFAELD","text":"Back for more?"},{"name":"BAENFAELD","text":"We've still got plenty of festival-goers to entertain, so as soon as you're ready, let one of the Starlight celebrants know."},{"name":"SYSTEM","text":"Quest difficulty and rewards will vary according to which Starlight celebrant you approach."},{"name":"BAENFAELD","text":"I'm not sure what's worse─downplayin' the performance and makin' the crowd lose interest, or exaggeratin' and risk them bein' disappointed. Mind you, if our singin' is up to snuff, we'll have nothin' to worry about."},{"name":"COMMITTEE03174A","text":"Finished your preparations? That's good. &lt;sigh&gt; I've been struggling to keep the younglings amused while they wait. Then I told them that only the most well-behaved child would receive a present, and they soon settled down. Anyway, it's about time we got started. This way, please."},{"name":"SYSTEM","text":"Speak with this Starlight celebrant to begin the cantabile. You will earn two certificates of good cheer for successful completion of this piece."},{"name":"SYSTEM","text":"To attempt the capriccio, speak with the splendiferous Starlight celebrant. The rewards for successful completion vary according to difficulty."},{"name":"Q1","text":"Do you wish to begin the cantabile?<br>You will earn two certificates of good cheer for successful completion of this piece."},{"name":"A1","text":"Yes."},{"name":"A1","text":"Not yet."},{"name":"A1","text":"How do I conduct a choir?"},{"name":"COMMITTEE03174A","text":"Having second thoughts? Stage fright, perhaps? I don't blame you. I can't imagine standing in front of the crowd, pretending to know what I'm doing. Maybe you should come back once you've plucked up the courage."},{"name":"SYSTEM","text":"The choir will now perform a song. Time your inputs with the on-screen prompts."},{"name":"SYSTEM","text":"When a blue prompt appears (left), time your input as the diamonds overlap.<br>When an orange prompt appears (right), make several rapid inputs until the prompt disappears.<br>The controls are as follows:"},{"name":"SYSTEM","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mouse: Left-click or right-click anywhere on screen<br>Keyboard: Any standard, unmodified key<br>Please note that chat will be temporarily disabled.</span><span class=\"alternative\">Controller</span><span class=\"alternative\">Gamepad</span><span class=\"alternative\">: All buttons and directional buttons except [???]</span></span> "},{"name":"SYSTEM","text":"To access the Pause menu, press the <span class=\"alternative-container\"><span class=\"alternative\">esc</span><span class=\"alternative\">Esc</span></span> key or [???] button, from which you may choose to end the performance."},{"name":"SYSTEM","text":"If you fail to follow an on-screen prompt, you will incur a penalty."},{"name":"SYSTEM","text":"When a certain number of penalties have been incurred, the performance will not end immediately, but your attempt will be unsuccessful."},{"name":"SYSTEM","text":"In the event of failure or quitting during the performance, you may attempt it again by speaking to either of the Starlight celebrants."},{"name":"COMMITTEE03174A","text":"Oh, well done! That was a lot better than it could have been. I didn't have much hope, but I was pleasantly surprised."},{"name":"COMMITTEE03174A","text":"Please give my regards to the members of the choir."},{"name":"COMMITTEE03174B","text":"Hark! The conductor beyond compare makes <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> grand entrance! The crowd can barely contain their excitement! Are your preparations complete, maestro?"},{"name":"SYSTEM","text":"Speak with this Starlight celebrant to begin the capriccio. You will earn three certificates of good cheer for successful completion of this piece."},{"name":"SYSTEM","text":"To attempt the cantabile, speak with the saturnine Starlight celebrant. The rewards for successful completion vary according to difficulty."},{"name":"Q2","text":"Do you wish to begin the capriccio?<br>You will earn three certificates of good cheer for successful completion of this piece."},{"name":"A2","text":"Yes."},{"name":"A2","text":"Not yet."},{"name":"A2","text":"How do I conduct a choir?"},{"name":"COMMITTEE03174B","text":"Oh, you require a little more time? As I always say “There is nothing in life as fleeting or capricious as inspiration.” Your adoring audience would endure a lifetime of waiting if only to witness a master at work for the briefest moment. A bell or two longer will make little difference."},{"name":"SYSTEM","text":"The choir will now perform a song. Time your inputs with the on-screen prompts."},{"name":"SYSTEM","text":"When a blue prompt appears (left), time your input as the diamonds overlap.<br>When an orange prompt appears (right), make several rapid inputs until the prompt disappears.<br>The controls are as follows:"},{"name":"SYSTEM","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mouse: Left-click or right-click anywhere on screen<br>Keyboard: Any standard, unmodified key<br>Please note that chat will be temporarily disabled.</span><span class=\"alternative\">Controller</span><span class=\"alternative\">Gamepad</span><span class=\"alternative\">: All buttons and directional buttons except [???]</span></span>"},{"name":"SYSTEM","text":"To access the Pause menu, press the <span class=\"alternative-container\"><span class=\"alternative\">esc</span><span class=\"alternative\">Esc</span></span> key or [???] button, from which you may choose to end the performance."},{"name":"SYSTEM","text":"If you fail to follow an on-screen prompt, you will incur a penalty."},{"name":"SYSTEM","text":"When a certain number of penalties have been incurred, the performance will not end immediately, but your attempt will be unsuccessful."},{"name":"SYSTEM","text":"In the event of failure or quitting during the performance, you may attempt it again by speaking to either of the Starlight celebrants."},{"name":"COMMITTEE03174B","text":"Bravo! It was everything I could have dreamed of, and more! That heavenly melody shall echo within not only our ears, but our hearts─now and forevermore. Indeed, future generations will still speak of the angels who once descended to bless us with their song."},{"name":"COMMITTEE03174B","text":"Pray, pass on my sentiments of utmost gratitude to the members of the choir, the heavenly conduits through which your genius has graced Gridania, nay, Eorzea!"},{"name":"BAENFAELD","text":"Phew! This singin' lark's harder than it looks! Good thing we had you to keep us in time."},{"name":"BAENFAELD","text":"'Course, we'll be puttin' on more shows, all the way to the end of the Starlight Celebration. I think we'll be able to put on a fairly convincin' performance even without a conductor, but if you've got time to spare, why not join us for another singsong?"},{"name":"BAENFAELD","text":"Oh, and one other thing─I think Amh Garanjy wanted to say somethin' to you. Probably wants to say “thank ye” or summat."}],"reward":{"items":[{"num":2,"id":24284},{"num":3,"id":24284}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68709]},"next":[68711]},"partials":[{"type":"npc","id":"1026629","obj":{"i":1026629,"n":"Baenfaeld","l":53,"q":1}},{"type":"item","id":"24284","obj":{"i":24284,"n":"Expired Certificate of Good Cheer","l":1,"c":26172,"t":85}},{"type":"quest","id":"68709","obj":{"i":68709,"n":"Not-so-silent Night","g":204,"l":"Gridania","s":166}},{"type":"quest","id":"68711","obj":{"i":68711,"n":"Theatgrhythdaniam","g":204,"l":"Gridania","s":168}}]}