{"quest":{"name":"Between a Rock and the Hard Place","location":"Idyllshire","id":68713,"patch":4.5,"sort":5702,"unlocksFunction":1,"eventIcon":71341,"issuer":1012299,"target":1018393,"genre":101,"journal":["Geimlona has another favor to ask of a dependable adventurer."],"objectives":["Speak with Adkiragh at the Hard Place."],"dialogue":[{"name":"GEIMLONA","text":"Well, well, if it ain't the dependable adventurer."},{"name":"GEIMLONA","text":"I've heard about what you've done for Zhloe, and I want to express my gratitude. When last I spoke with the lass, she couldn't say enough good things about you. Truly, you've got a good heart beatin' in that breast...which is why I'm hopin' you could do me another favor."},{"name":"GEIMLONA","text":"Do you know a fellow named Adkiragh? Owner of the Hard Place? Even if you haven't spoken with him, you're bound to have seen him at the very least, by virtue of his...unique attire."},{"name":"GEIMLONA","text":"Somethin' clearly weighs on his mind of late, and it ain't just the peculiar headpiece he wears. Why, even the piggy face seems to look downcast."},{"name":"GEIMLONA","text":"Thinkin' to help out a fellow man, I went and asked what troubled him, but he wasn't minded to talk. Might be as it's because he regards the House as a competitor."},{"name":"GEIMLONA","text":"Whatever his reasons, he refuses to open up to me, but I daresay you'll fare better. When you have a spare moment, I'd thank you to seek him out. See if you can coax out whatever it is that's botherin' him."},{"name":"GEIMLONA","text":"Adkiragh wasn't inclined to open up to me about his woes, but I daresay you'll fare better. When you have a spare moment, I'd thank you to seek him out at the Hard Place. See if you can coax out whatever it is that's botherin' him."},{"name":"ADKIRAGH","text":"Well now, you certainly are not typical of our clientele. But if you are not here for our famous hospitality, what could you possibly be here for?"},{"name":"ZHLOEALIAPOH","text":"<span class=\"highlight\">Forename</span> is here for you, Master Adkiragh! Doubtless <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> heard your fussing and fretting from a malm away, and being the kindly soul that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s come to check on you."},{"name":"ZHLOEALIAPOH","text":"Isn't that right, <span class=\"highlight\">Forename</span>?"},{"name":"ADKIRAGH","text":"Hmph, your concern is wholly misguided. Why would the proprietor of a wildly successful establishment such as mine have aught to worry about? Look into these eyes and tell me you see even a fleck of doubt!"},{"name":"ZHLOEALIAPOH","text":"Oh, this must be the parchment you were staring at so intently earlier!"},{"name":"ZHLOEALIAPOH","text":"My, such a fine parchment it is! Much, much finer than anything Zhloe has. Hmmm...these numbers in it don't look so fine, though. If I didn't know better, I'd say you're making a..."},{"name":"ADKIRAGH","text":"What are you─!? You shouldn't be─!"},{"name":"ZHLOEALIAPOH","text":"...Massive loss!? Is...is this true?"},{"name":"ADKIRAGH","text":"Ahahahaha! The illustrious Adkiragh, entrepreneur extraordinaire, making a loss? The mere suggestion is laughable!"},{"name":"ADKIRAGH","text":"&lt;sigh&gt; Oh, who am I fooling? Of late, adventurers have been flocking to the Far East. Idyllshire is all but forgotten. Business has dried up, and the Hard Place is, ironically, in a hard place."},{"name":"ZHLOEALIAPOH","text":"You mustn't give up, Master Adkiragh! If there's any way Zhloe can help, just say so. For example, I can supply you with...flatbread! They might be a little on the stale side, but a little staleness never killed anyone─at least not Zhloe!"},{"name":"ZHLOEALIAPOH","text":"But whatever happens, we can't allow the Hard Place to go out of business. If it does, what would happen to Menphina's Arms and all the children She holds in her loving embrace? We must think of the children! ...Speaking of which, when did I feed them last? Was it yesterday? Or the day before?"},{"name":"ZHLOEALIAPOH","text":"Oh, but such minutiae as mealtime are of no consequence next to the threat of closure. We've been doing so well with <span class=\"highlight\">Forename</span>'s help. Zhloe can't bear the thought of having it all come undone now..."},{"name":"MELODIE","text":"(-Flustered Maiden-)&lt;gasp&gt; P-Please... &lt;pant&gt; I need...I need a place to hide..."},{"name":"ZHLOEALIAPOH","text":"Oh dear! What's going on!?"},{"name":"ADKIRAGH","text":"Whatever it is, my illustrious self cannot in good conscience turn away a damsel in distress. Quickly, my fair lady─don this!"},{"name":"REGENTA03177","text":"...I take it you're in charge of this place."},{"name":"REGENTA03177","text":"We are searching for an Ishgardian woman, name of Melodie. Have you seen her? I advise you to be truthful, else there will be repercussions."},{"name":"ADKIRAGH","text":"Hmph, we know of no such woman. And even if we did, we are disinclined to cooperate with brutes who make threats. I advise you not to cause trouble in my establishment..."},{"name":"ADKIRAGH","text":"Else you will have to answer to me, the illustrious Adkiragh, and the battle-hardened [Job] there!"},{"name":"REGENTB03177","text":"...Point taken. Don't take it personally, eh? We're just doin' our jobs. We're done here."},{"name":"ZHLOEALIAPOH","text":"Well, what a rude pair! And did you see their hair? Ridiculous, wasn't it? But what was I going say? Oh, right! Why were they after you?"},{"name":"MELODIE","text":"First, allow me to thank you. As you may have gathered, I am─was─a maid. I served an Ishgardian nobleman, but he treated me most cruelly. Unable to bear the torment any longer, I chose to flee from his household."},{"name":"MELODIE","text":"I had given little thought to what I would do after I had made good my escape, but I cannot well return to Ishgard. You have already done me a great kindness by harboring me, but will you not take me into your employ? I have nowhere else to turn, and I promise I shall work very hard..."},{"name":"ADKIRAGH","text":"I see. I should be glad to welcome you into the fold, but I will not lie: the business has seen better days, and you may well be boarding an airship that will go down in flames."},{"name":"ZHLOEALIAPOH","text":"Oh, I have a plan! One that will change the fortunes of the Hard Place! Would you like to know what it is? But of course you do! So I will tell you right now! We create a new menu!"},{"name":"ZHLOEALIAPOH","text":"Miss Melodie, you are an Ishgardian and a maid. That's to say, an Ishgardian maid. Is Zhloe right to assume that you are familiar with your nation's cuisine? With your knowledge, you can help us introduce new dishes!"},{"name":"MELODIE","text":"You assume rightly, Mistress Zhloe. I am well acquainted with Ishgardian cuisine, be it that partaken by highborn or low. And I am pleased to say that I'm not without skill in the kitchen. I should be glad to assist in this endeavor."},{"name":"ZHLOEALIAPOH","text":"Did you hear that, <span class=\"highlight\">Forename</span>? We have the knowledge <span class=\"emphasis\">and</span> skill to prepare the dishes! The only things we're missing now are ingredients. And utensils. And cutlery. And possibly some other trifle that hasn't occurred to me yet. Anyway, being the resourceful adventurer you are, Zhloe has no doubt that you can supply all these things!"},{"name":"ZHLOEALIAPOH","text":"If we can make the Hard Place thrive again, so too will the whole of Idyllshire. That's a good thing, like pineapple pudding! Or juice! Both of which can be purchased with the scrips you can earn by contributing to this cause! I still need to ask Mistress Rowena about it, of course, but I'm sure she'll say yes. We were really, really good friends after all! As a matter of fact, Zhloe will go and speak with her right now!"},{"name":"ADKIRAGH","text":"Well, it appears that all has been decided for me..."},{"name":"ADKIRAGH","text":"Spontaneously though it was conceived, young Zhloe's plan holds promise. Our success rides upon your ability to provide us with what we need, but Zhloe has placed her trust in you, and so shall I. I beg you, help us bring the Hard Place back from the brink!"},{"name":"ADKIRAGH","text":"Lest you worry about recompense, if the House itself will be supporting the endeavor, you may be assured that your efforts will not go unrewarded."},{"name":"ADKIRAGH","text":"I, for my part, care not for profit; the House is welcome to everything so long as the Hard Place survives. Without further ado, then, let us set to work. Go forth, my friend, and bring us the Ishgardian culinary essentials we require!"}],"reward":{"gil":620,"items":[{"id":12864},{"id":12868}]},"reqs":{"jobs":[{"lvl":66,"id":35}],"questsType":"all","quests":[68089,67087]},"next":[68714]},"partials":[{"type":"npc","id":"1012299","obj":{"i":1012299,"n":"Geimlona","l":2082,"q":4}},{"type":"npc","id":"1018393","obj":{"i":1018393,"n":"Adkiragh","l":2082,"q":1}},{"type":"item","id":"12864","obj":{"i":12864,"n":"Clam Chowder","l":150,"c":24114,"t":46}},{"type":"item","id":"12868","obj":{"i":12868,"n":"Stuffed Chysahl","l":150,"c":24159,"t":46}},{"type":"quest","id":"68089","obj":{"i":68089,"n":"Stormblood","g":6,"l":"The Lochs","s":1130}},{"type":"quest","id":"67087","obj":{"i":67087,"n":"Arms Wide Open","g":101,"l":"Idyllshire","s":5701,"f":1}},{"type":"quest","id":"68714","obj":{"i":68714,"n":"He Ain't Piggy, He's My Brother","g":101,"l":"Idyllshire","s":5703,"f":1}}]}