{"quest":{"name":"Parley on the Front Lines","location":"Kienkan","id":68718,"patch":4.5,"sort":37,"icon":100820,"eventIcon":71201,"issuer":1025597,"target":1026823,"genre":7,"journal":["Hien stands ready to depart for Ala Mhigo.","Hien gives orders in preparation for his departure to Ala Mhigo, and Alisaie shares the instructions she received from Lyse. You are to head to Porta Praetoria, where a Resistance fighter will escort you to Alliance Headquarters on Ala Mhigo's northeastern border.","You locate the Resistance fighter ordered to await your arrival in the Lochs. Without further ado, you follow your guide to the Alliance's newly constructed field camp.","After listening to your various reports concerning Alphinaud, Gaius, and the lethal Black Rose, Lyse shares her own piece of news: it seems that Emperor Varis himself will be taking a chair at the negotiation table on the condition that you and another member of the Scions are present. Lyse bids you let her know when you are prepared to attend the parley.<br><br>※In the event that you leave Alliance Headquarters, speak with the Resistance fighter in Porta Praetoria to re-enter the field camp.","You attend the first round of parley only to witness Emperor Varis dismantle every argument the Alliance leaders bring against him. Rather than let the opportunity for peace slip away, Alisaie begs the Empire's ruler to consider alternatives to war. The Emperor grudgingly agrees to a short recess, granting you time to confer with your comrades.<br><br>※In the event that you leave the Garlean Legion Tents, speak with the Resistance fighter in Porta Praetoria to re-enter the site of the parley.","Alisaie suspects Emperor Varis has attended the parley for reasons other than brokering a peace. She suggests you speak with the Alliance leaders, and formulate a strategy for learning the Emperor's true purpose.","You speak with each of the Alliance leaders in turn, and discuss a number of potential tactics. It is time to report to Alisaie with the insights you have gained.","The parley reconvenes, and the Alliance leaders at last elicit a blunt answer from Emperor Varis. But the revelation is hardly a welcome one. He explains how the Empire is a creation of the Ascians, and that to reclaim the world for the races of man, all nations must join together as one. The assembled dignitaries balk at his ultimatum─that in order to win their freedom, they must allow the Rejoining to proceed. Unable to countenance a sacrifice of that scale, you, too, add your voice to the chorus of defiance, and the talks rapidly disintegrate. With the Emperor's hostile farewell still ringing in the air, your party withdraws to Alliance Headquarters.","Though peace was never a likely outcome, it seems the parley was successful in its primary purpose: the delay has allowed the vanguard from Doma time to arrive before hostilities begin in earnest..."],"objectives":["Speak with the Resistance fighter in Porta Praetoria.","Speak with Lyse.","Speak with Alisaie.","Speak with the Alliance leaders.","Report to Alisaie.","Speak with Lyse."],"dialogue":[{"name":"YUGIRI","text":"Go on ahead, <span class=\"highlight\">Forename</span>. I will join you in Ala Mhigo with our advance party as soon as I can."},{"name":"HAKUROU","text":"While you and my lord Hien are away crossing swords with the Empire in distant Ala Mhigo, I shall be here with the remainder of our forces, watching our borders. Pray send the Garleans my regards."},{"name":"ALISAIE","text":"Come, let's return to Lyse and share the good news about our Far Eastern reinforcements."},{"name":"KIENKANGATEKEEPER03028","text":"Lord Hien is expecting you. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"HIEN","text":"We must leave now to convene with Eorzea's leaders, and it may be some time before I return to Doma."},{"name":"HIEN","text":"Hakuro─I leave you in command."},{"name":"HAKUROU","text":"My lord!"},{"name":"YUGIRI","text":"I shall assemble an advance party with all haste, and join you in Ala Mhigo forthwith."},{"name":"ALISAIE","text":"I've just received word from Lyse. The Alliance has established a base camp near Ala Mhigo's northeastern border."},{"name":"ALISAIE","text":"Once we've arrived in the Lochs, we're to report to a Resistance officer stationed in Porta Praetoria who will point us in the right direction. Let's not keep them waiting."},{"name":"HAKUROU","text":"Seiryu's Wall is a formidable barrier, but we cannot afford to lower our guard even for a moment. Only constant vigilance will keep Doma safe from her enemies."},{"name":"HIEN","text":"Here we are again, ready to fight the same foe... Yet I would not be anywhere else. This conflict concerns us all. Come what may, we cannot allow the Empire to regain its grip on Ala Mhigo."},{"name":"ALISAIE","text":"Here. I think we've found the guide Lyse mentioned."},{"name":"RESISTANCEGATEKEEPER","text":"Ah, you must be the Scion party I was told to look out for! If you'll follow me, I'll take you directly to Alliance Headquarters."},{"name":"Q1","text":"Accompany the Resistance fighter to Alliance Headquarters?"},{"name":"HIEN","text":"Is Emperor Varis in thrall to the Ascians? That is the question."},{"name":"ALISAIE","text":"If Sharlayan could not negotiate peace with the Empire, I rather doubt war can be avoided here. But every moment we steal for our preparations will count in the final reckoning."},{"name":"RAUBAHN","text":"Should the Empire decide to ignore the rules of parley, we could be fighting far sooner than we'd like. Keep your weapons close."},{"name":"LYSE","text":"Well, I don't suppose it's polite to keep an emperor waiting <span class=\"emphasis\">too</span> long. Shall we?"},{"name":"Q1","text":"Parley with the Emperor?"},{"name":"NANAMOULNAMO","text":"For years have we warred with the Empire, and with no end in sight. A parley such as this represents a unique opportunity, and I would not squander it with bitter words."},{"name":"RAUBAHN","text":"Varis holds fast to his ideals, just as I knew he would. He will not be swayed from this path."},{"name":"LYSE","text":"Why do I get the feeling the Emperor is hiding something...?"},{"name":"MERLWYB","text":"'Tis true that Limsa Lominsa's beginnings were not wholly honorable. But our old wrongs do not make the Empire's deeds right."},{"name":"KANESENNA","text":"I do much wonder at Emperor Varis's decision to attend these negotiations... It is plain he has no intention of hearkening to our entreaties. But what then is his goal?"},{"name":"HIEN","text":"For a moment, I feared our talks would descend into violence there and then. Alisaie speaks of her dislike for politics, but her honest plea may very well have prevented an early battle."},{"name":"AYMERIC","text":"Whatever rebuttal I had in mind was lost when Varis mentioned my father. The man is certainly skilled at keeping his opponents off balance."},{"name":"RESISTANCEGATEKEEPER","text":"Shall I escort you to the parley, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>?"},{"name":"Q2","text":"Proceed to the Garlean Legion Tents?"},{"name":"RESISTANCEGATEKEEPER03182","text":"If you wish, I can escort you directly to the parley, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"Q3","text":"Proceed to the Garlean Legion Tents?"},{"name":"ALISAIE","text":"Phew. This is really not my forte."},{"name":"ALISAIE","text":"After His Radiance's little performance, it was all I could do not to swear at him. I honestly don't know how I ended up playing the mediator."},{"name":"ALISAIE","text":"I just asked myself what Alphinaud would have done, tried my best to do the same, and...by some miracle, it worked."},{"name":"ALISAIE","text":"But there really is no common ground to be found with that man─nor do I think he looked for any. So the question becomes, what did he come here to do─because you may be certain it wasn't to make peace."},{"name":"ALISAIE","text":"&lt;sigh&gt; ...Whatever it is, I can't make it out─not yet, at least. We do have a little time before the parley is due to reconvene, though, so why not try consulting our illustrious leaders? Mayhap they have some insight to share."},{"name":"ALISAIE","text":"The meeting isn't due to reconvene for a while yet. You might want to ask the others what they think the Emperor is after. It's not impossible one of them could have spotted something we've missed."},{"name":"NANAMOULNAMO","text":"Twelve have mercy... But for Lady Alisaie's timely interjection, we might well have come to blows at the negotiating table."},{"name":"NANAMOULNAMO","text":"Not that Emperor Varis left us a great many options. Is unconditional surrender all he will accept, do you think?"},{"name":"RAUBAHN","text":"Ere he arrived, I'd have said yes. But having heard him speak...I cannot help but think he came with some other end in mind."},{"name":"LYSE","text":"Exactly! He's building up to something, I know it!"},{"name":"NANAMOULNAMO","text":"Hmm... How then should we approach the rest of the parley? Have you anything to say, Warrior of Light?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Invite Varis to explain himself."},{"name":"A1","text":"Say nothing of Zenos or the Ascians."},{"name":"NANAMOULNAMO","text":"You believe he is more apt to reveal the truth if we put him at his ease? ...Mayhap you are right."},{"name":"NANAMOULNAMO","text":"Thank you, <span class=\"highlight\">Forename</span>."},{"name":"MERLWYB","text":"I will say one thing for this Varis─he is well versed in Eorzean history."},{"name":"KANESENNA","text":"His interest in our affairs is that of a beast in its prey. The conqueror would know his enemies."},{"name":"MERLWYB","text":"<span class=\"emphasis\">All</span> should know their enemies. Yet there is much and more we do not know of the Empire."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm sure Varis would be happy to tell you more..."},{"name":"A2","text":"Then it's up to us to change that. Here and now."},{"name":"MERLWYB","text":"Hah! You would have me ask the Emperor himself? Well, mayhap there is some wisdom in that."},{"name":"MERLWYB","text":"If we can skirt the storm of his displeasure, we may yet come to our answers...even if it does mean sailing close to the wind."},{"name":"HIEN","text":"This parley was never like to bring peace, but I <span class=\"emphasis\">had</span> hoped to learn something of Emperor Varis's relationship with the Ascians..."},{"name":"AYMERIC","text":"As had we all. Yet if he <span class=\"emphasis\">is</span> in league with them, he is not like to volunteer the fact─and if he is <span class=\"emphasis\">not</span>...how much weaker would his position seem for their presence. If we are to broach that particular subject, we will need to be subtle... &lt;sigh&gt; Would that I knew more of the man... If you would indulge me, Lord Hien: you received an imperial education, did you not? Is it true that the Emperor's will is considered absolute?"},{"name":"HIEN","text":"There is no higher authority in all of Garlemald, nor else in the heavens, come to that. Veneration of the gods is forbidden─the only worship permitted being that of His Radiance's own person."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"That sounds suspiciously like a religion in itself."},{"name":"A3","text":"......"},{"name":"HIEN","text":"I share your disdain for their hypocrisy. Even as they denigrate the idea of faith, they revere their leader with a fervor others reserve for the divine."},{"name":"HIEN","text":"'Tis a flaw common to much of the doctrine they fed us─logical on the surface, perhaps, but contradictory upon closer examination. I wonder if a discussion of the various discrepancies might prompt Varis to reveal something...?"},{"name":"ALISAIE","text":"You've spoken with everyone then? Good. Now, all that remains is to await the pleasure of the Emperor, and hope we fare better at the second attempt..."},{"name":"LYSE","text":"I came back to find Doma's advance party ready and waiting for battle. So, as worrying as our little chat with the Emperor was, it <span class=\"emphasis\">did</span> buy enough time for at least some of our allies to arrive."}],"reward":{"gil":2298,"items":[{"id":24274,"one":1},{"id":24279,"one":1},{"id":24280,"one":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68717]},"next":[68719]},"partials":[{"type":"npc","id":"1025597","obj":{"i":1025597,"n":"Hien","l":2847,"q":7}},{"type":"npc","id":"1026823","obj":{"i":1026823,"n":"Lyse","l":2862,"q":2}},{"type":"item","id":"24274","obj":{"i":24274,"n":"Rooibos Tea","l":370,"c":24412,"t":46}},{"type":"item","id":"24279","obj":{"i":24279,"n":"Salmon Muffin","l":370,"c":24025,"t":46}},{"type":"item","id":"24280","obj":{"i":24280,"n":"Shakshouka","l":370,"c":24262,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"68717","obj":{"i":68717,"n":"Seiryu's Wall","g":7,"l":"Kienkan","s":36}},{"type":"quest","id":"68719","obj":{"i":68719,"n":"The Face of War","g":7,"l":"Alliance Headquarters","s":38}}]}