{"quest":{"name":"A Defector's Tidings","location":"The Dravanian Hinterlands","id":68716,"patch":4.5,"sort":35,"eventIcon":71201,"issuer":1026781,"target":1026784,"genre":7,"journal":["The news from Ala Mhigo has left Alisaie in a state of nervous excitement."],"objectives":["Speak with the Resistance guard in the Ala Mhigan Quarter.","Speak with Alisaie.","Speak with Hien."],"dialogue":[{"name":"KRILE","text":"I'm sorry I couldn't do more. I've never seen a soul's thread end so abruptly before..."},{"name":"ALISAIE","text":"I almost can't bear to hear what Maxima has to tell us..."},{"name":"ALISAIE","text":"But it can't be bad news, can it? Lyse would have said. Unless─ Agh, there's no point speculating. Lyse said she'd notified the guards of our coming, so we should head straight to the palace gate in the Ala Mhigan Quarter."},{"name":"KRILE","text":"I'll be praying for good news. Learn what you can about Alphinaud's plight, and leave the search for our friends' lost souls to me."},{"name":"ALISAIE","text":"Alphinaud will be all right. He has to be."},{"name":"RESISTANCEGATEGUARD","text":"Greetings, Scions─the commander told me to expect you. Shall I show you in?"},{"name":"Q1","text":"Enter the Royal Palace?"},{"name":"RESISTANCEGATEGUARD","text":"So the Garleans make ready to move against us, do they? Well, I would sooner die than wear shackles again...<br>Commander Hext mentioned you carry a message for Lord Hien. May your road to the Far East be free of imperial curs."},{"name":"ALISAIE","text":"So, Alphinaud is safe─for the present, at least. Now all we need to worry about is a full-scale imperial invasion..."},{"name":"ALISAIE","text":"I'm actually glad Lyse tasked us with visiting Lord Hien─better to be dashing from place to place than sitting around stewing over things we can't change. To the enclave!"},{"name":"YUGIRI","text":"<span class=\"highlight\">Forename</span>. You have arrived in time to witness the beginnings of our new alliance. Our proposal struck a chord with many of our neighbors, I am pleased to say."},{"name":"HAKUROU","text":"Alone, Doma could accomplish little against the Empire, but in concert with the allies who have gathered here today, we might do much."},{"name":"TANSUI","text":"The imperials have enjoyed the freedom of the Ruby Sea for long enough. 'Tis time they paid their dues."},{"name":"AOKORAHERALD","text":"We of the Blue Kojin will not submit to the Empire's tyranny. If only our Red brethren would awaken to their folly..."},{"name":"CIRINA","text":"After their humbling at your hands, Magnai and his Oronir have spent every waking moment upon the training fields. Defeat does not sit well with the Sun and his children."},{"name":"NAGUSAHERALD","text":"I am come to represent the lands of Nagxia. Long have we struggled in defiance of the Empire, waiting for just such an opportunity as this alliance presents."},{"name":"DALMASCAHERALD","text":"The fall of Rabanastre was not the end of our nation. We who survived retreated underground, and have been gathering strength to mount a counteroffensive. Dalmasca will rise again."},{"name":"KIENKANGATEKEEPER03028","text":"I see you have tidings for Lord Hien. May I show you in?"},{"name":"EVENTAREA","text":"Enter the Kienkan?"},{"name":"TANSUI","text":"The young lord of Doma has requested my presence. I do hope my garb is fancy enough for his hall."},{"name":"CIRINA","text":"A war council for the alliance is about to begin, and I have been chosen as the voice of the Steppe. I shall do my utmost to represent the will of all the tribes."},{"name":"HIEN","text":"Greetings, my friends. I was just discussing future endeavors with the members of our newly formed alliance."},{"name":"HIEN","text":"The Kojin and the Confederacy you already know, and it was your own strength of arms that won us the cooperation of the Steppe tribes."},{"name":"HIEN","text":"We have also been joined by our neighbors from Nagxia, and the indomitable citizens of Dalmasca...though the scattered nature of the latter's resistance will somewhat delay their official induction."},{"name":"HIEN","text":"These proud peoples have united under a single purpose: to stand against the tyranny of the Garlean Empire."},{"name":"ALISAIE","text":"I am glad to see your alliance is coming together so swiftly. As things stand, I fear we shall soon have need of your strength..."},{"name":"HIEN","text":"I thank you for bringing me news of Alphinaud. His fate is never far from my thoughts─and not only because he is our emissary. As for this sudden deployment of imperial forces, I agree that Ala Mhigo would be wise to shore up its borders with all haste."},{"name":"YUGIRI","text":"Every report we receive from our shinobi indicates a massing of troops in the western provinces. It seems all but certain that the Empire is poised to bring its fist down upon Eorzea."},{"name":"HIEN","text":"And I would help deflect that blow. But I cannot risk sending reinforcements just yet. We will remain vulnerable to airborne assault until our wall in the Burn is in place."},{"name":"ALISAIE","text":"The all-important Allagan energy barrier."},{"name":"HIEN","text":"The...energy barrier, yes. I thought to call it something more auspicious. A name drawn from the Four Lords of legend, perhaps─“Seiryu's Aegis” or some such. Well, just a thought."},{"name":"YUGIRI","text":"The Ironworks engineers report that they have finished calibrating the generators, and are ready to proceed to the testing stage."},{"name":"HIEN","text":"Have you time to attend the first test? You've seen the field which protected Azys Lla firsthand, and I would be interested to hear how you think ours compares."},{"name":"ALISAIE","text":"I will come too, if you don't mind. Though I am no Y'shtola, I may be able to offer some insight."},{"name":"HIEN","text":"Of course. Time being of the essence, it would be best if we made directly for the Burn. Yugiri, I leave you and Hakuro to bring the war council to a close."},{"name":"YUGIRI","text":"Understood.<br>Your mounts are saddled and ready, my lord. Ware the storms."}],"reward":{"gil":2823,"items":[{"id":24276,"one":1},{"id":24278,"one":1},{"id":24277,"one":1},{"id":24275,"one":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68715]},"next":[68717]},"partials":[{"type":"npc","id":"1026781","obj":{"i":1026781,"n":"Alisaie","l":2001,"q":2}},{"type":"npc","id":"1026784","obj":{"i":1026784,"n":"Hien","l":2847,"q":2}},{"type":"item","id":"24276","obj":{"i":24276,"n":"Laghman","l":370,"c":24026,"t":46}},{"type":"item","id":"24278","obj":{"i":24278,"n":"Papanasi","l":370,"c":24086,"t":46}},{"type":"item","id":"24277","obj":{"i":24277,"n":"Imam Bayildi","l":370,"c":24162,"t":46}},{"type":"item","id":"24275","obj":{"i":24275,"n":"Ginger Salad","l":370,"c":24207,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"68715","obj":{"i":68715,"n":"Soul Searching","g":7,"l":"The Rising Stones","s":34}},{"type":"quest","id":"68717","obj":{"i":68717,"n":"Seiryu's Wall","g":7,"l":"Kienkan","s":36}}]}