{"quest":{"name":"Soul Searching","location":"The Rising Stones","id":68715,"patch":4.5,"sort":34,"icon":100819,"eventIcon":71201,"issuer":1025549,"target":1026781,"genre":7,"journal":["Alisaie is at her wit's end.","You visit the Rising Stones to find Alisaie at her wit's end. Even as she wonders which of the Scions' mounting problems to tackle first, Krile arrives to bring calm to the situation. After examining the afflicted in the infirmary, Krile comes to the same conclusion as the Elder Seedseer: it's as if the souls of their companions have taken leave of their bodies. She offers to follow the trail of their aether, but to do so will require the use of Master Matoya's Crystal Eye. It seems a trip to the Dravanian hinterlands is in order.","You gather in Matoya's Cave, and Krile endeavors to track down your stricken companions' missing souls. Despite her best efforts, however, it appears that the threads of aether come to an abrupt end. Bemused and dismayed, you decide to focus instead upon the matters of the present. Alisaie has had word from Lyse that members of the Populares have defected from the Empire, and is desperate to learn of Alphinaud's fate.","You join Alisaie outside of Matoya's Cave. Despite the elder's brusque nature, it appears that her words have done much to boost Alisaie's spirits."],"objectives":["Speak with Alisaie in front of Matoya's Cave.","Speak with Alisaie."],"dialogue":[{"name":"KRILE","text":"Please do keep Alphinaud's little speech to yourself. He can be awfully sensitive at times..."},{"name":"ALIANNE","text":"Their souls have left their bodies, yet they still live? I didn't know such a thing was even possible..."},{"name":"ALISAIE","text":"I'd heard Master Matoya was something of a recluse, but this seems...extreme. Still, I'll happily overlook her eccentricities if she agrees to help us."},{"name":"KRILE","text":"I'm sorry I couldn't do more. I've never seen a soul's thread end so abruptly before..."},{"name":"MATOYA","text":"Don't look like that. Shtola survived being cast adrift in the Lifestream, didn't she? Her soul is nothing if not resilient─and the same goes for all of Louisoix's students. So stop worrying about whether you'll see them again, and focus on what can be done in the here and now."},{"name":"ALISAIE","text":"So that was the woman who tamed Y'shtola... I had the distinct feeling of being grabbed by the scruff of the neck and having the nonsense shaken out of me."},{"name":"ALISAIE","text":"When Alphinaud is back, I'd like to visit again and ask her what tales she has of Grandfather."}],"reward":{"gil":1331},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68685]},"next":[68716]},"partials":[{"type":"npc","id":"1025549","obj":{"i":1025549,"n":"Alisaie","l":481,"q":5}},{"type":"npc","id":"1026781","obj":{"i":1026781,"n":"Alisaie","l":2001,"q":2}},{"type":"quest","id":"68685","obj":{"i":68685,"n":"Prelude in Violet","g":7,"l":"The Lochs","s":33}},{"type":"quest","id":"68716","obj":{"i":68716,"n":"A Defector's Tidings","g":7,"l":"The Dravanian Hinterlands","s":35}}]}