{"quest":{"name":"Mochi to Be Desired","location":"Limsa Lominsa","id":68712,"patch":5.1,"sort":169,"icon":100811,"eventIcon":71221,"issuer":1026721,"target":1026721,"genre":194,"journal":["The nezumi bugyo requires assistance in overcoming cultural barriers.<br>※This quest is available for a limited time only.","Upon your inquiry as to the reason behind the nezumi bugyo's troubled demeanor, he confesses that his efforts to glorify the rat this Heavensturn have not gone to plan. It transpires that he endeavored to tempt the seafaring citizens of Limsa Lominsa with rat-made advent cakes, which they found...unappetizing, to say the least. The bugyo believes that this may be due to cultural differences, as rats are seen as harbingers of fortune in his homeland. Though you suspect food made by rats will be a hard sell regardless of what cross-cultural understanding may be established─particularly as the bugyo's word choice in describing it leaves much to be desired─you agree to ask the locals what they find so off-putting about the rodents on his behalf.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You approach Imania, a Lominsan who had previously refused the bugyo's offer of advent cakes. She makes clear that a lifetime of chasing rats <span class=\"emphasis\">away</span> from her foodstuffs has not exactly endeared them to her, nor does she believe them capable of doing much more than spreading pestilence. Though she is convinced that she has the right of the matter, she indicates that you might seek out a second opinion.","Klindrael echoes Imania's opinions on rats, but presents you one potential alternative─the Qiqirn. Though ratlike enough for your purposes, their ability to use tools is accepted fact, so the idea that they might be capable of preparing food may be more believable to the average Eorzean.","You inquire with the Qiqirn Neneroon. He seems more than happy to assist in the nezumi bugyo's efforts, reasoning that if his people must be constantly compared to rats, it would be nice if rats at least had a decent reputation.","Neneroon in tow, you return to speak with the bugyo, who is quite willing to work with the Qiqirn if it will further his purposes─and seems rather impressed with Neneroon, besides. Unfortunately, before you can discuss the finer details, the mochi daikan appears and begins blathering about sentient mochi. Though the idea that advent cake mochi could come alive may be difficult to swallow, it is hardly weirder than anything else going on this Heavensturn, so you take his word for it and set off to quell the glutinous uprising before it can begin.","You and Neneroon assist in hacking the living mochi into small, bite-sized pieces, which are conveniently perfect for serving as Heavensturn advent cakes. It falls to the bugyo, however, to make the final determination as to whether they are fit for consumption according to his...specific, but not quite exacting, standards.","Perhaps rats <span class=\"emphasis\">do</span> bring good fortune, for no sooner does the nezumi bugyo finish sampling your work than does Lyngsath, head of the Culinarians' Guild and owner of the Bismarck, appear to partake of the advent cakes himself. Delighted by their simple yet impeccable flavor, he offers to mention them in his upcoming interview with the <span class=\"emphasis\">Harbor Herald</span>─much to Neneroon's delight. Thus convinced that Qiqirn assistance and good publicity will help Lominsans overcome their rodent-related prejudices in no time, the bugyo declares all to be well. He leaves you with hearty thanks for your assistance, though if past experience is any indication, this year's mochi travails are not yet over..."],"objectives":["Speak with Imania.","Speak with Klindrael.","Speak with Neneroon.","Report to the nezumi bugyo.","Complete the FATE “It's Aliiive” in middle La Noscea.","Speak with the nezumi bugyo in Limsa Lominsa."],"dialogue":[{"name":"MOUSEMISSIONARY","text":"Ah, but you have the air of someone who has spent time abroad! Are you perhaps an adventurer─a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> practiced in acquainting yourself with various cultures?"},{"name":"MOUSEMISSIONARY","text":"I come from the Far East, you see, where we celebrate Heavensturn just as the people of Eorzea do. But rather than a god, like your Twelve, we choose an animal to represent the coming year."},{"name":"MOUSEMISSIONARY","text":"This year belongs to the foremost beast among them─the rat! And celebration of the rat's glory should not─nay, <span class=\"emphasis\">must</span> not be confined to Far Eastern shores. Thus did I don a festive kabuto in the name of sharing our customs with all the world."},{"name":"MOUSEMISSIONARY","text":"I was confident that I could easily surpass my dull-witted compatriots─those who have ventured to these foreign lands representing inferior beasts in years past─in this task. Alas, all has not gone to plan."},{"name":"MOUSEMISSIONARY","text":"As the rat is considered a symbol of plenty and harbinger of fortune in my homeland, I thought to grace the people of Eorzea with the opportunity to pound mochi and make advent cakes alongside these lofty creatures."},{"name":"MOUSEMISSIONARY","text":"Alas, the people of Eorzea seem loath to touch tubs of mochi lousy with rats, nor eat their laboriously prepared cakes! This can likely be attributed to cultural differences, as I mentioned previously."},{"name":"MOUSEMISSIONARY","text":"The trouble with cultural bias is, of course, that people often do not recognize it within themselves, let alone make an effort to overcome it on their own. No─if they are to ever understand the rat's superiority, I must do the work of convincing them."},{"name":"MOUSEMISSIONARY","text":"Unfortunately, I am uncertain as to what manner of local superstition about rats has given rise to their aversion─and without that knowledge, I have no means of assuaging their discomfort."},{"name":"MOUSEMISSIONARY","text":"Might I impose upon you to speak with the townspeople here on my behalf? I am afraid they will not share their honest thoughts with me, for fear of causing offense."},{"name":"MOUSEMISSIONARY","text":"You have my thanks! Perhaps you might begin with that elderly woman over there. She refused my invitation to join the festivities earlier─unsurprising, perhaps, as the elderly are often set in their ways."},{"name":"NENEROON","text":"Heavens turned to Neneroon's turn for Heavensturn!"},{"name":"IMANIA","text":"I've spent the better part of my life trying to keep rats <span class=\"emphasis\">out</span> of the grain stores─I can't imagine why I'd want them touching my food! Filthy creatures."},{"name":"IMANIA","text":"And in any case, the idea of animals cooking is ludicrous. Even if there were, say, a particularly intelligent dog, it would still have no hands..."},{"name":"IMANIA","text":"Anyway, this all seems fairly obvious. Ask anyone─they'll tell you the same!"},{"name":"MOUSEMISSIONARY","text":"We must get to the root of this irrational dislike of rat-plagued delicacies!"},{"name":"KLINDRAEL","text":"Balderdash! Let a rat in your pantry and it'll eat you out of house and home, not cook you dinner. Not that you'd want it to, unless you think pestilence the finest spice."},{"name":"KLINDRAEL","text":"If only a rodent will do for your purposes, however, you might try something <span class=\"emphasis\">like</span> a rat, but rather more...sentient. A beast that's also a man, if you catch my drift."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"...What?"},{"name":"A1","text":"Oh, a Qiqirn!"},{"name":"KLINDRAEL","text":"A <span class=\"emphasis\">beastman</span>, see? The Qiqirn. They look like rats, squeak like rats, chew through your unattended grain sacks like rats...but are not, in fact, rats. They can even use cutlery!"},{"name":"KLINDRAEL","text":"Quite. They look like rats, squeak like rats, chew through your unattended grain sacks like rats...but are not, in fact, rats. They can even use cutlery!"},{"name":"KLINDRAEL","text":"I doubt you'll find anyone here willing to eat food prepared by rats, but Qiqirn are another story. At least with them, you can be reasonably certain that the rice wasn't pounded with tiny plague-ridden feet. And there's one right over there─Neneroon, I think his name was."},{"name":"IMANIA","text":"It's common sense, I tell you!"},{"name":"NENEROON","text":"You have a tale of Heavensturn to tell?"},{"name":"NENEROON","text":"Easterner say rats bring fortunate fortunes? Cultural difference different indeed."},{"name":"NENEROON","text":"Lominsans think rats are dirty because rats eat anything. Even though eating is normal reaction to edible things!"},{"name":"NENEROON","text":"We also eat edible things, so often offended by offensive comparison to rats. Neneroon think Qiqirn in land where rats thought to bring fortune very fortunate."},{"name":"NENEROON","text":"Oh, oh! Striking idea strike me!"},{"name":"NENEROON","text":"Neneroon help you help rat man make rats popular with Lominsan populace. Then Qiqirn gain favor by favorable comparison!"},{"name":"NENEROON","text":"Good, good! Then Neneroon follow you as follower, to help you as helper."},{"name":"KLINDRAEL","text":"This fixation on rodents of yours is very odd─you do understand that, right?"},{"name":"MOUSEMISSIONARY","text":"You have returned─and I see you have a majestic rodent in your company! This must be a sign that my fortunes are improving as we speak."},{"name":"MOUSEMISSIONARY","text":"Ah, so in Eorzean culture, rats are considered unclean? That does explain the reactions..."},{"name":"NENEROON","text":"Yes, rats and ratlike Qiqirn both. Too many hasten to hasty judgments."},{"name":"NENEROON","text":"Neneroon think it better to better reputation of rats and Qiqirn at same time. Propose we work together!"},{"name":"MOUSEMISSIONARY","text":"A marvelous idea─as I would expect from one of such furry features and elongated snout. With our wiles combined, we ought to be able to overcome the people's preconceptions, culturally ingrained or no!"},{"name":"NENEROON","text":"And bring fortunate fortunes to all!"},{"name":"RICECAKEREEVE","text":"Bugyo! We have a problem!"},{"name":"MOUSEMISSIONARY","text":"What, another one? Has something gone wrong with the mochi, now?"},{"name":"RICECAKEREEVE","text":"Unfortunately so. As you know, I have been hard at work preparing the mochi, pounding rice into an amorphous mass. And all was going to plan─or so it seemed, until the mochi began to jiggle on its own! I'm afraid that it's...it's <span class=\"emphasis\">alive</span>."},{"name":"RICECAKEREEVE","text":"Yes, I quite understand your surprise, but we have no time for it."},{"name":"RICECAKEREEVE","text":"I know not whether this issue arose because I used the miraculous yet unpredictable waters of Daitenzan's soulspring in the preparation─it seemed a good idea at the time─or if it is simply down to the peculiar aether in this foreign land, but in any case, we must act!"},{"name":"RICECAKEREEVE","text":"I propose that we take up arms, and cut the mochi into advent cakes before its newfound sentience drives it to get any...ideas."},{"name":"RICECAKEREEVE","text":"What say you, my friend? You have proven yourself to be unflappable in the face of danger, even that of a...peculiar nature."},{"name":"RICECAKEREEVE","text":"What say you, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>? I grant that it is something of a peculiar situation we find ourselves in, but it is dire nonetheless!"},{"name":"NENEROON","text":"Neneroon will cut cuttings from mochi too! Rat man's event too important to have cut short!"},{"name":"MOUSEMISSIONARY","text":"(-Mochi Daikan-)I am gladdened to hear it, good people of Eorzea. Please join us at the Zephyr Drift at your earliest convenience─I myself shall head there posthaste, lest the mochi wander off."},{"name":"RICECAKEREEVE","text":"(-Nezumi Bugyo-)This event has been troublesome indeed─but we shall persevere. We cannot let the year of the rat arrive without proper welcome!"},{"name":"NENEROON","text":"You introduce Neneroon to rat man, yes?"},{"name":"MOUSEMISSIONARY","text":"What better way to demonstrate the astuteness and dexterity of the rat than to ruthlessly cleave living mochi into bite-sized pieces? ...Actually, I can think of several, but we must seize what opportunities the fates provide."},{"name":"MOUSEMISSIONARY","text":"The size, the shape...this is truly magnificent work! You are a rat among men to be sure."},{"name":"NENEROON","text":"Now Lominsans can taste tasty taste of mochi, and see rats bring fortunate fortunes after all!"},{"name":"MOUSEMISSIONARY","text":"No doubt they would... The issue remains, however, how to entice them to taste it to begin with."},{"name":"LYNGSATH","text":"Oho, a Far Eastern bugyo! Here for Heavensturn, are ye?"},{"name":"MOUSEMISSIONARY","text":"Just so, good sir─I am the nezumi bugyo, come bearing the traditional Heavensturn advent cakes. How might I help you?"},{"name":"LYNGSATH","text":"Ah, allow me to introduce meself─Lyngsath, 'ead o' the Culinarians' Guild an' proprietor o' the Bismarck besides."},{"name":"LYNGSATH","text":"I've got a solid sense o' smell─comes with the territory─an' I caught a whiff o' the most enticin' aroma emanatin' from hereabouts. I reckon it's comin' from them advent cakes ye mentioned."},{"name":"NENEROON","text":"Try one, try one! These advent cakes freshly cut by Qiqirn and rats─and adventurer, neither Qiqirn or rat."},{"name":"LYNGSATH","text":"So yer one o' the chefs what made these? Remarkable! Didn't know there were Qiqirn culinarians."},{"name":"NENEROON","text":"Oh, Neneroon no chef! Only helper, helping with cuts."},{"name":"LYNGSATH","text":"Give yerself some credit─takes a lot to prepare a dish, and if ye put in the work to make these, yer qualified to call yerself assistant culinarian at the least."},{"name":"LYNGSATH","text":"Just as good as it smells! Fascinatin' texture, really. Chewy, but not in a bad way."},{"name":"LYNGSATH","text":"The flavor is subtle, an' just a bit sweet─I can tell ye used right fine rice. Pure water, too. There's somethin' else though, such as gives it this perfect consistency... A special technique or summat?"},{"name":"MOUSEMISSIONARY","text":"As you say, we use the finest ingredients from our homeland. The techniques involved are traditional as well─however, I daresay that they are not the special something which you detect."},{"name":"MOUSEMISSIONARY","text":"For that, good sir, is passion!"},{"name":"MOUSEMISSIONARY","text":"The devotion of myriad rats, who made the arduous journey from the Far East to bring fortune to your fair land! The fervent hopes of Neneroon, who labors for the sake of his people! This random adventurer's zeal for violence! All have combined to create these superlative advent cakes."},{"name":"LYNGSATH","text":"Hahaha! Passion, is it? I know somethin' o' that meself."},{"name":"LYNGSATH","text":"Seems we've all got a lot in common, despite comin' from different places. Hmm..."},{"name":"LYNGSATH","text":"It just so 'appens I've got an interview with the 'Arbor 'Erald later on. If it's all right, I'd like to mention yer advent cakes─let people know they can get 'em durin' Heavensturn. Could be a good opportunity for cultural exchange, an' all that."},{"name":"NENEROON","text":"The Harbor Herald!? So many readers would read of our mochi!"},{"name":"MOUSEMISSIONARY","text":"And the public will have little excuse to eschew our advent cakes once a renowned culinarian has vouched for them!"},{"name":"MOUSEMISSIONARY","text":"On behalf of rats everywhere, I thank you for your assistance, sir."},{"name":"MOUSEMISSIONARY","text":"And you as well, adventurer. Your service shall not be forgotten─I will personally ensure that rats watch over you wherever you may go!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You're very welcome! Bring on the rats!"},{"name":"A2","text":"Please don't trouble yourself! I hardly did anything, <span class=\"emphasis\">really</span>..."},{"name":"RICECAKEREEVE","text":"Very well! Now, if you will excuse us, we must go forth and prepare to bring our advent cakes to the masses, who shall soon doubtless be clamoring for a fair plague's worth of rats to descend on their city!"}],"reward":{"gil":420,"items":[{"id":24236,"one":1},{"id":24237,"one":1}]},"reqs":{"jobs":[{"lvl":15,"id":1}]}},"partials":[{"type":"npc","id":"1026721","obj":{"i":1026721,"n":"Nezumi Bugyo","l":28,"q":1}},{"type":"item","id":"24236","obj":{"i":24236,"n":"Crimson Nezumi Kabuto","l":1,"c":40312,"t":34,"p":94}},{"type":"item","id":"24237","obj":{"i":24237,"n":"Cobalt Nezumi Kabuto","l":1,"c":40313,"t":34,"p":94}}]}