{"quest":{"name":"He Ain't Piggy, He's My Brother","location":"Idyllshire","id":68714,"patch":4.5,"sort":5703,"unlocksFunction":1,"eventIcon":71341,"issuer":1026746,"target":1026750,"genre":101,"journal":["Melodie has information on the mysterious visitor to Idyllshire."],"objectives":["Speak with Bulugan."],"dialogue":[{"name":"MELODIE","text":"Greetings, <span class=\"highlight\">Forename</span>. Is there aught you require? ...Hm? You wish to know about the Xaela man whom I saw? Of course."},{"name":"MELODIE","text":"His garb was outlandish, not unlike those worn by Alghu and Teleboge, and he seemed to be searching for something. Or someone."},{"name":"MELODIE","text":"You don't suppose he could be connected to Master Adkiragh in some way?"},{"name":"TELEBOGE","text":"Chief! W-We may have a problem!"},{"name":"MELODIE","text":"(That's him─the visitor!)<br>...W-Welcome to the Hard Place!"},{"name":"BULUGAN","text":"(-Adarkim Man-)Beg pardons. I am searching for a man named Adkiragh. If any of you know him, I ask that you point me in his direction."},{"name":"MELODIE","text":"I...er..."},{"name":"BULUGAN","text":"(-Adarkim Man-)Well, if it isn't the adventurer from Reunion! The fates are kind to bring us together once more. Lest you have forgotten, you fetched me purbol flowers. Only after we went our separate ways did it occur to me that I had failed to introduce myself. That oversight, I shall now rectify."},{"name":"BULUGAN","text":"I am Bulugan of the Adarkim, and the man I seek, Adkiragh, is my older brother, whom you may recall has gone into hiding. I had come upon rumors of his whereabouts, and thus did I set out to find him and bring him home."},{"name":"BULUGAN","text":"These two, I know for minions of Adkiragh, and they likewise vanished from the tribe. I chanced to spot them in Reunion and decided to shadow their steps. They refuse to reveal the truth to me, but I have every reason to believe that I am come to the right place."},{"name":"BULUGAN","text":"Ah, but perhaps it would help if I described my brother."},{"name":"BULUGAN","text":"First, Adkiragh is a proud man and can oft be heard referring to himself as illustrious."},{"name":"BULUGAN","text":"Next, he is extremely fond of buuz and is skilled in its preparation besides."},{"name":"BULUGAN","text":"Last─and not to insult your intelligence─he is obviously a Xaela like me. This point I emphasize only because there cannot be many of our kind who dwell in these parts."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I haven't seen such a person."},{"name":"A1","text":"This piggy here is your brother."},{"name":"A1","text":"..."},{"name":"BULUGAN","text":"Hmmm... The Adkiragh I know would not lower himself by dressing as livestock. And yet the man who claims the selfsame name, the proprietor of this establishment, is said to wear a swine's mask."},{"name":"BULUGAN","text":"You there, take off that mask. I would behold your face."},{"name":"MAPOPO","text":"W-Wait!"},{"name":"MAPOPO","text":"The chief, he's...er, disfigured. Yes, disfigured! Hideously so! That's why he wears the mask! He can't bear having his face seen!"},{"name":"BULUGAN","text":"Is that so...? Well, perhaps I misspoke. I am but a stranger here, and it is not my place to make such demands. Very well, I shall take my inquiries to the other residents of this town."},{"name":"ADKIRAGH","text":"<span class=\"highlight\">Forename</span>, I must ask a favor. Loath though I am to drag you into my tribe's dilemmas, will you keep an eye on Bulugan?"},{"name":"TELEBOGE","text":"<span class=\"emphasis\">My</span> fault? You were there too!"},{"name":"ALGHU","text":"It's your fault Bulugan spotted us!"},{"name":"MAPOPO","text":"Whatever happens, we must protect the chief!"},{"name":"MELODIE","text":"Something seems to be afoot...though I am not quite sure what. Need I be worried?"},{"name":"BULUGAN","text":"You are offering to join me? I would be heartened for your company. I am a stranger, and this is a strange land. Yes, very strange indeed..."},{"name":"BULUGAN","text":"When first I arrived, I thought my eyes were playing tricks. To think that a place exists where man and beastman abide together in peace! I should very much like to meet these creatures you call goblins. Let us begin by speaking with one of them."},{"name":"BULUGAN","text":"Hail to you, friend. I am a wayfarer come far from the east in search of my lost brother. The proprietor of the Hard Place─know you if he is a Xaela like me, and a native of the Azim Steppe?"},{"name":"SYSTEM","text":"Slowfix steals a glance at you. Will you gesture something to him?"},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Shake your head."},{"name":"A2","text":"Motion to yourself."},{"name":"A2","text":"Avert your gaze."},{"name":"SLOWFIX","text":"Pshhh... Shkohhh... Idyllshire is free nation. Birth, race, faith─such things not matter here. One and all are welcome, provided one is willing to sweatwork for good of all."},{"name":"SLOWFIX","text":"And owner of the Hard Place sweatworks muchly. He is highstanding citizen of Idyllshire, has earned highview of gobbieflock. A true gobbiefriend."},{"name":"SLOWFIX","text":"So, Slowfix asks: what business does uplander have with gobbiefriend? Does uplander mean good...or does uplander mean ill?"},{"name":"BULUGAN","text":"W-Well, I wish only to see my brother back to─<br>...Nay, never mind. My thanks for your time."},{"name":"BULUGAN","text":"Next, I will try approaching the treasure hunters. I understand they have a hand in the running of the settlement. It stands to reason that they would know about its residents."},{"name":"SYSTEM","text":"Midnight Dew looks over at you. Will you gesture something to her?"},{"name":"Q3","text":"What will you do?"},{"name":"A3","text":"Shake your head."},{"name":"A3","text":"Give a knowing wink."},{"name":"A3","text":"Nothing."},{"name":"BULUGAN","text":"Beg pardons, but I wish to inquire about an Adarkim man named Adkiragh. I believe he is the proprietor of the Hard Place."},{"name":"MIDNIGHTDEW","text":"Adar...kim? Can't say I know what that is, but I do know Adkiragh. We all do."},{"name":"MIDNIGHTDEW","text":"Peculiar choice of outfit aside, he's always got hot meals ready for us hunters after a hard day's work. An' he'll lend an ear to our ventin' till our throats are hoarse."},{"name":"MIDNIGHTDEW","text":"Reckon I speak for all hunters when I say Idyllshire wouldn't be the same without him an' his place. An' that's the Adkiragh I know. I couldn't speak to this Adar-whatsit, though."},{"name":"BULUGAN","text":"Hmmm..."},{"name":"BULUGAN","text":"I see you are determined to take my brother's side. I am not blind, my friend. Adkiragh always had a way of winning people over. Growing up, I wished I could be more like him."},{"name":"BULUGAN","text":"Beg pardons, but I wish to inquire about an Adarkim man named Adkiragh. I believe he is the proprietor of the Hard Place."},{"name":"MIDNIGHTDEW","text":"Adar...kim? Can't say I know what that is, but I do know Adkiragh. We all do."},{"name":"MIDNIGHTDEW","text":"Peculiar choice of outfit aside, he's always got hot meals ready for us hunters after a hard day's work. An' he'll lend an ear to our gossipin' an' ventin' till our throats are hoarse."},{"name":"MIDNIGHTDEW","text":"Reckon I speak for all hunters when I say Idyllshire wouldn't be the same without him an' his place. An' that's the Adkiragh I know. I couldn't speak to this Adar-whatsit, though."},{"name":"BULUGAN","text":"Hmmm..."},{"name":"BULUGAN","text":"I appreciate your kindness, my friend, but I am not blind. Adkiragh always had a way of winning people over. Growing up, I wished I could be more like him."},{"name":"BULUGAN","text":"But I am not my brother, nor will I ever be. And there are only so many assassination attempts a man can endure in his sibling's stead."},{"name":"BULUGAN","text":"&lt;sigh&gt; Perhaps a child will prove more forthcoming...<br>Excuse me, little one. Do you know Adkiragh, the owner of the Hard Place?"},{"name":"KHLOEALIAPOH","text":"Uncle Adkiragh? Of course Khloe knows him! He always has exciting stories to share with Khloe and her friends!"},{"name":"KHLOEALIAPOH","text":"Lots of people were trying to kill him! Or kidnap him! Or marry him! Sometimes all of these things at once!"},{"name":"KHLOEALIAPOH","text":"Oh, and he has a little brother back at home! Someone named Boo...er, Boogaloo! Yes, that's his name! He's very dependable and Uncle Adkiragh admires him very much!"},{"name":"KHLOEALIAPOH","text":"Khloe's never met Boogaloo, but Khloe likes him already! Khloe must work hard so Zhloe can admire her like Uncle Adkiragh admires Boogaloo!"},{"name":"BULUGAN","text":"..."},{"name":"BULUGAN","text":"Well, if there was ever any doubt, there is none now. The owner of the Hard Place is Adkiragh, my brother. There is much and more I would say to him. <span class=\"highlight\">Forename</span>, may I ask you to be present?"},{"name":"TELEBOGE","text":"&lt;gulp&gt; H-He's back! What do we do!?"},{"name":"ALGHU","text":"Come what may, we stand with the chief!"},{"name":"MAPOPO","text":"I'm not letting anyone take the chief away!"},{"name":"MELODIE","text":"Oh, you are returned! Er...should I serve some refreshments?"},{"name":"BULUGAN","text":"All I have ever wanted was to live my life in peace, away from the burdens of succession. But that was denied to me."},{"name":"BULUGAN","text":"I felt trapped, deprived of choice. And so I chose nothing. Yet that may be the worst choice of all."},{"name":"BULUGAN","text":"Whether I embrace my fate or seek another path to walk, unless I take control of my own life, it will forever be under another's control. This journey has taught me that."},{"name":"BULUGAN","text":"Your secret is safe with me. I will say that it was not my brother that I found here, but another man. Fare you well."},{"name":"ADKIRAGH","text":"Wait."},{"name":"ADKIRAGH","text":"As I have here, one day you will find your own purpose─something that you will want to protect, no matter the cost. But the road is long, with many a winding turn. Whenever you need a rest on your journey, know that you will always be welcome here."},{"name":"MELODIE","text":"My! To think that Master Adkiragh was once a candidate to lead his tribe!"},{"name":"MAPOPO","text":"He's not leaving us! Oh, thank the heavens! &lt;sob&gt;"},{"name":"TELEBOGE","text":"It's over! We can finally rest easy!"},{"name":"ALGHU","text":"Bulugan is a good man. I wish him well."},{"name":"ADKIRAGH","text":"I apologize for the recent uncertainty, but it's safe to say no more of my kinsmen will come after me. The Hard Place need not go without her illustrious proprietor."},{"name":"ADKIRAGH","text":"What? I finally reveal my beautiful face, and all you can do is stare? Come now, a compliment or two is surely in order!"},{"name":"ADKIRAGH","text":"Permit me to thank you again, <span class=\"highlight\">Forename</span>."},{"name":"ADKIRAGH","text":"Lest you worry for my brother, you need not."},{"name":"ADKIRAGH","text":"Bulugan is a born leader. Where I am brazen, he is restrained. Where I am impulsive, he is measured. Often did I wish that I could be more like him."},{"name":"ADKIRAGH","text":"He will make a fine khan. And when the day comes, I will go to pay my respects. You should join me─I would show you my homeland."},{"name":"ADKIRAGH","text":"Of course, my home is here now. And here I shall put down my roots─with an easy heart."},{"name":"ADKIRAGH","text":"But enough talk! We have a business to run!"},{"name":"ADKIRAGH","text":"Thanks to your contributions, we are close to being profitable once more. Now, I believe, is a good time to shift our focus to outfitting the place with new furnishings. Go forth, my friend, and procure for us these things!"}],"reward":{"gil":760,"items":[{"id":19826},{"id":19839}]},"reqs":{"jobs":[{"lvl":66,"id":35}],"quests":[68713]}},"partials":[{"type":"npc","id":"1026746","obj":{"i":1026746,"n":"Melodie","l":2082,"q":1}},{"type":"npc","id":"1026750","obj":{"i":1026750,"n":"Bulugan","l":2082,"q":1}},{"type":"item","id":"19826","obj":{"i":19826,"n":"Tempura Platter","l":279,"c":24323,"t":46,"p":2186}},{"type":"item","id":"19839","obj":{"i":19839,"n":"Nomad Meat Pie","l":279,"c":24354,"t":46,"p":2186}},{"type":"quest","id":"68713","obj":{"i":68713,"n":"Between a Rock and the Hard Place","g":101,"l":"Idyllshire","s":5702,"f":1}}]}