{"quest":{"name":"Wok on By","location":"Kugane","id":68727,"patch":4.5,"sort":999,"icon":100816,"eventIcon":71221,"target":1026029,"genre":21,"usedItems":[22432,19822,19826],"journal":["Of course it was not the end. The company belle simply must have the final word.","The wandering dramaturge cannot bear to drink his rice wine without the proper local refreshments─grilled turbans, tempura, and tako-yaki─and he will only accept those of the absolute <span class=\"emphasis\">highest quality</span>.","The wandering dramaturge is satisfied with your noble effort to deliver him refreshments. He hands you your reward and asks you to leave swiftly and quietly so that he may enjoy his supper."],"objectives":["Deliver three grilled turbans <img class=\"hq-icon small\" src=\"images/item/hq.png\">, three tempura platters <img class=\"hq-icon small\" src=\"images/item/hq.png\">, and three servings of tako-yaki <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to the wandering dramaturge."],"dialogue":[{"name":"BEWITCHINGMEMBER","text":"Now that old Jenomis has finally discontinued his jolly junkets into the untamed wild, he is once more committed to the company. I venture we have <span class=\"emphasis\">you</span> to thank for that."},{"name":"BEWITCHINGMEMBER","text":"And so to show our gratitude, my husband would like to offer you...further opportunity for employment! Isn't that thoughtful of him!?"},{"name":"WANDERINGWRITER","text":"<span class=\"highlight\">Forename</span>! Did I ever tell you how much I adore this city? It's simply so...so...<span class=\"emphasis\">exotic</span>! And the cuisine! Oh, the <span class=\"emphasis\">cuisine</span>! I've never experienced so many flavors in my mouth at once!"},{"name":"WANDERINGWRITER","text":"Why, just the other day, I was given a jug of the most wonderful rice wine by the lad from the Mujikoza who purchased my collection of past works. Can you believe it? Wine, made of rice, of all things! What will they think of next?"},{"name":"WANDERINGWRITER","text":"Ah, but I suppose you're wondering why I had my darling summon you over. Well, it's this wine. While absolutely delightful, none of the nibbles I usually take with my traditional reds and whites pair well with the stuff. And so, once again, I require your help."},{"name":"WANDERINGWRITER","text":"The kind woman who operates the shuttle to the <span class=\"emphasis\">Prima Vista</span> tells me if I am to eat like a true Hingan, then I should start with grilled turban, tempura, and some ridiculous thing called “tako-yaki.” I believe three of each should suffice. And as always, only the best of the best."},{"name":"BEWITCHINGMEMBER","text":"When it comes to local cuisine, my husband can be such a snob. Half the time I'm convinced he cannot tell the difference between chicken and chocobo, but still he insists on partaking of only the <span class=\"emphasis\">highest-quality</span> fare."},{"name":"WANDERINGWRITER","text":"Three servings of grilled turban, tempura, and tako-yaki...and nothing like that you'd find at a corner stall. I expect only the finest."},{"name":"WANDERINGWRITER","text":"I never doubted you, <span class=\"highlight\">Forename</span>! My darling, she may have doubted you, but me? Never! You have quite a knack for this line of work."},{"name":"WANDERINGWRITER","text":"Now, let the festivities begin! Here is your reward. Please see yourself out."}],"reward":{"gil":103,"items":[{"num":5,"id":18031},{"num":10,"id":16783}]},"reqs":{"questsType":"all","quests":[68726,68629]}},"partials":[{"type":"npc","id":"1026029","obj":{"i":1026029,"n":"Wandering Dramaturge","l":2370,"q":4}},{"type":"item","id":"18031","obj":{"i":18031,"n":"Cracked Crystal","l":1,"c":20019,"t":61}},{"type":"item","id":"16783","obj":{"i":16783,"n":"Mhachi Demimatter","l":1,"c":20404,"t":61}},{"type":"item","id":"22432","obj":{"i":22432,"n":"Tako-yaki","l":340,"c":24325,"t":46}},{"type":"item","id":"19822","obj":{"i":19822,"n":"Grilled Turban","l":270,"c":29112,"t":46,"p":2138}},{"type":"item","id":"19826","obj":{"i":19826,"n":"Tempura Platter","l":279,"c":24323,"t":46,"p":2186}},{"type":"quest","id":"68726","obj":{"i":68726,"n":"In Bad Taste","g":21,"l":"Kugane","s":850}},{"type":"quest","id":"68629","obj":{"i":68629,"n":"Makin' Bacon (Bread)","g":21,"l":"Kugane","s":900}}]}