{"quest":{"name":"Welcome to Their Jungle","location":"Kugane","id":68724,"patch":4.5,"sort":80,"icon":100814,"unlocksFunction":1,"eventIcon":71341,"issuer":1026970,"target":1026978,"genre":21,"journal":["Montblanc is eager to return to the <span class=\"emphasis\">Prima Vista</span> and report on your findings.","How Montblanc made it back to the tiring room before you did is a mystery best left unsolved.","Despite little chance for success, you contact several of your closest companions and present them with Fran's demands. To your surprise, Hancock replies almost immediately and summons you to the Ruby Bazaar to discuss business.","While Lina seems enthusiastic enough, you, on the other hand, are not as optimistic as the reporter as to how this will all play out.","Bwagi insists that he accompany you to the Ruby Bazaar. It is almost as if he knows something you do not.","For reasons each their own, the East Aldenard Trading Company, the Eorzean Alliance, and Lord Hien all refuse to meet the demands of the Dalmascan resistance. According to Bwagi, however, this is exactly what Fran expected, and the Bangaa says as much before trotting off back to his airship.","Disappointed that your efforts have been for naught, you regroup with your companions to decide a new plan of action. It is at this time the Lady Fran appears, explaining that the leader of Lente's Tears has commanded her to guide you to the Orbonne Monastery. However, before you can depart, Alma is possessed by the Otius and drawn into a dark portal of unknown origin. To save her, you must finally journey to the Golmore Jungle.","Mikoto's device allows Ramza to free his sister from Ultima's portal, but cannot stop Ramza from being swallowed by the magicked rift. Jenomis will not be pleased with the day's results.","Jenomis is in shock at the loss of his only son. There must be some means of saving the boy, but for now, you must wait."],"objectives":["Speak with Ramza in the tiring room.","Speak with Lina Mewrilah.","Speak with Bwagi down at Kugane Landing.","Speak with Lina Mewrilah near the Ruby Bazaar.","Return to the <span class=\"emphasis\">Prima Vista</span>.","Speak with Ramza.","Speak with Jenomis."],"dialogue":[{"name":"BWAGI","text":"Do not be put off by Lady Fran. The general has quite the edge to her, but it is only because she wants what is best for the resistance. "},{"name":"GIJUK","text":"I've finally come to accept Ba'Gamnan is gone for good, but I will never forget how he met his end. I cannot allow my hatred to consume me as it did him."},{"name":"RINOK","text":"Fran is not too bad, once you're on her good side─her only good side being her backside...but you didn't hear that from me."},{"name":"MONTBLANC","text":"Hurry, hurry! If I don't tell someone of our adventure quick, I'll positively burst, kupo!"},{"name":"RAMZALEXENTALE","text":"This woman asks much of us..."},{"name":"JENOMISLEXENTALE","text":"The Viera have ever been wary of outsiders. For centuries their many tribes have remained hidden in the jungles, content with their self-imposed solitude."},{"name":"JENOMISLEXENTALE","text":"Each tribe has its own strict code and will mete swift punishment to any who would defy these laws. As such, many a Viera will spend her entire life bound to the territory of her ancestors, both unwilling and unable to venture beyond its borders."},{"name":"JENOMISLEXENTALE","text":"And while the tribes are wholly independent, they have agreed to uphold a single standard: shun all contact with the outside world unless it is to protect the jungle."},{"name":"JENOMISLEXENTALE","text":"That said, with every generation there are those Viera who long for a life beyond the verdant sea of trees and abandon their tribes to start a new life in the kingdom's cities. My guess is that this Fran is one such individual."},{"name":"MONTBLANC","text":"Who also happens to be the <span class=\"emphasis\">only</span> individual we know who can guide us to the monastery, kupo!"},{"name":"LINAMEWRILAH","text":"It seems <span class=\"highlight\">Forename</span>'s sword arm won't be enough to see us through this predicament. <span class=\"alternative-container\"><span class=\"alternative\">She'll</span><span class=\"alternative\">He'll</span></span> need to don the right mantle of a diplomat if we're to convince the alliances and the East Aldenard Trading Company to grant us aid. What could go wrong!?"},{"name":"HANCOCK","text":"(-Hancock-)Yes, yes, I know you said not to call unless it was urgent, but this is urgent. All right, not exactly, but my superiors have come to a decision on your request, and I thought you might want to hear what they had to say."},{"name":"HANCOCK","text":"(-Hancock-)Oh, and let me preempt any request for immediate disclosure with a reminder that the information is <span class=\"emphasis\">much</span> too sensitive to discuss over linkpearl. Meet me at the Ruby Bazaar posthaste and I shall duly apprise you of their judgment."},{"name":"LINAMEWRILAH","text":"Well then, <span class=\"highlight\">Forename</span>. What are we waiting for?"},{"name":"LINAMEWRILAH","text":"I've read about how you united the whole of Eorzea under a single standard and convinced the Holy See to end a thousand-year conflict. Compared to that, asking for a few soldiers and a coffer or three of gil should be a piece of rolanberry cake!"},{"name":"LINAMEWRILAH","text":"Ah, I suppose we should inform Bwagi down at Kugane Landing of our progress. You mentioned he was to keep an eye on us."},{"name":"LINAMEWRILAH","text":"I've informed Bwagi of our situation. We are ready to make for the Ruby Bazaar when you are."},{"name":"BWAGI","text":"So you've an answer from East Aldenard already. Impressive. It would seem the Lady Fran has underestimated your influence amongst the realm's players. I assume you have no objections to me joining you then."},{"name":"GIJUK","text":"Rinok and I will stay here with the airship. Our last foray into the city was met with one too many cold stares for my liking."},{"name":"RINOK","text":"Vessels such as ours require extensive maintenance to remain skyworthy. You and Bwagi take as long as you need."},{"name":"BWAGI","text":"Whenever you are ready, <span class=\"highlight\">Forename</span>."},{"name":"LINAMEWRILAH","text":"Hancock awaits us in the Bazaar. Shall we, <span class=\"highlight\">Forename</span>?"},{"name":"Q3","text":"Enter the Ruby Bazaar?"},{"name":"HANCOCK","text":"A lovely lady and a...Bangaa? And here I was expecting you would be alone, <span class=\"highlight\">Forename</span>!"},{"name":"HANCOCK","text":"Ah, but excuse my manners. I am Hancock, representative of the East Aldenard Trading Company assigned to oversee her assets here in Kugane. It is a pleasure to meet you."},{"name":"YUGIRI","text":"And I am Yugiri. We apologize for making you come all this way."},{"name":"TATARU","text":"Not that it is far from the landing to─ Ahem."},{"name":"YUGIRI","text":"Bwagi, was it? I serve Lord Hien, rightful ruler of Doma. I have come bearing our nation's reply to your entreaty."},{"name":"YUGIRI","text":"Bwagi, was it? I serve Lord Hien, rightful ruler of Doma. I have come bearing my lord's reply to your entreaty."},{"name":"TATARU","text":"And I am Tataru Taru of the Scions of the Seventh Dawn. I'm only here seeing as no one else could be bothered. Well, that and to bear a message from the leaders of the Eorzean Alliance."},{"name":"BWAGI","text":"Thank you both for coming. I am Bwagi, formerly of the Dalmascan Royal Fusiliers. I now claim allegiance to Lente's Tears─a resistance group seeking to accomplish what you have in Doma and Ala Mhigo."},{"name":"BWAGI","text":"What tidings have you brought us?"},{"name":"HANCOCK","text":"Allow me to begin then. While the East Aldenard Trading Company sympathizes with your plight, we are not in a position to grant you the funding you seek."},{"name":"HANCOCK","text":"As you are aware, the East Aldenard Trading Company prides itself in its neutrality, be it in matters political or personal."},{"name":"HANCOCK","text":"And what of our relationship with the Eorzean Alliance? Ah...yes. What I meant to say was, <span class=\"emphasis\">here in Hingashi</span>, the East Aldenard Trading Company prides itself in its neutrality, be it in matters political and...er..."},{"name":"HANCOCK","text":"You must understand our position. Simply supplying coin to any one group would make it appear that we somehow favor that group over another. Seeing as we conduct business openly and fairly with <span class=\"emphasis\">everyone</span>, doing such would be sending the wrong message, and ultimately harm profits. Yes."},{"name":"LINAMEWRILAH","text":"And by selling to both sides, you maximize profits while good men and women perish. How convenient!"},{"name":"HANCOCK","text":"We are a <span class=\"emphasis\">business</span>, milady. We do what we must to survive. That does not mean, however, we are blind to the needs of our customers or our allies, which is why we support the Eorzean Alliance and their noble efforts to safeguard their realm's freedom through a <span class=\"emphasis\">mutually beneficial</span> arrangement."},{"name":"HANCOCK","text":"If it were my choice, I would provide your little resistance with all the funding it needs, but as my good friend, <span class=\"highlight\">Forename</span>, knows all too well, it is not <span class=\"emphasis\">my</span> choice."},{"name":"TATARU","text":"Well, now that Hancock's thoroughly lowered your spirits, you won't be as crestfallen when I inform you the Eorzean Alliance will also be unable to provide any assistance."},{"name":"BWAGI","text":"And let me guess, you did everything in your power to try and convince the leaders of each city-state, only to watch as they politely declined our proposal, claiming an unfortunate lack of intelligence or resources."},{"name":"TATARU","text":"Wait, how did you─!?"},{"name":"YUGIRI","text":"Lord Hien sends his greetings to you and yours. Having recently found strength through a newly formed alliance with our neighboring nations, Doma is open to further welcoming like-minded organizations. This includes our Dalmascan brothers and sisters still suffering under the imperial yoke."},{"name":"YUGIRI","text":"Lord Hien sends his greetings to you and yours, and under normal circumstances would welcome allies still suffering under the imperial yoke."},{"name":"YUGIRI","text":"However, word has it that the latest attempt at reclaiming your kingdom ended in failure, resulting in the loss of countless lives, including many of the resistance's leaders."},{"name":"BWAGI","text":"You are not mistaken. Our army is not what it once was. Those remaining have been forced to take refuge deep beneath the streets of Rabanastre."},{"name":"YUGIRI","text":"The IVth Legion has already defeated you once. Lacking unity and leadership, the current resistance will not survive another tilt against the Empire's disciplined ranks."},{"name":"YUGIRI","text":"If Doma is to join hands with Dalmasca as an ally, you must first prove to us that you will stand as one."},{"name":"BWAGI","text":"Doma as a full-fledged ally <span class=\"emphasis\">would</span> serve far better to strengthening our cause than a few temporary soldiers."},{"name":"BWAGI","text":"Doma as a full-fledged ally <span class=\"emphasis\">would</span> serve far better to strengthening our cause than a few temporary soldiers."},{"name":"YUGIRI","text":"Yet even if we were able to wrest Dalmasca from the Empire's grasp, without unity amongst your people, the resulting chaos could prove even more perilous to the kingdom."},{"name":"BWAGI","text":"You understand much of our situation."},{"name":"BWAGI","text":"And based on that understanding, you would refuse your aid to Lente's Tears, am I correct?"},{"name":"YUGIRI","text":"Do not mistake me. Lord Hien's refusal is but a message─a message to help you plan your next step."},{"name":"BWAGI","text":"You have a wise master. He understands that without proper planning, driving one enemy from your midst simply creates room for the next."},{"name":"BWAGI","text":"Lady Fran will no doubt be pleased to hear that your response was <span class=\"emphasis\">exactly</span> what she expected."},{"name":"LINAMEWRILAH","text":"You knew this whole time that your demands would be rejected, yet still you let this farce play out?"},{"name":"BWAGI","text":"You have my apologies, but this was all necessary to prove an important point to our leader."},{"name":"BWAGI","text":"Lady Fran needed to show the princess just exactly what she was getting herself into, and your honesty today will serve us better than any hollow promise. Thank you."},{"name":"LINAMEWRILAH","text":"Wait! What about the Golmore Jungle!?"},{"name":"LINAMEWRILAH","text":"Can you believe this? We're right back to where we started! Principal Jenomis will not be pleased."},{"name":"JENOMISLEXENTALE","text":"If it is as you say, it is most unfortunate. But, I suppose we did everything in our power, and that is all one could ask."},{"name":"RAMZALEXENTALE","text":"I still do not understand. Why would Lady Fran send <span class=\"highlight\">Forename</span> on this wild paissa chase if she knew from the start it would be for naught? "},{"name":"LINAMEWRILAH","text":"Bwagi mentioned something about Fran proving a point to their leader...whomever that may be."},{"name":"JENOMISLEXENTALE","text":"People in positions of power can prove both naive and stubborn creatures. Simply telling a leader she is wrong may not convince her of the fact. Seeing one's own plan fail, however, is oft the best medicine."},{"name":"LINAMEWRILAH","text":"Naive <span class=\"emphasis\">and</span> stubborn? Then the resistance is doomed!"},{"name":"MONTBLANC","text":"If a person as imposing as Fran is taking orders from her, then chances are this “leader” is even worse, kupo!"},{"name":"JENOMISLEXENTALE","text":"I would not be so certain, Montblanc."},{"name":"JENOMISLEXENTALE","text":"My guess is that the individual in question is still quite young and inexperienced, and that Lady Fran is trying to teach her to be an effective leader through example."},{"name":"JENOMISLEXENTALE","text":"By allowing her to make her own mistakes, Fran is granting her the ability to learn and grow from them─an experience that will ultimately benefit her when the time comes to make some truly difficult decisions."},{"name":"JENOMISLEXENTALE","text":"Now, I seem to recall reading that one of the many faces of the resistance before the recent quelling was a young girl of royal blood. Do you suppose─"},{"name":"FRAN","text":"(-???-)You may cease with your baseless presumptions, defector."},{"name":"BWAGI","text":"The door was open."},{"name":"RAMZALEXENTALE","text":"And you would be?"},{"name":"FRAN","text":"<span class=\"emphasis\">I</span> would be here on orders from the leader of Lente's Tears. Against my better judgment, mind you."},{"name":"JENOMISLEXENTALE","text":"Greetings. Lady Fran, I presume? I am Jenomis cen Lexentale, principal of the Majestic Theater Company. You and your colleagues are most welcome on the <span class=\"emphasis\">Prima Vista</span>."},{"name":"JENOMISLEXENTALE","text":"What is it your leader would have of us?"},{"name":"FRAN","text":"While you failed in meeting even a single of our demands, she recognizes that you were sincere in your attempts to see them fulfilled, and for that effort, you are to be...compensated."},{"name":"JENOMISLEXENTALE","text":"That is most generous."},{"name":"FRAN","text":"The ruins which you seek are hidden behind a waterfall here─a point roughly equidistant from the river's source and its delta."},{"name":"RAMZALEXENTALE","text":"You have our thanks, Lady Fran. We will not forget this kindness.<br>Father, I shall plot a course immediately."},{"name":"ALMALEXENTALE","text":"Ramza... What is going on here?"},{"name":"RAMZALEXENTALE","text":"Alma! You should be in bed!"},{"name":"ALMALEXENTALE","text":"I've slept enough, Brother. Tell me, who are our guests?"},{"name":"BWAGI","text":"It appears you once again prepare a leap into danger's maw. Keep your wits about you, <span class=\"highlight\">Forename</span>. Lady Fran is strong...but then again, so was Ba'Gamnan."},{"name":"BWAGI","text":"Ah...if you'll excuse me─"},{"name":"RAMZALEXENTALE","text":"Are you mad!? A trip to the surface in your condition!?"},{"name":"ALMALEXENTALE","text":"Listen to me, Brother. The High Seraph beckons. She speaks to me through the Otius."},{"name":"RAMZALEXENTALE","text":"The what!?"},{"name":"ALMALEXENTALE","text":"There is no need to worry. Mikoto and I have already devised a plan. I can help clear our family name!"},{"name":"JENOMISLEXENTALE","text":"The Sharlayan has no say in this. I am your father and I insist you remain here on the airship! What would your mother say if I allowed aught to befall you!?"},{"name":"ALMALEXENTALE","text":"Mother? That is what this is all about, isn't it!? What it has always been about! You care not about Ivalice or the Orran name. No, you only seek to use the auracite to bring Mother back!"},{"name":"ALMALEXENTALE","text":"But you haven't been able to do that. You still do not understand how exactly it is that the shards translate one's desires into reality. That is where I can help. I can ask the High Seraph. It is she who created the auracite."},{"name":"ALMALEXENTALE","text":"Ultima has bid me come to her place of imprisonment. If we free her, she will reveal unto us the secrets of her creations!"},{"name":"RAMZALEXENTALE","text":"Do you hear what you are saying, Alma! Even if there was the slightest chance of bringing Mother back, we cannot risk your life in doing so!"},{"name":"JENOMISLEXENTALE","text":"Your brother is right! We have sacrificed too much already! I cannot bear the thought of losing you! Either of you!"},{"name":"ALMALEXENTALE","text":"It is too late!"},{"name":"ALMALEXENTALE","text":"(-Ominous Voice-)I'm so lonely, Father. Why must you love Ramza more than you do me?"},{"name":"MIKOTO","text":"Do not be cozened by your daughter's words, for they are not her own."},{"name":"ALMALEXENTALE","text":"Help...me...Ramz─"},{"name":"RAMZALEXENTALE","text":"Alma!!!"},{"name":"RAMZALEXENTALE","text":"No! No!"},{"name":"FRAN","text":"Gods forfend..."},{"name":"BWAGI","text":"I told you. No one can control the power within those shards. No one!"},{"name":"MIKOTO","text":"<span class=\"highlight\">Forename</span>! Here, take this. It might be the only thing that can save Alma, but we must hurry to the monastery!"},{"name":"RAMZALEXENTALE","text":"Come. We leave for the Golmore Jungle...now."},{"name":"FRAN","text":"Was the power I sensed beyond the rift─ Was <span class=\"emphasis\">that</span> the High Seraph?"},{"name":"MONTBLANC","text":"What do we do!? What do we do!? We cannot just leave poor Alma to become one of those...one of those...<span class=\"emphasis\">monsters</span>, kupo!"},{"name":"HURDY","text":"I think we saw enough to prove that Ultima is no angel, kupo. But if she's not...then what <span class=\"emphasis\">is</span> she!?"},{"name":"JENOMISLEXENTALE","text":"I've been such a fool...and now I've lost my daughter. Will you ever forgive me, Tia?"},{"name":"LINAMEWRILAH","text":"I cannot believe what I just witnessed... I won't believe it. I won't. There. It didn't happen."},{"name":"MIKOTO","text":"I have good news and bad news, <span class=\"highlight\">Forename</span>. The bad news is that it appears the High Seraph was able to employ the Otius as a catalyst to propel her magicks beyond whatever seal she is trapped behind. The good news is, this means my device should function as intended."},{"name":"MIKOTO","text":"Its design is based off of one of Moenbryda's. It repurposes the logic behind her aetheric siphon into a means of disrupting aetherflow by reversing common wavelengths and─"},{"name":"MIKOTO","text":"And let us just say it has already been calibrated to match the energy emitted by the Otius. As long as Ultima continues to wield the Otius, we should be able to interfere."},{"name":"MIKOTO","text":"But it only works if we can find Alma. Which is why we must make haste."},{"name":"GIJUK","text":"What happened here? Is everything alright?"},{"name":"RINOK","text":"Don't tell me... I can see it in your eyes. The auracite claimed another victim. You were fools to think you'd fare any better than Ba'Gamnan. Fools, all of you."},{"name":"BWAGI","text":"I told her. I told her this was a mistake, and now look what has happened. If you were wise, you'd toss all the remaining shards into Hells' Lid and cut your losses. But you've no more wisdom than Ba'Gamnan. And that's why the High Seraph has already won."},{"name":"RAMZALEXENTALE","text":"Have I your permission to depart, <span class=\"highlight\">Forename</span>!? Every moment we tarry here, my sister, she─!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Of course, Ramza."},{"name":"A1","text":"Now is not the best of times."},{"name":"RAMZALEXENTALE","text":"Then hold on. I've set engines to full speed!"},{"name":"RAMZALEXENTALE","text":"No, it is the worst of times! I beg of you. Do not ask me to wait any longer. For Alma's sake."},{"name":"FRAN","text":"Welcome to the land of my people. 'Twould be a poor lie if I said I did not miss it some."},{"name":"RAMZALEXENTALE","text":"Alma!"},{"name":"ALMALEXENTALE","text":"Ramza... Help...me..."},{"name":"RAMZALEXENTALE","text":"Alma!!!"},{"name":"RAMZALEXENTALE","text":"Begone!"},{"name":"LINAMEWRILAH","text":"Alma! Ramza!"},{"name":"ALMALEXENTALE","text":"(-Ominous Voice-)Blood...of the invokers... Fulfill...the ancient covenant...and grant unto me...the vessel...promised."},{"name":"LINAMEWRILAH","text":"What just─!?"},{"name":"FRAN","text":"Bwagi, to me! The girl is not well!"},{"name":"MONTBLANC","text":"Uh, might I suggest we continue this back at the <span class=\"emphasis\">Prima Vista</span>, kupo!?"},{"name":"RAMZABEOULVE","text":"(-Unknown Voice-)Have you the courage to face true evil?"},{"name":"MONTBLANC","text":"What are you gawping at!? The ship is <span class=\"emphasis\">this</span> way, kupo!"},{"name":"GIJUK","text":"If you need help finding Ramza, do not hesitate to ask. We are here to help. It is what Ba'Gamnan would have wanted."},{"name":"RINOK","text":"Is the boy's father well? I cannot imagine what he is going through. Losing his daughter, only to lose his son moments after her return..."},{"name":"JENOMISLEXENTALE","text":"Now Ramza is gone? Oh, dearest Tia, what have I done? What have I done!?"}],"reward":{"gil":1408},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68723]},"next":[68725]},"partials":[{"type":"npc","id":"1026970","obj":{"i":1026970,"n":"Montblanc","l":2404,"q":2}},{"type":"npc","id":"1026978","obj":{"i":1026978,"n":"Jenomis Cen Lexentale","l":2370,"q":2}},{"type":"quest","id":"68723","obj":{"i":68723,"n":"The Path of Most Resistance","g":21,"l":"Kugane","s":70,"f":1}},{"type":"quest","id":"68725","obj":{"i":68725,"n":"The City of Lost Angels","g":21,"l":"Kugane","s":90,"f":1}}]}