{"quest":{"name":"A Brief Reprieve","location":"The Rising Stones","id":68720,"patch":4.56,"sort":39,"icon":100841,"eventIcon":71201,"issuer":1026846,"target":1026797,"genre":7,"journal":["Hoary Boulder's sullen expression suggests he has no news to share, which in this case may not mean good news.","Sadly there has been no change in the Scions' condition. Before Hoary can expound further, however, Maxima arrives asking after Alphinaud. Consoled by the fact that he is safe and well cared for, Maxima prepares to take his leave, inviting you to meet with a man he claims to be an acquaintance of yours. ","After a short trek to north Silvertear, you find Maxima in the company of your good friend Cid. Your reunion is cut brief when an Alliance soldier arrives bearing a message for the Warrior of Light. Raubahn requests your presence in Ala Mhigo to discuss strategy. To that end, Cid offers you transportation aboard the <span class=\"emphasis\">Excelsior</span>.","You arrive at Ala Mhigo in a timely fashion, where Cid offers a few words of encouragement before sending you off to your meeting with Raubahn. "],"objectives":["Speak with Maxima in north Silvertear.","Speak with Cid."],"dialogue":[{"name":"HOARYBOULDER","text":"Ah, <span class=\"highlight\">Forename</span>. Yours is a welcome face indeed in these troubled times. Though if you've come to inquire about our stricken brothers and sisters, I am afraid I have naught to report."},{"name":"HOARYBOULDER","text":"Coultenet and the others continue their tireless search for answers, and I too have done all in my power to assist them. Alas..."},{"name":"MAXIMA","text":"(-???-)My apologies for the intrusion. I was told Master Alphinaud had been brought here, and wished to see if his condition had improved."},{"name":"MAXIMA","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. I have heard about the part you played in driving back the Empire's forces...<br>...Thank you. That you were able to stop them, if only for a short while, gives me hope."},{"name":"MAXIMA","text":"I realize how strange such words must sound coming from a Garlean's lips, but I speak them out of the love I bear for my homeland─because I wish to see an end to the bloodshed."},{"name":"MAXIMA","text":"That is why I chose to share all that I know with the Alliance. Though I will surely be branded a traitor, I am content to bear that ignominy. 'Twill seem a small price to pay if it helps to prevent this conflict from escalating any further."},{"name":"MAXIMA","text":"But enough of my prattling. The war is not what brought me all this way. I came to see Master Alphinaud."},{"name":"HOARYBOULDER","text":"An acquaintance of <span class=\"highlight\">Forename</span> and Alphinaud, are you? Well, far be it from me to turn away good company. If you will follow me, sir..."},{"name":"MAXIMA","text":"When word reached me that Alphinaud had returned, it seemed only right that I visit him. Poor lad... It pains me to see him thus. But I take solace in the knowledge that he is safe and well cared for."},{"name":"MAXIMA","text":"He fought valiantly at the Burn. The Populares could not have wished for a more committed ally."},{"name":"MAXIMA","text":"I know not how he came to be so afflicted, but I pray a cure will be found soon."},{"name":"MAXIMA","text":"On an unrelated note, you may be interested to know that I traveled here in the company of another acquaintance of yours."},{"name":"MAXIMA","text":"He awaits my return at north Silvertear, and I am certain he would be glad to see you. Assuming you can spare the time, that is."},{"name":"HOARYBOULDER","text":"Who do you suppose is waiting for him at north Silvertear?"},{"name":"MAXIMA","text":"Ah, there you are. I was beginning to think you would not come."},{"name":"CID","text":"It sounds like you've been through the mill. You should have called me."},{"name":"CID","text":"Though I must confess, tracking down missing souls isn't exactly within my field of expertise."},{"name":"MAXIMA","text":"As you may have surmised, I heard much of Master Garlond growing up in Garlemald. Indeed, he has long been a source of inspiration to me."},{"name":"MAXIMA","text":"Most Garleans would say he is a traitor, that he turned his back on his country. We of the Populares, however, consider him a revolutionary─a man willing to defy the Empire's dreams of subjugation, that his inventions might bring about a better future for all mankind."},{"name":"CID","text":"<span class=\"emphasis\">Please</span>─“revolutionary” is a term best reserved for my work. I am but an imperial defector who thought to aid another imperial defector."},{"name":"CID","text":"Whatever Master Garlond says, I am humbled to find myself in such distinguished company."},{"name":"CID","text":"Speaking of distinguished company, we heard from Raubahn that you ran into an old friend in the Burn. Is it true? Gaius still lives?"},{"name":"MAXIMA","text":"Like most in the army, I never had the privilege of seeing the legatus without his mask. To think I walked halfway across the Burn in the presence of the Black Wolf..."},{"name":"CID","text":"And he claimed to have severed ties with the Empire to hunt Ascians, did he?"},{"name":"CID","text":"Hmph. After his humbling at the Praetorium, one would think he'd have the good sense to stay dead."},{"name":"CID","text":"Should we meet again, I shall be sure to tell him so."},{"name":"MAXIMA","text":"Commander Aldynn also spoke of the Alliance's meeting with the Emperor...though I still labor to believe what he told us. Did His Radiance <span class=\"emphasis\">really</span> claim that Garlemald was founded by the Ascians?"},{"name":"MAXIMA","text":"But that is <span class=\"emphasis\">madness</span>. The very notion is absurd! Every fiber of my being rails against it... And yet I see there is no escaping the truth. From the very founding of my homeland, my brothers and sisters have laid down their lives in service to a lie."},{"name":"MAXIMA","text":"The Ascians must be stopped. To save my people, to save all peoples."},{"name":"CID","text":"For all the Empire's many crimes, even I did not suspect. Had I known, I would have left a lot sooner."},{"name":"CID","text":"But that is in the past. Here in the present, we must apply ourselves to the problem of how the Empire's ambitions may be thwarted, not only in Eorzea, but in the Far East as well."},{"name":"CID","text":"The Ironworks will spare no effort to achieve that end. Seiryu's Wall was a good start, but we can do more─and we will. We'll show them what it means to achieve “Freedom through Technology”!"},{"name":"ALLIANCERECRUIT03184","text":"Begging your pardons! I bear a message for the Warrior of Light!"},{"name":"ALLIANCERECRUIT03184","text":"Commander Aldynn requests your presence at Alliance Headquarters in Ala Mhigo. He would discuss matters of strategy at your earliest convenience."},{"name":"CID","text":"Ah yes. The inevitable messenger. I knew it wouldn't be long before duty called you away."},{"name":"CID","text":"Time no doubt being of the essence, could I tempt you to a ride aboard the <span class=\"emphasis\">Excelsior</span>? If there's a faster way to Raubahn's side, I will personally apologize to the commander for keeping him waiting."},{"name":"MAXIMA","text":"I too will make for the border anon. If there is aught I can do to help, I consider it my duty to see it done."},{"name":"RESISTANCEGATEKEEPER","text":"Commander Aldynn awaits your arrival. I am to escort you to Alliance Headquarters as soon as you are ready."},{"name":"CID","text":"I swear, every time you board my airship, you seem to be barreling headlong into danger. And every time, you somehow contrive to emerge victorious. Which, of course, is an admirable skill."},{"name":"CID","text":"But no one is invincible, <span class=\"highlight\">Forename</span>. Not even you. So please, take care of yourself out there."},{"name":"MAXIMA","text":"I pray you remain safe on the front lines. Though ill-equipped to join the fray, I shall do all I can to assist from headquarters."},{"name":"CID","text":"My colleagues and I have been tasked with evacuating casualties by air. See that you aren't among them, eh?"}],"reward":{"gil":3679},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68719]},"next":[68721]},"partials":[{"type":"npc","id":"1026846","obj":{"i":1026846,"n":"Hoary Boulder","l":481,"q":2}},{"type":"npc","id":"1026797","obj":{"i":1026797,"n":"Cid","l":2408,"q":1}},{"type":"quest","id":"68719","obj":{"i":68719,"n":"The Face of War","g":7,"l":"Alliance Headquarters","s":38}},{"type":"quest","id":"68721","obj":{"i":68721,"n":"A Requiem for Heroes","g":7,"l":"The Lochs","s":40}}]}