{"quest":{"name":"Blue Leading the Blue","location":"Lower La Noscea","id":68729,"patch":4.5,"sort":10,"icon":100830,"unlocksFunction":1,"eventIcon":71341,"issuer":1026932,"target":1026937,"genre":166,"journal":["Martyn's freedom hangs in the balance and only you can prove his innocence.","In order to clear his name of charges of fraud, Martyn has persuaded you to learn the blue magic spell Water Cannon in order to demonstrate to the doubtful Yellowjacket that the soul crystals he has been peddling are indeed genuine. Rather than using a training dummy or similarly inanimate object, Martyn suggests testing your newly acquired ability on his assistant, Latool Ja, in order to prove the efficacy of the spell.","After drenching Latool Ja with a painful-looking Water Cannon, he returns the favor by showering you with heartfelt praise. The methods for acquiring blue magic worked exactly as Martyn had described, and the Yellowjacket has no choice but to accept the veracity of his claims. However, she says that selling the soul crystals without explaining the risks is highly irresponsible, and that if Martyn persists in his money-making scheme, he will find himself occupying a Lominsan gaol cell. She then departs, leaving him behind to rue the loss of his only source of income. Yet the surprise arrival of a woman named Royse gives him little time to wallow in self-pity, as she reveals a plan that might ease his financial woes. As the owner of the Celestium arena in Ul'dah, she is hoping to add his unique brand of spellcasting to the entertainment she has on offer, and she promises ample payment for his services. She makes you a similar offer, but Martyn points out that you are still much too green to be considered a blue mage and that attempting to face the pit's beasts now would lead you to a sticky end. Taking umbrage at his remarks, you accept Royse's proposal, although she encourages you to undergo training with Martyn's supervision before performing. Satisfied that an agreement has been reached, Royse arranges to meet you both in Ul'dah to discuss the particulars of your employment.","Shortly after arriving, you are greeted by the sight of Martyn dressed as his new stage persona, the Great Azuro. In addition to his role as performer in the Masked Carnivale, he is also charged with instructing you in the ways of blue magic, so that you may one day grace the arena. While the majority of its spells are learned through combating various creatures, he explains that his Mamool Ja assistant, Gaheel Ja, possesses a range of totems containing the aether of beasts only found in the New World. Should you prove yourself adept in wielding the Whalaqee's mystic arts, you will be allowed to absorb the aether within them and further expand your repertoire of blue magic. However, Martyn wishes for you to begin with a more specific goal─to learn the spell known as “Blood Drain.”<br><br>※The next blue mage quest will be available from Martyn upon reaching level 10 and learning Blood Drain."],"objectives":["Use Water Cannon on Latool Ja.","Speak with Royse in Ul'dah."],"dialogue":[{"name":"RESOLUTEYELLOWJACKET","text":"Did you actually learn any blue magic?"},{"name":"LATOOLJA","text":"Gaheel Ja and I are very sorry about the kraken. We did not expect such a large one!"},{"name":"MAMOOLJASHOP","text":"You are courageous indeed, smoothskin!"},{"name":"MARTYN","text":"Well, I suppose you'd better show this Yellowjacket that gettin' smacked about by a mad kraken wasn't a waste of time after all! Just take aim at Latool Ja and fire off a Water Cannon."},{"name":"MARTYN","text":"If anyone knows how a proper blast feels, it's him! Gods know he's been on the receiving end enough times."},{"name":"LATOOLJA","text":"This is only way?"},{"name":"MARTYN","text":"Don't worry about him─he'll probably be fine!"},{"name":"LATOOLJA","text":"Please avoid maiming Latool Ja too severely."},{"name":"SYSTEM","text":"Open the Blue Magic Spellbook under Character in the main menu to assign active actions."},{"name":"MAMOOLJASHOP","text":"If Latool Ja cries, they are tears of joy. Not because of immense pain. No, no."},{"name":"RESOLUTEYELLOWJACKET","text":"I'll be honest with you─this all seems completely impossible. Not that I doubt your abilities, but I don't believe a word out of that Martyn's mouth, especially all this rubbish about blue magic."},{"name":"LATOOLJA","text":"Painful yet refreshing! Refreshing yet painful!"},{"name":"MARTYN","text":"See? I was tellin' the truth, wasn't I?"},{"name":"MARTYN","text":"Well then, we'd best be goin'. It's been a pleasure."},{"name":"RESOLUTEYELLOWJACKET","text":"Not so fast, you blue-haired twit! I'll admit, the spell worked as you said it would. But you can't sell those soul crystals without adequately explaining the risks! It's irresponsible! Some might even call it deliberately neglectful."},{"name":"RESOLUTEYELLOWJACKET","text":"You're not under arrest, but from this day forth, you are strictly forbidden from peddling any more of your wares. If I hear you've sold so much as a blue handkerchief, I will hunt you down and throw you behind bars!"},{"name":"RESOLUTEYELLOWJACKET","text":"For your aid in the investigation, you have my thanks. Fare you well!"},{"name":"MARTYN","text":"I don't bloody believe it! Just as I was beginnin' to turn a half-decent profit..."},{"name":"ROYSE","text":"(-Self-assured Entrepreneur-)Well, well! That was quite the show, darlings!"},{"name":"ROYSE","text":"(-Self-assured Entrepreneur-)Neither black nor white magic, but something new entirely─blue magic! Yes, it's sure to draw a crowd, as you've amply demonstrated."},{"name":"MARTYN","text":"And who might you be?"},{"name":"ROYSE","text":"(-Self-assured Entrepreneur-)The name's Royse, and I manage the Celestium in Ul'dah. It's an arena where daring young souls such as yourselves perform feats of bravery for the audience."},{"name":"ROYSE","text":"Unlike the Coliseum, the vast majority of the entertainment pits man against beast, with the matches being brought to an end before either side suffers any serious injury. While our patrons revel in the thrill of combat, acts of wanton brutality and bloodshed are considered...distasteful."},{"name":"ROYSE","text":"Rather than savagery and slaughter, our appeal lies in the personas that our participants assume to add a touch of drama to the proceedings."},{"name":"ROYSE","text":"However, I'm not one to settle for a mere modicum of success. My goal is to make the Celestium renowned the world over, and to that end, I have been searching for something truly unique. And that is when word of this blue magic of yours reached my ears."},{"name":"ROYSE","text":"Martyn, my blue bundle of crowd-pleasing wonderment, how would you like to be the very first contestant in the Masked Carnivale? It will be an event pitting your magic against a host of bestial foes!"},{"name":"MARTYN","text":"Listen, this is serious stuff! I didn't go through all the trouble of learnin' all these spells to entertain a bunch of gawpin' spectators."},{"name":"ROYSE","text":"Paying spectators, my dear. Some of them are quite wealthy, in fact. And you stand to earn rather a lot of coin."},{"name":"MARTYN","text":"Now you're talkin' my language!"},{"name":"ROYSE","text":"I say, darling, where are you going? I was about to make you the same offer!"},{"name":"MARTYN","text":"Ha ha! I hate to burst your bubble, love, but my ah...apprentice here's barely taken the first step on the road to becomin' a blue mage. Wouldn't want <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> meetin' a grisly end in the middle of your arena, would we?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Once I learn some more blue magic, I'll win for sure!"},{"name":"A1","text":"Can I use something besides these piss-poor spells?"},{"name":"ROYSE","text":"That's the spirit! I'm in no rush, so take as much time as you need with your preparations."},{"name":"ROYSE","text":"I...think that would rather defeat the purpose. If I only needed warriors to triumph over the pit fiends, I have more than enough already."},{"name":"ROYSE","text":"It's blue magic or nothing, I'm afraid. If you're not confident in your abilities, I don't mind waiting until you're ready for battle."},{"name":"ROYSE","text":"Perhaps you could oversee <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> training between matches?"},{"name":"MARTYN","text":"Trainin'!? That weren't part of the deal!"},{"name":"ROYSE","text":"Oh, I'm not asking you to do it for free, my dear. Quite the contrary."},{"name":"MARTYN","text":"You'll pay me for that too!? Consider it done!"},{"name":"ROYSE","text":"That's what I like to hear, Martyn. Let's get you to Ul'dah for your costume fitting. Come along!"},{"name":"MARTYN","text":"I have to wear a costume as well!? I've got a bad feelin' about this..."},{"name":"LATOOLJA","text":"Latool Ja thought Mamool Ja banned from entering Ul'dah, but guards let us through. Do rich people like Royse make own rules?"},{"name":"ROYSE","text":"It's just occurred to me that I never asked whether you actually want to take part in the Masked Carnivale."},{"name":"ROYSE","text":"<span class=\"emphasis\">Are</span> you willing to endure Martyn's training regime in preparation for the greatest performance of your life?"},{"name":"Q1","text":"Do you want to become a blue mage and enter the Masked Carnivale?"},{"name":"ROYSE","text":"You've made the right choice, my dear. I have high hopes for you!"},{"name":"ROYSE","text":"Not the reply I was expecting, but the door is always open if you change your mind, darling."},{"name":"ROYSE","text":"As for your illustrious mentor, I believe he should be ready to make his grand entrance any moment now."},{"name":"MARTYN","text":"I'll be honest with you, it's a bit more extravagant than what I'm used to. Color's not bad, I suppose..."},{"name":"ROYSE","text":"You look marvelous, my dear! Everyone, feast your eyes on the “Great Azuro”!"},{"name":"MARTYN","text":"Eh!? What's that supposed to mean?"},{"name":"ROYSE","text":"Well, nothing really, but it lends a certain degree of panache to your stage persona. No offense, darling, but the “Great Martyn” doesn't have quite the same ring to it."},{"name":"ROYSE","text":"You'll be playing the role of an enigmatic nobleman who has deigned to grace the Celestium with his outlandish magicks."},{"name":"ROYSE","text":"Oh, where are my manners? I never asked your name."},{"name":"ROYSE","text":"<span class=\"highlight\">Forename</span>? Hmm. We should come up with something a little more inspiring before you step into the arena."},{"name":"ROYSE","text":"Ah yes, I have some information concerning you two gentlemen. As you may have heard, Ul'dah has a law that bans members of most beast tribes from entering the city. It was mainly to keep out goblin merchants, you see."},{"name":"ROYSE","text":"I have pored over─well, had someone else pore over─the documents and it seems there is no mention of the Mamool Ja whatsoever, meaning you are free to stay as long as you please."},{"name":"ROYSE","text":"Well, with that, I think my work here is done for the time being. Martyn, I leave <span class=\"highlight\">Forename</span> in your presumably capable hands. Best of luck!"},{"name":"MARTYN","text":"I'll admit, I didn't think this is how things would turn out, but what's life without a few surprises, eh? So, it looks like I'll be guidin' you on the path to becomin' a blue mage."},{"name":"MARTYN","text":"I get the impression you're no stranger to gettin' up close and personal with fearsome beasties, but when it comes to mastering the Whalaqee's techniques, you've got a long way to go."},{"name":"MARTYN","text":"It's the creatures themselves who'll be doin' all the teachin', though, and the spellbook'll point you in the right direction."},{"name":"MARTYN","text":"'Course, I wouldn't be much of a mentor if I just said, “Come back when you've got a few more spells under your belt.” Seems like you need somethin' specific to aim for."},{"name":"MARTYN","text":"Tell you what, why don't you start by learnin' Blood Drain? And who knows─it might even come in handy!"},{"name":"MARTYN","text":"Oh, it nearly slipped my mind!"},{"name":"MARTYN","text":"There are a few spells that you can only learn from creatures in the New World. Luckily for you, Gaheel Ja has brought with him a fine selection of totems infused with their aether, to save you the trip across the Indigo Deep."},{"name":"MARTYN","text":"No gettin' your hands dirty fightin' off fiends─just absorb the aether and the magick is yours!"},{"name":"MARTYN","text":"Naturally, we're not goin' to just give them to you, since you're still only a novice. Wouldn't want you bitin' off more than you can chew! When you think you're ready, talk to Gaheel Ja."},{"name":"MAMOOLJASHOP","text":"Gaheel Ja very impressed by <span class=\"highlight\">Forename</span>'s bravery when kraken appeared. Now <span class=\"highlight\">Forename</span> must impress with skills as blue mage if you want these totems!"},{"name":"MARTYN","text":"You heard the man! There's a whole world of spells waitin' for you, so go and start learnin'!"}],"reward":{"gil":459},"reqs":{"jobs":[{"lvl":1,"id":129}],"quests":[68728]},"next":[68730]},"partials":[{"type":"npc","id":"1026932","obj":{"i":1026932,"n":"Martyn","l":31,"q":2}},{"type":"npc","id":"1026937","obj":{"i":1026937,"n":"Royse","l":41,"q":3}},{"type":"quest","id":"68728","obj":{"i":68728,"n":"Out of the Blue","g":166,"l":"Limsa Lominsa","s":1,"f":1}},{"type":"quest","id":"68730","obj":{"i":68730,"n":"Blue Collar Work","g":166,"l":"Ul'dah","s":100,"f":1}}]}