{"quest":{"name":"A Requiem for Heroes","location":"The Lochs","id":68721,"patch":4.56,"sort":40,"icon":100840,"eventIcon":71201,"issuer":1026804,"target":1026990,"genre":7,"journal":["Despite the apparent urgency of Raubahn's summons, the Resistance fighter seems content to wait for your signal to proceed.","The Resistance fighter informs you that Raubahn is prepared to discuss strategy. You offer a curt nod and he proceeds to escort you to Alliance Headquarters. ","As Raubahn tells it, the Alliance and imperials are at a stalemate, neither side willing to concede defeat. The reason for this deadlock is unclear until a scout interrupts your meeting with grave news─imperial soldiers have broken through the Alliance's defenses, being led by a man who appears to be Lord Zenos. You prepare to set out for battle when you are suddenly racked with pain as an otherworldly voice reaches out to you, but the agony of this aetherial calling does little to weaken your resolve. Raubahn can but wish you luck as you set out to do what you must.<br><br>You arrive on the battlefield to find Lyse and Yugiri motionless on the ground, Lord Hien struggling and failing to get on his feet. Towering over them is Lord Zenos, or the Ascian who wears his face. Battle quickly ensues, but try as you might, the Ascian refuses to fall. With ill-fated timing, the pain of the voice brings you to your knees. Your foe standing over you, the world goes dark as his blade comes crashing down on you.<br><br>When next you open your eyes, you find yourself in a strange, aetherial plane. Behind you stands a robed figure. He offers no explanations of what is happening, only a message: return to the Crystal Tower where a beacon has been placed for you.","You awake in a soft, warm bed, a young Elezen girl dashing out of the room. Was the hooded figure a dream? The thought is pushed aside as Aymeric enters, relief plain on his face. He explains that, just as the Ascian was about to strike, Estinien intervened and whisked you away to safety. He goes on to say the man posing as Lord Zenos retreated shortly after, prompting the remaining imperial forces to follow suit. Before taking his leave, Aymeric relays a message to you, that when you are well and rested, you are to return home where friends are waiting for you. ","A hush falls over the Rising Stones as you enter, which is soon broken by an overjoyed Tataru. You recount to her all that took place, from your battle at Ala Mhigo, to the mysterious robed figure and his cryptic message. After giving it careful thought, she suspects this person, whomever they may be, is possibly the key to rescuing the others. With renewed resolve, she assures you the Scions who yet remain at the Rising Stones will find the beacon waiting for you at the Crystal Tower.","Tataru never lost hope that you would return. In fact, she fashioned you a new set of garments to celebrate your return. Though it is unclear what you will find at the Crystal Tower, perhaps this garb will be of use on the road ahead.<br><br>※The next main scenario quest will be available from Tataru once you have met the following requirements:<br>※ FINAL FANTASY XIV: Shadowbringers must be registered to your service account.<br>※ You must have completed the main scenario quest “A Requiem for Heroes.”"],"objectives":["Speak with Raubahn.","Return to the Rising Stones.","Speak with Tataru."],"dialogue":[{"name":"RESISTANCEGATEKEEPER","text":"Commander Aldynn is waiting, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">sir</span></span>. It would be best if we proceeded to Alliance Headquarters at once."},{"name":"RESISTANCEGATEGUARD","text":"Are you ready?"},{"name":"Q1","text":"Accompany the Resistance fighter to Alliance Headquarters?"},{"name":"RAUBAHN","text":"You're here. Good. I summoned you to discuss strategy, but first I would apprise you of the Garleans' movements."},{"name":"SYSTEM","text":"Upon speaking with Raubahn, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"SYSTEM","text":"In order to undertake this quest, you must be a Disciple of War or Magic of level 70 or above."},{"name":"Q1","text":"Speak with Raubahn?"},{"name":"EDMONT","text":"(-???-)Well, this is a most unexpected surprise. I thought you confined to bed."},{"name":"EDMONT","text":"When I heard that you had collapsed on the field of battle, I confess I feared the worst. But with you standing here before me, I see now that the reports of your defeat were greatly exaggerated. Thank the Fury."},{"name":"EDMONT","text":"As long as we have you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, history suggests we have a fighting chance. Speaking of fighting, you may be surprised to hear that the war's effects can already be felt even here in Ishgard. In anticipation of a need for reinforcements, Artoirel will soon be departing for the front lines with a contingent of our finest knights."},{"name":"EDMONT","text":"I <span class=\"emphasis\">would</span> advise you to stay until your strength had returned, but I know it would be an exercise in futility."},{"name":"EDMONT","text":"Indeed, I suspect you have already decided on your next destination."},{"name":"EDMONT","text":"Dark days lie ahead, of that I have no doubt, but the light of hope shall ever guide our steps so long as we have the will to press onward."},{"name":"EDMONT","text":"And press onward we must. Farewell, my friend. I pray our next meeting will be under happier circumstances."},{"name":"EDMONT","text":"You know that you will ever be welcome at House Fortemps. Now away with you! I dare not keep you any longer!"},{"name":"HANDELOUP","text":"<span class=\"highlight\">Forename</span>! Finally up and about, I see. Everyone feared the worst when they brought you to the infirmary─but I knew you would pull through. Something tells me your part in this war is far from over."},{"name":"BUTLER02246","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! We did not expect to see you back on your feet so soon. Confined to bed as you were, Lord Edmont left for your quarters not long ago, thinking to keep you company. Did you perchance encounter him on the way?"},{"name":"SAULETTE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! My apologies, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I meant to go and visit you in the infirmary, but... Well, I'm glad to see you up and about!"},{"name":"EMMANELLAIN","text":"<span class=\"highlight\">Forename</span>, you're awake! Gods, you scared us half to death, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>. Don't go making a habit of it, eh!?"},{"name":"HONOROIT","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Thank the Fury you are all right."},{"name":"HANCOCK","text":"I must confess, the offices have not been quite the same since Tataru left... They're considerably quieter, for one thing. But don't tell her I said that, all right?"},{"name":"RAUBAHN","text":"I knew you'd be all right. And to celebrate your return, I made you this─a brand-new traveling outfit! Oh, I do hope it fits..."},{"name":"RAUBAHN","text":"&lt;ahem&gt; But now is not the time to fuss over your measurements. I must go and speak with the researchers of Saint Coinach's Find. You go and rest while we track down that beacon."},{"name":"SYSTEM","text":"You have completed the Post-Ala Mhigan Liberation chapter of the main scenario. In the following chapter, Shadowbringers, the events of the Crystal Tower quests play an important role."},{"name":"SYSTEM","text":"It is recommended that you play the Crystal Tower quests before beginning Shadowbringers."},{"name":"SYSTEM","text":"The starting quest, “Legacy of Allag,” may be undertaken by speaking with the outlandish man in Revenant's Toll."},{"name":"SYSTEM","text":"You may review your progress under “Chronicles of a New Era - The Crystal Tower” in your journal."}],"reward":{"items":[{"id":27969}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68720]},"next":[68815]},"partials":[{"type":"npc","id":"1026804","obj":{"i":1026804,"n":"Resistance Fighter","l":2408,"q":1}},{"type":"npc","id":"1026990","obj":{"i":1026990,"n":"Tataru","l":481,"q":2}},{"type":"item","id":"27969","obj":{"i":27969,"n":"Scion Traveler's Attire Coffer","l":1,"c":26509,"t":61}},{"type":"quest","id":"68720","obj":{"i":68720,"n":"A Brief Reprieve","g":7,"l":"The Rising Stones","s":39}},{"type":"quest","id":"68815","obj":{"i":68815,"n":"The Syrcus Trench","g":8,"l":"The Rising Stones","s":10}}]}