{"quest":{"name":"The Path of Most Resistance","location":"Kugane","id":68723,"patch":4.5,"sort":70,"icon":100813,"unlocksFunction":1,"eventIcon":71341,"issuer":1024149,"target":1026970,"genre":21,"journal":["The worried look on Lina Mewrilah's face suggests she bears grave tidings. Or not.","Alma is unwell, but as to what ails her, none can say. Lina suggests you continue your conversation on the <span class=\"emphasis\">Prima Vista</span>.","Jenomis is near a decision on where to next take his expedition, or at least so Lina believes.","According to Jenomis's newest findings, the auracite are creations of an otherworldly being sealed beneath the Orbonne Monastery─an ancient sanctuary deep within the heart of a Dalmascan jungle. During the principal's speech, Cid appears to deliver Mikoto a device she requisitioned the chief engineer to build, then leaves without as much as a farewell.","The device conceived by Mikoto is, in fact, a means of protecting Alma from the aetherial influence of the Otius.","Former royal fusilier and sky pirate Bwagi invites you aboard his airship that he may take you to speak with a general for the resistance movement to which he and his companions now belong.","General Fran of the Dalmascan resistance group, Lente's Tears, promises her assistance in locating the Orbonne Monastery in return for financial and military aid from both the Eorzean and Doman alliances, and the East Aldenard Trading Company.","Montblanc appears both frightened and excited at the notion of aiding the Dalmascan resistance in their plight against the Garlean Empire; though, perhaps you should speak with Jenomis first before sharpening your blade."],"objectives":["Ride the transport shuttle to the <span class=\"emphasis\">Prima Vista</span>.","Speak with Mikoto.","Speak with Bwagi down on Kugane landing.","Speak with Bwagi again.","Speak with Montblanc."],"dialogue":[{"name":"LINAMEWRILAH","text":"Greetings and salutations, <span class=\"highlight\">Forename</span>! I suppose you are wondering whether or not the good Jenomis has finally determined where in the world our next adventure is to take us..."},{"name":"LINAMEWRILAH","text":"The good news is, he has. The bad news, however..."},{"name":"LINAMEWRILAH","text":"Now, while it is not in my nature to be sensationalist, sensationalism <span class=\"emphasis\">is</span> in my job description, so please bear with me when I tell you not all is right aboard the airship Lexentale. Something about Alma has me deeply worried."},{"name":"LINAMEWRILAH","text":"I would not trust this information in the hands of my publisher, let alone some sullen gate guard. Shall we continue our conversation on the <span class=\"emphasis\">Prima Vista</span> away from inquisitive ears?"},{"name":"LINAMEWRILAH","text":"Principal Jenomis claims to have learned much from his continued study of the Durai Papers. Still, he appears to be frustrated at a lack of information crucial to solving the mystery."},{"name":"AIRSHIPGUIDE03003","text":"Shall I prepare the shuttle for you, <span class=\"alternative-container\"><span class=\"alternative\">my lady</span><span class=\"alternative\">my lord</span></span>?"},{"name":"Q1","text":"Board the <span class=\"emphasis\">Prima Vista</span>?"},{"name":"JENOMISLEXENTALE","text":"The question is, then, where exactly did Ramza and his fellowship journey next?"},{"name":"JENOMISLEXENTALE","text":"Ah, <span class=\"highlight\">Forename</span>. To what do we owe this unexpected visit? I had not planned on summoning you for another several turns of the sun."},{"name":"RAMZALEXENTALE","text":"I apologize if we have caused you any worry. I suppose one cannot allow a reporter in their midst and not expect her to report what she sees...though I did expect a tad more discretion from Miss Mewrilah."},{"name":"RAMZALEXENTALE","text":"Alma has, as of late, been experiencing...difficulties with her health. Chirurgeons have been called upon to discern what exactly it is that ails her, but as far as they can tell, there is nothing physically wrong with my sister. The consensus is the rigors of an extended stay in a foreign land have taken their toll on her fragile heart."},{"name":"ALMALEXENTALE","text":"<span class=\"highlight\">Forename</span>! When did you─"},{"name":"RAMZALEXENTALE","text":"Alma!"},{"name":"ALMALEXENTALE","text":"I'm fine, Brother."},{"name":"RAMZALEXENTALE","text":"It is obvious you are not! You must return to your chambers and rest!"},{"name":"ALMALEXENTALE","text":"Forgive me. Perhaps we shall speak again once I regain my strength. Until then, please... Look after my father."},{"name":"JENOMISLEXENTALE","text":"Now then, where were we? Ah, yes. The matter of our next expedition."},{"name":"JENOMISLEXENTALE","text":"As we discovered during our most recent foray into the Estersands, the Dalmascan capital of Rabanastre appears to lie upon the ruins of what can only be the Royal City of Lesalia─ancient capital of the lost kingdom of Ivalice."},{"name":"JENOMISLEXENTALE","text":"Shortly after, we stumbled across remnants of the legendary Clockwork City of Goug cleverly repurposed into a lighthouse overlooking the Ridorana Cataract─remnants which now sit suspended above the fathomless chasm."},{"name":"JENOMISLEXENTALE","text":"Lesalia, Goug. What have they in common, you ask? I shall tell you─they both appear in my ancestor's account of the rise of Ivalice: the Durai Papers."},{"name":"JENOMISLEXENTALE","text":"And with each new discovery, this forbidden chronicle is now proving Ivalician legend to be more fact than faerie tale."},{"name":"JENOMISLEXENTALE","text":"There is no denying the proof, and it is but a matter of time before scholars and historians from across the realm come to the same conclusions."},{"name":"JENOMISLEXENTALE","text":"But as you all are aware, my aim has never been to simply prove the existence of Ivalice. No, I shall not rest till I have revealed the truth of young Ramza's role in King Delita's ascension, and cleared my ancestor Orran Durai of the false accusations made against him by the church."},{"name":"Q2","text":"How do you respond?"},{"name":"A2","text":"Then what are we waiting for?"},{"name":"A2","text":"Should we not see to Alma first?"},{"name":"JENOMISLEXENTALE","text":"I have a possible destination in mind. Arriving there safely, however, is another matter. To that end, I have enlisted the aid of our company's newest members."},{"name":"RAMZALEXENTALE","text":"Despite my pleas to do otherwise. Who knows what trouble those two will see us into?"},{"name":"JENOMISLEXENTALE","text":"Kugane's chirurgeons would have us believe she is in no immediate danger, as her illness is not one of the body, but of the mind. To borrow their words, her spirit is in a state of unbalance and merely requires time to right itself."},{"name":"RAMZALEXENTALE","text":"Alma will be fine as long as she remains in bed. The last thing she needs is any further excitement...especially at the paws of these meddlesome mole-bats."},{"name":"RAMZALEXENTALE","text":"Though, I must admit, both Montblanc and his brother have proven more useful than I would ever have dared to imagine."},{"name":"MONTBLANC","text":"When it comes to usefulness, I am first in the field...or was it furriest in the field? Would you like to feel my fur, kupo?"},{"name":"HURDY","text":"And you wonder why Ramza despises you so, Brother! They do all the work, and all you do is jest, kupo!"},{"name":"RAMZALEXENTALE","text":"Ah, but you are mistaken, Hurdy. I bear neither you nor your brother any ill will. Any <span class=\"emphasis\">further</span> ill will, that is. If anything, I owe you my thanks for your recent contributions."},{"name":"LINAMEWRILAH","text":"His <span class=\"emphasis\">thanks</span>? Are you hearing what I'm hearing? What happened to the venom-spitting adder we all used to know and hate?"},{"name":"LINAMEWRILAH","text":"Alma certainly seems pleased with the change, but forgive me for not buying into this all-too-convenient transformation."},{"name":"JENOMISLEXENTALE","text":"Simply showing the world that Ivalice actually existed will not validate the claims chronicled in the Durai Papers."},{"name":"RAMZALEXENTALE","text":"That is correct, Father. The key lies with Ramza Beoulve. If we can find evidence of his hidden role in history, it will prove Orran's testimony true and safeguard our family name from ridicule."},{"name":"JENOMISLEXENTALE","text":"Which is why I turned the focus of my research to Delita's forgotten companion and his actions during the War of the Lions. It was only then I discovered something most intriguing─an underlying struggle with an unknown force, a force with the power to bring about calamitous ruin."},{"name":"RAMZALEXENTALE","text":"Auracite! The twisted abominations we encountered in both Lesalia and Goug─the Lucavi─they are born of these unholy crystals."},{"name":"RAMZALEXENTALE","text":"While nobles of the north and south squabbled over Ivalice's crown, Ramza silently sought to rid the world of a darker evil─evil manifest from the deepest desires of men and women whose minds had fallen prey to the auracite."},{"name":"JENOMISLEXENTALE","text":"And with each confrontation did Ramza's fellowship grow smaller. Countless companions lost to a cause that would go unwritten, yet was far more important than any clash of armies. And so did they endure, until reaching their final destination: the Orbonne Monastery."},{"name":"LINAMEWRILAH","text":"Oh, I know this one! The Orbonne Monastery is where Princess Ovelia was raised! There is a scene about it in <span class=\"emphasis\">The Zodiac Brave Story</span>!"},{"name":"LINAMEWRILAH","text":"After Delita emerged victorious in his final campaign, he married the princess to legitimize his claim to the throne of Ivalice."},{"name":"JENOMISLEXENTALE","text":"Ah, I see someone has been paying attention."},{"name":"LINAMEWRILAH","text":"But I don't understand. Why would Ramza's crusade against the Lucavi take him back there?"},{"name":"RAMZALEXENTALE","text":"According to the Durai Papers, the sinister being who engendered the auracite was said to have slumbered beneath the monastery."},{"name":"MIKOTO","text":"But who...or what would have the means to create something so powerful?"},{"name":"JENOMISLEXENTALE","text":"Ultima, the High Seraph."},{"name":"LINAMEWRILAH","text":"A seraph!? Er...what's a seraph?"},{"name":"JENOMISLEXENTALE","text":"Seraphs are believed by some to be servants of the gods─divine beings whose only purpose is to carry out the will of their immortal masters. As to whether or not Ultima can claim this title, however, I cannot say."},{"name":"JENOMISLEXENTALE","text":"Just as there were those who chose to worship Ultima and her otherworldly might, there were equally as many who feared the visitor and her deadly magicks, oft referring to her as the “Angel of Blood” for the carnage left in her wake."},{"name":"MIKOTO","text":"Interesting... What if the spell <span class=\"highlight\">Forename</span> claims to have experienced in the Praetorium─coincidentally also called Ultima─was, in fact, an Allagan interpretation of the very magicks introduced to Hydaelyn by the High Seraph?"},{"name":"LINAMEWRILAH","text":"But that would mean... What would that mean?"},{"name":"MIKOTO","text":"I have spoken with several colleagues back in Sharlayan regarding their opinions on the ancient incantation, and while they yet have little to show for their research, they all agree on one thing: the manner in which Ultima aetherially manifests should not be possible...at least on Hydaelyn."},{"name":"MIKOTO","text":"So it would naturally make sense if we discovered that the Allagans learned the spell from a being not of this dimensional plane. As to exactly <span class=\"emphasis\">how</span> they convinced the being to impart that knowledge unto them..."},{"name":"LINAMEWRILAH","text":"Not of this plane? What manner of creature are we talking about here?"},{"name":"CID","text":"Likely one similar to Omega."},{"name":"JENOMISLEXENTALE","text":"How long have you been listening from the shadows, my friend?"},{"name":"CID","text":"Long enough. I am here to deliver the item Mikoto requested."},{"name":"MIKOTO","text":"Cid! There was no need for you to deliver it personally. A moogle would have sufficed."},{"name":"CID","text":"A moogle? And trust that he won't tear open the package and show it to some random adventurer? No, this was far too important."},{"name":"LINAMEWRILAH","text":"If you two do not mind, the principal was about to tell us how to find the Orbonne Monastery."},{"name":"JENOMISLEXENTALE","text":"Would that I could..."},{"name":"LINAMEWRILAH","text":"You don't know!? Then what have we been doing here?"},{"name":"RAMZALEXENTALE","text":"At ease, Lady Mewrilah. The Durai Papers speak of a cataract situated on the River Zeirchele, several leagues southeast of Rabanastre. There supposedly lies the monastery."},{"name":"RAMZALEXENTALE","text":"Zeirchele is not a name you will find on any modern Dalmascan map. Rivers, however─especially ones as large as the Zeirchele is established to be─are rare in a nation more than half-claimed by the sand. The river we seek can only be that which bisects Golmore on the Nagxian border."},{"name":"RAMZALEXENTALE","text":"And for that invaluable information, we owe thanks to our brothers moogle. Their travels have made them veritable authorities on Dalmascan geography."},{"name":"LINAMEWRILAH","text":"Wait, but earlier you claimed you <span class=\"emphasis\">didn't</span> know the monastery's whereabouts. I'm confused..."},{"name":"RAMZALEXENTALE","text":"Its location is not what concerns me... But perhaps the moogles themselves should explain."},{"name":"MONTBLANC","text":"Why, certainly! That verdant valley of vines and vipers to where we must voyage next is home to the Viera─and therein lies our little problem. The one thing the Viera do not suffer is trespassers, not even lovable moogles, kupo!"},{"name":"HURDY","text":"Our glamours kept us hidden long enough to see the jungle was teeming with ruins much like those we've discovered in Lesalia and Goug, but the Viera trackers eventually found us and took us before their elders. We barely escaped with our poms, kupo!"},{"name":"LINAMEWRILAH","text":"So <span class=\"emphasis\">that</span> is why we are still here talking instead of bound for the border."},{"name":"JENOMISLEXENTALE","text":"There are Viera who have spurned the strict code of their tribes, abandoning their people to come and live in the cities of Dalmasca. Finding and recruiting one to our cause might provide us with insight into how to reach the Orbonne Monastery ruins."},{"name":"RAMZALEXENTALE","text":"Unfortunately, the nation's current turmoil has not made it easy to accomplish this task. We still require more time..."},{"name":"CID","text":"Before boarding the shuttle here I was stopped by a Bangaa on the docks. He asked me if I knew a <span class=\"highlight\">Forename Surname</span> and bid I deliver <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> a message."},{"name":"CID","text":"I told him he was welcome to accompany me to the <span class=\"emphasis\">Prima Vista</span> so that he might deliver that message himself, but the man refused."},{"name":"CID","text":"Mikoto. I saw this device crafted to your exact specifications, but cannot guarantee that it will function as intended, seeing as I had nary a subject to test it on."},{"name":"MIKOTO","text":"Of course, Master Cid. If any trouble is met, then most likely it is my design that is to blame."},{"name":"CID","text":"Your confidence in my craftsmanship is flattering, but you sell yourself too short, my dear. Here's to your success. Good day!"},{"name":"MONTBLANC","text":"You won't believe this, but since our <span class=\"emphasis\">time</span> together in the clockwork city, Ramza and I have grown inseparable! Why, I'd consider him a closer companion now than even my good brother, Hurdy! (Just don't let Hurdy know that, kupo!)"},{"name":"MIKOTO","text":"I sense that you are interested in the package Cid delivered. I have every intention to apprise you of its contents, but first I believe we should speak of Alma's condition."},{"name":"MIKOTO","text":"Do you not find her illness all too timely? Jenomis and Ramza would like to believe that her bouts of vertigo are naught but a result of a mind fatigued, but the answer is clear: it is the auracite that plagues her."},{"name":"MIKOTO","text":"Alma recently confided in me that she would hear her father speaking with the Otius, well before even his first foray into Rabanastre. However, I do not think this entirely true."},{"name":"MIKOTO","text":"Which is not to imply that Alma is trying to deceive us. Rather, I think she saw something that led her to believe her father was conversing with the auracite. Moreover, I suspect it was the <span class=\"emphasis\">auracite itself</span> that granted her this vision."},{"name":"MIKOTO","text":"You recall my hypothesis on distinct-frequency NRR–type harmonic vibrations and their tendency to promote aetherial amplification? Or when I mentioned that despite being in the principal's possession for an extended period, the Otius exhibited none of the imprinting present in the Duma? No?"},{"name":"MIKOTO","text":"The Otius has <span class=\"emphasis\">never</span> resonated with Jenomis; it has always been his wife's pendant and its auracite shard─the Virgo─that fueled his passion for Ivalice. No, the Otius is bound to <span class=\"emphasis\">Alma's</span> deepest desires...whatever those may be."},{"name":"MIKOTO","text":"The only reasons I can fathom that Alma has not fallen victim to the auracite's grasp is that her desires are not as strong as those we have witnessed in Argath or Ba'Gamnan. That and the aetherial interference caused by other nearby shards."},{"name":"MIKOTO","text":"I have explained all of this to Alma and recommended that she destroy the necklace, yet not only did she refuse, but she begged me to keep this revelation from her father."},{"name":"MIKOTO","text":"And so I did the only thing I could: I devised a means with which I might impede, or at least lessen, the effects of the Otius."},{"name":"MIKOTO","text":"This device, while still incomplete, will amplify the NRR wavelengths emitted by the Virgo. This should work to interfere with those emitted by the Otius, thereby shielding Alma from the brunt of their effect."},{"name":"MONTBLANC","text":"The city below is all abuzz with word of a Bangaa brigand loitering about the airship landing. Do you think it could be someone we know, kupo?"},{"name":"MONTBLANC","text":"It <span class=\"emphasis\">was</span> Bwagi and his companions! Perhaps they know of the Orbonne Monastery! Sky pirates are bound to have traveled the whole of Dalmasca on their many misdeeds."},{"name":"BWAGI","text":"Apologies, <span class=\"highlight\">Forename</span>, but I needed to speak with you...and you alone."},{"name":"MONTBLANC","text":"Oh don't mind me, kupo! I'll just be floating over here in perfect earshot."},{"name":"BWAGI","text":"Why you─! What makes you think I won't lay you low, right here, right now?"},{"name":"MONTBLANC","text":"Because we're here to offer you a proposition, that's what! We need information on the Golmore Jungle, and thought a man as <span class=\"emphasis\">well traveled</span> as you might be persuaded to provide some."},{"name":"BWAGI","text":"Golmore? You of all creatures should know that is Viera land. What are you offering, then?"},{"name":"MONTBLANC","text":"Why, the opportunity to tell us what you know! Jenomis believes our next adventure lies beneath the jungle canopy, kupo."},{"name":"BWAGI","text":"&lt;sigh&gt; I should have expected as much."},{"name":"BWAGI","text":"Very well. <span class=\"highlight\">Forename</span>, I came to ask if you would meet someone. Now it seems that someone may be able to assist Jenomis, as well. Seeing as you and the principal did right by us before, I do not see a reason why I cannot take both of you."},{"name":"MONTBLANC","text":"That was far easier than I thought it would be, kupo!"},{"name":"BWAGI","text":"Let me know when you are ready to depart for Rabanastre. We will travel in our airship. The <span class=\"emphasis\">Prima Vista</span> would draw too much unwanted attention."},{"name":"Q5","text":"Board Bwagi's vessel?"},{"name":"MONTBLANC","text":"Back to a life of brigandry in the clouds, are we?"},{"name":"BWAGI","text":"(-Bwagi-)Of course not! Not that it didn't cross our minds... But when faced with the decision of what to do next, we needed simply to remember the dying words of our leader. Gijuk, Rinok, and I decided to reenlist as Dalmascan fusiliers."},{"name":"MONTBLANC","text":"And the occupying Garleans actually said yes, kupo?"},{"name":"RINOK","text":"(-Rinok-)Not...exactly. We're now with the resistance."},{"name":"GIJUK","text":"(-Gijuk-)You no doubt heard of the uprising in Dalmasca that followed the Doman liberation...and how it was crushed under the iron heel of the IVth Legion."},{"name":"GIJUK","text":"(-Gijuk-)The resistance leaders were captured, tortured, and publicly executed. Yet, much to the Empire's chagrin, the gruesome display only served to further rally the survivors."},{"name":"BWAGI","text":"(-Bwagi-)Remove one head, and two grow back in its place. Remove two, and then there are four. A person can die, but an ideal will live on."},{"name":"BWAGI","text":"(-Bwagi-)Now there exist several factions throughout Dalmasca. We belong to one known as Lente's Tears."},{"name":"GIJUK","text":"(-Gijuk-)And when we told our commanding officer of our recent crossing with you and yours, she simply <span class=\"emphasis\">insisted</span> that we introduce you."},{"name":"MONTBLANC","text":"M-M-Me!? But I wasn't even supposed to be here, kupo!"},{"name":"GIJUK","text":"(-Gijuk-)Not you, hairball. <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">Him</span></span>!"},{"name":"BWAGI","text":"(-Bwagi-)Meet with the general and hear her proposal, <span class=\"highlight\">Forename</span>. If you are not interested, we shall return you to Kugane unharmed. You have our─"},{"name":"MONTBLANC","text":"Hm? Coeurl got your tongue?"},{"name":"RINOK","text":"(-Rinok-)Rabanastre dead ahead, lads."},{"name":"BWAGI","text":"(-Bwagi-)This way. We've many malms to cover before nightfall."},{"name":"BWAGI","text":"(-Bwagi-)I've done as asked. I bring you the liberator."},{"name":"FRAN","text":"(-???-)And here I thought <span class=\"alternative-container\"><span class=\"alternative\">she'd</span><span class=\"alternative\">he'd</span></span> be taller."},{"name":"MONTBLANC","text":"I knew it! A Viera!"},{"name":"FRAN","text":"I am Fran, proud daughter of Dalmasca and general of Lente's Tears."},{"name":"BWAGI","text":"And yes, moogle. I am a Viera. Are you surprised?"},{"name":"BWAGI","text":"And yes, moogle. I am a Viera. Are you surprised?"},{"name":"MONTBLANC","text":"Why yes, in fact, I am! Her kind are all supposed to be living amongst the trees, having shunned contact with the outer world, kupo. There are supposedly a few who have left their homes, but I most certainly did not expect to see one here in this sewer!"},{"name":"FRAN","text":"Indeed..."},{"name":"FRAN","text":"This Bangaa claims you seek Orbonne. Does he speak true?"},{"name":"FRAN","text":"Those ruins lie deep within the Golmore Jungle─a place most sacred to my sisters. They would take great offense were you to defile it with your presence."},{"name":"FRAN","text":"What is more, Bwagi tells me you travel with Garleans, openly aiding those who would see our nation burn. How can we place our trust in one who would do such?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Jenomis and his family defected long ago! They are not your enemy!"},{"name":"A3","text":"My blade has tasted the blood of too many Garleans to count."},{"name":"FRAN","text":"A Garlean is a Garlean. Their pathetic attempt at absolution only proves their past guilt."},{"name":"FRAN","text":"And then you know the Empire and its people are one and the same. When you slay an imperial soldier, you are not slaying an individual, you are slaying the <span class=\"emphasis\">enemy</span>. Your companions, Liberator, <span class=\"emphasis\">are</span> the enemy, despite their supposed change of heart."},{"name":"MONTBLANC","text":"You misunderstand! Kind Jenomis does not approve of the Emperor's warmongering! He wants to help Dalmasca and its impoverished masses, kupo!"},{"name":"FRAN","text":"And what would a moogle know about my people? Does your blood run Dalmascan red? We could cut you open and find out!"},{"name":"BWAGI","text":"(-Bwagi-)General, there is no need for threats."},{"name":"FRAN","text":"You are right, Bwagi. Let us then parley!"},{"name":"MONTBLANC","text":"Par...ley?"},{"name":"FRAN","text":"Parley."},{"name":"FRAN","text":"First, the resistance requires men─men and women from the Eorzean and Eastern alliances to join us in ridding Dalmasca of its imperial invaders."},{"name":"FRAN","text":"First, the resistance requires men─men and women from Doma and the Eorzean Alliance to join us in ridding Dalmasca of its imperial invaders."},{"name":"FRAN","text":"Your past deeds have made you well known to the leaders of both. They will listen to you, or if not, they will listen to these Scions to which you claim allegiance."},{"name":"FRAN","text":"Second, the resistance requires gold─gold to strengthen our forces from within."},{"name":"FRAN","text":"Your allies are in bed with the East Aldenard Trading Company, which continues its dealings with Garlemald even as you raise your sword against them, profiting from the Empire's rampant aggression. As targets of that aggression, I believe my people are entitled to a portion of those profits."},{"name":"FRAN","text":"Grant me these simple things, and I shall personally guide you safely to the ruins of Orbonne."},{"name":"MONTBLANC","text":"And what of the Lexentales?"},{"name":"FRAN","text":"See me to victory, and I'll take the Emperor himself!"},{"name":"FRAN","text":"Those are my conditions. What say you?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I will deliver your request to the Scions, but can promise no more."},{"name":"A4","text":"Promise me first my companions will see no harm."},{"name":"FRAN","text":"Tell them my demands, but know the fate of your expedition hangs on how well you do so."},{"name":"FRAN","text":"I will promise you nothing! But if it helps you sleep, know that I have never cut down a man who did not take up arms against me and mine, be he Garlean or Eorzean."},{"name":"MONTBLANC","text":"I'd say we have our work cut out for us, kupo!"},{"name":"FRAN","text":"Bwagi. You and the fusiliers are to accompany the liberator. I expect a detailed report on how my demands are received."},{"name":"BWAGI","text":"(-Bwagi-)Yes, General."},{"name":"FRAN","text":"Not that I expect them to be taken seriously. You are a fool to trust them, Princess..."},{"name":"BWAGI","text":"Do not be put off by Lady Fran. The general has quite the edge to her, but it is only because she wants what is best for the resistance."},{"name":"GIJUK","text":"I've finally come to accept Ba'Gamnan is gone for good, but I will never forget how he met his end. I cannot allow my hatred to consume me as it did him."},{"name":"RINOK","text":"The general is not too bad, once you're on her good side─her only good side being her backside...but you didn't hear that from me."},{"name":"MONTBLANC","text":"What an adventure, kupo! Just think, by tomorrow, we could all be the newest members of the Dalmascan resistance! Er...not that I'm ready to give up my place on the <span class=\"emphasis\">Prima Vista</span> just yet..."}],"reward":{"gil":1262},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68628]},"next":[68724]},"partials":[{"type":"npc","id":"1024149","obj":{"i":1024149,"n":"Lina Mewrilah","l":2404,"q":5}},{"type":"npc","id":"1026970","obj":{"i":1026970,"n":"Montblanc","l":2404,"q":2}},{"type":"quest","id":"68628","obj":{"i":68628,"n":"Annihilation","g":21,"l":"Kugane","s":60,"f":1}},{"type":"quest","id":"68724","obj":{"i":68724,"n":"Welcome to Their Jungle","g":21,"l":"Kugane","s":80,"f":1}}]}