{"quest":{"name":"In Bad Taste","location":"Kugane","id":68726,"patch":4.5,"sort":850,"icon":100815,"eventIcon":71221,"issuer":1026029,"target":1026029,"genre":21,"journal":["The wandering dramaturge wishes to express his appreciation.","The wandering dramaturge wishes to express his appreciation...for the wine you brought him, more so than the effort it took to acquire it.","It turns out the wine you bent over backwards to procure for the wandering dramaturge was only about as expensive as an afternoon in the Gold Saucer's Round Square. To apologize, Hancock─who has seemingly appeared out of nowhere─presents you with not one, not two, but three bottles of Dalmascan red he purchased from the Dalmascan resistance group, Lente's Tears. Now, you have the opportunity to replace the counterfeit bottle with which you tricked Master Gegeruju of Costa del Sol.","The wandering dramaturge suggests that you employ the aid of Shamani Lohmani in your latest attempt to pull the proverbial wool over Master Gegeruju's eyes.","Several cold stares and a rousing match of tug-of-war later, Master Gegeruju has his Dalmascan red, and your conscience is finally at ease. Now all that remains is to thank those who helped you along the way─starting with Shamani Lohmani.","Shamani Lohmani is ecstatic at the thought of, for once, actually drinking a bottle of wine instead of selling it to some pompous trade magnate. He suggests that your final bottle of Lea Monde go to Drest.","Drest accepts your gesture, and promptly retreats back to the safety of his own mind.","Amazingly, the wandering dramaturge offers what, in some circles, might be considered an apology for having you straddle the Three Great Continents on his behalf. The end...?"],"objectives":["Speak with the wandering dramaturge.","Speak with Shamani Lohmani in Wineport.","Speak with Shamani Lohmani again.","Speak with Drest at the Severed String.","Return to the <span class=\"emphasis\">Prima Vista</span> and speak with the wandering dramaturge."],"dialogue":[{"name":"WANDERINGWRITER","text":"The Suhd Viandja was truly an amazing wine! I admit, before leaving Garlemald, I was worried the outlands' vintages would not agree with my palate, but oh, how I was wrong!"},{"name":"WANDERINGWRITER","text":"Not only was the rosé one of the best I've had during my time here, it is one of the best I've had...well, ever! I simply had to have more so..."},{"name":"WANDERINGWRITER","text":"...I went and purchased an entire crate of the stuff! Ah hah hah hah!"},{"name":"HANCOCK","text":"And I gave him quite a deal, I might add. Which was not easy, seeing as there is great demand for bottles of Suhd Viandja throughout the Three Great Continents."},{"name":"WANDERINGWRITER","text":"I shall reserve my judgment on the verity of Hancock's “deal,” but even were the price double, it would have been more than worth it."},{"name":"WANDERINGWRITER","text":"Fortunately, I recently sold an entire collection of my works to a little playhouse on Kogane Dori─the Mujikoza, I believe they called themselves (these Hingan words leave my tongue in knots)─and scored myself a tidy profit."},{"name":"HANCOCK","text":"Hm? The price of a single bottle more than a house in Mist, you say? Hah! More than a <span class=\"emphasis\">bird</span>house, I suppose."},{"name":"HANCOCK","text":"Oh, you were serious. Well, then, I can inform you that is most definitely not the case. Even during shortages, I've never had to ask more than, say, twenty or thirty thousand gil a bottle. Forty if the buyer was wearing silks."},{"name":"HANCOCK","text":"You say Master Gegeruju provided you with this misinformation, did he?"},{"name":"HANCOCK","text":"Why, the conniving devil! Well played, you lecherous Lalafell, you! I mean...that is terrible! What a <span class=\"emphasis\">terrible</span> thing for him to do."},{"name":"HANCOCK","text":"Wait... Was that “Dalmascan” wine we “procured” for Master Gegeruju some moons ago in exchange for one of his bottles of Suhd Viandja?"},{"name":"WANDERINGWRITER","text":"Do I...uh...want to know about this, Hancock?"},{"name":"HANCOCK","text":"Probably not, but I shall enlighten you anyway..."},{"name":"WANDERINGWRITER","text":"It sounds like you and Hancock make quite the cunning devils, <span class=\"highlight\">Forename</span>. Still, I do feel somewhat responsible for this whole mess..."},{"name":"WANDERINGWRITER","text":"As an apology, might I offer you a bottle of...vintage Suhd Viandja?"},{"name":"WANDERINGWRITER","text":"No, of course not. Ahem. Then, what would you say to a bottle of Dalmascan? You could exchange it with the bottle you gave this Master Gegeruju and absolve yourself of all wrongdoing and whatnot."},{"name":"WANDERINGWRITER","text":"Ah, now you are probably wondering where one might find a bottle of genuine Dalmascan red, considering the hells you had to negotiate simply to find an <span class=\"emphasis\">empty</span> bottle. Well that, my distrustful friend, is where Hancock comes in."},{"name":"HANCOCK","text":"I do? Oh, yes...ahem, I do. And I just so happen to have a bottle of Dalmascan wine on my person this very moment! Three, in fact!"},{"name":"HANCOCK","text":"And <span class=\"emphasis\">why</span> do I carry bottles of the rarest wine in Othard on my person, you ask? I...er...am not at liberty to say."},{"name":"HANCOCK","text":"...If you must know, I acquired them from one of my acquaintances in Rabanastre... Bah! All right, all right! I purchased them from Lady Fran."},{"name":"HANCOCK","text":"Is this all what I think it is?"},{"name":"BWAGI","text":"(-Bwagi-)Enough Dalmascan red to keep a Bangaa happy for a long, long time. Amongst the royal sommeliers there was a Viera like Lady Fran. When word came the Garleans were approaching, she ordered the entirety of the Royal Palace's cellars delivered here where they'd be safe from the Empire."},{"name":"BWAGI","text":"(-Bwagi-)Seeing as the situation with the palace is what it is, I don't believe anyone would mind Lente's Tears using the wine to, say, fill the resistance's coffers."},{"name":"BWAGI","text":"(-Bwagi-)So, what is your offer?"},{"name":"HANCOCK","text":"If this many bottles were to make it to market, the price would fall like a phurble from an oak! I would be ruined!"},{"name":"RINOK","text":"(-Rinok-)And here I thought they said you were a shrewd one. Now if it were <span class=\"emphasis\">I</span> to acquire this much wine, I reckon I would only release a few bottles at a time to ensure...what would you call it? Maximum profits?"},{"name":"FRAN","text":"(-Fran-)Rinok, there's no need to be rude to our guest."},{"name":"FRAN","text":"(-Fran-)You told me before that the East Aldenard Trading Company could not provide the Dalmascan resistance with aid as it would not be good for business. So, I offer you something that will."},{"name":"FRAN","text":"(-Fran-)Do you...accept?"},{"name":"HANCOCK","text":"N-Not that it transpired anything like that, mind you! Ahem!"},{"name":"HANCOCK","text":"So... Would you care to purchase a bottle? I jest, I jest!"},{"name":"HANCOCK","text":"Now take a bottle and consider it my apo-apolo-polo─ Ahem! And consider it the last you'll get from me."},{"name":"HANCOCK","text":"Er... Take...<span class=\"emphasis\">two</span> bottles?"},{"name":"HANCOCK","text":"...All three?"},{"name":"WANDERINGWRITER","text":"Enough, <span class=\"highlight\">Forename</span>. Poor Hancock looks as if he has lost his mistress to a morbol. Three bottles is more than fair to see your wounded honor restored."},{"name":"WANDERINGWRITER","text":"Think of it this way, <span class=\"highlight\">Forename</span>. If you hadn't saved the world from Ultima's bane, the High Seraph would most definitely have destroyed all that wine in the monastery simply out of spite. Meaning, you're entitled to at least those three."},{"name":"WANDERINGWRITER","text":"And, if you so desire, you can take one of those bottles back to Costa del Sol and set things right."},{"name":"WANDERINGWRITER","text":"Though, something tells me Master Gegeruju won't take kindly to you waltzing into his manor and demanding he exchange bottles for no apparent reason... Hm... Perhaps you might enlist the aid of that vintner from Wineport. What was his name again? Shamwow...Shamon...Shamani! Shamani Lohmani!"},{"name":"WANDERINGWRITER","text":"Think of it this way, <span class=\"highlight\">Forename</span>. If you hadn't saved the world from Ultima's bane, the High Seraph would most definitely have destroyed all that wine in the monastery, simply out of spite. Meaning, you're entitled to at least those three."},{"name":"WANDERINGWRITER","text":"And, if you so desire, you can take one of those bottles back to Costa del Sol and set things right."},{"name":"WANDERINGWRITER","text":"Though, something tells me Master Gegeruju won't take kindly to you waltzing into his manor and demanding he exchange bottles for no apparent reason... Hm... Perhaps you might enlist the aid of that vintner from Wineport. What was his name again? Shamwow...Shamon...Shamani! Shamani Lohmani!"},{"name":"SHAMANILOHMANI","text":"Wait─did you just say you have in your possession a bottle of <span class=\"emphasis\">genuine</span> Dalmascan red? By the Twelve, wherever did you find it!?"},{"name":"SHAMANILOHMANI","text":"Amazing... Simply amazing. And is it safe to assume you are here to right a past wrong─one involving a fancy bottle full of falsehoods and fabrications?"},{"name":"SHAMANILOHMANI","text":"Well, I am more than willing to help you sort out this sordid mess. If I had said something back when I learned you would be trading a bottle of Valens for mere Suhd Viandja, none of us would be in this position in the first place."},{"name":"SHAMANILOHMANI","text":"I shall accompany you to Master Gegeruju's seaside manor and explain to the man that the bottle you gave him had not been stored properly, and that we have come to exchange it with one that has. He is certain to believe the claim coming from me, his most trusted supplier."},{"name":"GEGERUJU","text":"Spoiled? Shamani! I am shocked to hear that such a careless mistake was made on your watch."},{"name":"SHAMANILOHMANI","text":"My deepest apologies, Master Gegeruju. I was not made aware of the error until recently, and have since been seeking to procure a replacement─the one I come bearing today."},{"name":"SHAMANILOHMANI","text":"Would you care to partake in its aroma? I find you will recognize hints of kukuru, cinnamon...and, if you hold the goblet at just the right angle, freshly cut rosemary. A veritable kaleidoscope of both opulence and refinement, if I do say so."},{"name":"SHAMANILOHMANI","text":"<span class=\"emphasis\">Without question</span>, this bottle <span class=\"emphasis\">most certainly</span> contains <span class=\"emphasis\">none other than</span> Dalmascan Valens."},{"name":"GEGERUJU","text":"I shall be the judge of that.<br>Mrmmm...yes... A florid banquet of...wooden...distinctions, hunkered beneath a...rhapsodic veil of undertones...and, uh...what you said."},{"name":"GEGERUJU","text":"Yes, this is, without doubt, a vintage Lea Monde! I accept your apology and will allow the exchange!"},{"name":"GEGERUJU","text":"You two! Fetch me the bottle, now!"},{"name":"SHAMANILOHMANI","text":"Again, my apologies, Master Gegeruju. I shall endeavor to prevent any similar oversights in the future. You have my word."},{"name":"GEGERUJU","text":"Yes, yes. But may I ask...what, exactly, are your plans for <span class=\"emphasis\">that</span> bottle?"},{"name":"SHAMANILOHMANI","text":"This? Why, dispose of it, of course. It is far too foul to even flavor a stew."},{"name":"GEGERUJU","text":"Then you wouldn't mind if I kept it, would you?"},{"name":"SHAMANILOHMANI","text":"Kept it...? But why?"},{"name":"GEGERUJU","text":"Why do you think? There is coin to be made! A little wax about the top and I can convince my fool colleagues back in Ul'dah that this is an authentic, <span class=\"emphasis\">sealed</span> bottle of Dalmascan red! And once the bidding ends, I'll have enough for another wing to my manor here!"},{"name":"SHAMANILOHMANI","text":"Master Gegeruju! Knowingly presenting someone with a bottle of wine understood to be of inferior quality? That would be... That would be... I could <span class=\"emphasis\">never</span> allow such a thing!"},{"name":"SHAMANILOHMANI","text":"Never! Never!"},{"name":"GEGERUJU","text":"What's one little bottle? I'll even give you a cut of the profits! A small cut."},{"name":"SHAMANILOHMANI","text":"I. Said. NEVER!"},{"name":"GEGERUJU","text":"And I said─ Ah!"},{"name":"GEGERUJU","text":"Now look what you've done! Ladies, hurry and collect those pieces. I have some animal glue in the bungalow─"},{"name":"SHAMANILOHMANI","text":"And...uh...a good day to you, too!"},{"name":"GEGERUJU","text":"Bah, what a waste!"},{"name":"SHAMANILOHMANI","text":"All's well that ends well, I suppose. The important thing is that we exchanged the bottles. Now, as to how this is all going to affect my future dealings with Master Gegeruju...you let me worry about that."},{"name":"SHAMANILOHMANI","text":"What's this? A second bottle of Lea Monde? For me? You know I cannot accept such a gift!"},{"name":"SHAMANILOHMANI","text":"There are literally <span class=\"emphasis\">thousands</span> more where this came from? Well, if that is the case, I suppose I can."},{"name":"SHAMANILOHMANI","text":"Thank you again for the wonderful gift. As a distributor of fine wines, rarely am I allowed the luxury of partaking in mine own supply. I shall truly enjoy this exception."},{"name":"SHAMANILOHMANI","text":"Perhaps I will even allow old Byrglaent a glass... Half a glass. Here's to hoping it will inspire his winery to even greater heights."},{"name":"SHAMANILOHMANI","text":"Hm? Is that another bottle I see there sticking its cork from your pack? Gods, those things truly are bottomless, aren't they!?"},{"name":"SHAMANILOHMANI","text":"Well, as happy as I would be to take it off your hands, I believe there is another far more deserving than I. You'll find poor Drest where he always is..."},{"name":"SHAMANILOHMANI","text":"Hopefully the bottle can provide Drest with even a moment's respite."},{"name":"DREST","text":"Why have you come back? There is nothing for you here... There is nothing for any of us..."},{"name":"DREST","text":"That bottle... Where did you─?<br>The scent... Home..."},{"name":"DREST","text":"I'm sorry... I just... I don't deserve this."},{"name":"DREST","text":"'Twas my wife... My wife who...always saved the corks."},{"name":"DREST","text":"Do you think she'd...she'd forgive me? If I told her I wasn't coming back..."},{"name":"DREST","text":"Would my brothers-in-arms? Would they allow me this...this respite...?"},{"name":"DREST","text":"Maybe it is time I asked them. They'll all be here soon... Just like they are every night. But tonight, I'll have brought them something..."},{"name":"DREST","text":"Thank you, friend. Thank you..."},{"name":"DREST","text":"Thank you, friend. The scents of home are not as frightening as I imagined they'd be..."},{"name":"WANDERINGWRITER","text":"You're back! And, my, far quicker than last time. Everything off with nary a hitch then, I presume."},{"name":"WANDERINGWRITER","text":"That is truly, <span class=\"emphasis\">truly</span> wonderful to hear...and I'm not simply saying that because there's been this nagging in my gut that's followed me since I asked you to fetch me some wine that fateful day."},{"name":"WANDERINGWRITER","text":"Please accept this as a token of my gratitude. I've been told you adventuring types fet─er, collect them, as well."}],"reward":{"gil":2604},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68725,68626]},"next":[68727]},"partials":[{"type":"npc","id":"1026029","obj":{"i":1026029,"n":"Wandering Dramaturge","l":2370,"q":4}},{"type":"quest","id":"68725","obj":{"i":68725,"n":"The City of Lost Angels","g":21,"l":"Kugane","s":90,"f":1}},{"type":"quest","id":"68626","obj":{"i":68626,"n":"My Power, My Pleasure, My Pain","g":21,"l":"Kugane","s":800}},{"type":"quest","id":"68727","obj":{"i":68727,"n":"Wok on By","g":21,"l":"Kugane","s":999}}]}