{"quest":{"name":"Out of the Blue","location":"Limsa Lominsa","id":68728,"patch":4.5,"sort":1,"icon":100830,"unlocksFunction":1,"eventIcon":71341,"issuer":1026928,"target":1026932,"genre":166,"journal":["A Yellowjacket in need is a Yellowjacket indeed.","A highly strung Yellowjacket is scanning the aetheryte plaza for bright-eyed adventurers when you happen to cross her line of sight. After calling you over, she explains that she is investigating a supposed blue mage, who has been selling soul crystals purportedly capable of bestowing mysterious abilities. However, many of his customers say these wares are worthless, after receiving no such benefits. Since the Yellowjacket has little experience dealing with magic or crystals, she enlists your help to determine the authenticity of the alleged fraud's claims.","The self-proclaimed blue mage known as Martyn has set out his wares in the fields of Summerford and has gathered a small crowd of interested adventurers. He reveals that this esoteric school of magic was introduced to him by the Whalaqee people of the New World and its spells are learned from wild creatures by emulating the aetherial manipulation they use as self-defense. Martyn then proceeds to demonstrate an impressive selection of spells, leaving the onlookers awestruck. One potential customer raises concerns as to the risks involved with coming into close contact with ferocious beasts, leaving the others unsure about the validity of such a discipline. It is at this moment that two bloodthirsty Mamool Ja burst onto the scene, threatening to devour the adventurers, only to be stopped in their tracks by Martyn, who bombards them with yet more blue magic, sending them fleeing for their lives. This final display tips the scales in his favor and sets the crowd clamoring for the soul crystals, blue mage garments, and spellbooks that he has on offer. The Yellowjacket, however, still harbors doubts and believes the entire sales pitch to be nothing more than an elaborate ruse.","Hoping to gain further information on Martyn's activities, the Yellowjacket has pursued him as far as the La Thagran Checkpoint. It appears that his next destination is the Moraby Drydocks, where you hope to gain more information about this suspicious character's recent activities.","The guards at the Drydocks have seen Martyn scrounging for scraps of food from the mess hall, which strikes you as bizarre considering the amount of coin he seems to be making from the sales of his crystals. Although you and the Yellowjacket were unable to collar the man suspected of fraud, you have received information that he is heading in the direction of the Salt Strand.","Just as the Yellowjacket predicted, Martyn is in league with the two Mamool Ja, and their attack was staged to help sell the rather dubious merchandise to unsuspecting adventurers. When Martyn is faced with charges of fraud, he openly admits employing underhanded methods, but is adamant that the goods are exactly as described. He insists that any customer claiming that they failed to acquire any spells after purchasing a soul crystal has neglected to follow the instructions provided. The Yellowjacket, being unlearned in aetherial control, asks whether you would be willing to try Martyn's methods to learn a blue magic spell, and you reluctantly agree. The Mamool Ja assistants draw out a kraken to teach you the Water Cannon spell, and although the beast is considerably larger than anticipated, you bravely run to confront it. The blue magic focus you wield, being entirely bereft of any magical properties, serves as little more than a lightweight cudgel as you proceed to pummel the creature into submission, all the while fending off jets of high-pressured water. After you narrowly secure victory, Martyn is confident that you have adequately proven the authenticity of the soul crystal and requests that you return the blue mage paraphernalia. The Yellowjacket, on the other hand, remains unconvinced and requires more substantial evidence before lifting the charges.","Realizing that he must do more to escape arrest, Martyn foists upon you a full set of blue mage merchandise free of charge, in hopes that you will serve as living proof of the efficacy of his methods. While you are under no obligation to assist him any more than you already have, nonetheless, you accept the gift. Despite initially being part of the effort to secure his arrest, it seems you have been coerced into becoming his accomplice."],"objectives":["Rendezvous with the zealous Yellowjacket in Summerford.","Speak with the zealous Yellowjacket.","Rendezvous with the zealous Yellowjacket at the Moraby Drydocks.","Rendezvous with the zealous Yellowjacket at the Salt Strand.","Speak with Martyn."],"dialogue":[{"name":"RESOLUTEYELLOWJACKET","text":"You there! Would I be right in guessing you're an adventurer? If so, I've a request to make."},{"name":"RESOLUTEYELLOWJACKET","text":"We've had reports of some charlatan claiming to be a “blue mage,” whatever that's supposed to be. He could be a blue-arsed wharf rat for all I care, but I hear he's selling so-called soul crystals to adventurers for a tidy sum."},{"name":"RESOLUTEYELLOWJACKET","text":"Apparently, they're meant to give the holder all sorts of mystical powers, which is a load of chocobo shite according to a dozen or so dissatisfied customers."},{"name":"RESOLUTEYELLOWJACKET","text":"You see, spells and whatnot are not really my field of expertise, which is why I want you to help me investigate. I need you to tell me whether these crystals are the genuine article."},{"name":"RESOLUTEYELLOWJACKET","text":"If they turn out to be fakes, I'll arrest him on charges of fraud and you will receive fair payment for your assistance. And if they by some miracle end up doing what he claims, you might be able to pick up a new parlor trick or two. So, are you in?"},{"name":"RESOLUTEYELLOWJACKET","text":"Very good. We've received word he's haranguing passersby near Summerford Farms. I'll meet you there."},{"name":"RESOLUTEYELLOWJACKET","text":"You got here just in time. It looks like he's about to make his pitch."},{"name":"MARTYN","text":"(-Supposed Blue Mage-)Greetin's, ladies and gentlemen! The name's Martyn, and today I present to you a wonder of the New World. I call it “blue magic”!"},{"name":"MARTYN","text":"Beyond the Indigo Deep live the Whalaqee, who have their own unique brand of spellcastin'."},{"name":"MARTYN","text":"Like black and white magic, it draws on aether from our surroundin's, but that's where the similarities end, my friends."},{"name":"MARTYN","text":"I'm sure you've all seen wild creatures lashin' out with fire, ice, and what have you. It's a form of self-defense, see, but it's still magic."},{"name":"MARTYN","text":"The Whalaqee discovered how to harness aether in the same way, and wield the forces of nature."},{"name":"MARTYN","text":"\"But how!?“ I hear you cry. It's simple! You have to attune your mind to the instincts of the beast! When a creature is driven to attack, you can see into its soul. When you overcome it in battle, you absorb some of its aether and make its power your own!"},{"name":"MARTYN","text":"'Course, it's not as easy as pickin' fights with the local wildlife. But my Whalaqee mentors taught me well, and now it's my turn to teach you!"},{"name":"MARTYN","text":"Behold! The power of blue magic!"},{"name":"ADVENTURERA","text":"By the Twelve! Did you see that!?"},{"name":"MARTYN","text":"I thought you'd be impressed. Now before anyone asks why it's called “blue” magic, let me tell you. For the Whalaqee, this color holds special meanin'. Sacred, even. And seein' as this ain't white or black magic, it seemed like the perfect fit."},{"name":"MARTYN","text":"I suppose you're all also wonderin' what you need to become a blue mage like me."},{"name":"MARTYN","text":"Well, for starters, you'll be wantin' one of these─a soul crystal. And don't forget a specially designed outfit to help you look the part!"},{"name":"MARTYN","text":"I'll even throw in one of these spellbooks, personally penned by yours truly, containin' everythin' you need to know about learnin' blue magic. I've got enough for all of you, but you'd better snap them up before it's too late!"},{"name":"ADVENTURERB","text":"(-???-)Are you lot really that dense? Can't you see he's playing you for fools?"},{"name":"ADVENTURERB","text":"\"Drive the beast to attack?“ More like ”run headlong into battle with only a silly blue costume for protection!“ Of course, no one can claim it's fraud when they're at the bottom of some creature's belly."},{"name":"LATOOLJA","text":"(-Rampaging Mamool Ja-)We feast on your flesh, smoothskins! Your gods cannot save you now!"},{"name":"MARTYN","text":"All of you, stay back!"},{"name":"LATOOLJA","text":"(-Rampaging Mamool Ja-)No more! Please spare us!"},{"name":"ADVENTURERA","text":"They never stood a chance! Bugger all this swords and shields nonsense─I'm giving blue magic a try!"},{"name":"RESOLUTEYELLOWJACKET","text":"There's definitely something fishy going on here, and the arrival of those Mamool Ja was a little too timely for my liking. Come on, let's see where he goes next."},{"name":"RESOLUTEYELLOWJACKET","text":"It looks like he's heading for the Moraby Drydocks. Follow me!"},{"name":"RESOLUTEYELLOWJACKET","text":"According to one of the guards, this Martyn character has been seen skulking around the docks over the last few days."},{"name":"RESOLUTEYELLOWJACKET","text":"Apparently, he's been begging for leftovers from the mess hall. Considering that he's making gil hand over fist from gullible adventurers, this strikes me as more than a little odd. Anyway, he was last spotted making his way to the Salt Strand. Let's go!"},{"name":"RESOLUTEYELLOWJACKET","text":"Just as I suspected─he's up to no good. Why else would he come all the way to a place like this?"},{"name":"LATOOLJA","text":"(-Dazed Mamool Ja-)Martyn, you say you be less violent this time, but that was very violent! Very violent indeed!"},{"name":"MARTYN","text":"It all adds to the realism! And you lads did a great job. “Your gods cannot save you now!” Nice improvisation! That one bloke damn near shat himself."},{"name":"RESOLUTEYELLOWJACKET","text":"I think we've seen enough."},{"name":"RESOLUTEYELLOWJACKET","text":"Hold it right there! I'm placing you under arrest on charges of fraud!"},{"name":"MARTYN","text":"Fraud!? This is all a big misunderstandin'!"},{"name":"RESOLUTEYELLOWJACKET","text":"You can't pull the wool over my eyes─the game's up! And the same goes for you two. I knew you were in cahoots from the very beginning. As for those crystals, I'm about as convinced by them as I was by your acting."},{"name":"MARTYN","text":"Say what you will about our sales technique, but there's nothin' dodgy with the merchandise!"},{"name":"MARTYN","text":"I'll have you know I poured my heart and soul into those crystals, and the spellbooks explain how to learn the magic. It ain't my fault if the buyers can't be arsed to read them."},{"name":"MARTYN","text":"And if you're thinkin' about clappin' me in irons over the outfits not providin' enough protection, I can assure you they were tailored especially with the needs of a blue mage in mind. I'll admit, I had to cut a few corners to keep the cost down, but still..."},{"name":"RESOLUTEYELLOWJACKET","text":"It all boils down to whether the soul crystals are genuine or not."},{"name":"RESOLUTEYELLOWJACKET","text":"I know it's a lot to ask, but would you try this blue magic of his?"},{"name":"MARTYN","text":"Come on, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mate</span></span>, don't be shy. Once you've learned your first spell, you'll know I ain't pullin' your leg. I'll even let you borrow one of the outfits."},{"name":"MARTYN","text":"Oh yes, very fetchin'. While you've been gettin' changed, Latool Ja and Gaheel Ja have been lurin' over a nice, cooperative baby kraken to teach you Water Cannon."},{"name":"MARTYN","text":"The bait's been laid, so one should turn up any moment now."},{"name":"LATOOLJA","text":"Run away! Run away!"},{"name":"MARTYN","text":"That's...a bit on the big side, lads."},{"name":"MARTYN","text":"Not to worry! All you have to do is give it a few licks with the patented blue magic focus, or “stick” if you prefer, and our tentacled friend'll return the favor...by firin' possibly quite painful jets of water at you. Oh, and try not to die!"},{"name":"MARTYN","text":"Impressive! After that little escapade, you should be able to fire your very own Water Cannon."},{"name":"MARTYN","text":"By the by, you don't, strictly speakin', need to be struck by the magic you're tryin' to learn─but that'll probably happen whether you want it to or not. In some cases, repeatedly. As long as you're the one the beast's after, its power should be yours. Assumin' you can defeat it."},{"name":"MARTYN","text":"You see, this is what most people don't realize about becomin' a blue mage. When you start out, you're like a blank slate. It takes a fair amount of recklessne─I mean bravery─to stare these creatures down and look into their souls."},{"name":"MARTYN","text":"It's a shame that not all of my customers have your determination, but that's hardly grounds for callin' me a fraud!"},{"name":"RESOLUTEYELLOWJACKET","text":"You don't think he's telling the truth, do you?"},{"name":"MARTYN","text":"Now that's settled, I'll be havin' my wares back, if you don't mind."},{"name":"RESOLUTEYELLOWJACKET","text":"Did you actually learn any blue magic?"},{"name":"LATOOLJA","text":"Gaheel Ja and Latool Ja very sorry about kraken. We not expect such a large one!"},{"name":"MAMOOLJASHOP","text":"Smoothskin courageous indeed!"},{"name":"MARTYN","text":"What's that? You still don't believe me? To be honest, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mate</span></span>, I don't know what more I can do."},{"name":"MARTYN","text":"Tell you what─why don't I give you a soul crystal, outfit, and spellbook for free? That way, as a fully fledged blue mage, you can act as livin' proof of my innocence. Sound fair to you?"},{"name":"SYSTEM","text":"Open the Blue Magic Spellbook under Character in the main menu to assign active actions."},{"name":"SYSTEM","text":"Blue Mage arms generally have no effect on your attributes. However, equipping armor and accessories that boost your Intelligence will greatly increase the damage dealt by your offensive magic."},{"name":"SYSTEM","text":"If you lose your blue mage gear, replacements can be purchased from Calamity salvagers in Limsa Lominsa, Gridania, and Ul'dah."}],"reward":{"action":11385,"items":[{"id":22747},{"id":22746},{"id":24587}]},"reqs":{"jobs":[{"lvl":50,"id":34}],"quests":[70058]},"next":[68729]},"partials":[{"type":"npc","id":"1026928","obj":{"i":1026928,"n":"Zealous Yellowjacket","l":29,"q":1}},{"type":"npc","id":"1026932","obj":{"i":1026932,"n":"Martyn","l":31,"q":2}},{"type":"action","id":"11385","obj":{"i":11385,"n":"Water Cannon","c":3253,"j":36,"t":2,"l":1}},{"type":"item","id":"22747","obj":{"i":22747,"n":"Soul of the Blue Mage","l":1,"c":26058,"t":62}},{"type":"item","id":"22746","obj":{"i":22746,"n":"Rainmaker","l":1,"c":39903,"t":105,"p":1000}},{"type":"item","id":"24587","obj":{"i":24587,"n":"True Blue Attire Coffer (IL 1)","l":1,"c":26509,"t":61}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}},{"type":"quest","id":"68729","obj":{"i":68729,"n":"Blue Leading the Blue","g":166,"l":"Lower La Noscea","s":10,"f":1}}]}