{"quest":{"name":"A Lone Wolf No More","location":"Kugane","id":68736,"patch":4.5,"sort":500,"eventIcon":71221,"issuer":1026860,"genre":107,"journal":["The news hawker is displaying a worrying degree of interest in you.","As you pass through Kugane, you are called over by a news hawker. Rather than attempting to sell you a local publication as one might expect, he instead asks if you are aware of someone known as the Kamuy Whisperer. Being familiar with several such mystical hounds, you have the sneaking suspicion that he is referring to you. He suggests that you visit his crimson-garbed employer in Namai, claiming only that it will be “worth your while.”","Shortly after arriving in Namai, you locate the news hawker's mysterious client, the wandering minstrel. Having wandered even further than usual, he wastes little time in revealing the reason for his visit. He wishes for you, as the Kamuy Whisperer, to call forth the fabled Kamuy of the Nine Tails, the most divine even among their mystical kind. The auspice is said to be centuries old, yet has led a life of solitude, the pain of living on while loved ones pass away being too much to bear. However, the creature yet searches for a companion it can consider its equal, and the itinerant bard believes that you have the necessary credentials. He hands you a magical fife and requests that you play it in a specific location in hopes that the legendary beast will heed your call.","Upon playing the fife, the Kamuy of the Nine Tails descends from the heavens. As formidable as its assembled kin may be, their powers pale in comparison to the might of the ferocious beast that has answered your summons. Yet for all its strength, you sense a gentle spirit, and it soon becomes clear that you are in no danger. The minstrel, coming to the same conclusion, steps forward for a closer look and conjures a heartfelt tanka to mark this fateful encounter. Finally, he says his farewells, wishing you luck in your adventures with the Kamuy of the Nine Tails."],"objectives":["Speak with the mysterious client in Namai.","Play the Fife of Nine Tails at the specified location."],"dialogue":[{"name":"PAPERDELIVERY","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Good morning</span><span class=\"alternative\">Good day</span></span>! This may seem rather out of the blue, but are you by any chance the Kamuy Whisperer?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That does sound a bit like me."},{"name":"A1","text":"I don't know who you are, and you're scaring me."},{"name":"PAPERDELIVERY","text":"Perhaps it <span class=\"emphasis\">is</span> you!"},{"name":"PAPERDELIVERY","text":"Ha ha! Come now, you have nothing to fear from me. I am but a simple messenger."},{"name":"PAPERDELIVERY","text":"You see, I've been asked to find the one who has tamed the seven kamuy of legend. If the information I received is accurate, I believe my search has come to an end."},{"name":"PAPERDELIVERY","text":"Should I locate the Kamuy Whisperer, I am to direct said person to Namai, where a bard dressed in crimson robes awaits. If you are indeed who I think you are, I am sure the trip will be worth your while!"},{"name":"PAPERDELIVERY","text":"My master has a habit of standing out wherever he goes, which should be especially true in a drab place like Namai."},{"name":"WANDERINGMINSTREL","text":"I have been expecting you, <span class=\"highlight\">Forename</span>. My prediction that you would indeed be the one to gather the seven kamuy has─much to my delight─been proven correct. After all, 'tis not the first time you have managed a feat of this nature."},{"name":"WANDERINGMINSTREL","text":"Ah, <span class=\"highlight\">Forename</span>. What a pleasant surprise! Long have I waited for the one who would bring together seven of the kamuy, but I never expected it would be you, my friend."},{"name":"WANDERINGMINSTREL","text":"You have formed an unbreakable bond with these mystical hounds, but what you may not know is that there is another, said to surpass them all─majestic and fearsome to behold. Do you have any inkling of whom I speak?"},{"name":"WANDERINGMINSTREL","text":"Why, 'tis none other than the Kamuy of the Nine Tails, an auspice said to have once soared across the skies of Doma. Many believe it to be immortal, able to overcome death itself, yet doomed to witness all it has come to cherish wither and fade from existence."},{"name":"WANDERINGMINSTREL","text":"Its howls echo through the valleys as it searches for one it considers to be its equal, that it may find a companion with whom to share eternity. While I cannot comment on your longevity, I daresay you otherwise possess the necessary credentials to be granted an audience."},{"name":"WANDERINGMINSTREL","text":"All that remains is to play this fife to summon the beast. You need not concern yourself with where I procured such an item, only that the Kamuy of the Nine Tails will heed its call should you be judged worthy."},{"name":"WANDERINGMINSTREL","text":"So, what say you, my friend? Will you place your trust in me and embark on this quest to befriend a divine being?"},{"name":"WANDERINGMINSTREL","text":"Naturally, I will be close at hand to observe, as I have in the past. I could not possibly miss the opportunity to bask in such a glorious spectacle! Will you permit me to attend?"},{"name":"WANDERINGMINSTREL","text":"I should also mention that I will be in attendance, watching this fateful encounter from a safe distance. Doubtless it will be the inspiration for glorious tales with which I shall enthrall my audiences. But I shan't interfere in the proceedings─on that you have my word."},{"name":"WANDERINGMINSTREL","text":"Splendid! Fortunately, I have already ascertained a suitable location, not far from here, where the view of the One River should provide the perfect backdrop."},{"name":"WANDERINGMINSTREL","text":"Once you arrive, take the fife in hand and let your soul pour forth as melody. Try not to let the fact that a professional musician is paying extremely close attention to your every note put you off. I am sure it will be an unforgettable performance!"},{"name":"WANDERINGMINSTREL","text":"(-???-)Such radiance, such magnificence. The Kamuy of the Nine Tails, most revered of its kind, is come!"},{"name":"WANDERINGMINSTREL","text":"Its days of wandering alone across the realm have come to an end. Indeed, you have earned your place alongside this divine being, my friend."},{"name":"WANDERINGMINSTREL","text":"Ah... To witness the Warrior of Light joined by the Kamuy of the Nine Tails and its brethren before my very eyes... 'Tis a moment that must be preserved in verse for future generations. Ahem!"},{"name":"WANDERINGMINSTREL","text":"Trailed by tails of nine, soaring across moonlit sky,<br>Restless traveler.<br>Summoned home by hero's call,<br>Kindred soul, adventurer."},{"name":"WANDERINGMINSTREL","text":"Yes, yes... I think I shall name this piece <span class=\"emphasis\">A Lone Wolf No More</span>. It shall serve as testament to the friendship between two great beings favored by the gods."},{"name":"WANDERINGMINSTREL","text":"That you are able to earn the respect of such heavenly creatures fills me with awe. You certainly seem to have a talent for it!"},{"name":"WANDERINGMINSTREL","text":"My retelling of today's events is sure to enrapture souls the world over. And perhaps they too will one day be fortunate enough to glimpse the two of you racing across the sky. Farewell, hero!"},{"name":"WANDERINGMINSTREL","text":"While I regale audiences with tales of your heroism, no doubt you and your newfound companion will be racing across the skies in search of adventure. As ever, I am eager to hear of your exploits, and will be counting the days until our next meeting. Until then, farewell!"}],"reward":{"gil":552,"items":[{"id":24625}]}},"partials":[{"type":"npc","id":"1026860","obj":{"i":1026860,"n":"News Hawker","l":2404,"q":1}},{"type":"item","id":"24625","obj":{"i":24625,"n":"Fabled Kamuy Fife","l":1,"c":26039,"t":63}}]}