{"quest":{"name":"Blue Gold","location":"Ul'dah","id":68733,"patch":4.5,"sort":400,"icon":100830,"unlocksFunction":1,"eventIcon":71341,"issuer":1026924,"target":1026953,"genre":166,"journal":["Latool Ja seems positively perturbed.","Latool Ja, in a state of panic, informs you that Martyn has been grievously wounded while performing in the Masked Carnivale, apparently a result of his exhaustion from appearing in a vastly increased number of shows. Just as you and Latool Ja are about to discuss what is to become of your training regime, Whastrach makes an unexpected arrival. Despite sharing a somewhat prickly relationship with Martyn, he offers to act as your mentor in his stead, and share his knowledge of blue magic. Although you have your suspicions, you agree to meet him in western Thanalan for your first lesson together.","Much to your surprise, you find Whastrach standing next to a magitek vanguard, which he says he had restored after it was abandoned by the Garleans. Since he apparently has no further use for it, he suggests using it as a target on which to practice your blue magic, neglecting to mention that the warmachina has been programmed to answer your assault with lethal force. Although you are accustomed to combating more organic foes, your spells prove to be equally effective against metallic opposition.","Whastrach praises your proficiency in the use of blue magic, although he views the art as a relic of a bygone age, along with all traditional disciplines of combat taught in Eorzea. He posits that the face of warfare has changed, leaving armed soldiers largely obsolete, with units of warmachina replacing them on the front lines. To power these magitek armies, vast amounts of ceruleum will be required, which Whastrach and his organization are looking to control. He even suggests that you would be well suited to serving his company in some unknown capacity, though he chooses not to pressure you into a decision at this juncture, giving you something to ponder on your way back to Ul'dah.","Outside the Celestium, your conversation with Whastrach is interrupted by Martyn, who has ignored the chirurgeon's orders and left the infirmary. To the surprise of everyone, Whastrach volunteers to assist in producing medicine and delivering it to the Whalaqee. While you cannot help but wonder how he came to know Martyn's closely guarded secret, a man of his influence and financial clout would be a valuable ally in the fight against the epidemic. Martyn clearly has reservations about letting Whastrach take over the operation while he remains bedridden, but swallows his pride and begrudgingly accepts. The ceruleum merchant leaves to begin the preparations, leaving Martyn free to voice his concerns, although he seems for the most part to have been convinced of Whastrach's sincerity. Fortunately for you, he has not forgotten about his promise to help you prepare for the Masked Carnivale, and recommends that you learn the spell Glower.<br><br>※The next blue mage quest will be available from Latool Ja upon reaching level 50 and learning Glower."],"objectives":["Rendezvous with Whastrach in Horizon's Edge and complete the training exercise.","Speak with Whastrach.","Speak with Whastrach in Ul'dah."],"dialogue":[{"name":"LATOOLJA","text":"Martyn says that 1000 Needles is very hard to learn. Painful, too. Have you managed it yet?"},{"name":"SYSTEM","text":"The next blue mage quest will be available from Latool Ja upon learning 1000 Needles."},{"name":"LATOOLJA","text":"<span class=\"highlight\">Forename</span>! Something terrible happen! Martyn almost killed!"},{"name":"LATOOLJA","text":"We told Martyn he work too hard, that he should rest. But he not listen! He wanted medical care for Whalaqee, but now he one who need help."},{"name":"LATOOLJA","text":"Of course, Martyn cannot train you. Latool Ja want to help, but..."},{"name":"WHASTRACH","text":"(-Familiar Voice-)\"...Martyn's such a great teacher that no one could possibly replace him!“ Is that what you were about to say?"},{"name":"WHASTRACH","text":"Ha ha, please excuse my little jest. I was as sorry as anyone to hear that my old friend had fallen foul of some pit beast. In fact, I came to offer my services."},{"name":"WHASTRACH","text":"I expect that Martyn neglected to mention that I too am a blue mage. We both studied under the Whalaqee as part of our research. While I am not one to boast, I should point out that I took to the art like a fish to water, while he...floundered."},{"name":"LATOOLJA","text":"Whastrach speak true. You can learn much from Whastrach."},{"name":"WHASTRACH","text":"Yes, with Martyn bedridden, it would be a shame for his protégé to be left without a mentor. And as his friend, overseeing your training is the least I can do. I will be waiting for you at Horizon's Edge."},{"name":"LATOOLJA","text":"Do not tell Martyn I say this, but I think Whastrach would be better mentor. Has Martyn taught you anything?"},{"name":"WHASTRACH","text":"Don't let the magitek fool you─I've no connection to the Empire. Well, not a direct one, at least. My company carries out work at a ceruleum processing plant run by Amajina & Sons Mineral Concern. Perhaps some of it ends up in imperial hands, perhaps not."},{"name":"WHASTRACH","text":"As for this vanguard, it was abandoned by the Garleans outside of Castrum Meridianum. It seemed like the perfect opportunity to learn something of their technology, so I had it restored."},{"name":"WHASTRACH","text":"Ever since we finished gleaning all we could from it, it's been collecting dust, so I have no qualms about letting you smash it to pieces as part of your training, assuming you are up to the challenge."},{"name":"Q1","text":"Are you ready?"},{"name":"WHASTRACH","text":"So, you have some rudimentary understanding of blue magic. But have you considered how─nay, whether─it serves you? For there is one thing I know that Martyn, at least, has yet to realize─the age of sword and sorcery is coming to an end."},{"name":"WHASTRACH","text":"Surely you have seen the power the Garleans wield. Their technology continues to advance, while we Eorzeans cling to our ancient ways. For now, we are able to keep the Empire at bay, but for how much longer?"},{"name":"WHASTRACH","text":"I am not the only one who feels this way. There are those who seek to develop airships and engines of war to combat the imperial threat. It will not be long before the Grand Companies deploy magitek units of their own on the front lines."},{"name":"WHASTRACH","text":"Even so, the most advanced weaponry will be worth little more than scrap metal without a steady supply of ceruleum. As we speak, the Garleans and the Immortal Flames are fighting to claim the supply in northern Thanalan."},{"name":"WHASTRACH","text":"What I am trying to tell you is that people like Martyn waste their time on worthless relics of the past and fail to see the bigger picture. The future lies in ceruleum. If you ever decide you want to make a real difference in this world, I could use someone like you."},{"name":"WHASTRACH","text":"There's no need to rush, though. Just give it some thought. Anyway, I think that's enough for one day─let's return to Ul'dah."},{"name":"LATOOLJA","text":"Whastrach look pleased. <span class=\"highlight\">Forename</span> show him 1000 Needles, yes?"},{"name":"WHASTRACH","text":"I have to say, I'm surprised that you've made so much progress with someone like Martyn as your mentor. Speaking of which, since he's still confined to the infirmary, your next training session will be─"},{"name":"MARTYN","text":"(-Martyn's Voice-)Oi! What do you think you're doin', Whastrach!?"},{"name":"LATOOLJA","text":"Martyn! Chirurgeon tell you to stay in bed!"},{"name":"MARTYN","text":"I'm fine! True, it still hurts to walk. And breathe. But how can I lie there when my apprentice is tryin' so hard to earn a spot next to me in the arena?"},{"name":"WHASTRACH","text":"You needn't worry about <span class=\"highlight\">Forename</span>. Even without your guidance, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is well on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> way to becoming a competent blue mage. Actually, while you're here, there is something I wish to discuss. A proposition, if you will."},{"name":"WHASTRACH","text":"I heard about the lengths you are going to for the sake of the Whalaqee. Why didn't you come to me?"},{"name":"MARTYN","text":"For what? You'd only laugh in my face as soon as you realized there's no money in it. Or have you forgotten what happened when our research fundin' got cut? All of a sudden, you couldn't give a Qiqirn's arse about blue magic and the people who'd shared their homes with us!"},{"name":"WHASTRACH","text":"That's hardly fair, Martyn. How could I carry on without bankrupting myself? Make no mistake, I'm as grateful to the Whalaqee as you are."},{"name":"WHASTRACH","text":"We may have gone our separate ways, but there's never been any bad blood between us. Seeing as you're in no position to help anyone from your sickbed, I'd say that letting me lend a hand is your best option."},{"name":"MARTYN","text":"I s'pose you've got a point."},{"name":"WHASTRACH","text":"The quicker we can produce the medicine, the more lives we'll save. With my resources, it'll be ready in no time."},{"name":"MARTYN","text":"All right, Whastrach. We'll do things your way."},{"name":"WHASTRACH","text":"I'm glad we could see eye to eye for a change. Once we have a large enough shipment, I'll deliver it in person to the Whalaqee."},{"name":"MARTYN","text":"Just don't bugger it up, you hear?"},{"name":"WHASTRACH","text":"You can count on me, Martyn. There is a lot at stake here, and I intend to see this through. I have a few arrangements to make first, but I'll come by for the formula once I'm done. Until then, you should get some rest."},{"name":"MARTYN","text":"You know, I never thought he'd raise a finger to help anyone but himself... Maybe he does have a shred of decency after all."},{"name":"MARTYN","text":"I hope he hasn't been puttin' any funny ideas in your head, though. It still seems strange that he's showin' an interest in your trainin' in the first place. What's in it for him? Hmm... I'm probably just overthinkin', as per usual."},{"name":"MARTYN","text":"I s'pose it's my fault for not bein' there for you. And you won't find anyone─besides me, of course─more qualified to teach blue magic. Unless you fancy makin' the trip to the New World, that is."},{"name":"MARTYN","text":"One thing I can do is tell you which spell you should be learnin' next. It's called “Glower,” one of my personal favorites."},{"name":"MARTYN","text":"If you can master this, I reckon you'll be ready to enter the Masked Carnivale! Best of luck, <span class=\"highlight\">Forename</span>!"},{"name":"MARTYN","text":"I should go back to bed if I want these wounds to heal. Since I won't be up and about for a while, you should continue to follow Latool Ja's lead for now."}],"reward":{"gil":754},"reqs":{"jobs":[{"lvl":40,"id":129}],"quests":[68732]},"next":[68734]},"partials":[{"type":"npc","id":"1026924","obj":{"i":1026924,"n":"Maudlin Latool Ja","l":41,"q":3}},{"type":"npc","id":"1026953","obj":{"i":1026953,"n":"Whastrach","l":41,"q":1}},{"type":"quest","id":"68732","obj":{"i":68732,"n":"Scream Blue Murder","g":166,"l":"Ul'dah","s":300,"f":1}},{"type":"quest","id":"68734","obj":{"i":68734,"n":"The Real Folk Blues","g":166,"l":"Ul'dah","s":500,"f":1}}]}