{"quest":{"name":"The Real Folk Blues","location":"Ul'dah","id":68734,"patch":4.5,"sort":500,"icon":100830,"unlocksFunction":1,"eventIcon":71341,"issuer":1026924,"target":1026937,"genre":166,"journal":["Latool Ja is doing a fine job of holding the fort in Martyn's absence.","Latool Ja informs Martyn that you have learned the Glower spell, prompting your mentor to ignore the chirurgeon's advice once again and leave his sickbed to congratulate you. This achievement, however, pales in comparison to another piece of welcome news he has received─Whastrach has successfully delivered the medicine to the Whalaqee and the epidemic afflicting them has been eradicated. Unfortunately, Martyn's jubilations are short-lived when Ceadda, the young chirurgeon of the New World tribe, arrives with ill tidings. Whastrach has apparently taken lands sacred to the Whalaqee as his own, in an obvious attempt to seize the ceruleum-rich Lapis Canyon. Martyn is livid at the treachery of the man in whom he placed his trust, and rushes off to confront him at the processing plant in northern Thanalan.","You arrive to find Martyn and Ceadda already in the midst of a heated debate with Whastrach. The self-styled businessman states that the Whalaqee lands were acquired through a legally binding contract in exchange for the shipment of medicine and that the ceruleum mine he plans to open will give the Whalaqee an opportunity to become part of the modern world. Ceadda and Martyn vehemently disagree, saying that the elders were tricked into the agreement and that it is not for Whastrach to decide how they should live their lives. As the two sides reach an impasse, Royse interrupts to make a surprising revelation─not only is she Whastrach's financial backer, but she also told him of Martyn's plan to produce medicine for the Whalaqee. Although she was unaware of the extent of Whastrach's plans, she cannot decide which side of the argument she should support. To settle the matter, she suggests that Martyn and Whastrach meet in the Celestium and battle as blue mages, and promises to withdraw her investment should Martyn win. However, if he loses, he will be forced to persuade the Whalaqee to surrender their lands as per the agreement. Since Martyn is still recovering from his earlier injuries, you are selected to take his place, assuming the guise of “Azuro the Second.”","Back in Ul'dah, you participate in a practice demonstration of your spells, bedecked in your new Masked Carnivale outfit. It is then that Whastrach enters dressed as the terrifying Azulmagia, resembling a demon in more than simply outward appearance. You finally understand why his prowess as a blue mage is held in such high regard, as he unleashes an array of astonishingly potent magicks.","With your climactic encounter on the horizon, Royse suggests entering matches against her pit fiends first to hone your skills before facing your mentor's hated rival. Azulmagia awaits you in the final stage of the Masked Carnivale, but will your blue magic be enough to overcome him?<br><br>※The next blue mage quest will be available from Latool Ja after completing stage 25 of the Masked Carnivale."],"objectives":["Search for Martyn at the Ceruleum Processing Plant in northern Thanalan.","Speak with Royse in Ul'dah.","Speak with Royse."],"dialogue":[{"name":"LATOOLJA","text":"<span class=\"highlight\">Forename</span> learn Glower? Oh... <span class=\"highlight\">Forename</span> will master it soon. Latool Ja believe in you!"},{"name":"SYSTEM","text":"The next blue mage quest will be available from Latool Ja upon learning Glower."},{"name":"LATOOLJA","text":"<span class=\"highlight\">Forename</span> learned Glower, yes? Then <span class=\"highlight\">Forename</span> succeeded, just as Martyn said."},{"name":"LATOOLJA","text":"Latool Ja will tell Martyn."},{"name":"MARTYN","text":"You did it, <span class=\"highlight\">Forename</span>! You've done me proud! And that's not the only cause for celebration..."},{"name":"MARTYN","text":"I received a missive saying that Whastrach was as good as his word─the medicine worked and the Whalaqee are saved!"},{"name":"NEWWORLDBOY","text":"(-Young Man-)Martyn! I've been looking everywhere for you!"},{"name":"MARTYN","text":"Ceadda!? How did you get here?"},{"name":"NEWWORLDBOY","text":"Never mind that! I have something urgent to tell you!"},{"name":"MARTYN","text":"<span class=\"highlight\">Forename</span>, this is Ceadda, the Whalaqee chirurgeon I told you about. He learned to speak the common tongue of Eorzea, and─"},{"name":"NEWWORLDBOY","text":"Will you listen!? It's Whastrach─he brought the medicine, and everyone with the disease has been cured."},{"name":"NEWWORLDBOY","text":"But he wasn't content to simply give it to us─he's used it to lay claim to Lapis Canyon!"},{"name":"MARTYN","text":"But why would he...?"},{"name":"MARTYN","text":"Of course! The ceruleum!"},{"name":"MARTYN","text":"Lapis Canyon is sacred ground, and glows a bright blue because of all the ceruleum beneath the surface."},{"name":"MARTYN","text":"That bastard was after it from the beginnin'. He must be at the processin' plant! Come on, Ceadda─let's go!"},{"name":"LATOOLJA","text":"Martyn, stop! Ah... Very quick for man who lie in bed for many days."},{"name":"LATOOLJA","text":"Can <span class=\"highlight\">Forename</span> go with them? I worry that Martyn bite off more than Martyn can swallow. Or is that “chew?”"},{"name":"LATOOLJA","text":"As far as Latool Ja know, processing plant in northern Thanalan. Make sure Martyn not do anything stupid!"},{"name":"LATOOLJA","text":"Martyn never listen to chirurgeon. Martyn never listen to anyone."},{"name":"NEWWORLDBOY","text":"The Whalaqee have lived in the light of Lapis Canyon for generations. We can't let it be destroyed by Whastrach's men!"},{"name":"WHASTRACH","text":"Why must he be so stubborn?"},{"name":"MARTYN","text":"You only gave them the medicine so you could steal Lapis Canyon!"},{"name":"WHASTRACH","text":"\"Steal?“ Don't speak to me like some common thief! I won't deny that obtaining the ceruleum was my primary concern, but we signed an agreement. It's all perfectly legal, I assure you."},{"name":"NEWWORLDBOY","text":"You know full well the elders can't read Eorzean! You told them that if they didn't sign the contract, they couldn't have the medicine. And besides, your laws don't apply to the Whalaqee!"},{"name":"WHASTRACH","text":"Even so, I expect your elders to honor the promise they made, legally binding or not."},{"name":"WHASTRACH","text":"Perhaps you have forgotten that the medicine was paid for and produced by my company. Before the negotiations began, I had already spent vast amounts to manufacture a large enough shipment to treat everyone."},{"name":"WHASTRACH","text":"I saved your tribe from annihilation, and this is how you repay me? I've given you all a second chance to lead healthy, productive lives."},{"name":"NEWWORLDBOY","text":"You took advantage of our suffering so that you could plunder the thing most precious to us! Since the time of my ancestors, Lapis Canyon has been at the center of our beliefs, of everything we do!"},{"name":"WHASTRACH","text":"Beliefs? Come now, don't be absurd! That blue substance you call the “lifeblood of the planet” is ceruleum, a type of fuel. It's not doing any good just sitting there underground."},{"name":"WHASTRACH","text":"Once I open a mine in Lapis Canyon, I hope to employ the Whalaqee, offering you all an opportunity to earn a proper wage."},{"name":"WHASTRACH","text":"When you realize what you've been missing all this time, you'll soon forget about your superstitions."},{"name":"MARTYN","text":"How bloody dare you! Who are you to call them superstitions!? This is their way of life, and all you want to do is destroy it for the sake of your own greed!"},{"name":"WHASTRACH","text":"I'm doing more for the Whalaqee than you ever will! I'm giving them a chance to build a better future for themselves. They can either be part of the modern world, or be left behind!"},{"name":"MARTYN","text":"That's not your decision to make!"},{"name":"WHASTRACH","text":"What about the medicine!? That was a product of Eorzean society. Without it, they'd all be dead! And another thing─my investor funded its production for a share of the profits from my New World enterprise!"},{"name":"ROYSE","text":"(-Familiar Voice-)Darlings, darlings! There's no need to squabble!"},{"name":"ROYSE","text":"I admit it, I'm Whastrach's backer. It all started when I told him about Martyn's plan to save the Whalaqee from the epidemic. You see, the prospect of trading with the New World sounded rather promising, though this is the first I've heard of the ceruleum mine."},{"name":"ROYSE","text":"Expanding into new regions often leads to resistance from the locals, but this is far beyond what I was expecting. Whastrach─I don't like being kept in the dark. I'm seriously considering withdrawing from our deal!"},{"name":"ROYSE","text":"That said, I can see this being a worthwhile venture, providing that the Whalaqee are not being exploited. But I also agree with Martyn that their way of life should not be disrupted. As you can see, this leaves me with a difficult choice..."},{"name":"ROYSE","text":"Which is why I propose that the two of you settle this in the arena! Whastrach, you're a blue mage yourself, correct?"},{"name":"WHASTRACH","text":"I am indeed. Though I should warn you, Martyn was never a match for me, even before he was chewed up and spat out by one of your pets."},{"name":"ROYSE","text":"Then perhaps it's time for his apprentice, “Azuro the Second,” to make <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> grand debut!"},{"name":"ROYSE","text":"I can picture it now─the ultimate clash of blue magic! The loyal disciple of the Great Azuro faces a mysterious challenger to determine who is the superior spellcaster!"},{"name":"ROYSE","text":"If <span class=\"highlight\">Forename</span> wins, I'll cut off my funding for the Lapis Canyon project, and the lands will return to their original owners. And if Whastrach is victorious, Martyn must act as intermediary for the Whalaqee and persuade them to agree to the development."},{"name":"MARTYN","text":"Royse, you can do what you like with that money of yours, but you can't expect me to go along with this!"},{"name":"WHASTRACH","text":"For such an old-fashioned sort of fellow, Martyn seems to forget that disputes such as these have been decided by combat since ancient times."},{"name":"WHASTRACH","text":"I, for one, have no objections! Count me in!"},{"name":"MARTYN","text":"What about the Whalaqee!? They should be the ones to decide their own fate, not us!"},{"name":"NEWWORLDBOY","text":"You're right, Martyn, but we have a similar tradition. When two sides cannot reach an agreement, a representative from each takes part in a contest of strength."},{"name":"NEWWORLDBOY","text":"Ideally, one of my people would be chosen, but we are in Eorzea, and I have no choice but to ask you to participate on our behalf. So, will you do it, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll fight─for what is right!"},{"name":"A1","text":"I'll fight─for Martyn!"},{"name":"A1","text":"What am I getting myself into?"},{"name":"ROYSE","text":"Very gallant of you, my dear! The crowd'll lap this up!"},{"name":"ROYSE","text":"What a noble way to express your gratitude to your mentor! Perhaps we can use this in the performance..."},{"name":"ROYSE","text":"I know, dear, it's a lot of responsibility. And for your debut match, no less! But as the boy says─it must be you."},{"name":"ROYSE","text":"First things first, let's get you two into your costumes and take a look at that magic of yours. I want to know what my audience will be getting when the big day arrives. Come along!"},{"name":"MARTYN","text":"Bloody hells! How did we let Royse talk us into this?"},{"name":"WHASTRACH","text":"I've always liked you, <span class=\"highlight\">Forename</span>, so it's a shame I'll have to give you a damned good thrashing in front of all of those people. I have a lot at stake, so don't expect me to hold anything back."},{"name":"LATOOLJA","text":"Thank you for bringing Martyn back to Ul'dah. Latool Ja glad he unharmed, but he in very strange mood. Latool Ja want to know what is going on!"},{"name":"NEWWORLDBOY","text":"Please, you must defeat Whastrach. He's a cruel, heartless man, so don't show him any mercy!"},{"name":"ROYSE","text":"Once you've both changed into your new costumes, I'll see you in the arena. This way, my darlings!"},{"name":"ROYSE","text":"<span class=\"highlight\">Forename</span>, my dear! Are you ready?"},{"name":"LATOOLJA","text":"But you...missed..."},{"name":"MAMOOLJASHOP","text":"Hahaha! No, Gaheel Ja not think so!"},{"name":"ROYSE","text":"Wonderful, my dear. It seems a new hero is born!"},{"name":"ROYSE","text":"Now it's Whastrach's turn. Pay close attention to the costume, darlings─it's my finest creation yet!"},{"name":"MAMOOLJASHOP","text":"Such...power..."},{"name":"ROYSE","text":"The dread warlock who transcends dimensions of time and space─Azulmagia!"},{"name":"WHASTRACH","text":"Why must I be the villain?"},{"name":"ROYSE","text":"It's all part of the act, my dear! What could be more thrilling than an epic struggle between good and evil?"},{"name":"MARTYN","text":"You mean to tell me Whastrach is inside that thing? And why's he floatin'?"},{"name":"ROYSE","text":"For dramatic effect, of course! If you must know, it's a ceruleum levitation device. Surprisingly cheap too. Apparently, there isn't much practical application for the ability to float a few ilms off of the ground."},{"name":"WHASTRACH","text":"I'm still not convinced it's entirely necessary, and the costume is rather more flamboyant than I would've liked. But if I'm going to do this, I may as well enjoy myself. I'll show the audience what real blue magic looks like!"},{"name":"ROYSE","text":"That's what I like to hear. It's sure to be a performance they'll never forget, right here at the Masked Carnivale!"},{"name":"ROYSE","text":"Not to put too fine a point on it, <span class=\"highlight\">Forename</span> my dear, but I think you'd benefit from some practice before starring in the main event."},{"name":"WHASTRACH","text":"Hahaha! Train all you want─it will make no difference. Lapis Canyon is mine!"},{"name":"MARTYN","text":"I still can't believe this is happenin'..."},{"name":"LATOOLJA","text":"<span class=\"highlight\">Forename</span>'s Glower very painful... Not refreshing, either. Only painful."},{"name":"NEWWORLDBOY","text":"Don't let Whastrach intimidate you. I know you can beat him!"},{"name":"ROYSE","text":"I'd say you're ready to take part in the Masked Carnivale, although I'd recommend testing your skills against less challenging opponents before facing Azulmagia."},{"name":"ROYSE","text":"I have gathered quite the menagerie of exotic beasts, but you should choose with care. We try to call an end to the performance before either side incurs any serious injury, but as Martyn will attest, accidents can happen."},{"name":"ROYSE","text":"Once you feel confident in your abilities, say the word and I will grant you and Azulmagia the opportunity to settle this feud. Until then, fight well, but don't do anything rash. I might struggle to find <span class=\"emphasis\">another</span> replacement blue mage..."},{"name":"MARTYN","text":"That Royse... She's a real piece of work, ain't she? I s'pose if I'd seen this comin', we wouldn't be in this mess."},{"name":"NEWWORLDBOY","text":"It's up to you now, <span class=\"highlight\">Forename</span>!"},{"name":"MARTYN","text":"He's right. If only I hadn't been damn near killed in that bloody show, I could've dealt with him myself. Well, I'd like to think I'd have a chance of winnin', but he was always the better mage."},{"name":"MARTYN","text":"To be honest, though, I think you've got a real talent for blue magic. In fact, you shouldn't be scared of Whastrach─he should be scared of you!"},{"name":"MARTYN","text":"With the right spells, I reckon you'll be able to take him down a peg or two. Now get out there and show him what you're made of!"},{"name":"MARTYN","text":"Ugh... Look at me, gettin' all worked up like that. I'd better head back before the chirurgeon realizes I've gone. Hopefully I'll be allowed out of the infirmary to watch some of your performances, though. Best of luck, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"The Masked Carnivale has been unlocked. To participate, speak with the Celestium attendant in Onyx Lane."}],"reward":{"gil":952,"items":[{"id":24551},{"id":24588}]},"reqs":{"jobs":[{"lvl":50,"id":129}],"quests":[68733]},"next":[68735]},"partials":[{"type":"npc","id":"1026924","obj":{"i":1026924,"n":"Maudlin Latool Ja","l":41,"q":3}},{"type":"npc","id":"1026937","obj":{"i":1026937,"n":"Royse","l":41,"q":3}},{"type":"item","id":"24551","obj":{"i":24551,"n":"The Spirit of the Whalaqee","l":130,"c":39902,"t":105,"p":1000}},{"type":"item","id":"24588","obj":{"i":24588,"n":"Magus's Attire Coffer (IL 130)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68733","obj":{"i":68733,"n":"Blue Gold","g":166,"l":"Ul'dah","s":400,"f":1}},{"type":"quest","id":"68735","obj":{"i":68735,"n":"Turning Over a Blue Leaf","g":166,"l":"Ul'dah","s":501,"f":1}}]}