{"quest":{"name":"Blue Collar Work","location":"Ul'dah","id":68730,"patch":4.5,"sort":100,"icon":100830,"unlocksFunction":1,"eventIcon":71341,"issuer":1026852,"target":1026852,"genre":166,"journal":["Martyn has found time between performances to train you in the ways of blue magic.","Having mastered Blood Drain, you return to Martyn, eager to continue your training. As the Great Azuro, he has already gained something of a following, and a small group of fans interrupts your conversation to have him perform his─apparently─customary pre-fight speech. While he seems to be relishing his newfound stardom rather more than anyone had anticipated, he finds time in his busy schedule to impart to you his knowledge, and arranges to meet you in Spineless Basin in central Thanalan.","The rocky landscape of central Thanalan is plagued with hordes of vicious hornets, and the area where you rendezvous with Martyn is home to a particularly lethal variety. He suggests that you test your recently acquired Blood Drain spell on these vilekin, so that you may gain valuable experience in using blue magic against a genuine threat.","A barrage of spells soon puts paid to the man-eating hornet's attempts to sting you to death. It is slowly becoming apparent that blue magic may yet serve as a viable means of dispatching a variety of threats, and that Martyn's claims of its endless potential may be founded in fact after all.","On your way back to Martyn, you find him accepting payment from a local merchant for exterminating the very same buzzing pest you were sent to slay. Although you are quick to express your displeasure at being asked to carry out menial tasks in the name of “training,” your blue mage mentor weasels out of it with practiced ease, and offers to pay your share once you have returned to Ul'dah.","Martyn is under the impression that the training session in Thanalan has yielded the desired results, while you cannot shake the feeling that it was a thinly veiled ploy to earn a few extra gil at your expense. In an attempt to prove that he has not entirely forgotten about mentoring you in blue magic, he sets you the task of learning another spell, namely, Mind Blast.<br><br>※The next blue mage quest will be available from Martyn upon reaching level 20 and learning Mind Blast."],"objectives":["Rendezvous with Martyn at Spineless Basin in central Thanalan.","Survey the designated location and slay any man-eating hornets that appear.","Report to Martyn.","Speak with Martyn in Ul'dah."],"dialogue":[{"name":"MARTYN","text":"How are you gettin' on with that spellbook? If you don't know where to learn Blood Drain, it might be worth havin' a quick read first."},{"name":"SYSTEM","text":"The next blue mage quest will be available from Martyn upon learning Blood Drain."},{"name":"MARTYN","text":"Well, well! If it ain't my gifted apprentice, <span class=\"highlight\">Forename</span>! Before you say anything, let me guess. You're here because you've learned Blood Drain and you want to hear my next bit of advice. I'm right, aren't I?"},{"name":"MARTYN","text":"The next step is to─"},{"name":"WOMANA03194","text":"(-Starstruck Fan-)It's him! The Great Azuro!"},{"name":"WOMANB03194","text":"It's like all my namedays have come at once!"},{"name":"WOMANC03194","text":"Please, say it for us one more time!"},{"name":"MARTYN","text":"Haha! How could I refuse my adoring public? Ahem!"},{"name":"MARTYN","text":"Master of knowledge beyond the comprehension of mere mortals, and wielder of arcane magicks as unfathomable as the deepest ocean... Hearken, foul beasts─the indomitable keeper of the blue has come!"},{"name":"MARTYN","text":"'Tis I, the Great Azuro!"},{"name":"WOMANA03194","text":"(-Starstruck Fan-)He said it! He actually said it!"},{"name":"MARTYN","text":"Sorry about that. Just doin' my bit to keep the coin rollin' in. Where were we? Ah, yes. I know a great spot for a bit of trainin'. Meet me at Spineless Basin─I'll explain everythin' when we get there."},{"name":"LATOOLJA","text":"When Martyn put on mask, he become Great Azuro and crowd cheer for him. But the Great Azuro has strange voice, so Latool Ja prefers him without mask."},{"name":"MARTYN","text":"Glad to see you survived the trek. I hope the hornets didn't give you any bother! In fact, they're the reason we're here. There are some especially angry ones that would be perfect targets for practicin' your blue magic."},{"name":"MARTYN","text":"They're tough, but not too tough. Some folk call them “man-eaters” but I think that's an exaggeration. Anyway, why not give Blood Drain a try? It'll draw out some of the enemy's aether to help you cast more spells!"},{"name":"MARTYN","text":"I think I saw a few buzzin' around over there. Even if you don't have many spells, Blood Drain should be enough!"},{"name":"MERCHANT03194","text":"Thank you, Great Azuro, for getting rid of that pesky hornet! He was a right nasty bastard if ever I saw one. Here's your payment, as agreed."},{"name":"MARTYN","text":"Ah, I didn't see you there... How goes the trainin'?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Training!? Working for free is more like it!"},{"name":"A1","text":"Maybe one day I can get paid for doing nothing, too."},{"name":"MARTYN","text":"Come on, don't be like that! You had a chance to hone your skills, and that bloke can go about his business without bein' stung to buggery. If he's willin' to part with a few gil for it, who am I to say no?"},{"name":"MARTYN","text":"Once we get back to Ul'dah, I'll divvy up the earnin's. I'll see you outside the Celestium."},{"name":"LATOOLJA","text":"Welcome back, <span class=\"highlight\">Forename</span>. I hope Martyn's training not too grueling."},{"name":"MARTYN","text":"Ah, there you are. What took you so long?"},{"name":"MARTYN","text":"You're showin' signs of improvement, but you'll want a few more tricks up your sleeve before you can step into the arena─those pit fiends don't mess about! I reckon what you need is “Mind Blast.”"},{"name":"MARTYN","text":"Once you've learned that, come and find me, and we'll continue your trainin'. And here's your payment for the hornet you put down!"},{"name":"MARTYN","text":"You think I'm bein' stingy? Listen, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mate</span></span>, I've already subtracted the fees for your trainin'. If I charged any less, I'd be cuttin' my own throat!"}],"reward":{"gil":414},"reqs":{"jobs":[{"lvl":10,"id":129}],"quests":[68729]},"next":[68731]},"partials":[{"type":"npc","id":"1026852","obj":{"i":1026852,"n":"Martyn","l":41,"q":12}},{"type":"quest","id":"68729","obj":{"i":68729,"n":"Blue Leading the Blue","g":166,"l":"Lower La Noscea","s":10,"f":1}},{"type":"quest","id":"68731","obj":{"i":68731,"n":"Why They Call It the Blues","g":166,"l":"Ul'dah","s":200,"f":1}}]}