{"quest":{"name":"Scream Blue Murder","location":"Ul'dah","id":68732,"patch":4.5,"sort":300,"icon":100830,"unlocksFunction":1,"eventIcon":71341,"issuer":1026852,"target":1026852,"genre":166,"journal":["Martyn seems even more distracted than usual.","Despite having sent you to learn Faze, Martyn shows little interest when you appear to demonstrate the fruits of your labors. Instead, he asks you to come back at some other time, claiming that he has more pressing matters at hand. As he leaves to tend to said business, Royse arrives and expresses to you her concerns regarding Martyn's increasingly obvious monetary woes. Although he earns a fair wage performing in the Celestium, his debts appear to be growing. Where he spends these vast amounts of gil is anyone's guess, and his assistants appear to have been left in the dark as to his clandestine activities. Eager to get to the bottom of this mystery, Royse suggests that you help her track Martyn's movements in order to determine whether he is involved with anything that would bring the Celestium into disrepute.","You and Royse spy Martyn leaving the Alchemists' Guild, having apparently concluded some business there. Rather than stopping to inquire with the guild members what this might be, you decide against letting Martyn out of your sight, and continue trailing him.","On the outskirts of the city, you find Martyn engaged in a transaction with two shadowy figures, their faces concealed beneath dark hoods. You are able to catch enough of their conversation to ascertain that the item in question is none other than dream flowers─highly illegal and used in the production of somnus. Royse is unable to hide her surprise and her sudden outburst gives away your position to the black marketeers. They decide the most effective way to silence the witnesses to their dealings is a blade between the ribs, and they pounce to attack.","You swiftly dispatch the assailants with your nascent blue magic, which has come on leaps and bounds since you first met Martyn. Thankfully, your mentor and Royse are also unscathed, having been saved by your timely intervention from an untimely death.","Royse is furious with Martyn for involving himself in illicit activities, prompting the blue mage to finally reveal the reasons for his recent behavior. He states emphatically that the dream flowers he has been buying on the black market are for use in a medicine created to fight an epidemic that has spread from Eorzea to the New World. Feeling that he is partly responsible for carrying the disease to the Whalaqee, he is prepared to face both financial ruin and bodily harm to secure a steady supply of the medicine. Taken aback by Martyn's fervent commitment to the cause, Royse reconsiders her position, and not only allows him to continue at the Celestium, but grants him the opportunity to perform in more shows, and even offers to help him find another source of dream flowers.","By the time you arrive in Ul'dah, it seems that Martyn and Royse have already decided a new schedule at the arena that includes more shows featuring the Great Azuro. Royse has also introduced Martyn to a merchant who can provide the dream flowers in a state that circumvents any legal obstacles to their purchase. Considering that Martyn's time will now be almost entirely dedicated to entertaining audiences in the Celestium, you will need to train alone for the most part, relying on the wild beasts to teach you their techniques. He suggests that you learn the spell 1000 Needles before returning to report your progress to Latool Ja.<br><br>※The next blue mage quest will be available from Latool Ja upon reaching level 40 and learning 1000 Needles."],"objectives":["Rendezvous with Royse at Scholars' Walk.","Rendezvous with Royse in Hammerlea.","Defeat the suspicious fellows.","Speak with Martyn.","Speak with Martyn in Ul'dah."],"dialogue":[{"name":"MARTYN","text":"Havin' trouble learnin' Faze? The spellbook should tell you where go, but even when you find the right creatures, you'll have to keep at it until the spell's yours."},{"name":"SYSTEM","text":"The next blue mage quest will be available from Martyn upon learning Faze."},{"name":"MARTYN","text":"Learned Faze, have you? Good to hear. Listen, I've got a few things to take care of, so your trainin' will have to wait. Sorry, but can you come back later?"},{"name":"ROYSE","text":"Well, well, if it isn't <span class=\"highlight\">Forename</span>! How goes the training?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"My debut can't come soon enough!"},{"name":"A1","text":"I didn't realize there'd be so much traipsing around."},{"name":"ROYSE","text":"That's what I like to hear! I have high hopes for you."},{"name":"ROYSE","text":"I'm sure it's to help build your stamina! Yes, that must be it."},{"name":"ROYSE","text":"Anyway, enough chitchat. I came to talk to you about Martyn."},{"name":"ROYSE","text":"You and I both know about his recent─and highly embarrassing─troubles with debt collectors. He assures me that they have been paid off, but it seems he's borrowing from other unsavory characters instead."},{"name":"ROYSE","text":"I can't have my star attraction putting himself at risk like this. If he's involved in something that could damage the reputation of the Celestium, I have a right to know."},{"name":"ROYSE","text":"How about you two? Surely you must have some idea?"},{"name":"LATOOLJA","text":"Martyn...has many secrets."},{"name":"ROYSE","text":"He certainly does... So, he went to take care of some things, yes? Perhaps we should look into exactly what these “things” are."},{"name":"ROYSE","text":"<span class=\"highlight\">Forename</span>, he's your teacher─I'll bet you're as eager as I am to get to the bottom of this. Come on, let's go and look for him."},{"name":"LATOOLJA","text":"Would it help if Latool Ja told my secrets instead? Latool Ja sometimes sips from people's drinks when they not looking."},{"name":"ROYSE","text":"He just went into the Alchemists' Guild. He's trying not to draw attention by wearing something inconspicuous─and by that, I mean “not blue.”"},{"name":"ROYSE","text":"But why all the secrecy? Could he be buying medicine? Perhaps he's got some awful condition. That would explain where all the money's going, but I don't think that's it..."},{"name":"ROYSE","text":"Where's he off to now? With me, <span class=\"highlight\">Forename</span>─ The game is afoot!"},{"name":"ROYSE","text":"It looks like he's waiting for someone... Shhh! They're here!"},{"name":"HYURAN03196","text":"You know the rules. Money first."},{"name":"HYURAN03196","text":"That oughta do it."},{"name":"MARTYN","text":"Look, I know this ain't exactly above board, but this is costin' me more and more every time, and the packages stay the same size. In fact, I think they're gettin' smaller..."},{"name":"HYURAN03196","text":"Not our problem, mate. Dream flowers are in short supply. If you want 'em, you'll pay what we ask and take what you're given."},{"name":"ROYSE","text":"Dream flowers!?"},{"name":"LALAFELL3196","text":"Someone's there! Get 'em!"},{"name":"ROYSE","text":"What have I done!? <span class=\"highlight\">Forename</span>, you've got to stop them!"},{"name":"ROYSE","text":"What have I done!? <span class=\"highlight\">Forename</span>, you've got to stop them!"},{"name":"BALLOON","text":"Nothin' personal. Just business..."},{"name":"BALLOON","text":"Hold still─this won't hurt a bit!"},{"name":"ROYSE","text":"You...you did it. And Martyn's got a lot to answer for."},{"name":"MARTYN","text":"So you saw everythin'? I'd better prepare for the worst..."},{"name":"ROYSE","text":"Thank you, <span class=\"highlight\">Forename</span>. If it weren't for you, things could've turned out very differently."},{"name":"ROYSE","text":"As for you, Martyn─what the bloody hells do you think you're doing!? Dream flowers!?"},{"name":"ROYSE","text":"So you've been concocting somnus in your spare time? Were you planning to sell it, or is it all to feed your own addiction? Either way, you can forget about our contract!"},{"name":"MARTYN","text":"I can explain! It ain't what you think!"},{"name":"ROYSE","text":"What is it then? This had better be good..."},{"name":"MARTYN","text":"I've been buyin' dream flowers to make medicine, not somnus!"},{"name":"MARTYN","text":"It's for the Whalaqee. They need the proper treatment, as soon as possible."},{"name":"MARTYN","text":"There's an epidemic, you see, most likely brought over from Eorzea by people like me."},{"name":"ROYSE","text":"How serious is it?"},{"name":"MARTYN","text":"Very. For Eorzeans, it's not much worse than catchin' a cold, but for the Whalaqee, it's life-threatenin'! Not only that, it's spreadin' like wildfire!"},{"name":"MARTYN","text":"A friend of mine, a Whalaqee chirurgeon, is doin' all he can with the traditional medicines, but it's a losin' battle. At this rate, it's only a matter of time before they're all taken by the disease."},{"name":"MARTYN","text":"I know I'm not the only Eorzean to visit the New World, but it makes me sick to my stomach to think I'm partly to blame. I can't just stand by and let them die without at least tryin' to do somethin'!"},{"name":"MARTYN","text":"I came back to Eorzea to find a cure, based on my friend's research notes. I've practically ruined myself, but I eventually came up with a concoction that seems to do the trick."},{"name":"MARTYN","text":"Thing is, it'll take more than a couple of doses to stop the epidemic, and this stuff don't come cheap. There's also the fact that the main ingredient comes from dream flowers, which ain't easy to get hold of."},{"name":"ROYSE","text":"So that explains why you've been dealing with those back-alley cutthroats. And I suppose your business at the Alchemists' Guild had some connection to the medicine, yes?"},{"name":"MARTYN","text":"That's right. Needed some tools and whatnot to help with the mixin'. But that's nothin' you need to worry about. I've caused you enough trouble already. &lt;sigh&gt; It's been nice knowin' you, Royse."},{"name":"ROYSE","text":"If you'd told me all of this from the beginning, we could have worked something out."},{"name":"ROYSE","text":"I've decided─you can carry on at the Celestium! As for the dream flowers...let's just say I know a few people."},{"name":"MARTYN","text":"You're sure about this!? Royse─I can't thank you enough! I'll do anythin' you ask!"},{"name":"ROYSE","text":"You can start by putting in a few more performances at the arena. I'm sure the extra money won't go amiss, will it?"},{"name":"MARTYN","text":"I was about to suggest the same thing! I'll perform in every show you've got, if you'll let me."},{"name":"ROYSE","text":"The fans are clamoring to see more of the Great Azuro, so it makes sense to capitalize on that. Anyway, this hardly seems like the place to discuss business─we should head back."},{"name":"LATOOLJA","text":"Martyn not say anything about medicine for Whalaqee. If we knew, we could have helped... But he say everything his fault─Martyn make problem, Martyn solve problem. Whalaqee more important than Martyn's pride, though. Why Martyn not realize?"},{"name":"MARTYN","text":"You did me a good turn by takin' care of those dream flower peddlers."},{"name":"MARTYN","text":"Sooner or later, they would've bled me dry, one way or another. Royse introduced me to a merchant who handles shipments to alchemists. He gets the dream flowers processed before bein' brought to Ul'dah, which bypasses the ban. Still bloody expensive, mind you."},{"name":"MARTYN","text":"Oh, I almost forgot about your trainin'! To tell the truth, your run-in with those somnus dealers was probably a better test of your abilities than anythin' I could've thought up."},{"name":"MARTYN","text":"I might not have much time to spend helpin' you get ready for the arena, but I can still give you advice. I recommend learnin' 1000 Needles next."},{"name":"MARTYN","text":"Once you've gotten the hang of that one, come and see me. Actually, there's a strong chance I'll be in the middle of a performance, so Latool Ja'll take care of things while I'm away."},{"name":"MARTYN","text":"Remember─your real teachers are the beasts that roam free through the wilderness. You're free to roam too, but if you get lost, your spellbook will show you the way. Good luck, <span class=\"highlight\">Forename</span>!"},{"name":"LATOOLJA","text":"Martyn already performing many times a day. Latool Ja worry more shows will kill him. Martyn's blue magic is powerful indeed, but he is just a man. Sometimes he forget this."}],"reward":{"gil":759},"reqs":{"jobs":[{"lvl":30,"id":129}],"quests":[68731]},"next":[68733]},"partials":[{"type":"npc","id":"1026852","obj":{"i":1026852,"n":"Martyn","l":41,"q":12}},{"type":"quest","id":"68731","obj":{"i":68731,"n":"Why They Call It the Blues","g":166,"l":"Ul'dah","s":200,"f":1}},{"type":"quest","id":"68733","obj":{"i":68733,"n":"Blue Gold","g":166,"l":"Ul'dah","s":400,"f":1}}]}