{"quest":{"name":"Turning Over a Blue Leaf","location":"Ul'dah","id":68735,"patch":4.5,"sort":501,"icon":100830,"unlocksFunction":1,"eventIcon":71341,"issuer":1026924,"target":1026852,"genre":166,"journal":["Latool Ja has an expression of overwhelming joy on his face. Or at least you think he has...","Latool Ja is the first to congratulate you on your spectacular victory over Azulmagia. The self-confessed villain of the piece, Whastrach, arrives to commend your performance, and promises to relinquish his hold on Lapis Canyon, as per the agreement. Much to everyone's surprise, he even asks Ceadda if he will act as his guide in the New World, in order to secure another source of ceruleum without adversely affecting the lives of the inhabitants. The young Whalaqee senses the sincerity in Whastrach's words, and accepts the offer in the hope that his advice will prevent any more unpleasant confrontations. As the two of them leave to prepare for their journey across the Indigo Deep, Royse reminds you that your services as Azuro the Second are still very much in demand, and that she is expecting you to make further appearances in the Masked Carnivale. Martyn, too, in spite of his initial reluctance, plans to continue in the role of the Great Azuro until a better─or more profitable─idea springs to mind.","After an extremely brief period of contemplation, Martyn decides that his new goal in life is to found a Blue Mages' Guild. In order to do so, he will first need to gather the necessary capital, and what better way to do that than continuing to appear in the lucrative─and highly dangerous─Masked Carnivale? Martyn reminds you that there is room in the spotlight for both Azuros, and that the door to the Celestium is always open to you.<br><br>※The next blue mage quest will be available from Martyn once you have completed the main scenario quest “Litany of Peace.”"],"objectives":["Speak with Martyn."],"dialogue":[{"name":"LATOOLJA","text":"<span class=\"highlight\">Forename</span> beat Azulmagia! Latool Ja cannot believe it! I mean, I <span class=\"emphasis\">can</span> believe it, because Latool Ja always believe in you. Anyway, well done!"},{"name":"NEWWORLDBOY","text":"I cannot thank you enough! Lapis Canyon is safe!"},{"name":"MARTYN","text":"Nicely done, <span class=\"highlight\">Forename</span>! That sack of goobbue shite won't be botherin' the Whalaqee anymore!"},{"name":"ROYSE","text":"Spectacular! Stupendous! The performance of a lifetime! I never knew you had it in you, <span class=\"highlight\">Forename</span>. Of course, I haven't forgotten about our agreement. As of today, I will be withdrawing my funding from the ceruleum mine project."},{"name":"WHASTRACH","text":"(-Azulmagia's Voice-)Fools! You think you have defeated me? This place will be your burial ground!"},{"name":"WHASTRACH","text":"Ha! I tricked you for a moment there, didn't I? I must admit, I had grown rather accustomed to playing the villain, but enough is enough."},{"name":"WHASTRACH","text":"The fact is, I lost our wager, so it's time I put an end to my plans for Lapis Canyon. I'm a businessman, not a monster, and I have you, Ceadda, and Martyn to thank for reminding me of that."},{"name":"WHASTRACH","text":"The New World is a vast, untamed land, and there are bound to be ways to acquire ceruleum without mining on sacred ground. Royse has even agreed to fund my next expedition."},{"name":"WHASTRACH","text":"I will be leaving by ship within the next few days. Ceadda, would you care to join me? With you as my guide, perhaps I can avoid repeating the mistakes I made with the Whalaqee."},{"name":"NEWWORLDBOY","text":"You're serious, aren't you? I accept your offer, if only so that I can keep you away from our land. Actually, I have heard of several places similar to Lapis Canyon to which no one has laid claim."},{"name":"WHASTRACH","text":"Then, you and I have much to discuss! But first, I must prepare for the voyage. There is much to be done!"},{"name":"NEWWORLDBOY","text":"I'll never forget you, <span class=\"highlight\">Forename</span>! If you ever have a chance to cross the Indigo Deep, you will always be welcome to stay with the Whalaqee!"},{"name":"ROYSE","text":"Hold your chocobos! As Azuro the Second, there's no time to go gallivanting around the New World. You've got crowds to please, beasts to best! Not to mention money to earn. Don't go away now, darling!"},{"name":"MARTYN","text":"I go through all the trouble of gettin' better and squeezin' back into my costume, but it looks like you're her favorite now! Bloody charmin', that is! Mind you, the epidemic's over, so I don't need to dance to her tune anymore."},{"name":"LATOOLJA","text":"So why is Martyn still dressed as the Great Azuro?"},{"name":"MARTYN","text":"Well, there's no harm in earnin' a few gil while I think about my next move, is there?"},{"name":"LATOOLJA","text":"Latool Ja say Martyn just like attention!"},{"name":"LATOOLJA","text":"Gaheel Ja and Latool Ja stay with Martyn, keep him out of trouble."},{"name":"MARTYN","text":"Somethin's occurred to me─all this business with the Great Azuro and Azuro the Second's got everyone talkin' about blue magic!"},{"name":"MARTYN","text":"Those stuffy old bookworms in the Arcanists' Guild never listened to me before, but this ought to make them take notice."},{"name":"MARTYN","text":"In fact, I'm thinkin' about openin' a Blue Mages' Guild, partly as a way of rubbin' my old guildmates' noses in it for rejectin' my research, but also to help spread the knowledge across Eorzea. I'll need a fair bit of gil to get the idea off the ground, though."},{"name":"MARTYN","text":"All the more reason to carry on as the Great Azuro! I'll show them that not even bein' half-eaten by some beast can keep me down!"},{"name":"MARTYN","text":"'Course, there's room in the Celestium for the both of us. After all, I wouldn't deny my favorite─and only─apprentice a chance at fame and glory!"},{"name":"SYSTEM","text":"In order to undertake the next blue mage quest, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Litany of Peace.”"},{"name":"SYSTEM","text":"Once you have done so, the next blue mage quest will be available from Martyn."}],"reward":{"gil":517,"items":[{"id":24796}]},"reqs":{"jobs":[{"lvl":50,"id":129}],"instances":[35025],"quests":[68734]},"next":[69268]},"partials":[{"type":"npc","id":"1026924","obj":{"i":1026924,"n":"Maudlin Latool Ja","l":41,"q":3}},{"type":"npc","id":"1026852","obj":{"i":1026852,"n":"Martyn","l":41,"q":12}},{"type":"item","id":"24796","obj":{"i":24796,"n":"Azulmagia","l":1,"c":39901,"t":105,"p":1000}},{"type":"instance","id":"35025","obj":{"i":35025,"n":"Dirty Rotten Azulmagia","c":61836,"t":"The Masked Carnivale","min_lvl":50,"max_lvl":50}},{"type":"quest","id":"68734","obj":{"i":68734,"n":"The Real Folk Blues","g":166,"l":"Ul'dah","s":500,"f":1}},{"type":"quest","id":"69268","obj":{"i":69268,"n":"Into the Blue Again","g":166,"l":"Ul'dah","s":502,"f":1}}]}