{"quest":{"name":"A Shelltered Eggsistence","location":"Gridania","id":68739,"patch":4.5,"sort":175,"icon":100825,"eventIcon":71221,"issuer":1027044,"target":1027044,"genre":199,"usedItems":[24605],"journal":["Nonotta is practically champing at the bit to see you dressed in your new Hatching–tide outfit.<br>※This quest is available for a limited time only.","Nonotta and Riggy have prepared a complex conundrum for you and Jihli to solve as part of Hatching–tide. Nonotta also insists that you don the jacket she has designed especially for the event─which upon closer inspection you notice features an enormous hood complete with long, dangling attachments modeled after a spriggan's ears. It seems you will need to be attired to her satisfaction before she will allow you to begin the egg hunt.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","Clothed as Nonotta instructed, you submit yourself for her inspection. Though no explanation as to the supposed necessity of the garment is forthcoming, it at least serves the function of delighting her. She bids you go forth in search of three spriggans, who between them hold the key to unlocking the mystery she and Riggy have devised.","Scouring the various nooks and crannies of New Gridania, you eventually locate the three spriggans, who are quick to give up their clues. They eagerly offer brief statements relating to the numbers one, two, and three, the meaning of which is for the most part unclear at this point. Meanwhile, Jihli stares intently at the map that Nonotta has provided, in the hope that the information you have gathered will help solve the Hatching–tide puzzle.","Now that the necessary pieces are ostensibly in place, Nonotta divulges the password─Egg Hunt─which presumably will lead you to the gilded tourmaline egg when uttered in the correct location. Whether you and Jihli are able to find the place in question is another matter, as the small problem of unraveling the many-layered enigma yet remains.","You cleverly deduce that Mother Miounne is the one charged with safeguarding the gilded tourmaline egg, and she relinquishes your prize as per her agreement with Nonotta. The item in question is rather colorful, and a slight rustling sound comes from inside when it is shaken. You and Jihli decide that rather than quibbling over the object's true nature, you should return it to Nonotta and Riggy and put their puzzle to bed.","Nonotta praises you and Jihli for having overcome the challenge she had posed, or at least the first part of it. She wastes no time in revealing that this was merely a precursor, and the true conundrum is yet to come. The source of the rustling from inside the gilded tourmaline egg turns out to be another map, filling Jihli with a great sense of apprehension that her cognitive abilities will be pushed to their limits and beyond. Only time will tell if yours are up to the task."],"objectives":["Don a spriggan jacket and speak with Nonotta.","Speak with the three spriggans.","Rendezvous with Jihli Aliapoh.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Egg Hunt” in the correct location to discover the gilded tourmaline egg.","Deliver the gilded tourmaline egg to Nonotta."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, know that guidance from the journal, duty list, and map will be limited. You will need to read the text carefully and decipher the clues to determine your course of action."},{"name":"NONOTTA","text":"With that Archon egg out there waiting for you, there's no time like the present to break in your new spriggan jacket. I'm sure you'll agree that the tailoring is eggceptional!"},{"name":"SYSTEM","text":"With your brand-new spriggan jacket equipped and your mind primed for the trials ahead, speak with Nonotta again."},{"name":"SYSTEM","text":"If you do not have a spriggan jacket in your possession, you can purchase one from the Dreamer at Mih Khetto's Amphitheatre."},{"name":"NONOTTA","text":"With that Archon egg out there waiting for you, there's no time like the present to break in your new spriggan jacket. I'm sure you'll agree that the tailoring is eggceptional!"},{"name":"SYSTEM","text":"With your brand-new spriggan jacket equipped and your mind primed for the trials ahead, speak with Nonotta again."},{"name":"SYSTEM","text":"If you do not have a spriggan jacket in your possession, you can purchase one from the Dreamer at Mih Khetto's Amphitheatre."},{"name":"NONOTTA","text":"Magnificent! Let the hunt begin!"},{"name":"RIGGY","text":"Friend ready for eggy! Ready, ready, readyyy!"},{"name":"NONOTTA","text":"If you manage to find the gilded tourmaline egg, bring it to me for inspection. I'll know if you try to fob me off with a fake one!"},{"name":"JIHLIALIAPOH","text":"There will be no need for that─we shall find that egg in no time!"},{"name":"NONOTTA","text":"Don't forget, you'll need to speak with all three spriggans to stand a chance of reaching the prize."},{"name":"JIHLIALIAPOH","text":"<span class=\"highlight\">Forename</span>, I shall leave locating the spriggans to you. In the meantime, I will attempt to make some sense of this map. Let us meet back here once we have a lead in our search for the egg."},{"name":"NONOTTA","text":"I have a map for you, too. Without giving too much away, I should point out that this holds the key to the whole mystery."},{"name":"RIGGY","text":"Riggy love mystery!"},{"name":"JIHLIALIAPOH","text":"Since I am normally the one organizing these kinds of events, being able to participate makes a welcome change!"},{"name":"SYSTEM","text":"Use the crumpled cartograph and hints provided to discover the location of the gilded tourmaline egg."},{"name":"SPRIGAN03203","text":"Me first! Me first!"},{"name":"SPRIGAN03203","text":"Second best! Beeest!"},{"name":"SPRIGAN03203","text":"Third foreveeer!"},{"name":"JIHLIALIAPOH","text":"Have you found the spriggans yet?"},{"name":"JIHLIALIAPOH","text":"We should reconvene once we have enough information to form a hypothesis as to the egg's location."},{"name":"NONOTTA","text":"I recommend finding the spriggans first and making a note of where you found them. You never know─it could be important!"},{"name":"JIHLIALIAPOH","text":"You have found all three spriggans? Jolly good! What did they say?"},{"name":"JIHLIALIAPOH","text":"First, second, third? They must be referring to some kind of order."},{"name":"JIHLIALIAPOH","text":"But how is it linked to the writing on the map?"},{"name":"JIHLIALIAPOH","text":"Nonotta, are there any further clues for us to find?"},{"name":"NONOTTA","text":"No, that's all you get, I'm afraid!"},{"name":"JIHLIALIAPOH","text":"By the Twelve! I cannot make head nor tail of this!"},{"name":"RIGGY","text":"Oh! Oh! Riggy know! Can Riggy say?"},{"name":"NONOTTA","text":"Oh, pipe down, would you? <span class=\"highlight\">Forename</span>, Jihli, once you have the answer, go to where you suspect the egg lies and call out “Egg Hunt” in a nice, big voice!"},{"name":"SYSTEM","text":"Use the information gleaned from the three spriggans and the clues on the map to determine the gilded tourmaline egg's whereabouts."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter “Egg Hunt” while standing in the correct location to discover the item. With it in your possession, speak with Nonotta."},{"name":"SYSTEM","text":"Should you require further hints, speak with Jihli Aliapoh."},{"name":"NONOTTA","text":"Between the two of you, I'm sure you can figure it out!"},{"name":"SPRIGAN03203","text":"Me first! Me first!"},{"name":"SPRIGAN03203","text":"Second best! Beeest!"},{"name":"SPRIGAN03203","text":"Third foreveeer!"},{"name":"SYSTEM","text":"Egg Hunt"},{"name":"MIOUNNE","text":"Are you here for one of Mother's famous eel pies?"},{"name":"MIOUNNE","text":"Well, well. It seems Nonotta and Riggy have met their match."},{"name":"JIHLIALIAPOH","text":"The egg... It is here...correct?"},{"name":"MIOUNNE","text":"An egg, is it? I must say, it does feel somewhat artificial, but I suppose it's the right shape. In any case, it's now the property of the one who came here and uttered the password."},{"name":"JIHLIALIAPOH","text":"Mother Miounne certainly has a point about it being strange. And is it my imagination, or did I hear a slight rustling sound from inside?"},{"name":"JIHLIALIAPOH","text":"What I'm most interested in, though, is seeing Nonotta and Riggy's faces when they realize we have solved the mystery!"},{"name":"JIHLIALIAPOH","text":"I feel as though we are slowly getting closer to the answer..."},{"name":"Q1","text":"Would you like Jihli to share her thoughts?"},{"name":"JIHLIALIAPOH","text":"While these letters are clearly not Eorzean, they are somewhat similar. It is not too hard to decipher them, but simply reading them from left to right reveals nothing but gibberish."},{"name":"JIHLIALIAPOH","text":"Obviously, their positioning in relation to the map below is vital in understanding the puzzle."},{"name":"Q2","text":"Would you like Jihli to share more of her thoughts?"},{"name":"JIHLIALIAPOH","text":"Perhaps we have overlooked something?"},{"name":"JIHLIALIAPOH","text":"Hmm... The three spriggans must be linked to these letters in some fashion."},{"name":"JIHLIALIAPOH","text":"Can you remember where you found them?"},{"name":"Q3","text":"Would you like Jihli to share yet more of her thoughts?"},{"name":"JIHLIALIAPOH","text":"Each of the spriggans mentioned something about first, second, or third, yes?"},{"name":"JIHLIALIAPOH","text":"Hmm... My guess is that this is probably as important, if not more so, than their locations. With that in mind, let's take another look at the map!"},{"name":"JIHLIALIAPOH","text":"Our three furry friends were sent to these positions, and this is how their numbers are distributed."},{"name":"JIHLIALIAPOH","text":"Yes, things seem much clearer now."},{"name":"Q4","text":"Would you like Jihli to share even more of her thoughts?"},{"name":"JIHLIALIAPOH","text":"Initially I thought the positions of the spriggans would indicate which letters reveal the answer..."},{"name":"JIHLIALIAPOH","text":"...but none of them are in the same places. As you can see, they are all slightly off. So much for that idea!"},{"name":"JIHLIALIAPOH","text":"I wonder if the spriggans are trying to indicate a course of some sort?"},{"name":"JIHLIALIAPOH","text":"If I move my finger from one point to the next... Hmm? 'Tis a name I know very well indeed. Now we need only find her..."},{"name":"NONOTTA","text":"So, you think you've found the answer? You'll still need to use the password, though. It's “Egg Hunt” in case you forgot!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter “Egg Hunt” while standing in the correct location to discover the gilded tourmaline egg. With it in your possession, speak with Nonotta."},{"name":"NONOTTA","text":"So, have you got something for me?"},{"name":"NONOTTA","text":"Ho ho! Congratulations to you both for getting this far."},{"name":"JIHLIALIAPOH","text":"Hmm? You mean to say..."},{"name":"NONOTTA","text":"Yes, finding the gilded tourmaline egg was only the beginning! For inside it is...another map! This time, the prize you seek is a gilded topaz egg."},{"name":"RIGGY","text":"Very pretty! Pretty, prettyyy!"},{"name":"JIHLIALIAPOH","text":"Oh dear... I thought I had already surpassed the limits of my mental faculties. If these puzzles get any more difficult, I fear my head shall explode!"},{"name":"MIOUNNE","text":"I shan't pretend that I understand what you're all doing. Something to do with Hatching–tide, I presume? As long as you're enjoying yourselves, that's the most important thing."},{"name":"JIHLIALIAPOH","text":"I knew we would find the egg!"}],"reward":{"gil":296,"items":[{"num":10,"id":22411}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68738]},"next":[68740]},"partials":[{"type":"npc","id":"1027044","obj":{"i":1027044,"n":"Nonotta","l":52,"q":2}},{"type":"item","id":"22411","obj":{"i":22411,"n":"Magicked Prism (Hatching-tide)","l":1,"c":22633,"t":85,"p":19}},{"type":"item","id":"24605","obj":{"i":24605,"n":"Spriggan Jacket","l":1,"c":43858,"t":35,"p":156}},{"type":"quest","id":"68738","obj":{"i":68738,"n":"Eggstreme Eggstrapolation","g":199,"l":"Gridania","s":174}},{"type":"quest","id":"68740","obj":{"i":68740,"n":"Deus Eggs Machina","g":199,"l":"Gridania","s":176}}]}