{"quest":{"name":"Eggstreme Eggstrapolation","location":"Gridania","id":68738,"patch":4.5,"sort":174,"icon":100824,"eventIcon":71221,"issuer":1027030,"target":1027044,"genre":199,"journal":["Jihli Aliapoh is scanning the crowds for an unsuspecting passerby she can cajole into helping with Hatching–tide.<br>※This quest is available for a limited time only.","Jihli Aliapoh, the originator of the Hatching–tide festival, has had another of her prophetic dreams, in which she witnessed Riggy the spriggan hiding a fantastically decorated egg. Though whether this alludes to any greater meaning is unclear, Jihli is convinced that, as in previous years, the success of the festival hinges on the reenactment of the events that unfolded in her vision, and to that end, she has requested that Riggy and Nonotta─both fervent supporters of Hatching–tide─make preparations for an egg hunt.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","Rather than simply hiding eggs around Gridania, Nonotta and Riggy have devised some manner of obscure puzzle, with a map and a series of cryptic clues leading the way. You and Jihli are also given Hatching–tide costumes, which despite serving no discernible purpose are nonetheless treated by Nonotta as being an essential part of the festivities. Now it's up to you to embrace your inner spriggan and prepare for the hunt."],"objectives":["Speak with Nonotta at the Knot."],"dialogue":[{"name":"JIHLIALIAPOH","text":"Come one, come all! For Hatching–tide is upon us once more!"},{"name":"JIHLIALIAPOH","text":"Oh, <span class=\"highlight\">Forename</span>! To see you again is like a dream come true!"},{"name":"JIHLIALIAPOH","text":"Don't tell me... You are an adventurer, yes? Well, you certainly have the inquisitive nature of one, at any rate! May I ask your name?"},{"name":"JIHLIALIAPOH","text":"Well then, <span class=\"highlight\">Forename</span>, I should probably mention that Hatching–tide all began with a vision I had before the Seventh Umbral Calamity, in which the Twelve Archons delivered unto me a message."},{"name":"JIHLIALIAPOH","text":"From atop their giant, decorated eggs they called to me: “Arise, young Dreamer, and make ready the vessels for our return.” When I awoke, I quickly set about filling the realm with all manner of painted ovoids. And thus did this joyous yearly celebration come to be!"},{"name":"JIHLIALIAPOH","text":"And speaking of dreams, another strange vision came to me in the night. I dreamt that Riggy the spriggan was hiding a beautifully gilded Hatching–tide egg."},{"name":"JIHLIALIAPOH","text":"Though what I saw was not unexpected─Riggy is one of our most enthusiastic helpers, after all─I am sure that this premonition holds deeper meaning. Yes, as in years past, it is doubtless the key to a successful Hatching–tide."},{"name":"JIHLIALIAPOH","text":"I've already asked Nonotta to help Riggy secret away an egg. Would you care to accompany me as I inquire as to the progress they have made?"},{"name":"NONOTTA","text":"Ah, Jihli! If you're here to lend a hand, you're too late─Riggy and I have already finished. You're just in time to take part in our egg hunt, though!"},{"name":"NONOTTA","text":"And you've brought <span class=\"highlight\">Forename</span>! Perfect!"},{"name":"RIGGY","text":"Eggy friend back again! Riggy happy!"},{"name":"NONOTTA","text":"And will you be joining too?"},{"name":"RIGGY","text":"Me Riggy! Riggy good spriggy!"},{"name":"NONOTTA","text":"Let me tell you, it's not as simple as looking for hidden eggs. Rather than scrabbling about on your hands and knees, you have to use your head!"},{"name":"NONOTTA","text":"First, you'll need one of these!"},{"name":"JIHLIALIAPOH","text":"Is this a map? And what are all those letters for?"},{"name":"NONOTTA","text":"To help uncover the location of the egg, of course! Riggy and I have hidden it somewhere, and you'll need to solve our little conundrum to find it."},{"name":"JIHLIALIAPOH","text":"Hmm... This does indeed bear some resemblance to my dream, but I never expected Nonotta to turn a simple egg hunt into such a complex puzzle."},{"name":"JIHLIALIAPOH","text":"While riddles and such are not exactly my forte, if we put our heads together, I am sure we can unravel this mystery!"},{"name":"JIHLIALIAPOH","text":"Nonotta, we accept your challenge!"},{"name":"JIHLIALIAPOH","text":"If only I had the foggiest idea what to do with this map..."},{"name":"NONOTTA","text":"Oh! I almost forgot the most important part. Three spriggans have been dispatched to various places nearby, and each one will give you a different clue."},{"name":"NONOTTA","text":"And finally, I've prepared a special egg hunter's costume for you, Jihli! You should wear it to help you get into the spirit of Hatching–tide!"},{"name":"JIHLIALIAPOH","text":"Oh my, it does convey a...unique sort of zeal for egg hunting, at the very least."},{"name":"JIHLIALIAPOH","text":"So, how do I look?"},{"name":"NONOTTA","text":"Simply splendid, Jihli!"},{"name":"NONOTTA","text":"Don't worry, <span class=\"highlight\">Forename</span>. There's one for you, too!"},{"name":"RIGGY","text":"Riggy hide eggy good. Gooooood!"}],"reward":{"gil":220,"items":[{"id":24605}]},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[68739]},"partials":[{"type":"npc","id":"1027030","obj":{"i":1027030,"n":"Jihli Aliapoh","l":53,"q":1}},{"type":"npc","id":"1027044","obj":{"i":1027044,"n":"Nonotta","l":52,"q":2}},{"type":"item","id":"24605","obj":{"i":24605,"n":"Spriggan Jacket","l":1,"c":43858,"t":35,"p":156}},{"type":"quest","id":"68739","obj":{"i":68739,"n":"A Shelltered Eggsistence","g":199,"l":"Gridania","s":175}}]}