{"quest":{"name":"Worth Fighting For","location":"Ul'dah","id":68746,"patch":5.0,"sort":800,"icon":100873,"eventIcon":71221,"issuer":1006747,"target":1001739,"genre":147,"journal":["Jenlyns has something─or someone─on his mind.","You learn from Jenlyns that something appears to be troubling Mylla of late. As a close friend of the First Sword, the paladin encourages you to seek her out and inquire after the source of her consternation.","Speaking with Mylla, you learn that it is none other than Aldis, recently returned to Ul'dah, who is causing her grief. Before she can go into detail, however, the man himself appears. Having explained that he has been to the Far East to train in the way of the samurai, he challenges you to a duel for old times' sake. The stage is set for Scorpion Crossing in western Thanalan, and you set out to join Aldis there.","You and Aldis square off. As he prepares to draw his blade, however, a look of awe sweeps over his face. To simply confront you, it would seem, is enough to convince him that he is no match for you, and he abruptly abandons the duel and excuses himself. His uncharacteristic behavior leaves Mylla at a loss for words, and she turns her steps back to the Gladiators' Guild, more confounded than when she left.","Eventually joining you and Mylla, Aldis apologizes for his behavior. Having thought long and hard on the reason for your strength, he has finally come to realize that which is dearest to him: the Gladiators' Guild. To that end, Aldis declares that he will give up the itinerant life and henceforth remain in Ul'dah to watch over the guild. Though Mylla appears none too impressed by his presumptuousness, you know that, deep down, she is glad for his presence. Thus do you take your leave, assured in the knowledge that all will be well in the end."],"objectives":["Speak with Mylla.","Speak with Aldis in Hammerlea.","Speak with Mylla in Ul'dah."],"dialogue":[{"name":"JENLYNS","text":"Ah, if it isn't <span class=\"highlight\">Forename</span>. How fare you, my friend? Still keeping up your training, I trust?"},{"name":"JENLYNS","text":"The Sultansworn have not been idle either. Seeking ways to better serve our nation, we have joined hands with the Gladiators' Guild."},{"name":"JENLYNS","text":"We train with one another, helping to hone each other's sword arms. The guild even dispatches its members to assist us in guarding the palace."},{"name":"JENLYNS","text":"None of this would have been possible without First Sword Mylla's cooperation. She is a dedicated woman─dedicated to her art and to her own─and I have the utmost respect and admiration for her."},{"name":"JENLYNS","text":"...So it was with deep concern that I noticed that something troubles her of late. Whereas before she was amiable, she has become given to brooding silences."},{"name":"JENLYNS","text":"I considered offering to lend an ear, but as a relatively new acquaintance, I did not wish to appear overly familiar."},{"name":"JENLYNS","text":"But you, <span class=\"highlight\">Forename</span>─you are her close friend. Will you not seek her out and inquire after the source of her consternation?"},{"name":"JENLYNS","text":"As I mentioned, something seems to be troubling First Sword Mylla of late. If you have a moment, pray seek her out and inquire after the source of her consternation."},{"name":"MYLLA","text":"...Oh, it's you, <span class=\"highlight\">Forename</span>. It's been a while. What brings you here today?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Jenlyns is worried about you."},{"name":"A1","text":"Is everything all right?"},{"name":"MYLLA","text":"H-He is? Gods, was I being that obvious? &lt;sigh&gt; Forgive me, I don't mean to sound ungrateful. It's kind of Jenlyns to worry about me."},{"name":"MYLLA","text":"Wh-What's this all of a sudden? Of course I'm─ &lt;sigh&gt; Nay, I won't insult your intelligence by lying to you."},{"name":"MYLLA","text":"You see, it's Aldis... He's returned to Ul'dah. He's been pardoned, so he has every right to be here."},{"name":"MYLLA","text":"But it's just...I just don't understand what's going through his mind."},{"name":"ALDIS","text":"(-???-)Oho, if it isn't the very <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I've been longing to see!"},{"name":"ALDIS","text":"Greetings, <span class=\"highlight\">Forename</span>! You look well─for someone who's been raising hells the world over!"},{"name":"ALDIS","text":"...Hm? I see my attire intrigues you."},{"name":"ALDIS","text":"When I took my leave after the Ul Cup, I believe I said something to the effect of still having much to learn. That's what I've been doing─learning."},{"name":"ALDIS","text":"I remembered hearing tell of the fearsome swordsmen of the Far East. And so I decided to journey there and train in their style."},{"name":"ALDIS","text":"I remembered the elderly samurai who was making short work of our gladiators. And so I decided to journey to the Far East and train in his style."},{"name":"MYLLA","text":"You never cared for convention or tradition. Is it any wonder we're confused to see you actually look the part?"},{"name":"ALDIS","text":"Hah, I suppose you're right. But you have to admit, Mylla─I look pretty good in this."},{"name":"ALDIS","text":"So, <span class=\"highlight\">Forename</span>. How about you and I have a bout? For old times' sake?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Gladly!"},{"name":"A2","text":"..."},{"name":"ALDIS","text":"Heh heh, we're of a kind, you and I. When we see a mighty foe, we can't resist the urge to test ourselves!"},{"name":"ALDIS","text":"Not wont to bare steel needlessly, is that it? But I know you <span class=\"emphasis\">need</span> this, <span class=\"highlight\">Forename</span>─as much as I do. We're of a kind, you and I. When we see a mighty foe, we can't resist the urge to test ourselves!"},{"name":"ALDIS","text":"Now, as much as I fancy a rematch in the Coliseum, we'll have to settle for a humbler venue this time. Hmmm, let's see..."},{"name":"ALDIS","text":"How about Scorpion Crossing, outside of the Gate of the Sultana? There's space there, if not a lot of people to watch our glorious match."},{"name":"MYLLA","text":"Oh, don't you even think about fighting in the city!"},{"name":"MYLLA","text":"If you must feed your vanity, I'll attend as witness. At the very least, I can explain the situation to the Brass Blades should they appear."},{"name":"ALDIS","text":"Thanks, I appreciate it."},{"name":"ALDIS","text":"And there you have it, <span class=\"highlight\">Forename</span>. I'll see you at Scorpion Crossing."},{"name":"MYLLA","text":"&lt;sigh&gt; I can't believe this... Go on ahead, <span class=\"highlight\">Forename</span>. I'll follow in a moment."},{"name":"MYLLA","text":"I hope he's satisfied."},{"name":"ALDIS","text":"Heh heh, I've been looking forward to this. Come, my friend, let's begin!"},{"name":"ALDIS","text":"Impossible..."},{"name":"ALDIS","text":"How? How did you become so <span class=\"emphasis\">strong</span>?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I found something worth protecting..."},{"name":"A3","text":"I found something I couldn't bear to lose..."},{"name":"ALDIS","text":"You journeyed to another world...and found something you wished to protect?"},{"name":"ALDIS","text":"You journeyed to another world...and found something you couldn't bear to lose?"},{"name":"MYLLA","text":"Aldis? What's the meaning of this?"},{"name":"ALDIS","text":"There's no point. As I am, I don't stand a chance against <span class=\"highlight\">Forename</span>."},{"name":"MYLLA","text":"You would admit defeat before you've even fought?"},{"name":"ALDIS","text":"It's unseemly, aye. But because of my training, I've come to know, Mylla─come to know the power of resolve and the difference it makes."},{"name":"ALDIS","text":"Forgive me, I need a moment alone."},{"name":"MYLLA","text":"This isn't the Aldis I know. He's never once backed down from a fight."},{"name":"MYLLA","text":"I don't doubt that you've grown stronger since last we met."},{"name":"MYLLA","text":"But so has Aldis. That's why he challenged you─to put his training to the proof."},{"name":"MYLLA","text":"Yet, by that selfsame training, he could see that he was no match for you. I...I don't know what to say."},{"name":"MYLLA","text":"Well, there's no use pondering things here. Let's return to the guild."},{"name":"MYLLA","text":"Aldis hasn't returned."},{"name":"MYLLA","text":"I wouldn't be surprised if he's left Ul'dah again. It wouldn't be the first time he's disappeared as quickly as he's arrived..."},{"name":"MYLLA","text":"Don't blame yourself. The problem is Aldis's and Aldis's alone. It's up to him to resolve it, however long that may take."},{"name":"MYLLA","text":"At any rate, don't feel compelled to linger on his account. I'm sure you have much demands on your time. Come and visit again when you have the chance."},{"name":"ALDIS","text":"Sorry for taking off like that."},{"name":"ALDIS","text":"Truth be told, I'm ashamed to show my face, but there's something I needed to tell you."},{"name":"ALDIS","text":"After I left, I thought long and hard on your words. On that which you said made you strong."},{"name":"ALDIS","text":"It led me to ask myself, what is it that <span class=\"emphasis\">I</span> wish to protect?"},{"name":"MYLLA","text":"And you found your answer?"},{"name":"ALDIS","text":"Aye, I did. Fool that I am, it took me a long time, but I finally realized that it was always close by."},{"name":"MYLLA","text":"Aldis..."},{"name":"ALDIS","text":"Mylla. This is embarrassing for me to say, but that which is dearest to me, that I cannot bear to lose..."},{"name":"ALDIS","text":"...Is the Gladiators' Guild."},{"name":"MYLLA","text":"...What?"},{"name":"ALDIS","text":"The old guildmaster, he was as a father to me. And this place is as a home."},{"name":"ALDIS","text":"No matter where my path may lead, the guild will always welcome me with open arms. I realize that now."},{"name":"MYLLA","text":"Aldis! You...you...!"},{"name":"ALDIS","text":"So, if I'm to protect the guild, it means...well, you know..."},{"name":"ALDIS","text":"It means...I have to <span class=\"emphasis\">be</span> at the guild. So from today, I'm giving up the itinerant life."},{"name":"MYLLA","text":"After all these years coming and going as you please, sending nary a word, you think you can just stay here!? You've got a lot of nerve!"},{"name":"ALDIS","text":"Why, Mylla, if I didn't know better, I'd say you were worried about me."},{"name":"MYLLA","text":"Sh-Shut your mouth! If you wish to stay, then do as you like! That's what you're good at!"},{"name":"ALDIS","text":"Ah, there's the grimace I know and love. There truly is no place like home."},{"name":"ALDIS","text":"But jests aside... <span class=\"highlight\">Forename</span>─because of you, I've finally realized what's important to me."},{"name":"ALDIS","text":"For that, I give you my thanks."},{"name":"ALDIS","text":"From hereon, I'll watch over the guild while I continue honing my skills."},{"name":"ALDIS","text":"Who knows? If I work hard, I might even become the First Sword one day."},{"name":"MYLLA","text":"Not on your life! No one would entrust the guild to a selfish bastard such as you! And skills or no, you're starting from the bottom like the rest!"},{"name":"ALDIS","text":"Aye, aye, whatever you say..."},{"name":"ALDIS","text":"It was good seeing you, my friend. Do come and visit again. From now on, you know where to find me."}],"reward":{"gil":1167,"items":[{"id":25190},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":20}],"questsType":"all","quests":[68111,68784]}},"partials":[{"type":"npc","id":"1006747","obj":{"i":1006747,"n":"Jenlyns","l":41,"q":9}},{"type":"npc","id":"1001739","obj":{"i":1001739,"n":"Mylla","l":41,"q":16,"t":"Guildmaster"}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68111","obj":{"i":68111,"n":"Raising the Sword","g":147,"l":"Ul'dah","s":700,"f":1}},{"type":"quest","id":"68784","obj":{"i":68784,"n":"To Have Loved and Lost","g":179,"l":"Il Mheg","s":151,"f":1}}]}