{"quest":{"name":"Deus Eggs Machina","location":"Gridania","id":68740,"patch":4.5,"sort":176,"icon":100826,"eventIcon":71221,"issuer":1027046,"target":1027033,"genre":199,"journal":["Jihli Aliapoh is like a coiled snake, ready to pounce on the next hidden egg.<br>※This quest is available for a limited time only.","You and Jihli have succeeded in one egg hunt only to face another of Nonotta and Riggy's carefully constructed trials. This time, the map includes a baffling array of letters, almost entirely obscuring the diagram below, and the number of spriggan helpers has jumped from three to five. Whether the increased amount of information will aid or hinder your efforts remains to be seen as you set about quizzing Riggy's brethren.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","As in the previous puzzle, the spriggans each reveal a numerical clue, although keeping track of the locations of all five may prove difficult without some form of writing apparatus. While you traverse the various clearings and groves of Old Gridania, Jihli attempts to solve the mysteries concealed in the map, and her astute observations may yet be the deciding factor in locating the egg.","Now that the necessary information has all been gathered, only the task of uncovering the location of the hidden egg remains. Nonotta informs you that the password is once again “Egg Hunt,” which is a small mercy considering that every other aspect of the puzzle has become more complex in comparison to the last one. Jihli appears to be ruminating on the relationship between the numbered spriggans and the letters on the map, and should you feel the need to ask, she would be more than glad to share her thoughts on the matter.","You and Jihli successfully deduce that the one in possession of the gilded topaz egg is Gabineaux, a prominent figure among the woodsmen of the Central Shroud. Upon hearing the password, he gladly hands over the prize in question, as instructed by Nonotta and Riggy, who both arrive almost immediately after. Despite being overjoyed that you and Jihli were eventually able to locate the egg, Riggy expresses his sadness at his role of master of puzzles coming to an end. Sensing that a new purpose in life may be exactly what the young spriggan needs, Gabineaux offers him a position among his apprentice lumberjacks─a proposal that is gleefully accepted. However, he still has one last duty to perform: overseeing the conclusion of the egg hunt at Mih Khetto's Amphitheatre.","Now that the gilded topaz egg has been presented to Nonotta and Riggy, the hunt has officially come to a close. You and Jihli are awarded the final pieces of this year's Hatching–tide costume, which the festival founder wastes no time in modeling, much to Nonotta's delight. She and Riggy have, through your efforts, proven that the conundrum they devised can indeed be solved by those with the necessary intellect and perseverance, with the next step being to allow the rest of the festival-goers to participate. Having partaken in this year's activities rather than organizing them herself, Jihli vows not to be outdone by her assistants when the next Hatching–tide arrives."],"objectives":["Speak with the five spriggans.","Rendezvous with Jihli Aliapoh.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Egg Hunt” in the correct location to discover the gilded topaz egg.","Deliver the gilded topaz egg to Nonotta at Mih Khetto's Amphitheatre."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, know that guidance from the journal, duty list, and map will be limited. You will need to read the text carefully and decipher the clues to determine your course of action."},{"name":"JIHLIALIAPOH","text":"All right, Nonotta. We shall have a look at this new map of yours."},{"name":"JIHLIALIAPOH","text":"I can barely see anything with all these letters in the way!"},{"name":"JIHLIALIAPOH","text":"Hmm...I suppose this must be Old Gridania."},{"name":"JIHLIALIAPOH","text":"Is there any chance we could have some more hints this time?"},{"name":"NONOTTA","text":"Haha! Not on your life, Jihli. In fact, you can have some extra spriggans instead!"},{"name":"NONOTTA","text":"There are five in total, each with a different clue. And if you think it will be more or less the same as last time, you'd better think again!"},{"name":"RIGGY","text":"Tricky, tricky, trickyyy!"},{"name":"JIHLIALIAPOH","text":"Our last attempt to decipher their code went rather well, so perhaps we should stick to winning ways. If I look for hidden words on the map and you seek out those spriggans, the egg will be ours in a jiffy!"},{"name":"RIGGY","text":"Jiffy, jiffy, jiffyyy!"},{"name":"NONOTTA","text":"Here's your map, <span class=\"highlight\">Forename</span>. I would wish you luck, but you'll need more than that to claim the prize!"},{"name":"RIGGY","text":"Catchy egg! Hatchy egg!"},{"name":"NONOTTA","text":"Don't come to me looking for clues! I'm the last person who'll help you. Mwahahaha!"},{"name":"SYSTEM","text":"Use the crinkled cartograph and hints provided to discover the location of the gilded topaz egg."},{"name":"SPRIGAN03204","text":"Which one? Hee hee hee!"},{"name":"SPRIGAN03204","text":"Nice two meet you!"},{"name":"SPRIGAN03204","text":"No see forest! Only threes!"},{"name":"SPRIGAN03204","text":"You look? What four?"},{"name":"SPRIGAN03204","text":"Good to be a-five!"},{"name":"JIHLIALIAPOH","text":"There do not appear to be any significant differences between this map and the last, other than the location depicted and greatly increased number of letters. I think it is safe to say that the nature of the puzzle itself has not changed a great deal."},{"name":"JIHLIALIAPOH","text":"Found them already! My word, that was quick! Did they provide any useful clues?"},{"name":"JIHLIALIAPOH","text":"So they made a poor attempt at obfuscating their numbers this time? It seems their half-baked riddles were no match for your sleuthing skills."},{"name":"JIHLIALIAPOH","text":"Speaking of which, it seems we must face the true test... Now, let us piece together those clues and find the egg!"},{"name":"NONOTTA","text":"You'll be needing the password too. This time it's “Eggceedingly Eggcellent and Eggsquisite Eggies!” ...Just kidding! It's “Egg Hunt” again."},{"name":"RIGGY","text":"Say wordy, get eggy!"},{"name":"SYSTEM","text":"Use the information gleaned from the five spriggans and the clues on the map to determine the gilded topaz egg's whereabouts."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter “Egg Hunt” while standing in the correct location to discover the item."},{"name":"SYSTEM","text":"Should you require further hints, speak with Jihli Aliapoh."},{"name":"SPRIGAN03204","text":"Which one? Hee hee hee!"},{"name":"SPRIGAN03204","text":"Nice two meet you!"},{"name":"SPRIGAN03204","text":"No see forest! Only threes!"},{"name":"SPRIGAN03204","text":"You look? What four?"},{"name":"SPRIGAN03204","text":"Five! Fiiive! Oh...forgot make riddle."},{"name":"GABINEAUX","text":"Thrice-cursed funguars! There's no end to them and their blasted, blighted spore─ Oh, pardon me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Can I help you?"},{"name":"SYSTEM","text":"Egg Hunt"},{"name":"GABINEAUX","text":"Egg hunt? What do you mean?"},{"name":"GABINEAUX","text":"Ha! I've been waiting so long for you to show up, I'd almost forgotten about the password! So, I suppose you'll be wanting that funny-looking egg thing that's been rolling about and getting underfoot."},{"name":"GABINEAUX","text":"Pauline, Aldred, how about instead of standing there with your mouths open like a pair of hungry chicks, you go and check on that sickly beech tree?"},{"name":"JIHLIALIAPOH","text":"I am glad I finally caught up with you, <span class=\"highlight\">Forename</span>! It seems your hunch was correct."},{"name":"GABINEAUX","text":"When your little friend in the silly hat and that lively spriggan came by and asked me to hold on to this egg, I didn't see any reason to refuse. But to be honest, I'll be glad to see the back of this thing, whichever side that is."},{"name":"NONOTTA","text":"Well done! Now you finally have your hands on the prize!"},{"name":"RIGGY","text":"Friend find prize eggy! Riggy proud! Proooud!"},{"name":"JIHLIALIAPOH","text":"I must say, you two are jolly clever for thinking up such a wonderful─not to mention difficult─game!"},{"name":"RIGGY","text":"Riggy love egg hunt! Everyone play together!"},{"name":"RIGGY","text":"But egg hunt over now. Riggy sad..."},{"name":"JIHLIALIAPOH","text":"Oh, you poor thing..."},{"name":"JIHLIALIAPOH","text":"You just wanted to be helpful, didn't you? And you have been! There must be some other way of assisting us, but what?"},{"name":"GABINEAUX","text":"Well, if the lad's up to the task, I've a few odd jobs he can do around here."},{"name":"GABINEAUX","text":"I daresay an enterprising young spriggan like him knows a few things about rocks, soil, and whatnot that we woodsmen could put to good use."},{"name":"NONOTTA","text":"That sounds perfect! He's ever such a hard worker, you know."},{"name":"JIHLIALIAPOH","text":"What do you think of that idea, Riggy?"},{"name":"RIGGY","text":"Riggy help! Helpy help help!"},{"name":"GABINEAUX","text":"You'll get a fair day's wage for a fair day's work, the same as the rest of us."},{"name":"RIGGY","text":"Riggy do best! Do best work!"},{"name":"JIHLIALIAPOH","text":"I never expected that Riggy would go from hiding eggs to finding employment as a lumberjack's apprentice! While that was certainly not part of my dream, I think we can all agree it has led to a rather satisfying conclusion."},{"name":"NONOTTA","text":"Which reminds me, we should return to the amphitheatre and bring an official close to this year's egg hunt!"},{"name":"RIGGY","text":"Riggy come back soon, gabby friend!"},{"name":"GABINEAUX","text":"It's Gabineaux. Master Gabineaux, in fact, but that's only once you start working here. Anyway, enjoy the rest of your festival!"},{"name":"JIHLIALIAPOH","text":"And I thought these puzzles could not possibly get any trickier..."},{"name":"Q1","text":"Would you like Jihli to share her thoughts?"},{"name":"JIHLIALIAPOH","text":"I wonder why there are so many more letters this time?"},{"name":"JIHLIALIAPOH","text":"Could it be that there is an extra step or two involved?"},{"name":"Q2","text":"Would you like Jihli to share more of her thoughts?"},{"name":"JIHLIALIAPOH","text":"If we start by using a similar technique to the previous puzzle, what do we get?"},{"name":"JIHLIALIAPOH","text":"It might even be more than just one word."},{"name":"JIHLIALIAPOH","text":"I wonder if this will lead to the answer or simply another clue?"},{"name":"Q3","text":"Would you like Jihli to share yet more of her thoughts?"},{"name":"JIHLIALIAPOH","text":"This is clearly a lot more complex than the last conundrum."},{"name":"JIHLIALIAPOH","text":"Perhaps it would be easier if I marked the locations of the spriggans on the map?"},{"name":"JIHLIALIAPOH","text":"That's better!"},{"name":"JIHLIALIAPOH","text":"Though obviously we still have to find the hidden word, or words, as the case may be."},{"name":"Q4","text":"Would you like Jihli to share even more of her thoughts?"},{"name":"JIHLIALIAPOH","text":"It seems the sensible thing to do is combine all the information we have at hand."},{"name":"JIHLIALIAPOH","text":"Goodness! It all looks rather messy, doesn't it?"},{"name":"JIHLIALIAPOH","text":"Wait a moment... O, N, E, T, H, R, E, E, F, I, V, E?"},{"name":"JIHLIALIAPOH","text":"What a strange name! Hmm... Unless I am mistaken, that is not a name at all!"},{"name":"Q5","text":"Would you like Jihli to all but solve the puzzle for you?"},{"name":"JIHLIALIAPOH","text":"Yes, this must be “one, three, five.”"},{"name":"JIHLIALIAPOH","text":"Hmm... Could that be it? Why, I believe I know someone in the Central Shroud by that name!"},{"name":"NONOTTA","text":"You're not thinking about giving up, are you?"},{"name":"NONOTTA","text":"Now that we're all back at the center of the Hatching–tide festivities, the time has come to officially present the gilded topaz egg!"},{"name":"NONOTTA","text":"It is with great pleasure that I award you...the rest of your spriggan costume!"},{"name":"JIHLIALIAPOH","text":"You mean to say there are other garments to match this glorious jacket? I cannot wait to try them on!"},{"name":"NONOTTA","text":"Oh, Jihli! You were born to wear this sumptuous ensemble!"},{"name":"RIGGY","text":"Long blue legs! Pretty like spriggan! Blue like...not spriggan! Riggy confused!"},{"name":"JIHLIALIAPOH","text":"Oh, Riggy! You have a lot to learn about fashion, it seems!"},{"name":"JIHLIALIAPOH","text":"On the other hand, you could teach me a thing or two about creating games for Hatching–tide. The same goes for you, Nonotta!"},{"name":"NONOTTA","text":"I'm glad all those evenings spent scratching our heads were not in vain."},{"name":"JIHLIALIAPOH","text":"And best of all, Riggy has found himself a job!"},{"name":"RIGGY","text":"Worky work work!"},{"name":"JIHLIALIAPOH","text":"Of course, I would never have solved that conundrum all by myself. Thank you ever so much, <span class=\"highlight\">Forename</span>!"},{"name":"JIHLIALIAPOH","text":"It looks like I will have to try harder than ever to stand a chance of matching the spectacular efforts of these two geniuses! I hope you will join us for next year's Hatching–tide!"},{"name":"JIHLIALIAPOH","text":"Now that Nonotta and Riggy have proved that the puzzle can indeed be solved─provided one possesses a certain degree of intelligence─we can allow the festival-goers to participate. I do hope our spriggan helpers do not mind remaining stationary for the time being..."},{"name":"RIGGY","text":"Riggy make game! Riggy chop wood! Riggy helping!"},{"name":"GABINEAUX","text":"I shall need to make a space for the boy to sleep. Do you happen to know what spriggans use for bedding? A carefully arranged pile of rocks or some such, I expect!"}],"reward":{"gil":296,"items":[{"id":24606},{"id":24607}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68739]}},"partials":[{"type":"npc","id":"1027046","obj":{"i":1027046,"n":"Jihli Aliapoh","l":52,"q":1}},{"type":"npc","id":"1027033","obj":{"i":1027033,"n":"Nonotta","l":53,"q":1}},{"type":"item","id":"24606","obj":{"i":24606,"n":"Spriggan Bottoms","l":1,"c":47297,"t":36,"p":156}},{"type":"item","id":"24607","obj":{"i":24607,"n":"Spriggan Boots","l":1,"c":49110,"t":38,"p":94}},{"type":"quest","id":"68739","obj":{"i":68739,"n":"A Shelltered Eggsistence","g":199,"l":"Gridania","s":175}}]}