{"quest":{"name":"Once, Twice, Three Times a Warrior","location":"Eastern La Noscea","id":68748,"patch":5.0,"sort":800,"icon":100875,"eventIcon":71221,"issuer":1006746,"target":1006746,"genre":149,"journal":["Curious Gorge is training here, but his mind is elsewhere.","Curious Gorge has been training as hard as ever and has indeed grown stronger for it, yet upon seeing you for the first time in an age, he immediately recognizes that you have grown stronger still. After you regale him with tales of your adventures in the First, particularly those of Granson and Dikaiosyne, he concludes that the reason for his limited growth is love─or rather, that he has been unable to put it out of his mind. Curious Gorge has sent many missives to Dorgono in the Far East, but has yet to receive even a single reply, and so he resolves to go and see her in person...and thus is not present when Dorgono and her father Luvsan arrive moments later, having recently come all the way from the Azim Steppe to thank in person all those who aided the Qerel. Since Curious Gorge is nowhere to be found, you are to proceed to the Moraby Drydocks where Broken Mountain and his warriors can be found.","During the course of their conversation, Broken Mountain admits to Luvsan that he does not carry an axe because he can no longer fight. However, the elder Xaela does not believe all hope is lost, and proposes a treatment that may restore him to fighting condition. A certain type of moss will be necessary for this, and Luvsan believes he saw a suitable substitute on the way to the docks.","The moss in question can be found growing on boulders strewn throughout the general vicinity, and Luvsan bids you gather it by first shattering them with a Heavy Swing, which should render it easier to collect. If nothing else, it is inarguably a more dramatic way of gathering moss than gently scraping it off.","You succeed in gathering the moss in the distinct warrior fashion. Luvsan should be satisfied with the quantity in your possession.","Taking advantage of your privacy, Luvsan confesses that he had an ulterior motive for coming to Eorzea: to confirm his suspicions that his daughter had fallen in love with a warrior of the West. After meeting you, he concludes that you are the suitor in question, and offers to bless your union─at which point Dorgono returns and puts an end to the discussion for the time being.","With all gathered for the ritual, Luvsan offers an elixir to Broken Mountain, who drinks deep. Finally, he instructs you to strike the injured warrior with all your might, assuring you both that it is the only way. Though Broken Mountain is understandably uncomfortable with this proposal, the die is cast, and only a Heavy Swing will suffice.","Broken Mountain weathers your assault, and moments later finds himself filled with newfound strength. He is a warrior reborn, and the beast within is his to command. As all celebrate his successful recovery, Curious Gorge approaches─but observing from afar, mistakes Dorgono's joyful smile as an expression of her love towards you, leading him to succumb to his inner beast and charge. Fortunately, before it turns into a needlessly messy and violent affair, she brings him to his senses with a single blow.<br><br>After Curious Gorge recovers, he apologizes for the misunderstanding, and joins in celebrating his brother's miraculous recovery. Sensing that this is the Western suitor, Luvsan silently approves, and declares that it is time to return to the Steppe─alone. Dorgono, however, is to remain in Eorzea, where she will continue to hone her skills until she is a warrior fit to be wed. Needless to say, both she and Curious Gorge are more than satisfied with this state of affairs, and together they return to Hidden Falls to begin their training together.","Curious Gorge reminds you not to grow complacent in your own efforts to grow stronger still, for with Broken Mountain healed and Dorgono in Eorzea for the time being, your competition for the title of the realm's greatest warrior has grown that much more intense. And indeed, the day may come when one of the three will dethrone you...but not yet."],"objectives":["Speak with Broken Mountain in lower La Noscea.","Speak with Luvsan.","Use Heavy Swing on mossy boulders to obtain shivermoss.","Deliver the shivermoss to Luvsan.","Speak with Luvsan.","Use Heavy Swing on Broken Mountain.","Speak with Curious Gorge in eastern La Noscea."],"dialogue":[{"name":"CURIOUSGORGE","text":"Oh, <span class=\"highlight\">Forename</span>...how long has it been? I've been dedicating myself wholly to my training for some time now, day after day after day, but I fear my progress has come to a halt of late."},{"name":"CURIOUSGORGE","text":"You look well. A fair bit stronger than I remember, even. What is your secret, my friend? How have you grown so much more powerful?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"So I got sucked into this portal and traveled to another world..."},{"name":"A1","text":"I went toe-to-toe with this fellow called Dikaiosyne..."},{"name":"CURIOUSGORGE","text":"Wait, wait─ I can tell this is going to take a while. Since I've just finished my training, why don't we speak at length on dry land?"},{"name":"CURIOUSGORGE","text":"So there are more worlds than this, eh? That's a lot to take in... And this Granson, ye gods. To see the woman you love taken from you before your very eyes... &lt;sniffle&gt; No wonder he struggled so mightily to pick up the pieces of his life..."},{"name":"CURIOUSGORGE","text":"After listening to your tale, I realize what it is I've been missing. The one thing I lack to spur me to even greater heights!"},{"name":"CURIOUSGORGE","text":"'Tis love!"},{"name":"CURIOUSGORGE","text":"I sent several missives to Dorgono, you see, but she has yet to respond even once! I've waited patiently, eagerly, but still! Still no word has arrived!"},{"name":"CURIOUSGORGE","text":"Fear has crept into my heart. Has she forgotten me? Has she met another!?"},{"name":"CURIOUSGORGE","text":"I cannot rest until I know the reason for her delay! I must know! This is no time for training!"},{"name":"CURIOUSGORGE","text":"Nor can I afford to be patient. Granson's time with his beloved was cut short─who is to say ours will not be as well? Or worse, if it already has..."},{"name":"CURIOUSGORGE","text":"It is decided! I will purchase passage on the next ship for the Far East and return to the Azim Steppe with all haste! I'm coming, Dorgono!"},{"name":"DORGONO","text":"<span class=\"highlight\">Forename</span>, how fortunate you are here! I have been looking all over for Curious Gorge. The Marauders' Guild told me he trained near here, but I did not know you did as well!"},{"name":"DORGONO","text":"What do you mean he's going to the Steppe to see me because I never answered any of his missives? Is this a joke?"},{"name":"DORGONO","text":"No matter how many he sent, I would have never responded. Our people have no written tongue. Whatever reached us was probably fed to the goats. Anyway─let us hope that someone informs him of our arrival before he gets on a ship..."},{"name":"DORGONO","text":"As for why I have traveled all this way, it was at the behest of my father, who wished to thank you and Curious Gorge personally for fighting on our behalf."},{"name":"LUVSAN","text":"I am Luvsan of the Qerel, and you are <span class=\"highlight\">Forename Surname</span>─the khagan who stood with my people against the Chaghan."},{"name":"LUVSAN","text":"But that is not all, for you also helped my youngest daughter gain control over the will of Karash. No words can express the depth of my gratitude to you."},{"name":"DORGONO","text":"You promised not to speak of Karash..."},{"name":"LUVSAN","text":"But I must. My heart broke when she was marked as Taken and exiled. Never again would I see her, I feared. But then she returned! Blood of my blood, master of Karash! My little girl...and it is all because of you."},{"name":"LUVSAN","text":"In thanks for your deeds, I wish to present to you thirty horses─"},{"name":"DORGONO","text":"Father, no! It is not the way of Eorzea to give horses as thanks! And besides, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is a traveler! They would only be a burden!"},{"name":"LUVSAN","text":"I apologize, khagan. Now then─I must also express my gratitude to the others. Warriors of the Maelstrom, were they? I believe I recall the way..."},{"name":"DORGONO","text":"If you have the time to spare, might you accompany us? Having traveled so long solely in the company of my father, I am finding him increasingly exhausting..."},{"name":"LUVSAN","text":"Well do I know how difficult my daughter can be, and so I wish to present you with a gift as an expression of my gratitude. I am told you would have no use for horses, but what about fifty goats?"},{"name":"DORGONO","text":"It brings me joy to see the Lominsan warriors in good health!"},{"name":"WARRIOR02902","text":"Gorge's got good taste, aye. If it weren't for him, I'd have a mind to...er...give a polite and wholly appropriate compliment and be on my way."},{"name":"BROKENMOUNTAIN","text":"It is a pleasure to see you again, <span class=\"highlight\">Forename</span>, as well as Dorgono. I am surprised to see her as you doubtless are, and in the company of her father besides..."},{"name":"LUVSAN","text":"...I must insist that you accept a small token of my appreciation. I do not doubt my daughter was quite the handful. No less than fifty goats, I think, should suffice for the imposition─"},{"name":"DORGONO","text":"Fifty goats would be a far greater imposition, Father!"},{"name":"BROKENMOUNTAIN","text":"It really was no bother, sir. A pleasure, honestly─and a regrettably short one at that. So much so that we were hoping we might see her again, so you can imagine our surprise and our delight when you arrived."},{"name":"LUVSAN","text":"If not horses or goats, then... Wait. Are you not the leaders of these warriors? Yet you do not carry an axe. Why is this?"},{"name":"BROKENMOUNTAIN","text":"That is...that is because I cannot. Not since I was defeated by mine own brother in battle. He had succumbed to his inner beast─your Karash─and struck a blow with such ferocity from which I have never fully recovered."},{"name":"BROKENMOUNTAIN","text":"But it is well that he did, for I too was in thrall to the beast at the time. Had he not given it his all, countless innocents may have died by my hand..."},{"name":"LUVSAN","text":"It is not an unfamiliar story. Many a Qerel has suffered a grievous injury which rendered them unable to fight."},{"name":"LUVSAN","text":"But I am a boo─a healer, and I can help you to wield your axe once more."},{"name":"BROKENMOUNTAIN","text":"This is in your power? I...I did not think it was possible!"},{"name":"LUVSAN","text":"It pains me to see a warrior who yet yearns to fight but cannot. Allow me to treat you as repayment for your kindness."},{"name":"BROKENMOUNTAIN","text":"Full glad am I to accept! Thank you, sir, thank you..."},{"name":"LUVSAN","text":"This treatment requires a quantity of shivermoss. While it is not native to your land, I believe a similar type grows here. Let us go and gather some."},{"name":"BROKENMOUNTAIN","text":"You lot return to your training for now."},{"name":"BROKENMOUNTAIN","text":"I don't know about you, <span class=\"highlight\">Forename</span>, but I'm bloody excited!"},{"name":"DORGONO","text":"Do you have any siblings, khagan? I am youngest of eighteen myself..."},{"name":"LUVSAN","text":"The moss of which I spoke I spied in this place not long ago. We will need a moderate amount for the ritual to heal Broken Mountain. You and Dorgono can both assist me in this."},{"name":"LUVSAN","text":"Look for mossy rocks nearby and shatter them with a Heavy Swing, then gather up the shivermoss."},{"name":"DORGONO","text":"Ah, I remember this game! The marauders were always breaking rocks to hone their skills. This will be easy!"},{"name":"SYSTEM","text":"Use Heavy Swing on mossy boulders to obtain shivermoss."},{"name":"LUVSAN","text":"To be fair, you need not actually shatter the rocks to gather the moss, but it hastens the process and makes a somewhat dull process a little more entertaining, do you not think?"},{"name":"LUVSAN","text":"You wield your axe with great skill, khagan. May I have the shivermoss?"},{"name":"LUVSAN","text":"Very good. Now, before my daughter returns, there is one other matter which I must discuss with you."},{"name":"LUVSAN","text":"She is a woman grown, and as her father I must think of her future. Of marriage."},{"name":"LUVSAN","text":"Alas, she has shown no interest in any warriors of the Qerel. At first I thought none suited her, but then I began to wonder...was her mind made up? Had she already chosen a suitor?"},{"name":"LUVSAN","text":"Realizing this, I persuaded her to come with me to Eorzea. And now that we have met, I feel more certain than ever. Dorgono has fallen in love with a warrior of another land..."},{"name":"LUVSAN","text":"...And I could not be happier for her. For who could disapprove of the champion who stood against the Chaghan?"},{"name":"LUVSAN","text":"<span class=\"highlight\">Forename Surname</span>, khagan of the Steppe, I will not oppose the union of you and Dorgono. I offer you my blessing."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"My heart belongs to the sea."},{"name":"A2","text":"Did I mention I'm eternally bonded to someone else?"},{"name":"A2","text":"Honestly I'm not all that keen on the whole institution of marriage..."},{"name":"A2","text":"So there's this bloke called Gorge..."},{"name":"A2","text":"Don't mind if I do!"},{"name":"DORGONO","text":"Hey! HEY! Who are you to decide such things for me!?"},{"name":"DORGONO","text":"I will not marry <span class=\"highlight\">Forename</span>! I have already chosen a suitor, and it is not <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"LUVSAN","text":"Oh! I see... I was so certain that... Ahem. So...who is this other...?"},{"name":"DORGONO","text":"We will not discuss this any further! We have the moss, now let us go and prepare for the ritual!"},{"name":"LUVSAN","text":"Pray forgive me, khagan. I spoke out of turn. Dorgono is right─we should attend to the ritual and restore Broken Mountain to the warrior he was."},{"name":"DORGONO","text":"I'm so sorry he spoke to you like that. It is a bad habit of his, meddling in affairs that are not his concern..."},{"name":"BROKENMOUNTAIN","text":"I know not what sort of ritual this is. Do you? The traditions of the Qerel are a complete and utter mystery to me..."},{"name":"LUVSAN","text":"I have brewed an elixir using the moss. Drink it now."},{"name":"LUVSAN","text":"Very good. Your body is ready. You must now receive of the power of another great warrior. I can think of none more suitable than you, khagan."},{"name":"LUVSAN","text":"We must awaken the Karash within him once more. I bid you summon the strength of Father Azim and strike Broken Mountain with all your might!"},{"name":"BROKENMOUNTAIN","text":"You bid <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> what now!?"},{"name":"LUVSAN","text":"<span class=\"emphasis\">All your might</span>! Hold nothing back! Swing to kill! Anything less and he will be crippled worse or die!"},{"name":"SYSTEM","text":"Muster all your strength and attack Broken Mountain with a Heavy Swing."},{"name":"LUVSAN","text":"Do not hesitate, khagan! Strike him down as you would your most hated enemy, else this treatment will end in failure."},{"name":"DORGONO","text":"Do it, <span class=\"highlight\">Forename</span>! Do it!"},{"name":"BROKENMOUNTAIN","text":"This seems like the exact opposite of what would benefit me..."},{"name":"BROKENMOUNTAIN","text":"Ugh!"},{"name":"BROKENMOUNTAIN","text":"Seven hells, what is this...this feeling I feel welling up from deep within? This fire, this passion...this rage!"},{"name":"BROKENMOUNTAIN","text":"The beast stirs again! Its power is mine! It fills me with strength, yet I remain in control! Huzzah!"},{"name":"LUVSAN","text":"The strength never left you, my friend. The injury was not one of the flesh, but of the heart. Trickery of the mind, a deception of the self."},{"name":"LUVSAN","text":"The elixir served only to steel your flesh and dull the pain, so you could stand fast against the khagan's axe. You will not need it again, for the fear that held you hostage has fled."},{"name":"BROKENMOUNTAIN","text":"I see... It was in my head all this time. It's no secret that fear can cripple a man worse than any wound, but I never thought... Gods, what a fool I've been."},{"name":"BROKENMOUNTAIN","text":"Thank you so much for helping me to overcome my foolishness, Luvsan. You've made me a warrior again!"},{"name":"LUVSAN","text":"Thank <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, for a warrior of surpassing strength and power is indispensable for this ritual. No other could have served as well."},{"name":"DORGONO","text":"Aye, for there is no greater warrior than <span class=\"highlight\">Forename</span>!"},{"name":"CURIOUSGORGE","text":"How could you, <span class=\"highlight\">Forename</span>...? You and Dorgono, all this time... It all makes sense now. The letters, the silence. It was you..."},{"name":"DORGONO","text":"Curious Gorge, what is this nonsense you speak? What's gotten into you?"},{"name":"CURIOUSGORGE","text":"Graaaghhh! Gaaarrrghhh!"},{"name":"DORGONO","text":"Oh no you don't, you stupid fool!"},{"name":"CURIOUSGORGE","text":"I am so sorry, everyone. When I went to the docks to find a ship bound for the Far East, I ran into some marauders who told me Dorgono and her father had come."},{"name":"CURIOUSGORGE","text":"So overcome by joy I began searching for them at once, but when I finally found you here, and saw how you looked on <span class=\"highlight\">Forename</span> with such joy, all my earlier fears came rushing back, and the beast within me seized control..."},{"name":"DORGONO","text":"It had better not happen again! You're lucky I held back. Next time I won't!"},{"name":"CURIOUSGORGE","text":"And Brother! Is it true that you have fully recovered? You are a warrior reborn? Congratulations! It is like a dream come true!"},{"name":"BROKENMOUNTAIN","text":"Indeed, Brother, indeed! At first I struggled to believe it, but it is as Luvsan says! I must go and join in the training sessions at once. And do not fear─the beast will not claim me again!"},{"name":"CURIOUSGORGE","text":"I cannot thank you enough, Luvsan. It has been longer than I can remember since my brother smiled so. You've given us such a gift..."},{"name":"LUVSAN","text":"It is the least I could do after all you have done for my daughter. Thank you for your kindness and your hospitality. Our time is short, however, and we must be on our way..."},{"name":"DORGONO","text":"Having said that... Dorgono. I am reminded that you are still young and want for experience. You are not yet a warrior fit to wed, and so I bid you continue to strengthen your body and mind here, in this land. It suits you, I think."},{"name":"DORGONO","text":"Did you hear that? I can stay! We can even train together─I can show you all the techniques we Qerel use to hone our skills!"},{"name":"CURIOUSGORGE","text":"Aye, but first I must teach you my methods! You must come with me to Hidden Falls, right this instant!"},{"name":"CURIOUSGORGE","text":"You too, <span class=\"highlight\">Forename</span>! I've a few final words I wish to say to you there."},{"name":"CURIOUSGORGE","text":"I trust you understand what all this means, my friend. Now that my brother has taken up the axe again, the competition for the title of Eorzea's greatest warrior will be that much more intense!"},{"name":"DORGONO","text":"Don't forget I'm in the running too, you know!"},{"name":"CURIOUSGORGE","text":"So keep at it, warrior, for the time will come when we challenge you again!"}],"reward":{"gil":1641,"items":[{"id":25190},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":22}],"questsType":"all","quests":[68440,68784]}},"partials":[{"type":"npc","id":"1006746","obj":{"i":1006746,"n":"Curious Gorge","l":32,"q":15}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68440","obj":{"i":68440,"n":"The Heart of the Problem","g":149,"l":"The Azim Steppe","s":700,"f":1}},{"type":"quest","id":"68784","obj":{"i":68784,"n":"To Have Loved and Lost","g":179,"l":"Il Mheg","s":151,"f":1}}]}