{"quest":{"name":"One Short Day on Emerald Avenue","location":"Ul'dah","id":68745,"patch":4.5,"sort":173,"repeatable":1,"icon":100823,"eventIcon":71222,"issuer":1027151,"target":1027151,"genre":198,"journal":["The royal seneschal is eager to see more floral crowns on the heads of Little Ladies' Day celebrants.<br>※This quest is available for a limited time only.","In the name of letting no princess go uncrowned, the royal seneschal divides his current stock of daisy crowns with you─though he is running low, and hopes to receive more from his staff shortly. He advises that you stand under a peach tree by the Gate of Nald and keep watch for any would-be princesses or seneschals in the meantime.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Your diligent scanning of Emerald Avenue soon rewards you with a fateful encounter─and a story to tell the royal seneschal. Once again, Aldiytha's plan has succeeded in making Ul'dah a brighter place this Little Ladies' Day.","You share your tale with the royal seneschal, who promises to see it relayed to Aldiytha. Of course, there are still many whose smiles may shine under a crown of daisies, should you be in the mood to continue spreading joy throughout the city."],"objectives":["Wait under the peach tree.","Report to the royal seneschal."],"dialogue":[{"name":"BUTLER","text":"If you have the time, I could certainly use more assistance in presenting our flower crowns to those on Emerald Avenue. As I mentioned, it is at the center of our Little Ladies' Day celebration, and nary a moment passes without a would-be princess or seneschal walking by!"},{"name":"BUTLER","text":"I will divide my remaining stock with you─please wait by yonder peach tree and offer crowns to any potential celebrants whom I have missed. My staff is weaving more as we speak, so return to me when you need to resupply!"},{"name":"BUTLER","text":"I can scarce remember a more hectic Little Ladies' Day─but the smiles of newly crowned princesses and their seneschals make all of our efforts worthwhile, don't you agree?"},{"name":"WEDGE","text":"Hey, it's <span class=\"highlight\">Forename</span>!"},{"name":"BIGGS","text":"We're here on Ironworks business─visiting the Miners' Guild to inquire about supplies and whatnot─but we hardly expected to see you here! What brings you to Ul'dah?"},{"name":"WEDGE","text":"Flower crowns for Little Ladies' Day? What a nice idea!"},{"name":"BIGGS","text":"Indeed it is! I'll take one, if you don't mind."},{"name":"WEDGE","text":"Er...if you say so. I'm not sure it'll match your goggles, though."},{"name":"BIGGS","text":"I'm not going to <span class=\"emphasis\">wear</span> it! It'd make a nice decoration for our little corner of Rhalgr's Reach, is all."},{"name":"BIGGS","text":"We've been so harried lately, what with saving the world from Omega, sorting all the data, Cid's emotional issues... A floral decoration will bring some much-needed tranquility to the place."},{"name":"WEDGE","text":"That may be a bit much for one ring of daisies to handle. I'd rather give it to Tataru─I think it'd bring out the pink in her eyes. She'd like it, wouldn't she?"},{"name":"WEDGE","text":"（★未使用／削除予定★）"},{"name":"BIGGS","text":"Thank you kindly. It's so colorful... I bet Alpha would love it, were he here. I hope he's learned about Little Ladies' Day, wherever he may be."},{"name":"WEDGE","text":"I bet he has─and all sorts of other things besides! Most of this world is new to him, after all. He's probably having a wonderful time, so we shouldn't...we shouldn't..."},{"name":"WEDGE","text":"Waaah! I miss Alphaaa!"},{"name":"NANAMOULNAMO","text":"Why, how nice it is to see you, <span class=\"highlight\">Forename</span>! 'Tis I, your favorite common merchant's daughter, come to enjoy the Little Ladies' Day celebration."},{"name":"NANAMOULNAMO","text":"Well met, adventurer. I am Lilira─no one of note, I fear. Merely another merchant's daughter."},{"name":"NANAMOULNAMO","text":"Oho, is that a flower crown I spy? How lovely! Could I perchance trouble you for one?"},{"name":"PAPASHAN","text":"Lady Lilira, do you not think that a crown will cause you to, er...<span class=\"emphasis\">stand out</span> overmuch?"},{"name":"NANAMOULNAMO","text":"Not at all! This is a day on which <span class=\"emphasis\">all</span> little ladies are as princesses, is it not? Or do you believe that a crown will not suit one such as I?"},{"name":"PAPASHAN","text":"M-My lady, that was hardly my intention..."},{"name":"NANAMOULNAMO","text":"Hahaha! I jest, I jest! I well understood your meaning."},{"name":"NANAMOULNAMO","text":"Yet my point stands─as a little lady, it is fitting that I have a crown. And I would quite like one, besides."},{"name":"NANAMOULNAMO","text":"I expect that everyone at home will be surprised─it has been quite some time since I was last a princess. Hmm, or shall I play the role of Sultan Baldric instead? “My lady, I am your royal seneschal!”"},{"name":"PAPASHAN","text":"I only ask that you avoid any <span class=\"emphasis\">jests</span> that may alarm your other attendants. I nearly perished on the spot!"},{"name":"YELLOWMOON","text":"&lt;gasp&gt; Could it be? The garland spoken of in faerie tales and romances... The accessory of my childhood dreams... A flower crown!?"},{"name":"YELLOWMOON","text":"How wonderful! It will perfectly suit a fair maiden such as I, don't you agree? Oh, I can hardly wait to show Bitter Snow─he'll fall in love with me all over again!"},{"name":"ADALBERTA","text":"If it isn't Yellow Moon! I see you're enjoying your flower crown. We picked ours up from the royal seneschal just a moment ago. Aren't they cute?"},{"name":"YELLOWMOON","text":"Adalberta! You look positively precious!"},{"name":"YELLOWMOON","text":"And you, Mylla, are stunning! Somehow your steely gaze makes your crown all the lovelier. You should decorate your hair more often!"},{"name":"MYLLA","text":"I feel utterly ridiculous. But Adalberta insists I wear the thing..."},{"name":"ADALBERTA","text":"Come now, there's no use pretending─you know you like it. And you'll be turning heads for the rest of the day. One head in particular, I'm su─"},{"name":"MYLLA","text":"Not. Another. Word. Do you hear me?"},{"name":"YELLOWMOON","text":"Now, now, no murder on Little Ladies' Day! It's not ladylike!"},{"name":"MYLLA","text":"Oh, I would never harm Adalberta─she's one of my oldest and dearest friends. Even if she is constantly pestering me."},{"name":"ADALBERTA","text":"Well, someone has to do it!"},{"name":"SEVERIAN","text":"...Is that you, my loyal assistant? Why are you standing about gormlessly in the middle of town?"},{"name":"SEVERIAN","text":"Why do your eyes fixate on me so? If you're in need of some piddling potion or other, direct your vacuous gaze at some other alchemist. My attentions are occupied by more important matters."},{"name":"SEVERIAN","text":"A flower crown? How utterly banal."},{"name":"SEVERIAN","text":"Though, were one to apply an admixture of the appropriate viscosity and translucence, it may be possible to preserve its beauty evermore, thereby defying principles that have heretofore been presumed unyielding... Perhaps I do require one after all."},{"name":"COCOBUKI","text":"Hm hm hm... Guildmaster Redolent Rose, if I'm not mistaken. What brings you here?"},{"name":"REDOLENTROSE","text":"Ah, a master of the Thaumaturges' Guild! I recall the eyepatch, so you must be Coco...er..."},{"name":"COCOBUKI","text":"Cocobuki, yes."},{"name":"REDOLENTROSE","text":"That was it! As to your question, I've come to evaluate the fashions of the day. And by “evaluate” I simply mean “observe,” of course. I'm not keeping score. Who would do that? Hahaha... Anyway, the flower crowns certainly are charming, are they not?"},{"name":"COCOBUKI","text":"Charming...yes. Such an embellishment would ill suit me. Busi, on the other hand..."},{"name":"COCOBUKI","text":"One crown, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>!"},{"name":"COCOBUKI","text":"A pleasing headpiece, and perhaps suitable for later use in alchemic solutions. Busi will be delighted."},{"name":"REDOLENTROSE","text":"His name may be impossible to remember, but he's unmistakably the eldest brother. I do hope his siblings know how much he cares."},{"name":"SERENDIPITY","text":"<span class=\"highlight\">Forename</span>! Are you helping the royal seneschal this year? How kind of you!"},{"name":"SERENDIPITY","text":"Hello there, adventurer! Thank you for helping the royal seneschal─volunteers like you make Little Ladies' Day an event I look forward to year after year!"},{"name":"HAMON","text":"Oho, if it isn't <span class=\"highlight\">Forename</span>! And Mistress Serendipity, shimmering with youth!"},{"name":"HAMON","text":"If it isn't Mistress Serendipity, shimmering with youth!"},{"name":"SERENDIPITY","text":"I'm...pretty sure that's just light reflecting off of my accessories. But what brings you here, Master Hamon?"},{"name":"HAMON","text":"Hamon Holyfist would never forgo a chance to celebrate with the ladies, ohohoho! Keeps me vigorous."},{"name":"HAMON","text":"And what about you, Mistress Serendipity? Do you require a seneschal for the day? I would be at your beck and call─managing your mammets, polishing your hammers, delivering righteous blows to the teeth of persistent suitors..."},{"name":"SERENDIPITY","text":"Oh, my! That's very...specific of you, but I couldn't ask you to do that! And Chuchuto would probably be less than pleased to find you eschewing your own guild duties in favor of mine."},{"name":"HAMON","text":"Oh, woe is me! Were I twenty─actually, better make that forty─years younger..."},{"name":"SERENDIPITY","text":"If you'd like to celebrate with someone, why not take one of these flower crowns to Chuchuto and tell her how much you appreciate her? I'm sure she'd be delighted to have your help with some of the more tedious guild work for the day, at the very least. Don't you agree?"},{"name":"HAMON","text":"Make a princess of my ever-devoted disciple, eh? Well, she certainly deserves it!"},{"name":"POPOKKULI","text":"Hm? You, you're that adventurer─<span class=\"highlight\">Forename</span>! What are you up to?"},{"name":"POPOKKULI","text":"Hm, you have the look of an adventurer. If you're looking for beasts to slay, you're in the wrong place, I'm afraid."},{"name":"SESERUKKA","text":"Giving out crowns for Little Ladies' Day? Interesting! Shall we take one to Nenekko?"},{"name":"POPOKKULI","text":"Not a bad idea! She always did love it when we read the Legend of the Lost Lady to her as a child."},{"name":"POPOKKULI","text":"She's been so immersed in her research lately that she's like to have forgotten about Little Ladies' Day altogether, which means it'll be a pleasant surprise!"},{"name":"GREINFARR","text":"Heh. She's a lucky girl, to have you two watching over her."},{"name":"SESERUKKA","text":"While we're on the subject, Greinfarr, isn't there anyone you would want to give one of these crowns to?"},{"name":"GREINFARR","text":"Wh─ No! Of course not. I am far too busy training to even think of such things."},{"name":"GREINFARR","text":"In fact, the Bronze Bull hears the call of the arena right now! Farewell!"},{"name":"ULALA","text":"Why, it's <span class=\"highlight\">Forename</span>! I was hoping I might find our biggest fan amongst the <span class=\"alternative-container\"><span class=\"alternative\">princesses</span><span class=\"alternative\">seneschals</span></span>, and here you are!"},{"name":"NARUMI","text":"It's wonderful to see you again! I was so worried that we wouldn't meet this year."},{"name":"MASHAMHAKARACCA","text":"A happy coincidence indeed. And before you ask─because I know you will─though our performances aren't the main event this year, our stage career is still going strong. So I had better not see you fretting when you should be celebrating!"},{"name":"ULALA","text":"Hello there, adventurer─I don't believe we've met. I'm Ulala, beloved star of the Songbirds and soon-to-be number one songstress in all of Eorzea!"},{"name":"NARUMI","text":"I am Narumi. Though I lack Ulala's boldness, I too believe that our ensemble can reach the realm through our performances. I hone my voice night and day to make certain that when we do, I can stand proudly before our audience and lift their hearts with my song."},{"name":"MASHAMHAKARACCA","text":"And I'm Masha Mhakaracca─you can call me Masha. My voice may not be as sweet as Narumi's, but I more than make up for that with my dancing. I live to inspire our fans to move with the music!"},{"name":"ULALA","text":"So, are you waiting for your <span class=\"alternative-container\"><span class=\"alternative\">seneschal to come? Or maybe your princess</span><span class=\"alternative\">princess to come? Or maybe your seneschal</span></span>?"},{"name":"NARUMI","text":"Oh, I adore flower crowns! May we each have one?"},{"name":"MASHAMHAKARACCA","text":"Come to think of it, this seems like the perfect opportunity for one of our signature friendly competitions. Shall we ask <span class=\"highlight\">Forename</span> to judge who wears her crown best?"},{"name":"ULALA","text":"Oh, absolutely! It never hurts to gauge public opinion─and I'm confident that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> will make the objectively correct choice."},{"name":"NARUMI","text":"No matter how many times we do this, I can't help but feel nervous! But, well...<span class=\"highlight\">Forename</span>, what do you think? Who does the crown best suit?"},{"name":"Q1","text":"Who will you choose?"},{"name":"A1","text":"Ulala─she's so cute I could die."},{"name":"A1","text":"Narumi─the crown befits one gentle of spirit."},{"name":"A1","text":"Masha─poised and graceful, as a princess should be."},{"name":"ULALA","text":"Ha, I knew you would choose me! I am no less pleased to hear it, though. Thank you!"},{"name":"ULALA","text":"The Songbirds will continue to flutter into hearts across Eorzea, so spare a thought for us as you wander far and wide. Until we meet again!"},{"name":"NARUMI","text":"M-Me? I'm honored─thank you! I will remember your words, and I am certain they shall help me find my voice in times of need."},{"name":"NARUMI","text":"I know not where or when it might be, but I look forward to the next time we meet!"},{"name":"MASHAMHAKARACCA","text":"Who, me? I realize that it was I who proposed the contest, but I wasn't expecting to receive such a compliment. Thank you!"},{"name":"MASHAMHAKARACCA","text":"This has been great fun─I hope we'll meet again soon. And wherever you go, remember that the Songbirds are singing for you!"},{"name":"BUTLER","text":"Ah, you have returned. How did you fare?"},{"name":"BUTLER","text":"What a charming tale! We shall have to relay it to Miss Aldiytha─she will be delighted to know that her crowns are the source of such happiness."},{"name":"BUTLER","text":"For my part, I appreciate your continued assistance. Needless to say, you will always be welcome to join me in acting as seneschal to the little ladies of Ul'dah!"}],"reward":{"items":[{"num":10,"id":25006}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[68744]}},"partials":[{"type":"npc","id":"1027151","obj":{"i":1027151,"n":"Royal Seneschal","l":40,"q":1}},{"type":"item","id":"25006","obj":{"i":25006,"n":"Magicked Prism (Daisies)","l":1,"c":22630,"t":85}},{"type":"quest","id":"68744","obj":{"i":68744,"n":"Princess of Flowers","g":198,"l":"Ul'dah","s":172}}]}