{"quest":{"name":"The Sabotender Shimmy","location":"Ul'dah","id":68743,"patch":4.5,"sort":177,"icon":100827,"eventIcon":71221,"issuer":1028241,"target":1028243,"genre":200,"journal":["This young man sighs in audible distress.<br>※This quest is available for a limited time only.","Nanaphon introduces himself, and shares with you his failed attempts to secure the role of Gold Saucer mascot “Senor Sabotender.” As if summoned by the sound of suffering, Godbert Manderville appears, and suggests that a visit to Ririzan at Black Brush Station might provide a solution to the young Lalafell's woes...<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","After relaying the situation to a sympathetic Ririzan, it is revealed that the Black Brush inhabitant was, in fact, the original creator of the Senor Sabotender character. Under Ririzan's brief but intense tutelage, both you and Nanaphon work to master the basics of the mascot's movements. Now prepared both mentally and physically, Nanaphon rushes ahead to the Gold Saucer to try his luck at the audition.","Nanaphon takes his tutor's words to heart, and impresses the judges with his mute and masterful portrayal of an ambulatory cactus. Roland awards him the role on the spot, and you stay behind to congratulate the triumphant Lalafell.","Giddy with excitement, Nanaphon thanks you for your part in helping him win his dream role. Although he'll be unable to speak to you when in costume, Nanaphon promises to treat you to the best Senor Sabotender he can be."],"objectives":["Speak with Ririzan at Black Brush Station.","Speak with Nanaphon at the Gold Saucer.","Speak with Nanaphon."],"dialogue":[{"name":"NANAPHON","text":"I don't know why this time should be any different. &lt;sigh&gt; I'm such a failure..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What's wrong?"},{"name":"A1","text":"Why are you a failure?"},{"name":"NANAPHON","text":"Me! I'm what's wrong. I just don't think I can make it..."},{"name":"NANAPHON","text":"Because I just don't think I can do it..."},{"name":"NANAPHON","text":"Oh, forgive me, I was caught up in my own little world. I didn't mean to burden you with my problems. ...Unless, of course, you have a moment to spare for a stranger's woes?"},{"name":"NANAPHON","text":"(-Nanaphon-)The name's Nanaphon. And more than anything in this life, I want to play the role of Senor Sabotender─that marvelous mascot for the Gold Saucer."},{"name":"NANAPHON","text":"(-Nanaphon-)They're holding auditions right now, in fact. I've tried my best in front of the judges before, but those moves, I just... My body refuses to cooperate."},{"name":"NANAPHON","text":"(-Nanaphon-)The seventh round of trials is just around the corner, and if I fail to qualify again, I think it might be time to face the truth: I'm just not cut out to be a sabotender."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"We can't all be succulent stars..."},{"name":"A2","text":"Who knows? Maybe you'll make it this time!"},{"name":"A2","text":"Wait...Senor Sabotender isn't a real sabotender?"},{"name":"NANAPHON","text":"(-Nanaphon-)I suppose not. And besides, why would they pick me? <span class=\"emphasis\">I</span> wouldn't even pick me..."},{"name":"NANAPHON","text":"(-Nanaphon-)I appreciate the vote of confidence, but I'm afraid I have none myself..."},{"name":"NANAPHON","text":"(-Nanaphon-)Surely you jest? Everyone knows it's a Lalafell in a costume. But it will never be <span class=\"emphasis\">this</span> Lalafell in that costume..."},{"name":"GODBERT","text":"(-Gentlemanly Voice-)Ho ho ho! I may have some advice for you, my distraught and diminutive friend!"},{"name":"NANAPHON","text":"(-Nanaphon-)I know you! Y-You're Godbert Manderville, proprietor of the Gold Saucer!"},{"name":"GODBERT","text":"In the firm and supple flesh! Now, if I heard correctly, you're struggling to emulate our Senor's trademark shimmy, yes?"},{"name":"NANAPHON","text":"(-Nanaphon-)Y-Yes, sir. It's long been my dream to slip on that sabotender suit and bring smiles to people's faces..."},{"name":"GODBERT","text":"A noble endeavor if ever there was one. And it certainly sounds as if you've been giving it the old Manderville try..."},{"name":"GODBERT","text":"...Considering my position, it would hardly be sporting of me to favor one candidate above the others. No, I cannot help you directly, but shall instead point you in the direction of someone who can."},{"name":"GODBERT","text":"Take yourself over to Black Brush Station, and find a fellow by the name of Ririzan. If you're willing to work for your dream, then he's the one to help you achieve it."},{"name":"GODBERT","text":"Why don't you accompany our young friend here, adventurer? I daresay he could use the support, and even a veteran like you might learn a thing or two from the talented Ririzan!"},{"name":"NANAPHON","text":"(-Nanaphon-)Oh, thank you, Master Manderville, thank you!"},{"name":"NANAPHON","text":"(-Nanaphon-)Come on, adventurer─let's not waste another moment!"},{"name":"GODBERT","text":"I've always had a soft spot for the dreamers. Good luck with the instruction, and I'll see you at the Saucer!"},{"name":"GODBERT","text":"If you've never been to the Saucer, I suggest you catch the attention of that well-heeled youth over there. Rumor has it he has an extra airship ticket or two to give away!"},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the quest “It Could Happen to You,” which can be undertaken at level 15."},{"name":"NANAPHON","text":"I'm sorry to bother you, but are you Ririzan, by any chance?"},{"name":"RIRIZAN","text":"The very same. What may I do for you?"},{"name":"RIRIZAN","text":"...Interesting. And might you share the reason <span class=\"emphasis\">why</span> you are so determined to assume the role of Senor Sabotender?"},{"name":"NANAPHON","text":"Of course─it's my favorite story! It all began when I visited the Gold Saucer on the day of its grand opening..."},{"name":"NANAPHON","text":"It was all so magical. I was captivated by the splendid decorations, entranced by the games and attractions."},{"name":"NANAPHON","text":"But what truly struck a chord in my heart was the sight of Senor Sabotender, and the way he left delight in his wake. Even just the sight of his swift-stepping gait brought smiles and laughter!"},{"name":"NANAPHON","text":"Though I strive to be cheerful myself, I have a gloomy streak that tends to rub folk the wrong way."},{"name":"NANAPHON","text":"So you can imagine my excitement when I saw how Senor Sabotender could light up a room without needing to utter a single word! I had found my calling."},{"name":"NANAPHON","text":"Ever since that day, I've attended every single casting audition in the hopes of winning the role. But I never seem to be good enough..."},{"name":"RIRIZAN","text":"Well, I, for one, am convinced of your dedication to the part. And as for mastering the movements, I may have a few pointers to give you."},{"name":"NANAPHON","text":"W-Wait, that spin, you─ You're him!"},{"name":"RIRIZAN","text":"It's been a while now, but yes...I was the original Senor Sabotender!"},{"name":"RIRIZAN","text":"Driven by my undying love for all things sabotender, I spent hours upon hours perfecting my mimicry of their movements─only to be rewarded with the sneers and mockery of my peers."},{"name":"RIRIZAN","text":"But not from Godbert Manderville! No, that magnificent man accepted me in all my prickly ways, even going so far as to hire me as entertainment for his soon-to-be-opened Gold Saucer!"},{"name":"RIRIZAN","text":"Everything from the design of the Senor's costume to his most subtle choreography was given over to my control."},{"name":"RIRIZAN","text":"I strove to become a sabotender, body and mind, and for three whole days neither food nor water passed my lips. Then came the day of the grand opening..."},{"name":"RIRIZAN","text":"I marched and danced with all my might, and just as my shift was coming to an end, I tottered and toppled over the rail of a second floor balcony. My refusal to drink water had been my downfall."},{"name":"RIRIZAN","text":"I survived the tumble, as you can see, but my leg was never the same. Extended performances became impossible, and I was forced to hang up the suit."},{"name":"RIRIZAN","text":"I was only Senor Sabotender for a single day. But now fate has brought you before me, a fellow sabotender enthusiast..."},{"name":"RIRIZAN","text":"My course is clear. I cannot dance for long, but it should be sufficient to pass on the basics...assuming you're willing to learn?"},{"name":"NANAPHON","text":"More than ever!"},{"name":"RIRIZAN","text":"And what of you?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Count me in!"},{"name":"A3","text":"I'm not auditioning for the part..."},{"name":"NANAPHON","text":"Wonderful! We can practice the moves together!"},{"name":"NANAPHON","text":"This is the legacy of the very first Senor Sabotender! How can you not wish to be a part of it!?"},{"name":"RIRIZAN","text":"Then let us begin!"},{"name":"RIRIZAN","text":"Well, I believe you've grasped the fundamentals. All that's left is to embrace the sabotender spirit...to <span class=\"emphasis\">become</span> the Senor!"},{"name":"RIRIZAN","text":"Go, my thousand-needle neophytes! Impress the judges with the authenticity of your audition!"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I am one with the desert sun!"},{"name":"A4","text":"I never saw the attraction of being green and spiky..."},{"name":"NANAPHON","text":"Please don't tell me you're auditioning too! I'm nervous enough as it is!"},{"name":"NANAPHON","text":"Do you mind!? This is my dream we're talking about here!"},{"name":"NANAPHON","text":"I will make the most of your lesson, Master Ririzan! Thank you ever so much!"},{"name":"NANAPHON","text":"Right. If you're ready, adventurer, it's time we were going. The Gold Saucer awaits!"},{"name":"RIRIZAN","text":"I know not to which gods the sabotenders pray, but I wish Nanaphon the very best of their blessings!"},{"name":"NANAPHON","text":"This is it. My seventh audition, and my hands still shake as much as the first time."},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Just give it your all!"},{"name":"A5","text":"Remember: <span class=\"emphasis\">become</span> the Senor!"},{"name":"NANAPHON","text":"I-I was hoping for something a little more...instructional? But, yes, I will give it my all."},{"name":"NANAPHON","text":"Right. Here I go!"},{"name":"NANAPHON","text":"Y-Yes...and sabotenders do not shake!"},{"name":"NANAPHON","text":"But considering the disaster which befell Ririzan, I'll be sure to have a good gulp of water before I begin. Wish me luck!"},{"name":"ROLAND","text":"...Thank you, candidate number six. Let us keep things moving, shall we? Number seven! Now is your time to shine!"},{"name":"ROLAND","text":"A Mister...Nanaphon, is it? Would you care to share something about yourself? Ambitions? Dreams?"},{"name":"NANAPHON","text":"......"},{"name":"ROLAND","text":"...Naught at all?"},{"name":"NANAPHON","text":"......"},{"name":"ROLAND","text":"Ah, you've elected to remain mute, have you?"},{"name":"NANAPHON","text":"......"},{"name":"Q6","text":"What will you shout in encouragement?"},{"name":"A6","text":"You've become a sabotender in truth!"},{"name":"A6","text":"I can almost see the thousand needles!"},{"name":"ROLAND","text":"Yes. Yes! I am reminded of the first Senor Sabotender─of Master Ririzan himself!"},{"name":"ROLAND","text":"Yes. Yes! I feel I might be pierced at any moment!"},{"name":"ROLAND","text":"Simply fantastic!"},{"name":"ROLAND","text":"No need to take this to a vote. Mister Nanaphon, you are hired!"},{"name":"NANAPHON","text":"......"},{"name":"ROLAND","text":"A dedicated performance until the very end. I applaud you, sir."},{"name":"NANAPHON","text":"I-I can hardly believe it! They hired me on the spot!"},{"name":"NANAPHON","text":"I have to thank Master Manderville, and Master Ririzan...and last but not least, I have to thank you, adventurer! I never could have done this without your unwavering support!"},{"name":"NANAPHON","text":"The next time you see Senor Sabotender, it might be me in that costume. I won't break character to speak, so pray do not think me rude..."},{"name":"NANAPHON","text":"I will instead welcome you with the most genuine sabotender antics that I can manage─just as Master Ririzan taught me!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Senor Sabotender</span>!"}],"reward":{"gil":479,"emote":"Senor Sabotender","items":[{"id":14971}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66043,66064]}},"partials":[{"type":"npc","id":"1028241","obj":{"i":1028241,"n":"Lamenting Lalafell","l":40,"q":1}},{"type":"npc","id":"1028243","obj":{"i":1028243,"n":"Nanaphon","l":1484,"q":1}},{"type":"item","id":"14971","obj":{"i":14971,"n":"MGP Gold Card","l":1,"c":26173,"t":61}},{"type":"quest","id":"66043","obj":{"i":66043,"n":"The Gridanian Envoy","g":1,"l":"Gridania","s":86}},{"type":"quest","id":"66064","obj":{"i":66064,"n":"The Ul'dahn Envoy","g":1,"l":"Ul'dah","s":88}}]}