{"quest":{"name":"Princess of Flowers","location":"Ul'dah","id":68744,"patch":4.5,"sort":172,"icon":100822,"eventIcon":71221,"issuer":1027150,"target":1027152,"genre":198,"journal":["The unsettled seneschal is eyeing you so plaintively that it is becoming difficult to ignore.<br>※This quest is available for a limited time only.","Unable to ignore someone in such clear─if well-mannered─distress, you speak with the unsettled seneschal you spotted on the streets of Ul'dah. You discover that he, Rodolph, serves the historic Thorne family, which, once upon a time, gave rise to sultans and sultanas of the selfsame city–state. His charge, Aldiytha Thorne, is currently missing─and likely wishes to remain so, but you nevertheless agree to assist the poor man in locating her.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","It seems Aldiytha left a note indicating that she would be joining the Little Ladies' Day festivities, and Rodolph believes that the royal seneschal and his network of contacts may be of assistance in finding her. Though the event's overseer has not seen the girl, he agrees to help you search Emerald Avenue for her, as that is where he suspects she will be drawn.","You locate Aldiytha not far from the Gate of Nald, gazing up at the redolent blooms of a peach tree. Though Rodolph does his best to convince her to return home, she refuses to acquiesce until she has spread joy to the people of Ul'dah, just as her ancestor Sultan Baldric once did. Her chosen method is the distribution of floral crowns made from daisies that she herself grew, and, moved by her impassioned speech, you agree to accompany her until she has presented them to the townsfolk.","Aldiytha, perhaps slightly overzealous in her chosen task, locates a young lady staring dreamily at the drifting peach blossoms. When you present the girl with a daisy crown, making her feel just like a princess, she jumps for joy. Though Aldiytha appears quite pleased with this reaction, there are yet more would-be royals in need of adornment, so she rushes off in search of the next.","Your next target is a woman of middle age. Though she initially protests, after donning the crown she admits that she feels as if a childhood dream has come true─as does her husband, having gleefully seized upon the opportunity to act as her seneschal (and make her blush). After enjoying a hearty laugh at their own behavior, the two stroll away amiably, while Rodolph reflects on his own youthful dream. Unfortunately, his train of thought is interrupted by Aldiytha's coughing, which alarms all present. Though she soon recovers, it is clear that she has exerted herself more than enough for one day, so she at last agrees with Rodolph that she ought to return home.","As you wait for Rodolph and Aldiytha's carriage, the royal seneschal asks her to share the reason behind her desire to grow and distribute daisies for Little Ladies' Day. She regales you all with a tale of Sultan Baldric, who, in his kindness, accepted a gift of daisies from a common girl and made of them a pair of matching crowns. Moved by this, and all he has seen throughout the day, Rodolph reaffirms his commitment to serving Aldiytha. He presents her with the flower crown she deserves, which she delightedly accepts. The pair thank you, and as you say your good-byes, you─with some encouragement from the royal seneschal─promise to carry on Aldiytha's work, and give flower crowns to all of the would-be princesses and seneschals of Ul'dah."],"objectives":["Speak with the royal seneschal.","Search for the dark-haired lady.","Present a flower crown to the young princess-to-be.","Present a flower crown to the mature princess-to-be.","Speak with Rodolph on Emerald Avenue."],"dialogue":[{"name":"RODOLPH","text":"Please, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, you must help me! The young mistress has gone missing and I..."},{"name":"RODOLPH","text":"...I do beg your pardon. That is hardly an appropriate way to begin a conversation, is it? I quite forgot myself for a moment."},{"name":"RODOLPH","text":"(-Rodolph-)Allow me to introduce myself─I am Rodolph, and I have the honor of serving the noble Thorne family. The young lady of whom I spoke is Aldiytha Thorne, whose whereabouts, I regret to report, are currently unknown."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Should I know who that is?"},{"name":"A1","text":"Escaped her gilded cage, I take it?"},{"name":"RODOLPH","text":"(-Rodolph-)A fair question, and one which I shall endeavor to answer to the fullest. “Spare no detail” are words I live by in my profession, you see."},{"name":"RODOLPH","text":"(-Rodolph-)Ahem. You have doubtless heard of the Thorne Dynasty, the period in Ul'dahn history that began some three hundred years ago. During this time, the Thorne family reigned in the sultanate."},{"name":"RODOLPH","text":"(-Rodolph-)Though they relinquished their stewardship over the nation in favor of restoring the Ul to the throne, the noble scions of the Thorne line have continued to occupy positions of great social importance. Lady Aldiytha is the eldest daughter of the current head of the family."},{"name":"RODOLPH","text":"(-Rodolph-)Alas, she has always been frail of body. For her protection, I do my utmost to keep her from the perils of the outside world. But she has been haler than usual as of late, and when I went to look in on her this morning, I found that she had, ah...given me the slip, one might say."},{"name":"RODOLPH","text":"(-Rodolph-)Ever courteous, she left behind a note stating that she intended to join in the Little Ladies' Day celebrations in town. I certainly understand her desire to do so, given that her health has prevented her attendance in all previous years."},{"name":"RODOLPH","text":"（★未使用／削除予定★）"},{"name":"RODOLPH","text":"(-Rodolph-)However, it is far too dangerous for her to cavort about the city on her own. If she were to be taken ill, or some misfortune to befall her, I would never forgive myself. Oh, it's the Legend of the Lost Lady all over again!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"So, shall we start the search sometime this century, or..."},{"name":"A2","text":"Oooh, the “Legend of the Lost Lady”? Tell me more!"},{"name":"RODOLPH","text":"(-Rodolph-)Good heavens! In sparing no detail, I lost sight of the larger picture. Yes, we must find Lady Aldiytha immediately!"},{"name":"RODOLPH","text":"(-Rodolph-)Ah, yes. In the tale, Princess Edvya, who had been her whole life confined to the palace, switched places with a common miller's daughter and slipped away. Her overprotective father, Sultan Baldric, flew into a panic, his army all but razing the miller's house as they searched."},{"name":"RODOLPH","text":"(-Rodolph-)With the princess returned, however, the sultan came to repent his hasty actions. He had the miller's house rebuilt, and insisted upon personally serving as seneschal to the man's daughter for a day. His zeal for the role sparked smiles across the city."},{"name":"RODOLPH","text":"(-Rodolph-)It is this legacy that lives on as Little Ladies' Day, on which we remember that each little girl is as dear as a princess, and should be equally treasured."},{"name":"RODOLPH","text":"(-Rodolph-)...Good heavens! In sparing no detail, I lost sight of the larger picture. Yes, we must find Lady Aldiytha immediately!"},{"name":"RODOLPH","text":"(-Rodolph-)Though I admit that, even with the both of us set to the task, it will be nigh impossible to locate her without knowing where in the city she might be."},{"name":"RODOLPH","text":"(-Rodolph-)I have it! Responsible for overseeing the festivities as he is, the royal seneschal surely has knowledge that we lack. Lady Aldiytha may even have spoken with him. We should seek his aid first and foremost."},{"name":"RODOLPH","text":"(-Rodolph-)Please, follow me!"},{"name":"BUTLER","text":"Warm hearts as a treasured princess! Spark joy as a loyal seneschal! Join us as we celebrate Little Ladies' Day!"},{"name":"RODOLPH","text":"The royal seneschal takes his role very seriously─I am confident that he will help us find Lady Aldiytha."},{"name":"BUTLER","text":"It's wonderful to see you again, my friend. Have you come to celebrate Little Ladies' Day with us?"},{"name":"BUTLER","text":"Well met, adventurer! I am the royal seneschal, tasked with making this year's Little Ladies' Day bring joy to the hearts of one and all."},{"name":"BUTLER","text":"Are you here to <span class=\"alternative-container\"><span class=\"alternative\">become a princess for a day</span><span class=\"alternative\">enjoy the celebration</span></span>─or perhaps you wish to act as seneschal for someone dear to you? Either way, I am certain we can make your dream come true."},{"name":"RODOLPH","text":"I am terribly sorry to bother you during the festivities, but we are in urgent need of your assistance."},{"name":"BUTLER","text":"Why, if it isn't Rodolph! You seem quite distressed. Am I correct, then, in assuming that this concerns Miss Aldiytha?"},{"name":"RODOLPH","text":"Er...yes, as it happens. She wished to join the other citizens in celebrating Little Ladies' Day, but she left home unaccompanied, and I fear that my chances of locating her without help are slim."},{"name":"BUTLER","text":"That is distressing indeed. Though I have not seen her pass by, I shall of course join you in your search. I have yet to thank her for the daisies, after all."},{"name":"RODOLPH","text":"Daisies? No─we can spare no detail later. Lady Aldiytha is our priority!"},{"name":"BUTLER","text":"Well then, we can begin with the main thoroughfare on which we stand─it is at the center of the festivities, and is always bustling with little ladies and their seneschals. If Aldiytha wished to join the celebration, she could not fail to be drawn to it."},{"name":"RODOLPH","text":"In that case, we should spread out so as not to miss her. Kind adventurer, please search for a dignified young lady with long, dark hair between where we stand and the Gates of Nald. The royal seneschal and I will cover the opposite direction."},{"name":"ALDIYTHA","text":"(-Aldiytha-)Yes, I am Aldiytha Thorne. Why do you ask?"},{"name":"ALDIYTHA","text":"(-Aldiytha-)Rodolph sent you? Oh dear, I didn't think he would find me so quickly..."},{"name":"RODOLPH","text":"Lady Aldiytha! Thank the heavens that you are unharmed!"},{"name":"RODOLPH","text":"Who knows what may have come to pass without your assistance? The two of you have my thanks. "},{"name":"RODOLPH","text":"Come now, we had best return home before you tax yourself overmuch."},{"name":"ALDIYTHA","text":"(-Aldiytha-)I appreciate your concern, Rodolph, but that I cannot do. I have a mission this Little Ladies' Day, and I will see it through!"},{"name":"RODOLPH","text":"A...mission? Whatever it is, it cannot be more important than your health. I will not simply wait until you collapse─or worse!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"It's her life─at least hear her out."},{"name":"A3","text":"Safety first!"},{"name":"ALDIYTHA","text":"(-Aldiytha-)Thank you, dear adventurer! I'm sure you'll understand why this is so important to me."},{"name":"ALDIYTHA","text":"(-Aldiytha-)It's kind of you to worry about me. But I swear that I'm feeling perfectly well today. No trouble breathing, no dizziness...and I'm not planning to do anything reckless. Truly!"},{"name":"ALDIYTHA","text":"(-Aldiytha-)You see, as a Thorne, Little Ladies' Day has always held special meaning for me. I was raised on the Legend of the Lost Lady─and as I grew older, it became my dream to bring joy to the people of Ul'dah, just as Sultan Baldric once did."},{"name":"ALDIYTHA","text":"(-Aldiytha-)My illness, however, has kept me from so much... Eventually, I decided that if I could not brighten people's hearts on Little Ladies' Day myself, I would at least contribute something that could. That's why I began growing daisies in the garden."},{"name":"ALDIYTHA","text":"(-Aldiytha-)Miraculously, as they sprouted and bloomed, my body grew stronger─and I began to think that my dream might at last come true. You and I both know that my fortune will likely not last, but that is all the more reason to do what I can right now! All I ask is for this one day."},{"name":"BUTLER","text":"Such a kind soul! I cannot speak for Rodolph, but your words have touched me deeply─as have your actions. While the Thornes are always generous in their provisions for Little Ladies' Day, to receive so many beautiful flowers this year was a true delight."},{"name":"BUTLER","text":"If I may ask, why did you choose to grow daisies? Your family's crest depicts peach blossoms, does it not? That is why we typically use them as a motif for Little Ladies' Day... Could we have been mistaken all this time?"},{"name":"ALDIYTHA","text":"(-Aldiytha-)I'm glad that you asked, but that is a secret to be revealed at a later time! For now, I would like to begin weaving these daisies into crowns, so that we may present them to the many princesses of Ul'dah."},{"name":"BUTLER","text":"Crowns of flowers! What a splendid idea! Please, allow us to assist you. I will set my staff to the task at once."},{"name":"ALDIYTHA","text":"(-Aldiytha-)Wonderful! The preparations will go so much more smoothly with the royal seneschal's cooperation. Rodolph, pray bear with me a little bit longer."},{"name":"RODOLPH","text":"I...cannot. Though I am loath to disappoint you, as your seneschal, it falls to me to protect you. Your health notwithstanding, it is simply not safe for you to wander the city. We cannot assume that all who walk these streets have motives as pure as your own─Little Ladies' Day or no."},{"name":"ALDIYTHA","text":"(-Aldiytha-)You can't mean to take me back! Not when I'm so close..."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I will accompany you, and guarantee her safety myself."},{"name":"A4","text":"Allow me to serve as her seneschal today!"},{"name":"RODOLPH","text":"Hmm... I suppose that she would be reasonably safe with you as bodyguard. Very well."},{"name":"RODOLPH","text":"Hmm... I have no means to protect her out here in the city, but you have. So if you were to take on that responsibility... Very well, then. But I cannot well cede <span class=\"emphasis\">all</span> of my duties to you, so I will remain with you until the lady is ready to return home."},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"},{"name":"BUTLER","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"(-Aldiytha-)Oh, thank you so very much! Let's go and crown some princesses right away!"},{"name":"RODOLPH","text":"Lady Aldiytha! Please do not sprint so!"},{"name":"BUTLER","text":"Wait, we haven't finished making the flower crowns ye─never mind."},{"name":"BUTLER","text":"Well, I have no doubt that she will succeed in putting smiles on the faces of many a little lady with her flower crowns─assuming she has them on hand. I will have my staff bring along the ones that are finished so that you can take some with you."},{"name":"BUTLER","text":"Here we are. Please go after Miss Aldiytha, and see that these find their way to the heads of would-be princesses!"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"Oh, I'm such a scatterbrain! You didn't happen to collect the flower crowns from the royal seneschal, did you? I would so like to present one to this young woman..."},{"name":"RODOLPH","text":"If we work efficiently, I may be able to return the lady home before her father becomes worried."},{"name":"BUTLER","text":"I'm sure little ladies across Ul'dah will be delighted to receive crowns of their very own."},{"name":"PDYGIRL03208","text":"Sorry, am I in the way?"},{"name":"PDYGIRL03208","text":"Oh, a crown made of flowers! It's so pretty! Do you think that if I wear this, I can be a princess too?"},{"name":"PDYGIRL03208","text":"I really can? This is the best day ever! I have to go and tell Father that he's my seneschal now!"},{"name":"ALDIYTHA","text":"Did you see her smile? It's wonderful that, even hundreds of years later, the Legend of the Lost Lady can bring people such joy."},{"name":"ALDIYTHA","text":"Shall we try the Steps of Thal next? I'm certain we can find others who dream of becoming princesses."},{"name":"RODOLPH","text":"Lady Aldiytha! I spared no detail in warning you of the dangers of running mere moments ago!"},{"name":"ALDIYTHA","text":"This woman surely deserves a flower crown! I know her husband will love it as well."},{"name":"RODOLPH","text":"I must admit, I scarce remember when last I saw Lady Aldiytha so happy."},{"name":"PDYHUSBAND03208","text":"My wife and I have come to enjoy Little Ladies' Day. I have been too busy with work to spend time with her as of late, but the festivities give me an excuse to put my duties aside and take her on a romantic stroll."},{"name":"BUTLER","text":"There are still many princesses in need of crowns! We must do our utmost to pass these out to each and every one of them."},{"name":"PDYWIFE03208","text":"Hello, can I be of service?"},{"name":"PDYWIFE03208","text":"A crown of flowers? Are you quite certain you mean to give this to me? Surely there are younger ladies whom it would better suit..."},{"name":"ALDIYTHA","text":"There's no mistake, I assure you. Though you may no longer be little, I am certain that you are a lady who is a princess at heart."},{"name":"PDYWIFE03208","text":"Well, 'tis true that as a child, I always dreamed of being a princess. Frilly dress billowing as I glide gracefully through palace halls, with a doting seneschal at my side..."},{"name":"PDYWIFE03208","text":"How...do I look? If you're going to laugh, hurry up about it!"},{"name":"PDYHUSBAND03208","text":"You are a vision of beauty, my lady. If I may be so bold─it is an honor to serve one as lovely, as gentle, as..."},{"name":"PDYWIFE03208","text":"Eep! Stop, stop! Oh gods, I'm blushing..."},{"name":"PDYHUSBAND03208","text":"Well, don't go and make it seem embarrassing! I always dreamed of having a princess to treasure, you know! And I found you, and, er... Oh, now <span class=\"emphasis\">I'm</span> blushing!"},{"name":"PDYWIFE03208","text":"Thank you. It seems both of our childhood dreams have come true! I never expected to feel so much like a princess at my age."},{"name":"PDYHUSBAND03208","text":"（★未使用／削除予定★）"},{"name":"ALDIYTHA","text":"What a darling couple. Little Ladies' Day really does have the power to touch people's hearts, no matter their age! For we were all children, once─children listening, starry-eyed, to tales of princesses and seneschals."},{"name":"RODOLPH","text":"Childhood tales...yes, I remember. It was for the same reason that I dreamed of becoming a seneschal. To do my utmost to make one lady, one princess, smile."},{"name":"RODOLPH","text":"But can I truly say I have been living up to that ideal as of late?"},{"name":"ALDIYTHA","text":"&lt;cough&gt; &lt;cough&gt; &lt;cough&gt;"},{"name":"RODOLPH","text":"Lady Aldiytha! Are you alright?"},{"name":"ALDIYTHA","text":"I will be fine. Though I suspect you were right─I should not have run so much earlier."},{"name":"RODOLPH","text":"Let us return to the royal seneschal. I will contact your father and ask that a carriage be sent."},{"name":"ALDIYTHA","text":"I apologize for worrying you. I will be fine."},{"name":"BUTLER","text":"Perhaps all of this excitement at once was a bit too much for her."},{"name":"RODOLPH","text":"Lady Aldiytha seems to be doing well for the moment, and we shall return home without further exertion on her part. Rest assured that there is no cause for you to worry."},{"name":"ALDIYTHA","text":"Thank you─because of your help, I was finally able to make my dream come true. I am so sorry to repay your kindness with more trouble. "},{"name":"ALDIYTHA","text":"（★未使用／削除予定★）"},{"name":"BUTLER","text":"Now, now, don't you worry over making others worry! Then everyone will be worried! Why don't we discuss something else instead─perhaps you are ready to share with us your reasons for choosing daisies, for instance?"},{"name":"ALDIYTHA","text":"But of course. I will tell you the story while we wait for the carriage."},{"name":"ALDIYTHA","text":"After Sultan Baldric served as seneschal to the miller girl, he chose to do the same once each year for other Ul'dahn ladies. It is said that this was his way of reminding himself─and others─that all girls should be treasured."},{"name":"ALDIYTHA","text":"Then, one year, the girl he had chosen to be princess for a day presented him with a bouquet of daisies, to thank him for his service."},{"name":"ALDIYTHA","text":"The daisies that grow in Ul'dah are hearty─capable of proliferating even in our arid climes. This made them popular amongst the commonfolk, for even those without a proper garden could grow or pick them. Of course, for the same reason, the nobles considered them beneath notice at best."},{"name":"ALDIYTHA","text":"Amongst the nobility, presenting someone with such common flowers might even be considered an insult. So when the little lady gave them to the sultan, his attendants could do naught but hold their breath in trepidation."},{"name":"ALDIYTHA","text":"But, knowing how hard the girl had worked to pick them, the sultan gladly accepted the daisies. He bade his attendants fashion them into circlets, and, removing his own royal crown, placed one on his head, and another on hers. “We're the same, you and I,” he said, smiling."},{"name":"ALDIYTHA","text":"Ever since, the Thorne family has considered daisies to be symbols of happiness."},{"name":"RODOLPH","text":"That your flower crowns had such meaning behind them... I had no idea. And as your seneschal, I should have. I should have asked. I should have listened to every detail."},{"name":"RODOLPH","text":"But I am listening now. And if there is one thing I have learned today, it is that every lady deserves to be treated as a princess. So, I ask...does that not include you as well?"},{"name":"ALDIYTHA","text":"How do I look?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Just like a princess!"},{"name":"A5","text":"Just like Sultan Baldric!"},{"name":"ALDIYTHA","text":"To be honest, that is what I was hoping to hear. Oh, and it seems Rodolph has one for you, as well!"},{"name":"ALDIYTHA","text":"“We're the same, you and I!” ...I've always wanted to say that."},{"name":"RODOLPH","text":"It seems that my lady is not the only one following in the footsteps of Sultan Baldric today. You not only watched over Lady Aldiytha─you helped me understand what is most important to her. In granting her wish, you have granted mine as well. Thank you."},{"name":"ALDIYTHA","text":"I can hardly express my gratitude. I've never had such a wonderful day in all my life, and it's because you were here to help my dream come true."},{"name":"ALDIYTHA","text":"Thank you. I only wish that I didn't have to leave so soon..."},{"name":"RODOLPH","text":"If that is your wish, we will simply have to find a way for you to stay longer next year."},{"name":"BUTLER","text":"For my part, I'm grateful to all of you. This will be a Little Ladies' Day to remember for many of us, I am sure of it."},{"name":"BUTLER","text":"（★未使用／削除予定★）"},{"name":"BUTLER","text":"But it is not over for you and I, is it, adventurer? We must work to see flower crowns in the hands of many a princess and seneschal yet."}],"reward":{"gil":334,"items":[{"id":24590}]},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[68745]},"partials":[{"type":"npc","id":"1027150","obj":{"i":1027150,"n":"Unsettled Seneschal","l":40,"q":1}},{"type":"npc","id":"1027152","obj":{"i":1027152,"n":"Rodolph","l":40,"q":1}},{"type":"item","id":"24590","obj":{"i":24590,"n":"Flower Crown","l":1,"c":41750,"t":34,"p":94}},{"type":"quest","id":"68745","obj":{"i":68745,"n":"One Short Day on Emerald Avenue","g":198,"l":"Ul'dah","s":173,"r":1}}]}