{"quest":{"name":"Gone but Not Forgiven","location":"Coerthas Central Highlands","id":68749,"patch":5.0,"sort":800,"icon":100876,"eventIcon":71221,"issuer":1006748,"target":1006748,"genre":150,"journal":["Alberic is keen to hear of your adventures.","You find Alberic trying to keep warm at the Observatorium, and he welcomes the chance to exchange stories with his former student. Upon mention of Orn Khai, the young dragon himself appears, joining the conversation and listening eagerly as you regale him with your adventures in the First. Your account of Andreia's demise brings to mind the tale of Nidhogg, as he too was driven only by memories of a time long since passed. Orn Khai expresses his profound sorrow that no one would mourn the passing of the mighty wyrm, and suggests consulting Faunehm to learn more of the fallen Nidhogg.","Faunehm answers Orn Khai's call and gladly shares her memories of her sire, Nidhogg. You learn that King Thordan had invited Ratatoskr to speak on behalf of all dragons. When he asked her to recount Nidhogg's views on mankind, she stated her beloved's thoughts on the matter, in particular that their mortal frailty made them unfit for the role of Hydaelyn's guardian. Upon hearing these words, Thordan was filled with rage and slaughtered Ratatoskr, which drove Nidhogg into madness and sparked the Dragonsong War. After concluding her account of these historic events, Faunehm advises that you commemorate him by offering a flower for which he had a particular affinity, the mist lily, at the site of his passing. Orn Khai believes that they can be found growing in Ohl Tahn and wastes not a moment in flying off to gather the elusive bloom.","The flowers you seek grow in the most unlikely of places, peeking out between the cracks of a stark rocky outcrop. Orn Khai will be pleased to hear that the search is over.","Orn Khai is delighted that you were able to find the mist lilies and is eager to offer them in memorial of Nidhogg. Since his eyes were used to summon Shinryu, which you defeated in Gyr Abania, this could be considered his final resting place.","You and Orn Khai arrive at the Royal Menagerie to pay your respects to Nidhogg. As you reflect on past encounters with the wyrm, your mind is cast back to the days spent as an Azure Dragoon, fighting alongside Estinien. Satisfied that the memory of the wyrm's memory has been honored, Orn Khai asks that you share Faunehm's tale with Alberic.","Back at the Observatorium, Alberic is intrigued to hear such a detailed account of King Thordan's betrayal. He plans to impart this newly revealed information to the Temple Knights, as he is a firm believer that matters of historical accuracy are of the utmost importance in building peaceful relations between man and dragon. Though the road ahead will not be an easy one, your friendship with Orn Khai will serve as a shining example that trust and cooperation are possible between your races, and that even former enemies need not be beholden to the past."],"objectives":["Speak with Orn Khai in Zenith.","Search for mist lilies.","Speak with Orn Khai.","Speak with Orn Khai in Gyr Abania.","Speak with Alberic at the Observatorium."],"dialogue":[{"name":"ALBERIC","text":"Ah, <span class=\"highlight\">Forename</span>. It has been too long since last we spoke."},{"name":"ALBERIC","text":"Your visits are far more frequent than those of another former student of mine, however. It would seem he still prefers to keep his own company."},{"name":"ALBERIC","text":"The same could be said of Heustienne, who has made quite the name for herself as a hunter in Dravania, according to Orn Khai."},{"name":"ALBERIC","text":"Ah, what fortunate timing! Speak of the dragon and he shall appear."},{"name":"ORNKHAI","text":"Greetings! Would I be correct in guessing you have returned fresh from one of your adventures?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I traveled to a world beyond our own."},{"name":"A2","text":"I laid to rest the dreaded Andreia in a land known as Norvrandt."},{"name":"ORNKHAI","text":"To think that such a place could truly exist!"},{"name":"ALBERIC","text":"And that you have fought such terrifying foes. To fall so far from grace... 'Tis a tragic tale, if ever I heard one."},{"name":"ORNKHAI","text":"One similar to that of Nidhogg."},{"name":"ALBERIC","text":"Aye, though nothing will ever compare to his malice. Even death could not quell his thirst for vengeance."},{"name":"ALBERIC","text":"At least Andreia was not nearly so consumed by hate. I doubt not that Renda-Rae's soul is at peace."},{"name":"ORNKHAI","text":"Peace... I wonder if Nidhogg ever found it..."},{"name":"ALBERIC","text":"I fear his soul yet lingers, doomed to wander endlessly."},{"name":"ORNKHAI","text":"That is too cruel a fate, even for him!"},{"name":"ALBERIC","text":"I share your sentiments. For as the Azure Dragoon, I once gazed into his heart, as he gazed into mine. Such rage... Such sorrow..."},{"name":"ORNKHAI","text":"I will not accept this! That none should mark his passing is more than I can bear. What say you, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Perhaps we could honor who he once was, if not what he became."},{"name":"A2","text":"I, too, was an Azure Dragoon. Alberic speaks true."},{"name":"ORNKHAI","text":"Then we are in agreement!"},{"name":"ORNKHAI","text":"Though I must admit that as part of Hraesvelgr's brood, I have little knowledge of Nidhogg."},{"name":"ORNKHAI","text":"A deeper insight is needed if I am to properly pay my respects."},{"name":"ORNKHAI","text":"Hmm... Faunehm is of his brood. If anyone would know, it is her. Let us make haste for Zenith!"},{"name":"ALBERIC","text":"For better or worse, I am who I am because of Nidhogg. While others rejoiced at his death, I cannot deny that a part of myself died that day."},{"name":"ORNKHAI","text":"Faunehm is come."},{"name":"FAUNEHM","text":"Welcome, noble dragoon. Orn Khai has explained all."},{"name":"FAUNEHM","text":"Pray tell, what was Nidhogg to you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A relentless adversary."},{"name":"A2","text":"The wellspring of my strength."},{"name":"FAUNEHM","text":"And much more. For through his power, you are forever joined."},{"name":"FAUNEHM","text":"And yet you were enemies, each sworn to slay the other."},{"name":"FAUNEHM","text":"Two souls, entwined by fate."},{"name":"FAUNEHM","text":"Though you have faced Nidhogg's wrath and sensed his pain, you cannot know him as we dragons once did."},{"name":"ORNKHAI","text":"We would fain hear his tale."},{"name":"FAUNEHM","text":"Nidhogg was without equal, even among our kind."},{"name":"FAUNEHM","text":"Destined was he to guard this world from the catastrophe that befell the Dragonstar, in place of his sire."},{"name":"FAUNEHM","text":"Destined was he to guard this world from catastrophe, in place of his sire."},{"name":"FAUNEHM","text":"He valued strength above all else, and considered the affairs of mortals beneath his notice."},{"name":"FAUNEHM","text":"Only the seven great wyrms were worthy of his attention. And among them, none but Ratatoskr truly understood him."},{"name":"FAUNEHM","text":"Her song was beautiful indeed, and she graced both dragon and man with her wisdom."},{"name":"FAUNEHM","text":"She was invited by Thordan, king of men, to speak on our behalf. Ratatoskr expressed our desire to live in harmony. However, it was known that Nidhogg did not share these views."},{"name":"FAUNEHM","text":"When the king asked her how her brother saw mankind, she did not hide the truth. He believed that such frail creatures were incapable of protecting this star, that the task must be entrusted to the seven great wyrms alone."},{"name":"ORNKHAI","text":"And that is why Thordan slew her!?"},{"name":"FAUNEHM","text":"Ratatoskr had no intention of sowing discord, but the king could not countenance that his kind would be treated with such contempt, that we dragons would seek to claim this star as our own."},{"name":"FAUNEHM","text":"He turned on Ratatoskr, taking not only her eyes, but her life."},{"name":"FAUNEHM","text":"When Nidhogg discovered that King Thordan had murdered his beloved, his fury was beyond reckoning."},{"name":"FAUNEHM","text":"For all his strength, he could not master his own rage. It utterly consumed him."},{"name":"ORNKHAI","text":"Dragons, men─we are all the same. Slaves to our emotion, subservient to our hearts."},{"name":"FAUNEHM","text":"Yet there are those who would seek another path, as I once did. I turned my back on my father and his quest for vengeance."},{"name":"FAUNEHM","text":"Valiant dragoon, by your strength was the Dragonsong War ended, and by your compassion was a new alliance forged."},{"name":"ORNKHAI","text":"<span class=\"highlight\">Forename</span> and I are living proof that we can live side by side. We shall speak the message of peace to man and dragon alike. And when we are gone, our descendants will do the same!"},{"name":"FAUNEHM","text":"Tell them of Nidhogg. His strength, his weakness, his love, his hate. Tell them the truth."},{"name":"FAUNEHM","text":"Orn Khai, you wish to commemorate Nidhogg's passing, yes? As my father once enjoyed the fragrance of mist lilies, perhaps they would make a suitable offering."},{"name":"ORNKHAI","text":"What a splendid idea! Thank you, Faunehm!"},{"name":"ORNKHAI","text":"I have often seen such flowers blooming in Ohl Tahn. Follow me!"},{"name":"ORNKHAI","text":"I distinctly recall seeing mist lilies in this very spot. What could have happened to them?"},{"name":"ORNKHAI","text":"So there were mist lilies here after all? Then it would appear my memory served me correctly. A pity that the same cannot be said of my eyes..."},{"name":"ORNKHAI","text":"It is of no matter. There is one thing that concerns me, however. In your funerary rites, the offering of flowers and such occurs at a grave or place of significance, I believe. But where should we choose for Nidhogg?"},{"name":"ORNKHAI","text":"Gyr Abania... Yes, that could be considered his final resting place, if that was where you fought the primal born of his eyes."},{"name":"ORNKHAI","text":"Although I must say, <span class=\"highlight\">Forename</span>, you seem rather adept at putting down dragons. And primals that resemble dragons. It makes me glad that we are not enemies!"},{"name":"ORNKHAI","text":"Ahem. To matters at hand, then. I shall go on ahead and meet you in Gyr Abania."},{"name":"ORNKHAI","text":"What a relief to have found you at last! I had become rather lost, you see."},{"name":"ORNKHAI","text":"Perhaps we had best hurry on to the Royal Menagerie before I lose my way again."},{"name":"ORNKHAI","text":"Nidhogg, we are come to honor your memory!"},{"name":"ORNKHAI","text":"Though now that we are here, I am at a loss for words... <span class=\"highlight\">Forename</span>, is there anything you wish to say?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You will be remembered."},{"name":"A2","text":"Your legacy will live on in the songs of your people."},{"name":"SYSTEM","text":"From distant star, a Father bore seven eggs. Great wyrms rose forth, powerful and wise. On blackened wings, one soared on high with a roar that set the world atremble. Guarding their home in the Father's stead, he was fearsome yet just."},{"name":"SYSTEM","text":"Man, wicked and vain, betrayed the wyrm and his kin, slaying his beloved and plucking out his eyes. Thenceforth, he lived only for vengeance, his wrath irrepressible."},{"name":"SYSTEM","text":"A thousand years hence, two champions of mankind were granted great strength by the stolen eyes. Destined were they to face the wyrm, who had risen once more to wage war on his sworn enemy. At the end of their struggle, the wayward son fell silent."},{"name":"SYSTEM","text":"These guardians and their comrades continue to watch over the star, their heroic deeds recounted by minstrels and storytellers far and wide. Even the ancient foe from which the Father of Dragons once fled could not withstand their might."},{"name":"SYSTEM","text":"These guardians continue to watch over the star, their heroic deeds recounted by minstrels and storytellers far and wide."},{"name":"ORNKHAI","text":"<span class=\"highlight\">Forename</span>, I am not blind to the sins Nidhogg committed. I mourn the loss of what he once was, what he may have become had he been dealt a kinder fate."},{"name":"ORNKHAI","text":"Although this was but a small gesture, I am sure that our thoughts have reached him."},{"name":"ORNKHAI","text":"I have much to ponder on the return journey, and I expect that Alberic will wish to hear what we have learned from Faunehm. Perhaps you could visit him in Coerthas?"},{"name":"ALBERIC","text":"Were you able to pay your respects?"},{"name":"ALBERIC","text":"I see... This is the first time I have heard such a detailed account of King Thordan's acts. A betrayal in the moment, but a betrayal nonetheless. A pity he is far beyond the reach of justice."},{"name":"ALBERIC","text":"Though it may be hard to come to terms with the crimes of our forebears, we must accept the past for what it is."},{"name":"ALBERIC","text":"Of course, I shall be sharing this information with the rest of the Temple Knights. No doubt they will be keen to speak with other members of Nidhogg's brood to verify this version of events."},{"name":"ALBERIC","text":"In the meantime, there is still much to be done in building relations between man and dragon. We will aim to follow the example set by you and Orn Khai, and work together for the good of all. May the Fury guide you both."}],"reward":{"gil":3268,"items":[{"id":25187},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":23}],"questsType":"all","quests":[68450,68814]}},"partials":[{"type":"npc","id":"1006748","obj":{"i":1006748,"n":"Alberic","l":63,"q":17}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68450","obj":{"i":68450,"n":"Dragon Sound","g":150,"l":"The Azim Steppe","s":700,"f":1}},{"type":"quest","id":"68814","obj":{"i":68814,"n":"Courage Born of Fear","g":181,"l":"Kholusia","s":351,"f":1}}]}