{"quest":{"name":"Whence the Healing Springs","location":"South Shroud","id":68751,"patch":5.0,"sort":800,"icon":100878,"eventIcon":71221,"issuer":1006751,"target":1006751,"genre":153,"journal":["Raya–O–Senna seems in a nostalgic mood.","Raya–O–Senna speaks to you of Alaqa and the Auri woman's efforts to atone for her misguided deeds. The Padjal asks that you look in on Alaqa in Stillglade Fane, and see how she is progressing with her studies in conjury.","Your sudden visit comes as a surprise to Alaqa, who confides that she feels ill at ease with both the art of conjury and her place in the Conjurers' Guild. Fortunately, Sylphie and Gatty soon arrive to lighten the mood and, seemingly inspired by your adventurous tale, suggest a course of action─it seems a training trip to the Hedgetree is in order.","You catch up with Sylphie in the Central Shroud, only to find that some dastardly Ixali plot has riled up the elementals. Drained by her battle with an enraged treant, Sylphie begs you to hurry to the Hedgetree, where Gatty is attempting to soothe the forest spirits' wrath alone...","Finding Gatty battered and exhausted by the elementals' anger, you step in to calm them with your own tranquil energies. While you are thus occupied, it falls to Alaqa to overcome her doubts and perform a healing spell for her suffering Padjali friend. Overjoyed by Alaqa's breakthrough, Sylphie and Gatty rush back to report to Brother E–Sumi, while Alaqa herself lingers behind.","Alaqa seems strengthened by the experience, and determined to continue her studies at Stillglade Fane. Somewhat embarrassed by the sudden onslaught of emotions, she asks that you pass on word of her decision to Raya–O in her stead.","Raya–O listens to your report with keen interest, expressing her pleasure at both Alaqa's progress and the inspiration you provided. With friends such as Sylphie and Gatty at her side, Alaqa's future in the Conjurers' Guild seems destined to be a bright one. As for your mastery of the white, Raya–O warns against complacency, expecting to hear ever greater things from you ere your paths cross again..."],"objectives":["Speak with Alaqa at the Conjurers' Guild.","Meet with Sylphie near the Hedgetree in the Central Shroud.","Speak with Gatty at the Hedgetree.","Speak with Alaqa at the Hedgetree.","Report to Raya–O–Senna at Camp Tranquil."],"dialogue":[{"name":"RAYAOSENNA","text":"<span class=\"highlight\">Forename</span>, how fare you in your studies of the white? I sense your magicks have grown even stronger since last we met."},{"name":"RAYAOSENNA","text":"Speaking of old acquaintances, do you recall Alaqa? The Auri girl responsible for the taint and its corruption?"},{"name":"RAYAOSENNA","text":"As a form of atonement, she has begun training in the art of conjury. Mayhap you could stop by Stillglade Fane and look in on her for me? I am sure she would be glad of the visit."},{"name":"RAYAOSENNA","text":"You might also come across Gatty whilst you are in town─considering her unorthodox upbringing, my fellow Padjal has been given leave to roam somewhat more freely than might otherwise be allowed. Do give my regards to her and Sylphie should you see them."},{"name":"RAYAOSENNA","text":"Have you been to see Alaqa? I wonder how her training at the guild is progressing..."},{"name":"ALAQA","text":"...<span class=\"highlight\">Forename</span>, Raya–O–Senna sent you to see me?"},{"name":"ALAQA","text":"Ah, I thought as much. I did not imagine you would seek me out of your own accord, considering how I once wished you dead..."},{"name":"ALAQA","text":"But I promise I have changed─I am doing as they ask of me. At least, I am trying to..."},{"name":"ALAQA","text":"My attempts at curing spells are abysmal. I perform the exercises as the Seedseer has taught me, but it would seem I am unsuited to the healing arts..."},{"name":"ALAQA","text":"Being an outsider, it is...difficult...for me to make friends here."},{"name":"ALAQA","text":"Although there <span class=\"emphasis\">are</span> two young ladies who do seem eager to include me in their chatter."},{"name":"SYLPHIE","text":"Alaqa! I didn't know you knew <span class=\"highlight\">Forename</span>!"},{"name":"GATTY","text":"Were you two talking about your adventures? I want to hear about adventures!"},{"name":"SYLPHIE","text":"Oh, me too, me too! Can we stay and listen!?"},{"name":"ALAQA","text":"I...I suppose. If <span class=\"highlight\">Forename</span> doesn't mind..."},{"name":"SYLPHIE","text":"Great! What kind of tale will you tell?"},{"name":"Q1","text":"What kind of tale will you tell?"},{"name":"A1","text":"The tale of a man who crossed time and space to save the world...and me."},{"name":"A1","text":"The tale of a woman who flew in the face of everything to save her beloved family."},{"name":"SYLPHIE","text":"He must truly care for you─which I can completely understand. What a lovely story..."},{"name":"SYLPHIE","text":"What a wonderful sister she must be. And what a lovely story..."},{"name":"GATTY","text":"I want to be able to do that─to protect people. But I'm probably going to need a <span class=\"emphasis\">lot</span> more training..."},{"name":"SYLPHIE","text":"Then why don't we all go and train right now? Together! And we can work on becoming just like the person <span class=\"highlight\">Forename</span> told us about!"},{"name":"GATTY","text":"Yes, that's a wonderful idea!"},{"name":"GATTY","text":"Alaqa, you and <span class=\"highlight\">Forename</span> both have to come with us! It'll be so much more fun with the four of us!"},{"name":"ALAQA","text":"If you insist..."},{"name":"SYLPHIE","text":"I say we head out to the Hedgetree, and practice listening to the whispers of the forest! Come on, everyone, follow me!"},{"name":"SYLPHIE","text":"&lt;huff&gt; &lt;puff&gt; <span class=\"highlight\">Forename</span>, the Ixal, they─ &lt;huff&gt;"},{"name":"SYLPHIE","text":"...They stabbed a sword into the Hedgetree! The elementals <span class=\"emphasis\">really</span> didn't like that...&lt;puff&gt;...and before we knew it, we were being attacked by a treant!"},{"name":"SYLPHIE","text":"It must be some sort of revenge on Gridania, the Ixal are trying to cause panic or chaos or... &lt;huff&gt;"},{"name":"SYLPHIE","text":"Gatty wanted to try calming the spirits...&lt;puff&gt;...so we led mister smashy branches here away. I only just managed to...&lt;huff&gt;...to take it down..."},{"name":"ALAQA","text":"My own conjury was too weak to be of consequence. Sylphie was forced to expend too much aether to ensure the creature's defeat..."},{"name":"SYLPHIE","text":"Don't worry about me─it's Gatty who needs help! The elementals were furious, and there's no way she can soothe their anger alone!"},{"name":"SYLPHIE","text":"Please hurry, <span class=\"highlight\">Forename</span>! She needs you!"},{"name":"SYLPHIE","text":"Gatty is trying to calm the elementals all by herself! You have to help her!"},{"name":"ALAQA","text":"Wh-What do I do...? What <span class=\"emphasis\">can</span> I do...?"},{"name":"GATTY","text":"&lt;huff&gt; &lt;gasp&gt; <span class=\"highlight\">Forename</span>, thank goodness!"},{"name":"GATTY","text":"I pulled out the sword, but the elementals lashed out... They won't listen to me..."},{"name":"GATTY","text":"Please, you have to calm them! If another one of those treants goes after Sylphie and Alaqa..."},{"name":"GATTY","text":"&lt;huff&gt; &lt;puff&gt; Ugh..."},{"name":"SYLPHIE","text":"Gatty, you look hurt! I want to heal you, but I've no aether left to cast spells..."},{"name":"SYLPHIE","text":"Alaqa, you'll have to do it!"},{"name":"ALAQA","text":"M-Me...? But I cannot..."},{"name":"SYLPHIE","text":"You must! Can't you see she's in pain!?"},{"name":"ALAQA","text":"I want to help, but my conjury is so weak, I..."},{"name":"ALAQA","text":"...I will try! No one should suffer so!"},{"name":"GATTY","text":"Thank you, Alaqa─I feel so much better now. Your healing was like being wrapped in a soft, warm blanket!"},{"name":"ALAQA","text":"I am glad to hear that, Gatty. To be honest, I did not expect the spell to work at all...but it did."},{"name":"GATTY","text":"And thank you, too, <span class=\"highlight\">Forename</span>. I never knew the elementals could get <span class=\"emphasis\">that</span> mad... Phew, I've a long way to go before I'm as strong as you."},{"name":"SYLPHIE","text":"“Phew” is the word for it! I think Brother E–Sumi owes us a reward after all that hard work!"},{"name":"ALAQA","text":"Oh, Sylphie..."},{"name":"SYLPHIE","text":"Alaqa!? I don't think I've ever seen you laugh before. This day really has been full of surprises!"},{"name":"SYLPHIE","text":"Alaqa's not much for talking, but she really is the sweetest girl at heart."},{"name":"GATTY","text":"Alaqa is even prettier when she laughs, don't you think?"},{"name":"ALAQA","text":"Thank you, <span class=\"highlight\">Forename</span>. If you hadn't come along, I may have lost the first real friends I've ever had..."},{"name":"SYLPHIE","text":"That's what <span class=\"highlight\">Forename</span> does─<span class=\"alternative-container\"><span class=\"alternative\">she's</span><span class=\"alternative\">he's</span></span> always our hero when we need one!"},{"name":"GATTY","text":"That's right! In fact, both of you were heroes today."},{"name":"ALAQA","text":"I would hardly say I was heroic..."},{"name":"GATTY","text":"I'm serious. We need to tell Brother E–Sumi how incredible your conjury is now!"},{"name":"ALAQA","text":"Again, I think you praise me overmuch, but we should certainly report this incident, and let him know you are safe and sound."},{"name":"SYLPHIE","text":"Let's head back, then. I think I'm ready for a cup of tea and a nice long nap!"},{"name":"ALAQA","text":"<span class=\"highlight\">Forename</span>? I may just find my place here after all."},{"name":"ALAQA","text":"Listening to your tale earlier, I was convinced there was no one in my life I cared about that much...or who cared about me."},{"name":"ALAQA","text":"Then I saw how Gatty was hurt. I'd never felt my heart beat so wildly─never felt such relief as I did when my spell healed her."},{"name":"ALAQA","text":"I wonder, was this how the people in your adventures felt too...?"},{"name":"ALAQA","text":"I will continue with my studies. And then should you need me─should any of you need me─I will be ready."},{"name":"ALAQA","text":"Would you mind letting Raya–O know of my decision to stay on? I am a little embarrassed to display all this sentiment in front of the Seedseer..."},{"name":"RAYAOSENNA","text":"<span class=\"highlight\">Forename</span>, you have returned to me with word of Alaqa?"},{"name":"RAYAOSENNA","text":"Ah, I was of a mind to investigate the disturbance myself when it suddenly subsided. 'Twas fortunate you were nearby."},{"name":"RAYAOSENNA","text":"And I am heartened to hear that Alaqa has at last awakened her talent for conjury. I suspected it was not her potential nor lack of learning which stymied her progress, but a matter of confidence."},{"name":"RAYAOSENNA","text":"Her shift in perspective was encouraged in no small part by your inspiring presence, I am certain."},{"name":"RAYAOSENNA","text":"Ah, but do not allow such praise to deter you from perfecting your own art! The mastery of white magicks is a road which never truly ends, <span class=\"highlight\">Forename</span>."},{"name":"RAYAOSENNA","text":"I expect to hear ever greater things from you ere next we meet!"}],"reward":{"gil":1625,"items":[{"id":25186},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":25}],"questsType":"all","quests":[67954,68808]}},"partials":[{"type":"npc","id":"1006751","obj":{"i":1006751,"n":"Raya-O-Senna","l":56,"q":16}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"67954","obj":{"i":67954,"n":"What She Always Wanted","g":153,"l":"The Fringes","s":700,"f":1}},{"type":"quest","id":"68808","obj":{"i":68808,"n":"The Soul of Temperance","g":180,"l":"Kholusia","s":251,"f":1}}]}