{"quest":{"name":"True Beauty","location":"Limsa Lominsa","id":68754,"patch":5.0,"sort":800,"icon":100881,"eventIcon":71221,"issuer":1006757,"target":1043098,"genre":156,"journal":["Alka Zolka appears to be on the point of setting out somewhere.","You speak with Alka Zolka, who is pleased to see you again. He invites you to join him at a training session in upper La Noscea, where he will be meeting Surito Carito─and you agree, as one can never know too many martial tactics.","You and Alka Zolka locate Surito Carito near the Wanderer's Palace, where you are shortly joined by Setoto. The plan to train in Nymian mariner stratagems is soon left by the wayside, however, once you relate your experiences in the First. The story of how Lamitt cured stoneblight, in particular, catches Surito Carito's attention, and he exclaims that he may have an idea by which the same principles might be applied in the curing of the Nymian plague. It would not do to neglect any possible avenues that may lead to such a cure, of course, so the remaining three of you readily sign on to test his theory.","You travel to the South Shroud and obtain the root that Surito Carito assigned you to procure with little trouble. As your errand took you farthest from upper La Noscea, it would be reasonable to expect that the others will have completed their own portions of the preparation ere you return.","Alas, you are not the last to arrive back at the Wanderer's Palace─Alka Zolka, it transpires, was delayed by another run-in with a certain infamous goldsmith. Though all of the necessary materials are now assembled, there remains one more step to be taken: the testing of the experimental compound. Surito Carito hypothesizes that, in the unlikely event that he has miscalculated, consuming the concoction could result in an irreversible transformation into a mindless monster. Given the severity of the danger, he volunteers himself as test subject; however, Setoto points out that without him, the rest of the tonberries have little hope of finding a cure. She suggests that the compound be tested on her instead, but Alka Zolka is entirely unwilling to entertain the idea. Both become increasingly agitated, Setoto at last stalking off to spend time alone with her thoughts.","You speak with Alka Zolka, who seems genuinely not to understand why Setoto does not appreciate his objections to her plan. After sending him off to cool his head, Surito Carito privately shares with you that he is concerned that Setoto's willingness to volunteer herself as test subject stems more from her love for Alka Zolka and desire to be a normal girl than it does from the logic she presented. He begs you seek her out and determine whether she has truly thought her choice through.","When you confront Setoto, she admits to being in love with Alka Zolka, but maintains that this is not her primary reason for putting herself forth to test the cure. Rather, her experiences have imparted a keen awareness of the suffering that the tonberries are ever plagued by, and she is determined to help her countrymen─something that she is uniquely physiologically suited to do, as one of the youngest and last to have been afflicted with the disease.","Back at the Wanderer's Palace, Setoto reiterates her commitment to undergoing the experiment. This time, Surito Carito is convinced by her logic, and Alka Zolka by her heartfelt words. Thus, the test begins, Setoto drinking the concoction to destabilize her own aether, Alka Zolka holding the Amdapori focus aloft, and you and your faerie channeling as much restorative aether as you can manage together. Though the experience appears to be excruciating, Setoto bears the pain, and in the end stands before you a Lalafell, with nary a trace of green to be seen.","You speak with Alka Zolka, who is delighted that the cure was successful. He rambles about how admirable Surito Carito, you, and especially Setoto are before rushing off to continue his training, apparently seized with inspiration.","Setoto comments on Alka Zolka's abrupt departure with fondness, and affirms to you that she will find a way to convey her feelings to him someday, though she is in no hurry to do so. At last, she has a real future ahead of her─with ample time to live, to love, and to pursue her dreams of becoming a scholar.","Surito Carito, too, is pleased with the experiment's success. He vows to continue his research, and is confident that, in due course, he will be able to cure many more victims of the Nymian plague with the same methods tested on Setoto. Perhaps on some morn not far in the future, the sun will rise to see all tonberries restored to their former selves..."],"objectives":["Speak with Surito Carito outside of the Wanderer's Palace.","Survey the designated location and slay a verdant treant for its root.","Deliver the revival root to Surito Carito at the Wanderer's Palace.","Speak with Alka Zolka.","Speak with Setoto on the Long Climb.","Speak with Surito Carito at the Wanderer's Palace.","Speak with Alka Zolka.","Speak with Setoto.","Speak with Surito Carito."],"dialogue":[{"name":"ALKAZOLKA","text":"If it isn't <span class=\"highlight\">Forename</span>, in the flesh! It has been quite some time, hasn't it?"},{"name":"ALKAZOLKA","text":"R'ashaht keeps me apprised of any tales of your heroism that reach her ears, and I must say─they never fail to inspire me to reach for greater martial and tactical heights."},{"name":"ALKAZOLKA","text":"I have thus been seizing upon every opportunity to hone my skills, be it through employment or study. In fact, I have an appointment with Surito Carito shortly to review mariner stratagems for securing thoroughfares and byways. Would you care to join me?"},{"name":"ALKAZOLKA","text":"Excellent! It will be a pleasure to train alongside you again. I shall meet you at Camp Bronze Lake─Surito Carito awaits us there."},{"name":"ALKAZOLKA","text":"This is just like old times, isn't it?"},{"name":"SURITOCARITO","text":"My, what a pleasant surprise! I was unaware that you would be joining us today."},{"name":"SETOTO","text":"Heavens, is that <span class=\"highlight\">Forename</span> I spy?"},{"name":"ALKAZOLKA","text":"Setoto! A true pleasure to see you! Have you come for the exercises as well?"},{"name":"SETOTO","text":"Of course. It may have been well over a millennium ago that I began my studies, but I am still a student with much to learn."},{"name":"SETOTO","text":"Though I am somewhat hampered by the small matter that is my inability to summon a faerie whilst trapped in this grotesque form..."},{"name":"ALKAZOLKA","text":"You are hardly grotesque, my lady. And I'm confident that there is some way you might once again call forth a faerie─we need only find a way to tap the Royal Marine spirit within you. Come hells or high water!"},{"name":"SETOTO","text":"I... Let us hope you are right."},{"name":"SURITOCARITO","text":"Doubt not that he is. But first, given how rare this opportunity is, might I suggest that we begin by asking <span class=\"highlight\">Forename</span> to regale us with tales of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> recent endeavors? There is much we might learn from them."},{"name":"Q1","text":"What will you talk about?"},{"name":"A1","text":"Giott's growth."},{"name":"A2","text":"Lamitt's journey."},{"name":"ALKAZOLKA","text":"&lt;sniff&gt; Lamitt, she... And then Giott... &lt;sob&gt; I'm so proud of them..."},{"name":"SETOTO","text":"Lamitt's drive to save her sister, no matter what it cost her... It reminds me of my father."},{"name":"SURITOCARITO","text":"I can scarce believe you traveled to another world entirely. Were it anyone else, I would doubt the veracity of their words, but I can only envy you. You must have gained much insight into the nature of our own star."},{"name":"SURITOCARITO","text":"The concept of stoneblight fascinates me. Highly contagious, transforms the body... I cannot but draw parallels between it and the Nymian plague."},{"name":"SURITOCARITO","text":"What were you able to discern about the magic utilized in curing it?"},{"name":"SURITOCARITO","text":"Hmm... Perhaps the application of a high concentration of aether...but how? Might crystals serve to amplify? Assuming so..."},{"name":"SURITOCARITO","text":"It may work! The similarities of stoneblight to our own affliction─this may well be the key to a cure for the Nymian plague."},{"name":"SETOTO","text":"You mean to say that my body...and my ability to cast healing magic could be restored?"},{"name":"SURITOCARITO","text":"Precisely. It will be a complex process involving trial and error, of course, but I assume you are interested nevertheless?"},{"name":"SURITOCARITO","text":"Very good. Your assistance will hasten the process considerably."},{"name":"SURITOCARITO","text":"Setoto, I would have your aid in preparing the experimental compound."},{"name":"SURITOCARITO","text":"We will require instruments that allow for a high degree of precision. Alka Zolka, you must consult an expert goldsmith to procure suitable supplies."},{"name":"SURITOCARITO","text":"I believe we might make use of revival root, as well, though I know of no better source of it than the aged treants of Snakemolt. It will be something of a walk, I realize, but can I entrust this task to you?"},{"name":"ALKAZOLKA","text":"A challenge befitting the Royal Marines─and to it we shall rise!"},{"name":"SETOTO","text":"This is the closest thing to hope that I have felt in a very long time."},{"name":"SURITOCARITO","text":"...though the concentration needs exceed anything we have previ─ Ah, <span class=\"highlight\">Forename</span>. Yes, upon reflection, I am quite certain I require that root. The larger the cutting, the better."},{"name":"SURITOCARITO","text":"Were you able to procure the root?"},{"name":"SURITOCARITO","text":"Thank you─I expect this will be sufficiently potent. Now we only need await Alka Zolka's return, and..."},{"name":"ALKAZOLKA","text":"Apologies, I've only just escaped... I am acquainted with a goldsmith of some repute, and he agreed to fashion the instruments in return for my massaging him with salamander oil. Again."},{"name":"ALKAZOLKA","text":"However, the goods themselves should be more than adequate."},{"name":"SURITOCARITO","text":"Ah. They're a bit oily, but presumably that will come off."},{"name":"SURITOCARITO","text":"In which case, we can prepare the compound at any time. However, the matter of what follows is problematic."},{"name":"ALKAZOLKA","text":"Problematic? In what sense?"},{"name":"SURITOCARITO","text":"Though I am fairly confident in my theory, the experimental compound is just that─experimental. I did state before that this process would involve trial and error."},{"name":"SURITOCARITO","text":"As the Nymian plague does not affect beasts, to test it on any but a tonberry is impossible. Yet, as its ingestion will result in disruption to the body's aetherial balance, there is a possibility that the subject may find himself worse off than before."},{"name":"SURITOCARITO","text":"I have no intention of inflicting such a fate on any of my brethren, naturally. And so, should I be warped beyond recognition as a result...the task of destroying me will fall to you."},{"name":"ALKAZOLKA","text":"You cannot honestly believe we would agree to that!"},{"name":"SETOTO","text":"...What if you were to test it on me, instead?"},{"name":"ALKAZOLKA","text":"Absolutely not! You heard what he said─the test subject might very well become a monster!"},{"name":"SETOTO","text":"I am prepared to take the risk."},{"name":"ALKAZOLKA","text":"Well I'm not prepared to let you!"},{"name":"SETOTO","text":"So you would rather Surito Carito do it? If the test does fail, and he becomes some sort of abomination, who would remain to continue researching the cure? It follows that I ought to be the subject."},{"name":"ALKAZOLKA","text":"And I'm supposed to accept that?"},{"name":"SETOTO","text":"It's not your choice to make!"},{"name":"SURITOCARITO","text":"Please, calm yourselves. The admixture will take some time to prepare, in any case. We can discuss this later, when we have all had the opportunity to think."},{"name":"SETOTO","text":"Fine. I will do my thinking elsewhere, if it's all the same to you."},{"name":"SURITOCARITO","text":"I had hoped everyone would be amenable, but I suppose life is rarely so simple."},{"name":"ALKAZOLKA","text":"I don't understand─I'm merely trying to prevent her from placing herself in harm's way!"},{"name":"SURITOCARITO","text":"...I believe you too would be well served by a reprieve. Perhaps a bit of exercise?"},{"name":"ALKAZOLKA","text":"If you insist."},{"name":"SURITOCARITO","text":"&lt;sigh&gt; This would be a far sight easier if they were honest with one another."},{"name":"SURITOCARITO","text":"As you doubtless are aware, Setoto is quite enamored of Alka Zolka. She seems...disinclined to pursue the matter, however, her current condition being what it is."},{"name":"SURITOCARITO","text":"Though she raised a salient point, I would not have her volunteer if her primary goal is to remove that perceived obstacle. Were Alka Zolka to be forced to slay her, only to later learn what it was all for... It doesn't bear thinking about."},{"name":"SURITOCARITO","text":"Might you go and speak with her? I expect that she is fuming somewhere in outer La Noscea. She has a tendency to wander when she's distressed."},{"name":"SURITOCARITO","text":"If you were able to coax Setoto's honest feelings from her, I would be in a better position to decide whether this is truly something I can ask of the both of them."},{"name":"SETOTO","text":"I...apologize for my earlier conduct."},{"name":"SETOTO","text":"I have no intention of changing my mind, though. My logic is sound."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It is. But are the reasons you gave truly why you volunteered?"},{"name":"A2","text":"Is it? Love makes us do foolish things..."},{"name":"SETOTO","text":"Are they─ Ah. I see."},{"name":"SETOTO","text":"...That obvious, is it?"},{"name":"SETOTO","text":"Since it's come to this─yes, I am in love with Alka Zolka."},{"name":"SETOTO","text":"And maybe, were things different, I could be content with that. If we might walk, hand in hand, without drawing the attention of every would-be hero within ten malms. If my compatriots were just as free to pursue their own happiness."},{"name":"SETOTO","text":"As it is, however, his insistence upon protecting me above all else─it chafes."},{"name":"SETOTO","text":"I am no fool. I know that others, Alka Zolka included, are stronger than I, and I am not so proud as to refuse aid on principle."},{"name":"SETOTO","text":"But it's not enough to merely live, insulated from harm. I want─I've <span class=\"emphasis\">always</span> wanted to help people. Now more than ever, knowing firsthand the terrible toll this blight takes on all of us."},{"name":"SETOTO","text":"It is not simply my own desires that make me so adamant─truthfully, there is no more suitable subject on whom the cure might be tested. I had not yet seen twenty summers when I was afflicted, so if it has unanticipated effects, my body will be best able to bear them."},{"name":"SETOTO","text":"Moreover, I was one of the last to fall to the plague before we entered our lengthy slumber─meaning my illness is less advanced. If this potential cure shows results, they will present in me most quickly."},{"name":"SETOTO","text":"To say the thought that it could fail does not frighten me would be a lie. Yet...if there is a means by which I might save my people from suffering, I cannot ignore it. You've followed the path of the scholar─you understand, don't you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You do make a compelling argument."},{"name":"A2","text":"Yes, I think I know the feeling."},{"name":"SETOTO","text":"Thank you. Talking this through with you has helped to clear my head, I believe. I'm ready to speak with the others."},{"name":"ALKAZOLKA","text":"&lt;huff&gt; &lt;puff&gt; There! I...&lt;pant&gt;...I've finished running through Sergeant Tolga's...&lt;wheeze&gt;...thousand-step training regimen! "},{"name":"SURITOCARITO","text":"Ah, you have returned. How are you feeling?"},{"name":"SETOTO","text":"More confident than ever. You must test the cure on me."},{"name":"SETOTO","text":"Alka, please. I am not making this decision in haste, nor do I take it lightly. Truth be told, I'm terrified."},{"name":"SETOTO","text":"But I <span class=\"emphasis\">need</span> to do this. <span class=\"highlight\">Forename</span> agreed─it must be me."},{"name":"SURITOCARITO","text":"Hmm... Yes, I must admit, your reasoning is sound."},{"name":"SETOTO","text":"I appreciate that you worry for me, Alka. It means more than you know. But this is my duty─my battle to fight."},{"name":"SETOTO","text":"You can trust me to meet this foe with all I have─I vow not to quit the field until the bitter end. But if the time comes when I am no longer myself... I need to know that my fate is in good hands. In <span class=\"emphasis\">your</span> hands."},{"name":"ALKAZOLKA","text":"As you wish. I will be at your side, as any true mariner would. But know that I fully expect you to seize victory─come hells or high water."},{"name":"SETOTO","text":"I will. Thank you, Alka."},{"name":"SURITOCARITO","text":"Very well. If the both of you are resolved, I will abide by Setoto's decision."},{"name":"SURITOCARITO","text":"But before we begin, I must explain how the process is meant to work."},{"name":"SURITOCARITO","text":"First, Setoto will drink the compound I devised. This should destabilize the aetherial composition of her body. Once she has done so, Alka Zolka, you must stand at the ready with this, the gemstone retrieved from Amdapor. It shall serve as a focus."},{"name":"SURITOCARITO","text":"<span class=\"highlight\">Forename</span> and Lily will channel their restorative magic through the focus, amplifying it. In theory, being exposed to a sufficient volume of curative aether will encourage Setoto's own aether to attune to it and set itself to rights."},{"name":"SURITOCARITO","text":"If all are clear on what must be done, let us commence!"},{"name":"SETOTO","text":"Oh... Oh, it burns. It burns!"},{"name":"SURITOCARITO","text":"<span class=\"highlight\">Forename</span>, Lily, now!"},{"name":"ALKAZOLKA","text":"Fight it, Setoto!"},{"name":"SETOTO","text":"AAAUGH! &lt;pant&gt; Ah..."},{"name":"ALKAZOLKA","text":"You are truly radiant, Setoto. Inside and out."},{"name":"SURITOCARITO","text":"I was nearly certain that it would work, but to see the result is another matter entirely. I can scarce believe my eyes..."},{"name":"SETOTO","text":"I feel the breeze on my skin! Oh, it's <span class=\"emphasis\">wonderful</span>."},{"name":"ALKAZOLKA","text":"To think, after all this time, the endless research, we have a cure for the Nymian plague! That Surito Carito even managed to devise such a thing is remarkable enough, but to see it succeed..."},{"name":"ALKAZOLKA","text":"Without <span class=\"highlight\">Forename</span>'s skill as a scholar, it never would have been possible. And Setoto! Your kindness, your conviction, your strength of spirit..."},{"name":"ALKAZOLKA","text":"It inspires me to train with even greater fervor!"},{"name":"SETOTO","text":"That is so like him."},{"name":"SETOTO","text":"And he's still utterly oblivious to my feelings, I'm sure."},{"name":"SETOTO","text":"It's all right, though. I never truly expected to have another chance at the life I once envisioned for myself─and now that I do, I intend to enjoy it. There's no need to rush through all of the best parts."},{"name":"SETOTO","text":"That goes for my vocation, as well. I intend to relearn the scholarly arts, starting from the basics. And with my aetheric balance restored, I should be able to summon Lilac properly. Someday, we will be the salvation of those in need─I swear it."},{"name":"SETOTO","text":"For the moment, however, I have much training to do if I am to be fit for the Royal Marines. To that end─I'm off to find Alka!"},{"name":"SURITOCARITO","text":"Having labored for so long, so fruitlessly, and then to see the cure realized at last... I find myself at a loss for words."},{"name":"SURITOCARITO","text":"I will need to monitor Setoto's condition for a time, of course, lest there be adverse effects that were not readily apparent. But this is progress. Astounding progress, toward the day when we might see all tonberries restored to their former selves."},{"name":"SURITOCARITO","text":"In the meanwhile... Inexperienced in matters of the heart though they are, you needn't worry overmuch for those two. I have confidence that they will sort themselves out in due time."},{"name":"SURITOCARITO","text":"Fare you well, in whatever worlds your travels lead you to─and thank you."}],"reward":{"gil":2990,"items":[{"id":25186},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":29}],"questsType":"all","quests":[68463,68808]}},"partials":[{"type":"npc","id":"1006757","obj":{"i":1006757,"n":"Alka Zolka","l":28,"q":11}},{"type":"npc","id":"1043098","obj":{"i":1043098,"n":"Surito Carito","l":34,"q":1}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68463","obj":{"i":68463,"n":"Our Unsung Heroes","g":156,"l":"South Shroud","s":700,"f":1}},{"type":"quest","id":"68808","obj":{"i":68808,"n":"The Soul of Temperance","g":180,"l":"Kholusia","s":251,"f":1}}]}