{"quest":{"name":"Oboro's Big Idea","location":"Eastern La Noscea","id":68755,"patch":5.0,"sort":800,"icon":100882,"eventIcon":71221,"issuer":1010139,"target":1030053,"genre":152,"journal":["Oboro is wearing a shite-eating grin on his face for reasons you can only begin to imagine.","You reunite with Oboro, who cheerfully proclaims that he has at long last devised a plan to get the better of his longtime rival, Karasu Redbeak, and recover the half of the forbidden mudra scroll currently in the flamboyant ninja's possession. Splitting up so as not to attract attention, you make for the Hermit's Hovel─a bathhouse where Karasu has recently taken up residence─where Oboro means to elaborate on the details of his plan.","Upon your arrival, Oboro eagerly explains how he intends to thwart his rival. Oboro intends to distract Karasu in the midst of his daily bathing ritual, allowing you to sneak into the bathhouse and make off with the scroll─a strategy not unlike the one you employed on a previous adventure back in Kugane. Wait in the shadows at Oboro's instruction, and be prepared to make your move when Karasu has been lured away from the scene.","Oboro's ruse is a great success, as Karasu is all too willing to join him in a leisurely chat over some Hingan rice wine, leaving the bathhouse entirely unattended. Infiltrate the structure and sort through Karasu's belongings in search of the scroll before the wily ninja wises up to the situation and returns.","You succeed in finding the scroll alongside other considerably less helpful documents also scattered throughout the hovel. Make a discreet retreat and return to the Long Climb that you might rendezvous with Oboro and ascertain that what you found is indeed the authentic item.","Oboro rejoices upon seeing the scroll in your possession and declares the entire operation an unqualified triumph. He invites you to return to the dock storehouse that you might discuss matters further in private, and goes off on his way.","As Oboro revels in his triumph over his bitter rival, the two of you are joined by your mutual friend Captain Jacke of the Dutiful Sisters. Heartened by the unexpected reunion, the jovial rogue invites the both of you for celebratory dinner and drinks at the Bismarck, an offer which Oboro accepts gladly. Make your way to Limsa Lominsa, where you might share a fine feast with your companions.","At the Bismarck, your revelry is interrupted when Oboro rushes into the establishment half-naked. You and Captain Jacke quickly deduce that the “Oboro” whom you reunited with after the operation was none other than Karasu in disguise, a suspicion which is quickly confirmed when the savvy ninja reveals his true identity. The crow, victorious again over his erstwhile friend, offers a few mocking words, then turns into a bat and flaps away, leaving Oboro dejected and stark naked in the middle on the tavern floor. Jacke offers a few words of sympathy, and invites all of you back to the Sisters that you might find the poor man some clothes.","You arrive at the Sisters to find Oboro decked out in clothes from Captain Jacke's personal wardrobe, a particularly garish outfit to which the fashion-challenged ninja has inexplicably taken a liking. He fills you in on the particulars of his inglorious defeat at Karasu's hands, resolving in the end to get his revenge on his rival. After Oboro takes his leave, Captain Jacke encourages you not to be a stranger in La Noscea, as both he and your ninja friends will like as not have need of your services again."],"objectives":["Speak with Oboro at the Long Climb.","Keep lookout for Karasu behind the Hermit's Hovel.","Search inside the Hermit's Hovel and retrieve the scroll.","Wait for Oboro at the Long Climb.","Speak with Oboro at the dock storehouse.","Wait for your friends at the Bismarck.","Speak with Oboro at the Rogues' Guild."],"dialogue":[{"name":"OBORO","text":"You thought you'd evaded me for good, did you!? We'll see who has the last laugh! Ahahaha!"},{"name":"OBORO","text":"<span class=\"highlight\">Forename</span>...!? By the kami, don't sneak up on me like that! That is, of course I felt your presence. Yes, I was simply...deep in thought, that is all."},{"name":"OBORO","text":"But I daresay for good reason! For you see, I have finally tracked down that elusive bird, and am ready to seize him by the wings and take back what is mine!"},{"name":"OBORO","text":"I speak, of course, of that blasted Karasu. Ever since he escaped with half of the forbidden scroll, I have not let up the search for a moment. Today, at long last, I have found him! Truly, this is reason to rejoice, would you not agree?"},{"name":"OBORO","text":"And yet, the act of stealing the scroll back will not prove so simple. Which is why your arrival is truly a gift from the heavens! You will aid me in the task, will you not? It will be just like old times!"},{"name":"OBORO","text":"Once again, I owe you my gratitude. Now, let us get down to brass tacks, as Jacke would say. My shinobi have ascertained that Karasu has once again returned to Eorzean shores to ply his trade─such as it is─in the shadows of the black markets."},{"name":"OBORO","text":"Furthermore, they say he has taken up residence in secret at a secluded grove in La Noscea known as the Hermit's Hovel. You know the place, yes? Let us meet up there, and I will share with you the ingenious details of my plan. I will go ahead on my own─we do not want to attract attention, after all."},{"name":"OBORO","text":"I thank you for coming, <span class=\"highlight\">Forename</span>. Now, without further ado, let me explain precisely how I intend to recover the scroll from Karasu's clutches."},{"name":"OBORO","text":"My colleagues and I have been observing the man closely for a fortnight or so. Though one would assume otherwise, he is actually a man of remarkably consistent routine."},{"name":"OBORO","text":"He carries the scroll in a case that never leaves his side. Save, that is, for when he goes for his daily bath─at precisely the same hour each day..."},{"name":"OBORO","text":"I had a mind to lift the scroll from his possessions while he was otherwise occupied─much as we did with Zakuro that one time in Kugane─but would you believe it? Almost as if by magic, no sooner has he entered the baths than he is out again, scroll at his side and fully dressed in that garish garb of his."},{"name":"OBORO","text":"This is where you come in. Worry not: this will not involve any high-wire walking or elaborate disguises. I simply intend to invite the man to share a drink, and thereby delay his departure. In the meantime, you are to sneak into the bathhouse and steal away with the scroll."},{"name":"OBORO","text":"Ingeniously plotted, would you not say!? I need only lull Karasu into a false sense of security with my impeccable acting skills, and the scroll is as good as ours! What could go wrong?"},{"name":"OBORO","text":"So let us put the plan in action. Let us make for the hovel─separately, of course. Find yourself suitable cover, and wait for me to lure the crow away. We shall meet again here once you have safely recovered the scroll."},{"name":"OBORO","text":"As you can see, I have everything entirely under control. Find yourself cover─Karasu should be arriving any moment."},{"name":"KARASU","text":"Oho, but what's this!? Our hero arrives for a relaxing soak in his favorite spring, only to be stared down by his self-styled rival and realm-renowned oaf Oboro the dim! Have you not yet had your fill of being outwitted and embarrassed by your betters?"},{"name":"OBORO","text":"Spare me the bombast and bluster, Karasu. I stand before you today with an offer...an offer of peace."},{"name":"OBORO","text":"We are countrymen, and there was once a time when we called each other friend. Has our conflict not persisted long enough?"},{"name":"OBORO","text":"So let us lay down our weapons for a day. Let us soak in these soothing waters, reminisce about times gone by, and see if we cannot put our petty differences behind us. Why, I've even brought a bottle of Hingan rice wine for the occasion..."},{"name":"KARASU","text":"Astonishing! Incredible! Has the dim one lost his wits? Does he believe that a few flowery words are enough to pull the wool over the crow's keen eyes while he steals away with the scroll? The audience gasps at the sheer audacity!"},{"name":"OBORO","text":"Believe me or do not, the choice is yours. But this I swear: I have no interest in seeing the two halves of that accursed scroll reunited."},{"name":"OBORO","text":"On the contrary, with one half safely sealed away in our village, and the other in the hands of the realm's most elusive ninja, the forbidden mudra will never be wielded again─and I would not have it any other way."},{"name":"OBORO","text":"Furthermore, I have recently found enlightenment of a sort. At long last, I have realized that your skill with ninjutsu far exceeds my own─even had I once desired to steal the scroll back from you, I am now painfully aware that doing so is entirely beyond my abilities."},{"name":"KARASU","text":"Oho! Well, color me surprised! The boy's actually grown half a brain since last we met!"},{"name":"KARASU","text":"But aren't you being a bit naive, Oboro? After all, what's to stop me from simply returning to our village, effortlessly incapacitating our elders, and seizing the other half of the scroll for myself!?"},{"name":"OBORO","text":"I know you too well, Karasu. It is not power that you crave, but freedom. You have worked too long, too hard to cast off the shackles of our village to risk losing it all over a single scroll."},{"name":"KARASU","text":"The audience gasps! Why, I do believe that's the single most intelligent utterance that's ever escaped the dim one's lips!"},{"name":"KARASU","text":"Very well, then. I'm feeling generous today, so I do believe I'll entertain your offers. Though for your sake, I do hope that the rice wine you've brought is a good vintage. I simply can't <span class=\"emphasis\">abide</span> poor taste in beverages, you see..."},{"name":"SYSTEM","text":"You found a scroll! It's entitled <span class=\"emphasis\">Mastering Doman Mahjong: A Primer for Prentices</span>. This doesn't appear to be the item you were looking for..."},{"name":"SYSTEM","text":"You found a scroll! It's entitled <span class=\"emphasis\">Big Ears and Bushy Tails: On the Breeding and Rearing of Rabbits</span>. This doesn't appear to be the item you were looking for..."},{"name":"SYSTEM","text":"You found a scroll! It's entitled <span class=\"emphasis\">Oboro's Dullest and Most Dim-witted Moments, as Chronicled by Karasu Redbeak</span>. This doesn't appear to be the item you were looking for..."},{"name":"SYSTEM","text":"You found a scroll! It's entitled <span class=\"emphasis\">The Wandering Minstrel's Greatest Mysteries Revealed</span>. This doesn't appear to be the item you were looking for..."},{"name":"SYSTEM","text":"The bookshelf appears to be quite sturdy. Perhaps you could use it as a foothold to reach the room above..."},{"name":"KARASU","text":"(-Oboro-)Ah, you return, friend! And with the scroll safely in your grasp, no doubt. Let me examine it, that I might ascertain its authenticity."},{"name":"KARASU","text":"(-Oboro-)Yes...yes, there can be no doubting it. This is indeed the forbidden mudra I sought! After all these years, finally have I outwitted that accursed crow!"},{"name":"KARASU","text":"(-Oboro-)And yet, we must be wary. No doubt, Karasu has already realized that something is amiss. Let us reconvene at the storehouse before he can pick up our trail."},{"name":"KARASU","text":"(-Oboro-)Welcome back, <span class=\"highlight\">Forename</span>. Do forgive me if I am a bit giddy. I still cannot quite believe that I outwitted Karasu for once. My plans have a habit of...firing back, as they say."},{"name":"KARASU","text":"(-Oboro-)Why, you should have seen him! So convincing was my act, that by the time we were through he was stumbling and slurring his words so much that you'd think he'd downed a whole bathtub's worth of rice wine! Ahahahaha! Hahaha! ...Hah."},{"name":"JACKE","text":"(-Roguish Voice-)Gods' piss, lad, shut yer gob! Every cove and mort for malms can hear ye blabbin'..."},{"name":"KARASU","text":"(-Oboro-)Ah, Captain Jacke! A pleasure as always. Do forgive me my outburst. I was merely celebrating with our mutual friend here my most remarkable triumph over the accursed Karasu!"},{"name":"JACKE","text":"Ho there, <span class=\"highlight\">Forename</span>! Always a pleasure to see a dimber damber like yerself back in town. I trust yer stabbers haven't dulled none since last we met?"},{"name":"JACKE","text":"Anyway, between this reunion an' Oboro's hard-won victory, I reckon we've got cause to celebrate. What say we drag our dew beaters back to town and yaffle ourselves a bite at the Bismarck?"},{"name":"KARASU","text":"(-Oboro-)A splendid idea, my friend! Why, I would enjoy nothing more than to share this joyous moment with my boon companions. To the Bismarck, then─and the first round is on me!"},{"name":"JACKE","text":"That's the spirit! I'll send ahead for Underfoot and the Stray─the more, the benar after all! Aye, been too long since we had a right little rogue family reunion."},{"name":"KARASU","text":"(-Oboro-)An upstanding fellow as ever, that Captain Jacke. Ah, but it is somewhat bittersweet, is it not? Now that my long-standing pursuit of Karasu has come to a close, I find myself in search of a new mission─a new purpose in my life, such as it were."},{"name":"KARASU","text":"I have no intention of returning to the cramped confines of my village...and yet, I am uncertain where my abilities might best avail the people of this realm. Pray tell, what sort of adventures have you been occupying yourself with of late?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I traveled to the First."},{"name":"A2","text":"I did battle with a great hunter."},{"name":"KARASU","text":"(-Oboro-)What's this you say? There exist worlds out there other than our own...!? If you are having a jest at Oboro's expense, old friend, let it be known I do not find it amusing!"},{"name":"KARASU","text":"(-Oboro-)But no...I can tell that you say this in earnest. Consider me intrigued, though forgive me if I am not in a hurry to seek out a means to travel there. No, I will bide my time here in Eorzea, and carefully ponder my future."},{"name":"KARASU","text":"(-Oboro-)At any rate, we mustn't keep Jacke and the others waiting, yes? I will make for the Bismarck as soon as I have attended to my affairs here. Why don't you travel on ahead?"},{"name":"KARASU","text":"(-Oboro-)...And just like that, the scroll was mine again! And so I say, who is the “dim” one now, you damned crow!? Ahahaha!"},{"name":"JACKE","text":"Aye, aye...ye've told the tale thrice over already. Is the mutton here yet? I'm right banded, I say..."},{"name":"KARASU","text":"(-Oboro-)And I will tell it over and again, my good captain! After all, it is no small feat to triumph over Karasu─quite possibly the most supremely skilled <span class=\"emphasis\">shinobi</span> our village─nay, our world has ever known!"},{"name":"JACKE","text":"Ye can say that again...wait, ye already have."},{"name":"OBORO","text":"M-My friends! Be on your guard! That Oboro is a fake!"},{"name":"PERIMUHAURIMU","text":"Wait, what in the...? There's two of 'em!"},{"name":"KARASU","text":"(-Oboro-)What nonsense is this!? The sheer gall of this man! Clearly, if anyone here is a <span class=\"emphasis\">fake</span>, it is the madman standing in the middle of this fine establishment stripped down to nothing but his undergarments!"},{"name":"VKEBBE","text":"I don't know, Jacke... They both look right convincin' to me..."},{"name":"Q1","text":"Which is the true Oboro?"},{"name":"A1","text":"The one in his underclothes."},{"name":"A1","text":"The one fully dressed."},{"name":"JACKE","text":"Aye, Jacke's glazes say the same. Only the real Oboro'd be daft enough to stumble into this place stripped down to his skivvies."},{"name":"JACKE","text":"I wouldn't be so sure o' that, <span class=\"highlight\">Forename</span>! No, ol' Jacke reckons that one's too dimber to be the real Oboro..."},{"name":"KARASU","text":"(-Oboro-)Oh, <span class=\"emphasis\">fine</span> then. I tire of this drab old disguise, anyhow."},{"name":"OBORO","text":"Karasu! Does your villainy know no bounds!?"},{"name":"KARASU","text":"<span class=\"emphasis\">Villainy</span>? You wound me, Oboro! Why, after I learned the art of illusion from that overstuffed Lord What's-his-name, I simply thought I would put it to use and have a little fun. We did have fun, didn't we?"},{"name":"KARASU","text":"I must say, Oboro, your friends are far more entertaining than you are. I daresay you could learn a thing or two from them. But ah well, I suppose all good things must come to an end. Till we meet again...farewell!"},{"name":"OBORO","text":"...Off like a crow in the night."},{"name":"JACKE","text":"Don't be too hard on yerself, boy. He had us all rooked."},{"name":"JACKE","text":"Anyhow, now that all's bob, I reckon it's about time we took our dew beaters to the Sisters. You come along too, Oboro. I'll get ye somethin' to...cover yerself up a bit."},{"name":"JACKE","text":"What do ye say, <span class=\"highlight\">Forename</span>? I reckon the lad's lookin' sharper than ever."},{"name":"PERIMUHAURIMU","text":"Say what ye will, but Jacke's fashion sense is certainly one of a kind."},{"name":"VKEBBE","text":"That's one o' Jacke's favorite outfits. The poor colt..."},{"name":"OBORO","text":"Captain Jacke was kind enough to lend me some garb from his personal wardrobe. They are rather, er, how might I describe it...?"},{"name":"OBORO","text":"Sophisticated! Stylish! Dashing and delightful!"},{"name":"JACKE","text":"Did I tell ye or did I tell ye!? Ol' Jacke's got ye lookin' benar than ever before! Every rum doxy in Limsa won't be able to take 'er glazes off ye!"},{"name":"VKEBBE","text":"Nor can I...an' not in a good way."},{"name":"OBORO","text":"In any event, I owe you all─especially you, <span class=\"highlight\">Forename</span>─an apology for this most unfortunate turn of events."},{"name":"OBORO","text":"I had thought my plan flawless, but unfortunately I had neglected to account for one thing: the possibility that Karasu's tolerance for Hingan rice wine might be considerably higher than my own."},{"name":"OBORO","text":"I cannot say for sure precisely what happened. All I know is that one moment we were engaged in a most delightful conversation, and the next I was lying on a cot in the hovel with nothing but my undergarments on me."},{"name":"OBORO","text":"Suspecting that something was amiss, I dashed back to the dock storehouse as quick as my legs could carry me, only to find neither you nor Karasu present...and my personal wardrobe completely empty, to boot."},{"name":"JACKE","text":"Hah! A dimber damber as always, that one. Gettin' you some new duds was one thing, but cloyin' that scroll back from Karasu is goin' to be a whole 'nother matter."},{"name":"OBORO","text":"Damn it all! But mark my words─that scoundrel will not get away with his villainy this time. No, I must return to the storehouse at once and draw up a plan to retrieve what is rightfully mine!"},{"name":"JACKE","text":"Ahahaha! For all the lad's whingin', damned if he didn't actually seem <span class=\"emphasis\">pleased</span> with this turn of events."},{"name":"JACKE","text":"Well, <span class=\"highlight\">Forename</span>. Reckon ye've got adventures ye'd best be gettin' back to, eh? Just promise me ye'll drop in on Oboro and lend him your daddles from time to time. He's a good lad, but he's got a habit of trippin' over his own two dew beaters, if ye whiddle me."},{"name":"JACKE","text":"...Heh. Now ye've got me soundin' like the boy's father. Anyhow, don't be a stranger here at the Sisters, either. Gods only know we can always use a dimber damber like yerself."}],"reward":{"gil":1863,"items":[{"id":25187},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":92}],"questsType":"all","quests":[68488,68814]}},"partials":[{"type":"npc","id":"1010139","obj":{"i":1010139,"n":"Oboro","l":1428,"q":18}},{"type":"npc","id":"1030053","obj":{"i":1030053,"n":"Oboro","l":1427,"q":1}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68488","obj":{"i":68488,"n":"When Clans Collide","g":152,"l":"Yanxia","s":700,"f":1}},{"type":"quest","id":"68814","obj":{"i":68814,"n":"Courage Born of Fear","g":181,"l":"Kholusia","s":351,"f":1}}]}