{"quest":{"name":"The Legend of Musosai","location":"Kugane","id":68759,"patch":5.0,"sort":800,"icon":100886,"eventIcon":71221,"issuer":1022184,"target":1030622,"genre":160,"journal":["Makoto looks to be preparing for a journey.","Makoto informs you that she is about to depart for Eorzea in order to visit Musosai's grave. Believing the timing of your arrival to be fortuitous, she invites you to accompany her on the journey, and you are happy to oblige. Upon arriving in Ul'dah, she says that she will first call on your showmaster friend, Momozigo, at the Quicksand.","You and Makoto come to the Quicksand, but Momozigo is presently absent. For now, you decide to continue on to the Silver Bazaar, where Musosai was laid to rest.","At the Silver Bazaar, Makoto cannot help but notice the presence of folk attired as samurai. While the observation is indeed curious, you set them aside in your mind for now and proceed to Musosai's grave.","Kneeling before Musosai's grave, Makoto tells him of your victory over Ugetsu and his insurgents. No sooner does she finish her report than a commotion breaks out nearby, and she instinctively dashes off to investigate. Catching up to her, you are met with the sight of a familiar-looking Roegadyn. The man takes exception at those who are dressed as samurai, saying that they sully Musosai's memory. As soon as he sees you, however, he flees the scene as if his life depended on it. Her interest piqued by the fact that he knows both you and Musosai, Makoto decides to give chase, and you follow on her heels in the direction of the docks.","It doesn't take long for you and Makoto to corner the mystery man, who is revealed to be none other than Ostyrgrein, the bodyguard you defeated on the deck of a ship once upon a time. He claims he has since mended his ways, and desiring to become a true samurai, has taken to visiting Musosai's grave daily. Recently, however, someone has been telling the tale of Musosai's quest to right wrongs, which resulted in the Silver Bazaar becoming something of a tourist attraction. This led to his earlier outburst, which in turn led you and Makoto to him. Ostyrgrein then begs you to take him on as his pupil, but you are reluctant to do so. Sensing his determination, Makoto invites him to come to Kugane to train, and he happily accepts. Before they depart for the Far East, however, Makoto suggests returning once more to the Quicksand, where she believes another familiar face may be found telling a familiar tale.","As Makoto had suspected, the storyteller who has been spreading the tale of Musosai's deeds is none other than Momozigo, and he begins another session soon after you arrive. You listen intently as he dramatically recounts your journey with your former master, the words bringing your memories of that time back to vivid life. Afterwards, you share with him your recent adventures in the First, that he might add to his repertoire. Having bid Makoto and Ostyrgrein farewell, Momozigo urges you to keep up fighting the good fight, that Musosai's legacy might live on not only in you, but in others besides."],"objectives":["Speak with Makoto in Ul'dah.","Speak with Makoto at the Silver Bazaar.","Speak with Makoto.","Speak with the familiar fellow.","Speak with Makoto in Ul'dah."],"dialogue":[{"name":"MAKOTO","text":"<span class=\"highlight\">Forename</span>, how good of you to pay me visit, and now of all times!"},{"name":"MAKOTO","text":"You see, I'm about to depart for Eorzea to visit Master Musosai's grave, to tell him of our victory over Ugetsu."},{"name":"MAKOTO","text":"That you should come to me at this juncture is most fortuitous. Would you do me the honor of accompanying me on this journey?"},{"name":"MAKOTO","text":"Thank you, my friend. And lest you wonder, I've not forgotten about Momozigo. I would call on him as well. Upon arriving, let us first go to the Quicksand."},{"name":"MAKOTO","text":"I'm afraid Momozigo isn't here. According to the folk here, he is in the midst of preparing for another spectacle."},{"name":"MAKOTO","text":"Though I'm curious as to what he has in store, we shouldn't keep Master Musosai waiting. Let us go to his grave first."},{"name":"MAKOTO","text":"The place was the Silver Bazaar, if I recall correctly. Come, let us be on our way."},{"name":"MAKOTO","text":"The town is much livelier than I recall...and there are folk attired as samurai besides. Curious."},{"name":"MAKOTO","text":"But come, Master Musosai awaits."},{"name":"MAKOTO","text":"We did it, Master Musosai."},{"name":"MAKOTO","text":"With <span class=\"highlight\">Forename</span> standing with us, we defeated Ugetsu and put an end to his madness."},{"name":"MAKOTO","text":"And your teachings, your legacy─they live on in the Sekiseigumi. So please rest easy."},{"name":"MAKOTO","text":"'Tis done. Thank you for accompanying me."},{"name":"OSTYRGREIN","text":"(-???-)Argh! I won't stand for this mummery!"},{"name":"MAKOTO","text":"That sounds like trouble. Let us go and see what is afoot."},{"name":"OSTYRGREIN","text":"(-Familiar Fellow-)Dressing like a samurai don't make you one! You bastards sully Master Musosai's memory!"},{"name":"OSTYRGREIN","text":"(-Familiar Fellow-)Thal's balls, it's...it's you! Uwaaaaaah!"},{"name":"MAKOTO","text":"That man knows you and Master Musosai both. I would find out who he is."},{"name":"MAKOTO","text":"We have him, <span class=\"highlight\">Forename</span>."},{"name":"OSTYRGREIN","text":"(-Familiar Fellow-)F-Forgive me! I've learned my lesson! Since you trounced me on the ship, I've mended my ways!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You're that false samurai!"},{"name":"A1","text":"Ostyrgrein!"},{"name":"OSTYRGREIN","text":"(-Ostyrgrein-)A-Aye, I'm Ostyrgrein. The bodyguard to a serial killer who thought he could take you on."},{"name":"OSTYRGREIN","text":"(-Ostyrgrein-)But I've stopped selling my sword to crooks. I lead an honest life now, selling toad oil."},{"name":"MAKOTO","text":"It seems to me the evil in this man has been excised."},{"name":"MAKOTO","text":"You have naught to fear from <span class=\"highlight\">Forename</span>. Please be at ease, and tell us the cause of your earlier outburst."},{"name":"OSTYRGREIN","text":"(-Ostyrgrein-)You see, after I saw what a true samurai could do, I knew I wanted to become one too. So I sought Master Musosai out, hoping he'd take me on as a pupil..."},{"name":"OSTYRGREIN","text":"(-Ostyrgrein-)...Only to learn he'd already passed away. Since then, I've been visiting his grave every day in order to get inspiration."},{"name":"OSTYRGREIN","text":"(-Ostyrgrein-)Recently, though, someone's been telling the tale of Master Musosai's quest to right wrongs at the Quicksand. On account of that, people started dressing up like samurai and flocking to his grave like it's some godsdamned spectacle. But they're false, the whole lot of 'em! Falser than I ever was!"},{"name":"MAKOTO","text":"I had the honor of knowing Master Musosai. And the Master Musosai I knew would be glad if his tale inspired others to follow in his footsteps."},{"name":"MAKOTO","text":"And though he was a solitary man, he did not spurn the company of others. I don't believe he would mind the crowds."},{"name":"OSTYRGREIN","text":"(-Ostyrgrein-)Really? Well, I suppose you'd know better than me... Ah! But of course!"},{"name":"OSTYRGREIN","text":"(-Ostyrgrein-)Might be as Master Musosai is gone, but you were his pupil! I beg you, teach me how to be a true samurai like you!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I don't have the time."},{"name":"A2","text":"..."},{"name":"MAKOTO","text":"<span class=\"highlight\">Forename</span> has much demands on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> time and is not in a position to take on pupils. But if you are determined to learn, I invite you to come to Kugane. I can introduce you to schools of swordsmanship."},{"name":"OSTYRGREIN","text":"(-Ostyrgrein-)Y-You mean I can train in the Far East? Where it all began? I'd love nothing more! It'd be a dream come true!"},{"name":"MAKOTO","text":"Very well. A long journey is better with company. Let us return to Kugane together."},{"name":"MAKOTO","text":"Though I wonder, this someone who has been telling the tale of Master Musosai's quest... It seems to me it could only be one person."},{"name":"MAKOTO","text":"It would be a shame to have come all this way and not see our friend. Let us try visiting the Quicksand again."},{"name":"OSTYRGREIN","text":"It shames me to say I don't actually know much about Master Musosai. I'd be interested in hearing this tale myself."},{"name":"MAKOTO","text":"As I had suspected, Momozigo is indeed our storyteller. And as luck would have it, he's about to begin another session."},{"name":"MOMOZIGO","text":"Gather ye around, one and all, and listen to my tale..."},{"name":"MOMOZIGO","text":"A tale that began with an unlikely meeting between a young adventurer and an elderly samurai hailing from the Far East."},{"name":"MOMOZIGO","text":"Known as Musosai, the samurai took on challengers upon the bloodsands. Many answered his call, but none had an answer to his transcendent swordsmanship. For a time, it seemed that he would go undefeated..."},{"name":"MOMOZIGO","text":"But there came one unassuming adventurer. Wielding the katana, a foreign weapon <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> had theretofore never held, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> fought with heart and skill to claim victory!"},{"name":"MOMOZIGO","text":"After journeying the realm over, vanquishing evil together, never could the adventurer have imagined that, for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> final test, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> must vanquish Musosai himself."},{"name":"MOMOZIGO","text":"Left with no recourse, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> drew <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> katana and faced <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> friend and master."},{"name":"MOMOZIGO","text":"A grueling battle unfolded, with neither side yielding a single ilm. The adventurer brought <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> all to bear, but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> was matched at every turn by Musosai, who unleashed technique after deadly technique, betraying no signs of the illness that ravaged his body."},{"name":"MOMOZIGO","text":"But at the end of a contest of equals, it was the younger samurai who dealt the final blow to emerge the victor. <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> master had trained <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> well."},{"name":"MOMOZIGO","text":"As he lay battered and bloodied on the snow, Musosai demanded that his pupil finish it. Shutting <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> eyes tight, the adventurer raised <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> katana..."},{"name":"MOMOZIGO","text":"WHOOSH! The blade traced a vicious arc!"},{"name":"MOMOZIGO","text":"...And cleaved empty air. The adventurer had excised the evil in Musosai, as Musosai himself had done for those who could yet be redeemed."},{"name":"MOMOZIGO","text":"So it was that the elderly samurai found peace in his final moment. It is said that his soul now rests atop the cliff by the Silver Bazaar, where he gazes out at the setting sun."},{"name":"MOMOZIGO","text":"And somewhere out there, the young adventurer continues <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> noble master's legacy, fighting for justice and vanquishing evil wheresoever it should exist."},{"name":"MOMOZIGO","text":"So ends my tale─the Legend of Musosai. Thank you all for your kind attention."},{"name":"MOMOZIGO","text":"You know, it's harder to do this with you lot in the audience...but it's good to see you all─even Mister Fake Samurai."},{"name":"MOMOZIGO","text":"You're doubtless wondering how I fell into my new calling. Well, during my trip to Kugane, I had the chance to hear a storyteller at the Mujikoza. I knew right away that this is what I wanted to do─what my gift of the gab was meant for."},{"name":"MAKOTO","text":"That was a masterful and heartfelt retelling. I pray that you will continue to share the tale of Master Musosai with all the world."},{"name":"MOMOZIGO","text":"You can depend on it! Though of course, if I'm to be a storyteller worth my salt, I'll need some variety in my repertoire."},{"name":"MOMOZIGO","text":"<span class=\"highlight\">Forename</span>, you're still out there doing your adventuring, aren't you? Don't you have any new tales to share that could make for a good yarn?"},{"name":"Q3","text":"What will you tell him about?"},{"name":"A3","text":"The struggle to save the First."},{"name":"A3","text":"The hunt for Andreia."},{"name":"MOMOZIGO","text":"By the Twelve... Your quest to right wrongs took you across the rift and to another world? Truth really is stranger than fiction..."},{"name":"MOMOZIGO","text":"My thanks, <span class=\"highlight\">Forename</span>! This will be a splendid addition to my tales!"},{"name":"MAKOTO","text":"I'm afraid it is time we sought our ship. Brief though it was, I'm glad for our reunion."},{"name":"OSTYRGREIN","text":"I'm gonna train hard in Hingashi, an' I'm gonna come back a real samurai! Jus' you watch!"},{"name":"MAKOTO","text":"If your travels should bring you to Kugane again, please come and seek me out at the barracks. Till next time..."},{"name":"MOMOZIGO","text":"To think that pretender would have a change of heart and try to become a true samurai... The old man will be pleased."},{"name":"MOMOZIGO","text":"It goes to show, Musosai's legacy truly lives on in you, <span class=\"highlight\">Forename</span>. And it takes root even in the hearts of those you've sliced up."},{"name":"MOMOZIGO","text":"So keep fighting the good fight, my friend. And remember to visit me from time to time to share more of your tales!"}],"reward":{"gil":2518,"items":[{"id":25187},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":111}],"questsType":"all","quests":[68106,68814]}},"partials":[{"type":"npc","id":"1022184","obj":{"i":1022184,"n":"Makoto","l":2404,"q":5}},{"type":"npc","id":"1030622","obj":{"i":1030622,"n":"Makoto","l":40,"q":1}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68106","obj":{"i":68106,"n":"The Battle on Bekko","g":160,"l":"Kugane","s":700,"f":1}},{"type":"quest","id":"68814","obj":{"i":68814,"n":"Courage Born of Fear","g":181,"l":"Kholusia","s":351,"f":1}}]}