{"quest":{"name":"Machinists for the Morrow","location":"Ishgard","id":68756,"patch":5.0,"sort":800,"icon":100883,"eventIcon":71221,"issuer":1014577,"target":1014577,"genre":158,"journal":["Stephanivien and his prospectometer are once more focused upon you.","No sooner do you set foot in the manufactory when Stephanivien makes a sudden request. It would seem that Joye is once again slipping away on mysterious outings and acting in a generally suspicious manner. Concerned for her well-being, Stephanivien sends you out to Saint Reinette's Forum to observe his right-hand woman's behavior. Discreetly, of course.","After witnessing an obviously planned meeting between Joye and Hilda, you are approached by Ser Muscadain. According to the Temple Knight, the unlikely pair has been seen making trips together to Falcon's Nest. Stephanivien will wish to hear of this...","You make your report to Stephanivien, and the manufactory chief's surprise quickly turns to confused curiosity. Unable to make sense of the pairing or the destination, Stephanivien proposes a trip to Falcon's Nest for a spot of good old-fashioned reconnaissance.","Within moments, Stephanivien has gathered enough information to point the two of you in the direction of the Black Iron Bridge. It seems Joye and Hilda's expeditions often take them out into the snow-covered wilds...","The sound of shots ringing in the air leads you right to where Joye and Hilda are attempting─albeit unsuccessfully─to develop new machinist techniques. Not wishing to disrespect their struggle for independent learning, Stephanivien elects to support their efforts indirectly. After some discussion, it is decided that you will inspire them with a <span class=\"emphasis\">completely coincidental</span> demonstration of skill─a proposal which has you waiting at a spot nearby whilst Stephanivien herds towards you a suitably monstrous opponent.","You have defeated the charging brute with the appropriate panache. Rendezvous with Stephanivien back near the Black Iron Bridge.","You rejoin Stephanivien by the bridge, and he commends you on your masterful performance before urging a swift return to the manufactory. Your work here is done.","Even as Stephanivien praises you again for a job well done, Joye and Hilda make their entrance. It soon becomes clear that your attempts to provide subtle assistance were not quite as subtle as you believed. Despite their exasperation, however, the two ladies are nonetheless grateful for the nudge in the right direction. Joye and Hilda give their thanks and take their leave, promising to carry on the evolution of the machinist profession. Once more have your remarkable deeds proven the unerring accuracy of Stephanivien's internal prospectometer."],"objectives":["Look for Joye at the designated location.","Report to Stephanivien.","Speak with Stephanivien at Falcon's Nest.","Look for Joye and Hilda at the designated location.","Wait at the designated location and dispatch Stephanivien's herded monster.","Rendezvous with Stephanivien.","Speak with Stephanivien at the Skysteel Manufactory."],"dialogue":[{"name":"STEPHANIVIEN","text":"Ah, <span class=\"highlight\">Forename</span>, my prospectometer never fails! I knew your own well-honed instincts would alert you to my current turmoil."},{"name":"STEPHANIVIEN","text":"'Tis our faithful Joye who concerns me. Her behavior has been awfully odd of late─frequent outings to parts unknown, acting secretive, that sort of thing."},{"name":"STEPHANIVIEN","text":"It reminds me of the time her father was being held captive, and I worry that she once more finds herself the victim of nefarious circumstances."},{"name":"STEPHANIVIEN","text":"That is, as they say, where you come in. An adventurer and machinist of your caliber should have little trouble discerning the severity of her situation. Discreetly, of course!"},{"name":"STEPHANIVIEN","text":"I would make a few subtle inquiries myself, but I fear that Joye, her senses on edge as they are, would soon detect the attempt..."},{"name":"STEPHANIVIEN","text":"Ahem. As fortune would have it, she only just left on one of her mysterious outings. You should be able to catch her in the vicinity of Saint Reinette's Forum if you leave immediately!"},{"name":"STEPHANIVIEN","text":"Cast your eye over Saint Reinette's Forum, and see if you cannot locate Joye─or failing that, a hint as to the truth of her predicament."},{"name":"HILDA","text":"(-???-)Sorry, Joye, hope I didn't keep you waitin' too long."},{"name":"JOYE","text":"I just got here meself, as a matter of fact, but we'd best be gettin' along all the same."},{"name":"HILDA","text":"Aye, today's the day─I can feel it!"},{"name":"MUSCADAIN","text":"(-???-)Ah, champion."},{"name":"MUSCADAIN","text":"You have business in the city? With my sister, mayhap? I thought I spied her in the crowd, making her way to the Forum..."},{"name":"MUSCADAIN","text":"So Lord Stephanivien is concerned for Joye, then? Well, he has placed his trust in the right agent if it is discretion he requires."},{"name":"MUSCADAIN","text":"As it happens, I may even have information of use to you. It has been brought to my attention that Joye and Hilda have been spotted together in Falcon's Nest on more than one occasion."},{"name":"MUSCADAIN","text":"They've both earned a measure of fame here in Ishgard, you see─sufficient to warrant a curious mention to the Temple Knights when the two of them are seen traveling as a pair."},{"name":"MUSCADAIN","text":"I am somewhat curious about Hilda's activities myself...but I shall leave further investigations in your capable hands. Pray convey my regards to Lord Stephanivien."},{"name":"HILDA","text":"Were you wantin' to chat about somethin', <span class=\"highlight\">Forename</span>? As much as I'd like to hang about and gab, I've other errands to rush off to..."},{"name":"STEPHANIVIEN","text":"Oh, <span class=\"highlight\">Forename</span>! Welcome back! Were you able to divine aught of consequence?"},{"name":"STEPHANIVIEN","text":"...With Hilda, you say!? What in Halone's name could they be doing in Falcon's Nest...?"},{"name":"STEPHANIVIEN","text":"...Hmmm, not a peep from my prospectometer. I suppose there's naught else for it─we must fall back on old-fashioned reconnaissance."},{"name":"STEPHANIVIEN","text":"Pray lend me your assistance a while longer, <span class=\"highlight\">Forename</span>. To Falcon's Nest we go!"},{"name":"STEPHANIVIEN","text":"Joye and Hilda─an unexpected partnership, and for what purpose...? Only a jaunt to Falcon's Nest will tell!"},{"name":"STEPHANIVIEN","text":"There you are, <span class=\"highlight\">Forename</span>. Had you any idea how famous our machinists have become? I had only to mention Joye and Hilda by name to be inundated with a veritable flood of rumors."},{"name":"STEPHANIVIEN","text":"'Twould seem our unlikely pair are en route to the Black Iron Bridge. And just like that, we have our next destination..."},{"name":"STEPHANIVIEN","text":"What answers await us at the Black Iron Bridge, I wonder...?"},{"name":"STEPHANIVIEN","text":"The ladies are supposedly on their mystery errand somewhere in this area. Let us have a good look around."},{"name":"STEPHANIVIEN","text":"Shots from a firearm─and there can be no mistaking the owners. Come, we might have a better view from the edge of the cliff."},{"name":"HILDA","text":"It's no good, I've got nothin'. What about you, Joye?"},{"name":"JOYE","text":"Me mind's a blank. Easy enough to say, but a damn sight harder to do, eh?"},{"name":"HILDA","text":"We've always had an instructor before, showin' us the way. Not surprisin' we'd stumble a bit tryin' to come up with stuff on our own."},{"name":"JOYE","text":"I just...I suppose I thought we'd have made more progress by now. Are you sure we shouldn't ask his lordship for a little advice?"},{"name":"HILDA","text":"That'd defeat the purpose then, wouldn't it? If we're to stand on our own two feet, then we need to work this out ourselves."},{"name":"JOYE","text":"...Aye, you've the right of it. We just keep shootin', then, and hope we find our target. Let's move on!"},{"name":"HILDA","text":"...I keep meanin' to ask, but <span class=\"emphasis\">how in the bloody hells do you do that</span>? Do you flick off the hairbands when you draw the weapon, or...?"},{"name":"JOYE","text":"No time for questions, Hilda! Your breath'd be better spent searchin' for new things to shoot!"},{"name":"STEPHANIVIEN","text":"'Twas I who dreamed up the machinists, and Rostnsthal who helped bring the idea into being. The machine we put together, well that was driven forward by the likes of you and Joye and Hilda."},{"name":"STEPHANIVIEN","text":"Then as naturally as if I had planned it, you and those two ladies took charge of my designs..."},{"name":"STEPHANIVIEN","text":"Heh, 'tis a strange feeling. How wildly the needle flicks 'twixt a mentor's pride and an inventor's longing."},{"name":"STEPHANIVIEN","text":"'Twould seem, however, that our comrades are experiencing some difficulties with the particulars of developing new techniques. A problem to which we might offer a solution!"},{"name":"STEPHANIVIEN","text":"But in light of their efforts to achieve independence, to simply begin bellowing directions seems...boorish. Have you any ideas on how to proceed?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We give their imaginations a nudge."},{"name":"A1","text":"We show them a different way."},{"name":"STEPHANIVIEN","text":"A little creative push, you think? That could certainly help break them out of the slump they find themselves in... But how exactly to provide that inspiration?"},{"name":"STEPHANIVIEN","text":"Give them an example of what is possible? A fine proposal. But what exactly shall we put on display?"},{"name":"STEPHANIVIEN","text":"But of course! The answer stands right there in front of me! You stand at the peak of the profession─the living embodiment of all it means to be a machinist!"},{"name":"STEPHANIVIEN","text":"All we need do is have you demonstrate the techniques you have acquired and refined over the course of your illustrious career. What could possibly be more inspiring!?"},{"name":"STEPHANIVIEN","text":"I shall head out now and herd a suitably monstrous opponent back for you to dispatch."},{"name":"STEPHANIVIEN","text":"The sound of shots ringing out should bring the ladies running to investigate─just as theirs alerted us to their location."},{"name":"STEPHANIVIEN","text":"Right, then. We can reconvene at this spot once our little show is concluded."},{"name":"STEPHANIVIEN","text":"Is aught amiss? Pray take up a position in Riversmeet that we might conduct an inspirational performance for Joye and Hilda."},{"name":"STEPHANIVIEN","text":"A masterful display! Let us reconvene back at the bridge, shall we? I'd rather not tip our hand by discussing matters here..."},{"name":"STEPHANIVIEN","text":"Nicely done, <span class=\"highlight\">Forename</span>. I am truly in awe of what you can accomplish with my contraptions! Tell me, where did you learn such control and power!?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I journeyed through a land without night..."},{"name":"A2","text":"I fought to save a distant star..."},{"name":"STEPHANIVIEN","text":"...I fear the magnitude of such a journey falls beyond the scope of my prospectometer, but the results of your experience speak for themselves."},{"name":"STEPHANIVIEN","text":"And assuming they were watching, our two machinist comrades will have certainly gleaned a lesson or two from your expert demonstration."},{"name":"STEPHANIVIEN","text":"Yes, I believe our work here is done. We return to Ishgard!"},{"name":"HILDA","text":"We need to have a word, <span class=\"highlight\">Forename</span>. But not here. I'll catch up with you later, don't you worry."},{"name":"STEPHANIVIEN","text":"My thanks, <span class=\"highlight\">Forename</span>─I'd have been at a complete loss in this matter were it not for your invaluable assistance!"},{"name":"STEPHANIVIEN","text":"And I imagine I am not the only one singing your praises this day."},{"name":"STEPHANIVIEN","text":"Speaking of which..."},{"name":"HILDA","text":"Look at you two─thick as thieves, you are. Seems we was right."},{"name":"STEPHANIVIEN","text":"Rather a brusque greeting...even for you, dear Hilda! Something on your minds?"},{"name":"JOYE","text":"Well, it was awfully convenient for <span class=\"highlight\">Forename</span> to put on a grand show of skill just as we was scratchin' our noggins over new techniques. And I'll wager it was me lordship what had <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> pullin' the trigger."},{"name":"STEPHANIVIEN","text":"How did you─!"},{"name":"HILDA","text":"What, did you think you was bein' sneaky? The notoriously helpful champion of Ishgard poppin' up right where and when we needed <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>? Unlikely."},{"name":"JOYE","text":"It's not that we're ungrateful, you see, we just... We was already tryin' so hard to follow in your wake."},{"name":"HILDA","text":"Aye, it was like bein' lost at sea and findin' an island that's not on the map. A bit perplexin', but welcome all the same."},{"name":"JOYE","text":"I guess what we're sayin' is that you've given us our bearings...and a firm footing to start chartin' our own course."},{"name":"STEPHANIVIEN","text":"...And there you have it. Further proof that my prospectometer was in fine working order when it first chirped in your presence."},{"name":"HILDA","text":"Right, well we've said our piece─it's time we got back to squeezin' them triggers."},{"name":"JOYE","text":"Keep an eye out, me lordship! Soon enough we'll be the ones showin' <span class=\"emphasis\">you</span> what a machinist can do!"},{"name":"STEPHANIVIEN","text":"...Was my subterfuge truly so transparent? Ah, but how swiftly my charges have grown, and how easily did it slip my notice. So unlike the deliberate evolution of my inventions..."},{"name":"STEPHANIVIEN","text":"But let us not forget <span class=\"emphasis\">your</span> astounding development! I daresay no barrage of shots has ever proven so instructional."},{"name":"STEPHANIVIEN","text":"Thank you again, <span class=\"highlight\">Forename</span>. And do feel free to drop by the manufactory from time to time─even when we're not threatened by some peace-shattering crisis!"}],"reward":{"gil":1693,"items":[{"id":25187},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":96}],"questsType":"all","quests":[68445,68814]}},"partials":[{"type":"npc","id":"1014577","obj":{"i":1014577,"n":"Stephanivien","l":2300,"q":21}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68445","obj":{"i":68445,"n":"The Mongrel and the Knight","g":158,"l":"Ishgard","s":700,"f":1}},{"type":"quest","id":"68814","obj":{"i":68814,"n":"Courage Born of Fear","g":181,"l":"Kholusia","s":351,"f":1}}]}