{"quest":{"name":"Gunblades of the Patriots","location":"Mor Dhona","id":68761,"patch":5.0,"sort":800,"icon":100888,"eventIcon":71221,"issuer":1029122,"target":1029122,"genre":162,"journal":["Radovan and Sophie are settling in to Revenant's Toll, yet still yearn for adventure.","Radovan's search for adventurers to train as gunbreakers continues, with only a handful having displayed the aptitude necessary to master its techniques. Sophie is keen to hear tales of your travels, and you tell them of a certain friend of yours who has also taken up the gunblade. The revelation leaves Radovan stunned, as only a survivor of the destruction of Bozja could possibly have passed on knowledge of the esoteric weapon. This jogs Sophie's memory of a conversation with an adventurer who claims to have seen a Hrothgar carrying a gunblade in Gridania's Carline Canopy. In the hope that this is the mysterious Bozjan gunbreaker of whom Sophie spoke, Radovan immediately embarks on a search for his compatriot.","Mother Miounne confirms the veracity of Sophie's information, and adds that the man you describe was in fact looking for Radovan. The wandering Hrothgar sought out your former clients Lassenchou and Editha to quiz them as to Radovan's whereabouts. As luck would have it, the harpsichordist and her manager appear with impeccable timing and confirm that not only were they approached by the gunbreaker, but they had also told him about your group moving on to Ul'dah. As it appears his modus operandi is to seek information at the Adventurers' Guild, Sophie suggests going straight to your previous client's husband, Gerrart, in the hope of arriving before your mysterious pursuer.","Gerrart and his son Timm are pleased to see you again, although paying for Oriel's somnus withdrawal treatment has drained their limited finances and they have barely been able to make ends meet. As predicted, they did indeed receive a visit from the roaming Bozjan, who was searching for Radovan. Gerrart had little in the way of detailed information, but the news that Radovan had already left Ul'dah sent the gunbreaker running in the direction of the airship landing, presumably to follow the trail to Limsa Lominsa. For want of a better plan, you make your way to Bulwark Hall to meet your former client Futag Yafutag, and hope you are not too late.","Rather than simply volunteering the information you had traveled all the way to Limsa Lominsa to obtain, Futag Yafutag instead chooses to regale you with the story of Guldweitz's final days. The founder of the Flaming Mongrels testified against a number of wanted Lominsan criminals in a last-ditch attempt to perform an honorable deed for perhaps the first time in his life. He finally succumbed to a terminal disease soon after, passing peacefully in his sleep. Guldweitz had made a lasting impression on Radovan, and though he is unable to forgive the pirate's countless acts of villainy, he nonetheless admires the determination to sacrifice oneself for the sake of others. Futag Yafutag cuts Radovan's ruminations short by sharing the news that the enigmatic Bozjan you seek has most likely departed for Ishgard.","The roaming gunbreaker has made contact with your one-time client Reese, who let slip the name “Cato Mammula” when discussing Radovan's activities in Ishgard. As the Garlean defector is partly to blame for the annihilation of Bozja, Radovan fears his compatriot may exact his revenge. Reese points you in the direction of Providence Point, where Mammula is making scientific observations of Camp Dragonhead.","You reach Providence Point to find that the gunbreaker has already sniffed out Mammula's location, and Radovan springs forward to prevent what he believes to be an attempt on the professor's life. Rostik, the man you have chased across Eorzea, expresses that he has no wish to harm Mammula, and calmly explains that he instead seeks assistance in his plan to rebuild Bozja and provide a home for other survivors of their clan. He even asks for Radovan's support in making this dream a reality. Your mentor, however, has already made a new life for himself, and wishes to remain in Eorzea with Sophie. Rostik accepts this decision, and leaves in search of other Bozjans to join his cause, while you and your comrades make the return journey to Revenant's Toll.","Now that your circuit of Eorzea has brought you full circle, Radovan speaks of his relief in discovering that he is not the last of his people, and that a burden has been lifted from his shoulders. While he still wishes to train a new generation of gunbreakers, he feels that his time would be better spent returning to his former occupation as a bodyguard. By traveling far and wide, he hopes to demonstrate the prowess of a gunbreaker, acting as an ambassador of sorts to his people. Sophie, latching onto the idea, hopes to do the same for the culture of the fallen city of Rabanastre, from which she hails. Although you will be parting ways, Radovan reaffirms his commitment to further mastery of the gunblade, though he admits that when next you meet, it might be your turn to teach him."],"objectives":["Speak with Mother Miounne in the Carline Canopy.","Speak with Gerrart in Ul'dah.","Speak with Futag Yafutag in Limsa Lominsa.","Speak with Reese in Ishgard.","Speak with Radovan at Providence Point.","Speak with Radovan in Revenant's Toll."],"dialogue":[{"name":"RADOVAN","text":"Ah, <span class=\"highlight\">Forename</span>. It's good to see you again. Since we last met, I've been introduced to a fair few adventurers who hope to learn the art of the gunbreaker. Though having taught you, my expectations are perhaps a little too high."},{"name":"SOPHIE","text":"Radovan's been so preoccupied, he's hardly taken on any other jobs, leaving me with plenty of time on my hands. Those women who work for Rowena have had me running about after bookstones. Or was it stonetomes? I forget which. Anyway, what have you been up to?"},{"name":"Q1","text":"What will you talk about?"},{"name":"A1","text":"The friend who became a gunbreaker."},{"name":"A1","text":"The man who protects his loved ones with a gunblade."},{"name":"RADOVAN","text":"How can that be!?"},{"name":"RADOVAN","text":"Learned it while in imperial territory, eh? But that doesn't change the fact that I'm the only gunbreaker to have escaped the destruction of Bozja Citadel. And if I didn't train him, who did?"},{"name":"RADOVAN","text":"That's it! One of the others must still be out there!"},{"name":"SOPHIE","text":"Now that you mention it, an adventurer from Gridania told me they saw a man in the Carline Canopy carrying a weapon a lot like your gunblade. A Hrothgar, too."},{"name":"SOPHIE","text":"I thought they were talking about you, so I didn't pay much attention. But you haven't been back there since we moved to Revenant's Toll... I wonder who it could be?"},{"name":"RADOVAN","text":"Sophie! Why didn't you say something sooner!? If it truly is one of my fellow gunbreakers, I have to find them!"},{"name":"SOPHIE","text":"We should probably go with him. Even if there is another gunblade-wielding Hrothgar, it doesn't necessarily mean they'll be pleased to see Radovan. Perhaps Mother Miounne knows something about it?"},{"name":"MIOUNNE","text":"Why yes, a man like the one you describe was here but a few days ago."},{"name":"RADOVAN","text":"And you're sure he had a gunblade like mine?"},{"name":"MIOUNNE","text":"Identical, I would say. But more importantly, he was looking for you, Radovan!"},{"name":"MIOUNNE","text":"As I was in the midst of explaining the assignment I gave you, he suddenly ran off in search of your former client. He was gone before I had a chance to ask his name."},{"name":"RADOVAN","text":"Who could he be? And what does he want?"},{"name":"EDITHA","text":"(-Familiar Voice-)Oh, look! It's my favorite bodyguards!"},{"name":"SOPHIE","text":"Oh... Er, what a surprise! I was hoping we'd never─I mean, I <span class=\"emphasis\">thought</span> we'd never see you again!"},{"name":"LASSENCHOU","text":"Since last we met, my sweet marigold has returned to thrilling audiences with her uplifting performances. As a matter of fact, we have come here to drink to her continued success!"},{"name":"MIOUNNE","text":"Then your timing and choice of venue are impeccable, for we have need of your help. Do you by any chance remember a Hrothgar man who was looking for Radovan? He may have asked you about the assignment to guard Editha."},{"name":"LASSENCHOU","text":"Yes, I know of whom you speak! We had heard that Radovan was last seen making a beeline for Ul'dah, and we told him as much."},{"name":"RADOVAN","text":"Hmm... He won't stay for long when he realizes I'm no longer there. I'd best find him before he moves on."},{"name":"SOPHIE","text":"If he follows a similar line of questioning, it'll lead him to our former client. Since Oriel is most likely still undergoing treatment, he'll probably end up talking to Gerrart instead."},{"name":"EDITHA","text":"I must say, he was a rather fearsome-looking chap. Not the sort of person you want chasing you. Make sure he doesn't kill you or anything!"},{"name":"MIOUNNE","text":"I do hope you find this countryman of Radovan's, or that he finds you. Either way, I wish you good luck!"},{"name":"RADOVAN","text":"Do you think we got here in time?"},{"name":"SOPHIE","text":"At least their son seems well enough, all things considered."},{"name":"ORIELSBOY","text":"Do you want to play a game? Daddy says he's too tired."},{"name":"GERRART","text":"Thanks to you, Timm and I have been living together for a little while now. Most of the money I earn goes to Frondale's Phrontistery for Oriel's care, though thankfully we still have enough to keep a roof over our heads."},{"name":"GERRART","text":"Slowly but surely, she's improving, though she still can't forgive herself for what she put Timm through. Not sure I can, either, but we're all she's got."},{"name":"ORIELSBOY","text":"Daddy says Mummy was very sick before. But she's getting better."},{"name":"RADOVAN","text":"Hmm... Happiness comes easily to some people, while others have to fight for it. I hope you find the strength to support each other in the days to come."},{"name":"GERRART","text":"Thank you, sir. Oh, I almost forgot to mention, but a man was asking about you. A Hrothgar bloke. Similar sword, too. After I told him you'd left Ul'dah, he headed off in the direction of the airship landing."},{"name":"SOPHIE","text":"Not again! He's probably already in Limsa Lominsa looking for you."},{"name":"RADOVAN","text":"Then let's go straight to Futag Yafutag and pray we're not too late!"},{"name":"GERRART","text":"He's looking forward to us being a family again, in spite of everything."},{"name":"ORIELSBOY","text":"Are you going to ride an airship?"},{"name":"RADOVAN","text":"I have a feeling he's still a step or two ahead of us."},{"name":"SOPHIE","text":"Come to think of it, I wonder what happened to Guldweitz."},{"name":"FUTAGYAFUTAG","text":"This is the first time I've seen the three of you since that business with Guldweitz, yes? As planned, his testimony led to the convictions of several high-profile criminals."},{"name":"FUTAGYAFUTAG","text":"Then, a few days later, he died peacefully in his sleep."},{"name":"RADOVAN","text":"I see... Even though he knew he was beyond forgiveness, his final deed has made Limsa Lominsa a safer place. If only he'd seen the error of his ways sooner."},{"name":"FUTAGYAFUTAG","text":"There was one other thing. A fellow an awful lot like yourself came through not long ago, and he was looking for you, Radovan. I told him that you'd moved on, and that he should try his luck around the airship landing."},{"name":"RADOVAN","text":"Then he must've gone to Ishgard."},{"name":"SOPHIE","text":"And he'll eventually find his way to Reese, who'll hopefully keep him busy until we arrive. Come on, we'd best get going."},{"name":"FUTAGYAFUTAG","text":"I could've sworn that when they carried Guldweitz's body away, he had a smile on his face."},{"name":"RESSE","text":"Ah, there you are. We were just discussing that gunbreaker fellow you're chasing after. He was here looking for you, but I'm afraid you've missed him."},{"name":"RADOVAN","text":"I might've guessed. Back to Revenant's Toll it is, then."},{"name":"RESSE","text":"Hold on! When I mentioned Master Mammula, that Hrothgar fellow seemed rather taken aback, and then asked where he could find him. I didn't see any reason not to tell him, so─"},{"name":"RADOVAN","text":"You bloody fool!"},{"name":"RADOVAN","text":"If a Bozjan survivor is looking for him, his life could be in danger!"},{"name":"RESSE","text":"By the Fury! What have I done!?"},{"name":"SOPHIE","text":"Where is Mammula!?"},{"name":"RESSE","text":"He went to inspect the exterior walls of Camp Dragonhead, so he's probably at Providence Point!"},{"name":"RESSE","text":"If anything happens to Mammula... Oh gods, I'm so sorry!"},{"name":"SOPHIE","text":"Where could he be?"},{"name":"RADOVAN","text":"Voices, up ahead! With me, <span class=\"highlight\">Forename</span>!"},{"name":"RADOVAN","text":"Stop!"},{"name":"ROSTIK","text":"(-Unfamiliar Gunbreaker-)Radovan? I've been looking everywhere for you!"},{"name":"RADOVAN","text":"Get away from him, Rostik!"},{"name":"CATONANMAMMULA","text":"Please, calm yourself, Radovan. He means me no harm."},{"name":"ROSTIK","text":"Like you, I have chosen to put the past behind me."},{"name":"ROSTIK","text":"In fact, I came here to ask for Mammula's aid in rebuilding Bozja Citadel."},{"name":"RADOVAN","text":"But that's..."},{"name":"ROSTIK","text":"Impossible? Far from it. You see, we were not the only ones to escape the destruction of our home. Those who were away on missions or visiting other settlements were spared."},{"name":"RADOVAN","text":"Then there's a chance that─"},{"name":"ROSTIK","text":"Listen, Radovan. Your family is gone, lost in the blast. The monarchy, too. And yet, our clan lives on."},{"name":"ROSTIK","text":"I will seek out survivors, so that we may build a home together. And if we cannot return to where Bozja once stood, we shall find a new land to call our own."},{"name":"CATONANMAMMULA","text":"Nothing will ever right the wrongs I have committed. Even so, I shall do everything in my power to make Rostik's dream a reality."},{"name":"ROSTIK","text":"Radovan, will you join us?"},{"name":"RADOVAN","text":"I am sorry, Rostik. I have already lost one family, and I do not wish to lose another. Though we are not joined by blood and are as different as night and day, we have each other."},{"name":"RADOVAN","text":"And that is not all. I have passed on the ways of the gunbreaker to <span class=\"highlight\">Forename</span>. The first of many, I hope."},{"name":"ROSTIK","text":"I, too, taught someone from outside of our clan how to wield the gunblade."},{"name":"ROSTIK","text":"You have much in common with him, Radovan. He too has someone that he wants to keep by his side, like family."},{"name":"ROSTIK","text":"If you meet any other Bozjans, tell them that I would welcome their help."},{"name":"ROSTIK","text":"Perhaps one day our paths will cross again. Look after each other."},{"name":"RADOVAN","text":"Thank you, Rostik. Fare thee well."},{"name":"SOPHIE","text":"So much for being a gunblade-wielding murderer. He seemed quite nice, actually."},{"name":"RADOVAN","text":"Yes, I'm glad to have been proven wrong on this occasion. Rostik is still as honorable and as wise as I remember him."},{"name":"CATONANMAMMULA","text":"Nonetheless, I appreciate your coming to my aid. And I must admit, I feared the worst when he appeared out of nowhere, though he soon made his intentions clear. I never expected such kindness from not one, but two men who have every reason to want me dead."},{"name":"CATONANMAMMULA","text":"I am grateful to you both for allowing me to work for the greater good. Speaking of which, I must fulfill my obligations to the Ishgardians. Until we meet again."},{"name":"SOPHIE","text":"Now that's over, we should return to Revenant's Toll and try to earn back the money we spent on airship tickets!"},{"name":"SOPHIE","text":"Back at last. You know, this place is beginning to feel like home!"},{"name":"RADOVAN","text":"All this time, I thought I was the only Bozjan left. Now that I know that Rostik and several others are still out there, perhaps I don't need to rush my search for new gunbreakers."},{"name":"RADOVAN","text":"In fact, I think I would be better off working as a bodyguard again, and show people throughout Eorzea what we Bozjans are capable of."},{"name":"SOPHIE","text":"Seeing is believing, after all. Maybe I could do the same for Dalmasca?"},{"name":"SOPHIE","text":"Oh, did I not tell you? I'm originally from Rabanastre, the capital."},{"name":"SOPHIE","text":"The city itself was destroyed─deliberately, I might add─by the Garleans after the failed rebellion, but our traditions live on. And I think I'd make quite a good ambassador for my people!"},{"name":"RADOVAN","text":"If everything goes according to plan, we'll be traveling to the far corners of the realm and meeting all sorts of people, though we'll still use Revenant's Toll as a place to hang our hats, as I believe the saying goes."},{"name":"RADOVAN","text":"Of course, with as gifted a successor as you, I'll have to keep training so I won't be outdone. Or maybe you'll be the one teaching me next time!"}],"reward":{"gil":3335,"items":[{"id":25190},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":149}],"questsType":"all","quests":[68802,68784]}},"partials":[{"type":"npc","id":"1029122","obj":{"i":1029122,"n":"Radovan","l":67,"q":2}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68802","obj":{"i":68802,"n":"Steel against Steel","g":162,"l":"Ishgard","s":141,"f":1}},{"type":"quest","id":"68784","obj":{"i":68784,"n":"To Have Loved and Lost","g":179,"l":"Il Mheg","s":151,"f":1}}]}