{"quest":{"name":"Friends of a Feather","location":"The Crystarium","id":68769,"patch":5.0,"sort":310,"icon":100847,"unlocksFunction":1,"eventIcon":71341,"issuer":1027235,"target":1027235,"genre":169,"journal":["Bethric has caught the scent of something fragrant coming from your general direction.","Through his unusually keen sense of smell, Bethric deduces that you are an artisan. Veterinarian and overseer of the Facet of Nourishing, you find him readying to visit one of his patients─a sickly amaro near the Amaro Launch. He invites you to follow and see his work firsthand.","Bethric's patient is on a swift road to recovery. As he explains it, this particular amaro is by far the most kind-hearted of those he has treated and enjoys to be pet. In fact, he insists that you indulge the amaro's desire for affection and see for yourself.","The injured amaro's mild reaction to your petting leaves Bethric in awe. He is all but convinced of your talent for caregiving, leading to a rather unsettling proclamation of his love for amaro. Before he can expound further on his passion, however, a member of the city guard appears with urgent news: a wild amaro has been brought in, and they fear it has been poisoned. Bethric makes for Temenos Rookery without a second thought.","You follow Bethric to the rookery to find an amaro badly injured and struggling to breathe. According to the city guard, it was attacked by poachers who intended to cut out its tongue. Though spared an untimely demise, Bethric confirms that it was indeed poisoned. If the amaro is to be saved, there is no time to waste, and Bethric would call upon your talents as an artisan to see the task done. To that end, he bids you return with him to the Crystalline Mean. ","Although Bethric has identified the poison that must be counteracted, his examination of the amaro has given him cause for concern. He has been charged with treating not a common grey-tailed amaro, but a Berube skipper, thought to be extinct since the Flood. Such a rare breed of amaro warrants the utmost caution, which is why Bethric entrusts you with fashioning the antidote."],"objectives":["Speak with Bethric.","/pet the injured amaro.","Speak with Bethric."],"dialogue":[{"name":"SYSTEM","text":"Upon completing this quest, you will be able to undertake Crystarium Deliveries for the Facet of Nourishing. You must be a culinarian or alchemist of level 70 or above to proceed."},{"name":"BETHRIC","text":"Hm? &lt;sniff&gt; &lt;sniff&gt; What a pleasant aroma."},{"name":"BETHRIC","text":"Ah, pray forgive me. I couldn't help but notice the fragrance of medicinal herbs about you. Are you by chance an alchemist?"},{"name":"BETHRIC","text":"Ah, pray forgive me. I couldn't help but notice the fragrance of herbs and spices about you. Are you by chance a culinarian?"},{"name":"BETHRIC","text":"So you're the guest I've heard so much about. I had no idea you were an artisan. No doubt of the highest order to keep company with the Crystal Exarch. This is such an honor."},{"name":"BETHRIC","text":"Goodness me, where are my manners? My name is Bethric, resident veterinarian and overseer of the Facet of Nourishing."},{"name":"BETHRIC","text":"Now I know what you're thinking: “There's no way this grisly monster of a man is fit to handle animals.” But you'd be wrong. In fact, my scars only came about from handling the amaro. Don't let their docile appearance fool you─they can be quite feisty."},{"name":"BETHRIC","text":"Speaking of which, I have a patient due for an examination."},{"name":"BETHRIC","text":"Would you care to join me?"},{"name":"BETHRIC","text":"I won't twist your arm on the matter, but if you've a mind to humor me, you can find me over at the Amaro Launch. "},{"name":"BETHRIC","text":"Aha! So curiosity got the better of you, eh?"},{"name":"BETHRIC","text":"The poor girl was hurt transporting cargo, and her sadly misguided owner let her wounds get infected. I insisted she stay here until she's made a full recovery."},{"name":"BETHRIC","text":"Now then, let's have a look at you."},{"name":"BETHRIC","text":"Hmmm. The swelling's down... And so is the inflammation. "},{"name":"BETHRIC","text":"A few more days and you should be fit to fly again."},{"name":"BETHRIC","text":"She's by far the sweetest animal I've had the pleasure of caring for, and she loves to be pet. Why don't you come closer and see for yourself."},{"name":"BETHRIC","text":"Oh, come now! How can you say no to those starry eyes and that come-hither-and-pet-me snout."},{"name":"BETHRIC","text":"Go on. She won't bite."},{"name":"BETHRIC","text":"Go on, now. No need to be shy. "},{"name":"AMALO03233","text":"...Khrrr?"},{"name":"SYSTEM","text":"The injured amaro looks at you longingly. Perhaps petting her as Bethric suggests will soothe her."},{"name":"AMALO03233","text":"Khrrr..."},{"name":"SYSTEM","text":"The injured amaro looks at you dejectedly. Perhaps petting her as Bethric suggests will lift her spirits."},{"name":"BETHRIC","text":"My word! I've never seen her take to a stranger so quickly."},{"name":"BETHRIC","text":"Why, it's as if you've touched her very soul. You've a knack for caretaking."},{"name":"BETHRIC","text":"It calls to mind a gift the amaro were said to possess long ago."},{"name":"BETHRIC","text":"As you've no doubt noticed, the amaro serve as steeds for transport and the delivery of goods much like chocobos. The key difference between them, however, is the amaro were born of magic."},{"name":"BETHRIC","text":"A variety of lizards enchanted by mages in the days of the Ronkan Empire, refined further into what we know as amaro through selective breeding."},{"name":"BETHRIC","text":"These arcane magicks allowed them to sense the souls of their masters, and even speak! Alas, when the empire fell, the techniques used in raising the amaro were lost."},{"name":"BETHRIC","text":"While they no longer possess their preternatural abilities of old, they've retained the ability to fly. Oh, what I wouldn't give to chase the wind and touch the sky..."},{"name":"BETHRIC","text":"TO BE AN AMARO!!!"},{"name":"BETHRIC","text":"There is no finer animal in all of creation! To be reborn as a majestic amaro would be a blessing!"},{"name":"BETHRIC","text":"Ahem. Of course, I can understand if you do not share in my enthusiasm."},{"name":"LYSSANA","text":"(-Drahn Soldier-)There you are! I've been looking all over for you!"},{"name":"BETHRIC","text":"Lyssana, what a pleasant surprise. Finally come for that lecture on amaro taxonomy?"},{"name":"LYSSANA","text":"I've no time for your babble of animal facts. You're needed at the stable. An amaro has been brought in from the fields and it seems to be ill. We fear it may be poison."},{"name":"BETHRIC","text":"Poison!? I'll be there at once."},{"name":"BETHRIC","text":"If the situation is as dire as it seems, I may have need of your assistance. Please say you'll come with me."},{"name":"AMALO03233","text":"Khrrr!"},{"name":"LYSSANA","text":"It sickens me to my stomach every time..."},{"name":"KNEMCHELEIMIN","text":"The poor beast..."},{"name":"SKIP","text":"Khrrr..."},{"name":"BETHRIC","text":"You're here. Good. I've just finished a cursory examination."},{"name":"BETHRIC","text":"Outwardly, he shows no signs of severe injury, but he has indeed been poisoned. Judging by his breathing, it's already caused inflammation of his windpipe. We must hurry and identify the toxin."},{"name":"KNEMCHELEIMIN","text":"Who would do such a thing?"},{"name":"LYSSANA","text":"Poachers. They've been hunting amaro, cutting out their tongues and leaving them to die on our doorstep for some time now. We've increased our patrols of the perimeter, but they've proven more resourceful than we thought."},{"name":"LYSSANA","text":"At least this time, we succeeded in denying them their prize."},{"name":"KNEMCHELEIMIN","text":"And for that we are grateful, but we must act quickly."},{"name":"KNEMCHELEIMIN","text":"Bethric. I leave him in your capable hands."},{"name":"LYSSANA","text":"...Bethric? Is everything all right?"},{"name":"BETHRIC","text":"Hm? Oh, yes, yes of course. Only... The poachers used poison-laced feed bearing a striking resemblance to our stores. This amaro likely believed they were from the Crystarium. He <span class=\"emphasis\">trusted</span> them, and they took advantage of his innocence."},{"name":"BETHRIC","text":"Would that I could make them see the error of their ways, but I fear such wicked hearts are beyond reason. I can but try to undo the damage they've caused."},{"name":"BETHRIC","text":"And to do that, I would ask your assistance. Come, there's no time to waste."},{"name":"KNEMCHELEIMIN","text":"That poor amaro... Please, do what you can for him."},{"name":"SKIP","text":"Khrrr..."},{"name":"BETHRIC","text":"Thank you for coming."},{"name":"BETHRIC","text":"I've identified the poachers' poison."},{"name":"BETHRIC","text":"However, producing an antidote will prove to be a much more delicate process than I was expecting."},{"name":"BETHRIC","text":"You see, this amaro is of a different breed than those I'm accustomed to caring for. All those you've seen here in the Crystarium are grey tails."},{"name":"BETHRIC","text":"Our patient, however, is a Berube skipper, from a region long since lost to the Flood. Under normal circumstances I would be beside myself with excitement─he may very well be the last of his kind."},{"name":"BETHRIC","text":"Meaning there can be no room for error in the preparation of an antidote."},{"name":"BETHRIC","text":"This task calls for an artisan of surpassing skill. One who understands the heart of these blessed creatures."},{"name":"BETHRIC","text":"<span class=\"highlight\">Forename</span>. I believe this is why fate guided your steps to me."},{"name":"BETHRIC","text":"I beg of you: help me save this amaro!"},{"name":"BETHRIC","text":"I knew I could count on you."},{"name":"BETHRIC","text":"Based on his blood work and my knowledge of grey tail physiology, I've put together a list of ingredients that should produce a rather potent antidote. The rest falls to you."},{"name":"SYSTEM","text":"Facet of Nourishing Deliveries are now available. By delivering the requested items to Bethric and raising yourself in his esteem, you can advance the story of his quest to save the amaro."}],"reward":{"gil":825},"reqs":{"jobs":[{"lvl":70,"id":153}],"quests":[69191]},"next":[68770]},"partials":[{"type":"npc","id":"1027235","obj":{"i":1027235,"n":"Bethric","l":2951,"q":3}},{"type":"quest","id":"69191","obj":{"i":69191,"n":"The Crystalline Mean","g":172,"l":"The Crystarium","s":10,"f":1}},{"type":"quest","id":"68770","obj":{"i":68770,"n":"Where We Belong","g":169,"l":"The Crystarium","s":320}}]}