{"quest":{"name":"Iola, Forgemaster","location":"The Crystarium","id":68763,"patch":5.0,"sort":110,"icon":100845,"unlocksFunction":1,"eventIcon":71341,"issuer":1027233,"target":1027233,"genre":167,"journal":["Iola seems perturbed by a crafting conundrum.","Iola, an artisan in the Crystalline Mean, is also the owner of a private forge known as the Iron Bellows. Once a thriving collective of talented craftsmen, the business has long since fallen on hard times. Hoping to reverse her fortunes, Iola has struck upon the idea of developing new wares which appeal to the local Zun, and has asked for your aid in this creative endeavor. First things first, however, she would consult with an amaro tamer in an effort to learn more about her potential customers.","Your discussion with the amaro tamer has revealed a concern about the nasty bites inflicted by their more irritable charges. Armed with this knowledge, Iola returns to the Crystalline Mean to consider what items might best benefit the Zun in their daily lives.","Following an encounter with two former Bellows employees, Iola explains how one of the main goals of her endeavor is convincing the artisans to return to work at her forge. She also dreams of reclaiming the ring her father was forced to give up when he failed to pay his debt of borrowed coin, and despite her attempts to focus on practical concerns, it is painfully obvious how much the keepsake means to her. Your crafting expertise may be the key to breaking into the Zun market, and bringing Iola the success her plans require."],"objectives":["Speak with the amaro tamer.","Speak with Iola."],"dialogue":[{"name":"SYSTEM","text":"Upon completing this quest, you will be able to undertake Crystarium Deliveries for the Facet of Forging. You must be a blacksmith, armorer, or goldsmith of level 70 or above to proceed."},{"name":"IOLA","text":"Well, yes, it's not <span class=\"emphasis\">bad</span> exactly... Hm, how can I put this? It's just lacking a certain “originality.”"},{"name":"EISMON","text":"...I'm not sure I understand."},{"name":"IOLA","text":"Our goal here is to attract a new customer base with innovative and eye-catching craftsmanship, and we won't succeed by retreading the same tired ground as─ Oh, who have we here?"},{"name":"IOLA","text":"A stranger to our fair city, and an artisan, too, if I'm not mistaken?"},{"name":"IOLA","text":"The name's Iola. I'm affiliated with the Facet of Forging, but I also run a private forge─the “Iron Bellows,” it's called."},{"name":"IOLA","text":"There was a time when we boasted a gathering of the finest metalworkers in the trade...and then business in the Crystarium started going downhill. Many were forced to hang up their hammers even before my dear father─the Warrior rest his soul─passed the Bellows on to me."},{"name":"IOLA","text":"And now, Eismon's the only employee I have left. Solid, dependable old Eismon."},{"name":"EISMON","text":"Th-That's me..."},{"name":"IOLA","text":"As for clients, we have few commissions outside our contract with the city guard, and <span class=\"emphasis\">that</span> income barely covers our day-to-day expenses. I'll be forced to close down the forge before long if I don't try something drastic..."},{"name":"IOLA","text":"So I've been working on a plan! We'll broaden our horizons─and our potential market─with a range of new and novel wares!"},{"name":"IOLA","text":"A fine idea, you might think, but we've hit something of a snag. Whilst Eismon can reproduce our usual stock with uncanny accuracy, it would seem his singular talent doesn't lend itself to creative endeavors..."},{"name":"EISMON","text":"I have to follow the design. I can't help it..."},{"name":"IOLA","text":"But that's enough of my rambling. Where did you say you were from?"},{"name":"IOLA","text":"...The same place as the Exarch? Interesting. Wait, no, not interesting..."},{"name":"IOLA","text":"This is <span class=\"emphasis\">marvelous</span>! Don't you see? You must have knowledge of a dozen techniques that we've never even heard of!"},{"name":"IOLA","text":"Please! Help us develop our new wares, and I'll gladly pay you! It will have to be in crafters' scrips, but still...what do you say?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll do it."},{"name":"A1","text":"I don't think so..."},{"name":"IOLA","text":"We're saved!"},{"name":"IOLA","text":"Surely you won't turn your face away from a forge in need!? I'm begging you!"},{"name":"IOLA","text":"Yes! We're saved!"},{"name":"IOLA","text":"...Phew. Now, before you do anything, we need to go and parley with the Zun."},{"name":"IOLA","text":"You...have no idea what I'm talking about. Upright lizard people? There's a tribe of them living here in the city."},{"name":"IOLA","text":"We've not had much trade with the Zun thus far, but I aim to change all that. Assuming we can devise a product which catches their interest, we'll be dipping into a well of untapped profit!"},{"name":"IOLA","text":"Come on! Let's head over to the Amaro Launch and learn a few things about our prospective customers. It's time to get the Iron Bellows back on track!"},{"name":"EISMON","text":"Good luck..."},{"name":"ZUNBREEDER03227","text":"What do you want with me?"},{"name":"IOLA","text":"This may seem like an odd request, but I was hoping you might help me gain a better understanding of your people. I'm working to expand my range of goods, you see, and any insight you can offer would be appreciated..."},{"name":"ZUNBREEDER03227","text":"You are one of the Crystarium's artisans? Then I would not deny a sincere desire to learn."},{"name":"ZUNBREEDER03227","text":"We of the Zun earn a living as amaro breeders, and clothe ourselves with their hide and bone. Such has been our tradition since we roamed the land as nomads."},{"name":"IOLA","text":"Is it difficult to raise such large animals?"},{"name":"ZUNBREEDER03227","text":"There are risks. When the females are with young, they become temperamental, and have been known to bite their handlers."},{"name":"IOLA","text":"Ouch. I imagine those jaws would inflict some nasty injuries."},{"name":"ZUNBREEDER03227","text":"Yes. The wounds often lead to fever, illness, and even death. Any item you could craft that would help prevent such tragedies would find no few interested parties."},{"name":"IOLA","text":"Leave it to me! The Iron Bellows will strive to provide you with everything you need."},{"name":"IOLA","text":"Let's head back to the Mean."},{"name":"IOLA","text":"If we're going to make something that appeals to the Zun, we should talk to one of their amaro tamers."},{"name":"EISMON","text":"Good luck..."},{"name":"IOLA","text":"What do you think? Did our chat with the Zun give you any ideas?"},{"name":"IOLA","text":"Well, well. To what do I owe the pleasure?"},{"name":"COLANA","text":"We've just come to collect our old tools, then we'll be on our way."},{"name":"SUEREND","text":"The Facet of Forging has plenty of jobs for enterprising individuals, and I'd rather work than starve. No offense."},{"name":"IOLA","text":"None taken..."},{"name":"IOLA","text":"Those two are Colana and Sue-Rend─former employees of the Bellows, if you hadn't guessed that already. They used to look out for me like I was their little sister..."},{"name":"IOLA","text":"But when the business fell on hard times, they struck out on their own. I can hardly blame them─they have families to feed, and the Facet of Forging has paying contracts..."},{"name":"IOLA","text":"Which is why this new endeavor is so important! If it succeeds, then mayhap I can convince them both to come back to the Bellows!"},{"name":"IOLA","text":"And maybe, just maybe...I can buy back the ring we lost to pay back our borrowed coin. Or am I being too greedy now?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"What's this about a ring?"},{"name":"A2","text":"You borrowed money?"},{"name":"IOLA","text":"When our business started to falter, my father made an arrangement with a moneylender known as Walden. It was a poor gamble at best."},{"name":"IOLA","text":"Things went from bad to worse, and when we failed to meet the payments on time, Walden demanded something of value from us. My father surrendered the gift he had made for my mother─a ring she never had the chance to wear before she passed away."},{"name":"IOLA","text":"That ring is all I have left to remember them by, and I would dearly love to have it back..."},{"name":"IOLA","text":"But I can't afford to worry about some keepsake. I need to focus on rebuilding the forge's finances, and regaining our lost employees."},{"name":"IOLA","text":"Right. Let's throw out some ideas! What manner of item could benefit the Zun in their daily lives?"},{"name":"IOLA","text":"...Nothing comes to mind, then? Oh, but didn't you say you hailed from the Exarch's homeland?"},{"name":"IOLA","text":"Do you have tribes like the Zun where you're from? That might give you a starting point to consider..."},{"name":"SYSTEM","text":"The Zun are strikingly similar to the Amalj'aa in appearance. Perhaps the beastmen from the Source wear something that could prove equally useful to their Crystarium counterparts..."},{"name":"Q3","text":"What manner of item could the Zun find useful?"},{"name":"A3","text":"Metal gauntlets."},{"name":"A3","text":"Metal amaro sculptures."},{"name":"IOLA","text":"Metal...sculptures? How would that help them? Where would they even keep such cumbersome creations!?"},{"name":"IOLA","text":"Ah, well I suppose that might reduce the danger of amaro biting the fingers which feed them. It seems too simple..."},{"name":"IOLA","text":"...And yet, we'd still be the first forge to stock gauntlets crafted expressly for Zun hands. Let's see what you can put together!"},{"name":"SYSTEM","text":"Facet of Forging Deliveries are now available. By delivering the requested items to Iola and raising yourself in her esteem, you can advance the story of her struggling forge."},{"name":"EISMON","text":"Welcome back..."},{"name":"ZUNBREEDER03227","text":"Rearing amaro is not without its dangers─to be bitten is to risk fever, illness, and possibly even death. Any customized equipment you can craft to help prevent such injuries would be highly sought after."}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":151}],"quests":[69191]},"next":[68764]},"partials":[{"type":"npc","id":"1027233","obj":{"i":1027233,"n":"Iola","l":2951,"q":3}},{"type":"quest","id":"69191","obj":{"i":69191,"n":"The Crystalline Mean","g":172,"l":"The Crystarium","s":10,"f":1}},{"type":"quest","id":"68764","obj":{"i":68764,"n":"To Struggle Nu Mou","g":167,"l":"The Crystarium","s":120}}]}