{"quest":{"name":"Cherished Memories","location":"The Crystarium","id":68766,"patch":5.0,"sort":210,"icon":100846,"unlocksFunction":1,"eventIcon":71341,"issuer":1028326,"target":1027234,"genre":168,"journal":["The Allagan-esque node appears to be experiencing an error.","At the Crystalline Mean, you come upon an Allagan-esque node behaving erratically. Upon inspection, the machine mutters some curious words before hovering off. You decide to keep an eye on it lest it cause trouble for civilians.","After a brief pursuit, you find the node hassling a civilian who turns out to be its owner. With a well-placed slap, the woman fixes the node, which she affectionately calls Noddy, before introducing herself as Thiuna, a restorer of the Facet of Crafting and proprietor of Cherished Memories. Having explained that her focus is on items of sentimental value, Thiuna proposes a business arrangement. In order to hone her techniques, she asks you to supply the materials she needs, and you are happy to oblige. Thiuna then returns to her workshop at the Crystalline Mean and bids you join her when you are ready to begin.","At her workshop, which is for now simply borrowed space, Thiuna assigns you your first task─preparing the canvas repair material for a damaged painting. When the material is ready, Thiuna will use it to restore the artwork, and in so doing restore a vision of the lost village it depicts."],"objectives":["Search for troubled civilians.","Speak with Thiuna."],"dialogue":[{"name":"SYSTEM","text":"Upon completing this quest, you will be able to undertake Crystarium Deliveries for the Facet of Crafting. You must be a carpenter, leatherworker, or weaver of level 70 or above to proceed."},{"name":"RECORDSYSTEM","text":"&lt;beep&gt; Error. Aether blockage detected."},{"name":"RECORDSYSTEM","text":"Firm blow required. &lt;buzz&gt; Hit me. Hit me."},{"name":"RECORDSYSTEM","text":"Seek Thiuna. Must seek Thiuna. &lt;buzz&gt;"},{"name":"SYSTEM","text":"The Allagan-esque node floats off. Perhaps you should keep an eye on it lest it cause harm to civilians."},{"name":"RECORDSYSTEM","text":"Help me, Thiuna. Help me. &lt;buzz&gt;"},{"name":"THIUNA","text":"Y-Yes! Greetings! Do you require something restored?"},{"name":"THIUNA","text":"...Apparently not."},{"name":"THIUNA","text":"At any rate, could you give me a moment? Noddy here is clamoring for attention..."},{"name":"RECORDSYSTEM","text":"Help me, Thiuna. Firm blow required. Hit me. Hit me."},{"name":"THIUNA","text":"Don't tell me you've gotten your aether blocked again?"},{"name":"THIUNA","text":"&lt;sigh&gt; Very well. I'll take care of it."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You need knowledge of Allagan artifacts to fix it."},{"name":"A2","text":"You need specialized knowledge to fix it."},{"name":"THIUNA","text":"Oh, versed in such machines, are you? Well, I appreciate the advice, but rest assured I have the situation well in hand. This happens all the time."},{"name":"THIUNA","text":"Yah!"},{"name":"RECORDSYSTEM","text":"&lt;beep&gt; Your node has encountered a problem and needs to restart. Collecting error information and restarting."},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; &lt;bloop&gt; Node restart complete. Logging in as Thiuna. &lt;buzzzzzz&gt; More, Thiuna. Hit me more."},{"name":"THIUNA","text":"(-Thiuna-)You know, sometimes I think you actually enjoy this. And I still have no idea where you learned to speak like that..."},{"name":"THIUNA","text":"(-Thiuna-)Now then, you were wanting something?<br>...Hmmm, I don't believe I've seen you before. I take it you're new to the Crystarium?"},{"name":"THIUNA","text":"(-Thiuna-)Ah, I remember now! You're the master artisan who hails from the same land as the Exarch! Er...what was your name again?"},{"name":"THIUNA","text":"(-Thiuna-)Yes, that's right─<span class=\"highlight\">Forename</span>! It's a pleasure to meet a fellow crafter from a faraway place."},{"name":"THIUNA","text":"(-Thiuna-)I'm Thiuna, a restorer of the Facet of Crafting and the proprietor of Cherished Memories. For my work, I've had to train in a variety of trades, including as <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span> like yourself."},{"name":"THIUNA","text":"(-Thiuna-)While there are restorers aside from me, my workshop specializes in artworks and traditional handicrafts. Items with sentimental rather than practical value, in other words."},{"name":"THIUNA","text":"(-Thiuna-)Given the state of the world, my choice of focus is frowned upon by some, but I knew it was what I wanted to do."},{"name":"THIUNA","text":"(-Thiuna-)And so I opened Cherished Memories with Noddy here as my assistant."},{"name":"THIUNA","text":"(-Thiuna-)Adorable, isn't it? It's actually a relic from the tower, but it had broken down. I couldn't bear to see it lying there discarded, so I restored it as best I could. It's been with me ever since."},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; Am I a good node?"},{"name":"THIUNA","text":"(-Thiuna-)Yes, you are! No one keeps records like you, Noddy!"},{"name":"THIUNA","text":"(-Thiuna-)Now, I realize we've scarcely met..."},{"name":"THIUNA","text":"(-Thiuna-)But I'd like to propose a little business arrangement."},{"name":"THIUNA","text":"(-Thiuna-)You see, despite the work that I profess to do, I'm actually only any good at alchemy, my original field. There's still much that I have to learn, and I'm hoping I could learn from an accomplished [Job] such as you."},{"name":"THIUNA","text":"(-Thiuna-)I don't ask that you teach me─only that you craft the materials I need. By using these materials in my work, I can hone my techniques while getting the job done besides. Of course, I'll make sure you're suitably compensated."},{"name":"THIUNA","text":"(-Thiuna-)Moreover, every bit that I learn from you, I promise to pass on to my fellow crafters. That way, your knowledge may come to serve all the peoples of Norvrandt."},{"name":"THIUNA","text":"(-Thiuna-)So, what say you? Can I rely on your help?"},{"name":"RECORDSYSTEM","text":"Thiuna is still a work in progress. Please knock her into shape. Bish. Bash. &lt;buzzzzzz&gt;"},{"name":"THIUNA","text":"(-Thiuna-)I'm in your debt! When you're ready to begin, please come and see me at the Mean."},{"name":"THIUNA","text":"My thanks for coming, <span class=\"highlight\">Forename</span>. May our collaboration bear much fruit!"},{"name":"RECORDSYSTEM","text":"Hear, hear."},{"name":"THIUNA","text":"So, this is Cherished Memories. Well, it is when I'm here, at any rate. I've neither the funds nor reputation to have my own place, so I'm making use of the Mean's facilities."},{"name":"THIUNA","text":"Without further ado, then, let's assign you your first task. Noddy, if you'd be so kind?"},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; The item to be restored is a painting of Dampsole, a village in Lakeland destroyed by sin eaters approximately ninety years ago. The client is descended from the denizens of said village."},{"name":"THIUNA","text":"So, by restoring the painting, we aim to restore a vision of the village as it once was."},{"name":"THIUNA","text":"With my knowledge of alchemy, I've been able to remove the stains, but the canvas itself is in appalling condition. While the client didn't go into detail, if I didn't know better, I'd say it was intentionally damaged."},{"name":"THIUNA","text":"Now, like most paintings originating in Lakeland, this one uses a special canvas resistant to humidity. In order to restore it, we'll need a material to match. Can you prepare this for us?"},{"name":"THIUNA","text":"Thank you! Once the material is ready, I'll begin work on the restoration!"},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; Your personal information has been updated. You are now officially an artisan of Cherished Memories. Please knock Thiuna into shape. Bish. Bash. &lt;buzzzzzz&gt;"},{"name":"SYSTEM","text":"Facet of Crafting Deliveries are now available. By delivering the requested items to Thiuna and raising yourself in her esteem, you can advance the story of her struggling workshop."}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":152}],"quests":[69191]},"next":[68767]},"partials":[{"type":"npc","id":"1028326","obj":{"i":1028326,"n":"Recording Node","l":2951,"q":1}},{"type":"npc","id":"1027234","obj":{"i":1027234,"n":"Thiuna","l":2951,"q":3}},{"type":"quest","id":"69191","obj":{"i":69191,"n":"The Crystalline Mean","g":172,"l":"The Crystarium","s":10,"f":1}},{"type":"quest","id":"68767","obj":{"i":68767,"n":"For Sentimental Reasons","g":168,"l":"The Crystarium","s":220}}]}