{"quest":{"name":"Rising to the Occasion","location":"Limsa Lominsa","id":68762,"patch":5.0,"sort":800,"icon":100889,"eventIcon":71221,"issuer":1028738,"target":1031099,"genre":163,"journal":["Nashmeira is elated to see one of her favorite young protégés return.","Mistress Nashmeira of Troupe Falsiam and her number two, Ranaa Mihgo, welcome your return to Limsa and rejoice at this fortunate reunion. After exchanging the usual pleasantries and inquiring as to your recent exploits, the Troupe Falsiam principal explains that there is a matter regarding which she would consult with you and Ranaa both, but that she wishes to do so out of the earshot of others. Follow the secretive-as-ever dancer to Summerford, where you might hear more about whatever it is she would ask of you.","Upon your arrival in Summerford, Mistress Nashmeira shares with you joyous tidings: to wit, Troupe Falsiam has received a special invitation to put on an exclusive performance at the Mujikoza in Kugane, the Far East's greatest venue for the performing arts. There is, however, a rub─she has promised to remain in Eorzea to repel the Totentanz, and train a new generation of dancers to continue her fight. And so she makes a startling request: she would cede the position of principal to her protégé Ranaa, and ask her to lead the troupe's expedition to the Far East. Ranaa is baffled and bewildered, as she feels entirely unready to assume a role of such responsibility. Nashmeira invites her to consider her answer carefully, then walks away, leaving Ranaa more confused than ever. Is there naught you might do to bring clarity and calm to the young dancer's mind and heart?","You and Ranaa share a singularly exhilarating dance with each other, your steps in perfect synchrony. But has this served to cast out the shadow of doubt in the young dancer's heart? All that remains is to speak to her and see.","It would seem that sharing a dance with you was precisely what Ranaa needed to work through her conflicted emotions. The young woman's heart and mind now clear, she strides off with newfound confidence back to Limsa, where she means to inform Mistress Nashmeira of the choice she has made. After taking time to catch your breath, you set off to join her.","Back in Limsa, Ranaa shares her decision with Mistress Nashmeira, who is overjoyed to hear that her protégé has chosen to rise to the occasion, and thanks you for the role you played in helping the girl find her way. Ranaa departs to inform the rest of the troupe about the changing of the guard, and you and Nashmeira move along to join her.","Though the sudden announcement came as quite a surprise, Kuihlud and his fellow troupe members welcome Ranaa's promotion to principal, and vow to support her as she endeavors to lead Troupe Falsiam to still greater heights. Farewells and words of gratitude are exchanged by all, and both the troupe members and Nashmeira make preparations to continue their respective journeys. You say good-bye to your friends, looking forward to the day when you may once again take the stage with those who instilled in you a passion for the art of dance."],"objectives":["Speak with Nashmeira in Summerford.","Speak with Ranaa Mihgo.","Speak with Ranaa Mihgo again.","Speak with Nashmeira in Limsa Lominsa.","Speak with Ranaa Mihgo."],"dialogue":[{"name":"NASHMEIRA","text":"Well, if it isn't <span class=\"highlight\">Forename</span>! What a delightful surprise. And just look at that posture and poise! I can see you've not neglected your training one bit since we last parted."},{"name":"RANAAMIHGO","text":"As for us, Troupe Falsiam continues to tour Eorzea, bringing hope to the dejected and downtrodden. Whenever and wherever the Totentanz threatened to rear its ugly head, we were there to cast out the shadows."},{"name":"NASHMEIRA","text":"With tales of our performances spreading across the realm, we've had no small number of aspiring dancers knocking at our door. Training them was consuming nearly all my waking hours, but recently Ranaa has stepped in to help shoulder the burden."},{"name":"NASHMEIRA","text":"Truly, I'd be lost without her. And what of you, <span class=\"highlight\">Forename</span>? Have you had any noteworthy performances since last we met?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I traveled to and from a distant world."},{"name":"A2","text":"I journeyed in search of a legendary hero."},{"name":"NASHMEIRA","text":"And I thought our voyage to distant shores a long one! I see you've had yourself quite an adventure─though I confess the full import of your tale is quite beyond my comprehension."},{"name":"NASHMEIRA","text":"Still, this bounty hunter you befriended put you in quite the predicament, didn't he? It reminds me of another troublemaker I used to know..."},{"name":"RANAAMIHGO","text":"Me, a troublemaker!? I may have been immature, but I only had my friends' best interests at heart. Isn't that right, <span class=\"highlight\">Forename</span>? And besides, it sounds like even this bounty hunter came around in the end."},{"name":"NASHMEIRA","text":"...Indeed. There is a certain something about you, <span class=\"highlight\">Forename</span>. Something that brings out the best in those whose lives you touch─and Ranaa here is a prime example."},{"name":"NASHMEIRA","text":"The hot-headed girl I once knew has come into her own as a dancer, a woman, and a leader of her peers. Perhaps it is finally time that...yes, I am sure of it."},{"name":"NASHMEIRA","text":"<span class=\"highlight\">Forename</span>. Ranaa. There is a dilemma that has been weighing heavily on me of late, but I do believe I've finally found an answer. Pray accompany me out of the city to La Noscea─I would discuss matters further with you away from the crowds."},{"name":"KUIHLUD","text":"Mistress Nashmeira has come to rely more and more on Ranaa of late. At first, I wondered if this was wise, but I must say I have come to be impressed with the girl's newfound maturity."},{"name":"RANAAMIHGO","text":"Over and over Mistress Nashmeira promised me: no more secrets! But I suppose she just can't help herself sometimes..."},{"name":"NASHMEIRA","text":"<span class=\"highlight\">Forename</span>, Ranaa...forgive me for not sharing the news with you two sooner. As fortune would have it, Troupe Falsiam has been invited to perform at the Mujikoza in Kugane─and our patrons are willing to pay a premium for our services."},{"name":"RANAAMIHGO","text":"The Mujikoza!? You mean that I could dance on the same stage that has hosted some of the most renowned artistes in all the Far East? Someone pinch me! When do we leave?"},{"name":"NASHMEIRA","text":"As soon as we are able─and therein lies my dilemma. The threat of the Totentanz still looms over Eorzea, and I have a duty to train the next generation of dancers to carry on Troupe Falsiam's mission."},{"name":"NASHMEIRA","text":"I cannot very well abandon these shores while my life's work remains undone. And so I turn to you."},{"name":"NASHMEIRA","text":"Ranaa Mihgo. You have blossomed into a fine dancer, and a capable leader. I would have you assume my role as principal, and oversee Troupe Falsiam's tour of Kugane."},{"name":"RANAAMIHGO","text":"Mistress Nashmeira...what are you saying?"},{"name":"NASHMEIRA","text":"It is the only practical solution. You would travel to Kugane to share our art with our friends in the Far East, and I could remain here to train our new recruits, and deliver the people of Eorzea from the throes of the Totentanz."},{"name":"RANAAMIHGO","text":"B-But I'm not ready for this! There is still so much I must learn. You told me as much just moons ago!"},{"name":"NASHMEIRA","text":"And I have seen you come far since then. No one is born a leader, and doubtless it will be a struggle at first. But you are every bit as prepared for this role as I was the day I inherited it."},{"name":"NASHMEIRA","text":"I would not make this offer if I did not believe this with all my heart. And yet, I cannot─and will not─force the position upon you. But at the very least, pray think upon it for a while."},{"name":"RANAAMIHGO","text":"<span class=\"emphasis\">Me</span>, leader and principal of Troupe Falsiam!? I do believe Mistress Nashmeira's lost her wits! Why, I still remember the days I would trip over my own two feet every time I took the stage!"},{"name":"RANAAMIHGO","text":"And yet, she seems intent on remaining here in Eorzea. If I refuse, the curtains will fall on a once-in-a-lifetime opportunity to showcase our art on the Far East's biggest stage! And yet, were I to go and fail spectacularly... "},{"name":"RANAAMIHGO","text":"I swear, my mind is going in circles! Whatever should I do, <span class=\"highlight\">Forename</span>? It's not like me to brood and fret like this!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Then stop brooding."},{"name":"A2","text":"You are a dancer, are you not?"},{"name":"RANAAMIHGO","text":"I suppose you're right. I've always been the type to act before I think. If thinking about my problems is getting me nowhere, perhaps I should just start moving and see where the moment takes me."},{"name":"RANAAMIHGO","text":"What are you saying? That if I cannot find the answer I seek in still thought, perhaps I might find it in motion? Hmm... You may very well be right."},{"name":"RANAAMIHGO","text":"Dance with me, <span class=\"highlight\">Forename</span>. Show me through your motions all you have learned in your travels, and help me to clear the shadows of doubt from my mind."},{"name":"RANAAMIHGO","text":"A stunning view, no sign of onlookers for malms─yes, this place should serve nicely for our private performance."},{"name":"RANAAMIHGO","text":"We dance today not for admiring crowds─our only audience is each other. So face me, <span class=\"highlight\">Forename</span>. I would look upon your movements in all their glory, and let you inspire me to greater heights."},{"name":"RANAAMIHGO","text":"Oh, thank you, <span class=\"highlight\">Forename</span>! That was simply exhilarating!"},{"name":"RANAAMIHGO","text":"From the first step, I couldn't take my eyes off you. Before I knew it, I had forgotten myself, my worries carried off by the wind."},{"name":"RANAAMIHGO","text":"You were watching me, yes? What did you think? Have I truly come far, as Mistress Nashmeira says?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Indeed you have."},{"name":"A2","text":"You will go further."},{"name":"RANAAMIHGO","text":"Tee hee! You're too kind, <span class=\"highlight\">Forename</span>. Seeing you has inspired me to work even harder, that I could truly reach the heights Mistress Nashmeira envisions for me."},{"name":"RANAAMIHGO","text":"Hah! So you're saying there's still room for improvement, eh? Well, consider the challenge accepted! I'll train harder than ever, and next time we meet, you'll see what I'm truly capable of!"},{"name":"RANAAMIHGO","text":"In any event, this I know more than ever: dancing is my life, my calling. I must continue to perfect my craft, that I might inspire and bring hope to others, just as Mistress Nashmeira and you have inspired me."},{"name":"RANAAMIHGO","text":"The answer is clear to me now. I may not be the leader that she was, but I will be the leader I know I can be."},{"name":"RANAAMIHGO","text":"Thank you for everything, <span class=\"highlight\">Forename</span>. I must return to Limsa to relay the news to Mistress Nashmeira. You will join me there, won't you?"},{"name":"RANAAMIHGO","text":"Breathe, Ranaa... Breathe..."},{"name":"NASHMEIRA","text":"Ranaa here came dashing into town half out of breath. I can only assume what this means─the girl has found her answer, has she not?"},{"name":"RANAAMIHGO","text":"You bet I have! I may not be ready to fill your toe shoes completely, but damned if I'm not going to try! Leave the tour of Kugane to me!"},{"name":"NASHMEIRA","text":"I am proud of you, Ranaa. Now, go and tell the others that you must begin preparations at once. I will be along with <span class=\"highlight\">Forename</span> shortly."},{"name":"NASHMEIRA","text":"While I am beyond pleased with the results, I must admit I did not expect the girl to reach a decision so quickly. Whatever did you do to bring about her change of heart?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We danced together."},{"name":"A2","text":"That, I cannot say..."},{"name":"NASHMEIRA","text":"So it was not with words, but through your actions that you spoke to the girl. Indeed, it is as I thought─your very presence is as a mirror that helps those around you discover their true selves."},{"name":"NASHMEIRA","text":"That's between you and Ranaa, you say? Well, with all the secrets I've kept from you, I suppose I'm not one to talk. And yet, as silly as it sounds, I can't help but envy the friendship you two share."},{"name":"NASHMEIRA","text":"In any event, Ranaa owes much to you, my friend...as do I. Troupe Falsiam is stronger for you having joined us. Come, now. Let us return to the others."},{"name":"KUIHLUD","text":"To think the girl I thought of as a little sister would one day lead Troupe Falsiam! This will take some getting used to..."},{"name":"NASHMEIRA","text":"Look at all those surprised faces! Not that I can blame them, of course..."},{"name":"KUIHLUD","text":"I cannot say I was prepared for this. And yet, if this is how Mistress Nashmeira would have it, it is far from my place to oppose. Besides, nothing in this world can last forever."},{"name":"KUIHLUD","text":"With the end of one era comes the beginning of the next, and all of us here welcome Mistress Ranaa's reign. We will do all in our power to see that Troupe Falsiam continues to flourish under her stewardship."},{"name":"RANAAMIHGO","text":"Kuihlud, my friends...you are too kind. Let us not forget that we are all in this together. If we move forward as one, there's no limit to the heights we may reach!"},{"name":"RANAAMIHGO","text":"And with that, we must prepare to set sail without delay. In Kugane, too, there are those whose spirits sag, and we must bring them hope as only Troupe Falsiam can!"},{"name":"NASHMEIRA","text":"I, too, should be getting on. The Totentanz threatens to return in hidden corners of the realm, and I must train the next generation of dancers to continue our fight."},{"name":"RANAAMIHGO","text":"And you have your own adventures to return to, don't you, <span class=\"highlight\">Forename</span>? But don't be sad. Mistress Nashmeira, you, and I─even if we go our separate ways, we will always be united by our passion for dance."},{"name":"RANAAMIHGO","text":"Our paths will cross again, I'm certain. And on that day, you'll be simply astonished at the dancer I've become─mark my words!"},{"name":"RANAAMIHGO","text":"And so to you─my rival, my friend─I say not farewell, but rather, keep dancing, until we might once again take the same stage!"}],"reward":{"gil":1361,"items":[{"id":25187},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":150}],"questsType":"all","quests":[68790,68814]}},"partials":[{"type":"npc","id":"1028738","obj":{"i":1028738,"n":"Nashmeira","l":29,"q":1}},{"type":"npc","id":"1031099","obj":{"i":1031099,"n":"Ranaa Mihgo","l":29,"q":1}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68790","obj":{"i":68790,"n":"Save the Last Dance for Me","g":163,"l":"Gridania","s":241,"f":1}},{"type":"quest","id":"68814","obj":{"i":68814,"n":"Courage Born of Fear","g":181,"l":"Kholusia","s":351,"f":1}}]}