{"quest":{"name":"Succession of Steel","location":"Mor Dhona","id":68760,"patch":5.0,"sort":800,"icon":100887,"eventIcon":71221,"issuer":1023610,"target":1030677,"genre":161,"journal":["Arya seems excited to see you.","Arya greets you with even more enthusiasm than usual. According to a letter she recently received, your former mentor has need of your help. Though the missive is light on details, it seems X'rhun would have you join him in the Ala Mhigan Quarter.","Upon meeting with X'rhun, you learn that a band of graverobbers has made off with a blade once belonging to a member of the Crimson Duelists. The thieves have proven difficult to apprehend by nonlethal measures, and he could use an extra pair of hands (or two, thanks to the stubborn Arya) to ensure he has a captive to interrogate. With the situation explained, X'rhun directs you to a rendezvous point on the eastern edge of Bloodhowe.","X'rhun assigns you the role of convincing the graverobbers to walk into a prepared ambush. Venture into Bloodhowe, and locate the thieves in question.","You find the graverobbers, and manage to persuade them to move towards the east side of Bloodhowe. They do, however, take your advice with one caveat: you are to go along with them. Catch up to the unsavory band where they await you up ahead.","With an eye towards “eliminating the competition,” two members of the graverobbing gang remained behind to waylay you─rather unsuccessfully, as it turns out. Continue on to X'rhun Tia's location, and find out how well your own companions' ambush proceeded.","You return to find the remaining thieves trussed up and interrogated. If the captives' confession is to be believed, you will find their stash of ill-gotten gains buried somewhere within the expanse of the Royal Hunting Grounds.","A soft patch of ground betrays the location of the graverobbers' buried stash. You soon unearth a large box, and confirm that it contains the missing sword, as well as a collection of other plundered mementos. Join the relieved X'rhun in returning the stolen relics to the Tomb of the Errant Sword.","With the keepsakes of the departed back in their rightful place, X'rhun tells the story of his deceased comrade and his custom-made blade. The sword must have a new owner, and, following through on his promise to continue her tutelage, X'rhun offers Arya the hilt. Caught up in the moment, the three of you reaffirm your dedication to the creed of the red.","With apologies to Arya and her education, X'rhun states his intention to resume his pilgrimage across Eorzea that he might be in place to battle the incursions of the Empire. He will, however, return to Mor Dhona from time to time to look in on his student. Arya accepts this decision with good grace, and urges you to join her back in Revenant's Toll.","Now that she has regained a measure of her mastery over red magic, Arya aspires to perfect the use of her newly acquired weapon. It is time you returned to your own adventures, lest you fail to meet the lofty expectations of your fellow mages!"],"objectives":["Speak with X'rhun Tia in the Ala Mhigan Quarter.","Speak with X'rhun Tia.","Search for the graverobbers at Bloodhowe.","Speak with the graverobbers.","Speak with X'rhun Tia.","Speak with X'rhun Tia in the Royal Hunting Grounds.","Speak with X'rhun Tia at the Tomb of the Errant Sword.","Speak with X'rhun Tia.","Speak with Arya in Revenant's Toll."],"dialogue":[{"name":"ARYA","text":"<span class=\"highlight\">Forename</span>, I was about to go looking for you! I've had a letter from X'rhun Tia, and he's asked me to pass on a message. Ahem..."},{"name":"ARYA","text":"(-Letter from X'rhun Tia-)<span class=\"emphasis\">Arya, I hope this missive finds you well. Should you come across <span class=\"highlight\">Forename</span> in Revenant's Toll, pray send <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to me in the Ala Mhigan Quarter. I have need of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> help.</span>"},{"name":"ARYA","text":"What could be happening in Ala Mhigo, I wonder...? Well, I suppose there's one sure way to find out! Let's go!"},{"name":"XRHUNTIA","text":"Ah, how wonderful to see my two erstwhile students! And not a moment too soon..."},{"name":"ARYA","text":"We are glad to see you too, X'rhun, though I gather the situation is not a happy one?"},{"name":"XRHUNTIA","text":"You gather correctly. You'll recall the brotherhood I was once part of─the Crimson Duelists? Well it seems the keepsakes left behind by my deceased colleagues have run afoul of some enterprising graverobbers."},{"name":"XRHUNTIA","text":"When the Duelists met their end some two decades past, I was too deeply engaged in my own battles to give them the burial they deserved."},{"name":"XRHUNTIA","text":"And so I did what many before me have done─I collected the blades of the dead, and interred them within the Tomb of the Errant Sword."},{"name":"XRHUNTIA","text":"With Ala Mhigo much settled since the initial reclamation of the city, I judged it time to pay respects to my fallen comrades. That is when I discovered the tomb in disarray, and one of the Duelists' swords missing..."},{"name":"XRHUNTIA","text":"It would seem such petty acts of larceny have become common of late, and although the Resistance speaks of taking steps, the army has its hands full overseeing the restoration efforts."},{"name":"ARYA","text":"But it's said that unrest and dissent have largely disappeared under General Aldynn's command. Why this sudden rash of law-breaking?"},{"name":"XRHUNTIA","text":"Ah, well now that the imperials have been beaten back, those who once suckled from the Empire's teat are forced to look elsewhere for the wealth to which they are accustomed. For some, this means taking up a life of banditry."},{"name":"XRHUNTIA","text":"And for the lowest amongst <span class=\"emphasis\">them</span>, it means ransacking the resting places of their countrymen─a crime I do not intend to leave unpunished."},{"name":"XRHUNTIA","text":"As things stand, however, I have yet to deliver said judgment. This particular gang is uncommonly swift of foot, and I must temper my attacks lest I slay them ere learning the location of their stashed loot. "},{"name":"XRHUNTIA","text":"Thus do I turn to you for assistance. Capturing these thieves alive will be far easier with an extra pair of hands..."},{"name":"ARYA","text":"If it's extra hands you need, then count me in!"},{"name":"XRHUNTIA","text":"Without red magicks at your beck and call? Nay, 'tis too dangerous for one still relearning her art."},{"name":"ARYA","text":"I've been practicing against the creatures of Mor Dhona ever since we parted ways. My magicks may not be what they once were, but I can cast the initiate spells well enough, I promise!"},{"name":"XRHUNTIA","text":"The monsters in Mor Dhona are not to be trifled with. That was a risky path to take at this stage of your training."},{"name":"ARYA","text":"I took risks, yes, but not foolhardy ones. If I don't push myself to my limits, then I'll never catch up to you or <span class=\"highlight\">Forename</span>!"},{"name":"XRHUNTIA","text":"I wager you'll not take no for an answer... &lt;sigh&gt; Very well, but you do not leave my side, understand?"},{"name":"ARYA","text":"Yes! Thank you, X'rhun─you won't regret this!"},{"name":"XRHUNTIA","text":"The three of us, then. Bloodhowe is where these graverobbers ply their unsavory trade, and the edge of the graveyard is where we shall meet."},{"name":"ARYA","text":"I'm eager to show X'rhun how far my training has come. But more than that, I'm just happy to be at a place where I can assist him again!"},{"name":"XRHUNTIA","text":"I'd like to simply snatch up these graverobbers, but they have proven an infuriatingly slippery foe─a foe who now knows my face."},{"name":"XRHUNTIA","text":"...Which is why you, <span class=\"highlight\">Forename</span>, must play the role of deceiver."},{"name":"XRHUNTIA","text":"Search the graveyard until you find the thieves in question, then convince them it is in their best interests to slink over here to the east. Once the scoundrels are too close to escape, Arya and I will spring our trap."},{"name":"XRHUNTIA","text":"The graverobbers are lurking somewhere within Bloodhowe. Seek them out and convince them to move eastwards...right into our ambush."},{"name":"GRAVEROBBER03224","text":"You lookin' for trouble, mate? How big a fool d'you have to be to just wander up to a gang like this..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What're you doin' over here? You'll find far richer spoils in the graves to the east!"},{"name":"A1","text":"You should head eastward─I saw a patrol sweepin' the grounds in the west!"},{"name":"GRAVEROBBER03224","text":"Is that so, eh? We'd about picked this plot clean anyway, so maybe we'll take that advice. Thanks for the hint, <span class=\"emphasis\">friend</span>."},{"name":"GRAVEROBBER03224","text":"Soldiers, is it? Then we'd best be movin' on. Thanks for the warning, <span class=\"emphasis\">friend</span>."},{"name":"GRAVEROBBER03224","text":"Oh, and not that we doubt your word or anything, but you'd best come with us. Call it a show of good faith amongst thieves. We'll be waitin' just up ahead..."},{"name":"GRAVEROBBER03224","text":"Don't you worry about our two mates─they went ahead to the east, just like you suggested. And us? Well, someone's got to eliminate the competition!"},{"name":"ARYA","text":"My power is a shadow of what it used to be...which made taking captives easier than expected. Scorch marks rather than incineration!"},{"name":"XRHUNTIA","text":"Nicely done, <span class=\"highlight\">Forename</span>! We caught these two completely off guard."},{"name":"XRHUNTIA","text":"And I must say, Arya, you exceeded my expectations. You've made impressive progress in such a short length of time."},{"name":"ARYA","text":"Yes! I knew those lessons at the mage guilds were worth it! Even if it was painful to begin at the beginning again..."},{"name":"XRHUNTIA","text":"Oho, I see you've been cracking open as many books as you have monsters' skulls. Your dedication to the fundamentals has certainly paid off!"},{"name":"XRHUNTIA","text":"Now, I counted four brigands the last time I was here. Knowing what I do of such villains, I assume the other two sought to waylay you...?"},{"name":"XRHUNTIA","text":"...Yet here you stand with scarce a hair out of place. All jesting aside, I suspect your skills have surpassed my own. What trials must you have endured to forge such strength?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I fought on another star, to save the world from oblivion..."},{"name":"A1","text":"I fought on another star, against heroes turned villain..."},{"name":"XRHUNTIA","text":"...Another star!? Even your adventures play out on a stage beyond my wildest imaginings."},{"name":"XRHUNTIA","text":"And this talk of...“sin eaters,” was it? It sounds to me as if your battles took place on the edge of suffering itself, where the heart and steel of even the mightiest red mage would be tested!"},{"name":"XRHUNTIA","text":"Ahem. But whilst it is endlessly gratifying to hear the exploits of one's former student, I suppose we should return to the matter at hand."},{"name":"XRHUNTIA","text":"Once we had subdued these ruffians here, a few threats gleaned us the location of their ill-gotten gains─all buried in a box in the Royal Hunting Grounds, or so they claim."},{"name":"XRHUNTIA","text":"I believe another division of labor is in order. Arya, pray hand our captives over to the Resistance, then wait for us at the Tomb of the Errant Sword."},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>, you and I have some digging to do."},{"name":"ARYA","text":"Go ahead with X'rhun─I have things under control here. When it comes to magecraft, though, I feel like for every three steps I take, you've already taken another ten or twenty!"},{"name":"XRHUNTIA","text":"Do you feel that? The ground, it's soft─certainly not as packed down as elsewhere. I think we've found their cache."},{"name":"XRHUNTIA","text":"Phew... Glad I am to have found this before they hauled it off to the black market."},{"name":"XRHUNTIA","text":"I cracked the lid to check the contents, and the box is indeed filled with stolen goods...including one rather familiar sword!"},{"name":"XRHUNTIA","text":"Come, we should return these articles to the tomb. With any luck, Arya will have arrived already."},{"name":"ARYA","text":"Thank goodness, you found the sword! I feared it had been sold..."},{"name":"XRHUNTIA","text":"Right! Let us return these relics to their rightful places!"},{"name":"XRHUNTIA","text":"That should be the last of them..."},{"name":"ARYA","text":"But what of your comrade's blade?"},{"name":"XRHUNTIA","text":"Ah, well... Would you indulge me in a moment of nostalgia?"},{"name":"XRHUNTIA","text":"The man who wielded this sword suffered from shallow reserves of aether, and so he commissioned a weapon capable of channeling his energies in the most efficient manner. As you might imagine, the custom blade thus forged cost him a small fortune in coin."},{"name":"XRHUNTIA","text":"We would taunt him and his empty purse without mercy, of course, challenging him to become a mage worthy of such priceless steel."},{"name":"XRHUNTIA","text":"His reply to our jeering comments would always stay with me: “Even should I fail to do this steel justice, it will remain long after I have perished. A kindred soul shall take up the sword, and then you will see my coin was wisely spent.”"},{"name":"XRHUNTIA","text":"His hopes for such a legacy died with the Crimson Duelists. I entombed the blade, believing that no new mage would rise to claim it..."},{"name":"XRHUNTIA","text":"But I was wrong. You two stand here as living proof that our efforts to revive red magic were not in vain."},{"name":"XRHUNTIA","text":"...'Twas when I discovered the sword missing that I was put in mind again of my comrade's words. And I wonder if he did not orchestrate this affair from beyond the grave if only to remind me of his will."},{"name":"XRHUNTIA","text":"<span class=\"highlight\">Forename</span>, you appear to have a distinct taste in weapons. This blade, I think, should belong to Arya..."},{"name":"ARYA","text":"B-But I'm not even your student right now. I don't think I deserve to have it..."},{"name":"XRHUNTIA","text":"I made a promise to you, did I not? That once you learn to harness your aether, I would take you under my tutelage once more?"},{"name":"XRHUNTIA","text":"The way I see it, you have more than upheld your end of the bargain. Accept the sword, Arya. Be my apprentice, and help me usher in a new future for the red."},{"name":"Q1","text":"What will you say to Arya?"},{"name":"A1","text":"You should take the sword."},{"name":"A1","text":"Are you still afraid of the spirits of the dead?"},{"name":"ARYA","text":"...I will. If you would offer to accept me as your student once more, then let this be my answer."},{"name":"ARYA","text":"It is not fear that stays my hand! And even should the shade of X'rhun's comrade come forth, I will not flinch from this honor!"},{"name":"XRHUNTIA","text":"It is done. Let us present here this day swear a new oath! To fight for the common good with pure heart and unbending steel!"},{"name":"ARYA","text":"Look─I've already hung it from my belt. This sword's heavier than my old one, but I mean to practice enough that having it there feels more a comfort than a burden."},{"name":"XRHUNTIA","text":"And so concludes our business here. But as much as I should like to accompany you back to Mor Dhona, I fear my own pilgrimage must continue..."},{"name":"XRHUNTIA","text":"This war with the imperials has Ala Mhigo teetering on the brink of uncertainty once more. And I must assume the situation is most taxing for you and your fellow Scions."},{"name":"XRHUNTIA","text":"Thus for the time being shall I keep my blade loose in its sheath. I may be but one man, but know that I shall remain vigilant against the Empire's machinations as I chart my course across the lands of Eorzea."},{"name":"XRHUNTIA","text":"I am sorry that I cannot yet devote myself to your lessons, Arya─the demands of the road are such that I cannot take you with me and still hope to move as swiftly."},{"name":"ARYA","text":"Your oath takes precedence, of course! I'm ecstatic just to know you'll be my mentor once again. Please, stay safe on your travels!"},{"name":"XRHUNTIA","text":"I appreciate your understanding. And I will stop by to aid your progress in Revenant's Toll whenever circumstances permit."},{"name":"XRHUNTIA","text":"I take my leave, then. Fare you well, <span class=\"highlight\">Forename</span>─when next we meet, I expect your scarlet hues shall be ever the more vivid!"},{"name":"ARYA","text":"Shall we make our way back to Mor Dhona, then?"},{"name":"ARYA","text":"I've been so consumed with restoring my magicks, but now I have a new goal: learning to wield my new sword with perfect execution!"},{"name":"ARYA","text":"With X'rhun's instruction, I mean to become a red mage worthy of his comrade's weapon. And I wouldn't say no to any help from you either, <span class=\"highlight\">Forename</span>!"}],"reward":{"gil":2960,"items":[{"id":25187},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":112}],"questsType":"all","quests":[68123,69164]}},"partials":[{"type":"npc","id":"1023610","obj":{"i":1023610,"n":"Arya","l":67,"q":1}},{"type":"npc","id":"1030677","obj":{"i":1030677,"n":"Arya","l":67,"q":1}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68123","obj":{"i":68123,"n":"With Heart and Steel","g":161,"l":"Ishgard","s":700,"f":1}},{"type":"quest","id":"69164","obj":{"i":69164,"n":"A Tearful Reunion","g":182,"l":"Amh Araeng","s":51,"f":1}}]}