{"quest":{"name":"For Sentimental Reasons","location":"The Crystarium","id":68767,"patch":5.0,"sort":220,"eventIcon":71221,"issuer":1027234,"target":1027234,"genre":168,"usedItems":[27244,27245],"journal":["Thiuna appears to be deep in thought."],"objectives":["Speak with Thiuna.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a workshop sign <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the workshop sign <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Thiuna</span></span>."],"dialogue":[{"name":"THIUNA","text":"Hmmm... Whatever should I do..."},{"name":"THIUNA","text":"Uwaaah! H-How long have you been standing there? I was so deep in thought, I didn't notice you."},{"name":"THIUNA","text":"You see, I've been pondering whether to speak with you about Owell. That you should appear at this moment is a sign. Please hear me."},{"name":"THIUNA","text":"As you know, Owell and I were orphans taken in by Master Harig."},{"name":"THIUNA","text":"We were close friends, playing and arguing with one another in turn, and together we trained as artisans. But all of that changed when Master Harig disappeared."},{"name":"THIUNA","text":"Young as we were then, we weren't told what became of him. But it's more than likely that, like so many others, he was slain by a sin eater."},{"name":"THIUNA","text":"From that time on, Owell and I drifted apart. Eventually we stopped speaking entirely. It was only when I announced my intention to open my shop that he had words for me, and they were none too kind. “You don't understand anything,” he spat out angrily."},{"name":"THIUNA","text":"Well, he's right in one regard. I don't understand why he so detests my work. It goes beyond mere disapproval. He makes it personal, as if I've done something to offend him."},{"name":"THIUNA","text":"This wouldn't be a problem, except Owell holds considerable influence at the Mean. A bad word from him and we would get no more custom. Sooner or later, I'll have to settle our differences, but the mere anticipation of it is nerve-racking. Ah, what I wouldn't give for a stiff drink..."},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; Command received. &lt;bloop&gt; Instruction to Thiuna: proceed to the Wandering Stairs."},{"name":"THIUNA","text":"I...beg your pardon?"},{"name":"THIUNA","text":"Oh no, Noddy's going to summon Owell!"},{"name":"THIUNA","text":"&lt;sigh&gt; Seems it's to be sooner than later... <span class=\"highlight\">Forename</span>, might I ask you to join me at the Wandering Stairs? I could use the support."},{"name":"THIUNA","text":"Owell isn't here yet. I wouldn't be surprised if he doesn't come at all."},{"name":"OWELL","text":"Thiuna. So you're the “urgent business” that I had to drop everything for."},{"name":"RECORDSYSTEM","text":"Affirmative! &lt;buzz&gt; Thiuna has a score to settle with you!"},{"name":"OWELL","text":"What was that?"},{"name":"THIUNA","text":"N-Nothing. Be quiet now, Noddy."},{"name":"RECORDSYSTEM","text":"&lt;beep&gt; Forced shutdown initiated. &lt;buzzzzzz&gt;"},{"name":"THIUNA","text":"There's something I need to ask you, Owell."},{"name":"OWELL","text":"Make it quick. Unlike you, I've got responsibilities."},{"name":"THIUNA","text":"All right. Not everyone agrees with what I do. I understand that. What I don't understand is why you're so angry with me."},{"name":"OWELL","text":"You called me here just to ask me <span class=\"emphasis\">that</span>? Hah, urgent business indeed! How easy life must be when your days are filled with play!"},{"name":"THIUNA","text":"What we do isn't play! We restore those items that hold sentimental value for the people of the Crystarium!"},{"name":"OWELL","text":"Listen well."},{"name":"OWELL","text":"Thanks to the efforts of our ancestors, we've come to enjoy a semblance of a normal life. But shortages are still a daily reality."},{"name":"OWELL","text":"Shortages you do nothing to alleviate! In the time it took you to restore a single decrepit set of amaro barding, I crafted a dozen new ones!"},{"name":"OWELL","text":"With Master Harig gone, it falls to me to prop up the Mean."},{"name":"OWELL","text":"It falls to me because Master had to go off to satisfy some vain obsession...and you had to take after him!"},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; Node restart complete."},{"name":"RECORDSYSTEM","text":"&lt;bloop&gt; Resuming suspended operations. Owell not detected. Shall I fetch him?"},{"name":"THIUNA","text":"No, Noddy. Leave him be."},{"name":"THIUNA","text":"I'm sorry you had to witness that, <span class=\"highlight\">Forename</span>. Owell...he didn't use to be that way."},{"name":"THIUNA","text":"While I believe in what we do, I can't deny that there's truth to his words. But hmmm... “Go off to satisfy an obsession”..."},{"name":"THIUNA","text":"The day Master Harig disappeared, he had ventured out to procure materials. The item he was seeking to restore was... Ah."},{"name":"THIUNA","text":"<span class=\"highlight\">Forename</span>, I hate to involve you in my personal dilemmas, but I need your help. Can I rely on you?"},{"name":"THIUNA","text":"I'm truly grateful. Let's return to the Crystalline Mean. I'll explain everything there."},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; Retrieving profile for Owell. &lt;bloop&gt; A Hume male, Owell is an artisan of the Facet of Crafting. Marital status: single. Favorite beverage: hot milk."},{"name":"THIUNA","text":"If Cherished Memories is to survive, we must do something to stem Owell's criticism."},{"name":"THIUNA","text":"He's already done damage to our reputation, judging by the recent decline in business."},{"name":"THIUNA","text":"We must win him over somehow. Convince him that Cherished Memories is a serious venture, and make him see the true worth of restoration."},{"name":"THIUNA","text":"With regards to the latter, I have an idea. There's an item which, if restored, is bound to strum on Owell's heartstrings."},{"name":"THIUNA","text":"But I'm at a loss as to how we might show him that we mean business..."},{"name":"Q1","text":"What will you suggest?"},{"name":"A1","text":"Ignore the criticism and let our work speak for us."},{"name":"A1","text":"Improve the workshop's appearance."},{"name":"A1","text":"Keep the rustball in check."},{"name":"THIUNA","text":"Would that we could, but Owell holds too much influence. We have to do something to make him change his mind about us."},{"name":"THIUNA","text":"Hmmm, now that you mention it, our workshop doesn't have much to draw the eye. Perhaps there's something to be said for looking the part..."},{"name":"THIUNA","text":"Hmmm? What are you implying about my adorable assistant, pray tell?"},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; In order to advertise their presence, shops commonly make use of signage. At present, Cherished Memories has none."},{"name":"THIUNA","text":"Of course! A sign! Why didn't I think of that?"},{"name":"THIUNA","text":"<span class=\"highlight\">Forename</span>, would you be willing to fashion a sign for our workshop?"},{"name":"THIUNA","text":"In light of all the help you've given us, it seems only right that you have the honor."},{"name":"THIUNA","text":"Thank you so much! I can't wait to see the finished product. Oh, and if you run out of materials, Noddy will furnish you with more."},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; I have more materials should you require them."},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; Analyzing sign... &lt;buzz&gt; Mmm-hmmm, very nice. I do not know much about signs, but I know what I am programmed to like."},{"name":"THIUNA","text":"How fares work on the sign? I can't wait to see it!"},{"name":"THIUNA","text":"Blessed night, what a magnificent sign this is! It incorporates all the techniques of our restoration work─a perfect representation of who we are! From the design to the details, everything about it is wonderful!"},{"name":"THIUNA","text":"Not only will this sign attract customers, it will serve to remind me of my goal to emulate your skills. I can't thank you enough for it."},{"name":"THIUNA","text":"With this, we can finally show Owell that we mean business."},{"name":"THIUNA","text":"I'll see to hanging the sign up as soon as possible. It's bound to be the envy of other artisans!"},{"name":"THIUNA","text":"All that remains, then, is to impress upon Owell the true worth of restoration. On which front, there's something I would show you."},{"name":"THIUNA","text":"This lute was a gift from the Exarch to Master Harig. Since he left us, it has lain there, broken and silent."},{"name":"THIUNA","text":"Apparently, it was an enchanted instrument whose power had long faded, but its tone was no less beautiful for it."},{"name":"THIUNA","text":"Master would often play this lute at the tavern, and Owell and I would go and listen. Seeing how keen we were, he even gave us lessons."},{"name":"THIUNA","text":"We loved the rich, soothing sound, and we weren't alone. Whenever Master Harig played, the tavern was always full."},{"name":"THIUNA","text":"No matter how rowdy the patrons were, as soon as the first chord was strummed, a hush would fall over the place. The music resonated with them, filling their hearts with peace in both good times and in bad."},{"name":"RECORDSYSTEM","text":"&lt;blip&gt; Following Harig's disappearance, however, the lute has been gathering dust."},{"name":"THIUNA","text":"W-Well, that's because no one could restore it properly save Master himself. An instrument demands consummate skill. Back then it was completely beyond me, and even now I don't feel equal to the task."},{"name":"THIUNA","text":"But I must try. Master wouldn't want to see Owell and I quarreling. No, he'd want us to join hands and serve the Crystarium and her people."},{"name":"THIUNA","text":"As it does for me, the lute holds fond memories for Owell. By restoring it, I'm hopeful that we can reach out to him."},{"name":"THIUNA","text":"<span class=\"highlight\">Forename</span>, this time it's a personal request. I need your help to make this lute sing once more."},{"name":"THIUNA","text":"Thank you. It gives me heart to have your support. I'll make ready for the restoration and let you know what I require."},{"name":"SYSTEM","text":"The next request will be available from Thiuna upon reaching level 78 as a carpenter, leatherworker, or weaver."}],"reward":{"gil":861,"items":[{"num":250,"id":10},{"num":250,"id":11}]},"reqs":{"jobs":[{"lvl":75,"id":152}],"quests":[68766]},"next":[68768]},"partials":[{"type":"npc","id":"1027234","obj":{"i":1027234,"n":"Thiuna","l":2951,"q":3}},{"type":"item","id":"27244","obj":{"i":27244,"n":"Workshop Sign Materials","l":406,"c":25997,"t":63}},{"type":"item","id":"27245","obj":{"i":27245,"n":"Workshop Sign","l":406,"c":26580,"t":63}},{"type":"quest","id":"68766","obj":{"i":68766,"n":"Cherished Memories","g":168,"l":"The Crystarium","s":210,"f":1}},{"type":"quest","id":"68768","obj":{"i":68768,"n":"The Notes of Bond Restoring","g":168,"l":"The Crystarium","s":230}}]}