{"quest":{"name":"Well Eel Be Damned","location":"The Crystarium","id":68775,"patch":5.0,"sort":510,"icon":100849,"unlocksFunction":1,"eventIcon":71341,"issuer":1027237,"target":1027237,"genre":171,"journal":["Frithrik is a man in need of a friend. And fish.","Frithrik has dedicated his life to researching any and all matters pertaining to fish, including techniques for catching them and their nutritional properties. His extraordinary methods have earned him the position of representative of the Facet of Fishing, although he is far from content to bear the burden of responsibility. Sensing that you may be something of a kindred spirit, he offers to show you the work carried out in Sullen.","Barely have you and Frithrik stepped foot on the shore of the Source when you are accosted by a local fisher named Mervyl. He launches into a lengthy tirade expressing his dissatisfaction at the plans to diversify the species caught by the facet, claiming that their first priority should be filling the bellies of the populace. He posits that not only are the proposals of little value, they also place the fishers at risk by having them venture into dangerous areas. After Mervyl storms off, Frithrik asks if you would join him in the Cabinet of Curiosity where he can better explain the reasoning behind his theories.","Frithrik informs you that a number of potentially serious health conditions are afflicting the citizens of the Crystarium, which he claims can be cured through the consumption of certain species of fish. Since the rest of the Facet of Fishing would rather continue using tried-and-true methods for landing the more common varieties, he asks whether you would assist him in securing the catches he seeks. Once you give his suggestion the nod of approval, he offers to make you an honorary member, with full pay for any assignments fulfilled.","Back in the Mean, Frithrik has made the necessary arrangements for you to begin working for the Facet of Fishing. Your first commission is to catch eighteyes eels─a hideous, bloodsucking species─which he believes to be an effective treatment for shadow-blindness. However, the reluctance of the other members to pursue such prey soon becomes abundantly clear, as he warns you the habitat of the eels is also teeming with hordes of vicious predators. Not one to be deterred by the threat of being devoured by slavering beasts, you set off on your first assignment in earnest."],"objectives":["Wait at the designated location in Sullen.","Speak with Frithrik in the Cabinet of Curiosity.","Speak with Frithrik in the Crystalline Mean."],"dialogue":[{"name":"SYSTEM","text":"Upon completing this quest, you will be able to undertake Crystarium Deliveries for the Facet of Fishing. You must be a fisher of level 70 or above to proceed."},{"name":"FRITHRIK","text":"Hullo there, I don't believe I've had the pleasure. You must be here to join the Facet of Fishing, yes?"},{"name":"FRITHRIK","text":"Oh, goodness, that was awfully presumptuous of me! We've had so few applicants recently, I got rather carried away."},{"name":"FRITHRIK","text":"The fishers of the Mean and surrounding villages have made me their representative, you see, although I soon discovered the post to be a little more bothersome than I was expecting."},{"name":"FRITHRIK","text":"I'd much rather be reeling in fish than scrawling numbers in a ledger, but such is life... It's my responsibility to ensure that the citizenry have a steady supply of freshwater and saltwater foodstuffs, which is not a task to be taken lightly."},{"name":"FRITHRIK","text":"You see, while we are able to produce fruits and vegetables within the Crystarium, fish are a little harder to procure."},{"name":"FRITHRIK","text":"The trouble is, we tend to eat the same things, day in, day out, so I've been researching other species that could be used to supplement our diets. In fact, I'll be sharing my latest findings with the other members─ Would you care to join me?"},{"name":"FRITHRIK","text":"Excellent! I'll meet you in Sullen. And look out for fishers casting their lines. There's nothing quite like a hook in the eye to ruin your day!"},{"name":"FRITHRIK","text":"Isn't this wonderful? I never tire of gazing across the Source. Did you know that most of the fish eaten in the Crystarium come from these waters?"},{"name":"FRITHRIK","text":"Unfortunately, my newfound duties prevent me from coming here as often as I'd like."},{"name":"MERVYL","text":"Do my eyes deceive me? Could it be that our illustrious leader has found the time in his busy schedule to pay us a visit? No doubt he'll have more of his “words of wisdom” to impart."},{"name":"FRITHRIK","text":"I wish only to diversify the types of fish delivered to the Crystarium, and for that I need your cooperation, as we discussed before."},{"name":"MERVYL","text":"Diversify!? Are you saying our catches aren't good enough!? I've been earning a living here since you were but a cub, so don't tell me how to do my job!"},{"name":"MERVYL","text":"As for you, I'd advise giving this one a wide berth before he starts filling your head with all sorts of nonsense."},{"name":"MERVYL","text":"He wouldn't even be in charge if it weren't for that one spell of good luck. There are dozens of honest fishers better suited to the position, and none of them would waste their time on wild theories and myths!"},{"name":"MERVYL","text":"You'd have us risking our necks in some wretched hellhole, trying to catch a species that for all we know might not even exist!"},{"name":"MERVYL","text":"We're already providing the people of the Crystarium with all the fish they need, so why change things?"},{"name":"MERVYL","text":"Listen, Frithrik, the best thing you can do is stay out of our way. Why don't you go back to your books while we get on with some real work!?"},{"name":"FRITHRIK","text":"I'm sorry you had to see that."},{"name":"FRITHRIK","text":"It seems that Mervyl is in no mood to hear my proposal. Perhaps you'd be more receptive to my ideas? There's something I'd like to show you, if you're interested."},{"name":"FRITHRIK","text":"What a relief! To be honest, I don't think my heart could bear any more rejection. Anyway, I'll meet you at the Cabinet of Curiosity."},{"name":"FRITHRIK","text":"The only thing I enjoy more than fishing is getting engrossed in a good book. Come to think of it, that's partly the reason why I became representative for the Facet of Fishing in the first place."},{"name":"FRITHRIK","text":"You see, I discovered some long-forgotten methods for increasing the average yield per fisher. I put these techniques to the test and they were even more effective than I could've dreamed!"},{"name":"FRITHRIK","text":"One thing I hadn't taken into account, however, is that the person with the highest number of catches is put in charge for the following season. As fate would have it, that turned out to be me."},{"name":"FRITHRIK","text":"I soon found my new role to be a proverbial poisoned chalice, and the more experienced members rejected my every suggestion, no matter how minor."},{"name":"FRITHRIK","text":"I can understand the desire to maintain the status quo, but I'm afraid that is actually the cause of a much larger problem facing our people."},{"name":"FRITHRIK","text":"Citizens young and old throughout the Crystarium are suffering from a range of potentially serious illnesses."},{"name":"FRITHRIK","text":"Thankfully, most of them don't appear to be contagious, though that merely serves to deepen the mystery of how they are contracted to begin with. After a considerable amount of research, I came to the conclusion that poor diet is to blame in many cases."},{"name":"FRITHRIK","text":"People around here tend to eat what they want, when they want, which leads to them missing vital nutrients contained in the less...appetizing dishes. In other words, these conditions can be cured simply by consuming the right kinds of food."},{"name":"FRITHRIK","text":"For example, eating eighteyes eels is apparently the ideal treatment for the condition known as “shadow-blindness.”"},{"name":"FRITHRIK","text":"Since the Flood, many people have lost the ability to see well in the dark, what little of it there is, but it seems this disease existed long before that."},{"name":"FRITHRIK","text":"Many people lack the ability to see well in the dark, which was until recently believed to have been caused by the unrelenting glare resulting from the Flood, but it seems to have been a common problem long before that."},{"name":"FRITHRIK","text":"This is just one of many afflictions mentioned in these ancient tomes. Most entries have a list of possible treatments, many including the names of certain fish. I intend to catch these and distribute them throughout the Crystarium!"},{"name":"FRITHRIK","text":"Of course, there'll never be enough for everyone unless the rest of the facet cooperates. If only they'd listen to me!"},{"name":"FRITHRIK","text":"To tell the truth, I feel like you're the only one who sees my side of the argument. If you were anything like the others, you'd have told me to bugg─ahem, “go away” by now. Would you be willing to aid me in my endeavors?"},{"name":"FRITHRIK","text":"You would? I...I don't know what to say! Perhaps I should start by making you an honorary member of the Facet of Fishing and giving you an assignment!"},{"name":"FRITHRIK","text":"If we make it official, you'll receive payment for any orders successfully fulfilled. One thing we're not short on is coin, I assure you!"},{"name":"FRITHRIK","text":"Before we can begin, I need to get the necessary paperwork in order, so let's meet back at the Mean. I'll try to have everything ready before you arrive!"},{"name":"FRITHRIK","text":"Now that all the trifling details have been taken care of, you're ready to fulfill your first order!"},{"name":"FRITHRIK","text":"Do you remember the eighteyes eels I mentioned earlier? Well, as it turns out, there are a few shadow-blindness patients who could benefit from adding these bloodsucking, nightmarish creatures to their diet."},{"name":"FRITHRIK","text":"And that's where you come in! I'd like you to catch as many of these as you can."},{"name":"FRITHRIK","text":"Not only will the eels themselves attempt to latch onto your flesh and drain you of your bodily fluids, the area surrounding the lake they inhabit is full of deadly predators. Naturally, they'll try to eat you as well."},{"name":"FRITHRIK","text":"We fishers normally aim to have safety in numbers, but you'll be alone, I'm afraid. But I'm sure a strapping <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">fellow</span></span> like you will be perfectly fine!"},{"name":"FRITHRIK","text":"Remember, though you'll be risking life and limb, those poor souls who struggle to see well in the dark will be overjoyed!"},{"name":"SYSTEM","text":"Facet of Fishing Deliveries are now available. By delivering the requested items to Frithrik and raising yourself in his esteem, you can advance the story of his quest to eradicate a range of diseases from the Crystarium."}],"reward":{"gil":1125},"reqs":{"jobs":[{"lvl":70,"id":155}],"quests":[69191]},"next":[68776]},"partials":[{"type":"npc","id":"1027237","obj":{"i":1027237,"n":"Frithrik","l":2951,"q":3}},{"type":"quest","id":"69191","obj":{"i":69191,"n":"The Crystalline Mean","g":172,"l":"The Crystarium","s":10,"f":1}},{"type":"quest","id":"68776","obj":{"i":68776,"n":"Fishing for Confidence","g":171,"l":"The Crystarium","s":520}}]}