{"quest":{"name":"Fishing for Confidence","location":"The Crystarium","id":68776,"patch":5.0,"sort":520,"eventIcon":71221,"issuer":1027237,"target":1031217,"genre":171,"usedItems":[26750],"journal":["Frithrik appears to have decided on his next project, and the chances of it involving fish are extremely high.","You find Frithrik and Lobb in the midst of discussing the symptoms of an ailing young woman. Unsure of how best to treat her sickness, Frithrik suggests seeking answers at the Cabinet of Curiosity. ","The two fishermen are poring over various tomes when you arrive. Before their research can make further headway, however, they are interrupted by Mervyl, berating the three of you for spending your time reading rather than fishing. As Lobb explains it, Mervyl and many veteran fishermen vividly remember a time when resources were scarce, which is why they oppose any change that may result in fewer fish being caught. He suggests Frithrik leaves his present search for knowledge to the Cabinet's curators, and instead seek out a rare fish that will leave the Mean's fishermen duly inspired. Thus does he make for Il Mheg in pursuit of the elusive calico trout.","Frithrik is glad for your company in Il Mheg. In the hopes of expediting your search for trout, he suggests making it a friendly competition, the winner being the first to deliver a calico trout to Lobb. Much to his surprise, you reel in a catch in record time. He bids you return ahead of him to the Mean, confident he will follow after you shortly with a prize of his own. ","Your calico trout leaves Lobb in awe. If all goes to plan, younger members of the Facet of Fishing will be inspired to take up fishing for more diverse fish as well, leaving Frithrik more time to attend to his administrative duties and earn the respect of fishermen like Mervyl. But first, Lobb reminds him of the task he left to the curators at the Cabinet of Curiosity."],"objectives":["Speak with Frithrik in the Cabinet of Curiosity.","Speak with Frithrik near the House of the First Light.","Deliver a calico trout to Lobb in the Crystalline Mean."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Acht-la Ormh Inn.”"},{"name":"FRITHRIK","text":"<span class=\"highlight\">Forename</span>, you've come at a good time."},{"name":"FRITHRIK","text":"Lobb was telling me about a young woman stricken with a most unusual combination of symptoms."},{"name":"LOBB","text":"She's been having frequent dizzy spells, much like I was. But if that weren't bad enough, there's something wrong with her eyes. The whites have gone all yellow!"},{"name":"FRITHRIK","text":"Yes, as far as I can tell, the dizziness is due to a certain “thinness” of the blood, while the discoloration is a sign of jaundice."},{"name":"LOBB","text":"She's been like this for a long time, and she's understandably reluctant to go outside, which isn't doing her much good, either. Is there something we can do for the lass?"},{"name":"FRITHRIK","text":"Well, those ancient tomes might have something to say on the matter. Lobb, follow me!"},{"name":"FRITHRIK","text":"I have a feeling we'll be needing your help, too!"},{"name":"LOBB","text":"Without your help, I don't think I would ever have recovered. If there's anything you need from me, just say the word."},{"name":"LOBB","text":"When it comes to history and medicine, I'm all at sea!"},{"name":"FRITHRIK","text":"I believe the information we seek should be in this section. Would you mind checking over there?"},{"name":"MERVYL","text":"Bloody hells! So much for peace and quiet..."},{"name":"FRITHRIK","text":"Mervyl, what a surprise to see you here! I never pictured you as much of a reader."},{"name":"MERVYL","text":"I'm not here for my own enjoyment!"},{"name":"MERVYL","text":"And as for you, Lobb, I thought you'd have more sense than to throw in your lot with these two."},{"name":"LOBB","text":"Mervyl, for once in your life, would you shut up and listen? They're the reason why I'm up and walking again. Don't you see? Frithrik was right!"},{"name":"MERVYL","text":"Is that so? Be that as it may, we should leave healing the sick to the professionals!"},{"name":"MERVYL","text":"They've got their duties and we've got ours. Are you fishers or not!?"},{"name":"LOBB","text":"Hmm... He never was one for civilized debate, but he only wants what's best for our people. At least, what he <span class=\"emphasis\">thinks</span> is best, at any rate."},{"name":"LOBB","text":"He's been around long enough to remember the days when starvation was all too real a threat."},{"name":"LOBB","text":"That's why Mervyl and the rest of the old guard are not like to agree with anything that might lead to fewer fish being caught. The younger ones will be more likely to support your cause, though."},{"name":"LOBB","text":"To be honest, I can't see your talk of balanced diets winning their support. But there must be a way to get through to them..."},{"name":"FRITHRIK","text":"I'm sure there will be time to think about that once I've found a treatment for your friend."},{"name":"LOBB","text":"I appreciate what you're doing for her, but why don't we have the curators look for the information instead?"},{"name":"LOBB","text":"In the meantime, we can concentrate on getting some of the other fishers on your side."},{"name":"FRITHRIK","text":"Hmm... I tried that before, but they weren't interested in any of my ideas."},{"name":"LOBB","text":"Can you blame them? They're not culinarians or chirurgeons, they're fishers. I think they'd be a lot easier to persuade if you can prove you're worthy of being their leader."},{"name":"LOBB","text":"Perhaps you could try catching something they've never seen before, like a calico trout. That'd impress them."},{"name":"FRITHRIK","text":"Yes, that might work! Now all we need to do is locate and catch one of the most elusive fish in the history of our art. Hmm... It's no easy feat, that much is certain."},{"name":"FRITHRIK","text":"And to make matters worse, the last known sighting of a calico trout was in Il Mheg, which until now, I have gone to great lengths to avoid."},{"name":"FRITHRIK","text":"Perhaps you could come with me, <span class=\"highlight\">Forename</span>?"},{"name":"FRITHRIK","text":"Since you seem to be on good terms with at least one pixie, they may decide to leave us alone long enough for us to hook our prey."},{"name":"LOBB","text":"Pixies!? Rather you than me! Anyway, once I've asked the curators to lend us a hand with these books, I'll keep an eye on things at the Mean. Someone's got to take care of the place while you're away!"},{"name":"LOBB","text":"Frithrik is already at the waters by the House of the First Light. You'd better catch up before he gets himself into trouble."},{"name":"FRITHRIK","text":"This place is a lot more pleasant than I was expecting, and I haven't been accosted by even one pixie thus far!"},{"name":"FRITHRIK","text":"You don't think they'd play any mean tricks on us, do you?"},{"name":"FRITHRIK","text":"If it's all the same to you, I'd like to catch that fish as soon as possible and get back to the Crystarium."},{"name":"FRITHRIK","text":"We might even be able to get this done more quickly if we make it into a friendly competition. The first one to deliver a calico trout to Lobb is the winner!"},{"name":"FRITHRIK","text":"I'll admit, I can't escape the feeling we're being watched. Is it still paranoia if you're right?"},{"name":"FRITHRIK","text":"Wh-What!? You've already caught one? I thought I'd offer a bit more resistance in our little contest, but I'll be joining you back in the Mean after I've caught one for myself."},{"name":"FRITHRIK","text":"I have a feeling I'll get a bite any moment now!"},{"name":"LOBB","text":"So, how did it go?"},{"name":"LOBB","text":"As I live and breathe! It's...magnificent."},{"name":"FRITHRIK","text":"Lobb! I caught one too!"},{"name":"LOBB","text":"Of course, I'd expect nothing less from the head of the Facet of Fishing!"},{"name":"LOBB","text":"Anyone who doubted you will be put firmly in their place when they see what you've caught."},{"name":"FRITHRIK","text":"I hope you're right. If all goes according to plan, we'll be able to get a few of the younger members to go after the rarer species in your stead."},{"name":"LOBB","text":"Yes, and that'll give me more time to help here with giving assignments and seeing to deliveries, which in turn will make it easier for you to show your face down at the Source a bit more often."},{"name":"LOBB","text":"Mervyl and his cronies will find it a lot harder to ignore you that way. Once they see you're taking care of the day-to-day running of the Facet of Fishing, they're more likely to lend you an ear, and maybe even a hand."},{"name":"LOBB","text":"But before all that, there's a certain young lady in need of help. Maybe the curators have dug up the information we were after?"},{"name":"FRITHRIK","text":"Goodness me! I have to admit that had all but slipped my mind! I'm lucky I have you here to remind me."},{"name":"FRITHRIK","text":"I'll go ahead to the Cabinet of Curiosity, but we'll send word if there is anything that requires your assistance. I shall see you anon!"},{"name":"SYSTEM","text":"The next request will be available from Frithrik upon reaching level 78 as a fisher."}],"reward":{"gil":1295,"items":[{"num":30,"id":12669}]},"reqs":{"jobs":[{"lvl":75,"id":155}],"quests":[68775]},"next":[68777]},"partials":[{"type":"npc","id":"1027237","obj":{"i":1027237,"n":"Frithrik","l":2951,"q":3}},{"type":"npc","id":"1031217","obj":{"i":1031217,"n":"Lobb","l":2951,"q":1}},{"type":"item","id":"12669","obj":{"i":12669,"n":"Hi-Cordial","l":100,"c":20623,"t":44}},{"type":"item","id":"26750","obj":{"i":26750,"n":"Calico Trout","l":406,"c":29300,"t":47}},{"type":"quest","id":"68775","obj":{"i":68775,"n":"Well Eel Be Damned","g":171,"l":"The Crystarium","s":510,"f":1}},{"type":"quest","id":"68777","obj":{"i":68777,"n":"Morsel of the Deep","g":171,"l":"The Crystarium","s":530}}]}