{"quest":{"name":"Morsel of the Deep","location":"The Crystarium","id":68777,"patch":5.0,"sort":530,"icon":100849,"eventIcon":71221,"issuer":1027237,"target":1027237,"genre":171,"usedItems":[26751],"journal":["Frithrik is desperate to find a cure for crysteosis, specifically one that includes fish.","Frithrik's attempts to discover a cure for Hurielle's crysteosis have been largely unsuccessful thus far, with the only clue being a potential link to the disease known as Noble's Rot, which causes similar symptoms. As this illness appears to only affect those living in the lap of luxury, Lobb and Frithrik come to the conclusion that quizzing the residents of Stilltide─a fishing village near the opulent city of Eulmore─might uncover hints as to a potential remedy.","You meet Frithrik near the coastal village of Stilltide, with Eulmore towering high above atop a pillar of rock. Although the nearby wooden shacks are a far cry from the ostentatiously decorated domes and spires of the great city, your companion senses that the knowledge of local fishers will be of use in your search. Frithrik points out an elderly angler who seems likely to have answers to your questions.","The aged fisher reveals that Noble's Rot is indeed prevalent among the residents of Eulmore, and is treated by eating a course of prospero eels. As they seldom venture beyond their habitat in the depths of the ocean, they are only caught in fishing nets by chance when they wander too close to the surface, making it nigh on impossible to hook them using conventional methods. Luckily, the old man is quick to suggest an alternative: the same eels are occasionally brought to market by the Ondo. While they only sporadically make the journey to Eulmore, their aquatic home has a ready supply of the fish you seek, so you decide to make the journey beneath the waves in pursuit of your prey.","You return to the Crystalline Mean to deliver a prospero eel freshly caught in the Tempest. Frithrik wastes no time in preparing a meal to help alleviate the symptoms of Hurielle's illness, although it remains to be seen whether her crysteosis and Noble's Rot are one and the same condition.","The dish is gratefully received and promptly polished off, and Hurielle already appears to be feeling revitalized. The celebrations are soon cut short by the arrival of her father, Mervyl, who demands to know what you and your companions are doing in his daughter's infirmary room. His anger quickly dissolves when he learns of your efforts to save Hurielle, and Frithrik makes a heartfelt plea to put an end to their feud. Mervyl, seeing the error of his ways, buries the hatchet and agrees to cooperate with Frithrik's endeavors. As the tearful father begs for his daughter's forgiveness, the rest of you decide to reconvene at the Crystalline Mean.","Mervyl returns from Hurielle's bedside and vows to give his full support to Frithrik and his revolutionary approach. With such an influential figure devoting himself to the cause, it will not be long before the rest of the Facet of Fishing follows suit. Frithrik's goal of improving the lives of the citizenry through a more varied diet is close to becoming a reality, and his success is due in no small part to your tireless efforts. He offers you his sincerest thanks and wishes you well on your journey."],"objectives":["Speak with Frithrik in Stilltide.","Speak with the wizened fisher.","Deliver a prospero eel to Frithrik in the Crystalline Mean.","Speak with Frithrik in Spagyrics.","Speak with Frithrik in the Crystalline Mean."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Waiting in the Depths.”"},{"name":"FRITHRIK","text":"If you came to hear good news, I've got none to give. We're still no closer to finding a cure for crysteosis."},{"name":"FRITHRIK","text":"Of course, people only started using this name after the appearance of the Crystal Tower, and I have no idea what people called it before then."},{"name":"FRITHRIK","text":"Having said that, the ancient records speak of “Noble's Rot” which has remarkably similar symptoms to Hurielle's illness."},{"name":"FRITHRIK","text":"But as the name implies, it only seems to affect those who lead lives of luxury."},{"name":"FRITHRIK","text":"Since we're not likely to find anyone like that around the Crystarium, it's hard to say whether Noble's Rot and crysteosis are one and the same."},{"name":"LOBB","text":"The only people who you might consider wealthy are those wine-quaffing gluttons over in Eulmore."},{"name":"FRITHRIK","text":"Eulmore! Lobb, you're a genius!"},{"name":"LOBB","text":"Am I? It never occurred to me to go all the way there, though. The chances of them being able to help are slim at best."},{"name":"FRITHRIK","text":"Well, a slim chance is better than none at all. If there is a cure for Noble's Rot, they must have their own way of treating it. Can I ask you to keep an eye on things here for a while?"},{"name":"LOBB","text":"Aye."},{"name":"FRITHRIK","text":"<span class=\"highlight\">Forename</span>, let's head for Stilltide and ask the local fishers."},{"name":"LOBB","text":"I can't believe how far he's willing to go for someone he's never even met. The same goes for you, for that matter."},{"name":"LOBB","text":"Anyway, I think that instead of standing here talking to me, you'd better get your arse over to Stilltide to help Frithrik. And good luck to the both of you!"},{"name":"OLDFISHERMAN03241","text":"Are you with that Ronso lad? I'm not sure what's wrong with him, but he's just been staring out at the sea like some bloody fool!"},{"name":"FRITHRIK","text":"There's something about the ocean that stirs the soul, don't you think?"},{"name":"FRITHRIK","text":"I wonder how many new species of fish are there waiting to be discovered?"},{"name":"FRITHRIK","text":"I've read about all sorts of fantastic aquatic creatures in the tomes, and I look forward to the day I can see them with my own eyes."},{"name":"FRITHRIK","text":"Oh, I do apologize! I was rather lost in thought there. We had better start asking the locals what they know of Noble's Rot. Why don't you try that elderly gentleman over there?"},{"name":"FRITHRIK","text":"That weather-beaten old chap looks like he's seen a few things in his time."},{"name":"OLDFISHERMAN03241","text":"You're not from 'round here, are you? What do you want?"},{"name":"FRITHRIK","text":"We're terribly sorry to bother you, but we were wondering if you knew anything about Noble's Rot."},{"name":"OLDFISHERMAN03241","text":"Ha! That's one name for it! Or as I like to call it, “Rich Bastard's Comeuppance”! Loads of people in Eulmore get it, and they've only got themselves to blame."},{"name":"OLDFISHERMAN03241","text":"All day they sit there, filling their faces with expensive delicacies and drinking themselves senseless. That don't do your body a whole lot of good, so while their bellies grow fatter, the rest of them grows weaker."},{"name":"OLDFISHERMAN03241","text":"Luckily for us down here in Stilltide, the Eulmorans seem to think eating prospero eels cures it. We sometimes find them tangled up in our nets, and they fetch a decent price."},{"name":"FRITHRIK","text":"I see. Tell me, good sir, where can we catch these eels?"},{"name":"OLDFISHERMAN03241","text":"Well, it's hard to say, since it's nigh on impossible to hook one intentionally. Normally, they'd be out of our reach, but they occasionally drift up from the depths. There's no telling how long it'll be before we snag another one."},{"name":"OLDFISHERMAN03241","text":"I've seen a few at market before, though. Some elf boy opened up trade between Eulmore and the Ondo, who sometimes bring prospero eels to sell."},{"name":"OLDFISHERMAN03241","text":"But even they don't seem to catch many, and it's not often they make the journey here. Their merchants came by quite recently, which means it'll be a while before we see them again."},{"name":"FRITHRIK","text":"Hmm... It would seem we've reached something of a dead end."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Leave it to me."},{"name":"A1","text":"Those eels are no match for the power of friendship!"},{"name":"A1","text":"If they live at the bottom of the ocean, that's where I'll go."},{"name":"FRITHRIK","text":"All right, if you say so! Just don't do anything dangerous."},{"name":"FRITHRIK","text":"Ha ha! I shan't even pretend to know what you're talking about, but you certainly seem confident. And that's the most important thing, isn't it?"},{"name":"FRITHRIK","text":"My word! Your commitment never ceases to amaze me. But are you sure it's not too much to ask?"},{"name":"FRITHRIK","text":"Glad to hear it! I'll be back at the Mean trying to find the best way to cook the eels. Apparently, it's all too easy to botch it and turn them into something resembling “the regurgitated contents of a seagull's stomach,” to quote the book."},{"name":"FRITHRIK","text":"I'm sure the treatment will be a lot more effective if our patient can keep it down!"},{"name":"OLDFISHERMAN03241","text":"Hmph! It's a fool's errand, if you ask me, but I heard that the Ondo use moyebi shrimp as bait. Might be worth a try."},{"name":"OLDFISHERMAN03241","text":"But if your travels take you to the ocean depths, you'd better be damned careful. I hear there are ancient creatures down there that even survived the Flood of Light."},{"name":"OLDFISHERMAN03241","text":"Beasts that old and that tough won't hesitate to snap up any tasty treats that come their way, including careless fishers. Go if you must, but don't say I didn't warn you!"},{"name":"FRITHRIK","text":"Consider your warning well and truly heeded!"},{"name":"SYSTEM","text":"It appears that the prospero eels you seek inhabit the Tempest. You may be able to catch them at the Norvrandt Slope."},{"name":"OLDFISHERMAN03241","text":"A fisher I may be, but I dread to think what lurks at the bottom of the ocean."},{"name":"LOBB","text":"If you've caught any prospero eels, you'd best give them to Frithrik. He'll take care of cleaning and cooking them."},{"name":"FRITHRIK","text":"Welcome back! In all honesty, you'd been gone so long, I thought something dreadful had happened. So, any luck?"},{"name":"FRITHRIK","text":"Argh! It's repulsive! But more importantly, it appears to be a fine specimen, and is no doubt bursting with nutrition. Now all that remains is to follow the recipe and serve it to Hurielle."},{"name":"LOBB","text":"I'll go ahead to Spagyrics and tell her the meal is on its way. Let's hope she's got a good appetite!"},{"name":"FRITHRIK","text":"I'm actually something of a dab hand in the kitchen, but it will require all of my culinary abilities to make such a grotesque fish look presentable."},{"name":"FRITHRIK","text":"It'll take a while to cook, so perhaps we can meet at Spagyrics a little later?"},{"name":"LOBB","text":"Frithrik got here just before you did, carrying the dish he'd prepared himself. I knew he was a man of many talents, but I never realized that cooking was one of them."},{"name":"HURIELLE","text":"Oh, you must be <span class=\"highlight\">Forename</span>. It's a pleasure to finally meet you. I hear you have caught an eel to cure my illness."},{"name":"FRITHRIK","text":"While we won't see any immediate effects, I'm interested to see what she makes of the flavor."},{"name":"LOBB","text":"How was it?"},{"name":"HURIELLE","text":"Delicious! But is this truly the key to overcoming my illness?"},{"name":"FRITHRIK","text":"It's still too soon to be sure, but providing our theories are correct, your symptoms should gradually improve if you continue with the treatment."},{"name":"HURIELLE","text":"I must say, it's a lot more appetizing than any of the medicines I'd been given until now!"},{"name":"MERVYL","text":"You! Get away from my daughter, this instant!"},{"name":"HURIELLE","text":"Father, what's wrong!? Aren't these your friends from the facet?"},{"name":"HURIELLE","text":"They brought me a meal to help cure my crysteosis!"},{"name":"MERVYL","text":"I worked my fingers to the bone to pay for her medicine, and you think you can do better!?"},{"name":"LOBB","text":"These kinds of diseases are caused by an improper diet. The dish <span class=\"highlight\">Forename</span> and Frithrik put together is meant to give her what she's been missing."},{"name":"FRITHRIK","text":"Yes, and this is based on our research at the Cabinet of Curiosity, where we found that crysteosis is essentially the same as a disease known as Noble's Rot."},{"name":"FRITHRIK","text":"The condition is common among Eulmorans, who use prospero eel as a treatment. That's why we brought some for Hurielle to try."},{"name":"MERVYL","text":"And you're using my daughter as a test subject for your madcap theories!?"},{"name":"FRITHRIK","text":"There's nothing madcap about eating a balanced diet, and your daughter was as keen as anyone to try this new approach."},{"name":"FRITHRIK","text":"Of course, Hurielle isn't the only one suffering from crysteosis, and we'll need a lot more prospero eels."},{"name":"FRITHRIK","text":"We were lucky to have <span class=\"highlight\">Forename</span> here, but we can't expect <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to keep catching them indefinitely."},{"name":"FRITHRIK","text":"Lobb and I can't do this by ourselves. We need experienced fishers like you, Mervyl. Please, help us."},{"name":"MERVYL","text":"You did all of this for Hurielle, even after everything I said..."},{"name":"FRITHRIK","text":"And we'll continue to do so, perhaps with you there to lend a hand."},{"name":"MERVYL","text":"Yes, of course. If you'll have me."},{"name":"MERVYL","text":"Hurielle! You'll be out of here soon, I promise!"},{"name":"FRITHRIK","text":"Come on, let's return to the Mean. I'm sure they have a lot to discuss."},{"name":"HURIELLE","text":"Dad, stop fussing─ I said I'm fine!"},{"name":"MERVYL","text":"All this time, you were working to save my daughter... I had no idea."},{"name":"LOBB","text":"Now we need to secure a regular supply of prospero eels without affecting the overall amount of produce. Easier said than done, but if we have the rest of the facet on our side, I think we can do it."},{"name":"FRITHRIK","text":"I'm pleased we were finally able to get through to Mervyl. Though if Lobb hadn't been so discreet, our efforts may have seemed like a shallow attempt to use Hurielle's illness to manipulate her father."},{"name":"FRITHRIK","text":"He acted out of a genuine desire to help her, which will continue to be the driving force behind our efforts."},{"name":"FRITHRIK","text":"Ah, Mervyl. How's Hurielle?"},{"name":"MERVYL","text":"A lot better, thanks to you."},{"name":"MERVYL","text":"So much so that she told me to stop fussing over her and give you <span class=\"alternative-container\"><span class=\"alternative\">lot</span><span class=\"alternative\">lads</span></span> a hand."},{"name":"FRITHRIK","text":"Ha ha! It's good to hear she's in high spirits."},{"name":"FRITHRIK","text":"As for getting on with some work for the facet, Lobb has a few special assignments, if you're interested."},{"name":"FRITHRIK","text":"You just try and stop me! Watch out fish, here I come!"},{"name":"FRITHRIK","text":"It's incredible to think how much has changed. With everyone working towards a common goal, things should go a lot more smoothly from now on."},{"name":"FRITHRIK","text":"Having said that, I can't help wondering what would've happened if you and Lobb hadn't been there to guide me."},{"name":"FRITHRIK","text":"Ha! I'd probably still be butting heads with Mervyl and the others, which hardly bears thinking about."},{"name":"FRITHRIK","text":"But it's not only me you've helped, it's everyone in the Crystarium. Once they get into better eating habits, they'll be much healthier─and happier─as a result."},{"name":"FRITHRIK","text":"We in the Facet of Fishing will be doing our utmost to follow the fine example you've set. While I appreciate that you have your own path to walk, your own challenges to face, you will be sorely missed."},{"name":"FRITHRIK","text":"If you're ever in the Crystarium, we'd love to hear stories from your travels. All the best, my friend!"},{"name":"SYSTEM","text":"Frithrik is eternally grateful for your efforts. He now considers you a <span class=\"highlight\">Warrior of Water</span>!"},{"name":"SYSTEM","text":"There may be other folk in the Crystalline Mean who could use the assistance of a talented artisan. Ask around, and see who is in need of your skills."},{"name":"SYSTEM","text":"You have completed all the deliveries currently available. When you have a spare moment, it seems Katliss would like to have a word with you."},{"name":"SYSTEM","text":"Return to visit the Crystalline Mean once you have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"You have completed all the deliveries currently available. When you have a spare moment, it seems Katliss would like to have a word with you."},{"name":"SYSTEM","text":"Visit her at the main reception counter in the Crystalline Mean."}],"reward":{"gil":2027,"items":[{"num":2,"id":26732},{"num":2,"id":26733},{"num":2,"id":26734}]},"reqs":{"jobs":[{"lvl":80,"id":155}],"quests":[68776]}},"partials":[{"type":"npc","id":"1027237","obj":{"i":1027237,"n":"Frithrik","l":2951,"q":3}},{"type":"item","id":"26732","obj":{"i":26732,"n":"Gatherer's Guerdon Materia VIII","l":430,"c":20277,"t":58,"materia":{"tier":7,"value":20,"attr":"Gathering","category":2}}},{"type":"item","id":"26733","obj":{"i":26733,"n":"Gatherer's Guile Materia VIII","l":430,"c":20277,"t":58,"materia":{"tier":7,"value":20,"attr":"Perception","category":2}}},{"type":"item","id":"26734","obj":{"i":26734,"n":"Gatherer's Grasp Materia VIII","l":430,"c":20277,"t":58,"materia":{"tier":7,"value":9,"attr":"GP","category":2}}},{"type":"item","id":"26751","obj":{"i":26751,"n":"Prospero Eel","l":430,"c":29205,"t":47}},{"type":"quest","id":"68776","obj":{"i":68776,"n":"Fishing for Confidence","g":171,"l":"The Crystarium","s":520}}]}