{"quest":{"name":"Where We Belong","location":"The Crystarium","id":68770,"patch":5.0,"sort":320,"eventIcon":71221,"issuer":1027235,"target":1027235,"genre":169,"usedItems":[27252,27253],"journal":["Bethric has news to share with you."],"objectives":["Check on Skip at Temenos Rookery.","With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “everything will be fine” to comfort Skip.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize an offering of sweets <img class=\"hq-icon small\" src=\"images/item/hq.png\"></span><span class=\"alternative\">Deliver the offering of sweets <img class=\"hq-icon small\" src=\"images/item/hq.png\"> to Bethric</span></span>.","Speak with Bethric at Lydha Lran in Il Mheg.","Speak with Bethric.","Speak with Bethric at the Crystalline Mean in the Crystarium."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Acht-la Ormh Inn.” "},{"name":"BETHRIC","text":"No doubt you're eager to learn how Skip is doing."},{"name":"BETHRIC","text":"Well, I'm happy to report that, thanks to your efforts and the care of our stablehands at Temenos Rookery, he's made a near-full recovery."},{"name":"BETHRIC","text":"Physically, at least. The wounds of his heart yet remain. He sits about the stables brooding, avoiding contact with me, Knem, even the other amaro. "},{"name":"BETHRIC","text":"Before there can be any deliberation on whether he remain here or be released back to the wild, I must ensure he is sound in both body <span class=\"emphasis\">and</span> mind. "},{"name":"BETHRIC","text":"For that, I must once again ask for your help."},{"name":"BETHRIC","text":"I am loath to admit it, but you are the only one to whom Skip has shown any manner of affection...<br>Not that I'm jealous, mind you. Merely an observation."},{"name":"BETHRIC","text":"The poor boy barely even eats. Though I do recall he was quite willing to partake of the medicine you provided. And the way you gazed into each other's eyes as if he... "},{"name":"BETHRIC","text":"Ahem. My point is, I believe he would be willing to emerge from his seclusion for you. Would you try talking to him, and see if he responds?"},{"name":"BETHRIC","text":"He will answer your call. I'm sure of it."},{"name":"KNEMCHELEIMIN","text":"Thank you for coming. Your presence at the rookery seems to have a way of lifting his spirits."},{"name":"SKIP","text":"...Khrrr? Khrrr!"},{"name":"SKIP","text":"...Khrrr? Khrrr!"},{"name":"BETHRIC","text":"My goodness. To simply look at you seems to set his heart aflutter!"},{"name":"BETHRIC","text":"Now that you have his attention, could you assure him that <span class=\"highlight\">everything will be fine</span>?"},{"name":"SAYTODO","text":"everything will be fine"},{"name":"BETHRIC","text":"Please assure him that <span class=\"highlight\">everything will be fine</span>. He has all but ignored us, but I believe he will listen to you. "},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “everything will be fine” and soothe the amaro."},{"name":"BETHRIC","text":"It's...it's as if he's become a different creature altogether! He looks so happy, so carefree."},{"name":"BETHRIC","text":"Perhaps now I too can get through to him."},{"name":"BETHRIC","text":"Skip!"},{"name":"BETHRIC","text":"..."},{"name":"BETHRIC","text":"Still he regards me with that icy gaze. After all we have done to nurse him back to health, why is it only you to whom he shows affection?"},{"name":"BETHRIC","text":"There is no denying that it was you who prepared the medicine that treated his poison, and I have no doubt Skip is aware of that fact. But surely there is more to his fondness for you than that. "},{"name":"BETHRIC","text":"Perhaps it has to do with the amaro's innate predisposition to magic. It is what allows them to sense the aether of others, though nowhere near as strongly as their ancestors. "},{"name":"BETHRIC","text":"Indeed, so in tune were the amaro of eld with their riders they were often said to be of one mind. I can but wonder how such a pairing from an early age would influence cognitive development. Or if their breeder might─"},{"name":"BETHRIC","text":"Ah, there I go getting carried away again. What was I saying? Right, Skip's predisposition to magic. Perhaps he can sense your aether more strongly than ours, thereby giving him a greater understanding of your concern for his well-being."},{"name":"BETHRIC","text":"Despite the lengths we have gone to heal his body, without you, I daresay we would never be able to heal his heart."},{"name":"BETHRIC","text":"Yet there still remains the matter of whether we keep Skip here at the Crystarium or return him to the wilds."},{"name":"BETHRIC","text":"I only want what's best for him, but I fear my decision will not be in line with what <span class=\"emphasis\">he</span> desires."},{"name":"BETHRIC","text":"&lt;sigh&gt; Oh Skip, if only you could speak to us."},{"name":"Q1","text":"What will you say?"},{"name":"Q1","text":"Well, if it's a talking amaro you need..."},{"name":"Q1","text":"I know of an amaro that could interpret for him."},{"name":"BETHRIC","text":"You're acquainted with a <span class=\"emphasis\">talking</span> amaro? Truly!? Oh, be still my beating heart. "},{"name":"BETHRIC","text":"There is a name for such beasts in the Ronkan language: Tupaq Amaro, the paragons of their kind. I never dared to dream meeting one would be possible..."},{"name":"BETHRIC","text":"What a time to be alive!!!"},{"name":"BETHRIC","text":"Please, <span class=\"highlight\">Forename</span>, I beg you: take me now! Take me to Wolekdorf─to amaro paradise! "},{"name":"BETHRIC","text":"Er, that is to say... We must take Skip! Yes, that we might discern what it is that he wishes to do. "},{"name":"BETHRIC","text":"Of course, this means we must traverse through Il Mheg, home of the pixies... Do you suppose they would grant us passage? "},{"name":"BETHRIC","text":"Somehow it doesn't surprise me that you've befriended them. Still, I think it would be best to err on the side of caution. "},{"name":"BETHRIC","text":"You must prepare a tribute for me and Skip."},{"name":"BETHRIC","text":"Please, <span class=\"highlight\">Forename</span>. We are strangers to the pixies. It is the surest way for me and Skip to appease them."},{"name":"BETHRIC","text":"Thank you. Thank you so much. I promise I'll make this up to you one day. "},{"name":"BETHRIC","text":"If there's anything you need, speak with Knem and she will take care of the rest."},{"name":"KNEMCHELEIMIN","text":"Come for supplies, have you? Here you are."},{"name":"KNEMCHELEIMIN","text":"I pray this offering works. Those faeries are a fickle lot."},{"name":"BETHRIC","text":"Skip and I are counting on you, <span class=\"highlight\">Forename</span>. "},{"name":"BETHRIC","text":"Goodness gracious. I've never seen such brilliant craftsmanship! I may be tempted to partake before we reach our destination."},{"name":"BETHRIC","text":"I jest, I jest. Now, before we reach our final destination, we're to make a stop in Lydha Lran, yes?"},{"name":"BETHRIC","text":"Fear not, <span class=\"highlight\">Forename</span>. Skip is in fine health, and I have no doubt he would travel near anywhere with you at his side."},{"name":"BETHRIC","text":"Let's be off then, to Il Mheg!"},{"name":"SKIP","text":"Khrrr..."},{"name":"KNEMCHELEIMIN","text":"Bethric tells me you will take Skip to Wolekdorf. Safe travels, friend."},{"name":"BETHRIC","text":"There you are. The pixies were quite pleased with our tribute. They've even promised we won't have to take part in any of their games. “Pixie's honor,” they said. "},{"name":"BETHRIC","text":"Not that I don't trust them, but I'd rather not stay around overlong in case they should change their minds."},{"name":"BETHRIC","text":"Wolekdorf! It's so much more beautiful than I could have ever imagined!"},{"name":"AMARO03234","text":"Lugg Lugg? Why have you returned so soon?"},{"name":"SKIP","text":"..."},{"name":"BETHRIC","text":"Lugg Lugg...? Ah, that must be Skip's true name. But wait. That would mean he was raised here, wouldn't it? "},{"name":"AMARO03234","text":"Why do you not answer? Are you hurt?"},{"name":"BETHRIC","text":"Forgive me for interrupting, but Skip has been in my care for some time now, and I can assure you he cannot speak."},{"name":"SKIP","text":"..."},{"name":"AMARO03234","text":"Hmmm. It would appear a terrible trauma has caused him to withdraw into silence. If you know aught of what happened to him, I would hear it. "},{"name":"AMARO03234","text":"I see..."},{"name":"BETHRIC","text":"We thought perhaps you might offer insight into what it is he wishes to do."},{"name":"AMARO03234","text":"I sense great turmoil within his heart. He has ever loved the children of man, but now that love gives way to fear."},{"name":"AMARO03234","text":"He had a companion once. Long, long ago. Together they left their home behind and traveled the world, and it was that shared love of adventure that led them here to Norvrandt, sparing them from the Flood."},{"name":"AMARO03234","text":"The Light robbed Lugg of his home, and the passage of time, his companion. He wandered the land alone until eventually he happened upon Wolekdorf. We took him in, raised him as kin, and offered him guidance when he came of age."},{"name":"AMARO03234","text":"He has lived with us for over a century. Yet seldom does he speak his mind to me or the others. His reclusive nature has proven troublesome at times, but I know he means well."},{"name":"AMARO03234","text":"All these years and still he mourns the loss of his companion, of the lives they touched on their adventures. "},{"name":"AMARO03234","text":"As to why he might have left, I can but assume he sensed someone or something familiar to him, reminiscent of his past life. "},{"name":"BETHRIC","text":"I think it may have been you that drew him away from Wolekdorf."},{"name":"AMARO03234","text":"Oh, Lugg... You sought man's companionship, but instead found his cruelty."},{"name":"AMARO03234","text":"I thank you both for keeping him safe, but I must ask that you leave him here. We will take good care of him, I promise you. "},{"name":"SKIP","text":"..."},{"name":"BETHRIC","text":"&lt;sniffle&gt; Parting is such sweet sorrow, but there will come a day when we meet again, Skip. Be well, my friend."},{"name":"BETHRIC","text":"Let's hurry back to the Crystarium. If we stay any longer, I fear I may never want to leave."},{"name":"SKIP","text":"Khrrr..."},{"name":"AMARO03234","text":"Are you certain, Lugg?"},{"name":"AMARO03234","text":"You have been through a terrible ordeal, this is true, but there is still good in this world. I would hazard you understand this better than most. "},{"name":"AMARO03234","text":"This is not a decision to be made lightly."},{"name":"SKIP","text":"..."},{"name":"SKIP","text":"Khrrr..."},{"name":"AMARO03234","text":"（★未使用／削除予定★）"},{"name":"BETHRIC","text":"<span class=\"highlight\">Forename</span>! The most amazing thing has happened!"},{"name":"BETHRIC","text":"It's Skip─er, I mean Lugg! He's returned to the rookery! "},{"name":"BETHRIC","text":"Or was I dreaming... You don't suppose this could be some cruel trick of the pixies, do you? "},{"name":"KNEMCHELEIMIN","text":"It warms my heart to see Skip returned to the Crystarium, but did you not leave him at Wolekdorf?"},{"name":"SKIP","text":"..."},{"name":"SYSTEM","text":"The next request will be available from Bethric upon reaching level 78 as an alchemist or culinarian."}],"reward":{"gil":1723,"items":[{"num":250,"id":12},{"num":250,"id":13}]},"reqs":{"jobs":[{"lvl":75,"id":153}],"quests":[68769]},"next":[68771]},"partials":[{"type":"npc","id":"1027235","obj":{"i":1027235,"n":"Bethric","l":2951,"q":3}},{"type":"item","id":"27252","obj":{"i":27252,"n":"Sweets Ingredients","l":406,"c":26110,"t":63}},{"type":"item","id":"27253","obj":{"i":27253,"n":"Offering of Sweets","l":406,"c":25997,"t":63}},{"type":"quest","id":"68769","obj":{"i":68769,"n":"Friends of a Feather","g":169,"l":"The Crystarium","s":310,"f":1}},{"type":"quest","id":"68771","obj":{"i":68771,"n":"Healing Old Wounds","g":169,"l":"The Crystarium","s":330}}]}