{"quest":{"name":"On the Trail of a Myth","location":"The Crystarium","id":68772,"patch":5.0,"sort":410,"icon":100848,"unlocksFunction":1,"eventIcon":71341,"issuer":1027236,"target":1027236,"genre":170,"journal":["Qeshi-Rae looks like she wants to be anywhere but here.","A brief moment with Qeshi-Rae gives you the impression that she is more interested in a creature known as the samiel than she is in her duties. No sooner does she set out to continue her search for the beast than a woman comes seeking her out. Breathless, she introduces herself as Yalana of the Hortorium and her quarry as Chief Qeshi-Rae of the Facet of Gathering, and entreats you to go and find the latter before she can venture outside the Crystarium.","You manage to catch Qeshi-Rae before she can fly off on an amaro. Crestfallen at having had her excursion thwarted, she turns her steps towards the Hortorium to face Yalana's displeasure, and you set off after her.","As a token of her thanks for finding Qeshi-Rae, Yalana tells you about the work of the Hortorium. She and her fellow researchers primarily conduct agricultural research to improve the Crystarium's ability to cultivate crops, and on the side analyze rare and unusual materials at the behest of the Facet of Gathering. With a gravity that seems at odds with her prior demeanor, Qeshi-Rae explains that the task of the facet isn't simply to gather; it also strives to identify and manage resources, that they might be conserved for posterity. When the discussion turns into a chastisement of Qeshi-Rae, the Mystel takes it as her cue to leave, and she flees to the Crystalline Mean, urging you to come with her.","Qeshi-Rae relates to you her quest to find the samiel, which she explains is an ancient and enormous beast of Mord legend. Convinced that you share her passion, she names you captain of the spontaneously formed Samiel Search Squad and bids you find and bring her evidence of the creature."],"objectives":["Speak with Qeshi-Rae.","Speak with Yalana.","Speak with Qeshi-Rae."],"dialogue":[{"name":"SYSTEM","text":"Upon completing this quest, you will be able to undertake Crystarium Deliveries for the Facet of Gathering. You must be a miner or botanist of level 70 or above to proceed."},{"name":"QESHIRAE","text":"Yes, yes, what do you need? Every man and his amaro wants something today, so I'd thank you to make it quick."},{"name":"QESHIRAE","text":"Oh, not here for materials? What <span class=\"emphasis\">are</span> you here for, then?"},{"name":"QESHIRAE","text":"Well, I didn't actually ask for a name...but all right, <span class=\"highlight\">Forename Surname</span>, whoever you are.<br>...What, did you expect me to know you? Because I don't. You're clearly new here. Where are you from, anyway?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"From the same land as the Exarch."},{"name":"A1","text":"From a place called Eorzea."},{"name":"QESHIRAE","text":"Truly! I've always wanted to ask the Exarch about his mysterious homeland, but he's a very busy man and there never seems to be a good time."},{"name":"QESHIRAE","text":"Eorzea? I'm not familiar with such a town. Perhaps it's a local rendering of the name."},{"name":"QESHIRAE","text":"So, tell me─in this land you hail from, does there happen to be a creature called the samiel?"},{"name":"QESHIRAE","text":"No? That's a shame..."},{"name":"QESHIRAE","text":"Well, time for me to take to the field once more! I'll find you yet, my precious samiel! Mark my words!"},{"name":"YALANA","text":"(-???-)Chief, where are you─ Wait just a─<br>Y-You there, stop that woman!"},{"name":"YALANA","text":"(-Diminutive Damsel-)&lt;huff&gt; &lt;puff&gt; Begging your pardons, but did the chief mention where she was headed?"},{"name":"YALANA","text":"(-Diminutive Damsel-)Outside again!? Doesn't she know how much trouble she causes when she abandons her post!?"},{"name":"YALANA","text":"&lt;sigh&gt; Forgive me, it's not my intent to take it out on you. I'm Yalana of the Hortorium, and the woman I'm furious with is Chief Qeshi-Rae of the Facet of Gathering."},{"name":"YALANA","text":"Seeing as we've only just met, I'm loath to ask this of you, but could you go after the chief? I'm afraid I don't have the wind to give chase..."},{"name":"YALANA","text":"In all likelihood, she's headed to the Amaro Launch. If you hurry, you might be able to catch her before she leaves the Crystarium and goes off to heavens know where."},{"name":"YALANA","text":"Thank you so much! When you find her, please see that she comes to the Hortorium. Meanwhile, I'll keep an eye out nearby just in case."},{"name":"QESHIRAE","text":"Oh, it's you again. What do you need now? Wait, don't tell me: you wish to assist with my fieldwork, isn't that right? Well, who am I to deny such enthusiasm? Come along, my friend, come along!"},{"name":"QESHIRAE","text":"Gah, of all the people to see me leave, it had to be Yalana... I wasn't even planning to be away long. &lt;sigh&gt; All right, all right, I'll head to the Hortorium."},{"name":"QESHIRAE","text":"You're coming too, of course? I'm sure Yalana will want to thank you for doing a fine job of catching me."},{"name":"QESHIRAE","text":"If glares could kill, I'd be dead thrice over."},{"name":"YALANA","text":"Ah, there you are! Thank you so much for finding the chief!"},{"name":"YALANA","text":"Now, we don't have much to offer in the way of hospitality, but as a small token of my gratitude, I'd be happy to tell you about our facility."},{"name":"YALANA","text":"Here at the Hortorium, we primarily conduct agricultural research to improve our ability to cultivate crops. On any given day, you'll find us developing new plant strains and fertilizers and experimenting with new cultivation techniques."},{"name":"YALANA","text":"The fruits of our labors find use at Sweetsieve, the Crystarium's orchard, which provides food for our citizens."},{"name":"YALANA","text":"At the behest of the Facet of Gathering, we also analyze resources found across Norvrandt."},{"name":"QESHIRAE","text":"Indeed, indeed. Our miners and botanists sometimes make unusual finds, and these are brought here for closer examination."},{"name":"QESHIRAE","text":"You see, the task of the Facet of Gathering isn't simply to gather. We also strive to identify and manage resources."},{"name":"QESHIRAE","text":"In a world such as ours, we must use our resources responsibly, that they might be conserved for posterity."},{"name":"QESHIRAE","text":"In a sense, what we do is not unlike the work of those folk called naturalists in the days before the Flood."},{"name":"QESHIRAE","text":"This stands testament to man's enduring and unquenchable desire to cast light upon the unknown, be it flora or fauna or otherwise. Ahahaha... AHAHAHAHA!"},{"name":"YALANA","text":"As you can see, the chief is...something of a character. But in spite of her oddities, she's respected by her colleagues and peers."},{"name":"YALANA","text":"This is because her knowledge is vital in ensuring that the Crystarium is well provisioned."},{"name":"YALANA","text":"Though, from my perspective, it's difficult to see her as little more than a self-absorbed woman who buries us with endless tasks."},{"name":"YALANA","text":"When I sought her out earlier, it was to deliver the results of our latest analysis. But what should I find but her trying to sneak outside!"},{"name":"YALANA","text":"It's not the first time either. Of late she's been obsessed with finding the samiel, a nigh-mythical creature, and runs off whenever my back is turned. She's not a child anymore, for goodness' sake..."},{"name":"QESHIRAE","text":"And you're not my mother! If you keep up that nagging, your wrinkles are liable to grow wrinkles!"},{"name":"QESHIRAE","text":"Come, <span class=\"highlight\">Forename</span>, let's flee this place, else Yalana will turn us into fertilizer!"},{"name":"YALANA","text":"Running off again!? And I have no wrinkles, thank you very much!"},{"name":"YALANA","text":"Just to be clear, I do not turn people into fertilizer!"},{"name":"QESHIRAE","text":"Hah, we managed to escape the harpy's clutches!<br>...Don't tell Yalana I said that. She has no sense of humor, nor does she understand the romance of a mythical creature."},{"name":"QESHIRAE","text":"Now then, you weren't familiar with the samiel, as I recall. It's the name of an ancient and enormous beast of Mord legend."},{"name":"QESHIRAE","text":"How enormous, you ask? If you've been to Amh Araeng, you may have seen a colossal rib cage. That's how enormous it is...assuming it indeed belonged to the samiel. We're still not certain at this stage."},{"name":"QESHIRAE","text":"You see, while there are tales of people being licked or nearly stepped on, rather bafflingly, no one alive has managed to catch sight of the creature."},{"name":"QESHIRAE","text":"Until now, at any rate! While attending an excavation, one of the Hortorium's researchers claims to have encountered what he believed was the samiel! I have a good feeling about this!"},{"name":"QESHIRAE","text":"Ahhh, the mere thought of shedding light on this mystery sets your heart aflutter, does it not? But of course it does, and you wish to find the samiel as much as I do!"},{"name":"QESHIRAE","text":"Very well, I hereby name you Captain <span class=\"highlight\">Surname</span> of the Samiel Search Squad! With your combination of combat and gathering prowess, I'm confident you'll do an excellent job─especially with me as your intelligence officer."},{"name":"QESHIRAE","text":"Lest you worry that Yalana will come nagging, know that our mission is entirely serious and within the scope of the facet's objectives. After all, knowledge of fauna─and all fauna are real until proven otherwise─is critical to resource management."},{"name":"QESHIRAE","text":"But without further ado, my dear captain, I bid you venture forth to Amh Araeng, where you are to search for evidence of the samiel. I await your discoveries with bated breath!"},{"name":"SYSTEM","text":"Facet of Gathering Deliveries are now available. By delivering the requested items to Qeshi-Rae and raising yourself in her esteem, you can advance the story of the search for the samiel."}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":154}],"quests":[69191]},"next":[68773]},"partials":[{"type":"npc","id":"1027236","obj":{"i":1027236,"n":"Qeshi-Rae","l":2951,"q":3}},{"type":"quest","id":"69191","obj":{"i":69191,"n":"The Crystalline Mean","g":172,"l":"The Crystarium","s":10,"f":1}},{"type":"quest","id":"68773","obj":{"i":68773,"n":"Shedding Light on the Myth","g":170,"l":"The Crystarium","s":420}}]}