{"quest":{"name":"The Man with Too Many Scars","location":"The Crystarium","id":68779,"patch":5.0,"sort":101,"icon":100867,"unlocksFunction":1,"eventIcon":71341,"issuer":1029900,"target":1029889,"genre":179,"journal":["The tall dark stranger is regarding you with a mixture of curiosity and approval.","Granson, a bounty hunter by trade, has resolved to hunt Dikaiosyne, one of the so-called Cardinal Virtues─exceptionally powerful sin eaters born from the fallen Warriors of Light. Though Granson suspects you have what it takes to help him track down and slay the eater who adopted the guise of the knight Branden, he nevertheless wishes to put your skills to the proof with a simple trial to be held outside the Crystarium.","Lakeland has no shortage of wandering sin eaters, and so Granson bids you dispatch one or two while he observes. Surely one will come along soon...","You are not kept waiting long, and with a flourish you cut down your prey. At a glance, the bounty hunter appears to be pleased, but looks can be deceiving.","Alas, Granson requires confirmation that your victory was not a fluke. Another survey and another killing are in order.","Fortunately, you are rather well versed in the ways of war. After repeating your previous feat, the bounty hunter cannot possibly impose upon you for further proof...","Blessedly, Granson is at last satisfied that you are the dab hand he took you for. He invites you to return to the Crystarium where you may at last finalize the terms of your arrangement.","And so it is that you and Granson formally enter into a pact to hunt the dread eater Dikaiosyne. Needless to say, such endeavors require sufficient preparation before they can be commenced, and this is no exception...<br><br>※The next role quest will be available from Granson upon reaching level 72 in any tank class."],"objectives":["Rendezvous with Granson in Lakeland.","Stand watch for sin eaters.","Speak with Granson.","Stand watch for sin eaters.","Speak with Granson.","Speak with Granson in the Crystarium."],"dialogue":[{"name":"GRANSON","text":"Can't say I've chatted with you before. Think I'd remember if I had. Seen your fair share of fighting, have you?"},{"name":"GRANSON","text":"And wary besides, heh. Rest assured I've no secret designs. Name's Granson. Bounty hunter by trade, mostly sin eaters."},{"name":"GRANSON","text":"When I first laid eyes on you, I had a feeling you were a tough bastard. The sort that must get mistaken for that “Warrior of Darkness” folks've been talking about recently. That right?"},{"name":"GRANSON","text":"Easy, killer. I couldn't care less who you are or what you've done. The only thing I'm looking for these days is a like-minded partner. Someone willing to join me in the hunt for the biggest prize this side of Norvrandt."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Prize, you say?"},{"name":"A1","text":"I'd hear the details first."},{"name":"GRANSON","text":"Heh, thought that'd grab your attention. Dikaiosyne's the fiend I'm after─one of the so-called “Cardinal Virtues” as folks are wont to call 'em."},{"name":"GRANSON","text":"There were hopes that somehow the death of Vauthry and the Wardens might've put an end to Dikaiosyne, but alas no. Seems the rules that bind other sin eaters don't apply to the Virtues."},{"name":"GRANSON","text":"Former Warriors of Light─the esteemed “heroes” who saved the realm a century ago. Dear ol' Branden was one of them, I'm told. Stop me if you've heard all this before."},{"name":"GRANSON","text":"Anyway, like his comrades, Branden died in the process, only to return relatively recently as a sin eater. The better to torment we few who survived their mercy. Needless to say, I aim to put an end to all that."},{"name":"GRANSON","text":"You've heard the pitch, so what's the answer? You interested in hunting Dikaiosyne with me?"},{"name":"GRANSON","text":"Not a whit of hesitation. I like you, sinner. Nevertheless, I'll need you to humor me and prove you're the dab hand I think you are. For my sake as well as yours."},{"name":"GRANSON","text":"I've heard reports of stray eaters drifting close to the Crystarium. Come with me and put my mind at ease."},{"name":"GRANSON","text":"There you are. Very good."},{"name":"GRANSON","text":"The sin eaters we're after were sighted west of the Accensor Gate, so we'll need to head through there before we begin our search."},{"name":"GRANSON","text":"Oh, and if you happen to have any objections to killing eaters for sport, remember that many were once innocent people. You'll be doing them a favor putting them out of their misery."},{"name":"GRANSON","text":"Sorry, but I'll be sitting this one out. Need to make sure I can rely on you in battle first. You understand."},{"name":"GRANSON","text":"Good, clean work. This is clearly not your first time."},{"name":"GRANSON","text":"Let's do this once more just to confirm it wasn't a fluke, though. Besides the world could do with less sin eaters."},{"name":"GRANSON","text":"Follow me. It shouldn't be much further."},{"name":"GRANSON","text":"Don't look at me. Your prey is out there somewhere."},{"name":"GRANSON","text":"Yeah, that'll do. You're exactly the sort of <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I've been looking for, and thank the gods for that."},{"name":"GRANSON","text":"My apologies for subjecting you to such a silly test, but I'd rather not have an amateur's death on my conscience. Let's head back to the Wandering Stairs and make this official, shall we?"},{"name":"GRANSON","text":"So. Just to make sure you're still keen on our arrangement..."},{"name":"GRANSON","text":"<span class=\"highlight\">Forename</span>, will you join with me and hunt the dread fiend Dikaiosyne and put an end to his accursed existence?"},{"name":"GRANSON","text":"Excellent! Then it is settled."},{"name":"GRANSON","text":"Now, every hunt begins with an investigation, and ours is no exception. Dikaiosyne can be a rather difficult eater to pin down."},{"name":"GRANSON","text":"But before we commence ours, we would do well to attend to our respective preparations. Let me know when you are ready to proceed."}],"reward":{"gil":1084},"reqs":{"jobs":[{"lvl":70,"id":156}],"quests":[68837]},"next":[68780]},"partials":[{"type":"npc","id":"1029900","obj":{"i":1029900,"n":"Granson","l":2951,"q":1}},{"type":"npc","id":"1029889","obj":{"i":1029889,"n":"Granson","l":2951,"q":3}},{"type":"quest","id":"68837","obj":{"i":68837,"n":"Warrior of Darkness","g":8,"l":"Lakeland","s":230}},{"type":"quest","id":"68780","obj":{"i":68780,"n":"Shaped by Tragedy","g":179,"l":"The Crystarium","s":111,"f":1}}]}