{"quest":{"name":"Defined by Loss","location":"Kholusia","id":68781,"patch":5.0,"sort":121,"icon":100867,"unlocksFunction":1,"eventIcon":71341,"issuer":1029893,"target":1029959,"genre":179,"journal":["Granson would like nothing more than to leave Wright behind.","One element of the attack on Wright a year ago still sticks in Granson's mind: the Fangs of Orthus, the bracelet that Granson's beloved was working to restore, which the eater Dikaiosyne took with him when he left. Eaters are creatures of base instinct that care not for worldly possessions, so this curious behavior would seem to set him apart from his brethren. In any event, it would behoove you to learn more about the bracelet, perhaps by questioning the trader who had commissioned Milinda to restore it─a man who calls Eulmore home...","Sensing an opportunity to recover his “stolen” goods, the trader tells you of how he purchased the bracelet from a traveling peddler who claimed it was a relic of the fallen Kingdom of Voeburt. Coincidentally, a relic with a similar design─a choker─has recently surfaced in Mord Souq, and the merchant has a mind to purchase it as well...","Like the merchant, Granson suspects there is a connection between the two pieces given the supposed similarity of the design. A trip to Mord Souq would appear to be in order.","As before, Granson proposes that the two of you make separate inquiries, asking after the choker. Hopefully you will have better luck than you did in Wright...","In a surprising twist, you happen to question a woman who knows of the piece you speak, for her husband is the owner. Granson should be pleased to learn of your discovery.","Granson would brook no delay and declares that you must hurry to find the scavenger, for so long as he is in possession of the choker, he remains a target for Dikaiosyne.","Alas, you locate the scavenger too late, for the Virtue beats you to the punch and transforms him into a sin eater before leaving with the Voeburtite choker. The misshapen fiend then turns to face you, an all-too-familiar hunger in its eyes...","You grant the scavenger the only mercy you can. Granson will not be pleased with this outcome, but such is life.","Granson is understandably dismayed to learn of the scavenger's death and Dikaiosyne's escape, but what is done is done. Rather than discuss the next step in the wild where more eaters could be roaming about, he bids you both return to Mord Souq.","Though you have lost both the choker and Dikaiosyne, the greater tragedy is undeniably the scavenger's death. Being no stranger to such things, Granson states that he will inform the widow, and that you will continue your hunt for the eater another day.<br><br>※The next role quest will be available from Granson upon reaching level 76 in any tank class."],"objectives":["Speak with the industrious trader in Eulmore.","Speak with Granson in Wright.","Rendezvous with Granson in Amh Araeng.","Question the residents of Mord Souq.","Speak with Granson.","Search for the enterprising scavenger. ","Slay the sin eater.","Rendezvous with Granson.","Speak with Granson in Mord Souq."],"dialogue":[{"name":"GRANSON","text":"Sorry to have kept you waiting, sinner."},{"name":"GRANSON","text":"I'm sure you're eager to get back to it, as am I. Trouble is, in your absence, I've failed to turn up any information as to the whereabouts of Dikaiosyne."},{"name":"GRANSON","text":"There is one line of inquiry I've yet to pursue, though─the Fangs of Orthus. The bracelet my beloved was supposed to restore and that the eater took with him when he left Wright."},{"name":"GRANSON","text":"Sin eaters are mindless fiends driven only by base instinct. Everyone knows that. They've no need for worldly possessions."},{"name":"GRANSON","text":"Yet Dikaiosyne took the bracelet anyway...which can only mean that there's something unique about this particular antique. Or the sinless bastard's somehow different from the rest of his ilk..."},{"name":"GRANSON","text":"Either way, I think we need to learn more about the Fangs of Orthus, and I know just the man to ask: the Eulmoran trader who commissioned Milinda's services."},{"name":"GRANSON","text":"Much as I'd like to question him myself, though, I don't think that's an option. Even though Dikaiosyne's attack a year ago is common knowledge, I doubt the trader will believe that an eater stole his precious trinket. He's more likely to accuse me of theft and have me clapped in irons."},{"name":"GRANSON","text":"So I'm afraid you'll have to go in my stead, <span class=\"highlight\">Forename</span>. Milinda said he was a regular at the Beehive, so try looking for him there first."},{"name":"ANTIQUEDEALER03245","text":"Hmm? And to what do I owe the pleasure that is your...company?"},{"name":"ANTIQUEDEALER03245","text":"The Fangs of Orthus, you say? How very interesting..."},{"name":"ANTIQUEDEALER03245","text":"I should be glad to tell you everything that I know─under the assumption that should you recover it, you will see it returned to its rightful owner at once."},{"name":"ANTIQUEDEALER03245","text":"I purchased the bracelet from a traveling peddler who claimed it was a relic of Voeburt, that glorious kingdom that fell with the Flood like so many others."},{"name":"ANTIQUEDEALER03245","text":"He spoke true, from what I could tell, and I intended to sell it to a collector here for a tidy profit─after having it properly restored by an artisan in Wright. Alas, she was one of several casualties of a sin eater attack, during which the Fangs of Orthus “mysteriously” vanished."},{"name":"ANTIQUEDEALER03245","text":"I have of course been keeping in touch with several contacts on the off chance that the thief might attempt to sell it. They have not, regrettably, but a piece of similar design did recently surface in Mord Souq, I am told."},{"name":"ANTIQUEDEALER03245","text":"I was planning to dispatch an agent to investigate, but you seem more than capable of fulfilling that role. As for incentive, you may be assured that any information that aids me in the acquisition of the Fangs of Orthus or similar relics will be well rewarded."},{"name":"GRANSON","text":"Best I keep my distance from the trader. If he suspects fraud, I'm liable to be his prime suspect, and I'd rather not fight my way out of Eulmore unless I have to."},{"name":"GRANSON","text":"So? What did our industrious patron have to say?"},{"name":"GRANSON","text":"So he thinks it was stolen, eh? Just as well. We'd probably not know where to head next if it wasn't for his distrusting nature."},{"name":"GRANSON","text":"If this “piece of similar design” is related to the Fangs of Orthus, then it might attract Dikaiosyne's attention─assuming it hasn't already. Let's go."},{"name":"ANTIQUEDEALER03245","text":"The piece in question is a choker of similar age and design to the Fangs of Orthus. The owner has yet to find a buyer, I believe, but I should like very much to make it my own..."},{"name":"GRANSON","text":"Fine weather we're having today in Mord Souq, isn't it?"},{"name":"GRANSON","text":"\"No such thing as a thing without value.“ That's the creed of these folk."},{"name":"GRANSON","text":"We'll find no shortage of Voeburtite trinkets here. Finding the right one, on the other hand, is the challenge. I say divide and conquer, as before."},{"name":"ZHINZIN","text":"Well met, well met! How may I be of service to you?"},{"name":"ZHINZIN","text":"Oho! A choker that once belonged to Voeburtite royalty, you say?"},{"name":"ZHINZIN","text":"If only I had such a remarkable treasure in my possession! But no, I do not. In all my years here I have never even heard of someone unearthing such a thing..."},{"name":"HUMEMERCHANT03245","text":"Yes? Do you have business with me, traveler?"},{"name":"HUMEMERCHANT03245","text":"Ah, the Voeburtite choker? Is that what all this fuss is about? Then you're in luck, for my husband has yet to sell it."},{"name":"HUMEMERCHANT03245","text":"Once we realized how valuable it was, though, he insisted on carrying it with him at all times. If you're not willing to wait for him to return, you could try to find him at the ruins where he's scavenging for relics. They're not far."},{"name":"GRANSON","text":"This'll go a lot smoother if we conduct our inquiries separately and share our findings afterwards. If it please."},{"name":"ZHINZIN","text":"Do you happen to know where this Voeburtite choker was dug up? I'd like to take a look myself! There could be other valuable goods just waiting to be discovered!"},{"name":"HUMEMERCHANT03245","text":"You'll find my husband at the ruins outside of Mord Souq. Or you could wait for him to return, but he has a habit of losing track of time..."},{"name":"GRANSON","text":"What news, friend?"},{"name":"GRANSON","text":"Hah! To think that it was that easy! You've the luck of the Fae."},{"name":"GRANSON","text":"But we need to hurry. If my theory's correct, then so long as that scavenger has the choker, he's a target for Dikaiosyne."},{"name":"HUMESCAVENGER03245","text":"(-???-)M-Mercy! Mercy!"},{"name":"HUMESCAVENGER03245","text":"Take whatever you want, but please, don't kill me! I have a family! I..."},{"name":"HUMESCAVENGER03245","text":"Please! I beg of you, I─ Aaah!"},{"name":"HUMESCAVENGER03245","text":"(-Panic-stricken Scavenger-)Pleaaase...pleaaase..."},{"name":"GRANSON","text":"I'll survey this area, you survey another. Divide and conquer, sinner. It's a winning strategy."},{"name":"GRANSON","text":"Shame you missed the fun. This one bit off more than he could chew!"},{"name":"GRANSON","text":"Probably because it was a newborn. You can tell by the lingering vestiges of intelligence and self─can see it in their eyes. Like when Dikaiosyne... Hmm. Don't tell me─you saw him?"},{"name":"GRANSON","text":"Wicked white. And he took the choker too? Damn it. Damn it all."},{"name":"GRANSON","text":"He can't keep getting away with it! He... He can't keep getting away with it..."},{"name":"GRANSON","text":"It's just like Wright. I was too late to save him, just like I was too late to save her..."},{"name":"GRANSON","text":"But not again─never again! I'll hunt you to the ends of the world, Dikaiosyne! Vengeance will be mine!"},{"name":"GRANSON","text":"...Ahem. Right, yes. Neither the time nor the place. More eaters could be about."},{"name":"GRANSON","text":"It's just...every time I cut one down, it reminds me of my first. Of her..."},{"name":"GRANSON","text":"We may have failed to stop him this time, but what matters is that we'll both live to see another day."},{"name":"GRANSON","text":"Pity the scavenger didn't. And the wife doesn't yet know she's become a widow."},{"name":"GRANSON","text":"Sod it. I'll tell her what happened. I've been there, so maybe it'll help me to find the right words. Not that there ever are any."},{"name":"GRANSON","text":"Afterwards, I'll have a good think about our next step. Don't let me keep you from your other affairs, <span class=\"highlight\">Forename</span>. We'll speak again soon."}],"reward":{"gil":2163},"reqs":{"jobs":[{"lvl":74,"id":156}],"quests":[68780]},"next":[68782]},"partials":[{"type":"npc","id":"1029893","obj":{"i":1029893,"n":"Granson","l":2954,"q":2}},{"type":"npc","id":"1029959","obj":{"i":1029959,"n":"Granson","l":2955,"q":2}},{"type":"quest","id":"68780","obj":{"i":68780,"n":"Shaped by Tragedy","g":179,"l":"The Crystarium","s":111,"f":1}},{"type":"quest","id":"68782","obj":{"i":68782,"n":"The Princess and Her Knight","g":179,"l":"Amh Araeng","s":131,"f":1}}]}