{"quest":{"name":"Shall We Dance","location":"Limsa Lominsa","id":68785,"patch":5.0,"sort":201,"icon":100872,"unlocksFunction":1,"eventIcon":71341,"issuer":1028721,"target":1028724,"genre":163,"journal":["This Lominsan gentleman appears just a tad too excited about something.<br><br>※This quest will unlock the dancer job.","The eager Lominsan shares with you the news that has him jumping out of his boots. As he tells it, a troupe of dancers has arrived in town from far-off Radz–at–Han, and their singularly sublime movements both delight the eyes and stir one's very soul. So smitten is he with their performance that he positively insists that you see it for yourself. Should you be inclined to humor the excitable fellow, make your way to the lower decks and see for yourself what all the fuss is.","You arrive at the lower decks and speak with a young woman who introduces herself as a dancer of Troupe Falsiam. She explains to you that she is making her final preparations before taking the stage, and cordially invites you to stay around and enjoy the show. If you have no other pressing business to attend to, why not do just that?","In the midst of appreciating the performance, you appear to have caught the attention of one Mistress Nashmeira, Troupe Falsiam's principal dancer, who approaches you with an enticing offer. In exchange for your assistance with the troupe's tour of Eorzea, she will personally instruct you in the art of the Kriegstanz, the ancient war dance passed down from her ancestors, which she promises will avail you not only on the stage, but in your adventures as well.","Nashmeira is overjoyed at your acceptance of her offer, and promptly outfits you with the fundamental tools of your new trade: a soul crystal which will impart to you basic knowledge in the art of the dance, and suitable attire to wear upon the stage. She encourages you to promptly dress yourself in the latter, and bids you speak with her again when you are ready to receive your first lesson."],"objectives":["Speak with the troupe's dancer.","Wait for the show to begin.","Speak with Nashmeira."],"dialogue":[{"name":"EXCITEDTOWNSMAN03249","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Oh, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! You can spare a moment, yes? Of course you can! You see, I've just witnessed a performance most marvelous, and I simply <span class=\"emphasis\">must</span> tell someone about it!"},{"name":"EXCITEDTOWNSMAN03249","text":"What sort of performance, you ask? Why, none other than a troupe of traveling dancers hailing from Radz–at–Han across the sea! I daresay their bold, exotically beautiful motions are like nothing our realm has ever seen!"},{"name":"EXCITEDTOWNSMAN03249","text":"Adventurers like you are always on the lookout for stimulating new experiences, are you not? You simply must witness this spectacle for yourself! Just follow this road toward the convent of the Dutiful Sisters, and you'll run smack dab into the stage they've set up in the square."},{"name":"EXCITEDTOWNSMAN03249","text":"My good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! Whyever are you wasting your time with silly old me when one of the greatest spectacles the realm has seen awaits you!? Hurry to the square and feast your eyes on those beauties from Radz–at–Han. I promise that you won't regret it!"},{"name":"KUIHLUD","text":"What have we here? An adventurer...and an imposing one, at that. Ah, but where are my manners? I am Kuihlud, Troupe Falsiam's humble instrumentalist. If you're looking for the star of our little company, you'll find her just over there."},{"name":"RANAAMIHGO","text":"Greetings, traveler. Come to see our little show, have you? On behalf of Troupe Falsiam, I welcome you."},{"name":"RANAAMIHGO","text":"My troupemates are seeing to the final preparations even as we speak. Don't wander too far─the curtain will be rising any minute now!"},{"name":"RANAAMIHGO","text":"It's been quite some time since we brought our art to these shores, or so our fearless leader tells us. I've been practicing day and night ever since we arrived to bring you and your countrymen the performance of a lifetime!"},{"name":"RANAAMIHGO","text":"As for yours truly, believe it or not, this is actually my first time in Eorzea! I'm still a newcomer to the troupe, you see... Oh, but would you look at the time! We'll be taking the stage shortly, so pray sit back and enjoy the show."},{"name":"KUIHLUD","text":"So close, and yet so far... For all who cannot make the voyage to our home, we bring our art to yours... Hailing from Radz–at–Han across the sea, I present the incomparable, transcendent...Troupe Falsiam!"},{"name":"KUIHLUD","text":"Today, we have prepared a sumptuous feast for your eyes and ears. Let the soaring melodies and the stirring, striking steps of our dancers reach your heart and spirit you away to a distant world!"},{"name":"NASHMEIRA","text":"(-Elegant Easterner-)Yes... Just so, Ranaa... Betray not your trembling heart... Dance your dance till the last, and let them fall under your spell..."},{"name":"NASHMEIRA","text":"(-Elegant Easterner-)My apologies. I did not mean to intrude upon your experience. Pray ignore my mutterings and enjoy the girl's performance. She's trained quite hard for this day, after all."},{"name":"NASHMEIRA","text":"(-Elegant Easterner-)I must say, you carry yourself with a certain grace, don't you? Ah, but do excuse me. I forget myself..."},{"name":"NASHMEIRA","text":"Forgive me for not having properly introduced myself. I am Nashmeira, principal dancer and leader of Troupe Falsiam. Ranaa, the girl whose performance you were admiring, is my number one student and protégé."},{"name":"NASHMEIRA","text":"This may seem a bit forward, but pray tell: have you ever harbored aspirations of stepping on stage? Of losing yourself in a whirlwind of music and motion, and enchanting your audience with your every movement?"},{"name":"NASHMEIRA","text":"Forgive me...I know this is all quite sudden. And yet, I could not help myself. From the first moment I laid eyes on you, I saw─how can I put it?─a poise that could only be honed on the field of battle. Yes, there is no doubt in my mind...you would make a fine dancer."},{"name":"NASHMEIRA","text":"I see you are confused, and for good reason. Allow me to explain: there are forms of dance meant merely to grace a stage, and then there is the art of Troupe Falsiam. We dance the Kriegstanz─a dance of war so ancient it is said to predate even the founding of our city."},{"name":"NASHMEIRA","text":"Our dancers train primarily in two techniques, each with applications both ornamental and martial. For one, we are proficient in tossing throwing weapons which are most dazzling to the eyes─and even more damaging to any unfortunate foes they strike."},{"name":"NASHMEIRA","text":"The second is, of course, dancing itself. Perhaps you have already felt it, but it is believed that there are mystical powers to our movements, which can serve to heighten senses, lift spirits, and drive weakness and worry from people's hearts."},{"name":"NASHMEIRA","text":"The people of Eorzea have done well to rebuild this realm in the Calamity's wake. Yet there are scars that still go unhealed, and the specter of war still looms large over the land."},{"name":"NASHMEIRA","text":"If our art of dance might serve in some small way to ease worries and fears, and offer succor to the hearts of Eorzeans far and wide, nothing would bring our humble troupe greater honor. And so did I decide to lead Troupe Falsiam on a tour of this realm."},{"name":"NASHMEIRA","text":"There is, however, a bit of a rub. We have come with only two dancers─Ranaa and myself─and I am still nursing an injury I suffered on the voyage over. My protégé is a talented one, but I can hardly ask her to bear the burden of tour alone. And so I felt compelled to reach out to you."},{"name":"NASHMEIRA","text":"I can assure you that the arrangement would be to our mutual benefit. Should you offer us your aid, I will personally instruct you in the art of the Kriegstanz─an art that will avail you not only on the stage, but on the field of battle as well."},{"name":"NASHMEIRA","text":"Worry not...I will not force you to rush your decision. We must begin rehearsal for our next performance. Do give some thought to my offer, and seek me out again should you be so inclined."},{"name":"RANAAMIHGO","text":"Thank you ever so much─I could see you cheering me on to the final curtain call! It's always a bit scary coming to new lands, but that just makes a successful performance like today's all the more satisfying!"},{"name":"KUIHLUD","text":"I could not help but notice that our fearless leader took an interest in you. While we do not lack for talented dancers─Ranaa is certainly one of them─none can hold a candle to Nashmeira. She is our pillar of strength...our guiding star."},{"name":"NASHMEIRA","text":"You return, friend. Have you taken the time to think over my offer?"},{"name":"Q1","text":"Accept Nashmeira's offer to train as a dancer?"},{"name":"NASHMEIRA","text":"I see...a shame, that. And yet no one can be forced to take the stage against <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> will. My troupe and I will sojourn in this city for a while still. Should you have a change of heart, pray do not hesitate to return."},{"name":"NASHMEIRA","text":"Splendid! To tell the truth, I had feared your answer would be no, but fortune smiles upon Troupe Falsiam today. As principal dancer and company leader, allow me to officially welcome you to our ranks."},{"name":"RANAAMIHGO","text":"Wait, don't tell me─Nashmeira has handpicked you to join our troupe and become a dancer. Is Ranaa right, or is Ranaa right!?"},{"name":"RANAAMIHGO","text":"I knew it! I haven't been doing this for as long as Mistress Nashmeira, but even I can see that your poise and posture is anything but ordinary. But don't get your hopes up too high─you're going to have to work your arse off to outshine Ranaa Mihgo!"},{"name":"NASHMEIRA","text":"Let it suffice to say that I will be watching <span class=\"emphasis\">both</span> of your careers with great interest. Oh, but where are my manners? I haven't even asked my student <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> name!"},{"name":"NASHMEIRA","text":"An elegant name indeed. Very well then, <span class=\"highlight\">Forename</span>...this is for you. This crystal houses the amassed knowledge and memories of generations of our forebears─butterflies of the battlefield who have fluttered their way into history and legend. Take it, and treasure it."},{"name":"NASHMEIRA","text":"And of course, you'll also be needing a change of clothes. Here, this outfit should do. Go ahead, put it on! You'll be amazed at the freedom of movement the pliant fabric affords you."}],"reward":{"gil":745,"items":[{"id":25217},{"id":27358},{"id":27267}]},"reqs":{"jobs":[{"lvl":60,"id":34}]},"next":[68786]},"partials":[{"type":"npc","id":"1028721","obj":{"i":1028721,"n":"Eager Lominsan","l":29,"q":1}},{"type":"npc","id":"1028724","obj":{"i":1028724,"n":"Nashmeira","l":29,"q":2}},{"type":"item","id":"25217","obj":{"i":25217,"n":"Soul of the Dancer","l":30,"c":26062,"t":62}},{"type":"item","id":"27358","obj":{"i":27358,"n":"High Steel Chakrams","l":255,"c":36207,"t":107}},{"type":"item","id":"27267","obj":{"i":27267,"n":"Softstepper's Attire Coffer (IL 255)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68786","obj":{"i":68786,"n":"Gamboling for Gil","g":163,"l":"Limsa Lominsa","s":202,"f":1}}]}