{"quest":{"name":"To Have Loved and Lost","location":"Il Mheg","id":68784,"patch":5.0,"sort":151,"icon":100867,"unlocksFunction":1,"eventIcon":71341,"issuer":1029963,"target":1029889,"genre":179,"journal":["Sul Oul is eager to hear what Granson has to say.","Having taken ample time to consider the nature of the man Branden was, and the man Granson had convinced himself he must be, the hunter has at last accepted the simple truth: that a hardened heart full of hate is ultimately empty. There is naught to be gained from playing the part of a vengeful hero, for there are only victims in his story. And so he must bring an end to the tale and lay Milinda and Branden's spirits to rest...and then move on. Satisfied that Granson has at last turned away from the brink, Sul Oul reveals the location of the Claws of Orthus, and furnishes you with a satchel of powder to dispel the glamour that shields it from view.","After coming to the designated location in Timh Gyeus, you cast the powder into the air with a flourish, which settles to reveal the hidden coffer. Granson kneels and withdraws the Claws of Orthus, and as if on cue, Dikaiosyne appears to claim his prize, and the battle is joined.","Though your enemy is formidable indeed, together you and Granson manage to lay the fallen Warrior of Light low. As he begins to fade into motes of aether, Branden seems to regain a fragment of his lost self, as he reflects on perhaps the most painful decision of his life. To your surprise, however, you learn that like Granson, he managed to reject the mistaken belief that he need forsake compassion and love to move on, and instead chose to embrace it, that he might honor the memory of the lady Sauldia.","Sul Oul is relieved to hear that Branden's soul is at peace...and that the turmoil in Granson's heart has subsided as well. With the deed done, the hunter has no need for the royal relics of Voeburt, and so he entrusts them to the former retainer that they may be enshrined in the fallen kingdom forevermore.","Having returned to the Crystarium, his hunt at an end, Granson turns his thoughts to the future, and realizes that he no longer feels at home there or in Wright or anywhere else. The road shall host him for the time being, as he believes that someone, somewhere must surely be in need of a reliable sword hand. Though your time together is at an end, there is no reason to think you will not meet again, and so you bid farewell to each other...until the next hunt."],"objectives":["Use the mushroom powder to reveal the hidden coffer.","Speak with Sul Oul at Pla Enni.","Speak with Granson in the Crystarium.","Defeat Dikaiosyne!"],"dialogue":[{"name":"SULOUL","text":"Granson. I have given you ample time to consider the path that has brought you here...and where it invariably leads all who walk it."},{"name":"GRANSON","text":"...I didn't know what to do after I lost Milinda. How to mourn her or how to live. I felt...that if I put it all on Dikaiosyne, put my everything into the hunt, that at least I wouldn't have to think about myself, or what comes next."},{"name":"GRANSON","text":"I wanted to hollow myself out...and fill up that hole with hate. Forget who I was. And irony of ironies, that's just what the poor bastard tried to do to himself a century ago, too, isn't it?"},{"name":"GRANSON","text":"Heh. “Hard men” making hard choices... What rot."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Hold on to Milinda and the memories you shared. Let that love guide you."},{"name":"A1","text":"Think not of Dikaiosyne, but Branden. Grant him peace and you will find your own."},{"name":"A1","text":"..."},{"name":"GRANSON","text":"...You're right. I don't need the hate. Never did. I'll finish it for Milinda...and for Branden. And then...I'll move on."},{"name":"GRANSON","text":"...Maybe. Still, that thing's no more than a mindless eater. Nothing it can say or do to make it right. So I'll finish the hunt...for Milinda...and for Branden. And then...I'll move on."},{"name":"SULOUL","text":"Ah, sorry. Having planted my head so far up my own arse, it's taking me time to remove it. Don't worry, I'll finish the hunt with you─but for the right reasons. For Milinda...and for Branden. And then...I'll move on."},{"name":"SULOUL","text":"...Move on, you say?"},{"name":"GRANSON","text":"I can't live off hate. Shouldn't've made it this far, frankly. And the more I try to reach for it, the more I find...sorrow? Pity?"},{"name":"SULOUL","text":"Curse not fate, but mourn her victims. Remember the dead as they lived."},{"name":"GRANSON","text":"Aye, something like that. Reckon <span class=\"highlight\">Forename</span> would agree. And Milinda, if she were here, would probably slap me a dozen times and call me a bloody fool for acting the way I have."},{"name":"GRANSON","text":"Or maybe you've been thinking about doing that in her stead, eh?"},{"name":"GRANSON","text":"Apologies for treating you with such disrespect before, Sul Oul. I'd like to claim I finally understand what you've been trying to tell me all this time, but I'm still getting my head around it─"},{"name":"SULOUL","text":"Recognizing your faults is the first and most important step. I will tell you what I know of the Claws of Orthus."},{"name":"SULOUL","text":"The ring, together with the bracelet and choker were three relics passed down through the royal family over generations, signifying the owner's right to rule."},{"name":"SULOUL","text":"Princess Sauldia was the last of her line, and after her death, they were stored in a sanctuary for safekeeping. However, a year ago, a band of thieves learned of its existence..."},{"name":"GRANSON","text":"The ones who stole the Fangs and Eyes of Orthus?"},{"name":"SULOUL","text":"Yes. The relics were concealed with magical wards. I can only presume that once they were spirited away, Dikaiosyne was then able to sense their presence."},{"name":"GRANSON","text":"Even in death, a slave to duty, you said? You think he pursued the thieves out of an instinctive loyalty to his princess?"},{"name":"SULOUL","text":"That I do. After all, he was content to leave them be so long as they remained hidden."},{"name":"GRANSON","text":"Only two of the three were taken? Then the third is still─"},{"name":"SULOUL","text":"Claim the Claws of Orthus and he will surely come for you, yes."},{"name":"SULOUL","text":"Timh Gyeus is where you must go. Once you arrive at the place I marked on your map, cast this powder into the air. The glamour will fade, and you will see the chest with the ring. The rest is up to you."},{"name":"GRANSON","text":"Thank you, Sul Oul. I promise we will bring your friend peace."},{"name":"GRANSON","text":"With me, sinner!"},{"name":"SULOUL","text":"And may you find peace as well, child..."},{"name":"GRANSON","text":"..."},{"name":"SYSTEM","text":"You toss the powder into the air, and as it slowly settles to the earth as twinkling motes of light, a coffer begins to take shape..."},{"name":"GRANSON","text":"This must be the Claws of Orthus."},{"name":"GRANSON","text":"All that's left is to decide when and where we want to confront the eater..."},{"name":"GRANSON","text":"Or we could deal with it here and now. Speak of the devil and he shall appear..."},{"name":"GRANSON","text":"Hey there, old man. I don't know you, and you don't know me...but I know your story. I know this isn't you. And I know that if Lady Sauldia was here, she'd say the same thing..."},{"name":"GRANSON","text":"It'll all be over soon. I promise you..."},{"name":"SULOUL","text":"Go to the place I marked on your map, and there use the powder in the satchel to dispel the glamour concealing the coffer. You will find the ring within."},{"name":"GRANSON","text":"Come! Let's put the poor bastard out of his misery!"},{"name":"GRANSON","text":"What the─ Did he do that!?"},{"name":"GRANSON","text":"Well that's hardly fair! Hold on, sinner!"},{"name":"GRANSON","text":"This is surprisingly complicated... Still with me?"},{"name":"GRANSON","text":"Something doesn't smell right. Stand back!"},{"name":"GRANSON","text":"Tough ol' bastard, isn't he? But I'm no slouch myself..."},{"name":"GRANSON","text":"Oh, come on! Not again!"},{"name":"GRANSON","text":"Looks like it's my turn. I'm counting on you, sinner!"},{"name":"GRANSON","text":"Wicked white, I felt that one. Thanks!"},{"name":"GRANSON","text":"I'm sorry, Milinda. I tried..."},{"name":"GRANSON","text":"&lt;pant&gt; &lt;pant&gt; Damn eater...let him go! He's not your bloody puppet!"},{"name":"GRANSON","text":"Heh, finally... You watching, Milinda?"},{"name":"BRANDEN","text":"(-Branden's Shade-)Now...and ever after, my lady Sauldia... My sword is yours...to command..."},{"name":"GRANSON","text":"Branden? He's still in there?"},{"name":"BRANDEN","text":"(-Branden's Shade-)I'll not hesitate again. No matter the cost─no matter the sacrifice..."},{"name":"GRANSON","text":"...Wait. Is he trapped in the memory still?"},{"name":"GRANSON","text":"You're wrong, Branden! That's not what she would want! Let go of your anger! Let go of her!"},{"name":"BRANDEN","text":"(-Branden's Shade-)...But that would make me lesser in your eyes, wouldn't it? To shoulder a burden that need not be mine. No. I will not forsake compassion and love. I will not dishonor your memory."},{"name":"BRANDEN","text":"(-Branden's Shade-)Oh, my lady Sauldia..."},{"name":"GRANSON","text":"...He's gone."},{"name":"GRANSON","text":"And with that, the three treasures of the royal family are reunited. Now we've just got to find a place to stick them so that no scavenger ever stumbles upon them again."},{"name":"GRANSON","text":"Least we can do for the princess and her knight, am I right?"},{"name":"GRANSON","text":"Maybe Sul Oul will have some ideas. Let's head back to Pla Enni."},{"name":"GRANSON","text":"This should be the place. You've got the powder on you, right?"},{"name":"SULOUL","text":"It is done? Branden has been laid to rest?"},{"name":"GRANSON","text":"You saw us when we arrived. Do you really have to ask?"},{"name":"SULOUL","text":"No, I suppose not. Oh, my dear friend...I pray you have found peace."},{"name":"SULOUL","text":"And what of you, Granson? Has the turmoil in your heart subsided at last?"},{"name":"GRANSON","text":"Aye, I suppose so...though, to be honest, it felt like I made my peace with him before we even fought..."},{"name":"SULOUL","text":"Because you finally saw him for what he was, and accepted that truth into your heart. The battle was but an afterthought."},{"name":"GRANSON","text":"Hah! Easy for you to say. You didn't have to cross blades with the bloke."},{"name":"GRANSON","text":"By the way─I've brought you some gifts."},{"name":"SULOUL","text":"The three royal relics of Voeburt! Then Branden was safeguarding both the bracelet and the choker..."},{"name":"GRANSON","text":"And now it's your turn to look after the whole lot. That's what Lady Sauldia and her knight would've wanted, I reckon."},{"name":"SULOUL","text":"Yes, of course... That their souls may sleep soundly forevermore, we shall enshrine these relics for all eternity..."},{"name":"GRANSON","text":"Now that that's settled, I suppose we should be on our way. There's a detour I'll have to take, but afterwards I'd like to speak with you back at the usual spot in the Crystarium."},{"name":"GRANSON","text":"Be well, Sul Oul."},{"name":"SULOUL","text":"I think that one has a bright life ahead of him. Few can find the strength to overcome such terrible tragedy, but he did."},{"name":"SULOUL","text":"As have you, on no few occasions, I am sure."},{"name":"SULOUL","text":"It has been a pleasure, <span class=\"highlight\">Forename</span>. Do visit me should you ever yearn to hear an old fool prattle on and on."},{"name":"GRANSON","text":"After you, <span class=\"highlight\">Forename</span>."},{"name":"GRANSON","text":"Well met, sinner. Glad to see you made it back safe and sound."},{"name":"GRANSON","text":"Having returned to where it all began, I can't help but think back to when I first came here, thinking only of Dikaiosyne and my revenge. I was so wrapped up in my own personal affairs that I didn't realize I was only pushing others away..."},{"name":"GRANSON","text":"Glynard was the only one who saw through the facade. He's a perceptive one, aye─took one look at me when I got back and broke into a smile."},{"name":"GRANSON","text":"But enough about him─I have yet to thank you properly, <span class=\"highlight\">Forename</span>! I owe you so much for sticking with me to the end..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"So what's next for you, sinner?"},{"name":"A2","text":"..."},{"name":"GRANSON","text":"Good question. Can't say I feel at home here or in Wright or anywhere else, so I might spend some time on the road. I may not be as skilled a fighter as you, but I reckon I'm better than most, and there's always someone in need of a reliable sword hand."},{"name":"GRANSON","text":"What? At a loss for words? <span class=\"emphasis\">You</span>? Or are you getting misty-eyed at the thought of us parting ways? I'll still be around, you know."},{"name":"GRANSON","text":"Not here, though. Can't say I feel at home in the Crystarium or in Wright or anywhere else, so I might spend some time on the road. I may not be as skilled a fighter as you, but I reckon I'm better than most, and there's always someone in need of a reliable sword hand."},{"name":"GRANSON","text":"Milinda would want me to use my talents for a noble purpose, and helping folks in need fits the bill. Hells, isn't that what Branden and his comrades wound up doing in the end?"},{"name":"GRANSON","text":"So─let's not call it a good-bye. Let's just say...until the next hunt."},{"name":"GRANSON","text":"Wheresoever you go, may you find shade, sinner."},{"name":"SULOUL","text":"...Oh? You wish to listen to my ramblings now? Nay, I think not. Another time, <span class=\"highlight\">Forename</span>, another time."}],"reward":{"gil":2789,"items":[{"id":25190},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":156}],"quests":[68783]},"next":[68746,68748,68757,68761]},"partials":[{"type":"npc","id":"1029963","obj":{"i":1029963,"n":"Sul Oul","l":2956,"q":3}},{"type":"npc","id":"1029889","obj":{"i":1029889,"n":"Granson","l":2951,"q":3}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68783","obj":{"i":68783,"n":"The Hardened Heart","g":179,"l":"Il Mheg","s":141,"f":1}},{"type":"quest","id":"68746","obj":{"i":68746,"n":"Worth Fighting For","g":147,"l":"Ul'dah","s":800}},{"type":"quest","id":"68748","obj":{"i":68748,"n":"Once, Twice, Three Times a Warrior","g":149,"l":"Eastern La Noscea","s":800}},{"type":"quest","id":"68757","obj":{"i":68757,"n":"Our Closure","g":157,"l":"Ishgard","s":800}},{"type":"quest","id":"68761","obj":{"i":68761,"n":"Gunblades of the Patriots","g":162,"l":"Mor Dhona","s":800}}]}