{"quest":{"name":"The Makings of a Gunbreaker","location":"Gridania","id":68797,"patch":5.0,"sort":101,"icon":100871,"unlocksFunction":1,"eventIcon":71341,"issuer":1029028,"target":1029033,"genre":162,"journal":["An anxious member of the Gods' Quiver is haranguing passersby, presumably for some worthy cause.<br><br>※This quest will unlock the gunbreaker job.","While passing through Gridania, a highly strung Gods' Quiver bow beckons you over. They are attempting to track down a gang of highwaymen who have been preying on those traversing the Shroud, and they aim to widen the net by hiring adventurers. Before payment or even your willingness to participate can be discussed, you are instructed to proceed to the Bramble Patch and apprehend any suspicious individuals.","Barely have you arrived when you spy a pair of outlandish travelers being accosted by bandits. Although they appear to have the measure of their assailants, the situation swiftly takes a turn for the worse when one of them inexplicably collapses, leaving his conjurer friend alone to defend herself.","The highwaymen were unprepared for your timely intervention and paid the ultimate price for their cowardly ambush. The young healer is thankfully unharmed, and her sword-wielding companion is crestfallen but alive.","The Gods' Quiver bow offers his thanks for your contribution to the cause, though he fears there may still be bandits in the vicinity. You are asked to escort the two travelers to Gridania, who introduce themselves as Radovan and Sophie, recent escapees from Garlean-held territory in the north. Radovan reveals that he was once forced against his will to fight as an imperial conscript, and having cut all ties, now wishes to start a new life as a bodyguard in Eorzea. After witnessing the ease with which you disposed of the highwaymen, he asks for your help in his endeavors, and in exchange, offers to tutor you in the art of the gunbreaker. Radovan chooses not to press you for an answer, instead giving you time to consider his offer.","Having accepted Radovan's proposal, he places a gunbreaker soul crystal in your hand, and the power within is almost tangible. Once you have made the necessary preparations, you will be ready to wield the gunblade and master its myriad techniques."],"objectives":["Survey the designated area in the East Shroud.","Defeat the highwayman.","Aid the weary swordsman.","Speak with Radovan."],"dialogue":[{"name":"HONESTGODSQUIVERBOW","text":"Oi, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mate</span></span>! Fancy makin' yerself useful?"},{"name":"HONESTGODSQUIVERBOW","text":"Listen close─ A gang of highwaymen have been applyin' their trade 'round here these last few days, and we're tryin' to flush 'em out."},{"name":"HONESTGODSQUIVERBOW","text":"They're slippery buggers, though, so we need all the help we can get. That's where you come in."},{"name":"HONESTGODSQUIVERBOW","text":"We've spotted 'em lurkin' in the Bramble Patch, and we're gettin' ready to spring our trap."},{"name":"HONESTGODSQUIVERBOW","text":"All you have to do is collar anyone who strikes you as a bit shifty and raise the alarum. We'll take care of the rest."},{"name":"HONESTGODSQUIVERBOW","text":"You just need to keep 'em busy until we get there. And don't rough 'em up without us. We need to make sure it's one of the culprits you've grabbed and not some other poor sod."},{"name":"BANDIT03261","text":"Outta my way or I'll gut ya!"},{"name":"BALLOON","text":"You're mine!"},{"name":"SOPHIE","text":"Phew! That was a close one."},{"name":"RADOVAN","text":"(-Weary Swordsman-)You have my thanks, stranger."},{"name":"SOPHIE","text":"(-Peculiar Conjurer-)And mine. If you hadn't shown up, things could've gone very badly for us."},{"name":"RADOVAN","text":"(-Weary Swordsman-)It's my fault. I'll be more careful next time."},{"name":"RADOVAN","text":"(-Weary Swordsman-)Truth be told, I thought we'd have an easier time of it on this side of the wall. How wrong I was."},{"name":"RADOVAN","text":"(-Weary Swordsman-)Truth be told, I thought we'd have a quieter journey after sneaking past all those imperial patrols and leaving Gyr Abania behind. How wrong I was."},{"name":"RADOVAN","text":"(-Weary Swordsman-)To think we could be caught unawares by a gang of common thieves..."},{"name":"HONESTGODSQUIVERBOW","text":"What's goin' on!? We heard a commotion and─"},{"name":"HONESTGODSQUIVERBOW","text":"That's one of them! Just like the witnesses described!"},{"name":"HONESTGODSQUIVERBOW","text":"Hmm... It's strange they'd go after a pair like you. All their marks so far have been merchants and whatnot. You know, folk carryin' coin and valuables who won't put up much of a fight."},{"name":"HONESTGODSQUIVERBOW","text":"I reckon that if any of their cronies are out there watchin', they'll think twice before crossin' you lot again. Still, might be an idea for you to see these travelers to Gridania. Me and the others'll keep lookin' for the rest of the highwaymen."},{"name":"RADOVAN","text":"(-Weary Swordsman-)Those bandits... Something about this doesn't sit right with me. We barely have a fistful of gil between us, and I have a couple of fulms of edged steel strapped to my back. Not the most likely of targets."},{"name":"RADOVAN","text":"(-Weary Swordsman-)Perhaps that's why they went straight for the kill. And they might have succeeded if you hadn't stepped in. We are in your debt."},{"name":"RADOVAN","text":"I am Radovan, and this is Sophie. We traveled here from Ilsabard, far to the north, where once I served as a soldier of Garlemald."},{"name":"RADOVAN","text":"I had no choice. My family was taken hostage. While it is true that I have fought and killed for the Empire, I would never have done so willingly."},{"name":"RADOVAN","text":"Although I've freed myself of their shackles, the life I'd known is no more. But that was another life─one I would sooner put behind me. I came to Eorzea in the hope that I might start anew here."},{"name":"SOPHIE","text":"As for me, I also escaped from the Garleans. I was part of a resistance movement, until we were all rounded up or killed, that is."},{"name":"SOPHIE","text":"The Empire took everything from me─my family, my homeland. With nowhere else to go, the two of us decided we'd stand a better chance of surviving if we stuck together. And here we are."},{"name":"RADOVAN","text":"To see me now, you'd scarce believe I once served as personal guard to my queen. But in the end, I couldn't protect her. I couldn't protect anyone. Not even my wife and son."},{"name":"RADOVAN","text":"While I would have gladly given my life for theirs, it was not to be. Even so, there may still be a use for the skills I spent years honing. Those whom I may yet deliver from harm."},{"name":"SOPHIE","text":"That's why I suggested looking for employment as a bodyguard in Eorzea, and Gridania seems a good place to start."},{"name":"RADOVAN","text":"I know you've helped us enough already, but I have a proposal."},{"name":"RADOVAN","text":"Would you consider working with us?"},{"name":"SOPHIE","text":"Now hold on, Radovan! That's rather a lot to ask, don't you think?"},{"name":"RADOVAN","text":"But <span class=\"highlight\">Forename</span> has what it takes...to become a gunbreaker."},{"name":"RADOVAN","text":"It seems my gunblade has caught your eye. You may have seen Garleans wielding something similar, but this is the genuine article."},{"name":"RADOVAN","text":"The ones used by the Empire are simply edged weapons with a firearm bolted on, or vice versa. While they have their uses, they pale in comparison to those my clan forged for generations."},{"name":"RADOVAN","text":"Our gunblades use aetherially imbued cartridges."},{"name":"RADOVAN","text":"When you pull the trigger, the powdered crystal within ignites, releasing the aether."},{"name":"RADOVAN","text":"This sends a powerful shockwave through the blade, increasing its destructive capabilities. The cartridges can even be fired into the air to create defensive barriers."},{"name":"SOPHIE","text":"Perhaps you should save the lectures until you've heard <span class=\"highlight\">Forename</span>'s answer?"},{"name":"RADOVAN","text":"Ah, yes! First things first. So, are you interested?"},{"name":"RADOVAN","text":"In exchange for assisting us, I will teach you the art of the gunbreaker."},{"name":"SOPHIE","text":"And I was wondering if you might be able to act as a guide. If you'd accept gunblade training as a form of payment, we'd be most grateful. Once the coin starts rolling in, you'll receive a fair share."},{"name":"RADOVAN","text":"You need not answer right away. But please, give it some thought."},{"name":"SOPHIE","text":"When Radovan's at his best, he's unbeatable. The trouble is, he's not always at his best, as you saw. I think we'd both feel a lot safer with someone like you alongside us."},{"name":"RADOVAN","text":"Have you reached a decision?"},{"name":"Q1","text":"Do you wish to become a gunbreaker?"},{"name":"RADOVAN","text":"From this day forth, our fates are entwined."},{"name":"RADOVAN","text":"While the path that lies ahead is not an easy one, the spirits of my predecessors will watch over you."},{"name":"RADOVAN","text":"I understand. Should you change your mind, the offer still stands."}],"reward":{"gil":1094,"items":[{"id":25216},{"id":27357},{"id":27266}]},"reqs":{"jobs":[{"lvl":60,"id":34}]},"next":[68798]},"partials":[{"type":"npc","id":"1029028","obj":{"i":1029028,"n":"Gods' Quiver Bow","l":52,"q":1}},{"type":"npc","id":"1029033","obj":{"i":1029033,"n":"Radovan","l":55,"q":2}},{"type":"item","id":"25216","obj":{"i":25216,"n":"Soul of the Gunbreaker","l":30,"c":26061,"t":62}},{"type":"item","id":"27357","obj":{"i":27357,"n":"High Steel Gunblade","l":255,"c":36005,"t":106}},{"type":"item","id":"27266","obj":{"i":27266,"n":"Outsider's Attire Coffer (IL 255)","l":1,"c":26509,"t":61}},{"type":"quest","id":"68798","obj":{"i":68798,"n":"Hired Gunblades","g":162,"l":"East Shroud","s":102,"f":1}}]}