{"quest":{"name":"Nor Any Drop to Drink","location":"The Core","id":68794,"patch":5.01,"sort":4,"icon":112354,"unlocksFunction":1,"eventIcon":71341,"issuer":1030110,"target":1030110,"genre":23,"journal":["Ryne's newly formed bond with Eden's core has led to a surprising discovery.","Having forged a stronger link with the core, Ryne has come to understand the true nature of Eden's power. When the Flood of Light engulfed the greater part of the world's surface, the ambient aether was forced into a dormant state, which inevitably led to the destruction of all life in the Empty. She also claims that Eden itself is able to reverse the damage it has caused, though Urianger is quick to point out that such a feat requires a measured and careful approach. Luckily, he has already begun to piece together a plan to awaken the elements of the Empty, one which he wishes to share with Thancred.","Thancred, having heard the details surrounding Ryne's earlier discovery, is keen for Urianger to reveal his newly formulated plan. The Archon hopes to use Eden's power to draw out aether of a specific element from a site where it was once prevalent, containing it within a deiform entity, using a method similar to summoning. By defeating the creature called forth, a large amount of correctly aligned aether will be returned to the land, and spread quickly throughout the Empty via aetherial currents. The first element that Urianger seeks to awaken is water, the source of all life, and prepares to lead an expedition to a yawning chasm that at one time held a vast ocean.","Eden, as directed by Ryne, extracts huge quantities of water-aspected aether while you call upon your memories of Leviathan. The summoning appears to have worked exactly as planned, although the beast himself has yet to appear. Ryne prepares to teleport you and your fellow adventurers to the ravine below, where a fateful encounter with a foe of your own making awaits.<br><br>※Eden's Gate: Inundation can be accessed via the Duty Finder.","After a hard-fought battle, you triumph over the living embodiment of water, returning the awakened aether to the Empty. Back in Eden's core, Ryne and Urianger are waiting to congratulate you and share news on whether your efforts have produced the desired results.","Ryne is amazed that primals such as Leviathan could exist on the Source, and as Urianger is explaining the differences between the two types of summoning, Thancred contacts you, requesting that you return to the base camp immediately. You are greeted upon your arrival by the sight of an enormous lake that suddenly appeared following your victory, proving that Urianger's theories were indeed correct and that your efforts were not in vain."],"objectives":["Speak with Urianger in the Empty.","Speak with Ryne in Eden's core.","Enter Eden's Gate: Inundation.","Speak with Ryne."],"dialogue":[{"name":"URIANGER","text":"Mayhap Eden hath imparted unto Ryne some manner of ancient knowledge?"},{"name":"RYNE","text":"I feel a lot more confident in my ability to control Eden now. Of course, this is only the beginning."},{"name":"URIANGER","text":"And we shall accompany thee wheresoever this path may lead. But pray tell, what manner of discovery hast thou made?"},{"name":"RYNE","text":"I understand how Eden's power works."},{"name":"URIANGER","text":"And therefore the true nature of the Flood of Light?"},{"name":"RYNE","text":"Yes. It affected the balance of all of the aether in the Empty, shifting it so far towards the umbral that it stopped flowing altogether."},{"name":"URIANGER","text":"The power to tip the scales..."},{"name":"RYNE","text":"And to tip them back again."},{"name":"RYNE","text":"That's what Eden does. It controls the balance of aether over a wide area, forcing it from one alignment to the other."},{"name":"RYNE","text":"Left alone, it still poses a threat, but if I can harness its power, I think I could use it to breathe life back into the Empty."},{"name":"RYNE","text":"The trouble is, I haven't the foggiest idea of where to start."},{"name":"RYNE","text":"And if I go about this the wrong way, I'll do more harm than good."},{"name":"URIANGER","text":"Thou needst not bear this burden alone, Ryne. Nor should thou."},{"name":"URIANGER","text":"'Tis no simple matter of awakening that which lies dormant."},{"name":"URIANGER","text":"All things in nature are inextricably linked. The elements maintain a fragile harmony, without which, life cannot prosper."},{"name":"RYNE","text":"So, what should we do?"},{"name":"URIANGER","text":"A solution hath begun to take shape in my mind, though it will require further discussion. For the time being, let us return to the camp. 'Twould be remiss of us not to involve Thancred."},{"name":"RYNE","text":"I'm curious to know what connection that girl has to Eden. If only she'd told us a bit more before she collapsed."},{"name":"THANCRED","text":"Still sleeping soundly, I'm afraid. If I'd known she'd take so long to come around, I'd have brought a good book or two to pass the time."},{"name":"URIANGER","text":"My friends, I believe I have struck upon a method by which we may see this world restored."},{"name":"THANCRED","text":"Urianger, before you go any further, allow me to make a potentially very long story slightly shorter. The plan is to control Eden and realign the aether of the Empty, right?"},{"name":"URIANGER","text":"In essence, yes. However, unleashing elemental energies haphazardly will not suffice."},{"name":"URIANGER","text":"In addition, the Empty is unfathomably vast. Were we only able to effect change over one small region at a time, it would take many lifetimes to complete even a fraction of our task."},{"name":"URIANGER","text":"Instead, our energies would be better spent revitalizing each element in order, that we might set in motion a more widespread transformation."},{"name":"RYNE","text":"One at a time..."},{"name":"RYNE","text":"I hate to say this, but I don't think Eden will be able to draw out a single element without affecting the others."},{"name":"URIANGER","text":"For that very reason, we shall select a location in which the ambient aether we wish to restore is at its most potent."},{"name":"URIANGER","text":"Even in a dormant state, certain elements will be more prevalent and therefore more easily manipulated."},{"name":"URIANGER","text":"Then, we rebalance the aether and return it to the land, whereupon it shall be borne on aetherial currents to the farthest reaches of the Empty."},{"name":"THANCRED","text":"But what's to prevent that element from breaking free of Eden's hold and causing a disaster of some sort?"},{"name":"URIANGER","text":"It must needs be contained. The question is, how?"},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span>, indulge me a moment if thou wouldst."},{"name":"URIANGER","text":"Pray imagine a corporeal manifestation of each of the individual elements. What dost thou see in thy mind's eye?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Surely not..."},{"name":"A1","text":"Moogles?"},{"name":"URIANGER","text":"Mayhap thou art afeared to utter the fateful word. For to even speak the name “primal” is to invite misfortune."},{"name":"URIANGER","text":"Though invite it we must. As the aether is drawn forth and realigned by Eden, we shall perform a summoning as Master Louisoix once did on the fields of Carteneau."},{"name":"URIANGER","text":"As one who hath laid low countless primals, thy memories will shape the aether into a deiform entity, which must subsequently be dispersed in the traditional fashion."},{"name":"RYNE","text":"So, “defeat it,” in other words. But is that even possible!?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I break my fast on primals!"},{"name":"A2","text":"It's either that or being torn to shreds."},{"name":"A2","text":"To be honest, I'm not entirely sure I can."},{"name":"URIANGER","text":"Lest thou forget, 'twill be no more than an approximation of a foe thou hast previously bested."},{"name":"URIANGER","text":"I have every confidence in thine abilities, <span class=\"highlight\">Forename</span>."},{"name":"THANCRED","text":"As do I, though it might help to have some idea of what you will be up against. Have you decided which element to tackle first?"},{"name":"URIANGER","text":"I propose water. The source of all life."},{"name":"URIANGER","text":"As for the location, an area to the west of Norvrandt was once home to the world's deepest ocean. Alas, the Flood of Light reduced it to a yawning chasm."},{"name":"RYNE","text":"Water... Yes, that seems like a good choice. I'll see if Eden can take us where we need to go."},{"name":"URIANGER","text":"And I shall prepare for the summoning."},{"name":"URIANGER","text":"Thancred, wouldst thou keep watch over our enigmatic antagonist? She may have vital information to impart. In the event that she becometh...agitated, thou mayest have need to restrain her."},{"name":"URIANGER","text":"(-Thancred-)Someone's got to do it, I suppose. I'll be praying for your success while I wait here, twiddling my thumbs."},{"name":"THANCRED","text":"Still, I must say I don't envy you being caught up in yet another one of Urianger's madcap schemes."},{"name":"THANCRED","text":"Though, come to think of it, if the creature you must fight is born from your own memories and imagination, why don't you try thinking of something a bit...tamer than the primals you've fought in the past? Hmm... Perhaps that's not how it works. Anyway, best of luck."},{"name":"URIANGER","text":"Leviathan is the ideal candidate to embody the element of water. Be warned that the circumstances of said summoning differ greatly from that of the primal encountered in the Source, and the results are difficult to predict."},{"name":"THANCRED","text":"Ryne's acquitted herself well in this whole Eden business, but I think she needs to slow down a little. We're in no hurry, after all."},{"name":"RYNE","text":"Eden seems to be responding well to my instructions, so we should reach our destination in no time at all!"},{"name":"RYNE","text":"All right, this is the place. I'll see if I can draw out the water-aspected aether."},{"name":"RYNE","text":"The rest is up to you, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"Memories of Leviathan come flooding back..."},{"name":"URIANGER","text":"'Twould appear that the summoning was a success, though Leviathan hath yet to reveal himself..."},{"name":"RYNE","text":"When you're ready, I'll have Eden teleport you there!"},{"name":"URIANGER","text":"A most emphatic victory, <span class=\"highlight\">Forename</span>. Unfortunately, we cannot yet be certain if the aether is behaving as predicted."},{"name":"THANCRED","text":"Have you finished awakening the water element? To be honest, I don't see any difference."},{"name":"RYNE","text":"That was incredible! Is that what a primal looks like?"},{"name":"RYNE","text":"Oh, not quite the same, then. But why is that?"},{"name":"URIANGER","text":"The Leviathan of the Source was summoned by the Sahagin, to whom he was no less than a god."},{"name":"URIANGER","text":"Without their faith, the deiform entity that we brought into existence differed on a fundamental level, though it was no less formidable."},{"name":"URIANGER","text":"The manifestation relied upon <span class=\"highlight\">Forename</span>'s experiences of Leviathan, and may have been influenced by recollections of other water-aspected beings, leading to further discrepancies."},{"name":"RYNE","text":"Memories brought to life..."},{"name":"RYNE","text":"But I still can't tell if our plan actually worked."},{"name":"RYNE","text":"We'll just have to wait and see, I guess."},{"name":"THANCRED","text":"(-Thancred-)How goes it?"},{"name":"THANCRED","text":"(-Thancred-)If you've finished slaying your primal, or whatever it is, I suggest you get back here on the double. There's something you ought to see."},{"name":"RYNE","text":"Hmm...what could that be?"},{"name":"URIANGER","text":"Evidently, our only recourse is to return to our base of operations forthwith."},{"name":"RYNE","text":"<span class=\"highlight\">Forename</span>, look!"},{"name":"URIANGER","text":"By the Twelve's good grace... 'Tis a marvel to behold."},{"name":"RYNE","text":"I never thought that a whole lake would suddenly appear like this!"},{"name":"RYNE","text":"And we're just getting started. I only hope the burden is not too much for you, <span class=\"highlight\">Forename</span>."}],"reward":{"gil":3000,"items":[{"num":5,"id":25190},{"num":3,"id":25187,"one":1},{"num":3,"id":25188,"one":1},{"num":3,"id":25189,"one":1}],"instance":30080},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[68793]},"next":[68795]},"partials":[{"type":"npc","id":"1030110","obj":{"i":1030110,"n":"Ryne","l":3214,"q":6}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"instance","id":"30080","obj":{"i":30080,"n":"Eden's Gate: Inundation","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":425}},{"type":"quest","id":"68793","obj":{"i":68793,"n":"One Fell Swoop","g":23,"l":"The Core","s":3,"f":1}},{"type":"quest","id":"68795","obj":{"i":68795,"n":"Super Seismic","g":23,"l":"The Empty","s":5,"f":1}}]}