{"quest":{"name":"Deploy the Core","location":"The Empty","id":68792,"patch":5.01,"sort":2,"icon":112350,"unlocksFunction":1,"eventIcon":71341,"issuer":1030095,"target":1030104,"genre":23,"journal":["Ryne waits anxiously for Thancred to return from surveying the vicinity.","After returning to camp, Thancred is filled with apprehension upon hearing that Ryne intends to restore the world's natural balance by seizing control of Eden. She has detected something resembling the core of a Talos and suggests using similar methods to manipulate it. Urianger agrees that her theory is sound, and he posits that by riding aetherial currents, you will be able to teleport to the inner reaches. However, Thancred points out that although Eden seems to be in a mostly dormant state, there is likely to be some manner of defense against intruders, possibly utilizing powerful sin eaters. Since you are the only one able to vanquish a Lightwarden without it transferring to a new host, Thancred requests that you lead the way. Despite not having the slightest inkling as to what lies in wait, you and your fellow adventurers nevertheless step forward, ready to face any foe that would bar your way.<br><br>※Eden's Gate: Resurrection can be accessed via the Duty Finder.","As predicted, you are greeted by a fearsome protector upon entering the expansive interior of Eden. Bearing a striking resemblance to its namesake, Eden Prime proved a fierce opponent before ultimately succumbing to your onslaught. Your comrades eagerly await news of your victory at the base camp, as they make preparations to teleport themselves to the core of the mysterious entity.","Ryne, Thancred, and Urianger are delighted that you have returned relatively unharmed from your encounter with Eden Prime. The Aethernet shards have been activated, and you may now travel between the camp and Eden's core at will.","With Urianger's mechanisms in place, Ryne begins the daunting task of bringing Eden under her control. Her efforts are met with violent resistance, as the vast sin eater thrashes violently in an attempt to break free. Nevertheless, Ryne refuses to relinquish her hold, and for a few fleeting moments, it appears that she may yet succeed in overcoming her gargantuan foe. Eden, however, is not so easily subdued, and the tremors resume with even greater ferocity, as it lifts itself out of the crater and high into the air. With so much resting on the shoulders of your young comrade, you can only watch as the battle of wills rages on."],"objectives":["Enter Eden's Gate: Resurrection.","Speak with Ryne.","Speak with Ryne in Eden's core."],"dialogue":[{"name":"URIANGER","text":"Though frequent rest may allay the symptoms of prolonged exposure to the Empty's ambient aether, 'twould be unwise to linger here overlong."},{"name":"RYNE","text":"I wonder what's taking Thancred so long?"},{"name":"RYNE","text":"Ah, there he is!"},{"name":"THANCRED","text":"Well, that was rather uneventful. Not that I'm complaining."},{"name":"RYNE","text":"Did you find anything?"},{"name":"THANCRED","text":"No, thankfully. There's naught but barren plains in every direction, apart from Eden, obviously. I tried approaching it, and the brute didn't even seem to notice me. I thought it best not to tempt fate, so I withdrew."},{"name":"RYNE","text":"We should act now, before it's fully awake."},{"name":"THANCRED","text":"Meaning what, exactly?"},{"name":"RYNE","text":"When I think about the Flood of Light, I get the feeling that rather than destroying everything in its path, what it actually did was stop the flow of aether."},{"name":"RYNE","text":"Of course, that meant that all of the plants, animals, and people here could no longer survive. They must've crumbled to dust in the years since."},{"name":"RYNE","text":"But the aether is still here, lying dormant."},{"name":"RYNE","text":"If Eden is the one that caused it, maybe it can get it flowing again."},{"name":"RYNE","text":"I don't know for certain, but I think I can use Eden to bring life back to the Empty!"},{"name":"THANCRED","text":"Now, hold on a moment! What makes you think that's even possible? And how do you expect to control that kind of power?"},{"name":"URIANGER","text":"Ryne's aspirations may not be as preposterous as thou dost surmise."},{"name":"URIANGER","text":"I believe Minfilia halted the Flood of Light's advance not by destroying Eden, but by silencing it."},{"name":"URIANGER","text":"And in so doing, she hath gifted us an opportunity too precious to waste."},{"name":"THANCRED","text":"Even now, the flame of hope burns on."},{"name":"URIANGER","text":"Aye. As Minfilia's successor, it standeth to reason that Ryne doth possess the means to exert her will over Eden. But such a monumental task is not to be taken lightly. What sayest thou, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I imagine this is easier said than done."},{"name":"A1","text":"It would put Ryne's life at risk!"},{"name":"RYNE","text":"Yes, you're probably right, but I have to try!"},{"name":"RYNE","text":"There's more at stake than just my life. If Eden is allowed to awaken, who knows what will happen? I have to try!"},{"name":"THANCRED","text":"Very well, Ryne. You've made up your mind. So, how should we go about this?"},{"name":"RYNE","text":"I have an idea. I've been studying it carefully ever since we arrived, and it seems to me that the Light is more...concentrated at a certain point. I suppose you could call it the core."},{"name":"RYNE","text":"That giant Talos had a core too. Like a beating heart, it controlled the flow of aether. If Eden's core is the same, perhaps we could use it to restore the aetheric balance?"},{"name":"URIANGER","text":"The theory is certainly sound..."},{"name":"URIANGER","text":"By employing Aethernet shards as beacons, mayhap we could trace the aetherial flow to Eden's core, and in so doing secure the means to teleport to the very heart of the beast."},{"name":"URIANGER","text":"Thankfully, the Settlement council has kindly furnished us with a plethora of apparatus by which to perform such feats."},{"name":"URIANGER","text":"However, we must needs first have Ryne study the entity's interior and chart us a suitable course."},{"name":"URIANGER","text":"Once we have reached our destination, I shall fabricate a means by which you may directly communicate with Eden, and mayhap exert a measure of control over it."},{"name":"RYNE","text":"You can really do that, Urianger?"},{"name":"URIANGER","text":"All credit is due to a dear friend. A gentle soul long since departed who imparted to me a wealth of knowledge concerning aetherology."},{"name":"URIANGER","text":"Although I am certain she would be all too quick to chastise my methodology..."},{"name":"THANCRED","text":"Excuse me for interrupting this trip down memory lane, but I don't imagine that Eden will be too happy about us...rummaging around in its innards, for want of a better term."},{"name":"THANCRED","text":"In all seriousness, though, I wouldn't be surprised if there is some sort of welcoming party arranged for intruders. Perhaps you had best lead the way, <span class=\"highlight\">Forename</span>?"},{"name":"RYNE","text":"It's true that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s the only one who can defeat a Lightwarden, but I'd rather not rely on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> any more than we have to."},{"name":"THANCRED","text":"Yes, I haven't forgotten what happened when <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> absorbed too much Light. But as Alisaie said, “Making promises you have no way of keeping is not a kindness.”"},{"name":"THANCRED","text":"Now, I wish I could put down Wardens myself, but the simple fact is I can't, and there's no point pretending I can. That's why I'm asking <span class=\"highlight\">Forename</span>."},{"name":"RYNE","text":"Then perhaps I could─"},{"name":"THANCRED","text":"You already have a job to do, remember?"},{"name":"THANCRED","text":"The only reason this plan even has a chance of success is because of your involvement. We need you to concentrate on the task at hand, and guide us to the core."},{"name":"THANCRED","text":"Not only that, you'll have to keep an eye on Eden itself. If we somehow manage to make it angry, get us out of there."},{"name":"RYNE","text":"Are you sure you want to go through with this?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"This is what I do best."},{"name":"A2","text":"For lack of any better plans, this one will have to do."},{"name":"RYNE","text":"I won't let you down!"},{"name":"URIANGER","text":"Though we will remain here, Ryne and I shall do our utmost to guide thee along the aetherial stream."},{"name":"URIANGER","text":"After thou hast breached the exterior, we shall remain in contact via these linkpearls, courtesy of our comrades in the Crystarium."},{"name":"URIANGER","text":"Being relics salvaged from the Crystal Tower, I fear they may be somewhat less reliable than those to which thou art accustomed."},{"name":"URIANGER","text":"The teleportation apparatus hath been calibrated successfully, and I believe the probability of irreversible disintegration to be relatively low."},{"name":"THANCRED","text":"I can't get this bloody thing lit! It must be because the aether has stopped flowing, just as Ryne said."},{"name":"THANCRED","text":"Though if this plan of hers and Urianger's actually works, we might have to stop calling this place “the Empty.”"},{"name":"RYNE","text":"We're ready when you are, <span class=\"highlight\">Forename</span>!"},{"name":"RYNE","text":"(-Ryne-)Be careful! Huge amounts of aether are rushing to the core! Wait... What's that!?"},{"name":"URIANGER","text":"Though we anticipated some form of resistance, I did not foresee Eden generating a smaller replica of itself. To think that a mere fraction of its power could manifest such a powerful adversary is frightening indeed."},{"name":"THANCRED","text":"It seems that we'll have to wait for the aether within Eden to stabilize before we can all teleport to the core."},{"name":"SYSTEM","text":"It would be best to consult Ryne and Urianger before attempting to use the Aethernet shard."},{"name":"RYNE","text":"It seems that Thancred's prediction about there being some sort of guardian was right. Thankfully, it was nothing that you couldn't handle."},{"name":"RYNE","text":"And I'm glad to say that you haven't absorbed any Light, either. So far, so good."},{"name":"RYNE","text":"Now that the way is clear, the Aethernet shards can send us to the core and back whenever we need. Why don't we give them a try?"},{"name":"URIANGER","text":"Though the apparatus is now in place, a number of minute adjustments must needs be made before attempting to assert control over Eden."},{"name":"THANCRED","text":"Standing around and waiting is hardly my forte, though I daresay I'm more suited to this than whatever Urianger's doing."},{"name":"YSENO","text":"Proceed to Eden's core?"},{"name":"RYNE","text":"Once Urianger has activated the device, it's my turn."},{"name":"URIANGER","text":"The time hath come, Ryne."},{"name":"RYNE","text":"Watch over me, Minfilia."},{"name":"THANCRED","text":"Is this supposed to happen!?"},{"name":"URIANGER","text":"Eden is...offering considerable resistance..."},{"name":"RYNE","text":"Not now...not when I'm so close!"},{"name":"THANCRED","text":"Urianger!"},{"name":"URIANGER","text":"I am unharmed, but what of Ryne?"},{"name":"RYNE","text":"No! You listen to <span class=\"emphasis\">me</span>!"},{"name":"THANCRED","text":"Ryne, be careful!"}],"reward":{"gil":3000,"items":[{"num":5,"id":25197},{"num":3,"id":25187,"one":1},{"num":3,"id":25188,"one":1},{"num":3,"id":25189,"one":1}],"instance":30078},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[68791]},"next":[68793]},"partials":[{"type":"npc","id":"1030095","obj":{"i":1030095,"n":"Ryne","l":3225,"q":2}},{"type":"npc","id":"1030104","obj":{"i":1030104,"n":"Ryne","l":3214,"q":1}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"instance","id":"30078","obj":{"i":30078,"n":"Eden's Gate: Resurrection","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":425}},{"type":"quest","id":"68791","obj":{"i":68791,"n":"In the Middle of Nowhere","g":23,"l":"The Crystarium","s":1,"f":1}},{"type":"quest","id":"68793","obj":{"i":68793,"n":"One Fell Swoop","g":23,"l":"The Core","s":3,"f":1}}]}