{"quest":{"name":"In the Middle of Nowhere","location":"The Crystarium","id":68791,"patch":5.01,"sort":1,"icon":100843,"unlocksFunction":1,"eventIcon":71341,"issuer":1030090,"target":1030095,"genre":23,"journal":["One of the Crystarium guards is particularly relieved to have found you.","After finally managing to track you down, Ryne reveals that she has sensed a concentration of Light in the Empty, the name for the lands once swallowed by the Flood. Fearing that another cataclysm may be on the horizon, Ryne asks you to join her, Thancred, and Urianger on an expedition into the barren wastes to investigate the phenomenon. You arrange to rendezvous with them at the Derrick, from where you will depart on this potentially perilous journey.","Upon arriving at the Derrick, you are greeted by Urianger and Thancred, who are keen to begin the investigation as soon as possible. Neither of them are exactly thrilled by the prospect of journeying through the Empty, where the ambient aether is wildly imbalanced, making it unwise to travel by amaro or chocobo. Luckily, Thancred has borrowed a more mechanical mode of transport from the Crystarium, the skyslipper, which is less likely to be affected by such anomalies. With all of the necessary supplies and equipment at the ready, the four of you prepare to board the craft and embark on a voyage into parts unknown.","The first leg of the journey is remarkably uneventful, with naught but featureless wastelands for malms around. The monotony of the scenery eventually sends you into a deep sleep, and you are only awoken by Thancred's exclamations of surprise at the sight of a gargantuan entity resting inside a vast crater. Urianger comes to the conclusion that this is the first sin eater, the instigator of the Flood of Light. Rather than formulating a means of destroying the beast, he theorizes that the power which once threatened to consume all life on the planet might instead be used to restore what was lost. Ryne, who seems to share Urianger's optimism, even suggests naming it “Eden,” which comes from the Fae word for “utopia.” Thancred, on the other hand, turns the group's attention to more practical matters, such as setting up a camp from where to plan your next move.","After you finish laying out a simple camp to act as a base of operations, Thancred leaves to scout the area, and Ryne suggests waiting for him to return before you begin discussions on how best to investigate Eden. It remains to be seen whether the vast sin eater is the key to restoring balance to this shattered world or an adversary that must be eliminated."],"objectives":["Speak with Ryne near the Derrick.","Speak with Ryne.","Speak with Ryne again."],"dialogue":[{"name":"GUARD03255","text":"Ah, <span class=\"highlight\">Forename</span>! Have you seen Ryne? She's been looking for you."},{"name":"GUARD03255","text":"Wait here. I'll go and get her."},{"name":"RYNE","text":"There you are!"},{"name":"RYNE","text":"The truth is, I need your help..."},{"name":"RYNE","text":"Now hold on─I haven't even told you what it is yet!"},{"name":"RYNE","text":"Ahem. After you defeated Emet-Selch, I sensed a strange concentration of Light, somewhere far to the south."},{"name":"RYNE","text":"In the Empty─the lands that were once swallowed by the Flood."},{"name":"RYNE","text":"I can't tell what it is, but we have to find out. For all we know, it might even be another Lightwarden!"},{"name":"RYNE","text":"But whatever it may be, I don't intend to stand by and watch. I'll..."},{"name":"RYNE","text":"Sorry, I'm getting ahead of myself. Thancred, Urianger, and I have a few theories that we plan to test once we find whatever's causing this."},{"name":"RYNE","text":"The three of us were reluctant to ask for your help, considering everything that you've been through. The thing is, you're the only person who can defeat a Lightwarden without becoming one yourself, so we have no choice."},{"name":"RYNE","text":"While we don't want to jump to conclusions, it would be a good idea to have you there, just in case."},{"name":"RYNE","text":"So, will you come with us?"},{"name":"Q1","text":"What will you say?"},{"name":"Q1","text":"I wouldn't have it any other way!"},{"name":"Q1","text":"Perhaps we should let sleeping dogs lie."},{"name":"RYNE","text":"Thank you, <span class=\"highlight\">Forename</span>! This means a lot."},{"name":"RYNE","text":"I see your point, but if we choose to ignore it, we should at least know <span class=\"emphasis\">what</span> we're ignoring first. And there's no harm in taking a look, is there?"},{"name":"RYNE","text":"First of all, let's head to the Derrick in Amh Araeng. Thancred and Urianger should have everything ready by now."},{"name":"THANCRED","text":"Sorry to drag you all the way out here. I have a feeling you'll miss this place when you see where we're going next, though."},{"name":"URIANGER","text":"'Tis a blessing to see thee so hale."},{"name":"RYNE","text":"I hope the desert creatures didn't give you too much trouble on the way here."},{"name":"THANCRED","text":"I doubt they posed any sort of challenge to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. Would that I could say the same with confidence about whatever fiend may be waiting for us out there."},{"name":"THANCRED","text":"Even if the Light that Ryne sensed turns out to be nothing of consequence, the Empty is hardly the most welcoming of places. Anything that could survive out there is not to be trifled with."},{"name":"URIANGER","text":"Moreover, it should be reiterated that the Light-blasted wasteland poseth as severe a threat as any foe we might face."},{"name":"URIANGER","text":"In any event, we are in agreement that this phenomenon doth warrant investigation. Though for lack of more precise means of navigation, we must needs rely on Ryne's innate abilities to guide us."},{"name":"URIANGER","text":"I have formed several hypotheses regarding the nature of the Light, but speculation is a poor substitute for firsthand observation."},{"name":"RYNE","text":"There'll be plenty of time for us to talk about it on the way."},{"name":"RYNE","text":"Is the skyslipper ready, Thancred?"},{"name":"THANCRED","text":"Ready to take us wherever we need to go, aye. Back again too, maybe, if we ask it nicely."},{"name":"URIANGER","text":"Though the Light hath been expunged from Norvrandt, the ambient aether of the Empty is still corrupted. Dangerously so, in fact."},{"name":"URIANGER","text":"The Flood of Light devastated everything in its wake. The soil, the air, the water, all rendered incapable of supporting life."},{"name":"URIANGER","text":"'Tis due to this imbalance that the Empty remaineth utterly uninhabitable, even a century thereafter."},{"name":"THANCRED","text":"That's why we're taking every possible precaution. Between the aetherometers I've packed and Ryne's unique abilities, we should be able to detect and measure any fluctuations in our alignments."},{"name":"THANCRED","text":"According to the Crystarium scouts, a few days out there won't affect us to any noticeable degree. But much longer than that, and we risk becoming sin eaters..."},{"name":"THANCRED","text":"Since we still don't know how chocobos and amaro will fare in the Empty, we opted for a more mechanical mode of transportation. This comes courtesy of the researchers at the Mean, who found it in the Crystal Tower and restored it to working order."},{"name":"RYNE","text":"It's quite safe, I promise. The person in charge said he'll have parts delivered from the Crystarium should anything break."},{"name":"RYNE","text":"He seemed quite eager to see what we bring back from the Empty, even though I told him we're not hunting for treasure. I'll introduce you if we have a chance to stop by Mord Souq at some point."},{"name":"RYNE","text":"Anyway, I think that covers everything. When you're ready to leave, just say the word!"},{"name":"THANCRED","text":"While I'm piloting and Ryne's navigating, you and Urianger will be free to enjoy the view and engage in rousing conversation. By that, I mean he can spend the whole time talking at you, while you nod in agreement."},{"name":"URIANGER","text":"Although the Flood of Light is believed to have expunged all traces of life from the Empty, we must remain ever vigilant. We know not what we shall find."},{"name":"RYNE","text":"Well then, shall we?"},{"name":"YESNO","text":"Depart for the Empty?"},{"name":"THANCRED","text":"With a name like “the Empty,” I wasn't expecting much in the way of pleasant scenery, but this is downright depressing."},{"name":"URIANGER","text":"To look on the lands swallowed by the Flood with mine own eyes... 'Tis a chilling sight indeed."},{"name":"URIANGER","text":"Approximately nine-tenths of this world are as this. A slate all but wiped clean..."},{"name":"THANCRED","text":"Were it not for the Warriors of Darkness and Minfilia..."},{"name":"THANCRED","text":"Ryne, are you sure we're heading in the right direction?"},{"name":"RYNE","text":"Yes, I'm certain. There's no telling how far away it is, though."},{"name":"THANCRED","text":"Nothing for it but to keep going, then. You two back there may as well take a nap. I have a feeling we've a good few malms ahead of us."},{"name":"THANCRED","text":"I have to say, it's a touch larger than I was expecting. And is it...sleeping?"},{"name":"RYNE","text":"No. It's waking up."},{"name":"THANCRED","text":"I don't like the sound of that... Is it a Lightwarden?"},{"name":"RYNE","text":"No, I don't think so. Instead of being filled with Light...it <span class=\"emphasis\">is</span> Light."},{"name":"URIANGER","text":"The first sin eater..."},{"name":"URIANGER","text":"Long have I strived to unravel the mysteries surrounding the Flood of Light. To discover what set that terrible cataclysm in motion."},{"name":"URIANGER","text":"Every thread led to the same conclusion. The same single point..."},{"name":"THANCRED","text":"Or single being..."},{"name":"URIANGER","text":"I have reason to believe that the entity we see before us is the first sin eater. The instigator of the Flood─the very foe Minfilia vanquished a century ago."},{"name":"THANCRED","text":"She gave everything she had...and won."},{"name":"THANCRED","text":"...But this abomination could undo her work."},{"name":"URIANGER","text":"Aye, the possibility cannot be denied. Though it is oft said that destruction and creation are but two sides of the same coin."},{"name":"URIANGER","text":"Ryne, knowest thou of what I speak?"},{"name":"RYNE","text":"The power to shape reality, to bend the laws of nature. For what was once shattered may be forged anew."},{"name":"THANCRED","text":"That's all well and good, but don't you think we should give it a name first?"},{"name":"RYNE","text":"...Eden."},{"name":"URIANGER","text":"\"Utopia“ in Fae. A most auspicious title."},{"name":"THANCRED","text":"Now that that's settled, perhaps we should find a spot to set up camp. I even brought a couple of tents, on the off chance, but pitching the damned things is something of a fine art. Does anyone fancy helping me?"},{"name":"URIANGER","text":"Though frequent rest may allay the symptoms of prolonged exposure to the Empty's ambient aether, 'twould be unwise to linger here overlong."},{"name":"RYNE","text":"I never realized that putting tents up could be such a bother! Still, I'm glad that we got there in the end."},{"name":"RYNE","text":"Thancred should be back from scouting the area soon. Once he's here, we can plan our next move."},{"name":"SYSTEM","text":"During the course of your investigation, you may discover valuable artifacts."},{"name":"SYSTEM","text":"These can be exchanged for equipment by speaking with Ghul Gul in Mord Souq or Yhal Yal in Eulmore."}],"reward":{"gil":1150},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69190]},"next":[68792]},"partials":[{"type":"npc","id":"1030090","obj":{"i":1030090,"n":"Anxious Crystarium Guard","l":2951,"q":1}},{"type":"npc","id":"1030095","obj":{"i":1030095,"n":"Ryne","l":3225,"q":2}},{"type":"quest","id":"69190","obj":{"i":69190,"n":"Shadowbringers","g":8,"l":"The Tempest","s":1060}},{"type":"quest","id":"68792","obj":{"i":68792,"n":"Deploy the Core","g":23,"l":"The Empty","s":2,"f":1}}]}