{"quest":{"name":"For Better or Worse","location":"Ul'dah","id":68799,"patch":5.0,"sort":111,"icon":100871,"unlocksFunction":1,"eventIcon":71341,"issuer":1029044,"target":1029073,"genre":162,"journal":["Radovan has found a citizen of Ul'dah in need of a bodyguard.","Sophie and Radovan's search for the next client has borne fruit, although they have yet to ascertain the nature of the assignment. A woman named Oriel has asked that you meet her near the Gate of Thal to discuss the details.","Oriel and her son, Timm, are in need of protection from her estranged husband, Gerrart, who persists in harassing the young mother. As he is in the habit of surprising her in locations where he is unlikely to be seen, Oriel suggests luring him outside of the city walls and catching him by surprise. You and Radovan accept the task of waiting for Gerrart to accost her before sending him scurrying with his tail between his legs.","Outside of the Gate of Thal, Gerrart appears from nowhere to bother Oriel, exactly as she had predicted. Radovan, deciding that he has seen enough, makes his presence known, and states in no uncertain terms that Gerrart should leave his wife and child in peace or face the consequences. The man is soon cowed and beats a hasty retreat, leaving Oriel to congratulate you all on a job well done before saying her farewells. Sophie, however, cannot escape the feeling that something is amiss, and urges you to go after Oriel.","Following Sophie's hunch, you find Oriel in conversation with two thoroughly suspicious characters, and it soon becomes clear she intends to sell her own child into slavery. It is at this very moment that Gerrart appears, although his attempt to rescue his son is swiftly thwarted. Just as Radovan prepares to burst forth and save him, he finds himself racked with pain and totally immobilized. The slavers have every intention of silencing the witness to their foul deeds, and only you and Sophie are in any position to stop them.","The two slave traders never stood a chance against your gunblade, and the immediate danger has been averted. Gerrart's reckless charge at two armed men ended with him being sent sprawling, and he is fortunate to have escaped with only minor injuries. Now that he has recovered somewhat, you decide to press him for an explanation on how this sorry incident came to pass.","Gerrart reveals that as a result of his gambling and ever-increasing debt, Oriel left him to seek a new life, taking their infant son with her. She quickly became entangled with members of Ul'dah's dark underbelly, and turned to somnus as a means of numbing herself to the misery that had consumed her. Meanwhile, Gerrart had made an earnest attempt to put his vices behind him and had secured a steady income. When he felt ready to face Oriel, he found that she had fallen into dire straits, placing the blame entirely upon himself. Gerrart intends to use the money he has saved to send Oriel to Frondale's Phrontistery for the treatment she needs, while he takes custody of Timm. Although there is no certainty that his wife will ever return to her former self, Gerrart is determined to salvage what he can from the wreckage of his broken family.<br><br>Radovan is not entirely satisfied with the outcome of the day's events, and offers an apology for once again making a burden of himself. He explains that he still suffers the aftereffects of the electric shocks administered by Garlean gaol wardens while he was incarcerated for insubordination. Radovan had spent ten years secretly digging a tunnel in an attempt to escape, only to find himself bursting through the wall of Sophie's cell. Making their way outside of the gates in the commotion that followed, they ran until they were beyond the reach of the Empire. Wishing to continue their journey through Eorzea, Sophie and Radovan suggest moving on to Limsa Lominsa in search of new prospects.","Once again, Radovan and Sophie have introduced themselves to the local Adventurers' Guild. While there are no jobs suitable for your group at present, it is only a matter of time before someone has need of a gunbreaker or two.<br><br>※The next gunbreaker quest will be available from Radovan upon reaching level 65."],"objectives":["Speak with Oriel at the Gate of Thal.","Speak with Radovan at Spineless Basin.","Speak with Radovan in Drybone.","Defeat the slavers.","Aid Gerrart.","Speak with Radovan in the Drowning Wench."],"dialogue":[{"name":"SOPHIE","text":"I want to go and see the famous Gold Saucer, but Radovan says we're on too tight a budget to fritter our money away like that. I'll try asking him again once we find some more lucrative work."},{"name":"RADOVAN","text":"The walls that surround this city remind me of my homeland. We built it as a fortress to keep out invaders."},{"name":"RADOVAN","text":"Not that it made much difference...in the end."},{"name":"SOPHIE","text":"Oh, not this again! Perhaps you could lighten the mood by sharing our recent bit of good news?"},{"name":"RADOVAN","text":"Ah, yes. It looks like we've found our next client."},{"name":"RADOVAN","text":"Nothing's been decided, but a lady named Oriel is waiting for us near the Gate of Thal. We'll meet you there."},{"name":"RADOVAN","text":"Perhaps I should let you do the talking."},{"name":"SOPHIE","text":"I hope this doesn't involve any babysitting..."},{"name":"ORIELSBOY","text":"I'm not supposed to talk to strangers."},{"name":"ORIEL","text":"You're the bodyguards, right? We need your help! It's my husband─after he walked out, I thought I'd seen the last of him, but now... You've got to keep him away from us!"},{"name":"RADOVAN","text":"Ah...I'm not sure we're qualified to settle domestic disputes."},{"name":"SOPHIE","text":"Radovan! This sounds serious. Hear her out, would you!?"},{"name":"RADOVAN","text":"Very well. My apologies. Please continue."},{"name":"ORIEL","text":"His name's Gerrart. He won't leave us alone, and he keeps jumping out to harass us when we're by ourselves. If we were to go outside the city gates, I'm sure he'd follow us. And when he does, I want you to scare him off!"},{"name":"RADOVAN","text":"I doubt he'll show himself if he sees you have bodyguards, so we'll wait somewhere nearby. When the moment is right, we'll give him a fright he won't forget in a hurry."},{"name":"ORIEL","text":"Yes, that ought to work. Timm and I will leave through this gate, so you should find a hiding place. It's time that bastard─excuse my language─learned his lesson!"},{"name":"ORIEL","text":"If he tries anything, make him pay!"},{"name":"ORIELSBOY","text":"Are we waiting for Daddy?"},{"name":"SOPHIE","text":"This husband of hers sounds like a nasty piece of work. We'd best be ready for trouble."},{"name":"RADOVAN","text":"Remember, we've got the boy to think about. I'd rather not cut a man down in front of his own son, but I will if I have to. You follow my lead."},{"name":"RADOVAN","text":"Get away from her!"},{"name":"GERRART","text":"What!? Who the bloody hells are you?"},{"name":"RADOVAN","text":"Friends of Oriel. Now walk away, while you still can."},{"name":"GERRART","text":"But I only want what's best for my boy!"},{"name":"ORIEL","text":"<span class=\"emphasis\">Your</span> boy!? You've got no right to call him that. He belongs to me!"},{"name":"RADOVAN","text":"This is your final warning. Bother them again, and you won't live to regret it."},{"name":"ORIEL","text":"Ha ha! That'll teach him. And you were wonderful─worth every gil! Thank you so much!"},{"name":"RADOVAN","text":"It was our pleasure."},{"name":"RADOVAN","text":"Although there wasn't much for you to do, your presence lent weight to my words. But most importantly, the client was satisfied with our work."},{"name":"SOPHIE","text":"Yes, she did seem rather pleased with herself..."},{"name":"SOPHIE","text":"Listen, you two! There's no time to explain. We have to follow that woman!"},{"name":"RADOVAN","text":"Hells' bells! When Sophie gets one of her hunches, there's no stopping her!"},{"name":"SOPHIE","text":"I knew she was up to something!"},{"name":"RADOVAN","text":"Why would she bring Timm all the way out here?"},{"name":"HIGHLANDER03263","text":"What're we s'posed to do with a runt like this?"},{"name":"MIDLANDER03263","text":"If we feed 'im up, 'e might be worth summink one day."},{"name":"RADOVAN","text":"She's selling her own child!? We've got to stop them!"},{"name":"RADOVAN","text":"Wait, is that...?"},{"name":"GERRART","text":"Enough of this!"},{"name":"GERRART","text":"Stay away from my son!"},{"name":"HIGHLANDER03263","text":"Son, eh? Ha! You should've kept out of this, mate. Too late now."},{"name":"RADOVAN","text":"Quickly, we've got to help him!"},{"name":"RADOVAN","text":"Hnnngh!"},{"name":"RADOVAN","text":"Not now... <span class=\"highlight\">Forename</span>! It's up to you!"},{"name":"RADOVAN","text":"Gods, why now!? Damn these seizures!"},{"name":"SOPHIE","text":"Oh, Radovan! Of all the times!"},{"name":"BALLOON","text":"Where'd <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> come from!?"},{"name":"BALLOON","text":"Don't let <span class=\"alternative-container\"><span class=\"alternative\">'er</span><span class=\"alternative\">'im</span></span> get away!"},{"name":"RADOVAN","text":"Never mind me! Go and see to Gerrart!"},{"name":"SOPHIE","text":"Talk about bad timing..."},{"name":"GERRART","text":"You saved us... How can I ever─"},{"name":"ORIELSBOY","text":"Daddy!"},{"name":"RADOVAN","text":"<span class=\"highlight\">Forename</span>, I let you down. I let everyone down. But, Sophie─what happened here?"},{"name":"SOPHIE","text":"I knew from the moment I met Oriel there was something not quite right about her. It wasn't until later I realized: She's a somnus addict. Once it takes hold, it...changes you."},{"name":"SOPHIE","text":"She was able to keep her addiction hidden from most, but not from me, and probably not from her family either."},{"name":"GERRART","text":"Yes, I've known for a while. But I had no idea she'd do something like this."},{"name":"GERRART","text":"Gods! If I hadn't started gambling, this never would've happened. My debts spiraled beyond my control, and she ran to get away from me, to start a new life with our son."},{"name":"GERRART","text":"The shock of losing them made me realize I couldn't live like that anymore. So I vowed to turn my life around, and I worked my fingers to the bone to repay the money I owed. But by the time I finally found the courage to track down Oriel, it was too late..."},{"name":"GERRART","text":"She'd made new friends─the wrong sort of friends─and had to resort to gods only know what to make ends meet. It became too much to bear, and somnus was her only escape. Nothing else mattered to her, not even her own child."},{"name":"GERRART","text":"So you see, it wasn't only my life I'd ruined. I made her who she is today. That's why I don't have it in me to hate her."},{"name":"SOPHIE","text":"What will you do now?"},{"name":"GERRART","text":"I plan to send her to Frondale's Phrontistery. They can treat people like Oriel, although it costs more than most folks can afford. My savings should cover it for a short while, at least."},{"name":"GERRART","text":"We'll take it one day at a time and see how she responds to the treatment. I know she might never recover, but I can't give up on her. Obviously, she's in no fit state to look after Timm, so he'll be living with me."},{"name":"RADOVAN","text":"You could've been killed confronting those slavers. If you wind up dead, there'll be no one to look after the boy. From now on, you'll have to think before you act."},{"name":"GERRART","text":"I will, I swear it. Thank you all, for everything you've done."},{"name":"RADOVAN","text":"That poor child... Sophie's quick thinking may have saved him on this occasion, but I fear his hardships are far from over. I, on the other hand, only succeeded in disgracing myself. Again."},{"name":"SOPHIE","text":"It's not your fault, Radovan. I think you owe <span class=\"highlight\">Forename</span> an explanation, though."},{"name":"RADOVAN","text":"Yes... If we are to fight side by side, there is something you should know."},{"name":"RADOVAN","text":"Though I served as an imperial conscript for a time, after I disobeyed a direct order I was sentenced to solitary confinement for more than a decade."},{"name":"RADOVAN","text":"Like many of the inmates, I was forced to wear a magitek collar."},{"name":"RADOVAN","text":"The wardens could use them to administer a severe electric shock any time they pleased. And please them it did."},{"name":"RADOVAN","text":"The paralysis would eventually wear off, but even now, years after removing the collar, my whole body will suddenly seize up. It's as though the pain never left me, and could reawaken at any moment."},{"name":"RADOVAN","text":"Thankfully, my condition appears to have improved somewhat since leaving the Empire. Perhaps one day I will be free of it, but until then, there's no telling when it might strike."},{"name":"SOPHIE","text":"Radovan's saved my bacon more times than I can count, so it's only fair that I do the same for him. We've been through thick and thin, ever since the first time we met in that Garlean gaol."},{"name":"SOPHIE","text":"I was awaiting execution along with the other captured members of the resistance, as well as various insurgents and undesirables."},{"name":"SOPHIE","text":"Among them were several somnus addicts. Even in an imperial gaol, there are ways to get your hands on it. When I saw Oriel, I couldn't put my finger on it at first, but she had the same look in her eyes as those lost souls."},{"name":"SOPHIE","text":"Anyway, where was I? So, Radovan had been meaning to escape ever since he was first imprisoned, and was secretly digging a tunnel, a few ilms each night, over the course of about ten years."},{"name":"SOPHIE","text":"The only thing was, it went the wrong way. Then one night, he suddenly burst through my wall!"},{"name":"RADOVAN","text":"Why did you have to tell <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> that!? You know I'm far from proud of my...miscalculation."},{"name":"SOPHIE","text":"Well, things worked out in the end, didn't they? The other inmates made such a racket when you came crashing in, it drew the attention of the wardens, and all hells broke loose."},{"name":"SOPHIE","text":"In the confusion, Radovan and I forced our way past the guards, and by some miracle, we managed to avoid their searchlights. And finally, we were free."},{"name":"RADOVAN","text":"Free to return to my wife and child, to my homeland. Or so I thought..."},{"name":"RADOVAN","text":"While I'd been rotting away in a Garlean cell, everything I knew, everything I loved had been taken from me. I should have been there. But I couldn't even─"},{"name":"RADOVAN","text":"Gah! Enough of this. We've spoken overlong as it is. Well then, where to next?"},{"name":"SOPHIE","text":"I think I've had my fill of Ul'dah. What say we try our luck in Limsa Lominsa? I'm sure a change of scenery will do us a world of good!"},{"name":"RADOVAN","text":"Yes, I like the sound of that. Let's reconvene at the local Adventurers' Guild."},{"name":"SOPHIE","text":"So, what do you think?"},{"name":"RADOVAN","text":"A city founded by pirates? Now there's a terrible idea if ever I heard one. With all the cutthroats running rampant, I'm surprised there's anyone left."},{"name":"SOPHIE","text":"But what about the views? The sea breeze?"},{"name":"RADOVAN","text":"There'll be plenty of time to enjoy ourselves once we've a few more gil in our pockets. <span class=\"highlight\">Forename</span>, we're still waiting for word from the Guild, so perhaps you should find somewhere for a few practice swings in the meantime."}],"reward":{"gil":1535},"reqs":{"jobs":[{"lvl":63,"id":149}],"quests":[68798]},"next":[68800]},"partials":[{"type":"npc","id":"1029044","obj":{"i":1029044,"n":"Radovan","l":40,"q":2}},{"type":"npc","id":"1029073","obj":{"i":1029073,"n":"Radovan","l":28,"q":2}},{"type":"quest","id":"68798","obj":{"i":68798,"n":"Hired Gunblades","g":162,"l":"East Shroud","s":102,"f":1}},{"type":"quest","id":"68800","obj":{"i":68800,"n":"Confessions of a Flaming Mongrel","g":162,"l":"Limsa Lominsa","s":121,"f":1}}]}