{"quest":{"name":"Hired Gunblades","location":"East Shroud","id":68798,"patch":5.0,"sort":102,"icon":100871,"unlocksFunction":1,"eventIcon":71341,"issuer":1029033,"target":1029044,"genre":162,"journal":["Radovan is keen for you to put your newly acquired skills into practice.","With your gunblade and soul crystal in hand, you have everything you need to begin your training as a gunbreaker. Instead of employing traditional methods, Radovan would rather you learned on the job, and suggests seeking work in Gridania. Since he and Sophie are newcomers to the Shroud, you suggest that they make the Adventurers' Guild their first port of call.","You arrive at the Carline Canopy to discover that not only have Sophie and Radovan registered as adventurers, they have also been given the details of someone seeking to hire bodyguards. You follow your new companions to the Wailing Barracks to meet a man named Lassenchou, your first client.","Following the briefest of introductions, Lassenchou reveals that the renowned harpsichordist Editha's life may be in danger. In addition to receiving a death threat, she narrowly escaped being injured by a stone thrown during a recent performance. In his capacity as her manager, Lassenchou has ordered that she remain inside until the perpetrator can be brought to justice. However, the musician has expressed her reluctance to remain confined any longer and insists upon taking an invigorating stroll through the sun-dappled groves of Gridania. As your task is to keep her safe from harm during the outing, Radovan suggests scouting the area and questioning the locals to ascertain the nature of those who seek to intimidate Editha.","Quizzing a handful of Gridanians reveals a range of opinions on the popular harpsichordist. Perhaps the most pertinent tidbit of information is that some of Editha's followers have taken their infatuation to worrying levels, which Radovan will no doubt be interested to hear.","You find Radovan engaged in a rather one-sided conversation with a lady named Ondine, who seems all too eager to share her opinions with any and all who will listen. Her views are in line with the general consensus that the person threatening Editha is likely to be one of her admirers, although Radovan avoids jumping to conclusions for the time being, deciding to view anyone and all with equal suspicion. Although he would prefer to obtain more reliable information before beginning the assignment, he decides against keeping the client waiting for longer than necessary.","You return to Lassenchou to find him bedecked in an elaborate suit of armor, seemingly intent on joining you, while Editha prances around, blissfully oblivious to the danger she faces. Though Radovan is clearly exasperated that your charge has next to no chance of remaining undetected, he formulates a plan of action, wherein you and your mentor will lead the mission while Lassenchou and Sophie remain behind, ready to provide support if needed. Upon embarking on what is supposed to be a sedate promenade through Gridania, you are soon accosted by bandits and savage creatures, all commanded by an enigmatic masked woman.","Overwhelmed by the combined might of two gunbreakers, the masked villain is forced to reveal her true identity: Ondine, one of the locals you spoke with during your investigation. She, like Editha, is a harpsichordist, although her popularity waned as her followers deserted her in favor of her young rival. Her hatred festering within her, Ondine sought the cooperation of local highwaymen, and even hired them to assassinate Editha on the road through the Shroud. In a bizarre turn of events, Sophie's distinctive Viera ears were mistaken for the musician's trademark bunny crown adornment, leading the bandits to attack Sophie instead. While your assignment has ended successfully, there is one more matter Editha wishes to discuss with you in private─a secret to which even her manager Lassenchou cannot be made privy.","In a secluded corner of the Greatloam Growery, Editha reveals her true identity: she is in fact a disguised sylph. Dispelling her glamour, she explains that she has been visiting Gridania and enchanting the crowds with her prodigious harpsichord playing, with no one suspecting a thing, least of all Lassenchou. Although she was under no obligation to share this secret with you, she felt that since you risked your lives to protect her, you deserved to know the truth. She also states that her desire to walk outside was not merely a selfish whim, but one born of the utmost necessity, as sylphs wilt and eventually die if deprived of the sun's rays. After Editha says her farewells, Radovan takes the opportunity to tell you more of the gunbreaker's origins and his clan's place in keeping their traditions alive. Since he is the last survivor of his people, it is his duty to pass the art of the gunblade on to the next generation, with you as the prime candidate to become his successor. While the burden is indeed a heavy one, he is committed to helping you gain the necessary skills and experience. As they intend to broaden their horizons, Sophie and Radovan suggest moving on to Ul'dah to seek out their next client.<br><br>※In order to travel to Ul'dah, you must first complete the main scenario quest “<span class=\"alternative-container\"><span class=\"alternative\">The Lominsan Envoy</span><span class=\"alternative\">The Gridanian Envoy</span><span class=\"alternative\">The Ul'dahn Envoy</span></span>.”","Sophie and Radovan have already begun looking for work, although their search has yet to bear fruit. Rather than waiting idly for a chance to come your way, Radovan recommends that you use the time available to work on your sword arm, so that you may be ready for whatever fate has in store.<br><br>※The next gunbreaker quest will be available from Radovan upon reaching level 63."],"objectives":["Speak with Radovan in the Carline Canopy.","Speak with Lassenchou outside the Wailing Barracks.","Speak with locals around Mih Khetto's Amphitheatre.","Share your findings with Radovan.","Speak with Lassenchou.","Speak with Editha.","Speak with Radovan in the Quicksand.","Head for Mih Khetto's Amphitheatre!","Quiz the locals!","Protect Editha and defeat the assailants!"],"dialogue":[{"name":"SOPHIE","text":"Perhaps some of your acquaintances in Gridania would have work for us?"},{"name":"RADOVAN","text":"Now that the gunbreakers of eld have yielded a portion of their wisdom, you are ready to take blade in hand."},{"name":"RADOVAN","text":"Rather than spend moons and moons training you, perhaps we had best find employment first. We can use the time between assignments to refine your abilities. But where should we start?"},{"name":"RADOVAN","text":"The Adventurers' Guild... Yes, that sounds quite promising."},{"name":"SOPHIE","text":"I suppose we <span class=\"emphasis\">are</span> adventurers, after all."},{"name":"SOPHIE","text":"Tell me, <span class=\"highlight\">Forename</span>, are you familiar with this sort of thing?"},{"name":"SOPHIE","text":"Oh my! In that case, we couldn't have found a better guide!"},{"name":"RADOVAN","text":"Well, there's no time like the present. Shall we?"},{"name":"SOPHIE","text":"You know, “adventurer” sounds a lot more romantic than “hired muscle,” even though that's essentially what it is."},{"name":"RADOVAN","text":"Now that Mother Miounne has made us formal members of the Adventurers' Guild, we can start accepting assignments."},{"name":"SOPHIE","text":"In fact, we've already been given the details of a potential client in need of a bodyguard or two."},{"name":"RADOVAN","text":"A man named Lassenchou is waiting by the Wailing Barracks. Sophie and I will try making our own way there, to get our bearings."},{"name":"RADOVAN","text":"We thought it best to wait for you before we introduce ourselves."},{"name":"SOPHIE","text":"I feel strangely at home here. It's not at all like the cities in the Empire."},{"name":"LASSENCHOU","text":"You must be the ones sent by the Adventurers' Guild, yes? Oh, thank goodness! Something dreadful has befallen─well, threatens to befall─the one and only Editha!"},{"name":"LASSENCHOU","text":"You mean to say you are unfamiliar with the most gifted harpsichordist who ever lived!? Whatever possessed me to hire such uncultured b─ Ahem! It appears my breath would be better spent briefing you on the nature of my request."},{"name":"LASSENCHOU","text":"A few days ago, Editha received a most unwelcome missive─a death threat, to be precise. At first, I deemed it nothing more than the crazed scrawlings of some harmless churl. That was until, during a recital, a stone was thrown at her, missing by a hair's breadth!"},{"name":"LASSENCHOU","text":"I have, in my capacity as her manager, canceled all public appearances until the perpetrator can be brought to justice."},{"name":"LASSENCHOU","text":"I fear, though, that my delicate tulip would wither and fail if confined to her dressing room. And she has herself expressed a desire to stroll freely beneath the canopies of Mih Khetto's Amphitheatre..."},{"name":"SOPHIE","text":"I see where this is going─ You want us to take her for a walk, is that it?"},{"name":"RADOVAN","text":"If that's all we have to do, we should count ourselves lucky. A threatening letter, a brazen attack in a public place... Who knows what will happen next? But she can't stay indoors forever. I say we accept."},{"name":"LASSENCHOU","text":"Splendid. Without any further ado, I shall have Editha prepare for her promenade."},{"name":"RADOVAN","text":"Hmm... We'd best proceed carefully. If the culprit knows that Lassenchou asked the Adventurers' Guild for help, they can probably deduce that Editha will be coming out of hiding."},{"name":"RADOVAN","text":"We should see if anyone bears a grudge against her, so we know what to expect. And we'd better look around the amphitheatre for places where an ambusher might hide."},{"name":"RADOVAN","text":"If you notice anything, no matter how small, be sure to let me know."},{"name":"SOPHIE","text":"It sounds like this Editha has quite the following. Whether that's due to her musical abilities or her eccentric stage persona is hard to tell, though."},{"name":"ONDINE","text":"Oh, yes. She's veeery talented..."},{"name":"SIMPKIN","text":"Oh, Editha! Even a moment deprived of her sumptuous harmonies is akin to an eternity of unimaginable torment! When, oh when, will she grace me with her splendor once more?"},{"name":"ESTAINE","text":"Why yes, Editha has been the talk of Gridania since her debut. Her skill as a musician is without question, although I sense that many of her admirers are more interested in her bizarre stage garb."},{"name":"FRANCQUET","text":"Know of her? I certainly do! I would consider myself to be one of her many admirers. In all honesty, I do not care for the way some of the others...ogle her."},{"name":"FRANCQUET","text":"If the rumors about Editha receiving death threats are true, one of those lecherous scoundrels must be behind it."},{"name":"SIMPKIN","text":"Oh, to perform a duet with Editha would be a dream come true. Yet I am barely worthy of laying eyes upon, let alone sharing a stage with, one so divine."},{"name":"ESTAINE","text":"The amphitheatre has never seen such crowds for a solo harpsichordist before. Some even claim that she has a certain “otherworldly charm,” although I am not quite sure what they mean by that."},{"name":"FRANCQUET","text":"As you may have heard, Editha has not appeared in public since someone in the audience threw a stone at her. A stone! Can you believe it!?"},{"name":"RADOVAN","text":"<span class=\"highlight\">Forename</span>, have you met Miss Ondine? She's a harpsichordist, like Editha."},{"name":"ONDINE","text":"That poor girl! What is the world coming to? That a gifted and beautiful young performer such as her must hide away for fear of her life─it beggars belief!"},{"name":"ONDINE","text":"It must be one of her followers. I've seen the way some of them look at her, and it makes my skin crawl. With fans like that, who needs enemies?"},{"name":"RADOVAN","text":"So, what did the other locals have to say?"},{"name":"RADOVAN","text":"Yes, most of them think that one of Editha's admirers is to blame, but I sense there's more to it."},{"name":"RADOVAN","text":"I think that until we have more information, we should treat everyone with equal suspicion, to be on the safe side. Personally, I'd prefer to carry out a more thorough investigation, but we'd best not keep our clients waiting. Once you are ready, let us return to Lassenchou."},{"name":"SYSTEM","text":"You have learned all gunbreaker actions and traits to level 60. Detailed descriptions can be viewed in the <span class=\"highlight\">Actions & Traits</span> window, accessed under <span class=\"highlight\">Character</span> in the main menu."},{"name":"RADOVAN","text":"If I were Lassenchou, I would have hired an investigator to catch the villain instead. An agent of enquiry or some such, perhaps."},{"name":"SOPHIE","text":"After hearing so much about Editha, I can't wait to finally meet her!"},{"name":"LASSENCHOU","text":"Editha assures me that she will be ready in two shakes of a ziz's tail, whatever that means."},{"name":"EDITHA","text":"Ah, my chaperones have arrived! How wonderful!"},{"name":"EDITHA","text":"Oh, to finally feel the sun's warming rays! I am reborn!"},{"name":"SOPHIE","text":"They weren't joking when they called her eccentric."},{"name":"RADOVAN","text":"Ungh... All this prancing about is going to draw unwanted attention. We'd better get this over with as quickly as possible."},{"name":"RADOVAN","text":"Sophie─<span class=\"highlight\">Forename</span> and I will escort her to the amphitheatre. Why don't you stay behind with Lassenchou in case we need to hurry back?"},{"name":"SOPHIE","text":"Fine by me. I'll keep an ear out for any signs of danger, and come running if you call."},{"name":"LASSENCHOU","text":"Although I was fully prepared to join you in guarding Editha, and even dressed for the occasion, I will defer to your professional opinion and remain here. But promise me that you will keep my sweet petunia safe!"},{"name":"RADOVAN","text":"Leave it to us. Are you ready, <span class=\"highlight\">Forename</span>?"},{"name":"EDITHA","text":"La la la!♪<br>What a beautiful day for a stroll!"},{"name":"RADOVAN","text":"We only need to escort her to the amphitheatre and back, but keep your eyes peeled!"},{"name":"RADOVAN","text":"Who goes there?"},{"name":"BANDIT03262A","text":"Never you mind. Step away from the girl, nice and slow."},{"name":"RADOVAN","text":"I think not. <span class=\"highlight\">Forename</span>, don't let them near her!"},{"name":"RADOVAN","text":"There could be more of them, so be on your guard!"},{"name":"SAETHRYDA","text":"Is that...? It is! It's Editha!"},{"name":"RADOVAN","text":"Hmm... An unwanted distraction, but perhaps they can tell us why those bandits are after Editha."},{"name":"SAETHRYDA","text":"(-Saethryda-)Is it true her music is inspired by all of the wondrous places she's seen on her travels?"},{"name":"MILLITHIRONHEART","text":"(-Millith Ironheart-)I hear that Editha has become something of a recluse of late. I do hope she returns to grace the stage once more!"},{"name":"YMHITRA","text":"(-Y'mhitra-)Editha has only recently begun performing in Gridania and has already amassed a considerable following. I have heard, however, that some of the other harpsichordists are envious of her success."},{"name":"JONATHAS","text":"(-Jonathas-)You are escorting the lovely Editha? Please, allow me to make a record of this day's events."},{"name":"YSHUWAHE","text":"(-Y'shuwahe-)The whole of Gridania delights in Editha's magnificent melodies. Every other musician pales in comparison to her."},{"name":"BANDIT03262B","text":"There she is, with the rabbit ears!"},{"name":"YMHITRA","text":"Perhaps you would benefit from my ministrations. Allow me!"},{"name":"RADOVAN","text":"I'm sure there are others ready to crawl out of the woodwork. Stay alert!"},{"name":"RADOVAN","text":"So, you get the impression that a jealous rival is the instigator?"},{"name":"RADOVAN","text":"We must be ready to strike at a moment's notice."},{"name":"RADOVAN","text":"At times like these, the Royal Guard stance is probably your best option."},{"name":"EDITHA","text":"The light...it grows dim..."},{"name":"RADOVAN","text":"Gah! They never learn... <span class=\"highlight\">Forename</span>, take the left again!"},{"name":"HODDYN","text":"What's going on here?"},{"name":"RADOVAN","text":"Your assistance is much appreciated!"},{"name":"RADOVAN","text":"I can tell this one's a cut above the rest."},{"name":"RADOVAN","text":"Use Solid Barrel to ready a cartridge, then Gnashing Fang to release the aether."},{"name":"RADOVAN","text":"That's it!"},{"name":"BANDITLEADER03262","text":"What was that...?"},{"name":"HODDYN","text":"Leave these ruffians to me! I and the other Wood Wailers will get to the bottom of this."},{"name":"RADOVAN","text":"Not much farther now!"},{"name":"RADOVAN","text":"It's too quiet... They must be expecting us."},{"name":"ONDINE","text":"(-Masked Assailant-)My my, what a naughty little rabbit. It seems you've wandered too far from your warren."},{"name":"ONDINE","text":"(-Masked Assailant-)The stage is set for your curtain call, though it cost me a pretty penny to rent the place."},{"name":"ONDINE","text":"(-Masked Assailant-)This will be the last time you walk all over <span class=\"emphasis\">my</span> stage with those grubby little paws of yours."},{"name":"ONDINE","text":"Useless! And you call yourselves professionals... Looks like it's time to introduce the little rabbit to my kitty!"},{"name":"RADOVAN","text":"Now she sends beasts after us?"},{"name":"RADOVAN","text":"No matter. We must protect Editha at all costs!"},{"name":"RADOVAN","text":"Hells' bells! That's lightning-aspected aether!"},{"name":"RADOVAN","text":"Try running into them! You'll get a nasty shock, but we can worry about that later!"},{"name":"ONDINE","text":"What are you waiting for!? Kill them!"},{"name":"RADOVAN","text":"Reinforcements! Draw their attention away from Editha!"},{"name":"RADOVAN","text":"What's wrong? No more surprises?"},{"name":"ONDINE","text":"Sorry to disappoint you, but I'm afraid not."},{"name":"RADOVAN","text":"More of them? Stop them before they reach Editha!"},{"name":"ONDINE","text":"I want that talentless sow's head on a platter! And save me the bunny ears!"},{"name":"RADOVAN","text":"Remember, Editha is their target! Don't let her out of your sight!"},{"name":"RADOVAN","text":"The show's over. Now, take off that mask, before I <span class=\"emphasis\">cut</span> it off and your face with it."},{"name":"RADOVAN","text":"Miss Ondine. I might have guessed. But what's Editha ever done to deserve this?"},{"name":"ONDINE","text":"That harlot doesn't know the first thing about real music! And she thinks she can steal my fans, <span class=\"emphasis\">my stage</span>, with those appalling outfits of hers!? I won't stand for it... I won't!"},{"name":"SOPHIE","text":"What happened here?"},{"name":"HONESTGODSQUIVERBOW","text":"I'd heard that Ondine wasn't exactly a fan of Editha's, but I never thought she'd pay to have her killed!"},{"name":"HONESTGODSQUIVERBOW","text":"And now we know that the highwaymen in the woods were in on her schemes, too."},{"name":"HONESTGODSQUIVERBOW","text":"A few days back, they held up Ondine's carriage in the Shroud, but she made them an offer worth more than the valuables she was carryin'."},{"name":"HONESTGODSQUIVERBOW","text":"Mind you, I don't suppose there's many of the bastards left after today. You've done us all a good turn, so if you ever need anythin' from the Gods' Quiver, don't hesitate to ask!"},{"name":"LASSENCHOU","text":"Now that the danger has passed, Editha will at long last be able to make her triumphant return to Mih Khetto's Amphitheatre!"},{"name":"SOPHIE","text":"There's still one thing I don't quite understand. Why did those highwaymen attack me and Radovan in the woods?"},{"name":"EDITHA","text":"Maybe it was because of your ears? I imagine Ondine told them how much I love wearing my favorite bunny crown. They probably thought you were me!"},{"name":"EDITHA","text":"Ho ho! These ones aren't real Viera ears! At least I don't think so... Actually, I was wondering if I might have a word in private with the three of you?"},{"name":"LASSENCHOU","text":"But...there are four of us."},{"name":"EDITHA","text":"Yes, but only if I include you. Which I'm not."},{"name":"LASSENCHOU","text":"What have I done to deserve such treatment?"},{"name":"EDITHA","text":"Now that that pesky manager of mine is out of the way, let's go to the Greatloam Growery."},{"name":"LASSENCHOU","text":"&lt;sigh&gt; Well, I suppose a lady is entitled to her secrets. But before I return to my duties, I wish to express my gratitude for your part in today's events. You have both performed admirably."},{"name":"RADOVAN","text":"I haven't the foggiest idea what this is about."},{"name":"SOPHIE","text":"What could it be? I'm almost afraid to find out..."},{"name":"EDITHA","text":"You risked life and limb to protect me, so I feel it's only fair that I explain myself. One moment, please."},{"name":"RADOVAN","text":"What!?"},{"name":"RADOVAN","text":"You mean to say she was a sylph from the very beginning?"},{"name":"EDITHA","text":"Oh, yes. This one feels much more comfortable now. It is fun to use glamours and play the harpsichord, but a little tiring."},{"name":"EDITHA","text":"And this one spent so long in walking one's house, this one nearly died! These ones need the sun's rays to flourish, to live! That is why this one had to go outside, even though dangerous ones were all around."},{"name":"EDITHA","text":"This one hopes helpful ones will understand and not tell simpering one. Listening ones will be sad if this one can no longer play sweet, sweet music."},{"name":"RADOVAN","text":"Your secret is safe with us."},{"name":"EDITHA","text":"I'm ever so grateful! Promise you'll come to listen to my harpsichord soon, yes? Tee hee!"},{"name":"RADOVAN","text":"Not quite the conclusion I was expecting, but a satisfactory one nonetheless. I must say, you've acquitted yourself rather well, <span class=\"highlight\">Forename</span>."},{"name":"RADOVAN","text":"It normally takes a lot longer for novices to grasp the fundamental differences between a gunblade and a regular sword."},{"name":"RADOVAN","text":"It was originally developed by my people in the Third Astral Era. The march of the Allagan Empire had driven us to the barren wastelands, where even survival was a constant struggle."},{"name":"RADOVAN","text":"Our queen, Gunnhildr, was closely guarded by loyal soldiers known for the unique swords they wielded."},{"name":"RADOVAN","text":"These loyal vassals were known as “Gunnhildr's Blades,” a name that was abbreviated and applied to the most distinctive of their weapons, the gunblade."},{"name":"RADOVAN","text":"Meanwhile, the Allagans were developing firearms capable of launching projectiles over great distances. As they were similar in appearance to our gunblades, we referred to these weapons as “guns,” a term which is now commonplace."},{"name":"RADOVAN","text":"So effective were these new weapons on the battlefield, the queen's guard decided to specialize in smashing through the enemy lines and destroying them as swiftly as possible. Thus did they come to be known as “gunbreakers.”"},{"name":"RADOVAN","text":"Even after the fall of the Allagan Empire, these techniques were passed down to each new generation. My clan are the descendants of Gunnhildr's royal guard, although I am all that remains."},{"name":"RADOVAN","text":"It is my duty to see that the art of the gunbreaker lives on, even if that means entrusting it to an outsider, such as yourself."},{"name":"SOPHIE","text":"If you like history lessons, you two will get along like a house on fire."},{"name":"RADOVAN","text":"I'd best leave it there for the time being. I don't want to overwhelm the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"RADOVAN","text":"The best learning is done in the field, however. As pleasant as Gridania is, I am eager to see what the other city-states have to offer."},{"name":"SOPHIE","text":"Then may I suggest Ul'dah? Their markets have goods from all over the world, and I'm dying to take a look!"},{"name":"RADOVAN","text":"Ul'dah it is, then. Sophie and I will go on ahead. When you arrive, seek us out. We shouldn't be hard to find."},{"name":"SOPHIE","text":"The best way to settle in to a new place is to dress like the locals! Well, that's my excuse, anyway."},{"name":"RADOVAN","text":"It's good to finally get away from that noisy marketplace, not that this watering hole is much quieter. Still, it's a paradise compared to anything you'll find in Garlean territory."},{"name":"SOPHIE","text":"I think he's just in a sour mood because he can't find any work."},{"name":"RADOVAN","text":"You're not wrong there, Sophie. I'll keep looking though. <span class=\"highlight\">Forename</span>, you'd better train by yourself until we find our next client. Which, with a little luck, will be soon."}],"reward":{"gil":2661},"reqs":{"jobs":[{"lvl":60,"id":149}],"quests":[68797]},"next":[68799]},"partials":[{"type":"npc","id":"1029033","obj":{"i":1029033,"n":"Radovan","l":55,"q":2}},{"type":"npc","id":"1029044","obj":{"i":1029044,"n":"Radovan","l":40,"q":2}},{"type":"quest","id":"68797","obj":{"i":68797,"n":"The Makings of a Gunbreaker","g":162,"l":"Gridania","s":101,"f":1}},{"type":"quest","id":"68799","obj":{"i":68799,"n":"For Better or Worse","g":162,"l":"Ul'dah","s":111,"f":1}}]}