{"quest":{"name":"One Fell Swoop","location":"The Core","id":68793,"patch":5.01,"sort":3,"icon":112352,"unlocksFunction":1,"eventIcon":71341,"issuer":1030110,"target":1030110,"genre":23,"journal":["Ryne appears to have recovered from her battle of wills with Eden.","Although Ryne was pushed to her limits as she struggled to seize control of Eden, it seems that she eventually succeeded. However, as she struggles to assert control over the mysterious entity, a warning sounds, and Ryne becomes acutely aware that Eden is being attacked from both within and without by unknown invaders. Thancred and Urianger race to repel the assailants that are approaching from the inner reaches, while you make your way to the exterior to confront an airborne foe as it swoops down from above.<br><br>※Eden's Gate: Descent can be accessed via the Duty Finder.","Though you are hard-pressed by a relentless aerial assault, you eventually succeed in clipping the enemy's wings. With victory secured, you prepare to join your comrades to find out whether Urianger and Thancred were able to put down the intruders.","Though you had assumed your vanquished foe to be unconscious, she struggles to her feet and threatens to finish what she had started. Before you, Thancred, and Urianger are drawn into another confrontation, Ryne steps forward to intervene, for reasons that perhaps she herself does not fully understand. After a brief and puzzling exchange of words, the girl collapses, leaving the rest of you to wonder what her true intentions might be. Thancred suggests taking her to the camp, in the hope that she may shed some light on the mysteries surrounding Eden once she has recovered.","Now that the danger has been averted, Ryne is able to turn her attention to strengthening her link with the core. She explains that not only is Eden more receptive to her commands, she has also made something of a discovery."],"objectives":["Enter Eden's Gate: Descent.","Speak with Ryne."],"dialogue":[{"name":"URIANGER","text":"The beast's fury hath subsided..."},{"name":"THANCRED","text":"Well, I'm glad that's over. But for how long?"},{"name":"RYNE","text":"It worked... I'm in control now. I think..."},{"name":"RYNE","text":"Although I'm now linked to Eden, I still need to figure out how to give it commands."},{"name":"URIANGER","text":"Pray tell, what caused it to convulse so violently?"},{"name":"RYNE","text":"It must have been when Eden rose into the air. I'm still struggling to stop it from drifting too far from the camp."},{"name":"URIANGER","text":"Even now, thou art─"},{"name":"THANCRED","text":"Ryne! What's going on!?"},{"name":"RYNE","text":"Ah... Above us! Something's coming this way! An enemy!"},{"name":"URIANGER","text":"But how dost thou─ Ah! Could it be a sin eater!?"},{"name":"RYNE","text":"I...can't see them clearly, but... No, that's impossible!"},{"name":"THANCRED","text":"What is it?"},{"name":"RYNE","text":"They're inside, too! Lots of them, trying to reach the core!"},{"name":"THANCRED","text":"Uninvited guests, eh? If I'd known they were coming, I would've tidied the place up."},{"name":"URIANGER","text":"Japes are a poor substitute for a viable stratagem."},{"name":"THANCRED","text":"In that case, I suggest that you and I deal with the ones who're already inside."},{"name":"THANCRED","text":"And <span class=\"highlight\">Forename</span> can welcome our airborne adversary."},{"name":"THANCRED","text":"Ryne, find out if Eden has any defenses we can make use of. Preferably ones that don't recognize <span class=\"emphasis\">us</span> as the enemy."},{"name":"RYNE","text":"I'm not sure about that, but I can use the aether currents to send you wherever you need to go."},{"name":"THANCRED","text":"That's my girl. All right, everyone, we've got work to do."},{"name":"RYNE","text":"From what I can tell, Eden is able to form simple structures by redirecting aether, so I'll try to give you something to stand on. When you're ready, head for that portal over there."},{"name":"RYNE","text":"Come on, Eden! Show me what you can do!"},{"name":"RYNE","text":"<span class=\"highlight\">Forename</span>! Thank goodness you're unharmed."},{"name":"THANCRED","text":"We came as soon as we took care of our unwanted guests. They were a stubborn bunch and quite unlike anything I've ever seen in the First."},{"name":"VOIDWALKER","text":"(-???-)No... I won't let you..."},{"name":"VOIDWALKER","text":"(-???-)Damn the Light... Damn you all!"},{"name":"RYNE","text":"Who are you? What do you want?"},{"name":"VOIDWALKER","text":"(-???-)I... Unnngh!"},{"name":"VOIDWALKER","text":"(-???-)Why am I here!? What is happening...?"},{"name":"RYNE","text":"She's alive, but there's something strange about her aether..."},{"name":"THANCRED","text":"She didn't seem too pleased with Ryne taking control of Eden, which may be what caused her to appear out of the blue. Beyond that, it's anyone's guess."},{"name":"URIANGER","text":"'Tis plain she is not a sin eater. Not even in part as Vauthry was."},{"name":"URIANGER","text":"Yet this knowledge does little to assuage my fears, for she is nonetheless possessed of a power most terrible."},{"name":"THANCRED","text":"On the other hand, if she's feeling cooperative, she might be able to tell us more about Eden."},{"name":"THANCRED","text":"I'll keep an eye on her until she wakes up. There's no telling what will happen when she does, but I'll make it clear that we mean her no harm. Well, no further harm, at the very least."},{"name":"THANCRED","text":"Obviously, it's not a good idea to bring her inside Eden. It's likely that reaching the core was her aim from the outset, so I'll take her to the camp."},{"name":"RYNE","text":"Now that things have settled down, I should get back inside and try strengthening my link to Eden."},{"name":"THANCRED","text":"The girl is in the tent, fast asleep. Or possibly in a coma. One or the other. Either way, we have little choice but to wait for her to wake up."},{"name":"URIANGER","text":"I have yet to discover the means by which the exterior was breached, though 'twould appear that the fiends that Thancred and I slew were of a similar nature to those led by thine own adversary. Voidsent, in other words."},{"name":"RYNE","text":"Although I had my hands full trying to control Eden, I caught a glimpse of your battle. That power... I've never seen anything like it."},{"name":"URIANGER","text":"What thou witnessed was the tearing of the very fabric of reality─the creation of a rift through which voidsent may enter. But pray tell, Ryne, didst thou make any other observations?"},{"name":"RYNE","text":"Hmm... I couldn't sense any Light at all in that girl or her servants."},{"name":"RYNE","text":"And I can't really explain how, but she reminded me of Emet-Selch."},{"name":"URIANGER","text":"Though I think it unlikely that she is an Ascian, she may yet be thrall to Zodiark."},{"name":"RYNE","text":"Maybe we'll be able to find out more once she's woken up. In the meantime, I'll try to improve my control over Eden."},{"name":"RYNE","text":"It seems to be listening more than before, instead of screaming at me like it was in the beginning. And that's not all! I've made an exciting discovery!"}],"reward":{"gil":3000,"items":[{"num":5,"id":25198},{"num":3,"id":25187,"one":1},{"num":3,"id":25188,"one":1},{"num":3,"id":25189,"one":1}],"instance":30082},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[68792]},"next":[68794]},"partials":[{"type":"npc","id":"1030110","obj":{"i":1030110,"n":"Ryne","l":3214,"q":6}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"instance","id":"30082","obj":{"i":30082,"n":"Eden's Gate: Descent","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":425}},{"type":"quest","id":"68792","obj":{"i":68792,"n":"Deploy the Core","g":23,"l":"The Empty","s":2,"f":1}},{"type":"quest","id":"68794","obj":{"i":68794,"n":"Nor Any Drop to Drink","g":23,"l":"The Core","s":4,"f":1}}]}