{"quest":{"name":"Super Seismic","location":"The Empty","id":68795,"patch":5.01,"sort":5,"icon":112356,"unlocksFunction":1,"eventIcon":71341,"issuer":1030113,"target":1030110,"genre":23,"journal":["Ryne and Urianger are considering the next step in the plan to reclaim the Empty.","Having successfully revitalized the Empty's water-aspected aether, Urianger suggests using the same methods again with the element of earth, in the hope that nutrient-rich soil will allow plants to grow. No one is more eager to carry out this plan than Ryne, who leads the way to Eden's core.","In order to contain the earth-aspected aether, Urianger asks that you use your recollections of Titan as a focal point. As was the case in your earlier encounter with Leviathan, this particular incarnation is likely to differ considerably from the Lord of Crags you fought all those moons ago.<br><br>※Eden's Gate: Sepulture can be accessed via the Duty Finder.","Though the Titan you summon bears little resemblance to the primal worshipped by the kobolds, he is no less formidable, and tests the limits of your abilities. Following your hard-fought victory, Ryne is keen to hear how the being called forth from the Empty compares to the foe you once faced on the Source.","Ryne guides Eden back to the camp, optimistic that the influx of revitalized aether has led to further alterations in the Empty. The area surrounding the lake has undergone a dramatic transformation, with immense, rocky outcrops having appeared as if from nowhere. However, the change seems to have only affected a relatively small region, though according to Urianger, this is most likely due to the aetherial currents intersecting at this point, and posits that similar phenomena may be occurring elsewhere. Though there is reason to be optimistic, the conversation is cut short when Ryne suddenly drops to her knees, apparently overcome by sheer exhaustion."],"objectives":["Speak with Ryne in Eden's core.","Enter Eden's Gate: Sepulture.","Speak with Ryne."],"dialogue":[{"name":"URIANGER","text":"Such a profound transformation...though the change appeareth to be limited to an area no more than a few malms in diameter."},{"name":"THANCRED","text":"You know, when I first heard Urianger's plan, I didn't know what to expect. But then that enormous crystal appeared and water came gushing forth and, well..."},{"name":"RYNE","text":"I think this proves that the water-aspected aether is no longer lying dormant. So, which element should we realign next, Urianger?"},{"name":"URIANGER","text":"I propose earth. Should we succeed in returning the soil's life-giving energy, the Empty shall become capable of supporting the growth of flora."},{"name":"RYNE","text":"Imagine that! Forests in the Empty..."},{"name":"RYNE","text":"But before we begin, I'd like to know how that girl is doing."},{"name":"THANCRED","text":"Still sound asleep. She didn't so much as stir even when I took her helmet off. I thought it might be getting a bit stuffy in there, and I was curious to know what sort of person we're dealing with."},{"name":"THANCRED","text":"She seems surprisingly normal, not at all like your usual voidsent. I'd say she's around the same age as you, Ryne, perhaps a little older."},{"name":"RYNE","text":"Well, whoever she is, we should let her rest while we concentrate on the task at hand."},{"name":"THANCRED","text":"As much as I'd love to go with you, I'd best stay here in case she wakes up and is feeling less than cooperative."},{"name":"THANCRED","text":"And while I wait here wishing I had something to read, my thoughts will be with you as you fly off to face the next opponent."},{"name":"THANCRED","text":"It must be a strange feeling to bring something into existence through your own willpower, only to slay it immediately after. I almost feel sorry for the poor things. All the same, I wish you luck."},{"name":"RYNE","text":"If all goes well, he won't be waiting for long. The sooner we get this over with, the sooner we can see the results."},{"name":"URIANGER","text":"Once more unto the Empty, dear friend. Thou art prepared, I presume?"},{"name":"RYNE","text":"Now, before we embark on our journey, there is one question I feel I should ask: where are we going?"},{"name":"URIANGER","text":"I would suggest a certain region that lieth east of Norvrandt which was once home to the great Mount Atlas."},{"name":"URIANGER","text":"And for the earth-aspected primal we wish to invoke, what could be a more fitting choice than Titan?"},{"name":"RYNE","text":"I don't think I've heard of that one. What's it like?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He is worshipped by the kobolds."},{"name":"A1","text":"The landslides...the landslides..."},{"name":"RYNE","text":"Thancred mentioned those. They're your world's equivalent of the Mord, yes?"},{"name":"RYNE","text":"It seems like you had a rather traumatic experience."},{"name":"RYNE","text":"But if our last battle is anything to go by, this one will be different from the Titan that <span class=\"highlight\">Forename</span> remembers, yes?"},{"name":"URIANGER","text":"Aye, 'twould be wise to consider the two as entirely separate beings."},{"name":"URIANGER","text":"As such, thou must needs conceive new stratagems if thou art to triumph in the battle to come."},{"name":"URIANGER","text":"Past experience will avail thee naught, I fear."},{"name":"RYNE","text":"All right, <span class=\"highlight\">Forename</span>. Once you're ready, we'll be on our way!"},{"name":"RYNE","text":"It took a while, but we've finally arrived."},{"name":"RYNE","text":"Ready, <span class=\"highlight\">Forename</span>?"},{"name":"SYSTEM","text":"Memories of Titan come tumbling back..."},{"name":"URIANGER","text":"Remember: the primal will almost assuredly be vastly different from that which thou didst lay low on the Source."},{"name":"RYNE","text":"The terrain around here seems a bit rough, but Eden can give you something more level to stand on."},{"name":"URIANGER","text":"Well fought, <span class=\"highlight\">Forename</span>, well fought indeed."},{"name":"URIANGER","text":"That thou wert able to triumph over this avatar of primordial rage is testament to thy puissance."},{"name":"RYNE","text":"Welcome back! You must be exhausted. "},{"name":"RYNE","text":"For a creature made of rock, he was a lot more agile than I was expecting."},{"name":"RYNE","text":"I wonder─ Was the Titan of your world a tough opponent too?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"He never stood a chance against me."},{"name":"A2","text":"Yes. If I'd put one foot wrong, I would've fallen to my doom."},{"name":"RYNE","text":"Well, having seen the way you fight, I can believe that."},{"name":"RYNE","text":"So all it would've taken is a momentary lapse of concentration? I don't like the sound of that."},{"name":"RYNE","text":"But more importantly, you've defeated another elemental being, which means we're a step closer to reclaiming the Empty."},{"name":"RYNE","text":"I can't wait to see how much of a difference we've made this time!"},{"name":"RYNE","text":"Did we really do all of this?"},{"name":"URIANGER","text":"Aye, 'twould appear that balance has returned to the element of earth. And yet..."},{"name":"URIANGER","text":"The transformation hath affected only the immediate vicinity, whereas the lands beyond this lake doth remain unchanged. 'Tis passing strange, indeed."},{"name":"RYNE","text":"Did we do something wrong?"},{"name":"URIANGER","text":"Though this falleth short of the outcome I had envisioned, 'tis plain our efforts were not in vain."},{"name":"URIANGER","text":"Mayhap this localized phenomenon is the result of an intersection of aetherial currents..."},{"name":"URIANGER","text":"Therefore, it is reasonable to assume that similar locations in the Empty hath undergone comparable alterations."},{"name":"RYNE","text":"Then the aether will spread out from these points to cover the rest of─"},{"name":"THANCRED","text":"Ryne!"}],"reward":{"gil":3000,"items":[{"num":5,"id":25186},{"num":3,"id":25187,"one":1},{"num":3,"id":25188,"one":1},{"num":3,"id":25189,"one":1}],"instance":30084},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[68794]},"next":[68796]},"partials":[{"type":"npc","id":"1030113","obj":{"i":1030113,"n":"Ryne","l":3225,"q":1}},{"type":"npc","id":"1030110","obj":{"i":1030110,"n":"Ryne","l":3214,"q":6}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"instance","id":"30084","obj":{"i":30084,"n":"Eden's Gate: Sepulture","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":425}},{"type":"quest","id":"68794","obj":{"i":68794,"n":"Nor Any Drop to Drink","g":23,"l":"The Core","s":4,"f":1}},{"type":"quest","id":"68796","obj":{"i":68796,"n":"The Next Piece of the Puzzle","g":23,"l":"The Empty","s":6,"f":1}}]}