{"quest":{"name":"The Next Piece of the Puzzle","location":"The Empty","id":68796,"patch":5.01,"sort":6,"icon":100844,"unlocksFunction":1,"eventIcon":71341,"issuer":1030118,"target":1030121,"genre":23,"journal":["Ryne appears to have been overcome by exhaustion.","The strain of exerting her will over Eden has clearly taken its toll on Ryne, who is nevertheless determined to continue her work to reclaim the Empty. Thancred insists that she takes time to recuperate, although she only agrees to do so when Urianger states that she risks losing control of Eden should she succumb to her exhaustion, which is exacerbated by prolonged exposure to the Empty's stagnant aether. Thancred points out that the same is likely to be true for the girl who had earlier led the attack on Eden and still lies comatose. As Ryne will be heading back to Mord Souq, he asks her to arrange with your Crystarium associates to have the enigmatic stranger carried to a safer location. He also suggests that you go with Ryne, since you too have been hard-pressed of late and would benefit from a change of scene.","On the long journey back to Amh Araeng by skyslipper, you sense that something is on Ryne's mind. It is only after you arrive, however, that she shows any willingness to discuss the matter.","Ryne confesses that when she first shared her discovery of the Light emanating from the Empty, she was scared of what she might find there. Having bravely pressed on in spite of her apprehensions, she now sees the expedition as a worthwhile endeavor, which has not only helped her grow as an individual, but also has the potential to bring lasting change to the First. Although she has been buoyed by all of the recent progress made with Eden, she is still concerned as to how to approach the comatose girl when she finally awakens. Ryne is considering the possibility that your former adversary was being manipulated somehow and that an understanding may yet be reached, while at the same time recognizing the threat that the girl poses to your mission should she reject your attempts to make peace. For the time being, there is little that can be done other than wait for her to recover. Meanwhile, Ryne still has errands to run before she can rest, so you prepare to make the last leg of the journey to Mord Souq.","In Mord Souq, Ryne introduces you to a pair of specialists who have been included in your plans. Ghul Gul, a local merchant, wishes to trade various pieces of equipment in exchange for relics gleaned from the Empty, while Lewrey of the Crystarium will be providing additional transportation and supplies. Ryne wishes to discuss with the latter the task of moving the voidsent girl from your camp, although such a topic is not one for the ears of the surrounding market-goers. Before leaving, she offers words of thanks for your efforts thus far and expresses her eagerness to return to the Empty as soon as she is able."],"objectives":["Speak with Ryne.","Speak with Ryne near the Derrick.","Speak with Ryne in Mord Souq."],"dialogue":[{"name":"URIANGER","text":"Perhaps asserting her will over Eden hath taken its toll."},{"name":"THANCRED","text":"Are you all right!?"},{"name":"RYNE","text":"It's...it's nothing."},{"name":"THANCRED","text":"That didn't look like nothing to me. You'd better lie down for a while."},{"name":"RYNE","text":"No, really, I'm fine. Anyway, we've still got work to do."},{"name":"URIANGER","text":"Nay, Thancred hath the right of it. 'Twould be unwise to exert thyself overmuch."},{"name":"RYNE","text":"I appreciate your concern, but I do wish you'd stop fussing."},{"name":"URIANGER","text":"Ryne, thou knowest not the strain thou dost place on thyself."},{"name":"URIANGER","text":"Though the elements of water and earth hath been restored, continued exposure to the Empty's stagnant aether may yet sap thee of thy remaining strength."},{"name":"RYNE","text":"Now that you mention it, I've been feeling a bit out of sorts ever since we got here."},{"name":"RYNE","text":"I should probably get away from the Empty and rest for a while."},{"name":"URIANGER","text":"Pray do so. Meanwhile, I shall remain here. The restoration of the first two elements hath produced unexpected results, and I require time to analyze our findings."},{"name":"URIANGER","text":"However, I must ask thee to refrain from discussing our work in the Empty, even with our closest comrades."},{"name":"RYNE","text":"Why? I thought they'd welcome the news."},{"name":"URIANGER","text":"And indeed they shall, once we have more to show for our efforts."},{"name":"URIANGER","text":"Nevertheless, this mission is one of surpassing danger. I am loath to place our dearest friends at risk unless absolutely necessary."},{"name":"RYNE","text":"You have their best interests at heart, I'm sure. But to be perfectly honest, I'd prefer not to keep secrets from people that I trust with my life. I don't want to make a habit of this, but I'll do as you ask."},{"name":"THANCRED","text":"It seems to me that Ryne isn't the only one who would benefit from a change of scenery. Our sleeping beauty would likely fare better in more hospitable surroundings."},{"name":"THANCRED","text":"We'll need to have our associates from the Crystarium organize a safe place for her to stay. If you and <span class=\"highlight\">Forename</span> could go on ahead and have a word with them in Mord Souq, we'll catch up with you once Urianger has finished...whatever it is he needs to do."},{"name":"THANCRED","text":"..."},{"name":"URIANGER","text":"Perhaps thou, too, shouldst accompany her on the return journey. I daresay she would be glad of thy presence."},{"name":"THANCRED","text":"No. Not this time. She's come such a long way since we first met, and I worry that relying on me too much will only hold her back."},{"name":"THANCRED","text":"We won't be staying in the First forever. The time will come for Ryne and I to part ways, and for her to follow her own path."},{"name":"THANCRED","text":"I know you understand this too, Urianger. I see you trying to pass on as much of your knowledge as possible while you still can. And to her credit, she's actually taking most of it in."},{"name":"URIANGER","text":"Ryne is possessed of a natural affinity for aetherology, unlike some who shall remain unnamed..."},{"name":"THANCRED","text":"A natural affinity for staying awake during your lectures, more like. Though, come to think of it, she doesn't really take after me at all."},{"name":"URIANGER","text":"However, like thee she is predisposed to brooding in silence in lieu of voicing her concerns."},{"name":"THANCRED","text":"Says the master of keeping his cards close to his chest. Anyway, <span class=\"highlight\">Forename</span>, you'd better take the skyslipper with Ryne."},{"name":"THANCRED","text":"It's true that she's been through a lot lately, but so have you. We'll need you ready for the challenges that lie ahead, so go on and get some rest."},{"name":"URIANGER","text":"We shall await news of thy safe arrival in Amh Araeng."},{"name":"THANCRED","text":"We'll have to decide whether it's worth posting Crystarium guards to watch over Eden while we're gone."},{"name":"URIANGER","text":"As there is little risk of our camp being ransacked, it may be left unattended in our absence."},{"name":"RYNE","text":"It seemed like you were all having quite a serious discussion. I hope I haven't given you any cause for concern..."},{"name":"RYNE","text":"Well, if you say so. I probably shouldn't stay in the Empty any longer than necessary, though. So, do you want to take first shift piloting, or shall I?"},{"name":"RYNE","text":"Phew! I'm glad I had you there to keep me company. I've no idea how I would've passed the time otherwise."},{"name":"RYNE","text":"Now that we're here, I need to find our contact from the Crystarium."},{"name":"RYNE","text":"But before that, I was hoping I could have a word with you. Something's been on my mind."},{"name":"RYNE","text":"This might not be the best place for it, though. Those creatures over there look a bit hungry..."},{"name":"RYNE","text":"When I first spoke to Thancred and Urianger about what I'd sensed in the Empty, part of me wished we could've just left it alone. I guess I was scared of what we'd find."},{"name":"RYNE","text":"But now that we've found Eden, I know that I made the right choice."},{"name":"RYNE","text":"And if I'd given in to my fear, I probably would've spent the rest of my life wondering what might've been."},{"name":"RYNE","text":"From now on, whenever I hear that voice inside telling me to run away, to hide, I won't listen. That's not who I am anymore."},{"name":"RYNE","text":"Even so, all the courage in the world is not going to help me decide what we should do with that girl when she wakes up."},{"name":"RYNE","text":"Do you remember what she said right before she passed out? “Why am I here!? What is happening?”"},{"name":"RYNE","text":"What if she's being controlled or forced to act against her will?"},{"name":"RYNE","text":"Whatever the case, it's clear that she's not a monster, she's a person, like you or me."},{"name":"RYNE","text":"Obviously, she knows something about Eden, and we need all the information we can get. But more than that, I just want to talk to her, to find out who she is and if there's anything we can do to help her."},{"name":"RYNE","text":"On the other hand, we mustn't forget that she's already attacked us once. What's to say she won't try it again when she wakes up?"},{"name":"RYNE","text":"If she keeps us from reclaiming the Empty, it will be all my fault. It's no good, I can't make up my mind. What do you think we should do, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"If Alphinaud were here, he'd talk things through with her."},{"name":"A1","text":"Even Emet-Selch had his reasons. We should at least hear her out."},{"name":"A1","text":"There's not much we <span class=\"emphasis\">can</span> do until she's awake."},{"name":"RYNE","text":"Yes, like that time in Eulmore! Even when confronting Vauthry, he tried his hardest to find a peaceful solution."},{"name":"RYNE","text":"Hopefully, she'll be a bit more willing to listen."},{"name":"RYNE","text":"I see what you mean. Perhaps if we'd been able to come to an understanding, things wouldn't have ended the way they did."},{"name":"RYNE","text":"I hope that she's nothing like Emet-Selch, but we won't know until we speak to her."},{"name":"RYNE","text":"I'm sorry. I probably shouldn't be trying to decide her fate before we even know who she is."},{"name":"RYNE","text":"In the meantime, we'll have to be patient and hope that she comes around soon."},{"name":"RYNE","text":"Until then, I'll try to concentrate on the here and now. Speaking of which, I still need to see to Urianger's errands."},{"name":"RYNE","text":"The people we're on our way to meet lent us the skyslipper and most of the apparatus we've been using. And since we've been sworn to secrecy, I assume the same applies to them and their colleagues."},{"name":"RYNE","text":"Anyway, once that's over with, we can find a place to relax!"},{"name":"RYNE","text":"Now that we're here, allow me to introduce you to two members of our “inner circle,” or whatever you want to call it."},{"name":"RYNE","text":"That's Ghul Gul, who's interested in trading for any relics we find in the Empty. Apparently, he mostly deals in exotic weapons and whatnot, but he's agreed to keep us supplied with whatever else we can't get from the Crystarium."},{"name":"RYNE","text":"Now, the ones we came to meet should be around here somewhere..."},{"name":"LEWREY","text":"(-???-)Ah, Ryne! What a relief it is to see you returned unharmed from your expedition!"},{"name":"RYNE","text":"I'm sorry to have kept you waiting! We were gone a bit longer than we expected."},{"name":"RYNE","text":"<span class=\"highlight\">Forename</span>, I'd like you to meet Lewrey."},{"name":"LEWREY","text":"It is a pleasure to make your acquaintance. As representative of the Settlement council, I am here to oversee the delivery of equipment deemed necessary to your mission."},{"name":"LEWREY","text":"I will be on hand to provide any assistance you may require."},{"name":"RYNE","text":"Actually, there's something we'd like you to take care of..."},{"name":"RYNE","text":"It's probably best not to talk about it in the middle of the market, though."},{"name":"RYNE","text":"I'll take it from here, <span class=\"highlight\">Forename</span>. You should get some rest."},{"name":"RYNE","text":"But before you go, I'd like to thank you for everything you've done. We still have a long road ahead of us, but if we give it our all, there's nothing we can't handle!"},{"name":"THANCRED","text":"...I see."},{"name":"URIANGER","text":"Though it is mere supposition, it would behoove us to proceed with caution. Moreover, I would refrain from discussing the matter with Ryne and <span class=\"highlight\">Forename</span> until we know more."},{"name":"THANCRED","text":"Well, I appreciate you telling me, even if it is too soon to be sure. I'm the one watching over her, after all."},{"name":"THANCRED","text":"The Oracle of Darkness..."},{"name":"THANCRED","text":"I pray it is not true."}],"reward":{"gil":7500,"items":[{"id":25187},{"id":25188},{"id":25189},{"num":3,"id":25197,"one":1},{"num":3,"id":25198,"one":1},{"num":3,"id":25190,"one":1},{"num":3,"id":25186,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[68795]},"next":[69323]},"partials":[{"type":"npc","id":"1030118","obj":{"i":1030118,"n":"Ryne","l":3225,"q":1}},{"type":"npc","id":"1030121","obj":{"i":1030121,"n":"Ryne","l":2955,"q":1}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"68795","obj":{"i":68795,"n":"Super Seismic","g":23,"l":"The Empty","s":5,"f":1}},{"type":"quest","id":"69323","obj":{"i":69323,"n":"Away with the Faerie","g":23,"l":"Amh Araeng","s":7,"f":1}}]}