{"quest":{"name":"Save the Last Dance for Me","location":"Gridania","id":68790,"patch":5.0,"sort":241,"icon":100872,"unlocksFunction":1,"eventIcon":71341,"issuer":1028757,"target":1028792,"genre":163,"journal":["Ranaa Mihgo has a letter in hand and is excitedly waving it in your direction.","Good tidings have arrived in the form of a missive from Mistress Nashmeira; it would appear that the stage has been set for your performance in Ala Mhigo, the final stop of Troupe Falsiam's tour of Eorzea. Travel to the village of Ala Gannha in Gyr Abania with Ranaa, that you might rendezvous with the troupe leader and prepare for your greatest challenge yet in your career as a dancer.","You rendezvous with Ranaa in Ala Gannha, though curiously Mistress Nashmeira is nowhere to be found. You and your fellow young star nevertheless resolve to soldier on alone in your quest to bring hope and light to the shadow-plagued hearts of the Ala Mhigans. Take a deep breath, stretch your legs, and speak to Ranaa when you are prepared to take the stage.","Along with Ranaa and Nashmeira, who makes a triumphant return to the stage to offer much-needed aid in your time of greatest crisis, you succeed in drawing out the darkness from within the hearts of the populace and consigning it to oblivion. The battle won─at least for the time being─you decide to speak with the Troupe Falsiam leader and ask for her honest appraisal of your performance.","Somewhat surprisingly, the demanding taskmaster Nashmeira has nothing but effusive praise for your and Ranaa's performance. The Troupe Falsiam principal humbly suggests that the two of you likely did not require her assistance after all, a sentiment quickly dismissed by Ranaa, who has lived out one of her lifelong dreams by sharing the stage with her mentor. Mistress Nashmeira introduces you to the elusive friend who helped her in organizing Troupe Falsiam's journey to Eorzea, who turns out to be none other than the legendary songstress F'lhaminn. Speak to Ranaa Mihgo and see if she has any parting thoughts to share before you return to the road.","Thanks in no small part to your efforts, Troupe Falsiam's tour of Eorzea has concluded as a resounding success, and the time has now come for your companions to return home to Radz–at–Han. You prepare to make the long journey back to Limsa Lominsa, that you might see them off at the docks for a proper farewell.","After some consideration, Troupe Falsiam has decided to sojourn on Eorzean shores for the time being. You thank Nashmeira and Ranaa for their mentorship and company, and resolve to continue to hone your dancing skills in preparation for the day when you are once again summoned to take the stage with your friends.<br><br>※The next dancer quest will be available from Nashmeira once you have met the following requirements:<br>※ You must have completed the main scenario quest “Shadowbringers.”<br>※ You must have completed the role quest “Courage Born of Fear.”"],"objectives":["Speak with Ranaa Mihgo in Ala Gannha.","Speak with Ranaa Mihgo again.","Speak with Ranaa Mihgo yet again.","Speak with Ranaa Mihgo once more.","Speak with Ranaa Mihgo in Limsa Lominsa.","Defeat the aetheric shadow!"],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Heavens Weep.”"},{"name":"KUIHLUD","text":"Ranaa has matured much in her short time on these shores, yes? Carrying herself as she does in Mistress Nashmeira's absence, I could almost see her assuming the role of principal one day."},{"name":"RANAAMIHGO","text":"Great news, <span class=\"highlight\">Forename</span>! A postmoogle just dropped off this letter from Mistress Nashmeira─she says the stage has all been set for our performance in Ala Mhigo!"},{"name":"RANAAMIHGO","text":"Why, she's even scouted out what she claims is an ideal venue to host our exhibition: a village called Ala Gannha that sits in the Gyr Abania highlands."},{"name":"RANAAMIHGO","text":"Doubtless in part due to its location near the border, there are considerable fears among the villagers that the Garleans will return and retake their home with a vengeance. In other words, it is precisely the sort of place where the Totentanz is likely to strike."},{"name":"RANAAMIHGO","text":"Though Ala Mhigo is finally free from Garlean rule, many of its people still have doubts that this peace will truly prevail. In other words, it is precisely the sort of place where the Totentanz might strike."},{"name":"RANAAMIHGO","text":"Though Ala Gannha itself has been liberated, the war with Garlemald rages on, and the unease of the villagers is tangible. In other words, it is precisely the sort of place where the Totentanz might strike."},{"name":"RANAAMIHGO","text":"At any rate, Mistress Nashmeira assures me that she and her secretive acquaintance have made all the necessary preparations. The Ala Mhigan Resistance, she says, has seen fit to ensure that Ala Gannha's most prominent residents will be in attendance."},{"name":"RANAAMIHGO","text":"If we can perform as we did in Ishgard and swiftly dispel the darkness from their hearts, surely they will be able to influence their fellow villagers and stave off the onset of the Totentanz."},{"name":"RANAAMIHGO","text":"And what did she say at the very end of her letter? Ah, yes. “Ranaa, <span class=\"highlight\">Forename</span>. The success of our tour─and the very future of Troupe Falsiam itself─rides on you. I am counting on you to rise to the occasion.”"},{"name":"RANAAMIHGO","text":"Are you as excited as I am? Let's make this a show for the ages! And with that, let us set out for Ala Gannha. We mustn't keep Mistress Nashmeira waiting."},{"name":"KUIHLUD","text":"How curious. It appears our fearless leader has not yet arrived. Perhaps she got held up somewhere along the way?"},{"name":"RANAAMIHGO","text":"Ah, there you are, <span class=\"highlight\">Forename</span>! Have you by chance seen Mistress Nashmeira? I can't find her anywhere, but I'm sure she'll be along soon. I know she wouldn't miss our performance for the world!"},{"name":"RANAAMIHGO","text":"And look at what I've found! I scoured the troupe's wardrobe to find outfits befitting our grand finale. One thing's for certain: we'll be dressed to impress!"},{"name":"RANAAMIHGO","text":"And remember: mum's the word about the Totentanz, all right? We want our audience to enjoy the performance without worrying themselves with the terrible truth behind it all. Well, then─whenever you're ready to take the stage, you know where to find me!"},{"name":"RANAAMIHGO","text":"This is it, <span class=\"highlight\">Forename</span>. Ready to raise the curtain on our final act?"},{"name":"KUIHLUD","text":"So close, and yet so far... For all who cannot make the voyage to our home, we bring our art to yours... Hailing from Radz–at–Han across the sea, I present the incomparable, transcendent...Troupe Falsiam!"},{"name":"KUIHLUD","text":"Today, we perform for you the ancient dance of our ancestors. A spectacle to stir the heart, enrich the mind, and chase away the shadows of doubt that plague your soul. Feast your eyes upon...the Kriegstanz!"},{"name":"RANAAMIHGO","text":"Right on cue! All right, <span class=\"highlight\">Forename</span>...let's take out that nasty thing before our audience realizes it's not just for show."},{"name":"RANAAMIHGO","text":"Just look at those enraptured faces! The excitement in the air is almost palpable. They know they're about to get a show the likes of which they've never seen."},{"name":"RANAAMIHGO","text":"The Ala Mhigans are counting on us, <span class=\"highlight\">Forename</span>─and in more ways than they themselves even know. We must dance, and not stop dancing till every last shadow has been purged from their hearts. This is the performance we were born to give!"},{"name":"RANAAMIHGO","text":"Mistress Nashmeira! Oh, I knew you wouldn't miss our grand finale! And your dancing...why, you were every bit as enchanting as I remembered from all those years ago. Sharing the stage with you truly was a dream come true..."},{"name":"NASHMEIRA","text":"I simply had to make amends for my embarrassing display in Gridania, did I not? My wounds had all but healed entirely, so I redoubled my training efforts after arriving here in Ala Mhigo. I daresay I feel as spry as I have in years."},{"name":"NASHMEIRA","text":"And yet, there can be no doubt: you and <span class=\"highlight\">Forename</span> were the true stars today. To think that you have come so far in such a short span of time. Mayhap I should have just admired your performance from the wings instead of stepping in..."},{"name":"FLHAMINN","text":"(-???-)Tut-tut, Meira. I seem to recall you telling me just the other day that the girl was still not ready for the spotlight."},{"name":"NASHMEIRA","text":"You know me, Lhaminn. I am strict with my students because I expect only the best from them. And these two have done me proud today."},{"name":"FLHAMINN","text":"Fancy meeting you here, <span class=\"highlight\">Forename</span>. I must admit, it gave me quite a start when my Meira here told me that <span class=\"emphasis\">you</span> of all people had joined her merry little troupe."},{"name":"FLHAMINN","text":"Meira and I go far, far back, you know. After those horrific events unfolded in Ul'dah, I hid away in Thavnair for some time. It was then that we first made each other's acquaintance."},{"name":"FLHAMINN","text":"Song and dance go together rather well, needless to say, and our friendship rapidly blossomed. When she turned to me for assistance in planning Troupe Falsiam's tour of Eorzea, I was more than happy to do my part."},{"name":"NASHMEIRA","text":"It does not surprise me that an accomplished adventurer would have many friends across the realm, but never would I have suspected you and my dear Lhaminn were so close. Truly, fate must have brought us together for a reason."},{"name":"RANAAMIHGO","text":"I feel the same. Your presence alone has motivated me to grow in ways I never would have thought possible. You have given me the courage, strength, and determination to be more than what I was."},{"name":"RAGANFRID","text":"Thought I recognized that face from somewhere."},{"name":"RAGANFRID","text":"From liberator of Ala Mhigo to traveling performer, eh? Not a path I'd have predicted, but I'm hardly surprised to see you emerge triumphant in whatever you do. Aye, that was truly a performance for the ages."},{"name":"RAGANFRID","text":"Here in Ala Gannha, we don't get much exposure to foreign cultures. Rather stimulating, that was. 'Specially the grand finale where you chased off those bloody shadow-beasts. Got the blood pumping, I'd say! I only wish there was more we could do to show our appreciation..."},{"name":"RANAAMIHGO","text":"Think nothing of it, my good sir! Just knowing that we've brought a measure of joy to Ala Mhigo in its time of need is reward enough for us."},{"name":"RAGANFRID","text":"Too kind you are, miss. The road ahead of us is a long one, but thanks to you, we can stride down it with a spring in our step. Know that our village is always open to you, should you ever be willing to grace us with another performance. Farewell, friends."},{"name":"RANAAMIHGO","text":"Phew! For a second, I thought he'd realized the true nature of those shadows. But no─the threat of the Totentanz is gone for now, and it seems no one's the wiser!"},{"name":"NASHMEIRA","text":"That is heartening, indeed. And with that, we should prepare for our departure. The Ala Mhigans were kind enough to invite us in these trying times. We mustn't linger so long that our presence becomes a burden."},{"name":"FLHAMINN","text":"I, too, should be on my way. It was a pleasure and honor both to see you on the stage again, Meira. And you as well, <span class=\"highlight\">Forename</span>. Till our paths cross again, go in safety."},{"name":"RAGANFRID","text":"It's been long─damned long─since we've been able to forget our worries and lose ourselves in another world. The people of Ala Gannha will rest well tonight, that much I know."},{"name":"KUIHLUD","text":"I went to Mistress Nashmeira expecting to be chewed out for being a beat slow here, or out of tune there, but she just smiled and said this was my best performance ever. Is she feeling quite all right?"},{"name":"NASHMEIRA","text":"You and Ranaa have truly done me proud today, friend. Why, I daresay the day is not far off when I can hand Troupe Falsiam over to a worthy successor..."},{"name":"RANAAMIHGO","text":"Well, that's the last of it! Our props are packed up, and we're ready to take to the road."},{"name":"RANAAMIHGO","text":"I must say, it's a touch bittersweet knowing that this was our last performance, but I suppose even the best of things must come to an end."},{"name":"RANAAMIHGO","text":"Mistress Nashmeira will go ahead to Limsa Lominsa to secure us passage back to Radz–at–Han. You'll stop by and see us off, yes? We'd like to pay you proper thanks before taking our leave of this land."},{"name":"KUIHLUD","text":"It was an honor traveling the realm with you, friend. Once companions, always companions. I have little doubt that our paths will cross again."},{"name":"NASHMEIRA","text":"There is no need for teary farewells, <span class=\"highlight\">Forename</span>. We will meet again all too soon. I am sure of it."},{"name":"RANAAMIHGO","text":"<span class=\"highlight\">Forename</span>! I'm so touched─you really did come to see us off! Thank you ever so much for all you've done. It was an honor to tour Eorzea with you, and bring strength and succor to its people."},{"name":"NASHMEIRA","text":"You have my gratitude as well, <span class=\"highlight\">Forename</span>. The people whose hearts you have touched will, in turn, inspire others. Yes, before long, the dance of the damned will be but a memory..."},{"name":"NASHMEIRA","text":"...And yet, until that time, we cannot let down our guard. I propose that we extend our tour of Eorzea, in the event that there are yet people in this realm who still require our aid."},{"name":"RANAAMIHGO","text":"Do you truly mean this, Mistress Nashmeira!? <span class=\"highlight\">Forename</span> and I can keep dancing together?"},{"name":"NASHMEIRA","text":"In good time, Ranaa, yes. But <span class=\"highlight\">Forename</span> is an adventurer, and one whose services are justifiably in high demand. It would not be very considerate of us to monopolize <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> services for our ends..."},{"name":"NASHMEIRA","text":"And so we bid you farewell for now. Ranaa and I will remain in Limsa, and consult with Master Gegeruju about potentially extending our tour to new locations. Pray come back and visit us on occasion, yes? Ranaa gets awfully lonely without company."},{"name":"RANAAMIHGO","text":"Hey, that's not─! Well, I suppose it <span class=\"emphasis\">is</span> true. Keep dancing, <span class=\"highlight\">Forename</span>, and let us eagerly await the day that we can take the stage together anew!"},{"name":"SYSTEM","text":"In order to undertake the next dancer quest, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ You must have completed the main scenario quest “Shadowbringers.”"},{"name":"SYSTEM","text":"※ You must have completed the role quest “Courage Born of Fear.”"},{"name":"SYSTEM","text":"Once you have done so, the next dancer quest will be available from Nashmeira."},{"name":"RANAAMIHGO","text":"This is our biggest audience yet─which means we're in for a tough fight. But if we dance our dance, there won't be any stopping us!"},{"name":"AUDIENCE03254","text":"How curious... Why, I could have sworn that shadowy mass just popped out from within my own body! But I'm sure it's just part of the performance. Time to sit back and enjoy the show!"},{"name":"RANAAMIHGO","text":"Our dance is reaching their hearts! Look, there's another shadow! And another!"},{"name":"AUDIENCE03254","text":"Look at them all! We're in for a treat, I'd say!"},{"name":"RANAAMIHGO","text":"They're coming at us, <span class=\"highlight\">Forename</span>! Don't let them touch you!"},{"name":"RANAAMIHGO","text":"Here comes a big one! Stand strong with me, <span class=\"highlight\">Forename</span>!"},{"name":"RANAAMIHGO","text":"I knew it! Together, nothing can bring us down!"},{"name":"AUDIENCE03254","text":"I've never seen dancing like this! Even that giant fiend has its hands full with them!"},{"name":"RANAAMIHGO","text":"There's just...too many of them... We're no match for them with just the two of us!"},{"name":"NASHMEIRA","text":"My apologies for keeping you waiting. Seems I made it just in time for the grand finale."},{"name":"NASHMEIRA","text":"Lead the masses of aether to my side and watch. I still have some moves left in me."},{"name":"RANAAMIHGO","text":"M-Mistress Nashmeira!? And we're taking the stage together? This is a dream come true!"},{"name":"AUDIENCE03254","text":"Look! Another dancer has come to their aid! And she might be the most stunning yet!"},{"name":"AUDIENCE03254","text":"Oho! Seems a new fiend's joined the fray!"},{"name":"NASHMEIRA","text":"It's working! Now it's time to divide and conquer!"},{"name":"RANAAMIHGO","text":"You got it, boss! <span class=\"highlight\">Forename</span>, you take that masked one in the middle, and I'll handle the rest!"},{"name":"NASHMEIRA","text":"Their attacks grow stronger... Keep your focus and fight as one!"},{"name":"AUDIENCE03254","text":"Three dancers taking the stage as one? This should be a sight to behold!"},{"name":"NASHMEIRA","text":"It's trying to liberate all the remaining aether! We must move quickly!"},{"name":"AUDIENCE03254","text":"This must be the grand finale! I wonder what marvelous moves they have in store for us next!?"},{"name":"RANAAMIHGO","text":"Damn it! That's another of them!"},{"name":"NASHMEIRA","text":"This bodes ill... Hurry, Ranaa! We must lend <span class=\"highlight\">Forename</span> all our strength!"},{"name":"RANAAMIHGO","text":"Consider it done! Are you ready, <span class=\"highlight\">Forename</span>? This dance is for you!"}],"reward":{"gil":3587,"action":15998},"reqs":{"jobs":[{"lvl":70,"id":150}],"quests":[68789]},"next":[68762]},"partials":[{"type":"npc","id":"1028757","obj":{"i":1028757,"n":"Ranaa Mihgo","l":52,"q":2}},{"type":"npc","id":"1028792","obj":{"i":1028792,"n":"Ranaa Mihgo","l":29,"q":1}},{"type":"action","id":"15998","obj":{"i":15998,"n":"Technical Step","c":3473,"j":38,"t":3,"l":70}},{"type":"quest","id":"68789","obj":{"i":68789,"n":"High-steppin' in the Holy See","g":163,"l":"Gridania","s":231,"f":1}},{"type":"quest","id":"68762","obj":{"i":68762,"n":"Rising to the Occasion","g":163,"l":"Limsa Lominsa","s":800}}]}