{"quest":{"name":"Affronts and Allies","location":"The Crystarium","id":68804,"patch":5.0,"sort":211,"icon":100868,"unlocksFunction":1,"eventIcon":71341,"issuer":1031158,"target":1031158,"genre":180,"journal":["Giott shows no sign of having ceased drinking at any point since your last meeting.","After displaying high alcohol tolerance and higher enthusiasm for getting on people's nerves, Giott eventually gets around to suggesting that you observe Sophrosyne for yourself to gain an understanding of its abilities─in particular, the power it uses to heal both itself and other sin eaters. Fortunately, your quarry was recently spotted in Kholusia, so tracking it down in order to do so should not be unduly difficult.","Giott─tankard in hand once again─proposes that the quickest way to lure Sophrosyne will be to create sin eaters in need of healing. As a few have apparently found their way to the Bright Cliff, you only need head there to locate one or two suitable for slaying.","In accordance with the plan, you slay an errant sin eater. It may be prudent to seek out another and add it to the pile to ensure that Sophrosyne takes the bait, however.","Having slain several sin eaters between the two of you, all that is left for you and Giott is to find a suitably out-of-the-way spot and wait. Whether or not your collection of corpses is enough to attract Sophrosyne's attention will be revealed in due course.","Your plan is successful in drawing out Sophrosyne. As you watch it weave its magic, however, you are struck with a sudden vision, courtesy of the Echo. In it, you see Lamitt meeting Ardbert for the first time─the beginning of their ill-fated journey. Head spinning, you agree to rejoin Giott at the Crystarium.","Though you have now seen Sophrosyne healing a fellow sin eater, the matter of how to prevent it from doing so in the future remains unresolved. For lack of any immediate plan of action, Giott sends you on your way, promising to think of something in the coming days─whilst continuing to imbibe, of course.<br><br>※The next role quest will be available from Giott upon reaching level 74 in any healer class."],"objectives":["Speak with Giott at the Leaky Keel.","Slay a sin eater at the destination.","Slay a sin eater at the next destination.","Report to Giott.","Speak with Giott at the Wandering Stairs."],"dialogue":[{"name":"GIOTT","text":"&lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt;"},{"name":"GIOTT","text":"An' who're you? You─&lt;hic&gt;─you lookin' at me? You got─&lt;hic&gt;─shomethin' to shay?"},{"name":"GIOTT","text":"Got you, eh? Ha! Of course I remember my new partner. And I ain't drunk, neither. I'm a dwarf! It'll take more than...well, however much I had to get me under the table."},{"name":"GIOTT","text":"And now you know one more thing about me! This'll only strengthen our fellowship, I'm sure."},{"name":"GIOTT","text":"But we'll need more'n just a sense of camaraderie if we're out to take down Sophrosyne. So I'm thinking we should start with observation─get you a look at its healing powers. Let you see what we're dealing with."},{"name":"GIOTT","text":"Now, this is the perfect place to overhear the right sort of information, if you listen. Don't get the wrong idea─I don't let it get in the way of no important drinking, but I do pay attention. Anyway, what I heard is that Sophrosyne's been spotted in Kholusia."},{"name":"GIOTT","text":"Then I remembered─there's a little pub over in Stilltide. The Leaky Keel, it's called, and they make a decent brew. Some of the folks there should be able to point us in the right direction."},{"name":"GIOTT","text":"&lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; An' jusht what're you─&lt;hic&gt;─lookin' at?"},{"name":"GIOTT","text":"Fine, fine! No need to give me that murderous stare. I know what you're thinking."},{"name":"GIOTT","text":"“That Giott,” you think to yourself, “always drinking and lounging about and drinking some more. What a sluggard! What a drunkard! What a magnificent beard! Oh, I wish I had a beard like that...” Yes, I know. You don't need to explain yourself to me."},{"name":"GIOTT","text":"...We really should work on finding you a sense of humor. Maybe deal with that after Sophrosyne─it might take a while. Anyway, you'll be happy to hear that while I was waiting, I got my hands on some prime information. Also some excellent wine, which─no, information first."},{"name":"GIOTT","text":"Right. So, according to the local fisherfolk, quite a few sin eaters've turned up near the Bright Cliff lately."},{"name":"GIOTT","text":"I suggest we go there and kill as many as we can find. We can't say for sure where Sophrosyne'll appear next, but if it's in the area, it won't pass up a chance to revive its fallen friends, right?"},{"name":"GIOTT","text":"And while we're at it, you can vent some of that pent-up rage you've got. Don't need to be pretty, so long as the job gets done. Just make sure to find me again before Sophrosyne shows up, you hear?"},{"name":"GIOTT","text":"Glad you found the place, but you'll want to stand back when I get to whacking. Maybe do your slaying over to the south."},{"name":"GIOTT","text":"That should do it."},{"name":"GIOTT","text":"Now we wait to see if Sophrosyne shows itself...over in those bushes, say. And I've got the wine right here..."},{"name":"GIOTT","text":"There─that's it!"},{"name":"GIOTT","text":"See─it revived the other one!"},{"name":"GIOTT","text":"Hey, what's wrong?"},{"name":"LAMITT","text":"(-Dwarven Healer-)What a lonely place to die. The world outside is even worse than I feared..."},{"name":"WARRIOROFDARKNESS","text":"...Is someone...there? &lt;wheeze&gt;"},{"name":"LAMITT","text":"(-Dwarven Healer-)You're alive!? Well, why didn't you say so?"},{"name":"LAMITT","text":"(-Dwarven Healer-)I can't do much for the dead, but the living─that's a whole other matter."},{"name":"WARRIOROFDARKNESS","text":"I can't believe it! All of my wounds, healed! Thank you, kind stranger!"},{"name":"LAMITT","text":"(-Dwarven Healer-)You sure are lucky that I passed by. You really might have died, you know?"},{"name":"WARRIOROFDARKNESS","text":"You'll hear no argument from me─I was a fool. The thought that the hobgoblin I was after might have friends lying in wait never so much as crossed my mind. I shouldn't have been out here alone."},{"name":"WARRIOROFDARKNESS","text":"Hmm... With your magic to keep me fighting, though, their numbers wouldn't pose such a problem. What do you say? You don't look to have a party of your own yet, and I could certainly use a man like you on my side."},{"name":"LAMITT","text":"(-Dwarven Healer-)Wha─ I am no <span class=\"emphasis\">man</span>, you unripened gourd! Why, I've never been so insulted in all my life!"},{"name":"LAMITT","text":"Let me tell you what's what. I'm Lamitt, proud daughter of the Tholl family. And if I catch you mocking me again, I'll put you right back the way I found you, you hear?"},{"name":"WARRIOROFDARKNESS","text":"Er...yes, ma'am! I certainly didn't mean to offend! The beard misled me, you see..."},{"name":"LAMITT","text":"And that's that!"},{"name":"LAMITT","text":"Look, Ardbert! Treasure!"},{"name":"LAMITT","text":"You certainly look the hero. Now let's see you act like one!"},{"name":"GIOTT","text":"Hello? <span class=\"highlight\">Forename</span>?"},{"name":"GIOTT","text":"Hey, you! Honorless lout! Half-empty flagon! <span class=\"alternative-container\"><span class=\"alternative\">Lanky dullard</span><span class=\"alternative\">Spindly-looking gobshite</span><span class=\"alternative\">Dumpy little dollop of shite</span><span class=\"alternative\">Mangy pox-bearer</span><span class=\"alternative\">Lumbering lummox</span><span class=\"alternative\">Pointy-headed dung-sniffer</span><span class=\"alternative\">Great roaring ninny</span><span class=\"alternative\">Craven carrot-eater</span></span>! Your mother was a hob and your face looks like a newborn's arse!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What is the <span class=\"emphasis\">matter</span> with you?"},{"name":"A1","text":"That was...colorful."},{"name":"GIOTT","text":"I thought that a refreshing round of insults would snap you out of it─and it did! Not my fault if you can't appreciate an exercise in creative wordplay. Are you <span class=\"emphasis\">sure</span> your mother ain't a hob?"},{"name":"GIOTT","text":"Straight-faced as always. A refreshing round of insults always cheers me up, but I'm starting to wonder if you have as much trouble with fun as you do with jokes. Are you <span class=\"emphasis\">sure</span> your mother ain't a hob?"},{"name":"GIOTT","text":"Fine, fine, never mind. At least we got what we came for. And you didn't miss much─after Sophrosyne brought the other eater back to life, they both floated off to who-knows-where."},{"name":"GIOTT","text":"But what happened to you?"},{"name":"GIOTT","text":"You saw Sophrosyne─no, the real Lamitt's past? Ha! I knew you'd have some kind of weird power!"},{"name":"GIOTT","text":"Sounds to me like what you witnessed was the beginning of Lamitt's journey, right after she left home."},{"name":"GIOTT","text":"It's odd─you said she was wearing her helm, and she helped out that injured traveler just like any dwarf of honor would do. Maybe... Maybe she wasn't born a monster. But then..."},{"name":"GIOTT","text":"It don't sit right with me, neither. But standing around wondering about it won't do nothing but make us thirsty. We're done here, so let's go back to the Crystarium."},{"name":"GIOTT","text":"&lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; Ahhh... There ain't nothing like a flagon of ale after a job well done!"},{"name":"GIOTT","text":"Don't give me that look─I did stuff this time! You saw!"},{"name":"GIOTT","text":"And you also saw Sophrosyne work its magic. But since you haven't said nothing about it yet, I'm guessing you didn't have no sudden revelations about how to stop it."},{"name":"GIOTT","text":"Don't worry─I didn't expect you to solve my whole problem just like that. I only need you to remember what you saw today. Keep it in your mind. Then maybe something will come to you when you're working your magic elsewhere."},{"name":"GIOTT","text":"Me, I like to think while I drink─it's the most efficient way─so you can find me here if you need me. I'll let you know when I have a plan."}],"reward":{"gil":1578},"reqs":{"jobs":[{"lvl":72,"id":157}],"quests":[68803]},"next":[68805]},"partials":[{"type":"npc","id":"1031158","obj":{"i":1031158,"n":"Giott","l":2951,"q":5}},{"type":"quest","id":"68803","obj":{"i":68803,"n":"Traditions and Travails","g":180,"l":"The Crystarium","s":201,"f":1}},{"type":"quest","id":"68805","obj":{"i":68805,"n":"The Scientific Method","g":180,"l":"The Crystarium","s":221,"f":1}}]}