{"quest":{"name":"No Greater Sport","location":"The Crystarium","id":68809,"patch":5.0,"sort":301,"icon":100869,"unlocksFunction":1,"eventIcon":71341,"issuer":1030126,"target":1030964,"genre":181,"journal":["Lue-Reeq thinks you just might be the answer to his prayers.","The self-proclaimed bounty hunter Lue-Reeq is in search of a partner to help him slay an especially notorious mark─one of the four Cardinal Virtues, those most infamous instigators of the Flood. However, while you may look the part, Lue-Reeq would have you first demonstrate your considerable skills before your conversation can proceed further. Fortunately, you need not travel far to find suitable prey, as Lakeland has no shortage of ravenous beasts.","The bounty hunter is kind enough to supply you with suitable bait for your audition─delivered to him in the field by a hireling, no less. You need only place it out in the open.","The trap is set. Now comes the part where you must wait for something hungry to come hither...","The beast is no more, as Lue-Reeq has doubtless observed. All that remains is to confirm that he is satisfied by your performance.","Lue-Reeq applauds your martial prowess, clearly relieved that his judgment was not in error. He bids you return to the Crystarium where you will finalize the terms of your arrangement.","Unlike others, Lue-Reeq cares not a whit for who the Warriors of Light were, be it heroes or villains. However, the fallen adventurer-turned-Virtue Renda-Rae was arguably the greatest hunter who ever lived, and the youth would like nothing more than to beat her at her own game. Fame and fortune is your promised reward, though he is happy to provide some modest compensation in advance. Needless to say, this may be the beginning of a beautiful partnership...<br><br>※The next role quest will be available from Lue-Reeq upon reaching level 72 in any physical DPS class."],"objectives":["Rendezvous with Lue-Reeq in Lakeland.","Use the bait to lure out a wild beast.","Wait for and slay the wild beast.","Speak with Lue-Reeq.","Speak with Lue-Reeq in the Crystarium."],"dialogue":[{"name":"LUEREEQ","text":"Wait. You wouldn't happen to be..."},{"name":"LUEREEQ","text":"Yes, of course you are. 'Tis plain from the way you carry yourself. You're just the sort of <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I've been looking for! You're perfect!"},{"name":"LUEREEQ","text":"My name is Lue-Reeq, and I...am a bounty hunter. But not just any bounty hunter, I will have you know. Nay, I am not wont to settle for run-of-the-mill prey. I hunt sin eaters."},{"name":"LUEREEQ","text":"Not only that, I have recently set my sights on a particularly notable fiend─one of the four Cardinal Virtues, those infamous instigators of the Flood itself."},{"name":"LUEREEQ","text":"Naturally, it will take considerable strength and skill to defeat such a formidable eater, and I am not afraid to admit I cannot do it alone. However, with the aid of equally formidable allies, I am confident it can be done..."},{"name":"LUEREEQ","text":"And you, my friend, are exactly the sort of ally I have a mind to recruit!"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Walk away without a word."},{"name":"A1","text":"Feign interest."},{"name":"LUEREEQ","text":"W-Wait! I have money! Lots and lots of money! You will be well rewarded for your service, on my honor!"},{"name":"LUEREEQ","text":"Aha! I knew you would be interested! And should the challenge alone be insufficient motivation, know that I have substantial financial resources at my disposal. You will be duly compensated for your service, rest assured."},{"name":"LUEREEQ","text":"However, as much as I am certain you are the right <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the job, 'tis only meet that I put your skills to the proof. A simple test should suffice."},{"name":"LUEREEQ","text":"Pray do not be offended, but you would be shocked how many people present themselves falsely in order to enrich themselves or to impress others..."},{"name":"LUEREEQ","text":"Here we are! Our proving grounds! You need only slay a beast of suitable ferocity before my very eyes to demonstrate your own."},{"name":"LUEREEQ","text":"Naturally, we require bait to lure one out of hiding..."},{"name":"HIREDMAN03273","text":"Oi, milord. Got your package here."},{"name":"LUEREEQ","text":"Well done, my good man. And here is your payment..."},{"name":"LUEREEQ","text":"Oh, this? The bait in question. Easier to have it delivered than to take a detour and pick it up myself. Rather more efficient as well. Time is money!"},{"name":"LUEREEQ","text":"Now then─you need only place it in the open and slay whatever comes to claim it. I cannot imagine it will take long for something to come hither."},{"name":"LUEREEQ","text":"As I said, simply place the bait out in the open and await whatever ferocious beast comes to feast upon it. Slay it, and I will know you to be a warrior brave and true!"},{"name":"LUEREEQ","text":"Fantastic! I knew I was not wrong about you. Come, let us return to the Crystarium at once."},{"name":"LUEREEQ","text":"Congratulations on a kill well made, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! I daresay this is the beginning of a beautiful partnership!"},{"name":"LUEREEQ","text":"Let us commemorate the occasion with a feast! Eat, drink, and be merry!"},{"name":"LUEREEQ","text":"&lt;grunt&gt; &lt;crunch&gt; &lt;crunch&gt;<br>&lt;snort&gt; &lt;slurp&gt; &lt;grunt&gt;<br>Wonderful stuff, isn't it? My compliments to the chef. &lt;belch&gt;"},{"name":"LUEREEQ","text":"Another helping? No? Are you sure? It really is no bother. Oh, very well..."},{"name":"LUEREEQ","text":"...I should like to return to our earlier discussion─that of the Virtue I have engaged you to hunt with me."},{"name":"LUEREEQ","text":"Andreia is her name, and she roams Norvrandt in the guise of Renda-Rae, fallen Warrior of Light and renowned hunter of eld."},{"name":"LUEREEQ","text":"She is a most elusive eater who has been sighted in every corner of the realm. Though her movements are unpredictable, she has often been witnessed pursuing and slaying extraordinarily dangerous beasts."},{"name":"LUEREEQ","text":"I can well imagine the question forming in your head─why not leave her be? If anything, is she not aiding local communities after a fashion? Alas, no, for the beasts she slays rise anew, as eaters, which pose even greater threats to the smallfolk."},{"name":"LUEREEQ","text":"So you see, this one wretched sin eater is in truth sowing untold chaos by carrying on as she does, unleashing more of her kind on unsuspecting towns and villages all across Norvrandt. Only you and I can stop her."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"So she was a Warrior of Light?"},{"name":"A2","text":"Didn't the Warriors of Light save the world?"},{"name":"LUEREEQ","text":"Huh. What an odd thing to ask. But never mind all that─whether or not they were heroes or villains or whatever a hundred years ago doesn't matter to me."},{"name":"LUEREEQ","text":"The simple truth is, Renda-Rae was the greatest hunter who ever lived, and beating her at her own game would be an amazing feat, don't you think?"},{"name":"LUEREEQ","text":"And regardless of what the Warriors of Light were before they became sin eaters, that's what they are now, so we'd be doing folks a favor by killing one."},{"name":"LUEREEQ","text":"Well? What say you, friend? Will you hunt Andreia with me?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"With pleasure."},{"name":"A3","text":"I hope I live to regret this..."},{"name":"LUEREEQ","text":"So begins our formal partnership! Ahh, I can see it now─you and me in the heat of battle, fighting side by side, the picture of courage and camaraderie! It's going to be grand!"},{"name":"LUEREEQ","text":"Naturally, it will take us time to study and understand our prey. Eaters can behave in strange and inexplicable ways, particularly powerful ones like Andreia."},{"name":"LUEREEQ","text":"I've been doing my best to get inside her head─to think like a hunter─but it is easier said than done. Anyway! As soon as I have determined where we ought to begin our search, I will inform you at once!"},{"name":"LUEREEQ","text":"...Oh? Is the reward lacking? My apologies. Next time I will see that you receive rather more substantial compensation."}],"reward":{"gil":1234},"reqs":{"jobs":[{"lvl":70,"id":158}],"quests":[68837]},"next":[68810]},"partials":[{"type":"npc","id":"1030126","obj":{"i":1030126,"n":"Lue-Reeq","l":2951,"q":1}},{"type":"npc","id":"1030964","obj":{"i":1030964,"n":"Lue-Reeq","l":2951,"q":5}},{"type":"quest","id":"68837","obj":{"i":68837,"n":"Warrior of Darkness","g":8,"l":"Lakeland","s":230}},{"type":"quest","id":"68810","obj":{"i":68810,"n":"Vengeance in Defeat","g":181,"l":"The Crystarium","s":311,"f":1}}]}