{"quest":{"name":"The Soul of Temperance","location":"Kholusia","id":68808,"patch":5.0,"sort":251,"icon":100868,"unlocksFunction":1,"eventIcon":71341,"issuer":1030021,"target":1030039,"genre":180,"journal":["Giott...<span class=\"emphasis\">isn't drinking</span>.","You snap Giott from a melancholy reverie, prompting the dwarf to remember that Sophrosyne recently paid visit to Tomra and may still be in the area. Giott theorizes, based upon your recent vision, that the Virtue reflexively heals those sin eaters it recognizes as helmless dwarves─those of Lamitt's people who joined her in exile─and concludes that adding a helm to any eaters you would prefer remain dead may be enough to deter it from doing so. Though this seems almost too easy, it is true that sin eaters are simple beings, with no real powers of cognition that might allow them to see through even rudimentary deception. In any case, there is only one way to find out.","You locate a pair of sin eaters, and summarily put them down as potential bait for Sophrosyne. As you well know by now, however, littering the entire area with corpses would be more likely to attract the Virtue's attention─and also somewhat cathartic.","Now that you have dispatched a multitude of sin eaters and given Giott ample time to do the same, the time has come to reunite. Hopefully the dwarf has been able to keep at least one kill reasonably intact.","As hoped, Sophrosyne appears to revive one of the sin eaters you left as lure. Upon engaging the newly risen eater in battle, Giott instructs you to use your spellcraft to put the thing to sleep, and unceremoniously crams its head into a helmet once you do. This does, in fact, prevent Sophrosyne from automatically healing the eater, and thankfully proceeds to work several more times as additional lesser eaters make themselves known. When, at last, all that remains is to defeat the Virtue itself, Giott raises the sole remaining spare helm brought for this purpose with a triumphant shout─and is promptly hurled backward by a sorcerous blow, the helm blasted to smithereens. With no other choice, she brazenly removes her own helm, revealing her face for the first time. Crowned with the helm of your courageous comrade, Sophrosyne is finally vulnerable, and the pair of you destroy it as one.","Sophrosyne leaves behind a damaged crystal, one which you recognize immediately. As you pick it up, it resonates, calling forth a manifestation of Lamitt's memories. Giott calls out to her, though she is long beyond hearing, desperate to assure her that her legacy is not forgotten. And while the real Lamitt may not have known that, someday, one amongst her kin would at last recognize her for the noble woman she had been, her shade's words make clear that she was, at least, at peace with her sacrifice in the end.","You speak to Giott, who confirms what you suspected─having broken her people's taboo by taking off her helm, she no longer feels as if she can return to Tomra. Having seen how inflexible dwarven traditions can be, and knowing how much they mean to Giott, you know it is not your place to disagree, and so follow her to the Crystarium instead.","When you join Giott at the Wandering Stairs, she appears to be faring better than one might have expected, given the circumstances, and is certainly cheered for your presence. She tells you that while she still values tradition, leaving her village has given her an appreciation for the wider world and all that is precious in it─an appreciation that Lamitt, too, once shared. As you trade fond farewells, it is clear that, much like the woman she has come to admire, she will bear her burdens without breaking under their weight."],"objectives":["Slay sin eaters at the destination.","Slay sin eaters at the next destination.","Report to Giott.","Speak with Giott.","Speak with Giott at the Wandering Stairs.","（★未使用／削除予定★）","Slay Sophrosyne once and for all!"],"dialogue":[{"name":"GIOTT","text":"Oh. Hello there, <span class=\"highlight\">Forename</span>."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Lali-ho!"},{"name":"A1","text":"Hey, you hammer-brained imbecile! Your mother was a hobgoblin!"},{"name":"GIOTT","text":"Wha─ I mean, lali-ho!"},{"name":"GIOTT","text":"Oh! And a lali-ho to you!"},{"name":"GIOTT","text":"I'm impressed. You knowing to give me a “lali-ho” just now shows that you've really picked up on the finer points of dwarven culture."},{"name":"GIOTT","text":"Some of that may be accurate, but my mother most definitely was <span class=\"emphasis\">not</span> a hobgoblin! Are you sure you ain't getting her confused with your own mother?"},{"name":"GIOTT","text":"Ha! Hammer-brained!"},{"name":"GIOTT","text":"I never thought I'd see the day when you took to friendly insults, partner!"},{"name":"GIOTT","text":"That really helped, thanks! I was so busy dwelling on that business with Lamitt that I almost forgot the news I had for you about Sophrosyne."},{"name":"GIOTT","text":"You remember that sin eater I killed in the Blightwarrens? Well, while you were gone, Sophrosyne showed up to revive it."},{"name":"GIOTT","text":"Seeing that convinced me..."},{"name":"GIOTT","text":"I mean, you remember how I was wondering why Sophrosyne don't revive every sin eater we take down, right?"},{"name":"GIOTT","text":"Well, we learned from your vision that the dwarves that Lamitt cured of stoneblight went into exile of their own volition."},{"name":"GIOTT","text":"As you can see, the village was spared the worst of the Flood. But the folks that left, well...probably weren't. Which means..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"They became sin eaters."},{"name":"A2","text":"Sophrosyne is healing the same people Lamitt did!"},{"name":"GIOTT","text":"Right─it's the only thing that makes sense. Those poor souls couldn't go back to the village, so they got caught in the Flood. They became sin eaters. And Sophrosyne is still saving them. Even now."},{"name":"GIOTT","text":"...And that gave me an idea! As we figured before, Sophrosyne ain't alive. But Lamitt wanted so badly to heal those dwarves that it's still following suit─like a reflex its body can't forget."},{"name":"GIOTT","text":"The last time Lamitt saw those folks she healed, they were helmless, leaving their home for the last time. She probably never forgot the sight of them. And so Sophrosyne goes around healing helmless dwarves to this day. You see the solution, right? Helms!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Incredible! That's the stupidest thing I've ever heard!"},{"name":"A3","text":"So simple...it's brilliant!"},{"name":"GIOTT","text":"It sounds too simple, I know. But it'll work, I tell you! Sophrosyne is healing helmless dwarves on pure instinct. Anyone wearing a helm, it won't think twice about─seeing as it don't actually think at all."},{"name":"GIOTT","text":"Isn't it just? Not as brilliant as my beard, maybe, but few things are."},{"name":"GIOTT","text":"Now, whether clapping a helm onto Sophrosyne will keep it from healing <span class=\"emphasis\">itself</span>, I can't say. It'll depend on whether the thing sees itself as just another helmless dwarf. It don't seem to have much in the way of self-awareness, so I think it's worth a shot."},{"name":"GIOTT","text":"Fortunately, we won't need to wait to find out. It came around not too long before you did, so if we kill the right sort of sin eaters, it should still be close enough to notice. Let's get to it!"},{"name":"GIOTT","text":"You go and find some sin eaters─I'll grab a few spare helms."},{"name":"GIOTT","text":"Right. So we've got our eaters, we've got our helms..."},{"name":"GIOTT","text":"And now, we wait. Once Sophrosyne shows up, we'll test out a helm on the bait first─that'll also save us from having to kill it over and over."},{"name":"GIOTT","text":"This feels familiar."},{"name":"GIOTT","text":"(-Giott-)Aha! At last!"},{"name":"GIOTT","text":"A bit less toppling over on your part, this time, if you please."},{"name":"GIOTT","text":"Wait for it to be distracted with healing the other one. Then we strike."},{"name":"GIOTT","text":"Now! Charge!"},{"name":"GIOTT","text":"As I said, we'll try this on the lesser eater first."},{"name":"GIOTT","text":"I'll give it a bit of a pummeling, then you put it to sleep with Repose. That'll give me the chance to slip the helm on."},{"name":"GIOTT","text":"I doubt it'll take to napping mid-battle unless it's nearly ready to drop, so wait for my signal, you hear?"},{"name":"GIOTT","text":"It's time, <span class=\"highlight\">Forename</span>! Cast Repose!"},{"name":"GIOTT","text":"Alright, let's get that ugly mug of yours covered up."},{"name":"GIOTT","text":"Ha! Ain't that a sight?"},{"name":"GIOTT","text":"Listen, when I said “put it to sleep,” that wasn't a euphemism. If we kill it, Sophrosyne'll keep bringing it back!"},{"name":"GIOTT","text":"Looks like it worked─it's not reviving the thing. Now we─ Uh oh."},{"name":"GIOTT","text":"Lucky for us, I brought extra helms in case of emergency!"},{"name":"GIOTT","text":"Alright, <span class=\"emphasis\">now</span> we can─ Oh, wicked <span class=\"emphasis\">white</span> that's annoying."},{"name":"GIOTT","text":"Are these ones maybe...trying to protect it? Does some part of them remember?"},{"name":"GIOTT","text":"Well, no time to ponder that now. Helms away!"},{"name":"GIOTT","text":"It looks like they've...&lt;pant&gt;...stopped coming. Now we hit Sophrosyne with everything we've got!"},{"name":"GIOTT","text":"It's time, <span class=\"highlight\">Forename</span>! We can end this."},{"name":"GIOTT","text":"Looks like I was right─no healing for you! Ha!"},{"name":"GIOTT","text":"Oh, right. Lamitt was a big damn hero. No surprise that she knows a few dangerous tricks."},{"name":"GIOTT","text":"Come here! Quickly!"},{"name":"GIOTT","text":"I knew you'd have my back!"},{"name":"GIOTT","text":"Here it comes. Try not to die!"},{"name":"GIOTT","text":"You don't scare me! I have a giant hammer!"},{"name":"GIOTT","text":"Perfect! Now..."},{"name":"GIOTT","text":"Hold still!"},{"name":"GIOTT","text":"Waugh!"},{"name":"GIOTT","text":"Oof. Thanks."},{"name":"GIOTT","text":"The helm got it even worse than I did just then. And it was our last one."},{"name":"GIOTT","text":"I hate to say it, but this ain't going as well as I hoped. If we had even one more helm, I could try again, but..."},{"name":"GIOTT","text":"Wait. We do have one more helm..."},{"name":"GIOTT","text":"Just the one!"},{"name":"GIOTT","text":"Well, well... Looks like it's time to take this eater down, once and for all. Together!"},{"name":"GIOTT","text":"Ha! Take that, you pasty bastard!"},{"name":"GIOTT","text":"What's that you've got there, <span class=\"highlight\">Forename</span>?"},{"name":"GIOTT","text":"Some kind of crystal?"},{"name":"LAMITT","text":"(-???-)Tradition wouldn't have saved her. That's why I left."},{"name":"LAMITT","text":"(-Lamitt's Shade-)I left, and I traveled. I met Ardbert. We found our companions. And together, we searched."},{"name":"GIOTT","text":"Are you...her? Lamitt? I... Listen, I called you a disgrace, before, and..."},{"name":"LAMITT","text":"(-Lamitt's Shade-)My journey was not an easy one. To save my sister, to save them all, I faced a thousand thousand foes."},{"name":"GIOTT","text":"I know! I understand, now! And I'm so..."},{"name":"LAMITT","text":"(-Lamitt's Shade-)But as I did, I learned. How wide this world is. How beautiful. How cruel. And how much I wanted to protect it."},{"name":"LAMITT","text":"(-Lamitt's Shade-)Perhaps it should have been easy for me, then. To give up my home forever, for a greater cause. It wasn't. It hurt so much..."},{"name":"GIOTT","text":"But you bore it! You forgave them! You survived..."},{"name":"LAMITT","text":"(-Lamitt's Shade-)Yes, it hurt, but I survived. Because they were there. Because <span class=\"emphasis\">he</span> was there."},{"name":"LAMITT","text":"(-Lamitt's Shade-)Ardbert, you stubborn idiot. You sweet boy. You never did understand what you meant to me..."},{"name":"GIOTT","text":"Rest well, Lamitt. You were the best of us."},{"name":"GIOTT","text":"We did it─I can hardly believe it!"},{"name":"GIOTT","text":"This calls for a drink at the Crystarium, don't you think?"},{"name":"GIOTT","text":"If that silence is you wondering if I want to go home─well, I can't. I showed my face to you, didn't I? Broke our rules."},{"name":"GIOTT","text":"So I'm thinking I'll give Lamitt's way a try. Live proud as an exile, just like all the other folks that she saved."},{"name":"GIOTT","text":"Aw, don't make that face. It's nothing that a little ale won't solve!"},{"name":"GIOTT","text":"&lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; Ahhh. That's the stuff!"},{"name":"GIOTT","text":"Er, can I help you? You're staring─<span class=\"emphasis\">really</span> staring. Do you know you're doing that?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Exactly how much have you had to drink?"},{"name":"A4","text":"I'm glad that you're here. Helm or no."},{"name":"GIOTT","text":"Well, I lost count─so about as much as usual. Ha! I may be an exile, but I'm still a dwarf. And don't you forget it!"},{"name":"GIOTT","text":"Ha! Looks like you finally figured out how to tell a joke! Now's the part where I stare all misty-eyed into the distance, right?"},{"name":"GIOTT","text":"Wha─ Are you sure!? Because I, well... Oh. Ohhh. You're joking, aren't you? For a moment there, I thought, er...never mind."},{"name":"GIOTT","text":"Anyway, there's something I've been wanting to tell you. Firstly, well...you've been following along with my crazy plans this whole time, but I never really said how much I appreciate your help with Sophrosyne─and Lamitt. Thank you."},{"name":"GIOTT","text":"And...I think you deserve to know something else, too. You know the elder who exiled Lamitt? That was my great-grandfather."},{"name":"GIOTT","text":"He's remembered as the greatest warrior of our kind. I always wanted to be just like him. To be strong, honorable, protect our traditions."},{"name":"GIOTT","text":"But Lamitt, she saved so many from their suffering. Us dwarves might not even be here today if she hadn't cured stoneblight..."},{"name":"GIOTT","text":"And he took away her home. Forever. It's hard to see that as anything other than cruel."},{"name":"GIOTT","text":"Tradition is important. But it's not the only important thing. Kindness, empathy, love─this world and the living, breathing people in it─they matter more. That's what I learned from all the folks I shared drinks with. From Lamitt. And from you."},{"name":"GIOTT","text":"And I intend to keep learning. Here, in this city. With my face plain for all to see, and my head held high."},{"name":"GIOTT","text":"So you know where to find me, next time you want to share a drink!"},{"name":"GIOTT","text":"I know our job is done. But you'll always have a place at my side, you hear?"}],"reward":{"gil":2830,"items":[{"id":25186},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":157}],"quests":[68807]},"next":[68751,68754,68758]},"partials":[{"type":"npc","id":"1030021","obj":{"i":1030021,"n":"Giott","l":2954,"q":2}},{"type":"npc","id":"1030039","obj":{"i":1030039,"n":"Giott","l":2951,"q":1}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68807","obj":{"i":68807,"n":"Never to Return","g":180,"l":"The Crystarium","s":241,"f":1}},{"type":"quest","id":"68751","obj":{"i":68751,"n":"Whence the Healing Springs","g":153,"l":"South Shroud","s":800}},{"type":"quest","id":"68754","obj":{"i":68754,"n":"True Beauty","g":156,"l":"Limsa Lominsa","s":800}},{"type":"quest","id":"68758","obj":{"i":68758,"n":"Love, Astrologically","g":159,"l":"Ishgard","s":800}}]}