{"quest":{"name":"Confessions of a Flaming Mongrel","location":"Limsa Lominsa","id":68800,"patch":5.0,"sort":121,"icon":100871,"unlocksFunction":1,"eventIcon":71341,"issuer":1029073,"target":1029098,"genre":162,"journal":["Radovan is hoping for a nice, straightforward, no-strings-attached assignment.","Radovan is pleased to inform you that the Yellowjackets are in need of bodyguards. Considering the unforeseen difficulties with your previous client, an assignment with as few surprises as possible would be most welcome. To ascertain exactly what this job entails, you will need to speak with Futag Yafutag at Bulwark Hall.","The Yellowjacket Futag Yafutag gives a brief outline of your mission, revealing that the person you will be protecting is Guldweitz, former head of the much reviled Flaming Mongrels. While Radovan and Sophie both have reservations about guarding a notorious criminal, Futag explains that the pirate has handed himself in and wishes to testify, implicating countless members of Limsa Lominsa's underworld. Naturally, there are many who would prefer that Guldweitz's silence be made a permanent arrangement, meaning that the assignment to escort him from the Moraby Drydocks is a particularly dangerous one. After Futag departs, Radovan points out the risks of relying solely on the information provided by the client, and suggests asking the Lominsan citizens about Guldweitz and the Flaming Mongrels.","The information you glean from the locals correlates with that of your client. Guldweitz and his gang are believed to have had a hand in almost every case of extortion, with their moneylenders preying on businesses and individuals throughout the city. Many citizens would be glad to see Guldweitz behind bars or even executed for his crimes, and it is plain to see that the man has no shortage of enemies.","It appears that Guldweitz is exactly as your client has described, if not worse. Satisfied that the assignment is above board, Radovan suggests proceeding to the agreed meeting place.","Futag brings out Guldweitz, his prisoner, although it is hard to believe that this forlorn old man could be the criminal mastermind who has terrorized Limsa Lominsa. Before your arrival, the Yellowjackets have scouted the proposed route and have spotted what they believe to be an ambush. You are tasked with leading the way and drawing out the enemy, clearing a path for your comrades while they escort Guldweitz.","Dispatching the assailants proves to be a remarkably simple affair. As instructed, you head towards Oschon's Embrace to await the arrival of Guldweitz and his custodians.","Immediately after reaching the rendezvous point, another Yellowjacket arrives to report that the rogues you neutralized were only lookouts, with the real ambush awaiting further along your route. She also explains that Futag has been ordered to return to his post, while she is charged with moving Guldweitz to a more secure location until the enemies lying in wait can be eliminated. Though Futag is clearly displeased with the sudden turn of events, he reluctantly informs you, Radovan, and Sophie that your contract has been fulfilled and that your services are no longer required. Radovan, on the other hand, refuses to leave the job half-finished and chases after Guldweitz's newly assigned escort.","Radovan has followed the Yellowjacket to an isolated mining tunnel, and rushes inside to find that she is preparing to behead Guldweitz. She questions why Radovan is denying her vengeance for her friend's death, for which she holds Guldweitz responsible. Radovan states that he gave his word to protect him and that the prisoner is acting for the good of Limsa Lominsa. The Yellowjacket, swayed by this reasoning, lowers her axe and is placed under arrest by Futag, who arrives just in time to witness the aftermath of this unfortunate incident. Your mission, despite being severely waylaid, resumes as per your original instructions, but before you leave, Guldweitz expresses his gratitude to Radovan. After discovering that he is suffering from an incurable disease, Guldweitz came to the realization that people like him are reason why so many Lominsans are dragged into a life of crime. By removing himself and the ones he would implicate from circulation, he hopes to tip the scales in the favor of law and order. These words give you and your friends food for thought as you continue the journey to Limsa Lominsa.","Now that Guldweitz has been delivered to the Lominsan authorities, Radovan has fulfilled his promise. The time has come for you to travel to pastures new, and having visited Gridania, Ul'dah, and Limsa Lominsa, the most likely candidate would be the snow-blasted peaks of Ishgard, much to Sophie's obvious displeasure.","Sophie is clearly unused to such inclement conditions, and even a change into warmer attire does little to alleviate her discomfort. Radovan has, in the absence of an Adventurers' Guild, made inquiries with the Temple Knights in the hope of finding clients in need of bodyguards.<br><br>※The next gunbreaker quest will be available from Radovan upon reaching level 68."],"objectives":["Speak with Futag Yafutag at Bulwark Hall.","Speak with locals around the Octant.","Speak with Radovan.","Speak with Futag Yafutag at the Moraby Drydocks.","Survey the designated location and defeat the assailants.","Wait at the designated location.","Speak with Radovan.","Speak with Radovan in Ishgard."],"dialogue":[{"name":"SOPHIE","text":"Radovan didn't seem too impressed by the idea of going for a swim at Costa del Sol. You don't suppose he's scared of water, do you?"},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Litany of Peace.”"},{"name":"RADOVAN","text":"You'll be pleased to hear that the Yellowjackets have offered us an assignment."},{"name":"SOPHIE","text":"After taking on more than we'd bargained for with our previous clients, we're hoping this one will turn out to be relatively straightforward. We haven't heard what it entails yet, but I'll bet it's something important."},{"name":"RADOVAN","text":"A man called Futag Yafutag has arranged to meet us in Bulwark Hall. Let's go and see what he wants."},{"name":"RADOVAN","text":"So, these Yellowjackets uphold the law? I imagine they have their work cut out for them around here."},{"name":"SOPHIE","text":"Their uniform seems a bit billowy for my tastes, but I do like the color."},{"name":"FUTAGYAFUTAG","text":"Thank you for coming at such short notice. Time is of the essence, so I'll be brief. We want you to protect Guldweitz, who was until recently leader of the Flaming Mongrels."},{"name":"FUTAGYAFUTAG","text":"They were once a gang of raiders, but eventually settled in Limsa Lominsa to extort and rob their way to a position of considerable influence in the criminal underworld."},{"name":"FUTAGYAFUTAG","text":"That all ended when Guldweitz turned himself in. No one saw it coming, not even the other Flaming Mongrels."},{"name":"FUTAGYAFUTAG","text":"He's due to give testimony in exchange for a reduced sentence. And not just about the crimes he committed himself, either. All of the gangs he's had dealings with have ample reason to silence him before he spills his secrets."},{"name":"FUTAGYAFUTAG","text":"He's currently being held in the Moraby Drydocks. Your job is to see that he reaches Limsa in one piece."},{"name":"SOPHIE","text":"So, you want us to act as bodyguards to a criminal? I don't like the sound of that."},{"name":"RADOVAN","text":"We'd be protecting the information that's in his head, which could be used to bring countless other lawbreakers to justice. It sounds like a worthwhile cause to me."},{"name":"FUTAGYAFUTAG","text":"It is. And before you ask why we're hiring outsiders, it's to avoid attention. If I pull too many Yellowjackets from their posts, the gangs'll figure out what's going on."},{"name":"FUTAGYAFUTAG","text":"Better to give the impression that it's business as usual while using professionals like you to escort him in secret."},{"name":"FUTAGYAFUTAG","text":"We still need to secure the route, so I'll go on ahead and see to the preparations. Come and find me at the Drydocks when you're ready."},{"name":"RADOVAN","text":"Before we begin, we should find out more about this Guldweitz. While it's important to place our trust in the client, I don't want to repeat the mistake we made last time."},{"name":"RADOVAN","text":"We've been tricked before and I'll not have it happen again. If you find any information on Guldweitz, let me know."},{"name":"SOPHIE","text":"This Guldweitz has garnered quite the reputation for himself. It seems Futag Yafutag was telling the truth."},{"name":"AHLDSKYF","text":"If the rumors are true, the Flaming Mongrels are involved in most of the moneylending and extortion that goes on in this city. Guldweitz was at the center of this web, overseeing every aspect of these clandestine activities."},{"name":"AHLDSKYF","text":"Now that he has finally found the decency to give himself up, I imagine that his former associates would rather he kept quiet concerning their dealings."},{"name":"JNASSHYM","text":"Oh yes, everybody has heard of the Flaming Mongrels. Their modus operandi is to offer loans, increase the interest to the extent that their mark has no hope of ever paying it back, and then forcing that poor soul to obey their every whim!"},{"name":"SUNDHIMAL","text":"I am not at liberty to discuss an ongoing investigation. I can say, however, that many Yellowjackets believe heartless curs like Guldweitz deserve nothing less than death."},{"name":"SUNDHIMAL","text":"He and his rogues have left only tragedy and despair in their wake. Mercy would be a waste."},{"name":"AHLDSKYF","text":"If he testifies, his life will scarce be worth living. Whether in gaol or roaming free, he will be hounded mercilessly until the day he dies. I almost feel sorry for the scoundrel. Almost."},{"name":"JNASSHYM","text":"I hasten to add that I and the Brugaire Consortium have had no illicit transactions with the Flaming Mongrels or any other gang. Perish the thought!"},{"name":"SUNDHIMAL","text":"I am all for having Guldweitz spill his secrets, provided that he is put to death immediately after."},{"name":"RADOVAN","text":"Did you hear anything useful?"},{"name":"RADOVAN","text":"Yes. It's just as Futag Yafutag said. Guldweitz certainly has a lot of enemies on both sides of the law."},{"name":"SOPHIE","text":"Radovan, it's not too late to refuse. Think about what you're doing!"},{"name":"RADOVAN","text":"Trust me, I have. Now, let's say no more on the matter. We have a job to do."},{"name":"RADOVAN","text":"We can't let anyone get between us and Guldweitz. If he dies, it's all for naught."},{"name":"SOPHIE","text":"I expect he'll be in fetters, but I'll still be keeping an eye on him. If he tries to escape, I'll make him regret it!"},{"name":"FUTAGYAFUTAG","text":"All set? Good. Then it's time to bring out the prisoner."},{"name":"FUTAGYAFUTAG","text":"I present Guldweitz, scourge of Limsa Lominsa. His life's in your hands now. Guard him well."},{"name":"GULDWEITZ","text":"Thank ye kindly."},{"name":"SOPHIE","text":"Hmm? Are you sure you've got the right man?"},{"name":"FUTAGYAFUTAG","text":"Quite sure. Now, listen carefully─this is important. We've scouted the road ahead and we've spotted a group of unsavory figures lying in wait. The plan is to put them down and rush past before anyone realizes what's happened."},{"name":"RADOVAN","text":"Well...if that's how you'd prefer us to handle it, then very well. But we'll need someone to take the lead and cut through their ambush."},{"name":"RADOVAN","text":"I choose you for that role, <span class=\"highlight\">Forename</span>. Show me how far you've come as a gunbreaker!"},{"name":"RADOVAN","text":"The rest of us will stay close to Guldweitz and fend off any that try to flank us. Futag, I give you my word that we'll get him to Limsa Lominsa, even if I have to carry him there."},{"name":"FUTAGYAFUTAG","text":"We're depending on you, <span class=\"highlight\">Forename</span>. Once you've cleared a path, we'll be right behind you. We'll regroup at Oschon's Embrace and assess the situation before moving on."},{"name":"RADOVAN","text":"Cutting a swath through enemy lines, striking where they're most vulnerable before they have a chance to counterattack─this is where gunbreakers excel. "},{"name":"FUTAGYAFUTAG","text":"Don't push yourself too hard. If things take a turn for the worse, fall back."},{"name":"SOPHIE","text":"I'd go with you if I could, but my first responsibility is to keep Guldweitz alive. Radovan's orders!"},{"name":"GULDWEITZ","text":"I 'preciate what yer doin' for me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"BALLOON","text":"Think you can stop us?"},{"name":"BALLOON","text":"Kill <span class=\"alternative-container\"><span class=\"alternative\">'er</span><span class=\"alternative\">'im</span></span>!"},{"name":"RADOVAN","text":"A pretty poor attempt at an ambush. Without the element of surprise, they're nothing."},{"name":"FUTAGYAFUTAG","text":"Yes, very impressive, but I'll save my thanks until we reach Limsa, if you don't mind."},{"name":"ROEGADYNYELLOWJACKET","text":"I bring bad news, I'm afraid. Those men weren't here to ambush you, they were only lookouts. The bulk of the enemy force lies ahead. We'll take the prisoner to a safe hiding place until those rogues have been dealt with."},{"name":"FUTAGYAFUTAG","text":"What!? Why wasn't I informed sooner?"},{"name":"ROEGADYNYELLOWJACKET","text":"We only just received the information ourselves. I'm to take the prisoner into custody, while you are to return to your post until further notice. As for the hirelings, their services are no longer required."},{"name":"FUTAGYAFUTAG","text":"Now hold on a moment!"},{"name":"ROEGADYNYELLOWJACKET","text":"Look, if you've got a problem, take it up with Commodore Reyner. They're his orders, not mine."},{"name":"FUTAGYAFUTAG","text":"All right, you've made your point."},{"name":"FUTAGYAFUTAG","text":"Well, that's that, I suppose. Nevertheless, I'll see that you receive the full amount, as agreed. It was a pleasure working with you."},{"name":"RADOVAN","text":"Hmm... Something about this doesn't add up. Surely it would make more sense for Futag to go with them? Besides, our agreement was to see Guldweitz to Limsa Lominsa, and that's exactly what I intend to do. You two, come with me."},{"name":"SOPHIE","text":"&lt;sigh&gt; It looks like the shoe's on the other foot this time, so I can hardly refuse. Come on, before he does something we'll regret."},{"name":"SOPHIE","text":"This is her idea of a safe hiding place?"},{"name":"RADOVAN","text":"She took him inside. If my guess is correct, there's no time to waste!"},{"name":"SOPHIE","text":"Nothing for it but to follow him, I suppose."},{"name":"RADOVAN","text":"Stop this at once!"},{"name":"ROEGADYNYELLOWJACKET","text":"Stay out of it, sellsword! My friend's dead because of this filth! He's got no right to live, so why would you protect him!?"},{"name":"RADOVAN","text":"Because I gave my word."},{"name":"RADOVAN","text":"Though he may be beyond redemption, he acts not for his own sake, but for the good of others."},{"name":"RADOVAN","text":"His testimony will make Limsa Lominsa a safer place."},{"name":"RADOVAN","text":"Now, lower your axe."},{"name":"FUTAGYAFUTAG","text":"Thank the Twelve you got here when you did. It didn't take long for us to find out it was all a ruse, but by then, she'd already bought enough time to carry out her plan. Luckily for us, the three of you weren't so easily duped."},{"name":"FUTAGYAFUTAG","text":"Of course, she's not the only Yellowjacket to bear a grudge against Guldweitz. But I never thought any of us would go to such lengths. &lt;sigh&gt; A fine bloody mess this is..."},{"name":"FUTAGYAFUTAG","text":"While we may have been waylaid somewhat, our orders to escort Guldweitz still stand."},{"name":"GULDWEITZ","text":"Afore we go, I want to thank ye for all ye've done."},{"name":"GULDWEITZ","text":"Truth is, I ain't got long to live. Even if I can escape 'avin' me 'ead lopped off, the sickness'll get me sure enough."},{"name":"RADOVAN","text":"You could've lived out your days as one of the leading figures in the underworld, rich and powerful. What made you turn yourself in?"},{"name":"GULDWEITZ","text":"Since afore I can remember, I've been cheatin' and killin' to put food in me belly an' gil in me pocket. An' I was good at it, too. Worked me way to the top. But the top of what? A bunch of liars, swindlers, an' murderers."},{"name":"GULDWEITZ","text":"An' when I found out I only 'ave a few moons left, I realized─ Limsa's the way it is because of people like me. It ain't gotta be that way, though. Not if I say my piece."},{"name":"RADOVAN","text":"In that case, we'd best get you to Limsa. Posthaste."},{"name":"GULDWEITZ","text":"Aye, afore I kick the bucket. Lead the way."},{"name":"SOPHIE","text":"I'm glad our part's over, but I wonder what will happen to Guldweitz?"},{"name":"FUTAGYAFUTAG","text":"That was rather more eventful than I'd anticipated. I must say, however, that you and yours performed admirably."},{"name":"GULDWEITZ","text":"Ye've done right by me. For that, I thank ye."},{"name":"RADOVAN","text":"Not the most direct route, but we got here in the end."},{"name":"FUTAGYAFUTAG","text":"All that remains is for Guldweitz to give his testimony. On behalf of the Yellowjackets, I offer my thanks."},{"name":"GULDWEITZ","text":"Ye've kept your word. Now it's my turn. Fare ye well."},{"name":"RADOVAN","text":"Hmm... Every city has its problems, this one more than most. It is high time we moved on."},{"name":"SOPHIE","text":"Seeing as we've been to Ala Mhigo, Gridania, Ul'dah, and Limsa Lominsa, that just leaves Ishgard... &lt;sigh&gt; I don't exactly thrive in cold climates, though."},{"name":"RADOVAN","text":"Just get yourself a decent overcoat, and you'll be fine. Well then, let's be off."},{"name":"SOPHIE","text":"Brrr! Why would anyone want to live here? Even with these thick clothes, I'm f-f-frozen to the bone!"},{"name":"RADOVAN","text":"I'll admit, it's a fair bit colder than I was expecting. Not that it's anything to be concerned about."},{"name":"SOPHIE","text":"That's easy for you to s-s-say!"},{"name":"RADOVAN","text":"You'll soon get used to it, I'm sure. Anyway, <span class=\"highlight\">Forename</span>, it seems that instead of offering work via an Adventurers' Guild, Ishgard's Temple Knights issue leves."},{"name":"RADOVAN","text":"Although there do not appear to be any clients in need of protection, it is only a matter of time before something comes our way. Until then, be sure not to let your skills, or your gunblade, grow rusty."}],"reward":{"gil":1863},"reqs":{"jobs":[{"lvl":65,"id":149}],"quests":[68799]},"next":[68801]},"partials":[{"type":"npc","id":"1029073","obj":{"i":1029073,"n":"Radovan","l":28,"q":2}},{"type":"npc","id":"1029098","obj":{"i":1029098,"n":"Radovan","l":2300,"q":2}},{"type":"quest","id":"68799","obj":{"i":68799,"n":"For Better or Worse","g":162,"l":"Ul'dah","s":111,"f":1}},{"type":"quest","id":"68801","obj":{"i":68801,"n":"Of Defectors and Defenders","g":162,"l":"Ishgard","s":131,"f":1}}]}