{"quest":{"name":"Never to Return","location":"The Crystarium","id":68807,"patch":5.0,"sort":241,"icon":100868,"unlocksFunction":1,"eventIcon":71341,"issuer":1031158,"target":1030021,"genre":180,"journal":["Predictably, Giott is drinking.","Reading between the lines, you understand that somehow, miraculously, Giott has regained access to the Cabinet of Curiosity─though the volumes within have been of little help in ascertaining the nature of the Ronkan magic Lamitt pursued. Dwarven records, on the other hand, have apparently yielded a useful hint as to the whereabouts of Lamitt's sister at the time of her travels. Your compatriot gives no further details, instead inviting you to visit the dwarven village of Tomra to see for yourself.","You gain access to Tomra via the Ladder─which, judging by the dwarf's comportment upon your arrival, is as much a surprise to Giott as anyone. Before you can ask for more details as to the purpose of your visit, however, your overeager companion rushes off deeper into the village.","Upon locating Giott once again, you find the dwarf poised over the still form of a defeated sin eater, which allegedly attacked when released from nearby tunnels. As Giott explains, said tunnels once served as a quarantine of sorts for those dwarves afflicted with stoneblight─a highly contagious illness that would turn flesh to stone and, at the time, had no cure. You then experience another vision, which confirms that Lamitt did, in fact, eventually succeed in curing her sister and others with the sickness─only to find herself met with scorn and banished from the village for having dared to break her people's taboos. Ever calm in the face of adversity, Lamitt accepted her punishment over Ardbert's protestations. Removing her dwarven helm once and for all, she─joined by her erstwhile patients─left her home, never to return.","Though the helm obscures Giott's face, the dwarf's tone makes it clear that this latest revelation has come as something of a blow. Time to process the story you relayed may help─though you know all too well that the weight of some truths never quite leaves one's shoulders.<br><br>※The next role quest will be available from Giott upon reaching level 80 in any healer class."],"objectives":["Speak with Giott at Tomra.","Speak with Giott.","Speak with Giott once more."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “The View from Above.”"},{"name":"GIOTT","text":"&lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt;"},{"name":"GIOTT","text":"There you are! I need─&lt;hic&gt;─lesh mead. Yeah, you heard me...<span class=\"emphasis\">lesh</span>! But...more ale. Much more. Wait...&lt;hic&gt;...you ain't the waitresh..."},{"name":"GIOTT","text":"Oh, I know you want to say something─but you won't. You think that'll just encourage me. Well, maybe that's what I want you to think! Or maybe...&lt;gasp&gt;...you <span class=\"emphasis\">know</span> that's what I want you to think! All this time I thought I was annoying <span class=\"emphasis\">you</span>, but actually..."},{"name":"GIOTT","text":"Nah, can't be. All of this rubbish about lost civilizations must be getting to me. I've read a dozen histories, and I still don't know nothing about that magic of Lamitt's."},{"name":"GIOTT","text":"What I did find, though, is where she would've gone if she wanted to see her sister─and it's in Tomra."},{"name":"GIOTT","text":"So what do you say? Come and visit my home! I'll be waiting for you when you get there."},{"name":"GIOTT","text":"I may have forgotten to tell <span class=\"highlight\">Forename</span> how to get here. That's unfortunate. Come to think of it, I ain't sure <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> <span class=\"emphasis\">can</span> get here. The tunnel's only for dwarves, and..."},{"name":"GIOTT","text":"<span class=\"highlight\">Forename</span>!? Where'd you come from?"},{"name":"GIOTT","text":"So it was you folks that got the Ladder moving? Huh!"},{"name":"GIOTT","text":"I can't believe you managed that─and didn't even tell me! Just when you think you know a person..."},{"name":"GIOTT","text":"Yes, yes, that's a joke. Anyhow, the place I want to show you is just over there. Follow me!"},{"name":"GIOTT","text":"Nothing to worry about! This monstrosity came flying at my face─rudely, I might add─when I unsealed the old tunnels. But everything's under control."},{"name":"GIOTT","text":"As you can see, I gave it an old-fashioned dwarven decking."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A...dwarven decking?"},{"name":"A1","text":"Old tunnels?"},{"name":"GIOTT","text":"Sorry, I ain't at liberty to explain further. It's forbidden to reveal the secrets of the dwarven decking to outsiders. And anyway, I brought you here for something more important than that."},{"name":"GIOTT","text":"Yeah. They're the reason that I brought you here. Can't say I was expecting such a nasty welcome, but maybe I should've."},{"name":"GIOTT","text":"Let me explain. We don't use it no more, but before the Flood, dwarves lived in this place. Only the sick ones, mind."},{"name":"GIOTT","text":"In those days, there was this illness called “stoneblight.” Turned your skin to stone, bit by bit, and it was just a matter of time─a few months, or a few years─until you were petrified completely."},{"name":"GIOTT","text":"No one knew where it came from, but they did know that it was contagious. And so they...they locked them all up. Here, in the Blightwarrens. They needed to keep it from spreading, because there was no cure. Not back then..."},{"name":"DWARVENCHIEF","text":"Lamitt! Was it not enough to leave without permission? Or to return unbidden, bringing these strangers into our home? You knew full well that entering the Blightwarrens is forbidden! How many of our traditions must you trample before you are satisfied!?"},{"name":"DWARVENCHIEF","text":"If you so refuse to respect your heritage, you have no place here. As head of the council, I hereby banish you. You are no longer a dwarf. Begone, and never return!"},{"name":"DWARVENWARRIOR","text":"(-Jeering Dwarves-)Begone!"},{"name":"WARRIOROFDARKNESS","text":"Have you lost your wits!? Lamitt just <span class=\"emphasis\">cured your people</span>! Her sister, and all the others. She left your village to find a way to save them, and she did─she did what no one else would!"},{"name":"DWARVENCHIEF","text":"Your words have no weight here, outsider. This is a dwarven matter. Silence!"},{"name":"DWARVENWARRIOR","text":"(-Jeering Dwarves-)Silence!"},{"name":"WARRIOROFDARKNESS","text":"I will <span class=\"emphasis\">not</span> be silent! You have no idea what we─what <span class=\"emphasis\">Lamitt</span> has been through!"},{"name":"LAMITT","text":"...That's enough, Ardbert. Whatever my reasons, I did break our laws. And I did so knowing that this would be the result."},{"name":"LAMITT","text":"I will accept my punishment. I leave my dwarven pride behind today."},{"name":"WARRIOROFDARKNESS","text":"Lamitt─"},{"name":"DWARVENSISTER","text":"If Lamitt is leaving, so am I."},{"name":"DWARVENSISTER","text":"You probably didn't think much of us after you shoved us in there to die, but it was awfully hard to breathe. We all took our helms off."},{"name":"DWARVENSISTER","text":"If Lamitt's going to be banished for breaking our traditions, then I should be too!"},{"name":"DWARVENPATIENT","text":"As the young lady says─none of us is perfect. It ain't right that Lamitt should be the only one punished for it, especially seeing as she was saving us."},{"name":"DWARVENPATIENT","text":"Come on, exiles! We keep our faces plain for all to see, and our heads held high!"},{"name":"LAMITT","text":"Oh, everyone..."},{"name":"WARRIOROFDARKNESS","text":"Are you sure you're all right with this?"},{"name":"WARRIOROFDARKNESS","text":"We could go back. We could..."},{"name":"LAMITT","text":"What, pummel the elders with your axe? &lt;sigh&gt;"},{"name":"LAMITT","text":"I know you're not that fledgling adventurer who got knocked flat by hobs anymore. You could probably defeat even our strongest warriors. But forget it."},{"name":"LAMITT","text":"We have more important things to worry about─we still haven't found what caused the illness in the first place. If it really is the Shadowkeeper again... Well, you know what we have to do."},{"name":"LAMITT","text":"If this is what it takes to save our world, I will give up my home and more, Ardbert."},{"name":"LAMITT","text":"And anyway, it's not all bad. I don't think I really understood, before. How beautiful it is out here. How nice the wind feels."},{"name":"WARRIOROFDARKNESS","text":"It is nice, isn't it?"},{"name":"WARRIOROFDARKNESS","text":"And for what it's worth...I'm glad you're here. Helmet or no."},{"name":"LAMITT","text":"Ardbert...thank you."},{"name":"GIOTT","text":"Hey, hob<span class=\"alternative-container\"><span class=\"alternative\">daughter</span><span class=\"alternative\">son</span></span>! Uh...ugly! &lt;sigh&gt; Look, I'm running out of insults here. And I'm starting to feel bad. Just wake up already."},{"name":"GIOTT","text":"Finally!"},{"name":"GIOTT","text":"Well, that was harrowing. About as soon as you started doing your thing, that sin eater decided to rise from the dead..."},{"name":"GIOTT","text":"Though I suppose that's mostly my own fault for not dealing it an extra blow or two just in case. Anyhow, what did you see?"},{"name":"GIOTT","text":"I knew it! I knew that Lamitt was the one who cured stoneblight─it had to have been. She saved all of them. And they...they exiled her for it."},{"name":"GIOTT","text":"And the...the head of the Council of Elders..."},{"name":"GIOTT","text":"..."},{"name":"GIOTT","text":"Oh! Sorry, I...I suppose I wandered off. Got caught up in my own thoughts."},{"name":"GIOTT","text":"Actually, can you...give me a moment? Or maybe a while. I just... I'm not sure what to think, is all."},{"name":"GIOTT","text":"I don't want to keep you from your other work, so... See you later."}],"reward":{"gil":1312,"items":[{"id":27872}]},"reqs":{"jobs":[{"lvl":78,"id":157}],"quests":[68806]},"next":[68808]},"partials":[{"type":"npc","id":"1031158","obj":{"i":1031158,"n":"Giott","l":2951,"q":5}},{"type":"npc","id":"1030021","obj":{"i":1030021,"n":"Giott","l":2954,"q":2}},{"type":"item","id":"27872","obj":{"i":27872,"n":"Masala Chai","l":412,"c":24410,"t":46}},{"type":"quest","id":"68806","obj":{"i":68806,"n":"The Lost and the Found","g":180,"l":"The Crystarium","s":231,"f":1}},{"type":"quest","id":"68808","obj":{"i":68808,"n":"The Soul of Temperance","g":180,"l":"Kholusia","s":251,"f":1}}]}