{"quest":{"name":"Traditions and Travails","location":"The Crystarium","id":68803,"patch":5.0,"sort":201,"icon":100868,"unlocksFunction":1,"eventIcon":71341,"issuer":1029998,"target":1031158,"genre":180,"journal":["A hearty-looking dwarf stands before you, draining a flagon of ale remarkably swiftly given the helmet.","After a brief exchange on the subject of dwarven manners and your own abilities, Giott solicits your assistance in hunting a particular sin eater. In the name of safety, however, you must first demonstrate your skill in the field to prove that you are up to the task.","You arrive at the Forest of the Lost Shepherd where, for reasons as yet profoundly unclear, Giott immediately antagonizes a local wolverine. Having made no effort in the name of defense, the dwarf is prone on the hard dirt path in the blink of an eye. As the ferocious beast shows no sign that this initial assault has sated it, it would be prudent to render assistance sooner rather than later.","You make short work of the wolverine, though Giott is still unable to stand. It appears that you will be giving a demonstration of field medicine in addition to offensive magic.","You swiftly tend to Giott's not inconsiderable injuries. Upon regaining verticality─if not dignity─the dwarf remarks in surprise and delight at your ability. Though this entire experience has raised rather many questions as to your would-be comrade's soundness of judgment, you nevertheless agree to meet again at the Crystarium.","After making your partnership official─and consuming quite a bit more ale─Giott at last divulges information on your target. The sin eater's name is Sophrosyne, though in life it was none other than Lamitt─the healer you once met during your confrontation with the Warriors of Darkness, and, according to your new friend, a shameful excuse for a dwarf. This assessment gives you much to ponder, which may be for the best, as Giott seems unwilling to begin actually hunting for the creature before imbibing yet more alcohol.<br><br>※The next role quest will be available from Giott upon reaching level 72 in any healer class."],"objectives":["Speak with Giott in the Forest of the Lost Shepherd.","Slay the wolverine.","Aid Giott.","Speak with Giott at the Wandering Stairs."],"dialogue":[{"name":"GIOTT","text":"&lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; &lt;choke&gt; &lt;sputter&gt;"},{"name":"GIOTT","text":"Don't you know better'n to sneak up on a dwarf mid-flagon?"},{"name":"GIOTT","text":"Not even a proper greeting, neither. Look here."},{"name":"GIOTT","text":"Lali-ho! The name's Giott!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Lali-ho!"},{"name":"A1","text":"La...li...ho?"},{"name":"A1","text":"...What the who?"},{"name":"GIOTT","text":"See, now that's a greeting!"},{"name":"GIOTT","text":"You have to put your <span class=\"emphasis\">arm</span> into it. Like this! And a little enthusiasm don't hurt."},{"name":"GIOTT","text":"Like I said, it's a greeting. A “lali-ho” gets a “lali-ho,” you hear?"},{"name":"GIOTT","text":"And speaking of what's right and proper... I see you're not wearing your helm. For shame!"},{"name":"GIOTT","text":"You're from the same strange land as the Crystal Exarch? I suppose your people have their own customs, then. Alright─I'll say no more of it."},{"name":"GIOTT","text":"“Lali-hos” aside, just who are you, anyway? I daresay I'd remember someone like yourself if we'd ever met."},{"name":"GIOTT","text":"You're from the same strange land as the Crystal Exarch, you say? Well, well, well..."},{"name":"GIOTT","text":"He's an odd sort, the Exarch is. He <span class=\"emphasis\">knows</span> things, right? And he's got some sort of mystical power..."},{"name":"GIOTT","text":"Don't suppose you're the same, are you? Because I could use someone with power the likes of which this world has never known. I'm hunting sin eaters, you see. Well, one in particular."},{"name":"GIOTT","text":"A healer, and not half bad at the job, eh? I like your confidence!"},{"name":"GIOTT","text":"And I wish I could take your word for it, since you sound like just what I'm looking for─but I have to ask you to prove it."},{"name":"GIOTT","text":"There's no need for that. Listen here─the sin eater I hunt ain't your average abomination. You can't blame me for wanting to make sure that I'm not leading you to your grave. That would be bad for the both of us."},{"name":"GIOTT","text":"So you get yourself on over to the Forest of the Lost Shepherd, and we'll see what you've got."},{"name":"GIOTT","text":"Ho, <span class=\"highlight\">Forename</span>! Glad you found the place alright."},{"name":"GIOTT","text":"Now, for the prey..."},{"name":"GIOTT","text":"Hm, that'll do."},{"name":"GIOTT","text":"Now I just take a deep breath, and..."},{"name":"GIOTT","text":"Hey! Your mother was a hobgoblin and you ain't much to look at, neither! Come here and face me, you craven shite!"},{"name":"GIOTT","text":"&lt;groan&gt;"},{"name":"SYSTEM","text":"Though Giott lies prone, the creature appears indisposed to cease its rampage. It seems that it will have to be dealt with."},{"name":"GIOTT","text":"Ha! See, that wasn't so bad!"},{"name":"GIOTT","text":"I reckon that I broke three or so ribs and at least one femur there─but my bones feel just fine now. Better than before, actually."},{"name":"GIOTT","text":"And that beast gave you no trouble. Seems that you're just what I'm looking for after all."},{"name":"GIOTT","text":"We can talk about the rest back at the Crystarium over a drink or three. The folks at the Wandering Stairs know how to keep 'em coming─meet me there!"},{"name":"GIOTT","text":"&lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; &lt;burp&gt;"},{"name":"GIOTT","text":"There ain't nothing like a flagon of ale after a well-earned victory!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"...Did you hit your head?"},{"name":"A2","text":"You didn't do anything!"},{"name":"GIOTT","text":"Oh, yes. And hard! That beast gave me a trouncing. Really exceeded my expectations. As did you! Ha!"},{"name":"GIOTT","text":"I didn't say it was <span class=\"emphasis\">my</span> victory. Of course, I did find myself a partner of uncommon skill, so maybe it was! Ha!"},{"name":"GIOTT","text":"Whatever you want to call what we just did, doing it helped us understand each other sure enough. I've seen that you're a masterful fighter, and you learned that I'm fearless as the stone. And so a fellowship is forged!"},{"name":"GIOTT","text":"Now that I'm sure you won't get yourself killed, I can tell you about the sin eater I'm after. It's one of the so-called “Cardinal Virtues,” Sophrosyne─and it's a nasty piece of work."},{"name":"GIOTT","text":"Each of the Virtues looks like one of those fools who brought the Flood upon us, but <span class=\"emphasis\">this</span> one takes after the worst of the bunch─Lamitt, disgrace to all dwarvenkind."},{"name":"GIOTT","text":"Knowing that one of our own people was a Warrior of <span class=\"emphasis\">Light</span> is bad enough, but Sophrosyne being out there, looking all dwarf-like... Well, it don't help matters. Accursed thing."},{"name":"GIOTT","text":"The Council of Elders, they don't want to live with the shame of Lamitt's sins no more. So the head of the council, the elder<span class=\"emphasis\">most</span> elder─stay with me here─gave me this job. Hunt down Sophrosyne. Slay it. See that it don't keep sullying our good name."},{"name":"GIOTT","text":"I'm our strongest warrior, so if anyone's going to do it, it has to be me. That's fine─I'm more than up for a contest of might. The problem I'm having, though, is that Sophrosyne keeps <span class=\"emphasis\">healing</span> itself and it's...well, deeply annoying."},{"name":"GIOTT","text":"I suppose it's because Lamitt herself was some kind of master of the art, but Sophrosyne's healing is so powerful that no matter how hard I whack it, I can't leave a scratch."},{"name":"GIOTT","text":"To make matters worse, it also flies around, carefree as you please, resurrecting other sin eaters! We'll be up to our eyeballs in 'em forever if we can't do something about those curative powers. That's where you come in─right?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Um...yes?"},{"name":"A3","text":"Lamitt doesn't deserve your scorn, you know."},{"name":"GIOTT","text":"Great! With those skills of yours at hand, we'll find a way to put an end to this stain on my people's history once and for all."},{"name":"GIOTT","text":"Listen, I know you have your own ways, and that's just fine. But whether you care much for dwarven honor or not, you have to agree that a sin eater that can raise its fellows from the grave is a danger to us all."},{"name":"GIOTT","text":"As for Lamitt─you should know that being a dwarf is about respecting tradition, and she never did. Never."},{"name":"GIOTT","text":"You might not have heard, but the tales say that Lamitt roamed the land─<span class=\"emphasis\">without her helm.</span> She willingly showed her face to those who weren't kin! She knew full well that it would dishonor her and us all, and she did it anyway."},{"name":"GIOTT","text":"Then there's the part about bringing doom on all the world─not one of our taboos, really, but it's generally frowned upon. And now she's back. Face bare to the world! A sin eater! What could make a dwarf go so wrong?"},{"name":"GIOTT","text":"Ah, but we have ale to drink and sin eaters to hunt─in that order! You healed my body sure enough, but I'll need a few more flagons to restore my vigor. And by “a few,” I mean about a hundred. Come and find me later!"}],"reward":{"gil":1161},"reqs":{"jobs":[{"lvl":70,"id":157}],"quests":[68837]},"next":[68804]},"partials":[{"type":"npc","id":"1029998","obj":{"i":1029998,"n":"Giott","l":2951,"q":1}},{"type":"npc","id":"1031158","obj":{"i":1031158,"n":"Giott","l":2951,"q":5}},{"type":"quest","id":"68837","obj":{"i":68837,"n":"Warrior of Darkness","g":8,"l":"Lakeland","s":230}},{"type":"quest","id":"68804","obj":{"i":68804,"n":"Affronts and Allies","g":180,"l":"The Crystarium","s":211,"f":1}}]}