{"quest":{"name":"A Still Tide","location":"Kholusia","id":68819,"patch":5.0,"sort":50,"eventIcon":71201,"issuer":1029807,"target":1027313,"genre":8,"journal":["Whatever Szem Djenmai has to tell you, he plainly deems it worthy of your undivided attention."],"objectives":["Deliver the lake thyme to Eybor.","Wait for Alphinaud.","Search the field for vermin to exterminate.","Knock on the barred door.","Knock on the barred door again.","Knock on the barred door a third time.","Speak with Theva."],"dialogue":[{"name":"SZEMDJENMAI","text":"...If you head south along the coast, you will eventually come to a fisherman's shack."},{"name":"SZEMDJENMAI","text":"A friend of the Crystarium lives there─a man who goes by the name of “Eybor.”"},{"name":"SZEMDJENMAI","text":"Eybor keeps an eye on everything that happens in Kholusia, and will be able to point you in the right direction. Just hand him a sprig of thyme─that will let him know you can be trusted."},{"name":"SZEMDJENMAI","text":"Here─this should be enough. Find your friend. I will stay here with the amaro until you are ready to return."},{"name":"EYBOR","text":"What you after? Fish? Crab? Think I've got an eel in a barrel somewhere, if you've a taste for 'em..."},{"name":"EYBOR","text":"Ooh, I do love a bit of thyme. Chuck some in the pan, and it's like a bloody festival of flavor."},{"name":"EYBOR","text":"...Now what is it I can do for you? Can't say as there's been any major upsets to report these past few weeks."},{"name":"EYBOR","text":"Alphinaud, eh? Aye, I know the one. Our young champion of the downtrodden."},{"name":"EYBOR","text":"Eulmore's richer than all of Norvrandt put together, but it's a different story for them as live outside the city. Most spend every wakin' moment just tryin' to stay alive─which makes your friend's dedication to helpin' others stand out all the more."},{"name":"EYBOR","text":"Aye, I can hazard a guess as to where he is now, get a message to him. But you'll need somewhere quiet to meet, away from pryin' eyes..."},{"name":"EYBOR","text":"Make for Stilltide─that's the fishin' village just up the path there. You're lookin' for a run-down excuse for a tavern the locals call the Leaky Keel. Wait there, and I'll see that Alphinaud joins you."},{"name":"EYBOR","text":"Get yourself to the Leaky Keel in Stilltide. I'll let Alphinaud know someone's waitin' for him."},{"name":"THEVA","text":"This your first time in a tavern? It's customary to buy a drink if you mean to loiter. What'll you be having?"},{"name":"Q1","text":"What will you order?"},{"name":"A1","text":"Ale."},{"name":"A1","text":"Mead."},{"name":"A1","text":"Water."},{"name":"THEVA","text":"A fine choice. And what'll you be paying with?"},{"name":"THEVA","text":"Well now...those are exotic. Where did you come by coins like that?"},{"name":"THEVA","text":"I'm sorry, dear, I don't doubt they have value... But I don't have a touchstone to test their purity, and I'm not about to go begging for one from the neighbors─so we'll just have to come to some other arrangement."},{"name":"THEVA","text":"Ah, here's an idea... There's a common to the north where we grow our vegetables, but lately the pests have been eating more of them than we have. What do you say to a bit of extermination work?"},{"name":"THEVA","text":"I want you to squash any vermin you find, then visit the caretaker and give him an earful from me for sleeping on the job. He'll be in the old silo next to the fence─snoring, like as not."},{"name":"THEVA","text":"Do that for me, and you can laze about here as long as you like."},{"name":"THEVA","text":"Head over to Governor's Row and rid the field of any vermin you see. Then call in at the old silo, and let our wastrel of a caretaker know what I think of the “care” he's been taking."},{"name":"SYSTEM","text":"No response. Maybe you need to knock louder."},{"name":"SYSTEM","text":"No response. Perhaps the occupant is hard of hearing...?"},{"name":"SYSTEM","text":"You hear a faint squeaking from the room beyond. Time to burst in and save the day, brave adventurer!"},{"name":"SYSTEM","text":"...No one is home, and judging by the lack of furniture, they haven't been for some time. The gnawed scraps of vegetables on the floor suggest rats have taken up residence in their absence."},{"name":"THEVA","text":"Welcome back, dear. What did that good-for-nothing caretaker have to say for himself?"},{"name":"THEVA","text":"...Gone? Hmph. Must have left to join the rest of the hopefuls."},{"name":"THEVA","text":"...In Gatetown. Outside Eulmore? You don't have a clue what I'm talking about, do you. And there I was thinking you were another dreamer."},{"name":"THEVA","text":"Well, never mind all that. Take a seat wherever you like, dear, you've more than earned it. I'll even throw in another drink, on the house."}],"reward":{"gil":1080},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68818]},"next":[68820,68885,68886,68887]},"partials":[{"type":"npc","id":"1029807","obj":{"i":1029807,"n":"Szem Djenmai","l":2954,"q":2}},{"type":"npc","id":"1027313","obj":{"i":1027313,"n":"Theva","l":2954,"q":1}},{"type":"quest","id":"68818","obj":{"i":68818,"n":"In Search of Alphinaud","g":8,"l":"The Ocular","s":40}},{"type":"quest","id":"68820","obj":{"i":68820,"n":"Open Arms, Closed Gate","g":8,"l":"Kholusia","s":60}},{"type":"quest","id":"68885","obj":{"i":68885,"n":"Before the Tide Comes","g":114,"l":"Kholusia","s":1101}},{"type":"quest","id":"68886","obj":{"i":68886,"n":"Retaking Territory","g":114,"l":"Kholusia","s":1110}},{"type":"quest","id":"68887","obj":{"i":68887,"n":"A Clam to Die For","g":114,"l":"Kholusia","s":1120}}]}