{"quest":{"name":"Courage Born of Fear","location":"Kholusia","id":68814,"patch":5.0,"sort":351,"icon":100869,"unlocksFunction":1,"eventIcon":71341,"issuer":1030144,"target":1030964,"genre":181,"journal":["Lue-Reeq wishes to confront an uncomfortable truth.","Lue-Reeq is well aware that his martial prowess pales in comparison to yours, and that he is far more likely to hinder any effort to slay Andreia than to aid it. Now that the Virtue travels in the company of several eaters, a clever strategy is more important than ever, and to that end, the bounty hunter proposes the manufacture of a device that can generate a loud enough noise, as it was such a noise that rendered Renda-Rae powerless when she first faced Balam–Quitz. Before you can depart for the Crystalline Mean to seek an artisan's assistance, however, a servant of Lue-Reeq's lord father appears and demands that he renounce his chosen career and return to Eulmore at once, else he will be disowned. After a moment's hesitation, the young hunter marshals his courage and declares that the only family he acknowledges is Miss Olvara, his wet nurse. The die is cast, and you may now concentrate on the task at hand.","Loythe of the Crystalline Mean is amused by your request for a noisemaking device, but is more than willing to design and craft it─provided you and Lue-Reeq can procure the necessary materials. Said materials will require one to travel to the far corners of Norvrandt and back, and so you steel yourself for another long journey, only for Lue-Reeq to declare that he has imposed upon you too much. You are to wait in the Crystarium while he alone fetches the various materials.","When you are rejoined by Lue-Reeq, you are surprised not only to learn that he managed to procure every item requested, but worked closely with Loythe to learn how to craft his secret weapon by himself. The noisemaker arrows, as he calls them, should serve to incapacitate Andreia in the heat of battle. With these final preparations complete, you depart for Rak'tika once more.","Though you have known many a harrowing battle, the fight against Andreia and her party of eaters proves to be one of your greatest challenges yet. Fortunately, Lue-Reeq's noisemaker arrows serve to turn the tide, and after defeating each of her comrades in turn, the Virtue soon falls.","As the essence of Andreia begins to dissipate, you glimpse the last vestiges of Renda-Rae, the fallen Warrior of Light. She speaks of guilt and of love for her comrades, of the fear that gripped her heart and the courage that blossomed from it. Of a last, desperate attempt to save all she and her friends held dear, knowing what it would cost, knowing that it would surely fail...for it could be no other way. The shade's parting words leave Lue-Reeq confused, and so you explain to him how the Warriors of Light stood valiantly against the Flood of Light and sacrificed their lives to halt its advance. For his ignorance, the hunter is ashamed, though he hopes in helping lay Renda-Rae's soul to rest he has earned a modicum of forgiveness.","Olvara is proud and relieved to see you and Lue-Reeq return, and as one hunter to another she thanks you for saving her hero's soul. She promises to preserve the truth of her tale so that future generations will know the whole of her story─of Renda-Rae, the greatest hunter who ever lived, and a true friend. Having said your good-byes, all that remains is to return to the Crystarium to claim the bounty and celebrate your victory.","Over a final feast, Lue-Reeq presses you to reveal the whole story of how you know so much about the Warriors of Light, and so you tell him of how you faced them in the Source, as the Warriors of Darkness, and the terrible sacrifice they had to make to even have the chance to save the First. This revelation only serves to reinforce the conclusion Lue-Reeq has already reached: that he does not have what it takes to walk the same path as you, much as he has enjoyed your time together. But there is no shame in it, for he has also realized how important Miss Olvara is to him, and so he would instead return to Kholusia and repay her for the kindness she showed him in his youth by caring for her in her old age. Thus ends the glorious partnership that was Reeq and <span class=\"highlight\">Forename</span>─for now, at least, for who can say what the future holds?"],"objectives":["Speak with Loythe in the Crystarium.","Wait for Lue-Reeq to return.","Accompany Lue-Reeq to Rak'tika.","Speak with Lue-Reeq in Rak'tika.","Accompany Lue-Reeq to Kholusia.","Speak with Lue-Reeq in the Crystarium.","Defeat Andreia!"],"dialogue":[{"name":"OLVARA","text":"I do hope you continue to remain good friends from now on..."},{"name":"LUEREEQ","text":"<span class=\"highlight\">Forename</span>, my friend, my partner─I trust you are ready?"},{"name":"LUEREEQ","text":"Good, good. That is very good indeed, for before we depart to face Andreia for what I pray is the final time, I have a confession to make..."},{"name":"LUEREEQ","text":"I...I may have been somewhat misleading when I intimated the tremendousness of my martial prowess. In truth, it...rather pales in comparison to yours."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Uh huh."},{"name":"A1","text":"Do tell."},{"name":"LUEREEQ","text":"...I gather you were not unaware of this. Truly, you are as perceptive as you are mighty."},{"name":"LUEREEQ","text":"You must be terribly crestfallen, I am sure. It is my deepest regret that I allowed you to labor under the misapprehension that we were equals for so long."},{"name":"LUEREEQ","text":"In my defense, I must say that when I realized what an exceedingly powerful warrior you truly are, I was dumbstruck. I struggled to conceive of how even to broach the subject..."},{"name":"LUEREEQ","text":"Furthermore, I must admit that great majority─nay, all of our efforts to hone our skills in preparation for the battle to come have been entirely for my benefit, that the disparity between us might not be so readily apparent."},{"name":"LUEREEQ","text":"To think that my insecurity drove me to postpone this fateful day for so long..."},{"name":"LUEREEQ","text":"In my cowardice I allowed Andreia to assemble a party of followers. Where before we might have only to contend with the one foe, we must now confront five. And for all my preparation, I am still no more likely to be an asset to you than a hindrance."},{"name":"LUEREEQ","text":"But perhaps that need not be the case. In discussing this grim reality with Miss Olvara while you were away, we hit upon a potential stratagem."},{"name":"OLVARA","text":"Recall you Renda-Rae's greatest strength and weakness─her preternatural hearing? We can be reasonably certain that Andreia is possessed of it as well."},{"name":"OLVARA","text":"Therefore, if you were to fashion a device that could produce a loud noise at will, you could use it to secure an advantage in your battle."},{"name":"LUEREEQ","text":"What I lack in strength of arms I may make up for with guile. While it will not guarantee us victory, it will surely bring us one step closer..."},{"name":"IMPASSIVESERVANT","text":"A thousand pardons, Master Reeq, but I am come to deliver a message from your lord father."},{"name":"LUEREEQ","text":"Daddy? What does he want with me now?"},{"name":"IMPASSIVESERVANT","text":"It has come to your lord father's attention that you have been engaged in the hunting of sin eaters, in gross violation of Eulmore's most sacred values. He commands you to cease all such activities at once and return to the city forthwith."},{"name":"IMPASSIVESERVANT","text":"It has come to your lord father's attention that you have acquitted yourself rather poorly as a bounty hunter and have brought terrible shame upon your family name. He commands you to cease all such activities at once and return to the city forthwith."},{"name":"IMPASSIVESERVANT","text":"Should you fail to do so, you will be stripped of your citizenship and family name. No further financial assistance will be provided."},{"name":"LUEREEQ","text":"Oh...Oh dear..."},{"name":"LUEREEQ","text":"You may tell my father and my mother the following: that I am Lue-Reeq, proud bounty hunter, slayer of sin eaters. That I have no intention of renouncing this cause, and that they are free to do as they deem fit."},{"name":"LUEREEQ","text":"Tell them...that if they have no son, then I have no parents─that I have no family save Miss Olvara, who has shown me more love than they ever have!"},{"name":"IMPASSIVESERVANT","text":"Very good, Master Reeq. I shall deliver your reply to them at once."},{"name":"LUEREEQ","text":"Right. Now that that's settled, we can get to work crafting that giant noisemaker of ours. Let us consult with the craftsmen of the Crystalline Mean at once."},{"name":"OLVARA","text":"I daresay you lit a fire in him, <span class=\"highlight\">Forename</span>. I never thought I'd see the day when he'd muster the courage to say anything like that to his parents..."},{"name":"OLVARA","text":"Thank you for being a friend to Reeq. For the longest time he struggled to find his way, but ever since he met you, he has carried himself with a new sense of purpose. A renewed understanding of who he is and who he wants to be."},{"name":"LUEREEQ","text":"For all my time in the Crystarium, I cannot recall ever visiting the Crystalline Mean. Nevertheless, I am sure there is someone here who can assist us."},{"name":"LOYTHE","text":"Hmm? What's all this, then? You got something what needs making?"},{"name":"LUEREEQ","text":"Indeed I do, good sir. I wish to commission the production of a device that can generate a tremendously loud sound. It must be small and light enough to be carried by a single individual as well."},{"name":"LOYTHE","text":"Ain't that one of the stranger requests I've heard... Well, if it's just noise you want, then I'd wager we could make do with a special blend of firesand."},{"name":"LOYTHE","text":"Aye, I think I've got just the recipe for your needs. I'll need some choice ingredients, mind─and you'll need to go and fetch them for me."},{"name":"LUEREEQ","text":"F-Fetch... Ahem. What precisely is it that you require?"},{"name":"LOYTHE","text":"Well, there's this one particular beastie native to Kholusia what's got a singular diet and leaves these massive dung piles─the fresher the better, if it please. A few varieties of grasses native to Rak'tika... Oh, and some iron ore from Amh Araeng. I can give you a list if you like."},{"name":"LUEREEQ","text":"To wit, I will need to travel to the far corners of Norvrandt and back...? Oh dear, this is rather more involved than I..."},{"name":"LUEREEQ","text":"No, no─no more excuses! I will do whatever must needs be done to see this through to the end!"},{"name":"LUEREEQ","text":"My friend, I will not impose these tasks upon you. I insist that you remain here while I go and fetch the required materials."},{"name":"LOYTHE","text":"Huh, he gonna be all right getting all that stuff by himself? I mean, if it were you, I'd not think twice about it..."},{"name":"LUEREEQ","text":"It...it was...a series of surprisingly harrowing experiences...but in the end I managed to obtain the materials necessary for the construction of my secret weapon."},{"name":"LUEREEQ","text":"That gentleman was rather accommodating. Despite being somewhat put out that I had not any gil to pay him for his labor, he was nevertheless willing to teach me how to craft the arrows myself. He said he found my industriousness...endearing."},{"name":"LUEREEQ","text":"I must confess, despite being utterly exhausted by all this busywork, it has been somewhat refreshing."},{"name":"LUEREEQ","text":"And now that my noisemaker arrows are ready, I cannot wait to put them to the proof! If all goes to plan, the explosions should be loud enough to incapacitate Andreia for a time."},{"name":"LUEREEQ","text":"Let us put an end to her tale, my friend, and in so doing write the opening of ours─that of Reeq and <span class=\"highlight\">Forename</span>, bounty hunters extraordinaire! Come─Rak'tika and glory await!"},{"name":"LUEREEQ","text":"If I may make one small request before we begin: please, for the love of the gods, please try not to succumb to any visions of people's pasts! This really could not be a worse time..."},{"name":"LUEREEQ","text":"Well? Are you still with me in the here and now?"},{"name":"LUEREEQ","text":"Excellent! Then we can attend to the task at hand without worry. Let us lay to rest our fellow hunters and grant Renda-Rae the peace a hero deserves!"},{"name":"LUEREEQ","text":"I'll distract Andreia with a noisemaker arrow.<br>Seize the opening to strike!"},{"name":"LUEREEQ","text":"Here goes nothing..."},{"name":"ANDREIA","text":"Ugh... &lt;groan&gt;"},{"name":"LUEREEQ","text":"It worked! It really worked! I can't believe it..."},{"name":"LUEREEQ","text":"Huh!? Are they...defending her? Dammit!<br>We'll have to deal with them first!"},{"name":"LUEREEQ","text":"Godsdamn you, Lanbyrd! I'm sorry you're dead but you don't<br>have to be such a bloody arse about it!"},{"name":"LUEREEQ","text":"That's it! Only two more to go!"},{"name":"LUEREEQ","text":"I'll draw off Andreia! You handle the knight!"},{"name":"LUEREEQ","text":"Heads up! Arrows incoming!"},{"name":"LUEREEQ","text":"Now, <span class=\"highlight\">Forename</span>! Now's our chance!"},{"name":"LUEREEQ","text":"Gah! That bloody knight is in the way. Dispatch him first!"},{"name":"LUEREEQ","text":"It's just us and Andreia now! It's time for Reeq and <span class=\"highlight\">Forename</span> to write a new legend for the ages!"},{"name":"LUEREEQ","text":"<span class=\"highlight\">Forename</span>, to me!"},{"name":"LUEREEQ","text":"Rest in peace, Renda-Rae..."},{"name":"LUEREEQ","text":"I...I really thought I..."},{"name":"LUEREEQ","text":"We...we won... Even seeing it and saying it, it hardly feels real..."},{"name":"LUEREEQ","text":"Huh? What's that you've got there?"},{"name":"LUEREEQ","text":"Wicked white, you're..."},{"name":"LUEREEQ","text":"You're Renda-Rae. The real Renda-Rae..."},{"name":"RENDARAE","text":"(-Renda-Rae's Shade-)I should've never betrayed your trust. Never again, I swore. Never again."},{"name":"RENDARAE","text":"(-Renda-Rae's Shade-)Balam–Quitz, the Shadowkeeper, the Flood─come what may, we would face it together. No matter how hard it got, or how terrified I was..."},{"name":"RENDARAE","text":"(-Renda-Rae's Shade-)That's what it means to let someone into your heart, knowing full well that nothing lasts forever. To welcome the fear, and the pain. The sorrow. When I lost my parents. When we laid the keeper low. You felt it too, didn't you?"},{"name":"RENDARAE","text":"(-Renda-Rae's Shade-)To place our faith in a desperate, hopeless attempt to save everyone...and to see it amount to naught in the end."},{"name":"RENDARAE","text":"(-Renda-Rae's Shade-)What else could we do but offer up that tiny remainder in a final, futile effort? Even knowing, deep down, it was worth but a few moments more..."},{"name":"LUEREEQ","text":"What is this..."},{"name":"RENDARAE","text":"(-Renda-Rae's Shade-)You gave me fear...and that fear gave me strength..."},{"name":"LUEREEQ","text":"Wait! There's so much I want to ask!"},{"name":"LUEREEQ","text":"I don't understand. What was she talking about?"},{"name":"LUEREEQ","text":"It's not right. It's not fair. Heroes sacrificing themselves for nothing. Becoming villains. Being forgotten..."},{"name":"LUEREEQ","text":"...Thank you, <span class=\"highlight\">Forename</span>. I could have never gotten this far without your help."},{"name":"LUEREEQ","text":"I had no idea who Renda-Rae or any of the other Warriors of Light truly were. 'Twas all ancient history to me. Why would I care who some eaters once were?"},{"name":"LUEREEQ","text":"I was no better than my parents, judging them out of hand. Dismissing their sacrifice, not bothering to look deeper. It made it all the easier to pursue Andreia for my own amusement."},{"name":"LUEREEQ","text":"I pray I've made up for it in part by helping to lay Renda-Rae's soul to rest..."},{"name":"LUEREEQ","text":"Miss Olvara is probably worried sick about us both. I...we should return to Kholusia and let her know we're all right."},{"name":"LUEREEQ","text":"I can't wait to tell Miss Olvara everything! And I should definitely use some of the bounty to treat her..."},{"name":"OLVARA","text":"My little Reeq, <span class=\"highlight\">Forename</span>! Congratulations on a job well done!"},{"name":"OLVARA","text":"And from one hunter to another, thank you for helping Renda-Rae to achieve a measure of peace. She was a hero to me too, and it broke my heart to know what had become of her..."},{"name":"OLVARA","text":"To have your legacy tarnished so, to have the world call you villain, even still. But at least I can take comfort in knowing she can finally enjoy a long rest."},{"name":"LUEREEQ","text":"Whatever others may say, we will preserve the truth in story and song. Renda-Rae, the bravest hunter there ever was! And, more importantly, a true friend to those she held dear."},{"name":"LUEREEQ","text":"I can only hope to measure up to her example someday! For now, however, I say we return to the Crystarium and raise a glass in celebration!"},{"name":"OLVARA","text":"...So she brought down Balam–Quitz not alone, but with the aid of her comrades? Hmm...it may not be the story I was taught, but somehow...somehow it rings truer to my ear..."},{"name":"LUEREEQ","text":"Andreia's bounty has been paid to us in full, my friend! So come─let us eat, drink, and be merry!"},{"name":"LUEREEQ","text":"I've been meaning to ask, <span class=\"highlight\">Forename</span>...but I have the impression you are rather more acquainted with these Warriors of Light than you've been letting on. What exactly do you know about them?"},{"name":"LUEREEQ","text":"That...that is so preposterous a tale that I have no choice but to assume it is true. Offering up their lives to first cross the rift, then to halt the Flood... Wicked white..."},{"name":"LUEREEQ","text":"It must've taken her so much courage to see it through in those final moments."},{"name":"LUEREEQ","text":"A courage born not of a desire for glory or dedication to an ideal, but of fear and love for those with whom she had forged unshakable bonds. Her comrades."},{"name":"LUEREEQ","text":"I won't pretend that we have anything even approaching such a powerful connection, but I would like to think that if you were in mortal peril that I would fly to your side without hesitation..."},{"name":"LUEREEQ","text":"Having said that, if I were tested as Renda-Rae were─if I were challenged to offer up my life for others, without even knowing if it would amount to aught...I doubt I could rise to the occasion."},{"name":"LUEREEQ","text":"I am a child and a fool who knows little of the world. I have been coddled and spoiled, and have only just tasted the bitter fruits of life that you and countless others sup on daily."},{"name":"LUEREEQ","text":"You are made of sterner stuff, <span class=\"highlight\">Forename</span>. Far sterner than me...and that is why I know I can never walk your path."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Do you wish you could?"},{"name":"A2","text":"No shame in that."},{"name":"LUEREEQ","text":"How could I not? I cannot recall a time I have felt happier and more alive than when I have traveled with you."},{"name":"LUEREEQ","text":"Oh, but there is! I cannot recall a time I have felt happier and more alive than when I have traveled with you."},{"name":"LUEREEQ","text":"But you have countless other journeys ahead of you, don't you? For you are destined for greater challenges─whereas I am suited to rather more pedestrian affairs. Know your limits, as Miss Olvara used to say."},{"name":"LUEREEQ","text":"Meeting her again after all these years─seeing how much older and more frail she'd become made me realize how little time together we have left. She shouldn't have to live out her days living alone and in squalor."},{"name":"LUEREEQ","text":"I have decided it will not be so. I shall return to Kholusia and attend to her needs, for I would do my utmost to repay the love and kindness that made me the man I am today."},{"name":"LUEREEQ","text":"Therefore, though it pains me to say it, I fear this celebration must also mark the end─or at the very least a tentative suspension─of the glorious partnership that was Reeq and <span class=\"highlight\">Forename</span>, bounty hunters extraordinaire."},{"name":"LUEREEQ","text":"Should you ever find yourself in Kholusia, however, do come and pay us a visit!"}],"reward":{"gil":3744,"items":[{"id":25187},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":158}],"quests":[68813]},"next":[68747,68749,68750,68755,68756,68759,68762]},"partials":[{"type":"npc","id":"1030144","obj":{"i":1030144,"n":"Lue-Reeq","l":2954,"q":2}},{"type":"npc","id":"1030964","obj":{"i":1030964,"n":"Lue-Reeq","l":2951,"q":5}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68813","obj":{"i":68813,"n":"Fellowship Restored","g":181,"l":"Kholusia","s":341,"f":1}},{"type":"quest","id":"68747","obj":{"i":68747,"n":"A Monk's Legacy","g":148,"l":"Ul'dah","s":800}},{"type":"quest","id":"68749","obj":{"i":68749,"n":"Gone but Not Forgiven","g":150,"l":"Coerthas Central Highlands","s":800}},{"type":"quest","id":"68750","obj":{"i":68750,"n":"A Harmony from the Heavens","g":151,"l":"South Shroud","s":800}},{"type":"quest","id":"68755","obj":{"i":68755,"n":"Oboro's Big Idea","g":152,"l":"Eastern La Noscea","s":800}},{"type":"quest","id":"68756","obj":{"i":68756,"n":"Machinists for the Morrow","g":158,"l":"Ishgard","s":800}},{"type":"quest","id":"68759","obj":{"i":68759,"n":"The Legend of Musosai","g":160,"l":"Kugane","s":800}},{"type":"quest","id":"68762","obj":{"i":68762,"n":"Rising to the Occasion","g":163,"l":"Limsa Lominsa","s":800}}]}