{"quest":{"name":"The Syrcus Trench","location":"The Rising Stones","id":68815,"patch":5.0,"sort":10,"icon":100891,"eventIcon":71201,"issuer":1026990,"target":1028924,"genre":8,"journal":["Tataru is itching to share what appears to be good news.","Tataru excitedly shares the latest development in the hunt for the beacon. Apparently, your colleagues have discovered a pathway leading to the bottom of the ravine in which the Crystal Tower stands, rendering its base accessible. Despite narrowing down the search area, however, it seems there is still a lot of ground to cover. According to Tataru, a boat waits on the northern edge of Silvertear Lake, ready to ferry helping hands over to the newly established survey site.","You cross over to the eastern shore, and enter the expansive hollow at the foot of the Crystal Tower. Tataru stands nearby, eager to make a start.","Though you have only the vaguest idea what it is that you are looking for, you join the search...","Having stumbled rather fortuitously on what turns out to be the beacon, you are subject to yet another visitation by the mysterious voice. This time, however, it rings triumphantly clear. Moments later, you find yourself transported to a distant and unfamiliar land. Could this truly be another world? Lost and confused, you happen upon a traveling peddler who sets you on the road to a city he calls the “Crystarium.”<br><br>※In the event that you leave the area and wish to return, speak with the Ironworks technologist at the foot of the Crystal Tower.","As you approach the Crystarium, you come to what appears to be a fortified checkpoint. The guard stationed there duly interrogates you, and seems unimpressed by your responses. Even the brief intervention of a monstrous assailant cannot dissuade her from turning you away, but just as she moves to do so, she is interrupted by the arrival of a hooded man who smoothly declares you to be his guest. With affected ease, he bids you follow him into the city...quietly promising to answer your questions when you have some privacy.","You follow the Crystal Exarch towards the main gates of the Crystarium, before which he pauses, and turns with an expectant air.","The Exarch welcomes you to the Crystarium, and by extension, to the world of the First. You can only guess what fateful adventures await you upon this Light-beleaguered star..."],"objectives":["Speak with the Saint Coinach ferryman in north Silvertear.","Speak with Tataru.","Head to the Crystarium.","Speak with the Crystal Exarch."],"dialogue":[{"name":"TATARU","text":"Good news, <span class=\"highlight\">Forename</span>! We've had a stroke of luck in our search for that beacon!"},{"name":"TATARU","text":"Apparently, our colleagues have stumbled across a hidden path leading down into the hollows around the base of the Crystal Tower."},{"name":"TATARU","text":"...A path I doubt we'd ever have found had the Ironworks and the Sons not added their numbers to the party."},{"name":"TATARU","text":"Thanks to them, we have eager eyes aplenty down there, checking under rocks and peering into every nook and cranny. Still, it sounds like there's a lot of ground to cover..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Then we'd better go and give them a hand!"},{"name":"A2","text":"...Sounds like tedious work. But not as tedious as waiting around, I suppose."},{"name":"TATARU","text":"My thoughts exactly!"},{"name":"TATARU","text":"The sooner we find this beacon, the sooner you can travel to wherever it is this mysterious voice is coming from."},{"name":"TATARU","text":"Exactly! So I was thinking we should go and lend a hand. The sooner we find this beacon, the sooner you can travel to wherever it is this mysterious voice is coming from."},{"name":"TATARU","text":"And the sooner we can work out how to help our friends."},{"name":"TATARU","text":"We have to find a way to wake them up─and <span class=\"emphasis\">before</span> the Empire comes calling again! Meaning we have no time to lose!"},{"name":"TATARU","text":"There's a boat in north Silvertear waiting to ferry people to the site, so let's be on our way!"},{"name":"COINACHBOATMAN","text":"Heading to the survey site, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>? It's on the eastern shore of the lake, and the swiftest way to get there is by boat."},{"name":"Q2","text":"Take the boat to the survey site?"},{"name":"HOARYBOULDER","text":"<span class=\"highlight\">Forename</span>! The search continues, but I have no doubt we shall find this beacon of yours!"},{"name":"COULTENET","text":"The air here weighs heavily upon me. 'Tis little wonder, I suppose, when standing in the shadow of such an imposing structure."},{"name":"AENOR","text":"The Archons need our help! Next to that, even matters of the heart don't seem to matter!"},{"name":"CLEMENCE","text":"I've detected no slavering beasts in the vicinity...my sister excepted."},{"name":"GARLONDMAN03279","text":"The Ironworks is out in force! Master Garlond's orders!"},{"name":"COINACHINVESTIGATOR03279","text":"That towering edifice is the outer wall of the Crystal Tower's foundation─the Labyrinth of the Ancients to be precise."},{"name":"Q3","text":"Continue with the main scenario quest?"},{"name":"GARLONDMAN03279","text":"I've been keeping that device you uncovered safe and sound. Did you need to use it again...?"},{"name":"Q4","text":"Touch the beacon and travel to the First?"},{"name":"COINACHINVESTIGATOR03279","text":"Seeing as we've set up a site here anyway, we decided to conduct a thorough investigation of the tower's base."},{"name":"MYSTERYVOICE","text":"And here we are. Welcome, my friend, to the Crystarium."}],"reward":{"gil":1299,"items":[{"id":27903},{"id":26824}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68721]},"next":[68816]},"partials":[{"type":"npc","id":"1026990","obj":{"i":1026990,"n":"Tataru","l":481,"q":2}},{"type":"npc","id":"1028924","obj":{"i":1028924,"n":"Crystal Exarch","l":2951,"q":2}},{"type":"item","id":"27903","obj":{"i":27903,"n":"Shadowbringers Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"26824","obj":{"i":26824,"n":"White Oak Weapon Coffer (IL 385)","l":1,"c":26557,"t":61}},{"type":"quest","id":"68721","obj":{"i":68721,"n":"A Requiem for Heroes","g":7,"l":"The Lochs","s":40}},{"type":"quest","id":"68816","obj":{"i":68816,"n":"City of the First","g":8,"l":"The Crystarium","s":20}}]}