{"quest":{"name":"Freedom from Privilege","location":"The Crystarium","id":68811,"patch":5.0,"sort":321,"icon":100869,"unlocksFunction":1,"eventIcon":71341,"issuer":1030964,"target":1030964,"genre":181,"journal":["Lue-Reeq is, as usual, quite pleased to see you again.","Another of Lue-Reeq's hirelings has provided him with new information concerning a sighting of Andreia on Kholusia. It would seem that the Virtue has transformed yet another deadly mark into a sin eater─this time a great bear. And so it falls to Reeq and <span class=\"highlight\">Forename</span> to slay yet another newborn fiend.","As before, the plan is simple: seek out and slay the eater and hope that in so doing you happen to encounter its creator. As before, Lue-Reeq declares that the most effective course of action would be to search separately.","It would not be an engaging hunt if you found your quarry that quickly, and so it is premature to declare this particular one a failure. Probably...","You continue your search for a time, but it gradually becomes apparent that it is a fool's endeavor. The bear is clearly nowhere to be seen, and it is past time you and Lue-Reeq reconsidered your plan.","You find Lue-Reeq in the company of several other hunters who apparently managed to track down and kill the bear before you could. Their leader, Lanbyrd, is a former associate of Lue-Reeq's it would seem, until the pair had a falling out, leading Lanbyrd to strike out on his own. Being familiar with his former partner's methods, he surmised that by bribing his hirelings to share their findings with him first, he could beat the Mystel hunter to the punch, and sure enough, he managed to do just that. And so you prepare to quit Kholusia, but not before paying a brief visit to Eulmore at Lue-Reeq's behest.","As a courtesy─or perhaps simply to let them know that he's getting on well enough─Lue-Reeq attempts to introduce you to his lord father, a wealthy Eulmoran who cares for naught but his indulgences like so many others. Indeed, his attempt fails spectacularly, as the aristocrat hardly spares a glance for his son or for you, and states that he should speak with his manservant if he is in dire need of more coin. In a fit of emotion, Lue-Reeq storms off, and so you accompany him back to the Crystarium.","Lue-Reeq confesses to you what most others have already surmised: that he was born into privilege as a child of a Eulmoran free citizen. Raised without want or worry, he has since grown tired of the lackadaisical city life, and so he came to the Crystarium that he might become a bounty hunter─a quest that henceforth may be that much more difficult given that he refused to take more of his father's coin. However, you reassure him that this need not be cause to end your partnership. At least, not immediately.<br><br>※The next role quest will be available from Lue-Reeq upon reaching level 76 in any physical DPS class."],"objectives":["Rendezvous with Lue-Reeq in Kholusia.","Search for the bearlike sin eater.","Speak with Lue-Reeq.","Accompany Lue-Reeq to Eulmore.","Speak with Lue-Reeq in the Crystarium."],"dialogue":[{"name":"LUEREEQ","text":"There <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is! <span class=\"highlight\">Forename</span>, come to rejoin <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> bosom companion in the great hunt!"},{"name":"LUEREEQ","text":"It is well that you have, for I have obtained new information concerning a sighting of Andreia on Kholusia. The fiend has transformed yet another deadly mark─a great bear in this instance─into an even deadlier eater."},{"name":"LUEREEQ","text":"And so it falls to Reeq and <span class=\"highlight\">Forename</span> to slay the newborn eater and continue their pursuit of Norvrandt's most notorious Virtue. To Kholusia and to glory!"},{"name":"LUEREEQ","text":"Let us brook no further delay and commence our search. Separately, as before in Amh Araeng. If you catch the eater first, I grant you leave to kill it without me. I trust you will not be disappointed if the reverse were to occur? Surely not, surely not!"},{"name":"LUEREEQ","text":"I myself will be most put out if I happen to lose to you a second time, and so, on that note: may the best hunter win!"},{"name":"SYSTEM","text":"You survey your surroundings, but find no trace of the bear you seek..."},{"name":"SYSTEM","text":"Despite looking far and wide, you fail to find any trace of the bear you seek. Perhaps Lue-Reeq was indeed the better hunter this day..."},{"name":"LANBYRD","text":"Wicked white, don't tell me you're the little lordling's newest “bosom companion”?"},{"name":"DRAHNCONJURER","text":"After the bear, were you? Sorry, sinner, but you've come too late. We claimed the bounty not but a few bells ago."},{"name":"GALDJENTGLADIATOR","text":"To the victor go the spoils and to the loser, bugger all."},{"name":"LUEREEQ","text":"Hate to say it, <span class=\"highlight\">Forename</span>, but it seems we're late to the party. Lanbyrd and his mates slew the bear before we could."},{"name":"LANBYRD","text":"(-Lanbyrd-)So it's true, then─you've cast your lot in with the boy. You poor, daft sod..."},{"name":"LUEREEQ","text":"But I don't understand! The eater was a newborn. How could you possibly have learned of it and gotten here before we did?"},{"name":"LANBYRD","text":"(-Lanbyrd-)Well, see, that's the problem with relying on hired help. They're loyal to your coin, not you─and you're not the only one willing to open his purse."},{"name":"LANBYRD","text":"(-Lanbyrd-)But more importantly, Reeq─what's this I hear about you hunting Andreia? With help I mean, rather than all by your lonesome."},{"name":"LANBYRD","text":"(-Lanbyrd-)I've a distinct memory of you storming off in a huff saying you didn't need me or anyone else to finish the job. Tell me I'm wrong."},{"name":"LANBYRD","text":"(-Lanbyrd-)Do as you like. Help or no, you've no chance of beating me to the prize, 'cause unlike you, I'm not all talk─and neither are me mates."},{"name":"LANBYRD","text":"(-Lanbyrd-)Speaking of mates...how much did it cost you to buy <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> “friendship”? Do tell."},{"name":"LUEREEQ","text":"Piss off, Lanbyrd! Why are you still here? You got your mark, didn't you!?"},{"name":"LANBYRD","text":"(-Lanbyrd-)You should choose your “friends” more carefully, sinner. When it all goes wrong, don't say I didn't warn you..."},{"name":"LUEREEQ","text":"You have questions, I am sure. As you may have surmised, Lanbyrd was once a comrade of mine. I took him into my service that we might hone our skills battling sin eaters in preparation for facing Andreia."},{"name":"LUEREEQ","text":"However, I soon came to see that he was not all that capable of a hunter, and so I dissolved our working relationship. Unfortunately, he did not take it in stride, and instead resolved to recruit new companions that he might beat me at my own game..."},{"name":"LUEREEQ","text":"It would seem that his fortunes have improved greatly of late. So much so that I fear we can no longer afford to dedicate time to tracking lesser eaters and must devote our undivided attention to the pursuit of Andreia..."},{"name":"LUEREEQ","text":"As such, we should be getting back to the Crystarium...but before we depart, I have one other matter to attend to in Eulmore. If I might trouble you to accompany me? Ah, but of course you will. Let us be off!"},{"name":"LUEREEQFATHER","text":"...Speak to my manservant and leave me to my entertainment."},{"name":"IMPASSIVESERVANT","text":"Oh! Is that Master Reeq? Then you are his, dare I say...friend?"},{"name":"LUEREEQ","text":"<span class=\"highlight\">Forename</span>, allow me to introduce you to my father and mother..."},{"name":"LUEREEQ","text":"Father, this is my traveling companion...and dear friend, <span class=\"highlight\">Forename</span>."},{"name":"LUEREEQ","text":"...<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> and I have resolved to hunt a particularly deadly sin eater."},{"name":"LUEREEQ","text":"Indeed, I cannot overstate how terribly dangerous this eater is─that to pursue it is to court death itself. However, when we at last triumph over the fiend, all of Norvrandt shall sing our praises!"},{"name":"LUEREEQ","text":"...Won't that be wonderful, Father...?"},{"name":"LUEREEQFATHER","text":"...So long as you do not sully our good name, you are free to hunt whatever quarry you desire. I can do without all the petty details."},{"name":"LUEREEQFATHER","text":"Now then, how much do you require this time? Out with it. Oh, never mind. Just give the boy my coinpurse, would you? I am sure it will suffice for his trivial pursuits─"},{"name":"LUEREEQFATHER","text":"That is why you are here, is it not? Another handout? Don't play coy. You've never been any good at it."},{"name":"LUEREEQ","text":"You know, I honestly don't know why I came here! Keep your coin, Father! We're leaving, <span class=\"highlight\">Forename</span>! Right now!"},{"name":"IMPASSIVESERVANT","text":"Oh dear... Master Reeq seemed awfully upset..."},{"name":"LUEREEQ","text":"Forgive me, <span class=\"highlight\">Forename</span>, but I would forgo the wine on this occasion. Father's lackluster reception has put me in rather dour spirits."},{"name":"LUEREEQ","text":"As you may have gathered from our exchange, I am a free citizen of Eulmore. Owing to my parents' considerable wealth, I have enjoyed a relatively privileged upbringing. Privileged...and unbearably <span class=\"emphasis\">boring</span>, which is why I quit the city and resolved to become a bounty hunter."},{"name":"LUEREEQ","text":"I am no fool, though. I am well aware of my fortunate circumstances, which is why I elected to conceal them from the people of the Crystarium. People are wont to jump to uncharitable conclusions."},{"name":"LUEREEQ","text":"I feel as though you and I have established a rapport, though, and so I thought it best to bring you into my confidence. I pray you refrain from telling others."},{"name":"LUEREEQ","text":"Now then─since Lanbyrd has decided to turn this into a race, we have no choice but to oblige him and slay Andreia before he does. This calls for a veritable army of hired hands."},{"name":"LUEREEQ","text":"Alas, in a fit of frustration, I refused Father's coin. Without additional resources, we have no choice but to conduct the search by ourselves..."},{"name":"LUEREEQ","text":"Moreover, I am rather embarrassed to admit that I can pay you only a token sum at this time... B-But I trust that will not deter you from joining me anon!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I was never in this for the gil."},{"name":"A1","text":"I don't know, I'll have to think on it..."},{"name":"LUEREEQ","text":"Really...? I mean, uh, of course you weren't! Perish the thought! Hah hah hah!"},{"name":"LUEREEQ","text":"Please, do not toy with me so! If nothing else, think of the fame and fabulous reward we'll receive when we finally slay Andreia? Surely that is incentive enough for you to stay the proverbial course!?"}],"reward":{"gil":1941},"reqs":{"jobs":[{"lvl":74,"id":158}],"quests":[68810]},"next":[68812]},"partials":[{"type":"npc","id":"1030964","obj":{"i":1030964,"n":"Lue-Reeq","l":2951,"q":5}},{"type":"quest","id":"68810","obj":{"i":68810,"n":"Vengeance in Defeat","g":181,"l":"The Crystarium","s":311,"f":1}},{"type":"quest","id":"68812","obj":{"i":68812,"n":"The Hunter's Legacy","g":181,"l":"The Crystarium","s":331,"f":1}}]}