{"quest":{"name":"Fellowship Restored","location":"Kholusia","id":68813,"patch":5.0,"sort":341,"icon":100869,"unlocksFunction":1,"eventIcon":71341,"issuer":1030145,"target":1030145,"genre":181,"journal":["Olvara cannot help but worry for Lue-Reeq's well-being.","In the days since your somewhat acrimonious parting, Lue-Reeq has come to visit Miss Olvara some few times. Though he seems to be in good health, he has yet to forge a new partnership with another Virtue-hunter, and so the elderly woman hopes that you can put aside whatever negative feelings you may harbor against the youth, and go to the Crystarium to see how he is faring.","Lue-Reeq is not at his usual table, nor does he appear to be anywhere in the general vicinity. Surely someone nearby will have noted his passing, though...","In questioning the patrons of the Wandering Stairs you learn that Lue-Reeq's former partner, Lanbyrd, took his entourage to Rak'tika in order to slay Andreia. They were overmatched, however, and nearly slaughtered to a man, leaving a sole survivor of the battle to recount the tale to others at the Crystarium. Others then left to take up the hunt in their fallen comrades' stead, Lue-Reeq among them. Most likely he is still in the Greatwood─assuming he is still alive...","Blessedly, you find the young lordling alive and well, and through the power of the Echo observe how he confronted Andreia, only to his horror discover that Lanbyrd and his fallen comrades had risen once more as eaters in service to the Virtue. Though Lue-Reeq is at first unsure how to reconcile this behavior with his knowledge of Renda-Rae's past, you explain that in truth she did not defeat Balam–Quitz alone, but rather with the aid of her fellow Warriors of Light. Finally recognizing his folly, the young lordling at last begs your forgiveness for his harsh words, and asks that you return with him to Gatetown to speak with Miss Olvara before you prepare for your final confrontation with Andreia.","A rather apologetic Lue-Reeq thanks both you and his former wet nurse for your constant support in spite of his myriad failings. Though he is far from certain how he might overcome his limitations and lay the spirit of Renda-Rae to rest, even with your assistance, he is willing to do whatever it takes to see his hunt through to the end.<br><br>※The next role quest will be available from Lue-Reeq upon reaching level 80 in any physical DPS class."],"objectives":["Search for Lue-Reeq in the Crystarium.","Question the people at the Wandering Stairs.","Search for Lue-Reeq in Rak'tika.","Speak with Olvara in Kholusia."],"dialogue":[{"name":"OLVARA","text":"I am sure a talented <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> like yourself is needed all over the realm, and so I thank you for sparing a moment to hear me out."},{"name":"OLVARA","text":"Since you two parted ways, Reeq has come to visit me several times. Though he is blessedly in good health, I worry for his spirits. I think you may have been the only friend he has had for some time..."},{"name":"OLVARA","text":"I considered journeying to the Crystarium myself to look in on him, but I find travel rather difficult these days. If you would go in my stead, it would put my heart at ease..."},{"name":"OLVARA","text":"All I ask is that you go to the Crystarium and see Reeq. I won't ask you to take pity on or forgive him. I only want to make sure that he is well..."},{"name":"DRAHNCONJURER","text":"Hmm? Haven't we met somewhere before?"},{"name":"SYSTEM","text":"Lue-Reeq's customary seat is empty, and there is nothing to suggest he has occupied it recently. Perhaps someone will have noted his passing..."},{"name":"DARLFORT","text":"Lue-Reeq? The Mystel lordling? If he ain't sat at his usual table, then I've no idea where else to look."},{"name":"MEITATCH","text":"Looking for “Master Reeq,” are we? Heh, I daresay you're the only one."},{"name":"MEITATCH","text":"Word is mummy and daddy cut him off, so there's no point in pretending to like the little shite anymore. Last I saw him he was moping about like someone had shot his amaro. I'm sure he'll turn up eventually."},{"name":"DRAHNCONJURER","text":"Kholusia, right? You're Lue-Reeq's partner. I was with Lanbyrd, remember?"},{"name":"DRAHNCONJURER","text":"Was, I oughta stress, 'cause after we left you we headed straight to Rak'tika. We'd heard a rumor Andreia was there, and Lanbyrd wanted to strike while the iron was hot..."},{"name":"DRAHNCONJURER","text":"By the time we realized we were overmatched, it was too late. I saw Lanbyrd fall, and when the eater set her sights on the others, I fled."},{"name":"DRAHNCONJURER","text":"Call me a coward if you like, but my cowardice saved my life! Wicked white, I still remember looking back as I ran, and seeing Lanbyrd rise to his feet..."},{"name":"DRAHNCONJURER","text":"I told everyone what had happened, to warn them off the hunt. Some listened, but a few bloody fools took up their weapons and joined the hunt. Glory hungry imbeciles. And not a one of them has returned."},{"name":"DRAHNCONJURER","text":"Didn't expect Lue-Reeq to be one of them neither. I remember thinking it odd─especially when I saw him leave for Rak'tika alone. You're meeting him there, I presume? Good luck, friend...but have no doubt that you're going to your doom."},{"name":"DARLFORT","text":"If he never comes back, good riddance, says I. Still, I'm sure he'll come crawling back here eventually, tail between his legs like the whelp he is."},{"name":"MEITATCH","text":"I told you, if the little lordling isn't at his table, then I've no idea where he is. Ask someone else."},{"name":"DRAHNCONJURER","text":"If I were you, I'd leave Lue-Reeq to hunt the Virtue on his own. No shame in recognizing when you've got no chance. Only a fool would fight this fight."},{"name":"LUEREEQ","text":"...<span class=\"highlight\">Forename</span>? Why are you here? Don't tell me you came for me?"},{"name":"LUEREEQ","text":"It's terrible! It's horrible! Andreia, she's...she's..."},{"name":"LUEREEQ","text":"Renda-Rae! If aught of you remains, then hearken to my words!"},{"name":"LUEREEQ","text":"I have come to lay your soul to rest─alone, as you yourself faced Balam–Quitz a century ago on this very ground!"},{"name":"LUEREEQ","text":"Lanbyrd? Oh gods, no..."},{"name":"LUEREEQ","text":"Don't tell me─you beheld a vision of my past just now, didn't you?"},{"name":"LUEREEQ","text":"Aye, I thought as much. Wasn't but a moment ago that I confronted them. Awfully useful, that trick of yours, though I can't understand why you kept using it every time we ran into Andreia..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I can't control when it happens."},{"name":"A1","text":"Believe me, I was just as surprised as you were..."},{"name":"LUEREEQ","text":"Huh? So it wasn't something you did deliberately? Good to know..."},{"name":"LUEREEQ","text":"Anyway, unintentional or not, at least I won't have to convince you of what I saw. She's turned Lanbyrd and those other hunters into sin eaters like herself."},{"name":"LUEREEQ","text":"A Hume axeman, a Galdjent swordsman, a dwarven healer, an elven mage. Looked awfully familiar, didn't it?"},{"name":"LUEREEQ","text":"She's rebuilding her fellowship─she's remaking the Warriors of Light!"},{"name":"LUEREEQ","text":"But for the life of me, I can't understand why. I mean, I understand why she came here in the first place. She's reliving the hunt for Balam–Quitz."},{"name":"LUEREEQ","text":"But Renda-Rae slew the beast by herself! The stories were clear about that!"},{"name":"LUEREEQ","text":"What? They were there too!? Then the stories were <span class=\"emphasis\">wrong</span>?"},{"name":"LUEREEQ","text":"Gods strike me down, I've been such a fool! Why did I ever think I could do this alone..."},{"name":"LUEREEQ","text":"I...I hope you can find it in your heart to forgive me for all the things I said, <span class=\"highlight\">Forename</span>..."},{"name":"LUEREEQ","text":"I've regretted my behavior ever since the day we parted ways. It was stupid and nonsensical and utterly pointless."},{"name":"LUEREEQ","text":"I'm not sure I could even tell you why I did what I did..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"It's fine. Water under the bridge."},{"name":"A2","text":"..."},{"name":"LUEREEQ","text":"Thank you, my friend. I hope it is all right if I call you that..."},{"name":"LUEREEQ","text":"You're still upset, as you have every right to be. But I will make it up to you, I will! I don't know how or when, but I will! I swear!"},{"name":"LUEREEQ","text":"Right, then. Andreia should be around here somewhere. Still on the hunt for Balam–Quitz, I expect...not that she'll ever find it."},{"name":"LUEREEQ","text":"No doubt Lanbyrd and the others are with her, too. He and I may have had our differences, but I'd not wish that fate on my worst enemy."},{"name":"LUEREEQ","text":"He deserves to be laid to rest. They all do. Renda-Rae most of all. She was...she is my hero, and if I have to kill her to save her soul, then so be it!"},{"name":"LUEREEQ","text":"But this is too much for even the best hunter to handle alone─and I am far from the best. The only way to see this through is together. You and me, my friend. What say you?"},{"name":"LUEREEQ","text":"Hah! I ask for a word and you give me a nod. Fair enough. Before we resume the hunt in earnest, though, let us return to Gatetown and let Miss Olvara know all is well. After all, you wouldn't have come unless she sent you..."},{"name":"LUEREEQ","text":"I owe her so much. Then and now..."},{"name":"OLVARA","text":"<span class=\"highlight\">Forename</span>, what a pleasure to see you again! And in the company of little Reeq, no less. Am I right in assuming you've patched things up?"},{"name":"LUEREEQ","text":"I should like to think so, yes...and it is all thanks to you. Had you not implored <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to give me another chance, I might well still be sitting alone in the swamps, dwelling on my myriad failings."},{"name":"LUEREEQ","text":"And you, my friend─I know not why you sought her out on your own, but I am glad that you did. Miss Olvara is perhaps the only person who truly cares for my well-being, but she has no one to look after her─"},{"name":"OLVARA","text":"Don't be silly, Reeq. I have you, don't I! And before you start blabbering about how you wish you could properly reward <span class=\"highlight\">Forename</span>─as I can tell you're about to─know that I've prepared a hearty meal just for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"LUEREEQ","text":"Oh, that's...very thoughtful of you. Nevertheless, I shall see you both duly compensated once we have claimed the bounty for Andreia."},{"name":"LUEREEQ","text":"And claim it we shall, for united, Reeq and <span class=\"highlight\">Forename</span> are unstoppable...is what I would like to say, but I know my own limitations better than anyone. 'Twould be prudent to make proper preparations at this juncture."},{"name":"LUEREEQ","text":"You too should see to it that you are ready for the struggle ahead. It will be a mighty one indeed, but one well worth the effort, my friend!"}],"reward":{"gil":1804,"items":[{"id":27873}]},"reqs":{"jobs":[{"lvl":78,"id":158}],"quests":[68812]},"next":[68814]},"partials":[{"type":"npc","id":"1030145","obj":{"i":1030145,"n":"Olvara","l":2954,"q":1}},{"type":"item","id":"27873","obj":{"i":27873,"n":"Risotto al Nero","l":415,"c":24028,"t":46}},{"type":"quest","id":"68812","obj":{"i":68812,"n":"The Hunter's Legacy","g":181,"l":"The Crystarium","s":331,"f":1}},{"type":"quest","id":"68814","obj":{"i":68814,"n":"Courage Born of Fear","g":181,"l":"Kholusia","s":351,"f":1}}]}