{"quest":{"name":"City of the First","location":"The Crystarium","id":68816,"patch":5.0,"sort":20,"eventIcon":71201,"issuer":1028924,"target":1028925,"genre":8,"journal":["The Crystal Exarch has a request for you."],"objectives":["Attune to the aetheryte in the Crystarium.","Speak with Katliss in the Crystalline Mean.","Speak with Moren in the Cabinet of Curiosity.","Speak with Bragi at Musica Universalis.","Find the Crystal Exarch near the Exedra and present your findings."],"dialogue":[{"name":"GARLONDMAN03279","text":"I've been keeping that device you uncovered safe and sound. Did you need to use it again...?"},{"name":"Q0","text":"Touch the beacon and travel to the First?"},{"name":"MYSTERYVOICE","text":"Now, a full and frank discussion in the privacy of my study would seem to be in order..."},{"name":"MYSTERYVOICE","text":"...But I think our conversation would be more meaningful were you first to gain a firmer grasp of the situation here."},{"name":"MYSTERYVOICE","text":"To that end, I would like you to visit a few of the Crystarium's civic leaders, and glean something of this world and its predicament."},{"name":"MYSTERYVOICE","text":"As you can see, this path will take you directly to the aetheryte─a convenience with which I am sure you are only too familiar."},{"name":"MYSTERYVOICE","text":"Being the rightful object of my summoning spell, you should in theory be able to reach all the way back along your aetheric trail and find a connection in the Source, believe it or not."},{"name":"MYSTERYVOICE","text":"I <span class=\"emphasis\">strongly</span> suggest you complete this attunement before venturing any further."},{"name":"MYSTERYVOICE","text":"After you have done so, walk up the steps next to the aetheryte and head out to the left to arrive in the Crystalline Mean. This is where you'll find our collective of crafters and gatherers, as well as their spokeswoman, Katliss─one of the people I should like you to meet."},{"name":"MYSTERYVOICE","text":"Another is Moren. To reach him and his “Cabinet of Curiosity,” you'll want to avoid the aforementioned steps, take the exit on the left, and simply continue straight along and down until you come to the large doors at the end of the path."},{"name":"MYSTERYVOICE","text":"The third and final person I should like you to meet is Bragi, our man in charge of trade and distribution. He is to be found in the markets, which you can access from the opposite side of the aetheryte plaza."},{"name":"MYSTERYVOICE","text":"In seeking out each of my colleagues, you will visit the major districts of the city, and hopefully gain a feel for the place. I trust my directions were simple enough?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Crystal clear."},{"name":"A1","text":"To the right and down the where now...?"},{"name":"MYSTERYVOICE","text":"Hah, very good. I concede, the layout of the Crystarium owes more to historic necessity than planning, but I'm sure you'll learn its twists and turns before long."},{"name":"MYSTERYVOICE","text":"My apologies. I forget how confusing the Crystarium can be for newcomers. Not to worry! I'm sure you'll soon become accustomed to its twists and turns."},{"name":"MYSTERYVOICE","text":"...In all honesty, the true challenge may be in finding the right way to approach its citizens."},{"name":"MYSTERYVOICE","text":"As you discovered during your encounter with the captain, the people of this world are unaware of the existence of other stars, and will struggle to accept the truth of your origin."},{"name":"MYSTERYVOICE","text":"That being the case, when they ask whence you hail─as they inevitably will─I suggest you claim to share a homeland with the Crystal Exarch. There is an unspoken rule here about peering too deeply into that particular mystery."},{"name":"MYSTERYVOICE","text":"When you've finished making the rounds, pray meet me in the large courtyard at the center of town. Until then."},{"name":"MYSTERYVOICE","text":"The attunement worked as hoped, I trust? Any trouble finding my three colleagues?"},{"name":"MYSTERYVOICE","text":"Remember: starting from the aetheryte, go up the steps and to the north to find the Crystalline Mean, where Katliss awaits, or forgo the steps and take the north passage to reach the Cabinet of Curiosity, and Moren."},{"name":"MYSTERYVOICE","text":"Exiting to the south of the aetheryte plaza, meanwhile, will bring you to the markets, overseen by Bragi. The order in which you visit them is entirely up to you, of course."},{"name":"SYSTEM","text":"By focusing your senses, you detect the flow of vastly distant currents of aether. Your connection to these energies is faint but stable, and should allow teleportation to aetherytes in the Source."},{"name":"KATLISS","text":"Rare to see a place so well stocked with goods, isn't it? But not here."},{"name":"KATLISS","text":"I'm going to guess you're new to our fair city?"},{"name":"KATLISS","text":"Well, for what it's worth, you've chosen a fine sanctuary. The Exarch can throw up a barrier if the sin eaters come knocking, so it's a damn sight safer in here than it is out there."},{"name":"KATLISS","text":"Safer and more civilized, too─thanks to us in the Mean. We work together to procure materials and resources, and craft the goods which make city life possible. This is the place to visit if you need a coat mended or a kettle forged!"},{"name":"KATLISS","text":"Just don't go thinking it'll all be handed to you on a plate like those Eulmoran layabouts. Here in the Crystarium, we work for a living."},{"name":"KATLISS","text":"Though I see you're no stranger to honest labor. You don't have that whiff of indolence about you like some folk I've met. Still, I can't quite pin down your profession... Where is it you're from?"},{"name":"KATLISS","text":"...One of the <span class=\"emphasis\">Exarch's</span> countrymen, you say? ...I see."},{"name":"KATLISS","text":"Well then, I'll work twice as hard to make you feel welcome! Our city wouldn't even exist if it weren't for him, and any friend of his is a friend of ours!"},{"name":"KATLISS","text":"It's really quite incredible when you think about it. They say his grand magicks summoned the Crystal Tower into existence─pulled the entire thing out of thin air."},{"name":"KATLISS","text":"It wasn't long before droves of refugees began congregating around its base, desperate for shelter after losing their homes to the Flood..."},{"name":"KATLISS","text":"And that's how the Crystarium began. At the Exarch's invitation, buildings started going up, and with the help of some curious relics brought forth from the tower, the place gradually expanded into the thriving metropolis you see today."},{"name":"KATLISS","text":"The city's stood here for decades now, yet the eldest among us swear the Exarch looks exactly the same as he did back then..."},{"name":"KATLISS","text":"He is indeed a man of many mysteries. But for all his secrecy, he has never yet let us down."},{"name":"KATLISS","text":"So if he─and you─wish to remain silent about your shared homeland, then the folk here will respect your wish for privacy."},{"name":"KATLISS","text":"...I am, however, more than a little curious to see any crafting talent you might be hiding! If you've aught to contribute on that front, be sure to come back and visit once you've had a chance to settle in."},{"name":"KATLISS","text":"Just ask for Katliss, and I'll find you a niche here in the Crystalline Mean. You can help us keep the cogs of the city greased and turning!"},{"name":"SYSTEM","text":"Your exchange with Katliss has taught you about “Life in the Crystarium.”"},{"name":"KATLISS","text":"Feel free to look around the workshops, but try not to distract the artisans. If they fall behind in their quotas, then everyone suffers for it."},{"name":"MOREN","text":"Er, e-excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! Are you recently come to the city, perchance? I'm quite familiar with our civic roles, you see, and...well... Ahem!"},{"name":"MOREN","text":"Wh-What I mean to ask is, <span class=\"emphasis\">have you brought any books with you</span>!? A rumpled scroll, even? A scrap of scribbled-on parchment...?"},{"name":"MOREN","text":"...My apologies. Literature is something of an obsession of mine. As well as a profession."},{"name":"MOREN","text":"Librarian Moren, at your service. And this humble collection is known as the Cabinet of Curiosity."},{"name":"MOREN","text":"As your powers of perception have likely informed you, my colleagues and I are responsible for curating all manner of tomes, documents, and other vehicles for the written word."},{"name":"MOREN","text":"As horrific as the loss of life and land wrought by the Flood unquestionably was, the damage to recorded knowledge was no less catastrophic. We few do all we can to preserve what wisdom survived."},{"name":"MOREN","text":"But tell me, what brings you to the Cabinet today? Looking for any title in particular? Mayhap a spot of academic research!?"},{"name":"MOREN","text":"Oho! So you've an interest in modern history? Splendid! A thorough review of recent events can often yield novel perspectives, I quite agree!"},{"name":"MOREN","text":"If you would prefer something visual to accompany the account, then I think I have an illustrated history book for children somewhere... Just a moment, and I'll fetch it for you."},{"name":"MOREN","text":"And here we are. Would you like to pull up a chair? Make yourself more comfortable? ...Ahem, on with the lesson, then."},{"name":"MOREN","text":"A hundred years ago─or near enough not to matter─villains known as the Warriors of Light slew the Shadowkeeper, the steward of Darkness."},{"name":"MOREN","text":"In the wake of this tainted deed, Light began to pour into the world as if from unseen cracks. It pooled and swelled without cease, until the day an enormous, blinding wave rose up and swept across our star."},{"name":"MOREN","text":"We called this calamity the “Flood of Light.”<br>Everything it touched was leeched of life and vigor, leaving naught behind but a luminous wasteland."},{"name":"MOREN","text":"Yet just when it seemed that all would be lost, a savior appeared before us..."},{"name":"MOREN","text":"The Oracle of Light. She stood 'twixt us and approaching doom, and by her power did she stay the Flood. Thus was Norvrandt, and Norvrandt alone, spared the fate of erasure."},{"name":"MOREN","text":"Tragedy would, however, arrive in another form. From the blasted emptiness descended horrors of strange and terrible aspect to bedevil the few folk who survived."},{"name":"MOREN","text":"These “sin eaters” were Light incarnate, and their fulgent presence stole the night from Norvrandt's sky."},{"name":"MOREN","text":"Even now, they circle the remaining bastions of civilization, ever on the hunt for us, ever hungering for our flesh..."},{"name":"MOREN","text":"...And thus did the world become what it is.<br>Should you ever wish to hear the tale again, I would be glad to retell it for you."},{"name":"MOREN","text":"O-Or if you would rather I speak of other matters, that too would be my pleasure! I should be glad of the company!"},{"name":"SYSTEM","text":"Your exchange with Moren has taught you about “The Flood of Light.”"},{"name":"BRAGI","text":"New to the city, friend? The spinning head and wide eyes give you away."},{"name":"BRAGI","text":"Welcome. My name is Bragi, and I'm the master of these markets. They gave the district another, official title, but I'm not in the habit of using it. Too florid by half..."},{"name":"BRAGI","text":"In any case, our merchants stock a range of equipment for <span class=\"alternative-container\"><span class=\"alternative\">Humes such as yourself</span><span class=\"alternative\">elves such as yourself</span><span class=\"alternative\">Mystel such as yourself</span><span class=\"alternative\">Galdjent such as yourself</span><span class=\"alternative\">Drahn such as yourself</span><span class=\"alternative\">Ronso like you and me</span><span class=\"alternative\">Viis such as yourself</span></span>, so finding something in your size shouldn't be a problem."},{"name":"BRAGI","text":"In any case, our merchants stock a wide range of equipment, so we should have something in your size. Forgive my asking, but you <span class=\"emphasis\">are</span> a dwarf, yes? We don't get many of your lot coming down from the mountain these days."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm sorry, did you say, “<span class=\"alternative-container\"><span class=\"alternative\">Humes</span><span class=\"alternative\">elves</span><span class=\"alternative\">dwarf</span><span class=\"alternative\">Mystel</span><span class=\"alternative\">Galdjent</span><span class=\"alternative\">Drahn</span><span class=\"alternative\">Ronso</span><span class=\"alternative\">Viis</span></span>”...?"},{"name":"A2","text":"Um, I'm actually <span class=\"alternative-container\"><span class=\"alternative\">a Hyur</span><span class=\"alternative\">an Elezen</span><span class=\"alternative\">a Lalafell</span><span class=\"alternative\">a Miqo'te</span><span class=\"alternative\">a Roegadyn</span><span class=\"alternative\">an Au Ra</span><span class=\"alternative\">a Hrothgar</span><span class=\"alternative\">a Viera</span></span>..."},{"name":"BRAGI","text":"Aye? Something wrong?"},{"name":"BRAGI","text":"Hm? Must be a dialect I'm not familiar with."},{"name":"BRAGI","text":"Let's see if we can straighten this out. See those two in front of us? The shorter one is a Hume, like you."},{"name":"BRAGI","text":"And the taller one is an elf, like you."},{"name":"BRAGI","text":"<span class=\"alternative-container\"><span class=\"alternative\">That sturdy individual over there is a Galdjent</span><span class=\"alternative\">That fellow over there is a Galdjent, like you</span></span>..."},{"name":"BRAGI","text":"...whilst the one with the horns is a Drahn, like you."},{"name":"BRAGI","text":"And then you have the large, scaly chaps with long tails and a knack for raising livestock. Those would be the Zun."},{"name":"BRAGI","text":"...Which is apparently not the name you know them by. Now I'm curious to know which far-flung region you hail from..."},{"name":"BRAGI","text":"...Which is apparently not what you call them. Do the dwarves have different names for all the peoples of the world? Or did you pick up the common tongue in some other far-flung region...?"},{"name":"BRAGI","text":"Ah, the same as the Exarch, eh? Well, that explains it."},{"name":"BRAGI","text":"You don't get much further-flung than that. We've had a few of your lot pass through in recent years, and despite their obvious learning, they floundered over the simplest things."},{"name":"BRAGI","text":"But not to worry! Should you find yourself confused by the local language or customs, I'll be here to answer your questions."},{"name":"SYSTEM","text":"Your exchange with Bragi has taught you about “The Peoples of the First.”"},{"name":"BRAGI","text":"I didn't point them out earlier, but I'm sure you'll spot <span class=\"alternative-container\"><span class=\"alternative\">a</span><span class=\"alternative\">a fellow</span></span> Mystel, or another Ronso like <span class=\"alternative-container\"><span class=\"alternative\">me</span><span class=\"alternative\">us</span></span> sooner rather than later. Even Viis like <span class=\"alternative-container\"><span class=\"alternative\">Captain Lyna</span><span class=\"alternative\">yourself</span></span> aren't that unusual in this city."},{"name":"BRAGI","text":"Aye, the Crystarium's long been a sanctuary for all manner of refugees─except maybe the dwarves. <span class=\"alternative-container\"><span class=\"alternative\">Those</span><span class=\"alternative\">Your</span></span> lot prefer to keep themselves to themselves, in my experience."},{"name":"MYSTERYVOICE","text":"Well, how did you fare? Did my colleagues help you form a clearer picture of this world and its people?"},{"name":"MYSTERYVOICE","text":"Yes, it seems you were treated to a most thorough introduction. I understand it was something of a chore, but 'twas necessary that you grasp these things before we proceed."},{"name":"MYSTERYVOICE","text":"As for the Crystal Tower's origin, you may have noted that details were sparse. The structure is, in fact, the selfsame one you know from the Source, transported to the First in its entirety."},{"name":"MYSTERYVOICE","text":"It was my first attempt at breaching the boundaries between worlds─something of a trial run for your eventual crossing. And although I do not know which era I tore it from, I <span class=\"emphasis\">do</span> know that its arrival served to set the wheels of fate in motion."}],"reward":{"gil":825,"items":[{"id":26826}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68815]},"next":[68817]},"partials":[{"type":"npc","id":"1028924","obj":{"i":1028924,"n":"Crystal Exarch","l":2951,"q":2}},{"type":"npc","id":"1028925","obj":{"i":1028925,"n":"Crystal Exarch","l":2951,"q":2}},{"type":"item","id":"26826","obj":{"i":26826,"n":"White Oak Chest Gear Coffer (IL 385)","l":1,"c":26559,"t":61}},{"type":"quest","id":"68815","obj":{"i":68815,"n":"The Syrcus Trench","g":8,"l":"The Rising Stones","s":10}},{"type":"quest","id":"68817","obj":{"i":68817,"n":"Travelers of Norvrandt","g":8,"l":"The Crystarium","s":30}}]}