{"quest":{"name":"Vengeance in Defeat","location":"The Crystarium","id":68810,"patch":5.0,"sort":311,"icon":100869,"unlocksFunction":1,"eventIcon":71341,"issuer":1030964,"target":1030964,"genre":181,"journal":["Lue-Reeq seems rather surprised to see you standing before him.","The search for the Cardinal Virtue, Andreia, has begun, and Lue-Reeq's hirelings have already caught wind of news that may lead you to your prize more quickly than anticipated. Apparently, the fallen hunter was spotted in Amh Araeng, in the vicinity of Samiel's Backbone, and is said to be responsible for transforming a vicious spider into a rather more troublesome sin eater. Perhaps by pursuing this newborn you may ascertain the whereabouts of its creator...","Upon arriving in Amh Araeng, Lue-Reeq declares that it would be most effective if you were to split up and search separately for the spider-turned-eater. With luck, this will not take terribly long.","A cursory search of your surroundings fails to turn up evidence of the spider's passing. However, there are still other parts of Amh Araeng where you may continue your hunt.","Sure enough, you eventually succeed in tracking down the spider and laying it low. Alas, there is still no sigh of Andreia. For now, all you can do is return to Samiel's Backbone and rendezvous with Lue-Reeq.","Before you can speak with your partner in crime, you catch sight of the Virtue, and find yourself suddenly walking in her memories. Long, long ago, she had come to Amh Araeng with two others in their search for a notorious mark known as Balam–Quitz. However, as they carried out their attack, the young Mystel was caught off guard by the beast's powerful roar, rendering her unable to come to the aid of her comrades, who were slain before her very eyes, for which she vowed to slay the fiend no matter what.<br><br>Although your sudden episode elicits Lue-Reeq's concern, you explain the nature of your gift and tell him of the memory you saw. Though the hunter is not entirely sure, he cannot shake the feeling that he has heard a similar tale before...but such discussions must wait until you have returned to the safety of the Crystarium.","Lue-Reeq toasts your victory over the newborn sin eater and bids you eat and drink your fill in celebration. Though his tastes seem rather extravagant, he assures you that he has ample coin to pay for it, and rewards you for your continued service with a pittance.<br><br>※The next role quest will be available from Lue-Reeq upon reaching level 74 in any physical DPS class."],"objectives":["Rendezvous with Lue-Reeq in Amh Araeng.","Search for the spiderlike sin eater.","Rendezvous with Lue-Reeq at Samiel's Backbone.","Speak with Lue-Reeq in the Crystarium."],"dialogue":[{"name":"LUEREEQ","text":"Wait...it's you! It's really you! You actually came─"},{"name":"LUEREEQ","text":"I mean, uh... Never mind..."},{"name":"LUEREEQ","text":"Ahem! You're here to hunt Andreia with me, yes? Of course you are! Why else would you be here? And wouldn't you know it, one of my hirelings should be returning with new information any moment now..."},{"name":"HIREDWOMAN03273","text":"Greetings, milord. I am pleased to report that Andreia was recently sighted in Amh Araeng─in the vicinity of Samiel's Backbone, it would seem."},{"name":"HIREDWOMAN03273","text":"Apparently, there was a right vicious spider what was giving folks trouble, and now that it's been turned, it's about a dozen times worse. They'd be grateful for any assistance."},{"name":"LUEREEQ","text":"I see, I see! Well done, my friend. Your payment, as promised."},{"name":"LUEREEQ","text":"Why bother going out and about pestering the smallfolk for news when you can employ others to do it for you? The better to devote our precious time to rather more important matters, I say!"},{"name":"LUEREEQ","text":"And owing to my winning strategy, we may now depart for Amh Araeng and the delightfully named Samiel's Backbone─for in pursuing the spider, we may yet find its maker!"},{"name":"LUEREEQ","text":"This is certainly the place. I gather those bones once belonged to dear Samiel...but I see no troublesome arachnid."},{"name":"LUEREEQ","text":"It being a rather large desert, I had considered hiring a few trackers to hasten our search, but I have yet to spy a place where such individuals might congregate. Pity..."},{"name":"LUEREEQ","text":"Bah! Nothing for it but to roll up our proverbial sleeves and do the dirty work ourselves! We shall split up and search the sands for this sin eater spider. Whoever finds it first may have the honor of slaying it themselves!"},{"name":"LUEREEQ","text":"And should we <span class=\"emphasis\">not</span> find it, well...after we both have searched for...a suitable length of time, I say we meet back here. Let the hunt begin!"},{"name":"SYSTEM","text":"You survey the surrounding sands, but find no trace of the spider you seek..."},{"name":"RENDARAE","text":"There she is. The scourge of Norvrandt, the devourer of souls─Balam–Quitz!"},{"name":"RENDARAE","text":"We bring this mark down, they'll be singing ballads about us till the end of time─never mind the king's bounty! Hells, we could buy ourselves a couple of castles apiece..."},{"name":"RENDARAE","text":"Flanking maneuver, as discussed. Wait for my signal, then we'll strike as one!"},{"name":"BARDOFELF","text":"Dammit! She's onto us!"},{"name":"BARDOFHYUM","text":"Don't panic, we planned for this! We'll act as decoys while Renda-Rae brings her down. Go, go!"},{"name":"RENDARAE","text":"Wait, not yet! There's no need to rush this!"},{"name":"RENDARAE","text":"Sod it. Always so headstrong..."},{"name":"RENDARAE","text":"Bugger me, my head... I can't..."},{"name":"RENDARAE","text":"No... No! Come back here! Finish it, you bloody bastard! Finish me!"},{"name":"RENDARAE","text":"I'm so sorry. It's all my fault..."},{"name":"RENDARAE","text":"I'll not let it end like this. I promise. I'll kill that godsdamned beast if it's the last thing I do..."},{"name":"LUEREEQ","text":"Hey, hey! What was that just now? I've had headaches before, but the way you were thrashing about wasn't like anything I've ever felt..."},{"name":"LUEREEQ","text":"By the gods! And I thought we were lucky just to catch a glimpse of Andreia─but you're also telling me you were granted a vision of her past with this power of yours?"},{"name":"LUEREEQ","text":"Though...hmm. Two warriors killed while hunting a great horned beast─a beast their surviving companion vows to slay in revenge. I have heard this tale before, I know it..."},{"name":"LUEREEQ","text":"Bah, it is a common enough sort of tale, I suppose. And regardless, she is gone. Come─let us return to the Crystarium and celebrate your accomplishment!"},{"name":"LUEREEQ","text":"The table is set! And so I bid you raise a glass with me, that together we might toast your spectacular accomplishment!"},{"name":"LUEREEQ","text":"&lt;grunt&gt; &lt;crunch&gt; &lt;crunch&gt;<br>&lt;snort&gt; &lt;slurp&gt; &lt;grunt&gt;<br>There's really nothing quite like a hearty meal after a job well done. Drink up, my friend, drink up! &lt;belch&gt;"},{"name":"LUEREEQ","text":"Had your fill? I've another few bottles ready and waiting to be opened. No? Oh, very well, if you insist..."},{"name":"LUEREEQ","text":"...It occurs to me, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, that I have yet to ask you your name. So quickly did we forge our friendship that I hardly noticed until now!"},{"name":"LUEREEQ","text":"<span class=\"highlight\">Forename Surname</span>... Reeq and <span class=\"highlight\">Forename</span>... Yes, I rather like the sound of that. Reeq and <span class=\"highlight\">Forename</span>, the daring duo! The brave bounty hunters, the scourge of sin eaters!"},{"name":"LUEREEQ","text":"Once we have slain Andreia, not a soul in Norvrandt will not know our names. They shall ring out all across the realm!"},{"name":"LUEREEQ","text":"Ah, but I should dwell overmuch on the victory before the struggle. A wise hunter is prepared and patient. 'Twould be prudent to send double, nay triple the agents afield to seek out promising new leads..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"If I didn't know any better, I'd say you're a gillionaire."},{"name":"A2","text":"You sure it's wise to spend your money so freely?"},{"name":"LUEREEQ","text":"Worried about the budget for our brave endeavor? Well, don't be. I am prepared to fund our activities as needed─no expense shall be spared! None whatsoever!"}],"reward":{"gil":1416},"reqs":{"jobs":[{"lvl":72,"id":158}],"quests":[68809]},"next":[68811]},"partials":[{"type":"npc","id":"1030964","obj":{"i":1030964,"n":"Lue-Reeq","l":2951,"q":5}},{"type":"quest","id":"68809","obj":{"i":68809,"n":"No Greater Sport","g":181,"l":"The Crystarium","s":301,"f":1}},{"type":"quest","id":"68811","obj":{"i":68811,"n":"Freedom from Privilege","g":181,"l":"The Crystarium","s":321,"f":1}}]}