{"quest":{"name":"Emergent Splendor","location":"Eulmore","id":68826,"patch":5.0,"sort":120,"icon":100894,"eventIcon":71201,"issuer":1028990,"target":1029842,"genre":8,"journal":["Alphinaud seems eager to discuss the significance of your discoveries.","Alphinaud's contemplation of your findings is interrupted by an angry Chai-Nuzz, whose admonishing words are cut short in turn by a sudden scream from above. The jongleurs duly appear to explain matters, declaring that a “villain” is to be sentenced by Lord Vauthry, and that everyone is invited to attend the event. Your patrons give you leave to witness the proceedings, directing you to a lift which should convey you to the Offer.","You ascend to the Offer, and are shocked to find Kai-Shirr lying bleeding in the middle of the floor. Aghast at the youth's barbaric punishment, Alphinaud confronts Lord Vauthry, sending him into a fit of rage. Your welcome thus outstayed, you take to your heels with Kai-Shirr in tow, and depart for the relative safety of the Derelicts.","Still fuming at Lord Vauthry's cruelty, Alphinaud says his farewells to Kai-Shirr and the Chais. He promises to return, but for now, it is time to find an amaro and leave Kholusia behind.","You reach the beach where the amaro have been patiently waiting to bear you back to the Crystarium. Alphinaud declares that it is time to speak with the Exarch, that you might chart a new course.","From what you have learned of Lord Vauthry and his subjects, it is plain that the city will not assist in your efforts to battle the sin eaters. In fact, any organized aggression towards the abominations is like to earn you Eulmore's enmity..."],"objectives":["Speak with Chadden.","Speak with Alphinaud.","Speak with Alphinaud on Cracked Shell Beach.","Speak with Alphinaud in the Ocular."],"dialogue":[{"name":"CHAINUZZ","text":"Hmph. I take my eye off you for one moment and you're chattering away with that assistant of yours. Am I to assume the outline is done, then?"},{"name":"CHAINUZZ","text":"Wh-What in the blazes...!?"},{"name":"CHAINUZZ","text":"It's so...so...<span class=\"emphasis\">unflattering</span>! Explain yourself, Alphinaud!"},{"name":"CHAINUZZ","text":"Where is your artistic interpretation!? It should evoke images of affluence and nobility, and overwhelm the viewer with its boundless beauty!"},{"name":"ALPHINAUD","text":"Lord Chai─you stated that this portrait was to commemorate your anniversary. Yours being a <span class=\"emphasis\">joyous</span> union, it seemed to me that a realistic portrayal─"},{"name":"CHAINUZZ","text":"<span class=\"emphasis\">Realistic</span>!? I don't want realism! I want perfection! A spectacle to slacken jaws and weaken knees! To make people <span class=\"emphasis\">cry out</span> in amazement!"},{"name":"CHAINUZZ","text":"Now, fetch a blank canvas and─"},{"name":"KAISHIRR","text":"(-Screaming Man-)Ah...ugh... Aaarrrggghhh!"},{"name":"CHAINUZZ","text":"I say... Did that come from above...?"},{"name":"CLOWNOFRED","text":"Ladies and gentlemen, your attention pleeease: a tale to make you quiver and your noble blood freeze!"},{"name":"CLOWNOFRED","text":"There was a villain on the loose, set to ruin our fair city..."},{"name":"CLOWNOFBLUE","text":"...But our lord has got him now, and his fate will <span class=\"emphasis\">not</span> be pretty!"},{"name":"CLOWNOFBLUE","text":"Yes, the hammer of justice is poised to come crrrashing down! And one and all who'd watch it fall are invited to join his lordship in the Offer!"},{"name":"DULIACHAI","text":"A malcontent? How dreadful..."},{"name":"ALPHINAUD","text":"And this man is to face sentencing...?"},{"name":"CHAINUZZ","text":"That's right. In fact...if you're curious, it might be worth you going along for the experience. The Offer they mentioned is part of the Emergent─the level above us where Lord Vauthry resides."},{"name":"CHAINUZZ","text":"Ordinarily, you would be barred from entering, but it seems they'll be opening its doors for the next little while. The Crown Lift will take you up there."},{"name":"ALPHINAUD","text":"...We had better not dawdle, then."},{"name":"DULIACHAI","text":"You will be careful around that malcontent, won't you? I should so hate for you to come to any harm. Although I imagine Lord Vauthry has the villain well under control..."},{"name":"CHAINUZZ","text":"If you want to see justice being served, stop dawdling and take the Crown Lift up to the Emergent."},{"name":"CHADDEN","text":"Joining the crowd up there?"},{"name":"Q1","text":"Proceed to the Offer?"},{"name":"KAISHIRR","text":"Thank you...again..."},{"name":"DULIACHAI","text":"All safe and sound, then?"},{"name":"CHAINUZZ","text":"What happened up there...?"},{"name":"ALPHINAUD","text":"..."},{"name":"ALPHINAUD","text":"Forgive me. In my anger, I seem to have marched us back outside again...though it is probably best we leave the island altogether. I believe we've worn out our welcome in Eulmore."},{"name":"ALPHINAUD","text":"In any case, I've seen enough of the world's self-proclaimed “capital city” to convince me that our battle against the sin eaters will find few allies in Kholusia."},{"name":"ALPHINAUD","text":"I will accompany you back to the Crystarium. We need to regroup and think on our strategy anew."},{"name":"ALPHINAUD","text":"Kai-Shirr, I have done you a grave disservice."},{"name":"ALPHINAUD","text":"You were hungry and desperate, and I offered you a solution without once considering the risks inherent in you accepting it. If I had but known the price you would be made to pay..."},{"name":"KAISHIRR","text":"You gave me everything I needed to make your idea work. It was me who made a mess of things, not you."},{"name":"KAISHIRR","text":"But even after all the trouble I caused, you still stepped in and saved me. And now Lord Vauthry wants us all dead..."},{"name":"ALPHINAUD","text":"Why not come back with us to the Crystarium? I am certain we can find work for you there, if you are willing."},{"name":"KAISHIRR","text":"No...that would just be me leaning on your kindness again."},{"name":"KAISHIRR","text":"I need to do some thinking─learn how to stand on my own two feet."},{"name":"ALPHINAUD","text":"...Very well. But you must promise you'll be careful. The Eulmorans may yet come looking for us."},{"name":"KAISHIRR","text":"I'll keep my head down, don't worry. And you take care too. Give me the chance to repay what you've done for me."},{"name":"DULIACHAI","text":"(-???-)&lt;huff&gt; Alph... &lt;puff&gt; Alphinaud!"},{"name":"ALPHINAUD","text":"Lord and Lady Chai..."},{"name":"CHAINUZZ","text":"What in the blazes did you <span class=\"emphasis\">do</span>!? They have the entire city looking for you!"},{"name":"DULIACHAI","text":"...I took a peek at your unfinished portrait, Alphinaud."},{"name":"DULIACHAI","text":"Now I've had many a beautiful and striking picture painted for me, but there was something about your work... It was as if you had caught the very essence of our love, and rendered it naked upon the canvas."},{"name":"DULIACHAI","text":"It was bold, unflinching...and I adored it. Please, you must come back with us and finish what you began! I will speak with Lord Vauthry, and vouch for your character. I'm sure we can smooth over any hard feelings!"},{"name":"ALPHINAUD","text":"I am sorry, Lady Chai. There are more important matters to which I must attend."},{"name":"DULIACHAI","text":"More important? What could be more important than enjoying the days we have left to us to the fullest?"},{"name":"ALPHINAUD","text":"Pray press me no further. We are leaving. But I would not presume to take the garments you were so kind as to procure for me. One moment─"},{"name":"DULIACHAI","text":"&lt;gasp&gt; I wouldn't hear of it! Keep the clothes, you silly boy─I insist!"},{"name":"DULIACHAI","text":"And I shall make arrangements so that you can pass through the gate without causing a stir. I expect you to come and visit."},{"name":"ALPHINAUD","text":"I will return, I promise you that. The outrage I witnessed must not go unanswered."},{"name":"ALPHINAUD","text":"The next time we meet, I shall be better prepared to confront the corruption which hides behind the glittering facade."},{"name":"SZEMDJENMAI","text":"Your search was successful, then? Good. But give the word, and we shall be off."},{"name":"DULIACHAI","text":"The loyal assistant! Have you come with...? Ah. No. Of course not."},{"name":"DULIACHAI","text":"By all means, take care of those “important matters” Alphinaud mentioned, but please─see that he comes back and finishes my painting just as soon as he can!"},{"name":"CHAINUZZ","text":"Wh-What are you─ Have you gone mad!?"},{"name":"CHAINUZZ","text":"We can bribe the guards with favors and such, but up here...? No matter what my wife says, you must leave before you bring disaster down upon all of our heads!"},{"name":"ALPHINAUD","text":"Thank you, my friend...for staying at my side through this whole sordid endeavor."},{"name":"ALPHINAUD","text":"Whilst not quite the joyous outcome I had hoped for, our efforts have nevertheless answered a great many questions. Suffice it to say, our plans for saving the First are unlikely to involve the aid of Lord Vauthry and his subjects."},{"name":"ALPHINAUD","text":"Come, we must speak with the Exarch and chart a new course. This is far from over..."},{"name":"MYSTERYVOICE","text":"I am told you and Alphinaud carried out his scheme to infiltrate Eulmore. I would ask what you thought of its base amusements, but I doubt you are eager to relive the experience..."},{"name":"ALISAIE","text":"I see you've reunited with my brother as well. I'd dearly love to hear how <span class=\"emphasis\">that</span> story went."},{"name":"ALPHINAUD","text":"Ahhh...it is good to be back amongst friends. In such company, I can finally turn my thoughts to the future. But ere we discuss all we have learned and begin planning our next step, I think it best that you visit Alisaie."},{"name":"ALPHINAUD","text":"Her familiarity with Amh Araeng will no doubt provide us invaluable insight, and besides, I know she is as eager to see you as I was."},{"name":"ALPHINAUD","text":"Bring a smile to her face, <span class=\"highlight\">Forename</span>."},{"name":"ALPHINAUD","text":"Ahhh...it is good to be back amongst friends, not to mention my dear sister. I have not seen her for some time, but I gather she is as keen to press on with our plans as I am."},{"name":"ALPHINAUD","text":"And you've seen quite a lot of the First yourself now─more than enough to appreciate the scale of the obstacles we face. Let us lay our discoveries before the Exarch, and discuss what must be done."},{"name":"DULIACHAI","text":"Oh, dearest, we really should have found you some new gloves."},{"name":"CHAINUZZ","text":"Yes, my love, you're probably right..."}],"reward":{"gil":934},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68825]},"next":[68836]},"partials":[{"type":"npc","id":"1028990","obj":{"i":1028990,"n":"Alphinaud","l":2952,"q":2}},{"type":"npc","id":"1029842","obj":{"i":1029842,"n":"Alphinaud","l":3223,"q":1}},{"type":"quest","id":"68825","obj":{"i":68825,"n":"A Blessed Instrument","g":8,"l":"Eulmore","s":110}},{"type":"quest","id":"68836","obj":{"i":68836,"n":"The Lightwardens","g":8,"l":"The Ocular","s":220}}]}