{"quest":{"name":"In Search of Alisaie","location":"The Ocular","id":68827,"patch":5.0,"sort":130,"icon":100895,"eventIcon":71201,"issuer":1028923,"target":1028963,"genre":8,"journal":["The Crystal Exarch is eager for you to meet with Alisaie.","In order to facilitate your reunion with Alisaie─and hopefully soothe any lingering anger from her ill-timed summoning─the Exarch offers to arrange transportation for the journey to Amh Araeng. He hands you a letter of introduction, and sends you to the Amaro Launch to find a man named Cassard.","After reading the Exarch's missive, the merchant seems more than happy to act as your guide. You have only to give the signal to begin your trek into the desert.","You indicate your readiness to depart, and Cassard ushers you onto the back of one of the waiting amaro.<br><br>※From this point onwards, you may secure passage to the lands of Amh Araeng with a word to the adroit amaro tamer.","You have arrived in Amh Araeng. Cassard awaits to escort you deeper into the desert.","The merchant bids you follow him to the southwest, and you duly set off into the sands, doing your best not to get left behind.","A short while later, Cassard signals for a brief stop, apparently unwilling to cross the bridge before you've properly appreciated the majesty of the scene you're leaving behind.","You dutifully admire the imposing edifice of Qasr Sharl until your guide deems your eyes to have feasted enough─whereupon he prods you to press on with your journey.","Upon arriving in Mord Souq, Cassard welcomes you with obvious enthusiasm, declaring his love for the place in the same breath. Judging by the grin on the merchant's face, your visit here promises to be an interesting one..."],"objectives":["Deliver the sealed missive to Cassard at the Amaro Launch.","Speak with Cassard.","Admire the view.","Speak with Cassard."],"dialogue":[{"name":"MYSTERYVOICE","text":"Ready to depart for Amh Araeng? Alisaie will be overjoyed to see you safe─I know she was particularly concerned for your well-being."},{"name":"MYSTERYVOICE","text":"She, uh...<span class=\"emphasis\">impressed upon me</span> how regrettable the timing of her summoning was. Repeatedly."},{"name":"MYSTERYVOICE","text":"I only hope that my part in sending you to her will garner me some measure of forgiveness. Here. This is a letter of introduction addressed to a man named Cassard, the master of a merchant caravan."},{"name":"MYSTERYVOICE","text":"There are few who know the ways of the desert as well as he does. Find him at the Amaro Launch, and he will see that you reach your destination."},{"name":"CASSARD","text":"Hm? If you've come looking for work, I might have a spot for another guard─"},{"name":"CASSARD","text":"Oh. Oh! A friend of the Exarch! Hoping to meet someone in Amh Araeng, are you?"},{"name":"CASSARD","text":"Then I shall be your guide! I was about to set off for our outpost there, as a matter of fact, so we can leave right away─assuming you have everything you need?"},{"name":"CASSARD","text":"All set? Then off to the unforgiving sands we go!"},{"name":"SYSTEM","text":"You can now travel to Amh Araeng! Speak with the adroit amaro tamer to fly to the desert."},{"name":"SYSTEM","text":"You can also use your <span class=\"highlight\">aether compass</span> to assist with locating aether currents in new regions. The aether compass can be found under Collection in the Duty section of the main menu."},{"name":"CASSARD","text":"Oof, no matter how many times I come here, the <span class=\"alternative-container\"><span class=\"alternative\">cold</span><span class=\"alternative\">heat</span></span> never fails to catch me off guard! <span class=\"alternative-container\"><span class=\"alternative\">The sky may be as bright as in the scorching hours of day</span><span class=\"alternative\">Don't be surprised when the temperature drops at night, though─the sky is still bright, of course</span></span>, but it gets brisk enough to make you shiver."},{"name":"CASSARD","text":"Now, the Exarch's letter said I was to take you to the Inn at Journey's Head, which is where this Alisaie friend of yours is staying."},{"name":"CASSARD","text":"But that's a fair old distance. So I propose we make a stop in Mord Souq to break up the trek─allowing me to attend to some business, and you to enjoy the local hospitality. Sound good? Good!"},{"name":"CASSARD","text":"All right, you lot! I'm off, and I'd better not see the goods covered in sand when I get back!"},{"name":"CASSARD","text":"Right, we head southwest, straight as an arrow!"},{"name":"CASSARD","text":"Stop here a moment. This is your first visit to Amh Araeng, is it not?"},{"name":"CASSARD","text":"Before you cross the River of Sand, you need to turn around and feast your eyes on <span class=\"emphasis\">that</span>!"},{"name":"CASSARD","text":"Go on, take a look! We're not moving until you appreciate the majesty of that edifice!"},{"name":"CASSARD","text":"They built them big, didn't they? That's Qasr Sharl, a fortress meant to protect the northern reaches of Nabaath Areng."},{"name":"CASSARD","text":"Seeing what was left behind, I believe it when they say that it was once one of Norvrandt's mightiest nations."},{"name":"CASSARD","text":"...At least until the Flood came along. Great chunks of Nabaath Areng's lands were lost to the Light, its great city included. The few who survived didn't see much point in staying. Most of them, anyway."},{"name":"CASSARD","text":"No, not many choose to come here these days, not with everything in ruins. Even that hulking great fortress has become little more than an amaro roost for me and my caravan."},{"name":"CASSARD","text":"But not everywhere is as deserted as this place. Just wait until you see Mord Souq..."},{"name":"CASSARD","text":"Let's press on, shall we!"},{"name":"CASSARD","text":"Here we are─Mord Souq! By the blessed shadow, I love this town!"}],"reward":{"gil":1116},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68817]},"next":[68828]},"partials":[{"type":"npc","id":"1028923","obj":{"i":1028923,"n":"Crystal Exarch","l":3223,"q":4}},{"type":"npc","id":"1028963","obj":{"i":1028963,"n":"Cassard","l":2955,"q":2}},{"type":"quest","id":"68817","obj":{"i":68817,"n":"Travelers of Norvrandt","g":8,"l":"The Crystarium","s":30}},{"type":"quest","id":"68828","obj":{"i":68828,"n":"City of the Mord","g":8,"l":"Amh Araeng","s":140}}]}