{"quest":{"name":"A Fickle Existence","location":"Kholusia","id":68821,"patch":5.0,"sort":70,"eventIcon":71201,"issuer":1029814,"target":1029823,"genre":8,"journal":["Alphinaud wears a look of profound disapproval."],"objectives":["Speak with Mosha-Moa.","Search for the Mystel at the designated area.","Speak with the blue-haired Mystel.","Rescue the weakened wretch.","Speak with Alphinaud.","Speak with Tristol."],"dialogue":[{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You disapprove of these people's way of life?"},{"name":"A1","text":"You disapprove of Eulmore?"},{"name":"ALPHINAUD","text":"Disapprove...? It frustrates me, certainly. That is only part of it, though. The whole situation makes me uneasy."},{"name":"ALPHINAUD","text":"'Tis difficult to make a final judgment without first seeing the city's inner workings. Mayhap it is that uncertainty which always makes me feel so ill at ease here..."},{"name":"ALPHINAUD","text":"Not that it matters. However unjust this system seems to me, if these people claim to be content with their lot, it is hardly my place to criticize their choices."},{"name":"ALPHINAUD","text":"But take that elderly lady you rescued─does it not seem that those who have chosen to forgo Eulmore's largesse are doomed to suffer for their independence?"},{"name":"ALPHINAUD","text":"In the end, they are all but forced to seek refuge in Gatetown. And so hamlets and fields across the island are left empty and untended, hastening the region's descent into ruin."},{"name":"ALPHINAUD","text":"Nay, I am not convinced that Eulmore's generosity truly serves the best interests of Kholusia's people."},{"name":"ALPHINAUD","text":"I am not so naive as to think there is some miraculous solution to all of this. Yet I cannot help but frown at the sight of hardworking villagers struggling to survive, even as the chosen few rejoice at being plucked from poverty by the hand of a capricious noble."},{"name":"ALPHINAUD","text":"There <span class=\"emphasis\">has</span> to be a better way. I will not know for sure, however, until I have taken those long-delayed steps through Eulmore's gates."},{"name":"ALPHINAUD","text":"'Tis fortunate that you arrived when you did, <span class=\"highlight\">Forename</span>. I have been working on a scheme to insinuate myself into the city, and if all goes to plan, it should soon come to fruition."},{"name":"ALPHINAUD","text":"There is a beast tribe who makes its home in the seas surrounding the island. The Ondo, they are called, though you and I know them as Sahagin."},{"name":"ALPHINAUD","text":"For the most part, they keep to themselves in their ocean grottoes, and rarely have dealings with land-dwellers."},{"name":"ALPHINAUD","text":"But as Tataru took such great pains to impress upon me during our stay in Kugane, business favors the bold. And so I reached out to them."},{"name":"ALPHINAUD","text":"I duly discovered that the Ondo are inordinately fond of land-grown produce─fresh fruits in particular. And when I offered to procure such goods for them, they promised to pay me in <span class=\"emphasis\">pearls</span>."},{"name":"ALPHINAUD","text":"An attractive business venture for any prospective investor, would you not agree? Surely even the most jaded Eulmoran lord would have time for a merchant who can make pearls from plums and pumpkins?"},{"name":"ALPHINAUD","text":"Yes, I've come a long way since my days of buying samurai swords without first negotiating a price!"},{"name":"ALPHINAUD","text":"My appointment with the Ondo is due to take place in a few hours. I just need to collect the produce and meet with them on the shore."},{"name":"ALPHINAUD","text":"Might you help me make the exchange?"},{"name":"ALPHINAUD","text":"Excellent, I should be glad of your company."},{"name":"ALPHINAUD","text":"First things first, then─we must pay a visit to Mosha-Moa, my supplier in Wright. Come, it is just to the northwest of here."},{"name":"ALPHINAUD","text":"This is Mosha-Moa, the farmer of whom I spoke."},{"name":"MOSHAMOA","text":"...Is there something I can do for you, friend?"},{"name":"ALPHINAUD","text":"Good day to you, Mosha-Moa. This is my associate, <span class=\"highlight\">Forename</span>. We are here to collect the produce I purchased."},{"name":"MOSHAMOA","text":"...Eh? I loaded your lackey up with the goods not long ago."},{"name":"ALPHINAUD","text":"My <span class=\"emphasis\">lackey</span>? I know of no such person!"},{"name":"MOSHAMOA","text":"Mystel lad, short blue hair? ...No? He said he'd come on your behalf, and since he seemed to know all the details, I just assumed..."},{"name":"ALPHINAUD","text":"Confound it. Someone must have been eavesdropping on our conversation..."},{"name":"ALPHINAUD","text":"If this charlatan was here not long ago, he cannot have gone far. We should split up and search the area. You find a vantage point on the south side of town, and I shall take the west!"},{"name":"MOSHAMOA","text":"Forgive me, I had no cause to doubt the lad. Still, he shouldn't be hard to spot with that blue hair of his..."},{"name":"SYSTEM","text":"Search the surroundings for a male Mystel with short blue hair. You may move the camera as well as zoom in and out. Target a likely suspect and inspect him with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>! Any sign of him!?"},{"name":"ALPHINAUD","text":"...You've a keen eye. Let us move in, before he makes good his escape!"},{"name":"ALPHINAUD","text":"Here! He's breathing, I think, though he won't last long without help."},{"name":"ALPHINAUD","text":"...That should take care of the worst of his injuries."},{"name":"TRISTOL","text":"&lt;cough&gt; &lt;splutter&gt; Mercy... Mercy, I beg you..."},{"name":"ALPHINAUD","text":"Breathe easy, sir. No harm will come to you here."},{"name":"ALPHINAUD","text":"The poor man is shivering. Pray keep an eye on him while I get a fire going."},{"name":"TRISTOL","text":"I thought for certain I was d-dead. How am I ever to repay this kindness...?"},{"name":"ALPHINAUD","text":"We'll settle for the tale behind your current predicament. Why don't you begin by telling us your name?"},{"name":"TRISTOL","text":"(-Tristol-)Tristol. I was invited into Eulmore to work as an artist..."},{"name":"TRISTOL","text":"(-Tristol-)A wealthy couple took me in to paint pictures for them, but when my style proved contrary to their taste, they just as quickly turfed me out onto the street."},{"name":"TRISTOL","text":"(-Tristol-)I was left penniless and patronless─a grave sin in Lord Vauthry's city."},{"name":"TRISTOL","text":"(-Tristol-)Within days, they had brought me before the man himself, and he asked me what I meant to do. Dejected as I was, I told him that I wished to leave..."},{"name":"TRISTOL","text":"(-Tristol-)Little did I know how soon he would grant me my wish! They flung me over the balustrade into the godsdamned ocean!"},{"name":"ALPHINAUD","text":"From up there!? How were you not dashed to pieces!?"},{"name":"TRISTOL","text":"(-Tristol-)Don't ask me. Luck, I suppose. Though if you hadn't found me when you did, it wouldn't have counted for much."},{"name":"ALPHINAUD","text":"Monstrous... And the citizens condone such barbaric punishment!?"},{"name":"TRISTOL","text":"(-Tristol-)Oh, without a second thought. When Lord Vauthry passes judgment, no one so much as <span class=\"emphasis\">blinks</span>, let alone argues."},{"name":"TRISTOL","text":"(-Tristol-)In Eulmore, his word is law."},{"name":"TRISTOL","text":"Ah, that fire's chased the chill from my bones. Thank you again..."},{"name":"ALPHINAUD","text":"The more I hear about Eulmore, the more determined I am to see what waits within its walls."},{"name":"ALPHINAUD","text":"I shall bend all my thoughts toward securing another way into the city. There must be something we can do..."},{"name":"ALPHINAUD","text":"But first, we should convey Tristol to the shelter of the village. Fire or no fire, he needs to be out of this chilly coastal air."},{"name":"TRISTOL","text":"A way into the city...?"},{"name":"ALPHINAUD","text":"I wonder what Tristol will do now..."},{"name":"TRISTOL","text":"Pray accept my deepest gratitude. I owe you both my life."},{"name":"TRISTOL","text":"And...if you'll permit me, I would assist you in your attempt to enter Eulmore─insofar as I am able, at any rate."},{"name":"TRISTOL","text":"To be frank, the thought of sending my saviors into that awful place makes me sick to the stomach─but since it's plain you've set your minds on it...you should take this."},{"name":"TRISTOL","text":"It's my favorite paintbrush."},{"name":"TRISTOL","text":"The Eulmoran elite are never satisfied until they get <span class=\"emphasis\">exactly</span> what they want, and if I'm not mistaken, the couple I mentioned will be looking for someone to replace me. If you make a show of owning such a well-used brush, you may be able to convince people you have a talent for painting."},{"name":"ALPHINAUD","text":"Are you certain? This is your livelihood. We cannot deprive you of such a treasured possession..."},{"name":"TRISTOL","text":"I give it gladly after all you've done for me. Besides, I can't─ I...don't think I have the heart to paint anymore."},{"name":"TRISTOL","text":"As to what I'll do instead...I honestly haven't decided. But I shan't stay long in this place─not with that city brooding over me. Nay, I'll move on to new lands and a new profession. And I'll keep you in my prayers from now until my dying day."}],"reward":{"gil":1116},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68820]},"next":[68822,68892,68893,68894,68895,68896,68907]},"partials":[{"type":"npc","id":"1029814","obj":{"i":1029814,"n":"Alphinaud","l":2954,"q":2}},{"type":"npc","id":"1029823","obj":{"i":1029823,"n":"Tristol","l":2954,"q":1}},{"type":"quest","id":"68820","obj":{"i":68820,"n":"Open Arms, Closed Gate","g":8,"l":"Kholusia","s":60}},{"type":"quest","id":"68822","obj":{"i":68822,"n":"City of Final Pleasures","g":8,"l":"Kholusia","s":80}},{"type":"quest","id":"68892","obj":{"i":68892,"n":"Witch of the Sea","g":114,"l":"Kholusia","s":1170}},{"type":"quest","id":"68893","obj":{"i":68893,"n":"Following the Grain","g":114,"l":"Kholusia","s":1180}},{"type":"quest","id":"68894","obj":{"i":68894,"n":"Bridge to the Other Side","g":114,"l":"Kholusia","s":1190}},{"type":"quest","id":"68895","obj":{"i":68895,"n":"A Drop of Sunshine","g":114,"l":"Kholusia","s":1201}},{"type":"quest","id":"68896","obj":{"i":68896,"n":"A Plankless Task","g":114,"l":"Kholusia","s":1301,"f":1}},{"type":"quest","id":"68907","obj":{"i":68907,"n":"Village of Woe","g":114,"l":"Kholusia","s":1210,"f":1}}]}