{"quest":{"name":"A Taste of Honey","location":"Eulmore","id":68824,"patch":5.0,"sort":100,"eventIcon":71201,"issuer":1029833,"target":1029830,"genre":8,"journal":["The amiable maiden appears suddenly concerned."],"objectives":["Speak with Tista-Bie.","Win a game against Tista-Bie.","Win another game against Tista-Bie.","Speak with Atharn.","/dance on the mark on stage.","Speak with Atharn.","Speak with Dulia-Chai."],"dialogue":[{"name":"EMPLOYEE03287","text":"I will never leave my lady's side again!"},{"name":"LADY03287","text":"All this talk of relying on the bonded, and I haven't given a thought as to what your duties might be. I hope I haven't interrupted your work unduly?"},{"name":"LADY03287","text":"A tour of the city, is it? Then you really must visit the Beehive─it's always buzzing with activity! Ahem, local humor..."},{"name":"LADY03287","text":"Anyway, a lady by the name of Tista-Bie usually has her seat near the entrance. She will gladly speak with you on any number of topics, assuming you find yourself on her good side!"},{"name":"LADY03287","text":"I think you will find the Beehive is far more diverting than watching me pick out new curtains for the parlor!"},{"name":"TISTABIE","text":"Welcome to the Beehive, my little drone. Seeking the sting of excitement to liven up your day?"},{"name":"TISTABIE","text":"...Hm hm, I can tell at a glance when folk are new to our happy colony. It's the nervous fluttering, you see─always gives them away."},{"name":"TISTABIE","text":"Why don't we play some cards to set you at your ease, eh? A quick game of “High or Low”─it's simply a matter of guessing who has the bigger hand."},{"name":"TISTABIE","text":"If you win, I'll grant you a single favor...within reason, of course. Interested?"},{"name":"TISTABIE","text":"Ready for a game of “High or Low”, then?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let's play!"},{"name":"A1","text":"Maybe another time."},{"name":"A1","text":"What are the rules?"},{"name":"TISTABIE","text":"“High or Low” is a guessing game. You must decide whether the total of your three cards is higher or lower than the total of your opponent's cards."},{"name":"TISTABIE","text":"The deck holds nine cards, with the pictures printed thereon representing the numbers one through nine. Each number appears only once in the deck, so there are no repeats."},{"name":"TISTABIE","text":"If you guess correctly, then you win the match. If both totals are the same, then another hand is dealt."},{"name":"TISTABIE","text":"Oh? Well, you know where to find me if you want to play a hand or two."},{"name":"TISTABIE","text":"Good for you! No time like the present, I say!"},{"name":"TISTABIE","text":"Three cards for you, three cards for me. You flip one of yours over, and I flip two of mine."},{"name":"TISTABIE","text":"Now, what's your call? Will your total be higher or lower than mine?"},{"name":"Q2","text":"I call..."},{"name":"A2","text":"...low!"},{"name":"A2","text":"...high!"},{"name":"TISTABIE","text":"You're going with “low,” then? Right, let's see what we've got..."},{"name":"TISTABIE","text":"You're going with “high,” then? Right, let's see what we've got..."},{"name":"TISTABIE","text":"My cards add up to [#1]. And you have..."},{"name":"TISTABIE","text":"...a total of [#1]."},{"name":"TISTABIE","text":"Congratulations, your guess was right!"},{"name":"TISTABIE","text":"Hm... Usually I'd concede defeat at this point, but what do you say to a rematch? One more win, then we'll talk about that favor."},{"name":"TISTABIE","text":"Aw... Sorry, honeybee, but this match goes to me."},{"name":"TISTABIE","text":"Shall we play again?"},{"name":"TISTABIE","text":"That's what I like to hear. Let me shuffle the deck..."},{"name":"TISTABIE","text":"Had enough for now? Fine, fine─I'll be sitting right here should the mood strike you."},{"name":"TISTABIE","text":"Oho, it seems we came out equal. But as lovely a coincidence as that may be, we still need a clear winner..."},{"name":"TISTABIE","text":"Another match of “High or Low”? Come now, little honeybee, we all need our diversions."},{"name":"TISTABIE","text":"That's the spirit! Let me sort out the deck..."},{"name":"TISTABIE","text":"Well, well, would you look at that. I think you've got a knack for this, newcomer."},{"name":"TISTABIE","text":"Congratulations! Victory is yours...as is the prize I promised."},{"name":"TISTABIE","text":"Oh dear, looks like this match goes to me."},{"name":"TISTABIE","text":"Come whisper in my ear, then, and don't be shy. Tell ol' Tista what she can do for you."},{"name":"TISTABIE","text":"...That's all? How delightfully wholesome. But if knowledge is what you want, then that is what you shall have."},{"name":"TISTABIE","text":"In my humble estimation, the most wondrous thing about this town is how safe we are from the sin eaters."},{"name":"TISTABIE","text":"They say Lord Vauthry was born with the power to command them─which means no Eulmoran need ever raise a weapon in defense of the city."},{"name":"TISTABIE","text":"...Was that the kind of thing you wished to know? If your itch still needs scratching, you might get a few words out of Atharn over there. There's naught that merry sot likes more than the sound of his own voice."},{"name":"ATHARN","text":"Whassat? New to Eulmore, you say?"},{"name":"ATHARN","text":"Gahaha! Only just arrived and already you're looking to peel away the layers of mystery. Oh, I'm all for chatting, but you need to slow down and <span class=\"emphasis\">enjoy</span> life, my friend!"},{"name":"ATHARN","text":"I tell you what: you hop up on stage and give us a dance first, and <span class=\"emphasis\">then</span> we can have our little talk!"},{"name":"ATHARN","text":"Go on, there's plenty of room up there! Give us your best shimmies and shakes!"},{"name":"ATHARN","text":"(-Atharn-)That's the way! Dance like there's no tomorrow!"},{"name":"ATHARN","text":"&lt;whistle&gt; Now <span class=\"emphasis\">that</span> was a show! You're welcome to clamber up on stage any time you like!"},{"name":"ATHARN","text":"So...what was it you wanted to ask me? Ah, yes, something about our fair city. Well, I can tell you it wasn't always so peaceful as it is today."},{"name":"ATHARN","text":"The Eulmoran Army may be the very essence of military might, but even our forces saw grievous losses in the war against the sin eaters."},{"name":"ATHARN","text":"Things changed for us, oh, around twenty years ago now, when the old ruler's son came to power!"},{"name":"ATHARN","text":"He's got this way with the eaters, you see─turns them docile as house cats. I wouldn't be exaggerating to say they've become something of an ally to Eulmore. No longer an enemy to be feared."},{"name":"ATHARN","text":"And yet elsewhere, there are still fools who insist on fighting their losing battles... Pah! A toast to Lord Vauthry!"},{"name":"SYSTEM","text":"You've gained a preliminary sense of the city. The Chais─and Alphinaud─will be expecting your return."},{"name":"CHAINUZZ","text":"Hm...? Ah, yes, the assistant. Was there something?"},{"name":"DULIACHAI","text":"Oh, you've returned from your jaunt around the city? So soon?"},{"name":"DULIACHAI","text":"You needn't have hurried back─young Alphinaud has yet to put brush to canvas."},{"name":"CHAINUZZ","text":"One cannot rush good art, I'm told. Or good artists, apparently..."},{"name":"CHAINUZZ","text":"...Ah, finally."},{"name":"ALPHINAUD","text":"I've put together an ensemble out of the garments you chose. Is this satisfactory?"},{"name":"DULIACHAI","text":"Oh, goodness gracious me! That last outfit was precious, but this makes you look positively dashing!"},{"name":"DULIACHAI","text":"You truly are a handsome boy! However am I to decide!?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"What happened to painting?"},{"name":"A3","text":"I don't recall this part of the artistic process..."},{"name":"CHAINUZZ","text":"Exactly! The lad is an artist, dearest, not a dress-up doll. It's about time we set him to work for the reason we called him here!"},{"name":"DULIACHAI","text":"...Must we? I do love a good painting, but I thought since we were enjoying ourselves so thoroughly..."},{"name":"CHAINUZZ","text":"Well, I'd not─ That is to say, as long as you..."},{"name":"CHAINUZZ","text":"Ugh. Just...make sure you give the lad time to prepare. We know who'll be upset if he's not ready to paint at a moment's notice."},{"name":"DULIACHAI","text":"Whatever you say, darling. So! Shall we pick out some jewelry, next!?"}],"reward":{"gil":1080},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68823]},"next":[68825]},"partials":[{"type":"npc","id":"1029833","obj":{"i":1029833,"n":"Amiable Maiden","l":2952,"q":2}},{"type":"npc","id":"1029830","obj":{"i":1029830,"n":"Dulia-Chai","l":2952,"q":2}},{"type":"quest","id":"68823","obj":{"i":68823,"n":"Free to Sightsee","g":8,"l":"Eulmore","s":90}},{"type":"quest","id":"68825","obj":{"i":68825,"n":"A Blessed Instrument","g":8,"l":"Eulmore","s":110}}]}