{"quest":{"name":"Working Off the Meal","location":"Amh Araeng","id":68829,"patch":5.0,"sort":150,"eventIcon":71201,"issuer":1028974,"target":1028976,"genre":8,"journal":["Cassard is impressed by your gastronomic fortitude."],"objectives":["Use the market receipt to collect Cassard's purchases.","Deliver the Mord Souq merchandise to Cassard."],"dialogue":[{"name":"CASSARD","text":"Gahahaha! You have courage, my friend! Rhon Ron's wares are more “exotic” than harmful, but I don't envy you the bellyache you'll have on the morrow."},{"name":"CASSARD","text":"Right. Now that you've eaten, I expect you're eager to get back on the road..."},{"name":"CASSARD","text":"...Would you mind if we delayed our departure a touch? I have a few deals left to close before I can conclude my business here in Mord Souq."},{"name":"CASSARD","text":"Oh! Offering your services, are you? Aye, well an assistant would certainly help hurry things along!"},{"name":"CASSARD","text":"I have a receipt here for some goods that need picking up from the market. All properly paid for─you'd just need to do the lifting and carrying."},{"name":"CASSARD","text":"I'll go and take care of some last-minute haggling, then. See you in a bit."},{"name":"SYSTEM","text":"You may view the market receipt at any time during this quest by using the relevant item in the <span class=\"highlight\">Key Items</span> menu."},{"name":"MEMO03293","text":"(-Market Receipt-)Table cactus ─ Thon Ton<br>Iron ore ─ Thol Tol"},{"name":"MEMO03293","text":"(-Market Receipt-)Nabaath Areng antiques ─ Mhil Mil (to be collected from Mhul Mul)"},{"name":"THONTON","text":"Lift with your legs, and not with your back!♪"},{"name":"THOLTOL","text":"Now, then! ...What was I doing, again?"},{"name":"MHULMUL","text":"Hoohoo! Lovely, lovely pots!"},{"name":"BHUNBUN","text":"Wait, what? No no no! This is Bhun Bun's private worm stash. Not for sale!"},{"name":"RHONRON","text":"Hm? Hungry again already? You have a strong stomach, friend, but I wouldn't eat those!"},{"name":"MHILMIL","text":"Hands off! That water is for Mhil Mil's footbath! ...Unless you have coin or barter?"},{"name":"MHILMIL","text":"Oh, you work for Cassard? Mhul Mul has his antiques all boxed up and ready for transport!"},{"name":"LATGAR","text":"If you're handling Cassard's porter work, you've come to the wrong place. He has no outstanding orders with my shop."},{"name":"THONTON","text":"You came in with Cassard, yes? Good, good, I can finally stop thinking about that sack. Please, take your prickly purchase!"},{"name":"THOLTOL","text":"Cassard sent you, did he? Right. Yes. ...What kind of ore was it, again?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Copper ore!"},{"name":"A1","text":"Iron ore!"},{"name":"A1","text":"Tin ore!"},{"name":"THOLTOL","text":"Yes! Wait, no. Are you sure? I don't seem to have any on hand..."},{"name":"THOLTOL","text":"<span class=\"emphasis\">Iron</span> ore, of course! That would explain this box I have here. It's all yours!"},{"name":"MHULMUL","text":"Hey, no touching! That merchandise is spoken for! You couldn't possibly change my mind with a better offer..."},{"name":"MHULMUL","text":"...What? Cassard sent you!? Wh-Why didn't you say so? I wouldn't <span class=\"emphasis\">dream</span> of selling his goods to a higher bidder! Oh no, no, no!"},{"name":"MHULMUL","text":"Nabaath Areng relics, wasn't it? All packed in that box there. Handle with care!"},{"name":"THONTON","text":"That's my business finished for the day! Come again if you need more spiky succulents!"},{"name":"THOLTOL","text":"Now, then! ...Where was I going, again?"},{"name":"MHULMUL","text":"Give my regards to Cassard, heh heh heh..."},{"name":"CASSARD","text":"Don't tell me you've been round the entire market already!?"},{"name":"CASSARD","text":"Aye, that's the lot, all right. Good work."},{"name":"CASSARD","text":"And quick work, too, considering you've not set foot in the place before. I'd thought you one to sit in the city like the Exarch, but something tells me you're not a stranger to visiting strange lands..."},{"name":"CASSARD","text":"Unfortunately, your efficiency presents something of a problem. I'd hoped to conclude all my business before you returned, but it seems there's been some confusion over one of the orders I placed."},{"name":"CASSARD","text":"I'll have to drag in my middleman and sort this mess out. I'm sorry to make you sit around and twiddle your thumbs..."},{"name":"TESLEEN","text":"(-???-)...Cassard? It feels like an age since I last saw you!"},{"name":"CASSARD","text":"Well, if it isn't the lovely Tesleen! It has been a while, but your timing couldn't be better."},{"name":"CASSARD","text":"This <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> was on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> way to meet with Alisaie. I'm supposed to be taking <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to your corner of the desert, but a misplaced order has commandeered my attention..."},{"name":"TESLEEN","text":"...Wait, I know who you are."},{"name":"TESLEEN","text":"Alisaie has told me <span class=\"emphasis\">so much</span> about you! You're <span class=\"highlight\">Forename</span>, aren't you!?"},{"name":"TESLEEN","text":"I knew it! How wonderful to meet you in the flesh after hearing all those stories!"},{"name":"TESLEEN","text":"I'm Tesleen. I work as a carer at the Inn, and I've gotten to know Alisaie quite well since she took up guard duties there."},{"name":"TESLEEN","text":"Do you want me to take over as <span class=\"highlight\">Forename</span>'s guide, Cassard? My shopping's all done and packed for the road, so it would be no trouble..."},{"name":"CASSARD","text":"That would be a great help, thank you!"},{"name":"CASSARD","text":"Well, it looks like you'll be able to head straight out after all. My caravan and I will be in the area for a while yet─seek me out when you've had your fill of Amh Araeng, and I'll send you back to the Crystarium."}],"reward":{"gil":642,"items":[{"id":26827}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68828]},"next":[68830,68911]},"partials":[{"type":"npc","id":"1028974","obj":{"i":1028974,"n":"Cassard","l":2955,"q":1}},{"type":"npc","id":"1028976","obj":{"i":1028976,"n":"Cassard","l":2955,"q":1}},{"type":"item","id":"26827","obj":{"i":26827,"n":"White Oak Hand Gear Coffer (IL 385)","l":1,"c":26560,"t":61}},{"type":"quest","id":"68828","obj":{"i":68828,"n":"City of the Mord","g":8,"l":"Amh Araeng","s":140}},{"type":"quest","id":"68830","obj":{"i":68830,"n":"A Desert Crossing","g":8,"l":"Amh Araeng","s":160}},{"type":"quest","id":"68911","obj":{"i":68911,"n":"Work to Live or Live to Work","g":115,"l":"Amh Araeng","s":1410,"f":1}}]}