{"quest":{"name":"Open Arms, Closed Gate","location":"Kholusia","id":68820,"patch":5.0,"sort":60,"eventIcon":71201,"issuer":1029809,"target":1029814,"genre":8,"journal":["Alphinaud is ready to take to the road once more."],"objectives":["Speak with Alphinaud.","Search for the source of the scream.","Rescue the manic madame.","Aid the manic madame.","Survey the scene.","Speak with Alphinaud.","Have a look around Gatetown.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"Assuming you have no objections, let us make our way directly to the city outskirts."},{"name":"ALPHINAUD","text":"If we time our arrival just right, you may be lucky enough to see why I have yet to set foot in Eulmore─despite my best efforts to do so..."},{"name":"ALPHINAUD","text":"Come. From here, we must head west, and then cross a small bridge..."},{"name":"ALPHINAUD","text":"Kholusia seems peaceful, does it not? Almost...familiar? I had a similar impression of the Crystarium. Even in this distant world, people are much the same."},{"name":"ALPHINAUD","text":"&lt;sigh&gt; To think that whenever a calamity struck the Source, a reflection such as this one─with all its culture and history─was being erased from existence..."},{"name":"FEARLADY03284","text":"(-Screaming Woman-)N-No! Get away from me!"},{"name":"ALPHINAUD","text":"...Over there!"},{"name":"ALPHINAUD","text":"Quickly, someone's in trouble!"},{"name":"FEARLADY03284","text":"P-Please, no..."},{"name":"FEARLADY03284","text":"Oh, thank the fates, y─ Look out!"},{"name":"FEARLADY03284","text":"My poor heart... Thank you, young <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"ALPHINAUD","text":"Ah, there you are! In my haste, I lost my bearings... But I see you have the situation well in hand. Fine work!"},{"name":"ALPHINAUD","text":"Are you alright, madam?"},{"name":"FEARLADY03284","text":"Just a few bruises from where I fell. Nothing compared to what was in store for me before this brave soul came to my rescue."},{"name":"FEARLADY03284","text":"I honestly thought I was done for. My feet are not as swift as they once were, and I knew there was no one left to hear me scream. Not that I let that stop me!"},{"name":"FEARLADY03284","text":"&lt;sigh&gt; I should probably leave my old house behind and queue up outside Eulmore with the rest of them."},{"name":"FEARLADY03284","text":"Doubt those fancy lords and ladies would welcome an old crone like me... Still, even a shack near the gate has to be safer than staying here!"},{"name":"ALPHINAUD","text":"One would hope. Either way, I suggest you avoid wandering alone, lest you make the sin eaters' task any easier."},{"name":"FEARLADY03284","text":"Thank you again. You saved my life. Now, I'm sure a strapping <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> like you has little to fear, but I wouldn't linger long in this place. There's naught to be had here but cobwebs and memories."},{"name":"ALPHINAUD","text":"'Tis as the lady says. Many in these parts have abandoned their homes to live in Eulmore's shadow."},{"name":"ALPHINAUD","text":"Should the sin eaters descend upon this region, there are precious few with the strength to fight them off..."},{"name":"ALPHINAUD","text":"Speaking of which, what have you been told of these monsters?"},{"name":"ALPHINAUD","text":"Ah, yes. Alisaie would be well qualified to speak on the subject."},{"name":"ALPHINAUD","text":"Compared with Amh Araeng, Kholusia is almost a haven... But as you saw, we cannot let our guard down. Had you arrived but a few moments later, the sin eaters would have claimed another victim."},{"name":"ALPHINAUD","text":"A brief history, then...<br>'Twas not long after the Flood swallowed the better part of the world that the sin eaters first appeared, some beastly, some beauteous."},{"name":"ALPHINAUD","text":"Yet regardless of their form, all seem incapable of speech, and all are driven by the same insatiable appetite for mortal aether. They are predators─and we are their prey."},{"name":"ALPHINAUD","text":"Kholusia suffers from far fewer attacks than most regions, but even so, the list of the sin eaters' victims grows longer by the day. A tragedy without end..."},{"name":"ALPHINAUD","text":"Still, we have won a small victory this time, at least. Now, shall we press on?"},{"name":"ALPHINAUD","text":"We need to return to where the road forks and follow the path that leads west..."},{"name":"ALPHINAUD","text":"And here we are."},{"name":"GATETOWNMIDDLEAGE","text":"Mmm, do I savor it piece by piece, or gobble it all in one go...?"},{"name":"DREAMINGLADY03284","text":"Ah, Eulmore, you taunt me with your promised bounty..."},{"name":"ALPHINAUD","text":"Now you understand why my attempts to enter the city have thus far come to naught. The dubious privilege of residency must be won via a contest with ever-changing rules..."},{"name":"ALPHINAUD","text":"They say this policy has been in place for the past two decades, ever since Eulmore's current ruler came into power."},{"name":"ALPHINAUD","text":"Yet from what I have seen, it does more harm than good. Not only does it distract people from our shared struggle against the sin eaters, it robs them of their self-sufficiency. I have tried to propose ways they could improve their lot, but my words invariably fall on deaf ears."},{"name":"ALPHINAUD","text":"The attitude is so <span class=\"emphasis\">entrenched</span> now, I worry that─ Well, mayhap you should take a turn around Gatetown, and judge the situation for yourself."},{"name":"ALPHINAUD","text":"Go, take the measure of Gatetown. I shall wait here."},{"name":"SYSTEM","text":"A large pot bubbles over the flame. Pale chunks─meol, you realize─float in the otherwise plain broth."},{"name":"GATETOWNMIDDLEAGE","text":"Still here, are you? Can't blame you for wanting a slice of Eulmore's pie. If you ask me, you should ditch that sour-faced brat and make a home for yourself here!"},{"name":"GATETOWNMIDDLEAGE","text":"Gatetown's not much to look at, aye, but at least it's safe. And the meol is the best thing I've ever tasted!"},{"name":"DREAMINGLADY03284","text":"Just look at it... Can you imagine a more beautiful city?"},{"name":"DREAMINGLADY03284","text":"Every day, I dream of the life that waits for me inside those walls. Oh, will they <span class=\"emphasis\">ever</span> pick me...?"},{"name":"ALPHINAUD","text":"You've seen what Gatetown has to offer?"},{"name":"ALPHINAUD","text":"These people can no longer fend for themselves. They've become dependent on handouts of meol, and believe Eulmore is the answer to all their woes."},{"name":"ALPHINAUD","text":"Yet no matter how I frame my encouragement, they seem unwilling─nay, <span class=\"emphasis\">unable</span>─to conceive of any other way of life..."}],"reward":{"gil":1116},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68819]},"next":[68821,68888,68889,68890,68891]},"partials":[{"type":"npc","id":"1029809","obj":{"i":1029809,"n":"Alphinaud","l":2954,"q":1}},{"type":"npc","id":"1029814","obj":{"i":1029814,"n":"Alphinaud","l":2954,"q":2}},{"type":"quest","id":"68819","obj":{"i":68819,"n":"A Still Tide","g":8,"l":"Kholusia","s":50}},{"type":"quest","id":"68821","obj":{"i":68821,"n":"A Fickle Existence","g":8,"l":"Kholusia","s":70}},{"type":"quest","id":"68888","obj":{"i":68888,"n":"A Meating Long Overdue","g":114,"l":"Kholusia","s":1130}},{"type":"quest","id":"68889","obj":{"i":68889,"n":"Redolent Refuse","g":114,"l":"Kholusia","s":1140}},{"type":"quest","id":"68890","obj":{"i":68890,"n":"A Feeling in the Belly","g":114,"l":"Kholusia","s":1150}},{"type":"quest","id":"68891","obj":{"i":68891,"n":"Songstress of the Sea","g":114,"l":"Kholusia","s":1160}}]}