{"quest":{"name":"City of Final Pleasures","location":"Kholusia","id":68822,"patch":5.0,"sort":80,"icon":100893,"eventIcon":71201,"issuer":1029822,"target":1029830,"genre":8,"journal":["Alphinaud weighs the brush you received from Tristol, deep in thought.","With Tristol's brush in hand, Alphinaud lays out his plan to gain entry to Eulmore: he will pose as a painter, and you will play the role of his faithful assistant. Thus resolved, you depart for Gatetown, hoping that the manic jesters will soon return in search of a replacement artist...","After a short wait, your patience is rewarded. As predicted, the jongleurs emerge to recruit a new artist, and Alphinaud's act proves sufficiently convincing to earn you both an invitation into Eulmore.","As nonchalantly as you can, you pass through the gates, and take in the sights and sounds of the city. The red-garbed jester stands near the entrance, waiting to provide you with further instructions.","You listen carefully as your smirking guide explains the process by which Eulmoran citizenship is obtained. It seems your first step is to present yourself to the clerk at the Bureau of Immigration.","After describing the basics of Eulmoran society and your place within it, the immigration officer hands you a set of registration papers. You are to deliver them to the neighboring Bureau of Registration, where your status as citizens will be officially approved.","The registration officer soon approves your papers, but takes offense at your bodily odor. You are duly supplied with a bottle of perfume, and ushered next door to the Delousery, where you are expected to make thorough use of the bathing facilities.","You emerge from the shower, clean and refreshed. According to the clerk's instructions, you are now required to apply liberal quantities of the sweet-smelling perfume previously provided...","You dutifully splash yourself with the liquid, and the delicate scent of roses fills your nostrils. Lovely. As for Alphinaud, it appears he has yet to enter the Delousery...","After some encouragement, Alphinaud overcomes his bashfulness and plunges into the showers for a quick wash, emerging a short while later in a cloud of perfume. Now that you both smell as if you've wrestled in a flower bed instead of a drainage ditch, you are free to trouble Cornenne for directions to the Chai residence.","Cornenne gives you an overview of the city's layout and tells you where to find your new patrons. It seems your path leads up the steps to the Canopy, and thence into the Grand Dame's Parlor.","Despite some initial suspicion on Chai-Nuzz's part, you─and especially Alphinaud─appear to have made a favorable impression on the effusive Dulia-Chai, cementing your place in the city. At last, Eulmore's mysteries are yours to explore..."],"objectives":["Wait at the designated location.","Speak with the red jongleur.","Speak with the immigration officer.","Present your registration papers to the registration officer.","Scrub yourself clean in the Delousery showers.","Apply the sweet-smelling perfume.","Speak with Alphinaud.","Speak with Cornenne.","Speak with Dulia-Chai."],"dialogue":[{"name":"TRISTOL","text":"Should you make it into the city, have care what you say and do. I wouldn't want you to save my life only to lose your own..."},{"name":"ALPHINAUD","text":"They say kindness is its own reward, but Tristol has repaid us with a gift as timely as it was unexpected."},{"name":"ALPHINAUD","text":"We will, however, need to act upon his advice before another painter steps in to fill the vacancy. Thankfully, I do have some modest skill with a brush. Nothing approaching that of a true artist, of course, but enough to play the role, I would hope."},{"name":"ALPHINAUD","text":"As for you... Hmmm... Well...if you don't mind taking a subordinate role, mayhap you could pose as my assistant?"},{"name":"ALPHINAUD","text":"Then it is settled! All we need do now is return to Gatetown, and await the next appearance of those vile jesters."},{"name":"ALPHINAUD","text":"Now we wait. This should be as good a place as any."},{"name":"ALPHINAUD","text":"Here they come..."},{"name":"CLOWNOFRED","text":"Ladies and gentlemen! Your attention once more! What a day it's been for the folks at our door!"},{"name":"CLOWNOFBLUE","text":"We've welcomed a peddler who made pearls from a plum, and now we've a place for a painter of aplomb."},{"name":"CLOWNOFRED","text":"So come along and don't be slow! It's time to let your colors show!"},{"name":"ALPHINAUD","text":"I can paint. Portraits, at least. Landscapes and still lifes are so rarely commissioned these days..."},{"name":"CLOWNOFRED","text":"Oho, I thought I spied some new faces in the crowd. What fortune that you should feel at ease around an easel!"},{"name":"CLOWNOFBLUE","text":"What proof have you of your prowess? Any masterpieces on your person?"},{"name":"ALPHINAUD","text":"Sadly not. Everything I paint is soon sold. Such is the life of a working artist."},{"name":"ALPHINAUD","text":"I have only my brush to testify for me─though you will note that it has seen no small amount of service."},{"name":"CLOWNOFBLUE","text":"Aha, hoho, hm hm. Flecks of paint, both old and new, a tool much loved and much used."},{"name":"CLOWNOFRED","text":"Not a prop to be conjured on the hop! Very well! Come with us, and we'll put those talents to the test!"},{"name":"CLOWNOFBLUE","text":"And who is this hanger-on? Well-wisher or parasite?"},{"name":"ALPHINAUD","text":"Why, this is my assistant. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> whose unfailing support allows my art to flourish. I will go with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> or not at all!"},{"name":"CLOWNOFBLUE","text":"Parasite, then. We shall leave <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fate in the hands of your new employer─it matters not a whit to us."},{"name":"CLOWNOFRED","text":"And having filled our latest vacant space, we retire to Eulmore's sweet embrace!"},{"name":"GATETOWNPEOPLE03286","text":"(-Gatetown Residents-)..."},{"name":"CLOWNOFBLUE","text":"Oh, mercy me! The meol! We almost took our leave without leaving a loving token!"},{"name":"CLOWNOFRED","text":"We must empty the sacks ere we make our way back!"},{"name":"Q0","text":"Continue with the main scenario quest?"},{"name":"ALPHINAUD","text":"Eulmore. Finally..."},{"name":"CLOWNOFBLUE","text":"Looks even grander from this angle, eh? Eh?"},{"name":"CLOWNOFRED","text":"Welcome, welcome, to the city of final pleasures! Feel free to weep at its magnificence! ...No? Not even a single tear? Moving right along, then!"},{"name":"CLOWNOFRED","text":"Our first task is to register you as residents─you know, make it all nice and official. We'll smooth the way, so you just need to put on your happy faces and head through to Joyous Hall."},{"name":"CLOWNOFRED","text":"The Bureau of Immigration is in the first room on the left side of the passage. Declare your name and occupation in <span class=\"emphasis\">a nice loud voice</span>─the clerks will tell you where to go from there."},{"name":"CLOWNOFRED","text":"Oh, and pay no mind to those folk off to the side of the road. Much like the hopefuls in Gatetown, they haven't earned the right to enter the city proper."},{"name":"CLOWNOFRED","text":"If, however, you enjoy basking in the envy of your fellow man, then by all means...<span class=\"emphasis\">take your time</span>. But why waste another moment? Go! Enjoy the beginning of your new life in paradise!"},{"name":"ALPHINAUD","text":"The Bureau of Immigration, was it? I suppose we had better show ourselves willing for the time being..."},{"name":"BUREAUOFIMMIGRATION","text":"Welcome to Eulmore, fortunate friends! May I have your names?"},{"name":"ALPHINAUD","text":"I am Alphinaud, an artist, and this is <span class=\"highlight\">Forename</span>, my assistant."},{"name":"BUREAUOFIMMIGRATION","text":"Ah, yes, I was informed of your imminent arrival. We can forgo the usual interview and begin processing your registration papers forthwith."},{"name":"BUREAUOFIMMIGRATION","text":"Now, the citizens of Eulmore are divided into two classes. There are the “free,” who are blessed with the favor of Lord Vauthry, and the “bonded,” who work in the employ of the free."},{"name":"BUREAUOFIMMIGRATION","text":"You will be joining the ranks of the bonded. Your duties are to serve a patron in the capacity for which you were chosen─in your case, painting pretty pictures."},{"name":"BUREAUOFIMMIGRATION","text":"Should your patron dismiss you for any reason, you must find another sponsor among the free, or accept work as a general laborer."},{"name":"ALPHINAUD","text":"I see. And might you tell us something of the patron we are to serve?"},{"name":"BUREAUOFIMMIGRATION","text":"The <span class=\"emphasis\">two</span> patrons, actually. Chai-Nuzz and Dulia-Chai─a Mystel couple whom most refer to as the “Chais.”"},{"name":"BUREAUOFIMMIGRATION","text":"They are both gentle souls, but I would ask that you conduct yourself with respect and humility...for your own sake as much as theirs."},{"name":"BUREAUOFIMMIGRATION","text":"Now. A moment, please, while I complete the relevant paperwork..."},{"name":"BUREAUOFIMMIGRATION","text":"All in order. These are your registration documents."},{"name":"BUREAUOFIMMIGRATION","text":"Take those papers next door and submit them to the clerk. Once they've been stamped, you will officially be Eulmoran citizens."},{"name":"BUREAUOFIMMIGRATION","text":"Enjoy your new life in paradise!"},{"name":"BUREAUOFIMMIGRATION","text":"Have you submitted your papers to the Bureau of Registration? Everything in its proper place!"},{"name":"BUREAUOFREGISTRATION","text":"Welcome to the Bureau of Registration. Papers, please."},{"name":"BUREAUOFREGISTRATION","text":"What have we here...?<br>“Alphinaud, artist. <span class=\"highlight\">Forename</span>, artist's assistant. To be employed in the service of Lord Chai-Nuzz and Lady Dulia-Chai...”"},{"name":"BUREAUOFREGISTRATION","text":"Yes, everything seems to be in order! Your registration is hereby approved."},{"name":"BUREAUOFREGISTRATION","text":"I think it best that we deliver you to the Chai residence before─"},{"name":"BUREAUOFREGISTRATION","text":"&lt;sniff&gt; Hm? &lt;sniff&gt; &lt;sniff&gt; Oh dear..."},{"name":"BUREAUOFREGISTRATION","text":"You smell...hideous!"},{"name":"BUREAUOFREGISTRATION","text":"Did you crawl here through a ditch? It's like an unholy miasma of dust and sweat and the musk of some unwashed beast!"},{"name":"BUREAUOFREGISTRATION","text":"Proceed directly to the Delousery next door and scrub yourselves clean. Use whichever showers are free."},{"name":"BUREAUOFREGISTRATION","text":"After you've rinsed away that stench, you'll want to splash yourselves with this perfume. <span class=\"emphasis\">Liberally</span>."},{"name":"BUREAUOFREGISTRATION","text":"Once you've made yourself presentable, <span class=\"emphasis\">then</span> you may proceed to the Chai residence. Cornenne, the guard by the stairs, will give you directions."},{"name":"ALPHINAUD","text":"I hadn't realized we were so...aromatic."},{"name":"ALPHINAUD","text":"We're to bathe in here, then...?"},{"name":"BUREAUOFREGISTRATION","text":"A clean Eulmoran is a happy Eulmoran! Don't forget to scrub behind your ears!"},{"name":"SYSTEM","text":"You rinse yourself clean in the stream of water..."},{"name":"SYSTEM","text":"You apply the perfume as directed, and the delicate scent of roses fills the air..."},{"name":"ALPHINAUD","text":"Oh, you've showered and dressed already, have you...?"},{"name":"ALPHINAUD","text":"Is it not─ Th-That is to say... Ahem. It seems rather...<span class=\"emphasis\">exposed</span> for one's ablutions, does it not...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Hurry up and shower, stinky."},{"name":"A1","text":"What would Estinien say...?"},{"name":"A1","text":"Alisaie would have been drying her hair by now."},{"name":"ALPHINAUD","text":"Fine. Just a quick rinse, then..."},{"name":"ALPHINAUD","text":"Good gods... You will mention nothing of this! Swear to me!"},{"name":"ALPHINAUD","text":"...Wouldn't she just. Very well...I shall endeavor to emulate her boldness, then. Courage, Alphinaud!"},{"name":"ALPHINAUD","text":"Well, that was bracing! I believe the lingering smells of the road have been successfully expunged."},{"name":"ALPHINAUD","text":"Shall we go and present ourselves to our new patrons, then?"},{"name":"ALPHINAUD","text":"We'll need directions to the Chai residence."},{"name":"BUREAUOFREGISTRATION","text":"Ah, what a heavenly fragrance!"},{"name":"CORNENN","text":"You're looking to present yourselves to the Chais, are you? Let me explain how the city's laid out, then. Imagine three layers, one on top of the other..."},{"name":"CORNENN","text":"This layer here is called the Buttress. Above us is the Understory, where the military has its headquarters. And above <span class=\"emphasis\">that</span>, you've got the Canopy, which is where the free citizens of Eulmore spend their days."},{"name":"CORNENN","text":"So if you want to find your new patrons, you'll need to keep climbing until you run out of stairs, then look for the “Grand Dame's Parlor.” They'll be in there, like as not."},{"name":"CORNENN","text":"Up the stairs to the Canopy, I said! The Chais should be in the Grand Dame's Parlor."}],"reward":{"gil":1590},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68821]},"next":[68823,69139]},"partials":[{"type":"npc","id":"1029822","obj":{"i":1029822,"n":"Alphinaud","l":2954,"q":1}},{"type":"npc","id":"1029830","obj":{"i":1029830,"n":"Dulia-Chai","l":2952,"q":2}},{"type":"quest","id":"68821","obj":{"i":68821,"n":"A Fickle Existence","g":8,"l":"Kholusia","s":70}},{"type":"quest","id":"68823","obj":{"i":68823,"n":"Free to Sightsee","g":8,"l":"Eulmore","s":90}},{"type":"quest","id":"69139","obj":{"i":69139,"n":"The Boutique Always Wins","g":0,"l":"Eulmore","s":0,"f":1}}]}