{"quest":{"name":"Free to Sightsee","location":"Eulmore","id":68823,"patch":5.0,"sort":90,"eventIcon":71201,"issuer":1029832,"target":1029833,"genre":8,"journal":["Alphinaud would send you into the city to explore."],"objectives":["Gather information in the Canopy.","Search for the ardent attendant.","Speak with the amiable maiden."],"dialogue":[{"name":"LADY03287","text":"That silly oaf, where could he be...?"},{"name":"ALPHINAUD","text":"Now you've the opportunity to <span class=\"emphasis\">experience</span> Eulmore, I suggest you make the most of it. Explore the city, top to bottom."},{"name":"ALPHINAUD","text":"In other words, I would start with the Canopy and go from there. Try wandering around the market stalls, mayhap...? Such places are usually filled with colorful characters, only too eager to share local gossip with a friendly visitor."},{"name":"ALPHINAUD","text":"...I would appreciate it, of course, if you could share any discoveries with me in turn. We should both learn as much as possible about our, ahem, “new place of residence.”"},{"name":"ALPHINAUD","text":"I shall remain behind and set up my painting paraphernalia. Very carefully and deliberately. It could take some time..."},{"name":"LADY03287","text":"Oh, hello there. A fresh register, are we? You seem a little lost."},{"name":"LADY03287","text":"Well, 'tis lovely to make your acquaintance. Ahem, speaking of acquaintances, you wouldn't happen to have run into my attendant on your wanderings, would you? Big strong lad? Long hair, tied back?"},{"name":"LADY03287","text":"He was escorting me on a shopping errand when I realized I'd dropped my handkerchief. And now I've been waiting here all alone while he's been off searching for it."},{"name":"LADY03287","text":"I'm not terribly fond of being alone. If you do see him, I would be obliged if you could pass on this message: forget the silly handkerchief and return to my side at once!"},{"name":"LADY03287","text":"I think I may have lost the handkerchief in the hallway leading into the plaza. My attendant mentioned he would try looking there first."},{"name":"EMPLOYEE03287","text":"Wicked white, that was too close!"},{"name":"EMPLOYEE03287","text":"Thank you, friend. I don't know what I would've done if you hadn't come along."},{"name":"EMPLOYEE03287","text":"I was trying to rescue my lady's handkerchief, you see. The wind must have blown it over the edge, but luckily it caught on something. I thought if I could just stretch out far enough..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You risked your life for a scrap of cloth?"},{"name":"A1","text":"You must think highly of your mistress."},{"name":"EMPLOYEE03287","text":"It's not just a scrap of cloth! Not if it belongs to <span class=\"emphasis\">her</span>."},{"name":"EMPLOYEE03287","text":"I would risk my life and more to spare my mistress but a single moment of sadness."},{"name":"EMPLOYEE03287","text":"She is my entire world! Without her, I am <span class=\"emphasis\">nothing</span>."},{"name":"EMPLOYEE03287","text":"When I first came to Eulmore, I thought only of improving my lot in life."},{"name":"EMPLOYEE03287","text":"But there was so much more to this city than wealth and plenty. There is no war here, no conflict... The residents all treat each other with warmth and respect."},{"name":"EMPLOYEE03287","text":"My mistress has been ever so kind to me, and I can think of no other place in Kholusia where I could possibly be happier!"},{"name":"EMPLOYEE03287","text":"&lt;cough&gt; Sorry, I might've gotten a bit carried away. I find it hard to stop when I start counting my blessings these days."},{"name":"EMPLOYEE03287","text":"Please, you should come with me to meet my lady. Once she hears of your deed, you'll be witness to her generosity firsthand."},{"name":"EMPLOYEE03287","text":"...What!? Lonely, you say!?"},{"name":"EMPLOYEE03287","text":"Curse my clumsy feet! I must return to her immediately!"},{"name":"EMPLOYEE03287","text":"I will never leave my lady's side again!"},{"name":"LADY03287","text":"My attendant told me everything. I am so very grateful you were there to offer your assistance!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You seem a dedicated patron..."},{"name":"A2","text":"You value him highly, then..."},{"name":"LADY03287","text":"Oh, my attitude is naught unusual, I assure you. Without the efforts of our bonded residents, we free citizens would not enjoy the pleasures of our daily lives. They are deserving of our unending gratitude."},{"name":"LADY03287","text":"As if he were a member of my own family! I could not live the wonderful life I lead without him. We free citizens owe the bonded our unending gratitude."},{"name":"LADY03287","text":"Mayhap in another society, our different standing would breed prejudice or resentment. But in Eulmore, a most glorious measure is in place to avert such unpleasantness."},{"name":"LADY03287","text":"Part of that measure requires that the free surrender their fortunes. Upon registration, all of our property─financial, intellectual, or otherwise─is given over to the city."},{"name":"LADY03287","text":"In exchange, we are provided with ample funds and commodities to live a life of pampered luxury."},{"name":"LADY03287","text":"Being liberated from the concern of earning coin has an almost miraculous effect on people's outlook. There are no rivals to compete against, only fellow residents with whom to enjoy our tranquil existence."},{"name":"LADY03287","text":"Now, if you'll excuse us, I must see what the markets have to offer as a reward for the return of my handkerchief. Oh, and I've not forgotten you, of course, our courageous messenger-turned-rescuer!"}],"reward":{"gil":715,"items":[{"id":26829}]},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68822]},"next":[68824]},"partials":[{"type":"npc","id":"1029832","obj":{"i":1029832,"n":"Alphinaud","l":2952,"q":1}},{"type":"npc","id":"1029833","obj":{"i":1029833,"n":"Amiable Maiden","l":2952,"q":2}},{"type":"item","id":"26829","obj":{"i":26829,"n":"White Oak Foot Gear Coffer (IL 385)","l":1,"c":26562,"t":61}},{"type":"quest","id":"68822","obj":{"i":68822,"n":"City of Final Pleasures","g":8,"l":"Kholusia","s":80}},{"type":"quest","id":"68824","obj":{"i":68824,"n":"A Taste of Honey","g":8,"l":"Eulmore","s":100}}]}