{"quest":{"name":"A Purchase of Fruit","location":"Amh Araeng","id":68833,"patch":5.0,"sort":190,"eventIcon":71201,"issuer":1029001,"target":1029001,"genre":8,"journal":["Tesleen has the air of a woman being pulled in ten directions at once."],"objectives":["Tend to Pawnil.","Tend to Todden.","Tend to Halric.","Speak with Tesleen.","Speak with Rhon Ron.","Speak with Alisaie.","Give the nectarine to Tesleen."],"dialogue":[{"name":"ALISAIE","text":"This is what I get for sharing! Maybe I'll just head out on another patrol..."},{"name":"TESLEEN","text":"I'd love to lay out a welcome meal, but the duties I put off when I went to the market are still waiting for me..."},{"name":"TESLEEN","text":"Argh! There are a hundred and one things that need doing! I'm sorry, but would you mind waiting here with Alisaie?"},{"name":"ALISAIE","text":"What, and twiddle our thumbs while you work yourself to death? Surely there's something we can help you with?"},{"name":"TESLEEN","text":"...I <span class=\"emphasis\">could</span> do with a hand, it's true. Thank you. You can start by helping me sort out the larder, Alisaie."},{"name":"TESLEEN","text":"While we do that, could you tend to a few patients, perhaps? There are three in particular I meant to visit─it's just a matter of saying a few words to them, and seeing that their skin isn't caked in sand."},{"name":"TESLEEN","text":"Their names are Pawnil, Todden, and Halric. They may not give much in the way of a response, but I promise they'll be pleased to meet someone new!"},{"name":"ALISAIE","text":"I would speak more on the subject of sin eaters, but let's see these tasks finished first."},{"name":"TESLEEN","text":"It will do them good to see a new face. There's not much in the way of novelty around here to distract them from their worries."},{"name":"PAWNIL","text":"Th-Thank...you..."},{"name":"PAWNIL","text":"Y-You're Alisaie's...friend? That's...good..."},{"name":"TODDEN","text":"......"},{"name":"TODDEN","text":"Todden glances up at you blankly, but you notice the tension in his face ease slightly."},{"name":"TODDEN","text":"......"},{"name":"SYSTEM","text":"Halric remains utterly still as you wipe the sand from his cheek."},{"name":"SYSTEM","text":"The texture of his skin has hardened into something akin to plaster..."},{"name":"HALRIC","text":"......"},{"name":"ALISAIE","text":"Your work is done, then?"},{"name":"TESLEEN","text":"You've seen to the patients? How were they?"},{"name":"TESLEEN","text":"...Good. That's good. I knew they would enjoy meeting you."},{"name":"TESLEEN","text":"I am concerned about Halric, though... I'll have to speak with the other carers, but I think his time may be near."},{"name":"ALISAIE","text":"We shall leave you to have that discussion, then. I was going to take <span class=\"highlight\">Forename</span> to Mord Souq if you have any errands there that need doing...?"},{"name":"TESLEEN","text":"Well, I suppose there is one thing..."},{"name":"TESLEEN","text":"Would you pick up a nectarine from the markets, please? Cassard's caravan just passed through, so Rhon Ron should have some fresh fruit."},{"name":"ALISAIE","text":"Come, then, <span class=\"highlight\">Forename</span>─there's something I want you to see. Right after we stop at Rhon Ron's stall, of course."},{"name":"TESLEEN","text":"Hm? Oh, my jobs are all under control now, thank you. Go and spend some time with Alisaie."},{"name":"ALISAIE","text":"Let's see about that nectarine, shall we?"},{"name":"RHONRON","text":"Oho, back again, are you? You need another taste of Rhon Ron's wares?"},{"name":"ALISAIE","text":"Actually, we're looking to buy a nectarine. Do you have any in stock?"},{"name":"RHONRON","text":"Oh, yes! Nectarines, peaches, grapes! Fresh and juicy!"},{"name":"RHONRON","text":"Hm... Given how richly you cracked your coinpurse with me, I <span class=\"emphasis\">might</span> still owe you food... Here, take this one! Free of charge!"},{"name":"ALISAIE","text":"Gods, I've never seen a Mord merchant give away something for nothing before. How much coin did you spend here...?"},{"name":"ALISAIE","text":"Oh yes, I'll take a jar of honeyed worms as well."},{"name":"ALISAIE","text":"Hm? Oh no! They're not for me! It's...an offering of sorts."},{"name":"ALISAIE","text":"...Ahem, the worms, if you please?"},{"name":"RHONRON","text":"Only the best wrigglers for you! Come again, my friends!"},{"name":"ALISAIE","text":"Right, that's our shopping chores taken care of. Let's head up past the aetheryte to the main tower─the view I want to show you can only be seen from its very top."},{"name":"RHONRON","text":"See you again soon! Your belly won't let you stay away!"},{"name":"MORDGUARD","text":"&lt;yawn&gt; You need something?"},{"name":"ALISAIE","text":"Here are your precious worms. That buys us a trip to the top of the tower, does it not?"},{"name":"MORDGUARD","text":"&lt;gasp&gt; Glazed Wrigglers! You actually brought them!"},{"name":"MORDGUARD","text":"I really shouldn't let you, but...just this once, all right? Only once!"},{"name":"ALISAIE","text":"Never fails. Shall we?"},{"name":"ALISAIE","text":"I'm glad I was able to show you that. When it comes to understanding the catastrophe which befell the First, one glimpse of the empty wasteland beyond the wall is worth more than an hour of Urianger's lecturing."},{"name":"ALISAIE","text":"And I needed you to know beyond a doubt that Tesleen has no other choice. The nectarine will be a kindness."},{"name":"ALISAIE","text":"It isn't just the threat posed to others... When a person becomes an eater, the pain appears to be excruciating."},{"name":"ALISAIE","text":"The carers are truly fond of their wards, and would spare them that suffering. It is their way of fighting back against a fate worse than death."},{"name":"ALISAIE","text":"Go ahead. I think she's been waiting for us."},{"name":"TESLEEN","text":"You're back. I hope you had a nice time. Did you...manage to find a nectarine?"},{"name":"TESLEEN","text":"Thank you. Alisaie's explained why I wanted this, has she? I can see it in your eyes."},{"name":"TESLEEN","text":"But we may not need it just yet. I spoke with the others, and we've decided to keep an eye on Halric for now."},{"name":"TESLEEN","text":"Thanks to you, though, if his time does come suddenly, we'll be ready to send him on his way with a taste of happier days..."}],"reward":{"gil":1445},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68832]},"next":[68834]},"partials":[{"type":"npc","id":"1029001","obj":{"i":1029001,"n":"Tesleen","l":2955,"q":4}},{"type":"quest","id":"68832","obj":{"i":68832,"n":"Culling Their Ranks","g":8,"l":"Amh Araeng","s":180}},{"type":"quest","id":"68834","obj":{"i":68834,"n":"The Time Left to Us","g":8,"l":"Amh Araeng","s":200}}]}