{"quest":{"name":"A Desert Crossing","location":"Amh Araeng","id":68830,"patch":5.0,"sort":160,"eventIcon":71201,"issuer":1028977,"target":1028980,"genre":8,"journal":["Tesleen is eager to set off."],"objectives":["Talk with Tesleen.","Defeat any coyotes that threaten Tesleen.","Speak with Tesleen.","Scout the area ahead and slay any other coyotes.","Talk with Tesleen."],"dialogue":[{"name":"CASSARD","text":"Take care with your desert crossing and good fortune with meeting your friend! I'll be around when you're ready to head back to the Exarch."},{"name":"TESLEEN","text":"Alisaie has been desperate to see you, <span class=\"highlight\">Forename</span>, so let's get you to her sooner rather than later!"},{"name":"TESLEEN","text":"The Inn isn't too hard to find, really─you can actually see the top of the rock spires from here."},{"name":"TESLEEN","text":"We just need to swing around the ridge, then head south. Come on, I'll get my supplies together and meet you outside!"},{"name":"TESLEEN","text":"All set? Oh, I should probably mention the wildlife..."},{"name":"TESLEEN","text":"While most of them will leave you be if you keep your distance, the local coyotes have learned to prey on folk heading home from the markets."},{"name":"TESLEEN","text":"I can usually swing a sword well enough to fend them off, but I may have loaded myself down with too many bargains today..."},{"name":"TESLEEN","text":"Do you think you can handle any beasts that try to make a meal of us?"},{"name":"TESLEEN","text":"I thought you might. Alisaie was always saying how much y─ Um, I mean, let's get going, shall we?"},{"name":"TESLEEN","text":"Speak of the curs...!"},{"name":"TESLEEN","text":"Sorry, there wasn't much time to shout a warning. Were you bitten? Those things can be nasty."},{"name":"TESLEEN","text":"And yet hardly a match for you, it seems! I'd always thought Alisaie was strong, but in her mind, she was never...hmmm. Now it makes sense."},{"name":"TESLEEN","text":"Ahem, well we should push on! It might be best if you scout ahead and clear out any coyotes that have our scent."},{"name":"TESLEEN","text":"I'll wait here so you can fight without any distractions!"},{"name":"TESLEEN","text":"It might save time if you could head down past the ridge and clear out any coyotes lurking nearby."},{"name":"TESLEEN","text":"Oh, thank goodness you're back. I could hear the howling and snarling from here... Frightful creatures."},{"name":"TESLEEN","text":"Let's hope the rest have seen your handiwork, and know to avoid us now. I need to get these supplies back to the Inn!"},{"name":"TESLEEN","text":"This is it! Thanks to you, I didn't have to drop my shopping even once! Come to think of it, I'm glad I didn't make the trip alone..."},{"name":"TESLEEN","text":"It seems <span class=\"emphasis\">you</span> ended up escorting <span class=\"emphasis\">me</span>! I'll have to repay the favor somehow, but first, let's head inside, shall we?"},{"name":"TESLEEN","text":"Welcome to the Inn at Journey's Head. You might be our first visitor from the Crystarium since Alisaie arrived."},{"name":"TESLEEN","text":"It's not much, but it's home for the afflicted and a handful of carers."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The afflicted...?"},{"name":"A1","text":"This illness isn't contagious, is it?"},{"name":"A1","text":"I have some skill with healing..."},{"name":"TESLEEN","text":"You...don't know?"},{"name":"TESLEEN","text":"Contagious...? Well, no, not as far as we know."},{"name":"TESLEEN","text":"I'm not sure you can help in this case, but...that's good to know."},{"name":"TESLEEN","text":"I don't think I've met anyone besides Alisaie who was so unfamiliar with our situation here. Most folk have grown up knowing someone who knew someone..."},{"name":"TESLEEN","text":"Hm. I might leave out something obvious, so it may be best to have Alisaie give you the full explanation."}],"reward":{"gil":934},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68829]},"next":[68831]},"partials":[{"type":"npc","id":"1028977","obj":{"i":1028977,"n":"Tesleen","l":2955,"q":1}},{"type":"npc","id":"1028980","obj":{"i":1028980,"n":"Tesleen","l":2955,"q":1}},{"type":"quest","id":"68829","obj":{"i":68829,"n":"Working Off the Meal","g":8,"l":"Amh Araeng","s":150}},{"type":"quest","id":"68831","obj":{"i":68831,"n":"Following in Her Footprints","g":8,"l":"Amh Araeng","s":170}}]}