{"quest":{"name":"Tears on the Sand","location":"Amh Araeng","id":68835,"patch":5.0,"sort":210,"eventIcon":71201,"issuer":1029010,"target":1029015,"genre":8,"journal":["Alisaie is lost in grief."],"objectives":["Speak with Alisaie at the Red Serai.","Speak with Alisaie.","Speak with Alisaie in the Ocular."],"dialogue":[{"name":"HALRIC","text":"......"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Alisaie..."},{"name":"A1","text":"I've spoken with the carers."},{"name":"ALISAIE","text":"...Thank you. What you're doing, it...it means a lot to them. To me."},{"name":"WILLFORT","text":"...Sorry to interrupt. We, uh... We realized we hadn't thanked you for rescuing Halric."},{"name":"WILLFORT","text":"...You weren't hurt at all, were you?"},{"name":"ALISAIE","text":"Hurt...? There wasn't even a fight. I was too late. Too <span class=\"emphasis\">slow</span>.<br>And I thought I could protect you..."},{"name":"CASSANA","text":"You can't blame yourself for things beyond your control. You brought Halric back safe and sound─no one could have done any more."},{"name":"ALISAIE","text":"I'm sorry, but I've come to a decision: I won't be continuing in my role here."},{"name":"ALISAIE","text":"I hope you will forgive me for leaving you...and that you will delay Halric's last meal for as long as you possibly can."},{"name":"ALISAIE","text":"Not until it's too late, of course, just...give him what time you can."},{"name":"WILLFORT","text":"We always do."},{"name":"ALISAIE","text":"Of course. She would have done the same."},{"name":"ALISAIE","text":"Farewell, Halric. Keep Tesleen's words close to your heart."},{"name":"CASSANA","text":"Wait! You're leaving this very moment? I understand how you must feel, but surely this is a bit hasty? Do you even have anywhere to go?"},{"name":"ALISAIE","text":"I have a destination in mind, yes. And a purpose."},{"name":"ALISAIE","text":"This damned Light, building without cease... It's the reason we can't save those corrupted by the eaters."},{"name":"ALISAIE","text":"But what if we corrected the balance? Even if it were only little by little─even if it took <span class=\"emphasis\">years</span>─it would surely make things better."},{"name":"WILLFORT","text":"Now, hold on there. Everyone knows there's too much Light, but how could you ever hope to get rid of it? You'd have to change the whole world!"},{"name":"ALISAIE","text":"That's right..."},{"name":"ALISAIE","text":"We should return to the Crystarium. I may not be able to repel the eaters on my own...but I can still use the skills I have gained here to hurt them."},{"name":"WILLFORT","text":"Poor Alisaie... She was so close to Tesleen... I only hope she doesn't do something foolish."},{"name":"CASSARD","text":"<span class=\"highlight\">Forename</span>! Good to see you again! You look like you've a story or two to tell... But I sense you'd sooner get back to the Crystarium."},{"name":"ALISAIE","text":"Forgive me, <span class=\"highlight\">Forename</span>─I couldn't stay there a moment longer."},{"name":"ALISAIE","text":"But I was serious about what I said. While the men and women at the Inn battle against this blight with kindness, I must fight it in my own way. With steel."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"From Eorzea's sword in the darkness...to Norvrandt's sword in the light?"},{"name":"A2","text":"......"},{"name":"ALISAIE","text":"Gods above. It feels like an age ago now..."},{"name":"CASSARD","text":"Miss Alisaie!? ...Is there anything I can get you?"},{"name":"ALISAIE","text":"Your swiftest amaro! I need to return to the Crystarium─immediately!"},{"name":"CASSARD","text":"A-As you wish!"},{"name":"CASSARD","text":"Ah, it's good to be back. Mord Souq has many charms, but there's nothing like a proper bed to recover from a long journey...as I'm sure you'd agree."},{"name":"ALISAIE","text":"Ugh, remind me to wear goggles if we ever fly over Amh Araeng again. I've barely gotten the sand out of my eyes."},{"name":"ALISAIE","text":"...But the wind did help to clear my head at least."},{"name":"ALISAIE","text":"I think I'm ready to meet with the Exarch. We need to talk about how we're going to wipe the sin eaters out. Shall we?"},{"name":"MYSTERYVOICE","text":"I see you were reunited with Alisaie, but I daresay you found little else to celebrate in Amh Araeng..."},{"name":"MALPHINAUD","text":"Welcome back, <span class=\"highlight\">Forename</span>. You will have to share the tale of your journey once the two of you are suitably rested."},{"name":"ALISAIE","text":"Thank you for seeking me out, <span class=\"highlight\">Forename</span>─it meant a lot to have you there at my side.<br>...I was tempted to set off again the moment we had decided upon a direction, but you have still to visit Alphinaud, haven't you?"},{"name":"ALISAIE","text":"And if I know my brother, he'll be on the cusp of discovering something vital to our success─if he hasn't already. I'm content to stay here and consider our options for the time being─but don't keep me waiting too long, eh?"},{"name":"ALISAIE","text":"Thank you for seeking me out, <span class=\"highlight\">Forename</span>─it meant a lot to have you there at my side. And looking at Alphinaud, I'd say he's as eager to begin this discussion as I am."},{"name":"ALISAIE","text":"I say we lay our experiences before the Exarch, and step back to see what kind of picture they make. Then we can decide where to go from here."}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68834]},"next":[68836]},"partials":[{"type":"npc","id":"1029010","obj":{"i":1029010,"n":"Alisaie","l":2955,"q":1}},{"type":"npc","id":"1029015","obj":{"i":1029015,"n":"Alisaie","l":3223,"q":1}},{"type":"quest","id":"68834","obj":{"i":68834,"n":"The Time Left to Us","g":8,"l":"Amh Araeng","s":200}},{"type":"quest","id":"68836","obj":{"i":68836,"n":"The Lightwardens","g":8,"l":"The Ocular","s":220}}]}