{"quest":{"name":"The Time Left to Us","location":"Amh Araeng","id":68834,"patch":5.0,"sort":200,"icon":100897,"eventIcon":71201,"issuer":1029001,"target":1029012,"genre":8,"journal":["Tesleen makes an effort to smile brightly.","Determined not to inflict her own feelings of gloom on the patients, Tesleen suggests a meal to lighten the mood. You are duly treated to a delicious stew, which does much to restore your spirits. Even as you consider a second helping, however, a frantic carer rushes up to report that Halric has gone missing...","Time being of the essence, Alisaie suggests assigning search areas, and Tesleen claims the territory to the east. Alisaie herself volunteers to take the north and the west, leaving you to scour everything to the south.","You find no sign of the missing Halric. There are, however, still plenty of other places to the south of the Inn where a young boy might wander unseen...","As you scan your surroundings in search of Halric, you stray into the path of a ravenous sin eater. But the predator is soon made to regret its choice of prey, and you resume seeking the Inn's wayward patient.","A short while later, you stumble into a breathless Alisaie, whose own search has proven similarly fruitless. As you wonder where to look next, a large sin eater flies overhead, and you decide to give chase in the hope that the creature might lead you to your quarry...as indeed it does. Alas, you arrive too late to prevent Tesleen from sacrificing herself to save the boy, and so bear witness to her horrifying transformation. The road back to the Inn is a somber one indeed...","With Alisaie still reeling from the loss of her friend, it falls to you to console the Inn's surviving carers.","Tesleen's colleagues are understandably devastated by the news of her fate, but they seem comforted by your stoic presence nonetheless. This does little to assuage your guilt at failing to prevent the atrocity, however. You wonder what Halric must be feeling beneath that silent mask...","As before, your attempts to engage the boy are met with a blank stare and nothing more. This sudden tragedy has cast a pall of hopelessness over the Inn and its residents─everywhere you turn, you see faces etched with grief and sadness."],"objectives":["Speak with Tesleen.","Search the area for Halric.","Continue searching for Halric.","Speak with Alisaie.","Speak with the carers.","Speak with Halric."],"dialogue":[{"name":"ALISAIE","text":"Thank you for understanding..."},{"name":"TESLEEN","text":"Well, nothing is going to happen for a little while yet, so let's see if we can't lighten the mood. We don't want our gloomy faces worrying the patients!"},{"name":"TESLEEN","text":"I think it's time for that welcome meal, don't you? Take a seat, and I'll make us a nice stew!"},{"name":"ALISAIE","text":"Where could he have gone!?"},{"name":"JOURNEYSHEADNURSE","text":"This is my fault. The patients were acting strangely, and I let it distract me..."},{"name":"TESLEEN","text":"<span class=\"highlight\">Forename</span>, Alisaie─we have to go look for Halric!"},{"name":"TESLEEN","text":"I don't know what's gotten into him, but if he's wandering out there alone..."},{"name":"ALISAIE","text":"We'll assign search areas and split up. Any idea where he might be headed?"},{"name":"TESLEEN","text":"No, he's never done anything like this before. But it can't be a coincidence that the other patients are suddenly so agitated. They can sense something..."},{"name":"TESLEEN","text":"In any case, let's keep the search close to the Inn. Halric isn't very sure on his feet, so he won't have gone far. I'll search the east side!"},{"name":"TESLEEN","text":"Please, Halric... Please be all right...!"},{"name":"ALISAIE","text":"I'll cover the north and west, then. You take everything from here to the south!"},{"name":"PAWNIL","text":"They come... Come for new kin..."},{"name":"TODDEN","text":"Ahhh..."},{"name":"VOYNE","text":"I don't...? This isn't... Ugh..."},{"name":"SYSTEM","text":"You see no sign of Halric. Maybe he went further west..."},{"name":"SYSTEM","text":"You scan your surroundings in search of Halric...and suddenly find yourself under attack!"},{"name":"HALRIC","text":"......"},{"name":"PAWNIL","text":"Going away, now... Further and further..."},{"name":"TODDEN","text":"Uhhh..."},{"name":"VOYNE","text":"Claimed... A new one..."},{"name":"ALISAIE","text":"I..."},{"name":"ALISAIE","text":"I'm sorry, <span class=\"highlight\">Forename</span>. I tried to tell the carers what happened, but..."},{"name":"ALISAIE","text":"...I can't be the shoulder they lean on. Not like this."},{"name":"ALISAIE","text":"......"},{"name":"CASSANA","text":"&lt;sob&gt; ...It's just so <span class=\"emphasis\">unfair</span>."},{"name":"CASSANA","text":"Tesleen was always so cheery with the patients, telling them not to be scared, that there wouldn't be any pain..."},{"name":"CASSANA","text":"Of all the people in the world to suffer such a fate!"},{"name":"CASSANA","text":"Oh, Tesleen... You thought only of others...and this was your reward."},{"name":"WILLFORT","text":"I imagine you're just as shocked as the rest of us, so I appreciate what you're doing here."},{"name":"WILLFORT","text":"Me? I can barely... I don't have the words. Without a body, we can't even give her a proper burial! And she <span class=\"emphasis\">cared</span> about that sort of thing─about giving people the chance to say their good-byes..."},{"name":"WILLFORT","text":"We'll manage, somehow. Someone needs to care for the patients. We're all they've got..."},{"name":"HALRIC","text":"......"},{"name":"SYSTEM","text":"Halric is as unresponsive as ever. He stands motionless, staring up into the sky where the sin eaters made their escape..."}],"reward":{"gil":1189},"reqs":{"jobs":[{"lvl":70,"id":142}],"quests":[68833]},"next":[68835]},"partials":[{"type":"npc","id":"1029001","obj":{"i":1029001,"n":"Tesleen","l":2955,"q":4}},{"type":"npc","id":"1029012","obj":{"i":1029012,"n":"Halric","l":2955,"q":1}},{"type":"quest","id":"68833","obj":{"i":68833,"n":"A Purchase of Fruit","g":8,"l":"Amh Araeng","s":190}},{"type":"quest","id":"68835","obj":{"i":68835,"n":"Tears on the Sand","g":8,"l":"Amh Araeng","s":210}}]}