{"quest":{"name":"The Lightwardens","location":"The Ocular","id":68836,"patch":5.0,"sort":220,"icon":100898,"eventIcon":71201,"issuer":1028923,"target":1029846,"genre":8,"journal":["The Crystal Exarch welcomes you back to the Crystarium.","Having listened intently to your experiences with the Leveilleur twins, the Exarch reveals the existence of powerful beings known as Lightwardens, whose destruction he believes is necessary to save the First and avert the Eighth Umbral Calamity. Soon after, your discussion is interrupted by a breathless Captain Lyna, who reports that a nearby town─Holminster Switch─has come under attack by a swarm of sin eaters. The Exarch quickly issues commands, and requests that you assist in the settlement's defense.","After you agree to lend your aid, the Exarch urges you to make swift preparations, and meet him at the crossroads north of the Accensor Gate.","You rendezvous with the Exarch outside the Crystarium, and he gives you directions to the Northern Staging Point. Time is of the essence.","You arrive at the woods on the outskirts of town, where Captain Lyna briefs you on the situation. Considering the number of sin eaters involved, it seems likely that a Lightwarden leads the attack. Make preparations to enter Holminster Switch and slay the abomination!<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","You battle your way through the besieged town and put down the Lightwarden raging at its center. At this, the remaining eaters scatter to the winds, leaving you free to withdraw to the Northern Staging Point.","The Exarch stands firm as the defeated Warden dissolves into aether, his gaze fixed upon you as you absorb the energy it releases without apparent ill effect. Moments later, the blazing sky dims, night descends, and the Crystarium's exultant steward praises you to the now-starry heavens.","Returned to the staging point with the remaining villagers, you have a moment to appreciate the sight of Lakeland beneath a night sky. The Exarch once more exults in your victory, but it seems that you have won only the first battle of many in the war against the sin eaters."],"objectives":["Speak with the Exarch.","Speak with the Exarch at the crossroads beyond the Accensor Gate.","Speak with the Exarch at the Northern Staging Point.","Enter Holminster Switch.","Speak with the Exarch."],"dialogue":[{"name":"MYSTERYVOICE","text":"Holminster Switch is in the north of Lakeland, so we had best make haste with our preparations."},{"name":"MYSTERYVOICE","text":"In fact, meet me outside the Crystarium at the crossroads northwest of the Accensor Gate, and I shall lead you there myself."},{"name":"MYSTERYVOICE","text":"All set? If we follow this road north, we will arrive at the Northern Staging Point."},{"name":"MYSTERYVOICE","text":"The village itself lies not far beyond. Quickly, now!"},{"name":"ALPHINAUD","text":"The Exarch asked that we wait, and so we waited..."},{"name":"ALISAIE","text":"You're here! We <span class=\"emphasis\">are</span> heading in together, yes?"},{"name":"LYNA","text":"Your assistance is appreciated."},{"name":"MYSTERYVOICE","text":"Holminster Switch is past these gates and through the woods. 'Tis not exactly a near neighbor to the Crystarium, but as we occupy the same region, we have built up something of a cooperative relationship."},{"name":"MYSTERYVOICE","text":"What can we expect inside, Captain?"},{"name":"LYNA","text":"The town is beset by a swarm unlike any we have seen in recent years. We did our best to evacuate the villagers, but as many as half remain..."},{"name":"LYNA","text":"Judging by the number of eaters present, we have good reason to believe that a Lightwarden leads the attack."},{"name":"ALISAIE","text":"How convenient. It seems we'll have our chance to slay a Warden sooner than we expected."},{"name":"LYNA","text":"&lt;snort&gt; One does not simply “slay a Warden.” Has no one told you what happens if you defeat one of those fiends?"},{"name":"LYNA","text":"They hold more Light inside them than all of their underlings put together."},{"name":"LYNA","text":"It can be struck down, aye, but its essence won't dissipate like the weaker kind. Vile aether will billow outwards and envelop the nearest living being─a reckless young swordswoman, perhaps─and turn her into a brand-new Warden."},{"name":"MYSTERYVOICE","text":"Ah, well you can leave that particular quandary to us. I must ask that the guard stand down and allow us to engage this leader of eaters alone."},{"name":"MYSTERYVOICE","text":"Concentrate on the survivors─we must save every life we can."},{"name":"LYNA","text":"But what if─!?"},{"name":"LYNA","text":"...Understood, my lord. As captain of the guard, however, I will not watch you brave such danger without an escort from our ranks. I insist that I go with you."},{"name":"MYSTERYVOICE","text":"Very well. Then our Warden-slaying party shall include myself, the Leveilleurs, Captain Lyna, and last but not least..."},{"name":"MYSTERYVOICE","text":"A formidable group indeed.<br>Into Holminster we go! Once we reach the Lightwarden, do not hold back─we strike to kill!"},{"name":"SYSTEM","text":"The instanced dungeons encountered in subsequent main scenario quests can be completed solo, alongside a supporting party of NPCs."},{"name":"SYSTEM","text":"To make use of this feature, simply speak with one of your NPC companions near the entrance to the instance and select the option to form a party."},{"name":"SYSTEM","text":"Alternately, you can also select <span class=\"highlight\">Duty Support</span> under <span class=\"highlight\">Duty</span> from the <span class=\"highlight\">main menu</span>, or interact with the instance entrance itself."},{"name":"SYSTEM","text":"When forming a party, you will need to follow the same role restrictions imposed when using the Duty Finder."},{"name":"SYSTEM","text":"Alternatively, you can find party members via the Duty Finder as usual, and complete the instance with fellow players instead."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Small talk."},{"name":"A1","text":"Form a party and enter Holminster Switch."},{"name":"A1","text":"Nothing."},{"name":"ALPHINAUD","text":"As you may have deduced, the “troublesome quality” of the Wardens which I endeavored to raise earlier was this confounded capacity for spontaneous rebirth..."},{"name":"ALPHINAUD","text":"...But the Exarch seems confident he has matters in hand, so I shall trust that we may slay our foe without fear of the aetheric aftermath. My restorative spells are at your disposal."},{"name":"ALISAIE","text":"I can't help but wonder if the scale of this raid is related to the “recruiting” the eaters were doing in Amh Araeng."},{"name":"ALISAIE","text":"Not that it matters. After all the combat I saw there, I'm more than ready to test my magicks against one of these greater abominations!"},{"name":"MYSTERYVOICE","text":"Command of this sortie is yours. Though I am not as spry as I once was, I hope my long years of experience will serve you in some capacity."},{"name":"MYSTERYVOICE","text":"I can wield spells to heal or harm, or even fashion an arcane shield and sword should we have need of a defensive wall. Simply say the word."},{"name":"LYNA","text":"Destroy a Lightwarden <span class=\"emphasis\">for good</span>...? Hmph. If it is possible now, then why not before? Whatever the Exarch believes, I <span class=\"emphasis\">will</span> force a retreat if I deem it necessary."},{"name":"LYNA","text":"I did not become captain of the guard by being meek. Or weak."},{"name":"ALPHINAUD","text":"Without that constant glare, Lakeland seems an entirely different place..."},{"name":"ALISAIE","text":"It's over, yes? I might need a moment..."},{"name":"LYNA","text":"It's as if the sky itself had disappeared into the heavens... If I didn't have wounded to tend to, I'd never stop staring..."},{"name":"MYSTERYVOICE","text":"How quickly you have justified my faith in you..."},{"name":"MYSTERYVOICE","text":"So many lives saved, and the sky itself heralds your success. A single victory in a larger struggle, perhaps, but a momentous one nonetheless!"}],"reward":{"gil":4663,"instance":72},"reqs":{"jobs":[{"lvl":71,"id":142}],"questsType":"all","quests":[68826,68835]},"next":[68837]},"partials":[{"type":"npc","id":"1028923","obj":{"i":1028923,"n":"Crystal Exarch","l":3223,"q":4}},{"type":"npc","id":"1029846","obj":{"i":1029846,"n":"Crystal Exarch","l":2953,"q":2}},{"type":"instance","id":"72","obj":{"i":72,"n":"Holminster Switch","c":61801,"t":"Dungeons","min_lvl":71,"max_lvl":72,"min_ilvl":370}},{"type":"quest","id":"68826","obj":{"i":68826,"n":"Emergent Splendor","g":8,"l":"Eulmore","s":120}},{"type":"quest","id":"68835","obj":{"i":68835,"n":"Tears on the Sand","g":8,"l":"Amh Araeng","s":210}},{"type":"quest","id":"68837","obj":{"i":68837,"n":"Warrior of Darkness","g":8,"l":"Lakeland","s":230}}]}