{"quest":{"name":"An Unwelcome Guest","location":"The Crystarium","id":68838,"patch":5.0,"sort":240,"icon":100899,"eventIcon":71201,"issuer":1027231,"target":1028941,"genre":8,"journal":["The manager of suites is wearing a grave expression.","In worried tones, the manager of suites informs you that Eulmore has dispatched its military to Lakeland, and that the Exarch has yet to decide how to respond. It sounds as if you may be needed in the Ocular.","Angered by the death of a Lightwarden, Eulmore has sent the commander of its army, the formidable General Ran'jit, to demand answers of the Exarch. As you observe their frosty meeting in secret, Ran'jit threatens retribution upon both the villains responsible and their abettors, but the Exarch is uncowed. After the old soldier departs, it transpires that a woman believed to be Minfilia, the Oracle of Light, has been taken prisoner by the Eulmorans. While the Exarch makes provisions for war, he bids you seek out Moren at the Cabinet of Curiosity to learn about Minfilia, who does not appear to be quite the person you once knew.","You ask Moren to enlighten you on the subject of Minfilia, and the librarian is eager to oblige. By way of a teaching aid, he sends you to fetch a book entitled <span class=\"emphasis\">The Illustrated Tale of the Oracle of Light</span>.","Scouring the shelves of the Cabinet, you finally manage to locate the volume in question and bear it back to Moren.","Book in hand, Moren tells you the history of the Oracle of Light. It appears that, after a mysterious maiden named Minfilia halted the Flood a century ago, a succession of young girls emerged who bore a striking resemblance to her, each of whom was immune to the sin eaters' blighted touch. Believed to be reincarnations of the original Minfilia, they came to be called by her name, and brought their powers to bear against the sin eaters as soldiers of the Eulmoran Army. This continued for generations, until the Eulmorans chose to join hands with the enemy, after which they hunted down and imprisoned the current Minfilia, deeming her a threat to the peace. Though she was subsequently rescued by an unnamed hero, it would seem she has fallen into Eulmoran hands once more...<br><br>Seeing you labor to make sense of these dizzying revelations, Alphinaud invites you to step outside for a brief discussion.","Alphinaud confirms your suspicion that Minfilia's gallant savior was none other than Thancred. Anticipating that he will attempt to liberate her again─no doubt at great personal risk─you decide to spare him the trouble. At that moment, the Exarch makes an unannounced appearance, however, and after confirming that Minfilia is indeed being held at Laxan Loft, he asks that you allow the people of the Crystarium to lead any rescue effort."],"objectives":["Head to the Ocular.","Speak with Moren at the Cabinet of Curiosity.","Search the shelves.","Deliver the book to Moren.","Speak with Alphinaud."],"dialogue":[{"name":"GUIDEOFTHEPENDANTS","text":"Ah, begging your pardons, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, but do you perchance intend to head outside?"},{"name":"GUIDEOFTHEPENDANTS","text":"If so, I would strongly advise you not to stray too far from the Crystarium. Word has it Eulmore has dispatched its military to Lakeland."},{"name":"GUIDEOFTHEPENDANTS","text":"Given the timing, one can only assume they do not welcome the return of night. Even now, the Exarch is in the Ocular, deliberating a response."},{"name":"MYSTERYVOICE","text":"If Minfilia has indeed been captured, I daresay we will see another familiar face anon. But first things first─pray seek out Moren at the Cabinet of Curiosity."},{"name":"LYNA","text":"We will continue to watch the Eulmorans."},{"name":"ALPHINAUD","text":"It seems an age since we bade Minfilia farewell..."},{"name":"ALISAIE","text":"Whatever you think Moren's going to tell you about Minfilia, it won't be what you're expecting. Just...trust me."},{"name":"MOREN","text":"Yes? If you're after books pertaining to the Warrior of Darkness, I'm afraid most are out on loan at present. They are experiencing quite a surge in popularity."},{"name":"MOREN","text":"Oh, you wish to learn about the <span class=\"emphasis\">Oracle of Light</span>? Then it would be my pleasure to assist!"},{"name":"MOREN","text":"...After I have finished off some few outstanding tasks, that is. While I attend to them, perhaps you could fetch me a book: <span class=\"emphasis\">The Illustrated Tale of the Oracle of Light</span>, it's called."},{"name":"MOREN","text":"Though it's intended for younger readers, it provides an excellent summary of the subject matter, and the artwork is quite lovely besides! I would not hesitate to recommend it to anyone with an interest in learning about Minfilia!"},{"name":"MOREN","text":"...But you must see for yourself. The book should be located on the level below."},{"name":"MOREN","text":"<span class=\"emphasis\">Should</span>, I say...for while there is a place for everything here, not everything is always in its place─despite my best efforts. In short, if the book is not where it should be, it will almost certainly be somewhere it shouldn't. So, uh...good luck!"},{"name":"MOREN","text":"How goes the search? Remember, it's always in the last place you look!"},{"name":"ALPHINAUD","text":"No luck as yet..."},{"name":"ALISAIE","text":"Is there a stepladder we can borrow?"},{"name":"SYSTEM","text":"The book does not appear to be here."},{"name":"SYSTEM","text":"Just as your eyes begin to blur, they finally come to rest on a copy of <span class=\"emphasis\">The Illustrated Tale of the Oracle of Light</span>."},{"name":"ALPHINAUD","text":"You found it, did you?"},{"name":"ALISAIE","text":"That's the book, is it?"},{"name":"MOREN","text":"Have you found the book?"},{"name":"MOREN","text":"Yes, this is the one! I hope it wasn't too difficult to track down."},{"name":"MOREN","text":"I'm happy to say I've finished all my pressing tasks. If you want to call your friends over, we can begin learning at once!"},{"name":"MOREN","text":"Without further ado, then..."},{"name":"MOREN","text":"It began a hundred years ago, when the Flood of Light threatened to swallow Norvrandt. Just as all seemed lost, a savior appeared who halted the all-consuming radiance. A maiden with hair of spun gold and eyes of clearest sapphire."},{"name":"MOREN","text":"Naught was known about her save that her name was Minfilia. And for delivering the realm, she came to be revered as the Oracle of Light."},{"name":"MOREN","text":"After stopping the Flood, the mysterious maiden vanished without a trace. But fifteen years later, her name would unexpectedly reappear in the annals of history."},{"name":"MOREN","text":"When sin eaters laid ruin to the Kingdom of Voeburt, a young girl was discovered who was immune to the creatures' blighted touch."},{"name":"MOREN","text":"...One with hair of spun gold and eyes of clearest sapphire. She was hailed as the Oracle reborn and came to likewise be called Minfilia."},{"name":"MOREN","text":"Enlisting in the Eulmoran Army, this Minfilia fought and vanquished countless sin eaters."},{"name":"MOREN","text":"Alas, like so many other soldiers, she eventually met her end in battle."},{"name":"MOREN","text":"Yet with her dying breath, she whispered unto her grieving comrades, “Minfilia will return.”"},{"name":"MOREN","text":"And true to her words, some years later, another young girl was discovered who possessed the selfsame eyes, that selfsame hair, and those selfsame powers."},{"name":"MOREN","text":"She too took the name Minfilia. She too fought sin eaters as a soldier of Eulmore. And she too fell in battle. Many more were to follow in her footsteps. And so the cycle continues to this day."},{"name":"MOREN","text":"...And that concludes the tale."},{"name":"MOREN","text":"By their valor and sacrifice, these women have saved Norvrandt on numerous occasions."},{"name":"MOREN","text":"And were it not for them, we might never have learned of the Lightwardens and their nature."},{"name":"ALISAIE","text":"They sound like formidable warriors."},{"name":"MOREN","text":"Some, perhaps... The truth is rather less simple. Though the Oracle is reborn with certain common traits, she does not inherit the memories or the knowledge of her previous incarnations."},{"name":"MOREN","text":"All of the Minfilias thus far were discovered as ordinary girls, unversed in the ways of war and ignorant of the power they harbored."},{"name":"MOREN","text":"While some embraced their fate and devoted themselves to training, others did not... But all were made to face the sin eaters, and all died to keep our hopes alive."},{"name":"ALPHINAUD","text":"What can you tell us of the current Minfilia?"},{"name":"MOREN","text":"She was found by the Eulmoran Army some ten years ago and taken into their care."},{"name":"MOREN","text":"...Or rather their custody. She was a prisoner in all but name. For by that time, under Lord Vauthry's rule, Eulmore had already abandoned resistance in favor of decadence."},{"name":"MOREN","text":"Minfilia was an uncomfortable reminder of the war they no longer wished to fight. A potential threat to the peace. And so they kept her under lock and key."},{"name":"MOREN","text":"For a long while, we heard nothing more of her. We couldn't even be certain she was alive, save that it was in the Eulmorans' best interests for her to remain under their control."},{"name":"MOREN","text":"But then, three years ago, a gallant soul stole into the city and rescued her from their clutches! Just like a hero from the tales!"},{"name":"ALPHINAUD","text":"Indeed. Well, I believe we now have a good grasp of Minfilia's tale. Thank you for your time, Moren."},{"name":"ALPHINAUD","text":"Might I trouble you for a word, <span class=\"highlight\">Forename</span>? Outside?"},{"name":"ALISAIE","text":"This seems a suitable place for a chat."},{"name":"ALPHINAUD","text":"As you will have already surmised, the gallant soul who rescued Minfilia was none other than our own dear Thancred."},{"name":"ALPHINAUD","text":"They have since been wandering the land together, never remaining in one place for long─which is why we have not yet had a chance to meet them."},{"name":"ALISAIE","text":"We know that Minfilia journeyed here as Hydaelyn's emissary to halt the Flood of Light."},{"name":"ALISAIE","text":"It could only be her that the people of the First witnessed a hundred years ago. The original Oracle of Light."},{"name":"ALISAIE","text":"But while there's plainly some connection between the woman we knew and her namesakes, the fact that these girls do not share her memories must surely mean they are not the same person."},{"name":"ALISAIE","text":"Thancred has to understand that."},{"name":"ALPHINAUD","text":"I have no doubt that he understands. The question is how he feels."},{"name":"ALPHINAUD","text":"Regardless, the Thancred we know would not forsake his charge."},{"name":"ALPHINAUD","text":"If she has been captured, we may be certain he will not stand idly by."},{"name":"ALISAIE","text":"Hmph, there you go again, talking in your roundabout way. If you think we should rescue Minfilia, just spit it out."},{"name":"ALISAIE","text":"It just so happens I agree with you."},{"name":"ALISAIE","text":"It's quite clear that this Minfilia possesses Hydaelyn's blessing."},{"name":"ALISAIE","text":"And it wouldn't hurt to have a second such individual on our side. Right, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Quite."},{"name":"A1","text":"One's generally been enough... But fine."},{"name":"MYSTERYVOICE","text":"(-???-)I see you've made up your minds."},{"name":"ALPHINAUD","text":"Exarch! What brings you here?"},{"name":"MYSTERYVOICE","text":"A report and a proposal."},{"name":"MYSTERYVOICE","text":"First, the report. Our scouts have confirmed that the Eulmoran forces at Laxan Loft do indeed have Minfilia in their custody."},{"name":"MYSTERYVOICE","text":"For the present, they are holding her there, but we can be certain they will move her to Eulmore ere long. Should that happen, we may be forced to give her up as lost."},{"name":"ALISAIE","text":"So if we mean to act, we should do so quickly."},{"name":"MYSTERYVOICE","text":"Which brings me to my proposal."},{"name":"MYSTERYVOICE","text":"I ask that you entrust this undertaking to us, the people of the Crystarium."}],"reward":{"gil":1026},"reqs":{"jobs":[{"lvl":72,"id":142}],"quests":[68837]},"next":[68839]},"partials":[{"type":"npc","id":"1027231","obj":{"i":1027231,"n":"Manager Of Suites","l":2951,"q":6}},{"type":"npc","id":"1028941","obj":{"i":1028941,"n":"Alphinaud","l":2951,"q":1}},{"type":"quest","id":"68837","obj":{"i":68837,"n":"Warrior of Darkness","g":8,"l":"Lakeland","s":230}},{"type":"quest","id":"68839","obj":{"i":68839,"n":"The Crystarium's Resolve","g":8,"l":"The Crystarium","s":250}}]}