{"quest":{"name":"Warrior of Darkness","location":"Lakeland","id":68837,"patch":5.0,"sort":230,"eventIcon":71201,"issuer":1029846,"target":1030610,"genre":8,"journal":["The Exarch is looking ahead to the immediate future."],"objectives":["Speak with Alphinaud in the Crystarium.","Speak with Bragi.","Speak with Glynard.","Speak with the manager of suites in the Pendants."],"dialogue":[{"name":"ALPHINAUD","text":"Without that constant glare, Lakeland seems an entirely different place..."},{"name":"ALISAIE","text":"It's over, yes? I might need a moment..."},{"name":"LYNA","text":"It's as if the sky itself had disappeared into the heavens... If I didn't have wounded to tend to, I'd never stop staring..."},{"name":"MYSTERYVOICE","text":"Now, as for how we proceed from here..."},{"name":"LYNA","text":"The villagers we evacuated earlier have arrived safely in the Crystarium."},{"name":"LYNA","text":"They seem to be accepting their situation for the moment─most folk are far too distracted by the sky to worry about wounds or lost homes."},{"name":"LYNA","text":"They whisper and wonder if the Warrior of Darkness has come..."},{"name":"MYSTERYVOICE","text":"'Tis to be expected."},{"name":"MYSTERYVOICE","text":"<span class=\"highlight\">Forename</span>, I must ask a favor of you. Would you be so kind as to conceal your involvement in this endeavor for the time being?"},{"name":"MYSTERYVOICE","text":"Seeing the Light recede from Lakeland is a momentous occasion, and many will be swept up in a maelstrom of excitement and confusion."},{"name":"MYSTERYVOICE","text":"Should you come forth as the legendary Warrior of Darkness, I fear that, no matter how good your intentions, such an appearance would throw the city into disarray."},{"name":"ALPHINAUD","text":"I find myself in agreement with the Exarch, although my concerns are more focused on Eulmore."},{"name":"ALPHINAUD","text":"It may be best if you maintain a low profile until we see how Vauthry responds to all of this."},{"name":"MYSTERYVOICE","text":"My thanks. Though we cannot freely celebrate your success, pray allow your heart to be buoyed by the joy of our citizens─a joy you surely brought into being."},{"name":"MYSTERYVOICE","text":"Ah, and I must ask the same discretion of you, Captain. 'Tis my intention to share with our people the tale of a great warrior who stood in defiance of the sin eaters. This unnamed champion defeated the Lightwarden, and has since departed for parts unknown, yes?"},{"name":"LYNA","text":"As you wish, my lord. Your penchant for mystery is nothing new, and I will encourage folk not to question this either."},{"name":"LYNA","text":"...Although I expect to be told the whole truth of it one day. About all of you."},{"name":"MYSTERYVOICE","text":"With that settled, I shall return to the Crystarium and make an address to the people."},{"name":"MYSTERYVOICE","text":"These explanations and adjustments will consume much of my time, so pray take the opportunity to rest and recover from your exploits. And to think, you'll not even need to shutter the windows to enjoy a dark and peaceful night's sleep!"},{"name":"LYNA","text":"I must stay behind and coordinate the evacuation of the remaining survivors."},{"name":"LYNA","text":"And I hesitate to ask after all you've done here today, but could I ask you to pass on a message on your way to the Pendants?"},{"name":"LYNA","text":"Please let Bragi know that we're bringing in a number of injured, and that any restoratives in the markets need to be reserved for the infirmary."},{"name":"ALPHINAUD","text":"We should start making our own way back to the Crystarium─slowly, mind you. It wouldn't do to arrive too soon after the Exarch."},{"name":"ALISAIE","text":"I'm staying behind as well. I... There's something I need to check on in Holminster."},{"name":"ALPHINAUD","text":"We already went through the village top to bottom, Alisaie. We should all take the chance to rest, you included."},{"name":"ALISAIE","text":"I <span class=\"emphasis\">knew</span> one of those eaters, and I can't just... I can't rest, not now."},{"name":"ALISAIE","text":"So please, I wish to be left alone for a while. And that means you as well, <span class=\"highlight\">Forename</span>─I shall be cross if you try to follow me!"},{"name":"ALISAIE","text":"I promise to find you later, when I feel myself again."},{"name":"ALPHINAUD","text":"Hm, just you and me, then. Shall we?"},{"name":"LYNA","text":"I'd be grateful if you could pass that message on to Bragi. He should be standing in his usual spot in the markets."},{"name":"MYSTERYVOICE","text":"Not to worry, <span class=\"highlight\">Forename</span>─I've given my address to the citizens, and soothed their most immediate fears."},{"name":"MYSTERYVOICE","text":"Your only concern for the moment is recuperating from your victory."},{"name":"ALPHINAUD","text":"Well, the Crystarium seems relatively ordered, wouldn't you say? The Exarch's speech must have been reassuring to hear."},{"name":"ALPHINAUD","text":"On the contrary, there is something jubilant in the air─I have a feeling this night won't be quite as “peaceful” as our hooded friend predicted!"},{"name":"ALPHINAUD","text":"I think I shall take a brief stroll around town before retiring to my chambers. Once you've discharged your duty to Bragi, I suggest you do the same."},{"name":"ALPHINAUD","text":"Sleep well, <span class=\"highlight\">Forename</span>. I hope untroubled dreams find you and Alisaie both."},{"name":"BRAGI","text":"Aye, what can I do for you? Looking to buy a lantern, like every other stumbling soul in the city?"},{"name":"BRAGI","text":"...I see. Well Captain Lyna can rest assured that any potions I spot coming in will be set aside for the wounded."},{"name":"BRAGI","text":"Hang on a moment, if you're carrying messages for the guard, does that mean you were there, then? The battle at Holminster?"},{"name":"BRAGI","text":"A stalwart <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> like you might want to pay a visit to the Wandering Stairs, make <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> known..."},{"name":"BRAGI","text":"I'm sure Glynard can introduce you to some <span class=\"emphasis\">interesting</span> opportunities."},{"name":"BRAGI","text":"The Wandering Stairs? It's just a short wander up the stairs there, thus the name. Rowdy crowd in attendance <span class=\"alternative-container\"><span class=\"alternative\">this evening</span><span class=\"alternative\">today</span></span>, if that noise is aught to judge by."},{"name":"GRANSON","text":"I need to find me someone with a damn spine..."},{"name":"LUEREEQ","text":"I might be able to take Andreia alone, but why take the chance? Never hurts to have someone watching your back when eaters are involved..."},{"name":"GIOTT","text":"&lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; &lt;burp&gt; Where's that wine I ordered? Do they mean to make me idle here without a drink in hand?"},{"name":"CERIGG","text":"Ah, Phronesis, what am I to do? I've not the talents to counter your tricks, but if I could enlist the aid of a seasoned mage..."},{"name":"GLYNARD","text":"Cyella, more beer for table two! And a couple of pints of mead for table three, while you're at it!"},{"name":"CYELLA","text":"Coming right up!"},{"name":"GLYNARD","text":"Sorry, we're rushed off our feet <span class=\"alternative-container\"><span class=\"alternative\">this evening</span><span class=\"alternative\">today</span></span>, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Can I get you anything? Drinks are on the house!"},{"name":"GLYNARD","text":"Hm? Oh, that Bragi has a twisted sense of humor..."},{"name":"GLYNARD","text":"Gahahaha! To think he'd send you to me at a time like this!"},{"name":"GLYNARD","text":"The first real “night” in near a hundred years has folk all riled up and then some!"},{"name":"GLYNARD","text":"What's more, there was that eater business at Holminster Switch. They say a Lightwarden was destroyed without a damn trace, and it was the Warrior of Darkness who did the deed!"},{"name":"CYELLA","text":"I really must apologize for Glynard─he's been almost as rowdy as our customers, and that's no small feat."},{"name":"CYELLA","text":"A lot of our regulars are bounty hunters, you see. They mostly go after eaters, and the rumor of the Warrior's appearance was the spark to their kindling."},{"name":"GLYNARD","text":"You know how the weak eaters are drawn to the strong ones, right?"},{"name":"GLYNARD","text":"Aye, they swarm like angry bees around a queen. You need look no further than Holminster for proof of that. But attacks on that scale don't happen every day, praise the blessed shadow."},{"name":"GLYNARD","text":"No, the more common threats are the strays. No one knows why, but every now and again, an eater will leave the pack to prowl alone. Those are the ones you run into on the road if your luck is foul."},{"name":"GLYNARD","text":"They're a danger to everyone, so the Settlement council puts bounties on their heads. And our bar here is a convenient place for hunters to gather and share information."},{"name":"CYELLA","text":"Seems a few of them were inspired by the Warden-slaying even more than most. These are the types who have their sights set on the absolute worst of the strays─a class of eaters that've been dubbed the “Cardinal Virtues.”"},{"name":"CYELLA","text":"The Virtues showed up out of nowhere about three summers ago, and when historians heard the descriptions given by survivors, well...apparently they share an appearance with the villains who caused the Flood."},{"name":"CYELLA","text":"And if that doesn't send a chill down your spine, they're also reported to be as tough as Lightwardens─not the kind of prey you can take down single-handed."},{"name":"CYELLA","text":"Our Virtue-hunters had all but given up, but knowing the Warrior of Darkness is out there has lit a fire in their bellies. Just look at them..."},{"name":"CYELLA","text":"That Hume over there with the oversized sword is Granson. He's in it for revenge. Wants to recruit a comrade-in-arms as tenacious as he is."},{"name":"CYELLA","text":"The Mystel lad is Lue-Reeq. Don't be fooled by those dewy cheeks─he's as hard a hunter as they come. He just lost a partner, and seems to be on the lookout for a new one..."},{"name":"CYELLA","text":"That's Cerigg. Word is he seeks an expert in magecraft to help fight the Virtue he's after."},{"name":"CYELLA","text":"Last we have Giott, dwarf and drunkard both. Wanted to join forces with a healer, and only a healer. Something about needing a “mender's wisdom”...?"},{"name":"CYELLA","text":"I've seen my share of competent veterans, and you have that look about you. Maybe you should introduce yourself to one of our hunters. Who knows? Together you might even collect the bounty on a Cardinal Virtue!"},{"name":"GLYNARD","text":"Now there's a grand idea. Imagine the prestige my bar would earn if we boasted the patronage of a successful Virtue-hunter!"},{"name":"SYSTEM","text":"You have gained access to role quests! A separate quest line and story is now available for tank, physical DPS, magical ranged DPS, and healer roles."},{"name":"SYSTEM","text":"In order to reach the final stages of the Shadowbringers main scenario, you must complete at least one role quest line. Speak with a Virtue-hunter at the Wandering Stairs to accept a quest offer!"},{"name":"GLYNARD","text":"My regulars have their quirks─some more than others─but it's odd how folk can grow on you. Spend enough time with them, and you might become a regular yourself. Always happy to welcome a new addition to the family!"},{"name":"CYELLA","text":"Come again whenever you like, our doors are always open...or they would be, if we had any."},{"name":"GUIDEOFTHEPENDANTS","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"GUIDEOFTHEPENDANTS","text":"I wonder if anyone can sleep with the city in such an uproar, but will you be retiring to your quarters?"},{"name":"Q1","text":"Retire to your quarters?"},{"name":"GUIDEOFTHEPENDANTS","text":"Very good. In light─ahem─of the present situation, I have had illumination prepared for all our rooms. No need to rush to the markets for lanterns or candles. Have a pleasant rest, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."}],"reward":{"gil":1314},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[68836]},"next":[68779,68803,68809,68838,68915,68916,69159]},"partials":[{"type":"npc","id":"1029846","obj":{"i":1029846,"n":"Crystal Exarch","l":2953,"q":2}},{"type":"npc","id":"1030610","obj":{"i":1030610,"n":"Manager Of Suites","l":2951,"q":5}},{"type":"quest","id":"68836","obj":{"i":68836,"n":"The Lightwardens","g":8,"l":"The Ocular","s":220}},{"type":"quest","id":"68779","obj":{"i":68779,"n":"The Man with Too Many Scars","g":179,"l":"The Crystarium","s":101,"f":1}},{"type":"quest","id":"68803","obj":{"i":68803,"n":"Traditions and Travails","g":180,"l":"The Crystarium","s":201,"f":1}},{"type":"quest","id":"68809","obj":{"i":68809,"n":"No Greater Sport","g":181,"l":"The Crystarium","s":301,"f":1}},{"type":"quest","id":"68838","obj":{"i":68838,"n":"An Unwelcome Guest","g":8,"l":"The Crystarium","s":240}},{"type":"quest","id":"68915","obj":{"i":68915,"n":"Do You Believe in Magic","g":111,"l":"The Crystarium","s":2001}},{"type":"quest","id":"68916","obj":{"i":68916,"n":"A Jobb Well Done","g":111,"l":"The Crystarium","s":2010,"f":1}},{"type":"quest","id":"69159","obj":{"i":69159,"n":"Hollow Pursuits","g":182,"l":"The Crystarium","s":1,"f":1}}]}