{"quest":{"name":"Courting Cooperation","location":"Il Mheg","id":68847,"patch":5.0,"sort":330,"eventIcon":71201,"issuer":1029017,"target":1030535,"genre":8,"journal":["Urianger fixes you with his gaze."],"objectives":["Use the Sharlayan box to capture a weakened hawker.","Deliver the boxed hawker to Urianger.","Speak with Sul Uin."],"dialogue":[{"name":"ALPHINAUD","text":"All is well with us...for the time being. There's no telling what manner of games the pixies will dream up."},{"name":"ALISAIE","text":"Have you met Urianger yet? The sooner you do, the sooner we can leave this place."},{"name":"THANCRED","text":"We will be much bolstered for Urianger's company."},{"name":"RYNE","text":"Oh...er, no need to worry about me. I'm quite familiar with the manor."},{"name":"RYNE","text":"During our wanderings, Thancred and I would often return here. It's where I imbue his ammunition."},{"name":"URIANGER","text":"My friend. Ere I speak of the task at hand, there is a question I would pose to thee."},{"name":"URIANGER","text":"What thinkest thou...of mine appearance?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Did you take up astrology?"},{"name":"A1","text":"Did you lose weight?"},{"name":"A1","text":"I didn't recognize you at first."},{"name":"URIANGER","text":"Indeed. Though the night be lost, behind the shroud of blinding light, doubt not but that the stars shine still."},{"name":"URIANGER","text":"I have chosen to avail myself of their guidance, that I might navigate the sea of uncertainty that stretcheth before us. For a blessing, my prior studies of astrology did provide me with adequate grounding in the art."},{"name":"URIANGER","text":"Did I...lose weight? If 'tis of flesh thou speakest, I cannot rightly say. However, in taking up astrology, I may have shed with some yalms of fabric. My present attire better suiteth the art."},{"name":"URIANGER","text":"Though the night be lost, behind the shroud of blinding light, doubt not but that the stars shine still. I have chosen to avail myself of their guidance, that I might navigate the sea of uncertainty that stretcheth before us."},{"name":"URIANGER","text":"Come now, 'tis scarce the first time thou hast beheld these fair features. Lest thou wonderest, I have taken up astrology. My present attire better suiteth the art."},{"name":"URIANGER","text":"Though the night be lost, behind the shroud of blinding light, doubt not but that the stars shine still. I have chosen to avail myself of their guidance, that I might navigate the sea of uncertainty that stretcheth before us."},{"name":"URIANGER","text":"But enough of myself. Let us now speak of our task."},{"name":"URIANGER","text":"As I did mention, if we are to enter Lyhe Ghiah, we must needs gain the pixies' cooperation."},{"name":"URIANGER","text":"This is a simple matter of presenting unto them a suitable gift."},{"name":"URIANGER","text":"I shall procure a selection of viands that shall please their palates. Thancred, pray assist me in this endeavor."},{"name":"URIANGER","text":"Meanwhile, <span class=\"highlight\">Forename</span>, I bid thee obtain that which will please their eyes. In these parts, there abideth a vilekin known for its beauteous wings: the hawker. I shall lend thee a receptacle within which thou mayest capture a weakened specimen."},{"name":"THANCRED","text":"There's no avoiding chores, is there? Far better under Urianger than the pixies, of course."},{"name":"URIANGER","text":"Thou shouldst find a hawker nearby. Pray use the receptacle I have lent thee to capture a weakened specimen."},{"name":"URIANGER","text":"Thou art returned. Wert thou able to capture a hawker?"},{"name":"URIANGER","text":"Ah, a truly magnificent set of wings. I shall treat them at once to make fast their vibrant colors."},{"name":"URIANGER","text":"Thancred too should return anon, upon which I shall ready all the items for presentation. Pray take thine ease meanwhile."},{"name":"ALPHINAUD","text":"You couldn't have returned at a better time. The pixies had just decided that it would be amusing to have Alisaie and I exchange outfits..."},{"name":"ALISAIE","text":"Ahaha, thank the gods you arrived when you did! Any later, and I don't think I would've been able to live it down!"},{"name":"THANCRED","text":"When you have a moment, be sure to show your appreciation to the twins. They've endured a great deal on our behalf..."},{"name":"RYNE","text":"I dare not ask what happened in our absence..."},{"name":"URIANGER","text":"As much as I should like to savor the reunion with Master Alphinaud and Mistress Alisaie, it must wait. I have taken the liberty of presenting our gifts unto the pixies; let us see how well they are received."},{"name":"SULUIN","text":"We weren't expecting you all back so soon. We had scarcely begun playing with the twins..."},{"name":"SULUIN","text":"That said, your gifts are truly wonderful! Let me tell you, the milk and honey and biscuits won't last a day, and the wings are the loveliest we've ever seen!"},{"name":"SULUIN","text":"You've done us a great kindness, and it's fae custom to return the gesture. If you desire anything of us, you need but name it!"}],"reward":{"gil":1126,"items":[{"num":2,"id":27853,"one":1},{"num":2,"id":27854,"one":1},{"num":2,"id":27855,"one":1},{"num":2,"id":27856,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":72,"id":142}],"quests":[68846]},"next":[68848,68937,68938,68939,68940]},"partials":[{"type":"npc","id":"1029017","obj":{"i":1029017,"n":"Urianger","l":2956,"q":1}},{"type":"npc","id":"1030535","obj":{"i":1030535,"n":"Sul Uin","l":2956,"q":2}},{"type":"item","id":"27853","obj":{"i":27853,"n":"Grilled Rail","l":390,"c":24352,"t":46,"p":3359}},{"type":"item","id":"27854","obj":{"i":27854,"n":"Purple Carrot Juice","l":390,"c":24416,"t":46,"p":3359}},{"type":"item","id":"27855","obj":{"i":27855,"n":"Caramels","l":395,"c":24089,"t":46,"p":3406}},{"type":"item","id":"27856","obj":{"i":27856,"n":"Broad Bean Soup","l":395,"c":24101,"t":46,"p":3406}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68846","obj":{"i":68846,"n":"Unto the Truth","g":8,"l":"Il Mheg","s":320}},{"type":"quest","id":"68848","obj":{"i":68848,"n":"The Key to the Castle","g":8,"l":"Il Mheg","s":340}},{"type":"quest","id":"68937","obj":{"i":68937,"n":"An Artist's Tale","g":116,"l":"Il Mheg","s":2290}},{"type":"quest","id":"68938","obj":{"i":68938,"n":"Counting Pixies","g":116,"l":"Il Mheg","s":2301}},{"type":"quest","id":"68939","obj":{"i":68939,"n":"A Rosy Problem","g":116,"l":"Il Mheg","s":2310}},{"type":"quest","id":"68940","obj":{"i":68940,"n":"The Path to Popularity","g":116,"l":"Il Mheg","s":2320,"f":1}}]}