{"quest":{"name":"Sul Uin's Request","location":"Il Mheg","id":68843,"patch":5.0,"sort":290,"eventIcon":71201,"issuer":1027654,"target":1027654,"genre":8,"journal":["Sul Uin aches for your attention."],"objectives":["Sow everbloom seeds around Lydha Lran.","Speak with Sul Uin."],"dialogue":[{"name":"SULUIN","text":"Ooh, ooh! Look at me, look at me! I have a task for you!"},{"name":"SULUIN","text":"Lydha Lran is our beloved village, and we want it to always look lovely. And it can't look lovely without flowers blooming. And no flowers bloom lovelier than everblooms!"},{"name":"SULUIN","text":"So, here are some everbloom seeds. Take them and sow them here, there, and everywhere around the village. Simple as a dimple, yes?"},{"name":"SULUIN","text":"No flowers bloom lovelier than everblooms. Take those seeds and sow them here, there, and everywhere around the village!"},{"name":"PIXIEA03307","text":"(-Curious Pixie-)Helping us grow flowers, are you? They'll make this house look so much lovelier!"},{"name":"PIXIEA03307","text":"(-Curious Pixie-)There used to be a city of mortals here. A great big, bustling place called Voeburt or Boevurt or some such. But the sin eaters came and everyone disappeared."},{"name":"PIXIEA03307","text":"(-Curious Pixie-)Since then, we pixies have been living here, and we've given the old houses our touch. Lovely, don't you think?"},{"name":"PIXIEB03307","text":"(-Jovial Pixie-)Ooh, I can't wait for the flowers to bloom! Perhaps I'll make pretty curtains out of them!"},{"name":"SULUIN","text":"You're done sowing the seeds? Thank you! This shall help Lydha Lran live up to its name─which means “flower house,” in case you weren't aware."},{"name":"SULUIN","text":"We weren't always here, you know. We used to live deep in a lush forest. It was beautiful beyond compare, but almost all of it was swallowed up by the light."},{"name":"SULUIN","text":"For a while we roamed, but eventually we found a place that men had abandoned. Together with our fellow fae folk, we decided to make it our new home."},{"name":"SULUIN","text":"The land of everlasting spring─this is our home, and it could be yours too. Forever and ever and ever..."}],"reward":{"gil":616,"items":[{"id":26839}]},"reqs":{"jobs":[{"lvl":72,"id":142}],"quests":[68842]},"next":[68846]},"partials":[{"type":"npc","id":"1027654","obj":{"i":1027654,"n":"Sul Uin","l":2956,"q":1}},{"type":"item","id":"26839","obj":{"i":26839,"n":"Deepgold Leg Gear Coffer (IL 395)","l":1,"c":26561,"t":61}},{"type":"quest","id":"68842","obj":{"i":68842,"n":"Il Mheg, the Faerie Kingdom","g":8,"l":"Il Mheg","s":280}},{"type":"quest","id":"68846","obj":{"i":68846,"n":"Unto the Truth","g":8,"l":"Il Mheg","s":320}}]}