{"quest":{"name":"A Visit to the Nu Mou","location":"Il Mheg","id":68849,"patch":5.0,"sort":350,"eventIcon":71201,"issuer":1029162,"target":1029562,"genre":8,"journal":["Urianger is eager to press on with the hunt for the fae relics."],"objectives":["Speak with Urianger.","Return to Urianger.","Head to the destination while under the effect of fae cloak.","Speak with Thancred."],"dialogue":[{"name":"THANCRED","text":"If it is indeed the Eulmoran Army, we may soon have to contend with Ran'jit again...which may prove problematic, even for you."},{"name":"RYNE","text":"If only I hadn't been caught..."},{"name":"URIANGER","text":"With our enemies fast approaching, time is of the essence. We must needs accomplish our mission with all possible haste."},{"name":"URIANGER","text":"Of the two remaining bearers of the relics, the Nu Mou are the nearer. We shall seek them out next."},{"name":"URIANGER","text":"Among the fae folk, they bear the distinction of having abided in these lands since before the Flood. They are also the friendliest to men, and have served me faithfully whensoever I have called upon them. Indeed, they are the source of much of the knowledge I have acquired in my time here."},{"name":"URIANGER","text":"The path leadeth past my dwellings. Let us away."},{"name":"URIANGER","text":"Past yonder cliff lieth Pla Enni, home of the Nu Mou."},{"name":"URIANGER","text":"The others have gone ahead to scout the way. Come, let us follow."},{"name":"URIANGER","text":"If the path striketh thee as precipitous, 'tis because it was once a mountain trail."},{"name":"URIANGER","text":"For where the lake now lieth, there was a valley, in whose midst thrived the city of Voeburt. 'Twas only when the Fuath came, in the wake of the Flood, that the settlement was drowned."},{"name":"URIANGER","text":"We stand now upon its former outskirts. Grazing lands where shepherds once tended their flocks."},{"name":"URIANGER","text":"Though one cannot help but feel a pang of loss when faced with such a spectacle, one can scarcely blame the fae folk for so altering the land."},{"name":"URIANGER","text":"The blame for that lieth rightly with the Light─a force terrible enough to bring an entire civilization to its knees. An entire world. That it should have been allowed to rise up unchecked is the greater regret."},{"name":"URIANGER","text":"Yet, in spite of all the tragedy which surroundeth me, full glad am I for the chance to be here."},{"name":"URIANGER","text":"'Twas these hands which brought together the Warriors of Darkness and Minfilia, lest thou forget."},{"name":"URIANGER","text":"Therefore, even were there no Eighth Umbral Calamity to forestall, it seemeth only right that I strive to deliver the First from its doom."},{"name":"URIANGER","text":"Only right, I say, though such words ill convey the strength of my resolve."},{"name":"URIANGER","text":"In truth, I can no more ignore the plight of this world than I can choose to stop breathing. And thus do I labor─for those we have lost. For those we can yet save."},{"name":"URIANGER","text":"The coming struggle promiseth to test us to our limits, but so long as we stand together, I doubt not but that we shall prevail."},{"name":"PIXIEA03313","text":"(-Boisterous Pixie-)Aha! Mortals, just as we thought!"},{"name":"URIANGER","text":"Hast thou business with us?"},{"name":"PIXIEA03313","text":"(-Boisterous Pixie-)Business? Ha! Nothing so boring! We smelled you coming, and thought we'd come to play!"},{"name":"URIANGER","text":"They do not appear to be pixies of Lydha Lran."},{"name":"URIANGER","text":"Mine apologies, but we are in some haste. Mayhap another day."},{"name":"PIXIEA03313","text":"(-Boisterous Pixie-)Ohhh, in some haste, are you? Then allow me to <span class=\"emphasis\">hasten</span> you on your way! Tee hee hee!"},{"name":"URIANGER","text":"Teleportation magick. For a mercy, we were not sent far from our course."},{"name":"URIANGER","text":"Should the pixies find us again, however, they will most assuredly repeat the trick."},{"name":"URIANGER","text":"We have not the time to waste. Let us avail ourselves of an enchantment I have learned."},{"name":"URIANGER","text":"“Fae cloak,” 'tis called─a most ingenious magick which rendereth one invisible to fae folk, albeit briefly."},{"name":"PIXIEA03313","text":"(-Boisterous Pixie-)Oh, no you don't! Back you go, tee hee hee!"},{"name":"URIANGER","text":"I shall cast the enchantment upon thee. Under its aegis, thou art to make thy way past the pixies and rejoin our comrades."},{"name":"URIANGER","text":"Know, however, that the enchantment shall suffice to veil thee and thee alone. Be not tempted to employ a mount, as it will only serve to give thy presence away."},{"name":"URIANGER","text":"I shall cast the enchantment upon thee once more. The effect is quick to fade, so thou must needs be swift."},{"name":"PIXIEB03313","text":"(-Boisterous Pixie-)Hee hee, found you! Aaand away you go!"},{"name":"PIXIEC03313","text":"(-Earnest Pixie-)You've nothing to fear, mortal! I'm not like the other pixies."},{"name":"PIXIEC03313","text":"(-Earnest Pixie-)I'm WORSE! Ahahaha! Better luck next time!"},{"name":"SYSTEM","text":"The pixies leave, disappointment writ on their faces."},{"name":"RYNE","text":"We lost sight of you. Is everything all right?"},{"name":"THANCRED","text":"I assumed you were right behind us. What took you so long?"},{"name":"THANCRED","text":"I see... Yes, I'd say that's a valid excuse for lateness. You are hereby forgiven."},{"name":"THANCRED","text":"In other good news, the Nu Mou village lies just through here. We'll enter as soon as Urianger deigns to join us."},{"name":"TYRNEE","text":"Ah! Ahhh! Mortals! Mortals are here! Lots of them!"},{"name":"THANCRED","text":"I thought you said the Nu Mou were men's best friends. The poor thing was beside itself with fear."},{"name":"URIANGER","text":"'Twas beside itself, perhaps...but not with fear."},{"name":"WYDAENC","text":"This is unacceptable! Unacceptable, I tell you! To have so many mortals appear at once..."},{"name":"WYDAENC","text":"It's more excitement than we can bear!"},{"name":"URIANGER","text":"Greetings, Elder Wyd Aenc, Tyr Nee. It hath been a while."},{"name":"URIANGER","text":"Pray forgive my brevity, but time is against us. We are come to borrow the stone scepter of the Nu Mou."},{"name":"WYDAENC","text":"Th-The stone scepter? Then...you mean to lift the seal over Lyhe Ghiah!?"},{"name":"WYDAENC","text":"That is unacceptable! Unacceptable, I tell you! If the king is set free, none here will be safe!"},{"name":"WYDAENC","text":"Unlike our fae cousins, we Nu Mou have called this land our home since time immemorial. Leaving is unthinkable."},{"name":"WYDAENC","text":"Thus did full many of us lay down our lives to seal away our king when they were corrupted by light! If we do as you ask, our sacrifice would have been in vain!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Don't worry. We'll defeat Titania."},{"name":"A1","text":"No one will come to harm."},{"name":"A1","text":"Just hand over the godsdamned staff."},{"name":"WYDAENC","text":"But then you'll only become another Lightwarden! It changes nothing!"},{"name":"WYDAENC","text":"Easily said for one who hasn't experienced the king's wrath!"},{"name":"WYDAENC","text":"S-Such discourtesy! It's unacceptable! Unacceptable, I tell you!"},{"name":"URIANGER","text":"Honored Elder, pray believe me when I say that this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> is possessed not only of the strength required to vanquish the king, but of something still more valuable: a means to resist the resultant corruption. Indeed, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> hath already laid low the Lightwarden of Lakeland, all without succumbing to the influence of its light."},{"name":"URIANGER","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is yet a stranger to this land, 'tis true, but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> harboreth the selfsame desire to see the sin eaters eliminated as we do."},{"name":"URIANGER","text":"Wilt thou not lend us thy hand, that we might see thy beloved home restored to its former glory?"},{"name":"WYDAENC","text":"Hmmm... You have always done right by us, Urianger. If you have placed your faith in this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, then so shall we."},{"name":"WYDAENC","text":"As you say, we want nothing more than to be rid of the sin eaters."},{"name":"WYDAENC","text":"Be that as it may, this is not a decision to be made lightly. We require time to deliberate. A turn of the moon, perhaps..."},{"name":"THANCRED","text":"We don't have a turn of the moon. Unless we want to debate this with the Eulmoran Army."},{"name":"URIANGER","text":"Elder...given all that is at stake, I cannot well expect thee simply to <span class=\"emphasis\">roll over</span>, and acquiesce to our request."},{"name":"URIANGER","text":"But even now, a powerful foe draweth near, and I fear I must beseech thee to hasten thy deliberations, that thou mightst <span class=\"emphasis\">fetch</span> us the scepter while there is yet time to use it."},{"name":"TYRNEE","text":"R-Roll over!? F-Fetch!? Ahhh! Ahhhhhh!"},{"name":"WYDAENC","text":"You know full well that naught gives us greater pleasure than to render aid to men!"},{"name":"WYDAENC","text":"You know full well, yet you speak the words of power regardless? It's unfair! Unfair, I tell you!"},{"name":"WYDAENC","text":"&lt;sigh&gt; In happier times, it was our honor to assist mortals in need and receive rewards befitting our deeds."},{"name":"WYDAENC","text":"Since the Kingdom of Voeburt fell, however, we've been starved of man's patronage. After so many years of deprivation, it is...difficult to ignore such an earnest entreaty."},{"name":"WYDAENC","text":"Very well, Urianger. I promise to give you as swift an answer as I may."},{"name":"WYDAENC","text":"In return, I ask that you and yours remain here the while, and bestow upon us your patronage. Is this arrangement agreeable?"}],"reward":{"gil":922},"reqs":{"jobs":[{"lvl":73,"id":142}],"quests":[68848]},"next":[68850]},"partials":[{"type":"npc","id":"1029162","obj":{"i":1029162,"n":"Urianger","l":2956,"q":1}},{"type":"npc","id":"1029562","obj":{"i":1029562,"n":"Thancred","l":2956,"q":1}},{"type":"quest","id":"68848","obj":{"i":68848,"n":"The Key to the Castle","g":8,"l":"Il Mheg","s":340}},{"type":"quest","id":"68850","obj":{"i":68850,"n":"A Fitting Payment","g":8,"l":"Il Mheg","s":360}}]}