{"quest":{"name":"Unto the Truth","location":"Il Mheg","id":68846,"patch":5.0,"sort":320,"icon":100902,"eventIcon":71201,"issuer":1028981,"target":1028999,"genre":8,"journal":["Thancred looks just like you feel.","After being subjected to a host of menial tasks and pranks, you and your comrades conclude that the pixies will never be satisfied and let you leave. While discussing your options, you remember a useful detail: you have a pact with a pixie. At Thancred's urging, you decide to turn to Feo Ul for help. With the chat mode in <span class=\"highlight\">Say</span>, attempt to summon your pixie friend by calling “Feo Ul” out loud.","Though Feo Ul hears your call, the pixie is in a black mood having been neglected for so long. Some groveling may be in order. With the chat mode in <span class=\"highlight\">Say</span>, attempt to placate your pact-mate by saying, “Please, Feo Ul, I need you.”","Feo Ul is not satisfied with your entreaty and compares you unfavorably to a sodden log. It seems you will have to try harder to quell the pixie's displeasure. With the chat mode in <span class=\"highlight\">Say</span>, attempt to regain Feo Ul's favor by saying, “O loveliest of branches, please grant me your succor!”","The third time's the charm. You succeed in winning over Feo Ul, who promptly coerces the other pixies into letting you go. With the illusion lifted and the way revealed, Thancred is eager to continue on to Urianger's abode.","Thancred informs you that Urianger has taken up residence in the abandoned manor of a nobleman and scholar: a place known as the Bookman's Shelves. He and Minfilia duly set off north along the path, as must you.","Stepping inside the manor, you enjoy a warm reunion with your old friend Urianger. After listening intently to your account of recent events, the Archon proceeds to share the unsettling vision he witnessed as he drifted across the rift. In his sprawling tale, he explains how the surge of light in the First will amplify the potency of the alchemical weapon Black Rose, thereby giving rise to the Eighth Umbral Calamity in the Source. Though the science behind the connection is somewhat complicated, its implications for you are simple: to forestall tragedy in both worlds, you must eliminate all of the Lightwardens. The being you have come to vanquish in Il Mheg is apparently ensconced within Lyhe Ghiah, the castle which rises from the lake. Though gaining entry will require that you turn to the pixies for aid, Urianger assures you that he has become adept at courting their cooperation. After your recent travails with the fae folk, you can only hope his confidence is well founded..."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter “Feo Ul” to summon your pixie friend.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Please, Feo Ul, I need you” to summon your pixie friend.","With the chat mode in <span class=\"highlight\">Say</span>, enter “O loveliest of branches, please grant me your succor!” to summon your pixie friend.","Speak with Thancred."],"dialogue":[{"name":"THANCRED","text":"How goes it, <span class=\"highlight\">Forename</span>?"},{"name":"THANCRED","text":"So, a mix of menial tasks and pranks."},{"name":"THANCRED","text":"Yes, that pretty much sums up my own experience. They have no troubles worthy of the name."},{"name":"ALISAIE","text":"&lt;sigh&gt; How long are we supposed to keep at this? They're clearly playing with us."},{"name":"ALPHINAUD","text":"Indeed. Whenever I inquire how much more there is to be done, the answer is ever the same: “A little.” I doubt they have any intention of releasing us in the near future."},{"name":"RYNE","text":"Urianger once told me a story about the pixies."},{"name":"RYNE","text":"They're born from the souls of those who died as children, or so it's believed."},{"name":"RYNE","text":"Though they don't have memories of their previous lives, the desire to have fun remains, imprinted on their souls."},{"name":"RYNE","text":"And so they live only to play, keeping hapless mortals for their pleasure for years on end. Sometimes even until death..."},{"name":"ALPHINAUD","text":"Hmmm... In the past, when I sought to identify the true nature of ghosts, I came upon literature examining a similar subject."},{"name":"ALPHINAUD","text":"The soul was likened to a core that resides in the aether, and its presence is what differentiates us from such beings as sprites and arcane entities."},{"name":"ALPHINAUD","text":"Upon death, said core ordinarily dissipates alongside the aether that composed the flesh. However, it may be held together and bound to the corporeal realm, either by the will of its owner or by means of certain arts."},{"name":"ALPHINAUD","text":"In time, the soul may regather aether unto itself to assume another form, or find newly emerged life in which to abide. The pixies may be one such instance of this."},{"name":"ALISAIE","text":"...If ghosts are merely souls without bodies, what does that make us? I think you've become that which you fear most, Brother dearest."},{"name":"THANCRED","text":"However the pixies may have come into being, if we leave them to judge when they are satisfied, they will never be satisfied."},{"name":"THANCRED","text":"Nay, we must negotiate new terms with the creatures... But where to begin? It seems to me we would need at least one among them to sympathize with us..."},{"name":"THANCRED","text":"In the course of your chores, did any of you encounter a pixie who seemed even faintly amenable to reason?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Not during my chores, perhaps..."},{"name":"A1","text":"Feo Ul."},{"name":"THANCRED","text":"What? You knew a pixie from before?"},{"name":"THANCRED","text":"Not only are you acquainted, but you've entered into a <span class=\"emphasis\">pact</span>? You might have mentioned this sooner!"},{"name":"THANCRED","text":"At any rate, I dare to hope this will offer us a way out.<br>Without further delay, then, summon this Feo Ul, if you please."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Feo Ul” to summon your pixie friend at the designated location."},{"name":"ALPHINAUD","text":"We're ghosts too... I suppose it makes sense on a certain level..."},{"name":"ALISAIE","text":"A pact with a pixie. Why am I not surprised?"},{"name":"THANCRED","text":"Come along, <span class=\"highlight\">Forename</span>. Summon your pixie friend."},{"name":"RYNE","text":"I hope Feo Ul will be able to help us."},{"name":"SYSTEM","text":"Feo Ul"},{"name":"SYSTEM","text":"A voice rings out in your mind..."},{"name":"FEOUL","text":"(-Feo Ul-)So! My sapling has <span class=\"emphasis\">finally</span> remembered about <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> lovely branch!"},{"name":"FEOUL","text":"(-Feo Ul-)But with such a half-hearted call, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> may as well lop me off and cast me aside! Hmph, I have no sapling!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Feo Ul” to summon your pixie friend at the designated location."},{"name":"SYSTEM","text":"Please, Feo Ul, I need you"},{"name":"FEOUL","text":"(-Feo Ul-)Hmph, is that your idea of a fervent call? A sodden log could do it with more fire!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Please, Feo Ul, I need you” to summon your pixie friend at the designated location."},{"name":"SYSTEM","text":"O loveliest of branches, please grant me your succor!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “O loveliest of branches, please grant me your succor!” to summon your pixie friend at the designated location."},{"name":"ALPHINAUD","text":"Worry not, we shall be fine. Go on and find Urianger."},{"name":"ALISAIE","text":"Send Urianger my regards...and tell him to live somewhere less annoying next time."},{"name":"RYNE","text":"Feo Ul certainly has a way with the other pixies."},{"name":"THANCRED","text":"For Alphinaud and Alisaie's sakes, let us be quick. It would be a shame to return only to find that they had been made to play one game too many."},{"name":"THANCRED","text":"Now, the place we seek is the abandoned manor of a nobleman and scholar. The Bookman's Shelves, it's called, after the fellow's vast collection of tomes. An agreeable habitat for our friend, I'm sure you'll agree."},{"name":"THANCRED","text":"If we follow the path north, we should soon find the place. Come along."},{"name":"RYNE","text":"It's been quite a while. I hope Urianger is well."},{"name":"THANCRED","text":"And here we are at long last. I give you Urianger's humble abode."},{"name":"THANCRED","text":"Come, let's see if he's home."}],"reward":{"gil":1100},"reqs":{"jobs":[{"lvl":72,"id":142}],"questsType":"all","quests":[68843,68844]},"next":[68847,68934,68936]},"partials":[{"type":"npc","id":"1028981","obj":{"i":1028981,"n":"Thancred","l":2956,"q":1}},{"type":"npc","id":"1028999","obj":{"i":1028999,"n":"Thancred","l":2956,"q":1}},{"type":"quest","id":"68843","obj":{"i":68843,"n":"Sul Uin's Request","g":8,"l":"Il Mheg","s":290}},{"type":"quest","id":"68844","obj":{"i":68844,"n":"Ys Iala's Errand","g":8,"l":"Il Mheg","s":300}},{"type":"quest","id":"68847","obj":{"i":68847,"n":"Courting Cooperation","g":8,"l":"Il Mheg","s":330}},{"type":"quest","id":"68934","obj":{"i":68934,"n":"Delightful Decorations","g":116,"l":"Il Mheg","s":2260,"f":1}},{"type":"quest","id":"68936","obj":{"i":68936,"n":"Revolting Refreshments","g":116,"l":"Il Mheg","s":2280}}]}