{"quest":{"name":"Il Mheg, the Faerie Kingdom","location":"Il Mheg","id":68842,"patch":5.0,"sort":280,"icon":100901,"eventIcon":71201,"issuer":1028956,"target":1028970,"genre":8,"journal":["Thancred is trying to think his way out of the present predicament.","From what little he is able to make of the mischievous voices, Thancred believes that the pixies wish to play with you. He reasons that they may therefore allow you to find their village, Lydha Lran─if nowhere else. At his suggestion, the party continues along the path.","You soon arrive at the pixie settlement, but see no sign of its residents. Convinced this means their games have already begun, Thancred suggests that you search for a plant with a furled tip called a looking grass which should allow you to see them. Before you set about your task, you are warned not to respond to any voices that call to you, lest you fall prey to further mischief.","You succeed in finding the looking grass, but not wholly unscathed. You hurry back to Thancred that he might put an end to the pixies' games.","Thancred puts the looking grass to use, and moments later the pixies pop into being all around you. Unfortunately, they prove disinclined to let you continue on your way, and after a moment's discussion declare that you must lend them a helping hand. Heaving a heavy sigh, Thancred suggests splitting up to tend to the pixies' chores."],"objectives":["Speak with Thancred.","Search for looking grass.","Deliver the looking grass to Thancred."],"dialogue":[{"name":"ALPHINAUD","text":"So...it <span class=\"emphasis\">is</span> faeries?"},{"name":"ALISAIE","text":"I was worried about the others back in Lakeland, but maybe I should be worried about us."},{"name":"RYNE","text":"I'm trying my best to remember...but it feels like peering through fog."},{"name":"THANCRED","text":"As it stands, we cannot hope to find the way to Urianger. For that, we must convince the pixies to lift the spell."},{"name":"THANCRED","text":"From what I could make of the voices, the creatures want to play with us. If that is the case, they <span class=\"emphasis\">should</span> permit us to find their village─Lydha Lran."},{"name":"THANCRED","text":"Come. I have a sneaking suspicion this path will lead us directly into their midst."},{"name":"THANCRED","text":"Oh, and I should mention that Minfilia has been informed of our situation. Of the different worlds and our mission. You may consider her an ally."},{"name":"ALPHINAUD","text":"The sense of disorientation is quite overwhelming. I cannot take a dozen steps without forgetting whence we came."},{"name":"ALISAIE","text":"There's not a soul in sight, yet I feel eyes all over us..."},{"name":"RYNE","text":"Hmm... There was a plant which might help us...if only I could remember what it looked like..."},{"name":"THANCRED","text":"Well, here we are. Yet the pixies are nowhere to be seen. Knowing them, their games have already begun. In which case..."},{"name":"THANCRED","text":"<span class=\"highlight\">Forename</span>─there is a variety of plant native to these parts with a distinctive furled tip."},{"name":"THANCRED","text":"\"Looking grass“ is its name─so called because it can be used to spy pixies, believe it or not. I'll...explain how I know all of this later, but first, I need you to help me find some."},{"name":"THANCRED","text":"Oh─if a voice calls to you, under no circumstances should you respond. You will only subject yourself to further mischief."},{"name":"THANCRED","text":"Remember, the plant has a furled tip. And I cannot stress this enough, but do not respond to any voices you hear."},{"name":"SYSTEM","text":"You search the scrub, but find nothing resembling looking grass. Suddenly, a voice rings out..."},{"name":"PIXIEVOICEA03306","text":"(-Adorable Voice-)Hee hee hee... Greetings, mortal! What is your name?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"<span class=\"highlight\">Forename Surname</span>."},{"name":"A1","text":"..."},{"name":"PIXIEVOICEA03306","text":"(-Adorable Voice-)<span class=\"highlight\">Forename Surname</span>, <span class=\"highlight\">Surname</span> <span class=\"highlight\">Forename</span>! A wonderful name! Pretty like morning dew and funny like caterpillars!"},{"name":"PIXIEVOICEA03306","text":"(-Adorable Voice-)I shall slice it and splice it and make it mine! <span class=\"emphasis\">All</span> mine! And when your name is mine, so are <span class=\"emphasis\">you</span>! Hee hee hee..."},{"name":"SYSTEM","text":"Your body begins to feel heavy..."},{"name":"PIXIEVOICEA03306","text":"(-Adorable Voice-)Oh, you don't have a name? How very, very sad. I could have had sooo much fun with it, hee hee hee..."},{"name":"PIXIEVOICEB03306","text":"(-Kindly Voice-)What is it that you seek, child? Perhaps I can help you find it."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm searching for looking grass."},{"name":"A2","text":"..."},{"name":"PIXIEVOICEB03306","text":"(-Kindly Voice-)Ah yes, I know the plant. And being the kindly pixie that I am, I shall take you to it."},{"name":"PIXIEVOICEB03306","text":"(-Kindly Voice-)Just close your eyes and focus on my voice. Set your mind adrift, and together we shall go to the ends of the realm."},{"name":"PIXIEVOICEB03306","text":"Hmph, such a rude child, and too clever by half! I shall seek my fun elsewhere!"},{"name":"SYSTEM","text":"Searching the scrub, you find what appears to be looking grass. Suddenly, a voice rings out..."},{"name":"PIXIEVOICEC03306","text":"(-Playful Voice-)Ooh, a visitor! Where are you from, pray tell?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"The Crystarium."},{"name":"A3","text":"..."},{"name":"PIXIEVOICEC03306","text":"(-Playful Voice-)What is that? Where is that? When is that? In your dreams, perhaps?"},{"name":"PIXIEVOICEC03306","text":"(-Playful Voice-)Forget all about that place, for Il Mheg is your home now. Today and tomorrow and forevermore..."},{"name":"PIXIEVOICEC03306","text":"(-Playful Voice-)Hmmm... Perhaps this one's hard of hearing... AHEM! WHAT BRINGS YOU HERE!?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I'm here to see Urianger."},{"name":"A4","text":"Leave me alone!"},{"name":"A4","text":"..."},{"name":"PIXIEVOICEC03306","text":"(-Playful Voice-)Ah, so you <span class=\"emphasis\">can</span> hear me! Good, good!"},{"name":"PIXIEVOICEC03306","text":"(-Playful Voice-)Come, let's chitter-chatter, jibber-jabber, bibble-babble! Today and tomorrow and forevermore..."},{"name":"PIXIEVOICEC03306","text":"(-Playful Voice-)Ach! Stone-deaf! How boring!"},{"name":"PIXIEVOICEC03306","text":"(-Playful Voice-)Still...picking plants at our village is as good as indulging in our hospitality. And who are we to turn you away? Hee hee, stay awhile...stay <span class=\"emphasis\">forever</span>!"},{"name":"THANCRED","text":"I take it you met with some trouble. Apologies for subjecting you to that."},{"name":"THANCRED","text":"Can I assume from your presence that you managed to find us some looking grass?"},{"name":"THANCRED","text":"Yes, this is the stuff. Thus armed, we should be able to see through the pixies' veil of invisibility. And seeing them is the first step to dealing with them."},{"name":"THANCRED","text":"Come, let's gather everyone and put Urianger's little trick to good use."}],"reward":{"gil":3242,"items":[{"id":26837}]},"reqs":{"jobs":[{"lvl":72,"id":142}],"quests":[68841]},"next":[68843,68844,68845,68928,68929,68930,68931]},"partials":[{"type":"npc","id":"1028956","obj":{"i":1028956,"n":"Thancred","l":2956,"q":2}},{"type":"npc","id":"1028970","obj":{"i":1028970,"n":"Thancred","l":2956,"q":1}},{"type":"item","id":"26837","obj":{"i":26837,"n":"Deepgold Chest Gear Coffer (IL 395)","l":1,"c":26559,"t":61}},{"type":"quest","id":"68841","obj":{"i":68841,"n":"The Oracle of Light","g":8,"l":"Lakeland","s":270}},{"type":"quest","id":"68843","obj":{"i":68843,"n":"Sul Uin's Request","g":8,"l":"Il Mheg","s":290}},{"type":"quest","id":"68844","obj":{"i":68844,"n":"Ys Iala's Errand","g":8,"l":"Il Mheg","s":300}},{"type":"quest","id":"68845","obj":{"i":68845,"n":"Oul Sigun's Plea","g":8,"l":"Il Mheg","s":310}},{"type":"quest","id":"68928","obj":{"i":68928,"n":"What's in a Name","g":116,"l":"Il Mheg","s":2201}},{"type":"quest","id":"68929","obj":{"i":68929,"n":"A Hairy Request","g":116,"l":"Il Mheg","s":2210}},{"type":"quest","id":"68930","obj":{"i":68930,"n":"Flowers of Fury","g":116,"l":"Il Mheg","s":2220}},{"type":"quest","id":"68931","obj":{"i":68931,"n":"The Forbidden Lran","g":116,"l":"Il Mheg","s":2230,"f":1}}]}