{"quest":{"name":"A Little Faith","location":"Lakeland","id":68859,"patch":5.0,"sort":450,"eventIcon":71201,"issuer":1029167,"target":1030889,"genre":8,"journal":["Urianger appears lost in thought."],"objectives":["Survey the area.","Search for the timeworn tablet.","Speak with Urianger."],"dialogue":[{"name":"THANCRED","text":"I do not doubt this place could weather another assault by the sin eaters, but if the Eulmorans return in force, it will be quite another matter."},{"name":"THANCRED","text":"That said, the guard could perhaps use the terrain to their advantage... Hm. I will see if I can convince the captain to lay a few traps out in the field."},{"name":"RYNE","text":"Thancred and I have come across these ruined churches before. I wish I could've seen them before the Flood. The windows were works of art, I'm told..."},{"name":"URIANGER","text":"At the height of Lakeland's prosperity, these sites served not as man's final bastion, but as testament to his ingenuity and architectural prowess."},{"name":"URIANGER","text":"The Church of the First Light was responsible for many such marvels, building majestic chapels in every corner of the realm."},{"name":"URIANGER","text":"Alas, the Flood with its inexorable tides would drown nigh every one, and did all but put an end to the religion as a whole. For the creatures which then did rise from that fulgent deluge were seen as agents of divine punishment, sent to devour sin and sinner both─whence came the name of “sin eater.”"},{"name":"URIANGER","text":"The people were lost, seemingly forsaken by their god."},{"name":"URIANGER","text":"Yet where there is light, there hath ever been shade, and 'twas in the dark they sought solace."},{"name":"URIANGER","text":"The most devout of these worshipers of shadow did then migrate to the Rak'tika Greatwood. But that is a tale for another time."},{"name":"URIANGER","text":"For now, let us find what remaineth of the chapel here."},{"name":"THANCRED","text":"Despite their <span class=\"emphasis\">architectural prowess</span>, I can make neither head nor tail of anything in this place. You would think the remnants of a church would be more conspicuous."},{"name":"RYNE","text":"I've seen no sign of the church, but it must be around here somewhere..."},{"name":"URIANGER","text":"'Twould be most unusual, but...mayhap the hall was built below ground."},{"name":"URIANGER","text":"...Aye. This is indeed the church we seek."},{"name":"RYNE","text":"It's surprisingly intact."},{"name":"RYNE","text":"What little is left of the churches I've seen until now has always borne the scars of decades of disuse."},{"name":"URIANGER","text":"Its subterranean construction hath done much to protect the hall from the ravages of time. Yet the reason for its remarkable preservation may be deduced from its decoration."},{"name":"URIANGER","text":"As faith in the Light did wane, so rose reverence for the Dark."},{"name":"URIANGER","text":"...And its followers did want for places of worship. To be plain, the standards which do adorn these walls belong not to those who built them, but to worshipers of the Dark─the Night's Blessed."},{"name":"THANCRED","text":"...Who subsequently migrated to Rak'tika, yes?"},{"name":"URIANGER","text":"Indeed. 'Twas beneath the shaded boughs of the Rak'tika Greatwood that they finally found sanctuary."},{"name":"URIANGER","text":"Oft and many times did Eulmore make spurious overtures of friendship unto them, but they are no fools."},{"name":"URIANGER","text":"The Exarch knoweth full well that Y'shtola, in her seclusion, doth labor to learn all she may of the Blessed and their past. 'Tis why he sent us here, I now see."},{"name":"URIANGER","text":"The tablet of which he spoke no doubt provideth a glimpse into the history that she so yearneth to comprehend."},{"name":"THANCRED","text":"Well then─we'd better hurry up and find it."},{"name":"THANCRED","text":"Can anyone tell me what this infernal tablet even looks like?"},{"name":"RYNE","text":"I can barely see my hand in front of my face. If only that torch were a little closer..."},{"name":"URIANGER","text":"Were the tablet a fragment of holy scripture, 'twould most assuredly rest here on this altar. Yet this would, I presume, also have been where the Blessed placed the Font of Seeing used in the practice of their faith... Whither, then, would they have set the tablet?"},{"name":"SYSTEM","text":"Search your surroundings for the tablet. You may move the camera as well as zoom in and out. Target an area and inspect it with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"URIANGER","text":"<span class=\"emphasis\">Within</span> the altar, thou sayest?"},{"name":"THANCRED","text":"I certainly hope this is what we were looking for."},{"name":"RYNE","text":"How were you able to see it in the dark? And inside the altar of all places..."},{"name":"URIANGER","text":"Naught escapeth thine eye, 'twould seem. This is indeed the tablet we seek."},{"name":"URIANGER","text":"Curious... These engravings predate the Night's Blessed. If I am not mistaken, they are writ in the script of the ancient empire of Ronka, whose capital once stood in the midst of what is now Rak'tika."},{"name":"URIANGER","text":"'Twill be no small matter to decipher them... Hm! A fine gift for our seeker of truth. 'Tis plain the Exarch understandeth Y'shtola only too well..."},{"name":"URIANGER","text":"But come─let us quit this place and make ready for our journey into the woods."}],"reward":{"gil":779},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68858]},"next":[68860]},"partials":[{"type":"npc","id":"1029167","obj":{"i":1029167,"n":"Urianger","l":2953,"q":2}},{"type":"npc","id":"1030889","obj":{"i":1030889,"n":"Urianger","l":2953,"q":2}},{"type":"quest","id":"68858","obj":{"i":68858,"n":"A Party Soon Divided","g":8,"l":"The Crystarium","s":440}},{"type":"quest","id":"68860","obj":{"i":68860,"n":"Into the Dark","g":8,"l":"Lakeland","s":460}}]}