{"quest":{"name":"A Fitting Payment","location":"Il Mheg","id":68850,"patch":5.0,"sort":360,"eventIcon":71201,"issuer":1029564,"target":1029572,"genre":8,"journal":["Wyd Aenc sniffs at you expectantly."],"objectives":["Speak with Marn Ose.","Slay moss fungi for their legs.","Deliver the moss fungus legs to Marn Ose."],"dialogue":[{"name":"THANCRED","text":"Well enough to be served. The question is whether we can provide a fitting reward."},{"name":"RYNE","text":"What do I need help with? Hmmm..."},{"name":"URIANGER","text":"Though the Nu Mou may appear placid and amicable, be fairly warned that they live by uncompromising codes."},{"name":"URIANGER","text":"Codes such as that which sayeth the payment must precisely befit the service. Be it an item or a task, have care thou givest neither more nor less than what is requested."},{"name":"WYDAENC","text":"You will offer your patronage to our people too, yes?"},{"name":"WYDAENC","text":"Let's see... Perhaps you can begin with Marn Ose. They are one of our foremost artisans, once held in the highest esteem by the knights of Voeburt."},{"name":"WYDAENC","text":"With the knights gone, however, Marn Ose has had no opportunity to put their skills to use. They would be overjoyed for your patronage."},{"name":"MARNOSE","text":"One thousand one hundred and eighty-two, one thousand one hundred and eighty-three, one thousand one hundred and eighty-four... Wait, did I already count that leaf?"},{"name":"MARNOSE","text":"Uwaaaaaah! Who─ What─ Where─ Wait, you're a...a <span class=\"emphasis\">mortal</span>!? Huzzah! Huzzah!"},{"name":"MARNOSE","text":"Well met! Yes, very well met indeed! Have you old and tired arms and armor that are threatening to fall apart at critical junctures in battle?"},{"name":"MARNOSE","text":"If you answered yes, you've come to the right Nu Mou! I will restore your equipment to pristine condition for a payment of a pair of moss fungus legs!"},{"name":"MARNOSE","text":"Moss fungi roam just outside the cave. Please, please, <span class=\"emphasis\">please</span> give their legs─and your patronage─to me!"},{"name":"MARNOSE","text":"Have you obtained the moss fungus legs? Bring them to me, and I will restore your equipment to pristine condition!"},{"name":"MARNOSE","text":"Ah, you are returned! And with the moss fungus legs, I hope?"},{"name":"MARNOSE","text":"They are tools of my trade, lest you wonder, used to polish metal and leather alike to a lustrous sheen. Now that I have work again, I must replenish my stores!"},{"name":"Q1","text":"How many moss fungus legs will you give?"},{"name":"A1","text":"One."},{"name":"A1","text":"Two."},{"name":"A1","text":"Three."},{"name":"MARNOSE","text":"One? But...I asked for two..."},{"name":"MARNOSE","text":"Grrr! No, no, NO! This wasn't the agreement!"},{"name":"MARNOSE","text":"You think my work cheap? Well then, you will have cheap! Oh yes, I'll make a fine mess of everything you're wearing! Rip it to shreds!"},{"name":"MARNOSE","text":"...Hm? Wait, there are two legs here. &lt;sigh&gt; You mustn't tease us faeries so. In my agitation, I could've done much worse than simply snap at you."},{"name":"MARNOSE","text":"You see, for there to be honor in a task, we must receive precisely what it is worth. Too little means you belittle our ability, too much means you question our integrity."},{"name":"MARNOSE","text":"You've given me fitting payment, so my services are at your disposal. I shall begin by inspecting your equipment."},{"name":"MARNOSE","text":"Huzzah! Two moss fungus legs as befits the work! Ahhh, to have neither more nor less expected of us than what we can provide─there is no greater joy!"},{"name":"MARNOSE","text":"You see, for there to be honor in a task, we must receive precisely what it is worth. Too little means you belittle our ability, too much means you question our integrity."},{"name":"MARNOSE","text":"You've given me fitting payment, so my services are at your disposal. I shall begin by inspecting your equipment."},{"name":"MARNOSE","text":"Three? But...I asked for two..."},{"name":"MARNOSE","text":"Grrr! No, no, NOOO! This wasn't the agreement!"},{"name":"MARNOSE","text":"You doubt that I'll fulfill the work for two moss fungus legs, so you tempt me with another? May as well call me a grasping mutt and spit in my eye!"},{"name":"MARNOSE","text":"Well, if you think me a bad Nu Mou, then a bad Nu Mou I will be! Oh yes, I'll make a fine mess of everything you're wearing! Rip it to shreds!"},{"name":"MARNOSE","text":"...Hm? Wait, there are two legs here. &lt;sigh&gt; You mustn't tease us faeries so. In my agitation, I could've done much worse than simply snap at you."},{"name":"MARNOSE","text":"You see, for there to be honor in a task, we must receive precisely what it is worth. Too little means you belittle our ability, too much means you question our integrity."},{"name":"MARNOSE","text":"You've given me fitting payment, so my services are at your disposal. I shall begin by inspecting your equipment."},{"name":"MARNOSE","text":"Hmmm, I see, I see..."},{"name":"MARNOSE","text":"Though I must ask for a small fee for the materials, I'm pleased to say that all your arms and armor may be restored. If you mean to change them in the near future, however, there's no need to hurry."},{"name":"MARNOSE","text":"My first repair is complimentary─here's the coin which you may pay me with when you desire to have work done. Many thanks for your patronage!"},{"name":"SYSTEM","text":"Marn Ose's shop is open for business!"},{"name":"MARNOSE","text":"Oh, and if you mean to offer your patronage to another, may I suggest Ys Gyuf yonder?"},{"name":"MARNOSE","text":"Judging from your equipment, 'tis plain you're no stranger to battle. I believe Ys Gyuf will have something to offer you!"}],"reward":{"gil":1500},"reqs":{"jobs":[{"lvl":73,"id":142}],"quests":[68849]},"next":[68851]},"partials":[{"type":"npc","id":"1029564","obj":{"i":1029564,"n":"Wyd Aenc","l":2956,"q":1}},{"type":"npc","id":"1029572","obj":{"i":1029572,"n":"Marn Ose","l":2956,"q":1}},{"type":"quest","id":"68849","obj":{"i":68849,"n":"A Visit to the Nu Mou","g":8,"l":"Il Mheg","s":350}},{"type":"quest","id":"68851","obj":{"i":68851,"n":"Spore Sweeper","g":8,"l":"Il Mheg","s":370}}]}