{"quest":{"name":"A Party Soon Divided","location":"The Crystarium","id":68858,"patch":5.0,"sort":440,"icon":100906,"eventIcon":71201,"issuer":1027231,"target":1029167,"genre":8,"journal":["The manager of suites is in a cheerful mood.","In his usual, jovial tone, the manager of suites informs you the Scions and the Crystal Exarch are waiting for you in the Ocular.","The tension in the room is palpable as you enter the Ocular, and it immediately becomes clear why when you see an unexpected face in the room─Emet-Selch. He continues to cling to the claim that he comes only to observe your efforts in defeating the Lightwardens, once more offering his hand in partnership. Seeing the Scions' icy─yet entirely expected─response, he takes his leave. Ascian schemes aside, the Scions decide it best to split up to search for the remaining Lightwardens of Norvrandt. You, along with Thancred, Minfilia, and Urianger, have been tasked with seeking out Y'shtola in the Rak'tika Greatwood.","Before you set off, the Crystal Exarch makes a request. On the way to the Rak'tika Greatwood, he asks that you stop at Fort Jobb and search for a particular tablet in the ruins. It is a holy text he believes may be of interest to Y'shtola, who presently resides with worshipers of the Dark─the Night's Blessed.","A short journey north from the Crystarium takes you to Fort Jobb. Urianger hopes to keep the search brief, that you might begin your journey to find Y'shtola and slay the Lightwarden in earnest."],"objectives":["Proceed to the Ocular.","Speak with the Crystal Exarch.","Speak with Urianger at Fort Jobb."],"dialogue":[{"name":"GUIDEOFTHEPENDANTS","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Good morning</span><span class=\"alternative\">Good day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I do hope you are well rested."},{"name":"GUIDEOFTHEPENDANTS","text":"The Exarch and your companions are presently gathered in the Ocular. He asks that you convene with them at your earliest convenience."},{"name":"ALPHINAUD","text":"I confess, a great deal of my time in Kholusia was spent befriending the people, but that is not to say I gave no thought to our primary goal."},{"name":"ALPHINAUD","text":"Once I have escorted the Exarch to Eulmore, you can be certain I will do all I can to discern the whereabouts of any Warden that may be hiding in Kholusia."},{"name":"ALISAIE","text":"There are so many ruins scattered throughout Amh Araeng... I'm honestly not even sure where to start."},{"name":"THANCRED","text":"Minfilia and I are no strangers to Rak'tika, but this is perhaps the first time we've bothered entering through the proverbial front door."},{"name":"RYNE","text":"At last I can finally meet Y'shtola. Thancred has told me so much about her."},{"name":"URIANGER","text":"I should be glad to apprise thee of Y'shtola's recent endeavors during our journey to Rak'tika."},{"name":"MYSTERYVOICE","text":"Before you leave, I would make a request of you."},{"name":"MYSTERYVOICE","text":"There is a church─or rather, the ruins of a church─at Fort Jobb. Might I ask that you go there before seeking out Y'shtola?"},{"name":"MYSTERYVOICE","text":"It was a place where people once gathered to worship the Light. Alas, it has long since fallen into disuse."},{"name":"MYSTERYVOICE","text":"Yet within that hall there remains a tablet whose writings I believe may prove of use to Y'shtola. At the very least, such a relic would make a suitable gift for your reunion."},{"name":"URIANGER","text":"A most considerate proposal. Very well. Ere we depart to Rak'tika, we shall journey unto Fort Jobb that we might secure this relic."},{"name":"MYSTERYVOICE","text":"Safe travels, <span class=\"highlight\">Forename</span>. I pray that tablet and its contents prove of interest to Y'shtola."},{"name":"THANCRED","text":"I do not doubt this place may weather another assault by the sin eaters, but they cannot hope to hold it should the Eulmoran soldiers return."},{"name":"THANCRED","text":"Even with their limited numbers, the guard can use the terrain to their advantage. Perhaps I can convince the captain to lay a few traps out in the field."},{"name":"RYNE","text":"Thancred and I have come across these ruined churches before. I wish I could've seen them before the Flood. The windows were works of art, I'm told..."},{"name":"URIANGER","text":"Here amidst these ruins we will find the Church of the First Light, and within that hallowed hall the tablet we seek."},{"name":"URIANGER","text":"Time is of the essence, my friend. Let us be quick."}],"reward":{"gil":967,"items":[{"id":26847}]},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68857]},"next":[68859,68971,68972,68973,68992]},"partials":[{"type":"npc","id":"1027231","obj":{"i":1027231,"n":"Manager Of Suites","l":2951,"q":6}},{"type":"npc","id":"1029167","obj":{"i":1029167,"n":"Urianger","l":2953,"q":2}},{"type":"item","id":"26847","obj":{"i":26847,"n":"Bluespirit Head Gear Coffer (IL 403)","l":1,"c":26558,"t":61}},{"type":"quest","id":"68857","obj":{"i":68857,"n":"The Wheel Turns","g":8,"l":"Il Mheg","s":430}},{"type":"quest","id":"68859","obj":{"i":68859,"n":"A Little Faith","g":8,"l":"Lakeland","s":450}},{"type":"quest","id":"68971","obj":{"i":68971,"n":"Lofty Goals","g":113,"l":"Lakeland","s":4001}},{"type":"quest","id":"68972","obj":{"i":68972,"n":"You Had One Jobb","g":113,"l":"Lakeland","s":4010}},{"type":"quest","id":"68973","obj":{"i":68973,"n":"Of Graveyards and Gremlins","g":113,"l":"Lakeland","s":4020}},{"type":"quest","id":"68992","obj":{"i":68992,"n":"On Her Own","g":113,"l":"Lakeland","s":4030}}]}