{"quest":{"name":"The Elder's Answer","location":"Il Mheg","id":68853,"patch":5.0,"sort":390,"icon":100904,"eventIcon":71201,"issuer":1027672,"target":1029577,"genre":8,"journal":["Wyd Lad looks a satisfied Nu Mou.","Wyd Lad informs you that Elder Wyd Aenc has returned from deliberations and likely has tidings for you. You make your way to the inner cookfire of Pla Enni, where the elder awaits.","Having thanked you for your patronage, Wyd Aenc gives you your answer regarding the stone scepter. Acknowledging that they do not have the power to deal with their fallen monarch, the Nu Mou have decided to entrust the relic to you. Now only the crystal shoes, held in the amaro's safekeeping, remain to be collected. Without further ado, you set out for Wolekdorf to meet with the leader of the amaro, a hulking creature named Seto.","Though Seto receives you warmly, he believes that facing the faerie king is folly, and refuses to give you the crystal shoes. In order to find a way to change Seto's mind, Urianger believes it would behoove you to understand the nature of the amaro of Il Mheg. To that end, he bids you acquaint yourself with the creatures, and recommends giving them a gentle pat by way of a greeting. Scanning the area, your eyes settle on an amaro named Rispa.","Receiving your affectionate gesture with delight, Rispa reminisces about his departed master, a knight of the Kingdom of Voeburt. You learn that the amaro has chosen to remain in Il Mheg, where the kingdom once stood, out of respect for the man's memory. You spare a moment to admire the strength of their bond, then turn your attention to a creature named Eo An.","While not exactly thrilled by your patting, Eo An clarifies that she does not dislike men; on the contrary, amaro were bred to be fond of them. In the beginning, the creatures were mindless beasts, but a mage of Ronka bestowed upon them the gift of intelligence. When the empire fell, those with the gift eventually died out, but some few are still born with the seed of intelligence even now. As you mull over the tale, an amaro named Nimbus catches your eye.","Rather heartwarmingly, Nimbus is overjoyed by your attention. He goes on to explain that he and his fellows have been starved of the company of men ever since they settled in Il Mheg. Confident that you now understand the creatures, you bend your steps back to Urianger.","Urianger affirms your findings that the amaro of Il Mheg bear an intense and abiding love for men, and concludes that it is out of genuine concern for your welfare that Seto sought to prevent your confrontation with the faerie king. Yet confront the faerie king you must, and to that end you must find a way to win the creature's cooperation."],"objectives":["Speak with Wyd Aenc.","Speak with the enormous amaro.","/pet Rispa.","/pet Eo An.","/pet Nimbus.","Speak with Urianger."],"dialogue":[{"name":"WYDAENC","text":"Still offering your patronage to us? When you have a moment, I would speak with you all."},{"name":"WYDLAD","text":"Ahhh, there's nothing like honorable work. Thanks again for giving me the opportunity!"},{"name":"WYDLAD","text":"Oh, I should mention that Elder Wyd Aenc returned a moment ago. If you seek them out, I daresay they'll have tidings for you."},{"name":"WYDLAD","text":"Elder Wyd Aenc is at the inner cookfire. If you seek them out, I daresay they'll have tidings for you."},{"name":"WYDAENC","text":"Ah, there you are. I'm informed that you've been an excellent patron to our people. For that, you have my thanks."},{"name":"WYDAENC","text":"Now then, you will be pleased to hear that we've come to a decision regarding the scepter. If you would gather your companions, I will deliver our answer."},{"name":"WYDAENC","text":"Before I begin, please allow me to express my gratitude for your kind patronage."},{"name":"WYDAENC","text":"Having been deprived of purpose for so long, our people are overjoyed at being able to serve again."},{"name":"WYDAENC","text":"But on to the matter of the stone scepter."},{"name":"WYDAENC","text":"During our deliberations, we were forced to concede that we will never have the power to deal with our fallen monarch. We can release Titania neither from the castle nor from torment."},{"name":"WYDAENC","text":"In light of this, we have decided to entrust their fate to you."},{"name":"WYDAENC","text":"Take it─the stone scepter of the Nu Mou."},{"name":"THANCRED","text":"This makes three relics. One more and we can arrange a meeting with the Warden."},{"name":"WYDAENC","text":"Ere you continue your quest, allow me to enlighten you as regards your foe."},{"name":"WYDAENC","text":"Know that Titania is not a name, but a title bestowed upon one chosen to lead the pixies by the grace of nature."},{"name":"WYDAENC","text":"This leader, upon Il Mheg's founding, arose as ruler of all fae folk to bring order to our riotous kind. In our turn, we fae folk render our blessing unto nature─unto water, wood, and wind─that our king might be further empowered."},{"name":"WYDAENC","text":"Though they are become a sin eater, their powers remain unchanged. When you face them, be prepared to face the full fury of nature."},{"name":"RYNE","text":"Oh dear... Is there anything else that we should know?"},{"name":"WYDAENC","text":"Anything else...? Hmmm... Only that if you feel unready for the challenge─and none here would blame you for it─you are welcome to remain among us awhile longer."},{"name":"WYDAENC","text":"After all, I myself have yet to enjoy your patronage, and who knows when I will next have the chance? We would see that you were comfortable, of course, and do all in our power to make you feel...<span class=\"emphasis\">at home</span>. Eh heh heh..."},{"name":"FEOUL","text":"Oi!"},{"name":"FEOUL","text":"Honestly! I look away for one moment, and every faerie and their nuncle tries to steal my sapling from me!"},{"name":"FEOUL","text":"This is <span class=\"emphasis\">my</span> sapling! <span class=\"emphasis\">Mine</span>, do you hear!? Not yours and not the Fuath's! And anyone who so much as <span class=\"emphasis\">thinks</span> about trying to seduce <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> will wish they hadn't!"},{"name":"URIANGER","text":"The final relic is a pair of shoes wrought of crystal. They are held in the amaro's safekeeping at their settlement, Wolekdorf."},{"name":"URIANGER","text":"It beareth mentioning that these amaro are unlike those which thou hast heretofore encountered. Owing to a peculiarity of evolution, they are capable of speech, and thus we might negotiate with them as we have the fae folk."},{"name":"WYDAENC","text":"Though it saddens us to see you leave, we wish you well on your way."},{"name":"WYDAENC","text":"When you arrive in Wolekdorf, seek out the largest of the amaro. His name is Seto, and he is their leader and the bearer of the relic."},{"name":"WYDAENC","text":"Oh, you're still here? Do you perhaps wish to remain with us after all...?"},{"name":"NIMBUS","text":"Ghrrr... You seek our leader? Continue on past the aetheryte. You cannot miss him."},{"name":"TRAVELLER","text":"Seto? He makes his roost in the next building."},{"name":"SYSTEM","text":"An enormous amaro slumbers peacefully."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Kal!"},{"name":"A1","text":"Seto!"},{"name":"A1","text":"Mog!"},{"name":"SETO","text":"..."},{"name":"SETO","text":"Ard...bert?"},{"name":"SETO","text":"...Oh. Forgive me, I was...having a dream. Seldom do men visit us. What brings you to our village?"},{"name":"SETO","text":"Did I hear you aright? You desire the crystal shoes...that you may confront the Lightwarden?"},{"name":"SETO","text":"No. No, you mustn't think such thoughts."},{"name":"SETO","text":"Even if you are indeed immune to the Light's corruption, as you claim, vanquishing the king will bring you naught but sorrow."},{"name":"SETO","text":"Forget this folly. Return whence you came."},{"name":"THANCRED","text":"While we appreciate your concern, we have no choice in the matter. Will you not reconsider?"},{"name":"SETO","text":"..."},{"name":"URIANGER","text":"Come, my friends, let us leave him with his thoughts."},{"name":"URIANGER","text":"Hmmm... 'Tis harder by far to change the minds of they who mean well than they who mean ill."},{"name":"RYNE","text":"Forgive me...but I'm not sure I understand..."},{"name":"URIANGER","text":"And little wonder. 'Tis the first time thou hast set foot here. 'Twould behoove you all to learn something of the nature of this community, I think, and there is no surer way than to speak with its members."},{"name":"URIANGER","text":"In such wise, you will come to understand Seto's reason for refusing us─and, I hope, gain an insight into how he may yet be persuaded..."},{"name":"URIANGER","text":"So I bid ye seek out the amaro and make yourselves known unto them. A gentle touch shall suffice by way of a greeting."},{"name":"THANCRED","text":"Despite their seclusion, the amaro here appear to be quite familiar with men."},{"name":"RYNE","text":"They're so fluffy, it's like touching a cloud!"},{"name":"URIANGER","text":"Go, my friend─make thyself known unto the amaro. It requireth no more than a gentle touch."},{"name":"SETO","text":"I cannot give you the crystal shoes. Abandon this folly."},{"name":"RISPA","text":"Well now... It is not often that we are visited by men─much less unglamoured ones. What brings you so far from your own kind?"},{"name":"RISPA","text":"..."},{"name":"RISPA","text":"Khrrr...khrrrrrr... Ah, how long has it been since last I felt man's touch? I cannot help but be reminded of my master's hand..."},{"name":"RISPA","text":"He was a knight of Voeburt. A noble and valiant soul."},{"name":"RISPA","text":"But like so many others, he died fighting the sin eaters. Though he is long departed, I remain in this land out of respect for his memory."},{"name":"RISPA","text":"Such a fine feeling it is to be petted. My master had a heavy hand, made heavier still by his gauntlet, but I loved it nonetheless."},{"name":"EOAN","text":"Are you one of those treasure hunters? There is nothing left for you here."},{"name":"EOAN","text":"What are you doing? I do not understand..."},{"name":"EOAN","text":"Agh! Th-That tickles! Enough! I never had a master─I'm not accustomed to it!"},{"name":"EOAN","text":"Not that I dislike your kind, you understand. On the contrary, we amaro were bred to be fond of men."},{"name":"EOAN","text":"In the beginning, we were all of us mindless beasts. But then a mage of Ronka gave us the gift of intelligence, that we might better serve our masters."},{"name":"EOAN","text":"After that empire fell, those with the gift eventually died out. On rare occasions, however, we are born with the seed of our ancestors in us."},{"name":"EOAN","text":"If we live long enough amongst men, this seed may quicken, restoring the power of speech to us amongst other things. So it was with me...though I never had a master, as I told you."},{"name":"EOAN","text":"But I will not bore you with my sorry tale. Let it suffice to say that I am no stranger to abandonment."},{"name":"NIMBUS","text":"What is all the commotion? Did something happen while we slumbered?"},{"name":"NIMBUS","text":"Ghrrr..."},{"name":"NIMBUS","text":"Ghrrr!? What's happening!? Why am I being patted!? It's...it's <span class=\"emphasis\">wonderful</span>..."},{"name":"NIMBUS","text":"Seldom do we have the chance to enjoy the attentions of men. Your kind are loath to come here for fear of the fae folk."},{"name":"NIMBUS","text":"...But then we are fae folk too. When first we made our home here, we swore an oath to the faerie king, you see. 'Tis easy to forget sometimes."},{"name":"NIMBUS","text":"Ghrrr... You may pat me whenever you wish, and for as long as you like. My plumage is very resilient!"},{"name":"URIANGER","text":"Thou hast peered into the hearts of the amaro, I take it?"},{"name":"URIANGER","text":"Then thou canst not choose but see the intense and abiding love they bear for men. It is out of concern for our welfare, and not scorn, that Seto seeketh to dissuade us from confronting their king."},{"name":"URIANGER","text":"Yet confront their king we must, and to that end we must needs have the crystal shoes..."}],"reward":{"gil":997},"reqs":{"jobs":[{"lvl":73,"id":142}],"quests":[68852]},"next":[68854]},"partials":[{"type":"npc","id":"1027672","obj":{"i":1027672,"n":"Wyd Lad","l":2956,"q":3}},{"type":"npc","id":"1029577","obj":{"i":1029577,"n":"Urianger","l":2956,"q":2}},{"type":"quest","id":"68852","obj":{"i":68852,"n":"The Lawless Ones","g":8,"l":"Il Mheg","s":380}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}}]}