{"quest":{"name":"Memento of a Friend","location":"Il Mheg","id":68855,"patch":5.0,"sort":410,"eventIcon":71201,"issuer":1027690,"target":1027690,"genre":8,"journal":["Seto would make a personal request of you."],"objectives":["Search for Seto's medallion.","Deliver the medallion to Seto."],"dialogue":[{"name":"THANCRED","text":"Urianger tells me you've been busy trying to win Seto over, and I agree that you're the best <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the job. A silver tongue can only get one so far."},{"name":"RYNE","text":"I heard a fearsome roar... Is everything all right?"},{"name":"URIANGER","text":"Whatever Seto hath in store for thee, I wish thee godsspeed."},{"name":"SETO","text":"This is not a test of your strength, but a personal request. Please hear my tale."},{"name":"SETO","text":"A while ago, I fought sin eaters who had wandered into Il Mheg. In the heat of battle, I dropped a prized possession─a medallion. Of all the places that it should fall, it was Longmirror Lake."},{"name":"SETO","text":"We amaro are not fond of water─we certainly cannot dive very deep. I briefly entertained the thought of turning to the Fuath, but they are more likely to keep my medallion out of mischief than return it to me."},{"name":"SETO","text":"I had despaired of retrieving my treasure, but having seen what you are capable of, perhaps you will be able to find it."},{"name":"SETO","text":"While I ponder your request for the shoes, will you not go and search for my medallion? If it should elude even you, I will accept that it is gone forever."},{"name":"SETO","text":"As I recall, I was above the waters west of the castle when I dropped the medallion. I wish you luck."},{"name":"SYSTEM","text":"This does not appear to be Seto's medallion."},{"name":"SETO","text":"Ah, you are returned."},{"name":"SETO","text":"How fared your search?"}],"reward":{"gil":932},"reqs":{"jobs":[{"lvl":73,"id":142}],"quests":[68854]},"next":[68856]},"partials":[{"type":"npc","id":"1027690","obj":{"i":1027690,"n":"Seto","l":2956,"q":3}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}},{"type":"quest","id":"68856","obj":{"i":68856,"n":"Acht-la Ormh Inn","g":8,"l":"Il Mheg","s":420}}]}