{"quest":{"name":"An Unwanted Proposal","location":"The Rak'tika Greatwood","id":68867,"patch":5.0,"sort":530,"icon":100909,"eventIcon":71201,"issuer":1029221,"target":1029195,"genre":8,"journal":["Y'shtola's thirst for knowledge sated, she seems content to return to Slitherbough.","Y'shtola thanks you and Thancred for your help in infiltrating Woven Oath, bidding you rest when you return to Slitherbough.","You arrive back at Slitherbough and speak with Runar, who has been beside himself with worry over Y'shtola's absence from the village. Relieved to know you are all safe and sound, he suggests taking a seat by the fire to relax while he finishes preparations for your meal.","Runar's stew is nearly ready, and though the guards on patrol have yet to return, he asks you to inform Y'shtola it is time to eat. You approach the door to her chambers, but the sound of arguing from within stops you from knocking. It would seem she has grown exasperated with Urianger's penchant for secrets. Before their talks can reach a satisfying conclusion, however, a shrill cry for help distracts you─Eulmoran soldiers have arrived, and one of the Blessed's guards has been felled by poison.","The Night's Blessed have been given a choice: join the Children of the Everlasting Dark and swear allegiance to Eulmore, or face their retribution. The Scions must move quickly if they are to save the Night's Blessed and deny Vauthry his foothold in the Rak'tika Greatwood."],"objectives":["Speak to Runar.","Wait by the fire.","Speak with Urianger."],"dialogue":[{"name":"THANCRED","text":"Glad to see my distraction proved successful."},{"name":"YSHTOLA","text":"Let us hurry to Slitherbough. The others are waiting."},{"name":"YSHTOLA","text":"After we've returned, the two of you should rest a while. No doubt Runar will be eager to have you sample his cooking."},{"name":"YSHTOLA","text":"As soon as I discover anything of import, you will be the first to know."},{"name":"THANCRED","text":"Urianger has tended to Minfilia's wounds, but I fear his garrulous nature has gotten the better of him."},{"name":"RYNE","text":"Welcome back, <span class=\"highlight\">Forename</span>. Now that you're here, there's something I want to ask you."},{"name":"RYNE","text":"Urianger told me that Thancred was something of a rogue in the past. “As a wolf among sheep,” he said. What did he mean by that? Do you know?"},{"name":"URIANGER","text":"Rest assured Y'shtola and I shall work with all haste to decipher the tablet and its secrets."},{"name":"YSHTOLA","text":"Please, go and rest. Urianger and I will call you the moment we finish."},{"name":"RUNAR","text":"<span class=\"highlight\">Forename</span>! The guard told me you left with Master Matoya to Woven Oath."},{"name":"RUNAR","text":"And no sooner do you return than she locks herself away in her chambers without so much as a word."},{"name":"RUNAR","text":"She knows how I worry when she leaves without telling me. &lt;sigh&gt; But she is safe, and that is all that matters."},{"name":"RUNAR","text":"You must be hungry after such a journey. Why not have a seat there by the fire? The stew will soon be ready."},{"name":"RUNAR","text":"I confess I am not the greatest of cooks, but I have yet to hear any complaints."},{"name":"THANCRED","text":"That Eulmore has gained a foothold here in these woods bodes ill for the Night's Blessed."},{"name":"RYNE","text":"Surely there's something we can do to help the Night's Blessed... Isn't there?"},{"name":"URIANGER","text":"The guard hath been afflicted with a most terrible and efficacious poison."},{"name":"URIANGER","text":"We have attempted all manner of healing incantations. Alas, his condition remains unchanged."},{"name":"URIANGER","text":"At present, we can but slow the poison's advance. I pray it will afford us sufficient time to find a cure."}],"reward":{"gil":1144},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68866]},"next":[68868,69192]},"partials":[{"type":"npc","id":"1029221","obj":{"i":1029221,"n":"Y'shtola","l":2957,"q":2}},{"type":"npc","id":"1029195","obj":{"i":1029195,"n":"Urianger","l":2957,"q":2}},{"type":"quest","id":"68866","obj":{"i":68866,"n":"A Beeautiful Plan","g":8,"l":"The Rak'tika Greatwood","s":520}},{"type":"quest","id":"68868","obj":{"i":68868,"n":"Put to the Proof","g":8,"l":"The Rak'tika Greatwood","s":540}},{"type":"quest","id":"69192","obj":{"i":69192,"n":"The Great Deceiver","g":117,"l":"The Rak'tika Greatwood","s":4230,"f":1}}]}