{"quest":{"name":"Into the Wood","location":"The Rak'tika Greatwood","id":68869,"patch":5.0,"sort":550,"icon":100910,"eventIcon":71201,"issuer":1029223,"target":1029228,"genre":8,"journal":["Y'shtola would waste no time in heading to Yx'Maja.","Y'shtola rushes off to Slitherbough to inform the others preparations to enter Yx'Maja are complete. Once rested, she bids you join them at the cave that leads out to the east of Slitherbough.","With the seal of Ronka in hand, weapons at the ready, you and the Scions set out into Yx'Maja in search of the Ronkan ruins and their protectors.","As you wend your way through Yx'Maja, you are suddenly assailed by arrows from the trees. As arrows continue to rain from above, one of three figures jumps down and begins a vicious assault against Y'shtola. It is only after Urianger interrupts the lancer's onslaught that she finds an opportunity to present them with the seal of Ronka. The attack stops almost immediately. The lancer confirms the seal appears to be genuine, but her counterparts towering above in the trees are not yet certain. They invite you to follow the trail of azure flowers to their village. There they will decide if you are friend or foe.","Upon closer examination, their leader, Almet, recognizes the authenticity of your seal and welcomes you as allies of Ronka. It appears your arrival is long awaited, but to what end remains yet to be seen."],"objectives":["Speak with Y'shtola.","Survey the area.","Speak with the bow-wielding sentinel."],"dialogue":[{"name":"YSHTOLA","text":"Bearing this seal, it should be possible to enter Yx'Maja unmolested by its guardians."},{"name":"YSHTOLA","text":"I will go ahead to Slitherbough and inform the others. When you have recovered from your exertions, meet with us in the cavern leading east out of the village."},{"name":"THANCRED","text":"We've done what we can to prepare them for the worst."},{"name":"THANCRED","text":"Still, we should hurry, before the Children return with Eulmoran reinforcements."},{"name":"RYNE","text":"I'm so glad to see you're safe. Everyone is ready to go if you are."},{"name":"URIANGER","text":"That you all found the seal is perhaps bittersweet proof that the aid for which it was so painstakingly forged never came."},{"name":"URIANGER","text":"Thus did the empire crumble, its ruins reclaimed by the wood. Fate is ever a fickle mistress."},{"name":"YSHTOLA","text":"Good, you're here. Runar opened the gate for us but moments ago."},{"name":"YSHTOLA","text":"Beyond lies Yx'Maja, and presumably the Lightwarden."},{"name":"YSHTOLA","text":"It did not take long for the wood's protectors to find me when last I came here, and I expect them to fall upon us just as quickly this time."},{"name":"YSHTOLA","text":"Though we carry the seal, that is no reason for us to let down our guard."},{"name":"YSHTOLA","text":"Now, let us seek out the Warden, and put an end to its reign over these woods."},{"name":"UIMET","text":"Good to see you didn't lose your way."},{"name":"CYMET","text":"You outsiders are a strange lot, aren't you?"},{"name":"ALMET","text":"(-Bow-wielding Sentinel-)I would have the seal, that we may confirm its authenticity."},{"name":"YSHTOLA","text":"Straight to the point, I see. Very well."},{"name":"ALMET","text":"(-Bow-wielding Sentinel-)Hmmm. There is no mistaking the crest of the royal family."},{"name":"ALMET","text":"(-Bow-wielding Sentinel-)It is of proper size, and by its weight it is plain it was made from gold. The seal is indeed genuine."},{"name":"ALMET","text":"(-Bow-wielding Sentinel-)For three thousand years we have waited for this moment, and now you are finally here. I bid you welcome, allies of Ronka."},{"name":"ALMET","text":"(-Almet-)I am Almet, chieftainess of Fanow."},{"name":"UIMET","text":"Uimet, her younger sister."},{"name":"CYMET","text":"Cymet. A pleasure. We were beginning to lose hope that you would come."},{"name":"YSHTOLA","text":"I beg your pardon?"},{"name":"ALMET","text":"(-Almet-)These are troubled times for my people."},{"name":"ALMET","text":"(-Almet-)Though I can but imagine what has compelled you to venture into our woods."},{"name":"ALMET","text":"(-Almet-)You must be tired after your journey. Come, take your ease."},{"name":"UIMET","text":"If you'd like I will show you about the village. Though I must warn you it is a long way down to the forest floor, so do watch your step."}],"reward":{"gil":961},"reqs":{"jobs":[{"lvl":75,"id":142}],"quests":[68868]},"next":[68870]},"partials":[{"type":"npc","id":"1029223","obj":{"i":1029223,"n":"Y'shtola","l":2957,"q":2}},{"type":"npc","id":"1029228","obj":{"i":1029228,"n":"Bow-wielding Sentinel","l":2957,"q":1}},{"type":"quest","id":"68868","obj":{"i":68868,"n":"Put to the Proof","g":8,"l":"The Rak'tika Greatwood","s":540}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}