{"quest":{"name":"Stirring Up Trouble","location":"The Rak'tika Greatwood","id":68865,"patch":5.0,"sort":510,"eventIcon":71201,"issuer":1029194,"target":1029216,"genre":8,"journal":["Y'shtola seems quite pleased with herself. But whether she has good or bad news to share remains to be seen."],"objectives":["Speak with Y'shtola.","Search for the Blessed watchman.","Aid the Blessed watchman.","Retrieve supplies from the outpost crates.","Use a smoke bomb on the beehive.","Use a large burlap sack to take bees from the beehive.","Use a smoke bomb on the beehive.","Use a large burlap sack to take bees from the beehive.","Give the buzzing burlap sacks to Y'shtola."],"dialogue":[{"name":"THANCRED","text":"Hopefully Y'shtola has good news to share."},{"name":"THANCRED","text":"A chance to reclaim the night has lit a fire in Minfilia that I would see kindled."},{"name":"RYNE","text":"What do you suppose she's gleaned from the tablet?"},{"name":"YSHTOLA","text":"Let me begin by first explaining the origins of this tablet."},{"name":"YSHTOLA","text":"I initially believed it might detail the history of the Church of the First Light. Much to my surprise, it dates back to the end of the Ronkan Empire, and was likely written under the direction of the reigning ruler."},{"name":"YSHTOLA","text":"It was a time of strife and unceasing war with neighboring nations. With each passing day they yielded more and more territory to their enemies."},{"name":"YSHTOLA","text":"In their desperation, petitions for aid were sent out to their allies. This was one such petition."},{"name":"RYNE","text":"And you think this ancient petition will somehow help us get into Yx'Maja?"},{"name":"URIANGER","text":"Indeed we do."},{"name":"URIANGER","text":"For etched into this tablet is a method by which one may prove themself an ally of the Ronkan Empire."},{"name":"URIANGER","text":"Provided we are able to decipher said instructions, we may entreat the ruin's protectors to grant us safe passage."},{"name":"YSHTOLA","text":"The problem, however, is I presently lack the resources to decipher them in their entirety."},{"name":"YSHTOLA","text":"We have but one recourse: there exists a stone monument inscribed with ancient Ronkan text and translations into a more modern dialect which came into use after the fall of the empire. I am confident it will suit our purposes."},{"name":"RYNE","text":"Where can we find this monument?"},{"name":"YSHTOLA","text":"Here in Citia, quite close to Slitherbough, in fact."},{"name":"YSHTOLA","text":"The good news ends there, however, for it is in the possession of a rather radical faction of Dark worshipers─the Children of the Everlasting Dark."},{"name":"YSHTOLA","text":"If I am to study the monument, I must infiltrate their encampment."},{"name":"YSHTOLA","text":"I have no intention of taking longer than absolutely necessary, but I will nevertheless require time to transcribe the text I need. To ensure that I will have enough, I am afraid I must ask you and Thancred to assist me."},{"name":"THANCRED","text":"And before you even ask, the answer is no. If we're to remain unseen, our group must be as small as possible."},{"name":"RYNE","text":"...All right. I'll stay here until you return."},{"name":"THANCRED","text":"We won't be long. If anything should happen, you keep her safe."},{"name":"YSHTOLA","text":"Then let us convene outside, to the west of Slitherbough where the path diverges."},{"name":"RYNE","text":"Take care, <span class=\"highlight\">Forename</span>."},{"name":"URIANGER","text":"For my part, I shall make all possible preparations that Y'shtola may begin translating the tablet upon her return."},{"name":"THANCRED","text":"All set."},{"name":"YSHTOLA","text":"The encampment we seek is to the north, but it would be foolish to simply rush in."},{"name":"YSHTOLA","text":"A guard has been posted at Cleric to keep watch over the Children. Perhaps he has aught to share of their recent activity."},{"name":"YSHTOLA","text":"But we must tread carefully. There is a chance we may encounter them along the way."},{"name":"YSHTOLA","text":"Stay close and stay alert. I would avoid a confrontation if possible."},{"name":"YSHTOLA","text":"They rejoice in dealing death to others, claiming that in doing so they cleanse their victims of sin and usher them unto the sunless sea. I would rather not sully my hands defending myself against such madmen."},{"name":"WATCHER03329","text":"Ahhh!"},{"name":"BALLOON","text":"Do not interfere with our work!"},{"name":"WATCHER03329","text":"By the blessed Dark..."},{"name":"YSHTOLA","text":"Thank goodness you are unharmed."},{"name":"THANCRED","text":"We would have arrived sooner, but we too had a rather unwelcome visit from the Children."},{"name":"WATCHER03329","text":"You are an acquaintance of Master Matoya, then. My apologies."},{"name":"WATCHER03329","text":"The Children have been acting strange of late, so I thought to take a closer look. I was careless..."},{"name":"YSHTOLA","text":"Strange? What have you seen?"},{"name":"WATCHER03329","text":"At first there seemed to be nothing out of the ordinary─the usual gathering of ingredients for poisons from flora and fauna."},{"name":"WATCHER03329","text":"But then I took notice of their venomous spiders. They've been breeding them in much greater numbers."},{"name":"WATCHER03329","text":"It's as if they're preparing for something..."},{"name":"THANCRED","text":"Any ideas as to what?"},{"name":"YSHTOLA","text":"It could be anything, really. If it meant the end of the Blessed, nothing would be too cruel or violent for them."},{"name":"YSHTOLA","text":"But perhaps we can use their present preoccupation with spiders to our advantage."},{"name":"YSHTOLA","text":"If we were to introduce a threat to the nests where they keep them, the Children would be compelled to save them. Bees, for example, are a natural predator of spiders."},{"name":"YSHTOLA","text":"Set them loose on the nests and we would have our opportunity to sneak into their encampment."},{"name":"THANCRED","text":"What a mischievous plan. I like it. With a bit of smoke we should be able to subdue a few colonies long enough to secure their hives."},{"name":"THANCRED","text":"Have you anything we might be able to use?"},{"name":"WATCHER03329","text":"We should have smoke bombs at the outpost just over there."},{"name":"THANCRED","text":"Then it's settled."},{"name":"THANCRED","text":"Grab a few smoke bombs from the outpost and search about for beehives."},{"name":"THANCRED","text":"I imagine the bees won't take too kindly to your visit, but once they're knocked out, take the beehives and bring them back here. Two will suffice, I should think."},{"name":"WATCHER03329","text":"If it's all the same to you, I'll be returning to Slitherbough. I don't want to get in the way. Stay safe, and may the shadows keep you."},{"name":"SYSTEM","text":"The bees begin to swarm!"},{"name":"THANCRED","text":"Were you able to find any?"},{"name":"YSHTOLA","text":"The guard returned to Slitherbough, but not before offering his thanks."},{"name":"YSHTOLA","text":"As for the beehives, Thancred and I were successful in acquiring what we need. How did you fare?"},{"name":"YSHTOLA","text":"This is more than enough. The Children are certain to be displeased."},{"name":"YSHTOLA","text":"Let us hurry, before the bees begin to stir."},{"name":"URIANGER","text":"I have no doubt thou wilt find the contents of the tablet most informative."}],"reward":{"gil":1234},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68864]},"next":[68866]},"partials":[{"type":"npc","id":"1029194","obj":{"i":1029194,"n":"Y'shtola","l":2957,"q":3}},{"type":"npc","id":"1029216","obj":{"i":1029216,"n":"Y'shtola","l":2957,"q":2}},{"type":"quest","id":"68864","obj":{"i":68864,"n":"Saying Good-bye","g":8,"l":"The Rak'tika Greatwood","s":500}},{"type":"quest","id":"68866","obj":{"i":68866,"n":"A Beeautiful Plan","g":8,"l":"The Rak'tika Greatwood","s":520}}]}