{"quest":{"name":"A Day in the Neighborhood","location":"The Rak'tika Greatwood","id":68861,"patch":5.0,"sort":470,"eventIcon":71201,"issuer":1029194,"target":1029199,"genre":8,"journal":["Y'shtola is staring off into the distance, lost in thought."],"objectives":["Speak with Runar.","/kneel before Runar.","With the chat mode in <span class=\"highlight\">Say</span>, enter “allin tuta” to greet the residents of Slitherbough.","Speak with Minfilia."],"dialogue":[{"name":"RYNE","text":"I wish...I wish I'd never..."},{"name":"YSHTOLA","text":"I am not indifferent to Thancred's troubles. Nevertheless, I will not apologize for holding him to a higher standard after all these years. He has ever been a man of considerable resolve, and that is what I will continue to expect."},{"name":"YSHTOLA","text":"Though it heartens me to know that some of us remain ourselves in spite of our present circumstances."},{"name":"YSHTOLA","text":"I can but imagine how Alisaie and Alphinaud have changed since arriving here in the First."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Change is part of life. We can but hope it's change for the better."},{"name":"A1","text":"Perhaps you should be concerned with how <span class=\"emphasis\">you</span> have changed."},{"name":"YSHTOLA","text":"&lt;sigh&gt; You're right. And after my untoward remarks to Thancred, no doubt he thinks I changed for the worst. I will have to speak with him later."},{"name":"YSHTOLA","text":"I realize I am not as I was on the Source, but I cannot say I regret the decisions that allowed me to come this far."},{"name":"YSHTOLA","text":"Ahem. Returning to the matter at hand─I really must begin work on deciphering this tablet. In the meantime, perhaps you should take a look about Slitherbough."},{"name":"YSHTOLA","text":"If there is anything you need, pray speak with Runar at the plaza."},{"name":"YSHTOLA","text":"I have instructed Runar to help you with anything you should require. "},{"name":"RUNAR","text":"Welcome, friend. Welcome! My apologies for our less-than-hospitable greeting earlier."},{"name":"RUNAR","text":"Tell me, what is your name? From where do you hail?"},{"name":"RUNAR","text":"From the Crystarium! I see. And this tablet you've brought may help us find the Lightwarden here in Rak'tika?"},{"name":"RUNAR","text":"Well, you are welcome to stay with us for as long as you need. Come, let me show you around."},{"name":"RYNE","text":"Would it be all right if I joined you?"},{"name":"RUNAR","text":"Of course, of course. Anything for the guests of our dear Master Matoya."},{"name":"RYNE","text":"Thank you. She means a great deal to the Night's Blessed, doesn't she?"},{"name":"RUNAR","text":"If not for her, we may have all perished in the great fire."},{"name":"RUNAR","text":"With our priests slain and our home in ruins, we were at the mercy of the sin eaters."},{"name":"RUNAR","text":"It was she who drove them back. And with her sage guidance, we were able to rebuild."},{"name":"RUNAR","text":"Before long she became a central figure in our community─a great oak within whose shadow many have come to find solace."},{"name":"RUNAR","text":"That is not to say there were not those hesitant to grant an outsider such authority, myself included."},{"name":"RUNAR","text":"Perhaps it is the smile in her eyes when she speaks of the sunless sea. I feel...whole again, now that she is with us, and I have no doubt the others feel the same. "},{"name":"RUNAR","text":"She is as much a part of the Night's Blessed as any of us, and we are grateful for all she does in service to the Dark."},{"name":"RUNAR","text":"But you did not hear this from me, yes?"},{"name":"RUNAR","text":"Now, you should know there are certain customs we ask guests to adhere to so long as they reside within Slitherbough."},{"name":"RYNE","text":"To show reverence to the Dark?"},{"name":"RUNAR","text":"In a word, yes. But fear not, it is not too involved."},{"name":"RUNAR","text":"Let us begin with something simple. Follow me."},{"name":"RYNE","text":"I thought Master Matoya kept her room dark because she didn't need the light, but they're all like hers, aren't they..."},{"name":"RUNAR","text":"Should you see any of our people come to this chamber, they have likely returned from a journey beyond the borders of Rak'tika."},{"name":"RUNAR","text":"We use the water stored here to cleanse ourselves of the Light's impurity."},{"name":"RUNAR","text":"A simple and perhaps peculiar custom, but it is one of our most important."},{"name":"RUNAR","text":"Would you two <span class=\"highlight\">kneel</span> for just a moment, that I might rid you of the Light's impurity?"},{"name":"RYNE","text":"We mustn't be rude to our hosts."},{"name":"RUNAR","text":"Please, this will only take a moment."},{"name":"RUNAR","text":"This will only take a moment, I promise."},{"name":"SYSTEM","text":"As Runar lightly sprays you with water, your skin begins to tingle."},{"name":"RUNAR","text":"And with that, you have been cleansed of the Light's blighted touch. How do you feel?"},{"name":"RYNE","text":"I'm not sure, to be honest. Not refreshed, exactly, but I do feel different."},{"name":"RYNE","text":"Has this water been treated in some way?"},{"name":"RUNAR","text":"Only blessed by our priests. They are practiced in the arcane arts. As such, it is said their prayers imbue the water with a faint dark energy."},{"name":"RUNAR","text":"A prickling sensation? No one has ever spoken of such a reaction before."},{"name":"RYNE","text":"I wouldn't say it was an unpleasant sensation, but I too felt something strange."},{"name":"RUNAR","text":"Hmmm. The dark aspect of this water should have no discernible effect. Unless..."},{"name":"RUNAR","text":"By the gods! Master Matoya was right─you <span class=\"emphasis\">are</span> sin eaters!"},{"name":"RUNAR","text":"I jest, I jest. What you felt was likely no more than the chill of the water."},{"name":"RUNAR","text":"Perhaps now would be a good time for you to acquaint yourselves with the people of Slitherbough."},{"name":"RUNAR","text":"For that, I must teach you a customary greeting."},{"name":"RUNAR","text":"Allin tuta. In the language of Ronka, it is one of several ways one might say “good evening.”"},{"name":"RUNAR","text":"The world is not as safe as it once was, and this greeting lets us quickly discern friend from foe."},{"name":"RYNE","text":"Is there a handshake or gesture we should know too? I would hate to offend anyone."},{"name":"RUNAR","text":"You need not worry. Merely speak the words “allin tuta,” and they will know you as friends of the Blessed."},{"name":"RUNAR","text":"I will await your return here. Now go. They are like to be heartened by your knowledge of our ways."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, enter “allin tuta” to greet the villagers of Slitherbough."},{"name":"RUNAR","text":"No need to be shy, my friend. The Blessed are a warm and welcoming people. "},{"name":"SYSTEM","text":"allin tuta"},{"name":"OLDWOMAN03325","text":"..."},{"name":"OLDWOMAN03325","text":"..."},{"name":"SYSTEM","text":"The elderly woman smiles warmly."},{"name":"OLDWOMAN03325","text":"..."},{"name":"VONDIA","text":"I've no business with strangers."},{"name":"VONDIA","text":"Ah, a newly come traveler. Allin chi'si, and welcome to Slitherbough."},{"name":"VONDIA","text":"You must forgive us if we seem strangely reserved. We are a quiet and taciturn people."},{"name":"VONDIA","text":"Silent and serene as the sunless sea. The quiet makes it easy to discern the presence of eaters and other dangers here in the woods."},{"name":"VONDIA","text":"Tread lightly friend, and may the shadows keep you."},{"name":"ASGEIR","text":"Away with you."},{"name":"ASGEIR","text":"Allin chi'si. Welcome, friend. I take it you will remain in these woods for some time, yes?"},{"name":"ASGEIR","text":"Be wary of these woods, you will find poison in near everything you see. But fear not─our medicinal tea will keep you healthy. Ask and it is yours."},{"name":"ASGEIR","text":"You are more than welcome to our medicines, friend. You need only ask."},{"name":"RUNAR","text":"I hope your stroll about Slitherbough proved enlightening."},{"name":"RYNE","text":"Everyone was so kind and gracious..."},{"name":"RYNE","text":"I was nervous at first, but already I'm starting to feel at home."},{"name":"RYNE","text":"There is still much I have to learn about the Night's Blessed, but their faith and strength of will is nothing short of inspiring."},{"name":"RYNE","text":"I can see now how they've built such a thriving community..."}],"reward":{"gil":931},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68860]},"next":[68862,68976,68977,68978,68979,68980]},"partials":[{"type":"npc","id":"1029194","obj":{"i":1029194,"n":"Y'shtola","l":2957,"q":3}},{"type":"npc","id":"1029199","obj":{"i":1029199,"n":"Minfilia","l":2957,"q":1}},{"type":"quest","id":"68860","obj":{"i":68860,"n":"Into the Dark","g":8,"l":"Lakeland","s":460}},{"type":"quest","id":"68862","obj":{"i":68862,"n":"A Helping Hand","g":8,"l":"The Rak'tika Greatwood","s":480}},{"type":"quest","id":"68976","obj":{"i":68976,"n":"Barking Up the Right Tree","g":117,"l":"The Rak'tika Greatwood","s":4070}},{"type":"quest","id":"68977","obj":{"i":68977,"n":"Plans Gone Awry","g":117,"l":"The Rak'tika Greatwood","s":4080}},{"type":"quest","id":"68978","obj":{"i":68978,"n":"Like Pulling Teeth","g":117,"l":"The Rak'tika Greatwood","s":4090}},{"type":"quest","id":"68979","obj":{"i":68979,"n":"Tea Time","g":117,"l":"The Rak'tika Greatwood","s":4101}},{"type":"quest","id":"68980","obj":{"i":68980,"n":"What We Do for Family","g":117,"l":"The Rak'tika Greatwood","s":4110,"f":1}}]}