{"quest":{"name":"Lost but Not Forgotten","location":"The Rak'tika Greatwood","id":68863,"patch":5.0,"sort":490,"eventIcon":71201,"issuer":1029197,"target":1029197,"genre":8,"journal":["Runar has more work to be done."],"objectives":["Look around at the destination.","Defeat the sin eater.","Speak with Minfilia.","Search for the jade heartstone.","Show the jade heartstone to Minfilia.","Deliver the jade heartstone to Runar."],"dialogue":[{"name":"RYNE","text":"Hmmm..."},{"name":"RUNAR","text":"Done tending to the crops already?"},{"name":"RUNAR","text":"Very good. It should not be long before your room is ready."},{"name":"MANOFNIGHT03326","text":"Runar!"},{"name":"MANOFNIGHT03326","text":"In the woods... &lt;pant&gt; &lt;pant&gt; Sin eaters. I fear they may have the touch."},{"name":"RUNAR","text":"Where!?"},{"name":"MANOFNIGHT03326","text":"In the grove to the southwest. For a mercy, they've yet to wander any closer to Slitherbough."},{"name":"RUNAR","text":"Then we have no need to engage. Inform the guard that no one is to set foot outside the village until they have moved on."},{"name":"MANOFNIGHT03326","text":"But sir, what of Toddia's heartstone?"},{"name":"MANOFNIGHT03326","text":"It must be retrieved before the service."},{"name":"RUNAR","text":"Of all the times for sin eaters to appear..."},{"name":"RYNE","text":"Are you just going to leave them alone?"},{"name":"RUNAR","text":"Under normal circumstances, we would not hesitate in striking the beasts down. But if they indeed have the touch, I will not risk them corrupting one of our own."},{"name":"RYNE","text":"What was that you said about a stone?"},{"name":"MANOFNIGHT03326","text":"A few days past, Toddia, a child of the Night's Blessed, was slain by the sin eaters."},{"name":"MANOFNIGHT03326","text":"We succeeded in retrieving her body, but in our haste, we failed to notice her necklace was gone."},{"name":"MANOFNIGHT03326","text":"Strung to it was a pendant of jade─her heartstone. All of the Night's Blessed are given such a stone at birth. It is the most valuable possession one can own."},{"name":"MANOFNIGHT03326","text":"It is custom to present the heartstone of the deceased at their funeral, as an offering to the heavens. But now..."},{"name":"RYNE","text":"What if... What if I could find it for you?"},{"name":"RYNE","text":"I have experience fighting sin eaters. And the Light's...corruption does not touch me like it does others."},{"name":"RUNAR","text":"Master Matoya called you Minfilia, did she not? Are you truly <span class=\"emphasis\">the</span> Minfilia? Descended from the Oracle?"},{"name":"RUNAR","text":"Even so, I dare not ask you to risk your life for the Blessed."},{"name":"RYNE","text":"I understand how you feel, but I can't stand by knowing that your people are in need and I can help. Please, let me do this."},{"name":"RUNAR","text":"Very well. But if the danger proves too great, you must retreat. I could never forgive myself if we were forced to hold a second service."},{"name":"RYNE","text":"&lt;gasp&gt; I nearly forgot about Thancred. What if he returns before I do?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Don't worry. I'll come with you."},{"name":"A1","text":"Thancred doesn't need to know."},{"name":"RYNE","text":"Thank you. With you at my side, I'm certain we can deal with them in no time at all."},{"name":"RYNE","text":"Wh-What!? Do you mean to say...you'll come with me?"},{"name":"RYNE","text":"Thank you. Let's hurry then, before he returns."},{"name":"RUNAR","text":"Go swiftly, and may the shadows keep you both."},{"name":"RUNAR","text":"Do not be reckless. We would be glad to have her heartstone returned to us, but it is not worth both of your lives."},{"name":"MANOFNIGHT03326","text":"Please, I beg of you. We must have that gem."},{"name":"RYNE","text":"It should be around here somewhere, I think."},{"name":"RYNE","text":"There! The sin eaters!"},{"name":"RYNE","text":"I was hoping there would only be one..."},{"name":"RYNE","text":"There's no way we can search for the stone without dealing with them first."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Let's get to it, then!"},{"name":"A2","text":"Perhaps we should split them up."},{"name":"A2","text":"What do you propose we do?"},{"name":"RYNE","text":"What? Shouldn't we make a plan first?"},{"name":"RYNE","text":"Though...there are only two."},{"name":"RYNE","text":"I'll draw one of them away. You can deal with the other."},{"name":"RYNE","text":"Good idea. I'll draw one away while you handle the other."},{"name":"RYNE","text":"Fighting them together here would make a lot of noise, which might attract beasts or other eaters..."},{"name":"RYNE","text":"But if we fought them separately and quietly, we might not have to worry about that."},{"name":"RYNE","text":"All right, then. I'll draw one away while you handle the other."},{"name":"RYNE","text":"<span class=\"highlight\">Forename</span>. &lt;pant&gt; &lt;pant&gt; There you are."},{"name":"RYNE","text":"It's done. Though, I fear I was a bit careless. I'll do better next time, I promise."},{"name":"RYNE","text":"I... I'm fine. You needn't worry about me. More importantly, we have to find that heartstone."},{"name":"RYNE","text":"They said it was made of jade, right? I'll search over there in the brush."},{"name":"RYNE","text":"It must be here somewhere."},{"name":"SYSTEM","text":"There seems to be no trace of the heartstone here."},{"name":"SYSTEM","text":"You brush away the leaves and uncover a brilliant green gem."},{"name":"RYNE","text":"Did you have any luck?"},{"name":"RYNE","text":"It's beautiful! This has to be it."},{"name":"RYNE","text":"...You know, Thancred always said you were a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of many talents, and I think I'm beginning to understand what he meant."},{"name":"RYNE","text":"I have much to learn if I'm to be even half the hero you are."},{"name":"RYNE","text":"The hero she was..."},{"name":"RYNE","text":"Ah, I'm sorry. Forget I said anything."},{"name":"RYNE","text":"We should hurry back to Slitherbough. Runar and the others are probably worried."},{"name":"RYNE","text":"Thancred, I can explain."},{"name":"THANCRED","text":"Well? Out with it, then."},{"name":"RUNAR","text":"Thank goodness you are safe. I had begun to fear the worst."},{"name":"RUNAR","text":"By all that is dark, you found it!"},{"name":"RUNAR","text":"We can proceed with her service as planned."},{"name":"RUNAR","text":"These blessed gems serve not only to protect us in life, but to guide our spirits unto the sunless sea in the hereafter."},{"name":"RUNAR","text":"Even should we be felled by the sin eaters, so long as these gems are recovered, our souls are ensured peace in the dark. "}],"reward":{"gil":1106},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68862]},"next":[68864]},"partials":[{"type":"npc","id":"1029197","obj":{"i":1029197,"n":"Runar","l":2957,"q":3}},{"type":"quest","id":"68862","obj":{"i":68862,"n":"A Helping Hand","g":8,"l":"The Rak'tika Greatwood","s":480}},{"type":"quest","id":"68864","obj":{"i":68864,"n":"Saying Good-bye","g":8,"l":"The Rak'tika Greatwood","s":500}}]}