{"quest":{"name":"Put to the Proof","location":"The Rak'tika Greatwood","id":68868,"patch":5.0,"sort":540,"eventIcon":71201,"issuer":1029195,"target":1029223,"genre":8,"journal":["Urianger wears a somber expression."],"objectives":["Speak with Y'shtola.","Find the first statue in the ruins of Ronka.","Find the second statue in the ruins of Ronka.","Find the third statue in the ruins of Ronka.","Find the seal.","Deliver the seal to Y'shtola."],"dialogue":[{"name":"THANCRED","text":"That Eulmore has gained a foothold here does not bode well for the Night's Blessed."},{"name":"RYNE","text":"There must be <span class=\"emphasis\">something</span> we can do to help the Night's Blessed... Mustn't there?"},{"name":"URIANGER","text":"How fareth the young guard?"},{"name":"YSHTOLA","text":"The poison spread throughout his system long before he was brought here. At present, there is naught we can do but try to ease his pain."},{"name":"RUNAR","text":"Do not blame yourselves, my friends. All that can be done has been done."},{"name":"RUNAR","text":"Even had we reached him sooner, it would have made little difference. The Children employ countless poisons. Finding a suitable antidote is a nigh impossible task."},{"name":"THANCRED","text":"...What of the rest of the Blessed? How have they taken the news of Eulmore's generous proposition?"},{"name":"RUNAR","text":"With anger and dismay. We cannot hope to oppose both them and the Children."},{"name":"RUNAR","text":"I considered a convocation of all the Night's Blessed that we might consider their ultimatum, but I know how they will answer."},{"name":"RUNAR","text":"Master Matoya...I am truly sorry."},{"name":"RUNAR","text":"We will not─cannot─abandon our faith."},{"name":"RUNAR","text":"But there is no reason for you to suffer for our decision. Your work is not yet done, and you still have time to flee."},{"name":"YSHTOLA","text":"...Flee?"},{"name":"YSHTOLA","text":"I am not wont to run from my troubles. In fact, with <span class=\"highlight\">Forename</span>'s arrival, I am minded to take the offensive."},{"name":"YSHTOLA","text":"The Eulmorans' presence here plainly stems from a desire to protect the Lightwarden. I say we seek it out and slay the creature before they return."},{"name":"YSHTOLA","text":"Were darkness to fall over Rak'tika, they would have no cause to remain."},{"name":"THANCRED","text":"...All of which is rather easier said than done. Unless, of course, you've finally deciphered that tablet?"},{"name":"YSHTOLA","text":"I have, as a matter of fact. And with it we can prepare everything we need to enter Yx'Maja."},{"name":"YSHTOLA","text":"What say you all? We will need to act quickly, but I believe it can be done."},{"name":"URIANGER","text":"We cannot deny our fate. But one course lieth before us."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We slay the Lightwarden."},{"name":"A1","text":"For the Night's Blessed!"},{"name":"A1","text":"Well, we <span class=\"emphasis\">are</span> villains, are we not?"},{"name":"YSHTOLA","text":"Good. I leave the Blessed in your capable hands, Runar."},{"name":"RUNAR","text":"Very well..."},{"name":"RUNAR","text":"I see there is no changing your mind. By all that is dark, I swear to keep the Blessed safe."},{"name":"YSHTOLA","text":"According to the tablet, we will first need to obtain a seal used to identify the allies of Ronka in times past."},{"name":"YSHTOLA","text":"One such seal should be waiting for us in a complex of underwater ruins not far from here. You have some experience with subaquatic excursions, do you not?"},{"name":"YSHTOLA","text":"Then this should prove a simple task for you. The ruins we seek are at the bottom of Lake Tusi Mek'ta."},{"name":"THANCRED","text":"While you see to that, Minfilia and I will remain here to help shore up Slitherbough's defenses."},{"name":"RUNAR","text":"Your aid would be greatly appreciated."},{"name":"YSHTOLA","text":"There you are. Ready for a swim?"},{"name":"YSHTOLA","text":"The seal we seek should be stored in a chamber somewhere inside the ruins beneath the lake."},{"name":"YSHTOLA","text":"However, the entrance is seemingly protected by a subtle locking mechanism rooted in the symbolism of Ronkan culture."},{"name":"YSHTOLA","text":"The Ronkans sought to live in harmony with nature, and considered certain animals to be sacred. Foremost in their pantheon was the snake, portrayed as the protector of the wood, and arbiter of life and death. Below it were four others, each equal in rank: the coeurl, the colibri, the opo-opo, and the wolf, characterized as the bringers of liberty, words, enlightenment, and harmony, respectively."},{"name":"YSHTOLA","text":"To open the chamber containing the seal, the tablet states that one must pay due deference to three of these beasts by placing one's palm on monuments wrought in their image, and that this must be done in a specific sequence."},{"name":"YSHTOLA","text":"If my interpretation is correct, the order can be discerned from the three commandments which follow."},{"name":"YSHTOLA","text":"“Give praise unto the snake. By its strength do our lands prosper.”"},{"name":"YSHTOLA","text":"“Be as the opo-opo, rival thy kin. As all parts seek betterment, so too does the whole.”"},{"name":"YSHTOLA","text":"“Be as the wolf, move as one. Peace comes to all who seek harmony with their kin.”"},{"name":"YSHTOLA","text":"The tablet says naught of the placement, size, or appearance of the monuments, alas. Hopefully all will become clear when you reach the bottom of the lake. Go safely."},{"name":"YSHTOLA","text":"You have forgotten the sequence? &lt;sigh&gt; Mind that you listen this time, yes? The commandments were as follows..."},{"name":"YSHTOLA","text":"“Give praise unto the snake. By its strength do our lands prosper.”"},{"name":"YSHTOLA","text":"“Be as the opo-opo, rival thy kin. As all parts seek enlightenment, so too does the whole.”"},{"name":"YSHTOLA","text":"“Be as the wolf, move as one. Peace comes to all who seek harmony with their kin.”"},{"name":"YSHTOLA","text":"As I told you before, the tablet says naught of the position, size, or appearance of the monuments in question, so you will just have to use your eyes."},{"name":"SYSTEM","text":"You find a statue of a snake."},{"name":"Q2","text":"Place your palm on the snake statue?"},{"name":"SYSTEM","text":"You sense something stir elsewhere in the lake."},{"name":"SYSTEM","text":"You find a statue of an opo-opo."},{"name":"Q3","text":"Place your palm on the opo-opo statue?"},{"name":"SYSTEM","text":"You sense something stir elsewhere in the lake."},{"name":"SYSTEM","text":"You find a statue of a coeurl."},{"name":"Q4","text":"Place your palm on the coeurl statue?"},{"name":"SYSTEM","text":"You sense a malign magick emanating from the monument."},{"name":"SYSTEM","text":"You find a statue of a wolf."},{"name":"Q5","text":"Place your palm on the wolf statue?"},{"name":"SYSTEM","text":"Once more, you sense something stir elsewhere in the lake. Perhaps the chamber containing the seal is open."},{"name":"SYSTEM","text":"You find a statue of a colibri."},{"name":"Q6","text":"Place your palm on the colibri statue?"},{"name":"SYSTEM","text":"You sense a malign magick emanating from the monument."},{"name":"YSHTOLA","text":"I sensed a stirring in the water. Assuming you've found the chamber, it may be wise to check the entrance."},{"name":"SYSTEM","text":"A door opens to reveal a pedestal upon which rests a medallion. You take it and secure it inside your clothing."},{"name":"YSHTOLA","text":"Did you find it?"},{"name":"YSHTOLA","text":"This medallion... It bears the owl insignia of the empire. There can be no doubt─this is the seal of Ronka."},{"name":"YSHTOLA","text":"Well done, <span class=\"highlight\">Forename</span>. We can begin our preparations to enter Yx'Maja in earnest."}],"reward":{"gil":1044,"items":[{"id":26846}]},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68867]},"next":[68869]},"partials":[{"type":"npc","id":"1029195","obj":{"i":1029195,"n":"Urianger","l":2957,"q":2}},{"type":"npc","id":"1029223","obj":{"i":1029223,"n":"Y'shtola","l":2957,"q":2}},{"type":"item","id":"26846","obj":{"i":26846,"n":"Bluespirit Weapon Coffer (IL 403)","l":1,"c":26557,"t":61}},{"type":"quest","id":"68867","obj":{"i":68867,"n":"An Unwanted Proposal","g":8,"l":"The Rak'tika Greatwood","s":530}},{"type":"quest","id":"68869","obj":{"i":68869,"n":"Into the Wood","g":8,"l":"The Rak'tika Greatwood","s":550}}]}