{"quest":{"name":"A Helping Hand","location":"The Rak'tika Greatwood","id":68862,"patch":5.0,"sort":480,"eventIcon":71201,"issuer":1029198,"target":1027741,"genre":8,"journal":["Judging by the glint in Runar's eye, there is more for you to learn about Slitherbough."],"objectives":["Speak with Minfilia.","Take the water jug to the garden.","Speak with Minfilia.","Take the water to the garden.","Report to Ersabel."],"dialogue":[{"name":"RYNE","text":"I can see now how they've come to thrive in these woods, even with all the sin eaters."},{"name":"RUNAR","text":"Ah, you are returned. Very good."},{"name":"RUNAR","text":"No doubt they were glad of your company. It has been too long since we have had visitors."},{"name":"RUNAR","text":"Remember: if you have any questions, or there is anything you need, do not hesitate to ask."},{"name":"RUNAR","text":"Speaking of which, we must arrange food and lodgings for your stay."},{"name":"RUNAR","text":"As friends of Master Matoya, we cannot ask for payment, but if you would be willing to lend a hand...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It would be my pleasure."},{"name":"A1","text":"I'd rather not..."},{"name":"RUNAR","text":"We are fortunate indeed to play host to such generous souls. The task I have in mind is simple enough."},{"name":"RUNAR","text":"Come now, it is but a single task. As reward, I will give you an extra helping of my famous stew at dinner!"},{"name":"RUNAR","text":"All I ask is that you take a jug and water the crops in the square."},{"name":"RYNE","text":"May I help too?"},{"name":"RUNAR","text":"Of course! One of you can do the filling, and the other the watering."},{"name":"RUNAR","text":"Speak with Ersabel when you have finished. She will be relieved to hear the crops have been tended to."},{"name":"RUNAR","text":"While you take care of that, I will see to your room and a warm meal."},{"name":"RYNE","text":"Right, then. I'll fill, you water!"},{"name":"RYNE","text":"This was the only jug I could find which was small enough to lift, but I'm afraid there's a crack in the bottom."},{"name":"RYNE","text":"You'll need to hurry to the garden before all the water leaks out."},{"name":"SYSTEM","text":"Take the jug of water to the square before the contents leak out."},{"name":"SYSTEM","text":"You will have forty-five seconds to complete the task. Should you fail, return to Minfilia and try again."},{"name":"RYNE","text":"Oh no, did all the water leak out? Here, let me refill it for you."},{"name":"SYSTEM","text":"You have watered half of the plot. Fetch another jug of water to take care of the rest."},{"name":"SYSTEM","text":"You have no water for the crops. Speak with Minfilia to receive a fresh jug."},{"name":"RYNE","text":"Was there enough water for the plot?"},{"name":"RYNE","text":"Only half? I see. Well, let me refill the jug for you."},{"name":"SYSTEM","text":"Take another jug of water to the square before the contents leak out."},{"name":"SYSTEM","text":"You will have thirty seconds to complete the task. Should you fail, return to Minfilia and try again."},{"name":"SYSTEM","text":"The whole plot has now been thoroughly watered."},{"name":"RYNE","text":"All done? Then we just need to speak to...Ersabel, was it?"},{"name":"ERSABEL","text":"Well met, travelers. I observed you earlier speaking with the others. Have you need of something?"},{"name":"ERSABEL","text":"You watered the crops? Ah, my apologies for not noticing sooner. I have been...rather distracted of late."},{"name":"ERSABEL","text":"Watering the crops was always Toddia's duty, but she...she is no longer with us."},{"name":"ERSABEL","text":"We have since taken to sharing the duty─though never with guests... You are most kind."},{"name":"RYNE","text":"Is there anything else we can do to help? We could plant something if you like."},{"name":"ERSABEL","text":"There is no need. The plot is small, it is true, but it provides us with enough to survive. We ask for no more."},{"name":"RYNE","text":"I don't know how you manage..."},{"name":"RYNE","text":"Have the Blessed not considered leaving? Life would surely be easier almost anywhere else."},{"name":"ERSABEL","text":"I can understand why you might say that, but the easiest path is not always the right one."},{"name":"ERSABEL","text":"Tell me, do you know our history? How our faith came to be?"},{"name":"RYNE","text":"Ah, er...yes, I believe so. The Night's Blessed was initially formed by those who lost their homes in the wake of the Flood."},{"name":"RYNE","text":"What began as an occasional gathering of survivors eventually grew into a community, which ultimately decided to strike out on its own in the Rak'tika Greatwood."},{"name":"ERSABEL","text":"I see you have read your history."},{"name":"ERSABEL","text":"But there is a history that is told, and one that is lived."},{"name":"ERSABEL","text":"Like so many in those times, the first of the Night's Blessed lost everything. Their homes, their loved ones─all they held dear."},{"name":"ERSABEL","text":"To make matters worse, none could say what became of the souls of those lost to the Flood when their bodies were reborn as sin eaters."},{"name":"ERSABEL","text":"The people were without answers, without hope, their gods having drowned along with everything else. It seemed that nothing was beyond the reach of the Light."},{"name":"ERSABEL","text":"But soon they realized that where there is Light, there must be Darkness."},{"name":"ERSABEL","text":"And in that truth, they found new faith─a belief that the souls of the departed could yet find peace beyond these burning skies, in the sunless sea above."},{"name":"ERSABEL","text":"That is why we pray. For the safe passage of wayward souls unto that blessed black abyss. For the return of the night, that we might someday look upon the kingdom of heaven with our own eyes."},{"name":"ERSABEL","text":"We remain in these woods for the selfsame reason our founders first chose them─that we may lead lives of simplicity, with the shade of these trees as a constant reminder of our faith."},{"name":"RYNE","text":"With so many seeking paradise in Eulmore, it's refreshing to find people who value a humbler existence."},{"name":"ERSABEL","text":"You are kind to say so. Many consider our way of life foolish─and so it must seem to those who yet cling to their worldly possessions."},{"name":"ERSABEL","text":"In times such as these, when everything can be taken away in an instant, it is all too easy to lose sight of why we fight to go on living."},{"name":"ERSABEL","text":"...It is not to hold fast to material things, but to hold those who went before us in our hearts─to keep alive the legacy they have left us."},{"name":"ERSABEL","text":"This we must do for them, our children, and generations yet unborn."},{"name":"RYNE","text":"...To keep their legacy alive."}],"reward":{"gil":931},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68861]},"next":[68863]},"partials":[{"type":"npc","id":"1029198","obj":{"i":1029198,"n":"Runar","l":2957,"q":1}},{"type":"npc","id":"1027741","obj":{"i":1027741,"n":"Ersabel","l":2957,"q":2}},{"type":"quest","id":"68861","obj":{"i":68861,"n":"A Day in the Neighborhood","g":8,"l":"The Rak'tika Greatwood","s":470}},{"type":"quest","id":"68863","obj":{"i":68863,"n":"Lost but Not Forgotten","g":8,"l":"The Rak'tika Greatwood","s":490}}]}