{"quest":{"name":"Saying Good-bye","location":"The Rak'tika Greatwood","id":68864,"patch":5.0,"sort":500,"icon":100908,"eventIcon":71201,"issuer":1029197,"target":1029194,"genre":8,"journal":["Runar lets out a sigh of relief.","With Toddia's heartstone safely returned to Runar, the Night's Blessed are able to proceed with her funeral service. To show his appreciation for your efforts, he insists that you and your comrades attend the service as honored guests. He then asks you to inform the others while he sees to preparations.","You find Minfilia telling Thancred of your recent undertaking in the woods. She is delighted by their invitation, and promises not to be late. With Y'shtola and Urianger toiling away to decipher the tablet, you decide not to disturb them and make for the Darker.","In the dimly lit cave you find an elderly woman you believe to be the attendant Runar spoke of. Without saying a word she hands you a candle, and points to a spot on the floor close by.","Seeing the cluster of candles there on the floor, you place yours among them, and the attendant nods and smiles in answer. It would appear you have done your part in preparing for the service. All you can do now is wait for it to begin.","Before long, a procession of mourners enter the Darker. Among them you find Y'shtola and Urianger, who have taken a reprieve from working to pay their respects. They join you in the rear of the chamber, and a hush soon falls over the room. Runar then enters taking his place at the Font of Seeing, and delivers a moving service in memory of Toddia. As the room clears, Y'shtola invites you to her chambers to discuss the tablet.","Y'shtola has finished deciphering the tablet and is prepared to reveal her findings. It will not be long before you track down the Lightwarden."],"objectives":["Speak with Minfilia.","Speak with the placid elder.","Place the candle at the destination.","Wait at the destination.","Speak with Y'shtola."],"dialogue":[{"name":"RYNE","text":"Thancred, I can explain."},{"name":"THANCRED","text":"Well? Out with it, then."},{"name":"RUNAR","text":"Words fail to express my gratitude for this kindness you have done for the Blessed."},{"name":"RUNAR","text":"I must insist you and your friends attend Toddia's service as honored guests."},{"name":"RUNAR","text":"There is still much we must do to prepare, but please go and inform the others it will be held in the Darker."},{"name":"RUNAR","text":"When you arrive, there should be an attendant present to explain the proceedings."},{"name":"RYNE","text":"<span class=\"highlight\">Forename</span> and I learned so much about the Night's Blessed while you were away."},{"name":"RYNE","text":"And we helped them recover a lost heirloom out in the woods. I know I wasn't supposed to leave, but they really needed our help! There were sin eaters, and─"},{"name":"THANCRED","text":"As long as <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> accompanied you. But do try to be more careful. Your injuries could have been a lot worse."},{"name":"RYNE","text":"H-How did you...?"},{"name":"THANCRED","text":"Let's just say a little bird told me. And it's telling me now that <span class=\"highlight\">Forename</span> has business with us."},{"name":"RYNE","text":"Is something the matter?"},{"name":"RYNE","text":"They've asked us to attend the service?"},{"name":"RYNE","text":"Of course we'll go. It's being held in the Darker, is it? We'll take care not to be late, I promise."},{"name":"RYNE","text":"It's such a relief to know everything is going as planned. I'll join you in the Darker shortly."},{"name":"THANCRED","text":"Between your earlier excursion and my patrol of the area for sin eaters, hopefully Y'shtola and Urianger will be able to finish their work in peace."},{"name":"OLDWOMAN03325","text":"..."},{"name":"SYSTEM","text":"The elderly woman hands you a candle. She then points over at a nearby corner where you might place it."},{"name":"OLDWOMAN03325","text":"..."},{"name":"THANCRED","text":"Hopefully Y'shtola has good news to share."},{"name":"THANCRED","text":"A chance to reclaim the night has lit a fire in Minfilia that I would see kindled."},{"name":"RYNE","text":"What do you suppose she's gleaned from the tablet?"},{"name":"URIANGER","text":"I have no doubt thou wilt find the contents of the tablet most informative."},{"name":"RUNAR","text":"I had no right to involve you in our troubles. Still, without your help, today's service would not have been possible. The Night's Blessed are in your debt."},{"name":"YSHTOLA","text":"Good, you're here. Thanks to the Exarch's <span class=\"emphasis\">gift</span>, our next course of action is now clear."}],"reward":{"gil":969,"items":[{"id":26849}]},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68863]},"next":[68865,68983,68984,68985,68986,68987,68989,68990,68991]},"partials":[{"type":"npc","id":"1029197","obj":{"i":1029197,"n":"Runar","l":2957,"q":3}},{"type":"npc","id":"1029194","obj":{"i":1029194,"n":"Y'shtola","l":2957,"q":3}},{"type":"item","id":"26849","obj":{"i":26849,"n":"Bluespirit Hand Gear Coffer (IL 403)","l":1,"c":26560,"t":61}},{"type":"quest","id":"68863","obj":{"i":68863,"n":"Lost but Not Forgotten","g":8,"l":"The Rak'tika Greatwood","s":490}},{"type":"quest","id":"68865","obj":{"i":68865,"n":"Stirring Up Trouble","g":8,"l":"The Rak'tika Greatwood","s":510}},{"type":"quest","id":"68983","obj":{"i":68983,"n":"Worth a Candle","g":117,"l":"The Rak'tika Greatwood","s":4140}},{"type":"quest","id":"68984","obj":{"i":68984,"n":"Paved with Good Intentions","g":117,"l":"The Rak'tika Greatwood","s":4180}},{"type":"quest","id":"68985","obj":{"i":68985,"n":"You're a Gem","g":117,"l":"The Rak'tika Greatwood","s":4150}},{"type":"quest","id":"68986","obj":{"i":68986,"n":"Oh, Snap","g":117,"l":"The Rak'tika Greatwood","s":4160}},{"type":"quest","id":"68987","obj":{"i":68987,"n":"Disturbing the Peace","g":117,"l":"The Rak'tika Greatwood","s":4170}},{"type":"quest","id":"68989","obj":{"i":68989,"n":"From the Heart","g":117,"l":"The Rak'tika Greatwood","s":4201}},{"type":"quest","id":"68990","obj":{"i":68990,"n":"Special Delivery","g":117,"l":"The Rak'tika Greatwood","s":4210}},{"type":"quest","id":"68991","obj":{"i":68991,"n":"An Express Delivery","g":117,"l":"The Rak'tika Greatwood","s":4220}}]}