{"quest":{"name":"Into the Dark","location":"Lakeland","id":68860,"patch":5.0,"sort":460,"icon":100907,"eventIcon":71201,"issuer":1030889,"target":1029190,"genre":8,"journal":["Urianger is ready to leave, but not before first offering a piece of advice.","Before you set forth to meet with Y'shtola, Urianger treats you to a brief lesson on the Night's Blessed in which he reveals that it is their custom to adopt the names of their forebears. They do this, he explains, in the belief that it will protect their true selves from the blighted touch of the Light. In accordance with this practice, Y'shtola has adopted the name of her mentor, Master Matoya─a fact which you must keep in mind if you are to avoid causing offense. Thus forewarned, you make at last for the border of the Rak'tika Greatwood.","You but mention the Crystal Exarch and the guard standing watch at the gate readily grants you passage into the forest.","As Urianger guides you through the woods, Emet-Selch makes yet another unsolicited appearance, this time waxing lyrical about days long past. As Thancred fumes at the intrusion, Minfilia challenges the Ascian to make himself useful, only for him to flatly refuse, resolved to remain a mere observer.","With Emet-Selch's stroll down memory lane ended, Urianger apprises you of the struggles of the Night's Blessed to survive in Rak'tika, citing a deadly assault on their home─Fort Gohn─two years past. Since Y'shtola's arrival, she has assumed a commanding role among their people, and has helped them begin to rebuild. Assuming the restoration work is ongoing, he believes that is where you are most likely to find her.","Urianger is surprised to see the fort deserted, with little progress having been made in the rebuilding effort. He is in the process of suggesting that you look elsewhere when you are suddenly surrounded by what you can only assume to be the Night's Blessed. Inexplicably, they accuse you of being sin eaters, and prepare to attack. It is not until Y'shtola arrives that you discern the source of the misunderstanding. The abundance of Light that suffuses your being has made you a stranger to her. Undaunted, Urianger steps in to vouch for your identity, and she immediately commands the Night's Blessed to lower their arms. Acknowledging you at last, she apologizes for the hostile reception, promising to give you a proper introduction to the people of Rak'tika.","Y'shtola bids you travel northeast, through what remains of the gate to Fort Gohn, and follow the path to the settlement of the Night's Blessed.","At your approach, you see Y'shtola's expression soften, and she invites you into what at first glance appears to be a cave, but is, in actuality, the entrance to Slitherbough, home of the Night's Blessed. ","After a cursory examination of the stone tablet you recovered from the church, Y'shtola admits that the relic may prove useful. It will, however, take time to decipher. While she and Urianger attend to the task, she bids you explore Slitherbough, that you may become acquainted with your hosts, and perhaps learn something of the Warrior of Darkness."],"objectives":["Speak with Myrcant.","Speak with Urianger.","Search for Y'shtola.","Speak with Y'shtola."],"dialogue":[{"name":"THANCRED","text":"Should we not be going? We have a gift to deliver."},{"name":"RYNE","text":"Thancred mentioned Y'shtola's passion for learning. I expect the tablet is...just the sort of thing she'd like?"},{"name":"URIANGER","text":"Ere we depart, there is a custom of the Night's Blessed which I feel compelled to elucidate."},{"name":"URIANGER","text":"As one might expect, they deem Light to be abhorrent, and everything it touches befouled. Thus do they take the utmost pains to protect all they can from its taint─including their very names."},{"name":"URIANGER","text":"To speak plain, it is the belief of the Blessed that one's own name must ne'er be uttered in the light of the everlasting day. Yet this commandment precludeth not the use of another's. Thus do parents protect their children, and, in rare cases, masters their disciples."},{"name":"URIANGER","text":"So it is that Y'shtola hath taken the name of Master Matoya. Lest we offend them, I bid you speak not her true name in the Blessed's presence."},{"name":"URIANGER","text":"With that in mind, let us speak with the guard who keepeth vigil at the Greatwood's border."},{"name":"THANCRED","text":"It will be good to see Y'shtola again."},{"name":"RYNE","text":"I know I have no reason to, but I can't help feeling nervous about meeting Y'shtola."},{"name":"URIANGER","text":"I pray thee heed mine explanation of the Blessed's customs. 'Twould be ill-advised to provoke their ire."},{"name":"MYRCANT","text":"Well met, traveler. What business brings you here?"},{"name":"MYRCANT","text":"Yes, of course! Right this way."},{"name":"MYRCANT","text":"You need but say the word and I will open the gate."},{"name":"Q1","text":"Proceed to the Rak'tika Greatwood?"},{"name":"MYRCANT","text":"Safe travels, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"THANCRED","text":"&lt;sigh&gt; If he never opened his mouth again, it would be too soon."},{"name":"RYNE","text":"Thancred has told me of the Ascians and what they have done. If he isn't willing to help, is it wise to let him stay with us?"},{"name":"EMETSELCH","text":"What is it now? Do you expect me to regale you with <span class=\"emphasis\">friendly banter</span>?"},{"name":"EMETSELCH","text":"...Oh, very well. I will humor you this once. You may consider it my latest act of good faith. Come on, then. What do you wish to know?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Why choose this form here in the First?"},{"name":"A2","text":"Actually...never mind."},{"name":"EMETSELCH","text":"Well, well, what a curious question."},{"name":"EMETSELCH","text":"Mortal flesh is but the vessel into which we Ascians pour the elixir of our souls, molding it as fits the occasion. Or not, if we so choose."},{"name":"EMETSELCH","text":"Be it for a year or a millennium, I prefer to retain the same form until my duty is done. So, after arriving here in the First, I fashioned some hapless body into the man you see before you."},{"name":"EMETSELCH","text":"Though as your friend over there can attest, there are those of us who forgo such alterations."},{"name":"EMETSELCH","text":"He was ever the rash one, Lahabrea. Jumping from vessel to vessel. Never heeding the toll it took on him."},{"name":"EMETSELCH","text":"If you've nothing to ask me, why are you still here? Don't you have Wardens to vanquish? A realm to save?"},{"name":"URIANGER","text":"'Tis plain our Ascian counterpart meaneth to follow wheresoever we lead. Were it otherwise, he would not suffer the overabundance of light in these woods."},{"name":"URIANGER","text":"Verily, it pervadeth every corner... And so long as the Lightwarden remaineth, the sin eaters shall be free to prey upon these lands without surcease. If naught is done, 'tis but a matter of time before the Blessed succumb."},{"name":"URIANGER","text":"Two years past, a swarm of sin eaters did lay waste unto their largest settlement, killing a great many of their priests in so doing."},{"name":"URIANGER","text":"Though some few did survive, they knew not how to go on. Wayward souls in want of a guiding hand. For a mercy, Y'shtola hath provided that which they sorely needed."},{"name":"URIANGER","text":"They have since endeavored to restore their home, and thither shall we bend our steps─to Fort Gohn."},{"name":"THANCRED","text":"We both know how Urianger enjoys painting pictures with his words, but he did not exaggerate about this place."},{"name":"RYNE","text":"Urianger said they were rebuilding, but...there's no one here."},{"name":"URIANGER","text":"Hmmm..."},{"name":"EMETSELCH","text":"Well? Where is this friend of yours we've come to meet?"},{"name":"THANCRED","text":"That ended a lot better than it might have. No thanks to Emet-Selch..."},{"name":"RYNE","text":"I didn't expect her to be so...imposing in person."},{"name":"URIANGER","text":"That she should imagine <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> a stranger..."},{"name":"YSHTOLA","text":"You have been busy since arriving in the First, I gather. But I would hear the tale of your travails in more suitable surroundings."},{"name":"YSHTOLA","text":"With Fort Gohn yet to be rebuilt, the Night's Blessed have made their home in a settlement to the northeast. I will await you at its entrance. Follow the path through yonder gate and you will find me soon enough."},{"name":"YSHTOLA","text":"There you are. I was beginning to worry. Much like the Twelveswood, this forest has a way of dealing with those who stray too far from the beaten path."},{"name":"YSHTOLA","text":"But I digress. Let me show you the home of the Night's Blessed."},{"name":"THANCRED","text":"Finally, a place to rest."},{"name":"RYNE","text":"Have you ever seen such a tree? To think these are only the roots!"},{"name":"URIANGER","text":"To make their home here, and so swiftly, would surely have required no small amount of ingenuity. A most impressive feat, wouldst thou not agree?"}],"reward":{"gil":1348,"items":[{"id":26850}]},"reqs":{"jobs":[{"lvl":74,"id":142}],"quests":[68859]},"next":[68861]},"partials":[{"type":"npc","id":"1030889","obj":{"i":1030889,"n":"Urianger","l":2953,"q":2}},{"type":"npc","id":"1029190","obj":{"i":1029190,"n":"Y'shtola","l":2957,"q":1}},{"type":"item","id":"26850","obj":{"i":26850,"n":"Bluespirit Leg Gear Coffer (IL 403)","l":1,"c":26561,"t":61}},{"type":"quest","id":"68859","obj":{"i":68859,"n":"A Little Faith","g":8,"l":"Lakeland","s":450}},{"type":"quest","id":"68861","obj":{"i":68861,"n":"A Day in the Neighborhood","g":8,"l":"The Rak'tika Greatwood","s":470}}]}