{"quest":{"name":"Legend of the Not-so-hidden Temple","location":"The Rak'tika Greatwood","id":68873,"patch":5.0,"sort":590,"icon":100911,"eventIcon":71201,"issuer":1029242,"target":1029244,"genre":8,"journal":["Almet wishes to offer you words of warning.","Almet explains to you and Y'shtola the possible dangers that await within the final chamber of the pyramid, offering you whisperweed to use in the event you find yourselves separated. With her words in mind, you enter the chamber prepared for the worst.","Once inside, you soon realize the chamber is a labyrinth, filled with magicked sentinels and perilous traps at every turn. The end is nearly in sight when you encounter a most unexpected obstacle─General Ran'jit. Uimet and Cymet follow him into the temple and, together with their sister, hold him off long enough for you to activate the final switch restoring the flow of aether through the whole of the pyramid, thus opening the path through the Qitana Ravel.","Despite your success, Ran'jit has no intention of allowing you to leave. After making quick work of the Viis sisters, he comes barreling down the corridor toward you. His onslaught is cut short, however, when Y'shtola steps in the way to protect you with a barrier. The Eulmoran adjutant, finally taking notice of his general's struggles, rushes to help him when he steps on a curious panel on the floor. The room begins to tremble, and soon they find the floor falling out from under them, forcing them to a corner opposite the exit, a gaping chasm now preventing their escape.<br><br>All present expect a rescue party to arrive, though it remains to be seen if the Scions or Eulmorans will arrive first. Still, not wanting to risk an altercation, the adjutant makes a proposal: a number of the Blessed have been poisoned, and the adjutant is willing to provide you with an antidote, granted he and his commander are allowed safe passage out of the temple. General Ran'jit is disgusted by this proposition, choosing to rid himself of the adjutant and any hope of saving the Blessed by kicking him into the chasm along with the antidote. Without thinking, Y'shtola leaps into the void, grabs hold of the antidote, and tosses it to you before disappearing into the dark.<br><br>Her last words continue to ring in your ears as Minfilia, Thancred, and Urianger arrive. General Ran'jit has no time to react as he is summarily ensnared in an enchantment and sent down into the depths with a swift strike from Thancred's gunblade. A bittersweet victory, but victory nonetheless. With the antidote in hand, you take your leave of the pyramid with the Scions.","The group is still reeling from Y'shtola's sacrifice, yet with the Night's Blessed all but knocking on death's door, you have no choice but to press on. Before rushing headlong into more danger, however, Thancred suggests waiting for news from Uimet of the Eulmoran forces that entered Yx'Maja. "],"objectives":["Speak with Y'shtola.","Speak with Thancred."],"dialogue":[{"name":"YSHTOLA","text":"Let us do what needs be done and quit this place. We've precious little time."},{"name":"ALMET","text":"Before we enter, I would tell you of the trial that awaits you."},{"name":"ALMET","text":"The chamber is said to be filled with all manner of devices to keep trespassers away from the switch."},{"name":"ALMET","text":"The most potent being wards of displacement. They may very well force you into danger."},{"name":"ALMET","text":"Should we become separated, please use these."},{"name":"ALMET","text":"Whisperweeds. They will allow us to communicate no matter where we may find ourselves."},{"name":"YSHTOLA","text":"I think <span class=\"highlight\">Forename</span> and I can work out how to use these well enough. Thank you."},{"name":"YSHTOLA","text":"All right, <span class=\"highlight\">Forename</span>. The sooner we finish here, the sooner we can return to the others."},{"name":"ALMET","text":"I will do all I can to assist you, but I cannot guarantee your safety once we enter."},{"name":"YSHTOLA","text":"Shall we get this over with?"},{"name":"RYNE","text":"Why would she do such a thing?"},{"name":"URIANGER","text":"Oh, Y'shtola... Had we been but a few steps faster."},{"name":"ALMET","text":"I have failed you. Words fail to express my shame..."},{"name":"CYMET","text":"We should have tried harder to repel them."},{"name":"THANCRED","text":"Thankfully Ran'jit's cohorts had the good sense to fall back."},{"name":"THANCRED","text":"Uimet should be here soon with word from Fanow."},{"name":"THANCRED","text":"We should hold our position here until she arrives."}],"reward":{"gil":1972},"reqs":{"jobs":[{"lvl":75,"id":142}],"quests":[68872]},"next":[68874]},"partials":[{"type":"npc","id":"1029242","obj":{"i":1029242,"n":"Almet","l":2957,"q":2}},{"type":"npc","id":"1029244","obj":{"i":1029244,"n":"Thancred","l":2957,"q":1}},{"type":"quest","id":"68872","obj":{"i":68872,"n":"Mi Casa, Toupasa","g":8,"l":"The Rak'tika Greatwood","s":580}},{"type":"quest","id":"68874","obj":{"i":68874,"n":"The Aftermath","g":8,"l":"The Rak'tika Greatwood","s":600}}]}