{"quest":{"name":"Mi Casa, Toupasa","location":"The Rak'tika Greatwood","id":68872,"patch":5.0,"sort":580,"eventIcon":71201,"issuer":1029240,"target":1029242,"genre":8,"journal":["Almet would have you hurry to the pyramid."],"objectives":["Speak with Almet.","Search for the owl statuette.","Carry the owl statuette to its proper altar.","Speak with Almet."],"dialogue":[{"name":"YSHTOLA","text":"I swear, if the Eulmorans harm so much as a hair on the heads of the Blessed... "},{"name":"ALMET","text":"Time is against us, friend."},{"name":"ALMET","text":"Quickly, into the pyramid."},{"name":"YSHTOLA","text":"Our way has been barred...again. I am beginning to lose my patience."},{"name":"ALMET","text":"The switch should be through these doors, in the Confessional of Toupasa the Elder. But why is it not open?"},{"name":"YSHTOLA","text":"Magic appears to be flowing through the walls, but it's being obstructed as it approaches the door."},{"name":"YSHTOLA","text":"...Hmmm. Is it not strange that only one of these pedestals bears an owl statue?"},{"name":"ALMET","text":"Strange indeed. The second statue was likely hidden to keep the door sealed."},{"name":"YSHTOLA","text":"We can cover more ground if we split up. Almet, take the chamber to the south. <span class=\"highlight\">Forename</span>, the one to the east."},{"name":"YSHTOLA","text":"I will search the chamber to the west."},{"name":"YSHTOLA","text":"Still no sign of the statue. It has to be around here somewhere..."},{"name":"ALMET","text":"I can spot trespassers from four hundred yalms away, and yet this simple statue eludes me. How embarrassing..."},{"name":"ALMET","text":"I have looked everywhere, and─ Wait, is that...?"},{"name":"ALMET","text":"The statue! You found it!"},{"name":"ALMET","text":"It looks light enough. We need but return it to the other altar, no?"},{"name":"YSHTOLA","text":"One might assume so, but nothing about these ruins has ever been quite so simple."},{"name":"YSHTOLA","text":"I sensed a strange energy emanating from the eyes of the statues in the corridors of this place. Should this figure be moved, it would not surprise me for them to suddenly stir to life."},{"name":"ALMET","text":"A trap, then. For the unsuspecting as they attempt to return this to its rightful place."},{"name":"YSHTOLA","text":"Precisely. Caution would serve us well here."},{"name":"YSHTOLA","text":"Which is why I would ask you to deliver this statue to the main chamber."},{"name":"YSHTOLA","text":"An abundance of magick yet courses through these walls. For my eyes, distractingly so. I believe yours, on the other hand, would more aptly perceive the traps for what they are."},{"name":"YSHTOLA","text":"All right, then. We will meet you at the door to the Confessional of Toupasa the Elder."},{"name":"SYSTEM","text":"Deliver the owl statuette to the altar at the entrance of the Confessional of Toupasa the Elder."},{"name":"SYSTEM","text":"You will have two minutes to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"YSHTOLA","text":"Beware the stare of those statues, <span class=\"highlight\">Forename</span>. I dare not think what will happen should they catch sight of you."},{"name":"ALMET","text":"Would that I could bear the statuette in your stead, but it is not my place. Take care, and beware the owls."},{"name":"SYSTEM","text":"The owl statue's eyes take on an eerie glow. As the light fades, you realize the statuette has disappeared from your hands."},{"name":"SYSTEM","text":"Deliver the owl statuette to the altar at the entrance of the Confessional of Toupasa the Elder."},{"name":"SYSTEM","text":"You will have two minutes to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"SYSTEM","text":"Though the altar remains vacant, the top appears worn, suggesting something once rested here."},{"name":"SYSTEM","text":"You successfully deliver the statuette to the altar."},{"name":"ALMET","text":"The statue is returned, but was that enough?"},{"name":"YSHTOLA","text":"I believe it was. I can see aether flowing to the door now."},{"name":"YSHTOLA","text":"I pray this means an end to the tricks and traps of these ruins."},{"name":"YSHTOLA","text":"Well done."},{"name":"YSHTOLA","text":"The sooner we can enter the Qitana Ravel, the better."},{"name":"ALMET","text":"You are but one step from entering the Qitana Ravel, but I must warn you: this last step is without question the most perilous."},{"name":"ALMET","text":"Overcome this final trial, and the path forward will open to you."},{"name":"YSHTOLA","text":"A path laden with more puzzles and traps, I'm sure. Did the emperor always take such pleasure in wasting the time of his allies? "},{"name":"YSHTOLA","text":"&lt;sigh&gt; Let us end this, <span class=\"highlight\">Forename</span>. While time is yet on our side."}],"reward":{"gil":861,"items":[{"num":2,"id":27869}]},"reqs":{"jobs":[{"lvl":75,"id":142}],"quests":[68871]},"next":[68873]},"partials":[{"type":"npc","id":"1029240","obj":{"i":1029240,"n":"Almet","l":2957,"q":2}},{"type":"npc","id":"1029242","obj":{"i":1029242,"n":"Almet","l":2957,"q":2}},{"type":"item","id":"27869","obj":{"i":27869,"n":"Baked Megapiranha","l":409,"c":24311,"t":46,"p":3595}},{"type":"quest","id":"68871","obj":{"i":68871,"n":"Look to the Stars","g":8,"l":"The Rak'tika Greatwood","s":570}},{"type":"quest","id":"68873","obj":{"i":68873,"n":"Legend of the Not-so-hidden Temple","g":8,"l":"The Rak'tika Greatwood","s":590}}]}