{"quest":{"name":"Look to the Stars","location":"The Rak'tika Greatwood","id":68871,"patch":5.0,"sort":570,"eventIcon":71201,"issuer":1029231,"target":1029240,"genre":8,"journal":["Almet stands ready to guide you through the ruins."],"objectives":["Speak with Almet.","Speak with Y'shtola.","Use the clay tablets on the inscriptions.","Deliver the clay tablets to Y'shtola.","Speak with Y'shtola.","Speak with Almet."],"dialogue":[{"name":"YSHTOLA","text":"We must make haste and see this done. The Qitana Ravel and the Lightwarden await."},{"name":"ALMET","text":"What you seek lies in the heart of the K'mul Astropolis."},{"name":"ALMET","text":"Unfortunately, it too was sealed shut by order of His Eminence."},{"name":"ALMET","text":"If we are to open it, we must first look to the Morning Stars. Come, I will show you the way."},{"name":"YSHTOLA","text":"Looking upon these structures, I cannot help but be reminded of ruins in Gyr Abania. Yet the manner in which they appear to be suppressing the natural flow of aether is more akin to the Allagan pillars in the House of the Crooked Coin..."},{"name":"ALMET","text":"You were able to keep up, I see. Well done."},{"name":"ALMET","text":"Ahead lie the Morning Stars, four monuments built in tribute to the guardians of Rak'tika."},{"name":"ALMET","text":"Beyond them is the Great Pyramid of Ux'ner, where the flow of magic must be restored."},{"name":"ALMET","text":"It is said that the monuments are themselves the keys to opening the pyramid."},{"name":"ALMET","text":"Though I know not how. That is for you to discover."},{"name":"YSHTOLA","text":"...Another puzzle. Wonderful."},{"name":"YSHTOLA","text":"I would have a closer look."},{"name":"ALMET","text":"I must confess, there are times when I too wonder what lies within these ruins. But I would never defy the will of the emperor."},{"name":"YSHTOLA","text":"It is indeed another puzzle, but for a blessing, it appears to be similar to the one we encountered at the lake."},{"name":"YSHTOLA","text":"These statues are all depictions of the divine beasts mentioned on the tablet."},{"name":"YSHTOLA","text":"No doubt they will open the way into the pyramid in like manner."},{"name":"YSHTOLA","text":"We have but to discern the correct order. Let's split up and search the area for clues."},{"name":"ALMET","text":"These ruins are covered in ancient inscriptions. The answer may well be hiding among them."},{"name":"YSHTOLA","text":"Indeed. It may be best to transcribe them if they are as numerous as you say. Better that than risk overlooking something."},{"name":"YSHTOLA","text":"Though transcription would prove impractical for you, not being versed in Ronkan script... No matter. You will employ a different approach: impressions."},{"name":"YSHTOLA","text":"Here. I had thought to use these clay tablets to record any significant imagery we discovered, but they will serve you just as well. Take impressions of any inscriptions you find."},{"name":"YSHTOLA","text":"We will start at the base of the pyramids. You begin at the top."},{"name":"YSHTOLA","text":"When you have finished, return here and I will translate your findings."},{"name":"YSHTOLA","text":"Did you find anything?"},{"name":"ALMET","text":"There are so many inscriptions... I scarcely know where to start."},{"name":"SYSTEM","text":"You take an impression of the writing inscribed on the monument."},{"name":"ALMET","text":"Finished? Take what you have to Y'shtola. I will join you anon."},{"name":"YSHTOLA","text":"I trust you've made good use of those clay tablets?"},{"name":"YSHTOLA","text":"Well done. A moment while I decipher what you've found."},{"name":"YSHTOLA","text":"Apologies for the delay."},{"name":"YSHTOLA","text":"Nothing we saw at the base of the pyramids gave any hint as to the solution of the puzzle, focusing instead on how to proceed having solved it. Your findings, on the other hand, appear to form a riddle. Once assembled, it reads as follows..."},{"name":"YSHTOLA","text":"“Come together, share despair."},{"name":"YSHTOLA","text":"“Go thy ways, dread burdens bear."},{"name":"YSHTOLA","text":"“Mark the crown, heed its call."},{"name":"YSHTOLA","text":"“Avert thy gaze, forever fall.”"},{"name":"YSHTOLA","text":"I had assumed that the puzzle would involve a sequence, but from what Almet and I were able to gather, it is but a matter of suffusing one of the statues with aether."},{"name":"YSHTOLA","text":"The question being: which one?"},{"name":"YSHTOLA","text":"Have you any thoughts?"},{"name":"ALMET","text":"“Come together, share despair,<br>Go thy ways, dread burdens bear..."},{"name":"ALMET","text":"“Mark the crown, heed its call,<br>Avert thy gaze, forever fall.”<br>Such cryptic writings. How are they related to the divine beasts?"},{"name":"SYSTEM","text":"Examining the serpent statue, you notice it is facing away from the coeurl statue."},{"name":"SYSTEM","text":"Examining the coeurl statue, you notice it is facing away from the serpent statue."},{"name":"SYSTEM","text":"Examining the colibri statue, you notice it is facing south toward the woods."},{"name":"SYSTEM","text":"Examining the owl statue, you notice it is facing north toward the Great Pyramid."},{"name":"SYSTEM","text":"Examining the wolf statue, you notice it is facing towards the opo-opo statue."},{"name":"SYSTEM","text":"Examining the opo-opo statue, you notice it is facing towards the wolf statue."},{"name":"YSHTOLA","text":"Given your talent for finding solutions to vexatious problems, I think it best that you choose the statue. What say you, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"Offer Y'shtola your thoughts?"},{"name":"YSHTOLA","text":"If you need more time to consider, take it─but do make haste. I <span class=\"emphasis\">would</span> suggest seeking Almet's counsel, but she seems rather preoccupied with reciting the riddle."},{"name":"YSHTOLA","text":"At the very least, you should consider having a second look at the statues themselves. Perhaps they offer some clue as to which is the correct choice."},{"name":"YSHTOLA","text":"Right, then. After you have selected a statue, I will imbue it with the required aether."},{"name":"YSHTOLA","text":"Should it prove to be a trap, I am more than capable of warding off any malign magicks it may contain."},{"name":"YSHTOLA","text":"Now, which statue will it be?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"The serpent statue."},{"name":"A2","text":"The coeurl statue."},{"name":"A2","text":"The colibri statue."},{"name":"A2","text":"The owl statue."},{"name":"A2","text":"The wolf statue."},{"name":"A2","text":"The opo-opo statue."},{"name":"A2","text":"Might I hear the riddle one more time?"},{"name":"A2","text":"..."},{"name":"ALMET","text":"Yes, of course. I have it written here."},{"name":"ALMET","text":"“Come together, share despair,<br>Go thy ways, dread burdens bear...<br>"},{"name":"ALMET","text":"“Mark the crown, heed its call,<br>Avert thy gaze, forever fall.”"},{"name":"ALMET","text":"Did that serve to inspire you?"},{"name":"YSHTOLA","text":"All right. I pray this works."},{"name":"YSHTOLA","text":"Gah! ...It seems you were mistaken."},{"name":"YSHTOLA","text":"I am fine. Though I would rather not go through that again."},{"name":"YSHTOLA","text":"Next time, choose more carefully."},{"name":"YSHTOLA","text":"All right. I pray this works."},{"name":"YSHTOLA","text":"The aether has been absorbed..."},{"name":"YSHTOLA","text":"You really do have a talent for these things."},{"name":"YSHTOLA","text":"A moment. Maintaining my wards has proven more taxing than anticipated."},{"name":"ALMET","text":"The way should be clear now. Come, let us─"},{"name":"ALMET","text":"Someone approaches!"},{"name":"CYMET","text":"Sister! &lt;pant&gt; &lt;pant&gt; Sister!"},{"name":"ALMET","text":"Cymet?"},{"name":"ALMET","text":"What are you doing here? What has happened?"},{"name":"CYMET","text":"Eulmoran soldiers. They have entered Yx'Maja!"},{"name":"YSHTOLA","text":"Eulmoran soldiers!? And what of the Blessed?"},{"name":"CYMET","text":"Nothing specific, but it seems the Eulmorans had little interest in Slitherbough or its people."},{"name":"CYMET","text":"According to our scouts, their general and his men made all haste for the gate to Yx'Maja upon finding it."},{"name":"CYMET","text":"Together with Thancred, Uimet and some few others have engaged them at the border."},{"name":"ALMET","text":"You are to return and assist Uimet at once."},{"name":"ALMET","text":"They are not to set foot near the ruins or Fanow."},{"name":"ALMET","text":"We will see to matters here and return as quickly as we can. Understood?"},{"name":"CYMET","text":"Yes, Sister. Be careful."},{"name":"YSHTOLA","text":"Though I knew time was short, I did not expect the Eulmorans to move so swiftly..."},{"name":"YSHTOLA","text":"But we have come too far to turn back now."}],"reward":{"gil":1091},"reqs":{"jobs":[{"lvl":75,"id":142}],"quests":[68870]},"next":[68872]},"partials":[{"type":"npc","id":"1029231","obj":{"i":1029231,"n":"Almet","l":2957,"q":2}},{"type":"npc","id":"1029240","obj":{"i":1029240,"n":"Almet","l":2957,"q":2}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}},{"type":"quest","id":"68872","obj":{"i":68872,"n":"Mi Casa, Toupasa","g":8,"l":"The Rak'tika Greatwood","s":580}}]}