{"quest":{"name":"Bearing with It","location":"The Rak'tika Greatwood","id":68877,"patch":5.0,"sort":630,"eventIcon":71201,"issuer":1029557,"target":1029197,"genre":8,"journal":["Y'shtola wears a haunted expression, Emet-Selch's words having clearly found their mark."],"objectives":["Speak with Almet.","Speak with Runar."],"dialogue":[{"name":"THANCRED","text":"The eldest and most powerful of primals... Gods. If that were Hydaelyn's origin, then what would that make─<br>...No. No, I will not take the words of an Ascian on trust. It has to be a lie."},{"name":"RYNE","text":"Thancred did tell me about primals...but I don't fully understand what all of this means."},{"name":"URIANGER","text":"'Tis oft said truth is a matter of perspective. Yet upon <span class=\"emphasis\">this</span> matter, there can be but one truth. I only pray it is not his."},{"name":"ALMET","text":"<span class=\"highlight\">Forename</span>, you are returned! But...something troubles you. Is aught amiss?"},{"name":"UIMET","text":"What has happened to the sky!? I have never seen anything like it!"},{"name":"CYMET","text":"The sky, it...it is beautiful."},{"name":"YSHTOLA","text":"Though recent events plainly warrant further discussion, I think it best that we wait until Alphinaud and the others are present."},{"name":"YSHTOLA","text":"...Emet-Selch included. How convenient that he should choose this moment to keep to the shadows."},{"name":"YSHTOLA","text":"Well...no matter. For the present, we should return to Fanow and make certain of the Eulmorans' withdrawal."},{"name":"YSHTOLA","text":"After that, Slitherbough. The Blessed are no doubt elated by what has become of the sky."},{"name":"ALMET","text":"You are returned. And unharmed, I see."},{"name":"YSHTOLA","text":"Indeed. I am pleased to report that the Lightwarden is no more, thanks in large part to you."},{"name":"ALMET","text":"That the death of a single sin eater should make such a difference..."},{"name":"ALMET","text":"As our numbers waned, so too did our hope that the ruins we have devoted our lives to guarding would ever find purpose."},{"name":"ALMET","text":"Yet here you are, the allies for whom we have waited these many centuries. And with your arrival came the chance to pass on our legacy─the ancient wisdom of the empire."},{"name":"ALMET","text":"That alone would have been reward enough... Never did we imagine it would serve to banish the Light that pervaded these woods."},{"name":"ALMET","text":"On behalf of the Viis, our forebears, and the late emperor of Ronka, you have our deepest thanks. "},{"name":"YSHTOLA","text":"It is we who should be thanking you. Our journey through the Qitana Ravel proved...most enlightening."},{"name":"YSHTOLA","text":"To be privy to such knowledge is an honor. One for which we never hoped..."},{"name":"CYMET","text":"Please, you need not be so humble!"},{"name":"ALMET","text":"We but do our duty as decreed by the late emperor. Would that he were still with us to express his gratitude in person."},{"name":"UIMET","text":"But Sister, does this not mean our duty is fulfilled?"},{"name":"ALMET","text":"To our allies, perhaps, but the ruins cannot be left unguarded."},{"name":"ALMET","text":"So long as we live here in these woods, the secrets of Ronka must not fall into the wrong hands."},{"name":"RYNE","text":"Is Runar still here?"},{"name":"ALMET","text":"No, we escorted him back to Slitherbough shortly after you set out."},{"name":"ALMET","text":"If you would return to the Night's Blessed, we will not keep you any longer. I suspect they would be glad of your company."},{"name":"YSHTOLA","text":"Thank you, Almet. I look forward to a day when we might share a more leisurely visit to the ruins of Ronka."},{"name":"ALMET","text":"We will await your return, then."},{"name":"ALMET","text":"Should you have need of the wisdom of Ronka again, you know where to find us."},{"name":"UIMET","text":"Be it a year from now or ten, we look forward to your return."},{"name":"CYMET","text":"Perhaps someday we will visit your home instead."}],"reward":{"gil":1033},"reqs":{"jobs":[{"lvl":75,"id":142}],"quests":[68876]},"next":[68878,69330]},"partials":[{"type":"npc","id":"1029557","obj":{"i":1029557,"n":"Y'shtola","l":2957,"q":2}},{"type":"npc","id":"1029197","obj":{"i":1029197,"n":"Runar","l":2957,"q":3}},{"type":"quest","id":"68876","obj":{"i":68876,"n":"The Burden of Knowledge","g":8,"l":"The Rak'tika Greatwood","s":620}},{"type":"quest","id":"68878","obj":{"i":68878,"n":"Out of the Wood","g":8,"l":"The Rak'tika Greatwood","s":640}},{"type":"quest","id":"69330","obj":{"i":69330,"n":"The Stewards of Note","g":58,"l":"The Rak'tika Greatwood","s":1,"f":1}}]}