{"quest":{"name":"Out of the Wood","location":"The Rak'tika Greatwood","id":68878,"patch":5.0,"sort":640,"eventIcon":71201,"issuer":1029011,"target":1030610,"genre":8,"journal":["You cannot help but feel something is bothering Y'shtola."],"objectives":["Speak with Y'shtola.","Wait at the entrance to Slitherbough.","Speak with Y'shtola.","Speak with the manager of suites in the Pendants."],"dialogue":[{"name":"THANCRED","text":"What <span class=\"emphasis\">Master Matoya</span> did was completely and utterly reckless... But if not for her, a great many of the Night's Blessed would not be here."},{"name":"RYNE","text":"Considering the Blessed have only just recovered from their encounter with the Eulmorans, Thancred and the others thought we should stay a while longer to be sure they're all right."},{"name":"RYNE","text":"They're such a kind and caring people. I pray they never again have to face such hardship."},{"name":"URIANGER","text":"It seems the Blessed were spared the worst of the Eulmorans' assault, for the better part of Ran'jit's forces abandoned Slitherbough in our pursuit."},{"name":"URIANGER","text":"Had he been but a few steps faster, he may well hath foiled our efforts to slay the Lightwarden."},{"name":"YSHTOLA","text":"Though it pains me to leave, it is time I returned with you and the others to the Crystarium."},{"name":"YSHTOLA","text":"But before we go, might I speak with you in private? I will await you in my chambers."},{"name":"YSHTOLA","text":"Thank you for coming. I thought to keep my suspicions to myself, but after witnessing your victory at Rak'tika Falls, I fear they prove true, and so I must share them with you."},{"name":"YSHTOLA","text":"From the first when we met at Fort Gohn, your aether has appeared...tainted. Suffused with an overabundance of light not unlike the sin eaters."},{"name":"YSHTOLA","text":"When you defeated the Lightwarden, I fear the light which poured forth from it was not negated by Hydaelyn's blessing. Rather, it was absorbed into your being."},{"name":"YSHTOLA","text":"Urianger also suspects as much, though he is unwilling to share his thoughts on the matter."},{"name":"YSHTOLA","text":"One thing is certain: with every Warden you defeat, the danger to you grows greater. Greater perhaps than we can imagine. If you begin to feel anything strange─anything at all─pray inform me at once."},{"name":"YSHTOLA","text":"You should hurry, before the others begin to worry. Once I have sorted my things here I will join you."},{"name":"YSHTOLA","text":"Pray go on ahead. I would first attend to this unsightly collection of books."},{"name":"YSHTOLA","text":"&lt;sigh&gt; I'd always complained that her cave was such a mess, books and scrolls strewn about like a child's playthings. Gods, I really <span class=\"emphasis\">am</span> turning into her..."},{"name":"THANCRED","text":"We took one last patrol of the perimeter. All things considered, Slitherbough remains relatively unscathed."},{"name":"RYNE","text":"Thanks to the antidote, all those who were poisoned will make a full recovery."},{"name":"RYNE","text":"And with the night sky returned, their prayers have at last been answered."},{"name":"YSHTOLA","text":"Sorry to keep you all waiting. Shall we be off, then?"},{"name":"URIANGER","text":"Art thou certain this is best?"},{"name":"YSHTOLA","text":"...I'll not deny there is a part of me that wishes I could stay."},{"name":"YSHTOLA","text":"For two years I have lived with the Blessed, learned their culture, even going so far as to adopt Master Matoya's name as my own. I but pray I did honor to it."},{"name":"YSHTOLA","text":"Now is not the time for doubt or hesitation. Come, we must return to the Crystarium."},{"name":"THANCRED","text":"Hopefully the others will arrive before long."},{"name":"RYNE","text":"I know he said he would be watching from the shadows, but doesn't it seem wrong to leave without at least telling Emet-Selch?"},{"name":"URIANGER","text":"'Twas passing strange to see the Crystarium so seemingly desolate, yet it appears all is well."},{"name":"YSHTOLA","text":"All things considered, it is hardly surprising that Alphinaud and Alisaie have yet to arrive, but where is the Exarch?"},{"name":"ALPHINAUD","text":"My friends! 'Tis good to see you all again."},{"name":"YSHTOLA","text":"Alphinaud! It has been too long."},{"name":"ALPHINAUD","text":"I assume your presence here means you've brought word of the Warden hiding in Rak'tika?"},{"name":"ALPHINAUD","text":"Found and slain, you say? I should have known."},{"name":"MYSTERYVOICE","text":"Eulmore has but recently dispatched soldiers to all corners of Norvrandt to defend them. I am glad to see their efforts were wasted on the Greatwood."},{"name":"THANCRED","text":"Speaking of Eulmore, what came of your meeting with Vauthry?"},{"name":"MYSTERYVOICE","text":"Yes, about that. It proved to be..."},{"name":"MYSTERYVOICE","text":"...Urgh."},{"name":"ALPHINAUD","text":"Exarch, you mustn't push yourself. Your time away from the tower has clearly taken its toll."},{"name":"ALPHINAUD","text":"No doubt you all are tired as well, having traveled so far. Why don't we all take a much-needed rest before we discuss our findings?"},{"name":"YSHTOLA","text":"I thought to propose the very same. After your clash with the Warden, you deserve a chance to recuperate."},{"name":"THANCRED","text":"It's settled, then. We reconvene after everyone has had time to settle in."},{"name":"GUIDEOFTHEPENDANTS","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Returned from a lengthy excursion, I take it."},{"name":"GUIDEOFTHEPENDANTS","text":"Well, your room has been made ready, if you'd care to retire?"},{"name":"Q1","text":"Retire to your quarters?"},{"name":"GUIDEOFTHEPENDANTS","text":"Very good. I pray you sound sleep and pleasant dreams."}],"reward":{"gil":1268,"items":[{"num":2,"id":27860,"one":1},{"num":2,"id":27861,"one":1},{"num":2,"id":27862,"one":1},{"num":2,"id":27863,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[68877]},"next":[69142]},"partials":[{"type":"npc","id":"1029011","obj":{"i":1029011,"n":"Y'shtola","l":2957,"q":1}},{"type":"npc","id":"1030610","obj":{"i":1030610,"n":"Manager Of Suites","l":2951,"q":5}},{"type":"item","id":"27860","obj":{"i":27860,"n":"Baguette","l":403,"c":24030,"t":46,"p":3501}},{"type":"item","id":"27861","obj":{"i":27861,"n":"Blood Tomato Juice","l":403,"c":24405,"t":46}},{"type":"item","id":"27862","obj":{"i":27862,"n":"Pixie Apple Pie","l":403,"c":24079,"t":46}},{"type":"item","id":"27863","obj":{"i":27863,"n":"Nut Bake","l":406,"c":24083,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68877","obj":{"i":68877,"n":"Bearing with It","g":8,"l":"The Rak'tika Greatwood","s":630}},{"type":"quest","id":"69142","obj":{"i":69142,"n":"When It Rains","g":8,"l":"The Crystarium","s":650}}]}