{"quest":{"name":"The Burden of Knowledge","location":"The Rak'tika Greatwood","id":68876,"patch":5.0,"sort":620,"icon":100912,"eventIcon":71201,"issuer":1029255,"target":1029557,"genre":8,"journal":["The entrance to the Qitana Ravel lies open, and Almet would see you on your way.","The Eulmorans have been routed, and while they scramble to regroup, Almet urges you to make for the Qitana Ravel. Together with your fellow Scions, you travel east, following the trail of flowers leading to its entrance.","You touch the door to the Qitana Ravel and feel aether emanating from within. The way is indeed open. Beyond awaits Rak'tika Falls and, you hope, the Lightwarden. Gritting your teeth, you cross the threshold, wary of the myriad dangers now stirring to life to bar your passage.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","After fighting your way past the sentinels of the Qitana Ravel, you arrive at Rak'tika Falls where, as expected, you find the Lightwarden. A frantic battle ensues, but in the end you emerge victorious, and the primordial Light of the firmament at last gives way to a breathtaking night sky. Your task complete, you turn your steps back to Fanow.","While passing through the halls of the Qitana Ravel, a series of murals chance to catch Y'shtola's eye. As she ponders their significance, her thoughts are interrupted by the fashionably late arrival of Emet-Selch. He bids you make haste in quitting the temple, but soon finds himself similarly captivated by the murals, not out of curiosity but nostalgia. Y'shtola duly invites him to explain what it is they depict, and he obliges with an utterly unforeseeable tale: that Zodiark and Hydaelyn are the eldest of primals, and that it was the Ascians who first conjured them into being. His lesson concluded, Emet-Selch then departs, leaving you and your companions to continue your journey outside in stunned silence.","You have been confronted with an uncomfortable truth─assuming it <span class=\"emphasis\">is</span> the truth. Yet there is little time to give thought to Emet-Selch's claims, for your duty to save the First is not yet done."],"objectives":["Search the destination.","Enter the Qitana Ravel.","Speak with Y'shtola."],"dialogue":[{"name":"YSHTOLA","text":"Tell me, what has happened since our encounter with the Eulmorans?"},{"name":"THANCRED","text":"Though it leaves a rather sour taste in my mouth saying so... I'm glad that Emet-Selch was here. "},{"name":"THANCRED","text":"We can but pray Y'shtola never does anything so reckless again."},{"name":"RYNE","text":"Urianger once told me that being immersed in the Lifestream can cause irreparable harm to the body. Do you suppose Y'shtola is all right?"},{"name":"URIANGER","text":"In all of history, there are but few who have returned from a misadventure in the aetherial sea possessed of mind and body both."},{"name":"URIANGER","text":"To have done so <span class=\"emphasis\">twice</span> beggareth belief. 'Tis plain Y'shtola wanteth not for favor among the Twelve."},{"name":"RUNAR","text":"By all that is dark, Master Matoya is returned! She stands here before me yet still I cannot believe it."},{"name":"UIMET","text":"With your friend returned, you will resume your exploration of the ruins, yes? But say the word and we shall assist you."},{"name":"CYMET","text":"It was fate who brought you to us, and fate who returned your companion to you. She yet smiles on Ronka, I am sure of it."},{"name":"EMETSELCH","text":"I told you, I tire of these inane arguments. Shouldn't you be getting ready to slay the next Lightwarden or something?"},{"name":"ALMET","text":"With the Eulmorans gone, and your companion now returned, I think it best you go now before they can regroup."},{"name":"ALMET","text":"With magick flowing once more through the Great Pyramid of Ux'ner, the entrance to the Qitana Ravel should now be open."},{"name":"YSHTOLA","text":"Before we leave─Urianger, did you discover anything that may suggest the Lightwarden hides elsewhere?"},{"name":"URIANGER","text":"Nay. Though we had but little time before the Eulmorans' most unwelcome arrival, we scoured the nearby environs and spoke once more with the one called Korille."},{"name":"URIANGER","text":"Having hearkened to her tale, it is my judgment that the sin eater which her late mother did espy was indeed the being we seek, and that it most likely resided in the vicinity of Rak'tika Falls."},{"name":"URIANGER","text":"In the absence of any subsequent sighting, I have no reason to believe our quarry hath sought out a new sanctuary. And given the considerable difficulty we face in reaching the falls, we may be certain it hath not been disturbed by man."},{"name":"YSHTOLA","text":"Then our course is clear."},{"name":"YSHTOLA","text":"We must navigate the Qitana Ravel and make for Rak'tika Falls."},{"name":"ALMET","text":"Though you see it as but another obstacle to be navigated, the Qitana Ravel is the oldest and most sacred of our temples. The accumulated knowledge of the empire is said to reside within."},{"name":"ALMET","text":"Knowledge which is rightly yours as allies of Ronka. You are welcome to explore."},{"name":"YSHTOLA","text":"I fully intend to survey every ilm of it─once our mission is complete."},{"name":"UIMET","text":"Were the emperor still alive, he would be overjoyed to hear you say so."},{"name":"UIMET","text":"But I must warn you─though the way is open, it will still be heavily guarded."},{"name":"CYMET","text":"To discourage trespassers and test the worth of our allies, it had to be so."},{"name":"CYMET","text":"Be careful in there."},{"name":"ALMET","text":"Head east and you will find the path of azure flowers leading to the Ravel. I wish you safe passage through its halls."},{"name":"RUNAR","text":"Master Matoya. I know I cannot dissuade you from going, so please─promise me you will return safely. The Night's Blessed need you..."},{"name":"YSHTOLA","text":"You need not worry, Runar. I shall return, and bring with me a long-awaited gift. One the Night's Blessed will treasure now and forevermore."},{"name":"YSHTOLA","text":"Now, let us away."},{"name":"YSHTOLA","text":"This had better work. I have no wish to return to the Great Pyramid."},{"name":"THANCRED","text":"After you, my friend."},{"name":"RYNE","text":"I can't imagine what could have survived in there after so many years..."},{"name":"URIANGER","text":"At long last, the time hath come to find out what wonders yet remain at the heart of Ronka."},{"name":"RUNAR","text":"See that you take good care of Master Matoya, and may the shadows keep you."},{"name":"ALMET","text":"Travel east along the path of azure flowers. The Qitana Ravel is not far."},{"name":"UIMET","text":"The Qitana Ravel is said to be fiercely guarded. Please be careful."},{"name":"CYMET","text":"You need not worry about the Eulmorans while you are inside. Should they return, we will be ready."},{"name":"EMETSELCH","text":"Lest you doubt, I <span class=\"emphasis\">won't</span> be helping you do battle with the Lightwarden. To accompany you thus is quite taxing enough."},{"name":"EMETSELCH","text":"Now, if you've no further questions...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Are there any other Ascians here in the First?"},{"name":"A1","text":"Actually, I...don't."},{"name":"EMETSELCH","text":"Not a single one. Happily, I am quite content to mingle with the masses. And even if I did crave the company of my own kind, one might say we're understaffed at present."},{"name":"EMETSELCH","text":"There are no strict rules governing how we work, though that has not been without its consequences. In the beginning, we were each responsible for a shard, and free to do as we wished, but Igeyorhm's impetuous temperament showed us the folly in that."},{"name":"EMETSELCH","text":"In light of her failings, we took to working in tandem as the situation demanded."},{"name":"EMETSELCH","text":"Mitron and Loghrif were supposed to take care of the First, of course."},{"name":"EMETSELCH","text":"Alas, they were slain by the champions of this realm shortly before the Flood. Expendable though they were, I found them quite useful."},{"name":"EMETSELCH","text":"But that is a tale for another time."},{"name":"EMETSELCH","text":"Then run along back to your friends and leave me be!"},{"name":"SYSTEM","text":"You can feel the aether flowing through the door. A gentle push may be all that's required..."},{"name":"YSHTOLA","text":"Our earlier efforts were not in vain, it seems."},{"name":"YSHTOLA","text":"Stay on your guard, <span class=\"highlight\">Forename</span>. We know not what awaits us inside."},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Small talk."},{"name":"A2","text":"Form a party and enter the Qitana Ravel."},{"name":"A2","text":"Nothing."},{"name":"YSHTOLA","text":"I never did tell you why I chose to take up thaumaturgy, did I?"},{"name":"YSHTOLA","text":"As you will no doubt have noticed, life here in the First can be exceedingly unforgiving. Brutal, in a word."},{"name":"YSHTOLA","text":"I had not long been in Norvrandt when I realized my mastery of conjuring magicks would not suffice to protect the people. 'Twas a struggle at first to embrace the change, but I confess the path of the thaumaturge suits me rather well."},{"name":"THANCRED","text":"Keep an eye on Y'shtola and Urianger, would you? It wouldn't surprise me in the slightest if one of them wandered off to inspect the temple's relics."},{"name":"THANCRED","text":"Well, let's get this over with, shall we?"},{"name":"RYNE","text":"To think we'll be the first people in thousands of years to set foot inside this place."},{"name":"RYNE","text":"It's humbling. Knowing they've entrusted us with the history of their people. With their legacy..."},{"name":"URIANGER","text":"When Thancred and I spoke with Korille, she described unto us the form of our quarry, just as her mother had once done unto her."},{"name":"URIANGER","text":"'Tis a feathered beast possessed of three heads, both simian and canine in nature. An abomination amongst abominations. Were Alphinaud to paint the picture sketched by the lady's words, the result would surely turn the blood to ice."},{"name":"THANCRED","text":"The eldest and most powerful of primals... Gods. If that were Hydaelyn's origin, then what would that make─<br>...No. No, I will not take the words of an Ascian on trust. It has to be a lie."},{"name":"RYNE","text":"Thancred did tell me about primals...but I don't fully understand what all of this means."},{"name":"URIANGER","text":"'Tis oft said truth is a matter of perspective. Yet upon <span class=\"emphasis\">this</span> matter, there can be but one truth. I only pray it is not his."},{"name":"ALMET","text":"<span class=\"highlight\">Forename</span>, you are returned! But...something troubles you. Is aught amiss?"},{"name":"UIMET","text":"What has happened to the sky!? I have never seen anything like it!"},{"name":"CYMET","text":"The sky, it...it is beautiful."},{"name":"YSHTOLA","text":"That was an enlightening experience. Though not in the way I had hoped."},{"name":"YSHTOLA","text":"Do you suppose there is any truth in Emet-Selch's claims?"}],"reward":{"gil":4384,"aetherCurrent":1,"instance":66},"reqs":{"jobs":[{"lvl":75,"id":142}],"quests":[68875]},"next":[68877]},"partials":[{"type":"npc","id":"1029255","obj":{"i":1029255,"n":"Almet","l":2957,"q":1}},{"type":"npc","id":"1029557","obj":{"i":1029557,"n":"Y'shtola","l":2957,"q":2}},{"type":"instance","id":"66","obj":{"i":66,"n":"The Qitana Ravel","c":61801,"t":"Dungeons","min_lvl":75,"max_lvl":76,"min_ilvl":380}},{"type":"quest","id":"68875","obj":{"i":68875,"n":"In Good Faith","g":8,"l":"The Rak'tika Greatwood","s":610}},{"type":"quest","id":"68877","obj":{"i":68877,"n":"Bearing with It","g":8,"l":"The Rak'tika Greatwood","s":630}}]}