{"quest":{"name":"A Cry for Help","location":"The Crystarium","id":68879,"patch":5.0,"sort":10,"eventIcon":71221,"issuer":1027827,"target":1027254,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Billfort is looking for someone with time on their hands."],"objectives":["Present the flyer to Fae-Hann.","Speak with Leinneil.","Obtain a cutting of dawn faetail.","Obtain dawn faetail nectar.","Deliver the faetail cutting and nectar to Fae-Hann."],"dialogue":[{"name":"BILLFORT","text":"You there. You look as if you could use something to occupy yourself with."},{"name":"BILLFORT","text":"I received this flyer soliciting help at Spagyrics, but I am far too busy with my own duties to contribute. It seemed a shame to not at least pass it on, though─they do good work there. Vital work."},{"name":"BILLFORT","text":"If you're interested in offering your assistance, you'll find Spagyrics just southwest of here. Fae-Hann should be more than willing to explain the specific tasks that volunteering would entail."},{"name":"BILLFORT","text":"I do hope you will consider lending a hand at Spagyrics. The whole of the Crystarium depends on its services, you know."},{"name":"FAEHANN","text":"You don't <span class=\"emphasis\">appear</span> to have any gaping wounds... Are you here for a tincture, perhaps? If so, I'm afraid it will take some time to prepare."},{"name":"FAEHANN","text":"You've come in answer to our plea for help? Oh, thank goodness! We don't have nearly enough manpower to keep up with the demand for poultices and restoratives at present, and I constantly feel as if I'm mere moments away from losing my wits from the stress of it."},{"name":"FAEHANN","text":"In fact, are you available to start right away? I am in urgent need of someone who might go to the Hortorium for more dawn faetail cuttings and nectar. If you are unsure of what those look like, never fear─Leinneil will direct you to the correct plant."},{"name":"FAEHANN","text":"Dawn faetails are large, glowing herbs─though I realize that applies to many of the plants growing in the Hortorium. You really ought to ask Leinneil to show you."},{"name":"LEINNEIL","text":"Oho, a new assistant at Spagyrics, are you? And what can I help you with today?"},{"name":"LEINNEIL","text":"Ah, dawn faetails. Naturally. Those are the brightly colored, brushlike plants that you see─I recommend you take a cutting from the tallest one. We've been quite successful in encouraging their growth of late, so you needn't worry about taking what you require."},{"name":"LEINNEIL","text":"As for the nectar, you'll need to ask one of the researchers at the cauldron for that. It's a bit too difficult for an amateur to extract."},{"name":"LEINNEIL","text":"Since it seems that it's your first time encountering them, it may interest you to hear that the dawn faetail is one of the few plants to have survived from the time before the Flood."},{"name":"LEINNEIL","text":"Then, they were kept solely for their beauty─which I agree is quite remarkable. In the time since the Flood, however, we have experimented with various cultivars to intensify their healing properties, and they are now used in a variety of medicines."},{"name":"LEINNEIL","text":"I hope that gives you a bit of an appreciation for the sort of work done here─though I apologize for the digression. I'm sure you will be wanting to get back to Spagyrics as soon as possible."},{"name":"LEINNEIL","text":"I recommend that you take a cutting from the tallest of the faetails. One of the researchers at the cauldron can provide you with the nectar."},{"name":"RESEARCHER03343","text":"From Spagyrics, are you? One moment, please─this is a crucial moment for observing the results of this experiment."},{"name":"RESEARCHER03343","text":"Hmm... There appears to be very little difference in how these fertilizer components interact. It is a delicate balance, so perhaps our measurements were off, but we should also consider whether it's the temperature that's causing the problem..."},{"name":"RESEARCHER03343","text":"Ah, well. Faetail nectar, was it? Here you are. Have care that you put it to good use."},{"name":"RESEARCHER03343","text":"Why do we conduct experiments using such a large cauldron, you ask? For reasons, of course. Reasons."},{"name":"FAEHANN","text":"Welcome back! Doubly so, if you have what we need."},{"name":"FAEHANN","text":"Perfect. I'm sure we shall be putting this to use right away─the patients haven't stopped coming, that's for certain."},{"name":"FAEHANN","text":"Our work can be grueling, I admit. It is for that reason that many who arrive with a mind to join our ranks find themselves quitting soon after. Thus are we so perpetually wanting for personnel..."},{"name":"FAEHANN","text":"It's work worth doing, though, and I was glad to have your help with it today. Thank you."}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68817]}},"partials":[{"type":"npc","id":"1027827","obj":{"i":1027827,"n":"Billfort","l":2951,"q":1}},{"type":"npc","id":"1027254","obj":{"i":1027254,"n":"Fae-Hann","l":2951,"q":1}},{"type":"quest","id":"68817","obj":{"i":68817,"n":"Travelers of Norvrandt","g":8,"l":"The Crystarium","s":30}}]}