{"quest":{"name":"Top of the Tree","location":"The Rak'tika Greatwood","id":68870,"patch":5.0,"sort":560,"eventIcon":71201,"issuer":1030374,"target":1029231,"genre":8,"journal":["Cymet is staring intently in your general direction."],"objectives":["Speak with Almet.","Speak with the residents of Fanow to gather information.","Speak with Almet."],"dialogue":[{"name":"CYMET","text":"This way, um... What is your name?"},{"name":"CYMET","text":"<span class=\"emphasis\"><span class=\"highlight\">Forename</span></span>? ...And this is a common name nowadays? How times change."},{"name":"CYMET","text":"But I digress. Come, and be sure to watch your step."},{"name":"THANCRED","text":"They call themselves Viis, is that right? Not a terribly diverse people from what I can see."},{"name":"RYNE","text":"For a moment, I was worried they wouldn't accept the seal."},{"name":"URIANGER","text":"For <span class=\"emphasis\">three thousand years</span> did they wait... Incredible."},{"name":"YSHTOLA","text":"No dawdling. Once we have learned all we can of the Warden and its whereabouts, we should be on our way."},{"name":"UIMET","text":"My apologies for the hostile greeting."},{"name":"UIMET","text":"It is a miracle our arrows did not find their mark."},{"name":"CYMET","text":"If you would hear the tale of our people, speak with Almet. As eldest, she is our voice."},{"name":"ALMET","text":"As bearers of the seal, you have a right to know what became of the empire, and my people's purpose here."},{"name":"ALMET","text":"We are descendants of the palace guard which served under the last emperor. And to this day, we carry on the duty of our forebears, the final decree of His Eminence before Ronka's fall."},{"name":"ALMET","text":"“By the wisdom of our people was Ronka made to thrive. Such knowledge must never be forgotten, nor may it be suffered to fall into the hands of the wicked."},{"name":"ALMET","text":"“Keep it secret. Keep it safe. And look to the coming of our allies. Unto them you shall bequeath our all, and thus will Ronka live on.”"},{"name":"ALMET","text":"By his command we have remained in the Rak'tika Greatwood, guardians of Ronka's ruins, and the wisdom held within."},{"name":"URIANGER","text":"I hope thou wilt not think the question impertinent, but did thy people's famed longevity perchance play a part in the emperor's decision to entrust this mission unto thee and thine?"},{"name":"ALMET","text":"That was one reason, yes. We Viis would easily live to see three of your elven lifetimes."},{"name":"ALMET","text":"We were also the fiercest fighters. There are none more fit than us to stand watch over the remains of Ronka."},{"name":"UIMET","text":"But our duty has grown ever more perilous in the wake of the Flood."},{"name":"CYMET","text":"Settlements such as this one were plentiful before the Light claimed dominion over the land. But now... "},{"name":"CYMET","text":"Fanow is all that remains."},{"name":"ALMET","text":"Our numbers dwindle year by year..."},{"name":"ALMET","text":"Before long, there will be no one left to honor the emperor's wishes."},{"name":"YSHTOLA","text":"And you believe we are the allies for whom you have waited?"},{"name":"UIMET","text":"You have the seal, do you not!? After three millennia of waiting, that alone is nothing short of a miracle! Truth be told, I had begun to think you would never come!"},{"name":"CYMET","text":"Sister!"},{"name":"ALMET","text":"We are glad of your presence here in the Greatwood."},{"name":"ALMET","text":"The wisdom of Ronka is yours should you wish it. You need only ask."},{"name":"ALMET","text":"You come in search of the Lightwarden..."},{"name":"ALMET","text":"My apologies, but I do not know where it makes its lair."},{"name":"ALMET","text":"Uimet, do you recall any sightings of this creature?"},{"name":"UIMET","text":"Hmmm... Not these past thirty summers."},{"name":"RYNE","text":"<span class=\"emphasis\">Thirty</span>? But that would mean... How old are you, exactly?"},{"name":"UIMET","text":"...Young enough to remember!"},{"name":"ALMET","text":"With age comes knowledge. There may yet be one among us who has seen or heard of the abomination you seek."},{"name":"YSHTOLA","text":"We have leave to speak with the other Viis, then?"},{"name":"ALMET","text":"But of course."},{"name":"YSHTOLA","text":"Then we should split up and inquire individually. If someone knows something, I would hear it while there is yet time to act."},{"name":"ALMET","text":"In the name of Ronka and the late emperor, I promise we will do all we can to assist you and yours."},{"name":"UIMET","text":"Let not our looks deceive you. It is true we are still in our youth, but we are older than you might think."},{"name":"CYMET","text":"I pray you find the knowledge you seek. Oh, what I would not give to see the Warden brought low."},{"name":"KORILLE","text":"An outsider!? B-But how?"},{"name":"KORILLE","text":"By the gods─allies of the empire! My sincerest apologies for failing to note your arrival."},{"name":"KORILLE","text":"It was the Warden you wished to know about, yes? My mother─may she rest in peace─told me once of its appearance in these woods."},{"name":"KORILLE","text":"Before settling here in Fanow, she lived in a village near Rak'tika Falls─until it was destroyed by the sin eaters."},{"name":"KORILLE","text":"While out on patrol one day, she spotted a swarm of the abominations, one of which was different from the rest."},{"name":"KORILLE","text":"It was larger, for one thing, but what struck her was the way its fellows seemed to revere it. She was convinced that what she had seen was the Lightwarden."},{"name":"SYSTEM","text":"Your exchange with Korille has taught you something about the Lightwarden's possible whereabouts."},{"name":"KORILLE","text":"Would that my mother were still with us. I am certain she could help you find the Warden."},{"name":"NYMET","text":"It was not my intention to pry, but your voices carry far. I know what it is you would ask of me."},{"name":"NYMET","text":"Unfortunately the answer is no, I have not seen the Lightwarden. I patrol the ruins' perimeter regularly, and if it were hiding nearby, I would know about it."},{"name":"NYMET","text":"I apologize that I cannot be of more help, but I have told you all I know."},{"name":"LOYMET","text":"You search for the Lightwarden? I cannot say I have ever laid eyes on it."},{"name":"LOYMET","text":"Our duty is to protect the ruins, nothing more. We have no need to strike out in search of such a foe."},{"name":"LOYMET","text":"I see no reason to pursue one who poses no threat to the ruins."},{"name":"SHOINA","text":"The Lightwarden? No, I have not seen it."},{"name":"SHOINA","text":"But I have witnessed the horrors of the lesser eaters. How they are wont to hunt in packs and carry off their victims rather than consuming them on the spot."},{"name":"SHOINA","text":"I suspect the Warden is a grotesque, corpulent thing, waiting patiently for its minions to bring its next meal."},{"name":"SHOINA","text":"I have not seen the Lightwarden, and I pray I never do."},{"name":"THANCRED","text":"No one I spoke to had seen hide nor hair of the Warden. But that may not be surprising, given their disinclination to stray far from the ruins."},{"name":"RYNE","text":"Did you have any luck speaking with the Viis?"},{"name":"URIANGER","text":"Myriad are the tales the Viis did share with me. Alas, none made mention of the Warden or its lair."},{"name":"YSHTOLA","text":"Were you able to learn aught of the Warden's whereabouts?"},{"name":"ALMET","text":"I pray the others were able to provide what I could not."},{"name":"ALMET","text":"Near Rak'tika Falls!? Why was I not told of this?"},{"name":"UIMET","text":"I think I see now why it has never been spotted on our patrols."},{"name":"YSHTOLA","text":"I have never heard of this Rak'tika Falls. I can but assume it lies deep within the woods of Yx'Maja."},{"name":"CYMET","text":"Just so. But the tunnel which leads there collapsed after a rather bloody battle with the eaters, and has not been passable for many years."},{"name":"CYMET","text":"We made several attempts to clear away the rubble, yet each time we were driven back. In the end, we were forced to give it up as lost."},{"name":"ALMET","text":"...Thereby making it a suitable place for the Warden to take sanctuary."},{"name":"ALMET","text":"There is perhaps one way to enter. Though it would be at great peril to you and your companions."},{"name":"ALMET","text":"The Qitana Ravel, a temple to the northeast."},{"name":"ALMET","text":"It has been sealed for centuries, but within is a path that leads to the falls."},{"name":"YSHTOLA","text":"Can it be opened?"},{"name":"ALMET","text":"For the allies of Ronka, it can."},{"name":"ALMET","text":"First we must go to the K'mul Astropolis. Once the flow of magic is restored there, the path through the Qitana Ravel can be opened."},{"name":"UIMET","text":"This may sound a simple task, but there are certain...obstacles which prevent us from attending to it ourselves."},{"name":"UIMET","text":"...And we know not how to overcome them."},{"name":"CYMET","text":"The emperor never granted our forebears leave to look upon the secrets we are charged with protecting. That we might not be tempted, the means to do so were withheld from us."},{"name":"CYMET","text":"We can but show you the way. The rest will be up to you."},{"name":"YSHTOLA","text":"It would seem we have our work cut out for us, then. Shall we?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Did you have to ask?"},{"name":"A1","text":"We've no time to waste."},{"name":"A1","text":"If we must."},{"name":"YSHTOLA","text":"Let us be about it then."},{"name":"ALMET","text":"If that is your wish, it is my duty to escort you."},{"name":"YSHTOLA","text":"While we attend to matters at the K'mul Astropolis, I would ask that your sisters accompany Urianger and Thancred, and share with them all they can of these woods."},{"name":"YSHTOLA","text":"While we have every intention of investigating Rak'tika Falls, 'tis yet possible the Lightwarden dwells elsewhere."},{"name":"YSHTOLA","text":"With that in mind, it would behoove us to prepare an alternative course of action."},{"name":"ALMET","text":"Uimet. Cymet. I leave them to you."},{"name":"UIMET","text":"Yes, Sister."},{"name":"URIANGER","text":"Should our present course prove false, doubt not but that Thancred and I shall find any and all possible paths forward."}],"reward":{"gil":785,"items":[{"id":26848}]},"reqs":{"jobs":[{"lvl":75,"id":142}],"quests":[68869]},"next":[68871,68996,68997,68998,68999,69000,69001,69002,69003,69004,69005,69006]},"partials":[{"type":"npc","id":"1030374","obj":{"i":1030374,"n":"Cymet","l":2957,"q":1}},{"type":"npc","id":"1029231","obj":{"i":1029231,"n":"Almet","l":2957,"q":2}},{"type":"item","id":"26848","obj":{"i":26848,"n":"Bluespirit Chest Gear Coffer (IL 403)","l":1,"c":26559,"t":61}},{"type":"quest","id":"68869","obj":{"i":68869,"n":"Into the Wood","g":8,"l":"The Rak'tika Greatwood","s":550}},{"type":"quest","id":"68871","obj":{"i":68871,"n":"Look to the Stars","g":8,"l":"The Rak'tika Greatwood","s":570}},{"type":"quest","id":"68996","obj":{"i":68996,"n":"Paying Respects","g":117,"l":"The Rak'tika Greatwood","s":5001}},{"type":"quest","id":"68997","obj":{"i":68997,"n":"A Recipe for Trouble","g":117,"l":"The Rak'tika Greatwood","s":5010}},{"type":"quest","id":"68998","obj":{"i":68998,"n":"Blessings of the Wood","g":117,"l":"The Rak'tika Greatwood","s":5020}},{"type":"quest","id":"68999","obj":{"i":68999,"n":"Talk of the Town","g":117,"l":"The Rak'tika Greatwood","s":5030}},{"type":"quest","id":"69000","obj":{"i":69000,"n":"A Sight Unseen","g":117,"l":"The Rak'tika Greatwood","s":5040}},{"type":"quest","id":"69001","obj":{"i":69001,"n":"Back Where It Belongs","g":117,"l":"The Rak'tika Greatwood","s":5050}},{"type":"quest","id":"69002","obj":{"i":69002,"n":"Not Unfamiliar","g":117,"l":"The Rak'tika Greatwood","s":5060}},{"type":"quest","id":"69003","obj":{"i":69003,"n":"Suit Up","g":117,"l":"The Rak'tika Greatwood","s":5070,"f":1}},{"type":"quest","id":"69004","obj":{"i":69004,"n":"Delivery Time","g":117,"l":"The Rak'tika Greatwood","s":5080}},{"type":"quest","id":"69005","obj":{"i":69005,"n":"Out on One's Own","g":117,"l":"The Rak'tika Greatwood","s":5090}},{"type":"quest","id":"69006","obj":{"i":69006,"n":"One Last Bite","g":117,"l":"The Rak'tika Greatwood","s":5101}}]}