{"quest":{"name":"Pour One Out","location":"The Crystarium","id":68881,"patch":5.0,"sort":30,"eventIcon":71221,"issuer":1027323,"target":1027323,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Darlfort seems troubled."],"objectives":["Obtain the potent liquor from Eidith.","Deliver the potent liquor to the Catenaries manager.","Speak with Darlfort."],"dialogue":[{"name":"DARLFORT","text":"Good morrow, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>. I'm terribly sorry to ask this of a patron, but could you perchance find the time to make a delivery for me?"},{"name":"DARLFORT","text":"Just yesterday, you see, a customer─not a regular, I believe he's visiting from outside the Crystarium─came asking after a particularly strong spirit that we're known to serve. At the time, we had just run out, but I offered that our supplier would have more ready today."},{"name":"DARLFORT","text":"He told me that that would be fine, but that he would require it be delivered to his lodgings. He then paid quite a handsome sum in advance...before consuming more than a half-dozen pints of ale in short order and wandering off."},{"name":"DARLFORT","text":"The whole experience was incredibly odd. I do, of course, fully intend to provide him with the alcohol that he paid for─but I also cannot help but be concerned by his behavior. It seems to me that someone ought to check on him."},{"name":"DARLFORT","text":"Alas, between brewing and serving the customers, I can't seem to find time to slip away. Could I impose upon you to deliver the liquor in my stead, and inquire as to whether the man is quite well?"},{"name":"DARLFORT","text":"Eidith should have the alcohol in question ready at Musica Universalis. And as for our eccentric patron─you will find him at the Catenaries, assuming he gave me the correct information."},{"name":"DARLFORT","text":"By his conduct, I cannot help but wonder─no, best not to speculate."},{"name":"EIDITH","text":"Here on behalf of Darlfort? Aye, I have the liquor right here."},{"name":"EIDITH","text":"You'll be delivering this to a customer at the Catenaries, right? In that case, you'd do well to speak with the manager there. He's a helpful sort─should make sure it gets to the right person."},{"name":"EIDITH","text":"Tell Darlfort I appreciate the business, as always."},{"name":"ATTENDANT03345","text":"How might I be of service?"},{"name":"ATTENDANT03345","text":"Ah, I see. That guest is somewhat...indisposed, I'm afraid to say. But I will ensure that the liquor is delivered into his hands, if you will entrust it to me."},{"name":"ATTENDANT03345","text":"As to his condition─it does seem to be rather severe. His cries echoed through the corridors late into the evening."},{"name":"ATTENDANT03345","text":"Judging by what I have glimpsed, I fear that it is a mere matter of time ere he turns..."},{"name":"ATTENDANT03345","text":"But you need not concern yourself with that. Rest assured that we have matters well in hand here."},{"name":"ATTENDANT03345","text":"I will see to it that the alcohol reaches the intended recipient with all haste."},{"name":"DARLFORT","text":"A matter of time before he turns, you say... I suppose that does explain it."},{"name":"DARLFORT","text":"It's hardly a wonder that he turned to drink, I'm sure you would agree. In the throes of such agony and despair...what is a man to do?"},{"name":"DARLFORT","text":"I know not if it will bring him solace, in the end... But nevertheless, I thank you for making the delivery. "}],"reward":{"gil":679,"items":[{"num":2,"id":27854}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68817]}},"partials":[{"type":"npc","id":"1027323","obj":{"i":1027323,"n":"Darlfort","l":2951,"q":1}},{"type":"item","id":"27854","obj":{"i":27854,"n":"Purple Carrot Juice","l":390,"c":24416,"t":46,"p":3359}},{"type":"quest","id":"68817","obj":{"i":68817,"n":"Travelers of Norvrandt","g":8,"l":"The Crystarium","s":30}}]}