{"quest":{"name":"A Meating Long Overdue","location":"Kholusia","id":68888,"patch":5.0,"sort":1130,"eventIcon":71221,"issuer":1030260,"target":1030260,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The unfulfilled forager has a craving for meat."],"objectives":["Use the wrangling rope on a weakened tragopan.","Deliver the trussed-up tragopan to the unfulfilled forager."],"dialogue":[{"name":"GRIMYMAN03352","text":"Ah, what I wouldn't give for just one mouthful of juicy meat..."},{"name":"GRIMYMAN03352","text":"I've eaten naught but meol for more moons than I can count! I mean, I'm grateful for the handouts and all but sometimes a man needs variety."},{"name":"GRIMYMAN03352","text":"Aye, if I had me a roasted game bird about now, I'd strip that beauty down to the bone!"},{"name":"GRIMYMAN03352","text":"But have you ever tried catchin' one of them tragopans? It's like askin' to have your eyes pecked out. ...What, you reckon you could do better?"},{"name":"GRIMYMAN03352","text":"Go ahead, then─make me eat my own words. Just so long as they come with a side dish of bird flesh!"},{"name":"GRIMYMAN03352","text":"And make sure you bring it back alive and kickin', you understand? Here's a rope to truss it up, and a sack to carry it. You might need to, uh, daze it a bit first..."},{"name":"GRIMYMAN03352","text":"Once you've knocked the fight out of the bird, you can bind it with that length of rope!"},{"name":"GRIMYMAN03352","text":"Tell me there's a bird in that sack!"},{"name":"GRIMYMAN03352","text":"Oof, that's a feisty one! Nice work, stranger!"},{"name":"GRIMYMAN03352","text":"Ah, seein' this fellow all trussed up for the dinner table reminds me of bein' back in Stilltide..."},{"name":"GRIMYMAN03352","text":"It's been years since I left to chase after Eulmore's promises, but I'm no closer to gettin' through that gate than when I started."},{"name":"GRIMYMAN03352","text":"It's been years since I left to chase after Eulmore's promises─I suppose I've just gotten too used to the life here in Gatetown."},{"name":"GRIMYMAN03352","text":"Maybe it's time I gave up on hollow dreams and went home to my old mum...<br>Anyway, my thanks for the bird, friend!"}],"reward":{"gil":679,"items":[{"id":26831}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68820]}},"partials":[{"type":"npc","id":"1030260","obj":{"i":1030260,"n":"Unfulfilled Forager","l":2954,"q":1}},{"type":"item","id":"26831","obj":{"i":26831,"n":"White Oak Earring Coffer (IL 385)","l":1,"c":26564,"t":61}},{"type":"quest","id":"68820","obj":{"i":68820,"n":"Open Arms, Closed Gate","g":8,"l":"Kholusia","s":60}}]}