{"quest":{"name":"From a Distance","location":"The Crystarium","id":68883,"patch":5.0,"sort":50,"eventIcon":71221,"issuer":1027846,"target":1027846,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Anthibert has need of one with your particular qualifications."],"objectives":["Speak with the curious child.","Speak with Anthibert."],"dialogue":[{"name":"ANTHIBERT","text":"Pardon me─might you be the Crystal Exarch's esteemed guest? I'd like to borrow your expertise, if you've a moment to spare."},{"name":"ANTHIBERT","text":"There's a boy, you see, who frequents the Cabinet regularly. Like so many of his peers, he has never experienced the world outside the Crystarium. And so he comes here, to catch glimpses of it in the pages of timeworn books..."},{"name":"ANTHIBERT","text":"I am certain that what he truly desires is to learn of the living, breathing world, however. The world as it is today, through the eyes of one who has seen it."},{"name":"ANTHIBERT","text":"Might you share your experience with him? I believe you'll find him just up the stairs."},{"name":"ANTHIBERT","text":"The boy will like as not be full of questions─brace yourself."},{"name":"BOY03347","text":"You're from far away!? Then...can you tell me what the world outside is like? Pretty please?"},{"name":"BOY03347","text":"Oh! Then... Then... Can you tell me about the animals? There are a lot, right? Father says they're all dangerous, though. Is that true?"},{"name":"Q1","text":"Are all wild animals dangerous?"},{"name":"A1","text":"Most are only dangerous if you make them mad."},{"name":"A1","text":"They're all dangerous. And scary!"},{"name":"A1","text":"..."},{"name":"BOY03347","text":"Really? Oooh..."},{"name":"BOY03347","text":"Aww, you won't tell me?"},{"name":"BOY03347","text":"Um... What about what it looks like? Does the whole world look like Lakeland?"},{"name":"Q2","text":"Does the rest of the world look the same as Lakeland?"},{"name":"A2","text":"Pretty much. Trees, dirt, whatever."},{"name":"A2","text":"Some of it is more different than you could ever imagine."},{"name":"A2","text":"..."},{"name":"BOY03347","text":"Oh... I think I understand."},{"name":"BOY03347","text":"But <span class=\"emphasis\">why</span> won't you tell me?"},{"name":"BOY03347","text":"Hmm... Then, what about traveling? Mother says it's not worth it─there's nothing to see out there, and it's too dangerous... But I want to go on adventures! What do you think?"},{"name":"Q3","text":"Is it worth going on adventures?"},{"name":"A3","text":"It can be dangerous, but is always worthwhile."},{"name":"A3","text":"Your mother's right─there's no point to it."},{"name":"A3","text":"..."},{"name":"BOY03347","text":"Hmm... I see!"},{"name":"BOY03347","text":"...Are you maybe telling me that I should think about it on my own?"},{"name":"BOY03347","text":"I'm sure now─I want to see the world! I'm going to study, and...and practice martial arts! Then, when I'm strong and clever, I'll go on an adventure!"},{"name":"BOY03347","text":"It does seem pretty dangerous out there, but I still want to know more about the world! And maybe see it for myself someday."},{"name":"BOY03347","text":"I guess there really isn't anything you could tell me that would be the same as seeing it, is there? I need to go out there myself!"},{"name":"BOY03347","text":"Thank you for letting me ask questions! And please tell Anthibert that I'm going home─I have a lot of work to do! I wonder if Father will let me practice with his axe..."},{"name":"ANTHIBERT","text":"Yes, I saw him dash past, eyes twinkling."},{"name":"ANTHIBERT","text":"I do believe in the magic of the written word. How could I not? But it's not quite the same as meeting someone who has been there─who <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> is <span class=\"emphasis\">part</span> of the wider world."},{"name":"ANTHIBERT","text":"I've never ventured far from the Crystarium myself, you see, so I know the wonder and fascination that comes from hearing the fireside tales of travelers. You have my personal gratitude for sharing a bit of that with our young friend today."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68817]}},"partials":[{"type":"npc","id":"1027846","obj":{"i":1027846,"n":"Anthibert","l":2951,"q":1}},{"type":"quest","id":"68817","obj":{"i":68817,"n":"Travelers of Norvrandt","g":8,"l":"The Crystarium","s":30}}]}