{"quest":{"name":"Redolent Refuse","location":"Kholusia","id":68889,"patch":5.0,"sort":1140,"eventIcon":71221,"issuer":1027504,"target":1027504,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tio-Reeq is wrinkling his nose in displeasure."],"objectives":["Pick bunches of Kholusian sage near the Clave.","Deliver the bunches of Kholusian sage to Tio-Reeq.","Use the sachet of Kholusian sage at the designated location.","Report to Tio-Reeq."],"dialogue":[{"name":"TIOREEQ","text":"Ugh... Oh, my poor, sensitive nose! Do you not smell that awful <span class=\"emphasis\">stench</span>!?"},{"name":"TIOREEQ","text":"What we require here is a strategically placed sachet of ground Kholusian sage. The trouble is, I'm not quite willing to die in the process of obtaining said herb."},{"name":"TIOREEQ","text":"But what of you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>? There is sage aplenty near the Clave should the promise of reward overshadow any fear you might have of stabbing tooth and rending claw. Two generous bunches should suffice!"},{"name":"TIOREEQ","text":"You'll find patches of sage over to the west, near the Clave. Two large handfuls of the herb would be most appreciated!"},{"name":"TIOREEQ","text":"How fared your harvesting efforts?"},{"name":"TIOREEQ","text":"Yes, this is a goodly amount. My thanks! A moment while I prepare an experimental sachet..."},{"name":"TIOREEQ","text":"I'll just grind these up...add a sprinkle of this...a dash of that..."},{"name":"TIOREEQ","text":"And 'tis done!"},{"name":"TIOREEQ","text":"&lt;sniff&gt; Ah, 'tis akin to inhaling a springtime breeze! I must begin producing these fair-scented pouches in bulk!"},{"name":"TIOREEQ","text":"You, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, have the privilege of putting my aromatic creation to the test. Place one of my sachets behind this foul-smelling shack, and inform me of the results!"},{"name":"TIOREEQ","text":"A proper test of my sachets is in order! And the backside of this malodorous lean-to should provide the perfect testing ground!"},{"name":"SYSTEM","text":"The rank fumes permeating the air are slowly replaced by a pleasant, refreshing scent..."},{"name":"TIOREEQ","text":"Did my sachet prove the victor in that contest of fragrances?"},{"name":"TIOREEQ","text":"Well, that is satisfying to hear! I shall continue manufacturing these pockets of sage and proceed with secreting them about the place."},{"name":"TIOREEQ","text":"The thing of it is, the folk of Gatetown often paw through the refuse discarded by the free citizens of Eulmore."},{"name":"TIOREEQ","text":"Such salvaged items have, however, spent no short span of time moldering amongst actual garbage... Thus the offensive odor I have been forced to endure. But no longer!"},{"name":"TIOREEQ","text":"Thanks to you, my olfactory senses will be spared. Pray accept this token for your trouble!"}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68820]}},"partials":[{"type":"npc","id":"1027504","obj":{"i":1027504,"n":"Tio-Reeq","l":2954,"q":1}},{"type":"quest","id":"68820","obj":{"i":68820,"n":"Open Arms, Closed Gate","g":8,"l":"Kholusia","s":60}}]}