{"quest":{"name":"Before the Tide Comes","location":"Kholusia","id":68885,"patch":5.0,"sort":1101,"eventIcon":71221,"issuer":1030742,"target":1030742,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The forlorn fisherman seems lost and broken."],"objectives":["Search Cracked Shell Beach for scattered belongings.","Deliver the belongings to the forlorn fisherman."],"dialogue":[{"name":"FISHERMAN03349","text":"&lt;sigh&gt;"},{"name":"FISHERMAN03349","text":"Oh, that sigh wasn't for you, I was just...thinking about a friend."},{"name":"FISHERMAN03349","text":"The damned fool got tired of the hard life, you see, and tried to sail to the mainland in our little fishing boat. Said he'd come back and fetch me after he'd found his fortune."},{"name":"FISHERMAN03349","text":"...His body washed up on the beach yesterday. I wonder if his last thoughts were for his home or for the shores of the land he never reached...&lt;sniff&gt;"},{"name":"FISHERMAN03349","text":"Actually, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, if you've naught better to do than listen to me sob, I'd appreciate a hand collecting his belongings. They're scattered along the sands, but I don't know that I'll find them all before the waves steal them out to sea."},{"name":"FISHERMAN03349","text":"My friend's belongings were washed up along the beach down there. Please, help me grab them all before they get lost to the waves."},{"name":"FISHERMAN03349","text":"Did you find anything?"},{"name":"FISHERMAN03349","text":"Aye, these are his things, alright."},{"name":"FISHERMAN03349","text":"We made this rod ourselves, me and him... I lost count of the number of times we slipped away to go fishing instead of grubbing about in the fields."},{"name":"FISHERMAN03349","text":"So he should've known better than to try crossing those choppy waters in that tiny boat. I told him─wicked white, how many times I told him─and then the Divide swallowed him up and spat him out. The damned fool..."},{"name":"FISHERMAN03349","text":"I suppose I'd better bury these bits and pieces with him, and then get back to work. Thank you for your kindness, stranger."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68819]}},"partials":[{"type":"npc","id":"1030742","obj":{"i":1030742,"n":"Forlorn Fisherman","l":2954,"q":1}},{"type":"quest","id":"68819","obj":{"i":68819,"n":"A Still Tide","g":8,"l":"Kholusia","s":50}}]}