{"quest":{"name":"A Dirty Trick","location":"The Crystarium","id":68882,"patch":5.0,"sort":40,"eventIcon":71221,"issuer":1027316,"target":1027316,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Szel Guanleu looks at you. And you look at him. And he looks at you. And you look at him. You should probably ask what he wants."],"objectives":["Clean the rookery.","Speak with Szel Guanleu.","Deliver the pungent sack to Astrille.","Deliver the bag of feed vegetables to Szel Guanleu."],"dialogue":[{"name":"SZELGUANLEU","text":"That you have come here, and gaze at me with such bright and eager eyes... It can only mean one thing. You, you <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, are an aspiring breeder!"},{"name":"SZELGUANLEU","text":"No need to be embarrassed! It is perfectly natural to take an interest in the mating habits of livestock. But those secrets are not for the uninitiated, I'm afraid! You will need to start with the basics─and that means cleaning the stables!"},{"name":"SZELGUANLEU","text":"Come now─you cannot balk at getting your hands dirty if you are to be a proper livestock breeder!"},{"name":"SZELGUANLEU","text":"That's the spirit! Now, take this pungent sack! It's for Astrille over in Sweetsieve."},{"name":"SZELGUANLEU","text":"Off you trot!"},{"name":"ASTRILLE","text":"Hello there! Has anyone ever told you that you smell of fertilizer?"},{"name":"ASTRILLE","text":"Ah, that explains that, then. Thank you! Without such rich fertilizer as this, we'd never be able to grow the quantity of vegetables that we do."},{"name":"ASTRILLE","text":"I usually provide Szel Guanleu with produce in return... Would you mind taking it to him?"},{"name":"ASTRILLE","text":"Hopefully the bag isn't too heavy. It's full of root vegetables and the like for the animals, and they do eat quite a bit..."},{"name":"ASTRILLE","text":"I hope you don't feel too put-upon by my asking you to deliver the vegetables for me...though I'd wager that you're mainly relieved it's not more dung."},{"name":"SZELGUANLEU","text":"You're back!?"},{"name":"SZELGUANLEU","text":"And you brought me vegetables! My, you are helplessly industrious, aren't you?"},{"name":"SZELGUANLEU","text":"At this point, I should probably confess that I never actually mistook you for an aspiring breeder. I was joking! But to my complete shock, you did what I asked. So then I thought to myself, surely <span class=\"alternative-container\"><span class=\"alternative\">she'll</span><span class=\"alternative\">he'll</span></span> catch on if I try to hand over a literal sack of shite, but..."},{"name":"SZELGUANLEU","text":"The point is, I got carried away. I apologize. Please, take this as payment for your efforts."}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68817]}},"partials":[{"type":"npc","id":"1027316","obj":{"i":1027316,"n":"Szel Guanleu","l":2951,"q":1}},{"type":"quest","id":"68817","obj":{"i":68817,"n":"Travelers of Norvrandt","g":8,"l":"The Crystarium","s":30}}]}