{"quest":{"name":"A Clam to Die For","location":"Kholusia","id":68887,"patch":5.0,"sort":1120,"eventIcon":71221,"issuer":1030743,"target":1030743,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The strong-willed wife taps her foot in impatience."],"objectives":["Find the hesitant husband.","Dig up an oversized tideclam.","Deliver the oversized tideclam to the hesitant husband.","Report to the strong-willed wife."],"dialogue":[{"name":"VILLAGERWOMAN03351","text":"Of all the useless...<br>You there, have you seen a timid mouse of a man cowerin' in a corner somewhere?"},{"name":"VILLAGERWOMAN03351","text":"I'm talkin' about my husband─clumsy, overcautious clod that he is."},{"name":"VILLAGERWOMAN03351","text":"All I asked was for him to bring some shellfish back for dinner, and he's been gone for bloody hours!"},{"name":"VILLAGERWOMAN03351","text":"I hate to inflict my troubles on a stranger, but if you're headed down to the beach and spot my good-for-nothin' husband, tell him to get a move on with the main course!"},{"name":"VILLAGERWOMAN03351","text":"If you find yourself down on the sands for whatever reason, please keep an eye out for my missin' husband. Just look for the bloke what's shakin' at his own shadow."},{"name":"VILLAGERMAN03351","text":"Wh-Who are you? Wh-What do you want with me?"},{"name":"VILLAGERMAN03351","text":"The wife's wondering where I am? H-Has it been that long...?"},{"name":"VILLAGERMAN03351","text":"&lt;sigh&gt; I tried to dig up one of those tideclams that she likes─a good-sized one, too─but a claw shot out from under the sand and almost clipped my arm off..."},{"name":"VILLAGERMAN03351","text":"Say, you seem the capable sort. Do...do you think you could lend me a hand?"},{"name":"VILLAGERMAN03351","text":"Oh, thank you! You should be able to find the spot I was digging not far from the water. Just watch out for those snippers!"},{"name":"VILLAGERMAN03351","text":"The clam I was trying to get was over there, closer to the water. We'll be feasting well tonight if you can claim it from those ghastly claws!"},{"name":"VILLAGERMAN03351","text":"Y-You're not missing a limb or anything, are you?"},{"name":"VILLAGERMAN03351","text":"Yes, look at the size of this thing! My wife will be well pleased."},{"name":"VILLAGERMAN03351","text":"She'll be mad that I had to ask for your help, but...ah, it'll be worth it when she sees the prize you claimed."},{"name":"VILLAGERMAN03351","text":"In fact, I'm sure she'll want to thank you in person. Come on─let's head back to the village!"},{"name":"VILLAGERWOMAN03351","text":"My apologies, stranger─it seems my husband caused you more trouble than I expected."},{"name":"VILLAGERWOMAN03351","text":"Aye, you're a proper pain in the posterior, you are! Here, take this and drop it off at the Leaky Keel!"},{"name":"VILLAGERWOMAN03351","text":"I hear you slew some shelled monster what came between him and that clam. A good thing, too─if he'd stood his ground, I'd be buryin' whatever parts of him was left."},{"name":"VILLAGERWOMAN03351","text":"Thank you... The man has his faults, but strike me if I don't love him all the same."},{"name":"VILLAGERWOMAN03351","text":"Now, I'd best be makin' somethin' to fill his belly when he comes back. A nice thick clam stew, I reckon!"},{"name":"VILLAGERMAN03351","text":"Th-Thank you again, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I might still be floundering about on the sands if it weren't for you."}],"reward":{"gil":752,"items":[{"num":2,"id":27857}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68819]}},"partials":[{"type":"npc","id":"1030743","obj":{"i":1030743,"n":"Strong-willed Wife","l":2954,"q":1}},{"type":"item","id":"27857","obj":{"i":27857,"n":"Spaghetti al Nero","l":400,"c":24027,"t":46}},{"type":"quest","id":"68819","obj":{"i":68819,"n":"A Still Tide","g":8,"l":"Kholusia","s":50}}]}