{"quest":{"name":"A Drop of Sunshine","location":"Kholusia","id":68895,"patch":5.0,"sort":1201,"eventIcon":71221,"issuer":1030738,"target":1030738,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The bonded servant fidgets with uncertainty."],"objectives":["Speak with the venerable villager.","Harvest stalks of golden barley.","Deliver the stalks of golden barley to the venerable villager.","Deliver the bottle of Wright ale to the bonded servant."],"dialogue":[{"name":"SERVANT03359","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, but you are a fellow visitor here, yes? I wonder if you would be willing to perform for me a trifling service..."},{"name":"SERVANT03359","text":"I serve a particular family of the Eulmoran elite, and it is at the behest of my patron─a man with a discerning taste for fine drink─that I have ventured to the famous breweries of Wright."},{"name":"SERVANT03359","text":"Oh, do you not partake yourself? Otherwise you would surely be aware of Wright's incomparable ale, and its glowing reputation amongst the privileged of Eulmore!"},{"name":"SERVANT03359","text":"In recent years, however, it seems distribution of this golden liquid has ground to a halt, and thus have I been sent to make a purchase directly from the source."},{"name":"SERVANT03359","text":"A simple task, you might think...except the people of Wright are not overly receptive to visitors from Eulmore. Downright dismissive, in fact!"},{"name":"SERVANT03359","text":"Do you understand my dilemma? I need you to speak to the villagers, and procure a supply of ale in my stead─a service for which you will be paid most handsomely!"},{"name":"SERVANT03359","text":"Pray bargain with the villagers on my behalf, and I shall see you rewarded for any ale you acquire."},{"name":"OLDWOMAN03359","text":"Hm? You're wantin' to buy some Wright ale?"},{"name":"OLDWOMAN03359","text":"Well now, we was indeed famous for our ale once, but that age is long past..."},{"name":"OLDWOMAN03359","text":"Any barley we grow these days is bound for the oven or the cookin' pot─there's naught to be spared for brewin' beers and the like."},{"name":"OLDWOMAN03359","text":"You put that young back to work bringin' in the harvest, though, and I might be convinced to part with a bottle from my private stock..."},{"name":"OLDWOMAN03359","text":"Help me harvest the field there, and I'll see what ale I've got left hidin' in the larder."},{"name":"OLDWOMAN03359","text":"You've brought me my barley, then?"},{"name":"OLDWOMAN03359","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. There's fewer hands around to help out ever since the... &lt;cough&gt;"},{"name":"OLDWOMAN03359","text":"It's a good drop, our Wright ale is. Slides down the throat like honeyed sunshine, so they say, and afore you know it you've downed the whole damn bottle."},{"name":"OLDWOMAN03359","text":"Drink it slow and easy, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, or you'll be wakin' up with a sore head come the morrow!"},{"name":"SERVANT03359","text":"Were you successful in your bargaining?"},{"name":"SERVANT03359","text":"I see... That would explain why the trickle of ale into Eulmore has ceased altogether. I shall report this situation to my patron, and see what can be provided in the form of laborers and surplus comestibles."},{"name":"SERVANT03359","text":"In any case, I thank you for securing this precious bottle, kind traveler! Your payment, as promised..."}],"reward":{"gil":752,"items":[{"id":26834}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68821]}},"partials":[{"type":"npc","id":"1030738","obj":{"i":1030738,"n":"Bonded Servant","l":2954,"q":1}},{"type":"item","id":"26834","obj":{"i":26834,"n":"White Oak Ring Coffer (IL 385)","l":1,"c":26567,"t":61}},{"type":"quest","id":"68821","obj":{"i":68821,"n":"A Fickle Existence","g":8,"l":"Kholusia","s":70}}]}