{"quest":{"name":"Songstress of the Sea","location":"Kholusia","id":68891,"patch":5.0,"sort":1160,"eventIcon":71221,"issuer":1030691,"target":1030691,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The aspiring songstress wishes to practice her singing without interruption."],"objectives":["Speak with the aspiring songstress.","Stand watch near the Clave, and defeat any threats that appear.","Speak with the aspiring songstress."],"dialogue":[{"name":"DIVA03355","text":"What have we here? An admirer, come to exult in the purity of my vocal splendor?"},{"name":"DIVA03355","text":"No...? I...well...&lt;sigh&gt;"},{"name":"DIVA03355","text":"Grrr! You would feel <span class=\"emphasis\">honored</span> to meet me if I was ever allowed to test the limits of my instrument!"},{"name":"DIVA03355","text":"One day I shall be the talk of Eulmore─nay, of all Norvrandt─but first I must secure a venue in which to practice."},{"name":"DIVA03355","text":"If I sing at but a fraction of my full volume, the cretins around here become so unreasonably angry! Insulting, even! Thus I have taken to finding a quiet spot near the coast."},{"name":"DIVA03355","text":"Yet even there, my scales and trills seem to drive the wildlife into a frenzy. I can scarce begin my practice before I'm forced to flee from some enraged beast!"},{"name":"DIVA03355","text":"Hmmm, you look to have seen your fair share of fighting. What say you to standing guard and allowing <span class=\"emphasis\">me</span> my fair share of singing?"},{"name":"DIVA03355","text":"Pretty, pretty please...?"},{"name":"DIVA03355","text":"Ah, 'tis so invigorating to sing here─I feel as if my voice rings clear across the sea."},{"name":"DIVA03355","text":"Now, if you would be so kind as to intercept any nuisances before they ruin my practice, I should be most appreciative!"},{"name":"SYSTEM","text":"The sound of singing is almost entirely drowned out by the waves crashing down below..."},{"name":"DIVA03355","text":"Ah, that was simply wonderful! You don't know how long it's been since I was last able to sing to my heart's content!"},{"name":"DIVA03355","text":"And it's all thanks to you!♪<br>Let us return to town so I might show you the proper gratitude!"},{"name":"DIVA03355","text":"Thank you ever so much for your help! I almost wish I could keep you on as an assistant..."},{"name":"DIVA03355","text":"I know I seem to be struggling through a rough patch at the moment, but once I make a name for myself in Eulmore's cabaret show, the privileged will be climbing over each other to offer me patronage!"},{"name":"DIVA03355","text":"And then, when I'm wealthy and famous, you shall have the reward you deserve. For now, however, this is all I can afford... Consider it an advance payment!"}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68820]}},"partials":[{"type":"npc","id":"1030691","obj":{"i":1030691,"n":"Aspiring Songstress","l":2954,"q":1}},{"type":"quest","id":"68820","obj":{"i":68820,"n":"Open Arms, Closed Gate","g":8,"l":"Kholusia","s":60}}]}