{"quest":{"name":"Witch of the Sea","location":"Kholusia","id":68892,"patch":5.0,"sort":1170,"eventIcon":71221,"issuer":1030705,"target":1030705,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The forthright farmer has a mystery to share."],"objectives":["Speak with the forthright farmer.","Investigate the cliffs around the Clave.","Speak with the forthright farmer.","/soothe the forthright farmer.","Speak with the forthright farmer."],"dialogue":[{"name":"SERIOUSMAN03356","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! You seem the well-traveled sort. Would you be willing to accompany me to the Clave in return for a reward?"},{"name":"SERIOUSMAN03356","text":"There's a bit of a problem, see. We take turns manning the watchtowers hereabouts, but the last few folk have been driven away from the lighthouse post by sudden and terrible headaches."},{"name":"SERIOUSMAN03356","text":"Every single one of them remembers hearing some sort of “screeching wail.” We don't know if we're dealing with a sea witch or a roaming banshee, but they all agree the sound is awful enough to chill your blood!"},{"name":"SERIOUSMAN03356","text":"How fortunate for me, then, that I have you to back me up! Pray follow me to the Clave, and we can solve this mystery together..."},{"name":"SERIOUSMAN03356","text":"Hmph, I don't hear anything..."},{"name":"SERIOUSMAN03356","text":"Maybe we should split up and have more of a look around. Once you're satisfied there's naught to find, you can meet me back here at the lighthouse."},{"name":"SYSTEM","text":"You think you hear a faint noise...but maybe you imagined it."},{"name":"SYSTEM","text":"The waters here swell and crash with cacophonous violence, rivaling the stormy seas of La Noscea..."},{"name":"SYSTEM","text":"You hear nothing but the lapping of the waves..."},{"name":"SERIOUSMAN03356","text":"I heard it...that terrible voice! Aaargh! The pain! I can feel my head...splitting in half..."},{"name":"SYSTEM","text":"The farmer seems to be in no state to talk. Perhaps you can <span class=\"highlight\">soothe</span> him with a few calming words..."},{"name":"SERIOUSMAN03356","text":"I... I think I might live, thank you...<br>That keening din seemed to pierce my very skull..."},{"name":"SERIOUSMAN03356","text":"I've never heard the likes of it. If there truly exists a sea witch who murders sailors with her cursed screams, then that is how I imagine her voice would sound."},{"name":"SERIOUSMAN03356","text":"At least now we know which areas are too dangerous to approach. Come, we must return to Wright so I can share this with the others."},{"name":"SYSTEM","text":"The farmer seems to be in no state to talk. Perhaps you can <span class=\"highlight\">soothe</span> him with a few calming words..."},{"name":"SYSTEM","text":"The farmer seems to be in no state to talk. Perhaps you can <span class=\"highlight\">soothe</span> him with a few calming words..."},{"name":"SERIOUSMAN03356","text":"Now that I've had a chance to calm down, I feel a little embarrassed by my earlier behavior. I think stories of sea witches and the like may have fed my panic..."},{"name":"SERIOUSMAN03356","text":"But not everyone puts stock in those old tales, it seems. There was talk of a girl from Gatetown who's taken to visiting the lighthouse to practice her sing─ Wait... You don't think that awful keening could have been...? No, surely not..."},{"name":"SERIOUSMAN03356","text":"Ahaha...hahaha. Ahem. Thank you for standing by me during that terrifying ordeal. And be wary of wailing sea witches should you find yourself near the Clave again!"}],"reward":{"gil":843},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68821]}},"partials":[{"type":"npc","id":"1030705","obj":{"i":1030705,"n":"Forthright Farmer","l":2954,"q":1}},{"type":"quest","id":"68821","obj":{"i":68821,"n":"A Fickle Existence","g":8,"l":"Kholusia","s":70}}]}