{"quest":{"name":"Following the Grain","location":"Kholusia","id":68893,"patch":5.0,"sort":1180,"eventIcon":71221,"issuer":1027306,"target":1027306,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Hastelot is in over his head."],"objectives":["Investigate the trail of scattered grain east of Wright.","Investigate the trail of scattered grain west of the Chisel.","Confront the former Eulmoran soldier and defeat the bandits.","Report to Hastelot."],"dialogue":[{"name":"HASTELOT","text":"I'm sorry, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>...? Please tell me you're a warrior of some kind..."},{"name":"HASTELOT","text":"You see, there's a gang of bandits who've moved into the area. They used to be residents of Eulmore, but were exiled for stealing from free citizens."},{"name":"HASTELOT","text":"Now they've taken to stealing from us instead. And anyone who tries to stand up to them gets a good beating for their trouble..."},{"name":"HASTELOT","text":"Folk say they're former soldiers, and seeing how those bastards fight, I'm inclined to believe them."},{"name":"HASTELOT","text":"We're just farmers here! We need someone who can stand up to them─someone who knows their way around a weapon! Could you be that person for us...?"},{"name":"HASTELOT","text":"You'll teach them a lesson, then!? Oh, thank you!"},{"name":"HASTELOT","text":"We've already hatched a plan to track down their camp─poked a hole in a harvest sack and left it as bait. There's a trail of grain now, leading away from the village to the east, so you might want to start your search there."},{"name":"HASTELOT","text":"Head out to the east and look for the trail of grain─it should lead you right to their camp."},{"name":"SYSTEM","text":"The trail of grain continues to the east..."},{"name":"SYSTEM","text":"The trail of grain takes a sharp turn to the south..."},{"name":"SOLDIER03357","text":"Bah, we've got us a sneaky rat, boys! Better grab it by the tail afore it squeaks to its mates!"},{"name":"HASTELOT","text":"You...took care of them? I can hardly believe it!"},{"name":"HASTELOT","text":"We work long and hard for the food we harvest, and to have it all snatched away by those brutes..."},{"name":"HASTELOT","text":"You'd think with all that training and discipline they'd have an easy time adjusting to an honest life in the field. But I suppose some men are cruel by nature."},{"name":"HASTELOT","text":"At least there are good people like you still around to renew my faith in the world. You have our thanks!"}],"reward":{"gil":916},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68821]}},"partials":[{"type":"npc","id":"1027306","obj":{"i":1027306,"n":"Hastelot","l":2954,"q":1}},{"type":"quest","id":"68821","obj":{"i":68821,"n":"A Fickle Existence","g":8,"l":"Kholusia","s":70}}]}