{"quest":{"name":"Bridge to the Other Side","location":"Kholusia","id":68894,"patch":5.0,"sort":1190,"eventIcon":71221,"issuer":1027428,"target":1027428,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Moa-Mosch has a supernatural story to share."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “Ismella” to challenge the spirit on the bridge.","Report to Moa-Mosch."],"dialogue":[{"name":"MOAMOSCH","text":"Do you want to hear a ghost story? Of course you do..."},{"name":"MOAMOSCH","text":"The old pig farm over yonder once belonged to a family known as the “Greelys.”"},{"name":"MOAMOSCH","text":"It was around, oh, ten winters ago now that their entire sty was butchered by a pack of wild animals. The farm never recovered, and the family scattered to the winds."},{"name":"MOAMOSCH","text":"The Greelys' daughter and her betrothed sought refuge here in Wright, but misfortune's grasp would not surrender them so easily."},{"name":"MOAMOSCH","text":"The lad was slain by Dikaiosyne last year, when the eater attacked our village..."},{"name":"MOAMOSCH","text":"And the lass, mad with grief, threw herself from the bridge that bears her family's name. Drowned right there in the river."},{"name":"MOAMOSCH","text":"Ever since, folk have avoided that spot, convinced that Greely Bridge is haunted by the girl's anguished spirit."},{"name":"MOAMOSCH","text":"You think the tale a tall one? Go to the bridge yourself, then, and call out her name─“Ismella.”"},{"name":"MOAMOSCH","text":"Go on, then. Stand atop Greely Bridge and call the spirit for yourself. “Ismella” was her name..."},{"name":"SAYTODO","text":"Ismella"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing “Ismella” to call forth the spirit said to lurk beneath the bridge."},{"name":"MOAMOSCH","text":"There were <span class=\"emphasis\">two</span> spirits!? Ah, I think I see─the young lady was with child..."},{"name":"MOAMOSCH","text":"...It truly was the ghost of Ismella, then."},{"name":"MOAMOSCH","text":"May their souls be returned to the sea of stars. We can but pray that such tragedy never again visits us in this lifetime..."},{"name":"MOAMOSCH","text":"And pray forgive my frivolous words from before. I had thought only to give you a fright, and instead you gifted those spirits with the peace they deserved. Thank you..."}],"reward":{"gil":770},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68821]}},"partials":[{"type":"npc","id":"1027428","obj":{"i":1027428,"n":"Moa-Mosch","l":2954,"q":1}},{"type":"quest","id":"68821","obj":{"i":68821,"n":"A Fickle Existence","g":8,"l":"Kholusia","s":70}}]}