{"quest":{"name":"Worm Food","location":"Amh Araeng","id":68897,"patch":5.0,"sort":1310,"eventIcon":71221,"issuer":1030500,"target":1030502,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The rumbling of this flea-bitten scavenger's stomach echoes through Mord Souq."],"objectives":["Speak with the flea-bitten scavenger.","Use the all-purpose explosives at the designated location.","Obtain sand wrigglers.","Deliver sand wrigglers to the flea-bitten scavenger.","Speak with the flea-bitten scavenger in Mord Souq."],"dialogue":[{"name":"HIREDMAN03361","text":"A traveler, eh? Nice life, if you can get it."},{"name":"HIREDMAN03361","text":"Me? I'm working for Thil Til. Heartless bastard. Gives me weekly quotas. I meet them, I get paid. If not, I get nothing."},{"name":"HIREDMAN03361","text":"Not much incentive to go above the quota, but just meeting it's got me run ragged."},{"name":"HIREDMAN03361","text":"Still, I'm in no position to complain. Anything beats starving to death. Thing is, I'm down to my last couple of gil, and I won't survive another week if I don't meet the quota."},{"name":"HIREDMAN03361","text":"To make things worse, I've hit a dry spell and there's no chance of making it in time. But if I can distract him with a few sand wrigglers, his favorite snack, he might let me off the hook. Please, help me look for some, I beg you!"},{"name":"HIREDMAN03361","text":"Thank you, friend! I knew you weren't the sort to ignore the pleas of a desperate man. Anyway, we'd best be off. I'll see you outside."},{"name":"HIREDMAN03361","text":"Now, you might be wondering how we can coax the little buggers out of hiding? With explosives, of course! They're supposed to come crawling in droves whenever there's an earthquake, so we'll make one of our own."},{"name":"HIREDMAN03361","text":"I'll head east, so you go south. Let's meet back here once we've caught a few of the slimy sods."},{"name":"HIREDMAN03361","text":"I take it the wrigglers were feeling cooperative?"},{"name":"HIREDMAN03361","text":"How did you find so many? Some people have all the luck..."},{"name":"HIREDMAN03361","text":"Anyway, let's go and see if this is enough to persuade that old curmudgeon."},{"name":"HIREDMAN03361","text":"If all goes well, there might even be something in it for you, too!"},{"name":"THILTIL","text":"What's this? Met the quota, has he?"},{"name":"HIREDMAN03361","text":"I had a bit of a setback, and..."},{"name":"THILTIL","text":"Pitiful! Spare me your excuses. You've failed me for the last time!"},{"name":"HIREDMAN03361","text":"Wait! I brought these for you!"},{"name":"THILTIL","text":"For me? Oh, you're too kind! Heh heh heh... So juicy, so wriggly. Yes, yes. Very nice."},{"name":"THILTIL","text":"I never knew you had such talents... Very well, I'm willing to overlook the quota on this occasion."},{"name":"HIREDMAN03361","text":"Thank you, boss. If that's all, I'll be off."},{"name":"THILTIL","text":"Stop! These sand wrigglers are a lot more...pleasing than the usual junk you bring me. From now on, you are my chief worm collector! Consider it a promotion. Same rates, of course."},{"name":"HIREDMAN03361","text":"Not what I had in mind... Beats being penniless, I suppose. I don't know how I'll fare on my own, but I appreciate you helping me <span class=\"alternative-container\"><span class=\"alternative\">tonight</span><span class=\"alternative\">today</span></span>."}],"reward":{"gil":825},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68828]}},"partials":[{"type":"npc","id":"1030500","obj":{"i":1030500,"n":"Flea-bitten Scavenger","l":2955,"q":1}},{"type":"npc","id":"1030502","obj":{"i":1030502,"n":"Flea-bitten Scavenger","l":2955,"q":1}},{"type":"quest","id":"68828","obj":{"i":68828,"n":"City of the Mord","g":8,"l":"Amh Araeng","s":140}}]}