{"quest":{"name":"A Feeling in the Belly","location":"Kholusia","id":68890,"patch":5.0,"sort":1150,"eventIcon":71221,"issuer":1030614,"target":1030614,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The worried waif looks around in desperation."],"objectives":["Speak with the puissant potion-maker.","Use the copper knife on the trees northwest of Gatetown to gather strips of dried bark.","Deliver the strips of dried bark to the puissant potion-maker.","Deliver the pouch of herbal pellets to the worried waif."],"dialogue":[{"name":"POORGIRKL03354","text":"Please, won't anybody help us...?"},{"name":"POORGIRKL03354","text":"It's my brother─his belly hurts so much, he can't even move. I don't think the “fresh water” we bought was fresh at all..."},{"name":"POORGIRKL03354","text":"Could you talk to the potion-maker for us, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>? I already tried, but when he started explaining the things he wanted for the medicine, I... I got scared and ran away."},{"name":"POORGIRKL03354","text":"The potion-maker needed something to make the medicine, but I've already forgotten what he said..."},{"name":"PHARMACIST03354","text":"Welcome, welcome! What concoctions are you after today, then?"},{"name":"PHARMACIST03354","text":"...Ah, yes, I remember─the young girl and her ailing brother."},{"name":"PHARMACIST03354","text":"I'd used the last of my bark, you see, and all I wanted was for her to gather some from the trees on the cape. The way she ran off, you'd think I'd asked for a bowl of her blood or something..."},{"name":"PHARMACIST03354","text":"You're welcome to collect a few strips in her stead if you like... Although I don't expect you'd want the bother."},{"name":"PHARMACIST03354","text":"...Still here? Very well, then. Find some trees, and use this knife to very carefully peel away three pieces of nice, dry bark. I won't hold my breath."},{"name":"PHARMACIST03354","text":"All I need is three or so nicely dried strips of bark. Make sure you use that copper knife. Very important. Oh, and do bring the knife back, if you please?"},{"name":"PHARMACIST03354","text":"Ah, I see you finally came to your senses. Let's have that knife back, then..."},{"name":"PHARMACIST03354","text":"...What's this?"},{"name":"PHARMACIST03354","text":"You actually went to harvest the bark!? But...what could you possibly hope to gain? Kindness will get you nowhere in this rotten town!"},{"name":"PHARMACIST03354","text":"&lt;sigh&gt; What a rare soul you must be...<br>I suppose I have no choice now but to mix up the cure I promised. "},{"name":"PHARMACIST03354","text":"I've mixed some herbs and powders together with the bark you brought─a few pellets a day should soon settle the aches in the lad's stomach."},{"name":"PHARMACIST03354","text":"Never mind the payment. After all, it's you who's done most of the legwork."},{"name":"PHARMACIST03354","text":"You know, I'd hoped to trade my healing skills for a life in Eulmore, but...maybe my place is here, amongst the poor and the desperate. To help for the sake of helping, to be needed. Aye, it's not a bad feeling..."},{"name":"POORGIRKL03354","text":"Did you go and see the potion-maker...?"},{"name":"POORGIRKL03354","text":"...For my brother!? Oh, thank you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! You've saved his life!"},{"name":"POORGIRKL03354","text":"You'll be wanting coin, right? Uh, I'm not sure we─"},{"name":"POORGIRKL03354","text":"...What do you mean, “nothing”? Here, you must take these at least─I collected them myself! Thank you again!"}],"reward":{"items":[{"id":26834}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68820]}},"partials":[{"type":"npc","id":"1030614","obj":{"i":1030614,"n":"Worried Waif","l":2954,"q":1}},{"type":"item","id":"26834","obj":{"i":26834,"n":"White Oak Ring Coffer (IL 385)","l":1,"c":26567,"t":61}},{"type":"quest","id":"68820","obj":{"i":68820,"n":"Open Arms, Closed Gate","g":8,"l":"Kholusia","s":60}}]}