{"quest":{"name":"Mollycoddled Mord","location":"Amh Araeng","id":68899,"patch":5.0,"sort":1330,"eventIcon":71221,"issuer":1027879,"target":1027865,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ghin Gin's son could use a helping hand, wherever he is."],"objectives":["Scatter wriggler powder at the designated location northeast of Mord Souq.","Scatter wriggler powder at the designated location near the Red Serai.","Deliver Ghin Gin's letter to Thaymoth."],"dialogue":[{"name":"GHINGIN","text":"What's taking him so long?"},{"name":"GHINGIN","text":"Who, you ask? It's my little one. He has gone on his first errand to the Red Serai and I am worried sick about him!"},{"name":"GHINGIN","text":"Anything could have happened! It is hot and dry and there are gigantenders that might try to squish him! I must do what I can to see he arrives safely, but he would be so embarrassed if he knew I had been helping."},{"name":"GHINGIN","text":"Maybe you could do it? Yes, that would work. Do you know the long bridge? Northeast from here, it is."},{"name":"GHINGIN","text":"Take this wriggler powder and scatter it on the big rock on this side of the ravine. And maybe a bit more, further up the road."},{"name":"GHINGIN","text":"Why, you ask? Simple. We Mord use aromas like this to wake us up when we are sleepy or tired. Once my son smells this, he will have no trouble reaching the Red Serai!"},{"name":"GHINGIN","text":"Oh, and could you give this letter to Thaymoth?"},{"name":"GHINGIN","text":"I know it is a lot to ask, but if anything were to happen to my son, I would never forgive myself!"},{"name":"GHINGIN","text":"The powder is made from sand wrigglers, my son's favorite dish. Even the smell puts a spring in his step!"},{"name":"SYSTEM","text":"It seems this is not the ideal place to scatter wriggler powder."},{"name":"GHINGIN","text":"You found the big rock, yes? And scattered the powder? Thank you! Oh, you did not forget to deliver the letter to Thaymoth, did you?"},{"name":"THAYMOTH","text":"What's that? Something for me?"},{"name":"THAYMOTH","text":"From Ghin Gin, eh? Something something...my boy, something something hard worker... Gods, this handwriting is abysmal, but I think I get the gist of it."},{"name":"THAYMOTH","text":"It seems like he's gone out of his way to help his son, though it's probably a bit unnecessary. From what I've seen, he's quite capable of taking care of himself without being mollycoddled."},{"name":"THAYMOTH","text":"Having said that, it's hard not to be moved by this gesture of his. I know that family means a lot to the Mord, more than we give them credit for sometimes. I'll see his son gets fair treatment, don't you worry."},{"name":"THAYMOTH","text":"And it only seems right that you be rewarded for your hard work in maintaining relations between us and the Mord. Here, this is for you."}],"reward":{"gil":679,"items":[{"id":26832}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68828]},"next":[68900]},"partials":[{"type":"npc","id":"1027879","obj":{"i":1027879,"n":"Ghin Gin","l":2955,"q":2}},{"type":"npc","id":"1027865","obj":{"i":1027865,"n":"Thaymoth","l":2955,"q":2}},{"type":"item","id":"26832","obj":{"i":26832,"n":"White Oak Necklace Coffer (IL 385)","l":1,"c":26565,"t":61}},{"type":"quest","id":"68828","obj":{"i":68828,"n":"City of the Mord","g":8,"l":"Amh Araeng","s":140}},{"type":"quest","id":"68900","obj":{"i":68900,"n":"I Felt Your Presents","g":115,"l":"Amh Araeng","s":1340}}]}