{"quest":{"name":"The Cape in Bloom","location":"Kholusia","id":68909,"patch":5.0,"sort":1212,"icon":100851,"unlocksFunction":1,"eventIcon":71341,"issuer":1030766,"target":1030766,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Eueliss appears determined to complete the last of Sai-Lewq's tasks.","Eueliss stands before Sai-Lewq once again, and indicates her willingness to complete his tasks. This time, the old man sends you off to the cape known as “the Split Hull” to gather a bouquet for his beloved wife...<br><br>※Please note that the difficulty of this quest has been synced to your current level.","After arriving at the Split Hull, Eueliss confirms what you already suspected: Sai-Lewq's wife did not survive the eater attack a year ago. She nevertheless bids you seek out the prettiest blooms to offer as a tribute to the deceased.","Careful not to trample the delicate plants, you pick a selection of brightly colored flowers to hand over to Eueliss.","Eueliss accepts your contribution to the bouquet, commending you on your choice of flowers. Now to deliver the blooms to Sai-Lewq back at Stonegazer...","Sai-Lewq accepts the bouquet with a smile, but his joyful expression swiftly crumbles as the reality of his wife's death comes crashing down upon him. He apologizes for his cruelly insensitive requests, and explains how despair had driven him to embrace a destructive fantasy. Eueliss, however, soon forgives him, understanding his pain only too well. Wordlessly, you watch over them, giving the two a moment to gather themselves for the hard decisions which lie ahead..."],"objectives":["Speak with Eueliss.","Pick beautiful blooms for a bouquet.","Hand the beautiful blooms to Eueliss.","Speak with Eueliss."],"dialogue":[{"name":"EUELISS","text":"Thank you again for staying─I honestly could not do this without you..."},{"name":"EUELISS","text":"Sai-Lewq, sir, were there any more tasks you had for us?"},{"name":"SAILEWQ","text":"Just one last thing... I want you to gather some pretty flowers from the Split Hull as a gift for my darling wife."},{"name":"SAILEWQ","text":"She went out for her usual walk, but has not yet deigned to come home. I fear I may have said something to sour her mood..."},{"name":"EUELISS","text":"I...understand. We shall gather a lovely bouquet for her then."},{"name":"EUELISS","text":"Well, <span class=\"highlight\">Forename</span>. Will you accompany me to the cape for some flower picking?"},{"name":"SAILEWQ","text":"If only... If only I had... &lt;sniff&gt;"},{"name":"EUELISS","text":"This is almost pleasant, isn't it? Aside from the aggressive wildlife, of course."},{"name":"EUELISS","text":"...I should tell you about Sai-Lewq's wife. She was killed in the eater incident, although I imagine you already suspected as much."},{"name":"EUELISS","text":"They made such a sweet couple. Every day they would walk up this cape, hand in hand, and she would gaze out over the flowers with this warm, contented smile..."},{"name":"EUELISS","text":"Sai-Lewq himself has some training as a warrior. He would guard her as if she were a princess, and he her gallant knight... &lt;sob&gt; I'm sorry, it's just... &lt;sniff&gt;"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Wounds of the heart are slow to mend."},{"name":"A1","text":"Is Sai-Lewq fit to serve as mayor?"},{"name":"EUELISS","text":"That they are. And simply having someone there to share the grief can be enough to carry us through another day..."},{"name":"EUELISS","text":"There are none who care for Wright and its people more than he. The villagers and I are certain that Sai-Lewq will rise to the occasion─he just needs a little more time..."},{"name":"EUELISS","text":"It has been but a year, and we are all still suffering. Some seek to bury the misery beneath cheery faces, and others are yet trapped in the memories of the past. Sai-Lewq, I fear, is one of the latter."},{"name":"EUELISS","text":"But if a bouquet of flowers is what it takes to help him work through his sadness, then I would pick every bloom from this cape."},{"name":"EUELISS","text":"...Will you give me a hand to find some of the prettier flowers? Pray think of it as a tribute to the deceased."},{"name":"EUELISS","text":"Choose the ones with the brightest petals─those are the kind she loved best, I think..."},{"name":"EUELISS","text":"Let's see what we have..."},{"name":"EUELISS","text":"Yes, these are beautiful, thank you! Sai-Lewq will be pleased."},{"name":"EUELISS","text":"Let's take them back to Stonegazer before they get crushed in some scuffle."},{"name":"EUELISS","text":"We made it, and the flowers are none the worse for wear!"},{"name":"EUELISS","text":"Sai-Lewq. <span class=\"highlight\">Forename</span> and I have returned with the bouquet for your wife."},{"name":"SAILEWQ","text":"Ah, splendid, thank you... Now perhaps she will come... &lt;sniff&gt;"},{"name":"SAILEWQ","text":"She will come back to... &lt;sob&gt;"},{"name":"EUELISS","text":"Sir..."},{"name":"SAILEWQ","text":"Eueliss, forgive me. I have asked such cruel things of you."},{"name":"SAILEWQ","text":"And I must apologize to you as well, <span class=\"highlight\">Forename</span>."},{"name":"SAILEWQ","text":"My beloved wife, my dear neighbors, so many gone... After it happened, despair became my only company."},{"name":"SAILEWQ","text":"I could not even save my closest friend when his torment was plain for all to see. I could never forgive myself..."},{"name":"SAILEWQ","text":"So I embraced this delusion, thinking that maybe if I tried hard enough─if I truly <span class=\"emphasis\">believed</span> they were still alive─that the events of that day would fade away like the nightmare it was. But I succeeded only in hurting those around me..."},{"name":"EUELISS","text":"I understand why you did what you did, sir, truly I do..."},{"name":"SAILEWQ","text":"You always were such a sweet child. I will place the flowers you brought on her grave─she would have loved them."},{"name":"SAILEWQ","text":"As for me assuming the role of mayor... I am sorry, but I cannot give you a decision just yet."},{"name":"EUELISS","text":"Take as long as you need. In fact, I might need a little time to recover myself."},{"name":"EUELISS","text":"<span class=\"highlight\">Forename</span>, if you could give me a moment or two...?"},{"name":"SAILEWQ","text":"If I could but start that day over..."}],"reward":{"gil":788},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68908]},"next":[68910]},"partials":[{"type":"npc","id":"1030766","obj":{"i":1030766,"n":"Eueliss","l":2954,"q":4}},{"type":"quest","id":"68908","obj":{"i":68908,"n":"Talos, Interrupted","g":114,"l":"Kholusia","s":1211,"f":1}},{"type":"quest","id":"68910","obj":{"i":68910,"n":"Wright for the Job","g":114,"l":"Kholusia","s":1213,"f":1}}]}