{"quest":{"name":"I Felt Your Presents","location":"Amh Araeng","id":68900,"patch":5.0,"sort":1340,"eventIcon":71221,"issuer":1027865,"target":1027879,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Thaymoth gazes wistfully into the distance, his thoughts malms away."],"objectives":["Speak with Lorotte.","Speak with Thaymoth.","Deliver Thaymoth's letter to Ghin Gin."],"dialogue":[{"name":"THAYMOTH","text":"That Ghin Gin worries about his son more than is healthy. For either of them. But perhaps I'm not so different. I had to leave my daughter behind in the Crystarium while I oversee trade with Mord Souq, and I've not been back for some time."},{"name":"THAYMOTH","text":"I'd like to send her a gift, to let her know we haven't forgotten about her. Only thing is, I've no idea what young women are interested in these days. I'd ask the others, but I don't want them to think I'm doting on her."},{"name":"THAYMOTH","text":"I was wondering if you could find out for me? Lorotte over there has a daughter about the same age as mine. I expect she'll know what would make for a decent present."},{"name":"THAYMOTH","text":"Of course, something that's not too big or expensive would be ideal."},{"name":"LOROTTE","text":"A gift for a young lady? Let me guess, Thaymoth sent you to ask me, didn't he?"},{"name":"LOROTTE","text":"We all know how much he misses that girl of his. He tries to put on a brave face, but deep down, he's a big softie."},{"name":"LOROTTE","text":"Anyway, in answer to your question, the Mord make the most beautiful jewelry from precious stones and valuable relics excavated here in Amh Araeng."},{"name":"LOROTTE","text":"I'll bet you don't see many of those around the Crystarium. How about something like that?"},{"name":"LOROTTE","text":"Come to think of it, I wouldn't mind something like that myself."},{"name":"THAYMOTH","text":"Mord jewelry? I'll admit, that never would've occurred to me, but it's a fine choice. From what I recall, Ghin Gin deals in wares like that."},{"name":"THAYMOTH","text":"If I write a letter to him, would you be so kind as to deliver it to Mord Souq? I'll leave the particulars to him, since I don't know the first thing about gems and whatnot."},{"name":"THAYMOTH","text":"Oh, and by the way, you don't suppose Lorotte cottoned on, do you?"},{"name":"THAYMOTH","text":"Bloody hells, nothing gets past her! I might as well ask her myself next time, but I appreciate your help."},{"name":"THAYMOTH","text":"That Ghin Gin certainly is a strange one, but I daresay he knows a lot more about jewelry than I do. I'll leave the design and so on in his capable hands."},{"name":"GHINGIN","text":"Oh, welcome back! I take it everything went well with Thaymoth?"},{"name":"GHINGIN","text":"A letter, hmm? &lt;mumble&gt; ...jewelry...daughter...Crystarium... &lt;mumble&gt; I see! Yes, I know just the thing!"},{"name":"GHINGIN","text":"The scavengers have found some nice necklaces we can use. Old, but shiny! I'll have it ready in a jiffy, then my son can take care of the delivery."},{"name":"GHINGIN","text":"Before I forget, please accept this as payment for all of your hard work. You have certainly earned it!"}],"reward":{"gil":779},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68899]}},"partials":[{"type":"npc","id":"1027865","obj":{"i":1027865,"n":"Thaymoth","l":2955,"q":2}},{"type":"npc","id":"1027879","obj":{"i":1027879,"n":"Ghin Gin","l":2955,"q":2}},{"type":"quest","id":"68899","obj":{"i":68899,"n":"Mollycoddled Mord","g":115,"l":"Amh Araeng","s":1330}}]}