{"quest":{"name":"Succulent Secretions","location":"Amh Araeng","id":68903,"patch":5.0,"sort":1370,"eventIcon":71221,"issuer":1027908,"target":1027908,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Lamon has a job to do, and he's hoping you will do it for him."],"objectives":["Use the brass siphon on the giant succulent.","Deliver the sweet-smelling succulent secretions to Lamon."],"dialogue":[{"name":"LAMON","text":"Looking for work, by any chance?"},{"name":"LAMON","text":"I'm supposed to be draining water out of plants with these siphons, but I could use some help."},{"name":"LAMON","text":"As you've probably noticed, the whole area is lousy with all sorts of hostile creatures, which means this is not a job for the faint of heart."},{"name":"LAMON","text":"I'd be fine if siphoning the water didn't take so long. While I'm waiting, I'm easy prey. If you could go in my place, I'll see that you're properly rewarded."},{"name":"LAMON","text":"You need eyes in the back of your head to do this job. Seems like you know how to handle yourself, though."},{"name":"LAMON","text":"Finished already?"},{"name":"LAMON","text":"Very impressive! Are you sure you haven't done this before?"},{"name":"LAMON","text":"Now, you might be wondering why we'd go through the effort of siphoning from plants. There are easier ways to get water, after all. Well, this stuff has a certain sweetness that comes in handy when making medicines."},{"name":"LAMON","text":"They tend to taste quite bitter, so this takes the edge off. Not that it makes the treatments any more effective, but the patients certainly seem to appreciate it. You have our thanks."}],"reward":{"gil":606,"items":[{"num":2,"id":27855}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68832]}},"partials":[{"type":"npc","id":"1027908","obj":{"i":1027908,"n":"Lamon","l":2955,"q":1}},{"type":"item","id":"27855","obj":{"i":27855,"n":"Caramels","l":395,"c":24089,"t":46,"p":3406}},{"type":"quest","id":"68832","obj":{"i":68832,"n":"Culling Their Ranks","g":8,"l":"Amh Araeng","s":180}}]}