{"quest":{"name":"Like a Tonze of Bricks","location":"Amh Araeng","id":68906,"patch":5.0,"sort":1401,"eventIcon":71221,"issuer":1027911,"target":1027911,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Willfort has the expression of a man awaiting imminent disaster."],"objectives":["Search for the belated porter.","Carry the sack of unspecified wares to the expectant Mord merchant.","Speak with Willfort."],"dialogue":[{"name":"WILLFORT","text":"Excuse me, but I was wondering if you could help?"},{"name":"WILLFORT","text":"One of the merchants from Mord Souq is on his way, bringing much-needed supplies. The problem is, the wares we are offering in exchange have yet to arrive."},{"name":"WILLFORT","text":"If it were anyone else, they could be persuaded to wait, but this particular Mord has a reputation for being extremely impatient. He has even been known to call off deals over the smallest of quibbles!"},{"name":"WILLFORT","text":"I'd be grateful if you could find out what's caused this delay. While you search for the porter, I'll try to buy some time."},{"name":"WILLFORT","text":"Many thanks. The delivery is expected to come from the southwest. Godsspeed."},{"name":"WILLFORT","text":"That merchant will be here any moment now. I wonder if I could interest him in a cup of tea?"},{"name":"GUARD03370","text":"&lt;wheeze&gt; &lt;splutter&gt; Ah, sorry, didn't see you there. Is there something you want?"},{"name":"GUARD03370","text":"&lt;wheeze&gt; Willfort sent you? Bloody hells, am I that far behind schedule?"},{"name":"GUARD03370","text":"Anyway, these sacks contain our half of the deal. Well, maybe a bit more than that. I got carried away and brought too much to carry by myself. It's a miracle I made it this far."},{"name":"GUARD03370","text":"Do you think you could help me cover the last stretch of the journey? Not far to go now. And these things are heavy, so watch your back. Remember─bend at the knees!"},{"name":"SYSTEM","text":"Transport the sack to the expectant Mord merchant in the Inn at Journey's Head within the allotted time."},{"name":"SYSTEM","text":"You will have sixty seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"WILLFORT","text":"Any luck? Please, you have to find him! I'm at my limit here..."},{"name":"MERCHANT03370","text":"No goods, no deal!"},{"name":"GUARD03370","text":"What do you mean, you've “misplaced” it!? It's a good thing I brought a lot more than we'd originally agreed, or we'd be in big trouble!"},{"name":"MERCHANT03370","text":"Late, late, late! If your friend did not pour such delicious tea, I would have taken my wares back to Mord Souq! Next time, you won't be so lucky! Hmph!"},{"name":"WILLFORT","text":"That was a near thing, if ever I saw one. I dread to think what we'd do without these supplies."},{"name":"WILLFORT","text":"Although I must say, I didn't expect that you would end up carrying the goods here yourself. That sack was full of adobe bricks, you know."},{"name":"WILLFORT","text":"Considering that they're only made from clay mixed with water and straw, they last an incredibly long time. Even those excavated from the ruins are still perfectly adequate for building work."},{"name":"WILLFORT","text":"In fact, the Mord plan to use them in repairing their windmills. Still, bricks are bricks, far from the easiest things to carry over long distances. Perhaps next time we'll send more than one person to transport them."},{"name":"WILLFORT","text":"Now that I think about it, this whole thing was very poorly planned. We're lucky we had you to help us on this occasion. Hopefully, it won't happen again."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68832]}},"partials":[{"type":"npc","id":"1027911","obj":{"i":1027911,"n":"Willfort","l":2955,"q":1}},{"type":"quest","id":"68832","obj":{"i":68832,"n":"Culling Their Ranks","g":8,"l":"Amh Araeng","s":180}}]}