{"quest":{"name":"Absent without Leave","location":"Amh Araeng","id":68905,"patch":5.0,"sort":1390,"eventIcon":71221,"issuer":1027938,"target":1027938,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Wrenric has more than his share of concerns, the morale of his men chief among them."],"objectives":["Speak with the timid guard.","Speak with the nonchalant watchman.","Search for the Galdjent guard.","Speak with the timid guard.","Report to Wrenric."],"dialogue":[{"name":"WRENRIC","text":"Psst! Do you have a moment?"},{"name":"WRENRIC","text":"Please keep this to yourself, but one of my men has been acting strangely of late."},{"name":"WRENRIC","text":"As I am sure you can appreciate, there are certain things that the guards here, myself included, may not wish to discuss openly. I had hoped that you, as an outsider, may be able to find out what is troubling him."},{"name":"WRENRIC","text":"He is currently stationed a short distance south from here. If you could lend him your ear, I would be most grateful."},{"name":"WRENRIC","text":"I will not pretend that our life here is a happy one. We must grasp what scant joy we can."},{"name":"GUARDA03369","text":"What brings you all the way out here?"},{"name":"GUARDA03369","text":"So, you've been talking to Wrenric. Well, if you must know, I was thinking about leaving this place."},{"name":"GUARDA03369","text":"It was all getting too much for me, and I felt like I was losing my mind one day at a time. Me and one of the others were planning on making a clean break, putting the Inn behind us."},{"name":"GUARDA03369","text":"But after seeing you and Alisaie, I changed my mind. I'm staying here, at least for the time being."},{"name":"GUARDA03369","text":"Could you give a message to my friend? He's the one I was going to run away with, a Galdjent chap. I'm not sure exactly where he'll be, but the watchman southeast of the Inn should know."},{"name":"GUARDA03369","text":"Tell him that I'm staying. I'd go myself, but I can't abandon my post. Please, I've got to let him know."},{"name":"GUARDA03369","text":"I can't stand the thought of leaving him there to wait for me. At least if he knows I'm not going, he can make up his own mind about whether to stay or go."},{"name":"GUARDB03369","text":"Galdjent bloke on patrol? You've just missed him, I'm afraid."},{"name":"GUARDB03369","text":"Said he wanted a breath of fresh air, so he went for a stroll. I tried tellin' him the air's no fresher up there than it is here, but would he listen? Would he bollocks! Anyway, last I saw, he was headin' north."},{"name":"GUARDB03369","text":"Any luck? Knowin' him, he probably went and strolled right over the side of a cliff or summink."},{"name":"GUARDC03369","text":"I remember you... One of Alisaie's friends..."},{"name":"GUARDC03369","text":"Staying? I thought so... That's why I left...by myself. Reckoned I'd get a bit further...before being attacked by...beasts, though. Just my...bloody luck."},{"name":"GUARDC03369","text":"Can you tell him...I went alone, that I got away? Wouldn't want him to...blame himself."},{"name":"GUARDC03369","text":"It's my own fault...he was set on staying...but I talked him into...leaving. I should've listened..."},{"name":"SYSTEM","text":"There's no response. It's just a corpse."},{"name":"GUARDA03369","text":"So, did you give him the message?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He left Amh Araeng by himself."},{"name":"A1","text":"He's gone."},{"name":"GUARDA03369","text":"Well, I'm glad he didn't stay on my account. I wouldn't want to hold him back from finding a new life elsewhere."},{"name":"GUARDA03369","text":"When you say it like that, it sounds almost as if─ Oh... I see."},{"name":"GUARDA03369","text":"Still, I stand by my decision. It is the right thing to do, I know it."},{"name":"GUARDA03369","text":"Come to think of it, Wrenric is probably wondering what's going on. If it's not too much to ask, would you mind speaking with him?"},{"name":"WRENRIC","text":"Is that so? Hmm... It is better than both of them being killed. We should be thankful for small mercies. In any case, I appreciate what you have done for us."}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68832]}},"partials":[{"type":"npc","id":"1027938","obj":{"i":1027938,"n":"Wrenric","l":2955,"q":1}},{"type":"quest","id":"68832","obj":{"i":68832,"n":"Culling Their Ranks","g":8,"l":"Amh Araeng","s":180}}]}