{"quest":{"name":"From Darts till Dawn","location":"Amh Araeng","id":68904,"patch":5.0,"sort":1380,"eventIcon":71221,"issuer":1030650,"target":1030650,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The bleary-eyed guard appears to be suffering from a lack of sleep."],"objectives":["Speak with the bleary-eyed guard.","Use the blowgun to shoot ghilman from the designated location.","Speak with the bleary-eyed guard."],"dialogue":[{"name":"GUARD03368","text":"You're one of Alisaie's friends, aren't you? I hear you lot have a knack for putting down troublesome beasts."},{"name":"GUARD03368","text":"I'm not sure if that includes the supernatural, but walking corses known as ghilman have been running amok outside of the south entrance. They grab anyone who wanders too close, and drag them under the sand."},{"name":"GUARD03368","text":"I almost fell victim to them myself, and I was lucky to escape. Thing is, I dropped my mother's pendant as I fled, and I'll do anything to get it back. She was a patient here, you see, and it's all I have to remember her by."},{"name":"GUARD03368","text":"Luckily, we've found that enchanted darts shot from a blowgun send the ghilman back to whichever hell they crawled from."},{"name":"GUARD03368","text":"My plan is to rush in and grab the pendant, while you shoot those undead bastards from a distance. So, will you help me?"},{"name":"GUARD03368","text":"I knew you would! Come on, let's get this over with."},{"name":"GUARD03368","text":"I'm fairly certain I dropped the pendant by those ruins over there. As soon as I've found it, I'll race back to the inn. In the meantime, I'll need you to keep the ghilman off my back. Here goes nothing!"},{"name":"SYSTEM","text":"If any ghilman appear, shoot them with the enchanted darts. You may move the camera, as well as zoom in and out. Target the ghilman and use the blowgun with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"GUARD03368","text":"Ha ha! They didn't like that very much, did they? And best of all, I got the pendant!"},{"name":"GUARD03368","text":"Do you know, I've never seen such fine aim with a blowgun. The secret, though, lies in the darts. They were excavated from the ruins of Nabaath Areng."},{"name":"GUARD03368","text":"According to the historians, these same darts were used by the Nabaath to destroy ghilman all those years ago. There were whole stockpiles of the things, in fact."},{"name":"GUARD03368","text":"Anyway, that's enough about ancient history for one day. More importantly, I'd like to thank you for all you've done! Please accept this as thanks and give Alisaie my regards."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68832]}},"partials":[{"type":"npc","id":"1030650","obj":{"i":1030650,"n":"Bleary-eyed Guard","l":2955,"q":1}},{"type":"quest","id":"68832","obj":{"i":68832,"n":"Culling Their Ranks","g":8,"l":"Amh Araeng","s":180}}]}