{"quest":{"name":"A Shiver Down the Spine","location":"Amh Araeng","id":68901,"patch":5.0,"sort":1350,"eventIcon":71221,"issuer":1030503,"target":1030503,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A rather skittish Mord is at his wit's end and might be glad of a helping hand."],"objectives":["Defeat the wild beasts at Samiel's Backbone.","Aid the Mord.","Report to the skittish Mord."],"dialogue":[{"name":"MORDPANIC03365","text":"You there! Kind traveler, strong traveler! The younglings are in danger!"},{"name":"MORDPANIC03365","text":"Big, scary creatures! They looked hungry, too!"},{"name":"MORDPANIC03365","text":"Please, you must hurry to Samiel's Backbone, east from here! Quickly, there is no time!"},{"name":"MORDPANIC03365","text":"You do not know Samiel's Backbone!? Just go east, then!"},{"name":"MORDFRIGHTENED03365","text":"Do not eat me! Mord fur very hard to swallow, I hear! Tickle your belly, it will!"},{"name":"MORDFEAR03365","text":"Great samiel, we are truly sorry!"},{"name":"MORDFRIGHTENED03365","text":"We are...not dead? Oh, you saved us, that is why! A thousand thousand thank-yous!"},{"name":"MORDFEAR03365","text":"I never thought I would be so happy to not be dead! Many thanks, stranger!"},{"name":"MORDFRIGHTENED03365","text":"I have never been eaten alive before, but I do not imagine it is very pleasant."},{"name":"MORDFEAR03365","text":"If you had not rescued us, we would be in the belly of a beast, and probably not in one piece, either."},{"name":"MORDPANIC03365","text":"You did it! These two have a lot to answer for, though."},{"name":"MORDPANIC03365","text":"You see, those bones once belonged to a mighty samiel, whose ghost still roams the plains! A lot of silly younglings go there to prove their bravery. But there are things much more dangerous than wandering spirits, oh yes!"},{"name":"MORDFRIGHTENED03365","text":"I <span class=\"emphasis\">wish</span> it was a ghost we had met instead of those horrible brutes! We will not be going back there any time soon!"},{"name":"MORDFEAR03365","text":"Speak for yourself! I was hoping to meet the great samiel, so I want to try it again. And I will not have the others calling me a coward for running away!"},{"name":"MORDPANIC03365","text":"To tell the truth, I did exactly the same thing when I was their age. It is something of a tradition!"},{"name":"MORDPANIC03365","text":"This is one of the ways we learn to fear and respect the desert, but also how we find the courage to face its many dangers. Though on this occasion, I think we would be two younglings short of a village were it not for you! Mord Souq thanks you, traveler!"}],"reward":{"gil":679},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68828]}},"partials":[{"type":"npc","id":"1030503","obj":{"i":1030503,"n":"Skittish Mord","l":2955,"q":1}},{"type":"quest","id":"68828","obj":{"i":68828,"n":"City of the Mord","g":8,"l":"Amh Araeng","s":140}}]}