{"quest":{"name":"Village of Woe","location":"Kholusia","id":68907,"patch":5.0,"sort":1210,"icon":100851,"unlocksFunction":1,"eventIcon":71341,"issuer":1030763,"target":1030766,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Eueliss appears to have been awaiting your arrival.","Recognizing you as Alphinaud's traveling companion, Eueliss requests that you provide her an escort to the nearby Stonegazer. Find her on the path north of the village, and be prepared to fend off any aggressive wildlife.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You have dispatched the threat on the path to Stonegazer. It seems, however, that Eueliss could use a hand getting to her feet...","Eueliss recovers quickly and continues on her way. At this pace, you will soon arrive at Stonegazer.","Once at Stonegazer, Eueliss addresses a man by the name of Sai-Lewq, who appears to be a close friend of her father. It seems she would surrender to him the role of mayor, but Sai-Lewq refuses to consider the proposal unless Eueliss completes for him a number of tasks. The first of these tasks─the acquisition of a sickle─takes you back to the village of Wright...","Returned to the village once more, Eueliss soon comes into possession of the requested sickle. The suddenly tense exchange between her and a villager, however, leads her to explain more of the incident which befell the people of Wright the year before─a tragedy which culminated in her father taking his own life. A determined Eueliss nevertheless bids you accompany her back to Stonegazer and Sai-Lewq.","Eueliss hands the sickle to her father's friend, but is obviously distressed by Sai-Lewq's stubborn refusal of reality. She thanks you again for the escort, and your continued presence at her side."],"objectives":["Head north of Wright and slay any monsters that threaten Eueliss.","Aid Eueliss.","Speak with Eueliss."],"dialogue":[{"name":"EUELISS","text":"Excuse me, but you're the <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gentleman</span></span> Alphinaud was traveling with, aren't you? I'm sorry, I didn't quite catch your name..."},{"name":"EUELISS","text":"Ah, <span class=\"highlight\">Forename</span>, how lovely to meet you! My name is Eueliss, and I'm the acting village mayor. I was hoping someone of your talents would pass through Wright before long..."},{"name":"EUELISS","text":"The thing is, I need to visit someone up at Stonegazer, but I'm afraid to walk the path alone. Do you think you could provide an escort?"},{"name":"EUELISS","text":"My thanks. I just couldn't bring myself to ask one of the villagers..."},{"name":"EUELISS","text":"You see, there was an incident a while back where a veteran band of hunters was badly mauled."},{"name":"EUELISS","text":"Simply mentioning that it's unsafe to wander outside the village these days would be enough to bring back memories of that grisly scene─which is why it's been so difficult to even bring up the subject."},{"name":"EUELISS","text":"But such does not change the fact that the roads are indeed dangerous. Pray meet me on the path to the north, and be prepared to fend off the wildlife."},{"name":"EUELISS","text":"What did I tell you! I was barely ten steps out of the village... Come, let us hurry along before more predators have a chance to gather!"},{"name":"EUELISS","text":"Thank you for the escort, <span class=\"highlight\">Forename</span>. This is the gentleman I wished to speak with, so we needn't go any further."},{"name":"EUELISS","text":"Sai-Lewq..."},{"name":"EUELISS","text":"Are you wandering around by yourself out here? You <span class=\"emphasis\">know</span> what kind of creatures lurk beyond the borders of the village..."},{"name":"SAILEWQ","text":"...Ah, well if it isn't Cliftol's little girl. Something I can do for you, lass?"},{"name":"EUELISS","text":"Yes, sir. I came for an answer to my proposal from the other day. Have you given any thought to taking over as village mayor?"},{"name":"EUELISS","text":"I'm doing the best I can in the interim, but I have neither the age nor the wisdom to continue in the role. And the rest of the villagers agree with me."},{"name":"SAILEWQ","text":"...I'm fairly sure I told you “nay” once already."},{"name":"SAILEWQ","text":"But seeing as you found a guard just so you could come and talk to me, then mayhap I will consider the idea...in exchange for a few small tasks."},{"name":"EUELISS","text":"You will!? Please, just tell me what I need to do!"},{"name":"SAILEWQ","text":"My friend, Cliftol─your dear father─was looking for a sickle to cut some rope. Would you mind skipping back to the village and borrowing one for me?"},{"name":"EUELISS","text":"Why would you─?"},{"name":"EUELISS","text":"&lt;cough&gt; I mean, a sickle, was it? For cutting rope. That shouldn't be too difficult."},{"name":"EUELISS","text":"I had only meant to ask you along for the one trip, but if I'm to complete these tasks... Would you be willing to indulge me a while longer?"},{"name":"SAILEWQ","text":"&lt;sigh&gt;"},{"name":"VILLAGER03371","text":"Good day to you, young Eueliss! ...You look a little flustered, dear. Was there something I could help you with?"},{"name":"EUELISS","text":"And a good day to you, madam. I was actually hoping to borrow a sickle..."},{"name":"VILLAGER03371","text":"Is that all? Here, you can take this one!"},{"name":"VILLAGER03371","text":"I've several spares, so there's no rush in returning it. Doing a spot of harvesting, are you?"},{"name":"EUELISS","text":"My thanks. But it's not for me, exactly─I was asked to bring one for my father..."},{"name":"VILLAGER03371","text":"...Your father!? Shadows save me!!!"},{"name":"EUELISS","text":"Forgive me. If you're to accompany me in these tasks, then you deserve to know the whole story."},{"name":"EUELISS","text":"...It was my father, Cliftol, who was the former mayor of Wright."},{"name":"EUELISS","text":"And the “incident” I spoke of earlier was something that happened a year ago. One day, a stray sin eater came prowling around and slaughtered nearly half the village. It was a waking nightmare..."},{"name":"EUELISS","text":"Some of the villagers blamed my father─they said it was because he refused to accept the protection of Eulmore."},{"name":"EUELISS","text":"The sheer scale of the tragedy and the accusations that followed wore away at his conscience, until finally, he could bear the guilt no longer..."},{"name":"EUELISS","text":"He hanged himself."},{"name":"EUELISS","text":"Sai-Lewq, the old man we spoke to, was his closest friend. But considering how he worded his request, it seems he's reluctant to accept the fact of my father's death."},{"name":"EUELISS","text":"Still, I would see this task to its end. Let us bring him his sickle, shall we?"},{"name":"VILLAGER03371","text":"Something I can do for you, dear?"},{"name":"EUELISS","text":"Sai-Lewq, sir, we've brought the sickle you asked for."},{"name":"SAILEWQ","text":"Oho! Good, good! Old Cliftol will be glad to see this!"},{"name":"EUELISS","text":"Oh, sir..."},{"name":"EUELISS","text":"Thank you for staying with me, <span class=\"highlight\">Forename</span>. This might be harder than I expected..."},{"name":"SAILEWQ","text":"...Did you bring it?"}],"reward":{"gil":861,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68821]},"next":[68908]},"partials":[{"type":"npc","id":"1030763","obj":{"i":1030763,"n":"Eueliss","l":2954,"q":1}},{"type":"npc","id":"1030766","obj":{"i":1030766,"n":"Eueliss","l":2954,"q":4}},{"type":"quest","id":"68821","obj":{"i":68821,"n":"A Fickle Existence","g":8,"l":"Kholusia","s":70}},{"type":"quest","id":"68908","obj":{"i":68908,"n":"Talos, Interrupted","g":114,"l":"Kholusia","s":1211,"f":1}}]}