{"quest":{"name":"Do You Believe in Magic","location":"The Crystarium","id":68915,"patch":5.0,"sort":2001,"eventIcon":71221,"issuer":1031104,"target":1031104,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The distraught damsel has found herself dispossessed of a treasured keepsake."],"objectives":["Search for the polished horn necklace near the Northern Staging Point.","Deliver the polished horn necklace to the distraught damsel in the Crystarium."],"dialogue":[{"name":"HOLMINSTER03379","text":"Oh, stranger, please, you must help me!"},{"name":"HOLMINSTER03379","text":"I fled here from Holminster Switch, but I lost my necklace along the way. I noticed it was missing as I passed the Church of the First Light, but I couldn't go back...and now the guard tells me that Lakeland is too dangerous for me to go and search for it."},{"name":"HOLMINSTER03379","text":"I know I should be glad that I escaped with my life─and I <span class=\"emphasis\">am</span>, but that necklace was a gift from my father, and it's all that I have to remember him by. If you can travel freely, then please─bring it back to me."},{"name":"HOLMINSTER03379","text":"It must have been somewhere between Holminster Switch and the Church of the First Light that I dropped it. I know I was wearing it when I began to run..."},{"name":"HOLMINSTER03379","text":"I hardly dare hope, but..."},{"name":"HOLMINSTER03379","text":"You did find it! Oh, thank you!"},{"name":"HOLMINSTER03379","text":"I've worn this since I was a child─ever since my father first made it for me. The horn he carved for it was magic, he said, and would protect me when I roamed the hills."},{"name":"HOLMINSTER03379","text":"I had thought myself much too old to believe in such things, but nevertheless─when the eaters came for me, I begged it to keep me safe one last time."},{"name":"HOLMINSTER03379","text":"Just then, a young elven woman appeared, brandishing a glowing blade. She cut quite the dashing figure as she fought to protect me─like a prince from a faerie tale. And when she stood over the vanquished eaters, she smiled at me, and said, “You're safe.”"},{"name":"HOLMINSTER03379","text":"I knew then that the necklace had answered my prayers, for that could not have been anything but magic."},{"name":"HOLMINSTER03379","text":"As long as I have it, I know that I will be all right."}],"reward":{"gil":906},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68837]}},"partials":[{"type":"npc","id":"1031104","obj":{"i":1031104,"n":"Distraught Damsel","l":2951,"q":1}},{"type":"quest","id":"68837","obj":{"i":68837,"n":"Warrior of Darkness","g":8,"l":"Lakeland","s":230}}]}