{"quest":{"name":"Mord of the Ring","location":"Amh Araeng","id":68912,"patch":5.0,"sort":1411,"icon":100852,"eventIcon":71221,"issuer":1030391,"target":1030398,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ghun Gun is thrilled by the signet ring you have discovered.","Ghun Gun is positively ecstatic at your discovery of an ancient signet ring beneath the rubble, and is eager to learn its true value. He suggests seeking the advice of someone well versed in such antiquities, and races back to Mord Souq.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Ghun Gun points you in the direction of one of his father's associates. Although it is unclear whether he possesses any experience in the field of evaluating unearthed relics, your companion has every confidence that he can provide the information you seek.","Unfortunately, the merchant is unable to reveal much, other than the fact that the signet ring originates from Nabaath Areng. Given the history of the area, this comes as little surprise. The most useful piece of information you can glean from him is that there is another trader to the south who may be able to shed a touch more light on the matter.","You show the signet ring to the dealer in antiquities, who points out that this was no mere piece of jewelry, but one used by somebody wealthy to seal letters and so forth. Though he lacks the knowledge of ancient sigils required to identify its former owner, he recommends that you consult a man named Jamial, who is apparently the most reliable source of information regarding such artifacts.","You hand the ring to Jamial for inspection, who can scarcely believe his eyes. He reveals that it bears the sigil of a malik, the equivalent of a king in Nabaath Areng. Although the signet is priceless to an expert such as Jamial, he regretfully informs you that only a historian can tell it apart from those used by countless nobles and affluent individuals. Not to be disheartened, Ghun Gun instead views this as a favorable outcome to the day's events, with the satisfaction of a job well done being all the reward he needs."],"objectives":["Speak with Ghun Gun.","Speak with the scrupulous trader.","Speak with the antiquities dealer.","Speak with Jamial."],"dialogue":[{"name":"GHUNGUN","text":"Such a pretty ring! Almost too precious to sell. Almost."},{"name":"GHUNGUN","text":"We will ask a friend of my father's how much it is worth. He is a good man, we can trust him! Well, as much as we can trust anyone that my father would call a friend..."},{"name":"GHUNGUN","text":"Anyway, let us meet in Mord Souq. Once we are done, we can discuss your reward!"},{"name":"GHUNGUN","text":"Heh heh! Only thing sweeter than a hand full of shinies is a purse full of jinglies!"},{"name":"GHUNGUN","text":"Very close, he is! This way!"},{"name":"GHUNGUN","text":"He knows much about old things, ancient things! More than me, anyway..."},{"name":"MERCHANTA03376","text":"What have you got for me <span class=\"alternative-container\"><span class=\"alternative\">tonight</span><span class=\"alternative\">today</span></span>?"},{"name":"GHUNGUN","text":"I am not sure, but it is a very lovely shiny! Here, take a look!"},{"name":"MERCHANTA03376","text":"Let me see... My word, this is exquisite!"},{"name":"MERCHANTA03376","text":"Judging by the sigil, I'd say this originates from Nabaath Areng. You'll need to find an expert in that period to ascertain its true value, though."},{"name":"GHUNGUN","text":"You mean you do not know!?"},{"name":"MERCHANTA03376","text":"Sorry, Ghun Gun. But the chap with a cart near the south gate might be able to help. White hair, smells of cabbage."},{"name":"GHUNGUN","text":"Then we shall ask him. Thank you for your kind advice!"},{"name":"GHUNGUN","text":"Smells like cabbage, eh? He should be easy to find in that case!"},{"name":"MERCHANTA03376","text":"I'm afraid the most I can tell you is that it's from old Nabaath Areng. Beyond that, your guess is as good as mine."},{"name":"GHUNGUN","text":"We have found him! Let us see what he thinks of the ring!"},{"name":"MERCHANTB03376","text":"May I help you?"},{"name":"GHUNGUN","text":"Please, tell us what this old ring is worth!"},{"name":"MERCHANTB03376","text":"Ho ho, I have not seen one of these in a very long time."},{"name":"GHUNGUN","text":"Well, what is it?"},{"name":"MERCHANTB03376","text":"This is no simple ring. See that sigil? Used to seal letters, it was. The owner must have been someone quite important. But you'd best speak with Jamial if you want to know who it belonged to. If you want to know about crests and such, he's the one to ask."},{"name":"GHUNGUN","text":"Gah! Not again! I just want my jinglies!"},{"name":"GHUNGUN","text":"Hopefully Jamial will be the last one we have to ask."},{"name":"MERCHANTB03376","text":"Jamial knows a lot more about the great houses of Nabaath Areng than I do."},{"name":"GHUNGUN","text":"Jamial is quite well known around Mord Souq, you know. He has been here for a very long time!"},{"name":"JAMIAL","text":"Now, what could you two spry younglings need from an old man like me?"},{"name":"GHUNGUN","text":"We want to know how much we can get for this signet ring. Please tell us─the suspense is killing me!"},{"name":"JAMIAL","text":"Where did you get this!? It belonged to a malik of Nabaath Areng!"},{"name":"GHUNGUN","text":"Oh, that sounds very valuable indeed! So...how much?"},{"name":"JAMIAL","text":"To a historian, it is priceless. In all likelihood, there is only one such ring in existence."},{"name":"JAMIAL","text":"Though, I am afraid that to the layman unversed in ancient sigils, it is worth no more than any other signet of a similar age. Anyone in Nabaath Areng with even a modicum of wealth would have had one bearing their mark."},{"name":"GHUNGUN","text":"So...it is priceless but also not worth very much? I am confused."},{"name":"GHUNGUN","text":"It looks like we will not be rolling in riches after all... I am very sorry to have dragged you around Mord Souq for nothing!"},{"name":"GHUNGUN","text":"But as we always say, “No such thing as a thing no one needs!” and “Hard work is its own reward!” Something like that, anyway."},{"name":"GHUNGUN","text":"While your coinpurse may be no heavier than before, you have learned an important lesson! At least, I think so..."}],"reward":{"gil":888},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68911]},"next":[68913]},"partials":[{"type":"npc","id":"1030391","obj":{"i":1030391,"n":"Ghun Gun","l":2955,"q":2}},{"type":"npc","id":"1030398","obj":{"i":1030398,"n":"Jamial","l":2955,"q":1}},{"type":"quest","id":"68911","obj":{"i":68911,"n":"Work to Live or Live to Work","g":115,"l":"Amh Araeng","s":1410,"f":1}},{"type":"quest","id":"68913","obj":{"i":68913,"n":"Nabaath Breakdown","g":115,"l":"Amh Araeng","s":1412}}]}