{"quest":{"name":"Nabaath Breakdown","location":"Amh Araeng","id":68913,"patch":5.0,"sort":1412,"icon":100852,"eventIcon":71221,"issuer":1030397,"target":1030404,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ghun Gun is finally ready to obey his father's orders to take a well-earned rest.","Ghun Gun's idea of a rest appears to involve listening intently to Jamial propose an expedition in search of buried treasure. The aged historian believes that a trail of discarded relics left behind when the Nabaath fled the Flood of Light is waiting to be discovered, and asks you and Ghun Gun to help him with its excavation. Satisfied that standing still for a few moments constitutes rest and recuperation, your Mord companion springs into action, practically salivating at the chance to go digging for more priceless artifacts.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Jamial leads you to a stretch of desert near the Inn at Journey's Head, where Ghun Gun immediately throws himself into the search for buried relics. While you set about the task at hand, Jamial, far too old for such demanding physical exertion, watches on.","Your search reveals a large shield of some description, although it is hard to see what lies below layer upon layer of grime. Ghun Gun, however, is accustomed to removing this sort of caked-on dirt with little more than his hands, so you take it to him to have it cleaned for inspection.","The artifact you have unearthed is a heraldic shield which, according to Jamial, represents the great houses of Nabaath Areng. He also explains that the Mord were an intrinsic part of the nation's rise to greatness, much to the surprise of Ghun Gun. Jamial then sets his sights on the next location, between an enormous section of ruined wall and a decidedly precarious precipice.","Upon arrival, Jamial directs you and Ghun Gun to a large pile of debris that seems to have crumbled away from the nearby ruins. Once again, you set to work, hoping to find remnants of the Nabaath's past.","Your search bears fruit, although exactly what kind of fruit, you cannot be sure. You wisely choose to leave the delicate task of brushing away the encrusted soil to Ghun Gun, who is still busy sifting through the rubble.","Ghun Gun takes great delight in explaining that the relic is in fact an example of traditional Mord craftsmanship, though the small statue seems to be little more than a round ball of clay with holes bored into it. Jamial posits that it once took pride of place in the Pristine Palace of Amh Malik as a symbol of the friendship between the Nabaath and the Mord. Although there is still one more site that he would like to investigate, Jamial takes this opportunity to offer his gratitude for your sterling work thus far."],"objectives":["Speak with Jamial.","Search for buried artifacts at the designated location.","Deliver the dirt-encrusted shield to Ghun Gun.","Speak with Jamial.","Search for buried artifacts at the designated location.","Deliver the sand-caked statue to Ghun Gun."],"dialogue":[{"name":"JAMIAL","text":"Perhaps this would be a good opportunity..."},{"name":"GHUNGUN","text":"Now that business with the ring is over, I should rest, as I said I would. Then your promise to my father will be fulfilled!"},{"name":"JAMIAL","text":"Actually, there is something I should like to discuss with you. I am in no rush, however, so let us speak again after your repose."},{"name":"GHUNGUN","text":"Ah! My curiosity! It is piqued! Please, you must tell me now! I can rest while I listen."},{"name":"JAMIAL","text":"Oh... Well, if you insist."},{"name":"JAMIAL","text":"I would like you to help me search for more relics from Nabaath Areng. If my suppositions are correct, I know where many such artifacts are waiting to be uncovered."},{"name":"JAMIAL","text":"I base this claim on my knowledge of the route chosen by the malik when he led his people's exodus from the Flood of Light."},{"name":"JAMIAL","text":"Although many tried to take their most prized possessions with them, it soon became apparent that such burdens would only hinder their escape. Each household discarded their personal treasures, one piece at a time."},{"name":"JAMIAL","text":"By following the exact path traveled from Nabaath Areng, we would be able to unearth many more priceless treasures. What say you? Will you lend me your aid?"},{"name":"GHUNGUN","text":"Of course! And now that I have finished resting, I am ready to start digging!"},{"name":"JAMIAL","text":"You are quite sure?"},{"name":"GHUNGUN","text":"I am! <span class=\"highlight\">Forename</span>, you should come too! You have already found one of these shinies. Maybe you can find some more!"},{"name":"JAMIAL","text":"You will be amply remunerated for your efforts even if there are no profits to be made from the sale of the items themselves. I too am a proponent of the motto “Honest pay for honest work.”"},{"name":"GHUNGUN","text":"We should go before my father tries to stop me! Honestly, there is no such thing as working too hard! Oh, wait... Where are we going?"},{"name":"JAMIAL","text":"The first location is to the east of the Inn at Journey's Head. Allow me to lead the way!"},{"name":"GHUNGUN","text":"It does not smell of treasure here. Maybe I am not sniffing hard enough?"},{"name":"JAMIAL","text":"As I recall, there should be a few artifacts scattered around this area."},{"name":"JAMIAL","text":"The first items to be discarded were those of little value or simply too cumbersome to be carried over long distances. However, we can assume that many were buried so that they could be recovered later."},{"name":"JAMIAL","text":"Therefore, it seems logical that landmarks such as large outcrops and so forth would be used to indicate their position."},{"name":"GHUNGUN","text":"Less talking, more digging! I want to find the shinies!"},{"name":"JAMIAL","text":"As much as I would like to assist in the search, I am afraid that these old bones of mine make bending and kneeling quite a struggle."},{"name":"JAMIAL","text":"Have you found something? Perhaps you could get Ghun Gun to clean off some of the dirt. Mord hands are perfectly suited to that sort of delicate work."},{"name":"GHUNGUN","text":"Mmm... Lots of lovely shinies over here! What have you got?"},{"name":"GHUNGUN","text":"Oh, a great big shiny! Is this...a dinner plate?"},{"name":"GHUNGUN","text":"Jamial, what is this?"},{"name":"JAMIAL","text":"A heraldic shield. The five coins above a castle represent each of the great houses of Nabaath Areng."},{"name":"GHUNGUN","text":"Coins? Is that because they were rich?"},{"name":"JAMIAL","text":"Precisely. The capital attracted trade from across Norvrandt, and much of the wealth found its way into their coffers."},{"name":"JAMIAL","text":"Such a booming economy was not built overnight, however. Although Nabaath Areng was largely established by Humes, the harsh desert environment meant that they had to rely on the aid of neighboring peoples."},{"name":"JAMIAL","text":"It was the Mord who taught them how to safely traverse the barren plains, methods for finding sustenance, and much besides. They were also respected partners in matters of commerce. The Nabaath owed a great deal to your ancestors, Ghun Gun."},{"name":"GHUNGUN","text":"I...never knew."},{"name":"JAMIAL","text":"History is all around us, if we know where to look. Which reminds me, the next location I would like to search is not far from here. This way, if you please."},{"name":"GHUNGUN","text":"Do you think there will be more shinies?"},{"name":"JAMIAL","text":"I have reason to believe that more artifacts are resting beneath these ruins. Please take the utmost care with any that you discover, as some may be fragile."},{"name":"JAMIAL","text":"Should you find any remnants of the past, I would be very glad to see them, no matter how inconsequential they may seem."},{"name":"JAMIAL","text":"Excellent work! Once Ghun Gun has cleaned off the excess grime, we can verify whether this relic has any historical importance."},{"name":"GHUNGUN","text":"Nothing but bricks and sand. Have you had better luck?"},{"name":"GHUNGUN","text":"I know what this is! A decorative Mord's head sculpture! Making these is one of our many traditions!"},{"name":"GHUNGUN","text":"But what is it doing here?"},{"name":"JAMIAL","text":"We may surmise that it was once kept in the Pristine Palace of Amh Malik. It once housed tokens of friendship from allied peoples. That the malik brought such gifts so far from Nabaath Areng is proof of their cultural significance."},{"name":"JAMIAL","text":"However, when the Nabaath and the Mord first came into contact, there were many disagreements."},{"name":"GHUNGUN","text":"Hmm? I do not understand. We Mord hate arguing! The art of negotiation is another one of our many traditions!"},{"name":"JAMIAL","text":"Yes, I daresay that was a decisive factor in these disparate peoples finding common ground. And yet the Mord live on while the Nabaath are no more."},{"name":"JAMIAL","text":"Hopefully, we will uncover yet more valuable insights to the past at our final excavation site. And may I say, your work thus far has been nothing short of exemplary."},{"name":"GHUNGUN","text":"Please, save your thanks for when we have finished!"},{"name":"GHUNGUN","text":"There is much still to be done, more treasures to be found!"}],"reward":{"gil":1017},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68912]},"next":[68914]},"partials":[{"type":"npc","id":"1030397","obj":{"i":1030397,"n":"Ghun Gun","l":2955,"q":1}},{"type":"npc","id":"1030404","obj":{"i":1030404,"n":"Ghun Gun","l":2955,"q":2}},{"type":"quest","id":"68912","obj":{"i":68912,"n":"Mord of the Ring","g":115,"l":"Amh Araeng","s":1411}},{"type":"quest","id":"68914","obj":{"i":68914,"n":"Semi Auto-malik","g":115,"l":"Amh Araeng","s":1413}}]}