{"quest":{"name":"Desperate Measures","location":"Lakeland","id":68919,"patch":5.0,"sort":2040,"eventIcon":71221,"issuer":1028279,"target":1027842,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Bjorn requires your assistance in teaching new recruits to the Crystarium guard a vital lesson."],"objectives":["Slay a violet triffid and acquire a sap-rich cutting.","Deliver the sap-rich cutting to Dawkes at the Crystarium."],"dialogue":[{"name":"BJORN","text":"An honor to speak with you, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>! Your deeds at Holminster Switch continue to be an inspiration to us all, and a great many of our new recruits are eager to follow your example."},{"name":"BJORN","text":"Unfortunately, as things stand, few of them have the strength and skill necessary to do so. They don't like to hear it, of course─would rather run off to prove themselves against stray eaters than follow our training regimens."},{"name":"BJORN","text":"Frankly, they're liable to get themselves killed at this rate. I don't suppose you'd be interested in demonstrating just how far they have to go before they reach your level?"},{"name":"BJORN","text":"Very well! I can't ask you to fight them hand-to-hand, obviously─they aren't even close to ready for that. But perhaps you might show them the ease with which you accomplish the tasks that they find so burdensome."},{"name":"BJORN","text":"Collecting triffid sap in the Forest of the Lost Shepherd, for instance. It always takes at least three of them to slay one of the creatures, and then they spend an age getting the cutting to Dawkes at the Crystarium. I'd love to tell them just how quickly you manage the same."},{"name":"BJORN","text":"You'll want to slay a violet triffid─just one! A trifle for anyone who's put the time into training properly, I'm sure you agree."},{"name":"DAWKES","text":"You're the one with the triffid sap, then? Bjorn sent word ahead that you'd be coming─I got the message mere moments ago, in fact."},{"name":"DAWKES","text":"And such a fine cutting, too! I should be able to get quite a large volume of sap from this. I'll make sure to mention just how much more efficient you were, next time I see the recruits."},{"name":"DAWKES","text":"That may sound a bit cruel─but to hear Bjorn tell it, they will be in serious danger if they don't begin taking their training more seriously. Let's hope that this shocks some sense into them."}],"reward":{"gil":606,"items":[{"num":2,"id":27856}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68917,68918]}},"partials":[{"type":"npc","id":"1028279","obj":{"i":1028279,"n":"Bjorn","l":2953,"q":1}},{"type":"npc","id":"1027842","obj":{"i":1027842,"n":"Dawkes","l":2951,"q":1}},{"type":"item","id":"27856","obj":{"i":27856,"n":"Broad Bean Soup","l":395,"c":24101,"t":46,"p":3406}},{"type":"quest","id":"68917","obj":{"i":68917,"n":"Stock and Barrel","g":113,"l":"Lakeland","s":2020}},{"type":"quest","id":"68918","obj":{"i":68918,"n":"Classical Condition","g":113,"l":"Lakeland","s":2030}}]}