{"quest":{"name":"Stock and Barrel","location":"Lakeland","id":68917,"patch":5.0,"sort":2020,"eventIcon":71221,"issuer":1031145,"target":1031145,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The guard quartermaster seems a bit overwhelmed."],"objectives":["Speak with the guard quartermaster.","Search for usable supplies at the Northern Staging Point.","Deliver the knobbly cane to the guard quartermaster.","Speak with the guard quartermaster."],"dialogue":[{"name":"SUPPLYOFFICER03881","text":"I hate to be abrupt, but─can you help me?"},{"name":"SUPPLYOFFICER03881","text":"Thank y─ Oh goodness, it's you! The one who turned the tide at Holminster Switch! Well, I feel doubly bad about this now, but I have little choice. I need any help that I can get."},{"name":"SUPPLYOFFICER03881","text":"Thanks to the eaters, everything not in ruins is in disarray, and I'm working to determine what materiel we have, but that requires sifting through it all! And if I don't know what we <span class=\"emphasis\">need</span> it will be fruitless, as I won't be able to order, and─"},{"name":"SUPPLYOFFICER03881","text":"Ahem. In short, I need you to meet me at the Northern Staging Point. Please."},{"name":"SUPPLYOFFICER03881","text":"We'll be assessing the situation out here. Though it may save time if you were to first tell me what destruction you personally witnessed?"},{"name":"SUPPLYOFFICER03881","text":"Many structures burned or otherwise damaged in the fighting... Yes, I thought as much. I may look into procuring tents so that the laborers come to assist in the reconstruction need not journey back and forth each day─that ought to save time."},{"name":"SUPPLYOFFICER03881","text":"I'd be curious to know whether anything out here actually has survived. Might I ask you to survey the northern area and tell me if you find any materiel or other supplies that might still be fit for use?"},{"name":"SUPPLYOFFICER03881","text":"Thank you. Please meet me here when you've finished."},{"name":"SYSTEM","text":"You pick up the cane, and see that it has been weathered by what must have been many years of use."},{"name":"SYSTEM","text":"You peer into the crate to find that it, fortuitously, contains several undamaged tents."},{"name":"SYSTEM","text":"You examine the rack, and notice that many of the weapons that remain are, as yet, undamaged."},{"name":"SUPPLYOFFICER03881","text":"Finished your inspection, have you? What did you find?"},{"name":"SUPPLYOFFICER03881","text":"Oh, shepherds around here use this sort of cane. It must belong to one of the residents. Or former residents, now, I suppose..."},{"name":"SUPPLYOFFICER03881","text":"We can return it to them, though I imagine they'd rather have their land and livestock back. What else was there?"},{"name":"SUPPLYOFFICER03881","text":"Good to hear that I shouldn't need to procure any fresh tents. The weapons are less immediately useful, though I will of course have them collected. It seems that I'll primarily need to order tools, as there were none to be found in the areas I checked, either."},{"name":"SUPPLYOFFICER03881","text":"I very much appreciate your help─this has gone much more swiftly for your presence. Would you accept a small reward? I have a bit of coin stored for just such an occasion back at the fort."},{"name":"SUPPLYOFFICER03881","text":"And now the real work begins. Fighting off the sin eaters was no small feat, but the task of rebuilding seems almost more daunting."},{"name":"SUPPLYOFFICER03881","text":"Nothing for it but to grit our teeth and get to it, however. For the sake of everyone in Lakeland."}],"reward":{"gil":706},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68916]},"next":[68919]},"partials":[{"type":"npc","id":"1031145","obj":{"i":1031145,"n":"Guard Quartermaster","l":2953,"q":1}},{"type":"quest","id":"68916","obj":{"i":68916,"n":"A Jobb Well Done","g":111,"l":"The Crystarium","s":2010,"f":1}},{"type":"quest","id":"68919","obj":{"i":68919,"n":"Desperate Measures","g":113,"l":"Lakeland","s":2040}}]}