{"quest":{"name":"Wright for the Job","location":"Kholusia","id":68910,"patch":5.0,"sort":1213,"icon":100851,"unlocksFunction":1,"eventIcon":71341,"issuer":1030766,"target":1030774,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Eueliss awaits a decision from Sai-Lewq.","After thanking you again for your patience, Eueliss prompts Sai-Lewq for a decision regarding the role of mayor. The old man then shares the reason behind his lingering reluctance: he believes that his hesitation in ringing the warning bell caused many to die needlessly to the marauding sin eater. Hearing you speak of vengeance, however, appears to provide some relief to his all-consuming guilt. It seems he is ready to return to the village.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You rejoin Eueliss in Wright, and she explains that there is something more she would show you and Sai-Lewq. As your last errand for Eueliss, you are to find the old man and bid him accompany you to the barley fields.","You inform Sai-Lewq of Eueliss's wishes, then set out to the aforementioned meeting place at the front of the village.","You approach Eueliss in the fields, and she proudly presents the crop of barley she has been tending in her late father's absence. She speaks of his dream to revive the village─of the swaying stalks of barley to one day be used to brew a barrel of traditional Wright ale. Moved by her determination, Sai-Lewq at last decides to take up the mantle of mayor, and work alongside Eueliss to restore Wright to some semblance of its former prosperity. Eueliss watches as the old man leaves, then her gaze settles upon you...","Eueliss thanks you once more for your unfailing cooperation. Although the people of Wright must live with the sorrows of the past, she is nevertheless resolved to see her village forge a happier path for the future."],"objectives":["Speak with Eueliss.","Speak with Sai-Lewq.","Speak with Eueliss."],"dialogue":[{"name":"EUELISS","text":"Thank you for your patience, <span class=\"highlight\">Forename</span>. Sai-Lewq still appears to be wrestling with his thoughts, but perhaps we can help him come to a decision."},{"name":"EUELISS","text":"Sir, I don't mean to press you, but might you have arrived at an answer to my proposal?"},{"name":"SAILEWQ","text":"Ah, not exactly, no. There is another matter I have yet to reconcile..."},{"name":"EUELISS","text":"Would you mind sharing this matter with us?"},{"name":"SAILEWQ","text":"...Well, it goes back to the day that the eater attacked the village. I was taking my turn as lookout here at Stonegazer..."},{"name":"EUELISS","text":"It's a duty we take very seriously. They say when the tower was originally built, in the time before the Flood, they were worried about dwarves and mountain bandits, but these days..."},{"name":"SAILEWQ","text":"Yes, there is far worse prowling around. And I failed to spot it."},{"name":"SAILEWQ","text":"The sin eater which came that day did not appear as the other monstrosities I have seen..."},{"name":"SAILEWQ","text":"From a distance, it simply looked like a person. I wanted to be sure before I rang the warning bell, but I waited too long─many who could have fled died because of my hesitation."},{"name":"SAILEWQ","text":"How could a man of such faulty judgment ever serve you as mayor? What comfort can I offer those whose loved ones were needlessly slain? None! Not whilst the abomination itself yet roams free to kill again!"},{"name":"SAILEWQ","text":"You...you and Granson killed it!? You slew Dikaiosyne!?"},{"name":"SAILEWQ","text":"Then vengeance has been done. I thank you... Wright thanks you..."},{"name":"EUELISS","text":"I-I can scarce believe it! You've avenged the souls of our people─of my father─and here I've been dragging you across the countryside like a common guardsman..."},{"name":"SAILEWQ","text":"...You would take vengeance on our behalf? That is good, for we were powerless before its might. Should the eater show its cursed face again, then I pray you are as strong as you appear."},{"name":"EUELISS","text":"I know nothing of the roads you have walked or the battles you have fought, so I can but echo what Sai-Lewq has said. Our prayers will be for your victory."},{"name":"EUELISS","text":"Well, sir, you've heard <span class=\"highlight\">Forename</span>'s words. Talk of vengeance aside, I do not believe the villagers, either living or dead, hold you responsible for the actions of that monster."},{"name":"EUELISS","text":"And yet I cannot fault you for wanting to remain distant. Pray forgive me for pestering you so..."},{"name":"SAILEWQ","text":"Nay, 'tis I who should beg forgiveness. Though you've lost as much as anyone, I left you to shoulder the burden of leadership alone."},{"name":"EUELISS","text":"All will be well with you back among us again. Come, let us return to the village─as I've said, it's unsafe to linger out here for long!"},{"name":"EUELISS","text":"<span class=\"highlight\">Forename</span>. One last escort back to Wright, if you would?"},{"name":"SAILEWQ","text":"I am grateful for your understanding...and the flowers you brought. My wife would have very much approved of the selection."},{"name":"EUELISS","text":"My thanks for your protection, <span class=\"highlight\">Forename</span>, not to mention your unfailing patience."},{"name":"EUELISS","text":"It is my hope that now Sai-Lewq has unburdened his mind to us, his heart will be that tiniest bit lighter."},{"name":"EUELISS","text":"I, for one, feel ready to face another day. After all, I have my friends and neighbors here to help me face it."},{"name":"EUELISS","text":"Ah, there was one last thing I wanted to show both you and Sai-Lewq..."},{"name":"EUELISS","text":"It has to do with Wright's traditional industry, if you were interested in taking a look?"},{"name":"EUELISS","text":"Oh, good! I was worried you'd had enough of me!"},{"name":"EUELISS","text":"My last errand for you, then, will be to have a word with Sai-Lewq, and bring him to the barley fields at the front of the village."},{"name":"EUELISS","text":"I'll be there tending to the crops until you arrive!"},{"name":"SAILEWQ","text":"What is my place now in all this...?"},{"name":"SAILEWQ","text":"Ah, <span class=\"highlight\">Forename</span>. I am grateful for your understanding...and the flowers you brought. My wife would have very much approved of the selection."},{"name":"SAILEWQ","text":"Now, was there something you wished to discuss with me?"},{"name":"SAILEWQ","text":"...And Eueliss wants me there as well, does she? We had best head over to the fields, then."},{"name":"EUELISS","text":"This is what I wanted to show you. This barley crop right here!"},{"name":"SAILEWQ","text":"This...this was your father's plot, wasn't it? And you've been tending to it in his absence?"},{"name":"EUELISS","text":"Every single day. I wanted to see his plans come true."},{"name":"SAILEWQ","text":"His plans...?"},{"name":"EUELISS","text":"Yes, he dreamed of restoring things to how the history books said they once were─before the Flood ruined everything."},{"name":"EUELISS","text":"Our village has long been known as a place of artisans. Even the name, “Wright,” is a nod to all the craftsmen that once made their home here."},{"name":"EUELISS","text":"In years gone by, it's said a line of Talos would stretch down the road, arms bearing lumber, and the shipyard would echo with the calls of shipwrights hard at work. And when the day was done, they would gather here to share an ale in the village."},{"name":"EUELISS","text":"My father, he... He'd hoped to brew that traditional Wright ale with the barley from this crop─to one day tap a barrel with his family and dear friends, and raise a toast...&lt;sob&gt;...to the future..."},{"name":"SAILEWQ","text":"......"},{"name":"EUELISS","text":"Sai-Lewq, <span class=\"highlight\">Forename</span>..."},{"name":"EUELISS","text":"Will you raise a mug with me when that day comes?"},{"name":"SAILEWQ","text":"Of course I will..."},{"name":"SAILEWQ","text":"Ah, but my dear girl, the land here does not nourish the crops as it once did. I fear it will be some time ere you'll have barley fit for the ale you have in mind."},{"name":"SAILEWQ","text":"In the meantime, will you help me with the rest of Cliftol's plans?"},{"name":"EUELISS","text":"The rest...?"},{"name":"SAILEWQ","text":"He wanted things the way they once were, did he not? Then we must first recover from the tragedy which was visited upon us."},{"name":"SAILEWQ","text":"There is no simple solution, but I mean to do what I can to lead our community out of this mire of pain and grief..."},{"name":"SAILEWQ","text":"...Assuming you are still willing to have me as mayor?"},{"name":"EUELISS","text":"Yes! Of course, sir, thank you!"},{"name":"SAILEWQ","text":"I was set to live out the rest of my life in denial, but you and Eueliss have opened the eyes of this old fool to what needs to be done."},{"name":"SAILEWQ","text":"And for that, you have my thanks."},{"name":"SAILEWQ","text":"Now, I had best get to work! I have folk to talk to and plans to make. When you're finished here, Eueliss, I should appreciate your assistance."},{"name":"SAILEWQ","text":"How long has it been since I've set foot in these fields..."},{"name":"EUELISS","text":"Well, <span class=\"highlight\">Forename</span>, I think this is where we finally part ways. Thank you again for all you have done for us."},{"name":"EUELISS","text":"The people of Wright <span class=\"emphasis\">will</span> go on, even under the weight of our sorrow."},{"name":"EUELISS","text":"It might not happen this day or the next, but together we'll find ways to make things better─to recapture the prosperity this village once had."},{"name":"EUELISS","text":"I look forward to when you next visit. With any luck, I'll be waiting to put a frothing mug of Wright-brewed ale in your hand!"}],"reward":{"gil":788,"items":[{"num":2,"id":27853,"one":1},{"num":2,"id":27854,"one":1},{"num":2,"id":27855,"one":1},{"num":2,"id":27856,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68909]},"next":[69096]},"partials":[{"type":"npc","id":"1030766","obj":{"i":1030766,"n":"Eueliss","l":2954,"q":4}},{"type":"npc","id":"1030774","obj":{"i":1030774,"n":"Eueliss","l":2954,"q":1}},{"type":"item","id":"27853","obj":{"i":27853,"n":"Grilled Rail","l":390,"c":24352,"t":46,"p":3359}},{"type":"item","id":"27854","obj":{"i":27854,"n":"Purple Carrot Juice","l":390,"c":24416,"t":46,"p":3359}},{"type":"item","id":"27855","obj":{"i":27855,"n":"Caramels","l":395,"c":24089,"t":46,"p":3406}},{"type":"item","id":"27856","obj":{"i":27856,"n":"Broad Bean Soup","l":395,"c":24101,"t":46,"p":3406}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68909","obj":{"i":68909,"n":"The Cape in Bloom","g":114,"l":"Kholusia","s":1212,"f":1}},{"type":"quest","id":"69096","obj":{"i":69096,"n":"Ronitt to the Rescue","g":114,"l":"Kholusia","s":8270,"f":1}}]}