{"quest":{"name":"A Jobb Well Done","location":"The Crystarium","id":68916,"patch":5.0,"sort":2010,"unlocksFunction":1,"eventIcon":71341,"issuer":1027948,"target":1028280,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Heggie is looking for someone willing to make a delivery to Fort Jobb."],"objectives":["Deliver the lovingly wrapped parcel to Chathwick at Fort Jobb.","Distribute homemade meals to the guard.","Speak with Chathwick."],"dialogue":[{"name":"HEGGIE","text":"Hail, sinner. Might this old woman impose upon you to travel to Fort Jobb in her stead?"},{"name":"HEGGIE","text":"My son Chathwick is with the guard out there, and I have a package for him that wants delivering. I'd go myself, but my knees simply aren't up to the task."},{"name":"HEGGIE","text":"It's nothing fancy, but I hope Chathwick and his friends will enjoy it."},{"name":"CHATHWICK","text":"A package?"},{"name":"CHATHWICK","text":"Oh, food from Mother! Everyone will be so pleased."},{"name":"CHATHWICK","text":"Her last letter mentioned how distraught she was to hear that members of the guard had given their lives at Holminster Switch, and how touched that so many more risked themselves to protect it..."},{"name":"CHATHWICK","text":"But of course she would be─our whole family is from there, after all. I expect that she wanted to express her feelings by preparing food for us. She does that."},{"name":"CHATHWICK","text":"Wait a moment... You were at Holminster Switch too, weren't you? I saw you on the front lines!"},{"name":"CHATHWICK","text":"I knew it! I don't think I could ever forget the sight of you, facing down eater after eater without ever once flinching─and it's not just me. You're an inspiration to all of us."},{"name":"CHATHWICK","text":"Here's an idea─what if you passed these out to the rest of the guard? I'm sure that they'll be awestruck."},{"name":"CHATHWICK","text":"A free meal, hand-delivered by a hero. Can't ask for much more than that, can we?"},{"name":"BJORN","text":"Ah, food! Thank you. And may I just say─it's a true honor to have you here. Your bravery on the field will not soon be forgotten."},{"name":"GRIMCOGG","text":"Wicked white, you're <span class=\"emphasis\"><span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span></span>! You were there, in the middle of it all, strong as a hundred men! A bulwark against the tide of eaters that threatened to overwhelm us! And now you've brought me a sandwich!"},{"name":"JOANRIC","text":"Chathwick's mother made this!? That's the best news I've had in days! Her cooking is excellent. I was sorry that we couldn't save their home, but at least the whole family made it out alive."},{"name":"ROALDARD","text":"You have my thanks. For this, of course, but also for the battle. I remember you well─though we lost many, it would have been many more without your aid."},{"name":"BJORN","text":"What sort of food <span class=\"emphasis\">do</span> you eat? I don't suppose you know of anything I might feed to the coward that I share the watch with..."},{"name":"GRIMCOGG","text":"A <span class=\"emphasis\">sandwich</span>! Amazing!"},{"name":"JOANRIC","text":"Tell Chathwick to give his mother my best."},{"name":"ROALDARD","text":"Both you and Chathwick's mother are too kind, going out of your way for strangers like this. Thank you."},{"name":"CHATHWICK","text":"Pleased, were they? I expected as much."},{"name":"CHATHWICK","text":"I apologize for asking such a trifling task of you, but we lost a lot of people on that battlefield. Anything that might raise morale is well worth trying."},{"name":"CHATHWICK","text":"And I thought that, if they admire you even half as much as I do, well... &lt;cough&gt;"},{"name":"CHATHWICK","text":"In any case, you have my sincerest gratitude. I saved my favorite portion of the food for you, so please take it along with my thanks!"}],"reward":{"gil":829,"aetherCurrent":1,"items":[{"num":2,"id":27853}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68837]},"next":[68917,68918]},"partials":[{"type":"npc","id":"1027948","obj":{"i":1027948,"n":"Heggie","l":2951,"q":1}},{"type":"npc","id":"1028280","obj":{"i":1028280,"n":"Chathwick","l":2953,"q":1}},{"type":"item","id":"27853","obj":{"i":27853,"n":"Grilled Rail","l":390,"c":24352,"t":46,"p":3359}},{"type":"quest","id":"68837","obj":{"i":68837,"n":"Warrior of Darkness","g":8,"l":"Lakeland","s":230}},{"type":"quest","id":"68917","obj":{"i":68917,"n":"Stock and Barrel","g":113,"l":"Lakeland","s":2020}},{"type":"quest","id":"68918","obj":{"i":68918,"n":"Classical Condition","g":113,"l":"Lakeland","s":2030}}]}