{"quest":{"name":"Classical Condition","location":"Lakeland","id":68918,"patch":5.0,"sort":2030,"eventIcon":71221,"issuer":1027336,"target":1027336,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Riqi-Mao is anything but calm."],"objectives":["Speak with the amaro handler.","Use the whittled whistle to search for the amaro.","Speak with the amaro handler.","Report to Riqi-Mao."],"dialogue":[{"name":"RIQIMAO","text":"You there! Get ready to run! Time is of the essence!"},{"name":"RIQIMAO","text":"Our new amaro has escaped into the forest! The carnivorous-beast-and-bandit-filled forest! Wicked white, my contacts at the Crystarium told me it was meant to be <span class=\"emphasis\">trained</span>..."},{"name":"RIQIMAO","text":"Anyway, we need as many people as possible out there looking for it. Its handler is leading the search─as he <span class=\"emphasis\">should</span>─in the Forest of the Lost Shepherd. Go, go!"},{"name":"RIQIMAO","text":"Why are you still standing here!? Run, run!"},{"name":"ZUN03382","text":"You've come to aid in the search? Excellent."},{"name":"ZUN03382","text":"It's this amaro's first time out of the Crystarium, and he got a bit spooked. Took off before I could stop him─it's instinctual, you understand. He should still respond to this, though."},{"name":"ZUN03382","text":"That whistle produces a tone that all of our amaro have been trained since birth to react to. Blow it loudly, and then listen for his cry. If he's nearby, you'll know."},{"name":"ZUN03382","text":"It's possible that he will be too skittish to follow you back. If so, please return here and let me know."},{"name":"AMARO03382","text":"(-Immobile Amaro-)Gwee..."},{"name":"SYSTEM","text":"The amaro gives a weak cry at the sound of the whistle, turning his eyes in your direction. Perhaps he will respond to you, if you speak to him soothingly..."},{"name":"AMARO03382","text":"(-Immobile Amaro-)Gwee..."},{"name":"SYSTEM","text":"You hear the faint cry of an amaro. He must be nearby."},{"name":"SYSTEM","text":"You hear nothing in reply to the shrill tone of the whistle."},{"name":"SYSTEM","text":"The amaro trembles, apparently unable to move due to injury, fear, or both. Hopefully his handler will know what to do."},{"name":"ZUN03382","text":"You're back already? Does that mean you found him?"},{"name":"ZUN03382","text":"He can't move!? Poor thing! I must go to him at once!"},{"name":"ZUN03382","text":"There, there. You'll be alright."},{"name":"AMARO03382","text":"Gwee!"},{"name":"SYSTEM","text":"The amaro's eyes are filled with something like gratitude as it looks toward you."},{"name":"RIQIMAO","text":"If you're back, it had better be because you found the amaro..."},{"name":"RIQIMAO","text":"Oh, you did! In that case─thank you. We really couldn't have afforded to lose such a valuable resource."}],"reward":{"gil":852},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68916]},"next":[68919]},"partials":[{"type":"npc","id":"1027336","obj":{"i":1027336,"n":"Riqi-Mao","l":2953,"q":1}},{"type":"quest","id":"68916","obj":{"i":68916,"n":"A Jobb Well Done","g":111,"l":"The Crystarium","s":2010,"f":1}},{"type":"quest","id":"68919","obj":{"i":68919,"n":"Desperate Measures","g":113,"l":"Lakeland","s":2040}}]}