{"quest":{"name":"Beers for Fears","location":"Lakeland","id":68925,"patch":5.0,"sort":2101,"eventIcon":71221,"issuer":1027387,"target":1027387,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sai-Qesh is concerned about morale in the Ostall Imperative."],"objectives":["Give bottles of Flatulent Stranger to the soldiers.","Report to Sai-Qesh."],"dialogue":[{"name":"SAIQESH","text":"There are worse jobs than guarding the Imperative, though it's not without its problems. The trouble is, soldiers are supposed to withstand whatever hardships are thrown at us. But we're not made of stone."},{"name":"SAIQESH","text":"Some of the others see complaining and worrying as signs of weakness, so they act as if nothing bothers them. They'd never admit it to another guard, but they might to an outsider like you."},{"name":"SAIQESH","text":"A few swigs of Flatulent Stranger might get them talking, though. Don't blame me, I didn't name it! Anyway, if you can find out what they really think of working here, I'll make it worth your while."},{"name":"SAIQESH","text":"If I were to offer the ale to them myself, they'd probably be reluctant to drink it on duty in front of another soldier. I doubt they'll have the same reservations with you, though!"},{"name":"MERLATH","text":"Hello? What's this?"},{"name":"MERLATH","text":"Oh, Flatulent Stranger! My favorite! I suppose it wouldn't hurt to stop for a few moments while I wet my whistle."},{"name":"MERLATH","text":"Mind you, with all the recent goings-on, we're in a state of constant high alert. Of course, that means I have to stay in this chair, stare through the lens, and not fall asleep for the whole shift!"},{"name":"MERLATH","text":"Truth be told, I've found myself nodding off from time to time, and I'd appreciate it if we could take shorter turns. Not to mention the saddle sores I get from sitting down for so long!"},{"name":"SZELIVANTHEN","text":"Planning to go somewhere by amaro, are you?"},{"name":"SZELIVANTHEN","text":"Ale, eh? I suppose a few sips wouldn't ruffle too many feathers."},{"name":"SZELIVANTHEN","text":"It puts my nerves at ease, that's for certain, but I wish there was something I could do for our amaro. They can be a bit uncooperative when it gets too bright, you see. Perhaps we should use some sort of hoods to help them calm down?"},{"name":"SUELEWQ","text":"What brings you here?"},{"name":"SUELEWQ","text":"Ho ho! This should help pass the time! Keeping watch outside the barracks is not the most exciting job, I must admit. A little bit of Flatulent Stranger will see me through the shift, but I'd better not make a habit of drinking on the job!"},{"name":"SUELEWQ","text":"What I could really do with is someone to talk to. After all, guards usually work in pairs, don't they?"},{"name":"SUELEWQ","text":"Not only would it be good company, but we could cross our spears and say, “Who goes there?” whenever someone comes close. I've always wanted to try that!"},{"name":"SEANRIC","text":"Have you got permission to be in here?"},{"name":"SEANRIC","text":"Ha ha! Bribery will get you everywhere! Just joking, of course, I know who you are."},{"name":"SEANRIC","text":"A lot of the soldiers look up to you, I have to say. Some of them even wish they could leave the Imperative and make a name for themselves."},{"name":"SEANRIC","text":"On the other hand, I expect a few of those out there in the field would welcome the opportunity to do something less risky for a change."},{"name":"SEANRIC","text":"We should look into shuffling the deck a little. After all, “variety is the spice of life,” as the saying goes."},{"name":"MERLATH","text":"I jumped at the chance of manning the telescope, but the novelty soon wore off. It's not as easy as it looks, I can tell you!"},{"name":"SZELIVANTHEN","text":"Amaro are very sensitive creatures, it is true, but I can think of no finer steed."},{"name":"SUELEWQ","text":"Come to think of it, I really should have a spear if I'm on guard duty. That's what they normally use, isn't it?"},{"name":"SEANRIC","text":"Personally, I've no desire to put myself in harm's way. Glory-seekers rarely make it to old age."},{"name":"SAIQESH","text":"So, what did they have to say?"},{"name":"SAIQESH","text":"Hmm... That certainly gives me food for thought, even if it did take a bottle of Flatulent Stranger─each─to get them to speak their minds!"},{"name":"SAIQESH","text":"I'm glad I had the chance to hear their ideas, though. For soldiers posted in a remote outpost like this, there's nothing more important than morale. Here, this is for you."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68840]}},"partials":[{"type":"npc","id":"1027387","obj":{"i":1027387,"n":"Sai-Qesh","l":2953,"q":1}},{"type":"quest","id":"68840","obj":{"i":68840,"n":"Logistics of War","g":8,"l":"The Crystarium","s":260}}]}