{"quest":{"name":"A Hairy Request","location":"Il Mheg","id":68929,"patch":5.0,"sort":2210,"eventIcon":71221,"issuer":1031347,"target":1031347,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The sweet-toothed pixie stares at you hungrily."],"objectives":["Slay psammeads for their legs.","Deliver psammead legs to the sweet-toothed pixie.","Deliver golden nectar to An Iala.","Speak with the sweet-toothed pixie."],"dialogue":[{"name":"PIXIEA03393","text":"Mortal, mortal! I have need of two psammead legs. Will you not hunt the creatures for me? I'm too small and weak to do so myself, but it's bound to be easy for a big, strong mortal such as you."},{"name":"Q1","text":"Do as the pixie bids?"},{"name":"A1","text":"Yes."},{"name":"A1","text":"No."},{"name":"PIXIEA03393","text":"B-But there's no one else I can turn to! Please, I beg you! Bring me a pair of psammead legs!"},{"name":"PIXIEA03393","text":"Thank you ever so much! Now, you'll find the psammeads to the southwest of here. Off you go, and happy hunting!"},{"name":"PIXIEA03393","text":"You'll find the psammeads to the southwest of here. Off you go, and happy hunting!"},{"name":"PIXIEB03393","text":"Oh... You're back."},{"name":"PIXIEB03393","text":"Oh... You really got the legs. I thought it would be funny if you became a psammead's lunch, but it seems the joke is on me."},{"name":"PIXIEB03393","text":"Well, at least we can feast on psammead legs now! Yes, I'll host a high tea─and you're invited too!"},{"name":"PIXIEB03393","text":"Now, while I go and let the others know, could you take this golden nectar to An Iala over at the stables?"},{"name":"PIXIEB03393","text":"Tell them it's for psammead─they'll know what to do!"},{"name":"ANIALA","text":"&lt;sniff&gt; &lt;sniff&gt; Mmmmmm, something sweet this way comes!"},{"name":"ANIALA","text":"Ah, golden nectar! And it's for psammead, you say? Yes, I know precisely what to do! With this and a splash of sheep's milk, we can make honeyed psammead─one of our favorite treats!"},{"name":"ANIALA","text":"We could have it every single day, except psammeads don't like it much when we try to take their legs. We're liable to get our legs torn off instead. To be able to hunt the creatures and not get so much as a scratch on you─you must be really strong!"},{"name":"ANIALA","text":"Anyway, I shall set about my preparations. Be sure to pass my thanks to our sweet-toothed friend!"},{"name":"ANIALA","text":"I shall set about my preparations. Be sure to pass my thanks to our sweet-toothed friend!"},{"name":"PIXIEB03393","text":"Delivered the nectar, did you? My thanks, mortal...and my apologies. I know I invited you to high tea, but I'm worried how Feo Ul might react."},{"name":"PIXIEB03393","text":"“Don't feed the mortal! It'll give <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> an upset tummy!” I can already imagine them complaining. And I was sooo looking forward to showing you the joys of psammead legs... Not only are they delicious, they wriggle inside your mouth─double the delight!"},{"name":"PIXIEB03393","text":"But it's unwise to anger the Madbloom. It is known. So, instead of high tea, please accept this by way of gratitude."}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68842]}},"partials":[{"type":"npc","id":"1031347","obj":{"i":1031347,"n":"Sweet-toothed Pixie","l":2956,"q":1}},{"type":"quest","id":"68842","obj":{"i":68842,"n":"Il Mheg, the Faerie Kingdom","g":8,"l":"Il Mheg","s":280}}]}