{"quest":{"name":"The Astute Amaro","location":"Lakeland","id":68921,"patch":5.0,"sort":2060,"unlocksFunction":1,"eventIcon":71341,"issuer":1031212,"target":1031212,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The sentry captain fears for the fate of one of his men."],"objectives":["Search for the amaro.","Search for the amaro once again.","Use the healing salve on the wounded sentry.","Report back to the sentry captain."],"dialogue":[{"name":"SCOUTCHIEF03385","text":"Damn it all! We can ill afford to lose another─ Ho there, friend. Might you lend me your aid? One of my best men has yet to return from his patrol, and I fear the worst."},{"name":"SCOUTCHIEF03385","text":"As you can see, his amaro made it back safely, but my man's nowhere to be found. Could you search for him in my stead? I would go myself, but I can't very well abandon my post."},{"name":"SCOUTAMARO03385","text":"(-Amaro-)Gwee, gwee!"},{"name":"SCOUTCHIEF03385","text":"Bloody beast! Where do you think you're─ Ah, too late I suppose. But wait... Do you reckon he's gone back for his rider?"},{"name":"SCOUTCHIEF03385","text":"Sorry to trouble you, friend, but do you think you could follow that amaro for us? That scaly brute might be my best chance at finding our man."},{"name":"SCOUTCHIEF03385","text":"And take this salve with you. I reckon there's a good chance he's out there, too wounded to have made his way back."},{"name":"SCOUTCHIEF03385","text":"Pray follow that amaro, friend! That beast might be our best hope to track down my missing man."},{"name":"SYSTEM","text":"The amaro stares intently in the general direction of Dampsole."},{"name":"SCOUTAMARO03385","text":"Gwee? Gweeeeee!"},{"name":"SCOUTPRIVATE03385","text":"Gah! Damned fiend got me in the leg... I can barely stand, let alone move. Is this the end for me?"},{"name":"SYSTEM","text":"The amaro eyes the wounded soldier with a gaze that could almost be described as concerned. This must be the sentry who was separated from his mount."},{"name":"SCOUTAMARO03385","text":"Gweeeeee! Gweeeeee!"},{"name":"SYSTEM","text":"The amaro eyes you with an expectant gaze. You sense it is hoping that you will tend to the man's wounds."},{"name":"SCOUTAMARO03385","text":"Gweeeeee! Gweeeeee!"},{"name":"SYSTEM","text":"The amaro eyes you with an expectant gaze. You sense it is hoping that you will tend to the man's wounds."},{"name":"SCOUTPRIVATE03385","text":"Thank you, friend! When the beast knocked me from my mount, I thought it was the end of me for sure! But however did you know where to look?"},{"name":"SCOUTPRIVATE03385","text":"My mount led you to me? You don't say!"},{"name":"SCOUTPRIVATE03385","text":"I owe you an apology, little fellow... Here I thought you ran off in fear of my foe, but it turns out you were looking for help the whole time. Can you forgive me for doubting you?"},{"name":"SCOUTAMARO03385","text":"Gwee!"},{"name":"SCOUTPRIVATE03385","text":"And with that, I'd best head back to the Imperative and let everyone know I'm all right. Thank you, my friend. You saved my life today."},{"name":"SCOUTCHIEF03385","text":"Ah, there you are. I was hoping that you'd return so I could properly express my gratitude. You'll be happy to know─as I would─that my man has safely returned to the Imperative."},{"name":"SCOUTCHIEF03385","text":"Those amaro can be stubborn brutes at times, but times like this make a man appreciate what loyal companions they truly are. I'd say this one's earned himself some extra feed for dinner today!"}],"reward":{"gil":956,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68840]}},"partials":[{"type":"npc","id":"1031212","obj":{"i":1031212,"n":"Sentry Captain","l":2953,"q":1}},{"type":"quest","id":"68840","obj":{"i":68840,"n":"Logistics of War","g":8,"l":"The Crystarium","s":260}}]}