{"quest":{"name":"Imperative Repairs","location":"Lakeland","id":68920,"patch":5.0,"sort":2050,"unlocksFunction":1,"eventIcon":71341,"issuer":1027382,"target":1027382,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Seanard could use a helping hand in doing some much-needed repairs."],"objectives":["Use the reinforcing mortar on the damaged walls.","Report to Seanard."],"dialogue":[{"name":"SEANARD","text":"Ho there! If you're not otherwise occupied at the moment, how's about lending me a hand or two? They've got me on repair duty, and what with the sorry shape this place is in, it's definitely not a one-man job."},{"name":"SEANARD","text":"It's a simple enough task. Just take this here pail of mortar, find a couple of spots where the walls are looking ragged, and apply a healthy dab. Thanks, friend─what with our ranks thinned as they are, we need all the help we can get!"},{"name":"SEANARD","text":"Truth be told, the whole fort needs a good patching up after what we've been through. But with supplies and manpower limited as they are, all we can do is focus on the places that need it most."},{"name":"SEANARD","text":"I saw you hard at work out there, friend! I'll rest easy tonight knowing that some of the ugliest patches of our walls are looking as good as new."},{"name":"SEANARD","text":"Are you familiar with the history of the Imperative, perchance? It was built nigh on a century ago, by the elves who ruled Lakeland in those days. After the Flood, it's served as one of our bastions of defense against the sin eaters."},{"name":"SEANARD","text":"Yes, this fort's taken its fair share of beatings, but it stands tall to this day, watching over and protecting the Crystarium and its people. And it's our job to <span class=\"emphasis\">keep</span> it standing─material and manpower shortages be damned."},{"name":"SEANARD","text":"'Course, we couldn't do it without the generous efforts of volunteers like you. I reckon you have a real talent for repairs─mayhap I could interest you in joining the guard as a full-time wall mender?"},{"name":"SEANARD","text":"Ahahaha! I jest, of course. I've already taken enough of your time today. Thank you, friend, and be careful out there."}],"reward":{"gil":606,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68840]}},"partials":[{"type":"npc","id":"1027382","obj":{"i":1027382,"n":"Seanard","l":2953,"q":1}},{"type":"quest","id":"68840","obj":{"i":68840,"n":"Logistics of War","g":8,"l":"The Crystarium","s":260}}]}