{"quest":{"name":"What's in a Name","location":"Il Mheg","id":68928,"patch":5.0,"sort":2201,"eventIcon":71221,"issuer":1028051,"target":1028051,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sigun Ul is looking for fun."],"objectives":["Speak with pixies.","Speak with Sigun Ul."],"dialogue":[{"name":"SIGUNUL","text":"Mortals in our village, how exciting! Tell me, what is your name?"},{"name":"SIGUNUL","text":"<span class=\"highlight\">Forename Surname</span>, a lovely name. But <span class=\"emphasis\">our</span> names are lovely too!"},{"name":"SIGUNUL","text":"Ah, but here's an idea! I want you to go and speak with my fellows. Ask them what their names mean. When you're done, return hither and we'll have some fun. Tee hee hee!"},{"name":"SIGUNUL","text":"Go around the village and ask my fellows what their names mean. When you're done, return hither and we'll have some fun!"},{"name":"JULFEO","text":"You wish to know the meaning of my name? Well, Jul is yew and Feo is treasure! Together it means “a treasure beneath the yew”! Beautiful, even if I do say so myself!"},{"name":"JULFEO","text":"Remember, Jul is yew and Feo is treasure! Together it means “a treasure beneath the yew”! Beautiful, even if I do say so myself!"},{"name":"IALASUL","text":"My name is Iala Sul. Separately, the words mean the turn of the seasons and flower. Together, they make me “a flower that blooms always.” Precious, I'm sure you'll agree."},{"name":"IALASUL","text":"A flower that blooms always─that is my name in your tongue. Precious, I'm sure you'll agree."},{"name":"AENCUIN","text":"I'm Aenc Uin! Water and happiness! Happiness in the water! And I'm very happy now! Why? Because you're here! Oh, how shall we play? There are so many ways!"},{"name":"AENCUIN","text":"Water and happiness! Happiness in the water! Oh, I'll think of a game for us to play soon! And then we'll have a jolly good time!"},{"name":"SIGUNUL","text":"Welcome back! I hope you were paying attention to my fellows, because I'm going to test you on the meaning of our names!"},{"name":"SIGUNUL","text":"First question! Who is the pixie whose name means a treasure beneath the yew?"},{"name":"Q1","text":"Which pixie's name means a treasure beneath the yew?"},{"name":"A1","text":"Jul Feo."},{"name":"A1","text":"Iala Sul."},{"name":"A1","text":"Aenc Uin."},{"name":"SIGUNUL","text":"I see, I see... Right, second question. The pixie whose name means a flower that blooms always─where were they playing?"},{"name":"Q2","text":"Where was a flower that blooms always?"},{"name":"A2","text":"By the aetheryte."},{"name":"A2","text":"By the meadow."},{"name":"A2","text":"By the lake."},{"name":"SIGUNUL","text":"Boo, you got <span class=\"emphasis\">both</span> answers wrong! But I'm a kind pixie, so I'll give you another chance. Go and speak with my fellows once more, and this time mark their words well, yes?"},{"name":"SIGUNUL","text":"Hmmm, one out of two isn't terrible, I suppose. All right, by way of a reward, I shall tell you more about our names!"},{"name":"SIGUNUL","text":"Huzzah, you got both answers correct! You were clearly paying attention, and by way of a reward, I shall tell you more about our names!"},{"name":"SIGUNUL","text":"You see, our names are composed of special runes of power. They are chosen to best represent our nature, and the spark of life that abides in us."},{"name":"SIGUNUL","text":"If I were to name you by our custom, it would be... Ooh, this is a tough one! Sigun Tyr, perhaps...or Ul Tyr─it really could go either way!"},{"name":"SIGUNUL","text":"You wish to know the meaning, do you? Ah, but where's the fun in just telling you? You'll have to find out for yourself! Tee hee!"}],"reward":{"gil":642,"items":[{"id":26840}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68842]}},"partials":[{"type":"npc","id":"1028051","obj":{"i":1028051,"n":"Sigun Ul","l":2956,"q":1}},{"type":"item","id":"26840","obj":{"i":26840,"n":"Deepgold Foot Gear Coffer (IL 395)","l":1,"c":26562,"t":61}},{"type":"quest","id":"68842","obj":{"i":68842,"n":"Il Mheg, the Faerie Kingdom","g":8,"l":"Il Mheg","s":280}}]}