{"quest":{"name":"Inglourious Bath Stewards","location":"Lakeland","id":68927,"patch":5.0,"sort":2120,"eventIcon":71221,"issuer":1027391,"target":1027391,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sue-Lewq looks at you with a mixture of admiration and concern."],"objectives":["Speak with Bosta-Bea.","Give Clearmelt's finest mulled wine to the ruffians.","Speak with Bosta-Bea.","Speak with Sue-Lewq."],"dialogue":[{"name":"SUELEWQ","text":"Greetings to you! Still fighting the good fight?"},{"name":"SUELEWQ","text":"I expect all that running about, slaying horrible beasts gets quite tiring. If you don't mind me saying so, you look like you could do with putting your feet up for a bit. And luckily for you, I know just the place!"},{"name":"SUELEWQ","text":"Have you ever been to Clearmelt? The water from the falls does wonders for aches and pains. And if you tell Bosta-Bea that I sent you, she'll see that you're well taken care of!"},{"name":"SUELEWQ","text":"Clearmelt's not just good for bathing, they've got some of the finest food and drink in Lakeland!"},{"name":"BOSTABEA","text":"Sue-Lewq sent you, did he? That cheeky beggar! He's probably hoping I'll give him a special discount next time he's here. Mind you, things haven't been going so well lately."},{"name":"BOSTABEA","text":"There's a couple of thugs who've been scaring off the other patrons. While they always pay the amount due, they swagger about like they own the place. I wish I had it in me to stand up to them, but I've never been one for confrontations."},{"name":"BOSTABEA","text":"Say, if you're an acquaintance of Sue-Lewq's, you must've seen your share of danger. I'll bet you've faced things a lot scarier than those two louts!"},{"name":"BOSTABEA","text":"Once you get on their good side with some complimentary mulled wine, I'm sure they'll be more willing to listen. If you could get them to take their custom elsewhere, I'd be ever so grateful!"},{"name":"BOSTABEA","text":"A bottle or two of wine is a small price to pay for peace and quiet. After all, that's what brings people here in the first place!"},{"name":"ROGUE03391","text":"Come to scrub my back, have you?"},{"name":"ROGUE03391","text":"Mulled wine, eh? Don't mind if I do. Hold on, you're not from 'round here. Did that little strumpet send you to sort us out?"},{"name":"ROGUE03391","text":"All right, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">mate</span></span>, I'm not here to cause a scene. At least, not unless the boss says so."},{"name":"ROGUELEADER03391","text":"I don't recognize you. What do you want?"},{"name":"ROGUELEADER03391","text":"On the house? You're up to something, I can tell, but I'll take your damned wine all the same."},{"name":"ROGUELEADER03391","text":"Hmph! Don't know why I even bother coming here anyway. These days, it's full of do-gooders from the Crystarium looking down their noses at us locals."},{"name":"ROGUELEADER03391","text":"But if that lass wants us to pipe down for the sake of the ones born and bred in Lakeland, I suppose we can manage that. They're not to blame for putting me in a foul mood. All right, I'll shut up and drink my wine."},{"name":"ROGUE03391","text":"Bugger off, you're spoiling my view!"},{"name":"ROGUELEADER03391","text":"You've said your piece, so why are you still hovering about me like a fly 'round shite?"},{"name":"BOSTABEA","text":"They've quieted down, you say? I was hoping they'd leave altogether, but it's still a lot better than all that swearing and carrying-on they were doing before."},{"name":"BOSTABEA","text":"I do hope they haven't given you a poor impression of the place, though. Our other guests are much less boisterous! And I expect they're as thankful as I am for your...calming influence."},{"name":"BOSTABEA","text":"Mind you, I won't always have you here to help, so perhaps you could ask Sue-Lewq to send a few more of the Crystarium guards?"},{"name":"BOSTABEA","text":"If I were on patrol, I can think of worse places to stop than Clearmelt. And if they're lucky, there might even be a free drink in it for them! Hee hee!"},{"name":"SUELEWQ","text":"What's that? Trouble, you say? My, my, that will never do! I'll see if we can spare a few more men to watch over Clearmelt. I imagine they'll leap at the chance!"},{"name":"SUELEWQ","text":"I fear, however, that I owe you an apology. If I hadn't suggested you pay the place a visit, you never would've been involved in that unpleasantness. Here, please accept this as thanks for helping Bosta-Bea."}],"reward":{"gil":956,"items":[{"id":26844}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68840]}},"partials":[{"type":"npc","id":"1027391","obj":{"i":1027391,"n":"Sue-Lewq","l":2953,"q":1}},{"type":"item","id":"26844","obj":{"i":26844,"n":"Deepgold Bracelet Coffer (IL 395)","l":1,"c":26566,"t":61}},{"type":"quest","id":"68840","obj":{"i":68840,"n":"Logistics of War","g":8,"l":"The Crystarium","s":260}}]}