{"quest":{"name":"Loot Justice Mode","location":"Lakeland","id":68926,"patch":5.0,"sort":2110,"eventIcon":71221,"issuer":1027379,"target":1027379,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Lethenmaer is sick to the back teeth with thieving scoundrels."],"objectives":["Speak with the well-armed larcener and defend yourself if necessary.","Retrieve a pilfered weapon.","Deliver a pilfered weapon to Lethenmaer."],"dialogue":[{"name":"LETHENMAER","text":"You must be the one Lyna mentioned. She said you're quite the fighter. I've a job for you, if you're interested."},{"name":"LETHENMAER","text":"A group of ne'er-do-wells have been making a nuisance of themselves down in Dampsole. What's worse, they're armed with the same gear that we use."},{"name":"LETHENMAER","text":"We can't be sure whether it was stolen from the Imperative or if they got it from one of our own, selling it from under our noses. Whatever the cause, we need to get to the bottom of this."},{"name":"LETHENMAER","text":"I want you to locate the stolen weapons and bring one back to me as evidence. My men'll collect the rest later. And if those thieving bastards try anything, do whatever is necessary to defend yourself."},{"name":"LETHENMAER","text":"I only need to see one of them for now, as I doubt you can carry a whole arsenal of weapons by yourself. Or can you?"},{"name":"BANDIT03390","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s after the stash! Get <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"BALLOON03390","text":"You'll pay for that!"},{"name":"SYSTEM","text":"This seems to be the stockpile of weapons that Lethenmaer is looking for."},{"name":"LETHENMAER","text":"So, what have you brought me?"},{"name":"LETHENMAER","text":"So that's what happened..."},{"name":"LETHENMAER","text":"The markings on the hilt indicate the unit it belonged to. In this case, the rightful owner was part of a patrol that was attacked by sin eaters some time ago. Though we were able to recover their bodies, their weapons had already been taken."},{"name":"LETHENMAER","text":"Gear like this would fetch a high price, but the fact that the looters kept it for themselves worries me. Whatever they were planning, it seems you were able to put a stop to it."},{"name":"LETHENMAER","text":"Gods, as if we don't already have enough to contend with. Well, thanks to you, the rest of them will think twice before they try looting anything from us again."}],"reward":{"gil":883},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68840]}},"partials":[{"type":"npc","id":"1027379","obj":{"i":1027379,"n":"Lethenmaer","l":2953,"q":1}},{"type":"quest","id":"68840","obj":{"i":68840,"n":"Logistics of War","g":8,"l":"The Crystarium","s":260}}]}