{"quest":{"name":"All That Heavenly Glory","location":"Lakeland","id":68924,"patch":5.0,"sort":2090,"eventIcon":71221,"issuer":1027389,"target":1027389,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Aiscar has the need for seeds."],"objectives":["Slay lake anemones and obtain their seeds.","Deliver the lake anemone seeds to Aiscar."],"dialogue":[{"name":"AISCAR","text":"I say, might I ask a favor? Nothing too troublesome, I assure you. Well, assuming that you have no aversion to slaying a few lake anemones, that is."},{"name":"AISCAR","text":"It is their seeds I am after, you see, and I will gladly pay above the going rate for swift delivery. There is no need to worry about the whys and wherefores for now, just bring them to me as quickly as you can!"},{"name":"AISCAR","text":"You may know anemones as flowering plants or as aquatic, predatory creatures. <span class=\"emphasis\">Lake</span> anemones, however, are perhaps a little of both..."},{"name":"AISCAR","text":"I take it you have done as I have asked?"},{"name":"AISCAR","text":"Yes, these should suffice. Of course, I do not wish to grow my own lake anemones, heavens forbid! I plan to extract the oil for some improvements I have in mind for the telescope."},{"name":"AISCAR","text":"Magnificent, is it not? It was constructed long before the Flood and was originally used to observe celestial bodies."},{"name":"AISCAR","text":"As you may well imagine, a sky inundated with Light is not conducive to stargazing, and the telescope was pointed downwards to watch for the arrival of approaching sin eaters instead."},{"name":"AISCAR","text":"The return of darkness to the land stirred in me the desire to research the movements of the various constellations, though the years spent in this lowered position have rendered the mountings stiff. Immovable, in fact."},{"name":"AISCAR","text":"Hence my need for anemone seed oil. With a liberal application, I will have the telescope aimed skyward, that I may bask in the glory of the heavens!"}],"reward":{"gil":810},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68840]}},"partials":[{"type":"npc","id":"1027389","obj":{"i":1027389,"n":"Aiscar","l":2953,"q":1}},{"type":"quest","id":"68840","obj":{"i":68840,"n":"Logistics of War","g":8,"l":"The Crystarium","s":260}}]}