{"quest":{"name":"An Unreasonable Request","location":"Lakeland","id":68922,"patch":5.0,"sort":2070,"unlocksFunction":1,"eventIcon":71341,"issuer":1027419,"target":1027353,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Teanna appears to be confused about your identity."],"objectives":["Deliver the supply order to Mynes.","Speak with the guardsmen at Radisca's Round.","Report to Mynes."],"dialogue":[{"name":"TEANNA","text":"Hold it right there, greenhorn! If you thought you could just stroll right past your senior without asking how you might aid me in my duties, you have another think coming."},{"name":"TEANNA","text":"It just so happens that I have a task for you to perform. This is a supply order that must be delivered to Mynes at Radisca's Round. You are to take it to him, and to do so with all speed."},{"name":"TEANNA","text":"Why are you still dawdling about here, greenhorn? Hurry yourself to Radisca's Round and deliver the supply order before I change my mind and assign you to clean the privy instead!"},{"name":"MYNES","text":"Well met, traveler. What brings you to our outpost this day?"},{"name":"MYNES","text":"A supply order from Teanna at the Ostall Imperative? But why, pray tell, are <span class=\"emphasis\">you</span> delivering this, and not one of our own men?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That's what I'd like to know..."},{"name":"A1","text":"I intend to claim a reward."},{"name":"MYNES","text":"Mistaken for a new recruit, you say? You really should make a point to clarify the situation next time. Not that I don't appreciate your service, of course, but Teanna has a reputation for running roughshod over anyone she can."},{"name":"MYNES","text":"I see you're not just brave, but resourceful as well. What with the roads so dangerous these days, there's good coin to be made running messages between the outposts, no doubt."},{"name":"MYNES","text":"While I am loath to impose upon you further, if you'll be returning to the Imperative regardless, I was hoping I might trouble you to deliver the supplies Teanna has requested. I'm afraid the recent sin eater attacks have left us rather shorthanded."},{"name":"MYNES","text":"It will take just a short while to prepare the materials for delivery. I invite you to make yourself comfortable while you wait."},{"name":"MYNES","text":"...Not that there's much in the way of entertainment here. It <span class=\"emphasis\">is</span> a military outpost after all. Perhaps you could converse with the soldiers? It'd be sure to raise their spirits, and you just might glean some useful information out of them."},{"name":"MYNES","text":"The materials will be packed up and ready for delivery any time now. Until then, please make yourself comfortable and feel free to speak to our men."},{"name":"LEWTOSAI","text":"Ho there, stranger! We don't get many travelers in these parts. What do you think of the Round? She's an odd one as far as forts go, wouldn't you say?"},{"name":"LEWTOSAI","text":"Truth is, what you see today is actually the ruins of a larger structure built over a century ago. We took over what was left, and converted it into a lookout tower of sorts to serve us in our struggle against the sin eaters."},{"name":"LEWTOSAI","text":"Seeing as how it stands at a major fork in the highroad, the location's rather ideal, you see. We can see threats coming in from malms away, and send out patrols to deal with them before they get too close. 'Course, it gets kind of lonely all the way out here, but what can you do?"},{"name":"VARLIER","text":"A traveler? Hah! You're an odd one to pick this place for a leisurely excursion. Me, I can think of a hundred places I'd rather be."},{"name":"VARLIER","text":"But since you were kind enough to grace us with your company, why don't I tell you a bit about this place? Radisca's Round was built on the ruins of an old belfry. In more peaceful days, its clarion call would ring out through Lakeland to announce the time of day."},{"name":"VARLIER","text":"Since the Flood, however, the bell serves a purpose far more grim: to warn the residents of Lakeland of sin eater attacks. Oh, would that the day return when its ring again brings only joy and not fear..."},{"name":"JOANARD","text":"Hail there, friend! Say, have you ever wondered how Radisca's Round got its name? Wait, don't answer that─I've a mind to tell you anyway. Bahaha!"},{"name":"JOANARD","text":"Radisca was a guardsman in the early days─one of our best and bravest, as the records tell. They say he gave his life holding off a horde of sin eaters just long enough for a group of refugees to flee to safety."},{"name":"JOANARD","text":"The body of this hero was discovered right here at this tower, and ever since then it's been named in his honor. Makes a man proud to serve, I say."},{"name":"LEWTOSAI","text":"Radisca's Round is the watchful eye that keeps the Crystarium safe against the sin eaters. I never allow myself to forget that we hold countless lives in our hands."},{"name":"VARLIER","text":"Oh, would that those bygone days return, that our bell might once again ring out in peace..."},{"name":"JOANARD","text":"Every time I feel my courage waver, I think of Radisca, and the sacrifice he made. I cannot dishonor his name by giving any less than my all."},{"name":"MYNES","text":"Ah, there you are, friend. Did my men have anything of interest to say? In any event, I hope your stay here was not overly tiresome."},{"name":"MYNES","text":"I am pleased to inform you that the materials have been packed up and are ready for delivery. Before that, though, please allow me to compensate you for your service."}],"reward":{"gil":679,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68840]},"next":[68923]},"partials":[{"type":"npc","id":"1027419","obj":{"i":1027419,"n":"Teanna","l":2953,"q":2}},{"type":"npc","id":"1027353","obj":{"i":1027353,"n":"Mynes","l":2953,"q":2}},{"type":"quest","id":"68840","obj":{"i":68840,"n":"Logistics of War","g":8,"l":"The Crystarium","s":260}},{"type":"quest","id":"68923","obj":{"i":68923,"n":"You've Got the Tatch","g":113,"l":"Lakeland","s":2080}}]}