{"quest":{"name":"Bewitched Books","location":"Il Mheg","id":68935,"patch":5.0,"sort":2270,"eventIcon":71221,"issuer":1030618,"target":1030618,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The exuberant pixie has another bright idea."],"objectives":["Sprinkle flying fishscales on tomes.","Report to the exuberant pixie."],"dialogue":[{"name":"PIXIE03399","text":"Ooh, another brilliant idea just occurred to me! Will you help me again, mortal?"},{"name":"PIXIE03399","text":"As his friend, you'll know that Urianger is not the tidiest of people. Why, he's half-buried in mountains of tomes and other things I have no name for, and as a result he spends half his time searching for things. Which means less time playing with us!"},{"name":"PIXIE03399","text":"What I want to do is cast an enchantment on his tomes so he can find them easily. All he has to do is say a tome's name, and it will come flying into his hands! Brilliant, yes?"},{"name":"PIXIE03399","text":"The problem is, I can't read your funny mortal letters, meaning I can't find his favorite tomes. So I need you to do the finding and the enchanting in my stead."},{"name":"PIXIE03399","text":"Now, I often see him with his nose buried in three different tomes. One is about the history of Voeburt, another about some Shadowkeeper person, and the last about runes, the letters we use in our language. Please find each of them and give them a good sprinkling of these flying fishscales!"},{"name":"PIXIE03399","text":"Remember, one tome is about the history of Voeburt, another about some Shadowkeeper fellow, and the last about runes. Please find each of them and give them a good sprinkling of these flying fishscales!"},{"name":"SYSTEM","text":"This tome is titled <span class=\"emphasis\">The History of Voeburt</span>. Will you read the tome before enchanting it?"},{"name":"Q1","text":"Read the tome?"},{"name":"BOOKA03399","text":"As is portrayed by the two-headed wolf which graces the nation's coat of arms, the Kingdom of Voeburt was born of an alliance between the Drahn and the Galdjent."},{"name":"BOOKA03399","text":"Ere such an alliance could be forged, however, much blood was spilled. In order to avoid further bloodshed, our ancestors established a system of succession whereby the crown would be retained by the Drahn."},{"name":"BOOKA03399","text":"Each successive monarch would be chosen by a council of five, of whom three would be Galdjent of noble houses. Thus did the two-headed wolf arise to rule the northern lands of Norvrandt."},{"name":"SYSTEM","text":"This tome is titled <span class=\"emphasis\">The Rise of the Shadowkeeper</span>. Will you read the tome before enchanting it?"},{"name":"Q2","text":"Read the tome?"},{"name":"BOOKB03399","text":"In the eyes of the elves, all the other races that now inhabit Norvrandt are naught but invaders─thieves who despoiled them of their ancestral home."},{"name":"BOOKB03399","text":"Their disdain was not reserved for long-standing enemies such as the Voeburtites alone. Even their allies, the Humes, were regarded as outsiders unworthy of trust."},{"name":"BOOKB03399","text":"With many of Lakeland's offices of power held by elven conservatives, who desired a return to the glory days of eld, the Shadowkeeper saw an opportunity and seized it, taking control from within."},{"name":"SYSTEM","text":"This tome is titled <span class=\"emphasis\">A Treatise on Runes</span>. Will you read the tome before enchanting it?"},{"name":"Q3","text":"Read the tome?"},{"name":"BOOKC03399","text":"The fae races such as the Nu Mou and the pixies wield their unique type of spellcraft through the use of runes."},{"name":"BOOKC03399","text":"Each rune represents a letter while harboring a meaning all its own, and together they form the foundation of fae magicks. Below is a list of some popular runes, which oft find use in fae names."},{"name":"BOOKC03399","text":"Sigun: the sun, or light; Ul: the moon, or darkness; Oul: the land, or earth;<br>Eo: a star, or a lesser light; Feo: a treasure, or wealth."},{"name":"PIXIE03399","text":"Ah, there you are. Done with the enchanting, then?"},{"name":"PIXIE03399","text":"What!? The tomes came to life and ran away!? Ahahahaha! That's hilarious! I must tell everyone about this!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68934]}},"partials":[{"type":"npc","id":"1030618","obj":{"i":1030618,"n":"Exuberant Pixie","l":2956,"q":2}},{"type":"quest","id":"68934","obj":{"i":68934,"n":"Delightful Decorations","g":116,"l":"Il Mheg","s":2260,"f":1}}]}