{"quest":{"name":"Delightful Decorations","location":"Il Mheg","id":68934,"patch":5.0,"sort":2260,"unlocksFunction":1,"eventIcon":71341,"issuer":1030618,"target":1030618,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>At the sight of you, the exuberant pixie's eyes light up with recognition."],"objectives":["Gather whirlweeds in the lake.","Deliver the whirlweeds to the exuberant pixie.","Decorate the stairs with snugblooms.","Report to the exuberant pixie."],"dialogue":[{"name":"PIXIE03398","text":"Oh! You're Urianger's friend, aren't you? Will you not lend me a hand?"},{"name":"PIXIE03398","text":"You see, Urianger's home is drab and dull, and I've a mind to decorate it, make it bright and beautiful. If you were to help out, it'd make it all the more special!"},{"name":"PIXIE03398","text":"First of all, we need some whirlweeds, a pretty little plant that grows in the water. We usually trade with the Fuath for it, but seeing as you can swim, you can harvest some for us."},{"name":"PIXIE03398","text":"You should be able to find the weed in the lake where there's a sunken church. While you take care of this, I'll go and pick us lots and lots of beautiful flowers!"},{"name":"PIXIE03398","text":"Afterwards, let's meet back here for the decorating. See you soon!"},{"name":"PIXIE03398","text":"There you are! Did you manage to find the whirlweeds?"},{"name":"PIXIE03398","text":"Oho, look at these lovelies! I'll enchant these at once, make it so they can grow outside the water, and then plant them here and there."},{"name":"PIXIE03398","text":"Meanwhile, I want you to decorate with these snugblooms."},{"name":"PIXIE03398","text":"As to where they should go... Ah, yes, the stairs! That's a dull spot that's ripe for some cheer. When you've finished, come and let me know!"},{"name":"PIXIE03398","text":"Tee hee hee! Marvelous! This is sure to put a smile on Urianger's scowly face!"},{"name":"PIXIE03398","text":"And then he'll want to stay here, forever and ever and ever! You're welcome to stay too, of course? There's plenty of room for you and aaall your friends!"}],"reward":{"gil":752,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68846]},"next":[68935]},"partials":[{"type":"npc","id":"1030618","obj":{"i":1030618,"n":"Exuberant Pixie","l":2956,"q":2}},{"type":"quest","id":"68846","obj":{"i":68846,"n":"Unto the Truth","g":8,"l":"Il Mheg","s":320}},{"type":"quest","id":"68935","obj":{"i":68935,"n":"Bewitched Books","g":116,"l":"Il Mheg","s":2270}}]}