{"quest":{"name":"An Artist's Tale","location":"Il Mheg","id":68937,"patch":5.0,"sort":2290,"eventIcon":71221,"issuer":1030418,"target":1030418,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The art-loving pixie has something to show you."],"objectives":["Find the location portrayed in the drawing of bathing leafmen.","Find the location portrayed in the drawing of gathered leafmen.","Report to the art-loving pixie."],"dialogue":[{"name":"SYSTEM","text":"Should you choose to undertake this quest, know that guidance from the journal, duty list, and map will be limited. You will need to read the text carefully and decipher the clues to determine your course of action."},{"name":"PIXIE03401","text":"Mortal, mortal, look at this book I found! Unlike the boring ones in Urianger's home, this one has lots of pictures in it!"},{"name":"PIXIE03401","text":"There're two pictures that I like especially. They have the most <span class=\"emphasis\">adorable</span> leafmen in them! See?"},{"name":"SYSTEM","text":"The pictures appear to depict locales in Il Mheg."},{"name":"PIXIE03401","text":"I really, really want to find these leafmen, but I haven't had any luck."},{"name":"PIXIE03401","text":"If I lend you the pictures, do you think you could search for me? There'll be a reward in it for you!"},{"name":"SYSTEM","text":"Refer to the pictures of the leafmen to find the locations they portray."},{"name":"PIXIE03401","text":"If you manage to track down the leafmen in the pictures, come and let me know. There'll be a reward in it for you!"},{"name":"SYSTEM","text":"You find the location portrayed in the picture of the gathered leafmen."},{"name":"SYSTEM","text":"On closer inspection, you see words scrawled along the border of the picture..."},{"name":"SYSTEM","text":"“Such lifelike topiary. I half expect the leafy participants of this gathering to burst into conversation at any moment. Yet out in this wilderness, by whose hands are they being so meticulously maintained?”"},{"name":"SYSTEM","text":"You find the location portrayed in the picture of the bathing leafmen."},{"name":"SYSTEM","text":"On closer inspection, you see words scrawled along the border of the picture..."},{"name":"SYSTEM","text":"“I came upon topiary at the water, appearing as if bathing. Nearby, there lay a fishing rod, worn and weathered. For a moment my mind went to a dark place, but surely it is but a coincidence. Surely...”"},{"name":"PIXIE03401","text":"You found the leafmen in the pictures? Wonderful! I can't wait to see them with my own eyes!"},{"name":"PIXIE03401","text":"Let me tell you, it's not easy to make them so lifelike. You must cast the enchantment on mortals completely unawares, else you're liable to end up with disappointing results."},{"name":"PIXIE03401","text":"Why, when I tried to sneak up on the owner of the book, he noticed me and promptly ran off. And now I've got a leafman frozen mid-stride with his mouth split open in terror. Not a pretty sight."},{"name":"PIXIE03401","text":"Oh, but before I forget, here is your reward as promised. Now, if you'll excuse me, I have some leafmen to play with!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68847]}},"partials":[{"type":"npc","id":"1030418","obj":{"i":1030418,"n":"Art-loving Pixie","l":2956,"q":1}},{"type":"quest","id":"68847","obj":{"i":68847,"n":"Courting Cooperation","g":8,"l":"Il Mheg","s":330}}]}