{"quest":{"name":"A Rosy Problem","location":"Il Mheg","id":68939,"patch":5.0,"sort":2310,"eventIcon":71221,"issuer":1027657,"target":1027657,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>An Iala has an earnest request for you."],"objectives":["Slay two rosebears, then defeat the giant rosebear when it appears.","Report to An Iala."],"dialogue":[{"name":"ANIALA","text":"Help! Help us please! I swear this is not a trick!"},{"name":"ANIALA","text":"You see, there are these scary bears that terrorize us. Rosebears, they're called, and we're usually able to drive them away. But of late, one that's bigger, fiercer, and hungrier than the rest has appeared!"},{"name":"ANIALA","text":"We're too scared to try anything on it, small and weak as we are. But you're much bigger and stronger than us. If someone can deal with that rabid beast, I believe you can!"},{"name":"ANIALA","text":"Now, the ordinary rosebears are known to prowl the area east of here. If you were to slay a few of them, it should lure out their more fearsome kin. And when it does, I want you to slay it too!"},{"name":"ANIALA","text":"The ordinary rosebears are known to prowl the area east of here. If you were to slay a few of them, it should to lure out their more fearsome kin. And when it does, I want you to slay it too!"},{"name":"ANIALA","text":"You did it! You rid us of the giant rosebear! We're in your debt!"},{"name":"ANIALA","text":"For long, long years, those brazen beasts have preyed on our sheep─our precious friends who give us milk."},{"name":"ANIALA","text":"In order to teach them a lesson, we grew plants on their bodies, but to our dismay, it only made them scarier."},{"name":"ANIALA","text":"But thanks to you, the scariest of them is no more, and the lesser ones, we can manage by ourselves. Il Mheg is a better place for kind and helpful mortals such as you!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68847]}},"partials":[{"type":"npc","id":"1027657","obj":{"i":1027657,"n":"An Iala","l":2956,"q":1}},{"type":"quest","id":"68847","obj":{"i":68847,"n":"Courting Cooperation","g":8,"l":"Il Mheg","s":330}}]}