{"quest":{"name":"Flowers of Fury","location":"Il Mheg","id":68930,"patch":5.0,"sort":2220,"eventIcon":71221,"issuer":1030619,"target":1030619,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The pixie flowerkeep is seething with fury."],"objectives":["Punish wicked mortals.","Report to the pixie flowerkeep.","Speak with the pixie flowerkeep."],"dialogue":[{"name":"PIXIE03394","text":"Grrr, I am flapping mad right now! Some wicked mortals snuck into Il Mheg and tried to steal our flowers!"},{"name":"PIXIE03394","text":"I used illusions to send them on their way, but instead of learning their lesson, they went and poked my friends with cold, pointy metal!"},{"name":"PIXIE03394","text":"It's unforgivable! Those brazen wretches must be punished, and you'll come and punish them with me!"},{"name":"PIXIE03394","text":"Good! Now, to make it interesting, let us make this a race: the first to dole out punishment wins. The villains fled to the southwest─let's go and get them!"},{"name":"BARBARIAN03394","text":"Who are you!? The bloody pixies' minion!?"},{"name":"BOORISH03394","text":"The flowers are gonna make me rich! Piss off or else!"},{"name":"PIXIE03394","text":"What, you're done punishing them already!? Wow, you're swifter than a salamander!"},{"name":"PIXIE03394","text":"...Hm, what was a salamander again?"},{"name":"PIXIE03394","text":"At any rate, justice has been served, and I doubt those mortals will try anything again. Come, let us return to Lydha Lran."},{"name":"PIXIE03394","text":"Thanks to you, we may enjoy our beautiful flowers in peace again."},{"name":"PIXIE03394","text":"But I must say, I'm a little disappointed that I lost our little race."},{"name":"PIXIE03394","text":"I was planning to turn those thieves into leafmen, and then they could have amused me forever and ever. If you should see them again, tell them to come back!"}],"reward":{"gil":679},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68842]}},"partials":[{"type":"npc","id":"1030619","obj":{"i":1030619,"n":"Pixie Flowerkeep","l":2956,"q":1}},{"type":"quest","id":"68842","obj":{"i":68842,"n":"Il Mheg, the Faerie Kingdom","g":8,"l":"Il Mheg","s":280}}]}