{"quest":{"name":"Painting for Praise","location":"Il Mheg","id":68941,"patch":5.0,"sort":2330,"icon":100853,"eventIcon":71221,"issuer":1030838,"target":1030838,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ul Thon needs more ideas on how to become popular.","Disheartened but not defeated, Ul Thon again asks for your advice on how to become popular. Taking your suggestion to heart, the pixie decides that they can impress by painting beautiful pictures such as those seen in tomes. While they see to making a brush, Ul Thon bids you harvest sap from the orange-leafed trees that grow at Timh Gyeus, which they will use to make paint.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You harvest the sap, fending off curious beasts that were drawn to the smell. Having collected what you need, you turn your steps back to Lydha Lran to rejoin Ul Thon.","Taking the sap off your hands, Ul Thon says that they will mix the juices of bugs and plants to produce myriad hues. They then set out to the northwest, to the spot where they will work on their masterpiece.","You find Ul Thon at an outlook that offers a commanding view of Lyhe Ghiah. Without further ado, the pixie sets to work, and after a few mishaps, they finally complete their masterpiece. Eager to show it off to their fellow pixies, they hurry back to Lydha Lran, and you follow close by.","Back at the village, Ul Thon proudly presents their picture to the gathered crowd. To their disappointment, however, it fails to impress everyone.","Though the result was not as hoped, Ul Thon takes comfort in the knowledge that some few of their fellows approved of their work. However, it is clear that painting won't win the admiration that they desire, and you must think of another way."],"objectives":["Harvest thick sap from trees.","Deliver the thick sap to Ul Thon.","Search for Ul Thon.","Speak with Ul Thon."],"dialogue":[{"name":"ULTHON","text":"Knowing things didn't make me popular...but there has to be some other way. Don't you have any other ideas?"},{"name":"Q1","text":"What else can Ul Thon do to become popular?"},{"name":"A1","text":"Acquire a skill that other pixies will envy."},{"name":"A2","text":"Acquire an item that other pixies will envy."},{"name":"ULTHON","text":"Hmmm, a skill to be envied... Oh, I know! One of the books at Urianger's home had lovely pictures in it. If I could draw as beautifully, the others are bound to be impressed!"},{"name":"ULTHON","text":"Hmmm, an item to be envied... Oh, I know! One of the books at Urianger's home had lovely pictures in it. If I were to draw something similar and show it to the others, they're bound to be impressed!"},{"name":"ULTHON","text":"Right, I'm going to collect some fine grass for making a brush. Meanwhile, could you get me what I need for the paint?"},{"name":"ULTHON","text":"East of the village, there are trees that have orange leaves. Their sap makes excellent paint, and I want you to harvest it."},{"name":"ULTHON","text":"Be careful when handling the sap, though. It gives off a smell that attracts ferocious beasts."},{"name":"ULTHON","text":"The trees with orange leaves grow east of the village. Take care when you harvest the sap, as it gives off a smell that attracts ferocious beasts."},{"name":"ULTHON","text":"My brush is ready! All I need now is the paint. Did you get the sap I asked for?"},{"name":"ULTHON","text":"Oho, a goodly amount! By mixing the juices of bugs and plants in this, I can produce myriad pretty hues."},{"name":"ULTHON","text":"I'll make the colors at once then begin working on my masterpiece. Needless to say you must be present when I complete it!"},{"name":"ULTHON","text":"Where will I do the painting, you ask? At a spot to the northwest of here. It's the perfect vantage point for my subject matter."},{"name":"ULTHON","text":"You'll know when you're there─you'll see the wings of Lyhe Ghiah spread wide in all their majesty!"},{"name":"ULTHON","text":"What did I tell you? The perfect vantage point, yes? It's here that my masterpiece shall be born! I call it...<span class=\"emphasis\">Ul Thon's Lyhe Ghiah</span>!"},{"name":"ULTHON","text":"Hmmm, how odd... The castle looks a lot redder than the real thing. &lt;sigh&gt; Guess I'll start over..."},{"name":"ULTHON","text":"Hmmm, how odd... There's a few towers too many. &lt;sigh&gt; Guess I'll start over..."},{"name":"ULTHON","text":"Yes... Yes, this is it! The colors, the proportions─everything is perfect!"},{"name":"ULTHON","text":"My masterpiece is ready! I'm going to go and show it off to everyone in Lydha Lran! Tee hee, my popularity is all but sealed!"},{"name":"ULTHON","text":"Look, look! I painted a picture of Lyhe Ghiah! Isn't it lovely? Aren't you impressed?"},{"name":"PIXIEA03404","text":"(-Bored Pixie-)What's there to be impressed about something that doesn't move? Much more fun chasing dandelion puffs and playing pranks on mortals!"},{"name":"ULTHON","text":"What? But...I tried so hard..."},{"name":"PIXIEB03404","text":"(-Enthused Pixie-)Well, I think your picture is very nice! Do you have any others? One of the lake, perhaps, with all the sunken houses peering from under the water? I think that would be very beautiful!"},{"name":"ULTHON","text":"No, I've only painted this picture of Lyhe Ghiah. I thought it was the most beautiful thing, so..."},{"name":"PIXIEA03404","text":"(-Enthused Pixie-)Oh well, too bad. But if you end up painting the lake, do come and show it to us!"},{"name":"ULTHON","text":"They liked my work! Some of them liked my work! I'm admired, if only a little!"},{"name":"ULTHON","text":"If I want more admiration, though, I need to paint pictures that others want to see. I can't simply paint the things I like. Ah, the dilemmas of an artist..."},{"name":"ULTHON","text":"But in the end, if there are those who aren't at all interested in paintings, then I can't truly become popular. We'll need to think of something else."},{"name":"ULTHON","text":"But you know what? I'll still give that pixie the painting of the lake that they wanted!"}],"reward":{"gil":861},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68940]},"next":[68942]},"partials":[{"type":"npc","id":"1030838","obj":{"i":1030838,"n":"Ul Thon","l":2956,"q":4}},{"type":"quest","id":"68940","obj":{"i":68940,"n":"The Path to Popularity","g":116,"l":"Il Mheg","s":2320,"f":1}},{"type":"quest","id":"68942","obj":{"i":68942,"n":"Gifts to Gladden","g":116,"l":"Il Mheg","s":2340}}]}