{"quest":{"name":"The Dependable Darling","location":"Il Mheg","id":68943,"patch":5.0,"sort":2350,"icon":100853,"eventIcon":71221,"issuer":1030838,"target":1030838,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ul Thon wants to know Hagan Nee's whereabouts.","According to the panicked pixie, Hagan Nee was being chased in the vicinity of Handmirror Lake. Despite being unable to fight, Ul Thon is resolved to help their distressed fellow, and together you set out on a rescue mission.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You arrive at the area where Hagan Nee was last seen. Scanning the area, Ul Thon hears a scream, and flies off towards the direction of the sound.","By the edge of a cliff, you find Ul Thon standing between the monstrous fiend and its prey. Wasting no time, you hurl yourself into the fray and dispatch the creature. With the danger passed, you turn your attention to the pixies.","Ul Thon uses healing magicks to tend the wounded Hagan Nee, who makes a swift recovery. The pixie expresses their gratitude to the both of you before heading back to Lydha Lran, and you follow shortly thereafter.","Back at Lydha Lran, Ul Thon thanks you for giving them the courage to help their fellow. At that moment, Hagan Nee arrives in the company of other pixies. It would seem that the word of Ul Thon's deeds has swiftly spread, and the pixie has come to be held in highest regard. With that regard comes many requests, and Ul Thon finds themself not a little daunted, but the pixie promises to do their best to live up to the popularity that they had dreamed of."],"objectives":["Speak with Ul Thon.","Follow Ul Thon.","Speak with Ul Thon."],"dialogue":[{"name":"ULTHON","text":"So, the field where you saw Hagan Nee─was it by Longmirror Lake?"},{"name":"PIXIEC03406","text":"(-Panicked Pixie-)No, the other one─Handmirror Lake. You'll help us, won't you, mortal?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Just leave it to me!"},{"name":"A2","text":"I can't do this without Ul Thon."},{"name":"A3","text":"You're on your own."},{"name":"ULTHON","text":"Wait, I'm coming with you! I'm scared, if truth be told...but a pixie who protects their fellows is a popular pixie!"},{"name":"ULTHON","text":"B-But I can't fight or anything. What good am I to you? And yet...a pixie who protects their fellows is a popular pixie!"},{"name":"ULTHON","text":"You'd forsake us in our time of need!? Oh, forget you, then! I'll go and rescue Hagan Nee alone!"},{"name":"ULTHON","text":"...Ahhh! I see what you're doing, you sly mortal! You want to tell me that a pixie who protects their fellows is a popular pixie, isn't that right?"},{"name":"PIXIEC03406","text":"(-Panicked Pixie-)Be that as it may, it's too dangerous by yourself! The two of you should go together!"},{"name":"ULTHON","text":"Right, we'll take care of this! You two, wait in the village!"},{"name":"ULTHON","text":"Handmirror Lake lies to the northwest. Let's hurry there and look for Hagan Nee!"},{"name":"ULTHON","text":"This should be the spot, but Hagan Nee doesn't seem to be here anymore... I'll try calling out."},{"name":"ULTHON","text":"Hagan Nee! Where are you!?"},{"name":"ULTHON","text":"Nothing. We'll just have to─"},{"name":"ULTHON","text":"Did you hear that!? It was a scream, and it came from over there! Come on!"},{"name":"HAGANNEE","text":"Unnngh..."},{"name":"ULTHON","text":"Oh no, they're hurt..."},{"name":"ULTHON","text":"I know some simple healing spells. I'll see what I can do."},{"name":"HAGANNEE","text":"A-Amazing! I feel like a new pixie! Ul Thon, I didn't know you could heal so well!"},{"name":"HAGANNEE","text":"I went to pick a flower, but it turned out to be that fiend's head. If it weren't for you, I would be a dead pixie."},{"name":"ULTHON","text":"I merely tended your wounds. It was this mortal here who saved you from the beast."},{"name":"HAGANNEE","text":"Well then, I'm in both your debts! Thank you!"},{"name":"ULTHON","text":"Heh, it's a fine feeling to be thanked... Come, we should head back to Lydha Lran as well."},{"name":"ULTHON","text":"As much as I want to become popular, I never could've braved such dangers alone. Thank you for giving me the courage."},{"name":"ULTHON","text":"Of course, the most important thing is Hagan Nee is safe. And now we can return to the business of making me popular..."},{"name":"ULTHON","text":"Hm? What's this, now?"},{"name":"HAGANNEE","text":"(-Hagan Nee-)I went and told everyone how you helped me. And now everyone wants you to help them too!"},{"name":"HAGANNEE","text":"(-Hagan Nee-)Some are hurt and need healing. Others need a hand harvesting plants in dangerous places. And what's this we hear about you gifting flowers to everyone?"},{"name":"ULTHON","text":"Oh! Of...of course! I'll take care of everyone in turn. The healing, the harvesting, the gifts─everything!"},{"name":"HAGANNEE","text":"(-Hagan Nee-)Great! We'll leave you to it, then!"},{"name":"ULTHON","text":"To have everyone depend on you... This is what it means to be popular. Ahhh, the feeling is even more wonderful than I imagined!"},{"name":"ULTHON","text":"But ugh... In my glee, I didn't stop to consider how much work it will be. Looks like I'll be busy for a while..."},{"name":"ULTHON","text":"You're popular too, yes? Lots of people depend on you?"},{"name":"ULTHON","text":"Tell me, what is it like? Is it tough to have everyone needing something from you?"},{"name":"ULTHON","text":"Gah, I should've known it's not all milk and honey... But this is what I've dreamed of, and I promise to do my best to live up to it!"}],"reward":{"gil":888,"items":[{"id":26843}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68942]},"next":[68967]},"partials":[{"type":"npc","id":"1030838","obj":{"i":1030838,"n":"Ul Thon","l":2956,"q":4}},{"type":"item","id":"26843","obj":{"i":26843,"n":"Deepgold Necklace Coffer (IL 395)","l":1,"c":26565,"t":61}},{"type":"quest","id":"68942","obj":{"i":68942,"n":"Gifts to Gladden","g":116,"l":"Il Mheg","s":2340}},{"type":"quest","id":"68967","obj":{"i":68967,"n":"A New Favorite","g":116,"l":"Il Mheg","s":3210}}]}