{"quest":{"name":"The Path to Popularity","location":"Il Mheg","id":68940,"patch":5.0,"sort":2320,"icon":100853,"unlocksFunction":1,"eventIcon":71341,"issuer":1030838,"target":1030838,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ul Thon has a dream.","Rumors are rife that an interesting mortal has come to Il Mheg, and Ul Thon believes that the individual in question is you. Not given to small talk, they then reveal to you their dream: to become the most popular faerie of all. For the first step, they aim to become the darling of Lydha Lran, and to that end they ask your expert opinion on how to best go about it. Upon deciding that they will seek to impress the other pixies with knowledge, Ul Thon sets off for the Bookman's Shelves, and bids you come along to choose and read tomes to them.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","At the Bookman's Shelves, you find three tomes detailing past events in the region now known as Il Mheg. You read them out to Ul Thon, who reacts with a combination of fascination and puzzlement towards the strange mortal practices mentioned within.","Satisfied with their newfound knowledge, Ul Thon hurries back to Lydha Lran, eager to share it with everyone.","Alas, the other pixies show no interest in the region's history, leaving Ul Thon a picture of dejection.","Though their first effort did not go well, Ul Thon doesn't intend to abandon their aspiration. Yet what must be done if they are to become the darling of Lydha Lran...?"],"objectives":["Examine books at the Bookman's Shelves.","Speak with Ul Thon."],"dialogue":[{"name":"ULTHON","text":"There's talk that an interesting mortal has come to Il Mheg. <span class=\"highlight\">Forename Surname</span> or some such. It's you, isn't it? Don't even think to deny it!"},{"name":"ULTHON","text":"I'm Ul Thon, and it's my dream to become the most popular faerie of all. Why? Because everyone would fawn over me. And that would be really fun!"},{"name":"ULTHON","text":"Now, by way of an achievable first step, I'm aiming to become the darling of Lydha Lran. But everyone is so caught up with their flower-smelling and their mischief-making, they don't even spare me a glance!"},{"name":"ULTHON","text":"You travel to and fro, so you must know much and more about this and that. Tell me, what must I do to become popular?"},{"name":"Q1","text":"What must Ul Thon do to become popular?"},{"name":"A1","text":"Become the cleverest pixie of all!"},{"name":"A2","text":"Become the fairest pixie of all!"},{"name":"A3","text":"Become the strongest pixie of all!"},{"name":"ULTHON","text":"The cleverest? Hmmm, I think I know how I can do that. I just need to read lots of books, right?"},{"name":"ULTHON","text":"I'm <span class=\"emphasis\">already</span> the fairest, I beg your pardon! And besides, we all of us can use glamours to change our appearance. The others won't be impressed simply because I look different."},{"name":"ULTHON","text":"...Ooh, I have it! I might not be able to impress with how I look, but I <span class=\"emphasis\">can</span> impress with what I know! I just need to read lots of books!"},{"name":"ULTHON","text":"The strongest? You mean...I should fight monsters and things? Good heavens, no! We're supposed to be adorable, not savage. I want to stand out, true, but not by doing <span class=\"emphasis\">that</span>."},{"name":"ULTHON","text":"...Ooh, I have it! Rather than try to impress with what I do, I can impress with what I know! I just need to read lots of books!"},{"name":"ULTHON","text":"And it just so happens there are lots of books in Urianger's home, a place called the Bookman's Shelves."},{"name":"ULTHON","text":"Right, I'm going there at once, and you're coming too. I can't read your strange mortal writing, so I need you to do it for me."},{"name":"ULTHON","text":"We pixies don't much like being here. Too dusty and musty and close. So quickly─pick out some books and read them to me!"},{"name":"BOOKA03404","text":"On the occasion of the three hundredth year of the founding of Voeburt, a grand celebration was held in Gruenes Licht. No expense was spared. Over the course of the festivities, guests were lavishly feasted and regaled with wondrous performances."},{"name":"BOOKA03404","text":"Yet amidst all the pomp and pageantry, naught was more stirring than the recitation of the oath of the covenant. In honor of the alliance between Drahn and Galdjent, upon which the kingdom was built, representatives of each race took to the podium. 'Twas a sight to draw tears from all who looked on."},{"name":"ULTHON","text":"Voeburt, Voeburt... Blergh, what strange names you mortals have! Il Mheg sounds much prettier. It means the Kingdom of Rainbows!"},{"name":"BOOKC03404","text":"First week, Thundersday.<br>The princess being partial to the lakefront view, it was decided that all the noble lords and ladies would set out for a picnic."},{"name":"BOOKC03404","text":"Having partaken of sweets, Her Highness ventured to the water, where she inspected her lip paint in the reflection. This caused the watching shepherds to remark that the princess had used the lake as her handmirror."},{"name":"ULTHON","text":"Ooh, there's a Handmirror Lake to the southwest of here! That must be how it got its name! But who would go all that way to the lake just to eat? Yet another silly thing you mortals do."},{"name":"BOOKB03404","text":"Good Jenanna's Grace was named for Her Royal Highness Princess Jenanna, daughter to the king three generations prior."},{"name":"BOOKB03404","text":"In the dark of night, that mountain pass catches the light which shines forth from the castle, giving it the impression of the princess's beautiful eyes of jade."},{"name":"ULTHON","text":"Eyes of jade? That sounds lovely! If the princess were here, I would ask her for them!"},{"name":"ULTHON","text":"Well, I certainly learned lots of new things today─things the others don't know."},{"name":"ULTHON","text":"I'm going to go and share it with everyone! They'll think I'm so clever, I'll surely become the darling of Lydha Lran! Tee hee!"},{"name":"PIXIE03404","text":"Just when we thought Ul Thon was off doing their own thing as usual, they suddenly come and round us up..."},{"name":"ULTHON","text":"Mortal, mortal! I told them about the people from the past, but they weren't the least bit impressed!"},{"name":"PIXIE03404","text":"Well, why should we pay any mind to those who are long dead? Much more fun thinking up new riddles while sipping nectar!"},{"name":"PIXIE03404","text":"Speaking of which, we found this really sweet-smelling flower recently. We were about to go and collect its nectar, if you wanted to join us?"},{"name":"ULTHON","text":"No, no, no! I don't want to join you! I want you to admire me!"},{"name":"PIXIE03404","text":"Stranger and stranger... All right, suit yourself."},{"name":"ULTHON","text":"That didn't work at all... They didn't think any better of me... But I won't give up! Not yet! I'm going to be popular, mark my words!"}],"reward":{"gil":888,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68847]},"next":[68941]},"partials":[{"type":"npc","id":"1030838","obj":{"i":1030838,"n":"Ul Thon","l":2956,"q":4}},{"type":"quest","id":"68847","obj":{"i":68847,"n":"Courting Cooperation","g":8,"l":"Il Mheg","s":330}},{"type":"quest","id":"68941","obj":{"i":68941,"n":"Painting for Praise","g":116,"l":"Il Mheg","s":2330}}]}