{"quest":{"name":"Scents of Security","location":"Il Mheg","id":68944,"patch":5.0,"sort":3001,"eventIcon":71221,"issuer":1027670,"target":1027670,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Iala Oul needs help being reunited with their porxie familiar."],"objectives":["Use the succulent scent on yourself, and then find the porxie familiar.","Capture the porxie familiar.","Deliver the porxie familiar to Iala Oul."],"dialogue":[{"name":"IALAOUL","text":"&lt;sigh&gt; Whatever will I do with that willful thing?"},{"name":"IALAOUL","text":"You see, my porxie familiar flew away and refuses to come back. I've tried to catch it several times now with no joy."},{"name":"IALAOUL","text":"It seems to think we're playing a game and flutters off at the first sight of me. But I daresay a stranger such as you will have better luck. Will you not try to catch it for me? I would of course give you a fitting payment in return."},{"name":"IALAOUL","text":"Here, take this vial of succulent scent and sprinkle it over yourself. The porxie loves the smell, and it should afford you an opening to capture it."},{"name":"IALAOUL","text":"Remember to sprinkle the succulent scent over yourself before you try to catch the porxie. The creature loves the smell, and it should afford you an opening to capture it."},{"name":"SYSTEM","text":"You sprinkle the succulent scent over yourself, and to your amazement, you begin smelling like sausages."},{"name":"FAMILIAR","text":"Oink, oink!"},{"name":"SYSTEM","text":"The porxie appears to be wary of you. Use the succulent scent on yourself to entice the creature."},{"name":"SYSTEM","text":"Your succulent scent has lulled the porxie into a blissful daze. Now is your chance to capture it."},{"name":"IALAOUL","text":"Ah, you're back. Dare I hope you were able to catch my familiar?"},{"name":"IALAOUL","text":"Wonderful! Now I may resume making sausages!"},{"name":"IALAOUL","text":"Oh, lest you misunderstand, we're not eating this fellow. No, we Nu Mou make our sausages from mushrooms, and my porxie helps me to find them."},{"name":"IALAOUL","text":"Besides, porxies are arcane entities brought to life by imbuing clay with magic. Hardly appetizing. But even should they be edible, like ordinary flightless pigs, we wouldn't dream of eating them. Unlike mortals, we Nu Mou cherish our animal friends."},{"name":"IALAOUL","text":"But here is the fitting payment I promised. My thanks, traveler, and take care you aren't devoured out there, succulent as you smell."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68852]}},"partials":[{"type":"npc","id":"1027670","obj":{"i":1027670,"n":"Iala Oul","l":2956,"q":1}},{"type":"quest","id":"68852","obj":{"i":68852,"n":"The Lawless Ones","g":8,"l":"Il Mheg","s":380}}]}