{"quest":{"name":"Gifts to Gladden","location":"Il Mheg","id":68942,"patch":5.0,"sort":2340,"icon":100853,"eventIcon":71221,"issuer":1030838,"target":1030838,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ul Thon needs yet another way to become popular.","Far from ready to give up on becoming popular, Ul Thon looks to you once more for advice. Nodding sagely at your words, they decide upon doing something to make their fellow pixies happy: making them a gift of flowers. To that end, you are tasked with picking the vibrant blossoms that bloom at Timh Gyeus.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You manage to gather a good variety of blossoms, and take them over to Ul Thon.","Pleased with your colorful contribution, Ul Thon says that they will arrange the blossoms in nice containers before presenting them to everyone. It is decided that the amiable pixie will be the first recipient, and together you make your way back to Lydha Lran.","To Ul Thon's delight, the flowers are very well received by the amiable pixie. However, before they can offer the gift to others, two distraught pixies arrive with word of trouble. It appears that a pixie named Hagan Nee is being chased by a monstrous fiend, and if you do not act quickly, they will most certainly meet an unspeakable end."],"objectives":["Pick vibrant blossoms.","Deliver the vibrant blossoms to Ul Thon.","Speak with Ul Thon."],"dialogue":[{"name":"ULTHON","text":"So, we know now that painting pictures isn't enough. If I'm to become the most popular faerie, we must try something else."},{"name":"ULTHON","text":"But what else is there to try? What can I do to be liked by everyone?"},{"name":"Q1","text":"What can Ul Thon do to be liked by everyone?"},{"name":"A1","text":"Do something that makes everyone happy."},{"name":"A2","text":"Change yourself from the inside."},{"name":"ULTHON","text":"Hmmm... If I make everyone happy, then it makes sense that everyone would like me. It can't be something that hinges on individual taste, though..."},{"name":"ULTHON","text":"If I change myself from the inside, then everyone would like me? Hmmm, perhaps I <span class=\"emphasis\">could</span> try to be kinder..."},{"name":"ULTHON","text":"Oh, I know! All pixies love flowers. If I make everyone a gift of flowers, they'll be touched by my kindness. They'd have no choice but to like me!"},{"name":"ULTHON","text":"So, we're going to need flowers, and lots of them. Please help me pick the vibrant blossoms that grow in Il Mheg. The more colors we have, the better!"},{"name":"ULTHON","text":"Please help me pick the vibrant blossoms that grow in Il Mheg. The more colors we have, the better!"},{"name":"ULTHON","text":"I've managed to pick a good many blossoms. How about yourself?"},{"name":"ULTHON","text":"Ooh, red, white, <span class=\"emphasis\">and</span> yellow! Such a lovely array of colors!"},{"name":"ULTHON","text":"Combined, our blossoms shall make the most beautiful gifts! I'll arrange them in nice containers and present them to everyone!"},{"name":"ULTHON","text":"Do you remember the amiable pixie? The one who didn't care for dead people? Well, even among our kind, they're especially fond of flowers, and I've a mind to give them a present first of all."},{"name":"ULTHON","text":"Come, let's head back to Lydha Lran!"},{"name":"PIXIE03404","text":"I've never seen Ul Thon so excited. I wonder what they've got in store this time?"},{"name":"ULTHON","text":"Um, this is a little sudden, but I have a present for you!"},{"name":"PIXIE03404","text":"(-Amiable Pixie-)Oh my, such lovely flowers! And I can truly have them?"},{"name":"ULTHON","text":"Yes, they're for you! I'm giving flowers to everyone in the village, you see."},{"name":"PIXIE03404","text":"(-Amiable Pixie-)Well, how very kind of you! The others will be so pleased!"},{"name":"ULTHON","text":"And...um, after being pleased, do you think they'll like me?"},{"name":"PIXIE03404","text":"(-Amiable Pixie-)They surely will! And to get them excited, I'm going to go and show off my present to everyone!"},{"name":"ULTHON","text":"Tee hee, look how pleased they are! Now I'll finally be popular!"},{"name":"PIXIEC03406","text":"(-???-)There's trouble! Terrible trouble!"},{"name":"PIXIEC03406","text":"(-Panicked Pixie-)It's Hagan Nee! They're being chased by a monstrous fiend!"},{"name":"PIXIEC03406","text":"(-Panicked Pixie-)We wanted to do something, but we were too scared, so we came back to find help!"},{"name":"PIXIEC03406","text":"(-Panicked Pixie-)Please, mortal! Please save Hagan Nee!"},{"name":"ULTHON","text":"Where was it that you saw Hagan Nee?"},{"name":"PIXIEC03406","text":"(-Panicked Pixie-)Um, it was over at the field by the lake..."},{"name":"PIXIED03406","text":"(-Bewildered Pixie-)B-But wait! Hagan Nee was fleeing like there was no tomorrow! They could be anywhere now!"},{"name":"PIXIEC03406","text":"(-Panicked Pixie-)Oh no, you're right! One of us should've stayed behind to keep watch! Whatever will we do!?"},{"name":"ULTHON","text":"Calm down! We'll find Hagan Nee somehow!"},{"name":"ULTHON","text":"You heard them, <span class=\"highlight\">Forename</span>! We have to help Hagan Nee, else they'll become fiend fodder!"}],"reward":{"gil":715},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68941]},"next":[68943]},"partials":[{"type":"npc","id":"1030838","obj":{"i":1030838,"n":"Ul Thon","l":2956,"q":4}},{"type":"quest","id":"68941","obj":{"i":68941,"n":"Painting for Praise","g":116,"l":"Il Mheg","s":2330}},{"type":"quest","id":"68943","obj":{"i":68943,"n":"The Dependable Darling","g":116,"l":"Il Mheg","s":2350}}]}