{"quest":{"name":"A Lawful Trade","location":"Il Mheg","id":68945,"patch":5.0,"sort":3010,"eventIcon":71221,"issuer":1028044,"target":1028044,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Gyuf Daen isn't in the mood for pixie mischief."],"objectives":["Deliver numbcap spores to Jul Feo.","Gather flower seeds.","Deliver the flower seeds to Gyuf Daen."],"dialogue":[{"name":"GYUFDAEN","text":"Gah, what a quandary this is... The mere thought of going makes me wince..."},{"name":"GYUFDAEN","text":"What ails me? I'm supposed to take myself to Lydha Lran to trade, but I have a strong aversion to the pixies and their antics. I realize this is sudden, but won't you go in my stead?"},{"name":"GYUFDAEN","text":"If you are willing, please see this bag of numbcap spores to a pixie named Jul Feo. In return, they should give you some flower seeds."},{"name":"GYUFDAEN","text":"Oh, and if they try any tricks on you, incant the word “law.” It will allow you to exact some small revenge."},{"name":"GYUFDAEN","text":"I pray that you won't have to resort to it, however..."},{"name":"GYUFDAEN","text":"The pixie's name is Jul Feo. Give them the numbcap spores, and you should receive flower seeds in return. If they try any tricks on you, incant the word “law.”"},{"name":"JULFEO","text":"You're late! And there I thought Nu Mou were supposed to be punc─ Wait, you're Feo Ul's sapling! Come on, let's play, let's play!"},{"name":"JULFEO","text":"Oh, the numbcap spores! Tee hee! These are going to be sooo much fun!"},{"name":"JULFEO","text":"I'm going to throw these at other pixies. And do you know what will happen? It'll make them go numb all over! They won't be able to move a finger! Ahahaha!"},{"name":"JULFEO","text":"Ah, but I mustn't forget my side of the bargain. You may collect your bags of flower seeds from the fields. I've taken the liberty of leaving them here, there, and everywhere!"},{"name":"JULFEO","text":"After all, I never made any promises about handing the seeds to you here! Tee hee hee!"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Incant the word “law.”"},{"name":"A1","text":"Exercise forbearance."},{"name":"JULFEO","text":"Uwaaaaaah! It tingles, it prickles, it stings! All right, I'm sorry, I'm sorry!"},{"name":"JULFEO","text":"Tee hee! Lovely doing business, and send my regards to the good folk of Pla Enni!"},{"name":"JULFEO","text":"Hm? Shouldn't you be collecting your flower seeds? If you take too long, they might sprout where they lie."},{"name":"GYUFDAEN","text":"Ah, you've returned. Do you have the flower seeds?"},{"name":"GYUFDAEN","text":"Six bags of seeds as agreed upon. Excellent. I won't ask whether you had to incant the word, but I hope the experience wasn't too troublesome."},{"name":"GYUFDAEN","text":"Lest you wonder, from these seeds we will extract an oil for use in food and medicine. In the old days, we traded with the men of Voeburt for it, but now we must turn to the pixies. &lt;sigh&gt;"},{"name":"GYUFDAEN","text":"Yet though they can be vexing neighbors, the pixies play an important role in the protection of Il Mheg. We must learn to live with each other for the common good. But I digress. My thanks for your help. Please accept this as fitting payment."}],"reward":{"gil":976},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68852]}},"partials":[{"type":"npc","id":"1028044","obj":{"i":1028044,"n":"Gyuf Daen","l":2956,"q":1}},{"type":"quest","id":"68852","obj":{"i":68852,"n":"The Lawless Ones","g":8,"l":"Il Mheg","s":380}}]}