{"quest":{"name":"Magic Is Love, Magic Is Life","location":"Il Mheg","id":68952,"patch":5.0,"sort":3080,"eventIcon":71221,"issuer":1027673,"target":1027673,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ose Sigun wants to initiate their child into the ways of magic."],"objectives":["Slay a moss fungus for its leg.","Slay a witchweed for its thorn.","Deliver the materials to the Nu Mou weaponsmith.","Report to Ose Sigun."],"dialogue":[{"name":"OSESIGUN","text":"Mortal, will you not undertake a task for me? You see, the time has come for my child to be initiated into the ways of magic, and I wish to have a staff fashioned for them."},{"name":"OSESIGUN","text":"However, some of the materials needed can only be had from dangerous beasts. I'm given to understand that you're strong, and so I would entrust the hunting to you."},{"name":"OSESIGUN","text":"If you are up to the task, what I require is the leg of a moss fungus and the thorn of a witchweed. Once you have these items, please take them to our weaponsmith."},{"name":"OSESIGUN","text":"What I require is the leg of a moss fungus and the thorn of a witchweed. Once you have these items, please take them to our weaponsmith."},{"name":"ARTISANNUMOU03416","text":"Yes, yes, I've been expecting you. Come, let's see those materials, then."},{"name":"ARTISANNUMOU03416","text":"Ah, this is fine quality stuff. With these, I have everything I need. Let Ose Sigun know that I will set to work on the training staff at once."},{"name":"ARTISANNUMOU03416","text":"I have all the materials I need. Let Ose Sigun know that I will set to work on the training staff at once."},{"name":"OSESIGUN","text":"The weaponsmith works on the staff as we speak, you say? Ah, to think that my child will soon take their first steps as a mage... It brings a tear to the eye."},{"name":"OSESIGUN","text":"You may have heard that we Nu Mou are magically blessed. Indeed, many among us are talented in spellcraft, but what manner of spells we excel at depends upon such things as personality and upbringing."},{"name":"OSESIGUN","text":"I myself have always been woeful with battle magicks, but my child may yet wreak havoc where I could not. I keenly look forward to witnessing their development in the coming years!"},{"name":"OSESIGUN","text":"So you see, the journey into magic is an important aspect of a Nu Mou's life. You may take pride in having helped to set a child on their course...and also in accepting this fitting payment for your service!"}],"reward":{"gil":876},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68852]}},"partials":[{"type":"npc","id":"1027673","obj":{"i":1027673,"n":"Ose Sigun","l":2956,"q":2}},{"type":"quest","id":"68852","obj":{"i":68852,"n":"The Lawless Ones","g":8,"l":"Il Mheg","s":380}}]}