{"quest":{"name":"In His Mistress's Memory","location":"Il Mheg","id":68956,"patch":5.0,"sort":3270,"eventIcon":71221,"issuer":1027693,"target":1027693,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Nimbus needs a nimble hand to pick a flower."],"objectives":["Pick a flower.","Deliver the flower to Nimbus."],"dialogue":[{"name":"NIMBUS","text":"Ghrrr... If you've a moment to spare, I've a favor to ask of you."},{"name":"NIMBUS","text":"Seldom as we see men here, I wish to take advantage of your adroit appendages while I can."},{"name":"NIMBUS","text":"In Longmirror Lake, there grow many beautiful flowers. I want you to pick one for me."},{"name":"NIMBUS","text":"It matters not which color─I will trust to your instincts. My thanks in advance."},{"name":"NIMBUS","text":"Amaro maws aren't made to handle such delicate things as flowers. I would only tear it to pieces. So please, go to Longmirror Lake and pick one for me."},{"name":"SYSTEM","text":"Pick the blue flower?"},{"name":"SYSTEM","text":"Pick the yellow flower?"},{"name":"SYSTEM","text":"Pick the pink flower?"},{"name":"NIMBUS","text":"Ah, a lovely blue flower! I shall make an offering of it to my dear mistress. It reminds me of the time we journeyed to Lakeland and beheld the Source for the first time."},{"name":"NIMBUS","text":"Ah, a lovely yellow flower! I shall make an offering of it to my dear mistress. It reminds me of the time we journeyed to Amh Araeng and beheld the wall of Light for the first time."},{"name":"NIMBUS","text":"Ah, a lovely pink flower! I shall make an offering of it to my dear mistress. It reminds me of the time we journeyed to Amh Araeng and beheld its solemn-yet-beauteous landscape for the first time."},{"name":"NIMBUS","text":"Unlike some others, my mistress didn't look upon those amaro who could talk with mistrust. She treated me as not simply her beast of burden, but a friend, and together we embarked on many grand adventures."},{"name":"NIMBUS","text":"But we amaro live far longer than men do. Sensing that her time was near, she left my side, not wanting me to witness her life fading away."},{"name":"NIMBUS","text":"But to this day, a part of me wants to believe that she's still somewhere out there. That one day she'll return, and we'll go on adventures as we once did."},{"name":"NIMBUS","text":"And so I remain in this place, where last I saw her. It's been thirty years now..."},{"name":"NIMBUS","text":"In my heart of hearts I know she's gone. But so long as I live, I'll remember my kind and gentle mistress, who so loved beautiful things. I hope that this flower will bring her joy, wherever she may be."}],"reward":{"gil":804},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68854]},"next":[68961]},"partials":[{"type":"npc","id":"1027693","obj":{"i":1027693,"n":"Nimbus","l":2956,"q":1}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}},{"type":"quest","id":"68961","obj":{"i":68961,"n":"In His Mistress's Name","g":116,"l":"Il Mheg","s":3280}}]}