{"quest":{"name":"A Tale of a Tail","location":"Il Mheg","id":68958,"patch":5.0,"sort":3140,"eventIcon":71221,"issuer":1027694,"target":1027694,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kenn Beq is feeling every one of his years."],"objectives":["Slay a green glider for its tail.","Deliver the green glider tail to Kenn Beq."],"dialogue":[{"name":"KENNBEQ","text":"Ah, if it isn't a young one, fairly bursting with vigor. Will you not hear the plea of this tired old amaro?"},{"name":"KENNBEQ","text":"To the south of Wolekdorf, there abide winged lizards known as green gliders. I would be grateful if you hunt one and bring me its tail."},{"name":"KENNBEQ","text":"As many winters as I've seen, I no longer have the agility to chase them down. Rest assured you will not go unrewarded for your troubles."},{"name":"KENNBEQ","text":"Green gliders are known to inhabit the area to the south of here. If you could bring me its tail, I would be grateful."},{"name":"KENNBEQ","text":"Ah, the young one returns from the hunt."},{"name":"KENNBEQ","text":"Oho, such a plump, juicy tail this is! Thank you, thank you. These are a favorite of mine."},{"name":"KENNBEQ","text":"Before I came to be here, I was in Lakeland. There I lived amidst men for many years."},{"name":"KENNBEQ","text":"In the time before the Flood, a great battle was joined at the Source. With my master upon my back, I charged into the fray against the forces of the Shadowkeeper."},{"name":"KENNBEQ","text":"Countless many fell that day. Though I was fortunate to escape with my life, I did not escape wholly unscathed, taking grievous wounds at the hands of enemy soldiers who had assumed wolflike forms."},{"name":"KENNBEQ","text":"Such were my injuries, it was believed I would never walk again, never mind fly. Yet my master never forsook me. He nursed me back to health, feeding me a nutritious diet of green glider tails, and I eventually made a full recovery."},{"name":"KENNBEQ","text":"Seeing the tail now, I cannot help but be reminded of those golden days. The days I spent with the elvenfolk. Thank you, young one, for giving me the chance to relive them."}],"reward":{"gil":804},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68854]}},"partials":[{"type":"npc","id":"1027694","obj":{"i":1027694,"n":"Kenn Beq","l":2956,"q":1}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}}]}