{"quest":{"name":"Not All Pixies","location":"Il Mheg","id":68959,"patch":5.0,"sort":3150,"eventIcon":71221,"issuer":1031203,"target":1031203,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Something appears to be weighing on An Sul's mind."],"objectives":["Speak with the talkative amaro.","Speak with Daen Kenn and obtain a Nu Mou blanket.","Deliver the Nu Mou blanket to the talkative amaro.","Report to An Sul."],"dialogue":[{"name":"ANSUL","text":"Traveler, please lend an ear to my tale. Something is afoot that gives me cause for concern."},{"name":"ANSUL","text":"Of late, a friend of mine has been meeting pixies in secret, and I fear that he is being subjected to their mischief."},{"name":"ANSUL","text":"When I confront him about it, he insists that all is well. Yet I find myself not comforted. Strange as it may sound, if he won't open up to a friend, perhaps he might do so to a stranger."},{"name":"ANSUL","text":"He left the settlement a short while ago and headed towards Lyhe Ghiah. Please, will you not seek him out and have words with him?"},{"name":"ANSUL","text":"My friend should be over by Lyhe Ghiah at this moment. Please, have words with him and find out whether he is indeed being subjected to the pixies' mischief."},{"name":"FRIENDAMARO03423","text":"Hm? Aren't you one of the men they say is visiting Il Mheg? Is there something you require of me?"},{"name":"FRIENDAMARO03423","text":"...Are the pixies subjecting me to mischief? Good heavens, no! While these little ones do enjoy themselves, I assure you I am not the worse for it!"},{"name":"FRIENDAMARO03423","text":"They come to me to hear stories of the past. And as you can see, this particular session has come to an end. They're adorable when they're sleeping, are they not?"},{"name":"FRIENDAMARO03423","text":"As they are, though, they are liable to catch a chill. Might I trouble you to go to Pla Enni to borrow a blanket? I will remain here and keep watch in the meantime."},{"name":"FRIENDAMARO03423","text":"When you arrive in Pla Enni, seek out Daen Kenn. They should be able to furnish you with the blanket to keep the little ones warm."},{"name":"DAENKENN","text":"Something about your demeanor bespeaks a request unmade. Have I the right of it?"},{"name":"DAENKENN","text":"A blanket, you say? But of course I should be happy to lend it. As for a fitting payment... Tell our friend I ask that he bears me atop the waterfall."},{"name":"DAENKENN","text":"May the blanket serve you well, and tell our friend I look forward to being borne atop the waterfall."},{"name":"FRIENDAMARO03423","text":"There you are. I trust you have the blanket?"},{"name":"FRIENDAMARO03423","text":"Wonderful, I shall lay it over the pixies. Did Daen Kenn perchance mention a payment?"},{"name":"FRIENDAMARO03423","text":"...They wish to be borne atop the waterfall? I know not their interest in such a place, but very well, I shall do as asked."},{"name":"FRIENDAMARO03423","text":"Now then, allow me to tell you more about these little ones."},{"name":"FRIENDAMARO03423","text":"They are not of Lydha Lran, and unlike most of their kind, they do not share the penchant for mischief. They simply like to hear stories of the past, and I am happy to oblige."},{"name":"FRIENDAMARO03423","text":"So, as you can see, I am in neither danger nor discomfort. Please assure An Sul as much."},{"name":"FRIENDAMARO03423","text":"As you can see, I am in neither danger nor discomfort. Please assure An Sul as much."},{"name":"ANSUL","text":"...So that is the way of it. Full glad am I to know that my worries were unfounded."},{"name":"ANSUL","text":"Thank you for setting my mind at ease. This isn't much, but please accept it as a token of my gratitude."}],"reward":{"gil":1147,"items":[{"num":2,"id":27862}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68854]}},"partials":[{"type":"npc","id":"1031203","obj":{"i":1031203,"n":"An Sul","l":2956,"q":1}},{"type":"item","id":"27862","obj":{"i":27862,"n":"Pixie Apple Pie","l":403,"c":24079,"t":46}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}}]}