{"quest":{"name":"A Leafman and a Hero","location":"Il Mheg","id":68951,"patch":5.0,"sort":3070,"eventIcon":71221,"issuer":1030699,"target":1030699,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The soft-spoken Nu Mou has a request for a traveler."],"objectives":["Place the polished sword before the leafman near Lyhe Ghiah.","Report to the soft-spoken Nu Mou."],"dialogue":[{"name":"QUIETNUMOU03415","text":"Mortal, I have a task for you, should you be willing."},{"name":"QUIETNUMOU03415","text":"By the shore of the isle from which Lyhe Ghiah rises, there is a leafman. I want you to go and lay this sword before it. Do this for me, and I will give you a fitting reward."},{"name":"QUIETNUMOU03415","text":"On the isle from which Lyhe Ghiah rises, there is a leafman. Please go and place the sword before it."},{"name":"QUIETNUMOU03415","text":"You've placed the sword? My thanks."},{"name":"QUIETNUMOU03415","text":"Lest you wonder, that leafman was once a knight of Voeburt. A valiant soul who remained to protect the castle from sin eaters while others fled around him."},{"name":"QUIETNUMOU03415","text":"While he fought bravely, he was ultimately wounded by a creature with the touch. But ere he could turn into a monster, a pixie transformed him into a leafman."},{"name":"QUIETNUMOU03415","text":"Callous though they can be, pixies can understand the desire to protect one's home. That's why they took pity on the knight and spared him a fate worse than death."},{"name":"QUIETNUMOU03415","text":"I was there too. But frozen by fear as I was, I could do naught but watch. Ashamed, I swore to the knight that, one day, I will find a way to cure him."},{"name":"QUIETNUMOU03415","text":"Until that day comes, I look after his sword, ensuring that it's always ready for his use again."},{"name":"QUIETNUMOU03415","text":"To be sure, I could have as easily taken the sword back myself, but I wanted you to know of the knight and his sacrifice. He also would've enjoyed the company of a fellow mortal, I believe."}],"reward":{"gil":803,"items":[{"num":2,"id":27860}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68852]}},"partials":[{"type":"npc","id":"1030699","obj":{"i":1030699,"n":"Soft-spoken Nu Mou","l":2956,"q":1}},{"type":"item","id":"27860","obj":{"i":27860,"n":"Baguette","l":403,"c":24030,"t":46,"p":3501}},{"type":"quest","id":"68852","obj":{"i":68852,"n":"The Lawless Ones","g":8,"l":"Il Mheg","s":380}}]}