{"quest":{"name":"One Good Trick Deserves Another","location":"Il Mheg","id":68950,"patch":5.0,"sort":3060,"eventIcon":71221,"issuer":1030700,"target":1030700,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The vengeful Nu Mou is bent on revenge."],"objectives":["Deliver the mock ancient texts to the pixies.","Report to the vengeful Nu Mou."],"dialogue":[{"name":"ANGRYNUMOU03414","text":"Grrr, those accursed pixies! I never should've trusted them!"},{"name":"ANGRYNUMOU03414","text":"I asked them for sheep's milk. They demanded their payment first, and against my better judgment, I gave it to them. I've not seen neither hide nor hair of them since!"},{"name":"ANGRYNUMOU03414","text":"But they will rue the day they cheated this Nu Mou! I'll get my revenge─with your help, mortal!"},{"name":"ANGRYNUMOU03414","text":"Your task is simple. Take these mock ancient texts I've prepared and give them to the pixies. The rest should play out by itself, and I will have my revenge─and you your fitting payment!"},{"name":"ANGRYNUMOU03414","text":"And if the pixies think to ask where the texts come from, just say that you found it at the Church at Dammroen Field."},{"name":"ANGRYNUMOU03414","text":"Please find the cheating pixies and give them the mock ancient texts. The rest should play out by itself, and I will have my revenge─and you your fitting payment!"},{"name":"EARHUSTLERPIXIEA03414","text":"Hm? You wish to give me something, you say?"},{"name":"EARHUSTLERPIXIEA03414","text":"Ooh, it says here there's a secret flower garden! And the way will be revealed if one makes an offering of sheep's milk to the leafman north of here!"},{"name":"EARHUSTLERPIXIEA03414","text":"Tee hee, I must go and tell everyone...right after I've had my fill of the garden!"},{"name":"EARHUSTLERPIXIEB03414","text":"Well now, what's a mortal doing here?"},{"name":"EARHUSTLERPIXIEB03414","text":"This was at the church? Let's see, now... &lt;gasp&gt; It tells you the way to get to a secret garden!"},{"name":"EARHUSTLERPIXIEB03414","text":"All you need is sheep's milk, and it just so happens we have the extra we didn't give the Nu Mou! I'll go and test it out at once!"},{"name":"ANGRYNUMOU03414","text":"You gave the pixies the texts, and they believed it? Hah hah hah! Such sweet revenge!"},{"name":"ANGRYNUMOU03414","text":"Here, mortal─the fitting payment for your excellent service! Now, if you'll excuse me, I have sheep's milk to collect!"}],"reward":{"gil":803},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68852]}},"partials":[{"type":"npc","id":"1030700","obj":{"i":1030700,"n":"Vengeful Nu Mou","l":2956,"q":1}},{"type":"quest","id":"68852","obj":{"i":68852,"n":"The Lawless Ones","g":8,"l":"Il Mheg","s":380}}]}