{"quest":{"name":"In His Mistress's Name","location":"Il Mheg","id":68961,"patch":5.0,"sort":3280,"eventIcon":71221,"issuer":1027656,"target":1027656,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Oul Sigun is eager to show you something."],"objectives":["Deliver the silver medallion to Nimbus.","Speak with Oul Sigun."],"dialogue":[{"name":"OULSIGUN","text":"Look what I found! A silver medallion! It was lying near a leafman on the other side of Il Mheg."},{"name":"OULSIGUN","text":"There's a name engraved in it: Nimbus. Doesn't much sound like a mortal. An amaro, perhaps? Do you happen to know a creature by that name?"},{"name":"OULSIGUN","text":"You do!? Well then, you must deliver it to him in Wolekdorf. Here!"},{"name":"OULSIGUN","text":"What a coincidence that you should know this Nimbus. See that the medallion is delivered to him!"},{"name":"NIMBUS","text":"Hm? You have something for me, you say?"},{"name":"NIMBUS","text":"&lt;gasp&gt; Th-This medallion belonged to my mistress! Though it is faded, her name is engraved on it too, next to mine. Wherever did you find this!? Could it be...could it be you met her!?"},{"name":"NIMBUS","text":"...I see. Deep down I knew it was silly, but for a moment I couldn't help but hope."},{"name":"NIMBUS","text":"Yet to have this medallion brings me great comfort. 'Tis as if my feelings have reached my mistress, and she makes a gift of it to me."},{"name":"NIMBUS","text":"I swear I will keep it safe. Please pass my heartfelt thanks to the pixie who found it."},{"name":"OULSIGUN","text":"Nimbus has the medallion? Wonderful! My friend will be so pleased to hear this!"},{"name":"OULSIGUN","text":"Who's my friend, you ask? Why, the leafman next to whom I found the medallion. If she was indeed Nimbus's mistress, she would have wanted him to have it. Here's a little something for helping to reunite them!"}],"reward":{"gil":904},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68856,68956]}},"partials":[{"type":"npc","id":"1027656","obj":{"i":1027656,"n":"Oul Sigun","l":2956,"q":2}},{"type":"quest","id":"68856","obj":{"i":68856,"n":"Acht-la Ormh Inn","g":8,"l":"Il Mheg","s":420}},{"type":"quest","id":"68956","obj":{"i":68956,"n":"In His Mistress's Memory","g":116,"l":"Il Mheg","s":3270}}]}