{"quest":{"name":"A Gift in Advance","location":"Il Mheg","id":68960,"patch":5.0,"sort":3160,"eventIcon":71221,"issuer":1031204,"target":1031204,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Iala Jul has a request for a child of man."],"objectives":["Defeat either a rabbit's tail, a tot aevis, or a phooka.","Speak with Iala Jul."],"dialogue":[{"name":"EGGAMARO03424","text":"Well, that a child of man should appear at this moment! This little one is fortunate indeed."},{"name":"EGGAMARO03424","text":"I have the honor of watching over the life forming within this egg. It will be a happy day when it finally comes out into the world. Alas, it is not like to grow up knowing men, and that thought saddens me."},{"name":"EGGAMARO03424","text":"But I have an idea. If you can spare the time, will you not bring me something warm with which to line yonder nest?"},{"name":"EGGAMARO03424","text":"The fleece of a rabbit's tail, the feathers of a tot aevis, or the pelt of a phooka─any one of these shall serve."},{"name":"EGGAMARO03424","text":"Please, bring me either the fleece of a rabbit's tail, the feathers of a tot aevis, or the pelt of a phooka. I will use it to line yonder nest."},{"name":"EGGAMARO03424","text":"Welcome back. So, what did you bring?"},{"name":"EGGAMARO03424","text":"Ah, the fleece of a rabbit's tail. While it is no secret whence it derives its name, the creature is shrouded in mystery thick as its fleece."},{"name":"EGGAMARO03424","text":"Ah, the feathers of a tot aevis. While the creature's appearance cannot be said to be pleasant, its feathers provide unrivaled warmth."},{"name":"EGGAMARO03424","text":"Ah, the pelt of a phooka. You have done well to obtain this. When I gaze into the creature's eyes, I feel as though I am gazing into madness."},{"name":"EGGAMARO03424","text":"Thank you, this shall make an excellent lining for the nest. And when the little one is born, I will be certain to tell it the tale of your visit and your gift."},{"name":"EGGAMARO03424","text":"It will bring it great joy to have a connection to a child of man, this I know. Please accept this by way of gratitude."}],"reward":{"gil":804},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68854]}},"partials":[{"type":"npc","id":"1031204","obj":{"i":1031204,"n":"Iala Jul","l":2956,"q":1}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}}]}