{"quest":{"name":"Hide and Seek","location":"Il Mheg","id":68962,"patch":5.0,"sort":3290,"eventIcon":71221,"issuer":1031521,"target":1031521,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The waiting pixie is sick and tired of waiting."],"objectives":["Speak with the seeking pixie.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Beaver” to let the hiding pixie know that the game is up.","Report to the seeking pixie.","Report to the waiting pixie."],"dialogue":[{"name":"WAITINGPIXIE03426","text":"Grrr, I am so angry right now! My friends promised that we'd play together here, but not one of them have come!"},{"name":"WAITINGPIXIE03426","text":"Instead they're over in Anden's Airs, playing hide-and-seek! That's the only game they ever play, hmph!"},{"name":"WAITINGPIXIE03426","text":"I want you to march over there and give them a good scolding for me! You're respected in our village, so they'll take your words to heart!"},{"name":"WAITINGPIXIE03426","text":"The others are over in Anden's Airs, playing hide-and-seek! Go over there and give them a good scolding for me!"},{"name":"KAKUREPIXIE03426","text":"...A promise? I don't recall a─<br>Ahhh! We completely forgot! Oh, we're so sorry!"},{"name":"KAKUREPIXIE03426","text":"We would go with you right now, but we're in the midst of a game of hide-and-seek. One of us is still hiding, and we can't well leave them behind. Will you help us search?"},{"name":"KAKUREPIXIE03426","text":"Thank you! Now, when you find them, you must say the word “beaver.” It's the rules!"},{"name":"KAKUREPIXIE03426","text":"Right, let's get to it!"},{"name":"KAKUREPIXIE03426","text":"Our last hiding friend should be somewhere nearby. Remember, when you find them, you must say the word “beaver.” It's the rules!"},{"name":"SYSTEM","text":"Beaver"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Beaver” to let the hiding pixie know that the game is up."},{"name":"BIBAPIXIE03426","text":"(Shhh! Can't you see I'm trying to hide!?)"},{"name":"BIBAPIXIE03426","text":"Oh no, I am found!<br>...Wait, aren't you <span class=\"highlight\">Forename</span>!? I didn't know you were playing too! This makes it even more fun, tee hee!"},{"name":"BIBAPIXIE03426","text":"Tee hee, it was so fun being found by you! You must play hide-and-seek with us again!"},{"name":"KAKUREPIXIE03426","text":"You did well to find our hiding friend! We would never have thought to look there!"},{"name":"KAKUREPIXIE03426","text":"But come, it wouldn't do to keep our waiting friend waiting any longer. They aren't the most patient of pixies."},{"name":"WAITINGPIXIE03426","text":"The others finally came, thanks to you! But what's this I hear about you playing hide-and-seek with them?"},{"name":"WAITINGPIXIE03426","text":"That's not fair! I want to be found by you too! Promise me you'll play with us again soon!"}],"reward":{"gil":852},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68856]}},"partials":[{"type":"npc","id":"1031521","obj":{"i":1031521,"n":"Waiting Pixie","l":2956,"q":1}},{"type":"quest","id":"68856","obj":{"i":68856,"n":"Acht-la Ormh Inn","g":8,"l":"Il Mheg","s":420}}]}