{"quest":{"name":"The Key Ingredient","location":"Il Mheg","id":68966,"patch":5.0,"sort":3201,"icon":100854,"eventIcon":71221,"issuer":1030716,"target":1031027,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tonatiuh is fairly champing at the bit for the fae lamp.","Eager to obtain the last of the three requested items, the fae lamp, Tonatiuh turns his steps to Lydha Lran to treat with the pixies.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","At Lydha Lran, you meet with a pixie named Wyd Lor, who offers to give you what you seek in exchange for playing with them. Without ado, they beckon you to follow them outside the village that the fun might begin.","Noting that mortals tend to have trouble identifying their kind, Wyd Lor has decided to make a game of it. Three identical-looking pixies will come before you, and you must guess which is the real Wyd Lor. The correct answer will earn you a fae lamp.","Thanks to Tonatiuh's superior sense of smell, you succeed in guessing the real Wyd Lor and winning the fae lamp. With all three items now in your possession, you and the young amaro make your way back to Wolekdorf to settle the debt with the aggrieved Nu Mou.","The aggrieved Nu Mou takes receipt of the three items, and by this fitting reparation is aggrieved no more. The revelation that porxies are made of clay turns Tonatiuh's stomach, but he is thankful to put this episode behind him. Lastly, Sandman officially bids him welcome to the flock, and the young amaro looks forward to spending his days in peace and quiet in Wolekdorf."],"objectives":["Speak with the pixies of Lydha Lran.","Speak with Wyd Lor.","Deliver the fae lamp to the aggrieved Nu Mou."],"dialogue":[{"name":"SANDMAN","text":"So, that's a bottle of pristine water, a lump of fine clay, and a fae lamp. Please help Tonatiuh gather these things."},{"name":"ANGRYNUMOU03428","text":"Now that Tonatiuh is a denizen of Wolekdorf, the three items I requested shall suffice by way of reparation."},{"name":"TONATIUH","text":"Lydha Lran─that's where the pixies live, right? I hope they are willing to give us a lamp..."},{"name":"TONATIUH","text":"This pixie says they have lots of lamps."},{"name":"WYDLOR","text":"You want a fae lamp? I've got them! Oh yes, lots and lots!"},{"name":"WYDLOR","text":"And I'd be happy to part with one...for a price! Can't just give it to you for nothing, you know? It wouldn't be fair."},{"name":"TONATIUH","text":"So...what do you want for the lamp?"},{"name":"WYDLOR","text":"Why, what we always want, of course: fun! If you play with us, we'll give you your heart's desire!"},{"name":"WYDLOR","text":"Tee hee, I have a new plaything─er, a playmate! Come with me outside the village, and we'll have lots of fun together!"},{"name":"TONATIUH","text":"Er...which one was it that we spoke with?"},{"name":"WYDLOR","text":"Tee hee, we're like triplets, yes? You mortals always have trouble telling us apart, so we're going to make a game of it!"},{"name":"WYDLOR","text":"In this game, you must guess who is the real Wyd Lor. That's yours truly!"},{"name":"WYDLOR","text":"You'll get a single hint, and if you answer correctly, I'll give you a fae lamp. Whenever you're ready, now!"},{"name":"FAKEPIXIE03430A","text":"(-First Wyd Lor-)Let me tell you a little secret: I'm not Wyd Lor. No, the third one of us is!"},{"name":"WYDLOR","text":"(-Second Wyd Lor-)Hmmm? You think I'm the real Wyd Lor, do you? Well, you couldn't be more wrong!"},{"name":"FAKEPIXIE03430B","text":"(-Third Wyd Lor-)<span class=\"emphasis\">I</span> am the real Wyd Lor. Search your feelings; you know it to be true."},{"name":"WYDLOR","text":"(-Wyd Lors-)And now, for the all-important hint: all three of us are notorious liars! So, which of us is the real Wyd Lor?"},{"name":"TONATIUH","text":"What? Then everything they said was backwards! Ugh, this is too confusing..."},{"name":"TONATIUH","text":"There's one thing I'm sure about, though. When we first spoke with Wyd Lor, it was in a field of flowers. The first pixie didn't smell like flowers at all."},{"name":"TONATIUH","text":"If you consider that along with the hint, perhaps you can come up with the correct answer. Which one do think is the real Wyd Lor?"},{"name":"Q1","text":"Which pixie is the real Wyd Lor?"},{"name":"A1","text":"The first one!"},{"name":"A2","text":"The second one!"},{"name":"A3","text":"The third one!"},{"name":"A4","text":"I'm not sure... Can we start again?"},{"name":"TONATIUH","text":"Do you think so? Something about it feels wrong... Perhaps we should hear what they have to say from the beginning."},{"name":"WYDLOR","text":"What!? How did you─!? It was supposed to be <span class=\"emphasis\">hard</span>!"},{"name":"WYDLOR","text":"&lt;sigh&gt; And we were so looking forward to seeing you rack your brains..."},{"name":"WYDLOR","text":"Oh well, a promise is a promise. You guessed correctly, so I will give you a lamp."},{"name":"TONATIUH","text":"Huzzah, now we have everything! Let's hurry back to Wolekdorf!"},{"name":"WYDLOR","text":"You're still here? I thought you and your amaro friend had business in Wolekdorf."},{"name":"TONATIUH","text":"I've handed over the water and the clay. Go on and give them the lamp."},{"name":"ANGRYNUMOU03428","text":"I have taken receipt of the pristine water and the fine clay. I'm told the fae lamp is with you?"},{"name":"ANGRYNUMOU03428","text":"Excellent! Now I can fashion myself a new porxie!"},{"name":"TONATIUH","text":"Fashion a new porxie?"},{"name":"ANGRYNUMOU03428","text":"Just so! It's quite simple, really. Make the body using clay and water, imbue it with magic from the lamp, and voilà─a porxie is born!"},{"name":"ANGRYNUMOU03428","text":"I am well satisfied now. All is forgiven and forgotten. Till next time, friends!"},{"name":"TONATIUH","text":"Porxies are made...of clay? Ungh... I don't feel so good all of a sudden..."},{"name":"TONATIUH","text":"In any case, all's well that ends well. I can't thank you both enough."},{"name":"SANDMAN","text":"I'm pleased to have been of service. Now then, Tonatiuh─on behalf of all the amaro of Wolekdorf, I bid you welcome to the flock."},{"name":"TONATIUH","text":"I've never been with a flock before, and there's much that I don't know. But I'll try my hardest to live up to expectations."},{"name":"SANDMAN","text":"Haha, no need to be so stiff, young one. Remember, we are all friends here, brought together by our awakening."},{"name":"SANDMAN","text":"In the distant past, our ancestors were given the gift of intelligence through magic. Though that magic has long faded, it wrought a change in our kind that may occasionally manifest─in the form of amaro such as ourselves."},{"name":"SANDMAN","text":"We amaro were created to serve men. Many of us form enduring bonds with our masters and mistresses. However, we live far longer than they do, and thus it is our lot to experience the sorrow of parting."},{"name":"SANDMAN","text":"But those of us who are left behind, who are worn down by grief, may yet find solace─here in Wolekdorf."},{"name":"SANDMAN","text":"I have lost full many masters, as has everyone in the flock. I know their pain, and they mine."},{"name":"SANDMAN","text":"This settlement brings us all together that we might support one another and live in peace. In time, I hope that you will come to think of it as your home."},{"name":"TONATIUH","text":"Home... I like the sound of that. Thank you, Sandman. For everything."}],"reward":{"gil":1123,"items":[{"num":2,"id":27857,"one":1},{"num":2,"id":27858,"one":1},{"num":2,"id":27859,"one":1},{"num":2,"id":27860,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68965]},"next":[68967]},"partials":[{"type":"npc","id":"1030716","obj":{"i":1030716,"n":"Tonatiuh","l":2956,"q":2}},{"type":"npc","id":"1031027","obj":{"i":1031027,"n":"Aggrieved Nu Mou","l":2956,"q":1}},{"type":"item","id":"27857","obj":{"i":27857,"n":"Spaghetti al Nero","l":400,"c":24027,"t":46}},{"type":"item","id":"27858","obj":{"i":27858,"n":"Broad Bean Salad","l":400,"c":24207,"t":46,"p":3453}},{"type":"item","id":"27859","obj":{"i":27859,"n":"Grilled Platinum Bream","l":400,"c":24301,"t":46}},{"type":"item","id":"27860","obj":{"i":27860,"n":"Baguette","l":403,"c":24030,"t":46,"p":3501}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68965","obj":{"i":68965,"n":"By Way of Reparation","g":116,"l":"Il Mheg","s":3190}},{"type":"quest","id":"68967","obj":{"i":68967,"n":"A New Favorite","g":116,"l":"Il Mheg","s":3210}}]}