{"quest":{"name":"Duplicity in the Depths","location":"Il Mheg","id":68968,"patch":5.0,"sort":3220,"eventIcon":71221,"issuer":1031179,"target":1031179,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Thon An would entrust you with a map."],"objectives":["Search for the piece of evidence in the vicinity of Deepwood Swim.","Deliver the Voeburtite lockbox to Thon An."],"dialogue":[{"name":"THONAN","text":"Ah, a traveler comes who has the air of dependability about <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>. Look upon this map, if you will. It belonged to my master, a knight of Voeburt, and it points to a piece of evidence in a matter that he was investigating."},{"name":"THONAN","text":"Alas, my master is long dead, and the place indicated upon the map lies drowned beneath Longmirror Lake. We amaro are not made for the water and I am unable to reach this place. If you consider yourself a strong swimmer, will you not search in my stead?"},{"name":"THONAN","text":"I am in your debt. The place you seek is in the vicinity of Deepwood Swim. Please dive down there and see what you find."},{"name":"THONAN","text":"The place you seek is in the vicinity of Deepwood Swim. Please dive down there and see what you find."},{"name":"THONAN","text":"Ah, you are returned. Were you able to find anything?"},{"name":"THONAN","text":"Hmmm, an ordinary lockbox at a glance. Perhaps the evidence is within. I have not the appendages with which to open it, so please do the honors."},{"name":"SYSTEM","text":"With a little exertion, the lid comes loose to reveal a piece of parchment, timeworn but miraculously untouched by water. The contents can clearly be made out."},{"name":"THONAN","text":"This is a letter, bearing the symbol of Voeburt's royal mages and addressed to a noble house. A house aligned with the faction that sought to usurp the crown..."},{"name":"THONAN","text":"It seems that the mages were in league with the insurgents. Had my master seen this, he would have stopped at nothing to bring them all to justice."},{"name":"THONAN","text":"However, all was rendered moot by the Flood. My master, the traitors, the kingdom itself─all are no more."},{"name":"THONAN","text":"Yet in retrieving this letter, you have brought my master the closure that had long eluded him. He may rest easier now, I believe. My thanks for your kind service."}],"reward":{"gil":877},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68854]}},"partials":[{"type":"npc","id":"1031179","obj":{"i":1031179,"n":"Thon An","l":2956,"q":1}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}}]}