{"quest":{"name":"A New Amaro","location":"Il Mheg","id":68963,"patch":5.0,"sort":3170,"icon":100854,"unlocksFunction":1,"eventIcon":71341,"issuer":1027695,"target":1031025,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sandman would ask a favor of you, assuming he can stay awake long enough.","Drawn by enchanted crystals that call to those amaro that have awakened to their kind's long-lost abilities, a young beast has come to Il Mheg. However, he was not prepared for the existence of others like him, and no sooner was he welcomed by Sandman than he bolted and ran. Having been among men until recently, Sandman believes that the startled creature will trust you, and thus are you tasked with finding and bringing him back to Wolekdorf.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","West of Wolekdorf, you come upon the tracks of an amaro who appears to have been in some haste. The trail continues to the southwest, and you follow it.","Next, you come upon foliage that has been partially consumed by a large beast. You continue on to the west along the trail of consumption.","After a while, you find the remains of a fruit but recently eaten. The young amaro should be somewhere near.","At length you succeed in tracking down the young amaro, who introduces himself as Tonatiuh. You inform him of the nature of Wolekdorf and ask him to return with you, but he flatly refuses. It appears his time alone has rendered him uncomfortable with the prospect of being part of a community."],"objectives":["Search for signs of the amaro's passage.","Search for evidence of the amaro's passage.","Search for the amaro."],"dialogue":[{"name":"SANDMAN","text":"&lt;snore&gt; &lt;slurp&gt; ...Hm? Oh, I beg your pardon, I must have dozed off again. Ever since I turned three hundred, I find I can barely stay awake."},{"name":"SANDMAN","text":"Sandman is my name, and I had...something for you. What was it again? Ah, yes─a request. I would have you seek out a young amaro who has newly arrived in Il Mheg."},{"name":"SANDMAN","text":"But ere I go into the details, tell me: know you the nature of our community, Wolekdorf? It is a place where those of us who have attained intelligence come to live out our days."},{"name":"SANDMAN","text":"We amaro are born mindless beasts, you see, but if we abide among men for a century or so, we may awaken to abilities long lost in our kind, speech not least of all."},{"name":"SANDMAN","text":"That those who have awakened might know of Wolekdorf, we asked our Nu Mou friends to place enchantments on the crystals found throughout Il Mheg. These crystals call out to our brethren across Norvrandt, drawing them hither."},{"name":"SANDMAN","text":"However, the aforementioned young amaro was not prepared for what he found here─that is, other speaking amaro─and no sooner did I welcome him than he bolted and ran."},{"name":"SANDMAN","text":"Though he is wary of us, having served men until recently, I believe he will trust you. Please, will you not find him and persuade him to come here? To help you on your way, he fled to the west of the settlement."},{"name":"SANDMAN","text":"&lt;yawn&gt; Talking is weary business... Please, find that young amaro and persuade him to come here. He fled to the west of the settlement."},{"name":"SYSTEM","text":"You find a set of amaro tracks headed southwest. Judging by the depth of the impressions, the creature was in some haste."},{"name":"SYSTEM","text":"You find foliage that has been partially consumed by a large beast. The trail of consumption continues to the west."},{"name":"SYSTEM","text":"You find the eaten remains of a fruit, the exposed flesh yet to turn brown. The young amaro may yet be near."},{"name":"TONATIUH","text":"&lt;gasp&gt;"},{"name":"SYSTEM","text":"The young amaro regards you with wary eyes."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Sandman sent me."},{"name":"A2","text":"It's all right to talk."},{"name":"TONATIUH","text":"S-Sandman? You mean...the other fellow who can talk? I had no idea there were others like me..."},{"name":"TONATIUH","text":"Y-You know that I can talk? There was another fellow like me. Do you know him?"},{"name":"TONATIUH","text":"Well now, a whole settlement of talking amaro! That must be the place he wanted to show me."},{"name":"TONATIUH","text":"My name is Tonatiuh. My master was a traveling merchant. One day, I discovered that I could speak."},{"name":"TONATIUH","text":"I was so happy, and I thought my master would be happy too. But when I spoke to him, he looked as if he'd seen a ghost and abandoned me."},{"name":"TONATIUH","text":"Since that day, I've been wandering the land by myself. I'd heard of Il Mheg, and I thought it would be nice to see it. But it seems the idea wasn't my own at all."},{"name":"TONATIUH","text":"This settlement, Wolekdorf... It sounds like a nice place...but I don't want to live there."},{"name":"TONATIUH","text":"I've been alone for a long while. I don't feel comfortable around others anymore. Not even other amaro."}],"reward":{"gil":752,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68854]},"next":[68964]},"partials":[{"type":"npc","id":"1027695","obj":{"i":1027695,"n":"Sandman","l":2956,"q":2}},{"type":"npc","id":"1031025","obj":{"i":1031025,"n":"Tonatiuh","l":2956,"q":3}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}},{"type":"quest","id":"68964","obj":{"i":68964,"n":"A Costly Meal","g":116,"l":"Il Mheg","s":3180}}]}