{"quest":{"name":"Marks of the Monarch","location":"Il Mheg","id":68969,"patch":5.0,"sort":3230,"eventIcon":71221,"issuer":1031500,"target":1031500,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The watch amaro is troubled by a mysterious shadow."],"objectives":["Stand /lookout by the cliff.","Report to the watch amaro."],"dialogue":[{"name":"PATROLAMARO03433","text":"Traveler, have you a moment? I patrol the area to the north regularly, and for a long while there was nothing of note. Of late, however, I've been seeing a mysterious figure on the other side of the cliff."},{"name":"PATROLAMARO03433","text":"I can't make out who─or what─that figure is, and it troubles me. Men are said to see better than us amaro. Will you not lend me your keen eyes?"},{"name":"PATROLAMARO03433","text":"My thanks. All you need to do is stand lookout at the cliffs by Longmirror Lake and the Church at Dammroen Field."},{"name":"PATROLAMARO03433","text":"I will see to other locations in the meantime. When you have finished, please come and meet me back here."},{"name":"SYSTEM","text":"You glimpse a reflection of yourself in the tranquil lake far below. However, there are no mysterious figures to be seen."},{"name":"SYSTEM","text":"You glimpse curious cracks on the mountain face. However, there are no mysterious figures to be seen."},{"name":"SYSTEM","text":"This appears to be one of the lookout locations."},{"name":"PATROLAMARO03433","text":"There you are. So tell me, what did you see?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I saw no mysterious figures."},{"name":"A1","text":"I saw beautiful views."},{"name":"PATROLAMARO03433","text":"Well, if you saw nothing, then I may rest easier. If truth be told, I was beginning to think that perhaps I was simply seeing my own shadow cast upon the fog."},{"name":"PATROLAMARO03433","text":"By the way, when you looked out to the north, you may have noticed the strange cracks on the mountain face. Do you know how they came to be there?"},{"name":"PATROLAMARO03433","text":"They were hewn out by the faerie king when they fought the invading sin eaters."},{"name":"PATROLAMARO03433","text":"They were hewn out by the previous faerie king when they fought the invading sin eaters."},{"name":"PATROLAMARO03433","text":"To be sure, they weren't known as the king then, but simply Titania, ruler of the pixies. And it was they who rose to restore peace to the region in the wake of Voeburt's demise."},{"name":"PATROLAMARO03433","text":"In the manner in which Titania united us against the sin eaters, the faeries saw an image of the king of fallen Voeburt."},{"name":"PATROLAMARO03433","text":"So it was that, as a show of respect, we came to likewise refer to them as king. Alas, to our great sorrow, they would be corrupted by the Light and become that which they fought."},{"name":"PATROLAMARO03433","text":"Those cracks are a reminder of how our king protected us, and beholding them spurs me to remain vigilant. But forgive me, I've gone on quite a ramble. Thank you for helping me to put my worries to rest."}],"reward":{"gil":606,"items":[{"num":3,"id":5729,"one":1},{"num":3,"id":5734,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68854]}},"partials":[{"type":"npc","id":"1031500","obj":{"i":1031500,"n":"Watch Amaro","l":2956,"q":1}},{"type":"item","id":"5729","obj":{"i":5729,"n":"Snow White Dye","l":30,"c":22811,"t":55,"p":216}},{"type":"item","id":"5734","obj":{"i":5734,"n":"Soot Black Dye","l":30,"c":22807,"t":55,"p":216}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}}]}