{"quest":{"name":"A New Favorite","location":"Il Mheg","id":68967,"patch":5.0,"sort":3210,"icon":100855,"eventIcon":71221,"issuer":1027695,"target":1027695,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sandman needs you to help Tonatiuh settle into his new life.","As part of Tonatiuh's responsibilities to the flock, Sandman has a mind to make him their envoy to the pixies. To that end, he tasks you with watching over the young amaro in his initial efforts to navigate the vagaries of pixie temperament. The knowledge that you have a friend in Lydha Lran reassures Sandman, who bids you relay the details of your conversation with him to Tonatiuh.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Though Tonatiuh is admittedly daunted by the prospect of dealing with the pixies, he is heartened to have help in the form of Ul Thon. Together you set out for Lydha Lran to meet with the pixie.","According to Ul Thon, the surest way to be a good envoy is to become popular among the pixies. This requires Tonatiuh to prove that he can play with them as their equals, by beating them at their own games. Not waiting for a reply, Ul Thon declares that they will introduce you to some friends, and bids you follow them.","In order to win over the pixies, it is decided that you and Tonatiuh will play a game of treasure hunt with them. The pixies will stand guard over their treasures, which you must obtain without being detected. When you are ready to begin, Ul Thon will cast an enchantment on you to make you invisible.","At your word, Ul Thon renders you invisible, and you set about the task of obtaining the treasures under the pixies' noses.<br><br>※You must complete the task before the enchantment expires. Speak with Ul Thon again to extend the duration of the spell.","To the pixies' confoundment, you make off with two of their treasures and carry them back to Ul Thon.","Ul Thon confirms that you have obtained two of three treasures; but one more and victory will be yours. Though Tonatiuh is presumably still out there looking for the last treasure, his spell should have long faded. Worried that the amaro may have become lost, you and Ul Thon set out to look for him.","Rather far away from Lydha Lran, you find the mean pixie and Tonatiuh being attacked by hawkers, which you promptly put down. With the danger passed, you turn your attention to your charge.","Grateful for your aid, the mean pixie undergoes a change of heart and embraces Tonatiuh as a friend. This not only serves to give the amaro the confidence to do his duty as envoy, but awakens him to the joy of making friends. While Tonatiuh continues to play with the pixies and Ul Thon works to retain their crown as the darling of Lydha Lran, you bend your steps back to Wolekdorf to report to Sandman.","Sandman is glad that the pixies have accepted Tonatiuh, and gladder still for the change that has come to the young amaro. Whereas Tonatiuh once chose solitude, he now embraces friendship. The trials and triumphs of youth strikes a chord with the old amaro, who looks forward to dreaming of his own days as a fledgling."],"objectives":["Speak with Tonatiuh.","Speak with Ul Thon.","Collect pixie treasures.","Deliver the pixie treasures to Ul Thon.","Search for Tonatiuh.","Speak with Tonatiuh.","Report to Sandman."],"dialogue":[{"name":"SANDMAN","text":"&lt;yawn&gt; ...Ah, it's you. Your timing is most fortuitous─I was just about to doze off. Come to ask about Tonatiuh, have you?"},{"name":"SANDMAN","text":"I have been teaching him the ways of the flock. We each have a task we perform, and now that Tonatiuh is one of us, he must have one too. Speaking of which..."},{"name":"SANDMAN","text":"You are well acquainted with the pixies of Lydha Lran, are you not? I would be grateful if you were to help Tonatiuh settle into his new role."},{"name":"SANDMAN","text":"I've a mind to make him our envoy to the pixies, you see. The post is vacant at the moment, as it often is, given the challenges."},{"name":"SANDMAN","text":"Our peoples are very different. The pixies live to play, whereas all we desire is peace. Most of us have no tolerance for their mischief."},{"name":"SANDMAN","text":"In the course of collecting the items to make reparation to the Nu Mou, Tonatiuh had occasion to treat with the pixies and came away unscathed."},{"name":"SANDMAN","text":"But he had you at his side that time, and I cannot help but worry how he will fare alone, navigating the vagaries of pixie temperament. It would be reassuring to know you were watching over him, at least in the beginning."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"There's a pixie who owes me a favor."},{"name":"A2","text":"There's a popular pixie who should be willing to help."},{"name":"SANDMAN","text":"Truly? With this pixie as an ally, I dare to hope that it will smooth the way for Tonatiuh."},{"name":"SANDMAN","text":"Please relay the details of our conversation to Tonatiuh. He should be somewhere in the settlement."},{"name":"SANDMAN","text":"Do introduce your pixie friend to Tonatiuh. With them as an ally, I dare to hope that it will smooth the way for Tonatiuh."},{"name":"TONATIUH","text":"Oh, it's you! You have a message from Sandman, you say?"},{"name":"TONATIUH","text":"I see... He did say that he would have a task for me."},{"name":"TONATIUH","text":"The prospect of dealing with the pixies is daunting, but it gives me heart to have this Ul Thon's help. Let's go and meet them at once."},{"name":"TONATIUH","text":"I can't help but feel nervous..."},{"name":"ULTHON","text":"If it isn't <span class=\"highlight\">Forename</span>! Come to bask in the glow of my popularity, I take it. And I see you've brought a friend!"},{"name":"ULTHON","text":"...Is that the way of it? Well, you just leave it to me. Under my sage guidance, Tonatiuh will become the most popular soul in Lydha Lran─after yours truly, of course!"},{"name":"TONATIUH","text":"Oh, I'm not looking to become popular. I just want to do a good job as an envoy between our peoples."},{"name":"ULTHON","text":"And there's no surer way to do so than to become popular, believe you me! It's simple, really. You just need to prove that you can play with us as equals─by beating us at our own games."},{"name":"ULTHON","text":"Come along, I'll introduce you to everyone!"},{"name":"TONATIUH","text":"&lt;sigh&gt; Of course it's games. Well, at least I have Ul Thon guiding me."},{"name":"TONATIUH","text":"I really can't tell them apart..."},{"name":"ULTHON","text":"...That's to say, Tonatiuh wants to be our friend, so be nice to him. Understood?"},{"name":"DOUBTPIXIE03431","text":"(-Mean Pixie-)Sure, sure. We'll treat him as our prized toy."},{"name":"ULTHON","text":"No, no, no! Be <span class=\"emphasis\">nice</span>, I said! Tonatiuh has what it takes to be a friend! Given half the chance, he would beat you at all your games─assuming you play fair!"},{"name":"DOUBTPIXIE03431","text":"(-Mean Pixie-)An amaro can beat us, you say? Ahahaha! We'll believe it when we see it!"},{"name":"ULTHON","text":"Oh, and you will, because Tonatiuh and <span class=\"highlight\">Forename</span> will play a game with you right now."},{"name":"ULTHON","text":"Well, of course you're playing too. It wouldn't be fair otherwise."},{"name":"ULTHON","text":"The game will be...treasure hunt! The pixies will stand guard over their treasures, which you must search for while invisible. If you can obtain them all without being discovered, you win!"},{"name":"DOUBTPIXIE03431","text":"(-Mean Pixie-)Sounds good to us! For the treasures, we can use our favorite flowers. We'll go and hide them outside the village at once!"},{"name":"ULTHON","text":"Well, there you have it. When you're ready to begin, I'll cast an invisibility spell on you. If the effect fades before you finish, come back here and I'll cast it again."},{"name":"TONATIUH","text":"So if we win this game, the pixies will consider me a friend... Right, I'm ready!"},{"name":"TONATIUH","text":"Thanks! Here I go, then!"},{"name":"ULTHON","text":"The treasures will be scattered all over Timh Gyeus and guarded by the pixies. You won't be able to get near while visible. Are you ready for the spell?"},{"name":"SYSTEM","text":"A pixie incantation is about to render you invisible. Hurry and find the treasures before the magic is lifted."},{"name":"SYSTEM","text":"The incantation will expire in 180 seconds. If you become visible, you will be unable to complete your task. Return to Ul Thon and have the spell cast anew."},{"name":"ULTHON","text":"The treasures will be scattered all over Timh Gyeus and guarded by the pixies. If you try to go near while visible, you'll only get caught. Here, let me freshen the spell for you."},{"name":"PIXIEA03431","text":"(-Pixie Treasurekeeper-)Th-The treasure's gone! When did that happen!?"},{"name":"PIXIEB03431","text":"(-Pixie Guard-)Nooo! My treasure!"},{"name":"PIXIEA03431","text":"(-Pixie Treasurekeeper-)I see you, mortal! Better luck next time!"},{"name":"PIXIEB03431","text":"(-Pixie Treasurekeeper-)Did you think you were invisible? Because you're not, you silly mortal!"},{"name":"SYSTEM","text":"You cannot obtain the treasure while visible. Return to Ul Thon to have the spell cast anew."},{"name":"ULTHON","text":"How goes the sneaking? Found any treasures yet?"},{"name":"ULTHON","text":"Ah, yes, this makes two out of three! Just one more and victory is yours!"},{"name":"ULTHON","text":"I assume Tonatiuh's out there looking for the last treasure...except his spell should've long faded by now."},{"name":"ULTHON","text":"If he's only recently come to Il Mheg, perhaps he's gotten himself lost. We should look for him."},{"name":"ULTHON","text":"Come, <span class=\"highlight\">Forename</span>, we should go and look for Tonatiuh."},{"name":"TONATIUH","text":"Thank you, that was too close. I was following this pixie's scent when I saw those hawkers chasing them. It was all I could do to jump in the way."},{"name":"ULTHON","text":"Just when I thought I heard a commotion... What in the heavens were you doing so far from the village?"},{"name":"DOUBTPIXIE03431","text":"(-Mean Pixie-)I-I thought it would be fun to make the amaro lose his way, so I tried to hide my treasure somewhere out of reach. But then those nasty hawkers came along..."},{"name":"ULTHON","text":"&lt;sigh&gt; Did I not tell you to be nice? Apologize to Tonatiuh and <span class=\"highlight\">Forename</span> at once!"},{"name":"DOUBTPIXIE03431","text":"(-Mean Pixie-)I'm sorry... And thank you for helping me, even though I was being mean."},{"name":"TONATIUH","text":"Don't mention it. I'm just glad you're safe. But...I didn't find any treasures myself. I suppose that means I'm not fit to be your friend..."},{"name":"DOUBTPIXIE03431","text":"(-Mean Pixie-)Nothing of the sort! If you didn't find any treasures, it was because you were busy saving me."},{"name":"DOUBTPIXIE03431","text":"(-Mean Pixie-)So win or lose, it doesn't matter. I'll tell everyone in the village that we consider you the best of friends. So please, be our friend and take us for rides on your back!"},{"name":"TONATIUH","text":"B-But of course! It'd be my pleasure!"},{"name":"DOUBTPIXIE03431","text":"(-Mean Pixie-)Hurray, hurray! Let's head back to the village and play some more!"},{"name":"TONATIUH","text":"Whew, this went much better than I had dared to hope! I feel ready to take on my duty as envoy now. And who would have thought it felt so fine to make friends!"},{"name":"TONATIUH","text":"It's all because of you and Ul Thon. Thank you ever so much!"},{"name":"ULTHON","text":"I'm glad for Tonatiuh...but can't help but worry. At this rate, he might become more popular than me."},{"name":"ULTHON","text":"I'd best hurry back to the village. I have a lot to do if I'm to retain my crown as the darling of Lydha Lran!"},{"name":"ULTHON","text":"Your work here is done, so feel free to run along back to Wolekdorf and report to Sandman. Tell him that Tonatiuh made friends─lots of them!"},{"name":"SANDMAN","text":"...So the pixies accepted Tonatiuh. I am glad to hear that. "},{"name":"SANDMAN","text":"Yet I am gladder still for the change that has come to our young friend. Whereas he once chose solitude, he now has so many friends as to attract a rival in popularity."},{"name":"SANDMAN","text":"Ah, the trials and triumphs of youth... It reminds me of my own time as a fledgling. When next I slumber, I believe I will dream of those days."}],"reward":{"gil":1487,"items":[{"num":2,"id":24261,"one":1},{"num":2,"id":24262,"one":1},{"num":2,"id":24263,"one":1},{"num":2,"id":24264,"one":1},{"num":2,"id":24265,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68943,68966]}},"partials":[{"type":"npc","id":"1027695","obj":{"i":1027695,"n":"Sandman","l":2956,"q":2}},{"type":"item","id":"24261","obj":{"i":24261,"n":"Grade 3 Infusion of Strength","l":350,"c":20701,"t":44}},{"type":"item","id":"24262","obj":{"i":24262,"n":"Grade 3 Infusion of Dexterity","l":350,"c":20702,"t":44}},{"type":"item","id":"24263","obj":{"i":24263,"n":"Grade 3 Infusion of Vitality","l":350,"c":20703,"t":44}},{"type":"item","id":"24264","obj":{"i":24264,"n":"Grade 3 Infusion of Intelligence","l":350,"c":20704,"t":44}},{"type":"item","id":"24265","obj":{"i":24265,"n":"Grade 3 Infusion of Mind","l":350,"c":20705,"t":44}},{"type":"quest","id":"68943","obj":{"i":68943,"n":"The Dependable Darling","g":116,"l":"Il Mheg","s":2350}},{"type":"quest","id":"68966","obj":{"i":68966,"n":"The Key Ingredient","g":116,"l":"Il Mheg","s":3201}}]}