{"quest":{"name":"A Costly Meal","location":"Il Mheg","id":68964,"patch":5.0,"sort":3180,"icon":100854,"eventIcon":71221,"issuer":1031025,"target":1031025,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tonatiuh wishes to send you back to Wolekdorf with his apologies.","While thankful that you came to find him, Tonatiuh does not wish to return with you to Wolekdorf, and asks that you convey his apologies to Sandman.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","No sooner do you tell Sandman about Tonatiuh's decision than a panicked amaro arrives bearing word of trouble. It appears an amaro has devoured a porxie familiar, and its Nu Mou owner is none too pleased. The suspicion for the crime soon falls upon Tonatiuh, who is ignorant of the ways of Il Mheg. While Sandman has words with his own to make certain the culprit isn't among them, he bids you speak with the aggrieved Nu Mou for their account of the incident.","According to the aggrieved Nu Mou, their porxie was devoured while out gathering herbs. At your suggestion that the culprit was likely an amaro from outside Il Mheg, and not a creature of Wolekdorf, the Nu Mou demands you find and bring Tonatiuh to them for questioning. The young amaro is likely to still be close to the scene of the crime, somewhere in Voeburtenburg.","After a brief search, you manage to locate Tonatiuh, who blithely admits to having devoured the porxie. The revelation that what he consumed wasn't a wild animal, but a Nu Mou's cherished familiar, comes as a tremendous shock to the young amaro."],"objectives":["Report to Sandman.","Speak with the aggrieved Nu Mou.","Search for Tonatiuh."],"dialogue":[{"name":"SANDMAN","text":"&lt;yawn&gt; Talking is weary business... Please, find that young amaro and persuade him to come here. He fled to the west of the settlement."},{"name":"TONATIUH","text":"I appreciate you coming to find me, but I won't go back with you. Please tell Sandman that I'm sorry."},{"name":"TONATIUH","text":"I appreciate you coming to find me, but I won't go back with you. Please tell Sandman that I'm sorry."},{"name":"SANDMAN","text":"&lt;snore&gt; &lt;snort&gt; ...Oh, you're back. Did you manage to track down the young amaro?"},{"name":"SANDMAN","text":"I see, I see..."},{"name":"SANDMAN","text":"Well, if he desires to be alone, we cannot well force him to live here. My apologies for taking your time."},{"name":"AMARO03428","text":"(-Panicked Amaro-)Sandman, Sandman! We have a problem!"},{"name":"AMARO03428","text":"(-Panicked Amaro-)A Nu Mou's come over here, and they are absolutely livid! They claim that one of us ate their porxie!"},{"name":"SANDMAN","text":"What? That is most unusual... The Nu Mou are our good friends. Every one of us knows better than to do such a thing."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Everyone except for Tonatiuh."},{"name":"A2","text":"Perhaps it's a misunderstanding."},{"name":"SANDMAN","text":"This is true. Tonatiuh has but arrived here. He knows not the ways of Il Mheg."},{"name":"SANDMAN","text":"Aye. If an amaro committed the deed, it must be one who knows not the ways of Il Mheg. One such as Tonatiuh, who has but recently arrived here."},{"name":"SANDMAN","text":"While I would not blame him out of hand, the possibility cannot be ignored. Forgive me, my friend, but will you not help us once more?"},{"name":"SANDMAN","text":"My thanks. I will have words with all the amaro of Wolekdorf to make certain that the culprit is not among us."},{"name":"SANDMAN","text":"Meanwhile, please speak with the aggrieved Nu Mou and ask them for their account of the incident."},{"name":"SANDMAN","text":"For once I am not the least bit sleepy, though I'd sooner sleep through all of this..."},{"name":"ANGRYNUMOU03428","text":"What's this? Are the amaro so cowed that they send a mortal to speak for them? Hmph, no matter. You will have my account and I will have justice."},{"name":"ANGRYNUMOU03428","text":"My porxie was out gathering herbs when it happened. Suddenly, I sensed its intense fear. It then cried to me in my mind that an amaro was chasing it. And then it was gone."},{"name":"ANGRYNUMOU03428","text":"I thought that the amaro were civilized. That they were our friends. How wrong I was!"},{"name":"ANGRYNUMOU03428","text":"Unless I receive fitting reparation for this heinous deed, there can no longer be peace between our peoples!"},{"name":"ANGRYNUMOU03428","text":"...What? It wasn't an amaro of Wolekdorf, but a creature from outside Il Mheg?"},{"name":"ANGRYNUMOU03428","text":"Prove it. Bring me this amaro that's responsible, this Tonatiuh, and let us have the truth from him. If he is ignorant as you say, he should still be near the scene of the crime, in Voeburtenburg."},{"name":"ANGRYNUMOU03428","text":"I will go and have words with Sandman while I await your return. But do not take too long─I am not in a patient mood!"},{"name":"SANDMAN","text":"Every one of ours claims to have no knowledge of the porxie. That leaves us only with Tonatiuh. Please hurry and find him."},{"name":"ANGRYNUMOU03428","text":"It was in Voeburtenburg that my poor porxie was devoured. Go on and bring back this Tonatiuh, and we will have the truth!"},{"name":"TONATIUH","text":"Oh, it's you again.<br>...Hm? Have I seen a porxie, you ask?"},{"name":"TONATIUH","text":"If you mean the flying pig, then yes. It looked delicious─and it was!"},{"name":"TONATIUH","text":"...D-Did I do something wrong?"},{"name":"TONATIUH","text":"What!? It wasn't a wild animal, but a Nu Mou's cherished familiar!?"},{"name":"TONATIUH","text":"Oh no, oh no... Wh-What have I done?"}],"reward":{"gil":913},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68963]},"next":[68965]},"partials":[{"type":"npc","id":"1031025","obj":{"i":1031025,"n":"Tonatiuh","l":2956,"q":3}},{"type":"quest","id":"68963","obj":{"i":68963,"n":"A New Amaro","g":116,"l":"Il Mheg","s":3170,"f":1}},{"type":"quest","id":"68965","obj":{"i":68965,"n":"By Way of Reparation","g":116,"l":"Il Mheg","s":3190}}]}