{"quest":{"name":"By Way of Reparation","location":"Il Mheg","id":68965,"patch":5.0,"sort":3190,"icon":100854,"eventIcon":71221,"issuer":1031025,"target":1030716,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A remorseful Tonatiuh wishes to apologize.","Deeply sorry for having inadvertently devoured the porxie familiar, Tonatiuh decides to return to Wolekdorf with you to apologize.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Though the aggrieved Nu Mou praises Tonatiuh for having the courage to admit his mistake, they nonetheless demand fitting reparation of him: his life. The high price comes as a shock to all, but Tonatiuh earns a concession by choosing to join the Wolekdorf flock. If he can but bring the Nu Mou a bottle of pristine water, a lump of fine clay, and a fae lamp, his debt will be considered settled. Breathing a sigh of relief, you turn to the young amaro to discuss the task of procuring the items.","While Tonatiuh goes about obtaining the clay, you are tasked with drawing the water. At Sandman's suggestion, you strike out northwest in search of a stream fed by a cascade.","You find the stream and draw a bottle of pristine water, which you stow in your borrowed sack. Your task accomplished, you set out for the fields of Voeburtenburg to rejoin Tonatiuh.","Tonatiuh happily reports that he has the clay. All that remains to be obtained, then, is the fae lamp."],"objectives":["Speak with Sandman.","Speak with Tonatiuh.","Draw a bottle of pristine water.","Deliver the pristine water to Tonatiuh."],"dialogue":[{"name":"SANDMAN","text":"Every one of ours claims to have no knowledge of the porxie. That leaves us with only Tonatiuh. Please hurry and find him."},{"name":"ANGRYNUMOU03428","text":"It was in Voeburtenburg that my poor porxie was devoured. Go on and bring back this Tonatiuh, and we will have the truth!"},{"name":"TONATIUH","text":"So soon after I refuse the offer to live in Wolekdorf, I'm going there to apologize..."},{"name":"TONATIUH","text":"&lt;sigh&gt; Well, there's no use delaying it. Let's be on our way."},{"name":"TONATIUH","text":"Judging by their dark expression, I take it that's the porxie's master..."},{"name":"ANGRYNUMOU03428","text":"So, you were right. It was an amaro from outside Il Mheg. Very well, I will claim reparation from this Tonatiuh."},{"name":"SANDMAN","text":"My thanks for bringing back Tonatiuh. Now we shall be able to clear up the misunderstanding."},{"name":"TONATIUH","text":"I'm so sorry I ate your pig. It's just...I was dreadfully hungry, and it looked so delicious..."},{"name":"ANGRYNUMOU03428","text":"Porxies are not pigs, I'll have you know. They are our people's favored familiars. We treat them as we would our family."},{"name":"ANGRYNUMOU03428","text":"Now, I praise you for having the courage to admit your mistake. However, I cannot let this grievance stand without fitting reparation. Such is the way of we Nu Mou."},{"name":"TONATIUH","text":"I understand. What would you have of me?"},{"name":"ANGRYNUMOU03428","text":"Hmmm... Were you a denizen of Wolekdorf, I would take into account the good relations between our peoples and give you a concession."},{"name":"ANGRYNUMOU03428","text":"But seeing as you are not, I have no choice but to demand full payment: a life for a life."},{"name":"TONATIUH","text":"A-A life? You mean...I have to die!?"},{"name":"TONATIUH","text":"I want to take responsibility for my actions...but I'm afraid to die. What should I do?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can join the Wolekdorf flock."},{"name":"A2","text":"I'm afraid there's no other way."},{"name":"SANDMAN","text":"Ah, indeed! If Tonatiuh were to become one of us, he would be afforded a concession. How does that sound, young one?"},{"name":"SANDMAN","text":"Surely there is something we can do. As our Nu Mou friend says, a denizen of Wolekdorf would be afforded a concession."},{"name":"SANDMAN","text":"If Tonatiuh were to join our flock, he need not render up his life. How does that sound, young one?"},{"name":"TONATIUH","text":"But...I've already refused your invitation, and since then I've caused only trouble. In spite of all this, you would still let me join you?"},{"name":"SANDMAN","text":"Come now, to be a flock is to look after one another. And there will be times, I'm sure, when you help your fellows as we help you now."},{"name":"SANDMAN","text":"Besides, such things are of no consequence beside the joy of welcoming a new member to the flock."},{"name":"ANGRYNUMOU03428","text":"Then it's decided. I will hereby demand reparation of Tonatiuh─as a denizen of Wolekdorf."},{"name":"ANGRYNUMOU03428","text":"Bring me these three items: a bottle of pristine water, a lump of fine clay, and a fae lamp. By this I will hold the debt settled."},{"name":"ANGRYNUMOU03428","text":"They might prove challenging for an amaro alone to procure, but then you have a capable mortal here to assist."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I suppose I've already come this far..."},{"name":"A2","text":"You can count on me!"},{"name":"TONATIUH","text":"I'm so sorry for dragging you into this. When all is said and done, I promise to repay your kindness."},{"name":"SANDMAN","text":"So, that's a bottle of pristine water, a lump of fine clay, and a fae lamp. Please help Tonatiuh gather these things."},{"name":"ANGRYNUMOU03428","text":"Now that Tonatiuh is a denizen of Wolekdorf, the three items I requested shall suffice by way of reparation."},{"name":"TONATIUH","text":"Hmmm, being new to Il Mheg, I'm not sure where to begin searching for the items..."},{"name":"SANDMAN","text":"The finest clay may be had from a nearby cliff face. Difficult to reach for men, but an amaro could easily fly there."},{"name":"TONATIUH","text":"Oh, then I'll go and obtain the clay. In the meantime, could I leave the water to you? It's rather tricky to draw it with our talons..."},{"name":"SANDMAN","text":"To the northwest of here, you will find a stream fed by a cascade. Its water runs cool and clear and should serve your needs. Here, this should help you to carry the items."},{"name":"TONATIUH","text":"Right, let's get to work. After you have the water, please come and meet me in the fields in Voeburtenburg."},{"name":"TONATIUH","text":"You draw a bottle of pristine water and store it inside the worn sack."},{"name":"TONATIUH","text":"There you are. Did you get the water?"},{"name":"TONATIUH","text":"Great! I'll put the clay with it in the sack."},{"name":"TONATIUH","text":"That leaves us with only the fae lamp, which I understand is with the pixies."}],"reward":{"gil":986},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68964]},"next":[68966]},"partials":[{"type":"npc","id":"1031025","obj":{"i":1031025,"n":"Tonatiuh","l":2956,"q":3}},{"type":"npc","id":"1030716","obj":{"i":1030716,"n":"Tonatiuh","l":2956,"q":2}},{"type":"quest","id":"68964","obj":{"i":68964,"n":"A Costly Meal","g":116,"l":"Il Mheg","s":3180}},{"type":"quest","id":"68966","obj":{"i":68966,"n":"The Key Ingredient","g":116,"l":"Il Mheg","s":3201}}]}