{"quest":{"name":"Of Graveyards and Gremlins","location":"Lakeland","id":68973,"patch":5.0,"sort":4020,"eventIcon":71221,"issuer":1027420,"target":1027420,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Joanric is at wit's end."],"objectives":["Survey the designated locations and defeat any gremlins that appear.","Speak with Joanric."],"dialogue":[{"name":"JOANRIC","text":"Oh, good traveler, thank the gods you're here! You simply must help deliver us from our unending nightmare. I speak, of course, of those godsdamned gremlins who keep sneaking in to defile the graves behind our fort."},{"name":"JOANRIC","text":"Time and again have I and my fellow guards chased them away, only to see them come back in hordes, cackling and sniggering all the way."},{"name":"JOANRIC","text":"As if that weren't bad enough, they continuously berate us with an array of vulgar aspersions that─rather surprisingly given their limited intellect─more often than not hit painfully close to home."},{"name":"JOANRIC","text":"Why, it's gotten so bad that I─er, one of our men that was definitely not me spent the night crying into his pillow after the last such attack!"},{"name":"JOANRIC","text":"But I can tell <span class=\"emphasis\">you're</span> not one to let their words wound you, am I right? Of course I am! So I beg of you: go forth to the graveyard and be the gremlin-smiting hero we need!"},{"name":"JOANRIC","text":"I can just hear those godsdamned gremlins out there, sniggering at me and telling me what I should do to my amaro! Make it stop...oh, good gods, make it stop!"},{"name":"SYSTEM","text":"You can neither see nor hear any sign of gremlins here..."},{"name":"BALLOON","text":"Lick the spittle from the floors, lickspittle!"},{"name":"BALLOON","text":"Bugger yer amaro, ye bugger."},{"name":"BALLOON","text":"Gaaaaaah!?"},{"name":"BALLOON","text":"Yer lower than piss on the privy!"},{"name":"BALLOON","text":"Is that sorry blow the best ye got?"},{"name":"BALLOON","text":"Grrrk!"},{"name":"JOANRIC","text":"Do my ears deceive me? The tittering and snickering is no more... Could it be? Dare I dream? Have you put an end to the gremlin menace once and for all!? O, glorious─ Ahem. That is to say, thank you, traveler. All of Fort Jobb is in your debt!"},{"name":"JOANRIC","text":"...Forgive me, I get carried away when the topic turns to those nasty buggers. Speaking of which, do you ever wonder where they came from? I could swear I never saw one of them before the Flood."},{"name":"JOANRIC","text":"I heard someone saying that they first started popping up after the Crystarium was built. That they came out of the tower. As for the truth, who can say, but all I know is that they're not bothering us anymore, and that's good enough for me!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68858]}},"partials":[{"type":"npc","id":"1027420","obj":{"i":1027420,"n":"Joanric","l":2953,"q":1}},{"type":"quest","id":"68858","obj":{"i":68858,"n":"A Party Soon Divided","g":8,"l":"The Crystarium","s":440}}]}