{"quest":{"name":"You Had One Jobb","location":"Lakeland","id":68972,"patch":5.0,"sort":4010,"eventIcon":71221,"issuer":1031227,"target":1031227,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The ungainly guardsman has made a fine mess of things."],"objectives":["Defeat the proterosuchus and retrieve the guardsman's sack.","Deliver the sack to the ungainly guardsman."],"dialogue":[{"name":"SOLDIER03436","text":"Oh, curse my clumsy feet! I've really done it this time! I was on my way back from an assignment in Weathering, when─would you believe it?─I slipped and fell, sending the sack I was carrying flying out of my hand and high into the heavens."},{"name":"SOLDIER03436","text":"And as if that wasn't bad enough, a massive beast from out of nowhere snatched up my precious belongings in its jaws and carried them off to the gods know where!"},{"name":"SOLDIER03436","text":"Suffice to say that if I return empty-handed, my commanding officer is like as not to put me on privy cleaning duty for a week! You must help me, friend!"},{"name":"SOLDIER03436","text":"Welcome back, friend! You found my supplies, yes? Oh, please say that you did! Just the thought of scouring the privy with a toothbrush again is sending shivers down my spine!"},{"name":"SOLDIER03436","text":"Could it be? Oh, but it is─my sack! My lovely, lovely sack! And though it's looking rather worse for wear, the contents appear to be entirely intact!"},{"name":"SOLDIER03436","text":"What exactly <span class=\"emphasis\">are</span> the contents, you ask? Among other things, there happens to be a remarkable device that's been entrusted to us in the guard by the Crystal Exarch himself, who is said to have exhumed it from the Crystal Tower!"},{"name":"SOLDIER03436","text":"Though it simply looks like a pretty round gemstone, it somehow has the ability to measure the concentration of aether in the air and matter around us. Needless to say, it's not something that anyone─not even the artisans at the Mean─can just toss together. If I had lost it for good..."},{"name":"SOLDIER03436","text":"...But thanks to you, I don't have to think about that anymore, now do I? I know it isn't much, but please take this as a token of my thanks. And with that, I'd best hurry back, lest I get punished anyway for my tardiness. Fare thee well!"}],"reward":{"gil":706},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68858]}},"partials":[{"type":"npc","id":"1031227","obj":{"i":1031227,"n":"Ungainly Guardsman","l":2953,"q":1}},{"type":"quest","id":"68858","obj":{"i":68858,"n":"A Party Soon Divided","g":8,"l":"The Crystarium","s":440}}]}