{"quest":{"name":"Plans Gone Awry","location":"The Rak'tika Greatwood","id":68977,"patch":5.0,"sort":4080,"eventIcon":71221,"issuer":1027746,"target":1027746,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Maril looks as though he is expecting someone."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter “tuktu” to assure the hardened hunter you are not an enemy.","With the chat mode in <span class=\"highlight\">Say</span>, enter “tuktu” to assure the hapless hunter you are not an enemy.","Report to Maril."],"dialogue":[{"name":"MARIL","text":"A moment, if you would. I am recently returned from patrol, but I fear something has happened to my comrades. By all rights they should have arrived here when I did, if not sooner."},{"name":"MARIL","text":"It was meant to be a simple sweep of the perimeter, dispensing with any raptors we spotted along the way."},{"name":"MARIL","text":"Would you be willing to search for them? In case they should return before you do, I will remain here to receive them."},{"name":"MARIL","text":"Hmmm. If they are wounded or hiding, they are not like to reveal themselves to a stranger. You will need our password─tuktu. But say the word and they will immediately know you for an ally of Slitherbough. "},{"name":"MARIL","text":"If you find them, do not forget to speak the password─tuktu."},{"name":"VETERANSOLDIER03441","text":"Stay back!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “tuktu” and allay the hunter's fears."},{"name":"SYSTEM","text":"tuktu"},{"name":"VETERANSOLDIER03441","text":"Ah, thank goodness. When I heard you approaching, I feared the worst."},{"name":"VETERANSOLDIER03441","text":"I spotted a raptor not far from here and thought it a suitable opportunity to train my companion, a hunter newly joined to the guard. Yet in my fervor for the hunt, I somehow lost track of him."},{"name":"VETERANSOLDIER03441","text":"The raptor is injured, but to leave it now would jeopardize our stores of food, or worse should anyone else cross its path. I must go after it."},{"name":"VETERANSOLDIER03441","text":"Would you search for him in my stead? Once you have found him, return to Slitherbough and inform Maril that I've spotted a raptor and gave chase."},{"name":"NEWBIESOLDIER03441","text":"Mercy! Mercy!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “tuktu” and allay the hunter's fears."},{"name":"SYSTEM","text":"tuktu"},{"name":"NEWBIESOLDIER03441","text":"Tuktu? Oh, thank goodness."},{"name":"NEWBIESOLDIER03441","text":"We were hunting raptors, and managed to corner a rather nasty one. Or so we thought. After taking an arrow to the backside, it let out the most bloodcurdling scream. I was expecting it, but I panicked and ran all the same."},{"name":"NEWBIESOLDIER03441","text":"I think my nerves are settled now, though. I expect I'll get an earful from Maril, but I suppose I have it coming."},{"name":"MARIL","text":"There you are. My comrades returned not long ago."},{"name":"MARIL","text":"Though I was disappointed to hear our newest guardsman fled in the face of danger."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Perhaps he's not fit to protect Slitherbough."},{"name":"A1","text":"Perhaps he needs more training before venturing out into the woods."},{"name":"MARIL","text":"Perhaps you are right, but I must give this some thought before I speak with him. Thank you again for your help, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."}],"reward":{"gil":779},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68861]}},"partials":[{"type":"npc","id":"1027746","obj":{"i":1027746,"n":"Maril","l":2957,"q":1}},{"type":"quest","id":"68861","obj":{"i":68861,"n":"A Day in the Neighborhood","g":8,"l":"The Rak'tika Greatwood","s":470}}]}