{"quest":{"name":"An Eggshell a Day","location":"Il Mheg","id":68970,"patch":5.0,"sort":3240,"eventIcon":71221,"issuer":1027691,"target":1027691,"genre":116,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rispa has a hankering for eggshells."],"objectives":["Obtain eggshells.","Deliver eggshells to Rispa."],"dialogue":[{"name":"RISPA","text":"Traveler, will you do me a favor? At the Church at Dammroen Field, you will find eggshells scattered about. I would have you gather them for me."},{"name":"RISPA","text":"Capable as you are, I understand you often find yourself drawn into grueling struggles. I daresay a little task such as this would come as a refreshing change."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Oh, so you're the one doing me a favor?"},{"name":"A1","text":"How very considerate of you."},{"name":"RISPA","text":"Heh heh heh... In the past, I asked a favor of another traveler in the selfsame way. He saw straight through my ploy."},{"name":"RISPA","text":"I was old then, and I am older now. My body does not move as it once did. Thus do I turn to healthy, young visitors such as you. If you would bring me the eggshells, I would be very grateful."},{"name":"RISPA","text":"The eggshells can be found at the Church at Dammroen Field. I would be very grateful if you could gather them for me."},{"name":"RISPA","text":"Back with the eggshells, are you?"},{"name":"RISPA","text":"Ah, these are fine shells. You have my thanks."},{"name":"RISPA","text":"You see, according to the Nu Mou, eggshells are good for strengthening one's bones. I have been feeding on them regularly in hopes that I become strong enough to travel once more."},{"name":"RISPA","text":"But tell me, while you were at the church, did you come upon an especially large egg? While it resembles our own, it belongs to a different species."},{"name":"RISPA","text":"Indeed, it was already here by the time my brethren and I came to abide in this land. What emerged from it remains a mystery, as does where the creature subsequently went."},{"name":"RISPA","text":"Yet one thing is clear: as a crossroads of aetherial currents, this land is ideal for hatching eggs. The parents of that creature were likely drawn here for that reason. And by the same token, we amaro continue to abide here."},{"name":"RISPA","text":"Ah, but listen to me prattle on like the old amaro that I am. I shall take no more of your time. Please accept this as a token of my thanks."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68854]}},"partials":[{"type":"npc","id":"1027691","obj":{"i":1027691,"n":"Rispa","l":2956,"q":1}},{"type":"quest","id":"68854","obj":{"i":68854,"n":"A Resounding Roar","g":8,"l":"Il Mheg","s":400}}]}