{"quest":{"name":"Like Pulling Teeth","location":"The Rak'tika Greatwood","id":68978,"patch":5.0,"sort":4090,"eventIcon":71221,"issuer":1029874,"target":1029874,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>This caring carpenter could use a sharp eye and a steady hand."],"objectives":["Take aim and use your blowgun to incapacitate a razor-tusked swine.","Speak with the caring carpenter.","Obtain a tusk from the razor-tusked swine.","Deliver the tusk to the caring carpenter."],"dialogue":[{"name":"GENTLECRAFTSMAN03442","text":"You are...<span class=\"highlight\">Forename</span>, yes? Master Matoya speaks highly of you. If I may, I would make a request of you."},{"name":"GENTLECRAFTSMAN03442","text":"It is my duty to craft arms for the Night's Blessed, but I've recently found myself without tusks for spears."},{"name":"GENTLECRAFTSMAN03442","text":"If Master Matoya is to be believed, and I have no reason to doubt her, you are skilled with blow darts. Might you be willing to assist me in hunting swine? "},{"name":"GENTLECRAFTSMAN03442","text":"If you are so inclined, meet with me at the edge of Lake Tusi Mek'ta."},{"name":"GENTLECRAFTSMAN03442","text":"If you climb up this tree, you should have a clear view of the area."},{"name":"GENTLECRAFTSMAN03442","text":"Sooner or later a boar will come to drink from the lake, and that's where you come in. Use the darts to paralyze it, and then we can safely extract one of their tusks."},{"name":"GENTLECRAFTSMAN03442","text":"It's been quite some time since I've seen such precision. Well done."},{"name":"GENTLECRAFTSMAN03442","text":"If you would see to plucking a tusk from the swine, I will gather the rest of the supplies I need. When you've finished, meet me back at Slitherbough."},{"name":"GENTLECRAFTSMAN03442","text":"You didn't have trouble procuring a tusk, did you?"},{"name":"GENTLECRAFTSMAN03442","text":"My, that's quite a find. This will make for an excellent spear."},{"name":"GENTLECRAFTSMAN03442","text":"A pity the swine have grown so scarce since the Flood."},{"name":"GENTLECRAFTSMAN03442","text":"We could possibly find use for their hides or their meat, but it would be all too easy to hunt them to extinction."},{"name":"GENTLECRAFTSMAN03442","text":"The same holds true for many of the animals here in the Greatwood."},{"name":"GENTLECRAFTSMAN03442","text":"We must be mindful to take only what we need. An important lesson to learn for any who would call these woods home."}],"reward":{"gil":779},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68861]}},"partials":[{"type":"npc","id":"1029874","obj":{"i":1029874,"n":"Caring Carpenter","l":2957,"q":1}},{"type":"quest","id":"68861","obj":{"i":68861,"n":"A Day in the Neighborhood","g":8,"l":"The Rak'tika Greatwood","s":470}}]}