{"quest":{"name":"In His Memory","location":"The Rak'tika Greatwood","id":68981,"patch":5.0,"sort":4120,"eventIcon":71221,"issuer":1029024,"target":1029024,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Karnes is desperately searching for something."],"objectives":["Speak with Varthon.","Escort Varthon through Fort Gohn and find the abandoned blade.","Speak with Varthon.","Deliver the abandoned blade to Karnes."],"dialogue":[{"name":"VARTHON","text":"Thank you for finding him. I could never forgive myself if something had happened to him."},{"name":"KARNES","text":"I have to find it, Varthon. My father's sword..."},{"name":"KARNES","text":"He was on guard duty that day when the sin eaters attacked. He fought so hard to keep us safe... But I wish he would've thought to save himself."},{"name":"KARNES","text":"Not a day goes by I don't think of his sacrifice, and what little good I've done with it."},{"name":"KARNES","text":"I thought retrieving his sword from Fort Gohn would be a start. "},{"name":"VARTHON","text":"I... I didn't realize it meant that much to you."},{"name":"KARNES","text":"I should've been able to handle this on my own! There weren't even any sin eaters nearby, but still I ran away. I'm a coward, Varthon, a bloody coward!!!"},{"name":"VARTHON","text":"Keep your voice down, before something hears you."},{"name":"VARTHON","text":"I feel horrible for asking after I dragged you out here to find him, but I'd appreciate it if you could help a while longer."},{"name":"VARTHON","text":"I can't stand to see him like this. Knowing him, the only thing that will get him out of this sour mood is finding his father's sword."},{"name":"VARTHON","text":"Would you come with me to look for it? It should be somewhere near where his house used to be."},{"name":"VARTHON","text":"Let's get moving, then."},{"name":"KARNES","text":"I'm sorry..."},{"name":"VARTHON","text":"His house should be somewhere toward the heart of the settlement. Stay sharp. There's no telling what's lurking about."},{"name":"SYSTEM03445","text":"Escort Varthon through the ruins of Fort Gohn. Should you fail to defend him, or move too far away, he will return to the outskirts of Fort Gohn, where you may rendezvous with him before trying again."},{"name":"VARTHON","text":"Let's try and do this quietly."},{"name":"VARTHON","text":"&lt;pant&gt; &lt;pant&gt; I don't think I've ever run so fast in my life. Let's try to be a little more careful, okay?"},{"name":"VARTHON","text":"This is too much. I have to fall back."},{"name":"SYSTEM03445","text":"You have failed to successfully escort Varthon."},{"name":"SYSTEM03445","text":"Return to the outskirts of Fort Gohn and speak with Varthon to begin once more."},{"name":"SYSTEM03445","text":"You have lost sight of Varthon. Retrace your steps to find them, then escort them safely to the ruins of Fort Gohn."},{"name":"VARTHON","text":"(-Varthon-)Hmmm... No, that's not right. The pattern on the hilt is all wrong."},{"name":"VARTHON","text":"(-Varthon-)There! That's it!"},{"name":"VARTHON","text":"Oh, I can't wait to see the look on Karnes's face."},{"name":"KARNES","text":"I can't go back without that sword. I won't."},{"name":"VARTHON","text":"He's going to be so happy to see that sword."},{"name":"KARNES","text":"By the blessed Dark, you found it! Holding this sword, it feels like he's right here beside me."},{"name":"VARTHON","text":"I remember that day, when the sin eaters came. His father was one of the bravest men I've ever met."},{"name":"VARTHON","text":"I'm sure he would have wanted you to have it."}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68980]},"next":[68982]},"partials":[{"type":"npc","id":"1029024","obj":{"i":1029024,"n":"Karnes","l":2957,"q":3}},{"type":"quest","id":"68980","obj":{"i":68980,"n":"What We Do for Family","g":117,"l":"The Rak'tika Greatwood","s":4110,"f":1}},{"type":"quest","id":"68982","obj":{"i":68982,"n":"Pick Their Poison","g":117,"l":"The Rak'tika Greatwood","s":4130}}]}