{"quest":{"name":"Paved with Good Intentions","location":"The Rak'tika Greatwood","id":68984,"patch":5.0,"sort":4180,"eventIcon":71221,"issuer":1030825,"target":1031191,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>This lonesome lancer seems to be waiting for someone."],"objectives":["Search for the well-meaning mentor.","Express your /doubt to the belligerent broker.","Speak with the well-meaning mentor."],"dialogue":[{"name":"GUARD03448","text":"Forgive me, I didn't see you there. My master's absence weighs heavily on my mind."},{"name":"GUARD03448","text":"He is a powerful mage more than capable of protecting himself, but I cannot help but wonder what delays him."},{"name":"GUARD03448","text":"I plan to go and search for him, and your help would be greatly appreciated. If you should happen upon any mages of the Blessed in the woods, would you make sure they are all right?"},{"name":"ROGUE03448","text":"The hells do you think you're doing? We've got wares to sell!"},{"name":"MENTOR03448","text":"A spearman is searching for me? Ah, my apologies. My return from patrol was delayed by these two."},{"name":"MENTOR03448","text":"They released some strange creature here in the woods, and tried to assault me before it could be subdued. As you might imagine, they refuse to tell me why they would release such a monstrosity."},{"name":"ROGUE03448","text":"You'll never get it out of me, you hear? Never!"},{"name":"MENTOR03448","text":"They claim to be mere merchants, but I <span class=\"highlight\">doubt</span> the veracity of their words. Would that I could get them to speak the truth."},{"name":"MENTOR03448","text":"I sincerely <span class=\"highlight\">doubt</span> they are mere merchants. Perhaps you could persuade them to speak?"},{"name":"ROGUE03448","text":"The both of you can piss off! We didn't do anything wrong."},{"name":"SYSTEM","text":"The belligerent broker refuses to reveal what mischief he has made in the Rak'tika Greatwood. Express your <span class=\"highlight\">doubt</span> and convince him to confess to his plans."},{"name":"ROGUE03448","text":"Wh-What are you looking at us like that for? We didn't do anything, I swear!"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Glare daggers at them."},{"name":"A1","text":"Disarm them with a charming glance."},{"name":"ROGUE03448","text":"Alright! Alright, I'll talk! Just don't hurt me, please!"},{"name":"ROGUE03448","text":"Alright, I'll talk. How can I say no to a smile like that."},{"name":"ROGUE03448","text":"We brought an anemone with us, you see, and figured we could extract a fine poison from it after feeding it some of the toxic plants and critters these woods are known for."},{"name":"MENTOR03448","text":"Why would you do such a thing?"},{"name":"ROGUE03448","text":"Everywhere you look there's fighting, but never enough weapons to go around. Folks will pay well for a good poison."},{"name":"ROGUE03448","text":"But thanks to you, the anemone and all our profits are gone. I reckon it's about time we were gone too!"},{"name":"MENTOR03448","text":"Wait!"},{"name":"MENTOR03448","text":"&lt;sigh&gt; ...I suppose it's fine, though there's still the matter of the anemone. First, I must return to Slitherbough. No doubt my pupil is beside himself with worry. "},{"name":"MENTOR03448","text":"You needn't worry about my pupil. He is returned and relieved to hear I am safe."},{"name":"MENTOR03448","text":"As for the anemone, I spoke with my superiors, and I have been tasked with its capture."},{"name":"MENTOR03448","text":"I would ask your assistance, but I suspect a companion of Master Matoya has more pressing matters to attend to. Should you find yourself unoccupied, pray seek me out. I could use a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your talents."}],"reward":{"gil":779,"items":[{"id":26855}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68864]},"next":[68988]},"partials":[{"type":"npc","id":"1030825","obj":{"i":1030825,"n":"Lonesome Lancer","l":2957,"q":1}},{"type":"npc","id":"1031191","obj":{"i":1031191,"n":"Well-meaning Mentor","l":2957,"q":2}},{"type":"item","id":"26855","obj":{"i":26855,"n":"Bluespirit Bracelet Coffer (IL 403)","l":1,"c":26566,"t":61}},{"type":"quest","id":"68864","obj":{"i":68864,"n":"Saying Good-bye","g":8,"l":"The Rak'tika Greatwood","s":500}},{"type":"quest","id":"68988","obj":{"i":68988,"n":"Out of Place","g":117,"l":"The Rak'tika Greatwood","s":4190}}]}