{"quest":{"name":"Pick Their Poison","location":"The Rak'tika Greatwood","id":68982,"patch":5.0,"sort":4130,"eventIcon":71221,"issuer":1029024,"target":1029883,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Despite having his father's sword, you suspect Karnes is not yet ready to return."],"objectives":["Place the poisoned meat at the designated locations.","Speak with Karnes."],"dialogue":[{"name":"VARTHON","text":"His father meant the world to him. He may not look it, but he's elated to have that sword."},{"name":"KARNES","text":"Words can't explain how grateful I am... Thank you."},{"name":"VARTHON","text":"Sorry we put you through all this. Karnes seems well enough to walk now, so I'll see him back to Slitherbough."},{"name":"KARNES","text":"Actually, there's one last thing I wish to do while we're here."},{"name":"KARNES","text":"If we're ever to rebuild Fort Gohn, something has to be done about the animals that wander about the ruins."},{"name":"KARNES","text":"Which is why I boiled meat in a stew of poisonous mushrooms and snake venom. I was planning to place it around the ruins for the raptors to eat."},{"name":"VARTHON","text":"Are you crazy!? Master Matoya said─"},{"name":"KARNES","text":"Master Matoya isn't here, and no one ever goes to Fort Gohn, so they'll never have to know. We'll cover the west side of the ruins, you take the east."},{"name":"VARTHON","text":"Just the smell of it makes my stomach turn. I almost feel bad for the raptors..."},{"name":"KARNES","text":"Good, you've finished. Our side is taken care of as well."},{"name":"VARTHON","text":"We should leave before our clothes begin to smell of the stuff."},{"name":"VARTHON","text":"It's good to be back. I hope we haven't been too much of a bother."},{"name":"KARNES","text":"Sorry again for dragging you into my troubles."},{"name":"VARTHON","text":"I'm just glad you weren't seriously hurt. You better tell me the next time you plan to do something crazy like that."},{"name":"KARNES","text":"There won't be a next time, I promise. I can't afford to be reckless if I'm ever to be a match for my father."},{"name":"KARNES","text":"Thank you again for all your help."},{"name":"KARNES","text":"It's only a pile of rubble now, but someday I'll rebuild Fort Gohn. You wait and see."},{"name":"VARTHON","text":"You mean <span class=\"emphasis\">we'll</span> rebuild Fort Gohn. It's my home too, you know."},{"name":"VARTHON","text":"For all the people who were forced to abandon their homes. For your father..."},{"name":"KARNES","text":"You'll come and visit, won't you? We can hold a grand feast in your honor─to the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who helped make it all possible."}],"reward":{"gil":779,"items":[{"id":26854}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68981]}},"partials":[{"type":"npc","id":"1029024","obj":{"i":1029024,"n":"Karnes","l":2957,"q":3}},{"type":"npc","id":"1029883","obj":{"i":1029883,"n":"Karnes","l":2957,"q":1}},{"type":"item","id":"26854","obj":{"i":26854,"n":"Bluespirit Necklace Coffer (IL 403)","l":1,"c":26565,"t":61}},{"type":"quest","id":"68981","obj":{"i":68981,"n":"In His Memory","g":117,"l":"The Rak'tika Greatwood","s":4120}}]}