{"quest":{"name":"You're a Gem","location":"The Rak'tika Greatwood","id":68985,"patch":5.0,"sort":4150,"eventIcon":71221,"issuer":1027754,"target":1027754,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Davith is fretfully taking count of the Night's Blessed's store of gemstones."],"objectives":["Speak with the traveling trader.","Search for glittering gemstones.","Deliver the glittering gemstones to the traveling trader.","Speak with Davith."],"dialogue":[{"name":"DAVITH","text":"Yes? Oh, my apologies. I'm expecting a delivery of goods from the Crystarium."},{"name":"DAVITH","text":"That is where you are from, yes? If you should happen to see a merchant on the path there when next you return, please tell them we eagerly await their arrival."},{"name":"DAVITH","text":"I do hope the merchant is all right."},{"name":"TROUBLEDMERCHANT03449","text":"Davith of Slitherbough awaits my arrival? Oh dear, I am rather late, aren't I?"},{"name":"TROUBLEDMERCHANT03449","text":"I would have arrived there bells ago, but my amaro was chased off the path by a treant."},{"name":"TROUBLEDMERCHANT03449","text":"Before I could settle her down, half of my cargo had been sent tumbling into the lake."},{"name":"TROUBLEDMERCHANT03449","text":"I've recovered everything save for a handful of gemstones that rolled beyond the shallows into the depths of the lake. It's so dreadfully deep, I could never hope to hold my breath long enough to dive down and retrieve them."},{"name":"TROUBLEDMERCHANT03449","text":"You will? Truly? Bless you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"TROUBLEDMERCHANT03449","text":"There are five gemstones in total. Retrieve them and I will see to it you are handsomely rewarded."},{"name":"TROUBLEDMERCHANT03449","text":"Were you able to find them all?"},{"name":"TROUBLEDMERCHANT03449","text":"Were you able to find them all?"},{"name":"TROUBLEDMERCHANT03449","text":"By the blessed Dark, you've done it!"},{"name":"TROUBLEDMERCHANT03449","text":"I better hurry to Slitherbough, then. I will leave your reward with Davith. Safe travels, friend."},{"name":"DAVITH","text":"A merchant arrived not long ago with our delivery. As he told it, some brave traveler dove into the lake to retrieve several jewels for him, and I suspect I know who."},{"name":"DAVITH","text":"I believe this is for you."},{"name":"DAVITH","text":"You have done a great deed for the Night's Blessed. Perhaps greater than you realize."},{"name":"DAVITH","text":"We call them heartstones. They are blessed by our priests and given to all at birth. We are never to part with them, from our first breath to our last."},{"name":"DAVITH","text":"Of course, heartstones are not all made of the same jewel. Parents are to choose from one of several to be presented to their children. Thanks to you, we now have an ample selection."}],"reward":{"gil":852},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68864]}},"partials":[{"type":"npc","id":"1027754","obj":{"i":1027754,"n":"Davith","l":2957,"q":1}},{"type":"quest","id":"68864","obj":{"i":68864,"n":"Saying Good-bye","g":8,"l":"The Rak'tika Greatwood","s":500}}]}