{"quest":{"name":"From the Heart","location":"The Rak'tika Greatwood","id":68989,"patch":5.0,"sort":4201,"eventIcon":71221,"issuer":1031341,"target":1031341,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>This bashful bowman could do with some advice."],"objectives":["Speak with the bashful bowman."],"dialogue":[{"name":"HUNTER03453","text":"I realize this is sudden, but would you lend me your ear for a moment? I would rather keep this secret from the others if possible. "},{"name":"HUNTER03453","text":"I mean to propose to my beloved, and everything needs to be perfect, right down to where I spring the question."},{"name":"HUNTER03453","text":"Being what I presume to be a worldly traveler, I thought perhaps you could give me your opinion on the view from a few places I had in mind."},{"name":"HUNTER03453","text":"Good, good. My first choice was a quaint little place to the north. Follow me."},{"name":"HUNTER03453","text":"What do you think? I thought the view of Yx'Maja might set the mood."},{"name":"HUNTER03453","text":"A pity we can only view it from afar. I've heard the flowers there are quite beautiful, but the woods there are fiercely guarded."},{"name":"HUNTER03453","text":"Aha, that's it! “My dear, sweet beloved. Let me be the guardian to your ruins of Ronka, now and forevermore.”<br>Do you think she would accept such a proposal?"},{"name":"HUNTER03453","text":"No...? Well, I will give it some thought. Come, let me show you another spot near Lake Tusi Mek'ta."},{"name":"HUNTER03453","text":"Is the view of the lake not breathtaking?"},{"name":"HUNTER03453","text":"At its bottom rests the Covered Halls of Dwatl, one of several ruins of the Ronkan Empire. "},{"name":"HUNTER03453","text":"Ah! I have it now! “The ruin that is your love has sunk to the bottom of my heart. And there it shall remain for all time.”<br>The perfect proposal, don't you think?"},{"name":"HUNTER03453","text":"No, you're right. The wording could use a little work. Perhaps my third choice of location will prove inspirational."},{"name":"HUNTER03453","text":"This is perhaps my favorite of the three. Simple, quiet, and peaceful."},{"name":"HUNTER03453","text":"Hmmm... Perhaps that is all I need to propose─a simple expression of my love."},{"name":"HUNTER03453","text":"I realize there is much to consider, so you needn't give me your opinion now. Let us give it due thought while we return to Slitherbough."},{"name":"HUNTER03453","text":"Thank goodness you're here. The more I think on it, the more uncertain I become. Tell me, which place do you think would help me win her heart?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I think the view of Yx'Maja would be best."},{"name":"A1","text":"The view from the edge of the lake was quite lovely."},{"name":"A1","text":"The calm and quiet at the lake's center would be perfect."},{"name":"HUNTER03453","text":"I suppose there is a certain charm to that place. All right, that is where I'll propose."},{"name":"HUNTER03453","text":"It was, wasn't it? And there'd be no risk of falling in if we remain at its edge. All right, that is where I'll propose."},{"name":"HUNTER03453","text":"The center of the lake, eh? There would be nothing to distract me from telling her how I truly feel. All right, that is where I'll propose."},{"name":"HUNTER03453","text":"I was right to call upon you. What better place than that to offer her my true name."},{"name":"HUNTER03453","text":"...Are you not familiar with the custom? Only immediate family should know one's true name. It's the only way to protect our hearts from the Light."},{"name":"HUNTER03453","text":"Which is why revealing one's name to another is of such great significance. Though I suspect my choice of words in proposing may yet sour the moment."},{"name":"HUNTER03453","text":"But don't you worry. When the time is right, I'm certain the words will flow freely."}],"reward":{"gil":852,"items":[{"id":26853}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68864]}},"partials":[{"type":"npc","id":"1031341","obj":{"i":1031341,"n":"Bashful Bowman","l":2957,"q":1}},{"type":"item","id":"26853","obj":{"i":26853,"n":"Bluespirit Earring Coffer (IL 403)","l":1,"c":26564,"t":61}},{"type":"quest","id":"68864","obj":{"i":68864,"n":"Saying Good-bye","g":8,"l":"The Rak'tika Greatwood","s":500}}]}