{"quest":{"name":"Worth a Candle","location":"The Rak'tika Greatwood","id":68983,"patch":5.0,"sort":4140,"eventIcon":71221,"issuer":1027742,"target":1027742,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Alsa is excited to see you."],"objectives":["Place the blue-flamed candles.","Speak with Alsa."],"dialogue":[{"name":"ALSA","text":"Ah, one of Master Matoya's guests. You've come at an opportune time."},{"name":"ALSA","text":"I was preparing to take a walk and tend to the candles about Slitherbough, and I would ask you assist me. I can think of no finer opportunity to learn more of our people."},{"name":"ALSA","text":"Take these three candles, and replace any that appear to be nearly spent. A simple task, I know, but I believe it will prove most illuminating."},{"name":"ALSA","text":"You need only place the three candles I gave you. I will take care of the rest."},{"name":"PRAYINGMAN03447","text":"A fresh candle. How thoughtful of you."},{"name":"PRAYINGMAN03447","text":"Whenever I'm feeling stressed, watching the flames helps settle my nerves. Something about the way they flicker and dance is so soothing to me. Perhaps you should give it a try sometime."},{"name":"PRAYINGMAN03447","text":"Pay me no mind. I'll be returning to work soon enough."},{"name":"HELPFULGIRL03447","text":"Thanks, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>. You're real good at placing candles."},{"name":"HELPFULGIRL03447","text":"Mama says the night sky has candles. Lots and lots of candles. So many you can't count them all. I bet I could, though!"},{"name":"HELPFULGIRL03447","text":"Have you seen the candles outside, in the sky? There's so many! Mama said there's too many to count, but I bet I could if I wanted."},{"name":"HELPFULGIRL03447","text":"They're really pretty, but I think I like the candles in here more."},{"name":"HELPFULGIRL03447","text":"Hey <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>, why do you dress so funny? Is it for your work? Mama makes medicine and Papa is a guard. He's always busy outside, so I try to help lots and lots inside. "},{"name":"CANDLEWOMAN03447","text":"Beautiful, aren't they? Like the souls of the departed, burning bright in the sunless sea above."},{"name":"CANDLEWOMAN03447","text":"I often come here to pay respects to our forebears, reflecting on the sacrifices that allowed us to live as we do now."},{"name":"CANDLEWOMAN03447","text":"What do you see when you look into the flames?"},{"name":"ALSA","text":"You are returned, and enlightened by the experience, I trust. We are a quiet people, but conversation comes easy in the presence of the candles."},{"name":"ALSA","text":"Before the Flood, our worship would no doubt have been seen as profane. Sacrilege..."},{"name":"ALSA","text":"But it is the expression of our faith that defines us, not the object of our worship."},{"name":"ALSA","text":"I can but imagine what change may come to the Night's Blessed should the night ever return to us."},{"name":"ALSA","text":"I can but imagine what change will come to the Night's Blessed now that the night has returned to us."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68864]}},"partials":[{"type":"npc","id":"1027742","obj":{"i":1027742,"n":"Alsa","l":2957,"q":1}},{"type":"quest","id":"68864","obj":{"i":68864,"n":"Saying Good-bye","g":8,"l":"The Rak'tika Greatwood","s":500}}]}