{"quest":{"name":"Her True Calling","location":"Lakeland","id":68995,"patch":5.0,"sort":4060,"icon":100856,"eventIcon":71221,"issuer":1030713,"target":1030712,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Callea would use the venom you procured to prepare an antidote.","As you keep watch, Callea swiftly mixes the antidote that will cure the unfortunate soldier of the poison that wracks his body. Desperate to get back to her patient's side, she dashes off through the forest alone, potentially putting herself in peril. Follow the girl before any harm comes her way.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Dashing through the dark wood, you come upon a particularly nasty beast eyeing Callea menacingly. You stride forward, ready to dispose of the foul creature before it feasts on the poor girl.","You make short work of your foe, rescuing Callea from an untimely demise. Return with the aspiring physician to Fort Jobb, where she would administer the antidote to her ailing patient.","No sooner have you returned to Fort Jobb and reunited with Nielden than does Callea emerge triumphantly from her chamber to inform you that the antidote was remarkably effective─the young soldier will live. What's more, the experience has instilled the girl with a newfound confidence. She explains that, while she appreciates your efforts, she has decided against relocating to the Crystarium in favor of staying behind to take over the infirmary. Grinning from ear to ear, Nielden observes just how much Callea has come to resemble her father, and offers her his continued support as she begins her new career. Exchanging a fond farewell with your friends, you prepare to take to the road once more."],"objectives":["Search for Callea.","Rescue Callea.","Speak with Nielden at Fort Jobb."],"dialogue":[{"name":"CALLEA","text":"This shouldn't take long. Keep a lookout and make sure no nasty fiends sneak up on us!"},{"name":"CALLEA","text":"That should do it! Quickly now, we must hurry back to the fort while the boy still draws breath!"},{"name":"SYSTEM","text":"Thinking only of her patient, Callea runs off ahead, unaware that the scent of the medicine may attract unwanted attention. You would be wise to go after her..."},{"name":"CALLEA","text":"&lt;pant&gt; &lt;pant&gt; Oh, <span class=\"highlight\">Forename</span>...thank you... I was not looking...not thinking... Before I knew it...the beast was upon me..."},{"name":"CALLEA","text":"Fortunately, I am unhurt...and the medicine is safe... It's a miracle..."},{"name":"CALLEA","text":"No...it was you, <span class=\"highlight\">Forename</span>. I shudder to even think of what would have happened if you had not rushed to my side as you did."},{"name":"CALLEA","text":"But my foolishness has already cost us too much time. Come, we must hurry back to Fort Jobb before it is too late!"},{"name":"NIELDEN","text":"Good to see ye back in one piece, friend. Callea's inside tendin' to the boy. I reckon we should leave her alone till the job is done."},{"name":"CALLEA","text":"The treatment is complete. The poison has been flushed from his system. Though it will take time for him to regain his strength, the man will live."},{"name":"CALLEA","text":"My hair? I simply tied it back, the way Father always did when he was working. He would always say that he wanted nothing to block his field of vision when examining his patients."},{"name":"NIELDEN","text":"Wicked white, if ye ain't the spittin' image of him! And mind ye, I ain't just talkin' about yer looks."},{"name":"CALLEA","text":"Why...whatever do you mean, Uncle Nielden?"},{"name":"NIELDEN","text":"The fire burnin' in yer eyes. The way ye couldn't think of nothin' but the poor boy who needed yer help. The way ye didn't hesitate to fling yerself into harm's way for his sake..."},{"name":"NIELDEN","text":"I swear, it's as if yer whole family is determined to send ol' Uncle Nielden to an early grave out of sheer fright. Like father, like daughter...for better and for worse."},{"name":"CALLEA","text":"Is it possible...that I resemble Father more than I thought?"},{"name":"NIELDEN","text":"Aye, girl...aye. An' not just your own father, but his father before him. Ye never met him, but I did, and I can say it for certain: ye come from a long line o' folks with more compassion than common sense."},{"name":"NIELDEN","text":"Colphas's father wasn't a healer, but a soldier─one of the first members of the Crystarium guard. Time an' again, he put his life on the line here at Fort Jobb to keep those who were building the city safe."},{"name":"NIELDEN","text":"To Colphas and I, he was a hero. An' so we swore a vow one day that we'd follow in his footsteps an' protect the people of this land from danger."},{"name":"NIELDEN","text":"That's how I came to join the guard. Colphas, on the other hand, was never much one for fightin'. He struggled with this at first, but eventually, he was able to find a callin' of his own."},{"name":"NIELDEN","text":"An' whatever he lacked in brute strength, he more than made up for with his courage. Courage that I see is alive an' well in his daughter."},{"name":"CALLEA","text":"Courage, indeed..."},{"name":"NIELDEN","text":"Wouldn't ye agree, <span class=\"highlight\">Forename</span>? Yer no stranger to acts of risking yer life for the sake of others, after all..."},{"name":"NIELDEN","text":"Come now. Uncle Nieldy's no fool. Don't think I haven't heard from my fellow guards about your rescue mission with Captain Lyna during the raid on Holminster."},{"name":"NIELDEN","text":"Rushin' into a den o' sin eaters just to save those poor villagers. That's a selfless act o' courage and self-sacrifice if I've ever heard o' one."},{"name":"CALLEA","text":"Is this true, <span class=\"highlight\">Forename</span>? That you risked your very life to save the people of Holminster? But, they were strangers to you, yes?"},{"name":"CALLEA","text":"How...how was it that you were able to put yourself in peril for the sake of total strangers?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I could not stand back and do nothing."},{"name":"A1","text":"..."},{"name":"CALLEA","text":"I see... And so...you did what you felt you had to do."},{"name":"CALLEA","text":"...Say no more. I understand. This is my own question, and I must find the answer for myself."},{"name":"CALLEA","text":"Thanks to you, it is finally clear to me. I know what I must do."},{"name":"CALLEA","text":"<span class=\"highlight\">Forename</span>, Uncle Nielden...pray send word to the Crystarium. I will not be needing a room. I intend to stay here, at Fort Jobb, and carry on Father's legacy."},{"name":"CALLEA","text":"I know this is a dangerous place, and my own skills pale in comparison to his."},{"name":"CALLEA","text":"And yet, there is no one else better equipped to tend to these people. I would do what I can─what I <span class=\"emphasis\">must</span>."},{"name":"CALLEA","text":"Father left behind a wealth of knowledge. If I study diligently, and work to hone my skills, then one day...one day, perhaps I might be the healer he once was."},{"name":"NIELDEN","text":"Aye, my girl. I reckon ye just might."},{"name":"NIELDEN","text":"None can say what tomorrow will bring, an' yet this I know: ye've already done yer father proud. If only that stubborn bastard could've been here to see this day..."},{"name":"CALLEA","text":"Thank you for always believing in me. But my journey to follow in Father's footsteps has only begun."},{"name":"NIELDEN","text":"That's the spirit, girl! But remember─you needn't walk the path alone. If yer ever findin' yerself overwhelmed by it all, you can always give Uncle Nieldy a shout."},{"name":"CALLEA","text":"Thank you, my friend...I will."},{"name":"CALLEA","text":"And you, <span class=\"highlight\">Forename</span>. I was but a stranger to you, and yet you have shown me more kindness than anyone."},{"name":"CALLEA","text":"Your selflessness has inspired me to find something deep within me that, were it not for you, I never would have known was there. I thank you from the bottom of my heart."}],"reward":{"gil":715,"items":[{"num":2,"id":27857,"one":1},{"num":2,"id":27858,"one":1},{"num":2,"id":27859,"one":1},{"num":2,"id":27860,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68994]},"next":[69051]},"partials":[{"type":"npc","id":"1030713","obj":{"i":1030713,"n":"Callea","l":2953,"q":2}},{"type":"npc","id":"1030712","obj":{"i":1030712,"n":"Nielden","l":2953,"q":1}},{"type":"item","id":"27857","obj":{"i":27857,"n":"Spaghetti al Nero","l":400,"c":24027,"t":46}},{"type":"item","id":"27858","obj":{"i":27858,"n":"Broad Bean Salad","l":400,"c":24207,"t":46,"p":3453}},{"type":"item","id":"27859","obj":{"i":27859,"n":"Grilled Platinum Bream","l":400,"c":24301,"t":46}},{"type":"item","id":"27860","obj":{"i":27860,"n":"Baguette","l":403,"c":24030,"t":46,"p":3501}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68994","obj":{"i":68994,"n":"In Father's Footsteps","g":113,"l":"Lakeland","s":4050}},{"type":"quest","id":"69051","obj":{"i":69051,"n":"Flowering Friendships","g":113,"l":"Lakeland","s":7140}}]}