{"quest":{"name":"Carrying On","location":"Lakeland","id":68993,"patch":5.0,"sort":4040,"icon":100856,"eventIcon":71221,"issuer":1030709,"target":1030711,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Nielden would go to the side of someone who needs him.","Nielden shares with you some more background about his fallen friend Colphas, and how he raised his daughter Callea all by himself. The Galdjent guard also confesses a lack of confidence that he will be able to offer the girl everything she needs, and asks if you would be willing to go with him and lend a helping hand. Moved by his generosity and sympathy for the orphaned girl's plight, he resolves to make the trip back to Fort Jobb.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Back at Fort Jobb, Callea profusely expresses her gratitude to you and Nielden, though it is clear that the girl is still struggling to come to terms with her father's sudden passing. Feeling that she is woefully unprepared to follow on in her father's footsteps, she has a mind to close down the infirmary and begin a new life in the Crystarium. At Nielden's asking, you set off for the city to arrange temporary lodgings for Callea with Sylgham at the Catenaries.","At the Catenaries, the clerk Sylgham sympathizes with Callea's plight. Despite the recent trying circumstances, he is pleased to be able to inform you a room has just opened up, and offers to reserve it immediately for your orphaned acquaintance. Brave the road back to Fort Jobb and share the good news with your friends.","You return to Fort Jobb to a disconcerting scene. Though Nielden and Callea are pleased to hear the news, they seem preoccupied with something that has happened in your absence. Allow Callea a moment to compose herself, and then inquire as to what the matter is."],"objectives":["Speak with Callea at Fort Jobb.","Speak with Sylgham at the Catenaries.","Speak with Callea at Fort Jobb."],"dialogue":[{"name":"NIELDEN","text":"Well, there's nothin' to be gained from standin' around here mopin'. Callea needs me, so I'd best take to the road."},{"name":"NIELDEN","text":"Colphas lost both his dear wife and parents not long after the girl was born. Raised Callea all by himself, he did. They weren't rich by any means, but still he saw that she wanted for nothing."},{"name":"NIELDEN","text":"I can't even imagine what the poor girl's goin' through, all alone in this dangerous world. As Colphas's close friend, it's my duty to be there for her an' see to whatever she needs."},{"name":"NIELDEN","text":"Come to think of it, don't suppose ye'd be interested in comin' along? I'm just one man, and lookin' after Callea isn't likely to be an easy task."},{"name":"NIELDEN","text":"Yer a lifesaver, friend! I'm sure that it'll mean the world to the girl. And with that, I'd best be gatherin' my belongings. See ye back at Fort Jobb!"},{"name":"CALLEA","text":"Uncle Nielden...you came all the way here for me?"},{"name":"CALLEA","text":"And you, <span class=\"highlight\">Forename</span>... How can I ever repay you for your generosity?"},{"name":"NIELDEN","text":"Think nothin' of it, girl! Poor thing...ye've been through more than any child should have to suffer. But don't you worry─Uncle Nielden and <span class=\"alternative-container\"><span class=\"alternative\">Aunt</span><span class=\"alternative\">Uncle</span></span> <span class=\"highlight\">Forename</span> are here to see to your every need."},{"name":"CALLEA","text":"You truly are too kind... Everyone has been─why, even those here in the fort I have never spoken to before have stopped by to offer their sympathies. Whatever have I done to deserve such kindness?"},{"name":"NIELDEN","text":"Reckon yer old man is to thank for that. The people loved him, Callea, and they know that his daughter and assistant is cut from the same cloth. Ye've got nothin' to feel guilty about."},{"name":"CALLEA","text":"What...what are you saying, Uncle Nielden? It's my fault...all of it. I never should have let him go to that terrible place..."},{"name":"NIELDEN","text":"Don't even think of blamin' yerself for that, Callea. Yer father went there because he felt it was his duty. A hundred men couldn't have stopped that stubborn bastard once he made up his mind."},{"name":"CALLEA","text":"Yes, this is what everyone tells me. That Father was a talented physician, and a great man. That he is a hero who did not shy in the face of danger, and sacrificed himself in the name of our cause. This I know, and yet...and yet..."},{"name":"CALLEA","text":"To me, he was my <span class=\"emphasis\">father</span>! As cruel as it sounds, I couldn't care less that he died a hero! I wanted him to <span class=\"emphasis\">live</span>! But still, he left me... He...he did not even give me the chance to say good-bye..."},{"name":"NIELDEN","text":"Callea... Yer old man may have left ye here, but ye never left his mind and heart...not for one moment. Ye were more important to him than anythin'."},{"name":"CALLEA","text":"I know this, and yet...I do not understand. His duty, his patients, his daughter...how could any one man be so selfless!? Did he never stop to think of <span class=\"emphasis\">himself</span>!?"},{"name":"CALLEA","text":"Forgive me, my friends. I...I am still feeling a bit overwhelmed by it all."},{"name":"NIELDEN","text":"No apologies needed, girl. Ye've had it harder than any of us. And yet, we have to carry on without him somehow...all of us do. So tell me, Callea. What do ye plan on doin' now?"},{"name":"CALLEA","text":"The sick and wounded still show up at these doors. My heart aches for them, yet I am but a physician's assistant. I simply cannot offer them the treatment that Father once did."},{"name":"CALLEA","text":"And so I think I will head for the Crystarium. I will shutter the doors of the infirmary, sell the furniture and equipment for what little they are worth, and use the coin to fund my trip."},{"name":"NIELDEN","text":"Aye...perhaps that would be for the best. It'd be safe there, at least, an' as good a place as any to start a new life."},{"name":"NIELDEN","text":"There's a residence hall there─the Catenaries, they call it─where they give room and board to refugees and others lookin' to make the Crystarium their new home. You can take shelter there till ye find a job and place of yer own."},{"name":"NIELDEN","text":"Say, <span class=\"highlight\">Forename</span>, would ye mind goin' on ahead to make the arrangements? The boy Sylgham there's an acquaintance of mine. Space is always tight, but let him know of Callea's situation and I reckon he'll be able to find a room for her."},{"name":"CALLEA","text":"I cannot even begin to express the depths of my gratitude, friend. Thank you."},{"name":"SYLGHAM","text":"Greetings, and welcome to the Catenaries. How may I be of service to you today?"},{"name":"SYLGHAM","text":"A young girl has been orphaned at Fort Jobb, you say? This is tragic, indeed. But worry not─a room just opened up earlier today. I will reserve it for Miss Callea straightaway."},{"name":"SYLGHAM","text":"Your timing is most fortunate. Ever since the raid on Holminster Switch, refugees have been pouring in day after day, and our rooms can only hold so many."},{"name":"SYLGHAM","text":"But do not worry. We will do everything we can for your young acquaintance. There are others here who have suffered similar tragedies, and can doubtless sympathize with her plight. She will be among friends."},{"name":"SYLGHAM","text":"Needless to say, I and the rest of the staff will also watch over her closely, and see to her needs until such time as she has acclimated to life here in the Crystarium. Tell her to come in safety, and that we look forward to welcoming her to our halls."},{"name":"SYLGHAM","text":"The necessary paperwork has been filed, and there will be a room waiting for Miss Callea upon her arrival. You may tell the girl and Nielden that there is naught to worry about."},{"name":"NIELDEN","text":"Ah, there ye are. I trust all went well at the Crystarium? 'Fraid to say we had somethin' of an incident here. I'll let Callea give ye the news..."},{"name":"CALLEA","text":"Welcome back, <span class=\"highlight\">Forename</span>. I cannot thank you enough for all that you have done for me. I very much look forward to settling in to my new home at the Crystarium."},{"name":"CALLEA","text":"And yet I fear there's been something of a complication. Uncle Nielden and I had all but finished packing my things, when...! Ah, but forgive me a moment. I must collect my thoughts."}],"reward":{"gil":1115},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68992]},"next":[68994]},"partials":[{"type":"npc","id":"1030709","obj":{"i":1030709,"n":"Nielden","l":2953,"q":2}},{"type":"npc","id":"1030711","obj":{"i":1030711,"n":"Callea","l":2953,"q":2}},{"type":"quest","id":"68992","obj":{"i":68992,"n":"On Her Own","g":113,"l":"Lakeland","s":4030}},{"type":"quest","id":"68994","obj":{"i":68994,"n":"In Father's Footsteps","g":113,"l":"Lakeland","s":4050}}]}