{"quest":{"name":"Paying Respects","location":"The Rak'tika Greatwood","id":68996,"patch":5.0,"sort":5001,"eventIcon":71221,"issuer":1027715,"target":1027715,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tilmet looks eager to bend the ear of a curious traveler."],"objectives":["Speak with the downhearted Viis near the river.","Send the azure flowers flowing down the river at the designated locations.","Speak with Tilmet."],"dialogue":[{"name":"TILMET","text":"Greetings. I was just leaving to pay my respects to our departed sisters, but now that you are here I am furnished with a thought."},{"name":"TILMET","text":"Perhaps you have an interest in performing the ritual yourself? I can think of no better a way to learn more of our people and way of life."},{"name":"TILMET","text":"Ah, I knew you had an inquisitive mind. Very well, take this flower to the Wild Fete. One of our sisters there will instruct you in the ritual."},{"name":"TILMET","text":"Take the azure flower with you when you depart to the Wild Fete. One of our sisters will instruct you from there."},{"name":"VIOLETVIIS03460","text":"Tilmet guided you here? Then you are welcome. You honor me with your keen interest in our rituals."},{"name":"VIOLETVIIS03460","text":"The origins of this one stretch far back, to a time even before the Flood. In that bygone age lived a Viis known as Mjrl, who pined for the world beyond the Greatwood. After much contemplation, she finally resolved to leave her home."},{"name":"VIOLETVIIS03460","text":"On the day of her departure, however, she hesitated, and at this very spot turned back to take in the forest one last time. Knowing that she could never return, Mjrl began to cry."},{"name":"VIOLETVIIS03460","text":"Her sorrow stirred the spirits of the Greatwood, and from where her tears fell sprung a bubbling stream. In time that stream became a river, now known as Mjrl's Regret."},{"name":"VIOLETVIIS03460","text":"These azure flowers personify Mjrl. When we set them flowing down the river, we honor the memory of those who have gone and remind them they have not been forgotten."},{"name":"VIOLETVIIS03460","text":"Now try for yourself. Keep in your mind the countless Viis who have set upon their own journey. I hope you find it enlightening."},{"name":"TILMET","text":"Welcome back. How was it?"},{"name":"TILMET","text":"Mjrl's Regret is where many Viis who yearn for the outside world have made a choice. A choice between their home or their dreams."},{"name":"TILMET","text":"A close friend of mine chose the latter, long ago. I wonder if she too stood on the riverbank with tears in her eyes, as Mjrl did."},{"name":"TILMET","text":"However, even if those dear to us are no longer here, our memories of them will never fade. We set our flowers upon the waters to remind ourselves of that."},{"name":"TILMET","text":"If ever you encounter a Viis from Fanow, pray share your own story with them. The adventurous heart that led them to you would enjoy nothing more."}],"reward":{"gil":754},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68870]}},"partials":[{"type":"npc","id":"1027715","obj":{"i":1027715,"n":"Tilmet","l":2957,"q":1}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}