{"quest":{"name":"Talk of the Town","location":"The Rak'tika Greatwood","id":68999,"patch":5.0,"sort":5030,"eventIcon":71221,"issuer":1027714,"target":1027714,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Taina is looking at you as if you had two heads."],"objectives":["Deliver the bundle of arrows to the villagers.","Speak with Taina."],"dialogue":[{"name":"TAINA","text":"Oh, pardon my rudeness. I suppose I was staring too intently. I never thought I would live to see one of the allies of Ronka."},{"name":"TAINA","text":"Doubtless many others in the wood are as curious as I. I had the mind to deliver these arrows to my sisters, but perhaps you should do it in my stead. They would be overjoyed to meet someone so distinguished."},{"name":"TAINA","text":"Please, deliver the arrows to my companions. They would be glad to meet an ally of Ronka."},{"name":"VIISPEOPLEA03463000","text":"Y-You! An ally of Ronka, here!? To what do I owe the honor of this meeting?"},{"name":"VIISPEOPLEA03463000","text":"Oh? Arrows? Not what I expected, but...you have my thanks."},{"name":"VIISPEOPLEA03463000","text":"How odd. Until quite recently we only used these arrows to keep others away. Yet here I am, receiving them as a kindness from an outsider."},{"name":"VIISPEOPLEB03463000","text":"Greetings. What business do you have with me?"},{"name":"VIISPEOPLEB03463000","text":"What fortunate timing. I am soon to depart on my hunt."},{"name":"VIISPEOPLEB03463000","text":"The wood and the Viis must live together in harmony. To us, the hunt is not leisure─every part of our prey is treated with the utmost respect─from the meat to the bones to the fur."},{"name":"VIISPEOPLEC03463000","text":"One of Ronka's allies, here? Is something amiss?"},{"name":"VIISPEOPLEC03463000","text":"Taina sent you on an errand, did she? She is bold if nothing else..."},{"name":"VIISPEOPLEC03463000","text":"Nevertheless, your efforts are much appreciated. I always have need of arrows during my patrols. If ever you see me again, do not hesitate to call out. My jaculus does not bite."},{"name":"VIISPEOPLED03463000","text":"By the gods, an ally of Ronka! Are you certain you meant to speak with me? If so, then...why?"},{"name":"VIISPEOPLED03463000","text":"Arrows, from one such as you? You have a brave soul and a kind heart. Receiving this gift...I am overwhelmed! Pray look the other way!"},{"name":"TAINA","text":"Returned at last. One of my companions has already commented on your generous deed. She scolded me, as is her nature."},{"name":"TAINA","text":"However, under her wrath was joy, plain as day. Allow me to thank you again for giving my companions an experience they will not soon forget."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68870]}},"partials":[{"type":"npc","id":"1027714","obj":{"i":1027714,"n":"Taina","l":2957,"q":2}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}