{"quest":{"name":"Special Delivery","location":"The Rak'tika Greatwood","id":68990,"patch":5.0,"sort":4210,"eventIcon":71221,"issuer":1027750,"target":1027750,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Asgeir is confused by what he found in the woods."],"objectives":["Investigate the designated location.","Deliver the pristine crate to Asgeir."],"dialogue":[{"name":"ASGEIR","text":"I was out gathering lumber the other day when out of nowhere an arrow came whistling past my head. It wasn't until I regained my composure that I realized a letter had been tied to it."},{"name":"ASGEIR","text":"Or rather, a map, which had a location not far from here marked on it."},{"name":"ASGEIR","text":"It's likely a trap, but I suspect whatever danger may be lying in waiting will prove little trouble for a guest of Master Matoya. If you should find anything there, be it treasure or something else, I would gladly share it with you."},{"name":"ASGEIR","text":"I know not where the map came from, but I'm curious to see what you find."},{"name":"ASGEIR","text":"Ah, you are returned. Did you find anything?"},{"name":"ASGEIR","text":"A crate...?<br>It's filled with staves and bows. &lt;gasp&gt; It couldn't be..."},{"name":"ASGEIR","text":"A number of weapons were stolen from our storehouse but a few days past. We tracked them as far as we could, but their trail went cold at the border to Yx'Maja."},{"name":"ASGEIR","text":"Do you suppose the keepers of Yx'Maja placed the crate there?"},{"name":"ASGEIR","text":"At any rate, we are grateful to have our weapons returned to us, though I can't imagine you would have need of them. But you must be compensated for your troubles. Here─this is for you."}],"reward":{"gil":706},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68864]}},"partials":[{"type":"npc","id":"1027750","obj":{"i":1027750,"n":"Asgeir","l":2957,"q":1}},{"type":"quest","id":"68864","obj":{"i":68864,"n":"Saying Good-bye","g":8,"l":"The Rak'tika Greatwood","s":500}}]}