{"quest":{"name":"On Her Own","location":"Lakeland","id":68992,"patch":5.0,"sort":4030,"icon":100856,"eventIcon":71221,"issuer":1030707,"target":1030709,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Callea is at her wits' end.","The young Callea shares with you her plight. As she tells it, her father Colphas─proprietor of the infirmary you visited─is dead, slain by a vile sin eater at Holminster Switch. She would share the sad news with Nielden, a close friend of her father's who made a promise to look after the girl in the event of tragedy, but fears that she would never survive the trip to his distant and dangerous post. With a smile, you tell the girl you would be more than happy to travel to Radisca's Round in her stead.<br><br>※Please note that the difficulty of this quest has been synced to your current level. ","At Radisca's Round, Nielden is devastated to hear the news about his friend, but thanks you for sharing it with him. He states that while he would like nothing more than to dash to Callea's side, he first must find someone to cover his post in his absence. As he is on active duty, he asks that you make the request with his superior─one Captain Mynes─on his behalf.","Captain Mynes is disheartened to hear of the loss of one of the most skilled and beloved physicians in the realm. He is quick to grant Nielden's request for a leave of absence to tend to Callea, no doubt a testament to the great respect the girl's father granted. Return and share the good news with the gentle Galdjent guard.","Nielden is relieved to hear of Captain Mynes's generosity, but remains disheartened over the loss of Colphas. He shares with you some more recollections of his fallen friend, and reaffirms his commitment to go to the side of the daughter Colphas left behind. For your part, you resolve to offer what support you can."],"objectives":["Speak with Nielden at Radisca's Round.","Speak with Mynes.","Speak with Nielden."],"dialogue":[{"name":"CALLEA","text":"Oh, dear... Whatever am I to do?"},{"name":"CALLEA","text":"Hm...? Forgive me, I didn't see you there. You have come seeking treatment, I presume? I'm afraid we're not taking in any new patients at the moment..."},{"name":"CALLEA","text":"Hm? You're not ailing, you say? I'm sorry, I simply assumed. This is an infirmary, you see. Or rather, I should say...it used to be."},{"name":"CALLEA","text":"My father ran it, you see, but he...he is no longer with us. Devoured by a sin eater at the battle of Holminster Switch, or so I was told. I...I did not even have the chance to say good-bye."},{"name":"CALLEA","text":"And so I am alone in this world now. There is one man─a member of the guard and dear friend of my father's─who promised he would look after me if things came to the worst. But then he was transferred to a distant and dangerous post, and thus I am unable to so much as share with him the unfortunate news."},{"name":"CALLEA","text":"Hmm... You look like someone who can hold <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> own in battle. Would you be so kind as to brave the road and convey my message to this man? Of course, I would compensate you well for your efforts."},{"name":"CALLEA","text":"The man's name is Nielden, and─gods willing─he still serves at Radisca's Round. Pray seek him out, and tell him that Colphas lives no longer. It pains me to ask a stranger to be the bearer of such grim news, but it would mean everything to me."},{"name":"CALLEA","text":"The road is long, and fraught with danger─I would not get very far on my own. I cannot force you to do this, but...can you find it in your heart to help me?"},{"name":"CALLEA","text":"Thank you, my friend. I have no words to express my gratitude. My name is Callea...might I ask yours?"},{"name":"CALLEA","text":"A gentle name, indeed. Thank you, <span class=\"highlight\">Forename</span>...and be safe."},{"name":"CALLEA","text":"Pray seek out the guard Nielden at Radisca's Round and tell him that Colphas lives no longer. And thank you, my friend...this means the world to me."},{"name":"NIELDEN","text":"Hm? Somethin' I can do for ye?"},{"name":"NIELDEN","text":"The sin eaters got Colphas!? Say it ain't so!"},{"name":"NIELDEN","text":"The bloody fool! How many times did I tell 'im? “Forget that damned battle, and stay home with Callea! The girl needs ye!” But did he listen?"},{"name":"NIELDEN","text":"Forgive me, friend. It's just...the man was like a brother to me. Anyhow, I'd like nothin' more than to rush to Callea's side with ye, but I can't very well run off like that. 'Least not without findin' someone to cover my post."},{"name":"NIELDEN","text":"If ye could spare a minute, maybe ye could go have a talk with my superior? Captain Mynes is a stern man, but also a reasonable one. I reckon he wouldn't begrudge me a brief respite to see the girl. After all, she's almost family."},{"name":"NIELDEN","text":"Can't thank ye enough, friend. You'll find the captain inside the tower. I'd best be getting back to my post. I look forward to hearin' the good word."},{"name":"MYNES","text":"Colphas, slain by a sin eater!? Are you certain of this!?"},{"name":"MYNES","text":"Truly, this is a sad day for our cause. He was a fine physician─one of the best we had. I've long since lost count of how many men were plucked back from the brink of death by his hand."},{"name":"MYNES","text":"Aye, he was also one of the bravest men I knew. Though he was no warrior, he did not hesitate to venture beyond the safe walls of the Crystarium and tend to patients on the front lines. It was in this spirit that he chose to establish the infirmary at Fort Jobb."},{"name":"MYNES","text":"But he is gone now, and we must carry on without him. As for Nielden's request for a leave of absence, consider it granted. Tell him to do what he must for Colphas's girl. I will see that his post is covered."},{"name":"MYNES","text":"In truth, we can ill afford to lose even a single good man at a time like this. And yet, there are certain things that must not be compromised. Tell Nielden he may go to the girl's side with my blessing."},{"name":"MYNES","text":"Every day, our numbers dwindle. We can scarcely fend for ourselves as is. Yet I would not think for a moment to begrudge Nielden his request. Tell him to go with my blessing. We will find a way to make do."},{"name":"NIELDEN","text":"Oho, there ye are! What's the good word, friend!?"},{"name":"NIELDEN","text":"The captain said <span class=\"emphasis\">what</span>!? Ahaha! Must be goin' soft in his older age. Figured he'd at least have told me to hurry back...goes to show ye just what people thought of Colphas."},{"name":"NIELDEN","text":"He was a good man. Treated every patient with dignity and respect, be they prince or pauper. An' he wouldn't think twice about riskin' his own life when others' lives were in danger."},{"name":"NIELDEN","text":"Could barely swing a sword, yet it wouldn't stop him from bravin' monster-infested forests, roads roamed by sin eaters, and the gods know what else. He even showed his face here at the Round from time to time."},{"name":"NIELDEN","text":"...'Course, that's what did him in in the end. And yet, I reckon he died with no regrets...save for leavin' poor Callea behind to fend for 'erself."},{"name":"NIELDEN","text":"Anyhow, ye have my thanks, friend. And with that, I'd best prepare to hit the road. There's someone who needs me."}],"reward":{"gil":679,"items":[{"id":26856}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68858]},"next":[68993]},"partials":[{"type":"npc","id":"1030707","obj":{"i":1030707,"n":"Callea","l":2953,"q":1}},{"type":"npc","id":"1030709","obj":{"i":1030709,"n":"Nielden","l":2953,"q":2}},{"type":"item","id":"26856","obj":{"i":26856,"n":"Bluespirit Ring Coffer (IL 403)","l":1,"c":26567,"t":61}},{"type":"quest","id":"68858","obj":{"i":68858,"n":"A Party Soon Divided","g":8,"l":"The Crystarium","s":440}},{"type":"quest","id":"68993","obj":{"i":68993,"n":"Carrying On","g":113,"l":"Lakeland","s":4040}}]}