{"quest":{"name":"Blessings of the Wood","location":"The Rak'tika Greatwood","id":68998,"patch":5.0,"sort":5020,"eventIcon":71221,"issuer":1027716,"target":1027716,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Lanille looks expectantly into the woods, as if waiting for someone."],"objectives":["Search for Lanille's niece.","/pray before the sacred tree.","Report to Lanille."],"dialogue":[{"name":"LANILLE","text":"Gods...that girl never listens...!?<br>Oh! It is you. How much of my grumbling did you hear?"},{"name":"LANILLE","text":"An elder's torment knows no end. I sent my niece out to gather branches for a bow, but she has yet to return. Knowing her pious nature, doubtless she is lost in prayer under some tree or the other."},{"name":"LANILLE","text":"While I would never deny her her faith, she must learn not to neglect her worldly duties. My warnings fall on deaf ears, however. Perhaps you can succeed where I failed. Could you speak with her on my behalf? She is likely somewhere in the Wild Fete. "},{"name":"LANILLE","text":"I am at my wit's end, so I must ask for your help. Pray find my niece at the Wild Fete and instruct her to return here at once."},{"name":"PRAYERFULVIIS03462","text":"..."},{"name":"PRAYERFULVIIS03462","text":"Oh, my apologies, I did not notice you. It is so easy to become lost in my quiet of the wood..."},{"name":"PRAYERFULVIIS03462","text":"What? Lanille sent you? I see... It seems I must apologize for becoming your burden as well. "},{"name":"PRAYERFULVIIS03462","text":"However, it would have been remiss of me to return without saying my proper benedictions. After all, a branch is but a gift of the wood, a piece of its life force that we must be grateful for. "},{"name":"PRAYERFULVIIS03462","text":"This tree is said to be blessed by Yx'Maja, goddess of beauty and the hunt. It is only natural that I should say thanks here before receiving the wood's bounty."},{"name":"PRAYERFULVIIS03462","text":"Would you care to join me? Ask for the tree's protection, that you might be safeguarded from danger in the journey ahead."},{"name":"PRAYERFULVIIS03462","text":"Who knows what perils you may face in the future? <span class=\"highlight\">Pray</span> for the blessing of the goddess to set your mind at ease."},{"name":"SYSTEM","text":"The wood is waiting to give its blessing to any who would <span class=\"highlight\">pray</span> for it."},{"name":"PRAYERFULVIIS03462","text":"Very good. Now the goddess shall watch over your every step."},{"name":"PRAYERFULVIIS03462","text":"Now, I suppose it is time I seek out a suitable branch. Please tell Lanille that I shall be home soon."},{"name":"LANILLE","text":"You have returned. I hope she did not prove too troublesome."},{"name":"LANILLE","text":"So, even a warrior such as you can be convinced to say a humble prayer? Perhaps there is power in her conviction after all. Very well, I too shall pray that the goddess keeps you in good health."}],"reward":{"gil":827},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68870]}},"partials":[{"type":"npc","id":"1027716","obj":{"i":1027716,"n":"Lanille","l":2957,"q":6}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}