{"quest":{"name":"A Recipe for Trouble","location":"The Rak'tika Greatwood","id":68997,"patch":5.0,"sort":5010,"eventIcon":71221,"issuer":1027732,"target":1027732,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ciuille needs someone to rescue her from a culinary mishap."],"objectives":["Slay blue deer does and obtain their meat.","Set the doe meat as bait at the designated location.","Lie in wait for the scarred caracal and slay it when it appears.","Return the doe meat and caracal blood to Ciuille."],"dialogue":[{"name":"CIUILLE","text":"Ah, a savior appears in my most desperate moment! Who? Why, that would be you, of course."},{"name":"CIUILLE","text":"You see, I became so absorbed in my work, I failed to notice I lacked the provisions to apply the final touches. I would procure them myself, but I cannot very well leave the food to cool."},{"name":"CIUILLE","text":"That is why I must ask you for help. Please, would you gather meat and blood and return them to me? You have my word you will not go unrewarded."},{"name":"CIUILLE","text":"Splendid! You have no idea how much your aid means to me."},{"name":"CIUILLE","text":"The task is a simple one, but requires several steps. In order to obtain the fresh blood I require, you must draw out a scarred caracal with the meat of its prey."},{"name":"CIUILLE","text":"They are known to hunt blue deer does, which can be found near Bowrest. Embark on a hunt of your own, and place two pieces of the doe meat as bait near trees around the camp."},{"name":"CIUILLE","text":"The rest is painless. Slay any caracals that come seeking an easy meal, and bring me their blood. This task is more vital than you can know, but I trust you to get it done."},{"name":"CIUILLE","text":"Use the doe meat to draw out the caracals, and bring their blood back to me. A simple enough task for one of your capabilities."},{"name":"CIUILLE","text":"How goes the hunt? Do you have the ingredients?"},{"name":"CIUILLE","text":"I knew you were up to the challenge! Gods bless the day I met an ally of Ronka!"},{"name":"CIUILLE","text":"This meal is no ordinary one. I am preparing it for my companions who were wounded while patrolling the Greatwood."},{"name":"CIUILLE","text":"It is meant to help the body mend, and for that I needed the lifeblood and flesh of a beast most savage. It is a wonder I overlooked such ingredients in the first place..."},{"name":"CIUILLE","text":"Nonetheless, I thank you for your help. We shall toast in your honor!"}],"reward":{"gil":900,"items":[{"num":2,"id":27868}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68870]}},"partials":[{"type":"npc","id":"1027732","obj":{"i":1027732,"n":"Ciuille","l":2957,"q":1}},{"type":"item","id":"27868","obj":{"i":27868,"n":"Mushroom Skewer","l":409,"c":24201,"t":46,"p":3595}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}