{"quest":{"name":"A Sight Unseen","location":"The Rak'tika Greatwood","id":69000,"patch":5.0,"sort":5040,"eventIcon":71221,"issuer":1029992,"target":1029992,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>This lionhearted hunter would see what an ally of Ronka is made of."],"objectives":["Speak with the lionhearted hunter.","Slay the foraging does.","Speak with the lionhearted hunter.","Search the Wild Fete.","Speak with the lionhearted hunter.","Speak with the lionhearted hunter again.","Speak with the lionhearted hunter one last time."],"dialogue":[{"name":"VIISHUNTER03464","text":"You there, perhaps you can accompany me on a patrol of the wood."},{"name":"VIISHUNTER03464","text":"As an ally of Ronka, it may serve you well to see how we Viis ensure the safety of our sacred sites. Do you not agree?"},{"name":"VIISHUNTER03464","text":"Splendid! Very well, we begin at once. I shall await you at Bowrest."},{"name":"VIISHUNTER03464","text":"Shhh! We must be quiet. Look there, in the brush. A pair of afflicted does seeks refuge, but they cannot escape their fate. I shall draw them out─you do the rest."},{"name":"VIISHUNTER03464","text":"Do not hesitate! Your prey is before you!"},{"name":"VIISHUNTER03464","text":"What skill! Truly you are worthy of your title. I only said your prey was weakened to embolden you, but it appears that was unnecessary."},{"name":"VIISHUNTER03464","text":"Well then, let us proceed. You have proven your mettle, so it would be best for us to patrol separate routes from now on."},{"name":"VIISHUNTER03464","text":"Look after the area near the Wild Fete. I shall depart to the Morning Stars."},{"name":"VIISHUNTER03464","text":"Once you have finished, meet back here. Be safe."},{"name":"SYSTEM03464","text":"An arrow pierces the hide of the caracal. It appears to have fallen in a single shot."},{"name":"VIISHUNTER03464","text":"You are returned already. I take it your patrol was as uneventful as mine."},{"name":"VIISHUNTER03464","text":"What? A single arrow? Impossible...can it be?"},{"name":"VIISHUNTER03464","text":"(-Frightened Voice-)Gaaaaaahhh!"},{"name":"VIISHUNTER03464","text":"Did you hear that? From deep in the wood...someone crying out for help. She may be in danger─we must help!"},{"name":"VIISHUNTER03464","text":"As we feared, she was attacked. Luckily, a Watcher struck down her aggressor before she came to any serious harm. An uncommon occurrence, but it is not unheard of to see one while they are hunting."},{"name":"VIISHUNTER03464","text":"Doubtless the caracal you sighted was his doing as well. He must have fled into the wood when you arrived."},{"name":"VIISHUNTER03464","text":"At any rate, we must treat her. Let us return to Fanow."},{"name":"VIISHUNTER03464","text":"That was quite eventful for a first patrol. To think that you would meet one of the wood's Watchers."},{"name":"VIISHUNTER03464","text":"Hmm, perhaps 'meet' is not the right word. If only I could have introduced you as one of Ronka's allies. Alas, it seems that our guardian had other plans."},{"name":"VIISHUNTER03464","text":"The day was far from a disappointment, however. With your help we were able to guide a wounded ally to safety. You are welcome to join me again any time you wish."}],"reward":{"gil":1118},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68870]}},"partials":[{"type":"npc","id":"1029992","obj":{"i":1029992,"n":"Lionhearted Hunter","l":2957,"q":1}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}