{"quest":{"name":"One Last Bite","location":"The Rak'tika Greatwood","id":69006,"patch":5.0,"sort":5101,"eventIcon":71221,"issuer":1031388,"target":1031389,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>This subdued sentinel seems eager to get moving."],"objectives":["Speak with the honey-blonde baker.","Deliver the provisions to Mjrl's Regret.","Deliver the heartfelt letter to the honey-blonde baker."],"dialogue":[{"name":"QUIETVIIS03470","text":"Might I ask you to deliver a package?"},{"name":"QUIETVIIS03470","text":"To whom? I...I am not at liberty to say. A package will be made ready for you across the way. When you have it, see it is delivered to Mjrl's Regret."},{"name":"QUIETVIIS03470","text":"Provisions? Oh, yes of course. Here you are."},{"name":"QUIETVIIS03470","text":"I apologize for this. There is no reason anyone should ask you of all people to make such a simple delivery."},{"name":"QUIETVIIS03470","text":"I realize this is a needless burden, but it is not far."},{"name":"QUIETVIIS03470","text":"You came... Thank you. You brought the provisions, then?"},{"name":"QUIETVIIS03470","text":"Ah, I never tire of this bread. &lt;sniff&gt; &lt;sniff&gt; It smells of home."},{"name":"QUIETVIIS03470","text":"No, I should not think of home. I cannot go back. Not now..."},{"name":"QUIETVIIS03470","text":"Would you take this letter back to Fanow for me? A word of gratitude for the provisions."},{"name":"QUIETVIIS03470","text":"Farewell. May the blessings of the wood be upon you."},{"name":"QUIETVIIS03470","text":"You are returned. Were you able to deliver the provisions?"},{"name":"QUIETVIIS03470","text":"She really did it then. She always spoke of leaving Yx'Maja, of living free. But I didn't think..."},{"name":"QUIETVIIS03470","text":"Fitting that she would choose to leave at Mjrl's Regret. It is said the river was born from the tears of those who chose to leave the village."},{"name":"QUIETVIIS03470","text":"Before long they could no longer hear the call of the woods. They became strangers. That is the fate of all Viis who leave these woods, and still she chose to leave."},{"name":"QUIETVIIS03470","text":"She has ever been strong of will, and she will need that strength if she truly means to begin her life anew. "},{"name":"QUIETVIIS03470","text":"I think your presence here inspired her. No doubt she was glad it was you who saw her off. She would want you to have this."},{"name":"QUIETVIIS03470","text":"Now if you'll excuse me, I have more provisions to prepare."}],"reward":{"gil":827},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68870]}},"partials":[{"type":"npc","id":"1031388","obj":{"i":1031388,"n":"Subdued Sentinel","l":2957,"q":1}},{"type":"npc","id":"1031389","obj":{"i":1031389,"n":"Honey-blonde Baker","l":2957,"q":1}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}