{"quest":{"name":"Delivery Time","location":"The Rak'tika Greatwood","id":69004,"patch":5.0,"sort":5080,"eventIcon":71221,"issuer":1031379,"target":1031379,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The flustered sentinel looks at you expectantly."],"objectives":["Speak with Olmet.","Speak with Ciuille.","Deliver the fur blanket and purified water to the flustered sentinel."],"dialogue":[{"name":"KINDVIIS03468","text":"Normally I would not think to make a request of the allies of Ronka, but this is an emergency."},{"name":"KINDVIIS03468","text":"One of our sisters is in labor. Would you help us make ready for the delivery?"},{"name":"KINDVIIS03468","text":"I have asked Olmet to prepare a blanket for the child, and Ciuille fresh water."},{"name":"KINDVIIS03468","text":"Time is of the essence. Go and speak with Olmet and Ciuille. They will have what we need."},{"name":"OLMET","text":"Ah, I was told someone would be coming. Here─a blanket of our finest fur. Go on, now. They will be waiting."},{"name":"CIUILLE","text":"It is time, then? I finished purifying the water but moments ago. The child's ears must be cleansed before first hearkening to the call of the woods."},{"name":"OLMET","text":"I will not keep you. The others are waiting for that blanket."},{"name":"CIUILLE","text":"Be careful not to spill the water."},{"name":"KINDVIIS03468","text":"Do you have the blanket and water?"},{"name":"KINDVIIS03468","text":"Good, good. With this, everything is in order."},{"name":"KINDVIIS03468","text":"It has been far too long since any of our sisters has given birth."},{"name":"KINDVIIS03468","text":"You honor us with your assistance. Would that we could allow you to meet the child once born."},{"name":"KINDVIIS03468","text":"To ensure their safety, it is strictly forbidden for any save the wet nurse and immediate family to see them. Even should the opportunity never arise, make no mistake: the child will hear of your deeds. You have my word on that."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68870]}},"partials":[{"type":"npc","id":"1031379","obj":{"i":1031379,"n":"Flustered Sentinel","l":2957,"q":1}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}