{"quest":{"name":"Back Where It Belongs","location":"The Rak'tika Greatwood","id":69001,"patch":5.0,"sort":5050,"eventIcon":71221,"issuer":1027711,"target":1027711,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Nymet seems troubled by something."],"objectives":["Obtain a Ronkan lilybell.","Deliver the carved wood earrings and the Ronkan lilybell to the girl with pigtails.","Deliver the engraven ring to Nymet."],"dialogue":[{"name":"NYMET","text":"Greetings, ally of Ronka. You have come at an opportune time. I am faced with a problem that I could use an outsider's assistance to solve."},{"name":"NYMET","text":"Several days ago we sighted a young girl wandering the wood. We loosed warning arrows, and she fled back whence she came. However, she dropped these earrings in her haste."},{"name":"NYMET","text":"I bear no ill will toward her, so I would like to return them, but I cannot leave. If it is not too much trouble, could you bring them to their owner?"},{"name":"NYMET","text":"As a sign of apology, I would like to affix a Ronkan lilybell to the earrings. They can be found growing in the woods of Yx'Maja. When you are done, please make your way to Slitherbough and find her. I believe she wore her hair in pigtails."},{"name":"NYMET","text":"I apologize for requesting such a menial task from you, but as you know I have little recourse. I simply wish to put her heart at ease."},{"name":"NYMET","text":"When you have affixed the earrings with the lilybell, please bring them to the young lady in Slitherbough. I pray this sets her heart at ease."},{"name":"SLITHERBOUGHGIRLA03465","text":"What's this? Earrings? They aren't mine, although they are pretty. If it was a necklace I might've been tempted to lie, tee hee."},{"name":"SLITHERBOUGHGIRLB03465","text":"Earrings? Mine have been firmly attached to my ears as far as I know. A friend of mine was lamenting over something she had lost, however..."},{"name":"SLITHERBOUGHGIRLC03465","text":"Hmm? A pair of earrings? It just so happens I lost my own while in the woods some time ago..."},{"name":"SLITHERBOUGHGIRLC03465","text":"You didn't! You found them! And the lilybell is a masterful touch!"},{"name":"SLITHERBOUGHGIRLC03465","text":"That Viis asked you to do this? I...I suppose she didn't mean me harm after all..."},{"name":"SLITHERBOUGHGIRLC03465","text":"It is as Master Matoya said. They uphold their duty as the wood's protectors with grave severity. They only reacted as they should have."},{"name":"SLITHERBOUGHGIRLC03465","text":"Please, give this ring to the one who sent you. Tell her I apologize for my rudeness, and will be more careful when next I go into the woods."},{"name":"SLITHERBOUGHGIRLC03465","text":"Please give my ring to the Viis by way of apology. It's the least I can give after I encroached upon their sacred space."},{"name":"NYMET","text":"You have returned. Did you find the girl?"},{"name":"NYMET","text":"I see. She is kind as well as wise. I shall hang this ring from my neck as a keepsake, to remind me of her. You have my gratitude for everything you have done."}],"reward":{"gil":1100,"items":[{"num":3,"id":5744,"one":1},{"num":3,"id":5754,"one":1},{"num":3,"id":5761,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68870]}},"partials":[{"type":"npc","id":"1027711","obj":{"i":1027711,"n":"Nymet","l":2957,"q":1}},{"type":"item","id":"5744","obj":{"i":5744,"n":"Sunset Orange Dye","l":30,"c":22809,"t":55}},{"type":"item","id":"5754","obj":{"i":5754,"n":"Pumpkin Orange Dye","l":30,"c":22809,"t":55}},{"type":"item","id":"5761","obj":{"i":5761,"n":"Loam Brown Dye","l":30,"c":22809,"t":55}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}