{"quest":{"name":"Proving Your Worth","location":"The Rak'tika Greatwood","id":69007,"patch":5.0,"sort":5110,"eventIcon":71221,"issuer":1031390,"target":1031390,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The light-hearted hunter is eager to see what you can do."],"objectives":["Speak with the light-hearted hunter.","Use the leather sack on a weakened Greatwood rail.","Deliver the bulging leather sack to the light-hearted hunter.","Speak with the light-hearted hunter."],"dialogue":[{"name":"VIISHUNTER03471","text":"Well met, ally of Ronka. Did you hear? Almet's recently returned with an astounding catch."},{"name":"VIISHUNTER03471","text":"She slew five Greatwood rails single-handedly. <span class=\"emphasis\">Five</span>."},{"name":"VIISHUNTER03471","text":"Almet is without question one of our greatest hunters, but I am most curious to see how you would fare against them. If you would take up the challenge, meet with me at the Great Pyramid of Ux'ner."},{"name":"VIISHUNTER03471","text":"You have come. Very good! I care not for how many you can capture, only how it is done. When you have weakened one, use this sack to capture it and bring it back here. "},{"name":"VIISHUNTER03471","text":"Good luck in your hunt. I will be watching."},{"name":"VIISHUNTER03471","text":"I can see now why Almet speaks so highly of you. Your form was unlike anything I have ever seen. But what of the Greatwood rail?"},{"name":"VIISHUNTER03471","text":"You have done well not to bruise the feathers or the skin. We can make good use of this."},{"name":"VIISHUNTER03471","text":"Yes, such a prize warrants a reward. Meet with me at Fanow and I will see you compensated for your trouble."},{"name":"VIISHUNTER03471","text":"For you, oh great hunter, and ally of Ronka."},{"name":"VIISHUNTER03471","text":"I will see this to Almet and─"},{"name":"VIISHUNTER03471","text":"&lt;gasp&gt; She will ask where is <span class=\"emphasis\">my</span> quarry!"},{"name":"VIISHUNTER03471","text":"What a fool I am. I should have been hunting with you. Perhaps if I can hunt four and offer them together with yours..."}],"reward":{"gil":900},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68875]}},"partials":[{"type":"npc","id":"1031390","obj":{"i":1031390,"n":"Light-hearted Hunter","l":2957,"q":1}},{"type":"quest","id":"68875","obj":{"i":68875,"n":"In Good Faith","g":8,"l":"The Rak'tika Greatwood","s":610}}]}