{"quest":{"name":"Not Unfamiliar","location":"The Rak'tika Greatwood","id":69002,"patch":5.0,"sort":5060,"eventIcon":71221,"issuer":1031380,"target":1031529,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>This unassuming townsviis seems to recognize you from somewhere."],"objectives":["Speak with the unassuming townsviis.","Follow the unassuming townsviis."],"dialogue":[{"name":"FRIENDLYVIIS03466","text":"You...it cannot be... Are you...!?"},{"name":"FRIENDLYVIIS03466","text":"Ah...oh, no. My apologies for the outburst. I confused you for someone I once knew. Something about you...seems so familiar."},{"name":"FRIENDLYVIIS03466","text":"Perhaps you are a traveler as well? All who embark upon that path have a singular way about them. You must know much of the world outside the wood. Please, could you humor me with a story or two?"},{"name":"FRIENDLYVIIS03466","text":"Haha, a wise choice. You knew I would not stop at asking for two. Well, if ever you find yourself idle and eager to entertain, I shall be here."},{"name":"FRIENDLYVIIS03466","text":"You agree!? Oh, many thanks to you. I am so starved for amusement these days."},{"name":"FRIENDLYVIIS03466","text":"I heard tell that Lakeland had been abandoned. I once heard the name of the elves' new home in passing, but for the life of me I cannot recall it."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You speak of the Crystarium."},{"name":"A1","text":"Are you thinking of Eulmore?"},{"name":"FRIENDLYVIIS03466","text":"Yes, yes, the Crystarium. They say that the Crystal Exarch conjured the spire in an instant. Oh, to wield such power..."},{"name":"FRIENDLYVIIS03466","text":"Eulmore? Are you certain? No...the name had a different ring to it. It was almost...vibrant."},{"name":"FRIENDLYVIIS03466","text":"What of Nabaath Areng? That city produced such lustering trinkets! Does it still stand?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Only ruins remain."},{"name":"A2","text":"It was consumed in the Flood."},{"name":"FRIENDLYVIIS03466","text":"How dreadful! Truly, the Flood spared no land..."},{"name":"FRIENDLYVIIS03466","text":"Of course... The Flood brought ruin to even the grandest of cities..."},{"name":"FRIENDLYVIIS03466","text":"Tell me, have you heard of the Warriors of Light? Grand heroes, saviors of worlds, and so on."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Not saviors. Destroyers."},{"name":"A3","text":"Yes. They are heroes for us all."},{"name":"A3","text":"Of course. I am a Warrior of Light."},{"name":"FRIENDLYVIIS03466","text":"Is that so? I suppose you are right, given the state of things here."},{"name":"FRIENDLYVIIS03466","text":"Indeed they are. I am glad to know there are some in this world who still believe in heroism."},{"name":"FRIENDLYVIIS03466","text":"Hah, of course you are! I am full glad there are still those who admire their bravery. It warms my heart to see."},{"name":"FRIENDLYVIIS03466","text":"I must thank you again for providing this old woman with company. Please, would you walk with me?"},{"name":"FRIENDLYVIIS03466","text":"Since you have been so kind, I would tell you a story of my own in return. However, it would not do if I were to be overheard. There is a place where we may speak in private, to the west. It will not take long."},{"name":"FRIENDLYVIIS03466","text":"Thank you for coming. You may wonder why I brought you here. "},{"name":"FRIENDLYVIIS03466","text":"You see, long ago in these very woods, I was wounded, and nursed back to health by travelers much like yourself. They were hunting a very specific prey, and in exchange for my help they shared stories of the outside world."},{"name":"FRIENDLYVIIS03466","text":"I remember very fondly that night, huddled by the fire, regaled by their wondrous tales. Although our time together was short, I know for certain there was naught but good in their hearts."},{"name":"FRIENDLYVIIS03466","text":"When I heard that those selfsame travelers brought about the Flood, I refused to believe it."},{"name":"FRIENDLYVIIS03466","text":"However, even if it is true, even if they caused this world's ruin... I cannot blame them. If they did somehow have a hand in it...it was not a willing one."},{"name":"FRIENDLYVIIS03466","text":"You know as well as I, but we Viis can live well over two centuries. I myself have seen my hundredth nameday come and go."},{"name":"FRIENDLYVIIS03466","text":"If the heavens deem it fit, we can live well over two centuries. I myself have seen my hundredth nameday come and go."},{"name":"FRIENDLYVIIS03466","text":"Even so, too many of us have met premature ends at the hands of the sin eaters. There are not many left who remember the time before the Flood. "},{"name":"FRIENDLYVIIS03466","text":"That is why I was compelled to tell you of those travelers, so you might leave here with full knowledge of their character. Thank you for lending an ear to my story."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68870]}},"partials":[{"type":"npc","id":"1031380","obj":{"i":1031380,"n":"Unassuming Townsviis","l":2957,"q":1}},{"type":"npc","id":"1031529","obj":{"i":1031529,"n":"Unassuming Townsviis","l":2957,"q":1}},{"type":"quest","id":"68870","obj":{"i":68870,"n":"Top of the Tree","g":8,"l":"The Rak'tika Greatwood","s":560}}]}