{"quest":{"name":"Reach for the Stars","location":"The Rak'tika Greatwood","id":69008,"patch":5.0,"sort":5120,"eventIcon":71221,"issuer":1027712,"target":1027712,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Loymet is furrowing her brow."],"objectives":["Use the corrosive elixir on the spotted spiders, then defeat the doom of the Everlasting Dark.","Report to Loymet."],"dialogue":[{"name":"LOYMET","text":"Thank goodness you are here. I would ask for your help with a rather urgent matter."},{"name":"LOYMET","text":"In recent days, trespassers we believe to be of the Children of the Everlasting Dark have been spotted near the Morning Stars."},{"name":"LOYMET","text":"No doubt come for the secrets of our temples."},{"name":"LOYMET","text":"By all rights they should have been stopped before even reaching Yx'Maja, but fending off the Eulmorans has spread our patrols thin."},{"name":"LOYMET","text":"They cannot be suffered to remain here any longer."},{"name":"LOYMET","text":"Will you help us find them?"},{"name":"LOYMET","text":"When last spotted, they were accompanied by giant spiders. They are monstrous creatures with skin like armor. Use this elixir to cut through their defenses. Go swiftly, and may the blessings of the wood be upon you."},{"name":"LOYMET","text":"We believe they are in hiding near the Morning Stars. If you should find them, do not forget the elixir."},{"name":"LOYMET","text":"You have routed the trespassers, I take it."},{"name":"LOYMET","text":"They seemed fixated on the temples of the Morning Stars, perhaps drawn by the radiant stones atop them."},{"name":"LOYMET","text":"To an outsider they might appear a source of power, but that is quite far from the truth."},{"name":"LOYMET","text":"They glow with the power of these woods, of Ronka. The light would fade the moment they were moved."},{"name":"LOYMET","text":"But regardless of their worth, such crimes cannot be tolerated. I will see to it we strengthen our defenses of the border. This will not happen again."}],"reward":{"gil":754},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68875]}},"partials":[{"type":"npc","id":"1027712","obj":{"i":1027712,"n":"Loymet","l":2957,"q":1}},{"type":"quest","id":"68875","obj":{"i":68875,"n":"In Good Faith","g":8,"l":"The Rak'tika Greatwood","s":610}}]}