{"quest":{"name":"Hearts as One","location":"The Rak'tika Greatwood","id":69017,"patch":5.0,"sort":5240,"icon":100858,"unlocksFunction":1,"eventIcon":71341,"issuer":1031006,"target":1027716,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Phyna and Ciuna are prepared to fulfill their duty.","The bond between Phyna and Ciuna has been mended, and now they are prepared to carry out their duty to the village. They ask you to meet with them at the Morning Stars to once more serve as witness to their petition to the heavens.","With hearts as one they pray to the heavens, and no sooner do they finish their incantation than a spirit appears, kissed by thunder. As their witness, it falls to you to slay the spirit and deliver their prayers to the gods.","Your battle is quick like a flash of lightning, and with your final blow you bring the ceremony to a most satisfying conclusion. All the while Phyna and Ciuna are beaming with delight.","The twins are overjoyed to see the ceremony was a success, a testament to their commitment to both the village and each other. While they would love nothing more than to share the good news with Lanille, they extend that honor to you while they tend to cleaning the altar.","The ritual is complete, once more ensuring the protection of the gods. The experience has brought Phyna and Ciuna closer together than ever before, but there will yet come a day when they must part ways. It will not be a day for mourning, however, for though their paths will be separate, they will one day lead to a brighter future for Fanow."],"objectives":["Speak with Phyna.","Slay the kiss of thunder.","Speak with Phyna.","Speak with Lanille."],"dialogue":[{"name":"PHYNA","text":"The ritual is certain to work this time. I know it!"},{"name":"LANILLE","text":"I know not how they did it, but I am glad to see them of one heart and mind."},{"name":"CIUNA","text":"It is time, <span class=\"highlight\">Forename</span>. Phyna and I will make ready for the ritual. Meet with us at the Morning Stars when you are ready."},{"name":"CIUNA","text":"When you are ready."},{"name":"PHYNA","text":"Let us begin."},{"name":"CIUNA","text":"O spirits of the wood, hear us! We seek to renew our vow to the gods of the Greatwood!"},{"name":"PHYNA","text":"For the strength to protect these lands, to be the shield that guards against the accursed Light. We demand trial by combat to prove our worth."},{"name":"CIUNA","text":"To Ox'Charl, keeper of the winds. To Ox'Gatorl, keeper of flames. To Yx'Lokwa, bringer of rain. To Yx'Anpa, bringer of the harvest. We beseech you, spirits of the wood─hear our prayers and deliver them!"},{"name":"PHYNA","text":"A spirit of lightning!"},{"name":"CIUNA","text":"A spirit born of wind and rain, whose spark brings fire... And from the ashes may come a rich harvest."},{"name":"PHYNA","text":"Our prayers will reach, Sister. There can be no doubt."},{"name":"PHYNA","text":"As witness to our petition, we task you now with slaying the spirit. Go forth and see our prayers delivered to the heavens."},{"name":"PHYNA","text":"Ox'Charl, let <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> be as swift as the wind..."},{"name":"CIUNA","text":"Ox'Gatorl, give <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> the strength of the fiercest flames..."},{"name":"CIUNA","text":"It is done!"},{"name":"PHYNA","text":"The spirit is slain! You did it!"},{"name":"CIUNA","text":"I confess I had my doubts at first, but you performed your duty admirably."},{"name":"PHYNA","text":"Would you go and relay the good news to Master Lanille? We will be along shortly."},{"name":"PHYNA","text":"We will be along as soon as we clear away the offerings."},{"name":"CIUNA","text":"Pray go ahead without us. We will not be long."},{"name":"LANILLE","text":"Phyna. Ciuna. I take it you were successful this time."},{"name":"CIUNA","text":"Yes, Master Lanille. Everything is as it should be."},{"name":"PHYNA","text":"Though we see the world through different eyes, it does not change how we feel about the Greatwood."},{"name":"PHYNA","text":"In matters concerning Fanow, we are of one heart and one mind. "},{"name":"LANILLE","text":"And it is by the strength of your kinship that the Viis shall be blessed for years to come. "},{"name":"LANILLE","text":"As you know all too well, the fulfillment of our duty to the allies of Ronka has necessitated change, and no few of our number feel uncertain of the future. But I believe we have found the answer to our woes, the means by which we may see Fanow thrive once more."},{"name":"LANILLE","text":"For centuries we have trusted none save our own and that will prove our downfall, for none can survive in this world alone. Not even the guardians of Yx'Maja."},{"name":"LANILLE","text":"There is much to be gained from opening our doors to the outside world, and your presence in Fanow has proven that."},{"name":"LANILLE","text":"On behalf of all the Viis, you have our humblest thanks."},{"name":"LANILLE","text":"As for you two, I expect great things of you in the future."},{"name":"CIUNA","text":"Thank you, Master Lanille. We will not disappoint you."},{"name":"CIUNA","text":"Phyna has decided to venture out into the world to find more of our fellow Viis who might be willing to return home."},{"name":"PHYNA","text":"And Ciuna has pledged to protect Fanow, and help make our village a place where they will feel welcome."},{"name":"PHYNA","text":"Two paths to the same goal."},{"name":"CIUNA","text":"Still, I will miss you dearly when you are gone."},{"name":"PHYNA","text":"But I have yet to even decide where I will go, Sister."},{"name":"PHYNA","text":"There is still time for us to be together."}],"reward":{"gil":973,"items":[{"num":2,"id":27860,"one":1},{"num":2,"id":27861,"one":1},{"num":2,"id":27862,"one":1},{"num":2,"id":27863,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69016]},"next":[69018]},"partials":[{"type":"npc","id":"1031006","obj":{"i":1031006,"n":"Ciuna","l":2957,"q":1}},{"type":"npc","id":"1027716","obj":{"i":1027716,"n":"Lanille","l":2957,"q":6}},{"type":"item","id":"27860","obj":{"i":27860,"n":"Baguette","l":403,"c":24030,"t":46,"p":3501}},{"type":"item","id":"27861","obj":{"i":27861,"n":"Blood Tomato Juice","l":403,"c":24405,"t":46}},{"type":"item","id":"27862","obj":{"i":27862,"n":"Pixie Apple Pie","l":403,"c":24079,"t":46}},{"type":"item","id":"27863","obj":{"i":27863,"n":"Nut Bake","l":406,"c":24083,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69016","obj":{"i":69016,"n":"Mending Fences","g":117,"l":"The Rak'tika Greatwood","s":5230,"f":1}},{"type":"quest","id":"69018","obj":{"i":69018,"n":"Protectors of the Wood","g":117,"l":"The Rak'tika Greatwood","s":5250,"f":1}}]}