{"quest":{"name":"Seeing Eye to Eye","location":"The Rak'tika Greatwood","id":69015,"patch":5.0,"sort":5220,"icon":100858,"unlocksFunction":1,"eventIcon":71341,"issuer":1027716,"target":1027716,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The twins weigh heavy on Lanille's mind.","After hearing your description of the failed summoning, Lanille is convinced that relations between Phyna and Ciuna are strained, so much so that it has affected their ability to petition the gods. To investigate the source of their conflict, she asks you to speak with the people of Fanow, hoping they will be willing to speak freely with their esteemed guest.","You speak with a number of the Viis and learn about Phyna's aspirations of leaving Fanow, as well as Ciuna's dedication to tradition and the protection of their village. Lanille will be glad to hear of what you learned.","Your account of conversations with the locals confirms Lanille's suspicions. When the twins arrive and apologize for the day's events, Lanille seizes the opportunity to question them about their recent troubles. The silence of their reply speaks volumes. The cause for their discord is now exposed, but can they reconcile their differences to complete the ritual? "],"objectives":["Speak with the Viis of Fanow to learn about Phyna and Ciuna.","Speak with Lanille."],"dialogue":[{"name":"LANILLE","text":"The ritual to which you bore witness requires no less than two petitioners to summon the spirit of the wood, and they must be of one mind and one heart. Historically, it has always been blood relatives who were chosen."},{"name":"LANILLE","text":"If what you say is true, and not one but two spirits answered their call, it is a sign of disharmony between them."},{"name":"LANILLE","text":"Until we discover its source, attempting the ritual again could prove disastrous."},{"name":"LANILLE","text":"But I fear the others will not be forthcoming with information were I to press the subject."},{"name":"LANILLE","text":"For our esteemed guest and ally of Ronka, on the other hand, I believe they would be willing to speak freely."},{"name":"LANILLE","text":"Would you speak with the people of Fanow and see if they know aught of any trouble between Phyna and Ciuna?"},{"name":"LANILLE","text":"It pains me to think they are at odds with one another."},{"name":"VIIS03479A","text":"Phyna and Ciuna? In all of Fanow I can think of no one closer. 'Tis little wonder they were chosen to petition the spirits of the wood."},{"name":"VIIS03479B","text":"In a sense we consider all here to be family, but twins are said to have an especially powerful bond. "},{"name":"VIIS03479A","text":"Which is why it has been so strange to see them argue in recent days. They have not been the same since the Children and Eulmoran soldiers breached the border."},{"name":"VIIS03479C","text":"I spoke with Phyna not long ago. She heard that I was considering leaving Fanow and wished to talk."},{"name":"VIIS03479C","text":"It is a decision not to be made lightly, for we may never return once we leave."},{"name":"VIIS03479C","text":"But now that you and your companions are here, I... I feel our duty has been fulfilled. I understand the ruins must be protected from the Children, but what difference does one guard make? Phyna shares my feelings on the matter, and has also considered leaving."},{"name":"VIIS03479D","text":"I speak with Ciuna quite often, actually. About our history and duty to the late emperor."},{"name":"VIIS03479D","text":"We were once a nomadic people, or so the legends say. But Yx'Maja, in her boundless love, sought to bless us with a home. And so she appeared before the emperor of Ronka in a dream, and bade him allow us into his kingdom."},{"name":"VIIS03479D","text":"That is how we found our home and our purpose. Ciuna is determined to protect both."},{"name":"VIIS03479A","text":"I do hope they can come to terms with whatever troubles they are facing."},{"name":"VIIS03479B","text":"I can only imagine what might be driving those two apart."},{"name":"VIIS03479C","text":"We have done all we can to keep the outside world from knowing of our ways. But in doing so we know nothing of the world beyond our borders. Were you in my position, would you not yearn to know what is out there?"},{"name":"VIIS03479D","text":"You have entered the temples of Yx'Maja, yes? I can but imagine what wonders they hold."},{"name":"LANILLE","text":"I see. Phyna yearns to explore the outside world, and Ciuna would remain hidden from it."},{"name":"LANILLE","text":"For as long as I can remember they were inseparable. Phyna's mirthfulness tempered by Ciuna's pragmatism."},{"name":"LANILLE","text":"I never realized such difference in principles could divide them so."},{"name":"CIUNA","text":"We have finished with the altar."},{"name":"PHYNA","text":"I gather you have apprised Master Lanille of what happened? "},{"name":"PHYNA","text":"We wish to apologize for─"},{"name":"LANILLE","text":"There is no need. However, were you to petition the spirits again, I suspect they would answer as they did before."},{"name":"PHYNA","text":"It will not happen again, I swear it! Please say you will let us try again."},{"name":"CIUNA","text":"Yes, let us try with one of our own and not this outsider. The summoning would have worked if not for <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"LANILLE","text":"Enough, Ciuna! The problem lies not with our guest, but with you and your sister. You have been fighting over the future of Fanow, is that right?"},{"name":"LANILLE","text":"Family is not meant to agree on everything. But fail to respect your differences and before long you will have no family at all. What would become of Fanow if the others shared in your contempt for one another?"},{"name":"LANILLE","text":"You are to prepare for another petitioning of the spirits, and I expect you to come to terms before then."},{"name":"LANILLE","text":"If the ritual is to succeed you must find harmony."},{"name":"LANILLE","text":"I apologize for burdening you further, but may I ask you to accompany them?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Of course."},{"name":"A1","text":"Well, if there's no other way..."},{"name":"PHYNA","text":"We will make this work. I promise!"},{"name":"CIUNA","text":"Your <span class=\"emphasis\">enthusiasm</span> is inspiring..."},{"name":"LANILLE","text":"I will leave you to your work, then."},{"name":"LANILLE","text":"I fear you have a long day ahead of you..."}],"reward":{"gil":642},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69014]},"next":[69016]},"partials":[{"type":"npc","id":"1027716","obj":{"i":1027716,"n":"Lanille","l":2957,"q":6}},{"type":"quest","id":"69014","obj":{"i":69014,"n":"Stand on Ceremony","g":117,"l":"The Rak'tika Greatwood","s":5210,"f":1}},{"type":"quest","id":"69016","obj":{"i":69016,"n":"Mending Fences","g":117,"l":"The Rak'tika Greatwood","s":5230,"f":1}}]}