{"quest":{"name":"Stand on Ceremony","location":"The Rak'tika Greatwood","id":69014,"patch":5.0,"sort":5210,"icon":100858,"unlocksFunction":1,"eventIcon":71341,"issuer":1027716,"target":1027716,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Lanille would bestow blessings upon you.","The Viis will hold a ceremony wherein they entreat the gods of the forest for their protection, and as master of rites, Lanille appoints you witness to the petition. You humbly accept, and she asks you to go to the Morning Stars to speak with one of her disciples, Phyna.","Phyna is overjoyed to hear you have been selected as the ceremony's witness. Her sister, Ciuna, less so. Despite her sister's reservations, Phyna explains how the ceremony is carried out. Namely, that it ends with a test of strength against a manifestation of the forest's spirit, which then carries their prayers to the heavens when defeated. They begin their prayers to summon forth a spirit, but the ritual goes awry. No sooner do they end their incantation than not one, but two volatile spirits of opposing elements appear.","You banish the spirits back to the forest with relative ease, but Ciuna appears dismayed by what she has seen.","As Ciuna explains it, for two hostile spirits to appear in such a manner is a terrible omen. She blames you for this unexpected turn of events, and forbids you from attending the next attempt of the ritual. Phyna can only apologize and asks you to relay the day's events to Lanille.","Lanille is relieved to hear Phyna and her sister are unharmed, but the mention of fire and ice spirits gives her pause. She senses trouble may yet be afoot, an issue unrelated to the spirits of the woods."],"objectives":["Speak with Phyna.","Defeat the kiss of fire and kiss of ice.","Speak with Phyna.","Speak with Lanille."],"dialogue":[{"name":"LANILLE","text":"<span class=\"highlight\">Forename Surname</span>. The esteemed guest of whom I have heard so much. My name is Lanille, master of rites. It is an honor to meet you."},{"name":"LANILLE","text":"As I understand it, you will soon be leaving to the Qitana Ravel, is that right? Then the emperor's wishes will soon be fulfilled."},{"name":"LANILLE","text":"As I understand it, you have partaken of the Qitana Ravel's knowledge, is that right? Then the emperor's wishes have at last been fulfilled."},{"name":"LANILLE","text":"A comforting thought... For with each passing year, more and more of our hunters are lost to the eaters."},{"name":"LANILLE","text":"We were never a particularly fecund people. Now it is nigh impossible to sustain our numbers."},{"name":"LANILLE","text":"But we will not be driven from our homes, our way of living. So long as the trees of the Greatwood stand, so too shall the Viis."},{"name":"LANILLE","text":"And to renew our union with the forest, we will be holding a small ceremony wherein we offer prayers to the gods."},{"name":"LANILLE","text":"Would you honor us by serving as witness to this petition to the gods?"},{"name":"LANILLE","text":"Very good. I should mention the ceremony is not a formal affair. In fact it can be quite...lively. But for a hardened warrior such as you, it should prove no trouble at all."},{"name":"LANILLE","text":"When you are ready, travel north to the Morning Stars, and speak with my student, Phyna. She will explain the rites."},{"name":"LANILLE","text":"The ceremony will be held at the Morning Stars. Speak with Phyna, and she will apprise you of the rites."},{"name":"CIUNA","text":"Not now. We are busy."},{"name":"PHYNA","text":"What business brings you to the Morning Stars?"},{"name":"PHYNA","text":"And you accepted? This is such an honor! Thank you for coming."},{"name":"PHYNA","text":"Goodness, where are my manners? My name is Phyna. A pleasure to meet you. And this is my sister─"},{"name":"CIUNA","text":"Ciuna. How do you do."},{"name":"CIUNA","text":"Are you certain this is wise? I realize <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is an ally of our people, but the ceremony is not meant for outsiders."},{"name":"PHYNA","text":"We cannot go against Master Lanille's wishes. Besides, we may never again have such an opportunity."},{"name":"CIUNA","text":"If you insist..."},{"name":"PHYNA","text":"Now, let me tell you about the ceremony."},{"name":"PHYNA","text":"As Master Lanille has likely already explained, we will renew our bond with the Greatwood through prayer. To ensure our prayers reach to the gods, however, we must first beseech the spirits of the forest for aid."},{"name":"CIUNA","text":"Once summoned, we must prove ourselves worthy through combat. Only then will our prayers be delivered unto the heavens."},{"name":"PHYNA","text":"As witness to the rites, it is up to you to do battle with the spirits. If you are still willing, of course."},{"name":"PHYNA","text":"Wonderful. This will be a ceremony to be remembered."},{"name":"CIUNA","text":"Shall we begin, then? Close your eyes, and we will attempt to draw forth a spirit with our prayers."},{"name":"PHYNA","text":"O gods of the Greatwood, bringers of bounty and wisdom, we call to you now to renew our vows!"},{"name":"CIUNA","text":"For the strength to protect these lands, to be the shield that guards against the accursed Light. We seek combat with your children─the spirits of the wood─to prove to you our worth."},{"name":"PHYNA","text":"&lt;gasp&gt; By the gods!"},{"name":"CIUNA","text":"The spirits are of opposing forces─fire and ice... A terrible omen."},{"name":"PHYNA","text":"Our prayers are enough to suppress their strength, but we cannot cast them out alone. Please, you must strike them down before they wander off into the woods."},{"name":"CIUNA","text":"In the name of the wood, we banish you..."},{"name":"PHYNA","text":"We beseech the gods to deliver us from these infernal spirits..."},{"name":"CIUNA","text":"Spirits of fire and ice... Heavens help us."},{"name":"PHYNA","text":"Thank you for your help. But in light of what we have witnessed, I think it best we call off the ceremony for now."},{"name":"CIUNA","text":"Spirits of opposing elements is the most dire of omens. The discord between them would prevent our prayers from reaching to the gods."},{"name":"CIUNA","text":"And this would not have happened were <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> not here! We may try again on the morrow, but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> cannot be allowed to attend."},{"name":"PHYNA","text":"Sister, please. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is our guest, handpicked by Master Lanille!"},{"name":"PHYNA","text":"My apologies. It seems your attendance was not meant to be. Would you go and inform Master Lanille of what happened? We must remain here and clear the altar."},{"name":"PHYNA","text":"We will not be long, I promise."},{"name":"CIUNA","text":"Hmph..."},{"name":"LANILLE","text":"Back so soon? What of the ceremony?"},{"name":"LANILLE","text":"Fire and ice... Thank goodness they were not hurt."},{"name":"LANILLE","text":"It is never too late to begin the ceremony anew, but I fear the source of our troubles has naught to do with the spirits."}],"reward":{"gil":936,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68875]},"next":[69015]},"partials":[{"type":"npc","id":"1027716","obj":{"i":1027716,"n":"Lanille","l":2957,"q":6}},{"type":"quest","id":"68875","obj":{"i":68875,"n":"In Good Faith","g":8,"l":"The Rak'tika Greatwood","s":610}},{"type":"quest","id":"69015","obj":{"i":69015,"n":"Seeing Eye to Eye","g":117,"l":"The Rak'tika Greatwood","s":5220,"f":1}}]}