{"quest":{"name":"Out on Patrol","location":"The Rak'tika Greatwood","id":69010,"patch":5.0,"sort":5140,"eventIcon":71221,"issuer":1027713,"target":1027713,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Olmet is preparing for a patrol of the ruins."],"objectives":["Examine the owl statues.","Speak with Olmet."],"dialogue":[{"name":"OLMET","text":"Ah, your timing is quite fortuitous. I have a task that could make use of one with your expertise."},{"name":"OLMET","text":"Since beginning our vigil after the fall of Ronka, we Viis have seldom ventured beyond the bounds of Yx'Maja."},{"name":"OLMET","text":"But times are changing, and it has come to our attention that the ruins beneath Lake Tusi Mek'ta remain untouched by the Blessed."},{"name":"OLMET","text":"Being more familiar with the environs of the west, I think you would be well suited to the endeavor."},{"name":"OLMET","text":"According to our records, there are several owl statues somewhere within the ruins. I ask that you find them and ensure they yet remain whole."},{"name":"OLMET","text":"You are familiar with Lake Tusi Mek'ta, yes? Then this survey should prove no trouble at all."},{"name":"SYSTEM03474","text":"You find nothing out of the ordinary."},{"name":"SYSTEM03474","text":"The beak of the owl statue appears to be chipped."},{"name":"SYSTEM03474","text":"The statue appears to be covered in algae. You gingerly wipe it away."},{"name":"OLMET","text":"How fare the statues?"},{"name":"OLMET","text":"You wiped them as well? I'd expect nothing less from an ally of Ronka, and a fellow Viis at that."},{"name":"OLMET","text":"You wiped them as well? I'd expect nothing less from an ally of Ronka."},{"name":"OLMET","text":"In the days of the Ronkan Empire, the owl was regarded with great reverence. The divine beast of night and keeper of knowledge."},{"name":"OLMET","text":"In fact, there is a legend that speaks of a time when darkness fades and the people pray for night. An owl is said to guide <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who heralds the night's return."},{"name":"OLMET","text":"Perhaps that is why fate brings you here."}],"reward":{"gil":854},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68875]}},"partials":[{"type":"npc","id":"1027713","obj":{"i":1027713,"n":"Olmet","l":2957,"q":1}},{"type":"quest","id":"68875","obj":{"i":68875,"n":"In Good Faith","g":8,"l":"The Rak'tika Greatwood","s":610}}]}