{"quest":{"name":"Protectors of the Wood","location":"The Rak'tika Greatwood","id":69018,"patch":5.0,"sort":5250,"icon":100859,"unlocksFunction":1,"eventIcon":71341,"issuer":1031152,"target":1027716,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Phyna would take another step to realizing her dream.","Phyna and Ciuna have been given permission to leave Fanow. Before setting their sights on the far reaches of Norvrandt, however, they decide on visiting a settlement close to home─Slitherbough. Knowing full well their presence will incite panic among the Night's Blessed, they ask you to accompany them. With a smile and a nod you agree to help, prompting them to leave for Slitherbough.","As you approach the entrance to Slitherbough, two familiar faces of the Night's Blessed are there to greet you─Valan and Quinfort. The reason, it seems, is that Quinfort has had yet another vision of catastrophe, and he is all but convinced the great serpent is somewhere close by. He throws all caution to the wind and runs off into the woods in search of the supposedly mythical snake, with Ciuna hot on his trail. Phyna bids you follow them to guarantee their safety while she escorts Valan back to Fanow.","Traveling south, you find Ciuna fending off a pair of wild caracals. At her side is Quinfort and the strange creature you have come to know as the great serpent.","With the danger passed, the three of you return to Fanow in the hopes that Lanille can offer you counsel.","Though Lanille is skeptical of the great serpent, she nevertheless takes heed of Quinfort's visions. One particular point of his prophetic ramblings─a giant snake in the lake west of Slitherbough─gives her pause. She is suddenly reminded of the ancient writings found in the Great Pyramid of Ux'ner. Unfortunately, none may enter save for the late emperor...and a certain adventurer who just so happens to possess the seal of Ronka. With the ancient artifact in hand, you depart with the others to the Morning Stars.","The others cannot accompany you inside, so you are left to wander the hallowed halls of the pyramid alone. You search high and low and find three stone tablets with carvings resembling animals of the forest. Quinfort and the others are certain to be excited by your discovery.","At the sight of the tablets Quinfort can hardly contain his excitement. He rushes off to Fanow, eager to have Lanille decipher their writings.","The writings of the tablets weave a fascinating tale of a kingdom that was once guarded by not one, but two tribes. This knowledge reaffirms Phyna's decision to reach out to their sisters beyond the Greatwood. And, thanks to the presence of Valan and Quinfort, she and her fellow Viis soon realize there are hands willing to help in Slitherbough as well."],"objectives":["Speak with Phyna.","Search for Quinfort.","Speak with Quinfort.","Speak with Lanille.","Search for the ancient stone tablets.","Speak with Quinfort.","Deliver the ancient stone tablet to Lanille."],"dialogue":[{"name":"CIUNA","text":"You must be strong, Sister."},{"name":"PHYNA","text":"<span class=\"highlight\">Forename</span>! You could not have come at a better time."},{"name":"PHYNA","text":"Ciuna and I have been given leave to explore beyond the borders of Yx'Maja."},{"name":"CIUNA","text":"As we know nothing of what lies past the borders of the Greatwood, I suggested she visit somewhere close to home─Slitherbough."},{"name":"PHYNA","text":"For us to go alone would likely incite panic. In <span class=\"emphasis\">your</span> company, however, they might be at ease. I apologize for this abrupt request, but we would be most grateful if you could introduce us to the people there."},{"name":"CIUNA","text":"Then it is settled. We will await you at the Wild Fete, near the entrance to Slitherbough."},{"name":"VALAN","text":"Viis this close to Slitherbough!? I don't believe it!"},{"name":"QUINFORT","text":"Hahaha..."},{"name":"CIUNA","text":"So these are the worshipers of the Dark."},{"name":"PHYNA","text":"If you know these two, would you mind─"},{"name":"QUINFORT","text":"Mwahahaha! We've been expecting you, <span class=\"highlight\">Forename</span>. Your coming was foretold in the <span class=\"emphasis\">Gospel of Quinfort</span>! The great serpent speaks to me once more, of azure flowers, sacred temples, and secrets engraved on an ancient tablet."},{"name":"QUINFORT","text":"A calamity is upon us, friend, and our divine protector would see it averted once more!"},{"name":"VALAN","text":"He was hells-bent on coming here, and somehow dragged me along with him. Though I wasn't exactly inclined to stay behind, seeing as how his visions have been right before."},{"name":"CIUNA","text":"Do you know anything of this talk of visions and calamities?"},{"name":"QUINFORT","text":"The calamity, yes! It can only be avoided with the guidance of the great serpent. Have you seen it?"},{"name":"PHYNA","text":"We do not know this...great serpent, but if it is snakes you seek, you will find them along the banks of Mjrl's Regret."},{"name":"QUINFORT","text":"Yes, it makes sense it would be near water. After all it was at Lake Tusi Mek'ta that we first met."},{"name":"QUINFORT","text":"O great serpent, your servant comes for you!"},{"name":"CIUNA","text":"Wait! It is not safe to go alone in these woods!"},{"name":"VALAN","text":"I apologize for his...unusual behavior. He means well."},{"name":"PHYNA","text":"Perhaps, but such recklessness can prove fatal."},{"name":"PHYNA","text":"<span class=\"highlight\">Forename</span>, would you go and make sure they are safe? While you see to them, I will take this one to Fanow."},{"name":"CIUNA","text":"I wish it had not come to that. They only meant to protect their home."},{"name":"TSUCHINOKO","text":"Scree?"},{"name":"QUINFORT","text":"I am glad to see you are unharmed, great serpent."},{"name":"TSUCHINOKO","text":"Scree!"},{"name":"CIUNA","text":"He refused to leave without that...thing. I presume this is the <span class=\"emphasis\">great serpent</span> he was looking for?"},{"name":"QUINFORT","text":"I beseech you─give me a sign! What calamity would threaten the forest?"},{"name":"CIUNA","text":"We should return to Fanow and consult Master Lanille. She will know how to handle this."},{"name":"QUINFORT","text":"Wait, O great one! This ground is not fit for you to slither upon! Allow me to carry you!"},{"name":"LANILLE","text":"They bring with them two guests from Slitherbough. Very well, let us see what they have to say."},{"name":"LANILLE","text":"This is the great serpent...?"},{"name":"TSUCHINOKO","text":"Screee!"},{"name":"LANILLE","text":"A most fortuitous turn of events."},{"name":"LANILLE","text":"This gift you speak of is not unknown to us. Though it is rare, a child of Fanow born with such a gift would be appointed Keeper of Whispers."},{"name":"LANILLE","text":"It would be most unwise to ignore this vision."},{"name":"QUINFORT","text":"Keeper of Whispers. Yes, I rather like that title."},{"name":"CIUNA","text":"He also spoke of a monstrous snake in the lake to the west. Perhaps he meant the legend of Lozatl and its battle with the winged serpent?"},{"name":"LANILLE","text":"There are a number of tablets in the Great Pyramid of Ux'ner which tell of such tales. The one we seek may be among them."},{"name":"LANILLE","text":"However, only the emperor, or one of sufficient status, may pass through those hallowed halls."},{"name":"LANILLE","text":"As bearer of the seal of Ronka, you have been granted leave to enter. If you would bring me the tablet, I can decipher its writings."},{"name":"QUINFORT","text":"Might I accompany <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>? Not inside of course, but close enough to see the temples I have beheld in my visions?"},{"name":"PHYNA","text":"We can escort you, but you must not run off as you did before."},{"name":"LANILLE","text":"I pray you safe passage through the Great Pyramid."},{"name":"TSUCHINOKO","text":"Scree!!!"},{"name":"QUINFORT","text":"Have you ever seen such a thing? To think its majesty could remain unmarred all these centuries..."},{"name":"PHYNA","text":"It gladdens me to see one so taken with our history."},{"name":"VALAN","text":"I have my eyes on Quinfort, don't you worry."},{"name":"CIUNA","text":"I did not expect anyone save the Viis to take such an interest in Ronkan history."},{"name":"SYSTEM","text":"Though you cannot read its script, you see the image of a coeurl is engraved on the tablet. This likely has nothing to do with the great serpent..."},{"name":"SYSTEM","text":"Though you cannot read its script, you see the image of a Namazu is engraved on the tablet. This likely has nothing to do with the great serpent..."},{"name":"SYSTEM","text":"Though you cannot read its script, you see the image of a snake is engraved on the tablet. You tuck it away in your clothing for safekeeping..."},{"name":"PHYNA","text":"Please tell me you found it."},{"name":"CIUNA","text":"While you were away, your friend here inquired about Ronka and the history of the Viis. He was...thorough in his questioning. Perhaps overly so."},{"name":"VALAN","text":"I didn't let him out of my sight, just as I promised. Sadly, there was nothing I could do to stay his barrage of questions."},{"name":"QUINFORT","text":"The tablet, you've found it! Come, I would know what secrets it hides."},{"name":"TSUCHINOKO","text":"Screee!"},{"name":"LANILLE","text":"How did you fare in the Great Pyramid?"},{"name":"LANILLE","text":"Yes, this is indeed the tablet we were looking for. A moment while I pore over its writings..."},{"name":"LANILLE","text":"Thank you for your patience. I have finished deciphering the tablet, and its contents were...informative."},{"name":"LANILLE","text":"“By the emperor's command, the stone giant Lozatl did clash with the serpent. The battle raged for many days and many nights and finally, the ancient guardian stood triumphant. The dreaded snake was sealed in an immense jewel, its true name never to be uttered again. The years spent in slumber quelled its rage, and the seething ire it once exuded became a benign aura. Man came to worship the jewel, and thus the great destroyer became the great protector of the wood."},{"name":"LANILLE","text":"“After the great sealing, the emperor commanded his fiercest sentinels to the east to keep guard of the Great Pyramid of Ux'ner. To the west, he sent his priests who would watch over the slumbering serpent from the Covered Halls of Dwatl. Together they would protect the empire, and so did it thrive."},{"name":"LANILLE","text":"“Alas, in a strange twist of fate, the temple to the west would be submerged beneath the waters of Lake Tusi Mek'ta, its priests drowned. Lamenting their loss, the great protector thrashed and writhed within the great jewel, stirring the power of the earth, causing the trees to grow ever thicker, ever greener. And the guards of the pyramid would become guardians of an ever-expanding forest.”"},{"name":"QUINFORT","text":"And the Viis have remained here all this time? Incredible! "},{"name":"CIUNA","text":"But Master Lanille, were there really protectors other than us in the Greatwood?"},{"name":"LANILLE","text":"I cannot say for certain, but this is not the first time I have read such claims in our ancient texts."},{"name":"CIUNA","text":"Can you imagine it? Two tribes protecting the whole of Rak'tika..."},{"name":"LANILLE","text":"Even assuming they existed, we would have no way of tracing their lineage. But I do not think these priests are who we were meant to find."},{"name":"LANILLE","text":"For one who shares their gift and reverence for Ronka now stands before us."},{"name":"CIUNA","text":"We would be honored to work alongside you in protecting Rak'tika and the ruins of Ronka."},{"name":"QUINFORT","text":"I-It would be an honor... But I fear I am not worthy of such a position..."},{"name":"PHYNA","text":"It is not a question of worthiness. It matters only that you are willing. And when the time comes, I intend to leave and search for our Viis sisters who would join us."},{"name":"QUINFORT","text":"Perhaps this is the calamity my visions foretold. The plight of your people, the growing reality that Ronka's history may one day be lost to time."},{"name":"QUINFORT","text":"And the great serpent has chosen me to be your savior! A new Keeper of Whispers to protect and serve the Greatwood."},{"name":"PHYNA","text":"Speaking of which...where did the snake go? It was here but a moment ago."},{"name":"QUINFORT","text":"Returned to slumber, no doubt. But should the great serpent have need of us again, I will be here waiting. Listening... "},{"name":"VALAN","text":"If his head weren't in the clouds, he might notice. I don't suppose you'd be willing to take it with you before he comes to his senses? So long as it remains here, I'm afraid he'll be convinced a calamity looms around every corner."},{"name":"TSUCHINOKO","text":"Screee!"},{"name":"VALAN","text":"Go on, take it. If all that stuff about the great serpent is true, we'll still have his visions to warn us of danger. "},{"name":"LANILLE","text":"It would seem friends of Fanow can be found closer to us than I dared hope. I will consult our chieftainess that we may formalize an alliance with Slitherbough."},{"name":"QUINFORT","text":"An alliance, yes! We will protect Rak'tika as they did in the days of the empire. Villages of the east and west working together as one!"}],"reward":{"gil":1439,"items":[{"id":26791}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[69195,69017]},"next":[69330]},"partials":[{"type":"npc","id":"1031152","obj":{"i":1031152,"n":"Phyna","l":2957,"q":1}},{"type":"npc","id":"1027716","obj":{"i":1027716,"n":"Lanille","l":2957,"q":6}},{"type":"item","id":"26791","obj":{"i":26791,"n":"The Great Serpent of Ronka","l":1,"c":59737,"t":81}},{"type":"quest","id":"69195","obj":{"i":69195,"n":"Snakes in the Grass","g":117,"l":"The Rak'tika Greatwood","s":4260,"f":1}},{"type":"quest","id":"69017","obj":{"i":69017,"n":"Hearts as One","g":117,"l":"The Rak'tika Greatwood","s":5240,"f":1}},{"type":"quest","id":"69330","obj":{"i":69330,"n":"The Stewards of Note","g":58,"l":"The Rak'tika Greatwood","s":1,"f":1}}]}