{"quest":{"name":"Water Palaver","location":"Amh Araeng","id":69024,"patch":5.0,"sort":6020,"eventIcon":71221,"issuer":1027917,"target":1027917,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ghon Gon is waiting impatiently for his nephew to return."],"objectives":["Search for Ghon Gon's nephew.","Give the gnawed water bottle to Ghon Gon's nephew.","Report to Ghon Gon."],"dialogue":[{"name":"GHONGON","text":"Where is that nephew of mine? I sent him to Twine on an errand a while ago, and he has still not returned!"},{"name":"GHONGON","text":"If your travels happen to take you that way, could you keep an eye out for him?"},{"name":"GHONGON","text":"&lt;sigh&gt; Knowing him, he probably forgot to take any water and is lying in a ditch somewhere..."},{"name":"GHONGON","text":"Hmm... Perhaps you should take this, just in case. If he is thirsty, give him some to drink. And if he is sleeping, pour it on his head to wake him up!"},{"name":"GHONGON","text":"I knew it was a mistake to send that boy by himself. Where could he be?"},{"name":"MORDERRAND03488","text":"Why does this desert...have to be so...dry? Never been so...thirsty..."},{"name":"GHONGON","text":"You found him!? Did you give him the water, like I asked?"},{"name":"MORDERRAND03488","text":"Need...water..."},{"name":"MORDERRAND03488","text":"Pwaaah!"},{"name":"MORDERRAND03488","text":"You have saved me from certain death! Well, extreme thirst, at the very least! But how did you know?"},{"name":"MORDERRAND03488","text":"My uncle..."},{"name":"MORDERRAND03488","text":"I just wanted to make him proud, to show my gratitude to him for raising me. But all I do is cause problems."},{"name":"MORDERRAND03488","text":"No point moping about it, though! I'll have to do better next time. Thank you for the water, it was much appreciated!"},{"name":"GHONGON","text":"My nephew made it back alive! I was so relieved to see him!"},{"name":"GHONGON","text":"I only sent him to deliver some smoked lizard meat, but I had no idea it would end like this!"},{"name":"GHONGON","text":"Still, it is important for both Garik and Twine to send these kinds of supplies back and forth."},{"name":"GHONGON","text":"I wish we still had a Talos. Then my nephew would not have to go on such dangerous trips."},{"name":"GHONGON","text":"He might be a fool, but he is a good boy at heart. Thank you for helping him return safely!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69146]}},"partials":[{"type":"npc","id":"1027917","obj":{"i":1027917,"n":"Ghon Gon","l":2955,"q":1}},{"type":"quest","id":"69146","obj":{"i":69146,"n":"Free Trade","g":8,"l":"Amh Araeng","s":690}}]}