{"quest":{"name":"And Justice Feral","location":"Amh Araeng","id":69027,"patch":5.0,"sort":6050,"eventIcon":71221,"issuer":1030429,"target":1030429,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Bhol Bol is grinding his teeth, a clear sign of his foul mood."],"objectives":["Pour the viscous oil on the feral lizard, then slay it.","Deliver the feral lizard meat to Bhol Bol."],"dialogue":[{"name":"BHOLBOL","text":"I have seen you around, traveler. You like making yourself useful, yes? There is work for you, if you are willing."},{"name":"BHOLBOL","text":"One of the lizards that I raised for meat escaped some time past. I thought it would have been eaten by predators by now, but a miner from Twine said that it attacked her. It seems to have grown into quite the brute."},{"name":"BHOLBOL","text":"Which brings me to the job in question. I want you to put a stop to its mischief. Kill it, in other words. I would recommend softening its hide first with a splash of this oil."},{"name":"BHOLBOL","text":"Once you have taken care of it, bring me its meat. No point letting it go to waste."},{"name":"BHOLBOL","text":"I heard it was prowling around the outskirts of the village, to the west. And I will know from the smell if you attempt to fob me off with meat from another lizard, so do not even try!"},{"name":"BHOLBOL","text":"Most of the lizards look the same, so we tell them apart by their scent. This one smells like burned leather, which matches what the miner from Twine told us."},{"name":"BHOLBOL","text":"Killed it, you say? Prove it."},{"name":"BHOLBOL","text":"Very good. That beast put us through a lot of trouble, so it is about time we had something to show for it."},{"name":"BHOLBOL","text":"They are usually quite harmless when they are young, but this one was a vicious little bastard, even then."},{"name":"BHOLBOL","text":"Heh! This serves him right for mauling passersby. If he had any sense, he would have disappeared for good."},{"name":"BHOLBOL","text":"Anyway, I will dry this meat and send it to Twine by way of apology. For you, this should be an ample reward."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69146]}},"partials":[{"type":"npc","id":"1030429","obj":{"i":1030429,"n":"Bhol Bol","l":2955,"q":1}},{"type":"quest","id":"69146","obj":{"i":69146,"n":"Free Trade","g":8,"l":"Amh Araeng","s":690}}]}