{"quest":{"name":"Assault on a Deadly Weapon","location":"Amh Araeng","id":69023,"patch":5.0,"sort":6010,"eventIcon":71221,"issuer":1027920,"target":1027920,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mhon Mon is being plagued by hellish beasts and an empty stomach."],"objectives":["Lie in wait for the wandering weapon.","Report to Mhon Mon."],"dialogue":[{"name":"MHONMON","text":"Oooh! What to do? What to do?"},{"name":"MHONMON","text":"I want to make traditional Mord stew and I only need one more ingredient─Amber weed."},{"name":"MHONMON","text":"But it has become scarce around here, except for in an area that is plagued by evil weapons!"},{"name":"MHONMON","text":"Funny name, not so funny when they are trying to kill you, though! There is an especially horrible one called the wandering weapon who the others seem to follow."},{"name":"MHONMON","text":"If you could get rid of it, the rest might leave us alone. Then I can finally harvest Amber weed in peace. So, will you help us?"},{"name":"MHONMON","text":"I hate that wandering weapon and its big, stupid face!"},{"name":"MHONMON","text":"You did it? Hooray! Now that Amber weed will be mine! Heh heh heh..."},{"name":"MHONMON","text":"But I wonder if the other evil weapons will come back... I hear they were made by the mages of Nabaath Areng from enchanted swords. Do not ask me how they ended up looking like that, though!"},{"name":"MHONMON","text":"Apparently, their masters disappeared after the Flood. With no one to command them, they have been prowling around Amber, attacking everything that comes close!"},{"name":"MHONMON","text":"I hope that by getting rid of the wandering weapon, they will stay away for a while, but who can say? All I know is, I can make my stew now! My stomach thanks you!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69146]}},"partials":[{"type":"npc","id":"1027920","obj":{"i":1027920,"n":"Mhon Mon","l":2955,"q":1}},{"type":"quest","id":"69146","obj":{"i":69146,"n":"Free Trade","g":8,"l":"Amh Araeng","s":690}}]}