{"quest":{"name":"A Relatively Miner Issue","location":"Amh Araeng","id":69028,"patch":5.0,"sort":6060,"eventIcon":71221,"issuer":1027930,"target":1027930,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Hathenstein stares expectantly into the distance."],"objectives":["Search for the miners.","Report to Hathenstein."],"dialogue":[{"name":"HATHENSTEIN","text":"You looking for work? Good. I've something you can help with."},{"name":"HATHENSTEIN","text":"I've got a team of miners in the Dragging Tail, but three of them are working well past the end of their shift."},{"name":"HATHENSTEIN","text":"I want you to go in there, and tell them to get back here now. You'll receive fair coin for your troubles."},{"name":"HATHENSTEIN","text":"Miners get paid according to what they dig up, so if I don't force them to work in shifts, some of them will keep going till they drop."},{"name":"MINERA03492","text":"Shift's finished has it? I didn't hear the bell!"},{"name":"MINERA03492","text":"I suppose I'll have to make do with this haul. It should earn me enough to keep my wife and little ones fed for the time being."},{"name":"MINERA03492","text":"I'd stay for longer if I could, but I'd better do as the boss says."},{"name":"MINERB03492","text":"Hathenstein sent you here to tell me that? Lazy bastard couldn't be arsed to come and say it himself, then."},{"name":"MINERB03492","text":"And I don't know why he bothers making us work in shifts. “Everyone needs to take turns,” he says. Pah! There's hardly anybody left! Most of the others have gone to seek their fortune elsewhere."},{"name":"MINERB03492","text":"Besides us, there are only a handful of miners left in Twine. On the bright side, that means there's more for me to dig up. I guess I can afford to stop for a bite to eat, though."},{"name":"MINERC03492","text":"Oh, time to go back, is it? Thank goodness. I've had more than enough of this for one day."},{"name":"MINERC03492","text":"It was much less tiring when we had Talos to do all the hard work. Now it's down to pickaxes and explosives. A pretty poor substitute if you ask me."},{"name":"MINERC03492","text":"Of course, we used to dig up a lot more back then, too. &lt;sigh&gt; At this rate, I'll have to consider taking up another profession..."},{"name":"HATHENSTEIN","text":"Good work, sinner. They all made it back in one piece."},{"name":"HATHENSTEIN","text":"They went at the meal we'd prepared like a pack of hungry coyotes. Ha ha! Nothing beats eating your fill at the end of a hard day."},{"name":"HATHENSTEIN","text":"Of course, everyone in Twine is here to work. This is a mining town, and only those who contribute are allowed to stay. We've always got room for someone like you, though."}],"reward":{"gil":759,"items":[{"id":26867}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69149]}},"partials":[{"type":"npc","id":"1027930","obj":{"i":1027930,"n":"Hathenstein","l":2955,"q":1}},{"type":"item","id":"26867","obj":{"i":26867,"n":"Titanbronze Ring Coffer (IL 409)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69149","obj":{"i":69149,"n":"On Track","g":8,"l":"Amh Araeng","s":720}}]}