{"quest":{"name":"Where There's a Well, There's a Way","location":"Amh Araeng","id":69022,"patch":5.0,"sort":6001,"eventIcon":71221,"issuer":1030284,"target":1030284,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The rather dusty merchant seems to have hit a spot of bother."],"objectives":["Speak with Ghil Gil.","Slay Amber iguanas and collect their meat.","Deliver chunks of Amber iguana meat to Ghil Gil.","Deliver the pouch of iguana repellent to the dusty merchant."],"dialogue":[{"name":"MERCHANT03486","text":"I say, I was wondering if you could help me?"},{"name":"MERCHANT03486","text":"My chocobo and I are carrying goods from the Crystarium, and we stopped off along the way to make use of a local well."},{"name":"MERCHANT03486","text":"Unfortunately, some of the residents did not take too kindly to our presence. They pelted us with clumps of a strange-smelling powder and we were forced to run! Terrible business, I tell you."},{"name":"MERCHANT03486","text":"Worst of all, I didn't even have the chance to draw any water! Unless I refill these skins, I fear we will have no choice but to turn around and go home."},{"name":"MERCHANT03486","text":"I did manage to catch the name of one of the Mord who came after us─ Ghil Gil, they called him. I don't suppose you could have a word with him and find out why they took such offense?"},{"name":"MERCHANT03486","text":"Yes, his name was definitely Ghil Gil. I heard the others calling to him as they chased us off."},{"name":"GHILGIL","text":"Yes, we chased them off, because they were being followed by a pair of Amber iguanas!"},{"name":"GHILGIL","text":"Very dangerous, they are! We cannot have people bringing them into the village."},{"name":"GHILGIL","text":"But if you kill two of those iguanas, your friend can use the well. Of course, the ones that were following him would be best, but who can tell the difference? Any of them will do!"},{"name":"GHILGIL","text":"I want proof, though! Bring me some of their meat. Then we will talk!"},{"name":"MERCHANT03486","text":"We were being followed by iguanas!? I had no idea! Gods be good, that was a near thing indeed... We should count ourselves lucky!"},{"name":"GHILGIL","text":"No meat, no deal!"},{"name":"GHILGIL","text":"So, have you done as I asked?"},{"name":"GHILGIL","text":"Mmm... That is tomorrow's dinner taken care of! Heh heh."},{"name":"GHILGIL","text":"All right, your friend can use the well. And give him this."},{"name":"GHILGIL","text":"It is powder made from the dried flesh of Amber iguanas and mixed with herbs. They cannot stand the smell, so we scatter it on ourselves to keep them away!"},{"name":"GHILGIL","text":"Nothing says “stay out of our village, nasty iguanas” quite like the stench of their dead relatives! Heh heh!"},{"name":"MERCHANT03486","text":"Hmm? What's this?"},{"name":"MERCHANT03486","text":"I see... So they're willing to let us in, provided that we cover ourselves in this powder?"},{"name":"MERCHANT03486","text":"Yes, I can see the logic in that. In fact, I fear we owe Ghil Gil and the others an apology. I'll feel a lot better about using their well once we've had a chance to clear the air."},{"name":"MERCHANT03486","text":"Of course, if it weren't for your help, we'd either be going home empty-handed, dying of thirst in the desert, or even being eaten by those horrible iguanas. A thousand thank-yous!"}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69146]}},"partials":[{"type":"npc","id":"1030284","obj":{"i":1030284,"n":"Dusty Merchant","l":2955,"q":1}},{"type":"quest","id":"69146","obj":{"i":69146,"n":"Free Trade","g":8,"l":"Amh Araeng","s":690}}]}