{"quest":{"name":"Shovel or Boogie","location":"Amh Araeng","id":69025,"patch":5.0,"sort":6030,"eventIcon":71221,"issuer":1027918,"target":1027918,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rhil Ril has stumbled upon something rather intriguing."],"objectives":["Use the rusty spade to dig at the designated location.","Deliver the rotted chest to Rhil Ril and return his rusty spade."],"dialogue":[{"name":"RHILRIL","text":"You must be a traveler, yes? Then maybe you can help me."},{"name":"RHILRIL","text":"I was looking around an abandoned house and I found a map of Amh Araeng, with a big cross drawn on it. It can only mean one thing─treasure!"},{"name":"RHILRIL","text":"I want to go and look for it, but I have to stay here and guard the village. Could you go in my stead?"},{"name":"RHILRIL","text":"If there are any shinies to be had, we can share them, yes? Here, take my spade and dig where the cross is!"},{"name":"RHILRIL","text":"Be sure to bring the treasure to me, along with my spade! You do not want to know what happens to thieves around here..."},{"name":"SYSTEM","text":"You discover a rotted chest buried in the soil."},{"name":"RHILRIL","text":"Show me what you found! Show me! And give me my spade back, please!"},{"name":"RHILRIL","text":"Oh, this must be very old... Let us see what is inside..."},{"name":"RHILRIL","text":"What!? Nothing but junk! Rusty junk, at that! Why would anyone bury this? Wait, is that a diary? I am sure the former owner will not mind if I take a peek... "},{"name":"RHILRIL","text":"Hmm... It looks like the owner had to leave Amh Araeng but was planning to come back one day."},{"name":"RHILRIL","text":"And if that day ever came, they wanted to dig up the diary and continue writing their life story."},{"name":"RHILRIL","text":"I wonder if that person is still alive... Probably not, judging by the state of this chest. It must have been buried for a long time. Maybe their children, or their children's children will come in search of it."},{"name":"RHILRIL","text":"If I read the rest, maybe I can learn who this person was... And then I will put it back, in a more sturdy box. And since there was no treasure to share, I will give you this instead as payment for your hard work!"}],"reward":{"gil":606,"items":[{"id":26860}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69146]}},"partials":[{"type":"npc","id":"1027918","obj":{"i":1027918,"n":"Rhil Ril","l":2955,"q":1}},{"type":"item","id":"26860","obj":{"i":26860,"n":"Titanbronze Hand Gear Coffer (IL 409)","l":1,"c":26560,"t":61}},{"type":"quest","id":"69146","obj":{"i":69146,"n":"Free Trade","g":8,"l":"Amh Araeng","s":690}}]}