{"quest":{"name":"To the Far Side","location":"Amh Araeng","id":69030,"patch":5.0,"sort":6080,"eventIcon":71221,"issuer":1027881,"target":1027881,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Harlolth is faced with a problem he cannot solve alone."],"objectives":["Give the payment for farside sprouts to the desert apothecary.","Speak with the cactus trader.","Speak with the desert apothecary.","Deliver the farside sprouts to Harlolth."],"dialogue":[{"name":"HARLOLTH","text":"I'm awfully worried about my grandfather. All of those years of working in the mines have finally caught up with him, and he can hardly breathe now. It must be the dust and the stagnant air down there."},{"name":"HARLOLTH","text":"The only thing that can help him is farside sprouts, but the cacti they come from are extremely rare and few people know how to prepare them for eating. I can't leave him alone in his condition, so I was wondering─would you be able to go and get some for him?"},{"name":"HARLOLTH","text":"An apothecary sells the stuff and can normally be found east of Nuvy's Leavings. Here, this should cover the cost. Thank you, you're a saint for doing this."},{"name":"HARLOLTH","text":"It's not far as the crow flies, but it's a dangerous journey on foot, so be careful."},{"name":"DEALER03494","text":"Always a pleasure to meet a new customer. What can I do for you?"},{"name":"DEALER03494","text":"Oh, really? You're quite the connoisseur. One who is clearly hungry for my sprouts."},{"name":"DEALER03494","text":"Unfortunately, I've none left. I sold all of my stock to someone from Eulmore. For a rather tidy sum, I might add."},{"name":"DEALER03494","text":"If you're as desperate as you look, perhaps you could go straight to the source. A Mord harvests the cacti over by the lift station. If you get her to bring some to me, I'll make you a batch."},{"name":"DEALER03494","text":"There's another type of cactus that looks exactly the same and only the Mord can tell which is which. It's their sense of smell, see?"},{"name":"HARLOLTH","text":"He's run out, you say? Hmm... There must be another way to get hold of some."},{"name":"MORD03494","text":"You need the sprouts now!?"},{"name":"MORD03494","text":"Lucky for you, I have picked some fresh, juicy cacti! They should have quite a kick!"},{"name":"MORD03494","text":"And since you seem to be in a hurry, I'll deliver what I have to the apothecary right away!"},{"name":"DEALER03494","text":"Thanks to your help in expediting the shipment, I've already finished preparing the first batch."},{"name":"DEALER03494","text":"As a sign of my appreciation, I've included a bit extra. Sweet dreams, friend."},{"name":"DEALER03494","text":"Sorry mate, no refunds."},{"name":"HARLOLTH","text":"So, how did it go?"},{"name":"HARLOLTH","text":"Yes, this should do the trick. But it's a lot more than I paid for. How did you end up with so much?"},{"name":"HARLOLTH","text":"You did all this for my grandfather? That was very kind of you."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I hope this makes him feel better."},{"name":"A1","text":"Are you sure this is for medicinal purposes?"},{"name":"HARLOLTH","text":"Yes, it should. For a while, at least."},{"name":"HARLOLTH","text":"I see what you're getting at. All right, I'll come clean. It's not medicine. Some say it causes hallucinations and a few people use it for relaxation. In my grandfather's case, it gives him a brief respite from the pain that wracks his body."},{"name":"HARLOLTH","text":"I'm afraid he hasn't got much time left, but this at least eases his suffering."},{"name":"HARLOLTH","text":"He'll be able to sleep well tonight, I'm sure. You've done him a good turn."}],"reward":{"gil":905},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69149]}},"partials":[{"type":"npc","id":"1027881","obj":{"i":1027881,"n":"Harlolth","l":2955,"q":1}},{"type":"quest","id":"69149","obj":{"i":69149,"n":"On Track","g":8,"l":"Amh Araeng","s":720}}]}