{"quest":{"name":"Prankster's Paradise","location":"Amh Araeng","id":69032,"patch":5.0,"sort":6100,"eventIcon":71221,"issuer":1030975,"target":1030975,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The shifty-eyed miner appears to be panicking for some reason."],"objectives":["Deliver the letter to the Crystarium merchant.","Slay debitages and obtain a debitage soulstone.","Deliver the debitage soulstone to the Crystarium merchant.","Speak with the shifty-eyed miner."],"dialogue":[{"name":"MINER03496","text":"Listen, I need your help! Please, give this message to that merchant passing through from the Crystarium, heading east. If you hurry, you should be able to catch him!"},{"name":"MINER03496","text":"It's a matter of life and death! I'd go myself, but, errr... I've got allergies!"},{"name":"MINER03496","text":"What are you waiting for!? Go!"},{"name":"MERCHANT03496","text":"Oh! May I help you?"},{"name":"MERCHANT03496","text":"A letter, hmm? Let's see..."},{"name":"MERCHANT03496","text":"“My hardworking errand <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span> will deliver one pristine debitage soulstone, which I believe should serve as ample payment for my usual order.”"},{"name":"MERCHANT03496","text":"Not a bad deal from where I stand. I'm prepared to wait if you still need time to fulfill your side of the bargain."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I have to get a what!?"},{"name":"A1","text":"That's the first I've heard of it, but it shouldn't be a problem."},{"name":"MERCHANT03496","text":"Had your master not given you the correct instructions? Oh my, this is highly irregular. You seem the dependable sort, though. I'm sure you're more than capable of performing such a task if you put your mind to it."},{"name":"MERCHANT03496","text":"Such loyalty! Your master is blessed indeed to have a servant as reliable as you!"},{"name":"MERCHANT03496","text":"There are plenty of debitages roaming around here, but I hear the soulstones are often damaged in the process of slaying them. And let's not forget that I was promised one in pristine condition! For what it's worth, I'll be cheering you on. Quietly, of course."},{"name":"MERCHANT03496","text":"Unfortunately, avoiding debitages comes part and parcel with trading in Amh Araeng. Fighting them, on the other hand, is best left to the professionals, like yourself."},{"name":"MERCHANT03496","text":"Is that a soulstone I spy?"},{"name":"MERCHANT03496","text":"Yes, that's lovely. Alchemists will pay handsomely for one this large!"},{"name":"MERCHANT03496","text":"And here is the ale your master requested. His usual order. It may only be one bottle, but you won't find anybody else selling it in the whole of Amh Araeng!"},{"name":"MERCHANT03496","text":"I'll be on my way soon, I think. Just preparing myself for the somewhat daunting journey ahead."},{"name":"MINER03496","text":"So, I trust everything went well?"},{"name":"Q2","text":"What will you do?"},{"name":"A2","text":"Hand over the ale."},{"name":"A2","text":"Smash the bottle."},{"name":"MINER03496","text":"Hyah hyah! The good stuff!"},{"name":"MINER03496","text":"I wasn't joking when I said it was a matter of life and death. A day spent sober is a day not lived!"},{"name":"MINER03496","text":"Noooooo! What have you done!? All that precious ale, gone to waste!"},{"name":"MINER03496","text":"Well, it's not like I paid anything for it. If this is all I get by way of comeuppance, I haven't done too badly."},{"name":"MINER03496","text":"I do feel a tiny bit guilty about making you risk your life fighting angry rock giants. A tiny bit."},{"name":"MINER03496","text":"You can hardly blame a man for finding his own entertainment, though. There's not much to do around here, as you can see. But you've given me a few laughs, that's for sure!"}],"reward":{"gil":905},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69149]}},"partials":[{"type":"npc","id":"1030975","obj":{"i":1030975,"n":"Shifty-eyed Miner","l":2955,"q":1}},{"type":"quest","id":"69149","obj":{"i":69149,"n":"On Track","g":8,"l":"Amh Araeng","s":720}}]}