{"quest":{"name":"The Brother Lode","location":"Amh Araeng","id":69036,"patch":5.0,"sort":6140,"eventIcon":71221,"issuer":1031021,"target":1027929,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The two brothers from Twine are hoping you will stick around Mount Biran Mines to help."],"objectives":["Obtain discarded timber.","Deliver the discarded timber to the stocky miner.","Report to Annine."],"dialogue":[{"name":"BROTHERB03500","text":"Without someone to keep an eye out for us, we may as well pack up and go home!"},{"name":"BROTHERA03500","text":"If you're willing to take on some more work, we'd be glad for your assistance."},{"name":"BROTHERA03500","text":"We actually came here not to gather rocks and such, as you might expect in a mine, but timber. We're hoping to repair our house, and we'll take whatever we can get our hands on."},{"name":"BROTHERA03500","text":"In fact, rather than have you guard us, it might be more efficient to have you collect wood too. Let's split up, but keep a close eye on each other, and try not to wander."},{"name":"BROTHERB03500","text":"We'd be grateful for anything you can bring us!"},{"name":"BROTHERA03500","text":"What have you found?"},{"name":"BROTHERA03500","text":"Nice and strong, free from rot. That should be enough for now."},{"name":"BROTHERA03500","text":"The two of us will carry this back to Twine. By the sounds of it, Annine was planning on paying you for coming to our rescue, so I'll tell her to throw in the coin for helping us with the timber too."},{"name":"ANNINE","text":"There you are! The boys told me what you did for them."},{"name":"ANNINE","text":"Now, you might think that they're idiots for going to Mount Biran Mines to collect timber of all things. I mean, they're still idiots, don't get me wrong, but the idea isn't entirely without merit."},{"name":"ANNINE","text":"You see, the closure of Daedalus Stoneworks meant that we had to rely on goods brought in from other lands, and the prices range from expensive to ludicrous."},{"name":"ANNINE","text":"That's why we try to make do with what's available. Which, as you can tell, is not an awful lot. But no matter how hard up we may be, we still have each other. I can't thank you enough for seeing my brothers got home safe and sound."}],"reward":{"gil":832},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69035]}},"partials":[{"type":"npc","id":"1031021","obj":{"i":1031021,"n":"Stocky Miner","l":2955,"q":2}},{"type":"npc","id":"1027929","obj":{"i":1027929,"n":"Annine","l":2955,"q":2}},{"type":"quest","id":"69035","obj":{"i":69035,"n":"Big Sister Is Watching You","g":115,"l":"Amh Araeng","s":6130}}]}