{"quest":{"name":"Whistle While You Shirk","location":"Amh Araeng","id":69031,"patch":5.0,"sort":6090,"eventIcon":71221,"issuer":1030968,"target":1030968,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The elderly miner is squinting at you with great intensity."],"objectives":["Search for the miners.","Report to the elderly miner."],"dialogue":[{"name":"MINEROLD03495","text":"You there! New <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! Where are the others?"},{"name":"MINEROLD03495","text":"Don't try to play me for a fool, I know what they're up to. No good, that's what! Expect me to pay them for shirking their duties, do they? Bah!"},{"name":"MINEROLD03495","text":"Go and get them, will you? It's time I gave them a stern talking to!"},{"name":"MINEROLD03495","text":"The youth of today, what a shower of shite! In my day we had it tough. We'd be woken up half a bell before we'd went to bed, eat a handful of hot gravel, and─ What are you still gawping at me for, you bloody fool!?"},{"name":"MINERA03495","text":"Ah gods, my aching head... I feel like death warmed up..."},{"name":"SYSTEM","text":"It seems the man is suffering from a hangover. If you were to <span class=\"highlight\">psych</span> him up, perhaps he might be more inclined to return to his duties."},{"name":"MINERA03495","text":"All right, all right! Enough of your posing!"},{"name":"MINERA03495","text":"If going back to work's what it takes for you to leave me alone, so be it!"},{"name":"MINERB03495","text":"&lt;sigh&gt; Nothing's going my way... I haven't had a decent haul in ages. I might as well just hang up my pickaxe for good."},{"name":"SYSTEM","text":"The man seems to be lacking in motivation. Perhaps if you were to <span class=\"highlight\">rally</span> his spirits, he might be willing to return to work."},{"name":"MINERB03495","text":"I don't know who you are or what you're doing, but your enthusiasm is somehow...infectious!"},{"name":"MINERB03495","text":"Yes, I should be thankful for what I have! I've got a steady job, a sort of beautiful home, what more could I ask for? Heigh ho, heigh ho, it's back to work I go!"},{"name":"MINERC03495","text":"Why would she leave me? There's nothing for her in Eulmore! Whatever will I do now?"},{"name":"SYSTEM","text":"The man is clearly upset and in no fit state to work. If someone were to <span class=\"highlight\">comfort</span> him, he might come to his senses."},{"name":"MINERC03495","text":"“There, there?” What does that even mean, anyway? <span class=\"emphasis\">There</span> are people who need me? <span class=\"emphasis\">There</span> is still work to be done?"},{"name":"MINERC03495","text":"That's it! I should forget my sorrows by burying myself in my work! Ah, a poor choice of words considering I'm a miner... But enough procrastinating, there's digging to be done!"},{"name":"MINERA03495","text":"Nothing cures a hangover better than spending hours smashing rocks in a dingy mine... Ungh. Kill me now."},{"name":"MINERB03495","text":"Ha ha, those rocks won't know what hit them!"},{"name":"MINERC03495","text":"Who needs her anyway? I'm married to my job!"},{"name":"MINEROLD03495","text":"So, the four of you finally decided to show up and do some bloody work, then?"},{"name":"MINERA03495","text":"Four!? But this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">bloke</span></span>'s not part of our team, is <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>? As far as I can tell, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s just passing through!"},{"name":"MINEROLD03495","text":"Eh!? What are you prattling about now?"},{"name":"MINEROLD03495","text":"Ha ha! My mistake! When you get to my age, one person-shaped blur looks much like all the others. Must be these damned eyes of mine."},{"name":"MINEROLD03495","text":"Still, we could use an extra pair of hands around here. I daresay you're worth more than all of these slack-jawed layabouts put together."},{"name":"MINEROLD03495","text":"But if you're not here for the mining, you might as well take this as payment for rounding up my workers. Gods help me, they're all I've got."}],"reward":{"items":[{"id":26862}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69149]}},"partials":[{"type":"npc","id":"1030968","obj":{"i":1030968,"n":"Elderly Miner","l":2955,"q":1}},{"type":"item","id":"26862","obj":{"i":26862,"n":"Titanbronze Foot Gear Coffer (IL 409)","l":1,"c":26562,"t":61}},{"type":"quest","id":"69149","obj":{"i":69149,"n":"On Track","g":8,"l":"Amh Araeng","s":720}}]}