{"quest":{"name":"Flower for a Friend","location":"Amh Araeng","id":69037,"patch":5.0,"sort":6150,"eventIcon":71221,"issuer":1031562,"target":1031562,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The taciturn miner is planning a journey of great personal importance."],"objectives":["Speak with the taciturn miner.","Cast a commemorative flower into the ravine.","Speak with the taciturn miner."],"dialogue":[{"name":"RONSO03501","text":"Excuse me, sinner. I am planning a journey into dangerous territory and need a bodyguard. Can you help me?"},{"name":"RONSO03501","text":"My destination is the bridge that stretches across the northern chasm. I should be able to reach it but I will need you to watch my back once I arrive. There is something I must do..."},{"name":"RONSO03501","text":"This is where a close friend of mine lost his life. He was a miner, one of the best. Until the day he was attacked by a sin eater."},{"name":"RONSO03501","text":"After Daedalus Stoneworks closed and the Talos fell into disrepair, he tried to find alternative methods for operating the trolleys, such as having them pulled by lizards. It was during one of these trials that he met his end."},{"name":"RONSO03501","text":"Though you are an outsider and never met him, it would mean a lot to me if you could join me in paying respects. Here, cast this flower into the ravine."},{"name":"RONSO03501","text":"Do you have customs like this where you come from?"},{"name":"SYSTEM","text":"You pay your respects by offering a flower for the lost miner."},{"name":"RONSO03501","text":"I wonder if he is watching us now, alongside all of the other great Ronso of the past. Many of the villages and mountains in Amh Araeng bear their names."},{"name":"RONSO03501","text":"My friend and I once dreamed of opening mines and naming them after ourselves. I still hold on to that hope, even though he is no longer with us."},{"name":"RONSO03501","text":"I can tell you too have lost loved ones. What do you do to overcome the grief?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I try to concentrate on the here and now."},{"name":"A1","text":"When the tears come, I let them flow."},{"name":"A1","text":"We each find our own way. You must find yours."},{"name":"RONSO03501","text":"Yes, there are others that still need us. Deeds that must be done."},{"name":"RONSO03501","text":"Yes, only by accepting the pain in our hearts can we hope to move on."},{"name":"RONSO03501","text":"Yes, you are right. True strength must come from within."},{"name":"RONSO03501","text":"I am grateful for your kind words."},{"name":"RONSO03501","text":"I shall reflect on them as we journey back to Twine."},{"name":"RONSO03501","text":"I was glad to have someone to hear my friend's tale. For in the telling, I was able to look back on happier times. From this day forth, I will strive to uphold the ideals that we once shared and in so doing, honor his memory. "},{"name":"RONSO03501","text":"Please accept this as a small token of my thanks."}],"reward":{"gil":832},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69149]}},"partials":[{"type":"npc","id":"1031562","obj":{"i":1031562,"n":"Taciturn Miner","l":2955,"q":1}},{"type":"quest","id":"69149","obj":{"i":69149,"n":"On Track","g":8,"l":"Amh Araeng","s":720}}]}