{"quest":{"name":"Taken Down a Peck or Two","location":"Amh Araeng","id":69043,"patch":5.0,"sort":6210,"eventIcon":71221,"issuer":1027922,"target":1027922,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Dalric has another request for you, this time of a more personal nature."],"objectives":["Survey the designated location and slay Iron Beak.","Deliver Iron Beak's tail feather to Dalric."],"dialogue":[{"name":"DALRIC","text":"Though we both profited from it, stealing the egg was just a test."},{"name":"DALRIC","text":"I want you to slay a certain phorusrhacos called Iron Beak. It killed my brother while we were gathering abandoned timber near Mount Biran Mines. I was the one who dragged him along to that godsforsaken place, and he died protecting me."},{"name":"DALRIC","text":"Ever since that day, thoughts of avenging him occupy my every waking moment. But I'm no hunter."},{"name":"DALRIC","text":"I've tried hiring others before you and it always ends with them either fleeing for their lives or... Well, they knew the risks when they signed up."},{"name":"DALRIC","text":"It's not only for my peace of mind that I want that wretched bird dead. It's been terrorizing anyone careless enough to wander into its territory."},{"name":"DALRIC","text":"So you'd be doing the whole of Twine a favor by killing it. I'll not go with you and get in your way, but I'd appreciate you bringing me one of its tail feathers. I'll hold on to it as a keepsake of my brother."},{"name":"DALRIC","text":"Those man-eating birds usually hunt in packs. Maybe the average hunter could deal with one, but not several at the same time. You'll need to keep your wits about you."},{"name":"DALRIC","text":"I'm glad to see you made it back. How went the hunt?"},{"name":"DALRIC","text":"Then it is done. My brother has been avenged."},{"name":"DALRIC","text":"He was one of the best miners this place ever saw. I should've followed in his footsteps instead of always trying to make a quick gil on the side."},{"name":"DALRIC","text":"It was one of my hare-brained schemes that got him killed. I'm just as much to blame as that damned bird. And ever since that day, I've been too scared to step foot outside of Twine and gave up on mining altogether."},{"name":"DALRIC","text":"Maybe now I can find the courage to venture farther afield and broaden my horizons. Here, you've more than earned this."}],"reward":{"gil":759},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69042]}},"partials":[{"type":"npc","id":"1027922","obj":{"i":1027922,"n":"Dalric","l":2955,"q":2}},{"type":"quest","id":"69042","obj":{"i":69042,"n":"The Yolk's on You","g":115,"l":"Amh Araeng","s":6201}}]}