{"quest":{"name":"The Yolk's on You","location":"Amh Araeng","id":69042,"patch":5.0,"sort":6201,"eventIcon":71221,"issuer":1027922,"target":1027922,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Dalric has need of your eggspertise."],"objectives":["Find a pristine phorusrhacos egg.","Deliver the phorusrhacos egg to the warehouse custodian.","Report to Dalric."],"dialogue":[{"name":"DALRIC","text":"Twine used to be full of hunters, bringing in fresh meat, pelts, all sorts. Not these days, though. Most of them left to seek easier, more lucrative prey elsewhere."},{"name":"DALRIC","text":"Still, there's money to be made here, if you're brave enough. How about it? Fancy earning a bit of coin?"},{"name":"DALRIC","text":"I'm sure you have seen the phorusrhacos around here. Big, ugly, highly aggressive. What I want is not their meat, but their eggs."},{"name":"DALRIC","text":"They are a job to carry though, so you'll want to avoid any trouble on your way back from the nest. There's no use bringing a smashed one."},{"name":"DALRIC","text":"If you and the egg both make it back in one piece, bring it here, and the bloke in charge of the warehouse'll take it off your hands. There's gil in it for the both us."},{"name":"DALRIC","text":"The warehouse custodian pays good coin for any meat or eggs, what with them being so hard to come by. Just so you know, I'll be getting a cut for anything you bring, since it was my idea."},{"name":"SYSTEM","text":"This egg has a large crack along the shell. You should try to find one that is in better condition."},{"name":"SYSTEM","text":"A strong scent of ammonia emanates from the egg. No one in their right mind would accept this."},{"name":"SYSTEM","text":"A perfect specimen! Now you must keep it in pristine condition on your journey to the pub in Twine."},{"name":"SYSTEM","text":"Deliver the phorusrhacos egg to the warehouse custodian in Twine."},{"name":"SYSTEM","text":"You will have ninety seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"SYSTEM","text":"You must keep the egg in pristine condition on your journey to the pub in Twine."},{"name":"MINER03506","text":"You must be the <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> who's bringin' me a phorusrhacos egg. I'll know if you try to cheat me, so don't even think about it!"},{"name":"DALRIC","text":"It'll be easier if you bring the egg straight to the pub."},{"name":"MINER03506","text":"Oh yes, lovely! You don't see many like this! Well, that's Dalric's part of the bargain taken care of. He's got your share, so if you want payin', ask him."},{"name":"DALRIC","text":"Seems to me you've got a talent for this kind of work. I could use someone like you."},{"name":"DALRIC","text":"First of all, here's the coin I promised. If you've got a mind to take on another job, come and see me."}],"reward":{"gil":679,"items":[{"id":26867}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69149]},"next":[69043]},"partials":[{"type":"npc","id":"1027922","obj":{"i":1027922,"n":"Dalric","l":2955,"q":2}},{"type":"item","id":"26867","obj":{"i":26867,"n":"Titanbronze Ring Coffer (IL 409)","l":1,"c":26567,"t":61}},{"type":"quest","id":"69149","obj":{"i":69149,"n":"On Track","g":8,"l":"Amh Araeng","s":720}},{"type":"quest","id":"69043","obj":{"i":69043,"n":"Taken Down a Peck or Two","g":115,"l":"Amh Araeng","s":6210}}]}