{"quest":{"name":"Stripe for the Picking","location":"Amh Araeng","id":69045,"patch":5.0,"sort":6230,"eventIcon":71221,"issuer":1030424,"target":1030424,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Andri's furrowed brow suggests he has a predicament he is attempting to solve."],"objectives":["Search at the specified location and obtain a banded gem.","Deliver the banded gem to Andri."],"dialogue":[{"name":"ANDRI","text":"Why must all matters pertaining to romance be so very problematic? My lady friend has sadly left the windswept plains of Amh Araeng to seek a life of luxury, relatively speaking, in the Crystarium."},{"name":"ANDRI","text":"I fear that the passing of time may cause her heart to grow distant, so I plan to send a ring to serve as a symbol of our everlasting love."},{"name":"ANDRI","text":"I finally bought one with my hard-earned savings, only to discover later that a substantial crack runs along the surface of its otherwise beautiful banded gem. Rather than spend <span class=\"emphasis\">another</span> fortune on a new ring or replacement stone, I struck upon an idea."},{"name":"ANDRI","text":"It would be far more economical to hire someone to retrieve a similar gem and affix it to the ring myself. And that, my friend, is where you come in. Any risk of injury in the mine will be far outweighed by the gil I offer as a reward, I assure you!"},{"name":"ANDRI","text":"The places in which such gems may be found are invariably fraught with danger. I would go myself, but I am afraid my...constitution makes such forays entirely out of the question."},{"name":"ANDRI","text":"Well? Have you found a gem that is sufficiently dazzling?"},{"name":"ANDRI","text":"Splendid! Simply gorgeous!"},{"name":"ANDRI","text":"I hope you did not encounter any dangers while searching for it. I hear these are produced by gnomes, and you can tell their age from the number of stripes on the stones they drop."},{"name":"ANDRI","text":"Unfortunately, attempting to slay one of the brutes is likely to damage the precious gems that appear from its rocky hide. It is better and safer to retrieve those that have fallen naturally."},{"name":"ANDRI","text":"In other words, where you find these stones, you will also encounter gnomes, hence my reluctance to hunt for one myself."},{"name":"ANDRI","text":"I am positive my lady friend will be pleased to receive such a wonderful gift. And as agreed, here is payment for your exemplary efforts."}],"reward":{"gil":759},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69149]}},"partials":[{"type":"npc","id":"1030424","obj":{"i":1030424,"n":"Andri","l":2955,"q":1}},{"type":"quest","id":"69149","obj":{"i":69149,"n":"On Track","g":8,"l":"Amh Araeng","s":720}}]}