{"quest":{"name":"Town Haul","location":"Amh Araeng","id":69040,"patch":5.0,"sort":6180,"eventIcon":71221,"issuer":1030982,"target":1030982,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The seasoned scavenger is reluctant to leave empty-handed."],"objectives":["Retrieve the antique coins.","Retrieve the decorative Ronso crockery.","Retrieve the battered chest.","Deliver the relics to the seasoned scavenger."],"dialogue":[{"name":"NOVICESCAVENGER03504","text":"That was the most excitement I have had in a long time! Thank you!"},{"name":"EXPERTSCAVENGER03504","text":"While we took an enormous risk in coming here, the treasures we found made it worthwhile. But we were forced to throw them away when those creatures came after us!"},{"name":"EXPERTSCAVENGER03504","text":"Very valuable, they are. The Ronso miners who used to live here in Kelk had some excellent shinies!"},{"name":"EXPERTSCAVENGER03504","text":"After the Mystel arrived with their Talos, everything changed, and most of the laborers relocated to Twine. The place was abandoned and they only took what they needed, leaving everything else behind."},{"name":"EXPERTSCAVENGER03504","text":"Maybe these shinies were not so important to the Ronso, but to us scavengers, this is a treasure trove!"},{"name":"EXPERTSCAVENGER03504","text":"If we were to return empty-handed, the whole expedition would have been a waste of time. Will you help me reclaim our bounty?"},{"name":"EXPERTSCAVENGER03504","text":"The most precious were the bag of ancient coins, the pretty tableware, and the damaged chest. Once we have those, we can go home!"},{"name":"NOVICESCAVENGER03504","text":"We will look around here, where there are fewer creatures! But you are not scared of them, are you?"},{"name":"EXPERTSCAVENGER03504","text":"With the money we make from selling these treasures, we will be able to support our families for a long time!"},{"name":"NOVICESCAVENGER03504","text":"Not just pretty, but valuable, too! Thank you!"},{"name":"EXPERTSCAVENGER03504","text":"It looks like you have found all of them. May I take a closer look?"},{"name":"EXPERTSCAVENGER03504","text":"Hmm... These coins might not be worth much after all, but this crockery should fetch a small fortune!"},{"name":"EXPERTSCAVENGER03504","text":"In the picture, you can see the likeness of the great Kelk, the elder who they named the town after. Collectors will pay a lot for this!"},{"name":"EXPERTSCAVENGER03504","text":"But the works of art inside this chest are the real prize. The historians will go giddy when we show them these!"},{"name":"EXPERTSCAVENGER03504","text":"But, I cannot help feel a little sad. These scenes of bustling streets and children playing are a far cry from these crumbling ruins. It is hard to believe that this was once their home."},{"name":"EXPERTSCAVENGER03504","text":"This is one of the reasons why we scavengers take pride in our work. Through these artifacts, we are able to learn more of the past, so that it is not forgotten. Thank you kindly!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69039]},"next":[69041]},"partials":[{"type":"npc","id":"1030982","obj":{"i":1030982,"n":"Seasoned Scavenger","l":2955,"q":3}},{"type":"quest","id":"69039","obj":{"i":69039,"n":"Scavengers Assemble","g":115,"l":"Amh Araeng","s":6170,"f":1}},{"type":"quest","id":"69041","obj":{"i":69041,"n":"Worm in the Ointment","g":115,"l":"Amh Araeng","s":6190}}]}