{"quest":{"name":"Gnome Ore Heroes","location":"Amh Araeng","id":69049,"patch":5.0,"sort":6270,"eventIcon":71221,"issuer":1030952,"target":1030952,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A fiery young lad is keen to slay some gnomes."],"objectives":["Defeat two gnomes and slay the elderly gnome when it appears.","Report to the fiery young lad."],"dialogue":[{"name":"BOY03513","text":"Have you seen a gnome before? Everybody hates them because they eat our gems and attack people."},{"name":"BOY03513","text":"I want to go into the mine and fight them. But everyone says I'm too young! What do you think?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"If those things crunch rocks, they'll make short work of you."},{"name":"A1","text":"Maybe when you're about ten years and a hundred ponzes bigger."},{"name":"BOY03513","text":"I'm not scared of those stupid gnomes! But maybe you're right."},{"name":"BOY03513","text":"Then I'll have to get stronger. I'll smash those gnomes one day!"},{"name":"BOY03513","text":"Why don't you show me how it's done? If you can beat that really old and nasty one, I'll be impressed!"},{"name":"BOY03513","text":"I want to see how brave you are!"},{"name":"BOY03513","text":"I can't wait till I'm big enough to fight them myself!"},{"name":"FATHER03513","text":"It seems my boy's been spouting all sorts of nonsense!"},{"name":"BOY03513","text":"You did it!"},{"name":"BOY03513","text":"It was all my idea, though. Thanks to me, the mine's safe!"},{"name":"FATHER03513","text":"I'm sorry for the trouble he's put you through. All's well that ends well, I suppose. You've certainly done us miners a favor."},{"name":"FATHER03513","text":"And I'm sure he would've been there beside you if he were older. He just needs to wait till he's strong enough to back up that big mouth of his."},{"name":"FATHER03513","text":"I appreciate you taking the time to listen to him and clear out the mine, though. It's not much, but please accept this as a show of thanks."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69047]},"next":[69050]},"partials":[{"type":"npc","id":"1030952","obj":{"i":1030952,"n":"Fiery Young Lad","l":2955,"q":1}},{"type":"quest","id":"69047","obj":{"i":69047,"n":"Charmless Man","g":115,"l":"Amh Araeng","s":6250,"f":1}},{"type":"quest","id":"69050","obj":{"i":69050,"n":"The Piping of the Dead","g":115,"l":"Amh Araeng","s":6280}}]}