{"quest":{"name":"Worm in the Ointment","location":"Amh Araeng","id":69041,"patch":5.0,"sort":6190,"eventIcon":71221,"issuer":1030982,"target":1030979,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The seasoned scavenger has one last favor to ask."],"objectives":["Speak with the quick-witted scavenger.","Use the blunt knife at the designated locations to catch rock wrigglers.","Deliver the rock wrigglers to the quick-witted scavenger."],"dialogue":[{"name":"NOVICESCAVENGER03505","text":"Not just pretty, but valuable, too! Thank you!"},{"name":"EXPERTSCAVENGER03505","text":"There is one last thing I would ask of you, if I may be so bold."},{"name":"EXPERTSCAVENGER03505","text":"We are now ready to return to Twine, but I am afraid that I picked up a rather nasty injury while fending off those beasts."},{"name":"EXPERTSCAVENGER03505","text":"It is not serious, and should heal in time, but it will take a while for me to complete the return journey. I would be grateful if you could go ahead and let our friend know that we are on our way back. We will see you in Twine!"},{"name":"MORDSCAVENGER03505","text":"So, did you find my fellow scavengers?"},{"name":"MORDSCAVENGER03505","text":"I am so relieved! My reputation is safe! And also, my friends are not dead!"},{"name":"MORDSCAVENGER03505","text":"But one of them is injured, you say? I should make sure he at least reaches Twine before he keels over... Unfortunately, we Mord do not heal in the same way as Humes or Ronso, so their treatments will not work on us."},{"name":"MORDSCAVENGER03505","text":"He will need freshly prepared ointment to seal the wound, made according to our traditional recipe. While I can get most of the ingredients here in Twine, I still need two plump, juicy rock wrigglers."},{"name":"MORDSCAVENGER03505","text":"If you could go and catch them for me, I will take care of the rest!"},{"name":"MORDSCAVENGER03505","text":"They like to hide in the crags, so try hooking them out with this knife. Time is of the essence, so please do not dilly or dally!"},{"name":"MORDSCAVENGER03505","text":"Rock wriggler blood is very sticky, so we use them for ointments. But remember, you must never try to eat one, unless you like having your tongue stuck to the roof of your mouth!"},{"name":"EXPERTSCAVENGER03505","text":"Thank you for passing on my message. It seems you have been rather busy in our absence!"},{"name":"NOVICESCAVENGER03505","text":"We would have arrived a lot sooner if he was not limping the whole way!"},{"name":"MORDSCAVENGER03505","text":"You have the rock wrigglers?"},{"name":"MORDSCAVENGER03505","text":"Excellent! Once I've squeezed out their blood and mixed it with the other ingredients, the ointment will be ready!"},{"name":"MORDSCAVENGER03505","text":"But before we leave, my friends wish to offer their thanks."},{"name":"EXPERTSCAVENGER03505","text":"You were under no obligation to help us, but you did so without a thought for your own safety. We will never forget you!"},{"name":"NOVICESCAVENGER03505","text":"And the rest of Twine is sure to be impressed by our adventures! I am glad to be alive to tell the tale!"},{"name":"MORDSCAVENGER03505","text":"Your deeds will live on in the stories we share with our children, and our children's children! Fare thee well!"}],"reward":{"gil":832,"items":[{"num":2,"id":27866,"one":1},{"num":2,"id":27867,"one":1},{"num":2,"id":27868,"one":1},{"num":2,"id":27869,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69040]}},"partials":[{"type":"npc","id":"1030982","obj":{"i":1030982,"n":"Seasoned Scavenger","l":2955,"q":3}},{"type":"npc","id":"1030979","obj":{"i":1030979,"n":"Quick-witted Scavenger","l":2955,"q":2}},{"type":"item","id":"27866","obj":{"i":27866,"n":"Sausage Links","l":409,"c":24365,"t":46,"p":3595}},{"type":"item","id":"27867","obj":{"i":27867,"n":"Roast Ovim","l":409,"c":24361,"t":46}},{"type":"item","id":"27868","obj":{"i":27868,"n":"Mushroom Skewer","l":409,"c":24201,"t":46,"p":3595}},{"type":"item","id":"27869","obj":{"i":27869,"n":"Baked Megapiranha","l":409,"c":24311,"t":46,"p":3595}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69040","obj":{"i":69040,"n":"Town Haul","g":115,"l":"Amh Araeng","s":6180}}]}