{"quest":{"name":"Charmless Man","location":"Amh Araeng","id":69047,"patch":5.0,"sort":6250,"unlocksFunction":1,"eventIcon":71341,"issuer":1027927,"target":1030807,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sveinn has discovered something unusual in the delivery brought from the mine."],"objectives":["Show the cat's-eye charm to the graveyard keeper.","Give the cat's-eye charm to the one-eyed miner."],"dialogue":[{"name":"SVEINN","text":"Have you seen a charm like this before? I found it among the stones brought from the mine. A lot of the workers wear these for good luck, and I expect whoever lost it is wondering where it went."},{"name":"SVEINN","text":"It's the first time I've seen one made from cat's-eye, so the owner shouldn't be hard to track down. I'd go and look for them myself, but I've got too much to do here."},{"name":"SVEINN","text":"Would you be able to go in my place? The graveyard keeper is quite knowledgeable about charms and whatnot, so it might be worth asking him."},{"name":"SVEINN","text":"I can't very well keep it for myself or sell it. For all I know, it could be cursed or something!"},{"name":"PRIEST03511","text":"What's that you have there?"},{"name":"PRIEST03511","text":"Oh, yes. Cat's-eye charms like this were once used to ward off misfortune. The tradition began with the Church of the First Light and the gem represents their patron deity."},{"name":"PRIEST03511","text":"Even though no one follows that old religion anymore, some of its customs remain, especially among the miners."},{"name":"PRIEST03511","text":"You don't see many this exquisite, though. I seem to remember the fellow with an eyepatch kept a similar charm around his neck. It might even be the exact same one."},{"name":"PRIEST03511","text":"I never caught his name, but he's not hard to miss. The last I saw of him, he was leaving to mine Nuvy's Leavings with some of the others."},{"name":"SVEINN","text":"Man with an eyepatch? Yes, I know the one. So you think the charm might be his?"},{"name":"PRIEST03511","text":"I can't say for certain if the man I mentioned is the owner. I have a feeling I saw him wearing that charm, though."},{"name":"MINER03511","text":"Oh, I didn't notice you there. What do you want?"},{"name":"MINER03511","text":"Where did you get this!?"},{"name":"MINER03511","text":"Gods! How could I have been so careless!"},{"name":"MINER03511","text":"This was all my sister left behind before she... Look, I'd rather not talk about it. But I appreciate you bringing this back to me. It means a lot."}],"reward":{"gil":606,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69151]},"next":[69048,69049]},"partials":[{"type":"npc","id":"1027927","obj":{"i":1027927,"n":"Sveinn","l":2955,"q":1}},{"type":"npc","id":"1030807","obj":{"i":1030807,"n":"One-eyed Miner","l":2955,"q":1}},{"type":"quest","id":"69151","obj":{"i":69151,"n":"The Truth Hurts","g":8,"l":"Amh Araeng","s":740}},{"type":"quest","id":"69048","obj":{"i":69048,"n":"Oil Be Back","g":115,"l":"Amh Araeng","s":6260}},{"type":"quest","id":"69049","obj":{"i":69049,"n":"Gnome Ore Heroes","g":115,"l":"Amh Araeng","s":6270}}]}