{"quest":{"name":"My Heart Will (Not) Go On","location":"Eulmore","id":69052,"patch":5.0,"sort":7201,"eventIcon":71221,"issuer":1030455,"target":1030457,"genre":112,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Queen Bee requires the assistance of someone willing to venture into less savory─a word which here means “wealthy”─parts of the city."],"objectives":["Speak with Solina in the Derelicts.","Speak with the Queen Bee at the Beehive.","Speak with the Queen Bee."],"dialogue":[{"name":"MANAGER03516","text":"Pardon me for saying so, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>, but you have something of a different air about you than our usual clientele. Are you the bold and daring sort, perhaps?"},{"name":"MANAGER03516","text":"Wonderful! I require someone willing to undertake a dangerous mission, you understand. To venture to...&lt;shudder&gt;...the <span class=\"emphasis\">Derelicts</span>. Word has reached me that our most popular honeybee, Solina, was spotted there of late."},{"name":"MANAGER03516","text":"Both patrons and staff have had difficulty coping with the recent...revelations, but Solina must have taken it harder than most. She hasn't returned to the Beehive since. If you have the stomach for the task, I implore you─bring her back."},{"name":"MANAGER03516","text":"I understand that it is much to ask, but Solina's absence does trouble me so."},{"name":"SOLINA","text":"The Queen Bee is worried on my behalf? Oh, dear..."},{"name":"SOLINA","text":"I'm sorry, but I cannot return with you. My beloved, you see, he was caught up in the chaos and... I don't know. People saw him fall. It was right here that it happened, they told me."},{"name":"SOLINA","text":"You must understand, if there's any chance that the sea didn't take him, that he swam ashore somewhere or caught onto a piece of debris and hasn't found his way back yet... I need to keep looking. Please."},{"name":"SOLINA","text":"I can't go back now. I simply can't. Please apologize on my behalf."},{"name":"MANAGER03516","text":"Standing atop a sunken ship, hoping for her beloved's return? How poetic."},{"name":"MANAGER03516","text":"...Indeed, sufficiently poetic that I am more concerned than ever she may do something rash. Very well. I will...&lt;gulp&gt;...attend to her myself─though I would feel much reassured for your presence, if you would be so kind as to accompany me."},{"name":"MANAGER03516","text":"Solina, please, you must heed my words! It's not safe for you here!"},{"name":"SOLINA","text":"I don't care! What's the point in my being safe if he's...if he's not..."},{"name":"MANAGER03516","text":"There is a great deal of meaning in your being hale and whole, as I am sure your sweetheart would agree. But if you will not believe that, consider this─your chances of finding him would be significantly increased were you to <span class=\"emphasis\">ask for help</span>. Allow me to demonstrate."},{"name":"MANAGER03516","text":"My good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, you have proven yourself fearless thus far. Might I impose upon you to assist in the search? I will personally ensure that you are rewarded for your efforts."},{"name":"SOLINA","text":"O-Oh! I didn't think─ I mean, everyone else told me to give up. Thank you."},{"name":"MANAGER03516","text":"Of course. My earlier statement was not merely referring to your physical well-being. I will leave the search to you and our stalwart friend here, but do return to the Beehive once you have located your beloved. I think you will find that your absence has been felt most keenly."},{"name":"SOLINA","text":"No matter how many times you ask, my answer won't change!"}],"reward":{"gil":679,"items":[{"num":2,"id":27877}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69168]},"next":[69053]},"partials":[{"type":"npc","id":"1030455","obj":{"i":1030455,"n":"Queen Bee","l":2952,"q":1}},{"type":"npc","id":"1030457","obj":{"i":1030457,"n":"Queen Bee","l":2952,"q":1}},{"type":"item","id":"27877","obj":{"i":27877,"n":"Paella","l":418,"c":24031,"t":46}},{"type":"quest","id":"69168","obj":{"i":69168,"n":"Paradise Fallen","g":8,"l":"Eulmore","s":840}},{"type":"quest","id":"69053","obj":{"i":69053,"n":"Near, Far, Wherever You Are","g":112,"l":"Eulmore","s":7210}}]}