{"quest":{"name":"Scattered to the Winds","location":"Eulmore","id":69055,"patch":5.0,"sort":7230,"eventIcon":71221,"issuer":1027550,"target":1027550,"genre":112,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Aarner is staring mournfully over the railing."],"objectives":["Collect tearstained letters in the Derelicts.","Deliver the tearstained letters to Aarner near the Grand Dame's Parlor."],"dialogue":[{"name":"AARNER","text":"My letters! Scattered by the winds! Whose idea was it to build this city with so many breezy walkways?"},{"name":"AARNER","text":"&lt;sigh&gt; No. In this, too, I have no one to blame but myself. They are important to me, though, so might I ask you to search for them? There are three, all told. They likely came to rest in the Derelicts, as these things tend to."},{"name":"AARNER","text":"I would fetch the letters myself, but I'm meant to be meeting someone here, and I don't believe I could stand to disappoint yet another person."},{"name":"AARNER","text":"Ah, there you are. Did you have any luck?"},{"name":"AARNER","text":"You found all three! Wonderful! I cannot possibly express how difficult it would have been for me to rewrite them."},{"name":"AARNER","text":"Wait... Now I've had a good look at you─are you perchance one of those responsible for freeing us from Vauthry's influence?"},{"name":"AARNER","text":"I thought as much. You have my thanks, for opening my eyes."},{"name":"AARNER","text":"I used to reside in the Crystarium, you know. But the moment that I saw for myself what happens when the eaters take a person... I truly understood, for the first time, that our world teeters on the brink of destruction. I was terrified."},{"name":"AARNER","text":"I knew I could do nothing to change fate. So I came to Eulmore, hoping to forget it instead. Abandoned my work, my family...everything. And I felt no guilt for it, convinced as I was that nothing mattered."},{"name":"AARNER","text":"Now, though, the scales have fallen from my eyes. I've always been a coward, and what I did was a betrayal of the highest order. And I know...I know there's no going back."},{"name":"AARNER","text":"If nothing else, however, I can apologize for what I've done. So I labored over these letters, hoping to convey my contrition. I don't expect forgiveness, but I hope it might mean something, at least, to those I left behind."},{"name":"AARNER","text":"I cannot alter what has been done, but I can change myself. Try to be better. And you will always have my gratitude for giving me the ability to see that─you and your elven friend, both. Thank you."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69168]}},"partials":[{"type":"npc","id":"1027550","obj":{"i":1027550,"n":"Aarner","l":2952,"q":1}},{"type":"quest","id":"69168","obj":{"i":69168,"n":"Paradise Fallen","g":8,"l":"Eulmore","s":840}}]}