{"quest":{"name":"The Piping of the Dead","location":"Amh Araeng","id":69050,"patch":5.0,"sort":6280,"eventIcon":71221,"issuer":1027934,"target":1030955,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Haraldur has found a piece of lost property."],"objectives":["Give the extravagant pipe to the chiseled miner.","Speak with the chiseled miner."],"dialogue":[{"name":"HARALDUR","text":"'Scuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mate</span></span>. That bloke you were talking to dropped his pipe."},{"name":"HARALDUR","text":"It seems sort of old. Might be worth something."},{"name":"HARALDUR","text":"I'd run over and give it back to him, but I've got a job to do. Maybe you could do it instead?"},{"name":"HARALDUR","text":"It don't look like the sort of pipe you'd throw away."},{"name":"FATHER03514","text":"Let me guess, my boy's up to his old tricks again?"},{"name":"FATHER03514","text":"My pipe! I've been looking for this. I can't thank you enough for bringing it back to me!"},{"name":"FATHER03514","text":"There's a bit of a story behind it, you see."},{"name":"FATHER03514","text":"If you have the time, please come and meet me in the graveyard. I'd like to tell you a tale, if I may."},{"name":"FATHER03514","text":"I'm glad you decided to join me. You see, this pipe was once owned by a much loved and respected member of our community, who now rests beneath this very soil."},{"name":"FATHER03514","text":"He was a good friend to many of us, myself included, and came from a long line of Ronso going all the way back to the great Nuvy. The mine was named after his ancestor."},{"name":"FATHER03514","text":"He always felt a sense of pride in his work, and led digs that went deeper and deeper into the rock."},{"name":"FATHER03514","text":"No matter what happened, he never gave up. After the Talos masters left fifteen years ago, we ran into all sorts of problems. We lost so many good workers to cave-ins, sin eater attacks, injury, and simply leaving for better prospects elsewhere. Even then, he kept digging."},{"name":"FATHER03514","text":"Though he is no longer with us, we try to follow the example he set. I always carry his old pipe with me as a memento of the days we spent together."},{"name":"FATHER03514","text":"I'm grateful to you for taking the time to listen. It's good to know that someone from outside of Twine has an interest in the work we do and the reasons why we keep going, in spite of everything."},{"name":"FATHER03514","text":"Which reminds me, I need to see the others about getting rid of those wretched gnomes, but I hope I will have the chance to speak with you again one day. Fare thee well."}],"reward":{"gil":759,"items":[{"id":26865}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[69048,69049]}},"partials":[{"type":"npc","id":"1027934","obj":{"i":1027934,"n":"Haraldur","l":2955,"q":1}},{"type":"npc","id":"1030955","obj":{"i":1030955,"n":"Chiseled Miner","l":2955,"q":1}},{"type":"item","id":"26865","obj":{"i":26865,"n":"Titanbronze Necklace Coffer (IL 409)","l":1,"c":26565,"t":61}},{"type":"quest","id":"69048","obj":{"i":69048,"n":"Oil Be Back","g":115,"l":"Amh Araeng","s":6260}},{"type":"quest","id":"69049","obj":{"i":69049,"n":"Gnome Ore Heroes","g":115,"l":"Amh Araeng","s":6270}}]}