{"quest":{"name":"The Invisible Hand","location":"Eulmore","id":69054,"patch":5.0,"sort":7220,"eventIcon":71221,"issuer":1029983,"target":1029983,"genre":112,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Mystel perched on the elegant chair before you looks as if he could teach you a thing or two."],"objectives":["Gather information in the Derelicts.","Speak with Zoi-Chorr."],"dialogue":[{"name":"ZOICHORR","text":"Greetings, sinner. If you're wondering about the chair─a little perk of my trade is getting to keep the odd luxury good for myself. I'm a provider, you see."},{"name":"ZOICHORR","text":"Think of me like...a merchant, except I don't set up shop. I just figure out what people need, and make sure they get it."},{"name":"ZOICHORR","text":"Now, you─seems to me what <span class=\"emphasis\">you</span> need is an interesting way to occupy your time. I can provide that. And in return, you'll bring me back some information. Sound fair?"},{"name":"ZOICHORR","text":"It's a deal. Now, as I said─I need information, and lots of it. Things like what just happened here, they change the status quo, you see. And that changes <span class=\"emphasis\">demand</span>. Makes people need more of some things, want less of others."},{"name":"ZOICHORR","text":"I have to make sure that I get the right goods, in the right quantities, else it's a waste of my time─and that's where you come in. You'll ask around here in the Derelicts, then come back and tell me what's in demand."},{"name":"ZOICHORR","text":"Of course, you can't always trust people to tell you what they need─or even to know it, come to that. Nah, you've got your prudent folks, but you've also got your melodramatic fools, and those who can't add two and two to save their lives. Make sure you mind what sort you're talking to."},{"name":"ZOICHORR","text":"I have some idea what to expect─I've been doing this a long time, after all. But I wouldn't be holding up my end of the bargain if I told you in advance, would I?"},{"name":"MATHISOL","text":"Well, since you're asking, I could certainly do with some extra glue. There's a lot of damage here. As for how much...about twice what I'd normally use, I'd say."},{"name":"ZIABOSTT","text":"Without meol, we're doomed! Doomed, I say! The price of even a single fish has skyrocketed!"},{"name":"LOEBOSTA","text":"Typically, when Zoi asks, I tell him we need some firewood, a few foodstuffs, and glue─but not, you know, a whole lot of glue. Now...hmm. Not more firewood. But not...less, either? And I'm not sure about the rest."},{"name":"MATHISOL","text":"Yes, I think twice the usual amount of glue should do."},{"name":"ZIABOSTT","text":"Famine! Scarcity! Doooooom!"},{"name":"LOEBOSTA","text":"An...amount of firewood. Like always. You know what I mean, right?"},{"name":"ZOICHORR","text":"So, what goods should I hunt down?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Very little firewood, lots of foodstuffs, and no glue."},{"name":"A1","text":"More firewood than usual, but less food and glue."},{"name":"A1","text":"The usual amount of firewood, but twice as much food and glue."},{"name":"ZOICHORR","text":"That's about what I expected. What with the damage caused by the chaos and the lack of meol, people are bound to need food and the materials to make repairs. Fortunately, those are both within my means to provide."},{"name":"ZOICHORR","text":"Thanks for your help─and I hope you enjoyed learning a bit about the business. You really meet some characters, eh?"},{"name":"ZOICHORR","text":"You don't seem too certain, and that's never a good sign. Do me a favor and ask around again, alright?"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69168]}},"partials":[{"type":"npc","id":"1029983","obj":{"i":1029983,"n":"Zoi-Chorr","l":2952,"q":1}},{"type":"quest","id":"69168","obj":{"i":69168,"n":"Paradise Fallen","g":8,"l":"Eulmore","s":840}}]}