{"quest":{"name":"Flowering Friendships","location":"Lakeland","id":69051,"patch":5.0,"sort":7140,"icon":100863,"eventIcon":71221,"issuer":1030680,"target":1031058,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tolas would express his gratitude for all that you have done on his behalf.","Tolas is well pleased to see you return, and cheerfully explains that he has resumed his duties with the guard since last you met. He then mentions that he is about to depart for the Crystarium in order to place a supply order with Mauwyl. He invites you along, that you might together clear the roads to the city of threatening beasts, and subsequently reunite with your woodcutter friend.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","As you make your way through the woods, you come upon Tolas standing over the body of a fallen monster. The guardsman explains that he was attacked by the beast, but was able to make short work of it, showing no signs of the crippling fear and anxiety that had plagued him when you first met. Feeling relieved and happy for your friend, you smile and press on.","Venturing further into the forest, you and Tolas come upon a pack of angry anemones. Tolas suggests that you dispatch them with some stink bombs, a handy tool the guardsman says will drive the beasts away in short order. Intrigued at the idea of dispatching monsters with nonviolent means, you take the unconventional instruments in hand and prepare for a game of toss.","The stink bombs are remarkably effective in driving away the beasts that had blocked your path. Pinching your nose to protect against the stench, you begin walking back to report to Tolas, that you might continue on your journey.","Tolas congratulates you with a smile, and further informs that the handy stink bombs were fashioned by none other than Mauwyl himself to protect him on his forays into the forest. Nodding your head in admiration of the young woodcutter's ingenuity, you stride off in the direction of the Crystarium.","As you progress further on, Tolas stops to comment on the inordinate number of monsters lurking in the woods on this day. You have barely opened your mouth to speak when you are cut off by a man's scream, apparently coming from a short distance away. You and your guardsman companion quickly rush to the man's aid.","At the scene of the scream, you find Tolas together with a familiar face: the guardsman Nielden, who had been beset by a fiend while gathering supplies. Though the men were able to dispatch the monster, Tolas suffered a light wound in the battle. Nielden insists that the two of you go with him to Fort Jobb, where your mutual friend Callea, might tend to the guardsman's wound.","Callea is overjoyed to see you again, and cheerfully volunteers to dress Tolas's wound. The guardsman is most impressed by the efficacy of the girl's hand-fashioned salves, and asks if he might purchase a batch to bring back to the Imperative. Callea is flattered, but explains that unfortunately she barely has enough ingredients to make potions for Fort Jobb. At your suggestion, Tolas proposes a plan: that you task the woodcutter Mauwyl with procuring the necessary herbs. Though she is reluctant to impose on the kindness of strangers, Callea agrees to accompany you to the Crystarium to make the request in person.","Arriving at the Crystarium with your companions, you enjoy a joyous reunion with Mauwyl. Hearing the proposal from Tolas, the youth cheerfully agrees, and all present rejoice at what is sure to be a beneficial arrangement for all the involved parties. Tolas offers an observation about your remarkable ability to bring people together. Bowing deeply, he offers his profuse thanks for all you have done─not only for him and his friends, but for the greater good of Lakeland."],"objectives":["Speak with Tolas.","Speak with Tolas again.","Use stink bombs to repel the angry anemones.","Speak with Tolas.","Speak with Tolas yet again.","Follow Tolas.","Speak with Nielden at Fort Jobb.","Speak with Tolas at Musica Universalis."],"dialogue":[{"name":"TOLAS","text":"Ah, <span class=\"highlight\">Forename</span>. Thanks in no small part to you, I have been able to fully resume my duties with the guard. As a matter of fact, I was just about to depart for the Crystarium to secure a shipment of building materials."},{"name":"TOLAS","text":"I trust that you, too, will be returning to the city? If so, then pray give me the pleasure of your company on the road."},{"name":"TOLAS","text":"Thank you so very much, my friend. The roads are dangerous these days, and I would feel all the better with a capable combatant at my side. Together, I daresay we could do our fair share to clear the path of threats for the travelers who will come after us."},{"name":"TOLAS","text":"You may be pleased to know that the supplier I mean to meet with is none other than our mutual friend Mauwyl. No doubt he will be delighted to see you again as well."},{"name":"TOLAS","text":"At any rate, see to whatever preparations you may have. I am ready to depart whenever you are."},{"name":"TOLAS","text":"One can barely take a few paces without running into one of these fiends, no? As you can see, I had no trouble seeing to the threat."},{"name":"TOLAS","text":"<span class=\"emphasis\">This</span> is what you have done for me, <span class=\"highlight\">Forename</span>. I am able to summon all of my strength and skill once more, and I fear for any beast that dares stand in my path."},{"name":"SYSTEM","text":"The angry anemone eyes you warily..."},{"name":"TOLAS","text":"Do you see those floating nasties over there? They have grown plentiful in these parts of late."},{"name":"TOLAS","text":"While we could cut them down easily enough, their endless screams and tittering are like as not to attract more of their friends."},{"name":"TOLAS","text":"Fortunately, we've recently discovered a method for dealing with these creatures quickly and effortlessly. Behold the ever-handy stink bomb. When thrown, they emit a stench that─while barely tolerable for us─is positively sickening to creatures with sensitive noses."},{"name":"TOLAS","text":"This will drive the beasts away, as well as deterring any of their friends from joining the party. Here's a handful of them: why not give them a try?"},{"name":"TOLAS","text":"Just toss the stink bombs in the vicinity of the anemones, and watch as our foe scatters and skitters away to escape the stench."},{"name":"SYSTEM","text":"The angry anemone eyes you warily. Toss a stink bomb in its direction to chase it away."},{"name":"MONSTERA","text":"Graaaaaah!"},{"name":"SYSTEM","text":"The angry anemone lets out a pained screech and flees from the scene. A moment later, the stench of raw refuse and night soils wafts in on the air..."},{"name":"MONSTERB","text":"Unnngraaaaaahhh!"},{"name":"SYSTEM","text":"The angry anemone shrieks out and flutters away in a rush..."},{"name":"MONSTERC","text":"Greeeccchhh!"},{"name":"SYSTEM","text":"The anemone cries out and races from the scene. The stench is growing unbearable..."},{"name":"TOLAS","text":"Rather effective, wouldn't you say? Thanks to tools like this, even new recruits and others less comfortable with a blade than you or I can hold their own against all manner of nasty creatures."},{"name":"TOLAS","text":"In fact, it was none other than Mauwyl who procured these for us. As he tells it, they've long been favored by woodcutters, gatherers, and the like seeking to protect themselves during forays deep into the forest."},{"name":"TOLAS","text":"Speaking of Mauwyl, we shouldn't keep him waiting. Let us be on our way."},{"name":"TOLAS","text":"The beasts are out in numbers today. We have been undermanned of late, and this is the price we pay."},{"name":"TOLAS","text":"(-Man's Scream-)Gahhh! Get back, you godsdamned fiend!"},{"name":"TOLAS","text":"A cry for help!? Come, <span class=\"highlight\">Forename</span>─we must hurry to the man's aid!"},{"name":"NIELDEN","text":"&lt;pant&gt; &lt;pant&gt; Well, I'll be damned... <span class=\"highlight\">Forename</span>? What are you doin' here?"},{"name":"TOLAS","text":"The beast nicked me in the leg, but worry not─it is but a flesh wound. I am Tolas, and I serve the Crystarium guard at the Ostall Imperative. How do you fare, my brother-in-arms?"},{"name":"NIELDEN","text":"I'm Nielden, servin' at Radisca's Round. As for my wounds, they could've been much worse, an' I thank you for that."},{"name":"NIELDEN","text":"Came to the forest to pick herbs and reagents for a batch o' potions, but it seems I got a bit too wrapped up in the task. 'Fore I knew it, the beast was on top o' me."},{"name":"NIELDEN","text":"Ye have my gratitude, as well as my apologies for that nasty wound you suffered comin' to my aid. Don't you worry, though. We've a talented physician at Fort Jobb who'd be more than happy to patch ye right up!"},{"name":"TOLAS","text":"I appreciate the offer, but that will not be necessary. It is but a scratch, and my friend and I have places we must─"},{"name":"NIELDEN","text":"There's no way I'm going to send the man who saved my damned life back out there lookin' like that! Er, I mean, I insist. Fort Jobb's just a short walk away, an' our physician truly is one o' the best."},{"name":"NIELDEN","text":"'Course, I speak of Callea. She's been holdin' down the fort damned well since last we met. People swear she's the second coming of her dear ol' father, bless his name."},{"name":"NIELDEN","text":"Ye'll be comin' along too, won't you, <span class=\"highlight\">Forename</span>? The girl'd be beside herself with joy to see ye again."},{"name":"TOLAS","text":"Very well. If you, too, are a friend of <span class=\"highlight\">Forename</span>, I see no reason to refuse. Pray lead the way."},{"name":"NIELDEN","text":"Now that's what I wanted to hear! The fort's just a ways in that direction. Let's be off, eh?"},{"name":"TOLAS","text":"The wound is nothing to speak of, but I am not a man who would refuse the kindness of his friends."},{"name":"CALLEA","text":"<span class=\"highlight\">Forename</span>! What a lovely surprise! How ever have you been?"},{"name":"NIELDEN","text":"There'll be time enough for small talk after, Callea. Right now, this man needs your help. Got himself right scratched up saving ol' Uncle Nieldy from a nasty critter."},{"name":"CALLEA","text":"Oh, heavens! You must come with me at once, good sir. Uncle Nielden, <span class=\"highlight\">Forename</span>, you two can wait here. It will not take me long."},{"name":"CALLEA","text":"...And that should do it. Once again, Ser Tolas, you have my sincere gratitude for saving Uncle Nielden's life. But do promise me you'll be more careful in the future, yes?"},{"name":"TOLAS","text":"Hah! I had a mind to impress you with the confidence and composure you helped me regain, but instead it would appear that I have embarrassed myself once again."},{"name":"CALLEA","text":"Hm? Do you mean to say that <span class=\"highlight\">Forename</span> came to your aid as well? Why, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> did the same for me!"},{"name":"TOLAS","text":"You don't say! And what, pray tell, did our friend do for you?"},{"name":"NIELDEN","text":"Heh. Just can't help helpin' folks, eh? That's all well and good, mind ye, but promise me ye'll take as good care of yerself as ye do others."},{"name":"NIELDEN","text":"The last thing anyone in this realm wants is for ye to end up like ol' Colphas, got it?"},{"name":"TOLAS","text":"(-Tolas-)Simply remarkable! The pain is all but gone! And you say this salve is of your own creation?"},{"name":"CALLEA","text":"Yes, though I cannot claim full credit. It is based on a recipe left to me by my departed father. I have had occasion to fashion a few batches, and I have endeavored to improve the potency each time."},{"name":"TOLAS","text":"This is a fine medicine, indeed. What we would not give for a healthy stock of it back at the Imperative..."},{"name":"CALLEA","text":"Ser Tolas just tried out a salve I fashioned. I do not mean to boast, but it's been quite well received among the guardsmen here at Fort Jobb, as well."},{"name":"CALLEA","text":"I would like nothing more than to be able to prepare enough to ship to every outpost, but I fear the ingredients are not so easily come by. As is, I can scarcely produce enough for Fort Jobb."},{"name":"TOLAS","text":"In that case, why not speak with one of the supply caravan leaders? Surely they could procure the materials you need from the markets."},{"name":"CALLEA","text":"I fear it's not so simple. The herbs used in my father's recipes are all native to these parts. Furthermore, they have a habit of growing in the deepest, most perilous parts of the forest."},{"name":"TOLAS","text":"That is unfortunate indeed. If we had an ample supply of your most miraculous salve at the Imperative, I daresay it would do wonders for the soldiers' morale. Is there nothing we can do...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Why not speak with Mauwyl?"},{"name":"A1","text":"I can think of one man for the job..."},{"name":"TOLAS","text":"But of course! The answer was right in front of us all along!"},{"name":"TOLAS","text":"If you are not otherwise occupied, Miss Callea, might you accompany me to the Crystarium? There is someone I would very much like you to meet."},{"name":"CALLEA","text":"T-Truly!? But I... Well, I suppose I don't have any patients waiting at the moment."},{"name":"TOLAS","text":"Then it is settled. If you have no pressing commitments, <span class=\"highlight\">Forename</span>, might you also be so kind as to accompany us as well?"},{"name":"NIELDEN","text":"Not quite sure what ye have in mind, but I trust that ye have Callea's best interests at heart. Take care of yerself out there, friends."},{"name":"TOLAS","text":"Worry not for the girl─we will see that she is safe."},{"name":"CALLEA","text":"This the man Ser Tolas wishes to introduce to me? He looks so young."},{"name":"MAUWYL","text":"Well, if it isn't <span class=\"highlight\">Forename</span>! Come all the way back to see your friend Mauwyl, have you? The pleasure's all mine!"},{"name":"TOLAS","text":"Here is a list of the supplies we require at the Imperative. As you will note, lumber for building is in especially short supply. We are counting on you."},{"name":"MAUWYL","text":"No worries, friend─that's my specialty! By the by, who's the young lady? Something tells me you brought her here for a reason..."},{"name":"MAUWYL","text":"Ingredients for your potions, you say? You've come to the right place! Forest flora is second nature to me, and with my handy stink bombs, I can grab you all the herbs and weeds you need without any beasts bothering me!"},{"name":"CALLEA","text":"Truly, you'd do this for me!? Oh, you are too kind! I'll draft a list straightaway!"},{"name":"TOLAS","text":"I do believe this will be the beginning of a highly mutually beneficial relationship."},{"name":"TOLAS","text":"You really are a most remarkable <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. It is as if, just by making your way through the world as you do, you bring together those around you, uniting them toward a common purpose."},{"name":"TOLAS","text":"If all goes according to plan, Miss Callea's medicine should avail us greatly at the Imperative, giving us greater strength in the battle to defend these lands against the sin eaters."},{"name":"TOLAS","text":"By bringing us together, you have not only enriched our own lives. You have given the people of Lakeland the hope of a brighter future."},{"name":"TOLAS","text":"Once more, you have my profound gratitude, my friend. I will remember your kindness to the very end of my days."}],"reward":{"gil":1266,"items":[{"num":2,"id":27872,"one":1},{"num":2,"id":27873,"one":1},{"num":2,"id":27874,"one":1},{"num":2,"id":27875,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68995,69072]}},"partials":[{"type":"npc","id":"1030680","obj":{"i":1030680,"n":"Tolas","l":2953,"q":1}},{"type":"npc","id":"1031058","obj":{"i":1031058,"n":"Tolas","l":2951,"q":1}},{"type":"item","id":"27872","obj":{"i":27872,"n":"Masala Chai","l":412,"c":24410,"t":46}},{"type":"item","id":"27873","obj":{"i":27873,"n":"Risotto al Nero","l":415,"c":24028,"t":46}},{"type":"item","id":"27874","obj":{"i":27874,"n":"Espresso con Panna","l":415,"c":24407,"t":46,"p":3690}},{"type":"item","id":"27875","obj":{"i":27875,"n":"Mist Spinach Saute","l":415,"c":24152,"t":46,"p":3690}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68995","obj":{"i":68995,"n":"Her True Calling","g":113,"l":"Lakeland","s":4060}},{"type":"quest","id":"69072","obj":{"i":69072,"n":"Resolve Regained","g":113,"l":"Lakeland","s":7130}}]}