{"quest":{"name":"Near, Far, Wherever You Are","location":"Eulmore","id":69053,"patch":5.0,"sort":7210,"eventIcon":71221,"issuer":1030456,"target":1030463,"genre":112,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Solina's eyes implore you to aid in her search."],"objectives":["Search Cracked Shell Beach for a silky-haired elf with a gorgeous smile.","Rescue the silky-haired elf.","Speak with the silky-haired elf in the Derelicts."],"dialogue":[{"name":"SOLINA","text":"Thank you for agreeing to help. I know that he's out there, somewhere. I <span class=\"emphasis\">feel</span> it."},{"name":"SOLINA","text":"I should check belowdecks again... While I do, could you search the Kholusian coast in my stead? I've been thinking that he may have washed up there, but... Well, it's crawling with vicious creatures, and I do have <span class=\"emphasis\">some</span> sense of self-preservation."},{"name":"SOLINA","text":"Look for an elf of about my age. You'll know him when you see him, I'm sure─he has silky hair and the most <span class=\"emphasis\">gorgeous</span> smile!"},{"name":"BOYFRIEND03517","text":"I'm saved! I was so tired after swimming to shore, you see, that I crawled over here and dropped off to sleep... I'm sure you can imagine my horror upon seeing those visages when I awoke!"},{"name":"BOYFRIEND03517","text":"I've worried Solina? I had no idea I'd been gone so long..."},{"name":"BOYFRIEND03517","text":"Of course I will return to Eulmore immediately. Please, join us there─I'm sure she'll want to thank you for all you've done."},{"name":"ELFBOY03517","text":"I can't say that I know any Solina... Unless that would get me into Eulmore? In which case, I <span class=\"emphasis\">definitely</span> know her."},{"name":"ELFBOY03517","text":"You've the wrong person, I'm afraid. So many fled the city in the wake of what happened... You may have a rather difficult time tracking down anyone in particular."},{"name":"BOYFRIEND03517","text":"Solina, how glad I am to see you well!"},{"name":"SOLINA","text":"You... You're alright! Oh, what a relief..."},{"name":"BOYFRIEND03517","text":"Of course I am. I wouldn't leave you all alone."},{"name":"SOLINA","text":"You had better not!"},{"name":"SOLINA","text":"You really brought him back. I don't know how to thank you."},{"name":"BOYFRIEND03517","text":"Still, I'm surprised that the Queen Bee sent you. Perhaps he wasn't as angry as I thought."},{"name":"BOYFRIEND03517","text":"I used to work at the Beehive as well, you see─but when the Queen Bee found out about our relationship... Things became rather heated. I quit, and have been eking out a living here ever since."},{"name":"SOLINA","text":"I didn't expect him to understand, but...he did help, when no one else would. So I will return to the Beehive, as promised, and I'll work harder than ever!"},{"name":"BOYFRIEND03517","text":"For my part...allow me to provide the reward you were offered, along with my sincere gratitude. It's the least I can do."},{"name":"SOLINA","text":"My love, is it truly you?"}],"reward":{"gil":1035},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69052]}},"partials":[{"type":"npc","id":"1030456","obj":{"i":1030456,"n":"Solina","l":2952,"q":1}},{"type":"npc","id":"1030463","obj":{"i":1030463,"n":"Silky-haired Elf","l":2952,"q":1}},{"type":"quest","id":"69052","obj":{"i":69052,"n":"My Heart Will (Not) Go On","g":112,"l":"Eulmore","s":7201}}]}