{"quest":{"name":"Little and Late","location":"Eulmore","id":69057,"patch":5.0,"sort":7250,"eventIcon":71221,"issuer":1030467,"target":1030467,"genre":112,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The forlorn free citizen casts an imploring gaze about the room, catching your eye."],"objectives":["Search for the Mystel manservant in the Derelicts.","Speak with the forlorn free citizen."],"dialogue":[{"name":"ARISTOCRAT03521","text":"At last, eye contact. I know not why, but the other paupers who have passed through avoided my gaze most intently. Dreadfully ill-mannered, the lot of them. I should think they ought to be grateful for the opportunity to complete this task for me─an opportunity that is now yours."},{"name":"ARISTOCRAT03521","text":"In short, I require that you locate my manservant, who has served me faithfully for several years. He recently displeased me in adding a touch too much milk to my afternoon tea, and alas, I unthinkingly pushed him into the sea."},{"name":"ARISTOCRAT03521","text":"I feel somewhat contrite about that now my mind has been freed of Vauthry's influence, of course─particularly as I've found myself entirely incapable of lacing my boots without assistance, and will be forced to wear these hideous shoes ere he returns."},{"name":"ARISTOCRAT03521","text":"Searching for him myself is quite out of the question, naturally. If I could remember his name, I suppose I might call it out, but as matters stand, I am afraid I shall have to rely on you to seek him in my stead."},{"name":"ARISTOCRAT03521","text":"The young man is a Mystel of considerable stature, with rather long hair─I do hope he's keeping it well groomed while he's away. I imagine he may be found weeping in the Derelicts or some such."},{"name":"ARISTOCRAT03521","text":"When you locate him, please do convey my apologies for having acted in such haste. And tell him, lest there be any doubt, that I should be delighted to have him return to my service."},{"name":"ARISTOCRAT03521","text":"Yes, yes, of course there will be remuneration for your services. Go on, off with you now."},{"name":"SERVANT03521","text":"How can I help you?"},{"name":"SERVANT03521","text":"What!? Er, rather─yes, it is certainly I whom you seek."},{"name":"SERVANT03521","text":"That the master regrets casting me into the sea does come as a surprise, however."},{"name":"SERVANT03521","text":"For a blessing, I was rescued by some kind-hearted Ondo who happened to be in the area. However, I did feel compelled to offer them my spear in return."},{"name":"SERVANT03521","text":"Tragic though it is, given that the master primarily valued me for my services as a bodyguard, it would be quite impossible for me to return to his employ now. Yes, it's out of the question, I'm afraid. Please give him my regrets, and tell him that I will miss him <span class=\"emphasis\">dearly</span>."},{"name":"DAMMYA03521","text":"Yes, he does sound like the sort of fellow who might mistake a Hume for a Mystel, I agree. But I'm afraid I've never set foot above. There's a man to the south who matches the description, though─he may be the one you're looking for."},{"name":"DAMMYA03521","text":"Hm? No, I'm afraid I haven't had my hair cut recently. Though if you believe your employer may not be able to tell the difference, I would be happy to accept the role. I'm quite good at swimming."},{"name":"SERVANT03521","text":"The master has my <span class=\"emphasis\">fondest</span> regards, you understand."},{"name":"ARISTOCRAT03521","text":"Why has he not returned with you?"},{"name":"ARISTOCRAT03521","text":"Oh, dear─I daresay that spear was his only possession. But to replace it is a simple matter, and I shall do so forthwith, now that I know where he may be found."},{"name":"ARISTOCRAT03521","text":"Ere I depart, do accept this as recompense for your services─it is but a pittance to me, I assure you."},{"name":"ARISTOCRAT03521","text":"Now, I must make haste─he did say that he missed me dearly. I shall have to ask for his name, this time..."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69168]}},"partials":[{"type":"npc","id":"1030467","obj":{"i":1030467,"n":"Forlorn Free Citizen","l":2952,"q":1}},{"type":"quest","id":"69168","obj":{"i":69168,"n":"Paradise Fallen","g":8,"l":"Eulmore","s":840}}]}