{"quest":{"name":"An Axle to Grind","location":"Amh Araeng","id":69065,"patch":5.0,"sort":7070,"icon":100861,"eventIcon":71221,"issuer":1030419,"target":1030419,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Horthur wishes to put your knowledge and experience to good use.","According to Horthur, the work to open up the collapsed tunnel of the Dragging Tail is proceeding apace under the leadership of Kee-Satt. However, it appears that the young miner is experiencing difficulties of some description, and Horthur asks that you inquire as to what they might be.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","With the work at the Dragging Tail being left to the other miners, Kee-Satt is able to concentrate on the task of using the rutabite they have discovered to produce the alloy Nabaathium. It was only when he attempted to replicate the process detailed on the ancient scroll that he realized one particular vital piece of information was written in a cryptic fashion, perhaps deliberately, to prevent outsiders from learning the secrets of the Nabaath. Kee-Satt decides to seek out large pieces of genuine Nabaathium to compare with the ingots that he produced during the course of his experiments. You suggest visiting Mord Souq to seek the assistance of Ghun Gun, who has a keen interest in ancient history.","You find Kee-Satt near one of the less frequently used entrances to Mord Souq. As Ghun Gun is wont to travel far and wide in search of artifacts, you decide to ask his father Ghen Gen where he may be found.","Ghen Gen is pleased to make Kee-Satt's acquaintance and is excited to hear of his plans to produce Nabaathium. He implies that although you have come to seek the aid of Ghun Gun, you may in turn be able to help his son in some way. Opting to hear what this entails straight from the proverbial horse's mouth, you and Kee-Satt make your way towards the northern windmill where the young Mord is discussing ancient history with his mentor, Jamial.","Ghun Gun and Jamial both give you a warm welcome and extend the hand of friendship to Kee-Satt, who they quickly come to view as a kindred spirit. After hearing of his dream of reproducing Nabaathium, Ghun Gun explains that the windmill's axle is in fact made from the very same metal, and after having been in use for over a hundred years, is in dire need of replacement. In exchange for their assistance in researching the alloy, Kee-Satt agrees to provide a new axle once his methods have been perfected. After a closer observation, he comes to the conclusion that the amounts of each ingredient listed on his scroll were most likely false, with the correct information being passed on verbally. Although he has no such source at his disposal, Kee-Satt now has an authentic piece of Nabaathium to use as a point of reference. He resolves to go return to his process of trial and error, confident that it is only a matter of time before he is able to replicate the alloy. The three thank you for uniting them under a common cause, and you prepare to return to Twine to report the good news to Horthur.","Horthur is glad to hear that Kee-Satt has taken another step towards realizing his dream. He has high hopes for the lad and believes that when his name is inscribed in the pages of history, yours will be right there beside it."],"objectives":["Speak with Kee-Satt.","Speak with Kee-Satt in Mord Souq.","Speak with Ghen Gen.","Speak with Ghun Gun.","Report to Horthur."],"dialogue":[{"name":"HORTHUR","text":"Have you spoken to Kee-Satt lately?"},{"name":"HORTHUR","text":"From what I hear, his work in the Dragging Tail is proceeding apace, but it seems he's run into a problem of some sort."},{"name":"HORTHUR","text":"While I'd like to think he can handle whatever it is by himself, he might benefit from your advice."},{"name":"HORTHUR","text":"I can barely believe how much Kee-Satt has changed. Finding that rutabite was the spark that lit a fire in his belly!"},{"name":"KEESATT","text":"Ah, <span class=\"highlight\">Forename</span>! How goes it?"},{"name":"KEESATT","text":"Problem? Yes, you could say that."},{"name":"KEESATT","text":"You see, work to excavate the collapsed tunnel is underway and we're already digging up substantial amounts of rutabite. Now I'm able to turn my attention to producing Nabaathium, and it's tricky to say the least."},{"name":"KEESATT","text":"Although I've made a few attempts, the alloy is always far too brittle. I thought I'd figured out the instructions on that old scroll, but there's one point that I still can't make sense of."},{"name":"KEESATT","text":"It's too vague, you see. Something about “trusting your ears, not your eyes.”"},{"name":"KEESATT","text":"My guess is that they deliberately made it impossible to understand, to avoid having people outside of Nabaath Areng from stealing their secrets. They probably relied on spoken word to pass the missing information from one generation to the next."},{"name":"KEESATT","text":"Obviously, there's nobody from ancient Nabaath around to ask, so I'll have to work it out myself by looking closely at real Nabaathium."},{"name":"KEESATT","text":"I need something large, so that I can see how it differs to the ingots I've made. The scavengers dig up a lot of trinkets and whatnot, but they're too small to be of any use, not to mention expensive. Does anything spring to mind?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You should ask the Mord."},{"name":"A1","text":"I know someone who is learning about the history of Nabaath Areng."},{"name":"KEESATT","text":"They're forever rooting about in the ruins, so if anyone could help me, it would be them. But who should we ask?"},{"name":"KEESATT","text":"And he's being taught by a descendant of Nabaath royalty? What is his name?"},{"name":"KEESATT","text":"Ghun Gun? I can't say I've ever met him, so I'd be grateful if you could introduce us."},{"name":"KEESATT","text":"Much appreciated! I'll go through the Dragging Tail and meet you in Mord Souq."},{"name":"KEESATT","text":"Gods be good... Some shortcut that turned out to be! I damn near brained myself when I fell from that net. Oh well, onwards and upwards! Where's that Ghun Gun fellow you mentioned?"},{"name":"KEESATT","text":"Roves around a lot, eh? In that case, I think we should ask his father where he might be. You said his name is Ghen Gen, yes?"},{"name":"KEESATT","text":"I have to admit, I find these Mord names a little hard to remember. Perhaps they'd say the same about those of the Mystel!"},{"name":"GHENGEN","text":"Who is this? A friend of yours is a friend of mine!"},{"name":"GHENGEN","text":"Metal from old Nabaath... Yes, Ghun Gun and Jamial would be the best ones to ask, methinks. And perhaps you can help them in return!"},{"name":"KEESATT","text":"Hmm? With what?"},{"name":"GHENGEN","text":"A problem, a predicament! He should still be by the north windmill with Jamial. Talking about ancient history, no doubt!"},{"name":"KEESATT","text":"Ah... Thank you. I look forward to meeting them."},{"name":"KEESATT","text":"Help them, eh? I suppose we'll soon find out what he meant by that. Come on, let's go and see Ghun Gun."},{"name":"GHENGEN","text":"The windmill in the north of the souq, it is! Not the one in Our Ladies' Hands!"},{"name":"JAMIAL","text":"Greetings, <span class=\"highlight\">Forename</span>. I hope this <span class=\"alternative-container\"><span class=\"alternative\">eve</span><span class=\"alternative\">morn</span><span class=\"alternative\">day</span></span> finds you well."},{"name":"KEESATT","text":"So, this must be Ghun Gun, son of Ghen Gen. I can certainly see the family resemblance."},{"name":"GHUNGUN","text":"Ah, <span class=\"highlight\">Forename</span>! What brings you to Mord Souq?"},{"name":"GHUNGUN","text":"Researching Nabaathium!? Lucky for me, yes! Lucky for Mord Souq, too!"},{"name":"KEESATT","text":"Yes, your father mentioned we might be able to assist you, though I still don't have the foggiest clue how."},{"name":"JAMIAL","text":"He is referring to the windmill. It has been making a rather odd grating sound these past few days. Though we have tried to rectify it with oils and such, we fear the problem may be far more deep-rooted."},{"name":"GHUNGUN","text":"After a lot of searching in ruins, we found the construction plans! Made before the Flood by the Nabaath as a symbol of friendship, it was. Very interesting design, too."},{"name":"JAMIAL","text":"Using that information, we have narrowed down the cause of the grating to the central axle, which is made from Nabaathium."},{"name":"JAMIAL","text":"I never realized it could be used in something of this scale! Come to think of it, its resistance to friction makes it an ideal choice for moving parts like this."},{"name":"GHUNGUN","text":"But even Nabaathium has its limits! This windmill has been turning for over a hundred years, and as far as we can tell, this is the original axle. Never been changed!"},{"name":"KEESATT","text":"So you want to replace it, but lack the means to produce the alloy."},{"name":"GHUNGUN","text":"Exactly, exactly!"},{"name":"JAMIAL","text":"Since you are looking for large pieces of Nabaathium, perhaps you would like to inspect the windmill."},{"name":"KEESATT","text":"Absolutely!"},{"name":"GHUNGUN","text":"Best to see it from inside. Follow me!"},{"name":"GHUNGUN","text":"Answer your questions, did it?"},{"name":"KEESATT","text":"I never noticed it before, but genuine Nabaathium has more of a blue tinge than any of the trial ingots I've produced."},{"name":"KEESATT","text":"That probably means the ratios listed on the scroll are false. “Trust your ears, not your eyes.” In other words, that was a diversion, and the true amounts were communicated verbally."},{"name":"KEESATT","text":"Since there's no one around to tell me, I'll have to experiment with varying amounts. Maybe I should use less rutabite and more tin..."},{"name":"KEESATT","text":"It will take a lot of trial and error, but now that I have something to compare it to, I'll soon work it out."},{"name":"JAMIAL","text":"And once you have, we will finally be able to fit the windmill with a new axle."},{"name":"GHUNGUN","text":"Why stop there? Nabaathium has the potential to attract merchants from across Norvrandt! After all, selling their alloy is one of the ways Nabaath Areng became so wealthy, so powerful!"},{"name":"GHUNGUN","text":"I can already smell the jinglies!"},{"name":"KEESATT","text":"I like the sound of that! Though, truth be told, I'll be content to have played my part in bringing Nabaathium to the people of Amh Araeng. Still, a few extra gil in my pocket wouldn't hurt!"},{"name":"GHUNGUN","text":"Do not forget, there is still much work to be done! And the windmill comes first, yes?"},{"name":"KEESATT","text":"Of course! But before we get too carried away, I must thank <span class=\"highlight\">Forename</span> for introducing us."},{"name":"GHUNGUN","text":"Yes! I too am very grateful. It is good to know that people outside of Mord Souq share our interest in Nabaath Areng!"},{"name":"JAMIAL","text":"In time, I am sure the bond between Twine and Mord Souq will grow even stronger."},{"name":"KEESATT","text":"Yes, and making the route between the two less perilous would be another worthwhile project. I'll have my hands full trying to reproduce Nabaathium for the time being, though."},{"name":"KEESATT","text":"Oh, if you're passing through Twine, would you mind letting Horthur know how things went?"},{"name":"KEESATT","text":"Many thanks, <span class=\"highlight\">Forename</span>! Until next time!"},{"name":"HORTHUR","text":"You've been gone a while. How did it go with Kee-Satt?"},{"name":"HORTHUR","text":"He's making quite the name for himself. If it ever finds its way into the history books, yours will be right there beside it."},{"name":"HORTHUR","text":"Though your path may lead you far from Twine, we will always remember you as one who made a difference in this little mining town."}],"reward":{"gil":1014,"items":[{"num":2,"id":27866,"one":1},{"num":2,"id":27867,"one":1},{"num":2,"id":27868,"one":1},{"num":2,"id":27869,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68914,69064]}},"partials":[{"type":"npc","id":"1030419","obj":{"i":1030419,"n":"Horthur","l":2955,"q":2}},{"type":"item","id":"27866","obj":{"i":27866,"n":"Sausage Links","l":409,"c":24365,"t":46,"p":3595}},{"type":"item","id":"27867","obj":{"i":27867,"n":"Roast Ovim","l":409,"c":24361,"t":46}},{"type":"item","id":"27868","obj":{"i":27868,"n":"Mushroom Skewer","l":409,"c":24201,"t":46,"p":3595}},{"type":"item","id":"27869","obj":{"i":27869,"n":"Baked Megapiranha","l":409,"c":24311,"t":46,"p":3595}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68914","obj":{"i":68914,"n":"Semi Auto-malik","g":115,"l":"Amh Araeng","s":1413}},{"type":"quest","id":"69064","obj":{"i":69064,"n":"The Rutabite at the End of the Tunnel","g":115,"l":"Amh Araeng","s":7060}}]}