{"quest":{"name":"A Vein Pursuit","location":"Amh Araeng","id":69061,"patch":5.0,"sort":7030,"icon":100860,"unlocksFunction":1,"eventIcon":71341,"issuer":1030419,"target":1030718,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Horthur is concerned about one of his fellow miners.","Horthur, one of the leading figures among the miners of Twine, is worried about Kee-Satt, the sole Mystel member of the community. He claims that not only is the young man surly and uncommunicative, but that he also refuses to dig in the same locations as his colleagues, instead opting for those that have little chance of yielding anything of value. Horthur senses that as Kee-Satt is unwilling to confide in any of his peers, he may be more likely to share his troubles with an outsider such as yourself.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Kee-Satt turns out to be far more talkative than you were led to believe, and once he starts, it is as if the floodgates have been opened. He tells you of his dream to revive the methods once used in Nabaath Areng to produce a versatile alloy known as Nabaathium. However, one essential piece of the puzzle is yet to be found: the elusive ore known as rutabite. Kee-Satt has been searching for a vein for quite some time, though he is reluctant to turn to his Ronso peers for help because of their prejudiced views on Mystel. He is determined to prove himself as a skilled miner, despite their claims otherwise, and he asks you to accompany him to Nuvy's Leavings and act as witness to the moment he finally discovers rutabite.","You find Kee-Satt attempting, largely unsuccessfully, to defend himself from a beast that has wandered into this section of the mines. Leaping to his aid, you put down the fiend without so much as breaking a sweat.","Kee-Satt is extremely grateful for your timely arrival and is impressed by the ease with which you disposed of such a vicious creature. Now that the shaking in his hands has subsided and he is once again able to hold a pickaxe, he can continue digging for rutabite."],"objectives":["Speak with Kee-Satt.","Follow Kee-Satt into Nuvy's Leavings.","Aid Kee-Satt."],"dialogue":[{"name":"HORTHUR","text":"Say, perhaps you could help me?"},{"name":"HORTHUR","text":"As you've no doubt noticed, most of Twine's miners are Ronso. There's a Mystel lad, though. The only one of his kind in the whole town."},{"name":"HORTHUR","text":"His name's Kee-Satt. A bit of a loner. Always digging by himself in places where you'll be lucky to find a few lumps of coal, never mind gems and such."},{"name":"HORTHUR","text":"I often ask him why he doesn't mine the same spots as the rest of us, but he never gives me a proper answer. I daresay he would be more inclined to speak with an outsider, though."},{"name":"HORTHUR","text":"If you could get the truth out of him, and see if anything is the matter, it would put my mind at ease."},{"name":"HORTHUR","text":"Kee-Satt hardly speaks to anyone, and when he does, it's usually only when it's absolutely necessary."},{"name":"KEESATT","text":"A traveler, eh? What do you want with me?"},{"name":"KEESATT","text":"\"Lucky to find a couple of lumps of coal.“ Is that what he said? Hmph! Shows how much <span class=\"emphasis\">he</span> knows!"},{"name":"KEESATT","text":"You, on the other hand, might be a better audience for my master plan. Have you ever heard of an alloy called Nabaathium? It's strong, light, and resistant to heat and friction."},{"name":"KEESATT","text":"It was one of the most valuable metals in Nabaath Areng and a lot of their jewelry was made from the stuff. The trouble is, the techniques for mixing the alloy were lost to the Flood."},{"name":"KEESATT","text":"I've been looking for a way to make my own, and my search led me to a scroll that explains the methods, right down to the last detail."},{"name":"KEESATT","text":"After having a historian decipher it, I learned that I lacked one vital ingredient─rutabite. And that is what I am digging for."},{"name":"KEESATT","text":"Short of venturing into the Empty, my next best option is to look for a vein here in Amh Araeng."},{"name":"KEESATT","text":"Of course, I'd stand a much better chance of finding one if I had help, but I'd rather not have to rely on anyone from around here."},{"name":"KEESATT","text":"Some of the Ronso miners take exception to the fact I'm Mystel. They seem to think we're not built for this kind of work."},{"name":"KEESATT","text":"When I find that rutabite, they'll see how wrong they are."},{"name":"KEESATT","text":"Hmph. You know, this is the first time I've said more than about two words to anyone in a while. And I feel better for getting that off my chest."},{"name":"KEESATT","text":"This might be a bit sudden, but I have an idea. How would you like to see the moment I finally unearth that vein of ore?"},{"name":"KEESATT","text":"Well, what I really mean is that I need someone there to act as a witness. Otherwise, the others might think I bought a lump of it from somewhere─ ludicrously expensive as it is─and am pretending to have dug it up myself. Will you do me this favor?"},{"name":"KEESATT","text":"You will? Thank you! Luckily, I've found the perfect spot for my next dig. If my miner's hunch is correct, the ore should be waiting just below the surface."},{"name":"KEESATT","text":"It's in Nuvy's Leavings, so I'll wait for you there!"},{"name":"HORTHUR","text":"So, he told you what's been bothering him? That's good. It's not my place to pry, but I'm glad he found someone to share his troubles with."},{"name":"KEESATT","text":"Phew! I'm glad that's over. How am I supposed to concentrate on my work with all of these creatures disturbing me!?"},{"name":"KEESATT","text":"You certainly know how to handle yourself, though. That fiend never stood a chance!"},{"name":"KEESATT","text":"But I dread to think what would've happened if you hadn't shown up. Hopefully nothing else will try to get between me and my dream. Many thanks, my friend!"}],"reward":{"gil":715,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69153]},"next":[69062]},"partials":[{"type":"npc","id":"1030419","obj":{"i":1030419,"n":"Horthur","l":2955,"q":2}},{"type":"npc","id":"1030718","obj":{"i":1030718,"n":"Kee-Satt","l":2955,"q":2}},{"type":"quest","id":"69153","obj":{"i":69153,"n":"A Dirty Job","g":8,"l":"Amh Araeng","s":760}},{"type":"quest","id":"69062","obj":{"i":69062,"n":"Tunnel Vision","g":115,"l":"Amh Araeng","s":7040}}]}