{"quest":{"name":"Thy Well Be Done","location":"Amh Araeng","id":69067,"patch":5.0,"sort":7010,"eventIcon":71221,"issuer":1030957,"target":1030957,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The intrepid miner has his eye on the disused facilities of Malikah's Well."],"objectives":["Inspect the disused machinery.","Report to the intrepid miner."],"dialogue":[{"name":"MINER03531","text":"I've seen you before. Part of the group that went into Malikah's Well, right?"},{"name":"MINER03531","text":"Thought so. Thanks to you lot getting rid of the sin eaters around here, there's a chance we might be able to put these remnants of Nabaath Areng to good use. "},{"name":"MINER03531","text":"The well was originally dug under the orders of some malikah or the other, I forget which. She used cool water from underground to keep off the desert heat."},{"name":"MINER03531","text":"Years later, when the mining industry hit its stride, the need for water in the ore washing process led to its expansion. But as you can tell, it's been in a state of disrepair for years now."},{"name":"MINER03531","text":"Still, we'd be fools to let the well go to waste, so I'm looking into getting the old machinery working again. Some of it's a bit tricky to get to, though, and I could do with a hand. So, fancy earning a few gil?"},{"name":"MINER03531","text":"I need you to inspect the lift for carrying workers and the giant pulley for drawing up water. I'd like to know if they can still be used or if they're rusted to buggery."},{"name":"MINER03531","text":"What's the matter? Not scared of heights are you?"},{"name":"SYSTEM","text":"Although some of the less important parts are in need of replacement, the mechanism itself appears to be in good condition."},{"name":"MINER03531","text":"Hmm... It sounds like it won't take much to have them in working order. When I share the good news with the folk in Twine, I'm sure they'll send a few laborers to help with the repairs."},{"name":"MINER03531","text":"Getting Malikah's Well producing water again will be a good start, but we'll need the Talos up and running to have any chance of reviving the mining industry in these parts."},{"name":"MINER03531","text":"We'd best take it one step at a time, though. And you helping me here was one such step. Your reward, as promised."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69157]}},"partials":[{"type":"npc","id":"1030957","obj":{"i":1030957,"n":"Intrepid Miner","l":2955,"q":1}},{"type":"quest","id":"69157","obj":{"i":69157,"n":"A Fresh Start","g":8,"l":"Amh Araeng","s":800}}]}