{"quest":{"name":"Tunnel Vision","location":"Amh Araeng","id":69062,"patch":5.0,"sort":7040,"icon":100860,"eventIcon":71221,"issuer":1030718,"target":1030719,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kee-Satt is ready to swing his pickaxe in the hopes of finding rutabite.","Kee-Satt's attempt to unearth rutabite ends in bitter failure. His Ronso rivals appear just as he admits defeat to─figuratively speaking─kick the man while he is down, and his earlier claims that they hold bigoted opinions of Mystel are substantiated when they cruelly mock him. This, however, only serves to spur him on, and with renewed vigor, he proposes moving on to another site. Unfortunately, this one is said to be riddled with dangerous cave dwellers, and he requests that you watch over him as he digs for ore.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Proceeding further into the mine, Kee-Satt sets his sights on a spot where he feels he stands a fair chance of finding rutabite. You take position some distance away, in anticipation of any creatures that would interfere with the young miner's work.","As expected, it was only a matter of time before bloodthirsty brutes make their presence known. Once again, you keep Kee-Satt from danger, while he continues to be utterly absorbed in chipping away at the rock.","Kee-Satt barely noticed the intrusion of the creatures you slew, though he was able to hear the sounds of battle above the crashing of pickaxe against stone. Thankfully, it appears that the journey into the depths of Nuvy's Leavings was not wasted, and he beams with delight when telling you what he has discovered. The ore he holds in his hands certainly has the color of ripe dates, or rutab, as he had described, although he will need an expert's evaluation to determine whether it is the prize he seeks."],"objectives":["Speak with Kee-Satt.","Stand watch at the specified location and defeat any enemies that appear.","Speak with Kee-Satt."],"dialogue":[{"name":"KEESATT","text":"It's time to continue digging for rutabite. In case you were wondering, “rutab” is another name for a ripe date, and the ore has a similar color and sheen to it. Of course, you'll be seeing it for yourself soon enough!"},{"name":"KEESATT","text":"I don't believe it... And I was so sure."},{"name":"KEESATT","text":"There's only one other place I can think of, but I'd be a fool to go there alone..."},{"name":"RONSOMINER03530","text":"Found any good pebbles? Or maybe a bit of cave moss?"},{"name":"KEESATT","text":"Piss off! I'm not in the bloody mood!"},{"name":"RONSOMINER03530","text":"Temper, temper! Perhaps the mines aren't the place for a Mystel like you. Why don't you go and join the rest of your kind in Kholusia? You've embarrassed yourself enough as it is."},{"name":"RONSOMINER03530","text":"(-Ronso Miners-)Hur hur hur!"},{"name":"KEESATT","text":"What a bunch of pricks."},{"name":"KEESATT","text":"It's the same bigoted nonsense, day in, day out. Anyway, I'm sorry you had to see that."},{"name":"KEESATT","text":"Nnngh! I've had it to the back teeth with them! They're always harping on about how the best miners are all Ronso, and how none of the other races can compete, particularly the Mystel."},{"name":"KEESATT","text":"It probably has something to do with the fact that most of the Talos masters were Mystel, and the whole of Amh Araeng fell into the doldrums after they left."},{"name":"KEESATT","text":"Of course, only a half-wit would hold a grudge against an entire race because of the actions of a few individuals. But I'm not prepared to just take it on the chin. When I make a killing from the rutabite I find, that'll wipe those smug grins off their faces!"},{"name":"KEESATT","text":"There's one more place I'd like to try. It'll probably be lousy with vicious creatures, but if that's what it takes, so be it!"},{"name":"KEESATT","text":"I could do with someone to watch my back while I'm digging, though. Since you so handily disposed of the last thing that tried to eat me, perhaps you wouldn't mind coming along?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Dank caverns full of flesh-eating horrors? Count me in!"},{"name":"A1","text":"Fine. Let's get this over with."},{"name":"KEESATT","text":"If all goes according to plan, we won't be there for long."},{"name":"KEESATT","text":"Fame and fortune, here I come!"},{"name":"KEESATT","text":"All right, it's time to get to work."},{"name":"KEESATT","text":"If you keep watch over there, I'll get on with the digging."},{"name":"KEESATT","text":"So far, so good! I haven't actually found anything yet, but I have a feeling I'll come across the ore soon!"},{"name":"KEESATT","text":"Well, that sounded like quite the tussle! Thank you for saving me from whatever manner of ghastly cave dweller that was!"},{"name":"KEESATT","text":"Best of all, I think I've finally found what I've been looking for. It's a bit too dark in here to tell whether this is really rutabite, but it seems to be the right color."},{"name":"KEESATT","text":"I'd best have an expert take a look at it, since I've never seen the real thing before. Until then, I'll try not to get my hopes up."}],"reward":{"gil":715},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69061]},"next":[69063]},"partials":[{"type":"npc","id":"1030718","obj":{"i":1030718,"n":"Kee-Satt","l":2955,"q":2}},{"type":"npc","id":"1030719","obj":{"i":1030719,"n":"Kee-Satt","l":2955,"q":2}},{"type":"quest","id":"69061","obj":{"i":69061,"n":"A Vein Pursuit","g":115,"l":"Amh Araeng","s":7030,"f":1}},{"type":"quest","id":"69063","obj":{"i":69063,"n":"Two Tails Are Better than One","g":115,"l":"Amh Araeng","s":7050}}]}