{"quest":{"name":"Of Legacies Lost and Reclaimed","location":"Eulmore","id":69060,"patch":5.0,"sort":7280,"eventIcon":71221,"issuer":1030472,"target":1030472,"genre":112,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The debonair dame has lost something of great import."],"objectives":["Search for the missing jewelry.","Return the jewelry to the debonair dame."],"dialogue":[{"name":"LADY03524","text":"Pardon the imposition, but I am in desperate need of your assistance. I lost several pieces of jewelry that are ever so dear to my heart in the commotion, and I've been quite unable to locate them."},{"name":"LADY03524","text":"I am searching for a tiara emblazoned with my house's crest, an engraved necklace, and an amethyst ring. As you might guess, each is a family heirloom."},{"name":"LADY03524","text":"I know not where I dropped them, out of my wits as I was at the time, but they cannot have vanished into thin air. They must be in the city somewhere, if only I had the faintest inkling of where to look..."},{"name":"LADY03524","text":"Please, might I beg your help? I would give anything to have them safely returned to me."},{"name":"LADY03524","text":"I apologize that I have no clearer idea of where I might have dropped them, but please, I need my heirlooms returned to me!"},{"name":"LADY03524","text":"Were you able to locate any of my heirlooms?"},{"name":"LADY03524","text":"Oh, my, you've found all three! There can be no mistake!"},{"name":"LADY03524","text":"“Seek but to serve” is inscribed here, you see? It was my family's motto long before we came to Eulmore. My grandmother taught me its meaning─that we ought always love others before ourselves, aid the poor and the downtrodden..."},{"name":"LADY03524","text":"And I see with clarity, now. It is <span class=\"emphasis\">that</span> spirit that those of us in Eulmore have been lacking, and which we must reclaim. Like my ancestors─like you─we must learn to care for others regardless of the benefit to ourselves."},{"name":"LADY03524","text":"I know not how I can possibly thank you enough for this, but please believe that you have my eternal gratitude."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69168]}},"partials":[{"type":"npc","id":"1030472","obj":{"i":1030472,"n":"Debonair Dame","l":2952,"q":1}},{"type":"quest","id":"69168","obj":{"i":69168,"n":"Paradise Fallen","g":8,"l":"Eulmore","s":840}}]}