{"quest":{"name":"The Crystal Knaves","location":"Amh Araeng","id":69068,"patch":5.0,"sort":7020,"eventIcon":71221,"issuer":1030958,"target":1030958,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The battle-ready Mord's prey has led him to Ladle."],"objectives":["Confront the crystal peddlers.","Report to the battle-ready Mord."],"dialogue":[{"name":"MOLDWARRIOR03532","text":"They will not escape me this time, oh no. Who? Criminals! They ignore Mord law and shame us all!"},{"name":"MOLDWARRIOR03532","text":"We must never take crystals from the Wall, for we believe that they can turn people into sin eaters. Even pieces that fall off are forbidden!"},{"name":"MOLDWARRIOR03532","text":"But those swindlers collect them, sell them! Of course, they do not tell their customers where the crystals come from, but I know their secret."},{"name":"MOLDWARRIOR03532","text":"That is why I am here, to bring them to justice. Breaking our code, selling under false pretenses. Very serious crimes!"},{"name":"MOLDWARRIOR03532","text":"I have tracked them this far and they will soon be mine! But there are too many to catch by myself and I dare not risk failure. Stranger, will you lend me your aid?"},{"name":"MOLDWARRIOR03532","text":"I will circle around from the west of the palace while you approach from the east. Like the jaws of a zonure snapping shut! Take them alive if possible, but if they resist, show no mercy, for you will get none from them. When it's over, meet me back here."},{"name":"MOLDCRIMINALA03532","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s seen too much! Kill <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"MOLDWARRIOR03532","text":"Heh. I take it that's not your blood? The ones I caught also refused to come quietly. Well, what is done is done. They got what they deserved for spitting on our code!"},{"name":"MOLDWARRIOR03532","text":"Whether the Wall's crystals have anything to do with sin eaters is not for me to say. What I do know is that without rules, without law, we are no better than beasts. Beasts, I tell you!"},{"name":"MOLDWARRIOR03532","text":"Ahem! Excuse me. Before we part ways, here is your reward for punishing the wicked."}],"reward":{"gil":606,"items":[{"num":2,"id":27872}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69157]}},"partials":[{"type":"npc","id":"1030958","obj":{"i":1030958,"n":"Battle-ready Mord","l":2955,"q":1}},{"type":"item","id":"27872","obj":{"i":27872,"n":"Masala Chai","l":412,"c":24410,"t":46}},{"type":"quest","id":"69157","obj":{"i":69157,"n":"A Fresh Start","g":8,"l":"Amh Araeng","s":800}}]}