{"quest":{"name":"No Disassemble","location":"Amh Araeng","id":69066,"patch":5.0,"sort":7001,"eventIcon":71221,"issuer":1030956,"target":1030956,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Talos enthusiast seems to recognize you from somewhere."],"objectives":["Use the steel lever to remove core housing components from the abandoned Talos.","Deliver the core housing components to the Talos enthusiast."],"dialogue":[{"name":"MINER03530","text":"I know you! You're one of the people who raised that enormous Talos!"},{"name":"MINER03530","text":"It was a day I'll never forget. To think that inside it was the core that Agna unearthed... It brought tears to my eyes."},{"name":"MINER03530","text":"And I wasn't alone. We were all reminded that she gave her life trying to bring Talos back to Amh Araeng. Many of us, myself included, wish to continue her work. Even without the Daedalus Stoneworks, we'll find a way."},{"name":"MINER03530","text":"Of course, there is a lot more to Talos than their cores. The parts that house them are equally important. We're collecting them for use in our tests, with the aim of eventually building our own from scratch."},{"name":"MINER03530","text":"Perhaps you could lend us a hand, if you're not too busy. With these old Stoneworks tools, you should be able to open one up and take out the housing components inside. We'd be grateful for anything you can bring us!"},{"name":"MINER03530","text":"The Daedalus Stoneworks did a remarkable job of building their Talos. Even now, years after they were abandoned, they're a bugger to take apart without the right tools."},{"name":"MINER03530","text":"Find anything?"},{"name":"MINER03530","text":"Ho ho! You don't see many like these! And this one shows almost no signs of wear and tear at all. I can't wait to show the others!"},{"name":"MINER03530","text":"Of course, we still have a long way to go before we can build our very own Talos, but you've been an enormous help. Many thanks!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69157]}},"partials":[{"type":"npc","id":"1030956","obj":{"i":1030956,"n":"Talos Enthusiast","l":2955,"q":1}},{"type":"quest","id":"69157","obj":{"i":69157,"n":"A Fresh Start","g":8,"l":"Amh Araeng","s":800}}]}