{"quest":{"name":"Two Tails Are Better than One","location":"Amh Araeng","id":69063,"patch":5.0,"sort":7050,"icon":100860,"eventIcon":71221,"issuer":1030719,"target":1030723,"genre":115,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kee-Satt needs an expert to inspect the fruits of his labor.","Kee-Satt has discovered a large lump of ore he believes to be rutabite. However, the darkness of the mine and lack of proper testing apparatus mean you will need to return to Twine to have the mineral inspected to determine whether it is indeed the object of your search.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Looking thoroughly dejected, Kee-Satt regretfully informs you that while the ore is in fact rutabite, it contains too many impurities to be used in the creation of Nabaathium. He has all but abandoned his dream of recreating the lost alloy of Nabaath Areng, though a few words and emphatic gestures of encouragement may /rally his spirits.","After you help Kee-Satt pull himself out of the doldrums, he begins to think objectively about how best to achieve his aims. Realizing that he lacks reliable information, he decides to ask Horthur whether he knows of any locations where rutabite may be found. However, Kee-Satt has never been on particularly good terms with the senior miner, so he requests that you approach Horthur first in order to better facilitate the conversation.","Kee-Satt's attempts to remain civil fall flat almost immediately, though thankfully this does little to faze Horthur. He patiently explains that since Twine was originally founded by Ronso and Mystel working in unison, it is important that the two races should not let their differences divide them. When the subject of rutabite is raised, he shares a tale of a mine in the Dragging Tail said to have collapsed over a hundred years ago, where the elusive ore was once found in abundance. Kee-Satt, with renewed determination, asks you to meet him outside of the settlement, from where you will begin the journey to the lost mine.","Kee-Satt displays some degree of contrition for his ignorance of Twine's history and his ancestors' role in its founding. He also concedes that in trying to outshine his Ronso rivals, he has been blindly digging away wherever his hunches take him, with little regard for proper research. Eager to chase the lead provided by Horthur, Kee-Satt prepares to venture into the inner reaches of the Dragging Tail."],"objectives":["Speak with Kee-Satt.","/rally Kee-Satt's spirits.","Speak with Horthur.","Speak with Kee-Satt."],"dialogue":[{"name":"KEESATT","text":"There's not much point standing around here, so let's head back to Twine and get this ore looked at."},{"name":"KEESATT","text":"Of course, it takes more than a glance with the naked eye to tell if it's rutabite or not. There are all sorts of tests that need to be carried out."},{"name":"KEESATT","text":"I'll go on ahead. It might take a while, so come and find me in Twine a little later on."},{"name":"KEESATT","text":"Well, there's good news and bad news."},{"name":"KEESATT","text":"The good news is, it's definitely rutabite."},{"name":"KEESATT","text":"The bad news is, there are far too many impurities. I won't be making any Nabaathium from this, that much is certain. It's also highly unlikely that anything mined there will be of better quality."},{"name":"KEESATT","text":"&lt;sigh&gt; I'm sorry that I dragged you all the way into the mines for something so disappointing."},{"name":"KEESATT","text":"This is hardly the historic moment I'd envisioned. I think it's time to accept that there is no vein of pure rutabite, that I'm chasing something that was never there to begin with."},{"name":"SYSTEM","text":"Kee-Satt has lost sight of his dream. Perhaps he needs someone to <span class=\"highlight\">rally</span> his spirits."},{"name":"KEESATT","text":"If the vein ever did exist, I expect someone else would've found it already. A better miner than me..."},{"name":"SYSTEM","text":"Kee-Satt has lost sight of his dream. Perhaps he needs someone to <span class=\"highlight\">rally</span> his spirits."},{"name":"KEESATT","text":"What are you doing? Oh, you're trying to cheer me up!"},{"name":"KEESATT","text":"Hmm... I suppose that I shouldn't give up because of a small setback like this."},{"name":"KEESATT","text":"Perhaps I need to rethink my approach. I'd have a much better chance of finding rutabite if I had a lead of some sort. But who should I ask?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Horthur springs to mind."},{"name":"A1","text":"You should speak with some of the other miners."},{"name":"KEESATT","text":"Yes, that might be worth a try. He's always treated me fairly, unlike most of the other Ronso around here."},{"name":"KEESATT","text":"Yes, a few of them seem to realize mining is about more than just swinging a pickaxe. Especially Horthur."},{"name":"KEESATT","text":"But I expect that he has the same opinion of Mystel as the rest of them."},{"name":"KEESATT","text":"What? Horthur is the reason you spoke to me in the first place? Hmm... Perhaps he's not so bad after all. But until now, I've always given him the cold shoulder, so I'll feel a bit of a fool asking for his help."},{"name":"KEESATT","text":"I'll just have to swallow my pride. I can't give up on my dream because I'm too stubborn to seek advice."},{"name":"KEESATT","text":"Umm... The trouble is, I don't have much of a rapport with him, so maybe you could speak with him first? Just so that it's not completely out of the blue."},{"name":"KEESATT","text":"Thanks. I think I see him over there now."},{"name":"KEESATT","text":"After being treated like dirt by the other Ronso, I thought he'd be the same as the rest. I hope he proves me wrong."},{"name":"HORTHUR","text":"Ah, it's good to see the two of you getting along."},{"name":"KEESATT","text":"What's that supposed to mean?"},{"name":"HORTHUR","text":"It makes a change from seeing you moping around by yourself, is all. Now, what can I do for the pair of you?"},{"name":"HORTHUR","text":"Rutabite, eh? It's been a while since I heard that word. I've never come across a vein myself, but I know of a place that might be worth a look."},{"name":"KEESATT","text":"You do!? Where!?"},{"name":"HORTHUR","text":"My grandsire once spoke of a mine where a disastrous cave-in occurred over a hundred years ago."},{"name":"HORTHUR","text":"There would probably have been an attempt to reopen it were it not for the Flood, and it ended up being abandoned. But if the stories I heard are true, there is a vein of rutabite buried under all that rubble."},{"name":"KEESATT","text":"That's quite the tale. I'm sure your Ronso brethren would be less than pleased with you imparting all of this knowledge to a Mystel, though."},{"name":"HORTHUR","text":"Do you know why this town is called Twine? It comes from the idea of two tails entwined, one of the Ronso, the other of the Mystel."},{"name":"HORTHUR","text":"Quite a clever name, don't you think? Both races worked together to build this place, though some of you younglings seem to have forgotten this."},{"name":"HORTHUR","text":"Kee-Satt, as the last remaining Mystel in Twine, you have an important role to play in the future of this settlement."},{"name":"HORTHUR","text":"But first things first. You have a rutabite vein to find. Go through the Dragging Tail and take the first left. But be warned─those tunnels are extremely dangerous, and there is a high risk of collapse."},{"name":"KEESATT","text":"Thank you, Horthur."},{"name":"KEESATT","text":"If it's not too much to ask, I'd like you to watch my back again. I'll wait for you outside."},{"name":"HORTHUR","text":"His heart's in the right place. He just needs guidance."},{"name":"KEESATT","text":"That was the first I'd heard of the Ronso and Mystel founding Twine together. Probably because I'd never bothered to learn more about our history."},{"name":"KEESATT","text":"This whole time, I've been trying to outdo those Ronso louts, thinking that I'd eventually find a rutabite vein through sheer determination."},{"name":"KEESATT","text":"Of course, mining's not that simple. Knowing where to dig is everything."},{"name":"KEESATT","text":"Speaking of which, let's see where Horthur's trail leads us."}],"reward":{"gil":941},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69062]},"next":[69064]},"partials":[{"type":"npc","id":"1030719","obj":{"i":1030719,"n":"Kee-Satt","l":2955,"q":2}},{"type":"npc","id":"1030723","obj":{"i":1030723,"n":"Kee-Satt","l":2955,"q":2}},{"type":"quest","id":"69062","obj":{"i":69062,"n":"Tunnel Vision","g":115,"l":"Amh Araeng","s":7040}},{"type":"quest","id":"69064","obj":{"i":69064,"n":"The Rutabite at the End of the Tunnel","g":115,"l":"Amh Araeng","s":7060}}]}