{"quest":{"name":"Fresh Off the Wing","location":"Kholusia","id":69078,"patch":5.0,"sort":8050,"eventIcon":71221,"issuer":1027304,"target":1027304,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Bie-Zumm looks at you with an appraising eye."],"objectives":["Obtain cliffkite wings from cliffkites.","Deliver the cliffkite wings to Bie-Zumm."],"dialogue":[{"name":"BIEZUMM","text":"...They say you're the reason the Ladder's moving again─that you're a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who gets things done."},{"name":"BIEZUMM","text":"Well I've got a job that no one else around here seems capable of doing. All I want are some crystal spikes from the wings of those cliffkites─and not the old broken ones someone scavenged off the ground!"},{"name":"BIEZUMM","text":"If you can manage to bring me some wings with the spikes intact, I'll be sure to pay you what they're worth."},{"name":"BIEZUMM","text":"You want to make some coin? Just bring me some cliffkite wings with the crystals still attached."},{"name":"BIEZUMM","text":"Right, what have you got there for me?"},{"name":"BIEZUMM","text":"Hmmm. Nice length... No cracks or splintering... Aye, these'll make the perfect spearheads."},{"name":"BIEZUMM","text":"As I'm sure you've heard, Amity was originally built as a neutral venue for trading with the dwarf clans. The houses weren't meant to be homes─just somewhere to rest your head while you conducted your business."},{"name":"BIEZUMM","text":"Once those relationships soured, though, the settlement soon emptied out...and exiles like us moved in."},{"name":"BIEZUMM","text":"The way people talk, it sounds like Amity was thriving up until a few short years ago. But now instead of people lining the roads, you've got hobgoblins and worse. That's why I wanted to make spears, you know. For protection."},{"name":"BIEZUMM","text":"Well, that was a bit more long-winded than I intended, but a little history never hurt no one, eh? Alright, alright, take your payment and go, then."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69176]}},"partials":[{"type":"npc","id":"1027304","obj":{"i":1027304,"n":"Bie-Zumm","l":2954,"q":1}},{"type":"quest","id":"69176","obj":{"i":69176,"n":"Rich Veins of Hope","g":8,"l":"Kholusia","s":920}}]}