{"quest":{"name":"Rising to Her Apology","location":"Kholusia","id":69077,"patch":5.0,"sort":8070,"eventIcon":71221,"issuer":1030753,"target":1030750,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The well-dressed noblewoman wishes to make an apology."],"objectives":["Speak with the fearful fugitive.","Report to the well-dressed noblewoman.","Deliver the letter of contrition to the fearful fugitive."],"dialogue":[{"name":"MADAM03541","text":"Oh, I-I'm not here to cause trouble! I've simply come to pay a visit to one of Amity's residents."},{"name":"MADAM03541","text":"A former maidservant, in fact, to whom I owe a belated apology. But now that I've finally found her, I find myself beset with unease..."},{"name":"MADAM03541","text":"Before I approach, I need to know her state of mind─how does she feel now about Eulmore? About me? I would appreciate any insight that might better prepare me for what I must do..."},{"name":"MADAM03541","text":"Pray find my former maidservant, and ask for her thoughts on Eulmore. She's a young and pretty Hume girl, with hair the color of the palest rose..."},{"name":"FRIGHTENEDGIRL03541","text":"Hello again, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Was there something...?"},{"name":"FRIGHTENEDGIRL03541","text":"You...want to know how I feel about Eulmore and my former masters? I thought I made that quite clear the last time we met: the very mention of that place leaves me shaking in terror."},{"name":"FRIGHTENEDGIRL03541","text":"It is a terrible city filled with terrible people, who care for naught but indulging their basest instincts..."},{"name":"FRIGHTENEDGIRL03541","text":"Eulmore was a nightmare from which I've escaped in body only. I long for the day my mind is released from this fear..."},{"name":"MADAM03541","text":"And? What did she have to say of Eulmore...?"},{"name":"MADAM03541","text":"...Trembles at the very mention of it? Well, I suppose that is to be expected."},{"name":"MADAM03541","text":"'Tis all true. We lived in decadent abandon, seeking only to fulfill our whims and appetites. And when <span class=\"emphasis\">she</span> became the object of my husband's desires, a jealous rage consumed me. All I could think of was making her suffer..."},{"name":"MADAM03541","text":"With Lord Vauthry gone, 'tis almost as if a fog has lifted from my mind. How clearly I see now the awful person I had become."},{"name":"MADAM03541","text":"My husband, too, regrets his behavior. He has made his apologies...and it is time for me to make mine."},{"name":"MADAM03541","text":"...Yet it seems a sudden confrontation may be ill-advised."},{"name":"MADAM03541","text":"Anticipating such, I have penned a brief letter to explain my intentions. Pray deliver this to the girl─I shall be waiting at Top Rung."},{"name":"FRIGHTENEDGIRL03541","text":"A letter? For me?"},{"name":"FRIGHTENEDGIRL03541","text":"...Good gracious, this is from my old mistress!"},{"name":"FRIGHTENEDGIRL03541","text":"(-Letter of Contrition-)<span class=\"emphasis\">My dear girl, you served my husband and me with unrelenting diligence. And we repaid your efforts with vulgarity and violence, wounding you in heart and body alike.</span>"},{"name":"FRIGHTENEDGIRL03541","text":"(-Letter of Contrition-)<span class=\"emphasis\">I am deserving of your hatred. Of your fear. Words of apology can do little to salve the suffering I've caused, yet I would speak them nonetheless. I await your pleasure at Top Rung...</span>"},{"name":"FRIGHTENEDGIRL03541","text":"......"},{"name":"FRIGHTENEDGIRL03541","text":"Am I to believe she has changed so dramatically...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"She seemed sincere..."},{"name":"A1","text":"Vauthry's society brought out the worst in people..."},{"name":"FRIGHTENEDGIRL03541","text":"Hm. I'm not entirely convinced...but I will at least hear what she has to say."},{"name":"FRIGHTENEDGIRL03541","text":"Oh, and this is for you─her ladyship included a token of thanks for her “mediator.” I suppose I should be on my way..."}],"reward":{"gil":679},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69073]}},"partials":[{"type":"npc","id":"1030753","obj":{"i":1030753,"n":"Well-dressed Noblewoman","l":2954,"q":1}},{"type":"npc","id":"1030750","obj":{"i":1030750,"n":"Fearful Fugitive","l":2954,"q":1}},{"type":"quest","id":"69073","obj":{"i":69073,"n":"Fugitive of Fear","g":114,"l":"Kholusia","s":8060,"f":1}}]}