{"quest":{"name":"Resolve Regained","location":"Lakeland","id":69072,"patch":5.0,"sort":7130,"icon":100862,"eventIcon":71221,"issuer":1030684,"target":1030688,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Tolas would immediately depart in search of his missing friend.","Outside the bathhouse, you reunite with Tolas, who has promptly dressed himself in his full armor. The two of you decide to make for the road just outside Radisca's Round, where it is believed that Mauwyl's caravan was attacked. Hurry to your destination, and pray that the young woodcutter has not already come to harm.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Arriving at the scene of the ambush, you encounter a soldier who shares with you and Tolas the latest tidings regarding the search effort. It would appear that all the missing members have been found and led to safety, with the notable exception of Mauwyl, who remains unaccounted for. With time of the essence, Tolas suggests that you split up, that you might cover the most ground in your search efforts. The guardsman offers to search in the vicinity of Wolves of Shadow, and bids you sweep the southern edge of the forest for any signs of the young woodcutter.","Your search for Mauwyl has thus far proven less than fruitful, while a pair of nasty sin eaters' search for something to eat─namely, you─has proven more so. Fortunately, you are able to make quick work of your foe. The path clear, you resolve to continue to probe the forests for any sign of the missing woodcutter.","You have completed your search of the forest, but Mauwyl is nowhere to be found. You have no choice but to return to Radisca's Round and hope that Tolas's efforts have borne more fruit than your own.","As you are retracing your path back to Radisca's Round, you come upon a sight that is at once both startling and reassuring: Tolas standing over a vanquished sin eater with Mauwyl trembling by his side. It would appear that the guardsman came upon the woodcutter just as he was about to become dinner for the fiend, and succeeded in overcoming his demons to vanquish the foe and save the young man's life. Tolas explains that traveling and conversing with you have returned to him a measure of clarity and peace, freeing him from the paralyzing effects of his lingering fear and shame. Both men say their thanks, then set off for the Ostall Imperative, bidding you visit them there so that they might properly express their gratitude.","Back at the Imperative, Tolas and Mauwyl once again thank you for everything you have done on their behalf. The guardsman, especially, explains that it is because of you that he has rediscovered his sense of purpose and the will to fight. Mauwyl pays his respects and heads out to make a delivery, and Tolas prepares to return to his post, leaving you with an open invitation to visit him and his brothers-in-arms at the Imperative any time you like."],"objectives":["Speak with Tolas.","Search the forest for signs of Mauwyl.","Continue to search the forest for signs of Mauwyl.","Wait for Tolas at the designated location.","Speak with Tolas."],"dialogue":[{"name":"TOLAS","text":"I trust you are ready? We must depart at once. I only pray that we are not already too late."},{"name":"TOLAS","text":"Our man said the caravan was waylaid not long after departing from Radisca's Round, and that is where we will begin our search. Let us make our way there with all speed!"},{"name":"TOLAS","text":"It would seem that this was the site of the ambush."},{"name":"SOLDIER03536","text":"(-Crystarium Guardsman-)Ser Tolas! And could this be <span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span> <span class=\"highlight\">Surname</span>?"},{"name":"SOLDIER03536","text":"(-Crystarium Guardsman-)Tales of your valor in the battle against the sin eaters precede you. Full glad are we to have a hero such as you fighting for our cause."},{"name":"TOLAS","text":"Enough with the pleasantries! How fares the search effort!?"},{"name":"SOLDIER03536","text":"(-Crystarium Guardsman-)M-My apologies, Ser Tolas. We have found and led to safety all missing members of the caravan save one: the woodcutter Mauwyl."},{"name":"SOLDIER03536","text":"(-Crystarium Guardsman-)According to the survivors, the young man was forced to flee in the opposite direction from the rest of the group. His precise whereabouts, sadly, remain unknown."},{"name":"TOLAS","text":"Understood. The forest or the ruins nearby would seem the most logical destinations to hide and seek shelter. <span class=\"highlight\">Forename</span>, let us split up and cover as much ground as we are able."},{"name":"TOLAS","text":"I will make first for Wolves of Shadow. I leave the forest to you─I suggest you sweep it from the south. Let us meet back at Radisca's Round when we are through."},{"name":"SOLDIER03536","text":"(-Crystarium Guardsman-)And I will make for the Ostall Imperative and its vicinity, in the event that he has wandered his way there. Go in safety, my friends."},{"name":"SYSTEM","text":"A pair of sin eaters swoops down from the skies above!"},{"name":"SYSTEM","text":"You scan the surrounding forest, but spy nothing of note. There is naught to do but return to Radisca's Round and hope that Tolas has fared better in his search."},{"name":"TOLAS","text":"(-Tolas-)Stay back, fiend!"},{"name":"TOLAS","text":"&lt;pant&gt; &lt;pant&gt; Hah..."},{"name":"MAUWYL","text":"Tolas! And <span class=\"highlight\">Forename</span>!"},{"name":"MAUWYL","text":"I thought I was going to be that sin eater's dinner for sure! My friends, how can I ever thank you? "},{"name":"TOLAS","text":"Hmph. You are fortunate we found you when we did. Why in the gods' name did you allow yourself to be separated from your companions!?"},{"name":"MAUWYL","text":"I...I do not know. It all happened so fast. The others...are they okay?"},{"name":"TOLAS","text":"Worry not...they are fine. For better or for worse, <span class=\"emphasis\">you</span> were the only one to require your own private search party."},{"name":"MAUWYL","text":"Egads! I really <span class=\"emphasis\">am</span> sorry about that. Trouble has a way of finding me, even if I don't go searching for it..."},{"name":"MAUWYL","text":"But more importantly, look at you, Tolas! Swinging your blade like the brave warrior I've always known!"},{"name":"TOLAS","text":"Indeed. You can thank <span class=\"highlight\">Forename</span> here for that."},{"name":"TOLAS","text":"When the sin eaters came that day, I felt fear as I had never felt before. My pride as a warrior, the lives of the men under my command, all were consumed by a primal urge for survival."},{"name":"TOLAS","text":"And so on that day, faced with my greatest test, with the chance to truly do my ancestors proud, I shrank from the challenge rather than rising to it. And I have cursed myself every moment since."},{"name":"TOLAS","text":"What I would not give to have that day over again. If I had stood with my men on the front lines, served as their shield, how many lives could I have saved? That one thought grabbed hold of my mind, and would not release its grasp."},{"name":"TOLAS","text":"Since then, every time I faced an enemy, the image would appear in front of me. The image of me on that day, retreating to the rear as my men fought in vain against a horrible foe."},{"name":"TOLAS","text":"Every time I so much as grasped the hilt of my blade, it would all come flooding back. The sight of my men falling, the spatters of blood... And the screams...always the screams..."},{"name":"MAUWYL","text":"Tolas..."},{"name":"TOLAS","text":"The day may never come that I can fully forgive myself for my cowardice. But in talking to <span class=\"highlight\">Forename</span>, there is one thing I now understand."},{"name":"TOLAS","text":"If I allow myself to be haunted by the shame and the specters of that day, I will only repeat the mistakes of the past. No, I must overcome my grief and bitter regret─and fight on, for the sake of those I still might yet protect."},{"name":"TOLAS","text":"But I could not have accomplished that alone. No, I could not have accomplished it without you at my side, <span class=\"highlight\">Forename</span>."},{"name":"TOLAS","text":"As I watched you fighting beside me─with an unflinching sense of purpose, despite all the horrors you have seen─for the first time since the battle that day, my sword arm ceased trembling, and I felt a measure of peace."},{"name":"TOLAS","text":"You have done more for me than you will ever know. For this, I thank you."},{"name":"TOLAS","text":"There is more I would say, but that can wait for another time. Mauwyl, we should return to the Imperative─doubtless I was not the only one worried sick about you. You are more than welcome to join us, <span class=\"highlight\">Forename</span>, if there is not somewhere else you must be."},{"name":"TOLAS","text":"Very well, then. Let us be off!"},{"name":"MAUWYL","text":"Many thanks again, <span class=\"highlight\">Forename</span>! I very much hope to see you after."},{"name":"MAUWYL","text":"We had a few scares along the way, but all's well that ends well, yes? I certainly made the right call asking you for your aid!"},{"name":"TOLAS","text":"...<span class=\"highlight\">Forename</span>. Once again, allow me to express my most sincere gratitude for all you have done. Had you not come along when you did, I may very well have ended up dead before I ever regained the courage to fight."},{"name":"TOLAS","text":"There is one more thing I realized reflecting on the matter. In my all-consuming desire to prove my valor and do my family proud, I lost sight of the most important reason that I fight."},{"name":"TOLAS","text":"From today, I will put such lofty goals out of my mind─along with my past demons, as best as I am able─and fight as best I can for those who need me today."},{"name":"TOLAS","text":"You have taught me an important lesson today...both of you."},{"name":"MAUWYL","text":"Hah! That's right! I was wondering when you were going to get around to thanking the man who brought <span class=\"highlight\">Forename</span> here from the Crystarium in the first place! Which reminds me─I have a delivery to make!"},{"name":"TOLAS","text":"Be safe, my friend. And thank you for everything."},{"name":"TOLAS","text":"You as well, <span class=\"highlight\">Forename</span>. I will be forever grateful for all you have done."},{"name":"TOLAS","text":"Should you ever need a respite from the road, you are always welcome at the Imperative. Though we can offer little else, I hope that you will honor us with your presence again one day."}],"reward":{"gil":1065,"items":[{"num":2,"id":27872,"one":1},{"num":2,"id":27873,"one":1},{"num":2,"id":27874,"one":1},{"num":2,"id":27875,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69071]},"next":[69051]},"partials":[{"type":"npc","id":"1030684","obj":{"i":1030684,"n":"Tolas","l":2953,"q":2}},{"type":"npc","id":"1030688","obj":{"i":1030688,"n":"Tolas","l":2953,"q":1}},{"type":"item","id":"27872","obj":{"i":27872,"n":"Masala Chai","l":412,"c":24410,"t":46}},{"type":"item","id":"27873","obj":{"i":27873,"n":"Risotto al Nero","l":415,"c":24028,"t":46}},{"type":"item","id":"27874","obj":{"i":27874,"n":"Espresso con Panna","l":415,"c":24407,"t":46,"p":3690}},{"type":"item","id":"27875","obj":{"i":27875,"n":"Mist Spinach Saute","l":415,"c":24152,"t":46,"p":3690}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69071","obj":{"i":69071,"n":"A Much-needed Respite","g":113,"l":"Lakeland","s":7120}},{"type":"quest","id":"69051","obj":{"i":69051,"n":"Flowering Friendships","g":113,"l":"Lakeland","s":7140}}]}