{"quest":{"name":"Hobgob Smacker","location":"Kholusia","id":69074,"patch":5.0,"sort":8030,"eventIcon":71221,"issuer":1027303,"target":1027303,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Grawley seems fit to explode."],"objectives":["Place the bulging sack of foodstuffs at the designated location.","Lie in wait and defeat the hobgoblin thieves.","Report to Grawley."],"dialogue":[{"name":"GRAWLEY","text":"Gah, enough is enough!!!"},{"name":"GRAWLEY","text":"...Sorry, friend, that wasn't meant for you. It's those bastard hobgoblins..."},{"name":"GRAWLEY","text":"They know none of us are fighters, so they just skulk in and raid our food stores, brazen as you please! But I bet you could give them somethin' to chew on, eh?"},{"name":"GRAWLEY","text":"Here, take this supply sack and drop it just outside the village. Once them thieving blighters come sniffing about, you spring out of hiding and unleash a storm of righteous justice!"},{"name":"GRAWLEY","text":"Justice must be served! Set the table with that supply sack and make sure them hobgobbers get a proper helping!"},{"name":"GRAWLEY","text":"Yes! Vengeance for our missed meals and rumbling bellies! Fine work, my friend!"},{"name":"GRAWLEY","text":"Hobgoblins have plagued this island for as long as anyone can remember. They're cunning enough to make tools, but still they act like beasts─mean, filthy brutes what lack the barest shred of common decency!"},{"name":"GRAWLEY","text":"And even though you've cowed them for the moment, I fear the lesson won't stick. Oh, they'll be back. You can be sure of that."},{"name":"GRAWLEY","text":"In the meantime, we'll need to think of a more <span class=\"emphasis\">permanent</span> solution..."}],"reward":{"gil":679},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[69079,69176]}},"partials":[{"type":"npc","id":"1027303","obj":{"i":1027303,"n":"Grawley","l":2954,"q":2}},{"type":"quest","id":"69079","obj":{"i":69079,"n":"Supplying Estimates","g":114,"l":"Kholusia","s":8020}},{"type":"quest","id":"69176","obj":{"i":69176,"n":"Rich Veins of Hope","g":8,"l":"Kholusia","s":920}}]}