{"quest":{"name":"A Much-needed Respite","location":"Lakeland","id":69071,"patch":5.0,"sort":7120,"icon":100862,"eventIcon":71221,"issuer":1030681,"target":1030684,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Mauwyl remains frustrated by his friend's stubborn silence.","Tolas grudgingly shares his tale of shame with his woodcutter friend. The proud and stubborn guardsman at first declares his intention to immediately return to the battlefield to atone for his failures, an idea which is quickly shot down by Mauwyl, who insists that his friend take a respite from his duties until he is fully recovered. Tolas reluctantly agrees, and goes off to his commanding officer to formally make his request. Concerned that his friend might have a change of heart, Mauwyl asks you to follow him there.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You are relieved to see that Tolas fully intends to honor his friend's request, and moreover, that his commanding officer has already granted his request for a leave of absence. The officer, one Ser Atli, also showers you with glowing praise for your own exploits in the recent battle, and suggests that you and Tolas both wash your cares away with a soak in the healing hot spring waters of Clearmelt. Tolas finds the invitation most agreeable, and sets off for the baths straightaway. Follow along after him if you are so inclined.","You reunite with Tolas in front of the bathhouse at Clearmelt. The guardsman explains that it is his first time visiting the establishment, but nevertheless he appears to be looking forward to the experience. He invites you to change your clothes and go on ahead, as he anticipates that removing his full set of armor will take some time still.","You enjoy a relaxing bath in the company of Tolas, who is still having difficulty coming to terms with recent events, and their implications for his lifelong pursuit of the art of war, and his future as a member of the Crystarium guard. You are in the process of offering what advice you can, when the two of you are interrupted by one of Tolas's fellow guardsmen, who rushes onto the scene wearing an expression of concern. He explains in grave tones that a stray sin eater has attacked a supply caravan with which Mauwyl was traveling, and that the young woodcutter has gone missing. Worried for his friend, Tolas vows to head back and join the search effort with all speed, and makes an earnest plea for your aid.","After changing back into your standard gear, you reunite with Tolas beside the baths. The guardsman is uncertain whether or not he has fully recovered to the point that he can fight at full strength again, but nevertheless is determined to do anything and everything in his power to deliver his friend from harm."],"objectives":["Speak with Tolas.","Speak with Tolas at Clearmelt.","Wait for Tolas by the baths.","Speak with Tolas."],"dialogue":[{"name":"TOLAS","text":"......"},{"name":"MAUWYL","text":"Come now, Tolas! It isn't like you to brood and mope like this. I'm your friend, am I not? Why do you refuse to tell me what happened!?"},{"name":"TOLAS","text":"..."},{"name":"MAUWYL","text":"Well, if you insist on being so godsdamned stubborn, I'll just have to ask <span class=\"highlight\">Forename</span> here. You'll tell me, won't you?"},{"name":"TOLAS","text":"...There will be no need for that. The shameful tale is mine, and I should be the one to do the telling."},{"name":"MAUWYL","text":"Tolas... I had no idea."},{"name":"TOLAS","text":"Now you see me for who I truly am. Not a proud knight and leader of men, but a craven coward who stood there trembling as those who trusted me with their lives died in agony!"},{"name":"MAUWYL","text":"That's enough, Tolas! You faced a foe more horrific than most men see in their lifetimes. There is no shame in being afraid!"},{"name":"MAUWYL","text":"Why, if it had been me out there on the battlefield that day, I'd have turned tail and run at the first sight of a sin eater, crying for my mum all the way home. And I wouldn't be the only one!"},{"name":"MAUWYL","text":"I can only begin to imagine the pain and grief you now feel. But still, you live to fight another day! As far as I'm concerned...I thank the gods for their mercy that my best friend is still with me."},{"name":"TOLAS","text":"Your words are most moving...but I fear I cannot so easily forgive myself. I am a knight, descended from a proud line of those who protected and served. I must hold myself to a higher standard than ordinary men."},{"name":"TOLAS","text":"And <span class=\"emphasis\">this</span> is what I have become─cowering before my enemy like a spineless stable boy! My great-grandfather─bless his brave soul─must be turning in his grave at the dishonor I have brought him!"},{"name":"TOLAS","text":"From this moment forward, I will redouble my efforts to defend the people and serve this realm. Yes, I will not rest for a moment until I have fully atoned for my grievous misdeeds!"},{"name":"MAUWYL","text":"Look at yourself, Tolas! I'd wager you haven't had a good night's sleep ever since the battle! What you need now is rest. <span class=\"emphasis\">Then</span> you can worry about atoning for your perceived failures."},{"name":"MAUWYL","text":"If you won't listen to me, at least listen to <span class=\"highlight\">Forename</span> here. You agree with me, don't you?"},{"name":"MAUWYL","text":"See? That makes two of us! I know you're a stubborn arse, but even you must realize that you're in no shape to fight the way you are!"},{"name":"MAUWYL","text":"Don't you understand? If you keep going out there in your current condition, this time you're like to get even more men─no, even yourself killed!"},{"name":"TOLAS","text":"...Your words ring true. As much as it pains me, mayhap it would be for the best if I took a brief respite from my duties."},{"name":"MAUWYL","text":"Tolas! Finally you're speaking some sense, my friend! <span class=\"highlight\">Forename</span> and I will go and speak with your commanding officer straightaway."},{"name":"TOLAS","text":"...There will be no need for that. You have business you must attend to, yes? As far as I have fallen, I am not so wretched that I cannot see to my own affairs. I will speak with the commander myself."},{"name":"MAUWYL","text":"Egads, he's right─there's a delivery I need to be making! Would you be so kind as to follow after him? Call me overcautious, but I fear he's just going to rush straight back out to the battlefield as soon as we look away."},{"name":"MAUWYL","text":"Thank you, <span class=\"highlight\">Forename</span>. You're a true friend!"},{"name":"ATLI","text":"Oho! If it isn't <span class=\"highlight\">Forename Surname</span>, the hero of the hour. All of the Imperative is in your debt for your valiant efforts on our behalf."},{"name":"TOLAS","text":"Ah, <span class=\"highlight\">Forename</span>. I trust Mauwyl sent you? While my friend's concern is touching, it is entirely unwarranted. I have no intention of going back on my word."},{"name":"ATLI","text":"Well, this is an honor! None other than <span class=\"highlight\">Forename Surname</span>, the hero of the day! The Imperative is forever in your debt─I can scarcely count how many lives were saved through your bravery."},{"name":"ATLI","text":"Worry not, for I have already signed the papers granting Tolas a leave of absence. I daresay you have earned yourself a rest as well. Why don't the two of you head to Clearmelt and wash your worries away?"},{"name":"TOLAS","text":"A soak in the springs at Clearmelt? Yes...I suppose that might be nice. What say you, <span class=\"highlight\">Forename</span>?"},{"name":"TOLAS","text":"Well, if you do not have more pressing matters to attend to, I would very much appreciate the company."},{"name":"ATLI","text":"The waters at Clearmelt are known for their soothing and healing properties. There is no better place to recuperate after a hard-fought battle."},{"name":"TOLAS","text":"I am glad you saw fit to join me, <span class=\"highlight\">Forename</span>. I must confess, this is my first time coming to such a place. I take it this building here is where we change our clothes?"},{"name":"TOLAS","text":"Feel free to go on ahead of me. I fear it may take me some time to remove all of this armor..."},{"name":"Q3","text":"Enter the hot springs in your current garb?"},{"name":"TOLAS","text":"<span class=\"highlight\">Forename</span>...you also fought in the battle that day, yes? How is it that you were able to face such a fearsome foe without losing your nerve? Is there some secret you could impart to me?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You get used to it."},{"name":"A1","text":"I have faced worse."},{"name":"TOLAS","text":"Wicked white! I can scarcely begin to imagine what you have witnessed in your adventures, if that nightmarish day was just another battle to you."},{"name":"TOLAS","text":"Foes more fearsome than the sin eaters!? Why, I can hardly believe such a thing could exist in this world!"},{"name":"TOLAS","text":"But forgive me my rudeness. Of course, it is not that I doubt your tales. The expression on your face and the composure with which you carry yourself speak volumes."},{"name":"TOLAS","text":"I had thought myself a veteran of war, but clearly whatever experience I possess pales in comparison to yours. But even that matters little anymore..."},{"name":"TOLAS","text":"I have devoted my entire life to forging myself into the perfect warrior, and yet look at me now. I am no more than a bent and rusted blade, no longer fit for the battlefield. Looking back, I cannot help but wonder...what it was all for?"},{"name":"TOLAS","text":"What of you, <span class=\"highlight\">Forename</span>? What gives you the strength and courage to go on as you do? What is it that you are fighting for?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I cannot betray those who trust in me."},{"name":"A2","text":"I found something I must protect."},{"name":"A2","text":"..."},{"name":"TOLAS","text":"...I see. I know not what burden you bear, but I can only assume that it far outweighs any of my own."},{"name":"TOLAS","text":"Something you must protect... Now that I have lost everything, is there anything I have worth protecting anymore?"},{"name":"TOLAS","text":"Forgive me. It is not my place to ask such an impertinent question of a hero such as you. No, I must find my own answers."},{"name":"TOLAS","text":"Almost my entire life I have lived as a warrior, but what was it that I was truly fighting for? Was it out of my own pride? Was it to honor my family's name?"},{"name":"TOLAS","text":"What was it that I had and then lost, that I am now unable to so much as swing my blade...?"},{"name":"SOLDIER03535","text":"Forgive the intrusion, Ser Tolas!"},{"name":"SOLDIER03535","text":"Grave news from the Imperative! A supply caravan was intercepted by a stray sin eater! Your friend Mauwyl...he's missing, sir!"},{"name":"TOLAS","text":"What's this you say!?"},{"name":"SOLDIER03535","text":"They had just left Radisca's Round for the Imperative when the fiend attacked! I raced here as fast as my legs could carry me!"},{"name":"TOLAS","text":"Understood! I will set off at once. You, too─return with all haste and rejoin the search party!"},{"name":"SOLDIER03535","text":"Aye, sir! By your leave!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I will go with you."},{"name":"A3","text":"Can you fight?"},{"name":"TOLAS","text":"Thank you. Given my current state, I would feel far more confident with you at my side."},{"name":"TOLAS","text":"...I cannot say. And yet, Mauwyl is in danger. I cannot simply stand idly by!"},{"name":"TOLAS","text":"Once again, I find myself in your debt. Truth be told, I do not know how I will react if confronted by a sin eater. But this I do know: my friend needs me. I must do what I can."}],"reward":{"gil":788},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69070]},"next":[69072]},"partials":[{"type":"npc","id":"1030681","obj":{"i":1030681,"n":"Mauwyl","l":2953,"q":2}},{"type":"npc","id":"1030684","obj":{"i":1030684,"n":"Tolas","l":2953,"q":2}},{"type":"quest","id":"69070","obj":{"i":69070,"n":"His Secret Shame","g":113,"l":"Lakeland","s":7110}},{"type":"quest","id":"69072","obj":{"i":69072,"n":"Resolve Regained","g":113,"l":"Lakeland","s":7130}}]}