{"quest":{"name":"Sisterly Concern","location":"Kholusia","id":69081,"patch":5.0,"sort":8010,"eventIcon":71221,"issuer":1030755,"target":1030755,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The restless hunter is scanning the horizon."],"objectives":["Search for the lanky lass.","Aid the lanky lass.","Report to the restless hunter."],"dialogue":[{"name":"HUNTER03545","text":"Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, have you seen a tall, skinny Hume girl on your travels?"},{"name":"HUNTER03545","text":"...No? Do you think you might lend a hand in finding her, then? She has a terrible habit of wandering away when left to her own devices─not the safest pastime when you consider the wildlife around here."},{"name":"HUNTER03545","text":"I'll start looking near the Ladder, but it would make me feel better if I knew someone was searching along the cliff at the same time. Would you do that for me?"},{"name":"HUNTER03545","text":"Thank you! I've seen her walk off to the southeast before, so you might want to try that way first. If you do find her, please send her back to Amity!"},{"name":"FRIEND03545","text":"N-No! Leave me alone!"},{"name":"FRIEND03545","text":"Oh, thank you! Thank you, uh... Who are you?"},{"name":"FRIEND03545","text":"...Ah. Sent you to find me, did she? My little brother lives down there, you see, and this place offers the best view of Gatetown."},{"name":"FRIEND03545","text":"I'd wanted us to leave together─to give up on being chosen─but he'd become obsessed with the idea of Eulmore. And when I heard about the fighting and such, I got so worried..."},{"name":"FRIEND03545","text":"And now here I am, causing the same kind of worry for my neighbors. My apologies─I'll be more careful in the future."},{"name":"HUNTER03545","text":"My friend came back safe and sound, saying how she was saved by a stranger. I assume that was you!"},{"name":"HUNTER03545","text":"She seemed...less brooding than usual. What did you two talk about?"},{"name":"HUNTER03545","text":"...I never knew she had a brother. Many here have lost their families─maybe that's why she thought to keep it secret."},{"name":"HUNTER03545","text":"But now that things in Eulmore have changed, we shouldn't have to creep around the lowlands like thieves anymore. She'll be able to visit her brother openly! No more stealing away to peer over cliffs!"},{"name":"HUNTER03545","text":"Who knows, maybe I'll even go along. She might need company on the road, and what else are friends for?"},{"name":"HUNTER03545","text":"Aye, I think I'll have a word with her right now. Thank you again, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>!"}],"reward":{"gil":679},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69170]}},"partials":[{"type":"npc","id":"1030755","obj":{"i":1030755,"n":"Restless Hunter","l":2954,"q":1}},{"type":"quest","id":"69170","obj":{"i":69170,"n":"The View from Above","g":8,"l":"Kholusia","s":860}}]}