{"quest":{"name":"Beneath the Beard","location":"Kholusia","id":69087,"patch":5.0,"sort":8140,"eventIcon":71221,"issuer":1027468,"target":1027468,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Bomott is peering around sheepishly."],"objectives":["Gather slick pebbles in upper Watts River.","Deliver the slick pebbles to Bomott."],"dialogue":[{"name":"BOMOTT","text":"Lali-ho! I'd been hoping to speak with you, stranger! Would you be willing to help me with a simple task? It's something that I just... I can't ask anyone in Tomra."},{"name":"BOMOTT","text":"You will!? Oh, thank you! All I need is three little pebbles from upper Watts River. Slick and smooth. That's all."},{"name":"BOMOTT","text":"Bring me three pebbles from the river, and I'll be forever grateful! There's no one else I can turn to..."},{"name":"BOMOTT","text":"Please tell me you brought the pebbles..."},{"name":"BOMOTT","text":"Aye, this is exactly what I needed! Thank you!"},{"name":"BOMOTT","text":"I feel I owe you an explanation─as long as you can keep it to yourself. You see, I'll be crushing these stones and mixing them with plant oils to make a soothing lotion. The minerals help with the itching..."},{"name":"BOMOTT","text":"You may have noticed, but outside of our own families, we dwarves never show our naked faces. And so we wear our helms all day, every day."},{"name":"BOMOTT","text":"But when you have weak skin like mine, that means rashes. Red, blotchy rashes that would have me scratching my own nose off if not for my lotion. They usually make it for beardlings what haven't gotten used to their helms..."},{"name":"BOMOTT","text":"So I appreciate that none of my neighbors had to see me wading in the river for ingredients. You've saved my honor, friend, and earned all the financial gratitude I can spare!"}],"reward":{"gil":805,"items":[{"id":26871}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69173]}},"partials":[{"type":"npc","id":"1027468","obj":{"i":1027468,"n":"Bomott","l":2954,"q":1}},{"type":"item","id":"26871","obj":{"i":26871,"n":"Dwarven Mythril Hand Gear Coffer (IL 415)","l":1,"c":26560,"t":61}},{"type":"quest","id":"69173","obj":{"i":69173,"n":"Meet the Tholls","g":8,"l":"Kholusia","s":890}}]}