{"quest":{"name":"Distract and Rescue","location":"Kholusia","id":69086,"patch":5.0,"sort":8130,"eventIcon":71221,"issuer":1030808,"target":1030808,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Tholl tinkerer is looking for an outsider's help."],"objectives":["Speak with the Tholl tinkerer.","With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “Lali-ho” to distract the Gogg lookouts.","Speak with the Tholl tinkerer."],"dialogue":[{"name":"MECHANISM03550","text":"Lali-ho! Oh, you couldn't have chosen a better time to visit!"},{"name":"MECHANISM03550","text":"Those vile Goggs have stolen away my precious automaton! Stolen her away, and stashed her in some cluttered corner of their village with the rest of their ill-gotten goods..."},{"name":"MECHANISM03550","text":"Problem is, I'm a drinker, not a fighter. And I doubt I could creep past their guards without one of them seeing me."},{"name":"MECHANISM03550","text":"That's where I need your help! If <span class=\"alternative-container\"><span class=\"alternative\">a Hume</span><span class=\"alternative\">an elf</span><span class=\"alternative\">a strange dwarf</span><span class=\"alternative\">a Mystel</span><span class=\"alternative\">a Galdjent</span><span class=\"alternative\">a Drahn</span><span class=\"alternative\">a Ronso</span><span class=\"alternative\">a Viis</span></span> like you were to walk in and distract them, then I could smuggle out my automaton with no one the wiser!"},{"name":"MECHANISM03550","text":"I mean, you shouldn't be in any danger. Goggs and Tholls are mortal enemies, aye, but they don't attack other folk on sight. Usually."},{"name":"MECHANISM03550","text":"Let's move a little closer to Komra, and get this rescue mission underway! Don't you worry, my little bucket of bolts─you'll soon be home again!"},{"name":"MECHANISM03550","text":"Do you see those two lookouts? Just walk up to them, bold as you please, and give a hearty “lali-ho!”"},{"name":"MECHANISM03550","text":"Once you have their attention, tell them...oh, I don't know...that you saw a stinky Tholl sneaking about nearby or something. That should get them moving. Then I'll tiptoe in, grab my automaton, and meet you back here."},{"name":"MECHANISM03550","text":"Just belt out a happy “lali-ho,” then tell those lookouts you saw a Tholl nearby. Once they move off to investigate, I'll slip in and out, then meet you back here with my automaton. Sound like a plan?"},{"name":"SYSTEM","text":"Lali-ho"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase containing “Lali-ho” to distract the Gogg lookouts."},{"name":"DWARFA03550","text":"Hm? You lookin' for trouble, stranger?"},{"name":"DWARFB03550","text":"......"},{"name":"DWARFA03550","text":"Lali-ho! What brings you to Komra?"},{"name":"DWARFA03550","text":"What!? A stinkin', ugly Tholl!? I'll catch the bugger by his piss-drenched beard, and knock his helm clear into next week!"},{"name":"DWARFB03550","text":"Lali-ho! What can the Gogg do for you?"},{"name":"DWARFB03550","text":"A Tholl!? Here!? Aye, you did well to let me know. I'll soon take care of this lurker..."},{"name":"MECHANISM03550","text":"Well done, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! You played your part to perfection! As you can see, the rescue was a success!"},{"name":"MECHANISM03550","text":"Come on back to Tomra, and we can talk rewards."},{"name":"MECHANISM03550","text":"Ever since there've been dwarves, it seems the Goggs have hated the Tholls. Although I'm not rightly sure why..."},{"name":"MECHANISM03550","text":"Well, I know why we hate the Goggs! Their beards are unkempt, straggly messes, and the bastards dig in our mines without so much as a by-your-leave!"},{"name":"MECHANISM03550","text":"Grrr, it makes my blood boil! Next time they come around, I'll be waiting with an automaton army! We'll make them wish they never left Komra, the thieving, scrounging curs!"},{"name":"MECHANISM03550","text":"Oh, I almost forgot your reward. And I'll be keeping a closer eye on my dear clunker here, don't you worry..."}],"reward":{"gil":951},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69173]}},"partials":[{"type":"npc","id":"1030808","obj":{"i":1030808,"n":"Tholl Tinkerer","l":2954,"q":1}},{"type":"quest","id":"69173","obj":{"i":69173,"n":"Meet the Tholls","g":8,"l":"Kholusia","s":890}}]}