{"quest":{"name":"Good, Honest Dirt","location":"Kholusia","id":69080,"patch":5.0,"sort":8001,"eventIcon":71221,"issuer":1027456,"target":1027456,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sylgran is looking for a second opinion."],"objectives":["Inspect dirt mounds.","Speak with Sylgran."],"dialogue":[{"name":"SYLGRAN","text":"Greetings, stranger, and well met. They say folk don't often go out of their way to visit Amity. Me, though, I came here with a mind to raise crops."},{"name":"SYLGRAN","text":"...What, you don't think a man could farm this land? Well, you seem like a well-traveled <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"SYLGRAN","text":"Why don't you head over to my “field” back there, and take a look for yourself. I'd be curious to know what you think my chances are of taming this barren soil..."},{"name":"SYLGRAN","text":"My “field” is just over yonder. It's not much more than a few mounds of dirt at the moment, but a man has to start somewhere, eh?"},{"name":"SYSTEM","text":"The dirt is bone dry..."},{"name":"SYSTEM","text":"Nothing seems to be growing here..."},{"name":"SYSTEM","text":"The dirt has hardened and cracked..."},{"name":"SYSTEM","text":"Even weeds refuse to grow here..."},{"name":"SYSTEM","text":"A tiny sprout has emerged, but is already beginning to wilt."},{"name":"SYLGRAN","text":"So, what did you think of my crop?"},{"name":"SYLGRAN","text":"Oho, one of the seeds had sprouted? That's wonderful news! I had no such luck with my previous attempt."},{"name":"SYLGRAN","text":"Aye, even a small victory like that is worthy of celebration─it brings me one step closer to turning my little plot into the farmer's field I now dream of..."},{"name":"SYLGRAN","text":"...A dream some say will never come true. And yet scratching here in the dirt has already brought me more fulfillment than I ever felt from the empty life I lived in Eulmore."},{"name":"SYLGRAN","text":"Not that I wasn't terrified when they first kicked me out the gate, mind you! Exiled over some petty disagreement, and destitute but for the few pieces of jewelry I concealed upon my person..."},{"name":"SYLGRAN","text":"The sale of those trinkets brought in some meager wealth, which has largely gone towards my agricultural endeavor."},{"name":"SYLGRAN","text":"Thus, should my crops fail to produce a harvest ere my funds are depleted, I shall be left with nothing in this world. Ah, I have never felt so alive! Here, friend─a few coins for your services."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69170]}},"partials":[{"type":"npc","id":"1027456","obj":{"i":1027456,"n":"Sylgran","l":2954,"q":1}},{"type":"quest","id":"69170","obj":{"i":69170,"n":"The View from Above","g":8,"l":"Kholusia","s":860}}]}