{"quest":{"name":"Killer on the Loose","location":"Kholusia","id":69084,"patch":5.0,"sort":8110,"eventIcon":71221,"issuer":1027442,"target":1027442,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Rakitt has a destructive favor to ask."],"objectives":["Place the lump of dense coal at the designated location.","Lie in wait and defeat the ironbeard killer.","Deliver the automaton core to Rakitt."],"dialogue":[{"name":"RAKITT","text":"Lali-ho! Say, you're that <span class=\"alternative-container\"><span class=\"alternative\">visitor</span><span class=\"alternative\">foreign dwarf</span></span> ain't you? What do you reckon your chances are of smashing a combat automaton?"},{"name":"RAKITT","text":"That's my job, you see─making contraptions what can protect the village from eaters and such. My latest and greatest invention is the “ironbeard killer”!"},{"name":"RAKITT","text":"...Well, maybe not the greatest. As soon as I turned the bugger on, it straightened up, twitched a bit, then raced right out the gate. And as much as I'd like to go after it, you never know what a failed automaton might do..."},{"name":"RAKITT","text":"What's worse, I tuned this one to be extra aggressive. Like as not, I'd barely squeak out a lali-ho afore it pulped me into a bloody mess. I need you to forcefully disassemble the killer, and bring me back its core!"},{"name":"RAKITT","text":"Last I saw, it was trundling away to the southeast. Here, you can use this lump of coal to pick your battlefield─the automaton is designed to refuel if the opportunity presents itself."},{"name":"RAKITT","text":"While it's stuffing its face with that, you can get in the first blow. And make it a good one! I didn't call it “killer” for nothing!"},{"name":"RAKITT","text":"Head over to the southeast, then use that coal to set up your ambush. Oh, and once you're done taking that bugger apart, don't forget to retrieve the core!"},{"name":"RAKITT","text":"Oh, you're back! Any luck retrieving that core?"},{"name":"RAKITT","text":"...Aye, looks to be in good shape. I can start building a new model straightaway!"},{"name":"RAKITT","text":"This here stone is both heart and mind for an automaton, you see. It defines more than just basic behavior, but personality as well."},{"name":"RAKITT","text":"And it was no easy feat making one what's formulated for battle, let me tell you. I'd rather pull out my beard strand by strand than start again from scratch!"},{"name":"RAKITT","text":"That was, what, my eighth failed automaton...? Bah, I'll get it right this time! Thanks for saving me all that extra work!"}],"reward":{"gil":878},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69173]}},"partials":[{"type":"npc","id":"1027442","obj":{"i":1027442,"n":"Rakitt","l":2954,"q":1}},{"type":"quest","id":"69173","obj":{"i":69173,"n":"Meet the Tholls","g":8,"l":"Kholusia","s":890}}]}