{"quest":{"name":"A Practiced Greeting","location":"Kholusia","id":69094,"patch":5.0,"sort":8250,"icon":100864,"unlocksFunction":1,"eventIcon":71341,"issuer":1030800,"target":1030786,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ronitt appears to be appraising his relationship with you.","Ronitt has decided that you and he are friends, and as such, the young dwarf takes your advice to improve his greetings to heart. Still uncomfortable with the idea of approaching his fellow villagers, however, Ronitt rushes off to find an alternative practice partner...<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Ronitt locates a malfunctioning Talos on which to test a hearty “lali-ho,” but, despite his best efforts, he cannot overcome his self-defensive instinct to twist greeting into insult. The Talos, meanwhile, does not take well to this barrage of hostile blather and chases after the stammering dwarf. It seems your new friend is in need of rescuing.","The enraged golem falls at your feet, defeated. Ronitt, however, has failed to notice that the battle is over.","You shake Ronitt from his terror, but a fresh wave of frustration sends him stumbling off into the distance. Find the discouraged dwarf, and /rally his spirits.","Expressing disbelief at your relentless kindness, Ronitt nevertheless seems willing to work on his stunted sense of social grace. With you at his side, he may just yet muster the courage to perform a “lali-ho” worthy of a dwarf."],"objectives":["Speak with Ronitt.","Defeat the cracked Talos.","Aid Ronitt.","/rally Ronitt's spirits."],"dialogue":[{"name":"RONITT","text":"Oh! So, ah... This means we're friends now, right?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That it does!"},{"name":"A1","text":"......"},{"name":"RONITT","text":"Th-That's good, then. It's just...I've never had a friend before. I'm not sure where to go from here..."},{"name":"RONITT","text":"Th-There's no need to be shy! I mean, me, I've never had a friend before, so I... I'm not sure where to go from here..."},{"name":"RONITT","text":"I was wonderin', though. Why <span class=\"emphasis\">did</span> my mother bring you to see me?"},{"name":"RONITT","text":"Was it all her idea!? Is that why you're bein' so nice to me!?"},{"name":"RONITT","text":"Hmmm..."},{"name":"RONITT","text":"...I guess even if that was true, you're no less of a good sort for agreein' to it! Heh heh."},{"name":"RONITT","text":"Aye, I know my mother worries about me bein' alone all the time. But I can't even talk to <span class=\"emphasis\">her</span> without gettin' defensive! How can she expect me to get along with anyone else?"},{"name":"RONITT","text":"You've met lots of folk on your travels, haven't you? If you've some tricks to help me talk to the other villagers, I'd like to hear 'em!"},{"name":"RONITT","text":"...You know, this might be the longest conversation I've had in a good while─must be because we're friends now, eh? Heh. Heh heh heh!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"We should work on your greetings."},{"name":"A2","text":"A dwarf needs a good “lali-ho”..."},{"name":"RONITT","text":"Aye... In that case, I will need your help after all. I don't think I could stand to have anyone else watchin' over me."},{"name":"RONITT","text":"Hahaha! You <span class=\"emphasis\">do</span> have one of the best “lali-hos” I've seen, so with you guidin' me maybe I've got a chance to improve!"},{"name":"RONITT","text":"But I can't skip straight to greetin' people...and spendin' time on my automata is what caused me problems in the first place."},{"name":"RONITT","text":"No, my only option now is monsters─preferably one what's shaped like a person!"},{"name":"RONITT","text":"Come on, then! I'm off to find me a practice partner!"},{"name":"RONITT","text":"That twitchy lad there should do the trick! As long as I don't make myself a threat, he shouldn't have a reason to attack us."},{"name":"RONITT","text":"&lt;cough&gt; H-Hey! You there! Two-legs! Look at me when I'm talkin' to y─ Wait, that's not right. The <span class=\"emphasis\">greeting</span>. Gotta practice the greeting..."},{"name":"RONITT","text":"Lali... Lali- &lt;cough&gt;<br>Ugh, my hands are shakin'..."},{"name":"RONITT","text":"Lali...hey! You big lump of useless golem garbage!"},{"name":"RONITT","text":"Oops..."},{"name":"RONITT","text":"...I-I didn't mean it! I take back that “garbage” bit!"},{"name":"GOLEM03558","text":"(-Cracked Talos-)Bwoaaarrrgh!!!"},{"name":"RONITT","text":"Argh! This was not part of the plaaaaaan!!!"},{"name":"RONITT","text":"&lt;sob&gt; I'm sorry, I made a mess of things..."},{"name":"RONITT","text":"Grrr! Damn it all to the deepest mineshaft!!!"},{"name":"RONITT","text":"Why!? Why can't I do it!? I'm a bloody <span class=\"emphasis\">dwarf</span>, ain't I!?"},{"name":"SYSTEM","text":"Ronitt has fled in his frustration. Perhaps he needs a friend to <span class=\"highlight\">rally</span> his spirits."},{"name":"RONITT","text":"Y-You came after me... You really are a kind soul, ain't you?"},{"name":"RONITT","text":"...And I'm still kind of a prickly sort. But I <span class=\"emphasis\">do</span> dream of helpin' the other villagers with my smithin' skills─just like the great Watts did."},{"name":"RONITT","text":"It's just that I've spent my whole life tinkerin' with automata instead of learnin' how to speak to folk. I've always been awkward..."},{"name":"RONITT","text":"And that got worse when I realized people were avoidin' me. It made me angry─made me throw up walls and shut others out. Then it wasn't long before no one would come anywhere near me..."},{"name":"RONITT","text":"&lt;sob&gt; Soon you'll have to leave too, and then I'll be all alone again!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"You're overthinking the greeting─just put your heart into it!"},{"name":"A3","text":"There are people out there willing to give you a chance!"},{"name":"RONITT","text":"You... You're <span class=\"emphasis\">still</span> tryin' to help me!?"},{"name":"RONITT","text":"Aye, but maybe you're right. A clumsy “lali-ho” what lets folk know I'm open to bein' friendly might be better'n no “lali-ho” at all."},{"name":"RONITT","text":"You... You're <span class=\"emphasis\">still</span> tryin' to help me!?"},{"name":"RONITT","text":"...I suppose I could give it another try─a clumsy “lali-ho” might be better'n no “lali-ho” at all."},{"name":"RONITT","text":"Right! My mind's made up!"},{"name":"RONITT","text":"I can do this! Be the dwarf I need to be! ...You'll be there with me though, right!?"},{"name":"RONITT","text":"I'll never be a proper dwarf..."}],"reward":{"gil":788},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69093]},"next":[69095]},"partials":[{"type":"npc","id":"1030800","obj":{"i":1030800,"n":"Ronitt","l":2954,"q":4}},{"type":"npc","id":"1030786","obj":{"i":1030786,"n":"Ronitt","l":2954,"q":2}},{"type":"quest","id":"69093","obj":{"i":69093,"n":"Almost a Friend","g":114,"l":"Kholusia","s":8240,"f":1}},{"type":"quest","id":"69095","obj":{"i":69095,"n":"Learning to Lali-ho","g":114,"l":"Kholusia","s":8260,"f":1}}]}