{"quest":{"name":"Bringing the Nibbles","location":"Kholusia","id":69098,"patch":5.0,"sort":8210,"eventIcon":71221,"issuer":1027467,"target":1027467,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Xorutt is poised to continue with his instruction of ale-related customs."],"objectives":["Obtain iguana tails from upland iguanas.","Deliver the iguana tails to Xorutt.","Deliver the barrel of fermenting ale to the Tholl alewife.","Report to Xorutt."],"dialogue":[{"name":"XORUTT","text":"The seeds are almost set to ferment! What we need now is some tasty nibbles to complement the booze!"},{"name":"XORUTT","text":"...What's that look for? A dwarf can't live on grog alone, though for some it ain't for lack of trying."},{"name":"XORUTT","text":"Anyhow, the traditional side dish to a pint of dwarven ale is a nice big plate of dried iguana tails!"},{"name":"XORUTT","text":"Lizards don't just hand over their body parts, of course, so you'll have to go chop 'em off yourself. It's something of a custom to show off your best trophies and share them with your fellows come drinking time─a real bonding experience!"},{"name":"XORUTT","text":"You'll find iguanas─and their tasty tails─to the southeast of town. Two should be enough, seeing as them scalekin are so bloody huge. ...Oh, did I not mention that? Well, good hunting!"},{"name":"XORUTT","text":"Head to the southeast of here─that's where the iguanas tend to wander. You might try lopping off a tail and making a run for it, but you'd be better off expecting a fight."},{"name":"XORUTT","text":"Ah, the mighty lizard hunter returns! What have you got for me?"},{"name":"XORUTT","text":"Oh! Look at the size of them wriggling beauties! Once we set those out to dry, the shrinking'll enhance the flavor so's you can enjoy the full lizardy goodness with every mouthful!"},{"name":"XORUTT","text":"And speaking of flavor, I've got the seeds steeped and sealed. For the next step, we need to store the ale-to-be in the brewhouse so it can ferment somewhere cool and dry."},{"name":"XORUTT","text":"You up for it? Of course you are. Just roll this barrel over to the alewife, and she'll be happy to give it a home."},{"name":"XORUTT","text":"I know it's a long trip, but I reckon you can manage it. And roll, don't lift─that's a rookie mistake!"},{"name":"DWARFA03562","text":"Aye?"},{"name":"DWARFA03562","text":"Ah, getting a firsthand look at the brewing process, are you? Good for you, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! There's naught better in this life than making your own grog, eh?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Aye...naught better."},{"name":"A1","text":"It's certainly an experience..."},{"name":"A1","text":"I wouldn't say that exactly..."},{"name":"DWARFA03562","text":"Gwahahaha!!! Trust me, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>─the more you have to work for it, the better it tastes! And the last step ain't near as grueling, I promise you."},{"name":"DWARFA03562","text":"Go on with you, then, and give my best to Xorutt!"},{"name":"DWARFA03562","text":"You tell that lazy Xorutt to bring his own barrel next time! Gwahahaha!"},{"name":"XORUTT","text":"No trouble finding the brewhouse? Good, I'd say we're ready, then. It's time to learn the most important part of brewing─and drinking─dwarven ale!"}],"reward":{"gil":951},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69097]},"next":[69099]},"partials":[{"type":"npc","id":"1027467","obj":{"i":1027467,"n":"Xorutt","l":2954,"q":3}},{"type":"quest","id":"69097","obj":{"i":69097,"n":"Brew as the Tholl Do","g":114,"l":"Kholusia","s":8190}},{"type":"quest","id":"69099","obj":{"i":69099,"n":"You Know the Words","g":114,"l":"Kholusia","s":8220}}]}