{"quest":{"name":"Almost a Friend","location":"Kholusia","id":69093,"patch":5.0,"sort":8240,"icon":100864,"unlocksFunction":1,"eventIcon":71341,"issuer":1030800,"target":1030800,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ronitt seems surprised to see you still around.","Taken off guard by your decision to remain in his company, Ronitt decides to show you one of his automaton creations. When the invention faithfully echoes Ronitt's hesitant greeting, however, the young dwarf quickly grows frustrated with your confused reaction. Smooth his ruffled beard by delivering the bucket of cobalt coal to Xemutt, as requested.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You approach the venerable Xemutt, and the old lady is surprised to see you carrying out Ronitt's errand in his stead. She nevertheless introduces you to Diligent Spirit, her automaton helper, and asks that you pour the cobalt coal into the contraption's fuel chute.","You upend the bucket into the automaton's fuel chute. Xemutt will be pleased to know that Diligent Spirit now has coal to burn.","After thanking you for refueling her automaton helper, Xemutt expresses sadness at Ronitt's misplaced anger and misunderstood intentions. She pleads for you to exercise patience with the difficult youth before sending you on your way.","Ronitt seems suspicious of what Xemutt may have shared with you, but nonetheless thanks you for your help. Little by little, you feel the young dwarf is warming up to you..."],"objectives":["Speak with Xemutt.","Feed the bucket of cobalt coal into Diligent Spirit's fuel chute.","Speak with Xemutt.","Report to Ronitt."],"dialogue":[{"name":"RONITT","text":"You...you're stayin' around, then? ...Not that I care!"},{"name":"RONITT","text":"But since you're here, I might as well show you one of my favorite automata!"},{"name":"RONITT","text":"I present to you the invincible, the unstoppable...Megasonic Frogboy!"},{"name":"RONITT","text":"He might not look much different to the other models, but I've upgraded him with some new features I invented. Behold!"},{"name":"RONITT","text":"La...Lali-ho!"},{"name":"AUTOMAN","text":"La...Lali-ho!"},{"name":"RONITT","text":"Ugh, you only need <span class=\"emphasis\">one</span> “La”!"},{"name":"AUTOMAN","text":"Ugh, you only need <span class=\"emphasis\">one</span> “La”!"},{"name":"RONITT","text":"...Well? Pretty amazin', huh?"},{"name":"RONITT","text":"Hey! What's that look for!?"},{"name":"RONITT","text":"Oh, I see. You're thinkin', “He can greet some overgrown toy just fine, but he's too scared to talk to actual people!” You just don't understand me!"},{"name":"AUTOMAN","text":"&lt;bzzzt&gt; You just don't understand me!"},{"name":"RONITT","text":"I've got bigger things to worry about than mindin' my manners. You help me out with my stuff, though, and maybe I'll forgive you for underestimatin' me. Just this one time, though!"},{"name":"RONITT","text":"S-So, I need you to take this coal to Xemutt! She's one of the village elders, and her automaton is due for some fuel."},{"name":"RONITT","text":"T-Take that coal to Xemutt! Her automaton must be runnin' low by now..."},{"name":"XEMUTT","text":"Lali-ho!<br>You must be the visitor Xamott was talking about. What can this old lady do for you?"},{"name":"XEMUTT","text":"Oho! On a little errand for Ronitt, are you? That's nice."},{"name":"XEMUTT","text":"I can't get around like I used to, what with this bent back of mine... Would you mind feeding that coal straight into Diligent Spirit there?"},{"name":"XEMUTT","text":"There's a fuel chute on the front of Diligent Spirit. That's right, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, just pour the whole lot in."},{"name":"XEMUTT","text":"Poured the lot in then, have you? Thank you, dear. You're as kind as our Ronitt."},{"name":"XEMUTT","text":"When he heard how my back was giving me trouble, that fine young lad went and hammered together my oddly named helper here. Hardly a day goes by when he doesn't stop past to see it's working properly."},{"name":"XEMUTT","text":"Aye, he's a surly boy, but his heart's in the right place."},{"name":"XEMUTT","text":"It's just a pity he handles his failures with frustration..."},{"name":"XEMUTT","text":"If he persevered with his greetings instead of lashing out, I'm sure he'd be capable of a lovely “lali-ho.”"},{"name":"XEMUTT","text":"Actually, I'm surprised he even asked you to bring me my fuel. I've never known him to do that before─not with anyone."},{"name":"XEMUTT","text":"I've a feeling you'll be the one to get through to him, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, so...be patient, if you can. Thank you again for the delivery!"},{"name":"RONITT","text":"You delivered the coal to Xemutt, then!?"},{"name":"RONITT","text":"Wait! She...she didn't say anythin' strange about me, did she?"},{"name":"RONITT","text":"Anyway...th-thanks for the help. Maybe you and I can be friends after all. “Maybe,” I said!"}],"reward":{"gil":788},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69092]},"next":[69094]},"partials":[{"type":"npc","id":"1030800","obj":{"i":1030800,"n":"Ronitt","l":2954,"q":4}},{"type":"quest","id":"69092","obj":{"i":69092,"n":"A Disagreeable Dwarf","g":114,"l":"Kholusia","s":8230,"f":1}},{"type":"quest","id":"69094","obj":{"i":69094,"n":"A Practiced Greeting","g":114,"l":"Kholusia","s":8250,"f":1}}]}