{"quest":{"name":"You Know the Words","location":"Kholusia","id":69099,"patch":5.0,"sort":8220,"eventIcon":71221,"issuer":1027467,"target":1027467,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Xorutt wishes to share the most essential part of dwarven drinking tradition."],"objectives":["Speak to Tomra residents about the Tomra drinking song.","Report to Xorutt."],"dialogue":[{"name":"XORUTT","text":"Right-o! A fresh batch of ale is brewing, and there're nibbles ready to be nibbled! But I can't exactly ask you to stand there till the fermentation's done─that's still moons away."},{"name":"XORUTT","text":"What I will do is educate you on the finer points of dwarven drinking culture. Aye, a final lesson!"},{"name":"XORUTT","text":"Now, here in Tomra, there are three keys to a successful drinking party. The first is a good drop of ale─that goes without saying. The second is a table laid with tasty treats. And the last─and possibly most important─is a raucous drinking song!"},{"name":"XORUTT","text":"Go on, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>! Have a chat with some of the locals, and don't come back till you've learned the words to our favorite booze-time ballad!"},{"name":"XORUTT","text":"You can't swill grog like a proper dwarf unless you're belting out a merry tune! My fellow Tomrans'll teach you how it goes!"},{"name":"GRATT","text":"...Our drinking song? Bah, you needn't bother learning the lyrics─just so long as you remember the “lali-ho” at the end!"},{"name":"BOMOTT","text":"...A-Aye, the Tomra drinking song! I don't quite recall how it goes, but I do love it when we shout out “lali-ho” all together!"},{"name":"MAGUTT","text":"Every Tomran has been hearing that ditty since they was children. You only need one dwarf to start singing and soon the whole village'll join in! Ah, there's no grander feeling than hoisting your mug and yelling your loudest “lali-ho”!"},{"name":"GRATT","text":"...Our drinking song? Bah, you needn't bother learning the lyrics─just so long as you remember the “lali-ho” at the end!"},{"name":"BOMOTT","text":"...A-Aye, the Tomra drinking song! I don't quite recall how it goes, but I do love it when we shout out “lali-ho” all together!"},{"name":"MAGUTT","text":"Every Tomran has been hearing that ditty since they was children. You only need one dwarf to start singing and soon the whole village'll join in! Ah, there's no grander feeling than hoisting your mug and yelling your loudest “lali-ho”!"},{"name":"XORUTT","text":"Eh!? They only told you the bit with the “lali-ho”?"},{"name":"XORUTT","text":"Heh heh heh! Well I s'pose once we've all had a few, the verses do get a bit muddled. Might be as there's more'n one version..."},{"name":"XORUTT","text":"...Ah, but no matter which words you sing, when you get to that rousing “lali-ho,” all your worries just seem to melt away."},{"name":"XORUTT","text":"Aye, you ever find your troubles bringing you down, then you come on back to Tomra. We'll soon lift your spirits─with an ale in your hand, and a “lali-ho” on your lips!"}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69098]}},"partials":[{"type":"npc","id":"1027467","obj":{"i":1027467,"n":"Xorutt","l":2954,"q":3}},{"type":"quest","id":"69098","obj":{"i":69098,"n":"Bringing the Nibbles","g":114,"l":"Kholusia","s":8210}}]}