{"quest":{"name":"Brew as the Tholl Do","location":"Kholusia","id":69097,"patch":5.0,"sort":8190,"eventIcon":71221,"issuer":1027467,"target":1027467,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Xorutt is short and bearded and ready to brew."],"objectives":["Find clumps of magma grass and collect magma blooms.","Deliver the magma blooms to Xorutt."],"dialogue":[{"name":"XORUTT","text":"Lali-ho! Say, ain't you that <span class=\"alternative-container\"><span class=\"alternative\">traveler</span><span class=\"alternative\">foreign dwarf</span></span> everyone's been talking about?"},{"name":"XORUTT","text":"Well, lali-ho again and welcome to Tomra! I'm going to treat you to some Tholl hospitality, and I'll not take no for an answer!"},{"name":"XORUTT","text":"First things first: we brew some dwarven ale together! Aye, that'll be a lark!"},{"name":"XORUTT","text":"Now, most folk make their ale from barley, but not us dwarves. We use seeds harvested from the magma grass what grows on the slopes of Mt. Gulg."},{"name":"XORUTT","text":"Them weeds drink in the sea air from the moment their heads poke out of the dirt to the moment they wilt and die. Gives our grog a tangy flavor you won't never taste in any of that barley-brewed stuff!"},{"name":"XORUTT","text":"So! Let's give you the full experience, shall we? Head on out of the village, and pluck me four or so good-sized magma blooms─they're crammed tight with seeds, don't you know!"},{"name":"XORUTT","text":"...What do magma blooms look like? Well, they're tall and orange and probably a bit sparkly. You'll know when you see 'em."},{"name":"XORUTT","text":"Well? Did you pluck them blooms like I asked you? Brewing time's a-wasting!"},{"name":"XORUTT","text":"Aye, that's enough seeds to stuff my helm and then some! Good work! This next part of the process is a bit tricky, so let's leave that to an expert. Which would be me."},{"name":"XORUTT","text":"But don't wander away just yet, my friend! There's more to our traditions than just picking sparkly flowers, and we're just getting started!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69173]},"next":[69098]},"partials":[{"type":"npc","id":"1027467","obj":{"i":1027467,"n":"Xorutt","l":2954,"q":3}},{"type":"quest","id":"69173","obj":{"i":69173,"n":"Meet the Tholls","g":8,"l":"Kholusia","s":890}},{"type":"quest","id":"69098","obj":{"i":69098,"n":"Bringing the Nibbles","g":114,"l":"Kholusia","s":8210}}]}