{"quest":{"name":"Learning to Lali-ho","location":"Kholusia","id":69095,"patch":5.0,"sort":8260,"icon":100864,"unlocksFunction":1,"eventIcon":71341,"issuer":1030786,"target":1030776,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ronitt is ready to return to Tomra.","Ronitt has built up his courage, meaning to greet the first friendly person he sees upon his return to the village. He asks that you follow him back into Tomra, and witness his attempts to perform a proper greeting.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Ronitt's first attempt is spoiled by an attack of nerves, and the object of his salutation flees in surprise. Not willing to give up, Ronitt moves on to his second target...","Once again, Ronitt's nerves get the best of him. For a moment, he is assailed by doubt, but seeing you there at his side gives him the courage to forge on. Maybe this time...","The young dwarf approaches Xemutt and digs down deep to unleash a thunderous “lali-ho.” The sheer volume of the greeting draws a small crowd of villagers, shocked to see a side of Ronitt they never knew existed. Overjoyed with his success, Ronitt suggests you go with him to visit his mother, Beott, and share the happy news.","Beott is overjoyed to witness the change that has come over her son, and showers you with gratitude. For his own part, Ronitt seems eager to continue shouting out lali-hos and building on the new friendships he has found."],"objectives":["Speak with Ronitt.","Speak with Beott."],"dialogue":[{"name":"RONITT","text":"I'm ready! Are you ready!?"},{"name":"RONITT","text":"I-I'm goin' back into that village to give them my best “lali-ho”!"},{"name":"RONITT","text":"...Y-You <span class=\"emphasis\">are</span> comin' with me, ain't you?"},{"name":"RONITT","text":"&lt;gulp&gt; Good. I'll s-start with one of the friendlier folks. Here we go!"},{"name":"RONITT","text":"L-La... L-Lali... La-Lali...hrngh!"},{"name":"VILLAGERA03559","text":"Gah!"},{"name":"VILLAGERA03559","text":"Heaving hobgoblins, Ronitt! Are you mad at me or something!?"},{"name":"RONITT","text":"&lt;grumble&gt; Can't give up yet! Maybe someone quieter. Gently, now..."},{"name":"VILLAGERA03559","text":"Aye? What can I do for you, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>?"},{"name":"RONITT","text":"Lali... Lali-li... Urgh!!!"},{"name":"VILLAGERB03559","text":"Eeek!"},{"name":"VILLAGERB03559","text":"I-I gave it back, Ronitt, I swear! I don't have your hammer!"},{"name":"RONITT","text":"&lt;sigh&gt; My nerves keep gettin' the best of me. Maybe I should just stick to automata..."},{"name":"RONITT","text":"No! I can do this! I'll not let you down after all you've done for me!"},{"name":"VILLAGERB03559","text":"Wh-What do you want with me!?"},{"name":"RONITT","text":"......"},{"name":"XEMUTT","text":"Hello, young Ronitt. Was there something you needed?"},{"name":"RONITT","text":"La... Lali... Lali..."},{"name":"RONITT","text":"Ugh...?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You can do it, Ronitt!"},{"name":"A2","text":"Be the dwarf you want to be!"},{"name":"RONITT","text":"La... Lali-ho..."},{"name":"RONITT","text":"&lt;inhale&gt; LALI-HOOOOOO!!!"},{"name":"XEMUTT","text":"Lali-ho!"},{"name":"XEMUTT","text":"Now that's what I call a greeting, dear. Well done!"},{"name":"VILLAGERA03559","text":"I've never heard a “lali-ho” like that before, Ronitt! You damn near knocked me off my feet!"},{"name":"VILLAGERB03559","text":"Aye! I almost thought you were going to strike old Xemutt there!"},{"name":"XEMUTT","text":"How ridiculous. Our Ronitt would never do such a thing."},{"name":"XEMUTT","text":"He's a bit excitable, I'll grant you, but those angry words don't speak for his sweet heart. Who do you think dreamed up and built my helpful automaton here? It's even strong enough to carry <span class=\"emphasis\">me</span> should I need it!"},{"name":"XEMUTT","text":"Now, Ronitt, you've shown what you can do. How about you give a nice greeting to these good folk as well?"},{"name":"RONITT","text":"Lali-ho!"},{"name":"VILLAGERA03559","text":"Lali-ho, Ronitt! I fear I may've misjudged you..."},{"name":"VILLAGERB03559","text":"Lali-hooo! Ah, a good greeting is so reassuring! And here I thought you didn't like me!"},{"name":"VILLAGERA03559","text":"Nor me! If you've the time, I'd like to see the plans for that helper you built. An automaton strong enough to carry a full-grown dwarf...incredible!"},{"name":"RONITT","text":"O-Of course I don't dislike any of you! And I'd be glad to share how I built my inventions!"},{"name":"VILLAGERB03559","text":"That's a promise, then! We'll be seeing you, Ronitt!"},{"name":"RONITT","text":"I... I can't believe it..."},{"name":"XEMUTT","text":"Good for you, dear.<br>I think a little gratitude towards your friend here might be in order, hmmm? Now, if you'll excuse me, this old lady has things to do and nary enough time to do them in..."},{"name":"RONITT","text":"Did you see that!?"},{"name":"RONITT","text":"I <span class=\"emphasis\">greeted</span> people...properly! And they greeted me back! Folk want to talk to me for the first time in my life, and it's all thanks to you!"},{"name":"RONITT","text":"Oh! You have to come and meet my mother again─so I can introduce her to my friend!"},{"name":"XEMUTT","text":"Yes, dear?"},{"name":"BEOTT","text":"Oh, hello, you two! Lali-ho!"},{"name":"RONITT","text":"Lali-ho!"},{"name":"BEOTT","text":"Well, polish my helm and shine my horns! Ronitt, you've learned to give a proper greeting!"},{"name":"RONITT","text":"Heh heh, nothin' to it! I, uh, had a little help from a friend, though!"},{"name":"BEOTT","text":"Well, well, well...<br>What did I tell you, eh? I knew you'd be a good influence on my Ronitt!"},{"name":"BEOTT","text":"You've done for him what his own mother couldn't, and for that I'm deeply thankful. I never thought I'd see the day..."},{"name":"RONITT","text":"Aye, it's the oddest thing. After I'd managed the first “lali-ho,” the next one came easier...and now I never want to stop!"},{"name":"RONITT","text":"Well, I'm guessin' you've got places to be. Just be sure to come back and visit sometime! ...N-Not that I'll be lonely or anythin'!"},{"name":"RONITT","text":"See you soon, <span class=\"highlight\">Forename</span>!"},{"name":"RONITT","text":"Heh heh! I've never felt so happy!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Lali-ho</span>!"}],"reward":{"gil":788,"emote":"Lali-ho"},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69094]},"next":[69096]},"partials":[{"type":"npc","id":"1030786","obj":{"i":1030786,"n":"Ronitt","l":2954,"q":2}},{"type":"npc","id":"1030776","obj":{"i":1030776,"n":"Beott","l":2954,"q":2}},{"type":"quest","id":"69094","obj":{"i":69094,"n":"A Practiced Greeting","g":114,"l":"Kholusia","s":8250,"f":1}},{"type":"quest","id":"69096","obj":{"i":69096,"n":"Ronitt to the Rescue","g":114,"l":"Kholusia","s":8270,"f":1}}]}