{"quest":{"name":"A Disagreeable Dwarf","location":"Kholusia","id":69092,"patch":5.0,"sort":8230,"icon":100864,"unlocksFunction":1,"eventIcon":71341,"issuer":1030776,"target":1030800,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Beott welcomes you to the village of Tomra.","Beott welcomes you to the village of Tomra with a hearty “lali-ho.” To her dismay, however, it seems that her son, Ronitt, risks becoming a social outcast for his reluctance to maintain the same level of dwarven etiquette. She begs you to befriend the unfriendly boy, hoping that the rarity of a stranger's presence will help draw Ronitt out of his thorny shell...<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Beott introduces you to Ronitt, and the rebellious lad responds to the simplest interactions with snarls and posturing. Following your attempts at a brief “conversation,” it becomes clear that Ronitt has misplaced a family heirloom once belonging to a famous blacksmith. Beott sends the boy off to continue the search, and asks you to question villagers on the hammer's whereabouts.","You speak with an affable townsdwarf. He commends you on your fine dwarven manners before pointing out another villager who may have picked up the hammer in question.","You soon learn that the timid townsdwarf did indeed retrieve Ronitt's carelessly misplaced heirloom. Taking charge of the hammer, you set off to return it to its owner.","You hand the hammer back to Ronitt, who grudgingly admits that you may not be the worst person he's ever met after all. Beott once more urges you to be a friend to her son, before leaving the two of you alone in uncomfortable companionship..."],"objectives":["Speak with Beott.","Speak with the affable townsdwarf.","Speak with the timid townsdwarf.","Deliver Watts's hammer to Ronitt."],"dialogue":[{"name":"BEOTT","text":"Well scuff my helm, if it ain't that traveler we've been hearing about! And the elder's had more'n a few things to say!"},{"name":"BEOTT","text":"Well scuff my helm, if it ain't that foreign dwarf we've been hearing about! Well, well, well, well!"},{"name":"BEOTT","text":"I'd best be giving you a proper welcome then, eh?<br>Lali-ho!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Lali-ho!"},{"name":"A1","text":"......"},{"name":"BEOTT","text":"Now that's what I like to see─a “lali-ho” straight from the heart!"},{"name":"BEOTT","text":"...To be expected, I suppose─outsiders can't never get the greeting right the first time! Never mind, never mind!"},{"name":"BEOTT","text":"I only wish my own boy would put a bit more effort into his “lalis” and his “hos.” He's always busy fiddling with his damn automata; no time for swapping words with folk of flesh and blood."},{"name":"BEOTT","text":"Every dwarf knows that a “lali-ho” gets a “lali-ho,” or you're asking to become an outcast... A mother does worry, she does."},{"name":"BEOTT","text":"And that's only the half of it! I know it's just a stage all lads go through, but the little bugger has to argue with every word I say!"},{"name":"BEOTT","text":"...Oh, I've just had the most clever idea!"},{"name":"BEOTT","text":"He'll not listen to me or the other villagers, but maybe─just maybe─curiosity for a stranger will win out over that sour attitude of his. Worth a try, don't you think?"},{"name":"BEOTT","text":"Please, befriend my son, Ronitt. Just...get him used to giving a proper greeting. That's all I ask."},{"name":"BEOTT","text":"And I tell you, he really is a marvel with automata! If you end up getting along, he might even show you a few of his stranger contraptions!"},{"name":"BEOTT","text":"Roooniiitt! Look, we've got a visitor! Why don't you say hello?"},{"name":"RONITT","text":"Who're you, then?"},{"name":"RONITT","text":"What!? You got somethin' to say to me!?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Lali-ho!"},{"name":"A2","text":"Hi-ho!"},{"name":"A2","text":"Rally-ho!"},{"name":"RONITT","text":"Oh...you...know our greeting... Hmph."},{"name":"RONITT","text":"Huh? Th-That's not how we... Hmph."},{"name":"RONITT","text":"What kinda greeting is that!? A-Are you tryin' to impress me, or somethin'? I... Hmph."},{"name":"RONITT","text":"L-Lali... &lt;mumble&gt; &lt;mumble&gt;"},{"name":"BEOTT","text":"Oh, Ronitt, my lad, you can do better than that! Head up, eyes front! No need to be shy!"},{"name":"RONITT","text":"I-I'm not bein' shy! I'm <span class=\"emphasis\">stoic</span>!"},{"name":"BEOTT","text":"Yes, dear, if you say so. Now, Ronitt, is everything else alright? You seemed to be looking for something...?"},{"name":"RONITT","text":"Oh, no, it's just... I mean, I sorta...lost my hammer."},{"name":"BEOTT","text":"You WHAT!? Of all the irresponsible, careless, foolish..."},{"name":"BEOTT","text":"Ronitt's hammer has been in the family for generations! It's a priceless heirloom that once belonged to Watts, the blacksmith of legend himself!"},{"name":"BEOTT","text":"Well, what're you standing around for, boy! Find that hammer! <span class=\"emphasis\">We</span> will do what we can to help."},{"name":"BEOTT","text":"Right, why don't you have a chat with some villagers for me and ask if they've seen Ronitt's hammer. Just remember your dwarven manners, and all will be well!"},{"name":"RONITT","text":"Odd, I swear I was just holdin' it..."},{"name":"RONITT","text":"Hm? What're you starin' at, eh!? Clear off!"},{"name":"VILLAGERA03556","text":"You want words with me, then?"},{"name":"Q3","text":"What will you do?"},{"name":"A3","text":"Give a dwarven greeting."},{"name":"A3","text":"Give an Eorzean greeting."},{"name":"VILLAGERA03556","text":"Oho! That's a fine “lali-ho” you've got there, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. I like you!"},{"name":"VILLAGERA03556","text":"...Hm? <span class=\"alternative-container\"><span class=\"alternative\">She's</span><span class=\"alternative\">He's</span></span> trying to tell me something, I just know it..."},{"name":"VILLAGERA03556","text":"Ronitt...? Ah, that sulky sprout's lost old Watts's hammer, has he? Well lucky for him, I believe yon gentledwarf picked it up!"},{"name":"VILLAGERA03556","text":"It's time I was getting back to work, then. Good day to you, stranger!"},{"name":"VILLAGERB03556","text":"Y-You...you're talking to m-me?"},{"name":"Q4","text":"What will you do?"},{"name":"A4","text":"Give a dwarven greeting."},{"name":"A4","text":"Give a Far Eastern greeting."},{"name":"VILLAGERB03556","text":"Wh-What's this!? A perfect “lali-ho”!? Y-You're no ordinary traveler, I see!"},{"name":"VILLAGERB03556","text":"Argh! Wh-Why is <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> showing me the top of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> h-head!? Has <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> no <span class=\"emphasis\">shame</span>!?"},{"name":"VILLAGERB03556","text":"...The h-hammer I picked up? Aye, I reckoned I would hand it over to the elder for safekeeping. Y-You're saying it belongs to young R-Ronitt?"},{"name":"VILLAGERB03556","text":"Well, h-he can be a touch sh-shouty, that boy... D-Do you think you could take it back to him for m-me?"},{"name":"VILLAGERB03556","text":"Th-That's my part d-done, then!"},{"name":"RONITT","text":"Huh? Why are you still here!?"},{"name":"RONITT","text":"Wait! This...this is my hammer!!!"},{"name":"BEOTT","text":"Well, well, well, well. Would you look at that!"},{"name":"BEOTT","text":"You see, Ronitt? Give the right and proper greeting, and folk'll be glad to share a bit of kindness. Could be that you've a thing or two to learn from <span class=\"highlight\">Forename</span> here."},{"name":"RONITT","text":"<span class=\"emphasis\">Huh</span>!? Are you lecturin' me again!?"},{"name":"RONITT","text":"Aye, well, maybe... Maybe you're not such a bad sort."},{"name":"RONITT","text":"I'll just put the hammer in a safe place somewhere... I mean to be a famous smitty myself someday, so I'd best not lose it again!"},{"name":"BEOTT","text":"I'll leave you to it, then. I know my boy's not the easiest to get along with, <span class=\"highlight\">Forename</span>, but he could sure use a friend like you!"},{"name":"RONITT","text":"I don't need a friend! I don't need anyone!"},{"name":"RONITT","text":"We...we're not goin' to be friends, understand!? But you can stay around a little longer. If you want."},{"name":"RONITT","text":"S-So, now what!?"},{"name":"BEOTT","text":"Well, now, what's that you've got there?"}],"reward":{"gil":788,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69173]},"next":[69093]},"partials":[{"type":"npc","id":"1030776","obj":{"i":1030776,"n":"Beott","l":2954,"q":2}},{"type":"npc","id":"1030800","obj":{"i":1030800,"n":"Ronitt","l":2954,"q":4}},{"type":"quest","id":"69173","obj":{"i":69173,"n":"Meet the Tholls","g":8,"l":"Kholusia","s":890}},{"type":"quest","id":"69093","obj":{"i":69093,"n":"Almost a Friend","g":114,"l":"Kholusia","s":8240,"f":1}}]}