{"quest":{"name":"With Ale Due Respect","location":"Kholusia","id":69091,"patch":5.0,"sort":8180,"eventIcon":71221,"issuer":1027483,"target":1027483,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Riott seems eager to share the customs of Tomra."],"objectives":["Slay Scree gnomes and obtain gnome soulstones.","Deliver the gnome soulstones to Riott.","Use the bottles of Tomran stonebrew on Zigutt's statue.","Speak with Riott."],"dialogue":[{"name":"RIOTT","text":"Lali-ho! Well, dent my helm with a knocker's arse! We've got ourselves a visitor─a <span class=\"alternative-container\"><span class=\"alternative\">stranger</span><span class=\"alternative\">strange dwarf</span></span> from a strange land!"},{"name":"RIOTT","text":"If I'm to welcome you properly to Tomra, then I'd best be teachin' you our ways, eh? And that starts with payin' respects to Zigutt's statue!"},{"name":"RIOTT","text":"...Ah, you wouldn't know your Riotts from your Ronitts, would you? The “Zigutt” I'm referrin' to is one of our ancestral chiefs─the mightiest warrior in Tholl history! You remember that name, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"RIOTT","text":"Now, first things first, we need to prepare the offering. That involves you bringin' me a couple of soulstones from them rock-headed gnomes out in Scree. Try not to get flattened, eh?"},{"name":"RIOTT","text":"First off, we need two soulstones! You've got to take 'em from Scree gnomes, and let me tell you: they ain't goin' to cooperate!"},{"name":"RIOTT","text":"Let's have them soulstones, then!"},{"name":"RIOTT","text":"Now, I'll just get my hammer out here and...&lt;crunch&gt;...ever so delicately...&lt;crack&gt;...grind these into powder!"},{"name":"RIOTT","text":"And there we have it! Some lovely bottles of stonebrew, seasoned with a sprinkling of gnomish soulstone!"},{"name":"RIOTT","text":"It's the soulstone what puts the “stone” in the brew. I mean, how else do you expect a statue to drink it!?"},{"name":"RIOTT","text":"Now for the ceremonial bit. You take these bottles, and empty 'em onto the four sides of Zigutt's statue over there. Every last drop, mind you!"},{"name":"RIOTT","text":"What are you waitin' for? Zigutt must be as parched as a squid in the desert after standin' in that square day after day!"},{"name":"SYSTEM","text":"As you pour the stonebrew onto the base of the statue, you almost believe you see a smile flickering across its impassive face..."},{"name":"RIOTT","text":"Aye, nicely done, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, nicely done!"},{"name":"RIOTT","text":"You may have noticed, but we Tholls like a drink or two. And seein' the great Zigutt unable to hoist a tankard on account of him bein' a stone statue brings a tear to the eye. And so we honor his memory with the brew he loved best."},{"name":"RIOTT","text":"He was chief of the Tholl during the coming of the Flood─a true dwarf among dwarves! It was him what ousted that bastard Warrior of Light, and brought our people together in a time when division meant death!"},{"name":"RIOTT","text":"Aye, we wouldn't be here now if it weren't for Zigutt. And I thank you for showin' him the proper respect!"}],"reward":{"gil":951},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69173]}},"partials":[{"type":"npc","id":"1027483","obj":{"i":1027483,"n":"Riott","l":2954,"q":1}},{"type":"quest","id":"69173","obj":{"i":69173,"n":"Meet the Tholls","g":8,"l":"Kholusia","s":890}}]}