{"quest":{"name":"Ronitt to the Rescue","location":"Kholusia","id":69096,"patch":5.0,"sort":8270,"icon":100865,"unlocksFunction":1,"eventIcon":71341,"issuer":1030800,"target":1030788,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Ronitt looks pleased to see you.","Ronitt once more expresses his gratitude to you for helping him improve his less-than-impressive dwarven manners. Now, however, the ambitious blacksmith wishes to locate a fine drop of grog to properly fuel his inventive urges. Your mention of Wright ale piques his interest, and he bids you to accompany him to speak to the village's mayor.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Ronitt's request for Wright's finest ale is met with disappointment as Sai-Lewq and Eueliss explain the poor condition of their fields. The dwarf claims, however, that he may be able to help, and you find yourself being dragged back to the village of Tomra.","It seems that one of Xemutt's old stories holds a hint for solving the problem of Wright's underfed soil─a mineral known as rock phosphate. Xemutt directs Ronitt towards the former trading town of Amity, where a sample of rock phosphate might still be found.","Your arrival in Amity causes a small stir, but Ronitt's fine manners help secure you a warm welcome. Before long, a resident has given you leave to search the old trading crates for a chunk of rock phosphate.","You prise open a weathered wooden box to reveal the yellow-hued object of your search. Deliver the mineral sample to Ronitt.","An excited Ronitt accepts the chunk of rock phosphate and explains his plans to construct a mineral-sensing automaton. While he is occupied with building his invention, he asks that you visit the mayor of Wright to arrange a rendezvous.","You pass on Ronitt's plans to Sai-Lewq and Eueliss. Though somewhat dubious, the pair agree to accompany you to Tomra and the scheduled meeting place.","You arrive with your guests from Wright just in time for Ronitt to provide a demonstration of his automaton's phosphate-finding capabilities. Much to the surprise of Sai-Lewq and Eueliss, the “Orehound Ogre” soon returns with a barrow full of the yellow rock. The trundling contraption─and the ensuing commotion─attracts the attention of Chief Xamott, who heaps praise upon his diligent Tholl kin. Sai-Lewq then proceeds to strike a deal with the eldermost elder: ownership of the rock phosphate in return for a future delivery of the finest Wright ale. It seems you and Ronitt have helped forge a new bond between the villages of Wright and Tomra, and both parties agree that your timely involvement has changed their fates for the better."],"objectives":["Speak with Sai-Lewq.","Speak with Ronitt.","Investigate the weathered trading crate.","Deliver the chunk of rock phosphate to Ronitt.","Speak with Sai-Lewq.","Speak with Ronitt near Tomra."],"dialogue":[{"name":"RONITT","text":"<span class=\"highlight\">Forename</span>! I was hopin' you'd come back to see me!"},{"name":"RONITT","text":"Heh heh, lali-ho!"},{"name":"RONITT","text":"After you left, I said a “lali-ho” to every soul I could find, and now the whole village has started talkin' to me!"},{"name":"RONITT","text":"A couple of the lads are even helpin' me to invent some new automata. Aye, I'm well on my way to becomin' the most famous smitty in Tomra!"},{"name":"RONITT","text":"But if I'm to be a <span class=\"emphasis\">truly</span> legendary blacksmith, there's just one little thing I'm missin'..."},{"name":"RONITT","text":"A good drop of grog!"},{"name":"RONITT","text":"It ain't that Tomra's brews are bad, but if I could get my hands on an extra-fine fermented beverage, then I reckon my work would really take off!"},{"name":"RONITT","text":"So! Any idea where I might find a barrel of the good stuff?"},{"name":"RONITT","text":"Wright ale...? And this drink once put their village on the map, eh? Well, then, I'd best take a trip down the cliff and have a chat with their leader!"},{"name":"RONITT","text":"...Y-You're comin' with me, ain't you!?"},{"name":"SAILEWQ","text":"Well, look who it is!"},{"name":"EUELISS","text":"<span class=\"highlight\">Forename</span>! How wonderful to see you again!"},{"name":"SAILEWQ","text":"Since last you were here, I have been officially appointed as mayor of Wright. As such, my days have grown busy with visits to neighboring settlements to reacquaint myself with the region's politics. My old bones protest at the exercise, to say naught of the strain upon my rusty faculties..."},{"name":"EUELISS","text":"Speaking of visits, I see you've arrived with a companion...?"},{"name":"RONITT","text":"A-Aye! I'm Ronitt, of Tomra village! Don't think just because I'm smaller'n you that─! Er, I mean..."},{"name":"RONITT","text":"Lali-ho!!!"},{"name":"EUELISS","text":"Lali...ho? Oh! I've heard of this! It's a traditional dwarven greeting, is it not?"},{"name":"SAILEWQ","text":"I see. Well, let us not ignore the customs of our guest."},{"name":"SAILEWQ","text":"Ahem. ...Lali-ho!"},{"name":"EUELISS","text":"Lali-ho!"},{"name":"RONITT","text":"Heh. Heh heh heh!<br>Not bad for first-timers! Not bad at all! Everyone's happy when their “lali-ho” gets a “lali-ho”!"},{"name":"RONITT","text":"Now, let's see a barrel of your tastiest grog!"},{"name":"SAILEWQ","text":"I...beg your pardon!?"},{"name":"EUELISS","text":"I'm not sure I follow..."},{"name":"SAILEWQ","text":"Ah... Well I'm afraid we're still struggling to improve the fertility of the land itself. As yet, we're unable to grow barley of sufficient quantity and quality to brew the ale for which we were once famous."},{"name":"EUELISS","text":"Aye, it's a matter of trial and error at this point. I am sorry to disappoint you..."},{"name":"RONITT","text":"Here now, what's with the sour faces!? You just need somethin' to liven up the soil, am I right!?"},{"name":"SAILEWQ","text":"You've some experience with cultivating fields, Master Ronitt?"},{"name":"RONITT","text":"Heh, not exactly...but I think I might be able to help all the same!"},{"name":"RONITT","text":"Come on, <span class=\"highlight\">Forename</span>! We need to make a quick trip back to Tomra!"},{"name":"EUELISS","text":"Can he truly help us feed our fields? It sounds too good to be true..."},{"name":"SAILEWQ","text":"I've no idea what Master Ronitt's plans might be, but with you involved, we can at least rest easy that naught bad will come of them."},{"name":"RONITT","text":"Feels like everyone's starin' at me. Maybe this wasn't such a good idea..."},{"name":"EUELISS","text":"A dwarf visitor...? How unusual."},{"name":"RONITT","text":"About time you showed up! See, I remembered somethin' Xemutt told me once."},{"name":"RONITT","text":"Xemutt! Can you tell me that story about Amity again? The bit about the trading goods?"},{"name":"RONITT","text":"The villagers in Wright are havin' trouble growin' crops in their scratchy fields, and I wanted to do somethin' to help."},{"name":"XEMUTT","text":"Hmmm. You're thinking of the rock phosphate we used to trade to Eulmore?"},{"name":"RONITT","text":"Rock...phosphate? And that's the fertilizer, is it?"},{"name":"XEMUTT","text":"Aye. Crushed into small bits, you can spread it over a field to enrich the soil. But the old seam was mined out years ago, and I've not heard if we've come across another..."},{"name":"RONITT","text":"That sounds perfect...you know, aside from there not bein' any left. No one kept a stockpile, then?"},{"name":"XEMUTT","text":"Well, they might still have a chunk or two over in Amity. That was where the old trading house used to stand─neutral ground and all."},{"name":"RONITT","text":"Right! To Amity I go! I-I suppose you'd best come along!"},{"name":"XEMUTT","text":"That boy's come a long way in a short time, and I've a good idea why. Our Ronitt's lucky to have a friend like you."},{"name":"XEMUTT","text":"Visiting with young Ronitt again, are you?"},{"name":"RONITT","text":"R-Right!"},{"name":"RONITT","text":"La-La... Lali-ho!"},{"name":"AMITYVILLAGER03560","text":"Well now, if it isn't one of the Tholls, come to visit. And a fine “lali-ho” to you, sir!"},{"name":"RONITT","text":"I-I've come lookin' for rock phosphate! I just need a handful...assumin' you've got any!"},{"name":"AMITYVILLAGER03560","text":"The yellowish fertilizer stuff? Hm, I reckon we had some stashed away someplace."},{"name":"AMITYVILLAGER03560","text":"Might be as you'll find a hunk of it hidin' in one of the old tradin' crates. Go ahead and take a handful, if that's all you want."},{"name":"RONITT","text":"I can just have it!? Th-That's very kind of you!"},{"name":"RONITT","text":"Phew! I'm glad you were here─still a bit nervous greetin' outsiders."},{"name":"RONITT","text":"Anyway, let's get to crackin' open these crates. Keep an eye out for anythin' yellow and lumpy!"},{"name":"AMITYVILLAGER03560","text":"Now that's a Tholl, if I'm not mistaken."},{"name":"SYSTEM","text":"You find a small chunk of yellow-hued stone! It appears to match the description of rock phosphate."},{"name":"RONITT","text":"If I was a hunk of rock phosphate, where would I be...?"},{"name":"RONITT","text":"Any luck on your end?"},{"name":"RONITT","text":"Aye, just look at that color─this has to be the stuff!"},{"name":"RONITT","text":"Now I've got a good-sized sample, I can build an automaton to sniff out a new seam of phosphate. This'll be one of my best inventions yet!"},{"name":"RONITT","text":"While I'm throwin' that together, I need you to head back to Wright and tell those folk to meet me on the west side of Tomra. I'll make sure everythin's assembled and ready afore you arrive!"},{"name":"SAILEWQ","text":"...A mineral fertilizer, you say? The name does sound vaguely familiar."},{"name":"EUELISS","text":"We've experimented with all manner of compost over the years, but I'm willing to try anything to rejuvenate our fields! I wonder if another seam of this precious rock can still be found..."},{"name":"SAILEWQ","text":"We can but put our faith in Master Ronitt. Come, let us not be late for our meeting."},{"name":"EUELISS","text":"Even if naught comes of this, I want you to know we appreciate all you've done!"},{"name":"RONITT","text":"Oh good, I'd just finished testin' my new model!"},{"name":"RONITT","text":"Behold the mineral-findin' marvel that is the Orehound Ogre!"},{"name":"SAILEWQ","text":"S-Such a...<span class=\"emphasis\">colorful</span> name. And this contraption is meant to sniff out phosphate for us, is it?"},{"name":"RONITT","text":"Heh heh, you just watch and see!"},{"name":"AUTOMAN03560","text":"&lt;bzzzt&gt; &lt;click&gt; Sensors activated."},{"name":"EUELISS","text":"Is that...what I think it is!?"},{"name":"SAILEWQ","text":"Astounding! You invented a servant to not only track down rock phosphate, but also carve it out and cart it back!? How did you accomplish such a feat?"},{"name":"RONITT","text":"Heh heh! You learn a thing or two when you aim to be the best damn blacksmith this village ever saw!"},{"name":"XAMOTT","text":"I thought that trundlin' bucket of bolts would lead me to you, young Ronitt!"},{"name":"RONITT","text":"Th-The eldermost elder!"},{"name":"SAILEWQ","text":"Ah, you must be Chief Xamott. I am Sai-Lewq, mayor of Wright. Master Ronitt here was just─"},{"name":"XAMOTT","text":"No need to explain─Xemutt already told me everythin'!"},{"name":"XAMOTT","text":"It seems you've been workin' your beard thin for Wright's folk and their harvestin' woes, eh? A fine example of Tholl diligence, my boy!"},{"name":"EUELISS","text":"Master Ronitt, we are truly grateful for the lengths to which you have gone to assist us in our hour of need..."},{"name":"RONITT","text":"N-Now hold on a moment! I'm only doin' this so's I can get some fine ale to drink..."},{"name":"XAMOTT","text":"Ale!? You're too young to drink, you snot-nosed stripling! What's wrong with admittin' you was just tryin' to help!?"},{"name":"RONITT","text":"Chief Xamott! You can't say it straight out like that! I'm buildin' an <span class=\"emphasis\">image</span> here!"},{"name":"SAILEWQ","text":"Hm hm...hahaha! Gahahaha!"},{"name":"SAILEWQ","text":"With your permission, Chief Xamott, we should like to take this rock phosphate back to our village."},{"name":"SAILEWQ","text":"You have our promise that we shall put it to good purpose...and one day return the favor with our best barrel of Wright ale."},{"name":"XAMOTT","text":"That's a deal I can get behind! Aye, I think it's high time we Tholls reopened trade with our neighbors!"},{"name":"RONITT","text":"Heh heh! Just leave the delivery to me! But first I need to speak with my friends and build a few more Orehounds!"},{"name":"EUELISS","text":"Did you hear that, sir? Instead of Talos, we shall soon have a line of automata rolling into the village!"},{"name":"SAILEWQ","text":"Once more have you shown us the path forward. And that is not the only thing I must thank you for─I don't think I've enjoyed such a heartfelt laugh in many a moon!"},{"name":"EUELISS","text":"I bless the day you came into our lives and changed our fate for the better. This kindness will not be forgotten!"},{"name":"RONITT","text":"A-And I could say much the same! I'd still be alone with my automata if you hadn't come along when you did. All them folk who gave me wary frowns now greet me with a smile!"},{"name":"RONITT","text":"Well, I'd best be headed off! If I'm to be known as “Master Ronitt, the Greatest Blacksmith Who Ever Lived,” then I've still got plenty of work to do! I'll be seein' you, <span class=\"highlight\">Forename</span>!"}],"reward":{"gil":1733,"items":[{"num":2,"id":27872,"one":1},{"num":2,"id":27873,"one":1},{"num":2,"id":27874,"one":1},{"num":2,"id":27875,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[68910,69095]},"next":[69432]},"partials":[{"type":"npc","id":"1030800","obj":{"i":1030800,"n":"Ronitt","l":2954,"q":4}},{"type":"npc","id":"1030788","obj":{"i":1030788,"n":"Ronitt","l":2954,"q":1}},{"type":"item","id":"27872","obj":{"i":27872,"n":"Masala Chai","l":412,"c":24410,"t":46}},{"type":"item","id":"27873","obj":{"i":27873,"n":"Risotto al Nero","l":415,"c":24028,"t":46}},{"type":"item","id":"27874","obj":{"i":27874,"n":"Espresso con Panna","l":415,"c":24407,"t":46,"p":3690}},{"type":"item","id":"27875","obj":{"i":27875,"n":"Mist Spinach Saute","l":415,"c":24152,"t":46,"p":3690}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"68910","obj":{"i":68910,"n":"Wright for the Job","g":114,"l":"Kholusia","s":1213,"f":1}},{"type":"quest","id":"69095","obj":{"i":69095,"n":"Learning to Lali-ho","g":114,"l":"Kholusia","s":8260,"f":1}},{"type":"quest","id":"69432","obj":{"i":69432,"n":"It's Dwarfin' Time","g":60,"l":"Kholusia","s":1,"f":1}}]}