{"quest":{"name":"Goggeo and Tholliet","location":"Kholusia","id":69090,"patch":5.0,"sort":8170,"eventIcon":71221,"issuer":1030816,"target":1030816,"genre":114,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The concerned townsdwarf is wrestling with her worries."],"objectives":["Speak with the sulking townsdwarf.","/cheer up the sulking townsdwarf.","Speak with the concerned townsdwarf."],"dialogue":[{"name":"GOSSIP03554","text":"I hope she'll be all right..."},{"name":"GOSSIP03554","text":"Oh, lali-ho! Sorry, I was off in my own little world there..."},{"name":"GOSSIP03554","text":"I just can't shake the sight of it─my best friend, meeting in secret with one of them filthy, no-good Goggs. If the others were to hear about this, her honor would be forfeit!"},{"name":"GOSSIP03554","text":"So can you believe I saw her heading out into Scree─alone─not a few moments ago? At least she had the decency to hang her head in shame. Please, stranger, I need you to convince her to stop this madness while I keep the chief's attention elsewhere."},{"name":"DWARF03554","text":"...Come back to the village? No, I bloody well will not! I need to be alone. Have you never felt the pain of heartbreak!?"},{"name":"DWARF03554","text":"Argh! I m-mean... Just go away!"},{"name":"DWARF03554","text":"...Bah, I might as well tell you now, eh? I was in love with a Gogg."},{"name":"DWARF03554","text":"It all began the day a cliffkite attacked me as I was coming home from the mines. <span class=\"emphasis\">He</span> saved me from becoming its dinner. He was strapping and sweet, and so I learned his patrol route. Brought him iguana tails, talked about sediment─you know, the usual stuff."},{"name":"DWARF03554","text":"Then, once we'd gotten to know each other, I confessed my feelings. But he refused me, saying he could never court a Tholl. Said it was impossible..."},{"name":"DWARF03554","text":"&lt;sniff&gt; I almost wish he'd left me for the cliffkite... But he's probably right. Who in Tomra would recognize our love? Who is there to <span class=\"highlight\">cheer</span> me on?"},{"name":"DWARF03554","text":"&lt;sniff&gt; Won't anyone <span class=\"highlight\">cheer</span> for our love...?"},{"name":"DWARF03554","text":"...Thank you. There'll be few enough kind words for me if news gets out. But I won't give up! I'll think of a way for my Gogg and I to be together!"},{"name":"GOSSIP03554","text":"I see you got my friend to come back, but she was in too much of a hurry to spare me a second glance. What happened out there?"},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Explain the situation."},{"name":"A1","text":"Keep your mouth shut."},{"name":"GOSSIP03554","text":"She fell in <span class=\"emphasis\">love</span> with him!? With a Gogg? Ugh, the chief can never know about this..."},{"name":"GOSSIP03554","text":"Not your place to say, eh? Well, I was meaning to talk to her about this anyway..."},{"name":"GOSSIP03554","text":"Thank you for your help, stranger. I'll do my best to keep her out of trouble!"}],"reward":{"gil":878},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69173]}},"partials":[{"type":"npc","id":"1030816","obj":{"i":1030816,"n":"Concerned Townsdwarf","l":2954,"q":1}},{"type":"quest","id":"69173","obj":{"i":69173,"n":"Meet the Tholls","g":8,"l":"Kholusia","s":890}}]}