{"quest":{"name":"Rite of Passage","location":"Lakeland","id":69106,"patch":5.0,"sort":9060,"eventIcon":71221,"issuer":1028316,"target":1028316,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Thafe of Weed appears to be ill at ease."],"objectives":["Search for Thafe's brother.","Search for relics in the ruins.","Deliver the relics to Thafe's brother.","Speak with Thafe."],"dialogue":[{"name":"THAFE","text":"Traveler! Oh, traveler! I don't mean to be a bother, but can you help me find my big brother?"},{"name":"THAFE","text":"All of a sudden, he started talking about having to prove his courage. Then he hopped on an amaro and flew off in the direction of the ruins above the village─all by himself! There are ghosts in that place! What if he doesn't come back? I don't want to be alone..."},{"name":"THAFE","text":"Can you ride an amaro, too? You sure look like you can! Maybe...maybe you could fly up there and find my brother for me? Pretty please?"},{"name":"THAFE","text":"If only I could ride an amaro, too... But my brother won't teach me. Says I'm too much of a coward and a baby. &lt;sniffle&gt; I...I just hope he's okay."},{"name":"BROTHER03570","text":"Wh-Who goes there!? I won't go down without a fight!"},{"name":"BROTHER03570","text":"...Oh. Thafe sent you? What a little baby. I swear, every time I so much as leave his sight he starts sniffling and sobbing. I <span class=\"emphasis\">told</span> him I was just coming here to perform our village's time-honored rite of passage."},{"name":"BROTHER03570","text":"Tradition has it that all boys of a certain age must fly here on the wings of an amaro, retrieve three treasures from the ruins, and bring them back to the village. Hey, I have an idea─since you came all the way up here, why don't you find something for yourself, too!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"This sounds promising."},{"name":"A1","text":"I think I'll pass."},{"name":"BROTHER03570","text":"That's the spirit! Now remember, it has to be <span class=\"emphasis\">three</span> relics: no more, and no less, or the ghosts'll get you! Ahahahaha!"},{"name":"BROTHER03570","text":"Awww, what's the matter? Are you afraid of ghosts like my <span class=\"emphasis\">baby</span> brother? Come on, it'll be fun! And remember, it has to be <span class=\"emphasis\">three</span> relics: no more, and no less, or the ghosts'll get you! Ahahahaha!"},{"name":"BROTHER03570","text":"Ready, then? All right, I'll race you!"},{"name":"SYSTEM","text":"You search, but find nothing of interest here..."},{"name":"BROTHER03570","text":"Look! I found my three relics! How many were <span class=\"emphasis\">you</span> able to find? Not as many as me, I bet!"},{"name":"BROTHER03570","text":"Aw, you found three, too? And we got back at the same time, so I guess that means it's a tie. Oh well! Anyhow, what are you waiting for? Show me what you've got!"},{"name":"BROTHER03570","text":"Wow! These look like the chains that were used on prisoners. And this stone tablet...that must be the cell number. And here's the key that opened the cell door!"},{"name":"BROTHER03570","text":"As you might have guessed, they say this place was used as a prison before the Flood. Of course, it couldn't hold anyone in now...except for the ghosts, of course! BOO! Hahaha!"},{"name":"BROTHER03570","text":"Anyhow, I should get back to the village before Thafe causes another flood with all his crying. So long, stranger!"},{"name":"THAFE","text":"Oh, it's you! Thank you so much for bringing my brother back. He said he fought off a hundred ghosts to bring back those treasures! I should have known not to worry about him."},{"name":"THAFE","text":"He also said he gave you a terrible beating in some sort of contest, and that you were sobbing from shame and embarrassment when he left. Is this true?"},{"name":"THAFE","text":"Well, this is our secret, but I got you a little something to make you feel better! It's not much, but it's all yours. So don't feel too bad, okay? Not everyone can be as brave as my brother, after all!"}],"reward":{"gil":752},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69183]}},"partials":[{"type":"npc","id":"1028316","obj":{"i":1028316,"n":"Thafe","l":2953,"q":1}},{"type":"quest","id":"69183","obj":{"i":69183,"n":"To Storm-tossed Seas","g":8,"l":"The Crystarium","s":990}}]}