{"quest":{"name":"Made, Not Born","location":"The Crystarium","id":69103,"patch":5.0,"sort":9030,"eventIcon":71221,"issuer":1031059,"target":1031059,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The drill instructor is concerned about one of his recent recruits."],"objectives":["Give the consolatory sandwich to the novice guard at Sweetsieve.","Speak with the drill instructor in Ballistics."],"dialogue":[{"name":"PLATOONLEADER03567","text":"Maybe a sandwich... Everyone likes sandwiches..."},{"name":"PLATOONLEADER03567","text":"Oh! If it isn't the Warrior of Darkness! What fortuitous timing."},{"name":"PLATOONLEADER03567","text":"I'm worried about one of our recruits, you see. He was one of the residents of Holminster Switch, and after the attack, he thought to join up, the better to protect those he loves..."},{"name":"PLATOONLEADER03567","text":"Alas, it's not so easy as all that, is it? And because his training isn't having as immediate an effect as he wished, he's become rather depressed. I know not what to say to him─as his superior, I fear that he will take my encouragement as chastisement."},{"name":"PLATOONLEADER03567","text":"If you spoke with him, however, he might take your words to heart. Can I ask you to attempt it? You will find him sighing to himself in Sweetsieve, like as not. Take him this, as well─I find that nothing so reliably lifts the spirits as a full stomach."},{"name":"PLATOONLEADER03567","text":"He needs to know that these things take time for everyone, I think. Heroes aren't made in a day!"},{"name":"RECRUIT03567","text":"Th-The Warrior of Darkness? You must be mistaken, you can't possibly have reason to speak with <span class=\"emphasis\">me</span>..."},{"name":"RECRUIT03567","text":"I... I don't know what to say. I don't deserve your kindness. I don't deserve your sandwich..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Nonsense. You've been working hard."},{"name":"A1","text":"Your instructor is worried about you."},{"name":"RECRUIT03567","text":"H-How do you know that!? I mean, I <span class=\"emphasis\">have</span> tried, but..."},{"name":"RECRUIT03567","text":"He is!? I never expected him to notice that I..."},{"name":"RECRUIT03567","text":"Well, I had hoped that this would go differently, I suppose. I'm in the guard now, yes, but my spear still feels heavy and awkward in my hands. My knees still shake when I'm in combat. It wasn't meant to be like this."},{"name":"RECRUIT03567","text":"It sounds pathetic when I say it out loud, doesn't it? I had resolved to be like you, who came to our rescue when everything was at its most hopeless. Yet here I am, discouraged at the first sign of difficulty."},{"name":"RECRUIT03567","text":"There's nothing for it but to face my own weakness, is there? To overcome it. It won't make me a hero, but...it's a step on that path. And seeing you again has reminded me that that's the path I want to follow, no matter what."},{"name":"PLATOONLEADER03567","text":"It seems that your mere presence was enough to restore his fighting spirit! I cannot thank you enough."},{"name":"RECRUIT03567","text":"Nor can I. Thank you for coming to me when I most needed it. I swear that I will do my utmost to follow your example in future!"},{"name":"RECRUIT03567","text":"Sir, may I join you on patrol? Quite frankly, I need the practice."},{"name":"PLATOONLEADER03567","text":"And you shall have it! With me, guardsman!"},{"name":"RECRUIT03567","text":"Thank you for reminding me where I ought to be."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69182]}},"partials":[{"type":"npc","id":"1031059","obj":{"i":1031059,"n":"Drill Instructor","l":2951,"q":1}},{"type":"quest","id":"69182","obj":{"i":69182,"n":"The Unbroken Thread","g":8,"l":"Lakeland","s":980}}]}