{"quest":{"name":"Bigger Fish to Dry","location":"Lakeland","id":69107,"patch":5.0,"sort":9070,"eventIcon":71221,"issuer":1027403,"target":1027403,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Casswren of Brick is tapping her foot and looking about impatiently."],"objectives":["Deliver the orders to the fishermen.","Deliver the dried fish to Casswren."],"dialogue":[{"name":"CASSWREN","text":"I say, whatever is keeping them!? My order of dried fish should have been here <span class=\"emphasis\">hours</span> ago! I've <span class=\"emphasis\">always</span> made my deliveries on time, and I don't expect that to change now!"},{"name":"CASSWREN","text":"Perhaps you could help me, friend. Three lazy-arse fishermen have yet to arrive with the dried fish they promised me, and I refuse to keep the guard waiting any longer!"},{"name":"CASSWREN","text":"You'll help? Thank you oh so much! Just take these three orders to the fishermen whose names are written on them, and remind the lazy sods of the bloody job they've so clearly forgotten about."},{"name":"CASSWREN","text":"Have you delivered the orders to the three fishermen yet? &lt;sigh&gt; I understand that many fishermen are leisurely types, but <span class=\"emphasis\">some</span> of us have a schedule to keep!"},{"name":"ORTWIL","text":"Aye? What can I do ye for?"},{"name":"ORTWIL","text":"The girl wanted dried fish, aye. I'm workin' on it, of course. It'll just be takin' a little more time, is all. Have to dry it out just right, ye see."},{"name":"ORTWIL","text":"Aye, tell the little miss her dried fish'll be swimmin' on over when they're good and ready."},{"name":"INCEN","text":"Hm? Yours is an unfamiliar face. Is there something you need?"},{"name":"INCEN","text":"Ah, the dried fish. I'm afraid there's been a misunderstanding. I went to make the delivery earlier, but the girl was nowhere to be found─perhaps we just missed each other. Anyhow, here they are, and tell her she's lucky─this is the tastiest batch I've made all week."},{"name":"INCEN","text":"It appears the girl and I missed each other. Pray apologize to her on my behalf, and tell her that I hope the sheer scrumptiousness of my fish makes up for it."},{"name":"YALMET","text":"...Yes?"},{"name":"YALMET","text":"Yes, I have what the girl seeks. Unfortunately, my tasks keep me here. Perhaps you could deliver the fish in my stead?"},{"name":"YALMET","text":"There you have it. And tell the girl that I am certain that my product will prove worth the wait."},{"name":"CASSWREN","text":"There you are! Well? I hope those fishermen gave you my fish and not more excuses!"},{"name":"CASSWREN","text":"...I see. Well, I suppose that's about the best I could've hoped for. Thank you, friend. The guard are notoriously picky about both the quality and quantity of the rations they order, and I take pride in giving them precisely what they want."},{"name":"CASSWREN","text":"After all, if they weren't here to keep us safe, we'd be doing a lot less fishing and cooking, and a lot more fighting and dying. That's why I simply <span class=\"emphasis\">refuse</span> to keep them waiting. I understand that the fishermen have their pride as well, but sometimes a job just has to be done."},{"name":"CASSWREN","text":"Anyhow, I'm sorry for asking you to be my delivery <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>─I'm sure you have much more important things to do. Please accept this as just a small token of my gratitude!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69183]}},"partials":[{"type":"npc","id":"1027403","obj":{"i":1027403,"n":"Casswren","l":2953,"q":1}},{"type":"quest","id":"69183","obj":{"i":69183,"n":"To Storm-tossed Seas","g":8,"l":"The Crystarium","s":990}}]}