{"quest":{"name":"The Sullen Man","location":"Lakeland","id":69105,"patch":5.0,"sort":9050,"eventIcon":71221,"issuer":1027402,"target":1031096,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Dadfort of Knot is having a decidedly unpleasant day."],"objectives":["Search for the facet investigator.","Search for the investigator's lost goods.","Deliver the lost goods to the facet investigator.","Speak with the facet investigator."],"dialogue":[{"name":"DADFORT","text":"Of all the days to be─ Hm? A traveler? Don't get many of those around here. Say, did you see a woman out and about on your way here? A short little thing, 'bout yea high to my knee."},{"name":"DADFORT","text":"Hmph. Well, isn't that just my luck. An investigator from the Facet of Gathering's come to these parts to research the local flora an' fauna or some such. I've been tasked with looking after her, but now she's wandered off somewhere and refuses to come back."},{"name":"DADFORT","text":"There's pirates around here, an' worse. Normally, I'd say if some fool woman wants to get herself killed, she can be my guest. But if her dead body washes up on the shore, I'll be the one taking the blame, and <span class=\"emphasis\">that's</span> a less appealin' prospect."},{"name":"DADFORT","text":"Anyhow, if you see this bumbling wench around, tell her Dadfort said to wrap up whatever it is she's doing, an' get herself back before she gets hurt."},{"name":"DADFORT","text":"Any luck findin' that investigator? No? &lt;sigh&gt; Well, isn't this just the best day ever."},{"name":"INVESTIGATOR03569","text":"Eep! D-Don't sneak up on me like that! Can't you see you gave me a terrible start!?"},{"name":"INVESTIGATOR03569","text":"Wait a minute...I know you! You're Qeshi-Rae's friend, yes? Pardon my little outburst. People tell me I frighten easily."},{"name":"INVESTIGATOR03569","text":"Wait a minute...I've seen you before. You're staying at the Crystarium, right? Pardon my little outburst. People tell me I frighten easily."},{"name":"INVESTIGATOR03569","text":"Anyhow, whatever are you doing all the way out here? Is there something you need of little old me?"},{"name":"INVESTIGATOR03569","text":"Dadfort is worried for me, you say? Why, how terribly considerate of him! I wouldn't have thought him the type. I must head back to the village at once!"},{"name":"INVESTIGATOR03569","text":"...There's just one little-bitty rub. I seem to have misplaced some of my possessions. Well, perhaps not so much “misplaced” as “dropped them whilst running away crying and screaming when a pirate appeared before me.” But same difference, right?"},{"name":"INVESTIGATOR03569","text":"What sort of possessions, you ask? So that means you'll be helping me, I presume! Splendid! I thought you looked the generous type. Anyhow, it's just three little things: my staff, my field notebook, and my tiny little pouch. If you could find them for me, I'd be ever so obliged!"},{"name":"INVESTIGATOR03569","text":"You're back! Do you have my belongings with you? Oh, please, please say that you do!"},{"name":"INVESTIGATOR03569","text":"My staff! My pouch! And most importantly of all, the notebook containing the most monumental findings yours truly has gleaned! You've done a great service today, friend!"},{"name":"INVESTIGATOR03569","text":"And with that, I simply must get back to Knot and assure dear old Dadfort that I am safe. To think that such a tender heart lay behind that dour mien! Thank you, traveler, and ta-ta!"},{"name":"DADFORT","text":"I take it I've you to thank for the woman's return. Much obliged. I gave her a stern talkin' to. Told her next time she comes here she'd best watch her back, 'cause I sure as hell can't be arsed to fish her bloated body up from the bottom of the water."},{"name":"INVESTIGATOR03569","text":"I came back hoping to receive a warm welcome and a hot cup of tea from old Dadfort, but instead he gave me a tongue-lashing like you wouldn't believe! Why on earth didn't you warn me!? I daresay the pirate I met out there was more welcoming!"},{"name":"INVESTIGATOR03569","text":"I swear, I've never met a man more fit to serve as elder of a village they call “Sullen”! Hells, I wouldn't be surprised if they named the damned place after him!"},{"name":"INVESTIGATOR03569","text":"Yes, yes...I know that the name is far older than that, and that it came from the dour faces that many a fisherman tends to wear. I <span class=\"emphasis\">also</span> know that all of them, Dadfort included, are actually gentle souls deep down. They just aren't so good at showing it."},{"name":"INVESTIGATOR03569","text":"Anyhow, <span class=\"emphasis\">I'm</span> not afraid to show my emotions, and I'm <span class=\"emphasis\">incredibly</span> appreciative for all you've done for me today! Take this as a token of my thanks, and tell old Dadfort that I'd sooner die than come back to this stinking, backwater little shantytown!"}],"reward":{"gil":606,"items":[{"num":3,"id":5810,"one":1},{"num":3,"id":5812,"one":1},{"num":3,"id":5813,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69183]}},"partials":[{"type":"npc","id":"1027402","obj":{"i":1027402,"n":"Dadfort","l":2953,"q":1}},{"type":"npc","id":"1031096","obj":{"i":1031096,"n":"Facet Investigator","l":2953,"q":1}},{"type":"item","id":"5810","obj":{"i":5810,"n":"Lotus Pink Dye","l":30,"c":22812,"t":55}},{"type":"item","id":"5812","obj":{"i":5812,"n":"Plum Purple Dye","l":30,"c":22812,"t":55}},{"type":"item","id":"5813","obj":{"i":5813,"n":"Regal Purple Dye","l":30,"c":22812,"t":55}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69183","obj":{"i":69183,"n":"To Storm-tossed Seas","g":8,"l":"The Crystarium","s":990}}]}