{"quest":{"name":"The Poet Doesn't Know It","location":"The Crystarium","id":69104,"patch":5.0,"sort":9040,"eventIcon":71221,"issuer":1031064,"target":1031065,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The prospective poet is in search of the proper inspiration."],"objectives":["Question the residents of the Crystarium.","Speak with the prospective poet near the Crystalline Mean.","Speak with the prospective poet at the Catenaries."],"dialogue":[{"name":"POET03568","text":"Do you like poetry? This requires a sensitive soul."},{"name":"POET03568","text":"...Apologies, I probably ought to provide context. I am composing a gift for my aged grandmother, who lost her sight some time ago. I wish to convey to her the endless beauty of the night sky─through verse!"},{"name":"POET03568","text":"To do so, however, I must explore the myriad emotions that that shimmering, inky expanse evokes in the heart─I'm sure you understand. Thus, I would beg you assist me in asking those of the Crystarium what the night sky means to them."},{"name":"RAEQESH","text":"How does the night sky make me <span class=\"emphasis\">feel</span>? Fascinated, mainly. It's a far sight different than what I had imagined in reading of it. Brighter and...closer, somehow. As if I could reach out and touch it."},{"name":"VALTHEWYL","text":"I could scarce believe it, at first, that the night had returned. I stared upward, trying to burn it into my mind, wondering if it would disappear again. And then, I saw a star─I know not how else to describe it─<span class=\"emphasis\">fall</span>. Astonishing!"},{"name":"LEWERALTH","text":"The night... It is a strange and wonderful thing. Were I to ride my amaro ever upward, I wonder, would I arrive amongst the stars? I think I should like to."},{"name":"RAEQESH","text":"The books do describe it as “breathtaking,” but...I know now that I never truly understood what that meant. Not until I saw it for myself."},{"name":"VALTHEWYL","text":"After a time, I began to feel as if I might fall into it, you know. The sky. I wonder─if I did, would I shine as brightly as that star?"},{"name":"LEWERALTH","text":"Perhaps we would simply fly forever, through the dark. I wouldn't mind that, either."},{"name":"POET03568","text":"And? How did they speak of the night sky to you?"},{"name":"POET03568","text":"Oh, yes... That's <span class=\"emphasis\">good</span>. I can feel the words stir within me!"},{"name":"POET03568","text":"I must recite this to my grandmother at once, whilst the image remains vivid in my mind. When you have a moment, might you come to the Catenaries and meet her? She's always so delighted by travelers' tales."},{"name":"POET03568","text":"This is the traveler I told you of, Grandmother. The one who assisted in finding inspiration for my poem!"},{"name":"GRANDMOTHER03568","text":"And what a beautiful poem it was, so full of love and awe and hope."},{"name":"GRANDMOTHER03568","text":"Just as beautiful as the night sky that you returned to us, my dear, I'm sure."},{"name":"POET03568","text":"That you─ What!?"},{"name":"GRANDMOTHER03568","text":"You didn't notice, child? You need to truly see the world around you if you are to make a living as a poet..."},{"name":"POET03568","text":"You <span class=\"emphasis\">are</span> the Warrior of Darkness! And I asked you for help with my poetry... Thank goodness I didn't insist upon reciting it to you─I might have died of shame just now."},{"name":"GRANDMOTHER03568","text":"Oh, you needn't be so dramatic. It really did turn out quite well─and now we've had this lovely chat. Isn't that right, my dear?"},{"name":"GRANDMOTHER03568","text":"Now, this <span class=\"emphasis\">is</span> a surprise."}],"reward":{"gil":679},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69182]}},"partials":[{"type":"npc","id":"1031064","obj":{"i":1031064,"n":"Prospective Poet","l":2951,"q":1}},{"type":"npc","id":"1031065","obj":{"i":1031065,"n":"Prospective Poet","l":2951,"q":1}},{"type":"quest","id":"69182","obj":{"i":69182,"n":"The Unbroken Thread","g":8,"l":"Lakeland","s":980}}]}