{"quest":{"name":"With Furious Anger","location":"Lakeland","id":69109,"patch":5.0,"sort":9090,"eventIcon":71221,"issuer":1027349,"target":1027349,"genre":113,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Chora-Kai of Weed has a pensive look about her."],"objectives":["Confront the mopish man with a /furious anger.","Speak with Chora-Kai."],"dialogue":[{"name":"CHORAKAI","text":"Well, hello there! Don't you look like an imposing individual! Forgive me for being so forward, but could I trouble you to do me a favor?"},{"name":"CHORAKAI","text":"It's my worthless, slacking sop of a brother! He promised me that he'd help tend to the chocobos today, but I'll bet you gil to gysahl greens that he's lounging about in bed doing absolutely nothing of import!"},{"name":"CHORAKAI","text":"I've told him time and again that he must shoulder his fair share of the workload, but it's like talking to a stone wall. I beg of you, friend, unleash the full fury of your anger on that listless lout!"},{"name":"CHORAKAI","text":"Oh, how I wish I could be there to see you give my sluggardly sop of a brother what for! But alas, the chocobos need tending to..."},{"name":"ANEMIC03573","text":"&lt;yawn&gt; Hmmm...? You need something...? Sorry, I'm─&lt;yawn&gt;─rather busy here..."},{"name":"SYSTEM","text":"This man strikes you as one of the most sluggish, slothful wretches you've ever had the misfortune to meet. It would seem that nothing short of a <span class=\"highlight\">furious</span> exhortation will suffice to convince him of the value of honest work."},{"name":"ANEMIC03573","text":"H-Hey! Wh-What's with all the shouting!? I...I don't even know you! "},{"name":"ANEMIC03573","text":"<span class=\"emphasis\">Chora</span> sent you!? Well, if she was trying to scare the living wits out of me, you can tell her she's done a bloody good job! Where in the hells did she find someone like you, anyway?"},{"name":"ANEMIC03573","text":"Hah! You come from the same place as the Crystal Exarch, you say? That's ri─ Er, I mean, pleasure to meet you. You won't yell at me anymore, right?"},{"name":"ANEMIC03573","text":"Some men dream of being heroes or going on grand adventures, but I'm a fisherman's son, and I reckon the slow life suits me just fine. Yes, just sitting─&lt;yawn&gt;─by the still waters, and..."},{"name":"ANEMIC03573","text":"R-R-Right! Time to go help Chora brush the chocobos! Just stop looking at me like that, okay!?"},{"name":"CHORAKAI","text":"Oh, it's you! I was hoping you'd come back so I could properly thank you. I don't know what you said to him, but ever since he got back, he's been brushing the chocobos like a man possessed!"},{"name":"CHORAKAI","text":"I know! I couldn't believe it either! But, truth be told, he wasn't always like this. Believe it or not, for a time he even served in the Crystarium guard. But over time, the sheer terror of the sin eater attacks got the better of him, and..."},{"name":"CHORAKAI","text":"One day, he just packed up his things and came home. He said the realm has enough heroes already, and he was happy to live out his time here until the end inevitably comes."},{"name":"CHORAKAI","text":"I don't imagine he'll ever again be like he was as a boy, dressed in play armor made of buckets and frying pans, pretending to be the sellsword Radisca bravely defending his companions..."},{"name":"CHORAKAI","text":"But he's still my brother, and I'm thankful to have him here with me─provided he pulls his own weight, of course! Anyhow, I should be getting back to work myself. Here's a little something by way of thanks. Safe travels, friend!"}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69183]}},"partials":[{"type":"npc","id":"1027349","obj":{"i":1027349,"n":"Chora-Kai","l":2953,"q":1}},{"type":"quest","id":"69183","obj":{"i":69183,"n":"To Storm-tossed Seas","g":8,"l":"The Crystarium","s":990}}]}