{"quest":{"name":"His Own Medicine","location":"The Crystarium","id":69101,"patch":5.0,"sort":9010,"eventIcon":71221,"issuer":1027263,"target":1027263,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Bethden makes a habit of concerning himself with the well-being of visitors to the Cabinet of Curiosity, and yours is no exception."],"objectives":["Speak with Fae-Hann at Spagyrics.","Drink the stygian syrup in front of Fae-Hann.","Speak with Bethden at the Cabinet of Curiosity."],"dialogue":[{"name":"BETHDEN","text":"Oh, my. You look terribly pale─and I know scholars who haven't set foot outside in weeks, so that's saying something. Please, pay visit to Spagyrics posthaste."},{"name":"BETHDEN","text":"Lest you protest─know that I have told the Crystal Exarch the very same many times, and...suffice it to say that he has learned to listen."},{"name":"BETHDEN","text":"You can hardly expect to be of service to others if you cannot even care for yourself. Now, go and see Fae-Hann before I become cross with you."},{"name":"FAEHANN","text":"Bethden sent you? Hmm..."},{"name":"FAEHANN","text":"You do look rather drained. Why, the circles under your eyes are almost as deep as the Exarch's! Please, take this."},{"name":"FAEHANN","text":"It's a simple but potent syrup that should balance your humours and reinvigorate you somewhat. Lyna is ever coming by for more doses to foist upon the Exarch when he works himself to exhaustion, so you may be assured that it is efficacious."},{"name":"FAEHANN","text":"Now, you'll drink that in front of me. Not that I don't trust you to take it, but...I do have quite a few years' experience working in this field, and I've found that it's better to be certain that the patient is following my instructions."},{"name":"FAEHANN","text":"It's only vinegar and medicinal herbs─nothing to be concerned about. Now, drink up!"},{"name":"PHARMACIST03565","text":"Oh, dear... You look fit to fall over! Speak with Fae-Hann─he can give you something for that."},{"name":"SYSTEM","text":"Fae-Hann will be deeply displeased if you do not drink the medicine where he might observe you doing so."},{"name":"SYSTEM","text":"You down the bottle in one gulp, but nevertheless are overpowered by the taste of vinegar and cannot help but grimace...then scowl."},{"name":"PHARMACIST03565","text":"Hahahaha! The Exarch made the same face the first time he tried it... Your cheeks do have a bit more color to them now, though."},{"name":"FAEHANN","text":"Please do bear in mind that I'm merely doing my job. Though, if you feel you must be avenged in some fashion, I might be persuaded to provide you another dose for Bethden... For all he fusses over others, the man is constantly working himself to the bone."},{"name":"PHARMACIST03565","text":"Hahaha... I apologize for laughing, but...your face!"},{"name":"FAEHANN","text":"Yes, the pallor has certainly receded. I trust you will ensure that Bethden is taken care of, as well."},{"name":"BETHDEN","text":"You went? I imagine that he gave you the syrup, then?"},{"name":"BETHDEN","text":"Ah. That...really won't be necessary. I'm quite well, I assure you. The very picture of health!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can't talk your way out of this."},{"name":"A1","text":"You're lucky that I'm feeling generous today."},{"name":"BETHDEN","text":"&lt;sigh&gt; Very well. But please don't make me drink it here. If they see my face, the others will never let me live it down."},{"name":"BETHDEN","text":"You are an example to us all, truly! Although...I would hate for it to go to waste. And Moren <span class=\"emphasis\">has</span> been looking a bit under the weather lately..."},{"name":"BETHDEN","text":"In any case, I am relieved to see that you no longer seem to be on the point of collapsing into a heap of books. Do take care of yourself...or else."}],"reward":{"gil":679,"items":[{"num":2,"id":27881}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69182]}},"partials":[{"type":"npc","id":"1027263","obj":{"i":1027263,"n":"Bethden","l":2951,"q":1}},{"type":"item","id":"27881","obj":{"i":27881,"n":"Jellied Harcot","l":430,"c":24082,"t":46}},{"type":"quest","id":"69182","obj":{"i":69182,"n":"The Unbroken Thread","g":8,"l":"Lakeland","s":980}}]}