{"quest":{"name":"Simple Gifts","location":"The Crystarium","id":69100,"patch":5.0,"sort":9001,"eventIcon":71221,"issuer":1028024,"target":1028024,"genre":111,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Irill has something to tell you."],"objectives":["Speak with citizens of the Crystarium.","Speak with Irill."],"dialogue":[{"name":"IRILL","text":"Oh─it is you! On behalf of all of us, thank you for fighting for the Crystarium!"},{"name":"IRILL","text":"As a matter of fact, several citizens have prepared small gifts for you to show their appreciation. I said that if I saw you, I would let you know, and...here you are!"},{"name":"IRILL","text":"The ones that I have heard from are Julstan in Musica Universalis, Tobyl in Sweetsieve, and one of the instructors with the Facet of Gathering...what was her name again? No matter─you will find her at the Quadrivium, with the children."},{"name":"IRILL","text":"When you have a moment, please speak with them!"},{"name":"IRILL","text":"You should stop by Musica Universalis, Sweetsieve, and the Quadrivium when you have a moment. Everyone is eager to thank you personally!"},{"name":"JULSTAN","text":"Thank you for stopping by! I very much wanted to present this to you directly."},{"name":"JULSTAN","text":"You probably won't be surprised that this is what we came up with, but─the merchants here thought that a piece of armor would be most useful to you, so we pooled our funds for this. May it serve you well!"},{"name":"TOBYL","text":"Greetings─and heartfelt thanks! It's only because you fought for us that our vegetable plots remain intact, and we may continue to live peacefully."},{"name":"TOBYL","text":"It is but a meager offering in comparison to what you've done for us, but we've prepared some food using the vegetables grown here for you to take with you on your journey. I hope that it suits your palate!"},{"name":"GARDENERB03564","text":"Oh, I'm so glad that you haven't already left the city! I wanted to present you with this gift─it's from all of us."},{"name":"GARDENERB03564","text":"We wanted to give you something homegrown, but were worried about burdening you too much...so we used fruit from the orchards to make juice! Hopefully it will make for a refreshing treat on the road."},{"name":"JULSTAN","text":"Stay safe out there! None of us wants to lose you."},{"name":"TOBYL","text":"Wheresoever you may go, I hope that you will think of the Crystarium when you eat the food that we prepared for you."},{"name":"GARDENERB03564","text":"When I say “we,” I do mean all of us. The children had a bit of difficulty pressing the lemons, but we got there in the end!"},{"name":"IRILL","text":"You met with everyone, then? Wonderful! If you like, I can prepare those gifts for you to carry more easily."},{"name":"IRILL","text":"Here you are! And please know that no matter where you travel, you'll be in our thoughts."}],"reward":{"gil":606,"items":[{"id":26877},{"num":2,"id":27875},{"num":2,"id":27880}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69182]}},"partials":[{"type":"npc","id":"1028024","obj":{"i":1028024,"n":"Irill","l":2951,"q":1}},{"type":"item","id":"26877","obj":{"i":26877,"n":"Dwarven Mythril Bracelet Coffer (IL 415)","l":1,"c":26566,"t":61}},{"type":"item","id":"27875","obj":{"i":27875,"n":"Mist Spinach Saute","l":415,"c":24152,"t":46,"p":3690}},{"type":"item","id":"27880","obj":{"i":27880,"n":"Lemonade","l":430,"c":24404,"t":46}},{"type":"quest","id":"69182","obj":{"i":69182,"n":"The Unbroken Thread","g":8,"l":"Lakeland","s":980}}]}