{"quest":{"name":"Strange Stew","location":"The Tempest","id":69117,"patch":5.0,"sort":9170,"eventIcon":71221,"issuer":1028060,"target":1028060,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Pulshs Ooan yearns to harness the power of flame..."],"objectives":["Place the trilobite meat into the cookpot.","Let the stew simmer.","Take the stew from the cookfire.","Offer the stew to the Ondo culinarian.","Deliver the stew to Pulshs Ooan."],"dialogue":[{"name":"PULSHSOOAN","text":"Finless one, is it true that on the shhhore, your people treat your food with fire to make it last longer?"},{"name":"PULSHSOOAN","text":"Ah hah, I thought so! You see, ever since the waters withdrew, our foodstuffs have become more prone to rot and decay. Something about exposssure to air, I sssuspect..."},{"name":"PULSHSOOAN","text":"With this in mind, we thought we might try to mimic your fire-assisted methods. We prepared a “cookpot” which was cast into the sea, but despite our best efforts to replicate your techniques, the result was quite disssappointing."},{"name":"PULSHSOOAN","text":"As a finless one, surely you are more capable of making this so-called ssstew? If you might take this trilobite meat and place it into the cookpot as we obssserve, it would be most educational."},{"name":"PULSHSOOAN","text":"The others are gathered atop the rise to the eassst. You will forgive me for keeping my distance─I have yet to grow accussstomed to the heat of the flames..."},{"name":"PULSHSOOAN","text":"Please take that trilobite meat to the others tending the pot and demonssstrate for them how a finless one prepares meat over fire. I will...obssserve from afar."},{"name":"ONDOPEOPLE03581","text":"Ah, finless one! You are come to show us how ssstew is made?"},{"name":"SYSTEM","text":"You deposit the meat into the bubbling broth. All that remains is to wait..."},{"name":"SYSTEM","text":"The makeshift stew appears to have been cooked long enough. Whether or not it will meet with the Ondo's approval, however, remains to be seen..."},{"name":"ONDOPEOPLE03581","text":"Is the ssstew ready yet, finless one...?"},{"name":"ONDOPEOPLE03581","text":"Ahh! So hot it is, like the boiling currentsss near the deepwater vents!"},{"name":"ONDOPEOPLE03581","text":"But it must be this hot, else the meat will ssspoil, yes? I see...so fearful of the heat were we that we did not consssider cooking it longer. But now we know."},{"name":"ONDOPEOPLE03581","text":"Thank you for teaching us, finless one. Take with you a portion of the ssstew back to Pulshs Ooan that he may sssavor this taste for himself."},{"name":"ONDOPEOPLE03581","text":"Pulshs Ooan must know the taste of this ssstew. Take to him that portion."},{"name":"PULSHSOOAN","text":"Well? Were you able to educate the others, finless one?"},{"name":"PULSHSOOAN","text":"How hot it is, yet delicious! To think such wonders could be born of deadly fire. Thank you for teaching us the proper methods."}],"reward":{"gil":925},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69184]}},"partials":[{"type":"npc","id":"1028060","obj":{"i":1028060,"n":"Pulshs Ooan","l":2958,"q":1}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}