{"quest":{"name":"Ondo Dream of Oranges","location":"The Tempest","id":69112,"patch":5.0,"sort":9120,"eventIcon":71221,"issuer":1031170,"target":1031170,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The Ondo visionary dreams of sharing his passion with his people."],"objectives":["Speak with the Ondo visionary outside the Cups.","Follow the Ondo visionary to the Norvrandt Slope.","Follow the Ondo visionary to the Cups.","Follow the Ondo visionary into the caverns below the Cups.","Return with the Ondo visionary to the Cups."],"dialogue":[{"name":"ONDOPEOPLE03576","text":"Greetings, finless one, and thank you! Others may be distressed by the change you have wrought, but I consider this to be the opportunity of a lifetime! An opportunity to sssavor the fruits of the land!"},{"name":"ONDOPEOPLE03576","text":"Quite literally, in fact, for I wish to make oranges! So deliciousss are the ones we have purchased from traders, full of surprisingly sssour sweetness!"},{"name":"ONDOPEOPLE03576","text":"I kept the ssseeds of the one I sssupped upon, and now that the sea has been parted, I can at last try my hand at agricultural endeavors! Or I would...if I knew aught of it. What exactly is agriculture, anyway?"},{"name":"ONDOPEOPLE03576","text":"So...you bury the seeds in the earth, and with the aid of the sssun's light, it grows into a tree? Not unlike kelp, then? Well! We certainly do not want for earth here, that much I can say."},{"name":"ONDOPEOPLE03576","text":"We will need a sssubstitute for the sun's light, though. Fortunately, I already have something in mind! Come with me and see for yourself. It is not far─due east of the Cups. Come, come!"},{"name":"ONDOPEOPLE03576","text":"This is...or was...a variety of feather ssstar─a creature of the sea that shimmers with the radiance of a flower in bloom. Alas, in the absssence of water, it is rather less radiant than I remember..."},{"name":"ONDOPEOPLE03576","text":"No need to say it. I know this will not do. But worry not! I know of another possible sssolution! Follow me to the northwest, past Where the Dry Return."},{"name":"ONDOPEOPLE03576","text":"See this white anemone and the ssstarfish which resides above it? Both radiate a gentle light to lure fish that they might feast. Surely this will serve for our purposes?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Can't say it looks all that promising."},{"name":"A1","text":"The light looks a little weak..."},{"name":"ONDOPEOPLE03576","text":"Oh, is it now? I rather thought it was... Hmm. Ssso be it. I do have one final idea, though it is a bit far, so let us first return to the Cups."},{"name":"ONDOPEOPLE03576","text":"I must apologize, finless one, for making you walk hither and thither to no end. I only hope that this third option will meet with your approval..."},{"name":"ONDOPEOPLE03576","text":"It is far, far below, and a fair ways to the west besides. Mind your footing and take care not to ssslip."},{"name":"ONDOPEOPLE03576","text":"Behold! Is it not wondrousssly bright? So many lussstrous plants filling the cavern with their light─surely there is no better place for us to plant our orange seeds!?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You know, this just might work!"},{"name":"A2","text":"It's barely enough. Barely."},{"name":"ONDOPEOPLE03576","text":"Huzzah, I knew it! And with a little more light, the oranges will grow as plump and juicy as they would on land!"},{"name":"ONDOPEOPLE03576","text":"I cannot thank you enough, finless one, but I aim to try! Let us return to the Cups at once!"},{"name":"ONDOPEOPLE03576","text":"You are too kind, my friend, accompanying me all over in my quest to find a second sun for my beloved oranges. We may not know for some time if the flora and fauna of the sea can provide enough light, but I look forward to finding out!"},{"name":"ONDOPEOPLE03576","text":"Most Ondo have never known the joy that is a juicy orange, but one day they will! I shall have an orchard, and every Ondo shall feassst on its fruits!"}],"reward":{"gil":952,"items":[{"num":2,"id":27786,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69184]}},"partials":[{"type":"npc","id":"1031170","obj":{"i":1031170,"n":"Ondo Visionary","l":2958,"q":1}},{"type":"item","id":"27786","obj":{"i":27786,"n":"Tincture of Strength","l":430,"c":20710,"t":44}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}