{"quest":{"name":"Beyond the Reach of Koal","location":"The Tempest","id":69115,"patch":5.0,"sort":9150,"eventIcon":71221,"issuer":1027958,"target":1027958,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Sorashs Koal is staring forlornly at the alcoves high above."],"objectives":["Search for a great sea beast and slay it for its bones.","Deliver the sea beast bones to Sorashs Koal."],"dialogue":[{"name":"SORASHSKOAL","text":"See you the portal high above? 'Tis the work of the ancientsss, like many structures scattered without, that we Ondo have since made our own."},{"name":"SORASHSKOAL","text":"Alas, in the absence of flowing waters, I cannot reach my home as easssily as before. If only I had a device or tool to aid in climbing up and down..."},{"name":"SORASHSKOAL","text":"The bones of a great sea beast might be useful to this end. Such creatures are not wont to linger in a sssingle place and are difficult to track, but they have been sighted not far from the Cups on occasion."},{"name":"SORASHSKOAL","text":"As a koal, I have no chance of defeating these creatures, but you are not hampered by the lack of water. There is a trench to the northwest from which they sometimes emerge─will you go and ssslay one of these beasts for their bones?"},{"name":"SORASHSKOAL","text":"I would not ask you to hunt these beasts in my ssstead had I the strength to do so myself. Alas, I am koal, and I do not..."},{"name":"SYETEM","text":"You cast about looking for great beasts of the sort described by Sorashs Koal, but see nothing..."},{"name":"SORASHSKOAL","text":"Ah, the finless one! Did you manage to find one of the beasts I described?"},{"name":"SORASHSKOAL","text":"Thank you, my friend, thank you! With these bones, I can fashion a ladder to return to my home."},{"name":"SORASHSKOAL","text":"It lies beyond that portal, as do the homes of many other koal. There we rest upon beds of sssoftest seaweed."},{"name":"SORASHSKOAL","text":"These highest alcoves are for we youths who have yet to be granted eggs. Only the ooan who have been deemed worthy of this honor may live in the lower levels. Those in the deepest depths are reserved for the clutchmother and other female Ondo, as well as the most esssteemed elders of our people."},{"name":"SORASHSKOAL","text":"Needless to say, the koal have ssstruggled greatly to adapt to this world without water. Though it would be far better were it to return, with this new ladder we can at least travel to and from our beds that much more easily."}],"reward":{"gil":706},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69184]}},"partials":[{"type":"npc","id":"1027958","obj":{"i":1027958,"n":"Sorashs Koal","l":2958,"q":1}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}