{"quest":{"name":"Secrets and Spears","location":"The Tempest","id":69119,"patch":5.0,"sort":9190,"eventIcon":71221,"issuer":1028061,"target":1028061,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Pegshs Ooan fears an interloper may be about..."],"objectives":["Speak with the veteran gateguard.","Speak with the Ondo elder.","Speak with the youthful gateguard.","Speak with the shifty-eyed Ondo.","Speak with Pegshs Ooan."],"dialogue":[{"name":"PEGSHSOOAN","text":"Tell me, finless one: have you seen a shhhifty-eyed Ondo lurking about?"},{"name":"PEGSHSOOAN","text":"I have, as have others. The Cups is home to a sssmall community, and ssstrangers do not go unnoticed. I can but assume that one of those lawless outsiders is attempting to pass as one of us..."},{"name":"PEGSHSOOAN","text":"I cannot go about and sssearch on account of my duties here, but if you could conduct an investigation in my stead I would be most grateful. I sssuggest you begin by speaking with the guard at the southern entrance."},{"name":"PEGSHSOOAN","text":"That outsider is still here among us. Sssomewhere. I can feel it in my fins. Nevertheless, it is only prudent that you speak with my comrade to the south and confirm my sssuspicions."},{"name":"ONDOSOLDIERA03583","text":"A shhhifty-eyed Ondo, you say? I have seen no such individual. I can but presume they are still somewhere here, in the Cups..."},{"name":"ONDOSOLDIERA03583","text":"There is an elder who prides himself on knowing every sssoul here. If there is a new arrival here, he will have noted their passing."},{"name":"ONDOSOLDIERA03583","text":"Seek out and speak with that elder. Nosy he may be, but in times such as these his presssumptuous nature may be to our advantage."},{"name":"OLDONDOPEOPLE03583","text":"A suspicious outsider? Nay, I have seen none─other than you, of course, heh heh. But if he has not somehow eluded the gate guards, then the only other explanation is that he has gone to ground in the caverns below. Mayhap you should ssspeak with the youngling guard stationed near the entrance."},{"name":"OLDONDOPEOPLE03583","text":"As I told you, I have seen no shifty-eyed Ondo outsiders. If he is here, I sssuspect he has gone into the caverns below─question the guard near the entrance and see what he has to say."},{"name":"ONDOSOLDIERB03583","text":"Eh? A shhhifty-eyed Ondo? Now that you mention it, there was this one fellow who seemed to be in a bit of a hurry. I waved him on by, thinking nothing of it. Say...is he one of those raiders? I hope not..."},{"name":"ONDOSOLDIERB03583","text":"Well, I should probably ssstay here just in case he tries to come back out. If you want to catch him, you will need to head down there by yourself."},{"name":"ONDOSOLDIERB03583","text":"Much as I would love to assist you, I cannot. I have my responsssibilities too, you know..."},{"name":"ONDOPEOPLE03583","text":"Who goes there!? A finless one? What business have you with me!?"},{"name":"ONDOPEOPLE03583","text":"I-I am no missscreant! I came here in secret that I might practice with this spear away from prying eyes. 'Twas a gift presssented to me by a finless one I saved from drowning."},{"name":"ONDOPEOPLE03583","text":"It is rather more flamboyant than those of traditional Ondo make, and so I feared that others might judge me harshly for it..."},{"name":"ONDOPEOPLE03583","text":"I did not wish to give so many cause to worry, but I see now that I have. I shall go and apologize to Pegshs Ooan. You should speak with him after─he will doubtless want to thank you for your ssservice."},{"name":"PEGSHSOOAN","text":"And so the myssstery is solved. The little one explained all to me."},{"name":"PEGSHSOOAN","text":"It may seem extreme for me to be so sssuspicious, but we must ever be vigilant for infiltrators. For our sake and for yours."},{"name":"PEGSHSOOAN","text":"Whatever hatred and resentment they bear towards us is dwarfed by that which they harbor for your kind. The Flood of Light was the work of finless ones, and so they hold you responsible for robbing them of their homes."},{"name":"PEGSHSOOAN","text":"We know better, and in time, they will too, I pray. But, for now, you must go with caution, honored guessst..."}],"reward":{"gil":779},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69184]}},"partials":[{"type":"npc","id":"1028061","obj":{"i":1028061,"n":"Pegshs Ooan","l":2958,"q":1}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}