{"quest":{"name":"Scales for the Scaled Ones","location":"The Tempest","id":69118,"patch":5.0,"sort":9180,"eventIcon":71221,"issuer":1027770,"target":1027770,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Amshs Aath is looking for an able-bodied finless one to hunt a dangerous beast in his stead."],"objectives":["Use the crab meat to lure out an amphisbaena.","Lie in wait for an amphisbaena and slay it for its scales.","Deliver the amphisbaena scales to Amshs Aath."],"dialogue":[{"name":"AMSHSAATH","text":"Well, if it is not a finless one! Ssspare a moment for a frail aath, honored guest, if you would."},{"name":"AMSHSAATH","text":"We Ondo are the caretakers of these and other ancient ruins. Ours is a dangerousss lot, for there are many creatures of the sea that would drive us from this place and take up residence in our ssstead. Thus must we clad ourselves in armor to shhhield our bodies from their blows."},{"name":"AMSHSAATH","text":"The scales of the amphisbaena are one such material we use to fashion our equipment. Ssslay one and bring to me its ssscales that I might help our young koal live to see the morrow."},{"name":"AMSHSAATH","text":"They are opportunistic predators, preferring to remain concealed until they sense the presssence of potential prey. Use this crab meat to lure one out of hiding, and then befuddle its senses with this shimmering orb."},{"name":"AMSHSAATH","text":"Much as I would love to accompany you in this hunt, I fear one of my age is just as like to become an amphisssbaena's next meal. I must ask that you do this without my help, finless one. I but hope that the orb will be enough to guarantee your victory."},{"name":"AMSHSAATH","text":"Ah, the finless hunter. Have you brought the ssscales I seek?"},{"name":"AMSHSAATH","text":"Very good, very good. These are just the sort we will need to make strong, ssstout armor for the younglings."},{"name":"AMSHSAATH","text":"Once we would have shhhirked such measures, cumbersome and weighty as they are. But we must adapt to life outside of water, which means utilizing the methods you finless ones favor..."}],"reward":{"gil":998,"items":[{"num":2,"id":27789,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69184]}},"partials":[{"type":"npc","id":"1027770","obj":{"i":1027770,"n":"Amshs Aath","l":2958,"q":1}},{"type":"item","id":"27789","obj":{"i":27789,"n":"Tincture of Intelligence","l":430,"c":20706,"t":44}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}