{"quest":{"name":"Beware the Benthos","location":"The Tempest","id":69114,"patch":5.0,"sort":9140,"eventIcon":71221,"issuer":1027759,"target":1027759,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Kewshs Ooan is the very picture of worry..."],"objectives":["Search for and aid the Ondo spearfisher.","Deliver the meager bounty to Kewshs Ooan."],"dialogue":[{"name":"KEWSHSOOAN","text":"So ssstrange it is to see finless ones in our realm. But since you are here, perhaps you can offer us aid?"},{"name":"KEWSHSOOAN","text":"A ssspearfisher of ours has been away for some time. Too long by half. I fear he may be ssstruggling in this newly waterless world of ours. You, however, thrive in such environments. If he is injured or worse, then I should be grateful if you would go and render aid."},{"name":"KEWSHSOOAN","text":"Forgive me this sudden request, but I must ask that you search for him north of the Norvrandt Slope."},{"name":"KEWSHSOOAN","text":"The ssspearfisher I worry for has yet to return. If you would go forth and sssearch for him north of the Norvrandt Slope, I would be most grateful."},{"name":"ONDOFISHER03578","text":"&lt;pant&gt; &lt;pant&gt; &lt;huff&gt; &lt;huff&gt;<br>Thieving ssscoundrels..."},{"name":"ONDOFISHER03578","text":"Huh? Where did you come from, finless one?"},{"name":"ONDOFISHER03578","text":"Kewshs Ooan sent you? Ah, how embarrassing... I am present and accounted for, as you can well see. However, the foodstuffs I had procured are not. A wily miscreant sssnatched them from my grasp not long before you arrived."},{"name":"ONDOFISHER03578","text":"I speak of those Ondo who refuse to treat with outsiders. They number many, and will not hesitate to sssteal and murder if it suits them. Until I catch more game to make up for that which was lost, I dare not return home..."},{"name":"ONDOFISHER03578","text":"Take that which I still have back with you to Kewshs Ooan and tell him of my plight. My thanks to you, finless one."},{"name":"ONDOFISHER03578","text":"I cannot return to the Cups without sssufficient game. Give Kewshs Ooan that meager offering and tell him we shall speak anon."},{"name":"KEWSHSOOAN","text":"You are returned, but alone? What of our spearfisher? What has become of him?"},{"name":"KEWSHSOOAN","text":"Waylaid by thieves? That is unfortunate. But I am glad to hear he is unharmed, and that he managed to retain a portion of his catch."},{"name":"KEWSHSOOAN","text":"Do not mistake our misguided brethren for black-hearted villains. They but struggle to sssurvive in our changing realm, and I remain hopeful that one day they may see the error of their ways."},{"name":"KEWSHSOOAN","text":"We have all lost much in the wake of the Flood. Ondo and finless ones both. Yet we dare not let our loss define us or lead us unto wicked ways."},{"name":"KEWSHSOOAN","text":"You too have overcome much hardship in your life, have you not? But you have not been broken by the weight. Stay ssstrong, friend, and accept this with my thanks."}],"reward":{"gil":706,"items":[{"num":2,"id":27787,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69184]}},"partials":[{"type":"npc","id":"1027759","obj":{"i":1027759,"n":"Kewshs Ooan","l":2958,"q":1}},{"type":"item","id":"27787","obj":{"i":27787,"n":"Tincture of Dexterity","l":430,"c":20709,"t":44}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}