{"quest":{"name":"Pearls of the Deep","location":"The Tempest","id":69113,"patch":5.0,"sort":9130,"eventIcon":71221,"issuer":1027761,"target":1027761,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Saushs Koal appears to be staring rather intently at your mouth..."],"objectives":["Use the stout rope on weakened sea creatures.","Deliver the captured sea creatures to Saushs Koal."],"dialogue":[{"name":"SAUSHSKOAL","text":"Finlessh one, finlessh one! How am I to glide through the watersh wishout watersh!? Or ssseek out that whish I crave? I cannot!"},{"name":"SAUSHSKOAL","text":"And what do I crave, you wonder? Teetsh! The teetsh of myriad beastshs!"},{"name":"SAUSHSKOAL","text":"Find for me feishty beastshs wish good teetshs, shmack them about until they're good and weak, and then bind them wish thish rope and bring them to me!"},{"name":"SAUSHSKOAL","text":"Let me shee, let me shink...a mnyiri, a morgawr, and a deep-shea leech. Bring me one of eacsh, alive─and mind the teetsh!"},{"name":"SAUSHSKOAL","text":"Remember: a mnyiri, a morgawr, and a deep-shea leech! Alive, if you would, and wish their lovely teetsh shtill intact!"},{"name":"SAUSHSKOAL","text":"Ahh, my finlessh friend! Have you my living loveliesh?"},{"name":"SAUSHSKOAL","text":"Shhhplendid! Shhhplendid! What big nashty teetsh you have! And now they are mine, mwahahaha! All mine!"},{"name":"SAUSHSKOAL","text":"Teetsh make for fine ssspearheadsh, and still finer gifts for female Ondo. The clutchmother and her attendants all delight in wearing sucsh jewelry."},{"name":"SAUSHSKOAL","text":"But trutsh be told, I shimply adore teetsh of all shapsh and shizes. I am a collector wish an inshhhatiable need."},{"name":"SAUSHSKOAL","text":"Why, the other day, I ashked another Ondo to give me his. Jusht a few! I even offered to pull them myshelf. But he grew so angry and refushed!"},{"name":"SAUSHSKOAL","text":"Shaaay... Your teetsh are rather nishe, finlessh one. Round and shhhiny and shmall. Would you be sho kind ash to favor me wish a few? The pulling will be quick and painlessh, I promish!"},{"name":"SAUSHSKOAL","text":"No? A shame. If you change your mind, come and find me. I shall be waiting. Always waiting, heh heh heh..."}],"reward":{"gil":706},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69184]}},"partials":[{"type":"npc","id":"1027761","obj":{"i":1027761,"n":"Saushs Koal","l":2958,"q":1}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}