{"quest":{"name":"Do the Chuckle","location":"The Tempest","id":69116,"patch":5.0,"sort":9160,"eventIcon":71221,"issuer":1027763,"target":1027763,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Deushs Aath seeks to teach the koal the wordless ways of the finless ones."],"objectives":["Speak with the Ondo youth.","/beckon the Ondo youth.","Speak with the insatiably curious Ondo.","/chuckle at the insatiably curious Ondo.","Speak with Deushs Aath."],"dialogue":[{"name":"DEUSHSAATH","text":"Finless one, honored guest, a moment of your time. We seek the wisssdom of you and your people."},{"name":"DEUSHSAATH","text":"In the water, there are many ways in which we Ondo may communicate with one another without relying on ssspeech. However, in this new environment of ours, our options are sssomewhat more restricted."},{"name":"DEUSHSAATH","text":"The koal wish to learn other techniques, but I have limited knowledge of such things. Might you speak with this child and demonssstrate for him your methods?"},{"name":"DEUSHSAATH","text":"We seek knowledge of how finless ones communicate with one another without words. Show this child, if you would, such techniques as he wishes to learn."},{"name":"ONDOPEOPLEA03580","text":"You have come at a good time, finless one. Might you be so kind as to demonssstrate how you would, without words, <span class=\"highlight\">beckon</span> me to come to your side?"},{"name":"ONDOPEOPLEA03580","text":"I see, I see! Such exaggerated gestures are sure to be easssily understood even over consssiderable distances."},{"name":"ONDOPEOPLEA03580","text":"We are about to embark on a hunt. Perhaps I will be able to employ this new technique to great effect to coordinate our movements..."},{"name":"ONDOPEOPLEA03580","text":"There is another of our brethren in the Cups that would benefit from your wisdom. An insssatiably curious Ondo. Please go to him and aid him as you did us."},{"name":"ONDOPEOPLEA03580","text":"No, no, not with your words, finless one! You must <span class=\"highlight\">beckon</span> me with your most expresssive motions!"},{"name":"ONDOPEOPLEA03580","text":"Hmm...I do not understand. Are you certain this is how your people would <span class=\"highlight\">beckon</span> one another? It feels rather more confusing than I anticipated..."},{"name":"ONDOPEOPLEB03580","text":"Finless one, finless one! You are the one who is teaching Ondo how your kind ssspeaks without words, yes? Tell me then: how would you express delight at another's sssurprisingly amusing antics?"},{"name":"ONDOPEOPLEB03580","text":"With water, one might do so with several spontaneous loops. Without, this “sssomersault” motion becomes rather more difficult. I am told your kind is like to <span class=\"highlight\">chuckle</span>─what is this? Can you demonssstrate?"},{"name":"ONDOPEOPLEB03580","text":"Oh, I see! It is a shaking of the whole body and a contortion of the face! I think I can replicate this motion..."},{"name":"ONDOPEOPLEB03580","text":"Well? Was it not a near-perfect imitation of the chuckle?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Nay─it was a perfect-perfect imitation!"},{"name":"A1","text":"Honestly, I thought you wanted to eat my face."},{"name":"ONDOPEOPLEB03580","text":"I knew it! And I owe it all to your excellent instruction. I shall use this new communication technique with pride."},{"name":"ONDOPEOPLEB03580","text":"Really? But your face is not at all appetizing to me. Hmm... I was so certain that I had captured the esssence of the chuckle, but it seems this will require rather more practice..."},{"name":"ONDOPEOPLEB03580","text":"It was Deushs Aath who first asked you to teach us these techniques, yes? You should return to him and tell him of your efforts. I am sure he will reward you."},{"name":"ONDOPEOPLEB03580","text":"As for me, I will go and teach others of the chuckle. My thanks to you for this gift, finless one!"},{"name":"ONDOPEOPLEB03580","text":"Does my question amuse you? That is well, but do not say so with words! You must expresss your enthusssiasm in the finless one way! You must <span class=\"highlight\">chuckle</span> for me!"},{"name":"ONDOPEOPLEB03580","text":"Oh? This is what it means to <span class=\"highlight\">chuckle</span>? Are you sure? It does not seem to quite capture the sense of sssincere but measured delight I was ssstriving to convey..."},{"name":"DEUSHSAATH","text":"The koal seem to be in high ssspirits─or perhaps they have grown that skilled at expresssing themselves with the chuckle already? That is all the more reason I have to thank you for our instruction, then."}],"reward":{"gil":606,"items":[{"num":2,"id":27788,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69184]}},"partials":[{"type":"npc","id":"1027763","obj":{"i":1027763,"n":"Deushs Aath","l":2958,"q":1}},{"type":"item","id":"27788","obj":{"i":27788,"n":"Tincture of Vitality","l":430,"c":20707,"t":44}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}