{"quest":{"name":"Mistake or Machination","location":"The Tempest","id":69121,"patch":5.0,"sort":9210,"eventIcon":71221,"issuer":1031174,"target":1031174,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A certain bizarre incident weighs heavily on this Ondo's mind..."],"objectives":["Speak with Mosha-Moa in Kholusia.","Deliver the orange to the distressed Ondo in the Tempest."],"dialogue":[{"name":"WORRYONDO03585","text":"Help me, finless one! Help me! Your people and their baffling ways have me at a complete and utter losss!"},{"name":"WORRYONDO03585","text":"A friend of mine, Paushs Ooan, wished to engage in trade with finless ones. Grain for shhhellfish─a sssimple exchange, sure to profit both parties."},{"name":"WORRYONDO03585","text":"However, the sack which my friend proceeded to collect from the shore was filled not with grain but with gravel! He felt so betrayed, and now refuses to treat with finless ones altogether, so dissstrusting he is of each and every one."},{"name":"WORRYONDO03585","text":"But it makes no sense to me! What would finless ones gain from this ssskullduggery? Or was there a misunderstanding─can your kind eat gravel as easily as grain?"},{"name":"WORRYONDO03585","text":"No, I thought not...but then why did the finless youths give my friend gravel instead of the promisssed grain? It makes no sssense. Will you go and speak with the Mystel woman with whom he brokered the deal? "},{"name":"WORRYONDO03585","text":"She is Mosha-Moa, of Wright. I would like very much to hear her explanation. Perhaps it is a mere misssunderstanding, but until I know more, it is difficult to know what to think..."},{"name":"WORRYONDO03585","text":"I cannot fathom why we would be given gravel instead of grain. I can but hope that Mosha-Moa can shhhed some light on this matter."},{"name":"WORRYONDO03585","text":"I pray this is all the result of a simple misssunderstanding and not deliberate deception or worse. It would be a shhhame if the Ondo's relations with the people of Wright were to deteriorate because of this incident..."},{"name":"MOSHAMOA","text":"Well, if it isn't <span class=\"highlight\">Forename</span>. Still alive and kicking, are we?"},{"name":"MOSHAMOA","text":"Right, enough small talk. You're here for a reason, I'm sure?"},{"name":"MOSHAMOA","text":"On behalf of the Ondo trader, you say? Is there anyone you don't know? Anyway, the arrangement was simple: grain for shells I could in turn resell as raw materials to jewelers."},{"name":"MOSHAMOA","text":"But on the day of the exchange, no one came, so I assumed it was off..."},{"name":"MOSHAMOA","text":"Wicked white! So some young ne'er-do-wells are to blame for this! Getting there ahead of me and swindling the poor Ondo out of their goods!"},{"name":"MOSHAMOA","text":"I hate to impose upon you like this, but since you're on such good terms with them, would you return to the Ondo and explain what happened, and that I'd be willing to trade with them again if they're still so inclined?"},{"name":"MOSHAMOA","text":"Offer them this as an expression of my sincere regret for what happened. I know their kind is awfully fond of our oranges, so hopefully it'll soften the blow."},{"name":"MOSHAMOA","text":"It's not exactly feasible for me to travel all the way to the Cups, so if you're willing, I'd be grateful if you could deliver my message and that orange to the Ondo in my stead."},{"name":"WORRYONDO03585","text":"The finless one returns! Did you manage to speak with the Mystel woman?"},{"name":"WORRYONDO03585","text":"An orange! How deliciously sssweet they are. Would that I could keep it for myself...but it is better that I do not."},{"name":"WORRYONDO03585","text":"My friend should be the one to savor this delicacy, having lost his goods to these young children. I only hope he will not hesssitate to trade with the people of Wright again. Fare you well."}],"reward":{"gil":1132},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69184]}},"partials":[{"type":"npc","id":"1031174","obj":{"i":1031174,"n":"Distressed Ondo","l":2958,"q":1}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}