{"quest":{"name":"Responsible Creation","location":"The Tempest","id":69128,"patch":5.0,"sort":10010,"icon":100929,"unlocksFunction":1,"eventIcon":71341,"issuer":1027775,"target":1030474,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The bureau attendant seems to be regarding you like a lost young child...","The Bureau of the Architect serves several functions, including the approval and regulation of “concepts” developed by the people of Amaurot, who have seemingly harnessed the power of creation itself to give form to anything and everything they can possibly imagine. To learn more about all this and more, the attendant encourages you to speak with others in the bureau waiting for their submissions to be processed.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The kindly Amaurotine tells you of their latest creation, a rather unusual boneless beast with semi-translucent skin and many tentacles that floats through the air. Though they doubt it will meet with the bureau's approval, they are not discouraged, for they take pleasure in the conception of unorthodox designs, and do not mind if others fail to see the beauty in their works.","The passionate Amaurotine explains that they are awaiting the verdict on their most recent submission: autonomous figures. Said figures are fiendishly complex yet devoid of emotion and fear, and thus will obey orders without question even if it leads them unto their own death.","The addled Amaurotine, thinking you to be a child and therefore a member of their target audience, implores you to test their creation before they submit it for approval. Furnishing you with a curious orb, they instruct you to head outside the bureau and use it to summon forth several playthings that you are to put through their paces.","The misshapen creations prove to be rather more belligerent than their architect likely intended. But fine art does not come exclusively from intent successfully realized. Perhaps the Amaurotine will take comfort in this.","Though somewhat distressed to learn that their creations were more akin to mad beasts than friendly playthings, the addled Amaurotine is not discouraged. They thank you for your assistance, adding that they look forward to the day when you will try your hand at creation as well."],"objectives":["Speak with the kindly Amaurotine.","Speak with the passionate Amaurotine.","Speak with the addled Amaurotine.","Use the concept matrix outside the Bureau of the Architect and play with the creations.","Speak with the addled Amaurotine."],"dialogue":[{"name":"AMAUROTPEOPLEA03592","text":"<span class=\"highlight-purple\">Why hello there, little one? Are you looking for your mummy and daddy?</span>"},{"name":"AMAUROTPEOPLEC03592","text":"<span class=\"highlight-purple\">Oh, I hope someone else hasn't registered it already...</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">Greetings and welcome to the Bureau of the Architect. Are you in need of assistance? It would be my pleasure to answer any questions you might have.</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">To your left is the counter where you may submit registrations for new creations. To your right you will find the counter where you may requisition concepts on file.</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">Hmm... Am I correct in assuming you are not familiar with the services we provide? I see. A more detailed explanation is in order, then...</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">You understand that by harnessing the powers of creation we can give physical form to all manner of concepts, yes?</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">Picture a bouquet of fresh, fragrant flowers all the colors of a rainbow. Now picture those selfsame flowers formed of delicate crystal, impossibly fragile and radiating hues beyond the visual spectrum. Every day our people push the boundaries of imagination to conceive new and striking designs like these.</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">But there are limits to what a single individual can shape with their abilities alone. Those who harbor greater ambitions may offer their concepts to others here, that they might with the strength of many accomplish what one cannot.</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">Not all concepts are approved for wider distribution, of course. Dangerous, subversive creations pose a risk to everyone, and so it is only after a comprehensive evaluation─after a concept is judged to further the greater good─that we permit it to be shared with the community.</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">Do you understand, little one?</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">Since you are here, I think you might benefit from conversing with some of the others currently availing themselves of our services. Why don't you go and speak with some of the citizens waiting for their registrations to be processed?</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">Much as I would like to believe my explanation was more than sufficient, I expect that you may gain greater insight in this way.</span>"},{"name":"AMAUROTGUIDE03592","text":"<span class=\"highlight-purple\">If you would like to learn more about the Bureau of the Architect and what we have to offer, I suggest you speak with those individuals currently availing themselves of our services. Perhaps one of the citizens waiting for a registration to be processed?</span>"},{"name":"AMAUROTPEOPLEA03592","text":"<span class=\"highlight-purple\">Hello hello, little one. So rare it is to see one of your size roaming about here. Come to learn about the bureau, are we?</span>"},{"name":"AMAUROTPEOPLEA03592","text":"<span class=\"highlight-purple\">I'm here today to register a new creature. Boneless and with semi-translucent skin, it drifts through the air, like a dancer on a summer breeze, its tentacles trailing behind. It utilizes gas bladders to propel itself from place to place, you see.</span>"},{"name":"AMAUROTPEOPLEA03592","text":"<span class=\"highlight-purple\">I'll admit it's not the most elegant of designs. I'd not shed a tear if it were rejected, quite frankly. But what can I say? I take pleasure in conceiving unorthodox designs. A beginner like you shouldn't take after me, though!</span>"},{"name":"AMAUROTPEOPLEA03592","text":"<span class=\"highlight-purple\">If you're looking to pick up a few tips, you should probably ask someone else. Ah─is that my number they just called? If you'll excuse me...</span>"},{"name":"AMAUROTPEOPLEB03592","text":"<span class=\"highlight-purple\">Are you the child I saw speaking with the attendant earlier? I thought so. So young and already so eager to learn about concepts and creations. That curiosity will serve you well, little one.</span>"},{"name":"AMAUROTPEOPLEB03592","text":"<span class=\"highlight-purple\">I've been credited with a few popular concepts, I'm proud to say. I'm hoping that my latest will be equally well received: autonomous figures.</span>"},{"name":"AMAUROTPEOPLEB03592","text":"<span class=\"highlight-purple\">I say “my” latest, but really it's the product of many others' efforts and individual insights. But such is the case for every masterwork, I reckon.</span>"},{"name":"AMAUROTPEOPLEB03592","text":"<span class=\"highlight-purple\">Autonomy notwithstanding, these creations know no fear. They are wholly devoid of emotion, and will without hesitation or resistance engage in any dangerous activity─even if death is assured.</span>"},{"name":"AMAUROTPEOPLEB03592","text":"<span class=\"highlight-purple\">There's a beauty in that, I think...and I hope the officials do so as well. I tell you, there is nothing more nerve-racking and thrilling than the waiting period before you receive the result. I love it and hate it in equal measure.</span>"},{"name":"AMAUROTPEOPLEB03592","text":"<span class=\"highlight-purple\">Anyway, that's all I've got to say about it. If you're still keen to learn more, why not pester that worrywart over yonder? Come to think of it, I think their particular creation was designed to appeal to children...</span>"},{"name":"AMAUROTPEOPLEB03592","text":"<span class=\"highlight-purple\">Like I said, if you're interested in learning more about the registration system, why not chat up that worried-looking fellow? I recall them muttering about how their design ought to appeal to little ones like yourself.</span>"},{"name":"AMAUROTPEOPLEC03592","text":"<span class=\"highlight-purple\">You there! An aspiring creator come to learn about the bureau and its inner workings, I trust? That's all well and good, but since you're here, perhaps you can help me with a little something.</span>"},{"name":"AMAUROTPEOPLEC03592","text":"<span class=\"highlight-purple\">I've been refining a concept of mine for some time now─adorable little creatures designed to be the perfect plaything for any young citizen! But I'm still terribly unsure if it's ready to be submitted for approval...</span>"},{"name":"AMAUROTPEOPLEC03592","text":"<span class=\"highlight-purple\">Which is why I was hoping you might first put it through its paces and tell me what you think! Your honest opinion─I'll have no flattery from you, young <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">man</span></span>!</span>"},{"name":"AMAUROTPEOPLEC03592","text":"<span class=\"highlight-purple\">This matrix will allow you to summon my creations. But don't use it here! Take it outside first. And don't be afraid to play rough! It's all part of the fun.</span>"},{"name":"AMAUROTPEOPLEC03592","text":"<span class=\"highlight-purple\">You can use that matrix I gave you to summon my creations. Bear in mind they're a work in progress, so they might not behave, er, exactly as designed...but I'm sure you'll have a wonderful time regardless!</span>"},{"name":"POPMESSAGE","text":"You sense a misbegotten presence!"},{"name":"BALLOON","text":"Friend? Friend!<br>Play with friend!"},{"name":"BALLOON","text":"Such fun! Such fun!"},{"name":"BALLOON","text":"Ohohohoho!"},{"name":"BALLOON","text":"Down I goooooo!"},{"name":"BALLOON","text":"Bye-byeee!"},{"name":"AMAUROTPEOPLEC03592","text":"<span class=\"highlight-purple\">How did you find my lovelies? Were they as delightful and engaging as I hoped? Tell me everything─spare no details.</span>"},{"name":"AMAUROTPEOPLEC03592","text":"<span class=\"highlight-purple\">I say! They spouted nonsensical phrases and attacked you like mad beasts!? How distressing and not at all like what I intended...</span>"},{"name":"AMAUROTPEOPLEC03592","text":"<span class=\"highlight-purple\">My sincerest apologies to you, little one, for the unpleasant experience. Still, from these experiences do we grow stronger and wiser. I look forward to the day when you will try your hand at creation, too!</span>"}],"reward":{"gil":861,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69188]}},"partials":[{"type":"npc","id":"1027775","obj":{"i":1027775,"n":"Bureau Attendant","l":2958,"q":1}},{"type":"npc","id":"1030474","obj":{"i":1030474,"n":"Addled Amaurotine","l":2958,"q":1}},{"type":"quest","id":"69188","obj":{"i":69188,"n":"The End of a World","g":8,"l":"The Tempest","s":1040}}]}