{"quest":{"name":"Debate and Discourse","location":"The Tempest","id":69129,"patch":5.0,"sort":10020,"icon":100929,"unlocksFunction":1,"eventIcon":71341,"issuer":1027778,"target":1027778,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The loquacious Amaurotine wishes to engage you in a battle of wits.","The Hall of Rhetoric is frequented by many Amaurotines eager to engage in debate and discourse, and the one who approaches you is no exception. After mistaking you for a young child unfamiliar with rhetorical traditions, they task you with summoning a friend of theirs from outside the hall in order to give you a live demonstration─and perhaps one in which you may be permitted to participate.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","The firebrand is not difficult to find, but they are disinclined to disengage from their current debate. If at first you do not succeed...","Another cursory attempt to catch the firebrand's attention ends in failure, leading you to wonder just how much longer you are expected to keep at this.","The firebrand at last relents and decides to hear you out, at which point you explain your purpose in coming. Recalling that they owe their colleague a debate or two, they declare that now is as good an occasion as any and stride towards the hall.","The two Amaurotines engage in a spirited debate concerning whether or not their city should attempt to aid a distant metropolis across the sea which is said to be struggling with an unprecedented calamity of late. Though the two fail to come to a consensus, their discussion provides insight into the thought processes of the citizenry, as well as an opportunity for you to join in the discourse to a limited degree.","The loquacious Amaurotine is a passionate believer in the free exchange of ideas, and they hope that your experiences in the Hall of Rhetoric will inspire you to participate in the public discourse when you are older. Indeed, they sense that you may have the potential to change Amaurot in ways no one might think possible, and they state that they will be watching your trajectory with great interest..."],"objectives":["Search for the Amaurotine firebrand.","Speak with the Amaurotine firebrand.","Speak with the loquacious Amaurotine."],"dialogue":[{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">Greetings, little one. Come to debate? And at so young an age, how wonderful! Shall we retire to the benches and settle on a topic?</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">Oh, my apologies for jumping to conclusions. My friends are not quite as fond of the Hall of Rhetoric as I am, so I have a habit of chatting up any potential conversation partners.</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">So if you are not here to debate, I presume you are here to learn about the mysterious and esoteric goings-on here? 'Twould be my pleasure to act as your tutor in these matters, if you will indulge me...</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">The Hall of Rhetoric is, as its name indicates, a place where citizens may freely gather to discuss and debate all manner of topics. This central forum is ideal for open discourse, but smaller rooms are available for those desiring more intimate conversation. Oh, and there is a wealth of reading material concerning rhetorical techniques and history penned by the greatest minds on offer as well, should you wish to refine your techniques through self-study.</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">To my mind, however, rhetoric is a living, breathing thing that is best experienced in the moment of conception and execution. Perhaps a demonstration would best serve to further your education.</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">I saw a contemporary of mine engaged in a lively debate earlier, just outside the hall. Go and see if they are still there, and issue to them my personal invitation to a friendly battle of wits!</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">As our verbal fisticuffs proceed, perhaps there will be an opportunity for you to join the discourse as well. Wouldn't that be wonderful?</span>"},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">But that is precisely my point─that their obsession with this so-called mandate to approve only the most beneficial concepts for wider distribution (never mind the ridiculous subjectivity of their criteria) has led the Bureau of the Architect astray from its original purpose...</span>"},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">...Huh? Have you business with me, child? Regardless, I am in the middle of a heated discussion with my partner. Come back later.</span>"},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">No no no, my position has nothing to do with the intrinsic value of unique identity and whether or not it is retained! Rather, I posit that the reproductions of a given concept are inherently imperfect, and thus they are themselves unique, albeit in minor but significant degrees, and─most importantly─this variance is not to be condemned, but celebrated! Better that than to strive in vain for an impossible standard that, even if met, would leave us lesser for lack of diversity!</span>"},{"name":"SYSTEM","text":"The Amaurotines appear to be engrossed in their debate, utterly deaf to you and your pleas for attention..."},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">My, aren't you a stubborn little bugger. It's strangely endearing, I must admit. But we have all the time in the world─why are you so insistent that I speak with you this very instant?</span>"},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">Ah, you are acquainted with that chatterbox? I suppose I do owe them a debate or two, and now is as good an occasion as any. So be it...</span>"},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">So you're to be an observer? No no, that will not do. You must be an active participant─you must engage in the discourse. Only by doing will you learn and grow, little one!</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">I see you found my friend! Thank you, little one. Then without further ado, let us commence the promised debate!</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">As to the matter of what subject we shall debate today, I propose the recent calamity which has befallen our friends across the pond. What say you?</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">The singular point of contention is, of course, whether or not Amaurot should intervene on their behalf.</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">I believe we should. The scale of the disaster which threatens that distant metropolis is of a scale heretofore unseen, and so equally considerable resources must be committed to counteracting its effects.</span>"},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">I disagree. The scale concerns me less than the nature of the proposition itself. Who are we to unilaterally intervene in the affairs of those half a world away? Are we to be the saviors of one and all? Such arrogance may well lead to our own downfall.</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">Hm. While I understand your concerns from a philosophical standpoint, I fear you are too quick to dismiss practical considerations out of a desire to maintain an unassailable moral authority.</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">But let us you and I hold here for the present and offer the floor to our young student. You have heard our opening salvos in this debate concerning the fate of our neighbors across the sea. What is your opinion on the matter?</span>"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"To ignore the plight of those one might conceivably save is not wisdom─it is indolence."},{"name":"A1","text":"We cannot save everyone. Sometimes, it is all we can do to save ourselves."},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">Indeed, indeed. The same can be said regardless of one's opinion on the morality of intervention. There is a clear and undeniable benefit to Amaurot in using this situation as a test bed for our newest creations, that we might develop and refine our defenses against a potential threat to our own fair city.</span>"},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">How readily you cede the moral high ground! Was not our young friend's point that we have an ethical obligation to aid those in need? Yet not only do you instead elect to focus on the benefit to Amaurot alone, but you also deprive our distant neighbors of the agency to determine their own fate!</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">You misunderstand me. What benefits Amaurot benefits all creation, I firmly believe, for the knowledge and wisdom we stand to gain from intervention can then be shared with others, empowering everyone to more effectively surmount similar trials in the future...</span>"},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">Out of the mouth of babes and sucklings, the unvarnished truth and purest wisdom! One must first look to one's own welfare before that of others, and the same must be said of our distant neighbors. To save them would be to deprive them of the agency to determine their own fate!</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">If self-interest is to take precedence, then consider the lost benefit to Amaurot. There is clear and undeniable value in using this situation as a test bed for our newest creations, that we might develop and refine our defenses against a potential threat to our own fair city.</span>"},{"name":"AMAUROTPEOPLEE03593","text":"<span class=\"highlight-purple\">A plea to practicality, I see─and one which you doubtless believe I have given you ample cause to invoke. But you misrepresent my arguments as enlightened self-interest, when in truth it is a rather more nuanced position...</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">I must say, it has been far too long since I engaged in such a refreshing exchange of ideas! My colleague was equally delighted by the opportunity, you may be assured.</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">Some decry it as little more than an academic exercise─after all, we failed to reach a meaningful consensus─but I daresay they miss the forest for the trees. Are we not more enlightened by the experience? Have we not been exposed to a greater variety of viewpoints? Is there not value in this alone?</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">I truly believe we are blessed to be part of a society that exalts the free exchange of ideas, and that encourages active participation in the public discourse.</span>"},{"name":"AMAUROTPEOPLED03593","text":"<span class=\"highlight-purple\">This may have been no more than your first foray into the exciting world of rhetoric, but I sense you have the soul of a debater in you. You may well have the potential to change Amaurot in ways no one ever thought possible. I shall be watching your trajectory with great interest, my young friend!</span>"}],"reward":{"gil":861,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69188]}},"partials":[{"type":"npc","id":"1027778","obj":{"i":1027778,"n":"Loquacious Amaurotine","l":2958,"q":1}},{"type":"quest","id":"69188","obj":{"i":69188,"n":"The End of a World","g":8,"l":"The Tempest","s":1040}}]}