{"quest":{"name":"Create the Birthing Rope","location":"The Tempest","id":69126,"patch":5.0,"sort":9260,"icon":100866,"eventIcon":71221,"issuer":1031019,"target":1031019,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Naroshs Koal is straining to hear a distant cry...","The clutchmother's cries can be heard for malms around, and the meaning is clear: she will soon be giving birth. Alas, you and Naroshs Koal have yet to find a means to aid her, and so there is still considerable risk that she will not have sufficient strength to see it through. The young Ondo can think of no other option but to go and see the finless woman who saved him so many years ago. However, he is reluctant to approach her without gifts of the sea, and so he begs you search for a suitable shell while he hunts for other items of value.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","With some effort, you procure an unblemished shell that should meet with Naroshs Koal's approval. Of course, until you present it to him you cannot be entirely sure, but...","Naroshs Koal is satisfied with your shell. For his part, he has found a small but exquisite pearl. With your gifts in order, you are now ready to journey unto Kholusia and seek out the woman in Stilltide and entreat her aid.","The fishwife takes only a moment to recognize Naroshs Koal, though he is quite a bit larger than she remembers. Much has changed for the both of them, for you are joined shortly after by her young daughter, already taking after her mother in many respects. Like the clutchmother, the fishwife had much difficulty giving birth, but with the aid of a special rope was able to marshal the necessary strength. Armed with this knowledge, Naroshs Koal bids you return to the depths of the sea, that you might discuss how to proceed.","The birthing rope of which the fishwife spoke may be the answer to your prayers. There is only one way to know for certain, though..."],"objectives":["Gather an unblemished shell from Where the Dry Return.","Deliver the shell to Naroshs Koal.","Accompany Naroshs Koal to Kholusia.","Speak with Naroshs Koal in the Tempest."],"dialogue":[{"name":"XEROSHSOOAN","text":"Now is not a good time, honored guest. The clutchmother is in distress..."},{"name":"ONDOQQUEEN03590","text":"(-Ondo Clutchmother-)Ugh... I... I... Attend me, my children..."},{"name":"NAROSHSKOAL","text":"Do you hear it, <span class=\"highlight\">Forename Surname</span>? That cry...it troubles me..."},{"name":"NAROSHSKOAL","text":"Ah, perhaps it is too low for finless ones to hear. We call to one another over great distances with such cries─to coordinate hunts, or sssimply to converse. It carries poorly now, in the absence of water, but still I hear it clearly..."},{"name":"NAROSHSKOAL","text":"A moment, if you would. I must concentrate to discern the words."},{"name":"NAROSHSKOAL","text":"Ah! The hour is nearly upon us! The clutchmother's belly heaves─a new generation yearns to be born!"},{"name":"NAROSHSKOAL","text":"But without water, there is ssstill danger and risk. The liver gave her nourishment, but it is not enough, not nearly enough! Xeroshs begs us hurry and find other ways to help her summon the necessary ssstrength!"},{"name":"NAROSHSKOAL","text":"I can think of only one possibility: we must journey unto the shore and seek out the woman who granted me sssuccor long ago. She was soon to be a mother, too, so she must surely have knowledge to aid the clutchmother's struggles."},{"name":"NAROSHSKOAL","text":"But we cannot approach her empty-handed. We must first procure suitable gifts. Head to Where the Dry Return and search for an unblemished shell."},{"name":"NAROSHSKOAL","text":"I shall search elsewhere for something of value. When you have finished, return here. But hurry─time is of the esssence!"},{"name":"NAROSHSKOAL","text":"There you are, <span class=\"highlight\">Forename Surname</span>! Give over your shell, quickly!"},{"name":"NAROSHSKOAL","text":"You have a keen eye for this, my friend. As for me, I found a sssmall but exquisite pearl, which is sure to please her."},{"name":"NAROSHSKOAL","text":"We have what we need. Let us head to her village of Stilltide, and pray she can aid us in easing the clutchmother's pains."},{"name":"NAROSHSKOAL","text":"I see her, <span class=\"highlight\">Forename Surname</span>. Come with me!"},{"name":"NAROSHSKOAL","text":"Greetings, miss. I am Naroshs Koal of the Ondo. You may not remember, but you sssaved my life a long time ago..."},{"name":"FISHERWOMAN03590","text":"Well, well! If it isn't the lad the tide brought in! Look at you! You're practically a man grown now, I'd wager."},{"name":"NAROSHSKOAL","text":"Not many would agree with you, but never mind that! I am come both to offer long-overdue thanksss for that kindnesss, as well as beg a boon of knowledge..."},{"name":"FISHERWOMAN03590","text":"You really didn't have to go to so much trouble, though I'll be damned if I'll turn my nose up at such fine treasures. Honestly, it's wasted on the likes of me."},{"name":"FISHERGIRL03590","text":"Wow, look at those! If you don't want them, can I keep them?"},{"name":"NAROSHSKOAL","text":"Is...is that little one the child you were carrying all those years ago?"},{"name":"NAROSHSKOAL","text":"So strange it is that finless ones carry their young within them until they are ready to hatch. So very, very ssstrange..."},{"name":"FISHERWOMAN03590","text":"Nothing strange about it, if you ask me. Can't quite get my head around the Ondo methods myself, but to each their own."},{"name":"FISHERWOMAN03590","text":"So─what's this about a boon of knowledge? Can't imagine what a fishwife like me could know that this friend of yours doesn't."},{"name":"FISHERWOMAN03590","text":"So...assuming I understood you correctly...you were riding that giant flying whale and used its breath to part the seas, and because of that, the Ondo clutchmother may not be able to give birth safely."},{"name":"NAROSHSKOAL","text":"That is indeed the long and the short of it, yes. Without the aid of water, she cannot sssummon her full ssstrength, and so we must find other means to help her do so. Do you have wisdom to share?"},{"name":"FISHERWOMAN03590","text":"Well, everyone's got their own tricks, I suppose, and what works for one woman isn't guaranteed to work for another, but..."},{"name":"FISHERWOMAN03590","text":"For me, what worked was something called a birthing rope. I tied it to one of my roof beams so I could grip it tight when the time came."},{"name":"FISHERWOMAN03590","text":"Couldn't hurt to try. Whether or not it'll do for your clutchmother I can't say, but I reckon I can vouch for it─and so can she."},{"name":"NAROSHSKOAL","text":"Thank you, finless mother. I shall return at once and begin fashioning a rope of sssimilar make."},{"name":"FISHERWOMAN03590","text":"I know all too well how difficult a time this can be for an expecting mother. If you need anything else, don't hesitate to hurry on back, all right?"},{"name":"FISHERGIRL03590","text":"It was nice meeting you, mister!"},{"name":"NAROSHSKOAL","text":"This birthing rope may be the answer to our prayers. Let us go back to the Cupsss and decide how to proceed there."},{"name":"NAROSHSKOAL","text":"Though she is not Ondo, that finless one carried herself with the ssselfsame grace of a clutchmother. Perhaps it is the same for all who have brought children into this world..."},{"name":"NAROSHSKOAL","text":"I can but hope that this rope she told us of will ssserve to aid our clutchmother in this most trying of times..."}],"reward":{"gil":1290},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69125]},"next":[69127]},"partials":[{"type":"npc","id":"1031019","obj":{"i":1031019,"n":"Naroshs Koal","l":2958,"q":4}},{"type":"quest","id":"69125","obj":{"i":69125,"n":"Mother's Mnyiri","g":118,"l":"The Tempest","s":9250}},{"type":"quest","id":"69127","obj":{"i":69127,"n":"Tomorrow Is in Your Fins","g":118,"l":"The Tempest","s":9270}}]}