{"quest":{"name":"More than One Way to Skin a Stingray","location":"The Tempest","id":69122,"patch":5.0,"sort":9220,"eventIcon":71221,"issuer":1028062,"target":1028062,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Nakshs Koal has yet more designs involving you."],"objectives":["Slay a hardskin stingray for its skin.","Deliver the skin to the Ondo leatherworker.","Deliver the fashionable accessory to Nakshs Koal."],"dialogue":[{"name":"NAKSHSKOAL","text":"Hold a moment, my friendly finless one! I have another request to make of you─this time for a friend who foolishly sought to slay a formidable ssstingray on his own, only to limp back home after being ssstruck by a poisoned barb."},{"name":"NAKSHSKOAL","text":"It has been an all-too-familiar refrain as of late. Time and time again we koal find ourselves overmatched by our foes in this now waterless realm of ours. You, however, should find it easy to ssslay this stingray and secure its ssskin, no? Of course you will!"},{"name":"NAKSHSKOAL","text":"Should you sssucceed in this endeavor, I ask that you deliver the skin to a leatherworker of ours. Thank you in advance, finless one!"},{"name":"NAKSHSKOAL","text":"It is a difficult but simple request, I should think. Slay the ssstingray and bring its ssskin to the leatherworker of whom I spoke. Good luck!"},{"name":"ONDOTANNER03586","text":"Well met, honored guest. Are you in need of guidance?"},{"name":"ONDOTANNER03586","text":"What a fine skin this is! Of sssurpassing quality indeed... You procured this in place of a young koal hunter, you say? Interesting..."},{"name":"ONDOTANNER03586","text":"Such materials are ever in high demand both for their durability and for their beauty. Tools, equipment, decorative accesssories─all manner of products may utilize good ssskin."},{"name":"ONDOTANNER03586","text":"Speaking of which, a little while ago I finished fashioning some new pieces. Perhaps you could take one to Nakshs Koal on my behalf? My thanks to you."},{"name":"ONDOTANNER03586","text":"Take that new piece to Nakshs Koal, if you would. I fear I have not the time to ssspare at present to do so myself."},{"name":"NAKSHSKOAL","text":"Welcome back, finless one. You look well─I trust you got the better of that ssstingray I told you about?"},{"name":"NAKSHSKOAL","text":"Oho, what do we have here!? Another of the leatherworker's masterpieces, and for me? Marvelous! Such works of art are certain to fetch a high price from a finless trader."},{"name":"NAKSHSKOAL","text":"Aye, that is right! I have continued to ssstudy commercial trends and so forth, that I might build a more sssuccessful business enterprise moving forward. Though, er...I do realize that it would be foolhardy to do so by imposing upon your goodwill in excess..."}],"reward":{"gil":779,"items":[{"num":2,"id":27790,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69120]}},"partials":[{"type":"npc","id":"1028062","obj":{"i":1028062,"n":"Nakshs Koal","l":2958,"q":2}},{"type":"item","id":"27790","obj":{"i":27790,"n":"Tincture of Mind","l":430,"c":20708,"t":44}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69120","obj":{"i":69120,"n":"Scavenger Deep","g":118,"l":"The Tempest","s":9201}}]}