{"quest":{"name":"Tomorrow Is in Your Fins","location":"The Tempest","id":69127,"patch":5.0,"sort":9270,"icon":100866,"eventIcon":71221,"issuer":1031019,"target":1030762,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Naroshs Koal at last knows what must be done.","The clutchmother's cries grow more desperate, but fortunately you have finally struck upon a viable method: a birthing rope. No rope of ordinary make will suffice, though, for she is far stronger than the average finless one, and so Naroshs Koal implores you to seek out and slay several sea anemones that you might claim their tentacles as material.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","From each of the anemones you harvest the stoutest tentacles, which will surely serve well as rope. Nevertheless, Naroshs Koal will have to be the judge.","With a glance the young Ondo concludes that the tentacles are perfect. Taking them from your hands, he immediately sets about weaving the birthing rope─a task which leaves him utterly exhausted. It falls to you to deliver it to Xeroshs Ooan, before it is too late.","You arrive in the nick of time, it seems, and after Xeroshs Ooan instructs the clutchmother's attendants in the rope's use, you and he and Naroshs Koal wait with bated breath as the Ondo matron summons her every onze of strength to bring her children into the world. Time passes without word from within, until finally you learn that the clutchmother and her eggs are well. For their loyal service, the two male Ondo are entrusted with an egg each, and though you are offered one as well at first, the clutchmother reconsiders after recognizing that you cannot possibly fertilize it, much less raise the resulting child as your own. Your joint duty complete, the newly named Naroshs Ooan begs a final moment to speak in private.","Naroshs Ooan cannot well express his joy at finally being recognized as a full-fledged adult, worthy of raising a child─and it is all thanks to you. Though he will need to devote his every waking moment to their care for the foreseeable future, he is certain that you will cross paths again, and looks forward to that fateful day."],"objectives":["Seek out and slay sea anemones for their tentacles.","Deliver the tentacles to Naroshs Koal.","Deliver the birthing rope to Xeroshs Ooan.","Speak with Naroshs Ooan."],"dialogue":[{"name":"XEROSHSOOAN","text":"The clutchmother continues to ssstruggle, as we feared. Her cries of anguish echo throughout the Cups and for malms around. There must be something that can be done to ease her pain..."},{"name":"ONDOQQUEEN03591","text":"(-Ondo Clutchmother-)My children... My children!"},{"name":"NAROSHSKOAL","text":"This birthing rope of which the finlesss woman spoke is our only option. We must weave one at once, <span class=\"highlight\">Forename Surname</span>."},{"name":"NAROSHSKOAL","text":"However, we cannot rely upon the same materials as she did, for the clutchmother is far larger and stronger, and would surely sssnap one of the traditional make..."},{"name":"NAROSHSKOAL","text":"The tentacles of the sssea anemone! Bound together, they could serve as an unbreakable rope."},{"name":"NAROSHSKOAL","text":"Once more I must impose upon you, <span class=\"highlight\">Forename Surname</span>, for your skill at arms far outstrips mine own. I ask that you seek out and ssslay three of these creatures and take from each its ssstrongest, ssstoutest tentacle."},{"name":"NAROSHSKOAL","text":"Much I have asked of you already, yet I fear I have no choice but to do so yet again. Only a warrior such as you or a proud ooan could triumph over the anemones."},{"name":"NAROSHSKOAL","text":"They are ravenous, ever hunting for their next meal. If you sssurvey the grounds to the north of the Cups, they will likely find you ere you find them. Go quickly, for the lives of the clutchmother's children hang in the balance!"},{"name":"NAROSHSKOAL","text":"You need only survey the grounds to the north of the Cups for a time. Your mere presence is like to attract hungry anemones ssseeking to make a meal of your flesh."},{"name":"NAROSHSKOAL","text":"Tell me you have brought with you the tentacles..."},{"name":"NAROSHSKOAL","text":"Bless you, <span class=\"highlight\">Forename Surname</span>, blesss you! Far tougher and more robussst these tentacles are than I had dared hope. I shall weave the rope at once!"},{"name":"NAROSHSKOAL","text":"This...shall take...every onze...of my ssstrength..."},{"name":"NAROSHSKOAL","text":"&lt;pant&gt; &lt;pant&gt; &lt;huff&gt; &lt;huff&gt;<br>It is finished. Here─take it, <span class=\"highlight\">Forename Surname</span>..."},{"name":"NAROSHSKOAL","text":"Forgive me. I require a moment to rest. You must deliver the birthing rope to Xeroshs Ooan in my ssstead. Quickly!"},{"name":"NAROSHSKOAL","text":"I fear I cannot accompany you at this time, <span class=\"highlight\">Forename Surname</span>. Go on without me─entrust the rope to Xeroshs Ooan. He will give it over to the clutchmother..."},{"name":"XEROSHSOOAN","text":"Honored guest! Pray tell me you have brought sssomething to aid the clutchmother in her hour of need!"},{"name":"XEROSHSOOAN","text":"...A birthing rope, you say? I had not considered this. However, if it is as effective as this finlesss mother claims, then this day may not end in tragedy."},{"name":"XEROSHSOOAN","text":"Let us hope that it helps the clutchmother to sssummon all her prodigious strength..."},{"name":"XEROSHSOOAN","text":"Only female Ondo are permitted beyond the threshold. Therefore I must instruct the clutchmother's attendants in the rope's use, and have them bind it to a suitable feature in the rock. And then, honored guest, we must wait..."},{"name":"ONDOQQUEEN03591","text":"(-Ondo Clutchmother-)&lt;pant&gt; &lt;pant&gt; &lt;huff&gt; &lt;huff&gt;<br>Then...then if I grip the rope just so, I... I..."},{"name":"ONDOWOMAN03591","text":"(-???-)Again, mother! Push harder!"},{"name":"ONDOQQUEEN03591","text":"(-Ondo Clutchmother-)Guuuaaaggghhhsssssshhhiiite!!!"},{"name":"XEROSHSOOAN","text":"Ssstill no word from within, after all this time... I do not wish to intrude upon her chambers, but if I must..."},{"name":"ONDOQQUEEN03591","text":"(-Ondo Clutchmother-)I am here, and I am well...as are my eggs..."},{"name":"NAROSHSKOAL","text":"Clutchmother! Oh, praise be! It is sssuch a relief to hear your voice again."},{"name":"ONDOQQUEEN03591","text":"(-Ondo Clutchmother-)Xeroshs, Naroshs. You both helped me to triumph in this greatessst of trials. To you both will I entrust two of my finest eggs. And you, <span class=\"highlight\">Forename Surname</span>─you too shall receive of me an egg."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Ah, um, er... You will forgive me for declining..."},{"name":"A1","text":"Sssure, why not."},{"name":"XEROSHSOOAN","text":"You would refuse? To Ondo there is no higher honor, yet you would refuse!?"},{"name":"NAROSHSKOAL","text":"<span class=\"highlight\">Forename Surname</span>, you cannot be ssserious! You are of the shore! You have not the seed to quicken the egg! Surely not!"},{"name":"ONDOQQUEEN03591","text":"(-Ondo Clutchmother-)Hmm... Upon further consideration, this honor ill suits you. Indeed, only male Ondo can provide the necessary ssseed, and as you have other duties you cannot forsake, 'twould be better to leave such responsibilities to the guardians of the Cups."},{"name":"ONDOQQUEEN03591","text":"(-Ondo Clutchmother-)Ere they become full grown, our children's gills are not fully formed, and so they ssstruggle to survive out of water. Yet as times change, so too must our ways and the relations between our peoples. Though this generation shall be raised here, perhaps future ones will know a different life."},{"name":"ONDOQQUEEN03591","text":"(-Ondo Clutchmother-)It is not quite the same, I know, to give birth here than on land, but I should like to think that I am ssstronger and wiser for this experience... I thank you again, honored guest, from the bottom of my heart."},{"name":"XEROSHSOOAN","text":"I too thank you, <span class=\"highlight\">Forename Surname</span>, and you, Naroshs. Were it not for your efforts, I fear for what may have become of the Ondo's future."},{"name":"XEROSHSOOAN","text":"For your deeds in ssservice to the clutchmother have you been given your first egg. Raise it well, ooan. Raise it well."},{"name":"ONDOQQUEEN03591","text":"(-Ondo Clutchmother-)Many busy days lie ahead, but first I must rest. Go forth, my children, heads high and heartsss filled with pride, and see that my eggs are never without the love and affection they dessserve."},{"name":"NAROSHSKOAL","text":"(-Naroshs Ooan-)<span class=\"highlight\">Forename Surname</span>, know that you are always welcome in the Cups, and shall ever be received with the ressspect and reverence a sssteadfast ally deserves."},{"name":"NAROSHSKOAL","text":"Did you hear them, <span class=\"highlight\">Forename Surname</span>!? I am to be a father! An ooan! And it is all thanks to you, my friend!"},{"name":"NAROSHSKOAL","text":"There is still so much I would know of your people and your ways. Out of curiosssity, yes, but also because I still believe there is more wisdom to be gleaned, with which we Ondo may better our lot. Yes, yes, this is only the beginning..."},{"name":"NAROSHSKOAL","text":"I look forward to the day my child will grow strong enough to venture onto land, and perhaps play together with the finless ones of Stilltide. I pray that they will treat us with the ssselfsame kindness and warmth you have shown us."},{"name":"NAROSHSKOAL","text":"I knew I was not wrong to trust in you and yours, <span class=\"highlight\">Forename Surname</span>. It has been an honor and a pleasure!"},{"name":"NAROSHSKOAL","text":"My child will require my every waking moment for the foressseeable future, but I am sure that we will one day meet again. Until then, fare you well!"}],"reward":{"gil":888,"items":[{"num":2,"id":27877,"one":1},{"num":2,"id":27879,"one":1},{"num":2,"id":27880,"one":1},{"num":2,"id":27881,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69126]}},"partials":[{"type":"npc","id":"1031019","obj":{"i":1031019,"n":"Naroshs Koal","l":2958,"q":4}},{"type":"npc","id":"1030762","obj":{"i":1030762,"n":"Naroshs Ooan","l":2958,"q":1}},{"type":"item","id":"27877","obj":{"i":27877,"n":"Paella","l":418,"c":24031,"t":46}},{"type":"item","id":"27879","obj":{"i":27879,"n":"Ovim Cordon Bleu","l":430,"c":24363,"t":46}},{"type":"item","id":"27880","obj":{"i":27880,"n":"Lemonade","l":430,"c":24404,"t":46}},{"type":"item","id":"27881","obj":{"i":27881,"n":"Jellied Harcot","l":430,"c":24082,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69126","obj":{"i":69126,"n":"Create the Birthing Rope","g":118,"l":"The Tempest","s":9260}}]}