{"quest":{"name":"Too Many Nutters","location":"The Crystarium","id":69136,"patch":5.0,"sort":20030,"unlocksFunction":1,"eventIcon":71341,"issuer":1027990,"target":1027988,"genre":111,"journal":["Halldor believes you are ready to take an important step."],"objectives":["Speak with Xylle."],"dialogue":[{"name":"HALLDOR","text":"There <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is! The star hunter of Clan Nutsy <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>! Bagged yourself a goodly number of three-nut marks, have we?"},{"name":"HALLDOR","text":"But it's not enough, is it? Don't deny it. Nay, you need to experience it all: the terrifying lows, the dizzying highs, the creamy middles! And they need it too, if not more─why else would those Eulmoran bastards offer bigger and bigger bounties?"},{"name":"HALLDOR","text":"They're waiting for you to slip up, just once. To give them a spectacular death. But you won't go quietly, oh no─you'll bleed them for every last gil and then some!"},{"name":"HALLDOR","text":"And soon you'll have the chance to do so on an entirely different scale. How, you ask? By slaying elite marks, that's how!"},{"name":"HALLDOR","text":"They're like nothing you've ever faced before. Wild and unpredictable, possessed of surpassing strength and guile. Many are the men who have left to slay such fiends, never to return."},{"name":"HALLDOR","text":"But their failures will only serve to season the dish that is your victory! The greater the risk, the greater the reward─extrinsic and intrinsic, no? Which is why you must speak with Xylle without further delay!"},{"name":"XYLLE","text":"Oh, it's you. Come to beg permission to hunt elite marks?"},{"name":"XYLLE","text":"That I cannot grant. Just the other day our very own leader fell in battle with such a beast. Torn to shreds and devoured─nary a trace remained to be buried."},{"name":"XYLLE","text":"I cannot in good conscience allow one of our most promising hunters to throw their life away as he did. For now, I must insist that you content yourself with the three-nut marks..."},{"name":"NUTS","text":"(-???-)Now wait just a gosh-darned minute!"},{"name":"XYLLE","text":"Wicked white! But you're─"},{"name":"NUTS","text":"Nutsy, your fearless leader! Still alive and kupoing, I'll have you know!"},{"name":"XYLLE","text":"But Halldor described in exacting detail how the beast snatched you out of the air─how as you struggled to free yourself in vain you were disemboweled and depommed─"},{"name":"NUTS","text":"C-Certainly not! As you can see, I am the picture of perfect health, kupo!"},{"name":"NUTS","text":"No thanks to that villain Halldor, though! I'd say <span class=\"emphasis\">he</span> was the aspiring depommer, considering how many times he nearly chopped it off in the midst of our battle with that elite mark."},{"name":"XYLLE","text":"I rather think you have only yourself to blame for that. After all, was it not you who encouraged him and the others to strike you down and claim leadership?"},{"name":"NUTS","text":"Aye, aye, for the thrill of it! Which he gave me and then some─even if only by his poor attempts at treachery. That weakling wouldn't last a moment against me in a stand-up fight!"},{"name":"XYLLE","text":"As you may have gathered, it takes a certain...character to rise within the highest echelons of the clan."},{"name":"NUTS","text":"You've got to eat, sleep, and breathe danger! You've got to love putting it all on the line against elite marks and elite hunters besides! You've got to be bloody mad! So congratulations, <span class=\"highlight\">Forename</span>: you're in!"},{"name":"XYLLE","text":"Are you sure this is wise?"},{"name":"NUTS","text":"Wise, shmise! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s a killer─I want to see <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> kill! I wanna see <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> die! Mwahahaha! More blood for Clan Nutsy! More blood, kupo!"},{"name":"XYLLE","text":"It's <span class=\"emphasis\">that</span> ridiculous philosophy that's losing us hunters by the boatload! How are we supposed to build a sustainable organization when you keep encouraging people to kill themselves in the most violent and pointless ways possible!?"},{"name":"NUTS","text":"I─ Er. Well, you see... The thing is..."},{"name":"NUTS","text":"Ahem! I just wanted to say that you may be the most promising new hunter I've seen in ages! Brilliant work out there, really marvelous. Jolly good! And on that note... Good-bye!"},{"name":"XYLLE","text":"One day I'm going to rip that pom off your head and shove it down your godsdamned throat, you furry little shite..."},{"name":"XYLLE","text":"Anyway, you may now hunt elite marks. Do try not to die. And, if you happen to run into our fearless leader in the field, kill him."},{"name":"SYSTEM","text":"You are now permitted to take bills for elite Clan Nutsy marks from the Clan Hunt board."},{"name":"HALLDOR","text":"Heh heh heh! Don't let me keep you, killer! There's a whole wide world of elite marks waiting for you to kill them! Hop to!"}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69135]}},"partials":[{"type":"npc","id":"1027990","obj":{"i":1027990,"n":"Halldor","l":2951,"q":3}},{"type":"npc","id":"1027988","obj":{"i":1027988,"n":"Xylle","l":2951,"s":5,"q":4,"t":"Clan Nutsy Member","r":1,"a":3246,"c":[9.48,9.58]}},{"type":"quest","id":"69135","obj":{"i":69135,"n":"How Do You Like Three Nuts","g":111,"l":"The Crystarium","s":20020,"f":1}}]}