{"quest":{"name":"Yet Another Striking Opportunity","location":"Eulmore","id":69137,"patch":5.0,"sort":20040,"unlocksFunction":1,"eventIcon":71341,"issuer":1030408,"target":1030409,"genre":112,"journal":["The weary dockworker would like to have a word with you.","In the wake of the many changes come to the city of Eulmore, several military leaders have taken it upon themselves to resurrect an ancient training method to mold a new generation of peacekeepers. You too may benefit from taking part in this endeavor, though you will have to speak with the soft-faced bloke outside the city to learn more first.","To your considerable surprise, the new training grounds are a near replica of those found on the Source. Quite how such an extraordinary coincidence could be possible is hard to fathom, but regardless, the resilient training dummies are at your disposal should you wish to hone your skills."],"objectives":["Speak with the soft-faced bloke in Kholusia."],"dialogue":[{"name":"EULMORRANPEOPLE03601","text":"Ain't you that <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">bloke</span></span> what brought back the night? The Warrior of Darkness? Good, 'cause I was asked to keep an eye out for you."},{"name":"EULMORRANPEOPLE03601","text":"Nothing untoward, worry not. It's just that, see, ever since Lord Vauthry and General Ran'jit ran off to gods know where, the Eulmoran Army's been in shambles."},{"name":"EULMORRANPEOPLE03601","text":"Say what you will about the bastards, but they kept the city safe, or near as much. The remaining leadership-types have got their work cut out for them keeping everyone fighting fit, but for a start, there's been talk of bringing back traditional training methods."},{"name":"EULMORRANPEOPLE03601","text":"I'm talking about stuff what could be used to get unbloodied layabouts like me ready to take the field. Of course, there's also plenty of military men taking part, eager to hone their skills for the struggles ahead."},{"name":"EULMORRANPEOPLE03601","text":"You're welcome to participate too, if so inclined. Head out of the city through Open Arms and look for a soft-faced bloke. He'll see you sorted."},{"name":"EULMORRANPEOPLE03601","text":"We'll all need to step up to defend the city from now on, and resurrecting the classical ways is our best bet. Find the soft-faced bloke outside Open Arms if you want to know more."},{"name":"TRAVELLER03601","text":"Hail sinner well met. Come to join in the new─and by new I mean old─training? Excellent! Truth be told, interest has been less than enthusiastic..."},{"name":"TRAVELLER03601","text":"In case it's not bloody obvious, we're all of us struggling to adapt to the new normal. When you wake up one day and realize half the life decisions you made weren't your own, it's hard to adjust."},{"name":"TRAVELLER03601","text":"None can deny that we need a peacekeeping force to maintain order and defend against outside threats. Unfortunately, we're short on motivated recruits, and of the ones we've got only a handful are up to snuff."},{"name":"TRAVELLER03601","text":"Anyway, it's all very much a work in progress─and one we're hoping warriors like you can help us with, even if only by taking part as a guest. Draw attention to what we're trying to get off the ground, you know?"},{"name":"TRAVELLER03601","text":"So if you're keen to give it a go, let me know and I'll call for an amaro. Can't just up and walk there, no <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>. Ah, but first, in accordance with ancient traditions, I've got to teach you the creed..."},{"name":"TRAVELLER03601","text":"“<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> who fights with strength of stone unyielding, breathes deep of boundless sky and embraces serenity of rolling sea, against <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> none can stand.”"},{"name":"TRAVELLER03601","text":"Eh? What do you mean you've heard that one before? Far as I know it's one of many pearls of wisdom passed down through the ages. Dates back to a Kholusian poet who died some several centuries ago. Sure you're not mistaken?"},{"name":"TRAVELLER03601","text":"Eerie coincidences notwithstanding, if you'd like to hone your warcraft, you'd be hard-pressed to find a better option than unleashing everything you've got on one of our contraptions."},{"name":"SYSTEM","text":"You now have access to the Lawns─an expansion of Stone, Sky, Sea. This training ground can be accessed by speaking with the soft-faced bloke outside Eulmore."}],"reward":{"gil":575},"reqs":{"jobs":[{"lvl":80,"id":34}],"questsType":"all","quests":[69190,67654]}},"partials":[{"type":"npc","id":"1030408","obj":{"i":1030408,"n":"Weary Dockworker","l":2952,"q":1}},{"type":"npc","id":"1030409","obj":{"i":1030409,"n":"Soft-faced Bloke","l":2954,"q":1}},{"type":"quest","id":"69190","obj":{"i":69190,"n":"Shadowbringers","g":8,"l":"The Tempest","s":1060}},{"type":"quest","id":"67654","obj":{"i":67654,"n":"A Striking Opportunity","g":101,"l":"Idyllshire","s":6000,"f":1}}]}