{"quest":{"name":"Two Nuts Too Nutty","location":"The Crystarium","id":69134,"patch":5.0,"sort":20010,"unlocksFunction":1,"eventIcon":71341,"issuer":1027990,"target":1027988,"genre":111,"journal":["Halldor is pleased to see you are still alive and kicking."],"objectives":["Speak with Xylle."],"dialogue":[{"name":"HALLDOR","text":"Still at it, are we? I thought you might be. Aye, I felt you had a bright future with Clan Nutsy, and sure enough, you're not dead yet─which is more than I can say about some other poor sods."},{"name":"HALLDOR","text":"I've even heard whispers that you've caught the eye of our Eulmoran patrons..."},{"name":"HALLDOR","text":"What, no one told you? The whole system we've got here in the Crystarium first originated in Eulmore."},{"name":"HALLDOR","text":"Once upon a time a few perfumed gentlemen were bored out of their wits and desperate for entertainment, and so they pooled their considerable resources and started placing bounties on dangerous beasts to attract hunters."},{"name":"HALLDOR","text":"Their original intent was apparently to derive amusement from the gruesome deaths of those foolish and greedy enough to pursue these marks. A reprehensible pastime, wouldn't you agree?"},{"name":"HALLDOR","text":"But people are stronger and more clever than many realize. Like you─one-nut marks hardly pose a challenge to you now, do they? All the more reason to pester Xylle for permission to take on two-nut bills."},{"name":"XYLLE","text":"So Halldor thinks you're ready to undertake two-nut bills now, does he? How intriguing... Oh, why not."},{"name":"XYLLE","text":"We're down a few ranking hunters, so perhaps you can make up for their absence."},{"name":"XYLLE","text":"Do bear in mind that should you die whilst in pursuit of a mark, you will receive no compensation."},{"name":"XYLLE","text":"You will also be dead, which would be an inconvenience for the both of us. We have great expectations for you, hunter."},{"name":"SYSTEM","text":"Two-nut Clan mark bills are now available."},{"name":"SYSTEM","text":"You are now permitted to take bills for two-nut marks from the Clan Hunt board."},{"name":"SYSTEM","text":"New quests and three-nut Clan mark bills will become available from Halldor in the Crystarium upon reaching level 76."},{"name":"HALLDOR","text":"You're ready for two-nut marks─I can feel it in my bones! March up to Xylle and demand she grant you permission to take them on!"}],"reward":{"gil":546},"reqs":{"jobs":[{"lvl":73,"id":34}],"quests":[69133]},"next":[69135]},"partials":[{"type":"npc","id":"1027990","obj":{"i":1027990,"n":"Halldor","l":2951,"q":3}},{"type":"npc","id":"1027988","obj":{"i":1027988,"n":"Xylle","l":2951,"s":5,"q":4,"t":"Clan Nutsy Member","r":1,"a":3246,"c":[9.48,9.58]}},{"type":"quest","id":"69133","obj":{"i":69133,"n":"Nuts to You","g":111,"l":"The Crystarium","s":20001,"f":1}},{"type":"quest","id":"69135","obj":{"i":69135,"n":"How Do You Like Three Nuts","g":111,"l":"The Crystarium","s":20020,"f":1}}]}