{"quest":{"name":"Akadaemia Anyder","location":"Eulmore","id":69132,"patch":5.0,"sort":30010,"icon":112349,"unlocksFunction":1,"eventIcon":71341,"issuer":1031144,"target":1031144,"genre":112,"journal":["The overwrought Ondo seems overjoyed to see you.","The overwrought Ondo has come ashore in search of an ally who can enter the city of Amaurot. It seems the Cups is being threatened by a great beast of savage temperament, and the Ondo fear it is an omen─that they have somehow incurred the wrath of the ancients. Perhaps a visit to the Bureau of the Administrator will explain the mystery behind the creature's sudden appearance...","After hearing your description of the beast, the clerk at the Bureau of the Administrator suspects it may be one of the Akadaemia Anyder's creations. He sends you south to the public offices of the Akadaemia, suggesting that you repeat your tale at the institution's front desk.","Once more you describe the savage creature with the cavernous maw, only to be told that the beast in question is, in fact, under the supervision of the Akadaemia's scholars. Seeing no harm in allowing you─a resident sponsored by Emet-Selch─an educational visit to their hallowed halls, the academic sends you into the Akadaemia Anyder to confirm the creature's containment for yourself.<br><br>※The Akadaemia Anyder can be accessed via the Duty Finder.","You have completed your “tour” of the Akadaemia Anyder, finding the entire institution besieged by chaos and carnage. Return to the front desk, and make your report to the waiting academic.","Speaking with the academic, you are treated to a brief lecture for every point of interest you noted within the Akadaemia. Most significantly, however, it seems that the mystery beast managed to escape both its containment <span class=\"emphasis\">and</span> the notice of those outside the institution. With nothing left to learn, you prepare to make your way back to the Derelicts and the waiting Ondo.","It seems your visit to the Akadaemia Anyder has produced more questions than answers, leaving the Ondo concerned that the creature now threatening the Cups was able to slip the bonds of the ancients themselves. Otherwise, he seems greatly relieved that his people have done nothing to incur the old ones' wrath. The Ondo promises to share this news with his fellows, and bids you come to the Tempest to join them in the hunt..."],"objectives":["Speak with the administrative clerk.","Speak with the Akadaemia academic.","Enter the Akadaemia Anyder.","Speak with the Akadaemia academic.","Report to the overwrought Ondo."],"dialogue":[{"name":"ONDOPEOPLE03596","text":"Oh, land-dweller! You were one of the ancients' messengers, yes? How fortunate I have found you!"},{"name":"ONDOPEOPLE03596","text":"We need your help. Ever sssince the abyss was lit with the city's lanterns, a great beast the likes of which we have never ssseen has begun hunting near the Cups."},{"name":"ONDOPEOPLE03596","text":"It thrashes and gnashes with its cavernous maw, leaving nothing but tattered flesh in its wake. The eldest of the aath fear it is an omen─a harbinger of our people's destruction."},{"name":"ONDOPEOPLE03596","text":"Have we angered the ancients? We cannot know. We dare not enter their sssacred abode without first receiving their blessings."},{"name":"ONDOPEOPLE03596","text":"That is why I came to this town of land-dwellers, to ssseek those who had helped us before. And here you are!"},{"name":"ONDOPEOPLE03596","text":"Please, enter the ancients' city once more. Ssspeak with them, and learn what we have done to earn their ire..."},{"name":"SYSTEM","text":"A hostile creature of unknown origin threatens the lives of the Ondo people. Perhaps the clerk in Amaurot's Bureau of the Administrator can shed some light on this mystery beast."},{"name":"ONDOPEOPLE03596","text":"The ancients welcomed you once before, yes? Please, ssspeak with them on our behalf, and learn what we can do to placate their wrath."},{"name":"OFFICIAL03596","text":"<span class=\"highlight-purple\">How may I help you?</span>"},{"name":"OFFICIAL03596","text":"<span class=\"highlight-purple\">...And this beast was like no other, you say? Judging by the description, it may very well be one of the new types of fauna being created by the researchers of the Akadaemia Anyder.</span>"},{"name":"OFFICIAL03596","text":"<span class=\"highlight-purple\">As such, this matter is out of my purview. I suggest you take your claims to the Bureau of the Architect, or better yet, speak with an Akadaemia scholar directly.</span>"},{"name":"OFFICIAL03596","text":"<span class=\"highlight-purple\">You will find the Akadaemia Anyder and its public offices to the south of this building. If this mystery beast is one of their experiments, then they will surely have more information to offer you.</span>"},{"name":"OFFICIAL03596","text":"<span class=\"highlight-purple\">Take your claim to the Akadaemia Anyder public offices─the attendant at the front desk should be able to offer you more information on this mystery creation.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Welcome to the public offices of the Akadaemia Anyder. The hallowed halls of the Akadaemia itself are restricted to accredited scholars.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">...Ah, my apologies. If I am not mistaken, your residency was arranged directly by Emet-Selch himself.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">As such, you have been granted special dispensation to enter our prestigious institution. Might I ask what has prompted your visit with us today...?</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">...I see. Yes, that particular creation is under our supervision.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">If you would like to confirm the beast's containment yourself, then might I suggest a tour of the grounds? Our head researcher is in residence, and may be available to answer questions about the experiment you described.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Your zeal for knowledge is impressive in one so young. I do implore you, however, to be careful inside the Akadaemia. Mind what you touch, and try not to distract the other researchers from their work.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Finally, I must insist that you report to me on your return─it wouldn't do to lose track of our little visitor. This way, if you please.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Yes, little one? Were you not ready to enter the Akadaemia?</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Ah, our studious visitor returns. What did you think of our experiments? Were your questions answered in a satisfactory manner?</span>"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The scholars had turned into monsters."},{"name":"A1","text":"The experiments had escaped."},{"name":"A1","text":"I never thought of Lahabrea as an academic..."},{"name":"A1","text":"I have nothing more to ask."},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">What you witnessed would not have been transformation magicks. 'Tis more likely you observed the results of our research into advanced creation.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Shapechanging is a temporary effect at best. Creation, on the other hand, converts one's life energies into aether, which is then expended to bring a well-constructed concept into solid reality.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">By combining the aether of many individuals, we can theoretically create entities of ever greater complexity and grandeur─the methodology of which is the focus of our current experiments.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Was there aught else which piqued your curiosity? I shall endeavor to provide you with answers to the best of my ability.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">...Escaped? I should think not. The Akadaemia Anyder boasts the most-secure facilities and research protocols of any institution on this star.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Ah, but they <span class=\"emphasis\">were</span> scheduled to conduct research on those samples we captured from across the sea. Is it possible they were even more potent than we anticipated?</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">...Yet even if such were the case, one cannot dismiss the resourcefulness of our scholars─not to mention the presence of the esteemed Lahabrea. Yes, I am certain they will soon have the situation well in hand.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">You needn't worry your young mind about such things. And do not be discouraged─'tis a pity your inquiries were disrupted this time, but there will be other opportunities to visit.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Was there aught else which piqued your curiosity? I shall endeavor to provide you with answers to the best of my ability.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Oh my, yes. There are few who can match his knowledge and expertise in the field of phantom creation.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">You passed through the Words of Lahabrea, did you not? I imagine you found the research material there to be of particular interest, considering the purpose of your visit.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Was there aught else which piqued your curiosity? I shall endeavor to provide you with answers to the best of my ability.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">No? Nothing? Well, as long as your thirst for knowledge has been slaked, then we should consider your visitation time well spent.</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">As for the creature you suspect has broken free, rest assured that our officials will be taking up the thread of your investigation. You...are certain it was not within the Akadaemia grounds?</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Hm. If by some miracle Archaeotania <span class=\"emphasis\">has</span> gained its freedom...then what has become of the researchers tasked to contain it?</span>"},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">Hm? Oh, idle musings, nothing more! Was there not an acquaintance awaiting news of your progress? Best not keep them in the dark!</span>"},{"name":"SYSTEM","text":"It seems the Akadaemia Anyder has no further information for you regarding the mystery beast. Return to the Derelicts, and make your report to the overwrought Ondo."},{"name":"ACADEMYGATEKEEPER03596","text":"<span class=\"highlight-purple\">The Akadaemia shall handle the remainder of this investigation, little one. You should return to your acquaintance and share what wisdom you have learned this day.</span>"},{"name":"ONDOPEOPLE03596","text":"You have returned! What of the ancients? How do we sssoothe their rancor!?"},{"name":"ONDOPEOPLE03596","text":"You mean the beast...essscaped? It was not released to torment us? A terrible creation indeed, if it can ssslip the bonds of the ancients..."},{"name":"ONDOPEOPLE03596","text":"And yet, it is a relief to know that we did not ssslight the old ones─that it was not our deeds which sssummoned forth this fiend."},{"name":"ONDOPEOPLE03596","text":"I will ssswim back to the Cups and consult my comrades. We must think on a ssstrategy."},{"name":"ONDOPEOPLE03596","text":"Though huge in sssize, the beast is ssswift. Elusive. My kin would be glad to have your aid in ssseeking its tracks."},{"name":"ONDOPEOPLE03596","text":"Finless ones do best where there is no water...and the sea has yet to reclaim our home. Come to the ocean floor, land-dweller. Come and hunt the beast!"}],"reward":{"gil":4917,"items":[{"id":25197},{"id":25190}],"instance":71},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69190]}},"partials":[{"type":"npc","id":"1031144","obj":{"i":1031144,"n":"Overwrought Ondo","l":2952,"q":1}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"instance","id":"71","obj":{"i":71,"n":"Akadaemia Anyder","c":61801,"t":"Dungeons","min_lvl":80,"max_lvl":80,"min_ilvl":410,"max_ilvl":470}},{"type":"quest","id":"69190","obj":{"i":69190,"n":"Shadowbringers","g":8,"l":"The Tempest","s":1060}}]}