{"quest":{"name":"How Do You Like Three Nuts","location":"The Crystarium","id":69135,"patch":5.0,"sort":20020,"unlocksFunction":1,"eventIcon":71341,"issuer":1027990,"target":1027988,"genre":111,"journal":["Halldor seems positively giddy to see you again."],"objectives":["Speak with Xylle."],"dialogue":[{"name":"HALLDOR","text":"Hey there, killer. Getting bored of those two-nut marks, I'll wager?"},{"name":"HALLDOR","text":"Aye, they might've been enough to get the blood pumping and the heart racing before, but it's only a matter of time before the excitement fades."},{"name":"HALLDOR","text":"I know exactly how you feel, my friend! I myself can think of nothing more exciting than being driven to my mortal limits. To be forced to bring fang and claw to bear when weapons shatter and you're scrambling to survive with whatever is at hand!"},{"name":"HALLDOR","text":"Who are we to deny you that singular sport, aye!? That's why I've recommended you for three-nut marks! Be proud! Soon you'll be dancing with death herself!"},{"name":"HALLDOR","text":"Go and speak with Xylle. I'm sure she'll be absolutely thrilled to grant you this wonderful privilege!"},{"name":"XYLLE","text":"So you wish to hunt three-nut marks, do you? I thought as much when I saw you approach. Also, Halldor has been clamoring day and night for you to be granted permission, so there was that too."},{"name":"XYLLE","text":"Whenever the subject of you and your exploits comes up, he is filled with a fiery passion. It is as though he lives vicariously through your tales... In any event, if you desire greater challenges, then you may have them."},{"name":"XYLLE","text":"Do be mindful of the increased risks in pursuing these marks. You are of no use to us dead or horribly maimed."},{"name":"SYSTEM","text":"Three-nut Clan mark bills are now available."},{"name":"SYSTEM","text":"You are now permitted to take bills for three-nut marks from the Clan Hunt board."},{"name":"SYSTEM","text":"New quests and elite Clan mark bills will become available from Halldor in the Crystarium upon reaching level 80."},{"name":"HALLDOR","text":"What are you waiting for!? The promise of death-defying adventure awaits! Go and see Xylle at once!"}],"reward":{"gil":559},"reqs":{"jobs":[{"lvl":76,"id":34}],"quests":[69134]},"next":[69136]},"partials":[{"type":"npc","id":"1027990","obj":{"i":1027990,"n":"Halldor","l":2951,"q":3}},{"type":"npc","id":"1027988","obj":{"i":1027988,"n":"Xylle","l":2951,"s":5,"q":4,"t":"Clan Nutsy Member","r":1,"a":3246,"c":[9.48,9.58]}},{"type":"quest","id":"69134","obj":{"i":69134,"n":"Two Nuts Too Nutty","g":111,"l":"The Crystarium","s":20010,"f":1}},{"type":"quest","id":"69136","obj":{"i":69136,"n":"Too Many Nutters","g":111,"l":"The Crystarium","s":20030,"f":1}}]}