{"quest":{"name":"Community Cohesion","location":"The Tempest","id":69130,"patch":5.0,"sort":10030,"icon":100929,"unlocksFunction":1,"eventIcon":71341,"issuer":1030477,"target":1027777,"genre":118,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>The patronizing Amaurotine is struggling to conceal their disapproval of your attire.","While some might applaud your creative choice of attire, in Amaurot one is best served going about in the traditional robes worn by the vast majority of the citizenry. Fortunately, you need not struggle to fashion your own robes, for the patronizing Amaurotine recalls seeing a gentle soul outside the Hall of Rhetoric who was carrying some perfectly suited for one of your diminutive stature.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","While the gentle Amaurotine was indeed in possession of a spare set of smaller robes, they were the result of a failed attempt to fashion larger ones, and so they summarily disposed of them. If you are to obtain your own, you have no choice but to speak with someone at the Bureau of the Architect and request the appropriate concept.","The concept clerk is happy to assist you, but after observing that you are rather lacking in “creative potential,” they declare that you must first use an aetheric rope to capture a weakened cubus. The creature's aetheric energies must be harnessed so that even one of your limited abilities can create their own robes.","The cubus is quickly and easily subdued. All that remains is to deliver it to the concept clerk as requested.","Your cubus meets with the concept clerk's approval, and you are subsequently furnished with a creation matrix─a crystal inscribed with the robe concept and infused with the necessary energies. With said crystal in hand, any native son or daughter of Amaurot could instinctively create robes for their personal use...but alas, those who cannot be accurately described as such may struggle to utilize the mysterious device as intended..."],"objectives":["Speak with the gentle Amaurotine outside the Hall of Rhetoric.","Speak with the concept clerk at the Bureau of the Architect.","Use the aetheric rope on a weakened cubus.","Deliver the cubus to the concept clerk."],"dialogue":[{"name":"AMAUROTPEOPLEF03594","text":"<span class=\"highlight-purple\">I must say, little one...those garments you're wearing. They are your own original concepts, I take it? Clearly they must be, given their rather...singular flamboyance.</span>"},{"name":"AMAUROTPEOPLEF03594","text":"<span class=\"highlight-purple\">I would never dream of stifling a fledgling creator's creativity, but to parade about in your cultivated individuality is hardly praiseworthy.</span>"},{"name":"AMAUROTPEOPLEF03594","text":"<span class=\"highlight-purple\">An Amaurotine of character shares their creations with the community─they do not hoard them for their use alone. To delight in disparity is a mark of the morally deficient.</span>"},{"name":"AMAUROTPEOPLEF03594","text":"<span class=\"highlight-purple\">Disparity engenders feelings of want and resentment, which degrade the bonds of fellowship. Thus do we encourage creators to share and share alike, else we risk kindling the embers of covetousness and violence that ever smolder in the hearts of all.</span>"},{"name":"AMAUROTPEOPLEF03594","text":"<span class=\"highlight-purple\">Therefore I must implore you, little one, to cast aside your original trappings and don the communal robes, that you might acquit yourself as an equal among many. In so doing, you will be afforded greater respect and autonomy.</span>"},{"name":"AMAUROTPEOPLEF03594","text":"<span class=\"highlight-purple\">Worry not, for this will be a simple affair. I recall seeing a gentle soul outside the Hall of Rhetoric carrying robes perfectly suited for one of your diminutive stature. I am sure they will be glad to share their wealth with you.</span>"},{"name":"AMAUROTPEOPLEF03594","text":"<span class=\"highlight-purple\">But do hurry, little one. The eyes of the collective are ever watching and weighing your worth.</span>"},{"name":"AMAUROTPEOPLEF03594","text":"<span class=\"highlight-purple\">You mustn't carry on in those garments a moment longer, little one. Seek out that gentle soul I spoke of, the one I saw outside the Hall of Rhetoric, and pray that they still have those robes that should fit your tiny form.</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">Oho, aren't we looking rather smart this <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">day</span></span>. What can I do for you, little one?</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">Robes to serve in lieu of your ensemble? Ah, how prudent. Alas, I have nothing I can offer you at this present time.</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">The ones your associate saw me carrying earlier were a failed experiment. I never intended to make them so small, so I disposed of them shortly thereafter.</span>"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A failed experiment?"},{"name":"A1","text":"..."},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">By your bemused expression I gather you find it odd that your elders can fail in so simple an application of creation magicks?</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">It is more common than you may realize, little one. In this instance, a gaggle of children was passing by as I held the image of the robes in my mind's eye. Simply by becoming aware of their presence was the form influenced and the final product changed.</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">All things considered, it could've been worse. Just the other day I was attempting to conceive a white-haired lion, when all of a sudden this exquisite eagle alighted on the nearby railing, giving me quite the shock─and dramatically altering my initial concept!</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">Yes, indeed, it was a most unexpected development, but not an altogether unwelcome one. Great strides are often born from unexpected impetuses.</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">But even inspiration has its limits. For all the wonders we have wrought, I do wonder if there will come a time when we have fully explored the potential of our powers─when there is truly nothing left unmade, and only iteration and imitation and stagnation remain...</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">But such esoteric matters need not concern you, little one!</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">For now, I would encourage you to embrace your creativity, and work your magicks without fear of failure.</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">Nevertheless, it would still be in your best interests to don the appropriate robes to avoid excess scrutiny. Why don't you go to the Bureau of the Architect and request the appropriate concept so you can fashion one yourself?</span>"},{"name":"AMAUROTPEOPLEG03594","text":"<span class=\"highlight-purple\">You may as well fashion the robes you seek yourself. Head to the Bureau of the Architect and speak with one of the clerks to request the concept.</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">Welcome to the Bureau of the Architect, little one. Are you here to request a concept for personal use? If so, what sort of concept did you have in mind?</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">Ahh, communal robes. That will take but a moment to prepare, but before I fill your request, I should caution you...</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">Pardon me for asking, but your creative potential is, um...relatively low, is it not? We are trained to assess these things, and I fear that you do not possess the ability to express this concept in physical form. It's almost as though you completely lack it, though that can't possibly be...</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">But regardless of the reason, you needn't worry. We have special tools that may be used to address this very eventuality.</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">I will furnish you with an aetheric rope you can use to restrain one of the misbegotten cubuses that congregate in the plaza north of the Akadaemia Anyder.</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">You will need to weaken your quarry before you can reliably bind them, but once you have, you can repurpose their energies to create your own robes.</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">Remember to weaken your quarry before you attempt to restrain them with the rope, else you will likely fail. Return here when you have finished.</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">Welcome back, little one. Did you succeed in binding a cubus?</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">You have done well, little one. Allow me to siphon its energies and prepare the matrix for you. It should only take a moment...</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">Here you are: a creation matrix that you may use to generate your own robes.</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">The concept is inscribed upon the crystal, which has been infused with the aether of the beast you brought me.</span>"},{"name":"AMAUROTRECEPTION03594","text":"<span class=\"highlight-purple\">...What? Why are you looking at me as though you do not know how to channel the powers of creation? It is as natural as breathing─even a newborn babe has the instinct. Even if your potential is lacking, as one of our people, you must surely know what to do...</span>"}],"reward":{"gil":752,"aetherCurrent":1,"items":[{"id":18}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69188]}},"partials":[{"type":"npc","id":"1030477","obj":{"i":1030477,"n":"Patronizing Amaurotine","l":2958,"q":1}},{"type":"npc","id":"1027777","obj":{"i":1027777,"n":"Concept Clerk","l":2958,"q":1}},{"type":"quest","id":"69188","obj":{"i":69188,"n":"The End of a World","g":8,"l":"The Tempest","s":1040}}]}