{"quest":{"name":"The Boutique Always Wins","location":"Eulmore","id":69139,"patch":5.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1027544,"target":1027544,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"MOWEN","text":"You are the esteemed <span class=\"highlight\">Forename Surname</span>, yes? Allow me to introduce myself. I am Mowen, founder and chairwoman of the Boutique of Splendors."},{"name":"MOWEN","text":"Master Alphinaud has spoken quite highly of you and your unparalleled artistic abilities. Quite highly indeed..."},{"name":"MOWEN","text":"Forgive me my boldness, but I should be most honored if you were to register with us as a provider of collectables. As compensation, we can offer you a wide variety of goods that I am confident will meet with your approval."},{"name":"MOWEN","text":"Not direct compensation, to be clear. We have adopted a system rather similar to one with which you are doubtless familiar─and which I only recently learned of from Master Alphinaud."},{"name":"MOWEN","text":"For every delivery, you will receive payment in the form of scrips. This exclusive currency is redeemable only with the Boutique of Splendors. Limiting, perhaps, but you will find that the equipment and materials we have on offer more than make up for any inconvenience."},{"name":"MOWEN","text":"The woman who first conceived this approach was brilliant, wouldn't you agree? A true visionary who managed to bring together people from all walks of life and reshape the world with her boundless compassion and generosity..."},{"name":"MOWEN","text":"Oh, and I should mention that a negligible portion of the value of all collectables processed will be withheld to account for overhead and other assorted operating expenses. Doubtless I need not explain the necessity of this."},{"name":"MOWEN","text":"The Boutique of Splendors is always on the lookout for new artisans eager to share their talents with the world! Should you happen to know any such individuals, I pray you direct them to us!"},{"name":"SYSTEM","text":"In order to undertake this quest, you must be a Disciple of the Hand or the Land of level 70 or above."}],"reqs":{"jobs":[{"lvl":70,"id":35}],"questsType":"all","quests":[68822,67634]},"next":[69265,70266]},"partials":[{"type":"npc","id":"1027544","obj":{"i":1027544,"n":"Mowen","l":2952,"q":1}},{"type":"quest","id":"68822","obj":{"i":68822,"n":"City of Final Pleasures","g":8,"l":"Kholusia","s":80}},{"type":"quest","id":"67634","obj":{"i":67634,"n":"Go West, Craftsman","g":95,"l":"Mor Dhona","s":600,"f":1}},{"type":"quest","id":"69265","obj":{"i":69265,"n":"Oh, Beehive Yourself","g":112,"l":"Eulmore","s":8001,"f":1}},{"type":"quest","id":"70266","obj":{"i":70266,"n":"An Original Improvement","g":85,"l":"The Crystarium","s":10,"f":1}}]}