{"quest":{"name":"Nuts to You","location":"The Crystarium","id":69133,"patch":5.0,"sort":20001,"unlocksFunction":1,"eventIcon":71341,"issuer":1031348,"target":1027988,"genre":111,"journal":["The Hume lout thinks you might be the right person for a questionable job."],"objectives":["Speak with Halldor at Temenos Rookery.","Speak with Xylle."],"dialogue":[{"name":"STRONGHUME03597","text":"Oho! Yer that, um...that... Yer <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>, aren't ye!?"},{"name":"STRONGHUME03597","text":"Halldor's been asking after ye. Ye know Halldor, aye? Clan Nutsy's man? If yer keen to hunt the deadliest marks for the biggest bounties, then ye might want to seek him out."},{"name":"STRONGHUME03597","text":"Ye'll find him by the board over in the rookery. Though, uh...if I were ye, I'd steer clear of that whole nasty business. Bad for one's health, it is..."},{"name":"HALLDOR","text":"C-Could it be? The esteemed warrior <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>!?"},{"name":"HALLDOR","text":"Well met, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>, well met! You are a very hard <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to track down, by all accounts, yet here you are, in the flesh. How very blessed I am to make your acquaintance."},{"name":"HALLDOR","text":"I am Halldor of Clan Nutsy. Perhaps you have heard of us? We have certainly heard of you, I can tell you that! A fighter, through and through."},{"name":"HALLDOR","text":"I'll come right to it─interested in joining the clan?"},{"name":"HALLDOR","text":"Apologies, apologies. Only a fool would sign up without knowing what we're about─and you're no fool, I can see that."},{"name":"HALLDOR","text":"The clan is a, how shall I put it...an association of adventurous souls who make a living hunting certain notable fiends. Marks, as we are wont to call them. Surely you're familiar with the concept?"},{"name":"HALLDOR","text":"Norvrandt is home to myriad living creatures, many of which pose a threat to her good people. Thus did the Exarch─at least I think it was him?─in his boundless wisdom, call upon the Settlement council to develop a framework that would “encourage” motivated hunters to dispatch these menaces."},{"name":"HALLDOR","text":"To wit, ye brave souls who slay marks shall receive due compensation. Not at all a bad arrangement, eh?"},{"name":"HALLDOR","text":"If you've a mind to reap the benefits, speak with Xylle over there. She'll record your name in the ledger and see you registered as a clan member."},{"name":"XYLLE","text":"May I help you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>?"},{"name":"XYLLE","text":"...At the urging of Halldor, was it? I see."},{"name":"XYLLE","text":"You are plainly more than capable of acquitting yourself well enough in battle, and so I have no grounds to refuse you. I hereby accept your application to join Clan Nutsy."},{"name":"XYLLE","text":"Check the board for the latest bills. The tougher the mark, the better the reward. Hunt what you like or nothing at all."},{"name":"XYLLE","text":"However, you may only undertake hunts designated appropriate for a member of your current status─a novice. The clan is disinclined to allow unproven hunters to commit suicide by mark."},{"name":"XYLLE","text":"Once you have achieved a sufficient measure of success, you will be permitted to pursue more dangerous fiends. Do try not to die before then."},{"name":"SYSTEM","text":"As a new member of Clan Nutsy, you are permitted to take bills for one-nut Clan marks from the Clan Hunt board."},{"name":"SYSTEM","text":"Defeat the monsters described on the bills and you will be rewarded with tokens which can be exchanged for exclusive items."},{"name":"SYSTEM","text":"To exchange tokens for exclusive items, speak with either Xylle in the Crystarium, or with Ilfroy in Eulmore."},{"name":"SYSTEM","text":"New quests and two-nut Clan mark bills will become available from Halldor in the Crystarium upon reaching level 73."},{"name":"HALLDOR","text":"Go and talk to Xylle to sign up! Don't let her charming demeanor fool you─she's a lovely person. If she likes you."}],"reward":{"gil":606},"reqs":{"jobs":[{"lvl":70,"id":34}],"questsType":"all","quests":[67658,68817]},"next":[69134]},"partials":[{"type":"npc","id":"1031348","obj":{"i":1031348,"n":"Hume Lout","l":2951,"q":1}},{"type":"npc","id":"1027988","obj":{"i":1027988,"n":"Xylle","l":2951,"s":5,"q":4,"t":"Clan Nutsy Member","r":1,"a":3246,"c":[9.48,9.58]}},{"type":"quest","id":"67658","obj":{"i":67658,"n":"Elite and Dangerous","g":96,"l":"Ishgard","s":16001,"f":1}},{"type":"quest","id":"68817","obj":{"i":68817,"n":"Travelers of Norvrandt","g":8,"l":"The Crystarium","s":30}},{"type":"quest","id":"69134","obj":{"i":69134,"n":"Two Nuts Too Nutty","g":111,"l":"The Crystarium","s":20010,"f":1}}]}