{"quest":{"name":"By the Time You Hear This","location":"The Crystarium","id":69131,"patch":5.0,"sort":30001,"icon":112348,"unlocksFunction":1,"eventIcon":71341,"issuer":1028898,"target":1028899,"genre":111,"journal":["Bethana of the Crystarium guard has a look of grim determination in her eyes.","Bethana, a member of the Crystarium guard, explains that the Exarch has requested your assistance. You are to enter the Crystal Tower and provide support to a team of researchers who plan to investigate the inner reaches. Unfortunately, their way has been barred by a number of hostile creatures and machinations, and their work cannot proceed until these threats have been eliminated.","In the Exedra, Bethana informs you that in addition to clearing a path for the researchers, you are to investigate the origin of an aetherial disturbance detected from within. Though you are no stranger to the labyrinthine passageways of the Crystal Tower, your expedition will lead you into largely unexplored territory, where any number of hidden dangers may lurk.<br><br>※The Twinning can be accessed via the Duty Finder.","Having conquered the ancient guardians that dwell at the deepest levels of the Crystal Tower, the team of researchers may now go about their work undisturbed. Bethana would no doubt wish to hear your account of the creatures you encountered, as well as any information pertaining to aetherial anomalies.","According to Bethana, the researchers have recovered a bizarre contraption from inside the Crystal Tower, which you recognize from your experiences on the Source. At your command, the machine whirs into life and relays a message recorded by the eighteenth president of Garlond Ironworks, a descendant of Biggs. The intended recipient is none other than G'raha Tia, who appears to have still been in a deep slumber within the tower. It becomes apparent that the Ironworks spent many, many years preparing to send him across time and space to the First, and their hopes for the worlds that may yet be saved are succinctly conveyed in this recording. While the circumstances surrounding the journey of G'raha Tia and the Crystal Tower remain a mystery, the researchers of the Crystarium will strive to unearth more information in the days to come."],"objectives":["Speak with Bethana.","Enter the Twinning.","Speak with Bethana."],"dialogue":[{"name":"BETHANA","text":"Excuse me. A word, if you would be so kind."},{"name":"BETHANA","text":"We of the Crystarium guard have a request to make of you."},{"name":"BETHANA","text":"Our researchers are planning to enter the Crystal Tower to learn more of its history. However, there is a problem."},{"name":"BETHANA","text":"Now, what I am about to reveal is strictly confidential. Were word to get out, panic would spread throughout the citizenry."},{"name":"BETHANA","text":"Our scouts have reported that ferocious beasts and bizarre machines roam the hallways. Until we can eliminate these threats, none may enter. Strange aetherial readings have also been detected, and we suspect that the phenomena are linked."},{"name":"BETHANA","text":"The Exarch has ordered us to seek your aid in making the tower safe for our researchers to go about their work."},{"name":"BETHANA","text":"He mentioned that you are better equipped than most to face the dangers that lurk in the tower, though he elected not to go into detail. Is this true?"},{"name":"BETHANA","text":"Then your prior experience may prove beneficial. Come, let us proceed to the entrance."},{"name":"BETHANA","text":"I take it your preparations are complete?"},{"name":"BETHANA","text":"Listen carefully. You are to lead a party of elite troops into the tower and respond to any hostility with lethal force."},{"name":"BETHANA","text":"Once the way is clear, the researchers can begin their expedition."},{"name":"BETHANA","text":"Our main objective is to identify the source of the aetherial disturbance. The tower cannot be considered safe until we do. Should you encounter any opposition beyond your capabilities, you are to withdraw immediately. I wish you the best of luck."},{"name":"BETHANA","text":"Unfortunately, we have only limited information regarding the inner reaches of the tower. The scouts who were able to escape with their lives were in many cases rendered...insensible."},{"name":"BETHANA","text":"Excellent work. Not only did you reveal the cause of the aetherial fluctuations, you were able to remove the threat entirely. Thanks to you, the researchers have already completed their preliminary observations."},{"name":"BETHANA","text":"Their findings were somewhat surprising."},{"name":"BETHANA","text":"The Crystal Tower appears not to have been created by the Ronkans or any other known civilization. Its origins are veiled in mystery, much like the Exarch and yourself."},{"name":"BETHANA","text":"Forgive me. It is not the time for idle speculation. We have, however, recovered an artifact, though its purpose is unclear. It may even be purely decorative."},{"name":"BETHANA","text":"Have you ever encountered anything like this?"},{"name":"BIGGSTHETHIRD","text":"(-???-)&lt;bzzzt&gt; ...has come to carry out our plan. This will be my last recording."},{"name":"BIGGSTHETHIRD","text":"(-???-)With the tower activated and the temporal displacement apparatus online, all that remains is to throw the switch. And pray."},{"name":"BIGGSTHETHIRD","text":"(-???-)I'm sorry, I truly am. I wish there was another way."},{"name":"BIGGSTHETHIRD","text":"(-???-)But you are our best chance of success. Our only hope. Your gift will allow you to become one with the tower and survive the journey through time and space. Were our technology as advanced as that of the Allagans, perhaps we could've gone with you."},{"name":"BIGGSTHETHIRD","text":"(-???-)Alas, it was not to be. But when you are finally reunited, all of the hardship, all of the sacrifice will've been worth it, I'm sure."},{"name":"BIGGSTHETHIRD","text":"(-???-)Just promise me you'll spare a thought for those you leave behind. And we'll be thinking of you, too, for as long as this world lasts, though I fear it will not be for much longer."},{"name":"BIGGSTHETHIRD","text":"(-???-)This is Biggs, third of his name, eighteenth president of Garlond Ironworks, signing off. May the Twelve be at your side, G'raha Tia. &lt;bzzzt&gt;"},{"name":"BETHANA","text":"A person's voice coming from a machine? To be honest, I cannot make head nor tail of it. Do you have any idea what that was about?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Yes, it made perfect sense."},{"name":"A1","text":"Even if I told you, you wouldn't believe me."},{"name":"BETHANA","text":"Hmm... Considering your connection to the Exarch, I am not entirely surprised."},{"name":"BETHANA","text":"Yes, I can tell that you know more than you are letting on. Very well. I will not begrudge you your secrets."},{"name":"BETHANA","text":"Though one thing <span class=\"emphasis\">was</span> clear, even to me. The people who left the message were facing a great catastrophe."},{"name":"BETHANA","text":"They placed their faith in the Crystal Tower, in much the same way we have done ever since the Flood of Light."},{"name":"BETHANA","text":"Our prayers for salvation were answered when you and the Exarch returned the night to us and freed us from the terror of the sin eaters."},{"name":"BETHANA","text":"I sense that this was all made possible by those people from a time long forgotten. We should do our utmost to learn more of them."},{"name":"BETHANA","text":"Perhaps the researchers will uncover more of these messages?"},{"name":"BETHANA","text":"In any case, you have performed admirably in service of the Crystarium. We may have need of your strength and guidance in days to come. Until then, fare you well."}],"reward":{"gil":4455,"items":[{"id":25198},{"id":25186}],"instance":68},"reqs":{"jobs":[{"lvl":80,"id":34}],"quests":[69190]}},"partials":[{"type":"npc","id":"1028898","obj":{"i":1028898,"n":"Bethana","l":2951,"q":1}},{"type":"npc","id":"1028899","obj":{"i":1028899,"n":"Bethana","l":2951,"q":1}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"instance","id":"68","obj":{"i":68,"n":"The Twinning","c":61801,"t":"Dungeons","min_lvl":80,"max_lvl":80,"min_ilvl":410,"max_ilvl":470}},{"type":"quest","id":"69190","obj":{"i":69190,"n":"Shadowbringers","g":8,"l":"The Tempest","s":1060}}]}