{"quest":{"name":"The Best Way Out","location":"The Crystarium","id":69145,"patch":5.0,"sort":680,"icon":100914,"eventIcon":71201,"issuer":1029853,"target":1029614,"genre":8,"journal":["Thancred seems keen to quit the infirmary.","Thancred bids you make your way to the Ocular while he and Minfilia gather the remaining Scions for the coming meeting. As you turn to depart, he reminds you to deliver the soldier's message of support to the Exarch─something that is probably better done in private, before the others arrive.","However hard he tries to conceal it, the Exarch is plainly burdened by the sacrifices made in the name of restoring balance to the First. Be that as it may, his conviction shows no sign of wavering, and he seems heartened by your show of solidarity. Once Thancred and the others arrive, you set about discussing Vauthry's recent threat, the Exarch sharing what he suspects of the man: namely, that he may have control not only over the sin eaters, but the people of Eulmore as well. Though all are agreed that destroying the Lightwardens remains the most expedient method of fighting back, it seems that little progress has been made in finding them. When no other options present themselves, Minfilia suggests that you travel to Amh Araeng, where she may become one with the Oracle of Light, thereby acquiring the power to locate your quarry. Thancred is not best pleased by this prospect, but has no choice but to concede defeat in the face of Minfilia's determination.","Sensing your concern, Minfilia reaffirms her commitment to her chosen course of action, and asks that you trust her judgment with an earnestness worthy of her namesake. She then departs─presumably to make her preparations before joining Thancred at the gates.","After a short wait, Minfilia arrives at the appointed place and declares her readiness to depart. But before proceeding, you give her one last opportunity to abandon her chosen course. Her emphatic reply leaves little room for argument, however, so the group turns its attention to the question of how best to pass through Amh Araeng unnoticed. At Alisaie's suggestion, you decide to split up─sending her, Alphinaud, and Y'shtola to the east to distract the Eulmoran Army while the rest of you take the western route to Nabaath Areng.","As you near the gate to Amh Araeng, you realize you are not the only one contemplating the ordeals that may lie ahead. Hearing Thancred's quiet plea for assistance in protecting Minfilia, his trepidation could not be more obvious.","You speak with Hardyss, who grants you passage through the gate─perhaps against her better judgment.","Vibrant violet gives way to dry red and orange as you, Urianger, Thancred, and Minfilia pass through the gate and proceed into the Hills of Amber. Taking in the dusty and precipitous landscape, your eyes fall upon what appears to be a village nearby, and the party pauses for a moment to prepare for whatsoever may come.","As Minfilia looks out over the valley before you, you see newfound purpose in her eyes. Whatever doubts she may harbor, it is plain she is pleased to be in control of her own destiny at long last."],"objectives":["Speak with the Crystal Exarch in the Ocular.","Speak with Minfilia.","Wait for Minfilia at Tessellation.","Speak with Thancred.","Speak with Hardyss.","Speak with Minfilia."],"dialogue":[{"name":"RYNE","text":"If I were stronger...how many people would still be alive?"},{"name":"THANCRED","text":"If you're ready, why not go on ahead to the Ocular? You can keep the Exarch company while I fetch Alphinaud. Don't worry, I mean to borrow the swiftest amaro I can find, so we shouldn't keep you long."},{"name":"THANCRED","text":"Be sure to pass on that message, eh?"},{"name":"MYSTERYVOICE","text":"Welcome, my friend. Tales of your heroism on the battlefield precede you─though I confess I found them more gladdening than surprising. I hear no few of our people have you to thank for plucking them from the jaws of death."},{"name":"MYSTERYVOICE","text":"Would that they had not needed saving to begin with. But the responsibility for that lies with me."},{"name":"MYSTERYVOICE","text":"...One of our soldiers said that?<br>...Thank you."},{"name":"MYSTERYVOICE","text":"Rest assured that I fully intend to continue our work. I will not shrink from what must be done. Now least of all."},{"name":"MYSTERYVOICE","text":"Though I mourn the lost, I will not lose myself to grief. And even should regret be my constant companion, I will follow the path I have chosen to its end."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We have some time before the others arrive, if you'd like to talk?"},{"name":"A1","text":"As will I."},{"name":"MYSTERYVOICE","text":"...And if I were to confess any doubts I might harbor, no one need ever know?"},{"name":"MYSTERYVOICE","text":"No, I believe you have enough burdens without my adding to them. Nevertheless... Thank you."},{"name":"MYSTERYVOICE","text":"Of that I have no doubt. And if ever we should appear to falter...it will only be because we are fatigued after a battle well fought."},{"name":"MYSTERYVOICE","text":"I thank you for your kind words. Now, we have plans to make, do we not?"},{"name":"MYSTERYVOICE","text":"If this is the course you have agreed on, I will not object─though I am afraid it will be difficult for us to spare any of the guard to accompany you."},{"name":"MYSTERYVOICE","text":"I can but promise that you will be well looked after upon your return. Just...see to it that you <span class=\"emphasis\">do</span> return, all right?"},{"name":"ALPHINAUD","text":"If I had only been able to locate Kholusia's Lightwarden, it might not have come to this..."},{"name":"ALISAIE","text":"I can't imagine what Thancred must be feeling to behave this way. To say he's changed since coming here would be an understatement. He may as well be a different person. He reminds me of─"},{"name":"ALISAIE","text":"...Ah. He reminds me of Father."},{"name":"ALISAIE","text":"He argued with us for months about our plan to go to Eorzea, but in the end, he accepted our decision. I...do hope he's doing well."},{"name":"URIANGER","text":"Though Thancred hath long known whither this path doth lead, his journey hath brought him no closer to acceptance."},{"name":"YSHTOLA","text":"Minfilia demonstrated impressive resolve just now. It seems that she understands what must be done...though I do wonder if she is truly prepared to make the choice."},{"name":"YSHTOLA","text":"Should she falter, it will fall to Thancred to guide her. However much he wishes it were otherwise."},{"name":"EMETSELCH","text":"&lt;sigh&gt; Will you never grow tired of shuffling your feet?"},{"name":"EMETSELCH","text":"If you have something to ask me, <span class=\"emphasis\">ask</span>."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Tell me about Zodiark."},{"name":"A2","text":"Nothing springs to mind."},{"name":"EMETSELCH","text":"As I told you before─Zodiark is the creation of my people. The <span class=\"emphasis\">first</span> people."},{"name":"EMETSELCH","text":"We summoned Him, as your kind might summon a primal─albeit an infinitely more powerful one."},{"name":"EMETSELCH","text":"And like one of your primals, He tempered us. It was only natural. There is no resisting such power."},{"name":"EMETSELCH","text":"And so we Ascians came to exist solely to bring about the rule of darkness. His darkness."},{"name":"EMETSELCH","text":"Of course, some would call us “evil” for it...and they would be fools. Though that is only to be expected, given their innate inability to conceive of the nature of our universe."},{"name":"EMETSELCH","text":"...But I believe I am repeating myself. Do you not trust me to speak honestly? Do you hope to catch me in a lie?"},{"name":"EMETSELCH","text":"<span class=\"emphasis\">Really.</span> I have no need of deception─and even if I did, I assure you: you would find it quite indistinguishable from the truth."},{"name":"EMETSELCH","text":"Hmph. Perhaps I flatter myself expecting you to take an interest in the knowledge I possess. Or perhaps I flatter <span class=\"emphasis\">you</span>."},{"name":"RYNE","text":"I'm sorry to be so insistent. But I know this is the only way."},{"name":"RYNE","text":"If you're willing to give me a chance, come with us."},{"name":"RYNE","text":"Sorry for the wait─I'm ready now."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"And you're sure you want to do this? Completely sure?"},{"name":"A3","text":"There has to be another way."},{"name":"RYNE","text":"Look...no matter what happens to me, I'm sure that I don't want to go back to being who I was."},{"name":"RYNE","text":"I want to be stronger─strong enough to face my destiny. And I want to believe that I can play a part in saving this world."},{"name":"RYNE","text":"I hope you can find it in yourself to believe it, too."},{"name":"YSHTOLA","text":"When you put it that way, how could we not?"},{"name":"YSHTOLA","text":"It is your decision to make. Just be sure that you are prepared, when the time comes."},{"name":"URIANGER","text":"If all are assembled, shall we depart?"},{"name":"THANCRED","text":"We'll follow your lead. What route would you have us take?"},{"name":"ALISAIE","text":"About that─there's something I neglected to mention."},{"name":"ALISAIE","text":"I saw a Eulmoran airship coming in to land over Amh Araeng while I was on my way back to the Crystarium."},{"name":"ALISAIE","text":"No doubt the same vessel that bore Vauthry's forces to Rak'tika."},{"name":"ALPHINAUD","text":"...Meaning we can expect to encounter armed resistance on our journey through the region."},{"name":"ALISAIE","text":"Right. Now, Nabaath Areng lies in the southern reaches of Amh Araeng, and there are two routes we can take to get there."},{"name":"ALISAIE","text":"The first is the eastern route, which would lead us past Mord Souq."},{"name":"ALISAIE","text":"The other is the western route, which would require us to pass through the Hills of Amber."},{"name":"THANCRED","text":"Minfilia and I took the eastern route last time."},{"name":"ALISAIE","text":"Yes, that's the more well-trodden path. It also makes for easier traversal of the Nabaath Severance."},{"name":"ALISAIE","text":"But we can't use it."},{"name":"ALISAIE","text":"If we did, we'd need to cross the Severance from a point nearby the Inn at Journey's Head."},{"name":"ALISAIE","text":"If the Eulmorans caught wind of our approach, it could very well bring them into contact with the Inn and its patients─and we can be sure their activities would not meet with Vauthry's approval."},{"name":"ALISAIE","text":"It will make the journey more arduous, but I believe it would be safer to take the western route. Which brings me to my proposition."},{"name":"ALISAIE","text":"While you make for the Hills of Amber in the west, I will draw the Eulmorans' attention elsewhere─to an area in the east that I know to be uninhabited."},{"name":"ALISAIE","text":"That way, you'll have a chance at reaching Nabaath Areng unopposed, and without risk to civilians."},{"name":"ALPHINAUD","text":"Hm. I cannot deny that it's a sound plan─but nor can I allow you to go alone. My skills will make your task at least somewhat easier, will they not?"},{"name":"YSHTOLA","text":"I will accompany you as well. It will afford us a chance to have a proper conversation."},{"name":"YSHTOLA","text":"...And if I go with the others, I'm likely to say something Thancred will regret."},{"name":"THANCRED","text":"Well then, we'll leave the work of distracting Vauthry's forces to you. The rest of us will take the western route, and try to avoid attracting attention."},{"name":"THANCRED","text":"With that in mind, I think it best that we follow the road from the Bridges. We'll move faster with a solid path under our feet."},{"name":"ALISAIE","text":"We'll borrow a few amaro for our own journey. I leave the rest to you, Minfilia."},{"name":"RYNE","text":"Thank you. I'll try not to disappoint."},{"name":"RYNE","text":"We'll need to move quickly. The longer the others need to keep the Eulmorans busy, the more likely they are to be caught."},{"name":"URIANGER","text":"Would that we all had thy surety of purpose."},{"name":"THANCRED","text":"There you are. The gate leading to Amh Araeng is just up ahead."},{"name":"THANCRED","text":"In all the time I've been here, I've never ventured into the Hills of Amber. Not that I'm particularly intimidated by new lands, at this point─but we have more than enough reasons to be cautious as it is."},{"name":"THANCRED","text":"...Keep an eye on Minfilia for me, would you?"},{"name":"THANCRED","text":"Amh Araeng lies just beyond the gate. We need only speak to the sentry."},{"name":"RYNE","text":"I'm ready. Let's go."},{"name":"URIANGER","text":"Who shall walk among us upon our return, I wonder..."},{"name":"HARDYSS","text":"Off so soon, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? You've barely had time to recover from the battle!"},{"name":"HARDYSS","text":"Well, if you're certain, I'm hardly in a position to question you."},{"name":"HARDYSS","text":"The Hills of Amber lie beyond."},{"name":"HARDYSS","text":"Proceed to Amh Araeng?"},{"name":"THANCRED","text":"A village so near? How convenient."},{"name":"URIANGER","text":"Sound though Mistress Alisaie's logic was, I fear the road less traveled hath other perils in store for us."},{"name":"RYNE","text":"This place has been scarred by the Flood too. Who can say what lies ahead?"},{"name":"RYNE","text":"But whatever else this road may be, it is mine to travel. And I don't plan to take a moment of the time I spend upon it for granted."},{"name":"CHESSAMILE","text":"We have everything we need now. Leave it to me to administer the medicine. Though the patients may not be keen on the taste, they will soon forgive it when their hurts are healed.“"},{"name":"SOLDIER03608","text":"Once I'm properly back on my feet, I will fight again. For him, and for all of us."}],"reward":{"gil":1217,"items":[{"id":26858}]},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[69144]},"next":[69146]},"partials":[{"type":"npc","id":"1029853","obj":{"i":1029853,"n":"Thancred","l":2951,"q":1}},{"type":"npc","id":"1029614","obj":{"i":1029614,"n":"Minfilia","l":2955,"q":1}},{"type":"item","id":"26858","obj":{"i":26858,"n":"Titanbronze Head Gear Coffer (IL 409)","l":1,"c":26558,"t":61}},{"type":"quest","id":"69144","obj":{"i":69144,"n":"Small Favors","g":8,"l":"Lakeland","s":670}},{"type":"quest","id":"69146","obj":{"i":69146,"n":"Free Trade","g":8,"l":"Amh Araeng","s":690}}]}