{"quest":{"name":"Free Trade","location":"Amh Araeng","id":69146,"patch":5.0,"sort":690,"eventIcon":71201,"issuer":1029615,"target":1029617,"genre":8,"journal":["Thancred is gazing with interest at the nearby village."],"objectives":["Seek out a talkative local.","Question the Mord of Garik.","Speak with Thancred."],"dialogue":[{"name":"RYNE","text":"Our only path forward lies ahead─I'm sure of it. So...onward, I suppose!"},{"name":"URIANGER","text":"Sound though Alisaie's logic was, I fear that other perils awaiteth upon this road less traveled."},{"name":"THANCRED","text":"I take it you're seeing what I'm seeing?"},{"name":"THANCRED","text":"Finding a village when we're hardly ten paces into the hills is a surprising stroke of luck─especially given our recent fortunes─but you won't hear any complaints from me. Let's see if the folk who live here can tell us what to expect from the road ahead."},{"name":"ZHUNZUN","text":"You sell? No... No, you are no merchant. But then, why do I know your face? Hm..."},{"name":"ZHUNZUN","text":"Oh, I remember! You spent Voeburt gold!"},{"name":"ZHUNZUN","text":"Such a coinpurse cracking! You are already a legend among Mord traders!"},{"name":"THANCRED","text":"You're a traveling merchant, then. Can you tell us anything of this village?"},{"name":"ZHUNZUN","text":"Of course, anything for valued customers!"},{"name":"ZHUNZUN","text":"This place is Garik. Before the Flood, it was home to many miners. After, not so many. Now, none."},{"name":"ZHUNZUN","text":"So Master Ghen Gen borrowed the village─made it into a trading post. Very convenient location!"},{"name":"RYNE","text":"In which case, you all must be familiar with the local roads, correct?"},{"name":"RYNE","text":"We're on our way to Nabaath Areng, ourselves. If we continue south from here, will we have any difficulties reaching it?"},{"name":"ZHUNZUN","text":"Oh, yes! Great difficulty..."},{"name":"ZHUNZUN","text":"The Flood rent the stone and crushed the mines surrounding Nabaath Areng. Only steep cliffs and collapsed tunnels remain."},{"name":"RYNE","text":"Oh, no..."},{"name":"RYNE","text":"But surely there must be some way. Do you think any of the other Mord might have some sort of hidden route?"},{"name":"ZHUNZUN","text":"Perhaps. You ask, they tell. Tell for free, even, to friends of our best customer."},{"name":"RYNE","text":"Wonderful! Thank you for your help."},{"name":"THANCRED","text":"Well then, “best customer,” let's see what information your reputation buys us."},{"name":"THANCRED","text":"If we're not lucky enough to encounter anyone who knows a route to Nabaath Areng here, perhaps they can at least point us in the direction of others who might."},{"name":"RYNE","text":"I've got it! I'll lead by asking how business is, then mention you, and <span class=\"emphasis\">then</span> ask about the route. That...should work, right?"},{"name":"URIANGER","text":"Perhaps we ought to inquire upon the matter of Eulmoran forces in the region, as well."},{"name":"ZHUNZUN","text":"Remember Zhun Zun next time your pockets grow heavy with coin, yes?"},{"name":"RHILRIL","text":"You wish to go to Nabaath Areng? Hm..."},{"name":"RHILRIL","text":"There was a way, once. A gondola down from the cliffs. But it was built for those who had left something behind that they wished to retrieve. Now there is nothing left, and no one to use it."},{"name":"RHILRIL","text":"You may search for it, if you like. But I doubt that its rusted wires would bear your weight."},{"name":"SYSTEM","text":"You hastily take down a memo regarding the gondola on a spare scrap of parchment."},{"name":"RHILRIL","text":"Do try not to end up dangling upside down over a cliff."},{"name":"SHULSUL","text":"Oh, that is a surprise! Not many bound for Nabaath Areng these days."},{"name":"SHULSUL","text":"I do know of a trolley that once went there─it used to travel between all the settlements and mines of the Hills of Amber."},{"name":"SHULSUL","text":"It is locked behind a gate, however. I assume that will have kept it from being stolen or damaged, but it also prevents it from being of much use."},{"name":"SYSTEM","text":"You take down information regarding the trolley on a wrinkled piece of parchment before stuffing it unceremoniously back into your bag."},{"name":"SHULSUL","text":"If you want to use the trolley, you will need to do something about that gate."},{"name":"GHONGON","text":"For Nabaath Areng, airship is best. Nothing is faster than an airship!"},{"name":"GHONGON","text":"The Eulmorans have one, I hear. You can ask them to take you!"},{"name":"SYSTEM","text":"Though it seems somewhat superfluous to do so, you dutifully make note of Ghon Gon's words."},{"name":"GHONGON","text":"You must find your own airship, if the Eulmorans will not help you."},{"name":"THANCRED","text":"Ah, <span class=\"highlight\">Forename</span>. I'm afraid I've learned little of use about how to reach Nabaath Areng. The Eulmoran presence, though─that's another matter."},{"name":"THANCRED","text":"Apparently, though their army is definitely in Amh Araeng, there have been no sightings of Eulmorans at all in the Hills of Amber. Perhaps we can take that as a sign that Alisaie's plan has borne fruit."},{"name":"THANCRED","text":"Did you have any better luck finding us a route forward?"},{"name":"THANCRED","text":"So these are our options... Well, what do you think?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We can try the gondola. Might die, but eh."},{"name":"A1","text":"Can we get an airship anywhere? Not from Vauthry, obviously."},{"name":"A1","text":"Gate aside, the trolley seems most feasible."},{"name":"THANCRED","text":"I'd rather not, if it's all the same to you. If it went poorly, we couldn't simply wave our hands and vanish into the aether like Y'shtola─not that I would recommend it, even if we could."},{"name":"THANCRED","text":"Hmm... We could perhaps use amaro, but even from a distance, I can't imagine that the Eulmoran Army wouldn't spot us if we were to travel by air."},{"name":"THANCRED","text":"It does seem to be the least risky of our options, and I can't imagine one gate is enough to thwart <span class=\"emphasis\">you</span>."},{"name":"THANCRED","text":"I'd like to know a bit more before we dash off in search of it, though. Perhaps Zhun Zun can offer some insight."}],"reward":{"gil":753},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[69145]},"next":[69022,69023,69024,69025,69026,69027,69147]},"partials":[{"type":"npc","id":"1029615","obj":{"i":1029615,"n":"Thancred","l":2955,"q":1}},{"type":"npc","id":"1029617","obj":{"i":1029617,"n":"Thancred","l":2955,"q":1}},{"type":"quest","id":"69145","obj":{"i":69145,"n":"The Best Way Out","g":8,"l":"The Crystarium","s":680}},{"type":"quest","id":"69022","obj":{"i":69022,"n":"Where There's a Well, There's a Way","g":115,"l":"Amh Araeng","s":6001}},{"type":"quest","id":"69023","obj":{"i":69023,"n":"Assault on a Deadly Weapon","g":115,"l":"Amh Araeng","s":6010}},{"type":"quest","id":"69024","obj":{"i":69024,"n":"Water Palaver","g":115,"l":"Amh Araeng","s":6020}},{"type":"quest","id":"69025","obj":{"i":69025,"n":"Shovel or Boogie","g":115,"l":"Amh Araeng","s":6030}},{"type":"quest","id":"69026","obj":{"i":69026,"n":"Shine On You Crazy Mordling","g":115,"l":"Amh Araeng","s":6040}},{"type":"quest","id":"69027","obj":{"i":69027,"n":"And Justice Feral","g":115,"l":"Amh Araeng","s":6050}},{"type":"quest","id":"69147","obj":{"i":69147,"n":"The Trolley Problem","g":8,"l":"Amh Araeng","s":700}}]}