{"quest":{"name":"When It Rains","location":"The Crystarium","id":69142,"patch":5.0,"sort":650,"icon":100913,"eventIcon":71201,"issuer":1027231,"target":1029601,"genre":8,"journal":["Judging by his countenance, the manager of suites has ill tidings for you.","You learn from the manager of suites that Lakeland is under attack by a host of sin eaters, though he assures you that the Crystarium will remain secure. Nevertheless eager to help, you agree to check on citizens gathered at the Exedra in case any are in need of aid.","The people of the Crystarium seem unaffected by the threat bearing down upon their city─by contrast to the recently returned Alisaie, who rightly finds the presence of sin eaters beneath the reclaimed sky rather unsettling. Any theories as to their provenance will have to wait, however, as Alphinaud arrives to inform you that several anchors around the city must be activated before the protective barrier that serves as its primary defense can take effect. This process is best completed sooner rather than later, so you and Alisaie agree to assist.","After wending your way through the city, you find the first anchor on a bridge above the Rotunda. You pull down on its handle, and the glow it emits indicates that it is now active.","You activate the second anchor, and moments later, a faceted barrier weaves its way up from the array of devices to shield the Crystarium─and rebuffs a full dozen sin eaters in the nick of time. The Leveilleur twins, having arrived to witness the scene with you, indicate that your next destination will be the battlefield in the Lakeland wilds, where Lyna and her people are already engaging the eater host.","You take to the field with Alphinaud and Alisaie, and immediately set to aiding the beleaguered Crystarium troops, cutting down eater after eater as you make your way across Lakeland. Though your group is able to save many, you find yourself witness to death at every turn. You eventually encounter Y'shtola and Urianger, who join you in your rush to the Imperative, as well as Thancred and Minfilia, who split from your party in pursuit of a powerful eater.","You reach the Ostall Imperative to find it beset by eaters, its defenders beleaguered and bleeding. After a pitched battle against manifold foes, you triumph, seizing an advantage that will make it possible for Crystarium forces to reclaim Lakeland and drive back any stragglers.","After the battle is decided at last, you speak with Alisaie. She confirms that procedures for ensuring proper care of the wounded are already well underway. As for the other casualties...the Crystarium will likely long be mourning not only those lost to death, but to the sin eater horde as well."],"objectives":["Survey the Exedra.","Activate the first anchor.","Activate the second anchor.","Speak with Alphinaud.","Speak with Alisaie.","Defeat the sin eaters in the wood!","Protect the vulnerable en route to the Round!","Defeat the sin eaters at Radisca's Round!","Make for the Ostall Imperative!","Drive out the sin eaters!"],"dialogue":[{"name":"GUIDEOFTHEPENDANTS","text":"Ah, I suspected that you might be awake. I could scarce imagine you sleeping through such a commotion."},{"name":"GUIDEOFTHEPENDANTS","text":"An entire host of sin eaters appears to be advancing upon the Crystarium. Emergency measures are being taken as we speak."},{"name":"GUIDEOFTHEPENDANTS","text":"Rest assured, however, that we are safe so long as we remain under the Crystal Tower's aegis. You may return to your quarters, if you wish."},{"name":"GUIDEOFTHEPENDANTS","text":"Yes, I thought you might feel that way. And I cannot say that your assistance would be anything less than welcome."},{"name":"GUIDEOFTHEPENDANTS","text":"I must remain here to disseminate information to the other residents, but you are under no such obligation─and thus free to aid any of the townsfolk who may be in distress."},{"name":"GUIDEOFTHEPENDANTS","text":"The Exedra tends to become a point of congregation in times of need, crowded with those seeking solace in companionship. You would have my personal gratitude if you would offer succor to those there."},{"name":"SYSTEM","text":"Few townsfolk are about, and you spy none who appear to be in distress."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>!"},{"name":"ALISAIE","text":"I've only just returned from Amh Araeng, yet I find the Crystarium moments from being beset by sin eaters!?"},{"name":"ALISAIE","text":"Where are they coming from? This shouldn't be possible─we restored the darkness!"},{"name":"ALPHINAUD","text":"Well, this is a fortunate coincidence."},{"name":"ALISAIE","text":"Brother! Tell me you have some idea why this is happening."},{"name":"ALPHINAUD","text":"I may─but for the moment we'll need to postpone such discussions in favor of action."},{"name":"ALPHINAUD","text":"The Crystal Exarch is preparing to deploy a barrier around the Crystarium as we speak. Ensuring that he is able to do so should be our first concern."},{"name":"ALPHINAUD","text":"There are a number of instruments placed about the Crystarium that function as anchors for the barrier. I'm on my way to activate them now."},{"name":"ALISAIE","text":"...In which case, three pairs of hands would be better than one? Very well. I'll take the ones to the south."},{"name":"ALPHINAUD","text":"I shall deal with the northern apparatus, then. Will you handle the western two? They're ensconced on platforms extending from the upper level of the aetheryte plaza."},{"name":"SYSTEM","text":"Despite having very little idea as to how it functions, it appears that you have activated the device successfully."},{"name":"ALISAIE","text":"If <span class=\"emphasis\">Alphinaud</span> is opting to act first and speak later, I don't doubt the urgency of the situation. Let's go."},{"name":"ALPHINAUD","text":"We ought to join the vanguard as soon as possible. If the number of eaters we just saw is any indication, we'll be facing a formidable host."},{"name":"ALISAIE","text":"What lovely weather. Just what we needed."},{"name":"ALPHINAUD","text":"It seems the battle has already begun in earnest. Make haste!"},{"name":"SYSTEM","text":"Crystarium forces are engaging the sin eaters at various locations across Lakeland."},{"name":"SYSTEM","text":"Assist them in defeating the eaters before they are decimated."},{"name":"ALPHINAUD","text":"It is as we feared."},{"name":"ALPHINAUD","text":"But our task is as it ever was─turn the tide!"},{"name":"ALPHINAUD","text":"Bear it just a moment longer..."},{"name":"URIANGER","text":"Thou must needs remain still."},{"name":"YSHTOLA","text":"Take a deep breath for me. That's it..."},{"name":"ALISAIE","text":"It seems we've driven them back─for the time being, at least."},{"name":"ALISAIE","text":"The wounded have been collected and are undergoing treatment now. Once they're ready to be moved, we'll have them carried back to the Crystarium."},{"name":"ALISAIE","text":"The dead as well, of course. Those whose bodies remain, anyway..."},{"name":"QIB","text":"Sin Eater Momentum"},{"name":"QIB","text":"Crystarium Forces Remaining"},{"name":"QIB","text":"（★未使用／削除予定★）"},{"name":"ALISAIE","text":"I hear shouting! Come on!"},{"name":"ALISAIE","text":"They need our help!"},{"name":"ALPHINAUD","text":"More eaters. Don't let your guard down."},{"name":"ALPHINAUD","text":"Those eaters...they're moving toward Radisca's Round."},{"name":"ALPHINAUD","text":"We should follow─but we cannot neglect those in need of aid."},{"name":"ALISAIE","text":"If it's this bad here, I shudder to think what it's like elsewhere..."},{"name":"YSHTOLA","text":"A timely arrival, <span class=\"highlight\">Forename</span>. I have my hands full here."},{"name":"URIANGER","text":"Mine own magicks shall suffice to aid Y'shtola. I bid thee offer succor to the guard."},{"name":"YSHTOLA","text":"The eater's aether swells. I would hate to find out what it intends to do next."},{"name":"YSHTOLA","text":"Defend me─let none interrupt my incantation."},{"name":"URIANGER","text":"Draw the lesser eaters within the perimeter!"},{"name":"YSHTOLA","text":"Master Matoya has a few tricks up her sleeve. Allow me to demonstrate."},{"name":"URIANGER","text":"A most impressive trick indeed..."},{"name":"YSHTOLA","text":"As if you've none of your own. Let's make for the Imperative, shall we?"},{"name":"URIANGER","text":"Hesitate not should any eaters cross our path."},{"name":"URIANGER","text":"Someone hath made short work of these eaters..."},{"name":"RYNE","text":"<span class=\"highlight\">Forename</span>! You'll be glad to know that the locals have all taken shelter."},{"name":"THANCRED","text":"Nevertheless, we can't allow the eaters to gain any ground. With me!"},{"name":"ALPHINAUD","text":"That can't be good..."},{"name":"SOLDIER","text":"Hold your ground, even if it cost you your life!"},{"name":"THANCRED","text":"Gods damn it all, we're too late..."},{"name":"THANCRED","text":"I'll follow the eater. You press on to the Imperative."},{"name":"RYNE","text":"I'm staying with you!"},{"name":"ALPHINAUD","text":"We've lost too many already. We must hurry."},{"name":"YSHTOLA","text":"These eaters are too organized. They cannot merely be acting on instinct."},{"name":"ALPHINAUD","text":"The lives of the wounded are in our hands!"},{"name":"URIANGER","text":"Have care. That is no ordinary eater."},{"name":"YSHTOLA","text":"More eaters..."},{"name":"YSHTOLA","text":"They're protecting it, somehow. We shall need to deal with them first."},{"name":"ALPHINAUD","text":"I feel a swell of aether! Gather around me, quickly!"},{"name":"YSHTOLA","text":"（★未使用／削除予定★）"},{"name":"ALPHINAUD","text":"Perhaps now is the time to put my research to the test."},{"name":"ALISAIE","text":"And yet more still come!"},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span>, buy me some time. Alphinaud─I'll need aether."},{"name":"ALPHINAUD","text":"Right. Everyone, channel your aether into Alisaie!"},{"name":"ALPHINAUD","text":"The moment of truth!"},{"name":"ALPHINAUD","text":"I entrust this to you!"},{"name":"YSHTOLA","text":"I have faith in you."},{"name":"URIANGER","text":"The power of the stars do I bequeath to thee."},{"name":"ALISAIE","text":"We fight for those who cannot!"},{"name":"ALISAIE","text":"Forward!"},{"name":"ALISAIE","text":"I must keep fighting... I must..."},{"name":"ALPHINAUD","text":"Of all the times..."},{"name":"URIANGER","text":"Mine apologies..."},{"name":"YSHTOLA","text":"You must carry on..."}],"reward":{"gil":2493},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[68878]},"next":[69143]},"partials":[{"type":"npc","id":"1027231","obj":{"i":1027231,"n":"Manager Of Suites","l":2951,"q":6}},{"type":"npc","id":"1029601","obj":{"i":1029601,"n":"Alisaie","l":2953,"q":2}},{"type":"quest","id":"68878","obj":{"i":68878,"n":"Out of the Wood","g":8,"l":"The Rak'tika Greatwood","s":640}},{"type":"quest","id":"69143","obj":{"i":69143,"n":"Word from On High","g":8,"l":"Lakeland","s":660}}]}