{"quest":{"name":"The Trolley Problem","location":"Amh Araeng","id":69147,"patch":5.0,"sort":700,"eventIcon":71201,"issuer":1030438,"target":1029624,"genre":8,"journal":["Zhun Zun is eyeing you with curiosity."],"objectives":["Speak with Thancred.","Speak with Thancred again.","Investigate the area.","Speak with Urianger.","Confront the suspicious man.","Speak with Thancred."],"dialogue":[{"name":"THANCRED","text":"Though Zhun Zun didn't mention the trolley before, he's like as not at least heard of the thing. If we remind him, he may recall something of use."},{"name":"RYNE","text":"I hope you've had more luck than I..."},{"name":"URIANGER","text":"Shall I take the glimmer in thine eye to mean that thou hast struck upon a promising lead?"},{"name":"ZHUNZUN","text":"Oh, valued customers! Were the other Mord of help?"},{"name":"THANCRED","text":"Of a fashion. They told us of a trolley that runs to Nabaath Areng, at least..."},{"name":"THANCRED","text":"But am I correct in thinking that there was a reason you did not do so yourself, when first we asked?"},{"name":"ZHUNZUN","text":"Mm, yes... The gate, you see. It is impassable."},{"name":"ZHUNZUN","text":"Before, there was a hulking thing of stone─the Talos. It opened the gate, they say."},{"name":"ZHUNZUN","text":"But none operate such a thing now. I do not even know if it yet exists."},{"name":"ZHUNZUN","text":"I do not know, but... You should travel east to Mount Biran Mines! That is where the trolley controls stand."},{"name":"ZHUNZUN","text":"I still see miners there from time to time. If anyone knows what happened to the Talos..."},{"name":"RYNE","text":"...It would be them! Thank you, you've been a great help!"},{"name":"THANCRED","text":"We're off to Mount Biran, then. Let's hope that someone will be there to answer our questions."},{"name":"RYNE","text":"What a sight..."},{"name":"RYNE","text":"Oh, pardon me! It's only... It's a bit daunting, isn't it?"},{"name":"URIANGER","text":"Mayhap the pall of light is the root of this land's desolation. Or mayhap the fault lies with man and his insatiable greed..."},{"name":"ZHUNZUN","text":"Watch for beasts in the Hills! I do not like to lose customers."},{"name":"THANCRED","text":"The scale of the track is impressive, I'll give them that. Now we only need follow it until we come to the mines."},{"name":"RYNE","text":"This lever can't have been designed for a person to operate..."},{"name":"URIANGER","text":"...But by what means did they harness the necessary aether?"},{"name":"THANCRED","text":"Bit of a mess, isn't it? But the mechanisms for dispatching the trolley are here, just as Zhun Zun said."},{"name":"THANCRED","text":"Unfortunately, anyone who might know how to use them is not. We might wait for Zhun Zun's mysterious miners to appear, or have a look around and see if we can deduce anything useful in their absence. I'm in favor of the latter."},{"name":"THANCRED","text":"Something near the entrance to the mines proper caught Urianger's eye. Meet us there if you find anything."},{"name":"THANCRED","text":"As much as I wish we could count on someone conveniently appearing to explain all of this to us, I'm sure you're aware that we don't have the time to waste."},{"name":"SYSTEM","text":"Flecks of rust adorn the rails, but they nevertheless appear sturdy enough to bear the trolley without issue."},{"name":"SYSTEM","text":"The benches within suggest that this must have been a passenger car. Oddly enough, though it is clearly old, it appears to be well maintained."},{"name":"SYSTEM","text":"The cup is slightly warm, and a fair amount of tea─steeped overlong, if the color is any indication─remains within."},{"name":"URIANGER","text":"Ah, <span class=\"highlight\">Forename</span>. What hast thou discerned?"},{"name":"URIANGER","text":"I see... Indeed, thine observations are consistent with mine own."},{"name":"URIANGER","text":"But let us refrain from further discussion ere our comrades arrive..."},{"name":"THANCRED","text":"Ample evidence of recent maintenance, and lukewarm tea besides..."},{"name":"RYNE","text":"The levers for switching tracks looked like they were in good condition, though I couldn't move them myself. No ordinary person could, I think..."},{"name":"URIANGER","text":"It is my belief that no <span class=\"emphasis\">person</span> is meant to."},{"name":"URIANGER","text":"This “Talos” beareth more than a passing resemblance to golems of the Source..."},{"name":"URIANGER","text":"Nor doth it appear to be the sole example of its kind. The proliferation of Talos fragments, as well as the enormity of the mechanisms here, suggest a considerable number were once in operation."},{"name":"URIANGER","text":"Alas, this specimen and its fellows now lie lifeless and broken, and I know not how to repair them that they might facilitate our passage through the gate."},{"name":"URIANGER","text":"And without the aid of the Talos, even if thou wert somehow able to unbar the trolley's path, we would still have no means of propelling it."},{"name":"THANCRED","text":"We might not know how to repair the Talos, but <span class=\"emphasis\">someone</span> must. Otherwise, why keep everything else in working order? Whoever is maintaining the cars and rails must know something that we don't."},{"name":"THANCRED","text":"Let's ask them what it is, shall we?"},{"name":"THANCRED","text":"<span class=\"highlight\">Forename</span>, I do believe you'll find a person of some interest skulking in the shadows behind the warehouses on the northwestern side of the tracks."},{"name":"THANCRED","text":"While you two have a friendly chat, the rest of us will gently encourage those to the south to come out of hiding."},{"name":"THANCRED","text":"Defend yourselves as necessary, of course, but do try to keep everyone in one piece."},{"name":"THANCRED","text":"Off we go, then!"},{"name":"UNSUREMAN03611","text":"Wicked white! Where did you come from?"},{"name":"UNSUREMAN03611","text":"No, never mind that─you have no business here, of that I'm sure!"},{"name":"BALLOON","text":"&lt;huff&gt; What <span class=\"emphasis\">are</span> you? Urgh..."},{"name":"RYNE","text":"I feel a bit bad for them..."},{"name":"URIANGER","text":"They elected to take up arms against us, though the outcome was plain from the first."},{"name":"THAFFE","text":"We... We won't let you...&lt;wheeze&gt;"},{"name":"JERYK","text":"That smarts..."},{"name":"THANCRED","text":"Good to hear."},{"name":"THANCRED","text":"These two weren't much trouble either. Let's see what they have to say for themselves."},{"name":"THAFFE","text":"Us? We're not the brigands come to...to take what isn't ours!"},{"name":"THANCRED","text":"Do we honestly look like we'd need to steal─what, some rusted bits of iron? Don't be absurd. We're not here to rob you."},{"name":"THAFFE","text":"A likely story. You look, well..."},{"name":"THAFFE","text":"You don't look <span class=\"emphasis\">normal</span>, that's for certain. You don't have any wares, so you're clearly not merchants. Travelers never pass this way. The only reason you would come all the way out here is to strip the machinery for parts."},{"name":"JERYK","text":"Oh, Thaffe, I have an idea! What if, once upon a time..."},{"name":"JERYK","text":"A lovely lady of noble birth ventured forth in search of her lost love, joined by her two most loyal servants, sworn to follow her unto world's end. On their journey, they met a sorcerer, as ancient as time itself. Moved by the lady's devotion, he offered to be their guide, and they..."},{"name":"JERYK","text":"...turned up here, somehow!"},{"name":"THANCRED","text":"...I can only assume that you're being intentionally obtuse, but in the unlikely event that that's a serious conjecture─no. I suppose I am a bodyguard of a sort, but we have rather larger concerns than faerie tale romances."},{"name":"URIANGER","text":"Though I would fain hear more of this ageless sorcerer and his heroic deeds..."},{"name":"THANCRED","text":"Gods grant me strength..."},{"name":"RYNE","text":"Um, if I may─we're actually searching for a means by which to travel to Nabaath Areng. We were hoping that the trolley here might offer a solution."},{"name":"RYNE","text":"I realize that we haven't gotten off to the best of starts, but if you know anything about how we might get it working again..."},{"name":"JERYK","text":"The trolley?"},{"name":"THAFFE","text":"The trolley!"},{"name":"JERYK","text":"You should have led with that! We're always keen to discuss the trolley!"},{"name":"JERYK","text":"(-Jeryk-)We're both engineers-in-training, in fact. Jeryk and Thaffe, at your service."},{"name":"THAFFE","text":"(-Thaffe-)Technically, I'm a miner, and he does repair work. But our true passion is the trolley."},{"name":"JERYK","text":"(-Jeryk-)We're working with a few other folks to get it up and running again."},{"name":"JERYK","text":"(-Jeryk-)And before you ask─yes, it's true that there's little in need of transport these days. But that's no reason to consign a miracle of mechanical innovation to dust. The mere sight of it traveling the track once again would make hearts soar, mark my words!"},{"name":"THANCRED","text":"You'll hear no argument from us. What progress have you made thus far?"},{"name":"JERYK","text":"(-Jeryk-)Not as much as we'd like, truth be told."},{"name":"RYNE","text":"Well, is there anything we could do to assist you? We could gather materials, or help put pieces together..."},{"name":"THAFFE","text":"(-Thaffe-)It's a sight more complicated than that, I'm afraid. If you spoke with Magnus, you'd understand. He's the only one with full knowledge of the trolley's operation."},{"name":"THAFFE","text":"(-Thaffe-)I suppose you <span class=\"emphasis\">could</span> speak with him, if you like. We'll introduce you."},{"name":"THANCRED","text":"Very well. Our options are limited, and if this Magnus can explain whatever is preventing the trolley from being restored, I'd like to hear it."},{"name":"THAFFE","text":"(-Thaffe-)Right. It looks like you'll be following us back to Twine, then!"}],"reward":{"gil":1062,"items":[{"id":26859}]},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[69146]},"next":[69148]},"partials":[{"type":"npc","id":"1030438","obj":{"i":1030438,"n":"Zhun Zun","l":2955,"q":1}},{"type":"npc","id":"1029624","obj":{"i":1029624,"n":"Thancred","l":2955,"q":1}},{"type":"item","id":"26859","obj":{"i":26859,"n":"Titanbronze Chest Gear Coffer (IL 409)","l":1,"c":26559,"t":61}},{"type":"quest","id":"69146","obj":{"i":69146,"n":"Free Trade","g":8,"l":"Amh Araeng","s":690}},{"type":"quest","id":"69148","obj":{"i":69148,"n":"Rust and Ruin","g":8,"l":"Amh Araeng","s":710}}]}