{"quest":{"name":"Sights of the First","location":"The Crystarium","id":69140,"patch":5.0,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1028005,"target":1028005,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"EIRLALTH","text":"Hold a moment, sinner. You're not from around here, are you? A fellow wandering soul? An eternal inhabitant of the road? I thought so!"},{"name":"EIRLALTH","text":"Eirlalth's the name. My aspiration is to travel the whole wide world─though it's a fair bit smaller than it used to be, so as far as dreams go, it's a lot more realistic than you might think."},{"name":"EIRLALTH","text":"But danger still lurks in every corner and around every bend. Even so, this sinner's got nerves of steel! He's a born explorer, Eirlalth! There's no land too distant or place too forbidden, aye!"},{"name":"EIRLALTH","text":"But what is that I spy poking out of your pack? A log, if I am not mistaken. Give it over, if you would..."},{"name":"EIRLALTH","text":"Aha, I thought so! A record of fantastic vistas and unforgettable sights! We're kindred spirits─amaro of a feather! Excellent, excellent!"},{"name":"EIRLALTH","text":"'Tis only right that I share with you such wondrous experiences as you have with me. A collection of amazing vistas I cataloged myself that I guarantee will rival the best you have ever seen!"},{"name":"EIRLALTH","text":"Norvrandt may be a shadow of its former glory, but there is still joy and excitement to be found if you know where to look, my friend. So I implore you, look, look, look!"},{"name":"EIRLALTH","text":"Follow in my footsteps. Savor every moment of the journey. And then, when you feel you have discovered every secret this realm has to offer, start again. I promise you won't be disappointed!"},{"name":"SYSTEM","text":"Shadowbringers entries have been added to your sightseeing log!"},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 70 or above to record Shadowbringers vistas. Travel to the location indicated and fulfill the necessary conditions and you will complete the entry for that vista, earning experience points in the process."},{"name":"SYSTEM","text":"Use your wits and the notes provided by Eirlalth to identify these stunning sights and the proper way to appreciate them, and see Norvrandt as only the greatest explorers have seen her!"},{"name":"EIRLALTH","text":"Hmm... You're a new arrival, aren't you? Ah, but not a fighter, I see. Never mind. What I had in mind is probably too dangerous for your sort."},{"name":"SYSTEM","text":"In order to undertake this quest, you must be a Disciple of War or Magic."}],"reqs":{"jobs":[{"lvl":70,"id":1}],"questsType":"all","quests":[65698,68817]}},"partials":[{"type":"npc","id":"1028005","obj":{"i":1028005,"n":"Eirlalth","l":2951,"q":1}},{"type":"quest","id":"65698","obj":{"i":65698,"n":"A Sight to Behold","g":92,"l":"Gridania","s":200,"f":1}},{"type":"quest","id":"68817","obj":{"i":68817,"n":"Travelers of Norvrandt","g":8,"l":"The Crystarium","s":30}}]}