{"quest":{"name":"Rust and Ruin","location":"Amh Araeng","id":69148,"patch":5.0,"sort":710,"icon":100915,"eventIcon":71201,"issuer":1029629,"target":1029637,"genre":8,"journal":["Thaffe is ready to guide you to Twine, where you might meet the mysterious Magnus.","Prepared to depart for Twine, you speak with Thaffe. However, he becomes somewhat sidetracked by the matter of his and Jeryk's absent companion─a subject on which you are quite well-informed, having roundly trounced the man but recently. It is decided that Jeryk will attend to him while Thaffe escorts you to town.","You catch up to Thaffe just outside of the rail yard. His offhand comments indicate that you were not the only one to be overzealous in subduing a lurking engineer this day, and it is perhaps something of a miracle that they don't seem to hold the incident against you.","As you follow Thaffe through the Northern Hills of Amber, he catches the sound of a beast nearby. Very nearby. Its sudden appearance seems to give the man quite a fright, and he dashes away.","Much to his distress, Thaffe's flight leads him to run straight into yet more vicious wildlife. As his previous confrontation with Thancred established, the engineer is not particularly suited to combat, so you resign yourself to intervening on his behalf.","You liberate Thaffe from his predicament, for which he thanks you with a considerable amount of relief in his voice. He tells you that Twine is not far away─fortunately for the both of you.","You at last reach Twine, finding that Thancred, Minfilia, and Urianger have arrived without incident. Thaffe then gives you a brief history of the town and its troubled state at present─a state which he, curiously enough, suggests to be reflected in Magnus, the man whom you are here to meet. Though some trepidation upon hearing such an unflattering description may be unavoidable, there is little you can do but follow through on your plan to speak with him.","Though your group does, strictly speaking, have a conversation with Magnus, very little is conveyed during the exchange. He seems unwilling to discuss your request for help beyond saying that to travel to Nabaath Areng is fruitless, and to use the trolley to do so, impossible. Though you get the sense that larger issues are at play in his reticence, his stubbornness gives you no choice but to withdraw for the time being.","You find Minfilia lost in thought─discouraged, but not defeated, by Magnus's attitude. Perhaps the man can be convinced, or another means of travel sought. Either way, it is far too early to give up."],"objectives":["Speak with Thaffe.","Speak with Thaffe again.","Search for Thaffe.","Speak with Thaffe.","Speak with Thaffe again.","Speak with Magnus.","Speak with Minfilia."],"dialogue":[{"name":"THANCRED","text":"&lt;sigh&gt; Come to think of it, Urianger always <span class=\"emphasis\">was</span> fond of faerie tales..."},{"name":"RYNE","text":"A quest for a lost love... Perhaps that could have been me, had things been different."},{"name":"URIANGER","text":"Dost thou seek the sorcerer's wisdom, young one?"},{"name":"JERYK","text":"To be honest, I'm impressed that you thought of the trolley to begin with. So few seem to, these days. Too used to living without it, I suppose."},{"name":"THAFFE","text":"If you're ready, we can leave right now."},{"name":"THAFFE","text":"Though...you haven't seen another fellow around here, have you? I thought he'd have come out by now."},{"name":"THAFFE","text":"You “think” he'll be all right? That's, er... Well, I suppose we did force your hand a bit."},{"name":"JERYK","text":"I'll have a look. Just in case. You go on ahead, Thaffe."},{"name":"THAFFE","text":"Alright. Looks like it'll just be you lot and me, then. Try not to let anything take a bite out of you on the way out of the rail yard."},{"name":"JERYK","text":"We'll catch up with you in Twine."},{"name":"THAFFE","text":"Damn, that smarts. Did he have to thump me so hard? I'll be feeling that for the next fortnight at least..."},{"name":"THAFFE","text":"Naught to be done about it now, though. I've pointed your overeager companions in the right direction and they've gone on ahead, so we need to get moving."},{"name":"THAFFE","text":"Normally we walk atop the tracks, but seeing as the young lady has a much shorter stride, that's more perilous a route than I'm comfortable suggesting. Wouldn't want anyone falling through the gaps."},{"name":"THAFFE","text":"Of course, the low road presents other dangers, but having been on the receiving end of your friend's blows, I'm not worried on that account."},{"name":"THAFFE","text":"Wait a moment. I think I hear something..."},{"name":"THAFFE","text":"Oh, that's <span class=\"emphasis\">something</span>, all right! Run!"},{"name":"THAFFE","text":"Out of the frying pan and into the fire..."},{"name":"THAFFE","text":"Sorry about that. I'll admit─I didn't expect this route to be <span class=\"emphasis\">quite</span> so fraught with danger."},{"name":"THAFFE","text":"We're nearly to Twine, though, so we should make it without further incident."},{"name":"THANCRED","text":"Odd to find a place like this still occupied─it must have come dangerously close to being consumed by the Flood."},{"name":"RYNE","text":"The town is small, but everything in it seems so purposeful. It's amazing."},{"name":"URIANGER","text":"A testament to man's resilience, that civilization may yet be found at the very edge of the world..."},{"name":"THAFFE","text":"This is it. Welcome to Twine!"},{"name":"THAFFE","text":"The original dwellings were built to house those laborers tasked with building the track. Over time miners came to seek their fortunes─and that's what made the town grow to what you see before you today. But it was still the trolley that brought them here."},{"name":"THAFFE","text":"As you've doubtless noticed, the track goes to the very heart of the town. It <span class=\"emphasis\">was</span> the heart of the town, back when the trolley still carried everyone home at the end of each hard day in the mines."},{"name":"THAFFE","text":"Now there is no trolley─nor much work to be had in the mines, for that matter. The only residents that remain are the destitute, the delusional, and those with nowhere else to go. Or so they say."},{"name":"THAFFE","text":"That should give you some indication of what to expect when you meet Magnus. As I said, it will help you understand why we can't get the trolley running. Just...don't expect too much aside from that."},{"name":"THANCRED","text":"Well, that's encouraging. But I don't see that we have much choice. Let's go and meet the man."},{"name":"THAFFE","text":"This is Magnus. He's our boss, of a fashion."},{"name":"MAGNUS","text":"Who are you supposed to be? Never seen the three of you in my life."},{"name":"MAGNUS","text":"Or the...four of you? Wicked white, if you're going to bother me, at least have the damned courtesy to stand still!"},{"name":"URIANGER","text":"Methinks this one is deep in his cups."},{"name":"THAFFE","text":"These are my guests, Magnus. We ran into them at the mines."},{"name":"THAFFE","text":"They're looking for a way to reach Nabaath Areng, so they came to ask about the trolley, you see..."},{"name":"MAGNUS","text":"What? There's nothing in Nabaath Areng. Not anymore."},{"name":"MAGNUS","text":"And especially not for frail little girls. Give it up."},{"name":"RYNE","text":"...No. We must reach Nabaath Areng. <span class=\"emphasis\">I</span> must."},{"name":"MAGNUS","text":"Bah. So you have your heart set on it─the world doesn't care. The place is a ruin, nothing more."},{"name":"MAGNUS","text":"And you're not getting there in the trolley. The thing doesn't run on hopes and dreams."},{"name":"THANCRED","text":"We're not <span class=\"emphasis\">fools</span>─it's necessity that drives us to Nabaath Areng. If you insist that the trolley is not an option, at least tell us why."},{"name":"MAGNUS","text":"No. I'm sick of people asking me about the blasted thing. Leave me be."},{"name":"THANCRED","text":"...We'll speak outside."},{"name":"THANCRED","text":"Stubborn arse."},{"name":"URIANGER","text":"I sense there is more to this belligerent drunk and his tale..."},{"name":"MAGNUS","text":"Piss off."},{"name":"THAFFE","text":"I'd be lying if I said that I didn't expect that. But for what it's worth, I'm sorry."},{"name":"JERYK","text":"Hello, again! Judging by the look on your face, I suppose you've met Magnus?"},{"name":"RYNE","text":"He only said that because...because he thinks I'm weak. And he's right. But I can't be─I <span class=\"emphasis\">won't</span> be forever."},{"name":"RYNE","text":"There has to be some way... I <span class=\"emphasis\">must</span> find it."}],"reward":{"gil":1062},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[69147]},"next":[69149]},"partials":[{"type":"npc","id":"1029629","obj":{"i":1029629,"n":"Thaffe","l":2955,"q":1}},{"type":"npc","id":"1029637","obj":{"i":1029637,"n":"Minfilia","l":2955,"q":2}},{"type":"quest","id":"69147","obj":{"i":69147,"n":"The Trolley Problem","g":8,"l":"Amh Araeng","s":700}},{"type":"quest","id":"69149","obj":{"i":69149,"n":"On Track","g":8,"l":"Amh Araeng","s":720}}]}