{"quest":{"name":"Small Favors","location":"Lakeland","id":69144,"patch":5.0,"sort":670,"eventIcon":71201,"issuer":1030587,"target":1027248,"genre":8,"journal":["Lyna is gazing solemnly upward, and it is not difficult to guess what occupies her mind."],"objectives":["Speak with Thancred.","Search for Minfilia.","Get Minfilia's attention with a /poke.","Obtain the medicinal herbs.","Deliver the herbs to Chessamile."],"dialogue":[{"name":"ALPHINAUD","text":"A conveniently timed proclamation, to say the least. If he authored this tragedy, I swear..."},{"name":"ALISAIE","text":"We've everything sorted here, and the wounded will be conveyed back to the Crystarium as soon as possible."},{"name":"URIANGER","text":"If thy work here is done, I beseech thee seek out the Exarch. He will doubtless know other ways in which thou mayest be of service to the many."},{"name":"YSHTOLA","text":"I assume Vauthry's words were heard in the Crystarium as well. We can only hope that they don't incite the unrest he so clearly hopes for."},{"name":"LYNA","text":"Vauthry's ship is already gone. How flattering that he came all this way just to give his little speech."},{"name":"LYNA","text":"...I apologize for my earlier outburst. Rest assured that I have no intention of allowing any of my wounds to affect the performance of my duties─especially not now."},{"name":"LYNA","text":"If I may─could I ask that you seek out Thancred and Minfilia for me? They endangered themselves on my behalf, and I would feel better knowing that they are well looked after."},{"name":"LYNA","text":"Thancred, in particular, sustained quite an injury from that sin eater. I would not be surprised if he were in Spagyrics still."},{"name":"LYNA","text":"Please...give them my thanks."},{"name":"LYNA","text":"I am fine, truly. Save your concern for those who were not so fortunate."},{"name":"THANCRED","text":"...You're here for me? I'm sorry to put you to the trouble─I'm fine. Really."},{"name":"THANCRED","text":"The eater landed an unfortunately solid blow, but the healers here have done wonders."},{"name":"THANCRED","text":"I'm more worried about Minfilia. She's not taken it well."},{"name":"THANCRED","text":"Could I ask you to speak with her? My attempts to reach out seem to have had the opposite effect. She's gone off to the Hortorium, ostensibly to fetch herbs for Chessamile, but... Just talk to her, will you?"},{"name":"THANCRED","text":"Please, find Minfilia. I'll be fine."},{"name":"RYNE","text":"..."},{"name":"SYSTEM","text":"Minfilia appears to be lost in thought. Perhaps a gentle <span class=\"highlight\">poke</span> will get her attention."},{"name":"RYNE","text":"Eep!"},{"name":"RYNE","text":"Oh, <span class=\"highlight\">Forename</span>. What are you doing here?"},{"name":"RYNE","text":"Thancred..."},{"name":"RYNE","text":"It's my fault, you know. I jumped at the chance to help Lyna, but I was careless. And now..."},{"name":"RYNE","text":"It's my fault."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You can make up for it. By being there for him."},{"name":"A1","text":"Then you'll be wanting to get those herbs for the healers."},{"name":"RYNE","text":"I...are you sure? I've brought him nothing but trouble thus far."},{"name":"RYNE","text":"And what if it's worse, next time? All I do is make mistakes, put others in danger..."},{"name":"RYNE","text":"I'm sure that he'll resent me. For being this weak. Maybe he already does."},{"name":"RYNE","text":"Oh, what have I done? I promised I'd be right back, and yet here I am..."},{"name":"RYNE","text":"I know that I need to be better. I'm only allowed to be a part of this because I'm Minfilia, and I need to be...more like her."},{"name":"RYNE","text":"All I do is make mistakes, put others in danger..."},{"name":"RYNE","text":"But you're right. I can still help─if only by seeing these herbs safely to Chessamile."},{"name":"RYNE","text":"There are only two left on the list, but I'll need to ask about this one. I've looked high and low, and I can't seem to find it anywhere. Would you mind collecting the other? I would hate to delay any longer than I already have."},{"name":"RYNE","text":"You're looking for something with soft leaves that's very fragrant─“in an unmistakably medicinal way,” I was told. We only need two sprigs or so."},{"name":"RYNE","text":"Once you've got them, you can bring them directly to Chessamile. Whoever gets there first can explain that the other will be back shortly. Thank you─I appreciate the help!"},{"name":"SYSTEM","text":"This plant has no scent whatsoever. It is unlikely to be the herb Chessamile asked for..."},{"name":"SYSTEM","text":"This plant has rigid leaves and smells of fruit. It is unlikely to be the herb Chessamile asked for..."},{"name":"SYSTEM","text":"This plant has soft leaves and smells strongly medicinal!"},{"name":"THANCRED","text":"I see you got roped into helping. Some things never change, eh?"},{"name":"RYNE","text":"I asked someone who looked like they knew what they were doing, and they pointed me toward the herb I was looking for right away! I hope you didn't have too much trouble with yours."},{"name":"CHESSAMILE","text":"Ah, Minfilia told me that you would be bringing the rest."},{"name":"CHESSAMILE","text":"Marvelous. With this, I can replenish our store of medicines. We're struggling to keep up with the number of wounded that are being brought in."},{"name":"CHESSAMILE","text":"I wasn't on the field, but it doesn't matter. The patients' faces make plain that it was a horrible battle."},{"name":"CHESSAMILE","text":"And we're still fighting it, I suppose, though with bitter medicine rather than sharp steel. But we'll win─I promise you that."},{"name":"THANCRED","text":"It seems that I owe you an apology for dragging you to yet another battlefield when you've just come off the front lines!"},{"name":"THANCRED","text":"In both cases, I'm sure your efforts saved more than a few. With Spagyrics in good working order, the Crystarium's people will be well cared for."},{"name":"THANCRED","text":"More lie ahead, of course─battles only you can fight. Not that we intend to let you do it alone. But that's a matter to discuss with the Exarch."},{"name":"SOLDIER03608","text":"(-???-)You know the Exarch?"},{"name":"THANCRED","text":"We do. Was there something you needed?"},{"name":"SOLDIER03608","text":"I need you to tell him something. For me."},{"name":"SOLDIER03608","text":"My dearest friend, you see... He was there on the battlefield with me. But only the one of us is here to speak of it."},{"name":"SOLDIER03608","text":"At the end, before the wound killed him, I heard his dying words."},{"name":"SOLDIER03608","text":"\"I never knew that our world was this beautiful,“ he told me. ”I'm so glad that I got to see the night sky...“"},{"name":"SOLDIER03608","text":"I don't know how the Exarch feels about what happened out there. I don't know if what Vauthry said is true─if our losses were our just deserts, and we doom ourselves to worse by continuing to fight this fight."},{"name":"SOLDIER03608","text":"But I <span class=\"emphasis\">believe</span> in the Warrior of Darkness. In the Crystal Exarch. I don't think what they've done is wrong, and I don't think we're wrong to fight with them, either."},{"name":"SOLDIER03608","text":"My friend, he smiled in the end. Just as he smiled when he raised his glass to celebrate the return of the night. That's how I want to remember him."},{"name":"SOLDIER03608","text":"So I... I want to tell the Exarch. Don't give up. Don't give in. Please."},{"name":"THANCRED","text":"We'll tell him. You have my word."}],"reward":{"gil":1057},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[69143]},"next":[69145]},"partials":[{"type":"npc","id":"1030587","obj":{"i":1030587,"n":"Lyna","l":2953,"q":1}},{"type":"npc","id":"1027248","obj":{"i":1027248,"n":"Chessamile","l":2951,"q":2}},{"type":"quest","id":"69143","obj":{"i":69143,"n":"Word from On High","g":8,"l":"Lakeland","s":660}},{"type":"quest","id":"69145","obj":{"i":69145,"n":"The Best Way Out","g":8,"l":"The Crystarium","s":680}}]}