{"quest":{"name":"On Track","location":"Amh Araeng","id":69149,"patch":5.0,"sort":720,"eventIcon":71201,"issuer":1029637,"target":1029643,"genre":8,"journal":["Minfilia remains adrift in the turbulent sea of thought."],"objectives":["Seek out a talkative resident of Twine.","Open the toolbox next to Jeryk.","Remove nests and slay any desert vultures that appear.","Speak with Jeryk.","Speak with Jeryk again."],"dialogue":[{"name":"THANCRED","text":"Stubborn arse."},{"name":"URIANGER","text":"I sense there is more to this belligerent drunk and his tale..."},{"name":"MAGNUS","text":"Piss off."},{"name":"THAFFE","text":"I'd be lying if I said that I didn't expect that. But for what it's worth, I'm sorry."},{"name":"JERYK","text":"Hello, again! Judging by the look on your face, I suppose you've met Magnus?"},{"name":"RYNE","text":"Oh! I'm sorry. I was...stuck in my own head again."},{"name":"RYNE","text":"It's clear that Magnus has no intention of helping us, but perhaps we should ask the other residents? They may know something of the trolley."},{"name":"RYNE","text":"I'll take the north side of town. Let me know if you learn anything!"},{"name":"URIANGER","text":"Thancred, art thou truly content to stand witness to fate's course and take no part?"},{"name":"THANCRED","text":"This isn't a matter of fate, Urianger. It's about choice. And I've had years to decide where I stand."},{"name":"THANCRED","text":"Minfilia has spent too long in chains already. I would not shackle her again by making my hopes known."},{"name":"THANCRED","text":"It is for her to choose what shape her destiny will take. It is for me to stay silent. To protect her, teach her, and stand by her. That, at least, I can do for her."},{"name":"URIANGER","text":"...So be it. Come, let us make our own inquiries."},{"name":"JERYK","text":"Oh, there you are! You'll be pleased to know that I got our friend back home with no trouble, and he's just fine. He was a bit shaken up, is all."},{"name":"JERYK","text":"And you? What did Magnus have to say?"},{"name":"JERYK","text":"Ah. I did have a faint hope that your need might prompt him to action where our interest has not, but I suppose that was foolish of me."},{"name":"JERYK","text":"I am sorry that we couldn't be of help, though. I could at least show you the trolley car we have here, if you like? You could give it a stroke or two─it has some <span class=\"emphasis\">very</span> smooth wood..."},{"name":"JERYK","text":"You mean to say you're not giving up? Even knowing that Magnus is...Magnus?"},{"name":"JERYK","text":"I don't see much point in your being stubborn about it. Though...perhaps stubbornness is exactly what this situation calls for. Can't forge iron without an anvil, after all."},{"name":"JERYK","text":"I can't imagine that anything you try will work. But if you're certain, you can help me make preparations in the event that it does!"},{"name":"JERYK","text":"To that end─take this toolbox. We're going to inspect the rails!"},{"name":"JERYK","text":"I'll have a look along the tracks for anything that's in need of repair. You bring the tools, and be ready to hand them to me whenever I stop to work."},{"name":"JERYK","text":"This spot looks like it could use a bit of work. Can you ready the tools for me?"},{"name":"SYSTEM","text":"Though rifling through hammers is doubtless someone's pastime, it would be more effective to open the toolbox where Jeryk can use its contents."},{"name":"SYSTEM","text":"You open the box, revealing the proud array of lovingly maintained tools within."},{"name":"JERYK","text":"Brilliant! Now, if you could hand me what I need as I work, that would be a help."},{"name":"JERYK","text":"In this case, hmm... Well, this bolt is loose, for one matter. We can't have that. I'll need to tighten it."},{"name":"Q1","text":"Which tool will you provide?"},{"name":"A1","text":"A vicious-looking saw."},{"name":"A1","text":"A midsized wrench."},{"name":"A1","text":"A ragged cloth."},{"name":"JERYK","text":"That's...not how this works. That's not how any of this works."},{"name":"JERYK","text":"I need something to tighten the bolt, please."},{"name":"JERYK","text":"Thank you! This one will do nicely."},{"name":"JERYK","text":"Now give me one moment, and..."},{"name":"JERYK","text":"There! I don't see any other problems here, so let's continue along the track."},{"name":"JERYK","text":"I could use this to wipe any excess oil clinging to the bolt, but I don't think that will be necessary in this case."},{"name":"JERYK","text":"I'd like to move right to tightening the bolt, so please hand me the tool for that."},{"name":"JERYK","text":"I'm a bit concerned about this lantern post. Would you ready the tools for me?"},{"name":"SYSTEM","text":"You set down the toolbox, the muscles of your arms enjoying profound relief, and open it once again."},{"name":"JERYK","text":"You're quite handy to have around, you know?"},{"name":"JERYK","text":"As to the lamp here... These aren't often necessary these days, but if we're going to do this, we might as well do it properly."},{"name":"JERYK","text":"And if, by some miracle, the night returns, as it did in Lakeland... Well, it's a nice thought."},{"name":"JERYK","text":"Anyhow, a bit of this post seems to have splintered. Whether its lamp is to be lit or not, we wouldn't want these little pieces of wood jabbing the next person who comes through here to do maintenance. I'll need to sand it down a bit."},{"name":"Q2","text":"Which tool will you provide?"},{"name":"A2","text":"A bulky saw."},{"name":"A2","text":"A heavy hammer."},{"name":"A2","text":"A rough file."},{"name":"JERYK","text":"Sure, I'll simply hack at it with this massive saw..."},{"name":"JERYK","text":"Honestly, are you away with the fae!? We're trying to prevent splinters, not chop down the post like a tree!"},{"name":"JERYK","text":"Now, hand me something a bit more delicate, if you please."},{"name":"JERYK","text":"Er... You have an interesting sense of humor."},{"name":"JERYK","text":"Now, can I have the proper tool this time?"},{"name":"JERYK","text":"Yes, a wood file's perfect."},{"name":"JERYK","text":"Let me even this out..."},{"name":"JERYK","text":"That should do it. I'll bring some varnish along next time to finish the job."},{"name":"JERYK","text":"I haven't spotted any other problems, so we can move along now. Unless you'd like to take in the view of the tracks from here for a bit longer? It's breathtaking, I know."},{"name":"JERYK","text":"Mining has always been the primary vocation of folks in the Hills of Amber, you see. But after a certain point, they had dug up everything that could easily be reached and carried back by manpower alone."},{"name":"JERYK","text":"It was then that the Nabaath Empire struck upon the idea of the Talos, which they had seen at work abroad."},{"name":"JERYK","text":"At great expense, the Nabaath brought the Mystel engineers who specialized in Talos here, to the Hills. And wouldn't you know it, the mining industry picked right up again."},{"name":"JERYK","text":"Twine itself sprung up around that time, as a matter of fact."},{"name":"JERYK","text":"It was named after the “entwining of tails”─the fruitful cooperation between the native Ronso and the newly come Mystel."},{"name":"JERYK","text":"But that, like so much else, fell apart in the wake of the Flood. The Mystel left, taking their knowledge with them."},{"name":"JERYK","text":"It was fifteen years ago that the last of them, the folks from Daedalus Stoneworks, took off for Eulmore. And now no one remains that can repair and operate the Talos."},{"name":"JERYK","text":"But there's no use in lamenting what can't be changed. And there's one more thing we need to do while we're out here, so we might as well get to it."},{"name":"JERYK","text":"Vultures occasionally make their nests on the tracks, you see, and it falls to us to remove them when they do. The creatures are angry when disturbed─which is natural, but nevertheless a danger to anyone passing by."},{"name":"JERYK","text":"It's not my favorite task, to be honest with you. As you may have noticed, I'm not terribly suited to confrontation. That said─would you follow the tracks north and remove any nests you find for me? I'll keep an eye on things from here."},{"name":"JERYK","text":"Be careful when removing the nests─the vultures who made them never seem to be far away. Of course, they never <span class=\"emphasis\">could</span> be far enough away for my tastes, so my perception may be a bit biased."},{"name":"JERYK","text":"Thank you. That should be everything taken care of."},{"name":"JERYK","text":"In return for your help, I'll tell you a bit more about the trolley. Nothing that can get it started again, though─as I said, the only people who knew how to repair the Talos are long gone."},{"name":"JERYK","text":"When they left, the life began to bleed out of the town. The trolley's tracks rusted, and its cars fell into disrepair. Now, I was born in Twine, raised there─my first word was “trolley,” dammit─and those were the worst years of my life."},{"name":"JERYK","text":"But then, about seven years past, Magnus and his wife returned to us."},{"name":"JERYK","text":"Magnus is a real, proper trolley engineer, and perhaps he would never have left in the first place─if it hadn't been for his son. As you're well aware, Amh Araeng is hardly the safest place, and Magnus wanted his child to grow up away from its dangers."},{"name":"JERYK","text":"It didn't help, in the end. The sin eaters got the boy. Isn't that always the way?"},{"name":"JERYK","text":"The child had always said that someday, he wanted to see Magnus's trolley running again─so in his memory, they returned to Twine. Started fixing those rusted rails and broken cars. And it was going well, for a time..."},{"name":"JERYK","text":"Wicked white, vultures? Are they back for revenge? Never mind, I don't want to find out!"},{"name":"JERYK","text":"Ahem. Nice work out there."},{"name":"JERYK","text":"And now you know the story of the trolley. Won't do you much good without the Talos, though."},{"name":"JERYK","text":"If there was even a single one that still functioned, things might be different, but...well, here we are."}],"reward":{"gil":1023,"items":[{"id":26861}]},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[69148]},"next":[69028,69029,69030,69031,69032,69033,69034,69037,69038,69039,69042,69044,69045,69046,69150]},"partials":[{"type":"npc","id":"1029637","obj":{"i":1029637,"n":"Minfilia","l":2955,"q":2}},{"type":"npc","id":"1029643","obj":{"i":1029643,"n":"Jeryk","l":2955,"q":2}},{"type":"item","id":"26861","obj":{"i":26861,"n":"Titanbronze Leg Gear Coffer (IL 409)","l":1,"c":26561,"t":61}},{"type":"quest","id":"69148","obj":{"i":69148,"n":"Rust and Ruin","g":8,"l":"Amh Araeng","s":710}},{"type":"quest","id":"69028","obj":{"i":69028,"n":"A Relatively Miner Issue","g":115,"l":"Amh Araeng","s":6060}},{"type":"quest","id":"69029","obj":{"i":69029,"n":"I Drink, Therefore I Am (in Trouble)","g":115,"l":"Amh Araeng","s":6070}},{"type":"quest","id":"69030","obj":{"i":69030,"n":"To the Far Side","g":115,"l":"Amh Araeng","s":6080}},{"type":"quest","id":"69031","obj":{"i":69031,"n":"Whistle While You Shirk","g":115,"l":"Amh Araeng","s":6090}},{"type":"quest","id":"69032","obj":{"i":69032,"n":"Prankster's Paradise","g":115,"l":"Amh Araeng","s":6100}},{"type":"quest","id":"69033","obj":{"i":69033,"n":"A Tab in the Dark","g":115,"l":"Amh Araeng","s":6110}},{"type":"quest","id":"69034","obj":{"i":69034,"n":"The Creaky Mill Gets the Grease","g":115,"l":"Amh Araeng","s":6120}},{"type":"quest","id":"69037","obj":{"i":69037,"n":"Flower for a Friend","g":115,"l":"Amh Araeng","s":6150}},{"type":"quest","id":"69038","obj":{"i":69038,"n":"Church Warrant","g":115,"l":"Amh Araeng","s":6160}},{"type":"quest","id":"69039","obj":{"i":69039,"n":"Scavengers Assemble","g":115,"l":"Amh Araeng","s":6170,"f":1}},{"type":"quest","id":"69042","obj":{"i":69042,"n":"The Yolk's on You","g":115,"l":"Amh Araeng","s":6201}},{"type":"quest","id":"69044","obj":{"i":69044,"n":"Repair for the Worst","g":115,"l":"Amh Araeng","s":6220}},{"type":"quest","id":"69045","obj":{"i":69045,"n":"Stripe for the Picking","g":115,"l":"Amh Araeng","s":6230}},{"type":"quest","id":"69046","obj":{"i":69046,"n":"Mystery Miners","g":115,"l":"Amh Araeng","s":6240}},{"type":"quest","id":"69150","obj":{"i":69150,"n":"Down for Maintenance","g":8,"l":"Amh Araeng","s":730}}]}