{"quest":{"name":"A Fresh Start","location":"Amh Araeng","id":69157,"patch":5.0,"sort":800,"icon":100918,"eventIcon":71201,"issuer":1029783,"target":1029784,"genre":8,"journal":["For perhaps the first time, the look on Ryne's face is one of utter relief.","You left for Nabaath Areng with a girl named Minfilia, and return with one named Ryne, whom your fellow Scions welcome with open arms. Still more hearteningly, she is eager to put her newfound abilities to good use, revealing that she senses the presence of a Lightwarden to the west. This coincides with Y'shtola's own suspicions after surveying a site known as Malikah's Well. Seemingly, the extensive underground waterway represents a suitable place to hide, and so that is where you will begin your search.","After a short trek westward, you arrive at the edge of a cavernous maw─the entrance to Malikah's Well. You quickly confer with the other Scions, before steeling yourself to step into the unknown.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","You wend your way through the underground corridors of the well, its denizens impeding your every step, until you come face-to-face with the Lightwarden. Ignoring the protestations of your already aching limbs, you hurl yourself into battle once more and, after a drawn-out struggle, the beast is laid low.","To your relief, the path leading out of the well is blessedly empty, and soon you emerge beneath a spectacular night sky. The sight of it leaves your fellow Scions in awe, Alisaie seeming especially affected by the view.","With each hard-fought victory, the Light's grip over Norvrandt loosens, Kholusia now serving as its final foothold. Could the salvation of the First at last be within reach? It is a stirring thought, and one likely large in the minds of your comrades as you make ready to return to the Crystal Tower."],"objectives":["Survey the designated location.","Enter Malikah's Well.","Speak with Alisaie."],"dialogue":[{"name":"ALPHINAUD","text":"Minfilia will be sorely missed. Though it was Grandfather's legacy which first brought me to Eorzea, I would never have become a Scion were it not for her. Indeed, there would <span class=\"emphasis\">be</span> no Scions, and two worlds would be the worse for our absence."},{"name":"ALPHINAUD","text":"Tataru and the others will no doubt be heartbroken to hear the news of her passing. Until such time as we can return to them, however, we must keep our heads held high. Though we have lost one Scion, we have gained another, after all."},{"name":"ALISAIE","text":"Do you have any idea how worried we were when word reached us that Ran'jit was alive, and headed for the Hills of Amber?"},{"name":"ALISAIE","text":"Oh, I can't wait for this to be over, so we can all go home. Assuming we even <span class=\"emphasis\">can</span>."},{"name":"THANCRED","text":"Thank you for standing by Ryne. And Minfilia. I'm sure it meant a lot to her, seeing you one last time."},{"name":"THANCRED","text":"Would that I could have been there to hear what words were exchanged between them. When all of this is over, perhaps I'll ask."},{"name":"URIANGER","text":"Despite this glad turn of events, the suffering born of mine all-too-arrogant meddling paineth me still."},{"name":"URIANGER","text":"And yet...their smiles do give me hope for the morrow."},{"name":"YSHTOLA","text":"Ryne's aether has changed. It has taken on a faint, golden hue. Curious..."},{"name":"RYNE","text":"I honestly don't know how to repay you for all you've done, but I promise to do whatever I can to help."},{"name":"ALISAIE","text":"Are you certain you're up to fighting so soon? I can't imagine the power of the Oracle is something one learns to wield in the space of a few hours."},{"name":"RYNE","text":"Maybe not, but the presence of the Lightwardens is unmistakable to me now."},{"name":"RYNE","text":"In fact, I sense one here in Amh Araeng, to the west. I think it might be hiding underground."},{"name":"ALPHINAUD","text":"Underground? Then it's as we suspected!"},{"name":"YSHTOLA","text":"We thought it prudent to take a brief survey of the area prior to your arrival."},{"name":"YSHTOLA","text":"To the west we found the remains of a site known as Malikah's Well."},{"name":"YSHTOLA","text":"If I recall correctly, the well was built in remembrance of one of the ancient kings of Nabaath Areng to serve as a source of respite from the desert heat."},{"name":"YSHTOLA","text":"It fell into disuse after the Flood, whereupon the miners of Amh Araeng thought to turn part of it into an excavation site."},{"name":"ALPHINAUD","text":"Judging by its size, the underground waterways are no doubt extensive. The perfect hiding place for a Warden."},{"name":"ALPHINAUD","text":"Ryne, are you certain you can track it down?"},{"name":"RYNE","text":"Leave it to me."},{"name":"THANCRED","text":"Then it's settled. We make for Malikah's Well."},{"name":"ALPHINAUD","text":"A marvel of ingenuity, is it not?"},{"name":"ALISAIE","text":"Something about this doesn't feel right..."},{"name":"THANCRED","text":"I didn't expect to see Talos wandering about─much less of their own accord. How long must it have been since their creators' bones turned to dust?"},{"name":"RYNE","text":"The Warden is down there. I can feel it."},{"name":"URIANGER","text":"That the walls should still bear so great a burden after countless years of neglect bespeaketh the surpassing skill of their architects."},{"name":"YSHTOLA","text":"Though I cannot see it as you do, it is a no less awe-inspiring sight."},{"name":"RYNE","text":"It's here. I can taste its aether on the wind."},{"name":"ALISAIE","text":"Then we've finally found our mark."},{"name":"ALISAIE","text":"Let's put an end to this, <span class=\"highlight\">Forename</span>, and return the night sky to Amh Araeng."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Small talk."},{"name":"A1","text":"Form a party and enter Malikah's Well."},{"name":"A1","text":"Nothing."},{"name":"ALPHINAUD","text":"Our battle with the Warden of Holminster Switch was an eye-opening experience, to say the least. Alisaie and I have trained tirelessly that we might be better prepared for our next such encounter."},{"name":"ALPHINAUD","text":"For Minfilia, and the countless souls who struggled to carry on her legacy, we must end this."},{"name":"ALISAIE","text":"I can't help thinking about all the children at the Inn. Abandoned to wait for the inevitable."},{"name":"ALISAIE","text":"So long as the Light holds sway here, there is no hope for them. But if we defeat the Wardens, if we restore the night, then maybe...maybe they can still be saved."},{"name":"THANCRED","text":"No need to worry about me. Urianger and Y'shtola were quite thorough in their ministrations."},{"name":"THANCRED","text":"A pity their magicks did nothing for my clothes."},{"name":"THANCRED","text":"At any rate, we cannot well stop now. Not after all Ryne and Minfilia have given to bring us this far."},{"name":"RYNE","text":"The Warden's presence feels...familiar somehow. Now that I think about it, it reminds me of..."},{"name":"RYNE","text":"But that makes no sense. Sorry. I'm sure I'm just imagining things."},{"name":"URIANGER","text":"Lest thou worry, I did relay unto Magnus word of thine untimely accident whilst I waited for thee to return from thine audience with the Oracle. He hath since reclaimed his Talos and trolley both, and meaneth to begin repairs anon."},{"name":"URIANGER","text":"For a blessing, the damage was but superficial, the leonine heart unmarred by Ran'jit's onslaught."},{"name":"YSHTOLA","text":"I was surprised to hear Ran'jit survived the fall. Though I suppose I did the same."},{"name":"YSHTOLA","text":"More surprising is how he so readily saw through our diversion."},{"name":"YSHTOLA","text":"A foe possessed of such cunning would be sufficient cause for concern in itself, but one capable of besting Thancred in combat too...? We would do well not to underestimate him when next we meet."},{"name":"ALPHINAUD","text":"The end to Light's dominion over this world is fast at hand."},{"name":"THANCRED","text":"Perhaps their ministrations were not as thorough as I thought. Or perhaps I was a touch too reckless."},{"name":"RYNE","text":"If only I could've seen the look on Magnus's face when the night sky returned. They must all be so happy."},{"name":"RYNE","text":"But what about you, <span class=\"highlight\">Forename</span>? Do you feel...different at all?"},{"name":"URIANGER","text":"Once more shall the night share equal dominion over the firmament.<br>And yet our travails are far from over..."},{"name":"YSHTOLA","text":"Is this not the moment Emet-Selch usually chooses to descend upon us? Whatever will we do without his feigned praise and backhanded compliments?"},{"name":"ALISAIE","text":"We did it. We really did it. I only wish there were time to visit the Inn. We can but hope the return of night has granted the residents some shred of comfort."},{"name":"ALISAIE","text":"They thought the world beyond changing. But today I think we proved them wrong."},{"name":"ALISAIE","text":"We <span class=\"emphasis\">will</span> fix this broken land, <span class=\"highlight\">Forename</span>. Together."}],"reward":{"gil":4580,"aetherCurrent":1,"instance":69},"reqs":{"jobs":[{"lvl":77,"id":142}],"quests":[69156]},"next":[69066,69067,69068,69158]},"partials":[{"type":"npc","id":"1029783","obj":{"i":1029783,"n":"Ryne","l":2955,"q":1}},{"type":"npc","id":"1029784","obj":{"i":1029784,"n":"Alisaie","l":2955,"q":1}},{"type":"instance","id":"69","obj":{"i":69,"n":"Malikah's Well","c":61801,"t":"Dungeons","min_lvl":77,"max_lvl":78,"min_ilvl":385}},{"type":"quest","id":"69156","obj":{"i":69156,"n":"Crossroads","g":8,"l":"Amh Araeng","s":790}},{"type":"quest","id":"69066","obj":{"i":69066,"n":"No Disassemble","g":115,"l":"Amh Araeng","s":7001}},{"type":"quest","id":"69067","obj":{"i":69067,"n":"Thy Well Be Done","g":115,"l":"Amh Araeng","s":7010}},{"type":"quest","id":"69068","obj":{"i":69068,"n":"The Crystal Knaves","g":115,"l":"Amh Araeng","s":7020}},{"type":"quest","id":"69158","obj":{"i":69158,"n":"More than a Hunch","g":8,"l":"Amh Araeng","s":810}}]}