{"quest":{"name":"A Convenient Distraction","location":"Amh Araeng","id":69152,"patch":5.0,"sort":750,"icon":100916,"eventIcon":71201,"issuer":1029755,"target":1029757,"genre":8,"journal":["Thancred is tired of waiting around.","No sooner do you inform Thancred you are ready to leave than he makes southward toward Nuvy's Leavings. Not one to be outdone, you quickly follow him.","Much to Thancred's surprise, Nuvy's Leavings is not completely deserted. This promising turn of events prompts Thancred to head straight into the mine in search of Guthjon.","Despite the poor lighting of the mines, you manage to find Guthjon, alone in a dark corner taking inventory. You explain why you have come, but his response is as Thaffe expected. Nevertheless, he believes there may be one way for you to find what you are after. Before he divulges this secret of his trade, however, he asks a favor of you─to retrieve a Voeburt gold piece he dropped somewhere in the mine. Thancred reluctantly agrees in your stead, but it seems he has a plan up his sleeve.","Searching in the dark for the Voeburt gold seems a hopeless endeavor until Thancred presents you with a bottle of sundrops. A drop in each eye and suddenly the mine appears much brighter and vibrant. Now able to see, you begin your search.","You can feel the effects of the sundrops waning when a glint in the dark catches your eye. You rush over to sift through the rocks and soon find yourself in the possession of a Voeburt gold piece.","Upon seeing the gold piece, Thancred is relieved to see that Lady Luck has finally deigned to acknowledge your efforts. One can only hope Guthjon will do the same.","Guthjon seems surprised at your return. More so when you hand him the gold piece he lost in the mines. Now that you have held up your end of the deal, he prepares to do the same."],"objectives":["Speak with Thancred.","Speak with Guthjon.","Speak with Thancred.","Search the shadows for a Voeburt gold piece.","Present the Voeburt gold piece to Thancred.","Deliver the Voeburt gold piece to Guthjon."],"dialogue":[{"name":"RYNE","text":"Why must he always treat me like this..."},{"name":"URIANGER","text":"I prithee attend Thancred and keep him occupied with the task at hand."},{"name":"MAGNUS","text":"If not for those damned Talos, she'd...she'd..."},{"name":"THAFFE","text":"Guthjon has worked in these mines longer than near anyone I know. You'd do well to heed his advice in there."},{"name":"THANCRED","text":"I'd say we're long overdue for a good turn. I can only hope the gods feel the same way."},{"name":"THANCRED","text":"Now, Nuvy's Leavings was to the south, was it? Let's get going."},{"name":"THANCRED","text":"The way you described it, I was expecting the place to be abandoned."},{"name":"THANCRED","text":"Perhaps our fortunes are finally improving. Though we should probably hear what Guthjon has to say before we celebrate─assuming we can find him, that is..."},{"name":"THANCRED","text":"Is this our man?"},{"name":"GUTHJON","text":"Hm? Who are you, and what are you doing in here?"},{"name":"GUTHJON","text":"Well, you should have listened to Thaffe. You're wasting your time."},{"name":"THANCRED","text":"But this site is not as developed as the others, is it not? Surely there must be something left."},{"name":"GUTHJON","text":"I should explain. The stone you're looking for is leonine. All the Talos in the Hills of Amber are powered using them."},{"name":"GUTHJON","text":"Or were, at least. Anyway, whatever's left─if anything─is too far below to be safely excavated."},{"name":"GUTHJON","text":"In the deepest reaches of the mine, we used Talos to keep the pathways from collapsing. They're still there, but they could give out at any time, which is why much of the mine is closed off."},{"name":"THANCRED","text":"Then our only option is to search the higher levels for any fragments of leonine that may have been overlooked."},{"name":"GUTHJON","text":"Hmm... I suppose there may be one other way."},{"name":"THANCRED","text":"Well? Don't leave us in suspense."},{"name":"GUTHJON","text":"What you're asking for is a trade secret. I'll need to be duly compensated in exchange."},{"name":"THANCRED","text":"&lt;sigh&gt; Fine. What do you want?"},{"name":"GUTHJON","text":"The other day I found a Voeburt gold piece down in the mines. A bloody Voeburt gold piece! And wouldn't you know it, I dropped the damned thing somewhere while I was working."},{"name":"GUTHJON","text":"Find it, and I'll tell you what you want to know."},{"name":"THANCRED","text":"You drive a hard bargain, sir, but we'll take it."},{"name":"THANCRED","text":"It seems we have our work cut out for us, <span class=\"highlight\">Forename</span>. Thankfully, I have an idea for how we might hurry things along."},{"name":"GUTHJON","text":"I wasn't working that deep in the mines, so don't go searching too far."},{"name":"THANCRED","text":"As I'm sure you've noticed, despite their best efforts to illuminate the corridors, it's rather dark in here. Meaning it will be that much harder to find a single coin hiding in the shadows."},{"name":"THANCRED","text":"That's why I propose we use these─sundrops. They help the eye take in more light."},{"name":"THANCRED","text":"Why don't you start your search further in, and I handle this area here? I'll retrace your steps after in case you happen to miss it."},{"name":"THANCRED","text":"If you feel the drops' effects wearing off, I can give you more, so don't worry."},{"name":"THANCRED","text":"Back so soon? I thought the drops would last longer than that."},{"name":"THANCRED","text":"Here. Now keep searching. It has to be here somewhere."},{"name":"SYSTEM","text":"You fumble through the dark, but you fail to see anything. Perhaps Thancred's sundrops could help in your search."},{"name":"SYSTEM","text":"You search the shadows but find nothing. Perhaps the gold piece lies elsewhere..."},{"name":"SYSTEM","text":"As you search the shadows, a glint catches your eye. You turn over a rock and find the Voeburt gold piece!"},{"name":"THANCRED","text":"I was hoping he dropped the gold piece somewhere closer to the entrance. More fool me for thinking Lady Luck was on our side..."},{"name":"THANCRED","text":"...Or maybe she is. Yours at least. In the end, my contribution was little more than poor company."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Well, I couldn't have done it without your sundrops."},{"name":"A1","text":"Come now, Thancred. You were far more prepared for this task than I."},{"name":"THANCRED","text":"So you say, but you have a proven knack for success regardless of circumstances. I doubt very much I could've discovered it unassisted."},{"name":"THANCRED","text":"No more than usual, I assure you."},{"name":"THANCRED","text":"I only managed to survive the Coerthan wilderness and the imperial capital by virtue of extensive preparation─a habit of mine since childhood, and one of my few positive traits which endeared me to Louisoix, I imagine."},{"name":"THANCRED","text":"It hasn't been easy finding ways to compensate for my...condition. Every tool and trinket has proven vital to my continued success─such as it is."},{"name":"THANCRED","text":"Had I chosen to pursue the arcane arts rather than espionage, well... I'd rather not think on it."},{"name":"THANCRED","text":"So long as I have the means to protect those dear to me, and to see my duties through, that's all that matters."},{"name":"THANCRED","text":"Now let's hurry and see that returned to Guthjon. The sooner we get back to Urianger and Minfilia, the better."},{"name":"THANCRED","text":"I'd rather not stay here any longer than necessary. Let's get going."},{"name":"GUTHJON","text":"You're back. Wait, does that mean...?"},{"name":"GUTHJON","text":"I'll be damned. You actually found it!"},{"name":"GUTHJON","text":"Well, a deal's a deal. But don't think this means you'll find what you're after."}],"reward":{"gil":914},"reqs":{"jobs":[{"lvl":77,"id":142}],"quests":[69151]},"next":[69153]},"partials":[{"type":"npc","id":"1029755","obj":{"i":1029755,"n":"Thancred","l":2955,"q":2}},{"type":"npc","id":"1029757","obj":{"i":1029757,"n":"Guthjon","l":2955,"q":2}},{"type":"quest","id":"69151","obj":{"i":69151,"n":"The Truth Hurts","g":8,"l":"Amh Araeng","s":740}},{"type":"quest","id":"69153","obj":{"i":69153,"n":"A Dirty Job","g":8,"l":"Amh Araeng","s":760}}]}