{"quest":{"name":"The Truth Hurts","location":"Amh Araeng","id":69151,"patch":5.0,"sort":740,"eventIcon":71201,"issuer":1030569,"target":1029755,"genre":8,"journal":["Jeryk may come to regret his next decision."],"objectives":["Speak with Thaffe.","Speak with Urianger.","Search for Thancred."],"dialogue":[{"name":"MAGNUS","text":"I thought I told you to leave!"},{"name":"THAFFE","text":"I'm sorry, but I think it'd be for the best if you just forgot about the Talos."},{"name":"THANCRED","text":"What could be so terrible he'd want to keep it from us?"},{"name":"RYNE","text":"I hope Jeryk doesn't get in trouble for telling us what happened."},{"name":"URIANGER","text":"Though the Talos yet wants for a beating heart, it would appear thine efforts were not for naught."},{"name":"JERYK","text":"Right, then. The Talos...their hearts cannot be made of just any stone. You need a special sort with sufficient aetherial conductivity. Both it and the other materials used in the construction of Talos bodies are mined in the same place..."},{"name":"JERYK","text":"That place, of course, being here. The Hills of Amber..."},{"name":"JERYK","text":"And it was three years ago when...when she..."},{"name":"JERYK","text":"No, no I can't. I'm sorry, but you'll have to hear it from Thaffe or someone else."},{"name":"THANCRED","text":"&lt;sigh&gt; Back to the tavern, then."},{"name":"THANCRED","text":"You don't suppose Thaffe is going to run off too, do you?"},{"name":"RYNE","text":"This is all my fault. I never should have pressured him."},{"name":"URIANGER","text":"What terrible tragedy befell him years ago, I wonder..."},{"name":"THAFFE","text":"Still here, eh? You can ask again, but the answer's the same. Our trolleys are─"},{"name":"THAFFE","text":"What!? Godsdammit Jeryk. You could've at least finished so I wouldn't have to clean up your mess."},{"name":"THAFFE","text":"Seeing how you made such quick progress in fixing that Talos and all, he was probably thinking you could help change things around here."},{"name":"THAFFE","text":"And I think he may be right... Gather your friends, and I'll tell you what you want to know."},{"name":"RYNE","text":"Why must he always treat me like this..."},{"name":"MAGNUS","text":"If not for those damned Talos, she'd...she'd..."},{"name":"THAFFE","text":"I wish there was more we could do for you, I truly do. But after Agna's accident, no one is allowed near those mines."},{"name":"URIANGER","text":"Full well do I know the pain of loss and how heavily it can weigh on one's heart. Nevertheless, there is but one way forward."},{"name":"URIANGER","text":"We must needs procure a new heart for the Talos."},{"name":"URIANGER","text":"Thaffe. Knowest thou any location wherein we might find the stone we require? No matter how scant the possibility, we would seize it."},{"name":"THAFFE","text":"I told you near all of the veins were tapped dry years ago. ...Though I suppose, if you really wanted to try, you may find something at Nuvy's Leavings."},{"name":"THAFFE","text":"It was opened well before Talos became commonplace, which is why the mining there was never quite as deep."},{"name":"THAFFE","text":"When you get there, look for Guthjon and tell him I sent you. But don't be surprised if he tells you the same thing."},{"name":"URIANGER","text":"Thine assistance is most appreciated."},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span>. I think it best Thancred join thee in this search."},{"name":"URIANGER","text":"Though he wouldst be quick to deny it, his heart is in turmoil, and his thoughts clouded."},{"name":"URIANGER","text":"'Twould be unwise to ignore his distress."},{"name":"URIANGER","text":"I prithee attend Thancred and keep him occupied with the task at hand."},{"name":"THAFFE","text":"Guthjon has worked in these mines longer than near anyone I know. You'd do well to heed his advice in there."},{"name":"THANCRED","text":"Off to somewhere, are you?"},{"name":"THANCRED","text":"At last, a lead on the stone we need to power the Talos."},{"name":"THANCRED","text":"I can't very well have you go on your own. Lead the way."}],"reward":{"gil":830,"items":[{"id":26857}]},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[69150]},"next":[69035,69047,69152]},"partials":[{"type":"npc","id":"1030569","obj":{"i":1030569,"n":"Jeryk","l":2955,"q":1}},{"type":"npc","id":"1029755","obj":{"i":1029755,"n":"Thancred","l":2955,"q":2}},{"type":"item","id":"26857","obj":{"i":26857,"n":"Titanbronze Weapon Coffer (IL 409)","l":1,"c":26557,"t":61}},{"type":"quest","id":"69150","obj":{"i":69150,"n":"Down for Maintenance","g":8,"l":"Amh Araeng","s":730}},{"type":"quest","id":"69035","obj":{"i":69035,"n":"Big Sister Is Watching You","g":115,"l":"Amh Araeng","s":6130}},{"type":"quest","id":"69047","obj":{"i":69047,"n":"Charmless Man","g":115,"l":"Amh Araeng","s":6250,"f":1}},{"type":"quest","id":"69152","obj":{"i":69152,"n":"A Convenient Distraction","g":8,"l":"Amh Araeng","s":750}}]}