{"quest":{"name":"Have a Heart","location":"Amh Araeng","id":69154,"patch":5.0,"sort":770,"eventIcon":71201,"issuer":1029759,"target":1029638,"genre":8,"journal":["Guthjon is still reeling from your miraculous find."],"objectives":["Speak with Magnus.","Deliver the chunk of leonine to Urianger.","Speak with Urianger."],"dialogue":[{"name":"THANCRED","text":"I had hoped we would find leonine, but to find that particular specimen is nothing short of a miracle."},{"name":"GUTHJON","text":"I wouldn't believe it had I not seen it for myself."},{"name":"GUTHJON","text":"Before you set it in the Talos, would you take it to Magnus?"},{"name":"GUTHJON","text":"For three long years he's believed she died for nothing. He must know the truth─that her sacrifice was not in vain."},{"name":"THANCRED","text":"We'll take it straight to him. You have my word. Thank you, Guthjon, for all your help."},{"name":"THANCRED","text":"Right, then. Let's not keep everyone waiting."},{"name":"THANCRED","text":"Gods. What do we say?"},{"name":"GUTHJON","text":"I can only imagine the look on his face when he sees that."},{"name":"MAGNUS","text":"...What? Oh, it's you."},{"name":"MAGNUS","text":"If you've come to complain about the trolley, you'll find no sympathy from me. I told you before it won't run, and you wouldn't listen."},{"name":"THANCRED","text":"Oh, but it will. Now that we have this."},{"name":"THANCRED","text":"Your name is engraved on it, along with your son's. It was a gift from your wife, Magnus. From Agna."},{"name":"MAGNUS","text":"No... No, she couldn't have..."},{"name":"MAGNUS","text":"Agna..."},{"name":"MAGNUS","text":"Take it. Do with it what you will."},{"name":"THANCRED","text":"Are you certain? It would delay our plans, but─"},{"name":"MAGNUS","text":"I said take it. It was you who found it, you who needs it."},{"name":"MAGNUS","text":"Looking at that stone, all I can see is...is..."},{"name":"MAGNUS","text":"Please, just leave me be."},{"name":"THANCRED","text":"I hope you'll be there when the Talos stirs to life."},{"name":"THANCRED","text":"I'm sure she'd want you to see it."},{"name":"THANCRED","text":"Would you do the honors of delivering this to Urianger?"},{"name":"THANCRED","text":"Finally we can move on to Nabaath Areng. Assuming this works, of course."},{"name":"RYNE","text":"Sorry I couldn't be of more help. By the sounds of it, you have a knack for handling strange requests."},{"name":"RYNE","text":"On the bright side, Urianger taught me a lot about the Talos and their hearts. I think I can help if they need further repairs."},{"name":"THAFFE","text":"You what!? By the gods, I didn't think it possible."},{"name":"JERYK","text":"You found leonine? Truly? Then what are we waiting for─let's get that trolley moving!"},{"name":"MAGNUS","text":"Hmmm..."},{"name":"URIANGER","text":"Thou art returned, and with leonine it would seem."},{"name":"URIANGER","text":"As promised, the Talos hath been made ready to receive its heart, thanks in no small part to Jeryk, Thaffe, and Minfilia."},{"name":"URIANGER","text":"At last we shall return time to the timeless, this sentinel of stone, that we may press on towards Nabaath Areng."},{"name":"URIANGER","text":"Very good. Now, let us begin."},{"name":"THANCRED","text":"I only want what's best for her. If only she could see that..."},{"name":"RYNE","text":"&lt;sniff&gt; I'm fine. Really. It's just been a long day."},{"name":"MAGNUS","text":"I must confess you've impressed me. I did not expect the Talos to be in such fine condition."},{"name":"THAFFE","text":"You've done us a kindness far greater than anything we deserve. Thank you. Thank you so much."},{"name":"JERYK","text":"Just thinking about the trolley running down the tracks, gears churning─gods, I can't stop smiling! "},{"name":"URIANGER","text":"Mine apologies for the delay. Minfilia and I had a private matter to discuss."},{"name":"URIANGER","text":"Which bringeth me to the question─how didst thou find Thancred during your search?"},{"name":"URIANGER","text":"He spoke of Minfilia? Of his own accord? I see..."},{"name":"URIANGER","text":"'Tis well that he did, and with such candor."},{"name":"URIANGER","text":"I attempted to broach the subject before. Mine intention was to ensure no words remained unspoken between them, lest tragedy intercede. A regret I myself know all too well. Alas, in the end he refused to heed my counsel."},{"name":"URIANGER","text":"A time will come when they must face the reality of their circumstances. But I have faith that all will be well in time..."},{"name":"URIANGER","text":"Now, let us not tarry any longer. The Talos and Nabaath Areng await."}],"reward":{"gil":992},"reqs":{"jobs":[{"lvl":77,"id":142}],"quests":[69153]},"next":[69155]},"partials":[{"type":"npc","id":"1029759","obj":{"i":1029759,"n":"Guthjon","l":2955,"q":2}},{"type":"npc","id":"1029638","obj":{"i":1029638,"n":"Urianger","l":2955,"q":1}},{"type":"quest","id":"69153","obj":{"i":69153,"n":"A Dirty Job","g":8,"l":"Amh Araeng","s":760}},{"type":"quest","id":"69155","obj":{"i":69155,"n":"Full Steam Ahead","g":8,"l":"Amh Araeng","s":780}}]}