{"quest":{"name":"Full Steam Ahead","location":"Amh Araeng","id":69155,"patch":5.0,"sort":780,"icon":100917,"eventIcon":71201,"issuer":1029765,"target":1029775,"genre":8,"journal":["Magnus is grinning from ear to ear.","Repairs to the Talos are complete, as are preparations for your voyage. Eager to enjoy the fruits of his labors, Magnus leaves with Thaffe and Jeryk for the Mount Biran Mines to perform a few final checks and plot your route to Nabaath Areng. He bids you join them when you are ready.","Before long, Minfilia will come face-to-face with the original Oracle─the real Minfilia. But despite her understandable trepidation, she assures you of her commitment to see her journey through to its end. With both Thancred and Urianger also ready to set off, you have only to speak with Magnus to proceed.","You board the trolley, but Minfilia quickly notes Urianger's failure to follow suit. He duly insists you continue without him, that he might inform Alphinaud and the others of your progress. After a short farewell, the Talos is set into motion, and the trolley begins racing down the tracks. The gate to Nabaath Areng opens without incident, but an unwelcome sight awaits you on the other side─Ran'jit.","With a single blow, Ran'jit topples the trolley, sending you and the others tumbling in all directions. Struggling to her feet, Minfilia pleads with him to let you pass, but her words only serve to send him into a rage. He moves to strike her down, but is prevented by Thancred at the last moment. Eyes aflame, the Scion commands Minfilia to leave while he contends with Ran'jit. After a moment's hesitation, you take Minfilia with you southward, the clang of steel ringing out behind you.","At long last, you have arrived at Nabaath Areng. Within awaits the Oracle. Minfilia steels herself as you press onward, still unsure how this reunion with her kindred spirit from the Source will end."],"objectives":["Speak with Minfilia.","Speak with Magnus.","Speak with Minfilia."],"dialogue":[{"name":"THANCRED","text":"I only want what's best for her. If only she could see that..."},{"name":"RYNE","text":"&lt;sniff&gt; I'm fine. Really. It's just been a long day."},{"name":"URIANGER","text":"Magnus maketh ready for our departure even as we speak. Might I prevail upon thee to inquire as to his progress?"},{"name":"THAFFE","text":"You've done us a kindness far greater than we deserve. Thank you. I mean it."},{"name":"JERYK","text":"Just thinking about the trolley speeding down the tracks, gears whirring─gods, I can't stop smiling!"},{"name":"MAGNUS","text":"It's been years since I've seen a Talos in such fine shape. Would that Agna was here to see it. Or our son..."},{"name":"MAGNUS","text":"I was ready to let her dreams die down there in the mines. Even after you'd found the leonine, I refused to believe it could work. Gods, what a fool I was."},{"name":"MAGNUS","text":"But I tell you now─I'm going to take good care of this Talos. For both their sakes.<br>On behalf of my family, and all the miners of Twine, thank you."},{"name":"MAGNUS","text":"Well, enough chitter-chatter. Let's get you lot to Nabaath Areng, eh?"},{"name":"THANCRED","text":"Everything seems to be in order. I take it the Talos's presence resolves the issue of the gate?"},{"name":"MAGNUS","text":"Hm? Oh, that. Yes."},{"name":"MAGNUS","text":"It's designed to open at the Talos's approach."},{"name":"RYNE","text":"Then we can finally go to Nabaath Areng."},{"name":"MAGNUS","text":"You certainly can. All that remains is a final check of the control box over at the mines."},{"name":"MAGNUS","text":"You hear that, boys? Get that Talos over to the mines, and keep a close eye on it around the curves. Understood?"},{"name":"THAFFE","text":"Yes sir!"},{"name":"URIANGER","text":"Let us repair to the mines, then."},{"name":"RYNE","text":"Before we go..."},{"name":"RYNE","text":"While you were away with <span class=\"highlight\">Forename</span>, I prepared an extra set of cartridges for you."},{"name":"RYNE","text":"And this one. It's the practice cartridge you gave me."},{"name":"RYNE","text":"I know I should've thrown it away ages ago, but I've been adding a little extra to it every day. After so many charges, I'm honestly not sure what it will do. But I wanted you to have it. For luck."},{"name":"THANCRED","text":"Minfilia, I─ Uh..."},{"name":"RYNE","text":"We should hurry. Magnus and the others are probably wondering where we are."},{"name":"THANCRED","text":"I know what you're thinking, and I <span class=\"emphasis\">will</span> talk to her. When the time is right."},{"name":"URIANGER","text":"All appeareth ready for the grand departure. But one task yet remaineth..."},{"name":"MAGNUS","text":"Luckily, Thaffe and Jeryk didn't spend the last few years trying to drink themselves to death, and had the good sense to maintain this stuff. I'll have to thank them later."},{"name":"THAFFE","text":"Ever since we got the Talos moving again, Jeryk has been acting strangely. Perhaps strange isn't the right word. More...overexcited. But as long as he gets the job done, I suppose I can't complain."},{"name":"JERYK","text":"Is this not the most beautiful sight you've ever seen? Oh, if only I could capture this moment in a painting, or even a quick pencil sketch."},{"name":"JERYK","text":"Hey, you seem pretty good at...everything. You wouldn't happen to be an artist too, would you?"},{"name":"RYNE","text":"So this is it. We're finally going to Nabaath Areng."},{"name":"RYNE","text":"I've thought long and hard about what to say to her. To the real Minfilia."},{"name":"RYNE","text":"I hoped when the time came I would know, but with every step we take I feel more uncertain."},{"name":"RYNE","text":"That's no reason to give up, though. Not when so much is at stake."},{"name":"RYNE","text":"Thank you, all of you, for helping me to get here. Now, let's not keep Magnus waiting."},{"name":"RYNE","text":"One last step... I'm glad to be taking it with you."},{"name":"MAGNUS","text":"There you are. So, what do you think?"},{"name":"MAGNUS","text":"A little primitive-looking, I'll admit, but Daedalus Stoneworks has always favored a simple, intuitive design, and that philosophy has served us well enough."},{"name":"MAGNUS","text":"Much of the trolley network uses single tracks, making it easy for the Talos to navigate them as needed."},{"name":"MAGNUS","text":"And plotting a route is so simple, even <span class=\"emphasis\">we</span> can do it, which makes for fewer accidents in transit."},{"name":"MAGNUS","text":"Speaking of which, are you ready to board?"},{"name":"MAGNUS","text":"All right, then. Watch your step."},{"name":"Q1","text":"Travel to Nabaath Areng?"},{"name":"RYNE","text":"This is the place, <span class=\"highlight\">Forename</span>. This is where she stopped the Flood."},{"name":"RYNE","text":"The last time I was here, when I felt her presence overwhelming me...I tried to pretend it wasn't happening─to just...turn away."},{"name":"RYNE","text":"But I can't turn away now. Not this time. For Thancred and the others, I have to face her."},{"name":"SYSTEM","text":"In the event that you leave the area, speak with the apprentice engineer at Twine in Amh Araeng to return to Nabaath Areng."}],"reward":{"gil":2240},"reqs":{"jobs":[{"lvl":77,"id":142}],"quests":[69154]},"next":[69156]},"partials":[{"type":"npc","id":"1029765","obj":{"i":1029765,"n":"Magnus","l":2955,"q":1}},{"type":"npc","id":"1029775","obj":{"i":1029775,"n":"Minfilia","l":2955,"q":2}},{"type":"quest","id":"69154","obj":{"i":69154,"n":"Have a Heart","g":8,"l":"Amh Araeng","s":770}},{"type":"quest","id":"69156","obj":{"i":69156,"n":"Crossroads","g":8,"l":"Amh Araeng","s":790}}]}