{"quest":{"name":"Down for Maintenance","location":"Amh Araeng","id":69150,"patch":5.0,"sort":730,"eventIcon":71201,"issuer":1029643,"target":1029761,"genre":8,"journal":["Despite his better judgment, Jeryk is considering throwing you a bone."],"objectives":["Examine the defective Talos.","Slay debitage for their fragments.","Deliver the debitage fragments to Urianger."],"dialogue":[{"name":"MAGNUS","text":"Piss off."},{"name":"THAFFE","text":"I'd be lying if I said that I didn't expect that. But for what it's worth, I'm sorry."},{"name":"JERYK","text":"Not that it'll do you any good, but we do have a Talos we've been meaning to repair."},{"name":"JERYK","text":"I can show you if you'd like. It'd certainly be nice to hear something other than Magnus's griping for a change."},{"name":"URIANGER","text":"Thou art come to examine the Talos?"},{"name":"JERYK","text":"Looks like someone's already beat us here, but please─look about as much as you like."},{"name":"URIANGER","text":"Truly a most vexing state of affairs. I thought mayhap a closer examination might yield something of value..."},{"name":"URIANGER","text":"I see. The means to build Talos stone by stone are lost to us, 'tis true, but here before us slumbers a most fine specimen."},{"name":"URIANGER","text":"Indeed, were it not for a few minor failings it would be in working condition."},{"name":"URIANGER","text":"'Twill likely require naught but a few modest repairs and a suffusion of aether."},{"name":"JERYK","text":"Well, if you think you can get the thing up and running, far be it from me to stop you. But, what exactly do you reckon is the problem?"},{"name":"URIANGER","text":"I should stress that I have performed only the most cursory of examinations, though such arcane constructs are not wholly unfamiliar to me. As I did suspect from the first, it is host to a network of veins through which aether floweth freely."},{"name":"URIANGER","text":"Or so it would, were it not for several fractures which now impede said flow."},{"name":"JERYK","text":"How in the hells did you get all that from just a glance? I take it you've thought up a solution as well, then?"},{"name":"URIANGER","text":"To bridge these fissures requireth a material highly conductive to aether. Once in place, I believe it will be possible to restore the Talos to life."},{"name":"URIANGER","text":"Might I prevail upon thee to acquire that which we require?"},{"name":"URIANGER","text":"Not far beyond the walls of Twine dwelleth a creature of living stone─the debitage. Full sure am I that stone from such a being would prove most suitable to our needs."},{"name":"URIANGER","text":"Very good. I shall have Thancred and Minfilia attend me in the remaining preparations."},{"name":"URIANGER","text":"I spied but three obstructions to the flow of aether in the Talos, and thus would I ask you provide three stones of the debitage. All else will be made ready upon thy return."},{"name":"URIANGER","text":"Worry not, <span class=\"highlight\">Forename</span>. Preparations here will be complete ere long."},{"name":"JERYK","text":"Wish we had a mage like him around sooner. As you might imagine, we've had trouble convincing people to come here to help. They either refuse outright or demand payment far beyond anything we could hope to afford."},{"name":"JERYK","text":"It's why we've made such little progress in repairing the Talos. We've pored over every scrap of paper left behind by Daedalus Stoneworks hoping we might learn how it's done, but there just isn't enough."},{"name":"URIANGER","text":"Thancred and Minfilia will return ere long with the remaining supplies we require."},{"name":"URIANGER","text":"Didst thou succeed in procuring stone from the debitage?"},{"name":"URIANGER","text":"Fine specimens one and all. You have my thanks. We need now but wait for Thancred and Minfilia's return."},{"name":"URIANGER","text":"From end to end, the paths by which aether may flow through the Talos have been duly mended."},{"name":"URIANGER","text":"They but require a sufficient enduement."},{"name":"THANCRED","text":"It's...not moving."},{"name":"URIANGER","text":"Strange... The core refuseth to stir. I fear the condition of this Talos is more dire than I previously surmised."},{"name":"URIANGER","text":"As a heart driveth blood through a man's veins, so doth the core aether throughout this massive frame. Failing its repair or replacement, the Talos cannot be restored."},{"name":"JERYK","text":"So it was the heart after all..."},{"name":"URIANGER","text":"Thou didst foresee this outcome?"},{"name":"JERYK","text":"Well, no. Not exactly. We'd never gotten this far in trying to repair it, so we had no way of knowing the heart was the real problem."},{"name":"JERYK","text":"We tried to find another. In case things turned out as they are now, but..."},{"name":"RYNE","text":"...Jeryk?"},{"name":"JERYK","text":"This isn't really my story to share."},{"name":"RYNE","text":"Please, Jeryk. If something went wrong, maybe we can help."},{"name":"JERYK","text":"All right, all right. After all you lot have done for me, I suppose it's the least I can do."}],"reward":{"gil":791},"reqs":{"jobs":[{"lvl":76,"id":142}],"quests":[69149]},"next":[69151]},"partials":[{"type":"npc","id":"1029643","obj":{"i":1029643,"n":"Jeryk","l":2955,"q":2}},{"type":"npc","id":"1029761","obj":{"i":1029761,"n":"Urianger","l":2955,"q":1}},{"type":"quest","id":"69149","obj":{"i":69149,"n":"On Track","g":8,"l":"Amh Araeng","s":720}},{"type":"quest","id":"69151","obj":{"i":69151,"n":"The Truth Hurts","g":8,"l":"Amh Araeng","s":740}}]}