{"quest":{"name":"A Dirty Job","location":"Amh Araeng","id":69153,"patch":5.0,"sort":760,"eventIcon":71201,"issuer":1029757,"target":1029759,"genre":8,"journal":["Luckily for you, Guthjon is a man of his word."],"objectives":["Speak with Guthjon.","Obtain the smoke bombs from the nearby shack.","Place the smoke bombs at the designated locations inside the mine.","Inspect the rubble and slay any knockers that appear to acquire glittering rocks.","Deliver the glittering rocks to Guthjon."],"dialogue":[{"name":"THANCRED","text":"Perhaps our luck really is starting to turn around."},{"name":"GUTHJON","text":"To be honest, I wasn't sure you could pull it off."},{"name":"GUTHJON","text":"But you did, and I'm a man of my word. Come with me."},{"name":"THANCRED","text":"I hope you waited for the sundrops to wear off. They work wonders in the dark, but in the light of day they'll only bring you pain."},{"name":"GUTHJON","text":"&lt;sigh&gt; Every time I step out of those mines the sky seems to get brighter. I'd never leave them if the air weren't so stale..."},{"name":"GUTHJON","text":"But you're not come to hear my grievances. You're after leonine."},{"name":"GUTHJON","text":"First, I have to ask─you ever heard of rockworms?"},{"name":"THANCRED","text":"Rockworms? I know them by another name, though I'm fairly certain the locals call them knockers."},{"name":"GUTHJON","text":"Aye, that they do. Whatever you want to call them, those little bastards may be the answer to your troubles."},{"name":"GUTHJON","text":"They can fit through cracks and crevices down where we could never hope to reach."},{"name":"GUTHJON","text":"And, on occasion, they come back with something valuable."},{"name":"THANCRED","text":"They dig up leonine in the mines?"},{"name":"GUTHJON","text":"It's a rare occurrence, but yes. That said, it usually amounts to no more than a few flakes."},{"name":"THANCRED","text":"Well our only other option sounds tantamount to suicide. So how can we draw out these rockworms?"},{"name":"GUTHJON","text":"Over by that shack you'll find a bag full of smoke bombs. Set off a few in the mines and you'll flush them out in no time."},{"name":"GUTHJON","text":"Once they're out in the open, knock 'em senseless and check their backs."},{"name":"GUTHJON","text":"I should warn you this method of <span class=\"emphasis\">mining</span>, if you can even call it that, is used as a last resort on account of what little they're like to bring back. You'll want to cover as much ground as you can if you hope to find anything of value."},{"name":"GUTHJON","text":"Assuming you do find something, bring it here and I'll have a look."},{"name":"THANCRED","text":"We should split up if we're to cover more ground as he suggests. If you can cover these three areas on your map, I'll see to the parts between them."},{"name":"GUTHJON","text":"The smoke bombs are on top of the crates next to the shack just over yonder. You can't miss them."},{"name":"GUTHJON","text":"I see you've got the smoke bombs, but they'll do you no good out here."},{"name":"GUTHJON","text":"Light them in the mines and the rockworms will come scampering out before long."},{"name":"SYSTEM","text":"The air in the mines grows thick with smoke. Nearby you hear the soft rumbling of stones."},{"name":"SYSTEM","text":"You sense a hostile presence beneath the rubble!"},{"name":"THANCRED","text":"I found my fair share of rocks. Hopefully there's leonine among them."},{"name":"GUTHJON","text":"There you are. Find anything promising?"},{"name":"GUTHJON","text":"Between the two of you I'd say you've got quite the haul."},{"name":"GUTHJON","text":"Best get comfortable, friends. It's going to take time for me to sift through all this."}],"reward":{"gil":992,"items":[{"num":3,"id":5740,"one":1},{"num":3,"id":5736,"one":1},{"num":3,"id":5741,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":77,"id":142}],"quests":[69152]},"next":[69061,69154]},"partials":[{"type":"npc","id":"1029757","obj":{"i":1029757,"n":"Guthjon","l":2955,"q":2}},{"type":"npc","id":"1029759","obj":{"i":1029759,"n":"Guthjon","l":2955,"q":2}},{"type":"item","id":"5740","obj":{"i":5740,"n":"Wine Red Dye","l":30,"c":22805,"t":55}},{"type":"item","id":"5736","obj":{"i":5736,"n":"Lilac Purple Dye","l":1,"c":22805,"t":55,"p":216}},{"type":"item","id":"5741","obj":{"i":5741,"n":"Coral Pink Dye","l":1,"c":22805,"t":55,"p":334}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69152","obj":{"i":69152,"n":"A Convenient Distraction","g":8,"l":"Amh Araeng","s":750}},{"type":"quest","id":"69061","obj":{"i":69061,"n":"A Vein Pursuit","g":115,"l":"Amh Araeng","s":7030,"f":1}},{"type":"quest","id":"69154","obj":{"i":69154,"n":"Have a Heart","g":8,"l":"Amh Araeng","s":770}}]}