{"quest":{"name":"Return to Eulmore","location":"The Crystarium","id":69166,"patch":5.0,"sort":820,"icon":100919,"eventIcon":71201,"issuer":1027231,"target":1030171,"genre":8,"journal":["By the way his face lights up at your approach, the manager of suites has been waiting for you.","Greeting you with his customary cheer, the master of suites informs you that the Crystal Exarch has requested your presence in the Ocular.","Having taken your place amongst your comrades in the Ocular, you discuss the mission to find and vanquish the Lightwarden of Kholusia. Yet even as you allow yourselves a moment to consider the prospect of victory, Emet-Selch sours the mood with the declaration that driving back the Light will not serve to save the world. Elaborating upon his earlier history lesson, he informs you that as Zodiark and Hydaelyn warred, the latter struck a devastating blow which sundered not only Her foe, but all of creation, into fourteen fragments. It was then, looking upon the shattered remains of their home, that the Ascians resolved to rejoin the worlds. While Emet-Selch's tale only serves to underscore the difference between your goals, you have little choice but to focus on the mission at hand. According to intelligence, the forces of Eulmore are entrenching themselves inside the city, suggesting that the Lightwarden likely hides therein. So it is that you and your comrades depart for Kholusia, having agreed to rendezvous in the village of Wright.","Joining Alphinaud and Ryne in Wright, you learn that the others have gone on ahead to reconnoiter. When the time comes for your group to follow, Alphinaud bids you clear the path of prying eyes.","On the way to Gatetown, you encounter civilians behaving strangely, as if in a trance, with some proving hostile. While their behavior is unsettling, for now the way is secure, and you press on to the settlement as planned.","You arrive in Gatetown to find it gripped by a strange phenomenon. It seems the villagers you encountered en route were far from the only ones affected..."],"objectives":["Head to the Ocular.","Speak with Alphinaud in Wright.","Speak with people en route to Gatetown.","Speak with Thancred."],"dialogue":[{"name":"GUIDEOFTHEPENDANTS","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I trust you had a pleasant rest."},{"name":"GUIDEOFTHEPENDANTS","text":"While you were ensconced in your chamber, a message arrived for you from the Exarch. He bids you come to the Ocular at your earliest convenience."},{"name":"GUIDEOFTHEPENDANTS","text":"...And, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>? Wherever your duties may take you next, I shall pray for your safe return. May the night keep you."},{"name":"MYSTERYVOICE","text":"Your condition is unchanged? Good. If you can but hold out until the end of the coming battle, I am confident that we will find a remedy for your affliction."},{"name":"LYNA","text":"We've not spoken for a while, have we? Not since the aftermath of the eaters' attack."},{"name":"LYNA","text":"Rest assured I am fully recovered, and will do my utmost to support you and your fellow Warriors of Darkness."},{"name":"EMETSELCH","text":"Yes? Did my lesson provoke thought, giving rise to further questions?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Three of you escaped the sundering. But what of those who didn't...?"},{"name":"A1","text":"I think we've talked enough."},{"name":"EMETSELCH","text":"Why, their very beings were divided into fourteen, of course. Yet by our power, we unsundered Ascians may raise up one of their fragments to their original office."},{"name":"EMETSELCH","text":"Ah, but I suppose this in itself bears explaining. So...the names by which you know us are not, in fact, our names."},{"name":"EMETSELCH","text":"Be it Elidibus or Lahabrea or Igeyorhm, all are titles of office. And when an office is vacated, it may be filled by another."},{"name":"EMETSELCH","text":"Over the eons, I have overseen several changings of the guard among our sundered brethren."},{"name":"EMETSELCH","text":"And in such instances, the vacant title ordinarily goes to another fragment of the selfsame soul."},{"name":"EMETSELCH","text":"While it is by no means impossible to raise up wholly unrelated individuals, 'tis we whose fervent entreaties brought forth Lord Zodiark─whose souls He claimed in the beginning─who make the truest servants."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"So, if we were to defeat all the Ascians of the Source..."},{"name":"A2","text":"What is your <span class=\"emphasis\">true</span> name, then?"},{"name":"EMETSELCH","text":"Then none would remain to raise up new Ascians, and our kind would eventually fade from existence. You would like that, wouldn't you? Well, feel free to dream─'tis no crime to do so."},{"name":"EMETSELCH","text":"Hm! There may come a day when I reveal my true name to you─but this is not it. Of course, you may well die none the wiser, but life is full of such disappointments."},{"name":"EMETSELCH","text":"If that is all, then run along. You have a Lightwarden to slay."},{"name":"RYNE","text":"This aura... What could it be?"},{"name":"ALPHINAUD","text":"There you are, <span class=\"highlight\">Forename</span>. The others have gone ahead to reconnoiter Gatetown. We are to follow shortly."},{"name":"ALPHINAUD","text":"It has been a while, has it not? Since the two of us infiltrated Eulmore."},{"name":"ALPHINAUD","text":"...Since we faced Lord Vauthry, and I felt such fury as I have never felt before."},{"name":"ALPHINAUD","text":"His actions are unconscionable, of course, and any abhorrence I felt for him entirely justified. Yet mingled with my rage, there was...something else. At first I was unsure what it was, but in the course of our struggles, I found the answer."},{"name":"ALPHINAUD","text":"In Vauthry's self-righteousness─in his absolute belief that he, and he alone, is the cure to the world's ills─I saw a reflection of myself. And it brought the memories of all my past follies flooding back."},{"name":"ALPHINAUD","text":"He is the vainglorious, ignorant fool I once was. And having shared in his affliction, I feel duty-bound to open his eyes to the truth."},{"name":"ALPHINAUD","text":"Whether he will accept it with the good grace I did is another question..."},{"name":"ALPHINAUD","text":"What is it, Ryne? Do you sense the Lightwarden?"},{"name":"RYNE","text":"I-I'm not sure. The aura is...different."},{"name":"RYNE","text":"Perhaps if we were a little closer..."},{"name":"ALPHINAUD","text":"'Tis time we were on our way in any case. Let us join our comrades in Gatetown."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>, as a precaution, may I ask that you go first, to ensure that the path is clear?"},{"name":"ALPHINAUD","text":"The closer we are to Eulmore, the more I worry that Ryne may be recognized. If you see any prying eyes along the way, pray encourage their owners to look elsewhere."},{"name":"ALPHINAUD","text":"Go on, <span class=\"highlight\">Forename</span>. We will follow anon."},{"name":"RYNE","text":"As I am now, I don't think people will recognize me as the Oracle, but Thancred did always warn against taking unnecessary risks."},{"name":"SUSPICIOUSA03630","text":"Unnngh... Vauth...nnngh..."},{"name":"SYSTEM","text":"You hail the civilian, but he does not respond and continues his incoherent rambling."},{"name":"SUSPICIOUSA03630","text":"Unnngh... Vauth...nnngh..."},{"name":"SUSPICIOUSB03630","text":"Lord Vauthry... We hear...we obey... Aaahhh!"},{"name":"SUSPICIOUSC03630","text":"Long live...Lord Vauthry... Long live...Lord Vauthry..."},{"name":"SUSPICIOUSC03630","text":"Long live...live...live..."},{"name":"URIANGER","text":"Our mission hath begun on a strange note..."},{"name":"RESIDENT03630","text":"Wh-What's happening!? What's wrong with everyone!?"},{"name":"THANCRED","text":"Ah. Good of you to join us. I was debating whether to warn you, but it's too late now."},{"name":"THANCRED","text":"I take it you noticed the people behaving strangely along the path? It's more of the same here."},{"name":"THANCRED","text":"Y'shtola and Alisaie are investigating as we speak. Let's wait and see what they have to say."}],"reward":{"gil":1288,"items":[{"num":2,"id":27866,"one":1},{"num":2,"id":27867,"one":1},{"num":2,"id":27868,"one":1},{"num":2,"id":27869,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":77,"id":142}],"quests":[69158]},"next":[69167]},"partials":[{"type":"npc","id":"1027231","obj":{"i":1027231,"n":"Manager Of Suites","l":2951,"q":6}},{"type":"npc","id":"1030171","obj":{"i":1030171,"n":"Thancred","l":2954,"q":1}},{"type":"item","id":"27866","obj":{"i":27866,"n":"Sausage Links","l":409,"c":24365,"t":46,"p":3595}},{"type":"item","id":"27867","obj":{"i":27867,"n":"Roast Ovim","l":409,"c":24361,"t":46}},{"type":"item","id":"27868","obj":{"i":27868,"n":"Mushroom Skewer","l":409,"c":24201,"t":46,"p":3595}},{"type":"item","id":"27869","obj":{"i":27869,"n":"Baked Megapiranha","l":409,"c":24311,"t":46,"p":3595}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69158","obj":{"i":69158,"n":"More than a Hunch","g":8,"l":"Amh Araeng","s":810}},{"type":"quest","id":"69167","obj":{"i":69167,"n":"A Feast of Lies","g":8,"l":"Kholusia","s":830}}]}