{"quest":{"name":"A Feast of Lies","location":"Kholusia","id":69167,"patch":5.0,"sort":830,"icon":100920,"eventIcon":71201,"issuer":1030172,"target":1030184,"genre":8,"journal":["Urianger is trying to make sense of the strange phenomenon afflicting the residents of Gatetown.","By all indications, the residents of Gatetown are under Vauthry's mind control, and as Urianger attempts to fathom its workings, Alisaie arrives with your old friend Kai-Shirr in tow. Based on his account of events, it would seem that those who have lived in Gatetown the longest were the first to be affected. All the pieces fall into place when Y'shtola subsequently returns brandishing a loaf of meol. With dread and disbelief, Ryne immediately recognizes the Eulmoran staple for what it is: sin eater flesh, the consumption of which apparently renders one susceptible to Vauthry's influence. This sickening revelation leaves everyone aghast, but the horrors do not end there... Recalling the words you heard during your first visit to Eulmore, Alphinaud shares his suspicion that citizens who have outlived their usefulness are being deliberately turned into sin eaters. Suppressing the urge to gag, you endeavor to put such thoughts from your mind, and concentrate instead on the task at hand: hunting down the Lightwarden. The being is all but certain to be hiding in Eulmore's upper levels, and it is decided that you will lead the charge into the city.","Together with your comrades, you sally forth into Eulmore.","While the others keep Vauthry's thralls at bay, you press on to the Canopy, where you are confronted by a lone Ran'jit. Driven by a resolve all his own, the old soldier brings the sum of his might to bear against you, but you narrowly emerge the victor, striking him down once and for all. Rejoined by your comrades, you then ascend to the Emergent and find Vauthry having dinner in his chamber. There, Ryne finally realizes that <span class=\"emphasis\">he</span> is the Lightwarden, being an unholy mixture of man and sin eater. Before you are able to act, however, Vauthry sprouts wings and takes to the skies. Rushing to the balcony, you are met with an impossible sight: the peak of Mt. Gulg, torn from the earth and floating in the heavens. It is there that Vauthry appears to have fled. With your quarry out of reach, you decide to suspend the hunt, that you might instead render aid to the casualties of the battle.","To your relief, Thancred informs you that Ryne is able to counteract the effects of Vauthry's mind control, and is busy tending to the afflicted one by one. There are, however, countless wounded requiring attention, and you are asked to assist in the relief effort."],"objectives":["Speak with Alphinaud.","Speak with Thancred.","Subdue the civilians!","Subdue the soldiers!","Defeat the jesters!","Climb to the next level!","Defeat Ran'jit!"],"dialogue":[{"name":"THANCRED","text":"The gears are clearly turning in Urianger's mind. Why don't you ask him what he makes of all this?"},{"name":"RESIDENT03630","text":"Wh-What's happening!? What's wrong with everyone!?"},{"name":"ALISAIE","text":"I'm fine, <span class=\"highlight\">Forename</span>. Shaking with fury, but fine. Let's go."},{"name":"THANCRED","text":"We are like to encounter Ran'jit again. One can only hope he's still licking his wounds."},{"name":"THANCRED","text":"Yet even without him, Eulmore is an eminently defensible city─as you doubtless gleaned during your visit."},{"name":"THANCRED","text":"When last I set foot inside its walls, I almost mistook it for dear old Limsa─but it is <span class=\"emphasis\">full</span> of unpleasant surprises. All of which is a long way of saying: be on your guard."},{"name":"RYNE","text":"The uppermost level of the city houses Vauthry's chambers. He must keep the Warden close."},{"name":"URIANGER","text":"My heart is gripped by an unshakable sense of foreboding. Let us proceed with all care."},{"name":"YSHTOLA","text":"That Vauthry should so brazenly exert his influence over the people bespeaks his desperation. He will not go quietly."},{"name":"KAISHIRR","text":"Meol...is sin eater? Wicked white, we all scoffed the stuff without a second thought..."},{"name":"KAISHIRR","text":"I never got near as much as the others, but...ugh..."},{"name":"KAISHIRR","text":"Heh... The bitter greens and bony fish I got by on don't seem so bad no more..."},{"name":"ALPHINAUD","text":"When we step through the gates, we shall find not the place of hedonistic pleasure we remember, but a battlefield."},{"name":"ALPHINAUD","text":"If you are prepared for this, then let us sally forth!"},{"name":"ALPHINAUD","text":"Are you all right, <span class=\"highlight\">Forename</span>!?"},{"name":"THANCRED","text":"The citizens appear to have calmed down for the moment. I can only assume Vauthry is otherwise engaged. Let's get to the upper level while we can."},{"name":"ALPHINAUD","text":"My thanks again, <span class=\"highlight\">Forename</span>. We will seek out the wounded and render what aid we can."},{"name":"ALISAIE","text":"Some managed to shake off the mind control only to be caught in the chaos. We'll make sure they receive treatment as well."},{"name":"RYNE","text":"It's all right. You're safe now."},{"name":"PATIENT03631","text":"&lt;groan&gt; What...what happened?"},{"name":"URIANGER","text":"Bereft of leadership, the soldiers have lost the will to fight. They pose no threat to us."},{"name":"YSHTOLA","text":"So this was how the citizens lived─the Eulmoran dream. They are in for quite a rude awakening."},{"name":"THANCRED","text":"Good news, <span class=\"highlight\">Forename</span>. It would seem that Ryne is indeed able to reverse the effects of Vauthry's influence."},{"name":"THANCRED","text":"Even as we speak, she tends to the afflicted in turn. The problem being: there's no end to them."},{"name":"THANCRED","text":"We're trying to provide what relief we can to those who are waiting, and would appreciate your help, if you're willing."},{"name":"SYSTEM","text":"You can now attune with the aetheryte in Eulmore!"},{"name":"QIB","text":"Climb to the next level!"},{"name":"QIB","text":"Defeat Ran'jit!"},{"name":"ALPHINAUD","text":"Do no more than is necessary to subdue the civilians!"},{"name":"ALPHINAUD","text":"Forgive me... I was unprepared..."},{"name":"THANCRED","text":"We're wasting time. Ryne─we hold them here while the others press on!"},{"name":"THANCRED","text":"Not here, damn it..."},{"name":"RYNE","text":"A-All right!"},{"name":"ALPHINAUD","text":"Have care, you two! The rest of you, with me!"},{"name":"RYNE","text":"I...I wasn't strong enough..."},{"name":"ALPHINAUD","text":"Their minds are not their own, remember! Avoid harming them wherever possible!"},{"name":"YSHTOLA","text":"There is no end to them... Urianger─would you care to make a stand?"},{"name":"YSHTOLA","text":"Ungh... Not like this..."},{"name":"URIANGER","text":"Gladly. <span class=\"highlight\">Forename</span>─pray press on with the others when the opportunity doth arise."},{"name":"ALISAIE","text":"The way's clear! Come on, you two!"},{"name":"URIANGER","text":"A costly misstep..."},{"name":"ALPHINAUD","text":"Confound it! More of them! And we were almost through!"},{"name":"ALISAIE","text":"No... We were so close..."},{"name":"ALISAIE","text":"Right, my turn to make a heroic stand! As soon as there's a lull, push on!"},{"name":"ALPHINAUD","text":"Now, <span class=\"highlight\">Forename</span>─into the tower! Just you take care, Alisaie!"},{"name":"ALPHINAUD","text":"The jesters from before!"},{"name":"CLOWNOFRED","text":"Apologies, friends...but you've reached a dead end. And on <span class=\"emphasis\">this</span> sorry track, there's no turning back."},{"name":"CLOWNOFBLUE","text":"We've a good life here, see, and we're not about to lose it. But fair's fair─we'll give you a good death."},{"name":"ALPHINAUD","text":"If you would fight us of your own volition, then we will not hold back!"},{"name":"CLOWNOFRED","text":"This one's a real sidesplitter!"},{"name":"CLOWNOFBLUE","text":"But at least you'll die laughing!"},{"name":"ALPHINAUD","text":"Let us climb to the Canopy. From there we will take the Crown Lift."},{"name":"ALPHINAUD","text":"Still more soldiers... Leave them to me and press on!"},{"name":"RANJIT","text":"Ever since I submitted to my master's authority, I have been naught but a weapon."},{"name":"RANJIT","text":"I exist only to destroy. And destroy you I will."},{"name":"RANJIT","text":"It is time we settled this, villain."},{"name":"RANJIT","text":"If you would pass me, you must endure all that I have learned on the battlefield... For I am a weapon forged in the fires of war!"},{"name":"RANJIT","text":"Ah...there you are...my precious girls..."}],"reward":{"gil":2474},"reqs":{"jobs":[{"lvl":77,"id":142}],"quests":[69166]},"next":[69168]},"partials":[{"type":"npc","id":"1030172","obj":{"i":1030172,"n":"Urianger","l":2954,"q":1}},{"type":"npc","id":"1030184","obj":{"i":1030184,"n":"Thancred","l":2952,"q":2}},{"type":"quest","id":"69166","obj":{"i":69166,"n":"Return to Eulmore","g":8,"l":"The Crystarium","s":820}},{"type":"quest","id":"69168","obj":{"i":69168,"n":"Paradise Fallen","g":8,"l":"Eulmore","s":840}}]}