{"quest":{"name":"The Ladder","location":"Eulmore","id":69169,"patch":5.0,"sort":850,"eventIcon":71201,"issuer":1030196,"target":1030197,"genre":8,"journal":["Alphinaud's eyes glisten with joy."],"objectives":["Speak with Urianger in Bottom Rung.","Speak with Irvithe.","Take stock of lumber.","Speak with Irvithe.","Speak with Urianger."],"dialogue":[{"name":"ALPHINAUD","text":"The Ladder is situated to the north and west of Wright. Let us make our way there, <span class=\"highlight\">Forename</span>."},{"name":"ALPHINAUD","text":"The Ladder is a sturdy piece of engineering, but much may go wrong after twenty years of disuse. Let us be doubly thorough with its maintenance."},{"name":"YSHTOLA","text":"Bottom Rung, they call this place. How very apt."},{"name":"YSHTOLA","text":"Apparently, it used to be the control center for the Ladder and a bustling hub of transport. Its glory days are far behind it."},{"name":"CHAINUZZ","text":"First things first─a fifty-point inspection. Wouldn't do to have them falling to pieces, now!"},{"name":"CHAINUZZ","text":"...Wh-Why are you standing there gawping? There's lots to be done, so go and make yourself useful!"},{"name":"DULIACHAI","text":"To see my darling Chai so engrossed in his work... I think I'm falling in love again. &lt;sigh&gt;"},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span>, dost thou see yonder pair of Talos?"},{"name":"URIANGER","text":"For a blessing, they were found to be in good repair. Master Chai prepareth to activate them as we speak."},{"name":"URIANGER","text":"With our arcane knowledge, Y'shtola and I will serve as his assistants. At the appointed hour, we shall imbue the golems with aether."},{"name":"URIANGER","text":"Others, meanwhile, attend to the Ladder itself, which hath too long lain neglected. Extensive maintenance will be needed ere it can move again, as well as myriad materials with which to perform it."},{"name":"URIANGER","text":"If thou art willing, we would prevail upon thee to procure lumber."},{"name":"URIANGER","text":"My thanks, <span class=\"highlight\">Forename</span>. Directly to the south thou wilt find a dry dock─Venmont Yards. Pray see if thou canst persuade the folk there to part with some lumber for our cause."},{"name":"URIANGER","text":"Venmont Yards lie directly to the south. Pray see if thou canst persuade the folk there to part with some lumber for our cause."},{"name":"IRVITHE","text":"Ho there, sinner. Haven't seen you around before. New to Gatetown, I take it. If you need lumber for a shack, you've come to the right place. We can do the building for you too, though that'll cost extra."},{"name":"IRVITHE","text":"...You want lumber to restore the Ladder? Why in the world would anyone want to do that!?"},{"name":"IRVITHE","text":"If you don't have the coin, least you could do is come up with a believable excuse!"},{"name":"IRVITHE","text":"But look, I'm not one to turn folk away. I'll give you your lumber if you do me a favor in return."},{"name":"IRVITHE","text":"I'd just finished taking stock of our supply and was about to do another round for good measure. I want you to do the counting instead, and we'll see if your total matches mine."},{"name":"IRVITHE","text":"Now, some of the lumber's lying about the yard, but most of it is kept in the storehouse. For these, you can just ask Grithil for the number. Here, I'll lend you some writing material so you can take notes."},{"name":"SYSTEM","text":"Take stock of the supply of lumber at the shipyard. What you learn can be reviewed in your key items."},{"name":"IRVITHE","text":"When you're done counting the lumber, come back here and we'll see if your total matches mine."},{"name":"IRVITHE","text":"Remember, for the stuff that's stowed in the storehouse, you can just ask Grithil for the number."},{"name":"SYSTEM","text":"You count eleven planks in the stack."},{"name":"SYSTEM","text":"You count twenty-four planks in the stack."},{"name":"GRITHIL","text":"Eh? Taking stock for Irvithe, are you?"},{"name":"GRITHIL","text":"Well, last I counted, we had sixty-eight planks in the storehouse here."},{"name":"GRITHIL","text":"Nine of those were rotted through, though, so we tossed them out."},{"name":"CARPENTER03633","text":"Oi, Grithil, another load's just arrived."},{"name":"CARPENTER03633","text":"Thirteen planks all told, but one's damaged. It's only good for kindling now."},{"name":"GRITHIL","text":"Right, then. Bring the good ones here, and be sure to let Irvithe know as well."},{"name":"GRITHIL","text":"So, er...how many planks does that make now?"},{"name":"GRITHIL","text":"Eh, you're writing down those numbers anyway, right? I'm sure you can work it out."},{"name":"SYSTEM","text":"You jot down the details of the conversation."},{"name":"GRITHIL","text":"You're writing those numbers down, right? I'm sure you can work it out."},{"name":"SYSTEM","text":"What you learned can be reviewed in your key items."},{"name":"IRVITHE","text":"Done, are you? So, how many planks did you count?"},{"name":"Q1","text":"How many planks are there?"},{"name":"A1","text":"11."},{"name":"A1","text":"24."},{"name":"A1","text":"35."},{"name":"A1","text":"71."},{"name":"A1","text":"103."},{"name":"A1","text":"106."},{"name":"A1","text":"126."},{"name":"A1","text":"150."},{"name":"A1","text":"I need to check again."},{"name":"IRVITHE","text":"Eh? That sounds awful low. Reckon you should look at your notes again."},{"name":"IRVITHE","text":"Hmmm, seems to me you forgot the stacks lying outside. Why don't you take another look at your notes?"},{"name":"IRVITHE","text":"Ooh, close. Seems you haven't accounted for the planks that were delivered or thrown out. Might want to check your notes again."},{"name":"IRVITHE","text":"Aye, that's exactly what I counted!"},{"name":"IRVITHE","text":"Thanks for your help, friend. Taking stock fair puts me to sleep, but it has to be done. As promised, I'll give you your lumber. What do you need it for, anyway?"},{"name":"IRVITHE","text":"You were serious about the Ladder!? I'll be damned..."},{"name":"IRVITHE","text":"If that's the case, please let us help with the work!"},{"name":"IRVITHE","text":"We're shipwrights with no ships to build, only shacks. While it's a living, we all itch to do something <span class=\"emphasis\">greater</span>."},{"name":"IRVITHE","text":"This fellow you say is in charge─you reckon he'd mind the likes of us barging in on his project?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"He won't mind."},{"name":"A2","text":"He'd welcome the help."},{"name":"IRVITHE","text":"Wonderful! I'll round up the lads and lasses and we'll head over to the Ladder─along with all the lumber you need!"},{"name":"IRVITHE","text":"Hmmm, that's on the high side by my reckoning. You sure you subtracted all the planks that weren't good?"},{"name":"IRVITHE","text":"Whoa, I don't think we have that many. Reckon you should take another look at your notes."},{"name":"IRVITHE","text":"We'll be along soon, and we'll bring all the lumber you need!"},{"name":"GRITHIL","text":"Heh, some real work at last! It's been too long!"},{"name":"ALPHINAUD","text":"The work proceeds apace, I'm pleased to say. When it is restored, the Ladder will not only be our way forward; it will represent a momentous step towards lasting change for Kholusia."},{"name":"ALISAIE","text":"I've rounded up as much material as I could for the work. Just my little bit for the cause."},{"name":"THANCRED","text":"The Eulmorans have rallied quite impressively. Amidst great adversity, a little purpose never goes astray."},{"name":"RYNE","text":"Oh, <span class=\"highlight\">Forename</span>. I heard you went to find lumber."},{"name":"RYNE","text":"From afar, the Ladder looked like it was made entirely of metal, but there's actually a lot of wood if you look for it."},{"name":"YSHTOLA","text":"By the intensity with which he works, 'tis as if all of that reluctance was a lie."},{"name":"CHAINUZZ","text":"Hmph, such a primitive, inefficient design! A much smaller Talos from our company could just as easily perform the same task!"},{"name":"DULIACHAI","text":"Oh, he'll have them moving again soon! I know he will!"},{"name":"URIANGER","text":"Ah, thou art returned. Wert thou able to procure the lumber?"},{"name":"URIANGER","text":"Well, well, to secure not only the material, but the eager cooperation of the shipwrights besides. Their expertise shall greatly avail our efforts."},{"name":"URIANGER","text":"Master Chai's own efforts have not been without struggle, but he hath proven himself to be a determined soul. I doubt not but that the work shall be complete ere long, and we may continue on our way once more."},{"name":"URIANGER","text":"Though it hath been years in the making, at long last do the people stand united in defiance of the world's fate, their hopes spurring us ever onward towards journey's end."},{"name":"URIANGER","text":"Whatsoever may await us, when thou takest those final steps, I pray that it shall be with a smile upon thy face."}],"reward":{"gil":1085},"reqs":{"jobs":[{"lvl":78,"id":142}],"quests":[69168]},"next":[69170]},"partials":[{"type":"npc","id":"1030196","obj":{"i":1030196,"n":"Alphinaud","l":2952,"q":1}},{"type":"npc","id":"1030197","obj":{"i":1030197,"n":"Urianger","l":2954,"q":2}},{"type":"quest","id":"69168","obj":{"i":69168,"n":"Paradise Fallen","g":8,"l":"Eulmore","s":840}},{"type":"quest","id":"69170","obj":{"i":69170,"n":"The View from Above","g":8,"l":"Kholusia","s":860}}]}