{"quest":{"name":"A Voice from the Void","location":"Amh Araeng","id":69160,"patch":5.0,"sort":11,"icon":100870,"unlocksFunction":1,"eventIcon":71341,"issuer":1030625,"target":1030625,"genre":182,"journal":["Cerigg has made a breakthrough of sorts.","Cerigg appears pleased to inform you that Phronesis has been sighted in the area, allowing the investigation to begin in earnest. He explains his plan, which involves employing a manikin to trail the sin eater and observing from afar, that he might gauge just how wide of a berth must be kept from the hollows to avoid being sucked into the void. But first, the dilapidated manikin must be restored to a functional capacity. You agree to fetch the tendon of a sandskin sibilus from the Fields of Amber while Cerigg procures other essential parts.","You make short work of the sibilus and slice off a tendon that should serve you well in repairing the manikin. You set off to deliver it to Cerigg, who will undoubtedly be pleased with your success.","Using the tendon you acquired and other assorted parts procured from his merchant acquaintances, Cerigg succeeds in getting the manikin back on its feet. Fully prepared to begin the investigation, you set off for the Fields of Amber, where the fearsome Phronesis was last sighted.","Sighting your sin eater quarry, Cerigg sends the manikin to trail it, where it is promptly swallowed up into oblivion. The unfortunate automaton's sacrifice having gleaned you useful knowledge, you draw within a safe distance of the hollow to investigate further. Things take a turn for the unexpected when you hear a voice coming from beyond the hollow. At Cerigg's suggestion, you channel your aether into the gaping void to serve as a beacon, and are astonished to see a boy emerge from the other side. Unsure what to make of the situation, you decide to return to Mord Souq with Cerigg to tend to the frightened, ailing child.","Though somewhat lacking in experience with small children, Cerigg nevertheless vows to take care of the boy until a more suitable guardian may be found. There are numerous questions he would ask, but for now intends to see that the child is healthy and nourished. You resolve to continue to hone your skills and hope that the child soon wakes, and is able to provide you with the answers you seek.<br><br>※The next role quest will be available from Cerigg upon reaching level 74 in any magical ranged DPS class."],"objectives":["Track down a sandskin sibilus in the Fields of Amber and procure its tendon.","Deliver the sibilus tendon to Cerigg.","Find a lookout point and wait there for Cerigg.","Speak with Cerigg."],"dialogue":[{"name":"CERIGG","text":"Ah, there you are─and your timing couldn't be better. As luck would have it, a little bird told me that Phronesis was sighted in the vicinity not long ago."},{"name":"CERIGG","text":"Don't you worry. I have no intention of rushing in like a fool. My plan is to shadow the sin eater from afar, that we might observe the hollows with our own eyes and formulate a suitable plan of attack."},{"name":"CERIGG","text":"To that end, I procured this manikin here from a merchant acquaintance of mine at the Crystarium. By setting it on Phronesis's trail, I mean to gauge just how wide of a berth we must keep from the fiend so as not to be sucked up into the void."},{"name":"CERIGG","text":"Shed no tears for the little fellow, friend. His sacrifice will be the key to our success. And yet, as you can see, he's not quite in the best state of repair. Pray lend me a hand in procuring what we need to get him back on his feet."},{"name":"CERIGG","text":"You're a lifesaver, friend! I just spotted nasty-looking sandskin sibili lurking about to the east of here, and I do believe one of their tendons should serve well to put some spring back in the little fellow's step. Snag one for me, and I'll see to the repairs."},{"name":"CERIGG","text":"A tendon from one of those sibili prowling about just east of here should be just what our little friend here needs."},{"name":"CERIGG","text":"Any luck finding that tendon? For my part, I've acquired something that should serve as a makeshift gear. Cost me an arm and a leg, but hey─if it helps us claim that bounty in the end, it'll be more than worth it."},{"name":"CERIGG","text":"Perfect! Yes, I reckon this is durable and elastic enough to replace the manikin's snapped drive belt. I'll fetch my toolbox and get started straightaway."},{"name":"CERIGG","text":"In the meantime, why don't you scout us out a suitable lookout point? Phronesis was last sighted just southeast of town. Try to find us a spot on higher ground, out of sight from the main thoroughfare."},{"name":"CERIGG","text":"I'm still working on it, but mark my words: our manikin will be up and walking in no time. See if you can't go find us a good vantage point from which to observe our quarry."},{"name":"CERIGG","text":"Ho there, friend! As you can see, our clockwork friend is back in tip-top shape. And since it appears you've found us the perfect lookout spot, why don't we get down to work? I'll kindle us a fire─we might be here for a while."},{"name":"CERIGG","text":"Well, I'll be! There's the bastard!"},{"name":"CERIGG","text":"Look closely now, and hold your gaze. You must witness the sheer horror with your own two eyes."},{"name":"CERIGG","text":"No, we mustn't send out the manikin too soon. If Phronesis sees it, he may very well blast it to bits before it has a chance to investigate the hollows."},{"name":"CERIGG","text":"...And there he goes. I'll send the manikin in to trail him. Let's sit back and enjoy the show."},{"name":"CERIGG","text":"Just as I expected...gone without a trace. Shed no tears for our little friend. Through his sacrifice, we now know just how much distance we must keep from the hollows to avoid being sucked into the void."},{"name":"CERIGG","text":"Now it's our turn. Let's edge a bit closer and see what we can observe. Mind you, take care not to wander <span class=\"emphasis\">too</span> close─lest you fancy a vacation to a dark, shadowy abyss."},{"name":"CERIGG","text":"It's as if a shadowy whirlwind rages inside, ready to suck anything and everything into the void. I've seen many a horrific sight in my day, but this sends a shiver up the spine."},{"name":"TAYNOR","text":"(-Boy's Voice-)Let me out... It's so...dark in here..."},{"name":"CERIGG","text":"Hm? Why the pale face, friend? You look as if you've seen a ghost."},{"name":"CERIGG","text":"A voice, you say? From inside the hollow? But that's impossible!"},{"name":"TAYNOR","text":"(-Boy's Voice-)Is anyone...out there? Please, help me...help me get out of here!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Over here!"},{"name":"A2","text":"Are you...alive?"},{"name":"TAYNOR","text":"(-Boy's Voice-)Was that a voice? Is someone out there!? If you can hear me, please...you must help me!"},{"name":"TAYNOR","text":"(-Boy's Voice-)I can't see anything... No road, no trees... Not even an aether current to follow... Which way do I go? How do I get out of this place!?"},{"name":"CERIGG","text":"This voice...what in the gods' name is it saying!?"},{"name":"CERIGG","text":"The voice of a boy, you say? Claims he's lost inside, with no aether current to follow? Sounds like he's adrift in the flow, not unlike what would happen if an aetheryte to which one was teleporting was destroyed in mid-journey."},{"name":"CERIGG","text":"...Wait a minute. What if there were some way you could channel your aether into the void? Might that not allow your aetheric form to serve as a beacon of sorts to guide the child back to us? 'Course, not that I know how we'd go about that..."},{"name":"CERIGG","text":"Hm? You reckon you could do just that? I won't even think of asking how. Do your damndest!"},{"name":"CERIGG","text":"Wicked white! I knew you were no ordinary sinner, but even still you find ways to surprise me."},{"name":"TAYNOR","text":"(-Emaciated Child-)Where...where am I?"},{"name":"CERIGG","text":"Well, I'll be damned... There <span class=\"emphasis\">was</span> a child inside!"},{"name":"CERIGG","text":"Our little expedition has left us with more questions than answers, eh? But for now, this boy needs our care. Let us carry him back to Mord Souq and find him a warm bed and some nourishment."},{"name":"CERIGG","text":"The boy's resting now. He is weak, but not wounded...'least as far as I can tell."},{"name":"CERIGG","text":"Needless to say, his presence raises questions. Are there others trapped on the other side of the hollows? If so, might they also be returned to our world alive?"},{"name":"CERIGG","text":"There is much we must ask him when he awakes. On another subject, ah...this might be an odd question, but have you ever looked after a child before?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What do you think?"},{"name":"A2","text":"As a matter of fact..."},{"name":"CERIGG","text":"Heh...that makes two of us. Bounty hunters like me don't get much opportunity for babysitting. Still, until we can track down the boy's parents, I suppose I have little choice but to look after him myself."},{"name":"CERIGG","text":"You don't say? In that case, he's all yours! Heh...I'm jestin', friend. I can't very well tie you down here forever. Worry not, I'll manage somehow."},{"name":"CERIGG","text":"I suppose the first order of the day should be to get some food in his belly. He does look terribly pale, after all. Methinks I'll go hunting for some meat..."},{"name":"CERIGG","text":"No...perhaps I should take him to a physician first? After all, he may be suffering from some ailment inscrutable to the eye. Or maybe I should─ Damn it all! I knew I wasn't cut out for this..."}],"reward":{"gil":1077},"reqs":{"jobs":[{"lvl":72,"id":159}],"quests":[69159]},"next":[69161]},"partials":[{"type":"npc","id":"1030625","obj":{"i":1030625,"n":"Cerigg","l":2955,"q":6}},{"type":"quest","id":"69159","obj":{"i":69159,"n":"Hollow Pursuits","g":182,"l":"The Crystarium","s":1,"f":1}},{"type":"quest","id":"69161","obj":{"i":69161,"n":"Echoes of the Past","g":182,"l":"Amh Araeng","s":21,"f":1}}]}