{"quest":{"name":"Extinguishing the Last Light","location":"Kholusia","id":69179,"patch":5.0,"sort":950,"icon":100924,"eventIcon":71201,"issuer":1030295,"target":1030303,"genre":8,"journal":["Judging by the portentous look in his eye, Chai-Nuzz has something important to tell you.","Chai-Nuzz informs you everything is in place, and that the Talos is ready to be awakened. Only the imbuing remains to be done, after which the enormous golem will rise to take Mt. Gulg in its grasp─assuming all goes according to plan. Once the process is set in motion, there will be no turning back, so the Exarch bids you see to your battle preparations, that he might then give the order to begin.","As all present hold their collective breaths, the Talos wakes to life and proceeds to reach out for the volcano. Excitement quickly gives way to dismay, however, as the sin eaters guarding Vauthry's domain converge upon the golem's vulnerable hands, threatening to end your mission before it has begun. For a blessing, help then arrives in the unexpected form of the fae folk, who engage the sin eaters from the air and allow the Talos to safely complete its task. With the route to Vauthry thus secured, you make haste to join your fellow Scions at the foot of Mt. Gulg.","Your comrades all know their purpose, and there is no further need for words. In silence, you set forth for the grueling climb that will see you traverse the Talos's stony body on your way to Vauthry's newly built paradise.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","Fighting your way through hordes of sin eaters, you arrive at the upper reaches of Mt. Gulg. The end is in sight.<br><br>※In the event that you leave the instance, you may proceed to the Crown of the Immaculate by speaking with the sentry at the foot of Mt. Gulg.","As you approach Vauthry's private sanctuary, he unleashes a horde of sin eaters upon you. While your comrades keep the creatures at bay, you must press on to fulfill your mission's objective: striking down the final Lightwarden.<br><br>※The Crown of the Immaculate can be accessed via the Duty Finder.","At the end of a furious encounter, you succeed in laying low Vauthry's ultimate incarnation, Innocence. Their own foes having fled, your comrades join you just in time to witness your broken adversary's final moments.<br><br>※In the event that you leave the instance, you may proceed to the Crown of the Immaculate by speaking with the sentry at the foot of Mt. Gulg.","Succumbing to his wounds at last, Vauthry's body dissolves into innumerable motes of light, which you stoically take unto yourself. At that instant, the blazing shroud covering the firmament falls away to reveal a peaceful night sky. You do not have a chance to relish the sight, however, as you find yourself pulled into a vision of Vauthry's past, when he was but a babe in the womb. He too, you discover, was a pawn of the Ascians, born as man and sin eater both to bring about the First's Rejoining.<br><br>Even as the vision fades, your entire being is racked by pain. What all had feared is coming to pass─you are unable to contain the combined power of all the Wardens. In that moment, the Crystal Exarch arrives, his true plan finally revealed. From the beginning, it was his intent to take your unbearable burden upon himself, and teleport into the rift in a final act of sacrifice. But before he can complete his ritual, a shot rings out and he crumples to the floor. Holding the smoking gun is none other than Emet-Selch, come to prevent his painstakingly amassed Light from being spirited away. Declaring you unworthy to be his ally, the Ascian leaves with the wounded Exarch, though not before inviting you to seek him out at his abode, in the dark depths of the Tempest.<br><br>Some time later, you awaken in your chambers with Ardbert watching over you. Your spectral companion duly explains the events that took place after you lost consciousness. You learn it is only thanks to Ryne's powers that you have not yet turned into a sin eater, but that it is only a matter of time. Bile rising in your throat, you throw open the window...and look out upon a land shrouded in Light once more─all of your efforts having come to naught. Seeing your despair, Ardbert urges you to get some fresh air outside the confines of your room.<br><br>※The next main scenario quest will be available from the manager of suites in the Pendants."],"objectives":["Speak with the Crystal Exarch.","Speak with Y'shtola.","Enter Mt. Gulg.","Confront Innocence in the Crown of the Immaculate.","Speak with Ryne."],"dialogue":[{"name":"DULIACHAI","text":"The Exarch is back, thank heavens, and it seems the sea breeze did him a world of good! I do hope you managed to get a spot of rest as well!"},{"name":"MYSTERYVOICE","text":"Worry not, my friend. I am quite well. Let us ask Master Chai where things stand with the Talos."},{"name":"CHAINUZZ","text":"Right, so, while the two of you were away, I received word that everything is in place, meaning we can proceed with awakening the Talos."},{"name":"CHAINUZZ","text":"Once we imbue the magic, it will stir itself and immediately carry out its designated function: namely, taking Mt. Gulg in its grasp."},{"name":"MYSTERYVOICE","text":"<span class=\"highlight\">Forename</span>, we may be certain that Vauthry will not look on in idleness as we beat a path to his front door. Once our plans are set in motion, there will be no turning back."},{"name":"MYSTERYVOICE","text":"So see to your preparations as meticulously as you may, and I will give the order to proceed as soon as you are ready."},{"name":"CHAINUZZ","text":"I did everything I could. It will work. It will! I hope it will."},{"name":"DULIACHAI","text":"Everything will be fine, I assure you! No Talos my husband has poured himself into has ever failed, and that is not about to change now!"},{"name":"MYSTERYVOICE","text":"Give the word, and I will relay the order to awaken the Talos."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"ENGAGE!"},{"name":"A1","text":"Sorry, but I need more time."},{"name":"MYSTERYVOICE","text":"Very well! Let us begin!"},{"name":"MYSTERYVOICE","text":"It's quite all right. Better to take what time you require than set out unprepared."},{"name":"MYSTERYVOICE","text":"I will see that everyone else is a safe distance away. Go and join your comrades, my friend, and focus only on reaching Vauthry."},{"name":"MYSTERYVOICE","text":"Come what may, we must prevail this day!"},{"name":"CHAINUZZ","text":"Hahaha! Is there anything you can't do!? A genius is what you are, old boy! A genius among─"},{"name":"CHAINUZZ","text":"...Ahem. I've played my part. The rest is up to you lot now. Carry on!"},{"name":"DULIACHAI","text":"Take care, do you hear? Make sure you all come back safe and sound, or I shall be most upset!"},{"name":"ALPHINAUD","text":"There you are, <span class=\"highlight\">Forename</span>!"},{"name":"ALISAIE","text":"It's time!"},{"name":"THANCRED","text":"Shall we?"},{"name":"RYNE","text":"Vauthry cannot hide from us now!"},{"name":"URIANGER","text":"'Twill not be long before the sin eaters mark our presence. We must expect fierce resistance."},{"name":"YSHTOLA","text":"Everyone is here. Good."},{"name":"YSHTOLA","text":"The Talos has taken hold of the mountain. As planned, we will use its body as a bridge to reach Vauthry's sanctuary."},{"name":"ALISAIE","text":"The sin eaters will make us work for every yalm, of course."},{"name":"ALPHINAUD","text":"But we will carve a path through their ranks, and meet with their master, regardless."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"For the First!"},{"name":"A2","text":"Last one there's a rotten egg!"},{"name":"A2","text":"Let's be careful, all right?"},{"name":"Q3","text":"What will you do?"},{"name":"A3","text":"Small talk."},{"name":"A3","text":"Form a party and enter Mt. Gulg."},{"name":"A3","text":"Nothing."},{"name":"ALPHINAUD","text":"Above us lies Vauthry's new paradise."},{"name":"ALPHINAUD","text":"A paradise swarming with sin eaters, in which his own people have no place..."},{"name":"ALPHINAUD","text":"It ends here. And it ends now."},{"name":"ALISAIE","text":"When our hunt for the Lightwardens began, I couldn't imagine ever being done with the task."},{"name":"ALISAIE","text":"Yet here we are, ready to lay the last one low. We'll get you there, <span class=\"highlight\">Forename</span>. Mark my words!"},{"name":"THANCRED","text":"How many eaters await us up there, do you suppose? A hundred? A thousand?"},{"name":"THANCRED","text":"Not that it matters, of course. Whatever the odds, we will overcome them. Minfilia wanted this world saved, and save it we shall."},{"name":"RYNE","text":"Until Thancred freed me, I knew nothing of Norvrandt."},{"name":"RYNE","text":"But in the course of our journey, I've come to love this land and those who call it home. And I will give my all to protect them."},{"name":"URIANGER","text":"That which now graspeth the mountain is no mere man of stone."},{"name":"URIANGER","text":"'Tis the hopes of all who have dwelled in this world, both in the past and in the present. 'Tis the prayers of all who yearn for peace, be they near or be they far."},{"name":"YSHTOLA","text":"'Tis a trivial concern, but I cannot help feeling self-conscious knowing that some of the Night's Blessed are watching."},{"name":"YSHTOLA","text":"In the guise of Master Matoya, I took great pains to cultivate an image of restraint. Yet I don't suppose they will be able to make out all that much from such a distance...meaning I may wreak havoc to my heart's content. I do believe I'm going to enjoy this."},{"name":"GUIDESOLDIER03643","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>! Will you be heading to the Crown of the Immaculate?"},{"name":"Q4","text":"Proceed to the Crown of the Immaculate?"},{"name":"ALPHINAUD","text":"With your powers, you could have done so much good..."},{"name":"ALISAIE","text":"Well, it looks like we missed it all yet again."},{"name":"THANCRED","text":"We've secured an escape route. Do what you must."},{"name":"URIANGER","text":"There lieth the last of the Light..."},{"name":"YSHTOLA","text":"A dramatic transformation. The result of the sin eater within emerging to claim dominance, I assume."},{"name":"GUIDESOLDIER03643","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>! Will you be heading to the Crown of the Immaculate?"},{"name":"RYNE","text":"Is that...Vauthry?"},{"name":"RYNE","text":"I see... It's finally over, then."},{"name":"RYNE","text":"Now night will return to all of Norvrandt, bringing salvation to both of our two worlds..."},{"name":"SYSTEM","text":"Upon speaking with Ryne, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"SYSTEM","text":"Should you leave the area, you may return here by speaking with the sentry posted at the entrance to Mt. Gulg."}],"reward":{"gil":7632,"aetherCurrent":1,"instance":20064},"reqs":{"jobs":[{"lvl":79,"id":142}],"quests":[69178]},"next":[69180]},"partials":[{"type":"npc","id":"1030295","obj":{"i":1030295,"n":"Chai-Nuzz","l":2954,"q":1}},{"type":"npc","id":"1030303","obj":{"i":1030303,"n":"Ryne","l":3219,"q":1}},{"type":"instance","id":"70","obj":{"i":70,"n":"Mt. Gulg","c":61801,"t":"Dungeons","min_lvl":79,"max_lvl":80,"min_ilvl":390,"max_ilvl":420}},{"type":"instance","id":"20064","obj":{"i":20064,"n":"The Crown of the Immaculate","c":61804,"t":"Trials","min_lvl":79,"max_lvl":80,"max_ilvl":420}},{"type":"quest","id":"69178","obj":{"i":69178,"n":"A Breath of Respite","g":8,"l":"Kholusia","s":940}},{"type":"quest","id":"69180","obj":{"i":69180,"n":"Reassuring the Masses","g":8,"l":"The Crystarium","s":960}}]}