{"quest":{"name":"That None Shall Ever Again","location":"Kholusia","id":69177,"patch":5.0,"sort":930,"eventIcon":71201,"issuer":1030238,"target":1030253,"genre":8,"journal":["Alphinaud is bound for Amity."],"objectives":["Speak with Y'shtola.","Imbue the heartstone with magick.","Speak with Chai-Nuzz."],"dialogue":[{"name":"ALPHINAUD","text":"Well, my friend, it appears we are the only ones left here."},{"name":"ALPHINAUD","text":"If you've no other pressing tasks, would you care to accompany me to Amity? There, Y'shtola is overseeing those who will imbue the Talos with magicks."},{"name":"ALPHINAUD","text":"Come, let us join them at once."},{"name":"ALPHINAUD","text":"All proceeds smoothly here, and everyone is being moved into position. The moment of truth is nigh."},{"name":"URIANGER","text":"Pleased am I to say that I was able to call upon a sizable contingent from the Crystarium guard, Captain Lyna herself among them."},{"name":"URIANGER","text":"Not only do they stand watch over civilians─when the time cometh, they too shall pour their magicks into the Talos."},{"name":"RUNAR","text":"<span class=\"highlight\">Forename</span>, it does me well to see you again. When Master Matoya told us of the undertaking, we struggled to comprehend the enormity of it."},{"name":"RUNAR","text":"Nonetheless, we have complete faith in you and yours. All that is within our power, the Night's Blessed will do. And as you can see by the presence of their people, Fanow is of the same mind."},{"name":"CHAINUZZ","text":"Hmmm... If the stone is laid out in this manner, the imbuing should begin...ah, yes─here."},{"name":"DULIACHAI","text":"Oh, <span class=\"highlight\">Forename</span>, my dear. I regret to say that all this moving about has begun to take its toll. Yet my darling husband soldiers on like the redoubtable soul he is."},{"name":"DULIACHAI","text":"I am entirely unqualified to help him with the Talos, of course, but I do what I can to make him more comfortable. A cup of water here, a massage there..."},{"name":"GUARDMAN03641","text":"Let the eaters come! We'll keep everyone safe!"},{"name":"YSHTOLA","text":"Ah, good of you to join us. I'm pleased to say we have gathered ample help for the imbuing."},{"name":"YSHTOLA","text":"With Master Chai in the process of finalizing his design, I have taken the liberty of dispatching all hands to their positions."},{"name":"CHAINUZZ","text":"You hurtle along as though I have my house in order, but quite frankly this is the most disorganized mess of a project I've ever overseen! And I haven't spent nearly as much time as I would like on my calculations!"},{"name":"URIANGER","text":"So thou hast proclaimed loudly and frequently, Master Chai. Yet from my perspective─a layman's though it may be─haste notwithstanding, thou hast gone to great lengths, abiding by proven methodology, to ensure the integrity of thy design."},{"name":"CHAINUZZ","text":"Aye, well, that's just the bare minimum that's expected of us at the Stoneworks. Though our glory days are behind us, I've not forgotten our time-honored traditions."},{"name":"CHAINUZZ","text":"Ah, but I should mention that the Exarch delivered the ore I asked for. Earthseed, I believe he called it."},{"name":"CHAINUZZ","text":"In that quantity, I believe we can fashion a suitable heart for the Talos."},{"name":"CHAINUZZ","text":"And then everything will be in readiness...or so I would like to say."},{"name":"ALPHINAUD","text":"Is there a problem?"},{"name":"CHAINUZZ","text":"In a Talos of, well, any <span class=\"emphasis\">reasonable</span> size, a single heart will serve to circulate aether throughout the chassis. But given the unprecedented proportions of that which we seek to build, I doubt that will be the case."},{"name":"CHAINUZZ","text":"By installing smaller peripheral hearts at intervals, I believe that we can maintain a stable aether flow, thereby solving the problem. However, we don't have enough ore for this purpose."},{"name":"CHAINUZZ","text":"Naught for it but to procure more, I suppose..."},{"name":"YSHTOLA","text":"Runar, mayhap now is a good time to bring them out."},{"name":"RUNAR","text":"A moment, friends. There is something I would show you."},{"name":"URIANGER","text":"I say, are these not heartstones?"},{"name":"RUNAR","text":"They are. The most prized possession of we of the Night's Blessed. And these belonged to our kindred who have left us."},{"name":"YSHTOLA","text":"Immersed in water imbued with fervent prayer, these stones harbor no small amount of magic."},{"name":"YSHTOLA","text":"And we may imbue them with yet more prior to their installation on the Talos. What think you?"},{"name":"CHAINUZZ","text":"Being from a different region, these cannot be used for the main heart. The peripheral ones, on the other hand... Aye, I believe they will serve."},{"name":"RUNAR","text":"Excellent. When Master Matoya spoke to us of the role we are to play, the heartstones immediately came to mind."},{"name":"RUNAR","text":"Of course, before bringing them with me, I made certain to consult my fellows first. After all, the stones bear the precious lives of those who have gone to the sunless sea."},{"name":"RUNAR","text":"But we have now beheld the sunless sea with our very own eyes, and by the gentle lights that glimmer on high, we know that there is peace beyond."},{"name":"RUNAR","text":"Thus are we also at peace. If our heartstones may serve to restore night to all the world, gladly do we give them."},{"name":"YSHTOLA","text":"So, Master Chai. If you could instruct us how to distribute the heartstones?"},{"name":"YSHTOLA","text":"And <span class=\"highlight\">Forename</span>─for good luck, may I ask that you imbue one as well?"},{"name":"ALPHINAUD","text":"Full many have placed their hopes in our plan, both those who are here and those who could not be. We must not fail them."},{"name":"URIANGER","text":"Yet again, that which was bequeathed by the departed paveth the way for the living."},{"name":"RUNAR","text":"We should be honored, <span class=\"highlight\">Forename</span>."},{"name":"CHAINUZZ","text":"Go on and do your imbuing. I'll see to it the stones are put to good use."},{"name":"YSHTOLA","text":"Rest assured it is not difficult. Simply raise your hand and focus as you would when attuning to an aetheryte."},{"name":"YSHTOLA","text":"Imbue the jade-colored stone here, if you would be so kind."},{"name":"YSHTOLA","text":"Go on, <span class=\"highlight\">Forename</span>. Imbue the stone."},{"name":"SYSTEM","text":"The familiar-looking heartstone appears to glow faintly."},{"name":"YSHTOLA","text":"That will do. Thank you, <span class=\"highlight\">Forename</span>."},{"name":"YSHTOLA","text":"If this heartstone appears familiar, it is because it belonged to Toddia."},{"name":"YSHTOLA","text":"It bears the collective hope of the Night's Blessed─the hope that none shall ever again be sacrificed to sin eaters."},{"name":"CHAINUZZ","text":"Right, I've identified the spots on the Talos where the stones are needed. See that they're amply imbued, then install them as I've indicated on this diagram."},{"name":"YSHTOLA","text":"Understood. We will set about the task at once."},{"name":"ALPHINAUD","text":"When the Talos awakens and the way to Mt. Gulg is secured, we shall sally forth."},{"name":"ALPHINAUD","text":"It promises to be a trying climb, so take what rest you can in the meantime. We will see you soon."},{"name":"YSHTOLA","text":"A moment, Urianger. You said that you would have measures ready in the event that our friend fails to contain the Light. Do you?"},{"name":"URIANGER","text":"Be assured that I do. All which I require lieth in this land."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Don't worry, I'll be fine!"},{"name":"A1","text":"I trust you, Urianger."},{"name":"A1","text":"So...what's the plan exactly?"},{"name":"URIANGER","text":"So do we all hope, my friend. To that end, thou shouldst take such ease as thou mayest, the better to ready thyself for the trials to come."},{"name":"URIANGER","text":"And I swear to thee that thy trust is not misplaced. As ardently as I pray for the preservation of this world, so too do I pray for thy safety."},{"name":"URIANGER","text":"So rest easy, my friend, and take such ease as thou mayest, the better to be ready for the trials to come."},{"name":"URIANGER","text":"To my deepest regret, I cannot reveal the plan to thee. In order for it to succeed, 'tis vital that thou remainest ignorant of its nature until the time is right."},{"name":"URIANGER","text":"Yet though I may thus keep my counsel, know that I have only thy safety at heart. So rest easy, my friend, and take such ease as thou mayest, the better to be ready for the trials to come."},{"name":"CHAINUZZ","text":"I'm told the rock for the chassis is more or less ready─all quarried and shaped and laid out. That just leaves the imbuers to do their work."},{"name":"CHAINUZZ","text":"I'll continue checking my calculations up until the very last moment, but it's only a matter of time now."},{"name":"CHAINUZZ","text":"We managed to rally nigh everyone in Norvrandt for this endeavor. That's a remarkable feat in itself...but will it be enough?"}],"reward":{"gil":803,"items":[{"num":3,"id":5795,"one":1},{"num":3,"id":5799,"one":1},{"num":3,"id":5804,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":78,"id":142}],"quests":[69176]},"next":[69178]},"partials":[{"type":"npc","id":"1030238","obj":{"i":1030238,"n":"Alphinaud","l":2954,"q":1}},{"type":"npc","id":"1030253","obj":{"i":1030253,"n":"Chai-Nuzz","l":2954,"q":2}},{"type":"item","id":"5795","obj":{"i":5795,"n":"Woad Blue Dye","l":30,"c":22804,"t":55}},{"type":"item","id":"5799","obj":{"i":5799,"n":"Storm Blue Dye","l":30,"c":22804,"t":55}},{"type":"item","id":"5804","obj":{"i":5804,"n":"Abyssal Blue Dye","l":30,"c":22804,"t":55}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69176","obj":{"i":69176,"n":"Rich Veins of Hope","g":8,"l":"Kholusia","s":920}},{"type":"quest","id":"69178","obj":{"i":69178,"n":"A Breath of Respite","g":8,"l":"Kholusia","s":940}}]}