{"quest":{"name":"Rich Veins of Hope","location":"Kholusia","id":69176,"patch":5.0,"sort":920,"icon":100923,"eventIcon":71201,"issuer":1030375,"target":1030292,"genre":8,"journal":["The Crystal Exarch has efficiency on his mind.","Desiring to use your time efficiently, the Crystal Exarch suggests splitting up for the tasks to come. While he transports the earthseed to Chai-Nuzz in Amity, he asks that you see your young dwarven companion, Korutt, safely back to Tomra.","Xamott is pleased that young Korutt was of help to you, and informs you that other dwarves have also come forward wishing to aid your cause. To that end, anticipating that you will have need of mining tools to procure the stone for the Talos, they have modified their spare pickaxes for use by bigger folk. Thus generously furnished, you set out to rejoin your comrades at Top Rung.","You arrive at Top Rung to find Alisaie and Alphinaud returned, along with the help they promised. Yet while there is no shortage of willing hands, there is a shortage of pickaxes for them to wield. How very fortunate, then, that you should be carrying a small mountain of the mining tools with you. Equal parts pleased and incredulous, Alisaie bids you distribute them among the gathered helpers.","As you go about doling out the pickaxes, you meet many a familiar face. Though each has walked a different path to reach this point, all are united in their desire to do their part for Norvrandt. With the last of the volunteers equipped and on their way, you turn your steps back to Alisaie.","After thanking you for your efforts, Alisaie declares that she will take her place alongside the soldiers tasked with defending the laborers while they work. There is much and more still to be done, but in such determined company, you cannot help feeling optimistic."],"objectives":["Speak with Xamott.","Speak with Alisaie.","Deliver pickaxes to Magnus.","Deliver pickaxes to Rhon Ron.","Deliver pickaxes to Kai-Shirr.","Speak with Alisaie."],"dialogue":[{"name":"KORUTT","text":"I'm glad I could be of help! If you need any more earthseed, just let me know!"},{"name":"GLAGG","text":"&lt;snore&gt; &lt;snore&gt;"},{"name":"MYSTERYVOICE","text":"Well, my friend, much as I have enjoyed our time together, I think it best we split up, that we might accomplish our tasks more swiftly."},{"name":"MYSTERYVOICE","text":"I shall see the earthseed safely into the hands of Chai-Nuzz."},{"name":"MYSTERYVOICE","text":"While I am thus employed, would you be so good as to deliver Korutt back to Tomra?"},{"name":"MYSTERYVOICE","text":"My thanks, <span class=\"highlight\">Forename</span>. Brief though it was, 'twas an honor to go adventuring with you. I shall see you back in Amity."},{"name":"MYSTERYVOICE","text":"Leave the earthseed to me, my friend, and see Korutt safely back to Tomra. While you are there, a word of thanks to Chief Xamott would not go astray."},{"name":"KORUTT","text":"Phew! Not a single brush with death! Thanks for coming back with me!"},{"name":"XAMOTT","text":"Lali-ho! Glad you're back, and in one piece! How did you fare with the earthseed, then?"},{"name":"KORUTT","text":"I got them all they needed! The Exarch's on his way to Amity with it now!"},{"name":"XAMOTT","text":"Good to hear that young Korutt was of help. As it happens, a few others came forward while you were gone sayin' they wanted to do their bit as well."},{"name":"XAMOTT","text":"Given that you're buildin' a Talos, we reckoned you'd be needin' some minin' tools. So we went and modified our spare pickaxes for use by bigger folk."},{"name":"XAMOTT","text":"Here, take these with you. Should be plenty to go 'round."},{"name":"XAMOTT","text":"From what our scouts tell me, there's a crowd gathered at Top Rung already. Go and see that everyone has a pickaxe to swing, eh?"},{"name":"XAMOTT","text":"We did the folk of Amity a kind turn in case we needed a kind turn ourselves one day. Can't say as I expected things to turn out like they have, but I don't regret makin' friends!"},{"name":"KORUTT","text":"This is just the start! I'm going to go and see what else I can do!"},{"name":"ALPHINAUD","text":"Ah, <span class=\"highlight\">Forename</span>, you are come at a good time."},{"name":"KAISHIRR","text":"Alphinaud came and rounded all of us up. It's funny, I used to be afraid of Eulmorans, and yet here we all are..."},{"name":"EMPLOYEE03287","text":"No few free citizens wanted to help, but years of leisure meant that most were in no condition to contribute. Instead, they send their fervent hopes for our success."},{"name":"IRVITHE","text":"As if restoring the Ladder weren't enough of a task, you're trying to build a giant Talos! I love it!"},{"name":"GRITHIL","text":"Did you doubt that we'd be back for more? We've got motivation to spare!"},{"name":"MAGNUS","text":"There I was thinking you lot had come up with the stupidest plan known to man, when I find out you've managed to drag old Chai-Nuzz into it. Once the job's done, I'll have to go and give the lazy sod a good heckling."},{"name":"THAFFE","text":"<span class=\"highlight\">Forename</span>, good to see you again! How have you been keeping?"},{"name":"JERYK","text":"A-A giant Talos? Can such a thing be done...? Oh, be still my beating heart!"},{"name":"RHONRON","text":"Worms! Get your worms! They're the best you'll taste this side of the Bright Cliff! Live and juicy or cured and crunchy, there is something for everyone!"},{"name":"JOURNEYSHEADNURSE","text":"Alisaie came looking for willing workers...so here I am!"},{"name":"ALISAIE","text":"Look, <span class=\"highlight\">Forename</span>! People from all over have come to help us quarry stone!"},{"name":"ALISAIE","text":"And this isn't even all of them. As we speak, the volunteers Thancred and Ryne recruited are being escorted to the work site─and by both Crystarium and Eulmoran soldiers, no less."},{"name":"ALISAIE","text":"So as you can see, we have plenty of hands. There's just one problem─we don't have enough tools to put in them. We've been desperately trying to round up more, but we haven't had much luck so far."},{"name":"ALISAIE","text":"Pickaxes from the dwarves!? Trust you to have exactly what we need, exactly when we need it!"},{"name":"ALISAIE","text":"Well, what are you waiting for? Go and hand them out to everyone so they can get to work!"},{"name":"ALISAIE","text":"Honestly, <span class=\"highlight\">Forename</span>, you can already slay gods. You could at least have left the uncanny sense of timing for one of us. It's greedy is what it is."},{"name":"KAISHIRR","text":"We're ready to do our bit, <span class=\"highlight\">Forename</span>! We just, er...need tools to do it with."},{"name":"KAISHIRR","text":"Pickaxes! Loads of 'em!"},{"name":"EMPLOYEE03287","text":"Now we may all work to our hearts' content!"},{"name":"EMPLOYEE03287","text":"While I don't have many talents, I do have a strong back. And what strength I have, I'll gladly use for the sake of peace."},{"name":"IRVITHE","text":"We got the Ladder moving again, didn't we? If we join hands, there's no Talos we can't build!"},{"name":"KAISHIRR","text":"I still haven't repaid you and Alphinaud for saving me, and I'm not sure I ever could."},{"name":"KAISHIRR","text":"But that ain't going to stop me trying! I'm with you to the end!"},{"name":"KAISHIRR","text":"Come on, you lot! Look lively!"},{"name":"MAGNUS","text":"We've come, <span class=\"highlight\">Forename</span>. In case you're wondering, Guthjon is here too."},{"name":"MAGNUS","text":"Couldn't wait to start breaking rocks, though, so he's gone on ahead. Bah, he could've at least left us a spare set of tools..."},{"name":"MAGNUS","text":"Ah, wonderful! Now we can be about it too!"},{"name":"MAGNUS","text":"Quarrying isn't exactly my stock-in-trade, but this time...this time I feel as though my wife will be with me, guiding my hand..."},{"name":"MAGNUS","text":"So let's make it happen. Let's build a world where everyone can live without fear. Where everyone has a place they can go home to."},{"name":"MAGNUS","text":"Right, then, let's be on our way.<br>...Hm? What are you still doing here, Thaffe? I thought you'd brought your own tools."},{"name":"THAFFE","text":"I did. And I was just about to head off, when I saw Jeryk..."},{"name":"JERYK","text":"Oh gods, oh gods... If this plan works and the giant Talos comes to life..."},{"name":"JERYK","text":"Just imagine the size of the trolley it could push! <span class=\"emphasis\">Imagine it</span>!"},{"name":"THAFFE","text":"&lt;sigh&gt; Are you <span class=\"emphasis\">still</span> raving on about that? How many times do I have to tell you, that's not what the Talos is for! Where the hells would the tracks even go?"},{"name":"JERYK","text":"There's bound to be somewhere! You just need a little imagination! Seeing as the Stoneworks is involved, maybe we could have a trolley added to the design..."},{"name":"MAGNUS","text":"Enough! We're going to work! And if I hear any more about trolleys from you, I'll have you pushing one yourself!"},{"name":"RHONRON","text":"Long time no see, traveler! Are you waiting to be issued a pickaxe too?"},{"name":"RHONRON","text":"Oho, you clearly weren't, and now neither are we! Rest assured, we will put these to good use and work very, very hard!"},{"name":"RHONRON","text":"Of course, one cannot work on an empty stomach─which is why I brought some tasty worms to share!"},{"name":"JOURNEYSHEADNURSE","text":"Er, as much as we would all enjoy a treat, perhaps the worms are best saved for...afterwards?"},{"name":"JOURNEYSHEADNURSE","text":"Greetings, <span class=\"highlight\">Forename</span>. You may not remember me, but I'm one of the carers from the Inn at Journey's Head."},{"name":"JOURNEYSHEADNURSE","text":"After night returned to Amh Araeng, we noticed a change in our patients. The transformation had halted in every one of them."},{"name":"JOURNEYSHEADNURSE","text":"I can't express what it did to the mood of the place. We were still celebrating, days later, when who should come along but Alisaie. She said that she sought the aid of those who believed in the Warrior of Darkness."},{"name":"JOURNEYSHEADNURSE","text":"We all answered her call right there and then. Of course, some few carers had to remain behind, but as many of us came as could be spared."},{"name":"RHONRON","text":"I too have great respect for the Warrior of Darkness! When we meet, I'll be sure to treat them to a nice, plump worm!"},{"name":"ALPHINAUD","text":"Everything appears to be in order here. In all my time in this world, I do not recall seeing so many optimistic faces."},{"name":"ALISAIE","text":"My thanks, <span class=\"highlight\">Forename</span>. With that, everyone is now equipped to work."},{"name":"ALISAIE","text":"I think I'll go and join the soldiers standing guard over the volunteers. It would be a shame if they fell prey to sin eaters after all the trouble we've gone to."},{"name":"ALISAIE","text":"Right! Let us see that this plan is a resounding success─for the sake of all in Norvrandt!"}],"reward":{"gil":1120,"items":[{"num":2,"id":27874}]},"reqs":{"jobs":[{"lvl":78,"id":142}],"quests":[69175]},"next":[69073,69074,69075,69076,69078,69082,69177]},"partials":[{"type":"npc","id":"1030375","obj":{"i":1030375,"n":"Crystal Exarch","l":2954,"q":2}},{"type":"npc","id":"1030292","obj":{"i":1030292,"n":"Alisaie","l":2954,"q":1}},{"type":"item","id":"27874","obj":{"i":27874,"n":"Espresso con Panna","l":415,"c":24407,"t":46,"p":3690}},{"type":"quest","id":"69175","obj":{"i":69175,"n":"The Duergar's Tewel","g":8,"l":"Kholusia","s":910}},{"type":"quest","id":"69073","obj":{"i":69073,"n":"Fugitive of Fear","g":114,"l":"Kholusia","s":8060,"f":1}},{"type":"quest","id":"69074","obj":{"i":69074,"n":"Hobgob Smacker","g":114,"l":"Kholusia","s":8030}},{"type":"quest","id":"69075","obj":{"i":69075,"n":"Small Nuisances","g":114,"l":"Kholusia","s":8080}},{"type":"quest","id":"69076","obj":{"i":69076,"n":"Timber for the Taking","g":114,"l":"Kholusia","s":8040}},{"type":"quest","id":"69078","obj":{"i":69078,"n":"Fresh Off the Wing","g":114,"l":"Kholusia","s":8050}},{"type":"quest","id":"69082","obj":{"i":69082,"n":"A Rocky Relationship","g":114,"l":"Kholusia","s":8090}},{"type":"quest","id":"69177","obj":{"i":69177,"n":"That None Shall Ever Again","g":8,"l":"Kholusia","s":930}}]}