{"quest":{"name":"In Mt. Gulg's Shadow","location":"Kholusia","id":69171,"patch":5.0,"sort":870,"eventIcon":71201,"issuer":1030213,"target":1030216,"genre":8,"journal":["Alisaie is eager to get on with the task."],"objectives":["Speak with Alisaie.","Survey the area.","Speak with Alisaie."],"dialogue":[{"name":"ALPHINAUD","text":"I'm pleased to see that the villagers are no longer wary of us. I shall take the opportunity to ask about Mt. Gulg."},{"name":"ALISAIE","text":"Yet another hapless soul that Alphinaud saved from mortal danger, I see. Some things never change."},{"name":"ALISAIE","text":"At any rate, it seems that Brother has a mind to linger. Meanwhile, I have a mind for us to explore."},{"name":"ALISAIE","text":"<span class=\"highlight\">Forename</span> and I are going to scout out the area. We'll be back in a while."},{"name":"ALPHINAUD","text":"O-Oh? Very well, then. Just take care out there."},{"name":"ALPHINAUD","text":"Take care out there. If you sense even the slightest danger, pray turn back at once."},{"name":"ALISAIE","text":"The path diverges. Let's split up so we can cover more ground. I'll go east if you would be so kind as to head west."},{"name":"ALISAIE","text":"We can aim to meet at the foot of the mountain, taking note of what we see along the way. In a short while, then."},{"name":"SYSTEM","text":"You are under attack!"},{"name":"ALPHINAUD","text":"Soon after you left, who should arrive in Amity but Urianger and the Exarch. I'm glad they were able to find you."},{"name":"THANCRED","text":"I'm told you went ahead to scout out the volcano. I don't suppose some grappling hooks will suffice?"},{"name":"RYNE","text":"A-All that grinding and shaking... I-I was afraid the lift floor would fall out from underneath me..."},{"name":"RYNE","text":"B-But don't worry! I-I'm sure the trembling will go away s-soon!"},{"name":"URIANGER","text":"Thus are we all gathered...though Ryne, I am afeared, did not much enjoy the ascent."},{"name":"YSHTOLA","text":"Forgive us our delay. The Exarch arrived and we took some time to apprise him of our mission."},{"name":"MYSTERYVOICE","text":"...Concerned for my health, are you? Indeed, we are a little far from the Crystarium, but rest assured this old man can muster up another wind for what is to come."},{"name":"CHAINUZZ","text":"Oh, don't mind us. We're just taking in the sights."},{"name":"DULIACHAI","text":"Ahhh, such an exhilarating ride! And such a magnificent view! Nothing in Eulmore compares to this!"},{"name":"ALISAIE","text":"Hm... I didn't expect to see the Chais here. Though I suppose it's well within their rights."},{"name":"ALISAIE","text":"At any rate, it's time to tackle our next little obstacle: finding a way to reach Mt. Gulg."},{"name":"ALISAIE","text":"For this, we'll need to put all our heads together..."}],"reward":{"gil":1000,"items":[{"id":26868}]},"reqs":{"jobs":[{"lvl":78,"id":142}],"quests":[69170]},"next":[69172]},"partials":[{"type":"npc","id":"1030213","obj":{"i":1030213,"n":"Alisaie","l":2954,"q":1}},{"type":"npc","id":"1030216","obj":{"i":1030216,"n":"Alisaie","l":2954,"q":2}},{"type":"item","id":"26868","obj":{"i":26868,"n":"Dwarven Mythril Weapon Coffer (IL 415)","l":1,"c":26557,"t":61}},{"type":"quest","id":"69170","obj":{"i":69170,"n":"The View from Above","g":8,"l":"Kholusia","s":860}},{"type":"quest","id":"69172","obj":{"i":69172,"n":"A Gigantic Undertaking","g":8,"l":"Kholusia","s":880}}]}