{"quest":{"name":"A Breath of Respite","location":"Kholusia","id":69178,"patch":5.0,"sort":940,"eventIcon":71201,"issuer":1030253,"target":1030294,"genre":8,"journal":["Chai-Nuzz is looking not a little anxious."],"objectives":["Speak with Dulia-Chai.","Search for the Crystal Exarch.","Speak with the Crystal Exarch."],"dialogue":[{"name":"DULIACHAI","text":"Oh, <span class=\"highlight\">Forename</span>, my dear. I regret to say that all this moving about has begun to take its toll. Yet my darling husband soldiers on like the redoubtable soul he is."},{"name":"DULIACHAI","text":"I am entirely unqualified to help him with the Talos, of course, but I do what I can to make him more comfortable. A cup of water here, a massage there..."},{"name":"CHAINUZZ","text":"Gah, there's no point worrying about such things now. I'll get back to my calculations. You, meanwhile, should go and rest as your friends suggested."},{"name":"CHAINUZZ","text":"My wife and the Exarch should be in the tavern. Why don't you join them?"},{"name":"CHAINUZZ","text":"Oh, and <span class=\"highlight\">Forename</span>? Ahem...<br>Thank you."},{"name":"CHAINUZZ","text":"Why are you still here? Go and get some rest while you can!"},{"name":"DULIACHAI","text":"...The Exarch? He went outside a moment ago, my dear. I would've thought you'd have seen him."},{"name":"DULIACHAI","text":"He kept me company for a short while, but then he came over rather pale. He's clearly been straining himself, the poor thing."},{"name":"DULIACHAI","text":"Anyway, he excused himself, saying that he needed a breath of fresh air. Weak as he looked, I did offer to go with him, but he assured me he would be fine. I do hope he's all right..."},{"name":"DULIACHAI","text":"Did you find the Exarch? I don't imagine he could have gone far..."},{"name":"SYSTEM","text":"The Exarch does not appear to be nearby."},{"name":"BALAENICEPSREX","text":"..."},{"name":"SYSTEM","text":"The Exarch does not appear to be anywhere in the vicinity. There is only the shoebill, gazing unflinchingly southward."},{"name":"CHAINUZZ","text":"There you are! Ahhh, what a relief... When Dulia told me that the Exarch had disappeared, and that you had been a long time finding him, I had feared the worst had happened right before the moment of truth!"},{"name":"DULIACHAI","text":"The Exarch is back, thank heavens, and it seems the sea breeze did him a world of good! I do hope you managed to get a spot of rest as well!"},{"name":"MYSTERYVOICE","text":"Worry not, my friend. I am much revived for the fresh air─and your fine company, of course. Now then, let us turn our thoughts back to the task at hand."},{"name":"SYSTEM","text":"Meanwhile, in the imperial palace in the Source..."},{"name":"ROBEMAN","text":"(-Zenos-)Your Radiance. I have taken the liberty of quashing the vile rumors that your heir is possessed by a devil."},{"name":"ROBEMAN","text":"(-Zenos-)With the nation in the grip of war, we may rely on patriotic zeal to prevent them from resurfacing."},{"name":"VARIS","text":"And what of Emet-Selch?"},{"name":"ROBEMAN","text":"(-Zenos-)He has taken himself to the First, to usher that world to its end."},{"name":"ROBEMAN","text":"(-Zenos-)Or so I believe. He did not disclose the details of his mission, having ever preferred to work alone."},{"name":"ROBEMAN","text":"(-Zenos-)Even to those who have known him since the beginning, his actions can prove...unpredictable."},{"name":"VARIS","text":"I am no stranger to his ways. He joys in playing me for a fool. Full many times have I been convinced I was acting of my own volition, only to discover all was as he willed it."},{"name":"VARIS","text":"My dear grandfather..."},{"name":"ROBEMAN","text":"(-Zenos-)On the subject of our esteemed colleague: his last report, though brief, did contain one item of interest."},{"name":"ROBEMAN","text":"(-Zenos-)You have doubtless wondered why the Scions of the Seventh Dawn have not taken the field of late."},{"name":"ROBEMAN","text":"(-Zenos-)It is because they are no longer in the Source."},{"name":"ROBEMAN","text":"(-Zenos-)The hero of the Scions has journeyed to the First─as have <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> comrades, albeit incompletely. Their bodies yet remain here in the Source."},{"name":"ROBEMAN","text":"(-Zenos-)This presents an opportunity. If we can defeat the Alliance prior to the Scions' return, we may eliminate their order at a stroke."},{"name":"ROBEMAN","text":"(-Zenos-)And with the Scions gone, none shall remain to thwart our plans. It will be but a matter of striking down the hero upon <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> homecoming."},{"name":"ROBEMAN","text":"(-Zenos-)Which, lest you forget, is essential to the realization of our objective. Of <span class=\"emphasis\">both</span> of our objectives."},{"name":"ROBEMAN","text":"(-Zenos-)Through Hydaelyn's meddling, Her champions threaten to wrest the reins of fate from our grasp. The world is at risk of being dragged down the false path."},{"name":"ROBEMAN","text":"(-Zenos-)One which will never see man reclaim his true form."},{"name":"ROBEMAN","text":"(-Zenos-)'Tis unthinkable that he should supplant us, incomplete as he is. Such a devolution is abhorrent. And it must be stopped─before it is too late."},{"name":"ROBEMAN","text":"(-Zenos-)The hour is come, Your Radiance. Order your armies to march once more. Crush all who stand in your way."},{"name":"ROBEMAN","text":"(-Zenos-)This is your heart's desire, is it not? To seize a victory that is yours and yours alone─for the future of Garlemald!"},{"name":"ZENOS","text":"(-???-)Oh <span class=\"emphasis\">dear</span>... You do not wear the mummer's motley well. I was never one to take an interest in tedious conflicts."},{"name":"ZENOS","text":"The whereabouts of my one true friend, however─<span class=\"emphasis\">they</span> interest me greatly. I but hope the beasts of this “First” are providing <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> proper sport."},{"name":"ZENOS","text":"I would know every detail, Lord Zenos. Or would you rather I called you Elidibus?"},{"name":"ROBEMAN","text":"(-Elidibus-)...Hm. Unexpected. Most unexpected."},{"name":"ROBEMAN","text":"(-Elidibus-)That immortality should be within the reach of one with a <span class=\"emphasis\">borrowed</span> Echo."},{"name":"ROBEMAN","text":"(-Elidibus-)You have outdone yourself, Zenos yae Galvus."},{"name":"ZENOS","text":"I have no particular attachment to that name─but I <span class=\"emphasis\">am</span> rather fond of that body. Without it, I cannot enjoy my hunt to the fullest."},{"name":"ZENOS","text":"Your secrets or my flesh. I care not which you give me first. The choice is yours."}],"reward":{"gil":843},"reqs":{"jobs":[{"lvl":78,"id":142}],"quests":[69177]},"next":[69179]},"partials":[{"type":"npc","id":"1030253","obj":{"i":1030253,"n":"Chai-Nuzz","l":2954,"q":2}},{"type":"npc","id":"1030294","obj":{"i":1030294,"n":"Crystal Exarch","l":2954,"q":1}},{"type":"quest","id":"69177","obj":{"i":69177,"n":"That None Shall Ever Again","g":8,"l":"Kholusia","s":930}},{"type":"quest","id":"69179","obj":{"i":69179,"n":"Extinguishing the Last Light","g":8,"l":"Kholusia","s":950}}]}