{"quest":{"name":"The View from Above","location":"Kholusia","id":69170,"patch":5.0,"sort":860,"icon":100921,"eventIcon":71201,"issuer":1030197,"target":1030211,"genre":8,"journal":["Urianger is wearing a pensive look.","Ahead of the coming trials, Urianger bids you take your ease while the others carry out the work on the Ladder.","As you observe the final stages of the Ladder's restoration, Emet-Selch arrives unannounced. In the course of waxing sentimental, he raises the prospect of you joining him as an equal─a complete existence in a complete world. No sooner does the Ascian take his leave than Ardbert appears in his place. As the Talos come to life to hearty cheers, he speaks to you of his struggles against solitude, and warns you against making a choice that leaves you alone. At that moment, Alphinaud and Alisaie rush up to you excitedly. The Ladder lives again, and you join the twins as the first souls to ride the lift in twenty years.","While you await the others at Top Rung, Alisaie calls to you from the nearby outlook, and you and Alphinaud hurry to join her.","According to Alisaie, she witnessed someone emerge from the village to the northeast, even though the area is believed to have been abandoned. Lest you doubt her words, she urges you to take a look for yourself.","Scanning the area around the village, you spot the mysterious person, who appeared to be spying in your direction. Uncomfortable at not knowing who is out there, Alisaie suggests that you investigate the village.","While the village appears devoid of people, there is evidence to suggest that it is very much inhabited, and you take your findings to Alphinaud.","As you ponder what to do about the hiding villagers, a voice calls out. It is revealed to belong to none other than Tristol, the young artist whose life you saved in Kholusia. He informs you that the village, Amity, is a settlement for those who survived being exiled from Eulmore, and upon learning that you are in pursuit of Vauthry, promises to aid you in your quest."],"objectives":["Wait for the work to be completed.","Speak with Alphinaud.","Speak with Alisaie.","Search the area for the mysterious person.","Investigate the village.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"The work proceeds apace, I'm pleased to say. When it is restored, the Ladder will not only be our way forward; it will represent a momentous step towards lasting change for Kholusia."},{"name":"ALISAIE","text":"I've rounded up as much material as I could for the work. Just my little bit for the cause."},{"name":"THANCRED","text":"The Eulmorans have rallied quite impressively. Amidst great adversity, a little purpose never goes astray."},{"name":"RYNE","text":"Oh, <span class=\"highlight\">Forename</span>. I heard you went to find lumber."},{"name":"RYNE","text":"From afar, the Ladder looked like it was made entirely of metal, but there's actually a lot of wood if you look for it."},{"name":"YSHTOLA","text":"By the intensity with which he works, 'tis as if all of that reluctance was a lie."},{"name":"CHAINUZZ","text":"Hmph, such a primitive, inefficient design! A much smaller Talos from our company could just as easily perform the same task!"},{"name":"DULIACHAI","text":"Oh, he'll have them moving again soon! I know he will!"},{"name":"URIANGER","text":"Ah, but prematurely do I give myself to sentimental musings. Many more pressing concerns demand our attention, not the least of which is the matter of how we might reach the mountain, detached from the land as it is."},{"name":"URIANGER","text":"For the present, 'twould appear we have matters here well in hand. Perhaps thou shouldst take thine ease for a time? Thou wilt need every onze of thy strength for the trials ahead."},{"name":"URIANGER","text":"Thy zeal is commendable, my friend, but rest assured we shall not want for hands. Pray take thine ease in preparation for the trials ahead."},{"name":"ALISAIE","text":"Is that...?"},{"name":"EULMOREMAN03634","text":"If you're looking for your friends, they were about to board the lift when someone or other arrived."},{"name":"EULMOREMAN03634","text":"They said not to mind them, that they'll be along soon."},{"name":"ALPHINAUD","text":"And here we finally are, at Top Rung."},{"name":"ALPHINAUD","text":"The others should arrive ere long─"},{"name":"ALISAIE","text":"(-Alisaie-)Alphinaud, <span class=\"highlight\">Forename</span>! Come up here! There's something I need you to see!"},{"name":"ALPHINAUD","text":"What could this be about?"},{"name":"ALPHINAUD","text":"That appears to be a village..."},{"name":"ALISAIE","text":"There's a village, <span class=\"highlight\">Forename</span>. Over to the northeast."},{"name":"ALPHINAUD","text":"So there is. Yet after two decades without the Ladder in operation, I would not be surprised if such an isolated settlement had long since been abandoned."},{"name":"ALISAIE","text":"Nor I. But that was before I spied someone leave it and proceed to head in our direction, all the while trying to remain unseen..."},{"name":"ALISAIE","text":"Whoever this mysterious person is, they should still be out there. Go on and take a look, <span class=\"highlight\">Forename</span>."},{"name":"ALPHINAUD","text":"So long as they have the resources to sustain themselves, it's entirely possible that people could still be about..."},{"name":"ALISAIE","text":"Go on and take a look, <span class=\"highlight\">Forename</span>. The mysterious person should still be out there."},{"name":"SYSTEM","text":"Search your surroundings for the mysterious person. You may move the camera as well as zoom in and out. Target the figure and inspect them with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"ALISAIE","text":"There's someone, right? And they were spying on us. Personally, I don't feel comfortable not knowing who they are. What do you say we investigate?"},{"name":"ALPHINAUD","text":"I'm curious too, I must admit. And I daresay we have a bit of time ere the others ascend."},{"name":"ALISAIE","text":"It's settled, then. Let's head to the village and see if it's indeed inhabited."},{"name":"ALPHINAUD","text":"The crates and barrels are laden with unknown contents."},{"name":"ALISAIE","text":"I could have sworn I heard a noise..."},{"name":"SYSTEM","text":"You hear faint sounds from inside the building. However, the door refuses to budge."},{"name":"SYSTEM","text":"Food has been hung out to dry in the sun, and quite recently by your reckoning."},{"name":"SYSTEM","text":"The cups are half-empty...or half-full, depending on how you see such things. Behind the counter, a kettle bubbles steadily over the stove."},{"name":"ALPHINAUD","text":"What news, <span class=\"highlight\">Forename</span>? Were you able to find anything of note?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"People are definitely still living here."},{"name":"A1","text":"I couldn't find our mysterious person."},{"name":"A1","text":"Maybe this place really is abandoned."},{"name":"ALPHINAUD","text":"Indeed. While there's no one to be seen, 'tis plain that this village is anything but abandoned."},{"name":"ALPHINAUD","text":"Nor I. But while there's no one to be seen, 'tis plain that this village is anything but abandoned."},{"name":"ALPHINAUD","text":"I don't think so, my friend. While there's no one to be seen, 'tis plain that this village is anything but abandoned."},{"name":"ALISAIE","text":"If the villagers are trying to conceal themselves, they are doing a rather poor job of it. But if they don't wish to be seen, what are we to do?"},{"name":"TRISTOL","text":"(-???-)I say, aren't you the ones who saved my life?"},{"name":"ALPHINAUD","text":"You're Tristol, the artist from Eulmore!"},{"name":"TRISTOL","text":"You remembered! Ever since we parted ways, I've worried for you, bound for the city as you were. Never did I imagine that we would meet again, and here of all places!"},{"name":"ALPHINAUD","text":"We could say the very same thing to you, my friend. I'm glad to see you hale and whole. But tell me, what is this village?"},{"name":"TRISTOL","text":"This is Amity, a settlement made up of those who survived being exiled from Eulmore."},{"name":"TRISTOL","text":"As I wandered the wilds, I chanced to cross paths with an inhabitant of these parts."},{"name":"TRISTOL","text":"He took me through a secret tunnel which led to the top of the Bright Cliff. I've been here ever since. Life is hard, but we know a semblance of peace."},{"name":"TRISTOL","text":"Well, we <span class=\"emphasis\">did</span> at any rate─until Mt. Gulg broke away from the earth. Then just as suddenly, the Ladder started moving again..."},{"name":"ALISAIE","text":"And you feared whoever was coming up would threaten your lives."},{"name":"TRISTOL","text":"Aye... But I see now there's no cause for concern. Will you tell me what has brought you here?"},{"name":"TRISTOL","text":"So Vauthry is a sin eater, and he's fled to Mt. Gulg..."},{"name":"TRISTOL","text":"'Tis a strange tale, but I have no reason to doubt your words."},{"name":"TRISTOL","text":"I owe you my life. If there is anything I can do to help, you need but say the word."},{"name":"ALPHINAUD","text":"Your help would be most welcome, Tristol. To begin with, we request your people's permission to reconnoiter the area."},{"name":"ALPHINAUD","text":"If we are to confront Vauthry, we must find a way to reach Mt. Gulg."},{"name":"TRISTOL","text":"Of course, you hardly need our permission to be here. I will tell the others about you and yours."},{"name":"TRISTOL","text":"Now, we haven't much to offer in the way of hospitality, but our village is at your disposal. Please use it as you see fit in your quest."}],"reward":{"gil":1157},"reqs":{"jobs":[{"lvl":78,"id":142}],"quests":[69169]},"next":[69079,69080,69081,69171]},"partials":[{"type":"npc","id":"1030197","obj":{"i":1030197,"n":"Urianger","l":2954,"q":2}},{"type":"npc","id":"1030211","obj":{"i":1030211,"n":"Alphinaud","l":2954,"q":1}},{"type":"quest","id":"69169","obj":{"i":69169,"n":"The Ladder","g":8,"l":"Eulmore","s":850}},{"type":"quest","id":"69079","obj":{"i":69079,"n":"Supplying Estimates","g":114,"l":"Kholusia","s":8020}},{"type":"quest","id":"69080","obj":{"i":69080,"n":"Good, Honest Dirt","g":114,"l":"Kholusia","s":8001}},{"type":"quest","id":"69081","obj":{"i":69081,"n":"Sisterly Concern","g":114,"l":"Kholusia","s":8010}},{"type":"quest","id":"69171","obj":{"i":69171,"n":"In Mt. Gulg's Shadow","g":8,"l":"Kholusia","s":870}}]}