{"quest":{"name":"The Light of Inspiration","location":"The Tempest","id":69186,"patch":5.0,"sort":1020,"eventIcon":71201,"issuer":1030225,"target":1030586,"genre":8,"journal":["Y'shtola seems eager to share your discoveries with the others."],"objectives":["Speak with Paushs Ooan.","Search for Grenoldt.","Approach Grenoldt and /psych him up.","Present something inspiring to Grenoldt."],"dialogue":[{"name":"YSHTOLA","text":"Thank you for assisting me with my investigations. I shall seek out our companions and share what we have learned."},{"name":"YSHTOLA","text":"...Much as I would like to tell you to sit down and leave the rest to us, your condition demands that we make all reasonable haste."},{"name":"YSHTOLA","text":"If you are not too weary, it may be useful to speak with Paushs Ooan again, and ask if there is aught else he is willing to divulge."},{"name":"PAUSHSOOAN","text":"Ah, Alphinaud's friend. You and your companions have done much to repair the damage caused when the waters parted..."},{"name":"PAUSHSOOAN","text":"...Anything elssse you can do? Hmmm... Have you been to the Walls of the Forgotten?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I...think I've just come from them."},{"name":"A1","text":"Are they the ruins to the northwest?"},{"name":"PAUSHSOOAN","text":"The remnants to the northwest, yesss? You visited them unbidden? Pshhh... Could it be that your footsteps were guided by the ancientsss...?"},{"name":"PAUSHSOOAN","text":"Yesss, that is the sacred site of which I ssspeak. Could it be that your footsssteps were guided there by the ancientsss...?"},{"name":"PAUSHSOOAN","text":"I believe it may be ssso. Listen then, and I will tell you of our plans to bring light to the Walls, that we might answer the shining call of the illuminated land."},{"name":"PAUSHSOOAN","text":"We have requested a finless craftsman to shape for us a sssacred lamp. He is odd for a land-dweller, choosing as he does to live in the ocean, but his ssskill is beyond question."},{"name":"PAUSHSOOAN","text":"It is concerning, however, that we have heard nothing of his progress. If you were to visit this artisan and return with our long-awaited light, then any doubt as to your purpossse would be laid to ressst."},{"name":"PAUSHSOOAN","text":"His name is “Grenoldt.” You will find his workshop in a metal structure to the sssouth."},{"name":"PAUSHSOOAN","text":"Go, visit Grenoldt in his “Workbench.” Bring back the lamp we asssked for, and all will be as the ancients desired."},{"name":"GRENOLDT","text":"Oh, that's just <span class=\"emphasis\">great</span>, that is. Me mind's playin' tricks on me now. “Look, Grenoldt! Someone's come to visit ye <span class=\"emphasis\">at the bottom o' the bleedin' ocean</span>!”"},{"name":"GRENOLDT","text":"Or might be as yer a ghost, eh? Go on, foul shade, feast yerself on me rotten soul..."},{"name":"GRENOLDT","text":"I've got no use for it. A craftsman what can't craft is more pointless than a sea slug with a domin' hammer. An' that's an insult to bloody sea slugs..."},{"name":"SYSTEM","text":"Grenoldt appears to be suffering from a crushing bout of self-doubt. Maybe you can help <span class=\"highlight\">psych</span> him up."},{"name":"GRENOLDT","text":"Worthless, that's what I am..."},{"name":"SYSTEM","text":"Grenoldt appears to be suffering from a crushing bout of self-doubt. Maybe you can help <span class=\"highlight\">psych</span> him up."},{"name":"GRENOLDT","text":"What is it ye want, specter? If yer not here to end me misery, then bugger off back to damnation..."},{"name":"GRENOLDT","text":"...Eh? Ye wouldn't be tryin' to raise me spirits now, would ye, spirit? Not what ye'd expect from a servant o' the netherworld..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Has it really come to this...?"},{"name":"A2","text":"Have we met before?"},{"name":"A2","text":"Are you Grenoldt, then?"},{"name":"A2","text":"Have we met before?"},{"name":"GRENOLDT","text":"...What's that supposed to mean? Not impressed with what ye see, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>?"},{"name":"GRENOLDT","text":"Aye, well...I may have let meself go a bit. This was meant to be me underwater sanctuary─a place where I could concentrate on me work, far from the distractions o' the outside world..."},{"name":"GRENOLDT","text":"Er... Might be as we crossed paths back in the Crystarium, but I don't reckon we've been formally introduced."},{"name":"GRENOLDT","text":"Name's Grenoldt. An' this here's meant to be me underwater sanctuary─a place where I can give meself over to me work, far from the distractions o' the outside world..."},{"name":"GRENOLDT","text":"Aye. Though I wonder how ye bloody well found me..."},{"name":"GRENOLDT","text":"This here's meant to be me underwater sanctuary─a place where I can give meself over to me work, far from the distractions o' the outside world..."},{"name":"GRENOLDT","text":"...An' yet, here ye stand. Now what's so damned important that ye'd dive all the way down to the bottom o' the bleedin' Tempest to bother me?"},{"name":"GRENOLDT","text":"Ah... The Ondo's lamp..."},{"name":"GRENOLDT","text":"Gods curse me empty head! I've not so much as made a start!"},{"name":"GRENOLDT","text":"I'm worth less than a sea slug... Nay, the <span class=\"emphasis\">slime</span> left by a sea slug. Me delivery date's long past, me workbench is untouched... An' I call meself a bleedin' artisan!"},{"name":"GRENOLDT","text":"Ye've heard their beliefs, have ye? Bringin' light to them ruins'll be an act of <span class=\"emphasis\">deep religious an' cultural significance</span>!"},{"name":"GRENOLDT","text":"An' it was my privilege as a craftsman to be tasked with providin' a ritual instrument worthy o' the occasion. But I just...can't...bloody well..."},{"name":"GRENOLDT","text":"GAAAH! Me mind's a bleedin' blank! It's like I've pissed away me last drop of inspiration!"},{"name":"GRENOLDT","text":"Tell me ye've got summat to show me─summat as'll give me muse a right good kick up the arse...?"},{"name":"GRENOLDT","text":"The Ondo want to honor the comin' o' these ancients, so their answerin' light's got to blaze with the right kind o' brightness."},{"name":"GRENOLDT","text":"Like...like the spark o' life caught in a crystal. But just bein' sparkly's not enough─it's got to dance with joy an' sorrow an' a sense o' hardship endured... Ye know what I mean!?"},{"name":"SYSTEM","text":"Your thoughts turn to the Warriors of Light from the First, and the crystals you discovered at the end of their journeys. Maybe Grenoldt would find them inspiring..."},{"name":"SYSTEM","text":"Your thoughts turn to Branden, and the crystal you discovered at the end of his journey. Maybe Grenoldt could find inspiration in that..."},{"name":"SYSTEM","text":"Your thoughts turn to Lamitt, and the crystal you discovered at the end of her journey. Maybe Grenoldt could find inspiration in that..."},{"name":"SYSTEM","text":"Your thoughts turn to Renda-Rae, and the crystal you discovered at the end of her journey. Maybe Grenoldt could find inspiration in that..."},{"name":"SYSTEM","text":"Your thoughts turn to Nyelbert, and the crystal you discovered at the end of his journey. Maybe Grenoldt could find inspiration in that..."},{"name":"SYSTEM","text":"Grenoldt seeks a particular kind of inspiration─the kind that crystallizes only at the culmination of a long and tragic tale."},{"name":"SYSTEM","text":"Complete any of the role quest lines available at the Wandering Stairs in the Crystarium, then return to Grenoldt once more."},{"name":"GRENOLDT","text":"It's no good...<br>I need summat <span class=\"emphasis\">special</span> to light a fire under me piss-sodden imagination."},{"name":"GRENOLDT","text":"Like...like the spark o' life caught in a crystal. But just bein' sparkly's not enough─it's got to dance with joy an' sorrow an' a sense o' hardship endured... Ye know what I mean!?"},{"name":"SYSTEM","text":"Grenoldt seeks a particular kind of inspiration─the kind that crystallizes only at the culmination of a long and tragic tale."},{"name":"SYSTEM","text":"Complete any of the role quest lines available at the Wandering Stairs in the Crystarium, then return to Grenoldt once more."},{"name":"GRENOLDT","text":"I've let the Ondo down, aye... But more'n that I've let <span class=\"emphasis\">meself</span> down. Might as well go back to mendin' kettles..."},{"name":"A3","text":"Show Grenoldt a crystal which once belonged to one of Ardbert's companions?"},{"name":"GRENOLDT","text":"...Wh-What's that ye've got there!?"},{"name":"GRENOLDT","text":"Such strikin' beauty... It shines with heartache an' laughter an' the transience o' life, like the turmoil o' history made manifest!"},{"name":"GRENOLDT","text":"Aye, I can see the brilliance o' the crystal's legacy! Ahhh...ye'd never capture such a gleam, not if ye labored a hundred years..."},{"name":"GRENOLDT","text":"But bugger me if I don't mean to try! Where're me tools, gods damn ye!? I must set to work before the feelin' fades!"}],"reward":{"gil":949},"reqs":{"jobs":[{"lvl":79,"id":142}],"quests":[69185]},"next":[69187]},"partials":[{"type":"npc","id":"1030225","obj":{"i":1030225,"n":"Y'shtola","l":2958,"q":2}},{"type":"npc","id":"1030586","obj":{"i":1030586,"n":"Grenoldt","l":2958,"q":2}},{"type":"quest","id":"69185","obj":{"i":69185,"n":"City of the Ancients","g":8,"l":"The Tempest","s":1010}},{"type":"quest","id":"69187","obj":{"i":69187,"n":"The Illuminated Land","g":8,"l":"The Tempest","s":1030}}]}