{"quest":{"name":"A Greater Purpose","location":"The Tempest","id":69189,"patch":5.0,"sort":1050,"eventIcon":71201,"issuer":1030554,"target":1030558,"genre":8,"journal":["Alphinaud is awaiting the return of your other companions."],"objectives":["Speak with the administrative clerk.","Wait at the designated location.","Speak with the administrative clerk.","Submit the visitor's writ application to the secretariat clerk.","Find an empty seat.","Speak with the secretariat clerk.","Show the visitor's writ to Thancred."],"dialogue":[{"name":"ALISAIE","text":"Well, that was an experience. I'm not sure I care for being treated like a child, but it did make asking questions less suspicious, I suppose."},{"name":"ALPHINAUD","text":"We can compare notes once the others return. Hopefully then our next move will become clear..."},{"name":"YSHTOLA","text":"'Twould seem our conversations were much alike: a looming disaster, creation magicks running rampant, and this Convocation's efforts to bring salvation out of chaos."},{"name":"ALPHINAUD","text":"I suppose there was talk of little else in the time when these events came to pass."},{"name":"YSHTOLA","text":"Ah, Urianger, if I may. What are your thoughts on the ancients' art of creation?"},{"name":"URIANGER","text":"A fascinating discipline, indeed. Aught the mind can conceive may be rendered in reality─all that is required is a clear “concept” upon which to focus one's will."},{"name":"URIANGER","text":"'Tis not dissimilar to the primal rites taught by the Ascians, wherein ritual ceremony breatheth life into figments of myth and legend."},{"name":"YSHTOLA","text":"I see we arrived at the same conclusion, then."},{"name":"YSHTOLA","text":"The people who lived in the age before the sundering were blessed with vast reserves of mana..."},{"name":"YSHTOLA","text":"No matter how draining these creation magicks must be, it seems they paid the cost with naught more than a fraction of the aether which coursed through their own bodies."},{"name":"YSHTOLA","text":"If we were to attempt the same, such spells would soon deplete our energies, and then seek to draw the balance from elsewhere─from a hoard of crystals, mayhap, or from the very land itself."},{"name":"YSHTOLA","text":"Thus when this art of creation was placed into our hands, it became, in effect, a means for destruction."},{"name":"ALISAIE","text":"An interesting matter which no doubt bears further study. But despite all these revelations, I worry we are no closer to finding Emet-Selch."},{"name":"ALISAIE","text":"Has anyone learned aught which might lead us to his location?"},{"name":"THANCRED","text":"Not directly, mayhap, but from what we've heard, it seems the Convocation of Fourteen is sequestered in the nearby Capitol building."},{"name":"RYNE","text":"When we went to see for ourselves, the attendant wouldn't let us through without a writ of permission..."},{"name":"RYNE","text":"So we tried our luck at the Bureau of the Administrator, where we thought these permissions might be issued. But the clerk there said he couldn't help us since our names didn't appear in the registry..."},{"name":"THANCRED","text":"And that was where we gave up. I wonder, though, <span class=\"highlight\">Forename</span>... Could <span class=\"emphasis\">you</span> be eligible for one of these writs?"},{"name":"THANCRED","text":"The voice in the lift seemed to know who you were─it might be that your name is registered at the bureaus as well. Worth a look, I'd say."},{"name":"THANCRED","text":"Meanwhile, I'll head back to the Capitol and search for a less “official” point of entry. Just in case."},{"name":"URIANGER","text":"Pray allow me to accompany thee on thy reconnaissance. An arcane perspective may prove needful."},{"name":"RYNE","text":"Ahem, I... I think I'd like to speak with more of these ancients. Maybe they know something that could help cure <span class=\"highlight\">Forename</span>'s condition."},{"name":"RYNE","text":"...Would you mind coming with me?"},{"name":"ALISAIE","text":"Of course I don't mind! Just lead the way!"},{"name":"ALPHINAUD","text":"Then Y'shtola and I will busy ourselves with further exploration. There is surely more intelligence to be had."},{"name":"ALPHINAUD","text":"And so we part ways once more... This time, however, let us reconvene in front of the Capitol."},{"name":"OFFICIALA03653","text":"<span class=\"highlight-purple\">...A visitor's writ? Yes, I can assist you. Full name, please.</span>"},{"name":"OFFICIALA03653","text":"<span class=\"highlight-purple\">...<span class=\"highlight\">Forename Surname</span>. Please wait near the counter while I confirm your details.</span>"},{"name":"OFFICIALA03653","text":"<span class=\"highlight-purple\">One moment, please. I need to check your details against the registry.</span>"},{"name":"OFFICIALA03653","text":"(-Administrative Clerk-)<span class=\"highlight-purple\"><span class=\"highlight\">Forename Surname</span>. Your application is ready for collection.</span>"},{"name":"OFFICIALA03653","text":"<span class=\"highlight-purple\">As your residency was approved by Emet-Selch himself, further forms of identification will not be required.</span>"},{"name":"OFFICIALA03653","text":"<span class=\"highlight-purple\">Here are your application documents. Submit them at the Bureau of the Secretariat and the clerk will issue you with a visitor's writ for the Capitol.</span>"},{"name":"OFFICIALA03653","text":"<span class=\"highlight-purple\">Your visitor's writ will be issued at the Bureau of the Secretariat. Just submit those application documents to the clerk on duty...</span>"},{"name":"AMAUROTADMINISTRATOR","text":"<span class=\"highlight-purple\">Next, please...</span>"},{"name":"AMAUROTADMINISTRATOR","text":"<span class=\"highlight-purple\">...Visiting the Capitol, are we? Please take a seat. Your name will be called once your application has been processed.</span>"},{"name":"AMAUROTADMINISTRATOR","text":"<span class=\"highlight-purple\">I will process your application in turn. Please take a seat so that others might state their business.</span>"},{"name":"AMAUROTADMINISTRATOR","text":"<span class=\"highlight-purple\">...Your visitor's writ, as requested.</span>"},{"name":"AMAUROTADMINISTRATOR","text":"<span class=\"highlight-purple\">When you wish to gain admittance to the Capitol, simply present the document to the attendant within.</span>"},{"name":"AMAUROTADMINISTRATOR","text":"<span class=\"highlight-purple\">It seems no else is waiting. My duty is done for another day...</span>"},{"name":"ALPHINAUD","text":"Y'shtola and I have just returned from an institution the locals called the “Akadaemia Anyder.” Well, from its public offices, at least."},{"name":"ALPHINAUD","text":"We thought an Ascian place of learning the ideal spot to research your condition, but it seems we lacked the credentials to enter the Akadaemia proper..."},{"name":"ALISAIE","text":"Ah, <span class=\"highlight\">Forename</span>..."},{"name":"RYNE","text":"..."},{"name":"URIANGER","text":"...Master Thancred can best describe our chances for infiltrating the Capitol. I only hope thine efforts to secure permissions were successful."},{"name":"YSHTOLA","text":"Ah, good, you're here. Everyone seems to be present and accounted for..."},{"name":"THANCRED","text":"Finally! You were gone so long, I was on the verge of mounting a rescue party. How fared you in your bureaucratic ventures?"},{"name":"THANCRED","text":"Ah, I see my instincts were correct!"},{"name":"THANCRED","text":"And a good thing, too. Urianger and I weighed our chances of breaking into the Capitol, and an official entrance is by far the more attractive option."},{"name":"URIANGER","text":"The Capitol boasteth not a single armed sentry. 'Twould seem that in their time, they did not deem it needful to post guards."},{"name":"URIANGER","text":"The windows and doors, however, appear heavily warded. Though mightily did we strive, with strength mundane and magical, we failed to budge them even a fraction of one ilm. Mayhap 'twas simply the case that Emet-Selch's recreation did not extend to their usual function."},{"name":"THANCRED","text":"We didn't try <span class=\"emphasis\">everything</span>, of course, but we thought it best to conserve our time and energy for more pressing matters."},{"name":"ALISAIE","text":"...Speaking of which, Ryne and I tried asking about a cure for you."},{"name":"ALISAIE","text":"The problem is, these ancients didn't exist beyond Amaurot's “today.” They will happily tell their own tales, but whenever we attempted to explain our situation, the conversation quickly became muddled..."},{"name":"YSHTOLA","text":"What of you, <span class=\"highlight\">Forename</span>? Was aught worthy of interest said during your efforts to obtain a writ?"},{"name":"ALPHINAUD","text":"A great sacrifice of life in exchange for their brethren's resurrection... And you say all the Ascians' scheming has been leading to this!?"},{"name":"ALPHINAUD","text":"All this time... But if they still mean to enact this plan, then things won't end with the Rejoining..."},{"name":"YSHTOLA","text":"...Aye, I thought we knew their intentions in full: restore the world to its former glory, and, in turn, empower Zodiark to reclaim His throne as the will of the star."},{"name":"YSHTOLA","text":"Yet that was merely a step along the way. I hesitate to put it into words, but we have to assume that following the final Rejoining, the Ascians mean to draw on the lives of the Source to make their sacrifice to Zodiark."},{"name":"ALPHINAUD","text":"That does seem the most likely scenario. Mayhap those who ally with the Ascians would be spared that fate..."},{"name":"ALPHINAUD","text":"But what value is there in surviving when all our history, all our struggles will be erased? I cannot conscience such an act."},{"name":"ALISAIE","text":"Of course not. And that's to say naught of what Emet-Selch plans for the Exarch's power. Do we stand by and let him threaten our future as well as our past?"},{"name":"ALISAIE","text":"We need to find him, <span class=\"highlight\">Forename</span>. And when we do..."},{"name":"ALISAIE","text":"Make your mark. Change the course of history in a way that's felt by those who came before, and those who came after; by everyone you've ever met."},{"name":"ALISAIE","text":"Change things so that even my other self, dying somewhere in that future Calamity will smile and say, “I knew you would win.”"},{"name":"RYNE","text":"...Is fighting Emet-Selch the only way?"},{"name":"RYNE","text":"He created an <span class=\"emphasis\">entire city.</span> It will take everything we have to defeat him...if we even can."},{"name":"RYNE","text":"And if you push that hard in your current state, the Light <span class=\"emphasis\">will</span> break free..."},{"name":"YSHTOLA","text":"The decision to press on lies with you. Just as it lies with each and every one of us..."}],"reward":{"gil":2370,"aetherCurrent":1,"items":[{"num":2,"id":25188},{"num":3,"id":25197,"one":1},{"num":3,"id":25198,"one":1},{"num":3,"id":25190,"one":1},{"num":3,"id":25186,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69188]},"next":[69190]},"partials":[{"type":"npc","id":"1030554","obj":{"i":1030554,"n":"Alphinaud","l":2958,"q":2}},{"type":"npc","id":"1030558","obj":{"i":1030558,"n":"Thancred","l":2958,"q":1}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"69188","obj":{"i":69188,"n":"The End of a World","g":8,"l":"The Tempest","s":1040}},{"type":"quest","id":"69190","obj":{"i":69190,"n":"Shadowbringers","g":8,"l":"The Tempest","s":1060}}]}