{"quest":{"name":"The Illuminated Land","location":"The Tempest","id":69187,"patch":5.0,"sort":1030,"icon":100927,"eventIcon":71201,"issuer":1030586,"target":1030344,"genre":8,"journal":["Grenoldt is brimming with newfound inspiration.","Grenoldt channels his newfound inspiration into crafting a suitably splendid lamp for the Ondo's planned devotions. Pleased with the results, he proceeds to share the cause of his recent slump, explaining how the perfection of the ancients' works had stolen his will to craft. Thanks to the crystal you showed him, however, Grenoldt now claims to be overflowing with creativity─enough to weave the strength of bittersweet sagas into armaments you can use. An intriguing proposal, but one which might have to wait until you've delivered the artisan's lamp to the Ondo chieftain.","You deliver Grenoldt's lamp to Tolshs Aath, and the grateful chieftain recognizes you and your companions as the sign they have been waiting for. You are invited to gather at the Walls of the Forgotten, and, after witnessing the Ondo's devotions, Tolshs Aath appoints a guide to show you the way to the “illuminated land.” ","You greet the Ondo guide, and he directs you towards a tunnel leading downwards. It seems your comrades are already assembled below, and eagerly await the guide's directions.","You listen patiently as your guide explains the path you are to take. Judging by his description, the trek to the illuminated land will be no simple undertaking...","You meet Urianger on the floor of the first cavern, and he suggests a careful progression of scouting and relaying directions to those who come behind. Y'shtola waits ahead, the next link in the chain you are to follow.","Alphinaud hesitates before a thick growth of white coral, explaining that there are two possible routes forward: the winding coral branch, or the path along the rocks to the south.","Your dogged footsteps eventually lead you to Alisaie, who claims to have found the entrance to the Caliban Gap. If the guide is to be believed, you need only traverse this last passage before arriving at your destination.","You and your companions gather at the mouth of the tunnel, and Alphinaud bids you dispel the Ondo's barrier. The glowing wall quickly dissipates, clearing the way to complete the last leg of your journey.","As you exit the Caliban Gap, you are greeted by the spectacle of a vast city. Y'shtola describes the monumental enchantment that blazes before her aether-sensitive gaze, and your party is left momentarily awestruck.","Y'shtola points out the similarities in design between the remnants you have seen and the buildings which now tower before you. It is, without a doubt, a construction of the ancients, but upon the ruins has been draped the semblance of the city which once stood there. And somewhere, hidden within this enchanted metropolis, awaits Emet-Selch and the captive Exarch..."],"objectives":["Deliver Grenoldt's lamp to Tolshs Aath.","Speak with the Ondo guide.","Speak with Urianger.","Speak with Alphinaud.","Speak with Alisaie.","Proceed towards the end of the Caliban Gap.","Speak with Y'shtola."],"dialogue":[{"name":"GRENOLDT","text":"I can feel it! A vision formin' in me mind! Step aside, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, an' let me itchin' hands get to work!"},{"name":"GRENOLDT","text":"...An' done!"},{"name":"GRENOLDT","text":"I've taken the wonders that crystal showed me, an' channeled 'em into a new shape what befits the Ondo's spiritual character."},{"name":"GRENOLDT","text":"Not a bad job, if I do say so meself."},{"name":"GRENOLDT","text":"...An' to think, I was <span class=\"emphasis\">this</span> close to hangin' up me hammer after studyin' the craft o' them ancients."},{"name":"GRENOLDT","text":"I've been across the length an' breadth o' Norvrandt, an' gobbled up every scrap o' craftin' wisdom what I could find."},{"name":"GRENOLDT","text":"But no matter which technique I tried, me work was jus' no comparison. I couldn't even figure out how they put them damn buildings together."},{"name":"GRENOLDT","text":"A mystery for the ages─that's what drew me here in the first place. I built me workshop, got the forges burnin'...then lost me bleedin' will to craft."},{"name":"GRENOLDT","text":"Thank the gods for that crystal o' yers, or I might never have gotten it back."},{"name":"GRENOLDT","text":"I won't pry into yer business, but I reckon yer little miracle there has been through the kind o' journey they sing songs about. The echoes o' the memory it holds jus' speak directly to yer heart..."},{"name":"GRENOLDT","text":"Aye, I can still feel 'em coursin' through me! The inspiration's not fadin' away─it's wellin' up stronger an' stronger!"},{"name":"GRENOLDT","text":"Give me the chance, an' I reckon I can weave the crystal's saga into other things as well!"},{"name":"GRENOLDT","text":"...But bugger me, I'd almost forgotten the Ondo's commission. If ye could drag that lamp over to Tolshs Aath for me, I'll stay here an' dream up new armaments for ye to try."},{"name":"SYSTEM","text":"You now have access to Grenoldt's forge. Equipment rewards will become available for collection based on the role quests you have completed."},{"name":"TOLSHSAATH","text":"...What is it that you have there?"},{"name":"TOLSHSAATH","text":"...The sssacred lamp! Then the finless one has kept his promise..."},{"name":"TOLSHSAATH","text":"My people tell me of the many deeds you have performed in the name of aiding the Cups. And now you come to me, bearing the light we had almost surrendered hope of ever ssseeing..."},{"name":"TOLSHSAATH","text":"We can doubt your purity no longer─your arrival was the will of the ancients!"},{"name":"TOLSHSAATH","text":"Yes, the time for fear has passed. We shall take the lamp, and unveil its austere illumination upon the Walls of the Forgotten."},{"name":"TOLSHSAATH","text":"Gather there with your companions, and we shall ssspeak again once our prayers have been offered."},{"name":"TOLSHSAATH","text":"A guide awaits you at the entrance to the Cups. He will show you the way to the illuminated land."},{"name":"GUIDEOFONDO03651","text":"The chieftain has bid me guide your steps to the illuminated land."},{"name":"GUIDEOFONDO03651","text":"Come, the way lies downwards. Follow the path of coral and rock, and join your comrades below."},{"name":"ALPHINAUD","text":"We're on our way at last!<br>Hm, it seems far darker down here, but I'll not start at a few shadows. ...We <span class=\"emphasis\">are</span> moving as a group, yes?"},{"name":"ALISAIE","text":"If Emet-Selch is in that trench, then we'll have to assume he's not swimming in saltwater. I wouldn't want to suddenly find ourselves at the edge of Bismarck's bubble with no air to breathe..."},{"name":"THANCRED","text":"During the time I've spent helping the Ondo, I've been introduced to quite a few of the local varieties of sealife..."},{"name":"THANCRED","text":"Although “sea monsters” is mayhap the more apt term. Probably best to avoid them, if we can."},{"name":"RYNE","text":"Meeting the Ondo was fascinating. They live just like us in some ways, but act completely different in others. The way they think, the way they play..."},{"name":"RYNE","text":"I'd love to come back here and learn more about their culture. Will the dome last that long, I wonder...?"},{"name":"URIANGER","text":"Emet-Selch hath made himself difficult to reach, yet every step we take bringeth us nearer to his stronghold. Let us not linger, lest the Exarch suffer for our late arrival."},{"name":"YSHTOLA","text":"You have everything you need? If that artisan fellow is as skilled as they say, then you may wish to avail yourself of his services ere we press on."},{"name":"GUIDEOFONDO03651","text":"All are gathered, yes? Then I shall describe the path you mussst take."},{"name":"GUIDEOFONDO03651","text":"Enter the cavern beyond, and follow the wall down, and down, and down... Once at the bottom, find a passage to the northwest, then continue west, and west, and west..."},{"name":"GUIDEOFONDO03651","text":"The way is not sssimple. Keep your friends within shouting distance, and do not ssstray into the deep."},{"name":"GUIDEOFONDO03651","text":"Jussst before the journey's end you will find the Caliban Gap and the barrier we placed at its mouth. This obstacle will fade should you raise a hand towards it─we have made it ssso."},{"name":"ALPHINAUD","text":"A most succinct explanation. We thank you for your guidance."},{"name":"ALISAIE","text":"Right! Deeper into the depths we go!"},{"name":"GUIDEOFONDO03651","text":"Once in the cavern beyond, you must follow the wall all the way down. At the bottom, you will find a passage to the northwest─follow it far, far to the west..."},{"name":"RYNE","text":"The rocks and coral bunch up by the cavern wall like a staircase of sorts, but be careful─you wouldn't want to slip from up here!"},{"name":"THANCRED","text":"Hmmm... I'd wager these bursts of water could carry you clear to the top again. Not that I'm eager to try it."},{"name":"URIANGER","text":"Our guide bade us travel to the cavern floor and thence to the west..."},{"name":"URIANGER","text":"Yet 'twould seem these twisting tunnels defy such simple instruction. Rather than rely on direction alone, I suggest we scout with care, and relay the path ahead to those who come behind."},{"name":"URIANGER","text":"Y'shtola hath forged ahead. Shall we continue our own advance?"},{"name":"YSHTOLA","text":"The rock drops off sharply here, but I should think this coral thick enough to serve as a bridge..."},{"name":"ALPHINAUD","text":"Ah, <span class=\"highlight\">Forename</span>. You have a choice of two routes from here."},{"name":"ALPHINAUD","text":"You can either take the long way to the south along the rocks, or skip along this coral branch as Alisaie has done. I, for one, shall be following my sister's example. Ahem... &lt;gulp&gt;"},{"name":"ALPHINAUD","text":"Phew... N-Naught to it! Alisaie has already gone on ahead─we should catch up to her."},{"name":"ALISAIE","text":"There you are. Come on, I think I've found the tunnel we were looking for!"},{"name":"ALISAIE","text":"Here. This must be the barrier the Ondo spoke of..."},{"name":"YSHTOLA","text":"...Well, that was rather more arduous than expected. I feel a sudden rush of gratitude for the smooth roads our ancestors cut through the wilderness."},{"name":"ALPHINAUD","text":"'Twas a treacherous path, indeed. Now, I believe one of us needs but raise a hand to banish this next obstacle?"},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>. I elect you to do the honors!"},{"name":"RYNE","text":"Gone, just like that! I suppose we should head in."},{"name":"THANCRED","text":"Like as not, this tunnel will be just as perilous as the road we walked to get here. Let's all stay aware of our surroundings, shall we?"},{"name":"ALPHINAUD","text":"Watch your footing here. I wouldn't envy the climb back up if you fell..."},{"name":"THANCRED","text":"Nay, I'd not want to chance that leap. Hugging the northern wall on the way down seems the wiser proposition."},{"name":"RYNE","text":"That...is a very long drop. Please, no heroic jumps over the edge, <span class=\"highlight\">Forename</span>─I don't think my heart could take it!"},{"name":"URIANGER","text":"Ware thy footfalls, my friend. Our road taketh us ever onwards, unto ever deeper darkness..."},{"name":"YSHTOLA","text":"If we weren't so pressed for time, I should like to explore these side passages. Mayhap another day."},{"name":"ALPHINAUD","text":"Emet-Selch holds the Exarch captive somewhere within that vast city... Yet even if we must search every alleyway, we will find them!"},{"name":"ALISAIE","text":"When the chieftain spoke of lights shining from the abyss, this is not at all what I imagined. Why would Emet-Selch do this...?"},{"name":"THANCRED","text":"It's big, I'll grant you. But cluttered city streets are far more conducive to infiltration than wide-open spaces. This will work to our advantage. Trust me."},{"name":"RYNE","text":"You'd think all those tall, dark buildings would be frightening, but for some reason they just make me feel sad..."},{"name":"URIANGER","text":"One cannot blame the Ondo for fleeing the spectacle of these brooding edifices. We, however, have not the luxury of fear..."},{"name":"YSHTOLA","text":"<span class=\"highlight\">Forename</span>, did you note the style of the architecture? 'Tis the same used for the remnants at the Cups and the mural's painted towers."},{"name":"YSHTOLA","text":"Look closely. Emet-Selch has not simply reclaimed these ruins...he has layered the semblance of an entire city upon them."},{"name":"YSHTOLA","text":"Gods, the magnitude of his artifice is staggering. Though it pains me to admit, we did not fully understand the feats of which an old world Ascian is capable..."}],"reward":{"gil":1635,"items":[{"num":2,"id":25187},{"num":3,"id":25197,"one":1},{"num":3,"id":25198,"one":1},{"num":3,"id":25190,"one":1},{"num":3,"id":25186,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69186]},"next":[69188]},"partials":[{"type":"npc","id":"1030586","obj":{"i":1030586,"n":"Grenoldt","l":2958,"q":2}},{"type":"npc","id":"1030344","obj":{"i":1030344,"n":"Y'shtola","l":2958,"q":1}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"69186","obj":{"i":69186,"n":"The Light of Inspiration","g":8,"l":"The Tempest","s":1020}},{"type":"quest","id":"69188","obj":{"i":69188,"n":"The End of a World","g":8,"l":"The Tempest","s":1040}}]}