{"quest":{"name":"In His Garden","location":"The Crystarium","id":69181,"patch":5.0,"sort":970,"eventIcon":71201,"issuer":1027232,"target":1030369,"genre":8,"journal":["Katliss looks at you with a concerned eye."],"objectives":["Take a moment to feel the wind upon your face.","Gather information on the Crystal Exarch.","Speak with Lyna at the Accensor Gate."],"dialogue":[{"name":"KATLISS","text":"...<span class=\"highlight\">Forename</span>, are you alright?"},{"name":"KATLISS","text":"I think a return to your sickbed might be in order. Ah, or you might consider resting a while atop the watchtower next to the rookery."},{"name":"KATLISS","text":"This damnable sky doesn't make for the most soothing scenery, but the Exarch often liked to stand there and feel the wind upon his face."},{"name":"KATLISS","text":"Whatever you decide to do, I suggest you do it slowly. You are not yet well..."},{"name":"SZEMDJENMAI","text":"Oho, I did not expect to see you on your feet so soon. Surely you have not come in search of an amaro...?"},{"name":"SZEMDJENMAI","text":"...What do I know of the Crystal Exarch? I am happy to share, but I fear there will be no surprising revelations. As any in this city could tell you, he is a man of wisdom and compassion and many untold secrets."},{"name":"SZEMDJENMAI","text":"But none can doubt his generosity. When the Crystarium was being constructed, he even allowed folk to plunder the tower for resources."},{"name":"SZEMDJENMAI","text":"He has imposed no restrictions upon us but one: no one except the Exarch is permitted to dwell within the spire."},{"name":"SZEMDJENMAI","text":"Many seasons past, a comrade of mine was bold enough to ask the reason why."},{"name":"SZEMDJENMAI","text":"The Exarch merely smiled and said, “Because one day, the Crystal Tower may vanish as suddenly as it arrived.”"},{"name":"SZEMDJENMAI","text":"To this very day, the tower remains as it always has, solid and imposing. Yet I do not think our steward's warning was a falsehood."},{"name":"SZEMDJENMAI","text":"And even if it were, none would dream of breaking that one rule and risk shattering the community we have worked so hard to build."},{"name":"CASSARD","text":"<span class=\"highlight\">Forename</span>! It is good to see you awake and alert, my friend!"},{"name":"CASSARD","text":"...What's this about? You're not writing the Exarch's memoirs, are you? I'm not sure how much I can tell you, considering we avoid asking too many questions. Unspoken rule, and all that."},{"name":"CASSARD","text":"Hmmm... If anyone has fresh insights to share, then it'd be Captain Lyna, I'd say."},{"name":"CASSARD","text":"She lost her parents to an eater attack not long after she was born, and the Exarch saw to her upbringing. Outward appearances aside, those two are like grandfather and granddaughter."},{"name":"CASSARD","text":"I imagine the news of his predicament hit her doubly hard...not that our proud captain would ever let it show. If you do decide to talk to Lyna, she'll be at her usual post at the Accensor Gate."},{"name":"CASSARD","text":"While we're on the subject, I'm concerned for that Alisaie of yours. I'd thought her face stormy on that ride back from Amh Araeng, but now...it's closer to a raging tempest."},{"name":"MOREN","text":"Oh, was there something else you needed? If you've come for the results of my research into this persistent Light, I'm afraid there's little to tell as of yet..."},{"name":"MOREN","text":"...Records pertaining to the Exarch? Well, I need no documentation to relay what little I know of his history, if that is what interests you."},{"name":"MOREN","text":"Ahem. Less than a decade had passed since the coming of the Flood when the Crystal Tower first flashed into existence. Its summoner─the Exarch himself─became known to the refugees in Lakeland soon thereafter."},{"name":"MOREN","text":"He welcomed all who sought out the spire, be they locals who had lost their homes or Voeburtites fleeing their ruined kingdom, and together did they found the city which would become the Crystarium."},{"name":"MOREN","text":"Some thought to call him “king,” for he refused to share his name, but the summoner did not deem himself worthy of royal address."},{"name":"MOREN","text":"Thus did the people consider his scintillating skin, so alike to the tower he had summoned, and bestowed upon him the title of “Crystal Exarch.” As for his true name, well...'twould seem that is a mystery that remains unsolved to this day."},{"name":"MOREN","text":"Aye, the Exarch has ever been one to conceal his full appearance. Although I have, on occasion, spotted what could only have been a tail..."},{"name":"LYNA","text":"<span class=\"highlight\">Forename</span>, I was not told you had awoken!"},{"name":"LYNA","text":"A welcome surprise. Now, if only the Exarch was returned to us..."},{"name":"LYNA","text":"He was taken by this rival of yours, was he not? Your companions mentioned they had an idea of where to find him..."},{"name":"LYNA","text":"And so I bristled when they asked for patience. I did not understand their hesitation...until I saw that <span class=\"emphasis\">you</span> had fallen. Only then did I realize that I had no business rushing ahead."},{"name":"LYNA","text":"Even so, the delay has been no less agonizing..."},{"name":"LYNA","text":"In the moments before he left to join you in Kholusia, the Exarch entrusted me with a key."},{"name":"LYNA","text":"It opens a door in the Ocular, to a chamber known as the “Umbilicus.” This room is the heart of the tower, into which only the Exarch himself is permitted to enter."},{"name":"LYNA","text":"He bid me allow none into the tower once he had departed. Only in the event that an army of eaters descended upon the city was I to access the Umbilicus and awaken the defensive barrier."},{"name":"LYNA","text":"Never before had he left me with such instructions, but the battle with Vauthry loomed near, and at the time I accepted the key without much thought."},{"name":"LYNA","text":"Since then, however, that moment is all that occupies my mind."},{"name":"LYNA","text":"When I recall the look upon his face... He <span class=\"emphasis\">knew</span> that some terrible fate awaited him."},{"name":"LYNA","text":"Tell me, <span class=\"highlight\">Forename</span>! I need to know what he feared─what battle you and your companions are truly fighting!"},{"name":"LYNA","text":"...Forgive me. I trust in the Exarch, and I should not be voicing these doubts when he is not here to respond to them personally."},{"name":"LYNA","text":"But you have come to me with a question of your own, have you not?"},{"name":"LYNA","text":"Ah...I see I am not the only one who burns for answers."},{"name":"LYNA","text":"The time has come to open the tower's heart. Though we do not face an invasion of eaters, I suspect the city will be in far more danger if you do not gain the knowledge you seek."}],"reward":{"gil":1039},"reqs":{"jobs":[{"lvl":79,"id":142}],"quests":[69180]},"next":[69182]},"partials":[{"type":"npc","id":"1027232","obj":{"i":1027232,"n":"Katliss","l":2951,"q":4}},{"type":"npc","id":"1030369","obj":{"i":1030369,"n":"Lyna","l":2953,"q":2}},{"type":"quest","id":"69180","obj":{"i":69180,"n":"Reassuring the Masses","g":8,"l":"The Crystarium","s":960}},{"type":"quest","id":"69182","obj":{"i":69182,"n":"The Unbroken Thread","g":8,"l":"Lakeland","s":980}}]}