{"quest":{"name":"City of the Ancients","location":"The Tempest","id":69185,"patch":5.0,"sort":1010,"eventIcon":71201,"issuer":1030517,"target":1030225,"genre":8,"journal":["Y'shtola appears deep in thought."],"objectives":["Speak with Y'shtola.","Inspect the Ondo Cups from the survey point.","Use the mythril knife to collect scrapings from the remnant wall.","Speak with Y'shtola.","Find a structure which resembles those in the copy of the Qitana Ravel mural, then inspect it from the survey point.","Speak with Y'shtola."],"dialogue":[{"name":"YSHTOLA","text":"...Ah, <span class=\"highlight\">Forename</span>. Have you learned aught of note?"},{"name":"YSHTOLA","text":"Fascinating...and precisely the sort of information I was hoping to hear."},{"name":"YSHTOLA","text":"In fact, if you have a moment, I'd like to borrow your eyes to confirm a theory I've been working on. Come."},{"name":"YSHTOLA","text":"Now, there are two tasks I would have you perform."},{"name":"YSHTOLA","text":"The first requires you to inspect the buildings which surround the Ondo settlement, and note their most distinctive characteristics."},{"name":"YSHTOLA","text":"For the second, I wish you to use this knife to take scrapings from one of the remnant walls."},{"name":"YSHTOLA","text":"Pray be as thorough as you can. I shall be waiting here for the results of your investigations."},{"name":"YSHTOLA","text":"'Tis strange to be here, under the ocean. It seems a lifetime ago that we stood amidst the trees of Rak'tika..."},{"name":"SYSTEM","text":"Inspect the structures of the Ondo Cups for distinctive features. You may move the camera, as well as zoom in and out. Target a building and examine it with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"SYSTEM","text":"You set the point of the knife against the wall, but even after applying considerable pressure, you cannot remove so much as a flake of stone."},{"name":"YSHTOLA","text":"And what have you discovered?"},{"name":"YSHTOLA","text":"Yes, I would agree that the windows are most distinctive. 'Twould seem the structures appear the same to both your sight and mine..."},{"name":"YSHTOLA","text":"And you say you could not so much as scratch the wall? Even with all your might behind the blade?"},{"name":"YSHTOLA","text":"<span class=\"highlight\">Forename</span>, everywhere I turn in this place, my gaze is drawn by peculiar materials for which I do not have a name."},{"name":"YSHTOLA","text":"The buildings I had you investigate are prime examples. They may appear to be constructed of ordinary stone, but I assure you it is nothing of the sort..."},{"name":"YSHTOLA","text":"If pressed, I would describe the substance as a composite of several mineral properties, blended to create a material of unparalleled durability."},{"name":"YSHTOLA","text":"Even the Ronkan Empire, once the greatest power in Norvrandt, produced nothing which compares to this level of perfection."},{"name":"YSHTOLA","text":"But if not the Ronkans, then who? Who were these ancients the Ondo claim as the architects of their sanctuary?"},{"name":"YSHTOLA","text":"I suspect our answer lies with the reason Emet-Selch withdrew here to the Tempest."},{"name":"YSHTOLA","text":"He may simply have wished to retreat somewhere mere mortals would struggle to reach...but there are many such remote locations. Why here, specifically?"},{"name":"YSHTOLA","text":"Emet-Selch is devoted to his role, and thus we might assume his choice of stronghold somehow serves the Ascian agenda."},{"name":"YSHTOLA","text":"Or mayhap...'tis a place more dear to him than any other."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Are you saying this was built by ancient Ascians...?"},{"name":"A1","text":"Could this place provide power to Emet-Selch?"},{"name":"A1","text":"I couldn't say either way..."},{"name":"YSHTOLA","text":"That is my theory, that these structures are remnants of a time before history─of a star that was yet whole and unbroken."},{"name":"YSHTOLA","text":"That was my first thought as well. Yet no matter how superior the materials, a ruin is just a ruin. 'Tis naught that would decide a battle's outcome."},{"name":"YSHTOLA","text":"Which brings us to my second theory: that he has some other, more personal connection to this site. What if these structures are remnants of a time before history─of a star that was yet whole and unbroken?"},{"name":"YSHTOLA","text":"It is my theory that these structures are remnants of a time before history─of a star that was yet whole and unbroken."},{"name":"YSHTOLA","text":"Such traces in the Source would have been obliterated by the succession of Umbral Calamities, but here in the First they might have remained untouched for millennia..."},{"name":"YSHTOLA","text":"...A copy of the mural in the Qitana Ravel. Almet presented it to me during my visit to Fanow, after our victory in Kholusia."},{"name":"YSHTOLA","text":"Here, in the first scene...<br>By Emet-Selch's own words, it depicts a city of eons past and the disaster which befell it."},{"name":"YSHTOLA","text":"The design is much simplified, of course, but do you see the similarities between its towers and those you have just inspected?"},{"name":"YSHTOLA","text":"We are close to the truth, I feel. Let us search the surrounds for another tower─one which matches the picture near enough to remove all doubt."},{"name":"YSHTOLA","text":"From what I have seen, naught more than sand and more sand lies to the east, and the south held no such structures. I suggest we try our luck further to the northwest."},{"name":"SYSTEM","text":"You may view the Qitana Ravel mural at any time during this quest by using the relevant item in the <span class=\"highlight\">Key Items</span> menu."},{"name":"SYSTEM","text":"The quest destination will not be displayed on the map. You must search for a structure which resembles the buildings in the mural, then inspect it from the survey point. The survey point will be found nearby, in a location which allows a full view of the structure."},{"name":"SYSTEM","text":"Search for a structure which resembles one of the buildings in this mural, then inspect it from the survey point. The survey point will be found nearby, in a location which allows a full view of the structure."},{"name":"SYSTEM","text":"According to Y'shtola's investigations, the area further northwest of the Ondo Cups may be a good place to start."},{"name":"YSHTOLA","text":"Aye... This is the mural writ large..."},{"name":"YSHTOLA","text":"Though I cannot guess at its purpose, it must have been an imposing sight. How much of the tower's height lies hidden beneath the ground, I wonder..."},{"name":"YSHTOLA","text":"Centuries of our history have settled upon such ruins. Countless layers of dust and sediment..."},{"name":"YSHTOLA","text":"...An entire civilization, its existence forgotten by all except a handful of Ascians."},{"name":"YSHTOLA","text":"And yet it did exist. They lived here, in this city..."},{"name":"YSHTOLA","text":"But let us focus on what we've learned thus far. The Ondo chieftain spoke of mysteries stirring─of a land illuminated."},{"name":"YSHTOLA","text":"Judging by his words, he believes this phenomenon related to the ancients' return."},{"name":"YSHTOLA","text":"Thus can we surmise that what the Ondo saw shining in the abyss was, in all likelihood, yet another remnant of this age-old civilization."},{"name":"YSHTOLA","text":"And who else would “light the lanterns” as Ryne put it, than Emet-Selch himself? 'Tis almost certain he is there!"},{"name":"YSHTOLA","text":"But if we are to find this stronghold in a timely manner, it seems gaining the Ondo's trust remains our swiftest path forward."},{"name":"YSHTOLA","text":"I only hope our deeds are enough to win them over..."}],"reward":{"gil":968},"reqs":{"jobs":[{"lvl":79,"id":142}],"quests":[69184]},"next":[69186]},"partials":[{"type":"npc","id":"1030517","obj":{"i":1030517,"n":"Y'shtola","l":2958,"q":1}},{"type":"npc","id":"1030225","obj":{"i":1030225,"n":"Y'shtola","l":2958,"q":2}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}},{"type":"quest","id":"69186","obj":{"i":69186,"n":"The Light of Inspiration","g":8,"l":"The Tempest","s":1020}}]}