{"quest":{"name":"Waiting in the Depths","location":"The Tempest","id":69184,"patch":5.0,"sort":1000,"eventIcon":71201,"issuer":1030336,"target":1027758,"genre":8,"journal":["Thancred casts his gaze across the waterless expanse before you."],"objectives":["Search for anything unusual on the Norvrandt Slope.","Speak with the Ondo youth.","Speak with Alphinaud.","Defeat blue swimmers.","Speak with Paushs Ooan."],"dialogue":[{"name":"ALPHINAUD","text":"Bismarck must be powerful indeed to create a dome of this size. I can only pray to whichever gods are listening that it continues to hold..."},{"name":"ALISAIE","text":"I remember being impressed by the domes of the Ruby Sea, but this makes them look like bubbles in a stream!"},{"name":"URIANGER","text":"Come, let us begin our search."},{"name":"RYNE","text":"This is <span class=\"emphasis\">amazing</span>. I can't even see the surface!"},{"name":"YSHTOLA","text":"I daresay Urianger endured much “playful” attention from the pixies to learn the lore of Bismarck. He is nothing if not a dedicated scholar."},{"name":"THANCRED","text":"Now, as for where we should be looking, I rather doubt Emet-Selch will be sitting around out in the open."},{"name":"THANCRED","text":"I propose we follow the slope down towards the deeper trenches, and keep an eye out for rock formations large enough to house a stronghold."},{"name":"THANCRED","text":"Let's be off, then─but watch your footing. The ground is still wet, and like to be slippery."},{"name":"ALISAIE","text":"I think Thancred has the right idea, but I can't help wondering what Emet-Selch would be doing down here without the aid of gills and fins."},{"name":"URIANGER","text":"Hm. This outcrop seemeth natural enough..."},{"name":"YSHTOLA","text":"The ocean floor is a strange place to be, of course, but this aether...'tis like naught I've ever seen."},{"name":"ALPHINAUD","text":"Naught out of the ordinary here...as far as I can tell."},{"name":"THANCRED","text":"What about that large formation over there...?"},{"name":"RYNE","text":"The gloom down here is so suffocating compared to that endless night sky we saw... But I suppose Emet-Selch had nowhere else to go."},{"name":"MANOFONDO03648","text":"&lt;gasp&gt;"},{"name":"TOLSHSAATH","text":"Finless ones...here...?"},{"name":"MANOFONDO03648","text":"...The finless ones! They followed me!"},{"name":"MANOFONDO03648","text":"Why have you come! Was it you who took away our water!?"},{"name":"ALPHINAUD","text":"Ah, so this is where the Ondo make their home. I had wondered..."},{"name":"ALPHINAUD","text":"Pray forgive us any inconvenience we have caused─we were not aware your people lived here in the Tempest."},{"name":"ALPHINAUD","text":"We need this great dome of air that we might conduct a most urgent search, and thus beg you for your understanding..."},{"name":"MANOFONDO03648","text":"Chieftain, what are we to do...?"},{"name":"TOLSHSAATH","text":"...Are you emissaries of the ancient ones?"},{"name":"TOLSHSAATH","text":"The mysteries have ssstirred. We have ssseen the illuminated land shhhining through the gloom of the abyss..."},{"name":"TOLSHSAATH","text":"If you are the emissaries─the chosen─I bid you welcome. If you are not, I bid you leave."},{"name":"ALPHINAUD","text":"I am...not sure I understand. Would you be willing to elaborate...?"},{"name":"TOLSHSAATH","text":"......"},{"name":"ALPHINAUD","text":"...It would seem not. I suggest we withdraw for the moment."},{"name":"THANCRED","text":"So, what's the plan? Given your “condition,” I'm reluctant to suggest lingering here."},{"name":"THANCRED","text":"That said, our presently meandering search would proceed far more swiftly if we could call upon the Ondo's local knowledge."},{"name":"RYNE","text":"Yes, I'd like to know more about this “illuminated land” the chieftain spoke of."},{"name":"RYNE","text":"Could it be Emet-Selch's stronghold, do you suppose? Perhaps he...lit the lanterns upon his return?"},{"name":"ALPHINAUD","text":"We cannot dismiss the possibility, but if these Ondo refuse to speak with us..."},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>─do you remember my first scheme for entering Eulmore? How I had planned to ingratiate myself by offering lucrative trading opportunities with the Ondo?"},{"name":"ALPHINAUD","text":"The individual I dealt with was reticent in manner and curious in custom, but we were able to reach an agreement, nonetheless."},{"name":"ALPHINAUD","text":"I believe that with the right approach, we can build a similar relationship here."},{"name":"THANCRED","text":"What kind of approach did you have in mind? That chieftain fellow didn't leave us many options."},{"name":"URIANGER","text":"If we are to tread the swiftest course, then we must needs locate its beginning. 'Tis plain our all too dramatic arrival hath thrown this settlement into confusion..."},{"name":"URIANGER","text":"Were we to solve such problems as we have caused, and assure our hosts thereby that our purpose here is not inimical to them, they may yet prove amenable to reason."},{"name":"THANCRED","text":"...I smell chores. But very well─<span class=\"emphasis\">if</span> it can be done quickly."},{"name":"ALISAIE","text":"What do you think? I've nothing better to offer, but I do worry what will happen if the Ondo's tales end up leading us to a dead end."},{"name":"YSHTOLA","text":"I cannot say for certain, but I sense this tribe has a deeper connection to the Ascians than first meets the eye."},{"name":"YSHTOLA","text":"It warrants further investigation. Thus I cast my vote in favor of aiding the settlement for the time being."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We will make allies of the Ondo!"},{"name":"A1","text":"Let's do what we do best!"},{"name":"A1","text":"I'll do what I can, I suppose..."},{"name":"ALPHINAUD","text":"Then it is settled. Y'shtola─pray proceed with your investigations. The rest of us will see about fostering some goodwill!"},{"name":"TOLSHSAATH","text":"Was it fate that brought you to usss...?"},{"name":"PAUSHSOOAN","text":"You are Alphinaud's friend...?"},{"name":"ALPHINAUD","text":"<span class=\"highlight\">Forename</span>! You won't believe who I've just bumped into!"},{"name":"ALPHINAUD","text":"This is Paushs Ooan, the very fellow I did business with prior to our ill-fated stay in Eulmore!"},{"name":"PAUSHSOOAN","text":"I waited, and you did not come. Then the Myssstel came, but his visits did not continue..."},{"name":"ALPHINAUD","text":"I am truly sorry, Paushs Ooan─things did not proceed as planned. Is there aught we can do for you by way of an apology?"},{"name":"PAUSHSOOAN","text":"Hmmm... Perhapsss... “Where the Dry Return,” a cavern to the north, is home to giant crabs. We do not fear the crab, for we are the swifter ssswimmers."},{"name":"PAUSHSOOAN","text":"But now there is no water. We run, and they ssscuttle close behind, snipping and sssnapping with their claws. There are too many of them. Too many..."},{"name":"ALPHINAUD","text":"Ah, I believe I can be of assistance there."},{"name":"ALPHINAUD","text":"And what of you, <span class=\"highlight\">Forename</span>? If you've not found a task, you are most welcome to join me. Indeed, I should appreciate the company. “Where the Dry Return” has a rather ominous ring to it..."},{"name":"PAUSHSOOAN","text":"Where the Dry Return is filled with crimson coral. We imagine its branches to be the veins of finless ones─the cave a resting place for those who perishhhed at sssea."},{"name":"YSHTOLA","text":"Ah, as I suspected..."},{"name":"PAUSHSOOAN","text":"You could crack their shells? You must be ssstronger than you look..."},{"name":"ALPHINAUD","text":"I see you've reached your quota first again. I shall never be your equal in such tasks..."},{"name":"ALPHINAUD","text":"Still, I would say we have reduced the local crab population to a far less threatening number."},{"name":"PAUSHSOOAN","text":"My thanks─to both of you. You mussst have a reward..."},{"name":"ALPHINAUD","text":"Nay, Paushs Ooan, this was to be a part of my apology to you, remember? Besides which, the lack of water is <span class=\"emphasis\">our</span> doing, for which we must also make amends."},{"name":"ALPHINAUD","text":"Might I convince you to tell us something about your village, instead? I would very much like to learn more of you and your people."},{"name":"PAUSHSOOAN","text":"...Very well. Before the Flood came, it is said that our ancestral home was found in the seas to the sssouth. It was utterly destroyed by the Light."},{"name":"PAUSHSOOAN","text":"Only those who were out hunting sssurvived. They swam, aimless and lossst, until they spied buildings here on the ocean floor."},{"name":"PAUSHSOOAN","text":"Strange buildings they were, and long had they ssstood under the water. Yet somehow they had been ssspared the scars of time and current..."},{"name":"PAUSHSOOAN","text":"These ssstructures provided shelter for my people─protection from the Tempest's turbulent waters and the predators which hunted within them. Their very existence ssseemed a miracle."},{"name":"PAUSHSOOAN","text":"The first sssettlers pondered their good fortune. It was clear that the race who had built sssuch wonders had guided their course. And from this did they discern the truth..."},{"name":"PAUSHSOOAN","text":"...That the ancients had chosen us to ssserve as caretakers of their eternal sssanctuary, until sssuch time as they returned."},{"name":"PAUSHSOOAN","text":"Thus, if it is judged that your coming─and this great vanishing of water─was by the ancients' design, you will find warm welcome here."},{"name":"ALPHINAUD","text":"A truly astonishing history. Yet I cannot help but wonder, how will the significance─or otherwise─of our arrival be decided?"},{"name":"PAUSHSOOAN","text":"The ancients have blessed us with protection and prosperity. If your presence serves to bring us the sssame, there will be no doubt in the matter."},{"name":"ALPHINAUD","text":"...Then it would seem our earlier decision was the correct one."},{"name":"ALPHINAUD","text":"We thank you for the lesson, Paushs Ooan, and will continue to do all we can to assist your people. Should you desire our help with any other trouble, pray do not hesitate to ask."},{"name":"ALPHINAUD","text":"We should return to the task at hand. Only...do try not to overexert yourself, my friend. The risk far outweighs the gain."}],"reward":{"gil":1068},"reqs":{"jobs":[{"lvl":79,"id":142}],"quests":[69183]},"next":[69112,69113,69114,69115,69116,69117,69118,69119,69120,69121,69123,69124,69185]},"partials":[{"type":"npc","id":"1030336","obj":{"i":1030336,"n":"Thancred","l":2958,"q":1}},{"type":"npc","id":"1027758","obj":{"i":1027758,"n":"Paushs Ooan","l":2958,"q":1}},{"type":"quest","id":"69183","obj":{"i":69183,"n":"To Storm-tossed Seas","g":8,"l":"The Crystarium","s":990}},{"type":"quest","id":"69112","obj":{"i":69112,"n":"Ondo Dream of Oranges","g":118,"l":"The Tempest","s":9120}},{"type":"quest","id":"69113","obj":{"i":69113,"n":"Pearls of the Deep","g":118,"l":"The Tempest","s":9130}},{"type":"quest","id":"69114","obj":{"i":69114,"n":"Beware the Benthos","g":118,"l":"The Tempest","s":9140}},{"type":"quest","id":"69115","obj":{"i":69115,"n":"Beyond the Reach of Koal","g":118,"l":"The Tempest","s":9150}},{"type":"quest","id":"69116","obj":{"i":69116,"n":"Do the Chuckle","g":118,"l":"The Tempest","s":9160}},{"type":"quest","id":"69117","obj":{"i":69117,"n":"Strange Stew","g":118,"l":"The Tempest","s":9170}},{"type":"quest","id":"69118","obj":{"i":69118,"n":"Scales for the Scaled Ones","g":118,"l":"The Tempest","s":9180}},{"type":"quest","id":"69119","obj":{"i":69119,"n":"Secrets and Spears","g":118,"l":"The Tempest","s":9190}},{"type":"quest","id":"69120","obj":{"i":69120,"n":"Scavenger Deep","g":118,"l":"The Tempest","s":9201}},{"type":"quest","id":"69121","obj":{"i":69121,"n":"Mistake or Machination","g":118,"l":"The Tempest","s":9210}},{"type":"quest","id":"69123","obj":{"i":69123,"n":"Doggone Dagons","g":118,"l":"The Tempest","s":9230}},{"type":"quest","id":"69124","obj":{"i":69124,"n":"Koal of the Cups","g":118,"l":"The Tempest","s":9240,"f":1}},{"type":"quest","id":"69185","obj":{"i":69185,"n":"City of the Ancients","g":8,"l":"The Tempest","s":1010}}]}