{"quest":{"name":"To Storm-tossed Seas","location":"The Crystarium","id":69183,"patch":5.0,"sort":990,"icon":100926,"eventIcon":71201,"issuer":1030327,"target":1030339,"genre":8,"journal":["Urianger is patiently awaiting word that you are ready to depart.","You inform Urianger of your readiness to depart, and he exhorts you to consider a method of travel that will also facilitate breathing and movement beneath the waves. Rather than explain his proposal with wasteful words, however, your ever-enigmatic colleague bids you follow him to Sullen to behold his solution with your own eyes.","Urianger meets you at Sullen, and points out an island in the western part of the lake. It would seem that an underwater investigation of the foliage-covered landmass will soon open your eyes to its true nature.","You conduct an inspection of the submerged part of the island, and note some interesting peculiarities. Urianger waits above to hear word of your revelations.","The Isle of Ken is, as it turns out, an ancient fae being by the name of Bismarck. Urianger attempts to rouse the creature to action, but it takes the intervention of Feo Ul to convince Bismarck to bear you to the ocean's depths. Your journey to the Tempest has begun.","Bismarck deposits you on the sea floor, secure within an enormous dome of air created by its mighty breath. Your companions rise shakily to their feet, Urianger's face in particular a mask of relief...<br><br>※In the event that you leave the area, speak with Inewyl at Venmont Yards in Kholusia to return to the Tempest.","Releasing a long-held breath, Urianger announces your safe arrival in the Tempest. Suspecting that Emet-Selch cannot risk fleeing into the rift while the Exarch is his prisoner, he seems confident that the Ascian is to be found somewhere within this underwater realm. You have only to begin the search..."],"objectives":["Speak with Urianger in Sullen.","Investigate suspect rock formations beneath the water's surface.","Speak with Urianger."],"dialogue":[{"name":"ALPHINAUD","text":"I once said that I wanted to fight for Estinien─that I wanted to save him, not let him be sacrificed for a cause. And now I say the same to you."},{"name":"ALISAIE","text":"Just so you know, I will not look kindly on any further attempts to leave us behind. We do this together."},{"name":"THANCRED","text":"Gods know you've spent enough time charging into danger on our behalf. It's only fair that we return the favor!"},{"name":"RYNE","text":"There's nothing I can do to weaken the Light that's trapped inside you...but I'll do everything in my power to keep it from breaking free."},{"name":"RYNE","text":"If the Wardens' aether overwhelms you again, you <span class=\"emphasis\">will</span> become a sin eater, so please, save your strength for when it really matters."},{"name":"YSHTOLA","text":"The volunteers who journeyed to Kholusia have all been safely returned to their homes. They've also assured us that they will do their best to hold the eaters at bay in our absence."},{"name":"URIANGER","text":"Thine affairs are in order? Then I shall unfold to thee my proposal."},{"name":"URIANGER","text":"Our destination is the ocean floor, yet our goal is not simply to arrive there. Nay, we must needs have the means to breathe and fight freely."},{"name":"URIANGER","text":"Thus would I petition the aid of one of the fae─a being with whom I have yet to meet face-to-face."},{"name":"URIANGER","text":"...Rather than waste words on explanation, I bid thee follow me unto the hamlet of Sullen, which lieth to the south and west. All will become abundantly clear, I promise thee."},{"name":"URIANGER","text":"There, to the west. Canst thou discern the hump of an isle rising above the water?"},{"name":"URIANGER","text":"That foliage-covered mass hideth the key to our safe descent. Swim close and plunge thee beneath the surface. Thou shalt soon divine the reason for mine insistence."},{"name":"URIANGER","text":"...Though it be much to my shame, I can but flail and flounder where thou mayest glide as a fish. I shall board a boat to the island, and spare one and all the spectacle of mine inept strokes."},{"name":"ALPHINAUD","text":"Ah, there you are. Once you've completed your underwater investigations, the path here leads to the top of the island."},{"name":"ALISAIE","text":"This lake is enormous...<br>Assuming my geography is correct, this would be the mirror of Silvertear back in the Source, although the size hardly compares."},{"name":"THANCRED","text":"The locals call this the “Isle of Ken,” which I presume must refer to knowledge. Either that or someone was being awfully zealous about marking his territory."},{"name":"RYNE","text":"Even seeing it up close, I'm still not sure what's so special about this island..."},{"name":"URIANGER","text":"If thou wouldst divine the secret of this isle, I prithee inspect the view from beneath the water's surface."},{"name":"YSHTOLA","text":"If you've solved Urianger's little mystery, then you can find him further up the slope. 'Twas all rather obvious to my eyes, though I concede I have an unfair advantage."},{"name":"SYSTEM","text":"Two curved slabs of rock seem squeezed together here, giving the impression of giant stone eyelids."},{"name":"SYSTEM","text":"Though it appears solid enough, the rock yields slightly under your touch. Was the surface gently shifting, or was it just your imagination...?"},{"name":"URIANGER","text":"Well? What hast thou discerned?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I've discerned...that it's an ordinary island?"},{"name":"A1","text":"It reminds me of a certain primal..."},{"name":"A1","text":"It's just like the Big One, yes, yes!"},{"name":"URIANGER","text":"Truly? Naught could be further from the truth. According to the lore of the pixies, we are, even now, perched upon the back of an ancient fae entity..."},{"name":"URIANGER","text":"Most perceptive. According to the lore of the pixies, we are, even now, perched upon the back of an ancient fae entity..."},{"name":"URIANGER","text":"Hah! Thine <span class=\"emphasis\">impression</span> is not inaccurate. According to the lore of the pixies, we are, even now, perched upon the back of an ancient fae entity..."},{"name":"URIANGER","text":"Its name is “Bismarck.” Aye, the selfsame title by which we know the great feathered whale revered by the Vanu Vanu of the Source."},{"name":"URIANGER","text":"I would enlist its aid to bear us unto the deep, and thence banish the water with an airy sphere, alike in form to the domes which do shelter the hamlets 'neath the Ruby Sea."},{"name":"URIANGER","text":"Within its compass, we may move unencumbered, and defend ourselves when the hour of battle cometh, as it most surely shall. Now, I must needs ask for silence whilst I make my supplication..."},{"name":"Q2","text":"Travel to the Tempest?"},{"name":"ALPHINAUD","text":"Bismarck must be powerful indeed to create a dome of this size. I can only pray to whichever gods are listening that it continues to hold..."},{"name":"ALISAIE","text":"I remember being impressed by the domes of the Ruby Sea, but this makes them look like bubbles in a stream!"},{"name":"THANCRED","text":"With all that water out of the way, we'll be able to venture quite some distance. Emet-Selch must be hiding around here somewhere..."},{"name":"RYNE","text":"This is <span class=\"emphasis\">amazing</span>. I can't even see the surface!"},{"name":"YSHTOLA","text":"I daresay Urianger endured much “playful” attention from the pixies to learn the lore of Bismarck. He is nothing if not a dedicated scholar."},{"name":"URIANGER","text":"Haaa... Haaa...&lt;gulp&gt;<br>Full glad am I...that Bismarck was true to his word."},{"name":"URIANGER","text":"We are arrived in the Tempest, safe and dry. 'Tis here that we shall find the lair of Emet-Selch, and, I believe, the imprisoned Exarch as well."},{"name":"URIANGER","text":"For an Ascian alone, it is of course a trifling matter to flee unto the rift─yet I suspect such travel is nigh impossible with a mortal in one's custody."},{"name":"URIANGER","text":"Nay, he would not soon risk his prize when the Exarch's very body serveth as the key to the Crystal Tower and its powers of temporal transportation."},{"name":"URIANGER","text":"Thus am I all but certain that this underwater realm harboreth our friend and enemy both. We have but to find them."},{"name":"SYSTEM","text":"In the event that you leave the area, speak with Inewyl at Venmont Yards in Kholusia to return to the Tempest."}],"reward":{"gil":1396,"items":[{"num":2,"id":27882}]},"reqs":{"jobs":[{"lvl":79,"id":142}],"quests":[69182]},"next":[69105,69106,69107,69108,69109,69110,69111,69184]},"partials":[{"type":"npc","id":"1030327","obj":{"i":1030327,"n":"Urianger","l":2951,"q":2}},{"type":"npc","id":"1030339","obj":{"i":1030339,"n":"Urianger","l":2958,"q":1}},{"type":"item","id":"27882","obj":{"i":27882,"n":"Oysters on the Half Shell","l":430,"c":24316,"t":46}},{"type":"quest","id":"69182","obj":{"i":69182,"n":"The Unbroken Thread","g":8,"l":"Lakeland","s":980}},{"type":"quest","id":"69105","obj":{"i":69105,"n":"The Sullen Man","g":113,"l":"Lakeland","s":9050}},{"type":"quest","id":"69106","obj":{"i":69106,"n":"Rite of Passage","g":113,"l":"Lakeland","s":9060}},{"type":"quest","id":"69107","obj":{"i":69107,"n":"Bigger Fish to Dry","g":113,"l":"Lakeland","s":9070}},{"type":"quest","id":"69108","obj":{"i":69108,"n":"Treasure-hunting Tykes","g":113,"l":"Lakeland","s":9080}},{"type":"quest","id":"69109","obj":{"i":69109,"n":"With Furious Anger","g":113,"l":"Lakeland","s":9090}},{"type":"quest","id":"69110","obj":{"i":69110,"n":"Scrumptious Squirmers","g":113,"l":"Lakeland","s":9101}},{"type":"quest","id":"69111","obj":{"i":69111,"n":"Simple Treasures","g":113,"l":"Lakeland","s":9110}},{"type":"quest","id":"69184","obj":{"i":69184,"n":"Waiting in the Depths","g":8,"l":"The Tempest","s":1000}}]}