{"quest":{"name":"The Unbroken Thread","location":"Lakeland","id":69182,"patch":5.0,"sort":980,"icon":100925,"eventIcon":71201,"issuer":1030369,"target":1030327,"genre":8,"journal":["Lyna urges you to follow her.","Lyna is resolved to unlock the door to the Umbilicus. She bids you return to the Crystarium, and meet her in the Ocular.","You enter the heart of the Crystal Tower and a vision from the past washes over you. The Echo stretches on for what feels like many long minutes as you witness the Exarch reveal the truth of his motivations to a stunned Urianger. G'raha Tia─for that is the steward's true identity─speaks of an apocalyptic future in the Source, and of a determined group's efforts to bend time and space so that your life, and the lives of countless others, might be spared. Overwhelmed by the enormity of the endeavor, Urianger grimly agrees to conceal the truth from his fellow Scions, and to prevent them from interfering with the Exarch's planned act of self-sacrifice.<br><br>As you recover from the shock of these revelations, Ardbert appears and helps guide you towards a possible course of action. First things first, however, you must report to Lyna where she awaits you outside.","You speak with Lyna, and ask for the most direct means of reaching the Tempest. Somewhat taken aback by the request, the guard captain directs you to the tamers at the Amaro Launch.","Your attempts to secure an amaro for the forthcoming journey are interrupted by the arrival of your concerned comrades. You discuss your intention to press on despite your delicate condition, and the objections raised by Ryne are met with an impassioned argument from Alisaie. In the end, your companions agree to accompany you to the Tempest─an endeavor which gains the unexpected support of the Crystarium citizenry. They have long suspected your role as the Warrior of Darkness, and it seems you will not want for allies in the days ahead.","Although impressed by your determination, Urianger hints that he may have a less strenuous way of reaching the ocean floor. Before you discuss his solution, however, he suggests you conclude any pressing business you might have in the Crystarium."],"objectives":["Head to the Ocular.","Speak with Lyna.","Speak with the aspiring amaro tamer.","Speak with Urianger."],"dialogue":[{"name":"LYNA","text":"Come. Meet me in the Ocular, and I will unlock the door within."},{"name":"CRYSTALGATEKEEPER","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. The captain said to expect you."},{"name":"Q0","text":"Enter the Ocular?"},{"name":"LYNA","text":"Did you find the answers you sought? If there is nothing more you need, I will go and lock the door..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I need some directions..."},{"name":"A1","text":"I have questions about the Tempest..."},{"name":"LYNA","text":"You wish to know the way to the Tempest? ...You mean the sea itself, and not the island of Kholusia?"},{"name":"LYNA","text":"If you make a request to the tamers, they will provide you with an amaro, but..."},{"name":"LYNA","text":"The Tempest? That is the name given to the seas by which Kholusia is bound."},{"name":"LYNA","text":"If you make a request to the tamers, they will provide you with an amaro to fly you over the waters, but..."},{"name":"LYNA","text":"...Do you mean to leave right this moment? Alone?"},{"name":"LYNA","text":"I am not sure that─ Nay, I will not seek to stop you. Go with the blessings of the shadow, and I shall await your safe return."},{"name":"LYNA","text":"A word to the tamers at the Amaro Launch, and they will lend you a beast to carry you over the Tempest. I only hope that will be close enough to where you need to be..."},{"name":"BOARDINGGATETOKHOLUSIA","text":"You require an amaro? Just a moment, and I shall saddle our swiftest beast to fly you to the island..."},{"name":"BOARDINGGATETOKHOLUSIA","text":"...The open water? To the <span class=\"emphasis\">depths</span> of the Tempest!? Our amaro can swim, yes, but to reach the ocean floor..."},{"name":"ALPHINAUD","text":"I once said that I wanted to fight for Estinien─that I wanted to save him, not let him be sacrificed for a cause. And now I say the same to you."},{"name":"ALISAIE","text":"Just so you know, I will not look kindly on any further attempts to leave us behind. We do this together."},{"name":"THANCRED","text":"Gods know you've spent enough time charging into danger on our behalf. It's only fair that we return the favor!"},{"name":"RYNE","text":"There's nothing I can do to cleanse you of the Light's corruption...but I'll do everything in my power to keep it in check."},{"name":"RYNE","text":"If the Wardens' aether overwhelms you again, you <span class=\"emphasis\">will</span> become a sin eater, so please, save your strength for when it really matters."},{"name":"YSHTOLA","text":"The volunteers who journeyed to Kholusia have all been safely returned to their homes. They've also assured us that they will do their best to hold the eaters at bay in our absence."},{"name":"CASSARD","text":"I might offer some words of encouragement to the masses while I'm out and about on business. You need proper support to do what you need to do, and we can't let morale start flagging now, can we?"},{"name":"KATLISS","text":"Not to worry─the Mean will keep the cogs greased and turning, as we always do. I'll see our crafting quotas are filled, and then some!"},{"name":"CHESSAMILE","text":"Hm? Do you need a tonic for your travels, sweetie? Oh, and maybe you should take one for the Exarch as well. Invigorating stuff if you can abide the smell..."},{"name":"SZEMDJENMAI","text":"My fellow tamers and I will keep an eye on the horizon. Should the need arise, we shall speed to your side with a flock of amaro in tow."},{"name":"GLYNARD","text":"A good, strong pint to see you down the road? ...Ah, best not, eh? You'll need your wits about you by the sound of things."},{"name":"GLYNARD","text":"Tell you what: I'll put aside one of my finest bottles, and you can have a bracing victory drink when you return!"},{"name":"BRAGI","text":"All stocked up on supplies then? Better to have it and not need it, than need it and not have it, as my old man used to say. Be safe, and bring the Exarch back to us..."},{"name":"URIANGER","text":"Thou didst plan to commandeer an amaro for thy journey to the open sea? I fear the following dive down unto Emet-Selch's underwater abode would drain even thy legendary stamina..."},{"name":"URIANGER","text":"Thus, during thy convalescence, we considered the most efficacious method for reaching the depths of the Tempest. And I believe we have arrived at an elegant solution."},{"name":"URIANGER","text":"Yet ere we discuss this step, I suggest thou dost conclude such pressing business as remains to thee in the Crystarium. Once the sea closeth above our heads, we are unlikely to surface again until our grand deed is done."}],"reward":{"gil":1197},"reqs":{"jobs":[{"lvl":79,"id":142}],"quests":[69181]},"next":[69100,69101,69102,69103,69104,69183]},"partials":[{"type":"npc","id":"1030369","obj":{"i":1030369,"n":"Lyna","l":2953,"q":2}},{"type":"npc","id":"1030327","obj":{"i":1030327,"n":"Urianger","l":2951,"q":2}},{"type":"quest","id":"69181","obj":{"i":69181,"n":"In His Garden","g":8,"l":"The Crystarium","s":970}},{"type":"quest","id":"69100","obj":{"i":69100,"n":"Simple Gifts","g":111,"l":"The Crystarium","s":9001}},{"type":"quest","id":"69101","obj":{"i":69101,"n":"His Own Medicine","g":111,"l":"The Crystarium","s":9010}},{"type":"quest","id":"69102","obj":{"i":69102,"n":"Welcome to the Future","g":111,"l":"The Crystarium","s":9020}},{"type":"quest","id":"69103","obj":{"i":69103,"n":"Made, Not Born","g":111,"l":"The Crystarium","s":9030}},{"type":"quest","id":"69104","obj":{"i":69104,"n":"The Poet Doesn't Know It","g":111,"l":"The Crystarium","s":9040}},{"type":"quest","id":"69183","obj":{"i":69183,"n":"To Storm-tossed Seas","g":8,"l":"The Crystarium","s":990}}]}