{"quest":{"name":"The Crystalline Mean","location":"The Crystarium","id":69191,"patch":5.0,"sort":10,"unlocksFunction":1,"eventIcon":71341,"issuer":1027232,"target":1027232,"genre":172,"journal":["The work of the Crystalline Mean is never done, and Katliss is ever on the lookout for skilled hands.","Seeing you as potential new talent, Katliss asks whether you might be interested in plying your trade at the Crystalline Mean, and you answer in the affirmative. To help get you started, she offers to give you an overview of the operations.","Katliss explains that the Crystalline Mean is a center for the procurement and production of those items that make city life possible. The Mean is composed of five facets, each a collective of folk skilled in certain areas, who work together to provide for the Crystarium. There is the Facet of Forging, whose members are experts in metalworking; the Facet of Crafting, which brings together artisans who work with leather, cloth, and wood; the Facet of Nourishing, which strives to ensure that denizens are fed and healthy; the Facet of Gathering, formed of miners and botanists who procure resources all across Norvrandt; and the Facet of Fishing, whose members fish the realm's waters and cultivate marine life. Every facet is always looking to bolster its roster with new talent, and Katliss encourages you to make yourself known to whichever one is a fit for your skills."],"objectives":["Speak with Katliss."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the sidequest “Inscrutable Tastes.”"},{"name":"KATLISS","text":"You look like you've got skills of the sort we need. Would you be interested in putting them to use at the Mean?"},{"name":"KATLISS","text":"Wonderful. We can never have enough hands to do all the work that wants doing."},{"name":"KATLISS","text":"To help get you started, I'll give you an overview of our operations."},{"name":"KATLISS","text":"Just let me know when you have a moment."},{"name":"KATLISS","text":"Ready to learn about our operations? Good, good."},{"name":"KATLISS","text":"So, as I may have already told you, the Crystalline Mean is a center for the procurement and production of those items that make city life possible. From daily necessities to military provisions, we deal in just about anything. A storehouse and workshop rolled into one, we are."},{"name":"KATLISS","text":"Now, the Mean is composed of five facets─that's our fancy name for divisions. Each facet is a collective of folk skilled in certain fields, who work together to provide for the Crystarium."},{"name":"KATLISS","text":"Firstly, there's the Facet of Forging. As you can probably glean from the name, its members are experts in metalworking. The woman you see there is Iola, the proprietress of the Iron Bellows. I'm told she's been sorely pressed for help lately."},{"name":"KATLISS","text":"Next, we have the Facet of Crafting, which brings together artisans who work with leather, cloth, and wood. Among them, there's even a lass who specializes in the restoration of artwork and traditional handicrafts. She doesn't appear to be present at the moment, though."},{"name":"KATLISS","text":"Moving on, we have the Facet of Nourishing, whose mission is to ensure that our denizens are fed and healthy─and I speak not only of people. Bethric there is the resident veterinarian, and he's charged with looking after our trusty amaro."},{"name":"KATLISS","text":"Then there's the Facet of Gathering, formed of miners and botanists who procure resources all across Norvrandt. Overseeing the group is Qeshi-Rae, a knowledgeable─if eccentric─woman. If you have an inquiring mind like her, though, I daresay you'll get along."},{"name":"KATLISS","text":"Last but not least, the Facet of Fishing. Aside from reeling in the bounty of the realm's waters, members also cultivate marine life. Frithrik there speaks for the gathering, and whatever folk may say of his leadership, none can doubt his skills and knowledge as a fisher."},{"name":"KATLISS","text":"And that's the five facets of the Crystalline Mean. Under the direction of the Settlement council, each does its part to ensure the survival of the Crystarium."},{"name":"KATLISS","text":"Well, that's the idea, at any rate. The reality is most facet members are individuals with individual interests. They're often busy with their own endeavors and can't always make a meaningful contribution to the common cause."},{"name":"KATLISS","text":"What this means is the Mean suffers from a chronic shortage of hands, and every facet is always looking to bolster its roster with new talent. I encourage you to make yourself known to whichever one is a fit for your skills."},{"name":"SYSTEM","text":"You can now offer your services to each of the facets of the Crystalline Mean!"}],"reward":{"gil":569},"reqs":{"jobs":[{"lvl":70,"id":35}],"quests":[68839]},"next":[68763,68766,68769,68772,68775]},"partials":[{"type":"npc","id":"1027232","obj":{"i":1027232,"n":"Katliss","l":2951,"q":4}},{"type":"quest","id":"68839","obj":{"i":68839,"n":"The Crystarium's Resolve","g":8,"l":"The Crystarium","s":250}},{"type":"quest","id":"68763","obj":{"i":68763,"n":"Iola, Forgemaster","g":167,"l":"The Crystarium","s":110,"f":1}},{"type":"quest","id":"68766","obj":{"i":68766,"n":"Cherished Memories","g":168,"l":"The Crystarium","s":210,"f":1}},{"type":"quest","id":"68769","obj":{"i":68769,"n":"Friends of a Feather","g":169,"l":"The Crystarium","s":310,"f":1}},{"type":"quest","id":"68772","obj":{"i":68772,"n":"On the Trail of a Myth","g":170,"l":"The Crystarium","s":410,"f":1}},{"type":"quest","id":"68775","obj":{"i":68775,"n":"Well Eel Be Damned","g":171,"l":"The Crystarium","s":510,"f":1}}]}