{"quest":{"name":"Snakes in the Grass","location":"The Rak'tika Greatwood","id":69195,"patch":5.0,"sort":4260,"icon":100857,"unlocksFunction":1,"eventIcon":71341,"issuer":1030818,"target":1030818,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Quinfort seeks further enlightenment from the great serpent.","Quinfort's pleas for a sign are answered when he notices the scar on the serpent's belly is gone and another has appeared near its tail. Judging by its shape, he is convinced dark forces are gathering somewhere near Dyers' Wash. Valan agrees that it is worth investigating.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","Shortly after arriving at Dyers' Wash, you spy two mages dressed in black. No sooner do you approach them than two spiders appear and assault you. The two mages seem to take delight in your struggles, but their smiles soon fade when the two arachnids are brought low.","The two mages panic and flee into the woods at the sight of your victory. You give chase in the hopes of uncovering their scheme.","You finally corner them after an arduous trek through the woods. The air is electric as the mages sling spell after spell at you, but their attempts to stave you off are futile. ","Among the mages' belongings, you find a scroll outlining a plan that spans the breadth of Rak'tika. You rush back to Slitherbough to inform Valan and Quinfort of what you found.","Valan and Quinfort look over the scroll and are horrified at what they see. A plan to sever all flows of aether to Slitherbough, which would not only cripple the village but irreparably upset the balance of the forest. Despite the difficulty involved in explaining where they learned of this plan, the two have every intention of informing their betters. Quinfort once more offers praise to the great serpent, but he turns to find it vanished. Though the mystery of this snakelike being remains, they are content in the knowledge that the Greatwood is safe."],"objectives":["Search Dyers' Wash for signs of trouble.","Speak with the Children of the Everlasting Dark.","Search for the Children of the Everlasting Dark.","Search their belongings for clues.","Deliver the blood-soaked parchment to Quinfort."],"dialogue":[{"name":"VALAN","text":"I never thought I'd say this, but I think I might believe Quinfort."},{"name":"TSUCHINOKO","text":"Scree?"},{"name":"QUINFORT","text":"The will of the wood would see us bring Slitherbough and all of Rak'tika back from the brink."},{"name":"QUINFORT","text":"O great serpent, show us the way! Show us how we might deliver our people from certain destruction!"},{"name":"TSUCHINOKO","text":"Screee!"},{"name":"VALAN","text":"Shhh! If anyone sees that thing, they're going to kick it out of the village. Then where would we be?"},{"name":"QUINFORT","text":"We have precious little time to concern ourselves with the others. What's more, the great serpent has blessed us with another sign of what's to come."},{"name":"VALAN","text":"What is it this time?"},{"name":"QUINFORT","text":"Behold the scales of its belly, and you will see the scar that marked Lozatl's Conquest has vanished. However, a new scar has appeared closer to its tail."},{"name":"QUINFORT","text":"The Children would threaten another site of great power, and judging by the shape of this scar, I have no doubt it is near Dyers' Wash. They must be stopped."},{"name":"VALAN","text":"Agreed. Though I fear only one of us is actually up to the task."},{"name":"VALAN","text":"And are you certain about that scar? I didn't see anything of the sort on its tail..."},{"name":"VALAN","text":"At any rate, I think it'd be for the best if you went to investigate. We've already found proof the Children are up to something. It would be foolish not to press further. Perhaps the will of the wood will give us another sign while you're away."},{"name":"QUINFORT","text":"Go quickly, <span class=\"highlight\">Forename</span>, and may the will of the wood guide your steps."},{"name":"VALAN","text":"This is all becoming rather strange, isn't it? Goodness knows what you'll find out there next. If the fates are kind, it won't be the Children."},{"name":"TSUCHINOKO","text":"Scree scree! Scree!!!"},{"name":"SYSTEM03659","text":"The shrill cries of the great serpent sound almost joyous. It seems hopeful for your success."},{"name":"CRAZYHAA","text":"Fool! You cannot stop us!"},{"name":"CRAZYHAB","text":"Do not interfere in our work. These woods must be cleansed!"},{"name":"CRAZYHAB","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s defeated our spiders!"},{"name":"CRAZYHAA","text":"Let us away! There is still work to be done!"},{"name":"SYSTEM03659","text":"The Children of the Everlasting Dark have escaped into the woods. Give chase that you might learn more of their schemes."},{"name":"QUINFORT","text":"You confronted the Children!? Then we can now give a face to the harbingers of our destruction."},{"name":"VALAN","text":"He was right again? Oh dear, this will only encourage him further."},{"name":"TSUCHINOKO","text":"Screee!"},{"name":"CRAZYHAA","text":"We've been followed!"},{"name":"CRAZYHAB","text":"Begone with you!"},{"name":"SYSTEM03659","text":"Among the Children's belongings, you find a scroll detailing their plans to cleanse the forest."},{"name":"VALAN","text":"Oh, thank goodness you're back. Quinfort has been praying ever since you left, though it sounds to me like an endless stream of incoherent babble. I was almost tempted to risk accompanying you."},{"name":"TSUCHINOKO","text":"Screeeeee!"},{"name":"QUINFORT","text":"You are returned, though that is no surprise. I entreated the gods for your protection with a hymn from the <span class=\"emphasis\">Gospel of Quinfort</span>. They would not─could not─deny my plea. "},{"name":"TSUCHINOKO","text":"Scree! Scree! Scree!"},{"name":"VALAN","text":"Shadows give me strength... <span class=\"highlight\">Forename</span>, were you able to find anything?"},{"name":"VALAN","text":"A coordinated strike to cut off all flows of aether to Slitherbough..."},{"name":"QUINFORT","text":"It beggars belief that they could love the forest so, yet be so blind to its needs."},{"name":"VALAN","text":"We need no further proof of what the Children are up to."},{"name":"VALAN","text":"We have to tell the others. Defend the sites they mean to befoul and destroy those magicked containers. "},{"name":"VALAN","text":"Explaining how we came to know all this will prove difficult, of course, but I'll not see all your hard work wasted."},{"name":"QUINFORT","text":"We must also give thanks to the great serpent who first sensed the Children's ill intent. "},{"name":"QUINFORT","text":"The divine protector who thought us worthy vessels to carry out its work. My heart swells to know the will of the wood smiles upon us so."},{"name":"VALAN","text":"Your pet─I mean, the great serpent. It's gone..."},{"name":"VALAN","text":"It was here just a moment ago. We should go look for it."},{"name":"QUINFORT","text":"No, my friend. The great serpent has fulfilled its duty in protecting the Greatwood, and so it returns to slumber."},{"name":"VALAN","text":"Is that so? Perhaps it really was the great serpent."},{"name":"QUINFORT","text":"If you truly mean that, Valan, then perhaps you are ready to learn the truth of its origins..."},{"name":"QUINFORT","text":"And I would start from the very beginning!<br>It begins with the sizable crystal in Lake Tusi Mek'ta we know as Fruit of the Protector. If the legends are true, it dates back to a time preceding the empire of Ronka..."},{"name":"VALAN","text":"There he goes... I suspect I'll be getting an earful for the rest of the day."},{"name":"VALAN","text":"But I think our work here is finally done. I wish there was some way I could repay you for all your help."},{"name":"VALAN","text":"Though I should probably go while he's still swept up in his lectures. Take care, <span class=\"highlight\">Forename</span>. Hopefully we'll meet again soon."},{"name":"QUINFORT","text":"...Though this is largely an assumption based on my visions noted in chapter two, verse seventeen in the <span class=\"emphasis\">Gospel of</span>─"},{"name":"QUINFORT","text":"Come back here, Valan. I still have to tell you about the serpent's influence on the founding of Ronka!"}],"reward":{"gil":861,"items":[{"num":2,"id":27860,"one":1},{"num":2,"id":27861,"one":1},{"num":2,"id":27862,"one":1},{"num":2,"id":27863,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69194]},"next":[69018]},"partials":[{"type":"npc","id":"1030818","obj":{"i":1030818,"n":"Quinfort","l":2957,"q":2}},{"type":"item","id":"27860","obj":{"i":27860,"n":"Baguette","l":403,"c":24030,"t":46,"p":3501}},{"type":"item","id":"27861","obj":{"i":27861,"n":"Blood Tomato Juice","l":403,"c":24405,"t":46}},{"type":"item","id":"27862","obj":{"i":27862,"n":"Pixie Apple Pie","l":403,"c":24079,"t":46}},{"type":"item","id":"27863","obj":{"i":27863,"n":"Nut Bake","l":406,"c":24083,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69194","obj":{"i":69194,"n":"Snake the Lead","g":117,"l":"The Rak'tika Greatwood","s":4250,"f":1}},{"type":"quest","id":"69018","obj":{"i":69018,"n":"Protectors of the Wood","g":117,"l":"The Rak'tika Greatwood","s":5250,"f":1}}]}