{"quest":{"name":"The Great Deceiver","location":"The Rak'tika Greatwood","id":69192,"patch":5.0,"sort":4230,"icon":100857,"unlocksFunction":1,"eventIcon":71341,"issuer":1030747,"target":1030821,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Valan is gravely concerned for a friend.","Valan tells you of his friend, Quinfort. A prodigy of the arcane arts, he has the gift of clairvoyance, but Valan fears it has become more of a curse. His fellow Blessed ignore his claims that Quinfort's behavior is out of the ordinary, prompting him to seek the opinion of an impartial party. To that end, he asks you to speak with Quinfort to assess his condition.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","You find Quinfort alone in the dark, and he proves himself an imposing─if not unsettling─individual. He tells you of his vision of impending doom and a serpent savior when he is interrupted by the arrival of Valan. Hoping to prove once and for all the truth of his claims, Quinfort sets off into the woods intent on summoning the serpent from his dreams. Valan bids you help him find his companion before the wildlife does first.","You search high and low for any sign of Quinfort when Valan catches sight of something in the distance. He runs off in the hopes of finding his friend.","You find Quinfort near Fruit of the Protector accompanied by a creature unlike anything you have ever seen. Though you are unable to identify this strange beast, Quinfort remains firm in his belief that it is the great serpent of his dreams."],"objectives":["Speak with Quinfort.","Survey the designated area.","Speak with Quinfort. "],"dialogue":[{"name":"VALAN","text":"Say, aren't you <span class=\"highlight\">Forename</span>? Master Matoya speaks quite highly of you."},{"name":"VALAN","text":"I'm sure you've more important things to concern yourself with, but I need help, and there's no one else I can turn to."},{"name":"VALAN","text":"It's my friend, Quinfort. Ever since we were young, he's always excelled in the arcane arts. In fact even now he's in training to become a priest of the Night's Blessed."},{"name":"VALAN","text":"Perhaps the greatest of his gifts is clairvoyance, but I fear it's taken a toll on his mind as of late."},{"name":"VALAN","text":"He's always been different, but not like this. He's changed. Frighteningly so..."},{"name":"VALAN","text":"The others think him no stranger than usual, but they're wrong, and I mean to prove it. You don't know him like we do, which is precisely why I'd like you to talk with him. To get an objective opinion on the matter. "},{"name":"VALAN","text":"&lt;sigh&gt; Assuming we find out what ails him, I hope there's a way to cure it. "},{"name":"VALAN","text":"I think my concern will become abundantly clear once you speak with him."},{"name":"QUINFORT","text":"Mwahahaha! As foretold by the will of the wood, we meet at last. I've been expecting you, <span class=\"highlight\">Forename</span>."},{"name":"QUINFORT","text":"Shhh! No one else must hear of this. Not yet...<br>My dreams are plagued with visions of the future. Calamity is upon us, and each night I witness our impending doom."},{"name":"QUINFORT","text":"But hope is not yet lost, for the dreams speak to me of a savior in the form of a great serpent."},{"name":"QUINFORT","text":"It was revered as a god in the days of the Ronkan Empire, and I believe it yet lives in the Greatwood, waiting to be roused from slumber."},{"name":"QUINFORT","text":"It has many names. Many would call it the Protector, some the Great Destroyer."},{"name":"QUINFORT","text":"The will of the wood demands I find this great serpent. It is our only hope of salvation!"},{"name":"QUINFORT","text":"I have been <span class=\"emphasis\">chosen</span> <span class=\"highlight\">Forename</span>. To be the savior of Slitherbough!"},{"name":"VALAN","text":"So this is where you two have been hiding. Now that you've gotten to know one another, what do you think?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I fear his mind is beyond saving."},{"name":"A1","text":"His dreams are an ill omen."},{"name":"VALAN","text":"I refuse to believe that. There has to be something we can do to help him."},{"name":"VALAN","text":"Have you not sought counsel with the priests? They are your mentors after all. There's no need to keep your troubles from them."},{"name":"VALAN","text":"You believe him!? Oh dear... I fear I've made a terrible mistake."},{"name":"VALAN","text":"Please don't tell me you too have communed with the will of a star or some such nonsense."},{"name":"QUINFORT","text":"Valan, please! We are in the midst of a most important discussion."},{"name":"VALAN","text":"When you first began talks of these dreams and delusions I held my peace, but I won't let you drag anyone else into this."},{"name":"QUINFORT","text":"Such narrow-minded thinking is why only <span class=\"emphasis\">I</span> have been chosen by the wood. By the great serpent!"},{"name":"VALAN","text":"Yes, Quinfort, whatever you say."},{"name":"QUINFORT","text":"You've mocked me for the last time, Valan. I will summon the great serpent this very day, and prove to you the truth of my visions!"},{"name":"VALAN","text":"Quinfort, wait! Where are you going!?"},{"name":"VALAN","text":"To meet with misfortune would likely bring him to his senses. But he's my friend, and I can't stand the thought of him getting hurt out there. Will you help me look for him?"},{"name":"VALAN","text":"If anything should happen to him, I'll never forgive myself."},{"name":"VALAN","text":"He couldn't have gone far."},{"name":"VALAN","text":"Over there! I think I see him!"},{"name":"VALAN","text":"I'm beginning to grow tired of this game."},{"name":"VALAN","text":"Enough, Quinfort! Even you should recognize the danger of wandering off alone in these woods."},{"name":"QUINFORT","text":"Hehehe... Ahahahahahaha!"},{"name":"VALAN","text":"You really have gone mad, haven't you?"},{"name":"QUINFORT","text":"Mock me all you like, Valan, but now you will bear witness to the truth with your own eyes."},{"name":"QUINFORT","text":"Behold! The divine protector of Ronka! The great serpent of legend!"},{"name":"VALAN","text":"No! It can't be!"},{"name":"VALAN","text":"That's...the great serpent?"},{"name":"VALAN","text":"I see nothing <span class=\"emphasis\">great</span> about that...that... What <span class=\"emphasis\">is</span> it, exactly? I refuse to believe that it's a serpent."},{"name":"VALAN","text":"Please tell me you're joking."},{"name":"QUINFORT","text":"Hahaha. Do not be jealous, Valan. The will of the wood works in mysterious ways, and this serpent is the key to our deliverance."}],"reward":{"gil":752,"aetherCurrent":1},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[68867]},"next":[69193]},"partials":[{"type":"npc","id":"1030747","obj":{"i":1030747,"n":"Valan","l":2957,"q":1}},{"type":"npc","id":"1030821","obj":{"i":1030821,"n":"Quinfort","l":2957,"q":1}},{"type":"quest","id":"68867","obj":{"i":68867,"n":"An Unwanted Proposal","g":8,"l":"The Rak'tika Greatwood","s":530}},{"type":"quest","id":"69193","obj":{"i":69193,"n":"Slither Along","g":117,"l":"The Rak'tika Greatwood","s":4240,"f":1}}]}