{"quest":{"name":"Snake the Lead","location":"The Rak'tika Greatwood","id":69194,"patch":5.0,"sort":4250,"icon":100857,"unlocksFunction":1,"eventIcon":71341,"issuer":1030819,"target":1030818,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Valan is ready to put all this nonsense of visions behind him once and for all.","Just when this tale of serpents and soothsaying seemed ready to end, Quinfort is struck by an epiphany. The peculiar form of the great serpent, he claims, is an omen of the coming calamity, its stripes representing the currents which carry the Greatwood's life force. Looking once more at the serpent's scales, he feels confident that their pattern resembles Lozatl's Conquest. He bids you go there and search for any potential clues as to what danger the future holds.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","As you search Lozatl's Conquest, something in the river catches your eye. With a little effort, you uncover what appears to be a strange container sealed with talismans. You return to Slitherbough hoping either Valan or Quinfort will know what it is you found. ","Valan identifies the container as a device created by the Children of the Everlasting Dark that, after absorbing enough energy, can invoke devastating magic. He now fears they may use them to siphon the life energies of the Greatwood while supplying themselves with deadly force. Though his claims seemed absurd at first, Quinfort has yet to be wrong so far as Valan can tell. Perhaps the great serpent really is the key to their salvation."],"objectives":["Survey the designated area for clues.","Deliver the curious container to Quinfort."],"dialogue":[{"name":"QUINFORT","text":"Why did the great serpent choose this form, I wonder..."},{"name":"TSUCHINOKO","text":"Scree!"},{"name":"VALAN","text":"I hope you're satisfied now that your new pet is safe here in Slitherbough."},{"name":"TSUCHINOKO","text":"Scree scree!"},{"name":"VALAN","text":"And thank you, <span class=\"highlight\">Forename</span>. I now understand what's been troubling my friend all this time."},{"name":"VALAN","text":"I feared this might strain our friendship, but I don't believe this is something we can't overcome. Take care, and may the shadows keep you."},{"name":"QUINFORT","text":"Wait..."},{"name":"VALAN","text":"Please, Quinfort, there's no need to involve <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> in this any longer."},{"name":"QUINFORT","text":"I've been giving thought to the great serpent's chosen form, and I think I now understand why it chose to present itself to us in this way."},{"name":"QUINFORT","text":"Look closely at the pattern of its scales. I believe they represent the network of currents by which aether flows through Rak'tika─the very life force of the Greatwood."},{"name":"QUINFORT","text":"And there─the scar that intersects them there on its belly... It's an omen! Of the coming calamity that would disrupt the flow of life in the Greatwood!"},{"name":"VALAN","text":"Quinfort, stop! It's just a scratch. Probably from a rock as it slithered, or rolled, or did whatever it does to make its way through the forest."},{"name":"QUINFORT","text":"All these signs and still he refuses to see, like all the others. If the Greatwood is to be saved, it's up to us."},{"name":"QUINFORT","text":"I can only assume you remain at my side in the hopes of receiving some generous compensation. If that's what it takes, so be it."},{"name":"QUINFORT","text":"The scar on the great serpent's belly calls to mind Lozatl's Conquest. That is where you will find the source of this ill omen. Bring it to me and you will have the reward you seek."},{"name":"VALAN","text":"I should remind you that he's still only an apprentice. I wouldn't expect much, if anything, for your troubles."},{"name":"VALAN","text":"This is what happens when you spend too much time around <span class=\"emphasis\">interesting</span> individuals. Still, I can't deny that life would be boring without him."},{"name":"QUINFORT","text":"I will stay and keep watch over the great serpent."},{"name":"VALAN","text":"Don't worry about us. I'll make sure nothing happens to Quinfort or his new pet."},{"name":"TSUCHINOKO","text":"Scree!!!"},{"name":"SYSTEM03658","text":"The shrill shrieks of the great serpent sound troubled. It appears to be showing concern for you... "},{"name":"SYSTEM03658","text":"You survey your surroundings, but find nothing out of the ordinary."},{"name":"SYSTEM03658","text":"Something in the water catches your eye."},{"name":"SYSTEM03658","text":"You brush away the dirt and find a charm of some sort. Quinfort will no doubt be interested to see what you've found."},{"name":"VALAN","text":"You found something? Truly?"},{"name":"TSUCHINOKO","text":"Scree!"},{"name":"QUINFORT","text":"Come, <span class=\"highlight\">Forename</span>. Show me what you've found."},{"name":"QUINFORT","text":"Hmmm. Could it be a charm of some sort?"},{"name":"VALAN","text":"It was exactly where you said it'd be. Then that means your visions were...were..."},{"name":"QUINFORT","text":"Now do you believe in the great serpent?"},{"name":"VALAN","text":"Fine, fine, the great serpent is real. More importantly, that charm seems familiar. I think I've seen the Children use them for their incantations."},{"name":"VALAN","text":"Yes, I'm sure of it. My father once found one while hunting in the woods."},{"name":"VALAN","text":"If memory serves, they can be used to invoke powerful fire spells after absorbing enough aether... By the abyss! If they plan to use them to siphon the Greatwood's life force─ "},{"name":"QUINFORT","text":"My vision will at last come to pass! Hahaha!"},{"name":"VALAN","text":"Why are you laughing!? Don't you realize how serious this is?"},{"name":"VALAN","text":"That flow of aether you were talking about converges here at Slitherbough, doesn't it? It's why we have that large aetheryte outside."},{"name":"VALAN","text":"If the flow is disrupted, our crops would wither, the land would be rendered barren, animals would die─it would mean the end of our village, and all of Rak'tika would likely follow."},{"name":"QUINFORT","text":"O great one, I beseech you once more. Grant us the strength and the wisdom to avert this terrible crisis."},{"name":"TSUCHINOKO","text":"Scree! Scree scree!"},{"name":"VALAN","text":"Seeing them like this makes the whole thing seem like nonsense, but there's no denying Quinfort has been right about what would happen thus far."},{"name":"VALAN","text":"We have to figure out what the Children are up to before it's too late."}],"reward":{"gil":706},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69193]},"next":[69195]},"partials":[{"type":"npc","id":"1030819","obj":{"i":1030819,"n":"Valan","l":2957,"q":1}},{"type":"npc","id":"1030818","obj":{"i":1030818,"n":"Quinfort","l":2957,"q":2}},{"type":"quest","id":"69193","obj":{"i":69193,"n":"Slither Along","g":117,"l":"The Rak'tika Greatwood","s":4240,"f":1}},{"type":"quest","id":"69195","obj":{"i":69195,"n":"Snakes in the Grass","g":117,"l":"The Rak'tika Greatwood","s":4260,"f":1}}]}