{"quest":{"name":"Slither Along","location":"The Rak'tika Greatwood","id":69193,"patch":5.0,"sort":4240,"icon":100857,"unlocksFunction":1,"eventIcon":71341,"issuer":1029876,"target":1030824,"genre":117,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>Quinfort is enamored with his new companion.","Valan is not sure what to make of the creature Quinfort has found, but decides to indulge his friend nonetheless. Their first task is to carry the beast to Slitherbough and away from possible danger and prying eyes. Valan finds the serpent-like creature repulsive, and Quinfort believes himself unworthy of holding it, which leaves you as the only one who can see the deed done.<br><br>※Please note that the difficulty of this quest has been synced to your current level.","With the burlap sack firmly─but not too firmly, lest you upset Quinfort─in hand, you wend your way through the woods to Slitherbough.","After a frightful journey, tiptoeing past treants and overgrown beetles, you arrive safely at Slitherbough with the burlap sack. You find Valan in the corner of a cave where the shadows will hopefully offer a modicum of privacy. He suggests taking the snakelike creature out of the sack to ensure it is still in one piece.","Quinfort arrives not long after you, enthralled by what he believes to be a divine beast of the Greatwood. Valan continues to make light of the situation, but Quinfort assures him that he will save Slitherbough with the aid of the great serpent. "],"objectives":["Receive the snake-filled sack from Quinfort.","Carry the snake-filled sack to Valan at Slitherbough.","Check on the suspicious serpent."],"dialogue":[{"name":"VALAN","text":"&lt;sigh&gt; He seems to be serious about this."},{"name":"TSUCHINOKO","text":"Scree!"},{"name":"QUINFORT","text":"O great serpent, I beseech you─grant me the strength to defend the Night's Blessed, to stay the impending calamity that threatens the Greatwood."},{"name":"TSUCHINOKO","text":"Scree!"},{"name":"VALAN","text":"&lt;sigh&gt; I can't believe this is happening. Look, if you want to keep that thing as a pet, I won't stop you, but we really should return home."},{"name":"QUINFORT","text":"No, you're right. To remain here any longer could place the great serpent in danger."},{"name":"QUINFORT","text":"But the question is, how do we transport it? I will not stand to see the great serpent debase itself, crawling on its belly like a...like a..."},{"name":"VALAN","text":"A snake? Just pick up the damn thing and let's go. "},{"name":"QUINFORT","text":"By the abyss, Valan, show some respect! I <span class=\"emphasis\">should</span> be the one to carry it, but I fear I am yet unworthy of such a burden."},{"name":"QUINFORT","text":"But you─you could protect the great serpent from the threats of the Greatwood, be they beasts or sin eaters."},{"name":"VALAN","text":"And now you mean to drag Master Matoya's guest into your schemes? What will the others think when <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> walks into Slitherbough hoisting that thing about? "},{"name":"VALAN","text":"Here, put it in this sack."},{"name":"QUINFORT","text":"I will do no such thing!"},{"name":"VALAN","text":"It's clean, dry, and most importantly, you can bring it into Slitherbough unnoticed."},{"name":"QUINFORT","text":"Fine... Listen, <span class=\"highlight\">Forename</span>. The fate of the Greatwood quite literally rests in your hands. It goes without saying we can't afford any mishaps."},{"name":"VALAN","text":"&lt;sigh&gt; I suppose we've no choice but to help him. I'll go ahead and find a place to keep his pet away from prying eyes."},{"name":"SYSTEM03657","text":"Deliver the snake-filled sack to Valan in Slitherbough."},{"name":"SYSTEM03657","text":"You will have 150 seconds to complete the task. Should you fail, return to the starting location and begin anew."},{"name":"SYSTEM03657","text":"Be wary of attacks from enemies, which will sap your strength."},{"name":"TSUCHINOKO","text":"Scree!"},{"name":"QUINFORT","text":"Tread carefully, <span class=\"highlight\">Forename</span>. I will follow shortly after."},{"name":"QUINFORT","text":"How could you forget to take the great serpent with you? This task is not to be taken lightly."},{"name":"VALAN","text":"Here should be safe, for now at least."},{"name":"VALAN","text":"Let's have another look at the <span class=\"emphasis\">great serpent</span>, shall we?"},{"name":"VALAN","text":"Quinfort is still at the lake? I fear leaving him alone with that thing wasn't such a good idea."},{"name":"VALAN","text":"If Mother finds out about this, no shadow will be dark enough to hide from her wrath."},{"name":"QUINFORT","text":"Good work, you two. Oh, can you believe it? The divine protector of the Greatwood here in Slitherbough."},{"name":"QUINFORT","text":"“Within a sack of burlap did the champion carry the divine beast, and beneath the slithering boughs of the Greatwood did they find shelter.” <br>Chapter thirty-one, verse five in the <span class=\"emphasis\">Gospel of Quinfort</span>."},{"name":"VALAN","text":"&lt;sigh&gt; Pay him no mind... He's merely referring to his dream diary."},{"name":"QUINFORT","text":"For the last time, it is <span class=\"emphasis\">not</span> a diary. Have you forgotten how the gospel foretold the events of that fateful day two years ago?"},{"name":"VALAN","text":"How can I when you remind me of it every day?"},{"name":"QUINFORT","text":"You continue to doubt me but soon you'll see. Together, the great serpent and I will save this village, and all of the Greatwood, from oblivion!"},{"name":"TSUCHINOKO","text":"Scree! Scree!"},{"name":"VALAN","text":"What have we gotten ourselves into?"}],"reward":{"gil":715},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69192]},"next":[69194]},"partials":[{"type":"npc","id":"1029876","obj":{"i":1029876,"n":"Quinfort","l":2957,"q":1}},{"type":"npc","id":"1030824","obj":{"i":1030824,"n":"Great Serpent Of Ronka","l":2957,"q":1}},{"type":"quest","id":"69192","obj":{"i":69192,"n":"The Great Deceiver","g":117,"l":"The Rak'tika Greatwood","s":4230,"f":1}},{"type":"quest","id":"69194","obj":{"i":69194,"n":"Snake the Lead","g":117,"l":"The Rak'tika Greatwood","s":4250,"f":1}}]}