{"quest":{"name":"Towards the Firmament","location":"Ishgard","id":69208,"patch":5.1,"sort":1,"icon":100957,"unlocksFunction":1,"eventIcon":71341,"target":1031684,"genre":83,"journal":["Prominently posted, the notice fairly jumps out at you.","Glancing over the notice, you learn that a large-scale reconstruction project has commenced in the Ishgardian district called the Firmament, and able hands are being sought for the works. Interested parties are invited to seek out a man named Thomelin in the Brume to be shown to the district.","In the middle of your conversation with Thomelin, an old acquaintance arrives on the scene─Lord Francel de Haillenarte, whom you saved from a heretic's fate once upon a time. It is revealed that he was chosen to be lord overseer of the project, and thanks to his influence, you are given an exemption from requiring a work permit. Having informed you of his plan to survey the citizens to learn what they envision for the Firmament, he asks for the pleasure of your company before setting out for the Jeweled Crozier, where he expects to find a diverse assortment of people.","By a twist of fate, those citizens whom you surveyed were all your prior acquaintances─the ever-saucy Hilda, the ever-unflappable Briardien, and the ever-hopeless Emmanellain. Satisfied that he has heard enough, Francel turns to you to review what you have learned.","Your information gathering complete, Francel invites you to join him for an inspection of the Firmament, and directs you to present yourself to Thomelin to be shown in. You are entrusted with a bottle of mulled wine, which you are to present to the man when you see him.","Thomelin is deeply touched by the gift from Francel, which was delivered by the hands of a great hero, no less. Having expressed his profuse thanks, he offers to show you to the Firmament, where Francel awaits.","Bidding you welcome to the Firmament, Francel provides you with an overview of the reconstruction effort. Though determined to make the district into a vibrant, thriving place for highborn and lowborn alike, the young lord is all too keenly aware of the immensity of his task. It is then, as he is expressing self-doubt, that Edmont makes an unannounced appearance, and thanks to the retired count's sage advice, Francel finds a way forward once more. After Edmont takes his leave, you are introduced to a fellow named Augebert, the chief foreman of the project, with whom you may speak for directions on-site. Thus informed, you resolve to aid Francel and do your part to make the Firmament into a district for a new Ishgard."],"objectives":["Speak with Thomelin.","Wait for passersby at the Jeweled Crozier.","Speak with Francel.","Deliver the mulled wine to Thomelin.","Speak with Francel in the Firmament."],"dialogue":[{"name":"SYSTEM","text":"The notice reads: “Workers Sought for the Firmament Reconstruction Project.” In smaller letters, it continues..."},{"name":"POSTER03672","text":"“Let it be known that large-scale reconstruction works aimed at revitalizing the Holy See of Ishgard have been approved by the Houses of Lords and Commons."},{"name":"POSTER03672","text":"“Selected as the principal site for the project is the Firmament district, which sustained extensive damage during the war."},{"name":"POSTER03672","text":"“Willing and able hands are now sought to contribute to the reconstruction effort, regardless of birth and origin."},{"name":"POSTER03672","text":"“From those skilled in gathering from the land to those adept at creating with their hands, the project's needs are great and diverse."},{"name":"POSTER03672","text":"“Contributions will not go unrewarded. Interested parties are invited to present themselves in the Firmament.”"},{"name":"SYSTEM","text":"According to the note at the bottom of the notice, a man named Thomelin in the Brume will show you to the district."},{"name":"SYSTEM","text":"The notice reads: “Workers Sought for the Firmament Reconstruction Project.” If you are interested, a man named Thomelin in the Brume will show you to the district."},{"name":"THOMELIN","text":"Well met, friend. Answering the call of the Firmament, are you? Wonderful, wonderful!"},{"name":"THOMELIN","text":"...Wait! I-I know you! You're the savior of Ishgard!"},{"name":"THOMELIN","text":"Are you saying that you would contribute to the reconstruction project!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Yes, I'm ready and willing!"},{"name":"A1","text":"I chanced to see the notice..."},{"name":"THOMELIN","text":"To think that a fabled hero such as you would help to rebuild our city... We are grateful beyond words!"},{"name":"THOMELIN","text":"There is, er...just one trifling matter. Do you perchance possess a work permit? It is a requirement for non-Ishgardians, you see..."},{"name":"THOMELIN","text":"Is that so... As I recall, you are a ward of House Fortemps. In which case, perhaps an exception can be made. Alas, I don't have the authority to make such a decision."},{"name":"FRANCEL","text":"(-???-)Well, <span class=\"emphasis\">I</span> do─and I believe the permit can be overlooked in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> case."},{"name":"THOMELIN","text":"L-Lord Overseer! That you should grace us again!"},{"name":"FRANCEL","text":"Greetings, my friend. It has been quite a while. Indeed, I shouldn't be surprised if you have forgotten me."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Of course I haven't forgotten you!"},{"name":"A2","text":"Sorry, but I'm drawing a blank..."},{"name":"FRANCEL","text":"Honored am I that you should remember me. Much and more has happened since first we met, not least of all the war's end and Ishgard's transformation."},{"name":"FRANCEL","text":"You needn't apologize. Fairly buried in snow at Skyfire Locks as I was, I've had precious little opportunity to return to the Holy See."},{"name":"FRANCEL","text":"It shall be my pleasure to reintroduce myself. I am Francel, youngest son of House Haillenarte. You delivered me from a most dire predicament, once upon a time."},{"name":"FRANCEL","text":"It feels like an age ago that you and Lord Haurchefant saved me from a heretic's fate. You had proven your worth to me then. Even so, little did I expect that you would go on to save our entire nation."},{"name":"FRANCEL","text":"You are a hero to us all, and no amount of words could express my gratitude. No, only through action could I begin to repay the debt."},{"name":"FRANCEL","text":"Thus did I resolve to do my part for Ishgard, that I might honor those noble souls who risked life and limb to protect the nation─souls such as you and Lord Haurchefant."},{"name":"FRANCEL","text":"And so, when an overseer was being sought for the restoration project, I put forth my candidacy as the representative of my house. Our workshops and engineers could be put to good use, I reasoned."},{"name":"FRANCEL","text":"It was by no means unanimous, but the Fury saw fit to see me elected to the office. Honored am I for this opportunity to serve the nation─and to redeem House Haillenarte's good name."},{"name":"FRANCEL","text":"Yet the work has not been without its challenges. As the runt of a fallen house, I am somewhat lacking in repute, and this has made it a struggle to attract cooperation. We have had to rely heavily upon outside help, while I myself have been performing such odd tasks as I could."},{"name":"FRANCEL","text":"Owing to the contribution of artisans hailing from far and wide, the reconstruction itself proceeds apace. However, we are still shorthanded in the area of administration, on account of which I have been performing such odd tasks as I could."},{"name":"FRANCEL","text":"Owing to the contribution of artisans hailing from far and wide, we have accomplished our goal of rebuilding the district. However, we are still shorthanded in the area of administration, on account of which I have been performing such odd tasks as I could."},{"name":"FRANCEL","text":"Which is what brings me here today, as a matter of fact. I am about to go and survey our citizens in order to learn what they envision for the Firmament."},{"name":"FRANCEL","text":"If you can spare a moment, might I have the pleasure of your company? Well traveled as you are, your opinion would be of great interest to me, and I believe folk would be more willing to share their thoughts with you."},{"name":"FRANCEL","text":"You have my gratitude. Without further ado, then, let us take ourselves to the Jeweled Crozier. We are bound to find a diverse assortment of people there."},{"name":"THOMELIN","text":"You're still here, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>? I thought you were accompanying Lord Francel to the Jeweled Crozier?"},{"name":"FRANCEL","text":"Yes, this should be a suitable spot."},{"name":"SYSTEM","text":"Join Francel as he surveys passersby to learn their opinion of the Firmament."},{"name":"SYSTEM","text":"As the survey may take several minutes, you may wish to cancel any pending Duty Finder registrations."},{"name":"Q3","text":"Wait for passersby?"},{"name":"HILDA","text":"Well, well. I come here to get supplies for the watch, and what should I find but a familiar face."},{"name":"HILDA","text":"Well, well. I come here to get supplies for my Hounds, and what should I find but a familiar face."},{"name":"HILDA","text":"And if that ain't a pretty lad you've got with you, <span class=\"highlight\">Forename</span>, and a highborn one besides. You've done well for yourself."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"You know me─I always aim high."},{"name":"A4","text":"It's not what it looks like."},{"name":"HILDA","text":"Heh, I'm teasin', is all. Anyroad, it's good to see you, my friend. What brings you here?"},{"name":"FRANCEL","text":"Lady Hilda, your reputation precedes you. As you may be aware, approval was recently passed for the restoration of the Firmament. In order to build a district that best serves its residents, we would know what good citizens such as yourself envision for it. Will you not share with us your thoughts?"},{"name":"HILDA","text":"Ahhh, so you're the one they appointed overseer. Well then, you won't mind if I speak freely."},{"name":"HILDA","text":"Now, this ain't hardly revolutionary, but I want the Firmament to be a place we can all make an honest livin'. Where, if a man works hard enough, he can have a roof over his head and food in his belly."},{"name":"EUDESTAND","text":"Aye, might be as the war's over, but for a lot of us the struggle continues, same as afore. The sort o' struggle blue bloods will never know."},{"name":"HILDA","text":"Remember, Ishgard don't belong only to the high and the holy now. If the nation's to prosper, <span class=\"emphasis\">all</span> her citizens need to prosper."},{"name":"HILDA","text":"Well, we must be gettin' on. But if you've need of guards, feel free to send word. If the coin's fair, I reckon we can come to an arrangement."},{"name":"HILDA","text":"Well, we must be gettin' on. But if you've need of guards, feel free to send word. It's our job to preserve the peace, after all."},{"name":"FRANCEL","text":"Ah, that there is Lord Briardien. I had heard that he was traveling the realm in his capacity as a consulting inspector, but it appears he has returned to Ishgard."},{"name":"FRANCEL","text":"Like your good self, he is a well-traveled individual, and I should like to inquire after his opinion. Do you suppose we could beg a moment of his time?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"We meet again, Inspector!"},{"name":"A5","text":"A moment, good inspector!"},{"name":"A5","text":"You, there! The one with the spectacles!"},{"name":"BRIARDIEN","text":"Well, if it isn't <span class=\"highlight\">Forename</span>. I did not expect to see you here, busy as you have supposedly been of late."},{"name":"BRIARDIEN","text":"If it is an inspector you seek, you shan't find one more capable. Indeed, you could do worse─<span class=\"emphasis\">far</span> worse."},{"name":"BRIARDIEN","text":"To reduce the realm's preeminent inspector to a pair of spectacles... You are an impudent one indeed."},{"name":"FRANCEL","text":"Lord Briardien, a pleasure to make your acquaintance. I am Francel de Haillenarte, and I have the honor of overseeing the reconstruction of the Firmament."},{"name":"FRANCEL","text":"It is known that you are intimately familiar with all the city-states of Eorzea, and I should be much obliged for your insights. In your expert opinion, what is the one thing you believe that the Firmament needs most?"},{"name":"BRIARDIEN","text":"Hm... If the district is to thrive, then it must have a thriving economy. As I have oft observed in my travels, the flow of goods and people is as lifeblood to a city and should be encouraged."},{"name":"BRIARDIEN","text":"Ishgard has long been insular, but the recent changes present a great opportunity. Given the right planning, I am hopeful that ours may become a nation where no citizen lives in want."},{"name":"BRIARDIEN","text":"I bid you the very best in your endeavors. And should you have need of my investigative prowess, do not hesitate to call upon me. By your leave."},{"name":"BRIARDIEN","text":"Ah, one other matter, <span class=\"highlight\">Forename</span>. How fares your dim-witted friend? Still living a charmed life, no doubt, and somehow managing to solve cases despite his bumbling."},{"name":"BRIARDIEN","text":"...Actually, let us not speak of the imbecile. I feel my intellect draining away to simply think about him."},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"Ho there, old boy!"},{"name":"A6","text":"My brave and dashing Lord Emmanellain!"},{"name":"A6","text":"..."},{"name":"EMMANELLAIN","text":"<span class=\"highlight\">Forename</span>, I was wondering when you would notice me! Ever a pleasure to see you, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>!"},{"name":"EMMANELLAIN","text":"And there I thought a distressed damsel was crying out for the comfort of mine arms! You surely know how to get a man's hopes up, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>!"},{"name":"EMMANELLAIN","text":"What's this? How could you notice a comrade on the street and not say a word? You wound me, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>!"},{"name":"EMMANELLAIN","text":"And if it isn't my dear Lord Francel! How fares your lovely sister? Has she perchance spoken of me of late?"},{"name":"FRANCEL","text":"If Laniaitte has spoken of you, I fear it has not been in our conversations."},{"name":"FRANCEL","text":"Now, if I may change the subject, Lord Emmanellain, you will have heard that the restoration of the Firmament has commenced. Is there aught that you envision for the district?"},{"name":"EMMANELLAIN","text":"What <span class=\"emphasis\">I</span> envision? I can't say I've given it much thought..."},{"name":"EMMANELLAIN","text":"Well, what with the war finally come to an end, what is in order if not festivities? Yes, make the Firmament into a festive place, I say! A place where one and all may engage in revelry each and every day!"},{"name":"HONOROIT","text":"Beg pardons, my lord, but I believe Lord Francel seeks something more specific and, dare I say, <span class=\"emphasis\">constructive</span>."},{"name":"FRANCEL","text":"No, no, the advice comes from the heart, and I shall take it to heart. You have my gratitude, Lord Emmanellain."},{"name":"EMMANELLAIN","text":"Always a pleasure to aid a fellow man! Now then, we must be on our way. Take care, <span class=\"highlight\">Forename</span>, and don't do anything I wouldn't do!"},{"name":"EMMANELLAIN","text":"Oh, and Lord Francel─do send my fondest regards to your sister. Tell her...how very helpful I was. Yes, that's good."},{"name":"FRANCEL","text":"Well, I daresay we have spoken with enough people. Shall we conclude the surveying and review what we have learned?"},{"name":"FRANCEL","text":"Thanks to your presence, we were able to hear a diverse variety of opinions. Each one has merit─the question is whether the visions can be made reality..."},{"name":"FRANCEL","text":"No, no, such pessimism will not serve. I must have faith and try my earnest best."},{"name":"FRANCEL","text":"Now then, for all this talk of the Firmament, you haven't even seen it, have you? Would you care to inspect it with me?"},{"name":"FRANCEL","text":"I will be there for a while hence, so please join me at your leisure. Thomelin by the entrance will show you to the district."},{"name":"FRANCEL","text":"Oh, and when you see the man, would you mind giving him this? 'Tis bone-chilling work, standing there as he does, and it is a little something to keep him warm."},{"name":"FRANCEL","text":"I could as easily hand it to him, to be sure, but it would be all the more warming coming from the savior of Ishgard."},{"name":"FRANCEL","text":"With that, I shall go on ahead. See you in the Firmament, my friend."},{"name":"THOMELIN","text":"Welcome back, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>! Will you be heading to the Firmament?"},{"name":"THOMELIN","text":"From the lord overseer, you say? He truly is too kind!"},{"name":"THOMELIN","text":"Before I began working under Lord Francel, I had thought as little of highborns as I assumed they thought of us commoners. But my lord not only treats everyone as equals─he shows kindness to everyone."},{"name":"THOMELIN","text":"And to receive this gift from the hands of the savior of Ishgard <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>... I am touched beyond words. &lt;sniff&gt;"},{"name":"THOMELIN","text":"Thank you, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>! I shall enjoy the wine when I find a quiet moment!"},{"name":"THOMELIN","text":"Now then, I believe Lord Francel is expecting you in the Firmament. Just say the word, and I will show you through."},{"name":"EVENTAREA","text":"Proceed to the Firmament?"},{"name":"THOMELIN","text":"Will you be heading to the Firmament, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>? Just say the word, and I will show you through."},{"name":"EVENTAREA","text":"Proceed to the Firmament?"},{"name":"FRANCEL","text":"There you are, <span class=\"highlight\">Forename</span>. I bid you welcome to the Firmament!"},{"name":"FRANCEL","text":"The area in which we stand is named the Mendicant's Court, and we are presently preparing it for future works."},{"name":"FRANCEL","text":"Presently, we are in the midst of rebuilding the New Nest, a residential quarter for citizens."},{"name":"FRANCEL","text":"Presently, we are in the midst of rebuilding Featherfall, which will serve as the Firmament's main market and commercial district."},{"name":"FRANCEL","text":"Presently, we are in the midst of rebuilding the Risensong Quarter, which will serve as the Firmament's center of recreation and cultural pursuits."},{"name":"FRANCEL","text":"As you can see, the rebuilding itself is complete. This is but the beginning, however, and we must now turn our attention to the running of the district."},{"name":"FRANCEL","text":"We have much and more to do, but speaking to the people has stoked the fires of my determination. I want to make the Firmament into a vibrant, thriving district where highborn and lowborn alike may live side by side in harmony."},{"name":"FRANCEL","text":"Yet I would be lying were I to say the task does not daunt me. There is a limit to what I can achieve, especially given House Haillenarte's diminished influence..."},{"name":"EDMONT","text":"(-???-)Have I come at a bad time?"},{"name":"FRANCEL","text":"C-Count Edmont!"},{"name":"FRANCEL","text":"To what do we owe the honor...?"},{"name":"EDMONT","text":"Lest you forget, I am the Count de Fortemps no more. Just a retired old man."},{"name":"EDMONT","text":"As for my presence here, Emmanellain reported that <span class=\"highlight\">Forename</span> was in Ishgard, and I thought I would make a social call."},{"name":"EDMONT","text":"You will forgive me my eavesdropping, but it seems the reconstruction project is not immune to the uncertainty that has accompanied our nation's transition to a republic."},{"name":"EDMONT","text":"<span class=\"highlight\">Forename</span>─I am given to understand that the other nations have established residential districts for adventurer use. Is this true?"},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"Yes, I have a house in one."},{"name":"A7","text":"Yes, I've heard of such places."},{"name":"A7","text":"Sorry, I've been living under a rock..."},{"name":"FRANCEL","text":"There are districts specifically for adventurer use, and you possess an abode in one such place? I should like to pay you a visit one day, my friend!"},{"name":"FRANCEL","text":"Districts specifically for adventurer use, where they might possess their own abode? Intriguing..."},{"name":"FRANCEL","text":"I believe I have heard of such places in passing─districts specifically for adventurer use, where they might possess their own abode."},{"name":"EDMONT","text":"The truth is, our nation is divided by a gulf. While the redistribution of wealth may go some ways towards closing this gulf, it shall not lead to true independence for the masses."},{"name":"EDMONT","text":"We must ask ourselves, in this new age in which we live, what role should each one of us play? In pondering this dilemma, I believe that we may draw inspiration from adventurers and their independent lives."},{"name":"FRANCEL","text":"Independent lives... If we were to translate this into the Firmament, might it not assume the form of self-administration?"},{"name":"EDMONT","text":"It seems you have found a spark. In which case, this old man's ramblings have served their purpose. I shall pray for your success, Lord Francel."},{"name":"FRANCEL","text":"Your words are as a beacon in the dark, my lord. Thank you."},{"name":"EDMONT","text":"Well, <span class=\"highlight\">Forename</span>, you seem to be occupied at present, so I will leave you to your tasks. But when next we meet, I hope to be regaled with your recent adventures. As ever, our Fortemps Manor is at your disposal should you need a rest."},{"name":"AUGEBERT","text":"(-???-)You done talkin', Francel? 'Cause I'm itchin' to meet your hero friend."},{"name":"FRANCEL","text":"Yes, forgive me for the wait."},{"name":"FRANCEL","text":"<span class=\"highlight\">Forename</span>, permit me to introduce you to Augebert. Formerly an engineer of our house, he now serves as the project's chief foreman."},{"name":"FRANCEL","text":"It is thanks to his leadership on-site that I am able to focus my energies on the administrative aspects of the reconstruction."},{"name":"AUGEBERT","text":"Francel's told me all about you, <span class=\"highlight\">Forename</span>. First you save the whole bleedin' nation, now you're helping us rebuild it brick by brick. What can I say except it's great to have you on board."},{"name":"AUGEBERT","text":"If you have any questions about the work, I'd be happy to field them. Just save the tedious stuff like the budget for Francel, eh?"},{"name":"FRANCEL","text":"Speaking of which, if you can spare another moment, my friend, I should like to consult you on some administrative matters."},{"name":"FRANCEL","text":"Indeed, the work here takes precedent above all else, and it is my chief concern to facilitate it. In the course of which, I may well need to consult you again."},{"name":"FRANCEL","text":"With all the little tasks demanding my time, I cannot always be present on-site, but I endeavor to visit as often as possible─and I hope to see you often too!"},{"name":"SYSTEM","text":"You now have access to the Firmament. An option has been added to teleport here from the Foundation aetheryte."},{"name":"SYSTEM","text":"Speak with Augebert to learn about how you may contribute to the reconstruction effort."}],"reward":{"items":[{"num":5,"id":12862}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[67783]},"next":[69261,69296,69377,69384,69508,69578]},"partials":[{"type":"npc","id":"1031684","obj":{"i":1031684,"n":"Francel","l":3435,"q":2}},{"type":"item","id":"12862","obj":{"i":12862,"n":"Beet Soup","l":133,"c":24103,"t":46,"p":1105}},{"type":"quest","id":"67783","obj":{"i":67783,"n":"Litany of Peace","g":4,"l":"Ishgard","s":25}},{"type":"quest","id":"69261","obj":{"i":69261,"n":"A Home in the Firmament","g":83,"l":"The Firmament","s":11,"f":1}},{"type":"quest","id":"69296","obj":{"i":69296,"n":"The Mendicant's Court","g":0,"l":"The Firmament","s":0}},{"type":"quest","id":"69377","obj":{"i":69377,"n":"The New Nest","g":0,"l":"The Firmament","s":0}},{"type":"quest","id":"69384","obj":{"i":69384,"n":"Mislaid Plans","g":84,"l":"Ishgard","s":10001,"f":1}},{"type":"quest","id":"69508","obj":{"i":69508,"n":"Featherfall","g":0,"l":"The Firmament","s":0}},{"type":"quest","id":"69578","obj":{"i":69578,"n":"The Risensong Quarter","g":0,"l":"The Firmament","s":0}}]}