{"quest":{"name":"Fear and Delight","location":"Gridania","id":69204,"patch":5.0,"sort":181,"icon":100930,"eventIcon":71221,"issuer":1031537,"target":1031537,"genre":203,"journal":["The Adventurers' Guild investigator is deeply suspicious about...something.<br>※This quest is available for a limited time only.","You speak with the Adventurers' Guild investigator, who is─not for the first time─keeping a mistrustful eye on the Continental Circus, a troupe dedicated to celebrating All Saints' Wake. He reasons that, as its members are known to be voidsent fiends in disguise, the troupe must be up to something...though he admits he hasn't a clue as to what that might be. He asks that you inquire with the Impresario directly as to this year's events and ascertain what might be suspicious about them while he continues to skulk about the periphery.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","Though you do speak with the Impresario, his poetic monologue about the terrible delights of All Saints' Wake is interrupted before he can divulge anything of import. The source of said disruption is the troupe's voidtamer─who has discovered that the Circus ahriman has gone missing and is taking it rather personally. The Impresario requests your assistance in tracking it down, and as you certainly have no other investigative leads, you head to the Central Shroud to search.","You locate the Circus ahriman near the Jadeite Flood, where it has apparently fled due to anxiety over inadequacies in its job performance. A mysterious pumpkin-headed personage is having some success in comforting it─until the Impresario and troupe voidtamer appear and she vanishes into the shadows. Upon your fixing him with an annoyed glare, the Impresario remarks that you would be a suitable instructor for the ahriman, which must learn to utilize its dread gaze to fearsome effect if it is to perform its role in the Circus. This may as well happen, at this point, so you agree to try your hand at training it.","After instructing you to help the ahriman practice its dread gaze on hapless bystanders, the voidtamer assists you in climbing atop its head. Perhaps a bit of friendly encouragement will help it channel its inner horror. Or something.<br><br>※Speak with the troupe voidtamer in the Jadeite Thick to mount the Circus ahriman.","The Circus ahriman casts its somewhat less-than-dreadful gaze upon three adventurers in the Shroud. Though it fails to inspire more than mild surprise, it does serve as a festive reminder of All Saints' Wake, prompting all of them to dash off to celebrate the holiday. Were the Continental Circus's goal actually as straightforward as encouraging seasonal revelry, rather than terrorizing the populace to bring about the return of the Night of Devilry, you imagine the ahriman would make an excellent member of the troupe.","You report the training as a success to the voidtamer─which is not technically a lie, depending on one's perspective. Fortunately, he witnessed the three adventurers running past and assumed that they were fleeing in terror, and so is inclined to take you at your word.","You speak to the Impresario, who is more than willing to believe the voidtamer's interpretation of events, and at last recognizes the ahriman as a valuable member of the troupe. However, for what is likely a multitude of reasons at this point, it conveys that it would rather stay at your side instead. After some all-too-audible consideration as to whether this would further the Circus's goal of blanketing the realm in terror, he acquiesces.","The Adventurers' Guild investigator is pleased to hear that you have liberated one of the Circus's would-be instruments of terror and, understanding that the ahriman's gaze poses no actual threat, authorizes you to keep it. It will make a delightful companion for celebrating All Saints' Wake amongst the smallfolk and monsters both."],"objectives":["Speak with the Impresario at Mih Khetto's Amphitheatre.","Search for the Circus ahriman near the Jadeite Flood.","Speak with the troupe voidtamer.","Ride the ahriman and cast its Sort-of Dread Gaze upon bystanders.","Report to the troupe voidtamer.","Speak with the Impresario at Mih Khetto's Amphitheatre.","Report to the Adventurers' Guild investigator."],"dialogue":[{"name":"INVESTIGATOR03668","text":"Aha! I spy with my keenest of eyes <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who thwarted the evils of yesteryear! What a pleasant surprise it is to see you again. Would that I could say the same for that lot..."},{"name":"INVESTIGATOR03668","text":"You there! I have a keen eye, and you strike me as an adventurer worth <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> salt. Might I ask for a moment of your time in putting a stop to evils bent on consuming the realm?"},{"name":"INVESTIGATOR03668","text":"The Continental Circus, you see, has arrived once again─as it does every year when it comes time for All Saints' Wake─bringing ghosts and pumpkins and all manner of revelry to Eorzea."},{"name":"INVESTIGATOR03668","text":"I suspect, however, that the troupe is planning something rather more sinister than the distribution of sweet treats."},{"name":"INVESTIGATOR03668","text":"They're fell fiends in disguise, you understand. It's just what they <span class=\"emphasis\">do</span>."},{"name":"INVESTIGATOR03668","text":"I have been unable to discern the nature of their vile plot as yet, but I am certain that something is afoot. Thus do I ask that you assist in my investigation."},{"name":"INVESTIGATOR03668","text":"I need you to speak with the Impresario. Learn what manner of entertainment the troupe is offering this year, and perhaps trick him into revealing something of what they're really planning. I will continue to observe the other members for any sign of suspicious behavior."},{"name":"INVESTIGATOR03668","text":"After years spent as the guild's official investigator, nothing gets past my discerning eyes. <span class=\"emphasis\">Nothing.</span>"},{"name":"IMPHEAD","text":"A horrifying All Saints' Wake to you, traveler!"},{"name":"IMPHEAD","text":"...But yours is a face that I have seen before. My, it is always such a pleasure to see a soul that so appreciates All Saints' Wake."},{"name":"IMPHEAD","text":"Now...might this be your <span class=\"emphasis\">first</span> All Saints' Wake? Oh, how I envy you! That you may yet experience it for the first time!"},{"name":"IMPHEAD","text":"Oh, All Saints' Wake! Those unhallowed nights when we may feast and frolic, free from prying saintly eyes!"},{"name":"IMPHEAD","text":"Mortals once feared it, it is true, hiding from the creatures that stalked the shadows. But now..."},{"name":"IMPHEAD","text":"Now, it is perfectly safe─all the better to cast your cares aside and enjoy the devilish surprises our troupe has prepared for the occasion!  Why, they're positively <span class=\"emphasis\">dreadful</span>, if I do say so myse─"},{"name":"BEASTMASTER03668","text":"Oh, Impresario! It's dreadful! Dreadful, I say!"},{"name":"BEASTMASTER03668","text":"I raised that ahriman myself! Cared for it ever since it was a beady eye, newly torn from the Void by an unscrupulous peddler of exotic pets! And now it's deserted me! I feel so betrayed..."},{"name":"IMPHEAD","text":"Do you mean to say that the Circus ahriman has gone missing!? ...I suppose you do, as we've only the one."},{"name":"IMPHEAD","text":"This is troubling indeed. My dear <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">fellow</span></span>, might I ask that you aid us in searching for the missing creature?"},{"name":"IMPHEAD","text":"I hate to think of what might become of it, were it to be spotted by one who─er, <span class=\"emphasis\">mistook</span> it for an agent of evil..."},{"name":"BEASTMASTER03668","text":"How dreadfully kind of you!"},{"name":"IMPHEAD","text":"Now, were I an ahriman─though I most certainly am not─I believe that I might find the crowds of the city intimidating. In which case, we had best turn our gaze upon the surrounding wilds instead. Perhaps the Central Shroud, to begin with─it can't have gotten far."},{"name":"INVESTIGATOR03668","text":"You're on an errand for the Impresario? Well...I suppose that's one means of investigating what he's up to. Fear not─while you're gone, I will keep an eye on things here."},{"name":"PUMPKIN","text":"Oh, I know you... I know you well."},{"name":"PUMPKIN","text":"Well, now... I don't believe that we've met."},{"name":"PUMPKIN","text":"Are you acquainted with this little one?"},{"name":"PUMPKIN","text":"It tells me that it's been working with the Circus, but it struggles to satisfy the Impresario's demands."},{"name":"PUMPKIN","text":"Oh, sweetheart, you're not a disappointment. And your eye is charming. Yes, it is."},{"name":"PUMPKIN","text":"Perhaps you are somewhat...different, but that's nothing to feel ashamed of. Isn't that right, hero?"},{"name":"BEASTMASTER03668","text":"Impresario! Over here!"},{"name":"IMPHEAD","text":"Ah, you found it! But why did the two of you not return right away?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What happened to the pumpkin-headed lady?"},{"name":"A1","text":"We were talking to someone a moment ago..."},{"name":"IMPHEAD","text":"A pumpkin-headed woman who disappeared without a trace? Why, you could only be speaking of the legendary leader of the armies of darkness─the Great Gourd herself!"},{"name":"IMPHEAD","text":"A mysterious figure who comes and goes at will? Why, that sounds to me like the ogre pumpkinhead, she who ushers in the Night of Devilry!"},{"name":"IMPHEAD","text":"...I jest, of course! The ogre pumpkinhead would hardly break her silence after all of these years to speak with <span class=\"emphasis\">you</span>!"},{"name":"IMPHEAD","text":"Er... What I meant, of course, is that the Great Gourd is merely a fable! If she were real, I am sure she would be delighted─no, <span class=\"emphasis\">honored</span>─to know you! As are we all!"},{"name":"IMPHEAD","text":"My, you possess a spectacularly spine-chilling glare. It's enough to terrorize a voidsent! I mean...it <span class=\"emphasis\">would</span> be. I assume."},{"name":"IMPHEAD","text":"In fact... It is so very horrific that, were one seeking to train in the art of the dread gaze, there could be no better instructor─not even among fiends!"},{"name":"IMPHEAD","text":"And as it happens, we are in need of just such a tutor. We at the Continental Circus have standards to maintain, you see. To play a part in our troupe, one must be able to project a certain air of...eeriness. All in the name of delighting the public, of course."},{"name":"IMPHEAD","text":"Alas, our friend here's gaze is somewhat...less than dreadful. Which simply will not do─particularly for an ahriman. I'm sure you understand. Under your tutelage, however, it may yet become a valued member of the Circus."},{"name":"IMPHEAD","text":"Marvelous! Then it's decided. Our ahriman shall be your pupil."},{"name":"BEASTMASTER03668","text":"I...suppose. You will need to learn to ride it if you're to train it properly, though. Come, I'll show you."},{"name":"IMPHEAD","text":"And once you mold it into a monster that inspires the deepest dread, a force for evil that renders even the most stalwart of mortals voiceless and trembling...our true work will begin!"},{"name":"IMPHEAD","text":"We shall usher in the Night of Devilry at long last! Recall the Great Gourd from her slumber, and feast as the world cowers before us!"},{"name":"IMPHEAD","text":"How is the ahriman's gaze coming along? It is chilling? Spine-tingling? Enough to kill a man from two-hundred yalms away?"},{"name":"BEASTMASTER03668","text":"The ahriman is well trained─or at least I thought so until it <span class=\"emphasis\">ran off on me</span>. Ahem. In any case, it ought to bear you as a passenger without objection."},{"name":"BEASTMASTER03668","text":"I ask that you help it practice gazing upon unsuspecting fools until it gets the hang of doing so...dreadfully."},{"name":"BEASTMASTER03668","text":"When it has learned to perform to your satisfaction, please accompany it back here to me. I should hate to be abandoned by my own ahriman. Again."},{"name":"BEASTMASTER03668","text":"I understand that it is a bit...round, so if you fall off, return to me and I will help you reseat yourself. Now, up you go!"},{"name":"BEASTMASTER03668","text":"Taken a tumble, have you? Never you mind─I've fallen off of its head and onto mine more times than I can count! Back up you go!"},{"name":"ADVENTURERA03668","text":"There must be fiends around here <span class=\"emphasis\">somewhere</span>... How am I meant to get anyone to call me “Fiendslayer” if I can't find any fiends?"},{"name":"ADVENTURERB03668","text":"Ugh, no one ever told me that adventuring was so tedious. And my feet hurt! And I'm hungry..."},{"name":"ADVENTURERC03668","text":"Another adventurer? Well, you had best find a different place to hunt. And the diremite webs are mine, got it?"},{"name":"ADVENTURERA03668","text":"B-Back, fiend, or you shall taste my blade!"},{"name":"ADVENTURERA03668","text":"Oh, that was...rather festive, actually? And that hat! It's fantastic!"},{"name":"ADVENTURERA03668","text":"Dear me, I had nearly forgotten that the All Saints' Wake season was upon us! Fiend-slaying can wait─I must don my guise posthaste!"},{"name":"ADVENTURERB03668","text":"Oh my! What an adorable giant eyeball you are! And dressed for All Saints' Wake, too!"},{"name":"ADVENTURERB03668","text":"I wish <span class=\"emphasis\">I</span> were celebrating instead of training out here. “Slay three squirrels,” they said. “It'll be a challenge,” they said. You know what? I'm done here. I'm going back to town to stuff myself with pumpkin cookies!"},{"name":"ADVENTURERC03668","text":"Eurgh! Well, that was very...weird of you, but you won't scare me away from my hunting spot that easily!"},{"name":"ADVENTURERC03668","text":"Oh, you're with the Continental Circus? What a coincidence─I love All Saints' Wake! I'm out here hunting for diremite webs to decorate my cottage for the occasion, in fact."},{"name":"ADVENTURERC03668","text":"But if the festivities have already begun... I must hurry back to Gridania! I would hate to miss a single ghost! Or voidsent! Or spider!"},{"name":"BEASTMASTER03668","text":"You must have been terrifying─I saw three people running at such speed that they could only have been desperate to reach the safety of their homes. Extraordinary!"},{"name":"BEASTMASTER03668","text":"I'm ever-so-slightly offended that the ahriman seems to have responded better to your training than mine...but what matters is that it has proven itself useful."},{"name":"BEASTMASTER03668","text":"We can only hope that this is enough to satisfy the Impresario. I don't think either of us could stand another lecture on the “fundamentals of fear.”"},{"name":"BEASTMASTER03668","text":"In any case, he ought to be informed of your progress immediately. He doesn't like to be kept waiting."},{"name":"BEASTMASTER03668","text":"We will meet you at the amphitheatre─voidsent must be escorted by someone with the proper permissions to enter the city."},{"name":"BEASTMASTER03668","text":"...And anyway, I'm not keen on letting it out of my sight again."},{"name":"IMPHEAD","text":"Ah, you've returned! And how did the ahriman fare in its lessons?"},{"name":"BEASTMASTER03668","text":"Splendidly! It sent not merely one, but <span class=\"emphasis\">three</span> souls hastening home to quiver under their blankets. It has clearly learned to wield its dread gaze!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"That's...not entirely accurate."},{"name":"A2","text":"In a manner of speaking..."},{"name":"A2","text":"That is absolutely, positively what happened."},{"name":"IMPHEAD","text":"Ah, but I saw them as well! All three running as if flames were licking at their heels!"},{"name":"IMPHEAD","text":"No need to be modest! If its gaze has become even half as horrific as yours, I have no doubt that it is capable of chilling victims to the bone!"},{"name":"IMPHEAD","text":"Just as I anticipated! The instant you fixed me with your stare, I knew that true evil lay within! I am delighted that you were able to share a bit of that with our ahriman."},{"name":"IMPHEAD","text":"And you, young ahriman─congratulations! You have proven yourself to be a worthy member of the troupe."},{"name":"IMPHEAD","text":"Go forth, and terrorize the masses!"},{"name":"BEASTMASTER03668","text":"You traitorous little─ You want to go with <span class=\"emphasis\"><span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span></span>?"},{"name":"IMPHEAD","text":"Hm... I'm not certain we can afford to part with such a valuable asset."},{"name":"IMPHEAD","text":"On the other hand... So long as it continues to terrify, it needn't necessarily remain here to be of assistance. In fact, traveling would bring it into contact with even more victims... "},{"name":"IMPHEAD","text":"Very well! I am moved by your heartfelt plea, ahriman! I will permit you a leave of absence─so long as you continue to emulate your horrifying companion."},{"name":"IMPHEAD","text":"Guide it well, adventurer. I look forward to seeing what horrors you visit upon the realm!"},{"name":"PUMPKIN","text":"My foolish children, ever eager to reclaim what was never truly lost."},{"name":"PUMPKIN","text":"Its devilry takes a different form, but the night goes on─haunted by monster and mortal both."},{"name":"PUMPKIN","text":"And though you may think me absent, my eye is ever upon you..."},{"name":"PUMPKIN","text":"So <span class=\"emphasis\">do</span> have fun."},{"name":"IMPHEAD","text":"I leave our ahriman in your sinister hands!"},{"name":"BEASTMASTER03668","text":"Abandoned, just like that! I can't believe it!"},{"name":"INVESTIGATOR03668","text":"You've returned at last! Did you uncover any unhallowed plots?"},{"name":"INVESTIGATOR03668","text":"They attempted to train an ahriman to terrorize the populace, but it's your friend now? Well!"},{"name":"INVESTIGATOR03668","text":"As long as it poses no risk to others, I don't see the harm in it accompanying you. Though I will make a note of this in the guild records, just in case."},{"name":"INVESTIGATOR03668","text":"I appreciate your willingness to get hands-on with this investigation. Speaking of which..."},{"name":"INVESTIGATOR03668","text":"For my part, I have observed the troupe moving large quantities of supplies and issuing invitations to some manner of gathering."},{"name":"INVESTIGATOR03668","text":"Based on past experience, I cannot help but have a bad feeling about this..."}],"reward":{"gil":353,"items":[{"id":26784}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[65781,66211]},"next":[69205,69206]},"partials":[{"type":"npc","id":"1031537","obj":{"i":1031537,"n":"Adventurers' Guild Investigator","l":53,"q":2}},{"type":"item","id":"26784","obj":{"i":26784,"n":"Circus Resonator","l":1,"c":22632,"t":63}},{"type":"quest","id":"65781","obj":{"i":65781,"n":"It's Probably Pirates","g":1,"l":"Limsa Lominsa","s":91}},{"type":"quest","id":"66211","obj":{"i":66211,"n":"It's Probably Pirates","g":0,"l":"Limsa Lominsa","s":91}},{"type":"quest","id":"69205","obj":{"i":69205,"n":"A Glamourous Guise","g":203,"l":"Gridania","s":181}},{"type":"quest","id":"69206","obj":{"i":69206,"n":"Haunting Grounds","g":203,"l":"Gridania","s":181,"f":1}}]}