{"quest":{"name":"Haunting Grounds","location":"Gridania","id":69206,"patch":5.0,"sort":181,"icon":112196,"unlocksFunction":1,"eventIcon":71341,"issuer":1031537,"target":1031548,"genre":203,"journal":["The Adventurers' Guild investigator is suspicious of something else, now.<br>※This quest is available for a limited time only.","Upon inquiring as to what the investigator's other concerns regarding the Continental Circus might be, he explains that he has cause to believe that would-be attendees of their masquerade are being spirited away to another location entirely─and that said location is fraught with fiends and other dangers. He requests that you, in the name of public safety, infiltrate this apparently haunted manor to ensure that no victims have been trapped within.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","At the investigator's suggestion, you speak with the enthralling illusionist, who appears genuinely quite delighted to explain how you might enter the manor─by simply asking a harlequin guide to escort you. She also cautions, however, that you had best understand the rules to the extent that your mundane consciousness allows if you intend to survive it..."],"objectives":["Speak with the enthralling illusionist."],"dialogue":[{"name":"INVESTIGATOR03670","text":"You're willing to help me investigate further? That's a relief! One simply cannot be too careful when it comes to the Continental Circus..."},{"name":"INVESTIGATOR03670","text":"I know not whether you yourself have yet received an invitation, but the troupe is once again hosting a masquerade event in a vacant manor nearby. Now, we've received no complaints this year from those who have <span class=\"emphasis\">successfully</span> attended this event. However..."},{"name":"INVESTIGATOR03670","text":"Others have reported that they were escorted to what they assumed was the venue for the masquerade, only to find themselves pursued by fiends through the echoing corridors of a haunted mansion!"},{"name":"INVESTIGATOR03670","text":"I grant that some people enjoy that sort of thing, bizarre though it may be. However, the guild would be remiss were we not to ensure that none have become lost or trapped in such a clearly unsafe location."},{"name":"INVESTIGATOR03670","text":"We can hardly ask the troupe for its cooperation in this matter, as I doubt that their intentions in terrifying unsuspecting revelers are pure. Of course, the only other option is to infiltrate the manor─and this is the course that I would ask you to pursue."},{"name":"INVESTIGATOR03670","text":"I believe that your first step should be to speak with the illusionist over there. Over the course of my observing the troupe's movements, I have seen her conversing with at least two people that would later report having been to the haunted manor."},{"name":"INVESTIGATOR03670","text":"To be quite honest, if you were to ask nicely, the illusionist might be willing to take you to the haunted manor straightaway. They're not the brightest, these fiends."},{"name":"WITCH03670","text":"Well, aren't you an appetizing little morsel! What can I do for you?"},{"name":"WITCH03670","text":"You <span class=\"emphasis\">want</span> to enter the haunted manor? Well then, of course you may! How could we refuse someone so charmingly foolhardy?"},{"name":"WITCH03670","text":"You need only speak to one of our dear harlequin guides to be escorted to the site of your future nightmares!"},{"name":"WITCH03670","text":"Of course, you may want to ask for a teensy little hint on how to survive, before you do... Else your mind shan't remain intact for long!"},{"name":"WITCH03670","text":"Our manor isn't like the dreary, predictable spaces of your mundane world, you know. Oh, it has rules, to be sure─but they are fewer, and the consequences for breaking them all the greater for it..."},{"name":"WITCH03670","text":"Good luck, dear!"},{"name":"SYSTEM","text":"You now have access to the Haunted Manor seasonal instance. To enter the manor, speak with the harlequin guide in either Mih Khetto's Amphitheatre or the Acorn Orchard."},{"name":"SYSTEM","text":"The Haunted Manor is a light party instance (four players). There are no class, job, or level requirements for participation."},{"name":"SYSTEM","text":"Parties that register for the instance with less than four members will be filled out automatically via the matching system."}],"reward":{"gil":210},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69204]}},"partials":[{"type":"npc","id":"1031537","obj":{"i":1031537,"n":"Adventurers' Guild Investigator","l":53,"q":2}},{"type":"npc","id":"1031548","obj":{"i":1031548,"n":"Enthralling Illusionist","l":53,"q":1}},{"type":"quest","id":"69204","obj":{"i":69204,"n":"Fear and Delight","g":203,"l":"Gridania","s":181}}]}