{"quest":{"name":"Word about Komra","location":"Kholusia","id":69207,"patch":5.0,"sort":1,"unlocksFunction":1,"eventIcon":71341,"issuer":1031577,"target":1031577,"genre":24,"journal":["<span class=\"highlight-red\"> Quest Sync</span><br>A new rumor has the dwarves of Komra in a right tizzy."],"objectives":["Speak with the dig site watch.","Speak with the dig site chief.","Speak with Anogg.","Search for the automaton core.","Deliver the automaton core to Anogg.","Search for the mining lantern.","Deliver the mining lantern to the dig site chief.","Speak with the gossipy dwarf."],"dialogue":[{"name":"RUMORSDWARF03671","text":"You heard the latest rumor out of Komra? The strangest find in recent memory, though actual details as to what said find actually is have yet to emerge."},{"name":"RUMORSDWARF03671","text":"If you do happen to come into any juicy tidbits, I'd be keen to hear 'em. The suspense is killing me here..."},{"name":"RUMORSDWARF03671","text":"Remember: I'm the one what put you on the scent! So if you learn any exciting secrets, you'd best share them with me! 'Tis only fair!"},{"name":"TUNNELGUARD03671","text":"I can neither confirm nor deny the existence of a new discovery of untold value that only a select few are allowed to see for themselves."},{"name":"TUNNELGUARD03671","text":"That said...there may come a time when I find myself utterly fascinated by that pile of rocks over there and would be completely oblivious to anyone attempting to sneak past..."},{"name":"TUNNELGUARD03671","text":"..."},{"name":"TUNNELGUARD03671","text":"...You're a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of the world, ain't you? Don't make me say it plain."},{"name":"TUNNELGUARD03671","text":"Wicked white! How bloody stupid are you!?"},{"name":"TUNNELGUARD03671","text":"You─the imbecile─give me─the guard─ten thousand gil. Then you─the imbecile─get to walk past me─the guard─and see the amazing find. Got it?"},{"name":"Q1","text":"Bribe the guard?"},{"name":"TUNNELGUARD03671","text":"Then you do not get to pass. You go away! Good day, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>!"},{"name":"TUNNELGUARD03671","text":"Heh heh, about time you started playing by the rules..."},{"name":"DWARFMASTER03671","text":"Lali-what in the blazing hells do you think you're doing man-ho!? Is that any way for a guard to behave? Is it!?"},{"name":"TUNNELGUARD03671","text":"N-N-No sir, Chief! Sir!"},{"name":"DWARFMASTER03671","text":"No rations for you tonight!"},{"name":"TUNNELGUARD03671","text":"Chief, no! Mercy! Meeeeeercy!"},{"name":"TUNNELGUARD03671","text":"It's...&lt;sniffle&gt;...it's not fair, I tell you... A dwarf toils day in and day out for a pittance, only to try and make a little something extra on the side, and what does it get him... &lt;sob&gt;"},{"name":"TUNNELGUARD03671","text":"Right, well, anyway─bugger off. None may pass without the Chief's permission, which I know you haven't got."},{"name":"TUNNELGUARD03671","text":"Oh look, it's the sinner who cost me my dinner. Go hassle the chief if you want to go in, 'cause I sure as hells ain't letting you pass."},{"name":"DWARFMASTER03671","text":"No time for you, friend. We've our hands full with this latest find of ours..."},{"name":"DWARFMASTER03671","text":"Wait, wait, don't tell me. I assume you came all this way to put in for the position? Sorry, but it's already been filled."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Came all this way for the what-now?"},{"name":"A2","text":"You know what they say about assumptions..."},{"name":"DWARFMASTER03671","text":"Eh? Don't go playing silly buggers with me. The queer ruins we found deep in a cavern through a tunnel over there! The one filled with all kinds of machina? To the point we've started calling it a bloody machina graveyard?"},{"name":"DWARFMASTER03671","text":"Yes, well, we were looking to hire on another guard, but the position's since been filled by that fellow what tried to swindle you a moment ago."},{"name":"DWARFMASTER03671","text":"So you're out of luck, I'm afraid. But chin up, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. Your time'll come round again soon enough."},{"name":"DWARFMASTER03671","text":"Since you're here and still unemployed, mind delivering a message for me? It's for two younglings in Komra, Anogg and Konogg─sister and brother, twins. Fond of wearing white and black. Twin thing, I suppose."},{"name":"DWARFMASTER03671","text":"The message is as follows: “Lali-bleeding-ho! This is no place for children to be messing about! Stay far, far, far away, or else!” Got it?"},{"name":"TUNNELGUARD03671","text":"If I told you several times before you're not getting in, what makes you think I've since changed my mind? I mean, think about it..."},{"name":"DWARFMASTER03671","text":"Anogg and Konogg, wearing white and black. You'll know 'em when you see 'em. And don't forget the lali-bleeding-ho!"},{"name":"ANOGG","text":"Hm? You got business with us?"},{"name":"ANOGG","text":"...The chief put you up to this? And you <span class=\"emphasis\">agreed</span>? Haven't you got anything better to do with your time?"},{"name":"KONOGG","text":"Wait...those garments...that quiet confidence...those powerful neck muscles sculpted by a lifetime of nodding..."},{"name":"KONOGG","text":"(This is that sinner everyone's been talking about, Sister! <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s the guileless fool we've been waiting for! The perfect patsy!)"},{"name":"ANOGG","text":"(Good thinking, Brother. Let's get right to it, then!)"},{"name":"ANOGG","text":"Ah... Ahem! You wouldn't happen to be that kindly stranger everyone likes and adores? You are, aren't you!? Perhaps you would be willing to do us a teensy little favor? Of course you would!"},{"name":"ANOGG","text":"My brother and I are conducting some highly secret research at the moment, but we've hit a dead end. To continue, we need to get our hands on an automaton core..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"...So I'm to be your patsy?"},{"name":"A3","text":"Good luck with that."},{"name":"KONOGG","text":"Oh, don't be silly! Everyone knows you're the soul of generosity! A sinner who cannot help but render aid to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fellow sinner in their hour of need! Not for fame or fortune or any other reward, but simply for the joy of it! Am I wrong?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"...This is another one of those moments where it really doesn't matter what I have to say, isn't it?"},{"name":"A4","text":"Oh, sod this."},{"name":"ANOGG","text":"How rude!"},{"name":"KONOGG","text":"So rude!"},{"name":"ANOGG","text":"But despite your vehement refusal, deep down we both know you cannot help but aid us in our endeavor. 'Tis your nature. We will pretend that you agreed without a fuss and that will be the end of it."},{"name":"ANOGG","text":"Now you're on the trolley."},{"name":"KONOGG","text":"The core we require is being stored with other sundry materials on the cliffs above us. Once you have it, bring it to my sister."},{"name":"ANOGG","text":"As soon as you have that automaton core, bring it to me straightaway."},{"name":"KONOGG","text":"Don't dally, sinner! We need that core for our research!"},{"name":"KONOGG","text":"Can't you see we're in the middle of a very important conversation?"},{"name":"DWARFMASTER03671","text":"You gave 'em the ol' lali-bleeding-ho, did you? Hope they took it to heart."},{"name":"ANOGG","text":"Ahh, there's the sinner now!"},{"name":"KONOGG","text":"And is that the core I spy in <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> hot little hands?"},{"name":"ANOGG","text":"Heh heh heh, brilliant! All we've got to do is sell this for a small fortune, and then we'll be one step closer to seeing our plans for world domination to fruition..."},{"name":"KONOGG","text":"(Oi, Anogg! Lali-nay on the domination-ho!)"},{"name":"ANOGG","text":"(Oh, right! That was a close one, Brother!)"},{"name":"KONOGG","text":"Now then, for our next request..."},{"name":"DWARFMASTER03671","text":"Lali-what in the hells are you two up to-ho!? If you're even thinking of taking advantage of this good sinner, I'll tan both your hides and toss you from the top of White Oil Falls! Now get you gone!"},{"name":"ANOGG","text":"(-Anogg and Konogg-)Sir, yes, sir!"},{"name":"DWARFMASTER03671","text":"Sorry about that. They don't know any better, on account of them being all on their own. No parents."},{"name":"DWARFMASTER03671","text":"They've lost more than most, you could say. More than anyone ever should."},{"name":"DWARFMASTER03671","text":"Anyway, I've been meaning to ask. Everyone says you're the soul of generosity─a sinner who cannot help but render aid to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fellow sinner in their hour of need. Not for fame or fortune or any other reward, but simply for the joy of it. Am I wrong?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"..."},{"name":"A5","text":"I'd swear you just repeated nearly word for word what those two...never mind."},{"name":"DWARFMASTER03671","text":"We're short a lantern at the dig site. Should be another in the cave just outside of the village. Mind going and fetching it for me? 'Course you don't."},{"name":"DWARFMASTER03671","text":"Once you've got it, bring it to me back at the dig. Oh, and don't worry─I'll see you compensated for the trouble."},{"name":"DWARFMASTER03671","text":"Got that lantern for me? No? It should be in the cave just outside of town."},{"name":"DWARFMASTER03671","text":"There you are. I presume that lantern you're holding's for yours truly?"},{"name":"DWARFMASTER03671","text":"Much obliged. Here─a little something for your trouble."},{"name":"DWARFMASTER03671","text":"Never let it be said a dwarf of character doesn't pay his debts. Anyway, if we've nothing else to discuss..."},{"name":"ANOGG","text":"Just let us pass already!"},{"name":"KONOGG","text":"We want to see the ruins! Please please please please please!?"},{"name":"TUNNELGUARD03671","text":"No, no, no, no, no. It's dangerous and off-limits and even if I were the sort of man who could be bribed─which I'm not─I'd be shocked if you two had anything valuable enough for me to risk my neck looking the other way."},{"name":"TUNNELGUARD03671","text":"Why are you and everyone else so bloody obsessed with trying to get a look at the cavern filled with mysterious machina anyway? It's just a bloody scrap heap, isn't it?"},{"name":"ANOGG","text":"No no─it's so much more! Based on our research, we have reason to believe that those ruins contain─"},{"name":"KONOGG","text":"(Hush, Sister! How many times must you nearly give the game away!? It's supposed to be our secret!)"},{"name":"ANOGG","text":"(Oh, yes, right. Right. It's just so hard sometimes to contain my enthusiasm...)"},{"name":"KONOGG","text":"Nothing. These ruins contain nothing of value whatsoever. We shall leave you to your affairs, honorable guard sir, and bid thee farewell."},{"name":"DWARFMASTER03671","text":"Honestly, I'm beginning to hope that there really is nothing of value in there, for all the trouble it's causing. But as I was about to say─if we've got nothing else to discuss, then you'd best be on your way. It's dangerous to wander about an active dig, and I don't want anyone getting hurt."},{"name":"ANOGG","text":"What does it matter to you if we go through? It's not like it's your find! You have nothing to lose!"},{"name":"KONOGG","text":"You really must let us through. It's a matter of the utmost importance!"},{"name":"TUNNELGUARD03671","text":"...What in the hells are you two on about?"},{"name":"RUMORSDWARF03671","text":"Poked around Komra, did you? Learn anything about that big find?"},{"name":"RUMORSDWARF03671","text":"A machine graveyard, eh? Interesting, interesting... This could be the beginning of a great and grand adventure. Or an utterly nonsensical one─though that does have its appeal on occasion, I'll allow."},{"name":"DWARFMASTER03671","text":"Folks ought to keep busy, that's my motto. Idle hands are the fae's playthings."},{"name":"TUNNELGUARD03671","text":"Wicked white, if you start pestering me like those twins to get inside... &lt;sigh&gt; I tell you, what's the point of being a guard if you can't profit off it? Why would anyone ever take this job?"}],"reward":{"gil":1279,"items":[{"num":2,"id":27877,"one":1},{"num":2,"id":27879,"one":1},{"num":2,"id":27880,"one":1},{"num":2,"id":27881,"one":1},{"num":3,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":70,"id":34}],"quests":[69173]},"next":[69253]},"partials":[{"type":"npc","id":"1031577","obj":{"i":1031577,"n":"Gossipy Dwarf","l":2954,"q":2}},{"type":"item","id":"27877","obj":{"i":27877,"n":"Paella","l":418,"c":24031,"t":46}},{"type":"item","id":"27879","obj":{"i":27879,"n":"Ovim Cordon Bleu","l":430,"c":24363,"t":46}},{"type":"item","id":"27880","obj":{"i":27880,"n":"Lemonade","l":430,"c":24404,"t":46}},{"type":"item","id":"27881","obj":{"i":27881,"n":"Jellied Harcot","l":430,"c":24082,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69173","obj":{"i":69173,"n":"Meet the Tholls","g":8,"l":"Kholusia","s":890}},{"type":"quest","id":"69253","obj":{"i":69253,"n":"A Scandal in Komra","g":24,"l":"Kholusia","s":10,"f":1}}]}