{"quest":{"name":"Shaken Resolve","location":"The Rising Stones","id":69209,"patch":5.1,"sort":10,"icon":100939,"eventIcon":71201,"issuer":1031257,"target":1032121,"genre":9,"journal":["Tataru seems eager to make up for lost time.","Tataru's obvious relief at your presence soon gives way to chattiness, and she wastes no time apprising you of recent events. It would seem the fighting at the Ghimlyt Dark has ceased, and that nothing else of any great import has happened in your absence. Wishing to take advantage of this relative lull in activity, she invites you to tell her of your adventures in the First, the mention of which reminds her that F'lhaminn is also eager to know what became of Minfilia. With this in mind, she bids you wait for her on the terrace at the House of Splendors.","Tataru and F'lhaminn hang on your every word as you tell them of the First, of Minfilia's sacrifice, and of the young girl Ryne who now carries on her legacy. Before you can continue, however, an unexpected guest arrives─Riol. Tataru had hoped he would bring word from her helper behind enemy lines, but he has apparently received no communication of any kind. Fearing the worst, Riol is resolved to sneak into the Empire himself in the hopes he might finally make contact. Before taking his leave, however, he remembers to tell you that Krile has come to the Rising Stones. She apparently wishes to speak with you about the plight of your friends marooned in the First.","Krile enters the main hall, offering a greeting absent the cheerful tones to which you are accustomed. She has, you learn, just finished an examination of the stricken Scions, confirming suspicions she had hoped would prove false─the tenuous link between their bodies and their souls is weakening. Time is of the essence, and thus she bids you return to the First to inform the others of your discovery. While you do so, she will consult Master Matoya on a means to maintain the stability of their corporeal aether for as long as possible.","Your comrades seem unsurprised by Krile's findings, but the gravity of the situation is not lost on them. After a brief discussion, they settle upon a novel solution: to pour their spirits into auracite, theoretically enabling you to bear them safely across the rift and back to the Source as you would inanimate possessions. This will, however, require knowledge of soul preservation and transference, subjects wholly unfamiliar to all present. Luckily, the Crystal Exarch may know of someone who can help."],"objectives":["Speak with F'lhaminn at the House of Splendors.","Speak with Tataru at the Rising Stones.","Speak with the Crystal Exarch in the Ocular."],"dialogue":[{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>! Gods, it's good to see you. I hope your being here means you've had your fill of rest?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"More than my fill!"},{"name":"A2","text":"Not so much as forty winks, truth be told..."},{"name":"TATARU","text":"Well, you've certainly earned it."},{"name":"TATARU","text":"You're too selfless, that's your problem. But you'll be no good to anyone if you don't take a break every once in a while. <span class=\"emphasis\">Anyway</span>..."},{"name":"TATARU","text":"Not much has happened since your last visit. I <span class=\"emphasis\">had</span> planned for you to meet that helper I told you about, but he refuses to answer his linkpearl. I do hope he's all right."},{"name":"TATARU","text":"We've been exchanging messages with the Eorzean Alliance throughout, though. They say the fighting has finally stopped at the Ghimlyt Dark, and that the Empire's shown no sign of movement."},{"name":"TATARU","text":"Which means we might actually have a moment to ourselves for a change. Seeing as you're back, maybe you could tell me more about your time in the First?"},{"name":"TATARU","text":"Great! Oh, and if you don't mind, I'd like to ask F'lhaminn to join us. She'll want to know what happened to Minfilia, and I think it's best she hears it from you."},{"name":"TATARU","text":"We'll meet you on the terrace at the House of Splendors."},{"name":"SYSTEM","text":"You have now begun “The Voyage Home.” To proceed to the end of this chapter, you must complete the Crystal Tower quests."},{"name":"SYSTEM","text":"Crystal Tower quests can be experienced alongside the main scenario."},{"name":"SYSTEM","text":"The starting quest, “Legacy of Allag,” may be undertaken by speaking with the outlandish man in Revenant's Toll."},{"name":"SYSTEM","text":"You may review your progress under “Chronicles of a New Era - The Crystal Tower” in your journal."},{"name":"TATARU","text":"We'll be waiting for you at the House of Splendors. And I expect you to tell us absolutely everything about your time in the First!"},{"name":"FLHAMINN","text":"<span class=\"highlight\">Forename</span>. My, it has been too long. Tataru <span class=\"emphasis\">did</span> mention that I would be joining you, did she not?"},{"name":"FLHAMINN","text":"Thank you... Words cannot well express how I have longed to know more of the First. This world Minfilia has sacrificed so much to save."},{"name":"FLHAMINN","text":"But come, rest your feet. Tataru should be arriving shortly."},{"name":"TATARU","text":"And so Minfilia chose to pass on her gifts to the next Oracle? This girl who Thancred named Ryne?"},{"name":"FLHAMINN","text":"To have such a burden thrust upon her as a child...only to embrace it when given the choice..."},{"name":"FLHAMINN","text":"In that respect, they are quite alike. It would seem her legacy is indeed in capable hands."},{"name":"FLHAMINN","text":"<span class=\"highlight\">Forename</span>─might I ask a favor of you when next you return to the First? To tell Ryne what I cannot."},{"name":"FLHAMINN","text":"To tell her...thank you."},{"name":"FLHAMINN","text":"And I would offer thanks to you as well. For staying with her to the end."},{"name":"RIOL","text":"(-???-)Beggin' yer pardon, but could I have a word?"},{"name":"TATARU","text":"Riol! I hope you're here to tell me you've received word from our helper."},{"name":"RIOL","text":"I wish. Nay, I've not had a peep out of him. An' it's been a good long while now. Too bloody long."},{"name":"RIOL","text":"On account o' which, I'm goin' to sneak over the border an' see if I can't get a signal to him from closer up."},{"name":"TATARU","text":"But what if they catch you!? There must be another way."},{"name":"RIOL","text":"Well, it ain't as if we can ask Thancred to do it. Besides, I shouldn't have no trouble pickin' me way through Ghimlyt now the fightin's died down. Gods know there's enough shadows to hide in."},{"name":"RIOL","text":"An' it beats waitin' 'round here twiddlin' me thumbs. Anyroad, I just thought I'd let ye know. Now, I'd best be─"},{"name":"RIOL","text":"Ack! I nearly forgot! Krile's at the Stones, an' she wants a word."},{"name":"RIOL","text":"Somethin' to do with the patients. She was gettin' ready to examine 'em again when I left."},{"name":"TATARU","text":"We'd best head back, then. I'm sure it's important."},{"name":"FLHAMINN","text":"You needn't worry about me. Go and see what Krile has to say."},{"name":"TATARU","text":"It seems she's still examining them. Oh, I do hope it's nothing bad..."},{"name":"TATARU","text":"Take care over in the First, <span class=\"highlight\">Forename</span>. We're counting on you and the Crystal Exarch to bring our friends home."},{"name":"KRILE","text":"Don't you worry. Master Matoya and I will think of something."},{"name":"EPHEMIE","text":"Tataru has apprised us of the Archons' condition. Rest assured, we will do our utmost to assist Mistress Krile in her ministrations."},{"name":"MYSTERYVOICE","text":"Ah, <span class=\"highlight\">Forename</span>, you are returned. I hope your time in the Source was suitably restful?"},{"name":"MYSTERYVOICE","text":"...But of course it wasn't. Go on..."},{"name":"MYSTERYVOICE","text":"Their corporeal aether shows signs of <span class=\"emphasis\">instability</span>? By the gods... The possibility never even occurred to me..."},{"name":"MYSTERYVOICE","text":"If you have returned in the hope that my research has yielded a solution, I fear you will be sorely disappointed."},{"name":"MYSTERYVOICE","text":"'Tis but a mercy we have the likes of Mistress Krile and Master Matoya to keep our friends' bodies safe while we wrestle with the problem."},{"name":"MYSTERYVOICE","text":"But they cannot forestall the separation of body and soul indefinitely. Come, the others must be told."}],"reward":{"gil":2014,"items":[{"id":35716},{"num":2,"id":27879,"one":1},{"num":2,"id":27880,"one":1},{"num":2,"id":27881,"one":1},{"num":2,"id":27882,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69190]},"next":[69210]},"partials":[{"type":"npc","id":"1031257","obj":{"i":1031257,"n":"Tataru","l":481,"q":2}},{"type":"npc","id":"1032121","obj":{"i":1032121,"n":"Crystal Exarch","l":3223,"q":4}},{"type":"item","id":"35716","obj":{"i":35716,"n":"Crystarium Weapon Coffer (IL 500)","l":1,"c":26557,"t":61}},{"type":"item","id":"27879","obj":{"i":27879,"n":"Ovim Cordon Bleu","l":430,"c":24363,"t":46}},{"type":"item","id":"27880","obj":{"i":27880,"n":"Lemonade","l":430,"c":24404,"t":46}},{"type":"item","id":"27881","obj":{"i":27881,"n":"Jellied Harcot","l":430,"c":24082,"t":46}},{"type":"item","id":"27882","obj":{"i":27882,"n":"Oysters on the Half Shell","l":430,"c":24316,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69190","obj":{"i":69190,"n":"Shadowbringers","g":8,"l":"The Tempest","s":1060}},{"type":"quest","id":"69210","obj":{"i":69210,"n":"A Grand Adventure","g":9,"l":"The Ocular","s":20}}]}