{"quest":{"name":"High-flying Hijinks","location":"Eastern La Noscea","id":69201,"patch":5.0,"sort":176,"repeatable":1,"icon":100936,"eventIcon":71222,"issuer":1031440,"target":1031442,"genre":201,"journal":["The course chaperone would invite you to prove your skills in a timeless test of acrobatic aptitude.<br>※This quest is available for a limited time only.","Perhaps against your better judgment, you have elected to take on the Eorzean Nimble Warrior obstacle course, which has been revamped this year to be more challenging than ever. As per Beaudefoin's instructions, propel yourself up to the starting line by hopping on the nearby water spout, then carefully make your way across a series of precarious platforms to reach the midway point. When you arrive, be sure to report to the chaperone stationed there before proceeding on to the finish.","Though there were times when you thought you might take an unfortunate tumble, you have impressively managed to reach the midway point of the Eorzean Nimble Warrior course. The chaperone in attendance offers you words of congratulations and caution before encouraging you to forge your way forward to the finish line, where her colleague P'obyano awaits.","You have successfully navigated your way to the finish line of the Eorzean Nimble Warrior course, doubtless to the joy of anyone who was fortunate enough to witness your remarkable run. You claim your hard-earned prize of four Faire vouchers, leaving open the option of returning to showcase your skills yet again while the festivities are still ongoing."],"objectives":["Report to the checkpoint chaperone.","Report to P'obyano."],"dialogue":[{"name":"STAFF03665","text":"Welcome, friend. I trust you're here to try your hand─or would that be your feet?─at the Eorzean Nimble Warrior course, yes? Wonderful! My colleague here will get you signed up straightaway!"},{"name":"BEAUDEFOIN","text":"Well, now <span class=\"emphasis\">there's</span> a face I'd recognize anywhere! Welcome back, friend, and many thanks for joining us at this year's festivities! I trust you're ready to amaze onlookers with your characteristic brand of athletic derring-do?"},{"name":"BEAUDEFOIN","text":"Welcome, my friend, and many thanks for joining us at this year's festivities! I trust you're ready to amaze onlookers with your characteristic brand of athletic derring-do?"},{"name":"BEAUDEFOIN","text":"Very well, then! Without further ado, allow me to explain the rules of the challenge in full. Pay close attention, now─you never know what small morsel of knowledge may prove the difference between a glorious victory and a humiliating defeat!"},{"name":"BEAUDEFOIN","text":"First, just hop atop that jet of water and let it propel you with a splash to the start of the course! From there, you'll have to navigate a sequence of precarious platforms and narrow ledges to make your way to the central checkpoint. Two hints for you: move cautiously, and try not to look down!"},{"name":"BEAUDEFOIN","text":"When you reach the checkpoint, the first thing you'll want to do is speak with the chaperone stationed there. It's her job to confirm that all competitors have completed the full course fair and square, you see. From there, it's a straight shot to the goal, where my colleague P'obyano awaits."},{"name":"BEAUDEFOIN","text":"The course may appear imposing, as well it should─Master Gegeruju's really pulled out all the stops this year. But fear not! You can take as much time as you'd like, and in the event that you should take an unfortunate and premature tumble, you can simply swim your way back to the starting point and try again!"},{"name":"BEAUDEFOIN","text":"Are you ready? Then have at it! My colleagues and I will be cheering you on from down below!"},{"name":"BEAUDEFOIN","text":"Welcome back, my athletically accomplished friend! Back to amaze onlookers with another remarkable run at the Eorzean Nimble Warrior course, are we? Splendid! You already know the rules, so feel free to hop right onto that water spout and show everyone what you've got!"},{"name":"BEAUDEFOIN","text":"Oh, and don't forget to report to the chaperone at the checkpoint, yes? We wouldn't want all to see all your efforts go for naught, now would we? But enough of my ramblings. Go forth, brave and honorable Nimble Warror!"},{"name":"BEAUDEFOIN","text":"Your first objective is to make it to the checkpoint midway through. Remember to speak with the chaperone there before forging on to the finish line, or your triumph won't count and your acrobatic exploits will all have been in vain!"},{"name":"BEAUDEFOIN","text":"Most impressive, my swift and sprightly friend! I was convinced you were going to make it clear to the finish line in one fell swoop! You may have fallen short, but sweet victory is right there for the taking! Now get back out there and show the adoring crowds what you've got!"},{"name":"STAFF03665","text":"The course will give you a challenge, but it's far from impossible─especially for an experienced adventurer like yourself, I'd wager! Keep your eyes on your landing point, don't rush your jumps, and most importantly...try not to look down!"},{"name":"FESSUMSTAFF03665","text":"Congratulations! You've made it to the halfway point! And as challenging as this course is, I daresay that's an accomplishment in itself."},{"name":"FESSUMSTAFF03665","text":"So pat yourself on the back and feel free to take a breather before you venture on. My colleague P'obyano is waiting at the finish line. Can you make your way there and claim your reward? I guess we'll see, won't we!"},{"name":"FESSUMSTAFF03665","text":"Feel proud, friend! Why, many of your ungainly peers never even make it this far. But don't get too comfortable yet! Half of the course still remains, and the road won't be an easy one."},{"name":"POBYANO","text":"You did it! And just as I thought you would! Right from the start, when I saw you leaping and bounding your way through the course like it was nothing, I had a feeling you were a Moonfire Faire veteran. And now I see that I was right!"},{"name":"POBYANO","text":"You did it! And just as I thought you would! Don't ask me why, but I had a good feeling about you right from the start! You'd better believe that at least one person who saw you conquer the course today will be strolling into their nearest Adventurers' Guild tomorrow to sign themselves up!"},{"name":"POBYANO","text":"I trust you have places to go and people to see, but should you ever wish to show off your skills again for all to see, the Eorzean Nimble Warrior course won't be going anywhere! ...At least, not until the end of the faire. You're welcome to rise to the challenge as many times as you like─simply talk to the chaperone at the starting line if you so desire!"},{"name":"POBYANO","text":"You did it! Once again, you've made our painstakingly constructed course appear about as challenging as a leisurely stroll on the beach! If you'd care to treat the faire-goers to another display of your astounding athletic ability, you're always welcome here!"}],"reward":{"items":[{"num":4,"id":27993}]},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[69199]}},"partials":[{"type":"npc","id":"1031440","obj":{"i":1031440,"n":"Course Registrar","l":32,"q":1}},{"type":"npc","id":"1031442","obj":{"i":1031442,"n":"P'obyano","l":32,"q":1}},{"type":"item","id":"27993","obj":{"i":27993,"n":"Faire Voucher XIX","l":1,"c":25918,"t":85}},{"type":"quest","id":"69199","obj":{"i":69199,"n":"Feels Like Moonfire","g":201,"l":"Limsa Lominsa","s":174}}]}