{"quest":{"name":"Hook, Line, and Sinker","location":"Eastern La Noscea","id":69203,"patch":5.0,"sort":178,"repeatable":1,"icon":100938,"eventIcon":71222,"issuer":1031535,"target":1031535,"genre":201,"journal":["J'nangho welcomes any adventurer looking to take part in a contest of angling aptitude.","J'nangho has tasked you with reeling in three fresh haddock for the Moonfire Faire festivities. Haul them in on the North Isle of Endless Summer, in hopes that you might claim a Faire voucher as your reward.<br><br>※Please note that you will not be able to complete this quest after the seasonal event has ended. For details, check the Lodestone.","Your finely honed fishing skills prove more than enough for the task, and you soon find yourself in possession of three most appetizing specimens of freshly caught haddock. Deliver them to J'nangho and claim your well-deserved reward.","J'nangho gleefully claims the haddock, informing you that it's sure to make a delightful feast for the faire-goers. She triumphantly presents you with a Faire voucher as your reward, and encourages you to come back at any time should you wish to put your skills to the test once more."],"objectives":["Catch haddock on the North Isle of Endless Summer.","Deliver the haddock to J'nangho."],"dialogue":[{"name":"JNANGHO","text":"Welcome, fellow adventurer! As you surely see, it's that season of the year again, and the Moonfire Faire is in full swing! I trust that you're enjoying the festivities?"},{"name":"JNANGHO","text":"If you're just dying for the opportunity to flaunt your fishing skills for all the realm to see, then you've come to the right place! Welcome to J'nangho's Angling Extravaganza!"},{"name":"JNANGHO","text":"The rules are simple. I name a fish, and tell you the quantity of said fish I require, and you go out and do the fishing. Then you bring your haul back to me for fame, fortune, and fabulous prizes! ...In the form of Faire vouchers, that is."},{"name":"JNANGHO","text":"Got it? Without further ado, your assignment is thus: catch for me three specimens of only the freshest haddock! Have you ever had haddock, friend? It really is quite the treat, especially battered to a golden brown. Mmm, haddock..."},{"name":"JNANGHO","text":"Well, if it isn't everyone's favorite angler extraordinaire! Well, at least you're <span class=\"emphasis\">my</span> favorite─especially now, seeing as how you've come back to fetch me another haul of three fresh haddock! That is why you've come back, isn't it?"},{"name":"JNANGHO","text":"And with that, I say go forth, my friend! Go forth with fishing rod in hand, and lay claim to the bounties of the sea! I shall be waiting for you with bells on─and with an ample amount of vouchers to reward you for your efforts."},{"name":"JNANGHO","text":"How fare you in your fishing exploits, friend? The waters around the island are simply swimming with haddock just waiting to be reeled in by an accomplished angler like yourself!"},{"name":"JNANGHO","text":"Do I smell what I think I smell? Why, my mouth is already watering at the prospect! If you have the haddock, pray hand it over with all speed!"},{"name":"JNANGHO","text":"Would you look at this! Why, this haddock is so fresh it feels like it could jump out of my hands and flop its way all the way back to the sea! Not that I'd let that happen, of course. Your catch is going straight to the hands of a skilled culinarian, who will make a tasty feast of battered fish for the faire-goers."},{"name":"JNANGHO","text":"At any rate, you've proven yourself worthy and then some, and this voucher is your reward─take it with my blessing. We'll be here until the faire finishes up, so if you're looking to show off your skills again, you're welcome at any time! Until then, fare thee well!"}],"reward":{"items":[{"id":27993}]},"reqs":{"jobs":[{"lvl":5,"id":19}],"quests":[69199]}},"partials":[{"type":"npc","id":"1031535","obj":{"i":1031535,"n":"J'nangho","l":32,"q":1}},{"type":"item","id":"27993","obj":{"i":27993,"n":"Faire Voucher XIX","l":1,"c":25918,"t":85}},{"type":"quest","id":"69199","obj":{"i":69199,"n":"Feels Like Moonfire","g":201,"l":"Limsa Lominsa","s":174}}]}