{"quest":{"name":"A Glamourous Guise","location":"Gridania","id":69205,"patch":5.0,"sort":181,"icon":100931,"eventIcon":71221,"issuer":1031538,"target":1031547,"genre":203,"journal":["The Impresario has an invitation for you.<br>※This quest is available for a limited time only.","You speak to the Impresario, who, as thanks for your help with the ahriman, extends you an invitation to the troupe's All Saints' Wake masquerade. Though his tone makes it difficult to tell whether his gratitude is sincere or if his offer to meet a magical “associate” is simply a means of luring you into some sinister snare, there is only one way to find out.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You speak with the genial guiser, who grants you access to the masquerade. He indicates that you will need to go to room 108 if you wish to meet the troupe's mysterious associate.","You confront the unsavory imp, who implies that he can change your form into that of another. If so, it certainly <span class=\"emphasis\">would</span> make for a convincing All Saints' Wake guise..."],"objectives":["Speak with the genial guiser.","Speak with the unsavory imp at the masquerade."],"dialogue":[{"name":"IMPHEAD","text":"Ah, my bone-chilling friend! You were so dreadfully helpful with our ahriman, I feel that I simply must repay you in kind."},{"name":"IMPHEAD","text":"Thus do I extend to you an invitation to our grand event─a sumptuous masquerade where you may revel to your heart's content! We have prepared a thrilling manor for our guests to explore, and all are encouraged to attend in the guise of their choice."},{"name":"IMPHEAD","text":"To you, however, I would offer something rather more...<span class=\"emphasis\">extraordinary.</span> Within the manor, you will find an associate of the troupe who is frightfully well versed in the art of glamours─you will undoubtedly note his <span class=\"emphasis\">terribly</span> convincing guise."},{"name":"IMPHEAD","text":"I shan't say a word more, lest I spoil the delights that await. If you would sate your curiosity, you must speak with him. Go on, now─don't delay! The genial guiser will show you to the masquerade."},{"name":"IMPHEAD","text":"Do speak to our associate at the masquerade─you'll feel like a whole new <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>! Or perhaps <span class=\"alternative-container\"><span class=\"alternative\">man</span><span class=\"alternative\">woman</span></span>!"},{"name":"CLOWNGATEKEEPER","text":"The Impresario's guest, correct? Come, I will escort you to the manor. Oh, and you will find our...associate...in room 108."},{"name":"EVENTAREA","text":"Enter the manor?"},{"name":"CLOWNGATEKEEPER","text":"Come one, come all, to our marvelous masquerade! Ah─the Impresario's guest. Right this way."},{"name":"EVENTAREA","text":"Enter the manor?"},{"name":"TRANSFORMHLW2019","text":"Greetings, guest of the Impresario. Yes, I know you..."},{"name":"TRANSFORMHLW2019","text":"Tell me, have you ever wished to become someone else? I can do that for you. Free of charge! Ehehehe..."}],"reward":{"gil":210},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69204]}},"partials":[{"type":"npc","id":"1031538","obj":{"i":1031538,"n":"Impresario","l":53,"q":1}},{"type":"npc","id":"1031547","obj":{"i":1031547,"n":"Unsavory Imp","l":2497,"q":1}},{"type":"quest","id":"69204","obj":{"i":69204,"n":"Fear and Delight","g":203,"l":"Gridania","s":181}}]}