{"quest":{"name":"Frying for Fame and Fortune","location":"Eastern La Noscea","id":69202,"patch":5.0,"sort":177,"repeatable":1,"icon":100937,"eventIcon":71222,"issuer":1031534,"target":1031534,"genre":201,"usedItems":[10332],"journal":["Hildelana is looking for a few good culinarians.","You have been invited to take part in the Iron Culinarian Challenge as part of the Moonfire Faire festivities. Procure yourself some freshly caught haddock, batter and fry it to a crisp golden brown, and deliver your culinary masterpiece back to Hildelana, who will see that it finds a proper home in the belly of a peckish faire-goer.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You put your culinary skills to good use in preparing a prime piece of battered fish boasting flavor and texture fit for a king, and deliver it to Hildelana, who is duly impressed. She rewards your surpassing skill with a skillet with a single Faire voucher, and invites you to return to participate in the challenge again should you so desire."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Obtain a serving of battered fish</span><span class=\"alternative\">Deliver the serving of battered fish to Hildelana</span></span>."],"dialogue":[{"name":"HILDELANA","text":"Greetings, my gourmet-inclined friend! Since you've stepped up to speak to me, I presume that you're looking to take part in the one and only Iron Culinarian Challenge? Oh, happy day!"},{"name":"HILDELANA","text":"Don't fret if this is your first time, for the rules of the challenge are simple enough. First, I will prescribe for you a particular dish. Next, you'll procure the necessary ingredients and get cooking. Finally, you'll bring your creation back to me for inspection. If your culinary creation is up to snuff, you'll win yourself a Faire voucher for your efforts!"},{"name":"HILDELANA","text":"And now, without further ado, the dish you'll be preparing for us is...battered fish! Never saw that one coming, did you?"},{"name":"HILDELANA","text":"It's a simple yet tasty treat that really is all the rage among faire-goers at this time of year. Crispy on the outside, lightly flaky on the inside...if you've never had it yourself, you really owe it to yourself to give it a try!"},{"name":"HILDELANA","text":"Back again to take part in the Iron Culinarian Challenge, are we? Well, then you've come to the right place! I'll spare you the details, as I know you're an old hand at this by now."},{"name":"HILDELANA","text":"If you're in need of fresh haddock, the friendly fisherman just over yonder would be happy to part with one of his catches...for the right price, of course. Now go forth, friend, and fashion a culinary creation that will win the hearts of all who partake in it!"},{"name":"HILDELANA","text":"I just can't wait to feast my eyes on the battered fish you whip up for us, friend!"},{"name":"HILDELANA","text":"Take a whiff of that simply scrumptious aroma! I can only assume that you have what I think you have?"},{"name":"HILDELANA","text":"Why, just look at it! Freshly caught haddock, battered and fried to a deep golden brown! Why, if I hadn't already wolfed down ten pieces just today, I doubt I could keep myself from devouring it on the spot!"},{"name":"HILDELANA","text":"But I jest. You may rest assured that your most mouthwatering creation will find a good home in the tummy of one of your fellow festival-goers. Take this Faire voucher as your reward, and take pride in a job well done. Farewell, and should you ever be so inclined as to show off your skills with a skillet once more, you know where to find me!"}],"reward":{"items":[{"id":27993}]},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[69199]}},"partials":[{"type":"npc","id":"1031534","obj":{"i":1031534,"n":"Hildelana","l":32,"q":1}},{"type":"item","id":"27993","obj":{"i":27993,"n":"Faire Voucher XIX","l":1,"c":25918,"t":85}},{"type":"item","id":"10332","obj":{"i":10332,"n":"Battered Fish","l":5,"c":24319,"t":46}},{"type":"quest","id":"69199","obj":{"i":69199,"n":"Feels Like Moonfire","g":201,"l":"Limsa Lominsa","s":174}}]}