{"quest":{"name":"Good for the Soul","location":"Amh Araeng","id":69212,"patch":5.1,"sort":40,"eventIcon":71201,"issuer":1031732,"target":1031734,"genre":9,"journal":["Beq Lugg is ready to speak of the metaphysical."],"objectives":["Speak with Beq Lugg.","Speak with Magnus.","Search Mount Biran Mines for lumps of pristine clay.","Deliver the lumps of pristine clay to Beq Lugg.","Speak with Alisaie."],"dialogue":[{"name":"ALPHINAUD","text":"Corporeal and incorporeal aether... I confess I have never had cause to make the distinction."},{"name":"ALISAIE","text":"Did they just say what I think they said? Might there really be a way to help Halric and the others? And help ourselves in the process?"},{"name":"HALRIC","text":"...&lt;mumble&gt;"},{"name":"BEQLUGG","text":"I suspect the Crystal Exarch has told you of my past. That I was once a mage of the royal court of Voeburt, and that soulcraft was my field of study."},{"name":"BEQLUGG","text":"The tonic you administered to the patients here is one of the fruits of my labors. I hoped to do great things for the kingdom..."},{"name":"BEQLUGG","text":"&lt;sigh&gt; But in the end, my knowledge brought only suffering. A plague the like of which none had ever seen."},{"name":"BEQLUGG","text":"In the hands of unscrupulous men, what should have been my greatest triumph instead became my greatest shame..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You mustn't dwell in the past."},{"name":"A2","text":"And now you have a chance to redeem yourself."},{"name":"A3","text":"At least the Warriors of Light brought those responsible to justice."},{"name":"BEQLUGG","text":"I know that only too well. Alas, the knowledge we require is steeped in such bitter memories."},{"name":"BEQLUGG","text":"That I do. A comforting thought indeed."},{"name":"BEQLUGG","text":"Aye, that they did. I shudder to think what might have happened had they not."},{"name":"BEQLUGG","text":"But let us return to the task at hand─finding a means by which we might revitalize these people's incorporeal aether."},{"name":"ALPHINAUD","text":"Do you think it can be done?"},{"name":"BEQLUGG","text":"Were the skies still ablaze with primordial Light, I would call it an exercise in futility. But now─now we may have a chance."},{"name":"BEQLUGG","text":"The method I have in mind will entail the conjuring of a familiar. They are able to amplify the energies poured into them, making them the perfect conduit for the aether-revitalizing magicks we will ultimately employ."},{"name":"ALISAIE","text":"If you're about to launch into a lengthy explanation of the metaphysics of your plan─don't bother. I'd rather get on with doing whatever it is that needs to be done, if it's all the same to you."},{"name":"ALISAIE","text":"Whatever reagents must be procured, or spells invoked─I'll do it."},{"name":"BEQLUGG","text":"...I admire your spirit."},{"name":"BEQLUGG","text":"Very well. Your first task will be to gather the necessary materials."},{"name":"BEQLUGG","text":"The purest of waters and finest of clays, as well as a fae lantern brimming with pixie magick."},{"name":"ALISAIE","text":"If you're <span class=\"emphasis\">convinced</span> the resulting familiar could help the patients─fine."},{"name":"ALISAIE","text":"Alphinaud─the water and clay will be simple enough, but I think you know what we'll have to do to get the lantern."},{"name":"ALPHINAUD","text":"You don't mean─"},{"name":"ALISAIE","text":"The pixies took quite a liking to us before. If we humor them with our company, I'm sure they'll be willing to help us."},{"name":"ALPHINAUD","text":"..."},{"name":"ALPHINAUD","text":"...<span class=\"emphasis\">Fine</span>. We'll pay a visit to Il Mheg. Though I never thought <span class=\"emphasis\">you</span> would be the one to suggest going back there."},{"name":"BEQLUGG","text":"I'm impressed you've been there at all, let alone befriended the fae folk."},{"name":"BEQLUGG","text":"Oh, while you're about it, seek out the Nu Mou of Pla Enni. They will be able to supply you with water suitable for our needs."},{"name":"ALISAIE","text":"Right. Let's get this over with, shall we."},{"name":"BEQLUGG","text":"There still remains the matter of the clay. Might I prevail upon you to find it?"},{"name":"BEQLUGG","text":"Clay from Amh Araeng would likely be best. Know you of anyone who might be able to assist us?"},{"name":"Q2","text":"What will you say?"},{"name":"A1","text":"I could ask the miners at Twine."},{"name":"A2","text":"Well, there are the scavengers at Mord Souq."},{"name":"BEQLUGG","text":"Ah, yes! They will be able to point you in the right direction, I am sure."},{"name":"BEQLUGG","text":"Scavengers, you say? Well...they may know the lie of the land, but I daresay they are more interested in the trinkets and baubles hiding in the earth than the earth itself. Now, miners on the other hand..."},{"name":"BEQLUGG","text":"What's that? You know the miners of Twine? Perfect! Speak with them and you should have no trouble procuring what we need."},{"name":"BEQLUGG","text":"While you and the twins are occupied, I will see if there is aught else I can learn of the stagnation which afflicts the people here."},{"name":"BEQLUGG","text":"I have no doubt that the miners of Twine can help you find what we need. While you are away, I will do what I can to learn more about the nature of the patients' affliction."},{"name":"JERYK","text":"I can't stop thinking about that giant Talos we built. Can you imagine what it could do with a matching trolley? It feels like a waste <span class=\"emphasis\">not</span> to build one."},{"name":"THAFFE","text":"&lt;sigh&gt; Sometimes I wish we'd never got that trolley running again. Now Jeryk wants <span class=\"emphasis\">more</span> of the bloody things, and refuses to shut up about it."},{"name":"MAGNUS","text":"<span class=\"highlight\">Forename</span>! Well, what a coincidence!"},{"name":"THAFFE","text":"You've come at a good time. We've just this moment finished repairing the Talos and trolley you lot took to Nabaath Areng."},{"name":"MAGNUS","text":"The trolley was no trouble, but the Talos would have been another matter, had we not had a visit from Master Chai."},{"name":"MAGNUS","text":"He offered us a share of the leftover building materials from Daedalus Stoneworks, as well as a few trade secrets to help us along."},{"name":"JERYK","text":"Clever man, that Chai-Nuzz. He seemed pretty keen on the ideas I had for putting the giant Talos to work."},{"name":"JERYK","text":"Like a giant trolley! But Magnus still refuses to see all the good we could do with it..."},{"name":"THAFFE","text":"You're entitled to your dreams, Jeryk, but that doesn't mean you can go harassing our guests with them. Master Chai was just being polite."},{"name":"MAGNUS","text":"And something tells me <span class=\"highlight\">Forename</span> here didn't come all this way to talk about trolleys. What is it you need, friend?"},{"name":"MAGNUS","text":"I see. And this...familiar requires clay from Amh Araeng."},{"name":"JERYK","text":"Well, look no further. If anyone can find you some quality clay, it's us."},{"name":"THAFFE","text":"Saying that, it isn't exactly a commodity nowadays... But there must be some lurking somewhere or other, waiting to be dug up."},{"name":"MAGNUS","text":"If I'm not mistaken, there was a time when they used to take clay from Mount Biran Mines to make adobe bricks."},{"name":"MAGNUS","text":"Place is swarming with coyotes now, but if you're after the good stuff, you could do worse than to look there."},{"name":"JERYK","text":"I still say a trolley for that Talos is a good idea. You agree, don't you?"},{"name":"THAFFE","text":"You'll want to be on your guard at the mines. Spend too long peering at the ground, and a coyote is sure to come and bite you on the arse."},{"name":"MAGNUS","text":"Stay safe out there. And remember: you don't need an excuse to come and visit us."},{"name":"ALPHINAUD","text":"The pixies were constantly confusing me with Alisaie. In jest, I assume. I mean, it's not as if we look <span class=\"emphasis\">that</span> much alike!<br>We, uh...don't look that much alike, do we?"},{"name":"ALISAIE","text":"That had better be the only thing we need from the pixies. If I have to endure one more prank, so help me gods..."},{"name":"BEQLUGG","text":"The twins have returned, and in one piece at that. I was convinced the pixies would turn at least one of them into a garden ornament...but no."},{"name":"BEQLUGG","text":"...You have the clay, I take it?"},{"name":"BEQLUGG","text":"Wonderful. We need but combine the clay and the water, then heat the mixture with the fae lantern. After that, it will be a simple matter of settling upon a suitable form, and performing the necessary incantation."},{"name":"ALISAIE","text":"Beq Lugg. I have a question. In the event that we had need of this spell and you weren't around, would it be possible for another to perform the incantation?"},{"name":"BEQLUGG","text":"Assuming they possessed the requisite skill, yes."},{"name":"ALISAIE","text":"Halric and the others have suffered so much, and I swore to do everything in my power to save them. If there is a chance this spell could do that, I would be the one to invoke it."},{"name":"BEQLUGG","text":"...Hmmm. Mayhap you <span class=\"emphasis\">should</span> be the one to do so."},{"name":"BEQLUGG","text":"A deep understanding of the subjects' physical state, combined with a strong desire to help them, can drastically increase the magick's effect. And you are plainly more familiar with these people than I."},{"name":"ALPHINAUD","text":"I daresay there are few in all of Norvrandt more dedicated to finding a cure. Is that not so, <span class=\"highlight\">Forename</span>?"},{"name":"Q3","text":"What will you say?"},{"name":"A1","text":"Absolutely. She's the best woman for the job."},{"name":"A2","text":"Very few. But if aught should go awry...I'll see what I can do."},{"name":"ALISAIE","text":"I'll give it my all. For Halric. For Tesleen..."},{"name":"ALISAIE","text":"Is that a challenge? Well, I'll be damned if I let it come to that."},{"name":"BEQLUGG","text":"Then we are all of a mind on the matter. Alisaie shall be the one to conjure the familiar."},{"name":"ALPHINAUD","text":"By the Twelve! Though it was only for a moment, he spoke! There may yet be hope for these people!"},{"name":"BEQLUGG","text":"The girl's resolve is quite impressive. One might almost think she drew strength from another..."},{"name":"HALRIC","text":"M... Mothe... Al..."},{"name":"ALISAIE","text":"How is he, Beq Lugg? Did it work?"},{"name":"BEQLUGG","text":"I believe it did. You and your fledgling familiar have done well."},{"name":"BEQLUGG","text":"If my eyes do not deceive, a hint of color has returned to his soul."},{"name":"ALISAIE","text":"Gods... I would jump for joy if I weren't so exhausted."},{"name":"ALISAIE","text":"We're so close now, Halric..."},{"name":"BEQLUGG","text":"As you are even now in the process of discovering, this magick asks much of the invoker. What you may <span class=\"emphasis\">not</span> have realized is that the same is also true of the subject. As such, we must proceed with caution. However, with further treatment, I have the utmost confidence the boy will make a full recovery."},{"name":"BEQLUGG","text":"Observing the reanimation of his stagnant soul has been most enlightening. I will need time to put my theories to the proof, but I believe I can fashion a spell to produce the opposite effect. That is, to <span class=\"emphasis\">induce</span> stagnation."},{"name":"ALPHINAUD","text":"Thus enabling our safe transport back to the Source via auracite!"},{"name":"ALISAIE","text":"A thought occurred to me─about this treatment."},{"name":"ALISAIE","text":"Beq Lugg said when the soul is rendered dormant, the mind is separated from the body. That a person becomes incapable of interacting with the world around them."},{"name":"ALISAIE","text":"Does that not sound a lot like some of the tempered back in the Source?"},{"name":"ALPHINAUD","text":"Not really. It is the fate of most tempered to become slaves to primals─save in a handful of cases. Or am I missing something?"},{"name":"ALISAIE","text":"If I can master this technique─the art of revitalizing the soul─I know of at least one in the Source who could desperately use such treatment."},{"name":"Q4","text":"What will you say?"},{"name":"A1","text":"I'm not sure I follow..."},{"name":"A2","text":"<span class=\"emphasis\">Ga Bu</span>."},{"name":"A3","text":"Do you really think it could work?"},{"name":"ALISAIE","text":"<span class=\"emphasis\">Ga Bu</span>. His condition is eerily similar to Halric and the others', the only difference being that his soul was suffused with earth-aspected aether from summoning Titan, rather than Light. It follows that if his soul is subject to a similar kind of stagnation, there may be a chance we can save him...right?"},{"name":"ALISAIE","text":"Exactly! His condition is uncannily similar to Halric's, is it not? The only difference being that his soul was suffused with earth-aspected aether instead of Light. It follows that if his soul is subject to a similar kind of stagnation, there may be a chance we can save him...right?"},{"name":"ALISAIE","text":"Why shouldn't it? Ga Bu's condition is virtually identical to Halric's, is it not? The only difference being that his soul was suffused with earth-aspected aether instead of Light. It follows that if his soul is subject to a similar kind of stagnation, there may be a chance we can save him."},{"name":"BEQLUGG","text":"Forgive me, but who is this Ga Bu fellow of whom you speak?"},{"name":"BEQLUGG","text":"...I see. His condition does sound similar...yet there is much and more about the soul that remains unknown even to me. I say this not to discourage you, you understand, but to remind you that this is delicate work we do here. Work requiring <span class=\"emphasis\">patience</span>."},{"name":"ALISAIE","text":"Of course. And as long as there is hope for the patients here, I will devote whatever time is needed to see this through."},{"name":"ALISAIE","text":"But I refuse to spend that time in idleness. If it's all the same to you, I'd like to stay here with Angelo and continue with their treatment."},{"name":"ALISAIE","text":"The two of you should return to the Crystarium with Beq Lugg and see if you can't make some headway with their newly posited theories."},{"name":"BEQLUGG","text":"I would tell you to rest first, but I see you're not to be convinced. Ah, the fire of youth."},{"name":"ALPHINAUD","text":"Let us return to the Crystarium, then."},{"name":"KAISHIRR","text":"(-???-)Finally! I've found you!"},{"name":"ALPHINAUD","text":"Kai-Shirr!? What are you doing all the way out here?"},{"name":"KAISHIRR","text":"There's trouble back in Eulmore. Lady Chai's beside herself. Sighing, pacing, the whole lot. Near enough <span class=\"emphasis\">begged</span> me to go and find you."},{"name":"ALPHINAUD","text":"...Sighing <span class=\"emphasis\">and</span> pacing, you say? It must be urgent."},{"name":"BEQLUGG","text":"I take it I will be returning to the Crystarium alone. Go on, then. It's not as if I have anything for you to do."},{"name":"ALPHINAUD","text":"Thank you, Beq Lugg."},{"name":"KAISHIRR","text":"Sorry for bothering you and all that, but she says the future of Eulmore's at stake."}],"reward":{"gil":1407},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69211]},"next":[69213]},"partials":[{"type":"npc","id":"1031732","obj":{"i":1031732,"n":"Beq Lugg","l":2955,"q":2}},{"type":"npc","id":"1031734","obj":{"i":1031734,"n":"Alisaie","l":2955,"q":1}},{"type":"quest","id":"69211","obj":{"i":69211,"n":"A Welcome Guest","g":9,"l":"Lakeland","s":30}},{"type":"quest","id":"69213","obj":{"i":69213,"n":"Nowhere to Turn","g":9,"l":"Amh Araeng","s":50}}]}