{"quest":{"name":"Vows of Virtue, Deeds of Cruelty","location":"Eulmore","id":69218,"patch":5.1,"sort":100,"icon":100941,"eventIcon":71201,"issuer":1031777,"target":1032081,"genre":9,"journal":["Alphinaud wears a satisfied smile, seemingly content with the state of Eulmore.","Eulmore is in Master Chai's capable hands, the future looks bright, and even the long-suffering Kai-Shirr seems to have found both a place and purpose. Yet there are still problems that remain to be solved, not least those of your fellow Scions. Alphinaud suggests returning to the Crystarium, hopeful that Beq Lugg has made headway in their research.","You arrive to discover that work on the white auracite has not gone as intended. In fact, your comrades have decided to pursue an alternative solution, having realized that their original plans would inevitably have broken the link between mind and soul. While they labor on, Y'shtola suggests you return to the Source and apprise Krile and the others of all that has transpired.","Back at the Rising Stones, Tataru greets your return with customary enthusiasm. Though she is eager to hear of your exploits in the First, she insists you wait for Krile, who is in the process of completing routine ministrations on your stricken comrades. No sooner have you told your tale than you are joined─to your considerable surprise─by the elusive Estinien, who brings troubling tidings from the Empire.","Estinien's account of his journey into imperial territory is interrupted when both you and Krile are overcome by the power of the Echo. In a series of visions from the dragoon's recent past, you bear witness to the murder of Emperor Varis; a grueling battle with Zenos himself; and an encounter with a mechanical monstrosity bearing a striking resemblance to the Ultima Weapon. When you eventually return to your senses, Estinien presses on with his report, concluding at length that the Empire poses no threat for the present, though it remains to be seen where Zenos will next resurface. His contract with Tataru thus fulfilled, your old friend gruffly takes his leave to the disappointment of all present.","Everyone else has resumed their work, leaving you the rare opportunity to enjoy a moment's respite. But can there ever truly be rest for the righteous? The presence of Zenos alone is proof that powerful forces are yet at play, waiting unseen to pounce on any weakness. Until they see fit to reveal themselves, however, you can do naught but steel yourself for what is to come."],"objectives":["Speak with the Crystal Exarch in the Ocular.","Speak with Tataru.","Speak with Tataru at the Rising Stones.","Speak with Tataru."],"dialogue":[{"name":"ALPHINAUD","text":"Truly, to see Kai-Shirr thus inspired by our actions is inspiring in itself."},{"name":"ALPHINAUD","text":"Yet however much I may wish to stay and see what comes of his efforts here in Eulmore, we have matters of our own to attend to. Come, we should return to the Crystal Tower. Mayhap Beq Lugg's studies have borne fruit in our absence."},{"name":"ALPHINAUD","text":"'Twould seem Alisaie has yet to return from the Inn at Journey's Head. I do hope she doesn't overtire herself..."},{"name":"YSHTOLA","text":"In the course of preparing more auracite, we made a significant discovery. We thought it best to wait for your return before sharing our findings."},{"name":"URIANGER","text":"My congratulations, <span class=\"highlight\">Forename</span>. Glad tidings from Eulmore did precede thy coming. I will see that Thancred and Ryne hear of these momentous events, that they too might take joy in that which thou hast helped to bring about."},{"name":"BEQLUGG","text":"I take it you are ready to resume our work?"},{"name":"MYSTERYVOICE","text":"Welcome back. We are given to understand a new mayor has taken office in Eulmore."},{"name":"ALPHINAUD","text":"Indeed. Our good friend Master Chai was elected by popular vote, and─after some considerable soul–searching─chose to accept the post."},{"name":"ALPHINAUD","text":"It is a shame you weren't able to attend his inaugural speech. Though I have no doubt you will see more of him in the future."},{"name":"ALPHINAUD","text":"But tell me, how fared you in preparing the white auracite?"},{"name":"YSHTOLA","text":"Our work...did not proceed quite as expected."},{"name":"YSHTOLA","text":"In your absence, we had a frank discussion on the principles of soul transference, and concluded at length that white auracite was ill-suited for our purposes. "},{"name":"ALPHINAUD","text":"But Urianger─did you not say that, compared to the massy soul of an Ascian, the stone could house one of ours with ease?"},{"name":"URIANGER","text":"That I did. And armed as we are with Beq Lugg's invaluable insight, 'twould indeed prove a trifling matter─were we to disregard the inviolable link 'twixt mind and soul..."},{"name":"URIANGER","text":"...A link which would─we did belatedly realize─be weakened most perilously in the process of rendering our souls dormant, as auracite doth require. Thus, the shedding of these fleshly simulacra, and the surfeit of aether which compriseth them, would in all likelihood deprive us of our psyches as well."},{"name":"BEQLUGG","text":"It would, theoretically, be possible to channel your <span class=\"emphasis\">minds</span> into the auracite instead, but we would more than likely sacrifice your souls in the process."},{"name":"BEQLUGG","text":"Which is why we have abandoned that plan, and instead devoted our time to finding a means by which mind and soul might be transported together."},{"name":"ALPHINAUD","text":"Then we are no closer to a solution than when we first began..."},{"name":"BEQLUGG","text":"It is a vexing conundrum indeed. But one for which the Crystal Exarch has posited a most intriguing solution."},{"name":"MYSTERYVOICE","text":"When our discussions turned to the transference of memories and the psyche, I could not help but be reminded of a technique with which I have personal experience."},{"name":"MYSTERYVOICE","text":"<span class=\"highlight\">Forename</span>, do you recall what we learned of my eyes from our encounter with Doga and Unei?"},{"name":"MYSTERYVOICE","text":"I speak of the Royal Eye of the Allagan imperial line, gifted to my forebears through the blood and memories of the ancient Allagans. It is by this gift that I am able to control the Crystal Tower."},{"name":"MYSTERYVOICE","text":"To explain─in the latter days of the Allagan Empire, the last of their kind devised a means to pass on their blood and memories to my forebears. It is through these gifts that I am able to control the Crystal Tower."},{"name":"BEQLUGG","text":"If we were to gain an understanding of the technology by which the Allagans were able to accomplish this transference, perhaps then we could keep mind and soul together."},{"name":"URIANGER","text":"Imagine, if you will, a device like unto a soul crystal, replete not only with our worldly memories, but also the bountiful energies of the soul."},{"name":"MYSTERYVOICE","text":"That is our current avenue of investigation. And we will follow it wheresoever it leads."},{"name":"YSHTOLA","text":"While we are thus engaged, I think it best that <span class=\"highlight\">Forename</span> return to the Source and inform Krile and the others of our findings."},{"name":"ALPHINAUD","text":"Agreed. I imagine Tataru will be relieved to hear we've made progress of a sort."},{"name":"URIANGER","text":"Then I would beg leave to relay our findings unto Thancred and Ryne, and to assist where I may in their investigation of the Empty."},{"name":"MYSTERYVOICE","text":"Yes, please do. Should we have need of your counsel we will not hesitate to summon you."},{"name":"ALPHINAUD","text":"Give our regards to Tataru, won't you?"},{"name":"ALPHINAUD","text":"With the benefit of our combined knowledge, and the aid of the First's leading authority on soulcraft, we must surely be able to find a solution. Surely..."},{"name":"YSHTOLA","text":"Beq Lugg insists we resume our work forthwith, but I grow weary at the thought... &lt;sigh&gt; What I would not give for a cup of tea, and perhaps a vanilla tart."},{"name":"BEQLUGG","text":"I pray the link to their bodies in your world will endure awhile longer. Should it fail, our efforts will be for naught."},{"name":"MYSTERYVOICE","text":"Mark my words, <span class=\"highlight\">Forename</span>─we will unlock the secrets of the Allagan Eye, and see the others returned home."},{"name":"MYSTERYVOICE","text":"There was a time when I thought these eyes a curse, you know... But for what they have enabled me to do, and what they may yet make possible, I see now they are a blessing."},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>! You're back!"},{"name":"TATARU","text":"How did everything go in the First? Wait─don't tell me. Krile will be here shortly, and she'll want to hear too. She's just tending to the others. Their bodies, I mean. Gods, I don't think I'll ever get used to saying that... Anyway, you can tell us everything the moment she gets here!"},{"name":"SYSTEM","text":"Upon speaking with Tataru, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 80 or above to proceed."},{"name":"Q1","text":"Wait for Krile's return?"},{"name":"ESTINIEN","text":"I've seen him in action. His body at least. You will not best him alone."},{"name":"SHADOWHUNTER","text":"Nay...death will not come easily to that <span class=\"emphasis\">thing</span>. If you would join me, then by all means..."},{"name":"ESTINIEN","text":"For what good it will do..."},{"name":"ZENOS","text":"The Black Wolf...and the Azure Dragoon. I suppose this might suffice."},{"name":"ZENOS","text":"Come, then."},{"name":"ZENOS","text":"Ah, the simple pleasure of one's own flesh. Truly, there is no place like home."},{"name":"SHADOWHUNTER","text":"Abomination..."},{"name":"ESTINIEN","text":"Whatever he is, <span class=\"emphasis\"><span class=\"highlight\">Forename</span></span> was barely a match for him. If we stay here much longer─"},{"name":"ANNIAQUOSORANUS","text":"(-???-)Emperor Varis! Your Radiance, are you all right!?"},{"name":"ESTINIEN","text":"...We may wear out our welcome."},{"name":"JULIAQUOSORANUS","text":"Your Radiance... No!"},{"name":"ZENOS","text":"&lt;sigh&gt; Must even the most middling of sport be spoiled? The world conspires to bore me."},{"name":"ZENOS","text":"But I have no cause to remain. I leave these vermin to you."},{"name":"SHADOWHUNTER","text":"Zenos!!!"},{"name":"ESTINIEN","text":"Well? Any bright ideas?"},{"name":"ANNIAQUOSORANUS","text":"What are you waiting for? Open fire!"},{"name":"SHADOWHUNTER","text":"Just one."},{"name":"JULIAQUOSORANUS","text":"Gaaaaaah!"},{"name":"ANNIAQUOSORANUS","text":"Your Radiance..."},{"name":"JULIAQUOSORANUS","text":"The intruders have taken flight. I repeat, the intruders have taken flight.<br>Deploy all available magitek armor. We cannot let them escape!"},{"name":"ESTINIEN","text":"Well, well... Someone's been busy."},{"name":"ESTINIEN","text":"And you would bar my way, would you? ...So be it."},{"name":"ESTINIEN","text":"Come, Nidhogg! Lend me your strength!"},{"name":"ESTINIEN","text":"Garleans and their machina...<br>Now...where are you, Gaius?"},{"name":"KRILE","text":"Though they have yet to find a workable solution, Y'shtola and the others <span class=\"emphasis\">are</span> making progress, and we cannot ask for more than that."},{"name":"TATARU","text":"You must be shattered after all that hopping back and forth between worlds. Why not stay here and rest for a while? I'm sure Beq Lugg can manage without you. They've got enough Scions to help them, if you ask me!"},{"name":"SYSTEM","text":"Meanwhile, in Garlemald..."},{"name":"THIRDLEGIONCENTURION","text":"Traitors! You would dare deny Lord Nerva the throne!?"},{"name":"THIRDLEGIONCENTURION","text":"Aaah!"},{"name":"FIRSTLEGIONCENTURION","text":"Onward! Before this day is done, victory shall be ours!"},{"name":"ZENOS","text":"Boring, boring, boring..."},{"name":"MYSTERIOUSCOOPERATOR","text":"(-???-)Do you think? I find it amusing. Like dogs herding cattle to the slaughterhouse."},{"name":"ZENOS","text":"That hue. Your soul is... Who are you?"},{"name":"MYSTERIOUSCOOPERATOR","text":"Before your majesty, I am but another dog. Lost, in want of a new master. A hunting dog if you should wish it so."},{"name":"MYSTERIOUSCOOPERATOR","text":"For I know full well the prey you would seek next."},{"name":"MYSTERIOUSCOOPERATOR","text":"...Zodiark."},{"name":"SYSTEM","text":"Meanwhile, in Eulmore in the First..."},{"name":"DIRTYMAN","text":"Did you hear? The mayor's reopening Daedalus Stoneworks, and they're looking for laborers!"},{"name":"SHABBYWOMAN","text":"There's talk of resettling some of the old, abandoned villages too. They're even laying on free Talos to help anyone willing to make the move."},{"name":"DIRTYMAN","text":"<span class=\"emphasis\">Free Talos</span>? Hah! We'd best get packing."},{"name":"SHABBYWOMAN","text":"Steady work, board and lodging... If that's not a recipe for hope, I don't know what is."},{"name":"PALEFACEMAN","text":"(-???-)Hope...?"},{"name":"PALEFACEMAN","text":"(-Wayward Warrior-)Yes. So long as I yet live, I would see that feeble flame rekindled."},{"name":"PALEFACEMAN","text":"(-Wayward Warrior-)It is my destiny. To see our dream fulfilled."}],"reward":{"gil":4200},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69217]},"next":[69286,69297]},"partials":[{"type":"npc","id":"1031777","obj":{"i":1031777,"n":"Alphinaud","l":2952,"q":1}},{"type":"npc","id":"1032081","obj":{"i":1032081,"n":"Tataru","l":481,"q":2}},{"type":"quest","id":"69217","obj":{"i":69217,"n":"Moving Forward","g":9,"l":"Kholusia","s":90}},{"type":"quest","id":"69286","obj":{"i":69286,"n":"One Final Journey","g":66,"l":"Mor Dhona","s":10}},{"type":"quest","id":"69297","obj":{"i":69297,"n":"Old Enemies, New Threats","g":9,"l":"The Rising Stones","s":110}}]}