{"quest":{"name":"A Welcome Guest","location":"Lakeland","id":69211,"patch":5.1,"sort":30,"eventIcon":71201,"issuer":1032451,"target":1031732,"genre":9,"journal":["Alphinaud looks just about ready to leave you behind."],"objectives":["Return to the Ocular at the Crystarium.","Speak with Beq Lugg.","Speak with Beq Lugg at the Inn at Journey's Head.","Treat the patients with soul tonic.","Speak with Beq Lugg."],"dialogue":[{"name":"ALPHINAUD","text":"We mustn't dally here any longer, <span class=\"highlight\">Forename</span>. If Beq Lugg is to hear the truth of our travails in the First, you of all people should be present."},{"name":"ALPHINAUD","text":"Beq Lugg has a fine eye. Though we have yet to begin, I rather think the Exarch was right to call on them."},{"name":"ALISAIE","text":"I sometimes forget we're not truly here in the First. It will be good to be whole again..."},{"name":"YSHTOLA","text":"Did you happen to notice the magicked brooms strewn about the Grand Cosmos? Uncanny."},{"name":"MYSTERYVOICE","text":"Fortunately for us, Beq Lugg is of a mind to see you and your fellow Scions justly compensated for your efforts."},{"name":"BEQLUGG","text":"You have spun quite a tale. But tell me─have you given any thought as to how you might return to your world?"},{"name":"BEQLUGG","text":"...White auracite, you say? An intriguing proposition."},{"name":"BEQLUGG","text":"But one which fails to account for the present state of your souls."},{"name":"BEQLUGG","text":"They have become highly charged, likely as a consequence of having maintained tangible forms for so long. In such an energetic, unstable state, there is no telling what may happen to their souls within the auracite. They could very well become immutable to transference, never to be restored to their bodies."},{"name":"YSHTOLA","text":"Then...would it be possible to force our souls into a state of dormancy, prior to transference?"},{"name":"BEQLUGG","text":"In theory, yes. But the soul is not a candle to be snuffed out and relit on a whim."},{"name":"ALISAIE","text":"Well, that sounds ominous. What exactly would rendering our souls dormant entail?"},{"name":"BEQLUGG","text":"In order to maintain a corporeal form, your souls constantly draw aether from your surroundings. This process must be halted, and the resulting surfeit of aether removed."},{"name":"BEQLUGG","text":"Your minds would ultimately be separated from these faux bodies of yours, rendering you incapable of interacting with the world around you. A cruel fate under normal circumstances, but one which will be rectified upon your return home."},{"name":"ALISAIE","text":"Leaving lifeless husks... Like those poor souls at the Inn at Journey's Head─corrupted by the sin eaters, their aether made stagnant by the Light."},{"name":"BEQLUGG","text":"Corrupted? Stagnant...?"},{"name":"BEQLUGG","text":"Might I see these unfortunate individuals?"},{"name":"MYSTERYVOICE","text":"Why? Do you think you might be able to help them?"},{"name":"BEQLUGG","text":"I might...or I might not. But I shan't know for sure until I have seen their condition firsthand."},{"name":"ALISAIE","text":"Then I would be glad to take you to them...on the understanding that you won't do anything which might increase their suffering."},{"name":"BEQLUGG","text":"It was my faith in man I lost, not my compassion."},{"name":"YSHTOLA","text":"Well, I see no need for all of us to accompany you. While you escort our guest to the Inn, I will assist Urianger in creating the requisite auracite."},{"name":"MYSTERYVOICE","text":"I believe my talents would be better applied to that endeavor as well. Might I leave the three of you to assist Beq Lugg as necessary?"},{"name":"ALPHINAUD","text":"Let us make for Amh Araeng, then."},{"name":"YSHTOLA","text":"Urianger is more than capable of creating the auracite on his own, but if aught should go awry, I would be on hand to assist him."},{"name":"MYSTERYVOICE","text":"It pains me that there are those who yet suffer despite our victory over the Light. We must hope a way can be found to help both them and our friends."},{"name":"ALISAIE","text":"Beq Lugg told me they wished to meet the worst afflicted. Halric... &lt;sigh&gt; There are times when I swear there's something he wants to tell me, if only he could form the words."},{"name":"ALPHINAUD","text":"Having broken Light's stranglehold on the First, I would like to believe they will one day recover. Yet I fear that day may not come soon..."},{"name":"HALRIC","text":"&lt;mumble&gt;"},{"name":"BEQLUGG","text":"So this is Halric, is it? ...Yes, his aetheric balance leans perilously toward the Light."},{"name":"BEQLUGG","text":"Toward stasis..."},{"name":"ALPHINAUD","text":"What do you suppose will happen to him?"},{"name":"BEQLUGG","text":"Not too bright, are you, boy? The same as all poor souls corrupted by the Light─he will become a sin eater."},{"name":"ALISAIE","text":"You don't know that. We've defeated the Wardens and banished the Light from the night sky. Halric was completely unresponsive before, but now..."},{"name":"HALRIC","text":"...&lt;mumble&gt;"},{"name":"BEQLUGG","text":"Then perhaps there is yet hope. Hmmm..."},{"name":"BEQLUGG","text":"If I may, there is a treatment I wish to administer to the patients."},{"name":"ALISAIE","text":"What sort of treatment?"},{"name":"BEQLUGG","text":"In the course of my studies of the soul, I once created a tonic which could temporarily stimulate the aether in one's body. After some refinement, it came to be used by the knights of Voeburt."},{"name":"BEQLUGG","text":"Then for far darker purposes..."},{"name":"BEQLUGG","text":"Lest it fall into the wrong hands, I swore never again to make it. But for their sakes, I will break that oath."},{"name":"BEQLUGG","text":"It is not like to reverse the stagnation, mind you, but it should offer some measure of relief."},{"name":"ALISAIE","text":"Please let this work..."},{"name":"ALPHINAUD","text":"Leave this one to me, <span class=\"highlight\">Forename</span>."},{"name":"BEQLUGG","text":"Come. Let us see what effect my tonic will have on their aether, if any."},{"name":"TODDEN","text":"..."},{"name":"SYSTEM","text":"Todden stares blankly at you. It would seem the tonic has had no effect."},{"name":"PAWNIL","text":"...Hm? What is this...<span class=\"emphasis\">warmth</span> I feel in my chest?"},{"name":"VOYNE","text":"I...I feel...<span class=\"emphasis\">warm</span>! And my legs, they...they don't feel as heavy..."},{"name":"TODDEN","text":"..."},{"name":"SYSTEM","text":"Todden stares blankly at you. It would seem the tonic has had no effect."},{"name":"PAWNIL","text":"Strange... Is it me, or is it suddenly warmer? It feels rather nice."},{"name":"VOYNE","text":"Well, fancy that... My hands don't feel quite so stiff. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"BEQLUGG","text":"Now then, have you noted any change in the patients?"},{"name":"ALPHINAUD","text":"A notable rise in body temperature and increased motor function. In most of the patients, at least."},{"name":"ALISAIE","text":"The more severely afflicted show no response."},{"name":"BEQLUGG","text":"As I feared, then."},{"name":"BEQLUGG","text":"'Tis true that with the restoration of night, the corrupting influence of Light will no longer grow. And yes, their bodies will naturally return to equilibrium given time..."},{"name":"BEQLUGG","text":"But this holds true only for their corporeal aether. Their <span class=\"emphasis\">incorporeal</span> aether─that of the soul─is not so easily mended."},{"name":"ALPHINAUD","text":"Which is why those in the later stages of corruption─like Halric─appear unaffected by your tonic."},{"name":"BEQLUGG","text":"Precisely."},{"name":"BEQLUGG","text":"The boy's soul is too far gone, his mind held together by the finest of threads."},{"name":"BEQLUGG","text":"There is a <span class=\"emphasis\">chance</span> he may one day recover, of course, but it could take years─decades, even."},{"name":"ALISAIE","text":"By the gods, he could wake to find himself an old man."},{"name":"ALPHINAUD","text":"A fine reward for his persistence... The opportunity to mourn the life he never had a chance to live."},{"name":"ALISAIE","text":"No, there must be something we can do."},{"name":"ALISAIE","text":"Look, I realize this is not why we petitioned your aid, but do you think it possible we can find a way to hasten their recovery?"},{"name":"BEQLUGG","text":"...Maybe."},{"name":"BEQLUGG","text":"Nor do I think it <span class=\"emphasis\">impossible</span> that in treating them, we might learn something of relevance to your own predicament..."}],"reward":{"gil":1500,"items":[{"num":2,"id":27891,"one":1},{"num":2,"id":27883,"one":1},{"num":2,"id":27884,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69210]},"next":[69212]},"partials":[{"type":"npc","id":"1032451","obj":{"i":1032451,"n":"Alphinaud","l":2953,"q":2}},{"type":"npc","id":"1031732","obj":{"i":1031732,"n":"Beq Lugg","l":2955,"q":2}},{"type":"item","id":"27891","obj":{"i":27891,"n":"Rare Roast Beef","l":450,"c":24366,"t":46}},{"type":"item","id":"27883","obj":{"i":27883,"n":"Creamy Salmon Pasta","l":450,"c":24029,"t":46}},{"type":"item","id":"27884","obj":{"i":27884,"n":"King Salmon Meuniere","l":450,"c":24324,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69210","obj":{"i":69210,"n":"A Grand Adventure","g":9,"l":"The Ocular","s":20}},{"type":"quest","id":"69212","obj":{"i":69212,"n":"Good for the Soul","g":9,"l":"Amh Araeng","s":40}}]}