{"quest":{"name":"Finding Good Help","location":"Kholusia","id":69216,"patch":5.1,"sort":80,"icon":100940,"eventIcon":71201,"issuer":1031760,"target":1031769,"genre":9,"journal":["Chai-Nuzz's look of steely determination is only slightly undermined by the knocking of his knees.","Rather than build Talos from scratch, Chai-Nuzz proposes capturing the long-abandoned Talos which wander the wilds of Kholusia. A singularly dangerous endeavor, but one which holds no terror for him, knowing as he does that the perfect tools for the task are waiting for you at Top Rung.","The reason for Chai-Nuzz's uncharacteristic self-confidence soon becomes apparent when he shows you a crate filled with canisters whose contents can incapacitate Talos. Moreover, they can be thrown from a distance, making the task surprisingly risk-free. So risk-free, in fact, that Chai-Nuzz volunteers to do the deed himself. He still requires support, however, lest he run afoul of the local wildlife. To that end, you set out for the Quick Way in search of a vantage point from which to warn him of danger.","With heart in throat and canisters in hand, Chai-Nuzz braves the wilds of Kholusia, succeeding at length in subduing a trio of Talos. As the last of them succumbs, you see him pause, seemingly awestruck by the scale of his own achievement. Or perhaps injured. You rush down to be certain.","Your concerns vanish as you near a visibly elated Chai-Nuzz, now the proud owner of three Talos which he is eager to dispatch to Eulmore. After a few adjustments, they spring back to life, and he sends them marching off in the direction of the city.<br><br>At the end of a tiring trek through Kholusia, you arrive in Gatetown to find the Talos have attracted a crowd. Among them, you spy Lady Chai, who is near speechless at the sight of her husband. She duly rushes over to him, wasting no time in showing him the strength of her affection. A strength which renders him briefly unconscious.","Doubts finally assuaged, Wrenden expresses his admiration for Chai-Nuzz and the devotion of those close to him. Taking note of the chattering throng which has formed around the Talos, he declares that it will soon be time for the intrepid entrepreneur to address his fellow citizens as mayor."],"objectives":["Speak with Chai-Nuzz.","Guide Chai-Nuzz from the vantage point.","Speak with Chai-Nuzz.","Speak with Wrenden."],"dialogue":[{"name":"KAISHIRR","text":"That Wrenden geezer doesn't seem so bad. What was Master Chai worried about? He's got to give himself a bit more credit!"},{"name":"ALPHINAUD","text":"Do you see it? There is a fire in Master Chai's eyes that was not there when first we met. A fire we had best keep kindled if we wish to see Eulmore change for the better."},{"name":"WRENDEN","text":"You had a hand in constructing that giant Talos to the north, did you not?"},{"name":"WRENDEN","text":"When the Eulmoran volunteers began arriving, I hid myself away, lest I be recognized...thus depriving myself of what I am reliably informed was a once-in-a-lifetime spectacle. Bugger."},{"name":"CHAINUZZ","text":"Wrenden is quite right. Building Talos from scratch would require time we simply do not have."},{"name":"CHAINUZZ","text":"Which is why I propose to make use of the long-abandoned Talos which wander the wilds of Kholusia."},{"name":"CHAINUZZ","text":"They will need to be deactivated, of course, and if memory serves, the tools required to do so should still be at Top Rung. Come with me."},{"name":"KAISHIRR","text":"How'd you catch a Talos, then? Dig a hole and lure it in?"},{"name":"ALPHINAUD","text":"It is one thing to repair an immobile Talos, as Urianger did, but quite another to <span class=\"emphasis\">catch</span> one, surely? Does this not sound a trifle dangerous?"},{"name":"WRENDEN","text":"So he is an authority on Talos, is he? Hmph! What other surprises could he be hiding, I wonder..."},{"name":"CHAINUZZ","text":"Aha! The old memory hasn't let me down!"},{"name":"CHAINUZZ","text":"This chest contains canisters filled with a dashedly potent insulating powder capable of halting the flow of aether in a Talos. We need only get within throwing distance of one and let fly."},{"name":"ALPHINAUD","text":"...Thus disabling them without damaging them! Ingenious!"},{"name":"CHAINUZZ","text":"An old trick of the trade, nothing more. Once disabled, it should be a simple enough matter to get them to march to Eulmore. More extensive repairs can wait."},{"name":"CHAINUZZ","text":"Ordinarily, this is where I would ask you to run along and do the deed, but as I have said before, it's high time we learned to stand on our own two feet."},{"name":"CHAINUZZ","text":"Thankfully, throwing canisters is something even <span class=\"emphasis\">I</span> should be able to manage."},{"name":"KAISHIRR","text":"Come off it, Master Chai!"},{"name":"KAISHIRR","text":"Even if the Talos ain't a threat, there's a hundred and one other things out there waiting to make a meal of you!"},{"name":"CHAINUZZ","text":"That's as may be, Kai-Shirr, but Wrenden tasked me with solving this problem, and I will not sit idly by while others risk everything to see my harebrained schemes realized. Not this time!"},{"name":"CHAINUZZ","text":"...Which isn't to say the mere thought of it doesn't fill me with dread. Truth be told, I can't feel my legs."},{"name":"CHAINUZZ","text":"But if I'm to prove I'm a man worth following, I must lead by example."},{"name":"ALPHINAUD","text":"Well said, Master Chai!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Hear, hear!"},{"name":"A2","text":"All right, but if there's any trouble, we call it off."},{"name":"CHAINUZZ","text":"Yes, well, it should go without saying that I have no intention of dying for this. I've always preferred <span class=\"emphasis\">living</span> to see the fruits of my labors."},{"name":"CHAINUZZ","text":"And to make sure I do, I will require your help. It is as Kai-Shirr says─these lands are dangerous if one is not careful. I would ask you to use my spyglass to look out for any beasts that could get in the way of my work. I will also need you to alert me when it is safe to subdue the Talos. Understood?"},{"name":"CHAINUZZ","text":"Good. Then let's be off to the Quick Way, through the north gate, and see if we can't find a suitable vantage point for you."},{"name":"KAISHIRR","text":"Either Master Chai's off his nut, or this means more to him than he's been letting on."},{"name":"ALPHINAUD","text":"There is little point in us both shouting instructions. Keep him safe, <span class=\"highlight\">Forename</span>."},{"name":"WRENDEN","text":"When first he arrived, I could barely hear him over the knocking of his knees. And now this. I'm not sure what's gotten into him, but whatever it is, I like it."},{"name":"CHAINUZZ","text":"All right. Nothing to worry about. Just a simple matter of sneaking up on the Talos while avoiding the slavering, bloodthirsty beasts lurking behind every rock. Child's play... Ahem. When you're ready, let us begin."},{"name":"SYSTEM","text":"Keep a lookout for danger and alert Chai-Nuzz when it is safe to incapacitate the Talos. You may move the spyglass, as well as zoom in and out. Point the spyglass at Chai-Nuzz and give him the signal to sneak near the Talos with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"CHAINUZZ","text":"I...I did it? I did it! Let's move on to another Talos, shall we?"},{"name":"CHAINUZZ","text":"I do believe I'm getting the hang of this."},{"name":"CHAINUZZ","text":"You may leave the next one to me, <span class=\"highlight\">Forename</span>."},{"name":"CHAINUZZ","text":"Haha! That should do it! Now we have all we need to proceed."},{"name":"KAISHIRR","text":"Blimey... Thought my heart was going to stop for a moment there. Make that a couple of moments."},{"name":"ALPHINAUD","text":"Our friend returned with nary a scratch. Well done."},{"name":"WRENDEN","text":"It would seem I misjudged Master Chai. There may yet be hope for Eulmore."},{"name":"CHAINUZZ","text":"I can scarcely believe it. It was a reckless, foolish plan. But somehow...it worked."},{"name":"CHAINUZZ","text":"I...I did it."},{"name":"WRENDEN","text":"Master Chai. I believe I owe you an apology."},{"name":"WRENDEN","text":"Your plan to replenish Eulmore's food stores showed forethought and sound judgment. What's more, it is plain your time at Daedalus Stoneworks has equipped you to lead, as evidenced by the extraordinary company you keep."},{"name":"WRENDEN","text":"You, sir, are more than qualified to be the next mayor of Eulmore."},{"name":"CHAINUZZ","text":"I thank you for your vote of confidence, but the fact remains, I am wholly ignorant of the world of politics."},{"name":"CHAINUZZ","text":"Which is why I would ask you to join me, and grant Eulmore the benefit of your counsel."},{"name":"WRENDEN","text":"I would be honored."},{"name":"WRENDEN","text":"When the people behold these Talos, I have no doubt they will lend you their support."},{"name":"ALPHINAUD","text":"It would seem Eulmore's leadership is at last in capable hands, would you not agree?"},{"name":"KAISHIRR","text":"We should probably be getting back soon, Master Chai. After you've tinkered with the Talos and all that. Lady Chai's worried sick."},{"name":"KAISHIRR","text":"Sorry I wasn't much help. Still, seeing Master Chai go after those Talos was something, eh? Inspiring stuff."},{"name":"ALPHINAUD","text":"I daresay the future of Eulmore has never looked brighter."},{"name":"CHAINUZZ","text":"&lt;cough&gt; &lt;cough&gt; I...I'm fine... I just need...a moment... &lt;wheeze&gt;"},{"name":"DULIACHAI","text":"Thank you again for finding my husband. I confess, I was not expecting your return to be quite so grand!"},{"name":"DULIACHAI","text":"That dear, sweet man. He is going to make the most wonderful mayor. I just know it!"},{"name":"WRENDEN","text":"That was quite a reception. One Master Chai will struggle to forget."},{"name":"WRENDEN","text":"More seriously, the arrival of the Talos has seized the public's attention."},{"name":"WRENDEN","text":"Once word has spread around Eulmore, it will be that much simpler to gather one and all so that Master Chai can make his inaugural address."}],"reward":{"gil":1055},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69215]},"next":[69217]},"partials":[{"type":"npc","id":"1031760","obj":{"i":1031760,"n":"Chai-Nuzz","l":2954,"q":2}},{"type":"npc","id":"1031769","obj":{"i":1031769,"n":"Wrenden","l":2954,"q":1}},{"type":"quest","id":"69215","obj":{"i":69215,"n":"For the People","g":9,"l":"Eulmore","s":70}},{"type":"quest","id":"69217","obj":{"i":69217,"n":"Moving Forward","g":9,"l":"Kholusia","s":90}}]}