{"quest":{"name":"A Grand Adventure","location":"The Ocular","id":69210,"patch":5.1,"sort":20,"icon":112373,"eventIcon":71201,"issuer":1032121,"target":1032451,"genre":9,"journal":["The Crystal Exarch would waste no time in seeking help for your stranded comrades.","The Exarch urges you to make ready while he arranges for a ship to bear you across the lake. Urianger, however, begs permission to work on fashioning white auracite instead, reasoning that not everyone need be present for the journey. He departs soon after, leaving you to prepare for what the Exarch believes is sure to be a warm reception.","You find the Exarch waiting at the docks of Sullen. In a bid to pique the interest of the reclusive mage of the palace, he proposes a boisterous entrance through the main gate. Though Alisaie seems unconvinced, Y'shtola concedes that besting the Nu Mou's familiars should serve to earn their attention. And so it is decided that you will enter through the front door, weapons in hand.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","You pass through winding corridors and courtyards lush with greenery, magical creatures attempting to bar your every step. Yet they cannot prevent you from reaching the heart of the Grand Cosmos. Within, you find the mage waiting, and without a moment's hesitation, they unleash their fiercest familiar upon you. Nevertheless, its flame is soon snuffed out.","Sheathing your weapons, you find yourselves in the presence of Beq Lugg, the Exarch's promised master of soulcraft. Though initially determined not to help you, the Nu Mou inevitably gives in to the inveigling words of your companions, and a deal is struck. The Exarch duly suggests you all retire to the Crystal Tower, where you may speak in private.","You find Alphinaud waiting for you at the docks, the others having apparently gone ahead to the Crystal Tower. He confesses to feeling a slight pang of regret for his choice of words in persuading Beq Lugg, but quickly sets it aside, suggesting you hurry and join the others."],"objectives":["Speak with the Crystal Exarch in Sullen.","Enter the Grand Cosmos.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"The Nu Mou seemed such a welcoming folk in Il Mheg. What do you suppose could have driven this one to a life of seclusion?"},{"name":"ALISAIE","text":"I'm sick and tired of the Exarch's attempts at <span class=\"emphasis\">selfless sacrifice</span>. If he suggests dying one more time, I swear I'm going to grant him his wish."},{"name":"YSHTOLA","text":"A mage of surpassing skill living a life of seclusion. Now where have I heard that before? One can only hope they are more receptive to unsolicited visitations."},{"name":"URIANGER","text":"'Tis said the Kingdom of Voeburt was once home to the realm's greatest knights and magicks both."},{"name":"URIANGER","text":"To command a place at the royal court, the Nu Mou whom we seek must needs have been a mage among mages."},{"name":"MYSTERYVOICE","text":"The Grand Cosmos─that is, the palace we seek─stands on the opposite shore of the Source. I will arrange for a boat to carry us there."},{"name":"URIANGER","text":"Whilst thou journeyest thither, I think it best that I devote mine energies to the creation of white auracite─by thy leave, of course. The process requireth no small amount of time, and should the Nu Mou consent to lend us their aid, we will have need of a suitable vessel ere long."},{"name":"MYSTERYVOICE","text":"Agreed. Then I would ask the rest of you to meet me in Sullen. And...do be prepared for a warm reception."},{"name":"URIANGER","text":"Pray join the others in Sullen. I shall turn my thoughts to the auracite, and apprise Thancred and Ryne of our progress."},{"name":"ALPHINAUD","text":"I was relieved to hear the Exarch intended to arrange for a boat to carry us across the lake. N-Not that I would be opposed to swimming, mind you."},{"name":"ALISAIE","text":"The Exarch said to prepare for a warm reception at the palace. Let's hope it's more cordial than his last visit."},{"name":"YSHTOLA","text":"He said the palace is on the opposite shore, but I see nothing on the horizon save empty sky. Curious..."},{"name":"MYSTERYVOICE","text":"As I told you before, I had scarcely set foot on the palace grounds when I was set upon by our host's familiars, and I expect our reception today to be no different. Which is why I propose we march through the main gate, weapons drawn."},{"name":"ALISAIE","text":"I'm sorry, but are we not here to petition for assistance? You can't honestly think barging in looking for a fight is going to persuade them."},{"name":"YSHTOLA","text":"Actually, I believe the Exarch may have the right of it."},{"name":"YSHTOLA","text":"They have no doubt poured a great deal of time and energy into their creations. Were I them, I should be most interested to meet with those who could overcome my defenses."},{"name":"MYSTERYVOICE","text":"As would any true seeker of knowledge. And there is little we can say or do to convince them to help us if we know nothing of their character, nor less why they chose to hide themself from the world."},{"name":"MYSTERYVOICE","text":"But if we can seize their interest, mayhap we can earn ourselves an audience."},{"name":"ALISAIE","text":"Weapons drawn it is, then."},{"name":"ALISAIE","text":"Though I must say, Exarch, you certainly seem to be enjoying all of this."},{"name":"MYSTERYVOICE","text":"Do I? Well, I will not deny that I enjoy the thought of fighting alongside you all rather than pacing about inside the Crystal Tower."},{"name":"ALPHINAUD","text":"You <span class=\"emphasis\">both</span> seem to be in rather high spirits, if you ask me. Not that I'm surprised. Your moods invariably improve when <span class=\"highlight\">Forename</span> is around."},{"name":"ALISAIE","text":"Uh─ What exactly are you implying?"},{"name":"MYSTERYVOICE","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> averted a Calamity, and the Light which seemed destined to consume <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> has been extinguished. 'Tis only natural that we be pleased to see <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"YSHTOLA","text":"Yes, well, you will have plenty of time to celebrate <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> good health <span class=\"emphasis\">after</span> we've finished here."},{"name":"MYSTERYVOICE","text":"O-Of course. Then let us proceed to the palace."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Small talk."},{"name":"A1","text":"Form a party and enter the Grand Cosmos."},{"name":"A1","text":"Nothing."},{"name":"ALPHINAUD","text":"How long has it been since we last went on such an expedition? I cannot help but be reminded of the ruins of Skalla..."},{"name":"ALISAIE","text":"I think we've done enough talking, don't you? We have a Nu Mou to impress."},{"name":"YSHTOLA","text":"I can but imagine what manner of beasts keep guard here. No doubt they will afford us scant opportunity to explore the palace. A pity..."},{"name":"MYSTERYVOICE","text":"'Tis good to be here with you for a change. Whatever you would have me do, you need but say the word."},{"name":"ALPHINAUD","text":"There you are. The others have gone ahead to the Crystal Tower with Beq Lugg."},{"name":"ALPHINAUD","text":"For the record, I truly wish we hadn't had to resort to using such words when treating with them. I have ever sought to <span class=\"emphasis\">convince</span>, not compel. Yet I cannot deny that a part of me is glad Urianger shared his knowledge of the Nu Mou with us. Had he not, Beq Lugg wouldn't be here."},{"name":"ALPHINAUD","text":"Speaking of whom─we should hurry. To keep our guest waiting would only add insult to injury."},{"name":"SYSTEM","text":"You may now enter the Grand Cosmos with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."}],"reward":{"gil":4800,"instance":73},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69209]},"next":[69211]},"partials":[{"type":"npc","id":"1032121","obj":{"i":1032121,"n":"Crystal Exarch","l":3223,"q":4}},{"type":"npc","id":"1032451","obj":{"i":1032451,"n":"Alphinaud","l":2953,"q":2}},{"type":"instance","id":"73","obj":{"i":73,"n":"The Grand Cosmos","c":61801,"t":"Dungeons","min_lvl":80,"max_lvl":80,"min_ilvl":430,"max_ilvl":470}},{"type":"quest","id":"69209","obj":{"i":69209,"n":"Shaken Resolve","g":9,"l":"The Rising Stones","s":10}},{"type":"quest","id":"69211","obj":{"i":69211,"n":"A Welcome Guest","g":9,"l":"Lakeland","s":30}}]}