{"quest":{"name":"Moving Forward","location":"Kholusia","id":69217,"patch":5.1,"sort":90,"eventIcon":71201,"issuer":1031770,"target":1031781,"genre":9,"journal":["Despite the butterflies in his stomach, Chai-Nuzz is prepared to address the masses."],"objectives":["Speak with Chadden.","Speak with Alphinaud.","Speak with Kai-Shirr."],"dialogue":[{"name":"KAISHIRR","text":"Sorry I wasn't much help. Still, seeing Master Chai go after those Talos was something, eh? Inspiring stuff."},{"name":"ALPHINAUD","text":"I daresay the future of Eulmore has never looked brighter."},{"name":"DULIACHAI","text":"Thank you again for finding my husband. I confess, I was not expecting your return to be quite so grand!"},{"name":"DULIACHAI","text":"That dear, sweet man. He is going to make the most wonderful mayor. I just know it!"},{"name":"WRENDEN","text":"There is no time to lose. We must begin making preparations for the inaugural address. Once Master Chai has caught his breath, of course."},{"name":"CHAINUZZ","text":"No need to fret, <span class=\"highlight\">Forename</span>. I have never felt better. &lt;cough&gt;"},{"name":"CHAINUZZ","text":"And not at all overawed by the prospect of addressing the assembled masses of Eulmore..."},{"name":"CHAINUZZ","text":"As for where to do it... If we're to accommodate everyone who might feasibly wish to attend, I suppose the only place large enough would be the Emergent."},{"name":"WRENDEN","text":"Then I will go and spread the word among the citizens─both free and bonded─that they are to assemble there to meet their new mayor."},{"name":"WRENDEN","text":"You there, uh...Kai-Shirr, was it? Would you go and inform the residents of Gatetown and the Derelicts?"},{"name":"KAISHIRR","text":"'Course I will!"},{"name":"CHAINUZZ","text":"Good lad. I will let the guards know not to bar the way to Vauthry's chambers."},{"name":"CHAINUZZ","text":"...It goes without saying that I expect the Warrior of Darkness to attend─assuming <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s available? Might as well see it through to the bitter end, eh? The doorman at the Crown Lift will show you up."},{"name":"KAISHIRR","text":"Don't worry, I'll make sure everyone's there for Master Chai's big speech. So get yourself down to the Emergent! Go on!"},{"name":"CHADDEN","text":"Ah, yes. Master Chai told us to expect you. The Emergent is already filling up with people of all persuasions─free and bonded, citizens and non-citizens."},{"name":"CHADDEN","text":"But for you, our guest of honor, we have reserved a place at the front. Right this way, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>."},{"name":"KAISHIRR","text":"Seeing everyone come together like that... &lt;sniff&gt; It was beautiful, that was."},{"name":"WRENDEN","text":"Now our work can begin in earnest. I very much look forward to seeing this Eulmore for the people."},{"name":"DULIACHAI","text":"Wasn't he simply wonderful? Seeing him take charge of the room as he did! Oh, it reminds me why I fell for him in the first place..."},{"name":"CHAINUZZ","text":"The city of final pleasures, they used to call this place, back when the world was ending. But now...now I hope it will become the city of new endeavors."},{"name":"ALPHINAUD","text":"That was a fine speech, Master Chai. I believe your words stirred every soul in attendance."},{"name":"CHAINUZZ","text":"Stirred them to action, I hope. If I have learned anything from all of this, it is that change begins with the individual."},{"name":"CHAINUZZ","text":"'Tis but a matter of finding the strength to take the first step."},{"name":"WRENDEN","text":"Assuming my fellow Eulmorans can, it shall be my honor and privilege to help them walk this road we have chosen."},{"name":"CHAINUZZ","text":"But we must not forget the individuals who made all of these changes possible."},{"name":"CHAINUZZ","text":"Were it within my power, I would carve a tribute to your heroism into the very stone upon which this city stands."},{"name":"DULIACHAI","text":"I hate to change the subject, darling...but now that you have officially taken office, have you given any thought to your mayoral seat...?"},{"name":"CHAINUZZ","text":"We will <span class=\"emphasis\">not</span> be moving into the Emergent, dearest. It's too big, for one thing, and too far from the people for another. We will retain our current residence, and I will govern here in the Parlor."},{"name":"DULIACHAI","text":"Oh, I was hoping you'd say that! I much prefer the view from the Parlor."},{"name":"HATHENBET","text":"(-???-)Beggin' your pardon, Master Chai... But have you got time for a word?"},{"name":"CHAINUZZ","text":"Ah, y-yes. Yes of course, er...Hathen...bet?"},{"name":"HATHENBET","text":"Aye, that's me. I liked your speech. But there's folk outside these walls as don't even have enough food to last till tomorrow, and more who're countin' their crumbs. If ye've a plan to change that, I want to help set things in motion."},{"name":"CHAINUZZ","text":"Then we've much to discuss."},{"name":"CHAINUZZ","text":"No sooner do I take office than my work begins in earnest. Well, I suppose I brought it upon myself. Thank you again for your help, <span class=\"highlight\">Forename</span>. I hope to see you again before long."},{"name":"KAISHIRR","text":"What a day... I dunno what it means exactly, but I do know I've got plenty to think about."},{"name":"ALPHINAUD","text":"I sense we all have a great deal to consider."},{"name":"ALPHINAUD","text":"I had resolved to remain here until such time as Eulmore's future was secured, but it is clear to me now that the city is in capable hands."},{"name":"ALPHINAUD","text":"I have every confidence they will find their way, and I believe it is time we went on ours."},{"name":"ALPHINAUD","text":"With Master Chai at the helm, if only for the interim, I feel I can bid farewell to Eulmore, and return to the Source with no regrets."},{"name":"KAISHIRR","text":"So Alphinaud's leaving too, is he? Seems like everyone's moving on. Everything's changing..."},{"name":"KAISHIRR","text":"I've been thinking about what <span class=\"emphasis\">I</span> should do in all this. Like I told you, I spent most of my life dreaming about living here with my friends. In paradise."},{"name":"KAISHIRR","text":"That paradise is gone, but something better's taken its place. And I reckon I want to be a part of it."},{"name":"KAISHIRR","text":"This “Eulmore for the people” Master Chai's been going on about ain't gonna build itself, after all. Not that I'm much of a builder."},{"name":"KAISHIRR","text":"Me and my friends'll find a way to make a difference, though─help keep things changing for the better."},{"name":"ALPHINAUD","text":"A far nobler dream than the one to which you clung before─and one I am happy to say we share. Whatever path you choose, I will pray for your success."},{"name":"KAISHIRR","text":"Well, when you put it like that, there's no going back now, is there? We've got a few ideas on how we can do our bit. Just a matter of taking the first step!"}],"reward":{"gil":1073,"items":[{"id":28886}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69216]},"next":[69218,69265]},"partials":[{"type":"npc","id":"1031770","obj":{"i":1031770,"n":"Chai-Nuzz","l":2954,"q":1}},{"type":"npc","id":"1031781","obj":{"i":1031781,"n":"Kai-Shirr","l":2952,"q":2}},{"type":"item","id":"28886","obj":{"i":28886,"n":"Pain in Pleasure Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"69216","obj":{"i":69216,"n":"Finding Good Help","g":9,"l":"Kholusia","s":80}},{"type":"quest","id":"69218","obj":{"i":69218,"n":"Vows of Virtue, Deeds of Cruelty","g":9,"l":"Eulmore","s":100}},{"type":"quest","id":"69265","obj":{"i":69265,"n":"Oh, Beehive Yourself","g":112,"l":"Eulmore","s":8001,"f":1}}]}