{"quest":{"name":"As the Heart Bids","location":"Il Mheg","id":69223,"patch":5.1,"sort":5,"icon":100955,"beast":12,"unlocksFunction":1,"eventIcon":71341,"issuer":1031806,"target":1031806,"genre":56,"journal":["Tyr Beq looks ready to curl up and sleep on the spot.<br>※The difficulty of this quest will be synced to your current level.","Being on the receiving end of An Lad's spell has left Tyr Beq extremely drowsy, and only the ghastly thought of being sucked upon by Ezel is keeping them awake. The familiar suggests inspecting Lyhe Mheg for anomalies, and while there, taking the opportunity to check on the little girl in Slitherbough.<br><br>※You may enter Lyhe Mheg by speaking with Thon Sul in Lydha Lran.<br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Arriving in Lyhe Mheg, you speak with the little girl, who is happier now that she has been freed from her fear of failure. She then reveals that she too met with An Lad in her dreams. Seeing the pale pixie's loneliness, she tried to reach out to them, only to end up being caught in the nightmare. Having learned all that you could, you and your companions reconvene.","Tyr Beq is more determined than ever to help An Lad and become their friend. To that end, you turn your attention to the task of reopening the fifth gate, which you deduce leads to Il Mheg, where the source of the nightmares is none other than An Lad themself. At that moment, Tyr Beq finally succumbs to sleep. While the pixie rests, Ezel suggests asking the fae folk about the previous Titania, the better to understand An Lad's heart.","Speaking with various fae folk, you learn not only about the faerie king, but their connection to Tyr Beq besides. Thus informed, you head back to Lydha Lran to share your findings with Ezel.","Tyr Beq awakens as you and Ezel trade notes on Titania. Though at first annoyed by your prying, the pixie is gladdened that their departed friend hasn't been forgotten. Tyr Beq explains that, in the past, when no one else wanted anything to do with them, their friend alone accepted them as they were. This reminiscence sparks an epiphany, and they believe that An Lad simply wants for someone to do the same for them. Thus it is decided that you will enter Lyhe Mheg, there to find and save the tormented pixie.","Even before Thon Sul speaks, it's clear from their expression that trouble is afoot. A terrible power is welling up within Lyhe Mheg, and An Lad is likely the cause. With nary a pause, Tyr Beq sallies forth to stop whatever is unfolding within, and Ezel hurriedly follows after them. Requiring no urging, you turn to Thon Sul to be transported to Lyhe Mheg.","Setting foot inside Lyhe Mheg, you are greeted with a dreadful sight. By questioning their own existence, An Lad is causing their very essence to unravel, the garden along with it. You fight your way through the chaos, and at length come face-to-face with An Lad's own nightmare. With your strength combined, you and yours succeed in vanquishing the creature, thereby delivering the dream realm from oblivion.<br><br>※In the event that you leave the instance, you may re-enter by speaking with Thon Sul in Lydha Lran.","Thanks to Tyr Beq's unconditional acceptance, An Lad finally finds a place to belong, and encouraged by new friends, they use their power to bring Lyhe Mheg into its full splendor.","Tyr Beq offers you their heartfelt thanks for your part in protecting Lyhe Mheg, and together you return to Lydha Lran to assure everyone that all is well again.","With Tyr Beq vouching for them, An Lad has found acceptance among their fellow pixies. And though Lyhe Mheg has been restored to its full splendor, the Dreamspinners' work is never done; more dream bubbles are always needed to ensure that the Garden of Dreams remains beautiful and full of fun. To that end, Tyr Beq bids you continue lending them your aid─for the happiness of pixies and mortals alike."],"objectives":["Speak with the Slitherbough girl in Lyhe Mheg.","Speak with Tyr Beq.","Gather information in Il Mheg.","Speak with Ezel II.","Speak with Thon Sul.","Speak with Thon Sul again.","Speak with Tyr Beq.","Speak with Tyr Beq In Lydha Lran."],"dialogue":[{"name":"TYRBEQ","text":"&lt;yawn&gt; <span class=\"highlight\">Forename</span>, I feel so sleepy... Is this the effect of An Lad's spell...?"},{"name":"EZELII","text":"Given that they tried to plant a nightmare in you, it's little wonder you should feel drowsy. If the urge is so strong, why don't you just sleep?"},{"name":"TYRBEQ","text":"N-Not on your life! If I have a nightmare, you'll come and suck on me!"},{"name":"EZELII","text":"If you are not tormented by an unfulfilled need, you shouldn't be plagued by nightmares. But in the event that you were...yes, I would suck on you. &lt;slurp&gt;"},{"name":"TYRBEQ","text":"I'm never going to sleep again! Never, ever!"},{"name":"EZELII","text":"If you say so. Now then, may I suggest we inspect Lyhe Mheg for anomalies? And while we're there, perhaps we can look in on the little girl in Slitherbough."},{"name":"SLITHERBOUGHGIRL03686","text":"I had a feeling that we would meet again ere long!"},{"name":"EZELII","text":"I take it you've not had nightmares since. All is well with you, little one?"},{"name":"SLITHERBOUGHGIRL03686","text":"Yes, thank you! Now that the fear of failure no longer consumes me, a pall has lifted from my heart. I feel happier than I have in a long time."},{"name":"TYRBEQ","text":"That's wonderful to hear. Now tell me, did you meet An Lad─the pale pixie─in your dreams?"},{"name":"SLITHERBOUGHGIRL03686","text":"Only briefly. But that was enough for me to see their torment. Theirs is a lonely soul, one which draws powerful emotions to it."},{"name":"SLITHERBOUGHGIRL03686","text":"And though I only caught fragments, in the deepest depths of their heart, I glimpsed this realm. And I glimpsed you, Tyr Beq."},{"name":"TYRBEQ","text":"What? Me?"},{"name":"SLITHERBOUGHGIRL03686","text":"Feeling sorry for An Lad, I befriended them. But I ended up being caught in that nightmare."},{"name":"SLITHERBOUGHGIRL03686","text":"Oh! I'm sorry, but I must go! My mother is calling!"},{"name":"TYRBEQ","text":"With her talent, this little girl should be able to tell us about her dreams in more detail. &lt;yawn&gt; Ugh, can barely keep my eyes open..."},{"name":"EZELII","text":"What would Tyr Beq's nightmare taste like, I wonder... &lt;slurp&gt;"},{"name":"TYRBEQ","text":"An Lad might have spurned me, but I won't give up. I want to become their friend, I truly do."},{"name":"TYRBEQ","text":"I feel their loneliness so very keenly. And I think it's because of all the mortal hearts I've glimpsed, together with you and Ezel."},{"name":"TYRBEQ","text":"I don't know why, but when I think about An Lad, my chest tightens up. Am I being strange? And if I were, would you still stand by me? Or would you run for the hills?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Eccentric or no, we're with you."},{"name":"A2","text":"We wouldn't dream of abandoning you."},{"name":"EZELII","text":"Hear, hear! We've come this far together! We're with you to the end!"},{"name":"TYRBEQ","text":"Thank you, <span class=\"highlight\">Forename</span>. Ezel."},{"name":"EZELII","text":"With that settled, let's discuss our next course of action. Now, you said that the fifth gate didn't exist prior to the nightmares."},{"name":"TYRBEQ","text":"Yes, we fashioned only four. Someone else must have created the fifth─someone as skilled in manipulating dreams as me."},{"name":"EZELII","text":"This is problematic indeed. Up till now, we lifted the seals by vanquishing the nightmares in the regions beyond the gates. This time, however, we do not know where the gate leads."},{"name":"TYRBEQ","text":"Hold on, now. If An Lad was in Lyhe Mheg, does that mean...?"},{"name":"EZELII","text":"Hm! The likelihood is passing high─the place is Il Mheg. And the fact that the gate is sealed means an individual already exists who is the source of the nightmares."},{"name":"EZELII","text":"Someone here in the faerie kingdom, who is constantly plagued by terrible dreams... I can't imagine anyone more likely than An Lad themself."},{"name":"TYRBEQ","text":"So we help An Lad, like we helped the children. Free them from the nightmare that's...that's... &lt;yawn&gt; Can't fight it...any...more..."},{"name":"EZELII","text":"It was only a question of when. Let's leave Tyr Beq to rest for now and do what we can in the meantime."},{"name":"EZELII","text":"So, if we are to help An Lad, it is essential that we understand them. To that end, I suggest that we learn all that we can of the previous Titania by speaking with the fae folk. Let's split up for this task and reconvene here afterwards."},{"name":"EZELII","text":"An Lad was as an empty vessel, highly susceptible to outside influence. And it's difficult to imagine a stronger influence than that of the faerie king."},{"name":"OSESIGUN","text":"You wish to know about our previous monarch? As I recall, before their ascension, they were exceptional at wielding the power of nature. Oh, and they were seldom seen without their bosom friend─a pixie of pink."},{"name":"OSESIGUN","text":"The tragic manner of their downfall is a source of immeasurable pain for us. Never will we forget their sacrifice."},{"name":"OSESIGUN","text":"...Hm? Payment for the information? No, no, that will not be necessary. If anything, we are the ones who owe you thanks for setting our monarch free."},{"name":"OULSIGUN","text":"The old Titania? Of course, how could we forget? They protected us from sin eaters, and we're forever grateful."},{"name":"OULSIGUN","text":"I even remember them before they became king. They weren't so different from the rest of us."},{"name":"OULSIGUN","text":"Aye, they liked making mischief, drinking milk, rollicking in dreams─all the usual pixie pleasures. It must have been hard for them, alone inside that castle."},{"name":"OULSIGUN","text":"But enough about that! Play with me, play with me! It isn't fair that Tyr Beq gets to spend all that time with you!"},{"name":"IALAJUL","text":"Curious about the previous Titania, you say? Of course, I should be glad to tell you what I know."},{"name":"IALAJUL","text":"When they became a sin eater, it was with great sorrow that we resolved to seal them away inside Lyhe Ghiah. Tyr Beq opposed the decision to the last."},{"name":"IALAJUL","text":"I cannot claim to know the heart of a pixie, but if I were Titania, I would have liked nothing more than to be praised. To be remembered."},{"name":"IALAJUL","text":"Now then, if I may ask, are you not being subjected to mischief? For your own good, I advise against getting too intimate with the pixies."},{"name":"OSESIGUN","text":"The tragic manner of our king's downfall is a source of immeasurable pain for us. Never will we forget their sacrifice."},{"name":"OULSIGUN","text":"The old Titania protected us from sin eaters, and we're forever grateful. If they were still here, we'd invite them to play with us."},{"name":"IALAJUL","text":"Titania gave their all for us. Were I them, I would have liked nothing more than to be praised. To be remembered."},{"name":"TYRBEQ","text":"Zzzzzz..."},{"name":"EZELII","text":"There you are, <span class=\"highlight\">Forename</span>. What were you able to learn about Titania?"},{"name":"TYRBEQ","text":"Ahhh! You went around prying while I slept!? Hmph, and people complain that pixies have no propriety!"},{"name":"EZELII","text":"T-Tyr Beq! You're awake!"},{"name":"TYRBEQ","text":"But...to know that everyone still remembers my friend─still remembers their sacrifice... It makes me happier than I can say."},{"name":"EZELII","text":"'Tis plain that the two of you were the closest of friends. All the fae folk with whom I spoke attested to that."},{"name":"TYRBEQ","text":"With my obsession for dreams, I was considered strange even among pixiekind. No one wanted anything to do with me, but they accepted me as I was. Without them, I would have been all alone, like An Lad."},{"name":"TYRBEQ","text":"&lt;gasp&gt; I see now... An Lad─they're the pixie I used to be!"},{"name":"TYRBEQ","text":"Like me, all they need is for someone to accept them as they are!"},{"name":"EZELII","text":"I see! Self-actualization, I believe my master called this need, and I daresay it will provide us with a clue to unsealing the final gate!"},{"name":"TYRBEQ","text":"It doesn't matter whose soul An Lad was born from. Doesn't matter whose aether they inherited. They're a pixie like the rest of us."},{"name":"TYRBEQ","text":"As a fellow pixie, I can't let them suffer anymore. I can't let them stay in that dark, lonely place."},{"name":"TYRBEQ","text":"What's more, I can't help but feel that my friend was the one who guided them to me."},{"name":"TYRBEQ","text":"They loved everyone, they did. “No one should be alone,” I can almost hear them say..."},{"name":"TYRBEQ","text":"They reached their hand out to me once upon a time. Now it's my turn to reach mine out to An Lad."},{"name":"TYRBEQ","text":"Come, let's go to Lyhe Mheg and find An Lad! If we have to, we'll pound on the gate until they come out!"},{"name":"THONSUL","text":"Tyr Beq, thank heavens you're here! There's trouble in Lyhe Mheg! Terrible trouble!"},{"name":"TYRBEQ","text":"What is it!?"},{"name":"THONSUL","text":"I can't say for certain, but there's a power welling up within! A terrible power!"},{"name":"EZELII","text":"What!? Could it be An Lad!?"},{"name":"TYRBEQ","text":"I'm going inside. If it's An Lad, I'm the only one who can stop them."},{"name":"EZELII","text":"Now, wait just a─ Confound it! I'm going with you!"},{"name":"THONSUL","text":"If you go too, there's no guarantee you'll come out alive...but please go anyway! Go and help Tyr Beq!"},{"name":"TYRBEQ","text":"Something's not right..."},{"name":"EZELII","text":"What is happening?"},{"name":"TYRBEQ","text":"No... My precious Lyhe Mheg..."},{"name":"EZELII","text":"An Lad's power is running rampant. By questioning their own existence, they are causing their essence to unravel...Lyhe Mheg along with it!"},{"name":"EZELII","text":"If this realm collapses, there's no telling how the minds of those whose dreams are connected to it will be affected."},{"name":"EZELII","text":"Yet one thing is all but certain: An Lad themself will disappear."},{"name":"TYRBEQ","text":"No! They're my friend! I can't let that happen!"},{"name":"TYRBEQ","text":"Please! Please help me help An Lad!"},{"name":"ANLAD","text":"When I was thirsty, no one gave me anything to drink... When I wanted to play, they drove me away..."},{"name":"ANLAD","text":"I just wanted a friend. Wanted someone to tell me that I did well. But everyone treats me like a plague..."},{"name":"ANLAD","text":"I shouldn't have been born."},{"name":"TYRBEQ","text":"An Lad! It's all right! We're fighting with you!"},{"name":"ANLAD","text":"&lt;sob&gt; It's no use... <span class=\"emphasis\">I'm</span> no use..."},{"name":"EYEBALL03687","text":"Yes, yes, embrace your self-doubt. Your fear, your hatred."},{"name":"EYEBALL03687","text":"The wretched world has given you naught but torment. You will reward them in kind. Give them their deepest, darkest nightmares."},{"name":"EVENTAREA","text":"Proceed with the story?"},{"name":"EZELII","text":"The nightmare is fading! We did it!"},{"name":"TYRBEQ","text":"Silly pixie! Don't lose control like that ever again! That nightmare of yours was no joke!"},{"name":"ANLAD","text":"My...nightmare?"},{"name":"TYRBEQ","text":"Yes, yours! And it caused a great deal of trouble!"},{"name":"ANLAD","text":"I'm sorry..."},{"name":"TYRBEQ","text":"All well and good to apologize, but don't you think you have something else to say to <span class=\"highlight\">Forename</span>? <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s the one who vanquished your nightmare."},{"name":"ANLAD","text":"I was dreaming. Dreaming that I was imprisoned alone inside a great castle."},{"name":"ANLAD","text":"I was so lonely and scared... It was so terribly silent, I felt as though I was losing myself..."},{"name":"ANLAD","text":"But you came, <span class=\"highlight\">Forename</span>. You came and freed me. Thank you."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You did well."},{"name":"A1","text":"It was harder the first time."},{"name":"TYRBEQ","text":"So, An Lad. Now that your nightmare is gone, we can make lots and lots of fun dreams together!"},{"name":"ANLAD","text":"But I don't know how to make fun dreams. I'm afraid I'll only make more nightmares."},{"name":"TYRBEQ","text":"Look, it's true that you're a little different from the rest of us. It's true you have a few things to learn."},{"name":"TYRBEQ","text":"But there's no need to rush. Just do what you think feels right, and all will be well."},{"name":"TYRBEQ","text":"Even if you do end up creating a nightmare, there's no need to fret. Ezel here will make short work of it."},{"name":"EZELII","text":"Just so! I only ask that you don't keep the dreamer for yourself! &lt;snort&gt;"},{"name":"TYRBEQ","text":"And if that happens, we'll just fix up the nightmare, add a pinch of pixie magic to make it fun again!"},{"name":"TYRBEQ","text":"Did you know, An Lad? Like a rainbow that appears after the storm, no dream is more beautiful than the one you see after conquering a nightmare."},{"name":"TYRBEQ","text":"So I want you to fly tall. Because you're one of us, a proud pixie of Il Mheg."},{"name":"EZELII","text":"That's right! Rain, hail, or shine, the Kingdom of Rainbows is your home!"},{"name":"EZELII","text":"Here, you can always be yourself!"},{"name":"ANLAD","text":"I can be myself..."},{"name":"ANLAD","text":"Ahhh, my heart swells with song! I...I can't help but want to dance!"},{"name":"TYRBEQ","text":"Yes! Yes, that's the way!"},{"name":"TYRBEQ","text":"Do as your heart bids you, and dance! Dance with me!"},{"name":"EZELII","text":"Good heavens... It's beautiful..."},{"name":"TYRBEQ","text":"Haha! See, An Lad?"},{"name":"TYRBEQ","text":"I knew you had it in you!"},{"name":"ANLAD","text":"This is what it means to have fun! I never imagined it would feel so amazing!"},{"name":"ANLAD","text":"Come, <span class=\"highlight\">Forename</span>! Come and play with us!"},{"name":"SYSTEM","text":"By freeing An Lad from their nightmares, you and yours have reclaimed all the dreams in Norvrandt."},{"name":"SYSTEM","text":"Forever young and carefree, the pixies shall rollick with their guests in Lyhe Mheg, this night and all the nights to come!"},{"name":"TYRBEQ","text":"Do you see all of this, <span class=\"highlight\">Forename</span>? <span class=\"emphasis\">This</span> is our precious Lyhe Mheg, and if it weren't for you, it wouldn't still be here."},{"name":"TYRBEQ","text":"And neither would this hopelessly silly pixie!"},{"name":"ANLAD","text":"Am I silly?"},{"name":"TYRBEQ","text":"Oh, yes! You're the silliest...and dearest of all!"},{"name":"EZELII","text":"I must say, when they behave thus, pixies can be quite adorable."},{"name":"TYRBEQ","text":"From here on, <span class=\"highlight\">Forename</span>, I'll continue watching over Lyhe Mheg with my friends. We'll revel and rollick and make sure that the garden is always filled with fun."},{"name":"TYRBEQ","text":"And different though our kinds may be, I count you among the very best of friends."},{"name":"TYRBEQ","text":"So please, come and visit us often and play with us!"},{"name":"ANLAD","text":"Why don't we turn <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> into a leafman? That way <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> can stay with us forever."},{"name":"TYRBEQ","text":"...An Lad. If there's one thing you must <span class=\"emphasis\">never</span> do, it's lay a hand on <span class=\"highlight\">Forename</span>."},{"name":"ANLAD","text":"All right, if you say so..."},{"name":"TYRBEQ","text":"Right, I should assure everyone outside that all is well again. Let's return to Lydha Lran for now."},{"name":"EZELII","text":"In An Lad's marvelous creations, I can fairly sense Titania's hand. And though it was for but a moment, I thought I saw not two, but three pixies dancing."},{"name":"ANLAD","text":"Ahhh, such fun! This is all new to me, but it somehow feels nostalgic. As if I've found a missing part of myself."},{"name":"TYRBEQ","text":"I've told the other pixies about everything. They understand now that An Lad isn't a danger, and welcome them as one of us. It's simple like that with our kind."},{"name":"TYRBEQ","text":"And though we've restored Lyhe Mheg to its full splendor, it doesn't mean our work is done. We need to ensure that the realm is always beautiful and filled with fun, and for this we need to keep on collecting dream bubbles."},{"name":"TYRBEQ","text":"I hope that you'll continue to lend the Dreamspinners a helping hand, <span class=\"highlight\">Forename</span>─for the fun and happiness of pixies and mortals alike!"},{"name":"ANLAD","text":"Tyr Beq and the others are happy...and that makes me happy!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Sworn</span> reputation with the Dreamspinners."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon completion of the pixie tribal daily quests."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Jul Oul."}],"reward":{"gil":3215},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":34}],"quests":[69222]},"next":[69224]},"partials":[{"type":"npc","id":"1031806","obj":{"i":1031806,"n":"Tyr Beq","l":2956,"q":6}},{"type":"quest","id":"69222","obj":{"i":69222,"n":"A Cry from the Ashes","g":56,"l":"Il Mheg","s":4,"f":1}},{"type":"quest","id":"69224","obj":{"i":69224,"n":"Forever and a Dream","g":56,"l":"Il Mheg","s":6,"f":1}}]}