{"quest":{"name":"Sweet as Honey","location":"Il Mheg","id":69229,"patch":5.1,"sort":11,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee is anxious about their dealings with the Nu Mou.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Survey the designated location north of Phisor Lran and slay a sweet echevore for its tail.","Deliver the echevore tail to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Well, if it isn't my favorite mortal! And do you know <span class=\"emphasis\">why</span> you're my favorite? Why, it's because you have a knack for showing up <span class=\"emphasis\">precisely</span> when I need something done. Like now, for example!"},{"name":"UINNEE","text":"You see, I've asked a Nu Mou crafter to craft me a delightful new toy to bring to the children in their dreams, and I promised I'd repay them with something very, very special─an echevore tail, to be precise!"},{"name":"UINNEE","text":"Have you ever seen an echevore tail? You can smell them or sip from them, and they have the taste and aroma of sweet, sweet honey! A bit <span class=\"emphasis\">too</span> sweet for my liking, to tell the truth, but the Nu Mou just can't seem to get enough of them."},{"name":"UINNEE","text":"But there's a bit of a rub. The sweetest of the sweet echevores can only be found distressingly close to the stamping grounds of those oh-so-nasty Fuath. Just imagining being gripped in those slimy, slippery, slobbery hands makes me─ick! Why did you make me think such unpleasant thoughts!?"},{"name":"UINNEE","text":"Hmph! As penance, I demand that you go forth and fetch the echevore tail that I seek! And if you see any Fuath along the way, feel free to smack them in their smarmy faces with those stupid little hats of theirs!"},{"name":"UINNEE","text":"&lt;sniff&gt; Is that sweet, sweet honey I smell? I knew you wouldn't come back empty-handed! Well, hand it over then, already!"},{"name":"UINNEE","text":"Why, I say, this is the sweetest aroma I've ever had the pleasure of smelling! Perhaps those Nu Mou <span class=\"emphasis\">do</span> know what they're talking about. Perhaps they won't mind if I take just a teeny-tiny smidgen..."},{"name":"UINNEE","text":"Ahem! Which is to say, of <span class=\"emphasis\">course</span> I'm not thinking of taking a sip! We pixies have <span class=\"emphasis\">far</span> more refined palates than those silly Nu Mou. We're not ones to sit around all day sucking on these icky tails!"},{"name":"UINNEE","text":"At any rate, thank you as always for being so subser─er, helpful! So helpful! Please come back again soon! Now, just a tiny little... Hmm? You're still here?"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}