{"quest":{"name":"Sharing Is Caring","location":"Il Mheg","id":69227,"patch":5.1,"sort":9,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee requires a new source of amusement.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “snae ling” to charm the covetous pixie.","Speak with Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Oh, how I tire of these same old toys of mine! If only I had something <span class=\"emphasis\">new</span> and <span class=\"emphasis\">exciting</span> to play with, oh, the wondrous dreams I could spin!"},{"name":"UINNEE","text":"How about those precious little treasures that those most vexing pixies over by the Bookman's Shelves have found? The ones they had the nerve to hoard all for themselves! Hmph!"},{"name":"UINNEE","text":"What sort of trinkets are they, you ask? How am I supposed to know? They won't so much as let me see them! But hmm...yes. Yes, indeed... Maybe if <span class=\"emphasis\">you</span>, my favorite mortal, were to ask nicely─with a pretty, pretty please─they just might oblige! Yes, I do believe they might!"},{"name":"UINNEE","text":"You speak our tongue quite well, yes? All you need to do is tell them how [jumpingly cute] they are, and I'm sure they'll be singing a different tune in no time at all. Then once you have their treasures, you just trot them back here to me. Then everyone's happy, yes?"},{"name":"COLLECTORPIXIE","text":"Well, well! If it isn't Uin Nee's favorite mortal! <span class=\"highlight\">Forename</span>, was it? Whatever brings you to... Wait, <span class=\"emphasis\">I</span> know what this is!"},{"name":"COLLECTORPIXIE","text":"If Uin Nee has sent you to get your hands on our treasures, well, then they can just flutter off whence they came! <span class=\"emphasis\">We</span> found these, and that means <span class=\"emphasis\">we'll</span> be keeping them, thank you very much!"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter any phrase that contains the words “snae ling” to earn the favor of the covetous pixie."},{"name":"COLLECTORPIXIE","text":"Why, of all the─! <span class=\"highlight\">Forename</span>, you're making me blush!"},{"name":"COLLECTORPIXIE","text":"Still, if you think that just because you're the hero who brought back the night, that you can just saunter in and charm us into sharing our treasures with you, then...come to think of it, you're right!"},{"name":"COLLECTORPIXIE","text":"After all, why keep our precious possessions all for ourselves when they could be spun into dreams and bring joy to all the children in the realm. Oh, what a lovely thought that is! Just promise me you'll take care of it, yes?"},{"name":"UINNEE","text":"Oh! My favorite mortal is back! And what's that in your hands? Could it be!? Yes, yes, you must show me at once!"},{"name":"UINNEE","text":"What a lovely collection of insect wings! A brilliant wing that shines with all the colors of the rainbow, a fluffy wing covered with flaxen hair! Why, these would make beautiful hair ornaments for me and my friends!"},{"name":"UINNEE","text":"Why, what a lovely bouquet! I don't believe I've ever seen blooms quite like these before. I would make a crown of flowers to adorn the heads of the dear children in dreams of pure blossoming bliss!"},{"name":"UINNEE","text":"A collection of stones...and just look at how round they are! Come to think of it, they resemble the eyes of those pesky, nasty Fuath. Perhaps I will simply throw them as far as─oh, but I mustn't waste them so. I will polish them into a charming set of marbles for the children!"},{"name":"UINNEE","text":"Those greedy little pixies were most smitten when you told them how [jumpingly cute] they were, were they not? I thought they might be! You know, you <span class=\"emphasis\">could</span> tell me the same from time to time if you'd like. Tee hee!"},{"name":"UINNEE","text":"But where was I? Oh, yes. I'm sure that they'll be all too quick to hoard and hide away the next shiny little thing they get their hands on, so I do hope you're ready to charm them again for me. Farewell for now, my favorite mortal!"},{"name":"SAYTODO","text":"snae ling"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}