{"quest":{"name":"Where There's Wool, There's a Way","location":"Il Mheg","id":69225,"patch":5.1,"sort":7,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee would see the Woolen Way returned to its former glory.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Collect balls of fleecy wool near Lydha Lran.","Deliver the balls of fleecy wool to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Oh, once it was so fluffy and floofy and poofy, and now it's so...<span class=\"emphasis\">not</span>! Whatever is this world coming to?"},{"name":"UINNEE","text":"I speak, of course, of the Woolen Way! Wasn't that <span class=\"emphasis\">obvious</span>? Do try to keep up, dear mortal. Anyhow, the Woolen Way lies just north of here. Once upon a time, it was a grand road whereby mortals would transport giant balls of fleecy wool to and fro, fro and to. Doesn't that sound positively lovely?"},{"name":"UINNEE","text":"Of course it does! That's why I've a mind to spin a dream of a road so soft and fleecy you'd think it was made from the wool of a thousand sheeps! Er, flocks...of sheeps? Anyhow, to do that I'll need a big ball of wool. Actually, <span class=\"emphasis\">three</span> big balls of wool! You'll be a dear and fetch them for me, yes?"},{"name":"UINNEE","text":"Well? I can't wait forever for my wool, you know. I've dreams to spin and places to be!"},{"name":"UINNEE","text":"Why, just look at how large and fluffy this one is! And this one even more! You've truly outdone yourself, dear mortal. With this, I can spin the wooliest way my dreamers have ever dreamed!"},{"name":"UINNEE","text":"Nu Mou legend has it that in the days when mortals lived in these parts, great wagons went up and down the Woolen Way, each packed to the brim with the fluffiest of fleeces to be carried to market."},{"name":"UINNEE","text":"These days─alas!─only the name remains. &lt;sniff&gt; Is that not the saddest story you've ever heard? But no matter, for we shall spin a <span class=\"emphasis\">new</span> Woolen Way in the dreams of the children─and one even more glorious than ever before!"},{"name":"UINNEE","text":"Why, I can just picture them bouncing up and down on a road of fleece and fluff like a giant cloud! Wouldn't you like to join them? But watch out─it will be so dreamy and delightful you just might never want to wake up! Tee hee!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}