{"quest":{"name":"The Heart's Oasis","location":"Il Mheg","id":69221,"patch":5.1,"sort":3,"icon":100953,"beast":12,"unlocksFunction":1,"eventIcon":71341,"issuer":1031806,"target":1031806,"genre":56,"journal":["Tyr Beq is ready to take the next step with you.<br>※The difficulty of this quest will be synced to your current level.","You can't blame a pixie for trying, and try Tyr Beq does to woo you into living with them in Lyhe Mheg. Having experienced no joy, they head into Lyhe Mheg to arrange a meeting with the little boy whose nightmare you vanquished in Wright, and you and Ezel follow after them.<br><br>※You may enter Lyhe Mheg by speaking with Thon Sul in Lydha Lran.<br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Inside Lyhe Mheg, you meet with the boy, who happily reports that he is no longer plagued by nightmares.","Satisfied that the dreams of Kholusia are secure, Tyr Beq suggests next investigating nightmares in Amh Araeng. Based on Ezel's preliminary sniffing, the smell appears to be concentrated in the settlement of Mord Souq, and thither do you make your way.","Arriving in scorching, sand-scoured Mord Souq, you begin your search for a child locked in an unnatural slumber.","Your search brings you to a little boy tossing and turning in his sleep, the absence of a scent marking him as the source. His father hints at a tragedy that befell his daughter, but he is reluctant to talk about the incident in detail. When the man departs on an errand, Ezel proceeds to devour the boy's nightmare, prompting An Lad to appear once more. The pixie sternly warns you against further interference before leaving you with more cryptic words. Ezel then flies off to find a suitable place to be sick and you hurry after, ready to strike down the nightmare given form.","Like the ones before, this nightmare creature falls by your hand, and you turn to your delighted companions.","Having received your due praise, you head back to Mord Souq to look in on the little boy.","Finally awakening, the boy looks at you as if still seeing a dream. It is revealed that he had been tormented by the death of his little sister, who had succumbed to thirst in the desert. Your victory over his nightmare has allowed him to find peace, but as he leaves, you are surprised to hear him give thanks to a pale pixie. Ironically, it appears that it was the existence of the nightmare itself, planted by An Lad, that brought him hope. Given yet more to ponder, you turn your steps back to Lyhe Mheg.","Arriving back in Lyhe Mheg, you waste no time lifting the seal over the gate to Amh Araeng, thereby reclaiming the dreams of another region.","Satisfied with your steady progress, Tyr Beq heads back outside to Lydha Lran and bids you join them when you are ready.","Talking about An Lad, Tyr Beq tells you that they can't help but feel as if they know them. Though they fall short of saying it, they seem to believe that the pale pixie may be a reincarnation of their departed best friend, whom they reveal later became the previous Titania. While uncertainty remains over An Lad's identity, for now Tyr Beq decides to focus on doing something fun and productive, namely filling Amh Araeng with happy dreams."],"objectives":["Speak with the Wright boy in Lyhe Mheg.","Speak with Ezel II.","Speak with Tyr Beq in Mord Souq.","Find a child suffering from a nightmare.","Vanquish the nightmare creature.","Speak with Tyr Beq.","Speak with the Mord Souq boy.","Speak with Tyr Beq in Lyhe Mheg.","Speak with Tyr Beq again.","Speak with Tyr Beq in Lydha Lran."],"dialogue":[{"name":"TYRBEQ","text":"You know, <span class=\"highlight\">Forename</span>, we've known each other for a while now. I was thinking, perhaps it's time we started living together. I could build us a lovely house in Lyhe Mheg, fill it with whatever your heart desires... What do you say?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A certain faerie king won't be pleased."},{"name":"A1","text":"Thanks, but no thanks."},{"name":"A1","text":"Yes, let's live together!"},{"name":"TYRBEQ","text":"O-Of course! Titania! Y-You didn't think I'd forget about them, did you?"},{"name":"TYRBEQ","text":"It was just a jest! Yes, a jest! I-I'd <span class=\"emphasis\">never</span> dream of taking you from our king, whose beauty is equaled only by their benevolence... &lt;gulp&gt;"},{"name":"TYRBEQ","text":"Awww, you're as hard to win over as they say. And there I was actually being a little bit serious..."},{"name":"TYRBEQ","text":"Well, if you have a change of heart, do let me know. At your word, I'll make Lyhe Mheg your forever and ever home.<br>...Tee hee, I jest, I jest!"},{"name":"TYRBEQ","text":"T-Truly? Huzzah, huzzah! Come, let's begin living together at once! I'll make Lyhe Mheg your forever and ever home!"},{"name":"TYRBEQ","text":"Uwaaah!"},{"name":"TYRBEQ","text":"...A-Actually, it was just a jest. Yes, a jest. I'd <span class=\"emphasis\">never</span> dream of taking you from our king, whose beauty is equaled only by their benevolence... &lt;gulp&gt;"},{"name":"EZELII","text":"So, Tyr Beq, I've been wondering how the boy in Wright is faring. Is there any chance we might meet him in Lyhe Mheg?"},{"name":"TYRBEQ","text":"If you're worried about him, sure, I can check if he's asleep and bring him to us."},{"name":"TYRBEQ","text":"You're coming along, of course, <span class=\"highlight\">Forename</span>?"},{"name":"WRIGHTBOY03685","text":"Ah! You're the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> from before!"},{"name":"WRIGHTBOY03685","text":"After you left, everyone in the village brought me lots of tasty things. I ate so much, I felt like I was going to burst!"},{"name":"EZELII","text":"We're pleased to hear that! Now, I take it you are no longer plagued by nightmares?"},{"name":"WRIGHTBOY03685","text":"Not at all! I only have fun dreams now, like this one. It makes me not want to wake up again!"},{"name":"TYRBEQ","text":"Truly? If that's what you want, it <span class=\"emphasis\">can</span> be arranged."},{"name":"WRIGHTBOY03685","text":"Uhhh, I-I have some chores to do, so I better wake up now. So long!"},{"name":"TYRBEQ","text":"It's done! I've merged the boy's dream with Lyhe Mheg!"},{"name":"EZELII","text":"The lad looks well!"},{"name":"EZELII","text":"Let that be a reminder that pixies aren't to be trusted... &lt;snort&gt;"},{"name":"TYRBEQ","text":"Oh, come now, it was just a jest! I prefer my mortals alive and happy, I'll have you know. Dead and unhappy ones don't give us fun dreams to harvest."},{"name":"TYRBEQ","text":"But enough about that─we still have nightmares to vanquish. What do you say we investigate Amh Araeng next?"},{"name":"EZELII","text":"Sounds good to me. Based on my preliminary sniffing, the stench of nightmares is concentrated in Mord Souq. Can you tell us what manner of dreams are common there?"},{"name":"TYRBEQ","text":"Hmmm... As I recall, most dreams are to do with water. Folk going thirsty, searching for a water hole─that sort of thing."},{"name":"EZELII","text":"So their need is simply for safety and survival. It stands to reason, given that the region is an inhospitable desert. Without further ado, then, let us make for Mord Souq and search for the source of the nightmares!"},{"name":"TYRBEQ","text":"What? Did I say something strange?"},{"name":"TYRBEQ","text":"Ugh, what a dull and dusty place... There isn't a single pretty flower around, nor anything that looks tasty."},{"name":"TYRBEQ","text":"Instead, I see these revolting worms everywhere...and people <span class=\"emphasis\">eat</span> them! Yech, just thinking about it makes my stomach turn..."},{"name":"EZELII","text":"Well, to each their own, and to me they look quite palatable. I can imagine them bursting in one's mouth, releasing the slimy goodness within... &lt;slurp&gt; Perhaps I shall take some back with me..."},{"name":"TYRBEQ","text":"Oh, don't even think about bringing them to Lyhe Mheg! I will <span class=\"emphasis\">murder</span> you!"},{"name":"EZELII","text":"Hmph, I prefer nightmares at any rate. Speaking of which, we should get to work. As before, we are looking for a slumbering child. I doubt there'll be too many of them in such a bustling marketplace."},{"name":"TYRBEQ","text":"How can you be sure the child will be sleeping?"},{"name":"EZELII","text":"An Lad's nightmares induce an unnatural drowsiness. Those affected cannot easily resist it."},{"name":"EZELII","text":"&lt;sniff&gt; &lt;sniff&gt; This entire town... It smells so ripe, so <span class=\"emphasis\">tantalizing</span>!"},{"name":"MORDBOY03685","text":"Enile... Please forgive me... &lt;sob&gt;"},{"name":"HAWKER03685","text":"Oh, don't worry about the boy. He's bone tired, is all. Hasn't been getting much sleep of late, on account of the nightmares."},{"name":"HAWKER03685","text":"Is there something you need?"},{"name":"HAWKER03685","text":"Investigating nightmares, you say? Well, it's no secret why my son has them. We were traveling through the desert when his sister... "},{"name":"HAWKER03685","text":"I'm sorry. It's still too fresh. Now, if you'll excuse me, I've got some errands to run. Don't worry about the boy. He's safe enough sleeping there."},{"name":"HAWKER03685","text":"Just─if you plan on heading outside, be sure you carry plenty of water, all right?"},{"name":"HAWKER03685","text":"Out there, it's a matter of life and death..."},{"name":"EZELII","text":"The boy is plainly in the grip of a nightmare, yet he gives off no scent. He's the source, and no mistake!"},{"name":"TYRBEQ","text":"Right then, let's tend to business before his father returns. Have at it, Ezel!"},{"name":"EZELII","text":"With pleasure! &lt;slurp&gt;"},{"name":"ANLAD","text":"Don't interfere anymore. I'm warning you."},{"name":"TYRBEQ","text":"Oh, will you stop doing that!"},{"name":"ANLAD","text":"The child and I, we created a watery friend together. If you give it form, you will get hurt...or worse. "},{"name":"TYRBEQ","text":"Hmph, your ugly nightmares are no match for us! We'll take care of this one like we did the others!"},{"name":"EZELII","text":"Unnngh... It feels like a storm is raging in my belly..."},{"name":"ANLAD","text":"Why? Why must you torment me? I only want to fill this hole in my heart. A hole where a friend used to be. Alone inside that cramped old castle, how I longed to see them..."},{"name":"TYRBEQ","text":"Now, wait just a─!"},{"name":"EZELII","text":"This absolutely can't wait! I-I'm─<span class=\"emphasis\">hurk</span>─going to be sick!"},{"name":"EZELII","text":"Phew... Thank goodness it didn't come back up inside the village..."},{"name":"TYRBEQ","text":"All right, <span class=\"highlight\">Forename</span>! Same as always!"},{"name":"TYRBEQ","text":"So frustrating not being able to interact with dreams directly..."},{"name":"EZELII","text":"Not a smell on this child! He is our source, I'm certain of it!"},{"name":"HAWKER03685","text":"Me? I'm a flower vendor. I get blooms from the Crystarium and travel around selling them with my son. I'd ask if you were interested, but something tells me they're not uncommon where you're from."},{"name":"POP","text":"The nightmare creature attacks!"},{"name":"TYRBEQ","text":"Oh, seriously! Why do they always have to look so hideous!?"},{"name":"EZELII","text":"The worms in town looked palatable. This...does not."},{"name":"MORDBOY03685","text":"Leave me alone, monster... Go away..."},{"name":"TYRBEQ","text":"You did it! You did it!"},{"name":"EZELII","text":"Dependable as ever, <span class=\"highlight\">Forename</span>!"},{"name":"EZELII","text":"Come, let's hurry back to Mord Souq and look in on the child. We'll leave the talking to you."},{"name":"EZELII","text":"As far as storms in bellies go, I'd say that one was quite stormy..."},{"name":"MORDBOY03685","text":"...Huh? Y-You... Weren't you just...?"},{"name":"HAWKER03685","text":"Oh, still here, are you?"},{"name":"HAWKER03685","text":"Do you know this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, son?"},{"name":"MORDBOY03685","text":"I-I suppose? Don't laugh, but...I think I met <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> in a dream."},{"name":"HAWKER03685","text":"In a dream! Well now, isn't that amazing!"},{"name":"MORDBOY03685","text":"I-I said don't laugh!"},{"name":"HAWKER03685","text":"Sorry, sorry. It's just...I don't remember when you were last so lively. But tell me, what kind of dream was it?"},{"name":"MORDBOY03685","text":"Enile... I saw Enile..."},{"name":"HAWKER03685","text":"The same one, then. I'm sorry I wasn't here. It must have been hard..."},{"name":"MORDBOY03685","text":"No, it was different this time. This <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> appeared and trounced the water monster!"},{"name":"MORDBOY03685","text":"But that's not all. At the place where the monster fell, flowers began to bloom. They reminded me of the promise I made to Enile. The promise that, one day, I'd fill Amh Araeng with flowers."},{"name":"HAWKER03685","text":"I see... One day, son. One day we'll make your sister's wish come true. Mark my words."},{"name":"MORDBOY03685","text":"Well, we have to go now. But whoever you are, I hope to see you again."},{"name":"MORDBOY03685","text":"Thank you, pale pixie. For helping me to remember."},{"name":"EZELII","text":"The boy is well again! Another job well done!"},{"name":"TYRBEQ","text":"But...he was thanking An Lad. Why do you suppose...?"},{"name":"EZELII","text":"As I understand it, his little sister died of thirst in the desert. Latching onto this ordeal, An Lad had planted a nightmare in the form of that water monster."},{"name":"EZELII","text":"And though we were the ones who helped him to conquer the nightmare, ironically, it was its very existence that brought him hope."},{"name":"TYRBEQ","text":"The nightmare...brought him hope?"},{"name":"EZELII","text":"It's certainly something to chew on. But for now, let us return to Lyhe Mheg. Another gate awaits!"},{"name":"TYRBEQ","text":"..."},{"name":"EZELII","text":"Tyr Beq, are you all right? You haven't uttered a word since we returned."},{"name":"TYRBEQ","text":"...Hm? Oh! S-Sorry, I was deep in thought. That's not very pixie-like at all, is it?"},{"name":"TYRBEQ","text":"Go ahead, <span class=\"highlight\">Forename</span>! You know what to do!"},{"name":"SYSTEM","text":"By freeing the little boy in Mord Souq from his nightmares, you and yours have reclaimed the dreams of those in Amh Araeng."},{"name":"SYSTEM","text":"Tyr Beq appears eager to further beautify Lyhe Mheg, and for this they require your aid..."},{"name":"EZELII","text":"'Tis time to throw wide the gates to Amh Araeng!"},{"name":"TYRBEQ","text":"And that's that! We'll go on ahead back to Lydha Lran. Come and see us when you're ready, all right?"},{"name":"EZELII","text":"More dream bubbles! I look forward to seeing what fantastical shapes they will assume!"},{"name":"TYRBEQ","text":"Thanks to you, we've reclaimed the dreams of yet another region. I'm really, truly grateful, <span class=\"highlight\">Forename</span>."},{"name":"TYRBEQ","text":"Now, about An Lad... It's strange, but I can't help but feel as if I know them."},{"name":"TYRBEQ","text":"As you know, I built Lyhe Mheg together with my departed best friend. But maybe─just maybe─that friend has..."},{"name":"TYRBEQ","text":"...No. No, it couldn't be them. I'm being silly. You set Titania free, <span class=\"highlight\">Forename</span>. Everyone knows that."},{"name":"EZELII","text":"W-Wait! Do you mean to say that your friend was the previous Titania!?"},{"name":"TYRBEQ","text":"Back then, they weren't Titania yet. They were simply a kind-hearted pixie who saw fit to befriend me, eccentric as I am. Together we built Lyhe Mheg. Together we had the finest fun."},{"name":"TYRBEQ","text":"They're very dear to me. That's why, no matter what, I want to protect our garden. Like they protected all of us from the sin eaters."},{"name":"EZELII","text":"I see. Close as you were, it isn't implausible that you would sense your friend in another form. And the dream of being alone in a castle is suggestive indeed..."},{"name":"EZELII","text":"Be that as it may, I do not see how An Lad could be the reincarnation of your friend. After all, pixies are born of the souls of children. But wait... Could it be the aether that is gathered...?"},{"name":"TYRBEQ","text":"You know, never mind! I'm sure I'm just being sentimental and silly."},{"name":"TYRBEQ","text":"As I said, it's not pixie-like to overthink things. Let's do something fun and productive instead─like filling Amh Araeng with happy dreams!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Respected</span> reputation with the Dreamspinners."},{"name":"SYSTEM","text":"New pixie tribal daily quests are now available from Uin Nee in Lydha Lran."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Uin Nee as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Uin Nee. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Jul Oul."},{"name":"SYSTEM","text":"In order to undertake the next tribal main quest, you must first complete the main scenario quest “Out of the Wood.”"}],"reward":{"gil":1964},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":34}],"quests":[69220]},"next":[69222]},"partials":[{"type":"npc","id":"1031806","obj":{"i":1031806,"n":"Tyr Beq","l":2956,"q":6}},{"type":"quest","id":"69220","obj":{"i":69220,"n":"Sustenance for the Soul","g":56,"l":"Il Mheg","s":2,"f":1}},{"type":"quest","id":"69222","obj":{"i":69222,"n":"A Cry from the Ashes","g":56,"l":"Il Mheg","s":4,"f":1}}]}