{"quest":{"name":"Forever and a Dream","location":"Il Mheg","id":69224,"patch":5.1,"sort":6,"icon":100956,"beast":12,"unlocksFunction":1,"eventIcon":71341,"issuer":1031806,"target":1031806,"genre":56,"journal":["Tyr Beq has gratitude written all over their face.<br>※The difficulty of this quest will be synced to your current level.","Thanking you for making dreams more fun than they've ever been, Tyr Beq mentions that An Lad has been wanting to see you. If you can spare a moment, they invite you to accompany them to meet the pale pixie inside Lyhe Mheg.<br><br>※You may enter Lyhe Mheg by speaking with Thon Sul in Lydha Lran.<br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","In their turn, An Lad expresses their gratitude for helping them to find a purpose for their existence. Though they no longer see Titania's dreams, the will of the departed monarch lives on in them, and they intend to honor it by watching over Lyhe Mheg. You then take your leave, safe in the knowledge that the Garden of Dreams is in good hands.","Back outside in Lydha Lran, Tyr Beq muses on the connection that pixies and mortals share in dreams before bidding you farewell for now. Together with their fellow Dreamspinners, Tyr Beq will continue working to make dreams fun and beautiful, and suffice it to say your help shall ever be welcome in their endeavor."],"objectives":["Speak with An Lad in Lyhe Mheg.","Speak with Tyr Beq in Lydha Lran."],"dialogue":[{"name":"TYRBEQ","text":"Oh, <span class=\"highlight\">Forename</span>, how nice of you to visit! Thanks to you, we're having more fun in dreams than we've ever had. We're really, truly grateful─us pixies and the children both!"},{"name":"TYRBEQ","text":"When we first created Lyhe Mheg, I never dreamed that it could become such a beautiful place. Everything in it is a treasure, and I couldn't be prouder of what we have!"},{"name":"EZELII","text":"And lest you wonder, I continue to fight the good fight, devouring nightmares across the realm, including those An Lad accidentally creates."},{"name":"TYRBEQ","text":"Ah, speaking of An Lad, they've been wanting to speak with you, <span class=\"highlight\">Forename</span>. If you have a moment, let's go and see them in Lyhe Mheg together."},{"name":"EZELII","text":"I'll join you! &lt;snort&gt;"},{"name":"ANLAD","text":"Oh! You're all here!"},{"name":"TYRBEQ","text":"An Lad, I'd swear you haven't budged from this spot since I last saw you. Have you been gazing out at Lyhe Mheg again?"},{"name":"ANLAD","text":"I have... It's hard to explain, but simply gazing out at the place makes my heart sing. It's a feeling I remember from another life."},{"name":"ANLAD","text":"<span class=\"highlight\">Forename</span>? There's something I've been wanting to tell you."},{"name":"ANLAD","text":"You helped me to fill the void in my heart. To find a purpose for my existence. For that, I'm eternally grateful."},{"name":"ANLAD","text":"Though I've stopped seeing Titania's dreams, their will lives on in me. And I'll honor it, by watching over Lyhe Mheg."},{"name":"TYRBEQ","text":"Born of the souls of children as we are, we pixies tend to get caught up in the moment and our feelings. We need someone to watch out for us, to find us when we lose ourselves. That's to say, we're not meant to be alone. And from now on, we'll see to it none of us is alone ever again."},{"name":"TYRBEQ","text":"<span class=\"highlight\">Forename</span>. I know I've already thanked you a dozen times, but I want to thank you again. You didn't only free my friend─you freed their will as well. And now, everyone may revel in their precious Garden of Dreams as they had intended. Mortals and pixies alike."},{"name":"TYRBEQ","text":"I also want to say...I'm absolutely green with envy! It's so unfair that the king has you all to themself!"},{"name":"EZELII","text":"I must admit I'm envious too. Would that the king would share <span class=\"highlight\">Forename</span> with us... &lt;snort&gt;"},{"name":"ANLAD","text":"Yes, even a little piece of <span class=\"highlight\">Forename</span> would be nice..."},{"name":"FEOUL","text":"(-Feo Ul-)Oh, good grief, when will everybody learn!? This mortal is mine, do you hear me!? Mine, mine, <span class=\"emphasis\">mine</span>!"},{"name":"TYRBEQ","text":"&lt;gulp&gt; ...O-On second thought, it's more than plenty that you visit from time to time."},{"name":"ANLAD","text":"Yes, please come and see me again."},{"name":"EZELII","text":"Me as well! &lt;snort&gt;"},{"name":"TYRBEQ","text":"Well, I should get back to my tasks. An Lad─I could use some help. Do you want to come with me to see Uin Nee?"},{"name":"TYRBEQ","text":"Take as much time here as you like, <span class=\"highlight\">Forename</span>. We'll be waiting outside when you've had your fill."},{"name":"TYRBEQ","text":"I must say, it saddens me that I can't be your branch. But whenever you're feeling weary, know that I'll always be ready with an invigorating dream for you."},{"name":"TYRBEQ","text":"Tell me, <span class=\"highlight\">Forename</span>. Before you met us, did you ever imagine that mortals and pixies shared such a connection? How do you think people would react if they learned that we're spinning their fun-filled dreams?"},{"name":"EZELII","text":"And devouring their nightmares!"},{"name":"ANLAD","text":"Well then, if people still have nightmares, then they would know who's to blame."},{"name":"EZELII","text":"There's only so much one porxie can do, you know. If necessary, perhaps I shall ask my master to make more of me... &lt;snort&gt;"},{"name":"TYRBEQ","text":"Well, I shouldn't keep you any longer. Brief though it was, it's truly been a joy adventuring with you, <span class=\"highlight\">Forename</span>."},{"name":"TYRBEQ","text":"But whenever you can spare the time, I hope that you'll visit us. After all, we can never have enough help making dreams fun and beautiful!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Bloodsworn</span> reputation with the Dreamspinners."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon completion of the pixie tribal daily quests."}],"reward":{"gil":642},"reqs":{"beastrank":7,"jobs":[{"lvl":70,"id":34}],"quests":[69223]}},"partials":[{"type":"npc","id":"1031806","obj":{"i":1031806,"n":"Tyr Beq","l":2956,"q":6}},{"type":"quest","id":"69223","obj":{"i":69223,"n":"As the Heart Bids","g":56,"l":"Il Mheg","s":5,"f":1}}]}