{"quest":{"name":"A Cry from the Ashes","location":"Il Mheg","id":69222,"patch":5.1,"sort":4,"icon":100954,"beast":12,"unlocksFunction":1,"eventIcon":71341,"issuer":1031806,"target":1031806,"genre":56,"journal":["Tyr Beq appears to be uncharacteristically deep in thought.<br>※The difficulty of this quest will be synced to your current level.","Tyr Beq continues to be troubled by the possibility that An Lad might be the reincarnation of the previous Titania─and their friend. Assuming this is true, then the pale pixie carries the fallen faerie king's torment as if it were their own. Desiring to help An Lad, Tyr Beq heads into Lyhe Mheg to meet with the little boy you aided in Mord Souq, that you might learn what came to pass in his dream.<br><br>※You may enter Lyhe Mheg by speaking with Thon Sul in Lydha Lran.<br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You arrive in Lyhe Mheg to find the boy, who reveals that he briefly spoke with An Lad in his dream and tried to befriend them. Though the pixie's attempt to create water resulted in a nightmare, he is grateful nonetheless, for it served to remind him of his promise to his sister. Having recounted to you these events, the child returns to the waking world.","Though An Lad's plight still weighs heavily on Tyr Beq, for now they set them aside in their mind in favor of investigating the next region: the Rak'tika Greatwood. According to Ezel, the nightmares are concentrated in Slitherbough, and you set forth for the forest settlement.","You join your companions in the Rak'tika Greatwood, and split up to find a slumbering child.","After a brief search, you come upon a little girl in the midst of a nightmare, and Ezel confirms that she is the source. However, she rouses before you can tend to her, and in distressed tones, reveals snippets of her past. It would seem a fire killed animals she considered her friends, a tragedy that gave rise to a fervent desire for approval. Comforted by Tyr Beq, she resumes her slumber, affording Ezel a chance to devour the nightmare. It is then that An Lad chooses to appear, but they do not linger long─and neither does Ezel, who rushes off to regurgitate the nightmare. You and Tyr Beq hasten after the familiar, ready to put your respective skills to use.","At the end of the fiery encounter, you triumph over yet another nightmare creature.","Following a quick word, you and your companions head back to Slitherbough, where you left the little girl slumbering.","You return to find the little girl not only awake but also aware of your intervention in her dream. She reveals that she has prophetic dreams, and foresaw the sin eater attack at Fort Gohn two years ago, but her warnings were ignored on account of her being a child. Made to feel powerless, she has since dedicated herself to becoming a respected priestess. Alas, the fear of failure always hounded her, and the recent onset of nightmares caused her to feel powerless all over again. She had just about given up hope when you vanquished the nightmare, thereby helping her be at peace with herself. Giving you her thanks, she takes her leave to resume her training with newfound positivity. Your mission in Rak'tika accomplished, you make your way back to Lyhe Mheg to open the fourth gate.","As has become routine, you successfully lift the seal over the fourth gate, thus reclaiming the dreams of the Rak'tika Greatwood.","Only one gate remains, but to your surprise, Tyr Beq doesn't know where it leads. At that moment, An Lad reappears and engages in another round of cryptic brooding. Tyr Beq makes an effort to reach out to them, only to be struck by a mysterious spell and subsequently spurned. An Lad then vanishes, and Ezel suggests that you return to Lydha Lran for the time being.","Ezel posits that, had Tyr Beq shared An Lad's needs, the spell would have made them into the source for another nightmare. Though the situation grows more complicated, for now you decide to focus on the task before you─filling the Rak'tika Greatwood with fun and happy dreams."],"objectives":["Speak with the Mord Souq boy in Lyhe Mheg.","Speak with Tyr Beq in Lyhe Mheg.","Speak with Tyr Beq in Slitherbough.","Find a child suffering from nightmares.","Defeat the nightmare creature.","Speak with Tyr Beq.","Speak with the Slitherbough girl.","Speak with Tyr Beq in Lyhe Mheg.","Speak with Tyr Beq again.","Speak with Tyr Beq in Lydha Lran."],"dialogue":[{"name":"TYRBEQ","text":"Ah, <span class=\"highlight\">Forename</span>! I've been thinking... Yes, yes, I know, I said that I wouldn't overthink things."},{"name":"EZELII","text":"&lt;snort&gt; You are still troubled by the possibility that An Lad was born of Titania's aether?"},{"name":"TYRBEQ","text":"Hmmm, I don't know how you see such things, but to us pixies, taking on the aether of another doesn't make you that person. You're simply another pixie."},{"name":"EZELII","text":"Such a view is certainly in keeping with what is known of pixies─that you aren't empathetic by nature. Yet I thought you would have more of an attachment to your friend, at least."},{"name":"TYRBEQ","text":"Well, the simple fact is, a pixie is a pixie. It doesn't matter whose soul they came from, or that they inherited someone's dreams. Having said that, if that someone was my friend, I feel as though I want to...I don't know. Understand them, I suppose?"},{"name":"TYRBEQ","text":"What's more, when Titania's consciousness leaked out of the castle, we all felt their torment as if it were our own."},{"name":"TYRBEQ","text":"If An Lad was indeed born of their aether, then that torment is <span class=\"emphasis\">literally</span> their own. And I can't help but feel sorry for them."},{"name":"TYRBEQ","text":"Before they became the king, my friend wasn't so different to the rest of us. Just loved a little more by nature, is all. Deep down, I don't think that An Lad is so different either."},{"name":"TYRBEQ","text":"There must be something we can do to help them. And to begin with, I want to ask that boy in Mord Souq a few questions. Come, let's go to Lyhe Mheg!"},{"name":"MORDBOY03685","text":"Oh, it's so good to see you again! Isn't the pale pixie with you today? The poor, lonely one?"},{"name":"TYRBEQ","text":"You mean An Lad... Did you speak with them?"},{"name":"MORDBOY03685","text":"Just a little, in my dream. There was something about them─something that reminded me of my sister."},{"name":"MORDBOY03685","text":"I found them crying alone in a cold and empty place. I felt sorry for them and said that I'd be their friend."},{"name":"EZELII","text":"And then what happened?"},{"name":"MORDBOY03685","text":"I don't remember clearly, but they tried to create water for my sister. Only they were really clumsy, and made the water into a monster instead."},{"name":"TYRBEQ","text":"Wait, that nightmare wasn't even meant to be a nightmare?"},{"name":"MORDBOY03685","text":"Right. Everything turned into a mess in the dream, but I'm grateful to An Lad. They gave me the chance to face my fears...and helped me to remember my promise to my sister."},{"name":"MORDBOY03685","text":"Uh oh, it's time to get up... I have to go now, but you can call me again any time!"},{"name":"TYRBEQ","text":"This boy thanked An Lad, as you'll recall. I want to ask him what happened exactly."},{"name":"EZELII","text":"To be able to speak with people as they sleep... It's a convenient power, I must admit."},{"name":"TYRBEQ","text":"&lt;sigh&gt; The more I learn about An Lad, the more I feel sorry for them..."},{"name":"EZELII","text":"By the intensity of your concern, one would be forgiven for thinking you were a mortal. Perhaps it's due to the time you have spent rollicking in their dreams, and more recently, the company you've been keeping."},{"name":"TYRBEQ","text":"What? You think <span class=\"highlight\">Forename</span> is rubbing off on me?<br>...Ack, I don't care about all that right now!"},{"name":"TYRBEQ","text":"We have another region to reclaim─the Rak'tika Greatwood. As I recall, many there have dreams about wanting to be useful to others, and to have others regard them well."},{"name":"EZELII","text":"I see. I believe my master referred to this as the need for self-esteem. In any case, you'll be pleased to know I've already sniffed out where the nightmares are concentrated. Let us make for Slitherbough!"},{"name":"EZELII","text":"An Lad tried to create water in their dreams, only to make that nightmare? I can't well imagine the darkness they carry with them."},{"name":"TYRBEQ","text":"I don't like it here... I feel as if someone─or something─is watching me..."},{"name":"EZELII","text":"These woods are ancient. I would not be surprised if the spirits of eld still abided here."},{"name":"EZELII","text":"Let us be quick about our task. As before, we seek a slumbering child."},{"name":"TYRBEQ","text":"Right, Ezel and I will search the south. <span class=\"highlight\">Forename</span>, we leave the east to you."},{"name":"EZELII","text":"&lt;sniff&gt; &lt;sniff&gt; The stench of nightmares hangs heavy in the air. The source is bound to be near!"},{"name":"SLITHERBOUGHGIRL03686","text":"Please... You have to believe me... &lt;sob&gt;"},{"name":"EZELII","text":"Ah, there's our source!"},{"name":"TYRBEQ","text":"Quiet! She's stirring!"},{"name":"SLITHERBOUGHGIRL03686","text":"A flying pig...and a pixie? Am I still dreaming?"},{"name":"TYRBEQ","text":"Wait, you can see me!?"},{"name":"EZELII","text":"The denizens of Slitherbough are magically gifted, and as a child, she would possess a natural affinity to pixies. It's not a wonder that she can see you."},{"name":"SLITHERBOUGHGIRL03686","text":"I-I'm sorry, but I'm not myself right now. Every time I close my eyes, it's the fort all over again... Everything burning all over again... &lt;sob&gt; Those animals, they were my friends..."},{"name":"TYRBEQ","text":"So you've known loss too..."},{"name":"SLITHERBOUGHGIRL03686","text":"I can't─I won't let any more animals suffer the same fate! I'm going to become a priestess, and then everyone will listen to me!"},{"name":"TYRBEQ","text":"It's all right. We're going to make the nightmare disappear. Such ugliness has no place in Lyhe Mheg."},{"name":"TYRBEQ","text":"We'll watch over you and keep you safe. So rest easy now, and go back to sleep."},{"name":"EZELII","text":"An intriguing change. Yes, most intriguing indeed... &lt;snort&gt;"},{"name":"TYRBEQ","text":"Hmph, don't you have a nightmare to devour?"},{"name":"ANLAD","text":"Why!? Why, why, why!?"},{"name":"TYRBEQ","text":"An Lad!? Come out and show yourself! We have to talk!"},{"name":"EZELII","text":"They don't appear to be in a talkative mood."},{"name":"TYRBEQ","text":"Grrr, why don't you listen for a change!?"},{"name":"EZELII","text":"Uhhh... My poor belly...as if there's─<span class=\"emphasis\">hurk</span>─a volcano in there... It...it begins!"},{"name":"EZELII","text":"Ready or not─<span class=\"emphasis\">hurk</span>─here it comes!"},{"name":"TYRBEQ","text":"Ugh, it doesn't get any easier to look at... <span class=\"highlight\">Forename</span>─get ready, now!"},{"name":"POP","text":"The nightmare creature attacks!"},{"name":"TYRBEQ","text":"S-Some kind of fire fiend!?"},{"name":"EZELII","text":"Yeowch! The air around it is hot enough to burn!"},{"name":"SLITHERBOUGHGIRL03686","text":"&lt;wheeze&gt; &lt;wheeze&gt;"},{"name":"TYRBEQ","text":"Hurrah! You've done it again!"},{"name":"EZELII","text":"Phew... A moment later and I would have been roast..."},{"name":"TYRBEQ","text":"<span class=\"emphasis\">Porxelain</span>. Porxies become porxelain, not roast."},{"name":"TYRBEQ","text":"Anyway, the nightmare is gone. Let's see how the little girl is doing back in Slitherbough."},{"name":"EZELII","text":"Phew... That was too hot for comfort..."},{"name":"SLITHERBOUGHGIRL03686","text":"Oh! I was wondering where you had gone!"},{"name":"SLITHERBOUGHGIRL03686","text":"I wanted to thank you. For helping me in my dream."},{"name":"TYRBEQ","text":"What? You remember?"},{"name":"SLITHERBOUGHGIRL03686","text":"Clear as day. You see, for as long as I can remember dreaming, I've had prophetic dreams. I make it a point to note what I see in them."},{"name":"SLITHERBOUGHGIRL03686","text":"And two years ago, I saw what was about to befall Fort Gohn─the sin eater attack and the fire that broke out. I tried to warn everyone. Tried to tell them to flee. But no one would believe me. No one save Master Matoya. But by the time I got word to her, it was too late..."},{"name":"SLITHERBOUGHGIRL03686","text":"I felt so powerless then. Simply because I was a child, I had no voice. I wanted so badly to be heard, to be respected, I dedicated myself to becoming a priestess and proving my worth."},{"name":"SLITHERBOUGHGIRL03686","text":"But no matter how I tried, it felt as though I never could do well enough. Always, I feared that I would fail. That I wouldn't be able to protect anyone or anything. Then the nightmares started, and I was made to relive that day. Made to feel my powerlessness, over and over."},{"name":"SLITHERBOUGHGIRL03686","text":"I had just about given up hope when you came and showed me that dream. Thanks to your vanquishing the nightmare, I feel at peace now. With myself and who I want to be. May I ask to whom I owe my gratitude?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm an old friend of Master Matoya's."},{"name":"A1","text":"We're warriors who fight to reclaim dreams."},{"name":"SLITHERBOUGHGIRL03686","text":"Truly? You're Master Matoya's friend? There's no one I admire and respect more! She's so wise, and gentle, and beautiful... Ah, I want to be just like her!"},{"name":"TYRBEQ","text":"Hmmmmm..."},{"name":"TYRBEQ","text":"I'll have to pay this Matoya's dream a visit. I'll be sure to make you appear as well, <span class=\"highlight\">Forename</span>. We can dress you up like this, and...ooh, yes! Like that!"},{"name":"SLITHERBOUGHGIRL03686","text":"Is that so?"},{"name":"EZELII","text":"Indeed, indeed. All know the Warriors of Darkness, but we are the Warriors of <span class=\"emphasis\">Dreams</span>. &lt;snort&gt;"},{"name":"SLITHERBOUGHGIRL03686","text":"Warriors of Dreams... I'm not familiar with such heroes, but 'tis plain you are a force for good. Perhaps I shall strive to become one too!"},{"name":"SLITHERBOUGHGIRL03686","text":"Well, I had best return to my training. Though I will keep working hard, I won't let the fear of failure burden me anymore. My thanks again, and please take care!"},{"name":"TYRBEQ","text":"Well now, to be seen <span class=\"emphasis\">and</span> appreciated... I could get used to this! But come, let's return to Lyhe Mheg and open the gate before An Lad finds a new target!"},{"name":"TYRBEQ","text":"This is the gate to the Rak'tika Greatwood. Go on and lift the seal!"},{"name":"SYSTEM","text":"By freeing the little girl in Slitherbough from her nightmares, you and yours have reclaimed the dreams of those in the Rak'tika Greatwood."},{"name":"SYSTEM","text":"Tyr Beq appears eager to further beautify Lyhe Mheg, and for this they require your aid..."},{"name":"TYRBEQ","text":"With that, there's just one gate left!"},{"name":"EZELII","text":"And where does it lead?"},{"name":"TYRBEQ","text":"I haven't the faintest."},{"name":"TYRBEQ","text":"Before the nightmares, there wasn't a fifth gate. I couldn't begin to guess what's beyond."},{"name":"EZELII","text":"And you didn't think to mention this!? &lt;sigh&gt; Never mind... One can't expect a pixie to adhere to logic..."},{"name":"TYRBEQ","text":"An Lad!"},{"name":"ANLAD","text":"So this is Lyhe Mheg. It always seems cold and forbidding no matter where I go, but here it's...different. Here it's warm and inviting."},{"name":"ANLAD","text":"To think that dreams could be so beautiful..."},{"name":"ANLAD","text":"Fear not. I've hardly any power left. And yet...I don't want to fall asleep. I don't want to have that dream again. The one inside the castle on the lake..."},{"name":"EZELII","text":"Lyhe Ghiah... Then you were indeed seeing Titania's dreams."},{"name":"TYRBEQ","text":"..."},{"name":"ANLAD","text":"I'm not sure. It's the dream of a lonely soul that my heart shows me. A dream of rollicking and playing with a dear friend."},{"name":"ANLAD","text":"Would that I could rollick and play too. But every dream I touch turns into a nightmare. And everyone despises me, mortals and pixies alike..."},{"name":"TYRBEQ","text":"An Lad, you always talk of what someone else wants, but what of yourself? What are your own desires?"},{"name":"ANLAD","text":"I...I don't know. I know only that, in the dream of the castle, a nasty monster appears. In a terrible, grating voice, it whispers in my ear: “You were born to bring nightmares─a plague.”"},{"name":"EZELII","text":"What!? Hear me, An Lad! With the powers you possess, you mustn't question your own existence! If you do, your essence will thin out until it is consumed!"},{"name":"TYRBEQ","text":"Ack, I've had enough of all this doom and gloom! I'll be your friend, all right? So please, let's put an end to all this!"},{"name":"ANLAD","text":"You'll be my friend?"},{"name":"TYRBEQ","text":"Uwaaah!"},{"name":"EZELII","text":"Are you all right!?"},{"name":"TYRBEQ","text":"Huh? It didn't seem to do anything..."},{"name":"ANLAD","text":"No. You're not my friend."},{"name":"TYRBEQ","text":"An Lad!"},{"name":"EZELII","text":"Let's head outside for now!"},{"name":"EZELII","text":"All proceeds apace thus far! Come, let us unseal the fourth gate! &lt;snort&gt;"},{"name":"EZELII","text":"Excellent! Only one gate remains!"},{"name":"TYRBEQ","text":"I don't know what An Lad did to me, but I seem fine. &lt;yawn&gt; Just a little tired, perhaps..."},{"name":"EZELII","text":"I would surmise that, had you shared An Lad's needs, you would have become a source for the nightmares like the children."},{"name":"TYRBEQ","text":"Is that why they said I couldn't be their friend? Because I don't share their needs?"},{"name":"EZELII","text":"I believe so."},{"name":"TYRBEQ","text":"Oh, for the love of... Why do they have to make things so complicated?"},{"name":"TYRBEQ","text":"Well, there isn't much we can do about An Lad until they choose to reappear. Let's focus instead on filling Rak'tika with fun and happy dreams! When you have time, <span class=\"highlight\">Forename</span>, Uin Nee is always looking for help!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Honored</span> reputation with the Dreamspinners."},{"name":"SYSTEM","text":"New pixie tribal daily quests are now available from Uin Nee in Lydha Lran."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Uin Nee as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Uin Nee. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Jul Oul."},{"name":"SYSTEM","text":"In order to undertake the next tribal main quest, you must first complete the main scenario quest “Out of the Wood.”"}],"reward":{"gil":1878},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":34}],"quests":[69221]},"next":[69223]},"partials":[{"type":"npc","id":"1031806","obj":{"i":1031806,"n":"Tyr Beq","l":2956,"q":6}},{"type":"quest","id":"69221","obj":{"i":69221,"n":"The Heart's Oasis","g":56,"l":"Il Mheg","s":3,"f":1}},{"type":"quest","id":"69223","obj":{"i":69223,"n":"As the Heart Bids","g":56,"l":"Il Mheg","s":5,"f":1}}]}