{"quest":{"name":"The Aesthetician of Il Mheg","location":"Il Mheg","id":69228,"patch":5.1,"sort":10,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee's favorite leafmen are in need of a good pruning.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Examine the overgrown leafmen and obtain leaves.","Deliver the leafmen's leaves to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Oh, but which of them was my favorite? Is it the one who once tried to sneak up on me and pluck my wings? Or the one who was just <span class=\"emphasis\">so</span> cute when he confessed his love to me that I simply <span class=\"emphasis\">had</span> to keep him by my side forever and a day!"},{"name":"UINNEE","text":"You've seen my collection of delightful little leafmen, have you not? Always basking blithely in the light of the sun, sprouting new fronds here, there, and everywhere!"},{"name":"UINNEE","text":"I had a mind to give them a little trim from time to time, but pointy objects are too prickly and perilous for my liking, don't you know. But <span class=\"emphasis\">you</span>, my favorite mortal─you don't seem the type to be bothered by blades and shears, now do you? "},{"name":"UINNEE","text":"So why don't you run along and give my foliating friends a little trim? And don't forget to bring back some of their pretty little leaves! The children in the Garden of Dreams do so much love to pile them up and jump inside!"},{"name":"SYSTEM","text":"Abundant green foliage sprouts from every nook and cranny of the leafman's body, such that many of the leaves and branches have become matted and tangled together."},{"name":"SYSTEM","text":"With a few snips, you remove the overgrowth from the leafman's body, leaving it looking as prim and trim as the day it was born!"},{"name":"UINNEE","text":"Was there something you needed? Oh, but of course! You were going to prune my precious little leafmen for me. Well, did you?"},{"name":"UINNEE","text":"Thank you ever so much! I knew there was a reason why you were my favorite mortal. Oooh, and look at these lovely fronds you've brought back for me! Why, perhaps I'll spin them into a little leafman for the children!"},{"name":"UINNEE","text":"Some of them don't have so many friends, you know? It truly breaks my heart to see. And so I'll fashion them a whole horde of leafmen to play with! They should get along swimmingly─after all, the leafmen used to be mortals, too!"},{"name":"UINNEE","text":"Sometimes I wonder what it's like to be a leafman. Have you ever wondered, too? If you have, why, that could certainly be arranged! You need only say the─wait, why are you backing away from me like that?"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}