{"quest":{"name":"Sustenance for the Soul","location":"Il Mheg","id":69220,"patch":5.1,"sort":2,"icon":100952,"beast":12,"unlocksFunction":1,"eventIcon":71341,"issuer":1031806,"target":1031806,"genre":56,"journal":["Tyr Beq would like to offer you their thanks.<br>※The difficulty of this quest will be synced to your current level.","Tyr Beq thanks you for your help in the effort to restore Lyhe Mheg; being a place they built together with their departed best friend, the garden is clearly very dear to the pixie. They then mention that the little girl whose nightmare you vanquished is currently dreaming, and you are invited to join them for a meeting inside Lyhe Mheg.<br><br>※You may enter Lyhe Mheg by speaking with Thon Sul in Lydha Lran.<br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Inside Lyhe Mheg, you and your companions enjoy a brief but happy reunion with the little girl from Sullen. As she leaves to return to the waking world, you are comforted by the knowledge that all is well in her dreams and reality both.","With things settled in Lakeland, you turn your attention to those suffering nightmares in another region─Kholusia. Your mission is to track down the individual in whom An Lad has planted a nightmare, but it appears the pale pixie has employed magicks to veil the scent. At Ezel's suggestion, you make your way to Pla Enni in order to seek the counsel of its creator.","You speak with Ezel's creator, the Nu Mou Lugg Aenc, who provides you with valuable insights. Based on their explanation of how an unusual pixie such as An Lad might be born, you deduce that the source of the nightmares is most likely a child who is tormented by hunger. Thus do you set out for the village of Wright, where the stench of nightmares is concentrated.","Upon arriving in Wright, you are approached by a local woman, who says her foster son is suffering from recurring nightmares. She goes on to explain that the boy refuses to eat unless he is ripe to collapse, out of fear that the food will run out. Believing this to be a promising lead, Ezel suggests looking for the child.","After a brief search, you find the boy tossing and turning in his sleep. The conspicuous lack of a scent marks him as the source of the nightmares in Kholusia, and Ezel wastes no time setting to work. Having devoured the nightmare, the familiar rushes off to find a safe place to deposit it, and you hurry close on, ready to spring into action.","Using their magicks, Tyr Beq transforms the nightmare into a corporeal being, which you summarily strike down. As you put away your weapon, you notice that the pixie is looking a little queasy...","Ezel is hopeful that your victory has wrought a change in the boy, and you hasten back to Wright to check on him.","Soon after waking up, the boy asks his foster mother for food─a positive sign that he has overcome his torment. No sooner do they leave than An Lad appears before you once more. Vexed by your ongoing interference, the pixie speaks cryptic words before taking their leave. Setting the encounter aside in your mind for now, you turn your steps back to Lyhe Mheg, where another gate awaits opening.","You arrive in Lyhe Mheg to find your companions waiting for you. Without preamble, Tyr Beq asks you do the honors and open the next gate─that which leads to Kholusia.","You raise a hand to the gate, which duly opens and releases more dream bubbles. And as you and Ezel watch in marvel, the pixie draws upon the amassed bubbles to create a fantastical house of treats along with an array of play equipment. Such, it seems, is the magic of Lyhe Mheg.","Pride writ plain on their face, Tyr Beq bids you play as long as you like in the realm before heading outside to await you in Lydha Lran.","Having had your fill of frolicking, you rejoin your companions back in the pixie village. There, Tyr Beq implores you to continue lending your aid to restoring Lyhe Mheg, the present focus being to fill Kholusia with happy dreams."],"objectives":["Speak with the Sullen girl in Lyhe Mheg.","Speak with Ezel II.","Speak with Ezel II in Pla Enni.","Speak with Ezel II in Wright.","Find a child suffering from a nightmare.","Vanquish the nightmare creature.","Speak with Tyr Beq.","Speak with the Wright boy.","Speak with Tyr Beq in Lyhe Mheg.","Speak with Tyr Beq again.","Speak with Tyr Beq in Lydha Lran."],"dialogue":[{"name":"TYRBEQ","text":"<span class=\"highlight\">Forename</span>! Thanks to you, Lakeland is now brimming with fun and happy dreams! Though there's still much to do, Lyhe Mheg has begun to regain its former shine, and for that I'm truly grateful."},{"name":"TYRBEQ","text":"My best friend and I, we built the place together, you see. But they're gone now, and it falls to me to look after our precious garden."},{"name":"TYRBEQ","text":"Oh, right! The little girl whose nightmare we vanquished─she's having a dream right now. Would you like to go and see her together?"},{"name":"EZELII","text":"Why, yes, I'd love to!"},{"name":"TYRBEQ","text":"Um, actually, I wasn't asking... &lt;sigh&gt; Never mind... When you're ready, speak to Thon Sul as before, and they'll show you in."},{"name":"LAKELANDGIRL03683","text":"Oh, you're the hero from my dream! The one who defeated the monster controlling my doll! You're so brave and strong, just like the Warrior of Darkness!"},{"name":"LAKELANDGIRL03683","text":"Ever since I had that dream, I haven't been afraid to say how I feel. Well, it might still be a little bit embarrassing...but my heart feels so much lighter now."},{"name":"EZELII","text":"That is well, child! It's poison for the soul to keep your feelings pent up inside!"},{"name":"LAKELANDGIRL03683","text":"Oh dear, is it that time already? I'd like to stay and talk some more, but I have to wake up soon. Thank you, all of you! Till next time!"},{"name":"TYRBEQ","text":"Well, how strange to receive thanks from a mortal... It's not a bad feeling!"},{"name":"TYRBEQ","text":"While the children dream, we call them to Lyhe Mheg to play with us. Rest assured we send them back alive and well!"},{"name":"EZELII","text":"That such a thing should be possible... The Weaver is no idle epithet!"},{"name":"EZELII","text":"&lt;snort&gt; I've been thinking, friends. With things settled in Lakeland, perhaps we may now turn our attention to those suffering from nightmares in other regions?"},{"name":"TYRBEQ","text":"Yes, I think it's a good time now. What do you say we take ourselves to Kholusia next?"},{"name":"EZELII","text":"No objections from me. Now, based on previous observations, An Lad plants a potent nightmare within a chosen individual, who in turn spreads it to those around them."},{"name":"EZELII","text":"That little girl was one such person─the source of the nightmares in Lakeland. We must look for her counterparts in Kholusia and elsewhere, and likewise aid them."},{"name":"TYRBEQ","text":"I see, I see! And I trust you can track down these people with your keen sense of smell?"},{"name":"EZELII","text":"But of course! ...Is what I would like to say, but it has become...complicated. &lt;snort&gt;"},{"name":"EZELII","text":"In order to prevent further interference, it seems An Lad has taken to employing magicks to veil the scent of the nightmare at the source."},{"name":"EZELII","text":"The result being, though I can sense the general area where nightmares are concentrated, I can't readily identify the individual from which they all emanate."},{"name":"TYRBEQ","text":"First you can't keep the nightmare down, and now you can't even find them? Bah! What use are you!?"},{"name":"EZELII","text":"Come, come, let's not lose faith so soon!"},{"name":"EZELII","text":"It just so happens I know someone who can help us─my creator. Let us go to Pla Enni and seek their counsel together."},{"name":"TYRBEQ","text":"When the little girl wakes up, she'll forget having met us. But I'm sure she'll feel all warm and fuzzy inside!"},{"name":"EZELII","text":"This is my esteemed creator, Lugg Aenc. On the subject of the heart and the mind, I know none more versed than they."},{"name":"EZELII","text":"Master Lugg Aenc, I am returned. If it please you, these are my companions. We seek your sage counsel on the matter of the pale pixie."},{"name":"LUGGAENC","text":"Ah, if it isn't Ezel II, the namesake of my beloved teacher! Pleased am I that you still think me your master!"},{"name":"LUGGAENC","text":"&lt;gasp&gt; Y-You are the hero who set free our fallen king! A-A fitting payment─such a valorous deed calls for a fitting payment!"},{"name":"TYRBEQ","text":"Ah, Lugg Aenc... Just another Nu Mou at the end of day..."},{"name":"EZELII","text":"With all due respect, Master, we have need of haste. As you are aware, we are on a quest to eliminate nightmares, but the pale pixie has veiled the scent with magicks. Is there no way to lift its effects?"},{"name":"LUGGAENC","text":"Hmmm, I'm afraid lifting such magicks will be no easy feat. However, I believe we may greatly narrow down the search by considering the circumstance of the pale pixie's birth."},{"name":"TYRBEQ","text":"Their birth, you say? There's always more of us appearing, so I hadn't given it any thought."},{"name":"LUGGAENC","text":"To state a commonly held belief, 'tis said that a pixie is born when the soul of a mortal who died in childhood gathers new aether to itself. Are we following thus far?"},{"name":"LUGGAENC","text":"Having originated from a life ended too soon, such a soul is often unstable, and is defined by the needs that once drove its owner─needs that are highly susceptible to the influence of outside aether."},{"name":"LUGGAENC","text":"This brings me to my hypothesis. Should a soul defined by unfulfilled needs take on aether laden with extremely adverse emotions..."},{"name":"EZELII","text":"...It may give rise to a nightmare-spawning pixie such as An Lad!"},{"name":"TYRBEQ","text":"What ill luck to be born like this..."},{"name":"EZELII","text":"If this hypothesis is correct, we may confirm that An Lad is drawn to those who are tormented by the same unfulfilled needs. And as a pixie, it is in children most of all that they would see kindred souls."},{"name":"TYRBEQ","text":"I can say from experience that there's a strong connection between needs and dreams. And in the case of Kholusia, most dreams are to do with food."},{"name":"EZELII","text":"Food, you say? It's decided, then! We search for children in Kholusia whose hearts are hounded by hunger!"},{"name":"EZELII","text":"As I mentioned, An Lad has veiled the scent of the source, but the nightmares are concentrated in Wright. Our task, then, is to find a child there who suffers from nightmares yet gives off no scent. Let's set out at once!"},{"name":"LUGGAENC","text":"A-A moment! Given the service you have performed for us, we owe you a tremendous debt. I cannot feel at ease until it is repaid. Is there no service I can offer you?"},{"name":"LUGGAENC","text":"N-Nothing at all? Hmmm, in that case... You are staying at Lydha Lran, yes? If it would not be considered overly bold, I shall take myself there. My familiars are at your disposal should you need them."},{"name":"TYRBEQ","text":"Lugg Aenc here is the Nu Mou acquaintance I mentioned, the one who alerted me to the nightmares. We meet every so often to trade things like the fae lamps they need to make porxies."},{"name":"LUGGAENC","text":"Yes, an extract of this mushroom should serve..."},{"name":"EZELII","text":"&lt;sniff&gt; &lt;sniff&gt; Mmmmmm, yes... This village positively reeks of nightmares. There can be no doubt─the source is here, spreading their influence to those around them."},{"name":"FOSTERPARENT03684","text":"D-Did that pig just talk? And did it say something about nightmares?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's a familiar that hunts nightmares."},{"name":"A1","text":"We're investigating nightmares."},{"name":"FOSTERPARENT03684","text":"Truly? Then...perhaps you can help me. A child I recently took in, he's been having terrible nightmares. I don't know what to do..."},{"name":"FOSTERPARENT03684","text":"The boy was originally from a nearby village. His parents abandoned him and went to try their luck in Eulmore. It's sad, I know, but I'm afraid it's not an uncommon story in these parts."},{"name":"FOSTERPARENT03684","text":"Anyway, for a long while he was alone and had to fend for himself. He was on the brink of starving to death when I found him and brought him here."},{"name":"FOSTERPARENT03684","text":"I managed to nurse him back to health, but the experience seems to have scarred him. He refuses to eat unless he's ripe to collapse, out of fear that the food will run out."},{"name":"EZELII","text":"Where is the child now?"},{"name":"FOSTERPARENT03684","text":"I thought I saw him playing on the north side of the village earlier, but like as not he's fallen asleep. He always seems tired these days."},{"name":"EZELII","text":"Thank you for sharing this with us, madam. Rest assured we shall do all that we can. &lt;snort&gt;"},{"name":"EZELII","text":"I daresay this is a promising lead! Come, let us search for the child!"},{"name":"FOSTERPARENT03684","text":"&lt;sigh&gt; Whatever will I do...?"},{"name":"FOSTERPARENT03684","text":"A flying, talking pig... What will they think of next?"},{"name":"TYRBEQ","text":"I'll stay hidden and leave the talking to you and Ezel."},{"name":"WRIGHTBOY03684","text":"Unnngh... No... Get away from me... Get away..."},{"name":"EZELII","text":"Tossing and turning in his sleep, yet not a whiff of a nightmare... I believe we've found our source!"},{"name":"EZELII","text":"To be so hungry yet be unable to eat... No child deserves to suffer so."},{"name":"EZELII","text":"Rest easy now, lad! We shall vanquish your nightmare!"},{"name":"TYRBEQ","text":"Let me get this straight: he's hungry, but he refuses to eat even though there's food? I don't understand mortals sometimes... Anyway, we all remember what to do, yes?"},{"name":"EZELII","text":"Uhhh... I...I don't know─<span class=\"emphasis\">hurk</span>─how long I can hold it in... Q-Quickly, this way!"},{"name":"TYRBEQ","text":"Here I go! Get ready, <span class=\"highlight\">Forename</span>!"},{"name":"WRIGHTBOY03684","text":"Uhhh..."},{"name":"POP","text":"The nightmare creature attacks!"},{"name":"TYRBEQ","text":"Ewww, that is disgusting! Hurry and put it out of my misery!"},{"name":"EZELII","text":"It's harder work...&lt;huff&gt;...bringing it back up... &lt;wheeze&gt;"},{"name":"TYRBEQ","text":"Ugh, cannot unsee... That thing's going to haunt my dreams..."},{"name":"EZELII","text":"But it will haunt the young boy's no more! Let us hasten back to Wright and see how he fares!"},{"name":"EZELII","text":"My belly has recovered, I am happy to report!"},{"name":"WRIGHTBOY03684","text":"What the...? Do I know you? It feels as though I've met you before. Both you and the flying pig..."},{"name":"FOSTERPARENT03684","text":"Ah, so you found him."},{"name":"EZELII","text":"How do you feel, my boy?"},{"name":"WRIGHTBOY03684","text":"It's strange... I was having a terrifying dream, but it suddenly turned happy. Then I woke up, and my stomach─it doesn't feel like it's in knots anymore."},{"name":"FOSTERPARENT03684","text":"Well, now... What dream was it that you saw?"},{"name":"WRIGHTBOY03684","text":"It's kind of hazy...but there was a great, gluttonous monster that ate everything. I was fighting it and losing. But then someone appeared and helped me, and together we defeated it!"},{"name":"WRIGHTBOY03684","text":"...Um, Mother? I'm starving. Can I have something to eat?"},{"name":"FOSTERPARENT03684","text":"B-But of course, my dear boy! You can have as much as you like!"},{"name":"FOSTERPARENT03684","text":"We mightn't have anything fancy, but we grow enough here to feed everyone. You needn't fear ever going hungry. So come, let's go home. I'll even bake you a sweet!"},{"name":"WRIGHTBOY03684","text":"...It was you, wasn't it? The hero who helped me in my dream? Thank you! Thank you so much!"},{"name":"EZELII","text":"Uwaaah! Th-They're back!"},{"name":"ANLAD","text":"Why? Why do you interfere?"},{"name":"TYRBEQ","text":"Hmph, we would ask you the same question! Why won't you have fun with dreams like a normal pixie?"},{"name":"ANLAD","text":"...Fun? What does that mean?"},{"name":"TYRBEQ","text":"You really don't know? If you're not making mischief, what is it that you're trying to do? What's your purpose?"},{"name":"ANLAD","text":"What's my purpose? I don't know. I merely follow my heart."},{"name":"ANLAD","text":"Since being born, there are two dreams I see. One where I can never reach someone I love. And another where I'm crying alone in a cramped old castle."},{"name":"ANLAD","text":"When I awaken, I'm driven by a burning desire for them. For that someone, though their face is a blur. And for Lyhe Mheg, oh-so-nostalgic Lyhe Mheg..."},{"name":"TYRBEQ","text":"What do you mean? Why Lyhe Mheg? And who's this someone?"},{"name":"TYRBEQ","text":"..."},{"name":"EZELII","text":"Well, that was certainly perplexing... But in any case, we've accomplished our mission here. So come, my friends! Another gate wants for opening in Lyhe Mheg!"},{"name":"TYRBEQ","text":"We've been waiting for you, <span class=\"highlight\">Forename</span>. If truth be told, An Lad's words still weigh on my mind...but I daresay we've earned a moment of fun!"},{"name":"TYRBEQ","text":"Oh yes, we're going to open another gate, and we're going to put the bubbles we've gathered to use!"},{"name":"EZELII","text":"And how does one use these bubbles exactly?"},{"name":"TYRBEQ","text":"Tee hee! What was it that you said, Ezel? Better to show than to explain or some such?"},{"name":"TYRBEQ","text":"Right, <span class=\"highlight\">Forename</span>, I want you to do the honors again! This time, hold an image of Kholusia in your mind!"},{"name":"EZELII","text":"There you are! Come, come, let us open the next gate!"},{"name":"SYSTEM","text":"By freeing the little boy in Wright from his nightmares, you and yours have reclaimed the dreams of those in Kholusia."},{"name":"SYSTEM","text":"Furthermore, using the dream bubbles, Tyr Beq has created a house of treats and an array of play equipment!"},{"name":"EVENTAREA","text":"Proceed with the story?"},{"name":"TYRBEQ","text":"Tee hee! Surprised, yes? Feel free to stay and play as long as you like. We'll be waiting for you outside!"},{"name":"EZELII","text":"A-Amazing!"},{"name":"TYRBEQ","text":"There you are, <span class=\"highlight\">Forename</span>! I trust you had fun! Amazing what you can do with happy dreams and a touch of pixie magick, right?"},{"name":"EZELII","text":"This porxie, for one, is thoroughly impressed! You truly live up to your reputation as a founder of Lyhe Mheg!"},{"name":"TYRBEQ","text":"You know, <span class=\"highlight\">Forename</span>, if you liked it in there, you're welcome to make Lyhe Mheg your home."},{"name":"TYRBEQ","text":"Oh yes, forever and ever and ever..."},{"name":"TYRBEQ","text":"Tee hee! Right, now that we've reclaimed Kholusia, we must work to fill it with lots of happy dreams. If you're willing to help, Uin Nee yonder will set you some tasks!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with the Dreamspinners."},{"name":"SYSTEM","text":"New pixie tribal daily quests are now available from Uin Nee in Lydha Lran."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Uin Nee as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Uin Nee. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Jul Oul."}],"reward":{"gil":2549},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":34}],"quests":[69219]},"next":[69221]},"partials":[{"type":"npc","id":"1031806","obj":{"i":1031806,"n":"Tyr Beq","l":2956,"q":6}},{"type":"quest","id":"69219","obj":{"i":69219,"n":"Manic Pixie Dream Realm","g":56,"l":"The Crystarium","s":1,"f":1}},{"type":"quest","id":"69221","obj":{"i":69221,"n":"The Heart's Oasis","g":56,"l":"Il Mheg","s":3,"f":1}}]}