{"quest":{"name":"A Flowery Frolic","location":"Il Mheg","id":69226,"patch":5.1,"sort":8,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee would fill the dreams of children with flowers.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Track down and capture a bitsy basket at the designated location.","Deliver the bitsy basket to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Oh, aren't they lovely? Vibrant blooms of all colors bursting forth from the intertwining branches─truly bountiful floral bouquets come to life! You've seen them ambling about here in Lydha Lran, haven't you?"},{"name":"UINNEE","text":"I just <span class=\"emphasis\">know</span> the children would love them as much as I do. Were it not for one oh-so-small rub, that is. You see, they have an awfully nasty tendency to stomp on smaller creatures─not on purpose, I'm sure─and crush them under the mighty trunks that form their feet."},{"name":"UINNEE","text":"That's when I got to thinking! I thought, why, all I need to do is weave a spell to bring them down to a smaller size! And so I did precisely that! Sadly, it worked <span class=\"emphasis\">so</span> well that I didn't even notice when one of the tiny little creatures snuck away!"},{"name":"UINNEE","text":"Why, I simply couldn't <span class=\"emphasis\">bear</span> to keep the children waiting any longer! You'll track my little creation down and bring it back to me, yes? Yes? And if it puts up a fight, don't hesitate to bash it on the head once or twice to remind it to behave!"},{"name":"UINNEE","text":"Well, if it isn't my favorite mortal! Did you manage to capture my darling little basket? Because I might have to find a <span class=\"emphasis\">new</span> favorite mortal if you didn't."},{"name":"UINNEE","text":"Oh dear...look at all those battered branches. It looks like it put up quite a fight. But not to worry! Oh, no, not at all! My magic will have it patched up good as new in the flutter of a wing!"},{"name":"UINNEE","text":"To think the teensy-weensy version would be so lively when its bigger brethren are so restful and relaxed. Is it possible that smaller creatures are more wont to dash and dart about with little aim or reason?"},{"name":"UINNEE","text":"Why, just the other day, I saw it trying to plant a new flower on itself. When the aroma attracted a curious little creepy-crawly, it completely forgot about the flower and chased the insect across the fields, where it saw <span class=\"emphasis\">another</span> flower, and...why, it's as if it cannot keep its mind on a single thing for more than mere moments at a time!"},{"name":"UINNEE","text":"But what was I talking about again? Anyhow, no matter. I really should be getting along spinning dreams of my flowering little friend. You'll help me if it gets away again, won't you?"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}