{"quest":{"name":"Raiders of the Lost Pork","location":"Il Mheg","id":69239,"patch":5.1,"sort":21,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee is concerned for the well-being of Il Mheg's most beloved species.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Search for the suspicious character at Timh Gyeus.","Speak with Uin Nee."],"dialogue":[{"name":"UINNEE","text":"<span class=\"highlight\">Forename</span>, help! Il Mheg is being invaded!"},{"name":"UINNEE","text":"Sort of. By “invaded,” I mean, a stranger has shown up and started chasing our porxies!"},{"name":"UINNEE","text":"I wouldn't mind so much if it weren't for the fact our pets are supposed to be gathering flower seeds for use in dreams. Go and put a stop to this silliness, would you?"},{"name":"TALLFUATH","text":"One, two! One, two, three, four!"},{"name":"TALLFUATH","text":"On an epic adventure, the intrepid hero is here!♪<br>A Fuath to be reckoned with, evildoers frozen in fear!♪<br>In the name of joy, he dances his merry jig!♪<br>Let none keep him from the enchanted flying pig!♪"},{"name":"TALLFUATH","text":"Oh, porxie, how do I love thee? Let me count the ways! But why must you always flee when I draw near? Why, I ask youuu!"},{"name":"TALLFUATH","text":"Me, bothering the porxies!? Never!"},{"name":"TALLFUATH","text":"The mere thought I could be causing them distress has left me quite flabbergasted! And to think they would spurn my affections...it is preposterous, I tell you!"},{"name":"TALLFUATH","text":"I was merely passing through to trade with the Nu Mou when I saw their precious pink companions. That adorable snout, that curly tail... It was love at first sight! Wait for me, porxies!"},{"name":"SCAVENGER","text":"No more, please! I'll leave Il Mheg and never come back, I swear!"},{"name":"SCAVENGER","text":"Oh, you're not a faerie? Thank goodness."},{"name":"SCAVENGER","text":"I was trying to catch one of those little flying pigs, for research purposes. But then I discovered that they're the faeries' creations. Even if I managed to get my hands on them, I'd never be able to take something so dangerous back to civilization!"},{"name":"SCAVENGER","text":"And if the pixies find me, they'll turn me into one of those leafmen! It's high time I quit this godsforsaken place!"},{"name":"FAKEMYSTEL","text":"Hello! I am a very rich lady from Eulmore! I expect you to <span class=\"alternative-container\"><span class=\"alternative\">curtsy</span><span class=\"alternative\">bow</span></span> when greeting one of my standing!"},{"name":"FAKEMYSTEL","text":"Ha ha! Just joking! I'm actually a pixie in disguise. Walking around like a mortal certainly makes a change from all that flitting about!"},{"name":"FAKEMYSTEL","text":"Chasing porxies? Why, yes, as a matter of fact, I was. It's a bit hard to keep up with them, though. Perhaps I need some more practice with this “one foot in front of the other” business!"},{"name":"FAKEMYSTEL","text":"And if the other pixies have a problem with me chasing those flappy-eared porkers, I could leave them alone, I suppose. After all, 'tis hardly fitting for a “lady” to engage in such unseemly behavior!"},{"name":"UINNEE","text":"So I take it the porxies will be resuming their duties? Good. I won't let them shirk their responsibilities! Not even if they're cute and adorable and I want to squeeze them and squeeze them until... Gah!"},{"name":"UINNEE","text":"No! I mustn't allow them to beguile me! I have a job to do! And for your part in...whatever this was, I'm making you an honorary “Protector of Porxies”!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}