{"quest":{"name":"The Wonder of Witchweed","location":"Il Mheg","id":69231,"patch":5.1,"sort":13,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee cannot wait another moment to have their bidding done.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Keep watch at Good Jenanna's Grace, and slay a witchweed for its petals.","Deliver the witchweed petals to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Oh, no! I've gone and done it again─forgotten something deathly important! Forgotten what, you say? Silly mortal─that's what I'm trying to remember!"},{"name":"UINNEE","text":"Oh, but of course─witchweed petals! Somehow I've managed to completely exhaust my supply! This simply won't do. No, not at all!"},{"name":"UINNEE","text":"Fortunately, you've turned up just at the right time to help me set things right! It's really most impressive how you always seem to know when I need you. Now, off with you to Good Jenanna's Grace, where the most frilly and flowery of witchweeds roam! Don't worry, I'll look after things here."},{"name":"UINNEE","text":"Oh, look who's back! Did you bring the─wait, what was it that I asked you for again?"},{"name":"UINNEE","text":"But of course! Witchweed petals! How could I forget? Speaking of forgetting, I completely forgot to tell you why I needed them in the first place didn't I?"},{"name":"UINNEE","text":"If you were paying attention─and you always pay attention, don't you─I'm sure you noticed how witchweeds change their petals to resemble the shape of their prey. The poor little creatures approach, thinking they've found a friend, and─GULP! GNASH! No more little creature."},{"name":"UINNEE","text":"&lt;sniff&gt; Poor little things... Anyhow, where was I? Oh yes! If I have witchweed petals, all I need to do is weave a simple spell and I can spin all sorts of cute animals for my little dreamers!"},{"name":"UINNEE","text":"But whatever sort of creature shall I conjure up first? Perhaps a little ladybug? A wriggly worm? Perhaps an army of itsy-bitsy spiders! Wait─how about <span class=\"emphasis\">all</span> of them! Yes, I'll simply bury them in bugs! Don't you wish you were a child still so you could dream such lovely dreams?"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}