{"quest":{"name":"Best of Boat Worlds","location":"Il Mheg","id":69236,"patch":5.1,"sort":18,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee wishes to experience the joys of boating in a Fuath-free environment.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Survey the designated location east of Mithai Glorianda and obtain a wing membrane from a deepglider.","Deliver the deepglider wing membrane to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Tyr Beq was telling me all about your trip to Kholusia. Is it true that the ocean is even bigger than Longmirror Lake? I hear the mortals there love to go boating, where they can forget their troubles and maybe catch a fish or two."},{"name":"UINNEE","text":"I'd love to try it here, but those horrid Fuath are bound to show up and spoil our fun! <br>...Oh, of course! We can do it in Lyhe Mheg instead, and have the children join us too!"},{"name":"UINNEE","text":"There's just one problem: I haven't the faintest idea what a boat looks like. Perhaps we can try making one from the wing of a deepglider...which I'm sure you'll be more than willing to collect for me!"},{"name":"UINNEE","text":"I have a vague recollection of asking you to bring me something... What was it?"},{"name":"UINNEE","text":"Ah, yes! I remember now! This should work nicely. Not that I have a clue what to do with it..."},{"name":"UINNEE","text":"So it needs to float on the water and support the weight of several small children. It can't be that difficult to make a thing like that from a bit of lizard skin, can it?"},{"name":"UINNEE","text":"And since we won't be boating on real water, as long as we can conjure up something that at least <span class=\"emphasis\">looks</span> like a boat, it should be fine. Oh yes, we'll have the finest adventures with the children on the ocean blue! ...It <span class=\"emphasis\">is</span> blue, isn't it?"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}