{"quest":{"name":"Porxine Perfection","location":"Il Mheg","id":69234,"patch":5.1,"sort":16,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee has a need for nectar.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Lugg Aenc.","Ride the porxie to Handmirror Lake and suck up some nectar.","Report to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Shall we play a guessing game, <span class=\"highlight\">Forename</span>? Guess what I love more than <span class=\"emphasis\">anything</span> in the world! No, it's not you, silly. It's nectar! Sweet, luscious, lovely nectar!"},{"name":"UINNEE","text":"And guess what I love <span class=\"emphasis\">almost</span> as much as nectar? Why, the simply <span class=\"emphasis\">perfect</span> porxies the Nu Mou made for us to gather all the nectar we can drink!"},{"name":"UINNEE","text":"Now let <span class=\"emphasis\">me</span> guess: you've always wanted to ride a porxie, too? Well, then today's your lucky day! Simply speak to my friend Lugg Aenc, and they'll have you on the back of one of our fetching little familiars in no time! Doesn't that sound like fun?"},{"name":"LUGGAENC","text":"Greetings, friend! Do not worry─Uin Nee has already explained everything to me. You'll be taking one of our porxies out to harvest a healthy supply of nectar, correct? It really is too kind of you to volunteer for such a tedious task. In any event, I'm happy to afford you with one of my personal favorites."},{"name":"LUGGAENC","text":"Are you quite all right? When the porxie returned alone, I'd worried that you'd taken a nasty fall. Good to see that you're still up and about─Uin Nee's getting terribly impatient about that nectar you promised them."},{"name":"SYSTEM","text":"The porxie inhales deeply, filling its nose─and one can only assume other parts of its inner anatomy─with sweet, sweet nectar. You try not to think about how Uin Nee intends to extract said nectar from the innards of the little beast."},{"name":"SYSTEM","text":"The aroma of sweet nectar wafts toward your nose. Unfortunately, you have no way of harvesting it on your own. Speak to Lugg Aenc in Lydha Lran so that you might procure a porxie and remedy the situation."},{"name":"UINNEE","text":"Oh, hello there. A porxie just came back with a belly full of the sweetest, most succulent nectar. I don't suppose you had anything to do with that, did you? In any event, I do hope you enjoyed your little flight!"},{"name":"UINNEE","text":"Yes, I simply can't wait to drink deep of that sweet, sweet nectar! Oh, perhaps you were wondering how we get the nectar out of the porxie?"},{"name":"UINNEE","text":"Well, if you must know...I try not to think about that part. It gets a bit icky from time to time, you see. Why, there was one time when a porxie sneezed just as I was about to─yuck! On second thought, I don't think I'm thirsty anymore. Oh, why did you have to remind me about that!?"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}