{"quest":{"name":"Amazing Graze","location":"Il Mheg","id":69237,"patch":5.1,"sort":19,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee has an assignment for you that may or may not involve sheep.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the sheep-obsessed pixie.","Obtain clumps of much-better-than-usual grass near Anden's Airs.","Deliver the clumps of much-better-than-usual grass to the sheep-obsessed pixie.","Speak with Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Il Mheg is full of all sorts of creatures, some nicer than others. We pixies are particularly fond of sheep, with their fluffy, fluffy wool and tasty milk. And the children love them for the same reason!"},{"name":"UINNEE","text":"Now, a shepherd friend of mine says they need a hand with their flock. Obviously, I'm far too busy to go flitting about picking up droppings, combing out lice, or whatever it is, so perhaps you could go in my place?"},{"name":"SHEEPPIXIE","text":"Here to help me tend to my precious fluffies, are you? I hope you're ready to work, because this won't be easy!"},{"name":"SHEEPPIXIE","text":"The food that sheep eat affects the fluffiness of their wool. I've tried feeding them every type of plant you can imagine, and nothing works better than grass that grows on high plateaus."},{"name":"SHEEPPIXIE","text":"The problem is, it takes us so long to fly to any of these places, and even when we get there, we can only carry a small amount back. It's hardly enough for even one mouthful!"},{"name":"SHEEPPIXIE","text":"We need someone who not only has the means to fly, but big hands to pick up big clumps of grass. Oh, and a near-bottomless bag to store it all. And I daresay you'll do nicely. Off you go, now! Start up at Anden's Airs, and don't take all day about it!"},{"name":"SHEEPPIXIE","text":"If you've got time to stand here with your mouth hanging open like a hungry chick, you've got time to pick that grass for me! Off you go!"},{"name":"SHEEPPIXIE","text":"It looks like my sheep have caught a whiff of that grass you're carrying. Come on, let's be having it!"},{"name":"SHEEPPIXIE","text":"Ooh, it smells so good that I might have to sample some myself! Did you know, these little darlings are descended from sheep who once lived high in the mountains? That would explain why they love this grass more than any other."},{"name":"SHEEPPIXIE","text":"So, Anden, what do you think of your flock now?"},{"name":"SHEEPPIXIE","text":"Oh, you're not familiar? Anden was a shepherd who used to live on a cliff overlooking Longmirror Lake. He really loved his sheep, and stayed to care for them in Il Mheg to the very end."},{"name":"SHEEPPIXIE","text":"Kind-hearted as we pixies are, we decided to turn him into a lovely leafman! This way, he can watch over his flock forever and ever..."},{"name":"SHEEPPIXIE","text":"Anden loved his sheep, and they love him back. Oh yes, they love to nibble away at his leaves, but I try not to let them eat too much or there'll be nothing left of him!"},{"name":"SHEEPPIXIE","text":"Oh, Anden may be outside as well, but this Anden is just as much an Anden as ever there was one! Isn't that right, Anden?"},{"name":"SHEEPPIXIE","text":"Anyway, that's enough stories for one day. You'd better get to Uin Nee to tell them I won't be requiring any more assistance for the time being. Oh, and by the way, thank you. I almost forgot to say that."},{"name":"UINNEE","text":"So, what did you end up doing? Picking grass? That sounds easy, even for a silly mortal like you! At least it didn't tax that head of yours too much."},{"name":"UINNEE","text":"So, what did you end up doing? Picking grass? That sounds easy, even for a silly mortal like you! At least it didn't tax that head of yours too much."},{"name":"UINNEE","text":"Most importantly, the sheep seemed pleased with the food you brought them. If we ever need any more, we'll know who to ask!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}