{"quest":{"name":"The Big Sleep","location":"Il Mheg","id":69235,"patch":5.1,"sort":17,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee does not like to be kept waiting, especially when there is frolicking to be done.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Search for the sleepy pixie near Mithai Glorianda.","Speak with Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Oh dear, dear, dear! At this rate, the children will wake up before we get there!"},{"name":"UINNEE","text":"It's my friend, you see. We made a promise to go frolicking in Lyhe Mheg, but they're nowhere to be seen! They must've fallen asleep! Can you believe it!?"},{"name":"UINNEE","text":"Hmph! I'd better stay here on the off chance they come looking for me. What I need is someone to go and find them in my stead... And who else would show up just in time but my favorite mortal! Well then, off you go!"},{"name":"SLEEPINGPIXIE03699","text":"Unnnh... Just forty more winks... &lt;snore&gt;"},{"name":"SLEEPINGPIXIE03699","text":"Sleep first, frolic later... &lt;snore&gt;"},{"name":"SLEEPINGPIXIE03699","text":"Not the beavers! Not the beavers! &lt;snore&gt;"},{"name":"SYSTEM","text":"Although you have found the sleeping pixie, they show no signs of waking up any time soon."},{"name":"UINNEE","text":"You found them! That's terrific! So...where are they?"},{"name":"UINNEE","text":"Hmm... Such a deep sleep can only mean one thing. They'll probably be returning to Glorianda any day now."},{"name":"UINNEE","text":"What are you looking at me like that for? Must I explain everything? &lt;sigh&gt; Very well."},{"name":"UINNEE","text":"You see, even we pixies don't know where we come from. One day we simply awaken─with a poof, or so I like to think! We're alive! And then eventually we lie down to go to sleep and simply fade away..."},{"name":"UINNEE","text":"Some say we pass into a never-ending dream, where we return to Glorianda, the legendary Forebear of Pixies."},{"name":"UINNEE","text":"Or maybe that sleepyhead is just being lazy! Anyway, I've got plenty to keep me busy while I wait for them to wake up, like sending silly mortals running here, there, and everywhere to carry out my bidding! Muahahaha!"},{"name":"UINNEE","text":"Pixies who sleep for too long sometimes fade away into their dreams, where they return to Glorianda. That silly so-and-so has been going to Mithai Glorianda rather frequently, so maybe their time has come?"},{"name":"UINNEE","text":"Not that it's any of my concern. I just don't like to be kept waiting! But you'll keep me amused in the meantime, won't you?"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}