{"quest":{"name":"Of Marvelous Mallow","location":"Il Mheg","id":69232,"patch":5.1,"sort":14,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee will never tire of dreaming up new tasks for their favorite mortal.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Obtain tufts of miniature mallow from near Lyhe Ghiah.","Deliver the tufts of miniature mallow to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Oh, hello there, <span class=\"highlight\">Forename</span>! Apropos of absolutely nothing, have you ever been to Lyhe Ghiah? It's a most wonderful place, home to a magnificent castle and lovely balls of fluffy mallow that float up and down, to and fro in the gently rustling winds."},{"name":"UINNEE","text":"Well, I was thinking about what I could do to make the children's dreams that much sweeter, and that's when it hit me with all the force of a giant fluffball! I could fill them with poofy, puffy mallow! Wouldn't that just be the most delightful dream ever? Of course it would!"},{"name":"UINNEE","text":"But to do that I'll need tufts of mallow, and I simply couldn't bear to take time out of my dreamspinning duties to flutter all the way over to Lyhe Ghiah! After all, what would the children do without me? It's a good thing you came here to offer your aid! That <span class=\"emphasis\">is</span> why you came here, isn't it?"},{"name":"UINNEE","text":"Welcome back! Are those tufts of mallow bursting from your pocket, or are you just happy to see me? Or is it both? It's definitely both, isn't it?"},{"name":"UINNEE","text":"I knew I could count on you. And just look at these fluffy little tufts! They might not strike you as much now, but once I've worked my magic, they'll sprout into airy balls of fantastic fluff fleecier than the thickest sheep's wool!"},{"name":"UINNEE","text":"Yes, my dreamers will just love floating through the sky on massive clouds of mallow! Why, I'd even like to try it myself! Not that there's anything wrong about flying with good old-fashioned wings, of course. All the flitting and fluttering just gets a bit tiring from time to time, that's all. &lt;yawn&gt; I think I've earned myself a rest!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}