{"quest":{"name":"Pure Imagination","location":"Il Mheg","id":69238,"patch":5.1,"sort":20,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee is expecting the unexpected.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Investigate the designated location.","Report to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"I've been trying to come up with new ways to help the children have fun and memorable dreams, but I'm struggling to come up with any ideas."},{"name":"UINNEE","text":"Ah! That's it! I'm thinking about this too much. I need something unexpected, something spontaneous. After all, dreams are by their very nature unpredictable! And I think I know the perfect place to search for inspiration."},{"name":"UINNEE","text":"The rivers that flow from the east carry a whole hodgepodge of things from other lands, which collects in the waterfalls. Why not go and see what you can find?"},{"name":"UINNEE","text":"I could go myself, but I wouldn't want to deprive you of the chance to prove your usefulness. There's junk to be collected, so you'd best get to it!"},{"name":"UINNEE","text":"I'm not looking for anything in particular, I just need ideas!"},{"name":"SYSTEM","text":"You find a porcelain fragment!"},{"name":"SYSTEM","text":"You find an oddly smooth branch!"},{"name":"SYSTEM","text":"You find a fruit of the forest!"},{"name":"SYSTEM","text":"A phooka comes tumbling out of nowhere!"},{"name":"UINNEE","text":"So, did you come across anything surprising?"},{"name":"UINNEE","text":"Hmm... That's a fine piece of...whatever it is. Porcelain, I think. Yes! I can transform it into a cup and host a tea party! We might need more than one cup, though."},{"name":"UINNEE","text":"A branch? Not quite as unusual as I was hoping for, I must say. Bits of wood like this are rather commonplace in Il Mheg, you know. Still, it's about the right size for a magic wand. Perhaps the children can pretend to be wizards!"},{"name":"UINNEE","text":"What's this? Fruit of some description? I can't tell a pixieberry from my elbow, I have to say. Ah! If we plant this, it can grow into a great big tree, and we can make a treehouse!"},{"name":"UINNEE","text":"Eh? A phooka nearly fell on you!? Rather you than me!"},{"name":"UINNEE","text":"Still, it was worth all the trouble! It's strange to think something so mundane could lead to such a fantastic idea! Of course, we have my imagination to thank for that. Honestly, where would you be without me?"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}