{"quest":{"name":"The Once and Future Marchioness","location":"Il Mheg","id":69244,"patch":5.1,"sort":26,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee has another brilliant idea for improving Lyhe Mheg.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Gather marchioness's marchers near the March of the Marchioness.","Deliver the marchioness's marchers to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Oh, the marchioness! Hers would be just the thing!"},{"name":"UINNEE","text":"And why are you looking at me like that? The marchioness, the marchioness! You know─the big, flowery tree that looks like it's probably in charge of all of the other flowers? Her little subjects would be the perfect addition to Lyhe Mheg, and you know it!"},{"name":"UINNEE","text":"The children of Amh Araeng have so few opportunities to see flowers in bloom, after all. But the Dreamspinners can make anything possible! And I intend to prove it! With flowers! So do try to keep up."},{"name":"UINNEE","text":"We'll need at least three blooms from the March if we're to properly decorate Lyhe Mheg. And make sure you get positively lovely ones. I <span class=\"emphasis\">will</span> mock you for having bad taste if you don't!"},{"name":"UINNEE","text":"You have them? Very well, then, prepare to be judged! They had better be delightful..."},{"name":"UINNEE","text":"Oh, they're perfect! I knew you'd have impeccable taste, darling mortal."},{"name":"UINNEE","text":"The marchioness was once a darling mortal herself, you know. Oh yes. She led her troops to protect the land that she loved so very much. When the eaters came, she fought till the bitter end, though her face was a mask of blood and tears..."},{"name":"UINNEE","text":"And when she could fight no more, we pixies turned her into a tree! So that she could live on, form as grand and beautiful as her spirit. I'm sure she appreciated it. Otherwise, why would she bloom so brightly?"},{"name":"UINNEE","text":"Never you mind all of that, though. We have flowers to plant and dreams to spin!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}