{"quest":{"name":"Pebble without a Cause","location":"Il Mheg","id":69240,"patch":5.1,"sort":22,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee hopes to bring a touch of opulence to Lyhe Mheg.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Obtain a shiny pebble southeast of the Bookman's Shelves.","Deliver the shiny pebble to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Rubies! Emeralds! Sapphires! Oh, how they sparkle! Not that we have many chances to see them here in Il Mheg. From what I hear, they're very valuable, which must be why the scavengers work so hard to dig them up."},{"name":"UINNEE","text":"That's given me another brilliant idea! We should decorate Lyhe Mheg with jewels of our own!"},{"name":"UINNEE","text":"Of course, we don't need to go through all the trouble of finding real gemstones, just something with a vague resemblance. Our magic will do the rest!"},{"name":"UINNEE","text":"You look like you've got time to spare. Why don't you make yourself useful and collect some nice, shiny pebbles for me?"},{"name":"UINNEE","text":"There should be some down by the lake. And if you see any Fuath, give them a whack from me!"},{"name":"UINNEE","text":"Come on then, hand it over!"},{"name":"UINNEE","text":"Well, it's a bit plain, but I suppose it'll do. I might even be able to turn pebbles like these into gold coins, so the children can see how it feels to be rich!"},{"name":"UINNEE","text":"Of course, it will all disappear when they wake up, but they can enjoy it while the dream lasts. Even if they're penniless in real life, they'll live like royalty in Lyhe Mheg!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}