{"quest":{"name":"Not the Beavers","location":"Il Mheg","id":69243,"patch":5.1,"sort":25,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee eagerly awaits a delivery of flowers, and slightly less eagerly awaits the return of a friend who may have met a terrible fate.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the flower-picking pixie in the east of Phisor Lran and throw porxies to scare off any threats.","Speak with Uin Nee."],"dialogue":[{"name":"UINNEE","text":"<span class=\"highlight\">Forename</span>, I need your help! My friend went to pick flowers a while ago, but no one has seen hide nor hair of them since!"},{"name":"UINNEE","text":"I suspect it was the work of─ No, it's too soon to say for certain."},{"name":"UINNEE","text":"The best thing to do is send out a search party, consisting of...well, you of course!"},{"name":"UINNEE","text":"You should probably start looking where all the prettiest flowers grow, which would be east of Phisor Lran. And if it's what I think it is, be prepared for an epic encounter that will shake the heavens! Or at least cause them to wobble a bit..."},{"name":"PICKFLOWERPIXIE","text":"Sorry, but as you can see, I'm rather busy. Or perhaps you're here to help?"},{"name":"PICKFLOWERPIXIE","text":"Uin Nee was worried about me? I'm quite safe, I assure you! And if anything were to disturb me, these porxies will send them on their merry way!"},{"name":"PICKFLOWERPIXIE","text":"But since you've come all the way here, perhaps you could watch my back while I carry on picking flowers? On the off chance that any beasties show, throw one of my adorable companions at them!"},{"name":"SYSTEM","text":"If any enemies appear, throw a porxie at them. You may move the camera, as well as zoom in and out. Target the enemy and throw a porxie with <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\"></span></span><span class=\"alternative\">[???] / [???]</span></span>."},{"name":"PICKFLOWERPIXIE","text":"Aaaaaaiiieee!"},{"name":"PICKFLOWERPIXIE","text":"(-Another Flower-picking Pixie-)That's odd... Did you see another pixie picking flowers here? No? Oh, well. I'll just have to finish the job by myself! Tra-la-la!♪"},{"name":"PICKFLOWERPIXIE","text":"Phew! That should be enough for the time being. So, was there any trouble? No? Jolly good. Thanks for keeping an eye out for me. Ta-ta for now!"},{"name":"UINNEE","text":"So, you made it back, at least."},{"name":"UINNEE","text":"Though to be honest, I don't have much hope of ever seeing my friend again. Do you know what happened to them?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You'd better ask the beavers."},{"name":"A1","text":"Some things are best left a mystery."},{"name":"A1","text":"Even when I close my eyes, I can still see the...the beavers."},{"name":"UINNEE","text":"No, not the beavers! Don't let their appearance fool you; there is no greater evil in all of Il Mheg than those long-toothed horrors."},{"name":"UINNEE","text":"That's fine. I'd already jumped to my own conclusions anyway!"},{"name":"UINNEE","text":"Oooh! It sounds like you'll be having some fantastic nightmares! If you ever manage to sleep again, that is."},{"name":"UINNEE","text":"In any case, it sounds like the flower collection is proceeding apace, and we'll soon be able to decorate Lyhe Mheg with beautiful flowers. And if we have to lose a pixie or three in the process, so be it!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}