{"quest":{"name":"No Grown-ups Allowed","location":"Il Mheg","id":69247,"patch":5.1,"sort":29,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee has a surprisingly thoughtful concern.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Search for giant mushroom spawn in Father Collard's Chambers.","Deliver the giant mushroom spawn to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Tell me, my favorite mortal, have you ever had a hideout? Mortal children seem to love them, so I thought─why not try it out? Then I hid in a log for five days and five nights, and no one found me. It was <span class=\"emphasis\">amazing</span>! Then I got bored, so I came back."},{"name":"UINNEE","text":"Anyway, while I was there, it occurred to me that the children in the Rak'tika Greatwood aren't usually allowed to leave their villages. And that means that they can't make hideouts! I mean, sure, they could hide <span class=\"emphasis\">in</span> the village, but people would find them."},{"name":"UINNEE","text":"And it doesn't count if other people can find it, right? Right!? If any old adult can stumble across it, that's not a hideout, that's just <span class=\"emphasis\">sad</span>."},{"name":"UINNEE","text":"I decided right then and there that I would dream up a perfect hiding place for those poor little darlings. And what better to make it from than one of those giant mushrooms the Nu Mou live in? Nothing! There's nothing better. It was a rhetorical question."},{"name":"UINNEE","text":"Tragically, Father Collard's Chambers is absolutely swarming with the lawless ones, which makes it impossible to harvest mushroom spawn. If something isn't done, my brilliant plan will never come to fruition, and...I'm sure you can see where this is going. Do it for the children!"},{"name":"BALLOON","text":"Halt! Who dares lay hands on our fungi?"},{"name":"UINNEE","text":"Oh, there you are! You know, I realized after you left that I didn't tell you how to tell one mushroom spawn from another. I do hope you figured it out!"},{"name":"UINNEE","text":"Oh, well done! Such a clever mortal you are. We should be able to grow this one nice and tall, then pop it into a dream, and...voilà! Greatest hideout ever. We don't even need to put it in a dank old cave! Imagine the possibilities..."},{"name":"UINNEE","text":"Wait─I don't have to imagine them! I can make them. Haha, fantastic!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}