{"quest":{"name":"A Porxie Before Swine","location":"Il Mheg","id":69249,"patch":5.1,"sort":31,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee appears even more restless than usual, which should be cause for no small amount of alarm.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Defeat the Nu Mou porxienappers in Sextuplet Shallow.","Aid the trembling porxie.","Report to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Well, favorite mortal, we <span class=\"emphasis\">could</span> be frolicking with porxies in dreams right now. But nooo! Those awful, nasty lawless ones just had to go and make off with the one I ordered from Pla Enni, so both I <span class=\"emphasis\">and</span> the dreams are...porxieless!"},{"name":"UINNEE","text":"Ugh! Ugh, I say! Oooh, when I get my hands on those porxienappers..."},{"name":"UINNEE","text":"Wait! I don't need to get my hands on them! Because we have your much larger hands! Good, good. Go and punch a porxienapper in the face for me, mortal!"},{"name":"SYSTEM","text":"The porxie is considerably calmed by your ministrations. After sparing you an affectionate snort, it turns toward Lydha Lran."},{"name":"UINNEE","text":"Safe and sound! And round! And cute! Exactly what I was hoping for! I can spin the loveliest of dreams with a porxie so charming..."},{"name":"UINNEE","text":"&lt;sigh&gt; But first I suppose I should inform the Nu Mou in Pla Enni that it arrived safely after all. They were so very <span class=\"emphasis\">anxious</span> about it. Some fae really need to learn to calm down, if you ask me..."}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}