{"quest":{"name":"Pride-and-Seek","location":"Il Mheg","id":69248,"patch":5.1,"sort":30,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee is ostensibly practicing hiding and seeking, though they don't appear to be trying particularly hard at either at the moment.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["With the chat mode in <span class=\"highlight\">Say</span>, enter “Beaver” to let the pixie hiding in Pla Enni know that the game is up.","Speak with Uin Nee."],"dialogue":[{"name":"UINNEE","text":"You found me! Oh, wait─it wasn't my turn to hide... Or was it?"},{"name":"UINNEE","text":"Hiding and seeking are both just too much fun! Especially with the little dreamers. Why, it's <span class=\"emphasis\">so</span> much fun that sometimes, I forget that they're meant to wake up!"},{"name":"UINNEE","text":"Those little ones from the Rak'tika Greatwood, though, are far too good at this! And we <span class=\"emphasis\">can't</span> keep letting them win─we have a reputation to uphold. That's why we've been training day and night! Mostly day, though. Do you want to join us?"},{"name":"UINNEE","text":"I'll let you have my turn as seeker, then! Do you know what to do when you've found someone? Sneak right up behind them and yell “Beaver”! ...Well, the sneaking and yelling are optional, but it's much more fun if you <span class=\"emphasis\">really</span> scare the wings off of them!"},{"name":"KAKUREINOTIPIXIE","text":"Goodness me, Uin Nee is worse at this than I thought! Maybe I'll have a nap..."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Beaver” to let the concealed pixie know that the game is up."},{"name":"KAKUREINOTIPIXIE","text":"Augh! Who are you!?"},{"name":"KAKUREINOTIPIXIE","text":"Uin Nee got a mortal to do their dirty work, did they? Hmph, you don't scare me! Not like those Viis children..."},{"name":"UINNEE","text":"Well? Well!? Did you find them?"},{"name":"UINNEE","text":"You did! I knew you would─you're such a clever mortal. And now I'm going to show them how it's done! Just as soon as I remember whether I was hiding or seeking."},{"name":"UINNEE","text":"Once we've had a bit more practice, those children won't stand a chance! Muahahaha!"},{"name":"SAYTODO","text":"Beaver"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}