{"quest":{"name":"There's Always a Stupider Fish","location":"Il Mheg","id":69241,"patch":5.1,"sort":23,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee's latest scheme is even fishier than usual.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Check the fish trap at the designated location.","Deliver the fish-filled trap to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Tyr Beq tells me that the land called “Amh Araeng” is nothing like Il Mheg. It's a dry, hot place where hardly anything grows. No flowers, no rivers, no lakes!"},{"name":"UINNEE","text":"Some of the children there have never even <span class=\"emphasis\">seen</span> a fish before! Imagine that! And yes, I think we both know where this is going..."},{"name":"UINNEE","text":"That's right! I want you to bring me a fish to show the children in the Garden of Dreams. A nice, pretty one with shiny scales!"},{"name":"UINNEE","text":"Now, this level of preparedness may come as a surprise, but I've already had one of my underlings set a trap down in Deepwood Swim. Much easier than messing about with hooks and whatnot. All you have to do is go and see if we've caught anything!"},{"name":"UINNEE","text":"So? What have you got for me?"},{"name":"UINNEE","text":"Oh, yes. These are...rainbowy twinkle trout. That's what we'll call them. I have big plans for you, little ones! You won't be swimming in boring old water like all the other fish, you'll be soaring through the skies of Lyhe Mheg!"},{"name":"UINNEE","text":"And if we catch some more of these, they can all fly together to make a giant fish-rainbow! Ha ha! It's no wonder everyone thinks I'm a genius!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}