{"quest":{"name":"What the Phooka","location":"Il Mheg","id":69246,"patch":5.1,"sort":28,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee is practically vibrating with excitement.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Use a voluminous sack on the trapped phooka.","Use a voluminous sack on the other trapped phooka.","Deliver the stuffed sacks to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Phookai! Everyone loves a good phooka! Those wide, staring eyes, that vaguely menacing hopping... Ah, you never know if they want to hug you or murder you! Adorable! And there are plenty to be found around Lyhe Ghiah."},{"name":"UINNEE","text":"A fantastic idea for what to spin next, I'm sure you agree! In fact, I was <span class=\"emphasis\">so</span> sure that I've already set up the traps!"},{"name":"UINNEE","text":"I went through quite a hunting-and-trapping phase a while back, so I'm something of an expert on the subject. My strategically placed pits are guaranteed to have caught us something, so all you need to do is head over and retrieve our prizes!"},{"name":"UINNEE","text":"Now, phookai do tend to get a bit bitey when cornered, but worry not─I've prepared these enormous sacks! Just shove them in before they can figure out what's happening to them, and there should be no problem. Brilliant, I know!"},{"name":"UINNEE","text":"Ah, I see the sacks came in handy! You're welcome!"},{"name":"UINNEE","text":"Those traps aren't all that hard to get out of, you know. I think even phookai might manage it, if they could focus long enough. But they just don't have the attention span. Poor things..."},{"name":"UINNEE","text":"One dove in headfirst, you say? Ahahaha! How delightful! I wonder why it did that. I don't suppose you speak phooka, by chance? No?"},{"name":"UINNEE","text":"Ah, well. Now that we have our phookai, though, the fun can begin! ...Or it could, if I had decided what sort of dream to spin. What do you think?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Feral phookai make for a weird enough dream on their own."},{"name":"A1","text":"You could put them in an arena, maybe."},{"name":"UINNEE","text":"True! Just look at their funny little faces! And it <span class=\"emphasis\">is</span> important to appreciate the simple things in life."},{"name":"UINNEE","text":"Ah, and that's why you're my favorite mortal! What an amusing suggestion. Do you think they'd actually fight, or just sort of...blink at each other? Either way, it's perfect!"},{"name":"UINNEE","text":"It's time for me to get to spinning, then! Don't worry─I will absolutely, positively let you know how it goes next time we speak!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}