{"quest":{"name":"Heads, I Win","location":"The Copied Factory","id":69257,"patch":5.1,"sort":200,"icon":100947,"unlocksFunction":1,"eventIcon":71341,"issuer":1032229,"target":1032227,"genre":24,"journal":["Konogg is ready to proceed...with caution.","Konogg asks whether you will support him in keeping whatever you discover in your search for the so-called “key” secret from 2P should she be restored to functionality. Though the point is largely moot until such a time arrives, you agree to follow his lead and set off to search the ruins without further ado.","You catch up to Konogg, who, despite some trepidation, suggests that you once again use the pods to press further into the factory. Admittedly, no alternative has presented itself since your foray with 2P, so you have no choice but to cling to one of the pods for dear life and allow it to whisk you away.","Deeper inside the ruins, Konogg instructs you to use the mysterious tetrahedral devices positioned throughout to teleport to the entrance should you wander too far. Thus equipped with contingency measures, you are free to begin searching for the mysterious key.","A cursory search of the factory yields a hunk of metal that you deem worthy of note. It would be best to get a second opinion from Konogg, however, lest you find yourself lugging around a hundred ponzes of useless garbage.","Fortunately, Konogg, too, believes that what you found may be a piece of the all-important key. If you locate the others, the siblings may be able to reassemble it.","Further inspection of the area yields not only what you believe to be two more pieces of the key, but also a pod─albeit one that has seen better days. The dwarven duo will be delighted.","Forcibly inserting herself into the discussion as soon as it becomes apparent that you've found something of worth, Anogg declares the array of parts you have collected sufficient to bring back for inspection and possible reconstruction. She also takes an interest in the pod, though its sudden return to functionality puts something of a damper on her plans to fiddle with its innards, and a clever device of her own design soon reveals a third exciting discovery─the motionless form of 9S, who, like 2P, must have lost the ability to function after your pitched battle. Though Anogg is willing to cooperate with 2P, that willingness evidently does not extend to outright trust, as she opts to keep 9S both intact and secret from the other android.","Now with plenty of new toys to play with, Anogg and Konogg withdraw to the tunnels to examine your finds in greater detail. You may join them whensoever you are convinced that there are no more secrets worth finding in the immediate vicinity.","In the excavation tunnels, you speak with Anogg, who has been working to piece together the components you gathered. Unfortunately, there is no means of knowing whether her efforts have met with success until the pod has completed its analysis. Stymied, she reluctantly decides to set to work studying the other data collected within the ruins instead, and asks that you ensure that the dig site chief will not interfere with the twins' research.","You speak with the dig site chief, who is shockingly amenable to the idea of letting Anogg and Konogg continue their investigation─perhaps in part because the alternative is getting involved in the messy business himself. Still, he vouches for their technical competence, so you may have confidence that the secrets of the ruins will be revealed in due course."],"objectives":["Speak with Konogg in the Copied Factory.","Speak with Konogg again.","Search for artifacts in the factory.","Deliver the part to Konogg.","Search for more parts in the factory.","Deliver the parts and pod to Konogg.","Speak with Anogg.","Speak with Anogg in the excavation tunnels.","Speak with the dig site chief."],"dialogue":[{"name":"KONOGG","text":"There's no point in arguing further─she's immune to reason when she gets like this."},{"name":"KONOGG","text":"I'm happy to continue investigating─of course I am, that's why we've gone to all of this trouble─but we need to be careful as to how we go about it. Especially where 2P is concerned."},{"name":"KONOGG","text":"I don't trust her─at least not yet. Even should we find this “key,” we ought to be discreet as possible about sharing our plans and information. Don't you agree?"},{"name":"SYSTEM","text":"Should you give your support to Konogg's approach, Anogg's path will no longer be available to you."},{"name":"SYSTEM","text":"Please note, however, that your choice will not affect the rewards and challenges to come."},{"name":"Q2","text":"Support Konogg's approach?"},{"name":"KONOGG","text":"Indeed. I knew you'd have the sense to listen to me. Now, let's get started, shall we?"},{"name":"KONOGG","text":"I don't like relying on this place's internal mechanisms, particularly to dangle me over a gaping chasm, but it seems we have little choice. Maybe if I close my eyes..."},{"name":"KONOGG","text":"Before we proceed, we should decide upon what to do in the event that we become lost in this maze of a place."},{"name":"KONOGG","text":"These teleportation devices should serve. If you can't find your way back to me, use one to return to the entrance immediately. I'll meet you there."},{"name":"KONOGG","text":"Got it? I'd hate to lose our muscle because you wandered off and fell into a pit somewhere."},{"name":"KONOGG","text":"Now you're free to take a look around. If you find anything noteworthy, bring it to me."},{"name":"KONOGG","text":"Found anything of note yet? Records, artifacts, weird puddles of goo?"},{"name":"KONOGG","text":"That's the look of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who's on to something! Do share."},{"name":"KONOGG","text":"Hmm... I'd bet that whatever this is, it's part of a greater whole."},{"name":"KONOGG","text":"Let's see if we can find any similar pieces. We may be able to reassemble it, if so."},{"name":"KONOGG","text":"You have more parts for me, I trust?"},{"name":"ANOGG","text":"Don't be a miser, now. Let me see them too!"},{"name":"ANOGG","text":"Oh, look at all of these parts! And this pod! I've been so wanting to take one of these apart..."},{"name":"KONOGG","text":"...Do you hear something?"},{"name":"POD","text":"Function resumed. Initiating repair process."},{"name":"POD","text":"Alert: multiple lifeforms detected in proximity."},{"name":"ANOGG","text":"“Lifeforms” would be us, I presume? Interesting."},{"name":"ANOGG","text":"If it's still functional, there's no need for me to disassemble it. Pity. Still, I say we take it back with us."},{"name":"ANOGG","text":"Oh! What's this?"},{"name":"KONOGG","text":"It's him! Though how he climbed back up here in that state..."},{"name":"KONOGG","text":"Well, Sister, you're the one who wanted to work with 2P. I'm sure she would say to destroy him for good. What do <span class=\"emphasis\">you</span> say?"},{"name":"ANOGG","text":"Oh, brother, you know me too well."},{"name":"ANOGG","text":"We take him with us, of course. Just in case. It'll be our little secret."},{"name":"ANOGG","text":"How's investigating with Konogg going for you? Slowly, I expect?"},{"name":"ANOGG","text":"Konogg and I will be heading back out. I want to perform a proper analysis on these parts as soon as possible."},{"name":"ANOGG","text":"I don't blame you if you want to look around a bit more first─though you had best share your findings!"},{"name":"KONOGG","text":"This may be the clue we've been searching for. I only hope it doesn't blow up in our faces...in any sense."},{"name":"ANOGG","text":"It's about time!"},{"name":"ANOGG","text":"You know those parts we found? Well, I've managed to cobble them together into a decent approximation of...something."},{"name":"ANOGG","text":"I was hoping that if I got the basics right, the pod could tell us what it's meant to be, but it won't stop repeating “processing” and beeping at me."},{"name":"ANOGG","text":"It worked when it was analyzing <span class=\"emphasis\">us</span>, so theoretically it should be up to the task, but it seems we'll have to wait for it to finish...whatever it is that it's doing."},{"name":"ANOGG","text":"I'm half-tempted to take my tools to it, but if I can't put it back together we'll be back to square one. So─patience it is. Hmph!"},{"name":"ANOGG","text":"In the meantime, we have quite a bit of other data to analyze. So much, in fact, that I'm certain we will need a considerable amount of time─uninterrupted time─to work. If you take my meaning."},{"name":"ANOGG","text":"I'm telling you to keep the chief off our backs for a while─I don't care how. Say that his house is on fire, if you like. Or put it to the torch, if you're not comfortable with lying."},{"name":"ANOGG","text":"We simply don't have the time for half a dozen lectures about “protocol” and “safety” and “ethics,” you understand?"},{"name":"KONOGG","text":"I thought that “key” was a figure of speech, but...it looks like it could potentially be an unlocking mechanism. If you squint."},{"name":"POD","text":"&lt;beep&gt; Processing..."},{"name":"KONOGG","text":"You heard Anogg: we're counting on you to keep the chief occupied so that we don't have to."},{"name":"DWARFMASTER03671","text":"Lali-mysterious machines from the ruins will kill us all-ho, I suppose."},{"name":"DWARFMASTER03671","text":"Sorry, it's...been a lot to take in. Did you manage to keep our local miscreants out of trouble?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"They're safely studying our discoveries as we speak."},{"name":"A1","text":"I found them to be surprisingly competent, actually."},{"name":"DWARFMASTER03671","text":"It's true that when it comes to mechanical contraptions, you'll find none cleverer than those two. Or more obsessive."},{"name":"DWARFMASTER03671","text":"If anyone's capable of solving the mystery of these ruins, it's them. Much as I hate to say this, we should leave them to their own devices. For now."}],"reward":{"gil":1455,"items":[{"id":28897}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69255]},"next":[69320]},"partials":[{"type":"npc","id":"1032229","obj":{"i":1032229,"n":"Konogg","l":3441,"q":1}},{"type":"npc","id":"1032227","obj":{"i":1032227,"n":"Dig Site Chief","l":2954,"q":15}},{"type":"item","id":"28897","obj":{"i":28897,"n":"Voice of no Return (Guitar) Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"69255","obj":{"i":69255,"n":"An Academic Dispute","g":24,"l":"Excavation Tunnels","s":30,"f":1}},{"type":"quest","id":"69320","obj":{"i":69320,"n":"Carnivals and Confrontations","g":24,"l":"Kholusia","s":300,"f":1}}]}