{"quest":{"name":"Tails, You Lose","location":"The Copied Factory","id":69256,"patch":5.1,"sort":100,"icon":100946,"unlocksFunction":1,"eventIcon":71341,"issuer":1032228,"target":1032227,"genre":24,"journal":["Anogg would dive headfirst into the great unknown.","Anogg asks sharply whether you will support her in following the instructions 2P gave, and continue to cooperate with the android should the so-called “key” you seek restore her to functionality. Though the point is largely moot until such a time arrives, you agree to follow her lead, and you set off to search the ruins without further ado.","You catch up to Anogg, who is considering using the pods to press further into the factory. Reluctant as one might be to place their life in the hands of a contraption described as “Not too murderous, comparatively speaking,” seeing as no alternative has presented itself since your foray with 2P, you have no choice but to cling to one of the pods for dear life and allow it to whisk you away.","Deeper inside the ruins, Anogg helpfully points out that as you are able to use the mysterious tetrahedral devices positioned throughout to teleport to the entrance at any time, there is no need to feel overly trepidatious whilst exploring this new territory. She expects you to take this as a cue to forge ahead heedlessly, it seems, but will likely not object to whatever approach you take so long as you find something of interest.","A cursory search of the factory yields a hunk of metal that you deem worthy of note. It would be best to get a second opinion from Anogg, however, lest you find yourself lugging around a hundred ponzes of useless garbage.","Fortunately, Anogg, too, believes that what you found may be a piece of the all-important key. If you locate the others, she may be able to reassemble it.","Further inspection of the area yields not only what you believe to be two more pieces of the key, but also a pod─albeit one that has seen better days. Anogg will be delighted.","Seeing the array of parts you have collected, Anogg declares them sufficient to bring back for inspection and possible reconstruction. She also takes an interest in the pod, though its sudden return to functionality puts something of a damper on her plans to fiddle with its innards, and a clever device of her own design soon reveals a third exciting discovery─the motionless form of 9S, who, like 2P, must have lost the ability to function after your pitched battle. Though Anogg is willing to cooperate with 2P, that willingness evidently does not extend to outright trust, as she opts to keep 9S both intact and secret from the other android without hesitation.","Now with plenty of new toys to play with, Anogg and Konogg withdraw to the tunnels to examine your finds in greater detail. You may join them whensoever you are convinced that there are no more secrets worth finding in this area of the factory.","In the excavation tunnels, you speak with Anogg, who has been working to piece together the components you gathered. Unfortunately, there is no means of knowing whether her efforts have met with success until the pod has completed its analysis. Stymied, she reluctantly decides to set to work studying the other data collected within the ruins instead, and asks that you ensure that the dig site chief will not interfere with the twins' research.","You speak with the dig site chief, who is shockingly amenable to the idea of letting Anogg and Konogg continue their investigation─perhaps in part because the alternative is getting involved in the messy business himself. Still, he vouches for their technical competence, so you may have confidence that the secrets of the ruins will be revealed in due course."],"objectives":["Speak with Anogg in the Copied Factory.","Speak with Anogg again.","Search for artifacts in the factory.","Deliver the part to Anogg.","Search for more parts in the factory.","Deliver the parts and pod to Anogg.","Speak with Anogg.","Speak with Anogg in the excavation tunnels.","Speak with the dig site chief."],"dialogue":[{"name":"ANOGG","text":"Don't fret about Konogg. He'll see that I'm right and come crawling back eventually."},{"name":"ANOGG","text":"There's so much that we could learn here. About these ruins, living machines... And 2P is the best source of information we've got. We need to seize this opportunity while we can."},{"name":"ANOGG","text":"So...are you coming, or what?"},{"name":"SYSTEM","text":"Should you give your support to Anogg's approach, Konogg's path will no longer be available to you."},{"name":"SYSTEM","text":"Please note, however, that your choice will not affect the rewards and challenges to come."},{"name":"Q2","text":"Support Anogg's approach?"},{"name":"ANOGG","text":"I knew it! Fortune favors the bold!"},{"name":"ANOGG","text":"These “pod” devices must be part of this place, but they don't seem to be particularly murderous, as far as things in here go. We should be able to use them to ferry us further in again."},{"name":"ANOGG","text":"Oh. Right. Before we go any further─you remember these odd boxes? They seem to enable aetheric transference."},{"name":"ANOGG","text":"If we get lost, it should be a simple matter to teleport back to the entrance using one of these, so don't worry your pretty head about becoming trapped down here. And with that said..."},{"name":"ANOGG","text":"Throw caution to the wind, and go forth and investigate!"},{"name":"ANOGG","text":"And the moment─the very <span class=\"emphasis\">instant</span> that you find something of note, make sure that you show it to me! Got it?"},{"name":"ANOGG","text":"Found anything mysterious yet? Records, or artifacts, or...I don't know, weird puddles of goo?"},{"name":"ANOGG","text":"You've found something, haven't you? Well!?"},{"name":"ANOGG","text":"Hmm... I'd bet that whatever this is, it's part of a greater whole."},{"name":"ANOGG","text":"Let's see if we can find any other pieces. I might be able to reassemble it...if I had any idea what it's meant to be."},{"name":"ANOGG","text":"Have you found me some more parts?"},{"name":"ANOGG","text":"Oh, look at all of these! Hard to say for sure whether we have everything until we take a crack at reassembling it, of course, but it's a start."},{"name":"ANOGG","text":"And this pod! I've been so wanting to take one of these apart..."},{"name":"KONOGG","text":"...Do you hear something?"},{"name":"POD","text":"Function resumed. Initiating repair process."},{"name":"POD","text":"Alert: multiple lifeforms detected in proximity."},{"name":"ANOGG","text":"“Lifeforms” would be us, I presume? Interesting."},{"name":"ANOGG","text":"If it's still functional, there's no need for me to disassemble it. Pity. Still, I say we take it back with us."},{"name":"ANOGG","text":"Any objections? No, of course not! So let's get on with it."},{"name":"ANOGG","text":"Oh! What's this?"},{"name":"KONOGG","text":"It's him! Though how he climbed back up here in that state..."},{"name":"KONOGG","text":"Well, you're the one who wanted to work with 2P. I'm sure she would say to destroy him for good. What do <span class=\"emphasis\">you</span> say?"},{"name":"ANOGG","text":"Oh, Brother, you know me too well."},{"name":"ANOGG","text":"We take him with us, of course. Just in case. It'll be our little secret."},{"name":"KONOGG","text":"I trust your investigation is going well?"},{"name":"ANOGG","text":"Konogg and I will be heading back out. I want to perform a proper analysis on these parts as soon as possible."},{"name":"ANOGG","text":"I don't blame you if you want to look around a bit more first─though you had best share your findings!"},{"name":"KONOGG","text":"This may be the clue we've been searching for. I only hope it doesn't blow up in our faces...in any sense."},{"name":"ANOGG","text":"It's about time!"},{"name":"ANOGG","text":"You know those parts we found? Well, I've managed to cobble them together into a decent approximation of...something."},{"name":"ANOGG","text":"I was hoping that if I got the basics right, the pod could tell us what it's meant to be, but it won't stop repeating “processing” and beeping at me."},{"name":"ANOGG","text":"It worked when it was analyzing <span class=\"emphasis\">us</span>, so theoretically it should be up to the task, but it seems we'll have to wait for it to finish...whatever it is that it's doing."},{"name":"ANOGG","text":"I'm half-tempted to take my tools to it, but if I can't put it back together we'll be back to square one. So─patience it is. Hmph!"},{"name":"ANOGG","text":"In the meantime, we have quite a bit of other data to analyze. So much, in fact, that I'm certain we will need a considerable amount of time─uninterrupted time─to work. If you take my meaning."},{"name":"ANOGG","text":"I'm telling you to keep the chief off our backs for a while─I don't care how. Say that his house is on fire, if you like. Or put it to the torch, if you're not comfortable with lying."},{"name":"ANOGG","text":"We simply don't have the time for half a dozen lectures about “protocol” and “safety” and “ethics,” you understand?"},{"name":"KONOGG","text":"I thought that “key” was a figure of speech, but...it looks like it could potentially be an unlocking mechanism. If you squint."},{"name":"POD","text":"&lt;beep&gt; Processing..."},{"name":"KONOGG","text":"You heard Anogg: we're counting on you to keep the chief occupied so that we don't have to."},{"name":"DWARFMASTER03671","text":"Lali-mysterious machines from the ruins will kill us all-ho, I suppose."},{"name":"DWARFMASTER03671","text":"Sorry, it's...been a lot to take in. Did you manage to keep our local miscreants out of trouble?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"They're safely studying our discoveries as we speak."},{"name":"A1","text":"I found them to be surprisingly competent, actually."},{"name":"DWARFMASTER03671","text":"It's true that when it comes to mechanical contraptions, you'll find none cleverer than those two. Or more obsessive."},{"name":"DWARFMASTER03671","text":"If anyone's capable of solving the mystery of these ruins, it's them. Much as I hate to say this, we should leave them to their own devices. For now."}],"reward":{"gil":1455,"items":[{"id":28897}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69255]},"next":[69320]},"partials":[{"type":"npc","id":"1032228","obj":{"i":1032228,"n":"Anogg","l":3441,"q":2}},{"type":"npc","id":"1032227","obj":{"i":1032227,"n":"Dig Site Chief","l":2954,"q":15}},{"type":"item","id":"28897","obj":{"i":28897,"n":"Voice of no Return (Guitar) Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"69255","obj":{"i":69255,"n":"An Academic Dispute","g":24,"l":"Excavation Tunnels","s":30,"f":1}},{"type":"quest","id":"69320","obj":{"i":69320,"n":"Carnivals and Confrontations","g":24,"l":"Kholusia","s":300,"f":1}}]}