{"quest":{"name":"Snot My Problem","location":"Il Mheg","id":69250,"patch":5.1,"sort":32,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee has porxie problems.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Lugg Aenc.","Direct the porxie to use Siphon Snout on Voeburtwort in southern Pla Enni.","Report to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Mortal! Our nectar porxie has a problem! And the porxie's problem is making the porxie itself a problem! For me!"},{"name":"UINNEE","text":"I think its nose is stuffed. I keep pointing it at the flowers, but it only bumps its face into them. Repeatedly. Without siphoning a single drop of nectar!"},{"name":"UINNEE","text":"Can you take it out to sniff some Voeburtwort? The Nu Mou are always telling me how it clears the sinuses─and they would know!"},{"name":"UINNEE","text":"I would go myself, but I'd really rather not. It's rather...snotty. I've given it over to Lugg Aenc to deal with for now."},{"name":"LUGGAENC","text":"I am told that you are here to take the porxie out for a good nasal clearing? Wonderful. I'm sure that will come as something of a relief to it─the herbs and the respite from Uin Nee both."},{"name":"LUGGAENC","text":"You need only guide it toward the fresh Voeburtwort that grows wild near Pla Enni. The plants shall do the rest."},{"name":"LUGGAENC","text":"Yes, the porxie returned safely. It still appears to have something of an issue with discerning scents, however. Tried to eat my satchel. You may need to have another go at the Voeburtwort."},{"name":"SYSTEM","text":"The porxie unceremoniously snorts sprigs of Voeburtwort into both nostrils and, after a moment, sneezes out a large quantity of snot. Presumably this is a good sign."},{"name":"SYSTEM","text":"The porxie inhales deeply, accidentally sucking a few herbs and grasses into its nose. However, it does seem to be breathing more freely now."},{"name":"SYSTEM","text":"The Voeburtwort is indeed quite fragrant, and you feel your sinuses clearing instantaneously. Guide the suffering porxie to experience the same sweet relief."},{"name":"UINNEE","text":"Thank you for taking care of that disgusting issue! I'll admit, when we shoved all of that stuff up its nose, I didn't expe─"},{"name":"UINNEE","text":"Oh, come to think of it, I neglected to explain, didn't I? You see, I took the porxie into the Garden of Dreams so that the children could play with it. But, well, they discovered that it could inhale just about anything, and one thing led to another..."},{"name":"UINNEE","text":"Ah, it was hilarious! You should join us next time! ...What?"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}