{"quest":{"name":"The Chaser","location":"Il Mheg","id":69252,"patch":5.1,"sort":34,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee wants help in testing a new love potion. What could possibly go wrong?<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Test the fake true love potion on the dozing Nu Mou in Pla Enni.","Report to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Dearest mortal, is there anything more tragic than unrequited love? Nay! Nay, says I! Oh, the heartbreak! The pining! The woe! How could anyone with a shred of compassion in their heart ignore a mortal so besieged by melancholy longings!?"},{"name":"UINNEE","text":"Not me! And that's why I made a love potion! Well, a dream love potion. A real one would be downright creepy! We fae do have some scruples, you know."},{"name":"UINNEE","text":"The problem is, I'm new to all of this alchemy nonsense, and I have no idea if my potion will work! I keep trying to sneak up on sleeping Nu Mou to test it, but it's like they can smell me coming!"},{"name":"UINNEE","text":"I'm sure that you could manage it, though! And I <span class=\"emphasis\">know</span> you wouldn't want to stand in the way of true love! Well, fake true love. Well, dream fake true love. Anyway! Go and test the potion!"},{"name":"NUMOU03716","text":"No... Stop eating...my house... &lt;snore&gt;"},{"name":"NUMOU03716","text":"Wha─!?"},{"name":"NUMOU03716","text":"Goodness, if it isn't the very hero who restored to us the night!"},{"name":"NUMOU03716","text":"What brings you here today? And looking so lovely, I might add! Yes... I daresay I've never seen such a divine visage in all my life..."},{"name":"NUMOU03716","text":"W-Wait! I didn't mean to express my undying affectio─ Oh no! I've done it again!"},{"name":"NUMOU03716","text":"Please, um... Please read this, when you have a moment. Which will likely be never, as I'm sure you're most busy being clever and courageous and─ Er, forget that I said anything!"},{"name":"NUMOU03716","text":"Oh, I knew the leafmen would come for me! It was only a matter of time!"},{"name":"UINNEE","text":"You tested it? And? And!?"},{"name":"UINNEE","text":"Oooh, a letter written in fae! Let me see!"},{"name":"UINNEE","text":"Hmm... Oh <span class=\"emphasis\">dear</span>... Well, that's─ Oooh. And... Ahahaha! Haha... Oh, that doesn't even rhyme! HahahaHAHAHA!"},{"name":"UINNEE","text":"Haha... &lt;wheeze&gt; Ahem! You probably shouldn't look at this. It's <span class=\"emphasis\">painfully</span> embarrassing. For them, and also for you. But don't worry─the potion will wear off after a while, and they won't remember a thing!"},{"name":"UINNEE","text":"It looks like I might need to water it down a bit for next time, though. There's smitten, and then there's...whatever in the name of Titania that drivel was supposed to be. Back to the cauldron I go!"},{"name":"UINNEE","text":"Huh. That's interesting. Now, if they had seen an irresistibly attractive leafman, it might still be usable, but that doesn't seem to be the case..."},{"name":"UINNEE","text":"Maybe it didn't work because Nu Mou are too different from you mortals? Or maybe that specific Nu Mou has a bizarre fixation on leafmen! I could check their dreams to make sure, but I'm a little afraid of what I might find..."},{"name":"UINNEE","text":"Best to try a different formula, I think! I can count on you to test a new batch when I'm done, right? Of course I can!"}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}