{"quest":{"name":"Aim High","location":"Il Mheg","id":69251,"patch":5.1,"sort":33,"interval":"daily","repeatable":1,"beast":12,"eventIcon":71222,"issuer":1031809,"target":1031809,"genre":57,"journal":["Uin Nee is wrestling with the concept of swings.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Slay fibrous psammeads at the destination and obtain psammead silk.","Deliver the psammead silk to Uin Nee."],"dialogue":[{"name":"UINNEE","text":"Nothing makes me pity your kind quite like swings. After all, who needs a silly contraption like that when you can fly?"},{"name":"UINNEE","text":"Yet you...you have to tie a piece of wood to a tree branch and hope that it doesn't snap, dropping you to the ground and killing you instantly! All for the chance to go higher, and higher, and feel like you're about to take flight. But you won't! It's depressing, is what it is."},{"name":"UINNEE","text":"The children do seem to like them, though. And if they want a sad simulacrum of flight, who am I to refuse? In any case, I have a tree and this piece of wood I picked up off of the ground, so I've practically built the entire thing already!"},{"name":"UINNEE","text":"All that we need is rope! Strong rope, preferably. Falling to your death is no fun at all, even if it <span class=\"emphasis\">is</span> a dream. Maybe you could get me some of that sturdy psammead silk everyone raves about? Pretty please?"},{"name":"UINNEE","text":"It's the big, nasty mother psammeads that have the strongest silk. They're always a bit reluctant to come out of hiding, but fortunately, they'll come scuttling if you attack the smaller ones!"},{"name":"UINNEE","text":"How are the psammeads? Still crawly and unsettling?"},{"name":"UINNEE","text":"Oh, yes! This should be more than strong enough. I'll have to trick some mature mortals into testing it first, of course. Wouldn't want to risk the children! Once it's properly spun into the dream, maybe I'll even give it a try myself!"},{"name":"UINNEE","text":"I admit, the thought of being gently rocked is somehow soothing. Back and forth, back and forth... If I close my eyes, I can almost remember..."}],"reward":{"gil":606,"reputation":60,"items":[{"num":15,"id":28},{"id":28186}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":34}]}},"partials":[{"type":"npc","id":"1031809","obj":{"i":1031809,"n":"Uin Nee","l":2956,"q":28}},{"type":"item","id":"28","obj":{"i":28,"n":"Allagan Tomestone of Poetics","l":1,"c":65023,"t":63}},{"type":"item","id":"28186","obj":{"i":28186,"n":"Fae Fancy","l":1,"c":65074,"t":100}}]}