{"quest":{"name":"On the Threshold","location":"Kholusia","id":69254,"patch":5.1,"sort":20,"icon":100945,"unlocksFunction":1,"eventIcon":71341,"issuer":1031586,"target":1032020,"genre":24,"journal":["The dig site chief has noticed that Anogg and Konogg are conspicuously absent.","Anogg and Konogg have apparently gone long enough without annoying the dig site chief that he has become concerned─concerned that they are plotting something behind his back. Given certain recent developments for which they were present, you cannot deny this possibility, nor should you have much trouble guessing where they might be found...","You find Anogg and Konogg before the now-unguarded entrance to the machine graveyard. They lament that the door remains locked, but fortunately, you have a remedy for their woes: the key dropped by the disgraced watchman. Once you have handed it over to Anogg, there is little question as to whether or not the three of you will be heading inside to explore.","You proceed down the excavation tunnel and make a rather explosive entrance into a reasonably large underground chamber, where you find several odd-looking and apparently territorial machina. Anogg and Konogg make short work of them with their bombs, and rush to the side of a strangely garbed woman lying prone─completely ignoring the indignant site chief, presumably drawn by the thunderous report of multiple unauthorized explosions, in so doing. The mysterious woman in white identifies herself as “2P,” but gives no further details, instead insisting that you delve deeper into the ruins to stop the “machine lifeforms”─which you gather must be the machina from earlier─without further ado. ","Though 2P finds her ingress further into the ruins stymied by a technologically secured door, Anogg and Konogg are not above using the same trick thrice, and blow the entire locking mechanism to smithereens before anyone can so much as make an alternative proposal. The way thus cleared, you are free at last to seek the truth of the machine graveyard─with Anogg and Konogg at your side whether you like it or not.<br><br>※The Copied Factory can be accessed via the Duty Finder.","Through the metal doors, you find not broken remains scattered across the floor of a darkened cave, but rather rusted metal structures growing out of a verdant valley, reaching skyward and stretching into the distance as far as the eye can see. 2P tells you that this place was used in the manufacture of the so-called machine lifeforms, and indeed, no small number of them remain within. You fight your way past mechanical monsters great and greater until at last you come upon an adversary of an altogether different nature. Though you sense that this 9S and 2P have a complex relationship, you have no opportunity to press for details, as a heated battle ensues almost immediately. Though you are ultimately victorious, there is no telling what might emerge next, and 2P suggests that you withdraw for a time. Reading the exhaustion writ on her face, you agree.","Emerging from the factory, you see 2P lying on a nearby bed that has been hastily assembled from crates and sleeping mats. Perhaps the battle took more out of her than you had been led to believe.","You speak with Konogg, who tells you that 2P collapsed as they emerged from the ruins, and─sort of─compliments you for not having done the same. Just then, 2P reawakens. She remains conscious long enough to tell you that both she and 9S are mechanical constructs made to resemble men, that more such “androids” may be on their way to attack Komra as you speak, and that a “key” to understanding─and perhaps defeating─them lies somewhere within the factory. She then ceases to function entirely, coming to a stop all of a sudden like a wind-up automaton.","Though there was a thoroughly overwhelming amount to consider in what 2P told you, Anogg appears rather fixated on the “powerful item inside the ruins” bit, insisting that you seek it out posthaste. She also provides you with a new tool of her own design─the portable archive─which you may use to record interesting observations in the course of your investigation. With so much of the unfamiliar landscape that has been so well hidden within Kholusia as yet unexplored, it will doubtless see plenty of use.<br><br>※The <span class=\"highlight\">Portable Archive</span> is now available under Collection in the Duty section of the main menu. Record data at certain locations within the ruins to fill it with pertinent information."],"objectives":["Speak with Anogg.","Enter the excavation tunnels.","Speak with Anogg.","Enter the Copied Factory.","Speak with Konogg.","Speak with Anogg."],"dialogue":[{"name":"DWARFMASTER03671","text":"By the by─haven't seen Anogg and Konogg, have you? Usually when they go this long without getting underfoot, it means they're up to something."},{"name":"DWARFMASTER03671","text":"I'd be grateful if you'd track them down again and send them my way. They're peskier than a pack of pixies, but even so, I'd rather keep them where I can see them."},{"name":"DWARFMASTER03671","text":"Sooner you can track down the wee scoundrels, the better. It's too quiet..."},{"name":"TUNNELGUARD03671","text":"We've all taken our lesson to heart. No need to worry about us─or to draw your weapon, thank you."},{"name":"TUNNELGUARD03671","text":"...Also, our convoluted plan turned out to be just as much work as taking the job seriously, in the end, so there's that."},{"name":"ANOGG","text":"That's the watch taken care of, but we never did get that key..."},{"name":"ANOGG","text":"You mean to say that you picked it up? And no one's even noticed it's missing? Splendid! I shall open the door, and then you may escort us on our foray."},{"name":"ANOGG","text":"After all, everyone knows that the only thing that brings <span class=\"emphasis\">you</span> more joy than being of service to your fellow man is...adventure! Indeed, your adventurous spirit calls you toward ever greater challenges, no matter how staggeringly ill-advised or outright suicidal!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Rude but fair, I suppose."},{"name":"A1","text":"But the chief says we're not <span class=\"emphasis\">allowed</span>. No, no, I couldn't possibly."},{"name":"ANOGG","text":"Isn't it just?"},{"name":"ANOGG","text":"And after we've made it sound so very appealing!"},{"name":"KONOGG","text":"How truly, madly, deeply you wound us, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>!"},{"name":"ANOGG","text":"I see that we have no other choice but to drag you on this adventure against your will. Never mind the how─we'll come up with something on the way."},{"name":"ANOGG","text":"Hurry along, now! There are secrets to be found here, and we'll be the ones to bring them to light─and possibly to market, depending."},{"name":"ANOGG","text":"Maybe we'll even give you a share of the spoils! A small one, mind."},{"name":"KONOGG","text":"Nice work in trouncing those brutes earlier. You're so easy to push around, I had almost forgotten your vocation!"},{"name":"ANOGG","text":"Locked. Which bodes well for us finding something worth our time within, assuming we can get it open..."},{"name":"KONOGG","text":"The moment of truth, then."},{"name":"ANOGG","text":"That was easy."},{"name":"ROBOT03718","text":"(-Mysterious Machina-)Intruders sighted. Eliminating with extreme prejudice."},{"name":"DWARFMASTER03671","text":"What have you done!?"},{"name":"ANOGG","text":"Wicked white..."},{"name":"2P","text":"(-Woman in White-)The...the machine lifeforms..."},{"name":"ANOGG","text":"“Machine lifeforms”? What are you talking about? And why didn't you blow up?"},{"name":"2P","text":"I am numbe─ 2P. Call me 2P. The rest can wait."},{"name":"2P","text":"The machine lifeforms must be stopped. To do that, we must reach the heart of the ruins. Come."},{"name":"DWARFMASTER03671","text":"Anogg! Konogg! Don't you dare!"},{"name":"DWARFMASTER03671","text":"How bloody stupid are they!? &lt;sigh&gt; Listen, sinner─I know we've put you to plenty of trouble already, but...I need you to stop them before they dig themselves any deeper. At this rate, someone's going to get hurt."},{"name":"DWARFMASTER03671","text":"Not a thimble's worth of common sense between the two of them, I tell you. And once they get going...&lt;sigh&gt;"},{"name":"ANOGG","text":"Another door! Who needs this many doors?"},{"name":"2P","text":"Sealed per defensive protocols, I believe."},{"name":"ANOGG","text":"Protocols, shmotocols! We've got something for this immovable object."},{"name":"KONOGG","text":"Unstoppable force!"},{"name":"ANOGG","text":"Mwahaha! How'd you like that?"},{"name":"ANOGG","text":"I'm sure you were told to keep us from getting into trouble, or some such nonsense, right?"},{"name":"ANOGG","text":"But who took care of those machines? Us! Who got the door open? Us! Who's going to find out what's in there? Us!"},{"name":"2P","text":"If we can't unlock it, we'll need to break it down."},{"name":"KONOGG","text":"They don't make this easy, do they? These machine-whatsits."},{"name":"2P","text":"That's the means of ingress secured. Onward."},{"name":"ANOGG","text":"Aha! Hahaha! Mwahahahahahaha...&lt;cough&gt; &lt;cough&gt; &lt;cough&gt;...&lt;wheeze&gt;... Remind me to save the maniacal laughter for after the dust clears, next time."},{"name":"KONOGG","text":"Smell that? That gentle scent carried with the draft? That's the smell of secrets!"},{"name":"DWARFMASTER03671","text":"If you won't stop them, at least keep those two from getting themselves killed. I've got enough problems without adding funeral arrangements."},{"name":"2P","text":"There may be others lying in wait. We should withdraw."},{"name":"KONOGG","text":"She just collapsed! One minute she was walking ahead of us, the next─well, as you see here."},{"name":"KONOGG","text":"Though after all of that, perhaps the greater shock is that <span class=\"emphasis\">you're</span> still standing. I'm impressed. And a little bit scared."},{"name":"KONOGG","text":"Truly, you're wasted on the petty errands that everyone else puts you up to."},{"name":"ANOGG","text":"Oh! Are you feeling better?"},{"name":"ANOGG","text":"More importantly, who was that boy in black? How was he controlling the machines?"},{"name":"2P","text":"Not a boy, an android. An advanced machine designed in imitation of mankind. Same as me."},{"name":"KONOGG","text":"...You? You're a <span class=\"emphasis\">machine</span>?"},{"name":"ANOGG","text":"But that's impossible! It's hard enough to make a fully functioning ironbeard, or a wind-up automaton that bears a passing resemblance to a real person. To create machines that look and act and fight like you two... Who could possibly have done such a thing? And how?"},{"name":"ANOGG","text":"But─fine. Let's say, for the moment, that I believe you. Why would one of these androids want to attack us?"},{"name":"2P","text":"I don't know. But he's not the only one out there."},{"name":"2P","text":"And if the other androids come looking for these ruins, I can't promise they won't be just as...aggressive."},{"name":"2P","text":"Anyone who gets in their way could be in terrible danger. This whole place could be in danger..."},{"name":"KONOGG","text":"If they're anything like what we just saw, I don't like our chances..."},{"name":"ANOGG","text":"Don't be silly. We have our clever minds! We have loads of explosives! We have an exceptionally violent assistant, and we even have an android of our own!"},{"name":"2P","text":"I'm sorry..."},{"name":"2P","text":"My systems took too much damage in that battle. I don't...think I'll be functional for much longer."},{"name":"2P","text":"I can only tell you what you need to do."},{"name":"2P","text":"Deep within the ruins lies the key. Find it."},{"name":"2P","text":"With it, we can stop them. The machines, the androids..."},{"name":"2P","text":"With it, you can restore..."},{"name":"KONOGG","text":"Restore... Restore her to functionality, maybe?"},{"name":"DWARFMASTER03671","text":"What in the hells was that about?"},{"name":"ANOGG","text":"Ohoho..."},{"name":"ANOGG","text":"A very promising discovery, is what!"},{"name":"ANOGG","text":"So we must persevere! Onward! Inward! Awaaay!"},{"name":"KONOGG","text":"Hmm..."},{"name":"DWARFMASTER03671","text":"They're both all right, by the looks of it. Didn't expect that. Well done."},{"name":"2P","text":"..."},{"name":"ANOGG","text":"Ah, danger upon danger! Mystery within mystery! How invigorating, this...invigoration!"},{"name":"ANOGG","text":"I knew that there was something of value in there! Mwahaha..."},{"name":"ANOGG","text":"And once we get our hands on it, they'll see. They'll all see!"},{"name":"ANOGG","text":"Oh! Nothing! What? Did you hear something?"},{"name":"ANOGG","text":"Ahem. The real question is, do we pack more explosives this time? Maybe we can fit some in your pack, as well..."},{"name":"ANOGG","text":"You <span class=\"emphasis\">are</span> coming along, right? Oh, who am I kidding─I know you wouldn't miss it!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Oh, I'm sure I won't be given the choice to miss it."},{"name":"A2","text":"How charming that you continue to pretend to care about my opinion."},{"name":"ANOGG","text":"Yes, yes, we both know that you're loving this."},{"name":"ANOGG","text":"<span class=\"emphasis\">And</span> I have a present for you! Feast your eyes on this!"},{"name":"ANOGG","text":"It's a one-of-a-kind recording device─the portable archive! If you spot anything odd, aaanything at all, march right up to it and let this collect its data. Then we'll have a nice little set of records to review."},{"name":"ANOGG","text":"I know, I know, we're brilliant. Anyway, find a place for that in your pack, and do take care of what other preparations need doing. We'll be ready to go when you are."},{"name":"SYSTEM","text":"The <span class=\"highlight\">Portable Archive</span> is now available under Collection in the Duty section of the main menu."},{"name":"SYSTEM","text":"Fill your archive by using it to record data at promising spots within the ruins!"},{"name":"DWARFMASTER03671","text":"So there're androids, which are machines, but also other machines, and also..."},{"name":"DWARFMASTER03671","text":"Look, all I know is that I'm not keen on anything that gets Anogg this excited. Not bloody keen at all."},{"name":"KONOGG","text":"Having seen all of that from 2P...what else sleeps within those ruins, I wonder?"},{"name":"SYSTEM","text":"Try as you might, you cannot detect the sound of breath or whirring cogs, nor any visual indications of life of any sort."}],"reward":{"gil":5500,"items":[{"id":28894}],"instance":30087},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69253]},"next":[69255]},"partials":[{"type":"npc","id":"1031586","obj":{"i":1031586,"n":"Dig Site Chief","l":2954,"q":2}},{"type":"npc","id":"1032020","obj":{"i":1032020,"n":"Anogg","l":3427,"q":4}},{"type":"item","id":"28894","obj":{"i":28894,"n":"Significance (Nothing) Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"instance","id":"30087","obj":{"i":30087,"n":"The Copied Factory","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":435}},{"type":"quest","id":"69253","obj":{"i":69253,"n":"A Scandal in Komra","g":24,"l":"Kholusia","s":10,"f":1}},{"type":"quest","id":"69255","obj":{"i":69255,"n":"An Academic Dispute","g":24,"l":"Excavation Tunnels","s":30,"f":1}}]}