{"quest":{"name":"Oh, Beehive Yourself","location":"Eulmore","id":69265,"patch":5.1,"sort":8001,"unlocksFunction":1,"eventIcon":71341,"issuer":1031781,"target":1031801,"genre":112,"journal":["Kai-Shirr is bursting with enthusiasm, and all he needs is somewhere to direct it."],"objectives":["Wait outside the Beehive.","Speak with Kai-Shirr."],"dialogue":[{"name":"KAISHIRR","text":"<span class=\"highlight\">Forename</span>, have you got a moment?"},{"name":"KAISHIRR","text":"I've been wanting to have a word. Is it true you're an expert [Job]?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That's just one of my many, many talents!"},{"name":"A1","text":"Who told you that?"},{"name":"KAISHIRR","text":"Ha! Is there anything you <span class=\"emphasis\">can't</span> do? Alphinaud says you've been dealing with the Boutique of Splendors and all, and not just anybody can do that."},{"name":"KAISHIRR","text":"Alphinaud's the one that brought it up. Said you've been dealing with the Boutique of Splendors and all."},{"name":"KAISHIRR","text":"Anyhow, I ask because I was hoping to get your help with something. Bit of a project of mine, as it goes."},{"name":"KAISHIRR","text":"Since I decided to stay here in Eulmore, I've been trying to find ways for people like me to contribute to the future of the city. Thing is, I've never learned a trade or nothing like that, so I was struggling to come up with ideas."},{"name":"KAISHIRR","text":"After a lot of thinking, I put together a pretty decent plan, but I could do with your professional opinion and maybe a bit of help, if you're up for it. What do you say?"},{"name":"KAISHIRR","text":"It's for a good cause, I promise!"},{"name":"KAISHIRR","text":"I've asked a couple of old mates to meet us outside the Beehive, so I'll see you there!"},{"name":"KAISHIRR","text":"First things first, let me introduce you."},{"name":"KAISHIRR","text":"This here's Anfrigg, who serves his drinks shaken, not stirred."},{"name":"ANFRIGG","text":"Yes, as the saying goes here in the Beehive, “fancy a shake?” Reactions vary, as I'm sure you can imagine. Ahem. It's a pleasure to meet you."},{"name":"KAISHIRR","text":"And this is Bosta-Zia."},{"name":"ZIABOSTA","text":"I also work in the Beehive, though my talents tend more towards wining and dining, winding and grinding, whatever our patrons desire. Anyway, a friend of Kai-Shirr's is a friend of ours."},{"name":"KAISHIRR","text":"We grew up together in Gatetown, close as family."},{"name":"ANFRIGG","text":"All three of us are orphans, so we had to stick together to survive. We shared everything we had, right down to our last crust of...well, whatever was available."},{"name":"ZIABOSTA","text":"That's why we promised each other that we'd find a way into Eulmore, no matter what it took. But Anfrigg and I were chosen, while Kai-Shirr was left behind. I can't tell you how glad we were to be reunited with him after so long apart!"},{"name":"ANFRIGG","text":"We've been through a lot, him more than most, but we're all here now. I never thought I'd see the day!"},{"name":"ZIABOSTA","text":"I hate to say it, but the way things are going, there might not be reason for us to stay in Eulmore. So much has changed since the fall of Vauthry, and business at the Beehive has really dried up."},{"name":"ANFRIGG","text":"While I am all for this city becoming a fairer place to live, we need to face facts."},{"name":"ANFRIGG","text":"At this rate, places like the Beehive will struggle to stay afloat. If we were to be let go, the chances of us finding similar work here would be slim at best."},{"name":"KAISHIRR","text":"You're not...thinking about leaving Eulmore, are you?"},{"name":"ZIABOSTA","text":"To be honest, we don't have much choice."},{"name":"KAISHIRR","text":"Whoa, whoa, whoa! I said I'll sort something out, didn't I?"},{"name":"KAISHIRR","text":"I've got a plan to bring visitors into Eulmore, and I want you two to be part of it."},{"name":"KAISHIRR","text":"It's also why I brought <span class=\"highlight\">Forename</span> here. <span class=\"alternative-container\"><span class=\"alternative\">Her</span><span class=\"alternative\">His</span></span> skills as <span class=\"alternative-container\"><span class=\"alternative\">an [Job]</span><span class=\"alternative\">a [Job]</span></span> are going to solve all of our problems, I swear!"},{"name":"MANAGER03729","text":"(-???-)Well, well! How wonderful it is to see my employees engaged in such lively conversation."},{"name":"ANFRIGG","text":"The Queen Bee! Sorry, sir, I'll get back behind the bar."},{"name":"MANAGER03729","text":"No, no, as you are. In fact, Mistress Mowen and I were discussing ways in which the Beehive's fortunes might be improved."},{"name":"MANAGER03729","text":"It was then that we overheard you, and my ears pricked up when you mentioned the possibility of attracting new customers to Eulmore. Given the current state of affairs, this would be most welcome."},{"name":"MANAGER03729","text":"Would you share your ideas with me, young man?"},{"name":"KAISHIRR","text":"Erm, I ain't a businessman or nothing, so you'll have to excuse me if I'm off the mark here, but..."},{"name":"KAISHIRR","text":"Seems to me that under Vauthry, Eulmorans forgot what it means to actually work for a living, and most of the old industries disappeared altogether. Still, there are a few things left over from those days that we can put to good use."},{"name":"MANAGER03729","text":"Such as?"},{"name":"KAISHIRR","text":"The entertainment!"},{"name":"KAISHIRR","text":"Eulmorans ain't the only ones who like to have a good old knees-up, you know! If we open up the “city of final pleasures” to visitors, we'll be raking in the gil!"},{"name":"KAISHIRR","text":"And what better way to do that than telling everyone about the Beehive?"},{"name":"KAISHIRR","text":"'Course, word of mouth will only get us so far."},{"name":"KAISHIRR","text":"But if you put me in charge of promoting your establishment, I'll do whatever it takes to bring in people from every corner of Norvrandt!"},{"name":"MOWEN","text":"I say! Your enthusiasm is positively infectious! And for a self-confessed amateur, I find you <span class=\"emphasis\">remarkably</span> persuasive..."},{"name":"MOWEN","text":"I for one think it's a marvelous idea. Wouldn't you agree?"},{"name":"MANAGER03729","text":"Yes, this is certainly in line with Master Chai's aim to foster trade with outsiders. And as far as I can see, the Beehive stands only to gain from this most worthy of endeavors."},{"name":"MANAGER03729","text":"I am therefore placing you in charge of advertising the Beehive!"},{"name":"MOWEN","text":"Since I have a vested interest in the success of this undertaking, the Boutique of Splendors will gladly grant rewards for bringing much-needed custom to our doorstep."},{"name":"MANAGER03729","text":"But first, you will need to look the part, and I have the perfect ensemble in mind."},{"name":"MANAGER03729","text":"In the meantime, I would have the two of you resume your duties. When the time comes, I should like you to provide assistance in any way that you can."},{"name":"ANFRIGG","text":"Our knowledge and expertise are at Kai-Shirr's disposal, sir!"},{"name":"MANAGER03729","text":"I gather that you are here at the lad's request, yes? I can only guess as to what it may entail, though I daresay all shall become clear soon enough. I bid you good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">day</span></span>."},{"name":"ANFRIGG","text":"I have to say, I'm not sure what I can offer Kai-Shirr beyond the odd bit of advice."},{"name":"ZIABOSTA","text":"That was quite impressive. I never knew Kai-Shirr had it in him!"},{"name":"KAISHIRR","text":"I'm surprised you recognized me in this getup."},{"name":"KAISHIRR","text":"I have to tell you, I ain't used to wearing anything like this."},{"name":"KAISHIRR","text":"Still, if I'm to advertise a place like the Beehive, I suppose I've got to look the part. Not that it really matters for our first task, though."},{"name":"KAISHIRR","text":"While I was getting measured for my outfit, I was thinking of how we could convince everyone to come and spend their hard-earned coin in the Beehive."},{"name":"KAISHIRR","text":"Rather than shouting from the rooftops, it'd be a lot easier if we gave out flyers everywhere. I ain't just talking about a handful though."},{"name":"KAISHIRR","text":"I'll need hundreds, and that means I'll need paper, ink, and something to print them with. That last one's the trickiest, but it'll speed things up like no one's business. Do you think you could get those for me?"},{"name":"KAISHIRR","text":"There was one other thing... Oh right, payment! 'Course, I ain't expecting you to do it for free. I'll be getting scrips and whatnot from Mowen, so I'll send a few your way."},{"name":"KAISHIRR","text":"That sound all right to you?"},{"name":"KAISHIRR","text":"Thanks, I owe you one. Or I will once everything's been sorted out."},{"name":"KAISHIRR","text":"All you have to do is bring me the stuff for the flyers, and I'll take it from there!"}],"reward":{"items":[{"id":27864},{"id":27865}]},"reqs":{"jobs":[{"lvl":70,"id":35}],"questsType":"all","quests":[69217,69139]},"next":[69266]},"partials":[{"type":"npc","id":"1031781","obj":{"i":1031781,"n":"Kai-Shirr","l":2952,"q":2}},{"type":"npc","id":"1031801","obj":{"i":1031801,"n":"Kai-Shirr","l":2952,"q":2}},{"type":"item","id":"27864","obj":{"i":27864,"n":"Blood Tomato Salad","l":406,"c":24151,"t":46,"p":3548}},{"type":"item","id":"27865","obj":{"i":27865,"n":"Mushroom Saute","l":406,"c":24202,"t":46,"p":3548}},{"type":"quest","id":"69217","obj":{"i":69217,"n":"Moving Forward","g":9,"l":"Kholusia","s":90}},{"type":"quest","id":"69139","obj":{"i":69139,"n":"The Boutique Always Wins","g":0,"l":"Eulmore","s":0,"f":1}},{"type":"quest","id":"69266","obj":{"i":69266,"n":"Commercially Flyable","g":112,"l":"Eulmore","s":8002,"f":1}}]}