{"quest":{"name":"Into the Blue Again","location":"Ul'dah","id":69268,"patch":5.15,"sort":502,"icon":100943,"unlocksFunction":1,"eventIcon":71341,"issuer":1026852,"target":1026852,"genre":166,"journal":["Martyn is putting on even more airs than usual.","You find Martyn dressed in his Great Azuro garb, somehow seeming to be even more pompous than the last time you met. He reveals that his recently established Blue Mages' Guild has been growing steadily. He has taken on a number of pupils, including Nutiba Buntiba and P'yandih, who arrive to interrupt your conversation. The pair make no secret of the fact that they admire you, as Azuro the Second, far more than their mentor and guildmaster, much to Martyn's chagrin. After he indignantly shoos them away, he remembers that he is due to appear in the Masked Carnivale in a few moments and invites you to come and see the Great Azuro perform for the crowd. Despite facing a gigantic kronprinz behemoth, Martyn dispatches his opponent in spectacular fashion, unleashing a volley of blue magic spells that you never knew he possessed.","Meeting Martyn after the show, he explains that he learned his newfound techniques while traveling through Ishgard, though he also laments that his expanded repertoire has done little to boost the payment that he receives from the Celestium. He then explains that the owner, Royse, has requested that you and Martyn go with her to meet an acquaintance of hers, whose identity has yet to be revealed.","Following some typically curt greetings, Royse makes her way into the Miners' Guild to announce your arrival. She soon reappears, now accompanied by Fyrgeiss, member of Ul'dah's Syndicate and chairman of Amajina & Sons Mineral Concern, who is not only unimaginably wealthy but a renowned lover of the Coliseum. He explains that he observed Martyn's most recent performance, and being an avid follower of arena combat, he found the blue magic on display to be both unique and highly entertaining, to the extent that he has agreed to provide funding for the Celestium. Rather than staying to discuss the finer details at length, he leaves the arrangements to his underlings, and once he is out of earshot, Royse explains that despite the Masked Carnivale's popularity, the increase in ticket sales is offset by the cost of keeping and feeding hordes of pit fiends with which to fight. It is rumored that Fyrgeiss aims to strengthen his position within the Syndicate by investing in new ventures, an opportunity which Royse pounced upon by inviting him to the Celestium. Naturally, this injection of gil is expected to be accompanied by even greater profits, which she plans to address with a host of additions to the roster, including more ferocious creatures for you and Martyn to battle. He, too, sees Fyrgeiss's involvement as a change in fortunes, and hopes to secure financial support for the Blue Mages' Guild.","As Royse is planning to add yet more beasts to the Celestium's menagerie, Martyn thinks it best that the two of you prepare for the challenges that lie ahead. He recommends that you follow in his footsteps and acquire new blue magic spells, starting with Northerlies, which will give your foes a taste of icy Ishgardian winter, though this is something that you must first experience for yourself...<br><br>※The next blue mage quest will be available from Martyn upon reaching level 53 and learning Northerlies."],"objectives":["Speak with Martyn.","Speak with Royse.","Speak with Martyn."],"dialogue":[{"name":"MARTYN","text":"Hello, mate! Been polishin' your skills, have you?"},{"name":"MARTYN","text":"I'll admit, I've had a fair bit on my plate recently, what with performin' at the Celestium and runnin' the Blue Mages' Guild."},{"name":"MARTYN","text":"That's right, <span class=\"highlight\">Forename</span>─I've finally gone and opened up a guild! How could I not, given all the demand? Folk have been fairly climbin' over each other to sign up and get their mitts on my soul crystals. You've probably seen a fair few on your travels, tradin' blows with the local cactuars and whatnot."},{"name":"MARTYN","text":"They'll do anythin' to study the blue arts under the Great Azuro, star of the Celestium. Thanks to them, my lifelong─well, almost lifelong─dream of runnin' my own guild has come true! Ah, speak of the devils..."},{"name":"MARTYN","text":"Why, if it ain't two of my star pupils, P'yandih and Nutiba?"},{"name":"NUTIBABUNTIBA","text":"Can it be true? Has Azuro the Second at long last deigned to grace us with <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> presence?"},{"name":"PYANDIH","text":"I can't believe we finally have the chance to meet you in person!"},{"name":"NUTIBABUNTIBA","text":"Please, I beg of you, accept us as your apprentices!"},{"name":"PYANDIH","text":"We'll follow you anywhere!"},{"name":"MARTYN","text":"Oi! I think you're forgettin' who the guildmaster is around here! And besides, I've got other plans for <span class=\"highlight\">Forename</span>."},{"name":"MARTYN","text":"If you two can afford to stand about chewin' the fat, you've got time to go and get yourselves some new spells. Go on, hop to it!"},{"name":"MARTYN","text":"Gods give me strength... If they ever get their heads out of the clouds and into their spellbooks for a change, they might bloody learn somethin'."},{"name":"MARTYN","text":"Bugger me, I nearly forgot that I'm supposed to be performin' soon!"},{"name":"MARTYN","text":"Fancy comin' to see your old friend, the Great Azuro, in action?"},{"name":"MARTYN","text":"Of course, you won't be watchin' from the stands with all the unwashed masses. I've got a front row spot with your name on it!"},{"name":"BLUESKYMC","text":"Ladies and gentlemen, please give a warm welcome to the magnificent, the stupendous, the Great Azuro!"},{"name":"BLUESKYMC","text":"Not to be outdone by his apprentice Azuro the Second, he has handpicked one of our most fearsome pit fiends as his opponent, the savage, the gargantuan kronprinz behemoth!"},{"name":"BLUESKYMC","text":"The Great Azuro opens with a volley of his tried-and-true spells, yet the behemoth shows no signs of backing down!"},{"name":"BLUESKYMC","text":"My word, ladies and gentlemen! Not even the crown prince of beasts could withstand these never-before-seen techniques!"},{"name":"BLUESKYMC","text":"Victory goes to the Great Azuro!"},{"name":"LATOOLJA","text":"In Ul'dah, they say, “Old dogs are incapable to learn new tricks,” but maybe this not true?"},{"name":"MARTYN","text":"So, what did you think? I'll bet you thought the Great Azuro couldn't get any greater!"},{"name":"MARTYN","text":"Between the Masked Carnivale and runnin' the guild, I somehow found time to pick up a few new spells."},{"name":"MARTYN","text":"I went all the way to Ishgard and tried my luck against creatures so horrible they'd make a behemoth blubber. It was worth the trip, though. Now my repertoire of blue magic is bigger than ever. And let me tell you, the crowds have been lappin' it up!"},{"name":"MARTYN","text":"You'd think that the Celestium would reward all this extra effort by bumpin' up my pay, but apparently not. Actually, that reminds me, Royse said there's someone she wants me to meet over at the Miners' Guild. No idea what it's about, but maybe I'm gettin' a raise after all!"},{"name":"MARTYN","text":"Since you're here, you should tag along as well. If there's extra gil on offer, I wouldn't want you to miss out! I'm thoughtful like that, you know."},{"name":"LATOOLJA","text":"Did Martyn say “Miners' Guild”? Perhaps they want you to use Self-destruct to clear tunnels or something?"},{"name":"MARTYN","text":"To be honest, I know better than to get my hopes up any time Royse is involved. Whatever it is, there's bound to be a catch of some sort."},{"name":"ROYSE","text":"I'm glad you could join us, my dear. Wait here a moment, would you?"},{"name":"ROYSE","text":"It is my privilege to introduce the great Master Fyrgeiss, esteemed member of the Syndicate and chairman of Amajina & Sons Mineral Concern. Martyn, you will no doubt be delighted to hear that he found your match against the kronprinz behemoth most exhilarating."},{"name":"MARTYN","text":"I...ah, had no idea that such a distinguished and upstanding member of the community was in our audience!"},{"name":"FYRGEISS","text":"That was quite a display, young man! I must say, until I witnessed it for myself, I was under the impression that the Masked Carnivale was little more than a frivolous distraction. A far cry from the time-honored traditions of the Coliseum."},{"name":"FYRGEISS","text":"All it took was one match to disprove such misgivings. This blue magic of yours is truly a spectacle like no other!"},{"name":"MARTYN","text":"That's...ah, very kind of you, squire─ I mean, sir."},{"name":"ROYSE","text":"And would I be correct in assuming that we have your support?"},{"name":"FYRGEISS","text":"Why, yes! From this day forth, Amajina & Sons Mineral Concern shall provide all the financial backing you should require."},{"name":"ROYSE","text":"You do us a great honor, Master Fyrgeiss."},{"name":"FYRGEISS","text":"Now that has been decided, there are other, rather less interesting matters to which I must attend. I shall have my assistants draw up the necessary contracts and so forth. And with that, I bid you <span class=\"alternative-container\"><span class=\"alternative\">good evening</span><span class=\"alternative\">good day</span></span>."},{"name":"ROYSE","text":"Now, I suppose you're wondering what has prompted all of this."},{"name":"ROYSE","text":"While the Masked Carnivale has become a roaring success─for which I have the both of you to thank─our menagerie of pit fiends has been eating into our profits, in a quite literal sense. Simply keeping them fed is monstrously expensive."},{"name":"ROYSE","text":"And there is the fact that the crowds will soon grow tired of us dragging out the same old creatures, so we need to invest in having ever more exotic and dangerous beasts brought in by experienced adventurers, which costs a pretty gil as well."},{"name":"ROYSE","text":"That's why I invited Fyrgeiss to visit the Celestium. That walking coinpurse is known as much for his love of the Coliseum as he is for being ludicrously wealthy."},{"name":"ROYSE","text":"And just between the three of us, it seems his position within the Syndicate is nowhere near as stable as he would like it to be. He's desperately searching for a new venture that will give him the edge over his rivals."},{"name":"ROYSE","text":"Though I can't attest to how much the chairman stands to benefit from our partnership, I'm quite confident of our own prospects. For our part, we're going to come up with new performances to generate more excitement."},{"name":"MARTYN","text":"Hmm... So <span class=\"emphasis\">that's</span> Master Fyrgeiss? It's good to finally put a face to the name. I wonder if Amajina & Sons would be interested in proppin' up the Blue Mages' Guild?"},{"name":"MARTYN","text":"Was I thinkin' out loud? Ha ha! Forget I said anythin'! Anyway, I can't wait to see what the lads back at the guild make of this little development. Shall we?"},{"name":"LATOOLJA","text":"Amajina & Sons? Mining concern, yes? I hear they deal in ceruleum. Martyn has bad experience with ceruleum-dealing Roegadyn before. I hope Martyn not make same mistake again..."},{"name":"MARTYN","text":"By the sounds of it, Royse'll be linin' up some different foes for us to face in the Masked Carnivale. Knowin' her, our safety is the least of her concerns, so we'd better be ready for whatever she has to throw at us."},{"name":"MARTYN","text":"That's why I took the liberty of addin' a few more entries to your spellbook. Like any good student, you'll be wantin' to follow in your teacher's footsteps, which'll lead you to Ishgard."},{"name":"MARTYN","text":"And when you get there, what better spell to learn than Northerlies? A nice blast of freezin' cold air is just the trick when things get too hot to handle!"},{"name":"MARTYN","text":"Ah, yes. If you feel like addin' some other blue magic to your arsenal, Gaheel Ja has some brand-new totems that might be worth a look."},{"name":"MARTYN","text":"One more thing: at the risk of inflatin' your ego, I'd say your blue magic will be on a par with mine before long, so I've a mind to put you to work trainin' some of the apprentices."},{"name":"MARTYN","text":"But that's assumin' you make it back from Ishgard in one piece. Watch yourself out there, those frost-encrusted bastards roamin' about the snowfields take no prisoners!"}],"reward":{"gil":686},"reqs":{"jobs":[{"lvl":50,"id":129}],"questsType":"all","quests":[68735,67783]},"next":[69269]},"partials":[{"type":"npc","id":"1026852","obj":{"i":1026852,"n":"Martyn","l":41,"q":12}},{"type":"quest","id":"68735","obj":{"i":68735,"n":"Turning Over a Blue Leaf","g":166,"l":"Ul'dah","s":501,"f":1}},{"type":"quest","id":"67783","obj":{"i":67783,"n":"Litany of Peace","g":4,"l":"Ishgard","s":25}},{"type":"quest","id":"69269","obj":{"i":69269,"n":"Something Borrowed, Something Blue","g":166,"l":"Ul'dah","s":530,"f":1}}]}