{"quest":{"name":"Overseer for a Day","location":"The Firmament","id":69262,"patch":5.21,"sort":12,"unlocksFunction":1,"eventIcon":71341,"issuer":1031991,"target":1032832,"genre":83,"journal":["Francel is eager to learn how his petitions for aid were received.","The news that Gibrillont, Handeloup, and Elaisse are all willing to cooperate heartens Francel, who says that he has since penned entreaties addressed to each of the four High Houses. Determined not to depend entirely upon you, the young lord declares that, this time, the missives will be delivered by his own hand. He strides off purposefully before Foncrineau can mention that people have been waiting for an audience with him, and you consent to treating with them in his stead.","One after the next, workers and residents of the Firmament present themselves to you, and you send them on their way with helpful advice. With Francel expected to return shortly, Foncrineau suggests waiting for him together.","Having thanked you sheepishly for acting in his stead, Francel proudly informs you that he has won the support of all the High Houses for the restoration effort. But delight quickly gives way to distress, as Noalle comes running to you with word that trouble has befallen her mother..."],"objectives":["Speak with Foncrineau.","Speak with Foncrineau again."],"dialogue":[{"name":"FRANCEL","text":"Come, do not keep me waiting! What were the recipients' responses?"},{"name":"FRANCEL","text":"Both Gibrillont and Elaisse are willing? Glad am I to hear it. This shall do wonders for our workers' morale."},{"name":"FRANCEL","text":"As for Ser Handeloup, I know he is not wont to make promises out of hand, but I've confidence that he will come through for us."},{"name":"FRANCEL","text":"Thanks to your kind help, I was able to personally assist Audaine and her daughter meanwhile. Having but few possessions, they were able to promptly move to the Firmament."},{"name":"FRANCEL","text":"I also managed to find a moment to pen further missives."},{"name":"FRANCEL","text":"Lest you wonder, these are addressed to the four High Houses, my own included."},{"name":"FRANCEL","text":"Each of the houses has strengths that shall avail the project, and I would call upon their cooperation."},{"name":"FRANCEL","text":"I know not how a petition from an upstart such as I will be received, but it would not do to depend entirely on you. Nay, these missives, I shall deliver myself."},{"name":"FONCRINEAU","text":"Ah! L-Lord Francel, a moment!"},{"name":"FONCRINEAU","text":"Oh dear... There are people who have been waiting for an audience with my lord."},{"name":"FONCRINEAU","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, it pains me to make such a request of you..."},{"name":"FONCRINEAU","text":"But will you not consent to serve as acting overseer, and speak with the workers and residents in my lord's stead?"},{"name":"FONCRINEAU","text":"I am truly grateful! Now, I expect that some advice will be asked of you, but I trust you to exercise your best judgment."},{"name":"FONCRINEAU","text":"I shall call the petitioners in turn whenever you are ready. You need but say the word."},{"name":"FONCRINEAU","text":"My thanks for taking the time to seek out my lord."},{"name":"FONCRINEAU","text":"Are you ready to receive the petitioners, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>?"},{"name":"SYSTEM","text":"Speaking with the petitioners will take several minutes. You may wish to cancel any pending Duty Finder registrations."},{"name":"Q1","text":"Begin receiving the petitioners?"},{"name":"AUGEBERT","text":"Hm? Francel's away again, is he? Lad's been flat out of late helpin' folk get settled."},{"name":"AUGEBERT","text":"Anyroad, I wanted to speak with him about a big task what's comin' up. We need to bring in more hands for it."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Whatever the task is, I'll take care of it!"},{"name":"A2","text":"The Temple Knights might dispatch engineers."},{"name":"A2","text":"I have some dragon friends I could round up?"},{"name":"AUGEBERT","text":"Hahaha! I appreciate your zeal, my friend, but there're some things even you can't handle alone. It's manpower we need."},{"name":"AUGEBERT","text":"Look, it's no immediate rush at any rate. When Francel gets back, I'll have a word with him and sort it out."},{"name":"SYSTEM","text":"It appears your advice was not helpful."},{"name":"AUGEBERT","text":"Temple Knight engineers, you say? Aye, with their knowledge and experience, I reckon they'll do nicely."},{"name":"AUGEBERT","text":"I'll see to it we're ready to begin as soon as we get approval. My thanks, <span class=\"highlight\">Forename</span>!"},{"name":"SYSTEM","text":"It appears your advice was helpful."},{"name":"AUGEBERT","text":"Er...might be as I said the task was big, but not <span class=\"emphasis\">that</span> big. And you say it as though you're just roundin' up the lads to move furniture... Might be as it's a normal thing to you, but to us ordinary folk, dragons are a little dauntin', you know?"},{"name":"AUGEBERT","text":"Look, it's no immediate rush at any rate. When Francel gets back, I'll have a word with him and sort it out."},{"name":"SYSTEM","text":"It appears your advice was not helpful."},{"name":"ARTISANA03726","text":"What, Lord Francel isn't even here? Bah, what a waste of time."},{"name":"ARTISANB03726","text":"(-Apprehensive Artisan-)N-Now, sir, you mustn't say such things. You know the overseer is a busy man."},{"name":"ARTISANB03726","text":"(-Apprehensive Artisan-)We're artisans from Limsa Lominsa, charged with imparting our techniques to the locals."},{"name":"ARTISANA03726","text":"Our apprentices have been making good progress, and we've a mind to set them more advanced tasks. But for this we need specialized machinery they don't have in Ishgard."},{"name":"ARTISANA03726","text":"We want to ask the overseer if he could have it brought in, but seems it'll have to wait for another time..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"The Jeweled Crozier can bring in what you need."},{"name":"A3","text":"A bad knight blames his sword."},{"name":"A3","text":"The manufactory might be able to make what you need."},{"name":"ARTISANA03726","text":"Truly? That's good to hear!"},{"name":"ARTISANA03726","text":"In case you're wondering, the machinery in question's made by Naldiq & Vymelli's. We'll have the details for you soon, and we'd appreciate it if you could relay them to the people at the Jeweled Crozier!"},{"name":"SYSTEM","text":"It appears your advice was helpful."},{"name":"ARTISANA03726","text":"That's what the Ishgardians say, is it? Might make some sense if we're talking about a saw and a saw, but this is another tool altogether. We can't do our work without it."},{"name":"ARTISANA03726","text":"Look, we'll come again when the overseer's back. If you could just put in a good word for us, we'd appreciate it."},{"name":"SYSTEM","text":"It appears your advice was not helpful."},{"name":"ARTISANA03726","text":"Might be as they could, but they'd be making something they're not familiar with. And even if they somehow got it right, it wouldn't <span class=\"emphasis\">feel</span> right in our hands. Not worth the trouble if you ask me."},{"name":"ARTISANA03726","text":"Look, we'll come again when the overseer's back. If you could just put in a good word for us, we'd appreciate it."},{"name":"SYSTEM","text":"It appears your advice was not helpful."},{"name":"GAELICAT03726","text":"&lt;rumble&gt; &lt;rumble&gt; Hissssss!"},{"name":"SYSTEM","text":"A gaelikitten suddenly appears!"},{"name":"FIRMAMENT03726","text":"B-Beg your pardons, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>! This little critter came here amidst cargo from the Sea of Clouds. We've tried to send it on its way, but it refuses to leave."},{"name":"FIRMAMENT03726","text":"It's been lingering near the kitchen, so I suspect it's hungry. Thus far it hasn't done any harm...but what you suppose we should do with it?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I could give it the mystery scraps in my bag."},{"name":"A4","text":"Take it back to the Sea of Clouds."},{"name":"A4","text":"Gibrillont will be bringing food."},{"name":"GAELICAT03726","text":"Hissssss!"},{"name":"FIRMAMENT03726","text":"If I didn't know better, I'd say it understood what you said. And it was none too pleased. Well, I had best go after it..."},{"name":"SYSTEM","text":"It appears your advice was not helpful."},{"name":"GAELICAT03726","text":"Meowww... Purrrrrr..."},{"name":"FIRMAMENT03726","text":"If I didn't know better, I'd say it understood what you said. And it seems to have caught scent of something. I'll go and keep an eye on it."},{"name":"SYSTEM","text":"It appears your advice was helpful."},{"name":"FONCRINEAU","text":"Hm... Forgive me, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>, but they did not seem entirely satisfied. Mayhap 'twould be prudent to hear them again."},{"name":"HILDA","text":"Well, well, if it ain't <span class=\"highlight\">Forename</span>. You're certainly a common sight in the Firmament these days."},{"name":"HILDA","text":"Your friend Francel, he said he was keen on the guards I was offerin', so I came to discuss the details with him."},{"name":"HILDA","text":"Your friend Francel, he said that he wanted the guards I was offerin', and so I came to discuss the details with him."},{"name":"HILDA","text":"Seems he ain't here, though, so our talk'll have to keep. But there <span class=\"emphasis\">was</span> somethin' I wanted to tell you."},{"name":"HILDA","text":"The other day, I had occasion to meet Ser Aymeric. Busy as he is, he hasn't been able to pay a proper visit to the Firmament."},{"name":"HILDA","text":"He knows all about your involvement, though, and was sayin' how grateful he was to you, as lord speaker of the house and a private citizen both."},{"name":"HILDA","text":"And that's all from me. Be seein' you, <span class=\"highlight\">Forename</span>."},{"name":"FONCRINEAU","text":"That is everyone, I believe. I thank you for assisting the people in Lord Francel's stead."},{"name":"FONCRINEAU","text":"Speaking of whom, I expect he will return anon. Shall we await him together?"},{"name":"FRANCEL","text":"<span class=\"highlight\">Forename</span>, you are still here?"},{"name":"FONCRINEAU","text":"Ahem. While you were absent, my lord, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span> has been acting in your stead, attending the needs of those on-site."},{"name":"FRANCEL","text":"Truly!? P-Pray forgive me. In my eagerness, it appears I have unduly burdened you with my duties."},{"name":"FRANCEL","text":"But my own task, I am pleased to report, was not without fruit. We have received promising responses from all the High Houses."},{"name":"FRANCEL","text":"Though it was largely a matter of formality, I first went to secure the support of House Haillenarte. I then paid a visit to House Fortemps, which has been providing lodgings to visiting workers. There, I was given the assurance that they will increase their capacity as the need arises."},{"name":"FRANCEL","text":"Next, I knocked upon the door of Durendaire Manor. As a house founded upon military traditions, I was informed that they had little to offer to the restoration effort."},{"name":"FRANCEL","text":"Resigned, I was about to take my leave when, by a stroke of good fortune, Lord Jannequinard appeared and pledged to open a school where children might learn their letters, numbers, and stars."},{"name":"FRANCEL","text":"Last but not least, I took myself to House Dzemael, renowned for its architectural prowess, and they agreed to employ their expertise for the Firmament's benefit."},{"name":"FRANCEL","text":"In particular, the retired count, Lord Tarresson, is a stonemason of unrivaled skill and passion. As a fellow artisan, <span class=\"highlight\">Forename</span>, I daresay you will have occasion to meet him one day."},{"name":"FRANCEL","text":"<span class=\"highlight\">Forename</span>, I understand you are acquainted with Lord Tarresson, the retired count. With his skill and passion, I doubt not but that he will prove a great ally to our cause."},{"name":"FONCRINEAU","text":"Well now, pledges of cooperation from <span class=\"emphasis\">all</span> the High Houses... Not so long ago, this would have been unthinkable."},{"name":"FONCRINEAU","text":"It is due to the peace we now enjoy thanks to you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>."},{"name":"NOALLE","text":"(-???-)&lt;sob&gt; Help! Please help!"},{"name":"NOALLE","text":"M-Mummy─she's in trouble! Please, you have to help her!"},{"name":"FRANCEL","text":"Noalle! Take a deep breath, child, and tell us what has happened to Audaine."}],"reward":{"gil":648},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69261]},"next":[69263]},"partials":[{"type":"npc","id":"1031991","obj":{"i":1031991,"n":"Francel","l":3435,"q":2}},{"type":"npc","id":"1032832","obj":{"i":1032832,"n":"Foncrineau","l":3435,"q":1}},{"type":"quest","id":"69261","obj":{"i":69261,"n":"A Home in the Firmament","g":83,"l":"The Firmament","s":11,"f":1}},{"type":"quest","id":"69263","obj":{"i":69263,"n":"Shadow of an Icy Past","g":83,"l":"The Firmament","s":13,"f":1}}]}