{"quest":{"name":"To Thaw a Frozen Heart","location":"The Firmament","id":69264,"patch":5.21,"sort":14,"icon":100979,"unlocksFunction":1,"eventIcon":71341,"issuer":1031996,"target":1031996,"genre":83,"usedItems":[5768],"journal":["Francel would hear Marcelloix's tale.","At Francel's urging, Marcelloix tells you his tale. He used to support his family as a craftsman, he explains, but disillusioned with the commonfolk's lot, he made the decision to leave Ishgard and follow Lady Iceheart. By the time he had completed his transformation into a dragon, however, the war had ended. And to make matters worse, he found that he was unable to revert to his original form. Deeply remorseful, Marcelloix wishes to make amends to his wife and child, and at Francel's suggestion, he decides to express himself through action, using his skills to make gifts for them and other residents. To begin with, Francel offers to find a suitable venue for Marcelloix to do his work, and together you make your way into the New Nest.","To help with his crafting, Marcelloix asks that you supply him with two pots of cream yellow dye, which you can choose to craft yourself or purchase from Eilonwy at the Mendicant's Court.","You have delivered the cream yellow dye to Marcelloix. With the crafting proceeding apace, Francel declares that it is time to arrange a gathering. While Foncrineau goes off to find the residents, you are tasked with personally bearing word to Audaine.","Though Audaine remains undecided as to whether she wishes to take back her husband, your words convince her to come and hear what Marcelloix has to say. Your invitation thus delivered, you make your way to the gathering at the top of the steps at Saint Roelle's Dais.","Marcelloix presents his gifts, his earnest gesture winning over even those residents who had voiced their disapproval of him. Not least of all, Audaine finds it in her heart to give him a second chance even if forgiveness won't come overnight. Wishing to thank you and Francel both, Marcelloix asks that you accompany him to find the young lord.","Marcelloix presents Francel with a gift as a token of his appreciation. When Ehll Tou expresses her displeasure at not being recognized, Francel placates the dragonet by granting her permission to freely come and go from the Firmament. Last but not least, Marcelloix presents you with a gift of your own. Though helping others is its own reward, the experience serves to stoke your determination to strive for the happiness of the people of the Firmament."],"objectives":["Speak with Marcelloix.","<span class=\"alternative-container\"><span class=\"alternative\">Obtain two pots of cream yellow dye</span><span class=\"alternative\">Deliver the pots of cream yellow dye to Marcelloix</span></span>.","Speak with Audaine.","Attend the gathering.","Speak with Francel."],"dialogue":[{"name":"MARCELLOIX","text":"My tale..."},{"name":"FONCRINEAU","text":"&lt;sniff&gt; Forgive me... As you conversed, I could not help but remember Lord Chlodebaimt..."},{"name":"EHLLTOU","text":"Is he <span class=\"emphasis\">still</span> stammering and sulking? Hopeless, I tell you..."},{"name":"AUDAINE","text":"This is finer a home than anything we'd ever dreamed of. We can't thank you and Lord Francel enough."},{"name":"AUDAINE","text":"But as to my husband... Forgive me, but I still need time to think..."},{"name":"NOALLE","text":"Daddy's a dragon..."},{"name":"FRANCEL","text":"Come, Marcelloix. Tell us your tale."},{"name":"MARCELLOIX","text":"I used to be a craftsman, making sundry necessities on request. It wasn't much, but it was a living. For me and my family."},{"name":"MARCELLOIX","text":"When our home burned down, I took to repairing other people's belongings in exchange for scraps of food."},{"name":"MARCELLOIX","text":"Though it was necessary to keep us from starving, knowing that each mouthful I earned meant less for our fellows... The unfairness of it all was too much to bear."},{"name":"MARCELLOIX","text":"So I cast my lot with Lady Iceheart, with dreams of making lives better for the commonfolk. But in the end, all I succeeded in doing was forsaking my loved ones."},{"name":"MARCELLOIX","text":"I would make amends to my family. If they will let me."},{"name":"MARCELLOIX","text":"As I am now, I'm naught but a burden to them. That's the last thing I wish to be."},{"name":"FRANCEL","text":"I see. My thanks for opening your heart to us."},{"name":"EHLLTOU","text":"It's as Father says─men tend to overthink things. Perhaps one is made to think more when one's life is fleeting."},{"name":"FRANCEL","text":"That may well be the case, my friend, but it makes our feelings no less true for it. And Marcelloix feels the keenest regret, one born of the love he bears for his family. If his fellow Ishgardians can be made to understand this..."},{"name":"FRANCEL","text":"You said that you were once a craftsman. If you were to make for the people such items as they find needful, as you once did, I daresay you could express your feelings better than any words can."},{"name":"MARCELLOIX","text":"Express my feelings..."},{"name":"MARCELLOIX","text":"Altered as my hands are, I know not how well I can perform the work...but very well, milord. I'll try my very best."},{"name":"FRANCEL","text":"I am certain you will. Now, as for the items you might craft, I believe you best know those things which will delight your wife and child. The question is what may serve to please your detractors."},{"name":"FRANCEL","text":"The two men who approached─the older recently moved to the Firmament with his son's family. They arrived with naught but the shirts on their backs, and I imagine they would have need of household items such as dining utensils."},{"name":"FRANCEL","text":"Then there is the younger fellow, the retired soldier whose scar troubles him still. He might appreciate an unguent of some description to relieve the aches."},{"name":"FRANCEL","text":"Would such items be within your abilities to prepare?"},{"name":"MARCELLOIX","text":"I believe so, milord!"},{"name":"FRANCEL","text":"I know a place in the New Nest where Marcelloix may do his work. Pray come with me."},{"name":"FRANCEL","text":"These stalls were built for the district's residents. I have taken the liberty of securing one for Marcelloix's use."},{"name":"FONCRINEAU","text":"I shall assist Master Marcelloix with those tasks which may cause him difficulty."},{"name":"EHLLTOU","text":"I've no idea what men use all of this for, but it looks interesting!"},{"name":"MARCELLOIX","text":"It seems I can make use of this space, and all the equipment and materials besides!"},{"name":"FRANCEL","text":"Aye, whatever you find here is yours to use as you see fit. Now, is there aught else you might require?"},{"name":"MARCELLOIX","text":"Hm... <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, Ehll Tou. Might I trouble you to obtain two items for me?"},{"name":"MARCELLOIX","text":"One is a healing herb for the unguent, and the other a dye."},{"name":"MARCELLOIX","text":"I would go about obtaining them myself, but I'm liable to cause panic. Ehll Tou is small enough to remain inconspicuous, at least, and can fly besides."},{"name":"EHLLTOU","text":"But of course I would be happy to help! You may leave the herbs to me!"},{"name":"MARCELLOIX","text":"If I may task you with the dye, then, it's two pots of cream yellow I require. It matters not whether you make it yourself or purchase it."},{"name":"MARCELLOIX","text":"If you wish to purchase, I've heard that a woman named Eilonwy at the Mendicant's Court deals in all manner of wares. Perhaps you can inquire with her."},{"name":"MARCELLOIX","text":"Remember, it's two pots of cream yellow I require. It matters not whether you make it yourself or purchase it."},{"name":"MARCELLOIX","text":"If you wish to purchase, I've heard that a woman named Eilonwy at the Mendicant's Court deals in all manner of wares. Perhaps you can inquire with her."},{"name":"MARCELLOIX","text":"Were you able to obtain the dye?"},{"name":"MARCELLOIX","text":"Yes, this is it! I shall put it to use at once!"},{"name":"MARCELLOIX","text":"I've already finished the utensils, and thanks to you, the presents for my family will soon be ready. Now I just need Ehll Tou to return with the herbs..."},{"name":"FRANCEL","text":"Seeing as all is proceeding apace, I believe it is time to arrange a gathering. The area atop yonder steps should serve as a venue."},{"name":"FRANCEL","text":"Foncrineau, would you be so kind as to bear word to the people?"},{"name":"FONCRINEAU","text":"With pleasure, my lord."},{"name":"FONCRINEAU","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, perhaps you would like to be the one to seek out Mistress Audaine? I daresay she would be more willing to attend at your invitation."},{"name":"FRANCEL","text":"I shall remain here with Marcelloix and await Ehll Tou."},{"name":"FONCRINEAU","text":"Everyone shall gather here presently."},{"name":"MARCELLOIX","text":"As soon as Ehll Tou returns with the herbs, I will finish the unguent and bring it along."},{"name":"AUDAINE","text":"Oh, it's you, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. Is there something you need?"},{"name":"AUDAINE","text":"I see... It's just like him to do this."},{"name":"AUDAINE","text":"But even though he's my husband, the decision to accept a dragon... It's too much for a mere commoner such as me to bear."},{"name":"AUDAINE","text":"And when I think about my daughter, when I imagine how other children might mock her... I just don't know."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"On a long journey, the first step is often the hardest to take."},{"name":"A1","text":"Sometimes we need to have faith in one another."},{"name":"AUDAINE","text":"...I don't know how you do it, but your words give me courage. To simply talk with you instills me with a sense of hope."},{"name":"AUDAINE","text":"And knowing that there are decent folk such as yourself and Lord Francel around, I feel as though all will be well in the end."},{"name":"AUDAINE","text":"All right. We'll be there, Noalle and I. We'll hear what Marcelloix has to say. Thank you, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>."},{"name":"AUDAINE","text":"Rest assured we'll be along as soon as we're ready."},{"name":"NOALLE","text":"Are we going to go and see Daddy?"},{"name":"FIRMAMENTCITIZENA03728","text":"What is this? We were told Lord Francel had summoned us, but you're..."},{"name":"MARCELLOIX","text":"...An ordinary Ishgardian, just like you. I'm also a craftsman, and with help from some friends, I've made something for each of you."},{"name":"MARCELLOIX","text":"It isn't much, but please accept it."},{"name":"FIRMAMENTCITIZENA03728","text":"Dining utensils... Ours is a big family, so these would certainly be useful..."},{"name":"MARCELLOIX","text":"I hope that they serve you well."},{"name":"MARCELLOIX","text":"You may struggle to believe it, but I used to be your neighbor. Before I took on this form, I made whatever it was folk needed. And it's my hope that I can put my skills to use again, for the people of the Firmament."},{"name":"FIRMAMENTCITIZENB03728","text":"My scar flares up on cold, dry days. This unguent should take the edge off the pain. This is...kind of you."},{"name":"FIRMAMENTCITIZENA03728","text":"Oh, to be so young and open-minded... I know that you've done us no ill, but I can't simply forgive and forget the heretics for what they did..."},{"name":"FONCRINEAU","text":"You have lost a great deal, and we would not diminish your suffering by asking you to change your views. Yet, in spite of yourself, might you not try to see the individual before you as simply that─an individual, deserving of a chance?"},{"name":"FIRMAMENTCITIZENA03728","text":"&lt;sob&gt; I-I'm sorry... I-I know I'm not being fair..."},{"name":"FONCRINEAU","text":"Come, come, it wouldn't do to strain yourselves. If you would follow me, good sirs, I will find you some refreshments."},{"name":"MARCELLOIX","text":"Audaine, Noalle. I have something for you two as well."},{"name":"NOALLE","text":"&lt;gasp&gt; Aren't these our clothes!? Let's put them on, Mummy! Let's put them on!"},{"name":"NOALLE","text":"It's exactly the same as the one I lost in the fire! You remembered, Daddy! You remembered how much I loved this coat and this color!"},{"name":"NOALLE","text":"You may be a dragon now, but I don't mind at all. My friend Maelie said that dragons are nice!"},{"name":"AUDAINE","text":"It must've been difficult to make these with those hands. It's plain that you still think of us."},{"name":"AUDAINE","text":"And yet...you abandoned us when we needed you most. You left us to face the worst of the war alone, and I hated you for it."},{"name":"AUDAINE","text":"And so..."},{"name":"MARCELLOIX","text":"I know, I know... What I did was unforgivable, and I don't have the right to be with you and Noalle. I'll leave this place for good and all."},{"name":"AUDAINE","text":"No, no, no! Listen to the end, will you? What I want to say is, I can't give you a definite answer right this moment...but I'm willing to give us another chance."},{"name":"AUDAINE","text":"If you're still the man that I once knew, then perhaps we can work through this problem together, like we've worked through others. If this is enough for you for now, then you're welcome at our new home."},{"name":"MARCELLOIX","text":"It is! It's more than I could ever ask for! Thank you, Audaine!"},{"name":"AUDAINE","text":"Thank you again, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>. For instilling me with the courage to take the first step."},{"name":"AUDAINE","text":"Forgiveness won't come overnight, and we still have a long journey ahead of us. But if we have faith in one another, I'm confident that we'll find happiness again."},{"name":"MARCELLOIX","text":"If you can spare another moment, would you accompany me to find Lord Francel? I wish to thank you and him both for the second chance I have with my loved ones."},{"name":"EHLLTOU","text":"After I returned with the herbs, Francel told me to hold the fort with him. Where is this fort...?"},{"name":"FONCRINEAU","text":"The two residents have returned to their homes, the elderly gentleman with a look of peace upon his face. I dare to hope that, in time, he will come to accept Master Marcelloix."},{"name":"MARCELLOIX","text":"Please allow me to thank both you and Lord Francel properly."},{"name":"AUDAINE","text":"Thanks to you, I found it in my heart to give Marcelloix a chance. I'm sure he'll try his best to regain our trust, and for my part, I'll try my best to forgive him."},{"name":"NOALLE","text":"I wonder what Daddy's scales feel like!"},{"name":"FRANCEL","text":"There you are, <span class=\"highlight\">Forename</span>. Foncrineau has told me all."},{"name":"FRANCEL","text":"I am glad for you, my friend. Your honest feelings have reached the hearts of the people, your family's included."},{"name":"MARCELLOIX","text":"Yes, milord. I've been given a second chance with my family, and I owe it all to you and <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>."},{"name":"MARCELLOIX","text":"This is hardly enough to express my gratitude, but I made something for you as well. Won't you do me the honor of trying it on?"},{"name":"FRANCEL","text":"Well, now! This is hardly necessary, but I shall humbly accept it. A moment, if you would..."},{"name":"FRANCEL","text":"'Tis a perfect fit, and such a dashing design besides! My thanks for this fine gift!"},{"name":"EHLLTOU","text":"Hmph, and where's <span class=\"emphasis\">my</span> gift? Without me, Marcelloix would still be stammering and sulking out in the snow somewhere─and let's not forget the herbs as well! "},{"name":"FRANCEL","text":"Indeed, little one. For rendering aid to a citizen of Ishgard, you are deserving of recognition."},{"name":"FRANCEL","text":"Until now, dragons have been permitted entry to the Holy See only on special occasions."},{"name":"FRANCEL","text":"But if you wish it, in my authority as overseer, I shall arrange it so that you may freely come and go from the Firmament. Would that suffice by way of a gift?"},{"name":"EHLLTOU","text":"Oho, I could live with that! I've always wanted to observe how men live!"},{"name":"FRANCEL","text":"Now then, I must be returning to my duties, but if there is any further trouble, do not hesitate to call upon me."},{"name":"MARCELLOIX","text":"Last but not least, allow me to thank you too. If it weren't for you, I likely would have been executed as a heretic. And worse than that, I would have remained estranged from my family."},{"name":"MARCELLOIX","text":"Please accept this as a small token of my undying gratitude. I pray that it serves you well on your adventures."}],"reward":{"items":[{"num":3,"id":14139}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69263]},"next":[69373,69374,69375,69491]},"partials":[{"type":"npc","id":"1031996","obj":{"i":1031996,"n":"Francel","l":3435,"q":2}},{"type":"item","id":"14139","obj":{"i":14139,"n":"Oyster Confit","l":180,"c":24320,"t":46}},{"type":"item","id":"5768","obj":{"i":5768,"n":"Cream Yellow Dye","l":1,"c":22806,"t":55,"p":216}},{"type":"quest","id":"69263","obj":{"i":69263,"n":"Shadow of an Icy Past","g":83,"l":"The Firmament","s":13,"f":1}},{"type":"quest","id":"69373","obj":{"i":69373,"n":"If Songs Had Wings","g":84,"l":"The Firmament","s":1001,"f":1}},{"type":"quest","id":"69374","obj":{"i":69374,"n":"Adventurers and Admirers","g":84,"l":"The Firmament","s":1101}},{"type":"quest","id":"69375","obj":{"i":69375,"n":"Shadow over the Orphanage","g":84,"l":"The Firmament","s":2001}},{"type":"quest","id":"69491","obj":{"i":69491,"n":"The Making of a Market","g":83,"l":"The Firmament","s":15,"f":1}}]}