{"quest":{"name":"Commercially Flyable","location":"Eulmore","id":69266,"patch":5.1,"sort":8002,"unlocksFunction":1,"eventIcon":71341,"issuer":1031802,"target":1031801,"genre":112,"journal":["Bosta-Zia is keen to show you that your recent efforts have paid dividends."],"objectives":["Speak with Kai-Shirr.","Speak with Colden.","Speak with Kai-Shirr."],"dialogue":[{"name":"ZIABOSTA","text":"Ah! You're just in time!"},{"name":"KAISHIRR","text":"So, is our new singer's costume ready?"},{"name":"ZIABOSTA","text":"It certainly is!"},{"name":"ZIABOSTA","text":"We haven't had an awful lot of time to practice, but she's showing all the signs of becoming the Beehive's next star! In fact, the Queen Bee himself has already given her his seal of approval."},{"name":"ANFRIGG","text":"Still, it was Kai-Shirr who discovered her. Perhaps you've finally found your calling in life?"},{"name":"KAISHIRR","text":"Are you pulling my leg?"},{"name":"KAISHIRR","text":"No, I ain't cut out to manage musicians or nothing! All I did was a bit of asking about to find her, then her singing voice did the rest. Besides, if it weren't for <span class=\"highlight\">Forename</span> bringing the materials, she wouldn't have that lovely dress!"},{"name":"SINGER03730","text":"Yes, I've never seen anything so pretty in all me life! I feel like a princess! But I wouldn't even be here in the first place if you hadn't given me this chance."},{"name":"SINGER03730","text":"I just hope that I can repay you for everythin' you've done for me. Thank you, from the bottom of me heart."},{"name":"ZIABOSTA","text":"Oooh! I think you've made quite the impression on her!"},{"name":"KAISHIRR","text":"Eh? I dunno what you mean. I'm sure she'll do very well, though."},{"name":"KAISHIRR","text":"'Course, we can't stop there! We need to find more customers, but I'm not sure where to try next..."},{"name":"ANFRIGG","text":"Since you've already covered most of Kholusia, maybe we should try elsewhere?"},{"name":"ZIABOSTA","text":"Right. There are only so many people on this island that would be interested in a place like the Beehive."},{"name":"KAISHIRR","text":"A couple of ideas spring to mind, but I need a bit more time to mull them over. If you come and find me later on, I should've worked something out."},{"name":"KAISHIRR","text":"All right, I'd better put my thinking cap on!"},{"name":"ANFRIGG","text":"Most folk in Kholusia have barely enough money for life's essentials, never mind luxuries like the entertainment we offer."},{"name":"ANFRIGG","text":"Having said that, we've made efforts to cater to a broader clientele, which has increased our earnings considerably. As I'm sure you'll agree, Kai-Shirr has been the driving force behind it. We have a lot to thank him for."},{"name":"ZIABOSTA","text":"Alphinaud said that where he comes from, these kinds of song draw large crowds, and that some of the fans can be <span class=\"emphasis\">very</span> enthusiastic."},{"name":"ZIABOSTA","text":"If we could hold concerts, we'd be able to attract a whole new type of customer. Kai-Shirr's not the only one around here with big ideas, you know!"},{"name":"KAISHIRR","text":"I've managed to turn my ideas into something resembling a plan, but I'm still working on the finer details."},{"name":"KAISHIRR","text":"Like we was saying, most of the people in Kholusia who'd consider coming to the Beehive have been here by now. And a fair few of them even came back! But that means that if we want more customers, we'll have to bring them in from elsewhere. Which is to say across the seas."},{"name":"KAISHIRR","text":"Thing is, even if they like the sound of the place, they're hardly gonna jump on a boat just to come and watch a few dancers and sip a bit of wine!"},{"name":"KAISHIRR","text":"We need a faster, more convenient way for them to get to Eulmore. Ah, you look like you've worked it out. So, what's the answer to all our problems?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Amaro!"},{"name":"A1","text":"Airships!"},{"name":"KAISHIRR","text":"Eh? I suppose that would work if we're only thinking of a handful of people, but I'm hoping for a lot more than that!"},{"name":"KAISHIRR","text":"Not to mention they'd either need to be experienced amaro riders or have one with them as a guide. That's why I thought of something much better: airships!"},{"name":"KAISHIRR","text":"Ha ha! As the saying goes, “Clever people think of the same things”! Or at least, I'm pretty sure that's it... Anyway, is that a brilliant idea or what!"},{"name":"KAISHIRR","text":"There is one problem, though. A long time ago, there were flights from Eulmore to all sorts of places, but that ended with the Flood. Sin eaters made it impossible to fly anywhere, until Vauthry came along, that is."},{"name":"KAISHIRR","text":"I went and asked Master Chai whether we'd be able to set up an airship route between here and the Crystarium. Poor bloke's got a lot on his plate, but he was kind enough to say he'd consider it."},{"name":"KAISHIRR","text":"As a matter of fact, I'm about to go and see him again now. Do you reckon you could join me? Seeing as you're familiar with the Crystarium and all."},{"name":"KAISHIRR","text":"Great, let's get going! The place is the army headquarters, and we're supposed to make ourselves known to Colden."},{"name":"KAISHIRR","text":"Can't say I really know this Colden bloke, but Master Chai seems to trust him."},{"name":"COLDEN","text":"What can I do for you?"},{"name":"KAISHIRR","text":"We're here to see Master Chai."},{"name":"COLDEN","text":"About the airships, right? We've been looking into the feasibility of such a proposal, and I believe we now have all the information we need. He'll be here in a moment to inform you of his decision."},{"name":"CHAINUZZ","text":"Ah, Kai-Shirr, my good fellow. Terribly sorry to have kept you waiting."},{"name":"CHAINUZZ","text":"Why, if it isn't <span class=\"highlight\">Forename</span>. I'd heard you'd been helping at the Beehive─and I can think of worse places to spend one's time─though I wasn't aware that you'd be joining us <span class=\"alternative-container\"><span class=\"alternative\">this evening</span><span class=\"alternative\">today</span></span>."},{"name":"KAISHIRR","text":"Um, Master Chai, I heard that you'd made up your mind about the airships..."},{"name":"CHAINUZZ","text":"Don't worry, lad, I haven't forgotten! I must say, your timing could not have been more fortunate, as we are currently involved in talks with the Crystarium as to how we may better our relations."},{"name":"CHAINUZZ","text":"I put forward your proposal to establish airship routes between our two cities, and they agreed to it there and then!"},{"name":"KAISHIRR","text":"Blimey! I can't believe it!"},{"name":"CHAINUZZ","text":"Now, before we get carried away, there are one or two small problems that must be addressed first."},{"name":"CHAINUZZ","text":"Colden, if you'd be so kind as to explain."},{"name":"COLDEN","text":"Yes, sir. The Eulmoran Army has in its possession a number of airships, all in perfect working order."},{"name":"COLDEN","text":"But being designed for military use, they are austere things that offer very little in the way of comfort. Considerable work will be required to convert them for the proposed purpose."},{"name":"COLDEN","text":"While we have a rough idea as to how the interior might be refitted, I'm afraid we haven't the expertise to carry out the work ourselves. We will require the assistance of trained artisans."},{"name":"CHAINUZZ","text":"Indeed..."},{"name":"CHAINUZZ","text":"Unfortunately, given all the outstanding work in the city, we are experiencing a shortage of artisans at the moment. I'm not sure when we can assign people to the airships."},{"name":"KAISHIRR","text":"If it's artisans you need, I can take care of that."},{"name":"CHAINUZZ","text":"But where do you expect to find them?"},{"name":"KAISHIRR","text":"I was thinking of trying down at Venmont Yards. While they might be shipwrights and not...airshipwrights, they should be able to deal with a lot of the bigger tasks."},{"name":"KAISHIRR","text":"I expect we'll be needing a few extra interior walls and doors to make proper cabins. And from what I hear, they'll be glad for the work."},{"name":"CHAINUZZ","text":"Of course! Why didn't I think of that?"},{"name":"KAISHIRR","text":"And with <span class=\"highlight\">Forename</span> in charge of the more delicate work, those airships'll be ready before you know it."},{"name":"CHAINUZZ","text":"And what sort of assistance would you be providing?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm something of an artisan myself."},{"name":"A2","text":"Kai-Shirr, tell the man."},{"name":"KAISHIRR","text":"<span class=\"highlight\">Forename</span> here is an artisan <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>! One of the best, in fact."},{"name":"CHAINUZZ","text":"Surely you jest!"},{"name":"CHAINUZZ","text":"Not only are you a peerless warrior, able to best even the likes of General Ran'jit...you are telling me that you have other talents?"},{"name":"CHAINUZZ","text":"Bally hells... If you're even a fraction as good at that as you are at smiting evildoers... Say, would you be interested in joining Daedalus Stoneworks by any chance? We could use more skilled folk such as you."},{"name":"KAISHIRR","text":"M-Master Chai! I don't mean to be rude, but <span class=\"highlight\">Forename</span> already has a job helping me at the Beehive!"},{"name":"CHAINUZZ","text":"Th-That <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> does... Forgive me, I had forgotten myself. I wouldn't dream of poaching <span class=\"highlight\">Forename</span> from you."},{"name":"CHAINUZZ","text":"That being the case, perhaps the two of you could cooperate with Colden until the work has been completed."},{"name":"COLDEN","text":"Here is an outline of our improvements we wish to carry out. If you can provide the listed parts and materials, we soldiers can deal with the heavy lifting."},{"name":"CHAINUZZ","text":"Well, it seems you have the matter well in hand, so I will return to my own duties. I look forward to seeing the fruits of your labors, my young entrepreneur."},{"name":"KAISHIRR","text":"We won't let you down, sir!"},{"name":"CHAINUZZ","text":"I must say, I am rather surprised to hear about <span class=\"highlight\">Forename</span>'s hidden talents. We all need a hobby, I suppose!"},{"name":"CHAINUZZ","text":"And on that note, I bid you farewell."},{"name":"KAISHIRR","text":"All right, <span class=\"highlight\">Forename</span>, it seems like we've got our work cut out for us. Let's head back to the Beehive and take a closer look at what needs doing first."},{"name":"COLDEN","text":"To think that the airships that once bore soldiers to war will bring civilians to entertainment... How times have changed."},{"name":"KAISHIRR","text":"Master Chai caught me a little off guard offering you a job, but knowing what you're capable of, I hardly blame him."},{"name":"KAISHIRR","text":"Of course, I couldn't let him have you yet. We need your talents for the stuff in Colden's plans."},{"name":"KAISHIRR","text":"Metal plates, canvas, grease... It's a list as long as your arm. And not just the standard ones neither, it's all the fancy, hard-to-find sorts. And cushions! Bugger me, you'd think they'd have enough of <span class=\"emphasis\">those</span> around Eulmore as it is. Why can't they just borrow some?"},{"name":"KAISHIRR","text":"Well, I said we'd take care of it, so we should get started. I'll have a word with the lads at Venmont Yards, while I leave you to get stuck into the rest."},{"name":"KAISHIRR","text":"It's a bit of a tall order, I know, but you're up to it, right?"},{"name":"KAISHIRR","text":"Ha! 'Course you are! Let's give Master Chai and the people of Eulmore something to smile about!"}],"reward":{"items":[{"id":27876},{"id":27878}]},"reqs":{"jobs":[{"lvl":70,"id":35}],"quests":[69265]},"next":[69267]},"partials":[{"type":"npc","id":"1031802","obj":{"i":1031802,"n":"Bosta-Zia","l":2952,"q":1}},{"type":"npc","id":"1031801","obj":{"i":1031801,"n":"Kai-Shirr","l":2952,"q":2}},{"type":"item","id":"27876","obj":{"i":27876,"n":"Blood Bouillabaisse","l":418,"c":24111,"t":46,"p":3737}},{"type":"item","id":"27878","obj":{"i":27878,"n":"Coffee Biscuit","l":418,"c":24007,"t":46,"p":3737}},{"type":"quest","id":"69265","obj":{"i":69265,"n":"Oh, Beehive Yourself","g":112,"l":"Eulmore","s":8001,"f":1}},{"type":"quest","id":"69267","obj":{"i":69267,"n":"A Ship on His Shoulder","g":112,"l":"Eulmore","s":8003,"f":1}}]}