{"quest":{"name":"A Star Shines On","location":"Gridania","id":69260,"patch":5.1,"sort":184,"repeatable":1,"icon":100950,"eventIcon":71222,"issuer":1031904,"target":1031904,"genre":204,"journal":["Voices ring out through Mih Khetto's Amphitheatre with calls for an encore.<br>※This quest is available for a limited time only.","Amh Garanjy cheerfully informs you that the crowd is ready for an encore of your virtuoso performance. Speak with the celebrant of your choice to perform for the group of spectators they have assembled for the occasion.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Thanks to your talents with the baton and another inspired performance from Lartonphe, his chocobo companion, and the choir of bowmen, your encore performance has proved a resounding success. Speak with Amh Garanjy, who will doubtless be thrilled that you have put yet more smiles on the children's faces during this very special Starlight season.","Amh Garanjy expresses her joy at being able to witness yet another show of surpassing virtuosity, and thanks you for all the happiness and good cheer you have brought to Gridania this Starlight. It would appear that your adoring fans are eager for as many encores as you are willing to perform for them. If you are once again inclined to join your friends and lend your musical gifts to the masses, you need only say the word."],"objectives":["Speak with the saturnine Starlight celebrant or the splendiferous Starlight celebrant.","Report to Amh Garanjy."],"dialogue":[{"name":"AMHGARANJY","text":"Welcome back, friend! Might I take this to mean that you've decided to grace us with an encore? Why, it's yet another Starlight miracle! Rest assured that I myself and all the members of your chorus are ready to proceed whenever you are."},{"name":"AMHGARANJY","text":"Needless to say, your adoring fans have already assembled in droves. As soon as you're ready to take the stage, you need only speak to one of the two celebrants with whom you've already acquainted yourself."},{"name":"SYSTEM","text":"Quest difficulty and rewards will vary according to which Starlight celebrant you approach."},{"name":"AMHGARANJY","text":"Feeling a bit of stage fright, friend? If you find yourself having doubts, just remember─it's all for the children!"},{"name":"LARTONPHE","text":"While I did not lack for confidence, I would be lying if I said I expected the reaction to be quite so enthusiastic. If the audience is calling out for an encore, who are we to refuse?"},{"name":"NALIPPONCQUE","text":"You mean I can see the chocobo sing again? It's a Starlight miracle!"},{"name":"CHOCOBO","text":"Kweh! Kweeeeeeeeeh!♪"},{"name":"SYSTEM","text":"The chocobo appears eager to take to the stage once more."},{"name":"LEWIN","text":"Well? What did you think of my performance? I told you I was a bowman of many talents, did I not?"},{"name":"LUCIANE","text":"To tell the truth, I was a bit anxious to take the stage, but I must say there's something positively infectious about bringing joy to others through song. I finally feel as if I understand why Jehantel chose the path he did."},{"name":"MIAHMOLKOT","text":"I'll thank you not to ask meow to sing while I'm on duty, mind you."},{"name":"MIAHMOLKOT","text":"Not meow─<span class=\"emphasis\">meow</span>. Gah! Why do the words come out so much more easily when I'm singing!?"},{"name":"COMMITTEE03724A","text":"Back for more, are you? &lt;sigh&gt; The younglings are as restless as ever. I told them that if they didn't settle down, the saint's little helper would be bringing them a lump of goobbue dung for Starlight. Anyhow, I suppose we might as well begin. This way, please."},{"name":"Q1","text":"Do you wish to begin the cantabile?<br>You will earn two certificates of good cheer for successful completion of this piece."},{"name":"A1","text":"Yes."},{"name":"A1","text":"Not yet."},{"name":"A1","text":"How do I conduct a choir?"},{"name":"Q2","text":"Which song will you perform?"},{"name":"A2","text":"Starlight, Starbright"},{"name":"A2","text":"Starlight de Chocobo"},{"name":"COMMITTEE03724A","text":"Having second thoughts? I don't blame you. I wouldn't be caught dead up on that stage in front of all those expectant and eager faces. Oh, well...I suppose I'll just have to keep the children amused a while longer. Do come back when you've mustered the nerve, yes?"},{"name":"SYSTEM","text":"The choir will now perform a song. Time your inputs with the on-screen prompts."},{"name":"SYSTEM","text":"When a blue prompt appears (left), time your input as the diamonds overlap.<br>When an orange prompt appears (center), make several rapid inputs until the prompt disappears.<br>When a red prompt appears (right), press and hold the input for the duration of the prompt."},{"name":"SYSTEM","text":"The controls are as follows:"},{"name":"SYSTEM","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mouse: Left-click or right-click anywhere on screen<br>Keyboard: Any standard, unmodified key<br>Please note that chat will be temporarily disabled.</span><span class=\"alternative\">Controller</span><span class=\"alternative\">Gamepad</span><span class=\"alternative\">: All buttons and directional buttons except [???]</span></span> "},{"name":"SYSTEM","text":"To access the Pause menu, press the <span class=\"alternative-container\"><span class=\"alternative\">esc</span><span class=\"alternative\">Esc</span></span> key or [???] button, from which you may choose to end the performance."},{"name":"SYSTEM","text":"If you fail to follow an on-screen prompt, you will incur a penalty."},{"name":"SYSTEM","text":"When a certain number of penalties have been incurred, the performance will not end immediately, but your attempt will be unsuccessful."},{"name":"SYSTEM","text":"In the event of failure or quitting during the performance, you may attempt it again by speaking to either of the Starlight celebrants."},{"name":"COMMITTEE03724A","text":"Oh, that wasn't bad at all, now was it? I try not to get my hopes too high, but I'm pleased to say you surpassed my decidedly modest expectations...again."},{"name":"COMMITTEE03724A","text":"If you haven't noticed, the audience is calling out for yet another encore. If you wouldn't mind obliging, perhaps you should speak with Amh."},{"name":"COMMITTEE03724B","text":"Lo and behold! The conductor of legend makes <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> most triumphant return! Worry not, maestro─I have assured your adoring audience that this year will mark the arrival of your magnum opus! Are you ready to share the gift of your musical genius with one and all?"},{"name":"Q3","text":"Do you wish to begin the capriccio?<br>You will earn three certificates of good cheer for successful completion of this piece."},{"name":"A3","text":"Yes."},{"name":"A3","text":"Not yet."},{"name":"A3","text":"How do I conduct a choir?"},{"name":"Q4","text":"What song will you perform?"},{"name":"A4","text":"Starlight, Starbright"},{"name":"A4","text":"Starlight de Chocobo"},{"name":"COMMITTEE03724B","text":"Say no more, maestro! You require another moment or two to summon your muse before gracing the audience with the profound depths of your genius? Then it shall be so! Worry not─they and I both would wait until nigh the end of time for the legendary performance you will inevitably bring to them!"},{"name":"SYSTEM","text":"The choir will now perform a song. Time your inputs with the on-screen prompts."},{"name":"SYSTEM","text":"When a blue prompt appears (left), time your input as the diamonds overlap.<br>When an orange prompt appears (center), make several rapid inputs until the prompt disappears.<br>When a red prompt appears (right), press and hold the input for the duration of the prompt."},{"name":"SYSTEM","text":"The controls are as follows:"},{"name":"SYSTEM","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mouse: Left-click or right-click anywhere on screen<br>Keyboard: Any standard, unmodified key<br>Please note that chat will be temporarily disabled.</span><span class=\"alternative\">Controller</span><span class=\"alternative\">Gamepad</span><span class=\"alternative\">: All buttons and directional buttons except [???]</span></span> "},{"name":"SYSTEM","text":"To access the Pause menu, press the <span class=\"alternative-container\"><span class=\"alternative\">esc</span><span class=\"alternative\">Esc</span></span> key or [???] button, from which you may choose to end the performance."},{"name":"SYSTEM","text":"If you fail to follow an on-screen prompt, you will incur a penalty."},{"name":"SYSTEM","text":"When a certain number of penalties have been incurred, the performance will not end immediately, but your attempt will be unsuccessful."},{"name":"SYSTEM","text":"In the event of failure or quitting during the performance, you may attempt it again by speaking to either of the Starlight celebrants."},{"name":"COMMITTEE03724B","text":"Bravo! Oh, bravo! Why, it was as if the Twelve themselves descended from the heavens to grace our mortal ears with a harmony of sheer beatific bliss. No doubt our children, and their children, and their children to come will sing of the legendary performance they bore witness to this day."},{"name":"COMMITTEE03724B","text":"And Maestro, you have heard the voices, yes? Your adoring fans are calling out─nay, desperately <span class=\"emphasis\">pleading</span> for yet <span class=\"emphasis\">another</span> encore! You will oblige, yes? Oh, say that you will!"},{"name":"LARTONPHE","text":"Song is truly one of the greatest gifts the gods bestowed on us. Nothing else quite has the power to bring together people of all ages, all heritages, and all walks of life. Thanks to you, I was finally able to share my love for music with my son, and I will be forever grateful for it."},{"name":"NALIPPONCQUE","text":"I know! Next year, why don't we sing together? That would be so much fun!"},{"name":"CHOCOBO","text":"Kweh! Kweeeeeeh!♪"},{"name":"SYSTEM","text":"The chocobo appears to be enjoying the Starlight festivities."},{"name":"AMHGARANJY","text":"Why, I daresay the performance was even better the second time around! Shows what a bit of seasoning can do for you, yes? Thank you for gracing us with your remarkable conducting talents once more!"},{"name":"AMHGARANJY","text":"Believe it or not, the audience is calling out for yet another encore. I realize that you have other commitments─saving the realm and all that─but if you would be willing to oblige them before the season is over, you need only say the word!"}],"reward":{"items":[{"num":2,"id":28649},{"num":3,"id":28649}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69259]}},"partials":[{"type":"npc","id":"1031904","obj":{"i":1031904,"n":"Amh Garanjy","l":53,"q":3}},{"type":"item","id":"28649","obj":{"i":28649,"n":"Certificate of Good Cheer","l":1,"c":26172,"t":85}},{"type":"quest","id":"69259","obj":{"i":69259,"n":"A Chocobo Carol","g":204,"l":"Gridania","s":183}}]}