{"quest":{"name":"Shadow of an Icy Past","location":"The Firmament","id":69263,"patch":5.21,"sort":13,"unlocksFunction":1,"eventIcon":71341,"issuer":1031998,"target":1031996,"genre":83,"journal":["Noalle's mother appears to have met with trouble.","In distressed tones, Noalle informs you that an inquisitor has come and taken her mother away. Without delay, you rush off towards the Arc of the Worthy, to Audaine's aid.","You arrive to find not only Audaine and the inquisitor, but a dragon and dragonet unsuccessfully trying to gain entry into the Holy See. It is revealed that the dragon is none other than Audaine's husband, Marcelloix, whom the inquisitor is determined to punish as a heretic. However, Francel reminds him that, under new laws, those accused of heresy are to be accorded fair hearing, and volunteers to take Marcelloix and the dragonet, Ehll Tou, into his care. The tense confrontation thus ended, you all make your way to the Firmament to further discuss the situation.","Back at the Firmament, you consider what might be done with Marcelloix, who, as a heretic and dragon both, places his family in a difficult situation. Having once been abandoned by her husband, Audaine is understandably upset, and asks for time to decide whether or not she will take him back. Having had a gutful of men's troubles, the dragonet, Ehll Tou, flies off on her own to see the district, and Francel bids you go after her lest she cause alarm among the residents.","You find Ehll Tou watching the residents of the Firmament with great interest, but otherwise doing no harm. With some convincing, you succeed in persuading the dragonet to rejoin the others at Saint Roelle's Dais.","Francel has informed the residents of the Firmament of your draconic guests. Yet while all now understand the situation, whether they accept it is another question. At that moment, two citizens approach Francel and voice their aversion towards the man-turned-dragon. At the young lord's behest, they grudgingly withhold their judgment, but Marcelloix is made to be keenly aware that his is an unwelcome presence."],"objectives":["Speak with Noalle at the Arc of the Worthy.","Speak with Francel in the Firmament.","Search for Ehll Tou.","Speak with Francel."],"dialogue":[{"name":"FRANCEL","text":"Come, let us hear what has befallen Noalle's mother!"},{"name":"FONCRINEAU","text":"Who might this child be?"},{"name":"NOALLE","text":"A-A scary inquisitor, he came and took Mummy away!"},{"name":"NOALLE","text":"She hasn't done anything wrong! Please, you can't let them hurt her!"},{"name":"FRANCEL","text":"She will be fine, child. <span class=\"highlight\">Forename</span> and I will see to it. Now, will you show us where your mother was taken?"},{"name":"FRANCEL","text":"Come, my friend, let us follow Noalle."},{"name":"FONCRINEAU","text":"Both Lord Francel and Noalle shall be better for your company. I shall remain to keep an eye on the Firmament meanwhile."},{"name":"FRANCEL","text":"This way, you say?"},{"name":"NOALLE","text":"Outside the gate! She was taken outside the gate!"},{"name":"EHLLTOU","text":"(-Fearless Dragonet-)How many times must I tell you, we are <span class=\"emphasis\">good</span> dragons! I demand you let us enter at once!"},{"name":"MARCELLOIX","text":"Audaine! It's me, Marcelloix. Please, my love, tell them to let us pass."},{"name":"AUDAINE","text":"What? Can it truly be...?"},{"name":"FRANCEL","text":"What in the Fury's name is happening here?"},{"name":"INQUISITOR03727","text":"Ah, Lord Francel. We stopped these two dragons attempting to enter the Holy See."},{"name":"INQUISITOR03727","text":"The larger claimed to be related to this woman. Thus did I bring her hither to verify the truth."},{"name":"INQUISITOR03727","text":"If this dragon is in fact a man, 'tis more than likely that he is a heretic and must be punished harshly."},{"name":"INQUISITOR03727","text":"As must his kin."},{"name":"FRANCEL","text":"Forgive me, inquisitor, but mayhap you were absent when the lord speaker made his declaration. In light of the peace we have forged with dragons, those accused of heresy are to be accorded fair hearing, and not punished out of hand."},{"name":"INQUISITOR03727","text":"Be that as it may, it would not do to allow them to roam freely in the Holy See. It is liable to cause panic among the citizens."},{"name":"FRANCEL","text":"As you say. Yet ere we rush to pass judgment, we should allow the man a chance to tell his tale."},{"name":"FRANCEL","text":"Marcelloix, was it? I bid you speak truthfully: have you ever taken the life of an Ishgardian citizen?"},{"name":"MARCELLOIX","text":"N-No, milord! Upon my honor, I haven't so much as laid a claw on anyone!"},{"name":"MARCELLOIX","text":"It's true that I chose to follow Lady Iceheart. It's true that I partook of dragon blood."},{"name":"MARCELLOIX","text":"Whether it's because of myself or the blood, I can't say, but my transformation was long and painful. By the time I had recovered, the war had already ended."},{"name":"MARCELLOIX","text":"To make matters worse, I found I couldn't revert to my original form. I took to wandering aimlessly until I chanced to encounter Ehll Tou here, who encouraged me to return home."},{"name":"FRANCEL","text":"If this man speaks true, then by our laws, he has committed no crime."},{"name":"INQUISITOR03727","text":"And you would simply believe the words of a dragon? Without any proof whatsoever?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You don't have any proof of wrongdoing either."},{"name":"A1","text":"From my experience, dragons are more truthful than men."},{"name":"A1","text":"I'll personally keep an eye on these two."},{"name":"FRANCEL","text":"I shall take these two into my care. If they should cause any trouble, I will personally accept responsibility."},{"name":"INQUISITOR03727","text":"If you would vouch for them, Lord Francel, then I shall not object."},{"name":"INQUISITOR03727","text":"I but pray that you will not come to regret your decision."},{"name":"FRANCEL","text":"Well, it appears we have the situation in hand for the time being."},{"name":"AUDAINE","text":"Forgive us, milord... We didn't mean to involve you in our troubles..."},{"name":"FRANCEL","text":"Do not mention it. I have a responsibility to the residents of the Firmament. That you and your daughter are safe is all that matters."},{"name":"FRANCEL","text":"Now we just need to decide what to do with our guests..."},{"name":"EHLLTOU","text":"If you've finished your bickering, you could start by showing me your city! Oh yes, I've dreamed of seeing it for a long time!"},{"name":"FRANCEL","text":"I suppose there is no harm in that. And it would afford us the opportunity to discuss your situation further."},{"name":"FRANCEL","text":"Come with me, then─to the Firmament!"},{"name":"FONCRINEAU","text":"Lord Francel has told me all. In defending the defenseless, he acted as a true knight should. Full proud am I of him."},{"name":"FRANCEL","text":"It appears all are present. Good."},{"name":"FRANCEL","text":"So, Marcelloix, Ehll Tou. Though you are my guests, I trust you can appreciate that your troubles are not yet over."},{"name":"FRANCEL","text":"Yours in particular, Marcelloix. Though you are Ishgardian, as a heretic and dragon both, you place your family in an exceedingly difficult position."},{"name":"FRANCEL","text":"But ere I speak further, we should hear Audaine's thoughts on the matter."},{"name":"AUDAINE","text":"It's only because our nation has changed that I can admit this now...but I too once supported Lady Iceheart's vision."},{"name":"AUDAINE","text":"I couldn't well commit myself to her cause, though. That would mean forsaking our family."},{"name":"AUDAINE","text":"But he did so anyway! He forsook us, left us to fend for ourselves! And...and look at him now!"},{"name":"AUDAINE","text":"Worse still, he's brazen enough to show his face in Ishgard and runs afoul of an inquisitor! If it weren't for milords' intervention, we might have been executed there and then!"},{"name":"AUDAINE","text":"Forgive me...but I don't know. After all that's happened, I don't know if I can─if I <span class=\"emphasis\">want</span> to take him back. Please give me some time to think."},{"name":"MARCELLOIX","text":"I...I just wanted to see the two of you again..."},{"name":"EHLLTOU","text":"Ack! You finally meet your family, and all you can do is stammer and sulk? Have some stones, for heavens' sake!"},{"name":"EHLLTOU","text":"But enough of your tedious troubles! I came here to see a city, and I'm going to see one!"},{"name":"FRANCEL","text":"W-Wait!"},{"name":"FRANCEL","text":"Apologies, <span class=\"highlight\">Forename</span>, but will you not go and keep an eye on Ehll Tou? I've not had the chance to inform the residents, and it would not do to cause panic."},{"name":"FRANCEL","text":"You have my gratitude. Now, it seems she headed into the New Nest. If you hurry, you should be able to find her."},{"name":"FRANCEL","text":"It isn't safe for Marcelloix to be alone either. I shall remain with him."},{"name":"MARCELLOIX","text":"Audaine... Noalle..."},{"name":"AUDAINE","text":"This is finer a home than anything we'd ever dreamed of. We can't thank you and Lord Francel enough."},{"name":"AUDAINE","text":"But as to my husband... Forgive me, but I still need time to think..."},{"name":"NOALLE","text":"Daddy's a dragon..."},{"name":"EHLLTOU","text":"Hmmm, it seems men don't change very much as they grow. How ever do they become able to fly, I wonder..."},{"name":"EHLLTOU","text":"Oh, it's you. What is it?"},{"name":"EHLLTOU","text":"Ack! As I've said already, I won't harm anyone! I'll have you know that my sire is Gullinbursti of the noble line of Ratatoskr, and like our esteemed ancestor, I will fill the skies with beauteous songs!"},{"name":"EHLLTOU","text":"And though we may not have met before, I know who you are. Oh yes, my sire, Gullinbursti, has told me much and more about you."},{"name":"EHLLTOU","text":"Now, you may be wondering what events led to my being here. I've been on a journey to learn the ways of men, you see, but one I met was more interested in skewering me than speaking. I mightn't be alive if Marcelloix hadn't come to my aid."},{"name":"EHLLTOU","text":"Though our kinds are meant to be at peace again, not all men are ready to accept dragons as friends. The opposite is true too, of course."},{"name":"EHLLTOU","text":"Look, I'd sooner not be caught by unfriendly men either, so perhaps I'll return with you after all."},{"name":"EHLLTOU","text":"Is he <span class=\"emphasis\">still</span> stammering and sulking? Hopeless, I tell you..."},{"name":"FRANCEL","text":"It seems there was no alarm caused. My thanks for finding Ehll Tou, <span class=\"highlight\">Forename</span>."},{"name":"FRANCEL","text":"While you were gone, I took the opportunity to inform the residents about our guests. While all now understand the situation, whether they accept it is another question..."},{"name":"FIRMAMENTCITIZENA03727","text":"Lord Francel, might we have a word?"},{"name":"FRANCEL","text":"<span class=\"highlight\">Forename</span>, could you wait with Marcelloix and Ehll Tou yonder while I speak with these good folk?"},{"name":"FIRMAMENTCITIZENB03727","text":"We had heard that there were dragons in the Firmament. It appears the rumors were true."},{"name":"FIRMAMENTCITIZENB03727","text":"One of them near killed me in the war. Tore me open the length of my back. They say the larger one used to be a man, but the mere sight of him...it makes the scar ache unbearably."},{"name":"FIRMAMENTCITIZENA03727","text":"And my daughter, she was murdered by those wretched heretics. It's easy to say there's peace now, but it's not so easy to forget."},{"name":"FRANCEL","text":"I too lost a dear brother to the dragons. Believe me when I say I understand that some wounds do not heal."},{"name":"FRANCEL","text":"I will not force you to accept Marcelloix. Yet despite his appearance, he is but another Ishgardian, no different from ourselves. So I ask that you withhold your judgment for a time. That you give him a chance."},{"name":"FIRMAMENTCITIZENB03727","text":"If you say so, then very well, milord..."},{"name":"MARCELLOIX","text":"Forgive me, Lord Francel... It seems my presence brings only pain..."},{"name":"FRANCEL","text":"Come now, there is not a single soul in the nation who hasn't known suffering. You not least of all, my friend."},{"name":"FRANCEL","text":"If you are willing, will you not share with us how you came to be a heretic? Somewhere in your tale, we may find the key to winning over the doubters."}],"reward":{"gil":843},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69262]},"next":[69264]},"partials":[{"type":"npc","id":"1031998","obj":{"i":1031998,"n":"Noalle","l":3435,"q":1}},{"type":"npc","id":"1031996","obj":{"i":1031996,"n":"Francel","l":3435,"q":2}},{"type":"quest","id":"69262","obj":{"i":69262,"n":"Overseer for a Day","g":83,"l":"The Firmament","s":12,"f":1}},{"type":"quest","id":"69264","obj":{"i":69264,"n":"To Thaw a Frozen Heart","g":83,"l":"The Firmament","s":14,"f":1}}]}