{"quest":{"name":"Something Borrowed, Something Blue","location":"Ul'dah","id":69269,"patch":5.15,"sort":530,"icon":100943,"unlocksFunction":1,"eventIcon":71341,"issuer":1026852,"target":1026852,"genre":166,"journal":["Martyn plans to teach Nutiba Buntiba and P'yandih a lesson.","With Northerlies now part of your collection of spells, Martyn is eager to have you demonstrate the proper form and technique of a blue mage to P'yandih and Nutiba Buntiba. The two apprentices eagerly await your arrival in Hammerlea, where the lesson is to be held, though exactly what skills you are expected to impart has yet to be explained.","Shortly after reaching Hammerlea, Martyn reveals that you will be engaging a mammet borrowed from the Celestium in combat, in order to show the students the practical applications of blue magic. Your self-proclaimed mentor gives you a moment to collect your thoughts before he activates the adorable-yet-deadly axe-wielding automaton.","The arena viking's slow, deliberate swings prove no match for your swift and precise blue magic spells, and before long, the mammet lies motionless at your feet. Martyn, however, is visibly distraught by the sight of the expensive machine being rendered inoperable, since he will no doubt have to find the coin to pay for its repairs.","Nutiba Buntiba and P'yandih observe that your nimble footwork and relentless barrage of attacks were the deciding factors in your victory, and it seems that a valuable lesson has been learned. With the demonstration having reached its conclusion, Martyn leads the way back to Ul'dah.","At the Blue Mages' Guild, you learn that not only is Martyn charging his apprentices for his tuition, but that the demonstration that you provided actually set them back more than the usual amount. He claims that this is a means to an end, as their contributions are required for the day-to-day running of the guild. Perhaps in a somewhat hurried attempt to change the subject, he approaches the topic of the various roles that adventurers fulfill when forming groups to go exploring. Normally, the members divide their duties between offense, defense, and healing, whereas in the blue mage's case, it is possible for them to perform all of these duties simultaneously. In fact, there have been several reports of parties comprised entirely of blue mages meeting with considerable success on such quests. Martyn is keen to investigate this further, in the hopes he will be able to prove the effectiveness of his guild's members in real combat situations. In the meantime, he requests that you prepare for the next lesson with Nutiba Buntiba and P'yandih by mastering Whistle, a spell which he presumably already possesses himself.<br><br>※The next blue mage quest will be available from Martyn upon reaching level 55 and learning Whistle."],"objectives":["Speak with Martyn in Hammerlea.","Speak with Martyn again and defeat the arena viking.","Speak with Martyn.","Speak with Martyn in Ul'dah."],"dialogue":[{"name":"MARTYN","text":"Come on, <span class=\"highlight\">Forename</span>. We both know full well you haven't learned Northerlies yet. There's no use tryin' to pull the wool over my eyes, you know!"},{"name":"SYSTEM","text":"The next blue mage quest will be available from Martyn upon learning Northerlies."},{"name":"MARTYN","text":"Ah, that's the look of someone who's stared down a yeti or three! Now that you've mastered Northerlies, you're a step closer to reaching my level."},{"name":"MARTYN","text":"And like I mentioned before, I want you to help me train a couple of fledglin' blue mages. Remember the pair who were practically beggin' you to teach them? It looks like they'll finally get their wish. I'll meet you over in Hammerlea."},{"name":"LATOOLJA","text":"Latool Ja thinks Martyn is letting power go to his head. Soon, it will be too big for his little blue hat!"},{"name":"NUTIBABUNTIBA","text":"&lt;gasp&gt; If I'm dreaming, don't wake me!"},{"name":"PYANDIH","text":"I wouldn't miss this for the world!"},{"name":"MARTYN","text":"Normally, gettin' these two to do any serious trainin' is a bloody uphill struggle, but as soon as I mentioned you'd be comin' along, they couldn't get here fast enough."},{"name":"MARTYN","text":"I thought they should see some practical blue magic, away from all the showmanship of the Masked Carnivale, so I borrowed this arena viking for you to demonstrate a few spells. Go easy on it, though, eh? I've got to give it back, you see."},{"name":"MARTYN","text":"Let me know when you're ready and I'll set it to “Lightly Maim.”"},{"name":"MARTYN","text":"Listen, you two! Don't spend the whole time gawpin', all starry-eyed like. Pay attention to which spells <span class=\"highlight\">Forename</span> uses and when!"},{"name":"NUTIBABUNTIBA","text":"May I say what an honor and a privilege it is to receive the tutelage of a true master of the blue arts!"},{"name":"PYANDIH","text":"We normally only get to see you from the cheap seats at the Celestium, so this is a real treat!"},{"name":"MARTYN","text":"Come on then, you bucket of bolts!"},{"name":"NUTIBABUNTIBA","text":"Astonishing! Astounding!"},{"name":"PYANDIH","text":"You made that look easy!"},{"name":"MARTYN","text":"Ha ha! Just like I taught you! Ahem."},{"name":"NUTIBABUNTIBA","text":"Such fluid movements, and your footwork was a sight to behold!"},{"name":"PYANDIH","text":"It didn't stand a chance! You kept attacking and attacking until it was a smoking pile of scrap!"},{"name":"MARTYN","text":"Yes, very impressive. (We'll talk about this later, <span class=\"highlight\">Forename</span>...) I think that's <span class=\"emphasis\">more</span> than enough for the time bein'. Back to Ul'dah, everyone!"},{"name":"LATOOLJA","text":"Was Martyn usual, humble self? By that I mean, “Was he acting like gods' gift to magic?”"},{"name":"MARTYN","text":"I sent Nutiba Buntiba and P'yandih off on a couple of errands for the guild, but they'll be here soon."},{"name":"NUTIBABUNTIBA","text":"Gods be good! Those are not the fees that we agreed upon!"},{"name":"MARTYN","text":"Mammets and guest instructors don't come cheap, you know! And besides, a few extra gil will seem like small change once you're fully fledged blue mages. You won't regret this, I promise!"},{"name":"MARTYN","text":"That's more like it. If you follow the example set by <span class=\"highlight\">Forename</span> and myself, you'll be puttin' down ferocious beasts left, right, and center. Now, return to your training, my faithful apprentices!"},{"name":"MARTYN","text":"Bloody hells, what do they think I'm runnin' here? A charity!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I didn't realize you charged for these “lessons” of yours."},{"name":"A1","text":"Shut up and give me my cut!"},{"name":"MARTYN","text":"How else do you think I keep the guild afloat? And I'll have you know, the rates are perfectly reasonable, especially considerin' all the “unforeseen expenses.” You'll get your share, don't you worry."},{"name":"MARTYN","text":"Calm down, I haven't forgotten! Don't get your hopes up, though. The rates are nowhere near as steep as those two make them out to be. Just enough to keep the guild afloat."},{"name":"MARTYN","text":"More importantly, somethin' else has come to my attention."},{"name":"MARTYN","text":"My apprentices ain't the only ones who go off lookin' for enemies to test their skills on. As everyone knows, adventurers often band together and go delvin' into abandoned catacombs, haunted mansions and the like. They'll normally decide beforehand who does what, accordin' to their areas of expertise."},{"name":"MARTYN","text":"One to lead the way and draw out the beasties, a couple more for general stabbin', burnin', and so on, and maybe someone to see to any mangled limbs and gapin' wounds. In other words, they all have a certain role to fill."},{"name":"MARTYN","text":"But when I heard that groups of blue mages had been doin' just as well without specializin' in any particular role, I was thrilled to bits! Why? Because this can only mean one thing:"},{"name":"MARTYN","text":"Blue mages can do everrrythiiing!"},{"name":"MARTYN","text":"Attackin', defendin', healin'─you name it!"},{"name":"MARTYN","text":"'Course, we knew that already, but I'd never thought about usin' blue magic outside of one-to-one combat. I've asked the guild members to write a report each time they go explorin' as a group, so I can formulate new strategies for workin' alongside others."},{"name":"MARTYN","text":"Even P'yandih and Nutiba Buntiba might have somethin' interestin' to tell me next time we meet. Mind you, those two have taken to blue magic like cats...and popotoes to water. Not very well, in other words. That's why I'll be takin' them for more trainin', and I'd like you to join us."},{"name":"MARTYN","text":"Until then, I want you to learn to Whistle! Not the “put your lips together and blow” sort, I mean the blue magic spell. Now go, my annoyingly capable apprentice!"}],"reward":{"gil":848},"reqs":{"jobs":[{"lvl":53,"id":129}],"quests":[69268]},"next":[69270]},"partials":[{"type":"npc","id":"1026852","obj":{"i":1026852,"n":"Martyn","l":41,"q":12}},{"type":"quest","id":"69268","obj":{"i":69268,"n":"Into the Blue Again","g":166,"l":"Ul'dah","s":502,"f":1}},{"type":"quest","id":"69270","obj":{"i":69270,"n":"Bolt from the Blue","g":166,"l":"Ul'dah","s":550,"f":1}}]}