{"quest":{"name":"A Home in the Firmament","location":"The Firmament","id":69261,"patch":5.21,"sort":11,"unlocksFunction":1,"eventIcon":71341,"issuer":1031992,"target":1031991,"genre":83,"journal":["Foncrineau is concerned for his master.","You learn from Foncrineau and Augebert that no few Ishgardians are proving resistant to the idea of moving to the Firmament. Likely on account of this, Francel is late to return from his efforts to bring people to the new district, and you are tasked with tracking the young lord down in the Brume.","You find Francel struggling to convince citizens to move to the Firmament. With some well-chosen words, however, you help him to secure two new residents─a woman named Audaine and her daughter, Noalle. Having witnessed firsthand the trust people harbor for you, Francel begs for your continued assistance in running the fledgling district.","You agree to assist Francel, who expresses his profound gratitude. Without further ado, he tasks you with delivering three missives, which he explains are entreaties for cooperation in the restoration effort. The recipients are Gibrillont, the proprietor of the Forgotten Knight; Ser Handeloup, second commander of the Temple Knights; and Elaisse, the master of the Ishgardian markets.","You have delivered the missives and received positive responses from all three recipients; Gibrillont is happy to provide meals, Ser Handeloup will speak in favor of dispatching the Temple Knights' engineers, and Elaisse will personally work to procure the heavy machinery sought. Your task accomplished, you head to the Firmament to report to Francel.","You arrive in the Mendicant's Court and rejoin Francel, who is eager to learn how the three recipients responded to his entreaties."],"objectives":["Speak with Francel in the Brume.","Speak with Francel again.","Deliver Francel's missive to Gibrillont.","Deliver Francel's missive to Handeloup.","Deliver Francel's missive to Elaisse.","Report to Francel in the Firmament."],"dialogue":[{"name":"FONCRINEAU","text":"Ah, if it isn't good <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>."},{"name":"FONCRINEAU","text":"Though you may have seen me attending Lord Francel, I've not had the pleasure of introducing myself. I am his manservant, Foncrineau."},{"name":"FONCRINEAU","text":"I would like to offer you my personal thanks for lending your aid to my lord. Yours is an inspiring presence to him."},{"name":"FONCRINEAU","text":"Owing to the collective effort of all involved, the New Nest stands completed. Such was my lord's joy, 'twas as if he were a young boy again."},{"name":"FONCRINEAU","text":"He now seeks to settle folk in the district, and is personally reaching out to those citizens who were displaced by the war and the subsequent unrest."},{"name":"AUGEBERT","text":"(-???-)Ahem. About that..."},{"name":"FONCRINEAU","text":"Master Augebert. By your tone, I take it you harbor some concerns."},{"name":"AUGEBERT","text":"Aye, that I do. Thanks to Francel's encouragement, some folk have already moved into the district, but many more are draggin' their feet."},{"name":"AUGEBERT","text":"To hear the talk, they're afraid that the rent will be too expensive, or that they'll put themselves at the mercy of heartless nobles, and a whole host of other reasons."},{"name":"FONCRINEAU","text":"In order to encourage settlement, the Firmament offers various incentives to residents, such as tax relief and employment initiatives. Mayhap this knowledge has not been sufficiently disseminated to the public."},{"name":"AUGEBERT","text":"My thought exactly. That he's late to return is because he's strugglin' to win folk over, I'd wager."},{"name":"AUGEBERT","text":"On that note, <span class=\"highlight\">Forename</span>, I was wonderin' if you'd mind searchin' for him, see how he's farin'."},{"name":"FONCRINEAU","text":"I too would be grateful were you to look in on my lord. You will find him in the Brume speaking with the residents, I believe."},{"name":"FONCRINEAU","text":"Please find my lord and see how he fares. You will find him in the Brume speaking with the residents."},{"name":"FRANCEL","text":"Will you not tell me why you do not wish to live in the Firmament? What is it that worries you so?"},{"name":"FRANCEL","text":"Ah, <span class=\"highlight\">Forename</span>! You could not have come at a better time!"},{"name":"FRANCEL","text":"You may have heard that I am in the process of settling citizens in the Firmament."},{"name":"FRANCEL","text":"While some could not pack their belongings quickly enough, others are proving resistant to the idea, such as Audaine here and her daughter, Noalle."},{"name":"AUDAINE","text":"Begging your pardons, but aren't you the savior of Ishgard? It's an honor, mi<span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>!"},{"name":"AUDAINE","text":"We're grateful for the invitation, we truly are, but we couldn't possibly afford to live in a shiny new district. Even before our home in the Brume was burned down, we were barely getting by."},{"name":"AUDAINE","text":"Besides...given who we are, we don't have the right..."},{"name":"FRANCEL","text":"In my mind, the Firmament is for people such as they first and foremost, who lost their homes to the fires of conflict. Yet if they themselves do not wish it, I cannot well force them to move."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"They have employment initiatives for residents."},{"name":"A1","text":"They have tax relief for residents."},{"name":"A1","text":"In the Firmament, the sky's the limit!"},{"name":"AUDAINE","text":"Truly? If that's the case, perhaps it's not out of the question for us."},{"name":"AUDAINE","text":"Perhaps I should do it... Yes, if not for myself, then for my little girl. All right, I humbly accept!"},{"name":"FRANCEL","text":"Glad am I to hear it! Pray see to your preparations, then, and come to the Firmament when you are ready."},{"name":"FRANCEL","text":"And all it took was a few words from you. You truly hold sway over people, my friend."},{"name":"FRANCEL","text":"Of course, such trust comes not overnight. 'Tis the product of your many selfless deeds."},{"name":"FRANCEL","text":"Despite being falsely accused of a crime and driven to the ends of the realm, you did not surrender to despair. On the contrary, you dedicated yourself to the plight of others, and ultimately guided our war-weary nation upon the path to peace."},{"name":"FRANCEL","text":"In some ways we have walked similar paths, but my struggles are trifling things compared to yours. My name carries not the same weight, and my words have not the same power over the hearts of my fellow men."},{"name":"FRANCEL","text":"But the Fury take me if I allow the restoration effort to founder on account of my personal failings. The health and happiness of the people are at stake."},{"name":"FRANCEL","text":"Therefore, I ask you...will you not aid me in the running of the Firmament? With you beside me, I feel that there is no difficulty I cannot overcome."},{"name":"FRANCEL","text":"You needn't answer right this moment. Please take the time to think on it."},{"name":"FRANCEL","text":"You...agree to aid me, then? Ah, words cannot well express my gladness! Thank you!"},{"name":"FRANCEL","text":"Without further ado, then, I would have you deliver these missives. They are entreaties for cooperation in the restoration effort."},{"name":"FRANCEL","text":"Ordinarily, I would make the delivery myself, but I believe that the recipients would be pleased for your visit."},{"name":"FRANCEL","text":"One is Gibrillont, proprietor of the Forgotten Knight, another is Ser Handeloup of the Temple Knights, and last but not least is Mistress Elaisse, our master of the markets."},{"name":"FRANCEL","text":"While you see to this task, I shall look in on Audaine and her daughter. Let us convene in the Firmament afterwards."},{"name":"FRANCEL","text":"Ah, <span class=\"highlight\">Forename</span>. In case you were wondering how Audaine and her daughter are faring, they have just this moment completed the necessary paperwork. All is in order."},{"name":"FONCRINEAU","text":"My thanks for taking the time to seek out my lord."},{"name":"GIBRILLONT","text":"If it isn't <span class=\"highlight\">Forename</span>. What can I get you?"},{"name":"GIBRILLONT","text":"A missive from young Francel? I can only guess how you ended up delivering it, but let's have a look..."},{"name":"SYSTEM","text":"(-Francel's Missive-)Dear Gibrillont,<br>I pray this missive finds you well, and not bothered overmuch by the old wound. I write with regards to our efforts in the Firmament, of which you will most certainly be aware."},{"name":"SYSTEM","text":"(-Francel's Missive-)Of late, we have seen a marked increase in the number of workers on-site, and we struggle to keep everyone fed. In order to alleviate the strain upon our kitchen, it is my hope that you might provide us with hearty and wholesome provender from your own."},{"name":"GIBRILLONT","text":"Young Francel was always good to me back when I served his house, and I wouldn't refuse him. I'll arrange to have the meals prepared and sent to the Firmament at once."},{"name":"GIBRILLONT","text":"You're involved in the restoration, then, I take it. Keep an eye out on the lad for me, will you?"},{"name":"HANDELOUP","text":"Well met, <span class=\"highlight\">Forename</span>. To what do I owe the honor this day?"},{"name":"HANDELOUP","text":"A missive from Lord Francel, you say?"},{"name":"SYSTEM","text":"(-Francel's Missive-)Ser Handeloup,<br>My thanks for your unflagging dedication to preserving the peace in the Holy See. I write to you as overseer of the Firmament reconstruction project in order to officially entreat the cooperation of the Temple Knights."},{"name":"SYSTEM","text":"(-Francel's Missive-)The project's need for able hands will only grow, and it is my hope that your order might be amenable to dispatching a contingent of engineers to assist in our efforts. For the prosperity of our nation, I thank you for your kind consideration."},{"name":"HANDELOUP","text":"I see. Though I have not the authority alone to decide, I for one should be glad were our order to lend what help we may. I shall do my utmost to see that Lord Francel has his engineers."},{"name":"HANDELOUP","text":"Truth to tell, I have a personal interest in the Firmament. Ere it was razed to the ground, I myself lived there, you see. Many places in Ishgard offer a commanding view, but I find none finer than that of my erstwhile home."},{"name":"ELAISSE","text":"A warm welcome to you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. What is it that you seek at the Jeweled Crozier this <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span>?"},{"name":"ELAISSE","text":"Oh? A missive for me, from Lord Francel? Intriguing..."},{"name":"SYSTEM","text":"(-Francel's Missive-)Dear Mistress Elaisse,<br>I pray this missive finds you well and your markets bustling. I write to request your aid in acquiring heavy machinery of foreign make, intended for the use of the many foreigners lending their expertise to the restoration project."},{"name":"SYSTEM","text":"(-Francel's Missive-)Such equipment as the Skysteel Manufactory possesses is unfamiliar to non-Ishgardians, and as such would adversely affect their ability to carry out their work."},{"name":"SYSTEM","text":"(-Francel's Missive-)Through the connections you have established with foreign merchants, I have faith that you can procure for us that which we require. My humblest thanks for your assistance."},{"name":"ELAISSE","text":"Heavy machinery of foreign make... Though it will be no small coup to source such items, the merchant in me welcomes the challenge."},{"name":"ELAISSE","text":"But I say, it feels like only yesterday that Lord Francel was a little boy coming to market with his brothers. Now he has blossomed into a well-spoken, accomplished young man. Time surely flies..."},{"name":"ELAISSE","text":"Ah, forgive me my reminiscence. You may relay to my lord it shall be my pleasure to attend to his order."},{"name":"GIBRILLONT","text":"You can tell Francel I'll pay him a visit soon."},{"name":"HANDELOUP","text":"As I mentioned, I have not the authority alone to decide, but I will do my utmost to see that Lord Francel has his engineers."},{"name":"ELAISSE","text":"You may relay to Lord Francel it shall be my pleasure to attend to his order."},{"name":"FRANCEL","text":"There you are, <span class=\"highlight\">Forename</span>. You have delivered the missives, I take it? So...how did the recipients respond to my entreaties?"}],"reward":{"gil":745},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69208]},"next":[69262]},"partials":[{"type":"npc","id":"1031992","obj":{"i":1031992,"n":"Foncrineau","l":3435,"q":1}},{"type":"npc","id":"1031991","obj":{"i":1031991,"n":"Francel","l":3435,"q":2}},{"type":"quest","id":"69208","obj":{"i":69208,"n":"Towards the Firmament","g":83,"l":"Ishgard","s":1,"f":1}},{"type":"quest","id":"69262","obj":{"i":69262,"n":"Overseer for a Day","g":83,"l":"The Firmament","s":12,"f":1}}]}