{"quest":{"name":"Blue Cheese","location":"Ul'dah","id":69273,"patch":5.15,"sort":601,"icon":100943,"unlocksFunction":1,"eventIcon":71341,"issuer":1026852,"target":1026852,"genre":166,"journal":["Martyn presumably wishes to thank you for avenging his defeat at the hands of Siegfried.","Martyn is joined by P'yandih, Nutiba Buntiba, and Royse in offering their congratulations for your thrilling victory over Siegfried. As the ownership of the Celestium hinged on the outcome of the match, Royse is particularly pleased that the arena and its assets remain under her control. Your vanquished foe also arrives with his father, Fyrgeiss, and admits that you were the better fighter on the day. Following suit, Fyrgeiss confesses that he had misjudged the abilities of blue mages, and Martyn seizes the opportunity to secure gainful employment for his guild with Amajina & Sons. After the wealthy Syndicate member clears the air with Royse, a round of farewells ensues, leaving you with Martyn and his Mamool Ja associates. However, it seems that something is amiss with the guildmaster...","With Martyn's position undermined by your emphatic display in the Masked Carnivale, he comes to the conclusion that he can no longer continue as the Great Azuro. But Martyn has never been one to give in, even when he almost definitely should, and he announces that he will reinvent himself under the new identity of Azuro the Third. He aims to convince the public of Ul'dah that his latest alter ego is the original founder of the Blue Mages' Guild, in order to distance it from the rather ignominious fate that befell the Great Azuro. He will continue to appear in the Masked Carnivale under this new moniker while continuing his research into strategies that blue mages may employ in various fields of combat, and he asks you to participate in further expeditions. Though Martyn maintains his position as guildmaster of the Blue Mages' Guild, it is clear to all involved who the real driving force is, and the junior members will rely on your guidance in the days to come.<br><br>※The next blue mage quest will be available from Martyn once you have met the following requirements:<br>※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “Emissary of the Dawn.”"],"objectives":["Speak with Martyn."],"dialogue":[{"name":"MARTYN","text":"You did it! The Great Azuro has been avenged!"},{"name":"MARTYN","text":"Honestly, mate, I can't tell you how satisfyin' it was seein' you knock the stuffin' out that pompous bastard."},{"name":"MARTYN","text":"Ha ha! From the pitter-patter of distant footsteps, it sounds like I ain't the only one who wants to congratulate you!"},{"name":"NUTIBABUNTIBA","text":"Superlative! Splendiferous! The pinnacle of blue magery! Truly, you are everything I aspire to be."},{"name":"PYANDIH","text":"I knew Azuro the Second wouldn't let us down!"},{"name":"ROYSE","text":"So you're the ones who were screaming at the top of your lungs from start to finish? It's nice to know <span class=\"highlight\">Forename</span> has such enthusiastic followers."},{"name":"ROYSE","text":"Of course, no one was more pleased than me to see you triumph over Siegfried. The Celestium and its menagerie remain in my possession, and I'll sleep more easily knowing that Fyrgeiss won't be unleashing any voidsent just to clear out those blasted mines of his. You have my thanks."},{"name":"ZIRNBERK","text":"<span class=\"highlight\">Forename</span>, you beat me fair and square. Even with all of that magitek, I was no match for you."},{"name":"FYRGEISS","text":"Yes, I must commend you on a fine victory. What is more, you have opened my eyes to the potential of blue magic."},{"name":"FYRGEISS","text":"I know better than anyone how fierce a fighter my son is, yet you had an answer for his every move. Your defenses, nigh on impenetrable. Your barrage of attacks, overwhelming. And on the few occasions that his blows struck true, your healing arts swiftly mended the wounds."},{"name":"MARTYN","text":"So, the Blue Mages' Guild has gained your seal of approval, so to speak?"},{"name":"FYRGEISS","text":"More or less. While <span class=\"highlight\">Forename</span> here easily surpasses my expectations, and you possess no small amount of ability yourself, I have yet to assess the suitability of the guild as a whole. I shall hire you and your mages on a per-job basis, and have you fulfill whatever roles are deemed necessary."},{"name":"MARTYN","text":"You will not regret this! I shall handpick our very best according to your requirements, all for a reasonable price!"},{"name":"NUTIBABUNTIBA","text":"I assume you shall refrain from taking more than your fair share."},{"name":"MARTYN","text":"Well, part of the payment'll go to the runnin' costs of the guild. Besides, I think I'm entitled to a bit of a finder's fee, all things considered. You can't expect the guildmaster to live on table scraps!"},{"name":"ROYSE","text":"Ha ha... I shouldn't laugh, really. He has actually been surviving on scraps for a while now. Perhaps I should pay him a bit more... Ah yes, there was one thing I wanted to say. I apologize for speaking out of turn at Copperbell Mines, Master Fyrgeiss."},{"name":"FYRGEISS","text":"No, you had every right to be angry. And when you suggested that the other members of the Syndicate thought of me as second-rate, it struck a nerve, because deep down, I knew it was true."},{"name":"FYRGEISS","text":"In the events following Teledji Adeledji's death, Lolorito's influence has been growing steadily, while Godbert's Gold Saucer continues to make gil hand over fist. As for Prioress Dewlala, being head of the Order of Nald'thal means her position will always be secure."},{"name":"FYRGEISS","text":"I, on the other hand, have been desperately searching for a means to reassert myself within the Syndicate. It is fair to say that perhaps the success I had attained in my youth led to complacency."},{"name":"FYRGEISS","text":"Royse, you remind me of myself when I was your age. I traversed the length and breadth of Thanalan, doing whatever it took to fill Amajina & Sons' coffers. I once had that same drive, the same desire to innovate that I see in you."},{"name":"FYRGEISS","text":"From now on, rather than using my wealth to bully others into relinquishing control of what is theirs, I shall strive to create something from the ground up. To explore new frontiers."},{"name":"FYRGEISS","text":"And it seems there is no better time to begin than right now. After all, I am not getting any younger! I bid you all good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">day</span></span>."},{"name":"PYANDIH","text":"Speaking of exploring frontiers, that's exactly what Nutiba and I should be doing! Who knows, we might even discover new blue magic that even the guildmaster's never seen!"},{"name":"ROYSE","text":"No doubt they're feeling inspired after seeing the exploits of Azuro the Second. My audiences will be eager to see more of you, too, so the doors of the Celestium are always open should you be available to put on a show!"},{"name":"MARTYN","text":"Aaand once again, I'm left feelin' about as useful as teats on a bull. I reckon it's time I packed it all in..."},{"name":"LATOOLJA","text":"Maybe Martyn tired of living in <span class=\"highlight\">Forename</span>'s shadow?"},{"name":"MARTYN","text":"<span class=\"highlight\">Forename</span>, there's no point denyin' it any longer: you've well and truly surpassed me. You've mastered everything I've mastered. Triumphed where I've miserably failed. I've enjoyed my moment in the limelight, but I know when it's time to bow out."},{"name":"MARTYN","text":"The day has come for me to hang up my cloak and little eye mask thingy."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"No, Martyn! The show must go on!"},{"name":"A1","text":"Well, it was nice knowing you!"},{"name":"MARTYN","text":"It's no use, <span class=\"highlight\">Forename</span>. My mind's made up! It's better for me to quit while I'm ahead. Ah... I mean, quit before things get any worse!"},{"name":"MARTYN","text":"What!? That's it? Bloody hells, you could at least <span class=\"emphasis\">pretend</span> to stop me!"},{"name":"MARTYN","text":"But enough of this. This is really it, mate. It's curtains for the Great Azuro."},{"name":"MARTYN","text":"But hark!"},{"name":"MARTYN","text":"From the ashes rises Azuro the Third, the intrepid founder of the Blue Mages' Guild!"},{"name":"MARTYN","text":"So, what do you think? I'll tell everyone the Great Azuro was just lookin' after it until Azuro the Third returned from...somewhere. I'll think of that later. And that's not all! He'll also be the new star attraction of the Masked Carnivale, givin' me a chance to start afresh there, too!"},{"name":"MARTYN","text":"'Course, I'll be carryin' on my research into new blue mage strategies and whatnot, and maybe even make my own army like Fyrgeiss did! Hmm... Might be a few gil in that. Anyway, I'll still need you to help out with the log, so come by the guild whenever you find the time!"},{"name":"SYSTEM","text":"In order to undertake the next blue mage quest, you must first meet the following requirements:"},{"name":"SYSTEM","text":"※ FINAL FANTASY XIV: Stormblood must be registered to your service account.<br>※ You must have completed the main scenario quest “Emissary of the Dawn.”"},{"name":"SYSTEM","text":"Once you have done so, the next blue mage quest will be available from Martyn."}],"reward":{"gil":550,"items":[{"id":28647}]},"reqs":{"jobs":[{"lvl":60,"id":129}],"instances":[35030],"quests":[69272]},"next":[69525]},"partials":[{"type":"npc","id":"1026852","obj":{"i":1026852,"n":"Martyn","l":41,"q":12}},{"type":"item","id":"28647","obj":{"i":28647,"n":"Mask of Azuro","l":270,"c":40551,"t":34,"p":1000}},{"type":"instance","id":"35030","obj":{"i":35030,"n":"The Catch of the Siegfried","c":61836,"t":"The Masked Carnivale","min_lvl":60,"max_lvl":60}},{"type":"quest","id":"69272","obj":{"i":69272,"n":"Blue Scream of Death","g":166,"l":"Ul'dah","s":600,"f":1}},{"type":"quest","id":"69525","obj":{"i":69525,"n":"Second-rate Entertainment","g":166,"l":"Ul'dah","s":602,"f":1}}]}