{"quest":{"name":"Bolt from the Blue","location":"Ul'dah","id":69270,"patch":5.15,"sort":550,"icon":100943,"unlocksFunction":1,"eventIcon":71341,"issuer":1026852,"target":1026852,"genre":166,"journal":["Martyn has his pearls of wisdom at the ready.","Martyn's plans to take you and two of his students on a training exercise are scuppered by the unannounced arrival of Royse and Fyrgeiss. The Celestium's owner is taking her newfound investor on a tour of Ul'dah to show him what goes on behind the scenes of the Masked Carnivale. Despite Martyn and his blue magic playing a major role in the shows held at the arena, Fyrgeiss is more interested in the methods used to collect and maintain the extensive menagerie of opponents. Royse invites you to join them as she introduces her benefactor to the various parties involved, while Martyn sets about preparing a demonstration to showcase the prowess of the Blue Mages' Guild, with an eye to secure investment from Fyrgeiss.","The first stop on Royse's tour is the Goldsmiths' Guild, and Fyrgeiss is informed of their provision of several types of mechanical foes, including combat-ready mammets and floating Allagan nodes. Visibly impressed, the wealthy Syndicate member is keen to learn what other types of creatures the Celestium has in its collection as Royse leads the way to the Thaumaturges' Guild.","Fyrgeiss is informed that voidsent summoned through arcane experiments are regularly delivered into the Celestium's keeping. Royse assures him that the necessary measures are in place to prevent their escape and that even the Coliseum─of which Fyrgeiss is a keen supporter─has been known to use voidsent itself. His concerns regarding their safe handling now well and truly allayed, he follows Royse to the Adventurers' Guild.","Royse reveals that most of the Celestium's beasts are actually captured by members of the various Adventurers' Guilds as part of an ongoing agreement. Fyrgeiss admits that the selection of beasts used in the Masked Carnivale far surpasses that of the Coliseum, and spontaneously decides to increase the amount that he will invest in Royse's arena. Meanwhile, Martyn should have had enough time to prepare his demonstration, so the three of you return to the Blue Mages' Guild.","Martyn is all set to exhibit his vast array of spells when Fyrgeiss suddenly announces that he has a prior engagement, at the Celestium of all places. He explains that a gladiator under his patronage is due to perform there and invites you all to view the match with him. Entering the arena, you are greeted by the sight of an armor-clad contestant known as Siegfried triumphing over Ultros, a relatively recent addition to the Masked Carnivale. Rather than sheathing his sword, he turns to point it straight at Martyn, the gesture clearly meant as a challenge to his alter ego, the Great Azuro.","Outside the Celestium, Fyrgeiss appears with Siegfried by his side, who is none other than his eldest son Zirnberk, commander of the Stone Torches. The match between Siegfried and the Great Azuro was arranged as a means of attracting potential recruits to Amajina & Sons Mineral Concern's private army. Fyrgeiss then reveals that he was only interested in blue magic as a means by which to illustrate the superiority of his son's gladiatorial fighting arts over more showy and extravagant styles. Once the father and son have departed, Martyn runs the gamut of emotions from anger to exasperation, and finally, false bravado when he vows to wipe the floor with his hulking opponent. Royse sees an opportunity for Martyn to save face─primarily her own─by triumphing over Zirnberk, and suggests that he prepare accordingly. Soon after she has left, Martyn confides in you his apprehensions towards the match, and that he would rather divert his energies into his duties as guildmaster in the time remaining before the fateful day. He asks that you arm yourself with the Exuviation spell, a powerful healing spell, possibly due to his fear that circumstances may force you to take his place in the ring, as was the case in the encounter with Whastrach.<br><br>※The next blue mage quest will be available from Martyn upon reaching level 58 and learning Exuviation."],"objectives":["Speak with Royse at the Goldsmiths' Guild.","Speak with Royse at the Thaumaturges' Guild.","Speak with Royse at the Quicksand.","Speak with Martyn.","Speak with Martyn again."],"dialogue":[{"name":"MARTYN","text":"You still don't know how to Whistle? It's not the “put your lips together and blow” sort, it's the blue magic spell!"},{"name":"SYSTEM","text":"The next blue mage quest will be available from Martyn upon learning Whistle."},{"name":"MARTYN","text":"Learned Whistle, then? I reckon it'll prove handy in our next lesson."},{"name":"MARTYN","text":"Let's make our way to─"},{"name":"ROYSE","text":"(-???-)Darlings! Just the mages I was looking for."},{"name":"ROYSE","text":"I have the pleasure of giving Master Fyrgeiss a guided tour of the Celestium and our facilities. Perhaps you would be so kind as to join us? If you are not otherwise engaged, that is."},{"name":"MARTYN","text":"Busy? Not at all! Why, <span class=\"highlight\">Forename</span> and I are free as proverbial birds, aren't we?"},{"name":"MARTYN","text":"I only ask that you allow me a few moments to prepare the Blue Mages' Guild for Master Fyrgeiss. After all, it's not every day that we welcome such esteemed guests."},{"name":"FYRGEISS","text":"Actually, it is the Celestium's pit fiends that I am most interested in. Where they are kept, how they are captured, and so forth."},{"name":"ROYSE","text":"As you wish. I shall introduce you to the Celestium's associates."},{"name":"MARTYN","text":"A-And after that, I can explain the vital role of the Blue Mages' Guild."},{"name":"ROYSE","text":"On second thought, perhaps just one of you will suffice. <span class=\"highlight\">Forename</span>, why don't you come with us? It would be a wonderful opportunity for you to see what goes on behind the scenes to maintain our menagerie."},{"name":"MARTYN","text":"As I am already familiar with the inner workings of the Masked Carnivale, I shall use this time to prepare a spectacular exhibition of blue magic mastery especially for Master Fyrgeiss!"},{"name":"ROYSE","text":"Without any <span class=\"emphasis\">further</span> ado, please allow me to lead the way to the Goldsmiths' Guild."},{"name":"LATOOLJA","text":"Spectacular exhibition? It sound like shows we performed when Martyn was traveling salesman. Maybe Latool Ja should practice. “We feast on your flesh, smoothskins!”"},{"name":"FYRGEISS","text":"The Goldsmiths' Guild... Not the first organization that springs to one's mind when thinking of the upkeep of dangerous beasts."},{"name":"GOLDSMITHS03734","text":"Why yes, Mistress Royse of the Celestium is one of our most generous clients."},{"name":"ROYSE","text":"The Goldsmiths' Guild provides many of the mechanical combatants that appear in the Masked Carnivale, such as arena vikings and various other automata."},{"name":"GOLDSMITHS03734","text":"Ever since the Celestium first began placing orders for mammets, our artisans have been racing to keep up with demand."},{"name":"GOLDSMITHS03734","text":"Most of them are constructed according to Sharlayan designs, and even the more simplistic configurations are remarkably complex."},{"name":"GOLDSMITHS03734","text":"Nevertheless, we have endeavored to improve on the currently available models with a range of combatants─as per Mistress Royse's instructions─that are guaranteed to send all but the most battle-hardened contestants running to their mothers!"},{"name":"GOLDSMITHS03734","text":"Naturally, the mammets must be kept in good repair, which can be somewhat costly. However, we strive to have as many parts as possible forged here in Ul'dah, to reduce maintenance fees."},{"name":"ROYSE","text":"The Goldsmiths' Guild also negotiated the purchase of several Allagan relics from the Sons of Saint Coinach, including the gladiatorial and bestial nodes that appear in the Masked Carnivale."},{"name":"FYRGEISS","text":"Sharlayan <span class=\"emphasis\">and</span> Allagan technology, eh? Fascinating!"},{"name":"ROYSE","text":"I am sure you will be equally impressed by what I have to show you at the Thaumaturges' Guild. This way, please."},{"name":"GOLDSMITHS03734","text":"Goodness me! You are Azuro the Second, are you not? I must say, I am quite a fan of yours. I have always found you to be much more entertaining than that Great Azuro chap!"},{"name":"FYRGEISS","text":"What could the Celestium possibly want with the Thaumaturges' Guild? Could it be that─ No, surely not."},{"name":"THAUMATURGE03734","text":"If you wish to peruse one of our tomes, you need only ask. Though why these shelves must be so high when we are staffed almost entirely by Lalafells is beyond me..."},{"name":"ROYSE","text":"It is no secret that the Thaumaturges' Guild regularly summons a variety of voidsent as part of their experiments, which we at the Celestium put to good use."},{"name":"THAUMATURGE03734","text":"Under normal circumstances, we would not permit that such hellish creatures be allowed to leave the confines of the guild, but in Mistress Royse's case, we are willing to make an exception. Several exceptions, in fact, and continue to do so."},{"name":"THAUMATURGE03734","text":"Once a voidsent has...served its purpose, we must either dispose of the creature or send it back through the voidgate."},{"name":"THAUMATURGE03734","text":"The Celestium, however, possesses the means by which to contain them, such as magicked cages, shackles, and members of staff sufficiently trained in the dark arts."},{"name":"THAUMATURGE03734","text":"In addition, the transfer of voidsent to the Celestium's facilities is carried out under the supervision of the Order, to prevent any...mishaps."},{"name":"FYRGEISS","text":"Jolly good. I see that the proper steps have been taken to ensure the safety of the audience, not to mention Ul'dah at large. It would seem that I have little cause for concern."},{"name":"ROYSE","text":"As a matter of fact, Ultros and Typhon, who are said to be the result of the experiments carried out by the guild, have both appeared in the Coliseum and are now part of the Masked Carnivale. For slavering spawn of the netherworld, they are remarkably cooperative."},{"name":"ROYSE","text":"However, most of the Celestium's beasts have far more earthly origins, though they are no less deadly for it. A brief visit to the Quicksand─the last stop on our tour─will reveal how we go about acquiring such creatures."},{"name":"THAUMATURGE03734","text":"Our current arrangement with the Celestium provides them with a range of voidsent, all the way from low-ranking bombs and flans to those from the higher rungs of the hierarchy, such as Carmilla and Tikbalang."},{"name":"FYRGEISS","text":"I would not have expected that the Celestium would be in collaboration with the Adventurers' Guild."},{"name":"ADVENTURER03734","text":"You're an adventurer as well, ain't ya? I got an eye for these things, ya see."},{"name":"ROYSE","text":"Our contracts with the various branches of the Adventurers' Guild ensure a steady supply of battle-ready beasts from a wide range of locations."},{"name":"ADVENTURER03734","text":"Ye think killin' a wild behemoth is tricky? Try <span class=\"emphasis\">not</span> killin' it, trussin' it up, and draggin' the bloody thing all the way back to Ul'dah!"},{"name":"ADVENTURER03734","text":"Ah, this one here knows what I'm talkin' about. I bet you've done yer fair share of that. Tyin' 'em up with rope, chuckin' 'em in sacks, that sort of thing."},{"name":"ADVENTURER03734","text":"It's hard work, to be sure, but the coin's all right."},{"name":"ROYSE","text":"We only use the very best adventurers, and in the event of any accidents... Well, we simply hire more to replace them."},{"name":"FYRGEISS","text":"Ha ha! Excellent! No point risking your own staff, now is there? And might I say, I am <span class=\"emphasis\">very</span> impressed indeed by the lengths you go to in order to thrill your audiences. Clearly, no expense has been spared!"},{"name":"FYRGEISS","text":"The Coliseum also has its own menagerie, but in terms of sheer variety, it pales in comparison to the Masked Carnivale. Yes...it seems that the Celestium is worth every gil I have agreed to invest. In fact, so overwhelmed am I by your professionalism, I am willing to increase the amount!"},{"name":"ROYSE","text":"Master Fyrgeiss, your confidence in our operation will pay dividends, I assure you! Now, I believe that Martyn will have finished preparing for his demonstration, so that he may give a glimpse of the entertainment we can expect from the Great Azuro and his promising students."},{"name":"ADVENTURER03734","text":"Hang on, you're one of them blue mages, right? Did you buy a soul crystal off that bloke in the funny costume? Bugger that. I don't trust him as far as I could throw him."},{"name":"ROYSE","text":"I can only hope that he doesn't end up embarrassing me."},{"name":"FYRGEISS","text":"Well? Is he going to begin or not?"},{"name":"MARTYN","text":"Ladies and gentlemen! Thank you for your patience. You are about to bear witness to a spectacle the likes of which Ul'dah has never─"},{"name":"FYRGEISS","text":"Perhaps some other time, my dear fellow. One of the gladiators under my patronage is due to make his debut in the Masked Carnivale."},{"name":"FYRGEISS","text":"Would you all care to accompany me? The contestant of whom I speak has achieved great success on the bloodsands, and I personally am rather proud of him. What say you, lad?"},{"name":"MARTYN","text":"It...would be my pleasure."},{"name":"BLUESKYMC","text":"Incredible! Siegfried claims victory in his Masked Carnivale debut!"},{"name":"BLUESKYMC","text":"This rising star of the Coliseum takes his name from the swashbuckling hero of myth, and as you can see, he certainly has the skills to match!"},{"name":"BLUESKYMC","text":"What's this? Siegfried is issuing a challenge to the Great Azuro!"},{"name":"BLUESKYMC","text":"Champions of the Celestium and the Coliseum are to go head-to-head in a clash that is sure to set the arena ablaze! Maybe even literally!"},{"name":"LATOOLJA","text":"Normally, Martyn only fights mindless beasts. Latool Ja thinks fighting people very different “kettle of fish,” as saying goes."},{"name":"ROYSE","text":"This is an unexpected turn of events, and a potentially very lucrative one at that. I couldn't have planned it better myself..."},{"name":"MARTYN","text":"Bloody hells. I only went to watch and I end up gettin' roped into a match with some sword-wavin' oaf who's tryin' to steal my audience... Just my soddin' luck."},{"name":"FYRGEISS","text":"What a show that was! Though it would seem that the best is yet to come."},{"name":"FYRGEISS","text":"Allow me to introduce the man behind the mask. I present to you the commander of the Stone Torches, my eldest son, Zirnberk!"},{"name":"ZIRNBERK","text":"I am pleased to make your acquaintance."},{"name":"ROYSE","text":"If I may be so bold, might I inquire as to why one of the most decorated gladiators of the Coliseum would enter the Masked Carnivale?"},{"name":"FYRGEISS","text":"As I am sure you are aware, the Stone Torches serve as Amajina & Sons Mineral Concern's private security force, offering protection for our various mining and freight operations."},{"name":"FYRGEISS","text":"The soldiers serve with pride and honor, yet the rather humdrum nature of constant guard duty makes it a less appealing prospect in comparison to working for the Brass Blades, whose reputation for bribe taking and extortion attracts many would-be sellswords in search of a quick gil."},{"name":"FYRGEISS","text":"I am in need of fresh recruits, and the Masked Carnivale offers a unique opportunity to showcase the martial prowess of the Stone Torches' finest."},{"name":"FYRGEISS","text":"Your showy fireworks make for good entertainment, and the coin of your devoted followers will be most welcome. Once they arrive to see your match with Zirnberk, he will demonstrate the superiority of the Stone Torches."},{"name":"FYRGEISS","text":"Strapping young men and women will be flocking to join my army, while I rake in the gil from the ticket sales. What could be more perfect? Bwahahahaha!"},{"name":"FYRGEISS","text":"I have the popularity of your blue magic to thank for this opportunity, but beyond that, I have no interest in your parlor tricks. Nevertheless, I shall be taking a keen interest in your match with my son. Until next we meet..."},{"name":"MARTYN","text":"Thal's balls, this <span class=\"alternative-container\"><span class=\"alternative\">evenin'</span><span class=\"alternative\">day</span></span> just gets better and better! To think I passed up the chance to train my apprentices for the sake of that smug, shite-eatin' windbag! I think I owe those two an apology."},{"name":"ROYSE","text":"That can wait! You need to keep your mind on the match. Who knows, you might even win! And then, Fyrgeiss will have to eat his words."},{"name":"MARTYN","text":"\"Might even win“? Why, the thought of losin' never crossed my mind! When I'm finished with that overmuscled aurochs, his own daddy won't recognize him!"},{"name":"ROYSE","text":"I'd expect nothing less from the Great Azuro! Of course, I'll have to shuffle the schedule around to open up a slot for your fight with Siegfried. I need you to be in top form, so do whatever it is you blue mages do to prepare."},{"name":"MARTYN","text":"Did you see the size of that Zirnberk bloke? I don't fancy gettin' on the wrong end of that sword of his. Hmm... I'm not sayin' it will, but if anythin' were to happen to me before the match, I'll need you to take my place, like that time with Whastrach."},{"name":"MARTYN","text":"&lt;sigh&gt; I'm not lookin' forward to this one bit. Maybe I should try takin' my mind off of it by concentratin' on the guild, startin' with P'yandih and Nutiba's next lesson."},{"name":"MARTYN","text":"I've got a few loose ends to tie up first, so why don't you go and learn Exuviation in the meantime? You never know when a decent healin' spell might prove useful."},{"name":"MARTYN","text":"Now go, <span class=\"highlight\">Forename</span>!"}],"reward":{"gil":855},"reqs":{"jobs":[{"lvl":55,"id":129}],"quests":[69269]},"next":[69271]},"partials":[{"type":"npc","id":"1026852","obj":{"i":1026852,"n":"Martyn","l":41,"q":12}},{"type":"quest","id":"69269","obj":{"i":69269,"n":"Something Borrowed, Something Blue","g":166,"l":"Ul'dah","s":530,"f":1}},{"type":"quest","id":"69271","obj":{"i":69271,"n":"Blue in the Face","g":166,"l":"Ul'dah","s":580,"f":1}}]}