{"quest":{"name":"Blue Scream of Death","location":"Ul'dah","id":69272,"patch":5.15,"sort":600,"icon":100943,"unlocksFunction":1,"eventIcon":71341,"issuer":1026852,"target":1026852,"genre":166,"journal":["Martyn is unnervingly chipper for someone about to be attacked by a very large man with a very large sword.","Despite the upcoming match against Siegfried looming over him, Martyn seems to be in high spirits. Having avoided any major catastrophes, it appears that there is no need for you to act as his replacement after all, and your mentor claims to be in top form. Since there is still time remaining before he is due to appear in the arena, he takes the opportunity to attend to some outstanding matters, leaving you to wait for him at the Blue Mages' Guild. When Royse arrives to check up on Martyn, she is livid but not entirely surprised that he should suddenly disappear so close to the battle, though as Latool Ja points out, he may have gone to gather information on his opponent. Since Siegfried is a renowned gladiator at the Coliseum, it stands to reason that Martyn would have headed there to make his inquiries.","After quizzing some of the spectators and combatants at the Coliseum, you and Royse discover that Martyn had in fact made his way here. Though much of what you hear is largely irrelevant, you are able to glean some semblance of useful information. It would appear that he was hoping to uncover whether Siegfried possesses any weaknesses he may be able to exploit, which is an uncharacteristically methodical approach for someone known for never being adequately prepared for anything.","You return to Royse to share your findings, and it is not long before Martyn himself finally shows up, claiming that he was merely seeking to gain the upper hand in the bout with Siegfried. Satisfied that he has discovered a strategy by which he may vanquish the formidable gladiator, he leads the way to the Celestium.<br><br>The crowd erupts as Martyn steps into the arena dressed as the Great Azuro, while Siegfried emerges equipped in a suit of Garlean magitek, with an impossibly large greatsword in one hand and an enormous firearm in the other. Martyn displays his unique brand of unfounded optimism despite having no idea of Siegfried's true capabilities, and opens the match with an impressive array of blue magic spells. His hulking opponent is unable to withstand the assault, and it appears that the Great Azuro has secured a flawless victory.<br><br>However, before the winner can be announced, Martyn comes to the realization that Siegfried is standing right behind him, while the fallen foe on the other side of the arena vanishes in a puff of smoke. The tables having been turned in a heartbeat, Siegfried blasts Martyn at point-blank range with his firearm, only for the blue mage to repel the attack with Mighty Guard. A barrage of cannon fire rains down on the barrier until Martyn can maintain it no longer, and he crumples to the sand. The gladiator draws closer and aims his firearm at his hapless foe, offering an opportunity to surrender, but Martyn seizes the opening and makes a last-ditch attack with Self-destruct.<br><br>Every spectator in the Celestium is struck silent, and when the smoke finally clears, Martyn is lying motionless, while Siegfried remains on his feet, seemingly none the worse for wear. He admits that he was only saved by his armor and appeals to Fyrgeiss to allow a rematch. Since his original opponent is unlikely to be fit to appear in the arena any time soon─and may even be dead, as nobody has bothered to check whether he is still breathing─you are chosen as his replacement to defend the reputation of the Blue Mages' Guild and to keep the Celestium under Royse's ownership.","Now that the dust has settled, it seems that Martyn has escaped relatively unscathed, though the fate of the Celestium now rests on your shoulders. Doubt has been cast on Martyn's claims that blue mages can adapt to any situation, and he feels it necessary to discard the research materials he has compiled and start afresh. He asks that you lead a party comprised entirely of blue mages and test the effectiveness of various strategies, which may also serve as means to prepare for the confrontation with Siegfried.<br><br>※The next blue mage quest will be available from Martyn after completing stage 30 of the Masked Carnivale."],"objectives":["Gather information at the Coliseum.","Speak with Royse.","Speak with Martyn."],"dialogue":[{"name":"MARTYN","text":"I know you're keen to help me get ready to face Siegfried, but you still haven't learned Frog Legs."},{"name":"SYSTEM","text":"The next blue mage quest will be available from Martyn upon learning Frog Legs."},{"name":"MARTYN","text":"Mastered Frog Legs, have you? Jolly good."},{"name":"MARTYN","text":"But luckily for you, I'm in tip-top shape, so you won't be standin' in for me after all. Finally, that Siegfried bastard's gonna get what's comin' to him for challengin' the Great Azuro!"},{"name":"MARTYN","text":"I haven't got long until the match, but I've got one or two things to take care of before I step into the arena. Don't worry, I'll be steerin' clear of dragon peppers and the like!"},{"name":"ROYSE","text":"Darlings! Wait, where's Martyn?"},{"name":"ROYSE","text":"\"Things to take care of“!? I'm at my wit's end as it is, and him disappearing all of a sudden is not bloody helping. Gods, I've never met anyone so infuriating! We'd better find him, and quickly."},{"name":"LATOOLJA","text":"Latool Ja think Martyn looking for information on Siegfried. Martyn was muttering “Fail to prepare is prepare to fail,” or something. Heard it from Nutiba, it seems."},{"name":"LATOOLJA","text":"Maybe he went to Coliseum? Siegfried very famous there."},{"name":"ROYSE","text":"But the match will be starting soon! Why has he waited until now? Finding out about his opponent should've been the very first thing he did, not the last!"},{"name":"ROYSE","text":"Not to mention that if he doesn't get back here in time, he'll have to forfeit the match! All right, let's head to the Coliseum and ask if anyone's seen him."},{"name":"LATOOLJA","text":"Usually, Martyn never prepare for anything, so this big improvement for him!"},{"name":"ROYSE","text":"I doubt that Martyn wants anyone to know that the Great Azuro is seeking information on Siegfried, so he probably changed out of his costume. In other words, there's no use asking if they've seen a man in a blue hat and cape."},{"name":"GENEVIEVE","text":"A man asking about Siegfried? Why yes, as a matter of fact, a rather slovenly fellow was making inquiries of that nature, if you must know."},{"name":"GENEVIEVE","text":"And might I add, I am extremely disappointed that one of the Coliseum's most respected gladiators would stoop so low as to appear in that ridiculous circus they hold at the Celestium these days. Has he no shame?"},{"name":"GLADIATOR03736","text":"Yes, he was here. Kept pestering me with questions about Siegfried. Wanted to know what techniques he uses, and whether he has any weaknesses."},{"name":"GLADIATOR03736","text":"It was plain he wanted to find out how Siegfried could be beaten. So I gave it to him straight and told him that he <span class=\"emphasis\">couldn't</span> be beaten. Not in the Coliseum, and not in the Celestium neither."},{"name":"ULDAHNCITIZEN03736","text":"Yes, yes, he was here a few moments ago. It seems everyone's talking about Siegfried!"},{"name":"ULDAHNCITIZEN03736","text":"Ah! His match with the Great Azuro is about to begin! Oh gods, I hope I make it in time!"},{"name":"GENEVIEVE","text":"A ridiculous circus, is what that dreadful Masked Carnivale is─a mockery of honorable combat! Why, were my beloved Franz ever to make an appearance there, I...might be persuaded to temporarily lower my standards and visit the Celestium..."},{"name":"GLADIATOR03736","text":"From the way he was asking, you'd think he was planning to fight Siegfried himself. Hmph! Skinny runt like him would end up being split right down the middle."},{"name":"ROYSE","text":"So, it's as Latool Ja predicted. He really was here after all."},{"name":"MARTYN","text":"<span class=\"highlight\">Forename</span>? Royse? What brings you here?"},{"name":"ROYSE","text":"I should ask you the same thing!"},{"name":"ROYSE","text":"You're supposed to be at the Celestium, in costume, so what the hells do you think you're playing at!?"},{"name":"MARTYN","text":"All right, love, keep your hair on! I'm only askin' about my opponent, is all. I'm in the middle of “failing to prepare”! No wait, that's not right..."},{"name":"MARTYN","text":"Anyway, it's as I thought. That ploddin' goobbue only knows how to attack from close quarters, so all I have to do is bombard him with my best spells before he has a chance to get near me! What could possibly go wrong?"},{"name":"MARTYN","text":"Now, the time has come for Siegfried to taste my wrath! To the Celestium!"},{"name":"BLUESKYMC","text":"Ladies and gentlemen, boys and girls! The contest you've all been waiting for is about to begin!"},{"name":"BLUESKYMC","text":"Master of knowledge beyond the comprehension of mere mortals, and wielder of arcane magicks as unfathomable as the deepest ocean... The indomitable keeper of the blue has come!"},{"name":"BLUESKYMC","text":"The Great Azuuuroooooo!"},{"name":"BLUESKYMC","text":"Introducing his opponent, stepping straight from the pages of myth, the peerless swordsman and champion of the Coliseum..."},{"name":"BLUESKYMC","text":"Sieeegfrrrieeed!"},{"name":"BLUESKYMC","text":"I can't believe my eyes, ladies and gentlemen! I've never seen such a drastic transformation!"},{"name":"FYRGEISS","text":"As we all know, the Great Azuro is fond of his little tricks, so Siegfried decided to prepare a few of his own."},{"name":"FYRGEISS","text":"At Amajina & Sons Mineral Concern, we research various technologies, including Garlean magitek, and have restored several armaments salvaged from the battlefield."},{"name":"ROYSE","text":"Magitek!? I don't remember any stories about Siegfried wearing Garlean armor and carrying a hand cannon!"},{"name":"MARTYN","text":"Fear not! It will take more than some hurriedly cobbled-together potlids and a child's popoto launcher to best the Great Azuro!"},{"name":"MARTYN","text":"But enough talk. Have at you!"},{"name":"MARTYN","text":"Know your folly, Siegfried!"},{"name":"MARTYN","text":"&lt;pant&gt; &lt;pant&gt; You never stood a chance against the Great Azuro!"},{"name":"BLUESKYMC","text":"The Great Azuro repels Siegfried's surprise attack in the nick of time!"},{"name":"MARTYN","text":"I shall never succumb to a shameless cheat like you!"},{"name":"BLUESKYMC","text":"Such determination! This match is not over yet!"},{"name":"ZIRNBERK","text":"Impressive, but the time has come for you to admit defeat."},{"name":"MARTYN","text":"Never!"},{"name":"MARTYN","text":"I'm taking you down with me!"},{"name":"BLUESKYMC","text":"Incredible! Even after the Great Azuro's reckless final attack, the challenger is still standing! Victory goes to Siegfried!"},{"name":"ZIRNBERK","text":"Such power... It was only this magitek armor that saved me. Without it, I would have been blown to pieces."},{"name":"ZIRNBERK","text":"Father, for the sake of my honor, I demand a rematch!"},{"name":"FYRGEISS","text":"Hm... If that is what you desire...though it would appear the poor fool is in sore need of an infirmary bed. Or perhaps a coffin..."},{"name":"ZIRNBERK","text":"If the Great Azuro is in no fit state to fight, then I have no option but to request a replacement."},{"name":"ZIRNBERK","text":"Azuro the Second, I challenge you!"},{"name":"BLUESKYMC","text":"Good gods almighty! I can scarcely imagine what the next match holds in store!"},{"name":"BLUESKYMC","text":"With the Great Azuro lying broken and defeated, it falls to his gifted protégé to avenge him!"},{"name":"ROYSE","text":"Siegfried's conscience got the better of him, though I don't imagine Fyrgeiss will be too thrilled."},{"name":"LATOOLJA","text":"Poor Martyn. It all going so well until Martyn decide to blow himself up."},{"name":"MARTYN","text":"Royse... I'm so sorry."},{"name":"MARTYN","text":"To be honest, after he broke through my Mighty Guard, I knew he had me beaten. The best I could hope for was to force a draw, and we all know how that went."},{"name":"MARTYN","text":"And a fat lot of good all my checkin' beforehand did. If I'd known he'd come dressed in magitek, wavin' a soddin' <span class=\"emphasis\">cannon</span>, I'd have... Well, I dunno. Not much I could've done, I suppose."},{"name":"ROYSE","text":"You shouldn't be so hard on yourself, Martyn. It really was an incredible match, and you very nearly beat him."},{"name":"ROYSE","text":"In any case, the wager to decide ownership of the Celestium is still on."},{"name":"ROYSE","text":"It's all down to you now, <span class=\"highlight\">Forename</span>. Siegfried's as strong as an aurochs, cunning as a fox, and slippery as an eel, so you'll need to keep your wits about you."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Siegfried is a choir boy compared to me. A choir boy!"},{"name":"A1","text":"So, once again, it falls to me to settle Martyn's disputes."},{"name":"A1","text":"..."},{"name":"ROYSE","text":"Well, well! You certainly sound confident!"},{"name":"ROYSE","text":"Yes, although I hope that, one day, Martyn's abilities will catch up with that mouth of his. No offense, dear."},{"name":"ROYSE","text":"So, you'd prefer to let your skills do the talking, is that it? Perhaps Martyn could stand to learn a thing or two from you."},{"name":"ROYSE","text":"Anyway, there is still time to prepare, so make sure you have everything in order before your showdown with Siegfried. I wish you luck."},{"name":"MARTYN","text":"Gods, I've made a right mess of all this. Blue magic “perfect for every occasion”? No one's gonna believe that now... I might as well throw all my research down the privy."},{"name":"MARTYN","text":"Unless you're willin' to help me out? If you went explorin' with a few other blue mages, I'd be able to compile the information into a log of some sort, which I can use to help plan new strategies."},{"name":"MARTYN","text":"I've added a few pages to the back of your blue magic spellbook to help keep track of everythin'. Each time you make it out of one of those places alive, you'll get a reward."},{"name":"MARTYN","text":"We've even got special blue mage gear to trade for any you've collected. Best of all, every item is endorsed by yours truly."},{"name":"MARTYN","text":"Thal's balls! What am I talkin' about that for? There'll be plenty of time for that after you've beaten Siegfried!"},{"name":"MARTYN","text":"Now go, Azuro the Second! Avenge your master and restore honor to the Blue Mages' Guild!"},{"name":"SYSTEM","text":"New stages have been added to the Masked Carnivale, and can be accessed by speaking with the Celestium attendant."},{"name":"SYSTEM","text":"In addition, the blue mage log can now be accessed via the blue magic spellbook."},{"name":"SYSTEM","text":"By speaking with Latool Ja, you can trade Allied Seals for various items, some of which may prove useful in your adventures."}],"reward":{"gil":810},"reqs":{"jobs":[{"lvl":60,"id":129}],"quests":[69271]},"next":[69273]},"partials":[{"type":"npc","id":"1026852","obj":{"i":1026852,"n":"Martyn","l":41,"q":12}},{"type":"quest","id":"69271","obj":{"i":69271,"n":"Blue in the Face","g":166,"l":"Ul'dah","s":580,"f":1}},{"type":"quest","id":"69273","obj":{"i":69273,"n":"Blue Cheese","g":166,"l":"Ul'dah","s":601,"f":1}}]}