{"quest":{"name":"One Final Journey","location":"Mor Dhona","id":69286,"patch":5.1,"sort":10,"icon":100942,"eventIcon":71221,"issuer":1018433,"target":1030875,"genre":66,"journal":["F'lhaminn appears lost in her memories.","You happen upon F'lhaminn at the House of Splendors, distracted by memories of the past. A missive in her hand summons her to Ul'dah, and though unable to go into detail, she tells you the matter pertains to Minfilia. In light of all you have been through with her adopted daughter, she believes that your presence would only be fitting. Thus does she invite you to accompany her, bidding you go ahead to the Steps of Thal.","The soft echo of boots marks F'lhaminn's arrival, and soon after the two of you are greeted by Popokkuli and Seserukka of Amajina & Sons Mineral Concern. According to the twins, the Concern was tasked with the restoration of Ul'dah's waterways, in the course of which they made a surprising discovery─a cat's-eye jewel. F'lhaminn confirms that it is the very same as that which Minfilia gifted to her many years ago. And in her turn, she returned the stone to Minfilia shortly before the Scions left the Waking Sands for Mor Dhona. That it should find its way back to her now is nothing short of miraculous, and F'lhaminn sees it as a chance to lay her daughter to rest. She can think of no better place to do so than at the Church of Saint Adama Landama, where Minfilia's father lies.","You arrive to find F'lhaminn speaking with Father Iliud. Upon hearing of Minfilia and the gemstone, the father gives you his blessing to bury the cat's-eye with Warburton. Offering her thanks, F'lhaminn heads outside to the site of his grave, south of the church.","Placing the cat's-eye in the earth, F'lhaminn lays her heart bare to Minfilia, hopeful that the words reach her daughter. With her heart thus unburdened, she makes her way back to Mor Dhona, there to continue doing her part for the Scions."],"objectives":["Wait at the designated location in Ul'dah on the Steps of Thal.","Speak with Father Iliud at the Church of Saint Adama Landama in eastern Thanalan.","Speak with F'lhaminn."],"dialogue":[{"name":"FLHAMINN","text":"...Oh, <span class=\"highlight\">Forename</span>. Forgive me, I did not see you there."},{"name":"FLHAMINN","text":"Ever since you spoke to me of your last moments with Minfilia, I find myself often thinking of the moments I shared with her."},{"name":"FLHAMINN","text":"And it was during one such moment of remembrance that a missive arrived from an acquaintance in Ul'dah."},{"name":"FLHAMINN","text":"Even now I can scarcely believe the letter's contents, written as if in answer to my heart's lamentations. Such fortuitous timing is nothing short of a miracle. No less than your arrival here this day, I should think."},{"name":"FLHAMINN","text":"I am about to depart for the sultanate to meet with my acquaintance, you see, and I cannot think of a better companion for this journey than you. Will you not indulge me with your company?"},{"name":"FLHAMINN","text":"I would not begrudge your absence, but if you are so inclined, it would mean more to me than you know."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"How could I refuse?"},{"name":"A2","text":"Is this something to do with Minfilia?"},{"name":"A3","text":"I suppose if I must."},{"name":"FLHAMINN","text":"You are too kind, my friend."},{"name":"FLHAMINN","text":"Indeed it is. If what is written in the missive is true, I may yet have a chance to offer her a proper and final farewell."},{"name":"FLHAMINN","text":"I understand more pressing matters likely demand your attention, but If what is written in the missive is true, you deserve to be there."},{"name":"FLHAMINN","text":"We are to meet on the Steps of Thal, in front of Eshtaime's Aesthetics. Pray go ahead. I will be along shortly."},{"name":"FLHAMINN","text":"You needn't wait for me. Pray set out when you are ready, and meet me in front of Eshtaime's Aesthetics on the Steps of Thal."},{"name":"FLHAMINN","text":"I hope I have not kept you waiting overlong."},{"name":"POPOKKULI","text":"(-???-)F'lhaminn! Thanks for coming on such short notice."},{"name":"POPOKKULI","text":"And who are you? If you don't mind, we and the lady here have private matters to discuss."},{"name":"FLHAMINN","text":"No, it's quite all right, Popokkuli. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> was with Minfilia in her final moments, you see, and I thought it only right that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> be present."},{"name":"POPOKKULI","text":"<span class=\"highlight\">Forename</span>, what a coincidence. What brings you here? "},{"name":"FLHAMINN","text":"Ah, you're acquainted. Then I needn't worry about introductions. <span class=\"highlight\">Forename</span> was with Minfilia in her final moments, you see, and I thought it only right that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> be present. "},{"name":"POPOKKULI","text":"And I can't say we were expecting you at all, <span class=\"highlight\">Forename</span>. Though I suppose you do have a knack for assisting in matters of the dearly departed."},{"name":"FLHAMINN","text":"So, is it true, my friends? Did you find it?"},{"name":"SESERUKKA","text":"To start from the beginning, the Concern was contracted to work on the waterways below Ul'dah."},{"name":"SESERUKKA","text":"Naturally, this included reconstruction of the Sil'dih Aqueducts."},{"name":"FLHAMINN","text":"The place Minfilia and the others fled after the ill-fated banquet..."},{"name":"SESERUKKA","text":"Aye. And while we were clearing out the tunnel, a glint amidst the debris caught our attention."},{"name":"POPOKKULI","text":"Cat's-eye. At first we wondered how it got to be there of all places. But then we remembered the stone Minfilia gave you all those years ago..."},{"name":"FLHAMINN","text":"There's no mistake about it. This is the selfsame stone."},{"name":"FLHAMINN","text":"The very first stone she ever unearthed, in those halcyon days when she was still called Ascilia."},{"name":"FLHAMINN","text":"She was beaming with pride when she presented it to me. It was a gift I would treasure for years to come."},{"name":"FLHAMINN","text":"Until the day came when she needed it more than I. She seemed so lost that day in the Waking Sands."},{"name":"FLHAMINN","text":"I knew that the cat's-eye would remind her of how far she had already come. And instill her with a little more courage to take the next step."},{"name":"FLHAMINN","text":"To think she wore it all this time..."},{"name":"POPOKKULI","text":"When we searched the waterways shortly after the collapse, we didn't find a trace of the Scions. No belongings or anything. Curious that it would appear after all this time."},{"name":"FLHAMINN","text":"With the stone in hand, Minfilia pressed onward in her quest for true peace. Never once did she look back."},{"name":"FLHAMINN","text":"And though she is gone, her legacy lives on─in you, <span class=\"highlight\">Forename</span>, and the Scions. And in the child Ryne."},{"name":"FLHAMINN","text":"Safe in the knowledge that others continue to walk her path, she has sent this stone back to me. This I choose to believe."},{"name":"FLHAMINN","text":"She has earned her rest. I shall bury this stone, that she might have peace in the hereafter."},{"name":"SESERUKKA","text":"Where are you thinking?"},{"name":"FLHAMINN","text":"Next to where her father rests."},{"name":"SESERUKKA","text":"Indeed, there's no better place than with your loved ones."},{"name":"POPOKKULI","text":"Well, you're doubtless keen to see to that, so we won't keep you any longer. We'll find a moment to go and pay respects ourselves afterwards. Till next time, take care."},{"name":"FLHAMINN","text":"Thank you. Both of you."},{"name":"FLHAMINN","text":"Warburton was interred here in Ul'dah at Erralig's Burial Chamber, but around the time of the Scions' founding, he was moved to the Church of Saint Adama Landama, under the care of Father Iliud."},{"name":"FLHAMINN","text":"Come, <span class=\"highlight\">Forename</span>. Let us seek out the father and request his permission to bury the stone."},{"name":"FLHAMINN","text":"Forgive me, <span class=\"highlight\">Forename</span>, I just need a moment alone. I will be along to the church ere long."},{"name":"FLHAMINN","text":"Ah, there you are. I was just telling Father Iliud about Minfilia and the cat's-eye."},{"name":"ILIUD","text":"Welcome, my <span class=\"alternative-container\"><span class=\"alternative\">child</span><span class=\"alternative\">son</span></span>, welcome. F'lhaminn has explained to me the purpose of your visit, and I see no reason to refuse you. Minfilia would wish to rest with her father."},{"name":"ILIUD","text":"I have known her since she was but a child. Full of hope and wonder─an aspiring young miner following in F'lhaminn's footsteps."},{"name":"ILIUD","text":"A dutiful student to be sure. Nary a day passed that she did not set out into the wilderness with a pickaxe in hand."},{"name":"ILIUD","text":"But fate would see her set aside the miner's tools and instead don a mantle of far greater responsibility."},{"name":"ILIUD","text":"She was as passionate then as she was in her childhood, a fire in her eyes that refused to be extinguished. It was that flame that compelled me to lend the Scions my support without a moment's hesitation."},{"name":"ILIUD","text":"To now see so many brave and noble souls continue her work... It only reaffirms that I was right to place my faith in her."},{"name":"ILIUD","text":"Ah, forgive my meandering musings─you have not come to hear me wax nostalgic. Pray see to burying the cat's-eye. The Twelve's blessings be upon you."},{"name":"FLHAMINN","text":"Thank you, Father Iliud."},{"name":"FLHAMINN","text":"Come, <span class=\"highlight\">Forename</span>. Warburton's grave is just south of the church."},{"name":"ILIUD","text":"It takes great strength to raise a child. And it takes even greater strength to let a child walk her own path, though it leads to danger. I have naught but respect for F'lhaminn."},{"name":"FLHAMINN","text":"Here it is, <span class=\"highlight\">Forename</span>."},{"name":"FLHAMINN","text":"&lt;sigh&gt; It was twenty years ago that Warburton came to Ul'dah, risking life and limb to warn us of the threat encroaching on Eorzea."},{"name":"FLHAMINN","text":"...Twenty years ago that my ambition robbed him of his life. A daughter of her whole family."},{"name":"FLHAMINN","text":"You would have been so proud of her. She was a warm, compassionate, and vibrant woman, always ready to answer the clarion call of duty without a moment's hesitation. Just like her father. In the end, that selflessness would save not one, but two worlds."},{"name":"FLHAMINN","text":"Now her duty has ended. And though you are worlds apart, I pray with this stone, this precious gem from Ascilia, a part of her remains at your side."},{"name":"FLHAMINN","text":"Just as she remains forever in my heart."},{"name":"FLHAMINN","text":"Oh, Ascilia. Never did I imagine such greatness could be born from a beginning so humble."},{"name":"FLHAMINN","text":"I am proud to have been there for that first little triumph. Not only did you find a gemstone─you found your own path."},{"name":"FLHAMINN","text":"That path took you far away, to a place fraught with danger. But you have achieved all that you ever desired. And you have returned."},{"name":"FLHAMINN","text":"Rest now, Ascilia. My dearest daughter."},{"name":"FLHAMINN","text":"Won't you say a few words too?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Leave the rest to us."},{"name":"A2","text":"Your legacy lives on."},{"name":"A3","text":"You can rest now, Minfilia..."},{"name":"FLHAMINN","text":"There is much I've left unsaid to Ascilia. But I feel as though a weight has been lifted."},{"name":"FLHAMINN","text":"With a lighter heart, I shall return to Mor Dhona and resume doing my little part for the Scions. For her legacy."},{"name":"FLHAMINN","text":"Wherever you may be headed, please take care. And when you meet them, do pass my regards to Thancred and Ryne and all the others."},{"name":"FLHAMINN","text":"Thank you, <span class=\"highlight\">Forename</span>. For everything."}],"reward":{"gil":1373},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69218]}},"partials":[{"type":"npc","id":"1018433","obj":{"i":1018433,"n":"F'lhaminn","l":67,"q":4}},{"type":"npc","id":"1030875","obj":{"i":1030875,"n":"F'lhaminn","l":44,"q":1}},{"type":"quest","id":"69218","obj":{"i":69218,"n":"Vows of Virtue, Deeds of Cruelty","g":9,"l":"Eulmore","s":100}}]}