{"quest":{"name":"Of Ardor and Argument","location":"Gridania","id":69288,"patch":5.1,"sort":187,"icon":100959,"unlocksFunction":1,"eventIcon":71341,"issuer":1032132,"target":1032132,"genre":196,"journal":["Lisette has returned to share the ardor and affection of House Valentione with lovelorn Eorzeans the realm over.<br>※This quest is available for a limited time only.","Lady Lisette de Valentione greets you and welcomes you to the Valentione's Day festivities, which have returned to Gridania anew this year. Though she wishes nothing more than to spread ardor and affection─as her house words are writ─across all of Eorzea, she finds herself in the midst of a most disheartening dispute. To wit, her three would-be protégés─including her sister Astrid, to whom Lisette is partial─are bickering over which of them most deserves to assume the role of emissary of love for this year's festival. To that end, Lady Lisette proposes a contest: the three will listen to the plight of a lovelorn Gridanian and each offer their advice, after which a vote will be held, and the most insightful and inspired of the three declared the victor. Tasked with seeing that the competition proceeds with due impartiality, you agree to accompany the three would-be emissaries to interview their subject.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Together with Lady Lisette's three compatriots─the ambitious Astrid, the brash-yet-bold Bert, and the restrained Rodrigault─you approach the Gridanian whose lonely heart the three will compete to provide succor. Though he insists on keeping his true identity a secret, he is more than forthcoming with details regarding his struggles in finding his eternal love. Enlightened as to the nature of the man's plight by both his own words and additional details offered by Rodrigault, the three emissaries split up to ponder the matter and formulate a plan of action. Speak to each of them and see what words of wisdom they intend to offer the yearning young man.","Astrid, Bert, and Rodrigault in turn convey to you with supreme confidence the advice they plan to offer the lovesick lad, each seeming utterly convinced that they can count on your support in the forthcoming vote. Needless to say, you can only pick one of the three to support. You resolve to weigh your options well as you head back to the amphitheatre to report to Lady Lisette.","You report to Lady Lisette, who is tickled pink to hear that all three of her protégés are approaching the contest in earnest. She further informs you that the preparations for the Valentione's Ceremony have been completed, and that─should you yourself be in search of true love─you are welcome to take part in it whenever you desire. She encourages you to enjoy the festivities to your heart's content before rendering your decision as to which of her three colleagues you wish to support. When your decision is made, seek out the emissary of your choice where they await you in Old Gridania, that you might assure them of your support."],"objectives":["Wait for your client near the Whistling Miller.","Speak with the emissaries of ardor.","Speak with Lisette de Valentione."],"dialogue":[{"name":"LISETTE","text":"My love burns brighter than the sun, and deeper than the sea. Gladly would I share it with thee, and thee, and...ooh, most <span class=\"emphasis\">definitely</span> thee!"},{"name":"LISETTE","text":"Oh! But if it isn't a sight to set my flames of passion further alight! How fares my favorite emissary of ardor and affection?"},{"name":"LISETTE","text":"The merest glance into your eyes tells me that you are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> within whom passion runs deep. Might you be willing to serve me in my sworn quest to bring true love to pining hearts across Eorzea?"},{"name":"LISETTE","text":"Lovely! Without further ado, allow me to explain my plight. As it were, I had a mind to entrust the primary duties as emissary of ardor this year to my dearest sister Astrid. Why, if she were to rise to the challenge and prove herself my equal, just think of the unbounded love we might spread o'er the realm together!"},{"name":"LISETTE","text":"And yet, I fear my best-laid plans have already begun to go awry. Upon hearing of my decision, two of my esteemed colleagues took umbrage, believing that I was playing favorites. How could I not see, they insisted, that <span class=\"emphasis\">they</span> would be more suited for the task than my as-of-yet-unseasoned sister."},{"name":"LISETTE","text":"And so, on the eve of what should be the year's paramount celebration of love and romance, we find ourselves... Well, why not bear witness to this unfortunate display for yourself?"},{"name":"LISETTE","text":"Verily, these three are in need of outside intervention─someone who can convince them to put their petty squabbles aside in the name of spreading love and joy as befits the season. Someone like <span class=\"emphasis\">you</span>, my most passionate friend! What say you?"},{"name":"LISETTE","text":"Wonderful! I knew you would never let me down. Well, then...shall we?"},{"name":"LISETTE","text":"My dearest colleagues! I would hear your thoughts on a matter of utmost importance. Pray curtail your discussion and come hither for just a moment."},{"name":"LISETTE","text":"...I said stop your godsdamned squabbling and get your worthless arses over here before I kick them from here to Coerthas!"},{"name":"LISETTE","text":"Ahem! Now, where was I? Ah, yes..."},{"name":"LISETTE","text":"My beloved friends. Whatever would the illustrious Countess Arabelle think if she saw us bickering amongst ourselves like this? On the eve of the holiday honoring her most illustrious legacy, no less!"},{"name":"LISETTE","text":"And so, I would propose a solution fair for one and all. The three of you will each try your hand at easing the worries of a young man lost in love. The one who proves him or herself most suited for the task will be rewarded by being named high emissary of ardor for this year's festivities!"},{"name":"LISETTE","text":"Worry not, for it is not I who will be judging your worth. <span class=\"highlight\">Forename</span> here, an adventurer of no small renown and inimitable impartiality, will serve as arbiter for the challenge─along with the citizens of Gridania who we have traveled here to serve, of course."},{"name":"LISETTE","text":"Surely, none of you could object to such an unbiased contest, yes? Simply think of it as an opportunity to show off your mastery in matters of love to a truly discerning audience."},{"name":"ASTRID","text":"Leave it to me, Sis─er, Lady Lisette. I will bring the succor of love to this man's lonely heart, and show once and for all that I am your most worthy successor."},{"name":"BERT","text":"A contest, you propose? Then a contest it shall be! I, Bert the Beloved, shall summon the full depths of passion from my burning heart and set this young man aflame with all-consuming zeal and ardor!"},{"name":"RODRIGAULT","text":"...True love cannot be achieved by spouting simple platitudes, nor by the brute force of blind passion. I will use my surpassing knowledge of the subtleties of the heart to achieve that which the two of you could scarce begin to comprehend."},{"name":"LISETTE","text":"Such confidence! Such devotion to your duty! Why, it is enough to make a young lady swoon. Would you not agree, <span class=\"highlight\">Forename</span>? Now, then. Without further ado, allow me to introduce the subject of your first trial..."},{"name":"LISETTE","text":"Recently, I was approached by a young man who spoke of his plight thusly: “How am I ever to find true love, if I scarce have occasion to even encounter the fairer sex?”"},{"name":"LISETTE","text":"A most sad state of affairs, yes? Truly, my heart goes out to this poor man. And yet, surely his dark days of solitude and seclusion are over, yes? Verily, for three of the most capable and confident emissaries of ardor will now rush to his aid!"},{"name":"LISETTE","text":"...Ah, yes. There is but one small rub. The young man in question would prefer to remain anonymous, and needless to say, we must respect his wishes. He has placed his trust in us, and it simply would not do for us to trumpet his heart's deepest desires to all and sundry."},{"name":"LISETTE","text":"I am counting on you, dearest <span class=\"highlight\">Forename</span>. Follow my dear colleagues to the man's side, witness their heartfelt efforts, and choose the one who you believe is most devoted to and capable of bringing love into his life."},{"name":"LISETTE","text":"Now go forth to the Whistling Miller, my emissaries of ardor, and let your presence be a beacon of light to cast the shadows from the heart of this lonely young man! Should your confidence falter, remember that the Countess Arabelle is always watching over you from above!"},{"name":"ASTRID","text":"I have studied and trained harder than anyone to prepare myself for this day. I may be Lisette's own blood, but it is not nepotism or favoritism by which I was chosen for this role. I will show this once and for all!"},{"name":"BERT","text":"Hah! What can that wet-behind-the-ears wisp of a girl accomplish that Bert the Beloved cannot? Nothing at all, that is what! Once I assume my rightful position as this year's emissary of ardor, Gridania─nay, the whole realm─shall be blessed with the most passionate Valentione's Day in history!"},{"name":"RODRIGAULT","text":"When it comes to matters of love, it is all too easy to lose sight of one's better judgment. This is why it is important to remain calm and collected at all times. Only I understand this─and that, I daresay, is why I am the only <span class=\"emphasis\">rational</span> choice for the job."},{"name":"LISETTE","text":"Go forth to the Whistling Miller, my friend! A young heart pines and yearns, and <span class=\"emphasis\">you</span> must ascertain for me which of my dearest colleagues is most up to the task of delivering the succor of sweet affection!"},{"name":"ASTRID","text":"Ah! If 'tis not my kindred spirit in ardor and affection, the always-amorous, ever─er... Apologies, my friend. I fear I've not quite mastered my sister's rather...<span class=\"emphasis\">distinctive</span> manner of speech. "},{"name":"ASTRID","text":"Well met, my adventuring friend! Though we have just met, I can see that your eyes burn with the brightest of passion. I am Astrid, kin to Lady Lisette and an aspiring emissary of love in my own right!"},{"name":"BERT","text":"I am Bert the Beloved, whose passion and fervor for matters of the heart are sung of the realm─nay, the <span class=\"emphasis\">world</span> over! Like the brightest blaze does my heart burn, that it might kindle the romantic spirit of every soul I meet!"},{"name":"RODRIGAULT","text":"...Rodrigault, at your service. Since my childhood years, I have studied the art of love with a scholarly devotion unlike any other. I daresay there is not a single love poem or amorous tale that I have not read and analyzed a hundred times over. Little wonder, then, that my knowledge in the field vastly outstrips that of my peers."},{"name":"ASTRID","text":"So you must be the yearning young man of whom Sister spoke. What troubles you this day? Open your sequestered heart to us, friend, and speak unto us your worries, that we might fill your lonely heart with the warmth of ardor and affection."},{"name":"YWAIN","text":"(-Pining Gridanian-)I, ah..."},{"name":"BERT","text":"Be not shy, my good man! In matters of the heart, one must be bold, lest you live the rest of your days in the shadow of those who have the courage to claim what you do not! Now then, let us know precisely that which you struggle, that we might come to your aid!"},{"name":"RODRIGAULT","text":"...Do not let my colleagues intimidate you. Let me, Rodrigault, know just what concerns you, and I shall use my powers of deduction to find a logical solution to your plight."},{"name":"YWAIN","text":"(-Pining Gridanian-)...Very well. I know not what I have done to deserve your services, but I accept them with gratitude."},{"name":"ASTRID","text":"Then let us proceed, shall we? In the name of fairness and objectivity, I propose that <span class=\"highlight\">Forename</span> here carry out the questioning. No objections, I take it? Excellent. <span class=\"highlight\">Forename</span>, the subject is all yours."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What do you do for a living?"},{"name":"A1","text":"How do you spend your spare time?"},{"name":"A1","text":"What are you looking for in a partner?"},{"name":"YWAIN","text":"(-Pining Gridanian-)My profession? If it is all the same to you, I would rather keep the finer details to myself..."},{"name":"ASTRID","text":"But of course! It is not our intention to pry. You need only tell us as much as you feel comfortable sharing, and nothing more."},{"name":"YWAIN","text":"(-Pining Gridanian-)...Thank you. In that case, let it suffice to say that I perform a rather─how shall I put it?─physically demanding position. As such, I spend many hours of each day training my body for the task."},{"name":"YWAIN","text":"(-Pining Gridanian-)I am not as wealthy as the merchants I often encounter in my duties, but I receive enough in the way of recompense to put food on the table. More than anything, I take pride in having earned the confidence of my subordinates and peers."},{"name":"ASTRID","text":"A strong, confident type who holds a position of influence and commands the respect of many... I, for one, would say our man is a most eligible bachelor, would you not?"},{"name":"YWAIN","text":"(-Pining Gridanian-)Spare time is not something I possess in abundance. What little of it I have, I prefer to spend honing my body and mind that I might better perform my duties."},{"name":"BERT","text":"Come now, my man! Surely there must be <span class=\"emphasis\">something</span> you enjoy! A refreshing dip in a cold, clear stream? Afternoon strolls through the Twelveswood?"},{"name":"YWAIN","text":"(-Pining Gridanian-)Do not get me wrong─such activities sound pleasant enough. Most of all, though, it is serving the people that brings the most joy and fulfillment to my days."},{"name":"BERT","text":"Now <span class=\"emphasis\">that's</span> what I call commitment! What young lady could turn down such an earnest young man? Am I not right?"},{"name":"YWAIN","text":"(-Pining Gridanian-)To be quite honest, I cannot say I have ever given much thought to the matter..."},{"name":"RODRIGAULT","text":"Mind you, we speak not only of physical attributes. Perhaps you prefer a more matured, grounded individual? Someone who shares your tastes in food or drink? Any hint at all would be most welcome."},{"name":"YWAIN","text":"(-Pining Gridanian-)I see. And yet...I am sorry. I fear nothing is coming to mind. After all, how am I to judge my feelings towards someone I have yet to even meet?"},{"name":"RODRIGAULT","text":"...A thoughtful and sensitive soul you are. Worry not, my friend. We shall pry no further on this matter. Thank you for your candor."},{"name":"ASTRID","text":"Thank you very much for your cooperation, <span class=\"highlight\">Forename</span>. Now, if you would just kindly wait a moment, good sir, my colleagues and I will consider your situation and endeavor to offer suitable advice."},{"name":"YWAIN","text":"(-Pining Gridanian-)Understood. And...thank you."},{"name":"BERT","text":"And so the battle begins! And if either of you think that I'll be showing you even the slightest mercy...you'd best think again!"},{"name":"RODRIGAULT","text":"...Beg pardon. Before we continue, there is something I would be remiss not to share with the both of you."},{"name":"RODRIGAULT","text":"There is one small truth that I have been concealing from you thus far. I am, in fact, privy to information about our client that you are not. In the interest of equity, I would share it with you."},{"name":"BERT","text":"What's this!? Been sneaking around behind our backs to spy on the poor man, have we? I knew there was something shifty about you from the start..."},{"name":"RODRIGAULT","text":"It is nothing so dastardly, I assure you. When our masked man first approached Lisette to seek counsel, I could not help but overhear some of the rumors being spread about the man."},{"name":"ASTRID","text":"Is that so!? Well, if you are willing to share this with us, I see no reason for us to refuse. I trust you agree, Bert?"},{"name":"RODRIGAULT","text":"Very well. First of all, the man's claim of having the respect of his peers is no empty boast. Those who know our client speak quite highly of him as a man of integrity and honor."},{"name":"RODRIGAULT","text":"If there is one fault people find with him─as far as I have been able to glean─is that he can be a bit too serious for his own good."},{"name":"ASTRID","text":"I see... That is most enlightening, indeed. Thank you, Rodrigault."},{"name":"BERT","text":"Enlightening indeed! Perhaps I misjudged you, my good man. At any rate, now that all three of us have the same knowledge at our disposal, what say we begin the contest in earnest!?"},{"name":"RODRIGAULT","text":"Let us do just that."},{"name":"ASTRID","text":"Very well, then! My colleagues and I will require a bit of time to ponder the matter, friend. Pray leave us be for a short while, and return at your convenience."},{"name":"ASTRID","text":"Ah, you've returned! Curious as to what advice I intend to offer our lonely soul? I'd be happy to tell you! Put simply, he need only expand his horizons."},{"name":"ASTRID","text":"It is clear, both from talking to the man himself and from what others say of him, that he has a sterling reputation as a leader and a strong pillar of his community."},{"name":"ASTRID","text":"And yet, precisely because he holds a position of import and influence, it is likely not easy for him to find what he seeks at his place of employment."},{"name":"ASTRID","text":"And yet, not having any real interests to speak of outside of his duties, our man's options are sadly limited. That is why I propose that he begin his search for his love among his clients─those who know him well enough to appreciate his strong character, but are not so close as to make such engagement uncomfortable."},{"name":"ASTRID","text":"A most inspired idea, do you not agree? I trust I can count on your support when we take our deciding vote!"},{"name":"BERT","text":"Well, if it isn't the adventurer from before! Want to be the first to hear Bert the Beloved's brilliant idea, do you? Hah! I'd be happy to oblige!"},{"name":"BERT","text":"So we're dealing with a man who's diligent, devoted, and distinguished with regard to his duties. On the other hand, because of this, some find him something of a one-trick chocobo, as it were."},{"name":"BERT","text":"And so, as I see it, the answer is clear as day: he need simply find himself a new pastime! This would afford him an opportunity to go out and meet new faces, and give him a fresh topic to broach with any special someone who strikes his fancy!"},{"name":"BERT","text":"As for what might be appropriate... Ah, but of course! What about woodworking? After all, there is nothing a young lady appreciates more than a man who is handy about the house, no? Talk about killing two ziz with one stone!"},{"name":"BERT","text":"Ah, I can just feel the flames of passion beginning to spark and sizzle! I know not what silly plans my colleagues are proposing, but I can trust you to vote for the obvious choice, yes? But of course I can!"},{"name":"RODRIGAULT","text":"Come to hear my insight, have you? Very well. I ask you: do you recall our friend's response when we asked him what manner of individual he fancies?"},{"name":"RODRIGAULT","text":"Precisely...he had no answer. A man who cannot answer such a simple query is a man who has lost sight of himself and what he truly seeks from life."},{"name":"RODRIGAULT","text":"That is why I intend to propose that our man spend some time at Stillglade Fane when he is off duty. By communing with nature, he might cast off his worldly worries and regain a sense of self, which in turn would afford him greater clarity in his pursuit of love."},{"name":"RODRIGAULT","text":"As devoted as the man is to his training, I have no doubt he would find himself more than up to the task of silent self-reflection. Perhaps he might even discover a new side of himself that he never knew was there."},{"name":"RODRIGAULT","text":"For indeed, how can one hope to truly understand and love another if one is not at peace and understanding with oneself? Yes, surely this is the best course of action for our masked man. I thank you in advance for your vote of confidence, friend."},{"name":"ASTRID","text":"The man need only cast a wider net, and I'm certain he'll find the true love he seeks in no time at all. Surely you agree with my proposal, yes?"},{"name":"BERT","text":"A new pastime is clearly and undoubtedly what our man most needs─and there can be none better than carpentry! Today a new bench or table, tomorrow a tryst with his new true love! Why, I can just see the flames of passion kindling before my eyes!"},{"name":"RODRIGAULT","text":"A meditation session or two at Stillglade Fane...yes, this is clearly the one true path to future happiness for our lovelorn friend. Being the intelligent <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> you are, surely you concur, yes?"},{"name":"LISETTE","text":"And welcome back to you, my partner in passion! I trust that my three associates have each proposed a plan worthy of an emissary of ardor and affection?"},{"name":"LISETTE","text":"No doubt choosing between the three will be a trying task. And yet I have naught but complete faith in your judgment. Choose the one you feel best embodies the spirit of Valentione's Day, and pray bring that individual to me. I shall be ever so tickled to see who you choose!"},{"name":"LISETTE","text":"Oh, but of course! There is one last thing. The preparations for the Valentione's Ceremony are at long last complete, and you are free to participate whenever your heart desires! "},{"name":"LISETTE","text":"What is this ceremony, you say? Why, the Valentione's Ceremony is a series of delightful trials especially devised to judge the affinity between two souls. Should you be looking to embark on a journey of love, I daresay there is no more fitting first step to take!"},{"name":"LISETTE","text":"It will be some time still before we render a decision as to who is most worthy to succeed me as emissary, so why not take the opportunity to enjoy the festivities in the meantime? I shall be oh-so-longingly waiting for your return, my dearest adventurer!"},{"name":"SYSTEM","text":"You now have access to the Valentione's Ceremony seasonal instance! To enter the venue, speak with the House Valentione servant at Mih Khetto's Amphitheatre."},{"name":"SYSTEM","text":"The Valentione's Ceremony is an instance designed for a party of two. There are no class, job, or level requirements for participation."},{"name":"SYSTEM","text":"In the event that you register for the ceremony alone, your partner will be found via the matching system."},{"name":"SYSTEM","text":"The next Valentione's Day quest may be undertaken by speaking with any one of the three aspiring emissaries─Astrid, Bert, or Rodrigault─all of whom await you in Old Gridania."},{"name":"SYSTEM","text":"When you have decided which emissary most deserves your vote, seek them out and convey your support."}],"reward":{"gil":267},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[65781,66211]},"next":[69289,69290,69291]},"partials":[{"type":"npc","id":"1032132","obj":{"i":1032132,"n":"Lisette De Valentione","l":53,"q":7}},{"type":"quest","id":"65781","obj":{"i":65781,"n":"It's Probably Pirates","g":1,"l":"Limsa Lominsa","s":91}},{"type":"quest","id":"66211","obj":{"i":66211,"n":"It's Probably Pirates","g":0,"l":"Limsa Lominsa","s":91}},{"type":"quest","id":"69289","obj":{"i":69289,"n":"A Vote for Astrid","g":196,"l":"Gridania","s":188}},{"type":"quest","id":"69290","obj":{"i":69290,"n":"A Vote for Bert","g":196,"l":"Gridania","s":189}},{"type":"quest","id":"69291","obj":{"i":69291,"n":"A Vote for Rodrigault","g":196,"l":"Gridania","s":190}}]}