{"quest":{"name":"Bully for Mochi","location":"Limsa Lominsa","id":69287,"patch":5.4,"sort":186,"icon":100963,"eventIcon":71221,"issuer":1031942,"target":1031942,"genre":194,"journal":["The expectant look in the ushi bugyo's eyes can mean only one thing.","The ushi bugyo presumes correctly that you know the streets and people of Limsa Lominsa far better than him, making you an ideal assistant to deliver advent cakes to the good people of Limsa Lominsa. With Wakamaru in tow, he asks you visit select locations throughout the city-state, offering celebratory sweets to passersby.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","From the head of the Fishermen's Guild to the Admiral of Limsa Lominsa herself, you come across a most unexpected and diverse assortment of people on your journey about Limsa Lominsa. Satisfied with your work, you return to the ushi bugyo with good news, and a much lighter bag of cakes.","You return to find a thankful ushi bugyo, who sees you now as an embodiment of the selfsame qualities for which the ox is honored. There is no doubt in his mind this year's Heavensturn will prove a rousing success. Indeed, there is naught left to do but relax and enjoy the revelry."],"objectives":["Wait at the designated locations for passersby.","Speak with the ushi bugyo."],"dialogue":[{"name":"CUWMISSIONARY","text":"Ready to deliver advent cakes to the masses, are you? Good."},{"name":"CUWMISSIONARY","text":"The task shouldn't prove unduly difficult─I imagine the people will only be too happy to receive the treats. If you could take yourself to these four locations and hand them to passersby, that should suffice to spread word of our festivities."},{"name":"WAKAMARU","text":"Bwoo!"},{"name":"CUWMISSIONARY","text":"And Wakamaru would accompany you once again, it would seem. Perfect. With him at your side, your intentions will be plain for all to see."},{"name":"CUWMISSIONARY","text":"Now then, I shan't keep you any longer. Go forth and let the good people know that Heavensturn is upon us!"},{"name":"WAKAMARU","text":"Bwoo!"},{"name":"CUWMISSIONARY","text":"I trust you know these streets far better than I, but I have marked four suitable locations on your map. If you should see anyone whose curiosity is piqued by the sight of Wakamaru and your advent cakes, hand them one and move on to the next."},{"name":"WAKAMARU","text":"Bwoo!"},{"name":"RASHAHT","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>, what a welcome surprise. In the company of a young calf... If you're working with the Far Eastern delegates, then I take it you have advent cakes. Might I trouble you for one?"},{"name":"BADERON","text":"(-???-)R'ashaht! Shouldn't you be at yer post?"},{"name":"RASHAHT","text":"Ah! W-Well, the lieutenant was on break, you see, and...erm..."},{"name":"RASHAHT","text":"...Oh, it's just you, Baderon. I'll thank you not to startle me like that!"},{"name":"BADERON","text":"Heh heh, apologies, Commander. I couldn't 'elp meself."},{"name":"BADERON","text":"Heh. <span class=\"emphasis\">Commander</span>..."},{"name":"RASHAHT","text":"What is it? Have you something on your mind?"},{"name":"BADERON","text":"It's nothin', lass. It still feels strange to call ye by yer title, is all."},{"name":"RASHAHT","text":"What are you implying? Do you think me unworthy of my station?"},{"name":"BADERON","text":"No, no. It's just...when I look at ye, I still see the spirited young adventurer what was determined to help damn near everyone as stepped in her path."},{"name":"BADERON","text":"That kind-hearted girl's still there, mind, but she's done some growin' too. I can't think of anyone better to lead the Foreign Levy. I'm proud o' ye, lass."},{"name":"RASHAHT","text":"I...I don't know what to say."},{"name":"BADERON","text":"Anyroad, yer handin' out them cakes, am I right? I'd be much obliged fer one."},{"name":"RASHAHT","text":"Ahem. If it's all the same to you, I ask that you keep that conversation private. Now, if you'll excuse me, I must return to my post."},{"name":"WAKAMARU","text":"Bwoo bwoo!"},{"name":"WAKAMARU","text":"Bwoo! Bwoo bwoo!"},{"name":"LYNGSATH","text":"What's this, now? Spreadin' a bit o' Heavensturn cheer, are ye? Hope that means ye've got advent cakes to share as well."},{"name":"NENEROON","text":"Lyngsath! Neneroon was not expecting such an unexpected meeting."},{"name":"LYNGSATH","text":"Well, well, if it ain't our trusty 'elper from last year's festival."},{"name":"NENEROON","text":"Neneroon helped muchly, but Lyngsath's help was much more helpful. Many readers read the Harbor Herald, and many came to taste tasty advent cakes."},{"name":"NENEROON","text":"Thanks to you, people found newfound respect for Qiqirns!"},{"name":"LYNGSATH","text":"Come now, I merely gave me honest opinion o' the food. It was yer 'ard work what won folk over."},{"name":"NENEROON","text":"Lyngsath not credit himself with enough credit. Without your descriptive descriptions of cakes, people may never have tried them."},{"name":"LYNGSATH","text":"Well, anyone what appreciates a good treat would've come 'round eventually, I reckon, but I appreciate yer kind words all the same."},{"name":"NENEROON","text":"But enough talking talkatively! Neneroon would feast on feast of advent cake!"},{"name":"NENEROON","text":"Hardworking people work hard to make cakes. Neneroon think of them as Neneroon chew on chewy goodness!"},{"name":"LYNGSATH","text":"A strong sense o' duty, that one..."},{"name":"LYNGSATH","text":"Well, I'll be off meself. Need to find a nice, quiet spot to enjoy me own morsel."},{"name":"WAKAMARU","text":"Bwoo!"},{"name":"WAKAMARU","text":"Bwoo!"},{"name":"RHOSWEN","text":"What's this, then...? Ah, right. 'Eavensturn. Let's 'ave one o' them cakes, then."},{"name":"RHOSWEN","text":"Actually, make it two. I know someone who'd be mighty sore to miss out."},{"name":"WAWALAGO","text":"Ah, if it isn't the ever-ravishing Rhoswen! Come to secure some celebratory sweets, have you?"},{"name":"RHOSWEN","text":"W-Wawalago! The 'ells ye doin' sneakin' up on folk like that!?"},{"name":"WAWALAGO","text":"Oho, I see you've not one, but <span class=\"emphasis\">two</span> advent cakes. If I didn't know better, I'd say you were securing a snack for a significant someone as well!"},{"name":"RHOSWEN","text":"Y-Ye've got it all wrong. I-I'm feelin' famished, see, an' one cake wouldn't be enough to satisfy me..."},{"name":"WAWALAGO","text":"Is that right? And there I was boldly believing that one was bound for Carvallain!"},{"name":"RHOSWEN","text":"N-Now ye listen 'ere! Ye say any more, an' I'll cut off yer blabbin' tongue─debts be damned!"},{"name":"WAWALAGO","text":"&lt;sigh&gt; Still fast to fly into a fury, I see... Small wonder you can't reel in a romantic rendezvous."},{"name":"RHOSWEN","text":"Hmph! I'm leader o' the Sanguine Sirens. I've no interest in such nonsense!"},{"name":"WAWALAGO","text":"Such senseless stubbornness... If she's not true to her feelings, she'll never catch the fish she fancies."},{"name":"CARVALLAIN","text":"What have we here? A calf? Ah, but of course─Heavensturn. You must be distributing advent cakes. If you have some left, I should like to have one."},{"name":"WAWALAGO","text":"W-Wait, Carvallain. Someone has already come to collect a cake on your behalf."},{"name":"CARVALLAIN","text":"On my behalf? I do not recall giving such an order to my crew."},{"name":"CARVALLAIN","text":"Well, if it should transpire that they had the forethought to procure one in my stead, then all well and good. But until such time as this is known─a cake, if you please."},{"name":"WAWALAGO","text":"Oh dear. A situation as sticky─though nowhere near as scrumptious─as the cakes. Speaking of which...may I have one too?"},{"name":"WAKAMARU","text":"Bwoo..."},{"name":"WAKAMARU","text":"Bwoo!"},{"name":"HNAANZA","text":"Just when I thought I heard a peculiar lowing... Brithael, come see! They're handing out advent cakes!"},{"name":"BRITHAEL","text":"Cake...? I'm afraid my stomach couldn't handle it right now..."},{"name":"HNAANZA","text":"And there I was thinking your condition had improved."},{"name":"HNAANZA","text":"At any rate, might I trouble you for two? One for me, and another for when his stomach's more agreeable."},{"name":"MERWYB","text":"(-???-)I would have one as well, if I may."},{"name":"BRITHAEL","text":"A-Admiral!?"},{"name":"MERWYB","text":"Well, well, if it isn't my esteemed guildmasters. Come to partake of advent cakes as well, have you?"},{"name":"HNAANZA","text":"We have. We weren't aware you were fond of them too, Admiral."},{"name":"BRITHAEL","text":"Aye. An' busy as ye are, I thought ye would've sent someone to collect in yer stead."},{"name":"MERWYB","text":"These advent cakes are said to bring one good fortune, are they not? I cannot well imagine good fortune would favor those unwilling to make an effort to personally receive it."},{"name":"HNAANZA","text":"A sentiment with which we can relate, Admiral. The gods know we crafting folk are a superstitious lot."},{"name":"BRITHAEL","text":"Aye, an' cakes aside, I've to say that just bein' out here amidst the festivities is doin' me good. My head feels clearer already."},{"name":"MERWYB","text":"I'm glad to hear it."},{"name":"MERWYB","text":"I too enjoy the opportunity to be out here alone, just another citizen, without an armed escort. Marshal Slafyrsyn will have a thing or two to say afterwards, but it is worth it."},{"name":"MERWYB","text":"Now then, if you would be so kind..."},{"name":"MERWYB","text":"My thanks. And now, to find a quiet place to enjoy this in peace."},{"name":"HNAANZA","text":"We should be taking our leave as well. Thank you again for the cake."},{"name":"WAKAMARU","text":"Bwoo, bwoo!"},{"name":"CUWMISSIONARY","text":"Ah, you are returned, and with far fewer cakes than when you left!"},{"name":"CUWMISSIONARY","text":"In the Far East, it is said the ushi is the embodiment of honest and hard work─qualities which I see are shared by the adventurers of this land."},{"name":"CUWMISSIONARY","text":"I have no doubt this year's Heavensturn will be a rousing success, thanks in no small part to you."},{"name":"WAKAMARU","text":"Bwoo! Bwoo!"}],"reward":{"items":[{"num":10,"id":24238}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69274]}},"partials":[{"type":"npc","id":"1031942","obj":{"i":1031942,"n":"Ushi Bugyo","l":28,"q":2}},{"type":"item","id":"24238","obj":{"i":24238,"n":"Magicked Prism (Advent Cakes)","l":1,"c":22631,"t":85,"p":19}},{"type":"quest","id":"69274","obj":{"i":69274,"n":"Steering Clear of Trouble","g":194,"l":"Limsa Lominsa","s":185}}]}