{"quest":{"name":"A Vote for Rodrigault","location":"Gridania","id":69291,"patch":5.1,"sort":190,"icon":100966,"eventIcon":71221,"issuer":1032136,"target":1032132,"genre":196,"journal":["Rodrigault eyes you with an expression of supreme self-assurance.<br>※This quest is available for a limited time only.","You speak with Rodrigault, and inform him that his logical analysis of the situation has won you over. Seeing this as merely the natural progression of events, he casually walks off to report to Lisette while barely acknowledging your presence. While there is no end of places you would rather be, you resolve to follow him and honor your promise to Lisette.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Though she professes to remain impartial, Lady Lisette's weary expression betrays her dismay that you have chosen to support this haughty academic over her dear sister. The contest is far from over, however, as many votes remain to be counted. You resolve to enjoy the festivities as you wait for Lady Lisette and her colleagues to declare a victor."],"objectives":["Speak with Lisette de Valentione."],"dialogue":[{"name":"SYSTEM","text":"Please note that once you accept this quest, you will be unable to accept the quests “A Vote for Astrid” and “A Vote for Bert.” "},{"name":"SYSTEM","text":"Furthermore, be aware that only votes cast during the designated voting period will count towards the final tally."},{"name":"RODRIGAULT","text":"Ah, yes. I was expecting you. As a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of reason, I trust you have come to the logical conclusion."},{"name":"Q1","text":"You can only vote once.<br>What will you say?"},{"name":"A1","text":"You have my support."},{"name":"A1","text":"What is it that you propose again?"},{"name":"A1","text":"I'd like to have a moment to think things over."},{"name":"RODRIGAULT","text":"Say no more, friend. You have chosen me, as any rational thinker would. There is hardly need to elaborate further."},{"name":"RODRIGAULT","text":"Come along, now. Lady Lisette is surely expecting us at Mih Khetto's Amphitheatre. You know the way, yes?"},{"name":"RODRIGAULT","text":"Clearly, you are not one for brash decisions. Rather, you would contemplate an issue to your satisfaction before rendering a verdict. A <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> after my own heart, I see. It would be an honor to share my deductions with you once more."},{"name":"RODRIGAULT","text":"You recall our friend's response when we asked him what manner of individual he fancies, do you not?"},{"name":"RODRIGAULT","text":"Precisely...he had no answer. A man who cannot answer such a simple query is a man who has lost sight of himself and what he truly seeks from life."},{"name":"RODRIGAULT","text":"That is why I intend to propose that our man spend some time at Stillglade Fane when he is off duty. By communing with nature, he might cast off his worldly worries and regain a sense of self, which in turn would afford him greater clarity in his pursuit of love."},{"name":"RODRIGAULT","text":"As devoted as the man is to his training, I have no doubt he would find himself more than up to the task of silent self-reflection. Perhaps he might even discover a new side of himself that he never knew was there."},{"name":"RODRIGAULT","text":"For indeed, how can one hope to truly understand and love another if one is not at peace and understanding with oneself? Yes, surely this is the best course of action for our masked man. Thank you for your forthcoming vote of confidence, friend."},{"name":"ASTRID","text":"And here I was hoping you'd find it in your heart to vote for me. Oh, well. I suppose there is still time to rally others to my cause."},{"name":"BERT","text":"I am not such a petty man as to begrudge you your right to cast your lot with another. But mark my words─you will regret not backing the winning chocobo when Bert the Beloved's proposal carries the day!"},{"name":"LISETTE","text":"Good gods, <span class=\"highlight\">Forename</span>, anyone but─ahem! Anyone else might have been disheartened to see you stroll in with that self-important scholar instead of my dear sister. I, of course, remain ever impartial in this matter."},{"name":"LISETTE","text":"One vote for Rodrigault it is! No doubt his dispassionate deductions were most convincing. I can only hope they satisfy our anonymous client as well as they satisfy the man who dreamed them up."},{"name":"LISETTE","text":"Mind you, it is far too early to declare the contest won. There are countless other adventurers and Gridanian citizens who have yet to weigh in, after all. When the final results have been counted and compiled, pray speak with me anew."},{"name":"LISETTE","text":"As an added incentive, it has been decided that once the victor is declared, the town will be redecorated with new ornaments of their choosing. Pray look forward to it, my dear friend!"}],"reward":{"items":[{"id":28920},{"id":28923}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69288]}},"partials":[{"type":"npc","id":"1032136","obj":{"i":1032136,"n":"Rodrigault","l":53,"q":1}},{"type":"npc","id":"1032132","obj":{"i":1032132,"n":"Lisette De Valentione","l":53,"q":7}},{"type":"item","id":"28920","obj":{"i":28920,"n":"Dashing Valentione Forget-me-not Chest","l":1,"c":26509,"t":61}},{"type":"item","id":"28923","obj":{"i":28923,"n":"Prim Valentione Forget-me-not Chest","l":1,"c":26509,"t":61}},{"type":"quest","id":"69288","obj":{"i":69288,"n":"Of Ardor and Argument","g":196,"l":"Gridania","s":187,"f":1}}]}