{"quest":{"name":"Rodrigault's Revelation","location":"Gridania","id":69294,"patch":5.1,"sort":193,"icon":100962,"eventIcon":71221,"issuer":1032132,"target":1032360,"genre":196,"journal":["Lisette has an important announcement to share with one and all.<br>※This quest is available for a limited time only.","Lisette cheerily explains to you that the votes have been all but counted, and announces that the winner of the contest is none other than Rodrigault. She bids you accompany Rodrigault as an unbiased observer, such that you might render a sound decision on her behalf. Rodrigault then instructs you to wait just beyond his arranged meeting spot with your masked client.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You accompany Rodrigault—newly minted as this year's emissary of love—to visit your heretofore masked client, who reveals himself to be none other than Guildmaster Ywain of Lancers' Guild fame. With some skepticism, Ywain agrees to take part in a meditation exercise at Rodrigault's suggestion, and the two of them make their way to Stillglade Fane where they are greeted by Brother E–Sumi–Yan. Their conversation is suddenly interrupted by Sylphie, however, who astutely ascertains precisely what sort of love the guildmaster <span class=\"emphasis\">truly</span> seeks, and begins to lecture him on matters including personal hygiene, whisking him off to the Twelve know where that she might transform him into a less offensively odored individual.","Cool and confident as always despite the unexpected turn of events, Rodrigault observes that his approach did indeed spark an encounter that has the potential to reverse your client's fortunes. He strides confidently off to report his clear success to Lady Lisette, with the clear expectation that you will be along in tow.","Upon your return, Lady Lisette carefully weighs the events of the day. Though not entirely convinced at the outset, after asking your thoughts and reconsidering the matter for herself, she triumphantly declares Rodrigault's trial a success. The studious scholar of love rejoices in his own subdued way, and with Lady Lisette's blessing, the newly crowned emissary of love steps into his role as master of ceremonies for this year's Valentione's Day. Your own duty done as well, you are free to enjoy the festivities as you see fit before going forth and returning to your adventures."],"objectives":["Wait for your client at the designated location.","Speak with Rodrigault.","Speak with Rodrigault again."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you cannot have either of the quests “Astrid's Acumen” or “Bert's Big Idea” in progress."},{"name":"LISETTE","text":"Well, if it isn't my most beloved of adventurers! You've picked the perfect time to come. Why's that, you say? Why, I was just about to announce the results of the contest and name the nominee for this year's new emissary of love!"},{"name":"LISETTE","text":"So without further ado... Ladies and gentlemen, the votes have been counted, and the winner is─well, this is a surprise─Rodrigault, and his proposal that our yearning young man seek love by first finding himself through meditation!"},{"name":"LISETTE","text":"A rather unique approach, to be sure. That said, from the moment you told me that Rodrigault's proposal had your support, I had a hunch that he might somehow emerge the victor."},{"name":"LISETTE","text":"I realize that Rodrigault was not your first choice─to be quite honest, nor was he mine─but I do hope you will be so kind as to support him in his endeavors."},{"name":"LISETTE","text":"And wouldn't you know it...there he is right now! Rodrigault! Oh, Rodrigault!"},{"name":"RODRIGAULT","text":"It would appear that my proposal was the top vote-getter. But of course, that should come as little surprise to rational minds like ours, yes?"},{"name":"RODRIGAULT","text":"It would appear that my proposal was the top vote-getter. I trust that after having had some time to consider the matter, you too see why this is the only logical result."},{"name":"LISETTE","text":"As our newly nominated emissary of love, Rodrigault will now go proudly forth and put his, er, rather atypical proposal into action, that one more soul in this realm may find the true love and happiness they so deeply deserve."},{"name":"LISETTE","text":"On this momentous occasion, I would ask of you a special favor. Would you be so kind as to accompany my associate on his adventure of the heart, that you might witness firsthand the accuracy of his analysis, and fairly judge the efficacy of his actions?"},{"name":"LISETTE","text":"Under different circumstances, I would perform the task myself, but given my own preconceptions about the man, I fear it may be difficult for me to remain an impartial observer. You will humor me this time, will you not?"},{"name":"RODRIGAULT","text":"I have asked my client to meet me just west of the amphitheatre. Pray come along. You might learn a thing or two about the importance of keeping a cool head when faced with the heat of passion."},{"name":"RODRIGAULT","text":"You may go on ahead now, if you wish. I will be along once I have seen to the necessary precautions and preparations."},{"name":"LISETTE","text":"Will Rodrigault's bold-faced plan succeed in bringing the succor of love to a young man's heart? Why, my heart flutters in anticipation! Pray watch over my associate from close by, that you might report back to me regarding all you have seen."},{"name":"YWAIN","text":"(-Pining Gridanian-)My apologies. I hope I have not kept you waiting overlong."},{"name":"RODRIGAULT","text":"A touch, mayhap, but think nothing of it. Guildmaster Ywain, I presume? I am Rodrigault, the emissary come to resolve once and for all the needless worries that plague your heart."},{"name":"RODRIGAULT","text":"Your plight─as I understand it, and understand it well─is that you feel you have not been afforded sufficient opportunity to find yourself a suitable partner. I, however, would propose that the source of this lies not without, but within..."},{"name":"YWAIN","text":"You suggest that I meditate with the Hearers of Stillglade Fane in hopes of...finding myself?"},{"name":"RODRIGAULT","text":"...Precisely. Before a man can truly know and love another, he must know himself, and I fear I felt no small degree of doubts from the way you expressed yourself to my associates before."},{"name":"RODRIGAULT","text":"Never fear, however, as I have already made the necessary arrangements. E–Sumi–Yan assures me that by the time your instruction is through, you will be at peace with yourself not unlike how your Hearers are with the keepers of the forest. Now come along."},{"name":"ESUMIYAN","text":"You must be Rodrigault. We have been expecting you. Now tell me, who is the wayward child you have brought to us tod─hm?"},{"name":"ESUMIYAN","text":"Guildmaster Ywain? I must say, you are among the last individuals I would have expected to see here today."},{"name":"ESUMIYAN","text":"...Which is not to say you are unwelcome here, of course. Tell me, my friend, what troubles your heart this day?"},{"name":"YWAIN","text":"Well, it is...how shall I put it?"},{"name":"YWAIN","text":"I have─in a manner of speaking, that is─come to gain a better understanding of love."},{"name":"ESUMIYAN","text":"Love, you say? Why, yes...there can be no doubt that love is a powerful force indeed. After all, it is through our love of nature and the world around us by which we are granted the powers we wield. "},{"name":"ESUMIYAN","text":"Very well, my friend. Take a sedentary position, and let us begin to meditate. Before long, your eyes will be opened to the glory and grandeur of nature, and it will only be a matter of time until love fills your─"},{"name":"SYLPHIE","text":"(-Girl's Voice-)...Brother E–Sumi. Somehow I don't think that's the kind of love your friend is seeking."},{"name":"ESUMIYAN","text":"Sylphie! Don't sneak up on me like that! And...whatever are you suggesting?"},{"name":"SYLPHIE","text":"I'm saying that your friend here isn't looking to nurture a love for nature. He's looking for a more <span class=\"emphasis\">tangible</span> sort of love. The kind you can hold...and touch."},{"name":"SYLPHIE","text":"Isn't that right, old man?"},{"name":"YWAIN","text":"O-Old...? I'll have you know, I've seen but thirty-odd summers─"},{"name":"SYLPHIE","text":"There's no need to protest. It is hardly a sin to seek companionship, after all. But if you want my advice...if you are truly committed to this cause, you could start by doing something about that outfit."},{"name":"SYLPHIE","text":"Surely you have to admit that it's a little bit...drab, don't you think?"},{"name":"SYLPHIE","text":"And after that─&lt;sniff&gt; &lt;sniff&gt;─excuse me, but have you been hunting in the wood? Because you reek ever so faintly yet distinctly of goobbue dung. "},{"name":"SYLPHIE","text":"...Trust me when I say that meditation is the last thing that will help you. Come with me, and I'll teach you all you need to know about wooing the fairer sex."},{"name":"SYLPHIE","text":"First on the agenda is a nice hot bath to get the stink off you. Following that, a trip to the markets to pick out some new garb that isn't caked in sweat and grime. Well? What are you waiting for!? With me, now!"},{"name":"RODRIGAULT","text":"I know what you are thinking, friend. You are thinking that my plan was utterly and positively thwarted by the girl. Ah, how little you understand..."},{"name":"RODRIGAULT","text":"I never presumed to think that Ywain's meditation session would be carried out to its conclusion, oh no. It was simply part of my plan to set the pendulum in motion, that fate may carry our friend where it may."},{"name":"RODRIGAULT","text":"...And where it has carried him is directly into the company of a most fetching young lass. A remarkable success, would you not say? Now come. Lisette will want to hear all about my success, and with all haste."},{"name":"LISETTE","text":"I do hope Rodrigault's plan succeeded to our client's satisfaction. Why, I simply couldn't forgive myself if I allowed that self-styled, self-serving scholar to tarnish the good name of House Valentione..."},{"name":"RODRIGAULT","text":"I have already enlightened Lisette as to the precise manner in which my plan succeeded resoundingly. Let us await her verdict with the utmost of confidence."},{"name":"LISETTE","text":"Welcome back, my beloved friend! Rodrigault has told me everything. To be perfectly honest with you, that was not precisely─or to be honest, not <span class=\"emphasis\">at all</span> how I had envisioned everything working out..."},{"name":"LISETTE","text":"...Which is why I seek your opinion as one who has served me loyally in the name of love. What say you? Was Rodrigault's unusual approach worthy of the title of emissary of ardor?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That depends on the two of them..."},{"name":"A1","text":"It's a start, is it not?"},{"name":"A1","text":"At least he'll smell better...?"},{"name":"LISETTE","text":"Indeed...I suppose it does, my friend! After all, if young Sylphie provides the guildmaster with the wisdom he needs, and he proceeds to take it to heart, there is no telling how charming and handsome of a gentleman he might become!"},{"name":"LISETTE","text":"...I suppose you are correct. Guildmaster Ywain was looking for a new encounter. While young Sylphie might not be suitable as the object of his affections, perhaps this meeting can be the spark that leads to a change in the man's romantic fortunes."},{"name":"LISETTE","text":"Why, <span class=\"highlight\">Forename</span>─that is no way to talk about a man who has set aside his pride to seek our counsel! Though, to be fair, I could not help but take notice of his distinctive odor myself. Perhaps his meeting with young Sylphie was for the best, after all?"},{"name":"LISETTE","text":"At any rate, I do believe I have heard all I need to render my verdict. Hear me, Rodrigault. By the powers invested in me by my forebears, I, Lisette de Valentione..."},{"name":"LISETTE","text":"...Do hereby declare you a full-fledged emissary of ardor! Congratulations, my young associate! I cannot say I expected to see this day, but I welcome it with open arms and a warm embrace!"},{"name":"LISETTE","text":"And with that, I have no qualms whatsoever placing the full of this year's Valentione's Day proceedings under your charge."},{"name":"LISETTE","text":"Well, Rodrigault? How does it feel to rise to the occasion? Have you aught to say to the darling adventurer who helped make this occasion possible?"},{"name":"RODRIGAULT","text":"You have my gratitude, friend. While I still believe my selection was a most logical conclusion, I will admit that I still have much to learn about the art of love, and the task of spreading ardor across the hearts of the realm. Pray rest assured I will approach my new duties with due diligence."},{"name":"RODRIGAULT","text":"At any rate, why not take some time to enjoy the festivities? I daresay you've earned it. As for me, I suppose I shall be off in search of other hearts to mend. Till we meet again!"}],"reward":{"items":[{"num":5,"id":28650}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[69289,69290]}},"partials":[{"type":"npc","id":"1032132","obj":{"i":1032132,"n":"Lisette De Valentione","l":53,"q":7}},{"type":"npc","id":"1032360","obj":{"i":1032360,"n":"Rodrigault","l":53,"q":1}},{"type":"item","id":"28650","obj":{"i":28650,"n":"Valentione's Day Chocolate","l":1,"c":24063,"t":85}},{"type":"quest","id":"69289","obj":{"i":69289,"n":"A Vote for Astrid","g":196,"l":"Gridania","s":188}},{"type":"quest","id":"69290","obj":{"i":69290,"n":"A Vote for Bert","g":196,"l":"Gridania","s":189}}]}