{"quest":{"name":"Old Enemies, New Threats","location":"The Rising Stones","id":69297,"patch":5.2,"sort":110,"icon":100981,"eventIcon":71201,"issuer":1031783,"target":1032494,"genre":9,"journal":["Krile is glad for your return, though it remains to be seen if she has glad tidings to share.","You return to the Rising Stones to speak with Krile, who informs you that the Scions' bodies remain stable for the interim. Before she has time to inquire after your efforts in the First, however, an unexpected visitor arrives─Maxima. Unforeseen threats may soon arise from within Garlemald, and Commander Aldynn would discuss strategy with you. Not wanting to leave the realm's woes solely on your shoulders, Krile accompanies you to offer what insight she can.","As you step into the conference room, you are taken aback to see Commander Aldynn in talks with Gaius Baelsar. He recounts his battle in the imperial palace with a Zenos now whole of body and spirit, followed by an equally startling revelation─the Empire is developing a new Ultima Weapon, and one of its prototypes may soon find its way to Eorzea.","Once more the realm is faced with great peril, as are the Scions whose link to the Source grows woefully thin. To which plight will you turn your attention first?"],"objectives":["Speak with Maxima at the Ala Mhigan Quarter in the Lochs.","Speak with Krile."],"dialogue":[{"name":"KRILE","text":"<span class=\"highlight\">Forename</span>. My, what a pleasant surprise."},{"name":"KRILE","text":"If you've come to inquire after the Archons, fear not. Master Matoya's treatment has proven effective in stabilizing their corporeal aether."},{"name":"KRILE","text":"We mustn't grow complacent, however. Potent though these magicks may be, they are not without limits."},{"name":"KRILE","text":"We can only hope they afford us enough time for the Crystal Exarch to complete his work."},{"name":"TATARU","text":"If only we could go with you to the First and help..."},{"name":"MAXIMA","text":"(-???-)Pardon the interruption, but I come bearing urgent news."},{"name":"MAXIMA","text":"Ah, <span class=\"highlight\">Forename</span>. It has been far too long, my friend."},{"name":"MAXIMA","text":"Forgive me, I don't believe we have been formally introduced."},{"name":"MAXIMA","text":"Maxima, former Garlean ambassador. I remain here in Eorzea under the auspices of Commander Aldynn, offering what counsel I can in the hopes of resolving the present conflict with the Empire."},{"name":"KRILE","text":"Ah, yes. I have heard stories of a defector from Garlemald. But never mind that─you said you have urgent news?"},{"name":"MAXIMA","text":"Indeed. As you may have heard, the imperial capital is in turmoil, and a sizable portion of the Garlean forces have been recalled from the Ghimlyt Dark."},{"name":"MAXIMA","text":"With their numbers so greatly diminished, the main host of the Alliance has withdrawn, leaving the Ala Mhigan Resistance to keep watch over the border."},{"name":"MAXIMA","text":"And it is there we have welcomed a most unexpected visitor who claims that this de-escalation may belie growing dangers and unforeseen threats."},{"name":"MAXIMA","text":"Commander Aldynn has arranged for an impromptu meeting to discuss these revelations. He has also requested a representative of the Scions attend as well, though it was clear to whom he wished I extend this invitation."},{"name":"KRILE","text":"It would seem time is of the essence."},{"name":"KRILE","text":"Well, you'll not be attending this meeting alone. Though I am not as well versed in the affairs of city-states as our comrades, I see no reason to burden a single Scion with all this. "},{"name":"MAXIMA","text":"Yes, of course. Then we must make for the Ala Mhigan Quarter with all haste."},{"name":"TATARU","text":"Well? What are you waiting for? Get going, you two!"},{"name":"TATARU","text":"Don't worry about the others. I'll keep an eye on them while you and Krile are away."},{"name":"KRILE","text":"Much has changed since the first time we set foot in this city. Now we strive to preserve their freedom rather than reclaim it. But we've no time to reminisce─we mustn't keep the commander waiting."},{"name":"MAXIMA","text":"Commander Aldynn awaits us in the Royal Palace. If you would follow me."},{"name":"RESISTANCEOFFICER","text":"Commander Aldynn has instructed me to escort you to Alliance Headquarters for further briefing. When you are ready to depart, you need only ask."},{"name":"KRILE","text":"As ever, the way forward is paved with difficult decisions."},{"name":"KRILE","text":"We can ill afford to ignore the threat of a new Ultima Weapon. But with each passing day, the plight of the Scions grows ever more perilous."},{"name":"KRILE","text":"If you cannot stay for...a debriefing on the Ultima Weapon, I will not stop you. I only ask that you confer with me before returning to the First."}],"reward":{"gil":1611},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69218]},"next":[69298,69319]},"partials":[{"type":"npc","id":"1031783","obj":{"i":1031783,"n":"Krile","l":481,"q":1}},{"type":"npc","id":"1032494","obj":{"i":1032494,"n":"Krile","l":2408,"q":2}},{"type":"quest","id":"69218","obj":{"i":69218,"n":"Vows of Virtue, Deeds of Cruelty","g":9,"l":"Eulmore","s":100}},{"type":"quest","id":"69298","obj":{"i":69298,"n":"The Way Home","g":9,"l":"The Lochs","s":120}},{"type":"quest","id":"69319","obj":{"i":69319,"n":"Ruby Doomsday","g":25,"l":"The Lochs","s":10,"f":1}}]}