{"quest":{"name":"Astrid's Acumen","location":"Gridania","id":69292,"patch":5.1,"sort":191,"icon":100960,"eventIcon":71221,"issuer":1032132,"target":1032358,"genre":196,"journal":["Lisette has an important announcement to share with one and all.<br>※This quest is available for a limited time only.","Lisette cheerily explains to you that the votes have been all but counted, and announces that the winner of the contest is none other than Astrid. She bids you accompany Astrid as an unbiased observer, such that you might render a sound decision on her behalf. Astrid then instructs you to wait just beyond her arranged meeting spot with your masked client.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You accompany Astrid─newly minted as this year's emissary of love─to visit your heretofore masked client, who reveals himself to be none other than Guildmaster Ywain of Lancers' Guild fame. Though somewhat skeptical, he takes her suggestion to expand his horizons to heart, and the two of them make their way to the Leatherworkers' Guild where Ywain is scheduled to deliver a shipment of animal hides. Upon their arrival the all-too-serious soldier promptly manages to make a fool of himself by confessing his search for love to Guildmaster Geva. As she eyes Ywain in a manner that suggests she wants to turn <span class=\"emphasis\">his</span> hide into a sack, the three of you are joined by none other than the notorious naturalist Marcette. Spying the collection of rare animal skins in Ywain's possession, she swiftly volunteers him to be her newest research assistant, whisking him off to parts unknown without so much as a second thought.","Her mission to introduce Ywain to a member of the fairer sex accomplished─at least, in the most charitable sense of the word─Astrid suggests that the both of you return to deliver a report to Lady Lisette.","Upon your return, Lady Lisette carefully weighs the events of the day. Though not entirely convinced at the outset, after asking your thoughts and reconsidering the matter for herself, she triumphantly declares Astrid's trial a success. Astrid rejoices, and with her sister's blessing, the newly crowned emissary of love steps confidently into her hard-earned position as mistress of ceremonies for this year's Valentione's Day. Your own duty done as well, you are free to enjoy the festivities as you see fit before going forth and returning to your adventures."],"objectives":["Wait for your client at the designated location.","Speak with Astrid.","Speak with Astrid again."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you cannot have either of the quests “Bert's Big Idea” or “Rodrigault's Revelation” in progress."},{"name":"LISETTE","text":"Well, if it isn't my most beloved of adventurers! You've picked the perfect time to come. Why's that, you say? Why, I was just about to announce the results of the contest and name this year's new emissary of love!"},{"name":"LISETTE","text":"So without further ado... Ladies and gentlemen, the votes have been counted, and the winner is...Astrid, and her proposal for our yearning youth to expand his search for love to new horizons!"},{"name":"LISETTE","text":"Far be it from me to take sides, yet ever since you told me that you cast your vote for my dear sister, somehow I knew she would emerge triumphant."},{"name":"LISETTE","text":"I realize that my sister was not your first choice, but I do hope you will be so kind as to support her in her endeavors."},{"name":"LISETTE","text":"And wouldn't you know it...there she is right now! Astrid! Oh, Astrid!"},{"name":"ASTRID","text":"Could it be? Did they truly choose <span class=\"emphasis\">me</span>? Oh, but they did! How can I ever thank you, my friend? Without your vote of confidence to keep my hopes up, I doubt I could have lasted until this moment."},{"name":"ASTRID","text":"Can you believe it, my friend? They truly chose me! ...Forgive me. I know that you were partial to one of my associates. Still, there will be no hard feelings between us, yes? Let us join together to bring the joy of love to Eorzea this enchanted season!"},{"name":"LISETTE","text":"As our newly crowned emissary of love, Astrid will now go proudly forth and put her carefully thought proposal into action, that one more soul in this realm may find the true love and happiness they so deeply deserve."},{"name":"LISETTE","text":"On this momentous occasion, I would ask of you a special favor. Would you be so kind as to accompany Astrid on her adventure of the heart, that you might witness firsthand the passion of her words and the efficacy of her actions?"},{"name":"LISETTE","text":"Under different circumstances, I would perform the task myself, but given that the girl is my own flesh and blood, I fear it may be difficult for me to remain an impartial observer. You will humor me this time, will you not?"},{"name":"ASTRID","text":"Thank you for offering to accompany me, friend. It is most heartening to know I will not have to take on this imposing task alone. Our anonymous client has asked us to meet him at the amphitheatre."},{"name":"ASTRID","text":"There are some preparations I must yet see to, so please go on ahead whenever you are ready. Pray take care, however, not to alert our friend to your presence. Find a suitable vantage point to watch me at work, and I shall see to the rest."},{"name":"LISETTE","text":"Will young Astrid's carefully pondered plan succeed in bringing the succor of love to a young man's heart? Why, my heart flutters in anticipation! Pray watch over her from the shadows, and report back to me regarding all you have seen."},{"name":"YWAIN","text":"(-Pining Gridanian-)My apologies. I hope I have not kept you waiting overlong."},{"name":"ASTRID","text":"You are the lonely soul who sought our counsel to ease the pain of your heart, yes?"},{"name":"YWAIN","text":"Er...yes, I suppose. My name is Ywain, and I am proud to serve as guildmaster of the Lancers' Guild."},{"name":"ASTRID","text":"And I am Astrid de Valentione, emissary of love and ardor. Worry not, my shy and sensitive friend─no matter what depths of sadness and solitude you may have known, from this day forward your heart will be illuminated with the warmth and brilliance of love."},{"name":"ASTRID","text":"Yes, I shall see to that. So without further ado, let us get to the task, shall we? As I recall, your plight was that you scarce knew where to begin your search for love in the first place. Fear not, for I have come to you today bearing the perfect solution..."},{"name":"YWAIN","text":"Expand my horizons, you say? Well, now that you mention it, I had plans to visit the Leatherworkers' Guild later today to deliver a shipment of animal hides..."},{"name":"ASTRID","text":"My dearest Ywain, but why did you not say so sooner? I daresay this is the perfect opportunity to take your first step on a journey to meet your destiny!"},{"name":"GEVA","text":"Well, if it isn't Guildmaster Ywain. What brings you here today? And who's this you've brought with you? She doesn't look like leatherworker material, if you ask me."},{"name":"ASTRID","text":"Greetings, my dearest Guildmaster Geva! Many a tale have I heard of your beauty. I am Astrid of House Valentione, come to Gridania to bring ardor and affection in this, the loveliest of seasons."},{"name":"GEVA","text":"...Charmed. What's the meaning of this, Ywain? You were supposed to bring me a shipment of animal hides, not some melodramatic moppet. What is it you want from me?"},{"name":"YWAIN","text":"Ah, yes. I, er...was simply looking..."},{"name":"YWAIN","text":"Er, looking for love...as it were."},{"name":"GEVA","text":"What in the─ Did you get bonked on the head by a berserk goobbue!? You know as well as anyone that I've a husband and two young ones at home!"},{"name":"GEVA","text":"Let's assume─for both our sakes─that was just an uncharacteristic attempt at humor on your part, and move right along to business. You did bring the hides you promised, didn't you─"},{"name":"MARCETTE","text":"(-Vitriolic Voice-)What is all this blithering and babbling about!? How long do you intend to keep one of Eorzea's preeminent scholars waiting!?"},{"name":"GEVA","text":"Professor Marcette. What brings you to our humble halls today? Looking for another rare creature to use in your fieldwork?"},{"name":"MARCETTE","text":"Hmm...? You there! Yes, you with the vapid, empty stare on your face and the sack of animal hides in your meaty paw. Open that bag at once and show me the contents! Now!"},{"name":"YWAIN","text":"Me? B-But of course. These are the skins of a variety of beasts procured by members of my guild in the vicinity of the Gelmorra Ruins. I daresay there are some rare specimens among... "},{"name":"MARCETTE","text":"I do not recall asking for commentary! Have you ever heard the saying, “It's better to keep your mouth closed and let the whole realm assume you are a fool and a half-wit, than open your mouth and remove all doubt”?"},{"name":"MARCETTE","text":"Allow me to translate for your feeble mind: shut your maw, grab that sack, and come along with me, Research Assistant Seven Hundred and Eleven!"},{"name":"YWAIN","text":"Research assistant...?"},{"name":"MARCETTE","text":"Is he <span class=\"emphasis\">talking</span> again? Why, oh <span class=\"emphasis\">why</span> do they insist on talking? As of today, you have the honor of joining Marcette, realm-renowned naturalist and esteemed authoress of the <span class=\"emphasis\">New Eorzean Geographic</span> on her latest expedition into the unknown! "},{"name":"MARCETTE","text":"So do be <span class=\"emphasis\">silent</span> and come along now, Research Assistant One Hundred and Twenty-four! And try to pick up the pace, will you? Science waits for no man, especially not some meathead like yourself!"},{"name":"YWAIN","text":"W-Wait a moment...just what is the meaning of─? I said, pray wait! "},{"name":"ASTRID","text":"Well, I daresay those two seem to have hit it off swimmingly!"},{"name":"ASTRID","text":"I do believe we can safely declare my plan to introduce Guildmaster Ywain to a potential love interest to be a resounding success. As for what becomes of their relationship from here, well...that is up to the two of them, is it not?"},{"name":"ASTRID","text":"In any event, I should be getting along─Sister will no doubt be eager to hear the results of our little operation. See you back at the amphitheatre, friend!"},{"name":"LISETTE","text":"I do hope dear Astrid's plan succeeded to her satisfaction. She did put so much of her heart and soul into this..."},{"name":"ASTRID","text":"Oh, there you are! I shared with my dear sister all the details of our encounter with Ywain and Marcette. Do you suppose she will deem my efforts a success?"},{"name":"LISETTE","text":"Welcome back, my beloved friend! Astrid has told me everything. To be perfectly honest with you, that was not precisely how I had envisioned everything working out..."},{"name":"LISETTE","text":"...Which is why I seek your opinion as one who has served me loyally in the name of love. What say you? Was dear Astrid's approach worthy of the title of emissary of ardor?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That remains to be seen..."},{"name":"A1","text":"It's a start, is it not?"},{"name":"A1","text":"I worry for the man..."},{"name":"LISETTE","text":"'Tis a fair assessment, indeed. For as emissaries, all we can do is point two potential lovers in the same direction. Whether or not they choose to walk the path of passion together is up to them, and them alone."},{"name":"LISETTE","text":"'Tis a fair assessment, indeed. After all, when the poor man first came to us, he hadn't the slightest notion of where to even begin searching for love. Now, he has met an intelligent woman who, ah...clearly appreciates his diligence and devotion."},{"name":"LISETTE","text":"Tee hee! You are truly a sensitive soul, friend. And yet, let us not jump to conclusions. There is many a happily married man who is all too happy to be forever at his beloved's beck and call! Perhaps our Ywain is no different?"},{"name":"LISETTE","text":"At any rate, I do believe I have heard all I need to render my verdict. Hear me, Astrid. By the powers invested in me by my forebears, I, Lisette de Valentione..."},{"name":"LISETTE","text":"...Do hereby declare you a full-fledged emissary of ardor! Oh, congratulations, my dear! How long I have waited to say those words!"},{"name":"LISETTE","text":"And with that, I have no qualms whatsoever placing the full of this year's Valentione's Day proceedings under your charge."},{"name":"LISETTE","text":"Well, Astrid? How does it feel to rise to the occasion? Have you aught to say to the sweet adventurer who made this occasion possible?"},{"name":"ASTRID","text":"B-But of course! Thank you! Thank you oh so much from the deepest, most boundless depths of my heart!"},{"name":"ASTRID","text":"I promise the both of you that the festivities will not end until I and my assistants have done all we can to aid every yearning soul in their quest for companionship!"},{"name":"ASTRID","text":"So please, my friend, do enjoy yourself and─ah, er...that's right. How did it go again?"},{"name":"ASTRID","text":"...Ahem. My love burns brighter than the sun, and deeper than the sea. Gladly would I share it with thee, and thee, and...ooh, most <span class=\"emphasis\">definitely</span> thee!"}],"reward":{"items":[{"num":5,"id":28650}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[69289,69290]}},"partials":[{"type":"npc","id":"1032132","obj":{"i":1032132,"n":"Lisette De Valentione","l":53,"q":7}},{"type":"npc","id":"1032358","obj":{"i":1032358,"n":"Astrid","l":53,"q":1}},{"type":"item","id":"28650","obj":{"i":28650,"n":"Valentione's Day Chocolate","l":1,"c":24063,"t":85}},{"type":"quest","id":"69289","obj":{"i":69289,"n":"A Vote for Astrid","g":196,"l":"Gridania","s":188}},{"type":"quest","id":"69290","obj":{"i":69290,"n":"A Vote for Bert","g":196,"l":"Gridania","s":189}}]}