{"quest":{"name":"Bert's Big Idea","location":"Gridania","id":69293,"patch":5.1,"sort":192,"icon":100961,"eventIcon":71221,"issuer":1032132,"target":1032359,"genre":196,"journal":["Lisette has an important announcement to share with one and all.<br>※This quest is available for a limited time only.","Lisette cheerily explains to you that the votes have been all but counted, and announces that the winner of the contest is none other than Bert. She bids you accompany Bert as an unbiased observer, such that you might render a sound decision on her behalf. Bert then instructs you to wait just beyond his arranged meeting spot with your masked client.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You accompany Bert─newly minted as this year's emissary of love─to visit your heretofore masked client, who reveals himself to be none other than Guildmaster Ywain of Lancers' Guild fame. Though somewhat skeptical, Ywain humors Bert's suggestion to take up woodworking, and the two of them make their way to the Carpenters' Guild where they are greeted by a skeptical Guildmaster Beatin. The ever-serious soldier stutters that he has come seeking a better understanding of love─a confession which Beatin, as is his wont, egregiously mishears and misinterprets as a desire to deeply understand <span class=\"emphasis\">lumber</span>. Convinced that he has found a kindred spirit in his fellow guildmaster, Beatin whisks Ywain off to the depths of the Twelveswood, that they might bond over their newfound shared passion for the wonderful world of wood.","His mission to find a passionate encounter for Ywain complete—at least, in the most charitable sense of the word—Bert eagerly suggests that you both return to Lady Lisette to deliver word of his triumph.","Upon your return, Lady Lisette carefully weighs the events of the day. Though not entirely convinced at the outset, after asking your thoughts and reconsidering the matter for herself, she triumphantly declares Bert's trial a success. The passionate young man rejoices, and with her Lady Lisette's blessing, the newly crowned emissary of love steps confidently into his role as master of ceremonies for this year's Valentione's Day. Your own duty done as well, you are free to enjoy the festivities as you see fit before going forth and returning to your adventures."],"objectives":["Wait for your client outside the Carpenters' Guild.","Speak with Bert.","Speak with Bert at Mih Khetto's Amphitheatre."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you cannot have either of the quests “Astrid's Acumen” or “Rodrigault's Revelation” in progress."},{"name":"LISETTE","text":"Well, if it isn't my most beloved of adventurers! You've picked the perfect time to come. Why's that, you say? Why, I was just about to announce the results of the contest and name this year's new emissary of love!"},{"name":"LISETTE","text":"So without further ado... Ladies and gentlemen, the votes have been counted, and the winner is...Bert, and his proposal that our yearning youth, er...take up woodworking!"},{"name":"LISETTE","text":"A very...<span class=\"emphasis\">creative</span> solution, to be sure. That said, from the moment you told me that Bert's proposal had your support, I had a feeling that somehow he would emerge the victor."},{"name":"LISETTE","text":"I realize that Bert was not your first choice─to be quite honest, nor was he mine─but I do hope you will be so kind as to support him in his endeavors."},{"name":"LISETTE","text":"And wouldn't you know it...there he is right now! Bert! Oh, Bert!"},{"name":"BERT","text":"Oho! If it isn't the insightful adventurer who was the first to throw <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> support my way! To the surprise of neither of us, I'm sure, Bert the Beloved's flawless proposal has carried the day!"},{"name":"BERT","text":"Oho! Color me entirely unsurprised, for Bert the Beloved's flawless proposal has carried the day! Don't beat yourself up too much for supporting one of my vanquished foes, friend. I still welcome your assistance in any way you'd care to give it!"},{"name":"LISETTE","text":"As our newly nominated emissary of love, Bert will now go proudly forth and put his, er, rather bold proposal into action, that one more soul in this realm may find the true love and happiness they so deeply deserve."},{"name":"LISETTE","text":"On this momentous occasion, I would ask of you a special favor. Would you be so kind as to accompany my associate on his adventure of the heart, that you might witness firsthand the passion of his words and judge the efficacy of his actions?"},{"name":"LISETTE","text":"Under different circumstances, I would perform the task myself, but given my own preconceptions about the man, I fear it may be difficult for me to remain an impartial observer. You will humor me this time, will you not?"},{"name":"BERT","text":"I have already reached out to our client, and he has agreed to meet me at the Carpenters' Guild. Clearly, he is as eager to see my plan come to fruition as I am!"},{"name":"BERT","text":"You are welcome to a front row seat at my certain-to-be-masterful performance as well. Just promise that you will not get <span class=\"emphasis\">too</span> close. You wouldn't want to upstage the star of the show, of course. Now, come along!"},{"name":"LISETTE","text":"Will Bert's bold-faced plan succeed in bringing the succor of love to a young man's heart? Why, my heart flutters in anticipation! Pray watch over my associate from close by, that you might report back to me regarding all you have seen."},{"name":"YWAIN","text":"(-Pining Gridanian-)My apologies. I hope I have not kept you waiting overlong."},{"name":"BERT","text":"Oho! So our mysterious masked client finally removes his cover! And you would be...?"},{"name":"YWAIN","text":"Ywain, Guildmaster of the Lancers' Guild. A pleasure to make your acquaintance."},{"name":"BERT","text":"A pleasure, indeed! And I am Bert the Beloved, aspiring emissary of love and the hero who has come to help you tap into your true passion and claim the love you so clearly deserve! And now, allow me to elaborate on how we will do precisely that!"},{"name":"YWAIN","text":"Take up a hobby, you say? Well, I do suppose that might afford me the chance to meet new people... But what manner of pastime would you propose?"},{"name":"BERT","text":"My good man, I thought you'd never ask! Take a look around you─do you not see where we now stand?"},{"name":"YWAIN","text":"The Carpenters' Guild? Do you mean to suggest I should take up...woodworking?"},{"name":"BERT","text":"You've hit the nail straight on the head! What else <span class=\"emphasis\">but</span> woodworking? Not only is it a most virile and masculine activity fitting your ample physical prowess, it is sure to charm any lady searching for a man who pulls his weight around the house!"},{"name":"YWAIN","text":"Hmm. I cannot believe I am saying this, but...you may very well have a point."},{"name":"BERT","text":"But of <span class=\"emphasis\">course</span> I do! You'll be pleased to know that I've already worked out the details of your apprenticeship with Master Beatin. All you need do is stride through those doors, declare your arrival, and you'll be hammering and sawing in no time!"},{"name":"BERT","text":"Master Beatin! It is I, Bert the Beloved, come with the new apprentice I promised you!"},{"name":"BEATINE","text":"Yes, yes...no doubt another wide-eyed young fool who doesn't know a hatchet from a─Guildmaster Ywain!? <span class=\"emphasis\">You</span> are my new pupil?"},{"name":"BEATINE","text":"What in the Twelve's name are you thinking? Did you get bopped on the head by the butt of a lance? I'm a busy man. I don't have time to entertain wayward warriors who want to play at woodworking..."},{"name":"YWAIN","text":"I...I assure you, Master Beatin, that I am quite serious about this endeavor."},{"name":"YWAIN","text":"For I am...how shall I say it? Looking to better understand love, er..."},{"name":"BEATINE","text":"Eh, what's that you say? Looking to understand lumber...?"},{"name":"BEATINE","text":"Could it truly be? Have I misjudged you all these years? Here, I thought you a thick-headed warrior, when in fact you were a sensitive soul! A kindred spirit who marvels at the majesty of oak─revels in the resilience of rosewood...!"},{"name":"BERT","text":"Ah, forgive me, Master Beatin. It appears you misheard him. What Master Ywain's actually looking for is─"},{"name":"BEATINE","text":"Well, why didn't you say so sooner, my boy!? My fellow guildmaster, a man after my own heart! Come, and I shall teach you to become one with the wood! To know every nook and cranny of every tree in the Twelveswood! "},{"name":"BEATINE","text":"Yes, when I am through with you─and mind you, I will not rest until I have imparted <span class=\"emphasis\">all</span> of my knowledge─you will understand the mighty trees from which your precious weapons are crafted as well─nay, better!─than you know how to wield them!"},{"name":"YWAIN","text":"I... I thank you, Master Beatin, but that was not quite what I had in─"},{"name":"BEATINE","text":"Be not shy or afraid, my boy! The trees of the Twelveswood welcome you with open arms!"},{"name":"BEATINE","text":"Now come this way, my compatriot in carpentry... The wondrous world of all that is wood awaits you!"},{"name":"BERT","text":"I had heard the rumors of Master Beatin's boundless enthusiasm, but I must admit that turn of events caught me somewhat by surprise... "},{"name":"BERT","text":"Why, I daresay the man's sheer passion nigh outstrips my own! At least when it comes to wood, that is. I do hope Guildmaster Ywain was not too overwhelmed."},{"name":"BERT","text":"Still, our man was looking for an encounter full of ardor and affection, and he has certainly found one! For who is to say the man's meeting must involve the fairer sex? Man, woman, wood...in matters of the heart, I daresay the difference is immaterial. "},{"name":"BERT","text":"At any rate, Lady Lisette is surely beside herself waiting to hear word of my inevitable rousing success. Let us go together and share the triumphant tidings!"},{"name":"LISETTE","text":"I do hope Bert's plan succeeded to our client's satisfaction. Why, I simply couldn't forgive myself if I allowed that overbearing fool to tarnish the good name of House Valentione..."},{"name":"BERT","text":"You arrive at last, my friend! Rest assured that I have shared with Lady Lisette all the details of Ywain's encounter with Master Beatin. No doubt it is but a matter of moments until she declares my effort a resounding success."},{"name":"LISETTE","text":"Welcome back, my beloved friend! Bert has told me everything. To be perfectly honest with you, that was not precisely─or to be honest, not <span class=\"emphasis\">at all</span> how I had envisioned everything working out..."},{"name":"LISETTE","text":"...Which is why I seek your opinion as one who has served me loyally in the name of love. What say you? Was Bert's unusual approach worthy of the title of emissary of ardor?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That depends on the two of them..."},{"name":"A1","text":"It's a start, is it not?"},{"name":"A1","text":"There <span class=\"emphasis\">are</span> many types of love..."},{"name":"LISETTE","text":"I suppose you are right. Their relationship now might simply be one of master and student, but when two men bond over a love of wood, who knows what sparks might fly, and what passions may yet be kindled?"},{"name":"LISETTE","text":"Indeed it is. After all, until today poor Ywain scarcely spoke with anyone but stoic soldiers not unlike himself. Now, he has found a kindred spirit with whom he might bond over a love for the natural world around him. Who am I─or anyone─to say where this might lead?"},{"name":"LISETTE","text":"Do you mean to say that our friend Ywain might, like Master Beatin, find his love for trees transcends all? I am not certain that is the sort of ardor we should be encouraging, but still...I suppose a passion for wood is better than no passion at all."},{"name":"LISETTE","text":"At any rate, I do believe I have heard all I need to render my verdict. Hear me, Bert. By the powers invested in me by my forebears, I, Lisette de Valentione..."},{"name":"LISETTE","text":"...Do hereby declare you a full-fledged emissary of ardor! Congratulations, my young associate! I can quite honestly say I never expected to see this day."},{"name":"LISETTE","text":"And with that, I have no qualms whatsoever placing the full of this year's Valentione's Day proceedings under your charge."},{"name":"LISETTE","text":"Well, Bert? How does it feel to rise to the occasion? Have you aught to say to the darling adventurer who helped make this occasion possible?"},{"name":"BERT","text":"Thank you, friend! I'd be lying if I said I couldn't have done it without you─the results were quite decisive, after all─but nevertheless I most appreciate you tagging along every─well, <span class=\"emphasis\">almost</span> every step of the way to offer your support!"},{"name":"BERT","text":"...And with that, if you'll excuse me, I do believe I have a job to do. You! Yes, you! Over there! Do you truly expect to find true love looking like <span class=\"emphasis\">that</span>!? Let Bert the Beloved show you how it's done and set you on a course for destiny!"}],"reward":{"items":[{"num":5,"id":28650}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[69289,69290]}},"partials":[{"type":"npc","id":"1032132","obj":{"i":1032132,"n":"Lisette De Valentione","l":53,"q":7}},{"type":"npc","id":"1032359","obj":{"i":1032359,"n":"Bert","l":53,"q":1}},{"type":"item","id":"28650","obj":{"i":28650,"n":"Valentione's Day Chocolate","l":1,"c":24063,"t":85}},{"type":"quest","id":"69289","obj":{"i":69289,"n":"A Vote for Astrid","g":196,"l":"Gridania","s":188}},{"type":"quest","id":"69290","obj":{"i":69290,"n":"A Vote for Bert","g":196,"l":"Gridania","s":189}}]}