{"quest":{"name":"Seeking Counsel","location":"The Ocular","id":69299,"patch":5.2,"sort":130,"eventIcon":71201,"issuer":1031722,"target":1032502,"genre":9,"journal":["Alphinaud is eager to assist Captain Lyna."],"objectives":["Speak with Lyna.","Speak with Lyna at Fort Jobb in Lakeland.","Speak with the Crystarium scout.","Speak with Lyna."],"dialogue":[{"name":"MYSTERYVOICE","text":"It may simply be my imagination, but Lyna has been rather...brusque with me of late. You don't suppose she's still upset over that mishap with the salmon fillet, do you?"},{"name":"YSHTOLA","text":"To think we will not only have Zenos to contend with once we return, but a new Ultima Weapon as well. &lt;sigh&gt; Why must all of our enemies insist on returning from their graves?"},{"name":"URIANGER","text":"Upon white auracite's crystalline foundation we have built not a prison, but a refuge for the soul. Would that Moenbryda were here to see the wonders inspired by her research."},{"name":"BEQLUGG","text":"Never have I seen such a repository of knowledge. A stark reminder what little we truly know of the world."},{"name":"ALPHINAUD","text":"I must confess, while I enjoy my fair share of scholarly research, it will be good to step outside for a spot of fresh air."},{"name":"ALPHINAUD","text":"Now, then─shall we go and speak with Lyna?"},{"name":"ALPHINAUD","text":"I suggest we hurry. Lyna does not strike me as one who enjoys being made to wait."},{"name":"LYNA","text":"We have little time, so I will be brief. A sin eater has been sighted in Lakeland, and I ask for your assistance in slaying it."},{"name":"ALPHINAUD","text":"A sin eater? I had heard some few yet remained after the night had returned, but...perhaps we should call the others."},{"name":"LYNA","text":"That will not be necessary. It is only a single sin eater. A simple task for our guard, I should think."},{"name":"LYNA","text":"That said, I believe fighting alongside the Warrior of Darkness would be a valuable experience for them."},{"name":"LYNA","text":"Peace can lead to complacency, and they gain nothing from an easy victory. But you do not underestimate your foes, however harmless they may seem. My men would do well to learn from your example."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let's be about it, then."},{"name":"A2","text":"Me? Why not Alphinaud?"},{"name":"ALPHINAUD","text":"You cannot be serious. Come now, <span class=\"highlight\">Forename</span>─what could be more inspiring than fighting alongside the renowned Warrior of Darkness <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>?"},{"name":"LYNA","text":"Excellent. Then let us make for Fort Jobb."},{"name":"ALPHINAUD","text":"The sin eaters that remain no longer have a leader to guide them, but they are no less dangerous. They cannot be suffered to live."},{"name":"LYNA","text":"If you would wait here a moment, I will gather the others."},{"name":"LYNA","text":"You may not remember, but you have met these soldiers once before, though only in passing."},{"name":"LYNA","text":"Long have they awaited the opportunity to fight at your side."},{"name":"INJUREDB03607","text":"I was at death's door that day after the sin eaters attacked. If you and yours hadn't come along, I'd have likely stepped through. And I wouldn't have been alone."},{"name":"INJUREDB03607","text":"Your courage and selflessness is something we all aspire to."},{"name":"INJUREDC03607","text":"I too was there that terrible day. My friend was transformed into a sin eater before my very eyes, and I had no choice but to cut her down. The thought of returning to the field, of holding a blade again─it filled me with dread."},{"name":"INJUREDC03607","text":"But that is no way to honor her or my comrades. And so I have returned! I swear I will not let you or anyone else down from this day forward."},{"name":"CRYSTARIUMGARDPICKET","text":"A pleasure to meet you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. Truly. It seems like only yesterday I watched as you took flight astride an amaro to go and save the Oracle."},{"name":"CRYSTARIUMGARDPICKET","text":"Strange to think the Eulmoran soldiers we once locked blades with are now on our side, but we will do our utmost to keep the peace here in Lakeland."},{"name":"LYNA","text":"We seem to be missing one─"},{"name":"SOLDIER03608","text":"(-Honest Soldier-)My apologies, Captain Lyna. An elderly gentleman asked that I escort him to Clearmelt. It...took longer than I anticipated."},{"name":"LYNA","text":"I'll not begrudge your desire to help those in need, but a soldier must be punctual. Especially when we play host to honored guests."},{"name":"SOLDIER03608","text":"(-Honest Soldier-)It won't happen again."},{"name":"SOLDIER03608","text":"The name's Theyler. I'm sure you don't remember, but we met once before in the infirmary."},{"name":"SOLDIER03608","text":"I asked you to deliver a message to the Exarch and the Warrior of Darkness. Little did I know I was already talking to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"SOLDIER03608","text":"Don't give up. Don't give in. I keep those words close to my heart. And the boundless, beautiful skies above serve as a reminder of their importance."},{"name":"SOLDIER03608","text":"My friend got to see the night's return shortly before he passed. He left this world with a smile, satisfied with a glimpse of what was to come."},{"name":"SOLDIER03608","text":"But there are countless others who weren't so fortunate."},{"name":"SOLDIER03608","text":"They gave their lives for the promise of a future they'll never know. And so it falls to us to do everything we can to fulfill that promise."},{"name":"SOLDIER03608","text":"No matter what happens, we won't give up. We won't give in!"},{"name":"LYNA","text":"Your heroism has inspired all of our guardsmen in much the same manner."},{"name":"LYNA","text":"Our scouts at the Northern Staging Point have not had the pleasure of meeting you in person."},{"name":"LYNA","text":"Let us not keep them waiting."},{"name":"BRAVESOLDIER","text":"If I hadn't seen him with my own eyes, I'd have sworn it was you who killed that sin eater."}],"reward":{"gil":1245},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69298]},"next":[69300]},"partials":[{"type":"npc","id":"1031722","obj":{"i":1031722,"n":"Alphinaud","l":3223,"q":1}},{"type":"npc","id":"1032502","obj":{"i":1032502,"n":"Lyna","l":2953,"q":2}},{"type":"quest","id":"69298","obj":{"i":69298,"n":"The Way Home","g":9,"l":"The Lochs","s":120}},{"type":"quest","id":"69300","obj":{"i":69300,"n":"Facing the Truth","g":9,"l":"Lakeland","s":140}}]}