{"quest":{"name":"The Mendicant's Court","location":"The Firmament","id":69296,"patch":5.1,"sort":0,"eventIcon":71221,"issuer":1031684,"target":1031684,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"FRANCEL","text":"<span class=\"highlight\">Forename</span>, ever a sight for sore eyes! What brings you here this day? Are you come to see our progress, or perhaps to contribute to it?"},{"name":"FRANCEL","text":"In any case, I owe you a debt of gratitude. Thanks to able and willing helpers such as your good self, the reconstruction effort proceeds apace. This court has fairly been reborn, I believe you will agree."},{"name":"AUGEBERT","text":"Oi, Francel. I've finished my checks, and everything looks to be order. That's that for the court, I reckon."},{"name":"FRANCEL","text":"Glad am I to hear it. This is a momentous step in our project─one we could not have taken without the aid of Ishgardians and outsiders alike."},{"name":"AUGEBERT","text":"Aye. At last, we've got a flow of materials comin' in, along with the hands to put it all to use. It begins in earnest."},{"name":"FRANCEL","text":"That it does, my friend. That it does."},{"name":"FRANCEL","text":"<span class=\"highlight\">Forename</span>, Augebert. There is something I would ask of you."},{"name":"FRANCEL","text":"I bid you commit to your mind's eye the Firmament as it is now."},{"name":"FRANCEL","text":"When the last paving stone is laid, I would have you fully appreciate how much has been accomplished by the sweat of innumerable brows."},{"name":"FRANCEL","text":"For though Ishgard may arrive at a brighter future, we must never forget the path we walked to get there, fraught with sorrow and sacrifice as it was."},{"name":"FRANCEL","text":"If we do so, I fear we will lose our way again."},{"name":"AUGEBERT","text":"Heh, same old Francel, though, eh? Try to unclench that jaw of yours a little, lad, else you're liable to give yourself a fever and collapse like you used to."},{"name":"FRANCEL","text":"Those days are long past, thank you very much!"},{"name":"FRANCEL","text":"&lt;sigh&gt; Just...remember what I asked. And pray keep it private. 'Tis a personal request to the two of you."},{"name":"AUGEBERT","text":"Don't worry, you know I ain't no gossipmonger. Now then, if there's nothing else, I'll get back to it."},{"name":"FRANCEL","text":"All right, my friend. Take care you do not overwork yourself, and tell the others the same."},{"name":"FRANCEL","text":"Well, there you have it, <span class=\"highlight\">Forename</span>. There will be a brief hiatus while we prepare for the next phase of construction. When all is in readiness, I shall make another announcement."},{"name":"FRANCEL","text":"In the meantime, do rest and recover your strength. 'Twas good to see you again."}],"reqs":{"quests":[69208]}},"partials":[{"type":"npc","id":"1031684","obj":{"i":1031684,"n":"Francel","l":3435,"q":2}},{"type":"quest","id":"69208","obj":{"i":69208,"n":"Towards the Firmament","g":83,"l":"Ishgard","s":1,"f":1}}]}