{"quest":{"name":"Memories Rekindled","location":"Western Thanalan","id":69295,"patch":5.1,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1032363,"target":1032363,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"OLDPERSON03759","text":"Ah! Nothin' like starin' out at the sea to bring an old man back to his glory days. Aye, the good ol' times when his whole life still lay ahead of him, and the greatest adventures were yet to be..."},{"name":"OLDPERSON03759","text":"...Gah! Don't ye know better than to sneak up on your elders like that, young'un? Are ye tryin' to send me to an early grave? Well, not <span class=\"emphasis\">early</span>, as such..."},{"name":"OLDPERSON03759","text":"But don't tell me...aye, I can see it just from the look o' you. You're an adventurer, an' an accomplished one at that, yes? Aye, ye may not be the greybeard I am, but I reckon you've a memory or two you'd be keen on rememberin'."},{"name":"OLDPERSON03759","text":"So what say ye join me for a while before ye return to the road? After all, sometimes reflectin' on the past can be just what you need to discover the path ye'd forge into the future."},{"name":"SYSTEM","text":"You now have access to the New Game+ system. New Game+ allows you to relive the adventures of your past by replaying previous quests with your current character data."},{"name":"SYSTEM","text":"To replay old quests with New Game+, open the <span class=\"highlight\">New Game+</span> interface located under <span class=\"highlight\">Duty</span> in the main menu, and select the chapter you wish to experience anew."},{"name":"SYSTEM","text":"Please note that special rules and conditions will apply when replaying quests with New Game+. For detailed information, please review the help text in the New Game+ menu."}],"reqs":{"quests":[70058]}},"partials":[{"type":"npc","id":"1032363","obj":{"i":1032363,"n":"Wistful Whitebeard","l":42,"q":1}},{"type":"quest","id":"70058","obj":{"i":70058,"n":"The Ultimate Weapon","g":1,"l":"Northern Thanalan","s":249}}]}