{"quest":{"name":"In the Name of the Light","location":"The Crystarium","id":69307,"patch":5.3,"sort":210,"icon":101006,"eventIcon":71201,"issuer":1027231,"target":1027248,"genre":9,"journal":["The manager of suites is looking a little anxious.","As you converse with the manager of suites in the Pendants, Moren arrives to thank you for revealing the truth about Ardbert and his comrades to the people. While on the subject, you take the opportunity to ask him what he knows of Warriors of Light, and he seems all too eager to enlighten you─when suitably prepared. The librarian duly heads back to the Cabinet of Curiosity to gather up materials, and bids you join him there at your earliest convenience.","Reporting for your lesson at the Cabinet, you are soon joined by Alphinaud, Alisaie, and Ryne, who chanced to be there on separate errands. His class duly assembled, Moren proceeds to explain that, despite sharing no apparent connection, many individuals have been hailed as Warriors of Light throughout Vrandtic history, and that in time the title came to be a synonym for hero. Intrigued, Alphinaud observes that the epithet is similarly used in the Source, and posits that Hydaelyn is likely the common thread. As you ponder what this might imply, you are interrupted by a little girl's excited voice followed by the rumble of tumbling tomes. You turn towards the commotion to find three Crystarium younglings, a shame-faced Riqi-Tio and her friends Arkil and Eirwel, whom Moren wastes no time chastising for their lack of care. Upon realizing she is in the presence of the great Warrior of Darkness, however, Riqi-Tio's chagrin reverts to excitement, and she can barely contain herself as she asks you what she must do to become a hero─or “Warrior of Light.”","In impassioned tones, Riqi-Tio elaborates on her ambition. She wishes to become a specific kind of Warrior of Light─one who uses potions to fight─and has come to the Cabinet to study. Rather than through tomes, however, Alphinaud believes she stands to learn best by observing the chirurgeons at work, and to that end he bids you accompany the Mystel child to Spagyrics.","The kindly Chessamile takes Riqi-Tio under her wing, and entrusts her with a task: retrieving a potion ingredient from Sweetsieve. Lest her new charge come to harm, the chief chirurgeon requests that you go along to keep a watchful eye, before directing you to seek out a woman named Gracine.","Gracine informs you that Chessamile's order is for grapes, but apologetically adds that they have yet to be harvested. At her suggestion, you go to help Alphinaud and Riqi-Tio pick bunches of undersized fruit directly from the vines.","You pick what appears to be a reasonable haul of grapes, and take them to Riqi-Tio.","Fruit-picking concluded, Alphinaud asks Riqi-Tio what inspired her decision to become an apothecary and a Warrior of Light. The girl's response prompts him to reevaluate his belief that it was Elidibus who planted the desire to become Warriors of Light within people's hearts. Instead, he concludes, the desire to help their fellow man was present from the beginning. Having reaffirmed his resolve to settle matters in the First before departing for the Source, Alphinaud bends his steps back to Spagyrics, and you follow in turn.","Riqi-Tio proudly delivers the grapes to Chessamile, and by the completion of this little task, takes her first step on the road to becoming a Warrior of Light. It falls to you to ensure that her pure intent is not twisted to serve some grand Ascian design..."],"objectives":["Speak with Moren.","Speak with Riqi-Tio.","Speak with Chessamile.","Speak with Gracine.","Obtain bunches of undersized grapes.","Deliver the bunches of undersized grapes to Riqi-Tio.","Speak with Chessamile."],"dialogue":[{"name":"SYSTEM","text":"In order to proceed with this quest, you must first complete the quest “My Little Chocobo (MaelstromTwin AdderImmortal Flames).”"},{"name":"SYSTEM","text":"You may accept the quest “My Little Chocobo (MaelstromTwin AdderImmortal Flames)” by speaking with R'ashaht Rhiki at Maelstrom CommandVorsaile Heuloix at the Adders' NestCommander Swift at the Hall of Flames."},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the Crystal Tower quest series."},{"name":"SYSTEM","text":"The starting quest, “Legacy of Allag,” may be undertaken by speaking with the outlandish man in Revenant's Toll."},{"name":"SYSTEM","text":"You may review your progress under “Chronicles of a New Era - The Crystal Tower” in your journal."},{"name":"SYSTEM","text":"In order to proceed with this quest, you must first complete the quest “My Little Chocobo (MaelstromTwin AdderImmortal Flames).”"},{"name":"SYSTEM","text":"You may accept the quest “My Little Chocobo (MaelstromTwin AdderImmortal Flames)” by speaking with R'ashaht Rhiki at Maelstrom CommandVorsaile Heuloix at the Adders' NestCommander Swift at the Hall of Flames."},{"name":"SYSTEM","text":"You are also required to complete the Crystal Tower quest series."},{"name":"SYSTEM","text":"The starting quest, “Legacy of Allag,” may be undertaken by speaking with the outlandish man in Revenant's Toll."},{"name":"SYSTEM","text":"You may review your progress under “Chronicles of a New Era - The Crystal Tower” in your journal."},{"name":"GUIDEOFTHEPENDANTS","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. Will you be venturing forth today?"},{"name":"GUIDEOFTHEPENDANTS","text":"Do be sure to take care if so. Though they say the starshower was harmless, one can never be too careful."},{"name":"GUIDEOFTHEPENDANTS","text":"...But I concede it is not for me to tell the Warrior of Darkness how to look after <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>. Old habits, you understand."},{"name":"MOREN","text":"(-???-)Ah, <span class=\"highlight\">Forename</span>! How very opportune!"},{"name":"MOREN","text":"Greetings, my friend. Do you perchance have a moment to spare?"},{"name":"MOREN","text":"Wonderful, wonderful!"},{"name":"MOREN","text":"I wanted to thank you, you see. For revealing to us the truth of the Warriors of Light."},{"name":"MOREN","text":"After all these years, your tale set the record straight. Finally, the people see them as the great heroes they were."},{"name":"MOREN","text":"Or the great hero he <span class=\"emphasis\">is</span> in the case of Ardbert. You too were surprised to see him, I think?"},{"name":"MOREN","text":"At the time, I was not certain what to make of it all, but I could see the effect his words had on those around me. And then the stars rained down from the sky, and...well, you know the rest."},{"name":"MOREN","text":"When the commotion died down, you were nowhere to be seen, but I was determined to express my gratitude. And so here I am."},{"name":"MOREN","text":"Thank you, <span class=\"highlight\">Forename</span>─for giving voice to the truth, and restoring the Warriors of Light to their rightful place in history."},{"name":"MOREN","text":"Should you, perhaps, wish to have your account of these matters committed to writing, I would be more than willing to serve as your scribe. Indeed, if there is <span class=\"emphasis\">anything</span> I can do to help─anything at all─you need only say the word."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What can you tell me about the Warriors of Light?"},{"name":"A1","text":"Very well. Tell me what the situation is like in the city."},{"name":"MOREN","text":"I beg your pardon? <span class=\"emphasis\">You</span> wish to ask <span class=\"emphasis\">me</span> about the Warriors of Light?"},{"name":"MOREN","text":"Forgive me, but I daresay you already know more about them than any living soul─save for Ardbert himself, of course."},{"name":"MOREN","text":"Unless...you refer to the Warriors of Light more broadly?"},{"name":"MOREN","text":"If so, I may yet be able to assist you in some small way."},{"name":"MOREN","text":"The situation in the city? Do you mean...the people's awakening as Warriors of Light?"},{"name":"MOREN","text":"Well, while questions remain about the circumstances surrounding Ardbert's return, history tells us that what took place may not be entirely unprecedented."},{"name":"MOREN","text":"Ah, but to understand that requires an understanding of “Warriors of Light” in a broader Vrandtic context."},{"name":"MOREN","text":"If it please you, I should be glad to provide an overview. I flatter myself that it may grant you a better grasp of that which is occurring not only in the Crystarium, but the world at large."},{"name":"MOREN","text":"Excellent! I shall return to the Cabinet at once and look up the relevant texts. Pray join me at your earliest convenience."},{"name":"GUIDEOFTHEPENDANTS","text":"No rest for the righteous, it would seem."},{"name":"GUIDEOFTHEPENDANTS","text":"Do not let me keep you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I bid you a pleasant day."},{"name":"MOREN","text":"Ah, <span class=\"highlight\">Forename</span>, excellent timing. I have but this moment finished gathering the materials for our lesson."},{"name":"MOREN","text":"As a great many works make reference to the Warriors of Light, I shall─with your permission─focus only upon the details that seem most relevant."},{"name":"ALPHINAUD","text":"The Warriors of Light, you say? Forgive us, but we couldn't help overhearing."},{"name":"ALISAIE","text":"We've been out keeping watch over the Crystarium, but it appears to be business as usual."},{"name":"ALISAIE","text":"So I thought I'd spend some time brushing up my knowledge of familiars, and Alphinaud volunteered to help."},{"name":"RYNE","text":"I...actually came on a different errand, but I'd be interested in hearing about the Warriors of Light as well."},{"name":"RYNE","text":"May I join you?"},{"name":"MOREN","text":"Of course, of course! The more the merrier!"},{"name":"MOREN","text":"If you would care to find a table below, I shall be down with the books in a moment."},{"name":"MOREN","text":"Were one to pore over the annals of Vrandtic history, one would note the comparatively frequent recurrence of individuals hailed as “Warriors of Light.”"},{"name":"MOREN","text":"Ardbert and his comrades require no introduction, but many others bore the epithet long before them."},{"name":"MOREN","text":"To name but a few, there was Tolthewil, legendary first king of Lakeland, Roddfort and Saulard, the fabled Drahn and Galdjent duo of Voeburt..."},{"name":"MOREN","text":"And no list of Vrandtic heroes would be complete without the archmage Tiuna of Ronka. In older texts, she too was called a Warrior of Light."},{"name":"ALISAIE","text":"It did surprise me how ready people were to forget the negative associations of the title. But it makes sense if it's been around for centuries."},{"name":"MOREN","text":"Verily. In ages past, it was simply a synonym for “hero.”"},{"name":"MOREN","text":"In the wake of the Flood, however, Light came to be regarded with fear; the title used not to exalt, but to revile."},{"name":"MOREN","text":"A far cry from its beginnings..."},{"name":"MOREN","text":"This, my friends, is Norvrandt's oldest epic. The original tale of the struggle between good and evil."},{"name":"MOREN","text":"In a time when all lay shrouded in Darkness, a prophesied hero rose to deliver the world from its doom. Fighting in the name of the Light, the hero styled himself its foot soldier. And thus did he come to be known as “The Warrior of Light.”"},{"name":"MOREN","text":"Curiously, in the centuries that followed, other heroes appeared who claimed the selfsame epithet, despite sharing no discernible connection with their predecessors."},{"name":"MOREN","text":"And in time, Warrior of Light came to be a name accorded to all men and women of uncommon skill and valor."},{"name":"ALPHINAUD","text":"Well, well... The plot thickens."},{"name":"ALPHINAUD","text":"As you know, the title of Warrior of Light is also used in the Source."},{"name":"ALPHINAUD","text":"Though the manners in which individuals have earned it are many and varied, heroes have been honored thus since antiquity."},{"name":"ALPHINAUD","text":"Nor does the custom show any sign of dying out─as you can well attest."},{"name":"RYNE","text":"It makes you wonder, doesn't it... It surely can't be a coincidence."},{"name":"ALPHINAUD","text":"Indeed not."},{"name":"ALPHINAUD","text":"Let us imagine a man who has awakened to the Echo and is able to hear Hydaelyn's voice. As She styles him, so too does he style himself─a Warrior of Light."},{"name":"ALPHINAUD","text":"Of course, being blessed with the Echo does not in itself make one a hero. And conversely, there will have been no few heroes who were <span class=\"emphasis\">not</span> blessed with it."},{"name":"ALPHINAUD","text":"But such distinctions are immaterial to the masses, and over time they came to use the title “Warrior of Light” and the word “hero” interchangeably."},{"name":"ALISAIE","text":"Sounds about right. It would be interesting to see if the theory holds true in the other worlds─if crossing the rift were that easy."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Hydaelyn <span class=\"emphasis\">did</span> call me a Warrior of Light."},{"name":"A2","text":"What's in a name? It doesn't change anything."},{"name":"A2","text":"And there I was thinking I was special..."},{"name":"RYNE","text":"She did? I've never heard Her voice myself."},{"name":"RYNE","text":"But I can feel Her presence. Perhaps through Minfilia."},{"name":"RYNE","text":"Well...I think a name can mean a lot. And I imagine it would be terrible to have people call you something which didn't feel right."},{"name":"RYNE","text":"B-But you <span class=\"emphasis\">are</span> special! No matter how many Warriors of Light there are out there, there's no one like you!"},{"name":"ALISAIE","text":"At any rate, assuming all of this is true, and there's a common thread behind the epithet, I doubt the Ascians will have been amused."},{"name":"ALISAIE","text":"To have the world at large associate Light, and by extension Hydaelyn, with “good” must have added insult to injury."},{"name":"MOREN","text":"Ahem. While this discussion is undeniably fascinating, I wonder...should I be privy to it? Mayhap it would be better if I excused myself...?"},{"name":"ALPHINAUD","text":"Oh! No need for that, my friend! Pray accept our apologies. Your lesson on the Warriors of Light has given us much to ponder..."},{"name":"RIQITIO","text":"(-Little Girl's Voice-)Ooh, ooh! Did someone say Warriors of Light!?"},{"name":"RIQITIO","text":"(-Little Girl's Voice-)Uwaaah!"},{"name":"MOREN","text":"Riqi-Tio! Are you all right!?"},{"name":"MOREN","text":"Ahhh, my precious tomes... &lt;sigh&gt; Did I not say you must take care in the Cabinet?"},{"name":"MOREN","text":"You too, Arkil! Eirwel!"},{"name":"ARKIL","text":"(-Arkil-)We're sorry, Master Moren..."},{"name":"ARKIL","text":"(-Arkil-)&lt;gasp&gt; Aren't you...?"},{"name":"RIQITIO","text":"...The Warrior of Darkness!?"},{"name":"RIQITIO","text":"M-My name's Riqi-Tio, and...and I want to help everyone!"},{"name":"RIQITIO","text":"Please, tell me what I have to do to be a hero─to be a Warrior of Light!"},{"name":"ALPHINAUD","text":"Setting aside our misgivings, it would seem churlish to discourage the young lady. Let's hear what she has to say."},{"name":"ALISAIE","text":"No harm done. To the children, at least..."},{"name":"RYNE","text":"Even children want to become Warriors of Light..."},{"name":"MOREN","text":"The children's inquisitiveness is to be commended, but...ahhh, my precious tomes..."},{"name":"EIRWEL","text":"We're sorry we knocked over the books..."},{"name":"ARKIL","text":"Um...do you remember me?"},{"name":"ARKIL","text":"When you returned from the sea with the Exarch, I asked you how you became so strong."},{"name":"RIQITIO","text":"So, I want to be a Warrior of Light. But not one that fights with a sword and all that."},{"name":"RIQITIO","text":"No, I want to be the kind that fights with potions and heals people! An apothecary!"},{"name":"RIQITIO","text":"And I'm going to help everyone in the Crystarium. No, in all of Norvrandt!"},{"name":"RIQITIO","text":"When I told Arkil and Eirwel this, they said that the Cabinet should have lots of tomes about potions."},{"name":"RIQITIO","text":"But this place is so big, and we don't have the faintest idea where to begin searching. At this rate, I'm not going to get anywhere..."},{"name":"ALPHINAUD","text":"If one knew where to look, one should indeed be able to find treatises on potions here. Even so, I fear they may prove a little difficult for ones so young. But hmmm..."},{"name":"ALPHINAUD","text":"Esteemed Warrior of Darkness, perhaps you might accompany young Riqi-Tio to Spagyrics? Rather than through tomes, I believe she stands to learn more by observing the chirurgeons at their work."},{"name":"ALISAIE","text":"Sounds like a plan. It seems we've finished here, so we'll come with you."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Last one to Spagyrics is a rotten egg!"},{"name":"A3","text":"I'll go, but only for a little while."},{"name":"A3","text":"I don't have time for this..."},{"name":"RIQITIO","text":"Hah, I'll have you know I'm really fast! You're going to be the rotten egg!"},{"name":"RIQITIO","text":"Really? Thank you so much, Warrior of Darkness! We'll see you at Spagyrics!"},{"name":"ALPHINAUD","text":"I know you are a busy <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, but we can't well leave them without guidance. And it would only be for a little while."},{"name":"ALPHINAUD","text":"You can find your way to Spagyrics, I trust? Off you go, then, and have care you do not knock anything else over."},{"name":"MOREN","text":"I shall remain here and tidy up. I hope that today's lesson will be of some use to you."},{"name":"ALPHINAUD","text":"See how her eyes shine, my friend. We have made her day."},{"name":"ALPHINAUD","text":"Ascian machination or no, it wouldn't do to dash the dreams of one so young. The Exarch would feel the same, I believe."},{"name":"ALISAIE","text":"A warrior who fights with potions... It's certainly innovative. I prefer a blade myself, but to each her own."},{"name":"RYNE","text":"It appears there aren't so many patients at the moment. I only pray that such peaceful days continue."},{"name":"RIQITIO","text":"Right, I'm here! What do I do? What do I do?"},{"name":"ARKIL","text":"Chessamile's medicines work really well. I just wish they didn't taste so bad."},{"name":"EIRWEL","text":"After you've finished helping Riqi, can you help us become Warriors of Light too?"},{"name":"CHESSAMILE","text":"Well now, to what do I owe the pleasure of so many bright-eyed visitors?"},{"name":"CHESSAMILE","text":"Is that the way of it, sweetie? You wish to learn about medicine?"},{"name":"RIQITIO","text":"That's right! I want to become a Warrior of Light who uses potions to help people all over the world!"},{"name":"CHESSAMILE","text":"Well, that is a very noble endeavor, and you aren't alone in it. No few at our infirmary yearn to venture forth as Warriors of Light."},{"name":"CHESSAMILE","text":"But ultimately, they have all decided not to pursue that dream."},{"name":"RIQITIO","text":"Huh? Why?"},{"name":"CHESSAMILE","text":"Because the people here need them too, sweetie."},{"name":"CHESSAMILE","text":"The guards who place themselves in harm's way to keep us safe. The artisans who toil tirelessly that we might sustain our way of life. And younglings like you, who are the future of the Crystarium."},{"name":"CHESSAMILE","text":"They couldn't simply abandon them, you see. And so, difficult though it was, they made the decision to remain."},{"name":"RIQITIO","text":"Then...does this mean my dream isn't any good?"},{"name":"CHESSAMILE","text":"Oh, sweetie, yours is a wonderful dream. And it would be my pleasure to help you to pursue it."},{"name":"CHESSAMILE","text":"If we all work hard, the day will come when our chirurgeons may set forth to aid folk in every corner of the realm."},{"name":"CHESSAMILE","text":"As we strive towards that day, I hope that we can rely upon you as well. Though I must warn you, ours is not an easy path. No, you must work very, very hard."},{"name":"RIQITIO","text":"I'm not afraid of hard work! I'll become the best apothecary ever, just you watch!"},{"name":"CHESSAMILE","text":"Hee hee, that's the spirit! Without further ado, then, may I entrust you with a task?"},{"name":"CHESSAMILE","text":"I have placed an order at Sweetsieve for a potion ingredient, and I would like you to go and collect it."},{"name":"RIQITIO","text":"Ooh, an ingredient! Leave it to me, miss!"},{"name":"CHESSAMILE","text":"My, such an abundance of energy. Though I can't help wonder if she'll be all right by herself..."},{"name":"CHESSAMILE","text":"My apologies, but would you mind accompanying her? When you arrive at Sweetsieve, speak with a woman named Gracine, and she will point you in the right direction."},{"name":"ALPHINAUD","text":"I shall join you. As the one who suggested this course to Riqi-Tio, I would assist in her first steps."},{"name":"ALISAIE","text":"And what about the two of you? Are you coming along too?"},{"name":"EIRWEL","text":"Well, we <span class=\"emphasis\">do</span> want to become Warriors of Light, just not the same kind as Riqi."},{"name":"EIRWEL","text":"So we'll wait for you here, Warrior of Darkness. When you return, please teach us how to fight!"},{"name":"ALISAIE","text":"In that case, Ryne and I shall keep them company and take the opportunity to ask about their aspirations."},{"name":"ALISAIE","text":"Too many grown-ups would only diminish Riqi-Tio's sense of accomplishment. We'll stay here and talk to her friends."},{"name":"RYNE","text":"If it's to be had at Sweetsieve, I assume the ingredient is some manner of crop."},{"name":"ARKIL","text":"We know you're busy, but we want to be just like you. We hope you'll teach us how."},{"name":"EIRWEL","text":"We won't move an ilm until you return!"},{"name":"CHESSAMILE","text":"Thank you, sweetie. I feel better knowing that you're keeping an eye on Riqi-Tio."},{"name":"ALPHINAUD","text":"Ah, there you are. As it turns out, the ingredient still wants for harvesting, so we are going about that now."},{"name":"RIQITIO","text":"Hmmm... Are these small enough?"},{"name":"GRACINE","text":"&lt;gasp&gt; If it isn't the Warrior of Darkness <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>! May I assume you are with Master Alphinaud?"},{"name":"GRACINE","text":"Right. Lest you wonder, Chessamile's order is for grapes."},{"name":"GRACINE","text":"As busy as we have been of late, however, I regret to say we didn't have the time to harvest them."},{"name":"GRACINE","text":"So it was with apologies that I asked Master Alphinaud and his young companion to help themselves to the fruits on the vines. Perhaps you could lend them a hand?"},{"name":"GRACINE","text":"It's the undersized grapes you'll want to pick. They're too small for normal consumption, but suitable for making wine and medicine."},{"name":"GRACINE","text":"My apologies again for failing to have the grapes ready. Next time, please let us treat you to the pick of the crop!"},{"name":"ALPHINAUD","text":"I've harvested all the undersized grapes I could find here. How goes the picking effort?"},{"name":"RIQITIO","text":"Oh, you're here too? We're picking little grapes. It's quite fun!"},{"name":"RIQITIO","text":"Wow, you've picked this many already!? Amazing!"},{"name":"ALPHINAUD","text":"I daresay we have enough between us. Shall we take them back to Chessamile?"},{"name":"RIQITIO","text":"Heh heh! I can't wait to see what she's going to do with them!"},{"name":"ALPHINAUD","text":"Tell me, Riqi─what made you want to become an apothecary and Warrior of Light?"},{"name":"RIQITIO","text":"Why? Well..."},{"name":"RIQITIO","text":"A while ago, I fell sick. Really sick. My body was burning up, and I felt so weak I couldn't even get out of bed."},{"name":"RIQITIO","text":"Then a traveling apothecary came and gave me a potion to drink. It was the foulest thing I'd ever tasted...but it made me get better!"},{"name":"RIQITIO","text":"She was so brave─the apothecary, I mean. She went around taking care of people, even when it was dangerous. And I decided I wanted to help people, just like her."},{"name":"RIQITIO","text":"So I started brewing potions out of grass and giving them to my friends. But I didn't really know what I was doing, or if there was anything else I could do."},{"name":"RIQITIO","text":"Then not long ago, a neighbor told me he was going to become a Warrior of Light, and go traveling the world, helping people."},{"name":"RIQITIO","text":"And I thought, that's the same as what <span class=\"emphasis\">I</span> want to do!"},{"name":"ALPHINAUD","text":"I see. Out of curiosity, what did your neighbor do in the end?"},{"name":"RIQITIO","text":"Theyler? I haven't seen him for a bit, so he must already be out there looking for people to help."},{"name":"ALPHINAUD","text":"Theyler... One of the guards awakened by the starshower."},{"name":"ALPHINAUD","text":"Thank you for sharing your tale with us, Riqi-Tio. I myself took inspiration from one not unlike your traveling apothecary, and I hope her good example will spur you on to realize your dreams."},{"name":"ALPHINAUD","text":"But it will not be done in a day. Such lofty goals are reached through hard work and persistence, through countless little acts of heroism─like delivering the grapes to Chessamile."},{"name":"ALPHINAUD","text":"...It would seem I have been laboring under a misapprehension."},{"name":"ALPHINAUD","text":"I had convinced myself that it was Elidibus who had sowed the desire to become Warriors of Light within the hearts of the people."},{"name":"ALPHINAUD","text":"But I see now that the impulse to aid their fellow man abided within them from the first."},{"name":"ALPHINAUD","text":"Elidibus did no more than give it a name."},{"name":"ALPHINAUD","text":"And as he so kindly proclaimed, we must return to our own world ere long."},{"name":"ALPHINAUD","text":"With the Exarch laboring tirelessly, I doubt not but that a way will be found."},{"name":"ALPHINAUD","text":"Yet I believe I speak for us all when I say I cannot leave in good conscience─not until we have dealt with Elidibus."},{"name":"ALPHINAUD","text":"This is no longer a strange and distant land, after all. Norvrandt has become as a home to us, and her people our own."},{"name":"ALPHINAUD","text":"Hm. Let us return to Spagyrics. It wouldn't do to keep your admirers waiting."},{"name":"ALPHINAUD","text":"Riqi-Tio has delivered her grapes, as have I."},{"name":"ALISAIE","text":"After chatting with Arkil and Eirwel here, we came to an agreement─but I'll let them explain their request themselves."},{"name":"RYNE","text":"Riqi-Tio was beaming with pride when she returned."},{"name":"RYNE","text":"It may only have been a simple task, but she won't soon forget this achievement."},{"name":"RIQITIO","text":"Thanks for helping with the grapes, Warrior of Darkness. In return, I promise to brew you a potion one day!"},{"name":"ARKIL","text":"Riqi didn't make you drink one of her grass potions, did she?"},{"name":"EIRWEL","text":"Huzzah, you're back! We're ready to start learning!"},{"name":"CHESSAMILE","text":"My thanks for your kind help, sweetie. We now have all the ingredients we require."},{"name":"CHESSAMILE","text":"From the grapes we shall make a vinegar, to which we will add elf grass and a few other herbs to produce an invigorating syrup. Though it's unspeakably sour, it does wonders for the constitution."},{"name":"CHESSAMILE","text":"As part of her studies, I may just have to give Riqi-Tio a little taste. Hee hee!"}],"reward":{"gil":1295},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69306]},"next":[69308]},"partials":[{"type":"npc","id":"1027231","obj":{"i":1027231,"n":"Manager Of Suites","l":2951,"q":6}},{"type":"npc","id":"1027248","obj":{"i":1027248,"n":"Chessamile","l":2951,"q":2}},{"type":"quest","id":"69306","obj":{"i":69306,"n":"Echoes of a Fallen Star","g":9,"l":"Kholusia","s":200}},{"type":"quest","id":"69308","obj":{"i":69308,"n":"Heroic Dreams","g":9,"l":"The Crystarium","s":220}}]}