{"quest":{"name":"Deep Designs","location":"The Rak'tika Greatwood","id":69303,"patch":5.2,"sort":170,"eventIcon":71201,"issuer":1032518,"target":1027757,"genre":9,"journal":["Y'shtola would have you depart for the Tempest without delay."],"objectives":["Speak with Tolshs Aath in the Ondo Cups.","Retrieve the mnyiri livers from the Flounders' Floor.","Deliver the mnyiri livers to Tolshs Aath."],"dialogue":[{"name":"ALPHINAUD","text":"Would that I had found the words to deny Elidibus. We are so much more than he believes us to be, and yet..."},{"name":"ALISAIE","text":"...Am I the only one who sees the irony in “Ardbert” calling <span class=\"emphasis\">us</span> puppets?"},{"name":"URIANGER","text":"Disdain and obfuscation. What is thy true design, Emissary...?"},{"name":"THANCRED","text":"I hate to leave him like that. Gods, they can't even let a man rest in peace..."},{"name":"RYNE","text":"Thancred told me what Lahabrea did to him. I can't imagine how he's feeling right now."},{"name":"YSHTOLA","text":"Alphinaud has the right of it. Let us pay visit to the Ondo."},{"name":"YSHTOLA","text":"We should speak with Tolshs Aath first. As chieftain, he is doubtless privy to a great many secrets."},{"name":"YSHTOLA","text":"Don't be shy, now."},{"name":"ALPHINAUD","text":"Perhaps we might look in on Paushs Ooan while we're in the area."},{"name":"ALISAIE","text":"This place feels much less ominous than the first time we were here. Then again, we did have the shadow of your impending death hanging over us."},{"name":"URIANGER","text":"Mayhap we shall find the secrets we seek in these depths...should their keepers consent to aid us."},{"name":"THANCRED","text":"The last time we were here, the Ondo sent us to slay a massive creature. 'Twas as large as Leviathan, twice as angry, and... Yes, of course I jest. It was only <span class=\"emphasis\">half</span> as large."},{"name":"RYNE","text":"I'm glad to have the opportunity to visit the Tempest again. It's so lovely here─like a different world entirely."},{"name":"TOLSHSAATH","text":"I have sent for no finless ones. Perhaps you instead come seeking something of usss?"},{"name":"TOLSHSAATH","text":"Ruins which your kind have yet to explore... I sssee."},{"name":"TOLSHSAATH","text":"I know of one such place. Alas, under these circumstances, I am afraid we can spare none to guide you there."},{"name":"YSHTOLA","text":"And what circumstances are these?"},{"name":"TOLSHSAATH","text":"Rather than hunt for their own meals, the benthos have pillaged our stores of mnyiri liver. They must be replenished with haste."},{"name":"ALPHINAUD","text":"The benthos... A particularly violent tribe of Ondo, if I recall?"},{"name":"TOLSHSAATH","text":"A band of bottom-feeders. We all lost much in the Flood, but while others work to rebuild, they resort to thievery and murder."},{"name":"TOLSHSAATH","text":"Revenge, they call it, when they prey upon your kind─but do not be fooled. They care not who they harm. Would that we had the warriors to challenge them."},{"name":"TOLSHSAATH","text":"This is not the first time they have ssstolen from us, but there is no resource more precious than liver. All must dedicate themselves to the hunt."},{"name":"YSHTOLA","text":"Unless, of course, we were to reclaim the livers for you."},{"name":"YSHTOLA","text":"It seems a fitting payment for vital information, does it not?"},{"name":"YSHTOLA","text":"Moreover, one could argue that by employing Bismarck to reach these depths, thereby driving back the waters, we are in part responsible for the deeds of those driven to desperate ends by the changing climes."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"“One good turn” and all that."},{"name":"A2","text":"We certainly can't leave them like this."},{"name":"A3","text":"Could we not simply hunt mnyiri ourselves?"},{"name":"YSHTOLA","text":"I thought you might say that. You've never been one to miss an opportunity to help."},{"name":"YSHTOLA","text":"We might...but that wouldn't discourage the benthos from stealing from the Ondo again, now would it?"},{"name":"ALPHINAUD","text":"Reclaiming the stores it is, then."},{"name":"TOLSHSAATH","text":"We would be grateful beyond words if you did."},{"name":"TOLSHSAATH","text":"The benthos have surely taken the livers back to the Flounders' Floor. But be warned─there will be no shortage of guards waiting to ssspear intruders."},{"name":"YSHTOLA","text":"Then we will have care not to draw their attention. Shall we?"},{"name":"TOLSHSAATH","text":"The Flounders' Floor is to the northwest. We Ondo keep our distance. Were we not in dire straits, I would advise you to do the same..."},{"name":"ALPHINAUD","text":"N-Nervous? Me? Not at all! It's a bit dark, though, isn't it...? Definitely not haunted, though. Certainly not..."},{"name":"ALISAIE","text":"They're not much of a threat one-on-one, but Tolshs Aath was right about their numbers. If we fight them all, we'll be here a fortnight."},{"name":"YSHTOLA","text":"If I were a bandit leader, I'd surely keep my spoils deep within my stronghold..."},{"name":"THANCRED","text":"These aren't the livers, but they're certainly stolen from somewhere...unless wheat has started growing on the sea floor since last I checked."},{"name":"URIANGER","text":"Ryne scaled the wall with remarkable swiftness. Thancred taught her well."},{"name":"RYNE","text":"I haven't forgotten why we're here, I swear! Only...this bird hasn't taken its eyes off me since I found it. I think it might be lonely."},{"name":"SYSTEM","text":"The shoebill is staring at Ryne. Just. Staring."},{"name":"SYSTEM","text":"On cursory sniff, you detect the faint aroma of fresh oranges, a far cry from the rather memorable scent of mnyiri liver."},{"name":"SYSTEM","text":"Thrusting your hand into each sack in turn, you find that all are filled with wheat down to the bottom. You also find that raw wheat is unpleasantly pointy."},{"name":"SYSTEM","text":"These boxes are filled with assorted vegetables. Liver is not a vegetable."},{"name":"SYSTEM","text":"From the squelching noise they make when prodded and the vile stench, you conclude that these bags are bursting with livers. Brilliant."},{"name":"THANCRED","text":"Are those them?"},{"name":"THANCRED","text":"Perhaps you've deduced this already, but it seems the benthos have been raiding Kholusian storehouses as well as those of the Ondo."},{"name":"THANCRED","text":"Oranges, pumpkins, wheat..."},{"name":"THANCRED","text":"But we can discuss this after we see the livers safely back to Tolshs Aath. It wouldn't do to keep him in suspense."},{"name":"ALPHINAUD","text":"So the benthos have been stealing supplies from the Kholusians. Hmm..."},{"name":"ALISAIE","text":"I'm glad you had better luck than I did. I spent the whole time fighting one benthos after another."},{"name":"YSHTOLA","text":"I have a feeling that there is more to this..."},{"name":"THANCRED","text":"Did you happen to see a bird while you were in the caves? Ryne insists that there was one...but how?"},{"name":"URIANGER","text":"To venture ashore and steal from the Kholusians entaileth unconscionable risk. Yet there is no denying the truth of our eyes."},{"name":"RYNE","text":"I know it sounds strange, but there really was a bird in those caves."},{"name":"TOLSHSAATH","text":"I am relieved to see you unspeared."},{"name":"TOLSHSAATH","text":"Our precious livers! I knew you would not fail!"},{"name":"THANCRED","text":"We also found all manner of foodstuffs from Kholusia in the Flounders' Floor. Tell me, Tolshs Aath, does that seem odd to you?"},{"name":"TOLSHSAATH","text":"It is brazen, to be sure..."},{"name":"ALPHINAUD","text":"I'm reminded of rumors I've heard recently concerning a rash of thefts from Kholusian warehouses. The perpetrators enter in the dead of night and are gone before anyone has realized what has happened."},{"name":"ALPHINAUD","text":"The Eulmoran Army has been investigating, but thus far to no avail."},{"name":"ALPHINAUD","text":"Perhaps the reason they have struggled so is that their quarry is of the sea..."},{"name":"YSHTOLA","text":"The true question, then, is what we mean to do about it. Much as I would like to proceed to the ruins without further delay, we cannot allow the benthos to carry on as they are."},{"name":"TOLSHSAATH","text":"If I may─I believe that the ruins are, in fact, key to the benthos' plans."},{"name":"YSHTOLA","text":"Is that so?"},{"name":"TOLSHSAATH","text":"These ruins, which lie deep within the illuminated land, are a recent discovery."},{"name":"TOLSHSAATH","text":"We have seen signs that the benthos are preparing to claim them with all haste. We could not fathom why, but in light of the knowledge that they have been stockpiling resources..."},{"name":"TOLSHSAATH","text":"It is clear that their queen will sssoon give birth."},{"name":"TOLSHSAATH","text":"They require space to raise their young, and food for both queen and hatchlings to thrive."},{"name":"YSHTOLA","text":"Well, we can hardly fault them for that."},{"name":"TOLSHSAATH","text":"Under normal circumstances, perhapsss. But conditions in the Tempest are far from suitable for spawning, its resources barely able to sustain our current population. There is only one reason they would disregard this."},{"name":"TOLSHSAATH","text":"They seek to build an army, and with it take revenge upon the finless."},{"name":"TOLSHSAATH","text":"It is not a surprise. They came to us not long ago, seeking allies for the cause. We rebuffed them, of course─the suffering of others will not serve as balm to their own. Their queen, however, desires only bloodshed, and will gladly send her children to die in our stead."},{"name":"ALPHINAUD","text":"If they are planning to wage war, that changes matters considerably."},{"name":"YSHTOLA","text":"Indeed."},{"name":"YSHTOLA","text":"I doubt that this can be resolved without violence, but perhaps with a show of force we can convince them to see reason before the die is cast."},{"name":"YSHTOLA","text":"I would rather not risk your people in the attempt. If we travel to the illuminated land, is there a way we might identify the ruins ourselves?"},{"name":"TOLSHSAATH","text":"Yes. Once you reach its depths, go deeper still. You will see a monstrous structure there upon the sea floor."},{"name":"TOLSHSAATH","text":"That you have come to us now is the will of the ancient ones. They have guided you here that you may drive out the usurpers─those who seek to use their magnificent creations with vile purpose."},{"name":"TOLSHSAATH","text":"I have no doubt that they will show you the way forward."},{"name":"YSHTOLA","text":"I'm afraid that the dead do not speak quite so clearly. Nevertheless, we shall try not to disappoint."},{"name":"URIANGER","text":"If what we seek lieth deeper still, beyond Amaurot, I would call upon the assistance of another..."}],"reward":{"gil":1314,"items":[{"id":35724,"one":1},{"id":35725,"one":1},{"id":35726,"one":1},{"id":35727,"one":1},{"id":35728,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69302]},"next":[69304]},"partials":[{"type":"npc","id":"1032518","obj":{"i":1032518,"n":"Y'shtola","l":2957,"q":1}},{"type":"npc","id":"1027757","obj":{"i":1027757,"n":"Tolshs Aath","l":2958,"q":1}},{"type":"item","id":"35724","obj":{"i":35724,"n":"Crystarium Accessories of Fending Coffer (IL 500)","l":1,"c":26509,"t":61}},{"type":"item","id":"35725","obj":{"i":35725,"n":"Crystarium Accessories of Slaying Coffer (IL 500)","l":1,"c":26509,"t":61}},{"type":"item","id":"35726","obj":{"i":35726,"n":"Crystarium Accessories of Aiming Coffer (IL 500)","l":1,"c":26509,"t":61}},{"type":"item","id":"35727","obj":{"i":35727,"n":"Crystarium Accessories of Healing Coffer (IL 500)","l":1,"c":26509,"t":61}},{"type":"item","id":"35728","obj":{"i":35728,"n":"Crystarium Accessories of Casting Coffer (IL 500)","l":1,"c":26509,"t":61}},{"type":"quest","id":"69302","obj":{"i":69302,"n":"An Old Friend","g":9,"l":"The Rak'tika Greatwood","s":160}},{"type":"quest","id":"69304","obj":{"i":69304,"n":"A Whale's Tale","g":9,"l":"The Tempest","s":180}}]}