{"quest":{"name":"A Sleep Disturbed","location":"The Ocular","id":69301,"patch":5.2,"sort":150,"icon":100983,"eventIcon":71201,"issuer":1032121,"target":1032506,"genre":9,"journal":["With furrowed brow, the Crystal Exarch deliberates your next move.","As the Scions discuss how best to prepare for the inevitable Ascian machinations, Y'shtola states that her time would be better spent in the Rak'tika Greatwood. Almet and her sisters have discovered hitherto unexplored chambers in the Qitana Ravel that may offer new insight into the Ascians and their motives. She extends an offer to join, though her tone leaves no room for refusal. And so you depart for Fanow, where Almet is already expecting your arrival.","Almet offers you a hearty welcome and explains that the absence of sin eaters in the Greatwood has allowed the Viis to reclaim territory near Rak'tika Falls, which led to the discovery of unexplored ruins within the Qitana Ravel. Now that you have arrived, the time has come to plumb its depths in search of yet more ancient knowledge.","Your excursion into the Qitana Ravel proves uneventful. Troublingly so. That is, until Uimet unwittingly picks up an owl statue near a sealed chamber door. The chamber's guardian soon springs to life, the sight of its ferocious frame duly compensating for any lack of danger thus far. Yet for all its strength, it still proves no match for you and your comrades. With its final, shuddering breath, the seal on the chamber door is broken.","Within the innermost reaches of the ruins you discover the tomb of the archmage Tiuna, a legendary hero of Ronka. Her mastery of spellcraft was without peer, and it is said she was possessed of a gift suspiciously similar to the Echo. A curious revelation, which proves more than mere coincidence after Y'shtola examines a mural within the chamber. Its inscription suggests this ability was awakened after beholding a starshower. The mural itself depicts a scene not unlike one you witnessed at the start of your adventures many moons ago, and another more recently in Amaurot. This potential link between starshowers and the Echo has given you and Y'shtola much to think about as you return to Fanow.","Almet is pleased by your thoughtful expressions and concludes that she has done her duty. She bids you remember the teachings of her forebears, of how all stories change over time, before swearing to preserve the tale of your heroism so long as it remains in living memory."],"objectives":["Speak with Almet at Fanow in Rak'tika.","Speak with Almet."],"dialogue":[{"name":"YSHTOLA","text":"We were a hair's breadth from defeat when we faced Emet-Selch, and now we must contend with yet another Ascian. We must tread carefully."},{"name":"URIANGER","text":"We must not act until <span class=\"emphasis\">Ardbert</span> hath made plain his plans. 'Twould be folly to proclaim him false at this juncture."},{"name":"BEQLUGG","text":"What a despicable practice, appropriating corpses. Such depravity eclipses any horrors I witnessed in the age of Voeburt. They must be stopped."},{"name":"MYSTERYVOICE","text":"You did well to dispel the falsehoods surrounding the Warriors of Light and their actions prior to the Flood. Though I must say the reappearance of Ardbert─or rather, one who appropriated his identity─was a rather curious development."},{"name":"MYSTERYVOICE","text":"He is an impostor, of that there is no doubt. But to the masses he will appear as a hero returned from the grave."},{"name":"BEQLUGG","text":"After the Warriors of Light were laid to rest in Eulmore, the people prayed fervently for the gods to deliver them from their plight. Prayed that these fallen heroes be born again for their sacrifices. What bitter irony."},{"name":"YSHTOLA","text":"I for one would like to know why Ardbert urged the people to become Warriors of Light themselves."},{"name":"URIANGER","text":"Ere we take action, we must needs ascertain his intent."},{"name":"URIANGER","text":"Let us pray that Master Alphinaud returneth soon with that most essential knowledge."},{"name":"URIANGER","text":"For now, I think it best to apprise Thancred and Ryne of our efforts. When we do confront Ardbert, we shall no doubt have need of their strength."},{"name":"MYSTERYVOICE","text":"Agreed. I think it prudent we all take measures to prepare for what's to come."},{"name":"MYSTERYVOICE","text":"Beq Lugg and I will continue our research into how we might improve the spirit vessel, that it might one day carry you home."},{"name":"YSHTOLA","text":"Hmmm... Then I think it time I return to the Greatwood."},{"name":"YSHTOLA","text":"Until now, everything we have learned of the Ascians has been handed to us at their leisure."},{"name":"YSHTOLA","text":"But that was one of Emet-Selch's unique failings. I have no reason to think Elidibus will be as forthcoming."},{"name":"YSHTOLA","text":"Fortunately, I recently received word from Fanow that heretofore unexplored chambers have been discovered deep within the Qitana Ravel."},{"name":"YSHTOLA","text":"Almet believes the relics within tell of a great calamity that befell an ancient civilization─that of the Ascians, perhaps. They may lead us to the truths we seek."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Would you care for company?"},{"name":"A2","text":"Be sure to let me know how that works out."},{"name":"A3","text":"You mean the ruins of the great serpent?"},{"name":"YSHTOLA","text":"I wouldn't dream of going without you."},{"name":"YSHTOLA","text":"I fail to see why that would be necessary given that you will be accompanying me. Don't be coy─it doesn't suit you."},{"name":"YSHTOLA","text":"The great serpent? I see you've been studying your Ronkan history. But no, I've heard nothing relating to the woods' protector. Still, should it prove relevant to what lies within, your expertise would prove invaluable."},{"name":"YSHTOLA","text":"When you are ready, make for Fanow. Almet and her sisters will be expecting us."},{"name":"URIANGER","text":"Then let us be about our tasks. Pray give my regards to the Viis."},{"name":"MYSTERYVOICE","text":"Though I would like to join you in untangling the Ascian's machinations, I think it best I stay here and devote my energies to finding a way to deliver the Scions back unto the Source."},{"name":"BEQLUGG","text":"I will help the Exarch in any way I can, but the key to solving our problem lies with him and the Allagan Eye."},{"name":"YSHTOLA","text":"Let us pray these new ruins are not as unwelcoming as the last."},{"name":"UIMET","text":"You look as if you haven't seen us in an age. Is the passage of time really all that different <span class=\"alternative-container\"><span class=\"alternative\">for you Humes</span><span class=\"alternative\">for you elves</span><span class=\"alternative\">for you dwarves</span><span class=\"alternative\">for you Mystel</span><span class=\"alternative\">for you Galdjent</span><span class=\"alternative\">for you Drahn</span><span class=\"alternative\">for you Ronso</span><span class=\"alternative\">beyond the borders of the Greatwood</span></span>?"},{"name":"CYMET","text":"The allies of Ronka! My, it feels as if an age has passed since you last graced us with your presence."},{"name":"ALMET","text":"Welcome, allies of Ronka. We have accomplished much since last you came. With the Lightwarden dead and its minions dispersed, we have at last reclaimed our hunting grounds near Rak'tika Falls."},{"name":"ALMET","text":"It was there that we discovered more ruins. Although we ran afoul of no traps while exploring its halls, we determined that the innermost chambers were warded by magick."},{"name":"ALMET","text":"We all were in agreement─before any investigation could proceed, you should be summoned."},{"name":"YSHTOLA","text":"We are grateful that you did. From what you have told me, I strongly suspect that the wisdom my comrades and I seek can be found within."},{"name":"YSHTOLA","text":"This wisdom could prove invaluable, for we may soon face a foe whose greatest asset is our ignorance."},{"name":"ALMET","text":"...I see. Then it is good that you have come. For Ronka was once home to the greatest of weapons─knowledge and understanding."},{"name":"ALMET","text":"And it is our duty to ensure you and yours do not want for either."},{"name":"ALMET","text":"That said, we must proceed with caution. To have reached the inner chambers unmolested suggests a more formidable deterrent yet lies within."},{"name":"UIMET","text":"Come now. Surely any threats sleeping within the ruins pale in comparison to those we have faced thus far."},{"name":"CYMET","text":"This is not a game, Sister! You should not be so eager to run headlong into danger!"},{"name":"UIMET","text":"Oh? And who was it pining for the return of our allies that we might venture into the ruins? Clutching her staff at night, wishing it were─"},{"name":"CYMET","text":"&lt;gasp&gt; You promised not to tell!"},{"name":"UIMET","text":"Then I suggest we be going."},{"name":"CYMET","text":"Get back here!"},{"name":"YSHTOLA","text":"Remind me: exactly how old are you and your sisters? ...On second thought, perhaps it's for the better I do not know."},{"name":"ALMET","text":"Pray forgive their...overzealous nature. None save we three have been privileged to escort you and yours into the ruins and bear witness to its secrets."},{"name":"ALMET","text":"Their hearts now burn with a curiosity that is not easily satiated."},{"name":"YSHTOLA","text":"Please, you needn't apologize. As a seeker of knowledge myself, I understand full well their enthusiasm. And if not for your sedulous efforts to protect the ruins, we would not be afforded this opportunity."},{"name":"ALMET","text":"Speaking of which, I believe I have kept you away from the ruins long enough. Come, let us make for the Qitana Ravel."},{"name":"YSHTOLA","text":"Even Emet-Selch was taken aback to find a mural illustrating the Final Days in these ruins. What other surprises do you suppose yet lie within?"},{"name":"UIMET","text":"Ready when you are!"},{"name":"CYMET","text":"I feel oddly ill-equipped to venture inside, but with you here, I'm sure things will work out."},{"name":"ALMET","text":"It is most strange for these halls to be left unguarded. Have care when breaking the seal on the chamber door. Danger surely awaits us on the other side."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"YSHTOLA","text":"We learned nothing of the Ascians, but the potential link between the Echo and preternatural starshowers is intriguing."},{"name":"UIMET","text":"I sorely underestimated the defenses of these ruins. Perhaps Cymet was right to urge caution."},{"name":"CYMET","text":"Tiuna is the reason I took up spellcraft, you know. &lt;sigh&gt; Never in my wildest dreams did I imagine her tomb would be found, let alone that we would be the ones to have the honor to do so."},{"name":"ALMET","text":"By your pensive expression, I take it the tomb has given you much to think about. That is well. In time, the knowledge you have gleaned will lead to understanding, and thus arm you for what is to come."},{"name":"ALMET","text":"Before you leave, however, I would speak again of the teachings of our forebears. Of histories learned, not lived."},{"name":"ALMET","text":"The legend of Tiuna and her exploits has been told countless times over the centuries. Yet as it is handed from one generation to the next, the story changes."},{"name":"ALMET","text":"With each telling of the tale there are new flourishes─details changed or lost. We can never truly know how she lived, for we were not there to see it."},{"name":"ALMET","text":"But we are here now to bear witness to <span class=\"emphasis\">your</span> life. We have seen the change you have wrought, the echoes that will endure long after you are gone. And though it too will change in time, I swear to you, we shall do our best to preserve your story."},{"name":"UIMET","text":"I hope you'll forgive me if I don't make an oath of my own, but I think it goes without saying we could never misspeak of your heroism."},{"name":"CYMET","text":"Perish the thought! So long as we are here, there are none among the Viis who will not know of all you have done for Norvrandt."},{"name":"YSHTOLA","text":"We are not deserving of such reverence, but we are grateful all the same. You can be certain we will have our own tales to tell of the great guardians of Rak'tika and the ruins of Ronka."},{"name":"ALMET","text":"I pray you safe travels, then. As ever, we shall await your return with open arms."}],"reward":{"gil":2760},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69300]},"next":[69302]},"partials":[{"type":"npc","id":"1032121","obj":{"i":1032121,"n":"Crystal Exarch","l":3223,"q":4}},{"type":"npc","id":"1032506","obj":{"i":1032506,"n":"Almet","l":2957,"q":1}},{"type":"quest","id":"69300","obj":{"i":69300,"n":"Facing the Truth","g":9,"l":"Lakeland","s":140}},{"type":"quest","id":"69302","obj":{"i":69302,"n":"An Old Friend","g":9,"l":"The Rak'tika Greatwood","s":160}}]}