{"quest":{"name":"An Old Friend","location":"The Rak'tika Greatwood","id":69302,"patch":5.2,"sort":160,"eventIcon":71201,"issuer":1029234,"target":1032515,"genre":9,"journal":["By all rights you should be departing for the Crystarium, but Y'shtola does not seem ready to return."],"objectives":["Speak with Runar in Slitherbough.","Speak with Asgeir and obtain a well-worn broom.","Take the well-worn broom to Y'shtola.","Speak with Thancred."],"dialogue":[{"name":"ALMET","text":"So long as we Viis live, we shall preserve the truth of your deeds."},{"name":"UIMET","text":"In the short time we've known you, it feels as though we've experienced a lifetime of adventures. Adventures we are not like to forget."},{"name":"CYMET","text":"Perhaps we should create a new mural in your honor, and as a record for future generations. What do you think?"},{"name":"YSHTOLA","text":"Although we learned naught of the Ascians, the insight we gained into the Echo made our trip worthwhile."},{"name":"YSHTOLA","text":"Before we return to the Crystarium, however, there is a small matter I would attend to in Slitherbough. Might I trouble you to come with me?"},{"name":"YSHTOLA","text":"Thank you. After we arrive, we should have a brief word with Runar."},{"name":"YSHTOLA","text":"Runar appears to be in characteristically high spirits."},{"name":"RUNAR","text":"<span class=\"highlight\">Forename</span>! It is so good to see you!"},{"name":"RUNAR","text":"You've arrived at a most opportune time. I was preparing a pot of my famous stew. Come, I will ready a place for you."},{"name":"YSHTOLA","text":"I'm sorry, Runar, but we haven't the─"},{"name":"RUNAR","text":"Please, I insist! It will take only a minute."},{"name":"YSHTOLA","text":"&lt;sigh&gt; My apologies, <span class=\"highlight\">Forename</span>. It seems our return to the Crystarium will be delayed."},{"name":"YSHTOLA","text":"But perhaps only for a bit─if you assist me with my work."},{"name":"YSHTOLA","text":"I say “work,” but it is rather more a chore. I must clean my chambers here in Slitherbough from top to bottom. If you would be so kind as to go and fetch a broom from Asgeir, we might finish before Runar is done cooking."},{"name":"YSHTOLA","text":"I require a broom if I'm to make any meaningful progress here. I'm sure you can find one if you speak with Asgeir."},{"name":"ASGEIR","text":"A broom for...Master Matoya...?"},{"name":"ASGEIR","text":"I cannot imagine why she would have need of such a thing, but here you are. It is old but sturdy and sure to suffice."},{"name":"ASGEIR","text":"You don't suppose she might be cleaning, do you? ...Should we be concerned?"},{"name":"YSHTOLA","text":"I trust Asgeir was able to find a broom for us?"},{"name":"YSHTOLA","text":"Well worn. Good. This would prove difficult otherwise."},{"name":"YSHTOLA","text":"Though I must say, I think I did rather well for not having a broom thus far."},{"name":"YSHTOLA","text":"...Yes, well, you weren't buried beneath a veritable avalanche of books when you entered, were you? Right. Anyway, it is time I finished cleaning with the help of that broom."},{"name":"YSHTOLA","text":"You didn't honestly think I'd do it the old-fashioned way? That broom is more than capable of sweeping by itself. Or rather, it will be... Ahem."},{"name":"YSHTOLA","text":"Time to rise, to swish and sweep,<br>A tidy chamber you must keep.<br>To this task you shall be bound,<br>Until no dust is to be found."},{"name":"YSHTOLA","text":"In this one particular respect, I've no objections to following in Master Matoya's footsteps."},{"name":"YSHTOLA","text":"(-Y'shtola-)In future, I may need you to remind me the pursuit of knowledge does not preclude other equally important duties... Such as maintaining clean quarters for said pursuit."},{"name":"YSHTOLA","text":"(-Y'shtola-)&lt;sigh&gt; I will dearly miss this place. These people..."},{"name":"RUNAR","text":"(-Runar-)M-Master Matoya! Pardon the interruption, but the stew is ready."},{"name":"YSHTOLA","text":"Is something troubling you? You've been rather quiet."},{"name":"RUNAR","text":"N-No! Everything is fine, I assure you. It has been a long day, is all."},{"name":"YSHTOLA","text":"I see..."},{"name":"ALPHINAUD","text":"(-???-)Y'shtola! Thank goodness you're still here."},{"name":"YSHTOLA","text":"Alphinaud? I thought you were following Ardbert."},{"name":"ALPHINAUD","text":"I was, though I'm sad to say I lost track of him shortly after entering these woods."},{"name":"ALPHINAUD","text":"He seems determined to traverse every ilm of Norvrandt in his quest to spread the truth of the Warriors of Light and the Flood."},{"name":"ALPHINAUD","text":"And it seems news of your address at the Crystarium precedes him at every destination, making his task all the more simple."},{"name":"ALPHINAUD","text":"It remains to be seen to what end he encourages the people to become Warriors of Light themselves..."},{"name":"ALPHINAUD","text":"...But there is no denying that his words have struck a chord with many."},{"name":"ALISAIE","text":"Well, we're all agreed that this is just another Ascian ploy, yes?"},{"name":"ALISAIE","text":"They've commandeered corpses before, and to no good end. I see no reason to think this time is any different─especially when it's that of a fallen Warrior of Light."},{"name":"ALPHINAUD","text":"I doubt we'll learn more if we remain a step behind."},{"name":"URIANGER","text":"His next destination is, in all likelihood, Slitherbough..."},{"name":"YSHTOLA","text":"Alisaie, are you certain you should be here?"},{"name":"ALISAIE","text":"If you're concerned about Halric and the others, you needn't be. Their treatment is going well, but progress is slow and exhausting─for all of us. The best thing I can do now is let them rest. So─I believe we were about to discuss how to arrange a meeting with our would-be Warrior of Light?"},{"name":"ALPHINAUD","text":"Before visiting any towns or villages, Ardbert would hunt down and slay a nearby sin eater to earn the locals' trust."},{"name":"ALPHINAUD","text":"Our best chance of getting ahead of him is to find one before he does."},{"name":"URIANGER","text":"Thankfully, Thancred and Ryne are returned from the Empty and have taken up the search."},{"name":"URIANGER","text":"Ryne believeth one may lurk beneath the boughs of Woven Oath."},{"name":"ALPHINAUD","text":"Then that is where we will start our search."},{"name":"RUNAR","text":"Master Matoya!"},{"name":"RUNAR","text":"I...er... A warm bowl of stew will be awaiting your return."},{"name":"YSHTOLA","text":"I look forward to it."},{"name":"RUNAR","text":"Please, <span class=\"highlight\">Forename</span>, I beg of you... Keep her safe..."},{"name":"RYNE","text":"I can sense no other sin eaters in the area. I hope this means Ardbert will be coming this way soon."}],"reward":{"gil":1155,"items":[{"num":2,"id":27892,"one":1},{"num":2,"id":27888,"one":1},{"num":2,"id":27889,"one":1},{"num":2,"id":27890,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69301]},"next":[69303]},"partials":[{"type":"npc","id":"1029234","obj":{"i":1029234,"n":"Y'shtola","l":2957,"q":1}},{"type":"npc","id":"1032515","obj":{"i":1032515,"n":"Thancred","l":2957,"q":1}},{"type":"item","id":"27892","obj":{"i":27892,"n":"Exquisite Beef Stew","l":450,"c":24110,"t":46}},{"type":"item","id":"27888","obj":{"i":27888,"n":"Pixieberry Cheesecake","l":450,"c":24070,"t":46}},{"type":"item","id":"27889","obj":{"i":27889,"n":"Kukuru Rusk","l":450,"c":24090,"t":46}},{"type":"item","id":"27890","obj":{"i":27890,"n":"Lemon Curd Sachertorte","l":450,"c":24071,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69301","obj":{"i":69301,"n":"A Sleep Disturbed","g":9,"l":"The Ocular","s":150}},{"type":"quest","id":"69303","obj":{"i":69303,"n":"Deep Designs","g":9,"l":"The Rak'tika Greatwood","s":170}}]}