{"quest":{"name":"A Whale's Tale","location":"The Tempest","id":69304,"patch":5.2,"sort":180,"eventIcon":71201,"issuer":1032526,"target":1032554,"genre":9,"journal":["Urianger has a mind to call on an old, old friend."],"objectives":["Speak to Urianger in Sullen.","Speak with Urianger.","Remove tenacious barnacles.","Speak with Urianger.","Speak with Thancred."],"dialogue":[{"name":"ALPHINAUD","text":"It doesn't feel all that honorable or heroic to strike first, but if it leads to less bloodshed in the end..."},{"name":"ALISAIE","text":"Why do these problems always turn out to be so much more complex than they seem? Couldn't we have a simple, straightforward adventure for once? The good guys good, the bad guys bad, no drama or intrigue, and it all ends with tea and tarts!"},{"name":"YSHTOLA","text":"The will of the ancients... If only it were so simple."},{"name":"THANCRED","text":"I would not care for what happened in Limsa to be repeated a world away. The benthos know not what they do..."},{"name":"RYNE","text":"Is it wrong of me to be a bit excited? I know the circumstances are grave, but imagine what those ruins might hold!"},{"name":"TOLSHSAATH","text":"（★未使用／削除予定★）"},{"name":"URIANGER","text":"Though our course hath been decided, to pursue it we must needs beseech the aid of a friend."},{"name":"URIANGER","text":"Aye, I speak of Bismarck. Pray follow me to Sullen that we might seek an audience with him once more."},{"name":"URIANGER","text":"From here, we press onward to the Isle of Ken. I myself shall proceed on foot."},{"name":"ALPHINAUD","text":"You've perfected your technique, then?"},{"name":"URIANGER","text":"Just so─the water will be as glass beneath my feet, and provideth purchase fragile yet true. Watch closely."},{"name":"YSHTOLA","text":"Oh, I certainly shall."},{"name":"ALISAIE","text":"Forgive me, but would it not be easier to perfect your <span class=\"emphasis\">swimming</span> technique?"},{"name":"THANCRED","text":"Aye, 'twould be a pity if you drowned. Truly."},{"name":"RYNE","text":"Oh, hush. I'm sure it'll be brilliant!"},{"name":"ALPHINAUD","text":"He's done it!"},{"name":"RYNE","text":"Incredible!"},{"name":"RYNE","text":"Urianger!"},{"name":"THANCRED","text":"For the love of─"},{"name":"URIANGER","text":"M-Mine apologies. The technique requireth the purest of focus, and mine...'twas lacking."},{"name":"URIANGER","text":"To perfect this magick I went so far as to deal with the Fuath, and with their aid mine efforts finally met with success...albeit on a single occasion."},{"name":"URIANGER","text":"I know not why I cannot repeat it."},{"name":"THANCRED","text":"I thought I saw you waver a bit toward the end there. Perhaps you're simply...tired...?"},{"name":"RYNE","text":"Thancred!?"},{"name":"THANCRED","text":"It's nothing to worry about─only a dizzy spell. Though it may not be wise to go for another swim just now..."},{"name":"YSHTOLA","text":"Thankfully, we have an alternative. A wonderful little invention, I'm certain you'll agree."},{"name":"ALPHINAUD","text":"I must admit I'd been keen to attempt walking on water myself. Though I know what Alisaie would say..."},{"name":"ALISAIE","text":"I'll stick to swimming, thank you very much."},{"name":"YSHTOLA","text":"What sort of dealings with the Fuath, I wonder..."},{"name":"YSHTOLA","text":"（★未使用／削除予定★）"},{"name":"THANCRED","text":"Before you make some quip about age catching up with me─you'd be out of breath too, if you had to drag Urianger out of the sea without so much as a warm-up."},{"name":"RYNE","text":"Do you think those two are really all right? Perhaps we should take a moment to rest."},{"name":"URIANGER","text":"I will petition Bismarck's aid on our behalf. Let us pray my diplomacy proveth more effective than mine experimental magicks..."},{"name":"BISMARCK","text":"(-Bismarck-)[You speak with the voice of the king, little neighbors. I will not deny you.]"},{"name":"BISMARCK","text":"(-Bismarck-)[As before, if you seek what sleeps beneath the sea, I will be your guide.]"},{"name":"URIANGER","text":"[Thy kindness is as boundless as the depths, serene one.]"},{"name":"BISMARCK","text":"(-Bismarck-)[Before we depart, however, I would ask a favor.]"},{"name":"BISMARCK","text":"(-Bismarck-)[After our last flight, I found many creatures clinging to me. I am...itchy.]"},{"name":"BISMARCK","text":"(-Bismarck-)[Remove them, and I will take you below.]"},{"name":"URIANGER","text":"[With all haste shall it be done.]"},{"name":"ALISAIE","text":"So? Did he agree?"},{"name":"URIANGER","text":"Aye, though I agreed to a favor in kind..."},{"name":"URIANGER","text":"Regrettably, 'tis not one I possess the power to grant. Bismarck hath asked us to cleanse his underbelly of barnacles."},{"name":"URIANGER","text":"Alas, one must needs dive beneath the surface to do so. Even if I could master the power to walk upon it, it would avail me naught."},{"name":"ALISAIE","text":"Oh, for heavens' sake, is that all!? <span class=\"highlight\">Forename</span> and I are more than capable of that."},{"name":"ALISAIE","text":"With the Kojin's blessing, we'll have done with it in moments─and better that than standing here and listening to this nonsense! I'll take the right, you the left. Now go!"},{"name":"URIANGER","text":"...I am in your debt."},{"name":"ALPHINAUD","text":"None of us is much of a match for Alisaie when she's like this. Aside from Y'shtola, perhaps."},{"name":"ALISAIE","text":"I can handle this area."},{"name":"YSHTOLA","text":"It's a minor miracle that we accomplish anything at all, wouldn't you say?"},{"name":"URIANGER","text":"Mine apologies. This venture hath not proceeded as smoothly as I had hoped..."},{"name":"THANCRED","text":"Yes, I'm perfectly well recovered, <span class=\"emphasis\">thank you.</span>"},{"name":"RYNE","text":"(Psst! I think Thancred's embarrassed.)"},{"name":"SYSTEM","text":"After a good deal of prying from various angles, you dislodge the barnacle."},{"name":"ALPHINAUD","text":"The power to breathe underwater seems most convenient. Mayhap the Kojin might be persuaded to grant me it when we return to the Source─I can swim, after all."},{"name":"ALISAIE","text":"Well, that was disgusting. I pray we'll not be required to attend to any other matters of personal hygiene."},{"name":"YSHTOLA","text":"I take it you've finished?"},{"name":"THANCRED","text":"Apologies for sitting this one out, but it did seem more appropriate for those of you with the Kojin's blessing to handle it."},{"name":"RYNE","text":"Would you please keep an eye on Thancred and Urianger? I'm still not convinced they're all right..."},{"name":"URIANGER","text":"Thine efforts are most sincerely appreciated. I will inform Bismarck that we may depart without further delay."},{"name":"BISMARCK","text":"(-Bismarck-)[Much, much better. Thank you, little neighbors.]"},{"name":"BISMARCK","text":"(-Bismarck-)[I remember...a long time ago, another did this favor for me.]"},{"name":"BISMARCK","text":"(-Bismarck-)[After the Flood, when I chose this spot for my slumber... He came and made a home on my back. Ken was his name.]"},{"name":"BISMARCK","text":"(-Bismarck-)[When I grew itchy, I stirred. But he was not afraid. No─he asked me what was wrong.]"},{"name":"BISMARCK","text":"(-Bismarck-)[I told him of the creatures clinging to my belly, and he dove into the water. He helped me. He was my friend.]"},{"name":"BISMARCK","text":"(-Bismarck-)[He told me he wished to live in peace, away from his people and their wars. This, I understood.]"},{"name":"BISMARCK","text":"(-Bismarck-)[I treasured our time together, brief though it was. Brief though it always is. But I remember him, and how he laughed when we flew...]"},{"name":"BISMARCK","text":"(-Bismarck-)[...I remember when he slept. I too slept that day, and many days since.]"},{"name":"BISMARCK","text":"(-Bismarck-)[But the light fades and the darkness returns. Ken sleeps, but in memory he laughs, and together we fly. And I am here. I am awake.]"},{"name":"BISMARCK","text":"(-Bismarck-)[Mmm... It feels good to speak and to be heard again. A shame others cannot understand me.]"},{"name":"URIANGER","text":"[If thou art willing to learn, I would gladly teach thee the language of man.]"},{"name":"BISMARCK","text":"(-Bismarck-)[Thank you, little friend. But it is time I grant you your request.]"},{"name":"BISMARCK","text":"(-Bismarck-)[But first, I will take flight to cleanse my body and prepare. The dive will be swift, and I would not have you struck by errant debris.]"},{"name":"THANCRED","text":"So this “island” was named for a man. How easily the past is forgotten."},{"name":"YSHTOLA","text":"He passed not even one hundred years ago, yet the truth has slipped from history. Like so many grains of sand..."},{"name":"ALISAIE","text":"...Might I have some explanation of what he just said, or shall we all stand about making vague and mysterious allusions?"},{"name":"URIANGER","text":"While he maketh ready to deliver us unto our destination, Bismarck bade us wait for him on the shore of Kholusia."},{"name":"ALISAIE","text":"That's all...? I feel as though there was more to it."},{"name":"URIANGER","text":"Indeed, there was...but it hath no bearing on the task at hand. I should be glad to share the rest with you anon."},{"name":"ALISAIE","text":"Fine. Later, then."},{"name":"YSHTOLA","text":"If Bismarck requires time to prepare, might I suggest a short respite? For Urianger and Thancred, in particular."},{"name":"THANCRED","text":"I require no such thing. I am the picture of perfect health."},{"name":"URIANGER","text":"Mine was but a momentary lapse in concentration. Worry not on my account."},{"name":"RYNE","text":"You mustn't push yourselves so! Please, rest! For me?"},{"name":"THANCRED","text":"Oh, all right. If you insist."},{"name":"RYNE","text":"You too, <span class=\"highlight\">Forename</span>! You've been running yourself ragged!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Yes, ma'am."},{"name":"A2","text":"But I feel fine..."},{"name":"THANCRED","text":"Just go quietly, <span class=\"highlight\">Forename</span>. Trust me."},{"name":"YSHTOLA","text":"In that case, I leave the old men in your care. The rest of us will meet you at the Split Hull anon."},{"name":"THANCRED","text":"&lt;sigh&gt; Word of advice─never let it show. When she realizes she's struck a nerve, she remembers. By the gods, she remembers..."},{"name":"THANCRED","text":"In any case, if we must be made to rest, I know a place in Sullen that's better for it than most. Come with me."},{"name":"URIANGER","text":"With age cometh wisdom─or so I pray."},{"name":"THANCRED","text":"May as well have a seat. We wouldn't want our elderly knees to give out."},{"name":"THANCRED","text":"To hear her speak you'd think I'm on my deathbed. By the Twelve, I wish that girl wouldn't worry so much."},{"name":"URIANGER","text":"Thy countenance belies thy words, Master Thancred."},{"name":"THANCRED","text":"I'm sure I don't know what you mean. Let the record show that I am here under protest."},{"name":"THANCRED","text":"...Though I can't say I mind the view."},{"name":"THANCRED","text":"And if the abundance of anglers is any indication, even an amateur might land an impressive catch. Shall we try our hands at it?"},{"name":"PANICKEDFISHER","text":"Help! Someone...&lt;pant&gt;...quickly!"},{"name":"PANICKEDFISHER","text":"It's Nightshade! We was attacked on the road from the Crystarium─barely escaped with me life!"},{"name":"THANCRED","text":"I suppose we might have predicted this."},{"name":"PANICKEDFISHER","text":"Y-You mean you'll help? For free? Th-Thank you!"},{"name":"URIANGER","text":"If I recall correctly, “Nightshade” is a local band of outlaws."},{"name":"THANCRED","text":"I doubt they'll trouble us overmuch. No more than they already have by interrupting our relaxation, at any rate."},{"name":"FISHERA03768","text":"We was ambushed. I ran, but my friend...he weren't fast enough."},{"name":"FISHERB03768","text":"Can you believe this? I don't even have anything worth stealing!"},{"name":"URIANGER","text":"All save our miscreant appear unharmed."},{"name":"SOLDIER03608","text":"Fortunately, this one wasn't clever enough to bring support."},{"name":"BRAVESOLDIER","text":"Never fear! Nightshade ain't no match for the guard."},{"name":"THANCRED","text":"These two have matters well in hand, by the looks of it."},{"name":"FISHERB03768","text":"I'll not forget this kindness. May we meet again!"},{"name":"SOLDIER03608","text":"Is that you, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">sir</span></span>? Don't tell me we just deprived that poor fellow the honor of being rescued by the Warrior of Darkness! We had no idea you were in the area. Fancy us meeting again so soon, eh? Why, I believe I even recognize your companion."},{"name":"THANCRED","text":"...Ah yes! From the infirmary. You had a message for the Crystal Exarch, did you not? It's good to see you back on your feet─and on patrol, no less!"},{"name":"SOLDIER03608","text":"Oh, it's nothing as official as all that! Strictly speaking, we're off duty. But as we had a free moment, we thought we'd give a few of the less-traveled roads a look. The guard doesn't have enough hands to patrol them regularly, you see."},{"name":"THANCRED","text":"That's admirable. There are few so devoted to their duty─in Lakeland or beyond."},{"name":"SOLDIER03608","text":"Well, we've been talking about it for a while, and neither of us is satisfied with just seeing out our service. It feels like we could be doing more─like we <span class=\"emphasis\">should</span> be doing more."},{"name":"BRAVESOLDIER","text":"(-Gallant Guardsman-)It's all about having the will to help your fellow man, and the resolve to see it through!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I remember you. The excitable one."},{"name":"A2","text":"Very good, mister...uh...?"},{"name":"BRAVESOLDIER","text":"Sorry, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">sir</span></span>! I got a bit overexcited the other day─couldn't get my words out."},{"name":"BRAVESOLDIER","text":"(-Vonard-)The name's Vonard, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">sir</span></span>. I'm with the guard, but I don't just want to protect Lakeland─I want to protect the <span class=\"emphasis\">lot</span>. Just like the Warriors of Light."},{"name":"SOLDIER03608","text":"Sadly, our duties prevent us from venturing too far from our own little corner of Norvrandt."},{"name":"SOLDIER03608","text":"What we'd <span class=\"emphasis\">really</span> like to do is travel─to better ourselves, and go where the need is greatest..."},{"name":"SOLDIER03608","text":"But everyone has to start somewhere, don't they? For now, if we can stop Nightshade from robbing the odd fisherman, then that's what we'll do."},{"name":"THANCRED","text":"Well, well... Future heroes of the First, do you think?"},{"name":"URIANGER","text":"They want not for spirit. 'Tis but a pity they draw inspiration from so clouded a wellspring..."},{"name":"URIANGER","text":"Yet it availeth us naught to fret in idleness. We must needs press on if we are to bring Elidibus's schemes to light."}],"reward":{"items":[{"id":26728,"one":1},{"id":26729,"one":1},{"id":26730,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69303]},"next":[69305]},"partials":[{"type":"npc","id":"1032526","obj":{"i":1032526,"n":"Urianger","l":2958,"q":1}},{"type":"npc","id":"1032554","obj":{"i":1032554,"n":"Thancred","l":2953,"q":1}},{"type":"item","id":"26728","obj":{"i":26728,"n":"Heavens' Eye Materia VIII","l":420,"c":20279,"t":58,"materia":{"tier":7,"value":24,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"26729","obj":{"i":26729,"n":"Savage Aim Materia VIII","l":420,"c":20279,"t":58,"materia":{"tier":7,"value":24,"attr":"Critical Hit","category":0}}},{"type":"item","id":"26730","obj":{"i":26730,"n":"Savage Might Materia VIII","l":420,"c":20279,"t":58,"materia":{"tier":7,"value":24,"attr":"Determination","category":0}}},{"type":"quest","id":"69303","obj":{"i":69303,"n":"Deep Designs","g":9,"l":"The Rak'tika Greatwood","s":170}},{"type":"quest","id":"69305","obj":{"i":69305,"n":"Beneath the Surface","g":9,"l":"Lakeland","s":190}}]}