{"quest":{"name":"Beneath the Surface","location":"Lakeland","id":69305,"patch":5.2,"sort":190,"icon":112378,"eventIcon":71201,"issuer":1032555,"target":1032549,"genre":9,"journal":["Thus reminded of the urgency of your investigation, Urianger would press on.","Urianger suggests that you cut short your rest that the investigation into the undersea ruins might commence without further delay. This proposal meets with no resistance from Thancred or yourself, so the three of you depart forthwith for the Split Hull, where the remainder of your party awaits.","You join your companions at the Split Hull, and it is thankfully only a short while before your ancient guide appears overhead. All that remains now is to leap from the cliffs to Bismarck's back, and allow him to take you deep into the illuminated land, where secrets of the past yet slumber.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","Fighting your way past a horde of hostile benthos, you cannot help but notice the astonishing number of forms stored within Anamnesis Anyder. Perhaps still more secrets of the ancients lie within the central chamber of Noesis─and with Rukshs Dheem vanquished, they are yours for the taking.","As you explore Noesis with your fellow Scions, an odd device activates of its own accord, conjuring the lifelike echoes of several ancient beings. This marvelous record of long-forgotten affairs shows them deep in conversation regarding the summoning of Hydaelyn, of all things, which was apparently spearheaded by a personage named “Venat.” Further prodding causes the device to divulge a single additional memory that reveals this Venat became Hydaelyn's heart─and Elidibus, Zodiark's.","An astonished Y'shtola attempts to reactivate the device that you might view further records, but unfortunately meets with no success. For want of further revelations, you are left confounded as to the true identity of Elidibus, who by rights should have long since ceased to be. The group trusts to Y'shtola to remain in Anamnesis Anyder and coax out more from the facility, while the rest of you return to keeping an eye on the wider world─or worlds, in your case."],"objectives":["Speak with Urianger at the Split Hull.","Enter Anamnesis Anyder.","Speak with Y'shtola."],"dialogue":[{"name":"THANCRED","text":"It pains me to think that men with such pure intent are being made to serve Ascian ends, however directly. But they're right. The people need heroes."},{"name":"URIANGER","text":"Though our respite was cut short, I daresay we are all eager to avail ourselves of such knowledge as the ruins may hold."},{"name":"THANCRED","text":"Aye, and I doubt further contemplation of Elidibus's machinations will be conducive to relaxation. We may as well make for the Split Hull now."},{"name":"ALPHINAUD","text":"So, how much of a respite did you actually enjoy? Half a moment's?"},{"name":"ALISAIE","text":"What's keeping Bismarck? Surely it doesn't take this long to shake off a few loose stones."},{"name":"YSHTOLA","text":"Perhaps we ought to have clarified what Bismarck meant by “a short while.” To his mind, our whole lives might be as the blink of an eye..."},{"name":"THANCRED","text":"We rested! Didn't we, <span class=\"highlight\">Forename</span>?"},{"name":"RYNE","text":"You arrived rather early. Are you certain you did as you were told?"},{"name":"URIANGER","text":"All are present. Now we need but await Bismarck's coming."},{"name":"URIANGER","text":"'Tis time. Pray make ready."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Small talk."},{"name":"A1","text":"Form a party and enter Anamnesis Anyder."},{"name":"A1","text":"Nothing."},{"name":"ALPHINAUD","text":"Whether or not we find the knowledge we seek, we have a duty to stem the benthos' aggression. Eulmore has only just begun to rebuild."},{"name":"ALISAIE","text":"What are we waiting for?"},{"name":"YSHTOLA","text":"We must hope that whatever slumbers in the depths will help to shed some light upon Elidibus's recent activities."},{"name":"THANCRED","text":"We can't be certain that the benthos are all we'll find down there. Stay alert."},{"name":"RYNE","text":"I like to think my skills have improved in some small way since the last time we fought together. I won't let you down."},{"name":"URIANGER","text":"Unlike Amaurot, the ruins which we now seek are no illusion. There is no knowing what awaiteth below."},{"name":"ALPHINAUD","text":"I had always assumed Elidibus to be of the same ilk as Lahabrea and Emet-Selch. But if the real Elidibus sacrificed himself before the sundering..."},{"name":"ALISAIE","text":"It makes no sense..."},{"name":"THANCRED","text":"And there I was thinking “immortal” was bad. Would someone explain to me how we're meant to kill a being who doesn't technically exist?"},{"name":"RYNE","text":"Do you think we might be able to activate the device again? I should like to hear how those discussions ended."},{"name":"URIANGER","text":"That this facility shared intimate ties with the Akadaemia Anyder may readily be discerned from the common element in their names. Based on mine observations, 'tis like that the forms housed here were conveyed unto the Akadaemia only when required, and thence returned for safekeeping."},{"name":"URIANGER","text":"Yet...such procedural minutiae are of largely academic interest, I concede. 'Tis unto the parties which did frequent these institutions that our thoughts should rightly turn. Specifically, the followers of Venat, and the Convocation of Fourteen..."},{"name":"URIANGER","text":"...To say naught of the matter of Elidibus."},{"name":"Q1","text":"（★未使用／削除予定★）"},{"name":"Q2","text":"Enter Noesis?"},{"name":"YSHTOLA","text":"The device appears to activate via a form of aetherial attunement, not unlike an aetheryte. Beyond that, I can say little for certain, save that we should take this opportunity to see what other records it contains."},{"name":"YSHTOLA","text":"No response. Confound it."},{"name":"URIANGER","text":"If I may, milady─the panel did formerly emit a soft-yet-perceptible glow. That it doth so no longer may betoken the depletion of some essential energy within."},{"name":"ALPHINAUD","text":"Given how long it has lain dormant, I think it fortunate it functioned at all."},{"name":"ALISAIE","text":"That may be, but if we can't get it to work again, we'll be leaving with more questions than we've answered."},{"name":"URIANGER","text":"The white-robed emissary hath ever named himself “Elidibus.” Yet if the shade spoke true, Elidibus ceased to be ere even the sundering came to pass."},{"name":"URIANGER","text":"This calleth to mind a truth that Emet-Selch did once reveal in passing─that the names by which we know our foes are not those given to Ascians at birth. Rather, they are titles of office, afforded to individuals of merit at such time as the role becometh vacant."},{"name":"URIANGER","text":"Perchance the Elidibus at Zodiark's heart and the emissary with whom we are acquainted be not one and the same, but predecessor and successor."},{"name":"URIANGER","text":"（★未使用／削除予定★）"},{"name":"YSHTOLA","text":"It's possible. If the previous Elidibus perished before the Final Days, the one we know could still be a survivor of the sundering."},{"name":"YSHTOLA","text":"And yet...something in that explanation rings false."},{"name":"YSHTOLA","text":"I will remain for a time. I would not abandon my attempts to revive the device so soon. There is more to learn here─I can feel it."},{"name":"URIANGER","text":"In matters of aetherology, I know of none as capable as thee. If there existeth a means to learn more, thou wilt surely find it."},{"name":"URIANGER","text":"Whilst thou art thus engaged, we shall attend to matters on the surface."},{"name":"SYSTEM","text":"You may now enter Anamnesis Anyder with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."}],"reward":{"gil":4000,"instance":74},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69304]},"next":[69306]},"partials":[{"type":"npc","id":"1032555","obj":{"i":1032555,"n":"Urianger","l":2953,"q":1}},{"type":"npc","id":"1032549","obj":{"i":1032549,"n":"Y'shtola","l":3467,"q":1}},{"type":"instance","id":"74","obj":{"i":74,"n":"Anamnesis Anyder","c":61801,"t":"Dungeons","min_lvl":80,"max_lvl":80,"min_ilvl":440,"max_ilvl":500}},{"type":"quest","id":"69304","obj":{"i":69304,"n":"A Whale's Tale","g":9,"l":"The Tempest","s":180}},{"type":"quest","id":"69306","obj":{"i":69306,"n":"Echoes of a Fallen Star","g":9,"l":"Kholusia","s":200}}]}