{"quest":{"name":"Heroic Dreams","location":"The Crystarium","id":69308,"patch":5.3,"sort":220,"eventIcon":71201,"issuer":1033800,"target":1033811,"genre":9,"journal":["Eirwel regards you expectantly."],"objectives":["Speak with Alisaie at the Exarch Gate.","Use heat lures to draw out vampire bats and slay them for their fangs.","Deliver bat fangs to Ryne.","Go to the lookout in the Crystarium.","Speak with the Crystal Exarch."],"dialogue":[{"name":"ALPHINAUD","text":"Riqi-Tio has duly delivered her grapes, as have I."},{"name":"ALISAIE","text":"After chatting with Arkil and Eirwel here, we came to an agreement─but I'll let them explain their request themselves."},{"name":"RYNE","text":"Riqi-Tio was beaming with pride when she returned."},{"name":"RYNE","text":"It may only have been a simple task, but she won't soon forget this achievement."},{"name":"RIQITIO","text":"Thanks for helping with the grapes, Warrior of Darkness. In return, I promise to brew you a potion one day!"},{"name":"ARKIL","text":"Riqi didn't make you drink one of her grass potions, did she?"},{"name":"EIRWEL","text":"Warrior of Darkness! If you've finished helping Riqi, won't you show us some fighting? Not play fighting, but honest-to-gods fighting?"},{"name":"EIRWEL","text":"We already have some enemies that you can deal with: vampire bats! The guards say they've become a pest around the Crystarium of late."},{"name":"EIRWEL","text":"We tried to sneak outside to hunt them, but the guards caught us and sent us home... But they shouldn't mind if you were doing the fighting and we were just watching!"},{"name":"ALISAIE","text":"The children told us as much while you were away. And in preparation, Chessamile kindly furnished us with some lures for the bats."},{"name":"ALISAIE","text":"While the creatures won't give you any sport, bear in mind that the younglings will be watching. That's to say: put on a good show, yes?"},{"name":"ALISAIE","text":"Right, let's head outside at once. Everyone, follow me!"},{"name":"RYNE","text":"A-Alisaie, wait just a─ &lt;sigh&gt; Come on, then, children."},{"name":"ALPHINAUD","text":"I shall remain here with Riqi-Tio. The other children, I leave in your care─my unruly sister included."},{"name":"RIQITIO","text":"What? Everyone's going outside to see you fight? &lt;whimper&gt; I want to watch too..."},{"name":"RIQITIO","text":"But...no! I have to study! I'll stay here and help Chessamile make the syrup!"},{"name":"CHESSAMILE","text":"Be careful out there, yes? But if you can't be careful, you can always come back here."},{"name":"RYNE","text":"It should be safe enough for the children here."},{"name":"ARKIL","text":"We've heard the tales, but at last we can see you fight with our own eyes!"},{"name":"EIRWEL","text":"We've been waiting for you, Warrior of Darkness!"},{"name":"ALISAIE","text":"Everyone's here. Good. Let's get started, shall we?"},{"name":"ALISAIE","text":"As their name suggests, vampire bats feed on blood. And originally being nocturnal creatures, they've grown more active with the return of night and become a nuisance."},{"name":"ALISAIE","text":"To draw them out, we'll use Chessamile's lures, which work by exploiting their heat-seeking behavior."},{"name":"ALISAIE","text":"The bats are wont to nest under the eaves, so you are like to attract more if you place the lures near buildings."},{"name":"ALISAIE","text":"I have here six lures─three each for you and me. As proof of a successful kill, I want you to gather up their fangs. Whoever collects the most is the winner!"},{"name":"EIRWEL","text":"Oh? You're hunting too?"},{"name":"ALISAIE","text":"Y-Yes, well, there's nothing like friendly competition to bring out the best in <span class=\"highlight\">Forename</span>!"},{"name":"ALISAIE","text":"Anyway! While we hunt the bats, the two of you are to stay with Ryne. She's really strong too, and will keep you safe."},{"name":"ALISAIE","text":"Without further ado, then, let the contest begin!"},{"name":"RYNE","text":"Don't mind us. We'll be watching from a safe distance."},{"name":"ARKIL","text":"I won't blink! Not even once!"},{"name":"EIRWEL","text":"So the bats nest under the eaves... It's important to know your enemy!"},{"name":"SYSTEM","text":"You are under attack!"},{"name":"ARKIL","text":"Wow! That was amazing!"},{"name":"EIRWEL","text":"The bats didn't stand a chance!"},{"name":"RYNE","text":"Well fought, <span class=\"highlight\">Forename</span>! The children were hanging on your every move!"},{"name":"RYNE","text":"...As was I, to be honest. Though I know the tally, may I see your fangs for good measure?"},{"name":"ALISAIE","text":"Apologies for the wait."},{"name":"ALISAIE","text":"My fangs. Not a bad haul, even if I do say so myself."},{"name":"RYNE","text":"...Five, six, seven. Seven fangs from Alisaie."},{"name":"RYNE","text":"...Which means that victory goes to <span class=\"highlight\">Forename</span>, who collected <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">one</span><span class=\"alternative\">two</span><span class=\"alternative\">three</span><span class=\"alternative\">four</span><span class=\"alternative\">five</span><span class=\"alternative\">six</span><span class=\"alternative\">seven</span><span class=\"alternative\">eight</span><span class=\"alternative\">nine</span><span class=\"alternative\">ten</span></span></span><span class=\"alternative\">[#1]</span></span>!"},{"name":"ALISAIE","text":"Bah, seems you found the better spots for the lures."},{"name":"ALISAIE","text":"I would be lying if I said I wasn't disappointed, but you're still within reach. I'll get the better of you next time!"},{"name":"RYNE","text":"...Which means that we have a draw! <span class=\"highlight\">Forename</span> also collected seven fangs!"},{"name":"ALISAIE","text":"Argh, why does this feel even worse than losing? Just another measly fang and victory would have been mine!"},{"name":"ALISAIE","text":"<span class=\"emphasis\">Don't look so surprised</span>! I've no intention of remaining lost in your wake forever, you know!"},{"name":"RYNE","text":"...Which means that victory goes to Alisaie! <span class=\"highlight\">Forename</span> collected <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">one</span><span class=\"alternative\">two</span><span class=\"alternative\">three</span><span class=\"alternative\">four</span><span class=\"alternative\">five</span><span class=\"alternative\">six</span><span class=\"alternative\">seven</span><span class=\"alternative\">eight</span><span class=\"alternative\">nine</span><span class=\"alternative\">ten</span></span></span><span class=\"alternative\">[#1]</span></span>!"},{"name":"ALISAIE","text":"Hah, I did it! I bested <span class=\"highlight\">Forename</span>..."},{"name":"ALISAIE","text":"...In another godsdamned life! You didn't even try, did you!?"},{"name":"ALISAIE","text":"&lt;sigh&gt; And there I was taking it seriously... Spare me your pity next time, will you?"},{"name":"ALISAIE","text":"...So, children─you've now seen the Warrior of Darkness in action. What are your impressions?"},{"name":"EIRWEL","text":"<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span>'s incredible, miss! The bats were down before they knew it!"},{"name":"EIRWEL","text":"Our guards are strong, but the Warrior of Darkness is much, much stronger! We want to be just like <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>!"},{"name":"ALISAIE","text":"Good. If you're looking for an example to emulate, you may as well pick the best."},{"name":"ALISAIE","text":"I want you to remember how you felt when you watched <span class=\"highlight\">Forename</span>, and <span class=\"emphasis\">train hard</span>. Keep at it for long enough and you'll be strong too."},{"name":"RYNE","text":"If you don't mind telling us, when did you decide that you wanted to become Warriors of Light?"},{"name":"EIRWEL","text":"Well, we were there listening with everyone when Ardbert appeared, but I've wanted to be strong since before I came to the Crystarium."},{"name":"EIRWEL","text":"The sin eaters killed my father and my sister, see, and I promised myself I'd learn how to protect people one day."},{"name":"EIRWEL","text":"Like Ardbert said, this is our home. We're the ones who have to protect it. We're the ones who have to rise up as new Warriors of Light!"},{"name":"RYNE","text":"What about you, Arkil?"},{"name":"ARKIL","text":"M-Me? To be honest, I'm still not sure what I want to do."},{"name":"ARKIL","text":"But if my friends were in trouble, I know that I would want to help them."},{"name":"ARKIL","text":"And...I want to go on adventures with them. See the world together."},{"name":"RYNE","text":"That's a wonderful goal."},{"name":"ARKIL","text":"You...really think so?"},{"name":"ARKIL","text":"It's hard to explain...but it's something I felt when I saw the starshower the other day."},{"name":"ARKIL","text":"I felt as though...there was something I'd lost, and that I had to go out there and find it."},{"name":"ALISAIE","text":"Well, for the both of you, there's nothing for it but to train. When we return to the city, I'll teach you some exercises you can do by yourselves."},{"name":"ARKIL","text":"Thanks for showing us your fighting skills, Warrior of Darkness! We'll never forget it!"},{"name":"ALISAIE","text":"I understand how Arkil feels."},{"name":"ALISAIE","text":"The starshower didn't awaken me to Hydaelyn's voice. But that vision of the Final Days, of Amaurot burning..."},{"name":"ALISAIE","text":"It filled me with sadness to the very pit of my being."},{"name":"ALISAIE","text":"Things I once knew, people I once loved, promises I once made... It felt as though long-forgotten memories were dancing at the edges of my mind. But when I try to focus on them, they simply fade away."},{"name":"ALISAIE","text":"An effect of having a fractured soul, I shouldn't doubt. But lest you worry, I'm perfectly happy to <span class=\"emphasis\">remain</span> fractured and have no intention of donning an Ascian mask."},{"name":"ALISAIE","text":"&lt;sigh&gt; I just wish we knew what Elidibus was plotting..."},{"name":"ALISAIE","text":"Hah, but look at this pair of incurable brooders... If we're going to stand around, lost in thought, we may as well do it back in the city."},{"name":"ALISAIE","text":"Rest assured, Ryne and I will take the children from here. Their heads will be in the clouds after meeting you, but we'll see to it their feet remain firmly planted on the ground."},{"name":"ALISAIE","text":"...!"},{"name":"ALISAIE","text":"It's nothing. Just a dizzy spell. Seems I tried a little too hard to beat you."},{"name":"ALISAIE","text":"I'm fine now, not to worry. I'll see you soon."},{"name":"SYSTEM","text":"As you ponder Alisaie's words, you are taken by an urge to revisit the scene of that fateful meeting..."},{"name":"RYNE","text":"I'm so glad I found both you and the Exarch."},{"name":"MYSTERYVOICE","text":"The fates seem determined not to allow us a quiet moment. But come, let us have the details from Ryne."}],"reward":{"items":[{"num":2,"id":29503,"one":1},{"num":2,"id":29498,"one":1},{"num":2,"id":29500,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69307]},"next":[69309]},"partials":[{"type":"npc","id":"1033800","obj":{"i":1033800,"n":"Eirwel","l":2951,"q":1}},{"type":"npc","id":"1033811","obj":{"i":1033811,"n":"Crystal Exarch","l":2951,"q":1}},{"type":"item","id":"29503","obj":{"i":29503,"n":"Pickled Herring","l":480,"c":24327,"t":46}},{"type":"item","id":"29498","obj":{"i":29498,"n":"Mors","l":480,"c":24403,"t":46}},{"type":"item","id":"29500","obj":{"i":29500,"n":"Honey Croissant","l":480,"c":24013,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69307","obj":{"i":69307,"n":"In the Name of the Light","g":9,"l":"The Crystarium","s":210}},{"type":"quest","id":"69309","obj":{"i":69309,"n":"Fraying Threads","g":9,"l":"The Crystarium","s":230}}]}