{"quest":{"name":"Echoes of a Fallen Star","location":"Kholusia","id":69306,"patch":5.2,"sort":200,"icon":100984,"eventIcon":71201,"issuer":1032539,"target":1030610,"genre":9,"journal":["Urianger presumably has some idea as to what you might usefully do while Y'shtola pursues her investigations in Anamnesis Anyder.","You trouble Urianger for his thoughts on how you and your fellow Scions should occupy yourselves in Y'shtola's absence. After expressing confidence that her efforts will eventually bear fruit, he concludes the best course of action for the rest of you would be to wait─which, Alphinaud points out, means that you now have the opportunity to look in on the Exarch and ascertain how his efforts to perfect the spirit vessel are coming along.","You find the Exarch not in his tower, but at the Exedra, surrounded by a crowd of overexcited citizens. It seems the words of “Ardbert” have had the intended effect, kindling such heroic zeal in the people that they are ready to leave their homes without thought to the consequences. As if to compound matters, the sky suddenly turns dark, heralding the arrival of a shower of stars─a spectacle which awakens the crowd to a voice you know very well indeed. With perfect timing, Elidibus appears, proclaiming to those who hear it that they, too, are Warriors of Light, before departing as abruptly as he came. You catch up with him a short distance away, and though he offers no clarity on the subject of his motives, he does confirm that the meteors were an illusion of his own making. With an ominous promise to save the world, he vanishes─leaving you to ponder what all of this implies about Hydaelyn's own role in the creation of Warriors of Light...including you.","As the dust settles, you are approached by the Crystal Exarch. He informs you that two guardsmen with whom you are acquainted─the irrepressible Theyler and Vonard─have chosen to embark on a journey to become heroes in their own right, and asks that you offer them a few words of advice ere they depart.","You find Theyler and Vonard at the Amaro Launch, where they stand at the threshold of adventure, and impart a few pearls of wisdom gathered in the course of your own travels. They listen earnestly, and as you watch them set off into the unknown, it is easy to believe that the people of the First will find their path─even after you have gone.","Back at the Crystal Tower, having regaled the Exarch with the intrigues of your journey to Anamnesis, thoughts turn to the future. Rather than stake everything on the success of Y'shtola's investigations, Thancred proposes he use his ample experience in subterfuge to keep watch over Elidibus, and all readily agree. Urianger, meanwhile, will assist in ongoing research at the Umbilicus─for confident though Beq Lugg and the Exarch are of developing a means to transfer memory into spirit vessels, a great deal of experimentation yet remains. Needful tasks thus assigned, the Exarch suggests you take the opportunity to rest─a statement rife with irony, perhaps, given its source, but one not lacking in wisdom.","You retire to your suite in the Pendants, but are awoken in the evening by an unexpected tapping at your chamber door. It is Glynard, accompanied by a familiar figure come to offer words of encouragement─and why not? Be it by Cardinal Virtue or shrouded Ascian, the twisting of good men to vile ends is not to be borne."],"objectives":["Speak with Alphinaud.","Speak with Theyler.","Speak with the Crystal Exarch.","Speak with the manager of suites in the Pendants."],"dialogue":[{"name":"ALPHINAUD","text":"While it is true our findings have raised more questions than they have answered, it is not impossible that Y'shtola will gain access to additional records. And if nothing else, we have spared Eulmore from invasion."},{"name":"ALISAIE","text":"Hopefully, this will make the benthos think twice before raiding the stores of their fellow Ondo again."},{"name":"THANCRED","text":"Answers never did come to us tied neatly with a bow. We'll get to the bottom of things eventually."},{"name":"RYNE","text":"Does she really not mind working alone...?"},{"name":"URIANGER","text":"Can we but uncover Elidibus's true origins, we may yet come to understand his designs. To that end, Y'shtola must needs be afforded as much time as she doth require to complete her investigation."},{"name":"ALPHINAUD","text":"...To the extent that such things are within our control, yes. Speaking of which, perhaps we might trouble the Exarch for news of his progress with the spirit vessel?"},{"name":"ALPHINAUD","text":"He will no doubt wish to hear of our own discoveries as well, such as they are."},{"name":"ALISAIE","text":"And there he goes again... Though I don't suppose he would have given us an honest answer about his history had he stayed."},{"name":"THANCRED","text":"Unsettling though this is, I'm certain our friends in the guard will use the Echo well.<br>...Or with good intentions, at least."},{"name":"RYNE","text":"It did remind me of it... Amaurot, I mean. All the fear, and the sadness..."},{"name":"URIANGER","text":"Though I like not what it portendeth, having been treated to so <span class=\"emphasis\">unambiguous</span> a demonstration, I cannot well conclude aught but that starshowers are indeed instrumental in awakening the Echo."},{"name":"URIANGER","text":"Yet we need not attribute such credence to all that Elidibus hath claimed. That he too seeketh this star's salvation, for one..."},{"name":"ALPHINAUD","text":"The more Elidibus reveals, the less I understand. But that he has made a fine mess of things is plain."},{"name":"MYSTERYVOICE","text":"He is gone, then?"},{"name":"MYSTERYVOICE","text":"I've managed to persuade a number of our would-be deserters to reconsider, or at least delay, their departure. But as many are deaf to my entreaties."},{"name":"MYSTERYVOICE","text":"Young Theyler and Vonard among them, I am sorry to say. They have quit the guard."},{"name":"MYSTERYVOICE","text":"Nevertheless, I wish them well. Whatever Elidibus's plans for them might be, the pair have only ever had the best of intentions."},{"name":"THANCRED","text":"One can hardly blame them for thinking themselves heroes elect─not after having been “blessed” with the Echo. And it's not as if they haven't shown the requisite spirit."},{"name":"MYSTERYVOICE","text":"I quite agree. Though the impetus for their sudden departure may have been words falsely spoken, the men and women in whose footsteps they would follow are heroes in truth. Warriors of Light. Ardbert. Yourself, most of all."},{"name":"MYSTERYVOICE","text":"And so I would ask a favor of you─speak with them ere they embark on their journey, and furnish them with what wisdom you can. They've set off for the Amaro Launch, but you should still be able to catch them if you leave now."},{"name":"THANCRED","text":"Worth the effort, I'd say. If I recall correctly, <span class=\"alternative-container\"><span class=\"alternative\">Admiral Merlwyb</span><span class=\"alternative\">the Elder Seedseer</span><span class=\"alternative\">Raubahn</span></span> took the time to usher <span class=\"emphasis\">you</span> out into the wider world, many moons ago."},{"name":"ALPHINAUD","text":"I...think that comparison rather flatters Theyler and Vonard. But the point still stands. They would doubtless be greatly encouraged were the Warrior of Darkness <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> to see them off."},{"name":"URIANGER","text":"If thou art willing, I prithee go. Thou mayest safely leave the task of unfolding that which did transpire at Anamnesis to us."},{"name":"MYSTERYVOICE","text":"You will need to leave now if you are to catch them before they depart. They are...eager to be on their way."},{"name":"ALPHINAUD","text":"I daresay I needn't wax poetical on the value of well-placed words of encouragement to you of all people. I have gained <span class=\"emphasis\">that</span> much self-awareness in our time together..."},{"name":"ALISAIE","text":"Honestly, don't listen to all this prattle about the life-changing importance of your words to impressionable young heroes. You could nod mutely in their general direction and they'd still be inspired."},{"name":"THANCRED","text":"You caused quite a stir when you set forth as the <span class=\"alternative-container\"><span class=\"alternative\">Admiral's</span><span class=\"alternative\">Elder Seedseer's</span><span class=\"alternative\">Flame General's</span></span> newly anointed envoy, you know."},{"name":"THANCRED","text":"Minfilia was delighted. “The world is ever in need of heroes,” she said..."},{"name":"RYNE","text":"“This land is our home...and it is we who must protect it...” Even if he didn't believe a word he was saying, and it's all part of some terrible scheme, it's hard not to take his message to heart."},{"name":"URIANGER","text":"In days to come, when Elidibus's machinations have all come to naught, the First shall be stronger for its people's readiness to rise to the challenges of their time. We have but to defeat our foe to make it so."},{"name":"BEQLUGG","text":"I was so deeply immersed in my research that I entirely failed to notice the starshower... Bugger."},{"name":"BRAVESOLDIER","text":"...“Where in Amh Araeng”? I mean... You know... Around."},{"name":"SOLDIER03608","text":"You again!? Uh, I mean─it's <span class=\"emphasis\">you</span>, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">sir</span></span>! Sorry...it's been a funny old day."},{"name":"SOLDIER03608","text":"You can be sure we'll take those words to heart."},{"name":"BRAVESOLDIER","text":"I still can't believe it─you coming all this way just to speak to us."},{"name":"BRAVESOLDIER","text":"I swear we won't let you down. So long as it helps someone, we'll do what needs doing out there─no matter how small! "},{"name":"SOLDIER03608","text":"And when larger threats loom, we'll be ready to face them. You see if we aren't."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"<span class=\"alternative-container\"><span class=\"alternative\">Wonder and danger await you in equal measure, but turn not from either.</span><span class=\"alternative\">The path shall ever be revealed to those who are true of heart.</span><span class=\"alternative\">Strike fast and true, for victory belongs to the bold.</span></span>"},{"name":"A2","text":"...Well, what are you waiting for? Get out there!"},{"name":"SOLDIER03608","text":"We'll be off, then. Farewell, Warrior of Darkness─and thank you."},{"name":"ALPHINAUD","text":"I take it they were suitably inspired?"},{"name":"URIANGER","text":"Thou art returned! And at a most opportune time. We have but this moment concluded our account of all that came to pass in the deep."},{"name":"MYSTERYVOICE","text":"Thank you for making the effort. I'm certain your words will be a boon to them."},{"name":"MYSTERYVOICE","text":"While you were away, the others told me of your investigation. We have yet to discuss how to proceed, however."},{"name":"MYSTERYVOICE","text":"While your findings in Anamnesis Anyder do raise important questions as to the identity of our adversary, we are no closer to discerning his design. Nor do I know of any other potential avenue of investigation."},{"name":"URIANGER","text":"For which reason, we must needs trust to Y'shtola's ingenuity, and wait for her efforts to revive the ancients' device to bear fruit."},{"name":"THANCRED","text":"...What if I were to attempt to follow the emissary? Elusive as he is, his plan compels him to court public attention. He shouldn't be impossible to find."},{"name":"ALPHINAUD","text":"Especially for one of your experience. It does seem worth the attempt."},{"name":"RYNE","text":"Then I'll come with you. Safety in numbers."},{"name":"THANCRED","text":"In combat, perhaps─but where stealth is required, the opposite is true. Happily, I don't plan on getting myself caught, so you've no need to worry."},{"name":"THANCRED","text":"Nor do I intend to vanish for moons on end. We still have the Empty to attend to, don't we?"},{"name":"RYNE","text":"All right. Then I look forward to your return."},{"name":"ALISAIE","text":"Then it sounds like the rest of us should avoid doing anything which might prompt Elidibus to look too closely at our movements. Insofar as it's possible, I recommend we limit our activities to the Crystarium."},{"name":"ALPHINAUD","text":"Speaking of which─Exarch, might I ask if you've made any progress with the spirit vessel?"},{"name":"RYNE","text":"（★未使用／削除予定★）"},{"name":"MYSTERYVOICE","text":"（★未使用／削除予定★）"},{"name":"MYSTERYVOICE","text":"Of course. We are presently studying the principles underpinning memory transference and, I believe, nearing the requisite level of understanding."},{"name":"MYSTERYVOICE","text":"Less hearteningly, practical trials of transference methods suited for use with the vessel have yet to yield satisfactory results...to put it mildly."},{"name":"BEQLUGG","text":"But there are still many promising possibilities we have yet to test!"},{"name":"MYSTERYVOICE","text":"Indeed. Though it may take some time yet, we are well on our way to a solution."},{"name":"MYSTERYVOICE","text":"And I shall not rest until one is found."},{"name":"URIANGER","text":"Though we are all grateful for thine unstinting efforts, thou need'st not labor to the exclusion of all else. If it would serve to lighten thy burden, however little, I should gladly offer mine assistance."},{"name":"ALPHINAUD","text":"Quite. I, for my part, will do what I can to ensure that the Crystarium continues to run smoothly, in spite of recent disruptions."},{"name":"RYNE","text":"Then perhaps I could help? There must be something I can do, even if it's just guard duty."},{"name":"MYSTERYVOICE","text":"Thank you... All of you. I shall breathe easier for your assistance."},{"name":"MYSTERYVOICE","text":"Of course, on the evidence of the recent past, it will not be long before some new crisis arrives to throw our plans into disarray─at which time <span class=\"emphasis\">your</span> services will be in particular demand. That being the case, perhaps you might take this opportunity to retire to your suite at the Pendants?"},{"name":"MYSTERYVOICE","text":"One of these methods will work. It must."},{"name":"MYSTERYVOICE","text":"...Of <span class=\"emphasis\">course</span> I don't wish to worry Lyna─she has more than enough to worry about already. But I swore that I would return you all home."},{"name":"MYSTERYVOICE","text":"All right! <span class=\"emphasis\">Fine</span>. I will henceforth endeavor to take breaks when appropriate.<br>...While Lyna is watching."},{"name":"ALPHINAUD","text":"Ought we to inform the citizens that the starshower was an illusion, do you think? They might sleep better for the knowledge that no damage was done."},{"name":"ALISAIE","text":"<span class=\"emphasis\">I</span> will accompany my brother, and make sure he doesn't get carried away. <span class=\"emphasis\">You</span> will do as you're told, and get some rest─<span class=\"emphasis\">both of you.</span>"},{"name":"ALISAIE","text":"Honestly, he's a danger to himself. If I were Lyna, I think I would've hit him over the head with a blunt object by now. At least then he'd lie down."},{"name":"THANCRED","text":"There is sure to be no shortage of potential heroes upon whose good nature Elidibus will try to prevail. The trick will be in anticipating which settlement he'll direct his attentions toward next..."},{"name":"RYNE","text":"There's so much to be done, and so little I can do to help... But you can count on me to play my part in the Empty."},{"name":"URIANGER","text":"Knowing not whether Elidibus or our ever-waning connection to the Source representeth the more pressing problem, we must needs attend to both...and risk solving neither."},{"name":"BEQLUGG","text":"Never fear─I too will continue to assist the Exarch to the best of my ability. And if that means casting the odd sleeping charm, <span class=\"emphasis\">so be it</span>."},{"name":"GUIDEOFTHEPENDANTS","text":"A pleasure as always, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>."},{"name":"GUIDEOFTHEPENDANTS","text":"I am relieved to see you were unharmed in the earlier commotion. Though, if I may─you do look somewhat weary. I presume you will be retiring to your suite?"},{"name":"Q1","text":"Retire to your quarters?"},{"name":"GUIDEOFTHEPENDANTS","text":"Very good. Do let me know if there is anything you require."},{"name":"SYSTEM","text":"A new Eden quest is now available from Yalfort in Mord Souq."},{"name":"GLYNARD","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? It's Glynard─from the Wandering Stairs. I apologize for calling so late."},{"name":"GLYNARD","text":"A friend of yours was asking after you. You may remember them from that business with the Cardinal Virtues..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Granson."},{"name":"A1","text":"Giott."},{"name":"A1","text":"Lue-Reeq."},{"name":"A1","text":"Taynor."},{"name":"A1","text":"Cyella."},{"name":"GRANSON","text":"Well met, sinner."},{"name":"GRANSON","text":"I was looking forward to a welcome respite here in the Crystarium, but the mood here's not exactly conducive to relaxation, as I'm sure you've noticed."},{"name":"GRANSON","text":"Aye, I'd wager you know more about what's going on than anyone else in this city. Care to share?"},{"name":"GRANSON","text":"Hmmm... I can't say that I envy you your prey."},{"name":"GRANSON","text":"Dark work, this twisting of the Warriors of Light's legacy. Reminds me of what became of ol' Dikaiosyne─though this “Ascian” of yours is a fair bit more chatty."},{"name":"GRANSON","text":"I'm tempted to silence him myself. Branden made his mistakes─I'm sure they all did─but the past is the past. They've earned their rest."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm not about to let him sully Ardbert's good name."},{"name":"A2","text":"I'll see that they have their peace."},{"name":"GRANSON","text":"What, you want me to leave it to you?"},{"name":"GRANSON","text":"...Right, right. I'm not the only one carrying all that weight. Very well. But only because you asked."},{"name":"GRANSON","text":"Remember: if you ever need me, just say the word. I'll be there."},{"name":"GIOTT","text":"Lali-ho, stranger!"},{"name":"GIOTT","text":"So there I am─minding my own business, quaffing my ale─when I hear a ruckus outside. And then, clear as day: “Warrior of Light”!"},{"name":"GIOTT","text":"That sounded like trouble to me, and I knew that if anyone was going to trouble <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> over that trouble, it'd be you. So I gave Glynard the ol' “But I'm your best customer!” routine until he agreed to bring me here, and now I know where you live! Great, ain't it?"},{"name":"GIOTT","text":"Some bastard's walking around wearing Ardbert─<span class=\"emphasis\">Lamitt's</span> Ardbert─like a secondhand jerkin!?"},{"name":"GIOTT","text":"I don't know what's more offensive─that, or that you let him leave without a proper dwarven decking!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"He <span class=\"emphasis\">did</span> vanish into thin air."},{"name":"A3","text":"A certain hobson refused to teach me..."},{"name":"GIOTT","text":"Bah! In a pinch, an improvised decking would've been fine!"},{"name":"GIOTT","text":"Tell you what. I'll show you how to knock that bastard flat in the blink of an eye here and now. Taboos be damned."},{"name":"GIOTT","text":"After all, we ain't about to let him keep on like that, are we? Pretending to be Ardbert. <span class=\"emphasis\">Lamitt's</span> Ardbert."},{"name":"GIOTT","text":"Step one: make a fist. Step two: extend your arm, like so. Step three: beat 'em senseless. Got it?"},{"name":"GIOTT","text":"Good. Now make me proud!"},{"name":"LUEREEQ","text":"What charming accommodations!"},{"name":"LUEREEQ","text":"I had come to dine at the Wandering Stairs, you see, when I spied a considerable gathering of locals. Then the sky caught fire, and, well..."},{"name":"LUEREEQ","text":"You must know what it all means. Anything you'd care to share with a friend?"},{"name":"LUEREEQ","text":"That is...alarming, to say the least."},{"name":"LUEREEQ","text":"It's all well and good that others have come to appreciate the Warriors of Light, but we cannot allow this charlatan to exploit their legacy. So..."},{"name":"LUEREEQ","text":"Yes! Why not? We shall reform the indomitable duo that is Reeq and <span class=\"highlight\">Forename</span>, and put an end to his shenanigans!"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"That's very kind of you."},{"name":"A4","text":"Eager as ever, I see."},{"name":"LUEREEQ","text":"Yes, I know. No need to say it. You've no intention of involving me. I'm stupid, but I'm not naive."},{"name":"LUEREEQ","text":"You're the better hunter, and the better person besides. I'm reminded of Renda-Rae...though that's hardly a surprise, is it?"},{"name":"LUEREEQ","text":"For her sake─for all of theirs─show this pretender what it truly means to be a hero!"},{"name":"TAYNOR","text":"Pray forgive my late visit... I heard the man who called himself a Warrior of Light speak, you see, and saw the stars falling from the heavens."},{"name":"TAYNOR","text":"Cerigg grew tired of my endless fretting and bade me call upon you if it would put my mind at ease. Is there aught you can tell me?"},{"name":"TAYNOR","text":"An impostor. I feared you might say that."},{"name":"TAYNOR","text":"I believed him─I <span class=\"emphasis\">wanted</span> to believe him. How wonderful it was that even one of them returned, I thought..."},{"name":"TAYNOR","text":"Yet if he is not the man you knew, then...I'm sorry. I know all too well how that feels."},{"name":"TAYNOR","text":"I can only imagine how it must hurt to be unable to speak the truth─how you must abide the lie for fear of condemning those fallen heroes once more."},{"name":"TAYNOR","text":"It may not be my place, but allow me to offer you a few words of advice. As you once did me."},{"name":"TAYNOR","text":"Remember how dear he was to you, and be brave."},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"Thank you, my friend."},{"name":"A5","text":"You've certainly grown."},{"name":"TAYNOR","text":"O-Oh! I'm not half so eloquent as you, but I hope that it helps!"},{"name":"CYELLA","text":"Good evening."},{"name":"CYELLA","text":"I was in the Exedra. I saw everything."},{"name":"CYELLA","text":"That <span class=\"emphasis\">was</span> Ardbert...and it was not. Twice now he has appeared, calling the people to arms. Speaking of “heroes.”"},{"name":"CYELLA","text":"I knew this day might come. Ardbert never did reappear as a Virtue."},{"name":"CYELLA","text":"But to see his flesh stolen by the selfsame Ascian that made mock of their sacrifice..."},{"name":"CYELLA","text":"I spent years searching for a means to redeem their legacy. <span class=\"emphasis\">His</span> legacy. And in you, I found it. You slew the Virtues, reclaimed the stars..."},{"name":"CYELLA","text":"You spoke the truth, and the people listened. When I heard our patrons speak of how the Warriors of Light had been their saviors all along, I thought at last, <span class=\"emphasis\">at long last</span>..."},{"name":"CYELLA","text":"I was a fool."},{"name":"CYELLA","text":"I cannot ask more of you, not after what you've given. But I must."},{"name":"CYELLA","text":"Set him free. Lay him to rest with the others, in honor and triumph."}],"reward":{"gil":4500},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69305]},"next":[69307,69329]},"partials":[{"type":"npc","id":"1032539","obj":{"i":1032539,"n":"Urianger","l":2954,"q":1}},{"type":"npc","id":"1030610","obj":{"i":1030610,"n":"Manager Of Suites","l":2951,"q":5}},{"type":"quest","id":"69305","obj":{"i":69305,"n":"Beneath the Surface","g":9,"l":"Lakeland","s":190}},{"type":"quest","id":"69307","obj":{"i":69307,"n":"In the Name of the Light","g":9,"l":"The Crystarium","s":210}},{"type":"quest","id":"69329","obj":{"i":69329,"n":"Worlds Apart","g":23,"l":"Amh Araeng","s":13,"f":1}}]}