{"quest":{"name":"Food for the Soul","location":"The Rising Stones","id":69310,"patch":5.3,"sort":240,"eventIcon":71201,"issuer":1032081,"target":1033822,"genre":9,"journal":["Judging by her sheepish expression, Tataru has a favor to ask."],"objectives":["Speak with Tataru.","Deliver the Archon loaf to the Crystal Exarch in the Ocular.","Speak with Urianger."],"dialogue":[{"name":"KRILE","text":"You've come a long way, so do take your ease while you can."},{"name":"TATARU","text":"Um...<span class=\"highlight\">Forename</span>? Could you spare a moment? While Krile goes and finds this expert of hers, I mean."},{"name":"TATARU","text":"There's a gift I was hoping to send to our friends in the First, you see...and since we might be waiting a while, I wondered if you wouldn't mind giving me a hand with it."},{"name":"TATARU","text":"My first attempt turned out well, so now I'm going to make it properly."},{"name":"TATARU","text":"I'll be in the kitchen at the House of Splendors. Meet me there!"},{"name":"KRILE","text":"Well, I had better be off too. I shall see you soon, either here or at the House, depending on how our patients fare in my absence."},{"name":"TATARU","text":"There you are, <span class=\"highlight\">Forename</span>! As I'm sure you've guessed, the gift is a bit of home cooking."},{"name":"TATARU","text":"Unlike Krile, I can't do much to help our friends directly. But that doesn't mean I've been idle."},{"name":"TATARU","text":"No, I've been doing my best for the order, taking on this job and that to keep our coffers full. I've even helped out with the Ishgardian restoration."},{"name":"TATARU","text":"And in the course of all this, my culinary skills have come on quite a bit. So I thought, why not make something for our friends?"},{"name":"TATARU","text":"It's baking in the oven even as we speak. Shouldn't be long now!"},{"name":"TATARU","text":"There! Baked to perfection, even if I do say so myself!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's...bread."},{"name":"A1","text":"Smells great!"},{"name":"A1","text":"Your cake looks like bread."},{"name":"TATARU","text":"But not just <span class=\"emphasis\">any</span> old bread! This here is <span class=\"emphasis\">Old World</span> bread. “Archon loaf,” to be precise. It's what they eat over in Sharlayan!"},{"name":"TATARU","text":"Doesn't it just! It's called “Archon loaf,” in case you're wondering, and it's what they eat over in Sharlayan."},{"name":"TATARU","text":"It <span class=\"emphasis\">is</span> bread, silly! And not just <span class=\"emphasis\">any</span> old bread. This here is <span class=\"emphasis\">Old World</span> bread. “Archon loaf,” to be precise. It's what they eat over in Sharlayan!"},{"name":"TATARU","text":"Simple fare, I admit, but I thought it would remind our friends of home."},{"name":"TATARU","text":"If nothing else, Krile tells me it's a good source of aether."},{"name":"TATARU","text":"So it should lend them a bit of strength at least."},{"name":"KRILE","text":"Mmm-mmmmmm! There truly is nothing like the smell of bread fresh from the oven!"},{"name":"TATARU","text":"Krile! And if it isn't Rammbroes too!"},{"name":"KRILE","text":"I trust you require no introductions either, <span class=\"highlight\">Forename</span>."},{"name":"RAMMBROES","text":"Greetings, my friend. Full glad am I to see you well."},{"name":"RAMMBROES","text":"I confess, I have a malm-long list of questions to ask you, but I will endeavor to contain my curiosity for the present. I understand our mutual friend is struggling with the application of certain Allagan technologies."},{"name":"KRILE","text":"I have been keeping Rammbroes apprised of events in the First. Suffice it to say, he knows about the Exarch."},{"name":"KRILE","text":"If anyone alive can provide insight into this matter, it is him and his fellow Sons."},{"name":"RAMMBROES","text":"Ahem. Loath as I am to disappoint you after so glowing an endorsement..."},{"name":"RAMMBROES","text":"Memory transference was the sole province of Allagan royalty, its mechanisms closely guarded secrets. If any record of them remains, we have yet to find it. To wit, I regret that I can offer no solution to your problem."},{"name":"RAMMBROES","text":"...Which begs the question of why I bothered to come here, empty-handed as I am─the answer being, rather brazenly, to ask a favor. I would have you relay a message to our comrade."},{"name":"RAMMBROES","text":"Tell him... Tell him that we never doubted him."},{"name":"RAMMBROES","text":"Never doubted that he would achieve all that he said he would."},{"name":"RAMMBROES","text":"Those of us who remained behind have yet to play our part."},{"name":"RAMMBROES","text":"But when the time comes, he may rest easy in the knowledge that we will most assuredly do so."},{"name":"RAMMBROES","text":"And then the tower shall shine once more as a beacon of hope, in this world and beyond."},{"name":"RAMMBROES","text":"So tell him that we consider his duty done─and that he should follow his heart now."},{"name":"KRILE","text":"Forgive me, but do you say this to discourage him from overexerting himself? Or to encourage him to hold nothing back?"},{"name":"RAMMBROES","text":"That is for our friend to decide, but either way, I daresay a certain someone will be unimpressed."},{"name":"KRILE","text":"Well, there you have it, <span class=\"highlight\">Forename</span>. If you would be so good as to see Rammbroes's message and Tataru's bread to their intended recipients─along with my report, of course."},{"name":"TATARU","text":"Um, Krile? Before I wrap the bread up, would you mind giving it a try? Just to make sure everything's as it should be?"},{"name":"KRILE","text":"But of course! I'm always happy to lend my taste buds!"},{"name":"KRILE","text":"Hmmm... Hmmmmmm..."},{"name":"KRILE","text":"Excuse me, Rammbroes. As a fellow Sharlayan, may I trouble you for your opinion?"},{"name":"RAMMBROES","text":"Well, I usually have mine with a good dollop of rolanberry jam, but I suppose plain is best for sampling purposes."},{"name":"RAMMBROES","text":"&lt;munch&gt; &lt;munch&gt; I see, I see..."},{"name":"TATARU","text":"Oh no... Is it that bad?"},{"name":"KRILE","text":"It is indeed, Tataru. Dense and unpleasant...exactly as it should be!"},{"name":"RAMMBROES","text":"Gahaha! Just so! The very taste of home!"},{"name":"RAMMBROES","text":"As you might expect, our countrymen have amassed a wealth of culinary wisdom from every corner of the world. But our native cuisine is...shall we say, a little lacking."},{"name":"RAMMBROES","text":"In Sharlayan, the majority regard food as a source of nourishment rather than enjoyment. Save for those few who actually research the culinary arts, we pay little heed to the niceties of taste and texture."},{"name":"RAMMBROES","text":"It was against such a gastronomic landscape that what is now called the “Archon loaf” was born, the creation of an Archon who devoted himself to the study of bodily sustenance."},{"name":"RAMMBROES","text":"In order to maximize its nutritional value, he incorporated copious quantities of pulverized fish and vegetable matter into the dough─all with nary a care for those qualities which make bread enjoyable. The result is a flavor that continues to defy description."},{"name":"RAMMBROES","text":"Yet for its many shortcomings, the loaf's nutritional value cannot be denied. And being a damnably convenient way to cater to one's bodily needs, it quickly found an audience amongst busy scholars. Why, when I was a lad, nigh every meal was a sandwich made with this very bread and whatever ingredients happened to be on hand."},{"name":"KRILE","text":"Hm hm! I suspect just about every Archon could say the same."},{"name":"KRILE","text":"Having been away from home for so long, I thought I might have forgotten the taste. But no─it is all too familiar. Ahhh, how it takes me back..."},{"name":"RAMMBROES","text":"If there is enough, perhaps you can spare some for the Exarch? He is certain to appreciate it."},{"name":"TATARU","text":"Oh, there's <span class=\"emphasis\">plenty</span> to go around. I'll be sure to wrap up an extra slice!"},{"name":"TATARU","text":"<span class=\"highlight\">Forename</span>, when you deliver the loaf, please be sure to send everyone my regards."},{"name":"TATARU","text":"Tell them we're doing everything we can, and that we'll be praying for their safe return until the moment they get back."},{"name":"TATARU","text":"Well...it sounds like it'll do them good, anyway."},{"name":"TATARU","text":"And when everything's back to normal, I'll cook something for you too, <span class=\"highlight\">Forename</span>. Gods know you deserve a treat!"},{"name":"BEQLUGG","text":"Ah, you are returned! Good, good. There is much to discuss. The others are making their way hither as we speak."},{"name":"MYSTERYVOICE","text":"Welcome back, my friend. How was your journey?"},{"name":"MYSTERYVOICE","text":"By the Twelve... Archon loaf! However did you come by this? I'd swear it had come straight from Sharlayan..."},{"name":"MYSTERYVOICE","text":"Rammbroes said that, did he? &lt;sigh&gt; His words are very nearly as heavy as the bread...but I appreciate the sentiment."},{"name":"MYSTERYVOICE","text":"Should you have the chance, you may tell him that he needn't worry. That which I seek to do, I do of my own volition, and with all my heart."},{"name":"MYSTERYVOICE","text":"In pursuing this path, I fully expect to earn the censure of our friends─and to deserve it─but I shall forge on regardless."},{"name":"MYSTERYVOICE","text":"Forge on as you yourself did when faced with a similar predicament. So I ask that you have faith in me. In what we do."},{"name":"MYSTERYVOICE","text":"...But we were talking about your journey. Before the others arrive, I would hear how their bodies fare."},{"name":"MYSTERYVOICE","text":"Oh, and the bread I shall save for later. Though it has been many years, I have not forgotten the feats of mastication required to consume it, nor how unconducive they are to conversation."},{"name":"MYSTERYVOICE","text":"As Beq Lugg said, the test will take a while. I ask for your patience in the meantime."},{"name":"BEQLUGG","text":"Off you go and help your friends. Even assuming the test is a success, I doubt they would feel comfortable leaving with business unfinished."},{"name":"ALPHINAUD","text":"When our grandfather first decided to journey to Eorzea, Alisaie did not take kindly to my silence on the subject. “Don't pretend to understand things you don't,” she said...or rather shouted."},{"name":"ALPHINAUD","text":"Having oft been the object of her scorn, I am predisposed to sympathize with the Exarch, but I do understand how she feels─better now than ever I did, certainly."},{"name":"ALISAIE","text":"I'm sorry, I know it was childish to storm off like that. And probably to feel the way I do as well. Agh, pull yourself together, Alisaie!"},{"name":"THANCRED","text":"I for one support the Exarch's choice. To be alive is to be driven by a purpose, and few are as driven as him."},{"name":"RYNE","text":"It's stupid, but I've never really stopped to think about what would happen once the vessels were complete. And now..."},{"name":"RYNE","text":"No. There's no point. I...I hope the test is a success. Truly."},{"name":"URIANGER","text":"Hast thou a moment, <span class=\"highlight\">Forename</span>? I would speak with thee on the matter of the Exarch's mooted return unto the Source."},{"name":"URIANGER","text":"Thou wilt have observed that our friend spake not in certainties. Yet if Beq Lugg hath the right of it, 'tis possible to predict the outcome of his plan with some confidence."},{"name":"URIANGER","text":"And it is their assessment that, given the opportunity, the Exarch's soul should successfully merge with that of his younger self."},{"name":"URIANGER","text":"Which is not to say the process is without complications. For one, the Exarch hath been subjected to an additional Rejoining, an experience which will have wrought a change in his aetherial composition."},{"name":"URIANGER","text":"As thou thyself didst demonstrate in merging with Ardbert, however, there existeth an affinity 'twixt like souls, and this doth give us cause to hope."},{"name":"URIANGER","text":"...Yet there remaineth one immutable condition upon which success doth hinge."},{"name":"URIANGER","text":"The Exarch must needs recognize his past self as simply that─himself."},{"name":"URIANGER","text":"As our recent travails have demonstrated, memories are essential to the soul. Any discrepancy in the former may feasibly cause the latter to spurn its former flesh."},{"name":"URIANGER","text":"'Tis a seemingly simple yet complex problem. For nigh on a century, our friend hath striven only to deliver this realm, to deliver <span class=\"emphasis\">thee</span>. And to that singular end did he cast aside his very name, that he might assume the mantle of the Crystal Exarch."},{"name":"URIANGER","text":"Henceforth, none can say what choices our friend will make, but I thought it only right that thou be made aware of these truths."}],"reward":{"gil":1894,"items":[{"id":35720,"one":1},{"id":35721,"one":1},{"id":35722,"one":1},{"id":35723,"one":1},{"num":7,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69309]},"next":[69311]},"partials":[{"type":"npc","id":"1032081","obj":{"i":1032081,"n":"Tataru","l":481,"q":2}},{"type":"npc","id":"1033822","obj":{"i":1033822,"n":"Urianger","l":2951,"q":1}},{"type":"item","id":"35720","obj":{"i":35720,"n":"Crystarium Gear of Aiming Coffer (IL 500)","l":1,"c":26509,"t":61}},{"type":"item","id":"35721","obj":{"i":35721,"n":"Crystarium Gear of Scouting Coffer (IL 500)","l":1,"c":26509,"t":61}},{"type":"item","id":"35722","obj":{"i":35722,"n":"Crystarium Gear of Healing Coffer (IL 500)","l":1,"c":26509,"t":61}},{"type":"item","id":"35723","obj":{"i":35723,"n":"Crystarium Gear of Casting Coffer (IL 500)","l":1,"c":26509,"t":61}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69309","obj":{"i":69309,"n":"Fraying Threads","g":9,"l":"The Crystarium","s":230}},{"type":"quest","id":"69311","obj":{"i":69311,"n":"Faded Memories","g":9,"l":"The Crystarium","s":250}}]}