{"quest":{"name":"Ruby Doomsday","location":"The Lochs","id":69319,"patch":5.2,"sort":10,"icon":100994,"unlocksFunction":1,"eventIcon":71341,"issuer":1032581,"target":1032586,"genre":25,"journal":["The Resistance and Alliance forces prepare in earnest as a new threat looms on the horizon.","Upon receiving word of a fresh menace approaching the Eorzean front, you make your way to Ala Mhigo, where you are given the briefest of briefings. You are asked to meet with the Resistance troops at Porta Praetoria, where you will receive further instructions.","A member of the Resistance forces escorts you to Alliance Headquarters, where the tension in the air is palpable. While each and every soldier stationed there has a similar bleak expression etched on their face, one man in particular is even grimmer than the rest: Gaius Baelsar.","Gaius provides a detailed explanation of the encroaching Ruby Weapon and his failed attempt to destroy it. He and his loyal follower, Severa, tried to preemptively attack the gigantic machina using explosives, only for it to escape largely unscathed before turning to retaliate. Gaius was wounded protecting Severa, resigning the veteran combatant to the role of spectator until he has recovered. He reluctantly petitions your aid in eliminating the Ruby Weapon before it can reach Eorzea, warning you that its near-impenetrable armor plating and whip-like claws are most likely abilities stolen from absorbed primals. Once your preparations are complete, you are to speak with the Resistance soldier assigned as your escort to the battlefield.","The Resistance soldier is to take you to the expected point of contact with the Ruby Weapon before withdrawing to a safe distance. It is clear that this is a foe far beyond the capabilities of rank-and-file troops, and even you, conqueror of the original Ultima Weapon, may be pushed to your limits.<br><br>※Cinder Drift can be accessed via the Duty Finder.","The climactic battle finally draws to a close, and the Ruby Weapon falls silent. Though there are many mysteries surrounding the warmachina's connection with Nael van Darnus, the former legatus of the VIIth Legion whose apparition appeared during the encounter, it seems the answers must wait for the time being. Leaving the wreckage of the gargantuan machine behind, you head towards Alliance Headquarters.","As you turn to leave the battlefield, you are joined by Gaius, who has been observing the encounter from afar. Your conversation is interrupted by the arrival of imperial troops sent to salvage the wreckage of the Ruby Weapon. Strangely, it appears that not only are they acquaintances of Gaius's, but they address him as “Father,” even going so far as to ask him to return to Garlemald. Unwavering, he states that his days serving the Empire are over, though he soon loses his composure upon discovering that the pilot of the Ruby Weapon was a soldier named Milisandia. He angrily accuses the young imperials of failing to protect their sibling, to which the leader among them replies by stating that they only wished to finish what Gaius had started. They then withdraw, leaving you and the man once known as the Black Wolf to consider your next move.","Shortly after returning to Alliance Headquarters, Gaius is, for better or worse, reunited with his former ward, Cid Garlond, who has been sent to investigate the remains of the Ruby Weapon. Although the two Garleans share a troubled history, they decide to attend to the matters at hand rather than dwell on the past. Their exchange of words is remarkably brief, and you are soon left alone with Cid, who explains that he was one of several children that Gaius had taken into his care, which apparently also included Milisandia, pilot of the Ruby Weapon, though it seems that Cid was unfamiliar with her name until now. He then returns to the task of gathering information on your fallen foe and leaves for the battlefield.","Cid returns somewhat sooner than expected from his investigation with urgent news for Gaius. It seems that not only did Milisandia perish inside the Ruby Weapon's cockpit, as was feared, but her physical form was fused with its core, a horrific spectacle that has left Cid visibly shaken. The Empire, not content to stop at using its pilots as disposable commodities, appears to be dabbling in implanting combat data from elite soldiers such as the deceased Nael van Darnus into living hosts, though the exact methods are as yet unclear. While the immediate threat of the Ruby Weapon has been eliminated, the possibility of ever more dangerous foes cannot be ignored, so Cid, Gaius, and the other members of the group set about learning what they can of the Weapon project. You, on the other hand, are advised to rest in preparation for the struggles that lie ahead, though it would seem prudent to first inform the Resistance troops in Ala Mhigo of the outcome of the battle.","You return to Porta Praetoria to share the events surrounding your encounter with the Ruby Weapon. The details are quickly compiled into a written report to be conveyed to the higher ranks of the Resistance and Alliance, while a copy will be retained at the camp for you to peruse at your leisure, should you feel so inclined. The information you have provided may prove to be invaluable in the days to come, as it is clear the danger posed by the Weapon project is far from over."],"objectives":["Speak with the Resistance fighter.","Speak with Gaius.","Speak with the Resistance escort.","Confront the Ruby Weapon in Cinder Drift.","Speak with Gaius.","Speak with Gaius again.","Report to the Resistance officer."],"dialogue":[{"name":"RESISTANCEOFFICER","text":"Ah, <span class=\"highlight\">Forename</span>. Glad you could make it."},{"name":"RESISTANCEOFFICER","text":"As you may have heard, Commander Aldynn has given orders to embark from Alliance Headquarters to hold back the advance of the Empire's latest menace."},{"name":"RESISTANCEOFFICER","text":"Not that the soldiers stationed there are too chuffed about being on the front line against these new Weapons. If they're designed to slay primals, they'd make short work of us mere mortals as well."},{"name":"RESISTANCEOFFICER","text":"Mind you, it's Gaius Baelsar and his followers who've led the charge so far. By all accounts, they've been giving as good as they get."},{"name":"RESISTANCEOFFICER","text":"Unfortunately, their sorties have met with little success. I daresay they'd benefit greatly from your presence on the battlefield. If you're ready, my colleague over at Porta Praetoria will show you the way."},{"name":"RESISTANCEGATEKEEPER","text":"On your way to headquarters, I take it?"},{"name":"Q3","text":"Accompany the Resistance fighter to Alliance Headquarters?"},{"name":"RESISTANCEOFFICER","text":"He was told to wait for you at the foot of the long set of stairs. I imagine he's milling about at the camp, trying not to step in any chocobo shite."},{"name":"SHADOWHUNTER","text":"So, your mind is set?"},{"name":"SHADOWHUNTER","text":"Then I shall apprise you of the situation."},{"name":"SHADOWHUNTER","text":"We have discovered that the previously abandoned Ultima Weapon project is being helmed by the reformed VIIth Legion."},{"name":"SHADOWHUNTER","text":"They have already succeeded in producing several prototypes, one of which is set to be deployed on the Eorzean front. Its name: the Ruby Weapon."},{"name":"SHADOWHUNTER","text":"Severa and I were able to get within striking distance during one of its test runs and made an attempt to destroy it."},{"name":"SEVERA","text":"An attempt that ended in failure, alas. Based on our knowledge of the original Ultima Weapon, the explosives we employed should have been sufficient to blast through its armor plating, but they barely left a mark."},{"name":"SEVERA","text":"We suspect the gifts of its predecessor may have proven the source of its resilience."},{"name":"SHADOWHUNTER","text":"As you well know, the Ultima Weapon was designed to absorb aether from eikons, and the Ruby Weapon no doubt shares that ability. If any were summoned during the uprisings in Garlemald's occupied territories, and thereafter consumed, our enemy would become all the more formidable."},{"name":"SHADOWHUNTER","text":"But its near-impenetrable armor was only the beginning of our troubles."},{"name":"SHADOWHUNTER","text":"It fought back with whip-like claws that can be extended and contracted at will. In the face of such opposition, we were forced to withdraw."},{"name":"SEVERA","text":"Gaius was injured shielding me from the Ruby Weapon's assault. Even now, he struggles to stand. Damn it all! If I hadn't been so careless, this wouldn't have happened."},{"name":"SHADOWHUNTER","text":"You need not concern yourself. Let us not forget that I am the one who initiated the Ultima Weapon project. If I must give my life to bury this shameful legacy, then so be it."},{"name":"VALDEAULIN","text":"If you were to face it as you are now, you'd be cut down before you even hobbled within firing distance."},{"name":"VALDEAULIN","text":"In any case, we can't afford to lose the information in your head, on both the foe we face and the Empire itself. We all know that asking for <span class=\"highlight\">Forename</span>'s assistance presents our best chance of stopping that warmachina."},{"name":"SHADOWHUNTER","text":"'Tis true that if anyone were capable of putting down such a monstrosity, it would be <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"SHADOWHUNTER","text":"Though I have no right to ask this of you, will you lend us your strength?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm not one to back down from a fight."},{"name":"A1","text":"I do this for Eorzea."},{"name":"SHADOWHUNTER","text":"You have my thanks."},{"name":"VALDEAULIN","text":"And mine, though I must impress upon you the urgency of our situation. We have received word that the Empire is preparing to advance on the Ghimlyt Dark. That is where we will intercept them."},{"name":"VALDEAULIN","text":"If our fears are proven correct, the Ruby Weapon will be among their host. Should it break through our lines, there is no telling the devastation it will wreak. Make no mistake, the very survival of Eorzea hangs in the balance."},{"name":"VALDEAULIN","text":"Once you have steeled yourself for the battle ahead, your escort will lead the way."},{"name":"SHADOWHUNTER","text":"...What price must the world pay for my hubris?"},{"name":"SYSTEM","text":"A short while earlier, in the Garlean-occupied city of Werlyt's magitek installation..."},{"name":"OPERATOR03783","text":"Commencing Ruby Weapon activation sequence. All units, stand by."},{"name":"OPERATOR03783","text":"Initiating synthetic auracite system... Fusion successful, no signs of incompatibility. Awaiting your signal."},{"name":"MILISANDIA","text":"(-Gutsy Female Voice-)Ruby Weapon, code name “Darnus.” Ready for launch!"},{"name":"VALDEAULIN","text":"To be honest, we weren't sure if you'd ever show up. I, for one, am glad you've decided to throw in your lot with us."},{"name":"SEVERA","text":"Gaius says you are our best hope of defeating that abomination. We have seen only a glimpse of its true power, and even that was more than enough for us."},{"name":"RESISTANCEGATEKEEPER","text":"On your way to headquarters, I take it?"},{"name":"Q4","text":"Accompany the Resistance fighter to Alliance Headquarters?"},{"name":"CONVEYOR03783","text":"Valdeaulin has briefed me on our mission."},{"name":"CONVEYOR03783","text":"I am to take you as far as our expected point of contact with the Ruby Weapon. Once we arrive, the rest is up to you, I'm afraid."},{"name":"SHADOWHUNTER","text":"Not only are the Ruby Weapon's claws as quick as lightning, they move with an uncanny degree of flexibility, and can strike from where you least expect it."},{"name":"VALDEAULIN","text":"Given all we've come to expect from the Ascians, it wouldn't surprise me if they were behind the summoning of whatever primals the Ruby Weapon has absorbed."},{"name":"SEVERA","text":"Though I will not be able to join the battle with the Ruby Weapon, I have been tasked with keeping an escape route back to the Eorzean front clear, should you need to make a hasty retreat."},{"name":"CONVEYOR03783","text":"I am to take you as far as our expected point of contact with the Ruby Weapon. Once we arrive, the rest is up to you."},{"name":"SHADOWHUNTER","text":"Even from afar your figure was unmistakable. As ever, an impressive display."},{"name":"SHADOWHUNTER","text":"Though as I am sure you will concur, the Ultima Weapon pales in comparison to this new monstrosity. If their research is allowed to continue, the next model will be nigh on unstoppable."},{"name":"SHADOWHUNTER","text":"With that in mind, the Alliance has enlisted the help of─ Wait. I hear something."},{"name":"SHADOWHUNTER","text":"Here to sift through what remains of the Ruby Weapon, are you?"},{"name":"ALFONSE","text":"(-Imperial Soldier-)Allie! What do you think you're doing!?"},{"name":"SHADOWHUNTER","text":"Allie?"},{"name":"ALFONSE","text":"(-Imperial Soldier-)Father!"},{"name":"SHADOWHUNTER","text":"It has been too long, Alfonse. And you too, Rex."},{"name":"SHADOWHUNTER","text":"Given that the Empire is proceeding with the Weapon project and making inroads into Eorzea, I suppose it was only a matter of time until our paths crossed."},{"name":"REX","text":"It's wonderful to see you again, Father, although I can't say I think much of the company you've been keeping."},{"name":"ALLIE","text":"I know a lot's happened, but I'm just glad you're all right. And now...you can come back to Garlemald with us!"},{"name":"SHADOWHUNTER","text":"My days serving the Empire are over."},{"name":"ALLIE","text":"Because you're suspected of assassinating Emperor Varis?"},{"name":"ALLIE","text":"But we know you'd never do a thing like that! There must be a way to prove your innocence!"},{"name":"ALLIE","text":"Then everything can go back to the way it was..."},{"name":"REX","text":"So he found you two shivering on the roadside when he was going through Werlyt. Lucky for you, eh?"},{"name":"ALFONSE","text":"If he hadn't, we'd probably be dead by now."},{"name":"REX","text":"As for us three, our parents all died in the epidemic. We'd still be begging on street corners if it weren't for him."},{"name":"ALFONSE","text":"I just wish there was a way we could repay Lord Gaius for all the kindness he's shown us."},{"name":"MILISANDIA","text":"He fights for the Empire, so we should, too! That'll make him proud of us."},{"name":"ALFONSE","text":"You're saying we should join the army?"},{"name":"RICON","text":"I don't think that's such a good idea... Everyone in Werlyt was scared of the Garleans. Why would we want to be like them?"},{"name":"ALFONSE","text":"Lord Gaius is different. I know he is."},{"name":"REX","text":"You're right. He always says that the strong should lead the weak. Maybe that's why he took us in."},{"name":"ALFONSE","text":"All right. If becoming a soldier is what it takes, I'll do it. Who's with me?"},{"name":"REX","text":"Count me in! And maybe one day, people'll look up to us like we do Lord Gaius."},{"name":"ALFONSE","text":"Then it's settled. From now on, we're all brothers and sisters fighting for the same cause."},{"name":"ALLIE","text":"Brothers and sisters? Then that would make Lord Gaius our...father?"},{"name":"ALFONSE","text":"Well, if he doesn't mind us calling him that, I suppose so."},{"name":"REX","text":"And that makes you our big brother, since you're the oldest! You'd better be nice to us, or I'm telling Father. Ha ha!"},{"name":"ALLIE","text":"Father... Since you went away, a lot has changed in the Empire. For us, too."},{"name":"ALLIE","text":"If we'd known that you were still out there, still alive, none of this would've happened!"},{"name":"SHADOWHUNTER","text":"What do you mean?"},{"name":"ALLIE","text":"The truth is..."},{"name":"SHADOWHUNTER","text":"If you must go, I will not stop you, but answer me this: who was piloting the Ruby Weapon? We all know that Nael van Darnus has not returned from the dead."},{"name":"REX","text":"Who do you think!?"},{"name":"ALFONSE","text":"It was...Milisandia."},{"name":"SHADOWHUNTER","text":"No... No, I refuse to believe that."},{"name":"SHADOWHUNTER","text":"I refuse to believe you would let that happen. She was a sister to you! To <span class=\"emphasis\">all</span> of you!"},{"name":"ALFONSE","text":"We only want to finish what you started."},{"name":"ALFONSE","text":"And while we will never forget all you have done for us, the next time we meet, it shall be as enemies. Good-bye, Father."},{"name":"REX","text":"As for you, hero of Eorzea, you'll pay for what you did to Milisandia. I swear it."},{"name":"SHADOWHUNTER","text":"..."},{"name":"CID","text":"Well, well. Gaius van Baelsar. We meet again."},{"name":"CID","text":"Come to see how your precious Weapon project has been proceeding in your absence, have you?"},{"name":"SHADOWHUNTER","text":"You are come to collect data on the Ruby Weapon, correct? The pilot...Milisandia should still be inside the cockpit. I will ask Valdeaulin to escort you to the wreckage."},{"name":"CID","text":"Any idea who this Milisandia is? An imperial crony of his, perhaps?"},{"name":"CID","text":"One of the orphans..."},{"name":"CID","text":"Gaius always did have an eye for talent and a mind to nurture it. In fact, Livia sas Junius was another protégé of his."},{"name":"CID","text":"He even took me under his wing when my father became obsessed with the Meteor project. It's strange that I felt closer to Gaius than my own flesh and blood."},{"name":"CID","text":"Then, my father and countless others lost their lives in the Bozja incident. Although he was acting under Emperor Solus's orders, he masterminded the whole thing."},{"name":"CID","text":"I'd begged him to reconsider, to put an end to this madness, but my words fell on deaf ears. That's when I turned to Gaius for support, but he was as much a pawn of the Emperor as my father, and refused to intervene. And when my turn came to serve, I defected and fled to Eorzea."},{"name":"CID","text":"I blamed Gaius as much as any of them, perhaps even more, for the barbaric acts carried out in the name of conquest. But when we met at the Praetorium, all the hatred that had been festering inside me seemed to fade away, and I remembered the man I once respected."},{"name":"CID","text":"To think the dreaded Black Wolf was a mere plaything of the Ascians, who left him broken and disgraced, having sent thousands of his men to early graves. It's more than most could bear. And now the lives of the children he raised hang in the balance."},{"name":"CID","text":"Any personal grievances I have with Gaius can wait. I'd best gather what information I can on the Ruby Weapon, but I'll be back as soon as possible."},{"name":"VALDEAULIN","text":"Gaius wasn't exaggerating when he spoke of your prowess in battle. Unfortunately, it seems a fair few problems remain, and unlike the Ruby Weapon, it might take more than brute force to solve them."},{"name":"SEVERA","text":"After Gaius and I faced the Ruby Weapon, I had thought it to be all but indestructible. I'm glad to be proven wrong on this occasion."},{"name":"SHADOWHUNTER","text":"If Cid is as I remember him, it will not take long for him to finish investigating the remains of the Ruby Weapon. He never was one to waste time."},{"name":"CID","text":"My engineers are still in the field, but there's something I thought you should know right away."},{"name":"CID","text":"It's about the pilot. I'm not sure how to tell you this, but..."},{"name":"SHADOWHUNTER","text":"If Milisandia is dead, I only hope she was not made to suffer."},{"name":"CID","text":"Death would have been a kindness... In all my years, I've never seen such a perversion of science and nature."},{"name":"CID","text":"Her body was fused with the Ruby Weapon's core! Those last moments must have been spent in pure agony as her very life's essence was drained from her."},{"name":"SHADOWHUNTER","text":"So, she was sacrificed to power that infernal machine."},{"name":"VALDEAULIN","text":"We must act quickly if we are to prevent the Empire from committing further atrocities. <span class=\"highlight\">Forename</span>, is there any other information you can share with us regarding the Ruby Weapon prior to its...deactivation?"},{"name":"SHADOWHUNTER","text":"Nael van Darnus? Did the legatus mean that much to Milisandia?"},{"name":"CID","text":"From what I gather, it sounds as if data based on Nael's combat capabilities was used to override the pilot's consciousness after she was fused with the core."},{"name":"CID","text":"If this technology is perfected and the Empire begins implanting the memories of renowned warriors such as the White Raven into its soldiers, the Alliance won't stand a chance."},{"name":"SHADOWHUNTER","text":"Is such a thing even possible?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"That's more or less how soul crystals work."},{"name":"A2","text":"A similar method of transference was used on the prototype Estinien fought, was it not?"},{"name":"SHADOWHUNTER","text":"Yes, it seems that such crystals are in common use throughout Eorzea. An ancient but effective means of passing on knowledge from one generation to the next."},{"name":"SHADOWHUNTER","text":"Your friend did mention he overheard the signiferi loading various sets of data into the test model during the battle. It would appear that the system has been improved since then."},{"name":"CID","text":"While it may bear some similarities, we won't know for certain until we've analyzed the wreckage of the Ruby Weapon."},{"name":"SHADOWHUNTER","text":"It cannot be denied that combining combat data from an experienced soldier with the powers of an eikon has yielded remarkable results. But in doing so, the Empire has sunk to the very depths of depravity. This is beyond forgiveness."},{"name":"VALDEAULIN","text":"For once, I agree with you. Yet one question remains unanswered: how were they able to obtain data on someone who was supposedly killed prior to the Calamity?"},{"name":"CID","text":"That's what I'm trying to determine. There is one possibility I'd like to explore, but I'll need to carry out a more thorough investigation first."},{"name":"SHADOWHUNTER","text":"Severa will provide support while you are in the field. Not only is she extremely well versed in the latest in Garlean technology, there are few soldiers I would rather have watching my back."},{"name":"SHADOWHUNTER","text":"In the meantime, Valdeaulin and I will follow the Ruby Weapon's tracks back to its point of origin."},{"name":"SHADOWHUNTER","text":"We will learn what we can of the Weapon project and the manner in which Alfonse and the others are involved."},{"name":"SHADOWHUNTER","text":"Should we uncover anything of value, we will relay it to the troops stationed here. For now, I suggest you use this lull in Garlean activity to recuperate."},{"name":"VALDEAULIN","text":"Would I be correct in guessing that this belated reunion with those darling orphans of yours has stirred up memories of your time in Garlemald?"},{"name":"VALDEAULIN","text":"Remember our agreement, Gaius."},{"name":"VALDEAULIN","text":"If you so much as think of returning to your imperial masters, I <span class=\"emphasis\">will</span> kill you."},{"name":"SEVERA","text":"If the cockpit remained intact, we may be able to glean information from the pilot."},{"name":"RESISTANCEOFFICER","text":"So, you put down the Ruby Weapon? Gods, I wish I could've seen it! Not from too close, mind."},{"name":"RESISTANCEOFFICER","text":"I suppose I should report news of your victory to the higher-ups. I realize you must've been through quite the ordeal, but could you give me a quick summary of the battle?"},{"name":"RESISTANCEOFFICER","text":"You make it sound so easy! From the way you tell it, anyone would think you slay hulking brutes like that for a living! I'll put all of this into a report, and leave a copy over there, should you fancy a bit of light reading."},{"name":"RESISTANCEOFFICER","text":"Anyway, I expect you've got more pressing matters to take care of, like going for a celebratory pint. If the Garleans pluck up the courage to come knocking again, we'll let you know. Until then, rest up!"},{"name":"SYSTEM","text":"Meanwhile, in the Werlyt magitek installation..."},{"name":"ALLIE","text":"We should've told him the truth! He'd be able to help us, I know he would!"},{"name":"ALFONSE","text":"That's exactly the problem, Allie. If he knew the true nature of the Weapon project, he'd find some way to interfere."},{"name":"ALFONSE","text":"We've come too far to back down now. I won't let Milisandia's death be in vain."},{"name":"ALFONSE","text":"Even if that means going against Father's wishes."},{"name":"REX","text":"Cheer up, Alfonse. We can all go back to being one big happy family after we've dealt with those pesky Eorzeans. It'll be just like old times."},{"name":"RICON","text":"If only it were that simple. There's no guarantee any of us'll make it back alive."},{"name":"REX","text":"Excuse me? I think you're forgetting whose turn it is next, O ye of little faith! With me at the helm of the Sapphire Weapon, it'll be over before you know it."},{"name":"ALLIE","text":"Whatever happens, Rex, promise you'll come back to us. I couldn't bear to lose you too."},{"name":"WEAPONSGIENGINEER","text":"Did you see that Weapon? Ah, of course you did, how silly of me! What I wouldn't give for the secrets of that armor plating!"}],"reward":{"gil":4255,"instance":20068},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69297]},"next":[69378,69431]},"partials":[{"type":"npc","id":"1032581","obj":{"i":1032581,"n":"Resistance Officer","l":2408,"q":1}},{"type":"npc","id":"1032586","obj":{"i":1032586,"n":"Resistance Officer","l":2408,"q":6}},{"type":"instance","id":"20068","obj":{"i":20068,"n":"Cinder Drift","c":61804,"t":"Trials","min_lvl":80,"max_lvl":80,"min_ilvl":455}},{"type":"quest","id":"69297","obj":{"i":69297,"n":"Old Enemies, New Threats","g":9,"l":"The Rising Stones","s":110}},{"type":"quest","id":"69378","obj":{"i":69378,"n":"Weapon of Choice","g":0,"l":"The Lochs","s":0,"f":1}},{"type":"quest","id":"69431","obj":{"i":69431,"n":"Sleep Now in Sapphire","g":25,"l":"The Lochs","s":20,"f":1}}]}