{"quest":{"name":"Unto the Morrow","location":"Il Mheg","id":69317,"patch":5.3,"sort":310,"eventIcon":71201,"issuer":1033872,"target":1033884,"genre":9,"journal":["Urianger regards you with a gentle smile."],"objectives":["Speak with Y'shtola in Slitherbough.","Speak with Y'shtola.","Speak with Magnus at Twine.","Speak with Ryne in the Crystarium.","Speak with Thancred."],"dialogue":[{"name":"URIANGER","text":"Now, assuming thou intendest to continue thy tour, might I suggest Slitherbough as thy next destination?"},{"name":"URIANGER","text":"The task of tidying up one's abode is seldom light work, yet I suspect Y'shtola's is heavier than most. Suffice it to say, a pair of helping hands might not go amiss."},{"name":"URIANGER","text":"Given its specificity to the Source, yon elemental chart is perhaps best removed."},{"name":"URIANGER","text":"Yet I cannot help but imagine what might unfold were a native of the First to chance upon it... What questions it would conjure in the mind of its discoverer...and whither their curiosity might lead them... 'Twould make for the beginnings of a grand adventure, would it not?"},{"name":"YSHTOLA","text":"And what is this? Have you come to spy on me?"},{"name":"YSHTOLA","text":"...Does Urianger truly think me so slovenly? The nerve."},{"name":"YSHTOLA","text":"Loath as I am to disappoint, I put my affairs in order some time ago. I've even bade my farewells."},{"name":"YSHTOLA","text":"To everyone save Runar, that is. He's nowhere to be seen..."},{"name":"RUNAR","text":"Please take good care of Master Matoya. See that she eats well, and wraps up warm on cold days."},{"name":"RUNAR","text":"Ah, and there is a herbal tea which she enjoys! If I give you the recipe, you could make it for her, perhaps? And, uh...uh..."},{"name":"RUNAR","text":"Above all─please keep her close. I do not deny that she is strong, but even the strongest among us should not be alone."},{"name":"YSHTOLA","text":"Honestly, he's a boy in the body of a man... &lt;sigh&gt;"},{"name":"YSHTOLA","text":"<span class=\"emphasis\">Anyway</span>, it is time we headed back to the Crystarium. Shall we?"},{"name":"YSHTOLA","text":"...You still have to take the <span class=\"emphasis\">Exarch</span> to Nabaath Areng? I see. Very well, you can look in on Thancred while you're about it."},{"name":"YSHTOLA","text":"His will be a difficult farewell, and I am sure he would appreciate your support."},{"name":"YSHTOLA","text":"The path goes through Twine. If you wait there, you are like to meet him on his way back, if not before."},{"name":"YSHTOLA","text":"As I make my way out of the wood, I shall call to mind all that I learned during my time here. And I shall picture the day of my return."},{"name":"YSHTOLA","text":"I know not when it will be, but mark my words, I <span class=\"emphasis\">will</span> learn to traverse the rift."},{"name":"THAFFE","text":"Ah, it's you! Good to see you looking none the worse for wear!"},{"name":"JERYK","text":"Let me guess: you're here to ride the trolley too. Don't ask me how I know─I can just tell!"},{"name":"MAGNUS","text":"Eh? You too? What is this, my bloody nameday?"},{"name":"MAGNUS","text":"I see, I see. Yes, Thancred was here─and Ryne too. They said they wanted to go to Nabaath Areng, so we gave them the use of the trolley."},{"name":"JERYK","text":"That's right, the old girl's up and running again! But we didn't just put her back together, mind you!"},{"name":"JERYK","text":"No, with a little bit of help from Master Chai..."},{"name":"JERYK","text":"We made her faster!"},{"name":"JERYK","text":"And stronger!"},{"name":"JERYK","text":"Ohhh yes, the future of trolleys is looking brighter than ever! Whisper it, but I reckon it might be time─time to <span class=\"emphasis\">reach for the stars</span> with a trolley to dwarf all trolleys!"},{"name":"THAFFE","text":"If you ask me, we'd be better off making them smaller. That way, they can fit in narrow shafts."},{"name":"JERYK","text":"But that─ That's <span class=\"emphasis\">genius</span>! Why didn't I think of that!?"},{"name":"MAGNUS","text":"Enough. You can daydream in your own time. In case you've forgotten, our priority is to have more working trolleys."},{"name":"MAGNUS","text":"<span class=\"emphasis\">That's</span> why we turned to Chai-Nuzz, by the way─not to make the one trolley we've got go faster. We needed help getting a few Talos back in working order, see."},{"name":"MAGNUS","text":"We were out testing 'em when your airship came down, as a matter of fact. You seem to have a habit of crashing things..."},{"name":"THANCRED","text":"We're back. Our thanks for the loan of the trolley."},{"name":"THANCRED","text":"...<span class=\"highlight\">Forename</span>? What are you doing here? Don't tell me the others are waiting for us?"},{"name":"THANCRED","text":"That's a relief. At any rate, we've done what we came to do─which means I'm ready to leave. Or as ready as I'll ever be."},{"name":"MAGNUS","text":"Not to pry, but what's going on? You off somewhere?"},{"name":"THANCRED","text":"You could say that..."},{"name":"MAGNUS","text":"So you're heading home. I'm just a simple miner and don't know much about this world-traversing business..."},{"name":"MAGNUS","text":"But the young lady here─she'll be looked after, will she?"},{"name":"RYNE","text":"I'll be fine, thank you. I have a place to stay at the Crystarium, and don't want for anything."},{"name":"RYNE","text":"Besides which, I've recently made a new friend. Her name is Gaia, and she'll always be there if I need her. Just like you lot."},{"name":"RYNE","text":"Besides which, I've no shortage of friends I can turn to. Friends like you lot."},{"name":"RYNE","text":"So please don't worry. I'll be fine, really."},{"name":"MAGNUS","text":"If you say so..."},{"name":"MAGNUS","text":"It being a matter of life and death, I suppose you <span class=\"emphasis\">have</span> to leave."},{"name":"MAGNUS","text":"But I for one would still be torn. If the choice were mine, I'm not sure I could bear to be parted from my family."},{"name":"THANCRED","text":"No. But it's for the best. Ryne has chosen to walk her own path, and she doesn't need me under her feet."},{"name":"THANCRED","text":"Besides, I have my own responsibilities, and I wouldn't be setting a very good example if I neglected them."},{"name":"MAGNUS","text":"Hmph. Perhaps not. Either way, I envy you your dilemma."},{"name":"MAGNUS","text":"Well then, young lady... If there's anything you need─anything at all─you're to call on us. It may surprise you, but we can do more than simply offer you trolley rides."},{"name":"RYNE","text":"Thank you, Magnus. Everyone."},{"name":"THANCRED","text":"Shall we, then?"},{"name":"RYNE","text":"If you've nowhere left to visit, we can go back to the Crystarium together."},{"name":"MAGNUS","text":"Bugger me, I forgot to thank Thancred..."},{"name":"MAGNUS","text":"When you get the chance, tell him I'm glad we had that little talk. And tell him we'll look out for the girl."},{"name":"THAFFE","text":"When it comes to families, you'd think together was best, but it's not always that simple, is it? Never really thought about it, what with my parents being long gone."},{"name":"THAFFE","text":"The people in this town are the closest thing to family I've got. And to be fair, I'd hate to leave them. Which is why I'm not going anywhere!"},{"name":"JERYK","text":"Mark my words, <span class=\"highlight\">Forename</span>: one day, Twine will thrive again, and I hope that Thancred can come back to see it. Him and that funny-talking, fortune-teller bloke!"},{"name":"ALPHINAUD","text":"I thought that it would be easier after saying farewell, but each step I took out of Eulmore felt heavier than the last..."},{"name":"ALISAIE","text":"I did everything I could in the time I had. No regrets."},{"name":"THANCRED","text":"This is it, then..."},{"name":"URIANGER","text":"I took the liberty of informing the Crystarium's leaders of our imminent departure. It seemed only right."},{"name":"YSHTOLA","text":"I trust the Exarch had a pleasant tour of the realm."},{"name":"RYNE","text":"Oh, it's you... You're probably wondering why I'm not with the others."},{"name":"RYNE","text":"&lt;sigh&gt; It's just...I always knew that everyone would leave one day. And I always hoped and prayed that we would find a way to send them home. But now that the time has come, I just feel...lost. Lost and lonely."},{"name":"RYNE","text":"I don't want our last moments together to be sad. I want to hold myself together, just long enough to say the things that I need to say. But I'm not sure I can even do that..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll be there with you."},{"name":"A1","text":"You can do it, Ryne."},{"name":"RYNE","text":"&lt;sniff&gt; Right."},{"name":"RYNE","text":"Thank you, <span class=\"highlight\">Forename</span>. I think we all feel braver with you around. Go on ahead and join the others. I'll be along after I've taken a few deep breaths."},{"name":"RYNE","text":"Thank you, <span class=\"highlight\">Forename</span>. I feel braver already. &lt;sniff&gt; Go on ahead and join the others. I'll be along after I've taken a few deep breaths."},{"name":"RYNE","text":"In...and out... &lt;sigh&gt;"}],"reward":{"items":[{"id":30868}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69316]},"next":[69318]},"partials":[{"type":"npc","id":"1033872","obj":{"i":1033872,"n":"Urianger","l":2956,"q":2}},{"type":"npc","id":"1033884","obj":{"i":1033884,"n":"Thancred","l":2951,"q":1}},{"type":"item","id":"30868","obj":{"i":30868,"n":"Wind-up Mystel","l":1,"c":59781,"t":81}},{"type":"quest","id":"69316","obj":{"i":69316,"n":"The Journey Continues","g":9,"l":"Eulmore","s":300}},{"type":"quest","id":"69318","obj":{"i":69318,"n":"Reflections in Crystal","g":9,"l":"The Crystarium","s":320}}]}