{"quest":{"name":"Nothing Unsaid","location":"The Crystarium","id":69315,"patch":5.3,"sort":290,"eventIcon":71201,"issuer":1033860,"target":1033868,"genre":9,"journal":["Y'shtola's eyes seem to be staring into your very soul."],"objectives":["Speak with Alisaie.","Speak with Alisaie at the Inn at Journey's Head.","Search for Halric.","Speak with Alisaie.","Travel to Eulmore.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"At such moments, it is hard to know what to say...<br>...Are you all right, my friend?"},{"name":"ALISAIE","text":"You did well, <span class=\"highlight\">Forename</span>─you and the Exarch..."},{"name":"THANCRED","text":"Shortly after you left, we observed that our enemy's ranks were no longer being replenished─presumably when your absence was noted. So we polished them off and came as quickly as we could."},{"name":"THANCRED","text":"...Which is to say, not quickly enough. But then you had the Exarch for company, didn't you, and you could ask for no better than that."},{"name":"URIANGER","text":"Ere we descended from the throne room, I did chance upon an object which, if I have the right of it, did once─"},{"name":"URIANGER","text":"...Hm. M-Mine apologies. Mayhap now is not an appropriate time. Let us speak of it later."},{"name":"RYNE","text":"The only way is forward. So I have to believe that whatever lies ahead will be better than what came before."},{"name":"YSHTOLA","text":"<span class=\"highlight\">Forename</span>. If you are ready, would you recount to us how the day unfolded?"},{"name":"YSHTOLA","text":"...So you reached out to Elidibus at the last...and his heart was moved."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm not sure I did the right thing."},{"name":"A1","text":"And it changed nothing."},{"name":"A1","text":"I only did as you asked."},{"name":"YSHTOLA","text":"Perhaps you did. Perhaps you did not. None can say."},{"name":"YSHTOLA","text":"Perhaps not. Ultimately, you had no choice but to strike him down."},{"name":"YSHTOLA","text":"I suppose you did."},{"name":"YSHTOLA","text":"But the important thing is this: though violence proved unavoidable, you did at least come to understand your foe."},{"name":"YSHTOLA","text":"And in knowing his hopes and dreams do we best remember him─him and his legacy."},{"name":"YSHTOLA","text":"So long as they remain unforgotten, the love he and his brethren bore for one another and the star may yet be rewarded."},{"name":"ALPHINAUD","text":"You said that an ancient came to your aid. But how is that possible?"},{"name":"YSHTOLA","text":"A gift from Emet-Selch. He knew of Elidibus's plight. Foreseeing his own death, he made provisions to bring Elidibus's suffering to an end, lest his friend be left to continue the struggle alone."},{"name":"YSHTOLA","text":"Or so I wildly speculate. It is unlikely we will ever know the truth."},{"name":"YSHTOLA","text":"The best we can do is to remember events as they happened, no more and no less. As the Ronkans so rightly put it, “History is learned, not lived.”"},{"name":"BEQLUGG","text":"(-???-)Ah! There you all are!"},{"name":"URIANGER","text":"My friend! We were given to understand thou wert injured. Shouldst thou not be abed?"},{"name":"BEQLUGG","text":"Lie down at a time like this!? Don't be absurd! I would have come sooner had the guards not made such a fuss!"},{"name":"BEQLUGG","text":"Now, tell me what's happened. Where is the Exarch?"},{"name":"BEQLUGG","text":"I see..."},{"name":"BEQLUGG","text":"<span class=\"highlight\">Forename</span>... Will you show me his spirit vessel?"},{"name":"BEQLUGG","text":"Yes... Both his soul and memories seem intact. Good."},{"name":"BEQLUGG","text":"Unlike the others, his aether was not highly charged, and so it did not seem necessary to employ a familiar for the imbuing. But I needed to be certain all the same. Oh, what a relief..."},{"name":"URIANGER","text":"Then 'tis but a question of restoring his soul unto his flesh."},{"name":"URIANGER","text":"And as thou didst lately tell me, the success of this process resteth on no more than our friend's soul recognizing his flesh as its own."},{"name":"THANCRED","text":"Given his apparent desire to return to the Source with <span class=\"highlight\">Forename</span>, one would think his soul would be only too happy to be home, no? Surely it wouldn't balk at the relative newness of its accommodation?"},{"name":"BEQLUGG","text":"So one would hope, but none can speak for the Exarch's heart of hearts. And he can no longer speak for himself."},{"name":"BEQLUGG","text":"Furthermore, though I have drawn upon all of my not inconsiderable experience to predict the outcome, the fact remains that there is no direct precedent for what we are attempting."},{"name":"BEQLUGG","text":"Will his body accept his soul? Will his essences blend properly? Will he awaken whole of mind? Any number of things could go awry."},{"name":"BEQLUGG","text":"...Assuming I have succeeded in tempering your expectations, I should probably add that I <span class=\"emphasis\">did</span> ask the Exarch if he still wished to return to the Source in full knowledge of the risks."},{"name":"BEQLUGG","text":"A simple enough question, one would think, warranting a single-word reply. Yet the answer I received was rather longer than that. Almost comically so, in fact. Regardless, out of respect for the man, I shall attempt to recite it─with a certain amount of poetic license. Ahem!"},{"name":"BEQLUGG","text":"“As I grew older, the burdens I carried became ever more numerous. Burdens which weighed upon my hopes, burying them deep within my breast. So deep that I couldn't be certain they were still there."},{"name":"BEQLUGG","text":"“But when I look around me, I am reminded that, no matter how deeply buried they may be, our hopes never truly disappear. No, they are always with us. Guiding us. Driving us."},{"name":"BEQLUGG","text":"“I see it in Vauthry, who sought to vindicate his existence by creating his paradise."},{"name":"BEQLUGG","text":"“I see it in Ran'jit, who forsook his life's cause in order to protect that which he held most dear."},{"name":"BEQLUGG","text":"“I see it in the people, who chose to struggle rather than surrender to despair."},{"name":"BEQLUGG","text":"“And though our struggles may differ greatly, since the very beginning of time, they have all shared that one common thread: hope."},{"name":"BEQLUGG","text":"“We struggle because we have hope. And when the time comes, I too will embrace mine. I will follow my heart, regardless of the risks."},{"name":"BEQLUGG","text":"“And I will live with all my being, as befits one who has been granted a second chance.”"},{"name":"BEQLUGG","text":"There! I told you it was long. And unspeakably sentimental to boot. One would think them the outpourings of a dewy-eyed boy, not the <span class=\"emphasis\">old man</span> the Exarch seems to believe he is."},{"name":"BEQLUGG","text":"I mean, <span class=\"emphasis\">really</span>─he's scarcely been alive as long as I've been in hiding!"},{"name":"YSHTOLA","text":"I daresay he is blushing in his vessel."},{"name":"YSHTOLA","text":"Speaking of which, we should make ready for our journey. Time remains of the essence, after all."},{"name":"YSHTOLA","text":"Needless to say, once we leave, there is no guarantee that we can return. If anyone has unfinished business, now is the time to see to it."},{"name":"YSHTOLA","text":"I must pay a visit to Slitherbough. Let us reconvene here anon."},{"name":"URIANGER","text":"Hm... There remain some few matters which require mine attention in Il Mheg."},{"name":"URIANGER","text":"May I leave Thancred in thy care, child?"},{"name":"RYNE","text":"Um...I've been meaning to get some flowers. For Minfilia."},{"name":"RYNE","text":"I thought you might help me choose them. And then we could go to Nabaath Areng together...one last time."},{"name":"THANCRED","text":"A fine suggestion. Lead on."},{"name":"ALPHINAUD","text":"Well, it's back to Eulmore for me. Amongst other things, I owe the mayor an apology about his airship."},{"name":"ALPHINAUD","text":"I assume you have places of your own to be, Alisaie. I shall see you later."},{"name":"BEQLUGG","text":"I shall take this opportunity to conduct a final inspection of the spirit vessels. Given what is at stake, one can never be too thorough."},{"name":"ALISAIE","text":"As you've probably guessed, I'm going to pay a visit to the Inn at Journey's Head. But I want you to come too."},{"name":"ALISAIE","text":"I realize you don't need to say any farewells."},{"name":"ALISAIE","text":"But the Exarch does, if only in spirit. So I thought you might bring him along, so to speak."},{"name":"ALISAIE","text":"I'm sure he'd love the thought of being lugged about on his hero's back."},{"name":"ALISAIE","text":"So let's be off, shall we? I can't wait to see how Halric's doing!"},{"name":"ALISAIE","text":"Halric? Halric! Oh gods, don't tell me he's wandered off again?"},{"name":"ALISAIE","text":"Quickly, <span class=\"highlight\">Forename</span>! We have to find him!"},{"name":"WILLFORT","text":"Oh, Alisaie! I didn't see you there. If you're looking for Halric, he's gone for a walk with one of the others. They were planning to visit the graveyard, if I'm not mistaken."},{"name":"ALISAIE","text":"Well, that's a relief. Shall we adjourn to the graveyard, then?"},{"name":"JOURNEYSHEADNURSE","text":"Oh, greetings, <span class=\"highlight\">Forename</span>! Looking for Halric, by any chance?"},{"name":"ALISAIE","text":"There he is. I was afraid he'd wandered off again."},{"name":"JOURNEYSHEADNURSE","text":"Oh, there's no need to worry─Halric's safe and well. He's been showing good progress, and likes to go for walks of late."},{"name":"JOURNEYSHEADNURSE","text":"Though his steps usually bring him to this particular spot..."},{"name":"ALISAIE","text":"Oh? I wasn't aware he had family here."},{"name":"JOURNEYSHEADNURSE","text":"He doesn't. It's Tesleen. Her sword, that is."},{"name":"JOURNEYSHEADNURSE","text":"We buried it here in her honor."},{"name":"ALISAIE","text":"So he remembers..."},{"name":"JOURNEYSHEADNURSE","text":"What brings you back so soon, out of interest? I didn't think the next round of treatments was due yet."},{"name":"ALISAIE","text":"Uh...no. It isn't. Look─I realize this is sudden...but I've come to say good-bye. It's time for me to return home."},{"name":"ALISAIE","text":"But rest assured the treatments will continue. Beq Lugg will come to oversee them in my stead."},{"name":"JOURNEYSHEADNURSE","text":"I see... You did mention that you and your friends were searching for a way home."},{"name":"JOURNEYSHEADNURSE","text":"Needless to say, we'll be sorry to see you go─but I know everyone will be happy for you. Truly."},{"name":"JOURNEYSHEADNURSE","text":"Happy and grateful. You've done so much for us. Achieved what none of us dared hope was possible."},{"name":"JOURNEYSHEADNURSE","text":"And we'll see to it that your good work continues, and that no more poor souls are buried here before their time."},{"name":"JOURNEYSHEADNURSE","text":"So rest easy, and take care. We wish you every happiness."},{"name":"ALISAIE","text":"Thank you. I will miss you all."},{"name":"ALISAIE","text":"But it isn't time to say our farewells quite yet. So if there are any tasks that need doing─hunting beasts, fetching water, and what have you─just say the word."},{"name":"ALISAIE","text":"I mean to make use of every last moment here. After all..."},{"name":"HALRIC","text":"The time left to you...is precious..."},{"name":"ALISAIE","text":"That's right, Halric... That's exactly right."},{"name":"ALISAIE","text":"Those words will guide you true. So never forget them."},{"name":"ALISAIE","text":"And neither will I."},{"name":"HALRIC","text":"Take...care..."},{"name":"JOURNEYSHEADNURSE","text":"Thank you for coming to see Halric, <span class=\"highlight\">Forename</span>. And Tesleen as well."},{"name":"JOURNEYSHEADNURSE","text":"She did always enjoy having visitors. And none were more welcome than you and Alisaie."},{"name":"ALISAIE","text":"<span class=\"emphasis\">What</span>? I'm not crying! I just have sand in my eye, that's all."},{"name":"ALISAIE","text":"...Ahem. As I mentioned, I mean to stay here as long as possible. In the meantime, perhaps you could go and look in on the others?"},{"name":"ALISAIE","text":"Alphinaud, for instance. If <span class=\"emphasis\">anyone</span> is crying, it will be him!"},{"name":"ALISAIE","text":"What are you still doing here? Hurry over to Eulmore and look in on Alphinaud. Oh, and send my regards to the Chais."},{"name":"CHAINUZZ","text":"I hear the airship crashed in Amh Araeng. Never mind. The important thing is you're all safe and well."},{"name":"CHAINUZZ","text":"That said, we should probably retrieve the wreck before the locals strip it for trolley parts. Or perhaps we can make a trade of it..."},{"name":"DULIACHAI","text":"Oh, thank goodness <span class=\"emphasis\">you</span> can still return! If I had to bid farewell to you both, my heart would burst here and now!"},{"name":"DULIACHAI","text":"Like Alphinaud, I know that yours is a life of constant employment, but do visit us from time to time. It would mean the world to us."},{"name":"WRENDEN","text":"I understand the Exarch will be leaving with you. Capable though its custodians are, the Crystarium will be poorer for his absence."},{"name":"WRENDEN","text":"It seems the coming years will be a period of transition for both of our cities... But through mutual cooperation, I am confident we will find a way forward."},{"name":"ALPHINAUD","text":"'Tis a strange feeling, <span class=\"highlight\">Forename</span>. To stand in the company of our friends, knowing that I will never see them again... I struggle to reconcile it in my mind."},{"name":"ALPHINAUD","text":"But this I know: I shall cherish my memories of Norvrandt─of every soul I met here─for the rest of my days."},{"name":"ALPHINAUD","text":"And I shall look forward to your tales of their endeavors."}],"reward":{"gil":1687},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69314]},"next":[69316]},"partials":[{"type":"npc","id":"1033860","obj":{"i":1033860,"n":"Y'shtola","l":2951,"q":1}},{"type":"npc","id":"1033868","obj":{"i":1033868,"n":"Alphinaud","l":2952,"q":2}},{"type":"quest","id":"69314","obj":{"i":69314,"n":"Hope's Confluence","g":9,"l":"The Crystarium","s":280}},{"type":"quest","id":"69316","obj":{"i":69316,"n":"The Journey Continues","g":9,"l":"Eulmore","s":300}}]}