{"quest":{"name":"The Journey Continues","location":"Eulmore","id":69316,"patch":5.3,"sort":300,"eventIcon":71201,"issuer":1033868,"target":1033872,"genre":9,"journal":["His business concluded, Alphinaud turns his attention to yours."],"objectives":["Speak with Urianger at the Bookman's Shelves.","Deliver the faded Crystal of Light to Seto.","Speak with Urianger."],"dialogue":[{"name":"CHAINUZZ","text":"I hear the airship crashed in Amh Araeng. Never mind. The important thing is you're all safe and well."},{"name":"CHAINUZZ","text":"That said, we should probably retrieve the wreck before the locals strip it for trolley parts. Or perhaps we can make a trade of it..."},{"name":"DULIACHAI","text":"Oh, thank goodness <span class=\"emphasis\">you</span> can still return! If I had to bid farewell to you both, my heart would burst here and now!"},{"name":"DULIACHAI","text":"Like Alphinaud, I know that yours is a life of constant employment, but do visit us from time to time. It would mean the world to us."},{"name":"WRENDEN","text":"I understand the Exarch will be leaving with you. Capable though its custodians are, the Crystarium will be poorer for his absence."},{"name":"WRENDEN","text":"It seems the coming years will be a period of transition for both of our cities... But through mutual cooperation, I am confident we will find a way forward."},{"name":"ALPHINAUD","text":"Forgive me. I realize now that I never asked you what business brought you here. Can I be of assistance?"},{"name":"ALPHINAUD","text":"...Alisaie said that, did she? Well, as you can see, I am quite all right now─unlike <span class=\"emphasis\">her</span>, by the sound of it. Ahem. Perhaps you might consider visiting Urianger next?"},{"name":"ALPHINAUD","text":"Given his conversance with the idiosyncrasies of the fae folk, I doubt it will be an issue, but a small part of me worries that they may not relinquish him willingly. As such, I would feel better if you were to look in on our friend─assuming you have the time, of course."},{"name":"ALPHINAUD","text":"I still need to say my farewells to a few others here. Pray look in on Urianger, and I shall see you at the Crystarium."},{"name":"URIANGER","text":"Ha! That I should have the pleasure of welcoming a guest, even as mine own occupation draweth to a close. What bringeth thee hither, my friend?"},{"name":"URIANGER","text":"So thou wouldst grant the Exarch a final tour of the realm which hath been his home these hundred years? A noble gesture."},{"name":"URIANGER","text":"As for Master Alphinaud's concerns, thou may'st rest assured that all is well here. Far from detaining me, our fae friends have agreed to assist in the transportation of these tomes unto the Cabinet of Curiosity. Naught more remaineth to be done."},{"name":"URIANGER","text":"Regardless, 'tis well that thou didst come, for I had been meaning to show something to thee."},{"name":"URIANGER","text":"An object I chanced to find after thy victory over Elidibus."},{"name":"URIANGER","text":"Though it hath lost its radiance, 'tis unmistakably a Crystal of Light. One that did, in all likelihood, once belong to Ardbert."},{"name":"URIANGER","text":"Having been interred with his body, it would have remained upon his person after his possession by Elidibus."},{"name":"URIANGER","text":"And when his mortal form was─forgive mine indelicacy─consumed by thy foe to fuel his transformation, I posit that the crystal did tumble free."},{"name":"URIANGER","text":"Save that which doth abide in thee, it is all that remaineth of our friend. And if thou art willing, I would have thee deliver it unto Seto. I can think of no worthier recipient than he─and no more fitting a bearer than thee."},{"name":"URIANGER","text":"As ever, thou wilt find the amaro in Wolekdorf. My thanks, <span class=\"highlight\">Forename</span>."},{"name":"URIANGER","text":"The crystal shall grant Seto a measure of comfort, I believe. And to receive of it from thee shall only add to its meaning."},{"name":"SETO","text":"Ah, full glad am I to see you safe and well. Rumors spoke of strange, spectral foes bent on your destruction..."},{"name":"SETO","text":"But with the sky returned to normal, I assume all is well again. So, to what do I owe the pleasure of this visit?"},{"name":"SETO","text":"Thank you, <span class=\"highlight\">Forename</span>. For taking care of Ardbert."},{"name":"SETO","text":"May your adventures together take you beyond the farthest horizons. And may they always lead you safely home."},{"name":"URIANGER","text":"Ah, thou art returned. Tell me, how did Seto receive thine offering?"},{"name":"URIANGER","text":"...Remarkable. 'Twas fated that thou shouldst be the one to undertake this task, I think."},{"name":"URIANGER","text":"As Ardbert liveth on in thee, so too shall he and his comrades live on in the hearts of the people of Norvrandt."},{"name":"URIANGER","text":"And their tale, now rightly told, shall inspire new Warriors of Light for generations to come."}],"reward":{"items":[{"num":2,"id":29505,"one":1},{"num":2,"id":29497,"one":1},{"num":2,"id":29499,"one":1},{"num":2,"id":27994,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69315]},"next":[69317]},"partials":[{"type":"npc","id":"1033868","obj":{"i":1033868,"n":"Alphinaud","l":2952,"q":2}},{"type":"npc","id":"1033872","obj":{"i":1033872,"n":"Urianger","l":2956,"q":2}},{"type":"item","id":"29505","obj":{"i":29505,"n":"Farmer's Breakfast","l":480,"c":24263,"t":46}},{"type":"item","id":"29497","obj":{"i":29497,"n":"Ovim Meatballs","l":480,"c":24368,"t":46}},{"type":"item","id":"29499","obj":{"i":29499,"n":"Lemon Waffle","l":480,"c":24091,"t":46}},{"type":"item","id":"27994","obj":{"i":27994,"n":"Nightworld Silver Piece","l":385,"c":26001,"t":61}},{"type":"quest","id":"69315","obj":{"i":69315,"n":"Nothing Unsaid","g":9,"l":"The Crystarium","s":290}},{"type":"quest","id":"69317","obj":{"i":69317,"n":"Unto the Morrow","g":9,"l":"Il Mheg","s":310}}]}