{"quest":{"name":"Reflections in Crystal","location":"The Crystarium","id":69318,"patch":5.3,"sort":320,"icon":101011,"eventIcon":71201,"issuer":1033887,"target":1033896,"genre":9,"journal":["Her heart laid bare, Ryne appears to be at peace again.","Having bade the people of the Crystarium an emotional farewell, the moment has come for your fellow Scions to depart for the Source. Together with Ryne, you make your way to the Ocular, where your friends have gathered for the final time.","The air is heavy with anticipation as you take your place in the chamber, and you try unsuccessfully not to think about all the things that could go wrong. After a moment's hesitation, you give the signal to proceed, and Beq Lugg commences the ritual, directing the Scions to commit first their memories to the spirit vessels, and then their very souls. The deed duly done, the crystals and their precious contents are entrusted to your safekeeping. All that remains is for you to step into the mirror and see your friends home.","It is an otherwise ordinary day when you throw open the doors of the Rising Stones and step into its familiar surrounds, but the Twelve know your purpose is anything but ordinary. A few words are enough to convey this fact to Krile and Tataru, who share a tense look before ushering you to the infirmary. The spirit vessels safely in place, you wait with bated breath...and heave a sigh of relief as, one by one, your friends awaken in their own bodies once more. As far as you have come, however, one soul remains to be restored to its rightful home, and thus do you return to the road, bound for the beacon of hope that gleams in the distance...<br><br>Some days later, it is with great jubilation that the Scions welcome a new addition to their ranks: a bright-eyed youth named G'raha Tia. And together with comrades old and new, you set your sights upon the many adventures still to come.","Though you have reached a momentous malmstone in your journey, the road stretches on to places beyond imagining. Yet whatever may lie ahead, and whatever hardships you may face, you have faith that your experiences in the First will give you the strength to forge ever onward."],"objectives":["Speak with Beq Lugg in the Ocular.","Speak with G'raha Tia."],"dialogue":[{"name":"CRYSTALGATEKEEPER","text":"Oh? Begging your pardon, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, but should you not wait for Mistress Ryne?"},{"name":"RYNE","text":"Well, I suppose it's time. Are you ready, <span class=\"highlight\">Forename</span>?"},{"name":"RYNE","text":"All right. Let's not keep the others waiting."},{"name":"CRYSTALGATEKEEPER","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. I have but this moment shown your associates in. Strange to think that I will not have the honor of showing them out again..."},{"name":"CRYSTALGATEKEEPER","text":"But I am informed that you yourself may yet return, and I look forward to welcoming you on that happy day. Now, if you would care to follow me."},{"name":"Q1","text":"Proceed to the Ocular?"},{"name":"ALPHINAUD","text":"I did not expect such a rousing farewell from the people. It was the very thing my spirits needed."},{"name":"ALPHINAUD","text":"Now all that remains is to return to the Source. The Twelve know we have made Krile and Tataru worry long enough."},{"name":"ALISAIE","text":"Angelo stands ready to work his magick on our souls."},{"name":"THANCRED","text":"Since we cannot take our worldly goods with us, I want you to have my gunblade."},{"name":"THANCRED","text":"Use it or sell it, it's all the same to me. So long as it serves you in some way, I will be satisfied."},{"name":"RYNE","text":"...Thank you, Thancred. I'll treasure it."},{"name":"URIANGER","text":"How many times have we few assembled thus in this storied chamber? Many and more, I think."},{"name":"URIANGER","text":"Were the Exarch standing before us, the scene would be complete. Nay─'twould be complete were he standing before us <span class=\"emphasis\">with Emet-Selch smirking in the wings</span>."},{"name":"YSHTOLA","text":"In the spirit of solidarity...I bid you carry the vessels as if <span class=\"emphasis\">your</span> life depended on it."},{"name":"BEQLUGG","text":"Ah, there you are. I take it you are ready for the journey."},{"name":"BEQLUGG","text":"The spirit vessels are primed, and our company complete. At a word from you, we shall begin."},{"name":"SYSTEM","text":"Upon beginning the soul-imbuing ritual, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"Q2","text":"Begin the soul-imbuing ritual and return to the Source with your comrades?"},{"name":"BEQLUGG","text":"Very good. I shall distribute the vessels at once."},{"name":"Q3","text":"Continue with the main scenario quest?"},{"name":"GRAHATIA","text":"Ah, you're back."},{"name":"GRAHATIA","text":"Hm..."},{"name":"GRAHATIA","text":"Tell me, <span class=\"highlight\">Forename</span>. Do you think I was...excessively familiar earlier? In my tone and mannerism?"},{"name":"GRAHATIA","text":"I thought it better to be familiar than formal if we are to be comrades. But now I worry that it may have detracted from the gratitude and respect I harbor for everyone."},{"name":"GRAHATIA","text":"Perhaps we might consider it a nod to my regrettably less-than-humble beginnings...? Yes! Yes, that will do!"},{"name":"GRAHATIA","text":"&lt;sigh&gt; Being free to live as one pleases is not without its challenges... In a way, it was easier when I had a mission that consumed my every waking moment. It provided me with a focus, a constant push in a singular direction."},{"name":"GRAHATIA","text":"By the way, was casting spells <span class=\"emphasis\">always</span> so draining? I had quite forgotten what it was like to do it without the tower. I've rarely felt so exhausted. Or <span class=\"emphasis\">hungry</span>."},{"name":"GRAHATIA","text":"Yet if all I did was bend the bow, I would be of limited use to you on your adventures. So I shall persevere."},{"name":"GRAHATIA","text":"Whoever I might have been before, I am now a Scion─and an inexperienced Scion at that. A green initiate, eager to learn how best to contribute to the cause..."},{"name":"GRAHATIA","text":"...That he might follow in the footsteps of his inspiration!"},{"name":"SYSTEM","text":"G'raha Tia is now available as a Trust companion."}],"reward":{"gil":4500},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69317]},"next":[69511,69521,69543]},"partials":[{"type":"npc","id":"1033887","obj":{"i":1033887,"n":"Ryne","l":2951,"q":1}},{"type":"npc","id":"1033896","obj":{"i":1033896,"n":"G'raha Tia","l":481,"q":1}},{"type":"quest","id":"69317","obj":{"i":69317,"n":"Unto the Morrow","g":9,"l":"Il Mheg","s":310}},{"type":"quest","id":"69511","obj":{"i":69511,"n":"Empty Promise","g":23,"l":"Amh Araeng","s":14,"f":1}},{"type":"quest","id":"69521","obj":{"i":69521,"n":"Safekeeping","g":183,"l":"The Crystarium","s":2}},{"type":"quest","id":"69543","obj":{"i":69543,"n":"Alisaie's Quest","g":10,"l":"The Rising Stones","s":330}}]}