{"quest":{"name":"Hope's Confluence","location":"The Crystarium","id":69314,"patch":5.3,"sort":280,"icon":101010,"eventIcon":71201,"issuer":1033854,"target":1033856,"genre":9,"journal":["The Crystal Exarch is the very picture of resolve.","On your signal, the Exarch lifts the ward, and together you stride into the Crystal Tower to meet with Elidibus.<br><br>※In the event that you leave the instance, you may re-enter by speaking with the Crystarium sentry.","As you wind your way up through the tower, your adversary's incessant summonings take an ever-heavier toll on your companion, eventually bringing him to his knees. His rapidly crystallizing body no longer able to keep up, the Exarch vows to hold the spectral warriors at bay while you go on alone─and so you do, hoping all the while that you will see him again.<br><br>Some time later, you gain the tower's uppermost level, where you come face-to-face with Elidibus at last. In defiance of his fading memories, the Ascian clings to his name and duty, and takes unto himself the power of yet more heroes to arise as the Warrior of Light incarnate. In this puissant form, he unleashes a burst of all-consuming radiance at you, only to look on agog as you emerge unscathed. In your hand shines the constellation crystal you received from Hythlodaeus, while around you an array of arcane rings stand ready to summon champions from beyond the rift to your aid. The odds thus evened, you steel yourself for the decisive battle with your oldest foe.<br><br>※The Seat of Sacrifice can be accessed via the Duty Finder.","The battle unfolds with neither side willing to yield an ilm, but it is ultimately you who delivers the final blow, bringing Elidibus to his knees.","Defiant even in defeat, Elidibus proclaims his own immortality, only for the Exarch to arrive and play his promised trump card. Harnessing the Crystal Tower's vast reservoir of energy, he strips the primal of his power and entraps his scattered essence. Before the Ascian fades into oblivion, however, you choose to restore his lost memories to him, granting him a semblance of peace at the last.<br><br>It is, by any measure, a historic victory, but one not without cost, for it soon becomes clear that the Exarch's exertions have taken a fatal toll. As what remains of his flesh turns into crystal, he begs one last favor of you: a journey together. Comforted by your answer, he entrusts to you his mind and memories before commencing his silent vigil...","Rejoining your other comrades in the Exedra, you learn from Ryne that all has returned to normal in Norvrandt. Yet something clearly weighs upon her mind..."],"objectives":["Enter the Crystal Tower.","Defeat the Warrior of Light.","Speak with Ryne."],"dialogue":[{"name":"GUIDEOFTHEPENDANTS","text":"M-My <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>! Sincerest apologies, but the way to your room is blocked at the moment. In their rush to see the starshower, a number of residents lost their footing and fell down the stairs, you see... Our chirurgeons are presently attending to them, and we ask for your patience and understanding until such time as they can be moved."},{"name":"MYSTERYVOICE","text":"You are ready, then? Very well. I shall lift the ward."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's time we finished this!"},{"name":"A1","text":"You know, it wasn't so long ago that I watched you seal the place up."},{"name":"MYSTERYVOICE","text":"And finish it we shall. For no hero our foe could summon to his side shall ever compare to you! And...as for me...well, no ally you could summon to your side will ever try harder, that much I swear."},{"name":"MYSTERYVOICE","text":"So come, my friend! Let's finish this─once and for all!"},{"name":"MYSTERYVOICE","text":"Hm? <span class=\"emphasis\">Ah</span>, before I began my slumber, you mean? Ha! It seems rather longer to me. But yes, what strange symmetry."},{"name":"MYSTERYVOICE","text":"This time, I break the seal, and I have no intention of locking myself away again."},{"name":"MYSTERYVOICE","text":"Nay, together we will enter, and together we will leave─in triumph. So come, my friend. Let us be about it!"},{"name":"GUIDESOLDIER03643","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>! Will you be entering the tower?"},{"name":"Q2","text":"Proceed to the Seat of Sacrifice?"},{"name":"ALPHINAUD","text":"At such moments, it is hard to know what to say...<br>...Are you all right, my friend?"},{"name":"ALISAIE","text":"You did well, <span class=\"highlight\">Forename</span>─you and the Exarch..."},{"name":"THANCRED","text":"Shortly after you left, we observed that our enemy's ranks were no longer being replenished─presumably when your absence was noted. So we polished them off and came as quickly as we could."},{"name":"THANCRED","text":"...Which is to say, not quickly enough. But then you had the Exarch for company, didn't you, and you could ask for no better than that."},{"name":"URIANGER","text":"Ere we descended from the throne room, I did chance upon an object which, if I have the right of it, did once─"},{"name":"URIANGER","text":"...Hm. M-Mine apologies. Mayhap now is not an appropriate time. Let us speak of it later."},{"name":"YSHTOLA","text":"Sometimes, I wish that I too had been gifted with the Echo. Then I might see what you have seen and glimpse into your heart without the need for words."},{"name":"RYNE","text":"...Hm? Am I all right? I should be the one asking you..."},{"name":"RYNE","text":"But yes, I'm fine, thank you. We all are."},{"name":"RYNE","text":"The people are fine, the city's fine, and the starshowers have stopped."},{"name":"RYNE","text":"It's almost as if we'd gone back to the peaceful days that followed the night's return. Almost."}],"reward":{"gil":3575,"instance":20071},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69313]},"next":[69315]},"partials":[{"type":"npc","id":"1033854","obj":{"i":1033854,"n":"Crystal Exarch","l":2951,"q":2}},{"type":"npc","id":"1033856","obj":{"i":1033856,"n":"Ryne","l":2951,"q":1}},{"type":"instance","id":"20071","obj":{"i":20071,"n":"The Seat of Sacrifice","c":61804,"t":"Trials","min_lvl":80,"max_lvl":80,"min_ilvl":465}},{"type":"quest","id":"69313","obj":{"i":69313,"n":"The Converging Light","g":9,"l":"Kholusia","s":270}},{"type":"quest","id":"69315","obj":{"i":69315,"n":"Nothing Unsaid","g":9,"l":"The Crystarium","s":290}}]}