{"quest":{"name":"One Way to Do It","location":"Excavation Tunnels","id":69321,"patch":5.2,"sort":310,"icon":100993,"unlocksFunction":1,"eventIcon":71341,"issuer":1032152,"target":1031580,"genre":24,"journal":["Anogg would like to continue what may be charitably termed the discussion at hand.","Anogg insists that it is in the village's best interest that you use the key to claim the androids' enigmatic weaponry as soon as possible so that the twins may study it. Forced to concede that she may have a point, Konogg agrees to help─though not without complaint. It seems you will be searching for that power source after all.","According to Anogg, one of the crystals that comprises a knocker should provide enough energy to power the key. She sends you off to the Dwarven Hollows to seek one out while she and Konogg consider the problem of how said energy might be harnessed for your purposes.","You pounce upon an unsuspecting knocker and bash it to pieces─all for the greater good, of course. Now with a sizable chunk of crystal in hand, you are ready to return to Anogg.","Though you provide the crystal to Anogg, successful implementation will require an amount of experimentation. The twins are keen to begin, but unfortunately for them, they are interrupted before they can so much as connect a whatsit to a thingamabob by the dig site chief, who will brook no further delay in the completion of their preparations for the upcoming carnival. As they grudgingly leave their work in the tunnels behind, he encourages you to attend the event. What exactly it entails remains a mystery, but one thing is certain: there will be drinking."],"objectives":["Speak with Anogg in Komra.","Obtain a chunk of knocker.","Deliver the chunk of knocker to Anogg."],"dialogue":[{"name":"KONOGG","text":"（★未使用／削除予定★）"},{"name":"ANOGG","text":"What were we talking about?"},{"name":"ANOGG","text":"Ah, yes─why I'm right."},{"name":"ANOGG","text":"I agree that we still know too little about the machine lifeforms and androids. But that's precisely why we need to seize this opportunity!"},{"name":"ANOGG","text":"If we claim the weaponry for ourselves, we'll know exactly what the enemy's capabilities are. Then─and only then─can we protect the village from comparable technology."},{"name":"KONOGG","text":"Fine, fine. I see your point. We'll be safer in the long run if we activate the weaponry sooner rather than later. Or everyone else will─I'll probably have dropped dead from trying to keep up with you."},{"name":"ANOGG","text":"Hahaha! You say that, but you're far too stubborn to die. That's why I can always count on you!"},{"name":"ANOGG","text":"You too, most loyal and lethal assistant! Come along─we have a power source to find."},{"name":"KONOGG","text":"I'm never sure if Anogg has the better argument, or if she's just better at arguing. I guess it doesn't matter─she usually gets what she wants in the end."},{"name":"ANOGG","text":"It's about time!"},{"name":"ANOGG","text":"I've been considering what we need in order to power the key─a hefty chunk of crystal from a knocker ought to do it, though I haven't quite worked out how we'll divert its energy for our purposes."},{"name":"ANOGG","text":"Konogg and I will think on it while you head over to the hollows and liberate that crystal. Find us when you're back in Komra."},{"name":"KONOGG","text":"And another thing─why does Anogg's way always have to be so <span class=\"emphasis\">fun</span>..."},{"name":"ANOGG","text":"Aha! You got one, right?"},{"name":"ANOGG","text":"Perfect. Now we can run some tests."},{"name":"ANOGG","text":"Yes, yes─it'll take a bit of experimentation to get the key powered up. It <span class=\"emphasis\">is</span> science, you know."},{"name":"ANOGG","text":"Don't you worry, though─we'll have this thing in working order before you know it. While you wait, why not take some time for yourself? Have a nap, try some of our local delicacies, tell the chief to go bugger himself..."},{"name":"DWARFMASTER03671","text":"Anogg! Konogg!"},{"name":"DWARFMASTER03671","text":"Ah, and here's <span class=\"highlight\">Forename</span>. I knew you had roped <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> into your schemes again."},{"name":"ANOGG","text":"They're good schemes! And anyway, you're the one who keeps sending <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> to check on us."},{"name":"DWARFMASTER03671","text":"I wouldn't have to if you'd <span class=\"emphasis\">do the work you were assigned</span>. The carnival won't wait on your pet projects!"},{"name":"ANOGG","text":"Fine, fine! Come on, Konogg. Let's get this over with."},{"name":"DWARFMASTER03671","text":"Frustrating as they are, you have to admire their enthusiasm for tinkering. If they can put even a tenth of that energy toward the carnival, we'll be ready in no time."},{"name":"DWARFMASTER03671","text":"I hope you'll be able to attend. You won't have seen the like before, I assure you. Not to mention that we're eager to show our appreciation for your helping us with those machines─and there's no better way to do that than with a dwarven toast to your health or two. Dozen."}],"reward":{"items":[{"id":30257}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69320]},"next":[69488]},"partials":[{"type":"npc","id":"1032152","obj":{"i":1032152,"n":"Anogg","l":3427,"q":2}},{"type":"npc","id":"1031580","obj":{"i":1031580,"n":"Anogg","l":2954,"q":1}},{"type":"item","id":"30257","obj":{"i":30257,"n":"Crumbling Lies (Front) Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"69320","obj":{"i":69320,"n":"Carnivals and Confrontations","g":24,"l":"Kholusia","s":300,"f":1}},{"type":"quest","id":"69488","obj":{"i":69488,"n":"We Can Rebuild Her","g":24,"l":"Kholusia","s":400,"f":1}}]}