{"quest":{"name":"Carnivals and Confrontations","location":"Kholusia","id":69320,"patch":5.2,"sort":300,"icon":100992,"unlocksFunction":1,"eventIcon":71341,"issuer":1032227,"target":1032152,"genre":24,"journal":["The dig site chief has a request for you. You could not possibly guess who it concerns.","As usual, the dig site chief is worried about Anogg and Konogg─or rather, their capacity to wreak havoc if left to their own devices for long enough. He also mentions that they have been shirking their village duties to continue their research into the key that you located in the Copied Factory, and asks that you remind them of this fact after you have finished confirming whether they've set anything on fire.","Per the chief's request, you speak to Anogg, who immediately expresses her frustration with the progress of their tinkering. Said progress, as Konogg explains, is in fact quite substantial─the two have been able to confirm that the device you recovered is in fact the “key” to some manner of weaponry, and were even able to get it working. Alas, its energy reserves ran dry soon after, and it will require additional power if it is to fulfill its purpose. This is typically the point at which one or the other of them would request you find a power source for them, but their incessant need to bicker reasserts itself at the critical moment, sparing you being set a new task. For now."],"objectives":["Speak with Anogg in the excavation tunnels."],"dialogue":[{"name":"DWARFMASTER03671","text":"Lali-what a conveniently timed entrance-ho! I was just thinking that I ought to send someone to check on Anogg and Konogg."},{"name":"DWARFMASTER03671","text":"They're still poking and prodding at those whatsits you dug up in the ruins. Which is all well and good until one of them sets off <span class=\"emphasis\">another</span> explosion..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Say no more. I wouldn't want anything to happen to the artifacts."},{"name":"A1","text":"Oh, I'm sure you'll notice if they blow up anything important."},{"name":"DWARFMASTER03671","text":"Thank you. You know how they get when they're curious about something."},{"name":"DWARFMASTER03671","text":"By which point it'll be too late!"},{"name":"DWARFMASTER03671","text":"Not to mention that our annual carnival is fast approaching. There's plenty that wants doing before we're ready, and I need those two to start pulling their weight."},{"name":"DWARFMASTER03671","text":"While you're looking in on them, remind them they've got duties outside of tinkering with rusty thingamabobs, will you? Maybe they'll listen if it's you doing the nagging."},{"name":"DWARFMASTER03671","text":"They seem to respect you─much as they respect anyone. Must be all the violence."},{"name":"DWARFMASTER03671","text":"（★未使用／削除予定★）"},{"name":"DWARFMASTER03671","text":"（★未使用／削除予定★）"},{"name":"DWARFMASTER03671","text":"（★未使用／削除予定★）"},{"name":"DWARFMASTER03671","text":"You'll find them in the tunnels, of course. Can't lure them out of there for love nor money─and believe me, I've tried."},{"name":"DWARFMASTER03671","text":"Don't like to leave those two unsupervised when I can help it, but I've got my hands full as it is."},{"name":"KONOGG","text":"Maybe it's supposed to do that...?"},{"name":"SYSTEM","text":"（★未使用／削除予定★）"},{"name":"ANOGG","text":"Ah, there you are. Can you believe this!?"},{"name":"ANOGG","text":"I waited through <span class=\"emphasis\">days</span> of “processing,” broke <span class=\"emphasis\">multiple</span> tools, and after all of that..."},{"name":"ANOGG","text":"Ugh. Ugh! Stupid son of a hob-swiving..."},{"name":"KONOGG","text":"Anogg, not everyone is privy to your inner thoughts. Allow me to explain."},{"name":"KONOGG","text":"The pod confirmed that this device grants the user access to some sort of weaponry, which presumably means that it is indeed the key of which 2P spoke."},{"name":"KONOGG","text":"Unfortunately, no sooner had we gotten it working than it stopped again. Based on our previous experiences, we assume that it's run out of power, and will require a supplementary energy source."},{"name":"ANOGG","text":"So let's hurry up and find one! The sooner we get the key working, the sooner we can pulverize our enemies."},{"name":"KONOGG","text":"Now, wait just a moment. We aren't even certain what sort of weaponry is involved here. Even if we get the key working again, we shouldn't activate it willy-nilly."},{"name":"ANOGG","text":"Honestly, Konogg. This ceaseless whining of yours is why we never make any progress!"},{"name":"KONOGG","text":"It's not <span class=\"emphasis\">whining</span>, it's being <span class=\"emphasis\">ethical</span> and <span class=\"emphasis\">prudent</span>!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Must you two always bicker so?"},{"name":"A2","text":"Shall the victor be the first to draw blood, or the last man standing?"},{"name":"ANOGG","text":"(-Anogg and Konogg-)Yes!"},{"name":"ANOGG","text":"(-Anogg and Konogg-)Why not both?"}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":142}],"questsType":"any","quests":[69256,69257]},"next":[69321]},"partials":[{"type":"npc","id":"1032227","obj":{"i":1032227,"n":"Dig Site Chief","l":2954,"q":15}},{"type":"npc","id":"1032152","obj":{"i":1032152,"n":"Anogg","l":3427,"q":2}},{"type":"quest","id":"69256","obj":{"i":69256,"n":"Tails, You Lose","g":24,"l":"The Copied Factory","s":100,"f":1}},{"type":"quest","id":"69257","obj":{"i":69257,"n":"Heads, I Win","g":24,"l":"The Copied Factory","s":200,"f":1}},{"type":"quest","id":"69321","obj":{"i":69321,"n":"One Way to Do It","g":24,"l":"Excavation Tunnels","s":310,"f":1}}]}