{"quest":{"name":"Heart of Darkness","location":"The Empty","id":69326,"patch":5.2,"sort":10,"icon":112389,"unlocksFunction":1,"eventIcon":71341,"issuer":1032604,"target":1032610,"genre":23,"journal":["Thancred is looking particularly chipper, despite the heavy rainfall.","Thancred is as pleased as anyone by the return of rain to the Empty. However, being the practically minded fellow he is, he suggests choosing another location to discuss your next move, as having waterlogged smallclothes is making it rather difficult to concentrate.","Urianger's explanation of the plan to restore the ice element is soon interrupted by Gaia, who is none too pleased to hear that it may take decades for the Empty to be restored. Upon hearing that the endeavor is for the benefit of future generations, Gaia, clearly moved by your selfless deeds, finally begins to open up, expressing her innermost doubts and fears. Her thoughts are soon interrupted by what appears to be a sudden headache, and she absents herself, heading outside for some fresh air. The others express their growing concern for her well-being, and Thancred suggests that you go to check on her. You arrive on Eden's canopy to find Gaia lost in a reverie, and the situation takes a dramatic turn for the worse when a dark aura manifests around her and coalesces into an ominous floating glyph. At that moment, countless flying sin eaters appear from nowhere and begin circling above Eden, with the glyph at their center, though rather than attacking this dark entity, they seem to be in its thrall. With Gaia now rendered immobile and entirely defenseless, you have no choice but to take her to Eden's core and decide how best to approach this unforeseen threat.","With Gaia now unconscious, Thancred recommends dealing with the sin eaters swarming around Eden before attempting to make sense of their sudden arrival. He volunteers to stay in the core to repel any attackers that breach Eden's defenses, while Urianger tends to Gaia. You prepare to confront the mysterious embodiment of Darkness and its legion of enslaved sin eaters.<br><br>※Eden's Verse: Iconoclasm can be accessed via the Duty Finder.","Despite being impossibly outnumbered, you succeed in dispersing the dark aether and the horde of sin eaters that were drawn to it. With the threat now apparently eliminated, you return to Eden's core to see if Gaia's condition has changed for the better.","You return to find that Gaia is still in a comatose state, with Ryne desperately pleading for her to wake up. Her voice seems to reach Gaia, who eventually regains consciousness. Naturally, she is more than a little subdued, though you and your companions are glad to see that she is otherwise unharmed. With the worst now behind you, it seems to be safe to proceed with the plan to restore the element of ice."],"objectives":["Speak with Urianger in Eden's core.","Speak with Ryne.","Enter Eden's Verse: Iconoclasm.","Speak with Ryne."],"dialogue":[{"name":"RYNE","text":"Poor Gaia... If the faerie lives inside her, why would it let her suffer like this? I wish there was something we could do to help..."},{"name":"URIANGER","text":"Pray be on thy guard, my friend. Gaia may yet relinquish control to the voice within..."},{"name":"GAIA","text":"Ungh... Just get it over with, would you?"},{"name":"THANCRED","text":"While this downpour is precisely the result we were hoping for, the novelty of standing outside in the rain does wear off rather quickly. Not to mention, Gaia's looking a bit under the weather. Let's continue this conversation in Eden's core."},{"name":"RYNE","text":"Now that I think about it, I don't really know all that much about Eden."},{"name":"RYNE","text":"Since we need to find out how it's connected to Gaia, I should try to understand it at a deeper level. To be honest, there isn't much else I <span class=\"emphasis\">can</span> do..."},{"name":"THANCRED","text":"I'm not sure what's going on with Gaia, but it's certainly a cause for concern. Perhaps this is the faerie making itself known..."},{"name":"GAIA","text":"What does it want? Why won't it tell me?"},{"name":"URIANGER","text":"Ere we set forth to restore the element of ice, I would discuss the manner in which the summoning shall be undertaken."},{"name":"GAIA","text":"Just tell me one thing: is this going to bring the Empty back to the way it was before the Flood?"},{"name":"URIANGER","text":"While none can say for certain, the change we have observed at points of aetherial intersection doth give us cause for optimism."},{"name":"URIANGER","text":"It may be reasonably assumed that the Empty shall continue to transform and, in the decades to come, regain a semblance of its former state."},{"name":"GAIA","text":"Decades!?"},{"name":"THANCRED","text":"I don't think you've quite grasped the sheer scale of the damage left in the wake of the Flood. It would've swallowed the entire world if Minfilia hadn't stopped it."},{"name":"THANCRED","text":"Even if Ryne has inherited her blessing, wounds like that don't heal overnight. After all, the Empty has been utterly devoid of life for a hundred years."},{"name":"RYNE","text":"And it might take even longer than that to bring life back. I don't expect immediate results, but I do know that it will stay like this forever unless we do something about it."},{"name":"URIANGER","text":"My sentiments precisely. Only once the final element is restored shall we have a glimpse of the future that awaiteth those of generations yet to come."},{"name":"GAIA","text":"You'd do all this, for a world you may not live long enough to see? While here I am, so absorbed in my own problems that I spare barely a thought for anyone besides myself..."},{"name":"GAIA","text":"For so long, I've listened to that voice...telling me what to do, who to be. I was so scared of what might happen if I disobeyed. But I don't want to live like that anymore. I want to be...me."},{"name":"GAIA","text":"Who am I? <span class=\"emphasis\">What</span> am I? Perhaps it's better if I never find out. If Ryne's the Oracle of Light, here to mend this broken world, what does that make me?"},{"name":"GAIA","text":"Gaia, the Oracle of Darkness, bringer of misery and death! A monster. It's no wonder they left me. Mother, Father... And next, it'll be all of you. Then I'll be back where I started, where I've always been. Alone."},{"name":"RYNE","text":"Gaia! Is it the faerie!?"},{"name":"GAIA","text":"What's wrong? Afraid I might lose control and ruin all your carefully laid plans!?"},{"name":"RYNE","text":"No! It's you I'm worried about!"},{"name":"GAIA","text":"Ryne, I... I'm going outside. To clear my head. You...just do what you need to do, all right?"},{"name":"RYNE","text":"Something's wrong, I know it."},{"name":"THANCRED","text":"That much is clear."},{"name":"THANCRED","text":"If we have a repeat of her first “visit” to Eden, we may even be joined by those voidsent friends of hers... If you go and see what Gaia's doing, Urianger and I will stay with Ryne."},{"name":"GAIA","text":"My name is Gaia... That's what you said, isn't it?"},{"name":"GAIA","text":"Eden... The Flood... What does it all mean?"},{"name":"GAIA","text":"No, it can't be... Is this what it's been waiting for all this time?"},{"name":"GAIAVOICE","text":"Finally, you remember..."},{"name":"GAIA","text":"Aaaaaah!"},{"name":"GAIA","text":"What...is this!?"},{"name":"GAIAVOICE","text":"The Darkness that dwells within you, Gaia."},{"name":"GAIAVOICE","text":"The accursed spawn of Light are drawn to it, like moths to a flame.<br>Pathetic, mindless, and easily bent to my will..."},{"name":"GAIA","text":"Sin eaters!?"},{"name":"GAIAVOICE","text":"Now, the time of awakening has come!"},{"name":"GAIA","text":"Unnnh..."},{"name":"THANCRED","text":"<span class=\"highlight\">Forename</span>, Ryne senses sin eaters! What's happened?"},{"name":"THANCRED","text":"Don't try to fight them─just bring Gaia back inside. Quickly, now!"},{"name":"THANCRED","text":"She's in a bad way, but at least she doesn't seem to have lost control."},{"name":"URIANGER","text":"What entity is this that should hold a horde of sin eaters in its thrall? And to what end?"},{"name":"SYSTEM","text":"She is unconscious."},{"name":"RYNE","text":"What's happened to her?"},{"name":"THANCRED","text":"That's a concern for later. First, we must deal with those sin eaters."},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span>, if thou wouldst care to repel our assailants without, I would task Thancred with standing guard within. I shall tend to Gaia meanwhile."},{"name":"RYNE","text":"I'm not sure if there's much Eden can do to help, but I'll try to keep it steady."},{"name":"THANCRED","text":"While Urianger watches over Gaia, I'll tend to any eaters that chance to slip inside."},{"name":"URIANGER","text":"Whereas before, 'twas Gaia who sought to destroy Eden, on this occasion she hath become the target..."},{"name":"THANCRED","text":"The interior is secure. With the eaters gone, I thought that Gaia might show some sign of improvement, but she hasn't so much as stirred."},{"name":"URIANGER","text":"Sin eaters drawn to the Oracle of Darkness, just as she herself was drawn to Eden, first and foremost among their kind."},{"name":"RYNE","text":"She won't wake up! What do we do?"},{"name":"GAIA","text":"What is this place?"},{"name":"GAIA","text":"Where is everyone?"},{"name":"GAIA","text":"So, I'm all alone. Even the faerie is gone..."},{"name":"GAIA","text":"Endless silence, endless darkness... Is this what death feels like?"},{"name":"GAIA","text":"It's no use. No one can hear me. How ironic... All those times I wanted peace and quiet, and now that I finally have it, I wish I had someone to talk to."},{"name":"GAIA","text":"I thought I couldn't stand to be around them. All their interfering and fussing... And yet, I was never lonely."},{"name":"GAIA","text":"But it's no use... Even after everything we went through, my memories still won't come back. There is no future awaiting me, only emptiness."},{"name":"GAIA","text":"Those memories...they can stay lost forever, if only this pain will leave me."},{"name":"GAIA","text":"Now, I close my eyes and sink into darkness..."},{"name":"GAIA","text":"And then I'll suffer no more."},{"name":"RYNE","text":"(-???-)...Gaia!"},{"name":"GAIA","text":"Mother, Father..."},{"name":"RYNE","text":"(-???-)Wake up!"},{"name":"GAIA","text":"I understand now. Why wait for tomorrow to claim us?"},{"name":"RYNE","text":"(-???-)Gaia! Can you hear me!?"},{"name":"GAIA","text":"This perfect moment never has to end."},{"name":"RYNE","text":"(-???-)I'm not giving up on you, Gaia! Say something!"},{"name":"GAIA","text":"What do you want?"},{"name":"RYNE","text":"Please! I'm begging you!"},{"name":"RYNE","text":"Remember all the things we said we'd do? Like going to the Second Serving for coffee biscuits!"},{"name":"GAIA","text":"I never..."},{"name":"RYNE","text":"Gaia?"},{"name":"GAIA","text":"I never agreed to anything of the sort."},{"name":"RYNE","text":"Oh, thank goodness! I was so worried about you!"},{"name":"GAIA","text":"Ugh, do you have to be so loud?"},{"name":"GAIA","text":"The faerie fell silent, only to be replaced by Ryne's voice ringing through my head."},{"name":"GAIA","text":"I never thought I would be so glad to hear it."}],"reward":{"gil":3000,"items":[{"num":2,"id":25197,"one":1},{"num":2,"id":25198,"one":1},{"num":2,"id":25190,"one":1},{"num":2,"id":25186,"one":1}],"instance":30092},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69325]},"next":[69327]},"partials":[{"type":"npc","id":"1032604","obj":{"i":1032604,"n":"Thancred","l":3225,"q":1}},{"type":"npc","id":"1032610","obj":{"i":1032610,"n":"Ryne","l":3214,"q":1}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"instance","id":"30092","obj":{"i":30092,"n":"Eden's Verse: Iconoclasm","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":455}},{"type":"quest","id":"69325","obj":{"i":69325,"n":"Into the Firestorm","g":23,"l":"The Empty","s":9,"f":1}},{"type":"quest","id":"69327","obj":{"i":69327,"n":"On Thin Ice","g":23,"l":"The Core","s":11,"f":1}}]}