{"quest":{"name":"Worlds Apart","location":"Amh Araeng","id":69329,"patch":5.2,"sort":13,"icon":100987,"unlocksFunction":1,"eventIcon":71341,"issuer":1032590,"target":1032590,"genre":23,"journal":["Yalfort is the bearer of tidings of some description.","Yalfort has received a message from Urianger, who has been continuing his research in the Crystarium. He requests your presence to discuss a matter of apparent significance, though you will have to wait until you meet in person to find out exactly what that might be.","As instructed, you meet Urianger at the Wandering Stairs, and are joined by Thancred, Ryne, and Gaia. Urianger reveals that the time has come for him and Thancred to return to the Source or else risk losing their physical forms permanently. While this does not come entirely as a surprise, Ryne is clearly upset by the thought of being separated, perhaps indefinitely, from the two men she considers her mentors. Thancred in particular has been a father figure to her ever since he freed her from Eulmore, and his absence will be sorely felt. Though as he reminds her, she is not alone, as you and Gaia will continue to offer her your support. Urianger offers Gaia some parting words, warning her not to surrender control to the voice inside her head. Thancred and Urianger then leave to make preparations for the journey back to the Source, leaving the rest of you to contemplate on what the future might hold for the Empty.","You return to Mord Souq and share news of Urianger and Thancred's departure with Yalfort, who will continue to oversee the Empty in their stead. He, too, expresses his disappointment, and reaffirms his commitment to seeing that the restoration of the lands once lost to the Flood proceeds according to their wishes."],"objectives":["Wait for Urianger at the Wandering Stairs.","Speak with Yalfort in Mord Souq."],"dialogue":[{"name":"YALFORT","text":"Good news! Or at least, it has the potential to be good news. I've received word from Master Urianger."},{"name":"YALFORT","text":"Unfortunately, the message was rather thin on details."},{"name":"YALFORT","text":"He only requested that you return to the Crystarium and meet him at the Wandering Stairs. Not the most likely of places for important meetings, but I suppose you might be able to squeeze in a pint or two while you're there."},{"name":"YALFORT","text":"I cannot help but wonder why Master Urianger did not meet you here in Mord Souq? I suppose the food and drink on offer in the Crystarium are somewhat better suited to those with sensitive palates. Perhaps that's it?"},{"name":"URIANGER","text":"Pray accept mine apologies for calling thee hither at such short notice. The matter I wish to discuss is of considerable import."},{"name":"GAIA","text":"If it's that urgent, wouldn't it be quicker to use those linkpearl things Ryne's been telling me about?"},{"name":"URIANGER","text":"These are words best delivered in person."},{"name":"RYNE","text":"Did something happen to the Empty?"},{"name":"URIANGER","text":"Naught that doth warrant our immediate attention. The elements are in a state of equilibrium, and the propagation of flora continues apace."},{"name":"GAIA","text":"So, what's this about, then?"},{"name":"URIANGER","text":"As thou art aware, we are not of this world, hailing from what is referred to as the Source."},{"name":"URIANGER","text":"However, unlike <span class=\"highlight\">Forename</span>, Thancred and I exist only as aether given corporeal form. Our bodies remaineth on the Source, though the thread that binds us to them doth grow weaker with the passage of time."},{"name":"RYNE","text":"And if you stay here too long, you might never be able to return."},{"name":"URIANGER","text":"Precisely. Now, with the wheels of change in the Empty set in motion, we believe this a fitting juncture to take our leave. We shall but regret not being present to see the transformation reach its completion."},{"name":"GAIA","text":"That hardly seems worth losing your bodies over, though. If you have to go back to your own world, who are we to stop you?"},{"name":"RYNE","text":"I always knew this day would come. I just..."},{"name":"THANCRED","text":"You'll still have Gaia and <span class=\"highlight\">Forename</span>."},{"name":"THANCRED","text":"I know that you'll see this through to the end. Together."},{"name":"RYNE","text":"We will."},{"name":"RYNE","text":"I may not be half the woman Minfilia was, but I have friends I can turn to."},{"name":"RYNE","text":"They might be brutally honest in their opinion at times..."},{"name":"RYNE","text":"Or prefer to save their words, and let their actions do the talking. But I wouldn't have it any other way!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We won't let you down!"},{"name":"A1","text":"Just promise you won't transform into a crazy ice lady and try to kill me. Again."},{"name":"THANCRED","text":"Though I can't say what the future might bring, no doubt Ryne and Gaia will need your support in the days to come."},{"name":"URIANGER","text":"Alas, the mysteries surrounding the faerie are yet to be solved. Whether thou shouldst find the answers that thou seekest or nay, lend not thine ears to its honeyed words. For thy will is thine own. Never forget this."},{"name":"GAIA","text":"...I won't."},{"name":"URIANGER","text":"The time of our departure is at hand. Yet know that, no matter where we may be, ever shall we pray for your success."},{"name":"SYSTEM","text":"With Urianger and Thancred set to leave the First, it seems wise to share this development with Yalfort, who will continue to oversee expeditions into the Empty."},{"name":"YALFORT","text":"You're back sooner than expected. Is everything all right?"},{"name":"YALFORT","text":"Oh dear, that's rather unfortunate. I daresay it's something jolly important for them to leave in such a hurry. In any case, I wish them the best of luck, wherever their work may take them."},{"name":"YALFORT","text":"I shall remain here and hold the fort, as it were, and make the necessary provisions should any further forays into the Empty be required. Safe travels, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>!"}],"reward":{"gil":1085,"items":[{"id":30247}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"questsType":"all","quests":[69328,69306]},"next":[69511]},"partials":[{"type":"npc","id":"1032590","obj":{"i":1032590,"n":"Yalfort","l":2955,"q":3}},{"type":"item","id":"30247","obj":{"i":30247,"n":"Blue Fields Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"69328","obj":{"i":69328,"n":"Life Finds a Way","g":23,"l":"The Empty","s":12,"f":1}},{"type":"quest","id":"69306","obj":{"i":69306,"n":"Echoes of a Fallen Star","g":9,"l":"Kholusia","s":200}},{"type":"quest","id":"69511","obj":{"i":69511,"n":"Empty Promise","g":23,"l":"Amh Araeng","s":14,"f":1}}]}