{"quest":{"name":"Away with the Faerie","location":"Amh Araeng","id":69323,"patch":5.2,"sort":7,"icon":100985,"unlocksFunction":1,"eventIcon":71341,"issuer":1032715,"target":1032596,"genre":23,"journal":["Yalfort has arrived in Mord Souq bearing pertinent information.","In the marketplace of Mord Souq, you are greeted by Yalfort, a member of the select few privy to the details surrounding the investigation being carried out in the Empty. After you are joined by Ryne and Urianger, Yalfort informs you that the girl who has been unconscious since leading the attack on Eden has awoken and is being escorted by Thancred to this very location. You learn that her name is Gaia and that she was originally a resident of Eulmore, although she has no memory of recent events. A short while later, she arrives with her newfound footman close behind, and it seems Thancred has been given the unenviable task of carrying her luggage. It soon becomes abundantly clear that she is incredibly impatient, and she demands that if the group insists on speaking at length, they should at least find somewhere to sit down first.","Gaia reveals that she has no memory whatsoever of your previous encounter, while Urianger inquires as to the true nature of her arcane abilities. She attributes these powers to a voice inside her head that she refers to as “the faerie,” which bears an uncanny similarity to Ryne's relationship to Minfilia. Gaia comes to the conclusion that if it was the faerie's intention for her to make contact with Eden, that is where she must go, and in so doing find the answers to the questions surrounding her past. In spite of Ryne's and Urianger's warnings, Gaia rushes off into the desert, displaying a surprising turn of speed, prompting Thancred to lead the rest of the group in chasing after her.","You race in the direction of a distant scream, where you discover Gaia staring down an enormous vilekin. As you dash to her rescue, she casts a seemingly potent spell, although the dark aura quickly dissipates, leaving the creature entirely unscathed. As it lunges to strike, it is suddenly enveloped in swirling magicks that leave nary a trace of the chitin-plated beast behind, while Gaia herself is thankfully unharmed.","Shortly after arriving on the scene, Ryne tells Gaia that if she is determined to risk life and limb to see Eden, you should all travel together. Thancred and Urianger's attempts to talk her out of it are vehemently rebuffed, though her two mentors soon admit that it was merely a ploy to test her resolve. Once again, Gaia cuts the conversation short and leads the way to the Derrick, where your transportation to the Empty awaits.","Thancred has finished preparing the skyslipper for the long journey ahead. Although the craft was apparently designed to only seat four people, the addition of the petite Gaia as the fifth member of your group is unlikely to cause any problems. As Thancred suggests, Urianger could always be made to sit with the camping supplies should you be in need of space inside the vessel.","After arriving at the camp, you find Gaia gazing towards Eden as it floats silently above the lake. As she stands in quiet contemplation, your comrades prepare to restore the next element to the Empty."],"objectives":["Speak with Gaia.","Search for Gaia at the designated location.","Speak with Gaia.","Speak with Thancred near the Derrick.","Speak with Gaia in the Empty."],"dialogue":[{"name":"YALFORT","text":"Ah, there you are. I'm part of the team helping with the Ede─I mean, “highly classified and very, very secret...thing.”"},{"name":"YALFORT","text":"The fact of the matter is, I've come to inform you of a rather interesting development. It's about the girl who was brought back from the Empty. She's finally woken up, you see."},{"name":"RYNE","text":"Yalfort! And <span class=\"highlight\">Forename</span>, too!"},{"name":"RYNE","text":"We heard the news from Thancred. Is it true?"},{"name":"YALFORT","text":"Why yes, it most certainly is!"},{"name":"YALFORT","text":"Apparently, her name is Gaia. She claims to be a free citizen of Eulmore, although she remembers nothing of the events leading up to her attack on Eden."},{"name":"RYNE","text":"She's lost her memory!?"},{"name":"YALFORT","text":"Parts of it, at the very least. We also cannot be sure whether she's telling the truth or if it's merely a ruse. She's yet to display any hostility, which is encouraging, I suppose."},{"name":"RYNE","text":"And Thancred's with her now, is he?"},{"name":"YALFORT","text":"Yes. He's taken her to Eulmore, mainly to verify what she's told us so far. Quiz the locals, that sort of thing."},{"name":"YALFORT","text":"After that, the plan is to come back here, though they're taking rather longer than I'd anticipated. I do hope nothing is amiss..."},{"name":"GAIA","text":"(-???-)Good grief! Are you always this slow!?"},{"name":"GAIA","text":"(-???-)At this rate, it'll be dark again before we know it! The night sky returning is all well and good, but it does make each day seem awfully short. And are you still dragging your heels back there!? At least <span class=\"emphasis\">act</span> as if you've got a purpose, would you?"},{"name":"THANCRED","text":"Now look here, I'm not one of your servants. Why don't you try carrying your own luggage for a change?"},{"name":"RYNE","text":"Thancred! You're back!"},{"name":"THANCRED","text":"You lot are a sight for sore eyes. Yes, even you, Urianger. Gaia and I have just finished shipping her personal effects from Eulmore."},{"name":"RYNE","text":"I'm glad we could finally meet. Properly, I mean."},{"name":"RYNE","text":"So, ah... Did you learn anything useful?"},{"name":"THANCRED","text":"Other than where she lives, not an awful lot. Her supposed neighbors barely knew the first thing about her."},{"name":"THANCRED","text":"Hells, <span class=\"emphasis\">she</span> barely knows the first thing about herself. Her recollection of her life in Eulmore is patchy at best."},{"name":"THANCRED","text":"But she seems convinced that she'll regain her memory if she accompanies us, and so she invited herself to join our merry band. And for her first act, she ordered me to carry her luggage."},{"name":"GAIA","text":"If you insist on standing around talking, might I suggest finding a place to sit down first? My feet are killing me."},{"name":"THANCRED","text":"Then perhaps you should've chosen more sensible footwear. Still, it's not such a bad idea. Shall we?"},{"name":"RYNE","text":"I've got so many things I want to ask, but I probably shouldn't bombard her with questions."},{"name":"THANCRED","text":"Well, I've given you my early impression of Gaia, but I would be interested in hearing your opinion. Go on and talk to her and see what you make of her situation."},{"name":"URIANGER","text":"Amnesia... 'Tis troubling though not entirely unexpected."},{"name":"YALFORT","text":"That Gaia person appears to be none the worse off for her long sleep. A little surly, perhaps, but one can hardly expect her to be in the cheeriest of moods, given the circumstances."},{"name":"RYNE","text":"So you don't remember anything at all? Not attacking us, not falling unconscious?"},{"name":"URIANGER","text":"Such selective amnesia would rightly raise suspicion within those of a cautious mind."},{"name":"URIANGER","text":"Yet if she doth speak the truth, it would lend credence to my current hypothesis, though admittedly some further─"},{"name":"THANCRED","text":"Not now, Urianger, she's only just woken up. We don't want to bore her back to sleep."},{"name":"THANCRED","text":"In any case, I prefer to follow my instincts, and they're telling me that Gaia means us no harm. After much deliberation, I thought it only right to let her know about our work in the Empty, as a sign of goodwill. After all, trust works both ways."},{"name":"THANCRED","text":"Though, I would ask you, <span class=\"highlight\">Forename</span>, not to let your guard down just yet."},{"name":"GAIA","text":"So you're the one I'm supposed to have fought? Come to think of it, I recognize you from somewhere."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Maybe I just have one of those faces."},{"name":"A1","text":"So you should, considering you tried to kill me."},{"name":"GAIA","text":"Or perhaps you just didn't make much of an impression? But to be honest, I do feel that since meeting you, those hazy memories are becoming slightly clearer."},{"name":"GAIA","text":"Well, if Thancred's version of events is anything to go by, you weren't exactly holding back yourself. Still, it seems I didn't give you much of a choice but to defend yourself, so let's call it even. Not that I have any recollection of it..."},{"name":"GAIA","text":"...It's like remembering fragments of a dream, only to realize those things actually happened. &lt;sigh&gt; It's as though my whole life has been leading to this..."},{"name":"URIANGER","text":"Thou speakest as though thou didst expect these events."},{"name":"GAIA","text":"I guess you could say that. It's what the faerie tells me."},{"name":"GAIA","text":"I can't see it, but it's as though there's someone else inside me. And I can hear its voice in my head."},{"name":"GAIA","text":"It whispers to me and lets me use its power. “Magic,” I suppose you could call it, not that I know much about that sort of thing."},{"name":"URIANGER","text":"And this power alloweth thee to tear open the fabric betwixt realities, that thou mayest call forth the aether-starved denizens of what remaineth of the Thirteenth?"},{"name":"GAIA","text":"What!? Was that supposed to mean something or are you just spouting random words at me?"},{"name":"GAIA","text":"Honestly, I don't know how you all put up with this. I've only just met him and his insufferable prattle is already giving me a headache!"},{"name":"GAIA","text":"Gods, I still can't believe I'm having this conversation. And to think that I was flying about in a suit of armor, waving a sword. That doesn't sound like me at all."},{"name":"RYNE","text":"Someone else inside you..."},{"name":"RYNE","text":"...Like Minfilia was inside me!"},{"name":"URIANGER","text":"Aye, the similarities cannot be ignored. Though it is too early to say with certainty, Gaia may well be the Oracle of Darkness."},{"name":"RYNE","text":"The Oracle...of Darkness? What does this mean?"},{"name":"THANCRED","text":"It means that you may have been right when you said she has something in common with Emet-Selch."},{"name":"THANCRED","text":"Those who have been used as a living host by an Ascian have no recollection of events that occurred during their possession. This I know from personal experience."},{"name":"THANCRED","text":"But Gaia seems to have some memories still, even if they're a little hazy. Moreover, she has remained in control of herself even when she heard the voice within. Much like you and Minfilia."},{"name":"URIANGER","text":"And though Ryne was very much her own person, Minfilia's presence did exert a change upon her outward appearance, granting her hair and eyes a hue akin to that of our dear departed friend."},{"name":"URIANGER","text":"It is therefore not unthinkable that Gaia's raven locks may be a manifestation of the Darkness which hath come to reside within her."},{"name":"GAIA","text":"But I was born like this. And my parents, they both had black hair, too."},{"name":"GAIA","text":"Or at least I think they did. It's been so long since I saw them, I can't remember too well..."},{"name":"GAIA","text":"But enough about me. You're Minfilia, aren't you? The Oracle of Light, who they were hosting in Eulmore?"},{"name":"RYNE","text":"That's right, though imprisoning is a better word. They kept me locked away, and I didn't know much about Eulmore and its people, or the rest of the world for that matter."},{"name":"GAIA","text":"I see. And how exactly did the Oracle of Light come to run with the Warrior of Darkness?"},{"name":"RYNE","text":"Well, it all started when..."},{"name":"GAIA","text":"Yes, I still remember the day everyone went raving mad and Lord Vauthry fled. Everything after that is still a blur, though."},{"name":"THANCRED","text":"From what Gaia's told me, she wasn't part of the mob that attacked us. But how was she able to resist Vauthry's control?"},{"name":"URIANGER","text":"Mayhap 'twas the intervention of this “faerie” of whom she speaketh."},{"name":"THANCRED","text":"Hmm. As curious as that may be, we still don't know why she appeared out of nowhere as soon as Eden took flight."},{"name":"GAIA","text":"This is just a guess, but I'd say that the faerie reacted to it in some way, and for whatever reason, made me go after it."},{"name":"RYNE","text":"Yes, that seems like the only explanation."},{"name":"GAIA","text":"I don't know about you lot, but I've had enough nattering. I'm going back to Eden."},{"name":"RYNE","text":"What!? But why!?"},{"name":"GAIA","text":"The faerie wanted something from Eden, and knowing what that is will bring me a step closer to discovering exactly what has been living in my head all these years."},{"name":"GAIA","text":"Besides, my memories aren't going to restore themselves, and certainly not through idle chitchat. So I'm going, and that's that!"},{"name":"RYNE","text":"Gaia, wait!"},{"name":"THANCRED","text":"Insufferable. Utterly insufferable, and yet we can't well leave her to her own devices. Come on!"},{"name":"YALFORT","text":"Was there some sort of disagreement with Miss Gaia?"},{"name":"RYNE","text":"She can't have gone far, especially not in those heels..."},{"name":"GAIA","text":"Get away from me!"},{"name":"RYNE","text":"Gaia!"},{"name":"GAIA","text":"It seems I've no choice..."},{"name":"GAIA","text":"What...am I?"},{"name":"RYNE","text":"I'm not entirely sure what I just witnessed, but I'm glad she's unharmed."},{"name":"THANCRED","text":"Powers befitting the Oracle of Darkness..."},{"name":"THANCRED","text":"When you fought Gaia, she opened voidgates, yes?"},{"name":"THANCRED","text":"Back in the Source, portals such as those were all too common, but tearing open the veil between the First and the Thirteenth is a different matter entirely."},{"name":"THANCRED","text":"We should be thankful that she's not of a mind to turn that power against us. For now."},{"name":"URIANGER","text":"A most fascinating application of aetherial manipulation. The destructive blast did manifest a significant span of time after the initial casting. With sufficient mastery of such a technique, a second spell could be made to smite the target at precisely the same moment."},{"name":"URIANGER","text":"While it would demand exceptional aetherial control, its tactical potential cannot be denied."},{"name":"GAIA","text":"What are you all gawping at?"},{"name":"RYNE","text":"I don't mean to stare, but it's not every day I see magic like that. So, this is the power of the faerie you spoke of?"},{"name":"GAIA","text":"Ever since I was a child, it has whispered to me, telling me what to do. That's how I came to use its power."},{"name":"GAIA","text":"But there are things I can't even explain... Holes ripped in thin air, terrifying creatures crawling out, ghastly-looking blades and armor appearing out of nowhere. But worst of all is the dark energy that comes from inside."},{"name":"GAIA","text":"This power...it feels as though it's only flowing through me, and never truly mine. And even when it answers my call, it always takes a few moments for the spells to work."},{"name":"THANCRED","text":"So in summary, you don't have control over the magic."},{"name":"GAIA","text":"Well, it's not as if I ever tried to control it. I haven't made a habit of fighting wild beasts."},{"name":"RYNE","text":"Unfortunately, it's part and parcel of traveling through Amh Araeng. And while I understand that you want answers, you're not going to find them unprepared as you are. But if your heart is set on this, then we'll help you."},{"name":"THANCRED","text":"Ryne, think about what you're saying. You're seriously considering taking Gaia to see Eden?"},{"name":"THANCRED","text":"There's no telling what might happen if she loses control again, so the safest option is for her to stay away until our work is done. Somewhere we can keep an eye on her. You must realize, it's for her own good."},{"name":"URIANGER","text":"I must concur with Thancred's assessment. At present, we know precious little of Gaia's origin and less still of her powers."},{"name":"URIANGER","text":"If she is indeed the Oracle of Darkness, her presence may complicate a task already fraught with peril, placing our mission and her own well-being in jeopardy. In full knowledge of the risks, dost thou still wish to pursue this course?"},{"name":"RYNE","text":"I do."},{"name":"RYNE","text":"It wasn't so long ago that I was living in isolation, being held against my will. Maybe the people keeping an eye on me thought <span class=\"emphasis\">that</span> was for my own good, too."},{"name":"RYNE","text":"But if we shut Gaia away for our own convenience, we're no better than Vauthry and Ran'jit!"},{"name":"RYNE","text":"I've learned that when someone is in need, we must reach out a helping hand, not push them away. Now, it's my turn. To do for Gaia what you've all done for me."},{"name":"RYNE","text":"Even knowing the danger that lies ahead, I won't choose the easy way out. This is the path I've chosen!"},{"name":"RYNE","text":"Is that good enough for you?"},{"name":"THANCRED","text":"Well, can't say fairer than that. How about you, Urianger?"},{"name":"URIANGER","text":"The light of thy spirit doth burn bright."},{"name":"URIANGER","text":"Mine apologies, my dear, but we felt it necessary to test thy resolve. Let it suffice it to say thou hast left no room for doubt."},{"name":"THANCRED","text":"For what it's worth, Ryne, I never doubted you. But make no mistake, the danger that Urianger and I spoke of is all too real. If you're prepared to go through with this, we'll be right there beside you."},{"name":"RYNE","text":"That means a lot to me. Thank you."},{"name":"GAIA","text":"I couldn't care less who I travel with, but if we're going to go, then let's get going already. There's supposed to be some sort of craft waiting at the southern watchtower, yes? Come along then, and don't fall behind."},{"name":"RYNE","text":"Of course I'm worried about what may happen when Gaia gets close to Eden. We'll keep a close eye on her, make sure she's all right."},{"name":"URIANGER","text":"Though our circumstance hath changed, our mission most assuredly hath not. Restoring life to the Empty remaineth our primary objective."},{"name":"GAIA","text":"Why couldn't you leave this craft in Mord Souq instead of all the way out here? &lt;sigh&gt; Actually, don't bother explaining. Whatever the reason is, I'm sure it's something frightfully uninteresting. Let's be about it, shall we?"},{"name":"THANCRED","text":"It might be a bit of a tight squeeze with the five of us, but we'll manage. Perhaps Urianger can sit on top of our luggage?"},{"name":"YESNO","text":"Depart for the Empty?"},{"name":"RYNE","text":"Everything seems fine here, as far as I can tell. As for Gaia, she hasn't started attacking anything yet, so I'll take that as a good sign."},{"name":"THANCRED","text":"As usual, we should keep our sojourn here as brief as possible. Let's tend to business quickly."},{"name":"URIANGER","text":"I had hoped that, during our absence, the rebalancing of ambient aether might work further change. Alas, 'twas not to be..."},{"name":"GAIA","text":"So, there it is..."},{"name":"GAIA","text":"Eden... Where I'll find the answers I seek."},{"name":"GAIA","text":"The bringer of the Flood, the first sin eater. Would it lead me to my past, or my future?"},{"name":"GAIA","text":"What awaited on the path ahead, I couldn't say. But I had no choice but to take the first step..."}],"reward":{"gil":1752},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[68796]},"next":[69324]},"partials":[{"type":"npc","id":"1032715","obj":{"i":1032715,"n":"Yalfort","l":2955,"q":2}},{"type":"npc","id":"1032596","obj":{"i":1032596,"n":"Gaia","l":3225,"q":2}},{"type":"quest","id":"68796","obj":{"i":68796,"n":"The Next Piece of the Puzzle","g":23,"l":"The Empty","s":6,"f":1}},{"type":"quest","id":"69324","obj":{"i":69324,"n":"Blood and Thunder","g":23,"l":"The Empty","s":8,"f":1}}]}