{"quest":{"name":"Life Finds a Way","location":"The Empty","id":69328,"patch":5.2,"sort":12,"icon":100986,"unlocksFunction":1,"eventIcon":71341,"issuer":1032602,"target":1032590,"genre":23,"journal":["Ryne is ecstatic to see the first signs of greenery in the Empty.","With all six elements successfully restored, your work in the Empty has, for the time being at least, reached its conclusion. The sprouting of lush plant life around the camp fills each member of the group with hope for the future, although it may be some time before this remarkable change becomes widespread. Ryne proposes that everyone take a well-earned rest before considering the next move, displaying patience in place of her usual hastiness. She also demonstrates a surprising degree of maturity when she admits to not being able to solve every problem by herself, and expresses her wish that she and Gaia should support one another in the coming days. After a somewhat reticent Gaia gives her agreement, Urianger directs the group back to Amh Araeng.","After another long journey in the skyslipper, you arrive at the Derrick. Urianger asks you to accompany Ryne and Gaia to Mord Souq, while he and Thancred make their way to the Crystarium to share news of your expeditions into the Empty with the other Scions.","Your contact from the Crystarium, Yalfort, awaits Ryne's report of your recent escapades, though it will take no small amount of time for her to compile all of the relevant information. In the meantime, she and Gaia will be staying in Mord Souq, taking the opportunity to rest while deciding the next course of action.<br><br>※To unlock the next quest, you must complete the main scenario quest “Echoes of a Fallen Star.”"],"objectives":["Speak with Ryne at the Derrick.","Speak with Yalfort."],"dialogue":[{"name":"THANCRED","text":"All this greenery... It's far more than I had dared to hope. I can't help but worry that it's too good to be true."},{"name":"URIANGER","text":"The rapid propagation of flora appeareth to be limited to the intersections of aetherial channels, as per our earlier findings. Nonetheless, 'tis cause to rejoice that the seeds of aether have quickened in the barren garden that is the Empty."},{"name":"GAIA","text":"It feels like I'm witnessing the miracle performed by Minfilia a hundred years ago all over again..."},{"name":"RYNE","text":"I can feel all of the revitalized elements working in harmony!"},{"name":"RYNE","text":"I've always believed Eden had the power to restore the Empty, but I never expected it to happen so quickly."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You're the one who made all of this possible."},{"name":"A1","text":"I think we owe it all to Gaia's skills with the hammer."},{"name":"A1","text":"I never did get the hang of summoning primals correctly..."},{"name":"RYNE","text":"We ran into a few problems with Shiva, to say the least, but the others all went more or less according to plan!"},{"name":"URIANGER","text":"That we were able to come so far along this arduous journey may rightly be attributed to thine unwavering resolve."},{"name":"THANCRED","text":"Aye. When you said that you'd reclaim this world, you truly meant it. We're proud of you, Ryne."},{"name":"GAIA","text":"Hammer? Whatever are you talking about?"},{"name":"GAIA","text":"I'm a woman of gentle birth. Hardly the sort to be swinging such a rude thing about."},{"name":"RYNE","text":"<span class=\"highlight\">Forename</span> must be imagining things! Tee hee!"},{"name":"GAIA","text":"Judging by Thancred and Urianger's reactions, it seems most of them were barely recognizable. Far be it from me to worry, but are you sure your memory is all right?"},{"name":"URIANGER","text":"Though thou hast grasped the basic principles of summoning, it beareth repeating that such deiform entities are not the product of the memory alone."},{"name":"URIANGER","text":"Nay, myriad other factors contribute to their corporeal manifestation, in a process not unlike the techniques employed in creation magic."},{"name":"RYNE","text":"Hmm... I wonder if the effects from the rebalanced aether will spread to the rest of the Empty?"},{"name":"RYNE","text":"Perhaps we'll just have to wait and see. Besides, I'm sure we could all do with a rest."},{"name":"THANCRED","text":"I must say, Ryne, it's refreshing to see you take a more measured approach for a change."},{"name":"RYNE","text":"Well, if my experience here has taught me anything, it's that I shouldn't rush into things unprepared. And...I've also learned that there are some problems that can't be solved alone."},{"name":"THANCRED","text":"Is that so...?"},{"name":"RYNE","text":"Since you freed me from Eulmore, I've met all sorts of kind people who've gone out of their way to help me. I thought that I should do everything in my power to repay their kindness and make the world a better place."},{"name":"RYNE","text":"But now more than ever, I realize that there's a limit to what I can achieve by myself."},{"name":"RYNE","text":"Even though I was able to summon Shiva, I couldn't control such vast amounts of aether. If Gaia hadn't been there for me, I might never have returned to normal."},{"name":"GAIA","text":"I could say the same about you. I was trapped in a nightmare, but you freed me."},{"name":"RYNE","text":"It seems we're more alike than I thought."},{"name":"RYNE","text":"We might not be able to do everything by ourselves, but if we look out for each other, then we can face our problems together."},{"name":"RYNE","text":"That's if...you don't mind?"},{"name":"GAIA","text":"No, it's fine. Really."},{"name":"GAIA","text":"If things don't work out, we can always go our separate ways."},{"name":"GAIA","text":"But on the other hand, if I can resist the urge to punch you whenever you annoy me─which, I must say, is <span class=\"emphasis\">quite</span> often─I have no objections to staying around."},{"name":"RYNE","text":"You mean it? Oh, thank you, Gaia!"},{"name":"URIANGER","text":"May I suggest we continue the conversation in Amh Araeng? Though the Empty may now supporteth foliage, the land's normalization hath but begun, and to linger overlong still entaileth risks."},{"name":"URIANGER","text":"Is aught the matter, Thancred?"},{"name":"THANCRED","text":"Nothing you need worry about. Let's go."},{"name":"THANCRED","text":"To think that Ryne is the same girl I rescued from Eulmore... Compared to the way she was back then, the difference is like night and day."},{"name":"URIANGER","text":"Our encampment remaineth in its present state for our anticipated return. I cannot help but wonder how the land may change in our absence."},{"name":"GAIA","text":"Off to Mord Souq, are we? I can't say I care for the place. The marketplace reminds me of Eulmore, but instead of fine delicacies, they peddle... Well, I don't know what they are exactly. What I do know is they're far too wriggly for my liking."},{"name":"RYNE","text":"Before we do anything else, we should report to Yalfort. He'll want to know how we've been getting on in the Empty."},{"name":"GAIA","text":"Speaking of Mord Souq, there was a snack of some sort that caught my eye last time. I can't quite describe it, but it looked...squidgy. Despite a strong suspicion that I may live to regret it, I'd like to try one."},{"name":"RYNE","text":"Oh! I think I know the one you mean! They might not be much to look at, but I bet they taste amazing!"},{"name":"GAIA","text":"Perhaps we could also try a pot of those jellied wrigglers or whatever they're called. I'll even let you take the first bite."},{"name":"RYNE","text":"Ew! No thank you!"},{"name":"THANCRED","text":"First coffee biscuits, now worms in jelly... Heavens forbid the two of you might actually eat some proper food."},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span>, may I ask a favor of thee?"},{"name":"URIANGER","text":"Whilst Thancred and I return unto the Crystarium to inform our comrades of our recent exploits, I would have thee accompany Ryne and Gaia to Mord Souq."},{"name":"RYNE","text":"I'm looking forward to showing Gaia around the Crystarium, but we'd better finish our work here first."},{"name":"GAIA","text":"I'm prepared to give this Mord fare a try, although I should probably shut my eyes when I do. And my nose, come to think of it..."},{"name":"YALFORT","text":"I trust all is well, Miss Gaia?"},{"name":"GAIA","text":"It will be once we get out of this desert town. If I have to spend another night in that dingy little room, I shall scream."},{"name":"YALFORT","text":"I'm terribly sorry to hear that the accommodation was less than satisfactory. I'll investigate the availability of more comfortable lodgings posthaste."},{"name":"RYNE","text":"Yes, I think we'll be staying in Mord Souq, at least for the time being. It might take a while for me to write the report, as our expedition was...rather eventful."},{"name":"RYNE","text":"<span class=\"highlight\">Forename</span>, I really appreciate everything you've done, and I'm sorry for all the trouble I've put you through."},{"name":"GAIA","text":"Still fretting about that, are you? What's done is done. Besides, it all worked out in the end, didn't it?"},{"name":"RYNE","text":"You're right. Now, how about that treat we promised ourselves? They might not have coffee biscuits here, but I've heard the wriggler cakes are to die for. Or was that, “you'll die <span class=\"emphasis\">from</span> eating them”? Only one way to find out, I guess!"},{"name":"RYNE","text":"I'm sure trying the local delicacies will keep us occupied between writing reports and thinking about the next plan of action. Hopefully, we'll have another chance to visit the Empty to see how things are coming along!"},{"name":"GAIA","text":"And don't even think about leaving me behind."},{"name":"SYSTEM","text":"To unlock the next quest, you must complete the main scenario quest “Echoes of a Fallen Star.”"}],"reward":{"gil":7500,"items":[{"num":3,"id":25187,"one":1},{"num":3,"id":25188,"one":1},{"num":3,"id":25189,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69327]},"next":[69329]},"partials":[{"type":"npc","id":"1032602","obj":{"i":1032602,"n":"Ryne","l":3225,"q":1}},{"type":"npc","id":"1032590","obj":{"i":1032590,"n":"Yalfort","l":2955,"q":3}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"69327","obj":{"i":69327,"n":"On Thin Ice","g":23,"l":"The Core","s":11,"f":1}},{"type":"quest","id":"69329","obj":{"i":69329,"n":"Worlds Apart","g":23,"l":"Amh Araeng","s":13,"f":1}}]}