{"quest":{"name":"On Thin Ice","location":"The Core","id":69327,"patch":5.2,"sort":11,"icon":112391,"unlocksFunction":1,"eventIcon":71341,"issuer":1032611,"target":1030110,"genre":23,"journal":["Gaia's recent ordeals have left her rather more subdued than usual.","The emergence of the dark force within Gaia has provided few answers to the questions that remain concerning its origin and true purpose. With the mysterious entity nowhere to be seen and its host having regained her senses, the rest of the group resume the plan to revitalize the element of ice, this time using Shiva as a basis for the summoning. Upon hearing of the manner in which Ysayle made herself a vessel for the primal's power, Ryne states her desire to use a similar approach. As ice naturally tends towards stasis and stillness, it is the element most closely aligned with Light, and would require far more effort to draw forth and rebalance. She claims this difficulty could be greatly alleviated by directly influencing the flow of aether by using her own body as a conduit, rather than relying solely on Eden. Your role, as ever, is to defeat the primal, although considerable care must be taken to disperse the aether without harming Ryne. As one might expect, Thancred vehemently opposes the plan at first, though he is forced to concede when met with the steely determination in her eyes. You and Ryne focus your thoughts on Shiva, and commence the summoning. With an even greater sense of trepidation than usual, you prepare for a climactic battle with the goddess of ice.<br><br>※Eden's Verse: Refulgence can be accessed via the Duty Finder.","Despite Ryne's not-so-carefully laid plans going awry almost immediately, the battle reaches a largely satisfactory conclusion, thanks in no small part to the unexpected intervention of Gaia. Her much improved control of her dark powers is instrumental in freeing Ryne from Shiva's possession, and after the ice-aspected aether dissipates, Gaia rushes to aid the Oracle of Light. As Ryne returns to her senses, she and her unlikely savior engage in some light-hearted banter and make various plans for when they return to civilization, including making necklaces from a shard of ice left by Shiva.","Having overcome various obstacles and hardships, you and your companions return to Eden's core. Ryne, in particular, is somewhat worse for wear, although she is also the most eager to see what change has come as a result of the extraordinary events that have unfolded.","With balance restored to the last of the six elements, you return to the camp. For the first time since the Flood of Light, verdant green has returned to the Empty, with tufts of foliage peeking through the now fertile soil. It remains to be seen, however, if the work of rebalancing the ambient aether is truly complete, or if further challenges lie ahead."],"objectives":["Enter Eden's Verse: Refulgence.","Speak with Ryne."],"dialogue":[{"name":"RYNE","text":"We still don't know exactly what happened, but at least the danger's passed for now."},{"name":"THANCRED","text":"Whatever that thing was, it was able to control a vast swarm of sin eaters, much like Vauthry. Then again, it's clearly nothing like a Lightwarden... In any case, it's gone now. I just hope it stays gone."},{"name":"URIANGER","text":"Though Gaia hath regained consciousness, I surmise that it shall be some time before she is fully recovered from her ordeal."},{"name":"GAIA","text":"You've all gone through a lot of trouble on my part. For what it's worth, I'm sorry. Anyway, I've delayed you for long enough. Please, carry on with what you came to do."},{"name":"RYNE","text":"I'm glad you're back to your usual self, but how are you feeling?"},{"name":"GAIA","text":"Much better now, but something is still bothering me. The faerie spoke to me in a dream, and a stream of memories rushed through my mind. I don't recall anything like this happening before, and I'm not sure what it all means."},{"name":"RYNE","text":"What sort of memories?"},{"name":"GAIA","text":"I can't make any sense of them. They were only brief flashes, seen through someone else's eyes. At least, that's what it felt like."},{"name":"THANCRED","text":"Minfilia─that is, the first Oracle of Light─once served Hydaelyn as the Word of the Mother."},{"name":"THANCRED","text":"If the Oracle of Darkness is her counterpart under Zodiark, then we had best prepare ourselves for the worst."},{"name":"URIANGER","text":"Aye, the night's return did tip the aetherial balance towards activity, which may have served to awaken the fragment of His power in the First."},{"name":"URIANGER","text":"Having thus roused, He did then fix His gaze upon she who had been marked by Darkness─Gaia."},{"name":"RYNE","text":"Marked or no, Gaia's still her own person."},{"name":"RYNE","text":"Hmm? Everything all right?"},{"name":"GAIA","text":"I-It's nothing."},{"name":"GAIA","text":"Anyway, let's forget about all that for now. There'll be plenty of time to think it through once the last element's restored."},{"name":"URIANGER","text":"If thou believest thyself well enough, then I see no reason for delay. Let us forthwith attend to the revitalization of ice."},{"name":"THANCRED","text":"Shiva, then. <span class=\"highlight\">Forename</span>, as the only one here to have actually seen the primal, perhaps you could describe her for us?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A woman named Ysayle made herself a vessel for Shiva."},{"name":"A1","text":"She and the great wyrm Hraesvelgr shared an undying bond."},{"name":"RYNE","text":"So, she summoned into her body the imagined essence of someone who lived over a thousand years ago? That such a thing should be possible..."},{"name":"RYNE","text":"To find a kindred spirit in such an ancient and fearsome creature... I can hardly imagine what sort of a person she must've been."},{"name":"URIANGER","text":"The long since departed Shiva was a source of great inspiration to Ysayle, whose method of summoning differed greatly from any we had previously encountered."},{"name":"URIANGER","text":"By the Echo did she bear witness to the deeds of the noble Shiva, and thus was she moved to dedicate her being to that selfsame cause. 'Twas this devotion that granted her the power of a primal."},{"name":"RYNE","text":"So, she was able to control it herself...?"},{"name":"GAIA","text":"Not getting any funny ideas, are you?"},{"name":"RYNE","text":"Ah, just thinking aloud, that's all! Anyway, we'd better get going."},{"name":"URIANGER","text":"Our journey leadeth to a great glacier situated in the northernmost region of the Empty."},{"name":"RYNE","text":"I'll get us there as quickly as I can!"},{"name":"RYNE","text":"It's time to draw out the aether."},{"name":"RYNE","text":"Umm... I was thinking..."},{"name":"RYNE","text":"...That I should go with you this time. I want to be the vessel for Shiva!"},{"name":"RYNE","text":"Being still and passive by nature, ice is the element that is the most strongly aligned to Light. I'll need to get close and use my own abilities as well as Eden's to draw it out."},{"name":"URIANGER","text":"So that the Oracle of Light becometh the Oracle of Ice..."},{"name":"URIANGER","text":"I cannot claim to be in favor of this stratagem, and yet... The primal we encountered in the Source was summoned in much the same manner. The inherent advantages are undeniable─"},{"name":"THANCRED","text":"Absolutely out of the question!"},{"name":"THANCRED","text":"Have you forgotten what <span class=\"highlight\">Forename</span> does to the primals we summon!? I'm not about to stand by and watch as <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> and Ryne beat the tar out of each other."},{"name":"THANCRED","text":"In any case, the aether only returns to the Empty once the creature's been slain, although it seems you haven't taken that into consideration yet. Presumably, there's a safe way to disperse it, but it's still far too risky."},{"name":"THANCRED","text":"...I thought you had more sense, Ryne."},{"name":"RYNE","text":"But it's not as bad as it sounds!"},{"name":"URIANGER","text":"Were the deiform entity as volatile as the primals we have previously summoned, 'twould be logical to assume that, in her role as conduit, Ryne would be hard-pressed to retain control."},{"name":"URIANGER","text":"<span class=\"highlight\">Forename</span> would have no recourse but to defend <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> by any means necessary, else <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> life be forfeit."},{"name":"RYNE","text":"I know it's dangerous, but I can't let that hold me back. Please, I've got to try!"},{"name":"THANCRED","text":"But I don't see why this is even necessary in the first place. You never had to take risks like this for the other elements."},{"name":"RYNE","text":"Eden possesses almost infinite power, but what would happen if it began acting without my intervention?"},{"name":"RYNE","text":"If it started to feed on the aether, just like other sin eaters, it would undo all of our hard work!"},{"name":"URIANGER","text":"'Tis a disconcerting eventuality, and one which cannot be dismissed."},{"name":"RYNE","text":"I'm worried that even if we realign the elements, things will eventually return to how they were following the Flood."},{"name":"RYNE","text":"But if I train Eden how to nurture the environment rather than drain the life from it, we can leave it to take care of the Empty in our place. I'll channel the aether through myself, and show Eden how it's done!"},{"name":"GAIA","text":"This isn't some house pet we're dealing with! If it all goes wrong, then what?"},{"name":"RYNE","text":"I know this all sounds like I'm taking a leap of faith, but it has been a gamble every step of the way."},{"name":"RYNE","text":"We've managed to come this far <span class=\"emphasis\">because</span> of faith─in ourselves and in each other."},{"name":"THANCRED","text":"&lt;sigh&gt; I've made my feelings on the matter perfectly clear, but what say you, <span class=\"highlight\">Forename</span>?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"With my memories to guide the summoning, what could possibly go wrong?"},{"name":"A2","text":"I'll hold back as much as possible."},{"name":"THANCRED","text":"Ryne, I suppose that if you've got your heart set on this, there's no point trying to dissuade you. Just don't do anything reckless, is that clear?"},{"name":"RYNE","text":"As crystal!"},{"name":"RYNE","text":"This is going to work, I promise. I'll make sure of it."},{"name":"GAIA","text":"Well, for all our sakes, I certainly hope so. Because if the primal takes over..."},{"name":"RYNE","text":"It'll be fine. With all of you by my side, I know that whatever happens, it'll work out in the end."},{"name":"GAIA","text":"All of us? I hope you're not including me. I can't even deal with my own problems, never mind yours."},{"name":"RYNE","text":"It's enough just knowing you're here. Anyway, I've decided to take a leaf out of your book. “I do what I want, when I want.” I've made my decision, so now I have to see it through."},{"name":"GAIA","text":"Yes, but this is a different kettle of fish altogether!"},{"name":"RYNE","text":"Well, the point is that this is what I want, and I'll do whatever it takes to make it work!"},{"name":"GAIA","text":"So, this is how much it means to you..."},{"name":"SYSTEM","text":"Memories of Shiva envelop your mind..."},{"name":"RYNE","text":"I don't know how...but I can see her too! This might actually work!"},{"name":"RYNE","text":"I think Eden is sending your thoughts to me! I see Ysayle... And Shiva... They only wanted peace, a land where dragon and mankind could live side by side."},{"name":"THANCRED","text":"With so many things left to chance, all I can do is wait...and pray. Do you think the Twelve can hear me here in the First?"},{"name":"URIANGER","text":"Both Ysayle and Archbishop Thordan offered their corporeal forms as vessels, unto which the likenesses of preeminent figures from Ishgardian history were projected. However, the nature in which each met their demise is perhaps best not dwelled upon..."},{"name":"GAIA","text":"So, she's not just waiting for the future to arrive, but actually trying to change it?"},{"name":"GAIA","text":"Ryne!"},{"name":"RYNE","text":"You were there... I heard you..."},{"name":"GAIA","text":"What happened to Shiva? Is she still in control?"},{"name":"RYNE","text":"No, she's gone... But, Gaia..."},{"name":"GAIA","text":"What?"},{"name":"RYNE","text":"That hammer... It matches your dress..."},{"name":"GAIA","text":"Hmph. I see you're back to your normal idiotic self."},{"name":"RYNE","text":"Look... Isn't it pretty? Maybe we could take it with us?"},{"name":"GAIA","text":"Erm... Ice tends to melt, you know."},{"name":"RYNE","text":"Not this sort."},{"name":"GAIA","text":"Well, if you say so."},{"name":"GAIA","text":"Anyway, it might even make a nice necklace."},{"name":"RYNE","text":"That's a brilliant idea!"},{"name":"URIANGER","text":"Wilt thou not rush to her aid?"},{"name":"THANCRED","text":"Perhaps I'm getting slow in my old age, because it would seem Gaia's beaten me to it."},{"name":"THANCRED","text":"To think that she would be the one to break the ice. Ahem."},{"name":"THANCRED","text":"They may have gotten off to a rocky start, but I think they'll make quite the pair."},{"name":"URIANGER","text":"Is that a hint of melancholy I detect in thy voice? Something akin to a pining mother bird whose chicks have flown the nest..."},{"name":"THANCRED","text":"Father bird, if you don't mind. But aye, you're not entirely wrong."},{"name":"THANCRED","text":"Still, when the day finally comes to say good-bye, it heartens me to know she won't be alone."},{"name":"RYNE","text":"After that, we can go to the Second Serving for coffee biscuits!"},{"name":"GAIA","text":"Fine. You win. And if they're anything less than perfection itself, I'll never let you live it down!"},{"name":"RYNE","text":"If they're not to your liking...there are plenty of other things to try!"},{"name":"GAIA","text":"I suppose we both deserve a little treat after all that hard work. Hehe!"},{"name":"RYNE","text":"We certainly do! Hehehe!"},{"name":"GAIA","text":"There we were, laughing as if we had not a care in the world. Fleeting though it was, in that moment, I was content."},{"name":"GAIA","text":"But my life was never meant to be so simple."},{"name":"THANCRED","text":"I've had my share of close shaves, but that was...terrifying, to put it mildly. I can only hope the end justifies the means."},{"name":"URIANGER","text":"Ice, being most naturally aligned to Light among all elements, did interact with Ryne's innate gifts in ways unforeseen."},{"name":"URIANGER","text":"Were we not graced with the timely appearance of the Oracle of Darkness, I fear that this tale would have ended somewhat prematurely..."},{"name":"GAIA","text":"I let myself get a little carried away there, but I was definitely the one controlling my powers, not the other way around. Even so, I hope I never have to use them again."},{"name":"RYNE","text":"I'm so sorry, everyone. I clearly have a long way to go before I can handle that kind of power."},{"name":"RYNE","text":"But we achieved what we set out to do, as I had faith we would. So without further ado, let's return to camp and admire our work."},{"name":"RYNE","text":"It's...life!"}],"reward":{"gil":3000,"items":[{"num":3,"id":25187,"one":1},{"num":3,"id":25188,"one":1},{"num":3,"id":25189,"one":1}],"instance":30094},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69326]},"next":[69328]},"partials":[{"type":"npc","id":"1032611","obj":{"i":1032611,"n":"Gaia","l":3214,"q":1}},{"type":"npc","id":"1030110","obj":{"i":1030110,"n":"Ryne","l":3214,"q":6}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"instance","id":"30094","obj":{"i":30094,"n":"Eden's Verse: Refulgence","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":455}},{"type":"quest","id":"69326","obj":{"i":69326,"n":"Heart of Darkness","g":23,"l":"The Empty","s":10,"f":1}},{"type":"quest","id":"69328","obj":{"i":69328,"n":"Life Finds a Way","g":23,"l":"The Empty","s":12,"f":1}}]}