{"quest":{"name":"Blood and Thunder","location":"The Empty","id":69324,"patch":5.2,"sort":8,"icon":112385,"unlocksFunction":1,"eventIcon":71341,"issuer":1032596,"target":1030110,"genre":23,"journal":["Gaia is lost in thought as she gazes towards the silent giant on the horizon.","Gaia's request to be taken to Eden has been fulfilled, yet the faerie she claims inhabits her mind is refusing to react in any way whatsoever. As it was only when Eden first began to move that the faerie drove her to attack, she suggests proceeding with the plan to restore the Empty as originally intended. Though the possibility that Gaia will lose control and attempt to destroy Eden cannot be ignored, the party agrees to cooperate with her wishes, and proceeds towards the core.","Urianger suggests that as the water and earth elements remain in a state of passivity, lightning should be used as a catalyst to invigorate the Empty and allow for greater changes to occur. As Ryne has learned about the primals of the Source from Thancred, she nominates Ramuh as the representative of this particular element, while Urianger selects the Gandof Thunder Plains as the location for the summoning. Being the third such occasion, you and Ryne have grown accustomed to the process for drawing forth the aether and melding it into a deiform entity, although the results themselves are somewhat difficult to predict. You grit your teeth and prepare to face the unknown foe, with Ryne standing by to provide support.<br><br>※Eden's Verse: Fulmination can be accessed via the Duty Finder.","While the Ramuh you faced is a far cry from the benevolent protector of the Black Shroud, you nevertheless triumph over the embodiment of lightning. Your task complete, you return to Eden's core where your companions await.","Despite Eden traveling a considerable distance across the Empty and drawing forth enormous amounts of lightning-aspected aether, Gaia's faerie remains silent. Upon arriving back at the camp, Ryne is similarly dejected when she notices a distinct lack of visible change in the environment, though Thancred and Urianger claim that the defeat of Ramuh affected the ambient aether of the air above, rather than the ground below. With three of the six elements now restored, Urianger expresses the need for yet more dynamic energy to establish the natural cycle of rainfall and evaporation. Meanwhile, Gaia returns to silent introspection, pondering on the faerie's true intentions."],"objectives":["Speak with Urianger in Eden's core.","Enter Eden's Verse: Fulmination.","Speak with Ryne."],"dialogue":[{"name":"RYNE","text":"Everything seems fine here, as far as I can tell. As for Gaia, she hasn't started attacking anything yet, so I'll take that as a good sign."},{"name":"THANCRED","text":"As usual, we should keep our sojourn here as brief as possible. Let's tend to business quickly."},{"name":"URIANGER","text":"I had hoped that, during our absence, the rebalancing of ambient aether might work further change. Alas, 'twas not to be..."},{"name":"RYNE","text":"I know what it's like. It was the same for me."},{"name":"RYNE","text":"But I was lucky, because Thancred freed me from Eulmore, and I had a chance to see the world. More importantly, though, I met all kinds of people, and they taught me not to live in another's shadow, but to be myself."},{"name":"RYNE","text":"Maybe one day, you'll have that chance, too."},{"name":"GAIA","text":"Said your piece, have you?"},{"name":"RYNE","text":"I..."},{"name":"GAIA","text":"\"One day“? What's that supposed to mean!?"},{"name":"RYNE","text":"I...just..."},{"name":"GAIA","text":"I don't know how the great Oracle of Light sees such things..."},{"name":"GAIA","text":"But for someone like me, who's only known life in Eulmore, there was no tomorrow. There was no future. Only the here and now."},{"name":"GAIA","text":"And while we waste time on these meaningless conversations, I feel each moment of my life slipping away. Time... It won't wait. Not for me, not for anyone."},{"name":"GAIA","text":"I don't know how much longer I can hold on...to who I am."},{"name":"RYNE","text":"I'm sorry, Gaia."},{"name":"GAIA","text":"Gaia? Hmph. That's probably not even my real name."},{"name":"RYNE","text":"It isn't?"},{"name":"GAIA","text":"When Thancred asked me my name, I couldn't remember."},{"name":"GAIA","text":"That's when the faerie whispered to me. “Gaia...”"},{"name":"RYNE","text":"But if you grew up in Eulmore, surely someone there must know who you are?"},{"name":"GAIA","text":"Everyone I once knew had either disappeared or had been turned into sin eaters. Those whose faces and names I still remember, that is. In the end, we found not a single person who so much as recognized me."},{"name":"GAIA","text":"As far as I can recall, I've never been the most sociable person, but still..."},{"name":"RYNE","text":"Well, even if it's not your real name, I think “Gaia” sounds lovely. If you're happy with it, then that's what I'll call you."},{"name":"RYNE","text":"And if you're willing, instead of the Oracle of Light, please call me Ryne. It's not the name I was born with─that's long forgotten now─but the one the people whom I consider family gave to me."},{"name":"GAIA","text":"Is that so...?"},{"name":"GAIA","text":"Well, as much as I'd love to keep up this chatting, there's something that's bothering me. I thought the faerie would've reacted to Eden in some way, but so far, nothing whatsoever."},{"name":"GAIA","text":"From what I gather, it wasn't until Eden started moving that I appeared out of the blue."},{"name":"GAIA","text":"Perhaps if you were to actually try flying it somewhere, the faerie might break its silence. If you've got elements to restore, or whatever it was, why don't you hurry up and get it over with?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"At once, your ladyship!"},{"name":"A1","text":"You need to learn some manners."},{"name":"THANCRED","text":"Aye, it may be best to resign ourselves to her mannerisms. A good thing we're not wholly unfamiliar with attending nobility, given certain company in the Scions."},{"name":"URIANGER","text":"Of whomsoever dost thou speak, I wonder?"},{"name":"GAIA","text":"And you need to stop wasting my time!"},{"name":"RYNE","text":"All right, everyone, I think we've talked for long enough. If you're ready, let's make our way to Eden!"},{"name":"RYNE","text":"I've done some reading about the lands swallowed up by the Flood, but it's no easy task to find locations with a dominant element."},{"name":"RYNE","text":"I'm glad we have Urianger to point us in the right direction."},{"name":"THANCRED","text":"Ryne's little chat with Gaia reminded me that, for all our obvious differences, there are things we have in common. I, too, grew up not knowing who my parents were. The day Louisoix gave me the surname “Waters” was one I'll never forget."},{"name":"THANCRED","text":"Years later, it was under rather more desperate circumstances that I gave a certain young girl the name “Minfilia.”"},{"name":"THANCRED","text":"Little did I know then that it would end up crossing time and space, taking on a meaning I could never have foreseen. It came to be passed on to one girl after another, binding them to a fate not their own."},{"name":"THANCRED","text":"In a sense, it may be said that I chose not only one, but two names for Ryne. But by whatever name she is called, she is truly her own person now."},{"name":"THANCRED","text":"And as central to our lives as names are, I believe that it isn't the name itself, but the bonds it symbolizes that matter most."},{"name":"GAIA","text":"My memories...I think they're slowly coming back to me."},{"name":"GAIA","text":"My mother and father would constantly blather on about how the Flood of Light could return to end the world when we least expect it, and that we should live each day as though it were our last."},{"name":"GAIA","text":"They would often say, “I wish this moment would last forever!”"},{"name":"GAIA","text":"That was until they were selected for ascension by Lord Vauthry and were never to be seen again. Since I had no other relatives, or even any close friends to speak of, I was left alone in the world."},{"name":"GAIA","text":"&lt;sigh&gt; A past like that hardly seems worth remembering, does it?"},{"name":"URIANGER","text":"Following the initial changes wrought by the release of water and earth, the Empty hath displayed no further signs of alteration."},{"name":"URIANGER","text":"Stability, some may call this and be satisfied, but in truth it is passivity. A passivity stemming from Light's ever-pervasive presence."},{"name":"URIANGER","text":"If we are to break the status quo, we must needs employ a catalyst─a third element that shall rouse and stabilize those unleashed energies in activity."},{"name":"URIANGER","text":"Therefore, I propose lightning."},{"name":"RYNE","text":"So the primal would be...Ramuh, yes? From what I've heard, he's a guardian of the forest and not particularly keen on conflict. But you've actually fought him, haven't you?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"He's half-man, half-beard, and another half-beard for good measure."},{"name":"A2","text":"I spent most of the time chasing after orbs, with varying degrees of success."},{"name":"RYNE","text":"Ah, yes. Thancred mentioned that he more closely resembles a person than a beast, unlike most other primals. And apparently he tends not to move about much."},{"name":"RYNE","text":"I wonder if the sylphs had anything to do with that? I hear they can be quite mischievous, much like the pixies of Il Mheg."},{"name":"THANCRED","text":"I'm glad to see our lessons have paid off."},{"name":"RYNE","text":"Well, it's like you say. If we want to call forth an accurate representation of the primal, I should picture it in my mind as clearly as possible. At the very least, it's worth a try. But the rest is up to <span class=\"highlight\">Forename</span>."},{"name":"GAIA","text":"In order for this to work, we need to actually fly somewhere, yes? So rather than sitting in one spot while you exchange anecdotes, why don't you get this blasted thing moving first?"},{"name":"URIANGER","text":"One must admit, the suggestion is not without merit. Ryne, might I suggest the Gandof Thunder Plains as our next location?"},{"name":"URIANGER","text":"These plains, it is writ, were perpetually blanketed in storm clouds, the only source of illumination the ceaseless barrage of lightning. The ambient aether that lingereth there shall provide ideal conditions for the summoning."},{"name":"RYNE","text":"Then that's where we're heading. Come on, Eden, we've got a job to do!"},{"name":"RYNE","text":"This should be as good a spot as any."},{"name":"RYNE","text":"All right, <span class=\"highlight\">Forename</span>! Whenever you're ready!"},{"name":"SYSTEM","text":"Memories of Ramuh flash through your mind..."},{"name":"RYNE","text":"All the lightning that's fallen here over the years has left the ground covered in craters. But don't worry, Eden will give you something more even to stand on."},{"name":"THANCRED","text":"Even if Ryne has done a good job of memorizing my description of Ramuh, it will likely make little difference to how he manifests. After all, it's your memories that shape the summoning, not hers."},{"name":"URIANGER","text":"The area is saturated with lightning-aspected aether, this I am able to confirm. In addition to the primal, be thou wary of stray bolts that may occur as a result of our activity."},{"name":"GAIA","text":"I don't think I've ever been anywhere like this before. And I'm not sure I'd want to come back. Too dreary for my liking."},{"name":"GAIA","text":"Would be nice if our next destination is a little cheerier, but I suppose I can't exactly choose if I want answers."},{"name":"THANCRED","text":"I had my eye on Gaia the entire time you were fighting Ramuh, and besides the sort of reaction you might expect from someone watching you take on a half-man, half-flying-horse thunder god, I didn't notice anything out of the ordinary."},{"name":"THANCRED","text":"The fact that Eden itself also showed no signs of being affected by her presence can only be a good thing. But I'd understand if Gaia herself were more than a little disappointed that she's no closer to the answers she seeks."},{"name":"URIANGER","text":"Once again, 'twas a most superlative display of thy puissance. Now, I could not fail but notice─that body did belong to Ixion, fabled equine embodiment of lightning. Hast thou perchance encountered the beast?"},{"name":"GAIA","text":"So that...thing was created based on your memories? Maybe there's a way we can use Eden to summon the faerie like that..."},{"name":"RYNE","text":"I thought I was prepared to expect anything, but I didn't expect Ramuh to turn out quite like <span class=\"emphasis\">that</span>."},{"name":"RYNE","text":"Appearance aside, he was quite aggressive as well. The sylph's belief in him as a kindly guardian clearly makes a difference to his temperament."},{"name":"RYNE","text":"Anyway, I'm just glad it's over. Let's get back to the camp and see if anything's changed!"},{"name":"RYNE","text":"Hmm... The crystal's a different color, but apart from that, it all looks the same."},{"name":"THANCRED","text":"It may look the same, aye, but it feels different. The air has grown slightly more humid, as it does before rain."},{"name":"GAIA","text":"I have to say, I'm not exactly prepared for wet weather. If Eden can control elements and so on, can't you tell it to send those clouds somewhere else?"},{"name":"GAIA","text":"Speaking of which, I'm not very impressed with its so-called powers. If changing yellow crystals to purple is the extent of its abilities, it's no surprise the faerie didn't bother showing up. I hope that whatever's next is more worthwhile."},{"name":"URIANGER","text":"Rather than influencing the ground beneath our feet, Eden hath brought change to the firmament above."},{"name":"URIANGER","text":"And yet 'tis clear that a more dynamic element is required for the natural cycle of precipitation and evaporation to be complete."},{"name":"RYNE","text":"So we need movement... Would wind do the trick?"},{"name":"URIANGER","text":"Most certainly."},{"name":"THANCRED","text":"It seems we have a plan. Let's not dwell too much on the effects of each individual element, and instead focus on seeing them all restored."},{"name":"GAIA","text":"The power of an Oracle... Not to be sniffed at, it seems."},{"name":"GAIA","text":"All my life, you were a constant companion, your voice ever seeping into my mind. Why then, of all times, did you abandon me?"},{"name":"GAIA","text":"Deaf even to the crashing of thunder... Or were you simply biding your time?"},{"name":"RAMUH","text":"I have taken thy measure, Bringer of Light."}],"reward":{"gil":3000,"items":[{"num":2,"id":25197,"one":1},{"num":2,"id":25198,"one":1},{"num":2,"id":25190,"one":1},{"num":2,"id":25186,"one":1}],"instance":30088},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69323]},"next":[69325]},"partials":[{"type":"npc","id":"1032596","obj":{"i":1032596,"n":"Gaia","l":3225,"q":2}},{"type":"npc","id":"1030110","obj":{"i":1030110,"n":"Ryne","l":3214,"q":6}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"instance","id":"30088","obj":{"i":30088,"n":"Eden's Verse: Fulmination","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":455}},{"type":"quest","id":"69323","obj":{"i":69323,"n":"Away with the Faerie","g":23,"l":"Amh Araeng","s":7,"f":1}},{"type":"quest","id":"69325","obj":{"i":69325,"n":"Into the Firestorm","g":23,"l":"The Empty","s":9,"f":1}}]}