{"quest":{"name":"A Chilling Fate","location":"The Rak'tika Greatwood","id":69333,"patch":5.2,"sort":8,"icon":100970,"beast":13,"unlocksFunction":1,"eventIcon":71341,"issuer":1032735,"target":1032659,"genre":58,"journal":["The Great Serpent of Ronka once again would bestow upon you the wisdom of the gods...probably.<br>※The difficulty of this quest will be synced to your current level.","You engage in a stimulating conversation with the Great Serpent of Ronka, who─you surmise from the urgency and eagerness of its screeing─is keen to see the Stewards press deeper into the tunnels of Hopl's Stopple. Should you be inclined to heed his call, seek out Chaqurl Qhotl and see how you might best proceed.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You speak with Chaqurl Qhotl and his father, who share some distressing news. Seeking passage further down in the depths beneath Hopl's Stopple, the Qitari excavation team's path was blocked by a massive water vein. Suffering severe chills in attempting to navigate the icy flow, Towarl Manol has taken ill and lies incapacitated in bed. Hoping to aid their friend, the Qitari father and son once again summon Valan and Quinfort from Slitherbough. The two suggest fashioning a traditional remedy and something to keep the bedridden Qitari warm, and entrust you with the task of finding a vital material for the latter. You resolve to go forth and do your part to keep your Qitari friends in comfort.","You return to the Stopple with the ingredient sought by Valan. The Qitari rejoice when it proves not only a lifesaver for the ailing Towarl, but also─thanks to a burst of inspiration from the young Chaqurl─affords the Stewards a way to traverse the frigid depths in search of the next stela. Trusting the two Night's Blessed with looking after Towarl, Qitarl and his son continue their exploration of the underground tunnels. What wonders did they unearth this time?","At Hopl's Stopple─feeling more comfortable and welcoming than ever thanks to the supplies and conveniences brought from Slitherbough─Qitarl and Chaqurl triumphantly inform you that they have succeeded in discovering the third stela. Unfortunately but unsurprisingly, it appears to be as weathered and worn as the others. Nevertheless, the Qitari father and son have each come to their own theories regarding the meaning of the markings, which depict what appears to be a curious race of fishmen. At the behest of the Stewards, it once again falls to you to weigh in on the matter and choose which version of history will be passed on to posterity..."],"objectives":["Speak with Chaqurl Qhotl.","<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] at Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver [Error] to Qitarl Natl</span><span class=\"alternative\">Gather [Error] at Lake Tusi Mek'ta</span><span class=\"alternative\">Catch [Error] in Lake Tusi Mek'ta</span></span>.","Speak with Chaqurl Qhotl."],"dialogue":[{"name":"BOUSHITSUCHINOKO","text":"Scree! Scree!"},{"name":"SYSTEM","text":"The great serpent wriggles and writhes about with glee. It appears to be eagerly anticipating what new discoveries the Qitari excavation effort might bring. Speak with Chaqurl Qhotl and see how things have been progressing since last you met."},{"name":"CHAQURLQHOTL","text":"Oh, hello there, friend! It's a most splen-<span class=\"emphasis\">fid</span>-erous day here at the Stopple. The ritual that the Viis so kindly taught us has allowed us to delve deeper into the tunnels, and you won't believe the wonders we've found!"},{"name":"QITARLNATL","text":"It is as my boy says. Our exploration of the second stratum is nearly complete, and you'll be pleased to know that the relics and treasures we have found have all but confirmed that your interpretation of the second stela was indeed the correct one."},{"name":"QITARLNATL","text":"The first encounter between our ancestors and the Viis was not a pleasant one. Countless of our ancestors were hunted down in the forest, skinned, and turned into pelts and stews. Needless to say, the Ronkan Empire did not take kindly to this..."},{"name":"QITARLNATL","text":"The emperor had a mind to drive the Viis from the Greatwood, if not to eradicate their kind entirely. But our forebears used their wits and powers of persuasion to convince both sides that establishing an alliance would be in the best interests of all parties."},{"name":"QITARLNATL","text":"Hearing our impassioned pleas, the Viis repented their violent ways. In time, they even came to worship the Ronkan gods, believing that it was Yx'Maja Herself who granted the Ronkan emperor the vision that convinced him in the end to show mercy."},{"name":"CHAQURLQHOTL","text":"We share a positively horrifying past, but the Viis and Qitari are friends today, and that is what matters more than anything!"},{"name":"QITARLNATL","text":"Our forebears welcomed the Viis when they arrived in the Greatwood. Despite our clear differences in aspects like lifespan, stature, and martial aptitude, our two peoples forged a strong bond, not unlike that shared by Yx'Maja and Ox'Dalan, our guardian deities."},{"name":"QITARLNATL","text":"We also found records of a story told since olden times. In it, a Viis and a Qitari were hunting together in the wood, when they suddenly fell into a deep sinkhole."},{"name":"QITARLNATL","text":"Their bodies bruised and with no source of nourishment, they had no choice but to wait for a rescuer to come. Knowing that his short lifespan was nearly at an end, the short-lived Qitari offered his own flesh to his Viis companion, that she might survive for many years to come."},{"name":"CHAQURLQHOTL","text":"&lt;sniff&gt; Could there be a more <span class=\"emphasis\">wart-harming</span> tale of friendship and devotion? Why, it brings a tear to my eye!"},{"name":"QITARLNATL","text":"I am also pleased to report that in our search, we did also manage to find a passage leading even further into the Stopple's depths. Yes, I have little doubt that another stela awaits us should we continue to delve below."},{"name":"CHAQURLQHOTL","text":"I trust that Towarl is in-<span class=\"emphasis\">gest</span>-ivating the matter as we speak?"},{"name":"QITARLNATL","text":"As a matter of fact, she returned a short while ago. Towarl is nothing if not circumspect. I have no doubt her survey of the tunnels was most thorough."},{"name":"QITARLNATL","text":"And yet...I fear the news is not all good. Poor Towarl collapsed into a shivering heap almost immediately upon her return, and has remained in bed─silent and with a dreadful fever─ever since. As such, I have sent for our friends in Slitherbough to come to our aid."},{"name":"QITARLNATL","text":"I do believe I just saw them over there. Come, <span class=\"highlight\">Forename</span>. I would be most obliged if you could join us in getting to the bottom of all this."},{"name":"VALAN","text":"We came as soon as we could. What sort of malady has stricken the poor little fellow?"},{"name":"QITARLNATL","text":"According to those who accompanied her, the passage below was blocked by a vast water vein. Towarl and her team had no choice but to dive in and attempt to swim their way onward through the depths. It would seem the chill of the water took quite a toll on their bodies, Towarl most of all..."},{"name":"QUINFORT","text":"Or perhaps they encountered a fearsome leviathan lurking in the deep, who did lash out at them with its tentacles in furious rage! O, for woe! My heart goes out for this brave, battered soul..."},{"name":"QITARLNATL","text":"...Ahem. Fortunately, her life appears to be in no danger. And yet, I fear that the Stopple is far from an ideal environment for sheltering the wounded and infirm..."},{"name":"VALAN","text":"I would have to agree. Talismans and shrines may do well to ward off the creatures of the deep, but they will do little to keep a shivering body warm and nurse the sick back to good health."},{"name":"VALAN","text":"...<span class=\"highlight\">Forename</span>. The Qitari live a simple life, eschewing luxury. We of the Night's Blessed are similar, and I, too, believe frugality to be an admirable trait."},{"name":"VALAN","text":"And yet, I daresay they deserve to live in better comfort than this. Wouldn't you agree? Perhaps there is something we could do for them..."},{"name":"CHAQURLQHOTL","text":"Master Valan! Your mag-<span class=\"emphasis\">man</span>-imity is most touching, indeed!"},{"name":"VALAN","text":"What are friends for, if not to help one another in trying times?"},{"name":"QITARLNATL","text":"We would be most obliged to you for your aid. In the meantime, I will suspend our exploration of the tunnels until such time as we find a way to traverse those frigid and treacherous waters."},{"name":"VALAN","text":"I'll go gather the supplies we need to keep your friend here safe. We'll need something to warm her body, and medicine to ease her fever..."},{"name":"QUINFORT","text":"An elixir of life for the afflicted Qitari fellow!? Leave that to Quinfort, son of Dwatl, potion-maker nonpareil! Yes, I do believe I can procure the ingredients I need from our friends in Fanow."},{"name":"VALAN","text":"As for keeping her warm, I do believe I know just the thing─something my mother always used to make for me when I caught cold as a child. All I'll need is a kindling crystal from Lake Tusi Mek'ta..."},{"name":"VALAN","text":"As for keeping her warm, I do believe I know just the thing─something my mother always used to make for me when I caught cold as a child. All I'll need is some serpent pepper from Lake Tusi Mek'ta..."},{"name":"VALAN","text":"As for keeping her warm, I do believe I know just the thing─a magma eel stew, just like Mother always used to make. All I'll need is one of those fiery critters from Lake Tusi Mek'ta..."},{"name":"VALAN","text":"I reckon a fruit worm will suffice as bait. Never failed me, at least."},{"name":"VALAN","text":"I would fetch it myself, but I fear it would be treacherous going for one such as me. Could I trouble you with the task, <span class=\"highlight\">Forename</span>?"},{"name":"CHAQURLQHOTL","text":"You are most mu-<span class=\"emphasis\">fin</span>-icent indeed, my friends. Is there nothing I could do to be of assistance?"},{"name":"VALAN","text":"I intend to return here and tend to poor Towarl. Perhaps you could help me look after your friend?"},{"name":"CHAQURLQHOTL","text":"Consider it done! Whatever I might do to be of help, I am at your every <span class=\"emphasis\">keck</span> and <span class=\"emphasis\">ball</span>!"},{"name":"BOUSHITSUCHINOKO","text":"Scree!"},{"name":"SYSTEM","text":"The serpent lets out a plaintive cry. It appears to be deeply concerned for the ailing Towarl Manol."},{"name":"CHAQURLQHOTL","text":"Poor Towarl...if only there was more that I could do for her!"},{"name":"VALAN","text":"I wasn't sure what to think of them at first, but there's something rather endearing about these little mousy fellows. As friends of Ronka and neighbors here in the Greatwood, I can't help but wish them well."},{"name":"QUINFORT","text":"Why, I can scarcely wait to lend my ample expertise in the field of potion-making to our Qitari companions! It will require ingredients in ample quantities from both Slitherbough and Fanow, but there can be no doubting it is for a cause noble and true!"},{"name":"LANILLE","text":"I am most sorry to hear that one of our Qitari friends has been stricken ill. I can only hope that our traditional remedies will help to ease her suffering."},{"name":"QITARLNATL","text":"How goes the search, <span class=\"highlight\">Forename</span>? Have you managed to locate anything that might keep poor Towarl warm?"},{"name":"QITARLNATL","text":"On behalf of all the Stewards, please accept my apologies for always burdening you so. I promise you that your good deeds will not go unappreciated."},{"name":"QITARLNATL","text":"Fascinating...how gently warm to the touch it is. Yes, I daresay this should help to warm Towarl's body and ease her pain."},{"name":"QUINFORT","text":"Worry not, my friends! I prepared some extra doses and shared them with the remaining members of the excavation team. Should any of them exhibit similar symptoms to poor Towarl, relief is only a quaff of Quinfort's quintessential elixir away!"},{"name":"VALAN","text":"Towarl seems to be feeling quite a bit better already. At this rate, I daresay she'll be back on her feet in no time."},{"name":"QITARLNATL","text":"I cannot thank you enough, my friends. Poor Towarl...I must tell her just how much I appreciate all she has done for us when she wakens."},{"name":"CHAQURLQHOTL","text":"Oh! Oh, Father─I have it! Yes, in-<span class=\"emphasis\">tube</span>-idably I do!"},{"name":"QITARLNATL","text":"Ch-Chaqurl!? Are you quite all right? Have <span class=\"emphasis\">what</span>, I say?"},{"name":"CHAQURLQHOTL","text":"When I took <span class=\"highlight\">Forename</span>'s discovery into hand, my entire body was filled with a gentle wave of warmth from within! Why, if we were to give one to each member of the ex-<span class=\"emphasis\">vacation</span> team..."},{"name":"QITARLNATL","text":"...They could stay warm and toasty even as they navigated the frigid waters below! Simply ingenious, my boy!"},{"name":"QITARLNATL","text":"Master Valan. Master Quinfort. Might I trust you to look after our dear Towarl in my stead? I would return to the excavation, that I might deliver to my friend a discovery that is sure to have her dancing in the tunnels!"},{"name":"QUINFORT","text":"Leave it to us, my friend! There could be no greater honor than to lend my prodigious talents to a proud race of Ronka!"},{"name":"CHAQURLQHOTL","text":"That settles it! Let the third stage of the ex-<span class=\"emphasis\">vacation</span> begin!"},{"name":"SYSTEM","text":"Some time later..."},{"name":"SYSTEM","text":"Qitarl Natl and Chaqurl Qhotl have safely returned from their investigation of the tunnels."},{"name":"HELMETTSUCHINOKO","text":"Scree! Scree!"},{"name":"QUINFORT","text":"What news do our friends bring from below!? Why, I can scarcely wait to hear about the latest wonders of history and cultural heritage they have unearthed!"},{"name":"VALAN","text":"Towarl's looking like her hale and hearty old self again. Still a bit pale in complexion...but then again I suppose that's not out of the ordinary for their kind."},{"name":"CHAQURLQHOTL","text":"<span class=\"highlight\">Forename</span>! My friends! We return─our serpent friend with us─and I am pleased to report that the third stela has been found! Sadly, much like the first two, it has seen better days."},{"name":"QITARLNATL","text":"We must count our blessings that it survives at all, what with the ravaging sin eaters, rushing waters, and worse that it has faced over the years."},{"name":"CHAQURLQHOTL","text":"Indeed. Why, I can scarcely imagine the horrors our forefathers faced when they braved the depths so long ago..."},{"name":"HELMETTSUCHINOKO","text":"Scree! Scree!"},{"name":"QUINFORT","text":"“Have no fear, and lament not the past, O brave sons of Ronka! For in reclaiming your legacy this day, you forge the path to a brighter and ever more prosperous future!” So sayeth the divine protector, and may its words give you strength!"},{"name":"VALAN","text":"Well, the sentiment is an admirable one, at least..."},{"name":"VALAN","text":"But do tell. What were you able to make of the stone?"},{"name":"QITARLNATL","text":"What we could discern of the markings was most curious indeed. It showed a single Qitari holding a fish over his head, and standing next to him, a curious creature that resembled a miniature catfish man with two little legs."},{"name":"QUINFORT","text":"A catfish man, you say!? Why, I have pored through every encyclopedia on Master Matoya's shelf, and never so much as heard of such a thing! What manner of fantastic and ancient beast might you have discovered!?"},{"name":"VALAN","text":"You are the most well traveled of us, <span class=\"highlight\">Forename</span>. Have you ever seen or heard of such a creature in your journeys?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Have I ever!"},{"name":"A1","text":"I had a good catfish stew once..."},{"name":"VALAN","text":"A curious race of fishmen that live far to the East? No wonder we haven't heard of them here in Norvrandt. Doubtless they were one of the many ill-fated peoples swallowed up by the Flood."},{"name":"VALAN","text":"You joke, <span class=\"highlight\">Forename</span>, but why is it that I have a feeling you know more than you're letting on? But I won't pry─after all, we all have our secrets."},{"name":"VALAN","text":"In any event, these catfish men sound most appetiz─I mean, fascinating. I would be quite curious to find out more."},{"name":"QITARLNATL","text":"Ahem...I have a theory as to what the markings signify. Ahem...it was a time of old, when famine ravaged the forest! In trying times, our ancestors and these catfish men each laid claim to a vital fishing ground. That the creatures no longer inhabit these parts can mean only one thing..."},{"name":"QITARLNATL","text":"The proud Qitari─the might of the great Ronkan Empire behind them─drove these slippery creatures from the Greatwood, reclaiming the food supply as theirs and theirs alone. Bereft of a source of nourishment, the catfish men died out one by one, and met their eventual extinction."},{"name":"CHAQURLQHOTL","text":"Ex...ex-<span class=\"emphasis\">ink</span>-tion? Perish the thought!"},{"name":"CHAQURLQHOTL","text":"Believe me, Father, I am not so naive to think this was another bright and happy chapter in history. No doubt the famine you speak of truly did befall our forest home."},{"name":"CHAQURLQHOTL","text":"All the more reason that when these catfish men showed up on our doorstep, on the verge of collapsing from hunger, our <span class=\"emphasis\">far-forethers</span> did offer them fish, that they might sustain themselves for the days to come."},{"name":"QUINFORT","text":"Most fascinating theories, the both of them! And yet, I would posit another: I have read of an ancient coin emblazoned with the image of a catfish that was said to predate the Ronkan Empire. Is it not plausible─even <span class=\"emphasis\">probable</span>─that it might be the currency of an ancient civilization of fishmen that flourished in the depths below─"},{"name":"VALAN","text":"...No, it isn't, and I think we've heard enough theories for the day."},{"name":"VALAN","text":"At any rate, Quinfort and I should be getting back to Slitherbough. If you're ever in need of warding charms or far-fetched theories, you know where to find us."},{"name":"QITARLNATL","text":"I must say, there is something quite compelling about the thought of a great civilization of subterranean-dwelling fish people. Perhaps I should reconsider my─"},{"name":"BOUSHITSUCHINOKO","text":"Scree! Screeeeeeeeeeee!"},{"name":"QITARLNATL","text":"...Or perhaps not! At any rate, it would appear that once again my son and I have arrived at conflicting interpretations of our people's past. And so we turn once more to you, ally of Ronka. Which version of history shall be told?"},{"name":"CHAQURLQHOTL","text":"Friend <span class=\"highlight\">Forename</span>! Pray lend us your sage wisdom and a<span class=\"emphasis\">cute</span> insight!"},{"name":"SYSTEM","text":"Once more, the Qitari father and son have arrived at different interpretations of past events as depicted on the stela. At the bidding of the great serpent, it falls to you to determine which version of history will be told."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Honored</span> reputation with the Stewards."},{"name":"SYSTEM","text":"Thanks to the supplies provided by the people of Slitherbough, Hopl's Stopple is more hospitable than ever. No doubt the Qitari will be able to return to their excavation effort with newfound vigor!"},{"name":"SYSTEM","text":"New Qitari tribal daily quests are now available from Qhoterl Pasol at Hopl's Stopple."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Qhoterl Pasol as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Qhoterl Pasol. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from Yuqurl Manl."},{"name":"SYSTEM","text":"Normal-quality items gathered in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":898},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}],"questsType":"any","quests":[69338,69339]},"next":[69340,69341]},"partials":[{"type":"npc","id":"1032735","obj":{"i":1032735,"n":"Qitari Serpent","l":2957,"q":3}},{"type":"npc","id":"1032659","obj":{"i":1032659,"n":"Chaqurl Qhotl","l":2957,"q":7}},{"type":"quest","id":"69338","obj":{"i":69338,"n":"The Second Stela: The Hunters and the Hunted","g":58,"l":"The Rak'tika Greatwood","s":6,"f":1}},{"type":"quest","id":"69339","obj":{"i":69339,"n":"The Second Stela: Fast Friends","g":58,"l":"The Rak'tika Greatwood","s":7,"f":1}},{"type":"quest","id":"69340","obj":{"i":69340,"n":"The Third Stela: A Famine for Fishmen","g":58,"l":"The Rak'tika Greatwood","s":9,"f":1}},{"type":"quest","id":"69341","obj":{"i":69341,"n":"The Third Stela: A Feast for Fishmen","g":58,"l":"The Rak'tika Greatwood","s":10,"f":1}}]}