{"quest":{"name":"The Second Stela: Fast Friends","location":"The Rak'tika Greatwood","id":69339,"patch":5.2,"sort":7,"icon":100974,"beast":13,"unlocksFunction":1,"eventIcon":71341,"issuer":1032659,"target":1032659,"genre":58,"journal":["Chaqurl Qhotl would convince you of the merits regarding his theory of the history between the Qitari and the Viis.<br>※The difficulty of this quest will be synced to your current level.","Convinced of the merits of Chaqurl Qhotl's argument, you express your support for his theory that the Qitari and the Viis enjoyed friendly relations from the earliest of days, a vote of confidence that pleases the child greatly. Grudgingly agreeing that his son may have a point, Qitarl Natl agrees to assist in the restoration of the second stela.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Under your watchful eye, the Qitari artisans restore the second stela to Chaqurl Qhotl's best interpretation of its former glory. Encouraged and heartened by reclaiming a vital piece of their legacy, the Stewards now pursue their excavation efforts with newfound zeal. Continue to lend them your aid in their efforts should you so desire."],"objectives":["Speak with Chaqurl Qhotl."],"dialogue":[{"name":"CHAQURLQHOTL","text":"You, too, saw how Master Lanille welcomed us when we visited Fanow, yes? Why, it is simply <span class=\"emphasis\">post-preperous</span> to think that the friends of my great-great-great─and so on─grandmothers and grandfathers hunted us like vermin!"},{"name":"CHAQURLQHOTL","text":"Yes, I am quite certain that the Viis were our friends from the earliest of days. The Qitari in the markings is meant to be raising his hands in sheer joy. Surely you agree?"},{"name":"SYSTEM","text":"If you elect to vouch for Chaqurl Qhotl's theory, the second stela will be restored to reflect his interpretation of history. Proceed, and you will be unable to view the stela as Qitarl Natl envisions it."},{"name":"SYSTEM","text":"The rewards you receive and the content of the quests to follow will be the same regardless of the choice you make. You are free to choose the version of history you find most compelling."},{"name":"Q1","text":"Lend your support to Chaqurl Qhotl's theory?"},{"name":"CHAQURLQHOTL","text":"Spli-<span class=\"emphasis\">fen</span>-derous! Oh, thank you, <span class=\"highlight\">Forename</span>. I knew you would see things as I did!"},{"name":"QITARLNATL","text":"You believe my son has the right of it? Well...I suppose there is something to be said for adopting a brighter view of history. Very well, let us proceed with the restoration."},{"name":"CHAQURLQHOTL","text":"At long last, another piece of our history comes into focus! But our struggle to reclaim our legacy goes on. Pray continue to lend us your aid!"},{"name":"CHAQURLQHOTL","text":"Father and I will send for our finest artisans. The work must begin at once!"}],"reward":{"gil":642},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}],"quests":[69332]},"next":[69333]},"partials":[{"type":"npc","id":"1032659","obj":{"i":1032659,"n":"Chaqurl Qhotl","l":2957,"q":7}},{"type":"quest","id":"69332","obj":{"i":69332,"n":"Delving Deeper","g":58,"l":"The Rak'tika Greatwood","s":5,"f":1}},{"type":"quest","id":"69333","obj":{"i":69333,"n":"A Chilling Fate","g":58,"l":"The Rak'tika Greatwood","s":8,"f":1}}]}