{"quest":{"name":"Delving Deeper","location":"The Rak'tika Greatwood","id":69332,"patch":5.2,"sort":5,"icon":100969,"beast":13,"unlocksFunction":1,"eventIcon":71341,"issuer":1032735,"target":1032659,"genre":58,"journal":["The Great Serpent of Ronka wishes to impart divine wisdom unto you...or so you think.<br>※The difficulty of this quest will be synced to your current level.","You engage in a stimulating conversation with the Great Serpent of Ronka, who─you surmise from the urgency and eagerness of its screeing─is keen to see the Stewards press deeper into the tunnels of Hopl's Stopple. Should you be inclined to heed its call, seek out Chaqurl Qhotl and see how you might best proceed.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","You seek out and speak with Chaqurl Qhotl. It appears that further progress through the tunnels of Hopl's Stopple will require you to perform a ceremony in obeisance to Ox'Dalan, god of death and protector of the underworld. Qitarl Natl suggests that perhaps the Viis, as a fellow ancient race with ties to Ronka, might be able to offer apt advice in the matter. Finding his reasoning sound, you agree to accompany Chaqurl Qhotl to Fanow in search of wisdom.","Your old friends Ciuna and Phyna bid you welcome in your return to Fanow. After reminiscing about her friendship with one of Chaqurl's ancestors, Master Lanille enlightens you with the knowledge that a traditional Viis ritual may serve to appease Ox'Dalan and offer the Qitari excavation team passage to the tunnels below. At the Viis' request, you set out to procure an item suitable for use as an offering to the gods of old.","Back at Hopl's Stopple, all rejoice at your success in tracking down the offering for the ritual, which─with the help of Chaqurl Qhotl, who has diligently learned the accompanying prayer from Master Lanille─proceeds without a hitch. At long last, the second phase of the excavation may begin. After a short while spent waiting, the Qitari father and son return...what, pray tell, did they find on their expedition?","Qitarl and Chaqurl reveal that they have managed to locate the second Qitari stela which, unfortunately, is in the same shabby shape as the first one they discovered. This one appears to depict the first encounter between the Qitari and the Viis, but─not unlike last time─the father and son have different ideas about how the weathered markings should be interpreted. At the urging of yet another incarnation of the Great Serpent of Ronka─or so it appears to be─you are charged with mediating between the two and choosing the version of history that will be engraved upon the stone and passed down to posterity."],"objectives":["Speak with Chaqurl Qhotl.","Speak with Lanille in Fanow.","<span class=\"alternative-container\"><span class=\"alternative\">Mine [Error] in the K'mul Astropolis</span><span class=\"alternative\">Deliver [Error] to Qitarl Natl</span><span class=\"alternative\">Gather [Error] in the K'mul Astropolis</span><span class=\"alternative\">Catch [Error] in the Lozatl</span></span>.","Speak with Chaqurl Qhotl."],"dialogue":[{"name":"BOUSHITSUCHINOKO","text":"Scree!"},{"name":"SYSTEM","text":"The serpent jumps about joyfully. It appears that the Qitari excavation effort is proceeding swimmingly. Speak with Chaqurl Qhotl and see if there is anything you might do to lend a hand."},{"name":"CHAQURLQHOTL","text":"Oh, <span class=\"highlight\">Forename</span>! You'll be happy to know that the charm your friends fashioned for us worked most splendidly! We've been able to reach deeper depths than ever before!"},{"name":"CHAQURLQHOTL","text":"And thanks to you, the restoration of the first stela is all but complete! You simply must see it!"},{"name":"QITARLNATL","text":"...Ahem. You'll also be pleased to know that the relics and records that turned up in our subsequent trips below have confirmed that the interpretation of history that you espoused was indeed and indubitably true."},{"name":"QITARLNATL","text":"We came upon many ritual instruments in the tunnels below. It would seem that─in the empire's earliest days─the Ronkans would offer individuals chosen from the races they conquered as living sacrifices to their gods. The markings on the first stela depict just such a scene."},{"name":"QITARLNATL","text":"But this was not simply a cruel and callous tradition. Once these conquered peoples were recognized by the Ronkan gods, they were welcomed into Ronkan society, and given the chance to serve the empire and live peaceful, prosperous lives under its auspices."},{"name":"QITARLNATL","text":"It is a somewhat chilling tale, but we must be grateful to our ancestors, who gave their own lives that we who followed might live a brighter future."},{"name":"CHAQURLQHOTL","text":"To think that I am only alive today because my forefathers spilled their blood... It is a bit much to take in all at once, but I'm sure I will come to understand."},{"name":"QITARLNATL","text":"We came upon many ritual instruments in the tunnels below. It is most clear that─let it suffice to say─we Qitari have never been particularly adept at the art of war. So it was that our ancestors searched far and wide for a safe haven where they could call home."},{"name":"QITARLNATL","text":"Ronka, on the other hand, was composed of many strong peoples─the Ronso, brave warriors; the Drahn, adept at the arcane arts; and the Viis, peerless archers─all working together for the empire's prosperity."},{"name":"QITARLNATL","text":"Not long after the Qitari first made contact with the empire, our skill as scribes and scriveners became evident to high-ranking court officials, and we were offered a prominent role in Ronkan society in return for our loyal service."},{"name":"CHAQURLQHOTL","text":"Four races so different, all living and working together for the greater good! Oh, what I wouldn't give to be able to live just one day in those glorious days of the empire!"},{"name":"QITARLNATL","text":"...But our work is far from done. Indeed, in our explorations, we have found what appears to be an entrance leading to an even deeper level of the caves. I have little doubt that the remaining stelae lie further below."},{"name":"QITARLNATL","text":"I have sent a team below to conduct a preliminary investigation before we begin the next phase of the excavation in earnest. My trusted scout Towarl Manol should be here to make her report at any─"},{"name":"TWARLMANOL","text":"Master Qitarl! I bring news from below! News that I fear...is not good."},{"name":"QITARLNATL","text":"Again!? I swear─if we Qitari did not have rotten luck we would have none at all. Do tell...what did you find down there?"},{"name":"TWARLMANOL","text":"Entering the second stratum, we came upon a shrine to our protector, Ox'Dalan. It appeared to have been ravaged by the beasts that lurk below, but still it stood after all these years..."},{"name":"QITARLNATL","text":"A shrine, you say? No doubt it was erected by our ancestors, most likely to ward off some greater danger that lurks further below..."},{"name":"TWARLMANOL","text":"This was my thought as well, Master Qitarl. A cave-in? A flood? Fearsome creatures from the deep? We were too fear stricken to press onward, not knowing what manner of calamity might befall us..."},{"name":"CHAQURLQHOTL","text":"But we must press on somehow! Can we not appeal to Dalan somehow, that He might protect us as we delve further?"},{"name":"QITARLNATL","text":"Indeed...perhaps there is a suitable ritual for the occasion. Sadly, if there is, I fear it is beyond my knowledge..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I think I know a Viis who could help you..."},{"name":"A1","text":"Perhaps you might find an answer in Fanow?"},{"name":"CHAQURLQHOTL","text":"Why, yes! Indeed, the Viis are nothing if not well versed in Ronkan tradition!"},{"name":"CHAQURLQHOTL","text":"The one with hair the color of night─Master Lanille, was it? I hear she has lived as long as ten Qitari! Yes, I am certain she will have knowledge that will serve us well!"},{"name":"QITARLNATL","text":"Long-lived as they are, the wisdom they have passed down through generations doubtless rivals that which our ancestors recorded. If anyone can help us, I daresay it is them."},{"name":"CHAQURLQHOTL","text":"Good <span class=\"highlight\">Forename</span>! Pray take me to Fanow at once. I would meet their Master Lanille, that I might partake in her deep knowledge of ancient Ronkan rites."},{"name":"CHAQURLQHOTL","text":"So many Viis in one place! I can scarce believe my eyes!"},{"name":"BOUSHITSUCHINOKO","text":"Scree! Scree!"},{"name":"PHYNA","text":"<span class=\"highlight\">Forename</span>! You grace us again with your presence. Me? I will be departing on my journey any day now. Yes, as soon as I decide where my destination will be..."},{"name":"CIUNA","text":"Welcome back, <span class=\"highlight\">Forename</span>. For better or for worse, little has changed with me since last we met. Phyna, too, is as indecisive as ever..."},{"name":"LANILLE","text":"We had heard rumors the Qitari had returned to the Greatwood, but did not expect to receive a visit so soon. Just seeing you brings back memories of olden times..."},{"name":"CHAQURLQHOTL","text":"Memories? Do you mean that...you knew my ancestors?"},{"name":"LANILLE","text":"...I am older than you might think, my little friend. Anyhow, the answer is yes. Have you heard the name Shiparl Toqal? She was a close friend of mine, and would come calling often to exchange news of the wood."},{"name":"CHAQURLQHOTL","text":"Shiparl Toqal? I do believe I saw that name on Father's family tree. But if I recall correctly, she was my...great-great-great-great-great-great-great-great-grandmother!"},{"name":"LANILLE","text":"Ahahaha! It was that long ago, was it? How quickly the years fly by. Still, I am heartened by your presence, young Chaqurl. For many years after the Flood, I feared we would never see one of your kind again."},{"name":"LANILLE","text":"And you, <span class=\"highlight\">Forename</span>. Welcome back to Fanow. What brings you to us this day?"},{"name":"LANILLE","text":"...I see. Our Qitari friends seek to discover their history, and reclaim the knowledge and lore of their ancestors. An admirable goal, indeed. And doubtless not a simple task."},{"name":"CIUNA","text":"We would be honored to lend you our aid, and reforge the bonds between our peoples that were so strong in the days of Ronka. Now, do tell me more about these tunnels you are exploring!"},{"name":"PHYNA","text":"My dear sister has quite a weakness for ancient Ronkan ruins and relics, you see."},{"name":"PHYNA","text":"To tell the truth, I had been preparing to leave the Greatwood on a journey of the realm. But if the Qitari require my aid, perhaps I could postpone my departure just a bit longer..."},{"name":"BOUSHITSUCHINOKO","text":"Scree!"},{"name":"LANILLE","text":"It would seem that the great serpent smiles upon our partnership as well. This is auspicious, indeed."},{"name":"CIUNA","text":"Master Lanille, what knowledge of the Qitari lives on here in Fanow?"},{"name":"LANILLE","text":"Very little, I am afraid─the tales I can remember hearing from my dear departed friend, and no more. Sadly, the precise details of Qitari rites and rituals are beyond my recollection."},{"name":"LANILLE","text":"And yet, I do recall Shiparl once mentioning that Qitari prayers to Ox'Dalan were remarkably similar in form to our own petitions to Yx'Maja."},{"name":"LANILLE","text":"It is not so surprising, perhaps, given how closely our two peoples were connected in those days. If we were to teach you one of our own traditions, mayhap you could adapt it for your own purposes?"},{"name":"CHAQURLQHOTL","text":"You would do this for us!?"},{"name":"LANILLE","text":"Gladly, old friend. But first, we will need to prepare a simple altar for performing the rite, and find ourselves a suitable offering."},{"name":"LANILLE","text":"The liver and blood of an ancient beast, together with pristine water from a sacred spring near the K'mul Astropolis. Yes, I do believe this will suffice."},{"name":"LANILLE","text":"The liver and blood of an ancient beast, together with the root of a spiritweed, a rare shrub that grows near the K'mul Astropolis. Yes, I do believe this will suffice."},{"name":"LANILLE","text":"The liver and blood of an ancient beast, together with a single Dalan's claw─a rare crustacean that lurks in the chill waters of the Lozatl."},{"name":"CIUNA","text":"I know the ways of the beasts of the wood─leave the hunting to me. As for the final offering, I suspect <span class=\"highlight\">Forename</span> would have little difficulty acquiring it, yes?"},{"name":"LANILLE","text":"Excellent. In the meanwhile, I will teach the ritual to young Chaqurl here. Were the passage into the tunnels larger, we would accompany you ourselves, but alas..."},{"name":"CHAQURLQHOTL","text":"Do not worry, my good Master Lanille! I will learn the words and gestures well, and Dalan will hear our plea! Just you wait and see!"},{"name":"PHYNA","text":"You're a spirited one, child. But be forewarned: Master Lanille is a strict taskmistress."},{"name":"CHAQURLQHOTL","text":"Egads! F-Forgive me, my friends. I will do my best. Anyhow, let us all reconvene at Hopl's Stopple when we are finished with our allotted tasks."},{"name":"CHAQURLQHOTL","text":"Master Lanille won't be too hard on me, will she?"},{"name":"LANILLE","text":"I thank you, friend. It is not every day that we can reunite with friends from an age long past."},{"name":"BOUSHITSUCHINOKO","text":"Scree...eee?"},{"name":"SYSTEM","text":"The great serpent lets out a high-pitched squeal. It appears to be quite pleased to see the Qitari and the Viis working together toward a common good."},{"name":"QITARLNATL","text":"I was wondering when you might return, <span class=\"highlight\">Forename</span>! Have you found the offering that we require?"},{"name":"QITARLNATL","text":"The Viis believe that one of their rituals will suffice to appease Dalan? I am skeptical, but I suppose we have little choice but to try. Should you find a suitable offering, pray bring it to us."},{"name":"QITARLNATL","text":"The Viis believe this will suffice as an offering to Dalan? ...Very well, so be it. As soon as Chaqurl and the Viis arrive, we shall begin the second phase of the excavation."},{"name":"CIUNA","text":"Why, just look at all the Qitari scurrying about! I had heard they were an industrious people, but to see it with my own eyes is impressive indeed!"},{"name":"PHYNA","text":"Hail, and well met. I am Phyna of Fanow, and this is my sister Ciuna. We have come to assist in the ritual of which your son has doubtless told you."},{"name":"QITARLNATL","text":"Greetings, greetings. Please accept my apologies for making a fuss so close to your village, and without properly paying my respects. I fear I've been quite preoccupied with my duties here..."},{"name":"PHYNA","text":"There is no need for that, friend. It is we who should apologize for our sisters who gave you such a fright upon your return home..."},{"name":"CIUNA","text":"As you may well know, our peoples were strong friends and allies in the days of Ronka. It is our honor to reforge those bonds in the present day. Should you require anything of us, you need but say the word."},{"name":"PHYNA","text":"Anyhow, thanks to <span class=\"highlight\">Forename</span> here, it would seem we have all the offerings needed to proceed with the ritual. Do you remember all that Master Lanille taught you, Chaqurl?"},{"name":"CHAQURLQHOTL","text":"But of course! I said the words over to myself a hundred hundred times on the way here! I will do your Master Lanille and my people proud!"},{"name":"QITARLNATL","text":"I should hope so, my son. Very well! Let the dig begin!"},{"name":"SYSTEM","text":"Some time later..."},{"name":"SYSTEM","text":"Qitarl Natl and Chaqurl Qhotl have safely returned from their investigation of the tunnels."},{"name":"HELMETTSUCHINOKO","text":"Scree?"},{"name":"PHYNA","text":"Another avatar of the great serpent? What is the meaning of this?"},{"name":"CIUNA","text":"It would seem that things beyond our understanding are afoot in the depths below..."},{"name":"CHAQURLQHOTL","text":"I...I cannot say for sure. We found a second stela, but I fear─much as the last one─it proved too massive to carry to the surface."},{"name":"QITARLNATL","text":"Just as we were pondering our next course of action, this armor-clad fellow arrived, and let out a mighty─"},{"name":"HELMETTSUCHINOKO","text":"Screeeeeeeee!"},{"name":"QITARLNATL","text":"...Er, precisely. While I cannot confess to fully understand the import of what it is saying, I can only surmise that the serpent once again wishes for us to call upon the wisdom of the ally of Ronka─<span class=\"highlight\">Forename</span>, that is─and restore the stela to its erstwhile form."},{"name":"QITARLNATL","text":"And yet, much as last time, the engravings are weathered to no small degree. I have my own thoughts about what they signify, but I would hear my son's theory first. What say you, Chaqurl?"},{"name":"CHAQURLQHOTL","text":"Well, let me see now... One marking was clearly of a Viis, nocking a bow. Then I could make out the semblance of a Qitari, its arms seemingly held in the air..."},{"name":"CIUNA","text":"The image of a Viis on a Qitari stone? How fascinating..."},{"name":"CHAQURLQHOTL","text":"Just as the first stela depicted our history with the Ronkan Empire, no doubt these markings tell of the first encounter between our two peoples..."},{"name":"CHAQURLQHOTL","text":"Having befriended the benevolent Ronkans, our people then met the Viis, skilled hunters and wise to the ways of the forest! So pleased were our ancestors, that they threw their hands into the air in glee!"},{"name":"QITARLNATL","text":"That is a most...<span class=\"emphasis\">optimistic</span> interpretation, my boy."},{"name":"QITARLNATL","text":"And yet I feel it is more logical to read the stone a different way. Doubtless the Viis came upon our ancestors, small and scurrying about the forest, and took them for prey."},{"name":"QITARLNATL","text":"Facing arrows pointed at their hearts, our ancestors threw up their hands in sheer terror. So it was that the Viis─newcomers to the Greatwood─nearly came into conflict with the mighty Ronkan Empire..."},{"name":"PHYNA","text":"Our legends tell of how the goddess Yx'Maja guided our people to the forest, but say little of what awaited us upon our arrival there. As far as we can say, both theories are more than plausible. Still, I would hope to believe..."},{"name":"PHYNA","text":"...No. I will say no more. It would ill behoove me to stick my nose in matters of Qitari lore."},{"name":"CIUNA","text":"I agree. Qitari history should be written by the Qitari themselves. In any event, we are pleased that we were able to contribute to your cause in some small way."},{"name":"CIUNA","text":"We shall return to Fanow, but please do not hesitate to call upon us again. There is still much catching up to do between our peoples."},{"name":"QITARLNATL","text":"Once again, it seems we find ourselves with a choice to make..."},{"name":"BOUSHITSUCHINOKO","text":"Scree! Scree!"},{"name":"CHAQURLQHOTL","text":"Yes, <span class=\"highlight\">Forename</span>! Do impart unto us your wisdom once more! How are you inclined to interpret our history?"},{"name":"SYSTEM","text":"Again, father and son have arrived at different theories regarding the history of the Qitari as recorded on the stela. At the bidding of the great serpent, it falls to you to serve as mediator."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Respected</span> reputation with the Stewards."},{"name":"SYSTEM","text":"With the wisdom and blessing of the Viis, an altar to Ox'Dalan has been constructed at Hopl's Stopple. Doubtless this will serve to protect and impart good fortune to the Qitari as they continue to explore the tunnels."},{"name":"SYSTEM","text":"New Qitari tribal daily quests are now available from Qhoterl Pasol at Hopl's Stopple."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Qhoterl Pasol as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Qhoterl Pasol. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"Furthermore, you now have access to a wider selection of wares from Yuqurl Manl."}],"reward":{"gil":1007},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":32}],"questsType":"any","quests":[69336,69337]},"next":[69338,69339]},"partials":[{"type":"npc","id":"1032735","obj":{"i":1032735,"n":"Qitari Serpent","l":2957,"q":3}},{"type":"npc","id":"1032659","obj":{"i":1032659,"n":"Chaqurl Qhotl","l":2957,"q":7}},{"type":"quest","id":"69336","obj":{"i":69336,"n":"The First Stela: Of Ronkan Might","g":58,"l":"The Rak'tika Greatwood","s":3,"f":1}},{"type":"quest","id":"69337","obj":{"i":69337,"n":"The First Stela: Of Ronkan Benevolence","g":58,"l":"The Rak'tika Greatwood","s":4,"f":1}},{"type":"quest","id":"69338","obj":{"i":69338,"n":"The Second Stela: The Hunters and the Hunted","g":58,"l":"The Rak'tika Greatwood","s":6,"f":1}},{"type":"quest","id":"69339","obj":{"i":69339,"n":"The Second Stela: Fast Friends","g":58,"l":"The Rak'tika Greatwood","s":7,"f":1}}]}