{"quest":{"name":"The Second Stela: The Hunters and the Hunted","location":"The Rak'tika Greatwood","id":69338,"patch":5.2,"sort":6,"icon":100973,"beast":13,"unlocksFunction":1,"eventIcon":71341,"issuer":1032660,"target":1032660,"genre":58,"journal":["Qitarl Natl would convince you of the merits regarding his theory of the history between the Qitari and the Viis.<br>※The difficulty of this quest will be synced to your current level.","Convinced of the merits of Qitarl Natl's argument, you express your support for his theory that his people were originally hunted by the Viis, a vote of confidence that pleases the Qitari steward greatly. Grudgingly agreeing that his father may have a point, the Qitari youngling Chaqurl Qhotl agrees to assist in the restoration of the second stela.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Under your watchful eye, the Qitari artisans restore the second stela to Qitarl Natl's best interpretation of its former glory. Encouraged and heartened by reclaiming a vital piece of their legacy, the Stewards now pursue their excavation efforts with newfound zeal. Continue to lend them your aid in their efforts should you so desire."],"objectives":["Speak with Qitarl Natl."],"dialogue":[{"name":"QITARLNATL","text":"History is full of cruelties and harsh truths. While my boy would propose a starry-eyed view of our past, I prefer to face reality with my eyes wide open."},{"name":"QITARLNATL","text":"The Viis and Qitari forged a friendship trusted and true. Acknowledging the unpleasant nature of our first encounter allows us to appreciate that all the more. Surely you agree, <span class=\"highlight\">Forename</span>?"},{"name":"SYSTEM","text":"If you elect to vouch for Qitarl Natl's theory, the stela will be restored to reflect his interpretation of history. Proceed, and you will be unable to view the stela as Chaqurl Qhotl envisions it."},{"name":"SYSTEM","text":"The rewards you receive and the content of the quests to follow will be the same regardless of the choice you make. You are free to choose the version of history you find most compelling."},{"name":"Q1","text":"Lend your support to Qitarl Natl's theory?"},{"name":"QITARLNATL","text":"Excellent. I was quite certain that you would see things my way. With the ally of Ronka vouching for my theory, I'm certain Chaqurl and my fellow Qitari will see the light."},{"name":"CHAQURLQHOTL","text":"Do you truly think so? Then perhaps there is something to Father's theory after all... In any event, the choice has been made, and I am happy to do what must be done."},{"name":"QITARLNATL","text":"Splendid, my boy! And with that, let the restoration of the second stela begin! Good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, do stay with us and help us see our mission through to the end."},{"name":"QITARLNATL","text":"I shall summon the artisans! Oh, but I can scarcely wait to see another piece of our history take form!"},{"name":"SYSTEM","text":"The second Qitari stela has been restored to depict Qitarl Natl's interpretation of the first encounter between the Qitari and the Viis."},{"name":"SYSTEM","text":"Protected by the new altar erected according to the traditions of the Viis and heartened by rediscovering another piece of their heritage, the Stewards have returned to their excavation efforts with newfound zeal. Should you choose, continue to aid them in their cause."},{"name":"SYSTEM","text":"The second Qitari stela has been restored to depict Chaqurl Qhotl's interpretation of the first encounter between the Qitari and the Viis."},{"name":"SYSTEM","text":"Protected by the new altar erected according to the traditions of the Viis and heartened by rediscovering another piece of their heritage, the Stewards have returned to their excavation efforts with newfound zeal. Should you choose, continue to aid them in their cause."}],"reward":{"gil":642},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}],"quests":[69332]},"next":[69333]},"partials":[{"type":"npc","id":"1032660","obj":{"i":1032660,"n":"Qitarl Natl","l":2957,"q":5}},{"type":"quest","id":"69332","obj":{"i":69332,"n":"Delving Deeper","g":58,"l":"The Rak'tika Greatwood","s":5,"f":1}},{"type":"quest","id":"69333","obj":{"i":69333,"n":"A Chilling Fate","g":58,"l":"The Rak'tika Greatwood","s":8,"f":1}}]}