{"quest":{"name":"A Tool's Errand","location":"The Rak'tika Greatwood","id":69342,"patch":5.2,"sort":101,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["By the look in her eyes, Qhoterl Pasol has tools on her mind.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid iron ore in the Blind Forest of Yx'Maja</span><span class=\"alternative\">Deliver the splendid iron ore to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid flax in the Blind Forest of Yx'Maja</span><span class=\"alternative\">Deliver the splendid flax to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid clawbow at Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid clawbow to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Rigorously as we work, we quickly wear down our tools until there's nothing left save the hilt. And a tool with only a hilt is no tool at all, I'm sure you'll agree."},{"name":"QHOTERLPASOL","text":"To be sure, not <span class=\"emphasis\">all</span> of our implements have hilts, but the point stands that we need to replace them quite regularly. And it's my responsibility to ensure that we always have the materials with which to make them."},{"name":"QHOTERLPASOL","text":"To that end, I'd be much obliged if you could mine for me, shall we say, three chunks of iron ore. They can be found in the Blind Forest of Yx'Maja. My thanks in advance, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"QHOTERLPASOL","text":"To that end, I'd be much obliged if you could gather for me, shall we say, three clumps of flax. They can be found in the Blind Forest of Yx'Maja. My thanks in advance, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"QHOTERLPASOL","text":"To that end, I'd be much obliged if you could catch a clawbow for me. They're native to the Blind Forest of Yx'Maja, and I'm given to understand that fruit worms make the best bait. My thanks in advance, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"QHOTERLPASOL","text":"Remember, it's three chunks of iron ore I require. You will find them in the Blind Forest of Yx'Maja. My thanks in advance, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"QHOTERLPASOL","text":"Remember, it's three clumps of flax I require. You will find them in the Blind Forest of Yx'Maja. My thanks in advance, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"QHOTERLPASOL","text":"Remember, it's a clawbow I require. They're native to the Blind Forest of Yx'Maja, and I'm given to understand that fruit worms make the best bait. My thanks in advance, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"QHOTERLPASOL","text":"Jolly good, you're returned. And with the requested item, I trust?"},{"name":"QHOTERLPASOL","text":"My, such splendid chunks of ore these are! They shall make the sturdiest shovels and pickaxes, oh yes!"},{"name":"QHOTERLPASOL","text":"My, such splendid clumps of flax these are! They shall make the sturdiest rope, oh yes!"},{"name":"QHOTERLPASOL","text":"My, such a splendid specimen of clawbow this is! Their sturdy pincers can find use in many a tool, oh yes. My gratitude, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>!"},{"name":"QHOTERLPASOL","text":"Thanks to your kind assistance, we have all that we require for now, but we'll have need of more before long. I hope that you'll lend us your procuring expertise again."}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}