{"quest":{"name":"Making Scents","location":"The Rak'tika Greatwood","id":69348,"patch":5.2,"sort":107,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol has a nose for perfumes.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid amber at Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid amber to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid lavender at Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid lavender to Qhoterl Pasol</span><span class=\"alternative\">Spearfish a splendid pirarucu in the depths of Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid pirarucu to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"You're doubtless aware, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, that we Qitari possess eminently keen noses. Even in pitch-black darkness, we can discern one of our own from another and locate them."},{"name":"QHOTERLPASOL","text":"However, the caverns we explore can be filled with strange gases that confuse our sense of smell. To cut through this haze, we've taken to using a special perfume, which I would concoct with your assistance."},{"name":"QHOTERLPASOL","text":"At Mjrl's Regret, it is possible to find amber─a key ingredient in the perfume. Will you not mine three pieces for me?"},{"name":"QHOTERLPASOL","text":"At Mjrl's Regret, it is possible to find lavender─a key ingredient in the perfume. Will you not gather three sprigs for me?"},{"name":"QHOTERLPASOL","text":"In the waters of Lake Tusi Mek'ta dwells a fish called the pirarucu─a key ingredient in the perfume. Will you not catch one for me?"},{"name":"QHOTERLPASOL","text":"That will suffice to make a goodly batch of the stuff to help keep us safe during our explorations. Much obliged, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>!"},{"name":"SYSTEM","text":"In order to proceed with this quest, you must first complete the quest “A New Fishing Ex-spear-ience” and unlock spearfishing."},{"name":"QHOTERLPASOL","text":"It is possible to find amber at Mjrl's Regret. I'd be much obliged if you could obtain three pieces for me."},{"name":"QHOTERLPASOL","text":"It is possible to find lavender at Mjrl's Regret. I'd be much obliged if you could obtain three sprigs for me."},{"name":"QHOTERLPASOL","text":"It is possible to find pirarucu in the waters of Lake Tusi Mek'ta. I'd be much obliged if you could catch one for me."},{"name":"QHOTERLPASOL","text":"&lt;sniff&gt; &lt;sniff&gt; You've returned with what I seek, and no mistake. Now, if I might examine it..."},{"name":"QHOTERLPASOL","text":"My, such a potent smell! This will serve most splendidly, oh yes!"},{"name":"QHOTERLPASOL","text":"With a spot of refining, it will make a scent that is unmistakable in the caverns. Hehe, 'tis time once again to put my skills as a perfumer to use!"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}