{"quest":{"name":"Marks of Friendship","location":"The Rak'tika Greatwood","id":69349,"patch":5.2,"sort":108,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol knows that a gift or three never goes astray.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Deliver the jadeite adornments to the denizens of Fanow.","Report to Qhoterl Pasol."],"dialogue":[{"name":"QHOTERLPASOL","text":"During one of our recent outings, we came upon some lovely jadeite adornments. The stones each bear an etching of a Viis, which marks them as relics of the Ronkan Empire."},{"name":"QHOTERLPASOL","text":"As a gesture of friendship, I've a mind to present them to the good folk of Fanow, but I believe that the gift would be all the more meaningful coming from you, the ally of Ronka."},{"name":"QHOTERLPASOL","text":"I should be so very grateful were you to deliver these three adornments in my stead, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"TILMET","text":"Greetings, ally of Ronka. Is there something you require? ...A gift for me, you say?"},{"name":"TILMET","text":"Well now, this is indeed a surprise. In the times of the empire, such jadeite adornments symbolized magical might."},{"name":"TILMET","text":"They were prized items, and I am honored to receive it. Pray pass my regards to our friends of the Qitari."},{"name":"TILMET","text":"Oh, another adornment? I know not what I've done to deserve such kindness, but I'm thankful nonetheless."},{"name":"OLMET","text":"Well met, honored ally. What brings you to Fanow this day?"},{"name":"OLMET","text":"...Hm. Unless I am mistaken, this adornment was crafted in ancient times to commemorate the friendship between our people and the Qitari."},{"name":"OLMET","text":"The whorled pattern enclosing the Viis symbolizes eternity─a prayer for enduring harmony, I shouldn't doubt."},{"name":"OLMET","text":"This is a gift of no less than a piece of history, and I am duly grateful for it. My heartful thanks to our Qitari friends."},{"name":"OLMET","text":"Oh, you wish to give me another one of these? Far be it from me to decline the generosity of our Qitari friends. My thanks."},{"name":"SHOINA","text":"Hm? You have something for me, you say?"},{"name":"SHOINA","text":"My, such a lovely adornment this is. To simply gaze upon it makes me feel closer to our ancestors."},{"name":"SHOINA","text":"Please give the Qitari my thanks, and tell them that they may call upon me in times of need."},{"name":"SHOINA","text":"Oh, another one of these lovely adornments. Please give the Qitari my thanks, and tell them that they may call upon me in times of need."},{"name":"TILMET","text":"I am honored for the gift. Pray pass my regards to our friends of the Qitari."},{"name":"OLMET","text":"This is a gift of no less than a piece of history. My heartful thanks to our Qitari friends."},{"name":"SHOINA","text":"Please give the Qitari my thanks, and tell them that they may call upon me in times of need."},{"name":"QHOTERLPASOL","text":"Ah, welcome back, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. May I ask how the adornments were received?"},{"name":"QHOTERLPASOL","text":"...Splendid, splendid. Should we chance to unearth more, I will be certain to make gifts of them again."}],"reward":{"gil":606,"reputation":60,"items":[{"id":28187}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}}]}