{"quest":{"name":"Power to the Vegetables","location":"The Rak'tika Greatwood","id":69346,"patch":5.2,"sort":105,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol would send you on an errand to Slitherbough.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Use the fertilizer at the vegetable plots.","Speak with Ersabel.","Deliver the vegetables to Qhoterl Pasol."],"dialogue":[{"name":"QHOTERLPASOL","text":"Thanks to Master Valan's kind introduction, we were able to establish friendly relations with the good folk of Slitherbough."},{"name":"QHOTERLPASOL","text":"To mark the occasion, we presented them with our special fertilizer. So happy were they with the gift, they asked if they could have more!"},{"name":"QHOTERLPASOL","text":"Oh yes, we now have an arrangement in place where we provide fertilizer to the settlement in exchange for fresh vegetables."},{"name":"QHOTERLPASOL","text":"If you're not otherwise occupied, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, would you mind taking some fertilizer and using it on the crops at Slitherbough? When you have finished, please report to a woman named Ersabel."},{"name":"ERSABEL","text":"Qhoterl Pasol sent you to fertilize our crops, did she? My thanks for your trouble."},{"name":"ERSABEL","text":"I know not how the Qitari make the stuff, but in all my years, I've not seen any fertilizer work as effectively as theirs."},{"name":"ERSABEL","text":"It makes our vegetables grow like a charm, and we're all too happy to share the harvest with our Qitari friends. Please see this delivered to them."},{"name":"ERSABEL","text":"My thanks again for the fertilizer. Please see that the vegetables are delivered to Qhoterl Pasol."},{"name":"QHOTERLPASOL","text":"Welcome back, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. May I ask if you have the vegetables?"},{"name":"QHOTERLPASOL","text":"My, such splendid crops these are, fairly bursting with the land's vitality! They're a blessing from Dalan Himself!"},{"name":"QHOTERLPASOL","text":"Everyone will be overjoyed for this treat─my dear husband not least of all!"}],"reward":{"gil":679,"reputation":60,"items":[{"id":28187}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}}]}