{"quest":{"name":"The Third Stela: A Famine for Fishmen","location":"The Rak'tika Greatwood","id":69340,"patch":5.2,"sort":9,"icon":100973,"beast":13,"unlocksFunction":1,"eventIcon":71341,"issuer":1032660,"target":1032660,"genre":58,"journal":["Qitarl Natl would persuade you of the truth of his theory regarding the fate of the mysterious race of catfish people.<br>※The difficulty of this quest will be synced to your current level.","Convinced of the merits of Qitarl Natl's argument, you express your support for his theory that the Qitari drove the catfish people from the forest, thus bringing about their subsequent extinction. Grudgingly agreeing that his father may have a point, the Qitari youngling Chaqurl Qhotl agrees to assist in the restoration of the third stela.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Under your watchful eye, the Qitari artisans restore the third stela to Qitarl Natl's best interpretation of its former glory. Encouraged and heartened by reclaiming a vital piece of their legacy, the Stewards now pursue their excavation efforts with newfound zeal. Continue to lend them your aid in their efforts should you so desire."],"objectives":["Speak with Qitarl Natl."],"dialogue":[{"name":"QITARLNATL","text":"The meaning of the markings on the third stela could not be more clear. Our forebears went to war with the catfish people over control of the fishing grounds."},{"name":"QITARLNATL","text":"With the might of the great Ronkan Empire on our side, we drove those slimy creatures out of the Greatwood once and for all, and never were their kind seen again. Truly a triumphant day in history, would you not agree?"},{"name":"SYSTEM","text":"If you elect to vouch for Qitarl Natl's theory, the stela will be restored to reflect his interpretation of history. Proceed, and you will be unable to view the stela as Chaqurl Qhotl envisions it."},{"name":"SYSTEM","text":"The rewards you receive and the content of the quests to follow will be the same regardless of the choice you make. You are free to choose the version of history you find most compelling."},{"name":"Q1","text":"Speak out in favor of Qitarl Natl's theory?"},{"name":"QITARLNATL","text":"Magnificent! I knew that a wise and impartial observer such as you would see things as I did."},{"name":"CHAQURLQHOTL","text":"I would rather not think of our ancestors as aggressors...and yet, perhaps there is truth to what Father says. If this is your decision, I will learn to accept it."},{"name":"QITARLNATL","text":"That is most mature of you, my boy. And with that, let us begin the restoration of the stela without further ado. You, too, are curious to see what form it takes, are you not? Do stay around for a while."},{"name":"QITARLNATL","text":"And with that, I shall call for the artisans. Oh, what a splendiferous day this has turned out to be!"},{"name":"SYSTEM","text":"The third Qitari stela has been restored to depict Qitarl Natl's interpretation of the history between the Qitari and the ill-fated catfish people."},{"name":"SYSTEM","text":"Outfitted with supplies and conveniences brought by the Night's Blessed, Hopl's Stopple is more hospitable than ever before. Rejoicing in their newfound comfort, the Qitari have returned to their excavation effort with renewed energy and enthusiasm. One can only imagine what marvelous discoveries are yet to come!"},{"name":"SYSTEM","text":"The third Qitari stela has been restored to depict Chaqurl Qhotl's interpretation of the history between the Qitari and the ill-fated catfish people."},{"name":"SYSTEM","text":"Outfitted with supplies and conveniences brought by the Night's Blessed, Hopl's Stopple is more hospitable than ever before. Rejoicing in their newfound comfort, the Qitari have returned to their excavation effort with renewed energy and enthusiasm. One can only imagine what marvelous discoveries are yet to come!"}],"reward":{"gil":642},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":32}],"quests":[69333]},"next":[69334]},"partials":[{"type":"npc","id":"1032660","obj":{"i":1032660,"n":"Qitarl Natl","l":2957,"q":5}},{"type":"quest","id":"69333","obj":{"i":69333,"n":"A Chilling Fate","g":58,"l":"The Rak'tika Greatwood","s":8,"f":1}},{"type":"quest","id":"69334","obj":{"i":69334,"n":"What Ails the Forest","g":58,"l":"The Rak'tika Greatwood","s":11,"f":1}}]}