{"quest":{"name":"The Third Stela: A Feast for Fishmen","location":"The Rak'tika Greatwood","id":69341,"patch":5.2,"sort":10,"icon":100974,"beast":13,"unlocksFunction":1,"eventIcon":71341,"issuer":1032659,"target":1032659,"genre":58,"journal":["Chaqurl Qhotl would persuade you of the truth of his theory regarding the fate of the mysterious race of catfish people.<br>※The difficulty of this quest will be synced to your current level.","Convinced of the merits of Chaqurl Qhotl's argument, you express your support for his theory that the Qitari sought to share their food supply with the suffering catfish people, before the latter tribe's unfortunate disappearance from the forest. Grudgingly agreeing that his son may have a point, the stubborn Qitari agrees to assist in the restoration of the third stela.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Under your watchful eye, the Qitari artisans restore the third stela to Chaqurl Qhotl's best interpretation of its former glory. Encouraged and heartened by reclaiming yet another vital piece of their legacy, the Stewards now pursue their excavation efforts with newfound zeal. Continue to lend them your aid in their efforts should you so desire."],"objectives":["Speak with Chaqurl Qhotl."],"dialogue":[{"name":"CHAQURLQHOTL","text":"Father may interpret the markings differently, but I am certain that my ancestors were not so cruel and violent as he would say. When famine struck the forest, we Qitari took pity on the catfish people, and shared with them our freshest catches!"},{"name":"CHAQURLQHOTL","text":"That they vanished from the Greatwood after this is a pity, but I know that our forefathers did all they could to save their slippery little friends. This is most definitely, most in-<span class=\"emphasis\">tubit</span>-ably the case, do you not agree?"},{"name":"SYSTEM","text":"If you vouch for Chaqurl Qhotl's theory, the third stela will be restored to reflect his interpretation of history. Proceed, and you will be unable to view the stela as Qitarl Natl envisions it."},{"name":"SYSTEM","text":"The rewards you receive and the content of the quests to follow will be the same regardless of the choice you make. You are free to choose the version of history you find most compelling."},{"name":"Q1","text":"Lend your support to Chaqurl Qhotl's theory?"},{"name":"CHAQURLQHOTL","text":"Mag-<span class=\"emphasis\">fin</span>-icent! I knew we shared a like mind, you and I."},{"name":"QITARLNATL","text":"Perhaps the boy is right, and history is at times not so cruel as it may seem at a glance. In any event, if you truly find his version of events more compelling, I see no reason to object."},{"name":"CHAQURLQHOTL","text":"Spli-<span class=\"emphasis\">fen</span>-derous! And with that, let's get the restoration of the third stela started! You'll stick around to see that everything is done right, won't you? Whenever you are ready to begin, just say the word!"},{"name":"CHAQURLQHOTL","text":"Are you ready, <span class=\"highlight\">Forename</span>? Then Father and I shall call for our best artisans at once!"}],"reward":{"gil":642},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":32}],"quests":[69333]},"next":[69334]},"partials":[{"type":"npc","id":"1032659","obj":{"i":1032659,"n":"Chaqurl Qhotl","l":2957,"q":7}},{"type":"quest","id":"69333","obj":{"i":69333,"n":"A Chilling Fate","g":58,"l":"The Rak'tika Greatwood","s":8,"f":1}},{"type":"quest","id":"69334","obj":{"i":69334,"n":"What Ails the Forest","g":58,"l":"The Rak'tika Greatwood","s":11,"f":1}}]}