{"quest":{"name":"Mother's Recipe","location":"The Rak'tika Greatwood","id":69345,"patch":5.2,"sort":104,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["One cannot excavate on an empty stomach, as Qhoterl Pasol well knows.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid ant eggs at Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid ant eggs to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid silkworms at Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid silkworms to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid robber crab at the Lozatl</span><span class=\"alternative\">Deliver the splendid robber crab to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Digging is whisker-warping work, as I'm sure you will agree. If one is to keep at it day in and day out, one must have good, nourishing meals."},{"name":"QHOTERLPASOL","text":"If you're willing, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, might I trouble you to bring some ingredients so that I can prepare a hearty meal for everyone? My Chaqurl, in particular, is still a growing boy, and few things please me more than to see his belly full and round."},{"name":"QHOTERLPASOL","text":"For the dish I plan to make, I still require three ant eggs. If you search in the vicinity of Mjrl's Regret, you should be able to dig them up readily enough."},{"name":"QHOTERLPASOL","text":"For the dish I plan to make, I still require three silkworms. If you search in the vicinity of Mjrl's Regret, you should be able to gather them readily enough."},{"name":"QHOTERLPASOL","text":"For the dish I plan to make, I still require a robber crab. If you fish at the Lozatl using fruit worms, I daresay they'll bite readily enough."},{"name":"QHOTERLPASOL","text":"Three ant eggs ought to suffice for the dish I plan to make. If you search in the vicinity of Mjrl's Regret, you should be able to dig them up readily enough."},{"name":"QHOTERLPASOL","text":"Three silkworms ought to suffice for the dish I plan to make. If you search in the vicinity of Mjrl's Regret, you should be able to gather them readily enough."},{"name":"QHOTERLPASOL","text":"One robber crab ought to suffice for the dish I plan to make. If you fish at the Lozatl using fruit worms as bait, I daresay they'll bite readily enough."},{"name":"QHOTERLPASOL","text":"How fares the procuring effort, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>?"},{"name":"QHOTERLPASOL","text":"Ah, splendid! I shall stew these eggs with spices and serve them with cornbread."},{"name":"QHOTERLPASOL","text":"A delectable combination, as my Chaqurl will attest. He doesn't leave so much as a single crumb behind!"},{"name":"QHOTERLPASOL","text":"Ah, splendid! Plump and fresh as they are, these silkworms are best prepared simply─fried and salted."},{"name":"QHOTERLPASOL","text":"If there's a way to my husband's stomach, I can say with confidence that this dish is it. The shine in his eyes doesn't lie!"},{"name":"QHOTERLPASOL","text":"Ah, splendid! I shall boil this crab whole with vegetables and serve it with steamed grains!"},{"name":"QHOTERLPASOL","text":"I'm not too proud to admit that this is my personal favorite. Ah, the mere thought of it makes my mouth water... &lt;slurp&gt;"},{"name":"QHOTERLPASOL","text":"Without further ado, I shall set about preparing the meal. We are all in for a treat, and it is thanks to you, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>!"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}