{"quest":{"name":"The Qitari Book of Records","location":"The Rak'tika Greatwood","id":69356,"patch":5.2,"sort":115,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol's tireless recordkeeping has all but exhausted her supply of writing materials.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid graphite in the Blind Forest of Yx'Maja</span><span class=\"alternative\">Deliver the splendid graphite to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid tarichuk feathers in the Blind Forest of Yx'Maja</span><span class=\"alternative\">Deliver the splendid tarichuk feathers to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid silver kitten near the Red Chalice</span><span class=\"alternative\">Deliver the splendid silver kitten to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Goodness me! I may not look it, but I'm incredibly busy. Just keeping track of the recent discoveries is enough to make my head spin! Not to mention all the maps and charts we draw..."},{"name":"QHOTERLPASOL","text":"That's why I have to make detailed records of everything, and we only use traditional methods passed down from the Ronkans."},{"name":"QHOTERLPASOL","text":"I'll need several chunks of graphite, which we'll grind down and use to produce ink. Fear not, the reward will make it worth the trouble, I assure you!"},{"name":"QHOTERLPASOL","text":"I'll need several tarichuk feathers, which we'll use for writing quills. Fear not, the reward will make it worth the trouble, I assure you!"},{"name":"QHOTERLPASOL","text":"I'll need a silver kitten, whose skin is used in the ink-making process. Fear not, it's a type of fish, not an actual kitten! I must say, it's rather fortunate I remembered to mention that..."},{"name":"QHOTERLPASOL","text":"The Blind Forest is where we usually go to gather things like that, but none of the others can spare the time..."},{"name":"QHOTERLPASOL","text":"The Blind Forest is where we usually go to gather things like that, but none of the others can spare the time..."},{"name":"QHOTERLPASOL","text":"Our fishers usually go to the Red Chalice with a bucket of fruit worms to catch them, but I'm afraid you're the only one who can spare the time..."},{"name":"QHOTERLPASOL","text":"Oh, I <span class=\"emphasis\">am</span> glad to see you safe and sound. I hope you didn't run into any trouble on my account!"},{"name":"QHOTERLPASOL","text":"Splendid! That's exactly what I was after! It won't be long before I'll have a brand-new set of writing supplies, with which I shall scrawl away to my heart's content!"},{"name":"QHOTERLPASOL","text":"Other than unearthing lost treasures, we Qitari love nothing more than keeping records of our achievements. Even those too young to write can often be seen drawing maps of the places they've visited. Adorable, isn't it?"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}