{"quest":{"name":"Salve Our Souls","location":"The Rak'tika Greatwood","id":69351,"patch":5.2,"sort":110,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol is despairing at the workers' clumsiness.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid mineral oil in the K'mul Astropolis</span><span class=\"alternative\">Deliver the splendid mineral oil to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid greenwattle in the K'mul Astropolis</span><span class=\"alternative\">Deliver the splendid greenwattle to Qhoterl Pasol</span><span class=\"alternative\">Gather a splendid pondfrond at the Lozatl</span><span class=\"alternative\">Deliver the splendid pondfrond to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Underground caverns can be frightfully dangerous, you know! The workers are constantly tripping over and grazing their snouts and whatnot."},{"name":"QHOTERLPASOL","text":"Thankfully, the Viis were kind enough to share a recipe for a salve that works wonders for scrapes and cuts. If you're not terribly busy, I was wondering if you'd help gather some of the necessary ingredients?"},{"name":"QHOTERLPASOL","text":"For now, I need some mineral oil, which you should be able to find near the K'mul Astropolis. There's no rush, but sooner is always infinitely preferable to later!"},{"name":"QHOTERLPASOL","text":"For now, I need some greenwattle, which you should be able to find near the K'mul Astropolis. There's no rush, but sooner is always infinitely preferable to later!"},{"name":"QHOTERLPASOL","text":"For now, I just need a piece of pondfrond, which grows in the Lozatl. It's rather difficult to find, but a fruit worm will lead you right to it. By all accounts, they're drawn to the smell!"},{"name":"QHOTERLPASOL","text":"How are those ingredients coming along?"},{"name":"QHOTERLPASOL","text":"How are those ingredients coming along?"},{"name":"QHOTERLPASOL","text":"Any luck with that pondfrond?"},{"name":"QHOTERLPASOL","text":"I can tell by the spring in your step you've met with some success. Come along then, let's see what you've brought me!"},{"name":"QHOTERLPASOL","text":"Splendid! With this, I'll have a fresh batch of ointment ready in no time at all, though I cannot help but feel that, in this case, prevention would be better than cure."},{"name":"QHOTERLPASOL","text":"Perhaps if the workers could refrain from injuring themselves at every given opportunity, there wouldn't be such high demand for the stuff. Until then, I may have need to call on your talents again!"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}