{"quest":{"name":"Prayers and Poison","location":"The Rak'tika Greatwood","id":69350,"patch":5.2,"sort":109,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol knows that it pays to be prepared.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid chalcanthite at the Husk</span><span class=\"alternative\">Deliver the splendid chalcanthite to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid tarantulas at the Husk</span><span class=\"alternative\">Deliver the splendid tarantulas to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid poison catfish at Mjrl's Tears</span><span class=\"alternative\">Deliver the splendid poison catfish to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Thanks to the protective enchantments of the Night's Blessed, we may carry out our exploration without fear of fiends. Of course, enchantments are wont to lose effect over time, and when that happens, we must be prepared to protect ourselves."},{"name":"QHOTERLPASOL","text":"To that end, I intend to concoct a potent poison, and I would be most grateful if you could obtain an ingredient for me."},{"name":"QHOTERLPASOL","text":"Chalcanthite is what I require, and it can be mined at the Husk. Three clusters or so should be suitable for our purposes."},{"name":"QHOTERLPASOL","text":"Tarantulas are what I require, and they can be found at the Husk. Three or so should be suitable for our purposes."},{"name":"QHOTERLPASOL","text":"A poison catfish is what I require, and it can be caught at Mjrl's Tears with a fruit worm on your hook. A single creature should be suitable for our purposes."},{"name":"QHOTERLPASOL","text":"Please bring me the three chalcanthite clusters I require to make my poison. Remember, they can be mined at the Husk."},{"name":"QHOTERLPASOL","text":"Please bring me the three tarantulas I require to make my poison. Remember, they can be found at the Husk."},{"name":"QHOTERLPASOL","text":"Please bring me the poison catfish I require to make my poison. Remember, they can be caught at Mjrl's Tears with a fruit worm on your hook."},{"name":"QHOTERLPASOL","text":"Pleased for your return, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Were you successful in procuring the ingredient I requested?"},{"name":"QHOTERLPASOL","text":"Splendid, my thanks for your kind cooperation. Lest you wonder, the poison works by robbing fiends of their movement. Applied to dart tips, it won't slay outright, but it will afford us an opportunity to retreat to safety."},{"name":"QHOTERLPASOL","text":"Of course, I pray that our people needn't resort to such measures at all. May merciful Dalan ever bless us and keep us safe from harm."}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}