{"quest":{"name":"I Have Never Exploded","location":"The Rak'tika Greatwood","id":69358,"patch":5.2,"sort":117,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol has an appetite for destruction.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid saltpeter in the Husk</span><span class=\"alternative\">Deliver the splendid saltpeter to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid mugwort in the Husk</span><span class=\"alternative\">Deliver the splendid mugwort to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid magmatongue at Mjrl's Tears</span><span class=\"alternative\">Deliver the splendid magmatongue to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"The workers have been experiencing all manner of difficulties of late. Worst among them are the cave-ins, which lead to cracked skulls and blocked tunnels. While we're still working on a solution to the former, we at least have a plan for the latter: explosives!"},{"name":"QHOTERLPASOL","text":"I'll spare you the details, but to make our destruction-dealing devices, we'll need a smattering of saltpeter. Any you can provide will be gratefully received!"},{"name":"QHOTERLPASOL","text":"I'll spare you the details, but to make our destruction-dealing devices, we'll need a smattering of mugwort. Any you can provide will be gratefully received!"},{"name":"QHOTERLPASOL","text":"I'll spare you the details, but to make our destruction-dealing devices, we'll need a magmatongue. A generous serving of fruit worms on your hook, and they'll be jumping at the chance to be caught!"},{"name":"QHOTERLPASOL","text":"The Husk is the place most likely to have what we seek, though I must warn you, it's rather a long trip from here."},{"name":"QHOTERLPASOL","text":"The Husk is the place most likely to have what we seek, though I must warn you, it's rather a long trip from here."},{"name":"QHOTERLPASOL","text":"While they tend to move from place to place, a large number was seen at Mjrl's Tears recently. Perhaps that would be a suitable location to begin your search?"},{"name":"QHOTERLPASOL","text":"Do you have what I need to try my hand at making explosives?"},{"name":"QHOTERLPASOL","text":"Ah, yes. This is just what I was looking for. Probably. Once it's been combined with grasses, saltpeter, charcoal, sulphur, and just a tiny splash of urine─not mine, I might add─we should be ready to blast through that rubble!"},{"name":"QHOTERLPASOL","text":"To be quite frank, I've not much experience in this sort of thing, but it seems like that I can eventually perfect it through trial and error. After all, what is the worst that could happen?"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}