{"quest":{"name":"By the Power Invested in Scree","location":"The Rak'tika Greatwood","id":69359,"patch":5.2,"sort":118,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol calls for some divine intervention.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Uterl Matl.","Ride the Great Vessel of Ronka and use its Peculiar Light on the exhausted Stewards.","Report to Qhoterl Pasol."],"dialogue":[{"name":"QHOTERLPASOL","text":"I must say, the workers are doing a tremendous job of excavating all those relics, though I can't help but notice that some of them are beginning to flag, to varying degrees."},{"name":"QHOTERLPASOL","text":"What they need is motivation! Luckily, I have a cunning plan... Uterl Matl has already agreed to assist me, so pray speak with him to learn what it entails."},{"name":"UTERLMATL","text":"Greetings, my good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! I take it you are here at Qhoterl Pasol's request, yes? The truth is, we have uncovered a rather bizarre artifact in the deeper levels of the cavern. An urn, but one like no other."},{"name":"UTERLMATL","text":"For inside was, for want of a more grandiose word, a whistle. Or perhaps it was a flute... Whatever it is, one brave soul took it and played a brief melody, and a moment later, something appeared within the otherwise empty vessel: the great serpent itself!"},{"name":"UTERLMATL","text":"Why, I could hardly believe my eyes, but what happened next was perhaps even more miraculous. Our divine visitor did release a heavenly light, and those who did receive of this blessing were as Qitari reborn, filled with vigor! Now, listen carefully..."},{"name":"UTERLMATL","text":"I pray this <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> finds you well, my good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! I trust you are ready to continue efforts to invigorate our workforce?"},{"name":"UTERLMATL","text":"By using the sacred whistle, you are to guide the great serpent to my fellows and grace them with its mystical light. I shall be praying for your success, my most esteemed and gracious comrade!"},{"name":"UTERLMATL","text":"You have been chosen by the great serpent itself to act as its earthly emissary! Truly, there is no greater honor."},{"name":"TIREDQITARI","text":"Good heavens above! I have never felt so alive!"},{"name":"VAGUEQITARI","text":"Blessing of the great serpent itself, eh? Can't say I've done much to deserve it, but I'll take it all the same. Praise be!"},{"name":"TIREDQITARI","text":"Don't we have enough relics by now? What are we planning to do with them all anyway?"},{"name":"VAGUEQITARI","text":"Shirking my duties? Never! I'm just resting my legs. And my eyes."},{"name":"SYSTEM","text":"Some of the Qitari workers are struggling to find motivation. Guide the great serpent and release its peculiar light."},{"name":"UTERLMATL","text":"Your sacred duty is complete? May the gods smile upon you, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! No doubt Qhoterl Pasol will be as pleased as I to hear these most fortuitous of tidings."},{"name":"QHOTERLPASOL","text":"I trust all went according to my─if I may say so─brilliant plan? It seems word of your exploits has spread quickly, and the other workers are all doing their utmost to unearth yet more relics!"},{"name":"QHOTERLPASOL","text":"As for the questions surrounding our divine benefactor and the reasons for its involvement, the great serpent moves in mysterious ways. Sometimes, it'll wiggle. Other times, it'll bob up and down and let out a mighty “scree!” Yes, we are truly blessed."}],"reward":{"gil":679,"reputation":60,"items":[{"id":28187}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}}]}