{"quest":{"name":"If It's Broke, Fix It","location":"The Rak'tika Greatwood","id":69354,"patch":5.2,"sort":113,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol seeks to preserve the legacy of the Ronkans by gluing it back together again.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid clay in Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid clay to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid trilliums in Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid trilliums to Qhoterl Pasol</span><span class=\"alternative\">Spearfish a splendid cockle in Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid cockle to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"We've uncovered all sorts of precious relics, although some are in better condition than others."},{"name":"QHOTERLPASOL","text":"As such, many of these artifacts are in desperate need of repair, which is where our special adhesive comes in particularly handy. Sadly, we've just run out, and need to prepare a fresh batch."},{"name":"QHOTERLPASOL","text":"If you're feeling charitable, could I trouble you for a few lumps of clay? I'd be ever so grateful for any assistance you can provide!"},{"name":"QHOTERLPASOL","text":"If you're feeling charitable, could I trouble you for a few trilliums? I'd be ever so grateful for any assistance you can provide!"},{"name":"QHOTERLPASOL","text":"Cockles are an essential ingredient in the mixture, but they're rather difficult to catch, so you'll need to get close and use a spear or some such to prise it from the rock. I'd be ever so grateful for any assistance you can provide!"},{"name":"SYSTEM","text":"In order to proceed with this quest, you must first complete the quest “A New Fishing Ex-spear-ience” and unlock spearfishing."},{"name":"QHOTERLPASOL","text":"I'm told there are ample amounts in Mjrl's Regret, which is not the easiest of places for us Qitari to reach. Presumably you have some means of getting there more quickly?"},{"name":"QHOTERLPASOL","text":"I'm told there are ample amounts in Mjrl's Regret, which is not the easiest of places for us Qitari to reach. Presumably you have some means of getting there more quickly?"},{"name":"QHOTERLPASOL","text":"I'm told that Lake Tusi Mek'ta is positively lousy with the things, though we Qitari are not especially well suited to swimming in deep water. We're just too buoyant for our own good!"},{"name":"QHOTERLPASOL","text":"So, any luck?"},{"name":"QHOTERLPASOL","text":"Oh my, this is perfection itself! Those priceless pots shall remain shattered no longer!"},{"name":"QHOTERLPASOL","text":"While some may argue that the relics should be kept as we find them, I'd much rather see them restored to their original state, as the ancient Ronkans intended them. Besides, who would want to look at a pile of broken fragments?"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}