{"quest":{"name":"You Dirty Rats","location":"The Rak'tika Greatwood","id":69353,"patch":5.2,"sort":112,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol is attempting, unsuccessfully, to close her nostrils.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid natron in the depths of Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid natron to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid marimo in the depths of Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid marimo to Qhoterl Pasol</span><span class=\"alternative\">Spearfish a splendid sponge in the depths of Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid sponge to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Sometimes I wish I didn't have such a sensitive nose. When the workers come back from the caves, they carry with them the most pungent of odors! It really is quite unbearable!"},{"name":"QHOTERLPASOL","text":"Unfortunately, even a thorough scrubbing with warm water does little to remove the stench. I fear there is little choice but to resort to a rarely used treatment, and as you can imagine, the ingredients required are also rather rare themselves..."},{"name":"QHOTERLPASOL","text":"First, I'll need roughly three pinches of natron. Your cooperation will be most appreciated, I assure you!"},{"name":"QHOTERLPASOL","text":"First, I'll need roughly three marimo. Your cooperation will be most appreciated, I assure you!"},{"name":"QHOTERLPASOL","text":"First, I'll need a sponge, the living sort, but you'll need to hook the little scoundrel with your spear as they're far too crafty to take any bait. Your cooperation will be most appreciated, I assure you!"},{"name":"SYSTEM","text":"In order to proceed with this quest, you must first complete the quest “A New Fishing Ex-spear-ience” and unlock spearfishing."},{"name":"QHOTERLPASOL","text":"Oh! I forgot to mention that you'll need to dive into the waters of Lake Tusi Mek'ta to find it!"},{"name":"QHOTERLPASOL","text":"Oh! I forgot to mention that you'll need to dive into the waters of Lake Tusi Mek'ta to find them!"},{"name":"QHOTERLPASOL","text":"It seems that Lake Tusi Mek'ta is relatively free of large, flesh-eating beasts, so your chances of being devoured alive are actually quite low! Welcome news, I'm sure!"},{"name":"QHOTERLPASOL","text":"Have you brought what I asked for? Please say you have!"},{"name":"QHOTERLPASOL","text":"Marvelous! Once the concoction is ready, those reeking reprobates will be the very pinnacle of cleanliness in just a few scrubs!"},{"name":"QHOTERLPASOL","text":"At the top of my list of candidates are my husband and son. Their combined stench is enough to curdle milk!"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}