{"quest":{"name":"Meat and Greet","location":"The Rak'tika Greatwood","id":69357,"patch":5.2,"sort":116,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol faces an unprecedented dilemma: a disastrous deluge of dead deer delicacies.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid rock salt in the K'mul Astropolis</span><span class=\"alternative\">Deliver the splendid rock salt to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid tree bark in the K'mul Astropolis</span><span class=\"alternative\">Deliver the splendid tree bark to Qhoterl Pasol</span><span class=\"alternative\">Spearfish a splendid Night's bass in the depths of Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid Night's bass to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Our Viis friends have presented us with an enormous haul of venison as a sign of their appreciation for our work. The only problem is, there's so much of it, we'll need to smoke the meat before it goes rotten!"},{"name":"QHOTERLPASOL","text":"Could I be awfully impertinent and ask you to bring me some rock salt? Sprinkling it on the meat beforehand draws out the rich, gamey flavors!"},{"name":"QHOTERLPASOL","text":"Could I be awfully impertinent and ask you to bring me some tree bark? Naturally, only the most splendid will suffice."},{"name":"QHOTERLPASOL","text":"Could I be awfully impertinent and ask you to spear me a Night's bass? It may not be the most obvious choice, but apparently, smoking it together with the deer meat helps to preserve it."},{"name":"QHOTERLPASOL","text":"If I could tear myself away from my duties here, I'd probably start by searching around the K'mul Astropolis. Something about the place simply screams “splendid,” wouldn't you agree?"},{"name":"QHOTERLPASOL","text":"If I could tear myself away from my duties here, I'd probably start by searching around the K'mul Astropolis. Something about the place simply screams “splendid,” wouldn't you agree?"},{"name":"QHOTERLPASOL","text":"If I could tear myself away from my duties here, and I had even the slightest inkling of how spearfishing works, I'd probably try my luck at Lake Tusi Mek'ta."},{"name":"SYSTEM","text":"In order to proceed with this quest, you must first complete the quest “A New Fishing Ex-spear-ience” and unlock spearfishing."},{"name":"QHOTERLPASOL","text":"Have you brought that which I requested? Time is of the essence!"},{"name":"QHOTERLPASOL","text":"My word, this is splendid! Just the fragrance alone makes me want to gobble it all up, even without the venison..."},{"name":"QHOTERLPASOL","text":"Ah, of course, that would rather defeat the purpose of having you rush around before the meat spoils. And we wouldn't want the Viis' generous gift to go to waste, now, would we?"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}