{"quest":{"name":"Rings of Pattern","location":"The Rak'tika Greatwood","id":69352,"patch":5.2,"sort":111,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol wants to bring a touch of style to some otherwise drab textiles.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested items to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid purple pigment in the Blind Forest of Yx'Maja</span><span class=\"alternative\">Deliver the splendid purple pigment to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid turmeric in the Blind Forest of Yx'Maja</span><span class=\"alternative\">Deliver the splendid turmeric to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid spiralshell in south Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid spiralshell to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"We Qitari are experts at weaving clothes, bags, and so on, which we decorate in the traditional manner using various colors."},{"name":"QHOTERLPASOL","text":"But with so many of us preoccupied with excavating the caves, we've had little time to gather the raw ingredients for producing the dyes we need."},{"name":"QHOTERLPASOL","text":"Were an altruistic volunteer to bring me a small quantity of purple pigment, I think a reward of some sort would be in order."},{"name":"QHOTERLPASOL","text":"Were an altruistic volunteer to bring me a small quantity of turmeric, I think a reward of some sort would be in order."},{"name":"QHOTERLPASOL","text":"Were an altruistic volunteer to bring me a spiralshell, I think a reward of some sort would be in order. And were said volunteer to use fruit worms as bait, I'm sure they'd snag one in a jiffy!"},{"name":"QHOTERLPASOL","text":"The Blind Forest of Yx'Maja would be an excellent place to begin your search, but watch out for beasties, especially those tarichuks. Oh, I can't stand them!"},{"name":"QHOTERLPASOL","text":"The Blind Forest of Yx'Maja would be an excellent place to begin your search, but watch out for beasties, especially those tarichuks. Oh, I can't stand them!"},{"name":"QHOTERLPASOL","text":"The southern part of Mjrl's Regret is where you're most likely to find one, but don't let those caracals catch you by surprise!"},{"name":"QHOTERLPASOL","text":"Do you have something for me, by any chance? I'm <span class=\"emphasis\">dye</span>-ing to see it! &lt;snort&gt;"},{"name":"QHOTERLPASOL","text":"A superlative effort, indeed!"},{"name":"QHOTERLPASOL","text":"With this, we'll be able to bring a touch of Ronkan elegance to our textiles. The patterns with which we adorn ourselves come from their ancient culture, you see."},{"name":"QHOTERLPASOL","text":"Those that feature a pair of straight, parallel lines represent harmony, whereas spirals are a symbol of the never-ending cycle of nature, for example."},{"name":"QHOTERLPASOL","text":"Perhaps you would consider wearing some of our traditional garments yourself? I think you'd look rather fetching in one of our hats!"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}