{"quest":{"name":"There's No Clean Like Qhoterl Clean","location":"The Rak'tika Greatwood","id":69361,"patch":5.2,"sort":120,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol is worrying her fingers over a dusty tablet.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested supplies to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid gravel at Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid gravel to Qhoterl Pasol</span><span class=\"alternative\">Gather bundles of splendid broombush at Mjrl's Regret</span><span class=\"alternative\">Deliver the bundles of splendid broombush to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid pipira at the Lozatl</span><span class=\"alternative\">Deliver the splendid pipira to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"These stone tablets are among the Stewards' most revered relics. However, nature holds a somewhat less sentimental view of them, and so it falls to us to keep the elements from diminishing their splendor."},{"name":"QHOTERLPASOL","text":"If we wish for our children and our children's children to look upon the stones with the same sense of awe that we do now, we must have tools to maintain them. If you would aid me in crafting such instruments, I would be forever in your debt."},{"name":"QHOTERLPASOL","text":"Polishing the tablets with gravel would ensure that their luster never fades. I'm informed that you can find it strewn about Mjrl's Regret."},{"name":"QHOTERLPASOL","text":"Fallen leaves and dust must be cleared away diligently, or soon the tablets would be swallowed by nature's detritus. With broombush from Mjrl's Regret to sweep the dust away, this daily chore should go by all the quicker."},{"name":"QHOTERLPASOL","text":"The tablets must be scoured regularly, lest their sheen wane and they become indistinguishable from a common slab of rock. The hard scales of the pipira─quite common in the Lozatl─are well suited to this task. Don't forget to take fruit worms!"},{"name":"QHOTERLPASOL","text":"Whether it be on the morrow or one thousand summers from now, I wish to see every tablet as radiant as the histories contained within. Gravel mined from Mjrl's Regret should help us achieve this goal. "},{"name":"QHOTERLPASOL","text":"Nature's castoffs would bury us all if left unchecked. Broombush from Mjrl's Regret should aid us in staving off this constant threat."},{"name":"QHOTERLPASOL","text":"To keep the tablets immaculate for generations, we must scour them regularly. Pipira from the Lozatl possess scales that will endure this task for moons to come."},{"name":"QHOTERLPASOL","text":"You have the look of someone who's been gathering to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> heart's content! Please tell me you managed to procure the materials I asked for in your fervor."},{"name":"QHOTERLPASOL","text":"I knew I was right to count on you! My days of late have been filled with sweeping, polishing, and generally worrying over the condition of the tablets. I daresay these new materials will allow me to speed through my chores!"},{"name":"QHOTERLPASOL","text":"Finally I'll have time to rest my aching knees and throbbing wrists. This work is taxing, 'tis true, but the thought of my ancestors enjoying the fruits of my labor─<span class=\"emphasis\">our</span> labor─makes it all worthwhile. "}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}