{"quest":{"name":"Legends of the Ronkan Temple","location":"The Rak'tika Greatwood","id":69362,"patch":5.2,"sort":121,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol is eyeing a crumbling piece of paper with keen interest.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Investigate the designated location.","Report to Qhoterl Pasol."],"dialogue":[{"name":"QHOTERLPASOL","text":"What splendid timing! We've just unearthed what appears to be a map pinpointing the location of a treasure left by our forebears. If I'm reading this correctly, it's somewhere near the Deliberating Doll..."},{"name":"QHOTERLPASOL","text":"Would that I could spare the time to dig for it myself, but alas, my work here is endless. However, I'm fortunate enough to know one enterprising <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> with a singular talent for gathering! I would be ever so grateful if you brought this piece of our heritage back to me."},{"name":"SYSTEM","text":"You dig until you hit something solid, and after dusting off the dirt you see it is a coffer of Ronkan design. This must be the treasure Qhoterl Pasol sent you to find."},{"name":"QHOTERLPASOL","text":"Did you find it!? Oh, I can scarce imagine what wonders our forebears left for us!"},{"name":"QHOTERLPASOL","text":"Hmm... Most unusual...most fascinating! The seal adorning this box dates back to the time of the Ronkans─one can only guess at exactly how long ago it was buried. Perhaps its contents will provide a clue."},{"name":"QHOTERLPASOL","text":"Oh! Did you hear that? It sounded as if something was moving inside. Let's see..."},{"name":"BEAVERA03826","text":"(-Mystery Creature-)&lt;squeal&gt; &lt;squeal&gt; &lt;squeal&gt;"},{"name":"QHOTERLPASOL","text":"..."},{"name":"QHOTERLPASOL","text":"Oh no. Oh dear. I fear we've made a grave mistake. I must return this whence it came, lest we invite calamity upon ourselves and all Qitari to come. Needless to say, but if you value your life at all, do <span class=\"emphasis\">not</span> dig this box back up!"},{"name":"QHOTERLPASOL","text":"Ah! A tablet from the age of Ronka! Now, what does it say..."},{"name":"QHOTERLPASOL","text":"Fascinating. It seems to be an inventory of the spirits provided to the workers during the construction of this temple. And by the looks of it, the libations flowed freely!"},{"name":"QHOTERLPASOL","text":"Some things never change. It is often at the bottom of an empty bottle where we find the resolve to endure the most arduous tasks. My husband finds that resolve nightly, hah hah!"},{"name":"QHOTERLPASOL","text":"Goodness gracious! Chestnuts─a veritable hoard of them! Entirely too many for me to eat on my own, of course. Here, take some."},{"name":"QHOTERLPASOL","text":"Wait! On second glance, these are rotten to the core and appear to be dry as a bone besides. Lucky for you I noticed in time, or you would've been in for an uncomfortable night. Here, I'll dispose of these for us. No, no, I'll do it myself."},{"name":"QHOTERLPASOL","text":"Well then, now wasn't that an experience! Perhaps not exactly what either of us was expecting, but nonetheless I look forward to seeing what further secrets the earth holds."}],"reward":{"gil":606,"reputation":60,"items":[{"id":28187}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}}]}