{"quest":{"name":"One Fish, Two Fish, Bread Fish, Stew Fish","location":"The Rak'tika Greatwood","id":69367,"patch":5.2,"sort":126,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol is anxious to share news of a recent discovery.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested supplies to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid bone fragments at the Husk</span><span class=\"alternative\">Deliver the splendid bone fragments to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid earthworms at the Husk</span><span class=\"alternative\">Deliver the splendid earthworms to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid larva at Mjrl's Regret</span><span class=\"alternative\">Deliver the splendid larva to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Our workers discovered a vast body of water while excavating an underground cave, and found it absolutely teeming with fish. This blessing will provide a steady supply of sustenance as we dig deeper. That is, of course, if we can catch the fish."},{"name":"QHOTERLPASOL","text":"A lure made from animal bones should prove irresistible, and the Husk has no shortage of desiccated remains. My workers and I would be grateful if you could bring some to us."},{"name":"QHOTERLPASOL","text":"Worms would make ideal bait, but only the most plump and juicy will do. Those in the Husk are fat from feasting on the remains littering the area. My workers and I would be grateful if you would bring us some─for the fish, of course, not for us!"},{"name":"QHOTERLPASOL","text":"Fish can't well resist a plump, juicy bug at the end of a hook, but a simple fruit worm won't do if we wish to catch the most succulent fish. However, a fruit worm <span class=\"emphasis\">may</span> suffice to catch what we need. Go to Mjrl's Regret with fruit worm on hook, and bring us back a splendid larva."},{"name":"QHOTERLPASOL","text":"The fish are certain to go wild for a lure made of animal bone. Make your way to the Husk, and you'll practically trip over what we need."},{"name":"QHOTERLPASOL","text":"We need worms, and lots of them. Big, juicy ones─the type that practically carpet the Husk. I trust you aren't too squeamish to handle them."},{"name":"QHOTERLPASOL","text":"The task is simple: use a bug to catch a bug. Head to Mjrl's Regret, pole in hand and fruit worm on hook, and you should have what we need in no time."},{"name":"QHOTERLPASOL","text":"Now there's my able gatherer! Well, did you get the items? We're ever so eager to begin feasting."},{"name":"QHOTERLPASOL","text":"You've outdone yourself once again! Until now, we've been subsisting on preserved food. It fills our bellies, but I'm of the philosophy that a meal is meant to be savored. Perhaps finally we can forget the fact that we're toiling away under the earth, if even just for one meal."}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}