{"quest":{"name":"Eggspotting","location":"The Rak'tika Greatwood","id":69365,"patch":5.2,"sort":124,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol has the look of someone who hasn't had all she can eat.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the poultryman at Slitherbough.","Use the large sack to capture the clucking chicken.","Deliver the clucking sack to the poultryman.","Deliver the splendid eggs to Qhoterl Pasol."],"dialogue":[{"name":"QHOTERLPASOL","text":"The other day residents from Slitherbough brought a gift most divine─chicken eggs! And let me tell you, to say that their flavor was transcendent hardly begins to describe the experience!"},{"name":"QHOTERLPASOL","text":"I had scarce tasted the first egg when I knew we must have more. Being the enterprising Qitari that I am, I've arranged to exchange our precious stones for their precious eggs. One of nature's bounties for another─a capital bargain if I do say so myself!"},{"name":"QHOTERLPASOL","text":"We have already delivered our first cache of stones, but someone must pick up the eggs from Slitherbough. If you would be so kind, I'll ensure that you're handsomely compensated! "},{"name":"POULTRYFARMER03829","text":"I take it you're here about the eggs, then? I'd love to give them to you, but I'm afraid I've run into a snag. One of my chickens fled the coop, you see, clucking like the sky itself was falling down!"},{"name":"POULTRYFARMER03829","text":"Gods only know where she is now, but I reckon I'd find her quicker if I had another set of eyes looking for her. What say you? Lend a hand and I'll give you the pick of my best eggs!"},{"name":"POULTRYFARMER03829","text":"If you catch sight of her, use this sack to scoop her up. I'll stay around the village, while you go ahead and look around the outskirts─I reckon you might hear her before you see her!"},{"name":"POULTRYFARMER03829","text":"I've searched everywhere, but I haven't seen hide nor down of that pesky bird. I hope you've had better luck than me."},{"name":"POULTRYFARMER03829","text":"Ah, that's her all right! You're a godssend! I was worried she'd been gobbled up whole by some bigger animal. She always lays the best eggs─it would've been a tragedy to lose her."},{"name":"POULTRYFARMER03829","text":"Speaking of eggs, I believe these are for you. And as I promised, here's a few more on top as your just reward. Give my regards to the Qitari, and let them know I'm open for business any time!"},{"name":"QHOTERLPASOL","text":"Would that the Qitari could lay eggs. Hmm, perhaps if I...<br>Oh! You're back! Do you have them!? Do you!?"},{"name":"QHOTERLPASOL","text":"Oh, you have saved─<br>Hmph, I mean, splendid! These eggs are even more pleasing to behold than the last batch, and there are so many of them! I would've sent one of my workers to fetch these, but the sad truth is that no Qitari could be trusted with the task. "},{"name":"QHOTERLPASOL","text":"The eggs would have been devoured before they were one yalm from Slitherbough. That you showed enough restraint to deliver them untouched truly speaks to your heroic pedigree!"}],"reward":{"gil":752,"reputation":60,"items":[{"id":28187}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}}]}