{"quest":{"name":"Qhoterl's Chronicles","location":"The Rak'tika Greatwood","id":69369,"patch":5.2,"sort":128,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol would set history right once and for all.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested supplies to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine slabs of splendid black rock at Mjrl's Regret</span><span class=\"alternative\">Deliver the slabs of splendid black rock to Qhoterl Pasol</span><span class=\"alternative\">Gather tufts of splendid hemp at Mjrl's Regret</span><span class=\"alternative\">Deliver the tufts of splendid hemp to Qhoterl Pasol</span><span class=\"alternative\">Spearfish a splendid mammoth shellfish in the depths of Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid mammoth shellfish to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Thanks to your tireless efforts, our excavation is nearing its completion. The gifts of the past we've uncovered here will be a boon to future Qitari, to be sure, but we mustn't keep our discoveries to ourselves. No, I intend to spread knowledge of Ronka to every corner of the world!"},{"name":"QHOTERLPASOL","text":"To that end, I mean to author a definitive history of Ronka with my own hands. Moreover, I intend to use an ingenious system of woodblocks and ink to produce enough copies so that no curious mind goes unsated."},{"name":"QHOTERLPASOL","text":"If you would be an ally of history, then I have just the task for you. Pray bring me a slab of black stone from Mjrl's Regret. While it may appear a common stone at first glance, we have long used it to make writing instruments."},{"name":"QHOTERLPASOL","text":"If you would be an ally of history, then I have just the task for you. Pray bring me hemp from Mjrl's Regret. I can't start writing without paper, and the material made from this hemp is as sturdy as it comes."},{"name":"QHOTERLPASOL","text":"If you would be an ally of history, then I have just the task for you. Pray return with a mammoth shellfish from the depths of Lake Tusi Mek'ta. Though they may be tricky to snag with your spear, their sacs contain enough ink to fill countless inkwells."},{"name":"QHOTERLPASOL","text":"The world is eager to learn the truth of Ronka. Return here with the black stone and I shall begin writing at once!"},{"name":"QHOTERLPASOL","text":"The world is eager to learn the truth of Ronka. Return here with the hemp and I shall begin writing at once!"},{"name":"QHOTERLPASOL","text":"The world is eager to learn the truth of Ronka. Return here with the shellfish and I shall begin writing at once!"},{"name":"SYSTEM","text":"In order to proceed with this quest, you must first complete the quest “A New Fishing Ex-spear-ience” and unlock spearfishing."},{"name":"QHOTERLPASOL","text":"I am always glad to see you, and now more than ever! Have you brought the materials I requested?"},{"name":"QHOTERLPASOL","text":"Splendid, as always! I eventually hope to distribute my chronicle throughout Norvrandt, although it would be prudent to begin with a smaller proving ground, such as the Greatwood. Assuming I meet with success here, my ambitions know no bounds!"},{"name":"QHOTERLPASOL","text":"A Steward can ask for no greater honor than this task I've given myself, and I shan't rest until I see it done!"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}