{"quest":{"name":"Rock 'n Ronka","location":"The Rak'tika Greatwood","id":69360,"patch":5.2,"sort":119,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol is tapping her feet while reading a stone tablet.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested supplies to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid holey stones in the depths of Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid holey stones to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid stalks at Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid stalks to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid treescale in Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid treescale to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Greetings, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! Our excavation proceeds apace, and just recently our workers unearthed a tablet inscribed with an ancient song."},{"name":"QHOTERLPASOL","text":"Oh, don't look so bewildered! Music has ever been a beloved pastime of the Qitari. As a matter of fact, this relic contains one of our great epics, immortalized in a captivating melody."},{"name":"QHOTERLPASOL","text":"I would see this culturally significant piece performed once again, that it may live on in the hearts of our children, and their children's children, and thus return to the rich tapestry of our history. And that, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, is where you come in."},{"name":"QHOTERLPASOL","text":"Three holey stones from the waters of Lake Tusi Mek'ta ought to serve my needs. No two of these stones has holes in the same place, and the right ones make splendid flutes."},{"name":"QHOTERLPASOL","text":"I require three stalks taken from plants found in the waters of Lake Tusi Mek'ta. Hollow on the inside, they should produce just the sound we need to bring this melody to life. Don't worry about the name, you'll know them when you see them."},{"name":"QHOTERLPASOL","text":"Catch a treescale, which dwells in the waters of Lake Tusi Mek'ta. Their shells can be used to make all manner of instruments."},{"name":"QHOTERLPASOL","text":"While you may think it an instrument of a primitive sort, a stone flute can produce sounds most pleasing to the ear. The holey stones found in Lake Tusi Mek'ta are ideal for making them."},{"name":"QHOTERLPASOL","text":"Hollow stalks from the plants found in Lake Tusi Mek'ta make ideal wind instruments, and can produce a range of sounds to accompany most any refrain."},{"name":"QHOTERLPASOL","text":"The shells of the treescale─which are common in Lake Tusi Mek'ta─are versatile materials for crafting of all sorts, and musical instruments are no exception. And be sure to take some fruit worms to use as bait!"},{"name":"QHOTERLPASOL","text":"Ah, you're returned! I trust you've what I requested?"},{"name":"QHOTERLPASOL","text":"Yes, this will do splendidly! There is naught as stirring as an expertly crafted melody─even the Ronkans showed obeisance to Ox'Charl by composing songs of worship, that the moon and sky might remain firmly in their place."},{"name":"QHOTERLPASOL","text":"Music honors the gods eternal while also making timeless our most epic tales. And I daresay it is ever so slightly more entertaining than a dry narrative, wouldn't you agree?"},{"name":"QHOTERLPASOL","text":"Perhaps soon we'll put the deeds of the Warrior of Darkness to song, so that none forget the turnings of fate that restored night to the world."}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}