{"quest":{"name":"Serpent's Will Be Done","location":"The Rak'tika Greatwood","id":69368,"patch":5.2,"sort":127,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol has a message she looks eager to share with you.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Uterl Matl.","Ride the Great Vessel of Ronka to Fruit of the Protector and use its Peculiar Light ability at the designated location.","Report to Qhoterl Pasol."],"dialogue":[{"name":"QHOTERLPASOL","text":"Ah, such splendid timing! It would seem your singular ability to coax the great serpent into obedience with a mere whistle has made you quite the commodity. Uterl Matl was just asking after you, and requested that I send you his way with haste. The matter seemed quite urgent─so urgent, in fact, that he ran off before I had a chance to inquire as to the details!"},{"name":"UTERLMATL","text":"Ah, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, let me thank you for answering my summons on such short notice. My time spent with the great serpent has given me a certain intuition when it comes to anticipating its needs, and recently I've noticed something peculiar about its behavior."},{"name":"UTERLMATL","text":"It fidgets inside the vase restlessly, but I don't sense that it yearns for freedom. No, this is another matter entirely. It wishes to free something from within <span class=\"emphasis\">itself</span>─doubtless that mystifying light it has a habit of disgorging from its eyes."},{"name":"UTERLMATL","text":"I must admit I am grateful for the serpent's forbearance in the matter, when it is we who are obliged to serve. And serve we shall─with your help, of course. Pray bring the serpent to Fruit of the Protector, where it can shed light to its little heart's content."},{"name":"UTERLMATL","text":"You've arrived just in time! The great serpent is full to bursting with that mysterious light, and I'd be loath to find out what happens were we to let it build up any further. Go on now, you know what to do."},{"name":"UTERLMATL","text":"Best not leave the great serpent alone for too long─I dread to think what would happen if it was forced to contain itself any longer. Just blow on the whistle here and guide it to Fruit of the Protector so it can do what it needs to do."},{"name":"SYSTEM","text":"A brilliant flash of light accompanies the release of unmeasurable quantities of magical energy. The great serpent appears content with itself."},{"name":"SYSTEM","text":"The air here is teeming with magical energy. This might be the perfect place to let the great serpent do its business."},{"name":"SYSTEM","text":"Speak with Uterl Matl at Hopl's Stopple to mount the Great Vessel of Ronka, and unleash its peculiar light into the area around Fruit of the Protector."},{"name":"UTERLMATL","text":"Now there's my favorite little serpent! And it looks so accomplished, so <span class=\"emphasis\">great</span>! I believe a treat is in order. As for <span class=\"emphasis\">your</span> treat, my good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, Qhoterl Pasol may be able to help you with that!"},{"name":"QHOTERLPASOL","text":"I trust Uterl Matl's task was not too daunting...<br>Oh, I see! What an unorthodox request. However, it seems that Uterl Matl, and more importantly the great serpent, were more than pleased with your performance."},{"name":"QHOTERLPASOL","text":"Humble creatures such as we are can but guess as to the serpent's wishes, and carry them out as dutifully as we can manage. In that respect, I believe we have done splendidly!"},{"name":"QHOTERLPASOL","text":"You should be honored to have been given this task, and should you be asked to undertake it once more, I suggest you treat it with the same gravity as you did today. So long as the great serpent is happy, the Qitari are happy─and that should make you happy, old <span class=\"alternative-container\"><span class=\"alternative\">chapette</span><span class=\"alternative\">chap</span></span>!"}],"reward":{"gil":679,"reputation":60,"items":[{"id":28187}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}}]}