{"quest":{"name":"Splendid Eats","location":"The Rak'tika Greatwood","id":69364,"patch":5.2,"sort":123,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol, ever the compassionate overseer, would see that her workers have full bellies.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested supplies to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid worms in the Blind Forest of Yx'Maja</span><span class=\"alternative\">Deliver the splendid worms to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid beehive chips in the Blind Forest of Yx'Maja</span><span class=\"alternative\">Deliver the splendid beehive chips to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid egg-bearing trout at the Red Chalice</span><span class=\"alternative\">Deliver the splendid egg-bearing trout to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Under the great serpent's auspices, we've been able to treat a range of common diseases. However, prevention is worth a ponze of cure, and so I mean to do all within my power to ensure our workers are in tip-top shape."},{"name":"QHOTERLPASOL","text":"Our workers venture daily into the unknown and risk life and limb in the pursuit of our shared history. Needless to say, it is of the utmost importance that they remain hale and hearty. After all, we won't make much progress if our workers are dropping like flies! "},{"name":"QHOTERLPASOL","text":"To that end, I plan on cooking up something that will fortify their bodies against the most persistent of ailments. Would you aid me in gathering the ingredients I require?"},{"name":"QHOTERLPASOL","text":"The rocks dotting the Blind Forest of Yx'Maja may not themselves be edible, but the worms which make their homes in them are practically meals unto themselves! They would make a splendid feast for my workers, and for myself besides!"},{"name":"QHOTERLPASOL","text":"The lush woods of the Blind Forest of Yx'Maja are a bounty of nutritious plants and delectable treats. The honey from beehive chips can help the body stave off an otherwise debilitating illness."},{"name":"QHOTERLPASOL","text":"The Red Chalice is brimming with wildlife both dangerous and nourishing. Let's stick with the latter and go fishing, eh? Some trout should suffice─their eggs are said to bolster the mind and gird the body. Don't forget to bring fruit worms!"},{"name":"QHOTERLPASOL","text":"Hurry off to the Blind Forest of Yx'Maja. Or go leisurely, so long as you return with worms!"},{"name":"QHOTERLPASOL","text":"The Blind Forest of Yx'Maja awaits with its bounty. Take your fill, so long as you return with some beehive chips for me!"},{"name":"QHOTERLPASOL","text":"No need to face down snarling fiends today, my friend. Simply pluck a trout plump with eggs from the waters of the Red Chalice and bring it here. Don't expect to catch anything without fruit worms, however!"},{"name":"QHOTERLPASOL","text":"There you are! Did you have any trouble procuring the ingredients I requested?"},{"name":"QHOTERLPASOL","text":"Ah, I feel reinvigorated just by looking at such a splendid specimen! Whatever it is I end up cooking out of this, I aim to make it the talk of the camp!"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}