{"quest":{"name":"Safety Is No Accident","location":"The Rak'tika Greatwood","id":69366,"patch":5.2,"sort":125,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol is on the lookout for uncommonly sturdy tools for uncommonly dangerous tasks.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested supplies to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine slabs of splendid dense iron ore in the depths of Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the slabs of splendid dense iron ore to Qhoterl Pasol</span><span class=\"alternative\">Gather bunches of splendid roots in the depths of Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the bunches of splendid roots to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid diamondtongue at Lake Tusi Mek'ta</span><span class=\"alternative\">Deliver the splendid diamondtongue to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"As we dig deeper underground, we encounter ever more boulders obstructing our path. We must now refine our tools─reinforce them to withstand these harsh environs and those harsher still to come. I'd owe you a great debt indeed if you were to aid me in gathering the materials I need to do so. "},{"name":"QHOTERLPASOL","text":"In the waters of Lake Tusi Mek'ta you can mine a splendid dense iron ore, which should do nicely in improving our pickaxes. Take care, however, as you may find things more vicious than rocks barring your way!"},{"name":"QHOTERLPASOL","text":"In the waters of Lake Tusi Mek'ta you can find bunches of sturdy roots, which should come in handy when we have to haul material out of the caves. Take care, however, as you may find things more vicious than rocks barring your way!"},{"name":"QHOTERLPASOL","text":"In the waters of Lake Tusi Mek'ta you can catch the diamondtongue, whose scales can withstand the most extreme elemental stresses. Take care, however, as you may find things more vicious than rocks barring your way!"},{"name":"QHOTERLPASOL","text":"Remember, I need some of that oh-so-splendid dense iron ore from Lake Tusi Mek'ta. Safe mining, my friend!"},{"name":"QHOTERLPASOL","text":"Remember, I need a bunch of roots from the floor of Lake Tusi Mek'ta. Safe gathering, my friend!"},{"name":"QHOTERLPASOL","text":"Remember, I need a diamondtongue from the depths of Lake Tusi Mek'ta. I pray you don't fish up something you shouldn't have!"},{"name":"QHOTERLPASOL","text":"Ah, it's good to see you returned! Seeing as you have all your limbs and various extremities, I take it you were able to obtain the items I requested?"},{"name":"QHOTERLPASOL","text":"Splendid! With ore of this quality, I'll be able to construct pickaxes that are nigh indestructible─I daresay they'll last longer than our expedition will! "},{"name":"QHOTERLPASOL","text":"Splendid! These sturdy roots will make the perfect rope─strong enough to withstand the weight of even the most enormous boulders."},{"name":"QHOTERLPASOL","text":"Splendid! The scales of the diamondtongue are as enchanting as they are robust. With these I can make boots that will let us traverse the most rugged terrain with ease."},{"name":"QHOTERLPASOL","text":"These new tools will ensure that our younglings survive to dig well until their twilight years, should the need arise─perhaps they'll even pass them down to their children!"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}