{"quest":{"name":"Her Splendid Materials","location":"The Rak'tika Greatwood","id":69363,"patch":5.2,"sort":122,"interval":"daily","repeatable":1,"beast":13,"eventIcon":71222,"issuer":1032643,"target":1032643,"genre":59,"journal":["Qhoterl Pasol has the glint of inspiration in her eyes.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Deliver the requested supplies to Qhoterl Pasol."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Mine splendid stones in the K'mul Astropolis</span><span class=\"alternative\">Deliver the splendid stones to Qhoterl Pasol</span><span class=\"alternative\">Gather splendid nuts in the K'mul Astropolis</span><span class=\"alternative\">Deliver the splendid nuts to Qhoterl Pasol</span><span class=\"alternative\">Catch a splendid shellfish at Mjrl's Tears</span><span class=\"alternative\">Deliver the splendid shellfish to Qhoterl Pasol</span></span>."],"dialogue":[{"name":"QHOTERLPASOL","text":"Good day, <span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span> <span class=\"highlight\">Forename</span>! You look to be the well-traveled sort─have your journeys taken you to the Great Pyramid of Ux'ner?"},{"name":"QHOTERLPASOL","text":"I ask because one of the noble Viis told me of the owl statues housed within the pyramid, equipped with deadly traps meant to deter even the most intrepid grave robbers. Upon hearing the story, I was struck with inspiration."},{"name":"QHOTERLPASOL","text":"I realized these very ruins could be equipped with such measures! Our surroundings are positively lousy with vicious beasts, and a few clever traps would go a long way to set everyone's mind at ease. Could I trouble you to assist me in making them?"},{"name":"QHOTERLPASOL","text":"The device I have in mind will make use of the latent energies stored within magical stones. If you would bring me some from the K'mul Astropolis, I would be ever so grateful."},{"name":"QHOTERLPASOL","text":"The device I envision will make use of the latent energy stored in the nuts strewn about the K'mul Astropolis. I would be ecstatic if you could gather some and bring them to me."},{"name":"QHOTERLPASOL","text":"I have designed a device which makes use of the potent energy stored within the pearls of the shellfish dotting Mjrl's Tears. While fishing them up from the depths may seem a daunting task, use fruit worms as bait and you'll be done before I even have a chance to miss you."},{"name":"QHOTERLPASOL","text":"The latent power stored within the stones littered about the K'mul Astropolis ought to be just what I need. I'll wait here patiently until you return."},{"name":"QHOTERLPASOL","text":"The nuts flourishing near the K'mul Astropolis are bursting with arcane energy, which should make for a trap as deadly as it is delicious."},{"name":"QHOTERLPASOL","text":"The pearls that can be found in Mjrl's Tears are seeping with arcane energy, which should make for a sufficiently potent trap. Please go and snag some shellfish─but remember to use fruit worms when you do!"},{"name":"QHOTERLPASOL","text":"You're back! Do you have the materials I asked for? Please say yes─I can feel the fiends encroaching further by the moment!"},{"name":"QHOTERLPASOL","text":"Ah, yes, dangerous <span class=\"emphasis\">and</span> breathtaking! With these I'll fashion an arcane scarecrow that is as lethal as its visage is menacing! I mustn't make it <span class=\"emphasis\">too</span> bone-chilling, of course, lest my Chaqurl soil himself in terror! Hah!"}],"reward":{"gil":533,"reputation":60,"items":[{"id":28187},{"id":6141}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":32}]}},"partials":[{"type":"npc","id":"1032643","obj":{"i":1032643,"n":"Qhoterl Pasol","l":2957,"q":28}},{"type":"item","id":"28187","obj":{"i":28187,"n":"Qitari Compliment","l":1,"c":65077,"t":100}},{"type":"item","id":"6141","obj":{"i":6141,"n":"Cordial","l":25,"c":20622,"t":44}}]}