{"quest":{"name":"Shadow over the Orphanage","location":"The Firmament","id":69375,"patch":5.21,"sort":2001,"eventIcon":71221,"issuer":1032802,"target":1032802,"genre":84,"journal":["The ruffled resident is a picture of worry."],"objectives":["Find the suspicious men in the New Nest.","Speak with the rugged fellow.","Report to the ruffled resident."],"dialogue":[{"name":"HWDCITIZEN03839","text":"You're <span class=\"highlight\">Forename Surname</span>, are you not? The savior of Ishgard? Please, I need your help!"},{"name":"HWDCITIZEN03839","text":"As you may know, there is an orphanage here in the New Nest─Rolanberry Field, it's called."},{"name":"HWDCITIZEN03839","text":"Well, of late, I've been seeing suspicious men lurking about the place and throughout the district!"},{"name":"HWDCITIZEN03839","text":"I can't bear the thought of something befalling the children. Please, will you not investigate these unsavory individuals? "},{"name":"HWDCITIZEN03839","text":"Please, find the suspicious men that have been lurking about. I can't bear the thought of something befalling the children."},{"name":"RASEQUIN","text":"Uwaaah! Give a man a bloody fright!"},{"name":"RASEQUIN","text":"I-I'm in a hurry, if you don't mind. Need to take this little one back to the orphanage."},{"name":"GONTRANDOIX","text":"Heh heh heh, the children won't be able to resist these..."},{"name":"GONTRANDOIX","text":"Wh-What? Wh-Why are you staring at me?"},{"name":"SYSTEM","text":"A suspicious man appears to be spying on the children."},{"name":"PEHAINEL","text":"&lt;gasp&gt;"},{"name":"SYSTEM","text":"No sooner does he notice you than he hastily flees the scene."},{"name":"GONTRANDOIX","text":"You're the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> from before..."},{"name":"PEHAINEL","text":"&lt;gasp&gt;"},{"name":"RASEQUIN","text":"You again!? What do you want?"},{"name":"RASEQUIN","text":"Look, we're busy right now. Come back some other time, will you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm happy to wait."},{"name":"A1","text":"I'm not leaving."},{"name":"RASEQUIN","text":"Fine, suit yourself! Wait over there until we've finished up, all right?"},{"name":"HWDCHILDA03839","text":"(-???-)Rasequin! Gontrandoix! Pehainel! We washed our hands like you told us!"},{"name":"GONTRANDOIX","text":"(-Gontrandoix-)Good, good. It's just about ready to serve."},{"name":"PEHAINEL","text":"(-Pehainel-)Don't get too close to the fire, you hear? We don't want you to burn yourselves."},{"name":"RASEQUIN","text":"(-Rasequin-)Sorry for the wait, but we had to tend to the children first."},{"name":"RASEQUIN","text":"(-Rasequin-)Right then, you had some business with us?"},{"name":"RASEQUIN","text":"(-Rasequin-)So that's what this is all about... Well, for what it's worth, I don't blame folk for being suspicious. We're not exactly the sort you see working at an orphanage."},{"name":"RASEQUIN","text":"(-Rasequin-)The three of us, we used to be Temple Knights. We were there when the Horde descended on the Steps of Faith. And we all took wounds that forced us to hang up our shields."},{"name":"RASEQUIN","text":"(-Rasequin-)We're grateful to still be alive, though. And we have you to thank for it."},{"name":"RASEQUIN","text":"(-Rasequin-)Nowadays, we help retired soldiers find work and look after orphans. Truth be told, at first we thought it was some bad jest when they said we'd be taking care of children. After all, we were knights and not nursemaids. We didn't feel equal to the task."},{"name":"HWDCHILDB03839","text":"(-Orphan Boy-)You look after us, play with us, and make tasty food for us! We're grateful to you all!"},{"name":"RASEQUIN","text":"(-Rasequin-)But the children seem happy enough. And here we are."},{"name":"RASEQUIN","text":"(-Rasequin-)You can assure the concerned citizen that the children are in no danger."},{"name":"HWDCHILDB03839","text":"(-Orphan Boy-)Awww, are you leaving already? Please come again and play with us!"},{"name":"HWDCITIZEN03839","text":"Ah, you're returned! So, were you able to find the suspicious men?"},{"name":"HWDCITIZEN03839","text":"What? They care for the orphans? Oh gods, I feel terrible for having assumed the worst of them..."},{"name":"HWDCITIZEN03839","text":"I shall go and apologize. Yes, and bring the children some sweets as well. My thanks to you for clearing up the misunderstanding!"}],"reward":{"items":[{"id":27889}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69264]},"next":[69376]},"partials":[{"type":"npc","id":"1032802","obj":{"i":1032802,"n":"Ruffled Resident","l":3435,"q":1}},{"type":"item","id":"27889","obj":{"i":27889,"n":"Kukuru Rusk","l":450,"c":24090,"t":46}},{"type":"quest","id":"69264","obj":{"i":69264,"n":"To Thaw a Frozen Heart","g":83,"l":"The Firmament","s":14,"f":1}},{"type":"quest","id":"69376","obj":{"i":69376,"n":"Small Hands, Big Hearts","g":84,"l":"The Firmament","s":2002}}]}