{"quest":{"name":"All the Fish in the Sea","location":"Limsa Lominsa","id":69379,"patch":5.2,"sort":10,"icon":112383,"unlocksFunction":1,"eventIcon":71341,"issuer":1000858,"target":1005424,"genre":91,"journal":["Fhilsnoe has news that should be of interest to any self-respecting fisher, no matter how seasoned.","Fhilsnoe, sensing your love for the ocean and the animals within it, informs you of a new vessel constructed by the Fishermen's Guild, reportedly equipped for long voyages into the open sea. If you wish to know more of this ship, he bids you travel to the ferry docks near the Arcanists' Guild and speak with Captain Foerzagyl.","Captain Foerzagyl eagerly welcomes you to the <span class=\"emphasis\">Endeavor</span>, pride of the Fishermen's Guild. After explaining the rules, Captain Foerzagyl presents you with a set of lures to use on your maiden voyage, and welcomes you to join the crew whenever you like. Speak with Dryskthota to board the ship and embark on a grand fishing adventure."],"objectives":["Speak with Foerzagyl at the ferry docks."],"dialogue":[{"name":"FHILSNOE","text":"Well, if it ain't <span class=\"highlight\">Forename</span>! You may have just taken up your rod, but anyone can see you've got the keen eye of a fisherman, and I reckon you're looking to make that eye keener still. Bigger fish, more exotic locales─aye, that's what we all seek, ain't it? And it just so happens, I can tell you how to find them!"},{"name":"FHILSNOE","text":"Why, if it ain't the fabled <span class=\"highlight\">Forename</span>! I've heard tell you're a big fisher in a small pond, and by the looks of it the rumors are true. But what if I told you there were bigger ponds out there, and bigger fish besides? I reckon you'd be eager to know where, and it so happens I can tell you!"},{"name":"FHILSNOE","text":"You see, the Fishermen's Guild has just finished constructin' a vast boat equipped for voyages on the high seas."},{"name":"FHILSNOE","text":"Far as I know, Captain Foerzagyl is still lookin' for a band of fishermen adventurous enough to brave the deepest fishin' hole of them all. If you think you've the stones for it, I'm sure he'll be glad to take you on."},{"name":"FHILSNOE","text":"If you're lookin' to dip your fishin' hook in the high seas, speak with Captain Foerzagyl over at the docks near the Arcanists' Guild. "},{"name":"DRYSKTHOTA","text":"You wish to board with us? Well then, you've come to the right place. I'm in charge of processing the new crew, and the man next to me is Captain Foerzagyl. "},{"name":"FOERZAGYL","text":"Another daring soul come to join our crew, eh? Then let me be the first to welcome you to the <span class=\"emphasis\">Endeavor</span>!"},{"name":"FOERZAGYL","text":"Now, this ain't your regular fishin' boat. We sail it where we please, holdin' only the course the wind provides to us. Aye, that's the only way we can see the unseen, know the unknown!"},{"name":"DRYSKTHOTA","text":"Captain Foerzagyl, if I may..."},{"name":"DRYSKTHOTA","text":"The <span class=\"emphasis\">Endeavor</span> <span class=\"emphasis\">is</span> the guild's only ship of this magnitude, and if we, ah, as you say, sail only where the wind pleases to take us, we may not ever return to this port. The guild may not look favorably upon such...liberal use of its property."},{"name":"DRYSKTHOTA","text":"Ah, my apologies for forgoing an introduction. I'm Dryskthota, sent from the Fishermen's Guild to oversee this venture. Why am I here when the ship already has a captain, you ask? "},{"name":"DRYSKTHOTA","text":"Well, as you may already know, members of our trade─Master Wawalago and Captain Foerzagyl included─seem to have difficulties managing time. I suppose the concept becomes something of an afterthought when one becomes so focused on water's surface. Regardless, I am here to ensure the ship adheres to its schedule, both by managing its finances and ensuring new crew members board smoothly."},{"name":"DRYSKTHOTA","text":"The <span class=\"emphasis\">Endeavor</span> shall embark upon any number of predetermined routes, each of which have this port as their final destination. Rest assured, if you fail to join one voyage, the ship shall return before long."},{"name":"DRYSKTHOTA","text":"The route we travel will be determined by our departure time, and you may speak with me if you wish to know the route before boarding."},{"name":"DRYSKTHOTA","text":"Pray bear in mind that we must keep to a strict schedule. We cannot take on more crew members after we have begun boarding, and there are no exceptions to this rule. Even for captains."},{"name":"FOERZAGYL","text":"Aye, aye, I hear you. When we board the ship is when we get to the excitin' part: fishin'! Here, take these lures. They're certain to attract somethin' worth displayin' on your wall─or at the very least worth eatin'!"},{"name":"FOERZAGYL","text":"Should be enough to last for one voyage at least. If you're lookin' for other kinds of bait, you can buy it here on the docks or on the ship. Try to switch it up now and then, because if you only use the same bait, you're only gonna keep catchin' the same fish, and that ain't why we do this, is it?"},{"name":"FOERZAGYL","text":"And one last thing: while Dryskthota here may be in charge of the particulars on land, once we're on the ship it's my word you'll heed! So when I say we're fishin' here or we're sailin' there, I won't hear no objections. As long as we're clear on that, I believe there'll be bounteous fishin' for all."},{"name":"DRYSKTHOTA","text":"And with that, the <span class=\"emphasis\">Endeavor</span> is yours to board. If you wish to enter the ship, or if you would like a more detailed explanation of what it is we do, you only need ask."},{"name":"SYSTEM","text":"Potential crew members may register to board the <span class=\"emphasis\">Endeavor</span> in 15-minute intervals occurring every 2 hours (Earth time)."},{"name":"SYSTEM","text":"However, the <span class=\"emphasis\">Endeavor</span> will depart early if the number of crew members reaches 24."}],"reward":{"items":[{"num":10,"id":29717}]},"reqs":{"jobs":[{"lvl":1,"id":19}],"quests":[66644]}},"partials":[{"type":"npc","id":"1000858","obj":{"i":1000858,"n":"Fhilsnoe","l":29,"q":1}},{"type":"npc","id":"1005424","obj":{"i":1005424,"n":"Foerzagyl","l":29,"q":1}},{"type":"item","id":"29717","obj":{"i":29717,"n":"Versatile Lure","l":1,"c":27051,"t":33,"p":300}},{"type":"quest","id":"66644","obj":{"i":66644,"n":"My First Fishing Rod","g":146,"l":"Limsa Lominsa","s":11,"f":1}}]}