{"quest":{"name":"Adventurers and Admirers","location":"The Firmament","id":69374,"patch":5.21,"sort":1101,"eventIcon":71221,"issuer":1032788,"target":1032793,"genre":84,"journal":["The earnest adventurer is staring wide-eyed at you."],"objectives":["Search for the seasoned adventurer near Saint Reymanaud's Cathedral.","Speak with the earnest adventurer in the Firmament.","Speak with the ravishing resident."],"dialogue":[{"name":"HWDADVENTURERA03838","text":"B-By the Twelve, you're <span class=\"highlight\">Forename Surname</span>! That we should stumble into you here of all places!"},{"name":"HWDADVENTURERA03838","text":"Ah, apologies for getting carried away. It's just...we've been wanting to meet you for a very long time."},{"name":"HWDADVENTURERA03838","text":"We're adventurers too, you see. Ever since we witnessed your bout with Hoary Boulder, we've been admirers of yours. We've even taken on the odd mission for the Scions."},{"name":"HWDADVENTURERA03838","text":"With one of our comrades being Ishgardian, we also joined the fray at the Steps of Faith. There, we saw you again in combat, and it'd be no overstatement to say that you carried the battle."},{"name":"HWDADVENTURERA03838","text":"And then you went on to put an end to the entire war! Owing to which, our friend decided to return home. She's now hard at work helping with the restoration effort."},{"name":"HWDADVENTURERB03838","text":"They say that all are welcome to aid in the rebuilding, regardless of origin. Are you participating too, by any chance?"},{"name":"HWDADVENTURERB03838","text":"So you are, so you are!"},{"name":"HWDADVENTURERB03838","text":"If that's the case, then perhaps you've seen our comrade. We've come to pay her a visit, you see, but we're struggling to find her on account of being unfamiliar with the city..."},{"name":"HWDADVENTURERC03838","text":"If you happen to see her, won't you let her know that we're here? She's Elezen...which isn't saying much in these parts, but adventurers can tell each other apart, isn't that right?"},{"name":"HWDADVENTURERA03838","text":"Being quite tall, I thought that it would be easy to spot our friend. But then most everyone here is tall..."},{"name":"HWDADVENTURERA03838","text":"We've searched more or less all of Ishgard by now. Except the area over by Saint Reymanaud's Cathedral, perhaps."},{"name":"HWDADVENTURERB03838","text":"&lt;gasp&gt; Do my eyes deceive? Can it truly be <span class=\"highlight\">Forename Surname</span>!?"},{"name":"HWDADVENTURERC03838","text":"I say, are you not <span class=\"highlight\">Forename Surname</span>!?"},{"name":"HWDADVENTURERD03838","text":"Why, you're the hero of the Scions! Allow me to thank you for your part in protecting my homeland!"},{"name":"HWDADVENTURERD03838","text":"What business brings you to the Holy See this day, if I may ask?"},{"name":"HWDADVENTURERD03838","text":"My comrades are in the Firmament, you say? What joyous tidings! I will seek them out at once! If it please you, will you not join me?"},{"name":"HWDADVENTURERD03838","text":"It has been too long, my friends!"},{"name":"HWDADVENTURERB03838","text":"Thanks for finding her!"},{"name":"HWDADVENTURERC03838","text":"You truly have a hero's sense of direction!"},{"name":"HWDADVENTURERA03838","text":"All this time, and we've had nary a word from you! We thought you had forgotten about us!"},{"name":"HWDADVENTURERD03838","text":"Forgive me, the restoration work has kept me busy, but I couldn't be gladder to see you all."},{"name":"HWDADVENTURERD03838","text":"And to have the great <span class=\"highlight\">Forename</span> present for our reunion makes the moment all the more special."},{"name":"HWDCITIZEN03838","text":"(-???-)Adventurer, adventurer!"},{"name":"HWDCITIZEN03838","text":"Oh, you're all adventurers... &lt;gasp&gt; And even the savior of Ishgard is here!"},{"name":"HWDADVENTURERD03838","text":"This good lady and her family have been kind to me. Is something the matter, my lady?"},{"name":"HWDCITIZEN03838","text":"Of late, a strange creature has been prowling about the New Nest. I'm worried what it might do..."},{"name":"HWDADVENTURERB03838","text":"This sounds like a job for us. It'd be our first outing all together in a while!"},{"name":"HWDADVENTURERD03838","text":"Very well, let us take ourselves to the New Nest and look for this creature at once. If you have a spare moment, <span class=\"highlight\">Forename</span>, perhaps you'd care to attend to this task with us?"},{"name":"HWDCITIZEN03838","text":"It was around here that I saw it..."},{"name":"HWDADVENTURERD03838","text":"There!"},{"name":"HWDADVENTURERD03838","text":"You don't appear to be much of a threat...but if you mean ill, you will answer to us!"},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; S-Stay your weapon! I am not an enemy!"},{"name":"UDEKIKI","text":"No, I am an adventurer like you. The deftarm, I am called, and I came to the Firmament to work. I even have the necessary permit!"},{"name":"UDEKIKI","text":"Ah, Master! What luck that you are here! Please, tell them that I pose no danger!"},{"name":"HWDCITIZEN03838","text":"One of the friendly Vath who dwell in the Dravanian forelands, you say?"},{"name":"HWDADVENTURERD03838","text":"I acted impulsively. Pray forgive me my discourtesy. "},{"name":"UDEKIKI","text":"&lt;click&gt; &lt;click&gt; No harm was done."},{"name":"UDEKIKI","text":"If all is settled, then I will take my leave. There is much work to be done! Yes, much work indeed!"},{"name":"HWDADVENTURERD03838","text":"Thanks to you, we were able to avert a misunderstanding."},{"name":"HWDADVENTURERC03838","text":"If what the fellow said is true, there's plenty of work in Ishgard for the willing. What do you say we stay for a spell?"},{"name":"HWDADVENTURERD03838","text":"Truly? To have all of you here would please me to no end!"},{"name":"HWDADVENTURERA03838","text":"And there you have it! We'll stay here a while and apply ourselves as we continue striving to follow your example!"}],"reward":{"gil":713},"reqs":{"jobs":[{"lvl":60,"id":1}],"questsType":"all","quests":[69264,67792]},"next":[69498]},"partials":[{"type":"npc","id":"1032788","obj":{"i":1032788,"n":"Earnest Adventurer","l":3435,"q":1}},{"type":"npc","id":"1032793","obj":{"i":1032793,"n":"Ravishing Resident","l":3435,"q":1}},{"type":"quest","id":"69264","obj":{"i":69264,"n":"To Thaw a Frozen Heart","g":83,"l":"The Firmament","s":14,"f":1}},{"type":"quest","id":"67792","obj":{"i":67792,"n":"Adventurers Don't Get Cold Feet","g":46,"l":"The Dravanian Forelands","s":2,"f":1}},{"type":"quest","id":"69498","obj":{"i":69498,"n":"Calling All Adventurers","g":84,"l":"The Firmament","s":1102}}]}