{"quest":{"name":"Weapon of Choice","location":"The Lochs","id":69378,"patch":5.2,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1032764,"target":1032764,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"WEAPONSGIENGINEER","text":"I have to say, that was a most exhilarating battle! I never dreamed that I would have the chance to see such a ferocious warmachina with my own eyes!"},{"name":"WEAPONSGIENGINEER","text":"You might find it odd that a citizen of Eorzea would be so excited by something sent by the Garleans to slaughter us in our thousands, but as an avid follower of all things gigantic and mechanical, I just can't help myself!"},{"name":"WEAPONSGIENGINEER","text":"Oh, to be able to pilot such a majestic creation... Perhaps I should defect to the Empire and offer my services. Ahem! Ever since the time of the original Ultima Weapon, I have fallen in love with this fusion of Allagan and Garlean design. It takes my breath away!"},{"name":"WEAPONSGIENGINEER","text":"So much so, that I used my spare moments at the Ironworks to develop a line of miniatures! And now, your recently vanquished foe shall be the inspiration for my next endeavor. Would you do me the honor of casting your gaze across the piece once it is complete?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"If that's what it takes to shut you up."},{"name":"A1","text":"Don't blame me if I smash it to smithereens."},{"name":"WEAPONSGIENGINEER","text":"Hmm? Did you say something? Whatever it was, I'm sure you were offering heartfelt words of encouragement! It's the support of fans such as yourself that make this such a worthwhile hobby."},{"name":"WEAPONSGIENGINEER","text":"I'm proud to say my work adorns the homes of many like-minded machina lovers. The Ultima Weapon and magitek reaper miniatures, to name but two of my creations, are especially popular."},{"name":"WEAPONSGIENGINEER","text":"Of course, I wouldn't be much of an engineer if I only made inanimate ornaments!"},{"name":"WEAPONSGIENGINEER","text":"Behold! I have restored this Allagan relic, added a few flourishes of my own, and dubbed it the Real Virtuality Combat Simulation Experiencinator!"},{"name":"WEAPONSGIENGINEER","text":"By feeding it various pieces of data, such as images of my replicas and so on, it is able to recreate a range of combat scenarios. For research purposes, of course. Not entertainment, oh no!"},{"name":"WEAPONSGIENGINEER","text":"I can see you're practically champing at the bit to give it a try. There's no stopping you intrepid adventurer types!"},{"name":"WEAPONSGIENGINEER","text":"It won't be long until my latest work is complete. All that remains are one or two final adjustments, so don't go anywhere!"}],"reqs":{"jobs":[{"lvl":80,"id":1}],"quests":[69319]}},"partials":[{"type":"npc","id":"1032764","obj":{"i":1032764,"n":"Warmachina Fanatic","l":2408,"q":2}},{"type":"quest","id":"69319","obj":{"i":69319,"n":"Ruby Doomsday","g":25,"l":"The Lochs","s":10,"f":1}}]}