{"quest":{"name":"Small Hands, Big Hearts","location":"The Firmament","id":69376,"patch":5.21,"sort":2002,"eventIcon":71221,"issuer":1032813,"target":1032814,"genre":84,"journal":["Peyraquile's eyes shine at the sight of you."],"objectives":["Speak with Julchiezain in front of the Temple leve counter.","Speak with Achard in the Firmament.","Deliver the salvaged wood scraps to Julchiezain."],"dialogue":[{"name":"PEYRAQUILE","text":"Ooh! You're the hero who was talking with Rasequin and the others!"},{"name":"PEYRAQUILE","text":"The three of us, we're the oldest children at the orphanage."},{"name":"PEYRAQUILE","text":"We know that our carers do much for us, and we want to do something to ease their burden...but we don't know what. You don't have any ideas, do you?"},{"name":"JULCHIEZAIN","text":"Come now, we've already spoken about this! The best way to help is to earn coin as sellswords!"},{"name":"LYCELLE","text":"And I've already told you, it's too dangerous. Better to find work here in the district─minding other people's children and the like."},{"name":"JULCHIEZAIN","text":"Hmph, you're always against my ideas, Lycelle! Well, if you don't have a stomach for battle, you can just stay here! I'll go and get a Temple leve and I'll handle it all by myself!"},{"name":"PEYRAQUILE","text":"He's going to get himself hurt! Please, help us stop him!"},{"name":"JULCHIEZAIN","text":"Oh, it's you again. If you're worried about me, don't be!"},{"name":"JULCHIEZAIN","text":"Excuse me, I want to take on a leve. Something with fighting. That pays good coin."},{"name":"ELOIN","text":"(-Eloin-)Is that so...? While your courage is commendable, I fear such a task is too dangerous for young ones."},{"name":"ELOIN","text":"And even if you were of a suitable age, Temple leves are still in the proposal stage. At present, our order only accepts proven hunters and adventurers for mercenary work."},{"name":"LYCELLE","text":"See? What did I tell you?"},{"name":"JULCHIEZAIN","text":"Awww... What can we do to help at the orphanage, then?"},{"name":"ELOIN","text":"If you are interested, children, we can issue you tradecraft leves instead."},{"name":"PEYRAQUILE","text":"Tradecraft leves?"},{"name":"ELOIN","text":"Aye. We receive requests for all manner of supplies, and we can never have too many hands fulfilling them."},{"name":"ELOIN","text":"And right now, the Convictors have need of firewood and rope. By way of recompense, they offer not only coin, but freshly caught game as well. "},{"name":"JULCHIEZAIN","text":"(-All-)Huzzah!"},{"name":"JULCHIEZAIN","text":"Coin <span class=\"emphasis\">and</span> meat─Rasequin and the others will be so happy! Let's get to work at once! I know where we can get straw to make the rope!"},{"name":"JULCHIEZAIN","text":"Do you think you could give us a hand with the firewood?"},{"name":"JULCHIEZAIN","text":"In the Firmament, there's a man named Achard. He sells all sorts of materials, but he doesn't let us have any, saying that it's not for play. Could you go and ask him for some wood scraps for us?"},{"name":"JULCHIEZAIN","text":"Great! Afterwards, come and meet us back at the orphanage!"},{"name":"ACHARD","text":"Wait, ain't you <span class=\"highlight\">Forename Surname</span>!? Heh, never thought I'd get custom from a great hero!"},{"name":"ACHARD","text":"I salvage materials left over from the reconstruction and sell 'em cheap to craftsmen who make everyday wares. Is there somethin' you need?"},{"name":"ACHARD","text":"...Is that the way of it? Well then, here's some wood scraps you can take. Free of charge."},{"name":"ACHARD","text":"To hear that those children are tryin' to do their part for the orphanage... Brings a tear to the eye, you know? From now on, I'll do what I can to support them."},{"name":"ACHARD","text":"To hear that those children are tryin' to do their part for the orphanage... Brings a tear to the eye. From now on, I'll do what I can to support them."},{"name":"PEYRAQUILE","text":"We've been waiting for you!"},{"name":"LYCELLE","text":"So, do you have the wood scraps?"},{"name":"JULCHIEZAIN","text":"There you are! Did you manage to get the wood scraps?"},{"name":"JULCHIEZAIN","text":"Thank you! We'll get to work making the rope and firewood at once!"},{"name":"JULCHIEZAIN","text":"Twist it like this...then loop it like that..."},{"name":"LYCELLE","text":"You're doing it wrong. It's just going to unravel again."},{"name":"JULCHIEZAIN","text":"(-All-)We did it!"},{"name":"JANTELLOT","text":"(-???-)Eloin said that I was to collect from here... Do you mean to say you children made the items?"},{"name":"PEYRAQUILE","text":"Y-Yes, sir!"},{"name":"JANTELLOT","text":"I see. Children though you may be, do not expect that I will treat you with any leniency. The lives of my men may well depend upon this rope and firewood, and I'll accept naught of inferior quality."},{"name":"JANTELLOT","text":"You supervised them, you say? Then perhaps there is no cause for concern."},{"name":"JANTELLOT","text":"Here, the coin and meat promised. If we are satisfied with the items, there shall be opportunities for you to earn more."},{"name":"JULCHIEZAIN","text":"Huzzah! Let's take this meat to Rasequin and have him use it in today's stew!"},{"name":"LYCELLE","text":"I think it best if we had it cured and set aside for later."},{"name":"PEYRAQUILE","text":"There's plenty of it! We can do both!"},{"name":"PEYRAQUILE","text":"Heh, it's a fine feeling to make ourselves useful. We'll keep on doing what we can to help at the orphanage. Thank you, and please visit us again!"}],"reward":{"items":[{"id":27892}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69375]},"next":[69495]},"partials":[{"type":"npc","id":"1032813","obj":{"i":1032813,"n":"Peyraquile","l":3435,"q":3}},{"type":"npc","id":"1032814","obj":{"i":1032814,"n":"Julchiezain","l":3435,"q":1}},{"type":"item","id":"27892","obj":{"i":27892,"n":"Exquisite Beef Stew","l":450,"c":24110,"t":46}},{"type":"quest","id":"69375","obj":{"i":69375,"n":"Shadow over the Orphanage","g":84,"l":"The Firmament","s":2001}},{"type":"quest","id":"69495","obj":{"i":69495,"n":"A Fashionable Friendship","g":84,"l":"The Firmament","s":2003}}]}