{"quest":{"name":"If Songs Had Wings","location":"The Firmament","id":69373,"patch":5.21,"sort":1001,"unlocksFunction":1,"eventIcon":71341,"issuer":1032005,"target":1032786,"genre":84,"journal":["Ehll Tou is eager to learn."],"objectives":["Speak with Ehll Tou near the Vault.","Speak with Ehll Tou in Falcon's Nest.","Speak with Ehll Tou in the Firmament."],"dialogue":[{"name":"EHLLTOU","text":"Ah, hero, you've come at a good time. I have a query for you."},{"name":"EHLLTOU","text":"As you know, I'm descended from Ratatoskr, and like her, I wish to fill the skies with beauteous songs."},{"name":"EHLLTOU","text":"If I'm to do this, I must know historical events as if I've lived them. To that end, I would meet the great person who put an end to the Dragonsong War. Do you know where I might find this individual?"},{"name":"EHLLTOU","text":"...What? You are that great person? Heh, all this time I thought “hero” was your name!"},{"name":"EHLLTOU","text":"In any case, this makes things simpler. I want you to show me the key places where the war unfolded, and tell me tales about them!"},{"name":"EHLLTOU","text":"Lest you worry, I have Francel's permission to go to the city proper so long as I have company."},{"name":"EHLLTOU","text":"So without further ado, let's begin with a visit to the Vault!"},{"name":"EHLLTOU","text":"So this is the Vault, where the most wicked of men once resided... Vidofnir told us of the time she rescued a child who was thrown off the top."},{"name":"EHLLTOU","text":"Doubtless these walls have witnessed much and more, but what about you? Do you have tales of your own about this place?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I faced powerful foes here."},{"name":"A1","text":"I lost a dear friend here."},{"name":"A1","text":"..."},{"name":"EHLLTOU","text":"So you fought and defeated these villains, and thereby ended the war. Which reminds me, I owe you thanks as well for the peace we now enjoy."},{"name":"EHLLTOU","text":"Oh... I'm sorry to hear that. Long as we dragons live, we form the strongest of bonds with others. But by the same token, it makes us feel the pain of loss very keenly."},{"name":"EHLLTOU","text":"Yet while some would fall into despair, you made the loss your strength and forged on. Yes, as befits a hero."},{"name":"EHLLTOU","text":"If you do not wish to talk about it, then I won't press. A story unwillingly given wouldn't make for the kind of song I wish to share with others."},{"name":"EHLLTOU","text":"Right, that will do for the Vault."},{"name":"EHLLTOU","text":"Next, let us head to the place called Falcon's Nest. I would see the famous relief betokening peace between man and dragon."},{"name":"HAUTDLONG","text":"(-???-)So that dragon wishes to learn about Ishgard..."},{"name":"EHLLTOU","text":"So that is the relief... I've seen the artworks of men before, but I find it such a peculiar way to express one's feelings. Still, you can't be faulted for your artistry."},{"name":"EHLLTOU","text":"But grand as it looks, the scent of sadness clings to it. The scent of blood. Vidofnir's, and others'..."},{"name":"EHLLTOU","text":"Whenever there is tragedy, our hearts can't help but be drawn to it. In this, it seems our kinds are the same."},{"name":"EHLLTOU","text":"Now then..."},{"name":"EHLLTOU","text":"Have you noticed that we are being followed? I know not this person's intent, but let us return to the Firmament for now."},{"name":"HAUTDLONG","text":"(-???-)&lt;gasp&gt;"},{"name":"EHLLTOU","text":"No more suspicious people about. Good."},{"name":"EHLLTOU","text":"My thanks for acting as my guide. I feel as though I have a better understanding of the war now."},{"name":"EHLLTOU","text":"Of course, this is just the beginning. If my songs are to be as resplendent as Ratatoskr's, I must learn more about men and their culture."},{"name":"HAUTDLONG","text":"(-???-)I-I would be glad to assist, if it please you!"},{"name":"EHLLTOU","text":"That scent... You're the one who was following us! If you mean us harm, be warned that this <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> is a <span class=\"emphasis\">hero</span>!"},{"name":"HAUTDLONG","text":"(-???-)Oh, no! No! I-I wouldn't imagine doing you ill!"},{"name":"HAUTDLONG","text":"My name is Hautdilong. Ever since I read Lord Edmont's memoirs, I've wanted to befriend a dragon."},{"name":"HAUTDLONG","text":"But I didn't have the slightest inkling how to go about it. So when I saw you with the savior of Ishgard, on the spur of the moment, I decided to follow."},{"name":"HAUTDLONG","text":"You see, it's my dream to become a writer. Not just any writer, but one who chronicles this new age of peace between man and dragon. So please, won't you allow me to assist you?"},{"name":"EHLLTOU","text":"Well now, how very commendable! I wholeheartedly approve of your endeavor, and I see no reason to refuse you."},{"name":"EHLLTOU","text":"Yes, we can teach each other the ways of our kind. And if you prove yourself useful, I shall credit you in my songs!"},{"name":"HAUTDLONG","text":"Th-Thank you!"},{"name":"EHLLTOU","text":"An unexpected but welcome development! I shall remain here and speak further with our new friend, but I hope to hear more of your tales again!"}],"reward":{"gil":1038},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69264]},"next":[69425]},"partials":[{"type":"npc","id":"1032005","obj":{"i":1032005,"n":"Ehll Tou","l":3435,"q":1}},{"type":"npc","id":"1032786","obj":{"i":1032786,"n":"Ehll Tou","l":3435,"q":2}},{"type":"quest","id":"69264","obj":{"i":69264,"n":"To Thaw a Frozen Heart","g":83,"l":"The Firmament","s":14,"f":1}},{"type":"quest","id":"69425","obj":{"i":69425,"n":"O Crafter, My Crafter","g":84,"l":"The Firmament","s":1002,"f":1}}]}