{"quest":{"name":"A Guest to Impress","location":"Ul'dah","id":69387,"patch":5.2,"sort":195,"repeatable":1,"icon":100978,"eventIcon":71222,"issuer":1032996,"target":1032996,"genre":198,"journal":["Damielliot has the flustered look of a man who has been asked one too many questions.<br><br>※This quest is available for a limited time only.","While your impromptu Little Ladies' Day at Frondale's Phrontistery was a rousing success, Damielliot informs you that not all is well. It would seem Redolent Rose's visit was both a blessing and a curse, as the other young girls now expect Damielliot to arrange a special guest for each of them. The children's requests are fanciful at best, and Damielliot, overwhelmed with the magnitude of the task, humbly requests your aid in securing audiences with some of the storied figures you have met in your journeys. Reauverre has asked each of the girls to write a letter to the person─or persons─they would like to meet. Read them, and if anyone you know might fit the descriptions contained within, inform Reauverre and he will summon the others to the foyer.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Everyone awaits with bated breath as you present to them one of Eorzea's most esteemed personages. The children are delighted to hear their stories and receive their advice, and your guests appear just as delighted to share. The meeting ends with smiles all around, and Damielliot is eager to thank you for your part in arranging it.","After thanking you profusely, Damielliot reiterates that you are welcome to visit the Phrontistery at any time, so long as the day's festivities are afoot in Ul'dah. He also reminds you that the children would be thrilled if you were to bring even just one more of your colorful comrades along with you."],"objectives":["Speak with Reauverre.","Speak with Damielliot."],"dialogue":[{"name":"DAMIELLIOT","text":"Greetings, <span class=\"highlight\">Forename</span>. I am terribly sorry to trouble you again so soon, but may I have a word?"},{"name":"DAMIELLIOT","text":"As you know, our dear Lorie was overjoyed to receive a personal visit from Redolent Rose, whom she so admires. So very few are given such an opportunity, and I shall be forever grateful to you for your part in arranging it."},{"name":"DAMIELLIOT","text":"However, Lorie is not the only one under our care. When the other children heard her story, they came asking me to invite all manner of illustrious figures to the ward."},{"name":"DAMIELLIOT","text":"Of course, I would gladly grant their wishes if I could. However, I am but a lowly physician, and hold little sway outside of this Phrontistery. I do not sup with the sultana or go for leisurely flights on the backs of dragons."},{"name":"DAMIELLIOT","text":"But an adventurer of your stature is no stranger to esteemed company, both within and without this city. The children and I would be eternally grateful if you would draw upon this circle of acquaintances to make their dreams come true one more time. "},{"name":"DAMIELLIOT","text":"I sincerely apologize for imposing upon you yet again, but it is not for my own sake that I beseech your aid. In return for your efforts, I have arranged a reward, but I fear it will only begin to repay the debt I already owe you."},{"name":"DAMIELLIOT","text":"Young Reauverre, emboldened by your example, has chosen to serve as seneschal to our young ladies, and has helped sort all of their various requests."},{"name":"REAUVERRE","text":"I asked them to write letters to the people they wanted to meet, although it seems not everyone had a specific person in mind. You can find them on the desk over there."},{"name":"REAUVERRE","text":"Read through them, and if there are any among your allies and comrades-in-arms who might be fit to call upon, don't hesitate to tell me and I'll gather everyone here."},{"name":"DAMIELLIOT","text":"I am well aware of how much I am asking of you, but the smiles of the children shall be worth the effort. If you could invite even just one more of your illustrious companions, it would mean the world to everyone here, myself included. "},{"name":"REAUVERRE","text":"The letters are still on the desk. I'm certain that among your friends there is at least one you can call."},{"name":"REAUVERRE","text":"If someone comes to mind, tell me and I'll arrange to have everyone gather here for an audience."},{"name":"DAMIELLIOT","text":"Young Reauverre seems to have been inspired by your example, and declares to any who will listen that he too will be a model seneschal. It is heartening to see him in such high spirits."},{"name":"REAUVERRE","text":"So, have you read the letters? Do any of your storied allies fit the descriptions written within?"},{"name":"Q2","text":"What will you say?"},{"name":"REAUVERRE","text":"Great! I'll call the girls here!"},{"name":"Q3","text":"Who will you bring?"},{"name":"A3","text":"The Sultana herself."},{"name":"A3","text":"The First Sword of the Gladiators' Guild."},{"name":"A3","text":"A culinary magician."},{"name":"A3","text":"Ul'dah's top songstresses."},{"name":"A3","text":"A legendary aesthetician."},{"name":"A3","text":"My little dragon friend."},{"name":"A3","text":"Someone with deep pockets."},{"name":"A3","text":"I'd like to reconsider."},{"name":"NANAMOULNAMO","text":"Greetings, children. Is everyone having a splendid Little Ladies' Day?"},{"name":"CHILDRENA03851","text":"It's the sultana! We are honored to be in your presence, Your Grace!"},{"name":"NANAMOULNAMO","text":"Now now, there is no need for such stiff formalities. Pray call me Nanamo. And it is I who should be so honored to receive your invitation. "},{"name":"NANAMOULNAMO","text":"For our children are the most precious gemstones in all of Ul'dah. I am sure there is much and more I can learn from your stories, and full eager am I to hear them."},{"name":"PAPASHAN","text":"Your Grace, each moment we remain here, urgent matters are mounting and left unresolved. We would do best not to tarry overlong."},{"name":"NANAMOULNAMO","text":"Papashan, do you forget the meaning of this day? For generations, the sultans of Ul'dah have put themselves at the complete disposal of their chosen princesses. Am I not beholden to the same tradition? Or do you mean to imply that a sultana cannot be a seneschal?"},{"name":"PAPASHAN","text":"I─ No, Your Grace, of course not!"},{"name":"NANAMOULNAMO","text":"I am glad we have reached an understanding. Now, which one of you addressed their letter to me? Come forward, and I shall serve you as best I can."},{"name":"MYLLA","text":"My friend here tells me that one among you has it in their head to become a gladiator. Raise your hand so I can judge if it's fit to raise a sword."},{"name":"CHILDRENB03851","text":"Me, me!"},{"name":"MYLLA","text":"Aye, that's an arm I'd fear swinging at me even on my best day. You have promise, but many a talented gladiator has seen their bright future smothered by the sands of the Coliseum. Would you like to know what separates the wheat from the chaff?"},{"name":"MYLLA","text":"Much akin to how a sword must be sharpened daily, one's skill with it must be practiced often and with diligence. The very best of us do this and more─they train always with purpose. They've an image in their head of the gladiator they'll become on the morrow, the next moon, and the next summer."},{"name":"MYLLA","text":"Take this advice to heart, for it has guided me to where I am now, and I suspect will guide me further still. Now, imagine yourself with sword and shield in hand, ready to emerge victorious from your first tourney."},{"name":"CHILDRENB03851","text":"A tourney? You mean at the Coliseum? I've always wanted to go to one, but my ma says it's too crowded─that it'll make my condition even worse. So...I've never been."},{"name":"MYLLA","text":"I see. Imagine yourself facing down a different foe, then─this condition of yours. Imagine that you've trounced it so thoroughly that it would never dare to plague you again."},{"name":"MYLLA","text":"Triumph over this enemy and take back your health, and I'll personally see to it that you're invited to a tourney showcasing the fiercest fighters in our guild."},{"name":"CHILDRENB03851","text":"Oh! Really!?"},{"name":"MYLLA","text":"My word is as good as my sword. All I ask is that you put my advice into practice daily. Your first victory is yours for the taking."},{"name":"CHILDRENB03851","text":"Of course, I promise!"},{"name":"LYNGSATH","text":"Oi, now I see why they call Ul'dah a jewel─it's got the prettiest little lasses this side o' Eorzea! Now who 'ere's the one with a taste for cakes and cookies?"},{"name":"CHILDRENC03851","text":"Me, sir. Is it true you know how to cook?"},{"name":"LYNGSATH","text":"Hahaha! Aye, ye could say that. I've been known to whip up a dish or two when the fancy strikes me. Some've even asked me to cook whole meals for them, if ye can believe it─and then they asked for more!"},{"name":"LYNGSATH","text":"In fact, so many couldn't get their fill of my cookin' that I stumbled into the position of guildmaster for the culinarians. Ever 'eard of the Bismarck? I'm somethin' of a known quantity there, and we're always lookin' for talent. I understand yer a dab 'and in the kitchen yerself."},{"name":"CHILDRENC03851","text":"I...I suppose. I like to make sweets, and one day I hope to open my own shop. "},{"name":"LYNGSATH","text":"That's a worthy road to walk down, if I do say so myself. Ye'll lose track o' 'ow many days you've spent bent o'er an oven, 'owever, but I suspect that won't deter ye."},{"name":"LYNGSATH","text":"Now that's the attitude I like to see. Now, lass, I came all this way on the promise o' cake─one that'd put the Bismarck's to shame. Would ye care to oblige me?"},{"name":"SYSTEM","text":"The royal seneschal is in charge of all matters related to the Songbirds, famed songstresses of Ul'dah. He may be able to arrange an audience with them."},{"name":"ULALA","text":"Now this is a crowd! <span class=\"highlight\">Forename</span>, you didn't tell us there would be so many of them! Greetings, everyone, and thank you for having us! Who wants an autograph!"},{"name":"NARUMI","text":"Ulala, show a little restraint, please. We're in a sick ward, not on the stage."},{"name":"MASHAMHAKARACCA","text":"Let's keep civil in front of the children, shall we? <span class=\"highlight\">Forename</span> told us one of you little ladies wishes to be a songstress when she grows up. Which of you is it?"},{"name":"ULALA","text":"Wow, look at her! She'd fit right in with the Songbirds! Who's your favorite? It's okay, you can be honest─it's me, isn't it?"},{"name":"NARUMI","text":"I'm sure there are other things she'd like to talk about. Tell us, what made you want to follow in our footsteps?"},{"name":"CHILDRENE03851","text":"I saw you perform once in Ul'dah, and by the end of the first song I knew what I wanted to be. Your voices, your dances, your costumes─everything was so enchanting."},{"name":"MASHAMHAKARACCA","text":"Really? Thank you for the kind words, truly. As a performer, there is no greater gift than the heartfelt appreciation of a fan."},{"name":"ULALA","text":"True, but being a songstress isn't all sunshine and lemoncakes. And becoming one was even less sweet. There were many hardships to overcome to get to where we are now, and certainly more are still ahead."},{"name":"ULALA","text":"On the stage, we're perfect. But it takes effort off the stage to get there. Day after day for bells on end we practice. You have to be ready to endure that and more."},{"name":"NARUMI","text":"Ulala! She is but a child!"},{"name":"MASHAMHAKARACCA","text":"While Ulala's words may be blunt, there is wisdom in them. If we inspired this girl, don't we owe her honesty? Would that I was given the same gift when I was younger."},{"name":"MASHAMHAKARACCA","text":"Not that I would've chosen any other path than this. Quite the opposite, in fact. For every moment of suffering there are countless more of fulfillment. Like this one, for example. Meeting our fans is always an occasion to hold dear."},{"name":"ULALA","text":"That's right, I wouldn't dissuade any from pursuing their dream of becoming a songstress. Stay determined and practice every day, and before long I'm sure we'll see you on the stage with us!"},{"name":"CHILDRENE03851","text":"I will! Thank you!"},{"name":"ULALA","text":"But let me warn you─if you aim to be Eorzea's number one songstress, you'll have to face some stiff competition!"},{"name":"CHILDREND03851","text":"Who...who is this?"},{"name":"JANDELAINE","text":"Ah, I see there are still drab corners of the world where the name of Jandelaine has yet to grace the people's tongues."},{"name":"JANDELAINE","text":"Not to worry, my dear ladies─by now I am well accustomed to the feat of delivering the light of beauty to Eorzea's darkest recesses!"},{"name":"CHILDREND03851","text":"Uh, this is an aesthetician? He's not like I imagined..."},{"name":"JANDELAINE","text":"Look carefully upon this visage, and then carefully inside yourself. Do so, and you shall come to see the truth."},{"name":"JANDELAINE","text":"Not the truth of prosaic reality. No─the truth of the heart! The one truth that can stir your soul and transform it from dull to dashing. Will you dare to accept it, or will you forever consign yourself to mediocrity?"},{"name":"JANDELAINE","text":"Excellent, my lass. Then take hold of your scissors─figuratively, of course─and prepare to shear your ideal self free from the fabric of the common and shape it into something wondrous, as only an aesthetician can."},{"name":"JANDELAINE","text":"Now, I shall excise the demon of ugliness from atop your crown, and you shall return to us a beauty reborn! "},{"name":"JANDELAINE","text":"Bid farewell to the life you knew, and prepare to see the world from a vantage placed squarely above the clamoring masses! "},{"name":"JANDELAINE","text":"Breathtaking...more lovely than words can say. No, you must not speak─you must bask in the moment."},{"name":"JANDELAINE","text":"Today you step foot upon a new path─a path that will lead you to a beauty so profound that you shall have no choice but to one day join me in my quest to banish all hints of the grotesque from the land. "},{"name":"KALMYHK","text":"So many children! Is this what you call a litter?"},{"name":"CHILDRENF03851","text":"(-Awestruck Girl-)Is that...is that a dragon!? I can't believe it! It sure is small... It's not a poppet, is it?"},{"name":"KALMYHK","text":"Can a poppet speak, child of man? I am indeed a dragon, and you may call me Kal Myhk."},{"name":"CHILDRENA03851","text":"(-Awestruck Girl-)Wow, it talks! Why are you so small? Are you a child like us?"},{"name":"KALMYHK","text":"Hmph. If it pleases you to think of me as a child, then you may do so. What is it you children of men do for leisure, again? If I recall correctly, scampering about aimlessly outside is a pastime of yours. I suppose I could deign to scamper. What say you, <span class=\"highlight\">Forename</span>?"},{"name":"CHILDRENB03851","text":"(-Hyuran Child-)But the physicians said we can't go outside..."},{"name":"KALMYHK","text":"Nonsense. Every child must bask in the sunlight from time to time. How else would they grow big and strong like my friend <span class=\"highlight\">Forename</span> here?"},{"name":"CHILDRENB03851","text":"(-Hyuran Child-)We'd like nothing more than to go play, but we're sick. It might not look it now, but our condition can change in a moment's turn. We have to stay inside or else we might get worse."},{"name":"KALMYHK","text":"I see. How unfortunate. I was looking forward to making new friends and catching up with old ones."},{"name":"KALMYHK","text":"Still, that doesn't mean I can't return when you all are well. A day which will come soon, I'm sure."},{"name":"KALMYHK","text":"And when it does, we'll scamper enough to make up for today thrice over!"},{"name":"KALMYHK","text":"Don't worry, <span class=\"highlight\">Forename</span> will be coming along too. I'll see to it personally."},{"name":"KALMYHK","text":"It's a promise, then. And dragons never break a promise, even should a thousand winters pass. I hope to see you all before then, however, else I may no longer fit inside this tiny structure. "},{"name":"GYORIN","text":"Well met, well met! <span class=\"highlight\">Forename</span> told me to expect princesses, but I see now that the word hardly does this singular group of ladies justice!"},{"name":"CHILDRENF03851","text":"(-Gawking Girl-)My gods, a Namaz!"},{"name":"GYORIN","text":"That's Nama<span class=\"emphasis\">zu</span>, young lady, and we do have names. Yes, yes. Mine is Gyorin, and the pleasure of making your acquaintance is entirely mine."},{"name":"GYORIN","text":"Now, I've heard tell there was a girl here with ambitions of slumbering upon piles of coins and awakening in the lap of luxury. "},{"name":"CHILDRENF03851","text":"(-Gawking Girl-)Me! Me! I wanna be rich!"},{"name":"GYORIN","text":"Ah, I know that glint in your eyes, for I had the same one in mine when I was your age─and truth be told, I still do! It's so rare to meet kindred spirits these days─ones that aren't trying to bankrupt me, that is!"},{"name":"GYORIN","text":"The first step to making a ponze of gold is to know your purpose, for that will serve to spur you forward when your fortunes are down and your coinpurse is empty. "},{"name":"CHILDRENF03851","text":"(-Gawking Girl-)Well, I heard my parents arguing about how much it costs to keep me here... I felt so guilty..."},{"name":"CHILDRENF03851","text":"(-Gawking Girl-)But I also realized how hard they were trying for me. That's when I decided to become rich─so I could make their life easy. I wanna get out of here and show them every corner of Eorzea!"},{"name":"GYORIN","text":"Ah, a more noble goal than most that go into the business of making money! That nobility will serve to help you survive through the lean times─and lean times there will be! Even I am yet to count myself among the affluent and well-to-do. But a Namazu can dream, and dream I shall! Yes, yes!"},{"name":"GYORIN","text":"That being said, if your aim is to fill your coffers, there's no better place than Ul'dah. Fortunes are made and lost every bell in this city, and a savvy merchant can massage the odds so that she wins more than she loses. "},{"name":"GYORIN","text":"Since you already have a purpose to drive you, your next step is to find a market. That requires research─dozens and dozens of conversations to discern what will sell and what's better off left buried in the sand. And even when you're not researching, you must be <span class=\"emphasis\">thinking</span> about your research."},{"name":"GYORIN","text":"Begin your journey with this simple advice in mind and soon riches shall flow to you. Should you succeed─which I'm sure you will─please visit me in Hingashi. I've no doubt two merchants of our aptitude can turn a mountain of coins into an ocean of them! "},{"name":"REAUVERRE","text":"Now that was a sight to see! Who <span class=\"emphasis\">don't</span> you know, friend?"},{"name":"DAMIELLIOT","text":"I must admit, when I first requested your aid, 'twas out of desperation. I expected at best a short letter to read to the children, but you went the extra malm and provided us with an audience. I cannot remember the last time I saw everyone so happy."},{"name":"DAMIELLIOT","text":"Joy was not the only gift you gave everyone, however. The heartening words of your allies will fortify the children's spirits in the days ahead, that they might overcome their illnesses and see their health returned. Please pass on our gratitude to your friends."},{"name":"DAMIELLIOT","text":"And allow me to thank you personally. Your efforts have ensured that this Little Ladies' Day will always be remembered fondly by both the children and myself. You are welcome to visit us here any time you wish, and all the more welcome if you have another companion in tow. "}],"reward":{"items":[{"num":10,"id":5888},{"num":10,"id":5889}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69386]}},"partials":[{"type":"npc","id":"1032996","obj":{"i":1032996,"n":"Damielliot","l":695,"q":2}},{"type":"item","id":"5888","obj":{"i":5888,"n":"Peach Confetti","l":1,"c":22640,"t":85,"p":10}},{"type":"item","id":"5889","obj":{"i":5889,"n":"Cherry Confetti","l":1,"c":22641,"t":85,"p":10}},{"type":"quest","id":"69386","obj":{"i":69386,"n":"Pretty in Peaches","g":198,"l":"Ul'dah","s":194}}]}