{"quest":{"name":"Work It Harder, Make It Better","location":"Ishgard","id":69385,"patch":5.25,"sort":10002,"icon":100980,"unlocksFunction":1,"eventIcon":71341,"issuer":1032898,"target":1032899,"genre":84,"usedItems":[29634,29635,29636,29637,29638,29639,29640,29641,29642,29643,29644],"journal":["Having equipped you with the tool for the job, Neillemard would borrow your professional expertise forthwith.","Neillemard explains that he would like you to begin by augmenting your Skysteel prototype twice. To do so, you must provide Denys with a sufficiency of materials crafted or gathered using the aforementioned prototype itself. With luck, the result will be a honed and tested tool that will meet with Nimie's approval.","After handing over a rather hefty quantity of materials twice over, you at last are in the position to show your new dragonsung tool to Nimie. All of the Skysteel engineers seem quite pleased with the outcome, and are eager to alter their plans for future versions of the tool that it might continue on its path toward perfection─though it seems said adjustments will take some time."],"objectives":["Augment your Skysteel prototype twice and present it to Nimie outside the Skysteel Manufactory."],"dialogue":[{"name":"NEILLEMARD","text":"Finished having a look over the prototype, have you? I'm sure you agree it has nigh-limitless potential."},{"name":"NEILLEMARD","text":"As for how we will realize that potential─we'll be working to the plans we found, at least to begin with. Each tool was accompanied by several sheets, each detailing a stage of enhancement as imagined by the engineers of times past."},{"name":"NEILLEMARD","text":"Some of the later designs are quite fanciful, in both appearance and apparent function. If we can realize the final designs, we will have remarkable works on our hands indeed."},{"name":"NEILLEMARD","text":"However, imaginative as the original creators were, they could not have anticipated the advancements in metallurgy and engineering that led us to where we are today."},{"name":"NEILLEMARD","text":"With our superior resources and techniques, we have the opportunity to go beyond what the original designers envisioned. These adjustments will require we add a few steps here and there, but it will be worth the effort, I assure you."},{"name":"NEILLEMARD","text":"I ask that you proceed with the first two phases of enhancement for the time being. Once you have finished, Nimie and her keen eye for detail will discern what must next be done."},{"name":"NIMIE","text":"We've worked out the materials you'll need, but be warned─they're <span class=\"emphasis\">very</span> specific. A right pain in the arse to get your hands on, in other words."},{"name":"NEILLEMARD","text":"...Yes, thank you, Nimie."},{"name":"NEILLEMARD","text":"I should also mention─the plans are quite insistent that the spiritual bond between tool and wielder provides some manner of benefit. This, to be frank, sounds like a lot of goblin-peddled nonsense to me. Still, I should like you to utilize a Skysteel prototype if you intend to make components yourself."},{"name":"NEILLEMARD","text":"Two birds with one hammer, as it were. And as testing is crucial to maximizing each tool's potential─and a large part of the reason we begged the assistance of a skilled trades<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to begin with─it only makes sense to use every available opportunity to do so."},{"name":"NEILLEMARD","text":"What else... Ah, yes. If you fancy developing our soon-to-be-spectacular Skysteel fishing rod, you will find that you require certain particularly stubborn underwater specimens."},{"name":"NEILLEMARD","text":"In an effort to make their acquisition less...impossible, we have created a special bait to more readily draw them onto the hook. Should you have need of it, Denys will provide."},{"name":"NIMIE","text":"He's also the man to talk to once you've gotten together everything the plans ask for. Trust me─you're better off letting him get on with the improvements than trying to decipher the handwriting of multiple generations of engineers."},{"name":"NIMIE","text":"Once you've got your prototype converted into an honest-to-gods tool, show it to me. I'll have a look to see what changes we might want to make to the plans─and confirm that you can use the thing safely. Wouldn't want anyone to lose an eye."},{"name":"SYSTEM","text":"Present Denys in the Skysteel Manufactory with your Skysteel prototype and the appropriate oddly specific materials to receive an upgraded version."},{"name":"SYSTEM","text":"To craft materials, open the <span class=\"highlight\">Crafting Log</span>, followed by <span class=\"highlight\">Special Recipes</span> from within the requisite crafting discipline. Next, select <span class=\"highlight\">Sidequests</span>, then lastly <span class=\"highlight\">Skysteel Tools</span> to locate applicable recipes."},{"name":"SYSTEM","text":"Materials needed to upgrade botanist's and miner's primary tools can similarly be found in the <span class=\"highlight\">Skysteel Tools</span> section of the <span class=\"highlight\">Gathering Log</span>."},{"name":"SYSTEM","text":"Upgrading a fisher's primary tool requires the use of specialized bait. This can be obtained by speaking to Denys."},{"name":"SYSTEM","text":"Certain materials can only be purchased via scrips. To unlock scrips, you must first complete the sidequest “Inscrutable Tastes.”"},{"name":"NEILLEMARD","text":"My apologies, I know that must have been quite a lot to take in. If I might summarize─please use your Skysteel prototype to obtain the materials we requested of you, and present them to Denys."},{"name":"SYSTEM","text":"Present Denys in the Skysteel Manufactory with your Skysteel prototype and the appropriate oddly specific materials to receive an upgraded version."},{"name":"SYSTEM","text":"To craft materials, open the <span class=\"highlight\">Crafting Log</span>, followed by <span class=\"highlight\">Special Recipes</span> from within the requisite crafting discipline. Next, select <span class=\"highlight\">Sidequests</span>, then lastly <span class=\"highlight\">Skysteel Tools</span> to locate applicable recipes."},{"name":"SYSTEM","text":"Materials needed to upgrade botanist's and miner's primary tools can similarly be found in the <span class=\"highlight\">Skysteel Tools</span> section of the <span class=\"highlight\">Gathering Log</span>."},{"name":"SYSTEM","text":"Upgrading a fisher's primary tool requires the use of specialized bait. This can be obtained by speaking to Denys."},{"name":"SYSTEM","text":"Certain materials can only be purchased via scrips. To unlock scrips, you must first complete the sidequest “Inscrutable Tastes.”"},{"name":"NIMIE","text":"Once your tool can no longer be rightly called a prototype, show it to me. Oh, and hold it like you would if you were about to use it. I can hardly check if you're likely to lose a few fingers to the thing otherwise."},{"name":"NIMIE","text":"Is that a dragonsung tool I spy? It's just like we envisioned!"},{"name":"NIMIE","text":"...Or fairly similar, at any rate. I imagine Denys made some adjustments to account for patterns of wear and such."},{"name":"NIMIE","text":"To hear him tell it, you're quite generous with your materials. Why, we could probably make a good two dozen or so more of these with what was left over."},{"name":"NEILLEMARD","text":"<span class=\"emphasis\">Thank you</span>, Nimie, but I'm sure our friend here is eager to learn about the design of their new tool!"},{"name":"NEILLEMARD","text":"Indeed, as a fusion of traditional techniques and modern sensibilities, this dragonsung tool is a piece truly befitting this new age of peace with dragonkind! What you hold in your hands is a symbol of hope─and of the manufactory's capabilities, if I do say so myself."},{"name":"NEILLEMARD","text":"There are doubtless a fair few improvements we can make to it yet, but we will require a bit of time to ready the plans to account for the adjustments made to the current design."},{"name":"NEILLEMARD","text":"We will do so as soon as physically possible, I assure you. In the meantime, I would consider it a personal favor if you would continue to aid in the construction of the Firmament─with your new tool in hand, perhaps?"}],"reward":{"items":[{"num":5,"id":28720,"one":1,"hq":1},{"num":5,"id":28721,"one":1,"hq":1}]},"reqs":{"jobs":[{"lvl":80,"id":35}],"quests":[69384]},"next":[69428]},"partials":[{"type":"npc","id":"1032898","obj":{"i":1032898,"n":"Neillemard","l":2300,"q":5}},{"type":"npc","id":"1032899","obj":{"i":1032899,"n":"Nimie","l":2300,"q":4}},{"type":"item","id":"28720","obj":{"i":28720,"n":"Mejillones al Ajillo","l":460,"c":24326,"t":46}},{"type":"item","id":"28721","obj":{"i":28721,"n":"Arros Negre","l":460,"c":24032,"t":46}},{"type":"item","id":"29634","obj":{"i":29634,"n":"Dragonsung Saw","l":475,"c":35036,"t":12}},{"type":"item","id":"29635","obj":{"i":29635,"n":"Dragonsung Cross-pein Hammer","l":475,"c":35135,"t":14}},{"type":"item","id":"29636","obj":{"i":29636,"n":"Dragonsung Raising Hammer","l":475,"c":35235,"t":16}},{"type":"item","id":"29637","obj":{"i":29637,"n":"Dragonsung Lapidary Hammer","l":475,"c":35334,"t":18}},{"type":"item","id":"29638","obj":{"i":29638,"n":"Dragonsung Round Knife","l":475,"c":35435,"t":20}},{"type":"item","id":"29639","obj":{"i":29639,"n":"Dragonsung Needle","l":475,"c":35535,"t":22}},{"type":"item","id":"29640","obj":{"i":29640,"n":"Dragonsung Alembic","l":475,"c":35634,"t":24}},{"type":"item","id":"29641","obj":{"i":29641,"n":"Dragonsung Frypan","l":475,"c":35737,"t":26}},{"type":"item","id":"29642","obj":{"i":29642,"n":"Dragonsung Hatchet","l":475,"c":38135,"t":30}},{"type":"item","id":"29643","obj":{"i":29643,"n":"Dragonsung Pickaxe","l":475,"c":38037,"t":28}},{"type":"item","id":"29644","obj":{"i":29644,"n":"Dragonsung Fishing Rod","l":475,"c":38238,"t":32}},{"type":"quest","id":"69384","obj":{"i":69384,"n":"Mislaid Plans","g":84,"l":"Ishgard","s":10001,"f":1}},{"type":"quest","id":"69428","obj":{"i":69428,"n":"In Everyone's Best Interests","g":84,"l":"Ishgard","s":10003,"f":1}}]}