{"quest":{"name":"A Procession Eggstraordinaire","location":"Gridania","id":69383,"patch":5.2,"sort":197,"icon":100976,"eventIcon":71221,"issuer":1032888,"target":1032888,"genre":199,"journal":["Jihli Aliapoh would see the Hatching–tide festivities begin in a grand fashion.<br>※This quest is available for a limited time only.","At Mih Khetto's Amphitheatre, Jihli Aliapoh expresses her gratitude once more for your devoted efforts in returning her precious chickens to their coop. She further explains that preparations are underway for this year's main event─a grand procession which will march down the streets of Gridania, presenting a gift to each and every child in attendance. Should you still be inclined to assist, seek out Nonotta and offer your aid.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Nonotta rejoices at your return and further explains the situation at hand: as you speak, a number of patrons recruited by the Dreamers are putting the finishing touches on the decorative eggs that will be the highlight of the event. She bids you travel to the designated meeting place in her stead to accept the shipments of eggs, and deliver them back to her when the deed is done.","You wait at the locations specified by Nonotta, and in turn are greeted by multiple personages dressed as rabbits, each of whom seem most strikingly familiar despite the disguises that conceal their identity. One by one, they deliver to you a shipment of ornate eggs hollowed out and housing a number of delightful gifts for the children of Gridania. Having safely taken the last shipment into your inventory, you set off back again to make your own delivery to Nonotta.","Nonotta expresses her gratitude for your delivery of eggs, expressing her excitement that the curtain may finally rise on the event for which the Dreamers have meticulously prepared. When you are ready, make for Old Gridania that you might take your proper place in the procession.","Thanks to you and your friends, the procession went off with nary a hitch, your gift of ornamental eggs serving to put a smile on the faces of countless children in Gridania. Your own expression beaming in satisfaction, you set off to share the news with Nonotta.","Nonotta is most happy to hear that the procession was a success, as she well suspected it would be as soon as you agreed to be involved. She quickly dashes off for the amphitheatre to share the news with Jihli, and bids you join her to receive the praise you deserve.","Back at the amphitheatre, Jihli profusely thanks you and Nonotta for your efforts in making this year's Hatching–tide an event to remember, further confessing that she left her post to take part in the procession herself. Rejoicing at the thought that the smiling children today will one day share the joy of the festival she dreamed up with their own children─and so on down to posterity─she smiles in satisfaction and relief, and welcomes you to return to take part in the celebration as often as you like till such time as the season draws to a close."],"objectives":["Speak with Nonotta.","Receive deliveries of eggs at the designated locations.","Deliver the gilded eggs to Nonotta.","Complete the FATE “Rabbits in a Row” in Old Gridania.","Speak with Nonotta.","Speak with Jihli Aliapoh."],"dialogue":[{"name":"JIHLIALIAPOH","text":"A happy Hatching–tide to you, my friend!"},{"name":"JIHLIALIAPOH","text":"Thanks in no small part to your efforts, every last one of our egg-laying assets has been returned to us, and the festivities are in full swing!"},{"name":"JIHLIALIAPOH","text":"As we speak, Nonotta is preparing for the highlight of this year's event: a grand procession in which a host of individuals dressed as rabbits will parade through the streets, handing out exquisitely decorated eggs to the children of the city."},{"name":"JIHLIALIAPOH","text":"Doesn't that sound like fun? If you'd care to join us─and we'd be <span class=\"emphasis\">most</span> appreciative if you did─pray seek out Nonotta. My colleague would be more than happy to fill you in on the details!"},{"name":"NONOTTA","text":"A happy Hatching–tide to you, friend! How do you fare on this most eggstravagantly eggciting of days!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Simply eggceptional!"},{"name":"A1","text":"Eggnough already..."},{"name":"NONOTTA","text":"Indeed! And why wouldn't you be? As you can see, the Hatching–tide festivities have gotten off to a rousing start!"},{"name":"NONOTTA","text":"Oh dear...I seem to have gotten carried away here. Do egg─er, excuse me."},{"name":"NONOTTA","text":"Anyhow! Might I be correct in assuming that you're looking to take part in the grand procession? If so, then you've come to the right place."},{"name":"NONOTTA","text":"As Jihli no doubt explained to you, we have planned for a great parade of celebrants to walk the streets of the town, handing out eggs to every child in sight."},{"name":"NONOTTA","text":"These aren't eggs for eating, of course, but egg─er, exquisitely decorated ones hollowed out and housing a host of lovely gifts inside."},{"name":"NONOTTA","text":"These remarkable specimens have been prepared especially for the occasion by an impressive lineup of some of the realm's greatest luminaries. No doubt they're putting the finishing touches on their masterworks even as we speak!"},{"name":"NONOTTA","text":"I was just about to go to our designated meeting point to receive them myself, but I fear that there are last-minute parade preparations that I must attend to here. Might you be so kind as to go in my stead?"},{"name":"JIHLIALIAPOH","text":"You <span class=\"emphasis\">will</span> be joining us for the procession, won't you, <span class=\"highlight\">Forename</span>? It simply wouldn't be Hatching–tide without you!"},{"name":"KANESENNA","text":"Keep─ah, forgive me. I mean to say, you are the one come for the Hatching–tide eggs, are you not?"},{"name":"KANESENNA","text":"I am happy to inform you that they have been crafted precisely according to Jihli and her Dreamers' request, every last one housing a delightful treat that is sure to please a lucky child."},{"name":"KANESENNA","text":"What manner of treat, you ask? Why, none other than home-baked cookies prepared by myself and my siblings from only the freshest ingredients harvested from the Twelveswood and blessed by the guardians of the forest."},{"name":"KANESENNA","text":"I must admit, I am surprised to see that <span class=\"emphasis\">you</span> will be the one to deliver them, but there is none who I would sooner trust with this most important delivery. Go with the elementals' blessing, that you might bring joy to the young ones of our fair city on this most wonderful of occasions."},{"name":"GODBERT","text":"(-???-)Oho! If it isn't <span class=\"highlight\">Forename</span>, my dear son's boon companion!"},{"name":"GODBERT","text":"(-???-)Oho! I trust you are here for the eggs?"},{"name":"GODBERT","text":"I observe that your expression is a curious one. Clearly, you are at a complete loss as to the identity of the virile gentle-rabbit who stands before you!"},{"name":"GODBERT","text":"Ah, but it is a fine Hatching–tide this year, is it not? The colorful decorations about the town, the festive mood in the air─why, it is enough to make a Mander─er, rabbit such as I lift up his legs, put up his paws, and dance!"},{"name":"GODBERT","text":"Ohoho! But I must not forget why I am here to begin with. Behold, a veritable chicken coop's worth of ornamental eggs, each containing a gold hairpin fashioned with a delightful egg motif!"},{"name":"GODBERT","text":"What child would not rejoice to receive such a stylish and special gift, I ask? None that I know! Ohohoho!"},{"name":"GODBERT","text":"Speaking of children, I wonder─whatever is my dear son up to these days? It has been so very long since he wrote..."},{"name":"SUZAKU","text":"...<span class=\"highlight\">Forename</span>. When I heard that you would be playing a leading role in this year's Hatching–tide, I simply had to witness it myself."},{"name":"SUZAKU","text":"What's this? You do not recognize me? Why, you are as dense as a certain man I once loved... But I jest. My true form concealed within this costume, it is no wonder that you are confused."},{"name":"SUZAKU","text":"It is not the first time I have used my powers to take on another form, though I feel somewhat bereft without my wings."},{"name":"SUZAKU","text":"...But enough about me. We have gifts that must be delivered to the fledglings, do we not? Ah, but my beloved, too, cared very much for children. In choosing the gifts I would prepare for the occasion, I gave much thought to what manner of present would do him proud."},{"name":"SUZAKU","text":"That look in your eyes... Yes, you have journeyed far and wide since felling the mad auspice Koryu. Those who have known suffering the realm over doubtless live freer today for your efforts. Do take care...and promise that you will never abandon the fight."},{"name":"MIOUNNE","text":"Oh, it's you. Come to collect the eggs on behalf of Jihli and her Dreamers, yes?"},{"name":"MIOUNNE","text":"Rest assured I've prepared a full batch for you, each containing an assortment of sugar cookies prepared fresh at the Carline Canopy."},{"name":"MIOUNNE","text":"Take them with my blessing, <span class=\"highlight\">Forename</span>. And should you tire of the festivities, know that you're always welcome at the Canopy for a piping hot pot of tea."},{"name":"NONOTTA","text":"You'll gather the eggs from our patrons, yes? Just between the two of us, you may encounter some fascinatingly familiar personages if you do!"},{"name":"NONOTTA","text":"There you are, my friend! I trust you had no trouble procuring the eggs?"},{"name":"NONOTTA","text":"And there we are! I believe I speak for Jihli and all the Dreamers when I say that I cannot thank you enough!"},{"name":"NONOTTA","text":"And with that, at long last the grand procession can begin! If you're still willing to take part, pray join me and your fellow participants at the starting line in Old Gridania!"},{"name":"NONOTTA","text":"I do believe this will be the greatest Hatching–tide ever!"},{"name":"NONOTTA","text":"Welcome back, <span class=\"highlight\">Forename</span>! Thanks to you, I'm proud to announce that the procession was a resounding success!"},{"name":"NONOTTA","text":"Why, I've never seen so many happy children before! Some seemed quite intimidated at first to see a veritable army of oversized rabbits, but they quickly changed their tune after receiving the gift of extravagant eggs containing all manner of tasteful and toothsome treats!"},{"name":"NONOTTA","text":"No doubt Jihli is overjoyed with how everything turned out. You'll accompany me to deliver the good tidings to our Dreamer-in-Chief, yes?"},{"name":"JIHLIALIAPOH","text":"<span class=\"highlight\">Forename</span>! Nonotta! Once again, Hatching–tide has been a success beyond even my wildest dreams, and I have the two of you to thank for it!"},{"name":"NONOTTA","text":"Thank you, Jihli. But we all know that none of this would even have been possible were it not for your prophetic visions and the remarkable passion by which you pursued making them a reality."},{"name":"JIHLIALIAPOH","text":"You are far too kind, my friends. It is because of you that the parade was far and away the highlight of this year's festivities. Why, I was originally intending to stand aside and direct the procession, but everyone looked to be enjoying themselves so much, I simply had to take part myself!"},{"name":"NONOTTA","text":"I, for one, will not begrudge you. But don't say that too loud─some might be less than happy to hear that you abandoned your post!"},{"name":"JIHLIALIAPOH","text":"At any rate, it was more than clear from the beaming smiles on the faces of all the children in attendance that this year's Hatching–tide has been nothing less than a resounding success!"},{"name":"JIHLIALIAPOH","text":"Our patrons played a great part in this as well. Believe it or not, <span class=\"highlight\">Forename</span>, every last one of them volunteered their services only after hearing that <span class=\"emphasis\">you</span> would be a part of our festivities. Something that I, er, might have told them before you actually volunteered, but let's not overburden ourselves with details, shall we?"},{"name":"JIHLIALIAPOH","text":"At any rate, there is no doubt that─because of you─our fledgling festival is more beloved by the people of Eorzea than ever before. When I think of a time when the children here today tell <span class=\"emphasis\">their</span> children of their fond memories of celebrating Hatching–tide, it fills my heart with no end of pride and joy."},{"name":"NONOTTA","text":"Dreaming of the future is all well and good, Jihli, but might I remind you that the festivities must still go on in the present? I daresay we both have a job to do."},{"name":"JIHLIALIAPOH","text":"Oh, but right you are, Nonotta! I must be getting back to my post and prepare for the next procession."},{"name":"JIHLIALIAPOH","text":"If you have no other pressing matters to attend to, we would most appreciate if you could join us once more before the celebration is through. If not for us, then for the children!"},{"name":"SYSTEM","text":"New wares are now available from the Dreamers in exchange for bejeweled eggs."},{"name":"SYSTEM","text":"You have unlocked the Egg Hunter Riggy mini-game. Open the toy chest in any inn room to take another turn at this activity."}],"reward":{"gil":439},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69382]}},"partials":[{"type":"npc","id":"1032888","obj":{"i":1032888,"n":"Jihli Aliapoh","l":53,"q":2}},{"type":"quest","id":"69382","obj":{"i":69382,"n":"The Eggth Umbral Calamity","g":199,"l":"Gridania","s":196}}]}