{"quest":{"name":"Pretty in Peaches","location":"Ul'dah","id":69386,"patch":5.2,"sort":194,"icon":100977,"eventIcon":71221,"issuer":1032981,"target":1032996,"genre":198,"journal":["The royal seneschal is eager to recruit others to join in the festivities.<br><br>※This quest is available for a limited time only.","Little Ladies' Day has come to Eorzea once again, and after speaking with the royal seneschal, you agree to join his quest to see that no young woman goes without a smile on her face. Lady Aldiytha of House Thorne, ever a proponent of this special day, appears to know just where to start. She tells you of a downcast Lalafell with flaxen hair, whom she spied among the festive crowds, and enlists your aid in finding her. Hurry to Emerald Avenue, that you might find this troubled soul and set her heart at ease.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","One of Ul'dah's citizens informs you that he spotted a Lalafell with flaxen hair just moments before you spoke with him. He recalls her despondent air, which stood out against the cheerful crowds around her. He says she plodded off towards the Sapphire Avenue Exchange. Continue following her trail of sorrow.","The next citizen you speak with tells a familiar story: she caught sight of a forlorn young Lalafell trudging through Ul'dah, this time in the direction of the Gold Court.","Once again you find yourself a step behind, as a bystander tells you of the girl he saw ascending to the Hustings Strip. However, an end may be near, as he surmises that the girl is likely a patient at Frondale's Phrontistery, which is but a short distance from your present location.","Near the entrance to Frondale's Phrontistery you finally find the young Lalafell. Although she is frightened at first, the girl calms after Aldiytha explains your purpose. The girl introduces herself as Momoru, and relates to you the tragic tale of her friend Lorie, who had planned to celebrate Little Ladies' Day with Momoru but was forced to stay inside the Phrontistery after a sudden onset of her illness. Lady Aldiytha is moved by Lorie's plight, and proposes bringing the merriment to Lorie and the other children in the ward. Momoru's spirits brighten upon hearing the idea, but first you must obtain permission from Damielliot, director of the Phrontistery.","You have arrived at Frondale's Phrontistery, and must now seek out Damielliot. Speak with the Phrontistery alchemist to enter the children's ward.","Damielliot readily agrees to bring the celebrations to the Phrontistery, and hatches a plan to shift the timing of the children's scheduled examinations so that you and the others have ample time to acquire decorations and furnish the ward. He asks you to summon each of the children to the examination room while he makes the necessary preparations.","The children─although somewhat unwillingly─make their way to the examination room, leaving the ward unoccupied save for Damielliot and the others, who make plans to acquire the necessary decorations. In the meantime, you have been tasked with inviting a certain guildmaster to the ward. Momoru is ready to depart to the Weavers' Guild to seek an audience with Redolent Rose. ","Momoru tells you of the long nights Lorie has spent fawning over Redolent Rose's designs and thread work, and hopes that a visit from him will serve to improve her friend's condition more than any medicine ever could. Eager to meet the guildmaster in the flesh, she hurries to the Weavers' Guild, bidding you to follow.","Redolent Rose, ever willing to foster the interest of budding weavers, agrees to speak with Lorie without hesitation. He will meet you at Frondale's Phrontistery after first taking care of some pressing matters.","You return to the Phrontistery to see it adorned with trimmings whose grandeur rivals that of a peach tree in full bloom. Speak with everyone gathered before starting the party in earnest.","Not long after you arrive, Redolent Rose follows, and Lorie is surprised as she is delighted to see her idol in the flesh. Lady Aldiytha presents the other children with gifts: hair ornaments made with peach blossoms, which are said to ward off sickness. She also presents Damielliot with a monocle, in homage to the royal physician whom the sultan sent to care for his princess so many Little Ladies' Days ago. The party is off to a great start, and it is time to mingle.","Momoru is a changed Lalafell, and all trace of the sadness which once shrouded her has vanished. She thanks you and welcomes you to return to the children's ward so long as Little Ladies' Day is being observed. Lady Aldiytha, although overjoyed to see the smiles of the children, regretfully informs you that she must return to her manor before her family begins to fuss over her absence. Before departing, however, Aldiytha bids you speak with Damielliot to receive your own special gift.","Damielliot adds his thanks before presenting your reward: a wreath of peach blossoms and a monocle. Although Little Ladies' Day may eventually come to an end, these mementos will serve to keep its spirit alive and well all year round."],"objectives":["Question the residents near the Gate of Nald.","Question the residents of the Sapphire Avenue Exchange.","Question the residents of the Gold Court.","Search for the girl near Scholars' Walk.","Proceed to Frondale's Phrontistery.","Speak with Damielliot.","Speak with the children at Frondale's Phrontistery.","Speak with Momoru.","Speak with Redolent Rose.","Return to Frondale's Phrontistery.","Proceed to Frondale's Phrontistery.","Speak with Aldiytha and the others.","Speak with Damielliot."],"dialogue":[{"name":"BUTLER","text":"Oh, as I live and breathe! Is that <span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span> <span class=\"highlight\">Forename</span>!? How long has it been? Truth be told, I had hoped against hope that I might see you on this most resplendent of days."},{"name":"BUTLER","text":"For there is only one <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who could make this Little Ladies' Day even more wonderful than the last! The maidens of Eorzea cry out for a seneschal of your caliber to dote upon them."},{"name":"BUTLER","text":"You there! Now there is a strapping young <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span> if I ever saw one! Doubtless come to join the Little Ladies' Day festivities, I am sure."},{"name":"BUTLER","text":"Hmm? You have not heard of Little Ladies' Day? Well then, as the <span class=\"emphasis\">royal</span> seneschal, allow me to bring you up to speed. On this day, as you might imagine by the name, the little ladies of the realm come first. Those of us with the heart of a gentleman must endeavor to bring smiles to each and every one of their faces. "},{"name":"BUTLER","text":"I'm doing my part by overseeing this event, and am seeking the aid of as many magnanimous souls as possible, so that every maiden in this fair city feels as exalted as the sultana herself!"},{"name":"BUTLER","text":"Of course, if the satisfaction of good deeds done isn't enticing enough, there are fabulous rewards to be had for any who assist me. What say you? Will you don the mantle of seneschal?"},{"name":"BUTLER","text":"I knew from the moment I saw you that you would be eager to serve! You have my thanks for what I'm sure will be a job well done."},{"name":"BUTLER","text":"As for the job itself, it is most elegant in its simplicity. Go forth into the city streets, dressed to impress and with the spirit of the day in your heart."},{"name":"BUTLER","text":"If you should see a young lady in any manner of distress or discontent, approach them as a gentleman would, lending an ear to their plight and a hand to their aid."},{"name":"ALDIYTHA","text":"(-Elegant Voice-)And I think I know of just such a troubled soul..."},{"name":"ALDIYTHA","text":"Oh, it's you! What a pleasant surprise! On this day more than any other, I recall fondly the little adventure we had when last we met. I am overjoyed that you would lend us your attentive hand once again."},{"name":"ALDIYTHA","text":"If you're worried about my condition, I'm pleased to inform you that I am much improved. I have received special permission to come into the city and participate in the festivities."},{"name":"ALDIYTHA","text":"Greetings, adventurer. Or should I say seneschal? I am Aldiytha of House Thorne, here to assist with the day's revelry."},{"name":"BUTLER","text":"Lady Thorne, what fortuitous timing! I was just about to send this noble seneschal out on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> mission, but it appears you have saved us the trouble of finding a maiden in need."},{"name":"ALDIYTHA","text":"Indeed. While strolling through Emerald Avenue I spied a young girl whose crestfallen expression served as a stark contrast to the merriment around her."},{"name":"ALDIYTHA","text":"I thought to call out to her, but she disappeared in the crowds before I had the chance. We must seek her out, and I believe three sets of eyes would serve better than one."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let us search for this troubled soul together."},{"name":"A1","text":"What did she look like?"},{"name":"ALDIYTHA","text":"Splendid! I knew one such as you wouldn't stand by while another suffered."},{"name":"ALDIYTHA","text":"I'll take that question as tacit agreement. I knew you'd be eager to assist me."},{"name":"ALDIYTHA","text":"All right, then. Be on the lookout for a Lalafell with flaxen hair. With haste and some luck, we should find her before long."},{"name":"BUTLER","text":"Very well! Let us take to the Emerald Avenue, and bring cheer to this young woman's heart!"},{"name":"BUTLER","text":"Lady Aldiytha is the eldest daughter of House Thorne, an old family that even now holds a sterling reputation. She has ever been a stalwart proponent of Little Ladies' Day, and her assistance each year has proven invaluable."},{"name":"ALDIYTHA","text":"That Lalafellin girl couldn't have gone far. Keep an eye out for her distinct flaxen hair."},{"name":"CHEERFULCITIZEN03850","text":"Huh? A Lalafell with flaxen hair? Matter of fact, I did see a girl fitting that description just moments ago."},{"name":"CHEERFULCITIZEN03850","text":"I remember the look on her face more than anything. Although everyone around her was beaming, she was frowning like someone had just snatched her last lemoncake away. If you mean to follow her, she headed off towards the Sapphire Avenue Exchange."},{"name":"CHEERFULCITIZEN03850","text":"Last I saw her, she was headed towards the Sapphire Avenue Exchange. Whatever's eating at her, I hope she finds some way out of the doldrums."},{"name":"DIGNIFIEDCITIZEN03850","text":"Golden hair, you say? A Lalafell, you say? I <span class=\"emphasis\">did</span> see a small figure with vibrant hair cross my path, but it could have just as well been a small child."},{"name":"DIGNIFIEDCITIZEN03850","text":"She was heading towards the Gold Court. Of course, only the Twelve know where she went from there."},{"name":"DIGNIFIEDCITIZEN03850","text":"If you head towards the Gold Court, you may be able to catch up to this person you're searching for."},{"name":"CLASSYCITIZEN03850","text":"Now that you mention it, I think I saw a girl like that not too long ago. She was ascending the steps of the Hustings Strip, although judging by her plodding steps, she was dreading whatever awaited her at the top."},{"name":"CLASSYCITIZEN03850","text":"By her age, I reckon she's a patient at Frondale's Phrontistery. Chances are you could catch her if you left now. "},{"name":"CLASSYCITIZEN03850","text":"No one her age has business up there if they aren't a patient at the Phrontistery. If you leave now you might catch her."},{"name":"MOMORU","text":"Have you been...following me? Why? I don't want any trouble."},{"name":"ALDIYTHA","text":"Trouble? Why, my dear girl, we're here to give you just the opposite!"},{"name":"ALDIYTHA","text":"But first, perhaps an introduction and an explanation would allay your fears. I am Aldiytha Thorne, and we're here because it is our duty to see that no young girl walks the streets of this city with their head down."},{"name":"MOMORU","text":"(-Momoru-)So that's why you were looking for me. I suppose I should thank you. I'm Momoru, by the way."},{"name":"ALDIYTHA","text":"The pleasure is entirely mine, Miss Momoru. Now, what exactly is troubling you? Tell us, and we shall do all in our power to set things right."},{"name":"MOMORU","text":"(-Momoru-)Really? Well...you know Frondale's Phrontistery, right? I'm staying in the children's ward."},{"name":"MOMORU","text":"(-Momoru-)You see, they don't let us go outside very often, and things were dreadfully boring. That is, until I met Lorie and we became the best of friends."},{"name":"MOMORU","text":"(-Momoru-)We promised each other that we would both get better before Little Ladies' Day, so we could play under the peach blossoms together."},{"name":"MOMORU","text":"(-Momoru-)But...but Lorie suddenly got worse! The physicians only gave <span class=\"emphasis\">me</span> permission to leave, and Lorie had to stay behind."},{"name":"MOMORU","text":"(-Momoru-)I didn't want to go without her, but I didn't want to miss this chance either. So...so here I am. But it's no fun all by myself."},{"name":"ALDIYTHA","text":"How tragic...my heart breaks to hear her tale."},{"name":"ALDIYTHA","text":"There must be something we can do for them."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You don't need to go out to “go out.”"},{"name":"A2","text":"Sadly, Lorie's health comes first..."},{"name":"ALDIYTHA","text":"Hmm? What an odd thing to say. What ever do you mean?"},{"name":"ALDIYTHA","text":"&lt;sigh&gt; ...You have the right of it, of course. The physicians surely have good reason to keep little Lorie under their care. Still, we may not be entirely without recourse..."},{"name":"ALDIYTHA","text":"Ah! I know! We bring the festival to them! That way they can enjoy the splendor of Little Ladies' Day without stepping foot outside the Phrontistery. "},{"name":"ALDIYTHA","text":"We can start by decorating the children's ward with the selfsame trappings which adorn the city."},{"name":"ALDIYTHA","text":"And there is yet more we can do. Perhaps a special guest could be arranged for the children. When we're done, I daresay Frondale's Phrontistery may come to rival Emerald Avenue in its pageantry!"},{"name":"MOMORU","text":"(-Momoru-)Really? Truly? I can't wait to see the look on Lorie's face when she sees! I just hope Master Damielliot says it's okay."},{"name":"MOMORU","text":"(-Momoru-)Would you come with me to the children's ward, pretty please? I'm sure he would listen to you. I'll tell the alchemist at the entrance to expect you!"},{"name":"ALCHEMIST03850","text":"Momoru could barely contain herself when she told me about you. She's waiting inside the children's ward. Do you wish to enter?"},{"name":"Q3","text":"Enter the children's ward?"},{"name":"BUTLER","text":"Now this is the very essence of Little Ladies' Day! There is no greater deed than to bring smiles to those girls most in need of them!"},{"name":"ALDIYTHA","text":"Now, where is this Master Damielliot? I hope he can be convinced of the importance of our mission."},{"name":"MOMORU","text":"Don't worry, I'm sure he'll agree. You just have to ask nicely!"},{"name":"STAFFA03850","text":"Greetings. If you're here for an examination, you'll have to fill out a form first."},{"name":"DAMIELLIOT","text":"Ah, now here's a face I did not expect to see today! What brings you to Frondale's Phrontistery? I hope you have not fallen ill."},{"name":"DAMIELLIOT","text":"An adventurer? What business do you have at Frondale's Phrontistery? If you are ill, you must first fill out a form over there."},{"name":"MOMORU","text":"Master Damielliot, let me explain!"},{"name":"DAMIELLIOT","text":"...I see. You mean to host a little Little Ladies' Day of sorts. I must say, it sounds like it would bring some sorely needed color to these otherwise drab halls."},{"name":"DAMIELLIOT","text":"Very well, you have my full support! It would be remiss of me to deny those under my care the most effective medicine of all: joy!"},{"name":"ALDIYTHA","text":"If I may, let's keep this a secret from the others for now, shall we? Children do so love surprises."},{"name":"DAMIELLIOT","text":"Indeed. To that end, I suggest we decorate while the others are absent. There is just one obstacle, however─the sick are not known for their habit of coming and going."},{"name":"STAFFA03850","text":"But Master Damielliot, have you forgotten? The children are soon to undergo their regular examinations, and will be away for the better part of the day. Would that not be the ideal time to decorate?"},{"name":"DAMIELLIOT","text":"Yes...yes, you are quite right. Excellent thinking. And no one would bat an eye if I were to conduct the examinations slightly earlier than scheduled. <span class=\"highlight\">Forename</span>, could you summon the children to the examination room in my stead?"},{"name":"ALDIYTHA","text":"Well, it seems we have the solution to our most pressing concern. I'll begin procuring the necessary trimmings."},{"name":"ALDIYTHA","text":"I also think it would be prudent to provide gifts for the children. No extravagance must be spared on this special occasion. My dear seneschal, can I depend on you to take care of this task?"},{"name":"MOMORU","text":"I know what I can do! Lorie is always talking about Redolent Rose of the Weavers' Guild. I think if we both give him our most winning smiles, he might be convinced to come for a visit!"},{"name":"MOMORU","text":"I say “we,” because <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Forename</span> is coming too! Right?"},{"name":"DAMIELLIOT","text":"Now that we all have our duties, let us attend to them. Time is of the essence."},{"name":"DAMIELLIOT","text":"With my knowledge of the children's tastes, and Lady Aldiytha's exquisite sense for design, I believe the decorations are in good hands."},{"name":"STAFFA03850","text":"Godsspeed to you! Part of me wishes I was one of the children, so I could be spared the pain of waiting here in anticipation."},{"name":"MOMORU","text":"Lorie is the one with red hair, in case you were curious. Once everyone's gone for their examinations, we can go to the Weavers' Guild and Lorie will be none the wiser."},{"name":"MIQOTEGIRLA03850","text":"Oh, hello there. Are you someone's <span class=\"alternative-container\"><span class=\"alternative\">ma</span><span class=\"alternative\">da</span></span>?"},{"name":"HYURANBOYB03850","text":"I haven't seen you before. Are you a new physician?"},{"name":"LORIE","text":"&lt;sob&gt; Oh, I hope Momoru is having fun out there..."},{"name":"MIQOTEGIRLA03850","text":"Oh, hello there. Are you someone's <span class=\"alternative-container\"><span class=\"alternative\">ma</span><span class=\"alternative\">da</span></span>?"},{"name":"MIQOTEGIRLA03850","text":"Oh, the examinations!? Already!? I nearly forgot! Thanks for reminding me─I would've caught an earful if I was late again!"},{"name":"HYURANBOYB03850","text":"I haven't seen you before. Are you a new physician?"},{"name":"HYURANBOYB03850","text":"What!? <span class=\"emphasis\">Another</span> examination! They already know I'm sick, why do they gotta keep poking and prodding me!? Ugh, well, I suppose I better go."},{"name":"LORIE","text":"&lt;sob&gt; Oh, I hope Momoru is having fun out there..."},{"name":"LORIE","text":"Huh? Who're you?"},{"name":"LORIE","text":"Oh, another examination already? That bitter medicine they gave me last time didn't help at all. Are they gonna make me drink it again?"},{"name":"LORIE","text":"I wouldn't mind it if they at least let me go outside. Everyone's probably having so much fun out there... I hope Momoru is too. I'll try to think of her when I'm forcing that poison down my gullet."},{"name":"MOMORU","text":"Did you speak with everyone? Lorie didn't look too sad, did she?"},{"name":"MOMORU","text":"I suppose it's only natural for her to feel that way. But with a little effort, we'll turn her frown into a smile soon enough!"},{"name":"MOMORU","text":"Now let's be off to the Weavers' Guild to speak with Redolent Rose. Lorie always keeps me up late gushing about his designs!"},{"name":"MOMORU","text":"She just adores weaving, and she's had plenty of time in the Phrontistery to practice. She even made me a lace scarf, and says when she grows up she'll join the guild!"},{"name":"MOMORU","text":"A personal visit from Redolent Rose himself would set her as right as any medicine could. Let's be off!"},{"name":"MOMORU","text":"Oh, it's him... Uh... Hmm... What should I...?"},{"name":"ALCHEMIST03850","text":"We are terribly busy with the decorations at present. Please return later."},{"name":"REDOLENTROSE","text":"Oh, what do we have here? A little bird has flown into my guild, but is too shy to sing. What, pray tell, could inspire her to grace us with her voice?"},{"name":"MOMORU","text":"Well, you see... I... I..."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"The others are counting on you!"},{"name":"A4","text":"Do it for Lorie!"},{"name":"MOMORU","text":"I... Yes, of course. Thank you!"},{"name":"MOMORU","text":"Master, uh...Rose? I have something to ask of you. You see, my dear friend Lorie is very sick, and she has always had a passion for weaving. If you could visit her at Frondale's Phrontistery..."},{"name":"REDOLENTROSE","text":"Say no more. A fledgling weaver is in need, and I shall gladly fly to her assistance. The tapestry of this guild's history ever requires new hands to sew it, after all."},{"name":"REDOLENTROSE","text":"Forgive me, but I have some matters I must attend to before leaving. Rest assured, however, that I'll make haste to the children's ward the very moment I am done."},{"name":"MOMORU","text":"Thank you, thank you!"},{"name":"MOMORU","text":"&lt;sigh&gt; We did it! Truth be told, in all the stories Lorie told me of Master Rose, I imagined him to be a little...littler. Lorie never told me how kind he was, though!"},{"name":"MOMORU","text":"Oh, I don't know if I'll be able to resist telling Lorie that <span class=\"emphasis\">Redolent Rose</span> is visiting the Phrontistery. Promise to stop me if I begin to blurt it out. I hope everyone else is coming along as well as we are!"},{"name":"REDOLENTROSE","text":"I didn't scare the girl, did I? I suppose even a figure as graceful as mine can be imposing to a Lalafell."},{"name":"ALCHEMIST03850","text":"We've managed to finish decorating, and I must say I am quite pleased with our efforts. Would you like to enter the children's ward?"},{"name":"MOMORU","text":"Wow! Look at this!"},{"name":"LORIE","text":"So many flowers!"},{"name":"LORIE","text":"It's so pretty!"},{"name":"REDOLENTROSE","text":"(-Familiar Voice-)I daresay I could not have arranged a more pleasant display myself!"},{"name":"LORIE","text":"Huh? You're...you're Redolent Rose! Uh...sir."},{"name":"REDOLENTROSE","text":"Indeed I am. And you must be the Lorie whom I have heard so much about."},{"name":"LORIE","text":"You...you know my name?"},{"name":"REDOLENTROSE","text":"Why, of course I do! I must say I envy you, to have such a devoted friend like little Momoru here."},{"name":"REDOLENTROSE","text":"She also told of your passion for weaving. Is it true you wish to join the guild someday? If so, pray allow me to answer any questions you may have─I would not dream of keeping the tricks of our trade from an aspiring guild member."},{"name":"ALDIYTHA","text":"Now then, if all the little ladies would gather around, I have presents for all of you!"},{"name":"ALDIYTHA","text":"Place these peach blossoms in your hair, and become as princesses!"},{"name":"ALDIYTHA","text":"Surely you all know the history of this day, when Sultan Baldric would serve as seneschal to a specially chosen girl."},{"name":"ALDIYTHA","text":"These accoutrements have roots in that tradition. One Little Ladies' Day long ago, a young girl beset by illness was chosen as Baldric's princess."},{"name":"ALDIYTHA","text":"Upon learning of her condition, he presented her with a wreath of peach blossoms to wear upon her head, much like the ones you now hold in your hands."},{"name":"ALDIYTHA","text":"Peach blossoms have long been said to ward off ailments of all manner, and some even believe they hold the key to eternal youth. It was with this in mind that the sultan gave his gift."},{"name":"ALDIYTHA","text":"Soon after that, the young woman made a complete recovery, and went on to live a long and fruitful life. Perhaps the legends of the blossoms' properties were true after all."},{"name":"ALDIYTHA","text":"Little ladies─little <span class=\"emphasis\">princesses</span>─keep these always close, and if your sickness should ever seem too much to bear, remember the princess who came before you. As she did, you too shall regain your strength!"},{"name":"CHILDA03850","text":"(-Children-)We will, we will! Thank you!"},{"name":"ALDIYTHA","text":"Ah, but I didn't forget Master Damielliot. I have something for you as well. Here, wear this."},{"name":"DAMIELLIOT","text":"Hmm. Like this? Does it suit me?"},{"name":"ALDIYTHA","text":"Better than I dared imagine!"},{"name":"DAMIELLIOT","text":"I suppose I should be grateful for that. However, I must admit, I fail to see how this trinket will help."},{"name":"ALDIYTHA","text":"Ah, but I haven't finished the story. The tale doesn't end with peach blossoms, oh no. The sultan also sent a handpicked physician─his very best─to care after his princess. That physician wore a monocle much like this one."},{"name":"ALDIYTHA","text":"I had a feeling that─besides lending an air of authenticity to the day─a monocle would become you. And so, with the help of the seneschal, I endeavored to procure one."},{"name":"DAMIELLIOT","text":"Your efforts are much appreciated, my lady. I shall do my utmost to honor the example set by this physician, and will not rest until every one of my princesses returns to prime health. "},{"name":"ALDIYTHA","text":"I trust you will only impress, Master Damielliot. Would you look at them? Those smiles embody everything beautiful about this day."},{"name":"ALDIYTHA","text":"Master Damielliot, my dear seneschal, I couldn't have achieved this alone. I'm in your debt."},{"name":"DAMIELLIOT","text":"And let us not forget <span class=\"highlight\">Forename</span>. You truly are a seneschal among seneschals."},{"name":"BUTLER","text":"Indeed. Any would be hard-pressed to find a more gentlemanly company than the one gathered here. To another successful Little Ladies' Day!"},{"name":"REAUVERRE","text":"Master Damielliot told me about everything you did for the girls. Thank you─it's been too long since I've seen everyone in such high spirits!"},{"name":"REAUVERRE","text":"It's good to see you again, friend. My ailment still troubles me, but I'm determined not to let it win!"},{"name":"REAUVERRE","text":"By the way, Master Damielliot told me of the celebrations you arranged for the girls. Thank you─it's been too long since I've seen everyone in such high spirits!"},{"name":"MOMORU","text":"Lorie and the others will be talking about this for moons to come! We'll keep these in our hair until every one of us is better!"},{"name":"MOMORU","text":"We'll never forget what you all did for us today, I'm sure of it. From the bottom of my heart, thank you."},{"name":"MOMORU","text":"Master Damielliot said you're welcome at the children's ward any time during Little Ladies' Day. Do come visit!"},{"name":"ALDIYTHA","text":"Seeing poor Momoru in distress reminded me of that Little Ladies' Day long ago, and of my own struggles with my physical condition. It was clear then what needed to be done."},{"name":"ALDIYTHA","text":"Considering everything had to be arranged at such short notice, I'd say we pulled through splendidly. There was nary a frown to be seen, on both child and adult alike."},{"name":"ALDIYTHA","text":"And now, although it pains me to say it, I must return to my manor. My family tends to fret unreasonably if I'm absent overlong."},{"name":"ALDIYTHA","text":"However, before I go, I do believe there is the matter of <span class=\"emphasis\">your</span> gift. Master Damielliot is keeping it safe for you at my behest. May we meet again soon, adventurer!"},{"name":"MOMORU","text":"Come visit us any time─we'll be waiting!"},{"name":"DAMIELLIOT","text":"I do not believe I have had the opportunity to thank you personally. Your efforts served not only to lift the children's spirits, but the staff's as well. "},{"name":"DAMIELLIOT","text":"Had Lady Aldiytha not already arranged to reward your cooperation, I certainly would have. That being said, these are yours."},{"name":"DAMIELLIOT","text":"It is not often the children have the chance to meet an adventurer, let alone one so kind as yourself. Pray visit us again while you can."}],"reward":{"items":[{"id":30042},{"id":30043}]},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[69387]},"partials":[{"type":"npc","id":"1032981","obj":{"i":1032981,"n":"Royal Seneschal","l":40,"q":1}},{"type":"npc","id":"1032996","obj":{"i":1032996,"n":"Damielliot","l":695,"q":2}},{"type":"item","id":"30042","obj":{"i":30042,"n":"Seneschal's Monocle","l":1,"c":40984,"t":34,"p":1000}},{"type":"item","id":"30043","obj":{"i":30043,"n":"Princess's Peach Corsage","l":1,"c":41792,"t":34,"p":1000}},{"type":"quest","id":"69387","obj":{"i":69387,"n":"A Guest to Impress","g":198,"l":"Ul'dah","s":195,"r":1}}]}