{"quest":{"name":"The Eggth Umbral Calamity","location":"Gridania","id":69382,"patch":5.2,"sort":196,"icon":100975,"eventIcon":71221,"issuer":1032887,"target":1032888,"genre":199,"journal":["The revelrous rabbit in Mih Khetto's Amphitheatre wishes to share the joy of Hatching–tide with you.<br>※This quest is available for a limited time only.","In Mih Khetto's Amphitheatre, you come upon Jihli Aliapoh, who regales you with the history of the event known as Hatching–tide─a festival born of her vision of the Twelve Archons of the Sixth Umbral Era. As she tells it, this year she was blessed with another vision: this one not of storied heroes, but of fluffy rabbits─which may in part explain her curious appearance. Though what she has in mind is not immediately clear, one thing is: she requires your aid to make the festival a success. Should you be inclined to lend your assistance, seek out her colleague Nonotta by the Carline Canopy and see what you might do on the celebrants' behalf.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You find Nonotta, herself curiously dressed as an oversized hare, who is all too eager to share with you her plight. To wit, a veritable legion of chickens painstakingly procured by her and Jihli have flown the coop, placing their meticulous plans for this year's festivities in peril. Put your hen-hunting skills to the test and go forth to recover these exceptional egg-laying specimens, that the celebration might not meet a premature demise.","After a hair-raising, feather-ruffling encounter, you succeed in tracking down the chickens as per Nonotta's request. Report back to your client and let her know that the deed is done.","Nonotta rejoices that you have successfully tracked down all of her lost chickens and led them back to the coop. She bids you join her back at Mih Khetto's Amphitheatre, where you might share the news of your triumph with her compatriot Jihli Aliapoh.","Back at the amphitheatre, Jihli rejoices upon hearing that the chickens have been returned, allowing Hatching–tide to begin in earnest. After Nonotta takes her leave, Jihli informs you in secret that she believes you to be the key to the success of this year's festivities. If you feel so inclined, wait around and offer your aid when the time is right."],"objectives":["Speak with Nonotta near the Carline Canopy.","Complete the FATE “A Cluckin' Catastrophe” in the Central Shroud.","Speak with Nonotta.","Speak with Jihli Aliapoh."],"dialogue":[{"name":"JIHLIALIAPOH","text":"Come one, come all! For Hatching–tide is upon us once more!"},{"name":"JIHLIALIAPOH","text":"Well, if it isn't <span class=\"highlight\">Forename</span>! Back to enjoy the festivities for another year, are we? I could not be more pleased to welcome you once again."},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)Hm? Do you not recognize me? It's me, your old friend Jihli Aliapoh!"},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)My name is Jihli Aliapoh, and it's a pleasure to make your acquaintance. No doubt you're wondering why I'm dressed the way I am. But do not worry─all will be clear in due time."},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)Now, don't tell me... You are an adventurer, yes? Well, you certainly have the inquisitive nature of one, at any rate! May I ask your name?"},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)Well then, <span class=\"highlight\">Forename</span>, I should probably mention that Hatching–tide all began with a vision I had before the Seventh Umbral Calamity, in which the Twelve Archons delivered unto me a message."},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)From atop their giant, decorated eggs they called to me: “Arise, young Dreamer, and make ready the vessels for our return.” When I awoke, I quickly set about filling the realm with all manner of painted ovoids. And thus did this joyous yearly celebration come to be!"},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)And before you ask─yes, this costume is the result of yet another vision. I but recently dreamt that a veritable horde of hippity, hoppity rabbits descended on the realm for Hatching–tide, delighting children far and wide with their button-cute noses and cotton-white tails."},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)“Why rabbits?” you may ask, and the question is a valid one. After all, rabbits do not lay eggs, nor are they traditionally associated with the Archons in any particular way."},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)Unfortunately, I have no answers to that question. And yet, so vividly do I remember the smiles on the faces of each and every youngling in my dream that I swore I would bring this vision of Hatching-tide to life. Might you be so kind as to lend me a hand?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Sounds eggcellent to me!"},{"name":"A1","text":"I can find no eggscuse not to..."},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)Oh, thank you, my friend! With your aid, I have no doubt that this year's incarnation of Hatching–tide will be the most exciting and extravagant yet!"},{"name":"JIHLIALIAPOH","text":"(-Jihli Aliapoh-)And so, without further ado, I would encourage you to seek out my associate Nonotta near the Carline Canopy. She will be most happy to enlighten you as to how you might assist us in making this year's festivities something to remember!"},{"name":"NONOTTA","text":"The happiest of Hatching–tides to you, my dear!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'm looking for Nonotta."},{"name":"A2","text":"And to you."},{"name":"A2","text":"That voice..."},{"name":"NONOTTA","text":"(-Nonotta-)I may have more fur and whiskers than usual, but I can assure you that it is me inside this most charming costume. Nonotta, that is."},{"name":"NONOTTA","text":"(-Nonotta-)You recognized me? Oh, how astute you are, my adventuring friend! Indeed, it is none other than I─Nonotta!"},{"name":"NONOTTA","text":"(-Nonotta-)Greetings, my adventuring friend! I trust you are enjoying the festivities? Jihli and I have spared no effort or expense to make this year's Hatching–tide the best Eorzea has seen!"},{"name":"NONOTTA","text":"(-Nonotta-)Now, pray tell, what might I do for you?"},{"name":"NONOTTA","text":"(-Nonotta-)Come to help with the festivities, you say? Your presence is most welcome, and then some! Jihli and I have our hands─or should I say paws?─full here, and we would be most indebted to you for your assistance."},{"name":"NONOTTA","text":"(-Nonotta-)Allow me to explain. In the hopes of turning this year's Hatching–tide into a true event for the ages, we scoured the realm and procured a host of chickens that would lay for us the most remarkable eggs."},{"name":"NONOTTA","text":"(-Nonotta-)Sadly, the other day, I got distracted for a moment and neglected to properly shut the door to the storehouse where we were keeping them. Before I knew it, the birds had all flown the proverbial─or literal, in this case─coop."},{"name":"NONOTTA","text":"(-Nonotta-)Needless to say, without our hens, there can be no eggs. And without our eggs, there can be no Hatching–tide! Surely you can see our plight? And so I beg of you, my friend: please go out there and catch our precious birds before they are swallowed up by the beasts that prowl the wood."},{"name":"NONOTTA","text":"(-Nonotta-)I have but one more small request for you, and that is that you don one of these lovely rabbit suits and wear it while you go about the deed. Why, you ask? Let it suffice to say that Jihli's visions have never led us astray before, and I do not expect this to change."},{"name":"NONOTTA","text":"(-Nonotta-)You may be skeptical now, but believe me─once you put it on, you'll not readily want to part with it. And that's why I'm happy to say that we will be happy to gift one to you in commemoration of your efforts should you see the task through to completion!"},{"name":"JIHLIALIAPOH","text":"Did you manage to speak with Nonotta? If you can't find her, remember: she should be dressed not unlike I am."},{"name":"NONOTTA","text":"Oh, friend! You must track down our precious chickens! Our painstaking preparations for this year's Hatching–tide will be all for naught if you cannot!"},{"name":"NONOTTA","text":"Welcome back, friend! I'm pleased to inform you that we've counted our chickens, and they've all safely returned to the coop! Truly, you have done us─no, all of Eorzea─a great service this day."},{"name":"NONOTTA","text":"And without further ado, I must report back to Jihli and share these good tidings. If you have no other pressing matters, pray join me. I'm quite certain our lead celebrant will want to offer her thanks in person."},{"name":"JIHLIALIAPOH","text":"Nonotta! And <span class=\"highlight\">Forename</span>! I hear that─in no small part thanks to you─our most confounding chicken conundrum has been solved."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"I found your chickens, all right."},{"name":"A3","text":"Eggceptional work, if I do say so myself."},{"name":"JIHLIALIAPOH","text":"Indeed, you have performed a most eggceptional service for us here today! Yes, you are truly a par<span class=\"emphasis\">egg</span>on among adventurers! An <span class=\"emphasis\">eggs</span>emplar of─ahem, forgive me. "},{"name":"JIHLIALIAPOH","text":"Yes, you are truly a par<span class=\"emphasis\">egg</span>on among adventurers! An <span class=\"emphasis\">eggs</span>emplar of─ahem, forgive me."},{"name":"JIHLIALIAPOH","text":"At any rate, thanks to you, we can at long last begin the festivities in earnest! Let the curtain rise on a Hatching–tide to remember!"},{"name":"NONOTTA","text":"As promised, you will now be rewarded with a stylish rabbit costume of your very own."},{"name":"NONOTTA","text":"We'd be most <span class=\"emphasis\">egg</span>preciative─ah, that doesn't quite work, does it?─if you could don it for the duration of the festivities to add an extra touch of charm and delight to the celebration."},{"name":"NONOTTA","text":"And with that, I had best get back to my post before the chickens run off again!"},{"name":"JIHLIALIAPOH","text":"Don't tell Nonotta I said this, <span class=\"highlight\">Forename</span>, but I am counting on <span class=\"emphasis\">you</span> as much as anyone to make this year's Hatching–tide a resounding success. Promise that you won't go far, will you?"},{"name":"SYSTEM","text":"This marks the conclusion of the first quest for this year's Hatching–tide. For details on when the second quest will be available, please check the Lodestone."},{"name":"NONOTTA","text":"I can't thank you enough for returning our chickens, friend. Jihli is positively overjoyed to know that the festivities will be able to go on just as she envisioned them!"}],"reward":{"items":[{"id":30044},{"id":30045}]},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[69383]},"partials":[{"type":"npc","id":"1032887","obj":{"i":1032887,"n":"Revelrous Rabbit","l":53,"q":1}},{"type":"npc","id":"1032888","obj":{"i":1032888,"n":"Jihli Aliapoh","l":53,"q":2}},{"type":"item","id":"30044","obj":{"i":30044,"n":"Rabbit Head","l":1,"c":41791,"t":34,"p":1000}},{"type":"item","id":"30045","obj":{"i":30045,"n":"Rabbit Suit","l":1,"c":43583,"t":35,"p":1000}},{"type":"quest","id":"69383","obj":{"i":69383,"n":"A Procession Eggstraordinaire","g":199,"l":"Gridania","s":197}}]}