{"quest":{"name":"Never Forget","location":"South Shroud","id":69396,"patch":5.3,"sort":124,"eventIcon":71201,"issuer":1000590,"target":1006193,"genre":1,"journal":["The eponymous proprietor of Buscarron's Druthers has need of an able adventurer.","A Qiqirn and former employee of Buscarron's Druthers forgot some of his personal effects upon leaving. Go speak to Baensyng on Hawkers' Alley in Limsa Lominsa to learn where you might find said Qiqirn.","You learn from Baensyng that a Qiqirn merchant on Hawkers' Alley named Kyokyoroon may know something of Teteroon's whereabouts. Bring the trader a fresh chicken egg to coax him into spilling the goods.","After receiving the fresh chicken egg, Kyokyoroon is more than happy to tell you that Teteroon has since moved on to barter his wares at a trading post elsewhere. However, he cannot recall where said trading post is, and instead directs you to a man named Wineburg at the Lominsan ferry docks, who he believes knows Teteroon's whereabouts.","Wineburg recalls only that Teteroon rode the ferry to Aleport, and nothing beyond that. Should you decide to continue your search there, he advises you to speak with a man named Ahldfoet.","According to Ahldfoet, Teteroon headed north into upper La Noscea, most likely in search of Memeroon's Trading Post. Proceed to the outpost and present Teteroon with his forgotten scarlet earring.","You have delivered the scarlet earring to Teteroon. Reminded of Buscarron, he promptly lapses into nostalgic reminiscences of former days."],"objectives":["Speak to Baensyng in Hawkers' Alley.","Deliver the fresh chicken egg to Kyokyoroon.","Speak with Wineburg.","Speak with Ahldfoet in Aleport.","Deliver the scarlet earring to Teteroon at Memeroon's Trading Post."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"BUSCARRON","text":"I appreciate all the good you've done for our patrons. If you aren't disinclined, I have a favor of my own to ask you."},{"name":"BUSCARRON","text":"There's a Qiqirn friend of mine, you see─name of Teteroon. A good lad. It was right after the Calamity that I came across him fallen in the Shroud. He nearly died in all the havoc. So, I took him in and nursed him back to health best I could."},{"name":"BUSCARRON","text":"He worked here at my Druthers for a spell after that. Got to talking about striking out on his own, he did, and not long after cast his lot with a merchant bound for La Noscea."},{"name":"BUSCARRON","text":"Well, it just so happens I got to cleaning up around here and came across something of his─this scarlet earring. I know he was fond of the thing, but he must have just forgotten it when he left. So, I'd like to see that it gets to him."},{"name":"BUSCARRON","text":"Can't say for sure where he ended up, but might be a friend of mine can. A Roegadyn fellow named Baensyng. You can find him on Hawkers' Alley in Limsa Lominsa. He knows everything of the comings and goings of merchants there."},{"name":"BAENSYNG","text":"Ye found yer way to 'Awkers' Alley, friend.<br>...Hm? A Qiqirn what worked at the Druthers? Aye, ye speak of Teteroon."},{"name":"BAENSYNG","text":"Related to that Kyokyoroon bloke just o'er there by some blood or another. Two of 'em put in together an' were makin' good coin. But ol' Teteroon up an' left Limsa not long ago. Couldn't say as to why or where."},{"name":"BAENSYNG","text":"Yer better off askin' Kyokyoroon himself. He can be tight of lip, though, I warn ye. Best to take this chicken egg with ye. Li'l bastard loves the bloody things."},{"name":"BAENSYNG","text":"Heh... Good to hear about ol' Busc, though. Sounds as though he ain't changed a bit. Just like him to send a 'venturer along. Too shy to come his own self. Gods, I miss drinkin' with that fool."},{"name":"KYOKYOROON","text":"Customer, be welcome! Not customer? Not come with custom? Kyokyoroon busy with business. Too busy for blather."},{"name":"KYOKYOROON","text":"Chicken egg! Kyokyoroon love chicken egg! Love chicken egg more than love customer!"},{"name":"KYOKYOROON","text":"Looking for Teteroon? Teteroon no here no more. Teteroon leave Limsa. Teteroon go look for sparklies."},{"name":"KYOKYOROON","text":"Now working at trading post. Good trading post. Forget where trading post is."},{"name":"KYOKYOROON","text":"Wineburg know Teteroon. Wineburg know trading post. Wineburg at ferry docks. You go to ferry docks."},{"name":"KYOKYOROON","text":"Kyokyoroon forget things. Wineburg remember things. You talk to Wineburg, not Kyokyoroon."},{"name":"WINEBURG","text":"Teteroon? Aye, I seen him. That is to say, I saw him."},{"name":"WINEBURG","text":"He was headed somewhere up north, by way of the ferry to Aleport. Might as well head there and see what ye can suss out. The skipper here can take you there."},{"name":"WINEBURG","text":"When ye arrive, I'd start by askin' Ahldfoet. He's an old hand what knows a great deal about a great many things."},{"name":"WINEBURG","text":"All's I know is that Teteroon stopped in Aleport. If ye want to find him, ye'd best look there."},{"name":"AHLDFOET","text":"Teteroon? Aye, I saw him. That is to say, I seen him."},{"name":"AHLDFOET","text":"He took himself north, through Skull Valley, into Oakwood. Was lookin' for a place run by his fellow Qiqirn."},{"name":"AHLDFOET","text":"I reckon he meant the one right on the shore of Bronze Lake─Memeroon's Trading Post. Follow the road and yer sure to find it."},{"name":"TETEROON","text":"Customer, be welcome! Not customer? Not come with custom? Bring something for Teteroon?"},{"name":"TETEROON","text":"Teteroon forget this! Forget at Druthers. Teteroon swore would never forget earring...but never forget forgot. Teteroon thank! Teteroon thank!"},{"name":"TETEROON","text":"Good Buscaroon doing good? Good Buscaroon good to Teteroon. Teteroon miss good Buscaroon... &lt;sigh&gt;"}],"reward":{"items":[{"id":27653,"one":1},{"id":2725,"one":1},{"id":2719,"one":1},{"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":23,"id":130}],"quests":[69395]},"next":[69397]},"partials":[{"type":"npc","id":"1000590","obj":{"i":1000590,"n":"Buscarron","l":56,"q":14,"t":"Alehouse Proprietor"}},{"type":"npc","id":"1006193","obj":{"i":1006193,"n":"Teteroon","l":34,"q":5}},{"type":"item","id":"27653","obj":{"i":27653,"n":"Iron Headgear","l":23,"c":40544,"t":34}},{"type":"item","id":"2725","obj":{"i":2725,"n":"Reinforced Iron Sallet","l":23,"c":40022,"t":34,"p":1108}},{"type":"item","id":"2719","obj":{"i":2719,"n":"Cotton Sugarloaf Hat","l":22,"c":41130,"t":34,"p":771}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69395","obj":{"i":69395,"n":"Druthers House Rules","g":1,"l":"South Shroud","s":123}},{"type":"quest","id":"69397","obj":{"i":69397,"n":"Microbrewing","g":1,"l":"Upper La Noscea","s":125}}]}