{"quest":{"name":"Nouveau Riche","location":"South Shroud","id":69398,"patch":5.3,"sort":128,"icon":100115,"eventIcon":71201,"issuer":1000590,"target":1000590,"genre":1,"journal":["Buscarron has more work for a willing adventurer.","Suspicion surrounds the recent good fortune of a man named Laurentius. Seek him out in the South Shroud and inquire as to the source of his newfound wealth.","Laurentius leaves you abruptly without providing any answers. Follow him and accost him again.","You have defeated the Garlean soldier summoned by Laurentius. Confront him and ascertain the nature of his relationship with the Empire.","Now clearly agitated, Laurentius takes his leave of you once more. Chase him down and find out what he is hiding.","You vanquish a squad of imperial troops, prompting Laurentius to admit defeat at long last. Shamed by your devotion to the cause, he repents his decision to sell information and supplies to the Garleans, and resolves to give himself up to the Order of the Twin Adder. Return to the Druthers and tell Buscarron all that has transpired.","After listening to the tale of Laurentius's betrayal and subsequent repentance, Buscarron expresses hope that the Order of the Twin Adder will take pity on the disgraced Wood Wailer. He then shares some exciting news: the missing sylph elder has been found."],"objectives":["Speak with Laurentius.","Speak with Laurentius again.","Speak with Laurentius yet again.","Speak with Laurentius...<span class=\"emphasis\">again</span>.","Report to Buscarron."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"BUSCARRON","text":"I'm glad you've come, friend. There's something I want to talk to you about. You know I said I thought we might have a traitor in our midst─someone as was aiding the Garleans? Well, I'm thinking I may have identified our suspect."},{"name":"BUSCARRON","text":"There's a regular of mine who used to dine on thin soup, and sip his pint on account of not being able to afford another. But of late, he's taken to ordering my best wines and the finest cuts of meat I can lay my hands on."},{"name":"BUSCARRON","text":"Were he a merchant, I'd prob'ly think nothing of it, but this lad's a Wood Wailer."},{"name":"BUSCARRON","text":"...And Wood Wailers don't earn that kind of coin. By chance, I was musing on where the money was coming from when you first told me about the Garleans in the forest, and I couldn't help putting two and two together."},{"name":"BUSCARRON","text":"Suffice it to say, if a Wailer's working for the Empire, none of us is safe."},{"name":"BUSCARRON","text":"The lad I'm talking about goes by the name of Laurentius. Last I heard, he was in the South Shroud. Find him, <span class=\"highlight\">Forename</span>, and if he <span class=\"emphasis\">is</span> up to no good, put an end to it─and him, if it comes to that."},{"name":"LAURENTIUS","text":"Can you not see I am on patrol? Be gone. If you have business with the Wailers, take it to the Barracks."},{"name":"LAURENTIUS","text":"Not long now... Hmph. To think patrol routes and rations would fetch such a price..."},{"name":"LAURENTIUS","text":"No more than I deserve, though. 'Tis little wonder the Empire has risen to such heights. If only the <span class=\"emphasis\">Wailers</span> paid men their worth..."},{"name":"LAURENTIUS","text":"Y-You! What did you─? How long have you─? Help. Help! Heeelp!"},{"name":"LAURENTIUS","text":"Please! Come quick, my friends! It is I, Laurentius! I am under attack!"},{"name":"LAURENTIUS","text":"You should have buggered off when you had the chance. Now <span class=\"emphasis\">die</span>, you interfering little swine!"},{"name":"LAURENTIUS","text":"How...? How did you...? You just... I-I know nothing! I was on patrol. He just appeared! I...I thought <span class=\"emphasis\">you</span> were working for the Garleans!"},{"name":"BUSCARRON","text":"Aye, Laurentius confessed to his crimes. I just had word from the Twin Adder. Seems he marched straight into the Nest and gave himself up."},{"name":"BUSCARRON","text":"The lad's had quite a life, you know... His mother was killed by a brigand when he was only small. As a young man, he joined the Wailers, hoping to spare his fellow Gridanians the misery he'd known growing up."},{"name":"BUSCARRON","text":"Trouble is, protecting Gridania's too big a job for one man, and he came to believe that he couldn't make a difference─that it was hopeless."},{"name":"BUSCARRON","text":"There are few things more dangerous than desperation, and a man lost in the dark is easily drawn to the glimmer of coin. I reckon he thought that if he couldn't change the lot of his fellow man, he might as well change his own. Thing is, he <span class=\"emphasis\">was</span> making a difference─just not on his own. Somehow, he'd failed to grasp one simple truth─that those things we cannot do alone, we must do together."},{"name":"BUSCARRON","text":"...Eh? He asked you to thank me, did he? Then there's good in him yet. I just hope them at the Adders' Nest are able to see it... What he's done ain't easy to forgive, but I'd like to think he'd be afforded a chance to make amends."},{"name":"BUSCARRON","text":"But let us leave fates to the Twelve. I have other news for you, <span class=\"highlight\">Forename</span>. The sylph elder has been found!"}],"reward":{"gil":238},"reqs":{"jobs":[{"lvl":23,"id":130}],"quests":[66274]},"next":[66050]},"partials":[{"type":"npc","id":"1000590","obj":{"i":1000590,"n":"Buscarron","l":56,"q":14,"t":"Alehouse Proprietor"}},{"type":"quest","id":"66274","obj":{"i":66274,"n":"Sylphish Concerns","g":1,"l":"South Shroud","s":127}},{"type":"quest","id":"66050","obj":{"i":66050,"n":"Into the Beast's Maw","g":1,"l":"South Shroud","s":129}}]}