{"quest":{"name":"Dance Dance Diplomacy","location":"East Shroud","id":69393,"patch":5.3,"sort":118,"eventIcon":71201,"issuer":1006674,"target":1006674,"genre":1,"journal":["Yda has a notion of how one might earn the sylphs' trust.","Yda believes that the best way to earn the sylphs' trust is to /dance for those who reside in Little Solace.","That was certainly exhausting. Return to Yda and tell her that you have danced as you have never danced before.","Your dancing has won many a smile, but have you truly succeeded in winning the hearts of the sylphs of Little Solace? This remains to be seen."],"objectives":["/dance for the sylphs of Little Solace.","Report to Yda."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"YDA","text":"Say, <span class=\"highlight\">Forename</span>. Are you in the mood for dancing?"},{"name":"YDA","text":"That's right: dancing! You went through all that trouble to learn the sylphs' traditional greeting, but you've greeted hardly any of them."},{"name":"YDA","text":"Why, if I were a sylph, I'd be beside myself with delight to see an adventurer expressing an interest in my culture! Me? Of course I'd be happy to join─ow, ow! There go those bloody leg cramps of mine acting up again!"},{"name":"AMEEXIA","text":"This one is weaving cloth. Walking one would know more? This one does not trust walking ones who do not show respect."},{"name":"AMEEXIA","text":"Walking one would be a friend to these ones? This one is overjoyed! But this one keeps the ways of weaving a secret. Even if walking one learned the secret, walking one could not weave in the same way."},{"name":"AMEEXIA","text":"Walking one is strange. This one has nothing to teach to strange ones."},{"name":"KNOLEXIA","text":"Walking one's belly is rumbling? This one is not making a meal! This one is boiling bark and flower seeds to dye thread. Color must be jolly, and so must greet-making."},{"name":"KNOLEXIA","text":"Oooh, walking one knows jolly dance! Jolly dance fills this one with good cheer! Let these two be friends!"},{"name":"KNOLEXIA","text":"Walking one makes strange motions. Strange motions make this one ill at ease. Go away! Shoo, shoo!"},{"name":"DELLEXIA","text":"What does walking one want with this one? Elder one warned this one not to get too friendly with walking ones..."},{"name":"DELLEXIA","text":"Ah, walking one is a friend to these ones! Friendly like gracious elder one of forest city. Knows how to dance into these ones' hearts!"},{"name":"DELLEXIA","text":"Is that how walking ones greet other walking ones? If walking one wants to find other walking ones, maybe walking one should go home."},{"name":"YDA","text":"<span class=\"highlight\">Forename</span>! Would you like to hear the good news, or the better news? The good news is that your lovely dancing has brought smiles and high spirits to all of Little Solace! The better news? Why, I've thoroughly recovered from those accursed leg cramps! Onward to our next adventure!"}],"reward":{"gil":1109},"reqs":{"jobs":[{"lvl":21,"id":130}],"quests":[66251]},"next":[66256,66258,69394]},"partials":[{"type":"npc","id":"1006674","obj":{"i":1006674,"n":"Yda","l":55,"q":2}},{"type":"quest","id":"66251","obj":{"i":66251,"n":"First Contact","g":1,"l":"East Shroud","s":117}},{"type":"quest","id":"66256","obj":{"i":66256,"n":"Sylph Says","g":92,"l":"East Shroud","s":210}},{"type":"quest","id":"66258","obj":{"i":66258,"n":"A Porcine Plight","g":92,"l":"East Shroud","s":210}},{"type":"quest","id":"69394","obj":{"i":69394,"n":"Forest Friend","g":1,"l":"East Shroud","s":119}}]}