{"quest":{"name":"We Come in Peace","location":"Gridania","id":69392,"patch":5.3,"sort":114,"icon":100111,"eventIcon":71201,"issuer":1000168,"target":1006188,"genre":1,"journal":["Commander Vorsaile Heuloix has been awaiting the aid of the Scions.","Vorsaile Heuloix would have you communicate directly with the sylphs and ascertain their true intentions regarding the primal Ramuh. To avoid any cross-cultural misunderstandings, you are to first travel to the Hawthorne Hut and receive a briefing on sylphic culture with the officer stationed there. Speak to Mitainie outside Westshore Pier in Old Gridania to see about transportation.","Mitainie has instructed you to take the ferry from Westshore Pier to reach the East Shroud. Once there, you will only need to head due east to find the Hawthorne Hut, where you will find Amelain of the Twin Adder.","Amelain has informed you that Rolfe Hawthorne is well versed in sylphic culture and should hold the answers you seek."],"objectives":["Speak with Mitainie at Westshore Pier.","Speak with Amelain at the Hawthorne Hut."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"VORSAILE","text":"Well! If it isn't [GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>, reporting for duty. That's the zeal I like to see from an enterprising young Serpent."},{"name":"VORSAILE","text":"Hail, adventurer. I bid you welcome to the Adders' Nest. Do you seek to entwine your destiny with the Twin Adder?"},{"name":"YDA","text":"<span class=\"alternative-container\"><span class=\"alternative\">Good evening</span><span class=\"alternative\">Morning</span><span class=\"alternative\">Good day</span></span>, Commander! Sorry to disappoint you, but other business brings us here today."},{"name":"VORSAILE","text":"Yda and Papalymo, always a pleasure to see the two of you. My men tell me you quest in the name of the Scions of late."},{"name":"PAPALYMO","text":"Quite so, Commander. A little bird told us that the Twin Adder was in need of our adventuring prowess."},{"name":"VORSAILE","text":"Aye, your little bird sings true. No doubt you've heard that we're investigating the sylphs─that curious beast tribe that calls the depths of the Twelveswood home."},{"name":"VORSAILE","text":"The sylphs are, for the most part, a peaceable bunch─much to the delight of the Elder Seedseer, who has no desire to see her people embroiled in yet another fruitless war."},{"name":"VORSAILE","text":"The Twin Adder is of the same mind, and 'tis precisely for this reason that the sylphs' relation to the primal Ramuh has raised a flag of warning amongst our ranks."},{"name":"VORSAILE","text":"Friendly as they may appear, beastmen will be beastmen."},{"name":"VORSAILE","text":"Should there be even a sliver of a chance that the summoning of the primal might disturb the balance between Gridania and the sylphic tribes, it is a possibility we cannot ignore."},{"name":"PAPALYMO","text":"Better to be safe than sorry, indeed."},{"name":"VORSAILE","text":"Do we strike at Ramuh, or leave the sylphs to their own ways? That is the question, yet I find myself lacking ample knowledge to arrive at an answer."},{"name":"VORSAILE","text":"Opinions abound within Gridania, but to listen only to one's own is among the greatest mistakes a commander can make."},{"name":"VORSAILE","text":"I would hear from the other side─the sylphs themselves─and seek an impartial party to serve as my liaison. That is where you Scions come in."},{"name":"VORSAILE","text":"The sylphs of Little Solace remain untempered, and have held many a productive dialogue with our people. I would hear their candid thoughts on their tempered brethren."},{"name":"VORSAILE","text":"That said, I urge you to exercise due caution. Sylphic tradition and etiquette bear little resemblance to our own. It would not do to have any cross-cultural <span class=\"emphasis\">faux pas</span> get in the way of a productive parley."},{"name":"VORSAILE","text":"En route to Little Solace, you will come upon the Hawthorne Hut. Our officer stationed there can enlighten you as to how to win the sylphs' favor. May your expedition be a worthwhile one."},{"name":"PAPALYMO","text":"A friendly palaver with the sylphs? This should be a pleasant enough diversion."},{"name":"PAPALYMO","text":"The Hawthorne Hut, was it? Why, I believe the ferry departing from Westshore Pier should take us straight there."},{"name":"YDA","text":"A friendly palaver, indeed! I hope this will be as straightforward as you say, Papalymo."},{"name":"MITAINIE","text":"Aye, the ferry docked at the base of this hill will carry you across the lake to the East Shroud."},{"name":"MITAINIE","text":"Once you're ashore, head due east and you should find the Hawthorne Hut without much trouble."},{"name":"AMELAIN","text":"Indeed, I am Amelain of the Twin Adder. I understand you're here to learn of the sylphs, yes?"},{"name":"AMELAIN","text":"For all their whimsy, they are a wary lot. Particularly since the Empire has come to the Shroud."},{"name":"AMELAIN","text":"Earn their trust, however, and they're as friendly as any folk. They have their quirks, but so do we all, no?"},{"name":"AMELAIN","text":"Would you know more, you'd do well to speak with the master of this hut, Rolfe. He's <span class=\"emphasis\">forgotten</span> more about the sylphs than I'll ever know."}],"reward":{"gil":1078},"reqs":{"jobs":[{"lvl":20,"id":130}],"quests":[66049]},"next":[66245]},"partials":[{"type":"npc","id":"1000168","obj":{"i":1000168,"n":"Vorsaile Heuloix","l":52,"q":23,"t":"Serpent Commander"}},{"type":"npc","id":"1006188","obj":{"i":1006188,"n":"Amelain","l":55,"q":3}},{"type":"quest","id":"66049","obj":{"i":66049,"n":"Sylph-management","g":1,"l":"The Waking Sands","s":113}},{"type":"quest","id":"66245","obj":{"i":66245,"n":"Sylphic Studies","g":1,"l":"East Shroud","s":115}}]}