{"quest":{"name":"Dressed for Conquest","location":"Mor Dhona","id":69407,"patch":5.3,"sort":237,"eventIcon":71201,"issuer":1006552,"target":1006552,"genre":1,"journal":["Sark Malark wishes to help you acquire the disguises you need for your rescue mission.","Expressing his desire to aid in your plight, Sark Malark bids you obtain three imperial uniforms and three imperial helms. The former are worn by 5th Cohort signiferi, secutores, and equites; the latter by 5th Cohort hoplomachi and laquearii.","You have succeeded in wresting imperial helms and uniforms from their owners, but the items did not survive your fury unscathed. Return to Revenant's Toll and present the damaged equipment to Sark Malark.","The helms and uniforms you retrieved are in dire need of repair before they can pass muster. Fortunately, the blacksmith Eginolf at the Diamond Forge should be able to assist you in the matter. Bring the equipment to him, that he might hammer them into better shape.","Both the uniforms and the helms are now in good repair─at least outwardly. Return to Revenant's Toll and present them for Sark Malark's inspection.","Sark Malark has given your imperial uniforms and helms his seal of approval. All that remains of your preparation is to obtain a suit of magitek armor."],"objectives":["Obtain uniforms from imperial soldiers.","Obtain helms from imperial soldiers.","Present the imperial equipment to Sark Malark.","Deliver the imperial equipment to Eginolf for repair.","Present the repaired equipment to Sark Malark."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"SARKMALARK","text":"You are called <span class=\"highlight\">Forename Surname</span>, yes? I have heard of your plight from my friend Glaumunt. As a fellow adventurer and son of Eorzea both, I would offer you my assistance."},{"name":"SARKMALARK","text":"In order to infiltrate Castrum Centri, you and your comrades must disguise yourselves as imperial soldiers. The question is how to go about acquiring the uniforms and helms."},{"name":"SARKMALARK","text":"There are places a man might purchase them, but individuals who deal in such wares are not the sort to whom you would entrust your secrets."},{"name":"SARKMALARK","text":"It would be more prudent, I believe, to procure what you need via <span class=\"emphasis\">traditional</span> means─from the bodies of their recently deceased owners."},{"name":"SARKMALARK","text":"The fortified area before Castrum Centri never lacks for imperial patrols. It ought not take long to obtain three sets of gear, one for each member of the infiltration team─Biggs, Wedge, and yourself."},{"name":"SARKMALARK","text":"When you have what you need, please return here and allow me to inspect the spoils."},{"name":"SARKMALARK","text":"Were you able to obtain three sets of imperial equipment?"},{"name":"SARKMALARK","text":"...Damaged, as I had suspected. In their present condition, I fear these uniforms and helms are like to draw suspicion."},{"name":"SARKMALARK","text":"They must be repaired, if only superficially."},{"name":"SARKMALARK","text":"Fortunately, the blacksmith Eginolf at the Diamond Forge in Rowena's House of Splendors should be able to hammer them into shape in no time."},{"name":"SARKMALARK","text":"I've already sent word ahead, and have been assured that he is expecting you. Worry not─we have already impressed upon him the need for utmost secrecy as to the nature of your mission."},{"name":"EGINOLF","text":"Hm? So yer the 'venturer Sark Malark sent, are ye? I've been waitin' for ye. Now let's see what ye got for me."},{"name":"EGINOLF","text":"...I see. Ah, yes─I reckon I can hammer these back into shape for ye."},{"name":"EGINOLF","text":"After all, I owe yer friend Sark Malark a favor or two. Took good care of ol' Eginolf back in the days before I fell in with old Rowena, he did."},{"name":"EGINOLF","text":"Did ye know he's the son of one o' the wealthiest families in the sultanate? Wouldn't expect someone like that to end up in the life he did, but I s'pose he always felt the 'venturer's life callin' him."},{"name":"EGINOLF","text":"...But here I go blabberin' on when there's work to be done. Just hold yer horsebirds for a moment or two and the great Eginolf will have yer gear lookin' good as new."},{"name":"EGINOLF","text":"...And there we have it. Won't do ye much good in battle, mind ye, but from what I hear, that's not yer priority anyhow."},{"name":"EGINOLF","text":"Do send Sark Malark my regards, will ye?"},{"name":"SARKMALARK","text":"Have you had the uniforms and helms repaired?"},{"name":"SARKMALARK","text":"Yes, these will serve beautifully. The great Eginolf never fails to impress. The quality of these repairs would fool even a legatus."},{"name":"SARKMALARK","text":"Thus equipped, you should not have any trouble blending in amongst imperial forces."},{"name":"SARKMALARK","text":"Lest you fear that the Garleans might detect your “foreignness,” foreigners in fact form the greater part of the Garlean invasion force in Eorzea."},{"name":"SARKMALARK","text":"You see, when the Empire subjugates new territory, it assimilates the people of that land into its armed forces. In turn, these conscripted forces are sent to subjugate faraway lands. In this way, Garlemald nips rebellion in the bud and expands its territory in one fell stroke."},{"name":"SARKMALARK","text":"With that, my part in your mission is done. I am full glad to have been of assistance to your cause."},{"name":"SARKMALARK","text":"...Hm? Why would I, a wealthy merchant, wish to help you? I know not where you heard such a tale, but believe me when I say that I am but another humble adventurer, one who desires only to act in the best interests of the realm."}],"reward":{"items":[{"id":6223},{"id":6224}]},"reqs":{"jobs":[{"lvl":45,"id":130}],"quests":[66538]},"next":[66540]},"partials":[{"type":"npc","id":"1006552","obj":{"i":1006552,"n":"Sark Malark","l":67,"q":3}},{"type":"item","id":"6223","obj":{"i":6223,"n":"Mended Imperial Pot Helm","l":1,"c":40128,"t":34,"p":100}},{"type":"item","id":"6224","obj":{"i":6224,"n":"Mended Imperial Short Robe","l":1,"c":42345,"t":35,"p":100}},{"type":"quest","id":"66538","obj":{"i":66538,"n":"Acting the Part","g":1,"l":"Mor Dhona","s":236}},{"type":"quest","id":"66540","obj":{"i":66540,"n":"Fool Me Twice","g":1,"l":"Mor Dhona","s":238}}]}