{"quest":{"name":"The Curious Case of Giggity","location":"Western La Noscea","id":69406,"patch":5.3,"sort":224,"eventIcon":71201,"issuer":1006497,"target":1006710,"genre":1,"journal":["Ceana knows where the corrupted crystal that you seek can be found.","An associate of Ceana's is conducting studies on a corrupted crystal which fits your criteria. Return to Gridania and meet with Hedyn to learn where your quarry can be found.","According to Hedyn, ascertaining the precise location of the crystal at any given moment is difficult, due to the fact that it has been devoured by a notorious spriggan named Giggity. Although this ravenous beast tends to conceal its whereabouts, Hedyn has the perfect lure to draw him into the open: the unusually named true heart. Make your way into the lair of the spriggans and use the true heart to lure out and slay Giggity.","In a primal frenzy, you rip and tear open the spriggan's huge guts and claim the corrupted crystal nestled deep within. Present your prize to Hedyn so that he can confirm it is the crystal you seek.","Hedyn confirms that the foul-smelling, offal-laden crystal is comprised of ice-aspected aether. To your chagrin, you learn that you cannot cleanse the crystal of the spriggan entrails, as the thick coating of digestive juices is the only thing protecting you from the crystal's detrimental effects. Hopefully Cid will have developed a less irksome way to do the same..."],"objectives":["Speak with Hedyn in Gridania.","Use the true heart to lure out the crystal bearer.","Deliver the corrupted crystal to Hedyn."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"CEANA","text":"Don't fret, now─I know exactly where to find a corrupted crystal comprised of <span class=\"emphasis\">ice</span>-aspected aether. An associate of mine in Gridania has been studying the effects of one such crystal on living beings."},{"name":"CEANA","text":"Eh? What's with that expression? I thought you would be pleased to hear this news! This is <span class=\"emphasis\">not</span> another wild-dodo chase, I assure you!"},{"name":"CEANA","text":"And what's even better is that <span class=\"emphasis\">this</span> time, you needn't use that warded pot of yours to protect yourself from this crystal's energies. Hedyn's findings suggest that it is quite safe."},{"name":"CEANA","text":"Why, you ask? Well...let's just say that it has undergone a <span class=\"emphasis\">unique</span> process that has rendered such precautions unnecessary."},{"name":"CEANA","text":"Anyway, do not let me keep you. It has been a pleasure, <span class=\"highlight\">Forename</span>. Come back and see me sometime, all right?"},{"name":"HEDYN","text":"Greetings and salutations. <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> <span class=\"highlight\">Surname</span>, I presume? Ceana informed me of your adventures in Aleport. Terribly sorry about the misunderstanding. Though, as Professor Lamberteint is fond of saying, “No action taken in the name of science is ever truly wasteful.”"},{"name":"HEDYN","text":"To the matter at hand─corrupted crystals possessing the properties you seek could be found in abundance at the Standing Corses following the Calamity."},{"name":"HEDYN","text":"Alas, that is no longer the case...and while there is at least one suitable crystal that remains to be found within the Twelveswood, precisely where it is at any given moment is more difficult to say."},{"name":"HEDYN","text":"Permit me to explain. You are familiar with spriggans, yes? The furry little rascals that are wont to seek out ores and other stones? Well, one such creature with an infamously insatiable appetite has single-handedly devoured every corrupted crystal in the Twelveswood. Fortunately for you, these crystals take an eternity to digest─assuming they can even <span class=\"emphasis\">be</span> digested─and I am reasonably confident that one still resides within his gut."},{"name":"HEDYN","text":"It's quite fascinating, really. My theory is that this “Giggity” first consumed a corrupted crystal when... &lt;sigh&gt; You couldn't care less about all this, could you?"},{"name":"HEDYN","text":"To the point, then. Giggity seldom makes his presence felt unless there is particularly fine fodder to be had. Therefore, we shall require a lure, and I have precisely the sort he will find impossible to resist."},{"name":"HEDYN","text":"Simply place this true heart─I shall save the story of the origin of its unusual name for another occasion─outside of the spriggans' lair and wait for the opportune moment to pounce."},{"name":"HEDYN","text":"As for the method by which you retrieve the crystal from his gut...I shall leave that to your discretion."},{"name":"HEDYN","text":"Ah! Pray do not sneak up on me like that. I was engrossed in─wait, what is that─&lt;sniff&gt; &lt;sniff&gt;─what is that gods-awful smell?"},{"name":"HEDYN","text":"My word, that is a breathtakingly beautiful crystal. I see my supposition was not mistaken."},{"name":"HEDYN","text":"Ugh... And I also see you weren't averse to digging through spriggan entrails for your prize."},{"name":"HEDYN","text":"We owe our furry friend a debt of gratitude, you know. This thick coating of digestive juices is protecting us from the harmful effects of the crystal, just as the warded pot you once used did."},{"name":"HEDYN","text":"Why so glum, friend? You've finally obtained the corrupted crystal you sought─one overflowing with <span class=\"emphasis\">earth</span>-aspected aether!"},{"name":"HEDYN","text":"Calm down─I jest, I jest! It is comprised of <span class=\"emphasis\">ice</span>-aspected aether, worry not. I suppose that joke was in poor taste, considering your previous two attempts were for naught..."}],"reward":{"gil":1674},"reqs":{"jobs":[{"lvl":43,"id":130}],"quests":[66503]},"next":[66511]},"partials":[{"type":"npc","id":"1006497","obj":{"i":1006497,"n":"Ceana","l":33,"q":6}},{"type":"npc","id":"1006710","obj":{"i":1006710,"n":"Hedyn","l":53,"q":5}},{"type":"quest","id":"66503","obj":{"i":66503,"n":"History Repeating","g":1,"l":"Western La Noscea","s":221}},{"type":"quest","id":"66511","obj":{"i":66511,"n":"Better Late than Never","g":1,"l":"Gridania","s":225}}]}