{"quest":{"name":"You Can't Take It with You","location":"Eastern Thanalan","id":69403,"patch":5.3,"sort":184,"icon":100134,"eventIcon":71201,"issuer":1006672,"target":1003958,"genre":1,"journal":["Marques has a personal request to make of you.","When tending to the bodies of the recently deceased, Marques came across a broken horologe. The contraption is strangely familiar to the refugee, and he hopes that, by tinkering with it, he will recall its significance. Marques requests that you assist him by acquiring the necessary tools: a bull-point chisel, and a pair of needle-nose pincers, both of which should be available in Camp Drybone.","Your inquiries in Camp Drybone lead you to the tools you seek. Deliver the tools to Marques at the Church of Saint Adama Landama.","Upon receiving the tools, Marques immediately sets to work and repairs the horologe, as if by instinct─an act that only serves to unnerve the troubled refugee. Apologizing for the inconvenience, he bids you take the device to Sister Eluned, who is currently tending to the body of its owner outside the church.","Sister Eluned has never before seen an intricate device like the horologe, which is reminiscent of the technological marvels Garlemald is said to possess. The brief association causes her to suspect that the deceased owner may have been a Garlean spy, and she considers informing the Immortal Flames stationed in Camp Drybone. However, Marques's ability to repair the horologe appears to be an even more stunning revelation, one which also bears further investigation."],"objectives":["Hand the weighty coinpurse to the traveling goldsmith.","Deliver the tools to Marques.","Give the horologe to Eluned."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"MARQUEZ","text":"Excuse me, <span class=\"highlight\">Forename</span>...do you have a moment? It concerns this broken horologe which was found in the pocket of a man brought here for burial."},{"name":"MARQUEZ","text":"There is something...familiar about it...but just what I cannot say. Perhaps if I tinker with the device, it will come to me."},{"name":"MARQUEZ","text":"However, I lack the proper tools to do so. I would ask that you journey to Camp Drybone in my stead to obtain a bull-point chisel and a pair of needle-nose pincers."},{"name":"MARQUEZ","text":"They are often used by goldsmiths, so perhaps they would be the best people to ask."},{"name":"MARQUEZ","text":"Of course, I do not expect you to foot the bill. Here, take this coinpurse. That should cover it."},{"name":"GOLGSMITHXXXXX","text":"A bull-point chisel, you say? And a pair of needle-nose pincers? Those things don't come cheap, you know..."},{"name":"GOLGSMITHXXXXX","text":"Thal's balls! I mean, yes, that should be sufficient payment. Nice doing business with you. Heh heh..."},{"name":"GOLGSMITHXXXXX","text":"Erk! You again? Before you ask, no, I don't do refunds. Not that there's anything wrong with the fine tools I sold you!"},{"name":"MARQUEZ","text":"Have you brought the tools I requested?"},{"name":"MARQUEZ","text":"Hmmm...something occurs to me. Please wait here for a moment."},{"name":"MARQUEZ","text":"It was for naught. Though I repaired the device easily, this sensation that stirs within me remains a mystery."},{"name":"MARQUEZ","text":"But how...how did I do it?"},{"name":"MARQUEZ","text":"These hands...my hands, they moved with a mind of their own, deftly manipulating the clockwork mechanisms..."},{"name":"MARQUEZ","text":"There was no doubt or uncertainty. I knew exactly what to do, as though I had performed the same motions countless times before..."},{"name":"MARQUEZ","text":"P-Pardon me, <span class=\"highlight\">Forename</span>─this was a mistake. Please give the horologe to Sister Eluned. The man who once owned it is currently in her care, and I think it best that it be returned to him."},{"name":"ELUNED","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Have you come to pay your respects to this man?"},{"name":"ELUNED","text":"Never before have I seen such a queer device. You say that it measures the passing of time?"},{"name":"ELUNED","text":"Mayhap they are more common in Garlemald. I am given to understand that its cities are filled with all manner of amazing technologies."},{"name":"ELUNED","text":"Marques said that it belonged to the deceased? Oh dear... You don't suppose that the owner might have been a Garlean spy? It may behoove us to notify the authorities in Camp Drybone."},{"name":"ELUNED","text":"But...mayhap more importantly, how did Marques manage to repair this device? I knew he had a talent for the trades, but this goes far beyond mending fences and thatching rooves..."}],"reward":{"items":[{"id":31333}]},"reqs":{"jobs":[{"lvl":35,"id":130}],"quests":[66053]},"next":[66412]},"partials":[{"type":"npc","id":"1006672","obj":{"i":1006672,"n":"Marques","l":44,"q":4}},{"type":"npc","id":"1003958","obj":{"i":1003958,"n":"Eluned","l":44,"q":5}},{"type":"item","id":"31333","obj":{"i":31333,"n":"Level 34 Weapon Coffer","l":1,"c":26557,"t":61}},{"type":"quest","id":"66053","obj":{"i":66053,"n":"All Good Things","g":1,"l":"Upper La Noscea","s":182}},{"type":"quest","id":"66412","obj":{"i":66412,"n":"Bringing out the Dead","g":1,"l":"Eastern Thanalan","s":186}}]}