{"quest":{"name":"Moving On","location":"The Waking Sands","id":69410,"patch":5.3,"sort":3,"eventIcon":71201,"issuer":1006693,"target":1007752,"genre":2,"journal":["Once again, Minfilia appears to be lost in thought.","Desiring to be left alone with her thoughts, Minfilia bids you assist Alphinaud with an unspecified task. Respect the Antecedent's wishes and join Alphinaud outside the solar.","According to Alphinaud, the Antecedent's blind refusal to contemplate leaving Ul'dah stems from the empty hope that her late mother F'lhaminn still lives. For whatever reason, rumors have recently begun to circulate that the famed songstress did not perish in the fires of the Calamity. Convinced that Minfilia will not see sense until these rumors have been proven false, Alphinaud has resolved to determine their origin, and asks that you assist him. Speak with Gegeruju in Costa del Sol to inquire about one such rumor.","A heartbroken Gegeruju is further dismayed to learn that the object of his affections, who only recently left, was none other than the famed Songstress of Ul'dah. Though he recalls her expressing a desire to go west, he assures you that F'lhaminn will soon tire of her rough style of living and return to his waiting arms. Providing you do not share his optimism, journey to Wineport and question the local residents.","Your cursory investigation yields a promising lead, provided by the incorrigible Wine Baron of Limsa Lominsa. Apparently, a woman matching F'lhaminn's description visited Byrglaent's winery very recently, but, finding her perfume to be intolerable, he expelled her from the premises. Though he has no inkling as to where she went next, the Wine Baron suggests that you solicit the aid of Shamani Lohmani, reasoning that his unique talents may enable him to track the perfumed lady.","Shamani Lohmani vividly recalls the woman's scent, as well as the conversation he had with her. After observing that her perfume was reminiscent of a local species of flower, she asked him where she might find the most pristine specimens, and he duly told her. Assuming she followed his directions, she would then have proceeded south into Raincatcher Gully. With luck, she may still be there.","You succeed in locating your quarry mere moments before a ravenous goobbue emerges from the forest, seemingly intent on devouring you both. Undeterred, you set about the beast, and it soon succumbs to your onslaught. All that remains is to verify the identity of the perfumed lady.","Your attempts to ascertain the perfumed lady's identity succeed only in arousing her suspicion, but when Alphinaud subsequently enters the scene, she has no choice but to admit that she is indeed F'lhaminn. With much to discuss, the three of you agree to adjourn to Wineport, where you may continue your conversation in safety.","Thanks to your efforts, the stage is now set for a long-overdue reunion between Minfilia and F'lhaminn. Proud to do your part, you look forward to what is sure to be an emotional meeting between the two."],"objectives":["Speak with Alphinaud.","Speak with Gegeruju in Costa del Sol.","Gather information in Wineport.","Speak with Shamani Lohmani.","Search for F'lhaminn.","Speak with F'lhaminn.","Speak with Alphinaud in Wineport."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"MINFILIA","text":"Leave Ul'dah... Has it truly come to this?"},{"name":"MINFILIA","text":"...Hm? Oh. <span class=\"highlight\">Forename</span>. Pray attend to Alphinaud."},{"name":"MINFILIA","text":"He is engaged in some business or other and requires your assistance."},{"name":"MINFILIA","text":"Pray be on your way. Alphinaud waits upon you, and I have much to think about."},{"name":"MINFILIA","text":"Oh, and...tell him he shall have my answer in due time."},{"name":"ALPHINAUD","text":"Confound it. She knows what must be done, and still she hesitates."},{"name":"ALPHINAUD","text":"All because of these fanciful rumors."},{"name":"ALPHINAUD","text":"Hm. I should explain. Minfilia's mother─well, adoptive mother─was among the great many who perished during the Calamity."},{"name":"ALPHINAUD","text":"F'lhaminn was her name, though you may know her better as the “Songstress of Ul'dah.” She was a performer of singular talent, and much beloved by the people of Eorzea─not to mention a certain Sharlayan minstrel."},{"name":"ALPHINAUD","text":"As you may imagine, the news of her passing was greeted with shock and disbelief by her adoring followers, many of whom refused to acknowledge what had happened. That her body was never found only served to encourage speculation."},{"name":"ALPHINAUD","text":"Minfilia, too, struggled at first to accept the truth, but as F'lhaminn's absence stretched from months into years, she saw that there could be no other explanation."},{"name":"ALPHINAUD","text":"Until recently, at any rate. For whatever reason, rumors have once again begun to circulate that F'lhaminn is alive and well."},{"name":"ALPHINAUD","text":"One of our informants, Father Iliud, has sent word that a woman matching the songstress's description has been seen of late at the seaside resort of Costa del Sol."},{"name":"ALPHINAUD","text":"If we could succeed in tracking her down, I have no doubt that any worries that now plague Minfilia's heart might be assuaged."},{"name":"ALPHINAUD","text":"I mean to set forth for La Noscea at once. Let us reconvene there and inquire with Master Gegeruju as to the veracity of these rumors."},{"name":"ALPHINAUD","text":"Ah, you've arrived. Let us see if Master Gegeruju can shine any light onto the rumors regarding F'lhaminn."},{"name":"GEGERUJU","text":"&lt;sigh&gt; O sweet siren of the sands, my Miqo'te muse! Why have you forsaken me...?"},{"name":"GEGERUJU","text":"T-Titan's Bane! I mean, <span class=\"highlight\">Forename</span>! What brings you to my humble resort?"},{"name":"GEGERUJU","text":"<span class=\"emphasis\">F'lhaminn</span>!? You mean to tell me the goddess made flesh who dwelt among us until so very recently was <span class=\"emphasis\">the</span> Songstress of Ul'dah!? Egads, <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>─if I had known that, I would've chained her to my bedpost and never let her leave!"},{"name":"GEGERUJU","text":"Oh, for shame! To think that she now plies her trade for the riffraff off to the west or wherever she said she was going! It's a tragedy, I say! A tragedy!"},{"name":"ALPHINAUD","text":"West, is it? Thank you, Master Gegeruju. Your information will serve us well."},{"name":"ALPHINAUD","text":"That said, there are any number of places she could be. I shall begin my search by the docks and see if any witnesses might have some knowledge to spare. I would be most appreciative if you could travel on to Wineport and do the same."},{"name":"JUNGHBHAR","text":"...Eh? You want to know if I've seen a Miqo'te lass by the name of F'lhaminn? I wish! I haven't seen a lass of <span class=\"emphasis\">any</span> description for far too bloody long... Er, excepting yourself, of course."},{"name":"BYRGLAENT","text":"Well, if it isn't <span class=\"highlight\">Forename</span>, the savior of Wineport! To what do we owe the pleasure?"},{"name":"BYRGLAENT","text":"Ah, yes, we did receive a customer matching that description. She was a delight to behold, to give the woman her due, but her perfume was so ghastly, I had no choice but to eject her from the premises. Interfering with tastings, you understand."},{"name":"BYRGLAENT","text":"If she is your quarry, why not consult your blind associate? His olfactory perception is without peer. Given that <span class=\"emphasis\">I</span> could smell the woman from a malm away, I daresay he could smell her from <span class=\"emphasis\">ten</span>."},{"name":"SHAMANILOHMANI","text":"&lt;sniff&gt; &lt;sniff&gt; I see you have had many grand adventures since last we spoke, <span class=\"highlight\">Forename</span>. You must share them with me sometime."},{"name":"SHAMANILOHMANI","text":"The girl from a little while ago? One does not forget a perfume like that. So robust and intoxicating...yet simultaneously familiar. Reminiscent of a bloom native to these parts, in fact."},{"name":"SHAMANILOHMANI","text":"I said as much when we spoke. She complimented my powers of observation and asked me where she might find some of the flowers."},{"name":"SHAMANILOHMANI","text":"So I told her to follow the road south into Raincatcher Gully and then head east after crossing the second bridge. The flowers which grow in the shade of the cliff have the strongest scent, you see. If you make haste, you may yet find her there."},{"name":"SHAMANILOHMANI","text":"So I told her to follow the road south into Raincatcher Gully and then head east after crossing the second bridge. The flowers which grow in the shade of the cliff have the strongest scent, you see. If you make haste, you may yet find her there."},{"name":"FLHAMINN","text":"I am in your debt, stranger. I did not realize my activities had aroused the goobbue's ire until it was too late."},{"name":"FLHAMINN","text":"Their oils can be used to make a perfume, you see, and I─"},{"name":"FLHAMINN","text":"<span class=\"emphasis\">F'lhaminn</span>? I'm... I don't..."},{"name":"FLHAMINN","text":"Who are you? Whom do you serve?"},{"name":"ALPHINAUD","text":"It appears you've already found our woman. Consider me impressed, my friend."},{"name":"ALPHINAUD","text":"The Songstress of Ul'dah, I presume? Minfilia─or should I say, Ascilia─is looking for you."},{"name":"FLHAMINN","text":"Ascilia!?"},{"name":"ALPHINAUD","text":"You are the very picture of health, milady─yet the world thinks you dead."},{"name":"ALPHINAUD","text":"I can only conclude that this was by design. The question is: why?"},{"name":"FLHAMINN","text":"Not everyone who endeavors to find me does so with the best intentions, child."},{"name":"FLHAMINN","text":"You will be pleased to know that I fully intend to reveal myself to Minfilia─when the time is right."},{"name":"ALPHINAUD","text":"Oh! Well...that does please me. More than you know. But tell me: sojourns in the forests of La Noscea aside, when exactly <span class=\"emphasis\">will</span> the time be right?"},{"name":"FLHAMINN","text":"When I deem it so. Do you imagine I traveled all this way on a whim? As I was telling your associate prior to your intrusion, I came here to harvest these flowers for use in a perfume. Does that satisfy your curiosity, or would you interrogate me further?"},{"name":"ALPHINAUD","text":"M-My apologies for the interruption. Anyway─now that we all have that which we came for, might we continue this conversation in a safer locale? Wineport, say?"},{"name":"FLHAMINN","text":"Rescued yet again from the jaws of a ravenous goobbue. How quickly we forget the lessons of the past."},{"name":"FLHAMINN","text":"&lt;sigh&gt; Though I was not solely to blame for that foolishness..."},{"name":"ALPHINAUD","text":"This...this is not <span class=\"emphasis\">at all</span> how I had envisioned it."},{"name":"ALPHINAUD","text":"I can scarce begin to imagine what emotions will go through Minfilia's heart when she reunites with her mother after all these years."}],"reward":{"gil":2642,"items":[{"num":2,"id":6151},{"id":4521,"one":1},{"id":4522,"one":1},{"id":4525,"one":1},{"num":3,"id":5824,"one":1}]},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66711]},"next":[69411]},"partials":[{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"npc","id":"1007752","obj":{"i":1007752,"n":"Alphinaud","l":32,"q":3}},{"type":"item","id":"6151","obj":{"i":6151,"n":"Cooking Sherry","l":70,"c":25057,"t":45}},{"type":"item","id":"4521","obj":{"i":4521,"n":"Darklight Band of Aiming","l":70,"c":54502,"t":43}},{"type":"item","id":"4522","obj":{"i":4522,"n":"Darklight Band of Healing","l":70,"c":54506,"t":43}},{"type":"item","id":"4525","obj":{"i":4525,"n":"Darklight Band of Casting","l":70,"c":54500,"t":43}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"66711","obj":{"i":66711,"n":"The Price of Principles","g":2,"l":"The Waking Sands","s":1}},{"type":"quest","id":"69411","obj":{"i":69411,"n":"All Things in Time","g":2,"l":"Eastern La Noscea","s":4}}]}