{"quest":{"name":"Still Waters","location":"The Rising Stones","id":69415,"patch":5.3,"sort":20,"icon":100219,"eventIcon":71201,"issuer":1007724,"target":1008597,"genre":2,"journal":["Minfilia has a new assignment for you.","During a recent audit, it was discovered that the crystal stores of Amajina & Sons Mineral Concern have been covertly pillaged. Fearing that the culprits may have ties to the Amalj'aa, the Scions have agreed to assist in the investigation. Proceed to Horizon in western Thanalan and report to Y'shtola.","You find Y'shtola preoccupied and unwilling to converse at length. Speak to Fufulupa, the Brass Blade leading the investigation, to learn more about the thefts.","Fufulupa relays to you news about a carriage that broke through one of their checkpoints and bolted off down to eastern Thanalan, where they were taken into custody by the Brass Blades. He is all but convinced that the thieves have been apprehended and the crystals recovered, until your conversation is interrupted by Thancred, who reveals that the fugitives were no more than common somnus smugglers. Regroup with your friends at Horizon to review the current state of affairs and assess your options.","According to Thancred, there is nothing to suggest that the Amalj'aa have come into possession of significant quantities of crystals. As he communicates his findings to Urianger via linkpearl, you cannot help but wonder who is behind the crystal thefts, and what their designs might be."],"objectives":["Speak with Y'shtola in Horizon.","Speak with Fufulupa.","Speak with Thancred."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"MINFILIA","text":"Truly, there is no rest for the weary. Scarce had I begun to make myself at home when I received a request for assistance from Amajina & Sons Mineral Concern."},{"name":"MINFILIA","text":"It would appear their storehouse in Horizon has been the target of a series of covert robberies."},{"name":"MINFILIA","text":"Minor as they seemed in isolation, occasional discrepancies in the manifests were long dismissed as clerical errors. It was only during the Concern's annual audit that a pattern became apparent..."},{"name":"MINFILIA","text":"Significant quantities of crystals─and only crystals─were missing."},{"name":"MINFILIA","text":"I need hardly tell you what that may imply."},{"name":"MINFILIA","text":"The Brass Blades charged with investigating the thefts believe that someone within the Concern is selling the crystals for profit. Alas, they have as yet been unable to identify a likely suspect, and the Concern's proprietors have grown frustrated by their lack of progress."},{"name":"MINFILIA","text":"Needless to say, I would not have agreed to intervene had the stolen goods been of merely monetary value. If there is even a possibility that the thief acts not out of self-interest but in service to a primal, we can ill afford to wait for the Blades to realize their mistake."},{"name":"MINFILIA","text":"Pray depart for Horizon at your earliest convenience."},{"name":"MINFILIA","text":"Rendezvous with Y'shtola when you arrive. She and Thancred have already begun a preliminary investigation."},{"name":"MINFILIA","text":"I have every confidence that the three of you will get to the bottom of these thefts. I only hope our fears prove unfounded when you do."},{"name":"MINFILIA","text":"When you arrive in Horizon, be sure to speak with Y'shtola. She will inform you as to the latest developments. For my part, I shall continue to speak with the Concern's representatives. They may have additional information which could be of use."},{"name":"YSHTOLA","text":"Ah, <span class=\"highlight\">Forename</span>. Your assistance is most welcome."},{"name":"YSHTOLA","text":"I have already spoken at length with the Brass Blades of the Rose─albeit to little avail. It would seem that the thieves took great pains to conceal their activities."},{"name":"YSHTOLA","text":"I could go into further detail, but your time might better be spent in conversation with Fufulupa. He is the officer charged with leading the investigation, and I would only be repeating that which he related to me. If aught eluded my attention, mayhap it will not elude yours."},{"name":"FUFULUPA","text":"<span class=\"alternative-container\"><span class=\"alternative\">Oh, hello there! <span class=\"highlight\">Forename</span>, was it?</span><span class=\"alternative\"><span class=\"highlight\">Forename</span>! What a pleasure to see you again.</span></span> Y'shtola said to expect you."},{"name":"FUFULUPA","text":"Terrible business, these thefts. We have yet to confirm the quantity of crystals stolen, but I daresay it may be greater than─"},{"name":"FUFULUPA","text":"Ah, but never mind that! I have news to share! A short while ago, the driver of a heavily laden carriage refused to halt for inspection and broke through one of our checkpoints on the Royal Allagan Sunway."},{"name":"FUFULUPA","text":"The cart bolted off toward eastern Thanalan, where─thank the gods─I hear that our colleagues were able to apprehend them without further incident."},{"name":"YSHTOLA","text":"...A speeding carriage? That would seem a curious choice for thieves of such proven cunning. Yet the Amalj'aa do have a foothold in eastern Thanalan. Hmmm."},{"name":"YSHTOLA","text":"And what of their cargo? Did they carry the crystals we seek?"},{"name":"FUFULUPA","text":"We should be receiving a report any moment now, but I fail to see what else it could─"},{"name":"THANCRED","text":"Did you miss me, friends? I'm back, but I fear I come bearing disappointing news. Or, on second thought, perhaps it's good news, after all..."},{"name":"YSHTOLA","text":"...Thancred. Wherever have you been off to?"},{"name":"THANCRED","text":"I figured you had everything under control here, so I just took a brief excursion to the east to check up on our Amalj'aa friends."},{"name":"THANCRED","text":"And wouldn't you believe it? I happened upon a runaway carriage on the way, and even was able to do my small part to help my friends in the Brass Blades intercept it."},{"name":"THANCRED","text":"In all my years, I have never seen such a prodigious quantity of somnus. The Blades were calling it one of the greatest hauls they've ever seen. The stolen crystals, on the other hand, were nowhere to be found."},{"name":"FUFULUPA","text":"Is that so? Alas...I suppose we have no choice but to resume our search elsewhere."},{"name":"THANCRED","text":"We should reassess our options as well. Come with us, <span class=\"highlight\">Forename</span>."},{"name":"YSHTOLA","text":"...And so we find ourselves back where we began. &lt;sigh&gt; What have I overlooked...?"},{"name":"THANCRED","text":"Against all expectation, it would seem the Amalj'aa are innocent of this particular spate of crimes. By all indications, they have yet to replenish the stores of crystals exhausted during their last attempt to summon Ifrit."},{"name":"THANCRED","text":"What I can't fathom is why anyone <span class=\"emphasis\">else</span> would go to such lengths to obtain crystals─and in such quantities."},{"name":"THANCRED","text":"It cannot be that we are dealing with simple thieves. If their motive were profit, why would they limit their trade to crystals alone...? Plainly, we are missing something."},{"name":"THANCRED","text":"While you think about what it might be, I shall inform Urianger of our progress─or lack thereof."}],"reward":{"gil":1220,"items":[{"id":6237,"one":1},{"id":6238,"one":1},{"id":6239,"one":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[69414]},"next":[66882]},"partials":[{"type":"npc","id":"1007724","obj":{"i":1007724,"n":"Minfilia","l":481,"q":3}},{"type":"npc","id":"1008597","obj":{"i":1008597,"n":"Thancred","l":42,"q":4}},{"type":"item","id":"6237","obj":{"i":6237,"n":"Hero's Earrings of Fending","l":90,"c":55297,"t":41}},{"type":"item","id":"6238","obj":{"i":6238,"n":"Hero's Earrings of Slaying","l":90,"c":55297,"t":41}},{"type":"item","id":"6239","obj":{"i":6239,"n":"Hero's Earrings of Aiming","l":90,"c":55297,"t":41}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69414","obj":{"i":69414,"n":"Build on the Stone","g":2,"l":"The Waking Sands","s":19}},{"type":"quest","id":"66882","obj":{"i":66882,"n":"A Final Temptation","g":2,"l":"Western Thanalan","s":21}}]}