{"quest":{"name":"Laying the Foundation","location":"The Waking Sands","id":69412,"patch":5.3,"sort":6,"eventIcon":71201,"issuer":1006693,"target":1006530,"genre":2,"journal":["Minfilia would share with you the latest news on the Scions' imminent relocation.","Alphinaud's efforts having proved successful, the Scions have secured a new location for their headquarters: Revenant's Toll in Mor Dhona. Minfilia would begin preparations for the move immediately, as there is much that still must be done. Pay visit to her and see if there is aught you might do to be of service.","Minfilia has entrusted you with a number of documents pertaining to the forthcoming move to Mor Dhona. You are to deliver them to Slafborn at Revenant's Toll, in accordance with the agreement between the Scions and the Adventurers' Guild.","Slafborn is pleased that you were the Scion chosen to represent the order in Revenant's Toll, and waggishly declares that he intends to impose the work of a dozen men upon you, though he subsequently claims to be jesting. At any rate, it would appear the Scions' long-awaited relocation effort can finally begin in earnest."],"objectives":["Speak with Minfilia.","Deliver the documents to Slafborn in Revenant's Toll."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"MINFILIA","text":"It is all well and good that we have found ourselves a new home in Revenant's Toll. But there is so much to be done─and in so little time."},{"name":"MINFILIA","text":"Our first step will be to secure the cooperation of the Adventurers' Guild representatives there."},{"name":"MINFILIA","text":"Were it not for the guild's considerable efforts, the original Camp Revenant's Toll would have never been established, much less its more heavily fortified successor."},{"name":"MINFILIA","text":"However, with construction still ongoing, and resources in short supply, it seems certain that the guild will require something in return for their support, sympathetic to our cause though they may be."},{"name":"MINFILIA","text":"Whatever they ask, I shall not begrudge it. To be plain, we need them more than they need us. Without their assistance, such essential tasks as securing new facilities, cultivating relationships with local merchants, and recruiting adventurers would prove difficult, if not impossible."},{"name":"ALPHINAUD","text":"You need not concern yourself with such matters, Antecedent."},{"name":"MINFILIA","text":"Really, Alphinaud─if I need concern myself with <span class=\"emphasis\">anything</span>, it is surely matters such as these."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">Indirectly</span>, perhaps. I submit that you might instead concern yourself with a different matter: namely, to whom the resolution of such matters might best be entrusted. And here I am! Nor do I come alone. May I present the esteemed emissary of the Adventurers' Guild at Revenant's Toll."},{"name":"ADVEMISSARY","text":"It is an honor, Antecedent. Upon receiving word of your intentions from Master Alphinaud, we thought it best to begin talks at the earliest available opportunity."},{"name":"ADVEMISSARY","text":"Know that my associates at Revenant's Toll hold the Scions of the Seventh Dawn in the highest regard. We should be honored to welcome your organization."},{"name":"ALPHINAUD","text":"There are, of course, certain provisions which must needs be negotiated. If it please you, I would do so."},{"name":"MINFILIA","text":"It does."},{"name":"ADVEMISSARY","text":"<span class=\"alternative-container\"><span class=\"alternative\">Madam</span><span class=\"alternative\">Sir</span></span>, unless I am much mistaken, you are the one known as <span class=\"highlight\">Forename</span>, are you not? May I say what a pleasure it is to make your acquaintance."},{"name":"ADVEMISSARY","text":"Slafborn spoke of you in the most glowing terms. To steal an imperial reaper and then use it to infiltrate a Garlean castrum is an undertaking few would contemplate─and fewer still survive."},{"name":"ADVEMISSARY","text":"You shall always be welcome at Revenant's Toll. We hope you will favor us with your presence again ere long."},{"name":"MINFILIA","text":"Well, well! It would seem your reputation precedes you, <span class=\"highlight\">Forename</span>! Mayhap I <span class=\"emphasis\">should</span> dispatch you to Revenant's Toll with all haste, as first intended..."},{"name":"MINFILIA","text":"But before that, I daresay you have earned yourself a rest. After all, you have traveled so far, and there is already so much you have done for us...and for me."},{"name":"MINFILIA","text":"We will speak again anon. Till then, take care."},{"name":"MINFILIA","text":"Do you ever wonder how he does it? Alphinaud, I mean. It was almost predictable that he should appear with an emissary of the Adventurers' Guild mere moments after I had expressed the need to forge ties between our organizations. Truly, his sense of timing rivals even your own..."},{"name":"MINFILIA","text":"Setting such mysteries aside for the present─I have a task for you."},{"name":"MINFILIA","text":"I would like you to deliver these documents to Slafborn. They concern our forthcoming move. Do take care on the road, and represent us well, <span class=\"highlight\">Forename</span>."},{"name":"SLAFBORN","text":"I was told to expect a Scion, but I didn't expect it to be you. It has been far too long, <span class=\"highlight\">Forename</span>. You have something for me, yes?"},{"name":"SLAFBORN","text":"Let's see, now... Yes, everything appears to be in order."},{"name":"SLAFBORN","text":"You'll be staying with us for a while, yes? Would that we had a dozen more like you. Since we don't, though, we'll just give you the work of a dozen men. Heh! I jest, I jest..."}],"reward":{"gil":2642,"items":[{"id":4383,"one":1},{"id":4384,"one":1},{"id":4387,"one":1},{"num":3,"id":5824,"one":1}]},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[69411]},"next":[69413]},"partials":[{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"npc","id":"1006530","obj":{"i":1006530,"n":"Slafborn","l":67,"q":24}},{"type":"item","id":"4383","obj":{"i":4383,"n":"Darklight Choker of Aiming","l":70,"c":54870,"t":40}},{"type":"item","id":"4384","obj":{"i":4384,"n":"Darklight Choker of Healing","l":70,"c":54874,"t":40}},{"type":"item","id":"4387","obj":{"i":4387,"n":"Darklight Choker of Casting","l":70,"c":54867,"t":40}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"69411","obj":{"i":69411,"n":"All Things in Time","g":2,"l":"Eastern La Noscea","s":4}},{"type":"quest","id":"69413","obj":{"i":69413,"n":"It's Possibly a Primal","g":2,"l":"Mor Dhona","s":14}}]}