{"quest":{"name":"All Things in Time","location":"Eastern La Noscea","id":69411,"patch":5.3,"sort":4,"icon":100173,"eventIcon":71201,"issuer":1007739,"target":1006693,"genre":2,"journal":["F'lhaminn has made her peace and is ready to reunite with her adopted daughter.","After five long years, the time has come for F'lhaminn to reunite with her daughter Minfilia. You resolve to accompany the songstress to Vesper Bay and watch over what should prove to be an emotional reunion.","Upon seeing Alphinaud escort F'lhaminn into the solar, Minfilia rushes forward to embrace her long-lost mother, overjoyed to learn that reports of her death were indeed exaggerated. During their tearful reunion, Minfilia explains that her father was once a member of the Ala Mhigan Resistance, and that following his death in a tragic accident, F'lhaminn raised her as her own. After praising Minfilia for her victories over the Empire, F'lhaminn states that the Scions must leave Ul'dah behind if they are to continue their work. Agreeing at last to Alphinaud's proposal, a reinvigorated Minfilia declares that the order will quit Vesper Bay and establish a new headquarters in Revenant's Toll."],"objectives":["Report to Minfilia at the Waking Sands."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"ALPHINAUD","text":"Despite her years of nomadism, it would seem Lady F'lhaminn has kept a close eye on the affairs of our order. Surprisingly close, in fact. Suffice to say, she is nothing if not resourceful."},{"name":"ALPHINAUD","text":"One does not develop such skills without effort─or without reason."},{"name":"FLHAMINN","text":"You say my daughter awaits us in Vesper Bay, yes?"},{"name":"FLHAMINN","text":"I have kept her waiting long enough. Let us be off on the next ferry. I can finish fashioning the perfume along the way."},{"name":"ALPHINAUD","text":"Understood. Come with me─it would be my pleasure to escort you to the Waking Sands."}],"reward":{"gil":2220,"items":[{"id":4385,"one":1},{"id":4386,"one":1},{"id":4382,"one":1},{"num":3,"id":5824,"one":1}]},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[69410]},"next":[69412]},"partials":[{"type":"npc","id":"1007739","obj":{"i":1007739,"n":"F'lhaminn","l":32,"q":2}},{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"item","id":"4385","obj":{"i":4385,"n":"Darklight Choker of Fending","l":70,"c":54866,"t":40}},{"type":"item","id":"4386","obj":{"i":4386,"n":"Darklight Choker of Maiming","l":70,"c":54876,"t":40}},{"type":"item","id":"4382","obj":{"i":4382,"n":"Darklight Choker of Striking","l":70,"c":54865,"t":40}},{"type":"item","id":"5824","obj":{"i":5824,"n":"Allagan Bronze Piece","l":15,"c":26001,"t":61}},{"type":"quest","id":"69410","obj":{"i":69410,"n":"Moving On","g":2,"l":"The Waking Sands","s":3}},{"type":"quest","id":"69412","obj":{"i":69412,"n":"Laying the Foundation","g":2,"l":"The Waking Sands","s":6}}]}