{"quest":{"name":"Promises to Keep","location":"Ul'dah","id":69416,"patch":5.3,"sort":23,"eventIcon":71201,"issuer":1008616,"target":1008623,"genre":2,"journal":["Raubahn would like to discuss how to handle the Doman refugees.","Regardless of the Syndicate's decision, Raubahn is not content to ignore the Domans' plight. He bids you and the others accompany him to the Hall of Flames to discuss what options remain available.","Concluding that the other city–states are unlike to accept the refugees, Alphinaud proffers an alternative solution. Rather than petitioning another nation for aid, the Domans might instead travel to the outpost of Revenant's Toll, where they could work as frontier hands in exchange for food and shelter. Though Yugiri is amenable to the idea, the matter of how the refugees would make a journey of so great a distance remains. Believing that the Ul'dahn Adventurers' Guild may be of assistance, Alphinaud departs for the Quicksand and invites you to follow.","Momodi has agreed to provide temporary accommodations for the Domans, so that they might regain their strength before embarking on their journey. Alphinaud bids you rest your own legs for a moment, then return to Vesper Bay to meet your guests and escort them to the place they will sojourn."],"objectives":["Speak with Raubahn at the Hall of Flames.","Speak with Alphinaud."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"ALPHINAUD","text":"As Lord Lolorito goes, so goes the Syndicate..."},{"name":"YUGIRI","text":"My people could not endure another long sea voyage. But if Ul'dah will not accept us, what choice have we?"},{"name":"KASASAGI","text":"“Prone to violence and criminal activity”!? Who is he to speak of us thus? Are we to be punished for sins we may never commit?"},{"name":"KIKYOU","text":"Did they not hear Lady Yugiri's pleas? How can they turn us away, knowing what we have endured?"},{"name":"TELEDJIADELEDJI","text":"It bears repeating that Lord Lolorito does not speak for the Syndicate."},{"name":"TELEDJIADELEDJI","text":"The others harbor doubts, I will allow, but in time they shall see the error of their ways."},{"name":"RAUBAHN","text":"As you observed, Lolorito is not afraid to speak his mind─nor is he like to change it."},{"name":"RAUBAHN","text":"Oft have I wondered how a man so skilled at weighing the worth of things should be so incapable of seeing the value in people..."},{"name":"RAUBAHN","text":"Bah. I will waste no more words on him─not when the Domans are yet in need of aid. Everyone, follow me to the Hall of Flames."},{"name":"ALPHINAUD","text":"Hmm... Mayhap I should have considered the likelihood of failure more deeply beforehand."},{"name":"YUGIRI","text":"A galleon is no place for my people─for any people─to call home. This cannot continue."},{"name":"KASASAGI","text":"Is there naught we can do to earn the approval of these Ul'dahns?"},{"name":"KIKYOU","text":"We do not wish to live by the grace of others. We want to work; we want to contribute!"},{"name":"TELEDJIADELEDJI","text":"I will not deny that certain portions of the refugee population have been a burden on the sultanate─but I take issue with my counterparts' contention that they account for the majority. In this they are plainly mistaken. Even so, we must not think ill of them for wishing to protect our great nation."},{"name":"RAUBAHN","text":"The Syndicate has spoken, and I see no point in moving that the matter be reconsidered. The Monetarists have made their position clear."},{"name":"ALPHINAUD","text":"Agreed. Ul'dah is not an option."},{"name":"ALPHINAUD","text":"Nor are Limsa Lominsa or Gridania, I judge, given the state of their internal affairs."},{"name":"ALPHINAUD","text":"Which leaves our Doman friends confined to a ship. Gods, the thought of them huddled in an airless hold with no hope of better treatment..."},{"name":"ALPHINAUD","text":"Would that I had more time to find an alternative! A place not bound by the concerns of the great nations─"},{"name":"ALPHINAUD","text":"Minfilia. ...That is precisely what I wished to discuss."},{"name":"YUGIRI","text":"I understand the Syndicate's decision, I do. We all wish to preserve that which is ours, especially when we believe it to be under siege."},{"name":"YUGIRI","text":"But I cannot meekly accept this judgment─not while my people suffer. Would it be out of the question for the sultanate to accept us for a limited time? A week, mayhap, or even just a few days...?"},{"name":"ALPHINAUD","text":"Excellent. I shall keep you informed."},{"name":"ALPHINAUD","text":"Lady Yugiri, I have a proposal, if you would hear it."},{"name":"RAUBAHN","text":"Out with it, Master Alphinaud."},{"name":"ALPHINAUD","text":"The headquarters of my order, the Scions of the Seventh Dawn, stands in a place called Revenant's Toll, an outpost in Mor Dhona."},{"name":"ALPHINAUD","text":"Like most outposts, it is frequented by mercenaries and other men of action, and lacks the comforts of more well-established settlements. However, the leaders of Revenant's Toll have been doing their utmost to change that."},{"name":"ALPHINAUD","text":"To that end, they have need of able-bodied individuals willing to work as frontier hands. Hard labor, lest you doubt, with naught save food and shelter by way of reward."},{"name":"RAUBAHN","text":"Terms not unlike those which you yourself proposed, Lady Yugiri."},{"name":"TELEDJIADELEDJI","text":"Though I will not hear a word said against our beloved Ul'dah, Revenant's Toll <span class=\"emphasis\">would</span> offer certain advantages─the absence of unhelpful bureaucracy being the most obvious."},{"name":"YUGIRI","text":"If they can accommodate us all, we shall gladly accept!"},{"name":"YUGIRI","text":"Master Alphinaud, once again I find myself in your debt."},{"name":"ALPHINAUD","text":"Pray do not thank me, my lady. The life your people go to is one of hard labor and few comforts, as I told you. And before that, there remains the matter of how they may safely be borne to Revenant's Toll─which will be no small feat, considering the distance and their present condition."},{"name":"ALPHINAUD","text":"Mayhap the Ul'dahn Adventurers' Guild can be of assistance. Look for me there anon, <span class=\"highlight\">Forename</span>."},{"name":"RAUBAHN","text":"Lady Yugiri, if you and your people would accompany me, we may discuss what aid the Immortal Flames can provide."},{"name":"ALPHINAUD","text":"We are concerned that the Doman refugees may find the journey to Revenant's Toll too much to bear."},{"name":"ALPHINAUD","text":"Too long have they been sequestered aboard their ship, with insufficient supplies and scarce room enough to breathe, let alone stretch their limbs. With that in mind, Mistress Momodi has kindly offered to accommodate the Domans until such time as they are ready to set out for Mor Dhona."},{"name":"ALPHINAUD","text":"Those healthy enough to travel will embark as soon as transportation has been secured, while those too weak to leave at once will be permitted to stay until they regain their strength."},{"name":"RAUBAHN","text":"What news?"},{"name":"ALPHINAUD","text":"Transportation remains our greatest obstacle, General. Is there aught the Immortal Flames can do?"},{"name":"RAUBAHN","text":"I fear that exceeds our mandate."},{"name":"RAUBAHN","text":"Were it a smaller number, mayhap it would go unnoticed."},{"name":"RAUBAHN","text":"But the Syndicate will not bear the cost of escorting more than two hundred Domans to Mor Dhona."},{"name":"TELEDJIADELEDJI","text":"When government fails to act, the responsibility falls to us private citizens."},{"name":"TELEDJIADELEDJI","text":"I will engage the services of the Seventy-Seven Caravans on the Domans' behalf."},{"name":"RAUBAHN","text":"Very well─we should begin contract negotiations at once. Your generosity is most welcome, my lord."},{"name":"TELEDJIADELEDJI","text":"After all that has befallen these good people, it is the least I can do."},{"name":"TELEDJIADELEDJI","text":"Come what may, you shall ever have a friend in Ul'dah, Lady Yugiri."},{"name":"YUGIRI","text":"And you in Revenant's Toll, my lord."},{"name":"MOMODI","text":"Well, it sounds like we all have work to do! Lady Yugiri, let's put our heads together an' settle the details of our arrangement, shall we?"},{"name":"ALPHINAUD","text":"I would entrust the task of escorting our Doman friends to you─after you have rested your own road-weary legs, of course. What say you?"}],"reward":{"gil":1502,"items":[{"id":6252,"one":1},{"id":6253,"one":1},{"id":6254,"one":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66883]},"next":[69417]},"partials":[{"type":"npc","id":"1008616","obj":{"i":1008616,"n":"Raubahn","l":41,"q":2}},{"type":"npc","id":"1008623","obj":{"i":1008623,"n":"Alphinaud","l":40,"q":7}},{"type":"item","id":"6252","obj":{"i":6252,"n":"Hero's Ring of Fending","l":90,"c":54543,"t":43}},{"type":"item","id":"6253","obj":{"i":6253,"n":"Hero's Ring of Slaying","l":90,"c":54543,"t":43}},{"type":"item","id":"6254","obj":{"i":6254,"n":"Hero's Ring of Aiming","l":90,"c":54543,"t":43}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"66883","obj":{"i":66883,"n":"The Mother of Exiles","g":2,"l":"Western Thanalan","s":22}},{"type":"quest","id":"69417","obj":{"i":69417,"n":"Yugiri's Game","g":2,"l":"Ul'dah","s":25}}]}