{"quest":{"name":"Build on the Stone","location":"The Waking Sands","id":69414,"patch":5.3,"sort":19,"icon":100177,"eventIcon":71201,"issuer":1006693,"target":1007724,"genre":2,"journal":["Minfilia has a final favor to ask of you.","Minfilia's father, Warburton, was a Garlean spy whose true loyalties lay with the Ala Mhigan Resistance. Before his untimely death some fifteen years ago, he stole a wealth of imperial research on the primals, and compiled the findings in his private journal. Though this journal has served to guide Minfilia ever since, she has resolved─after no small amount of soul-searching─to entrust it to Urianger, in the hope that he may succeed in unraveling its remaining mysteries. Present Warburton's journal to Urianger on Minfilia's behalf.","By curious coincidence, Minfilia contacts you via linkpearl immediately after you deliver the journal to Urianger. She has departed for Revenant's Toll, and bids you follow as soon as you are able. Travel to Mor Dhona and speak with Tataru to gain entrance to the Rising Stones.","Tataru welcomes you to Revenant's Toll and the Scions' new headquarters, and explains that Minfilia awaits you inside. Join her and see how you might be of aid to your companions as they settle into their new home.","Even as the Scions of the Seventh Dawn celebrate the inauguration of their new headquarters, Urianger arrives unannounced, bearing troubling news. The distant yet dependable Students of Baldesion are no longer responding to his messages. Fearing the worst, Minfilia bids Urianger do everything he can to determine the cause of their uncharacteristic silence. For the time being, however, the Scions have no choice but to continue their work without the aid of one of their closest allies."],"objectives":["Give Warburton's journal to Urianger.","Speak with Tataru in Revenant's Toll.","Speak with Minfilia in the Rising Stones."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"MINFILIA","text":"Let us set aside the matter of this Ascian until after we have completed our move to the Rising Stones. There is but one final favor I would ask of you before I depart."},{"name":"MINFILIA","text":"I believe I mentioned before that my father was a member of the Ala Mhigan Resistance. The truth, however, is more complicated than that."},{"name":"MINFILIA","text":"As far as the Empire knew, he was their spy. He maintained the deception for nigh on half a decade, furnishing the Resistance with vital imperial secrets while feeding his paymasters subtly conceived misinformation."},{"name":"MINFILIA","text":"When he died some fifteen years ago, my father left behind his journal, which I have closely guarded ever since. It contains every shred of information he and his agents could steal on what they believed to be the single greatest threat to Eorzea: the primals."},{"name":"MINFILIA","text":"Its wisdom has guided me through the years, though there is much within I still do not understand..."},{"name":"MINFILIA","text":"It is my hope that Urianger will fare better."},{"name":"MINFILIA","text":"Tell him to treat it with care. It is all I have left of my father."},{"name":"MINFILIA","text":"Please, before I reconsider, give my father's journal to Urianger."},{"name":"URIANGER","text":"I thought thee departed. To what end dost thou linger?"},{"name":"URIANGER","text":"The father's final bequest...the daughter's lifelong labor."},{"name":"URIANGER","text":"It is no small thing to surrender such a cherished memento. Well can I imagine the Antecedent's pain. Upon mine honor, I swear to spare no effort in the study of these materials, lest my lady's sacrifice be in vain."},{"name":"MINFILIA","text":"<span class=\"highlight\">Forename</span>, this is Minfilia."},{"name":"MINFILIA","text":"Forgive me, but I could wait no longer─I have departed for the Rising Stones."},{"name":"MINFILIA","text":"If...if you have yet to..."},{"name":"MINFILIA","text":"...Once you have given the journal to Urianger, I bid you come to the Seventh Heaven in Revenant's Toll. Tataru will be there to show you inside our new headquarters."},{"name":"MINFILIA","text":"Assuming you have already attuned to it, you may wish to make use of our new aetheryte in Revenant's Toll. After all, it is right on our doorstep!"},{"name":"URIANGER","text":"Thou hast been summoned to the Rising Stones, yes? Then keep not thy fellows waiting."},{"name":"SLAFBORN","text":"Ah, there you are. Your friends are waiting for you inside."},{"name":"TATARU","text":"Oh, <span class=\"highlight\">Forename</span>! You're here! Good, good. We were all wondering when you'd show up!"},{"name":"SLAFBORN","text":"As I was just telling your restive receptionist here, I'm pleased to inform you that all the documents have been prepared and all signatures signed. The Rising Stones is officially yours!"},{"name":"TATARU","text":"Splendid! From this day forward, I will spare no effort in seeing that it is as welcoming and comfortable a home for us as the Waking Sands ever was!"},{"name":"TATARU","text":"That said, this is all somewhat intimidating, is it not? So many unfamiliar places, and unfamiliar faces..."},{"name":"TATARU","text":"Take that odd-looking fellow over there, for example. He's been eyeing us most suspiciously ever since we arrived. I cannot help but wonder if we are truly safe here..."},{"name":"SLAFBORN","text":"Ah, that man. I can't say I've spoken to him myself, but rumor has it he's come to hunt for ancient treasures in the Crystal Tower."},{"name":"SLAFBORN","text":"You've seen the structure I speak of, no? It'd be hard to miss it. That massive pillar of shining crystal that looms high over the land just to the southeast of here."},{"name":"SLAFBORN","text":"If the tales are to be believed, it's a remnant of some ancient civilization. The details remain a mystery, and that's no doubt why it's drawn adventurers and scholars from all over looking to unearth its secrets."},{"name":"SLAFBORN","text":"The man over there is no exception─and if my instincts are true, he knows more than most. If you're curious about the tower yourself, you could do worse than to talk to him and see what he knows."},{"name":"SLAFBORN","text":"Why, if I weren't otherwise occupied with my duties here, I'd have half a mind to join you. I mean, just look at it! I can scarce begin to imagine what wonders lie inside..."},{"name":"SLAFBORN","text":"Revenant's Toll is populated mostly by adventurers, which means─as you might expect─that there's quite a bit of coming and going."},{"name":"SLAFBORN","text":"Emphasis on the <span class=\"emphasis\">coming</span>─at least of late, what with the investigation of the Crystal Tower hitting full stride. I've lost track of how many fortune-seekers and scholars have shown up in the past few days alone, hoping to unearth ancient secrets."},{"name":"SLAFBORN","text":"I don't suppose the tower's piqued your interest as well?"},{"name":"SLAFBORN","text":"You've already offered your aid to the effort, you say? You certainly move quickly, my friend."},{"name":"SLAFBORN","text":"If I weren't otherwise occupied with my duties here, I'd have half a mind to join you. Alas, I'll have to settle for hearing the tales of all you've seen upon your return. Be safe in there, yes?"},{"name":"SLAFBORN","text":"Most of the men and women you see around you here in Revenant's Toll are adventurers who come and go as they wish. I daresay that should make it easier for you to go about your business here."},{"name":"SLAFBORN","text":"And it shouldn't hurt that <span class=\"highlight\">Forename</span> here has already made something of a name for <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> here. Isn't that so, <span class=\"highlight\">Forename</span>?"},{"name":"TATARU","text":"Why, that's wonderful to hear! Rest assured that this receptionist will work just as hard to see that our efforts do not skip a beat despite the relocation."},{"name":"TATARU","text":"And with that, <span class=\"highlight\">Forename</span>, I do believe it's time you officially announced your presence to everyone inside."},{"name":"TATARU","text":"The Antecedent and the others will surely be overjoyed to see you."},{"name":"SYSTEM","text":"The Crystal Tower quest series is now available from the outlandish man."},{"name":"SYSTEM","text":"In order to progress in the main scenario, you must first complete certain quests in the Crystal Tower series."},{"name":"SYSTEM","text":"While you are granted a respite from your duties as a Scion, use your time to probe the depths of the Crystal Tower and see what ancient secrets may be gleaned!"},{"name":"SYSTEM","text":"In order to progress in the main scenario, you must first complete certain quests in the Crystal Tower series."},{"name":"SYSTEM","text":"While you are granted a respite from your duties as a Scion, use your time to probe the depths of the Crystal Tower and see what ancient secrets may be gleaned!"},{"name":"TATARU","text":"Welcome to our new home─the Rising Stones! Isn't it lovely?"},{"name":"TATARU","text":"But why are you standing around here talking to me? Everyone's waiting for you inside!"}],"reward":{"gil":7000},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66728]},"next":[69415]},"partials":[{"type":"npc","id":"1006693","obj":{"i":1006693,"n":"Minfilia","l":356,"q":11}},{"type":"npc","id":"1007724","obj":{"i":1007724,"n":"Minfilia","l":481,"q":3}},{"type":"quest","id":"66728","obj":{"i":66728,"n":"The Gifted","g":2,"l":"The Waking Sands","s":18}},{"type":"quest","id":"69415","obj":{"i":69415,"n":"Still Waters","g":2,"l":"The Rising Stones","s":20}}]}