{"quest":{"name":"Reap the Whirlwind","location":"Central Thanalan","id":69420,"patch":5.3,"sort":42,"eventIcon":71201,"issuer":1009049,"target":1004576,"genre":2,"journal":["The terrified refugee would have you find the shady figure who is trying to stir dissent among his brethren.","The visibly trembling man is concerned that the merchant will attempt to recruit more desperate refugees, perpetuating the bloodshed. Recalling that the merchant wished to approach the people of Stonesthrow, the survivor bids you continue your search there.","You find yourself drawn to a sobbing child, who tells you of a man who visited Stonesthrow and persuaded a number of people, including her parents, to leave with him. No sooner is your interest piqued than the man returns. You confront him, only to watch as he runs off like a coward in the direction of the Ul'dah Dispatch Yard. Chase him down and see that he answers for his actions.","In the Dispatch Yard, you come upon your quarry. Little to your surprise, the shifty merchant is quick to deny your accusations, and equally quick to confess when pressed. No sooner does he offer to divulge all he knows than he falls at your feet, an arrow having pierced his chest with uncanny timing. The commotion draws the attention of two Stone Torches, one of whom would like to know why you are standing next to a dead man.","You explain to the Stone Torch that the merchant was felled by an arrow from afar, and that he was the subject of your investigation into the refugee uprisings. Satisfied with your statement, the Stone Torch bids you carry on with your work. Return to the Hall of Flames and report your findings to Commander Swift.","Swift concludes that the merchant was murdered to protect the identity of his employer. Despite this setback, he seems confident that the identity of the uprising's true orchestrator will soon be revealed."],"objectives":["Search Stonesthrow for the merchant.","Search for the merchant in the Ul'dah Dispatch Yard.","Speak with the Stone Torch.","Report to Swift at the Hall of Flames."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"TREMBLEMAN01443","text":"The merchant wished to approach the refugees in Stonesthrow, but was waiting until the Flames withdrew their forces from the vicinity. Now that they have, there's nothing to stop him from continuing his work."},{"name":"TREMBLEMAN01443","text":"How many more must perish in pursuit of this futile cause? How much more suffering must we endure before it ends?"},{"name":"TREMBLEMAN01443","text":"Find him. Convince him to cease his mad quest. It will surely lead us to ruin."},{"name":"ELE","text":"&lt;sniffle&gt; Have... Have you seen my parents?"},{"name":"ELE","text":"They told me to stay here with the others. &lt;sniffle&gt; They said they'd be back soon, but it's been days..."},{"name":"ELE","text":"They left with the man from Ul'dah. The man said they were gonna change everything─make it so we could live inside the walls with everyone else. I liked it when he said that."},{"name":"ELE","text":"I didn't like it when he talked about making the rich people pay. Everyone looked so angry, and I got scared..."},{"name":"ELE","text":"Say, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>...are you looking for someone?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'm looking for a merchant."},{"name":"A1","text":"I'm looking for someone stirring up trouble."},{"name":"ELE","text":"You mean...the man who left with my parents? But I don't know where he─"},{"name":"ELE","text":"Wait...look! Over there! I think that's him!"},{"name":"MERCHANT01445","text":"Well, now. Which of these gullible fools shall be my next victim?"},{"name":"MERCHANT01445","text":"<span class=\"emphasis\">You</span>! I... I..."},{"name":"ELE","text":"He's getting away! Go get him, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>!"},{"name":"ELE","text":"The man who left with my parents ran off that way! You can't let him get away!"},{"name":"GUARDLEADER01445","text":"Hold, adventurer. I would know more about your relationship with the victim, as well as the events leading up to his death."},{"name":"GUARDLEADER01445","text":"This man was responsible for the recent riots? Mayhap we owe his murderer a debt of gratitude."},{"name":"GUARDLEADER01445","text":"In any case, it is obvious you are not the one whom we seek. You may carry on with your investigation, Scion."},{"name":"GUARDLEADER01445","text":"If that arrow was shot from where you indicated, the archer must have a good eye...and a better arm."},{"name":"SWIFT","text":"What news, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>? Where is the merchant?"},{"name":"SWIFT","text":"<span class=\"emphasis\">Murdered</span>!? Damn it all to the seventh hell!"},{"name":"SWIFT","text":"He was not simply murdered, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>─he was <span class=\"emphasis\">silenced</span>. Too many knew his face, and he was ready to divulge his secrets."},{"name":"SWIFT","text":"Do not despair, though. We may be closer to identifying the true orchestrator of these riots than you realize."}],"reward":{"items":[{"id":7302,"one":1},{"id":7318,"one":1},{"id":7328,"one":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[69419]},"next":[66982]},"partials":[{"type":"npc","id":"1009049","obj":{"i":1009049,"n":"Terrified Refugee","l":43,"q":3}},{"type":"npc","id":"1004576","obj":{"i":1004576,"n":"Swift","l":40,"q":16,"t":"Flame Commander"}},{"type":"item","id":"7302","obj":{"i":7302,"n":"Noct Choker","l":110,"c":54888,"t":40}},{"type":"item","id":"7318","obj":{"i":7318,"n":"Gloam Choker","l":110,"c":54888,"t":40}},{"type":"item","id":"7328","obj":{"i":7328,"n":"Auroral Choker","l":110,"c":54888,"t":40}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69419","obj":{"i":69419,"n":"Shock and Awe","g":2,"l":"Central Thanalan","s":41}},{"type":"quest","id":"66982","obj":{"i":66982,"n":"Revolution","g":2,"l":"Ul'dah","s":43}}]}