{"quest":{"name":"In Everyone's Best Interests","location":"Ishgard","id":69428,"patch":5.35,"sort":10003,"icon":101004,"unlocksFunction":1,"eventIcon":71341,"issuer":1032898,"target":1032899,"genre":84,"journal":["Neillemard eyes you with a look of eager anticipation.","Neillemard shares with you the triumphant news that, after studying the design documents with Stephanivien, he and his colleagues believe they finally have the knowledge to carry out the next phase of augmentation on your dragonsung tool. Unsurprisingly, the process is a convoluted one, requiring the procurement of rare materials which then must be fashioned into a unique varnish via arcane techniques. Speak to Nimie to begin the process.","Thanks to Rowena's team of goblin engineers and the dedication of Neillemard and his colleagues, the time has finally come to upgrade your dragonsung tool to the next phase of augmentation. Confident that the results will be worth the considerable effort, you stand ready to procure the exotic and eccentric materials needed...whatever they are."],"objectives":["Speak with Nimie outside the Skysteel Manufactory."],"dialogue":[{"name":"NEILLEMARD","text":"Welcome back, my friend! Truly, you couldn't have picked a more opportune time. The manufactory's top minds─including Stephanivien, yes!─have come together to revise the design documents, and I'm most pleased to say that we are ready to take that dragonsung tool of yours to yet greater heights."},{"name":"NEILLEMARD","text":"As you might expect, however, the augmentation process is somewhat...arcane. For the truly optimal results that we desire, it requires a peculiar coating made via specialized goblin techniques─and from materials that are difficult to come by."},{"name":"NEILLEMARD","text":"Fortunately, my colleague Denys has come in contact with an individual who claims to specialize in the procurement of the extraordinary and eccentric, and they're discussing the very matter as we speak. With any luck, they'll have some good news for us before long."},{"name":"ROWENA","text":"(-???-)Well, now here's a familiar face. When the man told me they were working with a trades<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> o' no small repute, I should've expected as much."},{"name":"ROWENA","text":"Aye, my nose for business is tellin' me that this whole endeavor is smellin' more and more like a profitable one."},{"name":"ROWENA","text":"At any rate, I'm happy to say that my associates and I are more than able to provide the services you'll be needin'. I've recruited some o' the finest goblin alchemists at Stickqix's Bangpots, so you're welcome to start crackin' the whip and get the process goin'."},{"name":"ROWENA","text":"I'll be headin' back to my House of Splendors, but Denys should be able to answer any o' your questions. And don't any of you go forgettin' the details of our contract─suffice to say my services don't come cheap."},{"name":"NIMIE","text":"<span class=\"emphasis\">Do</span> see that we keep to the terms─we don't want her coming back for your firstborn. Or my coeurl kitten."},{"name":"NEILLEMARD","text":"How heartening it is to see that you and Rowena already have such mutual trust and admiration for one another."},{"name":"NEILLEMARD","text":"Truth be told, we were just about at our wits' end in trying to reproduce the requisite goblin method of synthesis."},{"name":"NEILLEMARD","text":"That's when I confided in Master Arvide─you are familiar with his work teaching craftsmanship to dragons, no doubt? Quite the ambitious undertaking."},{"name":"NEILLEMARD","text":"In any case, he first introduced us to Anna, who in turn reached out to Rowena herself. Without them, I don't know where we'd be."},{"name":"NEILLEMARD","text":"Truth be told, we were just about at our wits' end in trying to reproduce the requisite goblin method of synthesis."},{"name":"NEILLEMARD","text":"One of my colleagues, however, suggested that I might inquire with Rowena's House of Splendors. For reasons I can't quite fathom, he seemed hesitant to recommend them─but it's not as if we had any other options."},{"name":"NEILLEMARD","text":"Rowena has graciously agreed to lend us her full support, on the condition that we turn over the design documents to her and supply all the necessary materials."},{"name":"NEILLEMARD","text":"She's one tough negotiator, that's for certain. No doubt she accurately deduced that we had nowhere else to turn, and refused to yield an ilm. But I'm quite sure the eventual results will speak for themselves."},{"name":"DENYSE","text":"So that's where we stand. As Neillemard said, we'll be responsible for providing all the raw materials that the goblins will require to whip up that fancy goo of theirs. Though just between us, I had my own reasons for agreeing to that condition."},{"name":"DENYSE","text":"No doubt you recall how the plans stress the importance of the bond between the tool and <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who wields it. Knowing that, I thought it best that once again you be the one to fashion the needed materials, with tool firm in hand."},{"name":"DENYSE","text":"No doubt you recall how the plans stress the importance of the bond between the tool and <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who wields it. Knowing that, I thought it best that once again you be the one to harvest the needed materials, with tool firm in hand."},{"name":"DENYSE","text":"I'm sure you've been eagerly awaiting an excuse to slip away and have a private moment with such a fine piece of equipment, too. Don't be afraid to have a little fun─just remember that we do want to start the improvement process in a timely fashion."},{"name":"DENYSE","text":"Much obliged! I'll be manning my usual post at the manufactory─once you have the raw materials in hand, you can bring them to me at any time, and I'll put Rowena's team of goblin goo specialists to work."},{"name":"NEILLEMARD","text":"Denys has been working night and day to see that dealings with Rowena's House of Splendors progress smoothly. But never fear─in his place, Nimie will undertake the enhancements personally and ensure that they are up to snuff. I, for one, can scarce wait to see the result!"},{"name":"NEILLEMARD","text":"All of the resources of the manufactory are at your disposal─as, of course, are the services of Nimie, Denys, and myself."},{"name":"NIMIE","text":"Right. As Neillemard said, I'll be handling the adjustments to your tool. I couldn't help but notice that neither of the others bothered with details about the fiddly nonsense you need to procure─but my advice? Brace yourself."}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":35}],"quests":[69385]},"next":[69429]},"partials":[{"type":"npc","id":"1032898","obj":{"i":1032898,"n":"Neillemard","l":2300,"q":5}},{"type":"npc","id":"1032899","obj":{"i":1032899,"n":"Nimie","l":2300,"q":4}},{"type":"quest","id":"69385","obj":{"i":69385,"n":"Work It Harder, Make It Better","g":84,"l":"Ishgard","s":10002,"f":1}},{"type":"quest","id":"69429","obj":{"i":69429,"n":"Ever Skyward","g":84,"l":"Ishgard","s":10004,"r":1,"f":1}}]}