{"quest":{"name":"On Ehll Tou's Wings","location":"The Firmament","id":69427,"patch":5.3,"sort":1004,"unlocksFunction":1,"eventIcon":71341,"issuer":1032220,"target":1033784,"genre":84,"journal":["Hautdilong has something to share with you, and he can't hold it in any longer."],"objectives":["Speak with Arvide."],"dialogue":[{"name":"HAUTDLONG","text":"<span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Sir</span></span> <span class=\"highlight\">Surname</span>, there you are! Ehll Tou and I have been thinking of how we can repay you for all your help."},{"name":"HAUTDLONG","text":"After much deliberation, we decided to ask Master Arvide to help us craft a bespoke item, just for you. I hope he hasn't spoiled the surprise."},{"name":"HAUTDLONG","text":"When last we spoke, he said that the project was nearing completion. Perhaps he is finished by now? Oh, I do hope you like it!"},{"name":"HAUTDLONG","text":"I think you'll be pleasantly surprised by what Ehll Tou and I have devised for you. Master Arvide should have it ready by now─he should be at the market in the New Nest."},{"name":"ARVIDE","text":"Ah, welcome! I take it you've spoken to Hautdilong, then. Well, here you go!"},{"name":"ARVIDE","text":"Ehll Tou was most insistent I designed this horn just so. Blow on it and the little dragon will fly to your side wheresoever you may be."},{"name":"ARVIDE","text":"Although I suppose I can't call her little any more, eh? 'Tis only natural that as she grows, her desire to see more of the world would grow as well."},{"name":"ARVIDE","text":"That's why she wanted you to have this. Show her every corner of the civilized world, and introduce her to people of all sort. She'll need a wide breadth of knowledge if she means to paint her kin the full picture of our kind."},{"name":"ARVIDE","text":"When I first agreed to help Ehll Tou, I had no inkling I might be contributing to something much larger than myself. Whatever comes of her efforts in the end, I must say I'm honored to have played my small part in it. Thanks for giving me this opportunity, friend."}],"reward":{"items":[{"id":30866}]},"reqs":{"jobs":[{"lvl":70,"id":1}],"quests":[69426]}},"partials":[{"type":"npc","id":"1032220","obj":{"i":1032220,"n":"Hautdilong","l":3435,"q":1}},{"type":"npc","id":"1033784","obj":{"i":1033784,"n":"Arvide","l":3435,"q":1}},{"type":"item","id":"30866","obj":{"i":30866,"n":"Ehll Tou Whistle","l":1,"c":26039,"t":63}},{"type":"quest","id":"69426","obj":{"i":69426,"n":"An Ode to Unity","g":84,"l":"The Firmament","s":1003,"f":1}}]}