{"quest":{"name":"An Ode to Unity","location":"The Firmament","id":69426,"patch":5.3,"sort":1003,"unlocksFunction":1,"eventIcon":71341,"issuer":1033543,"target":1033922,"genre":84,"journal":["Ehll Tou is eager to share her newest labor of love with her own kind."],"objectives":["Speak with Arvide.","Search for Ehll Tou at Zenith.","Deliver Ehll Tou's hammer to the endearing dragonet.","Speak with Ehll Tou at Saint Roelle's Dais."],"dialogue":[{"name":"EHLLTOU","text":"At last, my culinary masterwork is ready to be shared with my kin. Thanks to the guidance of my capable teachers, I believe I've cooked up something that will have even the most stubborn among them clamoring for more! "},{"name":"EHLLTOU","text":"Doubtless even now they are eagerly awaiting my arrival, their whispers of what I might bring filling the Churning Mists with expectation. I'd best leave at once─there are few things more unpleasant than a hungry dragon!"},{"name":"HAUTDLONG","text":"Safe travels, Ehll Tou!"},{"name":"EHLLTOU","text":"Ack... So dizzy. Wings...aching... No, I must move forward! Before the food cools and with it...the esteem of my kin..."},{"name":"HAUTDLONG","text":"Ehll Tou? Is something the matter?"},{"name":"EHLLTOU","text":"N-Not at all! In fact, I'm positively...effervescent! Now wait right here. I'll be back before you've even realized I've gone!"},{"name":"HAUTDLONG","text":"Hmm... It shouldn't have taken this long..."},{"name":"HAUTDLONG","text":"Come to think of it, Ehll Tou <span class=\"emphasis\">was</span> acting rather strangely before she departed..."},{"name":"HAUTDLONG","text":"Perhaps we should ask Master Arvide for counsel. He seems to have a solution for every problem. Oh, I hope nothing untoward has happened..."},{"name":"HAUTDLONG","text":"I'll stay here and keep watch for Ehll Tou. I pray you and Master Arvide can get to the bottom of this!"},{"name":"SYSTEM","text":"Custom deliveries cannot be made while this quest is in progress. They will become available again once the quest is completed."},{"name":"HAUTDLONG","text":"Would that there was something I could do but stand here..."},{"name":"ARVIDE","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span>! What brings you here?"},{"name":"ARVIDE","text":"...Now that you mention it, I haven't seen Ehll Tou since she left with her delivery. You're certain she hasn't returned?"},{"name":"ARVIDE","text":"I meant to give her this hammer I made as a little reward for her efforts. Considering how hard she's been working, I wouldn't be surprised if she's just gone for a leisurely stroll─or a fly, I suppose? A flit?"},{"name":"ARVIDE","text":"Anyroad, she <span class=\"emphasis\">is</span> a dragon, albeit a tiny one. Try as we might, we would be fools to think we understand even a fraction of what goes on in her head. I'm sure she'll return in her own time."},{"name":"ARVIDE","text":"Still, if you must go looking for her, take the hammer. I've no doubt her eagerness to learn how to use it would send her back here as fast as her little wings can carry her."},{"name":"ARVIDE","text":"She often goes on at length about her dragonet friends at this place called Zenith, somewhere in the Churning Mists. If that rings a bell to you, I reckon it might be a good place to start."},{"name":"ARVIDE","text":"I don't know much about the Churning Mists aside from that I'm liable to get eaten whole before I've walked a yalm. I'm certain you'll manage to go a bit further than that, eh?"},{"name":"DRAGONET03890","text":"Oh, is that who I think it is? The very hero who triumphed over Nidhogg and brought peace between our kinds? From all the stories Ehll Tou has told of you, I expected a bit more...grandeur."},{"name":"DRAGONET03890","text":"I suppose appearances come second when you spend your days working with your claws. Or hands, were they? Nevertheless, I must thank you for taking the time to pass down such refined arts to my friend. We do so enjoy seeing what she brings!"},{"name":"DRAGONET03890","text":"You're looking for her? She's visiting friends not far from here, gushing over that─what was it?─“cooking” of hers. Delectable stuff, that. To think there was more to food than scorching and chomping."},{"name":"DRAGONET03890","text":"Considering the distance you've traveled, I'm terribly sorry to say that she specifically requested not to let anyone from the surface see her until she was ready. She was quite insistent, in fact."},{"name":"DRAGONET03890","text":"Still, I'm sure she would be delighted to receive that deadly looking trinket of yours. What did you call it? A “hammer”? It looks far too heavy for me to wield myself, but I should be able to carry it without dropping it. That is, unless I <span class=\"emphasis\">choose</span> to drop it. Those moogles who've been pestering me are in need of some long overdue comeuppance..."},{"name":"DRAGONET03890","text":"Ahem! Anyway, I shall let her know you've arrived, but let me warn you that it may be some time until she is willing to show herself."},{"name":"DRAGONET03890","text":"Now pass that hammer of yours over here. I pray it is not as unwieldy as it looks."},{"name":"DRAGONET03890","text":"Hmm... So this is one of those “tools” you wingless ones are so fond of? Are all of them as complex as this one? It shall be safe in my keeping, I assure you. I wouldn't have the slightest idea how to use it even if I wanted."},{"name":"DRAGONET03890","text":"Now wait here, and I shall return. When, however, I cannot say..."},{"name":"HAUTDLONG","text":"<span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Sir</span></span> <span class=\"highlight\">Surname</span>, there you are!"},{"name":"ARVIDE","text":"Surprised to see us, I take it. Young Hautdilong got it in his head to come searching for Ehll Tou, and there wasn't a thing I could say to sway him."},{"name":"ARVIDE","text":"Try as I might to distract him with work, somehow he managed to book us a trip across the Sea of Clouds. It's a wonder we caught up to you, all things considered... Just how long have you been waiting here?"},{"name":"HAUTDLONG","text":"Where is she, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Sir</span></span> <span class=\"highlight\">Surname</span>? Where's Ehll Tou?"},{"name":"HAUTDLONG","text":"What? Why wouldn't she want to see us? That doesn't make any sense..."},{"name":"HAUTDLONG","text":"Ehll Tou! Can you hear me!? Where are you!?"},{"name":"EHLLTOU","text":"(-???-)Oh, shush! You'll wake something bigger than a dragonet with all that shouting."},{"name":"HAUTDLONG","text":"Huh!? That scarf... That hat... Wait... Ehll Tou, is that you!?"},{"name":"EHLLTOU","text":"Ah, I knew you would recognize me! Still, an explanation may be in order...<br>You see, a dragon's growth is dictated by forces both internal and external. Sometimes this growth can be quite...dramatic, as you can plainly see."},{"name":"EHLLTOU","text":"Truth be told, I had been feeling out of sorts lately, but now I see that that discomfort was merely the new me trying to break free. And now here she is─a dragon reborn!"},{"name":"HAUTDLONG","text":"Oh, I'm so glad you're all right. More than all right, by the looks of things!"},{"name":"EHLLTOU","text":"This new tool is wonderful! It's as if Master Arvide knew I was on the brink of incredible change!"},{"name":"EHLLTOU","text":"Had I received this hammer but a day earlier, I would have held it clumsily in my tiny claws. Now, however, it feels like an extension of my very body. My mind is brimming with the possibilities of what I might craft next!"},{"name":"DRAGONET03890","text":"Your growth is unlike aught I have seen before! Such a spectacular transformation has already made you the topic of much discussion among dragonkind, and I imagine not a small amount of jealousy."},{"name":"ARVIDE","text":"See, what did I tell you two? There was no need for all that fretting and fussing. Still, if not for young Hautdilong's concern, who knows if I would've ever set foot in the Churning Mists."},{"name":"EHLLTOU","text":"I apologize for causing undue worry, but I pray you understand how embarrassing it would've been if anyone saw me before I was ready. And now you are the first to behold a dragon not warped by conflict and strife, but nourished by peace and fellowship!"},{"name":"EHLLTOU","text":"Well, not the first, surely. Only the first in quite some time. When man and dragon lived in harmony, maturation like mine may have been more common."},{"name":"HAUTDLONG","text":"I think there may be something to that, Ehll Tou. If we ask around, we may just find a dragon who has stories of those halcyon days. At the very least, it would be a chance to make new friends among the clouds!"},{"name":"HAUTDLONG","text":"And we can start with our present company. I'd be eager to hear of your life here."},{"name":"DRAGONET03890","text":"Hmm? Me? Why, I would be delighted, although I have seen scarcely more summers than Ehll Tou."},{"name":"DRAGONET03890","text":"She has regaled me with many tales of the wingless ones that build and tinker. Far from the primitive brutes I had believed they were, her stories told of an inventive and adventurous people."},{"name":"DRAGONET03890","text":"While I thought the stories fanciful, I now see that if anything, they weren't fanciful enough!"},{"name":"DRAGONET03890","text":"Mayhap I too shall journey down below the clouds and live among mankind for a time, and try my claws at this “crafting” of yours."},{"name":"HAUTDLONG","text":"You would be more than welcome!"},{"name":"EHLLTOU","text":"Indeed! Is this not what we set out to accomplish from the onset? To bring man and dragon closer, one step at a time. I believe we are well on our way."},{"name":"DRAGONET03890","text":"I shall do my part by spreading the word far and wide! Surely, I'm not the only dragon interested in following Ehll Tou's path!"},{"name":"EHLLTOU","text":"The more the merrier! I suppose we should return with haste and tell Lord Francel to expect a few more visitors to Ishgard. Even one so level-headed as he may be caught off guard by a sudden influx of dragons."},{"name":"HAUTDLONG","text":"Welcome back, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Sir</span></span> <span class=\"highlight\">Surname</span>!"},{"name":"ARVIDE","text":"I must confess, I had my doubts when I first agreed to this arrangement, but Ehll Tou and young Hautdilong here have proven more resourceful than I gave them credit for."},{"name":"EHLLTOU","text":"Of course, <span class=\"highlight\">Surname</span> deserves <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> share of the credit as well!"},{"name":"EHLLTOU","text":"Were it not for your tutelage, I would not have grown as I have, and in doing so finally compel my friends to come mingle with the men and women of Ishgard!"},{"name":"EHLLTOU","text":"Lord Francel was most understanding when we informed him of what we had planned. He gave his word to ensure that none of the less savory elements of the city would bring harm to its new visitors."},{"name":"EHLLTOU","text":"Even now he is working to inform those with authority in Ishgard to welcome my brothers and sisters!"},{"name":"EHLLTOU","text":"Before long, the sight of wings in the sky will fill the hearts of men not with dread, but with elation!"},{"name":"ARVIDE","text":"The industriousness of these two never fails to impress. We might do well to learn from them, eh?"},{"name":"EHLLTOU","text":"I would also like to thank Hautdilong. Had he not come to the Churning Mists, the idea of befriending our erstwhile nemeses may have remained naught but an idle fancy for the other dragons. But thanks to his affable nature, the first spark of curiosity has been struck in their hearts."},{"name":"HAUTDLONG","text":"You are too kind, Ehll Tou! I, for one, can't wait to see this place alive with the sounds of dragon and man conversing in good faith."},{"name":"HAUTDLONG","text":"And with one endeavor having reached a satisfactory conclusion, I believe it may be time to begin another. My time spent with Ehll Tou has provided me with more than enough notes to begin my chronicles, but I must first compile and arrange them."},{"name":"ARVIDE","text":"Then you'd best begin sooner rather than later, lad. Once you're finished, bring it to the manufactory and I'll see about producing some illustrations to give your book a little flair."},{"name":"EHLLTOU","text":"Now isn't that a marvelous idea! You can fill the book with pictures so that even dragons who cannot read your letters can understand. Oh, what harmonious songs such a work could inspire!"},{"name":"HAUTDLONG","text":"Songs, perhaps, that can be sung in unison! In fact, I believe I may have my title: “An Ode to Unity.” Man and dragon shall come to a deeper understanding─and I hope, appreciation─of the other by reading it."},{"name":"ARVIDE","text":"Not bad, lad. Not bad at all. Well then, it sounds to me that we've quite a lot of work ahead of us. I'd best get started."},{"name":"EHLLTOU","text":"<span class=\"highlight\">Forename</span>, might I trouble you to assist Master Hautdilong in the completion of his chronicle? I can think of nary a more ambitious work─this book may prove to be the very foundation for long-lasting peace."},{"name":"EHLLTOU","text":"For my part, I shall continue making deliveries to the Churning Mists, that my brothers and sisters there might be enticed to join their brethren here."},{"name":"SYSTEM","text":"Future requests will be selected at random from all those you have seen thus far, with the list refreshed once a week (Earth time)."},{"name":"SYSTEM","text":"You may review the items currently in demand at any time by speaking with Ehll Tou and selecting <span class=\"highlight\">Make a delivery</span>."},{"name":"SYSTEM","text":"Note that printing essentials, printing materials, and inkshells will earn you particularly handsome rewards. Whenever they make an appearance, the effort to procure them will be worth your while."},{"name":"SYSTEM","text":"A new quest is available from Hautdilong in the New Nest. "}],"reward":{"items":[{"num":3,"id":30481},{"num":3,"id":30482}]},"reqs":{"jobs":[{"lvl":70,"id":35}],"quests":[69425]},"next":[69427]},"partials":[{"type":"npc","id":"1033543","obj":{"i":1033543,"n":"Ehll Tou","l":3435,"q":2}},{"type":"npc","id":"1033922","obj":{"i":1033922,"n":"Ehll Tou","l":3435,"q":1}},{"type":"item","id":"30481","obj":{"i":30481,"n":"Crab Cakes","l":490,"c":24329,"t":46}},{"type":"item","id":"30482","obj":{"i":30482,"n":"Chili Crab","l":490,"c":24328,"t":46}},{"type":"quest","id":"69425","obj":{"i":69425,"n":"O Crafter, My Crafter","g":84,"l":"The Firmament","s":1002,"f":1}},{"type":"quest","id":"69427","obj":{"i":69427,"n":"On Ehll Tou's Wings","g":84,"l":"The Firmament","s":1004,"f":1}}]}