{"quest":{"name":"Levin an Impression","location":"East Shroud","id":69421,"patch":5.3,"sort":49,"icon":100253,"eventIcon":71201,"issuer":1009097,"target":1009097,"genre":2,"journal":["The serpent lieutenant looks about, seemingly awaiting a visitor.","Your conversation with the serpent lieutenant is quickly interrupted by the sylph Maxio, who cheerfully informs you that your fellow Scions have completed their investigation into the aetheric activity of the area. Follow him into the Sylphlands, that you might reconvene with your friends in advance of your meeting with the Lord of Levin.","As you venture into the Sylphlands, Maxio warns you to stay vigilant, as tempered sylphs and other dangers lurk at every turn. Follow him deeper into the woods in search of your companions.","Maxio stops suddenly along the path, confessing to you that he can go no further for fear of suffering the same fate as his tempered brethren. Thanking him for his service, you press on in search of your friends.","Despite─or perhaps because of─the touched sylphs' best efforts at causing a disturbance, the Scions have managed to collect aetheric readings throughout the Sylphlands. Based on the latest of these, Papalymo is convinced that he has identified the location of the summoning ritual. Head to the southeast, and investigate the area surrounding the sylphs' aetheryte.","Upon approaching the beastman aetheryte, you find yourself in the presence of Lord Ramuh. Though initially dismissive of your attempts at mediation, the primal elects to suspend judgment until you have undergone a trial by combat. Enter the Lord of Levin's domain, and prove your worth!<br><br>※The Striking Tree (Hard) can be accessed via the Duty Finder.","You have defeated the Lord of Levin, and thus earned the right to champion the cause of peace in the Black Shroud. After witnessing your battle with the primal, it appears that Urianger has also found that which he sought...","Return to Little Solace and make your report to the serpent lieutenant.","You inform the Twin Adder lieutenant of your encounter with─and subsequent victory over─the primal Ramuh. His shock at the news that your audience culminated in combat soon gives way to joy as he realizes the ramifications of your deed for both Gridania and Little Solace."],"objectives":["Speak with Maxio.","Speak with Maxio again.","Search for the Scions.","Investigate the area around the beastman aetheryte in the Sylphlands.","Confront Ramuh at the Striking Tree (Hard).","Report to the serpent lieutenant in Little Solace."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"LIEUTENANT01448","text":"I was told that a messenger would be sent as soon as your fellow Scions finished their investigation. I do not imagine it will be much longer."},{"name":"MAXIO","text":"This one returns, and returns with good tidings! Wise ones have finished searching, and have wisely identified the precise location where the touched ones summoned Lord Ramuh!"},{"name":"LIEUTENANT01448","text":"Your timing is impeccable, my fluttery friend! Might you be so kind as to escort this good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> fellow Scions?"},{"name":"MAXIO","text":"It would be this one's pleasure, walking one. Please, please come with this one!"},{"name":"LIEUTENANT01448","text":"We are counting on you, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>! Be safe, and godsspeed!"},{"name":"MAXIO","text":"Wise ones have ventured deep, deep within the Sylphlands. These ones must proceed carefully, and keep an eye out for touched ones."},{"name":"MAXIO","text":"This one is most sorry, but this one can go no further. Draw too close to Lord Ramuh, and this one may turn mean and nasty like touched ones!"},{"name":"MAXIO","text":"And so this one must say farewell for now. Walking one will find wise ones not far from here, to the south. Go in safety, walking one."},{"name":"THANCRED","text":"Ah, there you are. It <span class=\"emphasis\">is</span> you, isn't it?"},{"name":"YDA","text":"Sooo...Thancred is Thancred, Papalymo is Papalymo, Y'shtola is Y'shtola, and you are you, right? Well, that's easy enough to remember. This one's name is Yda, in case walking one was wondering.<br>...JOKE! I'm joking!"},{"name":"YSHTOLA","text":"...Don't ask. Suffice it to say that we had something of a situation here."},{"name":"PAPALYMO","text":"...So it's actually you. I am relieved. For a moment, I thought we were dealing with another one of those confounded sylph tricksters."},{"name":"PAPALYMO","text":"I swear, with them wreaking havoc with their skin-changing magicks, it's a wonder I was able to finish taking my measurements."},{"name":"PAPALYMO","text":"Yes, it was quite the ordeal. You should have seen the look on Y'shtola's face when the one impersonating <span class=\"emphasis\">you</span> suddenly showed up..."},{"name":"YSHTOLA","text":"...That's quite enough, Papalymo."},{"name":"PAPALYMO","text":"...Ahem. My apologies. It's not like me to ramble so."},{"name":"PAPALYMO","text":"At any rate, as I was saying, I have finished measuring aetheric activity in the area, and am pleased to say I have reached an indisputable conclusion─to wit, that Ramuh was called forth in the vicinity of the sylphs' aetheryte!"},{"name":"PAPALYMO","text":"Come, <span class=\"highlight\">Forename</span>. The Lord of Levin awaits!"},{"name":"LIEUTENANT01448","text":"<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>, you have returned! Dare I ask how Ramuh received your visit?"},{"name":"LIEUTENANT01448","text":"...He challenged you to a test of arms!? It is well, then, that you have some experience in such matters!"},{"name":"LIEUTENANT01448","text":"The peoples of both Gridania and Little Solace will be relieved to hear that the Lord of Levin has accepted you as the forest's champion of peace."},{"name":"LIEUTENANT01448","text":"You have performed a monumental duty this day, <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"highlight\">Forename</span></span><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span></span>. The Elder Seedseer must be informed of your deeds at once!"}],"reward":{"gil":3008},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[66984]},"next":[66989]},"partials":[{"type":"npc","id":"1009097","obj":{"i":1009097,"n":"Serpent Lieutenant","l":55,"q":4}},{"type":"quest","id":"66984","obj":{"i":66984,"n":"Lord of Levin","g":2,"l":"The Rising Stones","s":45}},{"type":"quest","id":"66989","obj":{"i":66989,"n":"What Little Gods Are Made Of","g":2,"l":"East Shroud","s":50}}]}