{"quest":{"name":"Aether on Demand","location":"The Rising Stones","id":69424,"patch":5.3,"sort":81,"icon":100367,"eventIcon":71201,"issuer":1010858,"target":1006646,"genre":2,"journal":["Alphinaud has a message from Moenbryda for the Scions.","You speak with Alphinaud, and the young commander of the Crystal Braves mentions Moenbryda's request for the Scions to assemble in the solar. Find Moenbryda within the Rising Stones, and let her know that your business with the Ishgardians is concluded.","You have located the Roegadyn scholar and informed her that her requested meeting may now take place. Make your way to the solar and speak with Moenbryda once more.","Moenbryda reveals that she has formulated a means of producing the staggering amount of aether required to destroy a captured Ascian soul─namely, by siphoning energy from the corrupted crystals found across Eorzea. It is at this point in her presentation that Alphinaud arrives and suggests that she conduct her experiments in northern Thanalan, where such crystal formations are bountiful yet not too closely grouped. He soon adds, however, that the imperial forces in the area are seeking to ransack the resources of the Ceruleum Processing Plant. With a knowing smile, Alphinaud laments that Moenbryda's experiments will be nigh impossible to perform without the Scions first cooperating with the Crystal Braves to defeat the Garlean threat. Speak with Alphinaud at the Rising Stones to learn more about your role in defending the processing plant from the advancing imperial soldiers.","Alphinaud has bid you rendezvous with the 4th in northern Thanalan while he moves to take command of the Crystal Braves stationed in Ul'dah. As you make to depart, you encounter Hoary Boulder and Coultenet, who have been charged with escorting F'lhaminn during her efforts to recruit her influential Ul'dahn acquaintances to the Scions' cause. It seems that the call of duty shall once more empty the Rising Stones of Eorzea's stalwart defenders. Travel to the Ceruleum Processing Plant and report to Wilred.","Wilred welcomes your presence at the plant, as there have been reports of troubling movements among the imperial army of late. He asks that you report to Lieutenant Edelstein and inquire as to how you might best lend your talents to the operation.","Lieutenant Edelstein appears elated at your presence, but his mood quickly turns sour as he relates to you the news of how several imperial explosive devices have been discovered within the perimeter of the plant. Though he believes that the Flames will be able to neutralize the threat, he has received disturbing reconnaissance concerning the Garlean troops, and would once again call upon your aid."],"objectives":["Speak with Moenbryda.","Speak with Moenbryda once more.","Speak with Alphinaud.","Speak with Wilred at the Ceruleum Processing Plant.","Report to Edelstein."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the current main scenario quest. Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"ALPHINAUD","text":"Ere I forget, I believe Moenbryda has requested a gathering of the Scions. I assume there has been some progress concerning our efforts to combat the Ascians."},{"name":"ALPHINAUD","text":"Pray inform her that our business with the Ishgardians is concluded for the moment─I shall be along once I've completed my communications with the Crystal Braves."},{"name":"ALPHINAUD","text":"Would you be so kind as to inform Moenbryda that our Ishgardian visitor has departed? I must speak with the Crystal Braves, then I shall join you all forthwith."},{"name":"MOENBRYDA","text":"All done with your talk of dragons? Wonderful, because Ascians are next on the menu! Let's head into the solar, shall we?"},{"name":"YDA","text":"I'm telling you, Thancred: keep pestering Moenbryda and the only thing you'll become intimate with is her axe..."},{"name":"PAPALYMO","text":"There have been no reports of suspicious masked men in Gridania, that is certain. Mayhaps they weave their dark plots in other lands?"},{"name":"THANCRED","text":"Such statuesque beauty─and possessed of a mind for research to match her belly for hard liquor! What does a woman of so many charms see in musty old Urianger...?"},{"name":"YSHTOLA","text":"I keep my senses strained for signs of Ascian activity, but there is little news to be had."},{"name":"YSHTOLA","text":"Have their schemes reached some critical step? This silence is most disturbing..."},{"name":"MINFILIA","text":"I've summoned everyone to the solar. 'Twould seem Moenbryda has something exciting to share with us."},{"name":"ALPHINAUD","text":"Of all our adversaries, the Ascians could well be considered the most dangerous. I do hope Moenbryda's research has borne fruit..."},{"name":"TATARU","text":"For a small organization, we certainly chew through a prodigious amount of foodstuffs. Perhaps I should put a lock on the larder door..."},{"name":"HIGIRI","text":"We do seem to be running low on provisions. I believe an excursion to the marketplace is in order."},{"name":"FLHAMINN","text":"I see that the Scions once more ready themselves for the road. I, too, must make preparations for an absence from the Rising Stones..."},{"name":"HOARYBOULDER","text":"It seems you have barely arrived before you must once more plunge into the fray. Duty is an unforgiving mistress, eh? Though the tasks we tackle are not like to be as realm-shaking, Coultenet and I must also heed her call."},{"name":"COULTENET","text":"Hoary was most eager to join you on the front lines of battle, but, as fate would have it, the Antecedent had other plans for our talents."},{"name":"MINFILIA","text":"Though I have little doubt you will prevail against the Empire's forces, I shall pray for your success nonetheless. Our very future may depend upon Moenbryda being free to pursue her experiments."},{"name":"ALPHINAUD","text":"'Twould seem that events have once more conspired to rob us of rest and recuperation. Though I would wish it otherwise, I must ask that you head straightaway to the processing plant."},{"name":"ALPHINAUD","text":"The 4th have already deployed to the area, and await the arrival of the Scions. Wilred will brief you on the developing situation."},{"name":"ALPHINAUD","text":"Meanwhile, I must rendezvous with Captain Ilberd at our headquarters in Ul'dah. I shall take command of our forces there with a lighter heart, knowing that you go to support the front lines."},{"name":"HOARYBOULDER","text":"Your duties take you to northern Thanalan, do they not?"},{"name":"COULTENET","text":"We, too, must say our farewells to the Rising Stones for a time. F'lhaminn travels to Ul'dah, and we shall serve as her escort."},{"name":"FLHAMINN","text":"At my daughter's behest, I go to contact certain old acquaintances in the gilded city."},{"name":"FLHAMINN","text":"We are beset on all sides by civil unrest and imperial machinations, threatened by primals and troubled by dragons─we need all the allies we can muster."},{"name":"FLHAMINN","text":"Many of my friends hold positions of power, you see, and it is my hope that they can be convinced to aid the Scions' cause."},{"name":"FLHAMINN","text":"If past events have taught us anything, then we know that Eorzea <span class=\"emphasis\">must</span> present a united front or we shall fall..."},{"name":"FLHAMINN","text":"Ah, how extraordinary that my little Ascilia is involved in such far-reaching affairs."},{"name":"FLHAMINN","text":"I am proud that I might now stand at her side not only as a mother, but also as a colleague."},{"name":"COULTENET","text":"A colleague with influential connections! But I fear that Ul'dah has become a place of danger even for one so familiar with her streets."},{"name":"HOARYBOULDER","text":"Bah! Woe betide the blackguard that so much as glares in your direction, milady!"},{"name":"FLHAMINN","text":"Ahaha, I shall be well protected, it seems."},{"name":"COULTENET","text":"Shall we be on our way, then?"},{"name":"ALIANNE","text":"'Tis unsettling to think that an enemy base lies but a brief stroll beyond these walls..."},{"name":"WILRED","text":"Commander Leveilleur sent word that you'd be coming─a veteran of your talents is most welcome."},{"name":"WILRED","text":"Not that I don't think we can handle the situation, mind you! I've learned a trick or two since that disaster with the Amalj'aa."},{"name":"WILRED","text":"But returning to the task at hand..."},{"name":"WILRED","text":"The Flames' reconnaissance scouts have reported imperial soldiers assembling at Raubahn's Push. Such a force is likely interested in only one thing: getting their hands on the resources found here at the processing plant."},{"name":"WILRED","text":"The Garleans could begin marching on us at any time. Pray speak with Lieutenant Edelstein, that we might coordinate our counter strategy."},{"name":"WILRED","text":"In the meantime, I will inform the others that you have arrived. No doubt it will be welcome tidings."},{"name":"EDELSTEIN","text":"[GC Rank][GC Rank][GC Rank] <span class=\"highlight\">Surname</span>! My soldiers yet tell tales of your deeds during Operation Archon!"},{"name":"EDELSTEIN","text":"Would that we could sit a while and reminisce about old times...but I fear more pressing matters require our attention. The civilian draughtsmen, you see, have come across several highly suspicious crates within the boundaries of the processing plant."},{"name":"EDELSTEIN","text":"I had my sappers take a closer look, and our worst fears were confirmed─these boxes contain powerful explosive devices. Devices of imperial design, no less."},{"name":"EDELSTEIN","text":"By my order, the Flames stationed here are conducting a thorough sweep of the compound as we speak."},{"name":"EDELSTEIN","text":"Though it troubles me that we were unable to apprehend the imperial spy behind this, I have faith that our men will be able to neutralize the threat for now."},{"name":"EDELSTEIN","text":"In the meantime, our scouts bring troubling news on the latest movements of the imperial army. I would once again ask for your aid."},{"name":"MINFILIA","text":"（★未使用／削除予定★）"}],"reward":{"gil":1019},"reqs":{"jobs":[{"lvl":50,"id":142}],"quests":[65902]},"next":[65904]},"partials":[{"type":"npc","id":"1010858","obj":{"i":1010858,"n":"Alphinaud","l":481,"q":2}},{"type":"npc","id":"1006646","obj":{"i":1006646,"n":"Edelstein","l":46,"q":8,"t":"Flame Lieutenant"}},{"type":"quest","id":"65902","obj":{"i":65902,"n":"The Rising Chorus","g":2,"l":"The Rising Stones","s":80}},{"type":"quest","id":"65904","obj":{"i":65904,"n":"On the Counteroffensive","g":2,"l":"Northern Thanalan","s":82}}]}