{"quest":{"name":"O Crafter, My Crafter","location":"The Firmament","id":69425,"patch":5.3,"sort":1002,"unlocksFunction":1,"eventIcon":71341,"issuer":1032786,"target":1033543,"genre":84,"journal":["Ehll Tou is full to bursting with newfound knowledge─knowledge which she simply must share."],"objectives":["Speak with crafters in the Firmament.","Speak with Ehll Tou.","Speak with Arvide.","Speak with Ehll Tou."],"dialogue":[{"name":"EHLLTOU","text":"Ah, I've been waiting for you! Who better to tell of my studies than the very <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who set me on the course to enlightenment? My knowledge of mankind's histories has grown by leaps and bounds, in no small part thanks to Hautdilong's expert instruction."},{"name":"HAUTDLONG","text":"Ehll Tou is too kind. She has told me so much of dragonkind in turn that I could hardly call myself the teacher in this arrangement. In fact, the time may soon come to put ink to parchment and begin my chronicles!"},{"name":"EHLLTOU","text":"And we all await that day with bated breath! Hautdilong has not been my only teacher─the city itself has lessons abound for those who would observe them. Seeing its splendor with my own eyes has made clear one inalienable difference between man and dragon."},{"name":"EHLLTOU","text":"I speak, of course, of your kind's love of tinkering, building, and crafting! And what a wonderful thing it is to behold!"},{"name":"EHLLTOU","text":"Where dragons are wont to tear down obstacles with fang and claw, you tear them down with hammer and chisel, or else find an ingenious way around them entirely! By using tools tailored to specific tasks, you overcome your...natural deficiencies."},{"name":"EHLLTOU","text":"One tool will be used to wrest precious materials from the earth, and another to transform them into something greater than the sum of its parts! I find the whole process rather fascinating."},{"name":"EHLLTOU","text":"When I gaze upon the towering spires of this city, I imagine a roost built with my own claws, larger even than the one my sire calls home!"},{"name":"EHLLTOU","text":"I am eager to see my dream realized as quickly as possible, but Hautdilong advises against rushing in to such an endeavor unprepared. He claims that to do so would lead to abject failure and possibly personal injury."},{"name":"EHLLTOU","text":"You, however, are an experienced artisan, and I would be honored if you were to take me under your wing and teach me the art of making!"},{"name":"EHLLTOU","text":"I swear to be a dutiful study, and even should this day pass into the next, I won't rest until I've mastered even the most esoteric of skills. Well then, I believe we have an agreement! I can start right this moment, if it pleases you."},{"name":"HAUTDLONG","text":"Now, now, Ehll Tou, you know as well as anyone how busy our friend is. And I also fear you may have misjudged just how long it takes to truly become a master craftsman."},{"name":"EHLLTOU","text":"You mean it will take more than a day!? Ahem. I knew that, of course. I had only hoped against hope that <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> had no appointments to save the world for the foreseeable future. Alas, my enthusiasm may have gotten the better of me..."},{"name":"HAUTDLONG","text":"Don't fret, Ehll Tou. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> may still be able to help in some capacity. Perhaps if you could introduce us to a crafter with both the time and inclination to teach?"},{"name":"HAUTDLONG","text":"I expect that one of the many artisans around the Firmament would be willing to lend us their expertise. Although you are in a far better position to judge their suitability than either of us. We shall look forward to meeting our mentor-to-be!"},{"name":"EHLLTOU","text":"I suppose there are countless others who are more deserving of your attention than me..."},{"name":"HAUTDLONG","text":"If it's not too much trouble, perhaps you could introduce Ehll Tou and I to a crafter who is willing to pass down their knowledge."},{"name":"HAUTDLONG","text":"Ehll Tou holds your opinion in high regard, and I'm sure she would take to any teacher who had your seal of approval."},{"name":"HWDCRAFTER03889","text":"Say again? That scrawny little dragonling wants to craft? Hah, whatever next!"},{"name":"HWDCRAFTER03889","text":"As much as the notion of having a dragon for a protégé piques my interest, however, my specialty is working metal. Great, big slabs of it. Were she older, maybe there'd be a place for her, but as it stands, she'd be more of a hindrance than a help..."},{"name":"HWDGATHERER03889","text":"Oh, a crafter? My apologies, but I'm more inclined to gathering what bounty the earth has to offer─I leave it to others to mold said bounty into what they will. I'd love to introduce you to someone who might be of help, but I'm afraid my work here is endless..."},{"name":"ARVIDE","text":"(-Skysteel Engineer-)Aye, I know the dragonet you speak of. I've seen her flitting about House Haillenarte from time to time. Quite the inquisitive one, if I recall. So she wants to learn the fine art of crafting, does she?"},{"name":"ARVIDE","text":"(-Skysteel Engineer-)I've heard strange things in my time, but few as bizarre as that. Hmm... I'm sure I'd kick myself later if I passed up this opportunity, so I reckon I could find time between projects to teach her a thing or two. Tell her I'll speak with her after I've finished up here, will you?"},{"name":"HWDCRAFTER03889","text":"Your dragonling seems eager enough, but she won't be lifting much of anything with those puny wings of hers. Terribly sorry I can't help you out."},{"name":"HWDGATHERER03889","text":"While I certainly know many able craftsmen, I'm afraid I cannot count myself as one. I'd introduce you, but you see, there is just so much to be done."},{"name":"ARVIDE","text":"(-Skysteel Engineer-)I'll go speak with this dragonet of yours soon enough. I just need a little time to finish things up here."},{"name":"HAUTDLONG","text":"How goes your search for our future mentor?"},{"name":"EHLLTOU","text":"Ah, the hero is returned! So, have you found my teacher? Whose sharp eye and steady hand will guide me on the path to mastery?"},{"name":"ARVIDE","text":"(-???-)Ah, such great expectations I must meet."},{"name":"ARVIDE","text":"(-Skysteel Engineer-)While I assure you my hand is steady, the sharpness of my eye is very much a matter of conjecture. Nevertheless, if it's crafting you wish to learn, I'm your man. Although I can't say I've ever had the honor of teaching a dragon before."},{"name":"ARVIDE","text":"Anyroad, I'm Arvide, at your service. I'm here in the Firmament on assignment from the Skysteel Manufactory, and I daresay I have a few nuggets of wisdom knocking around in my head that're worth passing around."},{"name":"ARVIDE","text":"It's the young who must shoulder the burden of building the future, after all. Now, crafters come in all sorts, from cooks to weavers to smiths. Have you given any thought to where you want to focus your energies?"},{"name":"EHLLTOU","text":"Focus? Well... Hmm. Can't I learn everything?"},{"name":"HAUTDLONG","text":" Tell us, <span class=\"highlight\">Forename</span>, where should an aspiring artisan begin?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Be it baking a cake or raising a castle, one must look first to their tools."},{"name":"A1","text":"Even the simplest project must start with quality materials."},{"name":"A1","text":"Why bother learning when you can just copy others?"},{"name":"ARVIDE","text":"Ah, spoken like a true professional! 'Tis true that an essential part of any project is selecting the right tools for the job. However, there's a step that comes even before that."},{"name":"ARVIDE","text":"Ah, spoken like a true professional! Aye, I can't gainsay that. A project is doomed to failure from the start if the materials aren't up to snuff."},{"name":"ARVIDE","text":"And just who are you suggesting she copy, eh? Me? Come now, don't go filling her head with misguided notions─there'll be no shortcuts here."},{"name":"ARVIDE","text":"For now, let's start with the tools required to gather our own materials. Once you have the right equipment and supplies, there's nothing you can't make with enough elbow grease."},{"name":"EHLLTOU","text":"Oh, how splendid it is to have a guiding hand! There's no telling how long it would've taken Hautdilong and I to decide where to begin had we been left to our own devices. Very well, gathering is where we shall pour our utmost efforts."},{"name":"EHLLTOU","text":"Mayhap when I'm a seasoned artisan in my own right, I'll take it upon myself to teach my kin as I was taught."},{"name":"HAUTDLONG","text":"Now wouldn't that be a sight to see! I daresay there has never been a dragon who has learned a trade, let alone one who has passed such skills on to the next generation!"},{"name":"EHLLTOU","text":"Indeed, you may be correct on that count! The other dragons will be flabbergasted by the wonders I create!"},{"name":"EHLLTOU","text":"Of course, I don't plan on taking all the credit. It seems to me that mankind's most culturally significant works are those that result from collaboration─of people working together to make something greater than they could have alone. "},{"name":"EHLLTOU","text":"To that end, I must study and learn from the works of others, and even though you are too busy with your heroics to teach me daily, I would much appreciate if you would come by from time to time and offer what knowledge you can."},{"name":"EHLLTOU","text":"Magnificent! I knew your generosity would match the greatness of your deeds."},{"name":"ARVIDE","text":"Well then, let's get your education started off on the right foot, eh? You can spy tradesmen of all sorts plying their trade at the New Nest─I reckon you could certainly do worse than to learn a couple of tricks from them."},{"name":"EHLLTOU","text":"Ah, the place is practically a second home to young Hautdilong and I. Allow me to lead the way!"},{"name":"EHLLTOU","text":"I remember going to the New Nest with Master Marcelloix when I first arrived in the city."},{"name":"HAUTDLONG","text":"Who's that? Is she here to help us?"},{"name":"ARVIDE","text":"This here is Anna, and we have her and the House of Splendors to thank for supplying the Firmament with quality materials at incredibly low prices. Suspiciously so, in fact..."},{"name":"ANNA","text":"Are you implying there is some ulterior motive behind our generosity? Why, certainly not! I'm here at the behest of my organization to aid Ishgard in its fledgling days as an allied nation. We are driven as much by philanthropy as we are by profit, I can assure you!"},{"name":"EHLLTOU","text":"Excuse me, miss, but are you a craftswoman, by any chance?"},{"name":"ANNA","text":"I'm afraid, my adorable little dragonet, that my hands are entirely too clumsy to make aught aside from my morning tea. The Twelve have seen fit to bless me with a sharp mind for trade, however, and so here I am."},{"name":"ARVIDE","text":"And that's precisely why we've come. Ehll Tou has it in her head to learn a trade or two, and we are here to set her on the right path. To that end, I would ask you to provide us with materials, and perhaps any counsel you might afford a young novice."},{"name":"ANNA","text":"It would be my pleasure. Perhaps in return, she could tell me about the rarities and relics dragons keep in their lairs. I sense a once-in-a-lifetime investment opportunity has come before me..."},{"name":"ANNA","text":"And if business in the Firmament grows as much as my intuition says it will, this might be just what I require to turn a stream of gil into a veritable flood of riches...!"},{"name":"ANNA","text":"Consider me at your complete disposal─say the word and I shall procure whatever you may need!"},{"name":"HAUTDLONG","text":"How generous of you! You have our thanks, Miss Anna!"},{"name":"ANNA","text":"Anything to foster the next generation of builders and tinkerers, my boy. As for the <span class=\"emphasis\">current</span> generation, well, I suppose the House could bear to part with a few scrips in return for guiding our dragonet friend on her journey to mastery. "},{"name":"ARVIDE","text":"We can't say no to an offer like that, can we? Well then, now that we're all acquainted, let's head back to Saint Roelle's Dais."},{"name":"ARVIDE","text":"That Anna's quite the shrewd businesswoman, but she's true to her word. I know that much. "},{"name":"HAUTDLONG","text":"With you and Arvide at her side, I'm sure Ehll Tou's dream will become a reality."},{"name":"ANNA","text":"At last, a reversal of fortunes! These days spent in the numbing cold hawking trinkets for a pittance won't have been for naught! Just a little longer..."},{"name":"EHLLTOU","text":"With Master Arvide and Master <span class=\"highlight\">Forename</span> guiding us, I'm sure we'll be raising fortresses and forging dazzling suits of armor in no time at all!"},{"name":"ARVIDE","text":"Let's keep our ambitions manageable for the time being, shall we? Our first task is the construction of tools that'll fit snugly in those claws of yours. <span class=\"highlight\">Forename</span>, I trust you can help with that."},{"name":"ARVIDE","text":"In the meantime, I've work of my own to attend to. If there's aught you need, you know where I am. Before I depart, however, I'll leave you with an assignment: inspect everything <span class=\"highlight\">Forename</span> does with diligence. A discerning eye is a tool that will outlast all others."},{"name":"EHLLTOU","text":"Yes, Master Arvide!"},{"name":"HAUTDLONG","text":"We'll give <span class=\"highlight\">Forename</span>'s work the thrice over!"}],"reward":{"items":[{"num":5,"id":28720},{"num":5,"id":28721}]},"reqs":{"jobs":[{"lvl":70,"id":35}],"questsType":"all","quests":[69373,67634]},"next":[69426]},"partials":[{"type":"npc","id":"1032786","obj":{"i":1032786,"n":"Ehll Tou","l":3435,"q":2}},{"type":"npc","id":"1033543","obj":{"i":1033543,"n":"Ehll Tou","l":3435,"q":2}},{"type":"item","id":"28720","obj":{"i":28720,"n":"Mejillones al Ajillo","l":460,"c":24326,"t":46}},{"type":"item","id":"28721","obj":{"i":28721,"n":"Arros Negre","l":460,"c":24032,"t":46}},{"type":"quest","id":"69373","obj":{"i":69373,"n":"If Songs Had Wings","g":84,"l":"The Firmament","s":1001,"f":1}},{"type":"quest","id":"67634","obj":{"i":67634,"n":"Go West, Craftsman","g":95,"l":"Mor Dhona","s":600,"f":1}},{"type":"quest","id":"69426","obj":{"i":69426,"n":"An Ode to Unity","g":84,"l":"The Firmament","s":1003,"f":1}}]}