{"quest":{"name":"Clean Beard, Clear Mind","location":"Lakeland","id":69439,"patch":5.3,"sort":102,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"usedItems":[31148,31149],"journal":["Regitt seems perturbed by the condition of his beard.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the dwarven procurer at Fort Jobb.","The dwarven procurer has tasked you with crafting two grooming kits, then delivering the completed items to Regitt."],"objectives":["Speak with the dwarven procurer at Fort Jobb.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Regitt</span></span>."],"dialogue":[{"name":"REGITT","text":"Considering the nature of our work, it's unavoidable that the Anvil accumulates its fair share of oil and grime. But as we labor away at our tasks, all that filth finds its way into our whiskers!"},{"name":"REGITT","text":"A dwarf can't be expected to concentrate while his beard resembles a cotton boll dragged through a puddle of mud! And the worst of it is, we're always running low on grooming supplies!"},{"name":"REGITT","text":"I need you to find our procurer over at Fort Jobb, and help him stock up on beardcare essentials. This is an emergency!"},{"name":"AUTOMATON03903","text":"&lt;blip&gt; &lt;buzz&gt;"},{"name":"DAILYDWARF03903","text":"Lali-ho! Regitt getting impatient, is he? Well, the Fort Jobb folk just traded me a bundle of choice materials, so you can get straight to crafting."},{"name":"DAILYDWARF03903","text":"Here, see if you can't use something in that lot to forge two pairs of trimming scissors. The Mechatoad has more bits and bobs in reserve should you need them."},{"name":"DAILYDWARF03903","text":"Here, see if you can't use something in that lot to make a couple of grooming brushes. The Mechatoad has more bits and bobs in reserve should you need them."},{"name":"DAILYDWARF03903","text":"Here, see if you can't use something in that lot to mix up a couple of jars of styling cream. The Mechatoad has more bits and bobs in reserve should you need them."},{"name":"DAILYDWARF03903","text":"Now, I was going to ask you to visit me when you're finished, but you might as well deliver those kits directly to Regitt. Hopefully I'll get the chance to groom my own beard once I get back!"},{"name":"DAILYDWARF03903","text":"Like I said, if you run out of materials, just tap on the Mechatoad here. Oooh, I can feel my beard bristling with anticipation!"},{"name":"DAILYDWARF03903","text":"Like I said, if you run out of materials, just tap on the Mechatoad here. Oooh, I can feel my beard bristling with anticipation!"},{"name":"DAILYDWARF03903","text":"Like I said, if you run out of ingredients, just tap on the Mechatoad here. Oooh, I can feel my beard bristling with anticipation!"},{"name":"AUTOMATON03903","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON03903","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON03903","text":"&lt;beep&gt; Ingredients detected. Request denied."},{"name":"AUTOMATON03903","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON03903","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON03903","text":"&lt;beep&gt; Request for ingredients acknowledged."},{"name":"DAILYDWARF03903","text":"You have those grooming goods ready? Go ahead and run them over to Regitt at the Anvil!"},{"name":"REGITT","text":"There you are! Any luck with those beardcare supplies?"},{"name":"REGITT","text":"Lali-ho-ho-ho! Aye, this'll help turn my whiskers back into the lush, silky strands they were meant to be! No more hair-based distractions for me!"},{"name":"REGITT","text":"&lt;sigh&gt; ...Back on Kholusia, we had all the time in the world to care for our beards. Since we set up our workshop here, though, grooming has taken second place to all this frenzied tank business..."},{"name":"REGITT","text":"Still, even if our beards do look a bit bedraggled, it's because of how hard we've been working!"}],"reward":{"gil":606,"reputation":60,"items":[{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":8},{"id":28188},{"num":25,"id":9},{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":11},{"id":28188},{"num":25,"id":12},{"id":28188},{"num":25,"id":13},{"id":28188},{"num":25,"id":8}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}},{"type":"item","id":"31148","obj":{"i":31148,"n":"Grooming Kit Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"31149","obj":{"i":31149,"n":"Grooming Kit","l":290,"c":21005,"t":61}}]}