{"quest":{"name":"Tanks for the Memory","location":"Lakeland","id":69437,"patch":5.3,"sort":6,"icon":101000,"beast":14,"unlocksFunction":1,"eventIcon":71341,"issuer":1033710,"target":1033710,"genre":60,"journal":["Ronitt looks primed to fire a particularly cheery dwarven greeting in your general direction.","Following the roaring success of the Rolling Tankards, Ronitt is planning to host a small gathering of those who have contributed to Watts's Anvil. Rather than asking you to visit the far reaches of Norvrandt, extending personal invitations to each guest one by one, he saves you the trouble by volunteering to do the legwork himself, and asks only that you wait for him in Clearmelt with Lorathia.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","The guests arrive and are plied with Norvrandt's finest cuisine, while those partial to ale drink far more than is sensible. Regitt and Karutt offer some slurred words of gratitude and say their farewells before they can sully the clear waters of Clearmelt with the contents of their stomachs.","Eueliss and Sai-Lewq express their thanks to you and Ronitt for helping to restore Wright to some semblance of its former glory. Due to your efforts, their fields are capable of producing the barley used in their traditional ale. Now their first batch in years has been successfully brewed, allowing them to share the fruits of their labors, which certain guests have been imbibing rather liberally.","Ozogg reveals that you have inspired her to lead her own life, free from the rules and traditions of the Gogg. In a quite literally bare-faced display of defiance, she removes her helmet, and in so doing makes herself an outcast from her village. Though she pledges her allegiance to Watts's Anvil, she is more determined than ever to outdo Ronitt and claim the heirloom of their shared ancestor.","Upon returning to Watts's Anvil, Ronitt makes no attempt to conceal his distaste at what he considers the utmost indecency on the part of Ozogg, an act viewed with scorn by Tholl and Gogg alike. Nevertheless, it seems their destinies are intrinsically entwined as their mutual rivalry spurs them to push the boundaries of dwarven engineering. The citizens of Norvrandt, meanwhile, stand to benefit a great deal as a result of this friendly competition."],"objectives":["Speak with Lorathia.","Speak with Eueliss.","Speak with Ozogg.","Speak with Ronitt."],"dialogue":[{"name":"RONITT","text":"Just who I was hopin' to see!"},{"name":"RONITT","text":"Lali-ho to you, <span class=\"highlight\">Forename</span>!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Lali-ho!"},{"name":"A1","text":"Hi-ho!"},{"name":"A1","text":"Rh-Rhallie-who...?"},{"name":"RONITT","text":"Haha! A fine lali-ho if ever I heard one!"},{"name":"RONITT","text":"Hmm... Nah, I don't think that'll catch on, mate. I'd stick to a good old-fashioned “lali-ho” if I were you. But I'm glad you're here, all the same!"},{"name":"RONITT","text":"Ha! Don't tell me your head's gettin' soft in your old age! Or maybe you're just pullin' my leg? Either way, it's great to see you!"},{"name":"RONITT","text":"Since the last time we spoke, we've been busier than ever. Our first payin' customers, Iriolva and Cobleva, have already started usin' Rollin' Tankards to ferry their goods about."},{"name":"RONITT","text":"So far, there've been no reports of any horrendous accidents or anythin', which is a relief."},{"name":"RONITT","text":"We'll be aimin' for the same high level of quality for the rest of the tanks, and thanks to our new friends, word's been gettin' around fast."},{"name":"RONITT","text":"Orders have been flyin' in thick and fast! This is goin' better'n I dared dream!"},{"name":"RONITT","text":"This calls for a celebration!"},{"name":"RONITT","text":"'Course, it wouldn't be the same without all of the others, so I'll go an' round 'em up. In the meantime, why don't you go over to Clearmelt and wait with Lorathia?"},{"name":"LORATHIA","text":"Oh, I see you're the opposite of what they call “fashionably late.” Since you're here, you can help me get everything ready."},{"name":"RONITT","text":"Heh, I'm surprised you resisted the temptation to start diggin' in before we got here!"},{"name":"RONITT","text":"I bet you ain't never seen a feast like this! We've got the best grub Norvrandt has to offer. Eueliss and Sai-Lewq even brought a keg of their famous ale over from Wright!"},{"name":"RONITT","text":"\"But how did they carry somethin' so heavy all this way?“ I hear you cry."},{"name":"RONITT","text":"Yeah, that's right..."},{"name":"RONITT","text":"...by tank, of course!"},{"name":"LORATHIA","text":"Those things might be armed to the teeth with some of the world's most advanced weaponry, but it's what they carry that makes the real difference. People across the land can get what they need, when they need it."},{"name":"LORATHIA","text":"Not to mention a few of life's luxuries, too!"},{"name":"EUELISS","text":"It seems all of our hard work has finally paid off!"},{"name":"EUELISS","text":"To think that Wright is at long last able to produce its own ale again! Thanks to you and Ronitt, we've had the best barley crops in years."},{"name":"SAILEWQ","text":"Even our very first batch has earned the approval of our village's most demanding beer aficionados. And due to the much improved quality of the soil, we have begun growing our own fruit, the juice of which we've brought for the younger ones and teetotalers to enjoy."},{"name":"OZOGG","text":"All right everyone, it's time for a toast! So raise a tankard of ale, or tankard of juice if you're a mewling whelp like Ronitt─"},{"name":"RONITT","text":"Watch it, Ozogg, or you'll be wearin' that drink of yours!"},{"name":"RONITT","text":"Ahem! To the continued success of Watts's Anvil and all of our friends!"},{"name":"RONITT","text":"(-Everyone-)Cheers!"},{"name":"RONITT","text":"The years of struggle and adversity seem a distant memory to the inhabitants of the First as they strive for a better tomorrow."},{"name":"RONITT","text":"In particular, the dwarves of Kholusia will have a vital role to play in the days to come, with their ingenuity and diligence paving the way to unlimited possibilities."},{"name":"SYSTEM","text":"And even after the dishes were cleared away, the celebrations continued..."},{"name":"REGITT","text":"Shay there, <span class=\"alternative-container\"><span class=\"alternative\">missh</span><span class=\"alternative\">mishter</span></span>... You don't sheem drunk in the &lt;hic&gt; shlightesht."},{"name":"KARUTT","text":"&lt;hic&gt; I...w-would jusht l-like to shay... To shay..."},{"name":"KARUTT","text":"&lt;snore&gt;"},{"name":"REGITT","text":"Oi, Karutt! At leasht &lt;hic&gt; finish your shentence afore you fall ashleep!"},{"name":"REGITT","text":"I think...what he meansh ish...we all owe you our heartfelt thanksh, eshpecially Ronitt."},{"name":"KARUTT","text":"Afore you showed up, he wouldn't shay boo to a gooshe, but now, &lt;hic&gt; he's turned into a great leader! Musht be from following your &lt;hic&gt; example."},{"name":"REGITT","text":"We know you've got other people out there who &lt;hic&gt; need you, sho it would be shelfish to expect you to shtay, but we're grateful for the time you've &lt;hic&gt; shpent with ush."},{"name":"KARUTT","text":"It m-means &lt;hic&gt; a lot, it really does."},{"name":"REGITT","text":"And if you're ever passhing through, be sure to pay ush a visit!"},{"name":"KARUTT","text":"&lt;hic&gt; Anyway, w-we'd besht be heading b-back to the Anvil. &lt;hic&gt; Shafe travels!"},{"name":"REGITT","text":"Oh, and make sure you shay &lt;hic&gt; good-bye to Euelissh and Shai-Lewq afore you leave. They've been meaning to shpeak with you!"},{"name":"EUELISS","text":"Oh, there you are!"},{"name":"SAILEWQ","text":"Eueliss and I were just talking about you. We were wondering if the ale was to your liking, and then it occurred to me that you may not even drink in the first place."},{"name":"SAILEWQ","text":"Do you, ah, partake in the odd tipple?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"No, I never touch the stuff."},{"name":"A2","text":"I've been known to wet my whistle on occasion."},{"name":"A2","text":"You can't buy love, but you <span class=\"emphasis\">can</span> buy alcohol, which is better."},{"name":"SAILEWQ","text":"Then perhaps we have found another customer for our soon-to-be-famous fruit juice! And be sure to tell your friends!"},{"name":"SAILEWQ","text":"Yes, and no doubt the volume varying in accordance with the nature of said occasion! A happy one such as this calls for more than a mere sip or two, I daresay!"},{"name":"SAILEWQ","text":"Words to live by! Perhaps we can use that as our slogan?"},{"name":"EUELISS","text":"Can I say, Sai-Lewq, how wonderful it is to see you in such high spirits! You're like a changed man!"},{"name":"EUELISS","text":"A change we have you to thank for, <span class=\"highlight\">Forename</span>. Considering all you've done for us and our village, I cannot imagine how we will ever repay you, so if there is aught you need, just say the word!"},{"name":"SAILEWQ","text":"My sentiments exactly. I dread to think what would have become of us without your intervention."},{"name":"EUELISS","text":"Yes, and we owe a debt of gratitude to Master Ronitt, as well. Thanks to him and his automaton, my father's dream has at long last come true!"},{"name":"SAILEWQ","text":"If we take a leaf out of Ronitt's book by combining ingenuity with hard work, there is nothing we cannot achieve."},{"name":"EUELISS","text":"Maybe the next time you come to Wright, we'll have something new to show you. Our doors are always open, so don't be a stranger!"},{"name":"SAILEWQ","text":"Ah! I almost forgot to ask, but have you spoken with Ozogg? It seems there is something she would like to discuss with you."},{"name":"SAILEWQ","text":"I must say, this is quite the gathering!"},{"name":"OZOGG","text":"This ale from Wright really hits the spot!"},{"name":"RONITT","text":"Who does she think she is, callin' me a “mewlin' whelp”!? I don't even know what that means, but I assume it's an insult!"},{"name":"OZOGG","text":"Have you eaten your fill, <span class=\"highlight\">Forename</span>?"},{"name":"LORATHIA","text":"I'm sure <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> has room for some more. Have you tried these wrigglers from Amh Araeng? If you can pluck up the courage, they're quite delicious!"},{"name":"RONITT","text":"Yeah! I can't get enough of 'em!"},{"name":"OZOGG","text":"Urp... Just thinking about them is making me queasy."},{"name":"LORATHIA","text":"Come on, live a little! It's like I always say: youth is wasted on the young."},{"name":"OZOGG","text":"Yes, and it'll be even more of a waste if a gifted engineer like me chokes to death on some godsforsaken worm! I've got to look after myself if I want these plans of ours to come to fruition."},{"name":"RONITT","text":"Anyway, Lorathia, I'll bet your best years are still ahead of you. In fact, why don't you come and help out at Watts's Anvil? It's gotta be better'n drinkin' tea and soakin' in the hot springs all day!"},{"name":"LORATHIA","text":"When you get to my age, you'll learn to appreciate things like that, you mark my words! Still, it wouldn't do to let my skills get rusty. I suppose I could pop over and do a spot of welding from time to time."},{"name":"OZOGG","text":"Actually, <span class=\"highlight\">Forename</span>, there's something I want to say to you."},{"name":"OZOGG","text":"For most of my life, I've been living according to others' expectations, without thinking about what <span class=\"emphasis\">I</span> want. But thanks to you, I've made up my mind!"},{"name":"OZOGG","text":"Like you, I'm going to pursue my own goals, my own dreams. That's why I've decided to carry on here, where I can express myself and be who I want to be."},{"name":"OZOGG","text":"Rather than wasting my life being bound by traditions and rules, I want to be free to go where I please and <span class=\"emphasis\">do</span> as I please."},{"name":"LORATHIA","text":"But don't you want to go back to your village? All the Tholls here have permission to travel between Tomra and the Anvil whenever they want. What about you?"},{"name":"OZOGG","text":"Well, it's not as though I've been banished. Not yet, anyway."},{"name":"OZOGG","text":"I can hardly go back to Komra now, can I?"},{"name":"OZOGG","text":"From this day forth, I am no longer a Gogg! I shall live only as Ozogg, descendant of Watts himself. I answer to no one!"},{"name":"RONITT","text":"B-But...you..."},{"name":"RONITT","text":"You can't just take off your helmet like that! I-It's...indecent!"},{"name":"LORATHIA","text":"Hahaha! I think he's just getting flustered by the sight of a pretty girl!"},{"name":"OZOGG","text":"Ahahaha! How can he expect to beat me in a battle of wits if he turns into a babbling buffoon every time I take my helmet off? Watts's hammer is as good as mine!"},{"name":"OZOGG","text":"That reminds me, I should get started on my next creation and prove my superiority once and for all! Time to head back to the Anvil!"},{"name":"LORATHIA","text":"And it looks like I might be joining you sooner rather than later."},{"name":"LORATHIA","text":"You young'uns have brought me some much-needed excitement, and I can't wait to see what you'll come up with next."},{"name":"LORATHIA","text":"When I heard they were bringing worms over from Amh Araeng for us to eat, I thought they'd gone barmy. But having tasted them, I can see the appeal!"},{"name":"EUELISS","text":"While we'll be taking it one step at a time, if we continue our efforts, Wright will go from strength to strength!"},{"name":"SAILEWQ","text":"If only our dearly departed were here with us now... I should like to think they are watching over us even at this very moment."},{"name":"LORATHIA","text":"This certainly makes a difference from the usual crowd we have here at Clearmelt!"},{"name":"RONITT","text":"That Ozogg! Ain't she got no shame!? Just because she don't wanna go back to Komra, there's no need to...to...expose herself like that!"},{"name":"RONITT","text":"I know you ain't a Tholl or a Gogg, so I don't expect you to understand, but you agree with me, don't you?"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"This is the worst thing that's ever happened in Lakeland. The worst thing!"},{"name":"A3","text":"You should take off your helmet, too. You might find it liberating."},{"name":"RONITT","text":"Yeah, exactly! I should give her a piece of my mind!"},{"name":"RONITT","text":"Wh-What!?"},{"name":"RONITT","text":"No, absolutely not, never! I'd rather lose my whole damn head than remove my helmet! Grrr... This is all Ozogg's fault! She needs a bloody good talkin' to."},{"name":"RONITT","text":"...But that can wait."},{"name":"RONITT","text":"Bugger it, I can't remember what I was gonna say now! Urngh...somethin' about thankin' you, or whatever it was..."},{"name":"RONITT","text":"Well, I s'pose I should express my gratitude for stickin' with me through thick 'n thin, even when it looked like this whole plan was gonna blow up in my face."},{"name":"RONITT","text":"I know sometimes I can get a bit jealous of you havin' so many talents compared to me, bein' the savior of the bleedin' world and all that."},{"name":"RONITT","text":"But I know you ain't doin' it to steal my thunder, you're just tryin' to be a good friend. And you are. The very best."},{"name":"RONITT","text":"Bloody hells, keep this up an' I'll start bawlin' like a newborn! Anyway, the struggle to get those tanks might be over, but me, Ozogg, and the others'll carry on here."},{"name":"RONITT","text":"So if you ever feel like showin' off those skills of yours, you know where to come. In the meantime, best of luck with savin' the world or whatever you'll be doin'!"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Bloodsworn</span> reputation with Watts's Anvil."},{"name":"SYSTEM","text":"You will receive an experience point bonus upon completion of the dwarf tribal daily quests."}],"reward":{"gil":1007},"reqs":{"beastrank":7,"jobs":[{"lvl":70,"id":33}],"quests":[69436]}},"partials":[{"type":"npc","id":"1033710","obj":{"i":1033710,"n":"Ronitt","l":2953,"q":5}},{"type":"quest","id":"69436","obj":{"i":69436,"n":"Chief Concerns","g":60,"l":"Lakeland","s":5,"f":1}}]}