{"quest":{"name":"A Piss-up in a Brewery","location":"Lakeland","id":69433,"patch":5.3,"sort":2,"icon":100996,"beast":14,"unlocksFunction":1,"eventIcon":71341,"issuer":1033710,"target":1033730,"genre":60,"usedItems":[31138,31139],"journal":["Ronitt has overlooked something rather important.","With the prototype Rolling Tankard nearing completion, it dawns on Ronitt that he has yet to find a suitable fuel to power it, and he gathers his comrades for an exchange of ideas. Their discussion has barely begun when they notice the presence of a mysterious interloper─Ozogg of the Gogg, one of their archrivals. She claims to be descended from Watts, much like Ronitt, to whom she issues a challenge: a test of engineering skill, with rightful claim to Watts's hammer at stake. Ronitt eventually accepts, but on the condition that Ozogg wait until he has finished work on the Rolling Tankard prototype. Having overheard their discussion of fuel, Ozogg offers her village's secret formula to expedite their upcoming showdown, but only if she is supplied with booze beforehand. Much to her dismay, the other dwarves inform her they have no ale to share, nor the means to produce any. Ozogg offers to oversee the construction of a brewery and appoints you as her assistant. Like most present, Ronitt finds this sequence of events absolutely baffling, but if the end result is fuel for his work and workers both, he is all for it.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Ozogg puts you in charge of crafting some of the basic components for the brewery, the materials for which can apparently be found in Ronitt's automaton.","Despite Ronitt and his comrades having no intention whatsoever of constructing a brewery, the exact materials needed for essential components have already been gathered by the Fetchomatic Mechatoad. You can only hope that fulfilling Ozogg's order will absolve you of any further involvement in her schemes.","With the final parts of the brewing apparatus now in place, the dwarves waste no time in producing their first batch of grog and drinking themselves into a stupor. Meanwhile, Ozogg stands back to admire her handiwork.","Ronitt is eager for Ozogg to keep her part of the bargain and reveal the Gogg fuel formula. She then catches him completely off guard by stating that she has already built a fully functioning ethanol mill to produce the fuel he requires. Ronitt, try as he might, cannot conceal his delight at the latest addition to the facilities and offers Ozogg his thanks, before also thanking you, though far less begrudgingly."],"objectives":["Speak with Ozogg.","Obtain materials from the Fetchomatic Mechatoad.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize a [Error]</span><span class=\"alternative\">Deliver [Error] to Ozogg</span></span>.","Speak with Ozogg."],"dialogue":[{"name":"RONITT","text":"Heh! Not only are you talented, but hardworkin', too! You've really made a difference around here."},{"name":"RONITT","text":"As for me, I've never made anythin' like this before, so it's takin' a while to get the engine right. Who'd have thought makin' a tank could be so complicated?"},{"name":"RONITT","text":"I reckon I'll have it worked out before long, but there's one problem I've been strugglin' with: the fuel. S'pose it wouldn't hurt to ask the others if they've got any ideas."},{"name":"RONITT","text":"All right <span class=\"alternative-container\"><span class=\"alternative\">lads and ladettes</span><span class=\"alternative\">lads</span></span>, it seems like the cobalt coal we use for automata ain't gonna cut it. The tank's just too heavy even when it's empty, never mind with a full load of cargo."},{"name":"KARUTT","text":"'Course, makin' it lighter is an option, but we can't cut back on armor or those sin eaters'll rip through it like it were paper. And there ain't no point puttin' a limit on the amount it can carry 'cause that defeats the purpose of it."},{"name":"KARUTT","text":"A-Actually, I'm not sure it's a good time to m-mention this, but..."},{"name":"REGITT","text":"I get the feeling we're being watched. If one of those bastard hobgoblins has followed us here, I'll smash its bloody head in!"},{"name":"OZOGG","text":"(-???-)Who're you calling a hobgoblin!?"},{"name":"OZOGG","text":"Bah! I've no time to deal with underlings. It's the twice─nay, thrice-cursed Ronitt I seek! I, Ozogg the Gogg, proud descendant of the great Watts, challenge you to a test of skill, with Watts's hammer on the line!"},{"name":"RONITT","text":"What the hells are you talkin' about!? If you're a descendant of Watts, I'm a two-headed amaro! His blood flows in <span class=\"emphasis\">my</span> veins, not yours!"},{"name":"RONITT","text":"Besides, can't you see I'm busy!? I'm tryin' to build a prototype of the Rollin' Tankard!"},{"name":"OZOGG","text":"A what? I don't have a clue what you mean, but it sounds fascinating! "},{"name":"OZOGG","text":"N-Not that I care what any of you and your band of dundering dunderheads are up to! All I want is to challenge you and prove who's the better engineer. Surely, your pride compels you to accept? Unless you're scared, that is..."},{"name":"RONITT","text":"I ain't scared of nothin'! If it's a showdown you're after, a showdown's what you'll get, but not until I finish this tank. 'Course, the quicker it gets done, the quicker you can pit your “skill” against mine..."},{"name":"OZOGG","text":"Oh, I see what you're getting at..."},{"name":"OZOGG","text":"This is your roundabout way of asking for my help, isn't it?"},{"name":"OZOGG","text":"Ha! Judging by the sorry state of that...whatever it's supposed to be, you certainly need it! If this is what it takes for you to relinquish Watts's hammer, so be it, you...you...shambling charlatan!"},{"name":"KARUTT","text":"I-Is that the sound of impending d-disaster I hear?"},{"name":"RONITT","text":"I assume you've got at least <span class=\"emphasis\">some</span> craftin' chops to back up that mouth of yours."},{"name":"OZOGG","text":"I'll have you know that even Gogg babies can produce better work than the shoddy rubbish that passes for engineering in Tomra! And from what I gather, you've started building that tank of yours without even considering what sort of fuel to use!"},{"name":"OZOGG","text":"I'll be here until my next nameday if I wait for you lot to find a solution for yourselves, so I'll let you use the Gogg's secret formula, which is sure to work. Naturally, I'll expect something in return: grog! And plenty of it!"},{"name":"KARUTT","text":"M-Maybe we can get some for the r-rest of us, while we're at it. Nothing like a drunken buzz to increase pr-productivity. Yes, definitely."},{"name":"KARUTT","text":"But th-there's nowhere to get decent brew for malms around, and we lack the m-means to make it ourselves..."},{"name":"OZOGG","text":"Bless my beard, you call yourselves dwarves!? Tell you what: I'll build you a brewing machine, on the condition I can have grog from it whenever I want. Agreed?"},{"name":"OZOGG","text":"I'll need an assistant, though. You, over there! Lend me a hand, would you?"},{"name":"RONITT","text":"I've heard some convoluted schemes in my time, a few of them my own, but this is somethin' else. Ah well, as long as it doesn't interfere with my work, I couldn't give a hob's arse what she does. I think we can spare you for a bit, so why not humor her?"},{"name":"OZOGG","text":"I'll be installing the machinery at the top of those steps, so when you're ready to see a real engineer in action, just say the word. And if you even think about sabotaging it to make me look bad, I...I...shall be very cross!"},{"name":"OZOGG","text":"Listen, I didn't just pick you at random, you know. I've been watching from afar and I've seen the way you work. While I won't go so far as to say I'm impressed, you're a cut above the rest of these talentless hacks."},{"name":"OZOGG","text":"I'd be interested to see how you cope when working alongside someone of my caliber. While I design the brewing apparatus, I'll have you produce a few basic components."},{"name":"OZOGG","text":"Of course, we won't be doing much brewing without brewing vats, so show me what you're capable of!"},{"name":"OZOGG","text":"As you can imagine, we'll need all manner of filters to remove any impurities, which is where you come in!"},{"name":"OZOGG","text":"We can't make ale without yeast, so I'd like you to prepare a batch for me!"},{"name":"OZOGG","text":"Hmm... I suppose you'll be needing the raw materials, won't you? Let me see..."},{"name":"KARUTT","text":"Um, I th-think there should be some in the automaton."},{"name":"OZOGG","text":"Problem solved! It seems the Tholls' habit of carrying a load of rubbish around with them actually paid off for once. Well then, what are you waiting for? I'm keen to show this bunch of reprobates what proper grog tastes like!"},{"name":"KARUTT","text":"A-And we're keen to do the tasting! Let's get to work, sh-shall we?"},{"name":"OZOGG","text":"You won't be making much of anything without the proper materials. Now, hurry up and get some from that bucket of rust they call an automaton."},{"name":"OZOGG","text":"You won't be making much of anything without the proper materials. Now, hurry up and get some from that bucket of rust they call an automaton."},{"name":"OZOGG","text":"You won't be making much of anything without the proper materials. Now, hurry up and get some from that bucket of rust they call an automaton."},{"name":"KARUTT","text":"I m-must say, I'm much better at br-brewing than I am at smithing. The results are a lot t-tastier, too!"},{"name":"AUTOMATON","text":"&lt;boop&gt; &lt;beep&gt;"},{"name":"AUTOMATON","text":"&lt;boop&gt; &lt;beep&gt;"},{"name":"AUTOMATON","text":"&lt;boop&gt; &lt;beep&gt;"},{"name":"AUTOMATON","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON","text":"&lt;beep&gt; Request for ingredients acknowledged."},{"name":"OZOGG","text":"Done, are you?"},{"name":"OZOGG","text":"Took you long enough, but it was worth the wait. Now, we're only a few simple steps away from producing lovely, lovely Gogg grog!"},{"name":"KARUTT","text":"Erm, actually, I was h-hoping to try a new recipe I've come up with that uses l-local ingredients."},{"name":"OZOGG","text":"Ha! This ought to be good for a laugh! I'll bet it tastes even worse than the usual dregs you Tholls serve up. As long as we switch over to <span class=\"emphasis\">my</span> recipe afterwards, I don't see the harm in trying, though."},{"name":"REGITT","text":"(-Regitt and Karutt-)Down the hatch!"},{"name":"SYSTEM","text":"Under Ozogg's watchful eye, Watts's Anvil is now equipped with a fully functioning brewery, an essential part of any tank-building facility."},{"name":"SYSTEM","text":"With the majority of the workforce now blind drunk, the next logical step is to begin producing large quantities of highly flammable fuel for their experimental war machine."},{"name":"OZOGG","text":"These Tholls certainly seem to be enjoying the booze. I suppose I could do them the honor of passing a little across my palate..."},{"name":"OZOGG","text":"By Watts's beard! This is incredible! In fact, it might be even better than the ale we make in Komra!"},{"name":"KARUTT","text":"Though the recipe is of m-my own invention, your brewing techniques are the key to its unique fl-flavor, Ozogg!"},{"name":"RONITT","text":"I hope you don't mind me interruptin' this knees-up to discuss your side of the bargain. What are you plannin' to do about my tank fuel, eh!?"},{"name":"OZOGG","text":"Planning? Why, it's already been dealt with. Take a closer look!"},{"name":"REGITT","text":"Eh? Looks like a brewin' vat to me."},{"name":"OZOGG","text":"Ha! That shows how much <span class=\"emphasis\">you</span> know! Behold, the patented Gogg ethanol mill!"},{"name":"OZOGG","text":"By fermenting various forms of vegetation, like dry grass and so on, then distilling it a few times, we're able to produce fuel that can be used in a range of machines."},{"name":"OZOGG","text":"What do you think of that, you...you...simpleminded simpletons!?"},{"name":"RONITT","text":"That's bloody brilliant! And you started workin' on it before we even gave you your grog? You don't waste any time, that's for sure."},{"name":"REGITT","text":"It really is quite remarkable. I'd say our doubts have been laid to rest, at least as far as her skills as an engineer are concerned."},{"name":"OZOGG","text":"Ha! Let this be a lesson to all you naysayers! But the proof, as they say, is in the pudding, and you'll see the true extent of my genius once you feast your eyes on the power of ethanol fuel!"},{"name":"RONITT","text":"Yeah, let's not get ahead of ourselves. For all we know, the whole thing might blow up in our faces! But I suppose it would be poor form not to express my appreciation, so...thanks, Ozogg."},{"name":"OZOGG","text":"Try not to sound too enthusiastic about it! But if you're in the mood for giving praise, I reckon <span class=\"highlight\">Forename</span> deserves some, too."},{"name":"RONITT","text":"Yes, all right, I hadn't forgotten! Good work, <span class=\"highlight\">Forename</span>. Ozogg couldn't have done it without you."},{"name":"KARUTT","text":"I w-wonder what sort of grog we could make from l-local ingredients? I don't really f-fancy traveling all the way back to T-Tomra every time we run out."},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Trusted</span> reputation with Watts's Anvil."},{"name":"SYSTEM","text":"New dwarf tribal daily quests are now available from Regitt at Watts's Anvil."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Regitt as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Regitt. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Mizutt."}],"reward":{"gil":934},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":33}],"quests":[69432]},"next":[69434]},"partials":[{"type":"npc","id":"1033710","obj":{"i":1033710,"n":"Ronitt","l":2953,"q":5}},{"type":"npc","id":"1033730","obj":{"i":1033730,"n":"Ozogg","l":2953,"q":1}},{"type":"item","id":"31138","obj":{"i":31138,"n":"Brewery Materials","l":1,"c":26001,"t":63}},{"type":"item","id":"31139","obj":{"i":31139,"n":"Brewery Supplies","l":290,"c":21012,"t":61}},{"type":"quest","id":"69432","obj":{"i":69432,"n":"It's Dwarfin' Time","g":60,"l":"Kholusia","s":1,"f":1}},{"type":"quest","id":"69434","obj":{"i":69434,"n":"I Heard You Like Tanks","g":60,"l":"Lakeland","s":3,"f":1}}]}