{"quest":{"name":"Tanking Is Hard","location":"Lakeland","id":69435,"patch":5.3,"sort":4,"icon":100998,"beast":14,"unlocksFunction":1,"eventIcon":71341,"issuer":1033710,"target":1033710,"genre":60,"usedItems":[31142,31143],"journal":["Beneath Ronitt's thick beard hides a self-satisfied grin.","The newly completed Rolling Tankard prototype has been put through its paces, and a lack of screaming and charred earth indicates the final test run was successful. The next step is to produce more tanks, and for that, Ronitt requires a larger workshop. He calls a meeting with the other members of Watts's Anvil, but their talks are interrupted by the sudden appearance of Chief Xamott of the Tholl and Chief Glagg of the Gogg. Quite how these archrivals suffered each other's company long enough to reach Lakeland is unclear, but their ire for Ronitt and Ozogg's disobedience is palpable. Not only have aspiring inventors broken the strict code of their respective tribes, but they have each been accused of perpetrating heinous crimes. Ozogg of sharing Gogg technology with the Tholl, and Ronitt of stealing Watts's designs without permission, an act punishable by banishment. Although Ronitt is able to convince his chief of the importance of the Rolling Tankards, he is given an ultimatum: complete five tanks by the next Beardtide festival or he and the other Tholls will be sent back to Tomra. What's more, he must forfeit Watts's hammer should he fail. Such a grim prospect fails to dampen his determination, and he readily accepts the wager.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Ronitt has planned a number of improvements to Watts's Anvil, and he calls on your crafting skills once more. He even has the nerve to demand no less than absolute perfection despite the urgent need to complete the work as quickly as possible.","After obtaining the necessary materials from inside the Fetchomatic Mechatoad, you put your mind to the task at hand.","Though Ronitt expresses his thanks for your hard work, he is distracted by the absence of Ozogg, who he has not seen since the visit from their respective chiefs. He is perhaps a little too quick to point out his lack of concern for her well-being, stating he simply wishes to know if there is something that might present a problem. As she is unlikely to share her thoughts with a Tholl, he asks that you go and question her in his stead.","It seems Ozogg had only gone to survey the proposed site for the upcoming tank demonstration to ensure that nothing will prevent Ronitt from passing Xamott's test. With no prying eyes or ears to hear, she confesses her resolve to never return home, making any punishment from her elders─even the threat of banishment similar to Ronitt─a matter of little concern. All she cares about is carrying on with her engineering, which has been her lifelong passion. She then goes on to share her childhood memories of meeting Ronitt as a boy and their all-too-brief encounter and her giving him a Gogg coin as a token of their friendship. Though Ronitt was too young to remember, Ozogg has fond recollections of that day, and her work at Watts's Anvil reminds her of the simple joy of crafting that she felt all those years ago. Though she insists that she is only here to challenge Ronitt as rightful heir to Watts's hammer, it seems that this may be merely a pretext for her to spend time with like-minded individuals. As you have agreed not to relate her tale to Ronitt and the others, you decide to return to the Anvil and give a condensed and carefully selected account of your talk with Ozogg.","Your retelling of the conversation with Ozogg seems to appease Ronitt, whose main concern is whether she will continue to help with construction of the remaining Rolling Tankards. Now that the workshop is equipped for mass production, the dwarves face a race against time to complete the tanks before Beardtide arrives."],"objectives":["Speak with Ronitt.","Obtain materials from Ronitt's automaton.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Ronitt</span></span>.","Speak with Ozogg.","Speak with Ronitt."],"dialogue":[{"name":"RONITT","text":"I've been puttin' the prototype through its paces, doin' a bit of fine-tunin' along the way. I'm happy to say it's now complete!"},{"name":"RONITT","text":"I reckon I probably could've done it all by myself eventually, but havin' everyone else chip in with the work definitely helped."},{"name":"RONITT","text":"If we keep this up, Watts's Anvil will be able to achieve “world domination through technology”!<br>Hmm... Might need to work on the slogan a bit."},{"name":"RONITT","text":"All right, if we're gonna produce more Rollin' Tankards, we'll need to find a way to speed up the process. Time for a meetin'!"},{"name":"RONITT","text":"We're almost ready to take over─I mean, “save” the world with our tanks!"},{"name":"OZOGG","text":"I hope you haven't forgotten about what's in store for you once they're finished."},{"name":"RONITT","text":"'Course not! But in the meantime, I've got bigger fish to fry."},{"name":"XAMOTT","text":"(-???-)You, boy! What the bloody hells do you think you're playin' at, consortin' with Goggs! Bunch of stinkin' scruffybeards, the lot of 'em!"},{"name":"GLAGG","text":"(-???-)Watch your tongue, Xamott, or I'll pull it out with my pliers!"},{"name":"RONITT","text":"Hob's balls, it's the chief!"},{"name":"OZOGG","text":"Gah! And my chief's here, too!"},{"name":"XAMOTT","text":"So this is where you young'uns have been all this time... Explain yourselves, and spare me any limp-bearded excuses! Wait, what is <span class=\"emphasis\">that</span>!?"},{"name":"RONITT","text":"Behold, the Rollin' Tankard! One of the lost designs of the great Watts, in the flesh! Well, “in the metal,” I suppose, but the point still stands!"},{"name":"GLAGG","text":"Yes, but what the bloody hells <span class=\"emphasis\">is</span> it?"},{"name":"XAMOTT","text":"Never mind that, what I want to know is how you got your grubby little mitts on Watts's designs? They were locked in an unbreakable safe!"},{"name":"RONITT","text":"Unbreakable? Don't think so, Chief. I opened that back when I was a nipper. And I thought, it's “finders keepers,” so I helped myself to the plans inside."},{"name":"XAMOTT","text":"You did what!?"},{"name":"XAMOTT","text":"Taking such revered artifacts without permission is strictly forbidden! I should banish the bloody lot of you!"},{"name":"RONITT","text":"Steady on, Chief! I didn't even realize it was against the rules!"},{"name":"GLAGG","text":"As for you, young lady, you'd better have a damned good excuse for this behavior. And I notice that ethanol mill over there is of Gogg design. If I find you've been sharin' our secrets with the Tholl, your life won't be worth livin'!"},{"name":"XAMOTT","text":"You can't go replicatin' Watts's ideas willy-nilly. For all we know, this could bring about the destruction of Tomra! In any event, his great works are far beyond the capabilities of you whelps!"},{"name":"XAMOTT","text":"And to make matters worse, the Gogg know all about it now! What's to stop them from buildin' their own tanks and wagin' war on us!?"},{"name":"KARUTT","text":"I-I don't like the s-sound of that..."},{"name":"REGITT","text":"Maybe this weren't such a good idea after all..."},{"name":"RONITT","text":"Stop snivelin', you two! Why would Watts design somethin' like this if he didn't want anyone to make it!? We're carryin' on his legacy!"},{"name":"OZOGG","text":"If taking the plans is against the rules, why did no one here know about it? Surely someone would've said something to Ronitt if it's that severe a crime."},{"name":"XAMOTT","text":"W-Well, you'd think that bein' in a locked safe would be enough of a deterrent, but obviously not! Bugger my beard, do I have to spell everythin' out? ...Truth be told, I never thought anyone would break the soddin' lock like that."},{"name":"RONITT","text":"I didn't mean no harm by it, honest! Maybe if I explain <span class=\"emphasis\">why</span> I wanted to build Watts's tank, you'll understand..."},{"name":"XAMOTT","text":"Hmm... You're cleverer than you look, Ronitt. I suppose it's no good havin' all that technology if we're the only ones who benefit from it."},{"name":"XAMOTT","text":"But let's make one thing clear: if you go producin' a load of shoddy work, the Tholl will be the laughingstock of Norvrandt. Do you swear on Watts's beard that you'll do a proper job of it?"},{"name":"RONITT","text":"(-Ronitt and Ozogg-)We will!"},{"name":"XAMOTT","text":"To prove that you can produce quality <span class=\"emphasis\">and</span> quantity, I want you to complete five tanks by the next Beardtide festival. Think you can manage that?"},{"name":"RONITT","text":"(-Ronitt and Ozogg-)Yes!"},{"name":"XAMOTT","text":"Should you fail, every Tholl here will be sent straight back to Tomra. And that's not all! Ronitt must return Watts's hammer. Those are my conditions. Don't disappoint me!"},{"name":"RONITT","text":"Hmph! We'll be holding a demonstration at the bottom of that hill over there on Beardtide! Just you see!"},{"name":"RONITT","text":"Only five by Beardtide? Ha! Why not make it ten? Challenge accepted!"},{"name":"OZOGG","text":"Erm, Ronitt..."},{"name":"OZOGG","text":"I've got something to take care of! But I'll be back soon!"},{"name":"RONITT","text":"Hmm? Suit yourself."},{"name":"RONITT","text":"The more I think about it, the more it pisses me off!"},{"name":"RONITT","text":"The only reason the chief is givin' me such a hard time about this is because he reckons I'm not up to the task!"},{"name":"RONITT","text":"I've also got a sneakin' suspicion he made up that rule and Watts's plans just to make my life miserable. He can't bear the thought of me showin' him up with my engineerin'!"},{"name":"RONITT","text":"It looks like the only thing for it is to get those tanks built, on the double. You see, Beardtide takes place roughly once a year, when it's time for the chief of Tomra to have his beard washed."},{"name":"RONITT","text":"Judgin' by the state of it, I'd say we don't have long left. We need to have as many people workin' on the tanks as possible, and that means makin' the workshop a lot bigger."},{"name":"RONITT","text":"'Course, I've already come up with a plan, but I need you to bring me some supplies. And this time, only your very best work will do. Got that?"},{"name":"RONITT","text":"'Course, I've already come up with a plan, but I need you to bring me some supplies. And this time, only your very best work will do. Got that?"},{"name":"RONITT","text":"'Course, I've already come up with a plan, but I need you to bring me some supplies. And this time, only your very best work will do. Got that?"},{"name":"RONITT","text":"You'll find everythin' you need in the Mechatoad."},{"name":"RONITT","text":"I suppose you're wonderin' why it's called the Fetchomatic Mechatoad? Well, it fetches all the materials we could possibly need automatically, and it's also a mechanical toad. Comin' up with great names is just one of my many talents, you know!"},{"name":"RONITT","text":"I suppose you're wonderin' why it's called the Fetchomatic Mechatoad? Well, it fetches all the materials we could possibly need automatically, and it's also a mechanical toad. Comin' up with great names is just one of my many talents, you know!"},{"name":"RONITT","text":"I suppose you're wonderin' why it's called the Fetchomatic Mechatoad? Well, it fetches all the materials we could possibly need automatically, and it's also a mechanical toad. Comin' up with great names is just one of my many talents, you know!"},{"name":"AUTOMATON","text":"&lt;bloop&gt; &lt;beep&gt;"},{"name":"AUTOMATON","text":"&lt;bloop&gt; &lt;beep&gt;"},{"name":"AUTOMATON","text":"&lt;bloop&gt; &lt;beep&gt;"},{"name":"AUTOMATON","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON","text":"&lt;beep&gt; Request for ingredients acknowledged."},{"name":"RONITT","text":"I assume you got there in the end?"},{"name":"RONITT","text":"Bugger m─ Ahem! Oh yes, very good, except for this, ah...slight impurity here. It should suffice, though."},{"name":"RONITT","text":"Ha ha, just jokin'! It's damn near perfect! This'll go a long way in makin' the workshop bigger and better than ever."},{"name":"RONITT","text":"One thing's botherin' me, though. I haven't seen Ozogg since she wandered off. I heard from one of the others she was loiterin' by somethin' called Radisca's Round."},{"name":"RONITT","text":"Since Chief Xamott almost bloody well banished me for takin' Watts's plans, I reckon an even harsher punishment's in store for Ozogg. I mean, I bet their chief didn't take too kindly to her givin' away their secrets and buildin' us an ethanol mill!"},{"name":"RONITT","text":"Now, I know what you're thinkin': “Look at that daft sod Ronitt, worryin' about a Gogg.” Well, I ain't! I just...wanna know if there's somethin' I <span class=\"emphasis\">should</span> be worried about, which isn't the same thing at all!"},{"name":"RONITT","text":"Even if there was, I doubt she'd tell me or any of the other Tholls, so maybe you could have a word with her?"},{"name":"RONITT","text":"Thanks, 'preciate it. If you could find out what her chief said, and if it's any cause for concern, it'd go a long way to puttin' my mind at ease."},{"name":"OZOGG","text":"Oh, it's you, <span class=\"highlight\">Forename</span>. Is something the matter?"},{"name":"OZOGG","text":"Hahaha! Ronitt sent you to check up on me? Maybe he doesn't despise me as much as he'd have everyone believe! Ahahaha!"},{"name":"OZOGG","text":"Haha...ha... Oh dear, I haven't laughed that hard in a long time. If you must know, I didn't come down here to sulk, I just wanted to have a look around where the demonstration is due to take place."},{"name":"OZOGG","text":"If anything ruins Ronitt's big day, I'll have to wait even longer to pit my skills against his!"},{"name":"OZOGG","text":"But, if I'm being honest, there's a bit more to it than that. <span class=\"highlight\">Forename</span>, will you promise not to tell the others?"},{"name":"OZOGG","text":"The truth is, I've no plans to return to Komra once this is all over. In fact, I'd already made that decision the day I left. So it makes no difference to whether I'm banished or not."},{"name":"OZOGG","text":"I couldn't care less what the chief or anyone else thinks about me, as long as I can carry on with my engineering. The feeling of having an idea and seeing it come to life right before your eyes... It's indescribable!"},{"name":"OZOGG","text":"The thing is, as one of Watts's descendants, everyone has had such high expectations of me, even as a child. “Build this, build that. Craft me some copper rings. No, not those copper rings, the other sort.”"},{"name":"OZOGG","text":"When the pressure got too much, I'd sneak away from my teachers to play with the junk I'd collected from around the village."},{"name":"OZOGG","text":"That's how I first met Ronitt. He was a few years younger than me─he still is, as far as I know─but just like me, he was picking up pieces of scrap metal and imagining all the things he could make from them."},{"name":"OZOGG","text":"When I went over to speak to him, I found we were as alike as two peas in a pod. He loved to make things just as much as I did, and in that brief time we spent together, we talked all about the ideas we'd had, and even made a sort of mechanical doll!"},{"name":"OZOGG","text":"As a sign of our newfound friendship, I gave him a Gogg coin, and promised that we'd meet again... But someone must've seen us. When I got back home to the village, my parents forbade me from playing with “that Tholl boy.”"},{"name":"OZOGG","text":"And, well, that was the last I saw of him. He was so young, I doubt he remembers any of it, but I'll always cherish the memories of that day, that simple joy of making something for its own sake."},{"name":"OZOGG","text":"Seeing Ronitt and his friends working together reminded me of how I felt on that day. I'd rather be here helping them build something that will make a difference to the whole of Norvrandt than only doing what's best for the Gogg."},{"name":"OZOGG","text":"Ahem! And once that's over and done with, I'll have a chance to prove that I'm a better engineer than Ronitt and claim Watts's hammer. For <span class=\"emphasis\">that</span> is my true objective, oh yes!"},{"name":"OZOGG","text":"It's true! Well, I suppose I don't really <span class=\"emphasis\">need</span> the hammer as such. I just thought a little competition would be healthy for the both of us."},{"name":"OZOGG","text":"Hmm... But I have the feeling that you're far too skilled to be taking orders from someone like Ronitt. Why are you helping him, anyway?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"For the greater good!"},{"name":"A1","text":"Wherever these talented hands are needed, I will be there."},{"name":"A1","text":"Because there's money to be made. Presumably."},{"name":"OZOGG","text":"Oh, how very noble! ...I'm being sarcastic, in case you hadn't noticed."},{"name":"OZOGG","text":"Well, if the staggering level of incompetence around Watts's Anvil is anything to go by, those talented hands of yours will find no shortage of work."},{"name":"OZOGG","text":"I wouldn't get your hopes up. Ronitt may be surprised to find there is a lot less demand for his so-called masterpieces than he realizes. Besides, I don't recall him mentioning that <span class=\"emphasis\">you</span> would receive any of the profits."},{"name":"OZOGG","text":"We all have our own reasons for being here, I suppose. And it's not like anyone is forcing us to do this. I'm just glad to have someone other than those boorish Tholls to speak to. I mean you, by the way."},{"name":"OZOGG","text":"Honestly, I can't see how they get anything done over in Tomra. Did you see the way Ronitt let their chief talk him into that ridiculous ultimatum?"},{"name":"OZOGG","text":"If they don't get those tanks finished in time, that'll be the end of Watts's Anvil and everything I've worked for will go up in smoke. And worst of all, I'll never get the hammer if Ronitt loses it in this stupid wager!"},{"name":"OZOGG","text":"Luckily, I have a plan, but I'll need some time to mull over the finer points. For now, let's get back to the workshop."},{"name":"RONITT","text":"So? What did she say?"},{"name":"RONITT","text":"Hmm... She just went to look over the demonstration site? Seems she wants us to pass Chief Xamott's test, even if it's only for the chance to challenge me for Watts's hammer. Main thing is, she's stickin' around long enough to help with the tanks."},{"name":"RONITT","text":"But enough talk, let's get to work! Because if this doesn't go exactly accordin' to plan, we're done for! Oh gods...I'm not used to this sort of pressure!"},{"name":"RONITT","text":"What do you think of the new, improved workshop? There's no way we can fail now, right? Actually, don't answer that..."},{"name":"RONITT","text":"It won't take us anywhere near as long to build the other four tanks as it did the first, but we still have our work cut out for us. Might have to tell the others no sleep till we're done!"},{"name":"RONITT","text":"And don't go thinkin' that excludes you! I'm expectin' great things from you in the days leadin' up to Beardtide, so no slackin'!"},{"name":"SYSTEM","text":"Watts's Anvil is now equipped with everything needed to produce Rolling Tankards en masse."},{"name":"SYSTEM","text":"But with the day of reckoning fast approaching, will Ronitt and his comrades be able to complete a column of tanks that meets Chief Xamott's exacting standards?"},{"name":"SYSTEM","text":"You have achieved <span class=\"highlight\">Honored</span> reputation with Watts's Anvil."},{"name":"SYSTEM","text":"New dwarf tribal daily quests are now available from Regitt at Watts's Anvil."},{"name":"SYSTEM","text":"Furthermore, you will be able to undertake three additional quests from Regitt as a reputation bonus. This bonus is available until the daily reset time for tribal quests."},{"name":"SYSTEM","text":"These additional quests will become available after accepting all current daily quests from Regitt. Please be advised that you cannot undertake these quests if you have no remaining allowances."},{"name":"SYSTEM","text":"You now have access to a wider selection of wares from Mizutt."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":1007},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":33}],"quests":[69434]},"next":[69436]},"partials":[{"type":"npc","id":"1033710","obj":{"i":1033710,"n":"Ronitt","l":2953,"q":5}},{"type":"item","id":"31142","obj":{"i":31142,"n":"Workshop Expansion Materials","l":1,"c":26001,"t":63}},{"type":"item","id":"31143","obj":{"i":31143,"n":"Workshop Expansion Supplies","l":290,"c":21012,"t":61}},{"type":"quest","id":"69434","obj":{"i":69434,"n":"I Heard You Like Tanks","g":60,"l":"Lakeland","s":3,"f":1}},{"type":"quest","id":"69436","obj":{"i":69436,"n":"Chief Concerns","g":60,"l":"Lakeland","s":5,"f":1}}]}