{"quest":{"name":"Boom and Dust","location":"Lakeland","id":69448,"patch":5.3,"sort":111,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"journal":["Regitt is looking for an extra pair of hands to handle some hazardous materials.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Place the explosive at the designated location.","Speak with the dwarven foreman.","Report to Regitt."],"dialogue":[{"name":"REGITT","text":"For generations us dwarves have made our livelihoods by wresting hidden veins of minerals from the earth with our own hands. "},{"name":"REGITT","text":"That being said, here at the Anvil the number of hands we have is somewhat limited, and as the scale of our operations grows, we must look without to find whatsoever help is available. And right now, it seems that is you!"},{"name":"REGITT","text":"Head to the Hour of Certain Durance, where one of my workers oversees the mining operations. Our tasks there are endless, and I've no doubt he will have something that requires your expertise."},{"name":"DAILYDWARF03912","text":"Ah, you've come at exactly the right time! We've just discovered a vein of ore in this slab of rock here, and I was getting ready to blow it wide open. But now that you're here, why don't you do the honors? "},{"name":"DAILYDWARF03912","text":"Ah hah! I love the smell of thermite in the morning! Some are frightened of a little explosive, but I always say that if you take the proper precautions and keep your distance, it's no more dangerous than farming!"},{"name":"DAILYDWARF03912","text":"Whew! If you had been just a few ilms closer, that explosion might have been slightly...messier. But, all's well that ends well, I always say. A little dust and debris never harmed no one, after all!"},{"name":"DAILYDWARF03912","text":"Ah, there's nothing like an explosion to get the juices flowing, eh? I'll get to sorting through the rubble for the choicest minerals─you go tell Regitt our work here is done. For now, at least."},{"name":"REGITT","text":"You're back, and judging from the fine layer of dust covering you, you've carried out your task splendidly!"},{"name":"REGITT","text":"Despite what you saw today, there's a lot more to mining than tossing explosives at rocks. Our knowledge of the trade is as deep and vast as the mountains we venture into, and we can sniff out veins of ore that've escaped the noses of the finest miners of Lakeland. "},{"name":"REGITT","text":"So stick with us, and there's no telling what riches might be in store for you! Rest assured I'll be calling upon you again when we hit the mother lode."}],"reward":{"gil":679,"reputation":60,"items":[{"id":28188}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}}]}