{"quest":{"name":"One Hundred Tankards of Solitude","location":"Lakeland","id":69449,"patch":5.3,"sort":112,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"usedItems":[31162,31163],"journal":["Regitt is on the lookout for a cleaner burning fuel.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with Shigitt.","Deliver the requested supplies to the dwarven distiller at Clearmelt.","Report to Regitt."],"objectives":["Speak with Shigitt.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the dwarven distiller at Clearmelt</span></span>.","Report to Regitt."],"dialogue":[{"name":"REGITT","text":"Production of ethanol is proceeding apace, but as you well know, I'm a dwarf who aims ever higher in all aspects. Our ethanol can always be more pure, burn more efficiently, and be more gentle on our engines."},{"name":"REGITT","text":"It's time we used a bit of trial and error to refine our processes. If luck is on our side, we'll discover a way to improve our ale distillation as well."},{"name":"REGITT","text":"We are conducting a series of experiments as we speak, and are in constant need of supplies until we get it just right. You've proven trustworthy and capable thus far, so I can think of no better <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> for the task. Shigitt should have everything you need to get started."},{"name":"SHIGITT","text":"Who would've thought that the Gogg ethanol formula would prove so effective? Still, we Tholls aren't to be outdone, and we're not above asking for your help in creating a superior version. Our main dwarf in charge has decided to conduct his delicate work in Clearmelt, far from the hustle and bustle of the Anvil."},{"name":"SHIGITT","text":"Since you're planning to go there anyway, perhaps you could take something with you? I'd like you to make three metal flasks, able to withstand even the most extreme temperatures. If you should run out of materials, the automaton is standing by to provide you with more."},{"name":"SHIGITT","text":"Since you're planning to go there anyway, perhaps you could take something with you? I'd like you to make three filtration devices, essential for sieving out the impurities from raw ethanol. If you should run out of materials, the automaton is standing by to provide you with more."},{"name":"SHIGITT","text":"Since you're planning to go there anyway, perhaps you could take something with you? I'd like you to make three batches of yeast. We're trying to refine our fermentation methods, and for that we need as much yeast as we can produce. If you should run out of ingredients, the automaton is standing by to provide you with more."},{"name":"SHIGITT","text":"Take your time, and when you're done, deliver the goods to my man in Clearmelt. I do hope his experiments are bearing fruit."},{"name":"AUTOMATON03913","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON03913","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON03913","text":"&lt;beep&gt; Ingredients detected. Request denied."},{"name":"AUTOMATON03913","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON03913","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON03913","text":"&lt;beep&gt; Request for ingredients acknowledged."},{"name":"DAILYDWARF03913","text":"You there! What's that in your hand? Is it...? Oh, it is!"},{"name":"DAILYDWARF03913","text":"Apologies for my brusque greeting. I've been here lost in my experimentations for so long...&lt;hic&gt;...I've quite forgotten what it's like to speak with another person. But these supplies...&lt;hic&gt;...these supplies will keep me busy for some time!"},{"name":"DAILYDWARF03913","text":"Yes, the experiments must go on! &lt;hic&gt; And on and on, until we've managed to expunge every single impurity from our lovely ethanol!"},{"name":"DAILYDWARF03913","text":"You have my thanks. &lt;hic&gt;<br>What? Did I taste the ethanol? But of course, all...all in the name of thorough research! And now...&lt;hic&gt;...thanks to you, I shall synthesize a richness of flavor hitherto unknown to any dwarf!"},{"name":"DAILYDWARF03913","text":"What!? &lt;hic&gt;<br>I'm not tasting the ethanol! Pure ethanol, that's what I'm testing for! You go on ahead and tell Regitt those exact words. Go on now."},{"name":"REGITT","text":"Welcome back! &lt;sniff&gt; From that divine scent I take it you found Clearmelt without trouble. How is the research coming along?"},{"name":"REGITT","text":"Ah, I see...<br>I knew I had picked the right dwarf for the job! A diligent worker and circumspect researcher, he is. I do worry about him being alone for so long, so I may be asking for your help again soon!"}],"reward":{"gil":679,"reputation":60,"items":[{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":8},{"id":28188},{"num":25,"id":9},{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":11},{"id":28188},{"num":25,"id":12},{"id":28188},{"num":25,"id":13},{"id":28188},{"num":25,"id":8}]},"reqs":{"beastrank":4,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}},{"type":"item","id":"31162","obj":{"i":31162,"n":"Filtration Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"31163","obj":{"i":31163,"n":"Filtration Supplies","l":290,"c":21005,"t":61}}]}