{"quest":{"name":"Foundations of Steel","location":"Lakeland","id":69444,"patch":5.3,"sort":107,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"usedItems":[31156,31157],"journal":["Regitt has metal on the mind.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the dwarven smithy at Weathering.","The dwarven metalsmith has tasked you with crafting steel sheet components, then delivering the completed items to Regitt."],"objectives":["Speak with the dwarven smithy at Weathering.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Regitt</span></span>."],"dialogue":[{"name":"REGITT","text":"So, you've been wandering around the Anvil for a while now. Out of all the myriad materials we produce here, which do you reckon is the one we use the most of on a day-to-day basis?"},{"name":"REGITT","text":"If you guessed steel plates, then congratulations─seems your eyes are as keen as your hands. Indeed, the sound of a hammer on steel is the sound of creation here at the Anvil─the birth of anything from a simple chest to a tank fit for combat."},{"name":"REGITT","text":"Just like your eyes and your hands, I suppose your mind is keen enough to gather what I might be asking you to make next, then. We're constantly running low on steel sheets, and the whole of the Anvil would be grateful if you made a few for us. Go and see our smithy over at Weathering and tell him I sent you."},{"name":"AUTOMATON03908","text":"&lt;blip&gt; &lt;buzz&gt;"},{"name":"DAILYDWARF03908","text":"I take it you're the crafter who's meant to “save my arse,” as Regitt put it. He was quite effusive in regards to your skills, in his way, and if even half his blustering is true, then I'm glad to have you."},{"name":"DAILYDWARF03908","text":"The materials we can gather here are altogether different from those we have in Kholusia, and we have our hands full trying to keep up with increasing demand. Any way you could help us would be a godssend."},{"name":"DAILYDWARF03908","text":"I think a few ingots ought to help us along. Three, to be precise. This ore I've procured should suffice, but if for whatever reason you run out of materials, just get more from the automaton."},{"name":"DAILYDWARF03908","text":"A proper sheet of metal has to be scoured to a mirror shine, and for that we need the proper tools. Here, take these and let's see what you can come up with. If for whatever reason you run out of materials, just get more from the automaton."},{"name":"DAILYDWARF03908","text":"Dull metal reflects the dullness of the builder's ambition, and so we polish our sheets to a mirror shine. For that, of course, you need something stronger than spit, and that's where you come in. Take these, and if for whatever reason you run out of materials, get more from the automaton."},{"name":"DAILYDWARF03908","text":"Once you're finished, bring the materials to Regitt at once. Doubtless he is eager to begin ramping up production."},{"name":"DAILYDWARF03908","text":"Remember, if you run out of materials, the automaton is here to provide whatsoever you need."},{"name":"DAILYDWARF03908","text":"Remember, if you run out of materials, the automaton is here to provide whatsoever you need."},{"name":"DAILYDWARF03908","text":"Remember, if you run out of materials, the automaton is here to provide whatsoever you need."},{"name":"AUTOMATON03908","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON03908","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON03908","text":"&lt;beep&gt; Ingredients detected. Request denied."},{"name":"AUTOMATON03908","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON03908","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON03908","text":"&lt;beep&gt; Request for ingredients acknowledged."},{"name":"DAILYDWARF03908","text":"Well, what're you doing? Don't stand around here─take the supplies to Regitt!"},{"name":"REGITT","text":"Ah, you are returned! I trust there were no insurmountable hurdles this time around."},{"name":"REGITT","text":"Perfection! With this we can produce even more sheets than we were before─and that means more metal for everyone!"},{"name":"REGITT","text":"We use the sheets for everything from our helmets, to our homes, to our tanks! We will never be without a need for them, or for your expert hand."}],"reward":{"gil":606,"reputation":60,"items":[{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":8},{"id":28188},{"num":25,"id":9},{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":11},{"id":28188},{"num":25,"id":12},{"id":28188},{"num":25,"id":13},{"id":28188},{"num":25,"id":8}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}},{"type":"item","id":"31156","obj":{"i":31156,"n":"Steel Plate Component Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"31157","obj":{"i":31157,"n":"Steel Plate Component","l":290,"c":21005,"t":61}}]}