{"quest":{"name":"A Blueprint a Day","location":"Lakeland","id":69443,"patch":5.3,"sort":106,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"usedItems":[31154,31155],"journal":["Regitt has an abundance of ideas, but no way to bring them to the world.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the dwarven quartermaster at Fort Jobb.","Deliver the requested supplies to Regitt."],"objectives":["Speak with the dwarven quartermaster at Fort Jobb.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Regitt</span></span>."],"dialogue":[{"name":"REGITT","text":"Do you know what it's like to be too clever for your own good? Of course you do. Try as we might, we dwarves just can't stop birthing ideas─our minds are like broken dams of creativity. The only problem is that we have <span class=\"emphasis\">so</span> many ideas that we've plumb run out of materials to write them down with!"},{"name":"REGITT","text":"We're quite particular about what we use to immortalize our designs─you can't expect us to be satisfied with any run-of-the-mill ink and parchment! If they were made by one with your talents, however, I'm sure everyone would be more than happy."},{"name":"REGITT","text":"The quartermaster at Fort Jobb should have the supplies you need, but he's always going to and fro gathering what needs gathering. It's really a matter of luck whether he's there now or not."},{"name":"AUTOMATON03907","text":"&lt;blip&gt; &lt;buzz&gt;"},{"name":"DAILYDWARF03907","text":"So you're the one meant to help with the blueprints, eh? Good, good. I have a keen eye for materials, but when it comes to actually putting them together, I'm all thumbs!"},{"name":"DAILYDWARF03907","text":"If the other dwarves don't get what they need, we'll soon have a riot on our hands. Nothing's worse than having an idea stewing in your head with no way to let it out into the world!"},{"name":"DAILYDWARF03907","text":"I suppose we should start by having you make the most essential of materials: a pen nib. Can't very well write with some stick off the ground, can you? Take these materials, and if you run out for any reason, the automaton will be happy to oblige you with more. "},{"name":"DAILYDWARF03907","text":"I suppose we should start by having you make the most essential of materials: paper. Two large sheets should do─more than enough space to fit in even the most labyrinthine of designs. Take these materials, and if you run out for any reason, the automaton will be happy to oblige you with more. "},{"name":"DAILYDWARF03907","text":"I suppose we should start by having you make the most essential of materials: ink. Two vials of the fast-drying type should do─that's plenty enough for even the most ambitious dwarf to pen their next brilliant invention. Take these ingredients, and if you run out for any reason, the automaton will be happy to oblige you with more."},{"name":"DAILYDWARF03907","text":"Once you've done your part, make haste to the Anvil and deliver the supplies to Regitt. Doubtless there are many workers who are going positively nutty for all the ideas trapped in their noggins."},{"name":"DAILYDWARF03907","text":"I realize that perfection is the progeny of trial and error. If for whatever reason you require more materials, simply procure them from the nearby automaton."},{"name":"DAILYDWARF03907","text":"I realize that perfection is the progeny of trial and error. If for whatever reason you require more materials, simply procure them from the nearby automaton."},{"name":"DAILYDWARF03907","text":"I realize that perfection is the progeny of trial and error. If for whatever reason you require more materials, simply procure them from the nearby automaton."},{"name":"AUTOMATON03907","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON03907","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON03907","text":"&lt;beep&gt; Ingredients detected. Request denied."},{"name":"AUTOMATON03907","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON03907","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON03907","text":"&lt;beep&gt; Request for ingredients acknowledged."},{"name":"DAILYDWARF03907","text":"It would seem your reputation is well deserved! Now take what you made to Regitt before he gets it in his head that we're lazing about."},{"name":"REGITT","text":"Do you have the materials? I do hope so─I can feel my budding ideas withering away..."},{"name":"REGITT","text":"Ah, these will do nicely! Even the most ambitious design starts with a blueprint, and so the ink and parchment are tools equally as important as the hammer and anvil!"},{"name":"REGITT","text":"I reckon this should keep us settled for a while yet, but as I said before, the flow of ideas is constant. I may have need of your services again sooner rather than later."}],"reward":{"gil":606,"reputation":60,"items":[{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":8},{"id":28188},{"num":25,"id":9},{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":11},{"id":28188},{"num":25,"id":12},{"id":28188},{"num":25,"id":13},{"id":28188},{"num":25,"id":8}]},"reqs":{"beastrank":3,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}},{"type":"item","id":"31154","obj":{"i":31154,"n":"Blueprint Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"31155","obj":{"i":31155,"n":"Blueprint Supplies","l":290,"c":21005,"t":61}}]}