{"quest":{"name":"Unbreakable Plate","location":"Lakeland","id":69457,"patch":5.3,"sort":120,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"usedItems":[31174,31175],"journal":["Regitt feels the need to develop more robust armor plating.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with the dwarven surveyor near Radisca's Round.","The dwarven surveyor has tasked you with crafting an experimental armor plating component, then delivering the completed item to Regitt."],"objectives":["Speak with the dwarven surveyor near Radisca's Round.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to Regitt</span></span>."],"dialogue":[{"name":"REGITT","text":"Our Rolling Tankards're meant to protect merchants from stray eaters and their ilk. They can't be dainty little tin frogs, now can they!? No, we need those tanks sturdy enough to shrug off the most monstrous of maulings!"},{"name":"REGITT","text":"That's why we've assigned a crew for developing new materials that can enhance our armor plating."},{"name":"REGITT","text":"If you're keen to add your talents to the mix, you'll find our chief surveyor and his team out searching for potential resources over near Radisca's Round."},{"name":"DWARF03921","text":"Lali-ho! You're that artisan Regitt's been gabbin' about, are you? Then get your tools and whatnot ready, 'cause you're right on time to lend a hand!"},{"name":"DWARF03921","text":"See, I've just had an epiphany about alloys. Smelt me an ingot using these materials in the proper ratio, and we'll have ourselves a new metal component for reinforcing armor plates!"},{"name":"DWARF03921","text":"See, I've just had an epiphany about structural integrity. Craft me some cushioning using these materials, and we'll have ourselves a new component for absorbing impact on armor plates!"},{"name":"DWARF03921","text":"See, I've just had an epiphany about structural integrity. Craft me some coating using these materials, and we'll have ourselves a new component for reducing wear and tear on armor plates!"},{"name":"DWARF03921","text":"Don't be afraid to ask for more resources should you need them─I don't bite! Otherwise, once you're satisfied, you can cart your creation straight back to Regitt. We've got a bit more digging to do!"},{"name":"DWARF03921","text":"Once you're satisfied, you can cart your creation straight back to Regitt. We've got a bit more digging to do!"},{"name":"DWARF03921","text":"Once you're satisfied, you can cart your creation straight back to Regitt. We've got a bit more digging to do!"},{"name":"DWARF03921","text":"Once you're satisfied, you can cart your creation straight back to Regitt. We've got a bit more digging to do!"},{"name":"DWARF03921","text":"Eh? Made a mess of things, have you? Not to worry, we've dug up a pile of all the stuff you're likely to need!"},{"name":"DWARF03921","text":"Eh? Made a mess of things, have you? Not to worry, we've dug up a pile of all the stuff you're likely to need!"},{"name":"DWARF03921","text":"Eh? Made a mess of things, have you? Not to worry, we've dug up a pile of all the stuff you're likely to need!"},{"name":"REGITT","text":"Our master crafter returns! What have you got for me, then?"},{"name":"REGITT","text":"Well, bugger me! I never even thought of trying something like <span class=\"emphasis\">that</span>! We need to start testing right away!"},{"name":"REGITT","text":"For the initial trial, we'll forge some plate armor using your new component, and then strap it onto a nice big Galdjent lad. I'm hoping it withstands all the axe blows, 'cause that's when we get to break out the muskets! Boom boom boom!"},{"name":"REGITT","text":"...What? You didn't think I was serious, did you? We don't test like that anymore! ...Not since the accident."},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":606,"reputation":60,"items":[{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":8},{"id":28188},{"num":25,"id":9},{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":11},{"id":28188},{"num":25,"id":12},{"id":28188},{"num":25,"id":13},{"id":28188},{"num":25,"id":8}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}},{"type":"item","id":"31174","obj":{"i":31174,"n":"Experimental Plating Component Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"31175","obj":{"i":31175,"n":"Experimental Plating Component","l":290,"c":23001,"t":61}}]}