{"quest":{"name":"Spreading the Word","location":"Lakeland","id":69455,"patch":5.3,"sort":118,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"journal":["Regitt wishes to enlist your help in raising Watts's Anvil out of obscurity.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak to the dwarven promoter at Fort Jobb.","/psych up the dwarven promoter.","Report to Regitt."],"dialogue":[{"name":"REGITT","text":"Making these tanks is one thing...but getting folk to actually <span class=\"emphasis\">use</span> them is another."},{"name":"REGITT","text":"Any merchant worth his salt'll be wary of some unknown, untested artisan, so we've launched a campaign to spread the name of Watts's Anvil far and wide!"},{"name":"REGITT","text":"The only problem is, I'm worried that our chosen promoter's not quite ready for the world beyond Tomra. His schedule should put him in Fort Jobb at the moment, and I'd appreciate it if you could lend him a bit of support!"},{"name":"DWARF03919","text":"Look at this, <span class=\"highlight\">Forename</span>! I managed to gather me a good-sized crowd."},{"name":"DWARF03919","text":"When you need to grab folks' attention, the good ol' “lali hop” works just as well here as it does back home!"},{"name":"DWARF03919","text":"Now that everyone's watching, though, I feel a bit silly dancing alone. It <span class=\"emphasis\">might</span> help to hear a few words of encouragement..."},{"name":"DWARF03919","text":"You feel the weight of an expectant gaze from beneath the dwarf's helmet. Maybe a heartfelt <span class=\"highlight\">psych</span> up is just what the promoter needs."},{"name":"DWARF03919","text":"I don't know if I can go through with this..."},{"name":"DWARF03919","text":"You feel the weight of an expectant gaze from beneath the dwarf's helmet. Maybe a heartfelt <span class=\"highlight\">psych</span> up is just what the promoter needs."},{"name":"DWARF03919","text":"I, uh... No. I don't think that's going to help."},{"name":"DWARF03919","text":"You feel the weight of an expectant gaze from beneath the dwarf's helmet. Maybe a heartfelt <span class=\"highlight\">psych</span> up is just what the promoter needs."},{"name":"DWARF03919","text":"Aye, that's got the fire going again. Right, give me some room!"},{"name":"DWARF03919","text":"This performance courtesy of Watts's Anvil! We forge even better than we dance!"},{"name":"DWARF03919","text":"Thanks, <span class=\"highlight\">Forename</span>, I think I'm over my stage fright now. You can let Regitt know that I'll be letting everyone <span class=\"emphasis\">here</span> know that, you know...we exist and everything."},{"name":"DWARF03919","text":"I'll be staying around this area for a while, making sure every single soul has heard the name of Watts's Anvil."},{"name":"DWARF03919","text":"Please tell Regitt the campaign is proceeding as planned!"},{"name":"REGITT","text":"Welcome back! How fares the campaign?"},{"name":"REGITT","text":"...The lali hop? What a fantastic idea! Traditionally, we'd use it to warm up on a cold morning, but it seems to be just as effective at warming up a crowd."},{"name":"REGITT","text":"Maybe I'll round up a few fellows and join in the next performance. A troupe of dancing dwarves ought to turn a few heads!"}],"reward":{"gil":679,"reputation":60,"items":[{"id":28188}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}}]}