{"quest":{"name":"Close to Clearmeltdown","location":"Lakeland","id":69458,"patch":5.3,"sort":121,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"journal":["Regitt seems to have worked himself into a fury.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with the overdue dwarves at Clearmelt.","Report to Regitt."],"dialogue":[{"name":"REGITT","text":"Grrr! Those good-for-nothing, slow-footed, heavy-helmed sluggards are <span class=\"emphasis\">still</span> not back from Clearmelt!"},{"name":"REGITT","text":"I gave my lads permission to soak in the springs for a bell or two, but we're way past that now! I'll wager my grandfather's whiskers that all thoughts of work have evaporated with the steam."},{"name":"REGITT","text":"Speaking of steam, I think I feel some coming out my ears. You'll have to go and get them─I'm liable to take a pickaxe to their lazy skulls if I go myself."},{"name":"DWARFA03922","text":"Ah... This is the life."},{"name":"DWARFA03922","text":"...Eh? Regitt sent you? W-Wait, how long has it been!? 'Scuse me, must dash!"},{"name":"DWARFB03922","text":"Phew, my skin is all tingling. I feel like a boiled egg..."},{"name":"DWARFB03922","text":"What do you mean “time's up”? ...Oh bugger! Regitt is going to crack my well-cooked head!"},{"name":"DWARFC03922","text":"&lt;belch&gt; Nothin' like a shtrong brew after a─&lt;hic&gt;─hot bath."},{"name":"DWARFC03922","text":"...Back to─&lt;hic&gt;─work? Fine. The walk should shober me─&lt;hic&gt;─up. A bit."},{"name":"REGITT","text":"My thanks, <span class=\"highlight\">Forename</span>! Those limp-bearded layabouts finally stumbled in!"},{"name":"REGITT","text":"I understand, I do─after all, there's not a Tholl alive who hasn't lingered overlong in the secret springs of Mt. Gulg. When you're up to your earlobes in soothing hot water, anyone can forget the passage of time."},{"name":"REGITT","text":"But what I can't forgive is forgetting your bloody duties! Oh, I'll have those lads chained to their workbenches until every task they missed is checked off the ledger! And then some!"}],"reward":{"gil":606,"reputation":60,"items":[{"id":28188}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}}]}