{"quest":{"name":"Demolition Demo","location":"Lakeland","id":69459,"patch":5.3,"sort":122,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"journal":["Regitt needs a pilot to demonstrate the Rolling Tankard's firepower.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Speak with Wamutt.","Pilot the Rolling Tankard to Clearmelt and fire its cannon at the target automaton.","Pilot the Rolling Tankard to Clearmelt and fire its cannon at the target automaton a second time.","Report to Regitt."],"dialogue":[{"name":"REGITT","text":"A few well-placed words from Lorathia, and we've got ourselves a gaggle of prospective buyers. They're over at Clearmelt right now, waiting on a demonstration of the Rolling Tankard's firepower!"},{"name":"REGITT","text":"One of us could pilot the tank, of course... But, you know, I'd feel far more confident if a seasoned warrior such as yourself was guiding the cannon. Wouldn't be anywhere near as impressive if we <span class=\"emphasis\">missed</span> the bloody target, eh?"},{"name":"REGITT","text":"Off you go, then! Wamutt will give you the pre-demonstration briefing."},{"name":"WAMUTT","text":"Where've you been!? We need to get this show on the road!"},{"name":"WAMUTT","text":"Briefing shmiefing! Just get in the tank, drive it over to Clearmelt, and blast the target into next week! Easy!"},{"name":"WAMUTT","text":"What are you waiting for? Head over to Clearmelt, and blow those merchants away! Uh, with the demonstration─not the cannon."},{"name":"SYSTEM","text":"An automaton stands immobile, awaiting its fate with what seems almost an air of resignation... Speak to Wamutt at Watts's Anvil to pilot a Rolling Tankard, then command its main cannon to fire upon the automaton target."},{"name":"AUDIENCE03923","text":"(-Entranced Entrepreneur-)Oh, my! That cannon has quite a kick! Let's see you fire it one more time, if you please!"},{"name":"AUDIENCE03923","text":"(-Entranced Entrepreneur-)Splendid! Just splendid! Enough power to discourage even the most monstrous eater, I'd wager. Mark me down as very interested, master dwarf."},{"name":"DWARF03923","text":"(-Dwarven Promoter-)Nice shootin', <span class=\"highlight\">Forename</span>! You can head back to the Anvil, if you like─I think Regitt'll be happy to hear how it all went!"},{"name":"REGITT","text":"Now there's the grin of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who just left a smoking hole in the ground. I take it this means the demonstration went as planned?"},{"name":"REGITT","text":"Aye, we could describe it all we want, but Lorathia was right─there's naught better than showing off the destruction firsthand. I reckon we'll need to make this a regular event!"}],"reward":{"gil":752,"reputation":60,"items":[{"id":28188}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}}]}