{"quest":{"name":"Wayward 'Tons","location":"Lakeland","id":69452,"patch":5.3,"sort":115,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"journal":["Regitt gazes glumly into the distance, perhaps wondering at the absence of some wayward automata.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest."],"objectives":["Search for wayward automata in the Forest of the Lost Shepherd.","Deliver the wayward automata to Regitt."],"dialogue":[{"name":"REGITT","text":"Ugh, where are they!? Those automata were due back ages ago! I sent them into the trees to gather materials, but they're nowhere to be seen."},{"name":"REGITT","text":"We'll never be able to build our tanks at this rate. But if I just traipse off into the undergrowth to find them, I risk becoming as lost as that forest's titular shepherd. I really should study that map a bit more..."},{"name":"REGITT","text":"Anyway! You're here now, and you are─I assume─far more familiar with the local geography. Do me a favor and bring back that pair of directionally challenged dolts!"},{"name":"TALLFUATH","text":"Greetings, good mortal! What brings you into this wondrous woodland? If you've business with me, then I'm afraid it must wait. I have a previous and pressing engagement!"},{"name":"TALLFUATH","text":"Mischievous mortal, explain yourself at once! Why do you seek to abscond with this marvelous and mystical Fuath?"},{"name":"TALLFUATH","text":"...A dwarven-made automaton, you say?"},{"name":"TALLFUATH","text":"O cruel truth! I thought myself chasing some new worldly kin, who had sheathed their fae form with an iron-hard skin..."},{"name":"TALLFUATH","text":"So much time, wasted! There are precious herbs to pluck and potions to brew. Take your prize and bother me no more!"},{"name":"REGITT","text":"Lali-ho! You found our wayward automata, then?"},{"name":"REGITT","text":"Got myself a stack of spare parts to fix these two. They don't seem particularly damaged at first glance, but let's take a look and see what went wrong... Hm?"},{"name":"REGITT","text":"Out of fuel...? But I gave 'em enough to last for bloody hours! Something must've been chasing them to burn up coal that fast. See, this is why we need those tanks!"}],"reward":{"gil":606,"reputation":60,"items":[{"id":28188}]},"reqs":{"beastrank":5,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}}]}