{"quest":{"name":"Remote Repairs","location":"Lakeland","id":69463,"patch":5.3,"sort":126,"interval":"daily","repeatable":1,"beast":14,"eventIcon":71222,"issuer":1033712,"target":1033712,"genre":61,"usedItems":[31180,31181],"journal":["Regitt wishes to enlist your help for a repair job.<br><br>※Please note that the difficulty of this quest has been synced to your current level. Furthermore, you may not proceed with a class or job that is different from when you accepted this quest.","Speak with Shigitt.","Deliver the requested item to the dwarven tinkerer at the Mortal Irons.","Report to Regitt."],"objectives":["Speak with Shigitt.","<span class=\"alternative-container\"><span class=\"alternative\">Synthesize [Error]</span><span class=\"alternative\">Deliver [Error] to the dwarven tinkerer at the Mortal Irons</span></span>.","Report to Regitt."],"dialogue":[{"name":"REGITT","text":"Perfect. Just bloody perfect... Hm? Oh, our odd-job automaton is broken. Poor thing looks about ready for the scrap heap."},{"name":"REGITT","text":"And no, we didn't shoot it with a cannon, if that's what you're thinking─it fell to pieces all on its own! Ugh, we're not going to get much done around here until our favorite runner and fetcher is fixed."},{"name":"REGITT","text":"That is─as you might have guessed─where you come in. Shigitt will explain how you can best lend a hand."},{"name":"SHIGITT","text":"Thanks for coming, <span class=\"highlight\">Forename</span>! We could use another artisan to help speed the repairs along."},{"name":"SHIGITT","text":"What I need from you is a flexible metal sheet for reinforcing the automaton's chassis. We patched up the gaping hole with a serving tray, but that was really only a temporary solution..."},{"name":"SHIGITT","text":"What I need from you is a replacement casing for protecting the automaton's main joints. We can't have it rolling through the dirt and the mud with all its...uh...“bits” exposed."},{"name":"SHIGITT","text":"What I need from you is a fresh batch of oil for the automaton's reserves. It's running low after leaking from several, um, “unplanned” perforations, and the supply's been contaminated with debris in any case..."},{"name":"SHIGITT","text":"Here's some raw materials to get you started. Anything else, you can pick up from Ronitt's helper across the way."},{"name":"SHIGITT","text":"Once you're satisfied with your work, I want you to deliver it to our tinkerer. You'll find him way out in the ruins they call the “Mortal Irons.” Safety precautions, and all that."},{"name":"AUTOMATON","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON","text":"&lt;beep&gt; Materials detected. Request denied."},{"name":"AUTOMATON","text":"&lt;beep&gt; Ingredients detected. Request denied."},{"name":"AUTOMATON","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON","text":"&lt;beep&gt; Request for materials acknowledged."},{"name":"AUTOMATON","text":"&lt;beep&gt; Request for ingredients acknowledged."},{"name":"DWARFA03927","text":"&lt;shudder&gt; I thought that last bump on the road would be the end of me... Now, the sooner that artisan arrives, the sooner I can─ Oh! Lali-ho! You've brought my supplies, then?"},{"name":"DWARFA03927","text":"Aye, this should do the trick. Thank you kindly!"},{"name":"DWARFA03927","text":"I know it's an odd place to make repairs, but we were worried about secondary explosions. Wouldn't do to have sparks flying near the Anvil's fuel barrels now, would it? Ahem, you should probably be on your way. Try not to stomp, eh?"},{"name":"DWARFA03927","text":"Thanks again for making the trek all the way out here. I think I have what I need to get this clanker fixed up and stable again."},{"name":"REGITT","text":"...Oh, good, you look decidedly unscorched. How did it go?"},{"name":"REGITT","text":"Glad to hear that. Took us all by surprise when that automaton blew up, but I'm confident our tinkerer will get it working again!"},{"name":"REGITT","text":"You should've seen it! Just ran off in the middle of a chore and spontaneously self-destructed. All we did was have it toiling from dawn till dusk, dusk till dawn, day in, day out, for weeks on end. Must've been defective."},{"name":"REGITT","text":"But with your high-quality contribution, I'm sure it'll soon be back at the grindstone─this time even grindier than before!"},{"name":"SYSTEM","text":"Normal-quality items crafted in the course of this quest serve no purpose and cannot be sold. It is recommended that you discard them."}],"reward":{"gil":679,"reputation":60,"items":[{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":8},{"id":28188},{"num":25,"id":9},{"id":28188},{"num":25,"id":10},{"id":28188},{"num":25,"id":11},{"id":28188},{"num":25,"id":12},{"id":28188},{"num":25,"id":13},{"id":28188},{"num":25,"id":8}]},"reqs":{"beastrank":6,"jobs":[{"lvl":70,"id":33}]}},"partials":[{"type":"npc","id":"1033712","obj":{"i":1033712,"n":"Regitt","l":2953,"q":28}},{"type":"item","id":"28188","obj":{"i":28188,"n":"Hammered Frogment","l":1,"c":65080,"t":100}},{"type":"item","id":"31180","obj":{"i":31180,"n":"Automaton Repair Component Materials","l":1,"c":25919,"t":61}},{"type":"item","id":"31181","obj":{"i":31181,"n":"Automaton Repair Component","l":290,"c":21003,"t":61}}]}