{"quest":{"name":"Memoirs from the Front","location":"Bozjan Southern Front","id":69478,"patch":5.35,"sort":102,"unlocksFunction":1,"eventIcon":71341,"issuer":1032428,"target":1032428,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"RESISTANCERECORDER","text":"Blade <span class=\"highlight\">Surname</span>. A moment, if you would. I serve as war historian for the Bozjan Resistance, and Marsak tells me you may be able to help in my work."},{"name":"RESISTANCERECORDER","text":"I needn't tell you how the atrocities of war can wear on a soldier. As such, it has become increasingly difficult to find one of sound mind and body who can accurately recount their experiences on the battlefield."},{"name":"RESISTANCERECORDER","text":"For a hardened warrior such as yourself, I suspect keeping an account of the foes you've faced should prove a rather trifling task."},{"name":"RESISTANCERECORDER","text":"That's not to say I expect a detailed record of your <span class=\"emphasis\">every</span> interaction, mind. If you should trade blows with any notable figures, however, I would hear of it."},{"name":"RESISTANCERECORDER","text":"All information gathered from the battle for Bozja will ultimately be compiled within my field records. Here─you may use this to take note of any memorable encounters in the field."},{"name":"RESISTANCERECORDER","text":"I realize the burden this places on you, which is why I will see to it personally that you are duly compensated for your efforts."},{"name":"SYSTEM","text":"The <span class=\"highlight\">Field Record</span> is now available under Collection in the Duty section of the main menu."},{"name":"SYSTEM","text":"Upon completion of certain quests, skirmishes, and critical engagements in the Bozjan southern front, you will obtain a sheaf of notes."},{"name":"SYSTEM","text":"These notes can then be used to add entries to the Field Record."},{"name":"SYSTEM","text":"Any unused notes can be exchanged for various rewards by speaking with the Resistance historian."},{"name":"RESISTANCERECORDER","text":"A parting word of advice, if I may. While there is no telling what you will face on the southern front, Dmitar over there may be able to assist you in finding worthwhile battles for our field record."}],"reqs":{"quests":[69477]},"next":[69479]},"partials":[{"type":"npc","id":"1032428","obj":{"i":1032428,"n":"Resistance Historian","l":3534,"q":1}},{"type":"quest","id":"69477","obj":{"i":69477,"n":"Where Eagles Nest","g":76,"l":"Gangos","s":101,"f":1}},{"type":"quest","id":"69479","obj":{"i":69479,"n":"An Expected Engagement","g":76,"l":"Bozjan Southern Front","s":103,"f":1}}]}