{"quest":{"name":"An Expected Engagement","location":"Bozjan Southern Front","id":69479,"patch":5.35,"sort":103,"unlocksFunction":1,"eventIcon":71341,"issuer":1034006,"target":1034006,"genre":76,"journal":["Dmitar has a plan to thin out the enemy ranks."],"objectives":["Defeat 4th Legion slashers.","Defeat 4th Legion nimrods.","Speak with Dmitar."],"dialogue":[{"name":"DMITAR","text":"Greetings, Blade <span class=\"highlight\">Surname</span>. I take it you will soon be joining the others on the southern front, yes?"},{"name":"DMITAR","text":"Though my duties have kept me here for the most part, I have heard tell of the carnage wrought in battle by enemy soldiers and their warmachina."},{"name":"DMITAR","text":"Indeed, the imperials often prefer to wait until their intended target has been weakened before sending more troops to deliver the final blow. Yet for all their cunning, they are remarkably predictable."},{"name":"DMITAR","text":"Let us suppose you destroyed one of their warmachina, and the enemy receives word of your victory. They would no doubt assume the effort has left you exhausted, perhaps even badly wounded. A perfect opportunity to send reinforcements and overwhelm you."},{"name":"DMITAR","text":"But what if, unbeknownst to them, we are prepared for the arrival of these additional troops? It would be an opportunity to further diminish their ranks."},{"name":"DMITAR","text":"I would ask you venture out onto the battlefield and fell two 4th Legion nimrods and two 4th Legion slashers."},{"name":"DMITAR","text":"Should they decide to send reinforcements, there will be no element of surprise to favor them."},{"name":"SYSTEM","text":"By defeating warmachina on the Bozjan southern front, there is a chance to initiate critical engagements, which are special encounters limited to a small number of participants."},{"name":"SYSTEM","text":"Victory in critical engagements will increase your mettle, as well as earn you various spoils."},{"name":"SYSTEM","text":"Should you happen upon a critical engagement and wish to join, you can participate by selecting the mission via the Resistance Recruitment window."},{"name":"DMITAR","text":"It should take no more than the defeat of two 4th Legion nimrods and two 4th Legion slashers to draw the Garleans' attention. And when they come, we will be ready for them."},{"name":"DMITAR","text":"Ah, you are returned, and none the worse for wear, I see. I expect that's more than we can say for any imperials who dared cross your path!"},{"name":"DMITAR","text":"But enough about them. I wish to ask if you noticed any peculiar crystalline objects in your time on the battlefield. Bozjan clusters, we call them."},{"name":"DMITAR","text":"The Bozja incident wrought a most unexpected change in the land, which we believe is what caused these clusters to appear. Our quartermaster would have any samples we can find for further study into this phenomenon."},{"name":"DMITAR","text":"We haven't much, but you can be certain she will see you rewarded for anything you can offer."},{"name":"SYSTEM","text":"Upon defeating warmachina, there is a chance you will obtain Bozjan clusters."},{"name":"SYSTEM","text":"These clusters can be exchanged with the Resistance quartermaster to gain priority when players are selected for participation in critical engagements. They may also be exchanged for various goods."},{"name":"DMITAR","text":"If you don't mind my asking, have you taken time to report to my commanding officer?"},{"name":"DMITAR","text":"Considering all you've done to help us thus far, I'd say you've more than proven your mettle. He's certain to want to hear about all you've done out there."}],"reward":{"gil":685,"gcseal":300},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69478]},"next":[69480]},"partials":[{"type":"npc","id":"1034006","obj":{"i":1034006,"n":"Dmitar","l":3534,"q":4}},{"type":"quest","id":"69478","obj":{"i":69478,"n":"Memoirs from the Front","g":0,"l":"Bozjan Southern Front","s":102,"f":1}},{"type":"quest","id":"69480","obj":{"i":69480,"n":"Lost No Longer","g":76,"l":"Bozjan Southern Front","s":104,"f":1}}]}