{"quest":{"name":"Picking Up the Trail","location":"Bozjan Southern Front","id":69486,"patch":5.35,"sort":110,"unlocksFunction":1,"eventIcon":71341,"issuer":1034464,"target":1034005,"genre":76,"journal":["Lilja appears lost in thought, but you are certain there is only one thing on her mind."],"objectives":["Investigate the designated location.","Speak with Lilja."],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] is required to proceed with this quest."},{"name":"LILJA","text":"Listen, <span class=\"highlight\">Forename</span>. I don't want to get your hopes up, but I think I know how to find Mikoto."},{"name":"LILJA","text":"You said Misija waited until after the crystal focus had absorbed aether from the area before making off with it and Mikoto, right?"},{"name":"LILJA","text":"Well, if we can use this equipment to trace the aetherial signature of the charged crystal focus, maybe it will lead us to Mikoto too. That's assuming, of course, they're being kept in the same place."},{"name":"LILJA","text":"We're going to want to cover the entire southern front, and for that, at least two more sensors need to be set up out there. Think you're up to it?"},{"name":"LILJA","text":"I found two spots that should give us maximum coverage. Here, let me mark them on your map. I know it's a long shot, but we have to try...right?"},{"name":"LILJA","text":"Gods, I hope this works..."},{"name":"LILJA","text":"(-Lilja-)All set? Then I'll start up the remote scanner."},{"name":"LILJA","text":"(-Lilja-)That should do it. One more, and with any luck we'll track down the crystal focus and Mikoto."},{"name":"LILJA","text":"(-Lilja-)Perfect! Come back to base, and I'll see if I can't track down the crystal focus."},{"name":"LILJA","text":"(-Lilja-)All set? Then I'll start up the remote scanner."},{"name":"LILJA","text":"(-Lilja-)That should do it. One more, and with any luck we'll track down the crystal focus and Mikoto."},{"name":"LILJA","text":"(-Lilja-)Perfect! Come back to base, and I'll see if I can't track down the crystal focus."},{"name":"LILJA","text":"...Ah. You're back."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Trouble tracking down the crystal focus?"},{"name":"A2","text":"What's wrong? Do we need another sensor?"},{"name":"LILJA","text":"No. No, everything went according to plan. I managed to locate the crystal focus."},{"name":"LILJA","text":"The thing is..."},{"name":"MARSHAK","text":"It is as we feared. The crystal focus is being held at the castrum."},{"name":"LILJA","text":"Makes sense when you think about it, what with it being the enemy's main stronghold and all. Sorry for wasting your time out there, <span class=\"highlight\">Forename</span>."},{"name":"MARSHAK","text":"Nonsense, Lilja. For all we knew, the focus could have very well been moved to Dalmasca."},{"name":"MARSHAK","text":"But thanks to you and Blade <span class=\"highlight\">Surname</span>, we have removed all doubt as to its whereabouts."},{"name":"LILJA","text":"That's true, I suppose."},{"name":"MARSHAK","text":"The reason for Misija's betrayal yet eludes us, but the Garleans are not like to understand how to make use of the crystal focus. Not without assistance."},{"name":"MARSHAK","text":"Meaning Mikoto is, in all likelihood, being held at the castrum as well."},{"name":"LILJA","text":"Then there's still a chance to save her..."},{"name":"SYSTEM","text":"Meanwhile, at Castrum Lacus Litore..."},{"name":"MEESIYA","text":"Yes, over there."},{"name":"MIKOTO","text":"&lt;groan&gt;"},{"name":"MIKOTO","text":"Misija...? Where...?"},{"name":"MEESIYA","text":"You're going to answer a few questions for me. We can start with how you are able to glimpse into the future."},{"name":"MIKOTO","text":"Misija... Why? Why are you helping the Empire?"},{"name":"MEESIYA","text":"I'm the one asking the questions here. Now answer!"},{"name":"MIKOTO","text":"No. Not until you tell me why."},{"name":"MEESIYA","text":"I don't think you understand your situation here. Or are you truly that naive?"},{"name":"MIKOTO","text":"Is it for power? Renown? Have you always been on their side?"},{"name":"MIKOTO","text":"I know you, Misija. You're a woman of conviction, and you wouldn't do something like this without good reason."},{"name":"MEESIYA","text":"If you know me as well as you say, I would hazard you already have the answer."},{"name":"MIKOTO","text":"...You would truly place your faith in Noah van Gabranth?"},{"name":"MIKOTO","text":"I've read about him and his father, the famed knights from the Republic of Landis. They say he was a man of vision."},{"name":"MIKOTO","text":"He was made legatus of the IVth Imperial Legion, and from what intelligence I could gather, he pays no heed to the race, parentage, or creed of his followers."},{"name":"MIKOTO","text":"And that same impartial judgment extends to the provinces under his control, if I am not mistaken. Havens for those seeking a life free of prejudice and hate."},{"name":"MIKOTO","text":"But do you truly believe equality can be found under an imperial standard?"},{"name":"MEESIYA","text":"My, my. The dutiful bookworm <span class=\"emphasis\">can</span> read between the lines. Perhaps I gave you too little credit."},{"name":"MIKOTO","text":"I can but posit theories and conjecture, for I will never truly know of the indignity your family suffered. Nor can I speak on the alarming disparity between the nobles and commoners, even before Bozja succumbed to imperial rule."},{"name":"MIKOTO","text":"As I understand, it was a country where the needs of the few outweighed those of the many. The wealthy were free to forge their own futures, while the poor were free only to die should they fail in their daily struggle to survive."},{"name":"MIKOTO","text":"And even if some few nobles were opposed to the nation being governed by an oligarchy, their peers would never relinquish their power and wealth for the greater good."},{"name":"MIKOTO","text":"While that Bozja is no more, I realize there are those among the Resistance who yearn for the halcyon days of their forebears, who would judge you based on your lineage rather than the content of your character."},{"name":"MIKOTO","text":"Their voices are but echoes of a reprehensible past. You should understand better than anyone the future Bajsaljen and Marsak mean to build, a way forward paved with dignity and equality. Times change, Misija. People change."},{"name":"MEESIYA","text":"No, people don't change. They only fool themselves into believing they can."},{"name":"MEESIYA","text":"I was ridiculed, marginalized, treated like an “other.” By the mere virtue of being highborn theirs was the righteous path, mine the immoral."},{"name":"MEESIYA","text":"Bajsaljen and Marsak claim they want to put an end to the discrimination, but there is no escaping their true nature."},{"name":"MEESIYA","text":"Their hatred must be driven out with force."},{"name":"MIKOTO","text":"Would putting your faith in them be such a terrible thing?"},{"name":"MEESIYA","text":"Oh, if you knew the depths of their malice. Their treachery."},{"name":"MEESIYA","text":"Perhaps I should tell you the tragedy of Queen Gunnhildr, and the great betrayal of her followers."},{"name":"MEESIYA","text":"I'm sure you've heard the legends of Save the Queen."},{"name":"MIKOTO","text":"The blessed blade that could only be wielded by Queen Gunnhildr. Yes, I've heard the tales."},{"name":"MIKOTO","text":"When her kingdom came under attack during the Fourth Umbral Calamity, she brought the full might of the blade to bear to save her people, and in so doing, gave her own life."},{"name":"MIKOTO","text":"A bittersweet end to her reign, but I fail to see what that has to do with anything."},{"name":"MEESIYA","text":"Before the Fourth Umbral Calamity, Gunnhildr's Blades foresaw their coming doom. As the kingdom's acting political body, they saw it as their duty to save their people at any cost, and so devised a plan to save Bozja using the power of the holy blade."},{"name":"MEESIYA","text":"The queen's body would serve as a conduit for the blade's power, allowing them to summon a god."},{"name":"MIKOTO","text":"No... You don't mean...?"},{"name":"MEESIYA","text":"A primal summoning, yes. Though perhaps it would be more fitting to call it an eikon. The blade was, after all, originally a relic stolen from the Allagans."},{"name":"MIKOTO","text":"An eikon...heavens forfend."},{"name":"MEESIYA","text":"There was one problem, however. The queen knew that, once she took in the power of this god, there would be no turning back. She was a coward, and despite her duty to protect the people, she chose her own life over theirs."},{"name":"MEESIYA","text":"Yet Gunnhildr's Blades would not see their efforts come to naught. For they soon realized the sacrifice need not be the presently reigning queen. Nor did they need to be of noble blood."},{"name":"MEESIYA","text":"And so a lowborn shrine maiden was chosen to ascend the throne. Obedient to a fault, she did not hesitate to give her life to forestall the coming Calamity."},{"name":"MEESIYA","text":"Would that this tragic tale end there, but I'm afraid it takes a rather bloody turn."},{"name":"MEESIYA","text":"You see, despite sacrificing herself to save Bozja, the new queen did not die, nor was she consumed by the eikon's power."},{"name":"MIKOTO","text":"There was a woman of Ishgard, Ysayle, capable of such a feat. But to embrace the power of the eikon and retain her sense of self...that would mean this queen possessed the Echo."},{"name":"MEESIYA","text":"And her power struck fear into the hearts of Gunnhildr's Blades, for a god now walked among them."},{"name":"MEESIYA","text":"But rather than the puppet the Blades had wished for, she was pure and free, and for that, she was slain."},{"name":"MEESIYA","text":"The Blades would not─could not─risk her discovering the truth of her ascension. That she was but a sacrificial lamb to save their highborn brethren."},{"name":"MEESIYA","text":"They claimed the queen had gone mad, drunk with the god's power, leaving them no choice but to slay her. She was then buried, along with the blade, and the truth."},{"name":"MIKOTO","text":"Where did you hear this?"},{"name":"MEESIYA","text":"Let's just say it's a bit of family history."},{"name":"MEESIYA","text":"Now, answer my question─how are you able to see the future?"},{"name":"MIKOTO","text":"I... I don't know. I've never been able to use it of my own volition."},{"name":"MEESIYA","text":"I suppose it doesn't matter. We'll drag it out of you soon enough."},{"name":"LILJA","text":"Just thinking about what they might be doing to Mikoto, I... I...<br>Please, you have to save her!"}],"reward":{"gil":906,"gcseal":3250},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69485]},"next":[69487]},"partials":[{"type":"npc","id":"1034464","obj":{"i":1034464,"n":"Lilja","l":3534,"q":1}},{"type":"npc","id":"1034005","obj":{"i":1034005,"n":"Lilja","l":3534,"q":1}},{"type":"quest","id":"69485","obj":{"i":69485,"n":"Signature Acquired","g":76,"l":"Bozjan Southern Front","s":109,"f":1}},{"type":"quest","id":"69487","obj":{"i":69487,"n":"The Lady of Blades","g":76,"l":"Bozjan Southern Front","s":111,"f":1}}]}