{"quest":{"name":"Lost No Longer","location":"Bozjan Southern Front","id":69480,"patch":5.35,"sort":104,"unlocksFunction":1,"eventIcon":71341,"issuer":1034006,"target":1034006,"genre":76,"usedItems":[30886],"journal":["Dmitar would share news of a peculiar find in the southern front."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Obtain a forgotten fragment</span><span class=\"alternative\">Deliver the forgotten fragment to Dmitar</span></span>."],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] is required to proceed with this quest."},{"name":"SYSTEM","text":"Resistance rank can be increased by reporting to the Resistance commander after earning sufficient mettle."},{"name":"DMITAR","text":"You've come at a good time, Blade <span class=\"highlight\">Surname</span>. I have a rather interesting report to share with you."},{"name":"DMITAR","text":"While out on reconnaissance, our scouts happened upon relics we confirmed once belonged to Gunnhildr's Blades!"},{"name":"DMITAR","text":"It was long believed the queen's guard possessed crystals within which they stored the knowledge of their fighting techniques, and this discovery has removed all doubt. These forgotten fragments, as we call them, may very well turn the tide of the war in our favor."},{"name":"DMITAR","text":"You see, much to our surprise, Master Gerolt claims to have experience working with similar crystals, and believes that the memories contained within can be extracted."},{"name":"DMITAR","text":"He has set fast to work on a means to do so, and assured us it won't be long before their secrets are revealed to us."},{"name":"DMITAR","text":"With their weapons and techniques at your command, you would be a true successor to the legacy of Gunnhildr's Blades."},{"name":"DMITAR","text":"This assumes you are able to procure more of these fragments, of course."},{"name":"DMITAR","text":"Judging by our scouts' report, it will not be an easy task. It would appear that, wherever they could be found, formidable beasts were not far behind."},{"name":"DMITAR","text":"Still, it may prove beneficial to rid the battlefield of such creatures, not only for the sake of our fellow soldiers, but for the chance to acquire any fragments that may be in the vicinity. I wish you the best of luck."},{"name":"SYSTEM","text":"Unidentified forgotten fragments can be obtained from felling monsters in the wild, as well as from skirmishes and critical engagements. They can also be traded or sold on the market board."},{"name":"DMITAR","text":"If you can find even a single fragment, we can begin the next step."},{"name":"SYSTEM","text":"Unidentified forgotten fragments can be obtained from felling monsters in the wild, as well as from skirmishes and critical engagements. They can also be traded or sold on the market board."},{"name":"DMITAR","text":"How did you fare searching for forgotten fragments?"},{"name":"DMITAR","text":"Well done, Blade <span class=\"highlight\">Surname</span>! Well done, indeed."},{"name":"DMITAR","text":"Now, before you can begin the extraction process, these shards must first be appraised so that we can tell what sort of memories they contain."},{"name":"DMITAR","text":"Henceforth, be sure to hand any fragments you find to one of our appraisers. "},{"name":"DMITAR","text":"In fact, one of them is stationed by that tent over there."},{"name":"SYSTEM","text":"Actions extracted from forgotten fragments are stored in the lost finds cache."}],"reward":{"gil":574,"gcseal":375,"items":[{"num":3,"id":30884},{"num":3,"id":30885},{"num":3,"id":30886}]},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69479]},"next":[69481]},"partials":[{"type":"npc","id":"1034006","obj":{"i":1034006,"n":"Dmitar","l":3534,"q":4}},{"type":"item","id":"30884","obj":{"i":30884,"n":"Forgotten Fragment of Caution","l":1,"c":20043,"t":63}},{"type":"item","id":"30885","obj":{"i":30885,"n":"Forgotten Fragment of Preparation","l":1,"c":20043,"t":63}},{"type":"item","id":"30886","obj":{"i":30886,"n":"Forgotten Fragment of Skill","l":1,"c":20043,"t":63}},{"type":"quest","id":"69479","obj":{"i":69479,"n":"An Expected Engagement","g":76,"l":"Bozjan Southern Front","s":103,"f":1}},{"type":"quest","id":"69481","obj":{"i":69481,"n":"On the Offensive","g":76,"l":"Bozjan Southern Front","s":105,"f":1}}]}