{"quest":{"name":"Time to Focus","location":"Bozjan Southern Front","id":69482,"patch":5.35,"sort":106,"unlocksFunction":1,"eventIcon":71341,"issuer":1034461,"target":1034004,"genre":76,"journal":["Mikoto and Misija are ready to put their plan into action."],"objectives":["Survey the designated area.","Investigate the designated location.","Speak with Mikoto."],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] is required to proceed with this quest."},{"name":"MIKOTO","text":"Apologies for the delay, but as you can see, the aether-monitoring devices have finally arrived."},{"name":"LILJA","text":"Oh my, <span class=\"highlight\">Forename</span>! Suddenly, I'm glad the chief insisted I make the delivery."},{"name":"LILJA","text":"I believe you and Miss Mikoto ordered these? The spectrometer needs a touch more fine-tuning, but it should be ready in no time at all."},{"name":"MIKOTO","text":"The sensors are to be placed at key locations close to the largest aether currents in the region. Once Lilja has finished making the final adjustments to the spectrometer, we can activate them remotely and isolate the aetherial signature we are looking for."},{"name":"MEESIYA","text":"It may seem somewhat far-fetched, but the theory is sound. Think of the aether currents as streams flowing underground which, at certain locations, converge into larger rivers. The streams can prove quite difficult to trace. The rivers, less so. "},{"name":"MEESIYA","text":"As you might imagine, because these rivers are a confluence of myriad streams, it is no simple task to filter out and extract aether of a specific frequency."},{"name":"MEESIYA","text":"Which is why before anything can be done, we first need a thorough analysis of the aether flowing through these larger currents."},{"name":"MEESIYA","text":"Once the signature we're after has been isolated, we can then trace it back to its source."},{"name":"MEESIYA","text":"One current flows here under this very camp. After setting sensors at two additional sites, we should be able to gather enough data to isolate the desired signature."},{"name":"MEESIYA","text":"Once traced back to its source, we should find something of a reservoir. Hopefully with suitable stores of aether to charge the crystal focus."},{"name":"MIKOTO","text":"Unfortunately, the two remaining sites where we intend to place sensors are presently points of conflict with the Empire."},{"name":"MIKOTO","text":"Might we ask that you go and set them?"},{"name":"MEESIYA","text":"I'll mark the locations on your map."},{"name":"MEESIYA","text":"Once the sensors are in place, use this linkpearl to contact us."},{"name":"MIKOTO","text":"I know this all sounds rather hazardous, but if anyone can make a success of this plan, it's you!"},{"name":"SYSTEM","text":"Looking about the area, there seems to be no way to cross the ravine. If you would reach the site of the aether current, you must enlist further aid from the Resistance."},{"name":"Q1","text":"Cross the ravine?"},{"name":"Q2","text":"Cross the ravine?"},{"name":"MIKOTO","text":"(-Mikoto-)Initiating the data collection protocol."},{"name":"MIKOTO","text":"(-Mikoto-)We've confirmed activity on our end. The sensor has burrowed into the ground, yes?"},{"name":"MIKOTO","text":"(-Mikoto-)Excellent. The rest we can handle from here. Return to base, and be careful."},{"name":"MIKOTO","text":"Welcome back, <span class=\"highlight\">Forename</span>. With the first sensor in place, Misija can begin... Wait, where did she...?"},{"name":"HROTHGARSOLDIER03946","text":"...And why is it that <span class=\"emphasis\">you</span> get to stay here, safe and sound, while the rest of us throw our lives away out there?"},{"name":"HROTHGARSOLDIER03946","text":"Oh, how she must have begged and pleaded for the commander to let her stay.<br>“Please, Commander Bajsaljen, don't make me go. I'll do <span class=\"emphasis\">anything</span> to remain here at camp!”<br>Pathetic..."},{"name":"HROTHGARSOLDIER03946","text":"Though I suppose you've never been one above begging, have you?"},{"name":"MEESIYA","text":"We'll see who's begging when I gut you like a fish."},{"name":"MARSHAK","text":"That's enough! All of you!"},{"name":"MARSHAK","text":"Our fight is with the Empire, not our brothers- and sisters-in-arms."},{"name":"MARSHAK","text":"Should I hear so much as a whisper of such demeaning remarks again, you will find judgment not before a court-martial, but here before my blade's edge. Am I understood?"},{"name":"MARSHAK","text":"Misija!"},{"name":"MARSHAK","text":"Let me speak with them. I'm certain they did not mean to make such crass remarks."},{"name":"MEESIYA","text":"So you would defend them, then?"},{"name":"MARSHAK","text":"Not as such, but you know how soldiers can be, especially those of supposedly gentle blood. They probably think of it as idle banter, is all."},{"name":"MEESIYA","text":"You and I are from different worlds, Marsak."},{"name":"MARSHAK","text":"Overhear them, did you? &lt;sigh&gt; What an embarrassment."},{"name":"MARSHAK","text":"Those buffoons are an unfortunate reminder of our past. You see, Bozja rose above its humble beginnings to become a prosperous nation, due in no small part to contributions of the nobility. To outsiders, it exemplified the qualities of an ideal republic. Appearances can be deceiving, however..."},{"name":"MARSHAK","text":"The disparity between nobles and commoners proved a chasm that could never be filled. Even under imperial rule, vestiges of that great divide would remain."},{"name":"MARSHAK","text":"I wished to believe everyone shared my vision of a unified Bozja, where all are equal in dignity and rights. But there are those who long for the status and privilege of that supposed golden era, when wealth and power were one and the same."},{"name":"MARSHAK","text":"And for every one of the “haves,” there were a thousand “have-nots.” Misija's family was of the latter. As a child, she walked for hours each day to and from school in the hope of a better life. The imperials recognized her dedication, and saw fit to educate her."},{"name":"MARSHAK","text":"Her talent has earned her no small amount of envy from her peers. Nevertheless, she is a faultless example of what a good soldier should be. That anyone would take her being lowborn as justification for ridicule is absurd. I will not stand for it."},{"name":"MARSHAK","text":"Might I ask that you keep this between us? While I am loath to sweep such matters under the rug, to address them here and now could very well undermine all we have fought so hard to achieve."},{"name":"AMIGART","text":"Can you believe Bajsaljen and Marsak, espousing this nonsense about dignity and equality. Do they honestly expect us to forget our lineage? All that our forebears had achieved before it was taken by the Empire?"},{"name":"ZWYNBHRUDA","text":"I understand your pain, my friend, but for now we must hold our tongues. Wait for our moment. When the Empire is at last driven out, then we can deal with Bajsaljen and the others."},{"name":"VORON","text":"We've been made to mingle with these baseborn bastards long enough. It is our right to govern this new Bozja, and the commander must be made to understand that."},{"name":"AMIGART","text":"Oh... Blade <span class=\"highlight\">Surname</span>! Have you need of something? We wished to speak privately, if you don't mind."},{"name":"ZWYNBHRUDA","text":"Is there, uh... Is there something you need, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>? If not, we really should be leaving for the front lines."},{"name":"AMIGART","text":"You were responsible for reviving Gunnhildr's Blades, were you not? I've been meaning to offer you my thanks. The people of Bozja appreciate all you've done for us."},{"name":"VORON","text":"I look forward to fighting at your side to drive out those imperial bastards. We'll show them, won't we?"},{"name":"MIKOTO","text":"The very moment our analysis of the aether current is complete, you will be the first to know."},{"name":"MIKOTO","text":"Though I am afraid we must ask you to delve deeper into enemy territory to reach the next site."},{"name":"MEESIYA","text":"A fool's errand unless we can drive the Empire's forces back further. I trust we can count on your assistance in that regard?"},{"name":"LILJA","text":"Of course we can! At least, I think so. We can...right?"}],"reward":{"gil":943,"gcseal":1575},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69481]},"next":[69483]},"partials":[{"type":"npc","id":"1034461","obj":{"i":1034461,"n":"Mikoto","l":3534,"q":1}},{"type":"npc","id":"1034004","obj":{"i":1034004,"n":"Mikoto","l":3534,"q":3}},{"type":"quest","id":"69481","obj":{"i":69481,"n":"On the Offensive","g":76,"l":"Bozjan Southern Front","s":105,"f":1}},{"type":"quest","id":"69483","obj":{"i":69483,"n":"Third Time's the Charm","g":76,"l":"Bozjan Southern Front","s":107,"f":1}}]}