{"quest":{"name":"Third Time's the Charm","location":"Bozjan Southern Front","id":69483,"patch":5.35,"sort":107,"unlocksFunction":1,"eventIcon":71341,"issuer":1034004,"target":1034004,"genre":76,"journal":["Mikoto has located another aether current."],"objectives":["Investigate the designated location.","Speak with Mikoto."],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] is required to accept this quest."},{"name":"AMIGAR","text":"Can you believe Bajsaljen and Marsak, espousing this nonsense about dignity and equality. Do they honestly expect us to forget our lineage? All that our forebears had achieved before it was taken by the Empire?"},{"name":"ZWYNBHRUDA","text":"I understand your pain, my friend, but for now we must hold our tongues. Wait for our moment. When the Empire is at last driven out, then we can deal with Bajsaljen and the others."},{"name":"VORON","text":"We've been made to mingle with these baseborn bastards long enough. It is our right to govern this new Bozja, and the commander must be made to understand that."},{"name":"AMIGART","text":"Oh... Blade <span class=\"highlight\">Surname</span>! Have you need of something? We wished to speak privately, if you don't mind."},{"name":"ZWYNBHRUDA","text":"Is there, uh... Is there something you need, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>? If not, we really should be leaving for the front lines."},{"name":"AMIGART","text":"You were responsible for reviving Gunnhildr's Blades, were you not? I've been meaning to offer you my thanks. The people of Bozja appreciate all you've done for us."},{"name":"VORON","text":"I look forward to fighting at your side to drive out those imperial bastards. We'll show them, won't we?"},{"name":"MIKOTO","text":"Your timing is perfect as always. We've just located a third current."},{"name":"MEESIYA","text":"I'll mark the destination on your map. This third site should provide us ample data to trace an ideal aetherial signature."},{"name":"MEESIYA","text":"I should also mention this site is host to ancient Bozjan ruins. Our data suggests they date back to the Third Astral Era, but I cannot say for certain. What I can say is the undead are known to roam the lands there at night, so stay on your guard."},{"name":"MIKOTO","text":"I wish I could accompany you, but I would only slow you down. Please, be careful out there."},{"name":"MEESIYA","text":"(-Misija-)Very good. Starting data collection protocol."},{"name":"MEESIYA","text":"(-Misija-)All systems are fully operational. You're free to return to camp."},{"name":"MIKOTO","text":"Ah. Welcome back, <span class=\"highlight\">Forename</span>."},{"name":"MIKOTO","text":"From what we can discern, the sensors are still fully operational, but the spectrometer is not receiving any of their data."},{"name":"LILJA","text":"One of the contact plugs to the transmitter appears to be damaged. I can fix it, but in all honesty, it would probably be faster to get a new one from our facility in Doma."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Shall I head to Doma, then?"},{"name":"A2","text":"Leave it to me!"},{"name":"LILJA","text":"I'll hear none of that! Running errands is my job, not yours."},{"name":"MEESIYA","text":"If it's all the same to you, I think it best if I go. There's still work for you to do here, Lilja."},{"name":"MIKOTO","text":"Are you sure?"},{"name":"MEESIYA","text":"So long as the control panel is broken, there is naught else I can do. What's more, this affords me the opportunity to finally see Doma."},{"name":"LILJA","text":"Well, who am I to deny you your first trip there? I'll let Jessie know you're on your way."},{"name":"LILJA","text":"All right. A new contact plug is ready and waiting for Misija. Sure was nice of her to save me the trip back."},{"name":"MIKOTO","text":"Having her around to help has truly been a blessing. I dare not think how long it would have taken to analyze the crystal focus, let alone locate the aether currents."},{"name":"MIKOTO","text":"And of course, your contributions to the Resistance have been invaluable as well. Once the spectrometer is operational again, it won't be long before the crystal focus is working. I'm sure of it. "},{"name":"SYSTEM","text":"Meanwhile, at the ruins of Bozja..."},{"name":"IMPERIALCAPTAIN03943","text":"Hurry, now. The commander hasn't all day."},{"name":"MENENIUS","text":"At last, the lady of blades... Save the Queen."},{"name":"MENENIUS","text":"Simply exquisite. Time has done little to mar her beauty."},{"name":"MENENIUS","text":"What is it?"},{"name":"IMPERIALPATROL03943","text":"We've captured an intruder, sir. We believe them to be of the Resistance."},{"name":"MENENIUS","text":"Stand aside."},{"name":"IMPERIALPATROL03943","text":"...Sir?"},{"name":"IMPERIALCAPTAIN03943","text":"You heard the commander! Stand aside or I'll report you for insubordination!"},{"name":"IMPERIALPATROL03943","text":"S-Sir!"},{"name":"MENENIUS","text":"Is this indeed the blade we have been searching for?"},{"name":"MEESIYA","text":"Yes, there can be no doubt. Only the blade of the queen herself bore these inscriptions."},{"name":"MENENIUS","text":"Then our plans proceed apace... Excellent."},{"name":"IMPERIALCAPTAIN03943","text":"Sir, I've just received word from Sicinius. They...they've found it."},{"name":"MENENIUS","text":"Very good. Then let us return to Castrum Lacus Litore."},{"name":"MEESIYA","text":"Another relic?"},{"name":"MENENIUS","text":"Nothing for you to concern yourself with, my dear."},{"name":"MEESIYA","text":"Y-Yes, of course. Forgive me."},{"name":"MENENIUS","text":"I trust your absence will go unnoticed?"},{"name":"MEESIYA","text":"Sir. I tampered with the spectrometer per your instructions, permitting me the opportunity to leave their base. I will return after a brief trip to Doma."},{"name":"MENENIUS","text":"Well done. Legatus Gabranth will be certain to hear of your deeds thus far."},{"name":"MENENIUS","text":"But lest you forget, though victory is close at hand, any mistakes will have dire consequences. Am I understood?"},{"name":"MEESIYA","text":"Yes, sir!"},{"name":"MIKOTO","text":"I'm afraid it will be a while longer before the spectrometer is operational. But never fear. You will be the first to know when we are ready to resume our work."}],"reward":{"gil":989,"gcseal":2600},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69482]},"next":[69484]},"partials":[{"type":"npc","id":"1034004","obj":{"i":1034004,"n":"Mikoto","l":3534,"q":3}},{"type":"quest","id":"69482","obj":{"i":69482,"n":"Time to Focus","g":76,"l":"Bozjan Southern Front","s":106,"f":1}},{"type":"quest","id":"69484","obj":{"i":69484,"n":"Pressing Forward","g":76,"l":"Bozjan Southern Front","s":108,"f":1}}]}