{"quest":{"name":"The Lady of Blades","location":"Bozjan Southern Front","id":69487,"patch":5.35,"sort":111,"icon":101024,"unlocksFunction":1,"eventIcon":71341,"issuer":1034001,"target":1032881,"genre":76,"journal":["Bajsaljen is determined to take Castrum Lacus Litore, and would have you join him.","The Resistance has fought valiantly to force imperial troops to fall back into the castrum, and at last Operation Eagle's Nest can be seen through to completion. Bajsaljen is ready to lead Gunnhildr's Blades into the belly of the beast, and he can think of no better soldier than you to accompany them.<br><br>※Players may enter Castrum Lacus Litore via the associated critical engagement.","Your defeat of the imperial soldiers is almost effortless. Before you can plot your next move, however, Misija appears before you with Mikoto, as well as the crystal focus and the legendary blade Save the Queen. Using Mikoto as leverage, Misija coerces you into activating the crystal focus to explore the memories of the holy blade. Her intent is soon made clear when, moments later, Queen Gunnhildr emerges as a primal-like entity, enslaving the minds of the soldiers bearing the title of her guard. The threat of the queen proved too great, forcing the Resistance to retreat from the castrum.","After regrouping at Utya's Aegis, you discuss the events that took place in the castrum. Mikoto explains that Misija discovered a way to alter the memories of Save the Queen, thereby allowing her to call forth Queen Gunnhildr in a fashion not unlike primal summoning. Having now lost both the castrum and Gunnhildr's Blades, the Resistance must think long and hard on how next to proceed.","The Resistance suffered a grave defeat at Castrum Lacus Litore, but they are not discouraged. Marsak informs you that reinforcements from Dalmasca have recently arrived, with more en route from the Eastern alliance. Though it will take time, the Resistance will not rest until Bozja is free from imperial rule."],"objectives":["Clear the critical engagement “the Battle of Castrum Lacus Litore.” ","Speak with Bajsaljen.","Speak with Marsak.","Speak with Bajsaljen."],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] is required to proceed with this quest."},{"name":"BAISHAEN","text":"The time has come, <span class=\"highlight\">Forename</span>. This day, we shall take Castrum Lacus Litore!"},{"name":"BAISHAEN","text":"On behalf of the Resistance, I offer you my humblest thanks. We could not have come this far without your aid."},{"name":"BAISHAEN","text":"What say you, my friend? Are you prepared to rout the Garleans?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You couldn't stop me if you tried."},{"name":"A2","text":"You all seem to have it under control, but if you insist."},{"name":"BAISHAEN","text":"The battle for the castrum will no doubt be the fiercest yet, but do not forget your training. Do not forget all we have fought for. You are Gunnhildr's Blades, and by the queen's grace shall we prevail this day. Now, let us make ready for battle. For Bozja!"},{"name":"BAISHAEN","text":"Reports suggest a powerful mage presently commands the castrum, and the continued presence of Lyon sas Helsos will no doubt prove troublesome, to say the least. "},{"name":"BAISHAEN","text":"Still, with you at our side, I am confident we will be victorious in the end."},{"name":"SYSTEM","text":"You may now access the critical engagement “the Battle of Castrum Lacus Litore.”"},{"name":"SYSTEM","text":"This critical engagement will be initiated when a sufficient number of players with access to Castrum Lacus Litore are present on the southern front."},{"name":"SYSTEM","text":"Furthermore, by completing other skirmishes and critical engagements, the time required before the Battle of Castrum Lacus Litore can be initiated again will be reduced. "},{"name":"SYSTEM","text":"Be sure to prepare lost actions from the lost finds cache, as they may prove key to turning the tide of battle."},{"name":"BAISHAEN","text":"If we succeed, southern Bozja may very well be freed from the Empire's grasp. With you at our side, I have little doubt we will emerge victorious in the end."},{"name":"MARSHAK","text":"Something troubles you?"},{"name":"BAISHAEN","text":"Their soldiers fell so easily, fled so quickly. This all seems...too easy."},{"name":"MARSHAK","text":"We struck before their reinforcements could arrive, as planned, and our soldiers fought valiantly. If you believe our victory came easy, it is because your plan was executed to the letter, sir."},{"name":"BAISHAEN","text":"Perhaps..."},{"name":"LILJA","text":"<span class=\"highlight\">Forename</span>!"},{"name":"LILJA","text":"Is... &lt;pant&gt; &lt;pant&gt; Is Mikoto...all right?"},{"name":"MARSHAK","text":"We must split up and search for her."},{"name":"MEESIYA","text":"(-Misija-)I don't believe that will be necessary."},{"name":"BAISHAEN","text":"You are outnumbered and outmatched, Misija. Release her, and we may yet be lenient with you."},{"name":"MEESIYA","text":"I'm not here to bargain, Bajsaljen."},{"name":"BAISHAEN","text":"Please, Misija. Whatever your grievance may be, I am certain we can find a solution. But you have to let her go."},{"name":"BAISHAEN","text":"We can build a better Bozja, Misija. Together."},{"name":"MEESIYA","text":"Ever the optimist. And likely the first to go when this is all over."},{"name":"MEESIYA","text":"<span class=\"highlight\">Forename</span>. If you would see her unharmed, come over here. Nice and slowly."},{"name":"BAISHAEN","text":"(Ready the Blades, and wait for an opening.)"},{"name":"MEESIYA","text":"How I have waited for this moment."},{"name":"MIKOTO","text":"<span class=\"highlight\">Forename</span>, I'm so sorry..."},{"name":"MEESIYA","text":"Careful. It would be a pity if I were forced to sully a holy relic such as this."},{"name":"MEESIYA","text":"Would you care to enlighten our friend here as to its history?"},{"name":"MARSHAK","text":"What is she planning? And what is that queer-looking blade?"},{"name":"MEESIYA","text":"Here."},{"name":"MEESIYA","text":"We are going to take a little trip into the memories of this blade. If you wish to keep Mikoto in one piece, that is."},{"name":"LILJA","text":"Mikoto!"},{"name":"MEESIYA","text":"Do it! Do it now!"},{"name":"MARSHAK","text":"Misija intends to explore the memories of that blade? Perhaps while she is occupied we can─"},{"name":"BAISHAEN","text":"No. It sounds as though Mikoto and <span class=\"highlight\">Forename</span> will be going with her. Interrupting them may have dire consequences. We must wait for our moment."},{"name":"BLADESOFGUNNHILDR","text":"Is it done, then?"},{"name":"BLADESOFGUNNHILDR","text":"She does not breathe, and her pulse has ceased."},{"name":"BLADESOFGUNNHILDR","text":"We were fortunate to catch her unawares. Were we to have incurred the wrath of the blade, she may have destroyed us all."},{"name":"BLADESOFGUNNHILDR","text":"A quick, painless death. Like as not, she did not even realize what happened."},{"name":"MIKOTO","text":"Is this...the memory of the last queen?"},{"name":"QUEENGUNNHILDR","text":"'Tis true the blade possessed a terrible power. But was this the only way?"},{"name":"QUEENGUNNHILDR","text":"I thought myself able to control it, to harness its power for good. And yet...it seems I was found wanting."},{"name":"QUEENGUNNHILDR","text":"At the very least, I shall take heart in the knowledge my people are safe."},{"name":"MEESIYA","text":"Naught but lies and deceit. They used you, betrayed you, slaughtered you, and dragged your name through the dirt.<br>Now, rise, my queen. Exact your vengeance, erase their accursed legacy from the pages of history!"},{"name":"MIKOTO","text":"No! Leave her be!"},{"name":"MEESIYA","text":"Go! Claim what is yours!"},{"name":"STANIK","text":"Death to the deceivers... In the name of the queen..."},{"name":"BAISHAEN","text":"Retreat!"},{"name":"LILJA","text":"Mikoto, no!"},{"name":"BAISHAEN","text":"Marsak!"},{"name":"BAISHAEN","text":"<span class=\"highlight\">Forename</span>! We must withdraw and regroup!"},{"name":"BWAGI","text":"All of you, run!"},{"name":"MIKOTO","text":"Misija always seemed so kind, and caring. Why did it have to come to this?"},{"name":"MIKOTO","text":"I would like to believe the Empire has deceived her somehow but... I know it's not that simple. We have to stop her, <span class=\"highlight\">Forename</span>."},{"name":"LILJA","text":"If I hadn't seen it with my own eyes, I wouldn't believe it..."},{"name":"BWAGI","text":"Nothing is ever simple with you, is it? I only came here to deliver a message from Lady Fran."},{"name":"BWAGI","text":"I don't understand what's going on here, but I don't intend on staying long enough to find out. I suggest you keep your time here brief as well."},{"name":"MARSHAK","text":"We were so close. So bloody close... Misija <span class=\"emphasis\">will</span> pay for this."},{"name":"BAISHAEN","text":"So the legends of her power are true, then. We thought them mere faerie tales."},{"name":"BWAGI","text":"It wouldn't be the first time one turned out to be true. Trust me."},{"name":"MARSHAK","text":"But she is the protector of Bozja! Why would the queen do such a thing...?"},{"name":"MIKOTO","text":"Misija. She has planted a seed of hatred within the queen."},{"name":"LILJA","text":"The queen's memory was altered, then?"},{"name":"MIKOTO","text":"That hatred seemed to be reaffirmed when the queen looked upon the soldiers bearing the weapons of her guard. Misija was likely anticipating that reaction."},{"name":"BAISHAEN","text":"Death to the deceivers they said... Gods, what happened all those years ago?"},{"name":"MARSHAK","text":"Let us not dwell on the past. The Blades must be saved."},{"name":"MIKOTO","text":"I'm afraid the effects of tempering cannot be undone... Or rather, a cure has yet to be found."},{"name":"MARSHAK","text":"Damn it all. Was this part of her plan as well?"},{"name":"BAISHAEN","text":"Let us return to Gangos. There is still much for us to discuss."},{"name":"MARSHAK","text":"Understood."},{"name":"MARSHAK","text":"To lose the castrum and Gunnhildr's Blades both... A heavy and most unexpected blow."},{"name":"MARSHAK","text":"It seems that rather than rely on sheer numbers, Menenius had a far more devious scheme in mind all along. And we played right into his hands."},{"name":"MARSHAK","text":"Thankfully, reinforcements from Dalmasca have recently arrived, and more from the Eastern alliance will soon join our ranks as well."},{"name":"MARSHAK","text":"Until then, there is naught to do but wait and plan our next move. Now is the time to rest, my friend. You have more than earned it."},{"name":"SYSTEM","text":"Meanwhile, at Castrum Lacus Litore..."},{"name":"RIAN","text":"Well, well! Word around here is you summoned a primal, is that right? You certainly know how to make a good first impression, don't you lass?"},{"name":"RIAN","text":"I've seen similar from Albeleo and that auracite of his, but a primal summoning? That takes a great deal more aether, doesn't it? And I'd imagine even more to control it."},{"name":"MENENIUS","text":"You have done well. Now, go. Tend to your wounds."},{"name":"MENENIUS","text":"That's an order. We have ample time before the Resistance returns, and when they do, I will have need of you again. Understood?"},{"name":"MEESIYA","text":"Yes, sir."},{"name":"RIAN","text":"Poor thing. If only she could learn to let go, it would be better for everyone. Well, some more than others..."},{"name":"MENENIUS","text":"...What do you want?"},{"name":"RIAN","text":"I trust you're aware of the request from the IIIrd Legion to return to the capital?"},{"name":"MENENIUS","text":"Of course I am. But Gabranth is in no position to comply with such orders."},{"name":"RIAN","text":"I thought as much. Not that it matters. Nerva is just like his father Titus, weak and a coward. Unfit to give orders, let alone lead a nation."},{"name":"RIAN","text":"Having spent time serving under Basch I understand full well your frustration, but the Garlemald you long for is a thing of the past."},{"name":"RIAN","text":"Though I must say, your plans to stall for time have proven quite effective. One can only hope you are as prepared as our dear Noah for what comes next."},{"name":"MENENIUS","text":"What is it you are trying to say?"},{"name":"RIAN","text":"Soldiers with potential like her are not something to be used and discarded like an old boot."},{"name":"MENENIUS","text":"I... We have never considered her to be expendable. She is a valuable asset."},{"name":"RIAN","text":"For now, at least. Like I always say, death finds a way to weed out the unremarkable and otherwise ill fortuned."},{"name":"MENENIUS","text":"&lt;sigh&gt; I almost envy you and your insouciance. Not that you would ever heed my council on such matters, let alone Gabranth's."},{"name":"RIAN","text":"Says the man who ignores the council of peers and superiors both to defend Bozja."},{"name":"RIAN","text":"But I really have to hand it to you, enthralling those Resistance soldiers was a fantastic idea. Why bother with persuasion when you have the power to enslave minds? Hahaha!"},{"name":"MENENIUS","text":"Flattery ill suits you Lyon, even when false."},{"name":"RIAN","text":"Perhaps, but dirty tricks like that suit you quite well, don't they? You always were a conniving bastard. A real snake in the grass."},{"name":"MENENIUS","text":"<span class=\"emphasis\">That</span> I shall take as a compliment."},{"name":"SYSTEM","text":"You can now exchange Bozjan coins for gear by speaking with the Resistance supplier at Utya's Aegis."},{"name":"SYSTEM","text":"Gear provided by the Resistance supplier possesses special attributes that are only effective when battling on the Bozjan southern front."}],"reward":{"gil":1200,"items":[{"id":30357},{"id":30359},{"id":30361}]},"reqs":{"jobs":[{"lvl":71,"id":142}],"quests":[69486]},"next":[69561]},"partials":[{"type":"npc","id":"1034001","obj":{"i":1034001,"n":"Bajsaljen","l":3534,"q":2}},{"type":"npc","id":"1032881","obj":{"i":1032881,"n":"Marsak","l":3478,"q":6}},{"type":"item","id":"30357","obj":{"i":30357,"n":"Field Notes on Misija","l":1,"c":26603,"t":61}},{"type":"item","id":"30359","obj":{"i":30359,"n":"Field Notes on Menenius","l":1,"c":26603,"t":61}},{"type":"item","id":"30361","obj":{"i":30361,"n":"Field Notes on Gunnhildr","l":1,"c":26603,"t":61}},{"type":"quest","id":"69486","obj":{"i":69486,"n":"Picking Up the Trail","g":76,"l":"Bozjan Southern Front","s":110,"f":1}},{"type":"quest","id":"69561","obj":{"i":69561,"n":"A Sign of What's to Come","g":76,"l":"Gangos","s":201,"f":1}}]}