{"quest":{"name":"We Can Rebuild Her","location":"Kholusia","id":69488,"patch":5.3,"sort":400,"icon":101001,"unlocksFunction":1,"eventIcon":71341,"issuer":1032227,"target":1032020,"genre":24,"journal":["The dig site chief would have you be an active participant in Komra's carnival.","With preparations for the village carnival nearly complete, but one thing remains: to unfurl the ceremonial banners. The dig site chief has chosen none other than yourself to deliver them to the dwarves charged with their display. Regardless of the veracity of his claim that this task is highly coveted and deeply significant, it is your job now.","You deliver banners to several dwarves, which proves a fruitful opportunity to gain an understanding of the colorful personalities that comprise the village of Komra. The dig site chief will surely be glad to know that the festivities he worked so hard to organize can now begin.","Moments after the chief tells you you're free to enjoy the now-commenced carnival, Anogg and Konogg appear to tear you away from the celebration. They have evidently made progress with the mysterious “key,” and wish to apprise you of the current state of affairs.","You follow the twins to their makeshift workshop, where they inform you that they have successfully transferred energy to the key, but remain unable to use it due to the impenetrable complexity of the device. There seems little recourse but to consult one more familiar with the advanced technology of the androids─namely, 2P herself. Though she is currently out of commission, the pod's scan indicates that a critical error in her repair processes might be resolved by the use of a replacement part, and fortunately, you know just where such a thing might be found.","Inside the Copied Factory, you call the twins over to the room that you previously found to be occupied by an alarming number of broken and lifeless androids. Though the disturbing spectacle would give anyone a moment's pause, they nevertheless waste little time in securing the appropriate replacement part.","Having retrieved the necessary part, Anogg commands the pod to set to work repairing 2P. You and the twins wait with bated breath until the process is complete, and 2P awakens at last."],"objectives":["Deliver carnival banners to Komra's citizens.","Speak with the dig site chief.","Speak with Anogg in the excavation tunnels.","With the chat mode in <span class=\"highlight\">Say</span>, enter any phrase containing “Anogg” near the destination within the Copied Factory.","Speak with Anogg."],"dialogue":[{"name":"DWARFMASTER03671","text":"Lali-I knew you'd be here sooner or later-ho! You remember the carnival I told you about, don't you?"},{"name":"DWARFMASTER03671","text":"We've finished preparing, which means it's nearly time to open celebrations with the unfurling of the banners. But first we'll need an officially sanctioned bearer to present said banners to three of our people─and why not let you do the honors?"},{"name":"DWARFMASTER03671","text":"Others are clamoring for the task, make no mistake─it's an important and highly coveted duty, you understand─but I couldn't deprive you of this opportunity to experience Gogg culture hands-on."},{"name":"DWARFMASTER03671","text":"Consider it a thank-you for keeping Anogg and Konogg from blowing themselves up. And look sharp! We haven't got all <span class=\"alternative-container\"><span class=\"alternative\">night</span><span class=\"alternative\">day</span></span>."},{"name":"VILLAGERA03952","text":"Aha! You'll be the bearer. Well, hand it over! This is what we've all been waiting for!"},{"name":"VILLAGERA03952","text":"Ah, the colors of Komra! They speak of our village, our lives, our very souls! ...Except this one. Never really cared for this one. Looks like it tripped halfway through the journey from beige to yellow and fell in a ditch."},{"name":"VILLAGERB03952","text":"So the role of bearer went to the outsider after all. Nothin' you can't handle, I hope."},{"name":"VILLAGERB03952","text":"It's not that I think the chief made a poor choice, mind. Bit of a waste, yes, but there's no better way for you to introduce yourself to the rest of the village. And wouldn't you know it─you're not so bad."},{"name":"VILLAGERC03952","text":"Time already, is it? Oh, my hands are so sweaty... Do take care, now─I'd hate to be the one what drops the banner."},{"name":"VILLAGERC03952","text":"Whew. Well done. Let's share a drink once it's safely unfurled, eh? The carnival is our way of showing appreciation for each other─and I certainly appreciate you keeping this banner from slipping away like a greased eel."},{"name":"VILLAGERA03952","text":"Just wait until you see this unfurled! You'll be inspired, I guarantee it!"},{"name":"VILLAGERB03952","text":"If you want my advice on gettin' to know the rest of the villagers better─eat, drink, and be merry. It <span class=\"emphasis\">is</span> a carnival."},{"name":"VILLAGERC03952","text":"With you here to tell your tales of adventure, I'm certain this year's carnival will be the best one yet! Assuming I don't get tangled in the banner and trip and <span class=\"emphasis\">ruin everything</span>..."},{"name":"DWARFMASTER03671","text":"Go on, now. The whole village is waiting."},{"name":"DWARFMASTER03671","text":"Finished, have you? Hopefully speaking with those folks helped impress upon you that this wasn't just some menial errand anyone could've done. No, the slightest mishap in the banner delivery process would have spelled disaster, you hear?"},{"name":"DWARFMASTER03671","text":"Now, without further ado...let the carnival begin!"},{"name":"DWARFMASTER03671","text":"No need to stand there waiting for someone to give you more work to do. Go and witness the fruits of our labors! Revel! Frolic! Et cetera!"},{"name":"DWARFMASTER03671","text":"...If you need a task that badly, you can set yourself to working up an appetite. I expect you to partake <span class=\"emphasis\">heartily</span> of our traditional cuisine─not to mention the drinks!"},{"name":"KONOGG","text":"Stone spare me these menial tasks. If I see one more streamer..."},{"name":"ANOGG","text":"Why, if it isn't <span class=\"highlight\">Forename</span>! And run absolutely ragged with tedious carnival duties, no doubt!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It is indeed my solemn duty to eat my weight in carnival food."},{"name":"A1","text":"I had the honor of delivering the banners, thank you very much."},{"name":"ANOGG","text":"Eating!? Are you mad!? There's no time for that─we've got the key to activate!"},{"name":"ANOGG","text":"Oh, and I suppose you were told it was incredibly important, were you? Well, try not to let it go to your head. ...Speaking of your head, I expect it just might explode when you see the key in action. Yes, the key! Don't tell me you've forgotten!"},{"name":"ANOGG","text":"All of this festive nonsense has been an unnecessary distraction, but Konogg and I did manage to make some <span class=\"emphasis\">real</span> progress while the chief wasn't looking."},{"name":"ANOGG","text":"If you want the details─and I know you do─you'll have to meet us at the usual place. The last thing we need is half the village drunkenly eavesdropping."},{"name":"KONOGG","text":"We haven't even got to the part where Anogg and I argue yet, and I'm already knackered..."},{"name":"ANOGG","text":"There you are. Let's review our work, shall we? Doubtless you've forgotten some significant detail!"},{"name":"ANOGG","text":"As hopefully even you will recall, we required a source of energy to restore functionality to the so-called “key” 2P told us about."},{"name":"ANOGG","text":"We obtained said source in the form of a knocker's crystalline carapace─though the transference of energy from crystal to key proved a challenge."},{"name":"ANOGG","text":"Nothing that Konogg and I, in my infinite wisdom, couldn't handle, however!"},{"name":"ANOGG","text":"Heheh... You'll find your faith in us well rewarded. The key is now fully powered and, as far as we can tell, functional─so I daresay we'll soon be capable of smiting our enemies with the press of a button!"},{"name":"ANOGG","text":"...Or we <span class=\"emphasis\">would</span> be, if we had the first clue as to how to operate the blasted thing!"},{"name":"KONOGG","text":"Indeed, it seems the key is a more complicated device than we anticipated. Thus far, we have succeeded only in making it display a series of strange glyphs."},{"name":"KONOGG","text":"We presented these to the pod for translation, of course, but we cannot make heads nor tails of its terminology, no matter how many times we prompt it to explain."},{"name":"KONOGG","text":"The androids appear to have an intuitive─or at least finely honed─grasp of technology, so I have no doubt that 2P would know, but..."},{"name":"ANOGG","text":"...She's shown no sign of miraculously awakening, that's for certain."},{"name":"ANOGG","text":"Ugh. You─Pod. Can 2P be revived?"},{"name":"POD","text":"Analyzing android repair sequence...<br>Error detected. Confirming details..."},{"name":"POD","text":"Damage to internal mechanism detected.<br>Proposal: Replace the damaged part."},{"name":"KONOGG","text":"Hmm... So with a replacement part, repair is possible? I daresay facilitating that process would prove more efficient than continuing our own fruitless experimentation with the key."},{"name":"ANOGG","text":"I would hardly call wandering the factory for days on end with the barest idea of what sort of part we're looking for “efficient.”"},{"name":"ANOGG","text":"So unless our friend here just happened to stumble upon a room filled with android corpses ripe for the harvesting..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Now that you mention it..."},{"name":"A2","text":"Oh yeah, the corpse room. That's a thing."},{"name":"ANOGG","text":"Odd...but superlative! You will take us there at once. We'll bring Pod, too─it can tell us if any of the androids still have the part we need. Onwaaard!"},{"name":"ANOGG","text":"（★未使用／削除予定★）"},{"name":"KONOGG","text":"Not that I'm not eager to take apart an android, but...how do we <span class=\"emphasis\">do</span> that?"},{"name":"POD","text":"Tactical support units are authorized to recover android parts and carry out replacement and repair operations."},{"name":"ANOGG","text":"A look inside the androids <span class=\"emphasis\">and</span> a giant step toward our ultimate goal, mwahaha... By the by, where are we going?"},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or software keyboard to enter any phrase containing “Anogg” to attract the easily distracted dwarf's attention."},{"name":"SAYTODO","text":"Anogg"},{"name":"ANOGG","text":"Over here, is it? Konogg, Pod, stop dallying!"},{"name":"ANOGG","text":"How disturbing!"},{"name":"KONOGG","text":"The color of their garb is different, but they do appear to be of the same make as 2P."},{"name":"ANOGG","text":"Which means, ghoulish or not, we can make use of them. This is truly excellent, Konogg!"},{"name":"KONOGG","text":"My understanding is that Pod should be able to salvage the correct part and initiate the repairs. Let's see..."},{"name":"KONOGG","text":"The more we learn about the androids' technology, the more fascinating─and unnerving─it becomes. Who could possibly have created this?"},{"name":"POD","text":"Part compatibility confirmed."},{"name":"ANOGG","text":"Must we instruct it every single time? Go on, Pod, fix 2P."},{"name":"ANOGG","text":"Did it work?"}],"reward":{"items":[{"id":31677}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69321]},"next":[69489]},"partials":[{"type":"npc","id":"1032227","obj":{"i":1032227,"n":"Dig Site Chief","l":2954,"q":15}},{"type":"npc","id":"1032020","obj":{"i":1032020,"n":"Anogg","l":3427,"q":4}},{"type":"item","id":"31677","obj":{"i":31677,"n":"Amusement Park Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"69321","obj":{"i":69321,"n":"One Way to Do It","g":24,"l":"Excavation Tunnels","s":310,"f":1}},{"type":"quest","id":"69489","obj":{"i":69489,"n":"Everything You Know Is Wrong","g":24,"l":"Excavation Tunnels","s":410,"f":1}}]}