{"quest":{"name":"The Making of a Market","location":"The Firmament","id":69491,"patch":5.31,"sort":15,"unlocksFunction":1,"eventIcon":71341,"issuer":1033962,"target":1033969,"genre":83,"journal":["Francel is ever looking upward toward new heights for the Firmament.","Lord Francel rejoices at your return, and cheerfully regales you with the latest tidings regarding the continued restoration and development of the Firmament. As the young nobleman tells it, his newest goal is to transform the district into a new hub of trade befitting this new age in which Ishgard has opened itself to the world. To that end, he seeks to visit the three nations in hopes of enticing prominent merchants and traders to enter into a mutually profitable business partnership. No sooner has he asked for your escort than you are joined by none other than Count Charlemend de Durendaire, who imperiously insists that he join you on your expedition. Apprehensive but cautiously optimistic as to what lies ahead, you set off for the Carline Canopy in Gridania to join Francel and the count.","You reconvene with Lord Francel and Lord Charlemend in Gridania. No sooner have you greeted your companions than does the Count de Durendaire rush off to engage the local populace, confident that the prestige and influence of his great house will suffice to make the trade negotiations a swift success. Lord Francel, for his part, is skeptical of this approach, and the two of you resolve to pursue the count, lest he unintentionally sabotage the mission at hand.","You venture out into the streets of Gridania to find that Lord Charlemend has managed only to incur the ire of the townspeople with his pompous, overbearing attitude. Fearing the consequences if the Count de Durendaire presses on with his heavy-handed approach, Lord Francel calmly and diplomatically suggests that the three of you regroup and try your luck at one of the many artisan guilds for which the forest city-state is known, a proposal to which Lord Charlemend grudgingly agrees.","You arrive at the Leatherworkers' Guild, where Lord Francel's more measured approach immediately proves to bear fruit, thanks in large part to a fortuitous meeting with a mercenary-turned-merchant who plied his former trade at Camp Dragonhead during the war. The young man instantly recognizes Lord Francel, and─after sharing a moment's reminiscence about the beloved, departed Lord Haurchefant─eagerly offers to aid your cause by introducing you to his employer, Maisenta of the prestigious Black Rabbit Traders. Overjoyed at this turn of events, Lord Francel thanks the former swordsman, and prepares to welcome his potential new trading partner as the Count de Durendaire grumbles and grouses beside you.","Though Maisenta is initially skeptical of what she and her organization stand to gain from expanding their business to Ishgard, you are successfully able to argue on Lord Francel's behalf, convincing the shrewd trader that the arrangement promises to be lucrative for both parties. Offering a verbal agreement to prepare a shipment of wares to grace the Firmament's markets, she takes her leave to begin the necessary preparations. Encouraged by your success in Gridania, Lord Francel is eager to move on to your next destination. The Count de Durendaire, on the other hand, appears keen to prove that this was but a case of novice's luck..."],"objectives":["Speak with Francel at the Carline Canopy in Gridania.","Speak with Charlemend de Durendaire.","Wait for passersby outside the Leatherworkers' Guild.","Speak with Francel."],"dialogue":[{"name":"FRANCEL","text":"<span class=\"highlight\">Forename</span>! 'Tis always a pleasure to see you here in the Firmament. You'll be pleased to hear that the district is home to an ever-growing number of thoroughly satisfied residents, thanks in no small part to your tireless efforts on our behalf."},{"name":"FRANCEL","text":"In particular, I'm proud to say that we have spared no effort to realize Lady Hilda's ideal of a place where one and all can have a roof over their head and food in their belly, provided they are willing to work hard and make an honest living."},{"name":"FRANCEL","text":"Seeing as things are progressing most swimmingly on that front, I have decided to turn my eye to Lord Briardien's most astute recommendation: encouraging the flow of goods and services, so as to build a thriving economy that will serve as the area's lifeblood."},{"name":"FRANCEL","text":"As such, Augebert and his men have been hard at work putting the final touches on the ward I have dubbed Featherfall, which is to serve as the Firmament's center of commerce and trade. There is but one remaining issue to resolve..."},{"name":"FRANCEL","text":"Namely, how we might distinguish our own marketplace from the Jeweled Crozier. After all, if we hope to attract vendors and customers alike to the Firmament, we must offer something that they cannot already find at a more established location."},{"name":"FRANCEL","text":"After giving the matter considerable thought, it struck me─what if we were to bring in merchants from the realm over to ply their trade here, that Featherfall might be the Holy See's new hub of foreign trade?"},{"name":"FRANCEL","text":"It is a most inspired idea, would you not say? And─if you would not disapprove─I would ask <span class=\"emphasis\">you</span> to accompany me as our designated emissary to the three city–states. After all, who better to convince our esteemed guests to make the journey here to Ishgard than one of your influence and prestige?"},{"name":"CHARLEMEND","text":"(-???-)And if <span class=\"emphasis\">you</span> would not disapprove─or, quite honestly, even if you would─<span class=\"emphasis\">I</span> will be accompanying you as well."},{"name":"FRANCEL","text":"L-Lord Charlemend!"},{"name":"FRANCEL","text":"It is far from my place to object, but for whatever reason would the Count de Durendaire wish to come along on our humble expedition? Particularly in light of your honored house's rather...shall we say, <span class=\"emphasis\">conservative</span>...views toward the expansion of foreign trade..."},{"name":"CHARLEMEND","text":"I'll thank you not to make assumptions about the interests of my house, <span class=\"emphasis\">Lord</span> Francel. I have always acted in what I believe to be my homeland's best interests. And I will <span class=\"emphasis\">continue</span> to do so."},{"name":"CHARLEMEND","text":"Mayhap House Durendaire did not give the warmest of welcomes to outsiders at the Observatorium and Whitebrim Front..."},{"name":"CHARLEMEND","text":"But I assure you that we took only the necessary precautions to defend the See from external threats at a time of war. Surely the savior of Ishgard can understand our position."},{"name":"CHARLEMEND","text":"At any rate, the war is over, and our nation has entered a new age. I am not inclined to sit idly by as House Durendaire is left behind the times."},{"name":"CHARLEMEND","text":"And yet, at this most vital of junctures, my son and heir remains lost at sea, and my cousins are either too young or unworldly for the task. And so it falls to me to see to matters myself."},{"name":"CHARLEMEND","text":"I daresay there is some merit for you as well. After all, whatever negotiations you intend to conduct, they can only be aided by the presence of the head of Ishgard's highest of High Houses."},{"name":"CHARLEMEND","text":"...I trust you have no objections?"},{"name":"FRANCEL","text":"Your offer of assistance is most generous, Lord Charlemend. I would not dream of refusing it."},{"name":"CHARLEMEND","text":"Of course not. We depart at once, yes? I've heard Gridania is most lovely at this time of year. "},{"name":"FRANCEL","text":"Y-Yes...my intention was always to begin our expedition at our closest neighbor. I have it on good word that an establishment there known as the Carline Canopy would be a suitable─"},{"name":"CHARLEMEND","text":"The Carline Canopy it is, then. Do take care not to lag behind, yes?"},{"name":"FRANCEL","text":"L-Lord Charlemend! Wait!"},{"name":"CHARLEMEND","text":"...So this is Gridania. The tomes fail to mention how disagreeably dank it is."},{"name":"FONCRINEAU","text":"While I understand that Lord Francel has only the happiness and well-being of our residents in mind, sometimes I cannot help but fear he is exerting himself overmuch. In that sense, I am most thankful for your tireless support of his cause."},{"name":"FONCRINEAU","text":"Ah, if it isn't good <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. Lord Francel was hoping that you might grace us with a visit. I hear that there is a matter he wishes to discuss with you. If you do not have more pressing obligations, pray lend him your ear."},{"name":"FRANCEL","text":"...So this is Gridania! Why, it is even more verdant and lush than I had imagined!"},{"name":"CHARLEMEND","text":"Hmph. A danker, gloomier city I can scarce imagine. I am glad I do not live here."},{"name":"CHARLEMEND","text":"...And yet, this nation is home to a great number of our own kind. Convincing an Elezen trader or two to come to Ishgard will be done in less than the time it takes for an afternoon tea."},{"name":"CHARLEMEND","text":"To start, I will enlist the services of one of the locals. Feel free to come along, Lord Francel─mayhap you'll learn something."},{"name":"FRANCEL","text":"W-Wait...Lord Charlemend!"},{"name":"FRANCEL","text":"Oh dear, <span class=\"highlight\">Forename</span>. This is precisely what I was afraid of!"},{"name":"FRANCEL","text":"I did some research before our departure. No doubt this is common knowledge to you, but I read that Gridanians are reserved types who do not warm easily to outsiders─if perhaps not to the degree of our own people."},{"name":"FRANCEL","text":"I fear the count─for all his good intentions─might sour the local populace on our offer before we can even make it. Come, we must stop him!"},{"name":"FRANCEL","text":"Phew! Fortunately, it would seem he has yet to engage the townspeople..."},{"name":"GRIDANIANCITIZEN03955","text":"Hm? Who are you, and what business have you here?"},{"name":"CHARLEMEND","text":"You there. I am looking to speak with one of your nation's most prominent traders. Tell me where I might find such a person, and be quick about it─I'm a busy man."},{"name":"GRIDANIANCITIZEN03955","text":"Hm? I'm not in the habit of entertaining outsiders─rude, arrogant ones least of all. Bugger off and do it yourself!"},{"name":"CHARLEMEND","text":"What!? Why, the sheer <span class=\"emphasis\">gall</span> of that woman!"},{"name":"FRANCEL","text":"With all due respect, Lord Charlemend...we are guests in this land. Just as you and I were once wary of outsiders like good <span class=\"highlight\">Forename</span> here, so, too, are these people wary of us."},{"name":"FRANCEL","text":"In the world outside the Holy See, our titles or the prestige of our houses will avail us no special privilege. Mayhap it would behoove us to conduct our affairs with a measure of humility..."},{"name":"FRANCEL","text":"...But I fear we have already aroused the suspicion of the townspeople. Let us try our luck at another location...mayhap one of the guilds for which this place is so well known?"},{"name":"CHARLEMEND","text":"Hmph. A guild, you say? Very well. Let us stop blithering and be off."},{"name":"FRANCEL","text":"If I recall, the Leatherworkers' Guild is in the part of town known as Old Gridania. Would that be correct, <span class=\"highlight\">Forename</span>?"},{"name":"CHARLEMEND","text":"If you know the way to this guild, then let us be off already, yes? The sooner we can take our leave of this place, the better, I say."},{"name":"FRANCEL","text":"Yes, this place seems rather lively. No doubt we can find someone willing to assist us here."},{"name":"FRANCEL","text":"I beg your pardon, my esteemed sir! I am a humble visitor from Ishgard, and I was wondering if I might trouble you with a question or two."},{"name":"GRIDANIANMERCHANT03955","text":"Hm? What's that, now?"},{"name":"GRIDANIANMERCHANT03955","text":"Wait... Can it be...Lord Francel? Hah, it <span class=\"emphasis\">is</span> you! Whatever brings you to the Twelveswood?"},{"name":"FRANCEL","text":"What? Pray forgive me, I do not believe I have had the pleasure..."},{"name":"GRIDANIANMERCHANT03955","text":"You wouldn't know me, but I sure know you. During the war, I plied my trade as a sellsword at Camp Dragonhead. You often came to dine at Lord Haurchefant's invitation, yes?"},{"name":"FRANCEL","text":"Why...that I did! Lord Haurchefant was a most benevolent man. There were few things he enjoyed more than sharing a good meal in the company of his friends and his men alike."},{"name":"GRIDANIANMERCHANT03955","text":"Aye, and I was one of them. I fondly remember the times I sat at his table, sharing in his meat and mead. In the warmth of his hall and his company, for a moment you could forget the bitter cold outside."},{"name":"GRIDANIANMERCHANT03955","text":"It's a memory that's stayed with me to this day, long after I returned to Gridania and hung up my blade. Lord Haurchefant was a great man, and I had hoped to return to Ishgard one day to visit him."},{"name":"GRIDANIANMERCHANT03955","text":"But then the news of his tragic passing arrived... Even now, I find it hard to believe he's gone."},{"name":"FRANCEL","text":"I as well, my friend. Not a day goes by that I do not think of him, and the kindness he showed me in the darkest of days..."},{"name":"FRANCEL","text":"And though I will forever mourn his passing, I take solace in knowing that his sacrifice was not for naught. For because of those like him─and <span class=\"highlight\">Forename</span> here─the war is at long last over, and our nation welcomes a new age of enlightenment and restoration."},{"name":"FRANCEL","text":"So it is that we come here to fair Gridania, in hopes of establishing trade that will benefit both our nations. Might you perhaps know of any merchants or traders who might be interested in exploring such a possibility?"},{"name":"GRIDANIANMERCHANT03955","text":"Do I ever! And nothing would please me more than to be able to return the kindness that your countrymen showed me!"},{"name":"GRIDANIANMERCHANT03955","text":"It just so happens that I do work for Black Rabbit Traders these days. Perhaps you've heard of them? Maisenta's in charge there, and she's always looking for promising new business partners! Just wait here─I'll bring her right over!"},{"name":"FRANCEL","text":"My good man, it is as if the gods themselves sent you to us! If she does not mind the imposition, I would be honored to meet this Lady Maisenta!"},{"name":"CHARLEMEND","text":"I had known that Lord Haurchefant was undiscerning in the company he kept, but to think that it would be to the benefit of our nation..."},{"name":"FRANCEL","text":"I trust that you've met this Lady Maisenta, <span class=\"highlight\">Forename</span>? Do you suppose she'll be receptive to our offer?"},{"name":"MAISENTA","text":"So you're the guest from Ishgard I've heard so much about. I am Maisenta, of Black Rabbit Traders fame. I hear you have a business proposition for me?"},{"name":"FRANCEL","text":"It is a pleasure and an honor both to make your acquaintance, Lady Maisenta. I am Francel de Haillenarte, and I have the privilege of overseeing the reconstruction of our fair city, a task which includes building a thriving economy."},{"name":"FRANCEL","text":"To that end, I wish to invite the realm's preeminent trading concerns to establish outposts in our new commercial district. If it please you, will you not consider bringing your operations to Ishgard?"},{"name":"MAISENTA","text":"I'd heard that you Ishgardians opened your borders, but quite frankly, I wasn't expecting to receive such an eager and enthusiastic proposition."},{"name":"MAISENTA","text":"...And it's an interesting one, I'll grant you that. Still, as much as I'd like to be of aid, I run a business here, not a charity."},{"name":"MAISENTA","text":"And so I'm forced to ask: why should I expand to Ishgard? What do you offer that other places do not?"},{"name":"FRANCEL","text":"A well-founded concern, of course... Be assured that our nation offers businesses many opportunities. For example...er..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You'll have immediate access to the finest Ishgardian wares."},{"name":"A1","text":"Ishgardian nobles are notorious spendthrifts..."},{"name":"A1","text":"Picture it now: the Homunculi tour the Holy See."},{"name":"MAISENTA","text":"Now that you mention it, I daresay that Ishgardian furs and fine cuisine could command a high price here in Gridania..."},{"name":"MAISENTA","text":"Now that you mention it, if the well-heeled aristocrats of the High Houses are willing to open their coinpurses for Gridanian craftsmanship, it could prove quite profitable..."},{"name":"MAISENTA","text":"Well, aren't you a shrewd one! Yes, I have no doubt that the mellifluous musical stylings of Gridania's preeminent band of troubadours would serve to lift the spirits of our Ishgardian friends in the aftermath of the war─and loosen the strings of their coinpurses in the process."},{"name":"MAISENTA","text":"All right...<span class=\"highlight\">Forename</span> here's convinced me. The Black Rabbit will come to Ishgard."},{"name":"FRANCEL","text":"Oh, thank you, Lady Maisenta! You do us a kindness that we will not soon forget!"},{"name":"MAISENTA","text":"You can spare me the flowery words. I'm only looking out for my own business interests...as I trust you are as well, no?"},{"name":"MAISENTA","text":"In any event, I'd best be going. We'll have to take a full inventory to determine which of our fine goods to bring north. As they say, the Traders do not smile on those who tarry..."},{"name":"FRANCEL","text":"Oh, thank you ever so much, my friend! I could never have done this without you!"},{"name":"FRANCEL","text":"Lady Maisenta's question was only to be expected, yet I found myself at a loss. Your impeccable knowledge of the realm and calmness under pressure have served us well once more."},{"name":"CHARLEMEND","text":"...Hmph. You have succeeded here despite the involvement of Houses Haillenarte and Fortemps, not because of it."},{"name":"CHARLEMEND","text":"The citizens of the sultanate are far more discerning, but fear not. I will show you how negotiations among the upper crust are truly done."}],"reward":{"gil":778},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69264]},"next":[69492]},"partials":[{"type":"npc","id":"1033962","obj":{"i":1033962,"n":"Francel","l":3435,"q":1}},{"type":"npc","id":"1033969","obj":{"i":1033969,"n":"Francel","l":53,"q":2}},{"type":"quest","id":"69264","obj":{"i":69264,"n":"To Thaw a Frozen Heart","g":83,"l":"The Firmament","s":14,"f":1}},{"type":"quest","id":"69492","obj":{"i":69492,"n":"Dealings in the Desert","g":83,"l":"Gridania","s":16,"f":1}}]}