{"quest":{"name":"Caught Shorthanded","location":"Ul'dah","id":69499,"patch":5.3,"sort":196,"icon":101012,"eventIcon":71221,"issuer":1034471,"target":1034482,"genre":200,"journal":["Nanaphon is glancing about with a hint of frantic desperation.<br>※This quest is available for a limited time only.","A hopeful Nanaphon has asked for your assistance with a staffing problem at the Gold Saucer. It seems that an influx of visitors during a highly successful MGP campaign has shown the establishment to be woefully shorthanded, and the call has gone out for temporary helpers. After indicating your willingness to lend a hand, Nanaphon requests that you make your way to the Saucer and meet with his supervisor at Entrance Square.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Shortly after your arrival at Entrance Square, you are greeted by a grateful Roland. He introduces you to the chief attendant, and thus begins your stint as a Gold Saucer employee. As instructed, your first task is to meet the guides in each square, and learn the basics of the available attractions that you might provide advice to any indecisive or overwhelmed guests.","You have dutifully listened to the explanations provided by the Gold Saucer guides. The time has come to return to the chief attendant, and put your knowledge of the Saucer's diverse amusements to the test.","Trusting in your claim to readiness, the chief attendant immediately sets you to work responding to the needs of flustered visitors. After a short but intense bout of providing hospitality, you set your sights on collecting your payment at Entrance Square.","You return once more to the chief attendant, who provides an evaluation of your performance. Roland himself is generous with both his praise and appreciation of your efforts, but it seems the staffing dilemma in the Saucer is not yet over..."],"objectives":["Wait at the designated location at the Gold Saucer.","Speak with the Minion Square guide.","Speak with the Card Square guide.","Speak with the Round Square guide.","Speak with the Event Square guide.","Speak with the Wonder Square guide.","Speak with the chief attendant.","Speak with the chief attendant again."],"dialogue":[{"name":"NANAPHON","text":"Excuse me! Yes, you, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>! If I might have a moment of your time?"},{"name":"NANAPHON","text":"My─ Oh! I know you! It's me─Nanaphon! You helped me audition at the Gold Saucer, remember!?"},{"name":"NANAPHON","text":"Surely you haven't forgotten my performance!?"},{"name":"NANAPHON","text":"My name is Nanaphon, and I'm here as a representative of the Gold Saucer."},{"name":"NANAPHON","text":"The thing is, my employers are holding one of their special limited-time events, where all attractions reward fifty percent more MGP..."},{"name":"NANAPHON","text":"The campaign has been <span class=\"emphasis\">so</span> successful, however, that we're having trouble catering to the unexpectedly enormous crowds!"},{"name":"NANAPHON","text":"...Thus do you find me accosting passersby, and offering temporary positions on our staff as attraction guides. Might you be interested in helping out in exchange for a generous payment?"},{"name":"NANAPHON","text":"Wonderful! I'll let my supervisor know to expect you at Entrance Square in the Gold Saucer!"},{"name":"NANAPHON","text":"You...you've been to the Saucer before, haven't you? If you don't have a ticket for admission, I hear that young man over there is simply giving them away!"},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the quest “It Could Happen to You,” which can be undertaken at level 15."},{"name":"NANAPHON","text":"As I said, I'll send my supervisor to meet you at Entrance Square. You shouldn't be waiting long!"},{"name":"NANAPHON","text":"And if you have any trouble boarding the airship, you can always appeal to the kindness of strangers. As a matter of fact, that well-heeled youth over there has a reputation for astounding generosity!"},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the quest “It Could Happen to You,” which can be undertaken at level 15."},{"name":"ROLAND","text":"Oho! I come to greet our recruited helper, and who should it be but <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>!"},{"name":"ROLAND","text":"(-???-)Greetings, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>, and thank you for coming! You've not been waiting overlong, I hope?"},{"name":"ROLAND","text":"I am Roland, the fellow entrusted with overseeing the daily affairs of this fine establishment."},{"name":"ROLAND","text":"As Nanaphon will have explained, we are seeking temporary assistants for our terribly overworked Saucer staff."},{"name":"ROLAND","text":"The sheer number of attractions can be overwhelming for visiting guests, hence the need for dedicated guides. Aside from providing information, one of their most vital duties is suggesting which amusements might best suit a particular individual's tastes."},{"name":"ROLAND","text":"Your first task, then, shall be to visit a staff member in each of the five squares, and receive an explanation of the available attractions."},{"name":"ROLAND","text":"Once you feel comfortably enlightened, I ask that you speak with our chief attendant here. He will put your newfound knowledge to a practical test!"},{"name":"STAFFF","text":"Visit each of the squares in turn, and listen carefully to the staff's explanations. I shall be waiting..."},{"name":"STAFFA","text":"Here in Minion Square, guests can challenge one another in the strategic contest known as “Lord of Verminion.”"},{"name":"STAFFA","text":"Whether you wish to test the limits of your tactical brilliance or simply revel in adorable minion mayhem, this is the game for you!"},{"name":"STAFFB","text":"Card Square is home to the highly acclaimed and widely adored phenomenon we call “Triple Triad”!"},{"name":"STAFFB","text":"In this game, planning your card placements in advance is the key to claiming victory. Those who enjoy thinking ahead will find themselves right at home at our tables!"},{"name":"STAFFC","text":"Master Roland has informed me of your impending employment. Shall we commence your education in Round Square's attractions?"},{"name":"Q1","text":"Which attraction will you ask about?"},{"name":"A1","text":"Cliffhanger."},{"name":"A1","text":"Leap of Faith."},{"name":"A1","text":"Cancel."},{"name":"STAFFC","text":"In Cliffhanger, a chocobo chick has stranded itself atop a forbidding mountain. Those who would rescue the lamentable creature must run a harrowing gauntlet of goblin bombs!"},{"name":"STAFFC","text":"It is a must for thrill-seekers and danger-lovers, but rather harder to recommend for folk simply looking to pet a feathery friend."},{"name":"STAFFC","text":"There is nowhere to go but up in this grueling test of acrobatic prowess. We invite those sure of foot and strong of will to overcome the dizzying heights of this death-defying attraction."},{"name":"STAFFC","text":"It perhaps goes without saying that guests who feel uncomfortable when faced with time limits and precipitous falls might do well to look elsewhere for entertainment."},{"name":"STAFFD","text":"Ah, you must be our new guide-in-training. Where shall we start?"},{"name":"Q2","text":"Which attraction will you ask about?"},{"name":"A2","text":"Any Way the Wind Blows."},{"name":"A2","text":"The Slice Is Right."},{"name":"A2","text":"Cuff-a-Cur."},{"name":"A2","text":"The Moogle's Paw."},{"name":"A2","text":"Cancel."},{"name":"STAFFD","text":"Typhon is an actual voidsent, summoned by the spell of a student of thaumaturgy and later employed here at the Saucer. During the event in question, you must try to anticipate where his next nasal eruption will occur, then maneuver to a location where you think you will be safe."},{"name":"STAFFD","text":"Luck plays a large part in one's success, thus anyone can participate regardless of athletic ability. Any Way the Wind Blows is a must for those seeking to indulge in the excitement of the unpredictable!"},{"name":"STAFFD","text":"The Slice Is Right is an event requiring a combination of both luck and skill. The longer you survive, the greater the rewards, though you will have to contend with the fearsome Yojimbo!"},{"name":"STAFFD","text":"Think yourself fast enough to dodge the lightning strikes of the swordsman's blade? Then this attraction was tailor-made for you!"},{"name":"STAFFD","text":"Ah, yes. Cuff-a-Cur. Come one, come all, and test your might."},{"name":"STAFFD","text":"The power of the punch is important, but so, too, is the precision!"},{"name":"STAFFD","text":"Steer the moogle, grab the ball, and win your MGP prize!"},{"name":"STAFFD","text":"We see a lot of gadget-lovers at this game. Also a lot of, ahem, “admirers” of the nearby attendants, if one pays attention..."},{"name":"STAFFE","text":"Fresh meat for the grinder, eh? Welcome to the family!"},{"name":"Q3","text":"Which attraction will you ask about?"},{"name":"A3","text":"Crystal Tower Striker."},{"name":"A3","text":"Doman mahjong."},{"name":"A3","text":"Cancel."},{"name":"STAFFE","text":"Bringing down the mallet with perfect timing is the way to win at Crystal Tower Striker."},{"name":"STAFFE","text":"This is a game for those handy with a hammer, or who have the patience to wait for just the right moment to strike."},{"name":"STAFFE","text":"In Doman mahjong, four players race to gather tiles and form a winning combination, all the while trying not to hand victory to their opponents."},{"name":"STAFFE","text":"The rules are many and varied, but it's the contest of wits and cunning that brings people back for more. There's nothing else quite like it, especially for those with an interest in Far Eastern culture!"},{"name":"STAFFF","text":"Our fledgling guide returns! Do you think yourself prepared to meet and assist actual guests?"},{"name":"Q4","text":"Are you prepared?"},{"name":"STAFFF","text":"Let us put you straight to work, then! Come along!"},{"name":"HAMON","text":"(-???-)Hah hah hah! Is that <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>?"},{"name":"HAMON","text":"...Working as a guide, you say? Well, I could use some suggestions."},{"name":"HAMON","text":"(-???-)Hah hah hah! You look like the helpful sort!"},{"name":"HAMON","text":"You see, I'm having a terrible time choosing which game to play. In my younger days, I would impress the ladies with my vigorous pugilism, but I wonder if excelling at one of these amusements might have a similar effect...?"},{"name":"Q5","text":"Which attraction do you recommend?"},{"name":"A5","text":"Might I suggest Doman mahjong?"},{"name":"A5","text":"Might I suggest Cuff-a-Cur?"},{"name":"A5","text":"Might I suggest Triple Triad?"},{"name":"HAMON","text":"Oho, why didn't I think of that! Stand aside─the Holyfist needs to go and rack up a holy high score!"},{"name":"SYSTEM","text":"Hamon seems greatly enthused by your suggestion!"},{"name":"HAMON","text":"...Hm. I'm not sure how that'll bring the lovelies running, but I suppose some prefer the more thoughtful type."},{"name":"SYSTEM","text":"Hamon seems less than enthused by your suggestion..."},{"name":"MYLLA","text":"(-???-)<span class=\"highlight\">Forename</span>! What brings you to the Gold Saucer?"},{"name":"MYLLA","text":"...I see. Perhaps you might help me then."},{"name":"MYLLA","text":"(-???-)Excuse me, might I ask for some assistance?"},{"name":"MYLLA","text":"I needed some time away from the Coliseum, but even in play I hope to find ways to improve my bladework. Would any of these diversions serve such a role?"},{"name":"Q6","text":"Which attraction do you recommend?"},{"name":"A6","text":"Might I suggest Any Way the Wind Blows?"},{"name":"A6","text":"Might I suggest Crystal Tower Striker?"},{"name":"A6","text":"Might I suggest the Slice Is Right?"},{"name":"MYLLA","text":"Ah, so you must anticipate and avoid the sword strikes, yes? That sounds perfect!"},{"name":"SYSTEM","text":"Mylla seems greatly enthused by your suggestion!"},{"name":"MYLLA","text":"I struggle to imagine how that could enhance my swordplay, but I shall take a look if I have a spare moment..."},{"name":"SYSTEM","text":"Mylla seems less than enthused by your suggestion..."},{"name":"ADALBERTA","text":"(-???-)Fancy meeting you here. Taking a break from breaking rock, eh?"},{"name":"ADALBERTA","text":"...Ah, more work than play, then. Either way, I could do with some advice..."},{"name":"ADALBERTA","text":"(-???-)You work here, yes? If you have a moment, I could do with some advice..."},{"name":"ADALBERTA","text":"What kind of amusing things do they have for a miner like me? I've spent endless hours clambering about mountains and such, so I can handle some jumping and climbing."},{"name":"Q7","text":"Which attraction do you recommend?"},{"name":"A7","text":"Might I suggest the Moogle's Paw?"},{"name":"A7","text":"Might I suggest Leap of Faith?"},{"name":"A7","text":"Might I suggest Lord of Verminion?"},{"name":"ADALBERTA","text":"Oh, that does sound like a challenge! I'd say my time in craggy places puts me at an advantage, but I suppose we'll see!"},{"name":"SYSTEM","text":"Adalberta seems greatly enthused by your suggestion!"},{"name":"ADALBERTA","text":"They say you should put work aside from time to time, but I wonder if something like that would keep my interest...?"},{"name":"SYSTEM","text":"Adalberta seems less than enthused by your suggestion..."},{"name":"STAFFF","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─that should be sufficient for the moment. Now, I've reviewed the reports of your performance..."},{"name":"STAFFF","text":"...And it seems every guest with whom you spoke was most pleased with your recommendations! An outstanding effort! Why, I might almost be convinced to take you on as a full-time employee!"},{"name":"STAFFF","text":"...And it seems you hit the mark with one or two of your recommendations. A fair attempt, considering your lack of experience in the position!"},{"name":"STAFFF","text":"...And it seems our guests were, without exception, rather underwhelmed by your recommendations. Perhaps more attention needs be paid to the subtle predilections displayed by each visitor, hmm?"},{"name":"ROLAND","text":"Success rate aside, I was personally impressed by your genuine enthusiasm and unfailing politeness."},{"name":"ROLAND","text":"What think you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>? Would you care to join our Gold Saucer family in a more official capacity?"},{"name":"STAFFF","text":"Ahem! Master Roland! If you will recall our discussion, this was never to be more than a temporary arrangement─"},{"name":"ROLAND","text":"Ahahaha! A jest, my good man, merely a jest! I could never ask <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> to abandon <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> chosen profession to alleviate a dilemma of our own making!"},{"name":"ROLAND","text":"I shall, however, thank you again for donating your precious time. Pray accept my heartfelt gratitude...and be sure to collect your payment before you leave!"},{"name":"STAFFF","text":"I, too, must once more express thanks for your timely assistance."},{"name":"STAFFF","text":"This “dilemma,” as Master Roland puts it, is a serious one, and I fear our dearth of guides may yet prove disastrous. Should you be willing to stay on a while longer, there is more work to be done..."},{"name":"STAFFF","text":"But let us keep accounts current, shall we? Your wages, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>."},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Hmm</span>!"},{"name":"SYSTEM","text":"You can also speak with the genial guiser, and join the marvelous masquerade in the Haunted Manor."}],"reward":{"emote":"Consider","items":[{"id":22522}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66043,66064]},"next":[69500]},"partials":[{"type":"npc","id":"1034471","obj":{"i":1034471,"n":"Nanaphon","l":40,"q":1}},{"type":"npc","id":"1034482","obj":{"i":1034482,"n":"Chief Attendant","l":1484,"q":2}},{"type":"item","id":"22522","obj":{"i":22522,"n":"MGP Bronze Card","l":1,"c":26173,"t":61}},{"type":"quest","id":"66043","obj":{"i":66043,"n":"The Gridanian Envoy","g":1,"l":"Gridania","s":86}},{"type":"quest","id":"66064","obj":{"i":66064,"n":"The Ul'dahn Envoy","g":1,"l":"Ul'dah","s":88}},{"type":"quest","id":"69500","obj":{"i":69500,"n":"A Guide to Fun","g":200,"l":"The Gold Saucer","s":197,"r":1}}]}