{"quest":{"name":"Dealings in the Desert","location":"Gridania","id":69492,"patch":5.31,"sort":16,"unlocksFunction":1,"eventIcon":71341,"issuer":1033969,"target":1033976,"genre":83,"journal":["Francel is eager to return to the road.","Heartened by your success in Gridania, Lord Francel is eager to make for Ul'dah, the Jewel of the Desert, where he hopes to find yet another prestigious trading partner willing to bring their wares to the Firmament. Lord Charlemend, too, is anxious to move on, convinced that the cultured upper crust types of the sultanate will be more receptive to his approach than the common merchants of Gridania. You promise to reconvene with your companions at the Ruby Road Exchange and offer what aid you can.","No sooner do you arrive in Ul'dah than does Lord Charlemend once more strike out on his own, paying Francel's words of warning little heed. At the young lord's request, you set out to find the count before he can do more damage to your cause with his arrogant and abrasive approach.","Amidst the stalls and markets of the Ruby Road Exchange, you come upon Lord Charlemend engaged in a verbal dispute with a local purveyor of rumors and secrets. Fearing that the stodgy aristocrat has truly bitten off more than he can chew this time, you are relieved when your acquaintance Lord Emmanellain arrives on the scene, skillfully defusing a potentially problematic situation with his silver tongue. After a brief exchange, the free-spirited nobleman offers to arrange a partnership with a prominent merchant─in exchange for a verbal promise that a good word will be put in for him with his beloved Lady Laniaitte─and his dutiful manservant Honoroit promises to see that the deal is brought to completion. Breathing a sigh of relief at having avoided a complete breakdown of negotiations, you set off to relay the good news to Lord Francel.","Francel rejoices upon hearing of your successes, offering his deepest gratitude and expressing admiration for the strong bonds of friendship you have forged with many illustrious and influential personages throughout the realm. Clearly taking umbrage that the mission has once again succeeded despite─and not because of─his best efforts, Lord Charlemend grumbles and grouses as the three of you prepare to strike out for your next destination."],"objectives":["Speak with Francel at the Ruby Road Exchange.","Search for Charlemend in the vicinity of Emerald Avenue.","Speak with Francel."],"dialogue":[{"name":"FRANCEL","text":"Our sojourn in Gridania has been most fruitful, but it is time we take to the road again. I hear that they call Ul'dah the Jewel of the Desert, and that it is a bustling center of trade and commerce. I can scarce wait to see what opportunities await us there."},{"name":"CHARLEMEND","text":"I have it on good account that the sultanate is an affluent and cultured nation, with a populace that places due importance on status and lineage. Unlike the rabble here, its people will no doubt afford me the respect I deserve."},{"name":"FRANCEL","text":"According to my research, the market district of Ul'dah is centered around a location known as the Ruby Road Exchange. I propose that we make that our first destination."},{"name":"FRANCEL","text":"As you may know, the exchange has quite a long and storied history. It is also conveniently located just a stone's throw from the airship landing where we are to touch down."},{"name":"CHARLEMEND","text":"Yes, yes. Let us be off, already. I am like to fall asleep if I stand around here any longer listening to your ramblings."},{"name":"CHARLEMEND","text":"By the Fury, but this heat is absolutely unbearable!"},{"name":"CHARLEMEND","text":"Worry not. Once they know who I am, our negotiations here are all but ensured to succeed."},{"name":"FRANCEL","text":"Why, I've never seen such a spectacular array of exotic goods and crafts!"},{"name":"CHARLEMEND","text":"Do those girls dressed only in their undergarments know no shame!? And the uncouth lot gawping at them are no better! Hmph, I was led to believe this was a <span class=\"emphasis\">cultured</span> society..."},{"name":"CHARLEMEND","text":"The array of wares is respectable, I'll allow, but I've no interest in dealing with threadbare peddlers. Let us find ourselves a trader with a proper pedigree."},{"name":"CHARLEMEND","text":"Ack, but how in the Fury's name do people survive in this stifling heat!? I shall go and secure our business partner posthaste, the sooner to take my leave of this blasted desert. You two may wait for me at an alehouse or the like, but do not make yourselves overly comfortable─it will not take long."},{"name":"FRANCEL","text":"...Oh dear. There he goes again."},{"name":"FRANCEL","text":"I am loath to trouble you once more, <span class=\"highlight\">Forename</span>, but would you be so kind as to go after him? Without your presence, I fear that he may less than endear himself to the locals, not unlike in Gridania..."},{"name":"FRANCEL","text":"Having lived my entire life in Ishgard, I am painfully aware of my own limitations when it comes to interacting with those who share a different cultural background. I fear that the Count de Durendaire has─shall we say─not yet come to this realization."},{"name":"FRANCEL","text":"I believe he ran off in the direction of...Emerald Avenue, was it? I shall head to the Quicksand in the meantime and see what news I might glean there."},{"name":"FRANCEL","text":"I must say, the sparkle in the eyes of these adventurers is positively infectious!"},{"name":"CHARLEMEND","text":"Surely <span class=\"emphasis\">one</span> of these fools will be able to provide me with useful information..."},{"name":"CHARLEMEND","text":"You there! You know something of these parts, yes? I seek to do business with a trader possessed of a reputation worthy of my great house. You will introduce one to me at once."},{"name":"WYMOND","text":"Aye, I'd be more than pleased to, friend. An' pray tell─how much is this introduction worth to you?"},{"name":"CHARLEMEND","text":"<span class=\"emphasis\">Worth</span>!? You would demand <span class=\"emphasis\">payment</span> for your piddling knowledge!"},{"name":"WYMOND","text":"Heh, you don't know how things work 'round here, do you, old man? In Ul'dah, information's a commodity like any other, an' a bloke only gets as much as he's willin' to pay for..."},{"name":"WYMOND","text":"Clearly, the knowledge I've got is worth <span class=\"emphasis\">somethin'</span> to you─else you wouldn't be standin' here before me. So, we return to the question: how heavy is your coinpurse feelin' today?"},{"name":"EMMANELLAIN","text":"(-???-)...Allow me to handle this, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>."},{"name":"EMMANELLAIN","text":"Well met, my friend! How do you fare this fine day?"},{"name":"WYMOND","text":"If it ain't my favorite Ishgardian! Come to pick ol' Wymond's brain 'bout the latest happenings here in the sultanate? 'Course, I'm happy to oblige...in exchange for whispers you've heard 'round the Holy See."},{"name":"EMMANELLAIN","text":"Ah, any other day and I would gladly trade rumors with you. Today, however, I meant only to offer a word of warning."},{"name":"EMMANELLAIN","text":"That man is none other than the lord of the highest of our High Houses. He breathes political intrigue and sups upon machination...and believe me when I say you do not wish to make an enemy of him."},{"name":"EMMANELLAIN","text":"...But don't take my word for it. Just ask our friend <span class=\"highlight\">Forename</span>."},{"name":"WYMOND","text":"Seven hells! On second thought, don't bother takin' out your coinpurse. Whatever you're offerin', it's more than clear it ain't worth the trouble. An' now, if you don't mind, I've more pressin' matters to attend to."},{"name":"EMMANELLAIN","text":"A wise decision, if I do say so myself. And worry not─I shall return before long with the rumors from the Holy See you so desire. Till next time, my friend!"},{"name":"EMMANELLAIN","text":"Fancy meeting you here, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>! I would have never expected to find you in the company of the illustrious Count de Durendaire. Whatever is the occasion?"},{"name":"CHARLEMEND","text":"...Hmph. I might ask you the same. Does the philandering son of House Fortemps intend to upstage his betters?"},{"name":"EMMANELLAIN","text":"Why, Lord Charlemend, you wound me!"},{"name":"EMMANELLAIN","text":"Rest assured that I meant only to spare you from a potentially inexpedient encounter. Purveyors of information in these parts are inevitably sharper than they let on─if they judge you to be less than knowledgeable about your surroundings, they will not hesitate to take advantage."},{"name":"CHARLEMEND","text":"...Hmph. If I needed the help of a self-indulgent stripling, I'd have asked for it."},{"name":"EMMANELLAIN","text":"But I must ask, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>, what brings you to the Jewel of the Desert with the good count at your side? What manner of information, pray tell, were you hoping to glean from our friend Wymond?"},{"name":"EMMANELLAIN","text":"Lord Francel is looking to stimulate commerce and trade in the Firmament? Well, why didn't you come to me sooner! Do you think so little of your comrade Emmanellain!?"},{"name":"EMMANELLAIN","text":"...Allow me to explain. My dear brother suggested that I might employ my considerable skill in mingling amongst the upper crust to more...shall we say <span class=\"emphasis\">productive</span> ends. After all, social gatherings are a prime opportunity for overhearing choice tidbits of rumor and gossip."},{"name":"EMMANELLAIN","text":"Remember the time we bumped into each other at the ball in Ul'dah? Oh, but I could regale you for hours with all the juicy tales I picked up on that particular excursion! And hours more about the fine ladies I encountered, but that is neither here nor there..."},{"name":"EMMANELLAIN","text":"The point being that I have acquainted myself with no small end of prestigious merchants and traders, including many who I believe would be most amenable to the idea of expanding their operations to Ishgard."},{"name":"EMMANELLAIN","text":"I daresay that more than a few of them have most fetching daughters, as well. At any rate, you need trouble yourself no further. I will reach out to the parties in question and make the necessary arrangements."},{"name":"EMMANELLAIN","text":"In return, I ask only that you convince Lord Francel to put in a good word with the lovely Lady Laniaitte on my behalf. A fair enough exchange, is it not?"},{"name":"HONOROIT","text":"Worry not, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I will see to it that my lord remains focused on the task at hand, and does not let his emotions lead him to enter into any potentially disadvantageous agreements. We shall be in touch at a later juncture."},{"name":"EMMANELLAIN","text":"Till next time, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>! I do believe there is a banquet I should be attending..."},{"name":"CHARLEMEND","text":"...Hmph. I suppose even foppery can serve a purpose on rare occasions."},{"name":"CHARLEMEND","text":"Though, needless to say, I could have handled the negotiations just as well without that fool's meddling."},{"name":"CHARLEMEND","text":"On the bright side, we can at long last take our leave of this blasted desert. Lord Francel was at some tavern called the Quicksand, yes? Let us tell him the deed is done and be on our way."},{"name":"WYMOND","text":"Lord Emmanellain has a knack for endearin' himself to members of high society...'specially the fairer sex, as you imagine. At first I befriended him out of personal interest, but I must admit I've taken a likin' to the lad."},{"name":"CHARLEMEND","text":"...Hmph. Another den of riffraff and reprobates. Still, coming to a place like this...I can't help but look around for signs of my boy."},{"name":"CHARLEMEND","text":"It's been twenty years since he vanished with nary a trace, ambushed by pirates on a voyage around the realm."},{"name":"CHARLEMEND","text":"From time to time, rumors reach my ears─that he's rotting in a gaol somewhere, that someone resembling him has been sighted making the rounds in Limsa. For my part, I fear the boy is long dead. After all, if he were alive, why would he not return home?"},{"name":"FRANCEL","text":"Welcome back, <span class=\"highlight\">Forename</span>! And Lord Charlemend! May I ask if your negotiations bore fruit?"},{"name":"FRANCEL","text":"Lord Emmanellain came to your aid, you say? Splendid! His knack for befriending influential personages never ceases to amaze me."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It would seem he's found his calling."},{"name":"A1","text":"He asked if you could put in a good word with Lady Laniaitte."},{"name":"FRANCEL","text":"...Indeed. I must say, I'm rather impressed to hear that he's making an effort to put his natural proclivity for mingling and merriment to use for a worthwhile cause. Though I cannot help but be dubious as to what truly motivates him..."},{"name":"FRANCEL","text":"...I see. I was about to comment on how impressed I was that he was putting his natural proclivities to use for such a worthwhile cause, but I see his motivations are the same as ever. That said, his consistency is admirable."},{"name":"FRANCEL","text":"At any rate, it is clear that he has done us a great service today. And with the ever-diligent young Honoroit at his side to keep him honest, I daresay we have little to worry about."},{"name":"FRANCEL","text":"I must thank you, too, for your efforts, Lord Charlemend. If you had not thought to flag down that information monger, we might still be searching aimlessly in the streets."},{"name":"FRANCEL","text":"I most humbly ask that you lend your prodigious skills to us at our next destination as well. Do you not agree, <span class=\"highlight\">Forename</span>?"},{"name":"CHARLEMEND","text":"...Hmph."}],"reward":{"gil":648},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69491]},"next":[69493]},"partials":[{"type":"npc","id":"1033969","obj":{"i":1033969,"n":"Francel","l":53,"q":2}},{"type":"npc","id":"1033976","obj":{"i":1033976,"n":"Francel","l":40,"q":2}},{"type":"quest","id":"69491","obj":{"i":69491,"n":"The Making of a Market","g":83,"l":"The Firmament","s":15,"f":1}},{"type":"quest","id":"69493","obj":{"i":69493,"n":"A Parley with Pirates","g":83,"l":"Ul'dah","s":17,"f":1}}]}