{"quest":{"name":"A Fashionable Friendship","location":"The Firmament","id":69495,"patch":5.31,"sort":2003,"eventIcon":71221,"issuer":1032813,"target":1034094,"genre":84,"journal":["Peyraquile appears excited about something."],"objectives":["Speak with Peyraquile.","Speak with Julchiezain.","Speak with Lycelle.","Speak with Lycelle again."],"dialogue":[{"name":"PEYRAQUILE","text":"Oh, it's you again! Have you heard? All sorts of merchants and craftsmen from across the realm have come to Featherfall!"},{"name":"PEYRAQUILE","text":"We were just going to head over there to see for ourselves. You should come with us─it'll be so exciting!"},{"name":"JULCHIEZAIN","text":"Hmph. This isn't supposed to be exciting, Peyraquile. These outsiders are the competition, and we're going to scout them out. Let's get going now!"},{"name":"JULCHIEZAIN","text":"Look at those stones! How do they make them sparkle like that!? ...Ah, I mean...that's easy."},{"name":"LYCELLE","text":"What do you suppose that is? And that...and that, too!"},{"name":"PEYRAQUILE","text":"This is amazing! I've never seen anything like...any of these things before!"},{"name":"LYCELLE","text":"If we could fashion some eye-catching wares of our own, I do believe we could earn good coin here."},{"name":"HWDBOY","text":"(-???-)Whatever shall we do, Sister?"},{"name":"HWDGIRL","text":"Indeed..."},{"name":"JULCHIEZAIN","text":"Hey, what's the matter? You're looking awfully glum."},{"name":"HWDGIRL03959","text":"Oh, hello there. My brother and I heard that traders from around the world had set up shop here in the Firmament, so we've come to peruse their wares."},{"name":"HWDBOY03959","text":"And what's more, Mother was kind enough to give us some extra gil to buy ourselves a special treat!"},{"name":"HWDGIRL03959","text":"There's one most luscious-looking exotic fruit that caught our eye, but sadly, it's just a bit too expensive. Still, we don't want to settle for anything less..."},{"name":"LYCELLE","text":"Is that all? If you need money, why don't you just earn it?"},{"name":"LYCELLE","text":"That's what we do. We make all sorts of things and sell them for good coin!"},{"name":"MARCECHAMP","text":"Well, aren't you a spirited one. If you're hurtin' for gil, maybe we could make ourselves a deal?"},{"name":"LYCELLE","text":"...What kind of deal?"},{"name":"MARCECHAMP","text":"Bwahaha! A tough negotiator, I see! Here's the story: I'm a hunter from the Dravanian forelands─an' a pretty good one, if I do say so myself."},{"name":"MARCECHAMP","text":"I was on my way back to the wilds after droppin' off my chocobo, an' that's when it hit me─it's bleedin' <span class=\"emphasis\">cold</span> out there, an' I could use myself a new overcoat."},{"name":"MARCECHAMP","text":"I'm not lookin' for anythin' fancy, mind you. If it keeps me warm and toasty in the blisterin' snow an' wind, that's plenty fine for me. Reckon any of you young ones'd be able to help a hunter out?"},{"name":"LYCELLE","text":"Hah! Could we <span class=\"emphasis\">ever</span>! You just watch─we'll whip you up the finest coat you've ever seen before you can bat an eyelash!"},{"name":"MARCECHAMP","text":"Good to hear it! I'll be lingerin' around the markets for a while still, so you can just bring it on back to me whenever it's ready."},{"name":"LYCELLE","text":"Well, looks like we have a job to do. It's off to Rolanberry Field for me to procure the needed tools─perhaps you'd like to come along?"},{"name":"LYCELLE","text":"Julchiezain and Peyraquile─I can count on the two of you to get some cloth from old Achard, yes?"},{"name":"LYCELLE","text":"When we have all that we need, let's meet back here. All right, everyone─let's get to work!"},{"name":"MARCECHAMP","text":"Would've reckoned someone like you'd have more important matters on your plate than tendin' to children─though I s'pose I'm not one to talk. Anyroad, I imagine you'll be going along to see that they don't get themselves into trouble."},{"name":"MARCECHAMP","text":"That lass's a determined one, ain't she? I daresay she reminds me of a certain someone..."},{"name":"ACHARD","text":"Well, if it ain't the Rolanberry children! What can old Achard do you for today?"},{"name":"PEYRAQUILE","text":"Er, we need a length of... Drat, what was it again?"},{"name":"HWDGIRL03959","text":"Th-This gentleman certainly is...friendly..."},{"name":"HWDBOY03959","text":"Oh, how I would love to take part in a good snowball fight. Sister simply refuses to even entertain the notion. She says she can't abide getting her hands cold."},{"name":"RASEQUIN","text":"Ah, you're back! I trust there's something you need from me?"},{"name":"JULCHIEZAIN","text":"Oh, you came too! Good! There's something I wanted to ask you."},{"name":"JULCHIEZAIN","text":"What sort of fabric do you think is best for making an overcoat? Peyraquile and I, we really don't know anything about weaving, you see. It's Lycelle who fancies herself a seamstress."},{"name":"ACHARD","text":"Well, if it ain't the hero of Ishgard! I'm glad to see you as well. I've been tryin' to get these lads to tell me just what sort of fabric they need, but they can't seem to give me a straight answer! So, what'll it be?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"A thick pelt to ward off the cold."},{"name":"A1","text":"A square of linen, simple yet sturdy."},{"name":"ACHARD","text":"Hah, is that all? Well, why didn't you say so!? Old Achard has just the thing for you!"},{"name":"ACHARD","text":"An' here you go! I reckon this'll serve you well enough."},{"name":"JULCHIEZAIN","text":"Why, it most certainly will! Many thanks, my good man!"},{"name":"LYCELLE","text":"Um, Rasequin? There's a favor I would ask of you."},{"name":"RASEQUIN","text":"Well, if it isn't Lycelle! What can I do for you and your friends today?"},{"name":"LYCELLE","text":"A hunter we met at the markets has hired us to make him an overcoat. Do you have a needle and thread we could borrow?"},{"name":"RASEQUIN","text":"I do, indeed, but I can't just let you have it. Why, if you so much as pricked your finger with my tools, I'd never hear the end of it."},{"name":"LYCELLE","text":"No need to fear! <span class=\"highlight\">Forename</span> is here to watch over me and see that I'm perfectly safe. Isn't that right, <span class=\"highlight\">Forename</span>?"},{"name":"RASEQUIN","text":"...I see. Well, if the savior of Ishgard is willing to vouch for you, who am I to oppose? Here you go. Just be careful with them, yes?"},{"name":"LYCELLE","text":"Thanks, Rasequin! You're the best!"},{"name":"MARCECHAMP","text":"The children all came runnin' back like someone'd set their pants on fire. Just between you and me, I ain't in <span class=\"emphasis\">that</span> much of a hurry."},{"name":"JULCHIEZAIN","text":"Honestly, I was hoping for more of a challenge. Why, I could have procured that square of fabric in my sleep!"},{"name":"PEYRAQUILE","text":"I've never made something for a real hunter before! I hope he likes it..."},{"name":"HWDGIRL03959","text":"How marvelous it must be to be able to fashion clothing with one's own hands. I can scarcely wait to learn myself!"},{"name":"HWDBOY03959","text":"Is there aught I might do to assist?"},{"name":"LYCELLE","text":"Well, I do believe we have everything we need. Shall we get started, then?"},{"name":"HWDGIRL03959","text":"Say...what do I do with this part here?"},{"name":"LYCELLE","text":"Ah! Just hold that in place, fold it over─yes, just like that─and now stitch right there. Exactly! You're a natural!"},{"name":"LYCELLE","text":"Why, it's a perfect fit! Our best work yet, if I do say so myself. And how does it feel, good sir?"},{"name":"MARCECHAMP","text":"It's sturdy, warm, an' even a fair bit more stylish than I'd been expectin'. You've got yourself one satisfied customer, lass."},{"name":"MARCECHAMP","text":"I reckon this should cover it. Go an' buy yourself somethin' nice, now."},{"name":"HWDGIRL03959","text":"Oh, thank you!"},{"name":"HWDGIRL03959","text":"And thank <span class=\"emphasis\">you</span>. We couldn't have done this without you. Here, this is your share."},{"name":"LYCELLE","text":"What? But this is just about all of it..."},{"name":"HWDGIRL03959","text":"Well, seeing as you did just about all the work, it seems only fair. Together with what our mother gave us, we have enough here to buy our fruit."},{"name":"HWDGIRL03959","text":"Speaking of Mother, we'd best head back before she starts worrying what's become of us. Might we come back to play again?"},{"name":"LYCELLE","text":"But of course! You're welcome to visit any time."},{"name":"LYCELLE","text":"How nice it must be to have a mother to return to..."},{"name":"MARCECHAMP","text":"Don't look so down, lass. Bein' able to help out a couple of nobles ain't nothin' to sneeze at─an' I reckon the friendship you've made today will serve you well."},{"name":"MARCECHAMP","text":"Speakin' of new friends, I've got just the thing to cheer you up. How'd you like to take a baby chocobo off my hands?"},{"name":"LYCELLE","text":"...A baby chocobo?"},{"name":"MARCECHAMP","text":"Aye. Hatched from the egg of one of my best birds, but I've been having the damndest time tryin' to train it. Doesn't seem suited for the huntin' life. An' so I thought it could use a new family─how'd you like to be its new mother?"},{"name":"LYCELLE","text":"Me, its...mother? Why, yes...I'd like that very much!"},{"name":"JULCHIEZAIN","text":"And with the coin we've earned, we can buy it food and everything! Heh, the little ones are going to be over the moon when they hear who's coming to live with us!"},{"name":"PEYRAQUILE","text":"Not just the little ones─Rasequin too! He adores chocobos! Come on, let's go and tell him right now!"},{"name":"MARCECHAMP","text":"You know, <span class=\"highlight\">Forename</span>... Just lookin' at you and those children, it calls to mind that time I came upon you and Ysayle in Tailfeather. Gods, how time flies..."},{"name":"MARCECHAMP","text":"But speakin' of time flyin', I'd best be movin' on. I've got a chocobo to deliver─and then it's back to the road for me. Till next we meet, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."}],"reward":{"gil":680},"reqs":{"jobs":[{"lvl":60,"id":1}],"questsType":"all","quests":[69494,69376]},"next":[69539]},"partials":[{"type":"npc","id":"1032813","obj":{"i":1032813,"n":"Peyraquile","l":3435,"q":3}},{"type":"npc","id":"1034094","obj":{"i":1034094,"n":"Lycelle","l":3435,"q":1}},{"type":"quest","id":"69494","obj":{"i":69494,"n":"May Featherfall Flourish","g":83,"l":"Limsa Lominsa","s":18,"f":1}},{"type":"quest","id":"69376","obj":{"i":69376,"n":"Small Hands, Big Hearts","g":84,"l":"The Firmament","s":2002}},{"type":"quest","id":"69539","obj":{"i":69539,"n":"Warm Hands, Warm Hearts","g":84,"l":"The Firmament","s":2004}}]}