{"quest":{"name":"The Brume Lifts","location":"The Firmament","id":69496,"patch":5.31,"sort":1501,"icon":101003,"unlocksFunction":1,"eventIcon":71341,"issuer":1033991,"target":1034083,"genre":84,"journal":["Count Charlemend de Durendaire would petition your aid in realizing his bold vision for the future of Ishgard.","On the streets of the newly opened Featherfall, the Count de Durendaire elaborates upon his plans for ensuring a thriving economy in Ishgard, a plan to which your old friend Lord Drillemont is quick to offer his aid. As Charlemend tells it, he seeks to employ his house's formidable fleet of airships as well as the knights who serve in his name─many of whom now sit idle with the war over─to ensure a steady flow of goods both into and out of the Holy See. To accomplish this, he will need an instructor to train a new contingent of pilots and machinists. Drillemont suggests one Sestivald, an accomplished airshipman and veteran of the war who has since fallen on hard times. Charlemend entrusts you with a contract, and you set off for the Brume to extend the offer to the unfortunate man.","Sestivald can scarcely believe his ears that anyone would offer him such a prestigious position, and he accepts the offer with profuse gratitude, eager to seize this chance to turn his life around. You accompany the man to visit the Count de Durendaire, such that the arrangement may be finalized.","Sestivald expresses his profound gratitude to Charlemend in front of Count Edmont de Fortemps, who has since joined you and your companions in the Brume. Moved by the Count de Durendaire's devotion to his new cause, he pledges that House Fortemps, too, will do their part to ensure that the long-suffering residents of the Brume will reap their fair share of Ishgard's newfound prosperity. You rejoice at the sight, heartened to see that a new age has truly dawned in the Holy See."],"objectives":["Deliver the document to Sestivald.","Speak with Sestivald."],"dialogue":[{"name":"CHARLEMEND","text":"I thank you for entertaining my request. There is another who I believe would be keen to hear what you have to say. He shall be arriving anon."},{"name":"DRILLEMONT","text":"<span class=\"highlight\">Forename</span>! The count mentioned there was someone he wished to introduce to me, but I did not expect it to be you! Tell me─how have you fared since last we met?"},{"name":"CHARLEMEND","text":"Hm? Ah...mayhap I should have surmised that the two of you were already acquainted."},{"name":"CHARLEMEND","text":"<span class=\"highlight\">Forename</span> accompanied Lord Francel and I on our trade delegation to the three nations, which I daresay would not have been nearly as successful as it was without <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> insight."},{"name":"CHARLEMEND","text":"Since returning home, I have been pondering many a matter. Long has House Durendaire stood at the fore and done its sworn duty to protect our countrymen from heretics and the Horde."},{"name":"CHARLEMEND","text":"But Ishgard now enters a new era. In these changing times, how must House Durendaire adapt to best serve our fair nation? This is the question that most occupies my thoughts of late."},{"name":"CHARLEMEND","text":"As our nation turns its eyes to the outside world, I would once more look within. House Durendaire shall see that our nation thrives as never before, and every Ishgardian is able to reap the benefits of peace and prosperity."},{"name":"DRILLEMONT","text":"I...I am not sure what to say, my lord. Clearly, your journey has had quite an effect on you. Needless to say, I wholeheartedly agree with your noble aim, and promise to offer whatever aid is in my power to offer."},{"name":"DRILLEMONT","text":"My knights, as well, are searching for ways in which they might serve the people now that their blades are no longer needed. Should you lack for manpower, you need but say the word."},{"name":"CHARLEMEND","text":"Very good. I would first task them with carrying out some long-overdue restorations in the Brume, which unfortunately remains in a most sorry state."},{"name":"CHARLEMEND","text":"But it will not suffice to physically rebuild the city. No, for our citizens to truly prosper, we will need a steady flow of goods and services. A healthy economy is the lifeblood of any nation, after all."},{"name":"CHARLEMEND","text":"To that end, I also intend to put House Durendaire's fleet of airships to use in shuttling materials to and from far-off lands."},{"name":"DRILLEMONT","text":"We have long employed airships to transport our knights to the battlefield. Needless to say, they make crossing the towering peaks of Coerthas far less treacherous than they would otherwise be."},{"name":"DRILLEMONT","text":"You rode one of our vessels yourself when you aided us in reclaiming the Stone Vigil, did you not? You will forever have my gratitude for your efforts that day."},{"name":"CHARLEMEND","text":"In any event, we will have need of pilots and machinists─and in far greater numbers than we have now. There are many here who would benefit from learning a trade by which they might earn their keep. We will recruit these individuals and train them to the best of our ability."},{"name":"CHARLEMEND","text":"For this, I would enlist the services of a knowledgeable and patient instructor. Mayhap there is someone you could recommend, Lord Drillemont?"},{"name":"DRILLEMONT","text":"Why, yes. I do believe I know just the man. He knows our airships inside and out, and has a most admirable passion for sharing his craft with others."},{"name":"DRILLEMONT","text":"Why, yes. I do believe I know just the man. He knows our airships inside and out, and has an admirable passion for sharing his craft with those around him. He is battle-tested as well─he was the very pilot who served to help us reclaim the Stone Vigil, after all."},{"name":"DRILLEMONT","text":"His name is Sestivald, and do not let his youth fool you─he is as knowledgeable and reliable as many men twice his age. That said, there is a rub. I have seen neither hide nor hair of him since the war ended. He suffered a wound in his last battle, and I have heard rumors that he has since fallen on hard times..."},{"name":"CHARLEMEND","text":"Many such men eke out a living in the Brume these days. It is a most unfortunate situation, and one that does not reflect well on our house...or our nation. We must do right by these brave souls, and we must do it now."},{"name":"CHARLEMEND","text":"And so I turn to you, <span class=\"highlight\">Forename</span>. Might I task you with seeking out this Sestivald and relaying my offer? I have already drawn up a contract, that you might deliver it to the man."},{"name":"CHARLEMEND","text":"I would approach the man directly, but our recent foray to the three nations has convinced me that when it comes to negotiating with the commonfolk, you are far more capable than I."},{"name":"CHARLEMEND","text":"Besides, if I am to bring my plans to fruition, there is another whose aid I must petition, and with all haste. Will you do me this favor and speak with Sestivald in my stead?"},{"name":"DRILLEMONT","text":"Then I, too, shall return to Whitebrim Front and recruit as many knights as I can for the cause."},{"name":"CHARLEMEND","text":"That would be most appreciated, Lord Drillemont."},{"name":"CHARLEMEND","text":"And with that, I will take my leave. May your meeting with Sestivald be a fruitful one."},{"name":"SESTIVALD","text":"Yes, I'm Sestivald. Who's ask─<br>...By the Fury, are mine eyes to be believed!?"},{"name":"SESTIVALD","text":"What's this? “Count Charlemend de Durendaire would personally entreat your services as an instructor and mentor to aspiring airship pilots throughout the...” Look, you may be the Slayer of Gods, but if this is your idea of a jest─!"},{"name":"SESTIVALD","text":"It...it is true, you say? Then, of course I accept. I would be a fool not to!"},{"name":"SESTIVALD","text":"Though why the lord of the highest of houses and a hero such as yourself would turn to a broken-bodied nobody rotting his days away in the Brume is beyond my comprehension."},{"name":"SESTIVALD","text":"Yes, I saw you on many an occasion when I still served at Whitebrim Front. Seeing you bravely stand in the face of distrust and outright hostility to fight for a land not even your own was─and remains─an inspiration to me."},{"name":"SESTIVALD","text":"Pray allow me to say that it was a true honor to have had you on board my airship in the operation to retake the Stone Vigil. The mere memory of that triumph has carried me through even the darkest of days."},{"name":"SESTIVALD","text":"At any rate, the letter goes on to state that should I accept the offer, I am to report to the site of the planned training facility─which, according to this, is to be constructed here in the Brume─at once."},{"name":"SESTIVALD","text":"And I do believe I am inclined to do just that. Might I be so bold as to ask you to accompany me? It has been a while since I consorted with nobles, and I fear I might do something to embarrass myself."},{"name":"SESTIVALD","text":"According to the letter, the site in question is just beyond here. Shall we?"},{"name":"CHARLEMEND","text":"You must be Sestivald. On behalf of House Durendaire, I thank you for entertaining my offer."},{"name":"CHARLEMEND","text":"Allow me to get right to the matter at hand. As you may know, Lord Francel's efforts to bolster trade with some of the most prestigious merchants from the three nations have borne considerable fruit. As such, we have need for capable airship pilots to shuttle supplies to and fro."},{"name":"CHARLEMEND","text":"Lord Drillemont has spoken highly of your expertise. I would have you train the next generation of pilots who will steer Ishgard to a brighter future. It is my hope that this will also serve to provide an honest, profitable trade for a number of the unfortunate souls who call this place home."},{"name":"SESTIVALD","text":"M-My lord, I...I do not know what to say. You show great mercy to this battered, broken man and give him a chance to rebuild his life in a way he never imagined."},{"name":"SESTIVALD","text":"I am honored and blessed to accept your offer. For as long as I draw breath, I will serve your cause with every onze of strength and passion that I am able to muster."},{"name":"CHARLEMEND","text":"There is also the matter of securing the funds necessary to operate the new facility, as well as to maintain our fleet. Lord Edmont, I trust I can count on the support of House Fortemps in this matter?"},{"name":"EDMONT","text":"That is no longer my decision to make. But I will consult with Artoirel, and I see no reason why he would not be receptive to your cause."},{"name":"EDMONT","text":"When you arrived at Fortemps Manor and said you would speak with me in private, I must admit I had my doubts as to what you had in mind."},{"name":"EDMONT","text":"But I cannot very well turn a blind eye to the unprivileged men and women of our society, can I? Not when the savior of Ishgard stands before me, ready to fight for them."},{"name":"EDMONT","text":"That <span class=\"emphasis\">is</span> why you brought <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span> here, is it not? You may think yourself subtle, Lord Charlemend, but I am wise to your ways."},{"name":"EDMONT","text":"After all, this is not the first time you have brought me around to your cause. Though this time, at least, I can say it is a noble one."},{"name":"CHARLEMEND","text":"For years, Houses Durendaire and Fortemps have struggled for supremacy. But we are not so different, you and I. Is it such a terrible thing that we take advantage of each other from time to time? I think not."},{"name":"CHARLEMEND","text":"Besides, I cannot very well let you live a life of leisurely retirement while I remain on the front lines, fighting for men and women who have been forgotten for far too long."},{"name":"CHARLEMEND","text":"As members of Ishgard's most privileged class, it is our calling to lead our nation into a new era of prosperity and enlightenment─and I, for one, have no intention of shirking this duty."},{"name":"SYSTEM","text":"Thanks to your efforts, Houses Durendaire and Fortemps have awakened to the plight of Ishgard's poor and suffering, and the restoration of the Brume has begun in earnest!"}],"reward":{"items":[{"num":10,"id":30129},{"num":10,"id":30128}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69494]},"next":[69615]},"partials":[{"type":"npc","id":"1033991","obj":{"i":1033991,"n":"Charlemend De Durendaire","l":3435,"q":1}},{"type":"npc","id":"1034083","obj":{"i":1034083,"n":"Sestivald","l":2300,"q":1}},{"type":"item","id":"30129","obj":{"i":30129,"n":"Magicked Prism (House Fortemps)","l":1,"c":22630,"t":61}},{"type":"item","id":"30128","obj":{"i":30128,"n":"Magicked Prism (House Durendaire)","l":1,"c":22630,"t":61}},{"type":"quest","id":"69494","obj":{"i":69494,"n":"May Featherfall Flourish","g":83,"l":"Limsa Lominsa","s":18,"f":1}},{"type":"quest","id":"69615","obj":{"i":69615,"n":"You Can Count on It","g":84,"l":"The Firmament","s":1502,"f":1}}]}