{"quest":{"name":"Fantastic Mr. Faux","location":"Idyllshire","id":69501,"patch":5.3,"sort":6300,"unlocksFunction":1,"eventIcon":71341,"issuer":1032785,"target":1033921,"genre":101,"journal":["The painfully Ishgardian man appears to be searching for a suitably decorous way to address you.","With needless formality, an Ishgardian gentleman inquires as to whether you know Khloe Aliapoh. As you, in fact, do, he subsequently explains that she is inviting all of her acquaintances to come and play with her new friend─a fox that evidently bears some resemblance to an unspecified intimidating personage.","You seek out Khloe's new friend─who it transpires has been dubbed the “faux commander” by Rowena for his supposed resemblance to the lord commander of Ishgard─and he explains that, not unlike Khloe herself, he is in search of wondrous tales of adventure. He is quite fantastical himself, however, and thus requires stories that are all the more incredible for it. You will need to chase your wildest imaginings if you are to satisfy his demands and gain access to Faux Hollows and its fabulous prizes."],"objectives":["Speak with the faux commander."],"dialogue":[{"name":"ISHGARDMAN","text":"Pardon the suddenness of my address, <span class=\"alternative-container\"><span class=\"alternative\">milady</span><span class=\"alternative\">milord</span></span>, but would you perchance be familiar with one Khloe Aliapoh?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Indubitably, good sir."},{"name":"A1","text":"I may have forgotten to turn in my copy of Wondrous Tails...again."},{"name":"ISHGARDMAN","text":"It seems the word I bear will indeed be of interest to you, then. You see─Miss Aliapoh has a new pet fox, and she has made it known that her most feal of acquaintances─which include me, naturally─are invited to regale him with tales for “fantastical” rewards!"},{"name":"ISHGARDMAN","text":"Surely Miss Aliapoh believes her furry friend to share in her appreciation for tales of gallantry─and I daresay my heritage makes me something of an expert. Alas...the resemblance is simply too uncanny. I cannot go near the creature without feeling as if I'm being judged."},{"name":"ISHGARDMAN","text":"My honor will not allow me to simply ignore the invitation, however─so I thought you might wait upon the fox in my stead. The children have taken to calling him “Commander,” for reasons most obvious. You will certainly know him when you see him."},{"name":"SYSTEM","text":"A small fox with an oddly haughty visage stands perched atop the counter. You squint, attempting to see the resemblance the man made reference to..."},{"name":"FAUXCOMMANDER","text":"If you all continue to stare at me so, I'm going to institute a fee."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Augh, it talks! This is definitely the oddest thing I have encountered, somehow."},{"name":"A2","text":"Aymeric! What have they done to you?"},{"name":"A2","text":"You're an auspice, then."},{"name":"FAUXCOMMANDER","text":"Yes, yes, “Eek, a talking fox!” this, “Seven hells, that ain't natural!” that. You are all so very melodramatic. I daresay if you were ever to meet my fellows at Reisen Temple you'd drop dead out of sheer commitment to theater."},{"name":"FAUXCOMMANDER","text":"Hilarious. An entirely original joke that I have not heard eight times already this <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>, certainly."},{"name":"FAUXCOMMANDER","text":"I am. And I must say that such a response is a welcome respite from all of the shrieking and cooing I have encountered."},{"name":"FAUXCOMMANDER","text":"But let us speak of yourself. You appear to match the─exhaustingly enthusiastic─descriptions Khloe has given me of the adventurer who tells her “just the most wonderful” stories. Are you indeed that adventurer?"},{"name":"FAUXCOMMANDER","text":"Then you are precisely the sort of person I set out to find─the sort with riveting tales to tell. And I am sorely in need of tales. Tales that inspire the mind, tales that tear at the heart, tales that grip the soul! For my tea parties, you understand."},{"name":"KHLOEALIAPOF","text":"Oh, oh! It's Khloe's bestest friend, <span class=\"highlight\">Forename</span>! Are you making friends with the commander too?"},{"name":"KHLOEALIAPOF","text":"The commander says he spends days and days and <span class=\"emphasis\">days</span> talking to his other animal friends...but after so many days, all of them have run out of new stories to tell, and he's searching far and wide for new ones. Stories, that is! He still likes his friends."},{"name":"KHLOEALIAPOF","text":"So really, he's just like Khloe! Isn't that right, Commander?"},{"name":"FAUXCOMMANDER","text":"As I've said, my name is Sotan. I swear, between you children and Rowena with her <span class=\"emphasis\">little joke</span>, I'll never be rid of this blasted nickname..."},{"name":"FAUXCOMMANDER","text":"Ahem. In any case, if I understand correctly, you have faced and bested all manner of fiends, including many gods of this land. Surely you have some tales worth my time─or ideas from which to spin them, at least."},{"name":"FAUXCOMMANDER","text":"If you can weave me a tale most fantastical, I will grant you access to Faux Hollows─a whimsical adventure unto itself!"},{"name":"FAUXCOMMANDER","text":"...Or, strictly speaking, a game of chance that I designed. Regardless, make good use of your cunning─and luck─and I will conjure you faux leaves as tokens of my esteem. As you have doubtless guessed, a sufficiency of leaves can be traded for other, less ephemeral incentives."},{"name":"FAUXCOMMANDER","text":"I believe that's the long and short of it, as the youths say─but don't get ahead of yourself. As I said, no ordinary story will do. I require tales to excite even those who are <span class=\"emphasis\">sung of</span> in tales...so I expect you'll need to exercise your imagination to a certain degree. "},{"name":"FAUXCOMMANDER","text":"My guests care not about the authenticity of their entertainment, so dispense with the truth as you will. Just make sure to tell me your stories whilst they're still fresh in your mind. Embellishment is one thing, but continuity errors are quite another."},{"name":"SYSTEM","text":"You now have access to unreal trials. These challenging encounters can be accessed via the Raid Finder."},{"name":"SYSTEM","text":"Unreal trials are duties that challenge you to confront past foes, now more powerful than ever before, at the current level cap."},{"name":"SYSTEM","text":"Available unreal trials will change with the release of each major patch."},{"name":"SYSTEM","text":"Once per week, you may speak to the faux commander after completing an unreal trial for the chance to play Faux Hollows."},{"name":"SYSTEM","text":"The availability of Faux Hollows can be confirmed at any time via the Raid Finder by viewing the details of any unreal trial."},{"name":"SYSTEM","text":"The completion status of unreal trials and availability of Faux Hollows will reset every [Reset]<span class=\"alternative-container\"><span class=\"alternative\">Sunday</span><span class=\"alternative\">Monday</span><span class=\"alternative\">Tuesday</span><span class=\"alternative\">Wednesday</span><span class=\"alternative\">Thursday</span><span class=\"alternative\">Friday</span><span class=\"alternative\">Saturday</span></span> at <span class=\"alternative-container\"><span class=\"alternative\"><span class=\"alternative-container\"><span class=\"alternative\">1</span><span class=\"alternative\">2</span><span class=\"alternative\">3</span><span class=\"alternative\">4</span><span class=\"alternative\">5</span><span class=\"alternative\">6</span><span class=\"alternative\">7</span><span class=\"alternative\">8</span><span class=\"alternative\">9</span><span class=\"alternative\">10</span><span class=\"alternative\">11</span><span class=\"alternative\">12</span></span></span><span class=\"alternative\">12</span></span>:00 <span class=\"alternative-container\"><span class=\"alternative\">a.m.</span><span class=\"alternative\">p.m.</span></span> (Earth time)."},{"name":"SYSTEM","text":"For further details, please speak with the faux commander once more. May your imagination carry you beyond mortal deeds!"}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":142}],"questsType":"all","quests":[67928,69190]}},"partials":[{"type":"npc","id":"1032785","obj":{"i":1032785,"n":"Painfully Ishgardian Man","l":2082,"q":1}},{"type":"npc","id":"1033921","obj":{"i":1033921,"n":"Faux Commander","l":2082,"s":1,"q":1,"r":1,"a":2093,"c":[5.77,6.13]}},{"type":"quest","id":"67928","obj":{"i":67928,"n":"Keeping Up with the Aliapohs","g":101,"l":"Idyllshire","s":6100,"f":1}},{"type":"quest","id":"69190","obj":{"i":69190,"n":"Shadowbringers","g":8,"l":"The Tempest","s":1060}}]}