{"quest":{"name":"A Fish Too Far","location":"Limsa Lominsa","id":69502,"patch":5.3,"sort":198,"icon":101014,"eventIcon":71221,"issuer":1034162,"target":1034163,"genre":201,"journal":["Mayaru Moyaru's beaming smile is betrayed by a hint of desperation in his eyes.<br>※This quest is available for a limited time only.","Once again, the sun's scorching rays herald the arrival of the Moonfire Faire to Eorzea, but it appears that they have also brought something deadly in their wake. Reports from the Fishermen's Guild tell of a gargantuan man-eating shark terrorizing the shores of Costa del Sol, and the hosts of the festivities are desperately looking for help to drive off this threat before anyone comes to harm. Speak to Haermaga in Costa del Sol to volunteer your aid to this beleaguered celebration.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Haermaga greets you heartily, eager to have any assistance he can get. He informs you that Gegeruju has begun assembling a special team of researchers to combat this maritime threat, and asks you to stand watch with him while awaiting their arrival. No sooner do you begin scanning the horizon than the terrible shark emerges from the waters, sending revelers running for their lives. As you prepare for a fight, however, a voice urges you to stand down, and you turn to see a woman who introduces herself as Thracie, leader of the self-styled Bombardiers. Their objective is to use the kobolds' expertise in all matters explosive to blast the shark back into the depths whence it came. To do so, they have constructed an artificial Bombard, the very threat which spurred the inception of the Moonfire Faire. Although Haermaga is skeptical of their methods, it is the best plan available, so you agree to aid the Bombardiers in their mission. Speak with Thracie to hear the particulars.","You learn that the Bombardiers mean to control the artificial Bombard by way of a traditional Lalafellin dance known as the flame dance. She teaches you the steps, explaining that it can be used to stoke the Bombard's flames for combat or to rekindle them when they burn low. Make expert use of the steps to guide the Bombard to victory over the deep-sea menace.","True to its name, the Bombard bursts in a dazzling explosion, sending the shark scurrying back into the ocean. The Bombardiers celebrate their victory, and Thracie tasks you with reporting the triumph to Haermaga at once.","Haermaga is surprised the haphazard plan worked, but is nonetheless pleased at its outcome. Thracie ponders how such a massive and feral creature wound up on the shores of Costa del Sol, and just as she is about to drop the subject, she is taken aback by the sudden appearance of a miniature monster at her heels. Thracie's scream echoes down the beaches, followed soon after by Captain Foerzagyl of the <span class=\"emphasis\">Endeavor</span>. He was looking for the tiny shark, who has been his steadfast companion ever since it was plucked from the ocean during a fishing voyage. You quickly dismiss any connection between the two creatures as Foerzagyl hurries back to his ship, and decide to content yourself with a job well done, and a summer well rescued."],"objectives":["Speak with Haermaga.","Speak with Thracie.","Complete the FATE “Bombard vs. Shark” in the southeast region of the Moonfire Faire grounds.","Report to Haermaga."],"dialogue":[{"name":"MAYARUMOYARU","text":"Ah, you've come! There are but two constants in summer: sweltering heat and brave adventurers, and the Moonfire Faire cannot well begin in earnest until both have arrived. The sweat on my brow and your cocksure stride tell me that finally that time is here!"},{"name":"MAYARUMOYARU","text":"Ah, my eyes did not deceive me! Through the sun's burning and blinding rays, I spied a gallant figure approaching. I had feared that perhaps it was a mirage, but I'm overjoyed to see I was wrong─for it is yet another festive soul come to join the Moonfire Faire!"},{"name":"MAYARUMOYARU","text":"But first, it seems we have an uninvited guest on the shores of Costa del Sol that is causing chaos and alarm among our celebrations."},{"name":"MAYARUMOYARU","text":"If reports from the Fishermen's Guild are to be believed, a gargantuan man-eating shark has been terrorizing the coast, gnashing its teeth and threatening to devour revelers whole. Needless to say, this has put something of a damper on an otherwise rousing event."},{"name":"MAYARUMOYARU","text":"For a mercy, no one has yet come to harm, but I fear it is only a matter of time before the shark must sate its appetite. We must nip this problem in the bud before tragedy strikes."},{"name":"MAYARUMOYARU","text":"While the members of our committee are doing their utmost to find a solution, a pair of capable hands could only speed things along. Haermaga, chief chaperone of the festivities, is standing by in Costa del Sol, eager to greet any potential volunteers."},{"name":"MAYARUMOYARU","text":"Haermaga is standing by to set any volunteers to work as soon as he can. You can find him near the Isle of Endless Summer─and hurry, before he or anyone else ends up at the bottom of that shark's gullet."},{"name":"HAERMAGA","text":"Well, well, the savior of the summer has arrived! I was afraid we'd have to pack up for safer shores, but now that the true apex predator has arrived, I believe we can stay readily put!"},{"name":"HAERMAGA","text":"You there! Could it be our call for aid has finally been answered? You certainly have the look of someone who's vanquished a predator or two in your day!"},{"name":"HAERMAGA","text":"Although I've yet to see it with my own eyes, there've been disturbing reports of an enormous shark lurking in the waters nearby."},{"name":"HAERMAGA","text":"The Adventurers' Guild takes these reports seriously─our guests' safety comes first and foremost. Culling fiends is our bread and butter, and now it's time to show our mettle."},{"name":"HAERMAGA","text":"Master Gegeruju means to protect his stake in the festival as well, and as we speak is assembling an elite team of shark hunters. They should be here soon, but I'd appreciate if you'd keep lookout with me in the meantime. Two pairs of eyes are better than one, after all."},{"name":"BEACHGUY03966","text":"Shark! Shark! Run for your lives!"},{"name":"HAERMAGA","text":"H-Hey, wait just a bleedin' minute! You don't mean to face that beast all by your lonesome, do you!? I'm not exactly dressed for combat here. "},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's bite or be bitten."},{"name":"A1","text":"Why do you think I came all this way?"},{"name":"A1","text":"I've fried bigger fish than this before."},{"name":"HAERMAGA","text":"Hah, spoken like a seasoned adventurer! But you're as foolish as you are daring if you think I'm letting you risk life and limb needlessly!"},{"name":"HAERMAGA","text":"Bigger fish!? Then let's hope this one's mother isn't nearby..."},{"name":"THRACIE","text":"(-???-)Stay your weapon! Reckless heroics will only serve to incite the monster."},{"name":"HAERMAGA","text":"Well, looks like you'll have to share the glory today. The certified shark hunters are here!"},{"name":"THRACIE","text":"Thracie, at your service! In years past the Cascadiers were formed to quench the Bombards' fiery rage, and in that same spirit the <span class=\"emphasis\">Bombardiers</span> have assembled to send this new threat back to the depths. We will see safety returned to your beaches."},{"name":"BAGO","text":"Ba Go has been recruited to lend his expertise─knowledge, skill, expertise! Ba Go knows a thing or two about explosions! Haha! Heeheahhahaha!"},{"name":"HAERMAGA","text":"The Bombardiers, eh? I wish the guild would've mentioned that they were handing over the torch..."},{"name":"JIRIRI","text":"Ah, but the guild wasn't involved in our inception. The Bombardiers owe their existence solely to Master Gegeruju. He could not afford to wait for someone else's solution, but he <span class=\"emphasis\">could</span> afford to make his own."},{"name":"THRACIE","text":"This shark is unlike any I have seen in my long years of research. Judging from my analysis of its movements and behaviors, it means to leave its watery home and encroach upon these very shores."},{"name":"HAERMAGA","text":"Why the hells would it do that!?"},{"name":"THRACIE","text":"That much remains a mystery. The beast's final destination is impossible to discern, but we would be fools to let it run amok."},{"name":"THRACIE","text":"However, it seems to have no interest in attacking us. Yet. If we were to engage it directly, however, it may gain a taste for blood, and there is no telling how many innocent lives would be lost before its appetite was sated. If we're to coax it back whence it came, it must be done without spilling blood."},{"name":"THRACIE","text":"And that is where our kobold friend comes in. In exchange for some rare alchemical supplies, he has offered to share with us his clan's methods for creating the selfsame bombs which so often threatened our realm in summers past."},{"name":"BAGO","text":"Yes, Ba Go treats his bombs most lovingly, most protectively! But Ba Go loves shiny materials just as much. Materials which were promised─sworn, pledged, promised!"},{"name":"BAGO","text":"<span class=\"emphasis\">You</span> must also promise not to tell the other kobolds that Ba Go shares his secrets. If they were to find out, Ba Go would never hear the end of their grumblings─complaints, moans, grumblings!"},{"name":"BAGO","text":"To create a bomb that will become a breathtaking explosion is an art! One must pamper it as they would one's own child. Kobolds keep their secrets close, but Ba Go is generous─giving, kind, generous!"},{"name":"THRACIE","text":"...Yes, indeed. Thanks to Ba Go's cooperation, we have managed to create our own Bombards, which should explode with enough force to disabuse this shark of any notions of coming further inland."},{"name":"HAERMAGA","text":"Have you lost your bloody minds! The realm almost burned on account of those demons, and now you're using them as toys!?"},{"name":"THRACIE","text":"We must use the knowledge gleaned from conflicts past to see us safely through those to come. Don't you agree, adventurer? If you would offer your aid to our cause, me and the other Bombardiers would gladly welcome you among our ranks."},{"name":"THRACIE","text":"Splendid! Any adventurer brave enough to draw their weapon against such an overwhelming foe is sure to be a formidable ally. Our operation will begin soon─speak with me when you are ready."},{"name":"BAGO","text":"Hehehe... Heahaha! The realm will be saved by a shower of flames!"},{"name":"JIRIRI","text":"I suppose you are curious about the garments I'm wearing? All in due time, I promise."},{"name":"THRACIE","text":"Greetings. I take it your preparations are complete? Then let's get right to it."},{"name":"THRACIE","text":"The first obstacle we had to overcome was the matter of how to manipulate the Bombard without also putting ourselves in danger. And for that, we once again found inspiration in bygone days."},{"name":"THRACIE","text":"Perhaps you have heard of the bomb dance? It is a tradition that originated in the Far East─performed during the summer, it is also said to have the power to influence the Bombards themselves. I asked Ba Go if his creations could be trained to respond to the movements and rhythm of such a dance."},{"name":"THRACIE","text":"He assured me most emphatically that they could, and considering the nature of the threat before us, suggested we use a dance even more explosive than the bomb dance. Jiriri put forth one of her favorites─traditional steps performed by the Lalafells of the southern isles. Jiriri, if you will?"},{"name":"JIRIRI","text":"Of course. If it pleases you, allow me to perform the flame dance, taught to me by my grandmother."},{"name":"BAGO","text":"Amazing, astounding, amazing! Such powerful movements would set the iciest heart ablaze─Ba Go shudders to think how it might inflame his little bombs!"},{"name":"THRACIE","text":"Jiriri tells me the dance's purpose is twofold. Not only did it spur the warriors of the isles to action, but it was said to mollify the savage spirits slumbering within the volcanic mountains overshadowing the villages."},{"name":"THRACIE","text":"Considering the complexity of the steps, it may behoove you to first practice with a smaller specimen. 'Twould be a shame if our noble endeavor was cut short by a premature detonation."},{"name":"THRACIE","text":"When again the shark emerges to wreak havoc, we will send forth one of our Bombards. Their flames will need some encouragement at first, so dance thusly to enkindle them."},{"name":"THRACIE","text":"Continue the dance and the Bombard will be set ablaze, hopefully making it a match for that shark. If the creature's flames should begin to fade, however, then perform these steps to restore their vibrancy."},{"name":"THRACIE","text":"As simple as that!<br>And now we play the waiting game. Stay vigilant, and the moment you see even a fin emerge from the waters, brace yourself and we shall begin at once. There is much at stake, but I believe we are more than up for the task!"},{"name":"SYSTEM","text":"Join the FATE “Bombard vs. Shark,” which will appear in the southeastern region of the faire grounds, and make careful use of the flame dance to lead the Bombard to victory over the shark."},{"name":"SYSTEM","text":"Pay close attention to the Bombard's health, and use both forms of the flame dance to empower it to drive its foe back to the ocean floor."},{"name":"JIRIRI","text":"The steps may seem intimidating at first, but I'm certain you'll master them in no time at all. You'll have to, if we're to have any hope of salvaging summer!"},{"name":"SYSTEM","text":"You have learned the emote <span class=\"highlight\">Flame Dance</span>!"},{"name":"THRACIE","text":"I must see that the other Bombardiers are carrying out their duties. We must work flawlessly if we're to succeed!"},{"name":"JIRIRI","text":"To think that a humble Lalafellin dance might play a role in saving summer! Master Gegeruju will be overjoyed to hear the news─assuming our plan goes off without a hitch, that is."},{"name":"BAGO","text":"Look at her! So fiery─blazing, flaming, fiery! She is Ba Go's pride, and her explosion will be one for the songs! Heheheahaha!"},{"name":"THRACIE","text":"Well done! The operation went flawlessly, in no small part thanks to your noble efforts! We must report our success to Haermaga at once!"},{"name":"JIRIRI","text":"Even my grandmother would have been impressed by your display!"},{"name":"BAGO","text":"Did you see, did you see? Ba Go's bomb was so pretty─breathtaking, beautiful, pretty! Like an exploding star!"},{"name":"HAERMAGA","text":"You crazy bastards really went and did it! You put on a show I could see from here, and with a burning passion I could feel right down to the cockles of my heart!"},{"name":"THRACIE","text":"We could not have done it without <span class=\"highlight\">Forename</span>! I daresay the Bombardiers have not only carried the torch of their predecessor, but have set it ablaze with a flame that will burn forevermore!"},{"name":"BAGO","text":"Ba Go's bomb went forth with such courage, such grace! Ba Go must work day and night to make another that will outshine her blaze of glory!"},{"name":"HAERMAGA","text":"I don't know about all that, but it's plain to see that your efforts have brought peace back to the shores of Costa del Sol. Seems we won't be canceling this year's Moonfire Faire after all."},{"name":"THRACIE","text":"And yet, there are many questions left unanswered. How did that shark develop legs and hands? And for what purpose did it come ashore?"},{"name":"THRACIE","text":"Aaah! Sh...shaaark!"},{"name":"FOERZAGYL","text":"A thousand apologies, lass! Didn't mean to give you such a fright. This little bugger can scurry off quicker than a chocobo when it gets a mind to!"},{"name":"THRACIE","text":"Captain Foerzagyl! What brings you here? And what brings...that!?"},{"name":"FOERZAGYL","text":"My little friend here roams wheresoever the winds carry him. Isn't he just the cutest? A face you could kiss─if it weren't covered in scales, that is─and he's got the heart of an adventurer!"},{"name":"FOERZAGYL","text":"He flopped onto the deck of the <span class=\"emphasis\">Endeavor</span> during one of our ocean fishing voyages, and it was love at first sight. We've been fast friends ever since."},{"name":"FOERZAGYL","text":"I could ask for no better a shipmate on the high seas, and I reckon the feelin' is mutual. Well then, I'd best head back to the ship. The Navigator waits for no man─or shark!"},{"name":"HAERMAGA","text":"You don't think...? What if that big fish was here looking for that little fish?"},{"name":"JIRIRI","text":"Quite impossible! What would be the chances of that? Besides, even if it were the case, that tiny critter seemed to be quite content at Captain Foerzagyl's side."},{"name":"THRACIE","text":"I suppose it matters not. By our deeds the Moonfire Faire has been saved, and we can return to the festivities."},{"name":"BAGO","text":"So bright, so violent, Ba Go's little bomb. Ba Go will never forget you..."},{"name":"JIRIRI","text":"Yes, you should rightly be proud of her contribution!<br>Anyroad, I should report back to Master Gegeruju at once. Doubtless he will jump with joy at the news of our victory!"},{"name":"HAERMAGA","text":"Everything's wrapped up in a neat little package, eh? No way these unresolved questions will come back and bite us in the arse? Well, if they do...I hope you can remember the steps to that dance!"}],"reward":{"emote":"Flame Dance"},"reqs":{"jobs":[{"lvl":30,"id":1}]},"next":[69503]},"partials":[{"type":"npc","id":"1034162","obj":{"i":1034162,"n":"Mayaru Moyaru","l":28,"q":1,"t":"Moonfire Faire Chaperone"}},{"type":"npc","id":"1034163","obj":{"i":1034163,"n":"Haermaga","l":32,"q":2}},{"type":"quest","id":"69503","obj":{"i":69503,"n":"Flame On","g":201,"l":"Eastern La Noscea","s":199}}]}