{"quest":{"name":"A Guide to Fun","location":"The Gold Saucer","id":69500,"patch":5.3,"sort":197,"repeatable":1,"icon":101013,"eventIcon":71222,"issuer":1034482,"target":1034482,"genre":200,"journal":["The chief attendant appears eager to retain your services.<br>※This quest is available for a limited time only.","The chief attendant remains concerned that his shorthanded staff will fail to meet the demands of the campaign crowd. He bids you report to the guides responsible for hospitality in Event Square, Round Square, or Wonder Square, and put yourself at the disposal of the Saucer's guests.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","You have rendered what service you may to the Saucer's visitors. Return to Entrance Square and report to the chief attendant.","Upon returning to the chief attendant, you receive both praise for your efforts and payment for your service. Should you wish to provide further assistance, it seems the Saucer's special campaign is set to continue..."],"objectives":["Speak with a Gold Saucer guide.","Report to the chief attendant."],"dialogue":[{"name":"STAFFF","text":"These crowds show no sign of thinning... Might you be willing to brave another round of interaction with our guests?"},{"name":"STAFFF","text":"Splendid! Then I shall send you once more unto the breach! As of present, our most congested areas appear to be Event Square, Round Square, and Wonder Square."},{"name":"STAFFF","text":"Report to the Saucer's guides in any of these three squares, and see to it that our visitors are catered to!"},{"name":"STAFFF","text":"Event Square, Round Square, and Wonder Square are all in need of supplementary staff, so take your pick!"},{"name":"STAFF03964","text":"Thank you for coming! Are you ready to begin your shift?"},{"name":"Q1","text":"Are you ready?"},{"name":"STAFF03964","text":"Excellent! Our guests await your assistance!"},{"name":"HAMON","text":"(-???-)Hah hah hah! Is that <span class=\"emphasis\">you</span>, <span class=\"highlight\">Forename</span>?"},{"name":"HAMON","text":"...Working as a guide, you say? Well, I could use some suggestions."},{"name":"HAMON","text":"(-???-)Hah hah hah! You look like the helpful sort!"},{"name":"HAMON","text":"You see, I'm having a terrible time choosing which game to play. In my younger days, I would impress the ladies with my vigorous pugilism, but I wonder if excelling at one of these amusements might have a similar effect...?"},{"name":"Q1","text":"Which attraction do you recommend?"},{"name":"A1","text":"Might I suggest Doman mahjong?"},{"name":"A1","text":"Might I suggest Cuff-a-Cur?"},{"name":"A1","text":"Might I suggest Triple Triad?"},{"name":"HAMON","text":"Oho, why didn't I think of that! Stand aside─the Holyfist needs to go and rack up a holy high score!"},{"name":"SYSTEM","text":"Hamon seems greatly enthused by your suggestion!"},{"name":"HAMON","text":"...Hm. I'm not sure how that'll bring the lovelies running, but I suppose some prefer the more thoughtful type."},{"name":"SYSTEM","text":"Hamon seems less than enthused by your suggestion..."},{"name":"MYLLA","text":"(-???-)<span class=\"highlight\">Forename</span>! What brings you to the Gold Saucer?"},{"name":"MYLLA","text":"...I see. Perhaps you might help me then."},{"name":"MYLLA","text":"(-???-)Excuse me, might I ask for some assistance?"},{"name":"MYLLA","text":"I needed some time away from the Coliseum, but even in play I hope to find ways to improve my bladework. Would any of these diversions serve such a role?"},{"name":"Q2","text":"Which attraction do you recommend?"},{"name":"A2","text":"Might I suggest Any Way the Wind Blows?"},{"name":"A2","text":"Might I suggest Crystal Tower Striker?"},{"name":"A2","text":"Might I suggest the Slice Is Right?"},{"name":"MYLLA","text":"Ah, so you must anticipate and avoid the sword strikes, yes? That sounds perfect!"},{"name":"SYSTEM","text":"Mylla seems greatly enthused by your suggestion!"},{"name":"MYLLA","text":"I struggle to imagine how that could enhance my swordplay, but I shall take a look if I have a spare moment..."},{"name":"SYSTEM","text":"Mylla seems less than enthused by your suggestion..."},{"name":"ADALBERTA","text":"(-???-)Fancy meeting you here. Taking a break from breaking rock, eh?"},{"name":"ADALBERTA","text":"...Ah, more work than play, then. Either way, I could do with some advice..."},{"name":"ADALBERTA","text":"(-???-)You work here, yes? If you have a moment, I could do with some advice..."},{"name":"ADALBERTA","text":"What kind of amusing things do they have for a miner like me? I've spent endless hours clambering about mountains and such, so I can handle some jumping and climbing."},{"name":"Q3","text":"Which attraction do you recommend?"},{"name":"A3","text":"Might I suggest the Moogle's Paw?"},{"name":"A3","text":"Might I suggest Leap of Faith?"},{"name":"A3","text":"Might I suggest Lord of Verminion?"},{"name":"ADALBERTA","text":"Oh, that does sound like a challenge! I'd say my time in craggy places puts me at an advantage, but I suppose we'll see!"},{"name":"SYSTEM","text":"Adalberta seems greatly enthused by your suggestion!"},{"name":"ADALBERTA","text":"They say you should put work aside from time to time, but I wonder if something like that would keep my interest...?"},{"name":"SYSTEM","text":"Adalberta seems less than enthused by your suggestion..."},{"name":"STAFF03964","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─that should be sufficient for the moment. Now, as for the results of your performance..."},{"name":"STAFF03964","text":"...It seems every guest with whom you spoke was greatly enthused by your recommendations! A flawless display of service! You really must consider joining us as a full-time employee!"},{"name":"STAFF03964","text":"...It seems you were a touch too hasty with one or two of your recommendations. Overall, I would mark it a fair attempt."},{"name":"STAFF03964","text":"...It seems our guests were not terribly enthused by your recommendations. Perhaps a little more time spent studying our attractions would serve you better?"},{"name":"STAFF03964","text":"But putting such matters aside, any effort made towards maintaining the Saucer's reputation for hospitality is most appreciated. Pray collect your wages from the chief attendant at Entrance Square!"},{"name":"GEROLT","text":"(-???-)Bloody hells! Give a man a break! Did ye follow me here or summat!?"},{"name":"GEROLT","text":"...Just pitchin' in then, are ye? Well, ain't ye the perfect saint... Although come to think of it, might be as ye could do me a favor!"},{"name":"GEROLT","text":"(-???-)Oi! Yer a guide, ain't ye? I need ye to do some guidin'."},{"name":"GEROLT","text":"Ye see, I'm lookin' for a game to stack them points up swift-like, but I don't fancy prancin' about or learnin' a bunch o' rules. I can swing a mean hammer, if that helps."},{"name":"Q4","text":"Which attraction do you recommend?"},{"name":"A4","text":"Might I suggest Crystal Tower Striker?"},{"name":"A4","text":"Might I suggest the Slice Is Right?"},{"name":"A4","text":"Might I suggest Triple Triad?"},{"name":"GEROLT","text":"Now that sounds custom-made for a master smith like me! Stand aside─it's time to loosen up the ol' swingin' arm!"},{"name":"SYSTEM","text":"Gerolt seems greatly enthused by your suggestion!"},{"name":"GEROLT","text":"An' ye reckon me smithin' skills'll see me through summat like that? I s'pose I'll give it a look..."},{"name":"SYSTEM","text":"Gerolt seems less than enthused by your suggestion..."},{"name":"THUBYRGEIM","text":"(-???-)Ah! How pleasant to find a familiar face! Are you also come to enjoy a respite from the world's demands?"},{"name":"THUBYRGEIM","text":"...The opposite, then. I was, in fact, in search of guidance...if you might indulge me."},{"name":"THUBYRGEIM","text":"(-???-)Excuse me, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>. I find myself in need of guidance..."},{"name":"THUBYRGEIM","text":"Which of these many attractions would you recommend for an arcanist? A game which challenges the mind would be most preferable."},{"name":"Q5","text":"Which attraction do you recommend?"},{"name":"A5","text":"Might I suggest Cuff-a-Cur?"},{"name":"A5","text":"Might I suggest Cliffhanger?"},{"name":"A5","text":"Might I suggest Doman mahjong?"},{"name":"THUBYRGEIM","text":"Yes, the need for a solid strategy appeals to me. And as a customs officer, I've become curious to learn more of Far Eastern traditions. An excellent idea!"},{"name":"SYSTEM","text":"Thubyrgeim seems greatly enthused by your suggestion!"},{"name":"THUBYRGEIM","text":"I imagine that would require me to exercise more body than mind...but, no, we mustn't neglect the physical in our quest for the cerebral."},{"name":"SYSTEM","text":"Thubyrgeim seems less than enthused by your suggestion..."},{"name":"COCOBUKI","text":"(-???-)Hm hm hm... Have you been lured by this abyss of amusement as well, <span class=\"highlight\">Forename</span>?"},{"name":"COCOBUKI","text":"Ah, a guide to souls lost in the madness. Commendable. I, myself, would welcome a nudge in the right direction..."},{"name":"COCOBUKI","text":"(-???-)Guide! I have need of your services."},{"name":"COCOBUKI","text":"I seek the diversion in which a voidsent creature─one summoned by the thaumaturgical arts of my own guild, no less─is featured most prominently. Know you of such an attraction?"},{"name":"Q6","text":"Which attraction do you mention?"},{"name":"A6","text":"That would be Any Way the Wind Blows, I believe."},{"name":"A6","text":"That would be Triple Triad, I believe."},{"name":"A6","text":"That would be Cuff-a-Cur, I believe."},{"name":"COCOBUKI","text":"So Typhon <span class=\"emphasis\">is</span> here. I must inspect the measures employed in his containment, and ensure there is no danger to the populace. If you will excuse me..."},{"name":"SYSTEM","text":"Cocobuki seems greatly appreciative of your answer!"},{"name":"COCOBUKI","text":"Hm? Is there perhaps another entity of the void here of whose existence I was unaware? I suppose it is possible..."},{"name":"SYSTEM","text":"Cocobuki seems less than convinced by your answer..."},{"name":"STAFF03964","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─you've given me the chance to attend to several other vital duties. Now, shall we review your performance?"},{"name":"STAFF03964","text":"Well, I'm happy to say that every guest seemed well satisfied by your recommendations! An admirable display of service! Has anyone spoken with you about becoming a full-time employee...?"},{"name":"STAFF03964","text":"Well, I'm afraid you stumbled with one or two of your recommendations. On the whole, however, you did rather well for a novice."},{"name":"STAFF03964","text":"Well, I must say that our guests did not seem overly pleased with your advice. I suggest you study our attractions again, and more carefully consider which guest might find which amusement the most appealing..."},{"name":"STAFF03964","text":"But putting such matters aside, we appreciate any effort made towards maintaining the Saucer's reputation for hospitality. Dismissed! Oh, and don't forget to return to Entrance Square and collect your wages from the chief attendant!"},{"name":"JACKE","text":"(-???-)Well, well, if it ain't the infamous <span class=\"highlight\">Forename</span>! Ye here for play, or is it other mischief ye've got in mind?"},{"name":"JACKE","text":"Honest work, is it!? Yer an odd cove, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, but that don't mean I won't take yer advice."},{"name":"JACKE","text":"(-???-)A fine <span class=\"alternative-container\"><span class=\"alternative\">evenin'</span><span class=\"alternative\">mornin'</span><span class=\"alternative\">day</span></span> to ye, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. If I could have a whid with ye real quick-like..."},{"name":"JACKE","text":"Tell me, which o' these games is most like to get a bloke's blood racin', then? Preferably somethin' what rewards nimble dew beaters an' a disregard for danger."},{"name":"Q7","text":"Which attraction do you recommend?"},{"name":"A7","text":"Might I suggest Cliffhanger?"},{"name":"A7","text":"Might I suggest the Moogle's Paw?"},{"name":"A7","text":"Might I suggest Any Way the Wind Blows?"},{"name":"JACKE","text":"Oho, dodgin' bombs, eh? Now that does sound like a lark! Thanks for the idea!"},{"name":"SYSTEM","text":"Jacke seems greatly enthused by your suggestion!"},{"name":"JACKE","text":"Hm... Might be as we've got different ideas o' what passes for excitement. Thanks all the same, though!"},{"name":"SYSTEM","text":"Jacke seems less than enthused by your suggestion..."},{"name":"SERENDIPITY","text":"(-???-)<span class=\"highlight\">Forename</span>, how lovely to see you!"},{"name":"SERENDIPITY","text":"...Working as a guide, you say? What a happy coincidence! I was actually feeling a bit lost..."},{"name":"SERENDIPITY","text":"(-???-)Excuse me! Sorry to bother, but I'm afraid I'm feeling a bit lost..."},{"name":"SERENDIPITY","text":"Could you point me in the direction of one of the less-intimidating attractions? Perhaps due to my occupation, I have a weakness for all things small and well made─and squealingly adorable, if I'm being honest."},{"name":"Q8","text":"Which attraction do you recommend?"},{"name":"A8","text":"Might I suggest Any Way the Wind Blows?"},{"name":"A8","text":"Might I suggest the Slice Is Right?"},{"name":"A8","text":"Might I suggest Lord of Verminion?"},{"name":"SERENDIPITY","text":"Armies of clockwork dolls!? All squeezed together in one tiny arena? Eeeeee!"},{"name":"SYSTEM","text":"Serendipity seems greatly enthused by your suggestion!"},{"name":"SERENDIPITY","text":"I...seem to have explained myself poorly. That promises to lead to a more terrified sort of squealing..."},{"name":"SYSTEM","text":"Serendipity seems less than enthused by your suggestion..."},{"name":"GEGERUJU","text":"(-???-)My dear adventurer! I would have thought you far too busy─and stiflingly straitlaced─to frequent a den of frivolity such as this!"},{"name":"GEGERUJU","text":"...Ah, well that explains it. Seeing as you've taken a position to serve, I see no reason not to call upon your services..."},{"name":"GEGERUJU","text":"(-???-)Oh, guiiide! You are in the enviable position of providing a service to the master of Costa del Sol!"},{"name":"GEGERUJU","text":"I am, shall we say, an “admirer” of beauty of the kitten-ish kind. Is there some simple amusement which might also indulge my discerning gaze? And let me be clear: I am a creature of comfort, entirely unsuited to exertion or exhaustion."},{"name":"Q9","text":"Which attraction do you recommend?"},{"name":"A9","text":"Might I suggest Triple Triad?"},{"name":"A9","text":"Might I suggest Leap of Faith?"},{"name":"A9","text":"Might I suggest the Moogle's Paw?"},{"name":"GEGERUJU","text":"Just a few button presses, you say!? And some lovely young bunnies lounging nearby into the bargain! While I'm more of a “cat-lover,” variety is, after all, the spice of life!"},{"name":"SYSTEM","text":"Gegeruju seems greatly enthused by your suggestion!"},{"name":"GEGERUJU","text":"That sounds terribly tiresome. Are you sure this will help me meet some pretty young thing? I shall...ugh...make an effort, then."},{"name":"SYSTEM","text":"Gegeruju seems less than enthused by your suggestion..."},{"name":"STAFF03964","text":"Thank you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>─I'll not ask you to sacrifice your entire <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>. Do allow me, however, a quick word to summarize your performance..."},{"name":"STAFF03964","text":"...Perfect! Simply perfect! Why, our guests might mistake you as one of our full-time employees!"},{"name":"STAFF03964","text":"...Adequate. Merely adequate. Although it seems one or two of our guests were somewhat leery of your recommendations, I cannot fault your enthusiasm."},{"name":"STAFF03964","text":"...Abysmal? Awful? I take no issue with your demeanor, but please, for the love of Master Manderville, do listen carefully when the guests are explaining their desires..."},{"name":"STAFF03964","text":"Evaluations aside, we stand by our promise to reward those who work to maintain the Saucer's reputation for hospitality. The chief attendant will pay your wages back at Entrance Square!"},{"name":"STAFFF","text":"Thank you for your continued efforts! Here is your payment, as promised."},{"name":"STAFFF","text":"Any further assistance you might provide during the campaign would be greatly appreciated!"}],"reward":{"items":[{"id":10131}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69499]}},"partials":[{"type":"npc","id":"1034482","obj":{"i":1034482,"n":"Chief Attendant","l":1484,"q":2}},{"type":"item","id":"10131","obj":{"i":10131,"n":"MGP Voucher","l":1,"c":26173,"t":61}},{"type":"quest","id":"69499","obj":{"i":69499,"n":"Caught Shorthanded","g":200,"l":"Ul'dah","s":196}}]}