{"quest":{"name":"A Sober Proposal","location":"Gangos","id":69505,"patch":5.35,"sort":150,"icon":101019,"unlocksFunction":1,"eventIcon":71341,"issuer":1034885,"target":1032879,"genre":76,"journal":["A stressed soldier seeks your counsel regarding the Resistance weapons.","As the soldier explains it, Gerolt and Zlatan are at a loss as to how they can further refine the Resistance weapons. The problem is exacerbated by Gerolt's refusal to speak his mind on possible solutions to their troubles. Considering your relationship, the soldier is hopeful you can spark new flames in the blacksmith's forge.","You speak with Gerolt, who confesses the inscriptions on the weapons are the source of his frustrations. It is not until Zlatan mentions a report from Gunnhildr's Blades about strange new crystals that Gerolt is suddenly struck with inspiration. Confident they are the key to strengthening the inscriptions of the Resistance weapons, Gerolt bids you and Zlatan to search out these crystallized memories."],"objectives":["Speak with Gerolt."],"dialogue":[{"name":"RESISTANCESOLDIER03969","text":"Beg pardon, Blade <span class=\"highlight\">Surname</span>. Might I speak with you for a moment? It concerns Master Gerolt and the Resistance weapons."},{"name":"RESISTANCESOLDIER03969","text":"I presume he has already explained the method by which Gunnhildr's Blades refined their weapons? That being combat with formidable enemies."},{"name":"RESISTANCESOLDIER03969","text":"Master Gerolt and Zlatan intended to employ similar methods to enhance the Resistance weapons, but...they have hit something of a stumbling block."},{"name":"RESISTANCESOLDIER03969","text":"To make matters worse, Master Gerolt, for reasons he refuses to explain, will offer no suggestions as to how they might proceed."},{"name":"RESISTANCESOLDIER03969","text":"Try as he might, Zlatan cannot convince him to expound on his thoughts, and quite frankly, we are at a loss."},{"name":"RESISTANCESOLDIER03969","text":"Might we prevail upon you to inquire after Master Gerolt?"},{"name":"ZLATAN","text":"Have you come to speak with Master Gerolt? Oh, thank heavens..."},{"name":"GEROLT","text":"...Oh, it's you. Now I know what yer thinkin', but don't you go believin' whatever nonsense they've been spoutin' about me work. Everything's goin' accordin' to plan."},{"name":"ZLATAN","text":"He told me much of the same, and I believed him too...at first. Yet he refuses to speak to me of this supposed work. Should I take my eyes off him for even a moment, a mug of ale will surely find its way to his hands."},{"name":"GEROLT","text":"That's bollocks an' you know it! Where would I even keep all o' this alleged ale, huh?"},{"name":"ZLATAN","text":"Behind the forge, <span class=\"emphasis\">in</span> the forge, buried beneath the palm tree next to your tent, the ammunitions depository. Anyone with a nose can tell when you've put back a few."},{"name":"GEROLT","text":"Hmph. Shows what you know. The ale in the ammunitions depository was shipped with the rest to the front line. Couldn't knock one back even if I wanted."},{"name":"GEROLT","text":"An' lest ye forget, I furnished an entire squad o' soldiers with them Resistance weapons. Don't ye think yer bein' just a wee bit demandin', breathin' down me neck for more bells an' whistles?"},{"name":"GEROLT","text":"Was trouble enough forgin' them in the first place. Without me muse, well..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Is there a problem?"},{"name":"A2","text":"Has the master blacksmith finally reached his limit?"},{"name":"GEROLT","text":"It's the inscriptions. Can't bloody figure out how to refine 'em. Not to mention, they're gettin' in the way of any other improvements I might be able to make."},{"name":"GEROLT","text":"Oi! You shut yer mouth! Ye ain't but scratched the surface o' me talents. Not my fault the inscriptions are provin' so bloody difficult to refine. On top of that, they're gettin' in the way of any other improvements I might be able to make."},{"name":"GEROLT","text":"Trouble is, they're what really give the weapons their teeth. Their design, the materials used to forge 'em, that's all mostly fer show."},{"name":"GEROLT","text":"If ye want yer weapon to have more kick, the magick o' the inscriptions needs to be more potent. But I don't even know where to begin."},{"name":"ZLATAN","text":"That is indeed a curious predicament. How did the Gunnhildr's Blades of eld accomplish this, I wonder. Any thoughts?"},{"name":"Q2","text":"What will you say?"},{"name":"A1","text":"Perhaps they used a crystal focus."},{"name":"A2","text":"Would that we could glimpse into the past and see for ourselves."},{"name":"GEROLT","text":"Ye mean those doodahs what the seers used?"},{"name":"GEROLT","text":"Speakin' o' the past, a couple o' soldiers came by askin' about how to extract the memories out o' crystals or some such."},{"name":"GEROLT","text":"By the sounds of it, the Bozjans used crystals for damn near everything what had to do with memory. Even keepin' memories o' their fightin' techniques."},{"name":"ZLATAN","text":"Ah, that reminds me. We recently received a most interesting report from Gunnhildr's Blades."},{"name":"ZLATAN","text":"Since taking the Resistance weapons into hand, they have come across peculiar new crystals on the field, quite unlike anything previously discovered."},{"name":"GEROLT","text":"That could be just what I'm lookin' for! There's no reason to believe they couldn't use those crystals on weapons, right?"},{"name":"GEROLT","text":"I'd wager me last flagon of ale the Bozjans could use them crystals an' their memories o' battle to strengthen the enchantments o' those inscriptions. Well, that's what I'm hopin'."},{"name":"ZLATAN","text":"While it may be too soon to jump to such conclusions, it certainly warrants investigation."},{"name":"GEROLT","text":"Exactly. And me hunches when it comes to weapon work ain't never wrong."},{"name":"GEROLT","text":"'Course we can't know for sure till we have a few to try for ourselves, eh?"},{"name":"GEROLT","text":"I'll see if I can't think of a way to work these memories into me plans. In the meantime, the two o' ye can go and find as many as ye can."},{"name":"SYSTEM","text":"A new Resistance weapons quest is now available from Zlatan."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69477]},"next":[69506]},"partials":[{"type":"npc","id":"1034885","obj":{"i":1034885,"n":"Stressed Soldier","l":3478,"q":1}},{"type":"npc","id":"1032879","obj":{"i":1032879,"n":"Gerolt","l":3478,"q":5}},{"type":"quest","id":"69477","obj":{"i":69477,"n":"Where Eagles Nest","g":76,"l":"Gangos","s":101,"f":1}},{"type":"quest","id":"69506","obj":{"i":69506,"n":"For Want of a Memory","g":76,"l":"Gangos","s":151,"r":1,"f":1}}]}