{"quest":{"name":"Art of Glass","location":"Ul'dah","id":69509,"patch":5.3,"sort":200,"icon":101016,"eventIcon":71221,"issuer":1034232,"target":1034232,"genre":202,"journal":["The centerpiece of this year's Rising festivities is a work of art courtesy of J'bhen Tia, who hopes to foster goodwill among the citizens of Ul'dah.<br>※This quest is available for a limited time only.","The Rising festival is known for bringing a splash of color to Ul'dah each year. On this occasion, a work of fine art in stained glass serves as the focal point, and its creator, J'bhen Tia is on hand to explain his inspiration. He has chosen to depict one of the pivotal moments in Ul'dahn history prior to the Calamity in which Nanamo Ul Namo addressed the rioting masses, imploring them to put aside their grievances and instead cooperate for the greater good. To accompany the artwork, a wandering minstrel of great renown is due to give a recital to commemorate the event, and J'bhen Tia would like you to help distribute flyers to drum up as large a crowd as possible.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","In the process of publicizing the Rising's special attractions, you meet several members of the Ul'dahn citizenry. While they come from various walks of life, they are all keen to savor the delights on offer, and agree to attend. You then make for the Sapphire Avenue Exchange, where you have arranged to meet J'bhen Tia.","You spot J'bhen Tia in the midst of the bustling market, though it appears that trouble is brewing. His friend Astin, a moneylender, is engaged in a heated argument with a local merchant, and it falls to J'bhen Tia to diffuse the situation. The artist explains that disputes such as these are precisely the reason why he chose the subject matter for his stained glass art, with Astin a prime example of one whose compassionate side is overshadowed by his obsession with turning a profit. The two of you agree to meet back at the Ruby Road Exchange to prepare to receive the attendees at the Rising celebrations.","Upon your return, you find J'bhen Tia decidedly crestfallen as a group of children look on sheepishly. Your new acquaintance is struggling to find the words to explain precisely what has happened, but it is clear he would benefit from your moral support."],"objectives":["Hand out flyers on the Steps of Thal. ","Speak with J'bhen Tia.","Speak with J'bhen Tia again at the Ruby Road Exchange."],"dialogue":[{"name":"ANV07GOLDSMITH","text":"Hullo there! Would I be correct in assuming you've come to view my exhibition?"},{"name":"ANV07GOLDSMITH","text":"You see, I'm an artist by trade and my chosen medium is stained glass. While it's not the easiest thing to work with, the results are worth the considerable effort required!"},{"name":"ANV07GOLDSMITH","text":"It's taken me a while to reach this point in my career, and this is actually my first public showing. I was wondering, if it's not too much of a bother, if I might give you a brief explanation of the subject matter."},{"name":"ANV07GOLDSMITH","text":"Ahem. Then pray, my good <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">fellow</span></span>, cast your eyes at yonder pane!"},{"name":"ANV07GOLDSMITH","text":"'Twas the final days before the fall of Dalamud, its inexorable approach foretelling our impending doom. Panic spread like wildfire, while many in their desperation turned on the sultanate. Looting and rioting broke out across Ul'dah."},{"name":"ANV07GOLDSMITH","text":"To quell the masses, Her Royal Majesty Nanamo Ul Namo took to the streets with a guard consisting of only seven subjects, for they alone had the courage to stand with their sultana. There, she addressed the rabble."},{"name":"ANV07GOLDSMITH","text":"\"Heed me, my beloved citizens! The realm lies upon the brink of the Seventh Umbral Era. Yet so long as we live, we must not forget our compassion. Now is not the time to take from your neighbor, but to proffer him the hand of succor.“"},{"name":"ANV07GOLDSMITH","text":"She was determined not to let the city that the Immortal Flames were risking their lives to defend tear itself apart in their absence. Her words brought the people to their senses."},{"name":"ANV07GOLDSMITH","text":"They laid down their arms and set about healing the wounds they themselves had inflicted on Ul'dah. Thanks to Her Grace's impassioned speech, those who returned from the battlefield found their home much as they had left it: a gleaming jewel in the desert."},{"name":"ANV07GOLDSMITH","text":"&lt;sigh&gt; It all seems so long ago. To see the place today, you'd think that the people had entirely forgotten her words that day. The same hands that were once proffered in succor now grasp greedily at every last coin, even if it means one's fellow man must go hungry..."},{"name":"ANV07GOLDSMITH","text":"It's times like these that we must remind ourselves of the sacrifices of those who came before us, which is why the Rising festival is of such profound importance. I draw inspiration from Her Grace's deeds all those years ago, and through my work, perhaps others might do the same."},{"name":"ANV07GOLDSMITH","text":"Dear me, I'd better stop before I'm overcome with emotion! There are in fact, matters to which I must yet attend, and if I'm not mistaken, you are an adventurer, yes? I've something you might be able to help me with, if you're willing."},{"name":"ANV07GOLDSMITH","text":"In addition to having my stained glass on display, it's been arranged that a wandering minstrel will give a recital as part of the festivities. I'm looking to gather as many spectators as possible, but I fear I'll struggle to cover the necessary ground by myself. Perhaps you could give me a hand?"},{"name":"ANV07GOLDSMITH","text":"Twelve bless you, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>! I plan to hand out these flyers, and with two of us, we'll be able to reach twice the number of people in the same span of time."},{"name":"ANV07GOLDSMITH","text":"If you'd be so kind as to look for potential attendees around the Steps of Thal, I'll head for the Sapphire Avenue Exchange. Let's meet there when you're done."},{"name":"RESIDENTSA03973","text":"May I help you?"},{"name":"RESIDENTSA03973","text":"Stained glass? Depicting the sultana herself, no less. I've always been a loyal supporter of hers, and it would remiss of me to pass up such an opportunity. I shall be sure to attend."},{"name":"RESIDENTSB03973","text":"Got somethin' you want diggin' up?"},{"name":"RESIDENTSB03973","text":"Hmm... Can't say I'm much of an expert when it comes to music and fine art, but it ain't often a bloke like me gets a chance to sample the high life. I'd be a fool to miss it!"},{"name":"RESIDENTSC03973","text":"Yes?"},{"name":"RESIDENTSC03973","text":"Hmm... That does sound rather intriguing. If it's the same minstrel my associates have mentioned on occasion, I had best go and see what all the fuss is about. I hear he's rather talented."},{"name":"ANV07GOLDSMITH","text":"I've still got one or two more flyers left, and so have you by the looks of it. Let's reconvene once they've all been distributed."},{"name":"ASTIN","text":"If I didn't know better, I'd think you were trying to avoid me..."},{"name":"ANV07RESIDENTS04","text":"Of all the rotten luck..."},{"name":"ANV07GOLDSMITH","text":"All done? Much appreciated, but I'm afraid I've run into a bit of a problem..."},{"name":"ANV07GOLDSMITH","text":"I was in the process of a handing a flyer to this gentleman, when my friend Astin showed up out of the blue. As chance would have it, these two chaps are previously acquainted, though they do not appear to be on particularly good terms..."},{"name":"ANV07RESIDENTS04","text":"But how am I supposed to pay you back if the amount keeps going up!?"},{"name":"ASTIN","text":"If you'd coughed up the money on the day we'd originally agreed, there wouldn't be so much interest to pay. You've only got yourself to blame."},{"name":"ANV07GOLDSMITH","text":"But Astin, if your interest rates weren't so high, perhaps he'd have been able to pay you back by now. I'm not saying you should wipe the slate clean, but surely you can come to a compromise?"},{"name":"ASTIN","text":"All I want is for him to honor our agreement. What's wrong with that? Besides, I've held up my side of the bargain, so why do I have to be the one to compromise?"},{"name":"ASTIN","text":"&lt;sigh&gt; But let's say I give you the benefit of the doubt, that you genuinely lack the means to pay me back. I'll grant you one week's extension, but if you still don't have the money by then, there'll be consequences."},{"name":"ANV07RESIDENTS04","text":"Only a week? All right, you damned vulture, you'll get your gil. Then I'll be rid of you for good."},{"name":"ANV07GOLDSMITH","text":"I'm sad to say that such incidents are part of everyday life in Ul'dah."},{"name":"ANV07GOLDSMITH","text":"Someone in financial difficulty sees a moneylender as the answer to their woes, like an oasis in the desert. But it's only a mirage, an illusion of salvation, leading them into even greater debt."},{"name":"ANV07GOLDSMITH","text":"Then again, many debtors will borrow money without any intention of paying it back, relying on an endless stream of short-term solutions. &lt;sigh&gt; I hope that those who look upon my art will remember the words of the sultana, and seek to help rather than exploit one another."},{"name":"ANV07GOLDSMITH","text":"Those two chaps you saw arguing just now would benefit from it, I'm sure. You know, Astin wasn't always like that. He's picked me up when I was down more times than I can count."},{"name":"ANV07GOLDSMITH","text":"We both grew up on the streets of Ul'dah with no one to turn to but each other. The only reason I'm even here today─making a living as an artist, of all things─is because of Astin and his talent for business. With a few words and a couple of handshakes, he could turn a gil into a gold mine."},{"name":"ANV07GOLDSMITH","text":"But as the years passed, it became an obsession. No matter how much coin he made, it was never enough. I wish he'd realize there's more to life than personal gain, but nothing I say gets through to him."},{"name":"ANV07GOLDSMITH","text":"That's part of the reason why I turned to stained glass art in the first place. It can express my inner thoughts far better than words ever could. Well, <span class=\"emphasis\">my</span> words, at any rate."},{"name":"ANV07GOLDSMITH","text":"Oh goodness, I do apologize! You must think I'm an awful bore to rope you into helping only to bombard you with complaints and sob stories. But enough of that─it's high time I returned to the exhibition and prepared for the arrival of the minstrel."},{"name":"ANV07GOLDSMITH","text":"Ah, there you are. I hate to say this, but we've run into a slight problem. And by “slight problem,” I actually mean “rather a huge catastrophe.”"},{"name":"ANV07GOLDSMITH","text":"So huge, in fact, I need a moment to compose myself. While I'm loath to impose on you any further, I've a feeling I may need your help again, or at least some moral support..."},{"name":"ANV07RESIDENTS05","text":"If we'd known this would happen, we would never have gone near it!"}],"reward":{"gil":289},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[69510]},"partials":[{"type":"npc","id":"1034232","obj":{"i":1034232,"n":"J'bhen Tia","l":40,"q":2}},{"type":"quest","id":"69510","obj":{"i":69510,"n":"Glass from the Past","g":202,"l":"Ul'dah","s":201}}]}