{"quest":{"name":"Glass from the Past","location":"Ul'dah","id":69510,"patch":5.3,"sort":201,"icon":101017,"eventIcon":71221,"issuer":1034232,"target":1034452,"genre":202,"journal":["J'bhen Tia's heart is not the only thing that is broken.<br>※This quest is available for a limited time only.","In J'bhen Tia's absence, the stained glass that he had so painstakingly created has been accidentally shattered by a group of children who got a little too close to the exhibit. With the opening of the Rising festivities fast approaching, the only viable option is to piece together the artwork as best you can before the spectators arrive.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","With your gift for solving puzzles, the stained glass art is restored to more or less its original state. Once J'bhen Tia has glued the reassembled shards into the frame, his work will be ready to be put on display once more.","J'bhen Tia is ecstatic that the exhibition is able to go ahead despite the catastrophe that had befallen his artwork. With the event due to start, he asks if you might persuade his childhood friend Astin to attend. Their relationship has been somewhat troubled of late, and J'Bhen feels that the invitation would be better received if delivered by a third party, namely, you.","It soon becomes apparent that Astin was fully aware of the exhibition, but he had decided not to attend. Since he is an infamous moneylender, he was concerned that J'bhen Tia's reputation would suffer if their association became public knowledge. Nonetheless, he is prepared to consider the invitation, though it is still unclear whether he will actually make an appearance.","The art exhibition and accompanying song courtesy of the wandering minstrel are met with resounding applause, and many in the crowd were deeply moved by the message of goodwill towards one's fellow man. Astin, who had made up his mind to attend after all, found the tale of the Sultana's Seven particularly relevant to his current situation. He chooses to give up the life of a moneylender in order to return to working as an art dealer, and he offers to find buyers for J'bhen Tia's stained glass. The young virtuoso is overjoyed that Astin has turned over a new leaf and offers you his heartfelt thanks in not only rescuing the exhibition, but also their friendship. He then mentions that the wandering minstrel is looking for you, though you will need to speak with him yourself to find out why.","The wandering minstrel expresses his appreciation for your part in this year's Rising festival, and offers a song by way of reward. You are then swept away on the waves of a divine melody to another realm entirely, free from the bounds of time and space. You are met by the enigmatic Naoki Yoshida and his Lalafellin companions, who appear to have been expecting you. Though his words are somewhat cryptic, his sincerity is unmistakable. You are eventually returned to the present day, whereupon the minstrel welcomes you back from your waking dream. He performs one last song, while the fireworks above fill the night sky."],"objectives":["Speak with J'bhen Tia and put the stained glass art back together.","Speak with J'bhen Tia again.","Hand the flyer to Astin.","Speak with J'bhen Tia.","Speak with the wandering minstrel."],"dialogue":[{"name":"ANV07GOLDSMITH","text":"All right, enough panicking, it's time for decisive action!"},{"name":"ANV07GOLDSMITH","text":"While we were out distributing flyers, these children were a little overzealous when it came to admiring my artwork. It seems they were unaware of the “look but don't touch” rule that normally applies to these things, and...well, it fell on the floor and shattered."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"This calls for six of the best. No...their punishment must be more severe."},{"name":"A2","text":"I suggest staging a play based on the same scene. I'll be Nanamo."},{"name":"ANV07GOLDSMITH","text":"Not the first thought that crossed my mind, I must admit. The recital is due to begin any moment now, so the only viable option is to repair the smashed pane as best we can."},{"name":"ANV07GOLDSMITH","text":"I think that with a little adhesive here and there, the spectators will hardly notice the cracks."},{"name":"ANV07GOLDSMITH","text":"Unfortunately, I don't have any to hand at present. While I run off to fetch some bonding agent from the Alchemists' Guild, perhaps you could try piecing the broken glass back together? Don't worry, I'll show you how it's done."},{"name":"ANV07RESIDENTS05","text":"If we'd known this would happen, we would never have gone near it!"},{"name":"ANV07GOLDSMITH","text":"Are you ready to begin?"},{"name":"SYSTEM","text":"The following controls can be used to repair the stained glass (default settings):"},{"name":"SYSTEM","text":"<span class=\"alternative-container\"><span class=\"alternative\">move cursor left: Move Left<br>move cursor right: Move Right<br>: Select Piece, Place Piece<br>: Cancel Selection</span><span class=\"alternative\">[???]: Move Left<br>[???]: Move Right<br>[???]: Select Piece, Place Piece<br>[???]: Cancel Selection</span></span>"},{"name":"ANV07GOLDSMITH","text":"Oh? Mayhap you have a more pressing engagement? In all honesty, I can't imagine anything more urgent than this, but I shall wait until you are able to lend a hand."},{"name":"ANV07GOLDSMITH","text":"Yes, that's perfect! With a few dabs of adhesive, it'll be as good as new. Well, almost. It should certainly suffice for the time being, though!"},{"name":"ANV07GOLDSMITH","text":"All's well that ends well, yes? The children were beside themselves with worry, but now, they're as delighted as I am!"},{"name":"ANV07GOLDSMITH","text":"...Hm? Oh, just a moment of nostalgia. I know from firsthand experience that moment of horror that comes when breaking an expensive piece of glass."},{"name":"ANV07GOLDSMITH","text":"A few years ago, I was helping Astin with one of his ventures as an art dealer. I was in desperate need of gil so he hired me to transport a few pieces. That was when I dropped a case containing some valuable stained glass, and...I'll never forget the awful sound it made."},{"name":"ANV07GOLDSMITH","text":"But rather than curse me for my clumsiness or fret over the money it had cost him, his only concern was whether I'd cut myself on any of the shards."},{"name":"ANV07GOLDSMITH","text":"So you see, that's why I don't blame the children for their little misadventure. I suppose I'm following Astin's example."},{"name":"ANV07GOLDSMITH","text":"Hmm... Actually, there's one more favor I'd like to ask of you."},{"name":"ANV07GOLDSMITH","text":"I think if Astin were to see my stained glass, it might remind him of the days when there were things more important to him than money."},{"name":"ANV07GOLDSMITH","text":"Of course, I've tried various approaches in the past, and most of what I say to him goes in one ear and out the other. But if it were to come from someone else, such as your good self, he might be more inclined to listen. Would you mind having a word with him?"},{"name":"ANV07GOLDSMITH","text":"You're too kind! Perhaps you could start by handing him this flyer and going from there."},{"name":"ANV07GOLDSMITH","text":"I expect he's in the Quicksand, where he carries out much of his business. His clients tend to be a bit more malleable when they're in their cups, it seems. Anyway, if you could rouse his interest in the festivities, we'll leave the rest to him."},{"name":"ANV07GOLDSMITH","text":"I'm sad to say, Astin's behavior has become rather easy to predict of late. Since his every waking moment is devoted to making others' coin his own, it's not hard to guess where he'll be at any given moment. If he isn't in the tavern, he's most likely at the market."},{"name":"ASTIN","text":"I remember you. Bhen's assistant, yes? Or maybe he's yours... Either way, I appreciate you looking out for him. He needs all the help he can get."},{"name":"ASTIN","text":"Though I must say, if you've something that requires my attention, I'd rather you kept it brief."},{"name":"ASTIN","text":"Yes, I know all about Bhen's exhibit, thank you. Keeping my ear to the ground as I do, there's little that goes on in Ul'dah that escapes my notice. So why did he send you to advertise it to me?"},{"name":"ASTIN","text":"He wants to remind me of the good old days? I might've guessed it would be something as soppy as that. A lot's changed since then, but he's still the same daft sod he's always been."},{"name":"ASTIN","text":"Not that it's necessarily a bad thing, mind you. It's his sentimental side that allows him to create such...evocative works of art."},{"name":"ASTIN","text":"But I always felt that if he tried to make a living out of it, he'd lose the very essence of what makes his pieces so special in the first place. Rather than expressing himself, he'd have to pander to the tastes of wealthy but fickle clients to turn a profit."},{"name":"ASTIN","text":"That's why I wanted to earn enough for the both of us, so he'd be free to pursue his dreams. While he doesn't need me to pay for his bed and board anymore, I'm still around to help him if he falls on hard times."},{"name":"ASTIN","text":"And just to make it perfectly clear, it's not that I don't want to attend the exhibition. I decided not to go because if people were to think that Bhen is associated with a moneylender like me, it would ruin his good reputation."},{"name":"ASTIN","text":"But if he insists that I go, perhaps I can make an appearance without drawing too much attention. Tell him I'll think about it, would you?"},{"name":"ASTIN","text":"Just so you know, “I'll think about it” does not mean the same as “yes.” I will give it due consideration, though."},{"name":"ANV07GOLDSMITH","text":"So, what did he say?"},{"name":"ANV07GOLDSMITH","text":"Hmm... I'll just have to wait and see."},{"name":"ANV07GOLDSMITH","text":"Whatever the outcome, I'm very grateful for all you've done. And I'm sure you'll be pleased to hear I've saved you the perfect spot from which to view the event!"},{"name":"WANDERINGMINSTREL","text":"Citizens of Ul'dah! By my words be transported to the days before the Calamity, a time when all hope seemed lost. As the lesser moon hung low in the sky, a wave of terror washed over this fair city, turning neighbor against neighbor, brother against brother."},{"name":"WANDERINGMINSTREL","text":"There, in the midst of chaos, she stood defiantly. And so our tale begins. Hearken now to “The Sultana's Seven”..."},{"name":"ANV07GOLDSMITH","text":"Astonishing! I could see the events of that fateful day in my mind's eye as vividly as I see you now! Such a profoundly moving performance would surely have touched the hearts of everyone in attendance."},{"name":"ANV07GOLDSMITH","text":"Astin! You came after all!"},{"name":"ASTIN","text":"An artist you may be, but subtle you are not."},{"name":"ASTIN","text":"\"Now is not the time to take from your neighbor, but to proffer him the hand of succor.“"},{"name":"ASTIN","text":"A message to all of Ul'dah, I'm sure, but also one meant specifically for me. I have to admit, the sultana made a good point, and it still stands to this day. Maybe it's time I thought about earning an honest living..."},{"name":"ANV07GOLDSMITH","text":"I knew you'd come around sooner or later!"},{"name":"ANV07GOLDSMITH","text":"And Astin, I can take care of myself now, so you needn't go to such lengths to support me. "},{"name":"ASTIN","text":"I'm glad to hear it, but let's get one thing straight: I didn't become a moneylender just to cover your expenses while you carved out a career as an artist."},{"name":"ASTIN","text":"I just didn't want you to compromise your ideals and the quality of your work for the sake of keeping a roof over your head. Now you can concentrate on doing what you do best: bringing joy to people through your art."},{"name":"ASTIN","text":"As for me, I should find a better use for my skills. Perhaps I could go back to being an art dealer. That way, you can create whatever works you please while I seek out potential buyers. It certainly beats making commissioned pieces for some pretentious buffoon."},{"name":"ANV07GOLDSMITH","text":"You're suggesting we go into business together?"},{"name":"ASTIN","text":"Yes, unless you have any objections to working with a very recently reformed moneylender?"},{"name":"ANV07GOLDSMITH","text":"Of course not! And I know just where to start: producing more panes featuring the sultana and her seven trusty followers!"},{"name":"ANV07GOLDSMITH","text":"Imagine the streets of Ul'dah lined with stained glass depicting its illustrious history. The sparkling jewel of the desert will shine brighter than ever!"},{"name":"ANV07GOLDSMITH","text":"This is more than I could've dreamed of. Of course, none of this would've been possible without your kindness, <span class=\"highlight\">Forename</span>. You probably hear effusive words of praise quite often in your line of work, but I sincerely mean it: thank you for all you've done."},{"name":"ANV07GOLDSMITH","text":"Oh, and there was one other thing I meant to tell you. The wandering minstrel was, ah...wondering if he could have a word with you."},{"name":"ANV07GOLDSMITH","text":"In fact, he has a present of sorts to give you. He should be somewhere nearby. Best of luck finding him!"},{"name":"ANV07GOLDSMITH","text":"Having trouble tracking down the minstrel? Perhaps his wandering has already taken him to pastures new?"},{"name":"ASTIN","text":"Thanks to you and Bhen, I'm ready to turn over a new leaf. Once my debtors have given back what they owe, that is. And if they catch me while I'm still in a charitable mood, I might even be prepared to overlook the interest."},{"name":"WANDERINGMINSTREL","text":"Ah, you are come, as I knew you would. J'bhen Tia speaks very highly of not only your skill at piecing together broken glass, but of your loyalty and compassion. Your virtues are many and varied indeed."},{"name":"WANDERINGMINSTREL","text":"Were it not for your contribution, the festival would have been without its centerpiece. My accompaniment of song was naught but a garnish to the fine dish that was our mutual friend's glorious work of art. Perhaps you will allow me to express my gratitude with another piece I have composed?"},{"name":"YOSHIDANAOKI","text":"(-???-)Welcome, Warrior of Light. Or should I call you Warrior of Darkness? You needn't be alarmed by these strange surroundings."},{"name":"YOSHIDANAOKI","text":"(-???-)Greetings, Warrior of Light. You needn't be alarmed."},{"name":"YOSHIDANAOKI","text":"(-???-)This is a world that exists outside your reality. Could it be a dream? A flight of fancy conjured by your weary mind? Perhaps...or perhaps not."},{"name":"YOSHIDANAOKI","text":"Allow me to introduce myself. I am Naoki Yoshida. It gives me great pleasure to finally meet you, brave soul who has chosen a life of adventure."},{"name":"YOSHIDANAOKI","text":"It is an honor to be reunited with you in this world between worlds. I have been following your adventures with great interest."},{"name":"YOSHIDANAOKI","text":"Your travels have taken you to lands far and wide, and you have encountered people of all walks of life, each with their own ideals, hopes, and dreams."},{"name":"YOSHIDANAOKI","text":"As time flows onward in a never-ending spiral, the course of history is guided by mortal hands. Though our existence be brief, our deeds echo for eternity."},{"name":"YOSHIDANAOKI","text":"Seven years have passed since the lesser moon descended. Seven years since mankind rose from the ashes. 'Twas a spectacle none shall ever forget, and that they live to tell the tale is cause for both celebration and reflection."},{"name":"YOSHIDANAOKI","text":"When we cast our minds back, it is not sorrow that fills our hearts, but joy. For we have been afforded a second chance, that we may learn from the lessons of the past."},{"name":"YOSHIDANAOKI","text":"As we set forth towards new horizons, those with a thirst for adventure will lead the way. While there may be hardships and strife on the road ahead, there is no obstacle that we cannot overcome if we believe in ourselves...and each other."},{"name":"YOSHIDANAOKI","text":"Countless kindred spirits share our journey, and it is through mutual respect and understanding that we may create a better world."},{"name":"YOSHIDANAOKI","text":"The future is what we make it, by our words and deeds, and we will forever be at your side, brave adventurer. You have our undying gratitude, now and always."},{"name":"YOSHIDANAOKI","text":"...The time has come for this vision to end; time for your eyes to open from this waking dream."},{"name":"YOSHIDANAOKI","text":"Ever will we be watching over you. Guide the realm unto peace and happiness, Warrior of Light and Darkness both. Till next we meet..."},{"name":"YOSHIDANAOKI","text":"Ever will we be watching over you and your deeds. Guide the realm unto peace and happiness, Warrior of Light..."},{"name":"WANDERINGMINSTREL","text":"And lo, you are returned. Pray tell, are you left with pleasant memories, fleeting though they may be?"},{"name":"WANDERINGMINSTREL","text":"That is well, for such visions are wont to fade all too quickly, as the morning dew in the light of the rising sun. Mayhap another of my verses would make a suitable gift ere we part?"},{"name":"WANDERINGMINSTREL","text":"In the wake of calamity, Light descends once more,<br>To illuminate a world reborn, risen from fires of war.♪<br>'Neath the eyes of heaven, deception crumbles to dust,<br>Those divided by malice, united by bonds of trust.♪"},{"name":"WANDERINGMINSTREL","text":"On fields awash in crimson, battle raged far and wide,<br>In the name of liberty, the courageous few turn the tide.♪<br>Unto a distant realm, drowned in radiance unrelenting,<br>Strides forth the harbinger of night, iron will unbending.♪"},{"name":"WANDERINGMINSTREL","text":"...For the sake of their loved ones, there are those who take to the battlefield. And yet, those who remain behind have their roles to play. Protectors and the protected, providers and the provided for. Principles upon which every nation is built."},{"name":"WANDERINGMINSTREL","text":"It is the duty of those who rule to ensure that these elements are kept in balance, even if they must face great peril. The words of the sultana ring as true in the here and now as they did on that fateful day. May each of us take them to heart as we face the new dawn as one."},{"name":"SYSTEM","text":"You have unlocked the jigsaw puzzle mini-game."},{"name":"SYSTEM","text":"Open the toy chest in any inn room to try this activity."}],"reward":{"items":[{"id":30869},{"id":30883}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69509]}},"partials":[{"type":"npc","id":"1034232","obj":{"i":1034232,"n":"J'bhen Tia","l":40,"q":2}},{"type":"npc","id":"1034452","obj":{"i":1034452,"n":"Wandering Minstrel","l":40,"q":1}},{"type":"item","id":"30869","obj":{"i":30869,"n":"Wind-up Ardbert","l":1,"c":59782,"t":81}},{"type":"item","id":"30883","obj":{"i":30883,"n":"The Sultana's Seven","l":1,"c":51441,"t":79,"p":3500}},{"type":"quest","id":"69509","obj":{"i":69509,"n":"Art of Glass","g":202,"l":"Ul'dah","s":200}}]}