{"quest":{"name":"Blood of Emerald","location":"The Lochs","id":69516,"patch":5.4,"sort":30,"icon":101033,"unlocksFunction":1,"eventIcon":71341,"issuer":1032586,"target":1032586,"genre":25,"journal":["Cid's investigation in Terncliff has led to startling revelations.","Returning to the camp at Porta Praetoria, the Resistance officer informs you that your presence is required in Terncliff. As always, your escort stands ready to accompany you on the journey.","Terncliff is much the same as you remember from your previous visit, and while the imperial troops may be long gone, their enormous steel structures still mar the otherwise pleasant surroundings. Gaius and his associates have been made to wait for your arrival, as Cid would prefer to reveal his findings only when all of the relevant persons are present.","The investigation into the imperial facility in Terncliff has led to the discovery of the name of the VIIth Legion's third Weapon: Emerald. However, none of the locals have sighted anything resembling a large warmachina being moved from the town either by land or air. Though you cannot be certain, it seems likely that the Weapon was transported by sea, possibly to Castrum Marinum or Castrum Occidens in order to complete its construction. You and Gaius elect to investigate the former while Severa and Valdeaulin head for the latter. A member of the Ironworks has been ordered to prepare a submersible in Vesper Bay that you may make your approach.","It appears that Gaius possesses a means of breaching the security system of Castrum Marinum and entering via the dry dock. Once you arrive, however, there is a fairly high chance that you will be greeted by the enigmatic Emerald Weapon, so you had best be prepared for the worst.<br><br>※Castrum Marinum can be accessed via the Duty Finder.","The confrontation with the Emerald Weapon called on every last onze of mettle you could muster, and once the dust had settled, it was you that emerged the victor. Overlooking the wreckage is Gaius, who mourns the loss of its pilot Rex, one of the orphans he raised.","Following the battle, you are joined by Valdeaulin and Severa, whose mission to Castrum Occidens yielded little of value. After arriving in Castrum Marinum, they found Allie, another of Gaius's orphans, locked in a cell and decided to free her. She is filled with horror by the spectacle of the destroyed Emerald Weapon and descends into a state of shock. It seems the best recourse is to take her to Terncliff and allow her time to recover from the ordeal.","According to Severa, Allie's body is covered in welts and bruises that were most likely inflicted by the imperials under whom she served. Severa knows from personal experience the cruel treatment of those who are not pure-blooded Garleans, and she relates her tale of how she came to defect from the imperial army. Meanwhile, Allie continues to recuperate, and she may now be well enough to speak of what has befallen her and the other orphans, though it would be prudent to first discuss her current condition with Valdeaulin.","Allie has made great strides in recovering both physically and mentally, and is able to provide useful information on the present state of affairs and on Valens van Varro, legatus of the VIIth Legion. As she explains it, Valens is both jealous and cruel, and is willing to use any means at his disposal to achieve his goals, no matter how vile they may be. She also tells of Alfonse's dream of using the power granted to him by the Weapon project to break free from the Empire and establish a safe haven for those who wish to live in peace. Unfortunately, she is unable to say where he is, meaning that you will need to enlist the aid of the Alliance's scouts in locating him. With no immediate danger on the horizon, now seems an opportune time to return to the Resistance troops in Gyr Abania and report the latest series of events.","Your report is gratefully received by the Resistance officer in charge at Porta Praetoria. He will prepare a written copy of the information that has been gathered, should you wish to review it before being called into action once more."],"objectives":["Speak with the Resistance escort.","Speak with Gaius in Terncliff.","Speak with the Ironworks pilot in Vesper Bay.","Confront the Emerald Weapon in Castrum Marinum.","Speak with Gaius.","Speak with Gaius again.","Speak with Valdeaulin.","Speak with the Resistance officer at Porta Praetoria."],"dialogue":[{"name":"RESISTANCEOFFICER","text":"Ah, it's good to see you, <span class=\"highlight\">Forename</span>."},{"name":"RESISTANCEOFFICER","text":"I'm pleased to report that Master Garlond and the others uncovered a fair bit of useful information at the imperial facility in Terncliff."},{"name":"RESISTANCEOFFICER","text":"In fact, he'd like you to rendezvous with Gaius in the town square, where he'll reveal what they've found. Once you're ready to depart, your escort will lead the way."},{"name":"CONVEYOR03783","text":"All set for the journey ahead?"},{"name":"Q2","text":"Travel to Terncliff?"},{"name":"SHADOWHUNTER","text":"Now that you are here, perhaps Cid will finally deign to dispense his findings."},{"name":"SHADOWHUNTER","text":"Severa, inform him of <span class=\"highlight\">Forename</span>'s arrival."},{"name":"CID","text":"Thanks for coming."},{"name":"SHADOWHUNTER","text":"So, what have you discovered?"},{"name":"CID","text":"To tell the truth, we were lucky to obtain any information at all, considering the lengths to which the imperials went in covering their tracks. You see, the hangar below was not just used to store the Weapons, but played a critical role in their creation."},{"name":"CID","text":"We now know the code names given to three of the Weapons. Ruby, Sapphire...and Emerald."},{"name":"SEVERA","text":"Obviously, we are all familiar with the first two, but the third is something of an unknown quantity."},{"name":"VALDEAULIN","text":"At the very least, this confirms the existence of another of those abominations."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"At the very least?"},{"name":"A1","text":"What are we waiting for? Let's go after it!"},{"name":"SHADOWHUNTER","text":"The problem lies in ascertaining its whereabouts. None of the locals have seen anything resembling a Weapon being transported either by land or air."},{"name":"CID","text":"Which of course leaves only one option: the sea. According to what fragmented data we were able to recover, the Emerald Weapon is equipped with aquatic capabilities, much like the Sapphire."},{"name":"SHADOWHUNTER","text":"Meaning that its escape from Terncliff would have gone undetected, and could potentially be anywhere by now. But if Alfonse plans to have it absorb more primals..."},{"name":"SHADOWHUNTER","text":"...the logical choice would be Eorzea."},{"name":"SEVERA","text":"And traveling by sea would allow him to circumvent the front line at Ghimlyt entirely! The Alliance must be alerted at once!"},{"name":"CID","text":"Hold your chocobos, Severa. It seems that the Emerald Weapon was still incomplete when the VIIth Legion withdrew from Terncliff."},{"name":"CID","text":"It's far more likely that it was transported to another facility in order to add the finishing touches."},{"name":"SHADOWHUNTER","text":"If your supposition is correct, that would narrow our search to but two possible locations: Castrum Marinum in the Rhotano Sea and Castrum Occidens in eastern La Noscea."},{"name":"VALDEAULIN","text":"Both of which are known to harbor remnants of the XIVth Legion...your former subordinates, Gaius."},{"name":"SHADOWHUNTER","text":"Be that as it may, our objective is unchanged. Valdeaulin, you and Severa will make your way to Castrum Occidens while <span class=\"highlight\">Forename</span> and I head for Castrum Marinum."},{"name":"SEVERA","text":"Should we locate the Emerald Weapon, we will give the signal to dispatch the G-Warrior and eliminate it before it can be activated."},{"name":"CID","text":"Sorry to disappoint you, but we're still repairing the damage it sustained during the encounter with the Sapphire Weapon. While Allagan machinery has its uses, it's a bugger to find replacement parts in a pinch..."},{"name":"CID","text":"We've actually been working to expand its already impressive arsenal, but the G-Warrior itself is in no fit state for combat."},{"name":"CID","text":"While I'm aware this is a far from adequate replacement, I can provide an Ironworks submersible to help <span class=\"highlight\">Forename</span> and Gaius reach Castrum Marinum. I'll have one sent ahead to Vesper Bay."},{"name":"VALDEAULIN","text":"A submersible, eh? I don't much like the sound of that. Perhaps Severa and I should count ourselves fortunate that our destination can be approached by land. I pray you have a safe journey. Watch yourself out there, <span class=\"highlight\">Forename</span>..."},{"name":"SHADOWHUNTER","text":"It is time we departed. Let us make our way to Vesper Bay."},{"name":"SEVERA","text":"It seems that Cid is not in the habit of saying the same thing twice, which must be why he has been waiting for you to arrive before revealing the results of his investigation."},{"name":"VALDEAULIN","text":"Though the imperials may be gone, the scars they have left on this once-peaceful town will doubtless take many years to heal."},{"name":"RESISTANCEOFFICER","text":"I wouldn't mind going with you to Terncliff, but I've got to stay here to keep an eye on this horrible lot!"},{"name":"CONVEYOR03783","text":"All set for the journey ahead?"},{"name":"Q2","text":"Travel to Terncliff?"},{"name":"GSPILOT03980","text":"As per Master Garlond's instructions, the submersible is ready when you are!"},{"name":"GSPILOT03980","text":"But before you depart, I've received some scraps of intelligence regarding your opponent from my colleagues in Terncliff."},{"name":"GSPILOT03980","text":"Apparently, it uses some sort of levitating...handlike appendages─six of them, in fact─though we're not quite sure what purpose they serve. It sounds like having eyes in the back of your head might come in handy. But that's all we know, I'm afraid."},{"name":"SHADOWHUNTER","text":"You have our thanks. After all, forewarned is forearmed. If the Emerald Weapon has indeed been transported to this castrum, it would need to enter via the dry dock. We shall do likewise."},{"name":"SHADOWHUNTER","text":"As one might expect, there are measures in place to keep out intruders, but the security systems can be tricked into recognizing us as an imperial vessel."},{"name":"SHADOWHUNTER","text":"That said, infiltrating the facility is merely the first step..."},{"name":"SHADOWHUNTER","text":"Should the Emerald Weapon be activated, it is only a matter of time before the pilot uses Oversoul."},{"name":"SHADOWHUNTER","text":"We must silence the warmachina before this happens, and failing that, grant the poor soul at its helm the mercy of a swift death."},{"name":"SHADOWHUNTER","text":"Had these wounds healed more quickly, I could have gone with you, but I fear I would only slow you down. As such, I shall provide what support I can from afar. Whatever happens, the Emerald Weapon must be defeated at all costs."},{"name":"SHADOWHUNTER","text":"In the event that my attempt to bypass the castrum's security fails, this submersible of Cid's had best be able to withstand imperial weaponry long enough for us to escape."},{"name":"GSPILOT03980","text":"I'm sorry we weren't able to provide any further details on the target. We can only guess what other tricks it might have in store for you. Be careful out there."},{"name":"SHADOWHUNTER","text":"Though I would prefer that we avoid engaging my former wards in combat, we cannot allow my sentiments to prevent us from doing what must be done."},{"name":"SHADOWHUNTER","text":"And so it ends."},{"name":"SHADOWHUNTER","text":"But why would Rex throw away his life...for this!?"},{"name":"SHADOWHUNTER","text":"You are right... If I am ever to learn the truth, I must concentrate on the task at hand."},{"name":"SHADOWHUNTER","text":"Of course, we do not need to wait for Cid's analysis to tell us whose combat data was used on this occasion."},{"name":"SHADOWHUNTER","text":"It galls me to think that my techniques and strategies could be so closely replicated. Nevertheless, the observations I made during the battle may yet prove useful. As a matter of fact, that was not the only information I was able to gather."},{"name":"SHADOWHUNTER","text":"I intercepted a signal that revealed the troops stationed here were permitted to withdraw, seemingly in return for assisting the VIIth Legion. They must have known that the Alliance would follow the Emerald Weapon here sooner or later and made good their escape."},{"name":"SHADOWHUNTER","text":"Meaning the way is now clear for Cid to inspect the warmachina's remains."},{"name":"CID","text":"We got here as soon as we could."},{"name":"CID","text":"Not that we could've done anything to prevent this tragedy."},{"name":"CID","text":"From what we know, it seems that the Emerald Weapon was ilm for ilm a great deal more powerful than the previous two. If this is allowed to continue, who knows what sort of monstrosity the VIIth Legion will conceive next."},{"name":"CID","text":"Nevertheless, <span class=\"highlight\">Forename</span> has once again proven <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> capable of overcoming the worst the Empire has at its disposal."},{"name":"VALDEAULIN","text":"You may be relieved to hear that Castrum Occidens was free of anything resembling a Weapon. Unfortunately, it was also devoid of any useful leads, and we came away empty-handed."},{"name":"SHADOWHUNTER","text":"In all honesty, part of me wishes we had never found the Emerald Weapon. Perhaps then, Rex would not have been forced to make the ultimate sacrifice. I only hope that he is finally at peace..."},{"name":"CID","text":"We will do what we can to spare others from sharing his fate. I and the Ironworks will search this place from top to bottom for clues as to the VIIth Legion's plans."},{"name":"SEVERA","text":"Before that, allow me to sweep the area for booby traps and the like. I would not put it past the imperials to have left a few surprises for us..."},{"name":"VALDEAULIN","text":"Agreed. I'll go with you."},{"name":"CID","text":"With that in mind, I'll begin my examination of the Emerald Weapon. Carefully, that is."},{"name":"ALLIE","text":"Alfonse! You knew all this time, didn't you!?"},{"name":"ALLIE","text":"Milisandia and Ricon, too... Everyone except me."},{"name":"ALLIE","text":"And you, Rex?"},{"name":"REX","text":"Yes. That's what the synthetic auracite system <span class=\"emphasis\">is</span>. The fusion between pilot and core is the key to Oversoul."},{"name":"REX","text":"And unless we use it, we don't have a chance of beating Father's newfound friends. They stand between us and the primals, without which the Weapons will never reach their full potential. We thought that if you knew the truth about Oversoul, you'd try to stop us."},{"name":"ALLIE","text":"Of course I would! But what I don't understand is why all of you are so willing to give your lives for the Weapon project. What is it all for!?"},{"name":"ALFONSE","text":"It all began the day Father left. Without his guidance, his protection, the Garleans lost any respect they once had for us."},{"name":"ALFONSE","text":"But their cruelty pales in comparison to Valens. To him, conscripts like us are expendable commodities, an endless supply of test subjects for his twisted experiments."},{"name":"ALFONSE","text":"But no matter what they do to us, we will never lose hope. If it is the duty of the strong to lead the weak, we will become strong and protect those who cannot protect themselves."},{"name":"ALFONSE","text":"The Weapon project will give us the strength we need. We will create a world where people like us can live without fear of persecution."},{"name":"ALFONSE","text":"We want you to see this new world for yourself, Allie. Even if we must give our lives to make it a reality."},{"name":"ALLIE","text":"But...why me?"},{"name":"REX","text":"The years spent serving the Empire have changed us all...except you, Allie. Even after everything you've seen, you're still the caring, innocent girl we grew up with. More than any of us, you deserve a chance at happiness. That's what we all agreed."},{"name":"ALFONSE","text":"Allie, listen to me. Right now, the soldiers assigned to watch over us have been called away to the capital. Now is our chance to get you out of here."},{"name":"ALLIE","text":"Then why don't you come with me!?"},{"name":"REX","text":"If Alfonse and I were to run away now, they'd only force others to take our place. We can't let that happen."},{"name":"REX","text":"This is our way of upholding the ideals Father instilled in us. Our lives are a small price to pay for Werlyt's freedom."},{"name":"ALLIE","text":"No! How can you expect me to leave you behind!? I won't do it!"},{"name":"ALFONSE","text":"We will forever be at your side, Allie."},{"name":"ALFONSE","text":"Rex, take her to the holding cells."},{"name":"ALLIE","text":"No! Let me go!"},{"name":"REX","text":"So win or lose, the plan is to hand over the castrum to Father, is that right?"},{"name":"ALFONSE","text":"Yes. They'll take Allie into their custody before the Garleans return, while you will be free to pilot the Emerald Weapon without her interfering. We can't let her hinder the completion of the Weapon project."},{"name":"REX","text":"I'm counting on you, Alfonse. Don't let our sacrifices be in vain."},{"name":"ALFONSE","text":"Rex, have you forgotten what I told you? You mustn't use Oversoul! I can't lose you too..."},{"name":"REX","text":"We both know I can't win without it. Besides, we need the combat data of the Emerald Weapon fighting at its peak if we're to have any chance of perfecting the synthetic auracite system. You know I'm not the sort to do things by halves."},{"name":"ALFONSE","text":"Forgive me, Rex."},{"name":"REX","text":"Don't you worry about me. If this is where I meet my end, I'll do it with a smile on my face. The rest is up to you, Alfonse!"},{"name":"SEVERA","text":"This is the girl you spoke of, yes? She was locked in a cell, but I saw no harm in letting her out. I can't say for certain, but it seems she's been through quite an ordeal."},{"name":"ALLIE","text":"No..."},{"name":"ALLIE","text":"Why, Rex!? Why!?"},{"name":"CID","text":"...Gaius, once we've extracted the core, we'll take it back to Terncliff for analysis."},{"name":"CID","text":"Perhaps she should come with us? There's no use in her staying here."},{"name":"GSPILOT03980","text":"We're still carrying out our search of Castrum Marinum. Would you like to take a look for yourself?"},{"name":"Q3","text":"Enter Castrum Marinum?"},{"name":"SHADOWHUNTER","text":"Severa is taking care of Allie, but it may be some time until her nerves have settled."},{"name":"SHADOWHUNTER","text":"If the vision you witnessed is indeed true, Alfonse and Rex locked her away for her own safety."},{"name":"SHADOWHUNTER","text":"When she is ready, I would know more of what her brother hopes to achieve and why he must resort to such desperate measures."},{"name":"SEVERA","text":"Allie's condition has improved somewhat, but she remains in a state of shock. We must give her more time to recover."},{"name":"SEVERA","text":"There was one other thing that I thought you should know... When we checked her for injuries, we saw that her back is covered in welts and bruises."},{"name":"SHADOWHUNTER","text":"Who did this to her!?"},{"name":"SEVERA","text":"It seems she was subjected to beatings on a regular basis, judging by the varied stages of bruising. I daresay this was the work of her Garlean masters."},{"name":"SHADOWHUNTER","text":"You speak as though you have seen this before..."},{"name":"SEVERA","text":"Seen? I have lived through it myself."},{"name":"SEVERA","text":"I was born in Werlyt, twenty-three summers past."},{"name":"SEVERA","text":"My mother was a local woman, but my father was a pure-blooded Garlean and a member of the occupying forces."},{"name":"SEVERA","text":"Though I know very little about him, his rank afforded me imperial citizenship. His acknowledgement of our familial ties was the extent of the responsibility he took for bringing me into this world. Still, it is more than can be said for most of his ilk..."},{"name":"SEVERA","text":"My mother and I were shunned by the people of Werlyt, who treated us as badly as the Garleans did, if not worse. I thought that if I were to become an imperial soldier, my position might somehow deter those who would cast scorn on my mother, if only out of fear. And so I joined the army."},{"name":"SEVERA","text":"The acceptance I earned was but temporary, however, and my superiors were quick to blame any perceived shortcomings on my “savage” lineage. Rather than waste time on official court-martials, they administered their own form of corporal punishment."},{"name":"SEVERA","text":"I was eventually assigned to the XIIth Legion and fought under Zenos yae Galvus in Ala Mhigo. In the chaos that followed our defeat, I seized the opportunity to flee to Werlyt."},{"name":"SEVERA","text":"While it was never much of a home, it was all I had. But nothing could prepare me for what awaited..."},{"name":"SEVERA","text":"My mother had for many years suffered from poor health and relied on medicine to keep her alive. In my absence, the Garleans had denied her treatment, claiming that it would be wasted on savages. By the time I could return to her side, there was naught I could do."},{"name":"SEVERA","text":"There was nothing left for me in Werlyt. I would be punished for desertion if the imperials discovered the reason for my return, and I was never accepted by my so-called countrymen to begin with."},{"name":"SEVERA","text":"I ran as far as my legs could carry me. It was then that I met Gaius."},{"name":"SHADOWHUNTER","text":"So that is the truth of it... Other than a few scant details, I knew naught of your past. It sickens me to think that I once fought under the same banner as such vile creatures."},{"name":"SHADOWHUNTER","text":"I had always believed it to be the duty of the strong to lead the weak. Yet there are those who become drunk on the power afforded by their station, and prey on the ones they should protect."},{"name":"SHADOWHUNTER","text":"Like a canker, this corruption has spread to every part of the Empire."},{"name":"SEVERA","text":"Even those with Garlean blood, such as myself, are subjected to their cruelty. They hold particular contempt for the Au Ra, an easy target for abuse being so few in number. Perhaps, like me, Allie thought she would be spared such treatment once she joined the army. Alas..."},{"name":"SHADOWHUNTER","text":"..."},{"name":"SEVERA","text":"I only hope that with time, Allie can put the past behind her and make a new life for herself. But for now, all we can do is wait for her delirium to subside. It is Valdeaulin's turn to keep watch. Let us ask him if there has been any change."},{"name":"VALDEAULIN","text":"I suppose you're here to ask about Allie."},{"name":"SHADOWHUNTER","text":"Is she well enough to speak with us?"},{"name":"VALDEAULIN","text":"As her condition has improved somewhat, I would say so, provided you do not cause her any undue distress. Wait here."},{"name":"SHADOWHUNTER","text":"Allie... I am sorry. What happened to Rex...it was my fault."},{"name":"SHADOWHUNTER","text":"Milisandia, and Ricon, too... They died because of me and my foolish ambitions."},{"name":"ALLIE","text":"Father, no..."},{"name":"SHADOWHUNTER","text":"This cannot go on. Please, Allie. You must tell me all you know."},{"name":"ALLIE","text":"..."},{"name":"ALLIE","text":"Of course."},{"name":"SHADOWHUNTER","text":"First, I need to know what became of you and your siblings after we were parted."},{"name":"ALLIE","text":"So much has happened, it seems like a lifetime ago... After your disappearance, we were all assigned to the newly reformed VIIth Legion."},{"name":"ALLIE","text":"At first, each legatus was quickly replaced by the next, until eventually, a man named Valens van Varro was given command."},{"name":"ALLIE","text":"He was sent from the capital, but before that, he was a specialist in experimental magitek weaponry."},{"name":"ALLIE","text":"We later discovered that he was ordered by Emperor Varis to complete a project involving anti-primal warmachina: the Weapons... But after the Emperor's death, he was free to employ whatever methods he saw fit, and his greed for power only grew."},{"name":"ALLIE","text":"Some even say he is planning to use the power of the Weapons to lay claim to the throne."},{"name":"ALLIE","text":"But I think there's another reason for his obsession with the Weapon project. Not that he'd ever tell anyone, but he's always muttering to himself, and I've been able to put the pieces together."},{"name":"ALLIE","text":"He's jealous of you, Father."},{"name":"SHADOWHUNTER","text":"Valens van Varro... I must admit, it was only recently that I first heard that name."},{"name":"ALLIE","text":"Valens used his knowledge of magitek to devise various military strategies. He was given a position in the army and quickly rose through the ranks."},{"name":"ALLIE","text":"That was until one man stood in his way─ You, Father."},{"name":"ALLIE","text":"He was one of the candidates to lead the new XIVth Legion, but that role fell to you. After that, he was assigned to serve under a far more gifted engineer, Nero, who was in charge of restoring the Ultima Weapon."},{"name":"ALLIE","text":"Valens has resented you ever since, going so far as to oppose the ideals you upheld. Where you treated those who serve the Empire based on merit rather than on their race or origin, Valens is adamant that pure-blooded Garleans are superior to all others."},{"name":"SEVERA","text":"It never ceases to amaze me how far some will go in the name of revenge. All that hatred, festering away... Nothing good could ever come of it."},{"name":"SHADOWHUNTER","text":"So the marks on your body are his handiwork?"},{"name":"ALLIE","text":"...Yes. To Valens and his men, we are no more than fodder for his experiments, playthings on which they can vent their frustrations. Every day is filled with nothing but pain..."},{"name":"SHADOWHUNTER","text":"If I had remained in Garlemald, you would never have been forced to endure this abuse."},{"name":"ALLIE","text":"It's not your fault, Father. We could've fled from Valens if we'd wanted to. After all, we're expendable and easily replaced. The truth is, that's exactly why we <span class=\"emphasis\">couldn't</span> run."},{"name":"ALLIE","text":"In saving ourselves, we would be condemning others. But if we were to stay, to see the Weapon project to its completion, we would gain the power to defeat Valens, and then the Empire itself, freeing the world from its tyranny."},{"name":"ALLIE","text":"That way, we might start afresh, and find a place we can call home. And not just for us, but for anyone who wishes to live in peace."},{"name":"SHADOWHUNTER","text":"You would give your lives for a future you may not live to see..."},{"name":"ALLIE","text":"We took courage from your teachings, Father. The strong must lead the weak, and we would gain that strength by whatever means necessary. We will fight for the sake of those who cannot."},{"name":"ALLIE","text":"But we knew that you'd never consent to our participation in the Weapon project, which is why we couldn't turn to you for help."},{"name":"ALLIE","text":"As the pilots, we're the only ones who are able to stop Valens. We know just how powerful the Weapons are. He would use them to bring the world to its knees."},{"name":"ALLIE","text":"And his “masterpiece” is the worst of them all..."},{"name":"ALLIE","text":"If only I could get my hands on it... Then I could save Alfonse and all of Werlyt!"},{"name":"ALLIE","text":"Father, I know you and Alfonse stand on opposing sides of this conflict, but there must be some way you can help him."},{"name":"ALLIE","text":"He may have called you our enemy before, but he never meant it. He still loves you, Father. You are everything he aspires to be."},{"name":"SHADOWHUNTER","text":"I have failed him. Failed you all."},{"name":"SHADOWHUNTER","text":"But I refuse to abandon him to his fate. I will free him from Valens, if it is the last thing I do."},{"name":"ALLIE","text":"Thank you... He needs you. Now more than ever."},{"name":"SHADOWHUNTER","text":"Listen, Allie. I once sought the strength to rebuild the world as I saw fit. But the Ultima Weapon was born not to create, but to destroy."},{"name":"SHADOWHUNTER","text":"Alfonse must not follow in my footsteps. I know all too well where they lead."},{"name":"SHADOWHUNTER","text":"I will do all I can to help your brother. Pray, tell me where he is."},{"name":"ALLIE","text":"He's..."},{"name":"ALLIE","text":"I'm sorry. I don't know where he could be."},{"name":"SHADOWHUNTER","text":"In that case, I shall have the Alliance dispatch scouts. Wherever he is, we will find him. As for you, Allie, you must stay here and rest."},{"name":"ALLIE","text":"Wait... You're the one who fought Rex, Ricon, and Milisandia, aren't you?"},{"name":"ALLIE","text":"We're the ones who threatened your homeland. You only did what you had to do."},{"name":"ALLIE","text":"I have no right to ask this of you, but..."},{"name":"ALLIE","text":"Lend my father your strength. Save Alfonse."},{"name":"ALLIE","text":"...I know now why they call you “hero.”"},{"name":"ALLIE","text":"Alfonse, I'll do what I must to free you, even if it means going against Father's wishes. But I have a good feeling about his new friend..."},{"name":"SHADOWHUNTER","text":"Severa, see that she has everything she needs."},{"name":"SHADOWHUNTER","text":"Our allies must be informed of these troubling events. May I ask you to relay this news to the troops in Gyr Abania?"},{"name":"VALDEAULIN","text":"Your “loving father” act may fool the others, Gaius, but not me. For every life you've saved, you've ended a thousand more. Or is this your idea of redemption?"},{"name":"SHADOWHUNTER","text":"Call it what you will. For all my transgressions, I believe I still have a part to play."},{"name":"VALDEAULIN","text":"Was I wrong to spare you that day? Or will you honor your word? ...It seems the time has come for the Black Wolf to show his true colors."},{"name":"SEVERA","text":"Though you have overcome the Emerald Weapon, it is hardly cause for celebration. Another young life cut short..."},{"name":"SHADOWHUNTER","text":"Rex's death is on my hands, not yours. Would that this confrontation had been averted, but alas, it was not to be."},{"name":"RESISTANCEOFFICER","text":"We recently received word of your victory over the Emerald Weapon. I expect it was another fine display on your part, not that any of us were there to see it..."},{"name":"RESISTANCEOFFICER","text":"For that reason, we'd be grateful if you could give us a blow-by-blow account, if you wouldn't mind."},{"name":"RESISTANCEOFFICER","text":"Good grief, it sounds like you had an awful lot to contend with! Rather you than me... Ahem! I shall add this to our ever-growing stack of reports, should anyone wish to review this information ahead of the next sortie."},{"name":"RESISTANCEOFFICER","text":"Now, if I may say so, it looks like your ordeals have taken their toll. We'll let you know if anything requires your attention, but until then, be sure to get some rest!"},{"name":"SYSTEM","text":"Meanwhile, in the VIIth Legion's correction chamber..."},{"name":"VALENSVANVARRO","text":"Three Weapons. Three pitiful displays of ineptitude..."},{"name":"ALFONSE","text":"Aghhh!"},{"name":"VALENSVANVARRO","text":"To make matters worse, one of my prime candidates─your precious sister, no less─has escaped!"},{"name":"ALFONSE","text":"Unnngh!"},{"name":"VALENSVANVARRO","text":"And who should she go crawling to but that swine Gaius! After everything I've done t─<span class=\"emphasis\">for</span> her, and this is how she repays me! As her older brother, it's your responsibility to instill some discipline in her, and you've failed miserably!"},{"name":"VALENSVANVARRO","text":"Well? Don't just stand there, boy."},{"name":"VALENSVANVARRO","text":"Oh, of course! It's your first time, isn't it? Come along, there's no need to be shy."},{"name":"VALENSVANVARRO","text":"You see, something wicked has taken hold of this young man, and it's our job to cleanse his troubled spirit."},{"name":"VALENSVANVARRO","text":"It may look painful, but it's the only way, I assure you. He'll be ever so grateful, and you want him to get better, don't you?"},{"name":"VALENSVANVARRO","text":"There's a good boy! Now, let's try again, shall we?"},{"name":"VALENSVANVARRO","text":"Burn out the bad! Burn out the bad!"},{"name":"ELEZENBOY03980","text":"(-Elezen Ward-)B-Burn out the bad... Burn out the bad!"},{"name":"VALENSVANVARRO","text":"(-Valens's Wards-)Burn out the bad! Burn out the bad!"},{"name":"ALFONSE","text":"Gaaaaaagh!"},{"name":"VALENSVANVARRO","text":"Well done! You've all made Father proud. Very proud, indeed!"},{"name":"VALENSVANVARRO","text":"As for you..."},{"name":"VALENSVANVARRO","text":"I thought you were a cut above the rest of the savages, but it appears I was mistaken. And since you allowed that wretched sister of yours to escape, it falls to you to act as her replacement."},{"name":"VALENSVANVARRO","text":"I choose you as the next pilot, and your mission is simple: kill Gaius van Baelsar, whatever it takes. And if you so much as entertain the idea of betraying me again, I'll exterminate every last one of your kind..."},{"name":"VALENSVANVARRO","text":"...like the vermin they are!"},{"name":"VALENSVANVARRO","text":"Having said that, we will be forcibly initiating Oversoul using Zenos's combat data, so whatever schemes you may be hatching will never come to pass. All you need to do is sit back and let the synthetic auracite system do the work, with you as its conduit."},{"name":"VALENSVANVARRO","text":"You should thank me for allowing you to become part of my masterpiece. Your worthless existence will finally have some semblance of meaning!"},{"name":"VALENSVANVARRO","text":"Hehehe..."},{"name":"MECHANIC03980","text":"(-Valens's Second-in-command-)Lord Valens, preparations for the Oversoul trial are complete. We await your orders."},{"name":"VALENSVANVARRO","text":"Splendid. There's never a dull moment around here!"},{"name":"VALENSVANVARRO","text":"Now then, boys. Who'd like to see something special?"},{"name":"VALENSVANVARRO","text":"Come along, everyone! Father has secrets to share with you!"},{"name":"ALFONSE","text":"This is my chance... And it's all thanks to the sacrifices made by my dear siblings. Finally, the Weapon will be mine to command."},{"name":"ALFONSE","text":"Once it has reached perfection, I will be unstoppable. First Valens...then the Empire itself will fall, and we will be free at last."},{"name":"ALFONSE","text":"Father...keep Allie safe."},{"name":"ALFONSE","text":"Milisandia, Ricon, Rex... I'll see this through to the end. I promise."},{"name":"ALFONSE","text":"Until then, watch over me."},{"name":"VALENSVANVARRO","text":"So? Is it ready or not?"},{"name":"MECHANIC03980","text":"The trial sequence has been primed, sir."},{"name":"VALENSVANVARRO","text":"Then get on with it!"},{"name":"MECHANIC03980","text":"Initiating synthetic auracite system. Loading Diamond Weapon simulation."},{"name":"WERLYTPILOT03980","text":"Wh-What's going on!?"},{"name":"VALENSVANVARRO","text":"You're helping us with a little research is all, ah...whatever your name is. The time has come for you to contribute to the glory of Garlemald!"},{"name":"WERLYTPILOT03980","text":"Th-This isn't what we agreed! You said th-that if I took part in the experiment, you'd let my f-family go!"},{"name":"VALENSVANVARRO","text":"You have Zenos's data loaded, yes? Activate Oversoul, and be quick about it."},{"name":"MECHANIC03980","text":"Understood, Lord Valens."},{"name":"SYSTEM","text":"(-VIIth Legion Senior Engineer-)Galvus combat sample ready.<br>Initiating organic core overwrite."},{"name":"WERLYTPILOT03980","text":"Nnnaaaaaaggghhh!"},{"name":"WERLYTPILOT03980","text":"My...mind is... Nooo!<br>If this is...what it takes to...protect you both...I...<br>I love you! I'm so sorry...!"},{"name":"WERLYTPILOT03980","text":"Where...is my prey?"},{"name":"MECHANIC03980","text":"Organic core overwrite complete. Zenos yae Galvus data loaded."},{"name":"VALENSVANVARRO","text":"Enough. Shut it down!"},{"name":"MECHANIC03980","text":"Deactivating synthetic auracite system."},{"name":"VALENSVANVARRO","text":"Hmm... The subject is instinctively bound to seek out prey, right from the outset. Regardless of the combat prowess it may boast, I need an obedient servant, not a ravenous beast."},{"name":"VALENSVANVARRO","text":"How revolting! And what a mess it makes of the cockpit."},{"name":"VALENSVANVARRO","text":"Adjust the settings and prepare for another run! Fortunately, we have the next test subject ready and waiting..."},{"name":"MECHANIC03980","text":"But sir, you agreed to release his family in exchange for his cooperation..."},{"name":"VALENSVANVARRO","text":"Ahahaha! Ahahahahahahaaaaaa!"},{"name":"VALENSVANVARRO","text":"My, my! I never knew you had such a wonderful sense of humor! The great Valens van Varro, bargaining with savages? Ha! More fool him for trusting me in the first place!"},{"name":"SEVERA","text":"Leave Allie to me. Having cared for my mother for so long before being transferred away, I'd like to think I have developed suitable bedside manner."},{"name":"VALDEAULIN","text":"While I am painfully aware of the cruelty the Empire shows its enemies, even I am appalled to hear of how it treats its own. Warmachina that feed on the very lives of their pilots... I can scarcely imagine anything more heinous."},{"name":"SHADOWHUNTER","text":"The majority of the VIIth Legion are sure to be stationed in the city of Werlyt, the heart of this occupied territory. Whether Alfonse is there with them remains to be seen."},{"name":"SHADOWHUNTER","text":"According to Allie, another Weapon lies in wait, but where, we do not know. It stands to reason however, that if we were to find it, Alfonse would surely not be far away."}],"reward":{"gil":1655,"instance":20073},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69431]},"next":[69517]},"partials":[{"type":"npc","id":"1032586","obj":{"i":1032586,"n":"Resistance Officer","l":2408,"q":6}},{"type":"instance","id":"20073","obj":{"i":20073,"n":"Castrum Marinum","c":61804,"t":"Trials","min_lvl":80,"max_lvl":80,"min_ilvl":485}},{"type":"quest","id":"69431","obj":{"i":69431,"n":"Sleep Now in Sapphire","g":25,"l":"The Lochs","s":20,"f":1}},{"type":"quest","id":"69517","obj":{"i":69517,"n":"In Memory","g":25,"l":"The Lochs","s":40,"f":1}}]}