{"quest":{"name":"Fear of the Dark","location":"The Empty","id":69512,"patch":5.4,"sort":15,"icon":112407,"unlocksFunction":1,"eventIcon":71341,"issuer":1034510,"target":1034511,"genre":23,"journal":["Gaia appears to be conversing with the voice inside her head.","You and Ryne can only look on in worry as Gaia is overcome by another assault on her senses caused by the voice in her head. Thankfully, this troubling episode ends as suddenly as it began, though she is left with the lingering notion of using Darkness to restore the Empty. Ryne soon realizes that this may indeed provide a means by which to revitalize the withered flora. It seems that the Light's influence on the ambient aether is still too strong to allow life to flourish, and shifting the alignment closer to Darkness should redress the balance. The three of you make your way to Eden's core to put your theories to the test.","In order to restore balance to the aether, you must call upon the image of an entity embodying Darkness. As you have no experience fighting primals of that nature, your memories of the Cloud of Darkness, ruler among voidsent, will instead form the basis for the summoning.<br><br>※Eden's Promise: Umbra can be accessed via the Duty Finder.","With Ryne and Gaia working in harmony to manipulate the ambient aether, the plan to call forth a likeness of the Cloud of Darkness is a success. Naturally, you rise to the occasion and slay the beast, returning its aether to the Empty. Gaia is keen to return to the camp to observe whether your efforts have yielded the desired results.","Much to your dismay, the once-verdant foliage is no closer to being rejuvenated. However, the strangely shifting hues of the crystal that towers above indicate that something has changed...be it for good or ill."],"objectives":["Speak with Ryne in Eden's core.","Enter Eden's Promise: Umbra.","Speak with Gaia."],"dialogue":[{"name":"RYNE","text":"It's been so long since Gaia had one of her headaches that I thought the faerie might've disappeared for good. Do you think it's got something to do with Eden?"},{"name":"GAIA","text":"Restore...Darkness..."},{"name":"RYNE","text":"What did you say, Gaia?"},{"name":"GAIA","text":"Restore the Darkness...to the world flooded by Light..."},{"name":"GAIA","text":"Ah! That's it!"},{"name":"GAIA","text":"We thought we'd restored balance to the six elements, but perhaps they're still too strongly aligned with Light? If that's the case, maybe we can set things right by using Darkness."},{"name":"RYNE","text":"By using Darkness? Are...are you serious!?"},{"name":"RYNE","text":"But hold on... It might actually work!"},{"name":"RYNE","text":"Gaia, that's a brilliant idea!"},{"name":"GAIA","text":"I-I wouldn't go that far. I just remembered what I learned during our adventures, that's all."},{"name":"GAIA","text":"But this does mean we'll need to call on your services again, if that's all right with you?"},{"name":"RYNE","text":"We've come this far together, and we'll see our mission to the end! To Eden's core!"},{"name":"GAIA","text":"I'll say one thing before we start: if this all goes horribly wrong, don't even think about pinning it on me! Not that it will, of course..."},{"name":"RYNE","text":"Right, let's get started!"},{"name":"RYNE","text":"But...hmmm... Were there any primals aligned with Darkness? I can't seem to recall any..."},{"name":"GAIA","text":"You mean there isn't one?"},{"name":"RYNE","text":"The Ascians' god, Zodiark, may be suitable, but we need something that <span class=\"highlight\">Forename</span> has actually encountered─and preferably defeated."},{"name":"GAIA","text":"Well, does it have to be a primal for it to work? If it's just a lot of Darkness that we need, perhaps there are other ways to get it."},{"name":"RYNE","text":"You may be right! What we ultimately need is a state of highly charged Darkness─it shouldn't matter what form it takes. Does anything come to mind, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I daresay the Flood of Darkness had a fair bit of...Darkness."},{"name":"A1","text":"I know a few voidsent that would fit the bill."},{"name":"RYNE","text":"You mean the catastrophe that swallowed the Thirteenth and turned it into a lifeless void? Erm, we might need something on a slightly smaller scale..."},{"name":"GAIA","text":"The creatures I unleashed while under the faerie's control... If we were able to summon one powerful enough, it just might work."},{"name":"RYNE","text":"The Cloud of Darkness... I can't begin to imagine how powerful it must have been."},{"name":"GAIA","text":"I'd say we've found the perfect candidate."},{"name":"RYNE","text":"But where to find a suitable place, one where Darkness is strong... It won't be easy in a world flooded by Light."},{"name":"GAIA","text":"Well, we've got the Warrior of Darkness <span class=\"emphasis\">and</span> the Oracle of Darkness right here. It seems like a good enough spot to me."},{"name":"RYNE","text":"But what about the Light-aligned aether that's all around us?"},{"name":"GAIA","text":"That's where you come in. You can suppress the Light while I draw out the Darkness. By combining our powers, we can make it work wherever we are."},{"name":"RYNE","text":"Combining our powers..."},{"name":"RYNE","text":"Yes, between us, there's nothing we can't achieve! Don't be afraid, Gaia!"},{"name":"GAIA","text":"I'm not afraid─just very concerned that this will all go horribly wrong...which is the same thing, I suppose. Anyway, it's certainly not easy coming up with these plans by ourselves."},{"name":"RYNE","text":"That's true. But when this is over, we can reward ourselves with all sorts of delicious treats at the festival!"},{"name":"GAIA","text":"Festival? What do you mean?"},{"name":"RYNE","text":"We spoke about it on the way here, remember? I asked if you wanted to take part."},{"name":"GAIA","text":"Um... I was busy piloting the skyslipper, so I probably wasn't paying attention."},{"name":"RYNE","text":"Oh well, not to worry. We can talk about that later. Right now we've got a job to do!"},{"name":"RYNE","text":"I'll draw out the ambient aether..."},{"name":"GAIA","text":"And I'll shift its alignment to Darkness!"},{"name":"RYNE","text":"Now, <span class=\"highlight\">Forename</span>! Focus your thoughts!"},{"name":"SYSTEM","text":"Memories of the Cloud of Darkness enshroud your mind..."},{"name":"RYNE","text":"This is the first time we've tried this since that disaster with Shiva, so I'd be lying if I said I wasn't nervous. Even so, I can't afford to waver now!"},{"name":"GAIA","text":"I've called forth real voidsent before─so everyone tells me, anyway─but this is unknown territory for me. With the two of you by my side, though, I'm sure it'll work!"},{"name":"RYNE","text":"So that was what a world flooded by Darkness would look like..."},{"name":"GAIA","text":"That all went surprisingly well. Of course, we have <span class=\"highlight\">Forename</span> to thank for slaying that ghastly creature."},{"name":"RYNE","text":"You were fantastic, Gaia! Anyone would think you're an old hand at this!"},{"name":"GAIA","text":"You weren't so bad yourself. We make quite a team, don't we?"},{"name":"RYNE","text":"We certainly do!"},{"name":"GAIA","text":"I don't know about you two, but I'm itching to see whether our hard work has paid off. Let's head back."},{"name":"GAIA","text":"Hmm... The plants are just as lifeless as they were before. Maybe the Light's influence is still too strong?"},{"name":"RYNE","text":"What in the world...?"},{"name":"GAIA","text":"In fleeting hues and endless warmth,<br>A gentle light washed over me."},{"name":"GAIA","text":"A glimmer of hope once lost..."}],"reward":{"gil":3000,"items":[{"num":2,"id":25197,"one":1},{"num":2,"id":25198,"one":1},{"num":2,"id":25190,"one":1},{"num":2,"id":25186,"one":1}],"instance":30097},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69511]},"next":[69513]},"partials":[{"type":"npc","id":"1034510","obj":{"i":1034510,"n":"Gaia","l":3225,"q":1}},{"type":"npc","id":"1034511","obj":{"i":1034511,"n":"Gaia","l":3214,"q":1}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"instance","id":"30097","obj":{"i":30097,"n":"Eden's Promise: Umbra","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":485}},{"type":"quest","id":"69511","obj":{"i":69511,"n":"Empty Promise","g":23,"l":"Amh Araeng","s":14,"f":1}},{"type":"quest","id":"69513","obj":{"i":69513,"n":"Shadows of the Past","g":23,"l":"The Empty","s":16,"f":1}}]}