{"quest":{"name":"Oddness in the End","location":"Ishgard","id":69518,"patch":5.41,"sort":10006,"icon":101025,"unlocksFunction":1,"eventIcon":71341,"issuer":1032898,"target":1035012,"genre":84,"journal":["Neillemard has both the will and a way to make your Skysteel tool the best it can be.","Neillemard reveals to you that, after much study and scrutiny, he has at last struck upon a means to bring the final set of plans for your Skysteel tool to life. Said means is currently housed at the Skysteel workshop in the Firmament, however, so you will need to venture there and witness it for yourself if you are to understand without enduring a moon's worth of engineering talk.","At the workshop, you find none other than Stephanivien, master of the Skysteel Manufactory. He is accompanied by an ambulatory piece of machina recovered from Azys Lla that, as it transpires, is the key to performing the delicate operations necessary to realize the latest and greatest Skysteel design. Though Neillemard and Nimie will not be available to assist this time around, they seem confident that between this mechanical marvel and the skills of workshop engineers Joellie and Emeny, the fruits of your labors will be fully worth the effort."],"objectives":["Speak with Emeny at the Skysteel workshop."],"dialogue":[{"name":"NEILLEMARD","text":"Just the <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> I was hoping to see! Tell me─how does your skysung tool fare? Is it looking well loved? And more importantly, well tested?"},{"name":"NEILLEMARD","text":"Splendid, splendid! We shall examine those wear patterns and make the necessary adjustments to ensure that your perfected tool is as perfect as can be."},{"name":"NEILLEMARD","text":"Yes, you heard me correctly─we are, at long last, prepared to bring the Skysteel tools project to completion."},{"name":"NEILLEMARD","text":"I will admit I felt some consternation when first I realized that our vision for the final design required finesse beyond that of mortal fingers. But what sort of engineer would I be if I could find no way to surpass the limitations that would shackle mankind?"},{"name":"NEILLEMARD","text":"No true engineer at all, I say! And so, though I knew that even goblincraft could offer no solutions to our latest conundrum, I nevertheless confided in Rowena. She provided a most tantalizing lead indeed─and through its pursuit, we have at last found the path to the Skysteel summit!"},{"name":"NIMIE","text":"While I'm sure Neillemard would like nothing more than to expound upon its wonders in detail, it'd be faster to show you the miracle device in question. A certain someone's pretty attached to it, so you'll need to meet us at the Skysteel workshop in the Firmament."},{"name":"NEILLEMARD","text":"Quite right. Ask for Emeny when you arrive─she has newly joined the project and is ever so eager to make herself useful. Nimie and I have a few spare parts we've been meaning to round up for delivery to the workshop, but we will join you soon enough."},{"name":"NEILLEMARD","text":"It truly is the most ingenious thing! Why, the manner in which it─ah, but why take my word for it? Make for the workshop posthaste and witness its wonders for yourself!"},{"name":"JOELLIE","text":"If you wish to inquire about enhancements to your Skysteel tool, please speak with Emeny here. I am sure you will find her quite...eager."},{"name":"EMENY","text":"&lt;gasp&gt; I've seen you with Neillemard at the manufactory! That means <span class=\"emphasis\">you</span> are the one that he recruited to help refine the Skysteel tools, are you not?"},{"name":"EMENY","text":"&lt;gasp&gt; I can hardly believe it! Can you believe it, Joellie!?"},{"name":"JOELLIE","text":"For heavens' sake, Emeny, you look like a jumping balloonfish! ...Apologies, <span class=\"alternative-container\"><span class=\"alternative\">ma'am</span><span class=\"alternative\">sir</span></span>. Her professional enthusiasm at times gets the better of her. As for your tool, we'd be more than happy to help just as soon as our means of doing so has been properly oiled up."},{"name":"STEPHANIVIEN","text":"(-???-)Never fear, my dear, for the tedium of maintenance is at an end!"},{"name":"STEPHANIVIEN","text":"It is delightful to see you again, <span class=\"highlight\">Forename</span>. Do allow me to introduce Steelvien “Spanner” de Haillenarte I, Esquire─a technological marvel!"},{"name":"STEPHANIVIEN","text":"Pray allow me to introduce myself─Stephanivien de Haillenarte, at your service. And you must be the trades<span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> about whom I have heard so much. I present to you Steelvien “Spanner” de Haillenarte I, Esquire─may he serve you well."},{"name":"NEILLEMARD","text":"Spanner, I am happy to say, is the solution to the conundrum I mentioned before. He performs mechanical manipulations with unparalleled precision and finesse."},{"name":"NEILLEMARD","text":"We salvaged him from Azys Lla, you see─a locale I was unaware even existed until Rowena told me of it."},{"name":"STEPHANIVIEN","text":"Aurvael was kind enough to fly us there. Almost getting devoured by ravening beasts was less than ideal, but well worth the trouble for such a bounty of fascinating technology! My prospectometer could hardly keep up."},{"name":"STEPHANIVIEN","text":"When we came upon Steelvien “Spanner” de Haillenarte I, Esquire, I knew immediately what I had to do. Thus did I stealthily conceal him amongst my personal effects for the return journey, with no one else the wiser."},{"name":"NEILLEMARD","text":"...Indeed. We also located a number of other parts that should prove useful to our endeavors, if the records stored within Spanner's circuitry are accurate."},{"name":"NEILLEMARD","text":"Some are to be found in Azys Lla, of course, but it appears that a foray to the Diadem would also prove fruitful."},{"name":"STEPHANIVIEN","text":"Should you have any doubt as to the materials, Steelvien “Spanner” de Haillenarte I, Esquire will be more than happy to elaborate, I'm sure. I myself may not be here to guide you every step of the way, but never fear─I have given Joellie comprehensive instruction in his operation."},{"name":"STEPHANIVIEN","text":"The talents of the rest of our staff are at your disposal as well, naturally, as is our conveniently located workshop here. Needless to say, we're all eager to see what comes of the ultimate phase of innovation!"},{"name":"NEILLEMARD","text":"We believe you'll find the workshop undeniably well suited to this end. It offers convenient access to the Diadem, and all of the latest manufacturing technology."},{"name":"NEILLEMARD","text":"Alas, this does mean that Nimie and I will be unable to assist as you prepare to bring the final design to life. Rowena has been flooding us with orders of late, and we simply cannot afford to be away from the manufactory for long."},{"name":"NIMIE","text":"It pains me both personally and professionally to say so, but Neillemard's right. While I'd much rather spend my time pursuing our next major breakthrough, a deal's a deal."},{"name":"NEILLEMARD","text":"Nevertheless, we have complete faith in Joellie and Emeny─and Spanner, I suppose─to help take your Skysteel tool to the very pinnacle of possibility."},{"name":"EMENY","text":"I absolutely, positively, indubitably, unquestionably will <span class=\"emphasis\">not</span> let you down!"},{"name":"JOELLIE","text":"Appearances perhaps to the contrary, we are in fact experienced engineers. You and your tool are in good─if excitable─hands."},{"name":"JOELLIE","text":"That said, we only have the resources to help you with upgrading skysung tools. If you have any tools that aren't to that level yet, you'll have to ask Nimie. Those plans are all at the manufactory."},{"name":"EMENY","text":"Upgrading your skysung tool is what we're all here for, though, isn't it? So let's get right to it!"}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":35}],"quests":[69430]},"next":[69519]},"partials":[{"type":"npc","id":"1032898","obj":{"i":1032898,"n":"Neillemard","l":2300,"q":5}},{"type":"npc","id":"1035012","obj":{"i":1035012,"n":"Emeny","l":3435,"q":2}},{"type":"quest","id":"69430","obj":{"i":69430,"n":"The Tools of Tomorrow","g":84,"l":"Ishgard","s":10005,"r":1,"f":1}},{"type":"quest","id":"69519","obj":{"i":69519,"n":"The Pinnacle of Possibility","g":84,"l":"The Firmament","s":10007,"r":1,"f":1}}]}