{"quest":{"name":"In Memory","location":"The Lochs","id":69517,"patch":5.4,"sort":40,"icon":101034,"unlocksFunction":1,"eventIcon":71341,"issuer":1032586,"target":1032586,"genre":25,"journal":["The Resistance troops wish to help their newfound allies in Terncliff.","Following the liberation of Terncliff, the Resistance has been sending supplies and providing support to the citizens to help the town become self-sufficient in the wake of the Empire's departure. Yet with more problems than there are people to solve them, they turn to you for aid, that you may lighten their load, if only by a little.","Shortly after arriving in Terncliff, it soon becomes apparent that both the Resistance soldiers and Ironworks members are doing all they can to assist the populace. You decide to speak to the locals in the hope that they might in some way benefit from your presence.","A rather forlorn young woman named Avilina tells you of her days as a conscript, forced to serve the Empire as a magitek engineer during the occupation of Terncliff. Many people her age were enlisted in the army and sent to war, never to return, and she wishes to commemorate them with a monument bearing their names. She believes that a comprehensive list of conscripted soldiers can be found in the imperial hangar below the town, but she needs you to persuade the Ironworks members to permit her entry.","Your renown among the Ironworks engineers opens many doors, the one to the hangar included. Avilina is able to find the list she needed to complete her monument, but her eye was drawn to one name in particular: Milisandia, who you know as the pilot of the Ruby Weapon. You then learn that Avilina and Milisandia were close friends and once served together in the XIVth Legion until fate conspired to separate them. Guided by your words of encouragement, Avilina resolves to use the skills she gained working as a magitek engineer to help the Ironworks in preparation for the struggle with the Empire. And though she will no doubt find herself very busy in the days to come, she remains determined to build a monument to Terncliff's fallen.","You make your way back to the camp in Gyr Abania, where the commanding officer offers his gratitude for your efforts. Though it may be some time before Terncliff can regain the peace and tranquility it enjoyed in its heyday, you take solace in the bonds the townsfolk have formed with your allies in the Resistance."],"objectives":["Speak with the Resistance escort.","Search for the despondent civilian.","Speak with the burly engineer.","Speak with the Resistance officer at Porta Praetoria."],"dialogue":[{"name":"RESISTANCEOFFICER","text":"Ah, <span class=\"highlight\">Forename</span>. I was hoping I might have a word with you."},{"name":"RESISTANCEOFFICER","text":"Ever since Terncliff was liberated, we've been sending troops to aid in getting the town back on its feet. Helping the residents, that sort of thing."},{"name":"RESISTANCEOFFICER","text":"We Ala Mhigans know how hard life can be for a society struggling to stand on its own after years of imperial rule. A lot of what most people would take for granted has to be rebuilt from the ground up."},{"name":"RESISTANCEOFFICER","text":"While we're able to assist when it comes to providing basic resources and keeping the place safe, there are countless other problems that need attending to. If you can spare the time, we could use your help."},{"name":"RESISTANCEOFFICER","text":"Bless you, <span class=\"highlight\">Forename</span>. You really are a saint. I'm sure the people of Terncliff will benefit from having someone like you around."},{"name":"RESISTANCEOFFICER","text":"Once you're ready, have a word with your usual escort. I wish you all the best."},{"name":"CONVEYOR03783","text":"So, the boss roped you into helping, did he? I knew you couldn't say no!"},{"name":"Q3","text":"Travel to Terncliff?"},{"name":"AVILINA","text":"You... You're the one who piloted that warmachina and defeated the Sapphire Weapon, aren't you?"},{"name":"AVILINA","text":"(-Avilina-)I thought so. I have heard much about you, but I doubt you know who I am. My name is Avilina, and I grew up here. I stayed throughout the occupation and was put to work as a magitek engineer."},{"name":"AVILINA","text":"(-Avilina-)Thanks to you and yours, we are now rid of the imperials, though I fear many of us will struggle to put the past behind us."},{"name":"AVILINA","text":"(-Avilina-)For ten long years, we suffered at their hands. A whole generation of young people were forced into the army and sent off to die in some distant land."},{"name":"AVILINA","text":"(-Avilina-)I suppose I could be considered one of the lucky few. My work here kept me away from the battlefield, and I hoped that my contributions might help the others live long enough to make their way home. In the end, most of them never returned."},{"name":"AVILINA","text":"(-Avilina-)Though my efforts were in vain, I can at least honor their memory. I want to leave something behind for their sake, to prove that they haven't been forgotten. A monument bearing their names."},{"name":"AVILINA","text":"(-Avilina-)To ensure that not a single person is omitted, I'd need to see the official list of conscripts. If one still exists, it would be inside the imperial facility beneath the town, but with the Resistance troops and Ironworks engineers closing the place off, I can't get near it."},{"name":"AVILINA","text":"(-Avilina-)Perhaps you might have a word with them for me? I'll leave as soon as I find the list."},{"name":"AVILINA","text":"(-Avilina-)Thank you. I'll follow your lead."},{"name":"RESISTANCEOFFICER","text":"After ten years of imperial occupation, it's understandable that the recent liberation of Terncliff has had the effect of pulling the rug out from under their feet, regardless of how welcome the change may be."},{"name":"CONVEYOR03783","text":"Making your way back, then?"},{"name":"Q3","text":"Travel to Terncliff?"},{"name":"GSEMPLOYEE03981","text":"Greetings, <span class=\"highlight\">Forename</span>. It's a pleasure to finally meet you."},{"name":"GSEMPLOYEE03981","text":"Something I can help you with?"},{"name":"GSEMPLOYEE03981","text":"I see... It's a bit unusual for one of the locals to show an interest in the imperials' leavings, but it seems she has her reasons."},{"name":"GSEMPLOYEE03981","text":"Since we're still carrying out our investigations, we've closed the place off to prevent anyone interfering. Considering it's you who's asking, though, I can hardly say no."},{"name":"GSEMPLOYEE03981","text":"Still, I'd better go with her, in case the others kick up a fuss."},{"name":"AVILINA","text":"You're very kind."},{"name":"AVILINA","text":"I'm sorry for any trouble I've caused. You have my thanks."},{"name":"GSEMPLOYEE03981","text":"Think nothing of it. I was glad to help."},{"name":"AVILINA","text":"As I'd suspected, the imperials kept detailed records of the local conscripts. One name in particular stood out to me..."},{"name":"AVILINA","text":"My friend, Milisandia. I had no idea she'd been assigned to the VIIth Legion, of all places..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"How did you know her?"},{"name":"A1","text":"What do you mean “of all places”?"},{"name":"AVILINA","text":"It all began while we were serving together in the XIVth Legion. We had much in common, both being drafted from the same occupied territory, and we soon became firm friends. Then one day, she was sent to fight in Eorzea, while I remained here."},{"name":"AVILINA","text":"The day before she left, she came to say good-bye, together with her foster siblings from the orphanage."},{"name":"AVILINA","text":"The youngest one, Ricon, was particularly upset about not being allowed to speak with their adoptive father, Gaius van Baelsar, before they departed."},{"name":"AVILINA","text":"It was actually another of his orphans, Livia sas Junius, who forbid them from seeing him. I can't say for certain, but it seemed that Livia had a strong attachment to Gaius, and wouldn't let anyone else near him."},{"name":"AVILINA","text":"As far as I could tell, he tried his best to keep Livia at arm's length whenever possible. But her devotion to him was bordering on obsession, and she became extremely jealous at the slightest sign of affection between him and his other wards."},{"name":"AVILINA","text":"Others, however, treated them far more kindly. In fact, a praefectus castrorum of the XIVth Legion came specifically to meet them."},{"name":"AVILINA","text":"While I was surprised that a Roegadyn had risen to such a rank, I was even more taken aback by the unguarded manner in which he spoke with his subordinates. I had hoped that with people like him serving on the Eorzean front, they would be in safe hands."},{"name":"AVILINA","text":"Then, the time came for Milisandia to leave. We shared a few final words, and then she was gone. It would be the last I ever saw of her..."},{"name":"AVILINA","text":"After that, I was assigned to the tribunus laticlavius of the XIVth, Nero tol Scaeva, and I worked on restoring the Ultima Weapon. I was even at the Praetorium on the day it was destroyed, but I escaped aboard an imperial ship moments before it came crashing down."},{"name":"AVILINA","text":"I eventually made my way back to Werlyt, only to be drafted into the VIIth Legion to continue working on the Weapon project."},{"name":"AVILINA","text":"...Even now, it makes me sick to my stomach to think I'd helped bring those abominations into the world."},{"name":"AVILINA","text":"Using a living pilot to feed the Weapon's core was part of the design from the very beginning. Of course, they'd never dream of subjecting a trueborn Garlean to such barbaric treatment. Not when the VIIth Legion has a ready supply of provincial conscripts ripe for the taking."},{"name":"AVILINA","text":"The pilots were referred to only by their code names, and we engineers were not made privy to their true identities. Even with this list of conscripts, I still don't know who was sacrificed in the name of the Weapon project."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Your skills and knowledge can finally be put to good use."},{"name":"A2","text":"Let's bring an end to the Weapon project. Together."},{"name":"AVILINA","text":"But what can I do? For years, all I've known is how to build tools of destruction."},{"name":"AVILINA","text":"The VIIth Legion is far from finished. They're biding their time, waiting until the right moment to unleash the final Weapon."},{"name":"AVILINA","text":"And when they do, it will bring naught but death and woe to all who stand in their way. Even after everything they've taken from us, they still want more..."},{"name":"AVILINA","text":"If it weren't for the Empire, Milisandia would still be here... She was the kindest person I ever met, but to the Empire, she was just another pawn in their games. I will never forget her."},{"name":"AVILINA","text":"There's a way I can make a difference. I know there is."},{"name":"AVILINA","text":"But first, I need to speak with members of the Ironworks."},{"name":"AVILINA","text":"I've a feeling that warmachina you used to beat the Sapphire Weapon will be called into action again. Until then, there's still time to make improvements, and I intend to help."},{"name":"AVILINA","text":"I'll still be going ahead with the plan to build a monument, but stopping the Empire must come first. I hope Milisandia and the others can wait a little longer..."},{"name":"AVILINA","text":"Before I go, allow me to express my gratitude. I don't know what I'd have done if it weren't for you. Until we meet again."},{"name":"AVILINA","text":"I'll let you do the talking, if that's all right."},{"name":"RESISTANCEOFFICER","text":"So, how was your time in Terncliff?"},{"name":"RESISTANCEOFFICER","text":"I see... Fate has dealt her a cruel hand, but now she has a chance to make a fresh start. The same could be said of the whole of Terncliff."},{"name":"RESISTANCEOFFICER","text":"It seems the liberation of that one small town will become a pivotal moment in Werlyt's history. Perhaps it won't be too long before the rest of the region is free from the Empire."},{"name":"RESISTANCEOFFICER","text":"Naturally, we'd be honored to fight alongside the people of Werlyt. We won't rest until the imperials are sent fleeing with their tails between their legs."},{"name":"RESISTANCEOFFICER","text":"Until that day arrives, we'll carry on doing our bit to support you and the others in ending the Weapon project. I'll be sure to pass on any pertinent information. In the meantime, take care."}],"reward":{"gil":855},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69516]},"next":[69567]},"partials":[{"type":"npc","id":"1032586","obj":{"i":1032586,"n":"Resistance Officer","l":2408,"q":6}},{"type":"quest","id":"69516","obj":{"i":69516,"n":"Blood of Emerald","g":25,"l":"The Lochs","s":30,"f":1}},{"type":"quest","id":"69567","obj":{"i":69567,"n":"Duty in the Sky with Diamond","g":25,"l":"The Lochs","s":50,"f":1}}]}