{"quest":{"name":"Empty Promise","location":"Amh Araeng","id":69511,"patch":5.4,"sort":14,"icon":101031,"unlocksFunction":1,"eventIcon":71341,"issuer":1032590,"target":1034508,"genre":23,"journal":["Yalfort is so engrossed in the slip of paper in his hands that he barely notices your approach. Do try not to startle him.","Though it may seem that Yalfort never budges from his usual spot, he assures you that he has been busy preparing for your next expedition into the Empty. Ryne and Gaia then make a timely appearance and regale you with tales of their activities in the Crystarium, which range from fairly constructive to...eating biscuits. There will, however, be ample time for further discussion aboard the skyslipper, which is ready and waiting at the Derrick.","Upon arrival at the outpost, Gaia rather uncharacteristically offers to help by piloting the skyslipper. It appears that during her time in the Crystarium, she has learned not only to control this complex, shoe-like craft, but she has also gained a degree of consideration for others. You had best hop aboard before she changes her mind.","The long and normally dreary voyage across the Empty is made far more pleasant by lively conversation. Sadly, this buoyant mood is short-lived as you are met with an unwelcome sight when you reach your destination. The once-lush and verdant plant life is drained of color and vitality, much to your dismay. The crystal that towers about the camp has taken on an ominous, white glow, indicating that the balance between Darkness and Light has shifted in favor of the latter. Suddenly, Gaia clutches her head, and it becomes all too clear that her ordeal is far from over."],"objectives":["Speak with Ryne at the Derrick.","Speak with Gaia at the Derrick."],"dialogue":[{"name":"YALFORT","text":"<span class=\"highlight\">Forename</span>! So the rumors of your knack for being in the right place at the right time are true! You see, we've just completed our preparations for another expedition into the Empty."},{"name":"YALFORT","text":"Miss Ryne and Miss Gaia agree that it's high time you all went to see how things are coming along. Though I must say, being at their beck and call night and day does test my patience on occasion."},{"name":"GAIA","text":"(-???-)Well, well. Fancy seeing you here."},{"name":"RYNE","text":"<span class=\"highlight\">Forename</span>!"},{"name":"RYNE","text":"We were just getting ready for another ride on the skyslipper. Care to join us?"},{"name":"YALFORT","text":"There was one other thing I should mention before you depart. Now that the situation in Eulmore has settled down somewhat, my associates have made some headway in investigating your past, Miss Gaia."},{"name":"GAIA","text":"...Is that so?"},{"name":"RYNE","text":"Hmm? I thought that's what you wanted."},{"name":"GAIA","text":"So did I. But I quite like the way things are now. Digging around in my past might...I don't know, spoil it somehow."},{"name":"GAIA","text":"Besides, uncovering the truth behind the voice in my head and my strange powers is bound to be more interesting than whatever life it was I had in Eulmore."},{"name":"RYNE","text":"I understand. We'll find the answers. Together. Just like we do everything else."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Did you make that necklace?"},{"name":"A1","text":"How were the coffee biscuits?"},{"name":"GAIA","text":"You mean from the ice crystal we found after the battle? I was sure it would've melted by now, but it seems Ryne was right."},{"name":"GAIA","text":"And yes, we had it made into a necklace. She insisted that I have it, even though it doesn't suit me at all. Still, I suppose it makes a nice memento, so I keep it somewhere safe."},{"name":"RYNE","text":"Oh, come on, Gaia! It'd look lovely on you! Wait...you're not embarrassed to wear it, are you?"},{"name":"GAIA","text":"Don't be silly, of course I'm not! In any case, I wouldn't want to lose it while we're in the Empty. Unlike the coffee biscuits you've brought along, I can't just go and buy another one."},{"name":"RYNE","text":"Ah! They were supposed to be a surprise for <span class=\"highlight\">Forename</span>!"},{"name":"RYNE","text":"Oh, they were delicious, as always! But I hear they're quite fattening, so we usually just buy one and have half each."},{"name":"GAIA","text":"And then you always get another one anyway."},{"name":"RYNE","text":"Yes, but we break that in half too, so it's fine."},{"name":"GAIA","text":"Then we may as well have one each to begin with! Honestly, Ryne, I sometimes wonder if you've got biscuits for brains."},{"name":"GAIA","text":"Though I must say, my time in the Crystarium has been rather enjoyable. We even had a chance to make a necklace from the ice crystal we found."},{"name":"RYNE","text":"And in case you were wondering, I haven't been neglecting my training. I wouldn't want my skills to get rusty just because Thancred's not around. I'm ready for whatever lies ahead!"},{"name":"GAIA","text":"Urianger would also be pleased to hear you've had your head in those fusty old tomes. I've even done a bit of studying myself. After all, it's up to us to take care of the Empty now."},{"name":"RYNE","text":"I'm looking forward to seeing how things have changed since our last visit. Come on, let's head over to the Derrick."},{"name":"YALFORT","text":"I'm hoping that one of these days <span class=\"emphasis\">I'll</span> be allowed to visit the Empty and see those remarkable changes for myself. It seems like a fair reward for all my hard work!"},{"name":"GAIA","text":"This time, those giant ant things had the good sense to leave us alone on our way here. Seems they've learned their lesson."},{"name":"RYNE","text":"I don't suppose you fancy taking the helm this time?"},{"name":"GAIA","text":"Wait. I'll pilot this time."},{"name":"RYNE","text":"Oh? I didn't realize you knew how!"},{"name":"GAIA","text":"While you were off training, I was practicing with another skyslipper they have at the Crystarium."},{"name":"RYNE","text":"Really? That's fantastic!"},{"name":"GAIA","text":"Hardly. You've been pulling more than your own weight, and I just wanted to do what I can to contribute more."},{"name":"GAIA","text":"So you two can sit back, relax, and leave it to me."},{"name":"RYNE","text":"Well, Gaia certainly kept that quiet! She's just full of surprises, isn't she?"},{"name":"GAIA","text":"There's no need to look so apprehensive, you know. Let's get going, shall we?"},{"name":"RYNE","text":"It's so strange suddenly seeing you at the controls. Why didn't you tell me you'd been practicing?"},{"name":"GAIA","text":"I thought I'd surprise you, that's all."},{"name":"RYNE","text":"Well, consider me surprised. All this time, I thought you were only good for smashing things with your hammer."},{"name":"GAIA","text":"Hmph! Bring that up again and you can walk the rest of the way."},{"name":"RYNE","text":"Hehe, I'd best behave. I wouldn't want to get stranded in the Empty and miss the festival."},{"name":"RYNE","text":"Ah, I suppose this is the first you would've heard of it. We haven't exactly been keeping it a secret, but it's still in the planning stages."},{"name":"RYNE","text":"You see, the return of the night sky has brought lots of changes. And while everyone is glad, the reality is it's also been quite stressful, having to adapt to a new way of life."},{"name":"RYNE","text":"Seeing how hard our elders are working to keep the Crystarium running, youths like myself came up with the idea of hosting an event as way of expressing our appreciation."},{"name":"RYNE","text":"Once we return from the Empty, I'll be helping as one of the organizers."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I'd be happy to help─provided I'm suitably compensated."},{"name":"A2","text":"I'd offer to help, but I think you have everything well in hand."},{"name":"RYNE","text":"Haha, I doubt we could afford the services of a great hero such as you, but thanks for offering. If everything goes well, all you'd need to do is turn up and enjoy yourself!"},{"name":"RYNE","text":"I wouldn't be so sure about that...but I'd try my best to make it a success. If everything goes well, all you'd need to do is turn up and enjoy yourself!"},{"name":"RYNE","text":"How about you, Gaia? Would you like to help with the festival?"},{"name":"GAIA","text":"Wh-What's that? I...er, haven't been listening."},{"name":"GAIA","text":"My...ah...leg is cramping up a bit. Piloting this thing must've made me more tense than I'd realized."},{"name":"RYNE","text":"Then let one of us take over!"},{"name":"GAIA","text":"No, I'll be fine."},{"name":"RYNE","text":"Well, as long as you're sure. But if you feel like switching places, just say the word."},{"name":"RYNE","text":"No... How can this be?"},{"name":"GAIA","text":"I think <span class=\"emphasis\">that</span> explains it..."},{"name":"RYNE","text":"Light... Does this mean there's still too much of it in the Empty?"},{"name":"GAIA","text":"Hmm... I'm no expert, but this might be a result of losing control when you restored the ice element. Even though I tried to use Darkness to hold back the Light spilling forth, it seems it wasn't enough."},{"name":"RYNE","text":"Then we're right back to where we started. This is all my fault..."},{"name":"GAIA","text":"No, Ryne. You mustn't blame yourself."},{"name":"GAIAVOICE","text":"You have returned to me!"},{"name":"GAIA","text":"Unnngh..."},{"name":"GAIAVOICE","text":"Restore the Darkness, while you still can!"},{"name":"GAIA","text":"A familiar voice, an inescapable fate.<br>The promise of salvation at the precipice of ruin."},{"name":"GAIA","text":"In the remnants of a lost past, I would find my truth."}],"reward":{"gil":3000,"items":[{"num":2,"id":25197,"one":1},{"num":2,"id":25198,"one":1},{"num":2,"id":25190,"one":1},{"num":2,"id":25186,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"questsType":"all","quests":[69329,69318]},"next":[69512]},"partials":[{"type":"npc","id":"1032590","obj":{"i":1032590,"n":"Yalfort","l":2955,"q":3}},{"type":"npc","id":"1034508","obj":{"i":1034508,"n":"Gaia","l":2955,"q":1}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"quest","id":"69329","obj":{"i":69329,"n":"Worlds Apart","g":23,"l":"Amh Araeng","s":13,"f":1}},{"type":"quest","id":"69318","obj":{"i":69318,"n":"Reflections in Crystal","g":9,"l":"The Crystarium","s":320}},{"type":"quest","id":"69512","obj":{"i":69512,"n":"Fear of the Dark","g":23,"l":"The Empty","s":15,"f":1}}]}