{"quest":{"name":"Where I Belong","location":"The Empty","id":69515,"patch":5.4,"sort":18,"icon":101032,"unlocksFunction":1,"eventIcon":71341,"issuer":1034522,"target":1032715,"genre":23,"journal":["By the look on her face, Ryne can scarce believe that the Empty is restored.","Surrounded by an abundance of verdant flora, Ryne and Gaia celebrate the fulfillment of their dream to revive the Empty. Exhausted from their efforts, Ryne suggests returning to Mord Souq for some long-overdue rest and relaxation.","After alighting from the skyslipper by the Derrick, Gaia ponders the idea of acquiring a hovering transportation device of her own. For the time being, however, your only option is to make the rest of the journey to Mord Souq on foot, where Yalfort awaits your report.","Yalfort is delighted to hear that your work in the Empty has yielded the desired results. He also reveals that the investigations into Gaia's past in Eulmore have been successful. However, she is quick to state that she has no desire to learn more about that chapter of her life, instead choosing to focus on building a brighter future in the Crystarium with Ryne. Though none can say what the morrow holds, you rest easy in the knowledge that these two dear friends will surely make the most of their lives."],"objectives":["Speak with Gaia at the Derrick.","Speak with Yalfort."],"dialogue":[{"name":"GAIA","text":"I'm thrilled that we've been able to restore the Empty, but I can't stop thinking about Mitron and Loghrif. It seems to me that they were only bound to their duty because of their memories."},{"name":"GAIA","text":"It seems that there's something within that doesn't want to be forgotten. Their souls live on, no matter how many times they go through the cycle of death and rebirth."},{"name":"GAIA","text":"I wonder what their lives would've been like if they'd never remembered, and had carried on living amongst us mortals. Then again, I suppose I <span class=\"emphasis\">am</span> Loghrif, in a way, but still me."},{"name":"RYNE","text":"I still can't believe this is happening─it's a dream come true!"},{"name":"RYNE","text":"I just wish the others were here to see it."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll be sure to tell them all about it."},{"name":"A1","text":"Perhaps Gaia could pay them a visit and share the good news?"},{"name":"RYNE","text":"Yes, I suppose that's the next best thing. Hold on─you might even be able to take something with you to show them!"},{"name":"RYNE","text":"I'll bet the fruit that grows here could be used to make all sorts of delicious treats!"},{"name":"GAIA","text":"You could even make something yourself, Ryne."},{"name":"RYNE","text":"That's a great idea, but my cooking can be a bit hit-or-miss... Maybe once we get back to the Crystarium, I'll ask for some advice!"},{"name":"RYNE","text":"Gaia? But how would she do that?"},{"name":"GAIA","text":"Well, Ascians can travel between worlds, can't they?"},{"name":"GAIA","text":"I might be able to do it, too, if I find a way to use my Ascian powers. It may prove a bit tricky now that I'm separated from Mitron, though."},{"name":"RYNE","text":"Well, to be honest, I'd like it if you stay in this world, at least for a while. We still have so much to do together, after all!"},{"name":"GAIA","text":"Actually, I wanted to ask something. When you say “the others,” do you mean Thancred, the bookworm, and Urianger, your knight in shining armor?"},{"name":"RYNE","text":"Haha! No, it's the other way around!"},{"name":"GAIA","text":"Oh, is it? Hmm, seems my memory's even less reliable than it was before."},{"name":"GAIA","text":"The main thing is, the whispering in my head has stopped, so I shouldn't have any more bouts of amnesia. Even so, there's a part of me that'll miss hearing the faerie's voice..."},{"name":"RYNE","text":"I know how you feel, Gaia. Anyway, we've all been through rather a lot, so why don't we head back to civilization for some much-needed rest?"},{"name":"GAIA","text":"All right. Leave the piloting to me!"},{"name":"RYNE","text":"I know she insisted on piloting the skyslipper, but given her recent exertions, perhaps it wasn't such a good idea?"},{"name":"GAIA","text":"I understand that keeping the skyslipper here allows us to save fuel from traveling all the way back to Mord Souq, but can't we just carry a bit extra? It's not easy crossing the desert in these heels, you know."},{"name":"RYNE","text":"I seem to remember you weren't too enthused when I suggested buying some nice, sensible walking boots... Come to think of it, maybe we should rest here for a while. You must be tired after all that piloting."},{"name":"GAIA","text":"I'm fine. Besides, I had the two of you to keep me company. It was over before I knew it."},{"name":"GAIA","text":"Taking in the scenery with the wind in my hair really helped clear out the cobwebs, too. Perhaps I should see about getting my very own skyslipper..."},{"name":"RYNE","text":"What!? You can't just buy one! Even if you could, they'd cost a fortune!"},{"name":"GAIA","text":"Oh, I'm sorry. That must be my Eulmoran upbringing speaking. I'll have you know, I'm <span class=\"emphasis\">almost</span> as comfortable in more humble surroundings, like Mord Souq, for example. That reminds me, it's time we made our way there and told Yalfort all about...well, everything."},{"name":"RYNE","text":"After all of the unimaginable things we've seen in the Empty, it's nice to get back to a bit of normality for a change."},{"name":"GAIA","text":"I'll say one thing for this place: for better or worse, I'll never forget the smell."},{"name":"YALFORT","text":"Welcome back! I take it all is well in the Empty?"},{"name":"RYNE","text":"It is now! Not everything went quite as we'd planned─to put it mildly─but we managed to revive the ambient aether. Now all we need to do is wait for the changes to become widespread."},{"name":"YALFORT","text":"Truly!? Wonderful! Just wonderful! I shall share the tidings with our inner circle...and perhaps it is time more people knew of your expeditions as well."},{"name":"YALFORT","text":"Of course, we'll continue to monitor the situation, but I'm sure it won't be long before we can allow members of the citizenry to make their own forays into the Empty."},{"name":"YALFORT","text":"I'm pleased to say that I too have some good news to share. Our investigators in Eulmore have finally found information pertaining to Gaia's true identity!"},{"name":"RYNE","text":"Really!?"},{"name":"YALFORT","text":"As it pertains to matters of a private nature, the information is being treated as highly confidential, so I haven't actually looked at it myself, but I imagine it includes Gaia's real name..."},{"name":"GAIA","text":"To be honest, I'd prefer not to know."},{"name":"RYNE","text":"But why?"},{"name":"GAIA","text":"You see, I've come to learn a lot about my past, even before my life in Eulmore."},{"name":"GAIA","text":"I know now that I'm the reincarnation of Loghrif, an Ascian. And Mitron, the one who was transformed into Eden...was someone very special to me."},{"name":"GAIA","text":"For a hundred years, Mitron called out to me in the hope we'd be reunited. But there was no answer."},{"name":"GAIA","text":"Even so, Mitron held on to those precious memories of our life together, and stopped at nothing to make them a reality once more."},{"name":"RYNE","text":"I know now that Mitron wanted the same as us. Wanted the world to be as it once was."},{"name":"GAIA","text":"Yes. It's a shame that things turned out the way they did. In those hundred years of solitude, that dream became an obsession."},{"name":"GAIA","text":"I would've likewise succumbed to the Darkness within if it weren't for Ryne and <span class=\"highlight\">Forename</span>. If someone had also been there for Mitron, who knows what might've happened?"},{"name":"GAIA","text":"That's why, from now on, I want to help those in need, to give <span class=\"emphasis\">their</span> dreams a chance to come true."},{"name":"GAIA","text":"For me, the name Gaia symbolizes hope. And though each of our lives may be but a drop in the great river of time, hope springs eternal."},{"name":"RYNE","text":"Gaia..."},{"name":"GAIA","text":"So...I'm sorry. While I appreciate your efforts to find my past, I'm looking to the future now. As Gaia."},{"name":"YALFORT","text":"No need to apologize, Miss Gaia. As long as you are happy, then so are we!"},{"name":"YALFORT","text":"Right, I expect my colleagues will be keen to turn their attention to the Empty. If you'll excuse me, I have expeditions to arrange! Till next time!"},{"name":"RYNE","text":"So, what shall we do now?"},{"name":"GAIA","text":"Come on, Ryne. Don't tell me you've forgotten."},{"name":"GAIA","text":"The festival at the Crystarium, remember? And don't even think about leaving me out. I wouldn't miss it for the world!"}],"reward":{"gil":7500,"items":[{"num":3,"id":25187,"one":1},{"num":3,"id":25188,"one":1},{"num":3,"id":25189,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69514]}},"partials":[{"type":"npc","id":"1034522","obj":{"i":1034522,"n":"Ryne","l":3225,"q":1}},{"type":"npc","id":"1032715","obj":{"i":1032715,"n":"Yalfort","l":2955,"q":2}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"69514","obj":{"i":69514,"n":"Voice of the Soul","g":23,"l":"The Core","s":17,"f":1}}]}