{"quest":{"name":"Voice of the Soul","location":"The Core","id":69514,"patch":5.4,"sort":17,"icon":112411,"unlocksFunction":1,"eventIcon":71341,"issuer":1034519,"target":1034521,"genre":23,"journal":["Ryne is racked with agony as unseen tendrils grasp at her memories.","The entity formed by the fusion of Mitron and Gaia reaches into Ryne's mind, drawing on her greatest hopes and fears. The Ascian intends to shape these memories into an adversary created solely to destroy you and Ryne. Though it is impossible to predict the form your foe will take, you grit your teeth and prepare for battle.<br><br>※Eden's Promise: Anamorphosis can be accessed via the Duty Finder.","The grueling encounter reaches its conclusion as you triumph over the terrifying amalgamation of Ryne's most profound memories. What effect, if any, your victory may have had remains to be seen.","The fused Ascian is nigh on delirious upon discovering that such imperfect beings could succeed where the ancients once failed, by overcoming the manifestation of your own fears. As your foe moves to strike you down, Gaia's consciousness intervenes, forestalling the attack. This, however, only serves to enrage the Ascian, who begins to erase Gaia's memories one by one. Your adversary then proceeds to draw vast amounts of aether into Eden in order to create a utopia in which time has no meaning. The Ascian then disappears, though neither you nor Ryne intend to abandon Gaia to her fate. Ryne exerts her control over Eden, disrupting the aetherial flow, granting you an opportunity to give chase.<br><br>※Eden's Promise: Eternity can be accessed via the Duty Finder.","You withstand a relentless assault and finally succeed in freeing Gaia from Mitron. Though she appears physically unscathed by her ordeals, she remains unconscious, leaving Ryne visibly concerned.","Ryne's desperate attempts to wake Gaia are to no avail. For want of any better ideas, you decide to call her name in the hope that she will return to her senses.","Calling out to Gaia fails to have any discernible effect, but all is not lost. The ice crystal necklace that was previously concealed in Gaia's sleeve begins to glow, and Ryne is certain that it can somehow be used to reach out to your comatose friend.","At long last, Gaia awakens, greeted by the sight of the Empty flourishing with the bounties of nature. While Ryne is ecstatic to have fulfilled her dream of rejuvenating the once-barren wasteland, you sense that it is the safe return of her dear friend that means the most to her."],"objectives":["Enter Eden's Promise: Anamorphosis.","Enter Eden's Promise: Eternity.","Speak with Ryne.","With the chat mode in <span class=\"highlight\">Say</span>, enter “Gaia” to call out to her.","Speak with Ryne."],"dialogue":[{"name":"RYNE","text":"No... My memories... They're being used to fuel a summoning!"},{"name":"RYNE","text":"Unnnh... Is this how it feels to have the faerie inside my mind? To think Gaia had to endure it for so long..."},{"name":"RYNE","text":"You're right. However bad this is, it's nothing compared to what she's going through now."},{"name":"RYNE","text":"But if the summoning really is based on my hopes and fears, it will most likely create a foe unlike any you've ever fought before."},{"name":"RYNE","text":"Whatever it may be, I believe in you! We'll find a way through this, I know it!"},{"name":"RYNE","text":"While it seems that the summoning will be based on my memories, I still have no idea what form it will take."},{"name":"RYNE","text":"Remember, it's all an Ascian ploy, so don't let yourself be fooled! Please, just do what you have to do. I'm sure you're more than a match for whatever Mitron has in store!"},{"name":"RYNE","text":"So this is the way of the Ascians? To use the memories of our loved ones against us?"},{"name":"GAIAPRIME","text":"That fragmented souls should triumph over their fears while we succumbed to ours, thereby setting our star upon a course of ruin..."},{"name":"GAIAPRIME","text":"That inferior beings such as you should succeed while we failed! It defies all logic!"},{"name":"GAIA","text":"Now's your chance!"},{"name":"RYNE","text":"Gaia's still in there, fighting to free herself from Loghrif's will!"},{"name":"GAIAPRIME","text":"Even now, you would defy us!?"},{"name":"GAIAPRIME","text":"We will remove every last vestige of your meaningless mortal existence!"},{"name":"RYNE","text":"Gaia's memories! They're being destroyed!"},{"name":"GAIAPRIME","text":"Impurities must be purged. We shall begin by erasing you from her past, and then by your deaths, erase you from her future. There is no place for you in our utopia."},{"name":"RYNE","text":"We may be mere mortals, our souls fragmented, but our existence is not meaningless!"},{"name":"RYNE","text":"And you should understand this! Before you awoke as an Ascian, you lived as one of us!"},{"name":"RYNE","text":"You had your own memories, and surely they mean something? The lives you led can't all have been for nothing!"},{"name":"GAIAPRIME","text":"To we who have known perfection, they are less than nothing."},{"name":"RYNE","text":"Compared to yours, our lives may seem insignificant."},{"name":"RYNE","text":"Nevertheless, we live them to the fullest! And though it may take us a thousand years, we have the potential to build a world every bit as wonderful as yours!"},{"name":"RYNE","text":"But you won't even allow us a chance? To live our own lives and forge our own future?"},{"name":"GAIAPRIME","text":"Whatever you forge will inevitably crumble to dust. But we are immortal, our legacy eternal. If our world cannot be made complete as it once was, we will create a perfect moment that shall last forever."},{"name":"GAIAPRIME","text":"By our hand shall our paradise be made, where there is no beginning and no end."},{"name":"RYNE","text":"Eden's absorbing enormous amounts of aether! At this rate, the whole world will be drained!"},{"name":"GAIAPRIME","text":"Light and Darkness, the elements of nature, all in harmony. A sublime utopia, where time has no meaning."},{"name":"GAIAPRIME","text":"We shall become one with Eden. Free to live in peace for eternity."},{"name":"RYNE","text":"No! Gaia!"},{"name":"RYNE","text":"There's only one thing for it. I'll try to disrupt the balance of aether and create an opening for you!"},{"name":"RYNE","text":"We can't let it end like this. It's up to us to save Gaia!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Mitron won't get away with this."},{"name":"A1","text":"It's all about love, friendship, and courage!"},{"name":"RYNE","text":"A place where time has no meaning, where there is no beginning and no end... I'm not sure I like the sound of that. We all die someday, but that's what makes life so precious!"},{"name":"RYNE","text":"And I know that Gaia wouldn't want that, to simply <span class=\"emphasis\">exist</span> without any hope for the future, to stay the same forever."},{"name":"RYNE","text":"How she lives is up to her. It's not for Mitron or anyone else to decide. We'll free her from that fiend and give her the chance she deserves!"},{"name":"SYSTEM","text":"Though Gaia is now free from Mitron, she remains unconscious."},{"name":"SYSTEM","text":"The aetheryte shard is not responding."},{"name":"RYNE","text":"We did it! She's free at last! Or at least that's how it seems. She won't wake up..."},{"name":"RYNE","text":"Gaia, I don't know if you can hear me, or if you even remember who I am, but just give me a sign that you're all right. Please, say something, anything!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"She can hear you, Ryne. Keep trying!"},{"name":"A2","text":"You've brought her back once before, you can do it again!"},{"name":"RYNE","text":"You're right, <span class=\"highlight\">Forename</span>. I mustn't lose hope!"},{"name":"RYNE","text":"Wait, what's this?"},{"name":"RYNE","text":"It's the necklace! But she said she left it back in the Crystarium..."},{"name":"RYNE","text":"Maybe she likes it a lot more than she lets on. I suppose it does hold a lot of memories for the both of us.<br>...Wait─there might be a way we can use this to bring her back!"},{"name":"SYSTEM","text":"Try calling Gaia's name to help bring her back to her senses."},{"name":"RYNE","text":"I'm not sure how to reach her, but if she remembers the necklace, maybe she'll find her way back to us!"},{"name":"SYSTEM","text":"Though Gaia appears unharmed, her consciousness has yet to return."},{"name":"SYSTEM","text":"With the chat mode in <span class=\"highlight\">Say</span>, use your keyboard or the software keyboard to enter “Gaia” to call out to her."},{"name":"RYNE","text":"Gaia! We're right here beside you! Come back to us!"},{"name":"SYSTEM","text":"The necklace begins to glimmer faintly..."},{"name":"SYSTEM","text":"You can only hope that Gaia is able to hear your voice."},{"name":"RYNE","text":"She can hear us, I know she can! Now, all we can do is pray that she'll return..."},{"name":"RYNE","text":"Gaia, I know you're in there somewhere."},{"name":"RYNE","text":"If you're lost, I'll find a way to reach you!"},{"name":"RYNE","text":"I swear it!"},{"name":"GAIA","text":"Where am I...?"},{"name":"GAIA","text":"Mitron... I'm finally free of you, it seems."},{"name":"MITRON","text":"Ah, dearest Gaia... That fate should part us once more..."},{"name":"GAIA","text":"Still, this is what you wanted. There's no need to be quite so upset."},{"name":"MITRON","text":"What do you mean?"},{"name":"GAIA","text":"You've been released from Eden, free to be reborn. Perhaps one day, fate will bring us together again, in another life."},{"name":"GAIA","text":"After all, you've already found me once, in spite of everything."},{"name":"GAIA","text":"I might even be the one to find you."},{"name":"MITRON","text":"I fear you will come to forget me. To forget the times we shared."},{"name":"GAIA","text":"Perhaps. After all, memories are such fragile things..."},{"name":"GAIA","text":"That's why I'm planning to keep a diary. Even after I'm gone, my memories will live on."},{"name":"MITRON","text":"For future generations to discover..."},{"name":"GAIA","text":"Yes. They'll read the tale of the girl bound by duty, and of her loyal protector, arrived in her hour of need."},{"name":"MITRON","text":"Perhaps you might leave out the part where that “protector” was the one who needed saving. You have grown strong, Gaia."},{"name":"GAIA","text":"If I'd found you sooner, then maybe...!"},{"name":"GAIA","text":"No, wait! Don't leave me!"},{"name":"GAIA","text":"Until we meet again, Artemis."},{"name":"GAIA","text":"Hm? Whose name did I just..."},{"name":"GAIA","text":"Well, never mind that for now. I need to get out of here...wherever here is."},{"name":"GAIA","text":"I feel as though there's somewhere I'm supposed to be, but I can't for the life of me remember where."},{"name":"GAIA","text":"What's this?"},{"name":"GAIA","text":"Is this...ice? It certainly looks like it, but it doesn't seem to melt. And it shines so brightly..."},{"name":"GAIA","text":"I've seen this before..."},{"name":"GAIA","text":"That's it! There was a girl... But what was her name?"},{"name":"GAIA","text":"Ryne?"},{"name":"RYNE","text":"Gaia!"},{"name":"GAIA","text":"Ryne!"},{"name":"RYNE","text":"I can hear you!"},{"name":"GAIA","text":"I can't find my way out of here!"},{"name":"RYNE","text":"Hold on! I'm coming for you!"},{"name":"RYNE","text":"You remembered!"},{"name":"GAIA","text":"...I could never forget you. Try as I might."},{"name":"GAIA","text":"So the aether that Eden had absorbed was returned to the land. Now, just like Mitron, the Empty can finally be reborn."},{"name":"RYNE","text":"Though it can hardly be called the Empty now. It's...a utopia."},{"name":"SAYTODO","text":"Gaia"}],"reward":{"gil":3000,"items":[{"num":3,"id":25187,"one":1},{"num":3,"id":25188,"one":1},{"num":3,"id":25189,"one":1}],"instance":30103},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69513]},"next":[69515]},"partials":[{"type":"npc","id":"1034519","obj":{"i":1034519,"n":"Ryne","l":3214,"q":1}},{"type":"npc","id":"1034521","obj":{"i":1034521,"n":"Ryne","l":3225,"q":1}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"instance","id":"30101","obj":{"i":30101,"n":"Eden's Promise: Anamorphosis","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":485}},{"type":"instance","id":"30103","obj":{"i":30103,"n":"Eden's Promise: Eternity","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":485}},{"type":"quest","id":"69513","obj":{"i":69513,"n":"Shadows of the Past","g":23,"l":"The Empty","s":16,"f":1}},{"type":"quest","id":"69515","obj":{"i":69515,"n":"Where I Belong","g":23,"l":"The Empty","s":18,"f":1}}]}