{"quest":{"name":"Shadows of the Past","location":"The Empty","id":69513,"patch":5.4,"sort":16,"icon":112409,"unlocksFunction":1,"eventIcon":71341,"issuer":1034514,"target":1034518,"genre":23,"journal":["Gaia is more than a little vexed that your last outing did not result in greater changes in the Empty.","The flora of the Empty still shows little sign of returning to life in spite of your recent efforts in rebalancing the ambient aether. Suddenly, an Ascian appears before you and claims to be Mitron. After being defeated by Ardbert and the other Warriors of Light a hundred years ago, the Ascian was transformed into Eden and unleashed the Flood of Light. Your attempts to revive the Empty had actually served to weaken the bonds of Light that once held Mitron, who is now capable of far more than simply whispering to Gaia as the voice in her head. However, before you are able to unravel any of the mysteries that yet remain, the servant of Zodiark retreats to Eden's core, inviting you all to follow if you wish to learn more.","In addition to the sudden appearance of an Ascian, another worrying problem presents itself: the worsening of Gaia's amnesia. She now has no recollection whatsoever of Thancred and Urianger, and it seems to be more than mere coincidence that this has occurred alongside Mitron's arrival. In the hope of preventing any further memory loss, you resolve to make your way to Eden's core, aware that you may very well be walking into a trap.","You arrive in Eden's core, where Mitron states that you will reenact the climactic encounter that took place a hundred years ago between the Warriors of Light and the Shadowkeeper. This appears to be an elaborate scheme to awaken Gaia's dormant memories, though the Ascian provides no hint as to how she is connected to events that occurred long before her birth. Gaia herself vehemently refuses to cooperate in any such plan, which succeeds only in sending the Ascian into a blind rage, culminating in Gaia being spirited away by arcane magicks. Mitron issues a final challenge to defeat the Shadowkeeper, then vanishes from sight.","With Gaia at Mitron's mercy, you have no choice but to obey. Ryne agrees that although the situation is dire, there may yet be an opportunity to rescue her. However, you must first confront the stygian foe that Ardbert and his comrades once vanquished, taking on the role of a Warrior of Light from days past.<br><br>※Eden's Promise: Litany can be accessed via the Duty Finder.","After a hard-fought struggle, you finally overcome the ferocious Shadowkeeper. Upon being transported back to Eden's core, you are surprised to see that Gaia has also returned, seemingly none the worse for wear.","There appears to have been some truth in Mitron's claims that reenacting the battle fought by the Warriors of Light would restore Gaia's memories. She cannot escape the feeling that she has somehow witnessed these events before, a phenomenon that the Ascian is only too glad to elucidate. A hundred years ago, Mitron and Loghrif were tasked with carrying out Emet-Selch's plan to flood the world with Light and thus trigger a Rejoining, only to be defeated by Ardbert and his companions. Though the two Ascians had combined their strength by merging into a single entity, Ardbert's Light-infused final blow shattered the bonds that held them together, destroying Loghrif instantly. Mitron, however, was engulfed in Light before being able to escape to the void, and was transformed into Eden, the first sin eater, and thereby causing the Flood of Light. In the years that followed, Mitron remained trapped within Eden, desperately calling out to Loghrif, who had since been reborn. It is then that the Ascian reveals the awful truth: that Gaia is the reincarnation of Loghrif.<br><br>Nevertheless, Gaia is determined to defy the attempts to revive her Ascian consciousness. Since she will not willingly conform, Mitron instead employs dark magicks to merge with her once more, one in body and soul. Though you and Ryne are resolved to free Gaia at all costs, Ryne's mind is assaulted as the fused Ascian seeks to turn her own memories against her."],"objectives":["Speak with Ryne.","Enter Eden's core.","Speak with Ryne.","Enter Eden's Promise: Litany.","Speak with Ryne."],"dialogue":[{"name":"RYNE","text":"I'm still not sure what that enormous crystal actually does, or why it changes color. But I'm sure it didn't look like that before."},{"name":"SYSTEM","text":"You had best speak with Gaia first..."},{"name":"GAIA","text":"We tipped the scales away from the Light, I'm sure of it. But something's wrong─<span class=\"emphasis\">very</span> wrong."},{"name":"GAIAVOICE","text":"For a hundred long years, I have waited for this moment!"},{"name":"GAIA","text":"I knew it! You've been hiding inside Eden all this time!"},{"name":"RYNE","text":"An Ascian!"},{"name":"MITRON","text":"I am Mitron, servant of Zodiark."},{"name":"GAIA","text":"The voice that has whispered to me all my life..."},{"name":"MITRON","text":"Indeed... And thanks to you, I am all but free from my prison of Light!"},{"name":"RYNE","text":"Does that mean Eden was used to seal away an Ascian?"},{"name":"RYNE","text":"Wait... That <span class=\"emphasis\">is</span> Eden! An Ascian transformed into a sin eater!"},{"name":"GAIA","text":"Hmph. I've heard enough about Ascians to know they're nothing but trouble. But I never imagined that one of them was behind all this..."},{"name":"GAIA","text":"I thought that restoring the Darkness was my idea, but this was your plan from the very beginning!"},{"name":"MITRON","text":"It was. But all it took was the slightest suggestion. The rest was entirely your own doing."},{"name":"MITRON","text":"Ah... My freedom is so close, I can almost taste it... Finally, my soul may journey beyond the flesh to which I am yet bound."},{"name":"MITRON","text":"I knew you would come for me, Gaia."},{"name":"GAIA","text":"Hmph, don't flatter yourself. You've caused me nothing but pain. If I've helped you, it wasn't intentional."},{"name":"MITRON","text":"Even now, your memories elude you. Hearken unto me, Gaia, and remember..."},{"name":"MITRON","text":"In an age past, the world you know as the Thirteenth was flooded by Darkness. Like ripples in water, the repercussions were felt in the other shards, none more so than here on the First. It became perilously imbalanced and susceptible to the influence of Light."},{"name":"MITRON","text":"Were Light to consume the First as Darkness did the Thirteenth, it would likewise become a lifeless void, lost to our cause. We could not allow this mistake to be repeated. It was our duty to safeguard this world from the selfsame fate."},{"name":"MITRON","text":"After a time, Emet-Selch conceived of a plan to trigger a Rejoining, utilizing the very Light we had labored to keep in check, and tasked us with bringing the plan to fruition."},{"name":"MITRON","text":"But at the last, we were thwarted by Ardbert and his companions. Though our resolve was strong, theirs was stronger still. And as we fell, so too was the Light unleashed."},{"name":"MITRON","text":"For us, however, death is not the end. Though our bodies may perish, our souls live on, withdrawing but temporarily to the rift."},{"name":"RYNE","text":"Until you can find a new body to possess..."},{"name":"MITRON","text":"I too would have been reborn. But ere my soul could leave its corporeal form, Ardbert struck me with a blade of purest Light. And that Light enveloped my body, twisting it beyond recognition."},{"name":"GAIA","text":"Eden...the first sin eater."},{"name":"MITRON","text":"My soul felt such agony as I had never known...and then I knew no more."},{"name":"MITRON","text":"In my insensate, instinctive state, influenced by Ardbert's fervent desire to banish Darkness, I unleashed the Light burgeoning within me. And it spread as an all-consuming wave to every corner of the world."},{"name":"RYNE","text":"The Flood of Light... So, that's how sin eaters came to be..."},{"name":"MITRON","text":"All would have been lost had not the one called Minfilia appeared. Halting the Light's inexorable advance, she saved what little still remained of the world."},{"name":"MITRON","text":"In the process, she also restored to me a sliver of my consciousness, though I remained trapped in my altered form. Motionless, I was capable only of feeble whispering."},{"name":"RYNE","text":"Emet-Selch─couldn't he have saved you?"},{"name":"MITRON","text":"Perhaps he could have, if such had been his wish. Far easier, however, to simply find another piece of my fractured soul to replace me."},{"name":"MITRON","text":"From his perspective, there was no need to intervene and potentially disturb the balance of aether. And so here I remained."},{"name":"GAIA","text":"So after you failed, he left you here to rot. Some friend he turned out to be."},{"name":"MITRON","text":"Thus abandoned, I called out for what seemed like an eternity to the only soul who could save me: you, Gaia."},{"name":"GAIA","text":"All this time, you were calling to me for help?"},{"name":"MITRON","text":"Yes, but you had forgotten me. Forgotten our duty. Though vestiges of your true power remained, you could not wield it at will."},{"name":"MITRON","text":"Time went by, and eventually change came. The Light began to subside and the dark of night returned."},{"name":"MITRON","text":"Gradually, my voice grew stronger until I was able to exert my will over you."},{"name":"GAIA","text":"You wanted me to free your soul from Eden, which is why you had me attack it. Another plan that ended in failure, thanks to <span class=\"highlight\">Forename</span>."},{"name":"MITRON","text":"Indeed. Thankfully, your subsequent attempts to restore this barren land allowed Eden to absorb more and more aether aligned closer to Darkness, gradually eroding the cage of Light that holds me."},{"name":"MITRON","text":"Owing to your most recent efforts, my mind is wholly my own once more, and I am able to project my image beyond those confines."},{"name":"RYNE","text":"Then all this time we've been helping to free an Ascian!?"},{"name":"GAIA","text":"Hmph. That's a fine tale, but why should I care about any of it?"},{"name":"GAIA","text":"What are you to me?"},{"name":"MITRON","text":"Come with me to Eden's core. There, all shall become clear."},{"name":"GAIA","text":"W-Wait!"},{"name":"GAIA","text":"I have a bad feeling about this, but if we want to restore the land, we need to know what we're dealing with..."},{"name":"SYSTEM","text":"You had best consult with Ryne first..."},{"name":"RYNE","text":"I've just realized something. If Eden has been absorbing all that rebalanced aether, that must be why we've struggled to restore life to the Empty. I suppose we can think about that later, though."},{"name":"RYNE","text":"More importantly, it seems I've lost control over Eden, most likely because of the Ascian. Urianger specifically warned us about not listening to the faerie's “honeyed words,” so we'd better think this through before we go rushing in."},{"name":"RYNE","text":"Oh, if only he and Thancred were here now..."},{"name":"GAIA","text":"What are you talking about?"},{"name":"RYNE","text":"I'm sorry, Gaia. I shouldn't be so quick to lose heart."},{"name":"GAIA","text":"What? No, that's not what I meant. Who are Urianger and Thancred?"},{"name":"GAIA","text":"Wait... I know those people. I'm sure of it. But why can't I remember them?"},{"name":"RYNE","text":"Hmm... I thought something was strange when I mentioned the festival onboard Eden. It was as though you had no recollection of our earlier conversation. This is most likely connected to Mitron..."},{"name":"GAIA","text":"Damn it all! What more is that fiend going to take from me!?"},{"name":"RYNE","text":"To tell the truth, the thing that frightens me most...is that you might forget about us."},{"name":"GAIA","text":"That won't happen. For every memory I lose, we'll make two more together."},{"name":"GAIA","text":"And if I need to know something, I can just ask you! Why not start by telling me about Urianger and Thancred? To be honest, my nerves are all ajitter, so I need something to help me settle down before we confront Mitron."},{"name":"RYNE","text":"Urianger is probably the most intelligent person I know. He spends a lot of time reading, but he also says that you can't learn everything from books, and encouraged me to go out and see the world for myself."},{"name":"GAIA","text":"Sounds sensible to me. Much better to experience things firsthand than to read about someone else's. Like those coffee biscuits. No book could ever describe how good they taste."},{"name":"GAIA","text":"Is there anything else you can tell me about him, <span class=\"highlight\">Forename</span>?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"He is devoted to the study of prophecies."},{"name":"A1","text":"He can walk on water, until he can't..."},{"name":"GAIA","text":"Prophecies are funny things, if you ask me. If people know that something terrible is going to happen, they'll go and prevent it─which would make the prophecy untrue."},{"name":"RYNE","text":"Hee hee! I wonder what Urianger would say to that!"},{"name":"GAIA","text":"So he <span class=\"emphasis\">walks</span> on water instead of swimming? That would certainly save you from getting wet... I should've asked him to teach me how."},{"name":"RYNE","text":"Well, it's something he never quite mastered himself, and he often ended up getting wet anyway. In fact, the whole thing is probably more trouble than it's worth!"},{"name":"RYNE","text":"As for Thancred, he's the one who freed me from Eulmore. At first, I thought of him as my knight in shining armor, but really, he was much more than that. We traveled all over Norvrandt and he helped me become the person I am today. He even gave me my name!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"He's also an expert in infiltration."},{"name":"A2","text":"His gift for song won the heart of many a fair lady, or so he claims..."},{"name":"GAIA","text":"That would explain how he was able to sneak into Eulmore and rescue the damsel in distress, just like in the songs."},{"name":"RYNE","text":"Hmph, I'm hardly a damsel in distress! ...Well, I suppose I was back then. But Thancred taught me how to fight and survive."},{"name":"RYNE","text":"Singing? That doesn't sound like the Thancred I know."},{"name":"GAIA","text":"It seems he has a way with words. That must be how he was able to choose such a pretty name for you."},{"name":"RYNE","text":"Actually, while we're on the subject, that gunblade over there belonged to Thancred."},{"name":"RYNE","text":"As far as mementos go, it's a bit on the cumbersome side, but it reminds me of our adventures together. Even though there's little chance I'll ever see him again, it still feels like he's here with me."},{"name":"GAIA","text":"Keeping your memories close..."},{"name":"GAIA","text":"You know what? I should keep a diary. Even if I forget everything, at least I will have something to look back on."},{"name":"RYNE","text":"That's a brilliant idea! Since we're going to be making lots of new memories together, maybe I could write in it too?"},{"name":"GAIA","text":"As long as you improve your handwriting before you go scrawling all over it. I'd like your entries to be vaguely legible, if you don't mind."},{"name":"RYNE","text":"Haha! Of course, your ladyship!"},{"name":"GAIA","text":"But before that, we've got an Ascian to deal with. Let's get this over with!"},{"name":"RYNE","text":"When I think back on the days I spent with everyone, it's always the tiny, frivolous details that spring to mind."},{"name":"RYNE","text":"The smiles, the little gestures... It's not as though I made a conscious effort to remember them, but they stuck with me all the same."},{"name":"RYNE","text":"I suppose that's what memories are─a collection of all those seemingly insignificant moments. While they may not have made a huge difference in the grand scheme of things, they mean the world to me."},{"name":"GAIA","text":"It was good to hear about our friends...but I still have no recollection of them whatsoever."},{"name":"GAIA","text":"It's just like all those things Mitron was saying. How can I even tell if they're true or not if I don't remember?"},{"name":"GAIA","text":"There's no point dwelling on it, though. Nothing for it but to press on."},{"name":"SYSTEM","text":"Proceed to Eden's core?"},{"name":"GAIA","text":"We came as you asked, so start talking."},{"name":"MITRON","text":"Why settle for mere words when I offer something far greater? Eden will now afford you a glimpse of the past. More than a glimpse, in fact. It will be as real as any of the foes you yourselves have conjured forth."},{"name":"RYNE","text":"Conjured forth? Wait, you don't mean to perform a summoning, do you!?"},{"name":"MITRON","text":"I do. I shall recreate the battle of a hundred years past, which pitted Ardbert and his fellow Warriors of Light against their nemesis, the Shadowkeeper."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Just as Emet-Selch recreated the Final Days of Amaurot..."},{"name":"A3","text":"So who will play the part of Ardbert?"},{"name":"A3","text":"Their nemesis... You mean Cylva."},{"name":"MITRON","text":"Is that so? It seems much and more has occurred during my absence. No doubt he employed creation magicks to breathe life into his recollections of the past."},{"name":"MITRON","text":"Whomsoever you choose, though his skill and strength will not be easily matched."},{"name":"MITRON","text":"That you should know that name... The true identity of the Shadowkeeper, emissary of chaos."},{"name":"GAIA","text":"And what do you hope to achieve with this history lesson of yours?"},{"name":"MITRON","text":"You shall see. You shall remember. Now, your very soul will revisit that fateful day a hundred years ago."},{"name":"RYNE","text":"Gaia, you can't trust Mitron! If you do, you'll end up being manipulated again!"},{"name":"GAIA","text":"Ryne..."},{"name":"GAIA","text":"You're right. My days of being controlled by this demon are over. I have a new life now, and I won't let anyone take that away from me."},{"name":"GAIA","text":"My will is my own! You have no hold over me!"},{"name":"MITRON","text":"This is all your doing, accursed minions of Light! <span class=\"emphasis\">I</span> should be the one at her side! Not you or anyone else! I will take her beyond the reach of your poisonous influence and keep her safe!"},{"name":"RYNE","text":"What have you done with Gaia!?"},{"name":"MITRON","text":"Nothing yet. But soon I will restore her to her true self. And you will help me to do so, by conquering the adversary I present before you."},{"name":"SYSTEM","text":"You had best speak with Ryne..."},{"name":"RYNE","text":"I knew it was risky trusting an Ascian, but we played right into Mitron's hands!"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"We'll do whatever it takes to save Gaia."},{"name":"A4","text":"There's no choice but to do as Mitron says."},{"name":"RYNE","text":"Agreed. There's no telling what kind of danger she's in, but wherever she is, I know she's giving her all. Even though we're apart, we'll fight as one."},{"name":"RYNE","text":"Together, we'll bring an end to Mitron's wicked schemes!"},{"name":"RYNE","text":"Perhaps, but I doubt that'll be the end of it. It's clear that Mitron has no intention of returning Gaia to us, but there may yet be an opportunity to free her. “In the chaos of conflict, one can always find an opening to exploit.”"},{"name":"RYNE","text":"Of course, it's the conflict part that comes first. But if Ardbert was able to overcome this foe, then so can you!"},{"name":"RYNE","text":"It looks like Mitron's grip on Eden has loosened somewhat, perhaps to allow me to send you to the battlefield."},{"name":"RYNE","text":"Once you get there, don't let your guard down. While this may be a reenactment of a moment in history, the threat you face is very real. Whatever happens, you must make it through this. Gaia's counting on us!"},{"name":"RYNE","text":"I wish I knew more about this Shadowkeeper. Then at least we'd be a little better prepared. All I can say is, please be careful."},{"name":"GAIA","text":"Why...does this all seem so...familiar? Ungh!"},{"name":"RYNE","text":"Mitron's returned Gaia to us, but I've a feeling this isn't over yet..."},{"name":"GAIA","text":"The Warriors of Light... The Shadowkeeper... I've seen this all before."},{"name":"MITRON","text":"Yes! You and I joined our power as one to create the Shadowkeeper. We bore witness to its battle with the Warriors of Light."},{"name":"GAIA","text":"Our power? So I was there...and I wasn't alone..."},{"name":"RYNE","text":"No, Gaia! It's not true, it can't be! How can you have been there a hundred years ago!?"},{"name":"MITRON","text":"Look deep inside─you know it was real. Cast aside those worthless memories and embrace who you truly are!"},{"name":"GAIA","text":"...Worthless?"},{"name":"GAIA","text":"Now I see. This is why you've been tampering with my memories ever since I was a child..."},{"name":"MITRON","text":"Just so. And now, I possess the means to purge them entirely. Your rebirth will finally be complete!"},{"name":"GAIA","text":"You have no right to deny me a life, to rob me of what I hold most precious! My memories may seem worthless to you, but not to me."},{"name":"GAIA","text":"I will never be yours. My place is here. In this world, in this life, in this moment. Wherever my friends are, that is where I belong!"},{"name":"MITRON","text":"Then you would turn your back on our glorious past? On the lives we once lived?"},{"name":"GAIA","text":"Any past I may have shared with you is long gone. I live in the here and now, striving to build a better future. And I'll be damned if I let you take that away from me!"},{"name":"MITRON","text":"To be reunited at long last, only to be shunned..."},{"name":"MITRON","text":"Would that I had died with you... To be reborn."},{"name":"MITRON","text":"Even without knowledge of your past, we may yet forge a future together."},{"name":"GAIA","text":"I'm sick of your riddles. Speak plainly or not at all."},{"name":"MITRON","text":"You and I fought the Warriors of Light as one, joined in both body and soul. When Ardbert struck his final blow, the Light tore through the bonds that held us. Though you perished, I was condemned to a far worse fate."},{"name":"MITRON","text":"My flesh became my prison, and I was cursed to remain here, an abomination, while you lived on with others at your side... I will suffer it no more! You belong to me!"},{"name":"RYNE","text":"I, too, was once held against my will, robbed of my freedom. To be trapped and alone for a hundred years... I can't begin to imagine the pain you must have felt."},{"name":"RYNE","text":"But that doesn't give you the right to deny Gaia a chance at happiness!"},{"name":"MITRON","text":"We once knew happiness─true happiness, until fate conspired to tear us apart. I will never let that happen again. We shall be joined as one, my memories yours. Together for all eternity!"},{"name":"GAIA","text":"Th-The Darkness... It's rising within me!"},{"name":"RYNE","text":"That mark...!"},{"name":"GAIA","text":"What is this? Why am I...?"},{"name":"RYNE","text":"Hold on, Gaia! Whatever it is, you mustn't give in!"},{"name":"GAIA","text":"Who are you?"},{"name":"MITRON","text":"Yes, yes! Now nothing will keep you from me!"},{"name":"MITRON","text":"I am yours, and you are mine!"},{"name":"GAIAPRIME","text":"We are one. We remember."},{"name":"RYNE","text":"So it's true!? Gaia really is a reincarnated Ascian!?"},{"name":"GAIAPRIME","text":"The girl you once knew is no more. The Ascian who held the seat of Loghrif is all that remains. Gaia is her true name."},{"name":"MITRON","text":"<span class=\"highlight-purple\">Oh, Loghrif, how long has it been... How long have I dreamed of this day.</span>"},{"name":"LOGHRIF","text":"<span class=\"highlight-purple\">Is that you, Mitron? Forgive me, I didn't recognize you...</span>"},{"name":"LOGHRIF","text":"<span class=\"highlight-purple\">In my defense, my memories have only recently been restored. My mind is still a little hazy.</span>"},{"name":"MITRON","text":"<span class=\"highlight-purple\">Hardly surprising. No matter how many times we are reborn, it is disorienting to have everything change around you.</span>"},{"name":"MITRON","text":"<span class=\"highlight-purple\">Even so, I immediately recognized your resplendent soul. And I cling to the hope that one day you will likewise remember mine. You always were a forgetful one.</span>"},{"name":"LOGHRIF","text":"<span class=\"highlight-purple\">I could never forget you. Try as I might.</span>"},{"name":"LOGHRIF","text":"<span class=\"highlight-purple\">But tell me, what do you know of my past? I admit, my memory may need refreshing...</span>"},{"name":"MITRON","text":"<span class=\"highlight-purple\">We served together as members of the Convocation of Fourteen, dedicated to the summoning of Lord Zodiark.</span>"},{"name":"MITRON","text":"<span class=\"highlight-purple\">Although the task assigned to you eventually fell to Elidibus.</span>"},{"name":"LOGHRIF","text":"<span class=\"highlight-purple\">Yes, I remember. Amidst the chaos and despair, you never left my side. My loyal protector...</span>"},{"name":"MITRON","text":"<span class=\"highlight-purple\">But in the end, it was in vain... I was powerless to prevent Hydaelyn from tearing our world asunder.</span>"},{"name":"LOGHRIF","text":"<span class=\"highlight-purple\">So I heard from Emet-Selch. We labor to make our world whole again. That's why he restored my memories, so that I can play my part.</span>"},{"name":"MITRON","text":"<span class=\"highlight-purple\"><span class=\"emphasis\">Our</span> part. Alone we struggle, but by joining your power with mine, we may yet succeed.</span>"},{"name":"LOGHRIF","text":"<span class=\"highlight-purple\"><span class=\"emphasis\">My</span> power? Hmph. You always were one for flattery.</span>"},{"name":"MITRON","text":"<span class=\"highlight-purple\">Oh, I assure you, I am quite sincere. It would be my honor to serve the cause alongside you. And I shan't take no for an answer.</span>"},{"name":"LOGHRIF","text":"<span class=\"highlight-purple\">The honor is mine. For as much as I chide and tease you, you are everything to me. My inspiration. When I'm with you, I fear nothing. Promise me...that we'll never be parted again.</span>"},{"name":"MITRON","text":"<span class=\"highlight-purple\">I promise. Even should fate conspire to separate us, I will reach out to you, wherever you may be.</span>"},{"name":"LOGHRIF","text":"<span class=\"highlight-purple\">And I will come running.</span>"},{"name":"GAIAPRIME","text":"We were destined to find each other. To awaken our buried past and be born anew."},{"name":"GAIAPRIME","text":"Though our brethren employ crystals to return sundered souls to their office, without them, such a feat was beyond my reach. But by becoming one in mind and body, my memories are yours. At last, you have awoken."},{"name":"GAIAPRIME","text":"Now, the time has come to restore our world to the utopia it once was."},{"name":"RYNE","text":"Let Gaia go!"},{"name":"GAIAPRIME","text":"You are not worthy to speak that name!"},{"name":"GAIAPRIME","text":"If you must call her anything, use the name chosen by her parents, if you even know what that is."},{"name":"RYNE","text":"No. To me, her name is Gaia."},{"name":"RYNE","text":"And nothing you say about her makes any difference to me. I don't care if she's an Ascian. She's my friend!"},{"name":"GAIAPRIME","text":"<span class=\"emphasis\">Was</span> your friend. Never again will she answer to your cries."},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"We won't give up on her!"},{"name":"A5","text":"We'll break the shackles that bind her!"},{"name":"RYNE","text":"Your wicked schemes have gone far enough. We're taking Gaia back!"},{"name":"GAIAPRIME","text":"Accursed servants of Light... You will not tear us apart again."},{"name":"RYNE","text":"What...is this!? Visions in my mind... A summoning!?"},{"name":"GAIAPRIME","text":"All your hopes and fears, turned against you. There is no escape from your past..."}],"reward":{"gil":3000,"items":[{"num":2,"id":25197,"one":1},{"num":2,"id":25198,"one":1},{"num":2,"id":25190,"one":1},{"num":2,"id":25186,"one":1}],"instance":30099},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69512]},"next":[69514]},"partials":[{"type":"npc","id":"1034514","obj":{"i":1034514,"n":"Gaia","l":3225,"q":1}},{"type":"npc","id":"1034518","obj":{"i":1034518,"n":"Ryne","l":3214,"q":1}},{"type":"item","id":"25197","obj":{"i":25197,"n":"Quickarm Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Skill Speed","category":0}}},{"type":"item","id":"25198","obj":{"i":25198,"n":"Quicktongue Materia VII","l":420,"c":20275,"t":58,"materia":{"tier":6,"value":8,"attr":"Spell Speed","category":0}}},{"type":"item","id":"25190","obj":{"i":25190,"n":"Battledance Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Tenacity","category":0}}},{"type":"item","id":"25186","obj":{"i":25186,"n":"Piety Materia VII","l":420,"c":20273,"t":58,"materia":{"tier":6,"value":8,"attr":"Piety","category":0,"advancedMeldingForbidden":1}}},{"type":"instance","id":"30099","obj":{"i":30099,"n":"Eden's Promise: Litany","c":61802,"t":"Raids","min_lvl":80,"max_lvl":80,"min_ilvl":485}},{"type":"quest","id":"69512","obj":{"i":69512,"n":"Fear of the Dark","g":23,"l":"The Empty","s":15,"f":1}},{"type":"quest","id":"69514","obj":{"i":69514,"n":"Voice of the Soul","g":23,"l":"The Core","s":17,"f":1}}]}