{"quest":{"name":"A Bounty of Hunters","location":"Lakeland","id":69524,"patch":5.4,"sort":30,"icon":101027,"eventIcon":71221,"issuer":1035283,"target":1030643,"genre":79,"journal":["Unukalhai's success with Taynor has only made him more eager to proceed.","He and Taynor having mastered the power to open hollows, Unukalhai asks that you contact Beq Lugg and inquire as to their progress in developing a means of gathering information in the void. Fortuitously, you receive an answer in the affirmative from them moments later. As whatever method Beq Lugg has devised is apparently best employed with a minimum of interference from nearby aetherytes, you agree to meet at Laxan Loft to conduct your investigation. ","Beq Lugg joins you at Laxan Loft, accompanied by Cyella and the porxie charged with delving into the void. Unukalhai and Taynor have no difficulty opening a portal sufficient for its passage─though as before, this seems to serve as an invitation for opportunistic voidsent.","Though it was clearly of higher rank than those that were summoned via previous hollows, you are nevertheless successful in putting an end to the voidsent. In fact, you accomplish this with such efficiency that none of your comrades even have the opportunity to step in and assist you. Or they simply couldn't be bothered. One of the two.","You inquire with Beq Lugg regarding the status of their porxie, who they believe ought to have returned by now. Taynor suggests that it might have become lost, and would perhaps be well served by an aetherial lodestone to guide it home.","Much as you once did to rescue Taynor, you channel your aether into the hollow. After a short but tense wait, Beq Lugg senses the porxie approaching, and it at last emerges from the portal, safe and sound. Though the Nu Mou is pleased to announce that their familiar has gathered quite a bit of information on conditions in the void, they also caution that it will take considerable time to review it all, let alone come up with a possible means to restore balance to the Thirteenth. Undaunted, Unukalhai vows to wait as long as is necessary if there is any hope of saving his home. As there is little you can do here in the meanwhile, however, you agree to follow Cyella back to the Wandering Stairs.","Back at the tavern, Unukalhai again affirms his intention to stay in the First until Beq Lugg finishes their research, prompting Taynor to invite his new friend to join him and Cerigg in hunting down sin eaters and other threats to Norvrandt. No sooner does he agree than is he joined by Giott, Granson, and Lue-Reeq, who learned of Unukalhai's mission from Cyella and are determined to see it done. With these brave souls so aligned, the day may indeed come that the Thirteenth sees Light once again..."],"objectives":["Speak with Unukalhai.","Defeat the voidsent.","Speak with Beq Lugg.","Channel aether into the hollow.","Speak to Cerigg at the Wandering Stairs."],"dialogue":[{"name":"UNUKALHAI","text":"Now that Taynor and I are capable of performing the necessary magicks, I should like to make an attempt at investigating conditions on the Thirteenth. Might I trouble you to contact Beq Lugg?"},{"name":"BEQLUGG","text":"(-Beq Lugg-)<span class=\"highlight\">Forename</span>? Are you there? I hope you've not lost focus on the void problem. I have an exciting breakthrough to share─a work of porxie-related genius, if I do say so myself."},{"name":"UNUKALHAI","text":"Beq Lugg! Excellent timing. We've made considerable progress as well, and are ready to open a portal when you are."},{"name":"BEQLUGG","text":"(-Beq Lugg-)Well, then... What say you meet me at Laxan Loft forthwith? It's far enough from any major aetherytes as to avoid the sort of aetherial interference that would be a hindrance to our observation of the void."},{"name":"UNUKALHAI","text":"Very well. We will see you at this “Laxan Loft” anon...or as soon as I can locate it."},{"name":"TAYNOR","text":"I'll lead the way. I too am eager to be one step nearer to our goal."},{"name":"TAYNOR","text":"You don't mind if I think of it as “our” goal, do you?"},{"name":"UNUKALHAI","text":"I would be honored. Thank you, Taynor."},{"name":"TAYNOR","text":"Like talking to an old friend... Yes, that's what it's like."},{"name":"UNUKALHAI","text":"It appears Beq Lugg has yet to arrive. Patience, Unukalhai..."},{"name":"BEQLUGG","text":"I hope you weren't waiting too long."},{"name":"CYELLA","text":"What, you didn't think I'd want to see this for myself? The Thirteenth was my home too, if you recall."},{"name":"BEQLUGG","text":"Quite. Though as I explained, we won't be the ones doing the seeing, strictly speaking─this familiar will gather all the information we need. Assuming you two can create a hollow for it to pass through?"},{"name":"BEQLUGG","text":"That will do nicely. Now fly, my porxie! Fly!"},{"name":"BEQLUGG","text":"Well...it's made it in."},{"name":"TAYNOR","text":"And something is coming out!"},{"name":"BEQLUGG","text":"My, that is an ugly one, isn't it?"},{"name":"TAYNOR","text":"I can still scarce believe how quickly we've progressed. It's almost as if we've been friends all along."},{"name":"BEQLUGG","text":"Thank you for clearing that up. The porxie ought to be back any moment now... Though I can't sense it. Odd."},{"name":"TAYNOR","text":"Perhaps it's lost? If <span class=\"highlight\">Forename</span> created an aetheric beacon as <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> did for me, it might find its way back more easily."},{"name":"BEQLUGG","text":"Hm... That may work. Give it a go."},{"name":"UNUKALHAI","text":"We've already come further than I dared hope. I am truly fortunate to have found Taynor."},{"name":"CYELLA","text":"Those two have really taken to each other, haven't they? I suppose they are of a similar age...in some ways, at any rate."},{"name":"TAYNOR","text":"As I expected, these creatures hardly pose a challenge to you. Maybe don't tell Cerigg about how large and horrible that one was, though?"},{"name":"BEQLUGG","text":"Keep at it..."},{"name":"BEQLUGG","text":"Aha! A distinctly porxie-like presence!"},{"name":"TAYNOR","text":"I see the snout!"},{"name":"BEQLUGG","text":"There we are. Now close that hollow before anything follows!"},{"name":"BEQLUGG","text":"I believe it has performed its task thoroughly, as instructed. Good porxie. With luck, its observations may indeed lead us to a means of driving the Darkness from the Thirteenth."},{"name":"BEQLUGG","text":"However, I will need to review its findings in detail before I can tell you more─and it could take years to deduce a suitable solution."},{"name":"UNUKALHAI","text":"I admit that I am impatient to find a way forward─but I have endured millennia with half as much hope as I have now. If I must wait, then that is what I shall do."},{"name":"UNUKALHAI","text":"Like <span class=\"highlight\">Forename</span>, and your Warriors of Light, I will persevere until my world is safe once more. That is what a hero does."},{"name":"TAYNOR","text":"I think you'll make a good one."},{"name":"UNUKALHAI","text":"You as well."},{"name":"CYELLA","text":"If that's the end of the excitement for the time being, we should head back to the Wandering Stairs. Clear out that pall of anxiety Cerigg is spreading all over the place."},{"name":"BEQLUGG","text":"The “stare at it for a prolonged period” method has proven ineffective, so you may as well try channeling aether as the boy suggested."},{"name":"CERIGG","text":"Ah, you've returned hale and whole! ...Not that I had any doubt you would, of course."},{"name":"CERIGG","text":"And...how did your search of the hollow go?"},{"name":"UNUKALHAI","text":"We may have the information we need to save the Thirteenth."},{"name":"UNUKALHAI","text":"It may be some time─years, maybe─until we can be certain. But I will be here for as long as it takes."},{"name":"TAYNOR","text":"On that subject, I've been thinking..."},{"name":"TAYNOR","text":"Would you be interested in joining us? As a bounty hunter, I mean. Cerigg and I hunt down sin eaters and other threats."},{"name":"TAYNOR","text":"The First was saved, but it remains far from safe. You could help us protect the people here."},{"name":"UNUKALHAI","text":"I... I think I would quite like that. Protecting people."},{"name":"UNUKALHAI","text":"If I can do that, then perhaps I will find the strength I need when the time comes."},{"name":"GIOTT","text":"(-???-)Strength, you say? Sounds like you could use a dwarf with a massive hammer!"},{"name":"CYELLA","text":"I may have shared the tale of the Thirteenth with a few other noted hunters."},{"name":"GRANSON","text":"Aye. I know what it feels like to fight for something you've already lost. To need to find a way to make it right."},{"name":"LUEREEQ","text":"And I know that it's not easy to fight on your own─inconvenient as that little truth may be."},{"name":"GIOTT","text":"...Thus a new team is born! This calls for a toast!"},{"name":"CERIGG","text":"I don't object─so long as this lot carries their weight. I'm a bounty hunter, not a phooka herder."},{"name":"UNUKALHAI","text":"Thank you so much...all of you. I would be honored to fight at your side."},{"name":"UNUKALHAI","text":"I shall do my best to justify the faith you have shown in me─and to save my home. Someday, I hope we can visit it together."},{"name":"CYELLA","text":"I did tell Cerigg that everyone is fine, but you may need to assure him personally that Taynor hasn't been devoured by a voidsent or what have you."}],"reward":{"gil":1285},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69523]}},"partials":[{"type":"npc","id":"1035283","obj":{"i":1035283,"n":"Unukalhai","l":2953,"q":2}},{"type":"npc","id":"1030643","obj":{"i":1030643,"n":"Cerigg","l":2951,"q":3}},{"type":"quest","id":"69523","obj":{"i":69523,"n":"One Step Closer","g":79,"l":"The Crystarium","s":20}}]}