{"quest":{"name":"Azuro and Goliath","location":"Kugane","id":69527,"patch":5.41,"sort":650,"icon":101050,"unlocksFunction":1,"eventIcon":71341,"issuer":1035096,"target":1035096,"genre":166,"journal":["Martyn greets you with a confident smile.","The day of the exhibition match has come, and Martyn proclaims himself ready for the duel. Mostly. Actually, he would feel far more confident if he could somehow reclaim the costume that Gyodo stole and sold off. He invites you along to stalk the back alleys of Kogane Dori, and flush out the unscrupulous Namazu.","You succeed in accosting Gyodo, only to discover that he auctioned off Martyn's outfit piece by piece. It seems you will need to scour the shops and stalls of Kugane in order to purchase them back. Martyn says he will search the markets of the Rakuza District, and volunteers you to visit the merchants of Kogane Dori.","Your queries into the whereabouts of Martyn's costume are met with discouraging news: from what you can gather, some Lalafell fellow has been a step ahead of you in purchasing the various articles of blue mage apparel. If you hurry, however, you might still catch the man somewhere nearby...","The Lalafell flees at your approach, but after cornering him in an alley, the young man's shoulders slump in resignation. It is Nutiba Buntiba. He mournfully admits to being Bluehood, and confesses his part in stealing the soul crystals and organizing the festival. Unwilling─and seemingly unable─to explain his actions, he nevertheless seeks to make some small amends by putting the full set of the Great Azuro's costume in your hands. Nutiba bids you deliver the outfit to Martyn, who awaits you outside the castle gates near the Ijin District.","A bemused Martyn accepts the costume from you, and enters the arena for his duel with Golden Goliath. Despite his best efforts, however, the guildmaster finds himself overwhelmed by his opponent's mastery of multiple forms of spellcraft. Thoroughly dejected, but unable to contain his curiosity, Martyn once more lingers by the gates to interrogate the man who thrashed him so soundly.","In answer to Martyn's incredulous questions, Golden Goliath claims to have had no mentor─that his arts are “inimitable.” Rudely dismissed by the crowing Kageyama, Martyn trudges back to the teahouse once more.","Aflame with the desire for a rematch, Martyn decides that a more thorough investigation into Golden Goliath's inimitable arts is in order. He then turns his attention back to the teahouse customers, but not before advising you against neglecting your own advanced studies.<br><br>※The next blue mage quest will be available from Martyn upon reaching level 68 and learning Ultravibration."],"objectives":["Speak with Martyn.","Speak with merchants on Kogane Dori.","Speak with the Lalafell fellow.","Deliver the Azuro costume to Martyn.","Speak with Martyn.","Speak with Martyn once more."],"dialogue":[{"name":"MARTYN","text":"We need to be ready for anythin', <span class=\"highlight\">Forename</span>. You're right up there in raw power, but don't forget that blue magic's greatest strength is versatility!"},{"name":"SYSTEM","text":"The next blue mage quest will be available from Martyn upon learning Tingle."},{"name":"MARTYN","text":"<span class=\"highlight\">Forename</span>! Been preparin' for the unlikely event I was unfit for the match, then?"},{"name":"MARTYN","text":"I appreciate the effort, but as you can see, I'm more than ready to tackle Golden Goliath my own self. Today is the day we go head-to-head, and I've been lurkin' around the festival to study my opponent's fightin' style."},{"name":"MARTYN","text":"From what I could gather, old Goldie learned all his spells from the exotic creatures in the festival─techniques I've never even seen or heard of before."},{"name":"MARTYN","text":"But that just means his blue magic repertoire is limited. I, on the other hand, have spent many a moon buildin' a diverse arsenal of offensive and defensive marvels. There's no way I can lose!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Nothing is certain."},{"name":"A1","text":"Let's not get cocky..."},{"name":"MARTYN","text":"I'll be fine, trust me! Although there is one tiny problem..."},{"name":"MARTYN","text":"I don't have my costume. I know it's silly, but gettin' into character helps me focus my skills."},{"name":"MARTYN","text":"I've a mind to string up our friend Gyodo, and find out where he sold my clothes... Feel like comin' along?"},{"name":"MARTYN","text":"Good. My fellow teahouse workers agreed to cover my duties, so I have a little time right now. Let's head into the alleys again and see if we can't flush out that fish."},{"name":"MARTYN","text":"He's close, I reckon. I can almost <span class=\"emphasis\">smell</span> him..."},{"name":"GYODO","text":"Tickets! Get your tick─ Argh, it's you two again!"},{"name":"MARTYN","text":"I thought I could live without my old clothes, Gyodo, but it turns out I'm a bit sentimental. I need to know: who did you sell my wardrobe to?"},{"name":"GYODO","text":"Your shiny outfit? Oh, I auctioned it off piece by piece through a secondhand dealer, and they were bought up by merchants from the Rakuza District and Kogane Dori."},{"name":"GYODO","text":"I don't know which shops have them now, but if you mean to buy your costume back, then you had better hurry along, yes, yes?"},{"name":"MARTYN","text":"Hm, well that sounds like a two-mage job. Can I ask you to scour the stores on Kogane Dori? I'll take the Rakuza District."},{"name":"MARTYN","text":"Buy any pieces you can find, and we'll settle accounts over at the castle. Hopefully my purse can cover it!"},{"name":"MUTO","text":"Auctioned off by Gyodo, you say...? Ah, yes, those foreign garments! I just sold them."},{"name":"ITTO","text":"Why, yes, I did purchase something from a Namazu seller recently. You're referring to that unusual scepter, I assume?"},{"name":"ITTO","text":"If you're quick, perhaps you can make a deal with the customer who bought it. Young Lalafell, he was, left but a few moments ago."},{"name":"NUTIBABUNTIBA","text":"I... I have to go!"},{"name":"NUTIBABUNTIBA","text":"(-Nutiba Buntiba-)Forgive me for running, I just panicked and... &lt;sigh&gt; You've been well, I hope?"},{"name":"NUTIBABUNTIBA","text":"(-Nutiba Buntiba-)I've no wish to lie to you of all people, so let me confirm what the guildmaster believes to be true: I <span class=\"emphasis\">am</span> Bluehood."},{"name":"NUTIBABUNTIBA","text":"(-Nutiba Buntiba-)Every part of this─stealing the soul crystals, setting up the festival, selling the secrets of blue wizardry─it was all my doing. I knew it was wrong, and I don't expect to be forgiven."},{"name":"NUTIBABUNTIBA","text":"(-Nutiba Buntiba-)But you should also know that I had no other choice, for reasons that I cannot presently explain..."},{"name":"NUTIBABUNTIBA","text":"(-Nutiba Buntiba-)Here. This hardly begins to make up for what I've done, but I took the liberty of reclaiming Azuro's costume. Please see that it makes it into Martyn's hands."},{"name":"NUTIBABUNTIBA","text":"(-Nutiba Buntiba-)He'll need all the edge he can get against Golden Goliath...though I doubt it will do him any good. Fare you well, <span class=\"highlight\">Forename</span>."},{"name":"MARTYN","text":"It's gone. Every storekeeper who had a piece of my costume had already sold it. Don't s'pose you had any better luck?"},{"name":"MARTYN","text":"You got the whole set!? But how─!?"},{"name":"MARTYN","text":"And then Nutiba just <span class=\"emphasis\">gave</span> it to you? I don't understand. What kind of game is he playin' here?"},{"name":"MARTYN","text":"Well, let's leave that mystery for later─I have a match to win and I don't need any more distractions."},{"name":"MARTYN","text":"It's time for Azuro the Third to prove himself on this Far Eastern stage. I'll see what this Goldie is really made of..."},{"name":"KUGANEMC","text":"Ladies and gentlemen! For this evening's entertainment, we bring you an unranked exhibition match featuring the incomparable, the invincible, the inexorable GOLDEN GOLIATH!"},{"name":"KUGANEMC","text":"His opponent is a stranger to our shores, a challenger from the distant west who seeks to pit his own formidable skills against our reigning champion! Please welcome, Azuro the Third!"},{"name":"SPECTATORMAN03991","text":"Look at him! This fool is just some would-be Bluehood. He'll never beat Golden Goliath!"},{"name":"MARTYN","text":"I'll show you how a <span class=\"emphasis\">real</span> practitioner of blue magic fights!"},{"name":"MARTYN","text":"Have a taste of this!"},{"name":"GOGO","text":"(-Golden Goliath-)<span class=\"emphasis\">Have a taste of this</span>!"},{"name":"MARTYN","text":"Bloody hells..."},{"name":"KUGANEMC","text":"Oho! The challenger appears to have some tricks up his sleeve, but will they be enough to topple our golden paragon!?"},{"name":"MARTYN","text":"There's more where that came from!"},{"name":"GOGO","text":"(-Golden Goliath-)<span class=\"emphasis\">There's more where that came from</span>!"},{"name":"MARTYN","text":"But... No blue mage can do that...can they?"},{"name":"KUGANEMC","text":"And Azuro the Third is down! Victory for Golden Goliath!"},{"name":"MARTYN","text":"That's that, then. I've failed. They'll never heed my demands now."},{"name":"MARTYN","text":"And what's with those spells Goldie cast at the end there? I swear I only ever saw him usin' monster techniques, then suddenly he's throwin' Flare and Holy at me."},{"name":"MARTYN","text":"I tell you, as a longtime student of the arcane arts, it eats me up inside. How can someone wield blue, white, <span class=\"emphasis\">and</span> black magic all at the same bloody time!? I ain't leavin' until I get some answers."},{"name":"MARTYN","text":"That was a sound thrashin' you gave me, mate, but I've got to ask: where did you learn to fight like that? Who was your mentor?"},{"name":"GOGO","text":"(-Golden Goliath-)Mentor? I had no mentor. My arts are mine alone. They are...inimitable."},{"name":"KAGEYAMA","text":"Clear off, you whimpering cur! Find someplace else to whine about your defeat! Gahahaha!"},{"name":"MARTYN","text":"No mentor? So he taught <span class=\"emphasis\">himself</span> all that stuff? It just doesn't seem possible..."},{"name":"MARTYN","text":"Blast, it's gettin' late. Sorry to rush off, but they'll be needin' me back at the teahouse."},{"name":"MARTYN","text":"This ain't about the festival anymore, <span class=\"highlight\">Forename</span>─the reputation of our guild is at stake! I won't let it end in defeat!"},{"name":"MARTYN","text":"I'll challenge Goldie to a rematch, don't you worry about that. But first I need to learn more about the man and his “inimitable” art if I'm to have a fightin' chance."},{"name":"MARTYN","text":"Oh, and, uh, you shouldn't neglect your studies while this is goin' on. Why don't you take a crack at acquirin' Ultravibration? Now if you'll excuse me, I've got customers to serve..."}],"reward":{"gil":1132},"reqs":{"jobs":[{"lvl":65,"id":129}],"quests":[69526]},"next":[69528]},"partials":[{"type":"npc","id":"1035096","obj":{"i":1035096,"n":"Martyn","l":2404,"q":4}},{"type":"quest","id":"69526","obj":{"i":69526,"n":"Everybody Was Fukumen Fighting","g":166,"l":"Ul'dah","s":630,"f":1}},{"type":"quest","id":"69528","obj":{"i":69528,"n":"Where the Gold Goes","g":166,"l":"Kugane","s":680,"f":1}}]}