{"quest":{"name":"Master of Mimicry","location":"Kugane","id":69529,"patch":5.41,"sort":700,"icon":101050,"unlocksFunction":1,"eventIcon":71341,"issuer":1035096,"target":1026937,"genre":166,"journal":["Martyn appears to have mastered the art of teahouse customer service.","Martyn, despite settling in well at the teahouse, has had little luck in convincing Kageyama to allow a rematch. Enter Royse. Driven beyond the limits of her patience and determined to take matters into her own hands, the Celestium's manager arrives in Kugane like a wrathful storm. She informs you of the appointment she has arranged with Nutiba Buntiba outside the castle gates, and commands you to accompany her there at once.","After admitting his part in exploiting Royse and Martyn's accomplishments, a shamefaced Nutiba lays before you the sorry tale of his betrothal and subsequent servitude as a prisoner of Kageyama's ruthless manipulations. Then, as if summoned by the cursing of his name, Kageyama emerges from the castle with Golden Goliath in tow. At first, he balks at Royse's insistence on a rematch, but once she sweetens the pot with ownership rights to the Masked Carnivale, the Kugane merchant prince seems positively eager to seal the deal. You and Golden Goliath are now scheduled to duel in the Celestium, an arrangement which sees you and Martyn packing your bags for the return journey to Ul'dah.","Royse meets you at the Blue Mages' Guild with a new costume and a sudden pre-match date with Gogo, Master of Mimicry, in which the challenger to your title is introduced to the Celestium's cheering crowd. With the gauntlet decidedly thrown down, you find yourself back on the street with Royse, the strident voice of the announcer still ringing in your ears.","Royse urges you on to victory before departing on some managerial errand, leaving Martyn to advise you on what he considers to be a winning strategy. It seems that, once again, the fate of the Celestium rests upon your azure-clad shoulders. Enter the Masked Carnivale, and unleash a tempest of blue magic that even the Master of Mimicry cannot hope to imitate!<br><br>※The next blue mage quest will be available from Martyn after completing stage 31 of the Masked Carnivale."],"objectives":["Speak with Nutiba Buntiba.","Speak with Royse in Ul'dah.","Speak with Royse."],"dialogue":[{"name":"MARTYN","text":"You're lookin' well, <span class=\"highlight\">Forename</span>, but you're missin' somethin'... Ah, it's that Aetherial Spark!"},{"name":"SYSTEM","text":"The next blue mage quest will be available from Martyn upon learning Aetherial Spark."},{"name":"MARTYN","text":"<span class=\"highlight\">Forename</span>, keepin' your feet wet in the blue, I see."},{"name":"MARTYN","text":"In case you were wonderin', I tried to arrange a rematch with Golden Goliath, but that smug bastard Kageyama wouldn't even give me the time of day."},{"name":"MARTYN","text":"As far as he's concerned, the matter's already dead and buried."},{"name":"MARTYN","text":"But I ain't one to give up so easily. I'll keep on houndin' him till he's sick of the sight of me, and then..."},{"name":"MARTYN","text":"R-Royse!? Er, welcome to Kugane! Can I get you a nice cup of tea...?"},{"name":"ROYSE","text":"Do I look like I'm in the mood for tea!? I got so tired of waiting for word of your investigation that I packed a bag and came here myself."},{"name":"ROYSE","text":"And what do I discover, darling, but that you wagered the right to continue the Foo-koo-men Fighting Festival on a trial by combat...<span class=\"emphasis\">which you then proceeded to lose</span>!"},{"name":"MARTYN","text":"It wasn't my finest moment, no..."},{"name":"ROYSE","text":"I never should've delegated this business in the first place. From here on out, <span class=\"emphasis\">I</span> will be taking charge of things. Effective immediately."},{"name":"ROYSE","text":"As a matter of fact, I already have an appointment outside the castle gates with the festival's founder─this Nutiba Buntiba of yours. Come along, darlings, I will not stand idly by while someone who isn't me profits from the idea of the Masked Carnivale."},{"name":"MARTYN","text":"Royse ain't one to mess about, is she? I think my days at the teahouse might be numbered..."},{"name":"ROYSE","text":"I half expected the rat to flee rather than face me, but it seems I get my audience after all. Now maybe we can make some headway..."},{"name":"MARTYN","text":"Royse'll sort this out, just you watch."},{"name":"ROYSE","text":"Nutiba, I accuse you of founding the Foo...ahem, the Fukumen Fighting Festival in a direct attempt to imitate and exploit the success of <span class=\"emphasis\">my</span> Masked Carnivale. I demand you cease operations and offer restitution for profits lost!"},{"name":"MARTYN","text":"And you better bloody well make up for stealin' my soul crystals, as well."},{"name":"NUTIBABUNTIBA","text":"I willingly confess to the crimes leveled against me, and offer you both my most sincere and regretful apologies..."},{"name":"NUTIBABUNTIBA","text":"But I cannot halt what has been put in motion. As to the reasons why, well that shameful explanation is what brought me out to meet with you today."},{"name":"NUTIBABUNTIBA","text":"I used to be a sailor, from Limsa Lominsa. To cut a long story short, I was on the crew of a trading ship which docked in Kugane, where I fell in love with a local girl."},{"name":"NUTIBABUNTIBA","text":"I asked for her hand in marriage, and that's where Kageyama came in. As the mediator employed for our betrothal, he offered to lend us the monumental sum required for the traditional exchange of gifts. By way of repayment, I was to help him “avoid” paying tariffs on soy sauce exports. I...became a smuggler."},{"name":"NUTIBABUNTIBA","text":"The longer I toiled in the shadows, the firmer his grip closed upon me, until one day I realized there was no way to squirm free."},{"name":"NUTIBABUNTIBA","text":"It was then that Kageyama heard talk of the Masked Carnivale. He grew obsessed with the idea of raking in the profits by beginning his own fighting arena in Kugane."},{"name":"NUTIBABUNTIBA","text":"To that end, he ordered me to travel to Ul'dah, and steal the secrets of blue magic. My conscience rebelled in disgust, but the fear of what Kageyama might do to my fiancée was stronger."},{"name":"NUTIBABUNTIBA","text":"And so, resigned to carry out the deception, I apprenticed myself to the guildmaster. Once I'd acquired a solid foundation in the art, I awaited the chance to pilfer your cache of soul crystals, and then fled into the night."},{"name":"NUTIBABUNTIBA","text":"...I do not expect this simple admission of guilt to absolve me of my transgressions. Yet beyond that, I can give you no more─not without risking the safety of the one I hold most dear. Surely you understand!?"},{"name":"ROYSE","text":"“Kageyama,” you said? The name rings a bell, but I thought he was just another rich Kugane merchant. This goes beyond commercial ruthlessness..."},{"name":"MARTYN","text":"Damn you, Kageyama! You've got a lot to answer for!"},{"name":"KAGEYAMA","text":"(-???-)Did someone call my name?"},{"name":"KAGEYAMA","text":"Why are you out here wasting words on this flea-ridden failure? If you've time to chat, you've time to market our blue wizard wares."},{"name":"NUTIBABUNTIBA","text":"Yes, sir! S-Sorry, sir!"},{"name":"ROYSE","text":"Allow me to introduce myself. The name's Royse, and I'm the manager of the Masked Carnivale. This little show you're running here is a brazen theft of my entrepreneurial idea!"},{"name":"KAGEYAMA","text":"Again with this idiocy... You forfeited all rights to that claim the moment your man here lost against our champion."},{"name":"ROYSE","text":"I acknowledge his defeat here in Kugane, but that was on foreign soil where you held every advantage. Isn't it only fair that we have the chance to prove our legitimacy on more familiar ground?"},{"name":"KAGEYAMA","text":"Try to twist things all you like, Miss Manager, but what's done is done. Besides, what could I possibly stand to gain by allowing you a rematch?"},{"name":"ROYSE","text":"A renegotiation of the terms, then. Should you win again, I promise to sign over to you full ownership of the Masked Carnivale."},{"name":"KAGEYAMA","text":"Gahahaha, you have a deal! Just name the day!"},{"name":"ROYSE","text":"Not so fast. To clarify, a victory will only be considered valid if won in our home city of Ul'dah."},{"name":"ROYSE","text":"Also, I reserve the option to nominate this mage, Azuro the Second, to fight on our behalf."},{"name":"KAGEYAMA","text":"Yes, yes, very well. Golden Goliath will slaughter any combatant you care to bring into the ring. Your business is as good as mine! Gahahahahaha!"},{"name":"ROYSE","text":"My apologies for the sudden shift in responsibility, <span class=\"highlight\">Forename</span>, but there's no one else I'd trust to shoulder the burden."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I can handle it!"},{"name":"A2","text":"I knew this would happen..."},{"name":"A2","text":"......"},{"name":"ROYSE","text":"I know you can, darling, and we love you for it."},{"name":"ROYSE","text":"I really am sorry, darling. Such is the price of competence, I'm afraid."},{"name":"ROYSE","text":"I can see you're not impressed, darling. I'll make it up to you, I promise."},{"name":"MARTYN","text":"I wouldn't have minded another shot myself, but Royse has the last word in these things. And you <span class=\"emphasis\">are</span> the best choice, if I'm bein' honest."},{"name":"ROYSE","text":"That's settled, then. Let's saddle up and head home!"},{"name":"PYANDIH","text":"I just knew this would lead to more trouble, but I'm glad to see you back safe and sound, <span class=\"highlight\">Forename</span>. "},{"name":"MARTYN","text":"Ah, it's good to be home! Strange, though...I sort of miss the fragrance of freshly brewed tea."},{"name":"ROYSE","text":"Kageyama and Nutiba are already here with Golden Goliath, fitting him for a new costume in one of the Celestium's anterooms."},{"name":"ROYSE","text":"I have a new outfit for you as well, and I want you wearing it for the pre-match announcement."},{"name":"ROYSE","text":"Don't worry, darling, you'll look splendid. Go on, now! Light up the stage!"},{"name":"BLUESKYMC","text":"Ladies and gentlemen! Today we introduce a new challenger to our champion's crown!"},{"name":"BLUESKYMC","text":"This enigmatic combatant hails from the Far Eastern nation of Hingashi, a man who beguiles his foes with preternatural feats of imitation! I present to you..."},{"name":"BLUESKYMC","text":"Gogo, Master of Mimicry!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Prepare to be bested!"},{"name":"A1","text":"May the best warrior win."},{"name":"A1","text":"Keep it above the belt..."},{"name":"GOGO","text":"<span class=\"emphasis\">Prepare to be bested</span>!"},{"name":"GOGO","text":"<span class=\"emphasis\">May the best warrior win.</span>"},{"name":"GOGO","text":"<span class=\"emphasis\">Keep it above the belt...</span>"},{"name":"BLUESKYMC","text":"Oho! And so it begins, folks! With what appears to be a mocking taunt, the challenger Gogo has favored us with a preview of his mimicking talents!"},{"name":"BLUESKYMC","text":"But can a clever replication truly stack up against the genuine article? Come one, come all to this titanic contest, and witness the outcome for yourself!"},{"name":"PYANDIH","text":"Oh, <span class=\"highlight\">Forename</span>, you looked absolutely splendid! The perfect paragon of a blue mage!"},{"name":"MARTYN","text":"You, uh, didn't see any extra outfits in my size, did you...?"},{"name":"ROYSE","text":"The crowd is primed for blood now, darling. Enter the Celestium when you're ready, and expose this Master of Mimicry for the cheap fraud he is!"},{"name":"MARTYN","text":"I wonder if I could get Royse to make <span class=\"emphasis\">me</span> one of those costumes...? Ahem, sorry. Back to the task at hand."},{"name":"MARTYN","text":"If I've learned anythin' about Gogo, then he'll be soakin' up the skills of every creature in the Masked Carnivale in preparation for your bout."},{"name":"MARTYN","text":"But no matter what spells he brings to bear, remember that you've got the upper hand when it comes to battle experience."},{"name":"MARTYN","text":"And just in case you're keen to accumulate a little more, I've added some new places you can visit to your blue mage log."},{"name":"MARTYN","text":"Like I said, focus on footwork and flexibility! We're countin' on you to take down that clown, and uphold the honor of your fellow blue mages!"},{"name":"SYSTEM","text":"A new stage has been added to the Masked Carnivale, and can be accessed by speaking with the Celestium attendant."},{"name":"SYSTEM","text":"New duties have also been added to the blue mage log. Access the “Blue Mage Log” tab via the blue magic spellbook, found in the main menu."}],"reward":{"items":[{"id":32866}]},"reqs":{"jobs":[{"lvl":70,"id":129}],"quests":[69528]},"next":[69530]},"partials":[{"type":"npc","id":"1035096","obj":{"i":1035096,"n":"Martyn","l":2404,"q":4}},{"type":"npc","id":"1026937","obj":{"i":1026937,"n":"Royse","l":41,"q":3}},{"type":"item","id":"32866","obj":{"i":32866,"n":"Mirage Gear Coffer (IL 400)","l":1,"c":26509,"t":61}},{"type":"quest","id":"69528","obj":{"i":69528,"n":"Where the Gold Goes","g":166,"l":"Kugane","s":680,"f":1}},{"type":"quest","id":"69530","obj":{"i":69530,"n":"A Future in Blue","g":166,"l":"Ul'dah","s":701,"f":1}}]}