{"quest":{"name":"Safekeeping","location":"The Crystarium","id":69521,"patch":5.4,"sort":2,"icon":101026,"eventIcon":71221,"issuer":1030837,"target":1030837,"genre":183,"journal":["Cyella appears surprised─though not displeased─to see you.","Cyella mentions she had been concerned that you had gone back to the Source for good, taking the crystals belonging to the First's Warriors of Light with you. She asks that you consider entrusting said crystals to her, that they might remain in the world those heroes fought so desperately to protect. As this is not a decision to be made lightly, you resolve to seek the input of their spiritual successors─the bounty hunters who helped to defeat the Cardinal Virtues─before committing.","Giott is but a few steps away, indulging in her usual alcohol-related pastime, so you begin by asking for her input. She appears equal parts intimidated by the idea of deciding the fate of Lamitt's crystal and excited for the opportunity to make Lue-Reeq pay for her drinks, and so dashes off to collect him and Granson while you speak to Cerigg and Taynor.","The group of bounty hunters assembled, you explain both Cyella's history and the possible reasons for entrusting her with the crystals. Though they are understandably surprised to hear that the erstwhile Shadowkeeper is nearby pouring ale, all agree that what remains of the First's Warriors of Light should remain in Norvrandt─and proceed to get astoundingly drunk. In the aftermath, you follow through on their sentiments by turning over the crystals to Cyella, who is moved to find that her former companions considered her a friend to the end, one and all.","You find Cyella again once she has had a bit more time to process her emotions. She vows that she will continue to speak the truth of the Warriors of Light, so that their legacy may live on."],"objectives":["Speak with Giott.","Speak with Cerigg.","Speak with Cyella."],"dialogue":[{"name":"CYELLA","text":"If it isn't <span class=\"highlight\">Forename</span>, loitering about the Stairs just like any old <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">day</span></span>."},{"name":"CYELLA","text":"And here I was worried that you'd gone back to your world for good, and I was too late."},{"name":"CYELLA","text":"It's just that I've been thinking about the crystals belonging to the Warriors of Light."},{"name":"CYELLA","text":"I hear they ended up with you, after you lot defeated the Virtues. I assume you have Ardbert's as well?"},{"name":"CYELLA","text":"Indeed─that does seem appropriate. His bond with Seto is deep and enduring."},{"name":"CYELLA","text":"As for the others...I had hoped you might be persuaded to leave them in my care."},{"name":"CYELLA","text":"It was only right that they, like Ardbert, should accompany you on your journey to set this world back on its proper course."},{"name":"CYELLA","text":"Yet you now have a home you must return to, while the First is theirs. After all they did to keep it safe, they deserve to be here to see what its future holds."},{"name":"CYELLA","text":"Oh, don't make that face. I know it's a big decision, but it needn't fall entirely to you. There are others here who care for the Warriors of Light as much as you do, aren't there?"},{"name":"GIOTT","text":"&lt;gulp&gt; &lt;gulp&gt; &lt;gulp&gt; Ahhh..."},{"name":"GIOTT","text":"Now that's some damn fine ale! How many should I order for you? I know you ain't much of a drinker, so... Six? Seven?"},{"name":"GIOTT","text":"What? You want help deciding the fate of Lamitt's crystal? And the others too? ...Does this place have any bigger tankards?"},{"name":"GIOTT","text":"Well, if you insist... Lue-Reeq owes me drinks─plural─so I'll make sure he joins us. Maybe find Granson while I'm at it."},{"name":"GIOTT","text":"You go on and wait with Cerigg and Taynor. Order a round while I'm out, you hear?"},{"name":"CYELLA","text":"You see why I work here. Folk are always in reach when I need them."},{"name":"CERIGG","text":"Good to see you, <span class=\"highlight\">Forename</span>. What did you say that has Giott so worked up?"},{"name":"CERIGG","text":"The crystals, eh? That does sound like a conversation worth getting everyone together for."},{"name":"TAYNOR","text":"Did Lue-Reeq really promise to pay for Giott's drinks? That's a disaster in the making..."},{"name":"CERIGG","text":"Not just hers─rounds for the lot of us! Might be that the lad yet has a few things to learn about coin and the scarcity thereof."},{"name":"CERIGG","text":"Still, I'll not turn down his generosity. Go and tell the barkeep we'll be needing food and ale for the table."},{"name":"TAYNOR","text":"Fine... But please try to exercise some restraint. I'll not carry you back to the room again."},{"name":"GIOTT","text":"Here we are! How much of a head start did you get? Should I ask 'em to bring out the cask?"},{"name":"GRANSON","text":"I reckon we should hear <span class=\"highlight\">Forename</span> out first."},{"name":"CERIGG","text":"So...you're telling me that the barmaid was one of Nyelbert's companions, not to mention the Shadowkeeper? <span class=\"emphasis\">And</span> from a different world? That's laying it on a bit thick."},{"name":"TAYNOR","text":"It certainly raises questions."},{"name":"LUEREEQ","text":"Quite! Such as how she retains her youthful visage..."},{"name":"GRANSON","text":"Not that."},{"name":"GIOTT","text":"...I had my suspicions about her. The other night I was at the counter─quaffing my ale, having a grand time─and next I realize, I'm outside without a gil to my name. And it ain't the first time!"},{"name":"GIOTT","text":"It could only be the power of the Shadowkeeper..."},{"name":"TAYNOR","text":"...And not that you drink enough to fell a small army."},{"name":"GRANSON","text":"If <span class=\"highlight\">Forename</span> says it's true, I'm inclined to believe it. Which leaves us with the matter of entrusting the crystals to her."},{"name":"GRANSON","text":"She's right that this was Branden's home─the others', too. And it's home to their most important memories. Not all of them good, maybe, but...everyone they loved is laid to rest here."},{"name":"CERIGG","text":"I agree. Nyelbert belongs here."},{"name":"GIOTT","text":"Ardbert's crystal is with Seto, in this world. Lamitt would want to be near."},{"name":"LUEREEQ","text":"Renda-Rae as well, I think. She'd want to be with her friends, in the place that she loved."},{"name":"TAYNOR","text":"It seems we all agree."},{"name":"GIOTT","text":"A toast, then! To the Warriors of Light!"},{"name":"CERIGG","text":"(-Hunters-)To the Warriors of Light!"},{"name":"LUEREEQ","text":"Drink up! I'm paying, and as bounty hunters, I expect you all to take proper advantage of that."},{"name":"GRANSON","text":"I hate to disappoint, but I'm not much for alcohol. This juice looks nice, though..."},{"name":"TAYNOR","text":"Ah, that's not─"},{"name":"CYELLA","text":"How did you manage this? Twice the mess in half the time as normal patrons, I swear."},{"name":"CYELLA","text":"I overheard your conversation, by the way. Do you agree with your friends?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"These crystals are yours...storykeeper."},{"name":"A1","text":"They would know best."},{"name":"CYELLA","text":"Their legacies are safe with me, you have my word."},{"name":"CYELLA","text":"I'll be certain not to disappoint them."},{"name":"CYELLA","text":"Thank you."},{"name":"CYELLA","text":"I..."},{"name":"CYELLA","text":"I can feel them... Their memories..."},{"name":"CYELLA","text":"Why? <span class=\"emphasis\">Why</span>, dammit!?"},{"name":"CYELLA","text":"You're all just like Ardbert. I betrayed you, I manipulated you, and still..."},{"name":"CYELLA","text":"You thought of me as a comrade─a friend─until the very end."},{"name":"TAYNOR","text":"Giott seems excited. Should I be concerned?"},{"name":"CYELLA","text":"We've finally managed to clean up after you lot...for the most part. Perhaps next time we should set down a tarpaulin."},{"name":"CYELLA","text":"Nevertheless, I'm grateful to you for entrusting these to me. And as long as I live, I will never stop sharing the true tale of the Warriors of Light─of my friends."},{"name":"SYSTEM","text":"The quest “The Hero's Journey” will now be made available. "},{"name":"SYSTEM","text":"In order to accept it, you must have completed the Chronicles of a New Era quests “Thok Around the Clock,” “The Diabolical Bismarck,” “A Fiendish Likeness,” “A Deific Simulacrum,” and “A Demonic Duplicate.”"},{"name":"GRANSON","text":"This...&lt;heave&gt; This is why I don't drink..."},{"name":"LUEREEQ","text":"A week's worth of earnings! How is this possible?"},{"name":"GIOTT","text":"Whew! Can't remember the last time I was so drunk. ...Or any of the other times, neither, but that ain't important. A successful sousing calls for a celebratory ale!"},{"name":"CERIGG","text":"My head..."},{"name":"TAYNOR","text":"I did warn you..."}],"reward":{"gil":895},"reqs":{"jobs":[{"lvl":80,"id":142}],"questsType":"all","quests":[69165,69318]}},"partials":[{"type":"npc","id":"1030837","obj":{"i":1030837,"n":"Cyella","l":2951,"q":3}},{"type":"quest","id":"69165","obj":{"i":69165,"n":"Shadow Walk with Me","g":183,"l":"The Crystarium","s":1}},{"type":"quest","id":"69318","obj":{"i":69318,"n":"Reflections in Crystal","g":9,"l":"The Crystarium","s":320}}]}