{"quest":{"name":"Greater Heights","location":"The Firmament","id":69520,"patch":5.41,"sort":10008,"icon":101025,"unlocksFunction":1,"eventIcon":71341,"issuer":1035013,"target":1032898,"genre":84,"journal":["Joellie has a minor matter of public safety to attend to before joining Neillemard and the others at the manufactory.<br>※Changing classes or jobs will prevent progress during this quest.","You inquire with Joellie as to whether she and Emeny are ready to join their fellow engineers at the manufactory. As Spanner must first be stored in a secure location for the bodily safety of passersby, however, they send you on ahead.<br><br>※Please note that you may not proceed with a class or job that is different from when you accepted this quest.","As you wait with Neillemard and Nimie, Stephanivien himself once again makes an appearance, this time accompanied by the ever-enterprising Rowena. Both admire your skybuilders' tool, and the proprietress of the House of Splendors wastes not a moment in demanding yet more replica materials from the beleaguered son of House Haillenarte.","You are at long last joined by Joellie and Emeny, accompanied by Stephanivien's younger brother Francel, the Firmament overseer, who professes both a personal and professional interest in the Skysteel tools project. Appreciation is shared freely, as Francel thanks the engineers for their contributions to Ishgard's reconstruction and they, in turn, thank you for the vital role you played in bringing their designs to life. Whether your paths will again cross remains to be seen, but one thing is certain─you are bound for greater heights."],"objectives":["With your perfected skybuilders' tool to hand, speak with Neillemard at the Skysteel Manufactory.","With your perfected skybuilders' tool to hand, speak with Neillemard again."],"dialogue":[{"name":"SYSTEM","text":"In order to undertake this quest, you must have the skybuilders' tool for your current class equipped, in your inventory, or in your Armoury Chest. "},{"name":"JOELLIE","text":"If we're to leave our posts, we'll need to find a place to store Spanner. I would hate for any passing children to mistake him for a toy mammet. It's all fun and games until someone's bones get...<span class=\"emphasis\">adjusted.</span>"},{"name":"EMENY","text":"That's precisely what the storage closet is for! You go on ahead with your skybuilders' tool─we'll catch up before you know it."},{"name":"JOELLIE","text":"He should fit if we shunt him in sideways..."},{"name":"NEILLEMARD","text":"<span class=\"highlight\">Forename</span>! Thank you for coming. But wherever are Emeny and Joellie?"},{"name":"NEILLEMARD","text":"Quite right of them to make arrangements for secure storage. One must always consider the consequences should technology recovered from mysterious ancient ruins be left alone and unsupervised."},{"name":"NEILLEMARD","text":"Perhaps we should summon Denys now? I daresay he could use a break."},{"name":"STEPHANIVIEN","text":"Why, what an auspicious gathering we have here!"},{"name":"STEPHANIVIEN","text":"I was just thinking I should like to know how you were getting on with the Skysteel tools─but from your expressions, I believe I have gleaned the answer."},{"name":"NEILLEMARD","text":"Indeed, we have seen results, and I daresay they speak for themselves. <span class=\"highlight\">Forename</span>?"},{"name":"STEPHANIVIEN","text":"...Remarkable. Simply <span class=\"emphasis\">remarkable</span>. It boggles the mind that this exquisite apparatus was once but a dust-laden prototype buried beneath so much detritus."},{"name":"ROWENA","text":"It's a fine tool, no mistake. If you don't mind, let Gerolt have a gander at it sometime. The sight o' it should light a fire under his lazy arse."},{"name":"ROWENA","text":"You'll be providin' me the plans for replicas, o' course. And I expect a heap o' orders, so you'll need to start producin' a lot more base implements and modification parts. Now."},{"name":"STEPHANIVIEN","text":"Rowena, the manufactory is a place of innovation and craftsmanship! We cannot simply...<span class=\"emphasis\">mass-produce</span> on a whim."},{"name":"ROWENA","text":"You will if you want to turn a profit! And judgin' by what I know o' the fullness─or lack thereof─o' House Haillenarte's coffers, you're in no position to be turnin' your nose up at that."},{"name":"ROWENA","text":"To the contrary─if we sell enough o' these, even that stuffy old father o' yours might be impressed. So take advantage o' what <span class=\"highlight\">Forename</span> has so kindly provided while you can. It's what I do."},{"name":"STEPHANIVIEN","text":"It seems I have little choice... Do furnish those plans at the earliest possible opportunity, won't you?"},{"name":"STEPHANIVIEN","text":"This, however, I return to you. I hope it is as much a pleasure to wield as it is to look upon!"},{"name":"STEPHANIVIEN","text":"You wished to see Denys, if I recall? I can send him out before I begin the appallingly tedious process of increasing our production capacity..."},{"name":"JOELLIE","text":"The wedging process was a bit more challenging than anticipated, so we're looking into alternate solutions. Worry not─I assure you that we'll be along shortly."},{"name":"DENYSE","text":"Where's the tool? Can I touch it? Ahhh... It is <span class=\"emphasis\">so</span> good to breathe fresh air again."},{"name":"EMENY","text":"Sorry to keep you waiting, everyone!"},{"name":"FRANCEL","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">afternoon</span></span>. I hope you don't mind that I came along─I crossed paths with Emeny and Joellie in the Firmament, and they were kind enough to share with me the good news."},{"name":"FRANCEL","text":"Stephanivien always speaks of your endeavor with such enthusiasm, you see, that I found myself desperately curious."},{"name":"NEILLEMARD","text":"In that case, it would be most impolite of us to delay any further."},{"name":"DENYSE","text":"Simply stunning! It really is a thing of beauty─even grander than what we envisioned at the start."},{"name":"FRANCEL","text":"As lord overseer of the Firmament's reconstruction, I cannot thank you enough for your incredible efforts on behalf of Ishgard. Such fine implements will doubtless serve the skybuilders well─present company included."},{"name":"NEILLEMARD","text":"There would be no greater honor than to know our tools might be of service, my lord."},{"name":"FRANCEL","text":"I assure you that they most certainly will. And I shall look forward to seeing the many marvels of technology that you and your colleagues will no doubt devise henceforth."},{"name":"DENYSE","text":"I would have given anything to work alongside you in assembling the final parts, but alas, Rowena's fee for the information on Azys Lla needed paying."},{"name":"DENYSE","text":"Thankfully, that's all but settled now. Of course, we'll still need to provide for the sale of replicas, as agreed."},{"name":"DENYSE","text":"Which, come to think of it, is an obligation that will continue indefinitely..."},{"name":"EMENY","text":"If there's anything we can do to help, please don't hesitate to let us know! It's the least we could do to thank you for the opportunity to take part in this once-in-a-lifetime endeavor!"},{"name":"JOELLIE","text":"And to work with Allagan technology! I'm certain there's much to be learned from Spanner yet..."},{"name":"NIMIE","text":"An ancient Allagan artifact, globs of goblin goo... This has been a unique experience, that's for certain."},{"name":"NEILLEMARD","text":"And one that will surely serve us in our future endeavors. Of this, I have no doubt."},{"name":"NEILLEMARD","text":"I must admit, despite my zeal, there were times even I doubted that we could succeed. But here we are─our dreams realized, and the power of collaboration put on display for all to see."},{"name":"NEILLEMARD","text":"Needless to say, the help of one of our realm's greatest trades<span class=\"alternative-container\"><span class=\"alternative\">women</span><span class=\"alternative\">men</span></span> has been invaluable. I know that I speak for all of us in saying that you have our sincere gratitude."},{"name":"NEILLEMARD","text":"Of course, beyond each success lies a new vision to pursue─for us, and for you."},{"name":"NEILLEMARD","text":"Trust me when I say that there are great innovations yet to come from the Skysteel Manufactory. And that no matter the heights to which you aspire, we believe you will rise to them─perhaps with a bit of help from your friends."}],"reward":{"gil":735},"reqs":{"jobs":[{"lvl":80,"id":35}],"quests":[69519]}},"partials":[{"type":"npc","id":"1035013","obj":{"i":1035013,"n":"Joellie","l":3435,"q":1}},{"type":"npc","id":"1032898","obj":{"i":1032898,"n":"Neillemard","l":2300,"q":5}},{"type":"quest","id":"69519","obj":{"i":69519,"n":"The Pinnacle of Possibility","g":84,"l":"The Firmament","s":10007,"r":1,"f":1}}]}