{"quest":{"name":"One Step Closer","location":"The Crystarium","id":69523,"patch":5.4,"sort":20,"eventIcon":71221,"issuer":1035281,"target":1035283,"genre":79,"journal":["Unukalhai would hone his newfound skill.","Having learned the fundamentals of opening hollows from Nyelbert's crystal, Unukalhai asks Taynor to work with him on perfecting the technique forthwith. Taynor agrees to do so, but only once safely away from the Crystarium, as denizens of the void are wont to seize any opportunity to cross to other worlds.","You meet Taynor and Unukalhai in Lakeland, where they attempt to use their joint aether to open a portal to the Thirteenth. Amazingly, they succeed in making such a gateway─albeit a small one─on the first go, and a minor voidsent emerges.","You dispatch the voidsent with little difficulty. It is now safe for Unukalhai and Taynor to make another attempt.","Taynor suggests that Unukalhai match his breathing and the flow of his aether in order to refine the technique. These instructions have the mixed results of a slightly larger hollow, and a slightly larger voidsent for you to dispose of.","You dispatch the voidsent of medium size. Thankfully, no hapless travelers pass by, and your two companions are either too intent on their aetherial attunement or too desensitized by past experience to be perturbed by the many screams issuing from its many mouths.","On their third attempt, Unukalhai and Taynor are perfectly in sync, and manage to open a robustly sized voidgate. This has the unfortunate side effect of unleashing a larger-than-is-strictly-desirable voidsent, but you've seen much worse, so get on with the slaying.","Your defeat of the voidsent leaves no trace behind. Beq Lugg never needs to know.","You speak to Unukalhai, who concludes that he now has a sufficient grasp on the technique. Taynor agrees that they have succeeded in synchronizing their aether at a surprising rate, and wonders aloud at how familiar working with Unukalhai's aether felt to him..."],"objectives":["Speak with Taynor by the Exarch Gate.","Slay the voidsent.","Speak with Unukalhai.","Slay the voidsent.","Speak with Unukalhai.","Slay the voidsent.","Speak with Unukalhai."],"dialogue":[{"name":"UNUKALHAI","text":"If you have no objection, Taynor, I would like to practice creating hollows as soon as possible."},{"name":"TAYNOR","text":"Of course─but not within the Crystarium. If we succeed in opening even the smallest window into that realm, it is likely that fell creatures will emerge. Follow me."},{"name":"CYELLA","text":"That was seven flagons of ale, two meads, one large cheese platter... What am I forgetting?"},{"name":"CERIGG","text":"That Unukalhai could stand to slow down a bit, but who hasn't been a touch reckless in pursuit of a good cause? Try to make sure he stays in one piece, eh?"},{"name":"TAYNOR","text":"We're ready when you are."},{"name":"TAYNOR","text":"Assuming no one ventures near, this location should be suitable. Unukalhai, when I give the word, begin channeling your aether. Nyelbert's memories will have told you as much, but it is imperative that you maintain focus on our aetherial resonance throughout this process."},{"name":"TAYNOR","text":"With that in mind─<span class=\"highlight\">Forename</span>, I ask that you take care of any creatures that emerge from the hollow. They should not be of a strength to challenge you, and it will allow us to adjust our attunement without risk."},{"name":"UNUKALHAI","text":"Then let us begin."},{"name":"UNUKALHAI","text":"Come on... Flow where I tell you to!"},{"name":"TAYNOR","text":"Let me attempt to match your focus."},{"name":"UNUKALHAI","text":"It opened! It's small, but..."},{"name":"TAYNOR","text":"...Enough to let something through. Be ready, <span class=\"highlight\">Forename</span>."},{"name":"UNUKALHAI","text":"There you are! Please, tell Taynor we can begin."},{"name":"UNUKALHAI","text":"That was...&lt;pant&gt;...far too much effort for such a small gate..."},{"name":"TAYNOR","text":"On the contrary─given this was your first attempt, it's incredible that we succeeded at all! Now, try synchronizing your breath with mine. Focus on the rhythm of the aetherial flow."},{"name":"UNUKALHAI","text":"All right. I'm ready!"},{"name":"TAYNOR","text":"Aha, a larger hollow! Of course, the voidsent may be proportionately stronger..."},{"name":"TAYNOR","text":"It has been quite a while since I opened a gate between worlds like this...but there are some things we never forget, aren't there?"},{"name":"UNUKALHAI","text":"Where your breath ends, mine begins... Where your aether flows, mine follows..."},{"name":"UNUKALHAI","text":"Together!"},{"name":"TAYNOR","text":"Unbelievable! Full attunement so soon..."},{"name":"UNUKALHAI","text":"Be ready, <span class=\"highlight\">Forename</span>!"},{"name":"UNUKALHAI","text":"I think I've grasped the principle now. I only need remember the feeling for next time."},{"name":"TAYNOR","text":"I almost feel as if I <span class=\"emphasis\">do</span> remember it. Your aether is...familiar, somehow. But that's impossible, of course."},{"name":"TAYNOR","text":"Like talking to an old friend... Yes, that's what it's like."}],"reward":{"gil":1325},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69522]},"next":[69524]},"partials":[{"type":"npc","id":"1035281","obj":{"i":1035281,"n":"Unukalhai","l":2951,"q":1}},{"type":"npc","id":"1035283","obj":{"i":1035283,"n":"Unukalhai","l":2953,"q":2}},{"type":"quest","id":"69522","obj":{"i":69522,"n":"The Hero's Journey","g":79,"l":"The Crystarium","s":10}},{"type":"quest","id":"69524","obj":{"i":69524,"n":"A Bounty of Hunters","g":79,"l":"Lakeland","s":30}}]}