{"quest":{"name":"Second-rate Entertainment","location":"Ul'dah","id":69525,"patch":5.41,"sort":602,"icon":101050,"unlocksFunction":1,"eventIcon":71341,"issuer":1026852,"target":1026852,"genre":166,"journal":["Martyn seems pleased to see you.","Martyn gives you a hearty welcome, and quickly fills you in on the latest guild news. Soon after, one of his disciples, P'yandih, arrives to undertake a test of her abilities, but Martyn's teaching schedule is thrown into disarray by the sudden appearance of Royse. It seems the Celestium's manager is hosting distinguished visitors from the Far East, and requires the Great Azuro─or one of his incarnations─to put on an impressive show for these potential investors. Finding himself otherwise engaged, Martyn imposes upon you to administer P'yandih's exam. All you need to do, he claims, is oversee the young mage's battle with some tentacled horror─with said horror patiently awaiting your coming in central Thanalan.","You avail yourself of the tentacled voidsent's martial services, and P'yandih employs her spellcraft to pummel the creature beyond the point of submission. Satisfied with her progress and wondering if Martyn might be finished with his exhibition match, the two of you turn back towards Ul'dah.","You return to the guild, but it seems Royse's guests from the Far East were less than impressed with the Masked Carnivale, calling it a poor recreation of the “Fukumen Fighting Festival.” Incensed that someone has stolen the idea for her enterprise, Royse orders Martyn to Kugane to investigate, leaving you behind to supervise the guild and the newly dubbed “Azuro the Fourth.”<br><br>※The next blue mage quest will be available from P'yandih upon reaching level 63 and learning Basic Instinct."],"objectives":["Speak with the tentacled voidsent at Spineless Basin, in central Thanalan.","Speak with Martyn in Ul'dah."],"dialogue":[{"name":"MARTYN","text":"<span class=\"highlight\">Forename</span>! How fares your delvin' into the deep waters of the blue?"},{"name":"MARTYN","text":"If you're worried about the guild, then let me set your mind at ease: folk've been beggin' to join our ranks, and bangin' on our door day and night! Well...metaphorically speakin', of course."},{"name":"MARTYN","text":"Even better, these eager young mages are so thirsty for knowledge, they've gone as far as the Far East and Ala Mhigo to discover new spells!"},{"name":"MARTYN","text":"Ah, I remember not so long ago when it was just me trudgin' across the realm, and now there's a whole host of us workin' to improve the art..."},{"name":"MARTYN","text":"I'll have to jot these new tricks down in your spellbook so you can go and have a look for yourself, eh?"},{"name":"MARTYN","text":"Oh, and I was meanin' to tell you about that log I've been puttin' together. Thanks to you and our other colleagues, I've managed to construct a fairly convincin' case for blue magic's unbeatable versatility, but a few more notes from the field wouldn't go astray. Anyway, that's about it for guild news..."},{"name":"MARTYN","text":"Ah, P'yandih, my diligent disciple. Today's the day y─"},{"name":"PYANDIH","text":"<span class=\"highlight\">Forename</span>, I was hoping you'd be back! I've been practicing all the blue magic I could get my hands on, and would love for you to see my progress!"},{"name":"MARTYN","text":"Now, now, there'll be time for that later. <span class=\"emphasis\">As I was saying</span>, today's the day for your big test."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I sense...something amiss."},{"name":"A1","text":"Where's your friend?"},{"name":"PYANDIH","text":"Oh, you mean Nutiba? He was doing so well, then one day not too long ago, he just...left."},{"name":"MARTYN","text":"Yes, it was a shame to lose so promisin' a pupil, but I'm sure he had his reasons. We can only hope he's out there somewhere, givin' blue mages a good name."},{"name":"ROYSE","text":"<span class=\"highlight\">Forename</span>! No one told me you were available, darling─not that the job I have in mind is worthy of your talents, in any case. I can make do with Azuro the Third, here..."},{"name":"ROYSE","text":"You see, I'm hosting some patrons who've traveled all the way from the Far East to witness the spectacle of the Great Azuro─or one of his incarnations─doing battle in the Masked Carnivale. Short notice, I know, but I'll need you in the Celestium right away."},{"name":"MARTYN","text":"I'm sorry, Royse, but today is an import─"},{"name":"ROYSE","text":"Did I mention these patrons were wealthy Kugane merchants? Put on a good enough show and we might snag ourselves some new investors...which means more coin to share around."},{"name":"MARTYN","text":"Well, we wouldn't want to disappoint our distinguished guests now, would we? I'd better do some stretches!"},{"name":"MARTYN","text":"I'll let you administer P'yandih's test for her, <span class=\"highlight\">Forename</span>. Honestly, there's naught to it! I've already arranged a voidsent for her to fight─all you need to do is see if she wins or not."},{"name":"MARTYN","text":"Her opponent is waitin' out at Spineless Basin, a big, tentacled brute of a thing. Introduce yourselves, and then P'yandih can have at it!"},{"name":"PYANDIH","text":"&lt;sigh&gt; Martyn never changes, does he? It makes my head spin... But at least this way I get to show you how much I've improved. Come on, let's go and find this voidsent!"},{"name":"ORTHRUS","text":"Hey, I know you! You're that Azuro the Second character."},{"name":"ORTHRUS","text":"Martyn told me I'd be training against some young and pretty up-and-comer, so you keep out of it, alright?"},{"name":"ORTHRUS","text":"Mwa ha ha! Now <span class=\"emphasis\">that's</span> what I'm talking about. I promise not to bruise you too badly!"},{"name":"PYANDIH","text":"Uh, <span class=\"highlight\">Forename</span>... Any advice for tackling this fiend?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Turn him into tako-yaki!"},{"name":"A2","text":"Ware his imp attack!"},{"name":"ORTHRUS","text":"Gwee-hee-hey, now! That hurt!"},{"name":"ORTHRUS","text":"Ow! Right in the cephalopods!"},{"name":"ORTHRUS","text":"Enough! I yield! Uncle Ulty didn't sign up for this!!!"},{"name":"PYANDIH","text":"I did it! I won! Now I can make my debut in the Masked Carnivale!"},{"name":"PYANDIH","text":"The title of “Azuro the Fourth” was riding on the outcome of this test, you see..."},{"name":"PYANDIH","text":"...Only, the honor really should have gone to Nutiba. He's always been far more skilled in blue magic than me."},{"name":"PYANDIH","text":"I wonder what could've possessed him to leave like that? I could tell something was troubling him, but he vanished without a word. Seems such a waste to─"},{"name":"PYANDIH","text":"But no, it's not my place to question his decisions. He has his life to lead, and I have mine. Let's head back into the city and see if Martyn's bout is finished, shall we?"},{"name":"ROYSE","text":"We meet again, darling."},{"name":"MARTYN","text":"How went the testin', then?"},{"name":"MARTYN","text":"Fantastic! So we've another Azuro to wow the crowds, eh!?"},{"name":"MARTYN","text":"My own demonstration went rather well, I thought. In fact, our Far Eastern guests should be along soon to shower me with praise..."},{"name":"ROYSE","text":"Welcome, welcome! That was some performance, wouldn't you agree?"},{"name":"GUEST03989","text":"I would not. Why, your “Masked Carnivale” is simply a poor recreation of Kugane's own Fukumen Fighting Festival."},{"name":"ROYSE","text":"...Foo-koo-men?"},{"name":"GUEST03989","text":"Our word for “masks,” Miss Royse. They are worn by the blue wizards who duel the fearsome creatures of the festival, pitting spectacular spells against untamed ferocity. It has proven most popular with the masses."},{"name":"MARTYN","text":"D-Did he say “blue wizards”...?"},{"name":"GUEST03989","text":"If I had known such second-rate entertainment awaited me here, I would have ended my journey in your “Golden Saucer.”"},{"name":"ROYSE","text":"Did I hear that straight!? Because it sounds like someone's making money off of <span class=\"emphasis\">my</span> enterprise!"},{"name":"ROYSE","text":"Martyn, I need you to board the next ship to Kugane, and look into this Foo-koo-men Festival thing. If it really is a blatant imitation of the Masked Carnivale, then I intend to object in the most strenuous terms. There will be <span class=\"emphasis\">magistrates</span> involved."},{"name":"MARTYN","text":"Personally, I'm curious about these so-called “blue wizard” fellows. If I find out they're makin' a mockery of our art, then there'll be seven hells to pay!"},{"name":"ROYSE","text":"While Martyn's busy across the waves, we're relying on you to pick up the slack in the Celestium, darling. You earned the title of Azuro the Fourth─now let's see how you fill out the costume."},{"name":"PYANDIH","text":"Behold!"},{"name":"PYANDIH","text":"The proud line of the Great Azuro lives on!"},{"name":"MARTYN","text":"You certainly look the part there, P'yandih."},{"name":"MARTYN","text":"Gods, I can feel the gap between teacher and pupil getting smaller by the day. I'd best be expandin' my own spellbook if I'm to keep callin' myself guildmaster..."},{"name":"MARTYN","text":"And I reckon you should keep a step ahead, as well. Basic Instinct is a good one to learn! Once you've mastered that─and polished your powers a bit─I'd appreciate it if you could stop by and check in on P'yandih."},{"name":"MARTYN","text":"I won't be around to offer instruction for a time, but I have great faith that the guild will never flounder with the two of you on the job!"},{"name":"PYANDIH","text":"We'll be fine, I'm sure. It's Martyn I'm worried about... Anyway, I'll be holding the fort here should there be anything you need!"}],"reward":{"gil":713},"reqs":{"jobs":[{"lvl":60,"id":129}],"questsType":"all","quests":[69273,68612]},"next":[69526]},"partials":[{"type":"npc","id":"1026852","obj":{"i":1026852,"n":"Martyn","l":41,"q":12}},{"type":"quest","id":"69273","obj":{"i":69273,"n":"Blue Cheese","g":166,"l":"Ul'dah","s":601,"f":1}},{"type":"quest","id":"68612","obj":{"i":68612,"n":"Emissary of the Dawn","g":7,"l":"The Rising Stones","s":26}},{"type":"quest","id":"69526","obj":{"i":69526,"n":"Everybody Was Fukumen Fighting","g":166,"l":"Ul'dah","s":630,"f":1}}]}