{"quest":{"name":"An Unexpected Symphony","location":"The Firmament","id":69537,"patch":5.41,"sort":21,"unlocksFunction":1,"eventIcon":71341,"issuer":1035521,"target":1035521,"genre":83,"journal":["Mariorie is making the final preparations for the forthcoming concert.","Mariorie welcomes your arrival, gleefully informing you that the performers have assembled, the instruments have been tuned, and the stage is set for the most magnificent concert the Firmament has seen. After your acquaintances Handeloup and Emmanellain express their eagerness to take part in the event, none other than Lord Francel arrives. Genuinely surprised and deeply touched by the gesture, he states that it would be an honor to perform with you. Make whatever final preparations you must, then join your friends atop the stage.","Thanks to the impressive musical talents of your friends, as well as your diligence in practicing for this moment, the concert proves even more impressive than you could have expected, delighting the guest of honor, your friends, the audience, and all in the Firmament whose ears take in the melodies that now soar through the sky. Satisfied at all you have accomplished today, you return to Mariorie to thank her for her own efforts in making this day possible.","Unsurprisingly, Mariorie is beside herself with joy at seeing the concert prove to be such an unqualified success. She thanks you for all you have done to bring the magic of music to the Firmament, and expresses her hope that you would not be averse to gracing local residents with an encore."],"objectives":["Speak with Mariorie at Saint Roelle's Dais, and take part in the commemorative concert.","Speak with Mariorie."],"dialogue":[{"name":"MARCELLOIX","text":"What do you think of the instruments? I'll have you know that every single one is homemade by these very hands! I promise you that each was made with painstaking precision."},{"name":"CONON","text":"Yes, I do believe this should make for a good venue..."},{"name":"MARIORIE","text":"My apologies for the wait, friend. I am pleased to announce that all preparations are completed, and we are ready for you to take the stage. Your fellow musicians should be arriving any moment, as well..."},{"name":"HANDELOUP","text":"Hail, <span class=\"highlight\">Forename</span>. How goes it? It's quite the honor to have the opportunity to perform with you. "},{"name":"HANDELOUP","text":"Recently, I have had the occasion to rest at home with my family, and I have used the time to assist my daughter with her practice. Rest assured that I will not miss a single note."},{"name":"EMMANELLAIN","text":"There you are! Did you miss me, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>? When Brother told me about the concert, I knew I simply had to be a part of it. I'm quite the virtuoso with the flute, if you didn't know."},{"name":"EMMANELLAIN","text":"Why, I cannot even tell you how long I practiced, that I might win the lovely Laniaitte's heart with a serenade of all her favorite tunes!"},{"name":"FRANCEL","text":"Hm? What are the two of you doing here? And wearing the same garb, no less... Whatever is the occasion?"},{"name":"FRANCEL","text":"Foncrineau said you had an urgent matter to discuss with me. Is everything quite all right?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"We have a surprise for you..."},{"name":"A1","text":"Today, we celebrate the reconstruction."},{"name":"FRANCEL","text":"A surprise? Could you possibly mean what I think you mean...?"},{"name":"FRANCEL","text":"A celebration? So that's why everyone has been skulking about the Firmament of late acting oh-so-surreptitious?"},{"name":"MARIORIE","text":"Just so, Lord Francel! In celebration of the Firmament's rebirth─and as but a small token of our appreciation for your efforts in leading the restoration─we would announce the establishment of the Risensong Players, the Holy See's first official musical troupe."},{"name":"MARIORIE","text":"And now, without further ado...the stage awaits, my lord!"},{"name":"FRANCEL","text":"The stage? You mean to say that I am free to join in the performance as well?"},{"name":"EMMANELLAIN","text":"You are not merely “free,” Lord Francel─why, it is a prerequisite for the performance itself. After all, this performance is being held in your honor first and foremost, and I know as well as any that you'd give anything for a chance to perform with your dearest friends."},{"name":"CONON","text":"Truly, Lord Francel, it is the least we can do to express the depth of our gratitude. Marcelloix, <span class=\"highlight\">Forename</span> here...each and every man and woman here spared no effort to help make your vision a reality."},{"name":"EMMANELLAIN","text":"Why, even my stuffy elder brother was prancing about with a spring in his step when we commissioned him to provide the score for the occasion. You wouldn't want to disappoint him, now, would you?"},{"name":"EMMANELLAIN","text":"And so here you go. Have yourself a copy of the score in hand and take your place at the piano with <span class=\"highlight\">Forename</span> here, where you belong."},{"name":"FRANCEL","text":"Lord Artoirel composed a piece for <span class=\"emphasis\">me</span>? Someone pray pinch my arm, friends, for surely this must be a waking dream...!"},{"name":"FRANCEL","text":"And that I might perform a duet with you, <span class=\"highlight\">Forename</span>... I daresay it is only appropriate, as you have been ever my constant partner and invaluable companion throughout this entire effort. It is an honor and a pleasure to share the stage with you, my friend."},{"name":"MARIORIE","text":"The audience is filing in as we speak, and your fellow performers stand by and await your cue. We are prepared to begin as soon as the both of you are ready."},{"name":"MARIORIE","text":"Simply let me know when you are prepared to raise the curtain, and we shall get the show started!"},{"name":"EMMANELLAIN","text":"Splendid! I, too, shall spend my last few moments tuning my instrument to perfection. Give me a shout as soon as you're ready, old <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">boy</span></span>!"},{"name":"FRANCEL","text":"I have perused the score, and I do not believe I shall have difficulty doing it justice. And yet, I must confess to feeling a touch anxious about the prospect of taking the stage with you, my friend..."},{"name":"MARCELLOIX","text":"Your fellow performers are priming their instruments as we speak. As for the piano, rest assured that it has been tuned with the utmost of precision by yours truly!"},{"name":"CONON","text":"We all await your cue, friend. Let us put on the performance of a lifetime and do Lord Francel proud!"},{"name":"MARIORIE","text":"Are you prepared, my friend? Then, without further ado, let the show begin!"},{"name":"SYSTEM","text":"The troupe will now perform a song. Time your inputs with the on-screen prompts."},{"name":"SYSTEM","text":"When a blue prompt appears (left), time your input as the diamonds overlap.<br>When an orange prompt appears (center), make several rapid inputs until the prompt disappears.<br>When a red prompt appears (right), press and hold the input for the duration of the prompt."},{"name":"SYSTEM","text":"The controls are as follows:"},{"name":"SYSTEM","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mouse: Left-click or right-click anywhere on screen<br>Keyboard: Any standard, unmodified key<br>Please note that chat will be temporarily disabled.</span><span class=\"alternative\">Controller</span><span class=\"alternative\">Gamepad</span><span class=\"alternative\">: All buttons and directional buttons except [???]</span></span> "},{"name":"SYSTEM","text":"To access the Pause menu, press the <span class=\"alternative-container\"><span class=\"alternative\">esc</span><span class=\"alternative\">Esc</span></span> key or [???] button, from which you may choose to end the performance."},{"name":"Q2","text":"Commence the performance?"},{"name":"A2","text":"Let the show begin."},{"name":"A2","text":"Not quite yet."},{"name":"A2","text":"Review how to perform."},{"name":"MARIORIE","text":"But of course, my friend. I did not mean to rush you. Whenever you are ready to begin the performance, you need but say the word."},{"name":"FRANCEL","text":"My friend... I have no words to express how deeply that performance moved me. The notes will resonate in my heart for a lifetime..."},{"name":"MARIORIE","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>, thank you for the most lovely performance. It was everything we had hoped it to be and then some."},{"name":"MARIORIE","text":"And from his glowing expression, I have little doubt Lord Francel feels the same. Pray go talk with him, won't you?"},{"name":"MARIORIE","text":"And with that, I should start preparing for the inevitable encore performance─to which I hope you would not be averse to taking part. Do stop by whenever you'd like."}],"reward":{"gil":680},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69536]},"next":[69538]},"partials":[{"type":"npc","id":"1035521","obj":{"i":1035521,"n":"Mariorie","l":3435,"q":2}},{"type":"quest","id":"69536","obj":{"i":69536,"n":"Francel's Fervent Wish","g":83,"l":"The Firmament","s":20,"f":1}},{"type":"quest","id":"69538","obj":{"i":69538,"n":"Smiles Cross the Sky","g":83,"l":"The Firmament","s":22,"f":1}}]}