{"quest":{"name":"A Delivery of Love","location":"Gridania","id":69532,"patch":5.4,"sort":200,"icon":101028,"eventIcon":71221,"issuer":1035151,"target":1035166,"genre":197,"journal":["Lisette de Valentione appears mildly distressed.<br>※This quest is available for a limited time only.","You approach a distressed Lisette de Valentione and learn of her ongoing struggle to educate Astrid, an apprentice emissary. In the midst of their discourse, a moogle by the name of Kupka Kupp appears, and promptly enlists both you and Astrid in a matter of the heart─it seems that his dear friend Elyne requires a special measure of encouragement. After reading her letter idolizing you as an adventurer, it is decided that some time spent at the melancholy girl's long-dreamed-of seaside might help in the formation of a plan. Kupka bids you meet him on the coast of middle La Noscea, near the mouth of the Agelyss River.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Upon arriving at the mouth of the river, it occurs to Astrid that a painting of the sparkling sea might help lift Elyne out of her melancholy. Kupka volunteers his artistic talents, then suggests that the exotic scent of the flowers which bloom to the northwest of Tiller's Rest would add another stimulating element to Elyne's gift. The chore of picking said flowers falls to you.","You carefully select some sweet-smelling flowers to present alongside Kupka's painting. Return to the moogle at the mouth of the Agelyss River.","Kupka appears well pleased with your floral selection. Using pigments prepared by Astrid, the moogle has already completed a masterpiece of a picture. The gift of encouraging love is ready. He urges you both to return with him to Gridania and search for Elyne at her usual haunt: Sweetbloom Pier.","Alongside you and Astrid, Kupka presents a starstruck Elyne with the painting and its fragrant accompaniment. Although momentarily buoyed by the thoughtful gift, the young lady sinks back into despondency when pressed to explain her recent dearth of enthusiasm. It would seem that despite her efforts in martial training, Elyne despairs of ever mastering the skills needed to venture beyond the Twelveswood. A few inspiring words from you, her hero, however, has an almost magical effect in improving her outlook. Thus emboldened, Elyne reveals she has a favor she would ask of you..."],"objectives":["Speak with Kupka Kupp near the mouth of the Agelyss River.","Obtain a sweet-scented posy from the northwest of Tiller's Rest.","Deliver the sweet-scented posy to Kupka Kupp.","Speak with Elyne at Sweetbloom Pier."],"dialogue":[{"name":"LISETTE","text":"Do you feel it, my friend? Love is in the air, and I, Lisette de Valentione, shall encourage one and all to reach out and seize it by the fistful!"},{"name":"LISETTE","text":"But wait...I know you! I never forget a champion of ardor and affection! 'Tis simply wonderful to see you again!"},{"name":"LISETTE","text":"Ah, Valentione's Day! The time has come for me and my fellow emissaries to enfold this realm in the tender embrace of ardor and affection. But I fear my perfect plan has encountered a tiny wrinkle..."},{"name":"LISETTE","text":"Did you perhaps recognize the anguish in mine eyes─the quiet desperation? Oh, what happy fortune has delivered unto me this gentle savior!"},{"name":"LISETTE","text":"The problem, you see, lies with young Astrid here. Oh, she does well enough as an apprentice, but she insists I allow her free rein as a full emissary. Too soon, I say! The bud has not yet flowered!"},{"name":"ASTRID","text":"Oh, Lisette. What more must I do to prove myself...?"},{"name":"KUPUKAKOPP","text":"(-???-)My dear child... Allow me to explain, kupo!"},{"name":"KUPUKAKOPP","text":"(-Mysterious Moogle-)One cannot expect to master romance in a matter of months! True understanding of love requires expansive experience and nuanced knowledge! Acquisition of such whimsical wisdom is the work of <span class=\"emphasis\">years</span>, kupo!"},{"name":"ASTRID","text":"A moogle...with a heart-shaped pom!? Where did you come from!?"},{"name":"KUPUKAKOPP","text":"I am Kupka Kupp, deliverer of penned passion, and maestro in the myriad matters of the heart! Any amateur emissary would be wise to heed my words, kupo!"},{"name":"KUPUKAKOPP","text":"...But I did not wing my way here to lecture green-stalked striplings. Nay, it is the adventurer with whom I have business."},{"name":"KUPUKAKOPP","text":"That letter's author is a girl by the name of Elyne─a dear friend of mine, and an incurable admirer of yours, kupo. Such a plucky young thing, she is, though lately stricken with deepest melancholy..."},{"name":"KUPUKAKOPP","text":"I cannot bear to see her brood so! If you will only help me, I am sure we can restore her usual good cheer, kupo!"},{"name":"Q2","text":"What will you say?"},{"name":"A1","text":"I'd be happy to!"},{"name":"A2","text":"As long as I don't do all the work..."},{"name":"ASTRID","text":"Then you must allow me to help as well! We serve the cause of love in all its forms, and a mission born of friendship certainly qualifies."},{"name":"KUPUKAKOPP","text":"The more the merrier, kupo! I'll not turn away aid freely offered, even from a fumbling fledgling."},{"name":"ASTRID","text":"Hmph. Well, I promise this “fumbling fledgling” will endeavor to do her best."},{"name":"ASTRID","text":"First things first: why don't we hear what Elyne has to say in her missive to you, adventurer? Just as the eyes are windows to the soul, so might her words permit us a glimpse into her heart."},{"name":"ELYNE","text":"(-Elyne's Letter-)<span class=\"emphasis\">Dear <span class=\"highlight\">Forename</span>,<br>I hope this letter finds you well. I've always heard how brave you are, so I decided to be brave too and tell you my story.</span>"},{"name":"ELYNE","text":"(-Elyne's Letter-)<span class=\"emphasis\">The truth is, I've never been outside the Twelveswood. I dreamed of building my strength and skills so that I could follow in your footsteps, and maybe one day see the sea with my very own eyes.</span>"},{"name":"ELYNE","text":"(-Elyne's Letter-)<span class=\"emphasis\">But now I'm not sure that day will ever come. I suppose I'll just have to imagine those sparkling shores, and be content with the tales of your adventures. I hope the roads you travel always bring you home safe and sound.</span>"},{"name":"ASTRID","text":"'Tis obvious she thinks the world of you, <span class=\"highlight\">Forename</span>. I wonder, then, what caused her to abandon her plans to travel the realm as you do."},{"name":"KUPUKAKOPP","text":"Elyne has spent long hours drilling in spear and bow, preparing herself for adventure... It makes no sense for her to suddenly give up, kupo!"},{"name":"ASTRID","text":"It certainly is a mystery. She loves the sea, yes? Perhaps if we visit the shore ourselves, it might provide the inspiration we need to encourage her."},{"name":"KUPUKAKOPP","text":"A fine idea, kupo! Come along with me to middle La Noscea, the pair of you. We can find a nice spot on the coast near the mouth of the Agelyss River!"},{"name":"LISETTE","text":"This is what Valentione's is all about, my dears. Go on, now! You can leave the festival events to me!"},{"name":"ASTRID","text":"I wish Elyne herself could see this. But if she can't─or won't─make the journey, then what would be the next best thing...?"},{"name":"KUPUKAKOPP","text":"Elyne loves to hear about the world beyond the Twelveswood, kupo! When I tell tales of my travels, she always hangs on every word."},{"name":"KUPUKAKOPP","text":"She seems especially enraptured by the idea of ocean waters sparkling in the sunlight. I suppose when one has lived one's whole life amongst the trees, such a sight sounds splendid indeed."},{"name":"ASTRID","text":"What if we were to bring such a sight <span class=\"emphasis\">to</span> Elyne? Perhaps a painting of the sea and its grandeur would serve to stoke the fires of this dream she has let burn so low!"},{"name":"KUPUKAKOPP","text":"...It just might work, kupo! Yes, I must have a canvas at once!"},{"name":"KUPUKAKOPP","text":"Whilst I am occupied with my easel, you must gather a posy of the sweet-scented flowers from hereabouts. The heady fragrance of Vylbrand will surely excite Elyne's senses just as well as the sight of its beauty."},{"name":"KUPUKAKOPP","text":"Might I suggest the blooms just northwest of Tiller's Rest? Those are particularly lovely, and shall perfectly complement my art!"},{"name":"KUPUKAKOPP","text":"The flowers if you would, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>. I must make preparations for my artwork!"},{"name":"ASTRID","text":"I shall see about providing Kupka with paints and such."},{"name":"ASTRID","text":"That was quick! But Kupka was even quicker─the painting is finished!"},{"name":"KUPUKAKOPP","text":"Ah, <span class=\"highlight\">Forename</span>! You encountered no difficulties picking flowers, I trust?"},{"name":"KUPUKAKOPP","text":"Perfect! A scent almost as evocative of this shoreline as the sea air itself, kupo!"},{"name":"KUPUKAKOPP","text":"And with the paints our fledg─er, Miss Astrid was so kind as to provide, I have but this moment completed my depiction of the sea!"},{"name":"ASTRID","text":"I was able to employ a secret an artist once taught me about La Noscean shells: ground up and mixed with water, they make for pigments of surprisingly good quality. It seemed the perfect choice for the task at hand."},{"name":"KUPUKAKOPP","text":"Pray forgive me for calling you a stripling, kupo! Your assistance has been both apt and timely!"},{"name":"KUPUKAKOPP","text":"Right, then! Now that we have blooms and painting both, let us deliver our bounty of love. If I know Elyne─and I do─she will be mooning about in the vicinity of Sweetbloom Pier, kupo."},{"name":"ELYNE","text":"<span class=\"highlight\">Forename</span>! It's really you! I... Kupka didn't say anything about bringing you back with him!"},{"name":"KUPUKAKOPP","text":"<span class=\"highlight\">Forename</span> and Astrid have been helping me prepare a little gift for you, Elyne!"},{"name":"KUPUKAKOPP","text":"My work keeps me ever busy delivering love and happiness to others, but this time it's your turn, kupo!"},{"name":"KUPUKAKOPP","text":"I've painted you a picture of the La Noscean sea! Do you like it? Astrid here made the paints herself out of seashells, kupo. And <span class=\"highlight\">Forename</span> carefully picked the perfect flowers to accompany the scene."},{"name":"ELYNE","text":"It's so pretty! And this scent─I could close my eyes and imagine I was on a faraway island!"},{"name":"KUPUKAKOPP","text":"Even more breathtaking sights and sounds─and smells!─await you in distant lands, kupo! Why not go and visit them yourself? Why give up on your dreams?"},{"name":"ELYNE","text":"Oh, Kupka..."},{"name":"ELYNE","text":"I tried to do better, I really did. But no matter how much I practiced my archery and spearwork, I never seemed to improve compared to the other students."},{"name":"ELYNE","text":"Just wandering the Twelveswood is dangerous enough. If I can't even protect myself here, how could I think of exploring further? It was a silly idea..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You should keep up your training."},{"name":"A2","text":"Why not try conjury instead?"},{"name":"A3","text":"Have you looked into botany?"},{"name":"ELYNE","text":"Will it make any difference, you think? But maybe you're right. Maybe I gave up too soon!"},{"name":"ELYNE","text":"I...never thought of that. There's more than one way to become an adventurer, isn't there? I should go and visit the Conjurers' Guild!"},{"name":"ELYNE","text":"Become a botanist, you mean? I guess they do learn how to move safely through the wilds. That could be useful to know!"},{"name":"KUPUKAKOPP","text":"Thank you Astrid, <span class=\"highlight\">Forename</span>─a little gift and a few inspiring words have done the trick! How delightful to see Elyne so positive again, kupo!"},{"name":"ASTRID","text":"I am thrilled to have been of service! And, yes, what a wonderful feeling to put a smile on your dear friend's face!"},{"name":"KUPUKAKOPP","text":"Hmmm, feeling, feeling... Why do I have the feeling I'm forgetting something, kupo?"},{"name":"KUPUKAKOPP","text":"Ah! Pluck my pom, kupo!"},{"name":"KUPUKAKOPP","text":"I still have a delivery to make in Ul'dah! The Songbirds must have their love letters, kupo!"},{"name":"ELYNE","text":"Um, <span class=\"highlight\">Forename</span>? If you're not in too much of a hurry, do you think I could ask you a favor...?"}],"reward":{"gil":296},"reqs":{"jobs":[{"lvl":15,"id":1}],"questsType":"any","quests":[66043,66064]},"next":[69533]},"partials":[{"type":"npc","id":"1035151","obj":{"i":1035151,"n":"Lisette De Valentione","l":53,"q":2}},{"type":"npc","id":"1035166","obj":{"i":1035166,"n":"Elyne","l":55,"q":1}},{"type":"quest","id":"66043","obj":{"i":66043,"n":"The Gridanian Envoy","g":1,"l":"Gridania","s":86}},{"type":"quest","id":"66064","obj":{"i":66064,"n":"The Ul'dahn Envoy","g":1,"l":"Ul'dah","s":88}},{"type":"quest","id":"69533","obj":{"i":69533,"n":"Little Lady Adventurer","g":197,"l":"East Shroud","s":201}}]}