{"quest":{"name":"Warm Hands, Warm Hearts","location":"The Firmament","id":69539,"patch":5.41,"sort":2004,"eventIcon":71221,"issuer":1032813,"target":1035315,"genre":84,"journal":["Peyraquile's eyes gleam with determination."],"objectives":["Speak with Julchiezain.","Speak with Julchiezain again.","Deliver the goods to Peyraquile.","Search for Peyraquile."],"dialogue":[{"name":"PEYRAQUILE","text":"Oh, hello again! How have you been? As for us, we've been helping Rasequin out like always. He tells us we're doing a better job with every passing day!"},{"name":"PEYRAQUILE","text":"Speaking of which, have you been to Risensong yet? It's such a nice place─you can even hear music playing from time to time. Actually, we've been thinking how wonderful it would be if we could find work there!"},{"name":"HWDCHILDA04003","text":"(-???-)Lycelle! My friends!"},{"name":"LYCELLE","text":"Oh, it's you! Whatever's the matter?"},{"name":"HWDCHILDA04003","text":"You won't believe this, but...I'm leaving the orphanage!"},{"name":"JULCHIEZAIN","text":"So they found a new family for you!? ...I mean, hmph. Good for you, I suppose."},{"name":"HWDCHILDA04003","text":"Yes, I have! My new father, he's a knight, you see! And my new mother is the nicest lady you'll ever meet!"},{"name":"HWDCHILDA04003","text":"Anyway, so Rasequin told me to come here and say...and say... Oh, I can't do it! I don't want to say good-bye to all of you!"},{"name":"LYCELLE","text":"Oh, don't cry like that! Even after you start living with your new family, you can come and play with us whenever you want."},{"name":"JULCHIEZAIN","text":"That's right! And if they're ever mean to you, me and my best friend here will give them a good pounding for you!"},{"name":"JULCHIEZAIN","text":"Isn't that right?"},{"name":"PEYRAQUILE","text":"And how about this? For those times when you can't leave home, we'll make a memento for you so that you can remember us at any time. How would you like that?"},{"name":"HWDCHILDA04003","text":"You...you'd really do that for me? Oh, thank you, my friends! I have to go back to the orphanage now, but I'll be waiting there until my new father comes. Be seeing you!"},{"name":"PEYRAQUILE","text":"I just blurted that out without asking Lycelle and Julchiezain first, but they won't mind...will they?"},{"name":"LYCELLE","text":"Peyraquile's always coming up with big and exciting ideas. It's really quite impressive!"},{"name":"JULCHIEZAIN","text":"A memento, huh? That's such a good idea, I wish I─ I mean, I was thinking the exact same thing myself!"},{"name":"PEYRAQUILE","text":"Yes, I'm glad you agree, but...whatever should we make them? I haven't the slightest idea..."},{"name":"JULCHIEZAIN","text":"Good thing that I have plenty of them! For example...how about a pair of nice, fluffy gloves so he can always keep his hands warm?"},{"name":"PEYRAQUILE","text":"Yes...that doesn't seem like it would be too difficult."},{"name":"JULCHIEZAIN","text":"That settles it, then! Well, I guess it's off to Marcelloix's shop for us. You don't mind coming along, do you?"},{"name":"LYCELLE","text":"I'll check with Rasequin to see when our friend's father is coming. After all, there's no point in making a present if we're too late to give it to him."},{"name":"PEYRAQUILE","text":"I'll ready the tools so we can get to work right away! "},{"name":"LYCELLE","text":"Hm? Oh, you don't have to worry about me."},{"name":"HWDCHILDA04003","text":"Do you know what they're making for me? Don't tell me─I want it to be a surprise!"},{"name":"MARCELLOIX","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>! It's not often I see you in the company of children. Whatever is the occasion?"},{"name":"JULCHIEZAIN","text":"Oh, there you are! Isn't Mister Marcelloix just the best?"},{"name":"JULCHIEZAIN","text":"He may look a bit scary, but he's so nice to us─and the toys he makes are simply incredible! I'm glad I'm not one of those babies that's too frightened to talk to him."},{"name":"JULCHIEZAIN","text":"Hello there, Mister Marcelloix! We're in need of some yarn to knit a pair of gloves for a friend. Might you be able to spare some?"},{"name":"MARCELLOIX","text":"Julchiezain! Always a pleasure to see you, my young friend. If it's yarn you need, it's yarn you'll get. But before that, allow me to share with you a little story."},{"name":"MARCELLOIX","text":"As a matter of fact, your friend <span class=\"highlight\">Forename</span> here is a true hero. It's thanks to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> and Lord Francel that I have a home here in the Firmament. Did you know that?"},{"name":"JULCHIEZAIN","text":"Really? That's amazing! You really are a hero, <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">mister</span></span>!"},{"name":"MARCELLOIX","text":"Truly, I know of none who have done more to bring happiness and prosperity to the people like you. And so I am proud to bestow upon you this spindle of yarn free of charge. May it serve you and your young friends well!"},{"name":"JULCHIEZAIN","text":"Oh, thank you, Mister Marcelloix! Till next time!"},{"name":"MARCELLOIX","text":"I promise you that my yarn is the finest in Ishgard. May it make a warm and toasty pair of gloves for the children."},{"name":"JULCHIEZAIN","text":"So you're friends with Mister Marcelloix just like me! Great minds think alike, I always say!"},{"name":"PEYRAQUILE","text":"Were you able to procure the yarn from Marcelloix's shop? I've readied everything else we need."},{"name":"PEYRAQUILE","text":"Wonderful! Now, all we need is to find Lycelle..."},{"name":"LYCELLE","text":"(-Lycelle's Voice-)That won't be necessary."},{"name":"LYCELLE","text":"And look who I've brought with me! After all, what would make for a nicer memory than if we were to make his present right before his very eyes─don't you agree?"},{"name":"HWDCHILDA04003","text":"They're so warm and fluffy! Oh, thank you, my friends! I'll treasure these gloves forever!"},{"name":"REDWALD","text":"(-???-)Ah, there you are, my child."},{"name":"HWDCHILDA04003","text":"Oh, Mister Redwald─er...I mean..."},{"name":"HWDCHILDA04003","text":"Welcome back...Father!"},{"name":"REDWALD","text":"Of course, nothing would make me happier than for you to call me so, my boy. But there is no need to force yourself. After all, this is only our first of many days together."},{"name":"JULCHIEZAIN","text":"<span class=\"emphasis\">This</span> is your new father? I think I might be jealous!"},{"name":"REDWALD","text":"And you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. I have heard much from Lord Drillemont of your selfless contributions to the restoration effort─but I did not expect to find you here in the flesh. The heavens smile upon me today, indeed."},{"name":"REDWALD","text":"I am pleased to report that─thanks in no small part to your efforts─the Falcon's Nest flourishes like never before. With things having settled down some, many of our soldiers and artisans have even brought their families to come reside with them."},{"name":"REDWALD","text":"My wife and I now live together as well, and it recently occurred to us how delightful it would be to welcome a new member of the family─a gift we sadly were not blessed with in our younger days."},{"name":"REDWALD","text":"I must confess, I was surprised at first to see how reluctant the boy was to leave this place. Yet seeing the warmth and camaraderie that fills this place, I now understand entirely. Rest assured that we shall do all in our power to see the boy is happy and cherished in his new home."},{"name":"HWDCHILDA04003","text":"Well, I suppose I'd best be off with Father here! But don't worry─I'll be back to play someday!"},{"name":"JULCHIEZAIN","text":"...Do you really think he'll come back to visit?"},{"name":"JULCHIEZAIN","text":"Anyhow, I have an idea! He wasn't the first to say good-bye to this place, and he won't be the last. What if we make giving those same pair of gloves a tradition for every child who leaves the orphanage in the future?"},{"name":"LYCELLE","text":"I had the same idea! That way, even if we all go our separate ways, it will be as if we're always together, forever!"},{"name":"PEYRAQUILE","text":"Go our separate ways..."},{"name":"JULCHIEZAIN","text":"Peyraquile? You don't look good. Whatever's the matter?"},{"name":"PEYRAQUILE","text":"I...I'm sorry. I'm just a bit tired. I think I'll go lie down for a while."},{"name":"LYCELLE","text":"When Peyraquile goes off like that on his own, that usually means he has something on his mind. I don't want to pry, but..."},{"name":"LYCELLE","text":"It's so cold out here, and I'm sure he's feeling lonely─even if he won't admit it. Might I ask you to check on him for us? I can't help but feel he'd find it easier to talk to you..."},{"name":"LYCELLE","text":"He can't have gone far, so it shouldn't be hard to find him. Please? I'll follow along out of sight."},{"name":"JULCHIEZAIN","text":"Peyraquile's always going off to sulk on his own. I'll never understand why─aren't we his best friends, after all?"},{"name":"LYCELLE","text":"Have you found Peyraquile yet? I'm sure he's just found himself some secluded area close by..."},{"name":"PEYRAQUILE","text":"&lt;sniffle&gt; &lt;sob&gt;..."},{"name":"PEYRAQUILE","text":"<span class=\"highlight\">Forename</span>! I-I'm not crying... It's just...s-some snow fell in my eye, and..."},{"name":"PEYRAQUILE","text":"Oh, I'll admit it. It's just that...I love my friends here so much. When Lycelle said what she said, I couldn't help but imagine the three of us going off far away, never to see each other again..."},{"name":"PEYRAQUILE","text":"We're the oldest here, after all. Even if they can't find families for us, we won't be able to stay here forever. More likely than not, we'll have to go off on our own..."},{"name":"PEYRAQUILE","text":"Having to make a new life for myself in a cruel, unfamiliar world...without a family or my dear friends by my side...the thought is just too much to bear!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You're not alone."},{"name":"A1","text":"You're stronger than you give yourself credit for."},{"name":"LYCELLE","text":"(-Lycelle-)That's right!"},{"name":"LYCELLE","text":"(-Lycelle-)<span class=\"alternative-container\"><span class=\"alternative\">She's</span><span class=\"alternative\">He's</span></span> right, you know! And more than that..."},{"name":"LYCELLE","text":"We might not be related by blood, and we might not know our mothers and fathers...but <span class=\"emphasis\">we're</span> a family, aren't we? You and me and Julchiezain!"},{"name":"LYCELLE","text":"Why, I've thought all along that when we leave here, we could open a shop together! We could make our living crafting and building things to make people's lives better, just like we do now! What's this talk of going off by yourself somewhere!?"},{"name":"JULCHIEZAIN","text":"That's right! Why, we can even travel to other nations and sell our goods far and wide!"},{"name":"JULCHIEZAIN","text":"And then when we're done, we can come back here, and bring presents from around the world to the orphans! Wouldn't that be just the best?"},{"name":"LYCELLE","text":"See? What's wrong with <span class=\"emphasis\">that</span> kind of family? <span class=\"highlight\">Forename</span> here didn't end the war just so you could sulk around all alone! We have a bright future ahead of us─we need to dream big! So what do you say, Peyraquile?"},{"name":"PEYRAQUILE","text":"Y-Yes... Yes, my friends! Oh, I would like nothing more!"},{"name":"PEYRAQUILE","text":"Th-Thank you, <span class=\"highlight\">Forename</span>... I'm sorry to have worried you so."},{"name":"PEYRAQUILE","text":"Tell me─if we <span class=\"emphasis\">do</span> go off traveling the world like Lycelle says, might we run into you somewhere? Truly, nothing would make me happier..."},{"name":"PEYRAQUILE","text":"So please, keep an eye out for those gloves you helped us make─that's how you'll spot us. Safe travels, friend, till we meet again!"}],"reward":{"gil":778,"items":[{"num":10,"id":30130}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"questsType":"all","quests":[69538,69495]}},"partials":[{"type":"npc","id":"1032813","obj":{"i":1032813,"n":"Peyraquile","l":3435,"q":3}},{"type":"npc","id":"1035315","obj":{"i":1035315,"n":"Peyraquile","l":3435,"q":1}},{"type":"item","id":"30130","obj":{"i":30130,"n":"Magicked Prism (Temple Knights)","l":1,"c":22630,"t":61}},{"type":"quest","id":"69538","obj":{"i":69538,"n":"Smiles Cross the Sky","g":83,"l":"The Firmament","s":22,"f":1}},{"type":"quest","id":"69495","obj":{"i":69495,"n":"A Fashionable Friendship","g":84,"l":"The Firmament","s":2003}}]}