{"quest":{"name":"Smiles Cross the Sky","location":"The Firmament","id":69538,"patch":5.41,"sort":22,"icon":101030,"unlocksFunction":1,"eventIcon":71341,"issuer":1035527,"target":1035529,"genre":83,"journal":["Francel closes his eyes deeply, seemingly lost in reverie.","Never ashamed to wear his feelings on his sleeve, Lord Francel appears more emotional than ever as he thanks you profusely for taking the stage with him today. Your moment of shared reverie, however, is interrupted by Thomelin, who announces the arrival of an unexpected and assumedly important visitor. Join Francel at the Mendicant's Court to see what development might await you.","You arrive at the Mendicant's Court to discover that your unexpected guest is none other than Ser Aymeric, who, in his own words, has been waiting for the ideal opportunity to express his thanks to Lord Francel for his selfless efforts in rebuilding and revitalizing the Firmament. The young lord, for his part, seems rightly intimidated by the sudden and unexpected praise. Speak with him and pray reassure him that this can only be a positive development.","Though remaining halfway in a state of shock at Ser Aymeric's sudden arrival, Lord Francel is nevertheless deeply satisfied and pleased to see his vision of the Firmament finally realized. With confidence that the current generation of Ishgard's luminaries─not to mention the people who form the living, breathing heart of the nation itself─are prepared to usher the Holy See into a new age of prosperity, you offer your most sincere thanks to your companion for his unwavering foresight and devotion to the cause, and promise that you will return in the future to further see his visions become reality."],"objectives":["Speak with Francel.","Speak with Francel once more."],"dialogue":[{"name":"MARIORIE","text":"Judging from his beaming expression, Lord Francel simply cannot wait to share his thoughts on the performance with you. Pray entertain him, won't you?"},{"name":"FRANCEL","text":"<span class=\"highlight\">Forename</span>, you have left me at a loss for words once more. I have long dreamed of this day, and yet somehow it has exceeded even my wildest expectations."},{"name":"FONCRINEAU","text":"It was an honor to count myself among your audience, my lord. To be on hand as the two <span class=\"alternative-container\"><span class=\"alternative\">individuals</span><span class=\"alternative\">men</span></span> responsible for restoring life to the Firmament paid tribute to its rebirth─why, it nigh brought a tear to this old man's eye."},{"name":"FONCRINEAU","text":"To think that I would live to see Ishgard enter a true age of renaissance. Truly, I am blessed beyond belief..."},{"name":"FRANCEL","text":"I, too, oft find myself scarcely able to believe all that has come to pass. Foncrineau, pray remind me not to forget to express my gratitude to the others."},{"name":"FRANCEL","text":"That said, <span class=\"highlight\">Forename</span>, I do not know whether to be impressed or offended that you saw fit to keep this whole matter a secret from me. You know full well that I would have been more than willing to assist you in preparing for the festivities."},{"name":"FRANCEL","text":"But that is the smallest of qualms when I think of what this day must mean to all that have toiled to restore the Firmament to its former glory─and far beyond."},{"name":"FRANCEL","text":"Not to mention to all those who live, work, and play within these streets...both today and for the many, many years to come."},{"name":"FRANCEL","text":"If you will humor me, my friend, there is one last thing I would ask you."},{"name":"FRANCEL","text":"Despite being branded and hunted down as heretic, you ne'ertheless delivered our nation from the throes of war and ushered Ishgard into a new age of enlightenment."},{"name":"FRANCEL","text":"And Lord Haurchefant─your close companion and mine─in even the most trying of times, was ever a friend to the people, regardless of their blood or station. Ever did he strive to bring them joy and a brighter future."},{"name":"FRANCEL","text":"You and Lord Haurchefant were more than my friends and comrades. You were a beacon in the sky, a guiding light illuminating the path that I, too, could only dare to dream I might tread."},{"name":"FRANCEL","text":"And so─as best I could muster─I followed in your footsteps, that I might bring happiness to my countrymen in my own humble way."},{"name":"FRANCEL","text":"Pray tell me, my friend─have I done this? Do my contributions to this nation even begin to live up to the legacy that you and Lord Haurchefant have built?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You have done your homeland proud."},{"name":"A1","text":"Let's not get carried away with ourselves, shall we?"},{"name":"FRANCEL","text":"Truly, <span class=\"highlight\">Forename</span>? Oh, you cannot begin to imagine what it means to me to hear such words from you! This...this is the happiest day of my life!"},{"name":"FRANCEL","text":"Ahaha! Er, right...do forgive me. I meant it only in jest. Chlodebaimt did always impress on me the importance of humility. I will redouble my efforts, that one day I might be genuinely worthy of your praise."},{"name":"FRANCEL","text":"And now, if you would allow me just one final word."},{"name":"FRANCEL","text":"Countless Ishgardians gave their lives in the war. Among those who have lived to see this age, there is not a one who does not realize that their happiness is built upon the sacrifices of those who came before them."},{"name":"FRANCEL","text":"Needless to say, I feel the same. And I believe that the only true way for us to express our gratitude is to make the most of every single day we have, and spare no effort to leave an even brighter world to those who will follow after us."},{"name":"FRANCEL","text":"To that end, I offer my most heartfelt wishes for your continued health and happiness."},{"name":"FRANCEL","text":"As hero of not just our own land, but countless others, I know the burdens you bear are great. I can only pray to the Fury that you are blessed with joy and prosperity far exceeding that which you have brought to all those whose lives you have touched."},{"name":"THOMELIN","text":"(-???-)Lord Overseer! "},{"name":"THOMELIN","text":"L-Lord Overseer! You must come at once! We...we have a visitor! Oh, could it truly be─!?"},{"name":"FRANCEL","text":"Whatever is the meaning of this!? <span class=\"highlight\">Forename</span>, you heard the man! With me!"},{"name":"FONCRINEAU","text":"Whatever could be happening? I do hope it is nothing too dire. My weary heart has had enough excitement for the day..."},{"name":"FRANCEL","text":"Whoever do you suppose this visitor is? I've asked Thomelin to escort our guest here, so let us wait for their arrival."},{"name":"AYMERIC","text":"My apologies for the unexpected intrusion, Lord Francel."},{"name":"AYMERIC","text":"<span class=\"highlight\">Forename</span>! 'Tis always a pleasure to see you. And yet your presence here tells me that my own arrival has come too late..."},{"name":"AYMERIC","text":"All of Ishgard has waited in anticipation of the day when we might celebrate the Firmament's restoration. When I heard that a commemorative ceremony was to be held, I finished up my duties as best I could that I, too, might attend. And yet..."},{"name":"FRANCEL","text":"Pray forgive me, Ser Aymeric. The festivities were prepared in secret by my friends here, and I, myself, was not privy to them. Had I known, your name, of course, would have been atop the guest list..."},{"name":"AYMERIC","text":"Think nothing of it, Lord Francel. 'Twas a celebration of, by, and for the people of the Firmament, yes? Your own presence here doubtless carried far more weight in their eyes than would have mine own."},{"name":"AYMERIC","text":"And yet, if I might inquire, just what manner of ceremony was it? At the very least, I would relive it through your words."},{"name":"FRANCEL","text":"B-But of course, my lord! My good friends here arranged for a group of players to perform a commemorative concert. Why, I even had the honor of taking the stage to perform a duet with <span class=\"highlight\">Forename</span>, here."},{"name":"AYMERIC","text":"Indeed. Truly, you are a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of many talents, <span class=\"highlight\">Forename</span>..."},{"name":"AYMERIC","text":"Not long ago, our people's hearts weighed heavy─their worries of whether they could put food on their plates, or even live to see the morrow. Today, these same people smile as they walk these streets, and fill the air with song..."},{"name":"AYMERIC","text":"Long-suffering souls whose bodies are battered, who wanted for a roof over their head and warm clothes on their back─these same men and women now ply their trade as machinists, as merchants, breathing new life into our proud nation."},{"name":"AYMERIC","text":"And today, Ishgard sees its culture flowers and blossoms yet further, as the joy of music takes root in the hearts of the people, sending their hopes and dreams ever skyward."},{"name":"AYMERIC","text":"Lord Francel. For leading the restoration, and for all you have done to see the Firmament transform into the living embodiment of our nation's new age, I commend you."},{"name":"FRANCEL","text":"You do me too great an honor, Ser Aymeric. Though I am hardly worthy of such praise, I will endeavor not to disappoint you with my future efforts."},{"name":"AYMERIC","text":"And with that, I had best return to my duties. 'Twas an honor to join you for even the briefest of moments and see the remarkable work you have wrought. I shall return in the coming days for a closer examination."},{"name":"FONCRINEAU","text":"To think Ser Aymeric would heap such praise upon my lord... This is all thanks to you, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>. You have our eternal gratitude."},{"name":"FRANCEL","text":"Phew! Try as I might, I always find myself at a loss for words when standing before Ser Aymeric. I am relieved I did not embarrass myself any further."},{"name":"FRANCEL","text":"Come to think of it...it all began here, did it not? I speak, of course, of the restoration effort itself..."},{"name":"FRANCEL","text":"In the beginning, I could scarce even grasp what I was trying to accomplish. I was fumbling about in the shadows, with you as my only guide... And yet, look at the Firmament now."},{"name":"FRANCEL","text":"It is the beating heart of our new Ishgard, its residents and visitors alike pumping life into our nation. And it will continue to do so long after I am gone."},{"name":"FRANCEL","text":"Needless to say, I know as well as any that my duties as lord overseer are far from complete. I will do all in my power to see that the Firmament is ever a welcoming place for one and all, Ishgardian or traveler alike."},{"name":"FRANCEL","text":"I hope that you, too, <span class=\"highlight\">Forename</span>, will grace us with your presence from time to time. Pray always think of the Firmament as one of your homes away from home."},{"name":"SYSTEM","text":"Due in no small part to your tireless efforts, the restoration of the Firmament is at long last complete."},{"name":"SYSTEM","text":"That said, there is yet a need to maintain a steady flow of supplies for use in maintenance and upkeep. To that end, you may still procure materials from the Diadem and deliver them to the Mendicant's Court."},{"name":"SYSTEM","text":"Furthermore, should you wish to put on an encore performance of the commemorative concert, you need simply speak to Mariorie at any time."},{"name":"SYSTEM","text":"Finally, the art dealer in the Mendicant's Court now has a selection of paintings honoring the reconstruction of the Firmament available for purchase!"}],"reward":{"items":[{"id":33109}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69537]},"next":[69539,69540,69541,69542,69615]},"partials":[{"type":"npc","id":"1035527","obj":{"i":1035527,"n":"Francel","l":3435,"q":1}},{"type":"npc","id":"1035529","obj":{"i":1035529,"n":"Francel","l":3435,"q":2}},{"type":"item","id":"33109","obj":{"i":33109,"n":"New Foundations Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"69537","obj":{"i":69537,"n":"An Unexpected Symphony","g":83,"l":"The Firmament","s":21,"f":1}},{"type":"quest","id":"69539","obj":{"i":69539,"n":"Warm Hands, Warm Hearts","g":84,"l":"The Firmament","s":2004}},{"type":"quest","id":"69540","obj":{"i":69540,"n":"Of Steam, Sweat, and Water","g":84,"l":"The Firmament","s":1202}},{"type":"quest","id":"69541","obj":{"i":69541,"n":"Swords to Plowshares","g":84,"l":"The Firmament","s":1203}},{"type":"quest","id":"69542","obj":{"i":69542,"n":"Planting the Seed","g":84,"l":"The Firmament","s":1204}},{"type":"quest","id":"69615","obj":{"i":69615,"n":"You Can Count on It","g":84,"l":"The Firmament","s":1502,"f":1}}]}