{"quest":{"name":"Francel's Fervent Wish","location":"The Firmament","id":69536,"patch":5.41,"sort":20,"unlocksFunction":1,"eventIcon":71341,"issuer":1035520,"target":1035521,"genre":83,"journal":["Conon would consult with you regarding bringing a certain idea of his to fruition.","Conon thanks you for entertaining his entreaty, and shares you the plan he hopes to put into action. To wit: he would see completion of the reconstruction effort celebrated─and pay tribute to Lord Francel's selfless contributions─by holding a surprise commemorative concert. He has already recruited Marcelloix to the cause, and the enterprising provisioner has already prepared a host of instruments. Finally, they suggest one final step to make the occasion truly special─they intend for you and Francel to take the stage together and perform a duet. That said, they are unsure as to what instrument the young lord most fancies. At their request, you offer to inquire with Foncrineau, that you might glean the information necessary.","Foncrineau is overjoyed at your offer to hold a concert in Lord Francel's honor. Quick to offer his aid with anything you might need, he suddenly hits upon an idea, and bids you wait while he summons a certain personage who might be especially suited to lend support to your efforts.","Minutes later, none other than Lord Artoirel appears on the scene. The renowned collector of orchestrion rolls─and accomplished composer in his own right─proffers one of his own pieces for the occasion: a piano duet he penned in honor of the Firmament's rebirth. More certain than ever that the event will be one to remember, you set off for Saint Roalle's Dais to practice for your own role in the festivities.","You plink and plonk about at the piano for a spell of time, but find the complexities of Artoirel's composition beyond your fingers' ability to articulate. You are, however, confident that you will be able to perform the piece to your satisfaction with more practice. Take a seat at the piano again and see what fruits your efforts might bear.","After what feels like hours of practice, you at long last feel confident in your ability to do Artoirel's masterwork justice. Seek out Mariorie, who has been charged with overseeing the festivities, and inform her that you are ready to take the stage.","Mariorie beams at hearing that you are ready for the concert, and cheerfully informs you that the other performers have all but assembled as well. It is nigh time to raise the curtain on the Firmament's crowning hour."],"objectives":["Speak with Foncrineau in the Firmament.","Wait for your guest at the designated location.","Practice the piano.","Practice the piano some more.","Speak with Mariorie."],"dialogue":[{"name":"FONCRINEAU","text":"Did you find the Risensong Quarter to your favor, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>?"},{"name":"CONON","text":"I have heard much of your boundless generosity, but never did I believe the savior of Ishgard <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> would entertain my humble request."},{"name":"CONON","text":"Now, allow me to explain─"},{"name":"MARCELLOIX","text":"(-???-)Before that, pray let us join you, my friends!"},{"name":"MARCELLOIX","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>! How do you fare these days? As for me, I'm pleased to report that business at my provisioners' shop is positively booming of late. Truly, I owe it all to you and Lord Francel."},{"name":"MARCELLOIX","text":"Speaking of which, that is precisely why we had hoped to speak with you today. We were discussing how nice it would be if we were able to do something to celebrate the Firmament's restoration, and express our gratitude to Lord Francel for all he has done on our behalf."},{"name":"CONON","text":"I was speaking with Foncrineau, and he mentioned that his master is particularly fond of music, and in fact has long dreamed of establishing his own orchestra."},{"name":"CONON","text":"While that may be beyond our abilities, I thought the very least we could do would be to arrange for a concert of sorts to be held in his honor."},{"name":"CONON","text":"To that end, we are working to acquire the needed instruments...without consulting Lord Francel. We mean for this to be a surprise, you see."},{"name":"CONON","text":"My friends tell me that you are among Lord Francel's closest friends and confidants. I am certain that nothing would please him more than to see your face among the performers. What do you say?"},{"name":"MARCELLOIX","text":"Splendid! I knew we could count on you. I, too, have endeavored to do my part by putting together the necessary instruments, using parts and techniques I learned from a traveling artisan in town."},{"name":"MARCELLOIX","text":"It's far from a full orchestra, I'm afraid, but at the very least, we have a piano, woodwinds, and strings. We just set the piano in Saint Roelle's Dais before coming here. Fortunately, it did not seem to arouse Lord Francel's suspicion."},{"name":"MARCELLOIX","text":"Furthermore, I've made an effort to procure a pair of every instrument. Should the mood strike Lord Francel, I thought few things would stir the hearts of the townspeople than seeing the two of you play a duet."},{"name":"MARCELLOIX","text":"That said, I must confess that I am unsure as to what instrument our benefactor most favors. Might you be so kind as to inquire with Foncrineau for me? And pray remind him not to divulge the matter to Lord Francel himself..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Leave it to me."},{"name":"A1","text":"I'll try my best..."},{"name":"MARCELLOIX","text":"Many thanks! And with that, I had best return to the dais to complete our preparations."},{"name":"MARCELLOIX","text":"Mariorie here will be overseeing the finer details of the concert. Should you have any questions at all about the event, she will be more than happy to enlighten you."},{"name":"MARCELLOIX","text":"And remember, we must spare no effort to ensure that this remains a secret. We're counting on you, my friend!"},{"name":"MARCELLOIX","text":"What do you think of the instruments? I'll have you know that every single one is homemade by these very hands! I promise you that each was made with painstaking precision."},{"name":"CONON","text":"Yes, I do believe this should make for a good venue..."},{"name":"MARIORIE","text":"It is the highest of honors to count the savior of Ishgard <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> among our performers. I hope that you will enjoy being a part of the event as much as our audience will no doubt appreciate your presence."},{"name":"FONCRINEAU","text":"Ah, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. If it is Lord Francel you seek, I fear he has already returned to his quarters. Is there aught assistance I might offer?"},{"name":"FONCRINEAU","text":"A concert, you say? To commemorate the completion of the restoration effort? Lord Francel would be overjoyed─of this I have no doubt. Truly, I cannot thank you enough for your most generous sentiment."},{"name":"FONCRINEAU","text":"The young lord is quite adept with many an instrument. As to which he most favors playing..."},{"name":"FONCRINEAU","text":"On second thought, I have an idea. There is a person I would like you to meet. Might I ask you to wait here for just a moment?"},{"name":"FONCRINEAU","text":"My apologies for keeping you waiting, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>."},{"name":"ARTOIREL","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>! 'Tis an honor and a pleasure both to see you again. Pray forgive me─I was unaware that you were aiding us in the restoration effort. If I had known, I would have paid my respects far sooner."},{"name":"ARTOIREL","text":"I am happy to see you hale and hearty─I feared the worst when I heard about your condition. As for our part, the situation at the Ghimlyt Dark remains at an impasse. Ser Aymeric returned from the front not long ago, and I have just now followed suit."},{"name":"ARTOIREL","text":"The situation at the Ghimlyt Dark remains at an impasse. Ser Aymeric returned from the front not long ago, and I have just now followed suit. We cannot very well neglect our duties here at home, after all."},{"name":"ARTOIREL","text":"My steward Firmien mentioned that he had heard from an attendant of House Haillenarte word of plans for a celebration commemorating the Firmament's restoration. I take it that you, too, are involved with this?"},{"name":"FONCRINEAU","text":"I took the liberty of informing Lord Artoirel of your intention to hold a concert in Lord Francel's honor."},{"name":"FONCRINEAU","text":"Perhaps you are unaware, but Lord Artoirel is one of the realm's foremost collectors of orchestrion rolls. Much as I had hoped, he has taken a keen interest in your idea."},{"name":"ARTOIREL","text":"To tell the truth, in addition to my collection, I have been known to dabble in the art of composition myself."},{"name":"ARTOIREL","text":"As a matter of fact, I have penned a duet for the piano inspired by the sights and sounds of the Firmament. Nothing would give me greater honor than if you and Francel were to perform it together at the festivities."},{"name":"FONCRINEAU","text":"A splendid idea, indeed. My lord has quite a passion for the piano, and I am certain he would be more than pleased to perform your piece."},{"name":"FONCRINEAU","text":"If my eyes did not deceive me, a most stately piano already sits atop Saint Roelle's Dais. If you have a moment or two to spare, pray consider playing a little tune or two on it to practice. Often it takes time to get accustomed to a new instrument."},{"name":"FONCRINEAU","text":"In the meantime, I shall ask around and see if I cannot find a few more skilled performers willing to join you up on stage."},{"name":"ARTOIREL","text":"Marvelous! In that case, I shall return home and prepare a transcription of the score at once."},{"name":"ARTOIREL","text":"I must confess, just the thought of hearing the sweet sound of music ringing out across the Firmament has me feeling as giddy as a schoolboy. It will be all I can do to stop myself from skipping and dancing through the streets."},{"name":"SYSTEM","text":"An impressive-looking piano sits atop Saint Roelle's Dais, inviting you to tickle its keys."},{"name":"Q2","text":"Practice the piano?"},{"name":"SYSTEM","text":"You feel as if your piano-playing skills have improved considerably!"},{"name":"SYSTEM","text":"Your diligent effort before seems to have borne fruit, though you feel as if there is room for improvement. Practice the piano some more?"},{"name":"Q3","text":"Practice the piano?"},{"name":"SYSTEM","text":"Having completed your practice, you now feel confident that you could comfortably perform any tune placed before you."},{"name":"SYSTEM","text":"Your fingers tickle the keys with ease, giving you confidence that your abilities have improved considerably. Check back with Mariorie and see how the preparations are coming along."},{"name":"MARIORIE","text":"Ah, <span class=\"highlight\">Forename</span>! Was that perhaps you that was practicing the piano just now? Why, that was a veritable virtuoso performance if I ever heard one! Clearly, there is nothing that I could teach you."},{"name":"MARIORIE","text":"I am pleased to report that the preparations for the festivities are proceeding apace. With Foncrineau's aid, we've also managed to secure additional performers! Yes, I do believe this concert will be a performance to remember."}],"reward":{"gil":875},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69535]},"next":[69537]},"partials":[{"type":"npc","id":"1035520","obj":{"i":1035520,"n":"Conon","l":3435,"q":1}},{"type":"npc","id":"1035521","obj":{"i":1035521,"n":"Mariorie","l":3435,"q":2}},{"type":"quest","id":"69535","obj":{"i":69535,"n":"Not by Bread Alone","g":83,"l":"The Firmament","s":19,"f":1}},{"type":"quest","id":"69537","obj":{"i":69537,"n":"An Unexpected Symphony","g":83,"l":"The Firmament","s":21,"f":1}}]}