{"quest":{"name":"Not by Bread Alone","location":"The Firmament","id":69535,"patch":5.41,"sort":19,"unlocksFunction":1,"eventIcon":71341,"issuer":1035506,"target":1035510,"genre":83,"journal":["Francel, deep in thought, gazes intently at the streets of the Firmament.","Lord Francel rejoices upon seeing you approach, once more extending his profuse gratitude for all you have done to help him realize his vision of a Firmament fully reborn. Reflecting on the importance of culture, the arts, and entertainment and the role these all play in sustaining a living, breathing city, he invites you on a tour of the newly opened Risensong Quarter─a district which he hopes will serve precisely that role for the Firmament as a whole. Should you be so inclined as to take him up on his offer, join him at Ser Vaindreau's Grace.","You convene with Lord Francel at Ser Vaindreau's Grace, the Firmament's most impressive new infirmary. Here, as your good friend tells it, any and all people in Ishgard may seek succor and reprieve from their wounds and ailments regardless of their status or station. Your conversation is interrupted by an artist whom you recognize as something of a celebrity in these parts. Gushing with adoration, he thanks you profusely for your role in ending the war, which allowed him to put down his blade in favor of the brush and palette he had dreamed of taking in hand for so long. Thanking him for the sentiment, you make ready to join Francel at the next destination on your excursion─the bathhouses of Snowsoak Springs. ","Admiring the elegant architecture and steaming thermal baths of Snowsoak Springs, your conversation with Francel is interrupted by a couple of familiar faces─itinerant artisans who worked alongside you in the reconstruction effort. Though pleased at a job well done, they lament that the completion of the reconstruction effort means that they must now go separate ways with their beloved chief who was a stern-yet-gentle guiding hand throughout the long process. Speaking from your own experience traveling the realm, you assure them that farewell need not be forever, a sentiment which heartens them somewhat. Your work here done, you set off to rejoin Francel where you started, in the center of the Risensong Quarter.","Standing at the center of the newly opened quarter with Lord Francel, you survey your surroundings and marvel at how remarkably this place has flourished in such a short time. Your reverie is interrupted by the arrival of Conon, a former acquaintance who has recovered from his wounds to be up on his feet once more. After thanking you for introducing him to Marcelloix and his marvelous remedies, he asks if he might trouble you for your advice on a matter of concern. With Francel returning to see to various administrative affairs, you elect to entertain the young man's offer to see if there is aught aid you might lend him."],"objectives":["Speak with Francel at Ser Vaindreau's Grace.","Speak with Francel once more.","Speak with Francel further."],"dialogue":[{"name":"FRANCEL","text":"Ah, <span class=\"highlight\">Forename</span>! 'Tis always a pleasure to see you here in the Firmament. I'm certain you'll agree that the place is feeling livelier and more cultured than ever, is it not?"},{"name":"FRANCEL","text":"Truly, we could have never hoped to accomplish this without the help of our preeminent skybuilder. Truly, I have not the words to express the depths of my gratitude!"},{"name":"FRANCEL","text":"Recently, I have had occasion to take the briefest of respites from my daily duties and reflect upon the reconstruction effort as a whole. And in doing so, my mind oft returns to Emmanellain's words that day."},{"name":"FRANCEL","text":"An ever-growing number of Ishgardians now make their residence in the Firmament, and its markets bustle with customers and exotic wares from across the realm. What more could be needed? The answer was clear─a place where those who live and ply their trade here can leave behind their worries and cares, and indulge in the finer pleasures of life."},{"name":"FRANCEL","text":"Yes, the newly completed Risensong Quarter shall be precisely that. And I would like nothing more than for you to be the first to walk its streets with me...if, of course, you have no more pressing commitments at the moment?"},{"name":"FRANCEL","text":"Splendid! Then let us first make for Ser Vaindreau's Grace. I think that you, too, will be keen to lay your eyes on a location which I believe to be the pride of the Firmament."},{"name":"FONCRINEAU","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>. We are forever in your debt. Has Lord Francel shown you about the Risensong Quarter yet, pray tell?"},{"name":"FONCRINEAU","text":"I am filled with the utmost sense of pride and satisfaction seeing Lord Francel's dream come to fruition as it has. Pray take in the Firmament to the fullest, <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Forename</span>─for you have played as much a role in this as any."},{"name":"FRANCEL","text":"I do hope our presence won't be a bother..."},{"name":"FRANCEL","text":"...Ah, forgive me. The building before us I have dubbed Ser Vaindreau's Grace. It is a place where the ailing and injured might see their wounds or maladies tended to."},{"name":"FRANCEL","text":"Some of our patients require only the briefest of treatment before they are back on their feet again, while those with more serious conditions might stay in these halls for months. There are even those here suffering from troubling sicknesses not visible to the eye─but our healers do their best to provide succor just the same."},{"name":"FRANCEL","text":"The construction of the facility was first proposed by the House of Commons, but the plan was met with immediate and overwhelming approval in the House of Lords, as well. How heartening it is to see our nation come together for a worthy cause."},{"name":"FRANCEL","text":"Needless to say, be they commoner or noble, in these halls all patients receive the attention and care they deserve. Nor do we turn away any who seek employment here, regardless of their background or station."},{"name":"ARTIST03999","text":"(-???-)Beg pardon, <span class=\"alternative-container\"><span class=\"alternative\">milord...milady</span><span class=\"alternative\">milords</span></span>. If I might trouble you for a moment..."},{"name":"ARTIST03999","text":"I am but a humble artist working to capture the reconstruction of the Firmament on canvas for posterity. I saw the two of you here, and simply could not walk by without expressing my gratitude."},{"name":"FRANCEL","text":"Ah...but yes! I do believe I have had the pleasure of looking upon your paintings. You have our thanks as well for your most exquisite─ Wait. Why does your face look so familiar?"},{"name":"FRANCEL","text":"You are of House Chevraudan, are you not?"},{"name":"ARTIST03999","text":"You are gracious indeed, my lord, to remember one of such humble blood. It is true─I once had the honor of paying my respects to you when introduced by Ser Adelphel at a banquet."},{"name":"ARTIST03999","text":"And you, of course, <span class=\"highlight\">Forename</span>. There is no greater honor than to see you before me."},{"name":"ARTIST03999","text":"'Twas always my dream to become an artist. To capture the world around me in all its beauty, all its sadness, on my easel─that future generations may never forget the time we lived in. And yet, in times of war, there was of course no time for such lofty pursuits."},{"name":"ARTIST03999","text":"And so I donned my armor and took up my blade, resigned to the thought that I would one day fall in the unending battle against the Horde. Oh, how my heart sung the day you felled dread Nidhogg, ushering in a new dawn for our great nation!"},{"name":"ARTIST03999","text":"At long last, I am able to lay down the weapons of war and take up my brush as I had dreamed of for all those years! Truly, it would not be an understatement to say that your heroism inspires every stroke that I paint."},{"name":"ARTIST03999","text":"...Ahem, forgive me. Moreover, I am proud to say that my work has been put on display right here in the halls of Ser Vaindreau's Grace."},{"name":"ARTIST03999","text":"Not to be overly presumptuous, but I feel there is a role for fine art to play in bringing succor to the hearts of the suffering. To that end, I have also made an effort to teach my craft to all who would learn..."},{"name":"DEALER03999","text":"Ah, there you are! I was hoping to inquire about the price of your latest masterpiece..."},{"name":"DEALER03999","text":"...Oh, pray forgive me! Clearly, you have more important matters to deal with. I meant not to intrude..."},{"name":"ARTIST03999","text":"No apology needed, my good man. On the contrary, I have imposed upon my illustrious friends for far too long already."},{"name":"ARTIST03999","text":"And with that, I shall take my leave. Thank you for giving this humble artist the opportunity to express his appreciation in person. Whenever you see one of my works, know that they would never have been possible were it not for you."},{"name":"FRANCEL","text":"Be proud, <span class=\"highlight\">Forename</span>. Truly, you have made your mark on our nation and its people in more ways than one."},{"name":"FRANCEL","text":"Now, shall we make for the next stop on our little tour? To Snowsoak Springs we go!"},{"name":"FRANCEL","text":"I welcome you to Snowsoak Springs, <span class=\"highlight\">Forename</span>. The waters here are natural thermal springs extracted from subterranean veins beneath Coerthas."},{"name":"FRANCEL","text":"We see to it that an ideal temperature for bathing is preserved by means of the finest fire crystals, procured directly from the Dravanian highlands. Needless to say, the springs are open to one and─"},{"name":"DISCIPLED03999","text":"(-???-)Chief! Miss! Don't leave us here alone! I beg of you!"},{"name":"ARTISANA03999","text":"Quit your whining, already. You know that we can't very well stay here forever."},{"name":"ARTISANA03999","text":"Well, if it isn't Lord Francel and his star skybuilder. Perhaps you could talk some sense into this fellow."},{"name":"ARTISANB03999","text":"As you well know, we are itinerant artisans, plying our trade all across the realm. When we finish one task, we must move on to the next. We'd a mind to celebrate a job well done here before heading to Limsa for our next assignment, but─"},{"name":"DISCIPLEB03999","text":"I simply can't bear to see the chief here go! Why, without them who will set me right when my hammering technique falters? Who will scold me when I am tempted to slack off on my duties!?"},{"name":"ARTISANB03999","text":"As you can see, this fellow simply refuses to let us go. Would you be so kind as to have a word with him on our behalf?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"All good things must come to an end."},{"name":"A1","text":"You have a job to do."},{"name":"A1","text":"This need not be good-bye."},{"name":"DISCIPLED03999","text":"I know this, and yet... I simply owe so much to the chief for all she has taught me. I fear that I will not be able to live up to her expectations in her absence. And yet, I suppose you are right...I must soldier on somehow."},{"name":"DISCIPLED03999","text":"You mean I can─ Why, yes! I can meet her again! Our borders are open now, and Ser Aymeric himself encourages free travel between our nations! Should I wish to pay my regards to the chief, I am free to travel to Limsa any time I like!"},{"name":"ARTISANA03999","text":"It's just as the savior of Ishgard here says. So stand up straight and quit your whinging for once!"},{"name":"ARTISANA03999","text":"That goes for the whole lot of you! You all had─and'll continue to have─a hand in one of the impressive rebuilding efforts this realm has ever seen. So take some damn pride in your work, that the Firmament might soar to even greater heights!"},{"name":"DISCIPLED03999","text":"(-Apprentices-)Aye aye, Chief!"},{"name":"FRANCEL","text":"Well, that was a rather...unexpected distraction. Still, all's well that ends well, I suppose."},{"name":"FRANCEL","text":"And with that, I do believe we should be on our way. Pray accompany me to the main plaza of the Risensong Quarter, would you?"},{"name":"FRANCEL","text":"As you can see, this is the district's main thoroughfare, connecting the Pillars above with the Brume below. I oft walk the streets here to speak to passersby and see if there is aught with which I might assist them."},{"name":"FRANCEL","text":"And with that, I do believe you've seen most everything the quarter has to offer. What say you, my friend? Did it live up to your expectations?"},{"name":"CONON","text":"(-Familiar Face-)If it isn't the savior of Ishgard─and Lord Francel, as well! Foncrineau said I might find the two of you here, and thank the heavens that I have!"},{"name":"FRANCEL","text":"Conon! 'Tis good to see you up and about again. I trust your wounds have healed?"},{"name":"CONON","text":"Indeed they have. Thanks to Marcelloix and his most marvelous unguent, I can scarcely feel a thing!"},{"name":"CONON","text":"And to think that were it not for the both of you, I never would have even given the poor man a chance. I simply had to express my gratitude in person─and yet, my words seem so woefully inadequate when measured against the profundity of your deeds."},{"name":"CONON","text":"Though, truth be told, there is one more matter regarding which I would seek your counsel... Might you allow me to impose upon you for just a bit longer?"},{"name":"FRANCEL","text":"Sometimes it seems as if you are in greater demand in the Firmament than I, <span class=\"highlight\">Forename</span>. Small wonder, given all that you have done for the people here."},{"name":"FRANCEL","text":"And on that note, there are many administrative duties that await my attention, and I had best be returning to them sooner rather than later. Till next time, my friends!"}],"reward":{"items":[{"num":3,"id":30481,"one":1,"hq":1},{"num":3,"id":30482,"one":1,"hq":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69494]},"next":[69536]},"partials":[{"type":"npc","id":"1035506","obj":{"i":1035506,"n":"Francel","l":3435,"q":1}},{"type":"npc","id":"1035510","obj":{"i":1035510,"n":"Francel","l":3435,"q":1}},{"type":"item","id":"30481","obj":{"i":30481,"n":"Crab Cakes","l":490,"c":24329,"t":46}},{"type":"item","id":"30482","obj":{"i":30482,"n":"Chili Crab","l":490,"c":24328,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69494","obj":{"i":69494,"n":"May Featherfall Flourish","g":83,"l":"Limsa Lominsa","s":18,"f":1}},{"type":"quest","id":"69536","obj":{"i":69536,"n":"Francel's Fervent Wish","g":83,"l":"The Firmament","s":20,"f":1}}]}