{"quest":{"name":"The Admiral's Resolve","location":"The Dravanian Hinterlands","id":69548,"patch":5.4,"sort":380,"eventIcon":71201,"issuer":1035381,"target":1035386,"genre":10,"journal":["Alphinaud is eager to deliver the good tidings to Limsa Lominsa."],"objectives":["Speak with Zanthael on the lower decks of Limsa Lominsa.","Speak with Alphinaud.","Speak with the leaders of Limsa Lominsa's pirate powers.","Speak with Alphinaud."],"dialogue":[{"name":"ALISAIE","text":"Let's see: brilliant minds, rapier wits, humor drier than Thanalan... Appearances aside, I'd say the two Matoyas are mirror images of each other."},{"name":"GRAHATIA","text":"As I followed your deeds through history, I came across the names of a great many distinguished individuals such as Commander Hext and Master Matoya, and it has been a delight to meet them in the flesh. I heartily look forward to making the acquaintance of the rest, not least the Azure Dragoon!"},{"name":"YSHTOLA","text":"My apologies, but I will rest here awhile. Go on without me."},{"name":"ALPHINAUD","text":"Well then, my friends, let us return to Limsa Lominsa and deliver the good news to the Admiral. A word to the officer in Bulwark Hall should be sufficient to secure us an audience."},{"name":"ALPHINAUD","text":"Though the Admiral is not expecting us, I am certain she will want to hear our report. Come, let us request an audience."},{"name":"ALISAIE","text":"If we offer them the means to cure their tempered, the beast tribes are far more likely to listen."},{"name":"GRAHATIA","text":"Even as we speak, we are weaving a new future. And when it all becomes history, I hope that those who follow may look back with gladness."},{"name":"ZANTHAEL","text":"Why, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>, ever a welcome sight."},{"name":"ZANTHAEL","text":"...Tidings for the Admiral, you say? She is presently receiving guests, but for the Scions, I know she will make an exception. Follow me."},{"name":"MERLWYB","text":"My friends... What brings you here this day?"},{"name":"MERLWYB","text":"Is this true!?"},{"name":"MERLWYB","text":"By the Navigator... A cure for tempering."},{"name":"MERLWYB","text":"As often as I've been in awe of you Scions, I would not have thought it possible..."},{"name":"ALISAIE","text":"And yet it is, Admiral. We have done it. Here in Limsa. And production of more familiars has already begun."},{"name":"MERLWYB","text":"You have my thanks. Truly. This will do much to advance the cause of peace. Yet I fear it will take more to close the rift 'twixt man and beastman."},{"name":"MERLWYB","text":"Bah, even to speak thus divides us."},{"name":"MERLWYB","text":"&lt;sigh&gt; Welcome as it is, a cure will not guarantee reconciliation between our peoples. For though summoning and the tempered may serve to fuel the conflict, they are but symptoms of it."},{"name":"MERLWYB","text":"If we are to resolve the primal problem once and for all, we must address the <span class=\"emphasis\">cause</span>. We must strive for mutual understanding and find a way to leave our bloody past behind."},{"name":"MERLWYB","text":"...'Twas I who moved that the Alliance renew its push for peace."},{"name":"MERLWYB","text":"Since our ancestors came to these shores some seven centuries past, we Lominsans have been at odds with those who share our island home."},{"name":"MERLWYB","text":"Save for a brief moment of cooperation with the kobolds, our history has been one of nigh-constant territorial squabbling."},{"name":"MERLWYB","text":"Meanwhile, our struggle with the Sahagin for control over the seas has only grown fiercer. A matter made worse by the thrice-damned Calamity driving them to seek new spawning grounds..."},{"name":"MERLWYB","text":"With survival at stake, each had no choice but to fight. And so I dismissed peace as impossible."},{"name":"MERLWYB","text":"“Impossible is a word coined by the weak,” I proclaimed to all who'd listen─and then gave up. You and yours put me to shame."},{"name":"MERLWYB","text":"Since you led us to victory against the Black Wolf, you have achieved the impossible again and again and again."},{"name":"MERLWYB","text":"And I thought it high time that I followed suit. Hence my proposal to the Alliance council."},{"name":"MERLWYB","text":"But no sooner did I reach out to our neighbors in Vylbrand than my own people sought to thwart me."},{"name":"ALPHINAUD","text":"You speak of the pirates who failed to attend the meeting."},{"name":"MERLWYB","text":"Aye. Acting through a friendly faction among the kobolds, we had intended to seek an audience with a prominent patriarch."},{"name":"MERLWYB","text":"But the Bloody Executioners would not hear of it, and their absence sent a message to the rest."},{"name":"MERLWYB","text":"Though they are but one of the three pirate powers, they are the greatest, and any attempt at peace would founder without them."},{"name":"ALPHINAUD","text":"I am given to understand that their leader, Captain Hyllfyr, has been bedridden for some while with an ailment of the lungs."},{"name":"MERLWYB","text":"Correct. In his absence, his right hand leads, a man named Sicard but recently risen to prominence among their ranks."},{"name":"MERLWYB","text":"Save for his disdain for authority, little is known about him. We have invited him to speak with us more than once, but he will not come."},{"name":"MERLWYB","text":"I have tasked the Yellowjackets and the rogues with uncovering his motives, but they have learned naught of any value."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Leave it to us."},{"name":"A1","text":"..."},{"name":"ALISAIE","text":"We have a nose for the truth. Whatever this Sicard wants, we'll find out."},{"name":"ALISAIE","text":"We have a nose for the truth. Whatever this Sicard wants, I'm sure we could find out."},{"name":"MERLWYB","text":"Truly? I would be much obliged."},{"name":"MERLWYB","text":"I shall look forward to hearing what you learn, then. Good luck."},{"name":"ALISAIE","text":"The Admiral is right─the cause of the conflict needs to be addressed. We'll do what we can to ease the way, but it ultimately falls to the Lominsans to make peace with their neighbors."},{"name":"GRAHATIA","text":"I know naught of this city save what I've read or heard in passing. So in this matter, I will follow your lead."},{"name":"ZANTHAEL","text":"So you will be looking into Sicard for us, will you? I wish you luck..."},{"name":"ALPHINAUD","text":"By way of a first step, I suggest we split up and make inquiries around town. Someone must know this Sicard."},{"name":"ALPHINAUD","text":"If you could approach the pirates, <span class=\"highlight\">Forename</span>, the rest of us will seek out merchants and adventurers."},{"name":"CARVALLAIN","text":"Curious about Sicard, are you? As am I, my friend, as am I."},{"name":"CARVALLAIN","text":"Sadly, I know nothing of the man─save that the Bloody Executioners experienced a marked improvement in their fortunes after his promotion."},{"name":"CARVALLAIN","text":"Quite how he achieved this is a matter of some debate."},{"name":"CARVALLAIN","text":"As you know, the thalassocracy permits us to attack only Garlean vessels, yet these have all but vanished from the seas since the Empire turned in upon itself."},{"name":"CARVALLAIN","text":"In order to adapt, we Krakens have taken to trading with the East, but the Executioners are less...forward looking. I cannot imagine they would willingly abandon the old ways."},{"name":"CARVALLAIN","text":"So how, then, are they lining their coffers? ...Whatever their secret, they are not like to share it with their rivals, but mayhap you will have more luck."},{"name":"RHOSWEN","text":"Eh? Ye want to know about Sicard? 'E's a wily bugger is what 'e is."},{"name":"RHOSWEN","text":"Found some clever way to make coin, they say, an' traded it fer Moenskaet's place at ol' Hyllfyr's side."},{"name":"RHOSWEN","text":"There was a time we raced the Executioners fer our pick of the Empire's fleet, but the Garleans are gone, an' them days with 'em."},{"name":"RHOSWEN","text":"Owin' to which, we've all of us had to look fer other ways to make ends meet─with that jumped-up bilge rat Sicard landin' the juiciest, whatever it may be."},{"name":"RHOSWEN","text":"Not that we Sirens are strugglin', mind... We do well enough guardin' fishin' boats from the fishbacks an' other beasties."},{"name":"RHOSWEN","text":"Get the first pick o' the produce fer our trouble, see. Quality stuff at a bargain price."},{"name":"RHOSWEN","text":"This we pass to our sisters as can't sail on account o' gettin' old or wounded or with child, an' they cook it up an' sell it for a pretty profit. Simple!"},{"name":"RHOSWEN","text":"Oh, I miss the old ways, don't get me wrong. But when I see the girls with their little ones, I think to meself: a life o' peace an' quiet ain't all bad."},{"name":"CARVALLAIN","text":"I have told you all I know of Sicard. Should you learn how the Bloody Executioners are lining their coffers, you will share their secrets with me, I trust?"},{"name":"RHOSWEN","text":"If you 'ear 'ow that scrawny whelp's makin' that much coin, you tell me, all right? I'll make it worth yer while."},{"name":"ALISAIE","text":"As I went about making my inquiries, I chanced upon a shop that boasted a rather enticing selection of sweetmeats. Perhaps we could take Ga Bu and G'raha there one day?"},{"name":"GRAHATIA","text":"Walking through the city, one would never suspect this was until recently a bastion of piracy. The Admiral is to be commended for overseeing so swift a transformation."},{"name":"ALPHINAUD","text":"I see everyone has returned. Now, who would like to go first?"},{"name":"ALPHINAUD","text":"So, just as their imperial prey began to disappear, Sicard turned the Executioners' fortunes around with a mysterious new source of income..."},{"name":"ALISAIE","text":"Whatever it is, it's nothing to scoff at. According to a tavern keeper I spoke to, the crew have been indulging themselves as never before. But no amount of drink seems to loosen their tongues as to how they are coming by their coin."},{"name":"GRAHATIA","text":"For my part, I spoke with a reporter from the <span class=\"emphasis\">Harbor Herald</span>. The publication has been investigating the secret of the Executioners' good fortune, and making little headway."},{"name":"ALPHINAUD","text":"Plainly, the Executioners do not wish the nature of their business to be made public."},{"name":"ALPHINAUD","text":"...And I think I may know why. In the course of making inquiries on Hawkers' Alley, an interesting fact came to light. Just as the Executioners began to enjoy better fortunes, the price of crystal went into sharp decline─a sudden fall in demand, I was told."},{"name":"ALPHINAUD","text":"Curious, I contacted Hoary Boulder, who has been watching the movements of the beast tribes. And my suspicions were proven correct."},{"name":"ALPHINAUD","text":"Despite ever-worsening relations between the beast tribes and the thalassocracy, neither Titan nor Leviathan have made an appearance of late, suggesting that the kobolds and Sahagin lack the means with which to summon them."},{"name":"GRAHATIA","text":"Do you mean to say the Executioners are divesting them of their crystals?"},{"name":"ALPHINAUD","text":"All indications point to that conclusion, yes─though we have no hard evidence as yet. We must investigate further."},{"name":"ALISAIE","text":"Agreed. So how do we proceed?"},{"name":"ALPHINAUD","text":"Oh, I have an idea about that. In fact, I have already taken the liberty of making certain provisions."}],"reward":{"items":[{"num":3,"id":29503,"one":1,"hq":1},{"num":3,"id":29498,"one":1,"hq":1},{"num":3,"id":29505,"one":1,"hq":1},{"num":3,"id":29501,"one":1,"hq":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69547]},"next":[69549]},"partials":[{"type":"npc","id":"1035381","obj":{"i":1035381,"n":"Alphinaud","l":2001,"q":2}},{"type":"npc","id":"1035386","obj":{"i":1035386,"n":"Alphinaud","l":29,"q":2}},{"type":"item","id":"29503","obj":{"i":29503,"n":"Pickled Herring","l":480,"c":24327,"t":46}},{"type":"item","id":"29498","obj":{"i":29498,"n":"Mors","l":480,"c":24403,"t":46}},{"type":"item","id":"29505","obj":{"i":29505,"n":"Farmer's Breakfast","l":480,"c":24263,"t":46}},{"type":"item","id":"29501","obj":{"i":29501,"n":"Sausage and Sauerkraut","l":480,"c":24367,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69547","obj":{"i":69547,"n":"Like Master, Like Pupil","g":10,"l":"Limsa Lominsa Upper Decks","s":370}},{"type":"quest","id":"69549","obj":{"i":69549,"n":"The Search for Sicard","g":10,"l":"Limsa Lominsa Lower Decks","s":390}}]}