{"quest":{"name":"The Wisdom of Allag","location":"Azys Lla","id":69544,"patch":5.4,"sort":340,"eventIcon":71201,"issuer":1035345,"target":1035350,"genre":10,"journal":["G'raha Tia surveys his surroundings with an expectant glint in his eye."],"objectives":["Speak with G'raha Tia.","Speak with G'raha Tia again.","Find a point of stagnant lightning and defeat the lightning sprites that appear.","Examine the point of stagnant lightning and obtain a concentrated lightning shard.","Deliver the concentrated lightning shard to G'raha Tia."],"dialogue":[{"name":"ALISAIE","text":"So this is where you had your reckoning with Thordan. I wish I'd been with you."},{"name":"GRAHATIA","text":"This appears to be Helix, which means we stand in the Alpha Quadrant. To the east lies the Beta Quadrant, and..."},{"name":"GRAHATIA","text":"Yes, I believe I have my bearings. Though this is my first time on Azys Lla, I do have some familiarity with the place thanks to the records in the Crystal Tower."},{"name":"GRAHATIA","text":"Unless I am mistaken, this path leads to an aetheryte, beyond which there will be an information terminal. I suggest we begin our search there."},{"name":"ALISAIE","text":"Time for our authority on Allagan artifacts to show what he can do."},{"name":"GRAHATIA","text":"And here is the terminal. A moment while I search the archives for references to tempering..."},{"name":"GRAHATIA","text":"Ah, there we are..."},{"name":"ALISAIE","text":"“Eikonic Corruption ─ An Overview”... That sounds promising!"},{"name":"GRAHATIA","text":"Indeed. Let us see what this report has to say."},{"name":"GRAHATIA","text":"Hm? ...Confound it. The contents appear to have been deleted."},{"name":"ALISAIE","text":"What? No...! Isn't there something you can do?"},{"name":"GRAHATIA","text":"Not from here, I'm afraid. But it may be that another copy of the report exists elsewhere. The question is, where to look...?"},{"name":"ALISAIE","text":"It says here the report was written by someone named Owen. Is it likely that he kept a copy?"},{"name":"GRAHATIA","text":"I would say it is a distinct possibility. Assuming he was a researcher here, he will have had quarters on the Habisphere. We can ascertain the details at Habisphere Control."},{"name":"GRAHATIA","text":"Let us return to the <span class=\"emphasis\">Bonanza</span> and avail ourselves of the manacutters. We will need them to reach our destination."},{"name":"ALISAIE","text":"I forgot─you already have a suitable means of transport, don't you. No need to waste time accompanying us back to the ship, then. We'll see you at the Habisphere."},{"name":"ALISAIE","text":"The manacutters appear to be Ironworks made, but I daresay Tataru will craft her own soon enough."},{"name":"HABISPHERESYSTEM","text":"Bzzz... Welcome to Habisphere Control. How may I assist you?"},{"name":"GRAHATIA","text":"If the late Owen did indeed have a chamber here, this node will be able to tell us its number."},{"name":"GRAHATIA","text":"There. From what I recall of the layout, it should be somewhere in the vicinity of─<br>...Hm?"},{"name":"HABISPHERESYSTEM","text":"Warning: an evacuation order is presently in effect. Entry to the Habisphere is not permitted at this time."},{"name":"GRAHATIA","text":"Foiled again... In all likelihood, the order would have been imposed during the Fourth Umbral Calamity, and I doubt it will be lifted in the near future."},{"name":"HABISPHERESYSTEM","text":"Bzzz... Energy level critical. Returning to base for recharging."},{"name":"ALISAIE","text":"Well...surely there must be some other way to gain access. Force, for example?"},{"name":"GRAHATIA","text":"Hm. Ere we resort to that, I have an idea. Were we to send a surge of energy through yonder control mechanism, it <span class=\"emphasis\">should</span> prompt the system to restart, releasing the locks."},{"name":"GRAHATIA","text":"As for a suitable energy source...a concentrated lightning shard might suffice. Happily, I seem to recall that they are known to form at points of stagnant aether throughout the continent."},{"name":"ALISAIE","text":"You <span class=\"emphasis\">seem to recall</span>? Are you honestly telling me that was in the records too?"},{"name":"GRAHATIA","text":"Hah! I am. A report sent to the capital mentioned that lightning-aspected aether was prone to pooling on the continent, resulting in surges that interfered with equipment."},{"name":"GRAHATIA","text":"A minor detail, I grant you, but in my role as caretaker of the Crystal Tower, there was no such thing as too much Allagan knowledge."},{"name":"GRAHATIA","text":"Besides, my studies helped me to feel connected to the Source. To home."},{"name":"GRAHATIA","text":"I must have explored this facility a thousand times in my mind, but to finally stand here with the two of you... 'Tis more exhilarating than I can well express."},{"name":"GRAHATIA","text":"Now then, the lightning shard. If I may, I suggest we split up and search the Beta Quadrant. Oh, but beware of sprites─they are wont to manifest where the aether is stagnant."},{"name":"ALISAIE","text":"Now you're just showing off. Which makes me think we should make a contest of this. The first to return here with a shard wins. What do you say?"},{"name":"GRAHATIA","text":"Very well! It would be my honor to come third!"},{"name":"GRAHATIA","text":"(-Disembodied Voice-)Bravo! That was quite a show, adventurer! Why, the spectacle proved so enthralling that all thoughts of the prize slipped my mind."},{"name":"GRAHATIA","text":"(-Disembodied Voice-)I appear to have forfeited our little race! Congratulations─the lightning shard is yours."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Who are you? Show yourself at once!"},{"name":"A2","text":"What, no dramatic entrance? You've changed."},{"name":"A2","text":"Very funny. Now let's get back to work."},{"name":"GRAHATIA","text":"Forgive me, my friend. The scene so reminded me of our first meeting, I couldn't resist."},{"name":"GRAHATIA","text":"Ugh, you remember that? In my defense, I was caught up in the moment. It isn't every day you meet an honest-to-gods hero, after all."},{"name":"GRAHATIA","text":"Forgive me. The scene so reminded me of our first meeting, I couldn't resist."},{"name":"GRAHATIA","text":"Well, the contest continues, so you had better hurry back.<br>...Ah, but one last thing."},{"name":"GRAHATIA","text":"Thank you, <span class=\"highlight\">Forename</span>. For bringing me here."},{"name":"ALISAIE","text":"You have a shard? Then you win. I searched high and low, but couldn't find so much as a trace of stagnant aether."},{"name":"GRAHATIA","text":"It appears Alisaie had no luck, so victory is yours. Congratulations. Now then, may I have the shard?"},{"name":"ALISAIE","text":"&lt;sigh&gt; What is it that makes you so much better at finding things? What do you have that I don't?"},{"name":"GRAHATIA","text":"That is a question I too have asked myself on numerous occasions. I suspect we could both learn a great deal from <span class=\"highlight\">Forename</span>─and not only about the secrets of adventuring. But come, we should attend to our mission."},{"name":"GRAHATIA","text":"Excellent, the system responded exactly as intended. We now have access to the Habisphere."},{"name":"GRAHATIA","text":"Only one obstacle remains: the security systems within. Should they be triggered, they could make life rather difficult for us."},{"name":"GRAHATIA","text":"In light of which, pray leave the rest to me. If I am right, my royal blood <span class=\"emphasis\">should</span> allow me to venture in unmolested."},{"name":"ALISAIE","text":"Assuming this place works like the Crystal Tower, yes. But if it <span class=\"emphasis\">doesn't</span>, you'll be on your own. I want you to promise us that you'll get out at the first sign of trouble."},{"name":"GRAHATIA","text":"I promise. Wish me luck!"},{"name":"ALISAIE","text":"Well, nothing for it but to sit tight..."},{"name":"ALISAIE","text":"I'm sure this Owen fellow was very learned, but “Eikonic Corruption ─ An Overview” sounds like a Studium thesis. We all had to write one."},{"name":"ALISAIE","text":"Lest you wonder, mine was about the combat applications of aether. I'm nothing if not practical..."},{"name":"ALISAIE","text":"Alphinaud's was more philosophical, of course. <span class=\"emphasis\">Political</span>, dare I say it. He chose to write a lengthy discourse on our nation's duty to the world."},{"name":"ALISAIE","text":"A controversial subject, to say the least."},{"name":"ALISAIE","text":"He asserted that Sharlayan's knowledge should <span class=\"emphasis\">rightly</span> be used to protect all life on the star─in direct opposition to the country's cherished policy of nonintervention. Being a leading member of the Forum, our father was...not happy."},{"name":"ALISAIE","text":"At the time, of course, Alphinaud was utterly convinced of his views and would cheerfully argue to the death with anyone who saw things differently. By which I mean, the rows were <span class=\"emphasis\">long</span>. To be fair to him, though, he's since learned to be a little more open-minded─but deep down he still holds fast to that one belief. And I admire him for it."},{"name":"GRAHATIA","text":"I should have liked to meet the young Alphinaud! For what it's worth, <span class=\"emphasis\">my</span> thesis concerned the Allagan civilization as depicted in folklore."},{"name":"ALISAIE","text":"Oh, you're back. I didn't know you attended the Studium?"},{"name":"GRAHATIA","text":"I didn't─a thesis was required to earn my Archon's mark. My peers at the Students of Baldesion convinced me to write one with the promise of unfettered access to <span class=\"emphasis\">forbidden tomes</span>!"},{"name":"GRAHATIA","text":"Though I considered it no more than a means to an end at the time, I will admit it was gratifying to have my efforts acknowledged."},{"name":"ALISAIE","text":"Good gods, an Archon's thesis... I shudder to imagine the work involved. But enough about that─is this the fruit of your foray?"},{"name":"GRAHATIA","text":"Yes. Owen's archive node. It was waiting for me in his chamber."},{"name":"GRAHATIA","text":"If a copy of his report still survives, it would be stored in this device. Shall we find out?"},{"name":"DATASYSTEM","text":"&lt;blip&gt; Initializing... Scanning for registered user..."},{"name":"DATASYSTEM","text":"User not found. To proceed as a guest, please complete biometric authentication."},{"name":"DATASYSTEM","text":"&lt;blip&gt; Verifying..."},{"name":"DATASYSTEM","text":"&lt;bloop&gt; Authentication complete. Guest identified as: member of the royal family. I am at your most humble service, Your Highness."},{"name":"GRAHATIA","text":"Hm hm hm! It never ceases to amuse me. 'Tis but a pity the effect will not last forever."},{"name":"GRAHATIA","text":"Doga and Unei said as much when they granted me this gift. But until such time as it fades, I shall use it gratefully."},{"name":"GRAHATIA","text":"Search archive for “Eikonic Corruption.”"},{"name":"DATASYSTEM","text":"&lt;blip&gt; Searching...<br>&lt;bloop&gt; One item found: Eikonic Corruption ─ An Overview."},{"name":"DATASYSTEM","text":"The report is locked by the author. Please state password."},{"name":"ALISAIE","text":"Well, go on then, Your Highness. Tell the nice node the password."},{"name":"GRAHATIA","text":"The, uh... Right! Let's see..."},{"name":"GRAHATIA","text":"Glory be to Allag!"},{"name":"GRAHATIA","text":"Long live Emperor Xande!"},{"name":"DATASYSTEM","text":"&lt;blip&gt; &lt;bloop&gt; Password incorrect. Please try again."},{"name":"GRAHATIA","text":"Confound it!"},{"name":"ALISAIE","text":"Come now, passwords are invariably short and simple. For instance..."},{"name":"ALISAIE","text":"Password!"},{"name":"DATASYSTEM","text":"The notion that the password could be something so inane would be laughable were it not dangerously stupid. Furthermore, your conduct in the presence of His Highness is grossly inappropriate. Know your place, handmaiden."},{"name":"ALISAIE","text":"<span class=\"emphasis\">What</span> did that thing just call me!?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Wild rose!"},{"name":"A1","text":"Courage!"},{"name":"DATASYSTEM","text":"&lt;blip&gt; &lt;bloop&gt; Password incorrect. Again. Be warned that any further inappropriate behavior in the presence of His Highness will not be tolerated."},{"name":"ALISAIE","text":"All right, that's it. I say we dismantle it and manually extract what we need."},{"name":"GRAHATIA","text":"Now, now, let's not be too hasty! A single misstep, and we risk losing the report altogether."},{"name":"GRAHATIA","text":"I believe this may be a task for Cid and his colleagues. If anyone can coax machina into cooperating, it is them."},{"name":"GRAHATIA","text":"Come, let us bear the node back to the Rising Stones."}],"reward":{"items":[{"num":3,"id":29497,"one":1,"hq":1},{"num":3,"id":29504,"one":1,"hq":1},{"num":3,"id":29506,"one":1,"hq":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69543]},"next":[69545]},"partials":[{"type":"npc","id":"1035345","obj":{"i":1035345,"n":"G'raha Tia","l":2101,"q":1}},{"type":"npc","id":"1035350","obj":{"i":1035350,"n":"G'raha Tia","l":2101,"q":2}},{"type":"item","id":"29497","obj":{"i":29497,"n":"Ovim Meatballs","l":480,"c":24368,"t":46}},{"type":"item","id":"29504","obj":{"i":29504,"n":"Herring Pie","l":480,"c":24052,"t":46}},{"type":"item","id":"29506","obj":{"i":29506,"n":"Silkie Pudding","l":480,"c":24075,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69543","obj":{"i":69543,"n":"Alisaie's Quest","g":10,"l":"The Rising Stones","s":330}},{"type":"quest","id":"69545","obj":{"i":69545,"n":"Reviving the Legacy","g":10,"l":"Azys Lla","s":350}}]}