{"quest":{"name":"Of Steam, Sweat, and Water","location":"The Firmament","id":69540,"patch":5.41,"sort":1202,"eventIcon":71221,"issuer":1035295,"target":1035297,"genre":84,"journal":["The blissful bather is dying to talk to anyone who will listen to him."],"objectives":["Speak with the blissful bather.","Speak with the blissful bather once more.","Speak with the blissful bather yet again."],"dialogue":[{"name":"SAUNAMAN04004","text":"Welcome! Welcome, my good <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span>, to Snowsoak Springs! This is my favorite place in the world, and once you experience its soothing waters for yourself, I've little doubt it will be yours as well!"},{"name":"SAUNAMAN04004","text":"Yes, visitors of all stripes come from near and far seeking the succor of its healing waters, which are all but proven to have the power to wash away one's every worry, and ease nigh upon every ache, pain, ailment, or malady known to man! Why, I myself have bathed here some twenty-odd times─and that's just today!"},{"name":"SAUNAMAN04004","text":"Do you not feel the gentle, steamy breeze in the air? Does the sound of trickling water not tickle your ears with sheer delight? Can you not scarcely wait to free yourself from the biting cold and slip into a sublime world of warmth and comfort?"},{"name":"SAUNAMAN04004","text":"Say no more─your bemused gaze tells me that this is your first visit to this splendiferous site. Allow me to give you the tour. This here is the rest area, where one can relax and cool off one's body after a sumptuous soak."},{"name":"SAUNAMAN04004","text":"Sitting here and breathing in the fresh air whilst sipping Ishgardian brandy or nourishing both belly and soul with a cup of yak's milk─why, if there is a more heavenly sensation to be found in this realm, then I'm a mylodon's uncle!"},{"name":"SAUNAMAN04004","text":"Now, allow me to truly amaze and astound you, for I haven't even gotten to the best part of it all! I speak, of course, of the steam bath─that blissful haven of heat and sweat that will flush the toxins out of every pore of your body and leave you feeling like a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> reborn! But why take my word for it? Slip into your bathing attire and follow me!"},{"name":"SAUNAMAN04004","text":"You came for a nice relaxing soak in the water, you say? Ah, but don't you worry─that's coming at the end. Trust me, you'll appreciate it that much more after you've sweat your fair share."},{"name":"SAUNAMAN04004","text":"Is it not a sight to behold? I swear to you, if there is a more incredible invention in our entire realm, why, you can cast me from the highest peak of Coerthas! Some find the heat too overpowering for their liking, but I'm certain that for a strapping young <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> like yourself, the experience will prove positively divine!"},{"name":"SAUNAMAN04004","text":"And once the sweat has poured from you like Greytail Falls, plunge into the chill waters of this pool and, mark my words, you'll feel as if you went soaring straight to the heavens! Not to mention that you'll lock in the heat and ward off any malicious maladies or ailments seeking to break into your body."},{"name":"SAUNAMAN04004","text":"But don't take my word for it! Just between you and me, a certain illustrious individual who shall remain unnamed but may or may not be the esteemed Azure Dragoon has been known to stop by for a soak from time to time. Why, I've even spoken with him myself!"},{"name":"SAUNAMAN04004","text":"We soon bonded over our love for all things bath, and he was kind enough to share with me a tale of the time he did frequent a bathhouse on one of his travels to the land of Hingashi."},{"name":"SAUNAMAN04004","text":"In that far-flung realm, he said, they heat cups of rice wine in the waters and sip upon them whilst nibbling on seasoned dried squid. Why, I would happily trade away my firstborn son for even the chance of experiencing such rapture just once in my life!"},{"name":"SAUNAMAN04004","text":"Ah, but I'm getting ahead of myself again. Yes, I simply must escort you to the baths!"},{"name":"SAUNAMAN04004","text":"Feast your eyes upon Snowsoak's pride and joy─the grand baths! I have it on good account that a select group of Ishgard's most accomplished artisans labored for nigh seven fortnights to shape this tub into an aesthetically perfect form worthy of the blissful waters that fill it."},{"name":"SAUNAMAN04004","text":"Why, it's said that the original design was conceived by none other than one of the finest minds of House Dzemael, who also developed the method by which the springs are summoned up from deep beneath the ground to bless our bodies with their warmth and healing powers."},{"name":"SAUNAMAN04004","text":"Why, it's said that the original design was conceived by none other than the erstwhile Count Tarresson de Dzemael, who also developed the method by which the springs are summoned up from deep beneath the ground to bless our bodies with their warmth and healing powers."},{"name":"SAUNAMAN04004","text":"But could one possibly hope to appreciate the sheer wonder of the baths and sauna simply by hearing some stranger ramble on rapturously about it until the end of time? Heavens, no! So what are you waiting for? Doff your garb and hop in for yourself already!"},{"name":"SAUNAMAN04004","text":"Tell me, my friend, are you prepared to experience true bliss?"},{"name":"Q1","text":"Enter the hot springs in your current garb?"},{"name":"SAUNAMAN04004","text":"Ahhhhhhhhh... Is it not everything I said it was, and then some?"},{"name":"CHARLEMEND","text":"(-???-)...Pardon me."},{"name":"SAUNAMAN04004","text":"Slap me silly with a kissing trout─if it isn't the esteemed Count Charlemend de Durendaire!"},{"name":"SAUNAMAN04004","text":"What brings your lordship to this place? Does the Durendaire demesne not have a private bathhouse that far outstrips this place in sheer scope and luxury?"},{"name":"CHARLEMEND","text":"...Hmph. I do believe these facilities are open to one and all, regardless of stature or status. But if you must know─firstly, they afford me the opportunity to converse uninhibited with individuals such as yourself, that I might hear the voices of our citizens firsthand."},{"name":"CHARLEMEND","text":"If more members of the nobility were to follow my lead, I do firmly believe that Ishgard would become a more compassionate nation─yet far too many seem to believe themselves above it all. And so, as lord of the highest of High Houses, I come here to set an example."},{"name":"CHARLEMEND","text":"Secondly, I come to admire the artistry and technical mastery of House Dzemael. It pleases me greatly to see that they, too, are expanding their aesthetic pursuits, and forging a new role for themselves in this new age of peace and enlightenment."},{"name":"CHARLEMEND","text":"Thirdly...but is it not self-evident?"},{"name":"CHARLEMEND","text":"Soaking in these soothing waters and gazing out upon the snow-kissed landscape... Why, there is no place in our fair realm I would rather be."}],"reward":{"gil":680,"items":[{"num":10,"id":30126}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69538]}},"partials":[{"type":"npc","id":"1035295","obj":{"i":1035295,"n":"Blissful Bather","l":3435,"q":1}},{"type":"npc","id":"1035297","obj":{"i":1035297,"n":"Blissful Bather","l":3435,"q":1}},{"type":"item","id":"30126","obj":{"i":30126,"n":"Magicked Prism (House Dzemael)","l":1,"c":22630,"t":61}},{"type":"quest","id":"69538","obj":{"i":69538,"n":"Smiles Cross the Sky","g":83,"l":"The Firmament","s":22,"f":1}}]}