{"quest":{"name":"Like Master, Like Pupil","location":"Limsa Lominsa Upper Decks","id":69547,"patch":5.4,"sort":370,"icon":112406,"eventIcon":71201,"issuer":1035367,"target":1035381,"genre":10,"journal":["The trace of a wry smile is visible on Y'shtola's lips.","In your quest to cure as many of the tempered as possible, it is decided that you will turn to the wisdom of Master Matoya, the realm's foremost authority on familiars. Wasting no time, you set out for the Archon's hidden refuge in the Dravanian hinterlands.","Stepping into the dimly lit cave, you are greeted by the perennially cantankerous Matoya in typically biting fashion. “Pleasantries” thus exchanged, she demands to know your reason for coming, and Y'shtola dutifully explains your need for more familiars to play the role of Angelo. Pondering the challenge of producing a veritable herd of the creatures, the elderly Archon proposes creating a mother porxie who would in turn create the necessary porxies, and with a mixture of nostalgia and annoyance, makes mention of a certain moldy old hole...","The place to which Matoya so fondly alluded is soon revealed to be her abandoned workshop in the Makers' Quarter. There, she declares, you will be able to obtain all of the necessary ingredients for the mother porxie, and put them to use. You duly set off for the workshop's entrance, where a poroggo guide awaits.","At your word, the poroggo named Puro Roggo will show you into Matoya's Relict, that you might set about making your familiar-making familiar.<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","At the end of your ramble through the relict, you succeed in creating─and subsequently taming─the mother porxie. All that remains is to see if she can produce a litter of little helpers.","After G'raha Tia imbues the mother porxie with his magick, Y'shtola provides the familiar with the energy she needs to give birth. And give birth she does, to three bouncing baby Angelos, as all look on approvingly.","Your task in the relict thus accomplished, you rejoin your comrades outside. Though it will still be hard work to create the porxies, the process has been made a great deal more manageable, bringing you another step closer to finding a lasting solution to the primal problem."],"objectives":["Speak with Y'shtola in the Ruling Quarter.","Speak with Matoya.","Speak with Puro Roggo in the Makers' Quarter.","Enter Matoya's Relict.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"You may recall that in order to procure the ingredients for Angelo, we had no choice but to surrender ourselves to the whims of the pixies. But I should have done so with far better grace had I known what we would go on to achieve."},{"name":"ALISAIE","text":"We did it. We brought Ga Bu back. And if I have any say in the matter, he'll be the first of many."},{"name":"GRAHATIA","text":"Alisaie will be exhausted from her efforts, but you wouldn't think so to look at her now. If she is ready to press on, then so am I."},{"name":"YSHTOLA","text":"As she will be at pains to remind me, I have not paid Master Matoya a visit since returning from the First. But this seems as good a time as any. Come, let us make for her cave."},{"name":"ALPHINAUD","text":"It has been some time since Master Matoya last saw Y'shtola. What a lot they will have to talk about."},{"name":"ALISAIE","text":"Do you remember? When last we came here, it was to find out why the others had collapsed. If someone had told me then that they'd been whisked away to another world, I would probably have laughed in their face. You live and learn, eh?"},{"name":"GRAHATIA","text":"Master Matoya is something of a legend among Archons. I very much look forward to meeting her...if not the dressing down I am liable to receive for my inept attempts at summoning you."},{"name":"YSHTOLA","text":"I take it you are ready to bear witness to the joyous reunion of master and pupil? Very well..."},{"name":"ALPHINAUD","text":"A porxie that produces porxies... What an inspired idea."},{"name":"ALPHINAUD","text":"...By the way, <span class=\"highlight\">Forename</span>. Do you think I misspoke earlier? I assure you it was not my intention to embarrass anyone."},{"name":"ALISAIE","text":"In case you've ever wondered, Alphinaud got his innocent streak from our mother. And it can be rather endearing─even <span class=\"emphasis\">useful</span> in certain situations."},{"name":"ALISAIE","text":"But most of the time, it just makes me want to shake him. Poor Y'shtola..."},{"name":"YSHTOLA","text":"“Moldy old hole”...? She really must miss the place."},{"name":"GRAHATIA","text":"Where does she mean, do you think? Some manner of hidden workshop, perhaps?"},{"name":"MATOYA","text":"All right, off to my old workshop, then. Everything required to make your familiar is there."},{"name":"YSHTOLA","text":"That may be, but no one has set foot in there since the exodus. I dread to imagine what has become of it."},{"name":"MATOYA","text":"Oh, there's sure to be a handful of feral familiars and mayhap a monster or two. But nothing to trouble the likes of you. You can consider cleaning up the place payment for my help."},{"name":"ALISAIE","text":"Fine. We'll do it."},{"name":"MATOYA","text":"Good girl. Now, if there are no other objections, I suggest you run along to the Makers' Quarter."},{"name":"MATOYA","text":"I'll send one of my poroggos ahead to let you into the workshop. You need only tell him who you are. One can't be too careful, after all. Off you go."},{"name":"MATOYA","text":"What are you still doing here? Off to the Makers' Quarter with you! I'll join you when I'm ready. Go on, now! Shoo!"},{"name":"ALPHINAUD","text":"As I may have mentioned, Alisaie and I were still very young when we departed with the exodus. I envy Y'shtola for remembering the city as it once was."},{"name":"ALISAIE","text":"The grass could certainly do with a trim..."},{"name":"YSHTOLA","text":"The workshop was an unforgiving place even before the exodus, and I doubt the years of neglect have improved it."},{"name":"GRAHATIA","text":"Judging by the unruly state of the flora without, I think it safe to assume there will be no shortage of unruly fauna within. Add to that the undisturbed secrets of the workshop, and we have the makings of an adventure!"},{"name":"GUIDEPOROGGO","text":"Greetings, ribbit, and welcome to my good mistress's relict. Puro Roggo is my name, and I am honored to be your guide."},{"name":"GUIDEPOROGGO","text":"Within you will find a space dedicated to the making of familiars, along with a cavern wherein the requisite ingredients may be had. I must warn you, however, that the place has not played host to a single soul, much less a broom, in over fifteen years, and will, I regret, be in some disarray."},{"name":"GUIDEPOROGGO","text":"But rest assured, my brothers and I shall see to it you do not lose your way. Now then, ribbit! Only say the word, and I will show you in."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Small talk."},{"name":"A1","text":"Form a party and enter Matoya's Relict."},{"name":"A1","text":"Nothing."},{"name":"ALPHINAUD","text":"Though it has been a while since last I joined the fray, I have followed Alisaie's example and practiced whenever possible. My healing magicks are ready as always."},{"name":"ALISAIE","text":"I'm no stranger to porxie-making, as you know. And that must count for something!"},{"name":"YSHTOLA","text":"I was still a child when last I came here, but now I am rather more capable. Not that Master Matoya seems to have noticed. Mayhap she will when I have cleaned up the mess she left."},{"name":"GRAHATIA","text":"So, <span class=\"highlight\">Forename</span>, shall I lead the van? Or would you rather I followed up the rear?"},{"name":"GRAHATIA","text":"Whatever you prefer, I am happy to adapt. So come, let us go and make our mother porxie!"},{"name":"MATOYA","text":"Why aren't you in the Makers' Quarter? You're to look for my poroggo there. Go on now. I'll join you when I'm good and ready."},{"name":"GUIDEPOROGGO","text":"Are you ready, ribbit? But give me the word, and I will show you in."},{"name":"ALISAIE","text":"Given it was her first time making a porxie, Master Matoya did a fine job. Though she did have Angelo for inspiration."},{"name":"GRAHATIA","text":"Forgive me if this is a silly question, but of all creatures real and imagined...why choose a flying pig? Not that I dislike pigs, mind you..."},{"name":"MATOYA","text":"Ugh, my joints were fairly screaming by the time I got home, and Shtola was more hindrance than help. In future, I'll thank you to keep your favors closer to my cave."},{"name":"YSHTOLA","text":"My apologies, but I will rest here awhile. Go on without me."},{"name":"ALPHINAUD","text":"Lest you wonder, Master Matoya has returned to her cave with Y'shtola. Hm hm! They are as peas in a pod, are they not?"},{"name":"SYSTEM","text":"You may now enter Matoya's Relict with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."}],"reward":{"gil":4000,"instance":76},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69546]},"next":[69548]},"partials":[{"type":"npc","id":"1035367","obj":{"i":1035367,"n":"Y'shtola","l":28,"q":1}},{"type":"npc","id":"1035381","obj":{"i":1035381,"n":"Alphinaud","l":2001,"q":2}},{"type":"instance","id":"76","obj":{"i":76,"n":"Matoya's Relict","c":61801,"t":"Dungeons","min_lvl":80,"max_lvl":80,"min_ilvl":470}},{"type":"quest","id":"69546","obj":{"i":69546,"n":"Forget Us Not","g":10,"l":"The Rising Stones","s":360}},{"type":"quest","id":"69548","obj":{"i":69548,"n":"The Admiral's Resolve","g":10,"l":"The Dravanian Hinterlands","s":380}}]}