{"quest":{"name":"Alisaie's Quest","location":"The Rising Stones","id":69543,"patch":5.4,"sort":330,"icon":101037,"eventIcon":71201,"issuer":1032694,"target":1035344,"genre":10,"journal":["Krile's eyes light up at the sight of you.","Speaking with Krile at the Rising Stones, you are relieved to learn that the Archons have fully settled back into their bodies, and you duly assemble with them in Dawn's Respite to discuss the future. Midway through the meeting, Lyse arrives unannounced, and you all enjoy the happiest of reunions. Belatedly recalling the purpose of her visit, your old friend reports that civil war has broken out in the Empire, and invites you to an Alliance council in Ala Mhigo. While the others agree to travel to Gyr Abania, you and G'raha Tia opt to assist Alisaie in her quest to find a cure for tempering.","Wishing above all else to save the young kobold Ga Bu, Alisaie is hopeful that the treatment used to help those corrupted by sin eaters might also prove effective on the tempered. Before putting this theory to the proof, however, she would learn all she can of the condition. G'raha Tia suggests looking to Allagan wisdom, and that no place is more likely to have the answers you seek than the Aetherochemical Research Facility on Azys Lla. At Alisaie's mention of the need for an airship, Tataru smugly instructs you to meet her at the northern bank of Silvertear Lake, prepared to travel.","Arriving at Silvertear Lake, you are greeted with the sight of a shiny new airship named the <span class=\"emphasis\">Bonanza</span>, which Tataru proudly announces she built herself. After bathing in your admiration for a moment, the multitalented coinkeeper gives the call to board, and together you set forth for Azys Lla.","After an uneventful flight, you and your companions set down upon the floating continent, ready to plumb the mysteries of Allag once more."],"objectives":["Speak with Alisaie.","Speak with Tataru in Mor Dhona. ","Speak with Alisaie."],"dialogue":[{"name":"KRILE","text":"Oh, greetings, <span class=\"highlight\">Forename</span>. Come to look in on our friends?"},{"name":"KRILE","text":"Rest assured, everyone is quite well. I've been keeping a close eye on them, and have satisfied myself that they are all in fine health."},{"name":"KRILE","text":"As a matter of fact, they're just about to convene in Dawn's Respite to discuss how best to use their pent-up energy. Let's join them, shall we?"},{"name":"GRAHATIA","text":"&lt;sigh&gt; When Y'shtola is about, one cannot afford even the slightest slip..."},{"name":"TATARU","text":"Don't worry, I can say with complete confidence that G'raha is dressed for anything!"},{"name":"ALISAIE","text":"When I set out to save Halric, I think Ga Bu was always at the back of my mind. And having proved that the Light-corrupted are not lost, I am convinced that the same must be true of the tempered."},{"name":"ALISAIE","text":"Similar to those corrupted by the sin eaters, the aether of Ga Bu's soul has been rendered stagnant."},{"name":"ALISAIE","text":"And though the root cause is different, perhaps the solution is the same."},{"name":"GRAHATIA","text":"It is by no means an unreasonable hypothesis, Alisaie. And it warrants full investigation."},{"name":"ALISAIE","text":"If there's even a chance we can save Ga Bu, we have to try. But however much I'd like to race over to Limsa and set to work, there's no room for recklessness. Not when a child's life is at stake."},{"name":"ALISAIE","text":"As I'm sure Beq Lugg would remind us, we still know little and less about the soul. Any number of things could go wrong if we don't exercise due caution."},{"name":"ALISAIE","text":"And so, before attempting anything, we should learn all we possibly can about tempering."},{"name":"ALISAIE","text":"There's just one problem: research into the condition has long since ground to a halt, and the combined work of the many scholars involved doesn't exactly amount to a wealth of knowledge..."},{"name":"GRAHATIA","text":"Not of the <span class=\"emphasis\">modern</span> scholars, perhaps. But what of their ancient counterparts? I know the Allagans took a more-than-passing interest in the subject."},{"name":"GRAHATIA","text":"And if what we seek is to be found anywhere, it would surely be at the Aetherochemical Research Facility."},{"name":"ALISAIE","text":"...Where they experimented on primals and their worshipers, yes? Good thinking. I've never actually been there myself, but I did read the reports on Azys Lla. Which means we'll be needing an airship."},{"name":"TATARU","text":"Heh heh heh...! An <span class=\"emphasis\">airship</span>, you say?"},{"name":"TATARU","text":"Meet me at the northern bank of Silvertear Lake─I've got a little surprise for you. Oh, and come prepared to travel!"},{"name":"TATARU","text":"I give you the <span class=\"emphasis\">Bonanza</span>, the Scions' very own airship!"},{"name":"TATARU","text":"I built her as a company project with help from our friends at the Rising Stones, and named her for luck and prosperity!"},{"name":"ALISAIE","text":"Tataru, this is... This is <span class=\"emphasis\">amazing</span>! We'll be able to fly just about anywhere we want!"},{"name":"ALISAIE","text":"To be deleted."},{"name":"GRAHATIA","text":"Our garments were impressive enough, but to build an entire airship... I see the annals did not exaggerate the many talents of the Scions' fabled coinkeeper."},{"name":"TATARU","text":"Hee hee hee! I'd <span class=\"emphasis\">also</span> introduce myself as your pilot, except the training didn't go quite as well as I'd hoped... But that's all right, because we've hired this capable fellow here instead!"},{"name":"TATARU","text":"The <span class=\"emphasis\">Bonanza</span> is equipped with a full complement of manacutters, by the way. Feel free to use them to get around Azys Lla!"},{"name":"TATARU","text":"But enough talk─it's time to fly. All aboard!"},{"name":"GRAHATIA","text":"Did I ever mention that I was fond of flying? Because I am. Be it on an airship, an amaro, or a chocobo, there is nothing so exhilarating as feeling the wind on your face as the horizon unfolds before you..."},{"name":"ALISAIE","text":"Honestly, <span class=\"emphasis\">Cid</span> would be jealous of the way that airship flies. Tataru has outdone herself."},{"name":"ALISAIE","text":"Anyway, here we are, on Azys Lla─and Alphinaud's report did <span class=\"emphasis\">not</span> do the scale of this place justice..."}],"reward":{"gil":935},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69318]},"next":[69544]},"partials":[{"type":"npc","id":"1032694","obj":{"i":1032694,"n":"Krile","l":481,"q":2}},{"type":"npc","id":"1035344","obj":{"i":1035344,"n":"Alisaie","l":2101,"q":1}},{"type":"quest","id":"69318","obj":{"i":69318,"n":"Reflections in Crystal","g":9,"l":"The Crystarium","s":320}},{"type":"quest","id":"69544","obj":{"i":69544,"n":"The Wisdom of Allag","g":10,"l":"Azys Lla","s":340}}]}