{"quest":{"name":"Planting the Seed","location":"The Firmament","id":69542,"patch":5.41,"sort":1204,"eventIcon":71221,"target":1035583,"genre":84,"journal":["A lonely sack rests on the streets of the Risensong Quarter, seemingly bereft of its owner."],"objectives":["Search for the owner of the sack.","Deliver the lily to the plucky youth.","Deliver the lily to the dainty lady.","Speak with Jeacock."],"dialogue":[{"name":"SYSTEM","text":"A simple, unadorned sack lies in the middle of the street. Might it belong to one of the residents of the Risensong Quarter? Look about nearby and see if you can't reunite the abandoned parcel with its owner."},{"name":"JEACOCK","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morning</span><span class=\"alternative\">day</span></span> to you, my dear <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. It's not every day a man gets paid a visit by the savior of Ishgard. What brings you here today?"},{"name":"JEACOCK","text":"What's that? You found a sack just lying in the street, you say? If it wouldn't be too bold to ask, might I have a look?"},{"name":"JEACOCK","text":"Just as I thought! If you're looking for the owner of this sack, you've found him. An acquaintance of mine just brought it to me, but we got so carried away in conversation that I completely forgot to take it with me."},{"name":"JEACOCK","text":"An embarrassing mistake, to say the least─but I fear the old noggin doesn't work quite as well when you get to my age. Still, pray forgive me. Ishgard's savior surely has better things to do than hauling sacks about town."},{"name":"JEACOCK","text":"If you're curious, the bag happens to be filled with flower seeds─Nymeia lilies, to be precise. As you may know, they're quite popular as an offering to those who have left us."},{"name":"JEACOCK","text":"I started growing them to honor my own dear son, who gave his life in the war. Some of my neighbors took an interest, and then some acquaintances of theirs... Soon as I knew it, I had my own veritable nursery."},{"name":"JEACOCK","text":"Flowers are a beautiful thing, wouldn't you agree? They have a way of bringing smiles to faces, even in the most trying of times. It's just a hobby for me, so I don't ask for coin, but people are kind enough to repay me with seeds and gardening tools, which has allowed me to...er...branch out a bit more, one could say."},{"name":"JEACOCK","text":"At any rate, it's a good life, and one I wouldn't be living were it not for you and your friends bringing an end to the war as you did. Not to mention everyone's tireless efforts in building the Firmament back up to where it even exceeds its former glory. Truly, I couldn't even begin to express my gratitude."},{"name":"JEACOCK","text":"Wait...I have an idea. A few acquaintances of mine had mentioned their intent to come by and pick up some flowers. Might you be so kind as to deliver them in my stead?"},{"name":"JEACOCK","text":"I reckon the flowers would mean that much more to them if brought by a real-life hero rather than an old greybeard like myself. My friends live right in the Risensong Quarter, not far from here─you know your way around these parts, yes?"},{"name":"JEACOCK","text":"Funny how fate plays out, isn't it? A single seed planted─literally, that is─can lead to a nobody like me crossing paths with the very <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> who saved our nation. Truly, it's nothing short of a miracle. Do this old man a favor just this once, would you please?"},{"name":"JEACOCK","text":"I'm terribly sorry to impose upon you like this, but it would mean the world to my friends in Risensong if you could deliver those lilies to them in my stead."},{"name":"ISHGARDIANA04006","text":"Are my eyes to be believed? Does <span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, hero of our land, stand before me? Oh, how the Spinner has blessed me today! But whatever brings you to this humble place?"},{"name":"ISHGARDIANA04006","text":"Why, I'll be─lilies from old Jeacock! Do you know the man? Forgive my impropriety, but never in my wildest dreams would I imagine <span class=\"emphasis\">you'd</span> be the one to bring them to me!"},{"name":"ISHGARDIANA04006","text":"I served House Dzemael as a sellsword during the war. It wasn't a bad life, but it was far from an easy one. Every day I give thanks for the efforts of you and your companions, by which I now am at long last able to live my days in peace."},{"name":"ISHGARDIANA04006","text":"And yet, my thoughts often drift to my brothers- and sisters-in-arms who were not so fortunate as to live to see this day. It is the least I can do to honor their sacrifice. Placing old Jeacock's flowers at their graves is a small gesture, perhaps, but one that never fails to put my heart at peace."},{"name":"ISHGARDIANA04006","text":"But even this small gesture... Why, what profound meaning it will take on knowing that these flowers were delivered by the hand of the savior of Ishgard <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>! My comrades' souls will surely soar to the heavens with pride this day!"},{"name":"ISHGARDIANA04006","text":"<span class=\"alternative-container\"><span class=\"alternative\">Mistress</span><span class=\"alternative\">Master</span></span> <span class=\"highlight\">Surname</span>, you do me too great an honor with your presence. Even if our paths never cross again, I promise you that I shall cherish this meeting for the rest of my days."},{"name":"ISHGARDIANB04006","text":"My heavens, it couldn't be─but it is! I had heard rumors that the savior of Ishgard <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> was personally assisting in the restoration effort, but never did I dream I would have the honor of encountering you in the flesh! Whatever brings you to the Firmament this fair <span class=\"alternative-container\"><span class=\"alternative\">eve</span><span class=\"alternative\">morn</span><span class=\"alternative\">day</span></span>?"},{"name":"ISHGARDIANB04006","text":"A Nymeia lily from Jeacock? For me? What a lovely gesture. I shall place it at my daughter's gravestone, just as I have every day since you and your companions mercifully ended the war."},{"name":"ISHGARDIANB04006","text":"While the fighting still raged on, it was all I could do to eke out a living. Deep down, the loss of my child devastated me, but my heart was too consumed by fear and uncertainty to grieve as a mother should."},{"name":"ISHGARDIANB04006","text":"Now, thanks to the efforts of Lord Francel─and generous souls like yourself─I no longer want for a roof over my head and food on my plate. At long last, I know the peace of mind that frees me to reflect upon my daughter's life, and honor her memory."},{"name":"ISHGARDIANB04006","text":"While I would have liked nothing more than to walk these streets with her─to show her what a magnificent, uplifting place the Firmament has become─I can at least take comfort in knowing that her spirit lives on in my own heart, and in the city and nation I now strive to help rebuild."},{"name":"ISHGARDIANB04006","text":"And though my own child may never return, I also find solace in knowing that the younglings I see playing in the streets need never make the same sacrifice. For this, you have our eternal gratitude."},{"name":"ISHGARDIANB04006","text":"Because of you, no Ishgardian child shall ever again be forced to make the sacrifice my precious daughter did. For this, you have our eternal gratitude."},{"name":"JEACOCK","text":"Ah, I see you delivered the lilies. Thank you, friend. You've done me a greater kindness than I deserve."},{"name":"JEACOCK","text":"My apologies for imposing upon you as I did. I know as well as any that you've no end of gravely important matters to attend to."},{"name":"JEACOCK","text":"And yet, being the old busybody I am, I couldn't help but feel that I wanted you to see and hear from the people of this place yourself."},{"name":"JEACOCK","text":"To witness, to experience firsthand just how much your presence has meant to─and I do not exaggerate─every last man, woman, and child who calls this place home."},{"name":"JEACOCK","text":"Indeed, it is because of you above all that we can at last come to some small measure of peace with the past, devote our efforts in the present, and turn a hopeful eye towards an ever-brighter future."},{"name":"JEACOCK","text":"Speaking of which, do you perchance know the traditional meaning of the Nymeia lily? While nowadays they are thought of as a symbol of parting─and therefore used to pay tribute to the departed─in olden times, they were said to afford safe passage to those embarking on a journey."},{"name":"JEACOCK","text":"I pray that the Spinner always watches over you in your travels. Know that you are ever welcome here, in this place where your deeds have allowed an entire nation and its people to set forth on a new journey of their own."}],"reward":{"gil":648,"items":[{"id":20795}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69538]}},"partials":[{"type":"npc","id":"1035583","obj":{"i":1035583,"n":"Jeacock","l":3435,"q":1}},{"type":"item","id":"20795","obj":{"i":20795,"n":"Brightlily Seeds","l":1,"c":27464,"t":82,"p":300}},{"type":"quest","id":"69538","obj":{"i":69538,"n":"Smiles Cross the Sky","g":83,"l":"The Firmament","s":22,"f":1}}]}