{"quest":{"name":"The Search for Sicard","location":"Limsa Lominsa Lower Decks","id":69549,"patch":5.4,"sort":390,"eventIcon":71201,"issuer":1035386,"target":1035391,"genre":10,"journal":["Alphinaud has the look of a man with a plan."],"objectives":["Speak with Alphinaud at Oschon's Embrace.","Speak with Alphinaud."],"dialogue":[{"name":"ALISAIE","text":"Do you remember how Alphinaud pretended to be some manner of merchant to infiltrate Eulmore? Well, I bet you ten gil he's about to reprise the role."},{"name":"GRAHATIA","text":"If Alphinaud's theory proves well founded, it would go some way to explaining the Executioners' vehement opposition to peace."},{"name":"ALPHINAUD","text":"During my inquiries, a disgruntled merchant informed me that a wholesaler of crystals had recently arrived in Limsa Lominsa, offering wares at prices far undercutting the competition."},{"name":"ALPHINAUD","text":"After asking around, I was able to gain an introduction, and will shortly pose as a potential buyer, in a bid to establish the crystals' provenance."},{"name":"ALPHINAUD","text":"The man is due to be at Oschon's Embrace in lower La Noscea shortly. I suggest we make our way there at once."},{"name":"ALPHINAUD","text":"That appears to be our merchant. Wish me luck..."},{"name":"GRAHATIA","text":"Wait. If he truly is in league with the Bloody Executioners, he will surely be wary of those allied to the Admiral─the Scions not least of all."},{"name":"GRAHATIA","text":"Compared to yours and <span class=\"highlight\">Forename</span>'s, mine is an unfamiliar face. Let me play the role of buyer."},{"name":"ALISAIE","text":"G'raha is right. And even if you aren't recognized on sight, you look too genteel to be mixing with society's underbelly."},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">Genteel</span>...? But very well. I leave it you, G'raha."},{"name":"SUSPICIOUSMERCHANT","text":"Got business with me, catboy?"},{"name":"GRAHATIA","text":"I─ Ahem. You're the crystal wholesaler?"},{"name":"SUSPICIOUSMERCHANT","text":"That I am. But you're no merchant. So what do you want the crystals for?"},{"name":"GRAHATIA","text":"Um... I, er..."},{"name":"ALISAIE","text":"(Don't look at us, you idiot! You'll give yourself away!)"},{"name":"SUSPICIOUSMERCHANT","text":"Ohhh, I see. You're a weaponsmith, am I right? And you need crystals to make staffs like that fine specimen you've got there."},{"name":"GRAHATIA","text":"Th-That's right! I am indeed a weaponsmith, and I use naught but the finest materials. I bid you show me your wares."},{"name":"SUSPICIOUSMERCHANT","text":"Well, we don't invite just <span class=\"emphasis\">anybody</span> into our storehouses. Takes time to establish trust, you understand."},{"name":"GRAHATIA","text":"Look, I have a large and urgent commission. If the quality is satisfactory, I will not quibble over the price."},{"name":"SUSPICIOUSMERCHANT","text":"...All right. It's plain that's no ordinary crystal adornin' your staff. So I'll make an exception. Come with me."},{"name":"ALPHINAUD","text":"It...seems to be working. Let's follow them."},{"name":"ALISAIE","text":"Given how long he spent playing the Crystal Exarch, you'd think G'raha would be a better actor."},{"name":"ALISAIE","text":"Honestly, if it hadn't been for that staff... We must remember to thank Tataru."},{"name":"ALPHINAUD","text":"They went into that tunnel. Quietly, now..."},{"name":"SUSPICIOUSMERCHANT","text":"You won't find any finer. 'Specially not for the price."},{"name":"GRAHATIA","text":"Indeed. I would expect to pay more than double for such quality. How could they possibly be so cheap?"},{"name":"SUSPICIOUSMERCHANT","text":"There's nothin' <span class=\"emphasis\">unlawful</span> about 'em, if that's your worry. They're from O'Ghomoro, if you take my meanin'."},{"name":"SUSPICIOUSMERCHANT","text":"Stuff's as pure as it gets─you won't be disappointed. So...how much d'you want?"},{"name":"ALPHINAUD","text":"O'Ghomoro. Taken from the kobolds, just as we suspected."},{"name":"SICARD","text":"(-???-)That's enough. Shut your gobs and turn around. Slowly."},{"name":"SICARD","text":"I'm Sicard, actin' captain of the Bloody Executioners."},{"name":"SICARD","text":"No need to introduce yourselves. We know who you are...<span class=\"emphasis\">Scions</span>."},{"name":"SICARD","text":"And we also know you've been chattin' to the Admiral. Got eyes and ears everywhere, see. Comes with bein' the only true pirate crew left in Limsa."},{"name":"SICARD","text":"So we've established you ain't here to buy crystals. The question is: what <span class=\"emphasis\">are</span> you here for?"},{"name":"ALPHINAUD","text":"You are bold to reveal yourself to us without knowing our objective. But that would explain your swift rise to power."},{"name":"ALPHINAUD","text":"You have spoken plain, and so I shall return the favor. We came here to learn why the Bloody Executioners oppose the Admiral's will."},{"name":"ALPHINAUD","text":"And we have our answer. Should Limsa Lominsa make peace with the kobolds, you would lose the source of your newfound wealth."},{"name":"SICARD","text":"That's right. Just to remind you, though, we ain't breakin' any rules here."},{"name":"SICARD","text":"The law forbids us from attackin' any vessel not flyin' the imperial flag, but it don't say <span class=\"emphasis\">nothin'</span> about beastmen."},{"name":"SICARD","text":"Only reason we keep our operation nice and quiet's 'cause we don't want no one takin' our business."},{"name":"SICARD","text":"<span class=\"emphasis\">Wait.</span> Just listen to the end, will you? For what it's worth, I have the highest respect for you and yours─<span class=\"alternative-container\"><span class=\"alternative\"><span class=\"emphasis\">her</span></span><span class=\"alternative\"><span class=\"emphasis\">him</span></span></span> especially."},{"name":"SICARD","text":"While the Maelstrom were worryin' about dirtyin' their fancy red clobber, you lot stormed U'Ghamaro and battered bleedin' Titan himself. Raised a mug to you when I heard the news!"},{"name":"SICARD","text":"And now we're followin' in your footsteps, makin' sure the beastmen never summon their stinkin' gods again. Practically your successors, we are."},{"name":"SICARD","text":"When there were still imperial ships about, we did our bit for Limsa and went after 'em. But with the Garleans gone, there's no one left to ply our trade on 'cept the beastmen. So let us have that, eh? It's only fair."},{"name":"GRAHATIA","text":"...Contentious though some may find your views, it is true that you have broken no laws."},{"name":"GRAHATIA","text":"That being so, I see no reason why you should not state your case directly to the Admiral's face. Unless the acting captain of the only true pirate crew left in Limsa Lominsa has some other cause to hide in a cave?"},{"name":"SICARD","text":"Hmph. Well said. Well said indeed..."},{"name":"SICARD","text":"All right. I'll meet with the Admiral. I'll even provide the venue─the <span class=\"emphasis\">Astalicia</span>. I trust she won't turn down the invitation."}],"reward":{"gil":815},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69548]},"next":[69550]},"partials":[{"type":"npc","id":"1035386","obj":{"i":1035386,"n":"Alphinaud","l":29,"q":2}},{"type":"npc","id":"1035391","obj":{"i":1035391,"n":"Alphinaud","l":31,"q":2}},{"type":"quest","id":"69548","obj":{"i":69548,"n":"The Admiral's Resolve","g":10,"l":"The Dravanian Hinterlands","s":380}},{"type":"quest","id":"69550","obj":{"i":69550,"n":"On Rough Seas","g":10,"l":"Lower La Noscea","s":400}}]}