{"quest":{"name":"Swords to Plowshares","location":"The Firmament","id":69541,"patch":5.41,"sort":1203,"eventIcon":71221,"issuer":1035301,"target":1035301,"genre":84,"journal":["Edilaude looks as if she's ready to take on the world."],"objectives":["Use the coal to light the fireworks on Quill's Trace.","Use the coal to light the fireworks on the Mattock.","Use the coal to light the fireworks on the Abacus.","Speak with Edilaude."],"dialogue":[{"name":"EDILAUDE","text":"If it isn't the savior of Ishgard, in the flesh! You couldn't have come at a better time. How would you like to assist the illustrious Edilaude, Ishgard's preeminent pyrotechnician, in her latest foray into the realm of sky-spanning aesthetic excellence?"},{"name":"EDILAUDE","text":"Say no more─of course you would! Here, take this coal into hand and use it to set the masterpiece I've placed over on Quill's Trace aflame. I promise you, the result will be nothing short of scintillating!"},{"name":"EDILAUDE","text":"Well, what are you waiting for? Go and set my marvelous invention ablaze already! Every second you tarry, you deprive the world of my sheer aesthetic mastery!"},{"name":"ISHGARDIANA04005","text":"Oho! Now there's a sight to behold. Edilaude kept saying how she was slaving away in her workshop on the project of a lifetime, but I figured she was just blowing hot air again."},{"name":"ISHGARDIANA04005","text":"You honor us with your presence, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>. Just between you and me, I couldn't help but notice a similar-looking device sitting all alone atop the Mattock, and a group of children eagerly gathered around it. Perhaps Edilaude means to put on a show for them as well?"},{"name":"ISHGARDIANA04005","text":"Edilaude just dropped this here and ran off laughing like a woman possessed. Whatever could it be?"},{"name":"ISHGARDIANA04005","text":"I'm sure nothing would delight the children more than to see the sky filled with a blaze of colors."},{"name":"ISHGARDIANB04005","text":"The sky! It's sparkling! I've never seen anything so beautiful!"},{"name":"ISHGARDIANB04005","text":"Hey, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! I saw another one of those tubes over on the Abacus. Do you think that one will make the sky light up, too?"},{"name":"ISHGARDIANB04005","text":"Huh? What's this weird tube?"},{"name":"ISHGARDIANB04005","text":"Come on, <span class=\"alternative-container\"><span class=\"alternative\">miss</span><span class=\"alternative\">mister</span></span>! Make the sky light up again!"},{"name":"ISHGARDIANB04005","text":"Oh, what beautiful fireworks! I've not seen such a sight since...well, it's been many years. Still, what a lovely way to celebrate the restoration of the Firmament."},{"name":"ISHGARDIANB04005","text":"And how fitting is it that the one to ignite the blaze is none other than the very hero who delivered our fair nation from war? Thank you, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>. Do pass on my regards to dear Edilaude next time you see her."},{"name":"ISHGARDIANB04005","text":"Not a day goes past that I do not give thanks for all you have done for us, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span>. But whatever brings you here today?"},{"name":"ISHGARDIANB04005","text":"Truth be told, Edilaude's the daughter of a dear friend of mine. The girl's always been a touch eccentric, but she's got a good heart in her."},{"name":"ISHGARDIANB04005","text":"She fought bravely in the war, but I heard she was struggling to find good work in recent days. It's good to know she's found a new passion to pursue."},{"name":"EDILAUDE","text":"Who gave you permission to set off <span class=\"emphasis\">all</span> the fireworks, you fool!? But I jest! I was hoping you would do just that. Why, I saw the sight from here, and I do believe it's safe to say that I am every ilm the genius that I always knew myself to be! Did the townspeople appreciate my masterwork as much I did?"},{"name":"EDILAUDE","text":"Of <span class=\"emphasis\">course</span> they did! The incredible spectrum of colors, the unsurpassed elegance with which they dance and dart through the sky─only a fool or a blind man would fail to appreciate the spectacle!"},{"name":"EDILAUDE","text":"But my true dream doesn't end there. Take a look at this beauty beside me."},{"name":"EDILAUDE","text":"Bertha here was my pride and joy when I served on the front lines. I couldn't count the number of times she saved me from the ravaging claws of the Horde."},{"name":"EDILAUDE","text":"When the war ended, I figured she'd just end up all alone, collecting dust in the dark corner of some storehouse. So I offered to take her home myself, with the promise that I'd keep her well maintained and put her to good use─and my natural aptitude for pyrotechnics has allowed me to do just that."},{"name":"EDILAUDE","text":"We may no longer have need for weapons to shoot dragons out of the sky, but I mean to give Bertha here a new life shooting sheer beauty into the sky, and bringing joy and hope to the people of our nation."},{"name":"EDILAUDE","text":"But why stop at Ishgard? Yes, one day I will journey across all of Eorzea with Bertha in tow, lighting up the skies in all corners of the realm with a spectacular rainbow of fiery blossoms!"},{"name":"EDILAUDE","text":"For the part you've played in helping me realize my life's work, I thank you. As do, no doubt, all who will one day bear witness to the wonders that you have helped me introduce to the world!"},{"name":"EDILAUDE","text":"And with that, I give you leave to resume your travels. But wherever you roam, always look to the sky─for you never know when Edilaude's fabulous fireworks will return to grace your eyes once more!"}],"reward":{"gil":713,"items":[{"num":10,"id":30125}]},"reqs":{"jobs":[{"lvl":60,"id":1}],"quests":[69538]}},"partials":[{"type":"npc","id":"1035301","obj":{"i":1035301,"n":"Edilaude","l":3435,"q":1}},{"type":"item","id":"30125","obj":{"i":30125,"n":"Magicked Prism (Ishgard)","l":1,"c":22630,"t":61}},{"type":"quest","id":"69538","obj":{"i":69538,"n":"Smiles Cross the Sky","g":83,"l":"The Firmament","s":22,"f":1}}]}