{"quest":{"name":"The Great Ship Vylbrand","location":"Command Room","id":69551,"patch":5.4,"sort":410,"icon":101039,"eventIcon":71201,"issuer":1002694,"target":1035407,"genre":10,"journal":["For the first time in a long time, Merlwyb's course is clear.","Having secured the cooperation of the Bloody Executioners, Merlwyb promptly turns her attention to the kobolds. She would have you and your fellow Scions use the tempering cure on the kobold patriarch, and proposes using herself and the beastmen's stolen crystals as bait to draw him out. Even should the kobolds have no interest in peace, Eynzahr concedes, they would not forgo an opportunity to take the Admiral's life. Merlwyb adds that there is every chance the kobolds will attempt to summon Titan, and that you will be required to protect Alisaie until such time as she has administered the cure. Her plan thus laid out, you depart to see to your preparations, before making your way to Camp Overlook.","You have scarcely taken your place at the camp when Ga Bu comes scampering into your midst. The young kobold apparently has something important he wishes to say to his leader, and wants to join you on your mission. Alisaie will not hear of it, however, doubtless recalling what came to pass when last the child wandered into the fray.<br><br>A short while later, the Admiral arrives bearing news that she has succeeded in securing a meeting with Patriarch Za Da of the Second Order, the same fanatical soul who presided over the sacrifice of Ga Bu's parents. Putting the images of that fateful day from your mind, you set out for the U'Ghamaro Mines on your way to the Navel, site of many a Titan summoning...","At your word, the party enters the Navel via the beastman aetheryte, and no sooner does Merlwyb announce herself to Za Da than he attempts to summon Titan. The Admiral is ready, however, and interrupts him with a well-placed shot, affording Eynzahr the chance to restrain the kobold leader with a relic of his piratical past. Wasting no time, Alisaie summons Angelo and sets to work, leaving you to fight off wave after wave of angry kobolds and their minions. After what feels like an eternity, the treatment takes effect, and Za Da awakens from his reverie even as his guards flee in terror.","Though free of Titan's influence, and riven with remorse over the crimes he committed against his own, Za Da cannot forget the many betrayals his people have suffered, and refuses to trust mankind. But thanks to the heartfelt pleas of Merlwyb─and young Ga Bu, who could not stay away─the patriarch is eventually convinced to give peace a chance. Thus is it that, after centuries of bloodshed, Limsa Lominsa takes its first tentative step on the road to lasting peace with the kobolds.","Back at Camp Overlook, Merlwyb expresses her thanks to you and your fellow Scions for the invaluable part you played in bringing Limsa Lominsa and her nearest neighbors together. Though the fledgling peace only extends to the Second Order for the present, the Admiral is determined to bring every kobold into the fold, however long it takes."],"objectives":["Speak with Alisaie at Camp Overlook.","Speak with Merlwyb.","Speak with Merlwyb again."],"dialogue":[{"name":"ALPHINAUD","text":"When the discussion gave way to a duel, I feared what might unfold. Yet only a fool would underestimate the Admiral─as Sicard soon discovered."},{"name":"ALISAIE","text":"While I don't condone what Sicard has been doing, I know how difficult it can be to change course. It took me long enough to join the Scions, didn't it."},{"name":"GRAHATIA","text":"There are times when one must stand one's ground, even if the cost of failure is beyond reckoning."},{"name":"GRAHATIA","text":"The Admiral did just that, and I have nothing but respect for her. As she continues to steer her nation through this period of transition, I pray the Navigator will see fit to fill her sails."},{"name":"EYNZAHRSLAFYRSYN","text":"Like Mistbeard before him, Hyllfyr chose to trust the future of our nation to the Admiral. That was the moment, I believe, that the good ship Limsa Lominsa finally embarked upon her new course."},{"name":"ZANTHAEL","text":"The Admiral awaits you in the command room, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>. Shall I announce you?"},{"name":"SYSTEM","text":"Proceed to the command room?"},{"name":"MERLWYB","text":"Now, I need hardly tell you, but any attempt to negotiate with the tribes is doomed to fail unless their minds can first be wrested from the grip of their gods."},{"name":"MERLWYB","text":"And so, in the meeting we seek to arrange with the kobolds, I would have you free their leader of Titan's influence."},{"name":"ALISAIE","text":"Leave it to us. We will open his ears to reason."},{"name":"MERLWYB","text":"You have my thanks.<br>Ere we proceed, there is something you should know."},{"name":"MERLWYB","text":"Some fifty years past, when the Sahagin swarmed at our hulls in ever greater numbers, Limsa entered into a covenant with the kobolds."},{"name":"ALPHINAUD","text":"“To men shall go the bounty of the sea; to kobolds shall go the bounty of the land.” An ostensibly equitable arrangement...conspicuously lacking in detail."},{"name":"MERLWYB","text":"Aye. Inadvertently or not, the wording was ambiguous. And we took advantage of it, moving in to claim the northern reaches of La Noscea─which the kobolds believed theirs."},{"name":"MERLWYB","text":"Bloodshed followed. Then bloodshed to answer the bloodshed. And on and on it went, till every ilm of Vylbrand bore the stain of our conflict."},{"name":"MERLWYB","text":"This is not <span class=\"emphasis\">history</span>, you understand. It is the present, fresh and raw. And with their kindred's blood yet on our hands, we will struggle to regain the kobolds' trust, even should we cure their tempered."},{"name":"EYNZAHRSLAFYRSYN","text":"(-Eynzahr-)Admiral. You speak of obstacles we are like to encounter at the meeting, but as things stand, I see no reason why the kobolds would agree to a meeting in the first place."},{"name":"MERLWYB","text":"And so we must <span class=\"emphasis\">provide</span> a reason. I will restore their stolen crystals to them, and personally deliver the cargo along with my apologies."},{"name":"EYNZAHRSLAFYRSYN","text":"(-Eynzahr-)Bait. They would welcome us into their midst not to speak of peace, but to have you at their mercy."},{"name":"MERLWYB","text":"Aye. And given the wealth of crystals we will bring, I'll wager they will attempt to summon Titan there and then."},{"name":"ALISAIE","text":"Meaning a high priest would need to be present...to whom we could administer the cure!"},{"name":"MERLWYB","text":"Precisely. He is the fish I would catch. But he will not be alone. Nay, he will have guards on hand, and they will lay down their lives to protect him."},{"name":"MERLWYB","text":"Yet a single death on the kobolds' side would jeopardize our chance at peace. And there my venture founders..."},{"name":"EYNZAHRSLAFYRSYN","text":"(-Eynzahr-)...Yet it need not. What if we were to employ the Conqueror's Chain? Though we would still have to weaken the kobolds, it would allow us to subdue them without inflicting lasting harm."},{"name":"MERLWYB","text":"The artifact Mistbeard used to take goods and not life? Aye, that would serve. Well done, Marshal."},{"name":"MERLWYB","text":"So, friends, what think you of our strategy?"},{"name":"GRAHATIA","text":"The effects of tempering are cumulative, and we may safely assume that the high priest's exposure to primal influence is extensive. It will therefore take a great deal of aether to reverse its effects, not to mention time."},{"name":"ALPHINAUD","text":"Time during which Alisaie would be defenseless. Even should we all look to her protection, I am not convinced we could keep an entire army of kobolds at bay."},{"name":"ALISAIE","text":"Well, I'm happy to take that risk. It's not as if we have any other choice."},{"name":"ALISAIE","text":"Besides, it's what Tesleen would do. And had I not followed her example, we wouldn't even <span class=\"emphasis\">have</span> a cure for tempering, much less a chance to bring peace to Vylbrand."},{"name":"ALISAIE","text":"So I'm going to cure that priest, or die trying."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I believe in you, Alisaie!"},{"name":"A1","text":"There must be another way..."},{"name":"ALISAIE","text":"And I believe in you too. You and everyone. I know you'll keep me safe."},{"name":"ALISAIE","text":"We don't need one. I trust you. All of you. And I know you'll keep me safe."},{"name":"MERLWYB","text":"It is settled, then. See to your preparations, and make for Camp Overlook. We will join you there anon."},{"name":"ZANTHAEL","text":"I shall be praying for your success at the negotiation! Godsspeed!"},{"name":"ALPHINAUD","text":"I have no doubt that Alisaie will succeed with the cure, if we can but afford her the time."},{"name":"GRAHATIA","text":"Be under no misapprehension: the extent of the high priest's tempering is like to far exceed that of Ga Bu."},{"name":"GRAHATIA","text":"But then his was a relatively mild case. Milder, indeed, than the majority of those we wish to save. The coming mission will be a truer test of our treatment."},{"name":"ALISAIE","text":"Alphinaud wasn't lying when he said I'd be defenseless. So I'm counting on you all to give me the time I need."},{"name":"ALPHINAUD","text":"Our sole purpose will be to keep you out of harm's way. So leave that to us, and focus on your own task."},{"name":"GRAHATIA","text":"Indeed. And should you want for aether, you need only say the word."},{"name":"ALISAIE","text":"Ga Bu! Did you follow us here!?"},{"name":"GABU","text":"There's something important that I want to say to the high priest. Express, state, say. Please let me come with you. Please!"},{"name":"ALISAIE","text":"I'm sorry, but it's too dangerous. I need you to promise me that you'll stay here where it's safe, all right?"},{"name":"MERLWYB","text":"My apologies for the wait. It took time, but we have secured our audience."},{"name":"MERLWYB","text":"All unfolded as expected. At the mention of my returning their crystals in person, the kobolds suddenly remembered how keen they were to be reconciled."},{"name":"MERLWYB","text":"And so, in the glorious spirit of cooperation, we are to be received by Patriarch Za Da of the Second Order, who awaits our pleasure in the Navel. If you are ready, let us proceed to the U'Ghamaro Mines at once."},{"name":"GABU","text":"But I really wanted to go with you... Accompany, join, go with you... &lt;whimper&gt;"},{"name":"ALPHINAUD","text":"Patriarch Za Da... If the name sounds familiar, it is because he was the one who presided over the deaths of Ga Bu's parents."},{"name":"ALPHINAUD","text":"I tried to reach out to him that day, only for my pleas to fall upon deaf ears."},{"name":"ALPHINAUD","text":"But this day will be different. We will reach out together, all of us, and we will take peace in our grasp."},{"name":"ALISAIE","text":"There's nothing more to say. I'm going to do this─for Ga Bu, and Tesleen, and anyone who's ever dreamed of a better future."},{"name":"GRAHATIA","text":"Alisaie can be forgiven a certain amount of recklessness, but if she goes so far as to contemplate sacrificing herself, I will remind her how she responded when I thought to do the same."},{"name":"GRAHATIA","text":"Not that we will let it come to that, of course. Ready when you are, my friend."},{"name":"EYNZAHRSLAFYRSYN","text":"The Conqueror's Chain stands ready. But weaken your foes, and it will see them subdued."},{"name":"BLOEIDIN","text":"Thought I saw the little one come scamperin' in here earlier. Better now, is he?"},{"name":"MERLWYB","text":"This aetheryte will bear us to our quarry."},{"name":"MERLWYB","text":"Should he make to summon Titan, as I anticipate, we will halt the ceremony and restrain him."},{"name":"MERLWYB","text":"At this, all hells will break loose, and we will have an army of kobolds to entertain till Alisaie's work is done. Just remember: none must die. We weaken them, and let Eynzahr do the rest."},{"name":"MERLWYB","text":"It is time. Stay the course, my friends. I spy calmer waters beyond this squall."},{"name":"GABU","text":"I'm so glad we could sway the patriarch. Convince, persuade, sway. Thank you for making it possible! Thank you!"},{"name":"ALPHINAUD","text":"It has taken a long time, but the dream of a lasting peace with the kobolds may soon become a reality. And it is all thanks to Alisaie."},{"name":"ALISAIE","text":"The treatment may have restored the patriarch to his senses, but it was the Admiral and Ga Bu's words that touched his heart. This moment belongs to all of us, <span class=\"highlight\">Forename</span>. We couldn't have done it without each other."},{"name":"GRAHATIA","text":"In two separate worlds, the seeds were sown, and through the determination of two indomitable women, they have quickened into this historic moment. I feel honored to have been present to see it."},{"name":"EYNZAHRSLAFYRSYN","text":"The Admiral seems hells-bent on worrying me to death, but I suppose the ends justify the means. Well fought, my friend. Well fought."},{"name":"MERLWYB","text":"'Twould seem we have found a way forward with the kobolds. Next, we will help the Second Order to free their tempered brethren from thralldom."},{"name":"MERLWYB","text":"Theirs is far from the only order, of course, and it will take no small amount of time and effort to reach the rest. But reach them we will, however long it takes."},{"name":"MERLWYB","text":"I would say that I was in your debt, but that has long been true. So instead, I will say thank you─for helping us to plot a new course not only for Limsa Lominsa, but all Eorzea."}],"reward":{"gil":2556},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69550]},"next":[69552]},"partials":[{"type":"npc","id":"1002694","obj":{"i":1002694,"n":"Merlwyb","l":351,"q":9}},{"type":"npc","id":"1035407","obj":{"i":1035407,"n":"Merlwyb","l":350,"q":1}},{"type":"quest","id":"69550","obj":{"i":69550,"n":"On Rough Seas","g":10,"l":"Lower La Noscea","s":400}},{"type":"quest","id":"69552","obj":{"i":69552,"n":"Futures Rewritten","g":10,"l":"Outer La Noscea","s":420}}]}