{"quest":{"name":"On Rough Seas","location":"Lower La Noscea","id":69550,"patch":5.4,"sort":400,"eventIcon":71201,"issuer":1035391,"target":1002694,"genre":10,"journal":["Alphinaud is keen to report back to the Admiral."],"objectives":["Speak with Merlwyb in the command room.","Speak with Merlwyb."],"dialogue":[{"name":"ALISAIE","text":"I don't know about you, but it was all I could do to stop myself punching Sicard in the smirking face whenever he opened his mouth."},{"name":"GRAHATIA","text":"Though I have some passing knowledge of prior events, I am yet ill qualified to meddle in Lominsan affairs. 'Twas not my place to argue with Sicard, much as I would have liked to."},{"name":"GRAHATIA","text":"Nay, it is for the Admiral to deal with him and the Bloody Executioners both. By bringing them to the negotiating table, we have played our part."},{"name":"ALPHINAUD","text":"I thought myself the hunter, but it turns out I was the prey... A timely reminder that the pirate powers of Limsa Lominsa are not to be trifled with."},{"name":"ALPHINAUD","text":"But all's well that ends well. G'raha Tia's timely provocation had the desired effect, and Sicard has agreed to a meeting. Let us hurry back to Limsa Lominsa and pass on his invitation to the Admiral."},{"name":"ALPHINAUD","text":"Sicard does not want for confidence, that much is plain, but I have faith in the Admiral. She has dealt with far worse."},{"name":"ALISAIE","text":"The <span class=\"emphasis\">Astalicia</span> is the very last place for such a meeting. The Admiral will be marching right into the coeurl's den. &lt;sigh&gt; I hope we don't end up regretting this..."},{"name":"GRAHATIA","text":"While we have no assurances Sicard will be amenable to reason, there can be no compromise without discussion."},{"name":"EYNZAHRSLAFYRSYN","text":"There you are. We have eagerly awaited your return."},{"name":"ZANTHAEL","text":"<span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\"><span class=\"highlight\">Forename</span></span></span>, your companions have already reported to the command room. Will you be joining them?"},{"name":"SYSTEM","text":"Proceed to the command room?"},{"name":"MERLWYB","text":"Welcome back, my friends. What news?"},{"name":"MERLWYB","text":"So they have been stealing crystals from the kobolds..."},{"name":"MERLWYB","text":"My thanks for solving the mystery, and securing a meeting besides."},{"name":"MERLWYB","text":"Suffice to say, I accept Sicard's invitation. And I would have you join me as my guests."},{"name":"MERLWYB","text":"The future of Limsa hangs upon the outcome of this meeting, and I would have the Scions present to bear witness."},{"name":"ALPHINAUD","text":"When the discussion gave way to a duel, I feared what might unfold. Yet only a fool would underestimate the Admiral─as Sicard soon discovered."},{"name":"ALISAIE","text":"While I don't condone what Sicard has been doing, I know how difficult it can be to change course. It took me long enough to join the Scions, didn't it."},{"name":"GRAHATIA","text":"There are times when one must stand one's ground, even if the cost of failure is beyond reckoning."},{"name":"GRAHATIA","text":"The Admiral did just that, and I have nothing but respect for her. As she continues to steer her nation through this period of transition, I pray the Navigator will see fit to fill her sails."},{"name":"EYNZAHRSLAFYRSYN","text":"Like Mistbeard before him, Hyllfyr chose to trust the future of our nation to the Admiral. That was the moment, I believe, that the good ship Limsa Lominsa finally embarked upon her new course."},{"name":"MERLWYB","text":"...Though I had anticipated a duel, I did not foresee that Hyllfyr would intervene."},{"name":"MERLWYB","text":"But full glad am I that he did. 'Twould have been a shame to kill the boy."},{"name":"MERLWYB","text":"Instead, the whelp has learned a valuable lesson, and we have made peace amongst ourselves. All that remains is to do likewise with our neighbors."}],"reward":{"items":[{"id":26728,"one":1},{"id":26729,"one":1},{"id":26730,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69549]},"next":[69551]},"partials":[{"type":"npc","id":"1035391","obj":{"i":1035391,"n":"Alphinaud","l":31,"q":2}},{"type":"npc","id":"1002694","obj":{"i":1002694,"n":"Merlwyb","l":351,"q":9}},{"type":"item","id":"26728","obj":{"i":26728,"n":"Heavens' Eye Materia VIII","l":420,"c":20279,"t":58,"materia":{"tier":7,"value":24,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"26729","obj":{"i":26729,"n":"Savage Aim Materia VIII","l":420,"c":20279,"t":58,"materia":{"tier":7,"value":24,"attr":"Critical Hit","category":0}}},{"type":"item","id":"26730","obj":{"i":26730,"n":"Savage Might Materia VIII","l":420,"c":20279,"t":58,"materia":{"tier":7,"value":24,"attr":"Determination","category":0}}},{"type":"quest","id":"69549","obj":{"i":69549,"n":"The Search for Sicard","g":10,"l":"Limsa Lominsa Lower Decks","s":390}},{"type":"quest","id":"69551","obj":{"i":69551,"n":"The Great Ship Vylbrand","g":10,"l":"Command Room","s":410}}]}