{"quest":{"name":"Tangle with a Tora","location":"Limsa Lominsa","id":69559,"patch":6.0,"sort":202,"icon":101042,"eventIcon":71221,"issuer":1035552,"target":1035552,"genre":194,"journal":["The tora bugyo is seeking a fellow feline fanatic.<br>※This quest is available for a limited time only.","A delegation led by the tora bugyo is come to share their Far Eastern customs during the Heavensturn festival. As he explains it, they plan to perform a special ceremony to ward off evil spirits from the land, but the rite requires the participation of one who calls said land home. You agree to lend a helping hand, and so they bid you make for middle La Noscea that you may assist in the spiritual rite by participating in the FATE “Tora Tora, Burning Bright” <br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","The ritual is a resounding success and the mighty tiger is vanquished by your hand. The tora bugyo will be most pleased to hear the land's foul spirits have been banished.","You feel a great satisfaction having completed your role in the ritual. Though your work is complete, you suspect the tora bugyo has more on his mind."],"objectives":["Complete the FATE “Tora Tora, Burning Bright” in middle La Noscea.","Report to the tora bugyo in Limsa Lominsa."],"dialogue":[{"name":"TIGGERMISSIONARY","text":"You there. Unless my eyes deceive me, you strike me as a <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">gent</span></span> that knows how to look after <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span>."},{"name":"TIGGERMISSIONARY","text":"An adventurer, you say? Oh, how fortuitous! Ah, but where are my manners─I am the tora bugyo and it is a pleasure to make your acquaintance. Might I ask a moment of your time?"},{"name":"TIGGERMISSIONARY","text":"You are far too kind. Allow me, in that case, to explain my current situation. I have made my way to Eorzea as part of a delegation sent from Hingashi to partake in the Heavensturn celebrations."},{"name":"TIGGERMISSIONARY","text":"I have been briefed that the Eorzeans believe that, at year's end, the gods choose one among their number to serve next as a herald of good fortune. In the Far East, it is not a god, but one of twelve great beasts that is chosen."},{"name":"TIGGERMISSIONARY","text":"And this year shall belong to the formidable tora! You may know it better as a “tiger” in these lands. Regardless, you doubtless now understand why I come dressed in my present attire."},{"name":"TIGGERMISSIONARY","text":"Now, allow me to proceed to the heart of the matter."},{"name":"TIGGERMISSIONARY","text":"Normally we celebrate auspicious events with a spot of mochi pounding. However, I think you'll agree such a meager celebration is hardly befitting of the mighty tora!"},{"name":"TIGGERMISSIONARY","text":"No, I have something much grander in mind and am currently searching for like-minded souls to help me. Frankly, a battle-hardened adventurer such as yourself would be perfect. Should you be willing to aid me, I shall see you rewarded with a kabuto of your own. What say you?"},{"name":"TIGGERMISSIONARY","text":"Oh, thank you kindly! Now—"},{"name":"EASTONMYOJI","text":"(-???-)Why, tora bugyo. I see you have found a willing assistant at last."},{"name":"TIGGERMISSIONARY","text":"Ah, your timing could not be better. Yes, this kind soul is willing to lend a much-needed hand."},{"name":"KOZOU","text":"Well, I must say <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> certainly looks the part!"},{"name":"KOZOU","text":"Would you not agree, Master? <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> is perfect for the ceremony."},{"name":"EASTONMYOJI","text":"Ahem. You may want to hear <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> opinion on the matter first─can't you see <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is positively bewildered at present?"},{"name":"EASTONMYOJI","text":"Ah, but allow me to clear up exactly who we are first. We are a clan of mages practiced in the ways of onmyodo, come to perform a ritual designed to quell evil forces."},{"name":"EASTONMYOJI","text":"It is nothing overly complex─we simply put on a performance that we hope will please the gods. The ritual this time has its origins in a rather old tale concerning a ferocious tiger."},{"name":"KOZOU","text":"We will use our powers to give life to the tiger adorning the folding screen we have brought with us. Then you, in your role as bloodthirsty warrior, shall vanquish the foul beast! ...Assuming you agree to participate, of course."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You bet. I slay tigers for breakfast!"},{"name":"A1","text":"Why do I have to take part in this again?"},{"name":"KOZOU","text":"I knew we could count on you the moment I saw you! Hardened adventurers never back down from a challenge, after all."},{"name":"KOZOU","text":"Tradition has long dictated that someone local to the area take part in the ritual. Only then is it guaranteed to be truly effective."},{"name":"KOZOU","text":"So I will ask once again: are you willing to lend us your aid?"},{"name":"EASTONMYOJI","text":"You have my sincerest thanks, kind adventurer. Now, if you will excuse us, we must ready the ritual site."},{"name":"TIGGERMISSIONARY","text":"If you would head to the site in middle La Noscea, southeast of the Zephyr Gate, I shall see to inviting spectators to the performance."},{"name":"TIGGERMISSIONARY","text":"The ritual is to be held in middle La Noscea. Pray go ahead. I will be along in due time."},{"name":"TIGGERMISSIONARY","text":"Ah, you are returned. Judging by your contented expression, I assume the ritual was a resounding success!"},{"name":"EASTONMYOJI","text":"I take it our friend here has delivered the good news?"},{"name":"KOZOU","text":"Truly, an astounding performance! It was as if I was gazing upon the great Tenzen himself."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Glad to be of service."},{"name":"A2","text":"Tenwho?"},{"name":"A2","text":"You flatter me."},{"name":"EASTONMYOJI","text":"And I am glad to see you are unharmed. Pray tell, are you familiar with a hero by the name of Tenzen?"},{"name":"EASTONMYOJI","text":"Tenzen is the hero that inspired the ritual we just performed."},{"name":"EASTONMYOJI","text":"You know of the Tale of Tenzen? Then you are more worldly than I gave you credit for."},{"name":"EASTONMYOJI","text":"The Tale of Tenzen is far and away the most well-known epic in the Far East. Our little performance just now was inspired by but a part of it."},{"name":"EASTONMYOJI","text":"Legend has it that upon stopping at a small village whilst on his travels, Tenzen encountered a starved, crazed tiger. Naturally, he made short work of the beast, thus saving the peasants from their plight."},{"name":"EASTONMYOJI","text":"Tales such as this tend to become somewhat exaggerated over time, and while I cannot account for their veracity, the importance of helping those in need is something that cannot be overstated."},{"name":"TIGGERMISSIONARY","text":"Allow me to extend our thanks to you once again for all you have done."},{"name":"TIGGERMISSIONARY","text":"As promised, this kabuto is yours to keep."},{"name":"EASTONMYOJI","text":"Thank you once again, noble adventurer. We intend to put on our peformance a few more times during Heavensturn. We should be glad for your assistance again if you are willing."}],"reward":{"items":[{"id":32804,"one":1},{"id":32805,"one":1}]},"reqs":{"jobs":[{"lvl":15,"id":1}]},"next":[69560]},"partials":[{"type":"npc","id":"1035552","obj":{"i":1035552,"n":"Tora Bugyo","l":28,"q":2}},{"type":"item","id":"32804","obj":{"i":32804,"n":"Golden Tora Kabuto","l":1,"c":41807,"t":34,"p":94}},{"type":"item","id":"32805","obj":{"i":32805,"n":"Silver Tora Kabuto","l":1,"c":41808,"t":34,"p":94}},{"type":"quest","id":"69560","obj":{"i":69560,"n":"Let Them Eat Cake","g":194,"l":"Limsa Lominsa","s":203,"r":1}}]}