{"quest":{"name":"Wish Upon a Starlight","location":"Gridania","id":69557,"patch":5.4,"sort":189,"icon":101035,"eventIcon":71221,"issuer":1035473,"target":1035473,"genre":204,"journal":["Amh Garanjy's passion for decking the town with Starlight decorations knows no bounds.<br>※This quest is available for a limited time only.","Thanks in no small part to your own efforts, preparations for the Starlight Celebration are proceeding apace, but there is still much that needs be done before the festivities can commence in earnest. As the next order of the day, Amh Garanjy would task her favorite helper with replenishing the supply of seasonal wreaths, which is already running dangerously short of demand. Speak with the chief celebrant's passionate colleague to see how you might serve to that end.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Ever in the spirit of the season, the celebrant joyfully informs you that one of her contacts at the Botanists' Guild has generously offered to donate an ample supply of wreaths to the cause. Make for the Botanists' Guild in her stead and procure the much-needed goods, that no doorway in Gridania might go unadorned this Starlight. ","Your botanist contact at the guild is clearly in a giving mood, as he happily provides you with all the wreaths you could ask for and then some. You strike off back to Greatloam Growery, confident that the celebrant will be overjoyed to see your most impressive haul.","As expected, the celebrant is beside herself with joy to see your mission a success, and a healthy supply of lovingly crafted Starlight wreaths ready to be distributed to the townspeople. Your rejoicing is interrupted, however, when you overhear the conversation of a mother and son passing by alluding to Isainne having troubles at home. Though the celebrant invites you to return to Amh Garanjy and claim another well-deserved gift from the twinklebox, you cannot help but be concerned about this news regarding your young friend...","Back at Mih Khetto's Amphitheatre, you pop another lid off the twinklebox and claim your present at Amh Garanjy's urging. Almost immediately, you are joined by Kamlito Halito, who seems to have taken his passion for snowman-building to still greater extremes, and shortly after that by none other than the Saint of Nymeia himself. After expressing his admiration for his young charge and the genuine passion with which he now pursues his Starlight preparations, he sheds light on the concerning situation surrounding Isainne. As he tells it, the girl's father is gravely ill, forcing the child to spend her days working to save up coin for a remedy─one so rare that it is all but impossible to come by even for those few who could afford it. As the saint and Kamlito muse as to what might be done to bring succor to Isainne's family, all of you agree that you must strive to do all that you can in the moment to see that the girl's Starlight is a truly special one."],"objectives":["Speak with the splendiferous Starlight celebrant.","Speak with the beneficent botanist.","Deliver the wreath to the splendiferous Starlight celebrant.","Report to Amh Garanjy and open the twinklebox."],"dialogue":[{"name":"KAMLITOHALITO","text":"Just you wait─my latest snowman is certain to be an artistic masterwork the likes of which Gridania has never seen! As soon as I finish it, that is..."},{"name":"AMHGARANJY","text":"Listen up, my favorite helper! It's time to bring some Starlight magic to the Greatloam Growery. Seek out my splendiferous colleague there─she'll be more than happy to share with you all you need to know."},{"name":"MOTHER04021","text":"The wreaths are all so lovely...whichever should I choose?"},{"name":"CHILD04021","text":"Ooh! I want the one with the bell! It makes such a pretty sound..."},{"name":"COMMITTEE04021","text":"Ah, it's you again! Your assistance is most welcome, friend. I've been handing out wreaths for the townsfolk to decorate their front doors, but it would seem our supply has fallen woefully behind the demand."},{"name":"COMMITTEE04021","text":"A most generous individual at the Botanists' Guild has agreed to donate some of their loveliest works to our cause. Might I trouble you to make the trip there and procure them for us?"},{"name":"BOTANIST4021","text":"Wreaths, you say? But of course! We've more than enough for one and all this Starlight. Pray take as many as you need with my blessing, and give the celebrants my best regards."},{"name":"BOTANIST4021","text":"A very merry Starlight to you! Nothing gives this humble botanist greater joy than to see the doors of every house in Gridania decked with verdant greenery."},{"name":"COMMITTEE04021","text":"Just look at all of these lovely wreaths! The growers at the Botanists' Guild are nothing if not generous. At any rate, this should more than suffice─thank you, friend!"},{"name":"CHILD04021","text":"Look! That adventurer's helping to get ready for Starlight! Isainne told me that she is, too. She says that every time she finishes a task, she gets a special present! I should have helped out, too..."},{"name":"MOTHER04021","text":"Isainne, you say? The poor child. I can't even imagine working so hard, what with all the hardships she now faces at home..."},{"name":"COMMITTEE04021","text":"Hardships, you say? What is it that troubles the girl, pray tell?"},{"name":"MOTHER04021","text":"I fear I'm not privy to all the details, but word has it her parents have not left the house in ages. Isainne's always running about town all on her own. She puts on a strong face, but I can't help but worry that she's suffering more than she lets on..."},{"name":"MOTHER04021","text":"It wasn't always like this, mind you. I remember often seeing the three of them together. Her father cut a tall, dashing figure, and always adorned his head with a stylish hat."},{"name":"MOTHER04021","text":"Her mother had the gentlest of smiles, and was always clad in garb of matching patterns that she fashioned herself. Seeing such a loving family walk the streets together was always such a heartwarming sight. Sadly, for whatever reason, it is a sight we see no longer..."},{"name":"COMMITTEE04021","text":"That is most troubling, indeed. Pray forgive me...I hadn't the slightest idea that anything was amiss when the girl came to offer her aid. I must have a chat with her..."},{"name":"COMMITTEE04021","text":"Ah, but a host of lovely wreaths have just arrived from our friends at the Botanists' Guild. Pray help yourself to whichever strikes your fancy!"},{"name":"COMMITTEE04021","text":"Ah, forgive me. Your work here is done. Pray return to Amh Garanjy and collect your reward─you've most certainly earned it!"},{"name":"COMMITTEE04021","text":"I had no idea that poor Isainne was enduring such troubles at home. I simply must have a talk with her to see if she's truly all right..."},{"name":"KAMLITOHALITO","text":"...Yes. The shape is perfect, if I do say so myself. All that remains is to decorate it!"},{"name":"AMHGARANJY","text":"Well, if it isn't my favorite helper! I thank you most sincerely for yet another job well done. Well, what are you waiting for? Help yourself to another present from the twinklebox!"},{"name":"KAMLITOHALITO","text":"Have the additional snowman decorations arrived yet, by chance? I'm most eager to get started on my latest masterwork."},{"name":"AMHGARANJY","text":"That's the spirit! And indeed, they were delivered not moments ago."},{"name":"KAMLITOHALITO","text":"Splendid! In that case, Isainne and I shall get to work at once."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Ho ho ho! That's the kind of good cheer I like to see. Yes, 'twould appear that the Starlight Celebration is in good hands again this year."},{"name":"GODBERT","text":"Ah, yes. Your colleague had mentioned some troubling news about young Isainne, so I took it upon myself to do some research into the matter."},{"name":"KAMLITOHALITO","text":"Whatever is the matter? Is the child okay?"},{"name":"GODBERT","text":"(-Saint of Nymeia-)The girl is fine, but I fear her dear father is less so. Stricken with a grievous malady, he lies bedridden, with Isainne's poor mother tending to him every waking moment of the day."},{"name":"KAMLITOHALITO","text":"That is most distressing, indeed. The poor girl...she never said as much, but doubtless she works as hard as she does in order to procure the medicine her dear father so desperately needs..."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Sadly, matters are not so simple. The illness her father suffers from, sadly, is a common one these days, and it is said demand for medicine greatly outstrips the supply."},{"name":"GODBERT","text":"No matter how diligently the girl works to earn the coin she needs, there is simply not enough of the remedy to go around..."},{"name":"AMHGARANJY","text":"Indeed. Though opening the twinklebox may light up her eyes, I can only imagine that what she truly wants for Starlight is to soothe her dear father's pain. If only there were some way we could help her do just that..."},{"name":"KAMLITOHALITO","text":"While there may be naught we can do to heal what ails the man, perhaps we might be able to offer Isainne and her family a bit of Starlight cheer in this trying time."},{"name":"KAMLITOHALITO","text":"The girl has been a most dutiful and generous little helper for us this season, has she not?"},{"name":"KAMLITOHALITO","text":"If we were to find some way to dedicate this year's Starlight Celebration to her and her loved ones─and in doing so make it the most spectacular success it's ever been─mayhap that might lift their spirits?"},{"name":"AMHGARANJY","text":"Dedicate the celebration to her? An admirable idea, I agree, but however might we do that?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Two words: stupendous snowman..."},{"name":"A1","text":"If Isainne's father is unable to rise from bed..."},{"name":"KAMLITOHALITO","text":"The child spoke of her wish to make a snowman of incredible size, you say? No wonder she took such an interest in my masterpieces!"},{"name":"KAMLITOHALITO","text":"The child said she wanted nothing more than to enjoy the Starlight festivities with her dear mother and father, you say? If only there were some way we could make that possible..."},{"name":"KAMLITOHALITO","text":"As for the medicine, let me contact my associates and see if there is aught that might be done."},{"name":"KAMLITOHALITO","text":"In the meantime, might I trouble you to see to the decoration of our final and most spectacular snowman? I am confident that you understand what would bring joy to Isainne's heart more than anyone."},{"name":"KAMLITOHALITO","text":"...Oh, but it would seem you've already collected all the twinklebox has to offer. Pray forgive my presumption. I suppose you'll be leaving us to return to far more important matters."},{"name":"KAMLITOHALITO","text":"'Tis not about the rewards, you say? Truly, you are the very embodiment of the Starlight spirit─a veritable incarnation of <span class=\"alternative-container\"><span class=\"alternative\">Nymeia Herself</span><span class=\"alternative\">the saint himself</span></span>."},{"name":"SYSTEM","text":"Another missive of thanks has arrived from one of your numerous admirers. Speak to Baenfaeld in Mih Khetto's Amphitheatre to see what it says."}],"reward":{"items":[{"num":99,"id":32861}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69556]},"next":[69558]},"partials":[{"type":"npc","id":"1035473","obj":{"i":1035473,"n":"Amh Garanjy","l":53,"q":6}},{"type":"item","id":"32861","obj":{"i":32861,"n":"Magicked Prism (Numeral 1)","l":1,"c":22632,"t":85,"p":10}},{"type":"quest","id":"69556","obj":{"i":69556,"n":"One Happy Family","g":204,"l":"Gridania","s":188}},{"type":"quest","id":"69558","obj":{"i":69558,"n":"Starlit Smiles","g":204,"l":"Gridania","s":190}}]}