{"quest":{"name":"The True Spirit of Starlight","location":"Gridania","id":69555,"patch":5.4,"sort":187,"icon":101035,"eventIcon":71221,"issuer":1035473,"target":1035473,"genre":204,"journal":["Amh Garanjy remains hard at work preparing for the Starlight Celebration of a lifetime.<br>※This quest is available for a limited time only.","No rest is to be had for the weary, as preparations for the annual Starlight Celebration proceed at a breakneck pace. Amh Garanjy welcomes your generous offer of continued aid, and bids you assist with the latest task: to wit, seeing the Starlight Tree─the most recognizable symbol of the event─is ready for the festivities. The head celebrant bids you speak to her colleague for all the details.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Amh Garanjy's ever-enthusiastic colleague informs you of a troubling matter regarding the Starlight Tree─it appears that someone or something has been gnawing away at its trunk, leaving it in danger of toppling over at an inopportune moment. At the celebrant's suggestion, make your way to the Carpenters' Guild to see if one of the artisans there might be able to lend their wisdom and talents to rectify the situation.","Upon arriving at the Carpenters' Guild, you have no trouble finding a willing and able woodworker, who happily agrees to work her magic to reinforce the tree trunk. Your task done, you prepare to report back to the celebrant, who is sure to be overjoyed with your efforts.","As predicted, Amh's colleague is overjoyed to hear your task was a resounding success, and the tree stands stronger than ever. Offering a few musings on Kamlito Halito and his seemingly newfound dedication to his work, she then bids you return to the amphitheatre and check to see how your colleague is faring.","Back in the amphitheatre, you come upon Kamlito Halito, who is in the midst of making a snowman for the festivities. As hinted at by the celebrant's words, it appears he is a changed man, his recent interaction with young Isainne having given him cause to reflect upon the true meaning of Starlight and his own role in the celebration.","Amh welcomes you back with a smile, pleased to see you have once again proven more than up to the task. She shares with you a few thoughts on the significance of the festival─a signficance that perhaps Kamlito Halito has finally come to understand as well─before inviting you to pop yet another of the lids off the twinklebox and claim your reward. There is much to be done before the festivities can be kicked off in earnest, however, meaning that your continued help will doubtless still be in high demand."],"objectives":["Speak with the splendiferous Starlight celebrant.","Speak with the capable carpenter.","Speak with the splendiferous Starlight celebrant.","Speak with Kamlito Halito.","Report to Amh Garanjy and open the twinklebox."],"dialogue":[{"name":"ISAINNE","text":"This poor snowman... He's all alone..."},{"name":"KAMLITOHALITO","text":"Perhaps I could stand to enjoy myself a bit more..."},{"name":"AMHGARANJY","text":"Thanks in no small part to your tireless efforts, I daresay we're on track to begin the festivities sooner than I had anticipated! That said, I fear there's still more work to be done."},{"name":"KAMLITOHALITO","text":"&lt;sigh&gt; If only I weren't so utterly useless..."},{"name":"AMHGARANJY","text":"Hm? Did you say something, Kamlito?"},{"name":"KAMLITOHALITO","text":"M-Me!? Oh, it was nothing! Nothing at all!"},{"name":"AMHGARANJY","text":"At any rate, the next job I'd like to entrust to you is preparing the tree. Speak to my colleague in the Acorn Orchard over in New Gridania, and she'll be happy to brief you on the task at hand."},{"name":"KAMLITOHALITO","text":"I can't see anything amiss with the decorations here. Whatever could be the matter?"},{"name":"COMMITTEE04019","text":"Are you here to help? Remarkable! Splendiferous, even! I've just been inspecting the trees that have been put up around town, and I couldn't help but notice that something was amiss."},{"name":"COMMITTEE04019","text":"See here? Part of the trunk has been gnawed away, as if by an animal or the like. Were any more damage to be done to the tree, it might fall over, and that would be most perilous for any small child who happened to be standing beneath it at the time."},{"name":"COMMITTEE04019","text":"I had a mind to call for a skilled woodworker, that perhaps they might examine the tree and reinforce it for us. Might I ask you to head to the Carpenters' Guild in my stead?"},{"name":"KAMLITOHALITO","text":"This adventurer will be going, you say? I suppose that means you won't be needing me. Very well, then... I shall...inspect the other trees, or the like."},{"name":"KAMLITOHALITO","text":"No damage here as far as I can see. &lt;sigh&gt; If this is the only job I am good for, I might as well be thorough about it..."},{"name":"CARPENTER4019","text":"Ho there! What brings you to the Carpenters' Guild during this season of celebration, friend?"},{"name":"CARPENTER4019","text":"Some cute little woodland creatures have been chewing away at your Starlight Tree, you say? Well, that won't do at all. I daresay this calls for an investigation."},{"name":"CARPENTER4019","text":"Indeed...this tree looks as if it could topple over at any moment. Let me see if I can't reinforce the trunk a bit."},{"name":"COMMITTEE04019","text":"I cannot thank you enough, my friend! Clearly, you have summoned a carpenter of surpassing skill. I am most relieved to know that the children of Gridania need not fear any falling trees as they open their presents this Starlight season."},{"name":"COMMITTEE04019","text":"Ah, yes─I forgot to tell you. While you were visiting the guild on my behalf, Kamlito Halito was kind enough to go about inspecting the other trees in the area. I'm pleased to report that he assures me that not a one shows any suspicious gnawing or toothmarks."},{"name":"COMMITTEE04019","text":"He's a rather...dour fellow, isn't he? And yet it would seem he takes his work quite seriously. I daresay I was rather impressed at how closely he examined each and every trunk with such a painstaking eye."},{"name":"COMMITTEE04019","text":"He mentioned that he was heading back to the amphitheatre after finishing the job. Why, he didn't even stick around long enough to allow me to thank him for his efforts. Might you be so kind as to pass along a simple message of gratitude on my behalf?"},{"name":"AMHGARANJY","text":"Looking for Kamlito, you say? I haven't seen him since he went off to inspect the trees. Do you suppose he's slacking off on the job again?"},{"name":"KAMLITOHALITO","text":"I can't help but feel that something is missing. And yet...what could it be?"},{"name":"SYSTEM","text":"Kamlito Halito is staring so intently at the snowman that it seems he might burn a hole clear through its body."},{"name":"KAMLITOHALITO","text":"I know! Mayhap a necklace of the finest gold with a sparkling gem inlaid would give it a glamorous appearance befitting the season!"},{"name":"KAMLITOHALITO","text":"But no...<span class=\"emphasis\">I</span> might appreciate that, but I am not a child of Gridania. I must put myself in their shoes...whatever sort of snowman would bring a smile to their faces?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Is something amiss?"},{"name":"A1","text":"Are you still thinking about what Isainne said?"},{"name":"KAMLITOHALITO","text":"Hm? Oh, it's you. No, there is nothing amiss, per se. I simply had occasion to return here, and I was wondering if there was not something I could do to further improve upon my most inspired creation."},{"name":"KAMLITOHALITO","text":"Hm? Of course not! I could not care less about the idle musings of children. I simply thought that perhaps my masterwork here could benefit from a finishing touch, that's all!"},{"name":"KAMLITOHALITO","text":"...Bah. Who am I fooling? It's true. I haven't stopped thinking about what the girl said for bells now."},{"name":"KAMLITOHALITO","text":"Here I thought I would come here and put together a festival for the ages─and as it turns out, I can't even make a single child happy. Hells, I'm only making myself miserable as well."},{"name":"KAMLITOHALITO","text":"And yet...I must not give up hope. There is still time for me to do my job right─to earn the right to open that chest of presents and claim the glory that is rightfully mine!"},{"name":"KAMLITOHALITO","text":"...And so I got to thinking. That child was looking at this snowman with a most intense gaze, was she not? No doubt she saw something in it that has managed to escape me."},{"name":"KAMLITOHALITO","text":"...Forgive me. I suspect my work here might take longer than I expected. Pray report to Amh Garanjy ahead of me and tell her I shall be along in due time."},{"name":"AMHGARANJY","text":"Welcome back, friend! And another job well done, I am pleased to say."},{"name":"AMHGARANJY","text":"Well, what are you waiting for? Help yourself! You've more than earned it."},{"name":"AMHGARANJY","text":"Hm? Kamlito's still putting the finishing touches on his snowman, you say? Dare I dream that he's come to understand the true spirit of Starlight at last?"},{"name":"AMHGARANJY","text":"For indeed, this season isn't just about gaudy lights, toys, and trinkets. If every last child is not able to find something of joy here, we have not done our duty. And to make that possible, we must first find a reason to rejoice for ourselves."},{"name":"AMHGARANJY","text":"Our smiles light up the faces of the children, who in turn warm our hearts yet further, allowing us to further spread happiness across the realm."},{"name":"AMHGARANJY","text":"It is that cycle of giving and receiving, that ever-expanding circle of peace and joy that embodies the true soul of the Starlight season."},{"name":"AMHGARANJY","text":"So take your present proudly, my friend. Let it fill your heart with pure satisfaction, that you might have happiness aplenty to share with your fellow adventurers─and indeed, Eorzeans the realm over!"},{"name":"SYSTEM","text":"Another thank-you letter has arrived from one of your admirers. Speak to Baenfaeld in Mih Khetto's Amphitheatre to see what it says."}],"reward":{"items":[{"num":99,"id":32863}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69554]},"next":[69556]},"partials":[{"type":"npc","id":"1035473","obj":{"i":1035473,"n":"Amh Garanjy","l":53,"q":6}},{"type":"item","id":"32863","obj":{"i":32863,"n":"Magicked Prism (Numeral 3)","l":1,"c":22632,"t":85,"p":10}},{"type":"quest","id":"69554","obj":{"i":69554,"n":"Starlight Slapdashery","g":204,"l":"Gridania","s":186}},{"type":"quest","id":"69556","obj":{"i":69556,"n":"One Happy Family","g":204,"l":"Gridania","s":188}}]}