{"quest":{"name":"One Happy Family","location":"Gridania","id":69556,"patch":5.4,"sort":188,"icon":101035,"eventIcon":71221,"issuer":1035473,"target":1035473,"genre":204,"journal":["Amh Garanjy is determined to make miracles happen this Starlight season.<br>※This quest is available for a limited time only.","Amh Garanjy welcomes you back, eager to accept your aid in continuing the preparations for the impending Starlight Celebration. Your task, if you choose to accept it: help ensure that the delightfully decorative snowmen adorning the town stay intact until the season has come and gone. You strike off to hear the details of the task from the less animated of the chief celebrant's associates.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","Subdued in manner yet nonetheless grateful for your aid, the celebrant outfits you with a shard of the miraculous substance known as eternal ice, the arcane contrivance which gives the snowmen their remarkable staying power. Bidding you to attend to the snowmen on the way to the manor district to the north, he sets off with young Isainne to see to the remaining ones.","The eternal ice shard now safely housed inside the snowman's breast, you rest easy that it will not melt away too soon and break some poor child's heart. Return to the vicinity of the Lancers' Guild, that you might inform the celebrant that your task is complete.","Back at the Lancers' Guild, the celebrant thanks you for your efforts before heading off to see to yet another stage in the preparations. You share a moment with Isainne, who laments that─for reasons she seems hesitant to divulge in detail─her dear mother and father will be unable to join her for Starlight this year. As she rushes off to tackle her next task, your mind inexplicably turns to your colleague Kamlito Halito. Head back to the amphitheatre and see whether or not the spirit of the season has truly taken hold in the young man's heart.","Back at the amphitheatre, you come upon an uncharacteristically unenthusiastic Kamlito Halito hard at work building snowmen, with Isainne cheerfully encouraging him alongside. When the girl suggests that the snowmen would appreciate having some friends, the now-motivated youth is more than happy to oblige, and asks that you go on ahead and report to Amh Garanjy, that he might remain behind until the job is done to his satisfaction.","You return to Amh Garanjy, who is once more encouraged by the thoroughness with which you have completed your tasks, as well as with Kamlito Halito's change of heart. Confident that there are still more miracles to be had this Starlight, all present resolve to redouble their efforts to see that no child goes unsmiling this season."],"objectives":["Speak with the saturnine Starlight celebrant.","Use the fragment of eternal ice on the scintillating snowmen.","Speak with the saturnine Starlight celebrant.","Speak with Kamlito Halito.","Report to Amh Garanjy and open the twinklebox."],"dialogue":[{"name":"KAMLITOHALITO","text":"There is more I would consider before returning to my duties. Pray go on ahead for the time being."},{"name":"AMHGARANJY","text":"Starlight waits for no one! Without further ado, I would entrust you with the next most vital task in preparing for the festivities. Simply speak to my colleague stationed past Apkallu Falls on the way to the residential district to the north."},{"name":"ISAINNE","text":"I always wondered why the snowmen never melted, and now I know! Being able to see behind the magic of Starlight is a miracle in itself!"},{"name":"COMMITTEE04020","text":"Back to offer your aid? Well, I suppose we could put you to use. Perhaps you've seen the snowmen around the area? Well, the truth is, we employ a little bit of sorcery to make sure they don't go melting in the event of untimely warm weather."},{"name":"COMMITTEE04020","text":"To that end, I'd task you with stuffing one of these here fragments of what we call eternal ice inside each one of them. If you could see to the ones near the manor district north of here, Isainne and I will take care of those by the Lancers' Guild. Pray meet us there when you're done."},{"name":"AMHGARANJY","text":"Why, just think of how devastated the children would be if those charming snowmen melted into nothing before Starlight was over! You're doing the saint's own work, my friend."},{"name":"COMMITTEE04020","text":"How goes the task? Once you've seen to the snowmen near the manor district, return here that I might know your work is done."},{"name":"ISAINNE","text":"Don't worry, Mister Snowman! I'll see that you stay with us till the very end!"},{"name":"COMMITTEE04020","text":"...And with that, I do believe our job is done."},{"name":"ISAINNE","text":"Hooray!"},{"name":"COMMITTEE04020","text":"I trust you've seen to your snowmen as well? Excellent. I'll survey the area one last time to make sure we haven't overlooked anything, so pray go on ahead of me and report back to Amh Garanjy."},{"name":"ISAINNE","text":"Say, <span class=\"alternative-container\"><span class=\"alternative\">Missus</span><span class=\"alternative\">Mister</span></span> Adventurer...is there a special someone you'll be spending Starlight season with this year?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I have someone in mind."},{"name":"A1","text":"I'm not the celebrating type..."},{"name":"ISAINNE","text":"Oh, is that so? Then we'd best make the decorations extra pretty just for them, yes?"},{"name":"ISAINNE","text":"Oh, that's a shame. Well, I guess Starlight's more for children like me, after all..."},{"name":"ISAINNE","text":"I always used to come with Mother and Father, but they...um, are busy this year. That's why I decided to make myself useful and help out with the preparations."},{"name":"ISAINNE","text":"I had a mind to make a giant snowman, just for them, that we could all come see together! But I think they'll need to stay at home, so... Well, I guess it doesn't matter anymore..."},{"name":"ISAINNE","text":"Oh, but I should get back to work! See you around, <span class=\"alternative-container\"><span class=\"alternative\">Missus</span><span class=\"alternative\">Mister</span></span> Adventurer!"},{"name":"SYSTEM","text":"As Isainne races off, your mind drifts to Kamlito Halito, who you believe you last saw at Mih Khetto's Amphitheatre. How does he fare with his allotted task?"},{"name":"AMHGARANJY","text":"Looking for Kamlito, you say? I last saw him examining the snowmen around Mih Khetto's Amphitheatre. Now that you mention it, I'd be much obliged if you could check in on him. Sometimes I worry the boy is too serious for his own good."},{"name":"ISAINNE","text":"Wow, just look at all of them!"},{"name":"KAMLITOHALITO","text":"Wh-Why, hello there, Isainne. I was just putting together another snowman of my own. What do you think...have I redeemed myself?"},{"name":"ISAINNE","text":"Oh, it's wonderful! I was just thinking how this snowman looked so lonely, and now he has a friend! Let's make one more!"},{"name":"KAMLITOHALITO","text":"Yet <span class=\"emphasis\">another</span>, you say!?"},{"name":"KAMLITOHALITO","text":"Indeed...I suppose we've nothing better to do until the next delivery of ornaments arrives. Very well, then─to work!"},{"name":"KAMLITOHALITO","text":"Well, it appears I'll be occupied for a while here, yet. You've completed your task, yes? If you would be so kind, I would ask that you report to Amh Garanjy for the both of us."},{"name":"ISAINNE","text":"The more, the merrier! Let's make another!"},{"name":"AMHGARANJY","text":"Another task completed? And in spectacular fashion, I have no doubt! Just think of how many smiles you've put on the children's faces today. Take your reward, friend─I daresay you've earned it."},{"name":"KAMLITOHALITO","text":"If it would not be too much to ask, we are in need of more snowman decorations. I have─ahem─made an <span class=\"emphasis\">executive decision</span> to build one more."},{"name":"AMHGARANJY","text":"With pleasure! I shall see that the necessary supplies are procured straight away!"},{"name":"AMHGARANJY","text":"That said, color me surprised, Kamlito. Could it be that you've finally gotten into the spirit of the season after all?"},{"name":"KAMLITOHALITO","text":"Heh. One could say that, I suppose..."},{"name":"KAMLITOHALITO","text":"At first, I simply saw all this decorating as menial labor─trifling tasks far beneath one of my station."},{"name":"KAMLITOHALITO","text":"And yet, seeing the twinkle in young Isainne's eyes every time I make a snowman or hang up a glittering star, I began to sense that I was part of something far larger than I had ever imagined. Before long, I realized the truth─that every one of my actions, no matter how humble, were indispensable in bringing good cheer to the hearts of the children in this realm."},{"name":"KAMLITOHALITO","text":"And, perhaps more importantly, that such acts were diminished if performed without similar sentiments in my own heart. Yet I fear that in realizing this, I have been consumed by the sheer responsibility of these tasks, to the point that I feel almost petrified with a desire to get everything <span class=\"emphasis\">just</span> right..."},{"name":"AMHGARANJY","text":"Ohoho! Worry not, my friend. There's still plenty of time to polish your creations to perfection before the festivities kick off in earnest. So long as you've got that Starlight spirit in you, you're more than fine in my book!"},{"name":"AMHGARANJY","text":"At any rate, our job is almost done─but that's all the more reason we can't afford to slack off or compromise until we've seen to the last of the preparations. The children are counting on us, my friends!"},{"name":"SYSTEM","text":"Another thank-you letter has arrived from one of your many admirers. Speak to Baenfaeld in Mih Khetto's Amphitheatre to see what it says."}],"reward":{"items":[{"num":99,"id":32862}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69555]},"next":[69557]},"partials":[{"type":"npc","id":"1035473","obj":{"i":1035473,"n":"Amh Garanjy","l":53,"q":6}},{"type":"item","id":"32862","obj":{"i":32862,"n":"Magicked Prism (Numeral 2)","l":1,"c":22632,"t":85,"p":10}},{"type":"quest","id":"69555","obj":{"i":69555,"n":"The True Spirit of Starlight","g":204,"l":"Gridania","s":187}},{"type":"quest","id":"69557","obj":{"i":69557,"n":"Wish Upon a Starlight","g":204,"l":"Gridania","s":189}}]}