{"quest":{"name":"Starlit Smiles","location":"Gridania","id":69558,"patch":5.4,"sort":190,"icon":101036,"eventIcon":71221,"issuer":1035473,"target":1035502,"genre":204,"journal":["Amh Garanjy is putting the finishing touches on what promises to be a Starlight Celebration for the ages.<br>※This quest is available for a limited time only.","With preparations for the Starlight Celebration all but completed, the time is nigh for your final task─fashioning a decoration that will serve as a personal gift to your fellow helper Isainne in her time of greatest need. Amh Garanjy encourages you to reflect on all you have learned about your young friend and what she wants most this season, and to let inspiration carry you where it will. Giving deep thought to the matter, you set out to make one child's Starlight dreams come true.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","After a good time spent meticulously packing and re-packing snow and experimenting with assorted articles of garb, you manage to achieve what you were striving for─a delightful recreation of Isainne and her beloved parents in snowman form. Stepping back to admire your work, you make a wish in your heart that it brings even the faintest of smiles to your young friend's face.","You return to Mih Khetto's Amphitheatre, where you are greeted by your friends and colleagues. Amh Garanjy, Kamlito Halito, and no lesser a personage than the Saint of Nymeia himself lavish praise upon you for your most inspired work, and Isainne is nigh moved to tears at your most touching gesture. The saint further brightens the mood with the news that they were able to procure sufficient quantities of the remedy, meaning that Isainne's father might be cured of his dreadful malady at last, allowing them to celebrate the season as a family after all. What began with a worry that the festivities might be called off entirely has ended with a Starlight miracle for the ages. Happy to have played your part to see smiles come to the realm once more, you bid a fond farewell to your companions and set out to enjoy the season in your own way."],"objectives":["Decorate the snowmen.","Report to Amh Garanjy."],"dialogue":[{"name":"AMHGARANJY","text":"At long last, our preparations have almost come to an end. All that remains is to put the finishing touches on the mother of all snowmen and give our dear little Isainne a Starlight present she'll remember for a lifetime!"},{"name":"AMHGARANJY","text":"And with that, shall we be on our way? I'm ready if you are."},{"name":"AMHGARANJY","text":"Now, let's get to work, shall we? I've prepared an assortment of decorative materials for the occasion, so feel free to let your imagination run wild!"},{"name":"AMHGARANJY","text":"That said, we mustn't forget who our audience is. What sort of snowman do you suppose would most warm little Isainne's heart?"},{"name":"AMHGARANJY","text":"Ah, yes....you were saying how concerned she was that the smaller snowman might be lonely, yes? And how happy she was when he got a friend?"},{"name":"AMHGARANJY","text":"Perhaps there's a hint to be had there. What sort of decoration would make Isainne happiest of all? Give it some thought, and I've no doubt you'll be struck with inspiration!"},{"name":"SYSTEM","text":"Reflect on all you've learned and decorate the snowman as best you can to delight your fellow helper."},{"name":"SYSTEM","text":"As the townspeople tell it, Isainne's father is the tall, dashing type, and rarely seen without his favorite hat."},{"name":"SYSTEM","text":"Her mother, on the other hand, was known to prefer wearing matching patterns."},{"name":"SYSTEM","text":"Now fully decorated, the three snowmen appear as if they were a family. Just looking at them warms your heart, and you can only hope Isainne feels the same. Return to Amh Garanjy and let her know your task is done."},{"name":"AMHGARANJY","text":"You've truly outdone yourself, my friend─this is nothing short of a masterpiece. I've no doubt Isainne will be overjoyed at the sight of your little snowman family."},{"name":"KAMLITOHALITO","text":"Marvelous! Simply marvelous! While I am partial to my own creations, I can do nothing but tip my cap to your superior aesthetic sensibilities."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Ho ho! I have seen many a snowman in my day, but never one that warms the cockles of my heart quite so much as your merry little snowman family. Truly, you are a snowman artisan of the highest order!"},{"name":"ISAINNE","text":"Look! The snowman has a mommy and a daddy! Why, it's just like a family─<span class=\"emphasis\">our</span> family! Oh, how happy she must be!"},{"name":"ISAINNE","text":"Did you make this, Kamlito?"},{"name":"KAMLITOHALITO","text":"I only helped here and there─<span class=\"highlight\">Forename</span> deserves all the credit. How do you like it, Isainne? I daresay the little snowman isn't lonely anymore."},{"name":"ISAINNE","text":"Oh, yes! Now that I know she's not alone, I can leave her to enjoy Starlight with her family while I return home to my own!"},{"name":"ISAINNE","text":"I'm sorry for making you do all this for me when you were already so busy yourself. Can you forgive me?"},{"name":"KAMLITOHALITO","text":"I am the one who should be asking for forgiveness, my child. After all, it is you who taught this stuffy, overly serious fool what the true meaning of Starlight was all about."},{"name":"ISAINNE","text":"I may not be able to stay for the celebration, but this has already been the best Starlight ever! Thank you so much for letting me help. I'll treasure the presents from the twinklebox forever!"},{"name":"GODBERT","text":"(-Saint of Nymeia-)Ahem. Kamlito, if you would...?"},{"name":"KAMLITOHALITO","text":"...But of course. Those presents were simply to show our appreciation for your help. Of course, we have another present─and this one's just for you."},{"name":"KAMLITOHALITO","text":"Or perhaps I should say...for your dear father."},{"name":"ISAINNE","text":"Could...could it be─!?"},{"name":"KAMLITOHALITO","text":"As it so happens, God─er, <span class=\"emphasis\">the Saint of Nymeia</span> here happens to be a patron of the apothecary that produces this medicine. When he shared your story with the proprietor, they simply insisted that we deliver this to you straight away."},{"name":"KAMLITOHALITO","text":"What's more, they have at long last discovered a means by which they can produce the remedy in vast quantities. Rest assured that all those who are suffering as your father is will have succor soon enough."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Speaking of your father, my child, I took the liberty of delivering the first dose to him in person. From the looks of it, it would seem you may well be able to enjoy the celebration after all─and I daresay that your dear father may even be feeling well enough to join you."},{"name":"ISAINNE","text":"T-Truly...!?"},{"name":"AMHGARANJY","text":"A medicine that not even all the money in the realm can buy... It truly is a Starlight miracle!"},{"name":"KAMLITOHALITO","text":"Yes, this season has taught me much. Coin is but a means to an end─not a goal in and of itself. If it is not used to bring a smile to those who need it most, it has little more value than a lump of coal."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Ho ho! I daresay you've come far in this short time, Kamlito. Your father will be most proud to hear of this, I'm sure. Yes, you will prove a worthy successor to him, I am sure."},{"name":"KAMLITOHALITO","text":"About that, Lord Ma─er, good Saint, sir...I've decided not to take over Father's business after all."},{"name":"KAMLITOHALITO","text":"It surprised me as well. Over the course of preparing for Starlight, I could feel my heart changing─now, I am as certain of it as anything. When I return to Ul'dah, I mean to devote my efforts to doing all in my power to alleviate the plight of those who were not blessed with my privileges."},{"name":"GODBERT","text":"(-Saint of Nymeia-)Oho...I misjudged you, my boy. You have matured far, far beyond even my wildest expectations. So much so, in fact, that I daresay your father will have a stern word or two for me..."},{"name":"KAMLITOHALITO","text":"At any rate, I am not returning anywhere until I've celebrated Starlight to the fullest with the children of Gridania─Isainne here first among them, of course!"},{"name":"AMHGARANJY","text":"That's the spirit! And with that, I can finally present you and <span class=\"highlight\">Forename</span> with the greatest gift of all─the one I've been waiting to give to you from the start..."},{"name":"KAMLITOHALITO","text":"Let me hazard a guess─the smiles of the little ones, yes?"},{"name":"AMHGARANJY","text":"Ahaha! Clearly, the Starlight spirit has taken hold in your heart now."},{"name":"AMHGARANJY","text":"And with that, the moment we've been waiting for is finally at hand. Without further ado...let the festivities begin!"},{"name":"SYSTEM","text":"Another missive of thanks has arrived from one of your numerous admirers. Speak to Baenfaeld in Mih Khetto's Amphitheatre to see what it says."},{"name":"Q1","text":"How will you dress the snowman?"},{"name":"A1","text":"Place a red knit hat on its head."},{"name":"A1","text":"Place a black silk hat on its head."},{"name":"A1","text":"Drape a green scarf around its neck."},{"name":"A1","text":"Drape a red scarf around its neck."},{"name":"A1","text":"Do nothing."}],"reward":{"items":[{"num":99,"id":32860},{"id":32837}]},"reqs":{"jobs":[{"lvl":15,"id":1}],"quests":[69557]}},"partials":[{"type":"npc","id":"1035473","obj":{"i":1035473,"n":"Amh Garanjy","l":53,"q":6}},{"type":"npc","id":"1035502","obj":{"i":1035502,"n":"Amh Garanjy","l":53,"q":1}},{"type":"item","id":"32860","obj":{"i":32860,"n":"Magicked Prism (Numeral 0)","l":1,"c":22632,"t":85,"p":10}},{"type":"item","id":"32837","obj":{"i":32837,"n":"Snowman Bell","l":1,"c":26104,"t":63}},{"type":"quest","id":"69557","obj":{"i":69557,"n":"Wish Upon a Starlight","g":204,"l":"Gridania","s":189}}]}