{"quest":{"name":"Futures Rewritten","location":"Outer La Noscea","id":69552,"patch":5.4,"sort":420,"icon":101040,"eventIcon":71201,"issuer":1035398,"target":1032694,"genre":10,"journal":["Alphinaud's face is a picture, equal parts jubilation and relief.","Just as you are about to return to the Rising Stones, a breathless Maelstrom officer rushes up and begs the Admiral to follow him. He duly leads you to the cliffs opposite the Floating City of Nym, where you espy a strange tower which─he claims─was not there when he began his daily patrol. But it is only when the Admiral subsequently receives a linkpearl communication from Maelstrom headquarters that the scale of the problem becomes clear. It seems that many more such structures─apparently of Garlean design─have materialized across the realm. Anticipating trouble, Merlwyb bids you join the Alliance forces on the eastern front, and you set forth for the Ala Mhigan Quarter to offer Commander Hext your support.","Lyse has scarcely finished welcoming you when an enormous dragon passes overhead, seemingly bound for the palace. Giving chase, you emerge in the Royal Menagerie, where you come face-to-face with Asahi...or rather an Ascian in his body. With a self-indulgent flourish, your foe introduces himself as Fandaniel, and declares his intent to destroy the world in a recreation of the Final Days, in which the towers will play some unspecified part. When you move to apprehend him, his dragon─the so-called “Lunar Bahamut”─sets the rooftop garden ablaze, allowing the Ascian to take his leave─but not before informing you that his patron, Lord Zenos, awaits you at the heart of the chaos...","The mood is subdued as you reassemble before the Royal Palace. With little information upon which to act, Lyse proposes sending a unit to investigate the nearby tower, and at Raubahn's insistence, you decide to return to the Rising Stones to recuperate while awaiting further developments.","You arrive at the Rising Stones to find Y'shtola returned, and exchange news of your recent endeavors. It seems that after recovering her strength, Y'shtola delivered the first litter of porxies to the Immortal Flames in Ul'dah, while Krile investigated reports that towers had been sighted not only across Eorzea, but in Yanxia in the Far East. When thoughts subsequently turn to the new draconic foe you face in Lunar Bahamut, Krile and Tataru declare their intention to seek the aid of Estinien, leaving you and the others to take what rest you can. Though it feels like your efforts to bring lasting peace to Eorzea have been overshadowed, you know that the future of the star is yet unwritten, and that you and your comrades will stop at nothing to protect it."],"objectives":["Speak with Lyse in the Ala Mhigan Quarter.","Speak with Lyse.","Speak with Krile at the Rising Stones."],"dialogue":[{"name":"MERLWYB","text":"Savor the moment, <span class=\"alternative-container\"><span class=\"alternative\">girl</span><span class=\"alternative\">lad</span></span>. Your next task can wait."},{"name":"GABU","text":"If I could befriend you all, then surely other kobolds can befriend men too. And I'll do everything I can to help them. Facilitate, assist, help."},{"name":"ALISAIE","text":"Ga Bu is wise beyond his years. It's all very well leaders signing peace treaties, but it falls to individuals to bridge the gap."},{"name":"GRAHATIA","text":"I daresay we could all do with a rest, Alisaie not least of all, given the amount of aether she has been expending of late."},{"name":"EYNZAHRSLAFYRSYN","text":"Judging by the...&lt;grunt&gt;...complaints my back is making, I may have overreached myself. Ah, the ravages of old age..."},{"name":"STORMOFFICER","text":"Don't worry, <span class=\"alternative-container\"><span class=\"alternative\">[GC Rank]</span><span class=\"alternative\"> <span class=\"highlight\">Surname</span></span><span class=\"alternative\">miss</span><span class=\"alternative\">sir</span></span>─I'll keep watch over the tower. Your place is in Ala Mhigo."},{"name":"ALPHINAUD","text":"It appears to be business as usual inside the city, but Lyse will be able to tell us if there have been any developments without."},{"name":"ALISAIE","text":"...Ga Bu? Don't worry. He's with our Maelstrom friends. Meaning we're free to deal with the latest problem to fall uninvited into our laps... &lt;sigh&gt;"},{"name":"GRAHATIA","text":"Though it isn't visible from here, the locals report that a tower-like structure has appeared to the south."},{"name":"ALPHINAUD","text":"Though our objectives were different, I could understand why Elidibus and his fellows acted as they did. But Fandaniel?"},{"name":"ALPHINAUD","text":"It will take me some time to make sense of it all...if indeed there is any sense to be found."},{"name":"ALISAIE","text":"Are you all right, <span class=\"highlight\">Forename</span>? The rest of us are fine if a little singed."},{"name":"ALISAIE","text":"That dragon let us off lightly. Honestly, though─only a <span class=\"emphasis\">madman</span> would choose the name “Lunar Bahamut.” Which just about sums up Fandaniel, I suppose..."},{"name":"GRAHATIA","text":"What part could these towers feasibly play in the Telophoroi's plans, do you think?"},{"name":"GRAHATIA","text":"I for one am at a loss. For now, we should bear word of these developments to the others. I only hope Thancred and Urianger are safe."},{"name":"RAUBAHN","text":"Our scouts report that the Ascian and his dragon have left Gyr Abania. It seems this was purely a social visit."},{"name":"LYSE","text":"Thank goodness everyone's safe... We've managed to put out the fire, though not quickly enough to save the garden."},{"name":"LYSE","text":"Raubahn─can I leave it to you to send word to the Alliance?"},{"name":"LYSE","text":"I'm going to take a unit and investigate the tower. We need to find out what it's for."},{"name":"ALISAIE","text":"We'll go with you."},{"name":"RAUBAHN","text":"No you won't. You'll rest. From what Merlwyb tells me, you're due some time off duty."},{"name":"RAUBAHN","text":"Should we learn anything about the tower, we'll be sure to share it with you. Until then, I want you to rest."},{"name":"ALISAIE","text":"...Very well. But if you need our help, don't hesitate. And take care. Both of you."},{"name":"RAUBAHN","text":"If an Ascian is on the prowl, it will not be long before we call on you and yours again. Rest now, while you still can."},{"name":"LYSE","text":"So you really did it─you found a cure for tempering! Oh, it makes me want to do something heroic, <span class=\"emphasis\">right now</span>! Speaking of which, I'd better get ready and set out for the tower!"},{"name":"ALPHINAUD","text":"Ah, how good it feels to come home to the Rising Stones. It's here my heart feels most at peace, and my mind the clearest."},{"name":"ALISAIE","text":"Y'shtola returned just before us. And it seems she knows about the towers too."},{"name":"GRAHATIA","text":"Though my new...or rather old...by which I mean young... Ahem. Though <span class=\"emphasis\">this</span> body has a good deal more stamina than the one I wore out in the First, I confess I've been looking forward to a moment's respite. We've had a busy few days, have we not?"},{"name":"YSHTOLA","text":"It would seem you have had quite an eventful time in my absence. But I am fully rested now and ready for more."},{"name":"TATARU","text":"Welcome back, <span class=\"highlight\">Forename</span>! Make yourself comfortable, and let me know if I can get you anything."},{"name":"KRILE","text":"Ah, you're back too. Good. We've received the reports from the Alliance."},{"name":"KRILE","text":"Since we are all here, perhaps those who bore witness to the events in Ala Mhigo could treat the rest of us to a firsthand account?"},{"name":"YSHTOLA","text":"No sooner do we overcome one problem than another appears. It would all seem tediously predictable but for the endless variety of our foes. This Fandaniel sounds even more unhinged than his patron."},{"name":"ALPHINAUD","text":"Unhinged, perhaps, but no fool. For all his pantomime theatrics, he gave away little about his plot. We know only that he intends to recreate the Final Days, and that the towers will somehow facilitate this."},{"name":"ALISAIE","text":"He also called his dragon “Lunar Bahamut.” Let's not forget that little detail."},{"name":"ALISAIE","text":"And the creature did resemble the descriptions I've seen of the elder primal."},{"name":"ALISAIE","text":"And the creature certainly did resemble the elder primal."},{"name":"GRAHATIA","text":"That may be...but the fact that it answered to Fandaniel would suggest they are not one and the same entity. I think it more probable that it is some manner of simulacrum born of Ascian magicks."},{"name":"ALPHINAUD","text":"Whatever it is, for now we can but work closely with the Alliance and remain vigilant."},{"name":"ALPHINAUD","text":"I believe that concludes our news. What of yours, Y'shtola?"},{"name":"YSHTOLA","text":"I have been to see the sultana. Knowing how quick the Immortal Flames are to dispose of their tempered, I judged it best to provide them with the cure first."},{"name":"YSHTOLA","text":"As soon as I had sufficiently recovered, I traveled to Ul'dah and delivered the porxies to Her Grace, along with detailed instructions on their use."},{"name":"YSHTOLA","text":"Yet my visit chanced to coincide with the arrival of some troubling tidings. The Immortal Flames had been on the cusp of agreeing to a truce with the Amalj'aa when negotiations abruptly collapsed."},{"name":"YSHTOLA","text":"The Amalj'aa claim that a number of their kind have been abducted...and that men are responsible."},{"name":"YSHTOLA","text":"Naught is known of the perpetrators as yet. But as the Immortal Flames went about investigating the abductions, they came upon one of Fandaniel's towers."},{"name":"KRILE","text":"On the subject of the towers, you may be interested to learn that they are <span class=\"emphasis\">not</span> an exclusively Eorzean phenomenon. According to the Alliance, they have been sighted as far afield as Yanxia."},{"name":"ALPHINAUD","text":"Then it would seem reasonable to assume that they are everywhere. We simply have not found them."},{"name":"KRILE","text":"Well, as you said yourself, we can do little for now save remain vigilant. And since we are dealing with a dragon─ostensibly, at least─I believe it would behoove us to enlist the aid of an authority on such foes."},{"name":"TATARU","text":"Estinien!"},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">Estinien</span>? Now just a moment... If he could be persuaded to lend us his lance, I would be the first to welcome it, but the truth is, we will struggle even to find him."},{"name":"TATARU","text":"Hehe! You let me and Krile worry about that. We'll sniff him out, no matter where he's hiding!"},{"name":"KRILE","text":"If indeed he <span class=\"emphasis\">is</span> hiding. We have ways of locating him, regardless. So if there are no objections, we shall depart at once."},{"name":"ALISAIE","text":"Well, rather than sitting around, I think I might go to each of the city-states and educate them in the use of the porxies."},{"name":"ALPHINAUD","text":"They would doubtless appreciate it. But might you consider taking a moment to rest before leaving? You would be fresher for the tasks ahead."},{"name":"GRAHATIA","text":"Well, my friend...our moment of triumph did not last long."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"'Twas ever the way. The world <span class=\"emphasis\">often</span> needs saving."},{"name":"A1","text":"Oh dear. Are you not enjoying our adventure?"},{"name":"A1","text":"And I really could have done with a rest..."},{"name":"GRAHATIA","text":"And save it we shall. I for one do not intend to allow a nihilistic madman to take us all to the grave with him. Not when the future holds such promise."},{"name":"GRAHATIA","text":"Nay, I will do all in my power to protect those whom I hold dear. Just as you have always done."},{"name":"GRAHATIA","text":"Come now, I didn't say that. While it may not be the most carefree experience, there is nothing in this world I would rather do than write a new future with you."},{"name":"GRAHATIA","text":"A <span class=\"emphasis\">long</span> future, mind, whatever the Telophoroi might hope. We'll stop them, won't we. Together."},{"name":"GRAHATIA","text":"Then why not have one now? If anything happens, I promise I will come and wake you."},{"name":"GRAHATIA","text":"As much as I enjoy our adventures together, I <span class=\"emphasis\">am</span> conscious of the toll they take. So let us gather our strength while we can, that we might rise to the challenges of the unwritten future."}],"reward":{"gil":4500},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69551]},"next":[69594,69620]},"partials":[{"type":"npc","id":"1035398","obj":{"i":1035398,"n":"Alphinaud","l":350,"q":1}},{"type":"npc","id":"1032694","obj":{"i":1032694,"n":"Krile","l":481,"q":2}},{"type":"quest","id":"69551","obj":{"i":69551,"n":"The Great Ship Vylbrand","g":10,"l":"Command Room","s":410}},{"type":"quest","id":"69594","obj":{"i":69594,"n":"Unto the Breach","g":10,"l":"The Rising Stones","s":430}},{"type":"quest","id":"69620","obj":{"i":69620,"n":"A New Playing Field","g":76,"l":"Gangos","s":301,"f":1}}]}