{"quest":{"name":"Fit for a Queen","location":"Gangos","id":69562,"patch":5.41,"sort":202,"icon":101045,"unlocksFunction":1,"eventIcon":71341,"issuer":1032880,"target":1032881,"genre":76,"journal":["Bajsaljen would waste no time in dealing with Misija.","Mikoto is convinced that Misija has exhausted the power of Save the Queen, and her vision of the near future suggests both Misija and Save the Queen can be taken into custody without bloodshed. Marsak readies their soldiers and sets out for ruins on the eastern edge of the southern front in the hopes of catching Misija unawares.","Events play out exactly as Mikoto foresaw. The Resistance manages to corner Misija who is unable to summon Queen Gunnhildr to battle. What Mikoto failed to see, however, is that this was all according to Misija's plan, for she too can now peer into the future. Imperial enforcements soon arrive, and a terrible battle ensues there in the ruins.","No sooner do you bring low Misija's imperial soldiers than more arrive to take their place. But your battle was only meant to stall for time, as they manage to open a door leading deeper into the ruins, prompting Misija and Gunnhildr's Blades to escape into the shadows. You follow her into the heart of Delubrum Reginae, where you hope to put an end to her schemes and retrieve Save the Queen. ","Deep within the heart of the ruins, Misija at last finds what she was searching for─a massive crystal rife with the aether needed to summon the full might of Save the Queen. Yet for all its power, the ancient blade proves no match for you. With the day won at last, you take the now-dormant Bozjan relic and an unconscious Misija back to Gangos.","Misija has been placed in solitary confinement awaiting trial, and Bajsaljen believes it best if Save the Queen remain in Mikoto's care for the time being. But there will be no reprieve to study its inner workings, for an imperial warship can be seen approaching in the distance. Bajsaljen orders everyone to withdraw to Gangos and prepare to make a stand.","When the Resistance next steps onto the battlefield, they will be joined by their allies from the Far East. Considering all that is at stake, there is no question that your strength will be needed when that day comes."],"objectives":["Speak with Mikoto.","Enter Delubrum Reginae.","Speak with Marsak."],"dialogue":[{"name":"BAISHAEN","text":"If Misija yet lacks what is required to fulfill her plans, then we must either wrest the blade from her grasp or destroy it. Should the situation call for it, we may need to cut her down in the process."},{"name":"MIKOTO","text":"What if it were possible to take both Misija and the blade into our custody <span class=\"emphasis\">without</span> conflict?"},{"name":"MIKOTO","text":"As I understand it, there have been markedly fewer sightings of the queen's apparition, correct?"},{"name":"MARSHAK","text":"Yes, and with good reason. With no means of combating such a foe, our troops have barely set foot outside of our encampments."},{"name":"MIKOTO","text":"I believe that Misija has her own reasons for making only sporadic appearances. She must use the crystal focus to conjure Queen Gunnhildr, and therein lies the rub, for its reserves of aether are not without limitation."},{"name":"BAISHAEN","text":"Then perhaps she fears the crystal focus nears exhaustion. But what prevents her from simply restoring its aether and resuming her assault?"},{"name":"LILJA","text":"Well, it just so happens the crystal focus requires aether of a very specific sort. We were only able to find one source, and that's still depleted from when we used it."},{"name":"MIKOTO","text":"Before we returned, <span class=\"highlight\">Forename</span> and I chanced to spy Misija commanding Queen Gunnhildr to enslave a group of soldiers, but the apparition vanished after turning only one of them. I suspect the crystal lacked the energies necessary to complete the task."},{"name":"GEROLT","text":"That's all well an' good, lass, but Misija ain't no fool. Until she figures out how to get the crystal focus workin' again, she won't be showin' her face again."},{"name":"MIKOTO","text":"She will. At least...I think she will. <span class=\"highlight\">Forename</span> and I shared another vision of the future."},{"name":"BAISHAEN","text":"Heading to the ruins in the midst of a storm? But for what?"},{"name":"LILJA","text":"Well, it looks like that part of the vision is already coming true. Thunderclouds are gathering above the southern front, and a nasty downpour won't be far behind!"},{"name":"BAISHAEN","text":"Then we must make ready before the rains come in earnest. Marsak, ready the men."},{"name":"BAISHAEN","text":"I understand your trepidation, Mikoto, but you must have faith in your gift. We will stop Misija. I promise you that."},{"name":"BWAGI","text":"It was not by <span class=\"highlight\">Forename</span>'s hand alone that we survived our ordeal in Rabanastre, lest you forget. We each have our part to play, and yours is no less important than any other."},{"name":"GEROLT","text":"Speakin' o' which, you'd best join the others and set out afore the rains come."},{"name":"MIKOTO","text":"Yes, of course."},{"name":"MIKOTO","text":"Everything appears to be in order. Are you ready, <span class=\"highlight\">Forename</span>?"},{"name":"SYSTEM","text":"Upon speaking with Mikoto, several cutscenes will play in sequence."},{"name":"SYSTEM","text":"It is recommended that you set aside sufficient time to view these scenes in their entirety."},{"name":"SYSTEM","text":"You must be a Disciple of War or Magic of level 80 or above to proceed."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'll be with you in two shakes of a Hrothgar's tail."},{"name":"A2","text":"Am <span class=\"emphasis\">I</span> ready? I was waiting for you!"},{"name":"BAISHAEN","text":"Not another step! We have you surrounded!"},{"name":"BAISHAEN","text":"It's over, Misija. We know full well the crystal's power is spent!"},{"name":"MARSHAK","text":"Forward, men!"},{"name":"BAISHAEN","text":"A trap!?"},{"name":"MEESIYA","text":"Come out, Mikoto! I know you're here!"},{"name":"MEESIYA","text":"You thought your visions of the future would offer an advantage, but you are not the only one possessed of such gifts. Not any longer."},{"name":"MEESIYA","text":"A scholar you may be, but you were a fool to come here. Your precious knowledge will avail you naught against the kiss of cold steel!"},{"name":"MARSHAK","text":"Do not be unnerved. Without the queen to aid them, victory may yet be ours! To arms!"},{"name":"SYSTEM","text":"Travel to the underground ruins?"},{"name":"MEESIYA","text":"Well? Have you broken the lock yet!?"},{"name":"IMPERIALMACHINIST04025","text":"Yes, ma'am! Opening it now!"},{"name":"ROSTIK","text":"(-Seasoned Gunbreaker-)I hope you don't mind me butting in."},{"name":"BAISHAEN","text":"Rostik!? What are you doing here?"},{"name":"ROSTIK","text":"I couldn't let you lot have <span class=\"emphasis\">all</span> the fun!"},{"name":"MEESIYA","text":"Another one come crawling out of the woodwork!"},{"name":"MEESIYA","text":"Gunnhildr's Blades, to me! You are to protect this blade with your lives, in the name of the queen!"},{"name":"MIKOTO","text":"Where are they going?"},{"name":"ROSTIK","text":"Go on ahead. Leave their toys to us!"},{"name":"ROSTIK","text":"Ah! We've met before, that day with Radovan!<br>But now is not the time. Go on ahead. Leave their toys to us!"},{"name":"BWAGI","text":"We'll be right behind you. Now go─Mikoto needs you!"},{"name":"SYSTEM","text":"You can now participate in the 24-player duty Delubrum Reginae."},{"name":"SYSTEM","text":"This duty can be joined solo, as a party, or as an alliance by speaking with Mikoto in the underground ruins or Sjeros in Gangos."},{"name":"SYSTEM","text":"Players will be matched automatically even after leaving the underground ruins or Gangos."},{"name":"SYSTEM","text":"It should be noted that, although this duty is in a separate instance, lost actions can still be used after entering."},{"name":"SYSTEM","text":"Be sure to prepare lost actions from the lost finds cache, as they may prove key to turning the tide of battle."},{"name":"SYSTEM","text":"You may also speak with Mikoto and Sjeros for further details about Delubrum Reginae before entering the duty."},{"name":"RESISTANCESCOUT04026","text":"If you mean to enter the ruins, I will guide you to the entrance, but I've been ordered to go no further."},{"name":"SYSTEM","text":"Travel to the underground ruins?"},{"name":"BAISHAEN","text":"Blade <span class=\"highlight\">Surname</span>! Mikoto! Are you all right?"},{"name":"MARSHAK","text":"Is she...?"},{"name":"MIKOTO","text":"No, merely unconscious."},{"name":"BAISHAEN","text":"Let us take her with us back to Utya's Aegis without delay. I fear imperial reinforcements will be upon us ere long."},{"name":"BAISHAEN","text":"It was far from easy, but thanks to the two of you, we have succeeded in reclaiming Save the Queen."},{"name":"BAISHAEN","text":"But it was a victory bought with great sacrifice. Under the blade's influence, many of Gunnhildr's Blades were transformed beyond recognition. At least now their suffering is at an end..."},{"name":"BAISHAEN","text":"A heavy loss for the Resistance, 'tis true, but having wrested Save the Queen from the hands of the IVth Legion, we may resume our offensive unimpeded."},{"name":"BAISHAEN","text":"And we must do so quickly, while they remain few in number."},{"name":"MIKOTO","text":"What will become of Misija?"},{"name":"MARSHAK","text":"For now, she will remain in solitary confinement in Gangos."},{"name":"MARSHAK","text":"First and foremost we must deal with the threat of the IVth Imperial Legion. Once they have been routed, she will be made to stand trial for her crimes."},{"name":"MARSHAK","text":"Espionage, primal summoning, the tempering of Gunnhildr's Blades... She has much to atone for."},{"name":"BAISHAEN","text":"As do many of our people, I would say. For it was the callousness and cruelty of those seeking the glory of our forebears that drove her to side with the Empire. Nevertheless, it is no excuse for her transgressions."},{"name":"BAISHAEN","text":"As for Save the Queen, it should go without saying we mustn't allow it to fall into the wrong hands again."},{"name":"ROSTIK","text":"I thought perhaps it could be destroyed, but I've yet to leave so much as a scratch on the accursed thing."},{"name":"BAISHAEN","text":"I think it best if you were to take it, Mikoto. No doubt its study would prove a most illuminating experience for you. Unless, of course, you would rather it be locked away. I shall defer to your judgment."},{"name":"SCREAM04026","text":"(-Frantic Voice-)Mikoto, nooo!!!"},{"name":"MARSHAK","text":"Mikoto! Is something wrong?"},{"name":"MIKOTO","text":"No... No, I am fine. Merely tired is all."},{"name":"BAISHAEN","text":"Then I bid you return to Gangos and rest. You have more than earned it."},{"name":"BWAGI","text":"Wh-What in the world!?"},{"name":"RIAN","text":"About damned time. Now that we command the skies, they're done for."},{"name":"BAISHAEN","text":"Quickly─we must withdraw to Gangos!"},{"name":"MENENIUS","text":"At last, victory is within our grasp."},{"name":"MARSHAK","text":"Gods preserve us. I did not think they would go so far as to deploy a warship."},{"name":"MARSHAK","text":"Though the odds are stacked against us, we have come too far to abandon our home. I will send word to Lord Hien, that we may begin preparations to make a final stand."},{"name":"MARSHAK","text":"If we fail, it will be the end for Bozja. When the final battle is upon us, I pray we can count on your aid one last time."},{"name":"MARSHAK","text":"You can now exchange Bozjan coins for gear by speaking with the Resistance supplier at Gangos."},{"name":"SYSTEM","text":"For subsequent ventures into Delubrum Reginae, speak with Sjeros in Gangos."}],"reward":{"items":[{"id":32193},{"id":32194},{"id":32195},{"id":32200}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69561]},"next":[69563,69564,69565,69573,69620]},"partials":[{"type":"npc","id":"1032880","obj":{"i":1032880,"n":"Bajsaljen","l":3478,"q":2}},{"type":"npc","id":"1032881","obj":{"i":1032881,"n":"Marsak","l":3478,"q":6}},{"type":"item","id":"32193","obj":{"i":32193,"n":"Field Notes on Mikoto","l":1,"c":26603,"t":61}},{"type":"item","id":"32194","obj":{"i":32194,"n":"Field Notes on Misija, Part II","l":1,"c":26603,"t":61}},{"type":"item","id":"32195","obj":{"i":32195,"n":"Field Notes on Gunnhildr, Part II","l":1,"c":26603,"t":61}},{"type":"item","id":"32200","obj":{"i":32200,"n":"Field Notes on Rostik","l":1,"c":26603,"t":61}},{"type":"quest","id":"69561","obj":{"i":69561,"n":"A Sign of What's to Come","g":76,"l":"Gangos","s":201,"f":1}},{"type":"quest","id":"69563","obj":{"i":69563,"n":"A Seaside Story","g":0,"l":"Gangos","s":211,"f":1}},{"type":"quest","id":"69564","obj":{"i":69564,"n":"One Man's Relic","g":76,"l":"Gangos","s":212,"r":1,"f":1}},{"type":"quest","id":"69565","obj":{"i":69565,"n":"Let Me Holster That for You","g":76,"l":"Gangos","s":213,"f":1}},{"type":"quest","id":"69573","obj":{"i":69573,"n":"In the Queen's Image","g":76,"l":"Gangos","s":250,"f":1}},{"type":"quest","id":"69620","obj":{"i":69620,"n":"A New Playing Field","g":76,"l":"Gangos","s":301,"f":1}}]}