{"quest":{"name":"Let Me Holster That for You","location":"Gangos","id":69565,"patch":5.41,"sort":213,"unlocksFunction":1,"eventIcon":71341,"issuer":1035611,"target":1035611,"genre":76,"usedItems":[32201],"journal":["Kriv believes he knows a way to increase your arsenal of lost actions."],"objectives":["<span class=\"alternative-container\"><span class=\"alternative\">Obtain pieces of Garlean synthetic fabric</span><span class=\"alternative\">Deliver the pieces of Garlean synthetic fabric to Kriv</span></span>."],"dialogue":[{"name":"KRIV","text":"Blade <span class=\"highlight\">Surname</span>, yes? I don't believe we've met. My name is Kriv. I understand you are familiar with the fruits of my research in memory."},{"name":"KRIV","text":"As a matter of fact, our quartermasters have told me much of your findings on the front lines."},{"name":"KRIV","text":"And thanks to said findings, we believe it now possible to expand the lost finds holster even further than previously believed."},{"name":"KRIV","text":"Though I suppose it only fair we give credit to the Garleans, albeit begrudgingly."},{"name":"KRIV","text":"You see, in salvaging gear and supplies from the front, we discovered their uniforms are made using synthetic fibers that are remarkably nonconductive to aether. We believe it may be suitable for insulating the holster, thus allowing us to safely increase its capacity."},{"name":"KRIV","text":"Unfortunately, we are struggling to procure sufficient quantities of the material to test our theories. With your help, however, I believe we may be able to put them to the proof."},{"name":"KRIV","text":"We require more of their synthetic fabric to see our work complete. If you should find any when next you leave to the front lines, please bring it back to us."},{"name":"SYSTEM","text":"Garlean synthetic fabric can be obtained by participating in skirmishes and critical engagements in Save the Queen areas."},{"name":"KRIV","text":"Please, Blade <span class=\"highlight\">Surname</span>, if you can retrieve any of their fabric─any at all─it would be a boon to our research."},{"name":"SYSTEM","text":"Garlean synthetic fabric can be obtained by participating in skirmishes and critical engagements in Save the Queen areas."},{"name":"KRIV","text":"Once we have the necessary samples, we may begin the testing procedure."},{"name":"KRIV","text":"Yes, yes, this will do nicely. Now, may I examine your holster?"},{"name":"KRIV","text":"And...there. Everything appears to be in order."},{"name":"KRIV","text":"Here you are. I pray your now-expanded arsenal will help further turn the tide of battle in our favor."},{"name":"KRIV","text":"With Mistress Mikoto and Master Gerolt's assistance, we will surely have more to offer you in the future. Safe travels, Blade <span class=\"highlight\">Surname</span>."},{"name":"SYSTEM","text":"The maximum capacity of the lost finds holster has been increased by 10."}],"reward":{"gil":575},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69562]}},"partials":[{"type":"npc","id":"1035611","obj":{"i":1035611,"n":"Kriv","l":3478,"q":1}},{"type":"item","id":"32201","obj":{"i":32201,"n":"Garlean Synthetic Fabric","l":1,"c":21666,"t":63}},{"type":"quest","id":"69562","obj":{"i":69562,"n":"Fit for a Queen","g":76,"l":"Gangos","s":202,"f":1}}]}