{"quest":{"name":"Open and Inviting","location":"The Gold Saucer","id":69566,"patch":5.4,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1011061,"target":1011061,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"CARDTOURNAMENT","text":"Enjoying your forays into the competitive world of Triple Triad? Should you feel unfulfilled in your desire for card-based conflict, then allow me to introduce you to our all-new “short tournament” selections!"},{"name":"CARDTOURNAMENT","text":"The first of these trimmed-down tourneys is the “Open” tournament. Held on a regular schedule, this 8-person competition is designed for fair and balanced play. You don't even need your own cards to enter!"},{"name":"CARDTOURNAMENT","text":"Each player builds a 5-card deck from a random selection of cards, and participates in three matches. The winners─and the rewards─are based on the overall results of these games."},{"name":"SYSTEM","text":"To enter an Open tournament, speak with the tournament official as a solo player during an active registration period."},{"name":"SYSTEM","text":"The official also provides useful information such as schedule details and rule explanations."},{"name":"CARDTOURNAMENT","text":"The second concise contest available to you is the “Invitational” tournament. This option allows you to invite up to seven of your friends─or bitter rivals─and create your own exclusive event. The rules of the game are yours to decide!"},{"name":"CARDTOURNAMENT","text":"The structure of the competition is otherwise the same as an Open tournament with regards to the number of matches played, and how the winners are ranked. Oh, and not to worry if you're a few members short of a full party─our house champions will step in to make up the numbers!"},{"name":"SYSTEM","text":"To create an Invitational tournament, form a party with your chosen participants, then have the party leader register your group via the Duty Finder."},{"name":"CARDTOURNAMENT","text":"Be your taste for open or exclusive competition, either of these short-style tournaments will provide a rich battlefield upon which to perfect your Triple Triad prowess!"}]},"partials":[{"type":"npc","id":"1011061","obj":{"i":1011061,"n":"Open Tournament Official","l":1484,"q":1}}]}