{"quest":{"name":"A Sign of What's to Come","location":"Gangos","id":69561,"patch":5.41,"sort":201,"icon":101044,"unlocksFunction":1,"eventIcon":71341,"issuer":1032881,"target":1032880,"genre":76,"journal":["The look in Marsak's eyes tell you the fight for Bozja is far from over.","Operation Eagle's Nest has failed, and the IVth Imperial Legion once again has the Resistance on the back foot. Bajsaljen is not one to be discouraged, however, and has already begun considering counter-strategies. Believing your counsel essential, he has requested an audience with you.","A report from Bwagi reveals the imperial legion's strength is not what it seems. In fact, they are now starved for resources, which has prompted allied forces from Dalmasca and Nagxia to launch an assault and thus slow the arrival of reinforcements to Bozja. The meeting is soon interrupted when a fatigued soldier enters, warning of yet another sighting of Queen Gunnhildr. For reasons as yet unknown, this prompts Mikoto to run off, likely to the southern front.","What Mikoto expects to find on the battlefield remains to be seen, but the others bid you go and find her, fearful she may discover more than she hopes for.","You find Mikoto unharmed, spying on Misija and a group of imperials. Once again, the vision of Queen Gunnhildr appears, though her power is noticeably diminished from your previous encounter. As you turn to leave, Mikoto's gift of the Echo offers an insight into the future─she sees the Resistance cornering Misija, who is unable to wield the power of Save the Queen. Mikoto would waste no time in relaying this news to the Resistance.","Mikoto is convinced the apparition Misija has used to drive back Resistance forces is born of the memories of the late Queen Gunnhildr. She goes on to explain the fabled blade Save the Queen was likely designed to function in a similar fashion to the auracite you encountered in Rabanastre. Assuming this is true, Misija's plans cannot come to fruition without a substantial cache of crystals, meaning there may yet be time for the Resistance to strike back."],"objectives":["Speak with Bajsaljen.","Speak with Marsak on the Bozjan southern front.","Speak with Mikoto.","Speak with Bajsaljen at Gangos."],"dialogue":[{"name":"MARSHAK","text":"It pains me to say it, but we have reached a stalemate on the Bozjan southern front. The IVth Imperial Legion seems content to play the waiting game, perhaps to conserve their strength until reinforcements arrive. We must act before their ranks are replenished."},{"name":"MARSHAK","text":"There is much we wish to discuss with you, though I daresay Bajsaljen could explain it better than I."},{"name":"BAISHAEN","text":"Allow me to cut straight to the heart of our troubles."},{"name":"BAISHAEN","text":"Though we were forced to abandon the castrum, it was our hope that Misija's display of force there was no more than an act of desperation to buy them time. But since then, Queen Gunnhildr has been quick to join the fray each time we engage their forces, leaving us little choice but to retreat."},{"name":"BAISHAEN","text":"We have sustained heavy casualties. Many of those not slain outright have been made slaves to Misija's will."},{"name":"BAISHAEN","text":"I fear she could defeat our forces utterly if she so chose. Our Dalmascan allies, however, have information to the contrary."},{"name":"BWAGI","text":"To put it plainly, we believe the IVth Imperial Legion has all but exhausted its resources."},{"name":"BWAGI","text":"In the wake of Emperor Varis's death, the war of succession has brought the whole of Garlemald to the brink of collapse."},{"name":"BWAGI","text":"As for Gabranth, he has refused orders to return to the capital. Apparently, he harbors dreams of building some <span class=\"emphasis\">new nation</span> on the ruins of Dalmasca."},{"name":"BAISHAEN","text":"Hmm... He may once have played the loyal servant to Solus, but there was no love lost between him and Varis. It seems his allegiance to Garlemald died with the Emperor."},{"name":"BAISHAEN","text":"If what you say is true, cutting ties with Garlemald has deprived his forces of any troops or supplies they would otherwise have received."},{"name":"BWAGI","text":"Lord Hien was quick to reach the same conclusion and ordered an assault on the IVth Imperial Legion."},{"name":"MARSHAK","text":"That would explain why reinforcements from Gabranth have yet to reach the Bozjan southern front."},{"name":"BWAGI","text":"Exactly. Even as we speak, allies from both Dalmasca and Nagxia endeavor to halt their advance."},{"name":"MARSHAK","text":"Nevertheless, our foes on the Bozjan front have Gunnhildr's Blades at their command, giving them the upper hand. Would that there were a way to free them from Misija's control."},{"name":"MIKOTO","text":"I discussed this at length with Mistress Krile, but I am afraid a cure for their condition yet eludes us.<br>&lt;sigh&gt; If only I hadn't been captured by Misija... None of this would have happened."},{"name":"MIKOTO","text":"There may yet be hope, Marsak. I recently received word from the Scions that a cure for their affliction has been found."},{"name":"MIKOTO","text":"However, the procedure would require a great deal of preparation, and that is to say nothing of the difficulty in employing this treatment in combat.<br>&lt;sigh&gt; If only I hadn't been captured by Misija... None of this would have happened."},{"name":"BAISHAEN","text":"The fault lies with me. I am the one who failed to see through her deceit. You are not to blame for any of this."},{"name":"GEROLT","text":"Aye, no use moonin' about feelin' sorry for yerself. Next ye'll be sayin' we should've never reforged the blades of Gunnhildr."},{"name":"RESISTANCESOLDIER04025","text":"(-Resistance Soldier-)Commander! We've received word of another summoning!"},{"name":"BAISHAEN","text":"Mikoto, wait! Where are you going?"},{"name":"LILJA","text":"It must be the summonings─ But we can think about that later!"},{"name":"LILJA","text":"Please, <span class=\"highlight\">Forename</span>! You've got to stop her!"},{"name":"MARSHAK","text":"If the queen were to appear, we would only be a burden. You must go on without us."},{"name":"VORON","text":"(-Voron-)Lowborn traitor!"},{"name":"ZWYNBHRUDA","text":"(-Zwynbhruda-)Don't, Voron! You'll only provoke her!"},{"name":"MEESIYA","text":"How the tables have turned... Now, hold still. This won't hurt a bit."},{"name":"AMIGART","text":"(-Amigart-)Wait, please! Don't!"},{"name":"RIAN","text":"Something wrong, Misija? You've spared two of your captives."},{"name":"MEESIYA","text":"Do it!"},{"name":"RIAN","text":"Apologies. Seems I misspoke."},{"name":"MEESIYA","text":"If you've come to bark orders, don't bother. The next step in my plan has already been set in motion."},{"name":"MEESIYA","text":"Now, if you'll excuse me."},{"name":"RIAN","text":"I certainly hope she knows what she's doing. That eikon of hers is all we have left to buy us time until reinforcements arrive."},{"name":"RIAN","text":"But what on earth could this new plan of hers be? Oh, I do so love a good scheme. Alas, I've been strictly forbidden from helping her..."},{"name":"MIKOTO","text":"Let us return to Gangos. I have seen...more than enough."},{"name":"BAISHAEN","text":"Not another step! We have you surrounded!"},{"name":"BAISHAEN","text":"It's over, Misija. We know full well the crystal's power is spent!"},{"name":"MIKOTO","text":"...Another vision. Did you see it too?"},{"name":"MIKOTO","text":"Come, <span class=\"highlight\">Forename</span>. We must inform the others."},{"name":"MARSHAK","text":"Now that Blade <span class=\"highlight\">Surname</span> has arrived, would you care to elucidate your findings, Mikoto?"},{"name":"MIKOTO","text":"To speak plainly, I believe the apparition summoned at Castrum Lacus Litore and again on the southern front is not what we would call an eikon or a primal. Not in the strictest sense of the term."},{"name":"GEROLT","text":"The hells are ye talkin' about, lass? I've heard me fair share o' tales about primals, and what ye've all told me o' this Queen Gunnhildr fits the description to a bloody tittle."},{"name":"MARSHAK","text":"According to our records, Queen Gunnhildr wielded the power of the blade not to summon a god, but to become one, that she could protect our people."},{"name":"LILJA","text":"So she made herself a vessel for its power, then?"},{"name":"MIKOTO","text":"Misija claimed that after the Fourth Umbral Calamity was averted, the queen was able to return to her mortal form."},{"name":"MIKOTO","text":"Tales passed down through the ages state much the same. It appears Queen Gunnhildr was able to call upon its power at will."},{"name":"BAISHAEN","text":"Then that would mean that a living vessel is required to wield the blade's true power. But that does not explain why it instead manifested in the form of Queen Gunnhildr."},{"name":"MIKOTO","text":"Based on our experience in the castrum and what we observed on the southern front, I believe the blade was imbued with the queen's memories in the form of aether at the moment of her death, and that the crystal focus was used to draw them out."},{"name":"MIKOTO","text":"Does that not sound familiar, <span class=\"highlight\">Forename</span>? Aether absorbed into a vessel, and thereafter used to call forth unspeakable monstrosities."},{"name":"MIKOTO","text":"Precisely. It is a phenomenon quite similar to the auracite we discovered in Rabanastre."},{"name":"MIKOTO","text":"As you may recall, Argath Thadalfus harbored a burning desire to rule, which was made manifest in the ruins of Lesalia."},{"name":"BWAGI","text":"Aye, it was the same for my brother, Ba'Gamnan. His guilt over the deaths of the prince and princess served as a catalyst for his own grisly transformation."},{"name":"BAISHAEN","text":"...I see. From what we have learned of the holy blade thus far, it has much in common with auracite."},{"name":"MIKOTO","text":"This is merely conjecture, but I suspect that Save the Queen was actually crafted from auracite, and altered to amplify the desires of whoever wields it."},{"name":"MARSHAK","text":"But who would be capable of such a feat?"},{"name":"MIKOTO","text":"I cannot say with any certainty, but together with the crystal foci, it is reminiscent of ancient Allagan technology. How it found its way into the hands of Bozjans is anyone's guess."},{"name":"GEROLT","text":"Now hold on a bleedin' minute. Let me see if I'm understandin' this right."},{"name":"GEROLT","text":"Yer sayin' that thing you saw in the castrum weren't no primal, but a mere sliver o' the queen's aether what was left over in the blade?"},{"name":"LILJA","text":"It seems like it. But on the other hand, Misija can keep conjuring it up as many times as she wants."},{"name":"GEROLT","text":"Considerin' what it was designed for, that shade o' the queen is the least of our worries."},{"name":"MIKOTO","text":"Indeed. Misija's ultimate goal is likely to become a vessel for the blade's power, much like the queen did to avert the Fourth Umbral Calamity."},{"name":"MIKOTO","text":"With apt preparation, <span class=\"highlight\">Forename</span> could likely vanquish this shade of Queen Gunnhildr."},{"name":"MIKOTO","text":"But if Misija should succeed in bringing the full power of the blade to bear..."},{"name":"LILJA","text":"Are you suggesting there's a chance <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> could lose? Impossible! Why, I can't even count the number of stories I've heard of <span class=\"highlight\">Forename</span>'s god-slaying adventures. What's one more notch on <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> belt?"},{"name":"MIKOTO","text":"I would rather it not come to that... Thankfully, Misija has yet to find a store of crystals suitable for her plans."},{"name":"MIKOTO","text":"And I doubt she will─for the time being, at least─if the blade was designed in like manner to the crystal foci. We must act now, while there is still time."},{"name":"SYSTEM","text":"New entries have been added to the <span class=\"highlight\">Field Record</span> under Collection in the Duty section of the main menu."}],"reward":{"items":[{"num":2,"id":32162},{"id":32191},{"id":32192}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69487]},"next":[69562]},"partials":[{"type":"npc","id":"1032881","obj":{"i":1032881,"n":"Marsak","l":3478,"q":6}},{"type":"npc","id":"1032880","obj":{"i":1032880,"n":"Bajsaljen","l":3478,"q":2}},{"type":"item","id":"32162","obj":{"i":32162,"n":"Forgotten Fragment of Observation","l":1,"c":20044,"t":63}},{"type":"item","id":"32191","obj":{"i":32191,"n":"Field Notes on Lilja","l":1,"c":26603,"t":61}},{"type":"item","id":"32192","obj":{"i":32192,"n":"Field Notes on Bwagi","l":1,"c":26603,"t":61}},{"type":"quest","id":"69487","obj":{"i":69487,"n":"The Lady of Blades","g":76,"l":"Bozjan Southern Front","s":111,"f":1}},{"type":"quest","id":"69562","obj":{"i":69562,"n":"Fit for a Queen","g":76,"l":"Gangos","s":202,"f":1}}]}