{"quest":{"name":"To Be Second Best","location":"Gridania","id":69569,"patch":5.5,"sort":801,"icon":100880,"eventIcon":71221,"issuer":1006756,"target":1006756,"genre":155,"journal":["Y'mhitra is eager for news of her sister.","After gratefully listening to news of her sister and other recent events, Y'mhitra informs you that Summoner Jajasamu, a member of the Immortal Flames' summoner squad, would appreciate your counsel on some undisclosed matter. It seems the lieutenant is currently on leave and taking his ease at the Carline Canopy...if you have a moment or two to spare.","You meet with Summoner Jajasamu, and the veteran mercenary speaks of his experience fighting alongside two young folk blessed with a resistance to primal influence. He seems bothered by the thought that their presence on the front line is less a choice than an imposed duty, and would have you ask their feelings on the issue. Arenvald, the more approachable of the pair, is to be found in Rhalgr's Reach.","You locate Arenvald with little trouble, and together you pay a visit to Fordola's cell in the city. The ensuing exchange reveals much about the young warriors and the motivations which drive them, but the ever-bitter Fordola soon bids you leave her be. Relenting to her wishes, you and Arenvald withdraw outside to the streets of the Ala Mhigan Quarter.","Putting aside Arenvald's revealing sentiment at glimpsing Fordola's true feelings, it would seem you've been given an answer to Jajasamu's concerns. Return to the Carline Canopy, and report to the lieutenant.","Upon hearing of Arenvald and Fordola's determination, Jajasamu himself resolves to provide the finest support he can muster─even if that means becoming the “second-best summoner in Eorzea.” He bids you send his regards to Y'mhitra before going on his way.","You return to Y'mhitra, and although she cannot claim you as a mentor, the scholar nevertheless seems inspired by the effect you have on your colleagues. To perfect the summoner's art and encourage the hearts of others─this is the proud burden you are fated to bear."],"objectives":["Speak with Jajasamu at the Carline Canopy.","Wait at the designated location in Rhalgr's Reach.","Speak with the prison guard.","Speak with Jajasamu at the Carline Canopy.","Speak with Y'mhitra at Apkallu Falls."],"dialogue":[{"name":"SYSTEM","text":"To accept this quest, you must abandon the summoner job quest “To Be Second Best.” Open the corresponding entry in the journal or duty list and select “Abandon.”"},{"name":"YMHITRA","text":"<span class=\"highlight\">Forename</span>! I was just about to contact the Scions to ask after my sister, and here you are to provide a report in person! What news?"},{"name":"YMHITRA","text":"...To the <span class=\"emphasis\">First</span>!? One of the thirteen reflections, you mean...!?"},{"name":"YMHITRA","text":"I had thought my field of expertise a complicated one, but I struggle to comprehend the enormity of your tale. Still, Shtola seems to be faring well enough, and for that I am grateful."},{"name":"YMHITRA","text":"Ah, yes! Before I forget, I actually had a message to pass on to you."},{"name":"YMHITRA","text":"Do you recall Summoner Jajasamu? Formerly of the Company of Heroes and current member of the Immortal Flames' summoner squad? He commands both an Ifrit- and Titan-Egi, and is likely one of the more seasoned...ahem. Well, I am sure you remember."},{"name":"YMHITRA","text":"He is in Gridania on leave, as it happens, and asked me to direct you to the Carline Canopy should you stop by for one of your unpredictable visits."},{"name":"YMHITRA","text":"I believe he wished to consult you on some private matter... 'Twould be kind of you to lend him an ear if you've a moment or two to spare."},{"name":"YMHITRA","text":"Have you spoken with the lieutenant? I believe he wishes to speak with you summoner-to-summoner."},{"name":"JAJASAMULALASAMU","text":"...Bloody hells! I was just thinkin' about ye, an' there ye are! Y'mhitra had a word on me behalf, I take it? Well, let's not stand on ceremony..."},{"name":"JAJASAMULALASAMU","text":"I'll not mince words with ye─I need some advice concernin' summoners in mortal combat."},{"name":"JAJASAMULALASAMU","text":"They tell me ye've a special nature what prevents primals from enthrallin' yer mind."},{"name":"JAJASAMULALASAMU","text":"So what I want to know is, what's yer thinkin' on bein' sent out to the front lines every time a beast tribe scrapes together a pile o' crystals?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"That's just the way of things."},{"name":"A2","text":"I'm happy to be able to help."},{"name":"JAJASAMULALASAMU","text":"Such is yer fate, ye mean? So ye give in to the inevitable, and fight because it's yer duty to do so?"},{"name":"JAJASAMULALASAMU","text":"So ye just see it as yer rightful place? Folk need yer help, an' ye've been blessed with the means to help 'em...?"},{"name":"JAJASAMULALASAMU","text":"Well, that's one way o' lookin' at it. Me, I'm in it for the coin─have been ever since I sold me spells with the Company o' Heroes."},{"name":"JAJASAMULALASAMU","text":"Most o' the soldiers I march with ain't much different. We're happy to put our lives on the line as long as there's a purse waitin' for us at the end o' the day. The pair what joined in on our last skirmish, though...now there's a whole 'nother story."},{"name":"JAJASAMULALASAMU","text":"Ye've heard of Arenvald an' Fordola, aye?"},{"name":"JAJASAMULALASAMU","text":"The lad's one o' the Scions, same as you. No mystery there."},{"name":"JAJASAMULALASAMU","text":"As for the lass...she's a bit more complicated. Former officer in the imperial army, captured by the Resistance an' steps away from the noose. Fightin' for Ala Mhigo as a conscript now, which is the only reason she's still breathin'."},{"name":"JAJASAMULALASAMU","text":"Barely more'n sprouts, the both of 'em, an' they was deployed with the Flames to assist with downin' Ifrit."},{"name":"JAJASAMULALASAMU","text":"From what I hear, they share yer resistance to primal influence. An' that's why─that's the whole reason they had the dubious honor of standin' in the thick o' the flames."},{"name":"JAJASAMULALASAMU","text":"Meanwhile, me an' me fellow summoners was cowerin' in the shadows, sendin' out our egi to support these youngsters what've seen less than forty summers between 'em."},{"name":"JAJASAMULALASAMU","text":"Can't say I cared much for the experience. It bothered me to think they was bein' made to fight a battle what weren't theirs, just because o' who they are."},{"name":"JAJASAMULALASAMU","text":"Do ye think ye could talk to 'em for me? Ask how they feel about the whole thing? Yer about the only person I can turn to..."},{"name":"JAJASAMULALASAMU","text":"Me thanks. Ye'll find Arenvald in Rhalgr's Reach, an' he'll know where to find Fordola. I'll tell him to meet you by the aetheryte."},{"name":"JAJASAMULALASAMU","text":"Arenvald was in Rhalgr's Reach last I heard. If ye could ask 'em me questions, it'd sure help me sleep at night..."},{"name":"ARENVALD","text":"Ah, <span class=\"highlight\">Forename</span>. I've been told you need my help with something. If you give me a moment, I'll meet you over by the aetheryte."},{"name":"ARENVALD","text":"<span class=\"highlight\">Forename</span>, I heard you had returned from Jajasamu! What can I do for our honored champion?"},{"name":"ARENVALD","text":"Jajasamu said that...? Aye, we joined them against Ifrit, but I'd thought him more annoyed by our presence than concerned for our well-being."},{"name":"ARENVALD","text":"Hm, why don't I save you some time and include Fordola in this conversation. We can visit her in her cell over in the city."},{"name":"GUARDS04033","text":"If you're waiting for the lad in silver armor, he should be out of there soon."},{"name":"ARENVALD","text":"She still snarls like a chained dog..."},{"name":"ARENVALD","text":"Amidst all that growling, though, she gave us a glimpse of her true self. Enough that I'll know when to lend a shoulder, even if she wouldn't let me see her suffering..."},{"name":"ARENVALD","text":"N-Now don't be getting the wrong idea! Same age, same homeland─I can't help but care a little about what happens to her!"},{"name":"ARENVALD","text":"A-Anyway, I have my own training to think of. Give my regards to Summoner Jajasamu!"},{"name":"JAJASAMULALASAMU","text":"Ye've been to see them two youngsters, then?"},{"name":"JAJASAMULALASAMU","text":"Huh... So, that's the way of it, eh?"},{"name":"JAJASAMULALASAMU","text":"Well, I shouldn't be surprised considerin' the example they've been given to follow."},{"name":"JAJASAMULALASAMU","text":"An' now that I know how they're approachin' these fights, I can adjust me own tactics accordingly. One's passionate, an' the other's reckless, so they'll both need some watchful support."},{"name":"JAJASAMULALASAMU","text":"I'll do what I can to stand in for ye, though I doubt I'll ever replace ye. Aye, they'll call me “the second-best summoner in Eorzea”─how's that for humble!?"},{"name":"JAJASAMULALASAMU","text":"Right, I think it's past time I was on me way. Give me best to Y'mhitra, <span class=\"highlight\">Forename</span>, an' thanks for humorin' me request!"},{"name":"YMHITRA","text":"Everything went well with the lieutenant, I trust?"},{"name":"YMHITRA","text":"I won't pry into the details, but I am glad to see you looking so content."},{"name":"YMHITRA","text":"To master summoning is an arduous journey, yet I imagine the going is made far smoother with a mentor such as you. I am somewhat envious of your younger colleagues."},{"name":"YMHITRA","text":"And if I am to mirror their progress, I must not allow my own scholarly research to fall by the wayside! Good day to you, <span class=\"highlight\">Forename</span>!"}],"reward":{"gil":2052,"items":[{"id":25187},{"id":25188},{"id":25189}]},"reqs":{"jobs":[{"lvl":80,"id":28}],"questsType":"all","quests":[68165,69164]}},"partials":[{"type":"npc","id":"1006756","obj":{"i":1006756,"n":"Y'mhitra","l":53,"q":22}},{"type":"item","id":"25187","obj":{"i":25187,"n":"Heavens' Eye Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"25188","obj":{"i":25188,"n":"Savage Aim Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Critical Hit","category":0}}},{"type":"item","id":"25189","obj":{"i":25189,"n":"Savage Might Materia VII","l":420,"c":20274,"t":58,"materia":{"tier":6,"value":8,"attr":"Determination","category":0}}},{"type":"quest","id":"68165","obj":{"i":68165,"n":"An Art for the Living","g":155,"l":"Gridania","s":700,"f":1}},{"type":"quest","id":"69164","obj":{"i":69164,"n":"A Tearful Reunion","g":182,"l":"Amh Araeng","s":51,"f":1}}]}