{"quest":{"name":"A Seaside Story","location":"Gangos","id":69563,"patch":5.41,"sort":211,"unlocksFunction":1,"eventIcon":71341,"issuer":1035609,"target":1035609,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"SYSTEM","text":"A Resistance rank of [#1] and  mettle are required to proceed with this quest."},{"name":"SYSTEM","text":"You are Resistance rank [#1], and have amassed  mettle."},{"name":"SYSTEM","text":"In order to undertake this quest, you must be a Disciple of War or Magic."},{"name":"WAKADANNAOFMUJIKOZA","text":"Now look here. My father was quite clear on the repercussions of returning to him without your next work."},{"name":"WANDERINGWRITER","text":"And for that you have my sympathies, but genius is a most fickle mistress, and her expertise was thoroughly spent but recently on a playscript promised to my dear friend Jenomis."},{"name":"WAKADANNAOFMUJIKOZA","text":"You honestly mean to say you have nothing? Not even an outline? I deserve that much after you were so generously compensated the other evening."},{"name":"WANDERINGWRITER","text":"Compensation...? That drink was meant to be payment for my services!?"},{"name":"WAKADANNAOFMUJIKOZA","text":"Well it certainly wasn't offered out of the kindness of my heart. Have you any idea how expensive that wine was?"},{"name":"WANDERINGWRITER","text":"As I recall, you and your wife were the ones who drank most of it. And you clearly have more money than sense, because that particular “vintage” was positively revolting."},{"name":"WAKADANNAOFMUJIKOZA","text":"And who might this be? Wait, don't tell me─another good friend come to rob me of your next playscript?"},{"name":"WAKADANNAOFMUJIKOZA","text":"<span class=\"highlight\">Forename Surname</span>!? Champion of Eorzea, savior of Doma, <span class=\"emphasis\">that</span> <span class=\"highlight\">Forename Surname</span>?"},{"name":"WANDERINGWRITER","text":"Thus do I find myself wanting for inspiration. Have you, by chance, embarked on any fantastical journeys of late? Grand adventures to stir the soul and perhaps my writing hand to commit pen to paper?"},{"name":"WANDERINGWRITER","text":"The fabled blade Save the Queen given life, guarded by Gunnhildr's Blades... And you say this took place in the ruins of the Bozjan royal palace? My oh my, that is quite the riveting tale."},{"name":"WAKADANNAOFMUJIKOZA","text":"Aha, I know that look! You have an idea for your script."},{"name":"WANDERINGWRITER","text":"You are quite right, my friend. The seed of inspiration has been planted. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> stands in the royal palace─no, the royal cathedral! A suitably opulent location, at any rate. And the last descendant of Queen Gunnhildr stands ready to defy you in pursuit of her lifelong ambition!"},{"name":"WANDERINGWRITER","text":"“Why do you insist on standing in my way!?” she exclaimed, tightening her grip on the holy blade. “Are you truly so eager to meet your gods?”"},{"name":"WANDERINGWRITER","text":"“No! Any who would oppose me are undeserving of such a mercy! The only solace you shall have from my wrath will be damnation!”"},{"name":"WANDERINGWRITER","text":"...No. No, I fear having not seen the exchange firsthand, my prose will stray too far into the realm of fiction."},{"name":"WANDERINGWRITER","text":"If I am to do your deeds justice, I must needs know all that took place that fateful day, down to the finest detail."},{"name":"SYSTEM","text":"You can now participate in the duty Delubrum Reginae (Savage)."},{"name":"SYSTEM","text":"An alliance of 24 to 48 players is required to register for this duty."},{"name":"SYSTEM","text":"The Party Finder may be used to recruit members for this duty by selecting Field Operations, then Delubrum Reginae (Savage)."},{"name":"SYSTEM","text":"After forming an alliance, the alliance leader must speak with the troubled gentleman in Gangos to register."},{"name":"SYSTEM","text":"While inside Delubrum Reginae (Savage), you will be subjected to a status effect that prevents resurrection by certain means."},{"name":"SYSTEM","text":"Raise effects granted via limit breaks and certain lost actions are exempt from this restriction."},{"name":"SYSTEM","text":"Without such means to recover in battle, due preparation will prove all the more essential in this encounter."},{"name":"SYSTEM","text":"You may also speak with the troubled gentleman for further details before entering."}],"reqs":{"jobs":[{"lvl":1,"id":142}],"quests":[69562]}},"partials":[{"type":"npc","id":"1035609","obj":{"i":1035609,"n":"Troubled Gentleman","l":3478,"q":1}},{"type":"quest","id":"69562","obj":{"i":69562,"n":"Fit for a Queen","g":76,"l":"Gangos","s":202,"f":1}}]}