{"quest":{"name":"Komra Wasn't Built in a Day","location":"Kholusia","id":69579,"patch":5.5,"sort":705,"unlocksFunction":1,"eventIcon":71341,"issuer":1032227,"target":1036042,"genre":24,"journal":["The dig site chief eyes you expectantly.","Eager to begin the task of rebuilding Komra, the dig site chief wishes to have a discussion with you and the one whole other person who volunteered to help. At the man's behest, you set out to find the third member of your little crew, a certain dwarf with a cheerfully pessimistic outlook on existence.","The rebuilding effort requires much in the way of supplies and many willing hands, both of which are notably lacking in Komra at present. To overcome this problem, the dig site chief has come up with the idea of availing yourselves of the technology used by the machines. For your part in this plan, you are required to venture into the tunnels to gather items that may be of use, and bring them back to your dwarven associate for inspection. Thus begins the great endeavor to rebuild Komra and prove to one and all that naught can keep dwarves down─save perhaps copious amounts of grog."],"objectives":["Speak with the doomsaying dwarf."],"dialogue":[{"name":"DWARFMASTER03671","text":"Lali-thanks again for offering to help us rebuild our village-ho. So, are you rested and ready to begin the work?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"There's no time like the present."},{"name":"A1","text":"Not just yet. I still have worlds to save and packages to deliver."},{"name":"DWARFMASTER03671","text":"Wonderful. I can't tell you how reassuring it is to have you with us."},{"name":"DWARFMASTER03671","text":"Now, to begin with, we need to discuss how we're going to tackle our task."},{"name":"DWARFMASTER03671","text":"If you could join our nervous friend over there, I'll be along after I see to some preparation."},{"name":"DWARFMASTER03671","text":"Well, far be it from me to rush you. When you're done saving all the worlds and delivering all the packages, we'll be waiting for you right here."},{"name":"VILLAGERD03954","text":"Uwaaah! It's come! My doom is come! Doooooom!<br>...Oh, it's just you. Sorry, force of habit. So, uh...is it time? To rebuild, that is."},{"name":"DWARFMASTER03671","text":"Everyone's here. Good. Let's get right to it. I have an idea that I want to run by the two of you."},{"name":"DWARFMASTER03671","text":"In order to rebuild, we're going to need lots of supplies and willing hands, neither of which we have a whole heap of at the moment."},{"name":"DWARFMASTER03671","text":"But then I thought: what if we availed ourselves of the technology used by the machines? With the wealth of parts they left behind, we have all the materials we need to rebuild <span class=\"emphasis\">and</span> upgrade our automata to do the work."},{"name":"DWARFMASTER03671","text":"Not only would it be practical─since we'd be using the force behind our destruction for our salvation, it's also poetic!"},{"name":"DWARFMASTER03671","text":"For your part in this, <span class=\"highlight\">Forename</span>, I'd ask you to venture into the tunnels and gather those items what might be useful."},{"name":"DWARFMASTER03671","text":"Whatever you find, you can bring to our friend here. He'll examine the objects to see how they might be put to use."},{"name":"DWARFMASTER03671","text":"To be deleted."},{"name":"DWARFMASTER03671","text":"And that's about it. So, what do you think?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Sounds like a plan."},{"name":"A2","text":"I, uh...wasn't paying attention. Could you explain it again?"},{"name":"DWARFMASTER03671","text":"Had a few ales too many, did you? After recent events, I don't blame you. Anyway, let me explain it all again."},{"name":"DWARFMASTER03671","text":"To be deleted."},{"name":"DWARFMASTER03671","text":"Good, good. With this, the rebuilding can finally commence. We'll prove to everyone that you can't keep us dwarves down─except maybe with copious amounts of grog. That's been an issue, historically."},{"name":"DWARFMASTER03671","text":"Well, I'd best be getting back to my post. Without someone breathing down their necks, our miners are liable to stand around with their thumbs up their arses. You have any questions, you can direct them at our friend here."},{"name":"VILLAGERD03954","text":"Between you and me, we're probably doomed to fail. But if it's going to happen anyway, there's no point in delaying it. That's to say, if you're ready to begin, then so am I!"},{"name":"SYSTEM","text":"A weekly quest which continues the story is now available from the doomsaying dwarf in Komra."},{"name":"SYSTEM","text":"Lend your aid and help the dwarves of Komra to rebuild their home."},{"name":"DWARFMASTER03671","text":"To be deleted."}],"reward":{"gil":106},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69572]},"next":[69580,69586]},"partials":[{"type":"npc","id":"1032227","obj":{"i":1032227,"n":"Dig Site Chief","l":2954,"q":15}},{"type":"npc","id":"1036042","obj":{"i":1036042,"n":"Doomsaying Dwarf","l":2954,"q":2}},{"type":"quest","id":"69572","obj":{"i":69572,"n":"It Takes a Village","g":24,"l":"Kholusia","s":620,"f":1}},{"type":"quest","id":"69580","obj":{"i":69580,"n":"A Message from Konogg","g":0,"l":"Kholusia","s":0,"f":1}},{"type":"quest","id":"69586","obj":{"i":69586,"n":"All That Grinds Is Not Gloom","g":24,"l":"Kholusia","s":810,"r":1,"f":1}}]}