{"quest":{"name":"The Resistance Remembers","location":"Gangos","id":69575,"patch":5.41,"sort":252,"icon":101048,"unlocksFunction":1,"eventIcon":71341,"issuer":1032879,"target":1035623,"genre":76,"usedItems":[32957,32958],"journal":["Judging by his furrowed brow, Gerolt's plans to further improve your Resistance weapon may at last be taking shape.","On the surface, Gerolt's plan is seemingly simple─a more selective use of crystallized memories to better align with your preferred style of combat. However, the means to analyze the aetherial properties of these memories yet eludes him. Enter Regana, accompanied by an Allagan node commissioned from Garlond Ironworks designed to do precisely that. Though daunted by the potential ramifications of accepting further help─financial or otherwise─Zlatan can see no other way to proceed with Gerolt's plan. As Regana explains, the node will use gathered memories to create a registry with which you can modify the Resistance weapon as you see fit. Hoping for an adequate sample size, Gerolt suggests searching for two types of memories, eighteen of each.<br><br>※Memories of the dying can be found from certain FATEs and alliance raids.<br>※Haunting memories of the dying can be found from FATEs in the Gyr Abania region, or the Shadow of Mhach alliance raids.<br>※Vexatious memories of the dying can be found from FATEs in the Far East region, or the Return to Ivalice alliance raids.","You return to Gangos with an ample supply of memories for the node, which wastes no time in analyzing and allocating them. When you offer up your Resistance weapon, however, it warns of aetheric instability, and the near-certain corruption of your weapon should you proceed. Zlatan believes the solution to this problem lies in the crystal foci, which used a sealant of heated aetherial siltstone to ensure its stability. Regana notes there was a time when pottery made from this stone could be found in all corners of the realm, suggesting the ruins of Bozja may not be the only place where they can be found. Of course, there is only one among you capable of scouring such dark depths."],"objectives":["Deliver memories of the dying to the Allagan node in Gangos."],"dialogue":[{"name":"GEROLT","text":"Aye, I know why you're here. Yer lookin' to better tune the weapon to match the way ye like to fight. Lucky fer you, I've a plan."},{"name":"GEROLT","text":"The process ain't that different from what we've done before, mind, but we need to be a mite more particular about which memories we use."},{"name":"ZLATAN","text":"Easier said than done, I imagine. How is <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> to know what effect the memories will have before they are applied?"},{"name":"GEROLT","text":"That's just it, lad. <span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> can't."},{"name":"GEROLT","text":"First, we need to find a way to analyze the aether trapped in 'em. Bugger me if I know how, though."},{"name":"GEROLT","text":"Bah, all this ponderin' an' postulatin' ain't fer me, lad. If it's all the same to you, I think I'll head to the store─ Erm, take a stroll to clear me head."},{"name":"REGANA","text":"(-???-)There will be no need for that Gerolt. I believe I have the solution you are looking for."},{"name":"ZLATAN","text":"Regana, what are you doing here? And where in the world did you acquire such a device?"},{"name":"REGANA","text":"Ever since laying eyes on it, I was intrigued by Mikoto's recording module, and so as part of my arrangement with the Resistance, I commissioned an Allagan node of my own from the Ironworks."},{"name":"REGANA","text":"Even by Allagan standards, it really is quite remarkable. But what interested me most is its highly advanced data analysis protocol."},{"name":"REGANA","text":"Thanks to modifications by the Ironworks engineers, it should have no problem analyzing the aetherial properties of any crystallized memories found by <span class=\"highlight\">Forename</span>, and subsequently infusing said aether into the Resistance weapons."},{"name":"GEROLT","text":"So yer sayin' with this floatin' Allagan trinket here...my plan would actually work!?"},{"name":"GEROLT","text":"Well, wouldn't be the first time I had help from one o' these Allagan trinkets. If you're sure it'll do the job, then I say we put it through its paces."},{"name":"ZLATAN","text":"Thank you, Regana, thank you! I never imagined the House of Splendors would go so far to help our cause."},{"name":"REGANA","text":"Well, our help is not without its price, I assure you. And make no mistake─when all is said and done, this Allagan node will be returning with me to Mor Dhona."},{"name":"REGANA","text":"We will always have use for an efficient worker that follows instructions to the letter. One that <span class=\"emphasis\">doesn't</span> need frequent strolls along the beach or a constant supply of ale. At this rate, certain artisans may find their services are no longer required."},{"name":"ZLATAN","text":"I...cannot say I like the implications of that, but aiding the Resistance must come first. You have our full cooperation, for the time being, at least..."},{"name":"REGANA","text":"Splendid. Then let us return to the matter of analyzing the crystallized memories."},{"name":"REGANA","text":"Your part in this is quite simple: you need but provide a sufficient sample size of crystals to the node. It will create a registry of any memories it is supplied, analyzing each entry for its combat potential."},{"name":"REGANA","text":"When the analysis is complete, we can readily assess the manner in which each memory would affect the Resistance weapon, thereby allowing you to choose those most suitable to your needs."},{"name":"GEROLT","text":"And for that, we'll be needin' memories."},{"name":"GEROLT","text":"Variety bein' the spice o' life an' all, I think it for the best if ye look fer two types o' memories. Eighteen of each should do. At least, I hope it will."},{"name":"SYSTEM","text":"Memories of the dying can be found from certain FATEs and alliance raids."},{"name":"SYSTEM","text":"Haunting memories of the dying can be found from FATEs in the Gyr Abania region, or the Shadow of Mhach alliance raids."},{"name":"SYSTEM","text":"Vexatious memories of the dying can be found from FATEs in the Far East region, or the Return to Ivalice alliance raids."},{"name":"GEROLT","text":"If that's not a flagon of ale or crystal memories in yer hands, I'll have to ask ye to leave me be for now, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>."},{"name":"MEMORIZESYSTEM","text":"&lt;blip&gt; Please insert memory samples for registration and analysis."},{"name":"MEMORIZESYSTEM","text":"&lt;blip&gt; Processing...<br>Processing complete. &lt;blip&gt; &lt;blip&gt; Initiating memory analysis..."},{"name":"MEMORIZESYSTEM","text":"&lt;blip&gt; &lt;blip&gt; Memory analysis complete.<br>Memory registry compile complete. Zero anomalies detected."},{"name":"REGANA","text":"So far so good. Now to determine which memory is best suited to <span class=\"highlight\">Forename</span>'s weapon."},{"name":"MEMORIZESYSTEM","text":"&lt;blip&gt; Warning. &lt;blip&gt; Probability of successful infusion estimated at 3.2%. Do you wish to proceed?"},{"name":"GEROLT","text":"What in the seven hells!? No! Why is the chance o' success so bleedin' low?"},{"name":"MEMORIZESYSTEM","text":"Aetheric instability detected within the weapon. &lt;blip&gt; Infusion of additional aether will result in aetherial corruption."},{"name":"GEROLT","text":"It's unstable? But I followed the old Bozjan techniques to the letter!"},{"name":"ZLATAN","text":"Hmmm..."},{"name":"ZLATAN","text":"We unearthed a number of tomes in the ruins beneath the southern front, one of which pertained to the fashioning of crystal foci."},{"name":"ZLATAN","text":"To ensure the stability of aether held within them, they were said to be coated with a solution made with aetherial siltstone."},{"name":"GEROLT","text":"Were they now? Then I suppose we'll have to do the same. Good on ye, Zra... Zala... Erm..."},{"name":"ZLATAN","text":"&lt;sigh&gt; I am glad to be of help, but there is still the matter of tracking down the siltstone..."},{"name":"REGANA","text":"Naturally, the ruins of Bozja would be a good place to start. I have also heard that in ancient times, pottery made with aetherial siltstone found its way to lands far and wide. Unfortunately, it has all but disappeared from circulation in today's markets."},{"name":"GEROLT","text":"In that case, whoever bought those pots back in the day might have left some lyin' around, maybe even in ruins o' their own."},{"name":"GEROLT","text":"Oi, if we were to feed you relics made with aetherial siltstone, reckon ye could whip up a coatin' for the Resistance weapon?"},{"name":"MEMORIZESYSTEM","text":"&lt;blip&gt; &lt;blip&gt; Provided sufficient quantities, production of aetherial sealant is possible."},{"name":"REGANA","text":"My, what an ingenious solution. You impress me, Gerolt."},{"name":"GEROLT","text":"'Course there's only one person here what can safely plumb the depths o' dark, dank ruins an' come out in one piece. Best ye consult with Zalatan about <span class=\"emphasis\">which</span> ruins ye go about plumbin', though."},{"name":"ZLATAN","text":"Zlatan, Master Gerolt... Zlatan."},{"name":"ZLATAN","text":"Ahem. When you are ready to depart, Blade <span class=\"highlight\">Surname</span>, we may discuss the matter of where best to excavate the relics we seek."},{"name":"SYSTEM","text":"A new Resistance weapons quest is now available from Zlatan."}],"reward":{"gil":655},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69574]},"next":[69576]},"partials":[{"type":"npc","id":"1032879","obj":{"i":1032879,"n":"Gerolt","l":3478,"q":5}},{"type":"npc","id":"1035623","obj":{"i":1035623,"n":"Allagan Node","l":3478,"q":1}},{"type":"item","id":"32957","obj":{"i":32957,"n":"Haunting Memory of the Dying","l":1,"c":20017,"t":63}},{"type":"item","id":"32958","obj":{"i":32958,"n":"Vexatious Memory of the Dying","l":1,"c":20042,"t":63}},{"type":"quest","id":"69574","obj":{"i":69574,"n":"Change of Arms","g":76,"l":"Gangos","s":251,"r":1,"f":1}},{"type":"quest","id":"69576","obj":{"i":69576,"n":"A New Path of Resistance","g":76,"l":"Gangos","s":253,"r":1,"f":1}}]}