{"quest":{"name":"It Takes a Village","location":"Kholusia","id":69572,"patch":5.5,"sort":620,"icon":101052,"unlocksFunction":1,"eventIcon":71341,"issuer":1035142,"target":1032227,"genre":24,"journal":["Relieved as he is that you and Konogg are safe, the dig site chief wishes to know of Anogg's fate.","You tell the dig site chief of what transpired within the tower. The truth of Anogg's fate seems almost too much for him to bear, and he requests that you be the one to inform Konogg─and prevent his doing anything rash.","An anguished Konogg accepts the letter from Anogg and tearfully tasks you with a delivery in turn─that of a watch to be entrusted to the dig site chief. The young dwarf found it amongst the rubble and made all the necessary repairs, but cannot bring himself to return to the village to see it into its owner's hands.","Though the chief is pleased to have his wife's treasured family heirloom back in one piece, he finds it suspicious that Konogg failed to return along with it. He dashes off in a panic─presumably toward where you left Konogg in the tunnels.","As the chief suspected, Konogg is gone by the time the two of you reach the tunnels, leaving a note of farewell behind. Feeling that the twins' respective departures from Komra were ultimately the fault of its less-than-supportive people, he hurries off to gather the villagers, that they might know the consequences of their behavior.","The villagers gathered, the dig site chief begins to explain the situation. No sooner does he say that the danger has passed, however, than do the villagers once again revive their debate over who ought to be punished for it having been present in the first place. Stymied and more than a bit frustrated with the lot of them, the chief asks that you speak with each individual and try to bring them around.","You speak with the villagers. Though they remain a stubborn bunch, some seem at least perturbed, if not convinced, by your arguments.","For a moment, it appears that the villagers may see reason─but the crowd soon turns their wayward ire on Glagg for his role in starting the witch hunt. This is the final straw for the dig site chief, who tells them frankly that everyone present is in the wrong before running off once again.","When you find the dig site chief once again, he is much calmer. In spite of everything, he remains determined to rebuild Komra. In addition to your own offer to aid in this endeavor comes a similar offer from a heretofore cowardly villager trying─much like the chief himself─to do the right thing, whatever that may be."],"objectives":["Speak with Konogg in the excavation tunnels.","Deliver the repaired watch to the dig site chief.","Speak to the dig site chief in the excavation tunnels.","Wait for the chief to return.","Speak with the villagers.","Speak with the dig site chief.","Speak with the dig site chief in Komra."],"dialogue":[{"name":"DWARFMASTER03671","text":"So... What happened in there?"},{"name":"DWARFMASTER03671","text":"...Well, I won't pretend I understood half of that. Can't say metaphysics is my area of expertise. Still, I knew that those androids in white and their weird orb were trouble."},{"name":"DWARFMASTER03671","text":"And you're saying that you gave 'em what for, so they won't be coming back. Which is good...right?"},{"name":"DWARFMASTER03671","text":"Glad to hear it. Thanks for risking your neck for us."},{"name":"DWARFMASTER03671","text":"Where's Anogg, though? And your android friends, for that matter? Seems like they should've come back with you..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"..."},{"name":"A1","text":"I'm sorry."},{"name":"DWARFMASTER03671","text":"No, she... But <span class=\"emphasis\">why</span>!?"},{"name":"DWARFMASTER03671","text":"It just...don't seem fair."},{"name":"DWARFMASTER03671","text":"I was holding out hope, you know? That everyone would be fine, and life would go back to normal."},{"name":"DWARFMASTER03671","text":"I <span class=\"emphasis\">should</span> have known better, sure, but..."},{"name":"DWARFMASTER03671","text":"&lt;sigh&gt; Someone will need to tell the villagers. Again."},{"name":"DWARFMASTER03671","text":"As for Konogg─can you speak with him? I managed to talk him out of running back in there as soon as he woke up, but this... It might be better coming from you. Or maybe I'm just a coward."},{"name":"POD","text":"Alert: The tower can no longer be detected."},{"name":"KONOGG","text":"You're back! But where's everyone else?"},{"name":"KONOGG","text":"No... She can't be <span class=\"emphasis\">gone</span>. She wouldn't leave me <span class=\"emphasis\">forever</span>!"},{"name":"KONOGG","text":"Because if she did, I'd... There'd be no one left who..."},{"name":"KONOGG","text":"A-A letter? From Anogg?"},{"name":"KONOGG","text":"“Konogg,<br>I've been to another world. I've seen it...”"},{"name":"KONOGG","text":"Wh-What does she mean? She...the world...they're “constructs”?"},{"name":"KONOGG","text":"That's hardly a reason to run off on her own! She could've...&lt;sniff&gt;...I <span class=\"emphasis\">would've</span>..."},{"name":"KONOGG","text":"Um. I...I have something I need to do. So..."},{"name":"KONOGG","text":"That watch belongs to the chief's wife. I found it when I was clearing rubble earlier."},{"name":"KONOGG","text":"It was broken, but I...&lt;sniff&gt;...I went ahead and fixed it. She'd probably like it back, so can you give it to the chief for me?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I suppose."},{"name":"A2","text":"Wouldn't they be happier if you delivered it yourself?"},{"name":"KONOGG","text":"Thank you. Right now, I... I'm sorry."},{"name":"KONOGG","text":"I...can't. I need to─ Never mind. I'm sorry."},{"name":"KONOGG","text":"I appreciate all that you've done for us. If only I was as strong as you are..."},{"name":"KONOGG","text":"Maybe someday."},{"name":"KONOGG","text":"If the chief asks, tell him not to worry."},{"name":"DWARFMASTER03671","text":"How did it go?"},{"name":"DWARFMASTER03671","text":"Eh? Something for the missus?"},{"name":"DWARFMASTER03671","text":"Wicked white, we thought this was gone for good! She'll be glad to have it back. It's all she has left of her parents."},{"name":"DWARFMASTER03671","text":"Why didn't Konogg come in person, though? He must know we'd want to thank him."},{"name":"DWARFMASTER03671","text":"No... Not him too!"},{"name":"SYSTEM","text":"It seems that you once again have cause to comfort a distraught dwarf..."},{"name":"DWARFMASTER03671","text":"He left a letter of farewell."},{"name":"DWARFMASTER03671","text":"He's gone."},{"name":"DWARFMASTER03671","text":"I wish I could've done something... <span class=\"emphasis\">Anything.</span>"},{"name":"DWARFMASTER03671","text":"We've lost them both, and it's our own fault. We drove them to this."},{"name":"DWARFMASTER03671","text":"This can't be right..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"What do you plan to do about it?"},{"name":"A3","text":"What is “right,” in the end?"},{"name":"DWARFMASTER03671","text":"I don't know what I <span class=\"emphasis\">should</span> do. I don't know how to make things right, but..."},{"name":"DWARFMASTER03671","text":"I don't know, but this ain't it."},{"name":"DWARFMASTER03671","text":"The villagers need to understand that we can't keep on like this."},{"name":"DWARFMASTER03671","text":"They might be better listeners now that they don't have to live in fear anymore─if they can believe that's the case, that is. Would you mind sticking around? It'll seem more credible coming from the both of us."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"I'm here for as long as you need me."},{"name":"A4","text":"How much does this position pay?"},{"name":"DWARFMASTER03671","text":"I knew you would be. You're always willing to do what needs doing."},{"name":"DWARFMASTER03671","text":"I'm ready to do my part, too. Wait here."},{"name":"DWARFMASTER03671","text":"Ha! That's right─took you for an aspiring gate guard at first, didn't I?"},{"name":"DWARFMASTER03671","text":"And we've been nothing but trouble to you since. Not sure there's enough money in all of Komra to compensate you at this point..."},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"It's fine. I'm happy to help."},{"name":"A5","text":"I also accept eternal gratitude and the right to ominously reference “debts to be repaid.”"},{"name":"DWARFMASTER03671","text":"It's a deal, then. But I do hope we can pay you back someday."},{"name":"DWARFMASTER03671","text":"For now, wait here─I'll get the villagers."},{"name":"DWARFMASTER03671","text":"Now that you're all here, I have an important announcement: <span class=\"highlight\">Forename</span> has put an end to those machines and their plot."},{"name":"DWARFMASTER03671","text":"That means the danger's passed, but more importantly, that it's time we look to the future. We'll need to come together─"},{"name":"GLAGG","text":"Hold your ironfrogs! Even <span class=\"emphasis\">if</span> those things are gone, this ain't over."},{"name":"GLAGG","text":"The culprit needs to be brought to justice. How can you expect people to move forward if we don't set an example?"},{"name":"VILLAGERA03954","text":"That's right─we want to see consequences! Death! Mutilation!"},{"name":"DWARFMASTER03671","text":"Do you really!?"},{"name":"DWARFMASTER03671","text":"We need to talk them down, or we'll never get anywhere with this. Bloodthirsty bastards..."},{"name":"DWARFMASTER03671","text":"You can't force one person to shoulder the blame for all of this! Some things are bigger than all of us, Glagg."},{"name":"GLAGG","text":"Folk'll never accept that. It just ain't a satisfyin' conclusion."},{"name":"VILLAGERA03954","text":"The sooner we do away with the culprit, the sooner we can all relax. You know I'm right─Glagg thinks so too!"},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"You'd change your tune if the finger were pointed at you."},{"name":"A6","text":"The blame could just as easily fall on someone you love."},{"name":"VILLAGERA03954","text":"You wouldn't dare accuse me! Everyone knows I'm innocent."},{"name":"VILLAGERA03954","text":"D-Don't they?"},{"name":"VILLAGERA03954","text":"Ha! That ploy won't work on me. I don't have anyone to worry about. No family, no friends, no lovers..."},{"name":"VILLAGERA03954","text":"I don't...have anyone."},{"name":"VILLAGERB03954","text":"All we need is one or two people to take the blame. Then the rest of us can get back to our normal lives."},{"name":"Q7","text":"What will you say?"},{"name":"A7","text":"You'd build your life by destroying others'?"},{"name":"A7","text":"Are you planning to volunteer?"},{"name":"VILLAGERB03954","text":"Wouldn't you? The way I see it, anyone here would throw you to the eaters in a heartbeat for their own gain. You, or me..."},{"name":"VILLAGERB03954","text":"Those backstabbers!"},{"name":"VILLAGERB03954","text":"Why should I? I've done nothing wrong!"},{"name":"VILLAGERB03954","text":"No, not... Not a single thing..."},{"name":"VILLAGERC03954","text":"Justice should be swift and decisive, I say. Nothing so satisfying as the headsman's axe coming down."},{"name":"Q8","text":"What will you say?"},{"name":"A8","text":"Justice isn't about personal satisfaction."},{"name":"A8","text":"And if it comes down on the wrong person?"},{"name":"VILLAGERC03954","text":"Why shouldn't it be? Punish one person and everyone else feels better for it. That's justification enough."},{"name":"VILLAGERC03954","text":"<span class=\"emphasis\">Anything</span> would be better than feeling like this..."},{"name":"VILLAGERC03954","text":"At least we'll be able to put this mess behind us. Forget the whole thing."},{"name":"VILLAGERC03954","text":"I can't think about it anymore. I just can't."},{"name":"VILLAGERD03954","text":"I-I only need to do what Glagg says, right? Then he won't blame me...and whatever happens, it won't be my fault."},{"name":"Q9","text":"What will you say?"},{"name":"A9","text":"You think that will protect you?"},{"name":"A9","text":"No. This is a choice you must make yourself."},{"name":"VILLAGERD03954","text":"W-Won't it? I haven't done anything wrong..."},{"name":"VILLAGERD03954","text":"I haven't done...anything."},{"name":"VILLAGERD03954","text":"B-But then it'll be my responsibility─no matter what happens!"},{"name":"VILLAGERD03954","text":"Someone else... Someone else should be the one..."},{"name":"VILLAGERE03954","text":"The most prudent course is to cooperate with Glagg and rid the village of the guilty party. Then everything will be as it was."},{"name":"Q10","text":"What will you say?"},{"name":"A10","text":"Will it?"},{"name":"A10","text":"Is it really “prudent” to follow harm with cruelty?"},{"name":"VILLAGERE03954","text":"Of course it will. It has to be."},{"name":"VILLAGERE03954","text":"Believe me, if there were a better way..."},{"name":"VILLAGERE03954","text":"If it weren't, Glagg wouldn't have suggested it. He's the elder. He knows how these things work. If not, then..."},{"name":"VILLAGERE03954","text":"No, don't be ridiculous."},{"name":"VILLAGERA03954","text":"It's better this way, trust me. You do trust me...right?"},{"name":"VILLAGERB03954","text":"I'm right─you'll see. You'll all see..."},{"name":"VILLAGERC03954","text":"...Forget I said anything."},{"name":"VILLAGERD03954","text":"You don't understand─I can't be h-held <span class=\"emphasis\">accountable</span>..."},{"name":"VILLAGERE03954","text":"..."},{"name":"DWARFMASTER03671","text":"Well, they've settled down a bit, at least. Thanks for that."},{"name":"GLAGG","text":"&lt;sniff&gt; Still sober, eh? Then I'll ask─what do you reckon we should do?"},{"name":"Q11","text":"What will you say?"},{"name":"A11","text":"Stop this before it's too late."},{"name":"A11","text":"Whatever doesn't involve me hearing everyone's opinions again..."},{"name":"A11","text":"How should I know better than any of you?"},{"name":"VILLAGERA03954","text":"Maybe the outsider's right. We'll never agree on who should take the blame for the attack. Which means the real problem is...Glagg!"},{"name":"VILLAGERC03954","text":"I did feel a lot more confident before he started telling us to “listen to other perspectives”..."},{"name":"VILLAGERB03954","text":"He's been trying to turn us against each other, but <span class=\"emphasis\">he's</span> the elder here. Shouldn't he have seen our village's fiery destruction by skybound machines coming?"},{"name":"DWARFMASTER03671","text":"What? No!"},{"name":"DWARFMASTER03671","text":"No one could've foreseen this. No matter how wise they are, or how hard they try...no one's right every time!"},{"name":"DWARFMASTER03671","text":"We've all made mistakes here, believe me. Anogg, Konogg, Glagg, the whole lot of you...and me. <span class=\"emphasis\">All</span> of us!"},{"name":"DWARFMASTER03671","text":"We failed each other."},{"name":"SYSTEM","text":"Alas, there he goes again."},{"name":"VILLAGERA03954","text":"Er...now what?"},{"name":"VILLAGERB03954","text":"Me? Make a mistake? Never."},{"name":"VILLAGERC03954","text":"Well? Don't let him get away!"},{"name":"VILLAGERD03954","text":"If... If doing nothing is just as wrong, then maybe it wouldn't be so bad to make my own choices..."},{"name":"VILLAGERE03954","text":"Now that's just cowardly."},{"name":"GLAGG","text":"Are my ears goin', or am I bein' insulted left and right?"},{"name":"DWARFMASTER03671","text":"Lali-sorry you had to see that-ho. I may not be cut out for public speaking..."},{"name":"DWARFMASTER03671","text":"I won't give up on putting Komra back together, though─in whatever way I can."},{"name":"DWARFMASTER03671","text":"I don't know what we <span class=\"emphasis\">should</span> have done, but...there's nothing for it but to try and do better. Day by day, moment by moment."},{"name":"Q12","text":"What will you say?"},{"name":"A12","text":"Day by day, moment by moment."},{"name":"A12","text":"Need some help with that? 'Course you do."},{"name":"DWARFMASTER03671","text":"I admit, I feel better knowing you'll be around."},{"name":"VILLAGERD03954","text":"(-???-)P-Pardon me..."},{"name":"VILLAGERD03954","text":"I, er...I was thinking about what you said, and I realized I probably haven't been the most helpful..."},{"name":"VILLAGERD03954","text":"I want─ I'm <span class=\"emphasis\">choosing</span> to try harder, from now on. So if you need another pair of hands..."},{"name":"DWARFMASTER03671","text":"You're more than welcome to join us."},{"name":"DWARFMASTER03671","text":"Though I'd say we're all past due for a little breather, after all that's happened. Take a rest! Chief's orders."},{"name":"VILLAGERD03954","text":"Understood! I'll be just over there, then. With my thoughts. Yes. Not a problem..."},{"name":"DWARFMASTER03671","text":"He's a little odd, but he's got the spirit. I look forward to putting the both of you to work─at your earliest convenience, of course."}],"reward":{"gil":1255},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69571]},"next":[69579]},"partials":[{"type":"npc","id":"1035142","obj":{"i":1035142,"n":"Dig Site Chief","l":2954,"q":2}},{"type":"npc","id":"1032227","obj":{"i":1032227,"n":"Dig Site Chief","l":2954,"q":15}},{"type":"quest","id":"69571","obj":{"i":69571,"n":"Brave New World","g":24,"l":"The Puppets' Bunker","s":610,"f":1}},{"type":"quest","id":"69579","obj":{"i":69579,"n":"Komra Wasn't Built in a Day","g":24,"l":"Kholusia","s":705,"f":1}}]}