{"quest":{"name":"Konogg, Alone","location":"Kholusia","id":69570,"patch":5.5,"sort":600,"icon":101051,"unlocksFunction":1,"eventIcon":71341,"issuer":1032227,"target":1035135,"genre":24,"journal":["The dig site chief is still concerned about the twins.","The chief tells you that naught has changed since last you spoke─Anogg's whereabouts remain unknown, and Konogg has yet to emerge from the doldrums or his place in the tunnels. Though there is little to be done about the former, perhaps a friendly word with Konogg might cheer the young dwarf.","You seek out Konogg, but find him stricken with a fever. Though you insist that he rest, it is not altogether clear that he is lucid enough to understand. Perhaps the chief will be able to help.","The chief seems distraught to hear that Konogg is unwell. He resolves to fetch a remedy posthaste, barking hasty orders to meet him at Konogg's bedside before rushing off.","You return to where you left Konogg, along with the worried chief. Unfortunately, the young dwarf is no longer abed, nor indeed anywhere in sight.","Upon consulting with the chief about this dismaying development, the two of you resolve to speak with the villagers. If Konogg has indeed wandered off in his half-conscious state, someone likely took notice.","Though you ask a variety of potential witnesses, not a single dwarf produces information that might lead you to Konogg. Perhaps the chief has had better luck.","The chief tells you that one of his miners indeed caught sight of a feverish Konogg making his way from the village. He was headed in the direction of the crater whence you previously entered the Puppets' Bunker─so that is again where you must go if you would bring him home.","You gaze out over the crater, but Konogg is nowhere to be found amongst the bulky metal debris. For better or worse, you have an inkling as to where he has gone..."],"objectives":["Speak with Konogg in the excavation tunnels.","Speak with the dig site chief in the Duergar Mountains.","Investigate the makeshift bed.","Speak with the dig site chief.","Gather information in Komra.","Wait at the destination.","Speak with the dig site chief."],"dialogue":[{"name":"DWARFMASTER03671","text":"Lali-I may have been too optimistic-ho, <span class=\"highlight\">Forename</span>."},{"name":"DWARFMASTER03671","text":"The fact that the villagers are still nursing a grudge doesn't surprise me─not that I haven't tried to make them think better of it. But why hasn't Anogg come back and given them what for yet? It ain't like her to fret over what people think."},{"name":"DWARFMASTER03671","text":"Then there's Konogg. I was worried he'd go chasing after her again─which is why I'm even <span class=\"emphasis\">more</span> worried that he's been shut up in the tunnels this whole time."},{"name":"STRONGMINER00642","text":"(-???-)Chief!"},{"name":"STRONGMINER00642","text":"We need to clear the rubble so we can start digging again, but the others won't stop bickering about whose job it is. Not even when I threaten to boot 'em clear into the sea!"},{"name":"DWARFMASTER03671","text":"I'll be right there. Two boots are better'n one, as they say."},{"name":"DWARFMASTER03671","text":"Looks like I have other business to take care of─not that I was having much luck here. Can you check on Konogg in my stead?"},{"name":"DWARFMASTER03671","text":"What with Anogg gone and the villagers treating him like he's got the blight, he could do with a reminder that not everyone has abandoned him..."},{"name":"DWARFMASTER03671","text":"And who's to say─maybe one of your tales of adventure will cheer him up."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I've got just the thing! Though I've forgotten the names of everyone involved."},{"name":"A1","text":"Or scar him for life..."},{"name":"DWARFMASTER03671","text":"I'm sure whatever you come up with will be fine. Probably."},{"name":"DWARFMASTER03671","text":"...And let me know how he's doing, all right? Even if he doesn't want to talk to me, I─ I want him to have the help he needs, is all."},{"name":"POD","text":"（★未使用／削除予定★）"},{"name":"SYSTEM","text":"Konogg is radiating an uncommon amount of heat. The many layers insulating his head probably aren't helping."},{"name":"KONOGG","text":"Wh-What...?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"You collapsed, is what. You need rest..."},{"name":"A2","text":"That feeling like your head is full of fiery bees? That's a fever."},{"name":"KONOGG","text":"No, I'm...fine... Got to...find Anogg..."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Nope. You're not going anywhere."},{"name":"A3","text":"Anogg wouldn't want you running after her in this state."},{"name":"KONOGG","text":"Anogg... Anogg, I'm..."},{"name":"KONOGG","text":"Anogg..."},{"name":"POD","text":"（★未使用／削除予定★）"},{"name":"DWARFMASTER03671","text":"Konogg collapsed!?"},{"name":"DWARFMASTER03671","text":"We need to do something about that fever! I think some of my wife's supply of remedies survived..."},{"name":"DWARFMASTER03671","text":"I'll go and see─you keep an eye on Konogg!"},{"name":"DWARFMASTER03671","text":"I thought you said he was bedridden!"},{"name":"DWARFMASTER03671","text":"Wicked white, where did he go?"},{"name":"DWARFMASTER03671","text":"I know he wanted to search for Anogg, but how did he even make it out of here?"},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"Willpower and hubris?"},{"name":"A4","text":"We'll worry about that later."},{"name":"DWARFMASTER03671","text":"Damn it all─let's go. Quickly!"},{"name":"2B","text":"Who's there?"},{"name":"2B","text":"You..."},{"name":"DWARFMASTER03671","text":"We should ask around, find out if anyone saw him go past."},{"name":"DWARFMASTER03671","text":"Not that I expect they'll be too inclined to help..."},{"name":"DWARFMASTER03671","text":"Still, any lead is better than none at all. I'll speak with my miners, you talk to...whoever else."},{"name":"VILLAGERE03954","text":"No, I haven't seen Konogg leaving the village... Why?"},{"name":"VILLAGERC03954","text":"Finally realized he's no good to us and left, did he?"},{"name":"VILLAGERA03954","text":"But without him <span class=\"emphasis\">or</span> Anogg, who's going to be held responsible for what happened?"},{"name":"VILLAGERB03954","text":"Their collaborator here, for one. Listen, outsider, I'm sure you thought you were <span class=\"emphasis\">helping</span>, but..."},{"name":"VILLAGERD03954","text":"Now we're doooooomed!"},{"name":"GESUGG","text":"A search for Konogg, you say? That can't be easy. Those twins aren't really the sort to stand still."},{"name":"GESUGG","text":"Wish I could help, but I haven't seen anything out of the ordinary─not more than usual, at any rate. Certainly no fever-addled dwarves."},{"name":"GLAGG","text":"Now Konogg's missin' too? We're droppin' dwarves like ale from a leaky cask!"},{"name":"GLAGG","text":"Well, I hope you find 'em. The matter of culpability is still unsettled, and I'll never get the villagers to agree on what's what if the most guilty-lookin' parties up and vanish..."},{"name":"VILLAGERE03954","text":"Now, more than ever, it's important that we exercise prudence─just as I'm always urging."},{"name":"VILLAGERC03954","text":"（★未使用／削除予定★）"},{"name":"VILLAGERA03954","text":"（★未使用／削除予定★）"},{"name":"VILLAGERB03954","text":"（★未使用／削除予定★）"},{"name":"VILLAGERD03954","text":"（★未使用／削除予定★）"},{"name":"GESUGG","text":"I've run out of machine oil... Other than that, no, I still have nothing to tell you."},{"name":"GLAGG","text":"I almost wish a few of those damned Tholls would turn up. Nothing brings us all together like a spot of unfriendly rivalry."},{"name":"DWARFMASTER03671","text":"Lali-I thought I'd never escape-ho! Who knew that questioning every miner in Komra could be so time-consuming..."},{"name":"DWARFMASTER03671","text":"I hope you weren't waiting too long. Did you learn anything useful?"},{"name":"DWARFMASTER03671","text":"Wish I could say I was surprised."},{"name":"DWARFMASTER03671","text":"My lot also had some...difficulty focusing on the immediate issue, but one of them did see Konogg."},{"name":"DWARFMASTER03671","text":"It sounds like he was wandering in the direction of the crater─again. We should search the area."},{"name":"DWARFMASTER03671","text":"What's that big wheel? Some kind of machine?"},{"name":"Q5","text":"What will you say?"},{"name":"A5","text":"An enemy stronghold."},{"name":"A5","text":"Technology from another world..."},{"name":"DWARFMASTER03671","text":"Well, that doesn't sound good. Though I'm still more concerned about where Konogg might have gone."},{"name":"Q6","text":"What will you say?"},{"name":"A6","text":"I have a bad─and familiar!─feeling about this..."},{"name":"A6","text":"Perhaps I should have mentioned where exactly I found him last time."},{"name":"DWARFMASTER03671","text":"You think he's <span class=\"emphasis\">inside</span>? And he's probably not alone..."},{"name":"DWARFMASTER03671","text":"&lt;sigh&gt; Here we go again."}],"reward":{"items":[{"id":33908},{"id":33909}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69534]},"next":[69571]},"partials":[{"type":"npc","id":"1032227","obj":{"i":1032227,"n":"Dig Site Chief","l":2954,"q":15}},{"type":"npc","id":"1035135","obj":{"i":1035135,"n":"Dig Site Chief","l":3576,"q":2}},{"type":"item","id":"33908","obj":{"i":33908,"n":"Voice of no Return (Normal) Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"item","id":"33909","obj":{"i":33909,"n":"The Color of Depression Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"69534","obj":{"i":69534,"n":"To Make Amends","g":24,"l":"Kholusia","s":500,"f":1}},{"type":"quest","id":"69571","obj":{"i":69571,"n":"Brave New World","g":24,"l":"The Puppets' Bunker","s":610,"f":1}}]}