{"quest":{"name":"In the Queen's Image","location":"Gangos","id":69573,"patch":5.41,"sort":250,"icon":101046,"unlocksFunction":1,"eventIcon":71341,"issuer":1032879,"target":1032905,"genre":76,"journal":["Recent events on the southern front have Gerolt feeling inspired.","The Resistance has graciously allowed Gerolt to examine Save the Queen. Impressed by its craftsmanship and capacity for memories, he has been inspired to incorporate what he learned from the holy blade into the Resistance weapons. The process will require a great deal more memories, however, and for that he would ask you to consult with Zlatan.","Zlatan would discuss the matter of gathering more memories after you are duly prepared. Though he has yet to elaborate on what manner of memories may be required, you suspect a trying experience yet awaits you."],"objectives":["Speak with Zlatan."],"dialogue":[{"name":"GEROLT","text":"Made it back in one piece, eh, <span class=\"highlight\">Forename</span>? Same goes for Misija, 'cept she's been taken off to the gaols. I s'pose that's the last we'll be hearin' of Queen Gunnhildr an' all."},{"name":"ZLATAN","text":"That Save the Queen should be returned to us at last... Words cannot well express our gratitude."},{"name":"ZLATAN","text":"Ahem. But that is not to say our work is finished. Far from it."},{"name":"GEROLT","text":"We were lucky enough to be given a look at the blade itself. To say it's perfect is a damned understatement."},{"name":"GEROLT","text":"An' its capacity fer memory's unlike anythin' I've ever seen. A quality I reckon's worth tryin' to replicate."},{"name":"ZLATAN","text":"We could never hope to match the efficacy of Save the Queen, there is no denying that. But if there is even the slimmest possibility of improving the Resistance weapons, we must try."},{"name":"GEROLT","text":"Aye, and if all goes to plan, we can do a mite more than simply increasin' their power. I see no reason why the memories can't be used to better attune the weapons to the one wieldin' 'em."},{"name":"REGANA","text":"Excuse me, but I think I misheard you. Did you say that the Resistance weapons can not only be refined, but tailored specifically to <span class=\"highlight\">Forename</span>'s preferred style of combat?"},{"name":"GEROLT","text":"In theory. The finer details can be hammered out later. First, we need to see about increasin' the weapons' capacity fer memories."},{"name":"REGANA","text":"I see... Might you humor me with further explanation of your plans? There may be something in my research that proves of use in the refinement process."},{"name":"GEROLT","text":"Rowena's got me in enough of a bind as it is, and relyin' on one of her lackeys is only gonna make things worse. Then again, I haven't much of a say in the matter, do I...?"},{"name":"GEROLT","text":"But sod all that for now, let's talk about the job at hand."},{"name":"GEROLT","text":"If any o' this is goin' to work, I'll have to recast yer weapon. I've got a shape in mind, so while I'm readyin' the forge, I need you to go an' gather more memories o' the dyin'."},{"name":"GEROLT","text":"Bugger me if I knew where to find 'em, though. Might be ol' Zatro here can─No, that ain't right. Uh... Wait, don't tell me..."},{"name":"ZLATAN","text":"For the last time, my name is... &lt;sigh&gt; Never mind. If it please you, Blade <span class=\"highlight\">Surname</span>, we may speak on the matter of memories later."},{"name":"GEROLT","text":"I know he's cross with me forgettin' his name, but can ye blame me? Only thing I <span class=\"emphasis\">do</span> remember is letters ain't supposed to fit together like that. It ain't right, <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>. It just ain't right..."},{"name":"ZLATAN","text":"As Gerolt mentioned before, we would ask you to gather more memories while we see to preparations for a new weapon casting."},{"name":"ZLATAN","text":"With regard to what manner of memory would be appropriate for this latest endeavor, we may discuss that when you are ready to depart."},{"name":"SYSTEM","text":"A new Resistance weapons quest is now available from Zlatan."}],"reward":{"gil":615},"reqs":{"jobs":[{"lvl":80,"id":142}],"questsType":"all","quests":[69507,69562]},"next":[69574]},"partials":[{"type":"npc","id":"1032879","obj":{"i":1032879,"n":"Gerolt","l":3478,"q":5}},{"type":"npc","id":"1032905","obj":{"i":1032905,"n":"Zlatan","l":3478,"q":12}},{"type":"quest","id":"69507","obj":{"i":69507,"n":"The Will to Resist","g":76,"l":"Gangos","s":152,"r":1,"f":1}},{"type":"quest","id":"69562","obj":{"i":69562,"n":"Fit for a Queen","g":76,"l":"Gangos","s":202,"f":1}},{"type":"quest","id":"69574","obj":{"i":69574,"n":"Change of Arms","g":76,"l":"Gangos","s":251,"r":1,"f":1}}]}