{"quest":{"name":"Whence the Heart Leads","location":"Kholusia","id":69589,"patch":5.55,"sort":900,"icon":101053,"unlocksFunction":1,"eventIcon":71341,"issuer":1032227,"target":1032227,"genre":24,"journal":["Your work restoring Komra to its former glory may be finished, but the dig site chief's not quite done with you yet.","The chief informs you of a curious rumor─that dwarven automata have been spotted about Eulmore of late. As both the machines and the secrets of their construction are generally to be found within dwarven settlements exclusively, he has a sneaking suspicion that their sudden prevalence elsewhere has something to do with Konogg's departure from Komra. Eager for any chance of setting things right with the youth, he asks that you follow this trail and see if it leads to Konogg.","A merchant in Eulmore, located via your uncanny investigative instincts, claims to have done business with a dwarf fitting Konogg's description and inclinations. He generously gives you a piece of parchment indicating the whereabouts of said dwarf's current dwelling─though not without saddling you with wares to deliver. Alas, when you arrive, Konogg is no longer to be found within. Perhaps he departed with Anogg, but whence, who can say...","You give the chief the news of what you found in Konogg's erstwhile home along with the bottle of mead he purchased in Eulmore. He seems disappointed, though unsurprised, lamenting that this affair has been an unfortunate one from start to finish. He further muses that to err is inevitable─a fact with which you, too, must make peace."],"objectives":["Speak with the bourgeois merchant in Skyfront.","Speak with the dig site chief in Komra."],"dialogue":[{"name":"DWARFMASTER03671","text":"Lali-I can't thank you enough-ho! Komra is looking like its old self again─better, if we're honest."},{"name":"DWARFMASTER03671","text":"You can see that for yourself, though, so let me tell you something you don't know."},{"name":"DWARFMASTER03671","text":"I hear that automata of dwarven make have been spotted about Eulmore of late. Signature frog motif and all."},{"name":"DWARFMASTER03671","text":"Now, where would those city folk have gotten their hands on artisanry like that? We certainly haven't been peddling them to outsiders─er, you aside."},{"name":"DWARFMASTER03671","text":"I can think of one dwarf who might be, though. One with the right skills, and little else to his name..."},{"name":"DWARFMASTER03671","text":"If it <span class=\"emphasis\">is</span> Konogg...well, I have a lot to say to him. “I'm sorry,” for starters."},{"name":"DWARFMASTER03671","text":"And it'd be nice if he could see how far we've come. The new Komra."},{"name":"DWARFMASTER03671","text":"I like to think he'd be happy here."},{"name":"DWARFMASTER03671","text":"...Anyway, seeing as you're the worldly sort, I doubt you'll have too much trouble picking up his trail in Eulmore. Let me know what you find."},{"name":"DWARFMASTER03671","text":"Konogg..."},{"name":"EULMOREMERCHANT04053","text":"I've got gold! I've got jewels! I've got gold-plated jewels!"},{"name":"EULMOREMERCHANT04053","text":"...Not interested in my wares? Pity."},{"name":"EULMOREMERCHANT04053","text":"I did see a dwarf in black, though, yes. Odd little fellow. Came selling one of those Gogg contraptions─not quite to my personal tastes, but a rare find to be sure!"},{"name":"EULMOREMERCHANT04053","text":"He placed an order, as well. Paid in advance! Say... If you're looking for the chap anyway, would you save me some time and take it to him?"},{"name":"EULMOREMERCHANT04053","text":"He mentioned that he was sleeping down in the Derelicts─odd lad, as I said. I'm not sure how familiar you are with the place, but fortunately he drew a map to his preferred hovel."},{"name":"KONOGG","text":"Wait just a little longer, Anogg. With the machines' technology, I can bring you back. I <span class=\"emphasis\">will</span>."},{"name":"KONOGG","text":"I'll make it work. I will. I <span class=\"emphasis\">will</span>!"},{"name":"KONOGG","text":"I...can't."},{"name":"KONOGG","text":"I can't!"},{"name":"KONOGG","text":"I'm not...not good enough...never good enough... I can't..."},{"name":"KONOGG","text":"Anogg, I can't do this!"},{"name":"KONOGG","text":"I can't live in a world without you. I just <span class=\"emphasis\">can't</span>..."},{"name":"ANOGG","text":"You're such a crybaby."},{"name":"KONOGG","text":"...A-Anogg?"},{"name":"ANOGG","text":"The one and─ Well, suffice it to say that I'm back! Thanks to your hard work...and <span class=\"emphasis\">my</span> innate genius, of course."},{"name":"KONOGG","text":"Anogg, I... I have nowhere to go. I'm all alone."},{"name":"ANOGG","text":"That was before. You have me, now."},{"name":"ANOGG","text":"And don't you dare say we have nowhere to go. There's a whole world waiting for us, Konogg!"},{"name":"DWARFMASTER03671","text":"Lali-don't keep me in suspense-ho! Did you find Konogg?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I found his workshop, but I don't know where he's gone."},{"name":"A1","text":"You were right that he was in Eulmore, but now..."},{"name":"DWARFMASTER03671","text":"That's...disappointing. Still, I appreciate you letting me know all the same."},{"name":"DWARFMASTER03671","text":"What's that you have there? Some kind of fancy mead?"},{"name":"DWARFMASTER03671","text":"Konogg... But what's it for? Aside from the obvious, I mean."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I think he'd appreciate it if you passed it on to the woman who was injured."},{"name":"A2","text":"Just make sure Konogg gets it when he comes home."},{"name":"DWARFMASTER03671","text":"I will. I only wish things hadn't turned out like this. What happened to the village was bad enough, but then everyone was at each other's throats, and Anogg and Konogg were gone... Don't even get me started on the Glagg debacle."},{"name":"DWARFMASTER03671","text":"I keep turning it all over in my mind, and I see nothing but the mistakes we made. And I wonder, how can any of us be sure that we won't make a mess of things again?"},{"name":"DWARFMASTER03671","text":"Maybe we can't. Maybe we just try to remember, every single day, how bloody wrong we probably are, and...we learn to live with that. Maybe that's the only answer we get."}],"reward":{"gil":1015,"items":[{"id":33845}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69585]}},"partials":[{"type":"npc","id":"1032227","obj":{"i":1032227,"n":"Dig Site Chief","l":2954,"q":15}},{"type":"item","id":"33845","obj":{"i":33845,"n":"Weight of the World (Instrumental) Orchestrion Roll","l":1,"c":25945,"t":94}},{"type":"quest","id":"69585","obj":{"i":69585,"n":"All's Well That Ends with Ale","g":0,"l":"Kholusia","s":0,"f":1}}]}