{"quest":{"name":"All's Well That Ends with Ale","location":"Kholusia","id":69585,"patch":5.5,"sort":0,"unlocksFunction":1,"eventIcon":71341,"issuer":1032227,"target":1032227,"genre":0,"journal":[],"objectives":[],"dialogue":[{"name":"DWARFMASTER03671","text":"Lali-we've done it-ho, <span class=\"highlight\">Forename</span>! We've restored Komra to the way it was! This calls for grog─lots of it!"},{"name":"DWARFMASTER03671","text":"Ah, but before I drink myself silly, I should put this in surer hands. It's another recording device from Konogg."},{"name":"DWARFMASTER03671","text":"After all this time, we still don't know where the lad is. But I hope he'll return soon so he can marvel at the fine work we've done with our village."},{"name":"DWARFMASTER03671","text":"And speaking of returning... Could you come with me, <span class=\"highlight\">Forename</span>? There's something else I want to tell you."},{"name":"DWARFMASTER03671","text":"Some days ago, Glagg suddenly vanished from the village."},{"name":"DWARFMASTER03671","text":"I rounded up a crew of my miners, and together we set out to find him."},{"name":"DWARFMASTER03671","text":"His trail led us deep into the machines' base inside the crater, to the place where we encountered that strange white orb."},{"name":"DWARFMASTER03671","text":"It was there that we found Glagg, lying face down and unmoving. We rushed to his aid, but before we could so much as roll him over, he got up and proceeded to walk off in the direction of the village. As if we weren't there, as if nothing had happened..."},{"name":"DWARFMASTER03671","text":"Since then, Glagg's been back to his normal self. As far as anyone can tell, at any rate."},{"name":"DWARFMASTER03671","text":"We've no idea what brought on those bursts of strange behavior. Perhaps the man just had too much to drink, perhaps it was something else."},{"name":"DWARFMASTER03671","text":"But whatever it was, we've decided to keep things quiet and leave well enough alone. You're one of the few privy to the situation, so I thought I should let you know how it ended."},{"name":"DWARFMASTER03671","text":"I also want to thank you again. You truly have a beard of gold, <span class=\"highlight\">Forename</span>, and we wouldn't have been able to rebuild our village without you."},{"name":"DWARFMASTER03671","text":"The way I see it, this place is as much your home as it is ours. So no matter where you go, know that there'll always be a tankard of ale waiting here for you."},{"name":"SYSTEM","text":"You obtain a message from Konogg."},{"name":"SYSTEM","text":"The message can be viewed in your <span class=\"highlight\">Portable Archive</span>, which is available under Collection in the Duty section of the main menu."}],"reqs":{"quests":[69584]},"next":[69589]},"partials":[{"type":"npc","id":"1032227","obj":{"i":1032227,"n":"Dig Site Chief","l":2954,"q":15}},{"type":"quest","id":"69584","obj":{"i":69584,"n":"Stranger Glagg","g":0,"l":"Kholusia","s":0,"f":1}},{"type":"quest","id":"69589","obj":{"i":69589,"n":"Whence the Heart Leads","g":24,"l":"Kholusia","s":900,"f":1}}]}