{"quest":{"name":"All That Grinds Is Not Gloom","location":"Kholusia","id":69586,"patch":5.5,"sort":810,"interval":"weekly","repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1036042,"target":1036042,"genre":24,"journal":["The doomsaying dwarf wishes to send you to gather machine parts─and definitely not to your doom."],"objectives":["Obtain salvage in the Copied Factory.","Deliver the salvage to the doomsaying dwarf."],"dialogue":[{"name":"VILLAGERD03954","text":"Ready to go to your doom─er...I mean, get to work, are you? Good, good."},{"name":"VILLAGERD03954","text":"As per the chief's instructions, your task is to gather items the machines left behind that might prove useful for rebuilding our village."},{"name":"VILLAGERD03954","text":"Do you know any suitable places for this?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The machines have a base deep in the tunnels."},{"name":"A1","text":"There's a ruined factory strewn with machina."},{"name":"VILLAGERD03954","text":"Oho, that sounds perfectly forbidding!"},{"name":"VILLAGERD03954","text":"While you're out there searching, I'll get my tools ready for dismantling."},{"name":"VILLAGERD03954","text":"I look forward to seeing the spoils of your foray!"},{"name":"VILLAGERD03954","text":"How goes the search? I stand ready to dismantle the spoils of your foray!"},{"name":"VILLAGERD03954","text":"Well, drench my beard, I've never seen anything like this... It's not going to suddenly spring to life and strangle me, is it?"},{"name":"VILLAGERD03954","text":"No? Well, if you're sure... I'll set about studying it at once."},{"name":"VILLAGERD03954","text":"Oh, I should mention that the chief was looking for you. Seems he has news to share. It's something dreadful, I shouldn't doubt..."},{"name":"VILLAGERD03954","text":"Have you spoken with the chief yet? Seems he has news to share. It's something dreadful, I shouldn't doubt..."},{"name":"VILLAGERD03954","text":"Hm? Ready for another foray, are you? Well, if it wouldn't be too much of a bother..."},{"name":"VILLAGERD03954","text":"Excellent! Let our inexorable march towards failure continue!"},{"name":"VILLAGERD03954","text":"So, do you recall the machina you brought back last time? Unfortunately, they were rather far gone, and I couldn't salvage much of them. Do you think you could bring back more of the same?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Consider it done."},{"name":"A2","text":"If you think it best."},{"name":"VILLAGERD03954","text":"Thank you! With the bits from the extra specimens, I think we can put together something useful─even if we're inevitably doomed to fail."},{"name":"VILLAGERD03954","text":"Please bring me more of the same machina as last time. With the bits from the extra specimens, I think we can put together something useful─even if we're inevitably doomed to fail."},{"name":"VILLAGERD03954","text":"Ah, yes, precisely the same as last time! This ought to suffice for our purposes, thank you!"},{"name":"VILLAGERD03954","text":"You know, I've been feeling a little bit more optimistic in spite of myself. By keeping occupied with our work, I find my mind doesn't stray towards the doom and gloom as often as it used to. Seems it's better to take action than being idle with negative thoughts."},{"name":"VILLAGERD03954","text":"If only it weren't so hard to take action in the first place..."},{"name":"VILLAGERD03954","text":"Well, I should be getting back to my work. Perhaps you could report to the chief, in case he has other tasks that want doing. Thanks again for bringing the parts!"},{"name":"VILLAGERD03954","text":"To be deleted."}],"reward":{"gil":310,"items":[{"num":10,"id":33138}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69579]}},"partials":[{"type":"npc","id":"1036042","obj":{"i":1036042,"n":"Doomsaying Dwarf","l":2954,"q":2}},{"type":"quest","id":"69579","obj":{"i":69579,"n":"Komra Wasn't Built in a Day","g":24,"l":"Kholusia","s":705,"f":1}}]}