{"quest":{"name":"The Merchant of Komra","location":"Kholusia","id":69587,"patch":5.5,"sort":820,"interval":"weekly","repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1036043,"target":1036043,"genre":24,"journal":["The dour dwarf is raring to do his part to help the cause─and for this he needs your help."],"objectives":["Obtain exotic paraphernalia in the Puppets' Bunker.","Deliver the exotic paraphernalia to the dour dwarf."],"dialogue":[{"name":"VILLAGERD03954","text":"To be deleted."},{"name":"VILLAGERB03954","text":"I appreciate you letting me join you...and apologize for my earlier rudeness. Not to make an excuse, but it's been a trying time for us all."},{"name":"VILLAGERB03954","text":"Now, I've been pondering the ways in which I might contribute to the rebuilding effort. While I don't have many talents─not outside of those considered normal for a dwarf such as drinking, at any rate─people do say that I have the gift of the gab."},{"name":"VILLAGERB03954","text":"Using this gift, I've a mind to peddle wares in the outside world to earn coin to put towards our work. There's just one problem: at the moment, we don't have anything that would fetch a halfway decent price."},{"name":"VILLAGERB03954","text":"No, we need something more unusual and exotic than our grog and automata. And as I racked my beard for ideas, it came to me: what could be more unusual and exotic than objects from another world?"},{"name":"VILLAGERB03954","text":"The machines have a base inside the crater, and I understand it's brimming with all manner of their paraphernalia. Such items are guaranteed to fetch a high price─we just need someone to venture in to retrieve them: you!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"If you're not fussed about what I bring back..."},{"name":"A1","text":"I'm not sure if they'd be worth <span class=\"emphasis\">that</span> much..."},{"name":"VILLAGERB03954","text":"As long as it's unusual, I'm confident I can spin a sales pitch for it. Oh yes, the coinbags of Eulmore would trip over themselves for such rare curios."},{"name":"VILLAGERB03954","text":"So just bring back the items, and leave the rest to me. Our coffers will be full before you know it!"},{"name":"VILLAGERB03954","text":"How fares the search in the crater? Remember, I'm not fussed about what you bring back as long as it's unusual."},{"name":"VILLAGERB03954","text":"Back from the crater, are you? Come, come, show me what you were able to find."},{"name":"VILLAGERB03954","text":"Oho, strange and wondrous items, all! I'll examine everything closely before I attempt to peddle them, but these ought to be snapped up with nary a fuss."},{"name":"VILLAGERB03954","text":"My thanks for bringing these. Now I can do my little part for our village."},{"name":"VILLAGERB03954","text":"Ah, and before I forget, the chief was asking for you earlier. If you have a moment, do go and see what he wants."},{"name":"VILLAGERB03954","text":"To be deleted."},{"name":"VILLAGERB03954","text":"The chief has been asking for you. If you have a moment, do go and see what he wants."},{"name":"VILLAGERD03954","text":"To be deleted."},{"name":"VILLAGERB03954","text":"Ah, I was wondering when you would come by again."},{"name":"VILLAGERB03954","text":"The items you brought back last time are perfect, but I'm hoping to have more stock before I head to Eulmore to do my peddling."},{"name":"VILLAGERB03954","text":"Could I trouble you to go on another foray into the crater?"},{"name":"VILLAGERB03954","text":"With just a few more items from the crater, I'll have enough stock to make it worth setting out to do my peddling. My thanks in advance."},{"name":"VILLAGERB03954","text":"There you are. Were you able to find anything else of interest?"},{"name":"VILLAGERB03954","text":"Marvelous! With the addition of this little lot, I'm now ready to set forth!"},{"name":"VILLAGERB03954","text":"If truth be told, I'm a little daunted by the prospect of going all the way to Eulmore. But if I have confidence in myself─and some grog is always good for that─I'm sure that all will be well."},{"name":"VILLAGERB03954","text":"Oh yes, I'll see to it our wares fetch the best coin they can, and prove to everyone that I'm worth more than the ale I can hold."},{"name":"VILLAGERB03954","text":"Thanks for all your help, my friend. I'll be fine from here, and you can let the chief know as much."},{"name":"VILLAGERB03954","text":"To be deleted."},{"name":"VILLAGERD03954","text":"To be deleted."}],"reward":{"gil":310,"items":[{"num":10,"id":33138}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69581]}},"partials":[{"type":"npc","id":"1036043","obj":{"i":1036043,"n":"Dour Dwarf","l":2954,"q":1}},{"type":"quest","id":"69581","obj":{"i":69581,"n":"Dwarves of a Beard","g":0,"l":"Kholusia","s":0,"f":1}}]}