{"quest":{"name":"How to Catch an Automaton","location":"Kholusia","id":69588,"patch":5.5,"sort":830,"interval":"weekly","repeatable":1,"unlocksFunction":1,"eventIcon":71342,"issuer":1036044,"target":1036044,"genre":24,"journal":["The decisive dwarf regards you with the steely determination of someone who's about to ask a favor."],"objectives":["Use the hempen sack to capture a weakened dwarven automaton.","Deliver the dwarven automaton to the decisive dwarf."],"dialogue":[{"name":"VILLAGERB03954","text":"To be deleted."},{"name":"VILLAGERD03954","text":"To be deleted."},{"name":"VILLAGERC03954","text":"Oh, it's you. I've been meaning to apologize─for my behavior at the meeting."},{"name":"VILLAGERC03954","text":"For all my bluster, I had nothing to offer. You made me see the hypocrite that I was, and I'm determined to do better."},{"name":"VILLAGERC03954","text":"I'd be lying if I said I wasn't struggling, though..."},{"name":"VILLAGERC03954","text":"We need more automata to help us rebuild, you see, and I thought that we could repurpose the ones we've got guarding the village."},{"name":"VILLAGERC03954","text":"But when I went to shut one down, the blasted thing tried to bash my head in. Barely escaped with my beard, I tell you. Whoever programmed them did their job a little <span class=\"emphasis\">too</span> well..."},{"name":"VILLAGERC03954","text":"You're supposed to be a mighty warrior, though, ain't that right? Think you could subdue an ironbeard for me, just to show how it's done? If I could see it once, I reckon I could deal with them by myself."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Just watch and learn."},{"name":"A1","text":"Oh, all right..."},{"name":"VILLAGERC03954","text":"I'm in your debt. Here, take this sack. You can slip it over an ironbeard to keep it subdued after you've knocked it around enough."},{"name":"VILLAGERB03954","text":"How fares the peddling? Extremely well! The Eulmorans can't get enough of our rare and wondrous wares."},{"name":"VILLAGERD03954","text":"In spite of myself, I have to say that things are coming along nicely. Who would've thought that we could achieve so much by working together instead of bickering?"},{"name":"VILLAGERC03954","text":"In case you weren't sure, the ironbeards patrol the area just west of the village. I'll be watching─from a safe distance."},{"name":"VILLAGERC03954","text":"Bugger my beard, you took care of the automaton so quickly, I would've missed it if I'd blinked!"},{"name":"VILLAGERC03954","text":"Thanks for bringing this thing back, and for the lesson as well. I reckon I've got the trick of it now."},{"name":"VILLAGERC03954","text":"I've also come to realize something: there ain't no action so noble as one that you take for another."},{"name":"VILLAGERC03954","text":"I'll keep that close to my heart, and strive to be someone who strives for others, just like you."},{"name":"VILLAGERC03954","text":"By the way, the chief came looking for you while you were outside the village. It seemed important, so go and see what he wants, eh?"},{"name":"VILLAGERC03954","text":"Have you gone to see the chief yet? It seemed important, so go and see what he wants, eh?"},{"name":"VILLAGERB03954","text":"To be deleted."},{"name":"VILLAGERD03954","text":"To be deleted."},{"name":"VILLAGERD03954","text":"To be deleted."},{"name":"VILLAGERC03954","text":"Ah, it's you again. Thanks to you, we've now got a good lot of automata helping us out, but we could still do with more."},{"name":"VILLAGERC03954","text":"If you're not too busy, do you think you could retrieve another ironbeard for us? Rest assured you won't be doing it alone this time─I'm going to retrieve one too."},{"name":"VILLAGERC03954","text":"When we're done, let's meet back here. Happy deactivating!"},{"name":"VILLAGERB03954","text":"There're still some among us who don't understand the work we're doing. But like you won us over, we can win them over too."},{"name":"VILLAGERD03954","text":"Sometimes, someone will come over and tell me off. “The hells you thinking, playing around with bits of those machines? It's downright creepy!” they'd say."},{"name":"VILLAGERD03954","text":"I don't let it discourage me, though. This is what I've chosen to do, and I'm going to keep doing it, rain, hail, or doom."},{"name":"VILLAGERC03954","text":"Ugh, of all the times to get a cramp... You go on ahead─I'll be on my way as soon as I can... &lt;grunt&gt;"},{"name":"VILLAGERC03954","text":"Whew... It was rough going even with your example, but I managed to shut down an automaton in the end. How about you?"},{"name":"VILLAGERC03954","text":"Great! With these two additional units on duty, I'll be able to spend more time drink─"},{"name":"VILLAGERC03954","text":"Er...I mean, I'll be able to spend more time doing...things. That automata can't do. For the rebuilding. Yes, yes, that's it!"},{"name":"VILLAGERC03954","text":"...Ahem. Thanks to you, I've found something that I can do for Komra. But as helpful as you are, it wouldn't do to rely on you forever. No, from this point on, I want to make sure I can get by on my own when the time comes."},{"name":"VILLAGERC03954","text":"There might be others who could use a hand, though, so you ought to talk to the chief. Thanks again, and be seeing you!"},{"name":"VILLAGERC03954","text":"To be deleted."}],"reward":{"gil":310,"items":[{"num":10,"id":33138}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69583]}},"partials":[{"type":"npc","id":"1036044","obj":{"i":1036044,"n":"Decisive Dwarf","l":2954,"q":1}},{"type":"quest","id":"69583","obj":{"i":69583,"n":"Dwarves of a Beard Freshened","g":0,"l":"Kholusia","s":0,"f":1}}]}