{"quest":{"name":"The Flames of War","location":"Azys Lla","id":69598,"patch":5.5,"sort":470,"icon":112428,"eventIcon":71201,"issuer":1036352,"target":1036376,"genre":10,"journal":["With Lunar Bahamut bound for Paglth'an, G'raha Tia is determined to call upon the aid of your fellow Scions.","Still reeling from the news of Lunar Bahamut's reappearance, you board the <span class=\"emphasis\">Bonanza</span> and set your sights for Ul'dah, where you are to assemble with your fellow Scions. After a restless flight, you enter the Hall of Flames to find Thancred and the others making preparations for what seems certain to be a decisive battle.","Shortly after your arrival, you are met by Nanamo, who reveals that the Immortal Flames have joined the Amalj'aa in the defense of Paglth'an. Yet even with their combined strength, it is plain they will struggle to repel the draconic horde, and so the sultana bids you enter the fray without further delay.","The Immortal Flames have readied an airship to bear you to the front line. Yet even approaching the battlefield is like to be a perilous undertaking, with the skies over Paglth'an now host to a swarm of dragons. A swarm led by Lunar Bahamut, whose true might you have yet to measure...<br><br>※To enlist your companion NPCs for this duty, speak with them near the entrance or access Duty Support via the main menu. Use the Duty Finder if you wish to complete the instance alongside fellow players.","Strong though the primal was, you and your comrades were stronger. Now Lunar Bahamut is no more, and the Telophoroi's attempt to conquer Paglth'an has ended in defeat, leaving their routed forces to flee for their lives. With a mixture of triumph and relief, you drag your weary limbs back to Ul'dah to assess the outcome of the battle.","Standing once more in the airship landing, you find your allies somewhat worse for wear, but otherwise unscathed. But while all present have ample cause for celebration, you notice at a glance that Alphinaud has something on his mind.","Registering your concern, Alphinaud explains that he is anxious to learn whether Arenvald has returned from his reconnaissance mission to the tower at Paglth'an. Coinciding as it did with the Telophoroi's attack on the nearby settlement, it is not yet known whether he was able to slip past the enemy undetected."],"objectives":["Speak with Thancred at the Hall of Flames.","Speak with the Immortal Flames pilot at the airship landing in Ul'dah.","Enter Paglth'an.","Speak with Alphinaud."],"dialogue":[{"name":"ALPHINAUD","text":"...Yes. We should rally our forces, and make for Paglth'an with all haste."},{"name":"SECURITYSYSTEM","text":"&lt;bloop&gt; Dragon restraints successfully disengaged. Unable to confirm presence of specimen “Tiamat.” Please seek shelter immediately."},{"name":"ALISAIE","text":"&lt;pant&gt; I'll be fine... Plenty of time to...&lt;pant&gt;...recover on the airship."},{"name":"GRAHATIA","text":"...I have already sent word to the others. We are to rendezvous in Ul'dah, at the Hall of Flames."},{"name":"GRAHATIA","text":"Let us collect Alphinaud, and be on our way."},{"name":"ALPHINAUD","text":"As I am sure you recall, Arenvald and Fordola were bound for Paglth'an. I pray they have not come to any harm..."},{"name":"ALISAIE","text":"If you're worried about me, don't be. I got some rest during the flight, and now I feel ready for anything."},{"name":"GRAHATIA","text":"First the spate of abductions, and now an attack on the Amalj'aa homeland... What do the Telophoroi aim to achieve with all of this?"},{"name":"URIANGER","text":"Of the foe we face, we know but little. Though time be of the essence, we must not stint in our preparations, lest our haste to fly to the aid of the Amalj'aa cost us our best chance of victory."},{"name":"YSHTOLA","text":"By happy coincidence, Krile and I were in the process of concluding our inquiries when news reached us of Lunar Bahamut's return. There is much to discuss, but it will have to wait."},{"name":"THANCRED","text":"Now, I know some of you could do with a rest, but I'm sorry to say the Telophoroi have other plans. Paglth'an is already under siege."},{"name":"THANCRED","text":"Happily, the Immortal Flames arrived just in time to join the defensive effort─with <span class=\"emphasis\">Marshal Tarupin</span> at their head."},{"name":"ALPHINAUD","text":"Well, now...! Given the failure of the peace negotiations, I was uncertain how the sultanate would respond. 'Tis good to hear that Ul'dah has not abandoned the Amalj'aa."},{"name":"NANAMOULNAMO","text":"(-???-)<span class=\"emphasis\">Abandon</span> them? Did we not profess to be their friends?"},{"name":"ALPHINAUD","text":"Your Grace!"},{"name":"NANAMOULNAMO","text":"Marshal Tarupin had made provisions for such an exigency and was ready to depart at a moment's notice. All that was required was the agreement of the Syndicate─each of whom voted in favor of intervention."},{"name":"NANAMOULNAMO","text":"Nor is Ul'dah alone in its resolve. The other Alliance nations have likewise dispatched their troops to Paglth'an."},{"name":"NANAMOULNAMO","text":"Yet even with our combined strength, we shall be sorely tested. For we face not only the might of an imperial legion, but Lunar Bahamut and his draconic horde besides."},{"name":"ALISAIE","text":"Tiamat's children..."},{"name":"NANAMOULNAMO","text":"Fight as we may, victory is by no means assured. But not all of the omens are grim. Our forces report that despite their proximity to Lunar Bahamut, none of the Amalj'aa show any signs of tempering."},{"name":"YSHTOLA","text":"Strange. What primal would turn down a chance to claim new thralls?"},{"name":"YSHTOLA","text":"...Unless it is <span class=\"emphasis\">incapable</span> of doing so? Primals are not wont to serve a master, Ascian or otherwise. It may well be that Lunar Bahamut differs in some fundamental manner from those we have previously encountered."},{"name":"ALISAIE","text":"If that were true, <span class=\"emphasis\">anyone</span> could fight him. And <span class=\"highlight\">Forename</span> and others like <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> wouldn't have to shoulder the burden alone."},{"name":"NANAMOULNAMO","text":"Be that as it may, Lunar Bahamut remains an incalculably powerful foe whom our soldiers will struggle to best through mere force of arms. With the aid of the <span class=\"emphasis\">Scions</span>, however, I believe they will fare rather better...assuming, that is, you are ready to take the field."},{"name":"NANAMOULNAMO","text":"An airship awaits to bear you to the front. Pray set forth as soon as you are able."},{"name":"NANAMOULNAMO","text":"I, meanwhile, shall continue to coordinate our forces. Till next we meet, may the Twelve bless and keep you."},{"name":"YSHTOLA","text":"It was kind of her to speak with us personally. You may be certain she has no shortage of other responsibilities."},{"name":"THANCRED","text":"Well, I for one am inclined to do as Her Grace requests. Lest we forget, Arenvald and Fordola are in Paglth'an on reconnaissance. The sooner we save the day, the better their chances."},{"name":"ALPHINAUD","text":"Indeed. To the airship then!"},{"name":"ALPHINAUD","text":"It is not impossible that the Telophoroi redirected some of the troops stationed at the tower to the front line... If so, this may all turn out to have been to Arenvald and Fordola's benefit."},{"name":"ALISAIE","text":"Given what we know, some─or perhaps even <span class=\"emphasis\">all</span>─of the imperial soldiers may have been tempered. If we can subdue them, we should be able to do something about that, but they would still see us as enemies even then. That said...they wouldn't be deaf to reason, which is better than nothing."},{"name":"GRAHATIA","text":"Do you think Estinien and Tiamat have already reached Paglth'an? ...Ah, but I should know better than to speculate on the whereabouts of the Azure Dragoon. Forgive me."},{"name":"URIANGER","text":"Lest thou wonder, I have attended to Thancred's ammunition, and completed mine own preparations. I trust thou canst say the same of thine."},{"name":"YSHTOLA","text":"So, the Telophoroi have constructed <span class=\"emphasis\">buildings</span> capable of tempering, and primals which are not? What secrets are they hiding...?"},{"name":"THANCRED","text":"Try as I might, I cannot fathom why the Telophoroi would move to attack the Amalj'aa. If Fandaniel's objective is death and destruction, one of the city-states would surely have been a better target."},{"name":"THANCRED","text":"No, they have some other agenda. One encompassing the recent abductions, perhaps..."},{"name":"FLAMEPILOT04062","text":"Greetings! We've been expecting you."},{"name":"FLAMEPILOT04062","text":"But say the word, and we shall depart for Paglth'an at once."},{"name":"Q1","text":"What will you do?"},{"name":"A1","text":"Small talk."},{"name":"A1","text":"Form a party and depart for Paglth'an."},{"name":"A1","text":"Nothing."},{"name":"ALPHINAUD","text":"By dealing with Lunar Bahamut and his hordes, so too will we render aid to Arenvald and Fordola. Come, let us go!"},{"name":"ALISAIE","text":"Whether he's here or not, we can be sure Fandaniel is behind this attack. And that makes me doubly determined to see that it fails."},{"name":"GRAHATIA","text":"The grasslands of Paglth'an will make for an open battlefield. Many though our enemy are, we will not have to fight against the <span class=\"emphasis\">terrain</span>, at least."},{"name":"URIANGER","text":"At the cost of his own life did Master Louisoix strike down the primal Bahamut. Whatever the true nature of this new incarnation, it cannot be suffered to threaten this star."},{"name":"YSHTOLA","text":"I know not what designs the Telophoroi have on Paglth'an, but I do know they must be stopped, for the good of the Amalj'aa and us all."},{"name":"THANCRED","text":"Like most who have spent time in Ul'dah, I haven't always seen eye to eye with the Amalj'aa. But today I will fight side by side with them in common cause─and hope that none of them remember me."},{"name":"FLAMEPILOT04062","text":"All aboard who're coming aboard!"},{"name":"ALISAIE","text":"From what I could tell, there didn't seem to be many imperials in the vicinity of the tower. Hopefully, Arenvald will have used the opportunity to get in and out undetected."},{"name":"GRAHATIA","text":"Tiamat did all she promised and more this day, but I doubt she will be satisfied. Nay, she will fight on in defense of her children, wheresoever they may be."},{"name":"URIANGER","text":"Though the day is won─thanks in no small part to thy valor─the Telophoroi are far from defeated. Yet be that as it may, 'tis only right that we rejoice in Lunar Bahamut's banishment unto the aether."},{"name":"YSHTOLA","text":"To see the Amalj'aa fighting alongside us brought to mind the Zun of the Crystarium. I pray that our peoples can forge bonds as strong as those of our counterparts in the First."},{"name":"THANCRED","text":"It will take more than a single victory to wash away all the bad blood between men and Amalj'aa...but one has to start somewhere."},{"name":"ESTINIEN","text":"I should have known you'd be the one to end it. Mayhap now Tiamat will find some measure of solace."},{"name":"FLAMEPILOT04062","text":"Is it true? Has Lunar Bahamut been defeated?"},{"name":"ALPHINAUD","text":"While it would be too much to hope that we have seen the last of Fandaniel, we have dealt his schemes a telling blow this day, and that alone is cause to celebrate."},{"name":"ALPHINAUD","text":"And celebrate I will...when we have received word of Arenvald's safe return."},{"name":"SYSTEM","text":"You may now enter Paglth'an with a party of NPC avatars. To make use of this feature, open the <span class=\"highlight\">Trust</span> interface located under <span class=\"highlight\">Duty</span> in the main menu."}],"reward":{"items":[{"id":26728,"one":1},{"id":26729,"one":1},{"id":26730,"one":1}],"instance":77},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69597]},"next":[69599]},"partials":[{"type":"npc","id":"1036352","obj":{"i":1036352,"n":"G'raha Tia","l":2101,"q":2}},{"type":"npc","id":"1036376","obj":{"i":1036376,"n":"Alphinaud","l":40,"q":2}},{"type":"item","id":"26728","obj":{"i":26728,"n":"Heavens' Eye Materia VIII","l":420,"c":20279,"t":58,"materia":{"tier":7,"value":24,"attr":"Direct Hit Rate","category":0}}},{"type":"item","id":"26729","obj":{"i":26729,"n":"Savage Aim Materia VIII","l":420,"c":20279,"t":58,"materia":{"tier":7,"value":24,"attr":"Critical Hit","category":0}}},{"type":"item","id":"26730","obj":{"i":26730,"n":"Savage Might Materia VIII","l":420,"c":20279,"t":58,"materia":{"tier":7,"value":24,"attr":"Determination","category":0}}},{"type":"instance","id":"77","obj":{"i":77,"n":"Paglth'an","c":61801,"t":"Dungeons","min_lvl":80,"max_lvl":80,"min_ilvl":490}},{"type":"quest","id":"69597","obj":{"i":69597,"n":"For Vengeance","g":10,"l":"Azys Lla","s":460}},{"type":"quest","id":"69599","obj":{"i":69599,"n":"When the Dust Settles","g":10,"l":"Ul'dah - Steps of Nald","s":480}}]}