{"quest":{"name":"When the Dust Settles","location":"Ul'dah - Steps of Nald","id":69599,"patch":5.5,"sort":480,"icon":101058,"eventIcon":71201,"issuer":1036376,"target":1036399,"genre":10,"journal":["Alphinaud is minded to share his account of the events that unfolded in Paglth'an with the sultana.","Upon disembarking at the airship landing, you are met by Nanamo, who reveals that one of your friends has been gravely wounded. Realizing at once that she must mean Arenvald, Alphinaud departs for the Phrontistery in visible distress, prompting Alisaie to suggest that you and Estinien go after him.","At the Phrontistery, you are told that the chirurgeons have done all they can for your comrade, but that his fate yet hangs in the balance. When Alphinaud subsequently thanks Fordola for bringing Arenvald back, she lashes out at him, condemning his idealism as naivety. At this, Estinien interjects that those who uphold such ideals are the ones remembered as heroes. Alas, his words seem to fall on deaf ears.","At the sultana's invitation, you join the rest of the Scions in the Fragrant Chamber, hoping to hear the findings of Arenvald and Fordola's ill-fated mission. You duly learn that a creature resembling Ifrit was waiting for them inside the tower, and that further such entities have been sighted in the vicinity of other towers across the realm. Anticipating your response to these grim tidings, Nanamo assures you that the Grand Companies are ready to deal with the threat, and bids you take the opportunity to recuperate from your recent exertions.","Outside the Fragrant Chamber, Thancred notifies those stationed at the Rising Stones by linkpearl that your party will soon be returning. In the ensuing conversation, he learns that Krile has several matters she wishes to discuss, one of them involving Estinien.","Scant moments after welcoming you home, Krile announces her intention to depart for Sharlayan to petition the Forum's aid in uncovering the Telophoroi's true motives; a proposal which raises eyebrows among her fellow Archons, but one to which they ultimately acquiesce. The surprises do not end there, however. Krile also reveals that the investigation she recently conducted alongside Y'shtola concerned the apparent lack of communication between Hydaelyn and Her chosen champion─you. This, she declares, is another question to which she hopes to find answers during her trip. Acknowledging that her departure will leave the Scions a member short, however, she turns at last to Estinien, and invites him once more to join the cause. And, perhaps most surprisingly of all, he accepts.","With Lunar Bahamut slain, and the Scions' ranks bolstered by the presence of a singularly capable new member, now would seem the perfect time to rest and take stock. Though Fandaniel and the Telophoroi remain a threat, you may be sure that Tataru will call upon you when the time comes to face them again."],"objectives":["Speak with the Phrontistery chirurgeon.","Speak with Alphinaud.","Speak with Alisaie.","Return to the Rising Stones.","Speak with Tataru."],"dialogue":[{"name":"ALISAIE","text":"From what I could tell, there didn't seem to be many imperials in the vicinity of the tower. Hopefully, Arenvald and Fordola will have used the opportunity to get in and out undetected."},{"name":"GRAHATIA","text":"Tiamat did all she promised and more this day, but I doubt she will be satisfied. Nay, she will fight on in defense of her children, wheresoever they may be."},{"name":"URIANGER","text":"Though the day is won─thanks in no small part to thy valor─the Telophoroi are far from defeated. Yet be that as it may, 'tis only right that we rejoice in Lunar Bahamut's banishment unto the aether."},{"name":"YSHTOLA","text":"To see the Amalj'aa fighting alongside us brought to mind the Zun we encountered in the Crystarium. I pray that our peoples can forge bonds as strong as those of our counterparts in the First."},{"name":"THANCRED","text":"It will take more than a single victory to wash away all the bad blood between men and Amalj'aa...but one has to start somewhere."},{"name":"ESTINIEN","text":"I should have known you'd be the one to end it. Mayhap now Tiamat will find some measure of solace."},{"name":"FLAMEPILOT04062","text":"Is it true? Has Lunar Bahamut been defeated?"},{"name":"ALPHINAUD","text":"&lt;sigh&gt; Standing around here worrying is not going to help matters. Come, we must discuss the day's events with Pipin and Her Grace."},{"name":"NANAMOULNAMO","text":"(-???-)Brave Scions!"},{"name":"NANAMOULNAMO","text":"Would that I could treat you to a hero's welcome─but I bear urgent news from the Phrontistery."},{"name":"ALPHINAUD","text":"Your Grace! Whatever is the matter?"},{"name":"NANAMOULNAMO","text":"As our troops withdrew from Paglth'an, they came upon the two scouts sent to the nearby tower. I have yet to hear a full account, but it seems that one of them─your friend, I believe─had been wounded, and was being dragged away by the other."},{"name":"ALPHINAUD","text":"Oh no..."},{"name":"ALPHINAUD","text":"I-I must go. Forgive me, Your Grace!"},{"name":"THANCRED","text":"Can you tell us aught of Arenvald's condition, Your Grace? The wounded scout."},{"name":"NANAMOULNAMO","text":"Naught save that it is grave. The chirurgeons tend to him even as we speak."},{"name":"ALISAIE","text":"The infirmary must be inundated with the wounded. If all of us go, we'll only get underfoot. <span class=\"highlight\">Forename</span>, Estinien─would you mind going after Alphinaud? He may need some support─from someone other than me."},{"name":"ESTINIEN","text":"Very well."},{"name":"ALISAIE","text":"Thank you. The rest of us will see that the relevant people know what took place in Paglth'an."},{"name":"ESTINIEN","text":"Come on, then."},{"name":"ESTINIEN","text":"...I take it Alphinaud is fond of Arenvald."},{"name":"ESTINIEN","text":"I know how he feels. But hand-wringing isn't going to help anyone. You had better have a word."},{"name":"ALPHINAUD","text":"Please, tell me something! <span class=\"emphasis\">Anything</span>!"},{"name":"FORDOLA","text":"Instead of standing there gawping, why don't you tell your friend to stop whining like an underfed dog? People are fighting for their lives in there."},{"name":"FRONDALEHEALER04063","text":"Another one come to see the lad in silver armor? Master Damielliot is attending to him as we speak. If you would be so kind as to wait─"},{"name":"ALPHINAUD","text":"What did Master Damielliot say? Tell me his exact words!"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"<span class=\"emphasis\">Enough</span>, Alphinaud. This isn't helping."},{"name":"A2","text":"Let the chirurgeons do their work."},{"name":"ALPHINAUD","text":"But─ ...You're right. Forgive me.<br>&lt;sigh&gt; ...When we said our farewells to Arenvald, I was afraid that something like this might happen, but now that it has..."},{"name":"ALPHINAUD","text":"...All we can do is wait."},{"name":"ESTINIEN","text":"That woman... She plays at scorn, but her eyes are filled with sorrow. Sorrow deep enough to drown in."},{"name":"ALPHINAUD","text":"I know... I know. There is nothing more I can do here. Come, let us rejoin the others."},{"name":"FLAMEHERALD04063","text":"Ahem. Her Grace invites the Scions of the Seventh Dawn to join her in the Fragrant Chamber."},{"name":"FLAMEHERALD04063","text":"Your comrades have already arrived. Will the three of you be joining them?"},{"name":"ALPHINAUD","text":"We will."},{"name":"ALPHINAUD","text":"Though we have won our first battle against the Telophoroi, and made significant discoveries to boot, the war has scarcely begun. We must steel ourselves for what lies ahead."},{"name":"GRAHATIA","text":"Alphinaud knows only too well that sacrifices are an unavoidable part of conflict."},{"name":"GRAHATIA","text":"But knowing something does not change how one feels about it. You yourself have shared adventures with Arenvald, have you not? ...Then I shall say no more."},{"name":"URIANGER","text":"With the secrets of the towers thus laid bare, our duty to prevent further abductions taketh on new import. Fail in this and our enemy shall punish our negligence with a plague of primals."},{"name":"YSHTOLA","text":"Amidst this great push for peace with the beast tribes, we would do well to remember that old prejudices yet remain. It is a delicate political dance, and I do not envy the sultana her task─nor any Alliance leader."},{"name":"THANCRED","text":"Even without the threat of tempering to contend with, the Grand Companies have quite a task on their hands."},{"name":"THANCRED","text":"Regardless of Her Grace's protestations to the contrary, it may be best to dispatch a few of our own to assist in the endeavor. Remind me to mention it to Tataru, would you?"},{"name":"ESTINIEN","text":"If there is no reason to linger, I will take my leave."},{"name":"ALISAIE","text":"Right, then. Unless anyone has any objections, I think it's about time we returned to the Rising Stones."},{"name":"ALISAIE","text":"And that includes you, Alphinaud. Arenvald is in good hands here."},{"name":"ALPHINAUD","text":"...Of course. He would doubtless mock me for pacing about the infirmary."},{"name":"ALPHINAUD","text":"Let us retire, then, that we might regain our strength in readiness for the coming challenges."},{"name":"THANCRED","text":"If all are in agreement, then, I shall let Krile know to expect us. A hot bath and a hearty meal shouldn't be beyond arranging with the time available."},{"name":"ALPHINAUD","text":"It will be good to be home. I have some thinking to do..."},{"name":"THANCRED","text":"Yes, I'll try asking him.<br>...And thank you, I shall look forward to it."},{"name":"THANCRED","text":"Our comrades eagerly await our return. And Krile, in particular, has a few matters she is keen to discuss─one of which concerns <span class=\"emphasis\">you</span>, Estinien, believe it or not. You <span class=\"emphasis\">will</span> join us, won't you?"},{"name":"ESTINIEN","text":"...Fine."},{"name":"ALPHINAUD","text":"...Really? I thought you said you were avoiding “that Baldesion woman.”"},{"name":"ESTINIEN","text":"If I refused, she would only pursue me."},{"name":"ESTINIEN","text":"Let's get this over with, shall we?"},{"name":"ALISAIE","text":"Amidst all the fighting, it's easy to forget what we've achieved, isn't it? I mean...we cured Tiamat. <span class=\"emphasis\">Tiamat</span>, for heavens' sake!<br>...You <span class=\"emphasis\">will</span> tell me if I become insufferably smug, won't you? Because the way things are going, it feels like a definite possibility."},{"name":"TATARU","text":"Well, it looks like I'm going to have a busy few moons─not that they ever seem to be anything but."},{"name":"TATARU","text":"Thancred's got me dispatching troops to every corner of the realm. Which is not to say I don't trust the Alliance, because I do. But when it comes to putting down primals, nobody does it better than us."},{"name":"TATARU","text":"Well, than <span class=\"emphasis\">you lot</span>, more accurately. You won't catch me trading blows with a primal in the near future. But for every fell fiend you vanquish, there's countless meals to arrange, baths to fill, sheets to wash, stores to replenish, and the list goes on."},{"name":"TATARU","text":"Which is where I come in. And gladly, mind you. It's the least I can do to support the Scions who risk life and limb─like poor Arenvald..."},{"name":"TATARU","text":"&lt;sigh&gt; I wish there was something we could do for him. But we'll just have to settle for saying the odd prayer and keeping a roof over our heads."},{"name":"TATARU","text":"It wouldn't do to have him come back to a complete shambles, now would it?"},{"name":"TATARU","text":"...But that's enough of my rambling. Off you go and get some rest. If there are any developments, I promise you'll be the first to know!"}],"reward":{"gil":5000},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69598]},"next":[69600]},"partials":[{"type":"npc","id":"1036376","obj":{"i":1036376,"n":"Alphinaud","l":40,"q":2}},{"type":"npc","id":"1036399","obj":{"i":1036399,"n":"Tataru","l":481,"q":1}},{"type":"quest","id":"69598","obj":{"i":69598,"n":"The Flames of War","g":10,"l":"Azys Lla","s":470}},{"type":"quest","id":"69600","obj":{"i":69600,"n":"The Company We Keep","g":10,"l":"The Rising Stones","s":490}}]}