{"quest":{"name":"Here Be Dragons","location":"The Lochs","id":69595,"patch":5.5,"sort":440,"eventIcon":71201,"issuer":1036330,"target":1036344,"genre":10,"journal":["Alphinaud is keen to track down Estinien."],"objectives":["Speak with Alphinaud in Ishgard.","Speak with Lucia.","Speak with Alisaie at the airship landing.","Speak with Alphinaud in the Delta Quadrant."],"dialogue":[{"name":"ALISAIE","text":"I get the impression Arenvald is a lot more apprehensive than he lets on. He will have been grateful Alphinaud was there to see him off."},{"name":"GRAHATIA","text":"Estinien Wyrmblood, the Azure Dragoon...! His was another name that featured prominently in the history books, and it will be fascinating to meet the man in the flesh."},{"name":"ALPHINAUD","text":"So Estinien was bound for Ishgard..."},{"name":"ALPHINAUD","text":"Whatever it is that brings him home, we must hope it will keep him there long enough for us to find him. Come, there is no time to lose."},{"name":"ALISAIE","text":"Assuming we find him, this will be my first encounter with the famous Estinien. And if he's half the man Alphinaud claims, I fully expect to go weak at the knees. Perhaps do a bit of fainting while I'm at it."},{"name":"GRAHATIA","text":"I have only visited Ishgard once before, after the devastation of the Eighth Umbral Calamity. To see the place in all its former─forgive me─in all its <span class=\"emphasis\">original</span> glory is a tantalizing prospect indeed."},{"name":"ALPHINAUD","text":"All present? Good. Let us split up and search for Estinien."},{"name":"ALISAIE","text":"Since we're relatively new to this place, G'raha and I will look around the open spaces─the squares and markets and whatnot. You and <span class=\"highlight\">Forename</span> can delve into the nooks and crannies."},{"name":"ALPHINAUD","text":"Very well. Let us reconvene at the airship landing later, with or without Estinien. Good luck."},{"name":"ALPHINAUD","text":"I think I shall begin at the Skysteel Manufactory, so perhaps you could try the Congregation? Lucia may well have heard news of our friend's return."},{"name":"ALPHINAUD","text":"It seems like only yesterday that the Dragonsong War was an inescapable fact of life here. And now Ishgard is united in healing the wounds left by centuries of conflict. Perhaps later, there will be time for us to see for ourselves how the restoration is proceeding."},{"name":"ALISAIE","text":"I spied a few Elezen with spears, but they were all Temple Knights. None of whom had seen Estinien."},{"name":"GRAHATIA","text":"Ishgard in its prime... Would that those I left behind could see it too."},{"name":"LUCIA","text":"Good <span class=\"alternative-container\"><span class=\"alternative\">evening</span><span class=\"alternative\">morrow</span><span class=\"alternative\">day</span></span> to you, Warrior of Light. Lord Aymeric sent word that you would be attending the meeting in Ala Mhigo, so I gather you have not come in search of him. To what then do we owe the pleasure of your visit?"},{"name":"LUCIA","text":"I see. No. We were not aware Ser Estinien had returned to Ishgard, but as I expect you remember, he is wont to come and go as he pleases."},{"name":"LUCIA","text":"Mayhap he came seeking an audience with Lord Aymeric, only to find him absent?"},{"name":"LUCIA","text":"In any event, I am afraid I cannot help you. Perhaps one of your companions has fared better."},{"name":"LUCIA","text":"Many who pass through Ishgard do so via the airship landing. Were I you, I should linger there."},{"name":"GRAHATIA","text":"Ser Estinien is every bit as elusive as Urianger suggested."},{"name":"ALISAIE","text":"Not to complain, but I didn't expect to find myself here again <span class=\"emphasis\">quite</span> so soon."},{"name":"GRAHATIA","text":"So this is the Delta Quadrant, where countless dragons yet lie imprisoned...the great Tiamat among them."},{"name":"ESTINIEN","text":"Tiamat summoned Bahamut once before. She may have again─willfully or no."},{"name":"ALPHINAUD","text":"It has been quite some time since last I set foot in Azys Lla, but I understand the three of you were here rather more recently. I don't suppose you chanced to meet with Tiamat during your visit?"},{"name":"GRAHATIA","text":"Alas not. We had no cause to set foot here in the Delta Quadrant. But I <span class=\"emphasis\">have</span> studied the relevant records─which is not to say I wouldn't appreciate a firsthand account of your dealings with her."},{"name":"ALISAIE","text":"Well then, <span class=\"highlight\">Forename</span> is the person to ask. As far as I know, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span>'s the only one of us to have met Tiamat face-to-face."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Even now, she remains a prisoner of the Allagan Empire."},{"name":"A2","text":"Let's just say, it helped that Midgardsormr was there to introduce me."},{"name":"A3","text":"..."},{"name":"ALISAIE","text":"Ever since the end of the war with Meracydia, yes. &lt;sigh&gt; To have been held captive for so long..."},{"name":"GRAHATIA","text":"Ah, yes! You were a friend of her father!"},{"name":"ALISAIE","text":"Some things are hard to put into words. I can only imagine what it must have been like to be the first mortal to speak with her after all that time..."},{"name":"ESTINIEN","text":"I too have met with Tiamat."},{"name":"ESTINIEN","text":"After the Dragonsong War came to a close, I came here to speak with her─a wyrm who had fought her own war against man in another age."},{"name":"ESTINIEN","text":"I wished to know if she yet harbored thoughts of vengeance, and asked as much. She said no."},{"name":"ESTINIEN","text":"\"My hatred for your kind was extinguished long ago.“"},{"name":"ESTINIEN","text":"But the guilt she feels for resurrecting Bahamut burns on undimmed. It <span class=\"emphasis\">torments</span> her, even now."},{"name":"ALPHINAUD","text":"...I see. Then your original reason for coming here was out of <span class=\"emphasis\">concern</span> that Tiamat had been forced to summon Bahamut."},{"name":"ESTINIEN","text":"Nidhogg is a part of me. I feel his emotions as my own. And I know that he would not allow his sister to be made a tool of evil."},{"name":"ESTINIEN","text":"In his absence, it falls to me to watch over her."}],"reward":{"items":[{"num":3,"id":31898,"one":1,"hq":1},{"num":3,"id":31899,"one":1,"hq":1},{"num":3,"id":31905,"one":1,"hq":1},{"num":2,"id":5825,"one":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69594]},"next":[69596]},"partials":[{"type":"npc","id":"1036330","obj":{"i":1036330,"n":"Alphinaud","l":2408,"q":1}},{"type":"npc","id":"1036344","obj":{"i":1036344,"n":"Alphinaud","l":2101,"q":1}},{"type":"item","id":"31898","obj":{"i":31898,"n":"Pizza","l":510,"c":24034,"t":46}},{"type":"item","id":"31899","obj":{"i":31899,"n":"Mist Spinach Quiche","l":510,"c":24252,"t":46}},{"type":"item","id":"31905","obj":{"i":31905,"n":"Twilight Popoto Salad","l":510,"c":24164,"t":46}},{"type":"item","id":"5825","obj":{"i":5825,"n":"Allagan Silver Piece","l":25,"c":26001,"t":61}},{"type":"quest","id":"69594","obj":{"i":69594,"n":"Unto the Breach","g":10,"l":"The Rising Stones","s":430}},{"type":"quest","id":"69596","obj":{"i":69596,"n":"Righteous Indignation","g":10,"l":"Azys Lla","s":450}}]}