{"quest":{"name":"The Dragon Made","location":"The Lochs","id":69593,"patch":5.5,"sort":9000,"eventIcon":71221,"issuer":1032764,"genre":106,"journal":["The warmachina fanatic appears to burn with unsatisfied curiosity.","You learn from an Ironworks engineer of the existence of an incredible mechanical dragon. Assuming his hastily attached signal emitter is functioning correctly, the “wyrm-machina” can be found somewhere on the floating mass of Azys Lla.","Your search of Azys Lla is interrupted by the familiar figure of the wandering minstrel. In typical extravagant fashion, he regales you with a tale told to him by a fellow traveler─of the legend of Landerwaffe, an ancient masterpiece of Allag which has hunted down through the ages for a suitable master. In light of your command of a multitude of gwibers, the minstrel seems convinced that the mechanical dragon will heed your call. With the instrument of its summoning in hand, you have only to blow a single shrill call from the deck of the Flagship.","True to the lore, the call of your flute has indeed been answered by the wondrous and lustrous Landerwaffe. The wandering minstrel is so moved by the sight that he composes a verse on the spot, immortalizing the moment in which machina and master stand poised to begin a whole new chapter of grand adventure. Even fate itself must bend before the mighty partnership of the Shadowmaker and the Dragon Made!"],"objectives":["Search for the “wyrm-machina” on Azys Lla.","Head to the Flagship and blow the Landerwaffe flute at the designated location."],"dialogue":[{"name":"WEAPONSGIENGINEER","text":"Such beauty... Such power... A true masterpiece in motion!"},{"name":"WEAPONSGIENGINEER","text":"Oh! Greetings, <span class=\"highlight\">Forename</span>, we weren't expecting─ Well, seeing as you <span class=\"emphasis\">are</span> here now, I should take advantage of my good fortune."},{"name":"WEAPONSGIENGINEER","text":"It flew right above me several days ago, you see, and I haven't stopped thinking about it since. Er, “it” being a shiny black dragon."},{"name":"WEAPONSGIENGINEER","text":"Not one of those Dravanian beasts, you understand. And I'm fairly certain─at least ninety-five percent─that it wasn't the primal Bahamut. Before you ask, “then what was it!?” well, that's exactly what I'd like to find out!"},{"name":"WEAPONSGIENGINEER","text":"I do have a working theory, of course. It was only in view for a few moments, but I definitely saw flames shooting out from behind when the dragon accelerated...which was obviously some method of propulsion wherein an ignited fuel source was directed through an exhaust system to provide additional thrust, thereby─"},{"name":"WEAPONSGIENGINEER","text":"...Oh, was I babbling again? I seem to make a habit of it."},{"name":"WEAPONSGIENGINEER","text":"Anyway, my point is that this was no living, breathing creature. I was witness to a mechanical creation─a wyrm-machina, if you will."},{"name":"WEAPONSGIENGINEER","text":"I just <span class=\"emphasis\">had</span> to know more. Even as my mind screamed “What in Cid's spare parts drawer is that!?” my hand moved on pure instinct, grabbing a signal emitter and hurling it at the thing's gleaming underbelly. I must have lodged it in between the scales or something, because my instruments now show a reading to the northwest of here...at an extremely high altitude."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"...Are you saying it's on Azys Lla?"},{"name":"A1","text":"Which means...?"},{"name":"WEAPONSGIENGINEER","text":"Exactly! There's no other possibility...unless you're aware of some other floating fortress in the Sea of Clouds?"},{"name":"WEAPONSGIENGINEER","text":"Don't you see!? It <span class=\"emphasis\">must</span> be on Azys Lla! ...Unless you're aware of some other floating fortress in the Sea of Clouds?"},{"name":"WEAPONSGIENGINEER","text":"Please, <span class=\"highlight\">Forename</span>, the next time your travels take you up there, I'd consider it a personal favor if you could track down that mechanical marvel. It was just so incredibly well made..."},{"name":"WEAPONSGIENGINEER","text":"I'd go myself if I could, but you know how Jessie is─our deputy president's not one to authorize funds for “frivolous self-indulgence,” as she puts it... Argh, it's so frustrating!"},{"name":"WANDERINGMINSTREL","text":"(-???-)And lo, once more do our paths cross, O tamer of legends. Are you, perchance, in the midst of some great adventure?"},{"name":"WANDERINGMINSTREL","text":"(-???-)And lo, once more do our paths cross, O matchless champion. Are you, perchance, in the midst of some great adventure?"},{"name":"WANDERINGMINSTREL","text":"...And you heard this from an Ironworks engineer? But how miraculous! A fellow traveler shared with me the legend of a mechanical dragon─strikingly similar to the one which you describe─and the tale perforce led me here."},{"name":"WANDERINGMINSTREL","text":"Its name, I am told, is “Landerwaffe,” an exquisite artifice of ancient Allag. It has roamed the skies for years uncounted, searching for a master worthy of its onyx wings."},{"name":"WANDERINGMINSTREL","text":"According to the lore as it is written, Landerwaffe will not submit to any but <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> who commands a multitude of gwibers. Alas, I can lay claim to no such authority...but mayhap you can?"},{"name":"WANDERINGMINSTREL","text":"...You have <span class=\"emphasis\">seven</span> such entities at your beck and call!? Why, I could pen an epic ballad based on that feat alone!"},{"name":"WANDERINGMINSTREL","text":"Yes! I must yield unto you the flute, which the traveler yielded unto me. Should a worthy master blow into this fated instrument, 'tis said to emit a shrill, mechanical note─a summons Landerwaffe is unable to deny."},{"name":"WANDERINGMINSTREL","text":"Take yourself now to the heart of Azys Lla, and make that flute sing. I sense the Flagship is where a new bond shall be forged and a new chapter in your saga begun!"},{"name":"WANDERINGMINSTREL","text":"A truly mesmerizing plateau... Down through the endless halls of history has Landerwaffe flown, hunting from horizon to horizon for a single soul full of bright promise."},{"name":"WANDERINGMINSTREL","text":"And now has this unrivaled creation at long last found its master. 'Tis under <span class=\"emphasis\">your</span> steady hand that it has chosen to serve!"},{"name":"WANDERINGMINSTREL","text":"Here, in this place, have nine shining lights come together across boundaries unimaginable, as if some great will commanded your convergence."},{"name":"WANDERINGMINSTREL","text":"The drake of darkened steel, countless centuries endured,♪<br>A meeting long desired, yet its certainty obscured.♪<br>Beyond the veil of time and space, a champion awaited,♪<br>This brilliant soul illumed the night, a guide to bonding fated.♪"},{"name":"WANDERINGMINSTREL","text":"Forgive me! It seems that verse tumbles from my lips unbidden whenever I am in your presence. I shall call this new composition...<span class=\"emphasis\">The Shadowmaker and the Dragon Made</span>!"},{"name":"WANDERINGMINSTREL","text":"Truly, no matter how many words I sing, they can never encompass the enormity of your accomplishments. Not content with taming a legendary auspice, you go on to master this ancient wonder..."},{"name":"WANDERINGMINSTREL","text":"I tremble in anticipation of the stories you shall create together. May your fantastical steed bear you towards new and ever greater adventure!"},{"name":"WANDERINGMINSTREL","text":"How I tremble in anticipation of the stories you shall create together. Ah, but you must be eager to take to the skies! May your fantastical steed bear you towards new and ever greater adventure!"},{"name":"WANDERINGMINSTREL","text":"And worry not for your engineer friend. I shall personally─and lyrically─inform him of the spectacle which took place here!"}],"reward":{"items":[{"id":33218}]}},"partials":[{"type":"npc","id":"1032764","obj":{"i":1032764,"n":"Warmachina Fanatic","l":2408,"q":2}},{"type":"item","id":"33218","obj":{"i":33218,"n":"Landerwaffe Flute","l":1,"c":26038,"t":63}}]}