{"quest":{"name":"Righteous Indignation","location":"Azys Lla","id":69596,"patch":5.5,"sort":450,"eventIcon":71201,"issuer":1036346,"target":1036357,"genre":10,"journal":["Estinien is ready to lead the way to Tiamat."],"objectives":["Proceed to the designated location.","Speak with G'raha Tia.","Speak with Alphinaud at the Flagship.","Search for the necessary Allagan node.","Speak with Alphinaud.","Use the field trial spirit vessel to access the clamorous node."],"dialogue":[{"name":"ALPHINAUD","text":"It was the Ascians who taught Tiamat the secrets of summoning...even as they supplied the Allagans with the means to capture primals. So much suffering, all of it by design."},{"name":"ALISAIE","text":"Our grandfather sacrificed everything to protect the realm from Bahamut. We must be prepared to do the same."},{"name":"GRAHATIA","text":"The Azure Dragoons of history were the mortal enemies of the dragons. Yet now they would be hard-pressed to find a soul who understood them better."},{"name":"ESTINIEN","text":"Tiamat awaits. This way."},{"name":"ALPHINAUD","text":"Resigned to her fate though she may be, I cannot help but feel that we may be able to help Tiamat...would she only let us."},{"name":"ALISAIE","text":"To think that man is responsible for all this─and so much else that dragonkind has suffered..."},{"name":"GRAHATIA","text":"So this is one of the seven great wyrms... Even thus confined, her presence is...overwhelming."},{"name":"ESTINIEN","text":"..."},{"name":"ALPHINAUD","text":"I confess, my heart was in my throat when Estinien thought to berate her, but it appears to have had the desired effect."},{"name":"ALISAIE","text":"It won't make up for what she's suffered at the hands of men, but if there's a chance we can free her─<span class=\"emphasis\">truly</span> free her─we owe it to her to try."},{"name":"ESTINIEN","text":"It would seem she still has some pride after all. Let's see if she's as good as her word."},{"name":"GRAHATIA","text":"While porxies have been shown to be effective in curing the tempered, Tiamat must be considered a special case."},{"name":"GRAHATIA","text":"She is far, far larger─and immeasurably more powerful─than any subject treated thus far. Were we to remove her restraints only to find that the process had failed, we would be hard-pressed to contain her."},{"name":"ALISAIE","text":"Then...before going ahead, we should learn as much as we can about the exact nature of her condition. Do you suppose we can find that information here?"},{"name":"GRAHATIA","text":"Why, yes...we can! We can indeed! The Allagans kept detailed records on all of their notable captives, and I know exactly where to look."},{"name":"ALPHINAUD","text":"We shall leave that to you, then. In the meantime, the rest of us can turn our thoughts to the removal of those shackles."},{"name":"ESTINIEN","text":"I know Alphinaud and <span class=\"highlight\">Forename</span> here well enough─but not you. Are you certain you're ready to see this through?"},{"name":"GRAHATIA","text":"Rest assured, Ser Estinien, that I am both ready and willing to give my all for the sake of this star─though that is not my only reason for wanting to set Tiamat free."},{"name":"GRAHATIA","text":"While I do not claim to know all of her sorrows, I too once found myself in a prison of despair. And I well understand how hard it can be to dare to dream of escape."},{"name":"GRAHATIA","text":"It took the encouragement of braver souls than I am to make me take the first step towards a brighter future. And now I would help Tiamat do the same."},{"name":"ESTINIEN","text":"I gather you are not as young as you look."},{"name":"GRAHATIA","text":"Mayhap when our work here is done, we could trade tales over a pot of Tataru's famous tea?"},{"name":"ESTINIEN","text":"And be indebted to her for the leaves and hot water? I think not."},{"name":"GRAHATIA","text":"...I see. Ahem! Returning swiftly to the task at hand, then..."},{"name":"GRAHATIA","text":"I believe the nodes governing Tiamat's restraints are located in the sector known as the Flagship."},{"name":"ALPHINAUD","text":"Ah yes. We are familiar with it. The Aetherochemical Research Facility in particular."},{"name":"GRAHATIA","text":"Oh, you may wish to take this. A spirit vessel, containing a small amount of my blood."},{"name":"ALISAIE","text":"...Which you just happened to be carrying around with you."},{"name":"GRAHATIA","text":"I suppose that could seem rather odd. To explain, Rammbroes, Urianger, and I are researching the use of spirit vessels in the transference not only of memories, but the traits of certain bloodlines. And so I keep one at the ready should an opportunity to test our theories arise."},{"name":"GRAHATIA","text":"As for its use to you, you may recall that during our <span class=\"emphasis\">previous</span> visit, the nodes here granted access to restricted functions, having identified me as being of royal blood. And armed with that spirit vessel, I posit that they will do the same for you, even in the absence of, well, the rest of me. It seemed worth a try, at least."},{"name":"ALPHINAUD","text":"Agreed. We will take good care of it."},{"name":"ALPHINAUD","text":"To the Flagship, then!"},{"name":"ALISAIE","text":"It's possible the restraints may have mitigated the effects of her tempering, but Tiamat has been in thrall to Bahamut for <span class=\"emphasis\">thousands</span> of years. To have clung on to her reason through it all says a lot for her strength of will. More than a lot."},{"name":"GRAHATIA","text":"Alisaie and I shall remain here and attend to necessary preparations. In the event that the spirit vessel fails to work as expected, you know where to find me. Good luck."},{"name":"ESTINIEN","text":"I would rather leave these Allagan contraptions to you and Alphinaud..."},{"name":"ALPHINAUD","text":"Let us split up and search the Flagship for the node that controls Tiamat's restraints."},{"name":"ALPHINAUD","text":"But should you find a likely candidate, do not be tempted to make any adjustments; it would not do to accidentally release some manner of experimental monstrosity, nor less Tiamat herself in her current state. Our objective at this stage is simply to identify the relevant node or nodes. Once we have learned what we can, we should reconvene and compare notes prior to proceeding."},{"name":"ALPHINAUD","text":"I realize I've said this before─and on more than one occasion─but I never cease to be amazed by Allagan technology. Amazed and disturbed."},{"name":"ESTINIEN","text":"These...nodes, or whatever it is you call them─why do they quiver so?"},{"name":"ALLAGANSYSTEMA04060","text":"BZZZT... Friction between metallic components detected... Temperature increasing to critical levels... Please replace damaged parts or retreat to a safe distance... BZZZT..."},{"name":"SECURITYSYSTEM","text":"&lt;blip&gt; &lt;bloop&gt; WARNING. Scheduled dragon restraint maintenance due in: –2,020 years. Failure to verify system integrity may result in unscheduled specimen release."},{"name":"ALLAGANSYSTEMB04060","text":"KRRR... Data link with Delta Quadrant broken. Possible cause: intruder interference. Advise deployment of automated combat units. Proceed?"},{"name":"ALLAGANSYSTEMA04060","text":"BZZZT... Friction between metallic components detected... Temperature increasing to critical levels... Please replace damaged parts or retreat to a safe distance... BZZZT..."},{"name":"SECURITYSYSTEM","text":"&lt;blip&gt; &lt;bloop&gt; WARNING. Scheduled dragon restraint maintenance due in: –2,020 years. Failure to verify system integrity may result in unscheduled specimen release."},{"name":"ALLAGANSYSTEMB04060","text":"KRRR... Data link with Delta Quadrant broken. Possible cause: intruder interference. Advise deployment of automated combat units. Proceed?"},{"name":"ESTINIEN","text":"Infernal things... One of them sent a swarm of mechanical vilekin to plague me. I must have angered it..."},{"name":"ALPHINAUD","text":"I am afraid Estinien and I have little to show for our efforts. Did you find anything?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I did! A node which smelled like burned hair!"},{"name":"A2","text":"Yes. A chirruping node which spontaneously warned me about neglecting the <span class=\"emphasis\">dragon restraints</span>."},{"name":"A3","text":"I, uh...found a way to activate mechanical sentries if that's any help?"},{"name":"A4","text":"No."},{"name":"ESTINIEN","text":"Hmph. I know the one─though I thought the stench more akin to a fire in a manure shed. But it seemed likelier to explode than grant our wish. Surely there must be another?"},{"name":"ALPHINAUD","text":"<span class=\"emphasis\">Spontaneously</span>, you say? Well, that does sound promising. Almost suspiciously so, in fact..."},{"name":"ALPHINAUD","text":"Only if they are willing to lead us to the node we seek...which I somehow doubt. But from what I recall of the Flagship's design, the node you found <span class=\"emphasis\">could</span> facilitate communications throughout Azys Lla, so we may yet find a use for it."},{"name":"ALPHINAUD","text":"But then you <span class=\"emphasis\">were</span> in possession of the spirit vessel... Hm. I daresay it is indeed the node of which G'raha spoke."},{"name":"ALPHINAUD","text":"And it was “chirruping,” you say? Very well, let us take a closer look."},{"name":"ALPHINAUD","text":"As I suspected, the node will not acknowledge my authority to issue it instructions."},{"name":"ESTINIEN","text":"How did the Allagans tell these godsforsaken things apart?"},{"name":"SECURITYSYSTEM","text":"&lt;blip&gt; Do you wish to operate the dragon restraint mechanisms?"},{"name":"SECURITYSYSTEM","text":"&lt;blip&gt; &lt;bloop&gt; You do not have the requisite access privileges. Operation of the dragon restraint mechanisms may only be undertaken by the chief technologist and members of the royal family."},{"name":"ALPHINAUD","text":"Or those with a vessel full of royal blood, perhaps."},{"name":"SECURITYSYSTEM","text":"(-Restrainment Node-)&lt;blip&gt; New user detected. Commencing biometric authentication..."},{"name":"SECURITYSYSTEM","text":"(-Restrainment Node-)&lt;bloop&gt; Authentication complete. User identified as: member of the royal family. Please state your name."},{"name":"Q2","text":"What will you say?"},{"name":"A1","text":"<span class=\"highlight\">Forename Surname</span>."},{"name":"A2","text":"Alphinaud Leveilleur."},{"name":"A3","text":"Estinien Wyrmblood."},{"name":"SECURITYSYSTEM","text":"(-Restrainment Node-)&lt;bloop&gt; Welcome, <span class=\"highlight\">Forename Surname</span>. You may operate the dragon restraint mechanisms when ready."},{"name":"ALPHINAUD","text":"But─ But that's just confusing! Amusing as you may find my name, I must ask that you use <span class=\"highlight\">Forename Surname</span>. Please."},{"name":"SECURITYSYSTEM","text":"(-Restrainment Node-)&lt;bloop&gt; User name changed. Welcome, <span class=\"highlight\">Forename Surname</span>. You may operate the dragon restraint mechanisms when ready."},{"name":"ESTINIEN","text":"...Very funny. But if that <span class=\"emphasis\">thing</span> speaks my name, I shall see that it never speaks again. Use your own. <span class=\"highlight\">Forename Surname</span>, in case you've forgotten."},{"name":"SECURITYSYSTEM","text":"(-Restrainment Node-)&lt;bloop&gt; User name changed. Welcome, <span class=\"highlight\">Forename Surname</span>. You may operate the dragon restraint mechanisms when ready."},{"name":"SECURITYSYSTEM","text":"(-Restrainment Node-)&lt;blip&gt; &lt;bloop&gt; Error: Unable to disengage restraints of the specimen “Tiamat.” A system update is required."},{"name":"ALPHINAUD","text":"...A “system update”? What do you suppose it is asking of us?"},{"name":"Q3","text":"What will you say?"},{"name":"A1","text":"I...<span class=\"emphasis\">could</span> hazard a guess."},{"name":"A2","text":"To smash it to pieces..."},{"name":"ESTINIEN","text":"Well, that's more than I can say. Confounded bloody thing..."},{"name":"ESTINIEN","text":"Now that I <span class=\"emphasis\">do</span> understand. You can go first."},{"name":"SECURITYSYSTEM","text":"(-Restrainment Node-)User agitation detected. Initiating guidance program...<br>&lt;bloop&gt; In order to operate the restraint mechanism, I require access to the central control system. However, I am unable to establish a link to said system due to the obsolescence of my own software."},{"name":"SECURITYSYSTEM","text":"(-Restrainment Node-)This issue can be resolved by applying a system update using the corresponding terminal located within the Flagship."},{"name":"ESTINIEN","text":"So can this thing release the restraints or not?"},{"name":"ALPHINAUD","text":"It <span class=\"emphasis\">can</span>─but only once it has received the requisite “system update,” as far as I can tell."},{"name":"ESTINIEN","text":"...Until which time it'll float there spewing nonsense?"},{"name":"SECURITYSYSTEM","text":"(-Restrainment Node-)User dissatisfaction detected. Initiating placation protocols...<br>&lt;bloop&gt; I am here to help! Rest assured that I will be on hand to guide you through every step of the system update process!"},{"name":"ALPHINAUD","text":"How...gratifying. But I daresay we will fare better <span class=\"emphasis\">with</span> guidance than without it."}],"reward":{"gil":1175},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69595]},"next":[69597]},"partials":[{"type":"npc","id":"1036346","obj":{"i":1036346,"n":"Estinien","l":2101,"q":1}},{"type":"npc","id":"1036357","obj":{"i":1036357,"n":"Clamorous Node","l":2101,"q":1}},{"type":"quest","id":"69595","obj":{"i":69595,"n":"Here Be Dragons","g":10,"l":"The Lochs","s":440}},{"type":"quest","id":"69597","obj":{"i":69597,"n":"For Vengeance","g":10,"l":"Azys Lla","s":460}}]}