{"quest":{"name":"Unto the Breach","location":"The Rising Stones","id":69594,"patch":5.5,"sort":430,"icon":101056,"eventIcon":71201,"issuer":1035613,"target":1036329,"genre":10,"journal":["Alisaie is waiting patiently for the return of certain Scions─not least of all, you.","His reconnaissance mission complete, Thancred makes his long-awaited return to the Rising Stones bearing strange tidings from the imperial capital. When Alisaie inquires as to the whereabouts of his traveling companion, he explains that Urianger has gone to speak with the Alliance leaders in Ala Mhigo, where a meeting is being convened to discuss how best to proceed.","During your reunion with Urianger in Ala Mhigo, you are joined by Arenvald, who it seems also has business in the city. After an endearingly brotherly exchange with Alphinaud, he leaves you to take part in the meeting. There, Lyse relays a shocking tale. Resistance scouts sent to investigate the tower that had recently appeared nearby subsequently attempted to murder their comrades, having apparently been turned into fanatical servants of Garlemald─or, more accurately, <span class=\"emphasis\">tempered</span>. It is at this point that Raubahn reveals his intention to send a second party to the tower in the form of Arenvald and Fordola, both of whom are immune to the effects of tempering. Alphinaud is clearly apprehensive about Arenvald's involvement in this dangerous undertaking, and the pair agree to discuss the matter when the meeting is over.","Despite Alphinaud's warnings, Arenvald expresses his determination to participate in the mission. While he and Fordola investigate the tower in Paglth'an, Alphinaud suggests you pursue Lunar Bahamut, but before he can continue, he is interrupted by a linkpearl call from Tataru. In flustered tones, she reports that she and Krile recently succeeded in catching up with Estinien, though he departed for Ishgard as soon as they informed him of the reappearance of the elder primal. As there are few more experienced in matters draconic, you decide to give chase in the hope of enlisting his help."],"objectives":["Speak with Urianger in the Ala Mhigan Quarter.","Speak with Arenvald."],"dialogue":[{"name":"ALISAIE","text":"Good news, <span class=\"highlight\">Forename</span>! Thancred and Urianger have finished their tour of Garlemald, and are on their way back here even as we speak."},{"name":"ALISAIE","text":"As we still haven't heard anything on the towers from the Alliance, I'm hoping they might be able to shed some light on things."},{"name":"ALISAIE","text":"They're due to arrive any moment now, so let's see what they have to say, eh?"},{"name":"THANCRED","text":"Ah, a welcoming party. You needn't have gone to the trouble. From what I hear, you've been more than busy enough as it is."},{"name":"THANCRED","text":"Honestly, you might have waited for me to return before discovering a cure for tempering. As it is, I can't even <span class=\"emphasis\">pretend</span> to have been involved!"},{"name":"ALPHINAUD","text":"Well, if it's any consolation, I myself was little more than a spectator. The lion's share of the credit must go to Alisaie, G'raha, and <span class=\"highlight\">Forename</span>. But I believe I speak for the rest of us when I say we are proud to have rendered what little assistance we could."},{"name":"ALISAIE","text":"As you will <span class=\"emphasis\">also</span> have heard, though, it hasn't all been tales of triumph. Just as we were taking a step towards finally addressing the primal threat, a pile of fresh problems landed in our lap."},{"name":"ALISAIE","text":"Anyway, it's good to have you back. Though I can't help noticing that we're one Urianger short of a scouting party. You haven't lost him, have you?"},{"name":"THANCRED","text":"Oh, I couldn't lose him if I tried. And I did try. Repeatedly. But no, he decided to linger in Ala Mhigo to apprise Raubahn and the others of how the land lies in Garlemald."},{"name":"YSHTOLA","text":"Then mayhap you would do the same for us."},{"name":"THANCRED","text":"Indeed. It was just as Lyse said. Worse, in fact. Devastation as far as the eye could see."},{"name":"THANCRED","text":"Nerva and the IIIrd, however, were notable by their absence."},{"name":"ALPHINAUD","text":"Might they have met their end at the hands of Zenos and Fandaniel?"},{"name":"THANCRED","text":"Perhaps. Or perhaps they simply lost the will to fight."},{"name":"THANCRED","text":"You see, the capital has been plunged into a deathly silence, with one exception: the imperial palace."},{"name":"THANCRED","text":"It was a busy place before the war, but it has grown busier still, with throngs of soldiers and civilians working there day and night to rebuild─or rather, transform it."},{"name":"ALISAIE","text":"Transform it? Into what?"},{"name":"THANCRED","text":"That...is a difficult question to answer. The construction is vast and unsettling to behold, like something from a nightmare. According to Urianger, certain aspects of its design were clearly devised with the manipulation of aether in mind. Magitek, in other words."},{"name":"THANCRED","text":"Yet as unnerving as said edifice was, it was nothing next to the sight of its builders. They swarmed the place like so many insects, working with nary a word exchanged between them. No one overseeing construction, no one barking orders. It was as if they were possessed...or tempered."},{"name":"THANCRED","text":"We wanted to investigate more closely, but given our suspicions, it seemed wiser not to take the risk."},{"name":"ALPHINAUD","text":"Hmm... If Fandaniel could bind Bahamut to his will, might he have done the same to the people of Garlemald?"},{"name":"ALPHINAUD","text":"Whatever the truth may be, this information is certain to prove valuable. You have our thanks."},{"name":"THANCRED","text":"Well, be sure to save some for Urianger. Which reminds me, I have a message from Ala Mhigo."},{"name":"THANCRED","text":"Raubahn is hosting a meeting to discuss the latest findings on the towers, and he requested our presence."},{"name":"ALPHINAUD","text":"Then why not leave that to us? You must be weary from your mission."},{"name":"THANCRED","text":"No, no, I'm fine. Those towers have been on my mind since I first spied one on the way back, and I'm keen to get to the bottom of this."},{"name":"YSHTOLA","text":"In that case, I shall stay and begin looking into another matter, as I promised Krile. We need not <span class=\"emphasis\">all</span> attend."},{"name":"ALPHINAUD","text":"Very well, I suggest the rest of us make our way to Ala Mhigo forthwith. The sooner we leave, the more time we will have to speak with Urianger before the meeting."},{"name":"YSHTOLA","text":"If you are curious to know what I will be doing in your absence, let us speak of it another time. At present, Krile and I have no more than a hypothesis..."},{"name":"ALPHINAUD","text":"While we may safely assume that the Telophoroi are behind the works being carried out on the imperial palace, we can only guess at their purpose."},{"name":"ALISAIE","text":"The Royal Menagerie is still closed to civilians. Fandaniel and his pet certainly left their mark..."},{"name":"GRAHATIA000","text":"I wonder if there have been any developments regarding the Amalj'aa abductions. It can be no mere coincidence that the incidents began occurring just as the towers first appeared."},{"name":"THANCRED","text":"Although I was only in Revenant's Toll a short while, I did manage to squeeze in a brief drink with F'lhaminn. Spring water only, it being a flying visit."},{"name":"URIANGER","text":"My friends. Much and more have I heard of your travails in our absence. Heartened am I to see you all hale and whole."},{"name":"GRAHATIA000","text":"As are we to see you safely returned from your mission, Urianger. I trust Thancred made you feel welcome?"},{"name":"ARENVALD","text":"(-???-)Well, well! If it isn't Alphinaud and his merry band!"},{"name":"ALPHINAUD","text":"Arenvald! Whatever are you doing here? When we spoke via linkpearl, you told me you'd be away on a mission!"},{"name":"ARENVALD","text":"And who's to say this isn't part of it? But enough about that. It's good to see you looking so...similar. I thought you'd have grown a bit taller after a whole year in another world, but apparently not!"},{"name":"ALPHINAUD","text":"Well, I am sorry to disappoint you. While my soul may be a year older, my body has hardly aged─<span class=\"emphasis\">as you are well aware</span>."},{"name":"ALPHINAUD","text":"And may I remind you that we Elezen are known to be late bloomers, especially in terms of our height. Mark my words, the day will come when even a great aurochs such as yourself will crane your neck to meet my eye!"},{"name":"URIANGER","text":"Aye...'twas not until my twentieth summer that I myself outgrew my boyish proportions...though Moenbryda towered over me nonetheless."},{"name":"ALISAIE","text":"Arenvald brings out the best in Alphinaud, doesn't he? They both seem so at ease in each other's company. It's almost endearing."},{"name":"ALPHINAUD","text":"...So what exactly brings you here?"},{"name":"ARENVALD","text":"Oh, Fordola, mostly. We need to go over a few things before we set out."},{"name":"ALPHINAUD","text":"Set out? Wait. Does this have something to do with the towers?"},{"name":"ARENVALD","text":"...Eh? What gave you that impression?"},{"name":"ARENVALD","text":"Actually, tell me later. You've got a meeting to go to. I'll see you afterwards, all right?"},{"name":"ALPHINAUD","text":"If Fordola is going with him, that must mean..."},{"name":"ALPHINAUD","text":"My apologies. As Arenvald rightly pointed out, we have a meeting to attend. Let us be about it."},{"name":"ALPHINAUD","text":"I accept that numbers can prove a hindrance when infiltrating enemy territory, but to send only <span class=\"emphasis\">two</span>?"},{"name":"FORDOLA","text":"If it's small talk you're after, look elsewhere."},{"name":"ARENVALD","text":"Now that it's out in the open, I don't have to keep it under my proverbial hat anymore."}],"reward":{"gil":1851},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69552]},"next":[69595]},"partials":[{"type":"npc","id":"1035613","obj":{"i":1035613,"n":"Alisaie","l":481,"q":1}},{"type":"npc","id":"1036329","obj":{"i":1036329,"n":"Arenvald","l":2408,"q":1}},{"type":"quest","id":"69552","obj":{"i":69552,"n":"Futures Rewritten","g":10,"l":"Outer La Noscea","s":420}},{"type":"quest","id":"69595","obj":{"i":69595,"n":"Here Be Dragons","g":10,"l":"The Lochs","s":440}}]}