{"quest":{"name":"A Poisoned Gift","location":"Idyllshire","id":69606,"patch":6.0,"sort":750,"icon":101095,"unlocksFunction":1,"eventIcon":71341,"issuer":1039249,"target":1039249,"genre":164,"journal":["Lalah Jinjahl wishes to review the situation as it stands.","Though Lalah had assumed that Loifa and his companions were criminals, she is increasingly of the belief that they may instead be victims seeking revenge. Her suspicions are also supported by the fact that, in response to her reports, authorities in Sharlayan reopened their investigation into the rumors of a mad healer who conducted heinous procedures...and confirmed that there was truth to them after all. Moreover, a sage named Guildivain─the man who took Mahaud and Ancel into his care─disappeared from Sharlayan shortly before the fugitives first appeared. On the assumption that Guildivain and the villainous healer are one and the same, and that he has since assumed the guise of Faldrinet, Lalah decides to confront the man. Thus do you set forth for Aleport to seek out the merchant he frequents.","You scarcely set foot in Aleport before a Yellowjacket rushes through the gates, calling for a healer. People have been attacked just outside the walls and are in need of aid, and you and Lalah hasten to the scene.","You arrive to find Loifa and the merchant lying in the dirt, the latter having breathed his last. Though Loifa may still be saved, Lalah hesitates─for it was her mother who died at the hands of his accomplice. At your words, however, she recognizes that there can be no justice without knowing the whole truth, and bids you render aid to the ailing Viera.","You successfully heal Loifa, who confirms that Guildivain and Faldrinet are indeed one and the same. As he did with Mahaud and Ancel, the man lured Loifa away with the promise of a cure for his illness, only to use him as a subject in his twisted experiments. When his crimes were about to be exposed, he fled to Eorzea and continued masquerading as a kind-hearted healer. The three companions had been pursuing him, but found themselves thwarted by you and Lalah at every turn. And now, the villain has spirited Mahaud and Ancel away again. Wishing to save his friends but knowing he cannot do so alone, Loifa tearfully beseeches your help.","Loifa is eager to find and free his friends, but with Guildivain's power being unknowable, Lalah counsels caution. For now, it is decided that you will return to Idyllshire to lay plans.","Having relayed the latest tidings from command, Lalah reveals that the soul crystal in Loifa's possession once belonged to her mother. In her dying moments, she entrusted the crystal to Loifa, and Lalah expresses her hope that he will carry on her legacy, and fight for the future of all lives. As Loifa ponders the purpose of the power he has been given, you continue working to improve your mastery over your own.<br><br>※The next sage quest will be available from Lalah Jinjahl upon reaching level 78."],"objectives":["Speak with Lalah Jinjahl in Aleport.","Speak with Lalah Jinjahl.","Use Diagnosis on Loifa.","Speak with Loifa.","Speak with Lalah Jinjahl in Idyllshire."],"dialogue":[{"name":"LALAHJINJAHL","text":"<span class=\"highlight\">Forename</span>, pray forgive me my earlier bewilderment. If you do not mind, I would review the situation as it stands."},{"name":"LALAHJINJAHL","text":"We have been laboring under the assumption that Loifa and his companions had come to Eorzea to further enhance themselves in their pursuit of forbidden power."},{"name":"LALAHJINJAHL","text":"To that end did they seek to procure muscmaloi, which they would use in conjunction with the stolen soul crystal."},{"name":"LALAHJINJAHL","text":"But it <span class=\"emphasis\">wasn't</span> the muscmaloi that they wanted. No, what they wanted was <span class=\"emphasis\">the man</span> who wanted it─Master Faldrinet."},{"name":"LALAHJINJAHL","text":"Using the herb as a lead, they went to the arboretum in anticipation of their quarry's arrival. And failing to find him there, they made their way to Lost Hope."},{"name":"LALAHJINJAHL","text":"...Such is my theory, at any rate. What do you make of all this?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Loifa and his companions aren't criminals. They're victims."},{"name":"A1","text":"Loifa's a madman─and a fool besides!"},{"name":"LALAHJINJAHL","text":"So you think so too..."},{"name":"LALAHJINJAHL","text":"That bothered you too!? I must confess, I saw a flash of red in that instant...but that is neither here nor there."},{"name":"LALAHJINJAHL","text":"There is something else, <span class=\"highlight\">Forename</span>. The rumors I mentioned, of a Sharlayan healer who conducted heinous procedures on live subjects... After sharing recent developments with command, they reopened the investigation...and have, to our considerable shock and surprise, confirmed that there appears to be some truth to them after all."},{"name":"LALAHJINJAHL","text":"The villain went to great lengths to conceal his operation, and thus did he manage to elude the authorities for years. The man's identity is yet to be conclusively ascertained, but we have a suspect: a sage who disappeared from Sharlayan shortly before our fugitives first appeared. A sage by the name of Guildivain."},{"name":"LALAHJINJAHL","text":"Yes. The same Guildivain who took Mahaud and Ancel into his care, I expect."},{"name":"LALAHJINJAHL","text":"If they were victims of his experiments, then they would have every reason to follow him to the ends of the world..."},{"name":"LALAHJINJAHL","text":"While much of this is conjecture, it goes far towards explaining that which we know."},{"name":"LALAHJINJAHL","text":"So let us proceed on this assumption, and have the truth from the man at the heart of recent incidents: Faldrinet."},{"name":"LALAHJINJAHL","text":"Now, according to the apothecary, 'twas a merchant in Aleport who introduced them. If we find this merchant, we may also find Faldrinet. To Vylbrand!"},{"name":"LALAHJINJAHL","text":"So this is Aleport, one of Vylbrand's foremost trading hubs! Ahhh, how I should like to take in the sights, but that must wait. We have work to do."},{"name":"LALAHJINJAHL","text":"We must try to find this merchant before Faldrinet does. As I recall, the man deals in Thavnairian wares. Let us begin by─"},{"name":"YELLOWJACKET04070","text":"(-???-)Healer! Send for a healer!"},{"name":"YELLOWJACKET04070","text":"You're a healer? Good! We've got us some badly hurt folk just outside. Attacked, by the looks of it. Can you go and tend to them?"},{"name":"YELLOWJACKET04070","text":"Might be as whoever did this is still near, so watch yourselves. I'm goin' to raise the alarm."},{"name":"LALAHJINJAHL","text":"What in the world happened?"},{"name":"LOIFA","text":"Unnngh..."},{"name":"LALAHJINJAHL","text":"We're too late to help the merchant."},{"name":"LALAHJINJAHL","text":"But Loifa... You can still save him..."},{"name":"LALAHJINJAHL","text":"Yet our earlier speculation was simply that─speculation. We do not know for certain what he and his companions seek to accomplish."},{"name":"LALAHJINJAHL","text":"What we <span class=\"emphasis\">do</span> know, however, is that they took a life in Sharlayan. They are murderers."},{"name":"LALAHJINJAHL","text":"I know it is not my place to pass judgment, but..."},{"name":"LALAHJINJAHL","text":"They took her from me. My mother..."},{"name":"LALAHJINJAHL","text":"Hah, he was right. I am a fool. I thought I was strong enough to keep my feelings out of it..."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Loifa protected me. I owe him."},{"name":"A2","text":"Loifa can't tell us anything if he's dead."},{"name":"LALAHJINJAHL","text":"...Yes, I remember. And I understand that the man who took my mother's life was not in his right mind."},{"name":"LALAHJINJAHL","text":"...Yes, yes. We cannot have justice without the truth. For my mother and all others who have suffered not least of all."},{"name":"LALAHJINJAHL","text":"Forgive me my indecision, <span class=\"highlight\">Forename</span>. Please, render Loifa your aid."},{"name":"LALAHJINJAHL","text":"Save his life. You must."},{"name":"LOIFA","text":"Unnngh..."},{"name":"LOIFA","text":"Ungh..."},{"name":"LALAHJINJAHL","text":"Are you all right?"},{"name":"LOIFA","text":"Mahaud and Ancel─where are they!?"},{"name":"LALAHJINJAHL","text":"They were not here when we arrived─only the merchant. It was too late for him, but <span class=\"highlight\">Forename</span> was able to save you."},{"name":"LOIFA","text":"...Hmph."},{"name":"LALAHJINJAHL","text":"Will you tell us what happened? Who was it that attacked you?"},{"name":"LOIFA","text":"Guildivain, who else!? That bastard is still out there because of you! And now..."},{"name":"LALAHJINJAHL","text":"So it is as we had suspected... Faldrinet is Guildivain."},{"name":"LOIFA","text":"Finally ready to accept it, are you?"},{"name":"LOIFA","text":"He can change his face and his name, but there's no changing the monster he is!"},{"name":"LOIFA","text":"Still masquerading as a kind-hearted healer. A wolf in sheep's clothing who preys upon the vulnerable for his vile experiments!"},{"name":"LALAHJINJAHL","text":"So you were indeed his test subjects..."},{"name":"LALAHJINJAHL","text":"I am sorry... Had I known, I...I..."},{"name":"LOIFA","text":"Save your apology─it won't bring Mahaud and Ancel back. When we confronted Guildivain, they shielded me from his magick. He must have taken them."},{"name":"LOIFA","text":"I couldn't do anything. For all the power and the sacrifice, I couldn't do a damn thing..."},{"name":"LALAHJINJAHL","text":"What are you talking about?"},{"name":"LOIFA","text":"...I was born with a disease of the lungs. As I grew, so too did it worsen, until I had but a few moons left to live. It was then that Guildivain appeared before us. Before me and my master."},{"name":"LOIFA","text":"With the wisdom of Sharlayan he could cure me, he said. Having believed for so long that I never had a chance, I wasn't sure how to feel, but my master was...overjoyed. And seeing that joy... For the first time I wanted to live. For him. For me."},{"name":"LOIFA","text":"But we were fooled. In the guise of treatment, Guildivain subjected me to a dangerous procedure to fortify my aether."},{"name":"LOIFA","text":"I wasn't the only one. There were others. So many others... But one after another they disappeared, until only a few of us remained."},{"name":"LOIFA","text":"We who survived had been more than cured. We'd been given unnatural powers. I was twice as strong as any man, and could channel magicks with ease."},{"name":"LOIFA","text":"For all the good it did. I was no match for Guildivain and his tricks. Worse still, I couldn't protect Mahaud and Ancel. If this “life” is my reward for all the suffering and sacrifice, I'd've been better off dead!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Whatever life you have is still a life, and you owe it to the others to make the most of it."},{"name":"A3","text":"Mahaud and Ancel still need you. You can't give up now."},{"name":"LOIFA","text":"...Help me. Please."},{"name":"LOIFA","text":"I want to save them, but I can't do it alone. I need help. So please..."},{"name":"LALAHJINJAHL","text":"I should've listened. Should've been willing to question what I was told. And now, because I wasn't..."},{"name":"LOIFA","text":"If Guildivain went to the trouble of taking Mahaud and Ancel, it can only mean one thing: he means to experiment on them again."},{"name":"LOIFA","text":"We can't let that happen. We have to find and save them!"},{"name":"LALAHJINJAHL","text":"Wait. Even if we manage to ascertain Guildivain's whereabouts, the fact remains that the three of you together couldn't overpower him."},{"name":"LALAHJINJAHL","text":"We cannot expect to fare much better. In all likelihood, he himself is also enhanced."},{"name":"LALAHJINJAHL","text":"If we are to confront him, we must have a foolproof plan. Do you not agree, <span class=\"highlight\">Forename</span>?"},{"name":"LOIFA","text":"Grrr... Very well."},{"name":"LALAHJINJAHL","text":"For now, I ask that you return to Idyllshire. I will join you there after briefing the Yellowjackets on the situation."},{"name":"LOIFA","text":"Please be safe..."},{"name":"LALAHJINJAHL","text":"Tidings from command, <span class=\"highlight\">Forename</span>. They have confirmed that Guildivain used muscmaloi in his procedure. Despite his attempts to destroy all evidence of his crimes, traces of the herb were found in his laboratory."},{"name":"LALAHJINJAHL","text":"Furthermore, no record exists of a healer named Faldrinet. If ever there was any doubt it was a false identity, there is none now."},{"name":"LOIFA","text":"In hindsight, we should have tried to explain everything to you...but we didn't know who to trust."},{"name":"LALAHJINJAHL","text":"Even if you had attempted to convince me, I doubt I would have listened. I saw what I wanted to see; believed what I needed to believe. Even with the mounting evidence, I wavered over whether we should save you."},{"name":"LALAHJINJAHL","text":"My mother would have been ashamed to see what I'd become. I took up the shield because I wanted to protect all life, just as she did to her dying breath..."},{"name":"LOIFA","text":"Your mother was a warrior like you?"},{"name":"LALAHJINJAHL","text":"She was a healer. The soul crystal you took... It was hers."},{"name":"LOIFA","text":"Then...then the woman that day...was your mother!?"},{"name":"LOIFA","text":"...Guildivain had already fled Sharlayan. We were attempting to escape when one of our comrades collapsed in pain."},{"name":"LOIFA","text":"Someone chanced to see us─another sage at Physis Technon. Suspicious though we must have looked, she rushed to our aid without hesitation. But our companion, he flew into a frenzy, and...we couldn't stop him..."},{"name":"LOIFA","text":"I tried to save her, the gods know I did, but... With the last of her strength, she pressed the crystal into my hand... Forgive me..."},{"name":"LALAHJINJAHL","text":"...There is naught to forgive. She did what she had always done─what she believed was right. If she had any regrets, it would doubtless be that she couldn't help you sooner."},{"name":"LALAHJINJAHL","text":"As for the crystal, she clearly wished for you to have it. She must have seen something in you, in that moment... 'Tis my hope that you will carry on her legacy, and fight for the future of all lives."},{"name":"LOIFA","text":"The future of all lives..."},{"name":"LALAHJINJAHL","text":"I shall dedicate my efforts to locating Guildivain. Until I do, please continue practicing your skills, the better to be prepared for when we face him."}],"reward":{"gil":1807},"reqs":{"jobs":[{"lvl":75,"id":181}],"quests":[69605]},"next":[69607]},"partials":[{"type":"npc","id":"1039249","obj":{"i":1039249,"n":"Lalah Jinjahl","l":2082,"q":5}},{"type":"quest","id":"69605","obj":{"i":69605,"n":"Sands of Despair","g":164,"l":"Idyllshire","s":730,"f":1}},{"type":"quest","id":"69607","obj":{"i":69607,"n":"Pledge of Hope","g":164,"l":"Idyllshire","s":780,"f":1}}]}