{"quest":{"name":"The Killer Instinct","location":"Ul'dah","id":69609,"patch":6.0,"sort":700,"icon":101096,"unlocksFunction":1,"eventIcon":71341,"issuer":1036633,"target":1037014,"genre":165,"journal":["The flustered attendant is in urgent need of someone with a knack for chasing off ruffians.<br><br>※This quest will unlock the reaper job.","A flustered attendant explains to you that his employer is being accosted by an unsavory group called the Lemures, which is led by a merciless killer named “the Reaper.” This menacing figure has supposedly threatened the wealth of one Jijilyo, and the merchant has resolved to defend his fortune with his life. Seeking to ensure that his employer lives through the encounter, the attendant has asked you to meet them at the Sapphire Avenue Exchange, implying that a handsome reward lies at the end of a day's work.","It is not long after your arrival that you are joined by the notorious leader of the Lemures, but instead of attacking, the Reaper asks for coin that is rightfully owed. Clearly, Jijilyo neglected to divulge that he had previously hired the gang to frighten his competition. The standoff turns tense, but as the woman looks you over she is struck with an idea: in exchange for your release into her group's service, she will forgive Jijilyo's debt. Treasuring his own life and not particularly caring about yours, Jijilyo readily agrees, and the Reaper informs you that she will be waiting at Lemures headquarters, located in Pearl Lane.","Drusilla, the leader of the Lemures─and a Garlean besides─cuts to the chase and briefs you on your first job: a hunt for a voidsent. This is no simple task, however, and will require that you undergo training as a reaper. To that end, Drusilla asks you to touch the soul crystal on her desk, and a dark figure materializes─your avatar, the source of a reaper's power. To claim these otherworldly abilities, you must first forge a pact to feed the souls of your enemies to this avatar─or rather, the voidsent it represents. Drusilla emphasizes that the choice to do so and join the Lemures is not one to be made lightly, and offers you some time to decide.","The choice before you is indeed a grave one, but if you are to walk the path of the reaper, then your answer is a foregone conclusion. You must speak with Drusilla and affirm your conviction.<br><br>※In the event that you leave Lemures headquarters, you may re-enter by speaking with the loyal Lemure in Pearl Lane.","Drusilla welcomes you into her time-honored order and presents you with a Soul of the Reaper. As you hold it close, you feel the fetters of the covenant with your voidsent tighten and meld into your essence. Drusilla then presents you with a scythe, asking you to feel the heft of it in your hands. Equip the scythe and inquire as to whether the sight meets with Drusilla's approval."],"objectives":["Speak with Jijilyo at the Sapphire Avenue Exchange.","Speak with the loyal Lemure.","Speak with Drusilla."],"dialogue":[{"name":"JIJILYOSERVANT","text":"You there! You're the fighting sort, yes? And by the looks of it, one of no mean skill!"},{"name":"JIJILYOSERVANT","text":"My employer is in desperate need of a <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> of your talents, you see─he's been beset by threats from an unsavory group of thugs known as the “Lemures.”"},{"name":"JIJILYOSERVANT","text":"Their leader demands my master part with some of his considerable wealth, or... Well, I'll just tell you they call her the “Reaper,” and leave the rest to your imagination."},{"name":"JIJILYOSERVANT","text":"We don't intend to acquiesce to these churlish demands without a fight, and a stout arm by our side would go far to ensure our survival. <span class=\"emphasis\">Your</span> arm, perhaps?"},{"name":"JIJILYOSERVANT","text":"In case the opportunity to perform a good deed isn't enticement enough, please be reminded that my master possesses <span class=\"emphasis\">considerable</span> wealth. If you would aid us, come with haste to the Sapphire Avenue Exchange, where we make our stand against these brutes."},{"name":"JIJILYOSERVANT","text":"Ah, you've come! I knew you were every ilm the brave warrior I thought you to be!"},{"name":"JIJILYO","text":"Ah! Y-You! I know why you're here, and if you mean to lay a finger on my coinpurse, you'll have to pry it from my cold, lifeless─"},{"name":"JIJILYOSERVANT","text":"Master Jijilyo, <span class=\"alternative-container\"><span class=\"alternative\">she's</span><span class=\"alternative\">he's</span></span> a friend! This adventurer has agreed to help. We'll show the Reaper what her empty intimidations are worth!"},{"name":"JIJILYO","text":"Ah...I see. My apologies, <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. Tensions have been high as of late, as I'm sure you can understand."},{"name":"JIJILYO","text":"For reasons that elude me, these Lemures have made my life a waking nightmare. Sight unseen, they have demanded I begin paying them for the luxury of my own life. "},{"name":"JIJILYO","text":"Rumors abound of their origins. Some say they are the detritus of some barbaric nation. They flout our laws and threaten their betters with impunity."},{"name":"JIJILYO","text":"They're led by a dead-eyed killer who draws her scythe at the smallest slight. Refuse their payments of coin, and she takes her share of your lifeblood instead. Rubbish, I say─the Reaper is naught but a toothless bandit."},{"name":"DRUSILLA","text":"(-???-)Interestin' theory you have there. Care to test it?"},{"name":"JIJILYO","text":"You...! You're...the Reaper!"},{"name":"DRUSILLA","text":"(-The Reaper-)Oh, you're a perceptive one, ain't you? Suppose that's how you came to be in possession of so many shiny things."},{"name":"DRUSILLA","text":"(-The Reaper-)And what do we have here? Hirin' more help while our ledgers remain unbalanced? You wouldn't be tryin' to wriggle your way out of payin' us for a job well done, would you?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"What was all that about “sight unseen”?"},{"name":"A1","text":"You've hired these Lemures before?"},{"name":"DRUSILLA","text":"(-The Reaper-)My, my, how do you keep the lies straight? You didn't tell your hired muscle here what great friends we were? So great, in fact, that you trusted none other than me and mine to put the scare into your competition."},{"name":"DRUSILLA","text":"(-The Reaper-)A job we were happy to do─you can't find your fortune in this fair city without steppin' over a few bodies on the way, after all. But as flexible as our morals are, I'm afraid without the coin to bend them, we only have one recourse. Unless..."},{"name":"DRUSILLA","text":"(-The Reaper-)Hmm. One does wonder how you found yourself with a bodyguard of such uncommon mettle."},{"name":"DRUSILLA","text":"(-The Reaper-)Aye, not an onze of fear in that gaze, and not a mote of puffed-up arrogance, either. This <span class=\"alternative-container\"><span class=\"alternative\">lass</span><span class=\"alternative\">lad</span></span>, my dear Jijilyo, is the genuine article."},{"name":"DRUSILLA","text":"(-The Reaper-)<span class=\"alternative-container\"><span class=\"alternative\">She</span><span class=\"alternative\">He</span></span> has what we in the mercenary trade call the “killer instinct.”"},{"name":"DRUSILLA","text":"(-The Reaper-)How's this? For the sake of our long-standin' friendship, I'll make it simple. Allow me to take this adventurer off your hands, and the debt is forgiven."},{"name":"JIJILYO","text":"What...? That's all?"},{"name":"DRUSILLA","text":"(-The Reaper-)I believe this is what them in <span class=\"emphasis\">your</span> trade call a “bargain.”"},{"name":"DRUSILLA","text":"(-The Reaper-)As for <span class=\"emphasis\">you</span>, adventurer, it seems you've been made a free agent. But if you're still inclined to put those instincts of yours to use, come and visit our headquarters in Pearl Lane. The door's open."},{"name":"JIJILYOSERVANT","text":"Well, that went about as well as can be expected. At least, I think it di─ Payment, you say? Regretfully, it seems your contract has changed hands..."},{"name":"JIJILYO","text":"Please, you must...you must do as the Reaper asked! If you don't, I fear she might return for her wages─and this time, demand interest!"},{"name":"LEMURESMEMBERA","text":"The boss told me you'd be along. Coming in?"},{"name":"Q5","text":"Enter Lemures headquarters?"},{"name":"LEMURESMEMBERA","text":"Boss, the guest of honor's arrived."},{"name":"DRUSILLA","text":"(-The Reaper-)Ah, I knew you wouldn't pass up my offer. Got a hunger for somethin' more tasty than a pile of coin."},{"name":"DRUSILLA","text":"(-The Reaper-)Ah, the champion of Eorzea deigns to appear before me."},{"name":"DRUSILLA","text":"(-The Reaper-)Ah, the savior of Ala Mhigo and Doma deigns to appear before me."},{"name":"DRUSILLA","text":"(-The Reaper-)Aye, I've heard all about you─it's hard not to in this line of work. The stories paint you as ferocity incarnate─a force of nature few have survived."},{"name":"DRUSILLA","text":"(-The Reaper-)Peace, friend. I've no desire to put the killer to the proof personally. I don't have a death wish."},{"name":"DRUSILLA","text":"You can call me Drusilla. I'm a reaper─one of many─and the leader of this little family here. As to why I invited you into our home..."},{"name":"DRUSILLA","text":"There's a job I'd like you to take care of for me."},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Depends on the job."},{"name":"A2","text":"I won't work with criminals and thieves!"},{"name":"DRUSILLA","text":"Now don't you worry that virtuous heart of yours, eh? I wouldn't ask you to do so much as bend the law. This job is purely for the benefit of your fellow man."},{"name":"DRUSILLA","text":"Now, now, there's no need for name-callin'. Untwist your smallclothes and listen to the particulars first. I won't ask you to do anythin' unsavory─this job'll be a boon to your fellow man, in fact."},{"name":"DRUSILLA","text":"All you have to do is kill one for me. Though perhaps “kill” ain't the right word, seein' as he's already dead."},{"name":"DRUSILLA","text":"You'd not be chasin' after ghosts either, if that's your worry. Just a voidsent, usin' some poor sap's body as a vessel to unleash its singular brand of wickedness upon the world."},{"name":"DRUSILLA","text":"Don't look so surprised─I know you've seen the dead walk. This time you'd be up against a voidsent, come here to unleash its singular brand of wickedness upon the world."},{"name":"DRUSILLA","text":"It won't be an easy task─the evil drivin' this monster is black as the void and near as deep. Countless souls have succumbed to its hunger. Worthy prey for one inclined to heroics, don't you think?"},{"name":"DRUSILLA","text":"You can't face it as you are, though, storied as your strength may be. I'll need to train you in techniques. Techniques that'll let you pierce the void and slaughter its kin."},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"What could you have to teach me?"},{"name":"A3","text":"Keep talking."},{"name":"DRUSILLA","text":"Don't see many Garleans in Ul'dah, do you? Let alone ones as “savage” as this. Save your startled gasps─I'm not out of surprises yet."},{"name":"DRUSILLA","text":"Hold your hand out to the crystal here. If you're made of the stuff I think you are, then you're in for a treat."},{"name":"DRUSILLA","text":"That's it. I knew you had what it takes."},{"name":"DRUSILLA","text":"This'd be an avatar. A manifestation of your essence and the stygian power of the voidsent on the other side. A voidsent to which, if you so choose, you will bind to yourself."},{"name":"DRUSILLA","text":"You'll gain skills unlike anythin' you've ever known. Skills that've allowed people like me to operate in the shadows and kill those that need killin' since time immemorial."},{"name":"DRUSILLA","text":"And your first assignment, should you walk this path, is to use the power of one voidsent against another for the betterment of the realm."},{"name":"DRUSILLA","text":"Your reward will be the wisdom of countless generations of Garlean assassins."},{"name":"DRUSILLA","text":"But if sidin' with my kind makes your stomach churn, then take your indignation and piss off!"},{"name":"DRUSILLA","text":"If the thought of havin' one foot in the void <span class=\"alternative-container\"><span class=\"alternative\">twists your guts worse than the moon's blood</span><span class=\"alternative\">makes your stones shrivel into your belly</span></span>, then take your cowardice and piss off!"},{"name":"DRUSILLA","text":"And if you've any concern for the sanctity of your soul, then take your virtue and piss off!"},{"name":"DRUSILLA","text":"However, if you've none of the aforementioned objections, and you don't mind walkin' the knife's edge 'twixt life and death, then you'll have the tools to see your justice done, and done right. Every time."},{"name":"DRUSILLA","text":"This is the choice you must make, and soon. Every moment our quarry stalks the land is another opportunity for it to do harm."},{"name":"DRUSILLA","text":"I take it you've come to a decision. Am I right?"},{"name":"DRUSILLA","text":"There'll be no turnin' away once you've chosen, mind you─you'll dance with death and return as its envoy, or you won't return at all. So what'll it be?"},{"name":"Q4","text":"Will you dance with death?"},{"name":"A4","text":"I prefer to keep well clear of death, if it's all the same to you."},{"name":"A4","text":"I will not suffer this voidsent to threaten the innocent. I will dance."},{"name":"A4","text":"I'm not much of a dancer, but I want the power to see my justice done."},{"name":"DRUSILLA","text":"I see... Well, even I'm mistaken from time to time. As you like."},{"name":"DRUSILLA","text":"Very good. Then let's not waste time."},{"name":"DRUSILLA","text":"Take up this crystal, and attest to both worlds that you walk as a reaper. Bind yourself to the void, and claim the strength that the weak of heart shun."},{"name":"DRUSILLA","text":"Through the avatar at your side does the voidsent bring its power to bear, feeding upon the souls of the fiends you cut down in return. Not a bad arrangement, eh?"},{"name":"DRUSILLA","text":"But I'm sure you tire of words. Here─the traditional weapon of our order. Let's see how it looks strapped to your back."}],"reward":{"gil":970,"items":[{"id":33354},{"id":35872},{"id":35760}]},"reqs":{"jobs":[{"lvl":70,"id":34}]},"next":[69610]},"partials":[{"type":"npc","id":"1036633","obj":{"i":1036633,"n":"Flustered Attendant","l":40,"q":1}},{"type":"npc","id":"1037014","obj":{"i":1037014,"n":"Drusilla","l":4022,"q":2}},{"type":"item","id":"33354","obj":{"i":33354,"n":"Soul of the Reaper","l":30,"c":26063,"t":62}},{"type":"item","id":"35872","obj":{"i":35872,"n":"Muzhik Attire Coffer (IL 385)","l":1,"c":26509,"t":61}},{"type":"item","id":"35760","obj":{"i":35760,"n":"Deepgold War Scythe","l":385,"c":37231,"t":108,"p":39744}},{"type":"quest","id":"69610","obj":{"i":69610,"n":"The Harvest Begins","g":165,"l":"Ul'dah","s":701,"f":1}}]}