{"quest":{"name":"The Company We Keep","location":"The Rising Stones","id":69600,"patch":5.55,"sort":490,"icon":101059,"eventIcon":71201,"issuer":1036400,"target":1036424,"genre":10,"journal":["Alisaie can tell you are itching to take the fight to the Telophoroi.","Feeling suitably recovered from your exertions at the battle of Paglth'an, you return to the Rising Stones to meet with your comrades. No sooner have you exchanged greetings than an envoy arrives with a message from the Alliance. Apparently, a historic assembly will shortly be taking place in Ala Mhigo, and the Scions' presence is requested. In addition to the usual Alliance representatives, delegates from the various beast tribes have been invited to attend, in the hope that all the peoples of Eorzea might unite under a single banner.","After an uncertain start, the meeting in Ala Mhigo proceeds remarkably smoothly, with the Alliance and the beast tribes agreeing to set aside their differences and join forces against their common foe, the Telophoroi. The talks culminate in the founding of the Grand Company of Eorzea, a dream long nurtured by Alphinaud in particular.","Outside the palace, you and Alphinaud are met by Kan-E-Senna, who requests that you visit the sylphs of the Ashcrown Consortium. As traders in crystal, they are well versed in negotiating with the many and varied peoples of Eorzea, and their counsel should be greatly beneficial to the newly formed coalition. Alphinaud also wishes to take this opportunity to draft a proposal based on his experiences as commander of the Crystal Braves, and offer it to the Grand Company of Eorzea that it may avoid a similar fate.","Before making his proposal, Alphinaud resolves to collect the testimonies of those who once served as Crystal Braves. Being the order's former commander, however, he acknowledges that he is unlikely to receive honest answers from those who abandoned the cause. So Alisaie and G'raha volunteer to seek out said individuals, while you and Alphinaud turn your attention to those who joined the Scions of the Seventh Dawn.","At Castrum Oriens, you meet with Riol and Alianne, former Crystal Braves who now serve as Scions. They explain that while the Crystal Braves were formed with the best of intentions, some members were more devoted to the cause than others, with many seeking to use their status for personal gain. Struck by this observation, Alphinaud ponders how best to unite the Grand Company of Eorzea in pursuit of a single purpose."],"objectives":["Speak with the Resistance guard in the Ala Mhigan Quarter.","Speak with Alphinaud.","Speak with Alisaie.","Speak with Riol at Castrum Oriens."],"dialogue":[{"name":"ALISAIE","text":"Ah, <span class=\"highlight\">Forename</span>! You're looking well. I take it you managed to squeeze in some rest. If you came hoping for tidings from Krile, I'm afraid we're still waiting, but we do have some odd scraps of news to share."},{"name":"TATARU","text":"Scraps, she says! Lunar primals have been popping up all over the place, but the Alliance has the situation well in hand─thanks in no small part to Hoary Boulder and the others."},{"name":"TATARU","text":"Meanwhile, talks with the beast tribes are going even better than expected. Encouraged by Ul'dah's progress with the Amalj'aa, Gridania has opened negotiations with the <span class=\"emphasis\">Ixal</span>, believe it or not."},{"name":"ALISAIE","text":"All of which is obviously very encouraging. But with the Telophoroi still out there, it's not as if we can afford to lower our guard."},{"name":"RESISTANCEHERALD04064","text":"Begging your pardon, but I come bearing an invitation from the Alliance."},{"name":"RESISTANCEHERALD04064","text":"A council meeting is due to be held in Ala Mhigo, and your attendance is humbly requested."},{"name":"ALISAIE","text":"Ah, we were just talking about the Alliance. May I ask what's on the agenda?"},{"name":"RESISTANCEHERALD04064","text":"I <span class=\"emphasis\">believe</span> the intention is to share news of recent developments, and discuss what measures might be taken to combat the Telophoroi...in concert with our new allies. The beast tribes have also been invited."},{"name":"RESISTANCEHERALD04064","text":"It is hoped that they will join us in the fight against our common foe."},{"name":"YSHTOLA","text":"So the Alliance would bring all of the beast tribes into the fold at a single stroke. An ambitious plan, given the delicacy of the negotiations, but mayhap an expedient one, considering the threat we face."},{"name":"RESISTANCEHERALD04064","text":"Indeed, my lady. And for their part, I am told the beast tribes have agreed to attend. If the Scions, too, are present, all of Eorzea will be represented."},{"name":"ALPHINAUD","text":"To arrange such a meeting must have been quite an undertaking, not only diplomatically but practically..."},{"name":"ALPHINAUD","text":"Pray inform the Alliance that we would be honored to participate. We shall make for Ala Mhigo without delay."},{"name":"RESISTANCEHERALD04064","text":"Then I will bear your answer thither with all haste. We look forward to receiving you at the Royal Palace."},{"name":"THANCRED","text":"Well, now that we've accepted the invitation, who exactly is going to attend?"},{"name":"ALPHINAUD","text":"I move that you and Y'shtola lead our contingent. Given how long you have worked to end summoning, it is only right that you be present for what promises to be a historic moment."},{"name":"THANCRED","text":"I think we've <span class=\"emphasis\">all</span> played our part in that little endeavor, don't you, <span class=\"highlight\">Forename</span>?"},{"name":"URIANGER","text":"All present may rightly claim a seat, I do quite agree. But by your leave, I believe I shall remain here and lend what assistance I can to the coordination of our defensive efforts."},{"name":"ESTINIEN","text":"I'm not coming either. Aymeric will be there, and I'd rather not be interrogated."},{"name":"THANCRED","text":"Very well, then. While those with a mind to hold the fort get on with holding it, I suggest the rest of us make for Ala Mhigo. Shall we?"},{"name":"TATARU","text":"Don't forget to bring me something nice from Ala Mhigo!"},{"name":"URIANGER","text":"I shall take this opportunity to gain a better understanding of Ser Estinien. Being Elezen of like age, 'tis possible we have interests in common."},{"name":"URIANGER","text":"Mayhap I shall begin by lending him a favorite treatise or two from my collection..."},{"name":"ESTINIEN","text":"Don't worry, I have no plans to return to roaming in your absence. I know you'd only chase me if I did."},{"name":"ALPHINAUD","text":"Even with the swift intervention of the Immortal Flames, all too many lost their lives at Paglth'an. Still closer cooperation between our peoples will be required if we are to thwart the plans of the Telophoroi."},{"name":"ALISAIE","text":"Honestly, the look on your face... Eager to bear witness to another historic moment, by any chance?"},{"name":"GRAHATIA","text":"Hah! I suppose I am. And the fact that our cure for tempering made it possible only heightens my anticipation."},{"name":"THANCRED","text":"The Amalj'aa cannot be the only tribe to have been targeted by the Telophoroi. And none of them will have taken kindly to having their people enslaved, nor their gods turned against them."},{"name":"YSHTOLA","text":"Like the city-states, every beast tribe has its factions, each with their own agenda, making peace a complex proposition. But if the Alliance can come to an understanding with their leaders, it will be for them to resolve internal politics."},{"name":"RESISTANCEGATEGUARD","text":"We have been expecting you."},{"name":"RESISTANCEGATEGUARD","text":"While some few guests have yet to arrive, the Alliance leaders are all present. Shall I show you in?"},{"name":"ALISAIE","text":"It's a pity it took the threat of annihilation for everyone to cast their grievances aside. But better late than never, I suppose."},{"name":"GRAHATIA","text":"Forgive me for observing, but Alphinaud seems less than jubilant. Might his thoughts still be occupied by the fate of poor Arenvald?"},{"name":"THANCRED","text":"The Grand Company of Eorzea... I wonder what Riol and the other former Crystal Braves will make of it."},{"name":"YSHTOLA","text":"We have won over the leaders. Now the leaders must win over their own people. No small task, I grant you...but we have come a long way since first we joined with Minfilia to bring an end to summoning. A long, long way..."},{"name":"ALPHINAUD","text":"Well...now that we are out of earshot of the other delegates, I hope you will forgive me if I speak my mind."},{"name":"ALPHINAUD","text":"Let me begin by saying that I have <span class=\"emphasis\">dreamed</span> of this day since the moment I first set foot upon these shores, and that I was as heartened as anyone to see the peoples of Eorzea pledge their solidarity... Yet even as they uttered their declarations, all I could think about was the conflict to come─of the sacrifices that would be made, and the lives lost. Inevitabilities that I still struggle to accept."},{"name":"ALPHINAUD","text":"But at least now there is hope. The formation of the Grand Company of Eorzea is the first step. The first of many."},{"name":"KANESENNA","text":"(-???-)Many and more."},{"name":"THANCRED","text":"Elder Seedseer... How might we be of service?"},{"name":"KANESENNA","text":"I seek Master Alphinaud's assistance in a matter involving Gridania's neighbors, the sylphs."},{"name":"KANESENNA","text":"I know that you and yours have long kept a weather eye upon the crystal trade, the better to predict the coming of primals, and so you will be familiar with the sylphs of the Ashcrown Consortium."},{"name":"KANESENNA","text":"Through their dealings, they have cultivated relations not only with the city-states, but many other communities besides."},{"name":"ALPHINAUD","text":"Communities such as the beast tribes."},{"name":"KANESENNA","text":"Just so. It is our hope that we may make use of the sylphs' established lines of communication to coordinate the efforts of our new fellowship."},{"name":"KANESENNA","text":"Yet there remain certain practical differences between a trade consortium and a Grand Company. If the sylphs are to perform their task effectively, they will require the counsel of one versed in the operational aspects of an armed force."},{"name":"THANCRED","text":"An armed force founded with the selfsame goal in mind, no less."},{"name":"KANESENNA","text":"The Crystal Braves, yes. Forgive me, Master Alphinaud. I know that it was a painful chapter in your life, but the experience may yet be made to serve the realm."},{"name":"ALPHINAUD","text":"&lt;sigh&gt; In my hubris, I plotted a course for the Crystal Braves which stretched far beyond the order's initial conception; one intended to pave the way for the founding of what I intended to call “the Grand Company of Eorzea.”"},{"name":"ALPHINAUD","text":"But my plans all came to naught. Built upon a frail foundation of lofty ideals, the order was doomed from the first to collapse under the weight of more <span class=\"emphasis\">worldly</span> interests. And I have no wish to see this new endeavor suffer the same fate."},{"name":"KANESENNA","text":"Mayhap I ask too much of you..."},{"name":"ALPHINAUD","text":"Not at all. You may count upon my assistance, for what little it is worth. By your leave, I shall prepare a report, including a list of recommendations drawing on the lessons I learned from the failures of the Crystal Braves."},{"name":"KANESENNA","text":"You have my gratitude, Master Alphinaud...and my trust. When your report is ready, pray share it directly with the sylphs."},{"name":"KANESENNA","text":"With your guidance, and the earnest efforts of every goodly soul gathered here this day, I have no doubt but that our fellowship shall emerge from the shadow of the Telophoroi and flourish. Until next we meet, my friends."},{"name":"ALPHINAUD","text":"Before committing anything to writing, there are a number of people whose thoughts I should like to hear. Former Braves, you understand. Might you join me in seeking them out?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"As if you have to ask."},{"name":"A2","text":"I can't think of an excuse not to, so...yes?"},{"name":"ALPHINAUD","text":"Thank you. As someone who witnessed the order's rise and fall, yours would be a reassuring presence."},{"name":"ALPHINAUD","text":"Well, I shall be grateful of your help, grudging or not!"},{"name":"ALISAIE","text":"I'll join you. If you're planning to canvass the opinions of your former comrades, it will be a lot quicker if we share the task of questioning them."},{"name":"YSHTOLA","text":"Then mayhap G'raha can lend a hand as well. I shall accompany Thancred back to the Rising Stones. Between us, I daresay we should be able to provide an accurate enough account of the day's events."},{"name":"ALPHINAUD","text":"We should be glad of your company, G'raha. I shall explain the details on the way."},{"name":"GRAHATIA","text":"I take it we will soon be paying the sylphs a visit? How <span class=\"emphasis\">fascinating</span> it will be to speak with them in person...though I gather conversation can prove rather...challenging?"},{"name":"ALPHINAUD","text":"It will not be easy to revisit the past, but sometimes one must look back to see the way forward."},{"name":"ALISAIE","text":"So, what's the plan, brother mine?"},{"name":"ALPHINAUD","text":"Before discussing the task at hand, I should probably admit that the report I proposed is largely written."},{"name":"ALPHINAUD","text":"Not long after that fateful day in Ul'dah, I penned a detailed account of the organization's history, from the events that led to its inception to the failings that brought about its demise. This I did primarily as a means of taking some semblance of responsibility; never did I imagine that it might later be referred to by those seeking to form a similar organization."},{"name":"ALPHINAUD","text":"And while I made every attempt to be objective, the account was mine alone; its events viewed from my singular perspective. For it to be of use, however, it must be broadened to encompass the viewpoints of all involved. Only then can it answer what seems to me to be the crucial question...namely: why, after the Crystal Braves disbanded, did some members choose to remain with us while others did not?"},{"name":"ALISAIE","text":"I see. You think the answer will tell us something about the nature of the ties that bind our new Grand Company together."},{"name":"ALISAIE","text":"And that this knowledge might help us to prevent it from falling apart when those bonds are inevitably tested."},{"name":"ALPHINAUD","text":"That is my hope, yes. But the questions I would ask are uncomfortable to some. As the former commander of the Crystal Braves, I doubt that those who abandoned the cause would welcome my inquiries."},{"name":"ALISAIE","text":"Then G'raha and I will just have to try."},{"name":"ALISAIE","text":"Meanwhile, the two of you can talk to the ones who kept the faith."},{"name":"ALPHINAUD","text":"A fine suggestion. Have care, however─certain of my former comrades are...of questionable character. So keep your wits about you, and let us reconvene in Gridania later on."},{"name":"ALPHINAUD","text":"If you have no objections, I've a mind to begin by speaking with Riol and Alianne. If memory serves, the two of them will be attending an intelligence briefing at Castrum Oriens. Let us seek them out there."},{"name":"ALPHINAUD","text":"While such briefings are seldom exciting affairs, their importance in coordinating our efforts with our allies cannot be overstated. In that regard, Alianne and Riol have been most dependable."},{"name":"ALIANNE","text":"Oh? I didn't expect to see you here, <span class=\"highlight\">Forename</span>. But if you enjoy intelligence briefings, you've come to the right place."},{"name":"RIOL","text":"Well, look who it is! An' what brings you two here? Wouldn't have anythin' to do with the <span class=\"emphasis\">big meetin'</span>, would it?"},{"name":"ALPHINAUD","text":"In a manner of speaking. I have been assigned a task, you see, for which I require the assistance of former members of the Crystal Braves..."},{"name":"RIOL","text":"So ye want to know why we decided to stick with the Scions, eh? Hmmm... Ain't an easy thing to put into words, that..."},{"name":"ALIANNE","text":"As I once explained to <span class=\"highlight\">Forename</span>, I spent a long time agonizing over my failure to alert you to the traitors in our midst. For my negligence, I was captured along with many others, and we were powerless to prevent the tragedies that ensued."},{"name":"ALIANNE","text":"As Riol will attest, I spent a long time agonizing over my failure to alert you to the traitors in our midst. For my negligence, I was captured along with many others, and we were powerless to prevent the tragedies that ensued."},{"name":"ALIANNE","text":"Not a day goes by that I do not think back to those fateful events. By joining the Scions, I hoped to redeem myself, and I will continue to serve the cause for as long as I am able."},{"name":"ALIANNE","text":"But that wasn't my only reason."},{"name":"ALIANNE","text":"When we were finally reunited at the Rising Stones, you refused to blame anyone but yourself for the fall of the Crystal Braves."},{"name":"ALIANNE","text":"And in spite of everything that had happened─everything you had suffered─you took us back without a moment's hesitation."},{"name":"ALIANNE","text":"We would not have blamed you had you turned us away. But when you gave us your trust instead, what else could we do but try to repay it?"},{"name":"RIOL","text":"Nothin', that's what! ...As for me own tale, well, I've always felt the Scions have somethin' in common with me old crew. “The duty of the strong is to protect the weak”─that was our creed, an' I still strive to live by it to this day."},{"name":"RIOL","text":"But as time's gone on, I've learned that strength comes in many shapes an' sizes. From Hoary Boulder to Mistress Tataru, we've all of us got somethin' to offer."},{"name":"RIOL","text":"An' <span class=\"emphasis\">not one of us</span> is doin' it for personal gain. 'Cause we believe there's more important things than that─things worth protectin'─which is what bein' a Scion's all about."},{"name":"ALPHINAUD","text":"I... I am at a loss for words. Thank you, my friends. To hear this from you means more than you know."},{"name":"ALPHINAUD","text":"Forgive me... <span class=\"highlight\">Forename</span>, could you...?"},{"name":"Q2","text":"What will you say?"},{"name":"A1","text":"Give us your thoughts on the Crystal Braves."},{"name":"A2","text":"Why do you think the Crystal Braves ended in failure?"},{"name":"RIOL","text":"Well, its foundin' ideals were somethin' to be proud of. But ideals alone don't make a crew."},{"name":"RIOL","text":"For every swab who signed up with good intentions, there was another who was only in it for the coin, the glory, or both."},{"name":"ALIANNE","text":"Ours <span class=\"emphasis\">was</span> quite a disparate band. And while I will never forgive Ilberd, the fact that we managed to function at all was thanks in large part to his efforts."},{"name":"RIOL","text":"Just a pity he was doin' it for all the wrong reasons, eh? Only takes one bad apple, they say, an' the Braves had a barrelful of 'em. Not like the Scions. We might look like a ragtag band o' misfits, but <span class=\"emphasis\">deep down</span>, we've all got that shared sense o' purpose. An' why? 'Cause Tataru sifted out all the glory-hunters 'fore they made it through the door!"},{"name":"ALPHINAUD","text":"I see. So while our ranks comprise a diverse range of people, each with their own individual strengths, we are all united in purpose."},{"name":"ALPHINAUD","text":"...Thank you, my friends. With your permission, I shall make a record of our discussion and refer to it when drafting my recommendations. Until we meet again."}],"reward":{"gil":2189},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69599]},"next":[69601]},"partials":[{"type":"npc","id":"1036400","obj":{"i":1036400,"n":"Alisaie","l":481,"q":1}},{"type":"npc","id":"1036424","obj":{"i":1036424,"n":"Riol","l":2406,"q":1}},{"type":"quest","id":"69599","obj":{"i":69599,"n":"When the Dust Settles","g":10,"l":"Ul'dah - Steps of Nald","s":480}},{"type":"quest","id":"69601","obj":{"i":69601,"n":"On Official Business","g":10,"l":"The Fringes","s":500}}]}