{"quest":{"name":"Sage's Path","location":"Limsa Lominsa","id":69603,"patch":6.0,"sort":700,"icon":101095,"unlocksFunction":1,"eventIcon":71341,"issuer":1039243,"target":1039265,"genre":164,"journal":["The Sharlayan maiden is taking in the scenery with fascination.<br><br>※This quest will unlock the sage job.","As you make your way through the lower decks of Limsa Lominsa, an outlandishly dressed maiden catches your eye. Curiosity piqued, you approach her and learn that she is Lalah Jinjahl, a Sharlayan operative come to Eorzea on a Forum-sanctioned mission to capture fugitives. Lalah seeks an adventurer to serve as her escort, and you agree to lend her your aid. Before divulging the particulars of the mission, she suggests moving to more private surrounds, and you head outside the Zephyr Gate to continue your conversation.","The fugitives Lalah hunts are dangerous individuals who have enhanced themselves via forbidden means─means which have rendered them unsound of mind. One committed murder while in a state of delirium, and though he subsequently died, three others remain at large. They have also stolen technical secrets in the form of a sage's soul crystal, and when Lalah makes to show you another, the stone appears to react to your presence. Convinced that you are meant to have it, she offers to bestow the crystal upon you─if you would swear to use the sage's art only for good.","Having given Lalah's offer due consideration, you make your pledge and accept her gift of the soul crystal along with a set of sage's garments. She then bids you take up the stone and don your attire, that your training as a sage may begin."],"objectives":["Speak with Lalah Jinjahl at the Zephyr Gate.","Speak with Lalah Jinjahl again."],"dialogue":[{"name":"LALAHJINJAHL","text":"Limsa Lominsa... Former disreputable haven for pirates, now one of the realm's finest city-states, boasting a peerless shipping industry and an enviable culinary culture. Oh, how it bustles! The tomes did not lie!"},{"name":"LALAHJINJAHL","text":"Well, here I am, Mother. In faraway Eorzea."},{"name":"LALAHJINJAHL","text":"I will complete this mission, just you watch. In your noble name, and as first of my class, I will succeed!"},{"name":"LALAHJINJAHL","text":"...And afterwards, perhaps I shall invite our esteemed alumna Alisaie for tea at the Bismarck. Heh heh, I'll be the envy of everyone!"},{"name":"LALAHJINJAHL","text":"Uwaaah!"},{"name":"LALAHJINJAHL","text":"...Ahem. My apologies, good <span class=\"alternative-container\"><span class=\"alternative\">madam</span><span class=\"alternative\">sir</span></span>. I failed to notice you."},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)I am Lalah Jinjahl, a native of Sharlayan."},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)Hmm... By your appearance, I assume you are an adventurer. Are you perchance well-traveled in Eorzea?"},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)So you are! How very fortuitous! And <span class=\"highlight\">Forename</span> is your name, you say? I'd swear I heard it somewhere before... In any event, it is a pleasure to make your acquaintance!"},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)As for myself, I am an operative on a mission from the Forum, our nation's governing body."},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)This being my first time in Eorzea, I studied as best I could in preparation, but there is no substitute for a local's knowledge. Thus did I intend to hire an adventurer like yourself to serve as my escort."},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)The mission is the pursuit and capture of fugitives, and thus it will entail some danger, but you appear to be no stranger to such. Might you be willing to assist me in this endeavor?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"I'd be glad to give you the grand tour."},{"name":"A1","text":"Certainly─if the reward is satisfactory."},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)Wonderful! While I have some skill with a blade and can fend for myself, I shall be glad of your capable company!"},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)You may rest assured you will be suitably rewarded for your services. That being the case, I take it your answer is yes. I shall be glad of your capable company!"},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)Now then, ere I divulge the particulars of my mission, we should head somewhere more private. Perhaps outside the city, by the Zephyr Gate?"},{"name":"LALAHJINJAHL","text":"Forgive me if I seem overly cautious, but this mission is highly confidential. Were the wrong people to learn of it, my superiors would give me an earful."},{"name":"LALAHJINJAHL","text":"But I believe we may speak freely here, so permit me to brief you on the details."},{"name":"LALAHJINJAHL","text":"As I mentioned, I am on the trail of fugitives─criminals who fled Sharlayan and came to these shores."},{"name":"LALAHJINJAHL","text":"Extremely dangerous individuals who have enhanced themselves via forbidden means─means which have rendered them unsound of mind."},{"name":"LALAHJINJAHL","text":"While in a state of delirium, one of their compatriots even committed murder. He died thereafter due to side effects of his enhancement, but three others remain at large and pose a threat to innocents."},{"name":"LALAHJINJAHL","text":"Their leader, a Viera male, is also alleged to have stolen valuable technological secrets."},{"name":"LALAHJINJAHL","text":"By way of reference material, I've brought this soul crystal..."},{"name":"LALAHJINJAHL","text":"Owww! It's hot! It's hot!"},{"name":"LALAHJINJAHL","text":"What in the world...? I have never known soul crystals to give off such heat before..."},{"name":"LALAHJINJAHL","text":"Whew, it's finally cooled down. But what could have triggered that intense reaction?"},{"name":"LALAHJINJAHL","text":"Not even at the Studium did I ever witness such a thing, but maybe...it was you?"},{"name":"LALAHJINJAHL","text":"The technological secrets which were stolen were contained in a similar crystal. This particular sample has been loaned to me by a healing institute in Sharlayan."},{"name":"LALAHJINJAHL","text":"Tell me, <span class=\"highlight\">Forename</span>. In the course of your adventures, have you ever fervently wished to save someone?"},{"name":"LALAHJINJAHL","text":"But failed to do so despite your best efforts, and afterwards cursed your own powerlessness?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"I've had to watch some of my dearest friends slip away."},{"name":"A2","text":"Yes, but it doesn't stop me from trying to save whomever I can."},{"name":"A2","text":"..."},{"name":"LALAHJINJAHL","text":"Forgive me if my question was indelicate. But there can be no doubt: the soul crystal resonated with that desire within you."},{"name":"LALAHJINJAHL","text":"When I received the crystal, I was told that, should it respond in this manner to my Eorzean collaborator, I should entrust it to them. For the knowledge it imparts─the knowledge of somanoutics─would surely avail me in my mission."},{"name":"LALAHJINJAHL","text":"Developed at the Studium, somanoutics is a discipline which combines the wisdom of medicine, aetherology, and sorcery. And those who have mastered it are called sages."},{"name":"LALAHJINJAHL","text":"Through medicine, a sage grasps the workings of the flesh; through aetherology, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> unlocks the secrets of the soul; and through sorcery, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> learns to manipulate the two. Thus trained, a sage has the ability to both strengthen and heal. Yet by the same token, <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is also capable of the opposite. Of causing harm."},{"name":"LALAHJINJAHL","text":"Not just anyone can take up the sage's art. No, one must be prepared to hold the lives of others in one's hands."},{"name":"LALAHJINJAHL","text":"Are you willing to bear such a burden, <span class=\"highlight\">Forename</span>?"},{"name":"LALAHJINJAHL","text":"If you are, and would swear to use the art for good, then I shall entrust this soul crystal to you."},{"name":"LALAHJINJAHL","text":"So, have you come to a decision?"},{"name":"LALAHJINJAHL","text":"Then I will bear witness to your pledge. Do you swear to use the sage's art for good, and to wield its power to the best of your judgment and ability?"},{"name":"Q3","text":"Swear and become a sage?"},{"name":"LALAHJINJAHL","text":"That you hesitate does you credit. I daresay you just need a little more time, and I'm willing to wait. Think it through, and let me know when you are ready to swear."},{"name":"LALAHJINJAHL","text":"Excellent! Chosen as you are by the crystal, I had faith that you would rise to the occasion."},{"name":"LALAHJINJAHL","text":"When those around you cry out for succor, the crystal shall be your ally. For it bears the wisdom of sages past─and their hopes for the future."},{"name":"LALAHJINJAHL","text":"By hearkening to their whispers and following in their footsteps, you will come to embody those hopes. To save and change countless lives."},{"name":"LALAHJINJAHL","text":"Lest you worry how you will learn the art, I can provide guidance─to an extent, in any case. During my time at the Studium, I had occasion to study somanoutics, you see. While I wasn't gifted in spellcraft and came to favor steel, I remember the lessons and will share what I know."},{"name":"LALAHJINJAHL","text":"Together with the soul crystal, I shall provide you with a set of sage's garments."},{"name":"LALAHJINJAHL","text":"So go on, take up your crystal and don your attire, and we shall begin your training!"}],"reward":{"items":[{"id":33355},{"id":35873},{"id":35778}]},"reqs":{"jobs":[{"lvl":70,"id":34}]},"next":[69604]},"partials":[{"type":"npc","id":"1039243","obj":{"i":1039243,"n":"Sharlayan Maiden","l":29,"q":1}},{"type":"npc","id":"1039265","obj":{"i":1039265,"n":"Lalah Jinjahl","l":30,"q":2}},{"type":"item","id":"33355","obj":{"i":33355,"n":"Soul of the Sage","l":30,"c":26064,"t":62}},{"type":"item","id":"35873","obj":{"i":35873,"n":"Bookwyrm's Attire Coffer (IL 385)","l":1,"c":26509,"t":61}},{"type":"item","id":"35778","obj":{"i":35778,"n":"Stonegold Milpreves","l":385,"c":37030,"t":109,"p":39744}},{"type":"quest","id":"69604","obj":{"i":69604,"n":"Sage's Focus","g":164,"l":"Middle La Noscea","s":701,"f":1}}]}