{"quest":{"name":"On Official Business","location":"The Fringes","id":69601,"patch":5.55,"sort":500,"eventIcon":71201,"issuer":1036426,"target":1036436,"genre":10,"journal":["Alphinaud is keen to hear what Alisaie and G'raha Tia have learned from the Braves who turned their back on the cause."],"objectives":["Speak with Alisaie in Gridania.","Speak with Frixio in Little Solace.","Speak with the silent conjurer at Nophica's Altar.","Speak with Kan-E-Senna.","Speak with Alisaie."],"dialogue":[{"name":"RIOL","text":"After the Company of Heroes went their separate ways, I did try workin' on me own for a bit. An' I'll admit, it was nice bein' able to pick me own battles. But if ye want to make a <span class=\"emphasis\">real</span> difference, ye need to find a good crew an' stick with 'em."},{"name":"ALIANNE","text":"Speaking of former Crystal Braves, I have not seen Aergmhus of late, constantly away on missions as he is. I wonder how he fares."},{"name":"ALPHINAUD","text":"Well, I think we have taken up enough of our colleagues' time...and I am conscious that less <span class=\"emphasis\">life-affirming</span> testimonies await. Let us make our way to Gridania and hear what the others have learned."},{"name":"ALPHINAUD","text":"On the way here, I took the opportunity to write up my notes from our conversation with Alianne and Riol. All that remains is to add Alisaie and G'raha's findings, whatever they may be..."},{"name":"GRAHATIA","text":"When Alisaie sets her mind on something, there is no stopping her. And her mind was truly <span class=\"emphasis\">set</span> on finding former Braves. For a while, I even feared what she might do to them. But in the event, she was admirably civil. For the most part."},{"name":"ALISAIE","text":"Thanks to Tataru's ever-dependable intelligence, we managed to track down a handful of former Braves without any great difficulty."},{"name":"ALISAIE","text":"Some were forthright, others less so, but we heard enough to form a picture. I must warn you, Alphinaud─some of their comments were...harsh."},{"name":"ALPHINAUD","text":"I can well imagine. But their opinions are no less vital to my report. I seek the unvarnished truth."},{"name":"ALPHINAUD","text":"Thank you. I will set about adding your findings to my own at once. In the meantime, pray go on ahead to Little Solace and seek out Elder Frixio. I will join you anon."},{"name":"ALPHINAUD","text":"Leave me to attend to my report and join the others in Little Solace. I shan't keep you waiting long. I know how playful the sylphs can be..."},{"name":"GRAHATIA","text":"Though I had the honor of sharing a table with Elder Frixio in Ala Mhigo, I did not have an opportunity to speak with him. I do hope my studies have granted me a sufficient grasp of his people's customs."},{"name":"ALISAIE","text":"Now that I think about it, of the four of us, only you and Alphinaud have any real experience in conversing with sylphs. Still, it can't be <span class=\"emphasis\">that</span> hard, can it?"},{"name":"FRIXIO","text":"Ah, welcome, brave one and friends of brave one! How good it is to see walking ones again so soon after the meeting."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It's been a while since we last spoke."},{"name":"A2","text":"...Should this one perform the customary dance of greeting?"},{"name":"A3","text":"..."},{"name":"FRIXIO","text":"Indeed it has! Though the palace was very pretty, the meeting was far too noisy for this one. So many shouting ones and squawking ones and cheering ones, with no chance for carefree conversation. Still, this one is pleased all ones can be friends."},{"name":"FRIXIO","text":"No, no! Be at ease. It is true that these ones once delighted in making walking ones dance, but no more."},{"name":"FRIXIO","text":"Oh dear, did brave one take a knock to the head? This one is Frixio! Or perhaps brave one is joking one, yes?"},{"name":"FRIXIO","text":"Horned one Kan–E–Senna said that walking ones would be coming to Little Solace. Imperial ones also invaded Sylphlands and abducted many of these ones, so these ones will be glad to bear messages between fighting friendly ones!"},{"name":"GRAHATIA","text":"That is heartening to hear, Elder. It will require <span class=\"emphasis\">all ones</span> to work in unison to stop the Telophoroi."},{"name":"FRIXIO","text":"These ones will try very hard, of course, but in matters of war, these ones have little experience. Any advice walking ones can provide would be most welcome."},{"name":"FRIXIO","text":"...Oh? Another pretty silver-haired one? And in quite a hurry, it seems."},{"name":"ALPHINAUD","text":"Alisaie! You must come quickly!"},{"name":"ALISAIE","text":"Whatever's the matter, Alphinaud? Don't tell me─you couldn't read my handwriting."},{"name":"ALPHINAUD","text":"What? No! A Twin Adder officer accosted me as I was about to set out."},{"name":"ALPHINAUD","text":"Sharlayan has sent an envoy, who is due to arrive in Gridania at any moment!"},{"name":"GRAHATIA","text":"An envoy? Could it be that Krile has managed to sway the Forum?"},{"name":"ALPHINAUD","text":"We shall know soon enough. But there is more. The envoy has requested that the two of us attend the audience with the Elder Seedseer."},{"name":"ALISAIE","text":"...Really? I can see why they might want Scions to be present, but us specifically? ...Wait. It isn't who I think it is?"},{"name":"ALPHINAUD","text":"...It is. I could scarce believe it myself, but when I inquired as to the envoy's identity, I was told that it was one “Fourchenault Leveilleur.”"},{"name":"GRAHATIA","text":"Your <span class=\"emphasis\">father</span>? Well, now... The fact that a serving member of the Forum had journeyed here would be surprise enough─but <span class=\"emphasis\">him</span>?"},{"name":"ALPHINAUD","text":"Quite. I glean from this that they are taking the matter seriously."},{"name":"ALISAIE","text":"That may be, but why him and not one of the other ninety-eight Forum members? Unless he <span class=\"emphasis\">volunteered</span> for it..."},{"name":"GRAHATIA","text":"It has been some time since you last saw your father, has it not? Could it be that he is concerned for your well-being?"},{"name":"ALISAIE","text":"...Perhaps. But he has always been reluctant to discuss his work with us."},{"name":"ALPHINAUD","text":"Indeed. And whenever we write to our parents, it is invariably our mother who replies."},{"name":"ALPHINAUD","text":"Nevertheless, I welcome the opportunity to meet with him after so long, even if it is secondary to his true purpose here."},{"name":"ALPHINAUD","text":"Elder Frixio─loath though I am to cut our visit short, we must return to Gridania. Pray accept my apologies, along with my report."},{"name":"FRIXIO","text":"Never mind. There will be time to talk later. This one won't keep walking ones from more urgent matters. Go!"},{"name":"ALPHINAUD","text":"The audience will be held at the Lotus Stand, where the Elder Seedseer awaits even now. Let us be on our way."},{"name":"FRIXIO","text":"Don't mind this one. Walking one should head back to Gridania with the others. If this one has any questions about the report, this one will be sure to send word."},{"name":"SILENTCONJURER","text":"Welcome, Warrior of Light. The Elder Seedseer and your friends are waiting within."},{"name":"ALPHINAUD","text":"Ninety-nine may seem like rather a lot of members, but before the Forum was founded, every person of age in Sharlayan was given equal say in its governance."},{"name":"ALPHINAUD","text":"Many of the institutions that are still active today were established by the people's vote, not least the Studium. As Alisaie and I were constantly reminded during our time there, it is an example of what can be achieved through absolute democracy."},{"name":"GRAHATIA","text":"During my time in Sharlayan, I heard much of Fourchenault Leveilleur. He is a gifted speaker, known amongst other things for the uncompromising application of Forum policy."},{"name":"ALISAIE","text":"After all this time away, it will be good to see my father. Even if it is at an official meeting."},{"name":"SILENTCONJURER","text":"Come, the Elder Seedseer awaits you in the Lotus Stand."},{"name":"SYSTEM","text":"Proceed to the Lotus Stand?"},{"name":"KANESENNA","text":"My friends, I thank you all for coming so swiftly."},{"name":"KANESENNA","text":"Word of Master Fourchenault's visit took us quite by surprise. When the Alliance granted Mistress Krile permission to request Sharlayan's aid, we did not anticipate so prompt a reply, much less that it would be delivered by a member of the Forum."},{"name":"KANESENNA","text":"What the nature of that reply may be, we shall soon discover..."},{"name":"ALPHINAUD","text":"Is it we who walk the path of ruin? Time will tell."},{"name":"GRAHATIA","text":"In order to avoid conflict with Garlemald, the Forum went so far as to order the abandonment of an entire city-state. Their refusal to aid us now is, I am sorry to say, entirely consistent with their historic position."},{"name":"KANESENNA","text":"It was not so very long ago that we had a friend and neighbor in Sharlayan, and so I clung to the hope that she might yet lend us her strength. But when she forsook Dravania, it would seem she forsook us all."},{"name":"ALISAIE","text":"So <span class=\"emphasis\">that's</span> what he came here to say!?"},{"name":"ALISAIE","text":"That we're all fools for having the temerity to defend ourselves against the Telophoroi!? And as for the rest─"},{"name":"ALPHINAUD","text":"Like it or not, this was the Forum's decision. To watch from afar while Eorzea burns."},{"name":"ALPHINAUD","text":"Father was but the messenger. And as he handed down their judgment, I could think of nothing to say that could possibly sway him. I...still can't."},{"name":"KANESENNA","text":"To have prolonged the discussion would have changed little, for it is not only Master Fourchenault who must be persuaded, but the Forum as a whole. Their decision was made ere your father crossed the sea."},{"name":"KANESENNA","text":"Nor is it like to be changed. And so we shall face the Telophoroi without their aid."},{"name":"GRAHATIA","text":"Forgive me, but if they had no intention of helping us, then why would they go to the trouble of sending an envoy in the first place? Why did they not simply keep their counsel, as they are wont to do?"},{"name":"KRILE","text":"(-Krile-)<span class=\"highlight\">Forename</span>─has Master Fourchenault arrived yet?"},{"name":"KRILE","text":"(-Krile-)Then it is as I feared. My efforts were in vain."},{"name":"KRILE","text":"(-Krile-)I pleaded our case to as many Forum members as I could, but they flatly refused to discuss the matter. No─that's not exactly true. I should rather say that they ignored every word I said on the subject, without exception. It was almost unnerving."},{"name":"GRAHATIA","text":"Could it be that they are hiding something from us? That might go some way to explain Master Fourchenault's...performance."},{"name":"GRAHATIA","text":"When he said that they would know if the Final Days were truly upon us, I dismissed it as pride. But what if they genuinely believe that they know how the world will end, and simply disagree with us about the circumstances?"},{"name":"KRILE","text":"(-Krile-)That I don't know...but something tells me they are not as unconcerned about the Telophoroi as they claim."},{"name":"KRILE","text":"(-Krile-)If the threat weren't real, why else would they be so standoffish and secretive?"},{"name":"KRILE","text":"(-Krile-)I would very much like to delve deeper into this, but I'm afraid I've exhausted every avenue of inquiry."},{"name":"KRILE","text":"(-Krile-)Nor have I fared any better with my other mission, researching Hydaelyn and the aetherial sea. I tried enlisting the help of experts in the field, but it appears the Forum has forbidden anyone from cooperating with us."},{"name":"ALPHINAUD","text":"Obstructed at every turn..."},{"name":"KRILE","text":"(-Krile-)So it would seem, but don't lose heart just yet. With all the knowledge and acquaintances we have between us, we can still find a way forward."},{"name":"KRILE","text":"(-Krile-)To that end, I would like you all to join me here─when the time is right, of course. I am aware that matters in Eorzea stand on a knife-edge, but with your permission, I can at least start making the necessary arrangements."},{"name":"Q2","text":"What will you say?"},{"name":"A1","text":"I've always wanted to visit Sharlayan!"},{"name":"A2","text":"Please do."},{"name":"A3","text":"Well, there are <span class=\"emphasis\">one or two</span> things to take care of here first..."},{"name":"KRILE","text":"(-Krile-)And so you shall! Albeit under less-than-happy circumstances."},{"name":"KRILE","text":"(-Krile-)It may take a while to secure entry for you all, but I'll let you know when everything is in order. Look after yourselves in the meantime, won't you?"},{"name":"KRILE","text":"(-Krile-)Excellent. Obviously, keeping the Telophoroi at bay must take precedence, but with luck, you'll be able to make the journey to Sharlayan ere long."},{"name":"KRILE","text":"(-Krile-)It may take a while to secure entry for you all, but I'll let you know when everything is in order. Look after yourselves in the meantime, won't you?"},{"name":"KRILE","text":"(-Krile-)After which, assisting me will seem a sweet relief, I'm sure."},{"name":"KRILE","text":"(-Krile-)While you attend to matters heroical, I shall see about securing entry for you all, and will let you know when everything is in order. Take care in the meantime, won't you?"},{"name":"KANESENNA","text":"Your speculations give me cause to hope. Yet if these seeds will bear fruit, I cannot say. While it is possible the Sharlayans hide some secret truth from us, there can be no certainty that its exposure will prompt in them a change of heart. And so, for the present, we must needs confront the plight in which we find ourselves."},{"name":"KANESENNA","text":"The Forum has refused our request for aid, and it falls to us alone to contend with the Telophoroi."},{"name":"ALPHINAUD","text":"Even with all of Eorzea standing united, there is no guarantee that we will prevail."},{"name":"ALPHINAUD","text":"What does Sharlayan intend to do if we fail?"}],"reward":{"items":[{"num":3,"id":31904,"one":1,"hq":1},{"num":3,"id":31900,"one":1,"hq":1},{"num":3,"id":31902,"one":1,"hq":1},{"num":3,"id":31907,"one":1,"hq":1}]},"reqs":{"jobs":[{"lvl":80,"id":142}],"quests":[69600]},"next":[69602]},"partials":[{"type":"npc","id":"1036426","obj":{"i":1036426,"n":"Alphinaud","l":2406,"q":1}},{"type":"npc","id":"1036436","obj":{"i":1036436,"n":"Alisaie","l":347,"q":1}},{"type":"item","id":"31904","obj":{"i":31904,"n":"Zefir","l":510,"c":24092,"t":46}},{"type":"item","id":"31900","obj":{"i":31900,"n":"Chicken Fettuccine","l":510,"c":24033,"t":46}},{"type":"item","id":"31902","obj":{"i":31902,"n":"Golden Pineapple Juice","l":510,"c":24404,"t":46}},{"type":"item","id":"31907","obj":{"i":31907,"n":"Lemon Muffin","l":510,"c":24004,"t":46}},{"type":"quest","id":"69600","obj":{"i":69600,"n":"The Company We Keep","g":10,"l":"The Rising Stones","s":490}},{"type":"quest","id":"69602","obj":{"i":69602,"n":"Death Unto Dawn","g":10,"l":"Lotus Stand","s":510}}]}