{"quest":{"name":"Sage's Focus","location":"Middle La Noscea","id":69604,"patch":6.0,"sort":701,"icon":101095,"unlocksFunction":1,"eventIcon":71341,"issuer":1039265,"target":1039249,"genre":164,"journal":["Lalah Jinjahl has a mind to introduce you to the sage's armaments.","For your first lesson as a sage, Lalah introduces you to the sage's arms, the hovering nouliths. Yet eager though she is to have you try your hand at using them, your mission calls you to Idyllshire in the Dravanian hinterlands, where the fugitives have reportedly made their way.","Upon arriving in Idyllshire, Lalah suggests splitting up to search for your elusive quarry. While she sees to the town's south, you turn your steps for the north.","As you scan your surrounds, you chance to hear a cry for help. Together with Lalah, you rush towards the disturbance to find a man at the mercy of three assailants. Your intervention prompts the villains─a Viera man named Loifa and his two accomplices─to leave, and you turn to render aid to their intended victim.","The man introduces himself as Faldrinet, and to Lalah's surprise, he is not only a fellow Sharlayan, but a sage besides─a traveling healer who offers his services gratis to those in need. Though he does not know why he was attacked, he theorizes that his assailants, whom Lalah is confident are the fugitives, wish to obtain forbidden plants that still grow at Saint Mocianne's Arboretum.","Seeing the logic in Faldrinet's supposition, Lalah decides to investigate the arboretum. The fugitives, she posits, have enhanced themselves with sage magic, and she makes no attempt to hide her disdain for their misuse of the art before setting off for the abandoned facility.","You join Lalah at the arboretum, where your objective is to find the fugitives, and failing that, clues that will lead you to them. Rife with unruly flora and fauna, the place promises to provide you with good practice for your budding sage's skills, and you steel yourself for the foray.","Your preparations complete, you venture into Saint Mocianne's Arboretum and begin searching for the fugitives.","You make your way through the arboretum, and after coming upon signs of their passage, finally encounter Loifa and his accomplices, Mahaud and Ancel. A clash ensues, which ends when they decide it is not in their best interest to fight, and they teleport away─but not before dropping a peculiar pouch.","Outside the arboretum, Lalah reveals that the pouch held an unknown plant. Furthermore, she chanced upon a diary which appears to belong to a Sharlayan sage. Though the fugitives and their objective still elude you, you have these clues to show for your efforts, and head back to Idyllshire to take stock.","Lalah informs you that she has dispatched the mystery herb to her homeland for identification. While awaiting the results, she bids you take the opportunity to continue honing your skills as a sage.<br><br>※The next sage quest will be available from Lalah Jinjahl upon reaching level 73."],"objectives":["Speak with Lalah Jinjahl in Idyllshire.","Stand lookout for the fugitives.","Render aid to the refined man.","Speak with Lalah Jinjahl.","Speak with Lalah Jinjahl in front of Saint Mocianne's Arboretum.","Speak with Lalah Jinjahl again.","Speak with Lalah Jinjahl.","Speak with Lalah Jinjahl in Idyllshire."],"dialogue":[{"name":"LALAHJINJAHL","text":"I see the crystal has imparted to you its knowledge, as expected. Excellent. You are ready to embark on your training, and naturally it begins with the armaments─a set of short staves known as nouliths."},{"name":"LALAHJINJAHL","text":"Nouliths trace their roots to healers of eld, who employed naturally occurring objects of power known as adder stones."},{"name":"LALAHJINJAHL","text":"These stones, which harbor spiritual energy, were placed around the sick and ailing to create an aetheric confluence through which the healer channeled <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> magicks."},{"name":"LALAHJINJAHL","text":"From this primitive design, nouliths gradually evolved into their present form. While their construction is far more sophisticated, the basic principle remains unchanged."},{"name":"LALAHJINJAHL","text":"In practice, the sage wields nouliths as an extension of <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">his</span></span> mind, sending them darting through the air to weave the arcane patterns through which <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> unleashes advanced magicks."},{"name":"LALAHJINJAHL","text":"If they sound difficult to wield, well, it is because they are. Even the Studium's most talented require years of training to become proficient."},{"name":"LALAHJINJAHL","text":"But you have an advantage that transcends talent: the crystal has chosen you. With its knowledge, the technique will come more naturally to you than others."},{"name":"LALAHJINJAHL","text":"Now, as much as I would like to have you try your hand with the nouliths at once, I have just received promising intelligence from command."},{"name":"LALAHJINJAHL","text":"Apparently, our fugitives have taken themselves to Idyllshire, in the Dravanian hinterlands. Let us make our way there at once!"},{"name":"LALAHJINJAHL","text":"So this is Idyllshire! The tales do not do the place justice. Truly impressive what the goblins and their fellow scavengers have managed to build upon the ruins of our colony!"},{"name":"LALAHJINJAHL","text":"Ahem, to the task at hand... As I mentioned before, we have reason to believe that the fugitives have recently passed through this town, and may even still be here."},{"name":"LALAHJINJAHL","text":"For the sake of efficiency, I suggest we split up and search. I will see to the town's south, if you could tend to the north."},{"name":"GUILDIVAIN","text":"(-???-)Help! Somebody, please─I need help!"},{"name":"LALAHJINJAHL","text":"Did you hear that!?"},{"name":"LALAHJINJAHL","text":"That man is in trouble!"},{"name":"LOIFA","text":"(-Angry Viera-)Look at me..."},{"name":"LOIFA","text":"(-Angry Viera-)...When I'm talking to you!"},{"name":"LALAHJINJAHL","text":"Stop this at once!"},{"name":"LALAHJINJAHL","text":"A sage's barrier...?"},{"name":"MAHAUD","text":"(-Silver-haired Thaumaturge-)Loifa..."},{"name":"ANCEL","text":"(-Brawny Pugilist-)Too many eyes and ears. We'd best leave."},{"name":"LOIFA","text":"(-Loifa-)I don't know who you are, and I don't care. Do not get in our way again. You've been warned."},{"name":"LALAHJINJAHL","text":"W-Wait!"},{"name":"LALAHJINJAHL","text":"That was them─our fugitives. But why did their leader protect you?<br>...Ack, such questions must wait. We must render aid to this man."},{"name":"GUILDIVAIN","text":"Thank you... Had you not intervened when you did, I dread to think what might have become of me."},{"name":"GUILDIVAIN","text":"(-Faldrinet-)Permit me to introduce myself. Faldrinet of Sharlayan, at your service."},{"name":"LALAHJINJAHL","text":"Truly!?"},{"name":"LALAHJINJAHL","text":"I am Sharlayan too─a recent graduate of the Studium, in fact. Would you mind telling us what happened?"},{"name":"GUILDIVAIN","text":"(-Faldrinet-)Oho, that an alumna should come to my rescue! Thaliak watches over His own! As to what happened...what is there to say? I was going about my business when they set upon me, without warning or provocation."},{"name":"LALAHJINJAHL","text":"I see... What is your business, if you do not mind my asking?"},{"name":"GUILDIVAIN","text":"(-Faldrinet-)Healing. The provision of it, that is. I am a sage, you see, and I travel the realm, providing treatment gratis to those who cannot afford it."},{"name":"LALAHJINJAHL","text":"A sage besides! Speaking of which, one of your assailants─the Viera man─also wielded sage magic. Was he known to you?"},{"name":"GUILDIVAIN","text":"(-Faldrinet-)No, I had never so much as laid eyes upon him before. I do have an inkling, however, as to why the villains have come here."},{"name":"GUILDIVAIN","text":"(-Faldrinet-)If they use the sage's art for ill, then their destination is like to be Saint Mocianne's Arboretum."},{"name":"LALAHJINJAHL","text":"The arboretum? What could they possibly seek in that abandoned place?"},{"name":"GUILDIVAIN","text":"(-Faldrinet-)Following the exodus, the cultivation of certain plants became forbidden in Sharlayan. But that which can no longer be found in the motherland still grows freely there, among which are potent-but-dangerous herbs..."},{"name":"LALAHJINJAHL","text":"I see! That does stand to reason, and I daresay it was for your knowledge that the fugitives attacked you."},{"name":"GUILDIVAIN","text":"(-Faldrinet-)Hmmm... You too are a sage, yet you do not appear to be Sharlayan. How did you come by your soul crystal?"},{"name":"LALAHJINJAHL","text":"The good people of Physis Technon had entrusted the crystal to me. And when it exhibited a strong resonance in <span class=\"highlight\">Forename</span>'s presence, I in turn entrusted it to <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span>."},{"name":"GUILDIVAIN","text":"(-Faldrinet-)Then...you were <span class=\"emphasis\">chosen</span> to inherit..."},{"name":"LALAHJINJAHL","text":"Is aught amiss, Master Faldrinet?"},{"name":"GUILDIVAIN","text":"(-Faldrinet-)No, no, 'tis nothing. I was but struck by the remarkable providence to have crossed paths with sages so far from home."},{"name":"GUILDIVAIN","text":"(-Faldrinet-)Ours is a reclusive nation, after all; our policy to observe, not intervene."},{"name":"GUILDIVAIN","text":"(-Faldrinet-)This did not sit well with me, and so I left Sharlayan behind─as the great Master Louisoix once did. And though I would never dare equate myself to him, I too believe it my duty to alleviate suffering in the world."},{"name":"LALAHJINJAHL","text":"So that's what brought you to Eorzea. You are a noble soul, Master Faldrinet, and I commend your resolve."},{"name":"GUILDIVAIN","text":"(-Faldrinet-)Well, I must return to the road. I thank you again for coming to my aid. Till next we meet, let us both endeavor to seek out new knowledge and possibilities─for the betterment of mankind."},{"name":"LALAHJINJAHL","text":"Let us head to Saint Mocianne's Arboretum at once."},{"name":"LALAHJINJAHL","text":"Given what we know of the fugitives, I had considered that they might be after knowledge sealed in the Great Gubal Library, but Master Faldrinet presents a compelling theory."},{"name":"LALAHJINJAHL","text":"And for an all-but-proven theory of my own: our quarry have clearly enhanced themselves with sage magic. I had suspected as much given what they stole, but the leader's actions earlier leave little room for doubt. Not that it gives us any greater insight into who they are or their ultimate goal..."},{"name":"LALAHJINJAHL","text":"Regardless, to use a sage's soul crystal for ill is unforgivable, and I'll not rest until these criminals have been brought to justice!"},{"name":"LALAHJINJAHL","text":"...R-Right, to the arboretum! Our mission aside, I daresay it will be an ideal place for your training."},{"name":"LALAHJINJAHL","text":"By the Scholar, so this is Saint Mocianne's Arboretum! From the illustrations, I did not think it would be so immense!"},{"name":"LALAHJINJAHL","text":"It may interest you to know that this place holds special meaning to sages. From ancient strains to crossbred creations, myriad medicinal plants have been cultivated within its halls."},{"name":"LALAHJINJAHL","text":"Alas, in the wake of the exodus fifteen years ago, this once-magnificent institution has fallen into ruin..."},{"name":"LALAHJINJAHL","text":"Still, there's a certain charm in seeing nature reassert her dominion. Why, it must be a veritable menagerie of rare wildlife within! I should like to spend a day studying them, field guide in hand..."},{"name":"LALAHJINJAHL","text":"...Ahem. Forgive me─this isn't a field trip, but a mission."},{"name":"LALAHJINJAHL","text":"Our objective is to find the fugitives, and failing that, clues that will lead us to them. Please see to your preparations─a spot of practice with your spells would not go astray─and then we shall venture in."},{"name":"SYSTEM","text":"You have learned all sage actions and traits to level 70. Detailed descriptions can be viewed in the <span class=\"highlight\">Actions & Traits</span> window, accessed under <span class=\"highlight\">Character</span> in the main menu."},{"name":"LALAHJINJAHL","text":"If you are ready, then let us venture forth!"},{"name":"SYSTEM","text":"Your progress through the battle will be saved at certain points. In the event that you are defeated, you will be able to try again from the most recent of these."},{"name":"SYSTEM","text":"Please note that if you enter battles associated with other quests or log out from the game, this progress will be lost."},{"name":"LALAHJINJAHL","text":"Fugitives! In the name of the Forum, I demand you surrender yourselves at once!"},{"name":"LOIFA","text":"Of all the weapons to bare against us..."},{"name":"LOIFA","text":"No matter. I warned you once, and I won't warn you again!"},{"name":"ANCEL","text":"Loifa, we don't have time for this!"},{"name":"LOIFA","text":"You held your own against the enhanced..."},{"name":"LOIFA","text":"But aye, that's enough sport for now. The mission takes precedence."},{"name":"LALAHJINJAHL","text":"Confound it, not again!"},{"name":"LALAHJINJAHL","text":"What's this...?"},{"name":"LALAHJINJAHL","text":"The pouch they dropped contained a plant─what they came for, I shouldn't doubt. 'Tis some manner of herb, but none I've seen in the course of my studies."},{"name":"LALAHJINJAHL","text":"And as I made my way out, I also stumbled upon what appears to be a diary by the entrance."},{"name":"LALAHJINJAHL","text":"Though much of its contents are magically obfuscated, I could make out some somanoutical terms, so we may assume it belonged to a sage."},{"name":"LALAHJINJAHL","text":"As we continue our pursuit, I will work on lifting the enchantment. When you have a moment, please feel free to peruse the contents in Idyllshire."},{"name":"LALAHJINJAHL","text":"On that note, let us head back to the settlement."},{"name":"LALAHJINJAHL","text":"I've dispatched the plant to Sharlayan for identification. When we learn what it is, I believe we will gain insight into the villains' objective."},{"name":"LALAHJINJAHL","text":"Now, tell me, <span class=\"highlight\">Forename</span>─have you been practicing with the nouliths while I wasn't looking? I ask because, even with the crystal's knowledge, you demonstrated remarkable proficiency."},{"name":"LALAHJINJAHL","text":"Regardless, 'tis plain you have a gift for the art. The sages whose memories reside in the crystal must be beaming with pride."},{"name":"LALAHJINJAHL","text":"Though sometimes I cannot help but wonder... If the sage's art was created for the betterment of mankind, why, then, does it incorporate techniques which inflict harm?"},{"name":"LALAHJINJAHL","text":"And the fugitives... What could have compelled them to spurn our homeland's prescribed policy, as Master Louisoix and Master Faldrinet have?<br>...Ack, but I muse to no avail."},{"name":"LALAHJINJAHL","text":"It will be a while before we hear back regarding the plant. Until we do, please take the opportunity to continue honing your skills."},{"name":"LALAHJINJAHL","text":"As you go about your training, remember to heed the voices within your soul crystal. Do so, and your predecessors will surely grant you the wisdom to protect those you hold dear."},{"name":"SYSTEM","text":"A <span class=\"highlight\">diary of a sage</span> is now available for perusal. More entries will become legible as you progress through the story."},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Leaving Idyllshire.”"}],"reward":{"gil":2383},"reqs":{"jobs":[{"lvl":70,"id":181}],"quests":[69603]},"next":[69605]},"partials":[{"type":"npc","id":"1039265","obj":{"i":1039265,"n":"Lalah Jinjahl","l":30,"q":2}},{"type":"npc","id":"1039249","obj":{"i":1039249,"n":"Lalah Jinjahl","l":2082,"q":5}},{"type":"quest","id":"69603","obj":{"i":69603,"n":"Sage's Path","g":164,"l":"Limsa Lominsa","s":700,"f":1}},{"type":"quest","id":"69605","obj":{"i":69605,"n":"Sands of Despair","g":164,"l":"Idyllshire","s":730,"f":1}}]}