{"quest":{"name":"Life Ephemeral, Path Eternal","location":"Idyllshire","id":69608,"patch":6.0,"sort":800,"icon":101095,"unlocksFunction":1,"eventIcon":71341,"issuer":1039249,"target":1039280,"genre":164,"journal":["Her preparations complete, Lalah stands ready to bring the reckoning to Guildivain.","Lalah informs you that she has finished preparing her countermeasure against Guildivain. With all finally in readiness, the three of you set out for the Hundred Throes in the Dravanian forelands, where the villain has made his lair.","By the entrance to Guildivain's cave, Lalah reveals to you the countermeasure: a set of garments imbued with a special enchantment to shield you from your foe's influence. Changing into your new attire, you venture into the cave, where you find Guildivain waiting with Mahaud and Ancel.","In service to his twisted research, Guildivain sets Mahaud and Ancel against you, but you succeed in freeing the pair from their enthrallment. Undeterred─and indeed delighted by your feat─the disgraced sage then transforms into a fearsome fiend to personally carry out his tests, but with your staunch comrades at your side, you weather the worst of his fell magicks and subdue him.","Though Ancel wants nothing more than to put Guildivain out of his misery, Mahaud believes that Loifa should be the one to decide the villain's fate. And true to his pledge, he spares the man in favor of having him face justice in Sharlayan. Loifa then offers to return his soul crystal to Lalah, but she bids him keep it and, through his deeds, bring honor to her mother's memory.","Upon returning to Idyllshire, Lalah informs Loifa and his friends that she has reported their disappearance to her superiors. As the sordid details of Guildivain's experiments have been brought to light─possibly in spite of the Forum's best efforts─the former fugitives' innocence has been made plain. Thus do they need no longer fear pursuit by the Sharlayan authorities and are free to begin anew. Loifa promises to use his powers for good while seeking a cure for Mahaud and Ancel, and they will likewise continue to stand by him. Inspired by their resolve, you make a silent pledge to continue doing your part, bearing the hopes of sages past and fighting for the future of all lives."],"objectives":["Speak with Lalah Jinjahl at the Hundred Throes.","Speak with Lalah Jinjahl again.","Speak with Loifa in Idyllshire."],"dialogue":[{"name":"LOIFA","text":"Soon... Soon, we will rescue Mahaud and Ancel, and settle the score with Guildivain..."},{"name":"LALAHJINJAHL","text":"My apologies for the wait─the countermeasure is ready. As it is quite delicate, however, I will hold on to it until the moment of reckoning."},{"name":"LALAHJINJAHL","text":"Good. Let us make for Guildivain's lair at once."},{"name":"LOIFA","text":"Has there been further word on Mahaud and Ancel?"},{"name":"LALAHJINJAHL","text":"My fellow operative reports that your friends are still alive. And together, we will ensure that they remain so."},{"name":"LOIFA","text":"Thank you, thank you... Though to me, they are more than just friends─they are family."},{"name":"LALAHJINJAHL","text":"Our destination lies in the northeast of the Dravanian forelands, where the Sohm Al foothills meet the Hundred Throes. The cave entrance is just west of the springs."},{"name":"LOIFA","text":"Understood. I'll go on ahead to scout out the area."},{"name":"LALAHJINJAHL","text":"This is it, <span class=\"highlight\">Forename</span>─Guildivain's lair. Remember, our chief concern is Mahaud and Ancel's safety."},{"name":"LALAHJINJAHL","text":"As for the countermeasure─'tis a set of garments imbued with a special enchantment to shield you from Guildivain's influence. Should the worst come to the worst, it will keep you safe─and our hopes alive."},{"name":"LALAHJINJAHL","text":"As I mentioned, they are rather delicate, but I guarantee that they will last you this one battle. When you are ready to sally forth, I will have you change into them."},{"name":"SYSTEM","text":"During the battle, some of your gear will be glamoured. Your attributes and abilities will be unaffected."},{"name":"LALAHJINJAHL","text":"So... Are you ready, <span class=\"highlight\">Forename</span>?"},{"name":"LOIFA","text":"Mahaud! Ancel!"},{"name":"MAHAUD","text":"Unngh! Ahhhhhh!"},{"name":"ANCEL","text":"Grrr... Arrrggghhh!"},{"name":"LOIFA","text":"What have you done to them, you bastard!?"},{"name":"GUILDIVAIN","text":"My, such anger, when you should instead feel joy for your friends! They have the opportunity to contribute to mankind's future."},{"name":"GUILDIVAIN","text":"For the frailty of our flesh, so much knowledge and skill and experience are forever lost. An unconscionable and unacceptable waste!"},{"name":"GUILDIVAIN","text":"A lasting solution to the problem will not come without additional sacrifice. 'Tis unavoidable. But <span class=\"emphasis\">you</span>, my friend─you are an invaluable living specimen, and I give thanks for the opportunity to study you further!"},{"name":"LALAHJINJAHL","text":"You monster! How many lives have been lost and torn apart at your twisted whims!?"},{"name":"GUILDIVAIN","text":"You play the part of the indignant moralist well. Pity. As a fellow Sharlayan, I held out hope that you, at least, would come to appreciate my vision. Alas, you are as shortsighted as the rest."},{"name":"GUILDIVAIN","text":"But no matter. You can yet serve a purpose─as a benchmark for my progress. Oh yes, all the elements are present for a test of strength."},{"name":"GUILDIVAIN","text":"Mahaud, Ancel. Kill these self-righteous fools."},{"name":"MAHAUD","text":"(-Mahaud and Ancel-)GRAAAAAARRRGH!!!"},{"name":"LOIFA","text":"Hold on, my friends! We'll save you!"},{"name":"LALAHJINJAHL","text":"It should be possible to break Guildivain's control. We just need to find an opening..."},{"name":"LALAHJINJAHL","text":"As for you─I would thank you never to call me a fellow Sharlayan."},{"name":"LALAHJINJAHL","text":"It sickens me to think that you are a compatriot."},{"name":"GUILDIVAIN","text":"My, my, the animosity is fairly palpable. I had best make myself scarce."},{"name":"LOIFA","text":"Mahaud! Ancel!"},{"name":"LOIFA","text":"Forgive me... I didn't want to hurt you..."},{"name":"GUILDIVAIN","text":"Huh... 'Twould seem you possess a heightened affinity for the sage's art."},{"name":"GUILDIVAIN","text":"Hah hah hah! That I should be blessed with such fine specimens for my research! We must see what else you can do! Yes, we must!"},{"name":"LALAHJINJAHL","text":"Watch out!"},{"name":"LOIFA","text":"What...?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"You have a promise to keep."},{"name":"A1","text":"Now we're even."},{"name":"LOIFA","text":"Aye... I won't fall. Not again."},{"name":"LOIFA","text":"Through all the suffering and sacrifice, I'm still here. I'm still alive."},{"name":"LOIFA","text":"And so long as I live, I refuse to let anyone else die on me."},{"name":"LOIFA","text":"What say you, Mahaud, Ancel?"},{"name":"MAHAUD","text":"As if you needed to ask."},{"name":"ANCEL","text":"Where you go, we follow. You know this."},{"name":"LALAHJINJAHL","text":"I believe in you too, Loifa. In you and <span class=\"highlight\">Forename</span> both."},{"name":"LOIFA","text":"Guildivain! You wanted to see what else we could do, right!? Then come and find out!"},{"name":"GUILDIVAIN","text":"Hahaha... Ahahahahaha!"},{"name":"GUILDIVAIN","text":"Marvelous! Absolutely marvelous!"},{"name":"GUILDIVAIN","text":"Do not hold back, my dear subjects, for neither shall I! For the betterment of mankind, let us transcend the limits of our flesh together!"},{"name":"LOIFA","text":"..."},{"name":"ANCEL","text":"What are we waiting for? Let's kill him and have done with it!"},{"name":"MAHAUD","text":"No, Ancel. It should be Loifa's decision."},{"name":"LOIFA","text":"This power that I have, born of untold sacrifice..."},{"name":"LOIFA","text":"I swore that I would use it only to protect life. Not take it."},{"name":"LOIFA","text":"Guildivain will face justice back in his homeland, where he committed his most heinous crimes."},{"name":"LOIFA","text":"I'm sorry, my friends."},{"name":"LOIFA","text":"Lalah. This crystal was your mother's, and it rightfully belongs to you."},{"name":"LALAHJINJAHL","text":"It's already where it belongs. Through your deeds, bring honor to my mother's memory."},{"name":"LALAHJINJAHL","text":"I will strive to do the same─with my trusty sword and shield."},{"name":"LALAHJINJAHL","text":"With your blessing, I hereby take Guildivain into custody. He will be transported back to Sharlayan, where he will be tried by the Forum."},{"name":"LALAHJINJAHL","text":"While I tend to the necessary arrangements, you should return to Idyllshire and have a rest. I will join you anon."},{"name":"LALAHJINJAHL","text":"This mercy is more than you deserve, but you will answer for your crimes. Every last one."},{"name":"LALAHJINJAHL","text":"When I set out from Sharlayan, I wanted to reclaim my mother's soul crystal. Wanted it as a memento to remember her by."},{"name":"LALAHJINJAHL","text":"But I've come to realize that there is no better way to remember her than by the legacy of her deeds in life."},{"name":"LALAHJINJAHL","text":"She was the gentlest and noblest of women, one who never flinched in the face of danger when someone was in need of succor."},{"name":"LALAHJINJAHL","text":"And I will endeavor to do honor to that legacy by rising to the defense of those in need of protection."},{"name":"LALAHJINJAHL","text":"This includes Loifa and his friends. So in case you worry for them─don't."},{"name":"LALAHJINJAHL","text":"You should return to Idyllshire as well. Gods know you deserve a rest too."},{"name":"LALAHJINJAHL","text":"Please go on ahead back to Idyllshire. I will follow anon."},{"name":"GUILDIVAIN","text":"Heh heh heh... Marvelous... Absolutely marvelous... Do you not agree...Hatia dearest?"},{"name":"MAHAUD","text":"We have a chance to see our mother again, and we owe it you."},{"name":"ANCEL","text":"For revenge, we were prepared to die...but now we have a reason to live."},{"name":"LOIFA","text":"You took your time. Let me guess: you were talking with your superiors, and making arrangements to send us back to Sharlayan as well."},{"name":"LALAHJINJAHL","text":"(-Lalah Jinjahl-)We had a long and difficult conversation, I must confess."},{"name":"LALAHJINJAHL","text":"Though they were pleased that Guildivain would be returning to Sharlayan─alive, no less─they were deeply disappointed to hear that the fugitives escaped. And that, despite my best efforts, I could not pick up their trail again."},{"name":"LALAHJINJAHL","text":"Though I don't exactly mistrust the Forum, I do have reason to believe that they knew more about Guildivain's activities than they let on. Perhaps they were hoping for a resolution that wouldn't see the sordid details of his experiments brought to light..."},{"name":"LALAHJINJAHL","text":"But now that it's all going to be out in the open, and your innocence has been made plain, my superiors will no longer think to pursue you. You are free to begin anew─which is the very least you deserve after all you have suffered."},{"name":"LOIFA","text":"Well, now. You're surprisingly reasonable for a mull-headed Sharlayan."},{"name":"LALAHJINJAHL","text":"I beg your pardon! A simple “thank you” would have sufficed!"},{"name":"LOIFA","text":"I never asked for my powers, but fate has decreed that I have them."},{"name":"LOIFA","text":"And I will use them as they were intended, and fight for the future of all lives."},{"name":"LOIFA","text":"I'll also seek a cure for the procedure's side effects."},{"name":"LOIFA","text":"And when I succeed, my friends will finally be able to return home, safe in the knowledge that they won't lose control again."},{"name":"MAHAUD","text":"We can't thank you enough for coming to our aid."},{"name":"ANCEL","text":"Aye. If it weren't for you, we would've been dead or worse."},{"name":"ANCEL","text":"We'd all but given up on ourselves and lived only for revenge. But you've given us a second chance, and we won't waste it."},{"name":"MAHAUD","text":"We'll aid Loifa in his research, of course, and it'll be as much for his sake as ours. For all his bravado, he can't stand to be alone."},{"name":"LOIFA","text":"Wh-What!?"},{"name":"ANCEL","text":"Aye, we thought that Viera men prefer solitude, but not our Loifa. Deep down, he's a lonely little boy."},{"name":"LALAHJINJAHL","text":"Family indeed..."},{"name":"LALAHJINJAHL","text":"As a little girl, I regarded the sages of eld with awe. In the tales, all were stern, nigh-mythical figures, untouchable in their virtues and ideals."},{"name":"LALAHJINJAHL","text":"But the more I think on it, the more I am convinced that these legends cannot have been so unlike us. No, they were ordinary folk who bore great love for friends and family. And that love extended to all life."},{"name":"LALAHJINJAHL","text":"Now more than ever, I see this love in my dear departed mother. And though I still have much and more to learn, ever will I endeavor to do her proud."},{"name":"LALAHJINJAHL","text":"Thank you, <span class=\"highlight\">Forename</span>. I couldn't have learned these lessons─or accomplished my mission─without you. As our work is done, our time together is over. But I shall linger in Eorzea a while, and hope to see more of you and hear your tales."}],"reward":{"gil":3031,"action":24311},"reqs":{"jobs":[{"lvl":80,"id":181}],"quests":[69607]}},"partials":[{"type":"npc","id":"1039249","obj":{"i":1039249,"n":"Lalah Jinjahl","l":2082,"q":5}},{"type":"npc","id":"1039280","obj":{"i":1039280,"n":"Loifa","l":2082,"q":1}},{"type":"action","id":"24311","obj":{"i":24311,"n":"Panhaima","c":3679,"j":40,"t":4,"l":80}},{"type":"quest","id":"69607","obj":{"i":69607,"n":"Pledge of Hope","g":164,"l":"Idyllshire","s":780,"f":1}}]}