{"quest":{"name":"Those Who Serve","location":"The Firmament","id":69616,"patch":5.5,"sort":1503,"unlocksFunction":1,"eventIcon":71341,"issuer":1036127,"target":1036494,"genre":84,"journal":["Maurilette wishes to teach Charlemend and Maelie the particulars of patient rehabilitation."],"objectives":["Find Maelie.","Speak with Charlemend."],"dialogue":[{"name":"MAURILETTE","text":"If you are ready, I shall explain how to assist our patients in their rehabilitation."},{"name":"MAELIE","text":"I'm ready, Maurilette!"},{"name":"RONANTAIN","text":"(-???-)There you are, Uncle!"},{"name":"CHARLEMEND","text":"R-Ronantain! What are you doing here?"},{"name":"RONANTAIN","text":"I'm here to bring you back to your senses! Since returning from abroad, you have turned your back on your highborn peers, choosing instead to consort with lowborn rabble!"},{"name":"RONANTAIN","text":"And as if that weren't unseemly enough, it transpires that you are working at an infirmary used by commoners! Your actions threaten to erode the standing that we nobles have had for generations!"},{"name":"RONANTAIN","text":"You've taught me everything I know, Uncle. You've taught me to follow in your footsteps, and I wanted naught more than to do you proud."},{"name":"RONANTAIN","text":"But now I scarcely recognize you! Whatever has happened to the man I so respected? Wherever he has gone, I want him back!"},{"name":"CHARLEMEND","text":"...My apologies for the commotion. Please, continue."},{"name":"MAURILETTE","text":"Are you certain, Charlemend? Should you not attend to your nephew first?"},{"name":"CHARLEMEND","text":"Nay, this is a family matter, and I will not have it disrupt our work. I shall have words with my nephew afterwards."},{"name":"MAELIE","text":"But he looked so sad and lonely... I'm goin' after him!"},{"name":"MAELIE","text":"Come with me, <span class=\"highlight\">Forename</span>!"},{"name":"MAELIE","text":"The equipment you made is goin' to make our patients better! Isn't that great?"},{"name":"MAURILETTE","text":"It is a starkly different world in which the nobles live. One which brings its own unique challenges."},{"name":"MAELIE","text":"There he is, <span class=\"highlight\">Forename</span>! Ronantain!"},{"name":"RONANTAIN","text":"Hmph, that's <span class=\"emphasis\">Lord</span> Ronantain to you!"},{"name":"MAELIE","text":"Oh, hmph yourself! Don't you know there's no more highborn and lowborn? We're all just Ishgardians now. Your uncle himself said so!"},{"name":"MAELIE","text":"But never mind that now. You have to make up with him, you know. Your uncle. You do like him, don't you?"},{"name":"RONANTAIN","text":"Th-That's none of your business!"},{"name":"RONANTAIN","text":"But...you have the right of it. Since my father died in the war, my uncle has treated me as his own son. There is no one I admire more. But of late, I struggle to understand him..."},{"name":"MAELIE","text":"Might be as you don't understand him, but your uncle's a good man. And you have to cherish the family you've got. So come on, let's go back to the infirmary."},{"name":"RONANTAIN","text":"Bah, fine! I'll return, but do not think for a moment that it is because you said so!"},{"name":"MAELIE","text":"Family should get along. Isn't that right?"},{"name":"RONANTAIN","text":"..."},{"name":"MAURILETTE","text":"You found Ronantain? That is well."},{"name":"CHARLEMEND","text":"Forgive me, <span class=\"highlight\">Forename</span>, Maelie. 'Twas not my wish to embroil you in family affairs."},{"name":"RONANTAIN","text":"Not only do you keep the company of commoners; you would even bow to them!? We are of the noble blood of the knights twelve! Surely you've not forgotten this!"},{"name":"CHARLEMEND","text":"Listen well, my dear boy. While it is important to uphold tradition and honor our ancestors, I have come to see that it is wrong to look down upon others simply on account of their birth."},{"name":"CHARLEMEND","text":"Besides, as you too should know, it has since been revealed that <span class=\"emphasis\">all</span> Ishgardians are descended from the knights twelve. This makes all of us equal according to our very own traditions."},{"name":"CHARLEMEND","text":"After centuries upon centuries of the privileged standing we nobles have enjoyed, it is no easy thing to accept change. But the age where one's birth determines one's worth has ended, and change will come whether we will it or no."},{"name":"CHARLEMEND","text":"Hereon, 'tis our deeds that shall speak for us. That shall dictate our place in the world."},{"name":"CHARLEMEND","text":"To use an analogy─when you are exhausted after combat training, what is it that you desire?"},{"name":"RONANTAIN","text":"...That would be rest, I suppose. And perhaps some sweets with tea."},{"name":"CHARLEMEND","text":"In like manner, at the end of a thousand-year war, the people of Ishgard yearn for the sweetness of stability. But stability will not manifest of its own accord. Nay, hard work is necessary to bring it about."},{"name":"CHARLEMEND","text":"So I ask you, in an age such as this, whom would you respect more? A man who sits idly by, waiting for the sweets to appear at his table? Or a man who busies himself in an effort to see everyone served?"},{"name":"RONANTAIN","text":"I...I would respect the latter─the man who would see everyone served."},{"name":"CHARLEMEND","text":"As you should, my boy. And I know none who serves more diligently than young Maelie here, who places the needs of the patients above all else."},{"name":"CHARLEMEND","text":"Learning from her fine example, I too am striving to be a man who serves others."},{"name":"CHARLEMEND","text":"In this way do I hope to set my own example for you, my heir."},{"name":"RONANTAIN","text":"You're doing this...for me?"},{"name":"CHARLEMEND","text":"This came to me in the course of my analogy, but I understand that the rehabilitation process can be trying upon body and mind both."},{"name":"CHARLEMEND","text":"Might we not likewise treat our patients to sweets and tea? I believe it would serve to lift their spirits as they work towards recovery."},{"name":"MAELIE","text":"Ooh, what a great idea! We had high tea once at the orphanage, and it was really fun!"},{"name":"MAURILETTE","text":"Hm, a high tea shouldn't tax the patients... Very well, let's do it!"},{"name":"MAURILETTE","text":"<span class=\"highlight\">Forename</span>─as before, we would be grateful if you could provide us with the items we require."},{"name":"MAELIE","text":"You oughta give us a hand too, Ronantain!"},{"name":"MAELIE","text":"Um, Maurilette? Ronantain doesn't work here, but it's all right if he helps, right?"},{"name":"MAURILETTE","text":"Just this once, I believe an exception can be made."}],"reward":{"items":[{"num":3,"id":30481,"one":1,"hq":1},{"num":3,"id":30482,"one":1,"hq":1}]},"reqs":{"jobs":[{"lvl":70,"id":35}],"quests":[69615]}},"partials":[{"type":"npc","id":"1036127","obj":{"i":1036127,"n":"Maurilette","l":3435,"q":1}},{"type":"npc","id":"1036494","obj":{"i":1036494,"n":"Charlemend","l":3435,"q":1}},{"type":"item","id":"30481","obj":{"i":30481,"n":"Crab Cakes","l":490,"c":24329,"t":46}},{"type":"item","id":"30482","obj":{"i":30482,"n":"Chili Crab","l":490,"c":24328,"t":46}},{"type":"quest","id":"69615","obj":{"i":69615,"n":"You Can Count on It","g":84,"l":"The Firmament","s":1502,"f":1}}]}