{"quest":{"name":"The Killing Art","location":"Ul'dah","id":69614,"patch":6.0,"sort":800,"icon":101096,"unlocksFunction":1,"eventIcon":71341,"issuer":1036631,"target":1036630,"genre":165,"journal":["Hermin seems to be in a fit of pique, her anger directed at something you cannot see.","A chilling gift was delivered not long ago to Lemures headquarters: a letter writ in blood, stating that Orcus awaits you at the Dusk Vigil. In response, Hermin summons all members of the family willing and able to fight. Sensing that this group, however loyal, would be summarily dispatched by the voidsent, you convince them to stay behind. Hermin reluctantly agrees, but bids you take Drusilla's scythe, for a reaper is naught without their weapon, and their leader will surely need hers. The Lemures send you off with a cheer...though as you journey to the Dusk Vigil, you sense a presence shadowing your every step...","Upon your arrival at the designated location, Orcus contacts and urges you deeper into the ruins, until you come face-to-face with the voidsent in a windswept chamber, where he eagerly awaits your coming together with a battered but still breathing Drusilla. Reveling in the cornucopia of fear and hatred you have become, Orcus attacks, ready to avail himself of his meal, but you prove tougher than he anticipated. Distracted by your valiant opposition, Orcus fails to notice Drusilla regain consciousness, and once your mentor reclaims her scythe, the two of you quickly overpower your malevolent foe. The monster is defeated, but still lives, and the right of vengeance falls to one woman...","With a final swing of her scythe, Drusilla ends the curse that her grandfather unleashed upon the world. There are no more words to share, and Drusilla decides it is time to return to Lemures headquarters─to return home.<br><br>※You may re-enter Lemures headquarters by speaking with the loyal Lemure in Pearl Lane.","Though Drusilla still mourns Arnegis and believes herself unfit to lead for having dragged the family into her personal vendetta, the Lemures will hear none of it. They remain loyal to her for having saved their lives and giving them a place to call home. Taking their words to heart, Drusilla declares that the Lemures will no longer be defined by their past ties, but by their shared future. She then welcomes you anew to her family, to the enthusiastic approval of all. With the Lemures poised to enjoy relative peace and quiet for a time, Drusilla bids you farewell─but also encourages you to look in on the family when you grow weary from the weight of the world."],"objectives":["Wait at the designated location near Banepool.","Enter Lemures headquarters.","Speak with Drusilla."],"dialogue":[{"name":"HERMIN","text":"When I get my hands on him─ Oh, <span class=\"highlight\">Forename</span>! Listen, we've found out where the boss is being held. But I'm warning you, the how of it isn't pretty."},{"name":"HERMIN","text":"An envelope arrived at headquarters this morning. I opened it, and inside was...was..."},{"name":"HERMIN","text":"...Shite! Inside was a letter, writ in blood!"},{"name":"HERMIN","text":"There's no doubting whose it was. Orcus is reveling in his own cruelty. The letter said he's waiting for us at the Dusk Vigil. Gods know what he's doing to her now."},{"name":"HERMIN","text":"I've called on every able-bodied member of the family for this one. We're heading out as soon as everyone's assembled."},{"name":"LEMURESMEMBERA","text":"We're here, Hermin, and more are waiting outside! We're ready to repay the debt we owe Drusilla─with our lives if we must!"},{"name":"LEMURESMEMBERC","text":"With souls courageous, hearts of hardened steel,<br>For leader's sake; for family's ideal<br>Into the demon's lair they soon shall tread,<br>To end his terror foul, his reign of dread."},{"name":"HERMIN","text":"The boss would beam with pride to see this group of cold-blooded killers. Alright, <span class=\"highlight\">Forename</span>, we're ready when you say the word."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"This is a job for a reaper, and a reaper alone."},{"name":"A1","text":"Face Orcus, and you won't be coming back."},{"name":"HERMIN","text":"What!? Now, we might not hold a candle to the likes of you, but we've got skills!"},{"name":"HERMIN","text":"You'll need someone to distract Orcus, right? Then you can move in for the kill while his back is turned. Don't tell us to stay here with our thumbs up our arses while the boss is suffering!"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Don't make me repeat myself!"},{"name":"A2","text":"Drusilla wouldn't want you throwing your lives away."},{"name":"HERMIN","text":"Why, you..."},{"name":"HERMIN","text":"What do you know about what she wants!?"},{"name":"LEMURESMEMBERA","text":"Hermin, listen. Maybe...maybe <span class=\"alternative-container\"><span class=\"alternative\">she's</span><span class=\"alternative\">he's</span></span> right."},{"name":"HERMIN","text":"I <span class=\"emphasis\">know</span> <span class=\"alternative-container\"><span class=\"alternative\">she's</span><span class=\"alternative\">he's</span></span> right, godsdammit. Doesn't mean it doesn't chafe. The boss wouldn't trust just any <span class=\"alternative-container\"><span class=\"alternative\">woman</span><span class=\"alternative\">man</span></span> with the reapers' arts. And <span class=\"highlight\">Forename</span> has proven <span class=\"alternative-container\"><span class=\"alternative\">herself</span><span class=\"alternative\">himself</span></span> worthy time and again."},{"name":"HERMIN","text":"If you're going alone, take that with you."},{"name":"HERMIN","text":"For the boss. No self-respecting reaper can reap without their scythe."},{"name":"HERMIN","text":"Now go and make Orcus rue the day he crossed into this world!"},{"name":"HERMIN","text":"Bring her back safe, <span class=\"highlight\">Forename</span>, and yourself as well. Family doesn't leave family behind."},{"name":"ORCUS","text":"(-Orcus-)There you are, <span class=\"highlight\">Forename</span>. My prize repast. Come forward."},{"name":"ORCUS","text":"Mmm... I can smell it. Your fear. Your hatred."},{"name":"ORCUS","text":"Your tender, marbled soul. My masterpiece, ripe for the slaughter."},{"name":"ORCUS","text":"I'll savor every bite! Strip the flesh from your bones, crack them open to sup upon the marrow for moons!"},{"name":"ORCUS","text":"How I hungered, how I thirsted! Enraptured by the thought of your sweet essence trickling down my throat!"},{"name":"ORCUS","text":"Never have I suffered so in waiting, but in beholding your magnificence I see it was worth every agonizing pang!"},{"name":"ORCUS","text":"I do not expect you to leap into my maw willingly. Nor do I desire it. I want you to writhe and struggle unto your dying breath!"},{"name":"ORCUS","text":"Very good. Defiance becomes you..."},{"name":"ORCUS","text":"...Though it begins to bore me."},{"name":"ORCUS","text":"<span class=\"emphasis\">Annoys</span>, rather. 'Tis past time you bared your belly for my blade."},{"name":"ORCUS","text":"Prey's sole purpose is to satisfy!"},{"name":"ORCUS","text":"My word, your aim is terrible!"},{"name":"ORCUS","text":"Ungaaah!"},{"name":"ORCUS","text":"Ugh... How? There should be nothing left of you!"},{"name":"DRUSILLA","text":"Should've learned to chew your food more thoroughly."},{"name":"ORCUS","text":"Fools, the both of you! I won't die so easily!"},{"name":"Q3","text":"What will you say?"},{"name":"A3","text":"Now <span class=\"emphasis\">our</span> feast begins."},{"name":"A3","text":"I don't want it to be easy."},{"name":"A3","text":"......"},{"name":"ORCUS","text":"&lt;cough&gt; ...Ugh... &lt;wheeze&gt; No..."},{"name":"Q4","text":"What will you say?"},{"name":"A4","text":"This ends now, Orcus."},{"name":"A4","text":"The honor is yours, Drusilla."},{"name":"DRUSILLA","text":"Wait. Let me. This has been a long time comin'."},{"name":"DRUSILLA","text":"Thank you, <span class=\"highlight\">Forename</span>."},{"name":"ORCUS","text":"Dripping with fear... Boiled in hatred... I can still...smell its exquisite aroma..."},{"name":"ORCUS","text":"Just...just a taste..."},{"name":"DRUSILLA","text":"It's done. Let's get back to headquarters, <span class=\"highlight\">Forename</span>."},{"name":"HERMIN","text":"Boss! <span class=\"highlight\">Forename</span>!"},{"name":"DRUSILLA","text":"Sorry for causin' you all no end of worry. In trackin' me down you risked life and limb, and for that I thank you. All of you."},{"name":"HERMIN","text":"<span class=\"emphasis\">We</span> didn't risk anything. We just sat here praying until you and <span class=\"highlight\">Forename</span> walked through that door..."},{"name":"DRUSILLA","text":"Don't be so hard on yourself, lass. I know each and every one of you would've joined <span class=\"alternative-container\"><span class=\"alternative\">her</span><span class=\"alternative\">him</span></span> if <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> hadn't talked some sense into you."},{"name":"HERMIN","text":"We owe you our lives, Boss. We owed it to you to return the favor."},{"name":"DRUSILLA","text":"You're more than I deserve. Who forces them they hold dear into a personal vendetta? Who leads family to their death?"},{"name":"ARNEGISWIFE","text":"Arnegis was no fool. He knew and accepted the risks. He placed his faith in you because he believed Orcus had to be stopped─and he was right."},{"name":"ARNEGISWIFE","text":"There'll be no more victims to mourn. He helped you to achieve that victory. It'd be enough for him, and it'll be enough for me."},{"name":"DRUSILLA","text":"You're right. This ain't the time for sulkin'. Arnegis would be the first to tell me that."},{"name":"DRUSILLA","text":"Now's the time to honor his sacrifice. To toast those we have lost, and those still by our sides."},{"name":"DRUSILLA","text":"And to thank the brave souls that led us here. That means you, <span class=\"highlight\">Forename</span>, much as I'd like to take credit for Orcus's demise."},{"name":"DRUSILLA","text":"It was a long, bloody road, but this marks the end of your first assignment as a reaper."},{"name":"DRUSILLA","text":"And what an assignment it was, eh? You might not be Garlean, but you tackled your task with a singular resolve that'd impress the most hardened soldier. I'm proud to call you family."},{"name":"DRUSILLA","text":"We may have founded the Lemures to provide a home for wayward Garleans..."},{"name":"DRUSILLA","text":"...But we're not so different, Garleans and Eorzeans. No great revelation, that, but moments like these help to put it all in perspective."},{"name":"DRUSILLA","text":"This family was a dream that gave us the strength to survive in a strange land."},{"name":"DRUSILLA","text":"But the beautiful thing about dreams, if you ask me, is that they can change. They can get better. So I say that, from this day forward, the Lemures will be united not by origin, but by purpose. Brothers and sisters bound by shared convictions."},{"name":"HERMIN","text":"I don't think anyone will object to that, Boss. The Lemures are ready to welcome people of all stripes."},{"name":"HERMIN","text":"Starting with you, <span class=\"highlight\">Forename</span>─though it was all but official already, eh?"},{"name":"DRUSILLA","text":"Aye. Here's to the birth of a new family, <span class=\"alternative-container\"><span class=\"alternative\">Sister</span><span class=\"alternative\">Brother</span></span>."},{"name":"DRUSILLA","text":"What a day it's been, eh? Hope it'll be a while yet before I've occasion to yammer on that much again."},{"name":"DRUSILLA","text":"Too much talkin's liable to put me in a sentimental mood. Or worse, make me dewy-eyed."},{"name":"DRUSILLA","text":"So let's leave it at that, eh? You ever get weary from the weight of the world on your shoulders, know that our doors will always be open."},{"name":"DRUSILLA","text":"And if you need an ear to bend, a shoulder to weep on, or a stiff bottle to jump inside, I'll be right here, <span class=\"alternative-container\"><span class=\"alternative\">Sister</span><span class=\"alternative\">Brother</span></span>!"},{"name":"SYSTEM","text":"In order to undertake this quest, you must first complete the main scenario quest “Over the Wall.”"}],"reward":{"gil":3751,"action":24394},"reqs":{"jobs":[{"lvl":80,"id":180}],"quests":[69613]}},"partials":[{"type":"npc","id":"1036631","obj":{"i":1036631,"n":"Hermin","l":4022,"q":2}},{"type":"npc","id":"1036630","obj":{"i":1036630,"n":"Drusilla","l":4022,"q":1}},{"type":"action","id":"24394","obj":{"i":24394,"n":"Enshroud","c":3622,"j":39,"t":4,"l":80}},{"type":"quest","id":"69613","obj":{"i":69613,"n":"Thicker than Blood","g":165,"l":"Ul'dah","s":780,"f":1}}]}