{"quest":{"name":"The Adventurer with All the Cards","location":"The Gold Saucer","id":69617,"patch":5.55,"sort":10900,"eventIcon":71221,"issuer":1010448,"genre":93,"journal":["The Gold Saucer attendant's eyes light up at the sight of you.","According to the Gold Saucer attendant, the proprietor of the amusement park wishes to have words with you, and you are instructed to wait for him by the entrance to Card Square.","In recognition of the love you bear for Triple Triad as demonstrated in your magnificent card collection, Godbert Manderville awards you a special prize: the magicked card. Thus rewarded for your efforts, you look forward to many more rounds of card-battling fun to come."],"objectives":["Wait by the entrance to Card Square."],"dialogue":[{"name":"INFORMATION04081","text":"Ah, my <span class=\"alternative-container\"><span class=\"alternative\">lady</span><span class=\"alternative\">lord</span></span> <span class=\"highlight\">Forename</span>! Our proprietor has been wanting to have words with you!"},{"name":"INFORMATION04081","text":"I will send for him at once, if you would be so kind as to wait by the entrance to Card Square."},{"name":"GODBERT","text":"(-???-)Ah, there <span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> is─<span class=\"alternative-container\"><span class=\"alternative\">she</span><span class=\"alternative\">he</span></span> of strong-yet-tender fingers! Ever a sight for sore eyes─and knotted muscles─my friend."},{"name":"GODBERT","text":"You will be wondering why I wished to speak with you. The little birds told me, you see, that you are the owner of a magnificent collection of Triple Triad cards."},{"name":"GODBERT","text":"Wishing to behold it with mine own eyes, I bade my staff notify me when next you came here─and here you are. Now, would you be so kind as to show your cards to me?"},{"name":"GODBERT","text":"Heh heh, I've been looking forward to this..."},{"name":"GODBERT","text":"Oho, a very rare card indeed! You've done very well to obtain it."},{"name":"GODBERT","text":"...Hm? I make a point of knowing all cards, but this─this I do not know. There is something strangely <span class=\"emphasis\">otherworldly</span> about it..."},{"name":"GODBERT","text":"At any rate, the rumors did not exaggerate. One would have to go far to find someone who boasts lustier decks. Anyone who faces you is in for a stiff contest. Yes, very stiff indeed!"},{"name":"GODBERT","text":"I can only imagine the effort it must have taken to amass such a spectacular collection."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"Let's just say once is enough..."},{"name":"A1","text":"There was nothing to it!"},{"name":"GODBERT","text":"Ho ho ho, that even you should admit to struggling so. Yet no achievement is so sweet as that which tests your limits."},{"name":"GODBERT","text":"Ho ho ho, if anyone were to make it appear easy, 'twould, of course, be your good self."},{"name":"GODBERT","text":"Now, having marveled at your cards, I could not help but reflect upon how far this little game has come."},{"name":"GODBERT","text":"Transcending borders, it has spread to every corner of the world to bring joy to all regardless of differences such as race and creed."},{"name":"GODBERT","text":"And to imagine the epic journey it must have taken you upon─all the thrilling encounters you must have had─gives me more pleasure than words can well express!"},{"name":"GODBERT","text":"In recognition of your tremendous feat and the love you bear for the game, we wish to present you with a special prize."},{"name":"GODBERT","text":"Consider it but a small token of the great esteem in which we hold you."},{"name":"GODBERT","text":"Riding upon its pleasingly familiar form, may you continue to pursue new horizons in the world of Triple Triad!"}],"reward":{"items":[{"id":33689}]}},"partials":[{"type":"npc","id":"1010448","obj":{"i":1010448,"n":"Gold Saucer Attendant","l":1484,"q":2,"t":"Information"}},{"type":"item","id":"33689","obj":{"i":33689,"n":"Magicked Card","l":1,"c":27672,"t":63}}]}