{"quest":{"name":"On the Hunt","location":"Ul'dah","id":69611,"patch":6.0,"sort":730,"icon":101096,"unlocksFunction":1,"eventIcon":71341,"issuer":1036629,"target":1036629,"genre":165,"journal":["Drusilla is eager to get the voidsent hunt underway.","Sufficiently impressed with your growth, Drusilla declares you ready to face her voidsent nemesis, Orcus. Arnegis and Hermin, another of her trusted Lemures, tell of a woodcutter gone missing in the Central Shroud, and a man with pale skin and fiery eyes spotted nearby that matches Orcus's description. Before you can depart, however, Hermin voices concerns regarding your involvement in the secretive group's affairs, prompting Drusilla to reveal her personal history with the wicked voidsent, who murdered every member of her flesh-and-blood family. Acutely aware of the threat Orcus poses, Drusilla is willing to rely on any and every advantage, including the assistance of an outsider. With the matter settled, you depart for Bentbranch Meadows to begin the search for your murderous prey.","Arnegis explains that the woodcutter in question was last seen heading northwest of Bentbranch Meadows, and Drusilla unveils the means by which you will draw Orcus out into the open. She presents you with a blood-scented candle and a magitek transceiver, instructing you to light the former to draw out any nearby fiends. If Orcus happens to be among them, she asks you to call her on the transceiver so she can come to your aid.","The candle works just as well as Drusilla said, drawing out a slavering voidsent which you quickly dispatch. The monster does not appear to be Orcus, but does leave behind a blood-soaked ring. Arnegis may be able to shed some light on the nature of this trinket and how a voidsent would come into possession of it.","Drusilla tells you and Arnegis that she found a body hastily buried under some overgrowth─a body which matched the description of the woodcutter and bore the mark of a ring removed from its finger. It seems that the voidsent you drew forth from the woods killed the man to claim the object of its obsession. While Orcus is nowhere to be found, there is one less monster preying on defenseless souls. Arnegis leaves to apprise the Wood Wailers of what transpired, and Drusilla asks you to return with her to Lemures headquarters.<br><br>※You may re-enter Lemures headquarters by speaking with the loyal Lemure in Pearl Lane.","While the mood in Lemures headquarters is somber, Drusilla reminds you that the realm is safer for your efforts. Hermin chimes in to say that she found a promising bit of information while you were away that Arnegis is already investigating. His work is delicate, however, and will take some time to be completed to satisfaction. Drusilla bids you practice your trade further, so that when Orcus is finally found, victory will be all but assured.<br><br>※The next reaper quest will be available from Drusilla upon reaching level 75."],"objectives":["Speak with Arnegis at Bentbranch Meadows.","Use the candle at the designated location and slay any voidsent that appear.","Deliver the blood-soaked ring to Arnegis.","Speak with Drusilla at Lemures headquarters."],"dialogue":[{"name":"DRUSILLA","text":"Ah, there you are. Lookin' deadly enough with that scythe to make me weak at the knees."},{"name":"DRUSILLA","text":"I wager it's time we stopped faffin' about and made ready to hunt our target. My Lemures have been hard at work scrapin' together what information they can─let's see what they've got."},{"name":"DRUSILLA","text":"Everyone here? Good."},{"name":"DRUSILLA","text":"Arnegis you've met. No further chimera-related incidents, you'll be happy to hear. The overly chipper lass over there is Hermin. Make your acquaintances."},{"name":"DRUSILLA","text":"As you know, our quarry is a voidsent, and he goes by the name Orcus. He's eluded the best, but these two are a step above that. Tell us what you've found."},{"name":"HERMIN","text":"By your will, Boss. I asked around about unsolved murders and disappearances, seeing if any involved someone matching the description you provided."},{"name":"ARNEGIS","text":"There's as many missing people as there are grains of sand, and no shortage of tragedies either. One, however, stood out among the rest."},{"name":"ARNEGIS","text":"A woodcutter in the Black Shroud─disappeared without a trace. No body, no belongings, nothing. An odd enough occurrence by itself, but the sightings of a stranger with skin pale as snow near his last known whereabouts piqued our interest."},{"name":"DRUSILLA","text":"Now that's a promisin' start, but those woods are crawlin' with bandits and brigands of all sorts. Duskwights and Keepers are said to come in ghostly hues. Are we sure this man ain't one of them?"},{"name":"ARNEGIS","text":"As sure as I've ever been, Boss. Not many bandits have eyes the color of blood. It's a match too close to ignore."},{"name":"DRUSILLA","text":"Hmm... I can't gainsay that. We have a lead."},{"name":"HERMIN","text":"If I may, Boss. Are you sure we need the help of this...outsider? How much trouble could one voidsent be?"},{"name":"ARNEGIS","text":"Hermin! <span class=\"alternative-container\"><span class=\"alternative\">She's</span><span class=\"alternative\">He's</span></span> standing right there, for gods' sake!"},{"name":"DRUSILLA","text":"...No, she's right. I've always told you to turn a wary eye to those outside the family. She's just doin' her due diligence."},{"name":"DRUSILLA","text":"But trust me when I say we need every advantage we can afford. I made the mistake of misjudgin' Orcus's strength before, and for my hubris my family─my flesh-and-blood family─was slain. All of them."},{"name":"DRUSILLA","text":"Was plannin' on holdin' that back a bit longer, but aye, 'twas before the Lemures. I swore two things: I'd repay that sufferin' a thousandfold, and I'd never let that bastard take anythin' from me again. I mean to keep my vow─and I trust I can count on you to help."},{"name":"HERMIN","text":"You don't have to ask twice, Boss. Your wounds are our wounds, even the ones that become scars. We'll see your vengeance wrought."},{"name":"DRUSILLA","text":"All these years I've scraped to make a place for us, I looked forward to the day he'd pay his dues."},{"name":"DRUSILLA","text":"And it ain't just for me that we have to hunt him down, either. He's a blight on Eorzea itself, and the longer we let it fester, the more suffering it'll spread."},{"name":"DRUSILLA","text":"We need to corner him now, while we have the chance. Are you ready, <span class=\"highlight\">Forename</span>? You know those woods as well as any of us, and we'll need your experience if we hope to be back before supper. "},{"name":"DRUSILLA","text":"Much appreciated."},{"name":"DRUSILLA","text":"All right, let's get to it then. Hermin, I want you here in Ul'dah, keepin' your ear to the ground for any news of Orcus's movements. Arnegis, you lead us to where this woodcutter disappeared."},{"name":"ARNEGIS","text":"By your will, Boss. That'd be the Central Shroud, so our best course would be to set off from Bentbranch Meadows."},{"name":"HERMIN","text":"Not all of us can be reapers, but not for lack of bloodlust. If I had the knack, we'd have Orcus's head on the wall by now..."},{"name":"HERMIN","text":"I hope you appreciate the significance of what the boss's shared with you. Most Garleans don't even know the reapers exist, let alone have the honor to call themselves one."},{"name":"DRUSILLA","text":"Orcus is an accursed name, feared from Garlemald to Ala Mhigo. I hear tell the people of Gyr Abania bestowed it on a fiend that feasts on the bones of man, so much does it reek of evil incarnate."},{"name":"ARNEGIS","text":"Good, you made it. Before we set off, allow me to share the circumstances of our poor woodcutter's disappearance."},{"name":"ARNEGIS","text":"As I heard it, he disappeared nigh on a week ago. Got lost, some surmise, but he was a seasoned woodsman, not some highborn traveler who forgot to buy a map."},{"name":"ARNEGIS","text":"I questioned those closest to him, and none could think of a reason he might want to make himself scarce. He'd even made plans to meet with friends not long from now, but I expect that promise will go unkept."},{"name":"DRUSILLA","text":"It sounds like we can rule out a voluntary departure."},{"name":"ARNEGIS","text":"I believe we can. The last person to see the man alive said he took his axe and ventured northwest."},{"name":"DRUSILLA","text":"Then that's where we'll set our trap."},{"name":"DRUSILLA","text":"Here, <span class=\"highlight\">Forename</span>, take these. A magitek transceiver and candle that's scented like a voidsent's favorite libation: blood."},{"name":"DRUSILLA","text":"Once it's lit and the fumes are waftin' through the air, every voidsent within thirty yalms'll come runnin'. If either of us sees Orcus, let's give the other a shout over the transceiver."},{"name":"DRUSILLA","text":"As I said before, Orcus is inhabitin' the body of a man, and he can put on an awfully convincin' performance when needs must. Don't give him a chance to work his wiles, or his fangs'll be in your neck before you know it."},{"name":"ARNEGIS","text":"As much as I want to accompany you, I'd only be a liability in a fight. Whether you find Orcus or not, return here and I'll report back to the Lemures. Good luck and good huntin'."},{"name":"ARNEGIS","text":"The boss painted a bloodcurdling picture of Orcus...skin pale as the moon and eyes like hellfire. I wouldn't want to run into such a beast on a dark night─or on a sunny day, for that matter."},{"name":"SYSTEM","text":"The stench of blood chokes the air, filling your nostrils with its metallic aroma..."},{"name":"SYSTEM","text":"Drawn by the maleficent odor, a voidsent rises from the underbrush. Though it bears no resemblance to Orcus, it eyes you with a voracious hunger..."},{"name":"SYSTEM","text":"...However, no ghostly fiends or slavering creatures emerge from the underbrush. If there are voidsent nearby, they must not be hungry."},{"name":"ARNEGIS","text":"I'm glad to see you in one piece. Now, what's that you have in your hand?"},{"name":"ARNEGIS","text":"Hmm... You said the voidsent was carrying this?"},{"name":"DRUSILLA","text":"That ring... Where'd you find it?"},{"name":"DRUSILLA","text":"I see. Then there can be no doubt."},{"name":"DRUSILLA","text":"The voidsent that <span class=\"highlight\">Forename</span> slew is the very same one that murdered our woodcutter."},{"name":"ARNEGIS","text":"Murdered? Are you saying...?"},{"name":"DRUSILLA","text":"Aye, while I was searchin' for a place to set my trap, I spotted a shallow grave, hastily dug and poorly hidden."},{"name":"DRUSILLA","text":"Under a thin layer of dirt was a body matchin' the description of the woodcutter. A wholly nondescript fellow, save for the mark of a ring removed from his finger."},{"name":"DRUSILLA","text":"Doubtless that ring was his demise. Shiny baubles are a common fixation for voidsent─probably didn't spare a thought for the owner, only the prize. I suppose we can take comfort in the knowledge that it'll harm no one else."},{"name":"ARNEGIS","text":"Orcus or not, I'd say this expedition was a success after a fashion. I should apprise the Wailers of what's transpired─you two catch some well-earned rest."},{"name":"DRUSILLA","text":"Thank you kindly, Arnegis."},{"name":"DRUSILLA","text":"Well then, I'll see you back at headquarters."},{"name":"HERMIN","text":"And there I thought this would finally be over. When Arnegis has a lead, we're usually toasting our kill the day after. But these are exceptional circumstances..."},{"name":"DRUSILLA","text":"Maybe we didn't get the satisfaction I promised, but sittin' here with our heads in our hands won't do us any good. Let's be happy with one less voidsent preyin' on helpless woodcutters."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"The only good voidsent is a dead voidsent."},{"name":"A1","text":"Orcus will pay for what he did."},{"name":"DRUSILLA","text":"Hear, hear. Nothin' comes of their endless hunger for aether but bloodshed and tragedy."},{"name":"DRUSILLA","text":"Heh, glad to see a passion for our mission. Apologies we couldn't make your first outin' more memorable."},{"name":"DRUSILLA","text":"We were on the cusp of endin' two decades of misery. That's how long ago Orcus came into this world, ragin' like an animal free from his cage, and leavin' my family dead in his wake. "},{"name":"DRUSILLA","text":"The grief he's caused since then is immeasurable. No matter where his accursed feet take him, his hunger follows, and the realm bleeds to sate it."},{"name":"DRUSILLA","text":"'Course, we aren't the only ones huntin' him. But he's as clever as he is vicious, and not even the finest trackers have been able to keep on his trail for long."},{"name":"HERMIN","text":"Don't lose heart yet, Boss. While you were away, I was making the rounds, and I might've found something that'll soon bear fruit. Arnegis is following up on it as we speak."},{"name":"DRUSILLA","text":"I swear, someday that man is going to keel over on my account. Still, there's no one else I'd trust to tell me the difference between truth and hysteria."},{"name":"DRUSILLA","text":"That bein' said, his work takes time to do right. Use this chance to hone your skills, and if all goes to plan, next time we speak you'll have a golden opportunity to test them."}],"reward":{"gil":1848},"reqs":{"jobs":[{"lvl":73,"id":180}],"quests":[69610]},"next":[69612]},"partials":[{"type":"npc","id":"1036629","obj":{"i":1036629,"n":"Drusilla","l":4022,"q":4}},{"type":"quest","id":"69610","obj":{"i":69610,"n":"The Harvest Begins","g":165,"l":"Ul'dah","s":701,"f":1}},{"type":"quest","id":"69612","obj":{"i":69612,"n":"Dark Days","g":165,"l":"Ul'dah","s":750,"f":1}}]}