{"quest":{"name":"A Treat to Beat the Heat","location":"Eastern La Noscea","id":69619,"patch":5.5,"sort":211,"icon":101062,"eventIcon":71221,"issuer":1035619,"target":1035619,"genre":201,"journal":["Nekeke has a mind to whip up the finest frozen dessert you've ever laid eyes on.<br>※This quest is available for a limited time only.","Nekeke thanks you again for dispatching the Bombard menace she unwittingly brought upon Costa del Sol. Free to finally perform the duties for which she was summoned, she takes to the kitchen to begin work on her latest masterpiece. In the meantime, she encourages you to go for a stroll on the beach with P'obyano, as well as to share news of her progress with Master Gegeruju if you are so inclined.<br><br>※Please note that you will be unable to complete this quest after the seasonal event has ended. For details, please check the Lodestone.","After thanking you once more for your efforts, P'obyano shares with you a tale of her and Nekeke's past. Friends since childhood, the two have long looked up to adventurers─and in fact chose to pursue their current professions as a tribute to those like you who keep the people of Eorzea safe. The time having passed by in an instant, you suppose that Nekeke might be finished with her task.","You return to Nekeke, who cheerfully announces that the dessert that is to serve as the highlight of this year's festivities is all but complete. Waiting eagerly with your friends, you are swept away by the masterfully fashioned confection, as well as by the snow shower summoned from the skies somehow by Nekeke's frosty, fluffy companions─one of whom, surprisingly enough, seems determined to join you on your adventures. With all coming to a triumphant end, you wish Nekeke and your friends well and stride forth to enjoy the festivities as they commence in earnest."],"objectives":["Speak with the people of Costa del Sol.","Speak with Nekeke."],"dialogue":[{"name":"POBYANO","text":"It appears we were able to dispatch the Bombard before a panic broke out at the beach. That's a relief, to say the least."},{"name":"NEKEKE","text":"Oh, <span class=\"highlight\">Forename</span>! I can't thank you enough. Were it not for you, I'd have been too busy running for my life to even think of making Master Gegeruju's dessert."},{"name":"NEKEKE","text":"But all's well that ends well, and finally I can get down to what I was brought here to do! I promise you I'll be done before you know it, so why don't you and P'obyano entertain yourselves for the time being."},{"name":"NEKEKE","text":"Ah, and while you're at it, perhaps you could call Master Gegeruju as well. I'm sure he's more eager than any to see my masterpiece take form!"},{"name":"NEKEKE","text":"Genius can't be rushed, my friend. Why don't you and P'obyano have a little chat in the meantime? I promise I'll be done in two swishes of a chocobo's tail."},{"name":"HAERMAGA","text":"Ah, <span class=\"highlight\">Forename</span>! Truly impressive the way you chased off that Bombard. Not that I'd expected any less of you, of course."},{"name":"HAERMAGA","text":"Ah, <span class=\"highlight\">Forename</span>! Truly impressive the way you chased off that Bombard. Why, one would never imagine that this was your first time taking part in the festivities."},{"name":"HAERMAGA","text":"Thanks to you, I think we can safely say the guild's put on another impressive show this year. It's only a matter of time before our halls are overflowing with aspiring adventurers. Talk about making the best of a bad situation!"},{"name":"HAERMAGA","text":"Speaking of which, I heard Nekeke's nigh done with her delightful creation. I don't know about you, but I'm most eager to taste it myself─believe it or not, I have something of a sweet tooth!"},{"name":"HAERMAGA","text":"We should round up Thracie and R'fhul Tia as well. Ah, but leave that to me─I daresay you've earned yourself a respite. Why not enjoy a walk on the beach while you're waiting?"},{"name":"GEGERUJU","text":"What's this you say? The fiends have been dispatched, and my prized dessert is ready for the tasting? Why didn't you tell me sooner!"},{"name":"GEGERUJU","text":"Oho! If it isn't the ever-resourceful and oh-so-forgiving adventurer who we so ignominiously tasked with gathering ingredients for our banquet."},{"name":"GEGERUJU","text":"What's this you say? The fiends have been dispatched, and my prized dessert is ready for the tasting? Why didn't you tell me sooner!"},{"name":"GEGERUJU","text":"Nekeke's confections are said to be the sweetest and most sublime in all of Eorzea! I can scarcely wait to see what genius she's whipped up this time!"},{"name":"POBYANO","text":"Ah, <span class=\"highlight\">Forename</span>! Again, I thank you for your efforts in helping us dispatch the Bombards."},{"name":"POBYANO","text":"To think that such a calamity would befall us on the eve of the festivities! But pray don't be too hard on Nekeke. She meant only to please, as she always has."},{"name":"POBYANO","text":"...Oh. In all the confusion, I forgot to mention it, but she's actually a childhood friend of mine. We used to play together by the shore, and one day, we were set upon by a vicious monster."},{"name":"POBYANO","text":"We thought we were done for, but were saved in the nick of time by a kindly adventurer who swiftly dispatched the beast and whisked us away to safety. That's when I vowed that one day I'd serve the guild and repay my debt to the brave soul who rescued me."},{"name":"POBYANO","text":"Meanwhile, Nekeke was a genius in the kitchen since she was just a girl. She chose the path of a culinarian in hopes of filling the bellies of adventurers all over with nourishing and toothsome snacks."},{"name":"POBYANO","text":"In the end, she found her calling making sweets─as opposed to the sort of hearty meals that you and I might favor─but that's rather fitting for her. She's always had an independent streak, after all."},{"name":"POBYANO","text":"In any event, she's positively overjoyed that her latest creation will be presented front and center at the faire, for adventurers all over to enjoy."},{"name":"POBYANO","text":"More than anything, I'm just glad she's back with us, safe and sound."},{"name":"POBYANO","text":"I'm just glad Nekeke is back with us, safe and sound. Until the next time she decides to venture off in search of some rare ingredient, at least..."},{"name":"NEKEKE","text":"Oh, it's you! You couldn't have come at a better time─I was just putting the finishing touches on my masterpiece. Pray wait for just a moment, won't you?"},{"name":"NEKEKE","text":"Adventurers, Eorzeans, faire-goers, friends! I am most proud to present my latest creation. I call it Costa del Hielo, and I promise you that it will please your tongue even more than it does your eyes!"},{"name":"NEKEKE","text":"And to make sure that it doesn't melt─as well as to help all of you stay cool amidst the scorching heat, I leave you with a present from my furry friends!"},{"name":"NEKEKE","text":"Ah, <span class=\"highlight\">Forename</span>. Well? Did my dessert agree with you? After all the trouble I put you through, one can only hope so..."},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"It was more than worth the trouble."},{"name":"A1","text":"Your friends put on quite the show."},{"name":"A1","text":"It was simply sublime."},{"name":"NEKEKE","text":"Now that's a relief to hear! If it provided you with true refreshment after all your travails─why, as a confectioner and culinarian, nothing would make me happier."},{"name":"NEKEKE","text":"Speaking of which...I had meant to tell you. Ever since you chased off those Bombards, my little friend here hasn't been able to take her eyes off you. Just look at her face─it's as if she's saying, “Oh, <span class=\"alternative-container\"><span class=\"alternative\">Miss</span><span class=\"alternative\">Mister</span></span> Adventurer, what I wouldn't give to join you in your travels!”"},{"name":"NEKEKE","text":"Oh, truly? How kind you are! She'll be most wonderful company on the road─I promise you that."},{"name":"NEKEKE","text":"And with that, I'd best get back to the kitchen. After all, adventurers from all corners of the realm have come to taste my latest, greatest creation. Until we meet again, a happy Moonfire Faire to you!"},{"name":"SYSTEM","text":"Thanks to your efforts, peace has returned to the beaches of Costa del Sol, and the festivities can commence in earnest. That is, until the Bombard menace rears its ugly head..."},{"name":"SYSTEM","text":"You may now purchase wares from the Moonfire Faire vendor. Participate in the FATE appearing in the southeastern region of the faire grounds to earn vouchers that can be exchanged for goods."}],"reward":{"items":[{"id":33686}]},"reqs":{"jobs":[{"lvl":30,"id":1}],"quests":[69618]}},"partials":[{"type":"npc","id":"1035619","obj":{"i":1035619,"n":"Nekeke","l":32,"q":1}},{"type":"item","id":"33686","obj":{"i":33686,"n":"Polar Bear Horn","l":1,"c":26038,"t":63}},{"type":"quest","id":"69618","obj":{"i":69618,"n":"Unseasonable Chills","g":201,"l":"Limsa Lominsa","s":210}}]}