{"quest":{"name":"Dark Days","location":"Ul'dah","id":69612,"patch":6.0,"sort":750,"icon":101096,"unlocksFunction":1,"eventIcon":71341,"issuer":1036629,"target":1036629,"genre":165,"journal":["Drusilla is awaiting word from Arnegis.","Headquarters is relatively quiet while the Lemures continue the work of ascertaining Orcus's whereabouts, until the ever-watchful door guard bursts in, and between ragged breaths delivers the tragic news that Arnegis's body has been found by the Brass Blades. Without a word, Drusilla departs for Erralig's Burial Chamber, leaving her family without a leader. It falls to you to follow, and remind her of the duty she owes to those who yet live.","You find Drusilla at Erralig's Burial Chamber, where she demands the attendant priest allow her to see Arnegis's body. In the face of Drusilla's anger, he agrees to forgo custom─though upon viewing the remains of her comrade, she forbids you from doing the same. Her rage seemingly spent, the reaper explains that there is someone to whom she must speak before returning to headquarters. You are invited to accompany her to Stonesthrow, provided you do so in silence.","In Stonesthrow, Drusilla performs the grim duty of informing Arnegis's wife of his death. Though the woman weeps for him, she speaks with no hint of reproach toward her husband's leader, asking only that he be avenged. Before returning to headquarters, Drusilla requests a word with you out of sight of prying eyes.","Drusilla apologizes for not divulging her prior history with Orcus from the start, and reiterates her commitment to seeing him utterly destroyed. As you express the same, you feel a shiver run down your spine, and turn to see a man with pale skin and sanguine eyes─Orcus himself. Drusilla seizes the opportunity to strike, but Orcus dodges her blow with ease, before fixing you with a ravenous gaze. The slavering fiend describes your soul in uncomfortable detail, proclaiming it the most delicious he has ever seen. Upon declaring his intent to see it suffused with terror and hatred ere he returns to feast, the voidsent vanishes, leaving you and Drusilla alone on the bridge.","Drusilla curses herself for failing to deal Orcus a killing blow then and there. Regaining her composure, she bids you return to Lemures headquarters to discuss your next move.<br><br>※In the event that you leave Lemures headquarters, you may re-enter by speaking with the loyal Lemure in Pearl Lane.","In the safety of Lemures headquarters, Drusilla confirms Orcus's words: the voidsent who covets your soul inhabits the body of Drusilla's grandfather, rendered youthful through dark arts. The reaper further explains that Orcus feasts on the souls of those that he kills, absorbing their aether to sate his endless appetite. Although Drusilla is unsure how to proceed, she warns you to take special care as you go about your affairs, for Orcus may be lurking around any corner.<br><br>※The next reaper quest will be available from Drusilla upon reaching level 78."],"objectives":["Speak with Drusilla in front of Erralig's Burial Chamber.","Speak with Drusilla in Stonesthrow.","Speak with Drusilla.","Speak with Drusilla again.","Speak with Drusilla at Lemures headquarters."],"dialogue":[{"name":"HERMIN","text":"No word yet from Arnegis, <span class=\"highlight\">Forename</span>. I've always admired his thoroughness─me, I don't have the patience for that sort of work. That's why he's the brains and I'm the muscle."},{"name":"DRUSILLA","text":"Apologies, <span class=\"highlight\">Forename</span>, but we're still waitin' on Arnegis to come through. There's not much for you to do around here until then, unless you have a knack for cleanin'."},{"name":"DRUSILLA","text":"Hermin is good at wheedlin' out promisin' stories and whatnot, but gettin' to the truth of those stories is a craft as delicate as weavin'. I'm sure you've seen firsthand how one bad bit of information can lead to elaborate plans comin' apart at the seams."},{"name":"LEMURESMEMBERA","text":"Boss! Boss!"},{"name":"DRUSILLA","text":"Calm down, lad. Breathe. What's gotten into you?"},{"name":"LEMURESMEMBERA","text":"It's Arnegis! He's... He's been murdered!"},{"name":"HERMIN","text":"What!? Tell me I heard that wrong!"},{"name":"LEMURESMEMBERA","text":"I'm afraid not. The Brass Blades found him half-buried in the sands not bells ago, just...just lying there like some bloody animal carcass. They're bringing him to Erralig's Burial Chamber as we speak."},{"name":"HERMIN","text":"Whoever did this doesn't know the reckoning they've got coming! Before I'm done with them they'll be begging to crawl back into their mother's womb!"},{"name":"LEMURESMEMBERA","text":"I want justice as much as you, Hermin, I do...but it's times like these we need to look to the boss for guidance."},{"name":"LEMURESMEMBERA","text":"As you can see, <span class=\"highlight\">Forename</span>, emotions are running high. I should stay here until Hermin cools off. Can you let the boss know we're standing by and waiting for her command? Like as not she's gone to pay her respects."},{"name":"HERMIN","text":"It won't be enough to kill who did this, oh no... I'm going to make them scream for the next Calamity to come and end their suffering!"},{"name":"LEMURESMEMBERA","text":"I'm not sure how long I can keep Hermin from rushing off to take vengeance. Please, go and find the boss. We need a plan, and I know I'm not the one to make it."},{"name":"DRUSILLA","text":"Sorry, <span class=\"highlight\">Forename</span>. I ain't in the mood for chitchat..."},{"name":"DRUSILLA","text":"Where's the bloody keeper!?"},{"name":"NALDTHALPRIEST","text":"My lady, prithee... The dead must be let to rest."},{"name":"DRUSILLA","text":"The dead're goin' to have one more among 'em if you don't shut yer trap and listen! The Brass Blades brought in a body not long ago. Show me to it."},{"name":"NALDTHALPRIEST","text":"Ah, yes, that they did, but are you the deceased's family? If not, I am afraid we cannot─"},{"name":"DRUSILLA","text":"Family? Family!? Arnegis was like a son to me!"},{"name":"NALDTHALPRIEST","text":"<span class=\"emphasis\">Like</span> a son...? Ordinarily that would be... Ahem. He is interred in the innermost coffin. However, I must advise you not to gaze upon the body..."},{"name":"NALDTHALPRIEST","text":"Mada─ ...Ah. If she insists, then so be it..."},{"name":"DRUSILLA","text":"Godsdammit, Arnegis, I told you not to go and get yourself─"},{"name":"DRUSILLA","text":"...Don't, <span class=\"highlight\">Forename</span>. This isn't for you."},{"name":"DRUSILLA","text":"I'm sorry for bargin' in here and for all the bluster. If you can forgive my rudeness, promise me that Arnegis gets sent off well and proper."},{"name":"NALDTHALPRIEST","text":"Of course he shall be. However, if you wish to inter him within the city gates, well... Such sought-after space comes at no small expense."},{"name":"DRUSILLA","text":"I don't care what it costs. Just send your man to Lemures headquarters to collect what you require."},{"name":"DRUSILLA","text":"<span class=\"highlight\">Forename</span>, I appreciate you comin' to find me, but there's someone else I have to speak with first."},{"name":"DRUSILLA","text":"I'm headin' to Stonesthrow. Come along if you please, but...come along in silence."},{"name":"NALDTHALPRIEST","text":"The departed must not be looked upon. That is our creed, a sacred rule that must never be broken. We urge all bereaved to follow suit, but sometimes..."},{"name":"DRUSILLA","text":"This is where Arnegis's dear wife earns her livin'. Best get this over with."},{"name":"ARNEGISWIFE","text":"Arnegis never forgot the debt he owed you. The debt we both owed you. Even so, his loyalty ran even deeper than that."},{"name":"ARNEGISWIFE","text":"It's a strange thing, to look back on the people we were. A decade younger and a lifetime more foolish. Young lovers, proud patriots, blissfully ignorant, returning to Locus Amoenus, the cradle of our people..."},{"name":"ARNEGISWIFE","text":"A triumphant homecoming for the Garleans after centuries in exile. The once-mighty invaders had been laid low and driven back whence they came, and it was a banner day when Arnegis was honored with a post there."},{"name":"ARNEGISWIFE","text":"The honor and pride quickly faded when we saw the truth of Locus Amoenus. We hadn't just defeated our enemies─we had clapped them in irons and condemned them to a life of servitude."},{"name":"ARNEGISWIFE","text":"Descendants of those who'd driven our ancestors north so many generations ago, made to pay for the crimes of their forebears. His superiors were certainly pleased with the poetry of it all."},{"name":"ARNEGISWIFE","text":"Arnegis, however, could not simply look away from their suffering, let alone take pleasure in it. Confronted with the reality of the place we would call home, his conscience demanded he take action."},{"name":"ARNEGISWIFE","text":"He began cooperating with the resistance, but the eyes of the Frumentarium are all-seeing, and before long he was ousted as a sympathizer. 'Twas only by the grace of good fortune that we escaped with our lives."},{"name":"ARNEGISWIFE","text":"I've often lain awake at night, wondering if he had outlived his usefulness to the resistance. Or perhaps it was a petty senior officer that orchestrated our fall."},{"name":"ARNEGISWIFE","text":"Regardless of the cause, the outcome was the same: we could never return to the Empire. We fled to Eorzea by way of Radz–at–Han, the only route open to us."},{"name":"DRUSILLA","text":"Wasn't soon after steppin' foot on the docks of Limsa Lominsa that your luck ran out, as I recall. Stopped by Yellowjackets and accused of bein' imperial spies."},{"name":"ARNEGISWIFE","text":"Aye, but we still managed to make an escape. We ran and ran, terrified that our pursuers would one day catch up to us."},{"name":"ARNEGISWIFE","text":"That is, until we met you. Had you not taken us under your wing when you did, I shudder to imagine our fate."},{"name":"DRUSILLA","text":"Your gratitude's the last thing I deserve, lass. If I hadn't sent Arnegis off on my damned fool's errand, he'd still be alive."},{"name":"DRUSILLA","text":"It was Orcus that killed him, and no mistake. He died for my vengeance. I can't tell you how sorry I am..."},{"name":"ARNEGISWIFE","text":"No, you needn't apologize. I know...I know he was happy. So long as he was helping you, he was happy."},{"name":"ARNEGISWIFE","text":"The blame for his death doesn't rest on your shoulders. It rests on the man─the <span class=\"emphasis\">monster</span>─that murdered him in cold blood, and I expect you to see he answers for this crime. For me, and...for Arnegis..."},{"name":"DRUSILLA","text":"I will, lass. I will. On this I swear everythin' that I have to swear."},{"name":"DRUSILLA","text":"We need to talk, <span class=\"highlight\">Forename</span>. Somewhere with fewer pryin' eyes. Come meet me at the bridge to the north."},{"name":"ARNEGISWIFE","text":"My beloved... Would that I could've been by your side..."},{"name":"DRUSILLA","text":"I owe you an apology, <span class=\"highlight\">Forename</span>. For not tellin' you everythin' about me and Orcus from the start."},{"name":"DRUSILLA","text":"I dragged you into a fight against a foe that's cunnin', brutal, and utterly merciless. I thought with all of us together, we'd tip the scales in our favor."},{"name":"DRUSILLA","text":"But I was wrong, and Arnegis paid the price for my hubris."},{"name":"DRUSILLA","text":"That voidsent we tracked in the Black Shroud was likely one of Orcus's minions, but I was too caught up in my grand scheme to realize it at the time."},{"name":"DRUSILLA","text":"I should've thought about why it tried to hide that body. Your common voidsent wouldn't have the guile to bury a kill. But what if Orcus taught it that as a way to throw trackers off its scent─and to dangle bait for me and mine?"},{"name":"DRUSILLA","text":"Orcus has used that same trick in the past, and he knows that we know it too. By dispatchin' his minion, we drew his attention. Arnegis was a warnin'."},{"name":"DRUSILLA","text":"Orcus doesn't give his prey swift deaths. He toys with 'em, cuts into 'em...and savors the screams. That's how I knew he was responsible─it's like a signature, the way he leaves the bodies when he's had his fill. I only pray Arnegis doesn't take that sufferin' with him to the next life."},{"name":"DRUSILLA","text":"Orcus'll be comin' for you or me next. Not right away, though. That'd be givin' up the game. He wants us to keep lookin' over our shoulders, sleepin' with one eye open. He'll wear us down without even liftin' a finger."},{"name":"DRUSILLA","text":"And when he finally strikes, we'll be dead on our feet─playthings for him to do with as he pleases. That won't do. We need to bring the fight to him─no more waitin' around for a lead to come to us. It won't be easy, but...can I still count on your help?"},{"name":"Q1","text":"What will you say?"},{"name":"A1","text":"For Arnegis."},{"name":"A1","text":"I've come this far. Might as well go the rest of the way."},{"name":"DRUSILLA","text":"...Thank you, <span class=\"highlight\">Forename</span>."},{"name":"DRUSILLA","text":"And if you've got no qualm riskin' life and limb to fight for Arnegis─to fight for me─then I've got no qualm callin' you a member of my family."},{"name":"ORCUS","text":"(-???-)Family... A curious word, that..."},{"name":"DRUSILLA","text":"Bloody─ It's him, <span class=\"highlight\">Forename</span>! Orcus!"},{"name":"ORCUS","text":"Some persistent rats were nibbling at my tail. I should've known by their stench it was you and yours, Drusilla. Or should I call you... "},{"name":"ORCUS","text":"...Granddaughter?"},{"name":"DRUSILLA","text":"Shut your mouth, you thrice-damned monster!"},{"name":"ORCUS","text":"Monster? Is that any way to greet a beloved elder? Children these days..."},{"name":"ORCUS","text":"It seems one death wasn't punishment enough for you. A second should suffice for this scant remainder of your being..."},{"name":"DRUSILLA","text":"<span class=\"highlight\">Forename</span>, we're endin' this here and now! Follow my lead!"},{"name":"ORCUS","text":"I thought we might savor our reunion for a while longer. But if you insist, I shall feast upon your beating heart here and now!"},{"name":"DRUSILLA","text":"Die!"},{"name":"ORCUS","text":"Ah. Naught but dregs left in that desiccated vessel of yours. Too long has the hide been left in the sun..."},{"name":"ORCUS","text":"But your “family” has been replenished with fresh blood, I see."},{"name":"ORCUS","text":"My, my, and what a bounteous soul this one has!"},{"name":"ORCUS","text":"Your scythe may be dull, but your eye is as sharp as ever."},{"name":"ORCUS","text":"Blinding as the sun, pure as the snow... Heh heh heh..."},{"name":"ORCUS","text":"Delectable as a boar slathered in grease!"},{"name":"ORCUS","text":"I had thought to make a quick meal of you, but perhaps, just this once, forbearance is in order."},{"name":"ORCUS","text":"Such a singular specimen must be given time to fatten, to fulfill its succulent potential. 'Twould be a travesty to consume you ere you achieve perfection!"},{"name":"ORCUS","text":"When your soul is ripe with fear, swollen with hatred, and fit to burst with despair, I shall return for you, <span class=\"highlight\">Forename</span>. And I shall gorge!"},{"name":"ORCUS","text":"Until that time, sup well, my growing whelp!"},{"name":"DRUSILLA","text":"Curse these old bones...he was right in front of me! I could've ended it in one swing!"},{"name":"DRUSILLA","text":"For a moment─just one moment!─I saw it all again. My family, slaughtered, lying at his feet. My life, slipping away... And that was enough."},{"name":"DRUSILLA","text":"Doubtless you have more than a few questions. I'll answer them, I promise, but now's not the time. Trust me."},{"name":"DRUSILLA","text":"Standin' around kickin' the sand won't change what's done. Let's return to headquarters and let the wind cool our heads, then we can consider our next course of action."},{"name":"HERMIN","text":"The boss told me everything. That bastard Orcus is going to get what's coming to him. He thinks he knows pain? Well, he hasn't met me!"},{"name":"DRUSILLA","text":"It was my own fault. If I hadn't stood there slack-jawed, if I wasn't so damned slow, we'd be rid of that abomination once and for all."},{"name":"DRUSILLA","text":"...What you saw <span class=\"emphasis\">used</span> to be my grandfather, before Orcus took over. He looks green enough to be my own grandchild now. Trick of the void, like as not."},{"name":"DRUSILLA","text":"It's no secret that if a voidsent doesn't want to devour you, it probably wants to take possession of your flesh, but Orcus has a particular talent for it."},{"name":"DRUSILLA","text":"And as you doubtless surmised, he's got an insatiable cravin' for aether. Killin' is only a prelude to the act of gulpin' down our essence, like a draught of ale after a day's work."},{"name":"DRUSILLA","text":"He's old─I can't say exactly how old─and he's acquired a taste for the finer things. Seems your soul counts among the finest he's ever seen. Things just keep gettin' better for us, don't they?"},{"name":"Q2","text":"What will you say?"},{"name":"A2","text":"Wouldn't be the first time someone set their sights on my soul."},{"name":"A2","text":"He can keep his bloody fangs to himself."},{"name":"DRUSILLA","text":"Is that so? Used to bein' a prize pig, are we?"},{"name":"DRUSILLA","text":"Heh, truth be told, you don't seem nearly as frightened as I would've thought. Guess it's better to be prized for somethin' than nothin', eh?"},{"name":"DRUSILLA","text":"Anyroad, it's clear that safety is no longer somethin' we can take for granted. Not even in a crowded street, not even in the middle of the day. Keep your eyes peeled, and watch out for those terrible red eyes."},{"name":"DRUSILLA","text":"We're sittin' chocobos for the moment, but I'll think of somethin' and send for you as soon as I can. Until then...never sleep far from your scythe."}],"reward":{"gil":1556},"reqs":{"jobs":[{"lvl":75,"id":180}],"quests":[69611]},"next":[69613]},"partials":[{"type":"npc","id":"1036629","obj":{"i":1036629,"n":"Drusilla","l":4022,"q":4}},{"type":"quest","id":"69611","obj":{"i":69611,"n":"On the Hunt","g":165,"l":"Ul'dah","s":730,"f":1}},{"type":"quest","id":"69613","obj":{"i":69613,"n":"Thicker than Blood","g":165,"l":"Ul'dah","s":780,"f":1}}]}